{
    "url": "monism",
    "title": "Monism",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "Jonathan Schaffer\n<jonathan.schaffer@rutgers.edu>",
        "author_links": [
            {
                "http://philosophy.rutgers.edu/for-faculty/385-schaffer-jonathan": "Jonathan Schaffer"
            },
            {
                "mailto:jonathan%2eschaffer%40rutgers%2eedu": "jonathan.schaffer@rutgers.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\n<a href=\"http://philosophy.rutgers.edu/for-faculty/385-schaffer-jonathan\" target=\"other\">Jonathan Schaffer</a>\n&lt;<a href=\"mailto:jonathan%2eschaffer%40rutgers%2eedu\"><em>jonathan<abbr title=\" dot \">.</abbr>schaffer<abbr title=\" at \">@</abbr>rutgers<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Mar 19, 2007",
        "substantive revision Mon Dec 10, 2018"
    ],
    "preamble": "\n\nThere are many monisms. What they share is that they attribute\noneness. Where they differ is in what they target\nand how they count.\n\nThis entry focuses on two of the more historically important monisms:\nexistence monism and priority monism. Existence\nmonism targets concrete objects and counts by tokens. This is the\ndoctrine that exactly one concrete object token exists. Priority\nmonism also targets concrete objects but counts by basic tokens. This\nis the doctrine that exactly one concrete object token is basic, and\nis equivalent to the classical doctrine that the whole is prior to its\n(proper) parts.\n\nFor roughly a century, neither existence nor priority monism was\naccorded much respect, nor were they even properly distinguished.\nIndeed, the tradition associated with these doctrines was long\ndismissed as being somewhere between obscure and ridiculous. But\nattitudes have evolved, because there are serious arguments for such\nmonisms. Priority monism may especially deserve serious\nreconsideration.\n\nThough this entry will focus on existence monism and priority monism,\nthere are of course other historically important monisms, including\nsubstance monism. Substance monism targets concrete objects\nand counts by highest types. This is the doctrine that all concrete\nobjects fall under one highest type (perhaps material, or mental, or\nsome neutral underlying type: here the way divides). This topic is\ncovered elsewhere in the encyclopedia (Robinson 2011).\n",
    "toc": [
        {
            "#Moni": "1. Monisms"
        },
        {
            "#ManyMoni": "1.1 Many monisms"
        },
        {
            "#ImpoExam": "1.2 Important examples"
        },
        {
            "#ExisMoni": "2. Existence Monism"
        },
        {
            "#Over": "2.1 Overview"
        },
        {
            "#Argu": "2.2 Arguments"
        },
        {
            "#MoorTrui": "2.2.1 Moorean truisms"
        },
        {
            "#ExclArgu": "2.2.2 An exclusion argument"
        },
        {
            "#OntoVagu": "2.2.3 Ontological vagueness"
        },
        {
            "#PrioMoni": "3. Priority Monism"
        },
        {
            "#OverPrio": "3.1 Overview"
        },
        {
            "#Form": "3.1.1 Formulation"
        },
        {
            "#Prio": "3.1.2 Priority"
        },
        {
            "#Tili": "3.1.3 Tiling"
        },
        {
            "#ArguPrio": "3.2 Arguments"
        },
        {
            "#CommSens": "3.2.1 Common sense"
        },
        {
            "#QuanEmer": "3.2.2 Quantum emergence"
        },
        {
            "#AtomGunk": "3.2.3 Atomless gunk"
        },
        {
            "#Hete": "3.2.4 Heterogeneity"
        },
        {
            "#Intr": "3.2.5 Intrinsicness"
        },
        {
            "#CombConsInteRela": "3.2.6 Combinatorial constraints and internal relations"
        },
        {
            "#NomiInteIslaUniv": "3.2.7 Nomic integrity and island universes"
        },
        {
            "#ModaCutPast": "3.2.8 Modal cut and paste"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Monisms\n1.1 Many monisms\n\nThere are many monisms. What they share is that they attribute\noneness. Where they differ is in what they attribute oneness to\n(the target), and how they count (the unit). So\nstrictly speaking there is only monism relative to a\ntarget and unit, where monism for target \\(t\\) counted by\nunit \\(u\\) is the view that \\(t\\) counted by \\(u\\) is\none.\n\nMonisms are correlative with pluralisms and\nnihilisms. Where the monist for target \\(t\\) counted by\nunit \\(u\\) holds that \\(t\\) counted by \\(u\\) is one,\nher pluralist counterpart holds that \\(t\\) counted by \\(u\\)\nis many, and her nihilist counterpart holds that \\(t\\) counted by\n\\(u\\) is none. Among pluralists it is sometimes useful to single\nout the dualist: the dualist for \\(t\\) and \\(u\\) holds that\n\\(t\\) counted by \\(u\\) is two\n\nTo illustrate these various doctrines for various targets and units,\nlet the target \\(t_1 =\\) concrete objects, and let the\nunit \\(u_1 =\\) highest type. To be a monist for\n\\(t_1\\) counted by \\(u_1\\) is to hold\nthat concrete objects fall under one highest type. The materialist,\nidealist, and neutral monist are all monists of this sort\n(substance monism). They all agree that concrete objects fall\nunder one highest type, disagreeing only over whether the one highest\ntype is material, mental, or something deeper.\n\nTo be a pluralist for \\(t_1\\) counted by\n\\(u_1\\) is to hold that concrete objects fall under\nmore than one highest type. The Cartesian dualist is a pluralist of\nthis sort (substance dualism). She holds that concrete\nobjects fall under two highest types: the material (with the primary\nattribute of extension), and the mental (with the primary attribute of\nthought).\n\nTo be a nihilist for \\(t_1\\) counted by\n\\(u_1\\) is to hold that concrete objects fall under no\nhighest type. The bundle theorist who is an eliminativist about\nconcrete objects is a nihilist of this sort (substance\nnihilism). She rejects the target: she thinks that there are no\nconcrete objects to\n count.[1]\n One who accepts concrete objects but rejects the relevant notion of\n“highest” type would also be a nihilist for\n\\(t_1\\) counted by \\(u_1\\). She rejects\nthe unit: she thinks that this is no way to count.\n\nAs a second illustration, let the target \\(t_2 =\\)\nproperties. The monist for \\(t_1\\) counted by\n\\(u_1\\) (the substance monist, e.g., the materialist)\nmight still be a pluralist for \\(t_2\\) counted by\n\\(u_1\\) (for properties counted by highest type). For\ninstance, she might hold that there are two highest types of property,\nphysical and mental, inhering in one and the same type of substance\n(property dualism). Or she might be a nihilist for\n\\(t_2\\) counted by \\(u_1\\), by being an\neliminative nominalist about properties and thereby rejecting the\ntarget. (These examples show the need to relativize monism to a\ntarget.)\n\nAs a third illustration, let the unit \\(u_2 =\\) individual token. The\nmonist for \\(t_1\\) counted by \\(u_1\\) (the substance monist, e.g., the\nmaterialist) might still be a pluralist for \\(t_1\\) counted by \\(u_2\\)\n(for concrete objects counted by tokens). For instance, she might hold\nthat there exist many concrete object tokens (existence\npluralism), while maintaining that these are all material\nobjects. Likewise the pluralist for \\(t_1\\) counted by \\(u_1\\) might\nbe a monist for \\(t_1\\) counted by \\(u_2\\). For instance, she might\nhold that there is only the one “world-person” with two\nhighest types of property, physical and mental. (These examples show\nthe need to relativize monism to a unit.)\n\nMonism, along with pluralism and nihilism, must therefore be\nrelativized to both a target and a unit. The underlying reason for\nthis double relativity is that these are theses of numerical\npredication (‘…is one/many/none’), and all\nnumerical predication is doubly relative in this way: for a target\n(what is to be counted), and by a unit (how it is to be counted). This\nis one way to understand the moral of Frege’s (1884: 59)\ninsight: \n\n\nWhile looking at one and the same external phenomenon, I can say with\nequal truth both ‘It is a copse’ and ‘It is five\ntrees,’ or both ‘Here are four companies’ and\n‘Here are 500 men.’\n\n\nThe “external phenomenon” is the target, and\n“copse” and “tree” (or “companies”\nand “men”) serve as potential\n units.[2]\n1.2 Important examples\n\nI now mention some of the more interesting target-unit pairs, leading\nto a list of some of the more interesting monisms. To begin with, on\nperhaps the most general level, one may target the categories\nthemselves, and consider whether the schedule of categories has\nvarious sorts of unity. There are at least two interesting sorts of\nunity to consider: (i) the number of categories (including\nsubcategories), and (ii) the number of highest categories (excluding\nsubcategories).\n\nAs to the first sort of unity concerning the number of categories,\nsome posit a categorical distinction between object and\nproperty, thereby recognizing a pluralism of at least two\ncategories. But others would prefer the elegant monistic picture of a\n“one category ontology”: for instance, some trope\ntheorists and property-only theorists claim a property-only schedule,\nor a schedule that effaces the object/property distinction (Williams\n1953; Campbell 1990; Paul 2013); and eliminative nominalists claim an\nobject-only schedule (Rodriguez-Pereyra 2002).\n\nAs to the second sort of unity concerning the number of highest\ncategories, those who are pluralists about the number of categories\nstill may (or may not) posit one highest category—a summum\ngenus, such as entity or being—under\nwhich all the entities in the lower categories fall. Spinoza\n(Ethics IV pref., II: 207), for instance, is a pluralist\nabout the categories but a monist about the highest categories,\npositing a categorical divide between substance and\nmode but unifying both under being: \n\n\nWe are accustomed to refer all individuals in nature to one genus\nwhich is called the most general, that is, to the notion of Being,\nwhich embraces absolutely all the individuals in nature.\n\n\nWhile Aristotle is a pluralist about both the categories and the\nhighest categories, denying that there is any higher category above\nhis substance, quantity, quality,\n etc.[3]\n\nMoving down from the level of the categories themselves, one may\ntarget a particular type of entity, and consider whether that type has\nvarious sorts of unity. Of special interest to the discussion to come\nis the concrete material realm as a target. For this target there are\nat least four interesting sorts of unity to consider: (i) the number\nof types (including subtypes), (ii) the number of highest types\n(excluding subtypes), (iii) the number of tokens (including derivative\ntokens), and (iv) the number of basic tokens (excluding derivative\ntokens). The neutral monist (as per above) is a pluralist about the\nnumber of types, but a monist about the number of highest types. On\nher view there are material and mental types, but both fall under a\nhigher neutral type from which the material and the mental are\nderivative. The priority monist (as per above) may well be a pluralist\nabout the number of tokens, but is a monist about the number of basic\ntokens. On this view there are many concrete objects other than the\none fundamental whole, but these other objects are all\n“shards”: derivative fragments of the One.\n\nThe abstract realm is another interesting target. For this target it\nis not obvious that there is a sensible type/token\n distinction.[4]\n So only two of the four natural count policies for concrete objects\nseem applicable: (i) the number of abstract objects (including\nderivative ones), and (ii) the number of basic abstract objects\n(excluding derivative ones). So consider the hierarchy of pure set\ntheoretic objects. One might very naturally be a pluralist about the\nnumber of pure set-theoretic abstracta that exist, but a monist about\nthe number of basic set-theoretic abstracta, insofar as one holds that\nthe entire transfinite hierarchy is founded upon a single element: the\nempty set. Those who reject abstract objects altogether will obviously\nbe nihilists on either count policy (c.f. Goodman and Quine 1947).\n\nIn general, for any target that supports a type/token\ndistinction—perhaps for any concrete target—it seems that\nthere will be at least the four natural count policies as seen with\nconcrete objects. While for any target that does not support a\ntype/token distinction—perhaps for any abstract target—it\nseems that there will only be the two natural count policies as seen\nwith abstract objects. To further illustrate these patterns: with\nconcrete events, one might count by types, highest types, tokens, or\nbasic tokens. While with abstract Platonic universals, one might count\nthe number of forms, or the number of basic forms. For example, Plato\nis a pluralist about the number of forms, but a monist about the\nnumber of basic forms, maintaining that they are all sustained by the\nform of the\n good.[5]\n\nMoving down from targets that concern a particular type of entity, one\nmight also target a particular token entity, and consider whether it\nhas various sorts of unity. A dizzying variety of natural count\npolicies present themselves. A particular concrete object might, for\ninstance, be counted by (i) the number of its parts, (ii) the number\nof its atomic parts, (iii) the number of its maximally continuous\nparts, (iv) the number of its functionally integrated parts, or (v)\nthe number of its qualitatively homogeneous parts. So if one considers\na chess set, one might count it functionally as 1 (1 chess set), by\nits connected parts as 33 (32 pieces and 1 board), by its homogeneous\nparts as 96 (32 pieces plus 64 squares), by its atomic parts as\nbazillions of particles, and by its parts as\n\\(2^n -1\\), where \\(n\\) is the number of its\natomic\n parts.[6]\n Obviously many other count policies are available. It is not clear\nthat there is more to be said of a systematic nature about natural\ncount policies for various particular entities.\n\nThere is one count policy of some metaphysical interest worth\nmentioning, which is to count by the number of individuals\n(self-identicals) present. Thus one might say, for a given target,\nthat there are exactly three individuals involved. Restricting our\ndomain of quantification to the target, this would be to uphold the\nformula:\n\n\n\\(\\exists x\\exists y\\exists z(x\\ne y \\amp x\\ne z \\amp y\\ne z \\amp \\forall v(v=x \\vee v=y \\vee v=z))\\)\n\n\nUnless one thinks that identity itself is a relative notion (Geach\n1962), or that there is some other problem with this formalism, this\nformula represents a perfectly legitimate count policy. My point is\nthat it is not the only legitimate count policy. It is perfectly\nlegitimate to count the copse as one, without denying the presence of\nthe five trees, or identifying them.\n\nPutting this together, here is a list of some of the more interesting\nexamples of monistic doctrines mentioned above:\n\n Genus monism: target: categories; unit: highest type\n(the doctrine that there is a highest category; e.g., being)\n Substance monism: target: concreta; unit: highest type\n(the doctrine that all concreta are of a common type; e.g.,\nmaterialism)\n Property monism: target: properties; unit: highest type\n(the doctrine that all properties are of a common type; e.g., physical\nproperties)\n Existence monism: target: concreta; unit: tokens (the\ndoctrine that there is exactly one concretum)\n Priority monism: target: concreta; unit: basic tokens\n(the doctrine that there is exactly one fundamental concretum)\n\n\nThis list is not intended to be exhaustive, but just to indicate a\nhandful of the more interesting monisms, and classify them with\nrespect to their associated target and\n unit.[7]\n\nMost of these five monisms are independent, though there are the\nfollowing logical relations. Pluralism about the number of basic\ntokens for some concrete category entails pluralism about the\nrespective number of tokens. In the other direction, both monism and\nnihilism about the number of tokens for some concrete category entails\na corresponding monism or nihilism about the respective number of\nbasic tokens. Further, nihilism about the number of highest types for\nany concrete category entails nihilism about the number of tokens (and\nthus the number of basic tokens) for that category.\n\nThus with existence monism and priority monism (the\nmain foci of what follows), one finds the following logical relations:\nexistence monism entails priority monism, and priority pluralism\nentails existence pluralism. But otherwise the views are independent.\nSo for instance, one might be an existence pluralist but a priority\nmonist. This would be to maintain that many things exist (not just the\nworld, but also persons, furniture, particles, and whatnot), but that\nthe whole world is basic. The partialia are merely dependent\nfragments. It may be that this is the view that most historical\nmonists have held, and that especially deserves serious\n attention.[8]\n2. Existence Monism\n2.1 Overview\n\nExistence monism targets concrete objects and counts by individual\ntoken. It holds that exactly one concrete object token exists (the\nOne). It represents an interesting and historically important form of\nmonism, albeit one which is widely regarded as deeply implausible.\nConsider any two concrete individuals, such as you and I. The\nexistence monist must either deny that at least one of us exists, or\ndeny that at least one of us is a concrete object, or hold that we are\nidentical. This is hard to swallow. (It is important to distinguish\nexistence monism from priority monism, which does not have this\nimplausible implication.)\n\nHistorically, existence monism may have been defended by Parmenides,\nMelissus, Spinoza, and Bradley, though in each case the claim is\n controversial.[9]\n Among contemporary philosophers, Horgan and Potrč are probably\nthe leading, and perhaps the only, existence\n monists.[10]\n Thus Horgan and Potrč (2000: 249; c.f. 2008: 8) advance the\nfollowing ontological and semantical theses:\n\nThere really is just one concrete particular, viz., the whole\nuniverse (the blobject).\nThe blobject has enormous spatiotemporal structural complexity,\nand enormous local variability—even though it does not have any\ngenuine parts.\nNumerous statements employing posits of common sense and science\nare true, even though nothing in the world answers directly to these\nposits.\nTruth, for such statements, is indirect language-world\ncorrespondence.\n\n\nNote that existence monism should not be confused with the formula:\n\\(\\exists x\\forall y(x=y)\\). That is\nthe logician’s formula for expressing the claim that exactly one\nentity exists. The existence monist is making a much weaker (and\nslightly more plausible) claim. She can allow that many abstract\nentities exist, she can allow that many spatiotemporal points exist\n(assuming that she does not follow the supersubstantivalist\nin identifying objects with regions), and she can allow that many\nproperty tokens exist (assuming she does not follow the bundle\ntheorist in identifying objects with compresent property tokens),\nas long as she maintains that only one concrete object token\n exists.[11]\n\nIn order to properly characterize existence monism, one should first\nintroduce a predicate ‘\\(C\\)’ that denotes the property\nof being a concrete object. (The notion of being a concrete object is\nnatural and useful, so this should be clear enough to work with.) Then\none can introduce the formula:\n\n\nExistence monism: \\(\\exists x(Cx \\amp \\forall y(Cy \\rightarrow x=y))\\)\n\n\nThe corresponding logical formulae for existence pluralism and\nnihilism then run:\n\n\nExistence pluralism: \\(\\exists x\\exists y\n(Cx \\amp Cy \\amp x\\ne y)\\)\n\nExistence nihilism: \\({\\sim}\\exists xCx\\)\n\n\nIt is not built into the formulation of Existence monism that\nthe one concretum has any particular nature. It might be my nose or\nyour left foot. It might be material (realist) or mental (idealist) or\nneutral. Idealist and neutral forms of existence monism may or may not\nidentify the One with some sort of divinity. Materialist and neutral\nforms of existence monism typically identify the One with the whole\ncosmos (Horgan and Potrč’s “blobject”). Using\n‘\\(u\\)’ as a dedicated constant for the cosmos, which\nmay be defined mereologically as the sum of all concreta, one thus\nreaches:\n\n\nExistence monism (cosmic):\n\\(\\exists !xCx \\amp Cu\\)\n\n\nThis says that there is exactly one concretum, namely the cosmos.\n2.2 Arguments\n2.2.1 Moorean truisms\n\nAs mentioned, existence pluralism is widely embraced. This attitude\ncame to the fore in the early analytic revolt against the neo-Hegelian\nmonistic idealists, and has made all forms of “monism”\nsomething of a taboo until recently (cf. Schaffer 2010b: §1).\nThis pluralistic stance is fairly explicit in Moore’s (1993:\n166) declaration: “Here is one hand… and here is\nanother,” and fully explicit in Russell’s (1918 [1985]:\n36) declaration:\n\n\nI share the common-sense belief that there are many separate things; I\ndo not regard the apparent multiplicity of the world as consisting\nmerely in phases and unreal divisions of a single indivisible\nReality.\n\n\nWhether due wholly to argumentative force or at least partly to\nhistorical contingencies, such declarations had the effect of ending\nany interest in monism (even in forms of monism such as priority\nmonism that agree with Moorean truisms: §3), for nearly one\nhundred years. And so philosophical fashion swung from some form of\nmonism in the nineteenth century, to some form of pluralism in the\ntwentieth\n century.[12]\n\nThere are actually two distinct sources of evidence for existence\npluralism: intuition and perception. Where Russell\nseems to be appealing to his “common-sense belief,” Moore\nseems to be appealing directly to the content of perception, as do\nHoffman and Rosenkrantz (1997: 78):\n\n\nMonism… is inconsistent with something that appears to be an\nevident datum of experience, namely, that there is a plurality of\nthings. We shall assume that a plurality of material things exists,\nand hence that monism is false.\n\n\nSo, barring a radical skepticism about both intuition and perception,\nthere seems to be strong prima facie evidence for existence\npluralism.\n\nThe argument may be formulated in various ways, but—for reasons\nthat will emerge below—one of the more interesting (and very\nnatural) formulations runs as follows:\n\nIt is intuitively obvious (/perceptually apparent) that there are\na plurality of concrete objects.\n\n\n1 makes a claim about the status of a given proposition, that\nthere are a plurality of concrete objects. It says that this\nproposition is intuitively obvious and/or perceptually apparent.\n\nIf it is intuitively obvious (/perceptually apparent) that there\nare a plurality of concrete objects, then there is prima\nfacie reason to believe that there are a plurality of concrete\nobjects.\n\n\n2 makes an epistemic claim about propositions that enjoy the status of\nbeing intuitively obvious (/perceptually apparent). The epistemic\nclaim is that these propositions thereby enjoy prima facie\njustification. The argument thus concludes:\n\nThere is prima facie reason to believe that there are a\nplurality of concrete objects.\n\n\nThe argument is valid and the premises seem plausible. Of course the\nconclusion is not existence pluralism, but rather the weaker claim\nthat there is prima facie reason to believe in existence\npluralism. But this leaves existence pluralism as the default view\nbarring any overriding arguments otherwise. This is exactly the way\nRussell (1918 [1985]: 48) sees the dialectic:\n\n\nThe empirical person would naturally say, there are many things. The\nmonistic philosopher attempts to show that there are not. I should\npropose to refute his a priori arguments.\n\n\nHow might the existence monist or nihilist reply? As a claim about the\ncontent of intuition (/perception), 1 seems hard to question. And as a\nclaim about prima facie justification, 2 seems plausible as\nwell (albeit more theoretically loaded).\n\nThere is a fairly standard existence monist and nihilist reply to\narguments in the vicinity of 1–3, which involves attempts to\nparaphrase claims of commonsense. For instance, when one\nclaims that there is a hand here, the existence monist might hold that\nwhat is strictly the case is that the world is handish here. The\nclaims of commonsense could then be downgraded to being strictly false\nbut still explicable given the truth of the paraphrase, or as true but\nonly according to the ‘tacit fiction’ of decomposition,\nwhich is the ‘fiction’ that the world decomposes into\nproper parts.\n [13]\n\nOther techniques besides paraphrase may be employed. For instance,\nHorgan and Potrč (2000: 50–51) offer an indirect\ncorrespondence theory of truth, declaring talk of a plurality of\ndiscrete objects apt for tracking “lumps” and\n“congealings” of the blobject, saying that “such\ntracking would constitute an indirect kind of language/world\ncorrespondence” which “would be a very plausible candidate\nfor truth” (2000: 50–1). Their idea is to posit a\ncontextually sensitive parameter in truth-evaluation, for\ndirectness of correspondence required, so that Moorean\ntruisms can count as true in lax\n contexts.[14]\n Another option would be to offer a truthmaker theory of\ncommitment, claiming that truths commit one just to their\ntruthmakers, and that the truthmaker for the Moorean truism is just\nthe\n world.[15]\n\nBut it is unclear, however, exactly how these various responses\naddress the argument as formulated via 1–3. Is the idea that,\ncontra 1, the paraphrase reveals that what is obvious and/or\napparent might not be exactly what we thought? This is puzzling since\nthe paraphrased claim appears in 1 as the content of intuition and/or\nperception, and it is dubious that one can freely paraphrase inside\nsuch contexts. Perhaps it in some sense “comes to the same\nthing” if there is a hand, or if the world is handish hereish,\nbut it still might seem to one specifically as if the former were the\ncase. Or is the idea that, contra 2, the paraphrase reveals\nthat what is obvious and/or apparent is not prima facie\nrational to believe? This is puzzling as well, and raises concerns\nthat the existence of paraphrases would engender a general skepticism\nabout any intuitions and perceptions. Or is the idea that the argument\ngoes through to 3, but that the existence of the paraphrase provides\nan at least partially undermining defeater to the reason to believe in\na plurality of concrete objects? Again this raises worries about\nengendering a general skepticism, for making defeaters too easy to\ncome by.\n\nThe existence monist and nihilist can of course just “bite the\nbullet” by accepting 3 but claiming overriding arguments\notherwise. But this is a dialectically difficult situation for her:\nwhatever support the premises of her arguments otherwise might have\nwill almost certainly pale in comparison to the support that 3\nprovides for existence pluralism. Not for nothing are existence monism\nand nihilism widely dismissed as crazy\n views.[16]\n2.2.2 An exclusion argument\n\nGiven the highly plausible case for existence pluralism, it seems as\nif the existence monist and nihilist need strong arguments for their\nview. For instance, if it could be proven that positing a plurality of\nconcrete objects (or a plurality of anything, or even a single\nconcrete object) led irrevocably to contradiction, this should turn\nthe tide. But nothing like this has ever been proven.\n\nPerhaps the best argument for existence monism is that it provides the\nsimplest sufficient\n ontology.[17]\n The idea is that we can give a complete account of the phenomena in\nwhich the world is the only concrete object mentioned, so that there\nis no need to posit any further concreta. The argument may be\nformulated as follows:\n\nThe world is the only concrete object needed to explain how the\nworld evolves.\n\n\nSomewhat more precisely, 4 claims that the complete causal story of\nthe world can be told in terms of the physical aspect of the world (a\npath in physical configuration space), together with whatever laws of\nnature govern temporal evolution. No pieces of the world (such as\ntables or particles) need be mentioned in this story. To take a toy\nexample, consider a Newtonian world containing what the folk would\ndescribe as a rock shattering a window. The complete causal story here\ncan be told purely in terms of the world’s occupational manner\nvis-á-vis Newtonian configuration\n space.[18]\n The rock and the window need not be mentioned in this story. The\nworld bears all the causal information.\n\nThe argument then adds that recognizing proper parts of the world is\nrecognizing what is either explanatorily redundant or\nepiphenomenal:\n\nIf the world is the only concrete object needed to explain how the\nworld evolves, then if there were proper parts of the world, these\nproper parts would be explanatorily redundant or epiphenomenal\nentities.\n\n\nIf the world suffices to explain everything, then there is nothing\nleft for its proper parts to explain. Its proper parts can at best\nexplain what the world already suffices for. So if the proper parts\nexplain anything at all they are redundant, while if they explain\nnothing at all they are epiphenomenal.\n\nThe argument continues with a rejection of both explanatorily\nredundant and epiphenomenal entities:\n\nThere are no explanatorily redundant or epiphenomenal\nentities.\n\n\nSuch a rejection is best defended on methodological grounds.\nOccam’s Razor cuts against both explanatorily redundant and\nepiphenomenal entities, as there can be no need for positing\n either.[19]\n From which the argument concludes:\n\nThe world has no proper\n parts.[20]\n\n\n\nThe conclusion may seem shocking, but the argument is valid, and the\npremises seem plausible.\n\nHow might the existence pluralist and the existence nihilist reply to\nsuch an exclusion argument? Starting with the existence pluralist, she\nmight try to deny 4 by denying that the world exists. This\nmight seem an unlikely reply, though there are those who endorse\nprinciples of restricted composition that entail that the world does\nnot exist. For instance, van Inwagen 1990 holds that composition only\noccurs when the result is a life, and the world is\n(presumably) not a life—a consequence van Inwagen himself (2002:\n127) later notes and\n embraces.[21]\n Lowe (2012: 93-5) is more directly skeptical about “the\ncosmos” that monists invoke (though see Tallant 2015 (3103-06)\nfor a reply to Lowe, based on Schaffer’s 2009b proposed\nidentification of the cosmos with the spacetime manifold).\n\nSo much the worse for those sorts of principles of restricted\ncomposition, the existence monist might respond. Indeed, insofar as\nrestricted principles of composition are supposed to improve on\nunrestricted composition either with respect to intuitions or with\nrespect to science, it seems that any plausible principle of\nrestricted composition should retain the world. For the existence of\nthe world enjoys both intuitive and empirical support. Intuitively, we\nfolk speak of “the cosmos” and our poets write verses like\n“All are but parts of one stupendous whole, whose body nature\nis, and God the soul;” (Alexander Pope; Essay on Man, Epistle\nI.IX). Empirically, the cosmos is the very subject matter of physical\ncosmology, and quantum cosmology directly attempts to solve for the\nwave function of the\n cosmos.[22]\n\nThe existence pluralist might do better to deny 5, by maintaining that\ncomposition is identity. If the world is its proper\nparts, then positing the former just is positing the\n latter.[23]\n But there seem to be two main reasons for denying that composition is\nidentity. First, the whole and its parts differ structurally.\nPluralities like “the parts” have a privileged structure\nin terms of their individuals. Thus consider a circle (the whole)\ndivided into two semicircles (the parts). Here the semicircles are\nstructured into a pair of distinct semicircular\n shapes.[24]\n But (given mereological extensionality) fusions lack such privileged\nstructure. The circle is just as much the fusion of its two\nsemicircles, as it is the fusion of its four quadrants, and its\ncontinuum-many points. Second, the whole and its parts differ\nnumerically. As Lewis (1991: 87) writes: “What’s\ntrue of the many is not exactly what’s true of the one. After\nall they are many while it is\n one.”[25]\n So, assuming that the extended many-one conception of identity\nretains some analogue of Leibniz’s law of the indiscernibility\nof identicals, the one whole cannot be identical to its many\nparts.\n\nThe existence pluralist might do best to deny 6. One way to deny 6 is\nto invoke competing methodological considerations. Perhaps\nOccam’s Razor cuts against both explanatorily redundant and\nepiphenomenal entities, but Occam’s Razor is not the only\nmethodological consideration. There are also considerations of\nconservativeness, which seem to favor an ontology that includes you\nand I as distinct concrete objects. Though here the existence monist\nmight reply that Occam’s Razor trumps conservativeness when the\ntwo conflict. And there are also considerations of theoretical\nelegance, which might still favor the pluralistic account of the\nworld, if the monistic “world particle” story requires the\nuse of overly complicated and disunified predicates.\n\nPerhaps a better way for the existence pluralist to deny 6 (and the\nbest overall way for her to reply to the exclusion argument) is to\nargue that Occam’s Razor should be modified to take into account\nthe notion of basicness. For there seems little harm in multiplying\nentities that are derivative—what seems problematic is the\nmultiplication of basic entities. In this vein Armstrong (1997: 12)\nspeaks of “the ontological free lunch,” explaining:\n\n\n[W]hatever supervenes, … is not something ontologically\nadditional to the subvenient, or necessitating, entity or entities.\nWhat supervenes is no addition to being.\n\n\nSo the existence pluralist might suggest that the better\nmethodological maxim is: do not multiply basic entities\nwithout necessity (but help yourself to derivative\n entities).[26]\n\nTurning to the existence nihilist, she might react to the exclusion\nargument by claiming to beat the existence monist at her own game. The\nexistence nihilist denies that any concrete objects exist (this is a\nvariant way of denying that the world exists, and so a variant way of\ndenying 4). Just as the complete causal story of the world can be told\nin terms of the world’s having various configurational\nproperties, so the story can be told without mentioning any concrete\nobject at all, and simply speaking of the instantiation of the\nrelevant properties. This involves what Hawthorne and Cortens 1995\n(following Strawson 1959) call a “feature-placing\nlanguage.” Instead of saying that the world has certain\nproperties, a feature-placing language just says that there are those\nproperties, or (to express the same idea in a different way) instead\nof saying that the world is \\(F\\), a feature-placing language just\nsays that it \\(F\\)s, where ‘it’ is understood as a\nsemantically vacuous placeholder that is present for purely syntactic\nreasons. Here the existence nihilist might claim to beat the monist at\nher own game, by providing an even simpler sufficient ontology.\n\nIn reply, the existence monist could say that property instantiations\nmetaphysically presuppose concrete objects as the instantiators of\nsuch\n properties.[27]\n That is, the existence monist should reply that existence nihilism is\nimpossible, for positing properties without bearers. If so then at\nleast one concrete object is required, by the argument that properties\nneed bearers; and at most one concrete object is required, by the\nargument from exclusion discussed above.\n\nTo summarize the dialectic as presented so far, the existence monist\nmust defend both the exclusion argument and the “properties need\nobjects” argument. The existence nihilist must defend both the\nexclusion argument and the possibility of properties without objects.\nAnd both the existence monist and nihilist must establish that the\npremises of the exclusion argument—or any alternative argument\nthey would provide—have sufficient plausibility to override the\nconsiderations from intuition and from perception, which seem to tilt\nso strongly towards existence pluralism (§2.1).\n\nOf course existence monism is not the only form of monism (§1).\nIf considerations from intuition and from perception ultimately tell\nagainst existence monism, there is still room to combine existence\npluralism with priority monism. This would yield a view on which many\nthings exist (as is intuitively obvious and perceptually apparent),\nbut only as dependent fragments of the one fundamental whole. This may\nbe the view that many historical monists have held, and is a view that\ndeserves very serious consideration.\n2.2.3 Ontological vagueness\n\nBut before turning to priority monism, it is worth mentioning in more\ndetail the argument from ontological vagueness that motivates Horgan\nand Potrč 2000 and 2008. Their core idea, seen in their 2008\n(§7.3), is that the ontologist has three main options. She may\nposit a world full of commonsense objects (“slob-jects”),\nbut at the price of admitting ontological vagueness. Or she may posit\na world of many small precise objects (“snob-jects”),\nwhich may or many not stand in composition relations. Or she may posit\njust one precise object, namely the world itself (“the snob-ject\nis the blob-ject”).\n\nHorgan and Potrč argue that ontological vagueness is impossible\nsince it entails a contradiction, and take this to rule out an\nontology of common-sense objects. (See Lowe 2012 for a defense of the\ncoherence of this sort of ontological vagueness, and see Schaffer 2012\nfor an argument that semantic conceptions of vagueness such as\nsupervaluationism resolve the problem.)\n\nHorgan and Potrč then take the rejection of ontological vagueness\nto force an ontology of precise objects (no “slob-jects”\nonly “snob-jects”), and take the remaining issue solely to\nconcern which inventory of precise objects the ontologist should\ncountenance. They consider three main inventories: a nihilist\ninventory of many small precise objects (e.g. particles) with no\ncomposites, a universalist inventory of many small precise objects\nplus all composites formed therefrom, and an existence monist\ninventory of just one big precise object. And they conclude (2008:\n183) that the existence monist inventory is to be preferred on grounds\nof parsimony:\n\n[T]hese three candidates can be ordered with respect to comparative\nontological parsimony. The simplest is [existence monism]; it\nmaximizes ontological parsimony by countenancing just one real\nconcrete object, the blobject. Less parsimonious is [nihilism], since\nit countenances all those point-objects… Still less\nparsimonious is [universalism], since it countenances not only all the\nsame point-objects, but also a completely unrestricted mereological\nhierarchy of snobjective region-objects as well.\n\n\nI think that there are at least three problems with this argument. The\nfirst is that the parsimony comparison between the nihilist and\nexistence monist inventory is problematic, since the ontologies in\nquestion are disjoint. This is not a case where one ontology is a\nproper subset of another (rather both are disjoint proper subsets of\nthe universalist inventory). Rather each inventory is itself minimally\ncomplete. From the perspective of each inventory, there are no\nelements that are superfluous.\n\nThe second problem—hinted at in §2.2.2—is that any\nadded parsimony gains for the existence monist must be weighted\nagainst potential explanatory losses. In particular, the existence\nmonist is going to struggle to account for linguistic phenomena such\nas reference, without positing any objects to serve as referents\n(Schaffer 2012). And she will struggle to formulate her own theory,\ninsofar as her own theory speaks of things such as\n“sentences” and “posits” whose very existence\nit denies (Lowe 2012).\n\nThe third problem is that—given that parsimony considerations\nonly attach to fundamental posits (§2.2.2)—there is room to\ncombine a universalist total ontology with a monistic conception of\nwhat is fundamental, and so reclaim all of the relevant parsimony of\nexistence monism with none of the wild rejections of obvious\ncommonsense objects or useful linguistic referents. This is a form of\nthe priority monist alternative.\n3. Priority Monism\n3.1 Overview\n3.1.1 Formulation\n\nPriority monism targets concrete objects and counts by basic tokens.\nIt holds that exactly one basic concrete object exists—there may\nbe many other concrete objects, but these only exist derivatively. The\npriority monist will hold that the one basic concrete object is\nthe world (the maximal concrete whole). To distinguish\nherself from the existence monist, she will allow that the world has\nproper parts, but hold that the whole is basic and the proper parts\nare derivative. In short, she will hold the classical monistic\ndoctrine that the whole is prior to each of its (proper) parts. This\ndoctrine presupposes that the many proper parts exist, for\nthe whole to be prior to. Historically, priority monism may have been\ndefended by Plato, Plotinus, Proclus, Spinoza, Hegel, Lotze, Royce,\nBosanquet, and Bradley, inter\n alia.[28]\n But today, priority monism has few\n advocates.[29]\n Indeed, until the last decade, priority monism was seldom even\nrecognized as a possible position. ‘Monism’ was typically\nunderstood as existence monism (exactly one concrete object exists),\nand summarily\n dismissed.[30]\n\nIn order to properly characterize priority monism, one should\nintroduce a predicate ‘\\(B\\)’ that denotes the property\nof being a basic concrete object. Then one can introduce the\nformula:\n\n\nPriority monism: \\(\\exists x(Bx \\amp \\forall y(By \\rightarrow x=y))\\)\n\n\nThe corresponding logical formulae for priority pluralism and nihilism\nthen run:\n\n\nPriority pluralism:\n\\(\\exists x\\exists y(Bx \\amp By \\amp x\\ne y)\\)\n\nPriority nihilism:\n \\({\\sim}\\exists xBx\\)[31]\n\n\nThe formulae associated with priority monism are thus the same\nformulae as for existence monism/pluralism/nihilism, save for the\nreplacement of ‘\\(C\\)’ with ‘\\(B\\).’\nNote that it is not built into the formulation of Priority\nmonism that the one basic concretum has any particular nature.\nPriority monism, Priority pluralism, and\nPriority nihilism are so far characterized as strictly\nnumerical doctrines, concerning the number of basic concreta (one,\nmany, or none).\n\nIt is standard for priority monists and nihilists to also have views\nabout the “size” of the basic concreta. Like the existence\nmonist, the priority monist standardly associates her one basic\nconcretum with the whole cosmos. Using ‘\\(u\\)’ as a\ndedicated constant for the cosmos, one thus reaches:\n\n\nPriority monism (cosmic):\n\\(\\exists !xBx \\amp Bu\\)\n\n\nThis says that there is exactly one basic concretum, namely the\n cosmos.[32]\n Likewise the priority pluralist standardly associates her many basic\nconcreta with proper parts of the cosmos:\n\n\n Priority pluralism (partial):\n\\(\\exists x\\exists y(Bx \\amp By \\amp x\\ne y) \\amp{\\sim}Bu\\)\n\n\nThis adds that the cosmos is not among the basic concreta.\n\nTo get from Priority monism (cosmic) to the further claim\nthat the proper parts of the cosmos are dependent on the whole, one\nneed only add that the cosmos has proper parts, and that nonbasic\nconcreta depend on basic concreta. These proper parts will be nonbasic\nconcreta by Priority monism (cosmic), and hence must depend\non the one and only basic concretum. (Analogous reasoning allows one\nto move from Priority pluralism (partial) to the further\nclaim that the cosmos depends on its proper parts.)\n3.1.2 Priority\n\nThe doctrines of priority monism, pluralism, and nihilism—indeed\nthe very idea that “basic concrete token” is a legitimate\nunit of counting—presuppose a notion of basicness. This notion\nof basicness may be understood with reference to the classical\nhierarchical view of reality. The basic forms the sparse\nstructure of being, while the derivative forms the abundant\nsuperstructure. The basic is fundamental. It is the ground of all\nelse. It is (as it were) all God would need to create, while the\nderivative is a mere byproduct. The derivative is dependent on,\ngrounded in, and existent in virtue of the basic.\n\nSuch a notion of basicness—and the hierarchical picture\nassociated with it—is intuitively natural and theoretically\nuseful, in this context and others. It has classical roots in\nAristotle’s notion of priority in nature, and has\nbranched into the contemporary program of sparse ontology, in\na way that has proven fruitful in understanding a wide range of\nissues. For instance, the physicalist holds that physical entities are\nbasic, and that mental and moral entities are derivative. For the\nabstract objects of pure set theory, it is natural to think that the\nempty set is basic, and that the other pure sets are founded on it.\nWith respect to holes, one might hold that the material host is basic\nand that its holes are formed by it. And with respect to objects and\nproperties, one classical idea is that objects are basic and\nproperties inhere in them as dependent abstractions (modes). Some are\nskeptical of these locutions. But for better or worse, such talk has\nrapidly become\n ubiquitous.[33]\n\nThere are many ways to make sense of these notion, but one natural\napproach is to take basicness as the foundation of ontological\npriority. That is, suppose that one begins with the notion of\nontological priority, understood as an irreflexive and\ntransitive relation between entities. Then ontological priority will\ninduce a partial ordering over the domain of entities. Suppose one now\nadds the assumption that ontological priority requires\nfoundations. These foundations will be those entities that\nare not posterior to any other entities. These are the basic,\nungrounded\n entities.[34]\n Suppose one now adds a third assumption that there is a well-founded\nontological dependency structure within the domain of concrete\nobjects. Then one gets basic concrete objects. Being such an\nobject is the property denoted by ‘\\(B\\)’.\n\nFormally speaking, this natural approach begins with an irreflexive\nand transitive ontological priority relation \\(P\\). A foundational\nentity may then be defined as an entity that has nothing prior to\nit:\n\n\nFoundational entity: \\(Fx =_{df} {\\sim}\\exists yPyx\\)\n\n\nOntological foundationalism may then be formulated as the following\nthesis:\n\n\nOntological foundationalism:\n\\(\\forall x(Fx \\vee \\exists y(Fy \\amp Pyx))\\)\n\n\nIn words, ontological foundationalism holds that every entity is\neither basic or posterior to something basic. In content, what\nontological foundationalism excludes is the prospect of something\nbeing neither itself foundational nor founded on something else that\nis\n foundational.[35]\n\nWithin the domain of concrete objects, a basic object is then a\nconcrete object that has no concrete object prior to it:\n\n\nBasic concreta: \\(Bx =_{df} Cx \\amp{\\sim}\\exists y(Cy \\amp Pyx)\\)\n\n\nHere ‘\\(C\\)’ continues to denote the property of being\na concrete object (as per the formulation of existence monism:\n§2), and ‘\\(P\\)’ the priority relation. This\ndefines the predicate ‘\\(B\\)’ used in the formulations\nof priority monism, pluralism, and nihilism above. Object\nfoundationalism may then be defined as the following thesis:\n\n\nConcreta foundationalism:\n\\(\\forall x(Cx \\rightarrow(Bx \\vee \\exists y(By \\amp Pyx)))\\)\n\n\nIn words, concreta foundationalism holds that every concrete object is\neither basic-among-the-concreta or posterior to something\nbasic-among-the-concreta.\n\nGiven these assumptions, the debate between the priority monist and\nthe priority pluralist may be described as a debate over what is at\nthe foundation of the priority relation on concrete objects. The\npriority monist holds that whole is prior to (proper) part, and that\nthe maximal whole is ultimately prior. The priority pluralist holds\nthat (proper) part is prior to whole, and typically holds that the\nminimal parts are ultimately prior. This is not a debate over what\nexists. Both sides may accept the same roster of existent beings\n(including the world, you and I, planets and particles, etc.) This is\na debate over what is basic.\n3.1.3 Tiling\n\nUnder a certain natural picture about basic objects, Priority\nmonism and Priority pluralism are exhaustive and\nexclusive doctrines. The picture is that the basic objects tile\nthe cosmos, in the sense that they cover every portion of reality\nwithout overlap. More precisely, the tiling constraint (c.f. Schaffer\n2010a: §1.3) may be thought of as the conjunction of two\nconditions:\n\n\nNo gaps: Sum:\\(x(Bx)=u\\),\n\n(Sum:\\(x(Bx)\\) is the mereological sum of all\nthings that are such that \\(Bx\\).)\n\nNo overlaps:\n\\(\\forall x\\forall y((Bx \\amp By \\amp x\\ne y) \\rightarrow{\\sim}\\exists z(\\text{PART}zx \\amp \\text{PART}zy))\\)\n\n\nNo gaps expresses the requirement that the sum of all the\nbasic entities is the cosmos as a whole. No portion of the cosmos is\nleft uncovered. No overlaps expresses the requirement that\nthe basic entities be mereologically disjoint, having no common\nparts.\n\nThe picture given by No gaps and No overlaps is one\non which the basic concreta partition the cosmos. The question of\nwhich concreta are basic becomes the question of how to carve\nnature at the joints. Or to invoke Lewis’s (1986) memorable\npicture of the cosmos as a vast mosaic, the question becomes what\nare the tiles from which the cosmic mosaic is\n inlaid?[36]\n\nNo gaps rules out Priority nihilism. For if nothing\nis basic, then the sum of the basic concreta cannot be the cosmos.\nThis makes Priority monism and Priority pluralism\nexhaustive doctrines.\n\nNo gaps also renders Priority monism equivalent to\nPriority monism (cosmic). For if only one concretum is basic,\nand it must sum to the cosmos, then it must be the cosmos. Likewise\nNo overlaps renders Priority pluralism equivalent to\nPriority pluralism (partial). For if many concreta are basic,\nthen the cosmos cannot be among the basic concreta or it will overlap\nthe others.\n\nGiven No gaps plus No overlaps, further equivalences\nfollow. On the monistic side, the two conjuncts of Priority monism\n(cosmic)—\\(\\exists !xBx\\) and \\(Bu\\)—turn out to be\nmutually entailing. And likewise on the pluralistic side, the two\nconjuncts of Priority pluralism (partial)—\\(\\exists\nx\\exists y(Bx \\amp By \\amp x\\ne y)\\) and \\({\\sim}Bu\\)—turn out\nto be mutually entailing. That is to say that, given the tiling\nconstraint, the numerical thesis that the number of basic concreta is\none turns out equivalent to the holistic thesis that the basic\nconcretum is mereologically maximal.\n\nSince Priority monism turns out equivalent to Priority\nmonism (cosmic) which turns out equivalent to \\(Bu\\),\nand Priority pluralism turns out equivalent to Priority\npluralism (partial) and so equivalent to \\({\\sim}Bu\\),\nPriority monism and Priority pluralism turn out to\nbe contradictories. They are exhaustive and exclusive conceptions of\nthe basic concreta. Given the tiling constraint, Priority\nmonism and Priority pluralism turn out to be exhaustive\nand exclusive conceptions of how to carve nature at the joints.\n3.2 Arguments\n\nWhat arguments might be given for whether the one whole or some of its\nmany proper parts is basic? What follows is a survey of some of the\nmore important arguments that have appeared in the literature, on\nbehalf of both the priority monist and the priority pluralist (the\npriority nihilist will not make any further appearances). This survey\nis not intended to be exhaustive. Indeed, there has recently been some\nrecurrence of interest in the debate over priority monism, and new\narguments are emerging on both\n sides.[37]\n3.2.1 Common sense\n\nIt is perhaps best to begin from the idea that common sense might\nfavor priority pluralism, as these considerations are historically\nimportant (perhaps due in part to the historical conflation of\npriority monism with existence monism), and linger as something like a\nreflex response to priority monism in the contemporary literature. So\nthe argument from commonsense, which is an argument for\npriority pluralism, may be posed as follows:\n\nCommonsense holds that part is prior to whole.\nIf commonsense holds that part is prior to whole, then there is\nreason for thinking that part is prior to whole.\nThere is reason for thinking that part is prior to whole.\n\n\nThe argument is obviously valid, so the only remaining questions\nconcern the truth of the premises 8 and 9.\n\nAs to 8, consider the grains of sand in the heap. Here it seems that\nthe grains are prior—the heap exists in virtue of the grains. Or\nconsider the tiles in the mosaic. Here it seems that the tiles are\nprior—the mosaic is just an arrangement of tiles. Or consider\nthe individuals in a community. Here it seems that the individuals are\nprior—the community is just a grouping of individuals. In all\nthese cases, it seems that part is prior to whole. Thus Leibniz (1714:\n455) maintains that, in general, “a composite is nothing else\nthan a collection or aggregatum of simple substances.”\nRelatedly, it is common in the contemporary discussions of\nmetaphysical grounding and related notions, to see wholes treated as\ndependent on their parts. For example, Bennett (2017: 8–9)\noffers an initial survey of building relations, and takes her leading\nexample to be that of the composition of wholes from their parts.\n\nYet on the other hand consider some gerrymandered division of a\ncircle. Here it seems that the circle is prior—the gerrymander\nis just an arbitrary partition on the circle. Or consider the organs\nof the body. Here it seems that the body is prior—the organs are\njust functional portions of the body. Or consider the myriad details\nof the percept. Here it seems that the percept is prior—the\ndetails are just particulars of the gestalt. In these latter cases, it\nseems that whole is prior to\n part.[38]\n\nGeneralizing, it seems that commonsense actually has a relatively\nnuanced stance on priority relations between whole and part.\nCommonsense endorses the priority of the parts in cases of mere\naggregation and arrangement, and the priority of the whole in cases of\narbitrary decompositions, functionally integrated systems, and mental\n unities.[39]\n Overall commonsense seems to distinguish between mere heaps\nand genuine unities. On this point Aristotle\n(Meta.1041b11–2) speaks of “that which is\ncompounded out of something so that the whole is one—not like a\nheap, but like a syllable…”\n\nSo it remains, in evaluating 8, to ask whether commonsense conceives\nof the world as a mere heap or a genuine unity. Here the priority\nmonist might invoke the following passage from Blanshard (1973:\n180):\n\n\nWe are convinced that [Russell’s atomistic conclusion] will not\nstand. Our conviction is essentially that of the plain man. Intuitions\nmay be of small weight in philosophy, but…the ‘invincible\nsurmise’ of most thoughtful minds [is] that the world is not in\nthe final account a rag-bag of loose ends…\n\n\nIndeed, as James (1909 [1987]: 650) notes in the course of defending\npluralism—which he took to be a radical doctrine—virtually\nall (pre-twentieth century) philosophers have conceived of the world\nas a genuine unity:\n\n\nWhether materialistically or spiritually minded, philosophers have\nalways aimed at cleaning up the litter with which the world apparently\nis filled. They have substituted economical and orderly conceptions\nfor the first sensible tangle; and whether these were morally elevated\nor only intellectually neat, they were at any rate always\naesthetically pure and definite, and aimed at ascribing to the world\nsomething clean and intellectual in the way of inner \nstructure.[40]\n\n\nSo the priority monist should conclude that, if anything, the argument\nfrom commonsense should be reversed. Commonsense does see the cosmos\nas more of a genuine unity than a mere heap (more like a syllable than\na heap of sand). One more passage from James (1907 [1991]: 59) may be\nuseful in mapping the general intellectual landscape, beyond the\nprovinces of the twentieth century Anglo-American tradition:\n\n\nA certain abstract monism, a certain emotional response to the\ncharacter of oneness, as if it were a feature of the world not\ncoordinate with its manyness, but vastly more excellent and eminent,\nis so prevalent in educated circles that we might almost call it part\nof philosophic common\n sense.[41]\n\n\n\nIn any case, as to 9, it is not obvious that commonsense is entitled\nto much of an opinion on the topic. One might well think that the use\nof intuitions is particularly perilous on this topic (in contrast to\nthe more mundane topic of existence pluralism) since the notion of\nontological priority is a somewhat sophisticated theoretical notion. I\nwould suggest that even if commonsense leans slightly towards priority\nmonism (as the overall history of metaphysics might be thought to bear\nout), this should not matter much. To the extent it provides any\nreason to favor priority monism, it seems to be a rather weak\nreason.\n3.2.2 Quantum emergence\n\nA second argument to consider is the argument from quantum\nemergence (Schaffer 2010a: §2.2; see also Ismael and\nSchaffer forthcoming). This argument, which is an argument for\npriority monism by way of quantum mechanics, may be posed as\nfollows:\n\nThe whole possesses emergent properties (due to quantum\nentanglement).\nIf the whole possesses emergent properties, then whole is prior to\npart.\nWhole is prior to part.\n\n\nThe argument is obviously valid, so the only remaining questions\nconcern the truth of the premises 11 and 12.\n\nAs to 11, the intended notion of an emergent property is one for which\nmereological supervenience\n fails.[42]\n Let \\(x\\) have proper parts. Then \\(F\\) is an emergent\nproperty of \\(x\\) iff (i) \\(x\\) instantiates \\(F\\), (ii)\n\\(F\\) is an intrinsic property, and (iii) \\(x\\)’s\ninstantiating \\(F\\) does not supervene on the intrinsic properties\nof, and spatiotemporal relations among, \\(x\\)’s proper\nparts. Such a property would be an intrinsic property of the whole\nthat is not determined by the intrinsic properties of and\nspatiotemporal relations among its parts.\n\nWhile any appeal to quantum mechanics sparks interpretive\ncontroversies, it seems that emergent properties are found in the\nentangled systems of quantum mechanics. An entangled system is one\nwhose state vector is not factorizable into tensor products of the\nstate vectors of its components:\n\n\n\\(\\Psi_{\\text{system}} \\ne \\Psi_{\\text{component1}} \\otimes \n  \\Psi_{\\text{component2}} \\otimes \\Psi_{\\text{component3}} \\otimes \\ldots\\) \n\n\nWhat this inequality means is that the quantum state of an entangled\nsystem contains information over and above that of the quantum states\nof the components. The intrinsic properties of entangled whole systems\ndo not supervene on the intrinsic properties of and spatiotemporal\nrelations among their component parts. Here Esfeld (1999: 26)\nnotes:\n\n\nIn the case of entanglement, it is only the description of the whole\nin terms of a pure state, such as the singlet state, which completely\ndetermines the local properties of the parts and their\nrelations… Therefore, quantum physics exhibits a substantial\nholism.\n\n\nIn a similar vein, Maudlin (1998: 56) concludes:\n\n\nThe physical state of a complex whole cannot always be reduced to\nthose of its parts, or to those of its parts together with their\nspatiotemporal relations, even when the parts inhabit distinct regions\nof space… The result of the most intensive scientific\ninvestigations in history is a theory that contains an ineliminable\nholism.\n\n\nEntangled systems are wholes that contain new information, found in\nthe correlation coefficients of their wave functions.\n\nThere is reason to think that the world forms a single entangled\nsystem, due to the fact that everything interacted in the Big Bang.\nEverything is a shard of the primordial atom. As Gribbin (1984: 229)\nexplains:\n\n\nParticles that were together in an interaction remain in some sense\nparts of a single system, which responds together to further\ninteractions. Virtually everything we see and touch and feel is made\nup of collections of particles that have been involved in interactions\nwith other particles right back through time, to the Big Bang…\nIndeed, the particles that make up my body once jostled in close\nproximity and interacted with the particles that now make up your\nbody. We are as much parts of a single system as the two photons\nflying out of the heart of the Aspect experiment.\n\n\nIndeed Zeh (2003: 33) notes that, given quantum decoherence, all\nseemingly localized particlesque behavior “can be dynamically\ndescribed in terms of a unitarily evolving (hence strongly entangled)\nuniversal wave function.” Thus there is reason to think that the\ncosmic whole possesses emergent properties, as 8 maintains.\n\nThough of course the claim that the world forms a single entangled\nsystem will be controversial (as will any claim that involves an\ninterpretation of quantum mechanics), in at least two respects. First,\ncertain kinds of anti-realist and relationalist interpretations of\nquantum mechanics (e.g., Rovelli 1996) posit an irreducible relation\nbetween the quantum system and an external observer, which preclude\nassigning a quantum state to the whole world (for lack of an observer\nexternal to it). Secondly, some interpretations (e.g.,\nGhirardi-Rimini-Weber) posit a separate dynamics of wave-function\ncollapse that breaks entanglements. But virtually any realist\ninterpretation of quantum mechanics that also posits an initial\nsingularity (the Big Bang) and unitary Schrödinger evolution will\nposit an entangled universe, since an initial singularity generates\nentanglement and Schrödinger evolution preserves it.\n\nI think that the best line for the priority pluralist to take is to\ndeny 11, by holding that (i) entanglement represents a new fundamental\nrelation between individual particles (as opposed to a new emergent\nproperty of whole systems), and (ii) mereological supervenience should\nbe revised to concern the supervenience of the intrinsic properties of\nwholes on the intrinsic properties of their parts plus any\nfundamental (as opposed to merely spatiotemporal) relations\namong their parts. Entangled quantum systems so understood will now\ncount as mereologically supervenient so\n understood.[43]\n\nThe priority pluralist’s “fundamental relation” move\nactually takes two main forms, each of which comes with distinct\nconcerns. One form posits a single irreducibly \\(n\\)-place\nrelation for \\(n\\)-particles. Thus Darby (2012: 14) argues that\nfundamental entanglement relations (unlike spatiotemporal relations\nand other fundamental external relations) cannot be treated as binary\nrelations, but must be regarded as irreducibly \\(n\\)-place\nrelation for \\(n\\)-particles:\n\n\nIt is not true, then, that all else supervenes on anything less than\nthe intrinsic properties of the whole system. The n-place relations\ninstantiated by the members of an n-party system are going to have to\ngo into the supervenience basis.\n\n\nThis is problematic in two respects, the first of which is that it\nmarks an unprecedented departure from more localist pictures. Thus\nDarby (2012: 14) continues: “[I]t is no longer possible to think\nof the world as being built up with these relations one component at a\ntime.” The second respect in which this fundamental\n\\(n\\)-place relation is problematic is that it makes the\nfundamental properties and relations at an entangled\n\\(n\\)-particle world at least partially distinct from the\nfundamental properties and relations at an entangled\n\\(n+1\\)-particle world (or at any entangled world with any number\nof particles other than \\(n)\\). This seems like a loss of\nunity.\n\nA second form of the priority pluralist’s “fundamental\nrelation” move posits only binary entanglement relations, but\nallows these to hold between individual particles and whole composite\nsystems. Thus Calosi (2014) shows that one can treat e.g., a fully\nentangled three particle system by positing a binary entanglement\nrelation between the first particle and the composite system made up\nof the second and third particles. This is problematic insofar as it\nposits fundamental entanglement relations relating entities that (by\nthe lights of the pluralist) are nonfundamental. How can the\nfundamental level “see” the composite system made up of\nparticles 1 and 2, in order to put that composite system in\nfundamental relation to particle 3, if the only individuals found at\nthe fundamental level are noncomposite?\n\nAs to 12, the idea is that a whole that does possess emergent\nproperties is thus “more than the sum of its parts.” Thus\nconsider the entangled quantum universe. As Toraldo di Francia (1998:\n28) aptly summarizes:\n\n\nSince any particle has certainly interacted with other particles in\nthe past, the world turns out to be nonseparable into\nindividual and independent objects. The world is in some way a single\nobject.\n\n\nLikewise Nadeau and Kafatos (1999: 4) say:\n\n\nIf nonlocality is a property of the entire universe, then we must also\nconclude that an undivided wholeness exists on the most basic and\nprimary level in all aspects of physical reality,\n\n\nand then go on (1999: 5) to speak of “a seamlessly\ninterconnected whole called the cosmos.” This fits with the\npriority monist picture on which the whole cosmos is basic and its\nproper parts are derivative.\n3.2.3 Atomless gunk\n\nA third argument to consider is the argument from gunk\n(Schaffer 2010a: §2.4), where “gunk” is something\nevery part of which has proper parts, and so is lacking any ultimate\nparts. This argument, which is an argument for priority monism by way\nof principles of modality, may be posed as follows:\n\nEither the ultimate parts must be basic at all worlds, or the\nultimate whole must be basic at all worlds.\nThere are gunky worlds without ultimate parts (and hence no\nultimate parts to be basic at those worlds).\nThe ultimate whole must be basic at all worlds.\n\n\nThe argument is obviously valid, so the only remaining questions\nconcern the truth of the premises 14 and 15.\n\nAs to 14, the idea is that the direction of priority must be a\nnecessary truth, at least with respect to all metaphysically possible\nworlds. It would be odd if there were worlds that were otherwise\nindiscernible, save for differing over what was prior to what. The\ndirection of priority seems to have the same status as other\nfundamental metaphysical claims (e.g., the debate over\n universals).[44]\n To know the direction of priority seems to be part of what Rosen\n(2006: 35) has in mind when he speaks of knowing:\n\n\n…what might be called the form of the world:\nprinciples governing how objects in general are put together. If the\nworld is a text then these principles constitute its syntax. They\nspecify the categories of basic constituents and the rules for their\ncombination. They determine how non-basic entities are generated from\nor ‘grounded’ in the basic\n array.[45]\n\n\nThat said, one might expect the priority pluralist to challenge 14,\nfor one of the following two reasons. First, the priority pluralist\nmight (on considering gunk, and maintaining her thesis that the parts\nare prior to the whole) declare that nothing is basic in gunky worlds.\nThings get ever more basic without limit. But this would run counter\nto ontological foundationalism, and the widespread idea that being\nneeds an ultimate ground (§3.1). This is no longer priority\npluralism but priority nihilism, as least for gunky worlds.\n\nSecond, the priority pluralist might (on wanting to maintain basic\nentities in a gunky scenario, but not wanting to take the whole as\nbasic) take some intermediate level of mereological structure to be\nbasic. But this is hardly thematic for the pluralist, as now she would\nbe treating these intermediate structures monistically, as prior to\ntheir parts. In any case it seems arbitrary, especially in cases where\nthere is no natural joint in the gunk. For instance, in the case of a\nhomogeneously pink cube of gunk, all the levels of mereological\nstructure (save for the top) are intermediate, and all are\nhomogeneously pink. Is there supposed to be a fact of the matter as to\nwhich intermediate level is really basic?\n\nTurning to 15, there seem to be good reason for accepting gunky\npossibilities. The best tests for whether a scenario is possible are\nwhether it is conceivable, logically consistent, and posited in\nserious scientific theories. Gunk passes every test (Schaffer 2003).\nIt is conceivable. For instance, it is conceivable that everything is\nextended, and that everything that is extended has two extended\nhalves. This generates a Zeno sequence of halvings without limit.\nFurther, gunk is logically consistent. Or at least, there are gunky\nmodels of classical mereology (Simons 1987: 41). Finally, gunk is\nscientifically serious. In this vein Georgi (1989: 456) has suggested\nthat effective quantum field theories might form an infinite tower\nwhich “goes down to arbitrary short distances in a kind of\ninfinite regression… just a series of layers without\nend.” Perhaps there are competing considerations that weigh\nagainst the possibility of gunk. Here we enter into deep issues\nconcerning the extent of what is\n possible.[46]\n\nThere is also room for the priority pluralist to claim a tu\nquoque, by arguing for the possibility of “worldless\njunk,” which is something every whole of which is a proper part,\nso that there is no ultimate whole. In this vein Bohn (2009) argues\nthat junk has an equal claim to gunk for being metaphysically\npossible. If there are both gunky as well as junky metaphysical\npossibilities—and even “hunky” possibilities that\nare both gunky and junky—then one will not be able to appeal to\neither ultimate parts or an ultimate whole consistently across\nmetaphysical possibilities. (As with tu quoque replies\ngenerally, the rejoinder from gunk leaves open what went\n“wrong” in the original argument of\n 14–16.[47])\n\nBut the priority monist can point to some crucial differences between\ngunk and junk that arguably justify only recognizing the metaphysical\npossibility of the former. Indeed it is doubtful that junk passes\nany of the tests for possibility that gunk passes. As to\nconceivability, it is hard to conceive that there is no limit to\nsummation at which one has taken in everything. As to logical\nconsistency, as least if this is judged with respect to classical\nmereology (arguably our best systematization of the logic of\npart-whole relations, and certainly the most orthodox), there is a\ndifference as well: classical mereology has gunky models but not junky\nmodels. The onus is on the defender of junk to produce an overall\nlogic of part-whole relations which tolerates junky models while being\nas plausible as orthodox classical\n mereology.[48]\n And as to scientific seriousness, while there is lots of work on\nphysical cosmology, it appears that virtually all of it takes for\ngranted that there is such a thing as the cosmos. Indeed it\nhardly seems to be an empirical question whether there could be such a\nthing as “the world,” and the reasons mentioned in\n§2.2 for thinking that there is such a thing equally serve as\narguments against the prospect of there being only worldless junk.\n3.2.4 Heterogeneity\n\nA fourth argument to consider is the argument from\nheterogeneity. This argument, which is an argument for priority\npluralism, may be posed as follows:\n\n Fundamental entities must be homogeneous.\nIf the whole world were fundamental, then the whole world would be\nhomogeneous.\nThe whole world is not homogeneous.\nThe whole world is not fundamental.\n\n\nThe argument is obviously valid, so the only remaining questions\nconcern the truth of the premises\n 17–19.[49]\n\nThe truth of 19 is perhaps evident. There is qualitative variation in\nthe world. Things are not uniform in all directions. The world is in\nfact not the kind of perfectly homogeneous sphere that Parmenides\n(quoted in Robinson 1968: 115) imagined it to be:\n\n\nBut since there is a furthest limit, it is complete on every side,\nlike the body of a well-rounded sphere, evenly balanced in every\ndirection from the middle; for it cannot be any greater or any less in\none place than in another.\n Rather, as even existence monists like Horgan and\nPotrč (2008: 168) will immediately acknowledge, “The cosmos\nexhibits enormous spatiotemporal structural complexity and\nnonhomogeneity.”\n\n\nSo the question is whether priority monism can account for the\nqualitative heterogeneity of the cosmos. Further, 18 follows from 17.\nSo the real question comes down to the status of 17.\n\nWhy think that fundamental entities must be homogeneous (as per 17)?\nHere are the best two (related) attempts one might make at defending\n17. First attempt: nothing can differ from itself. For a\nfundamental entity to be heterogeneous would be for it to be\ninternally diverse, which would render it different from\n itself.[50]\nSecond attempt: the priority pluralist has a way of\naccounting for heterogeneity that the monist lacks. The pluralist has\nmany fundamental entities, which may all be homogeneous, but might\nstill be different from each other. Hence if the only way to\naccount for heterogeneity were to have many fundamental homogeneous\nparts differing from each other, then the priority pluralist would\nhave the only way to account for heterogeneity. Perhaps this line of\nthought is behind the following passage from Turner (1911):\n\n\nThe weak point of all metaphysical Monism is its inability to explain\nhow, if there is but one reality, and everything else is only apparent\nthere can be any real changes in the world, or real relations among\nthings.\n\n\nHaving made an attempt to defend 17, it is time to turn to replies on\nbehalf of the priority monist. The starting reply is that internal\nheterogeneity within the basic must be allowed by everyone. Or at\nleast, the priority pluralist’s way of accounting for\nheterogeneity (above) is insufficient to account for all forms of\nheterogeneity. For there might be heterogeneity all the way\ndown, in the sense of matter every part of which has\nheterogeneous proper\n parts.[51]\n If this is possible, it shows that the pluralistic strategy of\naccounting for heterogeneity in terms of differences between\ninternally homogeneous parts is insufficient. In a partially similar\nvein, Taylor (1961: 88) claims that the pluralist can gain no\nadvantage:\n\n\nEither [the pluralist’s] units are mere units without internal\nvariety, and then it is easy to show that they are the merest\nnothings, or they have internal variety of their own, and therefore\nsimply repeat within themselves the problem they are supposed to\nsolve.\n\n\nIt must be possible to account for heterogeneity in other ways. It\nremains to describe these ways.\n\nWhat is needed is to find ways to allow for internal heterogeneity,\nwhich would not entail that anything is “different from\nitself.” Here are three possibilities, the first of which is to\nuse distributional\n properties.[52]\n The world might, for instance, have the property of being\npolka-dotted. Here there would be no question of the world being\n“different from itself,” or having any other problematic\nstatus. The claim that the world is polka-dotted is a coherent claim,\nwhich would entail heterogeneity among its derivative dots and\nbackground.\n\nThe second way to allow for heterogeneity without contradiction is to\nrelationalize properties. Here the idea (for monadic\nproperties at least) is that instantiation is a three-place relation\nholding between an object, a property, and a region. So the world\nmight be heterogeneous by, for instance, instantiating red here and\ngreen\n there.[53]\n\nThe third way to allow for heterogeneity without contradiction is to\nregionalize instantiation. Here the idea is that,\ninstead of regionalizing the properties, one might regionalize the\ninstantiation relation itself. So the world might be heterogeneous by,\nfor instance, instantiating-here red and instantiating-there green.\n(Since the regionalization is incorporated into the copula rather than\nthe predicate, this may be expressed adverbially, as\n“the world is here-ly red and there-ly green,” or\n“the world is red in a here-ly way, and green in a there-ly\n way.”[54])\n\nPerhaps there is a better way to defend 17, and perhaps there are\nproblems with all three of the monistic strategies that have been\nsketched (distributional properties, relationalized properties, and\nregionalized instantiations). This takes us deeper into issues about\nobjects and\n properties.[55]\n3.2.5 Intrinsicness\n\nA fifth argument to consider—drawn from Sider (2007b:\n§4)—is the argument from\n intrinsicness.[56]\n This argument, which is an argument against priority monism, turns on\nthe idea that the best analyses of intrinsicness presuppose the\nfundamentality of parts, and may be posed as follows:\n\nThere are real differences between the intrinsic and the extrinsic\nproperties of subcosmic objects.\nIf there are real differences between the intrinsic and the\nextrinsic properties of subcosmic objects, then subcosmic objects must\nbear fundamental properties.\nIf subcosmic objects bear fundamental properties, then priority\nmonism is false.\nPriority monism is false.\n\n\nThe argument is evidently valid, so the only remaining questions\nconcern the truth of the premises 21–23.\n\nThe priority monist could in principle try to contest 21, but the\nnotion of an intrinsic property looks to have important theoretical\nwork to\n do.[57]\n For instance, intrinsicness seems connected to other core notions\nlike duplication (duplicates agree in all of their intrinsic\nproperties) and change (change is change in intrinsic properties). If\none wants to say that some subcosmic objects are duplicates and some\nnot, or say that some subcosmic objects undergo change and some do\nnot, then it seems that one needs to posit a real difference between\nthe intrinsic and extrinsic properties of subcosmic objects. It seems\nto me that the priority monist should hope to capture this\nplausible distinction rather than erase it.\n\nThe priority monist could in principle also try to contest 23, but 23\nstems from a plausible connection between being a fundamental\nobject and bearing fundamental properties (Sider 2008:\n§1). It would be a cost to sever this connection. (Though it may\nbe that all parties will need to sever this connection in the end: for\ninstance, if priority relations themselves are fundamental, then there\nwill be nonfundamental objects in fundamental relations.)\n\nSo it seems to me that most of the action should be on 22, which\nessentially encodes a certain conception of intrinsicness defended (in\ndifferent forms) by Lewis 1986, Sider 1996, and Rosen 2010, which\nseems to build in some sort of preconceptions of fundamentality for\nthe parts and dependence on the parts. Thus Lewis (1986: 61) says:\n\n\n[T]wo things are duplicates iff (1) they have exactly the\nsame perfectly natural properties, and (2) their parts can be put into\ncorrespondence in such a way that corresponding parts have exactly the\nsame perfectly natural properties, and stand in the same perfectly\nnatural relations.\n\n\nLewis (1986: 62) then adds: “Then we can go on to say that an\nintrinsic property is one that can never differ between\nduplicates.” This requires subcosmic objects to bear perfectly\nnatural (/fundamental) properties. Otherwise it will be (vacuously)\ntrue, for any two subcosmic objects, that Lewis’s two conditions\nfor duplication are satisfied: these objects and their parts will have\nno perfectly natural properties whatsoever and a fortiori\ncannot differ in this\n respect.[58]\n\nIn a somewhat similar vein, Rosen (2010: 112) proposes:\n\n\n\\(F\\) is an intrinsic property iff, as a matter of necessity, for all\n\\(x\\): If \\(x\\) is \\(F\\) in virtue of \\(j(y)\\)—where \\(j(y)\\) is\na fact containing \\(y\\) as a constituent—then \\(y\\) is part of\n\\(x\\); and if \\(x\\) is not-\\(F\\) in virtue of \\(j(y)\\), then \\(y\\) is\npart of \\(x\\).\n\n\nGiven that the priority monist accepts that “in virtue of”\nclaims about facts run in concord with priority relations between\nobjects, from the cosmos down (e.g., I am sitting in virtue of the\ncosmos being as it is), this would have the bad result that no\nproperty that an object can have while being subcosmic can be an\nintrinsic property. For if a given subcosmic object \\(a\\) has\nproperty \\(F\\), the priority monist will say that \\(a\\) is\n\\(F\\) in virtue of the fact that the cosmos is such and so, where\nthe cosmos is not part of \\(a\\).\n\nThe priority pluralist who defends anything like Lewis’s or\nRosen’s conception of intrinsicness can thereby make the case\nfor 22. She might also—following Sider—make the more\nmodest case that these are the best definitions going. The priority\nmonist who would reject 18 thus, as Sider (2007b: 6) says, “owes\nus a story.”\n\nThe priority monist should ideally reply by giving a successful\ndefinition of intrinsicness that is compatible with her\n view.[59]\n But this may be too much to ask for: no one seems to have a fully\nsuccessful definition of intrinsicness . Perhaps the notion—or\nsome allied notion such as duplication—must in the end be taken\nas\n primitive.[60]\n In that case the priority monist is off the hook, since she too can\nsimply appeal to primitive intrinsicness to mark the real difference\nbetween the intrinsic and extrinsic properties of subcosmic objects.\n\n\nPending a successful definition, the priority monist may still play\ndefense in two main (and connected) ways. First, she may argue that\nboth Lewis’s and Rosen’s conceptions of intrinsicness are\nindependently known to be problematic (c.f. Weatherson and Marshall\n2012: §3), so that it is not such a big deal if priority monism\nis incompatible with either conception. Secondly, she may turn the\ntables, and—following Trogdon (2009)—maintain that any\nconflict between priority monism and a proposed definition of\nintrinsicness reflects badly on the proposed definition of\nintrinsicness. As Trogdon (2009: 137) explains, “For me,\npluralism and monism are each epistemic possibilities, so it is a\nvirtue of an account of intrinsicality to be neutral between\nthem.”\n\nThat said, it is perhaps fair to acknowledge some advantage to the\npriority pluralist at this stage of the discussion on intrinsicness,\ninsofar as her view fits with certain at least partially plausible\nattempts to define intrinsicness, and insofar as it is not yet know\nwhether the priority monist can make the same claim.\n3.2.6 Combinatorial constraints and internal relations\n\nA sixth argument to consider—drawn in part from Schaffer\n2010b—is the argument from free recombination. This\nargument, which may potentially be run in favor of either priority\npluralism or priority monism, begins with the idea that priority\npluralism is connected to the modal claim of free recombination. If\nthere really were multiple basic independent units of being—as\nthe priority pluralist claims—then these units should be, in\nHume’s (1748: 54) words, “entirely loose and\nseparate.” They should be freely recombinable in any which way.\nAny way the one can be and any way the other can be ought to be\ncompossible. A disconnected pluralistic heap thus should be amenable\nto free recombination, and thus failure of free recombination is the\nmodal signature of an interconnected monistic cosmos. The argument\nfrom free recombination thus begins with:\n\n Priority pluralism holds if and only if there are multiple\nconcreta that are open to free recombination.\n\n\nGiven 25, the priority pluralist may try to argue from the right\nbijunct to priority pluralism, and the priority monist may try to\nargue from the denial of the right bijunct to the denial of priority\npluralism (which still leaves open priority nihilism, but at least\neliminates the more popular competitor). So the argument\ncontinues:\n\nThere are (/are not) multiple concreta that are open to free\nrecombination.\nPriority pluralism holds (/does not hold).\n\n\nObviously the priority pluralist who runs this argument will run 26\nand 27 as stated, while the monist (or nihilist) will run their\nparenthetical variants.\n\nThe argument—in whichever direction it is run—is evidently\nvalid, so it remains to consider the premises. There are two main\nreasons why one might challenge 25. First, one might challenge the\nleft-to-right direction of 25 (from priority pluralism to free\nrecombination) by holding that free recombination is independently\nblocked. For instance, those who posit brute necessary connections in\nnature posit such brute necessary connections between the priority\npluralist’s basic units of being. Obviously here one enters into\ndeeper issues concerning modality, and the extent to which brute\nnecessary connections are or are not\n tolerable.[61]\n\nA second reason why one might challenge 25 is a challenge to the\nright-to-left direction (from free recombination to priority\npluralism). While priority pluralism arguably entails free\nrecombination, it is not obvious that priority monism should entail\nany lack of free recombination. Just because multiple concreta have a\ncommon ground in the cosmos does not mean that these concreta\ncannot be freely recombined. Perhaps modal constraint entails\nontological connection; but it is not obvious why ontological\nconnection should entail modal constraint. If so then the priority\nmonist might have a special flexibility with respect to whether or not\nthere is free recombination.\n\nBut it is likely that most of the action will fall on 26. Whether or\nnot one permits free recombination between multiple concreta will turn\non one’s background views on other matters. For instance, if one\ncombines “causal essentialist” views of properties on\nwhich properties confer their powers essentially, with “natural\nkind” views of things on which things fall under their natural\nkinds essentially, one will find that all things have essential\n“fit” requirements into their causal\n contexts.[62]\n\nPerhaps what is most interesting about the connection between modal\nconstraints and the debate over priority monism is that it shows that\n“Humeanism” about fundamentality and\n“Humeanism” about modality may come as a package\n deal.[63]\n There seem to be at least three main packages of views to consider.\nFirst, there is the package of pluralism plus modal freedom between\nthese multiple units of being. Secondly, there is the package of\npluralism plus brute necessary connections in nature. Thirdly, there\nis the package of priority monism without modal freedom between\nmultiple concreta. This monistic option may allow one to combine a\nrejection of brute necessary connections in nature with an absence of\nfree\n recombination.[64]\n\nThe argument from combinatorial constraints may be connected to the\nclassic monistic argument from the internal relatedness of all things\n(Schaffer 2010b). A strong notion of internal relatedness is one on\nwhich two entities are internally related if and only if neither can\nexist without the other (necessarily, either both exist or neither\nexist). The idea of combinatorial constraints may be seen as a useful\nweakening of this strong notion of internal relatedness. So\nunderstood, to claim that all things are internally related just is to\nclaim that there are combinational constraints between all things, and\nthe inference from the internal relatedness of all things to priority\nmonism just is the inference from combinatorial constraints to a\nholistic common ground, which accounts for the constraints. \n3.2.7 Nomic integrity and island universes\n\nA seventh argument to consider—drawn from Schaffer 2013—is\nthe argument from nomic integrity. This argument notes that\nthe world is a single integrated causal system, and uses that\nobservation to argue for priority monism as follows:\n\nBasic objects evolve by the fundamental laws.\nThe cosmos is the one and only thing which evolves by the\nfundamental laws.\nThe cosmos is the one and only basic object.\n\n\nThe core idea is that our fundamental laws of nature govern the\ntemporal evolution of the cosmos as a whole, applying at most\napproximately and derivatively to any merely partial subsystem, such\nthat “the cosmos ticks like a single clockwork” and\n“reality acts as one” (Schaffer 2013: 67). As Ellis (2001:\n249) says:\n\nIt is possible to say a great deal about the world as a whole. We can\npoint to global structuring principles, universal processes of world\nevolution, general symmetries, a common ontological basis of reality,\na single origin of the universe, and various universally conserved\nquantities … The world [has] a highly integrated and coherent\nstructure.\n\n\nIn other words, the causal/nomic structure of the world makes it look\nmore like an integrated unity than a mere heap.\n\nThe priority pluralist or nihilist could deny 29, but 29 seems to fit\na fairly standard image in philosophy of science. Thus Maudlin (2007:\n172) writes:\n\n[T]he fundamental laws of nature appear to be laws of temporal\nevolution: they specify how the state of the universe will, or might,\nevolve from a given initial state.\n\n\n29 is just an expression of the idea that nomic evolutions concern\nstates of the whole universe, and not mere subsystems. One way to\nsupport this idea is to note that nomic evolutions concern the\nbehavior of closed systems, and only the universe as a whole\nforms a closed system.\n\nRather the priority pluralist or nihilist is more likely to deny 28,\nand say that it is too demanding a standard for basicness. In this\nvein, Miller (2014) responds by allowing that it is a necessary\ncondition on a plurality being the plurality of basic objects that\nthey plurally evolve by the fundamental laws, but adding that further\nconstraints on fundamentality can also come in to filter out bad\npluralities (such as the plurality of each left foot, plus the rest of\nthe cosmos minus the fusion of all the left feet).\n\nPriority pluralists can also use modalized versions of 28\n(“Necessarily, basic objects evolve by the fundamental\nlaws”) plus the possibility of island universes to pose a\nproblem for the priority monist (Schaffer 2013: 83, Baron and Tallant\n2016, Siegel 2016). An island universe in the sense relevant to the\nargument is not a spatiotemporally disconnected universe with multiple\ndisconnected regions (as discussed by Lewis 1986: 71–3), but a\ncausally disconnected universe with multiple causally/nomically\nseparate closed systems. The counter-argument (compare Baron &\nTallant 2016: 590) is that such island universes are possible, and\nso—given a modalized version of 28—scenarios with a\nplurality of basic objects are possible, and so priority monism is not\nnecessarily true. Tack on the premise that if priority monism is true\nthen it is necessarily true, and it follows that priority monism is\nfalse.\n\nThe main options for the priority monist seem to be denying the\nmodalized version of 28 (Schaffer 2013: 84), and so claiming that\npriority monism holds even at island universes; or denying the final\npremise that if priority monism is true then it is necessarily true,\nand instead claiming that the matter is contingent (Siegel 2016). But\nwhatever option the priority monist should take, it is hard to see how\nan argument premised on the claim that it is necessary that basic\nobjects evolve by the fundamental laws, could refute priority monism\nin the end, given the claim in 29 that the cosmos is the one and only\nthing which actually evolves by the fundamental laws. That much at\nleast gets us the actual truth of priority monism.\n3.2.8 Modal cut and paste\n\nThere are further arguments to consider against priority monism, which\nuse modal cut and paste principles to either paste our cosmos into a\nbigger world, or cut parts of our cosmos to make a smaller world. Here\nis a way to run the pasting argument:\n\nIf priority monism is true, then priority monism is necessarily\ntrue.\nFundamentality is an intrinsic property that does not differ among\nduplicates.\nIt is possible that a duplicate of our cosmos could be embedded as\na proper part of a larger cosmos.\nIf priority monism is necessarily true then fundamentality is not\nan intrinsic property and does differ among duplicates.\nPriority monism is not true.\n\n\nThe core idea is that it is possible that a duplicate of our cosmos\nCos could be embedded in a still larger world \\(w^+\\). If priority monism\nis necessary then it holds at \\(w^+\\) so Cos (being a mere proper part of\n\\(w^+\\) is not fundamental at \\(w^+\\). But if Cos is not fundamental at \\(w^+\\), and\nfundamentality never differs between duplicates then the cosmos is not\nactually fundamental at our world, since it has a non-fundamental\nduplicate at \\(w^+\\).\n\nThe priority monist could deny 31, but that presumably means\nabandoning the argument from gunk (in particular thesis 14). The\npriority monist could also deny 33 but that seems desperate. It may be\nthat the priority monist is best advised to deny 32, and maintain that\nfundamentality is an extrinsic property. After all, she identifies\nfundamentality with the extrinsic status of mereological maximality.\nIt is not clear what the positive argument would be for 32, but the\npriority monist could float some independent counterexamples such as:\n(1) a given phenomenal feel, which is not fundamental at physicalist\nworlds but is fundamental at dualist worlds; and (2) the entire\nphysical world, which is fundamental at physicalist worlds but is not\nfundamental at worlds where it is sustained by a more fundamental\ndeity.\n\nA related argument is the cutting argument, from Steinberg\n(2015: 2026; see also Benocci 2017 and Calosi forthcoming), which uses\nthe idea of cutting out parts of our cosmos to make a smaller world.\nThe argument may be phrased as:\n\nPriority is an internal relation.\nIf priority monism is true, then priority monism is necessarily\ntrue.\nAny object and its parts could be an entire world.\nSome parts are prior to wholes.\n\n\nThe guiding idea here is to use 36, 38, and 39 to show that monism is\npossibly false, by finding a whole whose parts are prior to it, and\nthen cutting away the rest to leave a world whose parts remain prior\nto it.\n\n36 is much harder to deny than 31, 37 is just 32 again, 38 seems\nplausible, and 39 is just the commonsense attitude towards mere heaps\n(§3.2.1). Steinberg thinks the priority monist should deny 39,\nbut take this to be “a heavy burden” and seems inclined to\nreject priority monism. Benocci denies 37, and Calosi denies 38.\n\nThere may be a tuquoque argument in the works against the\npriority pluralist, that replaces 37 with the analogue claim for the\npluralist: \n\nIf priority pluralism is true, then priority pluralism is\nnecessarily true.\n\n\nAnd then replaces 39 with:\n\nSome wholes are prior to parts.\n\n\n41 is just the commonsense attitude towards integrated unities, that\nare not like a heap but like a syllable (§3.2.1). Like all\ntu quoque arguments, this does not show what went\nwrong in the original. But something must go. 36–38 paired with\n36, 38, and 40 seem to drive us to the extreme view that every\npossible part-whole complex exhibits the same direction of dependence\n(leaving open which direction this is), no matter how heap-like or how\nsyllable-like it may be. Perhaps what these arguments reveal is that\nthe nuanced stance of commonsense is not sustainable. This leaves open\nwhich direction needs revision.\n\nObviously there is a great deal more that could be said, but overall\nit is perhaps fair to conclude that priority monism deserves serious\nreconsideration, of a kind that it is now beginning to receive. There\nseem to be no knockdown arguments against priority monism. Or at\nleast, none of the arguments against priority monism surveyed here\nseem in any way decisive. This may be surprising to those raised on\nthe idea that monism can only be some obscure or ridiculous idea.\nMoreover, there may even be some decent arguments for priority monism.\nOr at least, the arguments for priority monism surveyed here seem to\nhave some potential, given further cultivation. This terrain has lain\nfallow for nearly one hundred years.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Albert, David, 1996, “Elementary Quantum Metaphysics,”\nin <em>Bohmian Mechanics and Quantum Theory: An Appraisal</em>, James\nT. Cushing, Arthur Stock, and Sheldon Goldstein (eds), Dordrecht:\nKluwer Academic Publishers, 277–84.",
                "Alston, William and Jonathan Bennett, 1984, “Identity and\nCardinality,” <em>Philosophical Review</em> 93:\n553–67.",
                "Aristotle. <em>Metaphysics</em>, trans. W. D. Ross, Oxford: Oxford\nUniversity Press, 1953,",
                "Armstrong, D. M., 1978a, <em>Nominalism and Realism: Universals\nand Scientific Realism Volume I</em>, Cambridge: Cambridge University\nPress.",
                "–––, 1978b, <em>A Theory of Universals :\nUniversals and Scientific Realism Volume II</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1997, <em>A World of\nStates-of-Affairs</em>, Cambridge: Cambridge University Press.",
                "–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.",
                "Barnes, Elizabeth, 2012, “Emergence and\nFundamentality,” <em>Mind</em>, 121: 873–901.",
                "Baron, Sam and Jonathan Tallant, 2016, “Monism: The Islands\nof Plurality,” <em>Philosophy and Phenomenological\nResearch</em>, 93(3): 583–606.",
                "–––, 2018, “Do Not Revise Occam’s\nRazor without Necessity,” <em>Philosophy and Phenomenological\nResearch</em>, 96(3): 596–619.",
                "Baxter, Donald, 1988, “Many-One Identity,”\n<em>Philosophical Papers</em>, 17: 193–216.",
                "Bennett, Jonathan, 1984, <em>A Study of Spinoza’s\nEthics</em>, Indianapolis, IN: Hackett Publishing Company.",
                "–––, 1991, “Spinoza’s Monism: A\nReply to Curley,” in <em>God and Nature: Spinoza’s\nMetaphysics</em>, Yirmiyahu Yovel (ed.), Leiden: E. J. Brill,\n53–59.",
                "Bennett, Karen, 2011, “Construction Area (No Hard Hat\nRequired),” <em>Philosophical Studies</em>, 154:\n79–104.",
                "–––, 2017, <em>Making Things Up</em>, Oxford:\nOxford University Press.",
                "Benocci, Matteo, 2017, “Priority Monism and Essentiality of\nFundamentality: A Reply to Steinberg,” <em>Philosophical\nStudies</em>, 174: 1983–90.",
                "Blanshard, Brand, 1973, <em>Reason and Analysis</em>, La Salle,\nIN: Open Court.",
                "Bliss, Ricki, 1973, <em>Reality and its Structure: Essays in\nFundamentality</em>, Oxford: Oxford University Press.",
                "Bohn, Einar Duenger, 2009, “Must There Be a Top\nLevel?” <em>Philosophical Quarterly</em>, 59:\n193–201.",
                "–––, 2012, “Monism, Emergence, and Plural\nLogic,” <em>Erkenntnis</em>, 76: 211–23.",
                "–––, 2014, “Unrestricted Composition as\nIdentity,” in <em>Composition as Identity</em>, Aaron Cotnoir\nand Donald Baxter (eds), Oxford: Oxford University Press,\n143–68.",
                "Bradley, F. H., 1994, <em>Writings on Logic and Metaphysics</em>,\nJames W. Allard and Guy Stock (eds), Oxford: Oxford University\nPress.",
                "Bricker, Phillip, 1991, “Plenitude of Possible\nStructures,” <em>The Journal of Philosophy</em>, 88:\n607–19.",
                "Broad, C. D., 1925, <em>The Mind and its Place in Nature</em>,\nLondon: Keegan Paul, Trench, Trubner &amp; Co.",
                "Burgess, John and Gideon Rosen, 1997, <em>A Subject with no\nObject</em>, Oxford: Oxford University Press.",
                "Calosi, Claudio, 2014, “Quantum Mechanics and Priority\nMonism,” <em>Synthese</em>, 191: 1–14.",
                "–––, 2018, “Quantum Monism: An\nAssessment,” <em>Philosophical Studies</em>, 175:\n3217–36.",
                "–––, forthcoming, “Priority Monism,\nDependence, and Fundamentality,” <em>Philosophical\nStudies</em>.",
                "Cameron, Ross, 2008a, “Truthmakers and Ontological\nCommitment: Or How to Deal with Complex Objects and Mathematical\nOntology without Getting into Trouble,” <em>Philosophical\nStudies</em>, 140: 1–18.",
                "–––, 2008b, “Turtles All the Way Down:\nRegress, Priority, and Fundamentality,” <em>Philosophical\nQuarterly</em>, 58: 1–14.",
                "–––, 2010a, “How to Have a Radically\nMinimal Ontology,” <em>Philosophical Studies</em>, 151:\n249–64.",
                "–––, 2010b, “From Humean Truthmaker Theory\nto Priority Monism,” <em>Nous</em>, 44: 178–98.",
                "Campbell, Keith, 1990, <em>Abstract Particulars</em>, Oxford:\nBasil Blackwell.",
                "Candlish, Stewart and Pierfrancesco Basile, 2013, “Francis\nHerbert Bradley,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2013 Edition), Edward N. Zalta (ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2013/entries/bradley/\" target=\"other\">https://plato.stanford.edu/archives/spr2013/entries/bradley/</a>&gt;.",
                "Casati, Roberto and Achille Varzi, 1994, <em>Holes and Other\nSuperficialities</em>, Cambridge, MA: MIT Press.",
                "Chisholm, Roderick, 1957, <em>Perceiving: A Philosophical\nStudy</em>, Ithaca, NY: Cornell University Press.",
                "Cornell, David, 2013, “Monism and Statespace: A Reply to\nSider,” <em>Analysis</em>, 73: 230–36.",
                "Curd, Patricia, 1998, <em>The Legacy of Parmenides</em>,\nPrinceton, NJ: Princeton University Press.",
                "Curley, Edwin, 1969, <em>Spinoza’s Metaphysics</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1991, “On Bennett’s\nInterpretation of Spinoza’ Monism,” in <em>God and Nature:\nSpinoza’s Metaphysics</em>, Yirmiyahu Yovel (ed.), Leiden: E. J.\nBrill, 35–51.",
                "Daly, Chris, 2012, “Skepticism about Grounding,” in\n<em>Metaphysical Grounding: Understanding the Structure of\nReality</em>, Fabrice Correia and Benjamin Schnieder (eds), Cambridge:\nCambridge University Press, 81–100.",
                "Darby, George, 2012, “Relational Holism and Humean\nSupervenience,” <em>British Journal for the Philosophy of\nScience</em>, 63: 773–88.",
                "Della Rocca, Michael, 2008, <em>Spinoza</em>, London:\nRoutledge.",
                "–––, 2014, “Razing Structures to the\nGround,” <em>Analytic Philosophy</em>, 55(3): 276–94.",
                "Descartes, Rene, 1644, “Principles of Philosophy,” in\n<em>The Philosophical Writings of Descartes: Volume 1</em>, John\nCottingham, Robert Stoothoff, and Dugald Murdoch (eds.), Cambridge:\nCambridge University Press, 1984: 177–291.",
                "Eddon, Maya, 2011, “Intrinsicality and\nHyperintensionality,” <em>Philosophy and Phenomenological\nResearch</em>, 82: 314–36.",
                "Esfeld, Michael, 1999, “Quantum Holism and the Philosophy of\nMind,” <em>Journal of Consciousness Studies</em>, 6:\n23–38.",
                "Fiddaman, Mark and Gonzalo Rodriguez-Pereyra, 2018, “The\nRazor and the Laser,” <em>Analytic Philosophy</em> 59(3):\n341–58.",
                "Fine, Kit, 1991, “The Study of Ontology,”\n<em>Nous</em>, 25: 263–94.",
                "–––, 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8: 1–16.",
                "–––, 2001, “The Question of\nRealism,” <em>Philosophers Imprint</em>, 1: 1–30.",
                "–––, 2012, “Guide to Ground,” in\n<em>Metaphysical Grounding: Understanding the Structure of\nReality</em>, Fabrice Correia and Benjamin Schnieder (eds), Cambridge:\nCambridge University Press, 37–80.",
                "Frege, Gottlob, 1884, <em>The Foundations of Arithmetic</em>,\ntrans. J. L. Austin, Evanston, IL: Northwestern University Press,\n1953.",
                "Geach, Peter, 1962, <em>Reference and Generality: An Examination\nof Some Medieval and Modern Theories</em>, Ithaca, NY: Cornell\nUniversity Press.",
                "Gendler, Tamar and John Hawthorne, 2002, <em>Conceivability and\nPossibility</em>, Oxford: Oxford University Press.",
                "Georgi, Howard, 1989, “Effective Quantum Field\nTheories,” in <em>The New Physics</em>, Paul Davies (ed.),\nCambridge: Cambridge University Press, 446–57.",
                "Gill, Mary Louise, 1989, <em>Aristotle on Substance: The Paradox\nof Unity</em>, Princeton, NJ: Princeton University Press.",
                "Goff, Philip, 2012a, “There is More than One Thing,”\nin Goff 2012b: 113–22.",
                "––– (ed.), 2012b, <em>Spinoza on Monism</em>,\nBasingstoke: Palgrave Macmillan.",
                "Goodman, Nelson and W. V. O. Quine, 1947, “Steps Towards a\nConstructive Nominalism,” <em>Journal of Symbolic Logic</em>,\n12: 105–22.",
                "Gribbin, John, 1984, <em>In Search of Schrodinger’s Cat:\nQuantum Physics and Reality</em>, New York, NY: Bantam Books.",
                "Guigon, Ghislain, 2012, “Spinoza on Composition and\nPriority,” in Goff 2012b: 183–205.",
                "Halvorson, Hans and Rob Clifton, 2002, “No Place for\nParticles in Relativistic Quantum Theories?” <em>Philosophy of\nScience</em>, 69: 1–28.",
                "Hartle, James and Stephen Hawking, 1983, “Wave function of\nthe Universe,” <em>Physics Review</em> D, 28:\n2960–75.",
                "Hawthorne, John and Andrew Cortens, 1995, “Towards\nOntological Nihilism,” <em>Philosophical Studies</em>, 79:\n143–65.",
                "Heil, John 2003, <em>From an Ontological Point of View</em>,\nOxford: Oxford University Press.",
                "Hoffman, Joshua and Gary S. Rosenkrantz, 1997, <em>Substance: Its\nNature and Existence</em>, London: Routledge.",
                "Hofweber, Thomas, 2009, “Ambitious, Yet Modest,\nMetaphysics,” in <em>Metametaphysics: New Essays on the\nFoundations of Ontology</em>, David Chalmers, David Manley, and Ryan\nWasserman (eds), Oxford: Oxford University Press, 260–89.",
                "Horgan, Terence and Matjaž Potrč, 2000,\n“Blobjectivism and Indirect Correspondence,” <em>Facta\nPhilosophica</em>, 2: 249–70.",
                "–––, 2006, “Abundant Truth in an Austere\nWorld,” in <em>Truth and Realism: New Essays</em>, Michael Lynch\nand Patrick Greenough (eds), Oxford: Oxford University Press,\n137–67.",
                "–––, 2008, <em>Austere Realism: Contextual\nSemantics Meets Minimal Ontology</em>, Cambridge, MA: MIT Press.",
                "–––, 2012, “Existence Monism Trumps\nPriority Monism,” in Goff 2012b: 51–76..",
                "Hudson, Hud, 2001, <em>A Materialist Metaphysics of the Human\nPerson</em>, Ithaca, NY: Cornell University Press.",
                "Hume, David 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, Peter Millican (ed.), Oxford: Oxford University\nPress, 2007,",
                "Ismael, Jenann and Jonathan Schaffer, forthcoming, “Quantum\nHolism: Nonseparability as Common Ground,”\n<em>Synthese</em>.",
                "James, William, 1907, <em>Pragmatism</em>. Amherst, NY: Prometheus\nBooks, 1991,",
                "–––, 1909, “A Pluralistic Universe:\nHibbert Lectures at Manchester College on the Present Situation in\nPhilosophy,” in <em>William James: Writings\n1902–1910</em>, Bruce Kuklick (ed.), New York, NY: Viking Press,\n1987, 625–819.",
                "Joad, C. E. M., 1957, <em>Guide to Philosophy</em>, Mineola, NY:\nDover Publications.",
                "Johnston, Mark, 1987, “Is there a Problem about\nPersistence?” <em>Proceedings of the Aristotelian Society Supp.\nVol.</em>, 61: 107–35.",
                "Korman, Daniel Z., 2008, “Review of Horgan and\nPotrč’s Austere Realism,” <em>Notre Dame\nPhilosophical Reviews</em>, 2008,10.22,\n [<a href=\"http://ndpr.nd.edu/news/23810/?id=14508\" target=\"other\">Korman 2008 available online</a>].",
                "Kriegel, Uriah 2012, “Kantian Monism,”\n<em>Philosophical Papers</em>, 41: 23–56.",
                "Leibniz, G. W. F., 1714, “The Monadology,” in <em>The\nRationalists</em>, trans. George Montgomery, New York, NY: Doubleday,\n1960, 455–71.",
                "Lewis, David, 1983, “New Work for a Theory of\nUniversals,” <em>Australasian Journal of Philosophy</em>, 61:\n343–77.",
                "–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Basil Blackwell.",
                "–––, 1991, <em>Parts of Classes</em>, Oxford:\nBasil Blackwell.",
                "–––, 2002, “Tensing the Copula,”\n<em>Mind</em>, 111: 1–14.",
                "Loewer, Barry, 2001, “From Physics to Physicalism,” in\n<em>Physicalism and its Discontents</em>, Carl Gillet and Barry Loewer\n(eds), Cambridge: Cambridge University Press, 37–56.",
                "Lowe, Jonathan, 2012, “Against Monism,” in <em>Spinoza\non Monism</em>, Philip Goff (ed.), New York, NY: Palgrave-MacMillan:\n92–112.",
                "Maudlin, Tim, 1998, “Part and Whole in Quantum\nMechanics,” in <em>Interpreting Bodies: Classical and Quantum\nObjects in Modern Physics</em>, Elena Castellani (ed.), Princeton, NJ:\nPrinceton University Press: 46–60.",
                "McDaniel, Kris, 2009, “Extended Simples and Qualitative\nHeterogeneity,” <em>Philosophical Quarterly</em>, 59:\n325–31.",
                "Merricks, Trenton, 2001<em>. Objects and Persons</em>, Oxford:\nOxford University Press.",
                "–––, 2003, “Replies,” in\n<em>Philosophy and Phenomenological Research</em>, 67:\n727–44.",
                "Miller, Kristie, 2009, “Defending Contingentism in\nMetaphysics,” <em>Dialectica</em>, 63: 23–49.",
                "Moore, G. E., 1993, <em>G. E. Moore: Selected Writings</em>,\nThomas Baldwin (ed.), London: Routledge.",
                "Morganti, Matteo, 2009, “Ontological Priority,\nFundamentality and Monism,” <em>Dialectica</em>, 63:\n271–88.",
                "Muirhead, J. H., 1935, <em>Bernard Bosanquet and His Friends</em>,\nLondon: Allen and Unwin.",
                "Mumford, Stephen, 2004, <em>Laws in Nature</em>, London:\nRoutledge.",
                "Nadeau, Robert and Menas Kafatos, 1999, <em>The Non-Local\nUniverse: The New Physics and Matters of the Mind</em>, Oxford: Oxford\nUniversity Press.",
                "Nolan, Daniel, 1996, “Recombination Unbound,”\n<em>Philosophical Studies</em>, 84: 239–62.",
                "–––, 1997, “Impossible Worlds: A Modest\nApproach,” <em>Notre Dame Journal of Formal Logic</em>, 38:\n535–72.",
                "O’Conaill, Donnchadh and Tuomas Tahko, 2012, “On the\nCommon Sense Argument for Monism,” in Goff 2012b:\n149–66.",
                "Owen, G. E. L., 1960, “Eleatic Questions,” <em>The\nClassical Quarterly</em>, 10: 84–102.",
                "Parsons, Josh, 2004, “Distributional Properties,” in\n<em>Lewisian Themes</em>, Frank Jackson and Graham Priest (eds),\nOxford: Oxford University Press: 173–80.",
                "Paul, L. A., 2002, “Logical Parts,” <em>Nous</em>, 36:\n578–96.",
                "–––, 2013, “Categorical Priority and\nCategorical Collapse,” <em>Proceedings of the Aristotelian\nSociety Supp. Vol.</em>, 87: 89–113.",
                "Plato, <em>The Collected Dialogues of Plato</em>, Edith Hamilton\nand Huntington Cairns (eds), Princeton, NJ: Princeton University\nPress, 1961.",
                "Rea, Michael, 2001, “How to be an Eleatic Monist,”\n<em>Philosophical Perspectives</em>, 15: 129–51.",
                "Robinson, Howard, 2011, “Dualism,” <em>The Stanford\nEncyclopedia of Philosophy</em> (Winter 2012 Edition), Edward N. Zalta\n(ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/win2012/entries/dualism/\" target=\"other\">https://plato.stanford.edu/archives/win2012/entries/dualism/</a>&gt;.",
                "Robinson, John Mansley, 1968, <em>An Introduction to Early Greek\nPhilosophy: The Chief Fragments and Ancient Testimony (with Connecting\nCommentary)</em>, Boston, MA: Houghton Mifflin.",
                "Rodriguez-Pereyra, Gonzalo, 2002, <em>Resemblance Nominalism: A\nSolution to the Problem of Universals</em>, Oxford: Oxford University\nPress.",
                "–––, 2005, “Why Truthmakers,” in\n<em>Truthmakers</em>: <em>The Contemporary Debate</em>, Helen Beebee\nand Julian Dodd (eds), Oxford: Oxford University Press,\n17–31.",
                "Rosen, Gideon, 2006, “The Limits of Contingency,” in\n<em>Identity and Modality</em>, Fraser MacBride and Crispin Wright\n(eds), Oxford: Oxford University Press, 13–39.",
                "–––, 2010, “Metaphysical Dependence:\nGrounding and Reduction,” in <em>Modality: Metaphysics, Logic,\nand Epistemology</em>, Robert Hale and Aviv Hoffman (eds), Oxford:\nOxford University Press, 109–36.",
                "Rovelli, Carlo, 1996, “Relational Quantum Mechanics,”\n<em>International Journal of Theoretical Physics</em>, 35:\n1637–68.",
                "Royce, Josiah, 1900, <em>The World and the Individual</em>, New\nYork, NY: The Macmillan Company.",
                "–––, 1967, <em>The Spirit of Modern\nPhilosophy</em>, New York, NY: W. W. Norton &amp; Company.",
                "Russell, Bertrand, 1911, “Analytic Realism,” in\n<em>Russell on Metaphysics</em>, Stephen Mumford (ed.), London:\nRoutledge, 2003, 91–96.",
                "–––, 1918, “The Philosophy of Logical\nAtomism,” in <em>The Philosophy of Logical Atomism</em>, David\nPears (ed.), La Salle, IN: Open Court, 1985, 35–155.",
                "Rutherford, R. B., 1989, <em>The Meditations of Marcus Aurelius\nAntonius</em>, trans. A. S. L. Farquharson, Oxford: Oxford University\nPress.",
                "Schaffer, Jonathan, 2003, “Is There a Fundamental\nLevel?” <em>Nous</em>, 37: 498–517.",
                "–––, 2007, “From Nihilism to\nMonism,” <em>Australasian Journal of Philosophy</em>, 85:\n175–91.",
                "–––, 2008, “Truthmaker Commitments,”\n<em>Philosophical Studies</em>, 141: 7–19.",
                "–––, 2009a, “On What Grounds What,”\nin <em>Metametaphysics: New Essays on the Foundations of\nOntology</em>, David Chalmers, David Manley, and Ryan Wasserman (eds),\nOxford: Oxford University Press, 347–83.",
                "–––, 2009b, “Spacetime the One\nSubstance,” <em>Philosophical Studies</em>, 145:\n131–48.",
                "–––, 2010a, “Monism: The Priority of the\nWhole,” <em>Philosophical Review</em>, 119: 31–76.",
                "–––, 2010b, “The Internal Relatedness of\nAll Things,” <em>Mind</em>, 119: 341–76.",
                "–––, 2010c, “The Least Discerning and Most\nPromiscuous Truthmaker,” <em>Philosophical Quarterly</em>, 60:\n307–24.",
                "–––, 2012, “Why the World has Parts: Reply\nto Horgan and Potrč,” in Goff 2012b: 77–91.",
                "–––, 2013, “The Action of the\nWhole,” <em>Proceedings of the Aristotelian Society Supp.\nVol.</em>, 87: 67–87.",
                "–––, 2015, “What Not to Multiply without\nNecessity,” <em>Australasian Journal of Philosophy</em>, 93(4):\n644–64.",
                "–––, 2016, “Grounding in the Image of\nCausation,” <em>Philosophical Studies</em>, 173(1):\n49–100.",
                "Sedley, David, 1999, “Parmenides and Melissus,” in\n<em>The Cambridge Companion to Early Greek Philosophy</em>, A. A. Long\n(ed.), Cambridge: Cambridge University Press, 113–33.",
                "Segal, Aaron, 2014, “Causal Essentialism and Mereological\nMonism,” <em>Philosophical Studies</em>, 169:\n227–255.",
                "Sider, Theodore, 1993, “Van Inwagen and the Possibility of\nGunk,” <em>Analysis</em>, 53: 285–89.",
                "–––, 1996, “Intrinsic Properties,”\n<em>Philosophical Studies</em>, 83: 1–27.",
                "–––, 2001, <em>Four-Dimensionalism: An Ontology\nof Persistence and Time</em>, Oxford: Oxford University Press.",
                "–––, 2003, “What’s So Bad About\nOverdetermination?” <em>Philosophy and Phenomenological\nResearch</em>, 67: 719–26.",
                "–––, 2007a, “Parthood,”\n<em>Philosophical Review</em>, 116: 51–91.",
                "–––, 2007b, “Against Monism,”\n<em>Analysis</em>, 67: 1–7.",
                "–––, 2008, “Monism and Statespace\nStructure,” in <em>Being: Developments in Contemporary\nMetaphysics</em>, Robin Le Poidevin (ed.), Cambridge: Cambridge\nUniversity Press, 129–50.",
                "Siegel, Max, 2016, “Priority Monism is Contingent,”\n<em>Thought</em>, 5(1): 23–32.",
                "Simons, Peter, 1987, <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.",
                "–––, 2003, “The Universe,” Ratio,\n16: 237–50.",
                "Skiles, Alexander, 2009, “Trogdon on Monism and\nIntrinsicality,” <em>Australasian Journal of Philosophy</em>,\n87: 149–54.",
                "–––, 2014, “Primitivism about\nIntrinsicality,” in <em>Companion to Intrinsic Properties</em>,\nRobert Francescotti (ed.), Berlin: Walter De Gruyter,\n221–52.",
                "Spinoza, Benedict, 1677, “Ethics,” in <em>The\nCollected Writings of Spinoza, vol. 1</em><em>, trans. Edwin\nCurley,</em> Princeton, NJ: Princeton University Press, 1985.",
                "Stace, W. T., 1955, <em>The Philosophy of Hegel: A Systematic\nExposition</em>, Mineola, NY: Dover Publications.",
                "Steinberg, Alex, 2015, “Priority Monism and Part/Whole\nDependence,” <em>Philosophical Studies</em>, 172(8):\n2025–31.",
                "Strawson, Galen, 2000, “David Hume: Objects and\nPower,” in <em>The New Hume Debate</em>, Rupert Read and Kenneth\nRichman (eds), London: Routledge, 31–51.",
                "Strawson, P. F., 1959, <em>Individuals: An Essay in Descriptive\nMetaphysics</em>, London: Routledge.",
                "Tallant, Jonathan, 2013, “Problems of Parthood for\nProponents of Priority,” <em>Analysis</em>, 73(3):\n429–438.",
                "–––, 2015, “Ontological Dependence in a\nSpacetime-World,” <em>Philosophical Studies</em>, 172(11):\n3101–18.",
                "Taylor, A. E., 1961, <em>Elements of Metaphysics</em>, London:\nMethuen &amp; Co.",
                "Thomasson, Amie, 2013, “Categories,” <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2013 Edition), Edward N. Zalta\n(ed.) URL=&lt;<a href=\"https://plato.stanford.edu/archives/fall2013/entries/categories/\" target=\"other\">https://plato.stanford.edu/archives/fall2013/entries/categories/</a>&gt;.",
                "Tienson, John, 2002, “Questions for Blobjectivism,”\n<em>Facta Philosophica</em>, 2: 301–10.",
                "Toraldo di Francia, Giuliano, 1998, “A World of Individual\nObjects?” in <em>Interpreting Bodies: Classical and Quantum\nObjects in Modern Physics</em>, Elena Castellani (ed.), Princeton, NJ:\nPrinceton University Press, 21–29.",
                "Trogdon, Kelly, 2009, “Monism and Intrinsicality,”\n<em>Australasian Journal of Philosophy</em>, 87: 127–48.",
                "–––, 2010, “Intrinsicality for Monists\n(and Pluralists),” <em>Australasian Journal of Philosophy</em>,\n88: 555–58.",
                "Turner, William, 1911, “Monism,” in <em>The Catholic\nEncyclopedia</em>, 10. New York, Robert Appleton Company.\n [<a href=\"http://www.newadvent.org/cathen/10483a.htm\" target=\"other\">Turner 1911 available online</a>]",
                "Van Inwagen, Peter, 1990, <em>Material Beings</em>, Ithaca, NY:\nCornell University Press.",
                "–––, 2002, <em>Metaphysics</em>, Boulder, CO:\nWestview Press.",
                "Varzi, Achille, 2006, “The Universe Among Other\nThings,” <em>Ratio</em>, 19: 107–20.",
                "Weatherson, Brian and Dan Marshall, 2012, “Intrinsic vs.\nExtrinsic Properties,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2013 Edition), Edward N. Zalta (ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2013/entries/intrinsic-extrinsic/\" target=\"other\">https://plato.stanford.edu/archives/spr2013/entries/intrinsic-extrinsic/</a>&gt;.",
                "Williams, D. C., 1953, “The Elements of Being,”\n<em>Review of Metaphysics</em>, 7: 3–18; 171–92.",
                "Williams, Neil, 2010, “Puzzling Powers: The Problem of\nFit,” in <em>The Metaphysics of Powers: Their Grounding and\ntheir Manifestations</em>, Anna Marmodoro (ed.), London: Routledge,\n84–105.",
                "Wilson, Jessica, 2010, “What is Hume’s Dictum, and Why\nBelieve It?” <em>Philosophy and Phenomenological Research</em>,\n80: 595–637.",
                "–––, 2014, “No Work for a Theory of\nGrounding,” <em>Inquiry</em>, 57(5–6): 535–579.",
                "–––, 2015, “Hume’s Dictum and\nMetaphysical Modality: Lewis’ Combinatorialism,” in\n<em>Companion to David Lewis</em>, Barry Loewer and Jonathan Schaffer\n(eds.), Oxford: Wiley-Blackwell, 138–58.",
                "Young, Hugh D. and Roger A. Freedman, 2004, <em>University\nPhysics, 11<sup>th</sup> edition</em>, Boston, MA: Addison\nWesley.",
                "Zeh, H. D., 2003, “There is No ‘First’\nQuantization,” <em>Physics Letters</em>, A309:\n329–34.",
                "Zimmerman, Dean, 1996, “Could Extended Objects Be Made Out\nof Simple Parts? An Argument for ‘Atomless Gunk’,”\n<em>Philosophy and Phenomenological Research</em>, 56:\n1–29.",
                "–––, forthcoming, “A Recent Defense of\nMonism Based upon the Interrelatedness of All Things,” in\n<em>The Metaphysics of Relations</em>, Francois Clementz and\nJean-Maurice Monnoyer (eds), Frankfurt: Ontos Verlag."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Albert, David, 1996, “Elementary Quantum Metaphysics,”\nin <em>Bohmian Mechanics and Quantum Theory: An Appraisal</em>, James\nT. Cushing, Arthur Stock, and Sheldon Goldstein (eds), Dordrecht:\nKluwer Academic Publishers, 277–84.</li>\n<li>Alston, William and Jonathan Bennett, 1984, “Identity and\nCardinality,” <em>Philosophical Review</em> 93:\n553–67.</li>\n<li>Aristotle. <em>Metaphysics</em>, trans. W. D. Ross, Oxford: Oxford\nUniversity Press, 1953,</li>\n<li>Armstrong, D. M., 1978a, <em>Nominalism and Realism: Universals\nand Scientific Realism Volume I</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1978b, <em>A Theory of Universals :\nUniversals and Scientific Realism Volume II</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1997, <em>A World of\nStates-of-Affairs</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.</li>\n<li>Barnes, Elizabeth, 2012, “Emergence and\nFundamentality,” <em>Mind</em>, 121: 873–901.</li>\n<li>Baron, Sam and Jonathan Tallant, 2016, “Monism: The Islands\nof Plurality,” <em>Philosophy and Phenomenological\nResearch</em>, 93(3): 583–606.</li>\n<li>–––, 2018, “Do Not Revise Occam’s\nRazor without Necessity,” <em>Philosophy and Phenomenological\nResearch</em>, 96(3): 596–619.</li>\n<li>Baxter, Donald, 1988, “Many-One Identity,”\n<em>Philosophical Papers</em>, 17: 193–216.</li>\n<li>Bennett, Jonathan, 1984, <em>A Study of Spinoza’s\nEthics</em>, Indianapolis, IN: Hackett Publishing Company.</li>\n<li>–––, 1991, “Spinoza’s Monism: A\nReply to Curley,” in <em>God and Nature: Spinoza’s\nMetaphysics</em>, Yirmiyahu Yovel (ed.), Leiden: E. J. Brill,\n53–59.</li>\n<li>Bennett, Karen, 2011, “Construction Area (No Hard Hat\nRequired),” <em>Philosophical Studies</em>, 154:\n79–104.</li>\n<li>–––, 2017, <em>Making Things Up</em>, Oxford:\nOxford University Press.</li>\n<li>Benocci, Matteo, 2017, “Priority Monism and Essentiality of\nFundamentality: A Reply to Steinberg,” <em>Philosophical\nStudies</em>, 174: 1983–90.</li>\n<li>Blanshard, Brand, 1973, <em>Reason and Analysis</em>, La Salle,\nIN: Open Court.</li>\n<li>Bliss, Ricki, 1973, <em>Reality and its Structure: Essays in\nFundamentality</em>, Oxford: Oxford University Press.</li>\n<li>Bohn, Einar Duenger, 2009, “Must There Be a Top\nLevel?” <em>Philosophical Quarterly</em>, 59:\n193–201.</li>\n<li>–––, 2012, “Monism, Emergence, and Plural\nLogic,” <em>Erkenntnis</em>, 76: 211–23.</li>\n<li>–––, 2014, “Unrestricted Composition as\nIdentity,” in <em>Composition as Identity</em>, Aaron Cotnoir\nand Donald Baxter (eds), Oxford: Oxford University Press,\n143–68.</li>\n<li>Bradley, F. H., 1994, <em>Writings on Logic and Metaphysics</em>,\nJames W. Allard and Guy Stock (eds), Oxford: Oxford University\nPress.</li>\n<li>Bricker, Phillip, 1991, “Plenitude of Possible\nStructures,” <em>The Journal of Philosophy</em>, 88:\n607–19.</li>\n<li>Broad, C. D., 1925, <em>The Mind and its Place in Nature</em>,\nLondon: Keegan Paul, Trench, Trubner &amp; Co.</li>\n<li>Burgess, John and Gideon Rosen, 1997, <em>A Subject with no\nObject</em>, Oxford: Oxford University Press.</li>\n<li>Calosi, Claudio, 2014, “Quantum Mechanics and Priority\nMonism,” <em>Synthese</em>, 191: 1–14.</li>\n<li>–––, 2018, “Quantum Monism: An\nAssessment,” <em>Philosophical Studies</em>, 175:\n3217–36.</li>\n<li>–––, forthcoming, “Priority Monism,\nDependence, and Fundamentality,” <em>Philosophical\nStudies</em>.</li>\n<li>Cameron, Ross, 2008a, “Truthmakers and Ontological\nCommitment: Or How to Deal with Complex Objects and Mathematical\nOntology without Getting into Trouble,” <em>Philosophical\nStudies</em>, 140: 1–18.</li>\n<li>–––, 2008b, “Turtles All the Way Down:\nRegress, Priority, and Fundamentality,” <em>Philosophical\nQuarterly</em>, 58: 1–14.</li>\n<li>–––, 2010a, “How to Have a Radically\nMinimal Ontology,” <em>Philosophical Studies</em>, 151:\n249–64.</li>\n<li>–––, 2010b, “From Humean Truthmaker Theory\nto Priority Monism,” <em>Nous</em>, 44: 178–98.</li>\n<li>Campbell, Keith, 1990, <em>Abstract Particulars</em>, Oxford:\nBasil Blackwell.</li>\n<li>Candlish, Stewart and Pierfrancesco Basile, 2013, “Francis\nHerbert Bradley,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2013 Edition), Edward N. Zalta (ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2013/entries/bradley/\" target=\"other\">https://plato.stanford.edu/archives/spr2013/entries/bradley/</a>&gt;.</li>\n<li>Casati, Roberto and Achille Varzi, 1994, <em>Holes and Other\nSuperficialities</em>, Cambridge, MA: MIT Press.</li>\n<li>Chisholm, Roderick, 1957, <em>Perceiving: A Philosophical\nStudy</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Cornell, David, 2013, “Monism and Statespace: A Reply to\nSider,” <em>Analysis</em>, 73: 230–36.</li>\n<li>Curd, Patricia, 1998, <em>The Legacy of Parmenides</em>,\nPrinceton, NJ: Princeton University Press.</li>\n<li>Curley, Edwin, 1969, <em>Spinoza’s Metaphysics</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1991, “On Bennett’s\nInterpretation of Spinoza’ Monism,” in <em>God and Nature:\nSpinoza’s Metaphysics</em>, Yirmiyahu Yovel (ed.), Leiden: E. J.\nBrill, 35–51.</li>\n<li>Daly, Chris, 2012, “Skepticism about Grounding,” in\n<em>Metaphysical Grounding: Understanding the Structure of\nReality</em>, Fabrice Correia and Benjamin Schnieder (eds), Cambridge:\nCambridge University Press, 81–100.</li>\n<li>Darby, George, 2012, “Relational Holism and Humean\nSupervenience,” <em>British Journal for the Philosophy of\nScience</em>, 63: 773–88.</li>\n<li>Della Rocca, Michael, 2008, <em>Spinoza</em>, London:\nRoutledge.</li>\n<li>–––, 2014, “Razing Structures to the\nGround,” <em>Analytic Philosophy</em>, 55(3): 276–94.</li>\n<li>Descartes, Rene, 1644, “Principles of Philosophy,” in\n<em>The Philosophical Writings of Descartes: Volume 1</em>, John\nCottingham, Robert Stoothoff, and Dugald Murdoch (eds.), Cambridge:\nCambridge University Press, 1984: 177–291.</li>\n<li>Eddon, Maya, 2011, “Intrinsicality and\nHyperintensionality,” <em>Philosophy and Phenomenological\nResearch</em>, 82: 314–36.</li>\n<li>Esfeld, Michael, 1999, “Quantum Holism and the Philosophy of\nMind,” <em>Journal of Consciousness Studies</em>, 6:\n23–38.</li>\n<li>Fiddaman, Mark and Gonzalo Rodriguez-Pereyra, 2018, “The\nRazor and the Laser,” <em>Analytic Philosophy</em> 59(3):\n341–58.</li>\n<li>Fine, Kit, 1991, “The Study of Ontology,”\n<em>Nous</em>, 25: 263–94.</li>\n<li>–––, 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8: 1–16.</li>\n<li>–––, 2001, “The Question of\nRealism,” <em>Philosophers Imprint</em>, 1: 1–30.</li>\n<li>–––, 2012, “Guide to Ground,” in\n<em>Metaphysical Grounding: Understanding the Structure of\nReality</em>, Fabrice Correia and Benjamin Schnieder (eds), Cambridge:\nCambridge University Press, 37–80.</li>\n<li>Frege, Gottlob, 1884, <em>The Foundations of Arithmetic</em>,\ntrans. J. L. Austin, Evanston, IL: Northwestern University Press,\n1953.</li>\n<li>Geach, Peter, 1962, <em>Reference and Generality: An Examination\nof Some Medieval and Modern Theories</em>, Ithaca, NY: Cornell\nUniversity Press.</li>\n<li>Gendler, Tamar and John Hawthorne, 2002, <em>Conceivability and\nPossibility</em>, Oxford: Oxford University Press.</li>\n<li>Georgi, Howard, 1989, “Effective Quantum Field\nTheories,” in <em>The New Physics</em>, Paul Davies (ed.),\nCambridge: Cambridge University Press, 446–57.</li>\n<li>Gill, Mary Louise, 1989, <em>Aristotle on Substance: The Paradox\nof Unity</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Goff, Philip, 2012a, “There is More than One Thing,”\nin Goff 2012b: 113–22.</li>\n<li>––– (ed.), 2012b, <em>Spinoza on Monism</em>,\nBasingstoke: Palgrave Macmillan.</li>\n<li>Goodman, Nelson and W. V. O. Quine, 1947, “Steps Towards a\nConstructive Nominalism,” <em>Journal of Symbolic Logic</em>,\n12: 105–22.</li>\n<li>Gribbin, John, 1984, <em>In Search of Schrodinger’s Cat:\nQuantum Physics and Reality</em>, New York, NY: Bantam Books.</li>\n<li>Guigon, Ghislain, 2012, “Spinoza on Composition and\nPriority,” in Goff 2012b: 183–205.</li>\n<li>Halvorson, Hans and Rob Clifton, 2002, “No Place for\nParticles in Relativistic Quantum Theories?” <em>Philosophy of\nScience</em>, 69: 1–28.</li>\n<li>Hartle, James and Stephen Hawking, 1983, “Wave function of\nthe Universe,” <em>Physics Review</em> D, 28:\n2960–75.</li>\n<li>Hawthorne, John and Andrew Cortens, 1995, “Towards\nOntological Nihilism,” <em>Philosophical Studies</em>, 79:\n143–65.</li>\n<li>Heil, John 2003, <em>From an Ontological Point of View</em>,\nOxford: Oxford University Press.</li>\n<li>Hoffman, Joshua and Gary S. Rosenkrantz, 1997, <em>Substance: Its\nNature and Existence</em>, London: Routledge.</li>\n<li>Hofweber, Thomas, 2009, “Ambitious, Yet Modest,\nMetaphysics,” in <em>Metametaphysics: New Essays on the\nFoundations of Ontology</em>, David Chalmers, David Manley, and Ryan\nWasserman (eds), Oxford: Oxford University Press, 260–89.</li>\n<li>Horgan, Terence and Matjaž Potrč, 2000,\n“Blobjectivism and Indirect Correspondence,” <em>Facta\nPhilosophica</em>, 2: 249–70.</li>\n<li>–––, 2006, “Abundant Truth in an Austere\nWorld,” in <em>Truth and Realism: New Essays</em>, Michael Lynch\nand Patrick Greenough (eds), Oxford: Oxford University Press,\n137–67.</li>\n<li>–––, 2008, <em>Austere Realism: Contextual\nSemantics Meets Minimal Ontology</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2012, “Existence Monism Trumps\nPriority Monism,” in Goff 2012b: 51–76..</li>\n<li>Hudson, Hud, 2001, <em>A Materialist Metaphysics of the Human\nPerson</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Hume, David 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, Peter Millican (ed.), Oxford: Oxford University\nPress, 2007,</li>\n<li>Ismael, Jenann and Jonathan Schaffer, forthcoming, “Quantum\nHolism: Nonseparability as Common Ground,”\n<em>Synthese</em>.</li>\n<li>James, William, 1907, <em>Pragmatism</em>. Amherst, NY: Prometheus\nBooks, 1991,</li>\n<li>–––, 1909, “A Pluralistic Universe:\nHibbert Lectures at Manchester College on the Present Situation in\nPhilosophy,” in <em>William James: Writings\n1902–1910</em>, Bruce Kuklick (ed.), New York, NY: Viking Press,\n1987, 625–819.</li>\n<li>Joad, C. E. M., 1957, <em>Guide to Philosophy</em>, Mineola, NY:\nDover Publications.</li>\n<li>Johnston, Mark, 1987, “Is there a Problem about\nPersistence?” <em>Proceedings of the Aristotelian Society Supp.\nVol.</em>, 61: 107–35.</li>\n<li>Korman, Daniel Z., 2008, “Review of Horgan and\nPotrč’s Austere Realism,” <em>Notre Dame\nPhilosophical Reviews</em>, 2008,10.22,\n [<a href=\"http://ndpr.nd.edu/news/23810/?id=14508\" target=\"other\">Korman 2008 available online</a>].</li>\n<li>Kriegel, Uriah 2012, “Kantian Monism,”\n<em>Philosophical Papers</em>, 41: 23–56.</li>\n<li>Leibniz, G. W. F., 1714, “The Monadology,” in <em>The\nRationalists</em>, trans. George Montgomery, New York, NY: Doubleday,\n1960, 455–71.</li>\n<li>Lewis, David, 1983, “New Work for a Theory of\nUniversals,” <em>Australasian Journal of Philosophy</em>, 61:\n343–77.</li>\n<li>–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Basil Blackwell.</li>\n<li>–––, 1991, <em>Parts of Classes</em>, Oxford:\nBasil Blackwell.</li>\n<li>–––, 2002, “Tensing the Copula,”\n<em>Mind</em>, 111: 1–14.</li>\n<li>Loewer, Barry, 2001, “From Physics to Physicalism,” in\n<em>Physicalism and its Discontents</em>, Carl Gillet and Barry Loewer\n(eds), Cambridge: Cambridge University Press, 37–56.</li>\n<li>Lowe, Jonathan, 2012, “Against Monism,” in <em>Spinoza\non Monism</em>, Philip Goff (ed.), New York, NY: Palgrave-MacMillan:\n92–112.</li>\n<li>Maudlin, Tim, 1998, “Part and Whole in Quantum\nMechanics,” in <em>Interpreting Bodies: Classical and Quantum\nObjects in Modern Physics</em>, Elena Castellani (ed.), Princeton, NJ:\nPrinceton University Press: 46–60.</li>\n<li>McDaniel, Kris, 2009, “Extended Simples and Qualitative\nHeterogeneity,” <em>Philosophical Quarterly</em>, 59:\n325–31.</li>\n<li>Merricks, Trenton, 2001<em>. Objects and Persons</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2003, “Replies,” in\n<em>Philosophy and Phenomenological Research</em>, 67:\n727–44.</li>\n<li>Miller, Kristie, 2009, “Defending Contingentism in\nMetaphysics,” <em>Dialectica</em>, 63: 23–49.</li>\n<li>Moore, G. E., 1993, <em>G. E. Moore: Selected Writings</em>,\nThomas Baldwin (ed.), London: Routledge.</li>\n<li>Morganti, Matteo, 2009, “Ontological Priority,\nFundamentality and Monism,” <em>Dialectica</em>, 63:\n271–88.</li>\n<li>Muirhead, J. H., 1935, <em>Bernard Bosanquet and His Friends</em>,\nLondon: Allen and Unwin.</li>\n<li>Mumford, Stephen, 2004, <em>Laws in Nature</em>, London:\nRoutledge.</li>\n<li>Nadeau, Robert and Menas Kafatos, 1999, <em>The Non-Local\nUniverse: The New Physics and Matters of the Mind</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Nolan, Daniel, 1996, “Recombination Unbound,”\n<em>Philosophical Studies</em>, 84: 239–62.</li>\n<li>–––, 1997, “Impossible Worlds: A Modest\nApproach,” <em>Notre Dame Journal of Formal Logic</em>, 38:\n535–72.</li>\n<li>O’Conaill, Donnchadh and Tuomas Tahko, 2012, “On the\nCommon Sense Argument for Monism,” in Goff 2012b:\n149–66.</li>\n<li>Owen, G. E. L., 1960, “Eleatic Questions,” <em>The\nClassical Quarterly</em>, 10: 84–102.</li>\n<li>Parsons, Josh, 2004, “Distributional Properties,” in\n<em>Lewisian Themes</em>, Frank Jackson and Graham Priest (eds),\nOxford: Oxford University Press: 173–80.</li>\n<li>Paul, L. A., 2002, “Logical Parts,” <em>Nous</em>, 36:\n578–96.</li>\n<li>–––, 2013, “Categorical Priority and\nCategorical Collapse,” <em>Proceedings of the Aristotelian\nSociety Supp. Vol.</em>, 87: 89–113.</li>\n<li>Plato, <em>The Collected Dialogues of Plato</em>, Edith Hamilton\nand Huntington Cairns (eds), Princeton, NJ: Princeton University\nPress, 1961.</li>\n<li>Rea, Michael, 2001, “How to be an Eleatic Monist,”\n<em>Philosophical Perspectives</em>, 15: 129–51.</li>\n<li>Robinson, Howard, 2011, “Dualism,” <em>The Stanford\nEncyclopedia of Philosophy</em> (Winter 2012 Edition), Edward N. Zalta\n(ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/win2012/entries/dualism/\" target=\"other\">https://plato.stanford.edu/archives/win2012/entries/dualism/</a>&gt;.</li>\n<li>Robinson, John Mansley, 1968, <em>An Introduction to Early Greek\nPhilosophy: The Chief Fragments and Ancient Testimony (with Connecting\nCommentary)</em>, Boston, MA: Houghton Mifflin.</li>\n<li>Rodriguez-Pereyra, Gonzalo, 2002, <em>Resemblance Nominalism: A\nSolution to the Problem of Universals</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2005, “Why Truthmakers,” in\n<em>Truthmakers</em>: <em>The Contemporary Debate</em>, Helen Beebee\nand Julian Dodd (eds), Oxford: Oxford University Press,\n17–31.</li>\n<li>Rosen, Gideon, 2006, “The Limits of Contingency,” in\n<em>Identity and Modality</em>, Fraser MacBride and Crispin Wright\n(eds), Oxford: Oxford University Press, 13–39.</li>\n<li>–––, 2010, “Metaphysical Dependence:\nGrounding and Reduction,” in <em>Modality: Metaphysics, Logic,\nand Epistemology</em>, Robert Hale and Aviv Hoffman (eds), Oxford:\nOxford University Press, 109–36.</li>\n<li>Rovelli, Carlo, 1996, “Relational Quantum Mechanics,”\n<em>International Journal of Theoretical Physics</em>, 35:\n1637–68.</li>\n<li>Royce, Josiah, 1900, <em>The World and the Individual</em>, New\nYork, NY: The Macmillan Company.</li>\n<li>–––, 1967, <em>The Spirit of Modern\nPhilosophy</em>, New York, NY: W. W. Norton &amp; Company.</li>\n<li>Russell, Bertrand, 1911, “Analytic Realism,” in\n<em>Russell on Metaphysics</em>, Stephen Mumford (ed.), London:\nRoutledge, 2003, 91–96.</li>\n<li>–––, 1918, “The Philosophy of Logical\nAtomism,” in <em>The Philosophy of Logical Atomism</em>, David\nPears (ed.), La Salle, IN: Open Court, 1985, 35–155.</li>\n<li>Rutherford, R. B., 1989, <em>The Meditations of Marcus Aurelius\nAntonius</em>, trans. A. S. L. Farquharson, Oxford: Oxford University\nPress.</li>\n<li>Schaffer, Jonathan, 2003, “Is There a Fundamental\nLevel?” <em>Nous</em>, 37: 498–517.</li>\n<li>–––, 2007, “From Nihilism to\nMonism,” <em>Australasian Journal of Philosophy</em>, 85:\n175–91.</li>\n<li>–––, 2008, “Truthmaker Commitments,”\n<em>Philosophical Studies</em>, 141: 7–19.</li>\n<li>–––, 2009a, “On What Grounds What,”\nin <em>Metametaphysics: New Essays on the Foundations of\nOntology</em>, David Chalmers, David Manley, and Ryan Wasserman (eds),\nOxford: Oxford University Press, 347–83.</li>\n<li>–––, 2009b, “Spacetime the One\nSubstance,” <em>Philosophical Studies</em>, 145:\n131–48.</li>\n<li>–––, 2010a, “Monism: The Priority of the\nWhole,” <em>Philosophical Review</em>, 119: 31–76.</li>\n<li>–––, 2010b, “The Internal Relatedness of\nAll Things,” <em>Mind</em>, 119: 341–76.</li>\n<li>–––, 2010c, “The Least Discerning and Most\nPromiscuous Truthmaker,” <em>Philosophical Quarterly</em>, 60:\n307–24.</li>\n<li>–––, 2012, “Why the World has Parts: Reply\nto Horgan and Potrč,” in Goff 2012b: 77–91.</li>\n<li>–––, 2013, “The Action of the\nWhole,” <em>Proceedings of the Aristotelian Society Supp.\nVol.</em>, 87: 67–87.</li>\n<li>–––, 2015, “What Not to Multiply without\nNecessity,” <em>Australasian Journal of Philosophy</em>, 93(4):\n644–64.</li>\n<li>–––, 2016, “Grounding in the Image of\nCausation,” <em>Philosophical Studies</em>, 173(1):\n49–100.</li>\n<li>Sedley, David, 1999, “Parmenides and Melissus,” in\n<em>The Cambridge Companion to Early Greek Philosophy</em>, A. A. Long\n(ed.), Cambridge: Cambridge University Press, 113–33.</li>\n<li>Segal, Aaron, 2014, “Causal Essentialism and Mereological\nMonism,” <em>Philosophical Studies</em>, 169:\n227–255.</li>\n<li>Sider, Theodore, 1993, “Van Inwagen and the Possibility of\nGunk,” <em>Analysis</em>, 53: 285–89.</li>\n<li>–––, 1996, “Intrinsic Properties,”\n<em>Philosophical Studies</em>, 83: 1–27.</li>\n<li>–––, 2001, <em>Four-Dimensionalism: An Ontology\nof Persistence and Time</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2003, “What’s So Bad About\nOverdetermination?” <em>Philosophy and Phenomenological\nResearch</em>, 67: 719–26.</li>\n<li>–––, 2007a, “Parthood,”\n<em>Philosophical Review</em>, 116: 51–91.</li>\n<li>–––, 2007b, “Against Monism,”\n<em>Analysis</em>, 67: 1–7.</li>\n<li>–––, 2008, “Monism and Statespace\nStructure,” in <em>Being: Developments in Contemporary\nMetaphysics</em>, Robin Le Poidevin (ed.), Cambridge: Cambridge\nUniversity Press, 129–50.</li>\n<li>Siegel, Max, 2016, “Priority Monism is Contingent,”\n<em>Thought</em>, 5(1): 23–32.</li>\n<li>Simons, Peter, 1987, <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2003, “The Universe,” Ratio,\n16: 237–50.</li>\n<li>Skiles, Alexander, 2009, “Trogdon on Monism and\nIntrinsicality,” <em>Australasian Journal of Philosophy</em>,\n87: 149–54.</li>\n<li>–––, 2014, “Primitivism about\nIntrinsicality,” in <em>Companion to Intrinsic Properties</em>,\nRobert Francescotti (ed.), Berlin: Walter De Gruyter,\n221–52.</li>\n<li>Spinoza, Benedict, 1677, “Ethics,” in <em>The\nCollected Writings of Spinoza, vol. 1</em><em>, trans. Edwin\nCurley,</em> Princeton, NJ: Princeton University Press, 1985.</li>\n<li>Stace, W. T., 1955, <em>The Philosophy of Hegel: A Systematic\nExposition</em>, Mineola, NY: Dover Publications.</li>\n<li>Steinberg, Alex, 2015, “Priority Monism and Part/Whole\nDependence,” <em>Philosophical Studies</em>, 172(8):\n2025–31.</li>\n<li>Strawson, Galen, 2000, “David Hume: Objects and\nPower,” in <em>The New Hume Debate</em>, Rupert Read and Kenneth\nRichman (eds), London: Routledge, 31–51.</li>\n<li>Strawson, P. F., 1959, <em>Individuals: An Essay in Descriptive\nMetaphysics</em>, London: Routledge.</li>\n<li>Tallant, Jonathan, 2013, “Problems of Parthood for\nProponents of Priority,” <em>Analysis</em>, 73(3):\n429–438.</li>\n<li>–––, 2015, “Ontological Dependence in a\nSpacetime-World,” <em>Philosophical Studies</em>, 172(11):\n3101–18.</li>\n<li>Taylor, A. E., 1961, <em>Elements of Metaphysics</em>, London:\nMethuen &amp; Co.</li>\n<li>Thomasson, Amie, 2013, “Categories,” <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2013 Edition), Edward N. Zalta\n(ed.) URL=&lt;<a href=\"https://plato.stanford.edu/archives/fall2013/entries/categories/\" target=\"other\">https://plato.stanford.edu/archives/fall2013/entries/categories/</a>&gt;.</li>\n<li>Tienson, John, 2002, “Questions for Blobjectivism,”\n<em>Facta Philosophica</em>, 2: 301–10.</li>\n<li>Toraldo di Francia, Giuliano, 1998, “A World of Individual\nObjects?” in <em>Interpreting Bodies: Classical and Quantum\nObjects in Modern Physics</em>, Elena Castellani (ed.), Princeton, NJ:\nPrinceton University Press, 21–29.</li>\n<li>Trogdon, Kelly, 2009, “Monism and Intrinsicality,”\n<em>Australasian Journal of Philosophy</em>, 87: 127–48.</li>\n<li>–––, 2010, “Intrinsicality for Monists\n(and Pluralists),” <em>Australasian Journal of Philosophy</em>,\n88: 555–58.</li>\n<li>Turner, William, 1911, “Monism,” in <em>The Catholic\nEncyclopedia</em>, 10. New York, Robert Appleton Company.\n [<a href=\"http://www.newadvent.org/cathen/10483a.htm\" target=\"other\">Turner 1911 available online</a>]</li>\n<li>Van Inwagen, Peter, 1990, <em>Material Beings</em>, Ithaca, NY:\nCornell University Press.</li>\n<li>–––, 2002, <em>Metaphysics</em>, Boulder, CO:\nWestview Press.</li>\n<li>Varzi, Achille, 2006, “The Universe Among Other\nThings,” <em>Ratio</em>, 19: 107–20.</li>\n<li>Weatherson, Brian and Dan Marshall, 2012, “Intrinsic vs.\nExtrinsic Properties,” <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2013 Edition), Edward N. Zalta (ed.), URL=&lt;<a href=\"https://plato.stanford.edu/archives/spr2013/entries/intrinsic-extrinsic/\" target=\"other\">https://plato.stanford.edu/archives/spr2013/entries/intrinsic-extrinsic/</a>&gt;.</li>\n<li>Williams, D. C., 1953, “The Elements of Being,”\n<em>Review of Metaphysics</em>, 7: 3–18; 171–92.</li>\n<li>Williams, Neil, 2010, “Puzzling Powers: The Problem of\nFit,” in <em>The Metaphysics of Powers: Their Grounding and\ntheir Manifestations</em>, Anna Marmodoro (ed.), London: Routledge,\n84–105.</li>\n<li>Wilson, Jessica, 2010, “What is Hume’s Dictum, and Why\nBelieve It?” <em>Philosophy and Phenomenological Research</em>,\n80: 595–637.</li>\n<li>–––, 2014, “No Work for a Theory of\nGrounding,” <em>Inquiry</em>, 57(5–6): 535–579.</li>\n<li>–––, 2015, “Hume’s Dictum and\nMetaphysical Modality: Lewis’ Combinatorialism,” in\n<em>Companion to David Lewis</em>, Barry Loewer and Jonathan Schaffer\n(eds.), Oxford: Wiley-Blackwell, 138–58.</li>\n<li>Young, Hugh D. and Roger A. Freedman, 2004, <em>University\nPhysics, 11<sup>th</sup> edition</em>, Boston, MA: Addison\nWesley.</li>\n<li>Zeh, H. D., 2003, “There is No ‘First’\nQuantization,” <em>Physics Letters</em>, A309:\n329–34.</li>\n<li>Zimmerman, Dean, 1996, “Could Extended Objects Be Made Out\nof Simple Parts? An Argument for ‘Atomless Gunk’,”\n<em>Philosophy and Phenomenological Research</em>, 56:\n1–29.</li>\n<li>–––, forthcoming, “A Recent Defense of\nMonism Based upon the Interrelatedness of All Things,” in\n<em>The Metaphysics of Relations</em>, Francois Clementz and\nJean-Maurice Monnoyer (eds), Frankfurt: Ontos Verlag.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abstract objects",
            "Bradley, Francis Herbert",
            "categories",
            "dependence, ontological",
            "dualism",
            "emergent properties",
            "Hegel, Georg Wilhelm Friedrich",
            "mereology",
            "mereology: medieval",
            "neutral monism",
            "physics: holism and nonseparability",
            "Plotinus",
            "quantum theory: quantum field theory",
            "Spinoza, Baruch",
            "substance"
        ],
        "entry_link": [
            {
                "../abstract-objects/": "abstract objects"
            },
            {
                "../bradley/": "Bradley, Francis Herbert"
            },
            {
                "../categories/": "categories"
            },
            {
                "../dependence-ontological/": "dependence, ontological"
            },
            {
                "../dualism/": "dualism"
            },
            {
                "../properties-emergent/": "emergent properties"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../mereology/": "mereology"
            },
            {
                "../mereology-medieval/": "mereology: medieval"
            },
            {
                "../neutral-monism/": "neutral monism"
            },
            {
                "../physics-holism/": "physics: holism and nonseparability"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../quantum-field-theory/": "quantum theory: quantum field theory"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../substance/": "substance"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=monism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/monism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=monism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/monism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=monism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/monism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=monism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/monism/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}