{
    "url": "moral-theory",
    "title": "Moral Theory",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Julia Driver\n<julia.driver@austin.utexas.edu>",
        "author_links": [
            {
                "mailto:julia%2edriver%40austin%2eutexas%2eedu": "julia.driver@austin.utexas.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nJulia Driver\n&lt;<a href=\"mailto:julia%2edriver%40austin%2eutexas%2eedu\"><em>julia<abbr title=\" dot \">.</abbr>driver<abbr title=\" at \">@</abbr>austin<abbr title=\" dot \">.</abbr>utexas<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jun 27, 2022"
    ],
    "preamble": "\n\n\nThere is much disagreement about what, exactly, constitutes a moral\ntheory. Some of that disagreement centers on the issue of\ndemarcating the moral from other areas of practical\nnormativity, such as the ethical and the aesthetic. Some\ndisagreement centers on the issue of what a moral\ntheory’s aims and functions are. In this entry,\nboth questions will be addressed. However, this entry is about moral\ntheories as theories, and is not a survey of specific\ntheories, though specific theories will be used as examples.\n",
    "toc": [
        {
            "#Mora": "1. Morality"
        },
        {
            "#CommSensMora": "1.1 Common-sense Morality"
        },
        {
            "#ContBetwMoraOtheNormDoma": "1.2 Contrasts Between Morality and Other Normative Domains"
        },
        {
            "#TheoTheoVirt": "2. Theory and Theoretical Virtues"
        },
        {
            "#TaskMoraTheo": "2.1 The Tasks of Moral Theory"
        },
        {
            "#TheoCons": "2.2 Theory Construction"
        },
        {
            "#Crit": "3. Criteria"
        },
        {
            "#DeciProcPracDeli": "4. Decision Procedures and Practical Deliberation"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Morality\n\n\nWhen philosophers engage in moral theorizing, what is it that they are\ndoing? Very broadly, they are attempting to provide a systematic\naccount of morality. Thus, the object of moral theorizing is morality,\nand, further, morality as a normative system.\n\nAt the most minimal, morality is a set of norms and principles that\ngovern our actions with respect to each other and which are taken to\nhave a special kind of weight or authority (Strawson 1961). More\nfundamentally, we can also think of morality as consisting of moral\nreasons, either grounded in some more basic value, or, the other way\naround, grounding value (Raz 1999).\n\nIt is common, also, to hold that moral norms are universal\nin the sense that they apply to and bind everyone in similar\ncircumstances. The principles expressing these norms are also\nthought to be general, rather than specific, in that they are\nformulable “without the use of what would be intuitively\nrecognized as proper names, or rigged definite descriptions”\n(Rawls 1979, 131). They are also commonly held to be\nimpartial, in holding everyone to count equally.\n1.1 Common-sense Morality\n\n… Common-sense is… an exercise of the judgment unaided\nby any Art or system of rules : such an exercise as we must\nnecessarily employ in numberless cases of daily occurrence ; in which,\nhaving no established principles to guide us … we must needs\nact on the best extemporaneous conjectures we can form. He who is\neminently skillful in doing this, is said to possess a superior degree\nof Common-Sense. (Richard Whatley, Elements of Logic, 1851,\nxi–xii)\n\n“Common-Sense Morality”, as the term is used here, refers\nto our pre-theoretic set of moral judgments or intuitions\nor\n principles.[1] \nWhen we\nengage in theory construction (see below) it is these common-sense\nintuitions that provide a touchstone to theory\nevaluation. Henry Sidgwick believed that the\nprinciples of Common-Sense Morality were important in helping us\nunderstand the “first” principle or principles\nof\n morality.[2] \nIndeed, some theory construction explicitly appeals to puzzles in\ncommon-sense morality that need resolution – and hence, need to\nbe addressed theoretically. \n\nFeatures of commons sense morality are determined by our normal\nreactions to cases which in turn suggest certain normative principles\nor insights. For example, one feature of common-sense morality\nthat is often remarked upon is the self/other asymmetry in morality,\nwhich manifests itself in a variety of ways in our intuitive\nreactions. For example, many intuitively differentiate morality\nfrom prudence in holding that morality concerns our interactions with\nothers, whereas prudence is concerned with the well-being of the\nindividual, from that individual’s point of view.\n\nAlso, according to our common-sense intuitions we are allowed to\npursue our own important projects even if such pursuit is not\n“optimific” from the impartial point of view (Slote\n1985). It is also considered permissible, and even admirable, for\nan agent to sacrifice her own good for the sake of another even though\nthat is not optimific. However, it is impermissible, and outrageous,\nfor an agent to similarly sacrifice the well-being of another under the\nsame circumstances. Samuel Scheffler argued for a view in which\nconsequentialism is altered to include agent-centered prerogatives,\nthat is, prerogatives to not act so as to maximize the good (Scheffler\n1982).\n\nOur reactions to certain cases also seem to indicate a common-sense\ncommitment to the moral significance of the distinction between\nintention and foresight, doing versus allowing, as well as the view\nthat distance between agent and patient is morally relevant (Kamm\n2007).\n\nPhilosophers writing in empirical moral psychology have been working\nto identify other features of common-sense morality, such as how prior\nmoral evaluations influence how we attribute moral responsibility for\nactions (Alicke et. al. 2011; Knobe 2003).\n\nWhat many ethicists agree upon is that common-sense is a bit of a\nmess. It is fairly easy to set up inconsistencies and tensions\nbetween common-sense commitments. The famous Trolley Problem\nthought experiments illustrate how situations which are structurally\nsimilar can elicit very different intuitions about what the morally\nright course of action would be (Foot 1975). We intuitively\nbelieve that it is worse to kill someone than to simply let the person\ndie. And, indeed, we believe it is wrong to kill one person to\nsave five others in the following scenario:\n\nDavid is a great transplant surgeon. Five of his patients need new\nparts—one needs a heart, the others need, respectively, liver,\nstomach, spleen, and spinal cord—but all are of the same,\nrelatively rare, blood-type. By chance, David learns of a healthy\nspecimen with that very blood-type. David can take the healthy\nspecimen's parts, killing him, and install them in his patients, saving\nthem. Or he can refrain from taking the healthy specimen's parts,\nletting his patients die. (Thomson 1976, 206)\n\n\nAnd yet, in the following scenario we intuitively view it entirely\npermissible, and possibly even obligatory, to kill one to save\nfive:\n\n\nEdward is the driver of a trolley, whose brakes have just failed. On\nthe track ahead of him are five people; the banks are so steep that\nthey will not be able to get off the track in time. The track has a\nspur leading off to the right, and Edward can turn the trolley onto it.\nUnfortunately there is one person on the right-hand track. Edward can\nturn the trolley, killing the one; or he can refrain from turning the\ntrolley, killing the five. (Thomson 1976, 206).\n\nTheorizing is supposed to help resolve those tensions in a\nprincipled way. Theory construction attempts to provide\nguidance in how to resolve such tensions and how to understand\nthem.\n1.2 Contrasts Between Morality and Other Normative Domains\n1.2.1 Morality and Ethics\n\nEthics is generally understood to be the study of “living well\nas a human being”. This is the topic of works such as\nAristotle’s Nicomachean Ethics, in which the aim of\nhuman beings is to exemplify human excellence of character. The sense\nin which we understand it here is that ethics is broader than morality,\nand includes considerations of personal development of oneself and\nloved ones. This personal development is important to a life well\nlived, intuitively, since our very identities are centered on projects\nthat we find important. Bernard Williams and others refer to\nthese projects as “ground projects”. These are the\nsources of many of our reasons for acting. For Williams, if\nan agent seeks to adopt moral considerations, or be guided by\nthem, then important ethical considerations are neglected,\nsuch as personal integrity and authenticity (Williams 1977; Wolf\n1982). However, Williams has a very narrow view of what he\nfamously termed “the morality system” (Williams 1985).\n\nWilliams lists a variety of objectionable features of the morality\nsystem, including the inescapability of moral obligations, the\noverridingness of moral obligation, impartiality, and\nthe fact that in the morality system there is a push towards\ngeneralization.\n\nThere has been considerable discussion of each of these features of\nthe morality system, and since Williams, a great deal of work on the\npart of standard moral theorists on how each theory addresses the\nconsiderations he raised. Williams’ critique of the\nmorality system was part of a general criticism of moral theory in the\n1980s on the grounds of its uselessness, harmfulness, and even its\nimpossibility (Clarke 1987). This anti-theory trend was prompted\nby the same dissatisfaction with consequentialism and deontology that\nled to the resurgence of Virtue Ethics.\n\nA major criticism of this view is that it has a very narrow view of\nwhat counts as a moral theory. Thus, some of these approaches\nsimply rejected some features of William’s characterization of\nthe morality system, such as impartiality. Others, however,\nWilliams’ included, attacked the very project of moral\ntheory. This is the ‘anti-theory’ attack on moral\ntheorizing. For example, Annette Baier argued that\nmorality cannot be captured in a system of rules, and this was a very\npopular theme amongst early virtue ethicists. On this view, moral\ntheory which systematizes and states the moral principles that ought to\nguide actions is simply impossible: “Norms in the form of\nvirtues may be essentially imprecise in some crucial ways, may be\nmutually referential, but not hierarchically orderable, may be\nessentially self-referential” (Baier 220). \n\nRobert Louden even argued that the best construal of virtue ethics\nis not as an ethical theory, but as anti-theory that should not be\nevaluated as attempting to theorize morality at all. (Louden\n1990). According to Louden, moral theories are formulated\nto a variety of reasons, including to provide solutions to problems,\nformulas for action, universal principles, etc. Louden notes that this\ncharacterization is very narrow and many would object to it, but he\nviews anti-theory not so much as a position against any kind\nof moral theorizing, but simply the kind that he viewed as predominant\nprior to the advent of Virtue Ethics. This is a much less severe\nversion of anti-theory as it, for example, doesn’t seem to regard\nweightiness or importance of moral reasons as a problem.\n\nSome of the problems that Williams and other anti-theorists have\nposed for morality, based on the above characteristics, are:\n\nMorality is too demanding and pervasive: that is, the view that\nmoral reasons are weighty indicates that we should be giving them\npriority over other sorts of reasons. Further, they leach into\nall aspects of our lives, leaving very little morally neutral.\nMorality is alienating. There are a variety of ways in which\nmorality can be alienating. As Adrian Piper notes, morality might\nalienate the agent from herself or might alienate the agent from others\n– impartiality and universality might lead to this, for example\n(Piper 1987; Stocker 1976). Another way we can understand\nalienation is that the agent is alienated from the true justifications\nof her own actions – this is one way to hold that theories which\nopt for indirection can lead to alienation (see section 4 below).\nMorality, because it is impartial, makes no room for special\nobligations. That is, if the right action is the one that is impartial\nbetween persons, then it does not favor the near and dear. On this\npicture it is difficult to account for the moral requirements that\nparents have towards their own children, and friends have towards each\nother. These requirements are, by their nature, not\nimpartial.\nMorality is committed to providing guides for action that can\nbe captured in a set of rules or general principles. That is, morality\nis codifiable and the rules of morality are general. \n\n\nMorality requires too much. The basic worry is that the morality\nsystem is voracious and is creeping into all aspects of our lives, to\nthe detriment of other important values. The worry expressed by 4 takes\na variety of forms. For example, some take issue with a\npresupposition of 4, arguing that there are no moral principles at all if we\nthink of these principles as guiding action. Some argue\nthat there are no moral principles that are complete, because morality\nis not something that is codifiable. And, even if\nmorality was codifiable, the ‘principles’ would be\nextremely specific, and not qualify as principles at all.\n\nSince Williams’ work, philosophers have tried to respond to\nthe alienation worry by, for example, providing accounts of the ways in\nwhich a person’s reasons can guide without forming an explicit\npart of practical deliberation. Peter Railton, for example,\nargues in favor of a form of objective consequentialism,\nSophisticated Consequentialism, in which the rightness of an\naction is a function of its actual consequences (Railton 1984). \nOn Railton’s view, one can be a good consequentialist without\nbeing alienated from loved ones. Though not attempting to defend moral\ntheory per se, other writers have also provided accounts of\nhow agents can act on the basis of reasons – and thus perform\nmorally worthy actions, even though these reasons are not explicitly\narticulated in their practical deliberations (Arpaly 2002; Markovits\n2014). Deontologists have argued that autonomous action needn’t\ninvolve explicit invocation of, for example, the Categorical Imperative\n(Herman 1985). Generally, what characterizes these moves is the\nidea that the justifying reasons are present in some form in the\nagent’s psychology – they are recoverable from the\nagent’s psychology – but need not be explicitly articulated\nor invoked by the agent in acting rightly. \n\nOne way to elaborate on this strategy is to argue that the morally\ngood agent is one who responds to the right sorts of reasons, even\nthough the agent can’t articulate the nature of the response\n(Arpaly 2002). This strategy makes no appeal to codifiable principles,\nand is compatible with a wide variety of approaches to developing a\nmoral theory. It relies heavily on the concept, of course, of\n“reason” and “moral reason,” which many writers\non moral issues take to be fundamental or basic in any case.\n\nThere has also been debate concerning the proper scope of morality,\nand how moral theories can address problems relating to\nimpartiality. Kant and the classical utilitarians believed that moral\nreasons are impartial, what others have termed agent-neutral. Indeed,\nthis is one point of criticism that virtue ethics has made of these\ntwo theories. One might argue that moral reasons are impartial, but\nthat there are other reasons that successfully compete with them\n– reasons relating to the near and dear, for example, or\none’s own ground projects. Or, one could hold that morality\nincludes special reasons, arising from special obligations, that also\nmorally justify our actions.\n\nThe first strategy has been pursued by Bernard Williams and other\n“anti-theorists”. Again, Williams argues that\nmorality is a special system that we would be better off without\n(Williams 1985). In the morality system we see a special sense of\n“obligation” – moral obligation – which\npossesses certain features. For example, moral obligation is\ninescapable according to the morality system. A theory\nsuch as Kant’s, for example, holds that we must act in\naccordance with the Categorical Imperative. It is not\noptional. This is because morality is represented as having\nauthority over us in ways that even demand sacrifice of our personal\nprojects, of the very things that make our lives go well for us. \nThis seems especially clear for Utilitarianism, which holds that we\nmust maximize the good, and falling short of maximization is\nwrong. A Kantian will try to avoid this problem by\nappealing to obligations that are less demanding, the imperfect ones.\nBut, as Williams points out, these are still obligations, and\nas such can only be overridden by other obligations. Thus, the\ntheories also tend to present morality as pervasive in that\nmorality creeps into every aspect of our lives, making no room for\nneutral decisions. For example, even decisions about what shoes\nto wear to work becomes a moral one:\n\nOnce the journey into more general obligations has started, we may\nbegin to get into trouble – not just philosophical trouble, but\nthe conscience trouble – with finding room for morally\nindifferent actions. I have already mentioned the possible moral\nconclusion that one may take some particular course of action. \nThat means that there is nothing else I am obliged to do. But if we have\naccepted general and indeterminate obligations to further various moral\nobjectives…they will be waiting to provide work for idle\nhands… (Williams 1985, 181)\n\nHe goes on to write that in order to get out of this problem,\n“…I shall need one of those fraudulent items, a duty to\nmyself” (Williams 1985, 182). Kantian Ethics does supply\nthis. Many find this counterintuitive, since the self/other\nasymmetry seems to capture the prudence/morality distinction, but\nKantians such as Tom Hill, jr. have made strong cases for at least\nsome moral duties to the self. In any case, for writers such\nas Williams, so much the worse for morality.\n\nOther writers, also concerned about the problems that Williams has\nraised argue, instead, that morality does make room for our partial\nconcerns and projects, such as the norms governing our relationships,\nand our meaningful projects. Virtue ethicists, for example, are\noften comfortable pointing out that morality is not thoroughly\nimpartial because there are virtues of partiality. Being a good\nmother involves having a preference for the well-being of one’s\nown children. The mother who really is impartial would be a very\nbad mother, lacking in the appropriate virtues. \n\nAnother option is to hold that there are partial norms, but those\npartial norms are themselves justified on impartial grounds. This\ncan be spelled out in a variety of different ways. Consider\nMarcia Baron’s defense of impartiality, where she notes that\ncritics of impartiality are mistaken because they confuse\nlevels of justification: “Critics suppose that\nimpartialists insisting on impartiality at the level of rules or\nprinciples are committed to insisting on impartiality at the level of\ndeciding what to do in one’s day-to-day activities” (Baron\n1991). This is a mistake because impartialists can justify\npartial norms by appealing to impartial rules or principles. She\nis correct about this. Even Jeremy Bentham believed, for example,\nthat the principle of utility ought not be applied in every case,\nthough he mainly appealed to efficiency costs of using the principle\nall the time. But one can appeal to other considerations. \nFrank Jackson uses an analogy with predators to argue that partial\nnorms are strategies for maximizing the good, they offer the best\nchance of actually doing so given our limitations (Jackson 1991). \nSimilarly, a Kantian such as Tom Hill, jr., as Baron notes, can argue\nthat impartiality is part of an ideal, and ought not govern our\nday-to-day lives (Hill 1987). Does this alienate people from\nothers? The typical mother shows the right amount of preference\nfor her child, let’s say, but doesn’t herself think that\nthis is justified on the basis of promoting the good, for\nexample. A friend visits another in the hospital and also does\nnot view the partiality as justified by any further principles. \nBut this is no more alienating than someone being able to make good\narguments and criticize bad ones without a knowledge of inference\nrules. Maybe it is better to have an awareness of the underlying\njustification, but for some theories even that is debatable. For\nan objective theorist (see below) it may be that knowing the underlying\njustification can interfere with doing the right thing, in which case\nit is better not to know. For some theorists, however, such as\nneo-Aristotelian virtue ethicists, a person is not truly virtuous\nwithout such knowledge and understanding, though Rosalind Hursthouse\n(1999) does not make this a requirement of right action.\n\nRecently consequentialists have been approaching this issue through\nthe theory of value itself, arguing that there are agent-relative forms\nof value. This approach is able to explain the intuitions that\nsupport partial moral norms while retaining the general structure of\nconsequentialism (Sen 2000). Douglas Portmore, for example,\nargues for a form of consequentialism that he terms “commonsense\nconsequentialism” as it is able to accommodate many of our\neveryday moral intuitions (Portmore 2011). He does so by arguing\nthat (1) the deontic status of an act, whether it is right or wrong, is\ndetermined by what reasons the agent has for performing it – if\nan agent has a decisive reason to perform the act in question, then it\nis morally required. Combined with (2) a teleological view of\npractical reasons in which our reasons for performing an action are a\nfunction of what we have reason to prefer or desire we are led to a\nform of act-consequentialism but one which is open to accepting that we\nhave reason to prefer or desire the well-being of the near and dear\nover others.\n\nThough much of this is controversial, there is general agreement\nthat moral reasons are weighty, are not egoistic\n– that is, to be contrasted with prudential reasons, and are\nconcerned with issues of value [duty, fittingness].\n1.2.2. Morality and Aesthetics\n\nMoral modes of evaluation are distinct from the aesthetic in terms\nof their content, but also in terms of their authority. So, for\nexample, works of art are evaluated as “beautiful” or\n“ugly”, and those evaluations are not generally considered\nas universal or as objective as moral evaluations. These\ndistinctions between moral evaluation and aesthetic evaluation have\nbeen challenged, and are the subject of some interesting debates in\nmetaethics on the nature of both moral and aesthetic norms and the\ntruth-conditions of moral and aesthetic claims. But, considered\nintuitively, aesthetics seems at least less objective than\nmorality.\n\nA number of writers have noted that we need to be cognizant of the\ndistinction between moral norms and the norms specific to other\nnormative areas in order to avoid fallacies of evaluation, and much\ndiscussion has centered on a problem in aesthetics termed the\n“Moralistic Fallacy” (D’Arms and Jacobson 2000).\n\nOne challenge that the anti-theorists have raised for morality was\nto note that in a person’s life there will be certain norm\nclashes – including clashes between types of norms such\nas the moral and the aesthetic. It is giving too much prominence\nto the moral that judges a person’s life as going well relative\nto the fulfillment or respect of those norms. Can’t a\nhuman life go well, even when that life sacrifices morality for\naesthetics?\n\nThis sort of debate has a long history in moral theory. For\nexample, it arose as a form of criticism of G. E. Moore’s Ideal\nUtilitarianism, which treated beauty as an intrinsic good, and\nrendering trade-offs between behaving well towards others and creating\nbeauty at least in principle justified morally (Moore\n1903). But the anti-theorists do not pursue this method of\naccommodating the aesthetic, instead arguing that it is a separate\nnormative realm which has its own weight and significance in human\nflourishing.\n2. Theory and Theoretical Virtues\n\n\nThere is agreement that theories play some kind\nof systematizing role, and that one function is to examine\nimportant concepts relevant to morality and moral practice and the\nconnections, if any, between them. For example, one very common view\nin the middle of the 20th century, attributed to John\nRawls, was to view moral theory as primarily interested in\nunderstanding the ‘right’ and the ‘good’ and\nconnections between the two (Rawls). Priority claims are often a\ncentral feature in the systematizing role of moral theory. Related to\nthis is the issue of explanatory, or theoretical, depth. That\nis, the deeper the explanation goes, the better.\n\nTheories also strive for simplicity, coherence,\nand accuracy. The fewer epicycles the theory has to postulate\nthe better, the parts of the theory should fit well together. For\nexample, the theory should not contain inconsistent principles, or have\ninconsistent implications. The theory should cover the phenomena\nin question. In the case of moral theories, the phenomena in\nquestion are thought to be our considered moral intuitions or\njudgements. Another coherence condition involves the theory cohering\nwith a person’s set of considered judgments, as well.\n\nOne last feature that needs stressing, particularly for moral\ntheories, is applicability. One criticism of some normative\nethical theories is that they are not applicable. For example,\nVirtue Ethics has been criticized for not providing an account of what\nour moral obligations are – appealing to what the\nvirtuous person would do in the circumstances would seem to set a very\nhigh bar or doesn’t answer the relevant question about how we\nshould structure laws guiding people on what their social obligations\nare. Similarly, objective consequentialists, who understand\n“right action” in terms of actual consequences have been\ncriticized for rendering what counts as a right action in a given\ncircumstance unknowable, and thus useless as a guide to action. \nBoth approaches provide responses to this worry, but this supports the\nclaim that a desideratum of a moral theory is that it be\napplicable.\n2.1 The Tasks of Moral Theory\n\nOne task (though this is somewhat controversial) of a moral theory\nis to give an account of right actions. Often, this will involve\nan explication of what counts as good – some theories then get\nspelled out in terms of how they approach the good, by maximizing it,\nproducing enough of it, honoring it, etc. In addition, some\ntheories explicate the right in terms of acting in accordance with\none’s duties, or acting as a virtuous person would act. In\nthese cases the notions of ‘duty’ and ‘virtue’\nbecome important to the overall analysis, and one function of moral\ntheory is to explore the systematic connections between duty or virtue\nand the right and the good.\n\nMoral theories also have both substantive and formal aims. \nMoral theories try to provide criteria for judging actions. It\nmight be that the criterion is simple, such as right actions maximize\nthe good, or it may be complex, such as the right action is the one\nthat gives adequate weight to each competing duty. \nSometimes, in recognition that there is not always “the”\nright action, the theory simply provides an account of wrongness, or\npermissibility and impermissibility, which allows that a range of\nactions might count as “right”. \n\nIn addition to simply providing criteria for right or virtuous\naction, or for being a virtuous person, a given moral theory, for\nexample, will attempt to explain why something, like an action\nor character trait, has a particular moral quality, such as rightness\nor virtuousness. Some theories view rightness as grounded in or\nexplained by value. Some view rightness as a matter of\nreasons that are prior to value. In each case, to\nprovide an explanation of the property of ‘rightness’ or\n‘virtuousness’ will be to provide an account of what the\ngrounding value is, or an account of reasons for action.\n\nIn addition, moral theories may also provide\ndecision-procedures to employ in determining how to act\nrightly or virtuously, conditions on being good or virtuous, or\nconditions on morally appropriate practical deliberation. Thus,\nthe theory provides substance to evaluation and reasons. However,\nmoral theories, in virtue of providing an explanatory framework, help\nus see connections between criteria and decision-procedures, as well as\nprovide other forms of systemization. Thus, moral theories will\nbe themselves evaluated according to their theoretical virtues:\nsimplicity, explanatory power, elegance, etc. To evaluate moral\ntheories as theories, each needs to be evaluated in terms of\nhow well it succeeds in achieving these theoretical goals.\n\nThere are many more specialized elements to moral theories as\nwell. For example, a moral theory often concerns itself with\nfeatures of moral psychology relevant to action and character, such as\nmotives, intentions, emotions, and reasons responsiveness. A\nmoral theory that incorporates consideration of consequences into the\ndetermination of moral quality, will also be concerned with issues\nsurrounding the proper aggregation of those consequences, and\nthe scope of the consequences to be considered.\n2.2 Theory Construction\n\nThere’s been a long history of comparing moral theories to\nother sorts of theories, such as scientific ones. For example, in\nmeta-ethics one issue has to do with the nature of moral\n“evidence” on analogy with scientific evidence. \n On what Ronald Dworkin terms the “natural model” the\ntruths of morality are discovered, just as the truths of science are\n(Dworkin 1977, 160). It is our considered intuitions that provide the\nclues to discover these moral truths, just as what is observable to us\nprovides the evidence to discover scientific truths. He compared\nthis model with the “constructive model” in which the\nintuitions themselves are features of the theory being constructed and\nare not analogous to observations of the external world.\n\nYet, even if we decide that morality lacks the same type of\nphenomena to be accounted for as science, morality clearly figures into\nour normative judgments and reactions. One might view these\n– our intuitions about moral cases, for example – to\nprovide the basic data that needs to be accounted for by a theory on\neither model.\n\nOne way to “account for” our considered intuitions would\nbe to debunk them. There is a long tradition of this in moral\nphilosophy as well. When scholars provided genealogies of\nmorality that explained our considered intuitions in terms of social\nor evolutionary forces that are not sensitive the truth, for example,\nthey were debunking morality by undercutting the authority of our\nintuitions to provide insight into it (Nietzsche 1887 [1998], Joyce\n2001, Street 2006). In this entry, however, we consider the ways in\nwhich moral theorists have constructed their accounts by taking the\nintuitions seriously as something to be systematized, explained, and\nas something that can be applied to generate the correct moral\ndecisions or outcomes.\n\nAlong these lines, one method used in theory construction would\ninvolve the use of reflective equilibrium and inference to the best\nexplanation. For example, one might notice an apparent inconsistency\nin moral judgements regarding two structurally similar cases and then\ntry to figure out what principle or set of principles would achieve\nconsistency between them. In this case, the theorist is trying to\nfigure out what best explains both of those intuitions. But one also\nmight, after thinking about principles one already accepts, or finds\nplausible, reject one of those intuitions on the basis of it not\ncohering with the rest of one’s considered views. But full\ntheory construction will go beyond this because of the fully\ntheoretical virtues discussed earlier. We want a systematic account\nthat coheres well not only with itself, but with other things that we\nbelieve on the basis of good evidence.\n3. Criteria\n\nConsider the following:\n\nMalory has promised to take Chris grocery shopping.  Unfortunately, as\nMalory is leaving the apartment, Sam calls with an urgent request:\nplease come over to my house right now, my pipes have broken and I\nneed help! Torn, Malory decides to help Sam, and thus breaks a promise\nto Chris.\n\nHas Malory done the right thing? The virtuous thing? \nMalory has broken a promise, which is pro tanto wrong, but Sam\nis in an emergency and needs help right away. Even if it is clear\nthat what Malory did was right in the circumstances, it is an\ninteresting question as to why it is right. What can we appeal to in\nmaking these sorts of judgments? This brings to light the issue\nof how one morally justifies one’s actions. This\nis the task of understanding what the justifying reasons are for our\nactions. What makes an action the thing to do in the\ncircumstances? This is the criterion of rightness (or\nwrongness). We will focus on the criterion of rightness, though\nthe criterion issue comes up with other modes of moral evaluation, such\nas judging an action to be virtuous, or judging it to be good in some\nrespect, even if not right. Indeed, some writers have argued that\n‘morally right’ should be jettisoned from modern secular\nethics, as it presupposes a conceptual framework left over from\nreligiously based accounts which assume there is a God (Anscombe\n1958). We will leave these worries aside for now, however, and\nfocus on standard accounts of criteria.\n\nThe following are some toy examples that exhibit differing\nstructural features for moral theories and set out different\ncriteria: \n\n\nConsequentialism. The right action is the action that\nproduces good amongst the options open to the agent at the\ntime of action (Singer). The most well-known version of this\ntheory is Classical Utilitarianism, which holds that the right action\npromotes pleasure (Mill).\n\nKantian Deontology. The morally worthy action is in\naccordance with the Categorical Imperative, which requires an agent\nrefrain from acting in a way that fails to respect the rational nature\nof other persons (Kant).\n\nRossian Deontology. The right action is the action that best\naccords with the fulfillment and/or non-violation of one’s\nprima facie duties (Ross).\n\nContractualism.An action is morally wrong if it is an act that\nwould be forbidden by principles that rational persons could not\nreasonably reject (Scanlon).\n\nVirtue Ethics.The right action is the action that a virtuous\nperson would characteristically perform in the circumstances\n(Hursthouse 1999).\n\n\nThese principles set out the criterion or standard\nfor evaluation of actions. They do not necessarily tell us\nhow to perform right actions, and are not, in themselves,\ndecision-procedures, though they can easily be turned into decision\nprocedures, such as: you ought to try to perform the action that\nmaximizes the good amongst the options available to you at the time of\naction. This might not be, and in ordinary circumstance probably\nisn’t, a very good decision-procedure, and would itself need to\nbe evaluated according to the criterion set out by the theory.\n\nThese theories can be divided, roughly, into the deontological,\nconsequentialist, and virtue ethical categories. There has been a\nlively debate about how, exactly, to delineate these categories. \nSome have held that deontological theories were just those theories\nthat were not consequentialist. A popular conception of\nconsequentialist theories is that they are reductionist in a particular\nway – that is, in virtue of reducing deontic features of actions\n(e.g. rightness, obligatoriness) to facts about an agent’s\noptions and the consequences of those options (Smith 2009). If\nthat is the case, then it seems that deontological approaches are just\nthe ones that are not reductive in this manner. However, this\nfails to capture the distinctive features of many forms of virtue\nethics, which are neither consequentialist nor necessarily concerned\nwith what we ought to do, our duties as opposed to\nwhat sorts of persons we should be.\n\nOne way to distinguish consequentialist from deontological theories\nis in terms of how each approaches value. Philip Pettit has\nsuggested that while consequentialist theories required\npromotion of value, deontological theories recommend that\nvalue be honored or respected.  On each of\nthese views, value is an important component of the theory, and\ntheories will be partially delineated according to their theory of\nvalue. A utilitarian such as Jeremey Bentham believes that hedonism is\nthe correct theory of value, whereas someone such as G. E. Moore, a\nutilitarian but a pluralist regarding value, believes that hedonism is\nmuch too narrow an account. A Kantian, on the other hand, views\nvalue as grounded in rational nature, in a will conforming to the\nCategorical Imperative.\n\nBecause of the systematizing function of moral theory discussed\nearlier, the simplest account is to be preferred and thus there is a\nmove away from endorsing value pluralism. Of course, as intuitive\npressure is put on each of the simpler alternatives, a pluralistic\naccount of criteria for rightness and wrongness has the advantage of\naccording best with moral intuitions.\n\nReasons-first philosophers will delineate the theories somewhat\ndifferently. For example, one might understand goodness as a\nmatter of what we have reason to desire, in which case what we have\nreason to desire is prior to goodness rather than the other way\naround. Value is still an important component of the theories, it\nis simply that the value is grounded in reasons.\n\nAnother distinction between normative theories is that between\nsubjective and objective versions of a type of theory. This\ndistinction cuts across other categories. For example, there are\nsubjective forms of all the major moral theories, and objective\nversions of many. An objective standard of right holds that the agent\nmust actually meet the standard – and meeting the standard is\nsomething ‘objective’, not dependent on the agent’s\npsychological states – in order to count as right or\nvirtuous. Subjective standards come in two broad forms:\n\nPsychology sensitive: are the justifying reasons part of\nthe agent’s deliberative processes? Or, more weakly, are they\n“recoverable” from the agent’s psychology [perhaps,\nfor example, the agent has a commitment to the values that provide the\nreasons].\nEvidence sensitive: the right action isn’t the one\nthat actually meets the standard, but instead, is the action that the\nagent could foresee would meet that standard. [there are many\ndifferent ways to spell this out, depending on the degree of evidence\nthat is relevant: in terms of what the agent actually foresees, what\nis foreseeable by the agent given what the agent knows, is foreseeable\nby someone in possession of a reasonable amount of evidence, etc.]\n\n\nOf course, these two can overlap. For theorists who are\nevaluational internalists, evidence-sensitivity doesn’t\nseem like a plausible way of spelling out the standard, except,\nperhaps, indirectly. The distinction frequently comes up in\nConsequentialism, where the Objective standard is taken to be something\nlike: the right action is the action that actually promotes the\ngood and the Subjective standard is something like: the right\naction is the action that promotes the good by the agent’s own\nlights (psychology sensitive) or the right action is the action that\npromotes the foreseeable good, given evidence available at the time of\naction (evidence sensitive standard). It is certainly possible\nfor other moral standards to be objective. For example, the right\naction is the action that the virtuous person would perform, even\nthough the agent does not realize it is what the virtuous agent would\ndo in the circumstances, and even if the person with the best available\nevidence couldn’t realize it is what the virtuous person would do\nin the circumstances.\n\nWe certainly utter locutions that support both subjective and\nobjective uses of what we ‘ought’ to do, or what is\n‘right’. Frank Jackson notes this when he writes:\n\n…we have no alternative but to recognize a whole range of\noughts – what she ought to do by the light of her beliefs at the\ntime of action, …what she ought to do by the lights of one or\nanother onlooker who has different information on the subject, and,\nwhat is more, what she ought to do by God’s lights…that\nis, by the lights of one who knows what will and would happen\nfor each and every course of action. (Jackson 1991, 471).\n\nFor Jackson, the primary ought, the primary sense of\n‘rightness’ for an action, is the one that is “most\nimmediately relevant to action” since, otherwise, we have a\nproblem of understanding how the action is the agent’s. \nThus, the subjective ‘ought’ is primary in the sense that\nthis is the one that ethical theory should be concerned with (Jackson\n1991). Each type of theorist makes use of our ordinary language\nintuitions to make their case. But one desideratum of a theory is that\nit not simply reflect those intuitions, but also provides the tools to\ncritically analyze them. Given that our language allows for\nboth sorts of ‘ought,’ the interesting issue becomes which,\nif either, has primacy in terms of actually providing the standard by\nwhich other things are evaluated? Moral theory needn’t only\nbe concerned with what the right action is from the agent’s point\nof view.\n\nThere are three possibilities:\n\nneither has primacy\nthe subjective has primacy\nthe objective has primacy\n\n\nFirst off we need to understand what we mean by\n“primacy”. Again, for Frank Jackson, the primary\nsense of ‘right’ or ‘ought’ is subjective,\nsince what we care about is the ‘right’ that refers to an\ninward story, the story of our agency, so to speak. On this view,\nthe objective and subjective senses may have no relationship to each\nother at all, and which counts as primary simply depends upon our\ninterests. However, the issue that concerns us here is whether or\nnot one sense can be accounted for in terms of the\nother. Option 1 holds that there is no explanatory\nconnection. That is not as theoretically satisfying. Option 2\nholds either there really is no meaningful objective sense, just the\nsubjective sense, or the objective sense is understood in terms of the\nsubjective. \n\nLet’s look at the objective locution again “He did the\nright thing, but he didn’t know it at the time (or he had no way\nof knowing it at the time)”. Perhaps all this means is “He\ndid what someone with all the facts and correct set of values would\nhave judged right by their own lights” – this would be\nextensionally the same as “He performed the action with the best\nactual consequences”. This is certainly a possible account of\nwhat objective right means which makes use of a subjective\nstandard. But it violates the spirit of the subjective standard, since\nit ties rightness neither to the psychology of the agent, or the\nevidence that is actually available to the agent. For that reason, it\nseems more natural to opt for 3. An advantage of this option is that\ngives us a nice, unified account regarding the connection between the\nobjective and the subjective. Subjective standards, then, are\nstandards of praise and blame, which are themselves evaluable\naccording to the objective standard. Over time, people are in a\nposition to tell whether or not a standard actually works in a given\ntype of context. Or, perhaps it turns out that there are several\nstandards of blame that differ in terms of severity. For example,\nif someone acts negligently a sensible case can be made that the person\nis blameworthy but not as blameworthy as if they had acted\nintentionally.\n\nAs to the worry that the objective standard doesn’t provide\naction guidance, the objective theorist can hold that action guidance\nis provided by the subjective standards of\npraise/blameworthiness. Further, the standard itself can provide\nwhat we need for action guidance through normative review (Driver\n2012). Normative review is a retrospective look at what does in fact\nmeet the standard, and under what circumstances.\n\nNow, consider a virtue ethical example. The right action is\nthe action that is the actual action that a virtuous person would\nperform characteristically, in the circumstances, rather than the\naction that the agent believes is the one the virtuous person would\nperform. Then we evaluate an agent’s “v-rules”\nin terms of how close they meet the virtuous ideal.\n4. Decision Procedures and Practical Deliberation\n\n\nAnother function of moral theory is to provide a decision procedure\nfor people to follow so as to best insure they perform right\nactions. Indeed, some writers, such as R. M. Hare hold action guidance\nto be the function of the moral principles of the theory (Hare\n1965). This raises the question of what considerations are relevant to\nthe content of such principles – for example, should the\nprinciples be formulated taking into account the epistemic limitations\nof most human beings? The requirement that moral principles be action\nguiding is what Holly Smith terms the “Useability Demand”:\n“…an acceptable moral principle must be useable for\nguiding moral decisions…” (Smith 2020, 11). Smith\nenumerates different forms satisfaction of this demand can take, and\nnotes that how one spells out a principle in order to meet the demand\nwill depend upon how the moral theorist views moral success. For\nexample, whether or not success is achieved in virtue of simply making\nthe right decision or if, in addition to making the right decision,\nthe agent must also have successful follow-through on that\ndecision.\n\nThere has been enormous debate on the issue of what is involved in\nfollowing a rule or principle, and some skepticism that this is in fact\nwhat we are doing when we take ourselves to be following a\nrule. (Kripke 1982) Some virtue theorists believe that it is moral\nperception that actually does the guiding, and that a virtuous person\nis able to perceive what is morally relevant and act accordingly\n(McDowell 1979).\n\nAs discussed earlier in the section on criteria, however, this is\nalso controversial in that some theorists believe that decision\nprocedures themselves are not of fundamental significance. Again,\nobjective consequentialist who believes that the fundamental task of\ntheory is to establish a criterion for right argues that decision\nprocedures will themselves be established and evaluated on the basis of\nhow well they get us to actually achieving the right. Thus, the\ndecision-procedures are derivative. Others, such as subjective\nconsequentialists, will argue that the decision-procedures\nspecify the criterion in the sense that following the\ndecision-procedure itself is sufficient for meeting the\ncriterion. For example, an objective consequentialist will hold\nthat the right action maximizes the good, whereas the subjective\nconsequentialist might hold that the right action is to try to\nmaximize the good, whether or not one actually achieves it (Mason 2003\nand 2019). Following the decision-procedure itself,\nthen, is the criterion. \n\nThe distinction between criterion and decision-procedure has been\nacknowledged and discussed at least since Sidgwick, though it was also\nmentioned by earlier ethicists. This distinction allows ethical\ntheories to avoid wildly implausible implications. For example,\nif the standard that the theory recommends is ‘promote the\ngood’ it would be a mistake to think that ‘promote the\ngood’ needs to be part of the agent’s\ndeliberation. The consequentialist might say that, instead, it is\nan empirical issue as to what the theory is going to recommend as a\ndecision-procedure, and that recommendation could vary from context to\ncontext. There will surely be circumstances in which it would be\nbest to think in terms of meeting the standard itself, but again that\nis an empirical issue. Likewise, it is open to a Virtue Ethicist\nto hold that the right action is the one the virtuous agent would\nperform in the circumstances, but also hold that the agent’s\ndeliberative processes need not make reference to the standard. \nPretty much all theories will want to make some space between the\nstandard and the decision-procedure in order to avoid a requirement\nthat agent’s must think in terms of the correct standard, in\norder to act rightly, or even act with moral worth. There is a\ndistinction to be made between doing the right thing, and doing the\nright thing for the right reasons. Doing the right thing for\nthe right reasons makes the action a morally worthy one, as it exhibits\na good quality of the will. It is possible for a theory to hold\nthat the ‘good will’ is one that understands the underlying\njustification of an action, but that seems overly demanding. If\nconsequentialism is the correct theory, then demanding that people must\nexplicitly act intentionally to maximize the good would result in fewer\nmorally worthy actions than seems plausible. The ‘for the\nright reasons’ must be understood as allowing for no explicit\ninvocation of the true justifying standard.\n\nThis has led to the development of theories that advocate\nindirection. First, we need to distinguish two ways that\nindirection figures into moral philosophy. \n\nIndirection in evaluation of right action.\nIndirection in that the theory does not necessarily advocate the\nnecessity of aiming for the right action.\n\n\nTo use Utilitarianism as an example again, Rule Utilitarianism is an\nexample of the first sort of indirection (Hooker 2000),\nSophisticated Consequentialism is an example of the second\nsort of indirection (Railton 1984). One might hold that some\nversions of Aristotelian Virtue ethics, such as Rosalind\nHursthouse’s version, also are of the first type, since\nright action is understood in terms of virtue. One could imagine\nan indirect consequentialist view with a similar structure: the\nright action is the action that the virtuous person would perform,\nwhere virtue is understood as a trait conducive to the good, instead of\nby appeal to an Aristotelian notion of human flourishing.\n\nThe second sort relies on the standard/decision-procedure\ndistinction. Railton argues that personal relationships are good\nfor people, and explicitly trying to maximize the good is not a part of\nour relationship norms, so it is likely good that we develop\ndispositions to focus on and pay special attention to our loved\nones. The account is open to the possibility that people who\ndon’t believe in consequentialism have another way of deciding\nhow to act that is correlated with promotion of the good. If the\ncriteria a theory sets out need not be fulfilled by the agent guiding\nherself with the reasons set out by the criteria, then it is termed\nself-effacing. When a theory is self-effacing, it has\nthe problem of alienating a person from the justification of her own\nactions. A middle ground, which is closer to Railton’s\nview, holds that the correct justification is a kind of\n“touchstone” to the morally good person – consulted\nperiodically for self-regulation, but not taken explicitly into\nconsideration in our ordinary, day-to-day lives. In this way, the\ntheory would not be utterly self-effacing and the agent would still\nunderstand the moral basis for her own actions.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alicke, Mark, David Rose and Dori Bloom, 2011, “Causation,\nNorm Violation, and Culpable Control,” <em>Journal of\nPhilosophy</em>, 108(12): 670–696.",
                "Annas, Julia, 2011, <em>Intelligent Virtue</em>, New York: Oxford\nUniversity Press.",
                "Arpaly, Nomy, 2002, <em>Unprincipled Virtue</em>, New York: Oxford\nUniversity Press.",
                "Baier, Annette, 1985, <em>Postures of the Mind</em>, Minneapolis,\nMN: University of Minnesota Press.",
                "Baron, Marcia, 1991, “Impartiality and Friendship,”\n<em>Ethics</em>, 101(4): 836–857.",
                "–––, 1995, <em>Kantian Ethics Almost Without\nApology</em>, Ithaca, NY: Cornell University Press.",
                "Clarke, Stanley G, 1987, “Anti-Theory in Ethics,”\n<em>American Philosophical Quarterly</em>, 24(3): 237–244.",
                "D’Arms, Justin and Daniel Jacobson, 2000 , “The\nMoralistic Fallacy: On the ‘Appropriateness’ of\nEmotions,” <em>Philosophy and Phenomenological Research</em>,\n61(1): 65–90.",
                "Darwall, Stephen, 2006, <em>The Second-Person Standpoint</em>,\nCambridge, MA: Harvard University Press.",
                "Dreier, Jamie, 1993, “Structures of Normative Theories,”\n<em>The Monist</em>, 76(1): 22–40.",
                "Driver, Julia, 2012, “What the Objective Standard is Good\nFor,” in Mark Timmons (ed.), <em>Oxford Studies in\nNormative Ethics</em>, New York: Oxford University Press, 28–44.",
                "Dworkin, Ronald, 1977, <em>Taking Rights Seriously</em>, Cambridge,\nMA: Harvard University Press.",
                "Foot, Philippa, 1967, “Abortion and the Doctrine of Double\nEffect,” <em>Oxford Review</em>, 5: 5–15.",
                "Graham, Peter, 2010, “In Defense of Objectivism About Moral\nObligation,” <em>Ethics</em>, 121(1): 88–115.",
                "Hare, R. M., 1965, <em>Freedom and Reason</em>, New York: Oxford\nUniversity Press.",
                "Herman, Barbara, 1985, “The Practice of Moral Judgment,”\n<em>Journal of Philosophy</em>, 82(8): 414–436.",
                "Hill, jr., Thomas E., 1987, “The Importance of\nAutonomy,” in Eva Kittay and Diana Meyers (ed.) <em>Women and\nMoral Theory</em>, Totowa, NJ: Rowman &amp; Allanheld,\n129–138.",
                "Hooker, Brad, 2000, <em>Ideal Code, Real World</em>, New York:\nOxford University Press.",
                "Hurka, Thomas, 2001, <em>Virtue, Vice, and Value</em>, New\nYork: Oxford University Press.",
                "Hursthouse, Rosalind, 1999, <em>On Virtue Ethics</em>, New York:\nOxford University Press.",
                "Jackson, Frank, 1991, “Decision-theoretic\nConsequentialism and the Nearest and Dearest Objection,”\n<em>Ethics</em>, 101(3): 461–482.",
                "Jeske, Diane, 2008, <em>Rationality and Moral Theory: How Intimacy\nGenerates Reasons</em>, New York: Routledge.",
                "Joyce, Richard, 2001, <em>The Myth of Morality</em>, New York:\nCambridge University Press.",
                "Keas, Michael, 2018, “Systematizing the Theoretical\nVirtues,” <em>Synthese</em>, 195: 2761–2793.",
                "Kagan, Shelley, 1989, <em>The Limits of Morality</em>, New York:\nOxford University Press.",
                "Kamm, Frances, 2007, <em>Intricate Ethics: Rights, Responsibilities,\nand Permissible Harm</em>, New York: Oxford University Press.",
                "Kant, Immanuel, 1785 [2012], <em>Groundwork of the Metaphysics of\nMorals</em>, tr. by Mary Gregor and Jens Timmerman, New York:\nCambridge University Press, 2012.",
                "Knobe, Joshua, 2003, “Intentional Action in Folk Psychology:\nAn Experimental Investigation,” <em>Philosophical\nPsychology</em>, 16(2): 309–325.",
                "Kripke, Saul, 1982, <em>Wittgenstein on Rules and Private\nLanguages</em>, Cambridge, MA: Harvard University Press.",
                "Louden, Robert, 1990, “Virtue Ethics and Anti-Theory,”\n<em>Philosophia</em>, 20(1–2): 93–114.",
                "Markovits, Julia, 2014, <em>Moral Reason</em>, New York: Oxford\nUniversity Press.",
                "Mason, Elinor, 2003, “Consequentialism and the ‘Ought\nImplies Can’ Principle,” <em>American Philosophical\nQuarterly</em>, 40(4): 319–331.",
                "–––, 2019, <em>Ways to Be Blameworthy:\nRightness, Wrongness, and Responsibility</em>, New York: Oxford\nUniversity Press.",
                "McDowell, John, 1979, “Virtue and Reason,” <em>The\nMonist</em>, 62(3): 331–350.",
                "Moody-Adams, Michelle, 2002, <em> Fieldwork in Familiar Places:\nMorality, Culture, and Philosophy</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Moore, G. E., 1903 [1993], <em>Principia Ethica</em>, ed. Thomas\nBaldwin, New York: Cambridge University Press, 1993.",
                "Nagel, Thomas, 1979, “The Fragmentation of Value,” in\n<em>Mortal Questions</em>, New York: Cambridge University Press,\n128–141.",
                "Nietzsche, Friedrich, 1887 [1998], <em>On the Genealogy of\nMorality</em>, Maudemarie Clark and Alan J. Swensen (trans.),\nIndianapolis, IN: Hackett Publishing.",
                "Norcross, Alastair, 2020, <em>Morality By Degrees</em>, New\nYork: Oxford University Press.",
                "Olson, Jonas, 2004, “Buck-Passing and the Wrong Kind of\nReasons,” <em>Philosophical Quarterly</em>, 54(215): 295–300.",
                "Parfit, Derek, 1984, <em>Reasons and Persons</em>, Oxford: Clarendon\nPress.",
                "Pettit, Phillip, 1997, “The Consequentialist\nPerspective,” in <em>The Three Methods of Ethics</em>, by Marcia\nBaron, Phillip Pettit, and Michael Slote, Oxford: Blackwell,\n92–174.",
                "Pettit, Phillip, and Michael Smith, 2000, “Global\nConsequentialism,” in Brad Hooker, et al. (eds.), <em>Morality,\nRules, and Consequences</em>, Edinburgh: University of Edinburgh\nPress, 121–133.",
                "Phillips, David, 2019, <em>Rossian Ethics</em>, New York: Oxford\nUniversity Press.",
                "Piper, Adrian, 1987, “Moral Theory and Moral\nAlienation,” <em>Journal of Philosophy</em>, 82(2): 102–118.",
                "Portmore, Douglas, 2011, <em>Commonsense Consequentialism</em>, New\nYork: Oxford University Press.",
                "Rabinowicz, Wlodek and Toni Ronnow-Rasmussen, 2004, “The\nStrike of the Demon: on Fitting Pro-Attitudes and Value,”\n<em>Ethics</em>, 114(3): 391–423.",
                "Railton, Peter, 1984, “Alienation, Consequentialism, and\nthe Demands of Morality,” <em>Philosophy and Public Affairs</em>,\n13(2): 134–171.",
                "Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nBelknap Press.",
                "Scanlon, T. M., 1998, <em>What We Owe to Each Other</em>, Cambridge,\nMA: Belknap Press.",
                "–––, 2008, <em>Moral Dimensions</em>, Cambridge,\nMA: Harvard University Press.",
                "Scheffler, Samuel, 1982, <em>The Rejection of Consequentialism</em>,\nNew York: Oxford University Press.",
                "Schneewind, J. B., 1963, “First Principles and Common-sense\nMorality in Sidgwick’s Ethics,” <em>Archiv fur Geschichte\nder Philosophie</em>, 45(2): 137–156.",
                "–––, 1990, “The Misfortunes of\nVirtue,” <em>Ethics</em>, 101(1): 42–63.",
                "Schofield, Paul, 2021, <em>Duty to Self: Moral, Political, and Legal\nSelf-Relation</em>, New York: Oxford University Press.",
                "Sen, Amartya, 2000, “Consequential Evaluation and Practical\nReason,” <em>The Journal of Philosophy</em>, 47(9): 477–502.",
                "Sidgwick, Henry, 1874 [1907], <em>The Methods of Ethics</em>,\nLondon: Macmillan. [The seventh edition was published in 1907.]",
                "Singer, Marcus, 1986, “Ethics and Common Sense,”\n<em>Revue Internationale de Philosophie</em>, 40(158): 221–258.",
                "Slote, Michael, 1985, <em>Common-Sense Morality and\nConsequentialism</em>, New York: Routledge &amp; Kegan Paul.",
                "–––, 2007, <em>The Ethics of Care and\nEmpathy</em>, New York: Routledge.",
                "Smith, Holly, 2018, <em>Making Morality Work</em>, New York:\nOxford University Press.",
                "Smith, Michael, 2009, “Two Kinds of Consequentialism,”\n<em>Philosophical Issues</em>, 19(1): 257–272.",
                "Stark, Cynthia, 1997, “Decision Procedures, Standards of\nRightness and Impartiality,” <em>Noûs</em>, 31(4): 478–495.",
                "Stocker, Michael, 1976, “The Schizophrenia of Modern Ethical\nTheories,” <em>Journal of Philosophy</em>, 73(14): 453–466.",
                "Strawson, Peter, 1961, “Social Morality and Individual\nIdeal,” <em>Philosophy</em>, 36(136): 1–17.",
                "Street, Sharon, 2006, “A Darwinian Dilemma for Realist\nTheories of Value,” <em>Philosophical Studies</em>, 127(1):\n109–166.",
                "Thomson, Judith Jarvis, 1976, “Killing, Letting Die, and the\nTrolley Problem,” <em>The Monist</em>, 59(2): 204–217.",
                "Wiland, Eric J, “The Incoherence Objection in Moral\nTheory,” <em>Acta Analytica</em>, 25(3): 279–284.",
                "Williams, Bernard, 1985, <em>Ethics and the Limits of\nPhilosophy</em>, New York: Oxford University Press.",
                "Wolf, Susan, 1982, “Moral Saints,” <em>Journal of\nPhilosophy</em>, 79(8): 419–439.",
                "–––, 2014, “Loving Attention: Lessons in\nLove from <em>The Philadelphia Story</em>,” in Susan Wolf and\nChristopher Grau (eds.), <em>Understanding Love: Philosophy, Film, and\nFiction</em>, Oxford: Oxford University Press, pp. 369–386.",
                "Zagzebski, Linda Trinkhaus, 2017, <em>Exemplarist Moral Theory</em>,\nNew York: Oxford University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alicke, Mark, David Rose and Dori Bloom, 2011, “Causation,\nNorm Violation, and Culpable Control,” <em>Journal of\nPhilosophy</em>, 108(12): 670–696.</li>\n<li>Annas, Julia, 2011, <em>Intelligent Virtue</em>, New York: Oxford\nUniversity Press.</li>\n<li>Arpaly, Nomy, 2002, <em>Unprincipled Virtue</em>, New York: Oxford\nUniversity Press.</li>\n<li>Baier, Annette, 1985, <em>Postures of the Mind</em>, Minneapolis,\nMN: University of Minnesota Press.</li>\n<li>Baron, Marcia, 1991, “Impartiality and Friendship,”\n<em>Ethics</em>, 101(4): 836–857.</li>\n<li>–––, 1995, <em>Kantian Ethics Almost Without\nApology</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Clarke, Stanley G, 1987, “Anti-Theory in Ethics,”\n<em>American Philosophical Quarterly</em>, 24(3): 237–244.</li>\n<li>D’Arms, Justin and Daniel Jacobson, 2000 , “The\nMoralistic Fallacy: On the ‘Appropriateness’ of\nEmotions,” <em>Philosophy and Phenomenological Research</em>,\n61(1): 65–90.</li>\n<li>Darwall, Stephen, 2006, <em>The Second-Person Standpoint</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Dreier, Jamie, 1993, “Structures of Normative Theories,”\n<em>The Monist</em>, 76(1): 22–40.</li>\n<li>Driver, Julia, 2012, “What the Objective Standard is Good\nFor,” in Mark Timmons (ed.), <em>Oxford Studies in\nNormative Ethics</em>, New York: Oxford University Press, 28–44.</li>\n<li>Dworkin, Ronald, 1977, <em>Taking Rights Seriously</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Foot, Philippa, 1967, “Abortion and the Doctrine of Double\nEffect,” <em>Oxford Review</em>, 5: 5–15.</li>\n<li>Graham, Peter, 2010, “In Defense of Objectivism About Moral\nObligation,” <em>Ethics</em>, 121(1): 88–115.</li>\n<li>Hare, R. M., 1965, <em>Freedom and Reason</em>, New York: Oxford\nUniversity Press.</li>\n<li>Herman, Barbara, 1985, “The Practice of Moral Judgment,”\n<em>Journal of Philosophy</em>, 82(8): 414–436.</li>\n<li>Hill, jr., Thomas E., 1987, “The Importance of\nAutonomy,” in Eva Kittay and Diana Meyers (ed.) <em>Women and\nMoral Theory</em>, Totowa, NJ: Rowman &amp; Allanheld,\n129–138.</li>\n<li>Hooker, Brad, 2000, <em>Ideal Code, Real World</em>, New York:\nOxford University Press.</li>\n<li>Hurka, Thomas, 2001, <em>Virtue, Vice, and Value</em>, New\nYork: Oxford University Press.</li>\n<li>Hursthouse, Rosalind, 1999, <em>On Virtue Ethics</em>, New York:\nOxford University Press.</li>\n<li>Jackson, Frank, 1991, “Decision-theoretic\nConsequentialism and the Nearest and Dearest Objection,”\n<em>Ethics</em>, 101(3): 461–482.</li>\n<li>Jeske, Diane, 2008, <em>Rationality and Moral Theory: How Intimacy\nGenerates Reasons</em>, New York: Routledge.</li>\n<li>Joyce, Richard, 2001, <em>The Myth of Morality</em>, New York:\nCambridge University Press.</li>\n<li>Keas, Michael, 2018, “Systematizing the Theoretical\nVirtues,” <em>Synthese</em>, 195: 2761–2793.</li>\n<li>Kagan, Shelley, 1989, <em>The Limits of Morality</em>, New York:\nOxford University Press.</li>\n<li>Kamm, Frances, 2007, <em>Intricate Ethics: Rights, Responsibilities,\nand Permissible Harm</em>, New York: Oxford University Press.</li>\n<li>Kant, Immanuel, 1785 [2012], <em>Groundwork of the Metaphysics of\nMorals</em>, tr. by Mary Gregor and Jens Timmerman, New York:\nCambridge University Press, 2012.</li>\n<li>Knobe, Joshua, 2003, “Intentional Action in Folk Psychology:\nAn Experimental Investigation,” <em>Philosophical\nPsychology</em>, 16(2): 309–325.</li>\n<li>Kripke, Saul, 1982, <em>Wittgenstein on Rules and Private\nLanguages</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Louden, Robert, 1990, “Virtue Ethics and Anti-Theory,”\n<em>Philosophia</em>, 20(1–2): 93–114.</li>\n<li>Markovits, Julia, 2014, <em>Moral Reason</em>, New York: Oxford\nUniversity Press.</li>\n<li>Mason, Elinor, 2003, “Consequentialism and the ‘Ought\nImplies Can’ Principle,” <em>American Philosophical\nQuarterly</em>, 40(4): 319–331.</li>\n<li>–––, 2019, <em>Ways to Be Blameworthy:\nRightness, Wrongness, and Responsibility</em>, New York: Oxford\nUniversity Press.</li>\n<li>McDowell, John, 1979, “Virtue and Reason,” <em>The\nMonist</em>, 62(3): 331–350.</li>\n<li>Moody-Adams, Michelle, 2002, <em> Fieldwork in Familiar Places:\nMorality, Culture, and Philosophy</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Moore, G. E., 1903 [1993], <em>Principia Ethica</em>, ed. Thomas\nBaldwin, New York: Cambridge University Press, 1993.</li>\n<li>Nagel, Thomas, 1979, “The Fragmentation of Value,” in\n<em>Mortal Questions</em>, New York: Cambridge University Press,\n128–141.</li>\n<li>Nietzsche, Friedrich, 1887 [1998], <em>On the Genealogy of\nMorality</em>, Maudemarie Clark and Alan J. Swensen (trans.),\nIndianapolis, IN: Hackett Publishing.</li>\n<li>Norcross, Alastair, 2020, <em>Morality By Degrees</em>, New\nYork: Oxford University Press.</li>\n<li>Olson, Jonas, 2004, “Buck-Passing and the Wrong Kind of\nReasons,” <em>Philosophical Quarterly</em>, 54(215): 295–300.</li>\n<li>Parfit, Derek, 1984, <em>Reasons and Persons</em>, Oxford: Clarendon\nPress.</li>\n<li>Pettit, Phillip, 1997, “The Consequentialist\nPerspective,” in <em>The Three Methods of Ethics</em>, by Marcia\nBaron, Phillip Pettit, and Michael Slote, Oxford: Blackwell,\n92–174.</li>\n<li>Pettit, Phillip, and Michael Smith, 2000, “Global\nConsequentialism,” in Brad Hooker, et al. (eds.), <em>Morality,\nRules, and Consequences</em>, Edinburgh: University of Edinburgh\nPress, 121–133.</li>\n<li>Phillips, David, 2019, <em>Rossian Ethics</em>, New York: Oxford\nUniversity Press.</li>\n<li>Piper, Adrian, 1987, “Moral Theory and Moral\nAlienation,” <em>Journal of Philosophy</em>, 82(2): 102–118.</li>\n<li>Portmore, Douglas, 2011, <em>Commonsense Consequentialism</em>, New\nYork: Oxford University Press.</li>\n<li>Rabinowicz, Wlodek and Toni Ronnow-Rasmussen, 2004, “The\nStrike of the Demon: on Fitting Pro-Attitudes and Value,”\n<em>Ethics</em>, 114(3): 391–423.</li>\n<li>Railton, Peter, 1984, “Alienation, Consequentialism, and\nthe Demands of Morality,” <em>Philosophy and Public Affairs</em>,\n13(2): 134–171.</li>\n<li>Rawls, John, 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nBelknap Press.</li>\n<li>Scanlon, T. M., 1998, <em>What We Owe to Each Other</em>, Cambridge,\nMA: Belknap Press.</li>\n<li>–––, 2008, <em>Moral Dimensions</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Scheffler, Samuel, 1982, <em>The Rejection of Consequentialism</em>,\nNew York: Oxford University Press.</li>\n<li>Schneewind, J. B., 1963, “First Principles and Common-sense\nMorality in Sidgwick’s Ethics,” <em>Archiv fur Geschichte\nder Philosophie</em>, 45(2): 137–156.</li>\n<li>–––, 1990, “The Misfortunes of\nVirtue,” <em>Ethics</em>, 101(1): 42–63.</li>\n<li>Schofield, Paul, 2021, <em>Duty to Self: Moral, Political, and Legal\nSelf-Relation</em>, New York: Oxford University Press.</li>\n<li>Sen, Amartya, 2000, “Consequential Evaluation and Practical\nReason,” <em>The Journal of Philosophy</em>, 47(9): 477–502.</li>\n<li>Sidgwick, Henry, 1874 [1907], <em>The Methods of Ethics</em>,\nLondon: Macmillan. [The seventh edition was published in 1907.]</li>\n<li>Singer, Marcus, 1986, “Ethics and Common Sense,”\n<em>Revue Internationale de Philosophie</em>, 40(158): 221–258.</li>\n<li>Slote, Michael, 1985, <em>Common-Sense Morality and\nConsequentialism</em>, New York: Routledge &amp; Kegan Paul.</li>\n<li>–––, 2007, <em>The Ethics of Care and\nEmpathy</em>, New York: Routledge.</li>\n<li>Smith, Holly, 2018, <em>Making Morality Work</em>, New York:\nOxford University Press.</li>\n<li>Smith, Michael, 2009, “Two Kinds of Consequentialism,”\n<em>Philosophical Issues</em>, 19(1): 257–272.</li>\n<li>Stark, Cynthia, 1997, “Decision Procedures, Standards of\nRightness and Impartiality,” <em>Noûs</em>, 31(4): 478–495.</li>\n<li>Stocker, Michael, 1976, “The Schizophrenia of Modern Ethical\nTheories,” <em>Journal of Philosophy</em>, 73(14): 453–466.</li>\n<li>Strawson, Peter, 1961, “Social Morality and Individual\nIdeal,” <em>Philosophy</em>, 36(136): 1–17.</li>\n<li>Street, Sharon, 2006, “A Darwinian Dilemma for Realist\nTheories of Value,” <em>Philosophical Studies</em>, 127(1):\n109–166.</li>\n<li>Thomson, Judith Jarvis, 1976, “Killing, Letting Die, and the\nTrolley Problem,” <em>The Monist</em>, 59(2): 204–217.</li>\n<li>Wiland, Eric J, “The Incoherence Objection in Moral\nTheory,” <em>Acta Analytica</em>, 25(3): 279–284.</li>\n<li>Williams, Bernard, 1985, <em>Ethics and the Limits of\nPhilosophy</em>, New York: Oxford University Press.</li>\n<li>Wolf, Susan, 1982, “Moral Saints,” <em>Journal of\nPhilosophy</em>, 79(8): 419–439.</li>\n<li>–––, 2014, “Loving Attention: Lessons in\nLove from <em>The Philadelphia Story</em>,” in Susan Wolf and\nChristopher Grau (eds.), <em>Understanding Love: Philosophy, Film, and\nFiction</em>, Oxford: Oxford University Press, pp. 369–386.</li>\n<li>Zagzebski, Linda Trinkhaus, 2017, <em>Exemplarist Moral Theory</em>,\nNew York: Oxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "consequentialism",
            "ethics: deontological",
            "ethics: virtue",
            "morality, definition of",
            "value theory"
        ],
        "entry_link": [
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../ethics-deontological/": "ethics: deontological"
            },
            {
                "../ethics-virtue/": "ethics: virtue"
            },
            {
                "../morality-definition/": "morality, definition of"
            },
            {
                "../value-theory/": "value theory"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=moral-theory\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/moral-theory/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=moral-theory&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/moral-theory/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=moral-theory": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/moral-theory/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=moral-theory&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/moral-theory/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}