{
    "url": "negation",
    "title": "Negation",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Laurence R. Horn\n<laurence.horn@yale.edu>\nHeinrich Wansing\n<Heinrich.Wansing@rub.de>",
        "author_links": [
            {
                "https://ling.yale.edu/people/laurence-r-horn": "Laurence R. Horn"
            },
            {
                "mailto:laurence%2ehorn%40yale%2eedu": "laurence.horn@yale.edu"
            },
            {
                "http://www.ruhr-uni-bochum.de/philosophy/logic/": "Heinrich Wansing"
            },
            {
                "mailto:Heinrich%2eWansing%40rub%2ede": "Heinrich.Wansing@rub.de"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://ling.yale.edu/people/laurence-r-horn\" target=\"other\">Laurence R. Horn</a>\n&lt;<a href=\"mailto:laurence%2ehorn%40yale%2eedu\"><em>laurence<abbr title=\" dot \">.</abbr>horn<abbr title=\" at \">@</abbr>yale<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://www.ruhr-uni-bochum.de/philosophy/logic/\" target=\"other\">Heinrich Wansing</a>\n&lt;<a href=\"mailto:Heinrich%2eWansing%40rub%2ede\"><em>Heinrich<abbr title=\" dot \">.</abbr>Wansing<abbr title=\" at \">@</abbr>rub<abbr title=\" dot \">.</abbr>de</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jan 7, 2015",
        "substantive revision Thu Feb 20, 2020"
    ],
    "preamble": "\n\nNegation is in the first place a phenomenon of semantic opposition. As\nsuch, negation relates an expression \\(e\\) to another expression with\na meaning that is in some way opposed to the meaning of \\(e\\). This\nrelation may be realized syntactically and pragmatically in various\nways. Moreover, there are different kinds of semantic opposition.\n Section 1\n is concerned mainly with negation and opposition in natural language,\nboth from a historical and a systematic perspective.\n Section 2\n focuses on negation as a unary connective from the point of view of\nphilosophical logic. The history of negation is comprehensively\nstudied and surveyed in Horn 1989 and Speranza and Horn 2012.\n",
    "toc": [
        {
            "#NegOppNatLan": "1. Negation and opposition in natural language"
        },
        {
            "#Int": "1.1 Introduction"
        },
        {
            "#NegNatLanMarAsy": "1.2 Negation in natural language: markedness and asymmetry"
        },
        {
            "#MatSco": "1.3 Matters of scope"
        },
        {
            "#ConCon": "1.4 Contrariety and contradiction"
        },
        {
            "#NegPreSinTer": "1.5 Negation, presupposition, and singular terms"
        },
        {
            "#ConConPraStrNeg": "1.6 From contradiction to contrariety: pragmatic strengthening of negation"
        },
        {
            "#PriAffNegMarAsy": "1.7 Privation, affixal negation, and the markedness asymmetry"
        },
        {
            "#DouNeg": "1.8 Double negation"
        },
        {
            "#LogDouNeg": "1.8.1 “Logical” double negation"
        },
        {
            "#NegConRel": "1.8.2 Negative concord and its relations"
        },
        {
            "#NegPol": "1.9 Negative polarity"
        },
        {
            "#MetNeg": "1.10 Metalinguistic negation"
        },
        {
            "#LogNeg": "2. The logic of negation"
        },
        {
            "#NegTruFun": "2.1 Negation as a truth function"
        },
        {
            "#NegModOpe": "2.2 Negation as a modal operator"
        },
        {
            "#IntNeg": "2.3 Interactions with negation"
        },
        {
            "#OthConNegUna": "2.4 Other conceptions of negation as a unary connective"
        },
        {
            "#NegRejDen": "2.5 Negation, rejection, and denial"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Negation and opposition in natural language\n1.1 Introduction\n\nNegation is a sine qua non of every human language, yet is\nabsent from otherwise complex systems of animal\n communication.[1]\n While animal “languages” are essentially analog systems,\nit is the digital nature of the natural language negative operator,\nrepresented in Stoic and Fregean propositional logic as a one-place\nsentential connective toggling the truth value of statements between\nT[rue] and F[alse] (or 1 and 0) and applying recursively to its own\noutput, that allows for denial, contradiction, and other key\nproperties of human linguistic systems.\n\nThe simple syntactic nature of logical negation belies the profoundly\ncomplex and subtle expression of negation in natural language, as\nexpressed in linguistically distinct categories and parts of speech\n(adverbs, verbs, copulas, quantifiers, affixes). As will be partly\nexplored here (see also Horn 1989, Ladusaw 1996, Pullum 2002), the\ninvestigation of the form and meaning of negative expressions in\nEnglish and other languages and of the interaction of negation with\nother operators (including multiple iterations of negation itself) is\noften far from simple, extending to scope ambiguities (Everybody\ndidn’t leave), negative incorporation into quantifiers and\nadverbs (nobody, never, few), neg-raising (I don’t\nwant to go = “I want not to go”), and the widespread\noccurrence of negative polarity items (any, ever, lift a\nfinger) whose distribution is subject to principles of syntax,\nsemantics, and pragmatics. At the core of the mental faculty of\nlanguage, negation interacts in significant ways with principles of\nmorphology, syntax, logical form, and compositional semantics, as well\nas with processes of language acquisition and sentence processing,\nwhence the prominent role played by work on negation in the\ndevelopment of logic, semantics, linguistic theory, cognition, and\npsychoanalytic and literary theory.\n\nWhat sort of operation is negation? In the Categories and\nDe Interpretatione, Aristotle partitions indicative-mood\ndeclarative sentences into affirmation and negation/denial\n(apophasis from apophanein “deny, say\nno”), which respectively affirm or deny something about\nsomething (De Int. 17a25). As a mode of predication, the\npredicate denial of Aristotelian term logic, while resulting in\nwide-scope negation opposed in truth value to the corresponding\naffirmative, is syntactically distinct from the unary “it is not\nthe case that” connective of Stoic and Fregean logic.\n\nBy combining subject and predicate to form a proposition, this\napproach can be seen as offering a more natural representation of\nordinary language negation than the standard iterating operator that\napplies to fully formed propositions (Geach 1972; Englebretsen 1981;\nHorn 1989, Chap. 7; Sommers and Englebretsen 2000). Indeed, the\nsyncategorematic negation of Montague Grammar (Montague 1973; cf. the\nentry on\n Montague semantics)\n is itself a means of connecting a term phrase subject with a\npredicate or IV (intransitive verb) phrase and thus fails to apply to\nits own output (see Horn 1989, §7.2 on “Aristotle as a\nMontague grammarian”). Cross-linguistically, the structural\nreflex of sentence-scope negation may be a free-standing adverb\n(German nicht, English not), a bound inflectional\nform (Japanese -na-, English -n’t), or a verb\n(Finnish en,\n ei).[2]\n\nWhere we do not find negation is in the one place propositional logic\nwould lead us to look, sentence- or clause-peripheral position, as an\nexternal one-place connective interpreted as “it is not the case\nthat”. (Horn 1989 takes apparent instances of external negation\nin English and elsewhere to represent the metalinguistic use of\nnegation, discussed in §1.10 below, while Bar-Asher Siegal 2015\npresents evidence for the existence of a semantic external negation\noperator in Jewish Babylonian Aramaic.) Furthermore, unlike speech act\ntypes—e.g. interrogatives or exclamatives—negation never\nseems to be marked in natural language by a global intonation contour.\nTypically, sentence negation is associated directly on or near the\nmain finite verb or predicate expression.\n1.2 Negation in natural language: markedness and asymmetry\n\nIt has often been observed that the logical symmetry of negative and\naffirmative propositions in logic belies a fundamental asymmetry in\nnatural language. It was Plato who first observed, in The\nSophist, that negative sentences are less valuable than\naffirmative ones, less specific and less informative. The ontological,\nepistemological, psychological, and grammatical priority of\naffirmatives over negatives is supported by Aristotle:\n\n\nThe affirmative proposition is prior to and better known than the\nnegative (since affirmation explains denial just as being is prior to\nnot-being) (Metaphysics 996b14–16)\n\n\nand St. Thomas Aquinas:\n\n\nThe affirmative enunciation is prior to the negative for three\nreasons… With respect to vocal sound, affirmative enunciation\nis prior to negative because it is simpler, for the negative\nenunciation adds a negative particle to the affirmative. With respect\nto thought, the affirmative enunciation, which signifies composition\nby the intellect, is prior to the negative, which signifies\ndivision… With respect to the thing, the affirmative\nenunciation, which signifies to be, is prior to the negative,\nwhich signifies not to be, as the having of something is\nnaturally prior to the privation of it. (St. Thomas, Book I, Lesson\nXIII, cited in Oesterle 1962, 64)\n\n\nNot only are negative statements (e.g., “Paris isn’t the\ncapital of Spain”) generally less informative than affirmatives\n(“Paris is the capital of France”), they are\nmorphosyntactically more marked (all languages have negative markers\nwhile few have affirmative\n markers)[3]\n and psychologically more complex and harder to process (see Just and\nCarpenter 1971, 248–9; and other work reviewed in Horn 1989,\nChapter 3). Many philosophers, linguists, and psychologists have\nsituated this asymmetry in logic or semantics, as in the claim that\nevery negation presupposes a corresponding affirmative but not vice\nversa.\n\nThe strong asymmetricalist position leads to the “paradox of\nnegative judgment”: if a positive statement refers or\ncorresponds to a positive fact, to what state of affairs does a\nnegative statement refer or correspond? What in fact is a negative\nfact? For Bergson (1911, 289), negation is necessarily “of a\npedagogical and social nature”; for Wood (1933, 421) it is\n“infected with error and ignorance”. According to\nWittgenstein (1953, §447), “the feeling is as if the\nnegation of a proposition had to make it true in a certain sense in\norder to negate it”. Givón (1978, 70) points to the\ndiscourse presuppositionality of utterances like “My wife is not\npregnant”. Psycholinguistic studies have shown that negation is\neasier to process when the denied proposition, if not already in the\ndiscourse model, is at least a plausible addition to it (e.g.,\n“The whale is not a fish/?bird”; cf. Wason 1965; Horn\n1989, Chapter 3).\n\nBeyond its marked status, negation has also been analyzed variously as\na modality, a propositional attitude, and a speech act. The danger\nhere is putting the pragmatic cart before the semantic horse. For\nexample, not every negation is a speaker denial (in making this point,\nFrege points to the non-denial nature of embedded negation as in\n“If not-\\(p\\) then \\(q\\)”), nor is every speaker denial a\nlinguistic negation. Given the repeated attempts over the centuries to\nliquidate or tame it—negation as positive difference, as\ndissimilarity or incompatibility, as falsity, as an admission of\nepistemic impoverishment, as the speech act of denial—and its\nresilience in surviving these attacks, negation qualifies as the\nRasputin of the propositional calculus.\n\nBut the prototypical use of negation is indeed as a denial of a\nproposition attributable to, or at least considered by, someone\nrelevant to the discourse context. While affirmation standardly\nintroduces a proposition into the discourse model, negation—in\nits “chief use” (Jespersen 1917, 4), its “most\ncommon use” (Ayer 1952, 39), its “standard and primary\nuse” (Strawson 1952, 7)—is directed at a proposition that\nis already in or that can be accommodated by the discourse model.\n1.3 Matters of scope\n\nIf we think of negation as essentially a means for\nopposition—the impossibility of simultaneously endorsing two\nincompatible options (see the entries on\n contradiction\n and the\n traditional square of opposition)—propositional\n negation is not necessarily privileged. This view is formally\nimplemented in the Boolean algebraic model of Keenan and Faltz, on\nwhich negation is a cross-categorial operation, as are the binary\nconnectives:\n\n\nWe can directly interpret conjunctions, disjunctions, and negations in\nmost categories by taking them to be the appropriate meet, join, and\ncomplement functions of the interpretations of the expressions\nconjoined, disjoined, or negated. The sense in which we have only one\nand, or, and not is explicated on the\ngrounds that they are always interpreted as the meet, join, and\ncomplement functions in whatever set we are looking at. (Keenan and\nFaltz 1985, 6)\n\n\nTreatments of English and other languages frequently posit negative\noperators whose scope is narrower than the sentence or clause. This\ntradition dates back to Aristotle, for whom the predicate term\nnegation in Socrates is not-wise, affirming that the\npredicate not-wise holds of Socrates, yields a false\nstatement if Socrates does not exist, while the predicate denial\nSocrates isn’t wise denies that the predicate\nwise holds of Socrates and is true if Socrates does not\nexist. For Jespersen (1917), the subclausal “special”\nnegation as in Nobody came, where “the negative\nnotion…belong[s] logically to one definite idea”, is\nopposed to “nexal” negation, applying to “the\ncombination of two ideas”, typically the subject-predicate\nnexus. Later linguists usually follow Klima (1964) and Jackendoff\n(1969) in allowing for constituent negation (e.g., verb phrase\nnegation in You can [not go]) alongside sentential negation\n(You cannot go), utilizing various grammatical and semantic\ndiagnostics for distinguishing the two varieties.\n\nA syntactic correlate of the distinction between wide- (sentential)\nversus narrow-scope (constituent) negation in English is that only\nwhen the negative element has clausal scope, as in the (a) examples in\n(1)-(3) (or in this very sentence), can it trigger negative inversion\n(Klima 1964). In the corresponding (b) examples, the scope of negation\ndoes not extend beyond the fronted phrase, whence the exclusion of\never, a satellite of negation (negative polarity\n item).[4]\n\n(1)\n\n\na.\nWith no job will I be happy. [= I won’t be\nhappy with any job]\nb.\nWith no job I will be happy. [= I will be happy without any\njob]\n \n(2)\n\n\na.\nIn no clothes does Robin look good.\nb.\nIn no clothes Robin looks good.\n \n(3)\n\n\na.\nAt no time were we (ever) alone together in the\nOval Office.\nb.\nIn no time we were (*ever) alone together in the Oval Office.\n \n\n\nNegation also interacts in complicated and often surprising ways with\nquantification and modality. Perhaps the most analyzed interaction is\nwith universal quantification. Despite the frequent condemnation of\nthe wide-scope reading of negation over universals as in the locus\nclassicus, All that glitters is not gold and similar\nexamples in French, German, and other languages, or in ambiguous\nsentences like All the boys didn’t leave, the\navailability of such readings (depending on the speaker, the\nintonation contour, and the context of utterance) is not as illogical\nas it may appear (Horn 1989, §3.4; Tottie and Neukom-Hermann\n2010).\n1.4 Contrariety and contradiction\n\nThe concept of negation is often semantically restricted to\ncontradictory opposition between propositions, in which \\(\\neg A\\) can\nbe paraphrased (if not necessarily syntactically represented) as\n“it is not the case that \\(A\\)”. As introduced in\nAristotle’s Categories (11b17), the genus of opposition\n(apophasis) is divided into species that include contrariety\nand contradiction. Contradictory opposites, whether affirmative and\nnegative counterparts of a singular predication (Socrates is\nwise/Socrates isn’t wise) or quantified\nexpressions (All pleasure is good/Some pleasure is not\ngood), are mutually exhaustive as well as mutually exclusive,\nwhile contrary opposites (Socrates is wise/Socrates is\nunwise; All pleasure is good/No pleasure is\ngood) do not mutually exhaust their domain. Contraries cannot be\nsimultaneously true, though they may be simultaneously false. Members\nof a contradictory pair cannot be true or false\nsimultaneously; contradictories “divide the true and the false\nbetween them” (see the entries on\n contradiction\n and the\n traditional square of opposition).\n\nContrary terms (enantia) come in two varieties (Cat.\n11b38ff.). In immediate or logical contraries\n(odd/even, sick/well), a true\nmiddle—an entity satisfying the range of the two opposed terms\nbut falling under neither of them—is excluded, e.g., an integer\nneither odd nor even. But mediate contrary pairs\n(black/white, good/bad) allow for\na middle—a shade between black and white, a man or an act\nneither good nor bad. Neither mediate nor immediate contraries fall\nunder the purview of the Law of Excluded Middle [LEM] (tertium non\ndatur).\n\nFor immediate contraries formed by narrow-scope predicate term\nnegation, the rendering \\(a\\) is not-\\(F\\) in the traditional\nquasi-English phrasing corresponds to what Aristotle expresses through\nword order, utilizing the distinction between e.g., einai mê\nleukon “to be not-white” and mê einai\nleukon “not to be white” (Prior Analytics I\n51b10). For Aristotle, \\(a\\) is neither \\(F\\) nor not-\\(F\\)\ncan be true if \\(a\\) doesn’t exist (Santa is neither white\nnor not-white) or isn’t the kind of thing that can be\nF (The number 7 is neither white nor not-white),\ngiven that not-\\(F\\) is taken to affirm the negative property\nnon-\\(F\\)-ness of the subject rather than denying a positive\nproperty.\n\nOther cases in which apparent contradictories can be seen as\ncontraries, and thus immune from any application of LEM, are future\ncontingents (There will be/will not be a sea battle\ntomorrow; cf. De Int. Chapter 9) and, in more recent\nwork (Alxatib and Pelletier 2011, Ripley 2011a), vague predications.\nThus a is neither F nor not-F is often judged true when\nF is a vague predicate (bald, rich, tall), although\nin the latter case speakers may also be willing to affirm that\na is both F and not-F, which complicates\nmatters (see the entries on\n contradiction,\n future contingents, and\n vagueness).\n1.5 Negation, presupposition, and singular terms\n\nIn his exposition of sense and reference, Frege (1892) argues that\nboth (4a) and its contradictory (4b) presuppose that the name\nKepler has a denotation. Every affirmative or negative\nsentence with a singular subject (name or description) presupposes the\nexistence of a unique referent for that subject; if the presupposition\nfails, no assertion is made in (4a,b).\n\n(4)\n\n\na.\nKepler died in misery.\nb.\nKepler did not die in misery.\n \n\n\nBut this presupposition is not part of the content of the expression,\nand hence (4a) does not entail existence, or the negation of (4a)\nwould not be (4b) but Kepler did not die in misery or the name\n“Kepler” has no reference, an outcome Frege seems to\nhave taken as an absurdity but one that prefigures the later emergence\nof a presupposition-cancelling external or exclusion negation.\n\nUnwilling to countenance the truth-value gaps incurred on\nFrege’s analysis, Russell (1905, 485) reconsiders the status of\ncontradictory negation with vacuous subjects:\n\n\nBy the law of the excluded middle, either “A is\nB” or “A is not B” must\nbe true. Hence either “the present king of France is bald”\nor “the present king of France is not bald” must be true.\nYet if we enumerated the things that are bald and the things that are\nnot bald, we should not find the king of France on either list.\nHegelians, who love a synthesis, will probably conclude that he wears\na wig.\n\n\nTo resolve this (apparent) paradox while preserving a classical\nanalysis in which every meaningful sentence is true or false, Russell\nbanishes singular terms like the king of France from logical\nform, unpacking (5) and (6) as existentially quantified sentences\ndespite their superficial subject-predicate syntax.\n\n(5)\nThe king of France is bald.\n(6)\nThe king of France is not bald.\n\n\nOn Russell’s theory of descriptions, (5) can be represented as\n(5′), the (false) proposition that there is a unique entity with\nthe property of being king of France and that this entity is bald,\nwhile (6) is ambiguous, depending on the scope of negation.\n\n(5′)\n\\(\\exists x(Kx \\wedge \\forall y(Ky \\rightarrow y=x) \\wedge\nBx))\\)\n(6′)\n\\(\\exists x(Kx \\wedge \\forall y(Ky \\rightarrow y=x) \\wedge \\neg\nBx))\\)\n(6″)\n\\(\\neg \\exists x(Kx \\wedge \\forall y(Ky \\rightarrow y=x) \\wedge\nBx))\\)\n\n\n(6′), with narrow-scope (“internal”) negation, is\nthe proposition that there is a unique and hirsute king of France,\nwhich is “simply false” in the absence (or oversupply) of\nmale French monarchs. In (6″), on the other hand, the\ndescription the king of France falls within the scope of\nexternal negation and yields a true proposition. Unlike (6′),\n(6″) fails to entail that there is a king of France; indeed, the\nnon-existence of a king of France guarantees the truth of (6″).\nThis reading is more naturally expressed with the fall-rise contour\nand continuation characteristic of metalinguistic negation (Horn 1989)\nas in (7):\n\n(7)\nThe king of France isn’t \\(^{{\\rm v}}\\)BALD—there\nISN’T any king of France!\n\n\nFor Strawson (1950, 1952), negation normally or invariably leaves the\nsubject “unimpaired”. Strawson tacitly lines up with Frege\nand against Russell (and Aristotle) in regarding negative statements\nlike (4b) and (6) as unambiguous and necessarily presuppositional.\nSomeone who utters (6) does not thereby assert (nor does her statement\nentail) that there is a king of France. Rather, (6)—along with\nits affirmative counterpart (5)—presupposes it. If this\npresupposition fails, a statement may be made but the question of its\ntruth value fails to arise.\n\nWhile many analysts (e.g., Wilson 1975, Atlas 1977, Gazdar 1979, Grice\n1989) have since followed Russell by preserving a bivalent semantics\nand invoking pragmatic explanations of apparent presuppositional\neffects, other linguists and philosophers (e.g., Fodor 1979,\nBurton-Roberts 1989, von Fintel 2004) have defended and formalized\ntheories of semantic presupposition in the Frege-Strawson spirit,\nallowing for the emergence of truth-value gaps or non-classical truth\nvalues when presuppositions are not satisfied.\n\nNon-bivalent logics of semantic presupposition, dating back to\nŁukasiewicz (1930) and Kleene (1952), generally posit (at least)\ntwo not-operators, the distinction arising lexically rather\nthan (as for Russell) scopally; see the entry on\n many-valued logic\n and\n Section 2\n below. The ordinary, presupposition-preserving internal or choice\nnegation is the only one countenanced by Frege and Strawson; on this\nreading, Santa is not white, like Santa is white, is\nneither true nor false, given that Santa does not exist. The\npresupposition-cancelling or exclusion negation always determines a\nclassical value. With exclusion negation, Santa is not white\n(or perhaps more plausibly It is not the case that Santa is\nwhite) is true even if there is no Santa. Thus there is no\nexcluded middle; any affirmation and its corresponding exclusion\nnegation are contradictories rather than contraries (see the entry on\n presupposition\n for elaboration and further details).\n1.6 From contradiction to contrariety: pragmatic strengthening of negation\n\nIn his dictum, “The essence of formal negation is to invest the\ncontrary with the character of the contradictory”, Bosanquet\n(1888) encapsulates the widespread tendency for formal contradictory\n(wide-scope) negation to be semantically or pragmatically strengthened\nto a contrary.\n\nWe use \\(\\copy A\\) to represent any contrary of \\(A\\). Following the\nAristotelian theory of opposition, the two contradictories \\(A\\) and\n\\(\\neg A\\) cannot both be false, just as they cannot both be true,\nwhile a given proposition and a contrary of that proposition, \\(A\\)\nand \\(\\copy A\\), can both be false, although they cannot both be true.\n(Others have used \\(\\kappa\\) or R for one-place non-truth-functional\ncontrariety connectives; cf. McCall 1967, Humberstone 2005; see also\nBogen 1991 for the distinction between linguistic and metaphysical\ncontraries.) It should be noted that while \\(\\neg\\) is an operator\nthat takes one proposition into another, © is not, since a given\nproposition may have logically distinct contraries, while this is not\nthe case for contradictories. Geach (1972, 71–73) makes this\npoint with the example in (8). While (8a) has two syntactically\ndistinct contradictories, e.g., Not every cat detests every\ndog and It’s not every dog that every cat detests,\nany such co-contradictories of a given proposition will always have\nthe same truth conditions. But (8a) allows two contraries with\ndistinct truth conditions, (8b) and (8c).\n\n(8)\n\n\na.\nEvery cat detests every dog.\nb.\nNo cat detests every dog.\nc.\nThere is no dog that every cat detests.\n \n\n\nSimilarly, (9a) allows three non-identical contraries:\n\n(9)\n\n\na.\nI believe that you’re telling the truth.\nb.\nI believe that you’re not telling the truth.\nc.\nI don’t believe that you’re telling the truth or that\nyou’re not; I haven’t made up my mind yet.\nd.\nI don’t believe that you’re telling the truth or that\nyou’re not: I haven’t given the matter any thought.\n \n\n\nThus while we can speak of the contradictory of a proposition, Geach\nobserves, we cannot (pace McCall 1967) speak of the\ncontrary, but only of a contrary, of a proposition. As\nHumberstone (1986, fn. 6) points out in response to Geach’s\ncritique of McCall, however, the lack of uniqueness “does not\nprevent one from exploring the logical properties of an arbitrarily\nselected contrary for a given statement”. For our purposes, the\ncrucial logical properties of contrariety are that (i) the\ncontradictory of a proposition \\(A\\) is not a contrary of \\(A\\) and\nthat (ii) contrariety unilaterally entails contradiction:\n\n(10)\n\n\na.\n\\(\\copy A \\vdash \\neg A\\)\nb.\n\\(\\neg A \\not \\vdash\\copy A\\)\n \n\n\nFor McCall (1967), contrariety is a quasi-modal notion akin to logical\nimpossibility, \\(\\Box \\neg\\), in that \\(\\Box \\neg A\\) entails \\(\\neg\nA\\) but not vice versa, but as pointed out by an anonymous\nreviewer, there is no intrinsic modal component of contrariety; all\nthat is necessary is that contrariety is a non-truth-functional\none-place connective. (See Humberstone 1986, 2003, 2005; Bogen 1991;\nand Vakarelov 1989a for additional considerations.)\n\nThe strengthening of contradictory negation, \\(\\neg A\\), to a\ncontrary, \\(\\copy A\\), typically instantiates the inference schema of\ndisjunctive syllogism or modus tollendo ponens in (11):\n\n(11)\n\\(\\begin{array}{l}A \\vee B \\\\ \\neg A \\\\ \\hline B\\end{array}\\)\n\n\nWhile the key disjunctive premise is typically suppressed, the role of\ndisjunctive syllogism can be detected in a variety of strengthening\nshifts in natural language where the disjunction in question is\npragmatically presupposed in relevant contexts. Among the\nillustrations of this pattern are the following:\n\n\n\nThe tendency for negation outside the scope of (certain) negated\npropositional attitude predicates (e.g., a does not believe that\n\\(p\\)) to be interpreted as associated with the embedded clause\n(e.g., a believes that not-\\(p\\)); this is so-called\n“neg-raising”, to which we return below. \n\n\nThe tendency for a semantically contradictory negation of an unmarked\npositive value, whether affixal (\\(x\\) is\nunfair/unhappy) or clausal (I don’t like\nhim), to be strengthened (as either an “online” or\nconventionalized process) to a contrary of the positive predication.\nAs contraries, Chris is happy and Chris is unhappy\nallow an unexcluded middle, since Chris can be neither happy nor\nstrictly unhappy; similarly, I don’t like him is\ngenerally understood as stronger than a mere assertion that it’s\nnot the case that I like him. \n\n\nThe strengthening of a negated plural definite (The kids\naren’t sleeping) or bare plural (Beavers don’t\neat cheese) from a contradictory to a contrary of the\ncorresponding affirmative. In each case, the negation is understood as\ninside the scope of the quantified subject. \n\n\nAs stressed by Bartsch 1973 (cf. Horn 1978; Horn 1989, Chapter 5),\nwhen there are only two alternatives in a given context, as in the\ncase of neg-raising, the denial of one (I don’t believe it\nwill rain) amounts to the assertion of the other (I believe\nit won’t rain). The relevant reasoning is an instance of\nthe disjunctive syllogism pattern in (11), as seen in (12), where\n\\(F\\) represents a propositional attitude and \\(a\\) the subject of\nthat attitude.\n\n(12)\n\\(\\begin{array}{ll} F (a, p)\\vee F (a,\\neg p)\\, & {\\scriptsize\n\\mbox{[the pragmatically assumed disjunction]}}\\\\ \\underline{\\neg F\n(a, p)} & {\\scriptsize \\mbox{[the sentence explicitly uttered]}}\\\\\nF (a, \\neg p) & {\\scriptsize \\mbox{[the stronger negative\nproposition conveyed]}} \\end{array} \\)\n\n\nThe key step is the pragmatically licensed disjunction of contraries:\nif you assume I’ve made up my mind about the truth value of a\ngiven proposition \\(p\\) (e.g., “it will rain”) rather than\nbeing ignorant or undecided about it, then you will infer that I\nbelieve either \\(p\\) or \\(\\neg p\\), and my denial that I believe the\nformer (“I don’t think it will rain”) will lead you\nto conclude that I believe the latter (“I think it won’t\nrain”). (See Horn 1989, Chapter 5 for more on this phenomenon;\nGajewski 2007 for a neo-Bartschian analysis; and Collins and Postal\n2014 for a vigorous defense of a grammatical approach to\nneg-raising).\n\nThe availability of strengthened contrary readings for apparent\ncontradictory negation has long been recognized, dating back to\nclassical rhetoricians of the 4th century on the figure of\nlitotes, in which an affirmative is indirectly asserted by negating\nits contrary (Hoffmann 1987). Litotic interpretations tend to be\nasymmetrical: an attribution of “not happy” or “not\noptimistic” will tend to convey a contrary (in this case\n“rather unhappy” or “fairly pessimistic”),\nwhile no analogous virtual contrariety is normally signaled by\n“not sad” or “not pessimistic”, which are\nusually understood as pure contradictories. This asymmetry is\nultimately a social fact arising from the desire to respect negative\nface (Ducrot 1973, Brown and Levinson 1987, Horn 1989).\n\nFor Jespersen, the tendency reflected by the neg-raised interpretation\nof I don’t think that \\(p\\) not only illustrates the\ngeneral strengthening to contrariety but also participates in a more\ngeneral conspiracy in natural language to signal negation as early as\npossible. Additional effects of this “neg-first” principle\n(Horn 1989, 293; after Jespersen 1917, 5) range from diachronic shifts\nin the expression of sentential negation (see van der Auwera 2010) and\nthe fronting and negative inversion in (1a) or (2a) to the emergence\nof ambiguities arising in contexts like [neg \\(S_1\\) because \\(S_2\\)]\n(Jespersen 1917, 48), as in “She didn’t marry him because\nhe’s poor”, where the “illogical” scope\nreading—on which his poverty was the non-cause of the wedding\nrather than the cause of the non-wedding—can be rendered more or\nless accessible by the intonation contour.\n\nThe “neg-raised” reading of I don’t think that\n\\(p\\) as “I think that not-\\(p\\)” has often been\ndeplored by grammarians or philosophers as an illogical placement of\nnegation, an unfortunate ambiguity, or (in Quine’s terms) an\n“idiosyncratic complication” of one language:\n\n\nthe familiar quirk of English whereby “\\(x\\) does not believe\nthat \\(p\\)” is equated to “\\(x\\) believes that not\n\\(p\\)” rather than to “it is not the case that \\(x\\)\nbelieves that \\(p\\)”. (Quine 1960, 145–6; similar claims\nare made by other philosophers)\n\n\nBut this “quirk” has deep roots, dating back to St.\nAnselm’s 12th century Lambeth fragments (Henry 1967,\n193–94; Hopkins 1972, 231–32; Horn 1989, §5.2).\nAnselm points out that “non…omnis qui facit quod non\ndebet peccat, si proprie consideretur”—not everyone\nwho does what he non debet (“not-should”) sins,\nif the matter is considered strictly (with the contradictory reading\nof negation as the syntax suggests). The problem is that non\ndebere peccare is standardly used to convey the contrary meaning\ndebere non peccare rather than the literal contradictory\n(“it is not a duty to sin”). It is hard to stipulate e.g.,\nnon debet ducere uxorem (= “a man is free not to\nmarry”) without seeming to commit oneself to the stronger\ndebet non ducere uxorem, an injunction to celibacy (Henry\n1967, 193ff.; Horn 1978, 200).\n\nFor Henry (1967, 193, §6.412), Anselm’s observations on\nmodal/negative interaction are “complicated by the quirks of\nLatin usage”. But far from a Quinean quirk of English and/or\nLatin usage, “neg-raising”—the lower-clause\nunderstanding of negation of a believe- or\nought-type predicate—is distributed widely and\nsystematically across languages and operators.\n\nThe raised understanding is always stronger than the contradictory\n(outer) negation; it applies to a proper subset of the situations to\nwhich the contradictory applies (is true in a proper subset of\npossible worlds). Thus neg-raising, as Anselm recognized, yields a\nvirtual contrariety: the compositional meaning is true but too weak,\nand the addressee recovers a conversational implicature to “fill\nin” the stronger proposition.\n\nIn some cases, the strengthened or neg-raised contrary reading may\nbecome salient enough over time to block the literal interpretation,\nas when French Il ne faut pas partir—literally =\n“one needn’t leave” (an O vertex\nmodal)—is now generally used only to express the stronger\nproposition that one must not-leave (E vertex). This\nis a modal instance of the general phenomenon of O\n\\(>\\) E drift (Horn 1989), an upward shift along\nthe right (negative) vertical of the modal square of opposition. Such\nsquares were constructed by Cajetan, based on Aristotle’s De\nInterpretatione 21b10ff. and Prior Analytics\n32a18–28 (see Oesterle 1962), and by other medieval\ncommentators.\n\n\n\nFigure 1\n\n\n\\(\\mathbf{O}>\\mathbf{E}\\) drift is attested cross-linguistically in\nthe meaning shift of lexical items like Old English nealles\n(lit. “NEG all”) = “not at all”, Dutch\nnimmer (lit., “NEG always”) =\n“never”, or Russian nel’zja (lit.\n“NEG must”) = “mustn’t”, and in words\nlike unlikely, inadvisable, or disbelieve, whose\nprefixal negations yield only contrary, not contradictory,\ninterpretations. The reverse shift, in which apparent\nE forms develop O meanings, appears\nto be unattested (cf. Horn 2012, 2015).\n\nIn litotes and neg-raising, the interpretation of formal\ncontradictories as contraries arises from the accessibility of the\nrelevant disjunction, triggering the disjunctive syllogism. The\nhomogeneity or all-or-none presupposition (Fodor 1970) applying to\nbare plurals, plural definites, and mass predications results in a\ncomparable effect; it is natural to strengthen negative statements\nlike Mammals don’t lay eggs, The children\naren’t sleeping, or I don’t eat meat to\naffirmations of contraries rather than understanding them as simple\nwide-scope negations of the corresponding positives (Mammals lay\neggs, The children are sleeping, I eat meat) as\nwould be the case with overtly quantified universals. The relevant\nprinciple has been variously formulated:\n\n\nWhen a kind is denied to have a generic property P\\(_k\\), then any of\nits individuals cannot have the corresponding individual-level\nproperty P\\(_i\\). (von Fintel 1997, 31)\n\nIf the predicate P is false for the NP, its negation not-P is true for\nthe NP… Whenever a predicate is applied to one of its\narguments, it is true or false of the argument as a whole.\n(Löbner 2000, 239)\n\n\nOnce again the key step is establishing the relevant disjunction as a\npragmatically inferred instance of the Law of Excluded Middle, e.g.,\n“Either mammals lay eggs or mammals don’t lay eggs”.\nIn fact, this practice was first identified by Aristotle (Soph.\nElen. 175b40–176a17), who offered an early version of the\nall-or-none (or both-or-neither) in arguing that a negative answer to\na “dialectical” or conjoined question like “Are\nCoriscus and Callias at home?” would imply that neither is at\nhome, given the default supposition that they are either both in or\nboth out. Once again LEM applies where it\n“shouldn’t”; \\(A \\vee © A\\) behaves as though it\nwere an instance of \\(A \\vee \\neg A\\), triggering the disjunctive\nsyllogism:\n\n(13)\n\\(\\begin{array}{l} (Fa \\wedge Fb) \\vee (\\neg Fa \\wedge \\neg Fb)\\\\\n\\underline{\\neg (Fa \\wedge Fb)}\\\\ (\\neg Fa \\wedge \\neg Fb)\n\\end{array}\\)\n\n\nOther instances of the maximization of contrariety in natural\nlanguage, in a range of contexts from formal pragmatics to word\nlearning, are discussed in Horn 2015.\n1.7 Privation, affixal negation, and the markedness asymmetry\n\nFor Aristotle, privation is an instance of opposition defined in terms\nof the absence or presence of a default property for a given\nsubject:\n\n\nWe say that that which is capable of some particular faculty or\npossession has suffered privation [sterêsis] when the\nfaculty or possession in question is in no way present in that in\nwhich, and at the time in which, it should be naturally present. We do\nnot call that toothless which has not teeth, or that blind which has\nnot sight, but rather that which has not teeth or sight at the time\nwhen by nature it should. (Categories 12a28–33)\n\n\nA newborn kitten, while lacking sight, is thus no more\n“blind” than is a chair, nor is a baby\n“toothless”.\n\nPrivation as the absence of what would be expected by nature to be\npresent is revisited in the Metaphysics\n(1022b23–1023a8), where Aristotle—noting that privation\ncan range over predictable absence, accidental removal, or deliberate\n“taking away by force” of the relevant\nproperty—distinguishes privation “with respect to\ngenus”, as in the blindness of moles, from privation “with\nrespect to self”, as in the blindness or toothlessness of an old\nman. In the end, Aristotle concedes, there may be as many senses of\nprivation as there are a- prefixed terms in Greek\n(Met. 1022b33). Indeed, privation may be reanalyzed as the\nprimary contrariety (1055a34).\n\nIn a wide range of languages, affixal negation on simplex bases\nreflects Aristotelian privation, whence the asymmetry between possible\nforms (unhappy, untrue, unkind) and impossible or unlikely\nones (unsad, unfalse, uncruel). We can describe a failed\ncomedy, but not a successful tragedy, as unfunny. As\nJespersen (1917, 144) observes, the tendency of semi-productive\nnegative affixation to be restricted to unmarked or positive bases\ncombines with that of the preference for contrariety reviewed\nabove:\n\n\nThe modification in sense brought about by the addition of the prefix\nis generally that of a simple negation: unworthy = “not\nworthy”, etc… The two terms [X,\nunX] are thus contradictory terms. But very\noften the prefix produces a “contrary” term or at any rate\nwhat approaches one: unjust generally implies the opposite of\njust; unwise means more than not wise and approaches foolish,\nunhappy is not far from miserable, etc.\n\n\nThe counter-expectation property of affixal negation extends even to\ncontradictory, middle-excluding adjectives like\nalive/dead; nothing can be both and nothing capable\nof being either can be “in between”. But undead\nhas been around since Bram Stoker’s Dracula (1897) as\nboth an adjective and a zero-derived occupational noun to describe\nzombies, vampires, and other creatures that are “not quite dead\nbut not fully alive, dead-and-alive” (OED). Someone or something\nis undead—e.g., a vampire—if it fails to conform to\none’s expectation that it should be dead. But\nif something appears to be alive but does not quite fulfill that\nexpectation, it is not undead but unalive, e.g.,\nartificial flowers. Both the undead (but not quite alive) vampire and\nthe unalive (but not dead) artificial flowers conform to\nAristotle’s notion of a privative opposite in lacking a property\nassociated by default rules with the respective subject.\n\nThe marked status of negative utterances has also been invoked to\nmotivate an asymmetry in the geometry of lexicalization. Within the\nSquare of Opposition, the Aristotelian relations of contradiction,\ncontrariety, and subalternation are supplemented with an additional\nrelation of subcontrariety, so called because the subcontraries are\nlocated under the contraries. As the contradictories of the two\ncontraries, the subcontraries (e.g., Some pleasure is good,\nSome pleasure is not good) can both be true, but cannot both\nbe false. For Aristotle, this was therefore not a true opposition,\nsince subcontraries are “merely verbally opposed”\n(Prior Analytics 63b21–30). In pragmatic terms, the\nassertion of one subcontrary (Some men are bald) is not only\ncompatible with, but actually conversationally implicates, the other\n(Some men are not bald), given Grice’s Maxim of\nQuantity (“Make your contribution as informative as is\nrequired”; see the entries on\n Paul Grice,\n pragmatics, and\n implicature).\n The fact that the two members of a subcontrary pair tend to be\nequipollent or mutually derivable in a given context may explain the\nfact that only one of the two subcontraries will lexicalize in natural\nlanguage, and the markedness of negation explains why this is always\nthe positive (I vertex, e.g., some) rather\nthan the negative (O vertex, e.g., no) value\n(Horn 1989, 2012). Thus the E values none,\nnor, and never are possible but the corresponding\nO values *nall (“not all”),\n*nand (“or not”), and *nalways\n(“not always”) are never attested. Similar, if less\nabsolute, asymmetries obtain among non-quantificational and indeed\nnon-logical values (van der Auwera 1996, Horn 2012). Various competing\nexplanations to the pragmatic account of Horn (1989, 2012) have been\nproposed for motivating these asymmetries; see, inter alia, Jaspers\n2005, Seuren and Jaspers 2014, and references therein.\n1.8 Double negation\n1.8.1 “Logical” double negation\n\nWhen duplex negatio affirmat, what exactly\ndoes the double negation affirm? When a negative term\nis a contrary rather than a contradictory of the corresponding simple\naffirmative, to deny its application—Socrates isn’t a\nnot-white log—does not result in the mutual annihilation of\nlogical double negation, any more than does the negation of a mediate\ncontrary (She’s not unhappy, It isn’t uncommon).\nWhile Aristotle countenanced multiple negation, to the extent of\ngenerating such unlikely sequences as Not-man is not not-just\n(De Int. 19b36), each proposition contains only one instance\nof negation as wide-scope predicate denial (juxtaposed here with both\na negated subject term and a negated predicate term), since each\ncategorical statement contains only one predicate.\n\nBy contrast, the Stoics defined negation (apophatikon) as an\niterating external operator. For Alexander of Aphrodisias,\n“Not: not: it is day differs from it is day\nonly in manner of speech” (Mates 1953, 126). With their\npropositional connectives and one-place truth/falsity-toggling\nnegation operator, it is the Stoics rather the Aristotelians who\nprefigured modern propositional logic, as well as the precepts of\ntraditional grammar (“Duplex negatio affirmat”)\nand the Law of Double\n Negation.[5]\n\nClassical Fregean logic allows for but one negative operator, the\ncontradictory-forming propositional operator applying to a proposition\nor open sentence, in keeping with “the thesis that all forms of\nnegation are reducible to a suitably placed ‘it is not the case\nthat’” (Prior 2006, 524). Not unexpectedly, Frege (1919,\n130) proclaims the logical superfluity of double negation:\n“Wrapping up a thought in double negation does not alter its\ntruth value”. Within this metaphor, \\(\\neg\\neg A\\) is simply a\nway of garbing the thought or proposition \\(A\\).\n\nBut, as noted in §1.1, even a single sentence-external negation\n(Not: The sun is shining) is a logician’s construct\nrarely attested in the wild (Geach 1972; Katz 1977):\n\n\n[P]ropositional negation was as foreign to ordinary Greek as to\nordinary English, and [Aristotle] never attained to a distinct\nconception of it. The Stoics did reach such a convention, but in doing\nso they violated accepted Greek usage; their use of an initial\noukhi must have read just as oddly as sentences like\n“Not: the sun is shining” do in English. (Geach 1972,\n75)\n\n\nFurther, whether or not we admit the law of double negation in our\nlogic,\n\n\nin ordinary language a doubly negated expression very seldom, if ever,\nhas the same logical powers as the original unnegated statement.\n(Hintikka 1968, 47)\n\n\nIt is thus worth noting that the system of dual negations described by\nAristotle in Prior Analytics I, Chapter 46 is both insightful\nand internally consistent; its echoes are recognizable in\nJespersen’s distinction between nexal negation (not\nhappy) and special negation (unhappy), Von\nWright’s (1959) distinction between weak (contradictory) versus\nstrong (contrary) negation, and Jackendoff’s (1969) semantic\nreanalysis of Klima’s (1964) grammatical categories of\nsentential versus constituent negation. In each case, a negative\nmarker whose scope is narrower than the proposition determines a\nstatement logically distinct from a simple contradictory.\n\nIf we represent the narrow-scope contrariety operator of It is\nnot-white as \\(\\copy A\\), its contradictory, \\(\\neg\\copy\nA\\)(It isn’t not-white), does not return us to the\nsimple positive \\(A\\). The result, if not the means, is similar to\nthat in intuitionistic logic (Heyting 1956). The intuitionistic\nnegation operator does not cancel out, given that the intuitionistic\nLaw of Double Negation is valid in only one direction, \\(A \\rightarrow\n\\neg \\neg A\\), while \\(\\neg \\neg A \\rightarrow A\\) does not apply (see\nthe entry on\n intuitionistic logic).\n The intuitionists posit just one negation operator that sustains\ndouble introduction but not double cancellation, while the\nAristotelian system distinguishes contradictory (sentential) predicate\ndenial from contrary (constituent) predicate term negation.\n\nIn ordinary language, semantic double negation (as opposed to negative\nconcord as in I ain’t never done nothing to nobody, an\nagreement phenomenon in which only one semantic negation is expressed,\naddressed in the next section) tends not to cancel out completely.\nThis is predictably the case when a semantic contrary is negated:\nnot uncommon is weaker than common; one can be not\nunhappy without being happy. But even when an apparently contradictory\nnegation is negated (from the unexceptionable it’s not\nimpossible to the more unusual double-not of Homer\nSimpson’s concessive I’m not not licking toads\n[http://tinyurl.com/34jwhjz]), the duplex negatio of \\(A\\)\ndoesn’t affirm \\(A\\), or at least it provides a rhetorically\nwelcome concealment, as suggested by Frege’s metaphor of\n“wrapping up a thought” in double negation. The negation\nin such cases (impossible, not-licking) is coerced\ninto a virtual contrary whose negation, \\(\\neg\\copy A\\), is weaker\nthan (is unilaterally entailed by) \\(A\\) (see Horn 2017 and the entry\non\n contradiction):\n\n\n\nFigure 2\n\n1.8.2 Negative concord and its relations\n\nIn the previous section it was observed that when duplex negatio\naffirmat, what it affirms is often not simply the doubly negated\nproposition but the result of an incomplete cancellation yielded by\nthe negation of an actual or virtual contrary (not unlikely,\nnot impossible). But a more dramatic problem for the dictum\nis when duplex negatio negat, especially in the form of\nnegative concord, in which a single logical negation on the main verb\nspreads to indefinites and adverbs within the same clause (Labov 1972,\nZeijlstra 2004, Penka\n 2011).[6]\n\nThe grammar of negative concord is often complex and subject to a\nvariety of factors. In standard Italian, for example, negative\nquantifiers following the main verb (whether as objects or postposed\nsubjects) co-occur with mandatory negative marking on the verb to\nyield a single negative meaning, as in (14a). But when a negative\nquantifier precedes the verb, negative concord is ruled out, as in\n (14b).[7]\n\n(14)\n\n\na.\nGianni *(non) ha visto nessuno. “Gianni has seen\nnobody”\n\n*(Non) ha telefonato nessuno. “Nobody has telephoned”\n\n*(Non) ho parlato con nessuno. “I have spoken with\nnobody”\nb.\nNessuno (*non) ha visto Gianni. “Nobody has seen\nGianni”\n\nCon nessuno (*non) ho parlato. “With nobody have I\nspoken”\n \n\n\nNegative concord is a feature of many non-standard varieties of\nEnglish, especially in informal speech—or lyrics (“I\ncan’t get no\n satisfaction”).[8]\n The grammar of negative concord in African American Vernacular\nEnglish has been especially well studied; see Green 2002 for an\ninfluential analysis.\n\nTrue negative concord within a given clause represents just one kind\nof hypernegation, the general phenomenon in which a negative marker\nreinforces rather than cancels the ordinary or canonical marker of\nsentence negation (Horn 2010a). Hypernegation may extend across clause\nboundaries to result in the occurrence of “pleonastic” or\n“expletive” negative elements in the scope of inherently\nnegative predicates (cf. Espinal 1992, Horn 2010a). This is\nexemplified by the negative markers following comparatives,\nbefore clauses, or verbs of fearing in French, Russian,\nYiddish, and other languages. A standard feature of earlier stages of\nEnglish, pleonastic negation persists in colloquial English:\n\n(15)\n\n\na.\nI miss (not) seeing you around.\nb.\nDon’t be surprised if it doesn’t rain. [= if it\nrains]\nc.\nNot with my wife, you don’t.\nd.\nThe proposal will not be approved, I (don’t) think.\n \n\n\nThe well-known problems encountered in processing multiple negations,\nverified in many psycholinguistic studies, are responsible for the\nappearance of other uninterpreted negations as in (16a), and the\nconventionalized irony or sarcasm exemplified in\n (16b,c):[9]\n\n(16)\n\n\na.\nNo head injury is too trivial to ignore.\nb.\nI could care less.\nc.\nThat’ll teach you to ever mess with me again.\n \n\n\nSimilarly, in French the expression Vous n’êtes pas\nsans ignorer que …, literally “You are not without\nbeing ignorant that …”, is notoriously used in the sense\nof “You certainly know that …”. If duplex\nnegatio affirmat, then triplex negatio confundit.\n1.9 Negative polarity\n\nCertain linguistic expressions in English and other languages are\npolarity sensitive, restricted in their distributions to the scope of\nnegation or semantically related contexts, including negative\nquantifiers, implicitly negative predicates or adverbs, the\nantecedents of conditionals, comparative clauses, and the restrictors\nof universals:\n\n(17)\n\n\na.\nI {haven’t/*have} ever eaten\nany kumquats at all.\nb.\n{Few/*Many} of the assignments have been turned in\nyet.\nc.\nThe dean {rarely/*often} lifts a finger to help\nstudents on probation.\nd\nI {doubt/*believe} they’re all that pleased\nwith the proposal.\ne.\n{All/*Many} customers who had ever purchased\nany of the affected items were\n(*ever) contacted.\n \n\n\nNegative polarity items (NPIs) like those highlighted in (17) are\ngenerally restricted to downward entailing or monotone decreasing\ncontexts, those in which inferences from sets to subsets (but not\nvice versa) are valid (see Fauconnier 1975; Ladusaw 1980,\n1996; Peters and Westerståhl 2006; and the\n generalized quantifiers\n entry). If I’ve eaten kumquats, I’ve eaten fruit, but not\nnecessarily vice versa; this is an upward entailing (monotone\nincreasing) environment. On the other hand, if I haven’t eaten\nfruit, I haven’t eaten kumquats, but not necessarily vice\nversa; this is a downward entailing (monotone decreasing)\n environment.[10]\n It is just in the latter case that NPIs are licensed.\n\nAs (17e) shows, universals like all or every license\nNPIs in their restrictor (the relative clause), which is a downward\nentailing context (if everyone who knows logic is a vegetarian,\neveryone who knows classical logic is a vegetarian, but not vice\nversa). But universals do not license NPIs in their nuclear scope\nor predicate expression, which is an upward entailing context (if\neveryone who knows logic is a vegan, everyone who knows logic is a\nvegetarian, but not vice versa). This contrast demonstrates\nthe insufficiency of an account of polarity licensing that simply\nmarks a given lexical item as favorable to the occurrence of NPIs\nwithin its scope (Ladusaw 1980).\n\nWhile downward entailment may be (generally) necessary for the\nlicensing of NPIs (although there are some thorny issues to resolve;\ncf. Giannakidou 2011, Israel 2011), it is not necessarily sufficient,\ndepending on the nature of the context and the NPI in question. For\nexample, some environments that permit weak NPIs like any and\never fail to license stricter ones like in weeks or\nuntil midnight.\n\n(18)\n\n\na.\n{Nobody/Only Chris} has ever proved\nany of those theorems.\nb.\n{Nobody/*Only Chris} has been here in weeks.\n \n\n\nThis has led to the development of more stringent algebraic conditions\nthat some polarity items must meet, e.g., anti-additivity (Zwarts\n1998). The distribution and licensing of polarity items, subject to\nwidespread variation within and across languages, is an important but\nextremely complex linguistic phenomenon with implications for the\narchitecture of grammar and the theory of meaning; see Israel 2011,\nGiannakidou 2011, Chierchia 2013, Horn 2016, and Barker 2018 for\nextensive discussion and alternative theoretical approaches. Van der\nWouden (1996) and Blanchette (2015) provide useful examinations of the\nconnections of negative polarity to negative concord and expletive\nnegation.\n1.10 Metalinguistic negation\n\nIn addition to the overlapping dichotomies we have surveyed between\ngrammatically and semantically defined varieties of negation within a\ngiven language (wide- vs. narrow-scope, sentential vs. constituent,\ncontradictory vs. contrary, choice vs. exclusion), a “pragmatic\nambiguity” has been invoked to distinguish ordinary descriptive\nnegation from a specialized metalinguistic or echoic use (Horn 1989,\nchapter\n 6).[11]\n In examples like (19), a speaker objects to a previous utterance on a\nvariety of grounds, including its phonetic or grammatical form,\nregister, or associated presuppositions or implicatures:\n\n(19)\n\n\na.\nAround here we don’t LIKE coffee—we LOVE it.\nb.\nShe doesn’t sell INsurance—she sells inSURance.\nc.\nIt’s not stewed bunny, honey, it’s civet de\nlapin.\nd.\nI’m not HIS brother—he’s MY brother!\ne.\nMozart’s sonatas were for piano and violin, not for violin\nand piano.\n \n\n\nThe descriptive/metalinguistic distinction is supported by converging\nlinguistic diagnostics suggesting that metalinguistic negation\noperates on a different level, whence its failure to incorporate\nmorphologically or license negative polarity items:\n\n(20)\n\n\na.\nI’m {not happy/*unhappy} with the plan, I’m\necstatic!\nb.\nYou didn’t eat {some/*any} of the cookies, you ate them\nall!\n \n\n\nThe coherence of the notion of “pragmatic ambiguity” and,\nmore generally, the proper treatment of metalinguistic negation (or,\nfollowing Carston 1996, echoic negation) have been matters of\nconsiderable dispute; for a range of competing views, see McCawley\n1991, Geurts 1998, Burton-Roberts 1999, and Carston 1999. Pitts 2011\nprovides an excellent overview of the phenomenon (or phenomena) in\nquestion.\n\nThe linguistic expression of negation, its interaction with the\nphenomena of negative polarity, concord, and scope, and the\nmapping between negative form and negative meaning all present\ncomplex and important problems for syntax, semantics, and\npragmatics. (Recent perspectives on a range of issues involved\nare provided in Atlas 2012, Horn 2018, and work cited\ntherein.)  But perhaps the most striking feature of\nnegation is the mismatch between the formal and distributional\ncomplexity of negative elements in natural languages and the\nsimplex character of the one-place negative operator of\npropositional logic. Yet here too the apparent simplicity is\ndeceiving once we undertake a systematic investigation of the\nlogic of negation. It is to that task that we now turn.\n2. The logic of negation\n\nThe logic of negation may be presented in quite different ways, by\nconsidering various styles of proof systems (axiom systems, sequent\ncalculi, systems of natural deduction, tableaux, etc.) or different\nkinds of semantics (algebraic, model-theoretic, proof-theoretic,\ngame-theoretic, etc.). Moreover, in search of characteristics of\nnegation as a one-place connective, several dimensions of\nclassification are available, depending on the logical vocabulary of\nthe language under consideration (propositional, first-order,\nmulti-modal, etc.) and the inferential framework taken into account\n(single antecedents (i.e., premises) and conclusions, multiple\nantecedents or multiple conclusions, sets, multisets, or sequences of\nformulas in antecedent or succedent position).\n\nIn a very elementary setting one may consider the interplay between\njust a single sentential negation, \\(\\osim\\), and the derivability\nrelation, \\(\\vdash\\), as well as single antecedents and single\nconclusions. The following inferential principles are stated as proper\nrules with one derivability statement (sequent) or two such statements\nas assumption sequent(s) and a single sequent as the conclusion, or as\naxiomatic sequents without any assumption sequent:\n\n(21)\n\\(\\begin{align*} A \\vdash B \\, &/ \\, \\osim B \\vdash \\osim A\n& \\mbox{(contraposition)}\\\\ A &\\vdash \\osim \\osim A &\n\\mbox{(double negation introduction)}\\\\ \\osim \\osim A &\\vdash A\n& \\mbox{(double negation elimination)}\\\\ A \\vdash B, \\; A \\vdash\n\\osim B \\, &/ \\, A \\vdash \\osim C & (\\text{negative} \\textit{\nex contradictione})\\\\ A \\vdash B, \\; A \\vdash \\osim B \\, &/ \\, A\n\\vdash C & (\\text{unrestricted }\\textit{ex contradictione})\\\\ A\n\\vdash \\osim B \\, &/\\, B \\vdash \\osim A & \\mbox{(constructive\ncontraposition)}\\\\ \\osim A \\vdash B \\, &/ \\, \\osim B \\vdash A\n& \\mbox{(classical contraposition) } \\end{align*}\\)\n\n\nThe first rule, contraposition, for instance, says that if \\(B\\) is\nderivable from \\(A\\), then the negation of \\(A\\) is derivable from the\nnegation of \\(B\\). All these rules and derivability statements are\nvalid in classical logic (see the entry on\n classical logic);\n classical logic cannot distinguish between them. Some of these\nprinciples have been criticized and called into question in\nnon-classical logic. The unrestricted and the negative ex\ncontradictione rules, for example, introduce an element of\nirrelevancy because they allow to derive a completely arbitrary\nformula \\(C\\), respectively a completely arbitrary negated formula\n\\(\\osim C\\), from an assumption \\(A\\) if a formula \\(B\\) as well as\nits negation \\(\\osim B\\) are derivable from \\(A\\), see the entries on\n relevance logic\n and\n paraconsistent logic.\n Classical contraposition has been criticized because it gives rise to\nnon-constructive existence proofs in languages containing the\nexistential quantifier, see the entry on\n intuitionistic logic.\n In richer vocabularies, additional negation principles can be\nformulated, regimenting the interaction between negation and other\nlogical operations. Prominent examples are the De Morgan Laws. In\nlanguages without implication, one may consider the following sequents\nstating De Morgan inference rules:\n\n(22)\n\\(\\begin{align} (\\osim A \\vee \\osim B) &\\vdash \\osim (A \\wedge\nB)\\\\ \\osim (A \\vee B) &\\vdash (\\osim A \\wedge \\osim B)\\\\ (\\osim A\n\\wedge \\osim B) &\\vdash \\osim (A \\vee B)\\\\ \\osim (A \\wedge B)\n&\\vdash (\\osim A \\vee \\osim B)\\\\ \\end{align}\\)\n\n\nWhereas classical logic validates all of these rules, intuitionistic\nlogic validates only the first three of them.\n\nThe proof-theoretical characterization of negation is important for\nthe use of negation connectives in derivations. To obtain a more\ncomprehensive understanding of negation, however, the proof theory has\nto be supplemented by a semantics. We first consider truth tables.\n2.1 Negation as a truth function\n\nIn classical logic, the semantic principle of bivalence is assumed,\nsaying that a formula has exactly one of two semantic values, namely\neither the value T[rue] or the value F[alse] (1 or 0), but not both.\nNegation, \\(\\osim \\), is semantically characterized by the unary\nfunction \\(f_{\\osim }\\) on the set \\(\\{1, 0\\}\\), defined by the\nfollowing truth table: \n\\[ \\begin{array}{c|c}\nf_{\\osim } & \\\\\n \\hline 1 & 0 \\\\\n 0 & 1 \n\\end{array} \\]\n\n\nThat is, if \\(A\\) is a formula, then \\(\\osim A\\) is false if \\(A\\) is\ntrue, and \\(\\osim A\\) is true if \\(A\\) is false. The function\n\\(f_{\\osim }\\) is said to be a truth function because it is a function\ndefined on the set of classical truth values \\(\\{1, 0\\}\\), see the\nentry on\n truth values.\n\nIf negation is meant to express semantic opposition, it is clear that\nthe remaining two-valued unary truth functions fail to characterize\nany plausible notion of semantic opposition between \\(A\\) and \\(\\osim\nA\\): \n\\[ \\begin{array}{ccc}\n\\begin{array}{c|c}\nf_{\\textit{id}} & \\\\\n \\hline 1 & 1 \\\\\n 0 & 0 \n\\end{array} & \\quad \\begin{array}{c|c}\nf_{\\top} & \\\\\n \\hline 1 & 1 \\\\\n 0 & 1 \\\\\n \n\\end{array} & \\quad \\begin{array}{c|c}\nf_{\\perp} & \\\\\n \\hline 1 & 0 \\\\\n 0 & 0 \n\\end{array} \n\\end{array} \\]\n\n\nHowever, if a distinction is already drawn between\ncontradictory-forming and contrary-forming sentential negations, the\nground is prepared for a pluralism with respect to negation seen as a\nunary connective. One might think of obtaining different concepts of\nnegation by letting the negations interact with other logical\noperations in various ways, but this does not help concerning atomic\nformulas that do not contain any logical operation.\n\nThere are several ways of generalizing the semantics and making room\nfor additional sentential negations. One comes with giving up\nbivalence and admitting sets of truth values (truth degrees) with more\nthan two elements, see the entry on\n many-valued logic.\n In the so-called Łukasiewicz many-valued logics\nŁ\\(_{\\aleph_{1}}\\),\nŁ\\(_{\\aleph_{o}}\\), and\nŁ\\(_n\\), the set of values is either the whole\nreal unit interval [0,1], or the whole rational unit interval [0,1],\nor the finite set of rational numbers \\(\\{ 0, \\frac{1}{n-1},\n\\frac{2}{n-1}, \\ldots, 1 \\}\\). These sets include 1 as the designated\nvalue representing True, where the designated values of a many-valued\nlogic are the values that are preserved in valid inferences.\nŁukasiewicz negation \\(\\osim \\) is defined by setting \\(f_{\\osim\n}(u) = 1- u\\). Negation is thus understood in terms of subtraction\nfrom the numerical representation of True. In so-called Gödel\nmany-valued logics, the truth function \\(f_{\\osim }\\) for negation\n\\(\\osim \\) is defined by setting \\(f_{\\osim }(u) = 1\\) if \\(u = 0\\),\nand \\(f_{\\osim }(u) = 0\\) if \\(u \\not = 0\\). Here negation is\nunderstood in terms of the numerical representation of True and\ndistinctness from the numerical representation of False.\n\nIn Kleene’s (strong) three-valued logic K3,\nwith \\(i\\) as a third value in addition to 0 and 1, the truth function\n\\(f_{\\osim }\\) for negation \\(\\osim \\) is defined by the same table as\nthe table for negation in Ł\\(_3\\), replacing\n\\(\\frac{1}{2}\\) by \\(i\\): \n\\[ \\begin{array}{c|c}\nf\\osim & \\\\\n \\hline 1 & 0 \\\\\n i & i \\\\\n 0 & 1 \\\\\n \n\\end{array} \\]\n\n\nIn K3 and Ł\\(_3\\) a formula\n\\(A\\) and its negation \\(\\osim A\\) cannot both be true in the sense of\nboth taking the designated value 1, but they both fail to be true if\n\\(A\\) receives the value \\(i\\), respectively \\(\\frac{1}{2}\\). If a\ncontrary pair of formulas is defined as a pair of formulas that cannot\nboth be true but may both fail to be true, then Kleene negation gives\nrise to contrary pairs.\n\nAlso, falsity (understood as receiving the value 0) and non-truth\n(understood as taking a value different from 1) fall apart in\nK3. As a result, contraposition fails in\nK3. Another example of a logic with a\nnon-contraposable negation is Priest’s Logic of Paradox,\nLP, where negation is interpreted by \\(f\\osim \\) and\nboth \\(i\\) and 1 are designated values, see the entry on\n paraconsistent logic.\n If in K3 or in LP an implication\n\\((A \\supset B)\\) is defined as material implication \\((\\osim A \\vee\nB)\\), then contraposition holds in the sense that \\((A \\supset B)\\)\nentails \\((\\osim B \\supset \\osim A)\\).\n\nIf we think of negation in K3 as representing a\nnatural language negation, K3’s\n“internal”, presupposition-preserving negation \\(\\osim \\)\ndiffers from the external, presupposition-cancelling negation \\(\\neg\\)\nin Bochvar’s three-valued logic B3 by always\nreturning a classical value. The truth function \\(f_{\\neg}\\) is\ndefined by the following table: \n\\[ \\begin{array}{c|c}\nf_{\\neg} & \\\\\n \\hline 1 & 0 \\\\\n i & 1 \\\\\n 0 & 1 \\\\\n \n\\end{array} \\]\n\n\nIt is also possible to use the machinery of possible worlds models to\nsemantically define various notions of negation. Negation is then\ntreated as a modal operator.\n2.2 Negation as a modal operator\n\nSince modal operators are unary connectives and since there exist\ndifferent notions of alethic necessity (necessary truth) and alethic\npossibility (possible truth), a rather natural question then is\nwhether negations can be analyzed in a revealing way as modal\noperators, see the entry on\n modal logic.\n\nVery well-known modal logics are the normal modal\nlogics that have a so-called possible worlds semantics making use of a\ntwo-place relation between possible worlds. Slightly less known are\nthe classical (or congruential) modal logics\n(Segerberg 1971, Chellas 1980, Pacuit 2017). The weakest requirement\nimposed on a necessity-like modal operator \\(\\Box\\) in systems of\nclassical modal logic is the congruence property: \n\\[ \\mathord{\\vdash A \\leftrightarrow B} \\slashrel \\mathord{\\vdash \\Box A \\leftrightarrow \\Box B}\\]\n\n(“if \\(A \\leftrightarrow B\\) is provable, then so is \\(\\Box A\n\\leftrightarrow \\Box B\\)”). This property, however, is certainly\nnot distinctive of negation.\n\nClassical modal logics have a semantics in terms of so-called minimal\nmodels, also known as neighbourhood models. A\nneighbourhood model is a structure \\(\\cal M\\) \\(=\\) \\((W, N, v)\\),\nwhere \\(W\\) is a non-empty set of possible worlds, \\(N\\) is a function\nassigning to every \\(w\\) from \\(W\\) a set \\(N(w)\\) of subsets of\n\\(W\\), called neighbourhoods of \\(w\\), and \\(v\\) is a valuation\nfunction mapping atomic formulas to the set of worlds where they are\ntrue. Let \\(\\llbracket A\\rrbracket\\) be the set of worlds at which\nformula \\(A\\) is true. Then \\( \\Box A\\) is defined to be true at a\nworld \\(w\\) in model \\(\\cal M\\) (in symbols: \\({\\cal M}, w \\models\n\\Box A\\)) iff \\(\\llbracket A\\rrbracket \\in N(w)\\).\n\nIn Ripley 2009 it is suggested to use the neighbourhood semantics as a\ngeneral framework for semantically capturing properties characteristic\nof negation connectives interpreted as a necessity operator \\( \\Box\n\\), see also Yu 2010. Ripley points out, for example, that the\ncontraposition rule \n\\[ A \\vdash B \\slashrel \\Box B \\vdash \\Box A\\]\n is valid in a neighbourhood model\n\\((W, N, v)\\) iff for every \\(w \\in W\\), \\(N(w)\\) is closed under\nsubsets, i.e., if \\(X \\in N(w)\\) and \\(Y \\subseteq X\\), then \\(Y \\in\nN(w)\\). It would be nice to have a convincing intuitive understanding\nof the neighbourhood function \\(N\\) in terms of a concept that\nexplains some core aspects of negation. If \\(\\llbracket A\\rrbracket\n\\in N(w)\\) is understood as saying that the proposition expressed by\n\\(A\\) is incompatible with world \\(w\\), then the above constraint\nemerges as reasonable because it says that if the set of worlds (the\nproposition) \\(X\\) is incompatible with \\(w\\) and proposition \\(Y\\)\nimplies \\(X\\), then \\(Y\\) is incompatible with \\(w\\) as well. Whereas\nRipley starts with a positive notion (\\({\\cal M}, w \\models \\Box A\\)\niff \\(\\llbracket A\\rrbracket \\in N(w)\\)), in order to introduce a\nnegation \\(\\osim \\), one may also stipulate that \\({\\cal M}, w \\models\n\\osim A\\) iff \\(\\llbracket A\\rrbracket \\not \\in N(w)\\), so as to\nobtain a connective that is more overtly a negative impossibility\noperator (although it is the clause for \\(\\Box A\\) that is classically\nnegated). The idea is that \\(N(w)\\) contains the sets of worlds\ncompatible with \\(w\\), so that \\(\\llbracket A\\rrbracket \\not \\in\nN(w)\\) indicates that the proposition expressed by \\(A\\) is\nincompatible with \\(w\\). Negation as an “unnecessity”\noperator \\(\\neg\\) in the sense of (“possibly not”) is then\ndefined by \\({\\cal M}, w \\models \\neg A\\) iff \\(\\overline{\\llbracket\nA\\rrbracket} \\in N(w)\\), where \\(\\overline{\\llbracket A\\rrbracket}\\)\nis the complement of \\(\\llbracket A\\rrbracket\\) with respect to \\(W\\).\nAs a result, \\(\\neg A\\) is true at a state \\(w\\) iff the complement of\nthe proposition expressed by \\(A\\) is compatible with \\(w\\).\n\nThis semantics validates respective versions of congruence\n(\\(\\mathord{\\vdash A \\leftrightarrow B} \\slashrel \\mathord{\\vdash\n\\osim A \\leftrightarrow \\osim B}\\) and \\(\\mathord{\\vdash A\n\\leftrightarrow B} \\slashrel \\mathord{\\vdash \\neg A \\leftrightarrow\n\\neg B}\\)), but it does not yet impose any interesting constraints on\nnegation. In order to exclude that for some world \\(w\\) and formula\n\\(A\\), both \\(w \\in \\llbracket A\\rrbracket\\) and \\(w \\in \\llbracket\n\\osim A\\rrbracket\\), one has to stipulate that for every set of worlds\n\\(X\\), if \\(w \\in X\\) then \\(X \\in N(w)\\), which makes sense under the\ncompatibility reading of the neighbourhood function \\(N\\) because it\nsays that if \\(X\\) is true at \\(w\\), then \\(X\\) is compatible with\n\\(w\\). In order to validate contraposition, it has to be required that\nif \\(X \\subseteq Y\\), then \\(\\{w\\mid Y \\not \\in N(w)\\}\\) \\(\\subseteq\\)\n\\(\\{w\\mid X \\not \\in N(w)\\}\\). Under the compatibility reading of\n\\(N\\) this condition says that every world \\(Y\\) is incompatible with\nis also a world \\(X\\) is incompatible with, if proposition \\(X\\)\nimplies proposition \\(Y\\). Similar conditions can be imposed for the\ndual negation that requires complementation.\n\nThe relational semantics of normal modal logics, however,\ndoes come with a commitment to a substantial property of negation\nunderstood as impossibility or as unnecessity. The analysis of\nnegation as a normal impossibility operator can be traced back to work\nby Birkhoff and von Neumann (1936) and Goldblatt (1974) on negation in\nquantum logic. It has been developed by Vakarelov (1977, 1989b) and\nDošen (1984, 1986, 1999) and has been further investigated in\nthe algebraic setting of Michael Dunn’s gaggle theory (see\nBimbó and Dunn 2008) by Dunn (1993, 1996, 1999) and Dunn and\nZhou (2005). A relational model (or Kripke model) is\na structure \\(\\cal M\\) \\(=\\) \\((W, R, v)\\), where \\(W\\) is a non-empty\nset of information states, \\(R\\) is a two-place\n“accessibility” relation on \\(W\\), and \\(v\\) is a\nvaluation function. Dunn denotes the accessibility relation by\n\\(\\bot\\) (pronounced “perp”) and regards it as a relation\nof incompatibility or orthogonality between states. Negation as\nimpossibility, denoted by \\(\\osim \\), is then semantically defined by\npostulating that \\(\\osim A\\) is true at a state \\(w\\) in model \\(\\cal\nM\\) iff \\(w\\) is incompatible with all states \\(u\\) (from \\(W\\)) at\nwhich \\(A\\) is true: \\({\\cal M}, w \\models \\osim A\\) iff (for every\n\\(u\\): \\({\\cal M}, u \\models A \\mbox{ implies } w \\bot u).\\)\nAlternatively, the relation \\(R\\) may be understood as a relation of\ncompatibility between states, denoted by \\(C\\). \\({\\cal M}, w \\models\n\\osim A\\) is then defined by requiring that for every \\(u\\): \\(wCu\n\\mbox{ implies } {\\cal M}, u \\not \\models A.\\) Negation as\nunnecessity, denoted by \\(\\neg\\), is accordingly defined by the\nfollowing clause: \\({\\cal M}, w \\models \\neg A\\) iff (there exists\n\\(u\\) with \\(wCu \\mbox{ and } {\\cal M}, u \\not \\models A)\\).\n\nIt proves useful to enrich the above relational semantics by another\nbinary relation \\(\\leq\\) on the set of states \\(W\\). The relation\n\\(\\leq\\) is assumed to be a partial order (i.e., it is reflexive,\ntransitive and anti-symmetric), which allows one to think of it as a\nrelation of possible expansion of information states. With such a\nreading it is natural to assume that the truth of atomic formulas\n\\(p\\) is persistent with respect to \\(\\leq\\): if \\(w \\leq u\\) and\n\\({\\cal M},w \\models p\\), then \\({\\cal M},u \\models p.\\) The\nconditions on \\(\\leq\\) and \\(C\\) and the truth conditions for compound\nformulas should then be such that persistence (also called heredity)\nholds for arbitrary formulas, in particular for negated formulas\n\\(\\osim A\\) if negation as impossibility is considered. A\ncompatibility model is a structure \\((W,C,\\leq, v)\\),\nwhere \\((W,C,v)\\) is a Kripke model, \\(\\leq\\) is a partial order on\n\\(W\\), and the following condition is satisfied, which guarantees the\nheredity of negated formulas \\(\\osim A\\): if \\(wCu\\), \\(w' \\leq w\\),\nand \\(u' \\leq u\\), then \\(w'Cu'\\). This condition is a constraint on\nthe compatibility frame \\((W,C,\\leq)\\) on which a\nmodel \\((W,C,\\leq,v)\\) is based. The condition is not only useful (as\nwill become clear), but also plausible, because it says that two\ninformation states, expansions of which are compatible, are themselves\ncompatible.\n\nWe can now define that a sequent \\(A \\vdash B\\) is valid in a\ncompatibility model iff for every state \\(w\\) from that model, if\n\\(A\\) is true at \\(w\\), then so is \\(B\\); \\(A \\vdash B\\) is called\nvalid on a compatibility frame iff \\(A \\vdash B\\) is valid in every\nmodel based on that frame. A rule is valid on a frame iff the validity\nof the premises sequents on that frame guarantees the validity of the\nconclusion sequent on the frame. The contraposition rule from the list\n(21) is valid on any compatibility frame. If the order-inversion\nexpressed by contraposition is seen as a fundamental property of\nnegation, a hierarchy of stronger negations can be obtained\nsyntactically by postulating further principles and semantically by\ncharacterizing these principles by means of conditions on\ncompatibility frames \\((W, C, \\leq)\\), or relational\nframes \\((W, C)\\). This line of thought has led from a\n“kite” of negations in Dunn 1993 to “lopsided\nkites” of negations and an extended kite of negations in Shramko\n2005, Dunn and Zhou 2005, see also Onishi 2015.\n\nA note on terminology. In Dunn 1993, a negation\noperation validating the contraposition rule is called\nsubminimal. The term “subminimal\nnegation” had been used by Allen Hazen in an unpublished paper\nfrom 1992 for a richer language containing negation, conjunction,\ndisjunction, and intuitionistic implication to denote a negation that\nfails to validate the intuitionistically valid De Morgan sequent\n\\((\\osim A \\wedge \\osim B) \\vdash \\osim (A \\vee B)\\) and the\nclassically but not intuitionistically valid \\(\\osim (A \\wedge B)\n\\vdash (\\osim A \\vee \\osim B)\\). Dunn’s use of the term\n“subminimal” is thus different from Hazen’s. In Dunn\nand Zhou 2005 only a single negation as impossibility is used, the\nvocabulary is enriched by conjunction and disjunction, and in both,\nthe one with negation, conjunction, and disjunction as well as the one\nwith negation only, subminimal negations are referred to as\npreminimal negations. Moreover, the minimal negations from\nDunn 1993, 1996 are called quasi-minimal in Dunn and\nZhou 2005 because they lack negative ex contradictione, a\nproperty of negation in what is usually called (Johansson’s)\nminimal logic, see Kolmogorov 1925 and Johansson 1937. In Vakarelov\n2005, the term “subminimal negation” is used to denote a\nnegation weaker than Kolmogorov and Johansson’s minimal\nnegation. Vakarelov introduces his subminimal negation in combination\nwith David Nelson’s strong negation (see below) in a language\nthat contains a truth constant \\(\\top\\), which is definable in minimal\nlogic. Vakarelov’s subminimal negation, \\(\\neg\\), validates the\ncontraposition rule but fails to validate \\(\\neg \\neg \\top\\).\nColacito, de Jongh, and Vargas 2017 define a system called\n“subminimal logic”, see also Niki (forthcoming). Their\nsubminimal negation is added to the language of positive\nintuitionistic logic and thus, in particular, contains intuitionistic\nimplication. The basic subminimal logic is obtained from positive\nintuitionistic propositional logic by adding the congruence axiom\nscheme \\((A \\leftrightarrow B ) \\rightarrow (\\neg A \\leftrightarrow\n\\neg B)\\). We shall come back to subminimal negation in subminimal\nlogic in\n Section 2.3.\n\nIf the compatibility relation is not assumed to be symmetric (although\nit may be argued that compatibility between states is a\nsymmetrical relation), then one may distinguish between two negation\noperations \\(\\osim _1\\) and \\(\\osim _2\\) such that that \\(\\osim _1 A\\)\nis true at a state \\(w\\) just in case \\(A\\) fails to be true at every\nstate compatible with \\(w\\), and \\(\\osim _2 A\\) is true at a state\n\\(w\\) just in case \\(A\\) fails to be true at every state \\(w\\) is\ncompatible with: \n\\[ \\begin{align}{\\cal\nM}, w &\\models \\osim _1 A \\mbox{ iff } \\forall u (wCu \\mbox{ implies } {\\cal M}, u \\not \\models A);\\\\\n {\\cal M}, w &\\models \\osim _2 A \\mbox{ iff } \\forall u (uCw \\mbox{ implies } {\\cal M}, u \\not \\models A). \n\\end{align}\\]\n\n\nThe two negations form a so-called Galois connection,\nwhich means that \\(A \\vdash \\osim _1 B \\mbox{ iff } B \\vdash \\osim _2\nA.\\) The negations \\(\\osim _1\\) and \\(\\osim _2\\) are called Galois\nnegations or split negations; they are both preminimal negations and\nsatisfy the following interaction principles: \\(A \\vdash \\osim _1\n\\osim _2 A\\); \\(A \\vdash \\osim _2 \\osim _1 A.\\) A discussion of split\nnegation can be found in Wansing 2016b.\n\nAs noted in Dunn 1993, 1996, if contraposition is assumed, double\nnegation introduction \\(A \\vdash \\osim \\osim A\\) is mutually derivable\nwith constructive contraposition \\(A \\vdash \\osim B \\slashrel B \\vdash\n\\osim A\\), and if constructive contraposition is assumed, double\nnegation elimination is mutually derivable with classical\ncontraposition \\(\\osim A \\vdash B \\slashrel \\osim B \\vdash A\\). Note\nalso that in the presence of double negation introduction and\nelimination, one can derive \\(\\osim A \\vdash \\osim B \\, / \\, B \\vdash\nA\\). The demonstrations use only reflexivity and transitivity of the\nderivability relation \\(\\vdash\\). As a result, the above list of\nnegation laws leads to the following unbalanced “kite” of\nnegations (cf. Dunn and Zhou 2005):\n\n\n\nFigure 3\n\n\nThe graphical arrangement in this diagram is to be understood as\nfollows: If a sequent or sequent rule is assigned to a node \\(n\\) and\nnode \\(n'\\) is placed below \\(n\\), then the sequent or sequent rule\nassigned to \\(n'\\) is derivable with the aid of the sequent or sequent\nrule assigned to \\(n\\).\n\nOrtho negations satisfy all principles shown in the\nlopsided kite. An ortho negation in a logic with conjunction\ndistributing over disjunction (or, equivalently, disjunction\ndistributing over conjunction), is called a Boolean\nor classical negation. Boolean negation is uniquely determined in the\nsense that if \\(\\osim _1\\) and \\(\\osim _2\\) are Boolean negations,\nthen \\(\\osim _1 A\\) and \\(\\osim _2 A\\) are interderivable; ortho\nnegation is not uniquely determined, see Restall 2000, and for the\nuniqueness of connectives Humberstone 2011 and the entry on\n sentence connectives in formal logic.\n\nThe negation principles of Dunn and Zhou’s lopsided kite\ncorrespond in the sense of modal correspondence theory to properties\nof compatibility frames. A rule \\(r\\) corresponds to a property \\(E\\)\niff the rule \\(r\\) is valid on a compatibility frame just in case the\nframe satisfies \\(E\\). Greg Restall (2000) observed that double\nnegation elimination corresponds to a property of both \\(C\\)\nand the relation of possible expansion of information\nstates \\(\\leq\\), the other negation principles have been shown to\ncorrespond to properties only of the compatibility relation \\(C\\), see\nDunn 1996, Dunn and Zhou 2005, Berto 2014. In the following list,\n“&” denotes conjunction, “\\(\\Rightarrow\\)”\ndenotes Boolean implication, and “\\(\\forall\\)” and\n“\\(\\exists\\)” refer to universal and existential\nquantification, respectively, in the metalanguage: \n\\[ \\begin{align}\nA \\vdash \\osim \\osim A & & \\forall x \\forall y (xCy \\Rightarrow yCx) \\\\\n A \\vdash B, \\; A \\vdash \\osim B &/ A \\vdash \\osim C &\\forall x \\forall y (xCy \\Rightarrow xCx) \\\\\n A \\vdash B, \\; A \\vdash \\osim B &/ A \\vdash C &\\forall x (xCx), \\forall x \\forall y (xCy \\Rightarrow yCx)\\\\\n \\osim \\osim A \\vdash A & & \\forall x \\exists y(xCy \\amp \\forall z(yCz \\Rightarrow z \\leq x)) \n\\end{align} \\]\n\n\nThe following first-order property of \\(C\\) alone also corresponds to\ndouble negation elimination: \n\\[ \\forall x \\exists y (xCy \\amp \\forall z(yCz \\Rightarrow (z = x))).\\]\n\n\nWe may observe that Dunn and Zhou’s lopsided kite of negations\ncan be equilibrated, for example, by inserting the sequent schema\n\\(\\osim \\osim \\osim A \\vdash \\osim A\\). This schema corresponds to the\nfollowing first-order condition on \\(C\\) (as calculated with the help\nof the SQEMA algorithm for computing first-order correspondences in\nmodal logic due to Georgiev, Tinchev, and Vakarelov (see\n Other Internet Resources):\n \n\\[ \\forall x \\forall y (xCy \\Rightarrow \\exists z (xCz \\amp \\forall u (zCu \\Rightarrow uCy))).\\]\n\n\n\n\nFigure 4\n\n\nNegation as unnecessity gives rise to a dual lopsided kite of\nnegations that can be combined with the lopsided kite into a\n“united” kite of negations, see Shramko 2005, Dunn and\nZhou 2005, and\n Section 2.4.\n An even richer inclusion diagram of negations can be found in Ripley\n2009.\n\nWhilst satisfying the contraposition rule \\(A \\vdash B \\slashrel \\osim\nB \\vdash \\osim A\\) is a basic property of negation as a normal\nimpossibility operator, there exist unary connectives that are\nreferred to as negations, although they do not\nsatisfy contraposition. Prominent examples of logics with a\nnon-contraposable negation in addition to the already mentioned logics\nK3, Ł\\(_3\\), and\nLP, are Nelson’s logics N3,\nN4, and N4\\(^{\\bot}\\) of\nconstructive logic with so-called strong negation (see Nelson 1949;\nGurevich 1977; Almukdad and Nelson 1984; Wansing 1993, 2001; Dunn\n2000; Odintsov 2008). These logics contain intuitionistic implication\nas a primitive connective. Nelson (1959), however, also considers a\nvariant of N3 with a contraposable strong negation.\nIn this system S, the contraction axiom\n\n\\[ (A \\rightarrow (A \\rightarrow B))\\rightarrow (A \\rightarrow B)\\]\n\n\nis replaced by \n\\[ (A \\rightarrow (A \\rightarrow (A \\rightarrow B))) \\rightarrow (A \\rightarrow (A \\rightarrow B)).\\]\n\n\nThis replacement avoids a collapse into classical logic. Strong\nnegation is called “strong” because it captures a notion\nof negation as definite falsity and because in the system\nN3 the strong negation of a formula entails its\nintuitionistic negation. The conjunction, disjunction, and strong\nnegation fragment of N4 coincides with the logic of\nfirst-degree entailment FDE, also known as Dunn and\nBelnap’s useful four-valued logic (Belnap 1977a,b; Dunn 1976;\nOmori and Wansing 2017). Interestingly, contraposition as stated above\nholds for FDE, whereas it fails in\nFDE for multiple-premise sequents (see Problem 7,\nSection 8.10, p. 162 in Priest 2008).\n\nThe system FDE is a well-known system of relevance\nlogic (see the entry on\n relevance logic)\n and it shares with other relevance logics the property of being a\nparaconsistent logic, see the entry on\n paraconsistent logic.\n Paraconsistent logics fail to satisfy the unrestricted ex\ncontradictione rule, which is usually presented in a\nmultiple-antecedent framework by the sequent: \n\\[ A, \\osim A \\vdash B.\\]\n\n\nLogics that do not satisfy the negative ex contradictione\nrule are paraconsistent in a stricter sense. Double negation\nelimination and classical contraposition fail to be valid in\nintuitionistic logic (see the entry on\n intuitionistic logic);\n if one of them is added to an axiom system of intuitionistic logic,\none obtains a proof system for classical logic.\n\nNow, is negation a normal modal operator of impossibility or\nunneccessity? According to Berto (2014), the meaning of negation is\ngrounded in the notion of compatibility, together with its opposite\nconcept of incompatibility. Moreover, Berto takes compatibility and\nincompatibility to be symmetric relations and, as a result, holds that\nnothing can be justifiably called a negation if it does not satisfy\nthe contraposition rule and the double negation introduction rule.\nAccording to Berto and Restall (2019), “because\nincompatibility is modal, negation is a modal operator as\nwell.” This view is contentious, in light of non-contraposable\nnegations in systems such as Ł3,\nK3, LP, and N4, and\nit has been argued by De and Omori 2018 that there is more to negation\nthan modality.\n2.3 Interactions with negation\n\nAs already remarked, the classification of unary connectives as\nnegations may depend on the presence or absence of other logical\noperations. If the propositional language to which a negation\noperation is added contains only conjunction and disjunction (and\natomic formulas), a natural starting point is to assume that one is\ndealing with a so-called distributive lattice logic (cf. Dunn and Zhou\n2005). A distributive lattice logic is a single-antecedent and\nsingle-conclusion proof system in the language with only conjunction\n\\(\\wedge\\) and disjunction \\(\\vee\\). In addition to reflexivity and\ntransitivity of the derivability relation \\(\\vdash\\), the following\ninferential schemata are assumed:\n\n\\(A \\wedge B \\vdash A\\), \\(A \\wedge B \\vdash B\\),\n\\(A \\vdash B\\), \\(A \\vdash C\\) / \\(A \\vdash (B \\wedge C)\\),\n\\(A \\vdash C\\), \\(B \\vdash C\\) / \\((A \\vee B) \\vdash C\\),\n\\(A \\vdash (A \\vee B)\\), \\(B \\vdash (A \\vee B)\\),\n\\((A \\wedge (B \\vee C)) \\vdash ((A \\wedge B) \\vee (A \\wedge\nC))\\).\n\n\nIn this extended vocabulary one may consider further negation\nprinciples, in particular the De Morgan inference rules from (22):\n\n\\[ \\begin{align}\n(\\osim A \\vee \\osim B) &\\vdash \\osim (A \\wedge B)\\\\\n \\osim (A \\vee B) &\\vdash (\\osim A \\wedge \\osim B)\\\\\n (\\osim A \\wedge \\osim B) &\\vdash \\osim (A \\vee B)\\\\\n \\osim (A \\wedge B) &\\vdash (\\osim A \\vee \\osim B)\\\\\n \n\\end{align}\\]\n\n\nThe first three De Morgan rules are valid on any compatibility frame\nif the standard evaluation clauses for \\(\\wedge\\) and \\(\\vee\\) are\nassumed, and they can be proved utilizing standard inference rules for\n\\(\\wedge\\) and \\(\\vee\\) (cf. Restall 2000). (The first two De Morgan\nrules are valid on any compatibility frame also if negation as\nimpossibility, \\(\\osim\\), is replaced by negation as unnecessity,\n\\(\\neg\\).) Whereas the first two De Morgan laws, however, can be\nproved using only contraposition and inference rules for \\(\\wedge\\)\nand \\(\\vee\\), a derivation of the third De Morgan law requires the\napplication of constructive contraposition: \n\\[ \\begin{array}{c}\n\\begin{array}{cc}\n\\begin{array}{c}\n(\\osim A \\wedge \\osim B) \\vdash (\\osim A \\wedge \\osim B) \\\\\n\\hline (\\osim A \\wedge \\osim B) \\vdash \\osim A \\\\\n\\hline A \\vdash \\osim (\\osim A \\wedge \\osim B) \n\\end{array} & \\begin{array}{c}\n(\\osim A \\wedge \\osim B) \\vdash (\\osim A \\wedge \\osim B) \\\\\n\\hline (\\osim A \\wedge \\osim B) \\vdash \\osim B \\\\\n\\hline B \\vdash \\osim (\\osim A \\wedge \\osim B) \n\\end{array} \n\\end{array} \\\\\n \\hline \\begin{array}{c}\n(A \\vee B) \\vdash \\osim (\\osim A \\wedge \\osim B) \\\\\n\\hline (\\osim A \\wedge \\osim B) \\vdash \\osim (A \\vee B)\\\\\n \n\\end{array} \n\\end{array} \\]\n\n\nThe proof system for preminimal negation in the extended language\ngiven by the rules for distributive lattice logic together with\ncontraposition is incomplete, and a complete proof system is obtained\nif \\((\\osim A \\wedge \\osim B) \\vdash \\osim (A \\vee B)\\) is added (cf.\nDunn and Zhou 2005 for the language with constants \\(\\top\\) and\n\\(\\bot\\) added). The remaining fourth De Morgan law is provable in the\npresence of double negation elimination. The following derivation\nmakes use of both double negation elimination and classical\ncontraposition (cf. Restall 2000): \n\\[ \\begin{array}{c}\n\\begin{array}{cc}\n\\begin{array}{c}\n\\osim A \\vdash \\osim A \\\\\n\\hline \\osim A \\vdash (\\osim A \\vee \\osim B) \\\\\n\\hline \\osim (\\osim A \\vee \\osim B) \\vdash A \n\\end{array} & \\begin{array}{c}\n\\osim B \\vdash \\osim B \\\\\n\\hline \\osim B \\vdash (\\osim A \\vee \\osim B) \\\\\n\\hline \\osim (\\osim A \\vee \\osim B) \\vdash B \n\\end{array} \n\\end{array} \\\\\n \\hline \\begin{array}{c}\n\\osim (\\osim A \\vee \\osim B) \\vdash (A \\wedge B) \\\\\n\\hline \\osim (A \\wedge B) \\vdash (\\osim A \\vee \\osim B) \n\\end{array} \n\\end{array} \\]\n\n\nRestall (2000) showed that \\(\\osim (A \\wedge B) \\vdash (\\osim A \\vee\n\\osim B)\\) corresponds to the mixed frame condition \n\\[ \\forall x \\forall y_1 \\forall y_2 ((xCy_1 \\amp xCy_2) \\Rightarrow \\exists z (y_1 \\leq z \\amp y_ 2 \\leq z \\amp xCz)).\\]\n\n\nThe algorithm SQEMA outputs the following first-order condition for\n\\(\\osim (A \\wedge B) \\vdash (\\osim A \\vee \\osim B)\\) in terms of \\(C\\)\nalone: \\(\\forall x \\forall y \\forall z ((xCy \\amp xCz) \\Rightarrow ((y\n=z)\\amp xCy))\\), which is equivalent to: \n\\[ \\forall x \\forall y \\forall z ((xCy \\amp xCz) \\Rightarrow (y =z)),\\]\n implying that\n\\(C\\) is a function if \\(C\\) is serial. For functional frames,\nnegation as impossibility and negation as unnecessity coincide.\n\nIn the extended language, negative ex contradictione can be\nstated as \\((A \\wedge \\osim A) \\vdash \\osim B\\) and unrestricted\nex contraditione as \\((A \\wedge \\osim A) \\vdash B\\). It is\nalso natural to assume a constantly true formula \\(\\top\\) and a\nconstantly untrue formula \\(\\bot\\), so that the following sequents are\nvalid: \\(A\\vdash \\top\\), \\(\\bot\\vdash A\\), and \\(\\top \\vdash \\osim\n\\bot\\). (With negation as unnecessity, \\(\\neg \\top \\vdash \\bot\\) is\nvalid.) Whereas these sequents are indeed valid on any compatibility\nframe, the equally natural \\(\\osim \\top \\vdash \\bot\\) (as well as\n\\(\\top \\vdash \\neg \\bot\\)) corresponds with the seriality of \\(C\n\\mathrel{:} \\forall x \\exists y (xCy)\\). In the extended vocabulary,\nunrestricted ex contradictione can be stated as \\((A \\wedge\n\\osim A) \\vdash \\bot\\), and in this form it is characterized by the\nreflexivity of the compatibility relation. The law of excluded middle\n\\(\\top \\vdash (A \\vee \\osim A)\\) corresponds to the mixed condition\n\\(\\forall x \\forall y(xCy \\Rightarrow y \\leq x)\\) but also to\n\\(\\forall x \\forall y (xCy \\Rightarrow (x =y))\\).\n\nThe correspondence theory of negation as impossibility and negation as\nunnecessity in a language with \\(\\top\\), \\(\\bot\\), \\(\\wedge\\), and\n\\(\\vee\\) has been developed in Lahav, Marcos, and Zohar 2017, using\nmethods of the theory of basic sequent systems from Lahav and Avron\n2013 in order to obtain various cut-admissibility results. Moreover,\nLahav and his co-authors also consider the addition of so-called\nadjustment operators and the definability of classical negation.\n\nAnother interesting classification of negation operators arises if it\nis assumed that the language under consideration contains a primitive\nimplication connective, \\(\\rightarrow\\), that is not defined by\nputting \\((A \\rightarrow B) \\coloneq (\\osim A \\vee B)\\), or a\nprimitive so-called co-implication (or subtraction) operation,\n\\(\\coimp\\), not defined by putting \\((A \\coimp B) \\coloneq (A \\wedge\n\\osim B)\\), or both. The standard understanding of negated\nimplications is conveyed by the equivalence \\(\\osim (A \\rightarrow B)\n\\leftrightarrow (A \\wedge \\osim B)\\). Dually, the classical reading of\nnegated co-implications is expressed by \\(\\osim (A \\coimp B)\n\\leftrightarrow (\\osim A \\vee B)\\). Co-implication is the dual of\nimplication, insofar as it stands to disjunction as implication stands\nto conjunction:\n\n(23)\n\\(\\begin{align} (A \\wedge B) \\vdash C &\\mbox{ iff } A \\vdash\n(B\\rightarrow C) \\mbox{ iff } B \\vdash (A \\rightarrow C),\\\\ C \\vdash\n(A \\vee B) &\\mbox{ iff } (C \\coimp B) \\vdash A \\mbox{ iff } (C\n\\coimp A) \\vdash B. \\end{align}\\)\n\n\nA formula \\((A \\coimp B)\\) may be read as “\\(B\\) co-implies\n\\(A\\)” or as “\\(A\\) excludes \\(B\\)”. If implication\nand co-implication are primitive and not defined as in classical logic\n(and some other logics), further readings of negated implications and\nco-implications are given by the following equivalences:\n\n(24)\n\\(\\begin{align}\\osim (A \\rightarrow B) &\\leftrightarrow (A\n\\coimp B),\\\\ \\osim (A \\coimp B) &\\leftrightarrow (A \\rightarrow\nB),\\\\ \\osim (A \\rightarrow B) &\\leftrightarrow (\\osim B \\coimp\n\\osim A),\\\\ \\osim (A \\coimp B) &\\leftrightarrow (\\osim B\n\\rightarrow \\osim A). \\end{align}\\)\n\n\nIn the literature, however, one may also find a less-standard reading\nof negated implications (and consequently also a corresponding\nnon-standard understanding of negated co-implications). This unusual\nreading of negated implications is usually tracked back to Aristotle\nand Boethius, and is referred to as the connexive version of\n(negated) implications (cf. Wansing 2005, McCall 2012 and the\n connexive logic\n entry). Equivalences characteristic of connexive implication and\nco-implication are:\n\n(25)\n\\(\\osim (A \\rightarrow B) \\leftrightarrow (A \\rightarrow \\osim\nB)\\), \\(\\osim (A \\coimp B) \\leftrightarrow (\\osim A \\coimp B)\\).\n\n\nThe preceding typology of negated implications and co-implications has\nbeen developed in Wansing 2008, and one might add to this list the\nequivalences \\(\\osim (A \\rightarrow B) \\leftrightarrow (B \\rightarrow\n\\osim A)\\) and \\(\\osim (A \\coimp B) \\leftrightarrow (\\osim B \\coimp\nA)\\).\n\nThe constructive implication of positive intuitionistic logic is\npresent in the systems with subminimal negation from Colacito, De\nJongh, and Vargas 2017. They also treat negation as a kind of modal\noperator by considering frames \\((W, R, N)\\), where \\((W, R)\\) is a\nrelational frame, \\(R\\) is a partial order on \\(W\\), and \\(N\\) is a\nunary function on the set of all upwards closed subsets of \\(W\\)\n(i.e., the set of all \\(X \\subseteq W\\) such that if \\(w \\in X\\) and\n\\(wRu\\), then \\(u \\in X\\)). A model is obtained by adding to a frame a\nvaluation function that is persistent for atomic formulas. Moreover,\nthe following condition is imposed on the function \\(N\\):\n\n\\[\\tag{*} \\mbox{for every } w\\in W\\!: w\\in N(X) \\mbox{ iff } w \\in N(X \\cap \\{u \\mid wRu\\}). \\]\n\n\nThe truth conditions of negated formulas \\(\\neg A\\) and implications\n\\((A \\rightarrow B)\\) at a state \\(w\\) in a model M are then given as\nfollows: \n\\[\\begin{array}{lcl}\nM, w \\models \\neg A & \\mbox{ iff } & w \\in N{\\llbracket A\\rrbracket} \\\\\n M, w \\models (A \\rightarrow B) & \\mbox{ iff } & \\mbox{for every } u\\in W\\!: \\\\\n & &\\; wRu \\mbox{ implies } (M,u \\not \\models A \\mbox{ or } M,u \\models B). \n\\end{array} \\]\n\n\nThe basic subminimal logic N characterized by the\nclass of all frames can be presented as the extension of the standard\naxiomatization of positive intuitionistic logic by the congruence\naxiom scheme \\( (A \\leftrightarrow B ) \\rightarrow (\\neg A\n\\leftrightarrow \\neg B)\\). The validity of that axiom (its truth at\nevery state of every model) is guaranteed by condition (*), but it is\nnot distinctive of negation. The following additional schematic axioms\nare considered in Colacito, De Jongh, and Vargas 2017:\n\n\\((A \\rightarrow \\neg A) \\rightarrow \\neg A\\),\n\\((A \\rightarrow B) \\rightarrow (\\neg B \\rightarrow \\neg\nA)\\),\n\\((A \\wedge \\neg A) \\rightarrow \\neg B \\),\n\\(\\neg \\neg A \\rightarrow A \\),\n\\(\\neg (A \\wedge B) \\rightarrow (\\neg A \\vee \\neg B) \\),\n\n\nand it is shown that the logic obtained by adding the contraposition\naxiom \\((A \\rightarrow B) \\rightarrow (\\neg B \\rightarrow \\neg A)\\) is\ncharacterized by the class of all frames that satisfy for all upwards\nclosed sets \\(X, X'\\): if \\(X \\subseteq X'\\) then \\(N(X') \\subseteq\nN(X)\\). Moreover, it is shown that the negative ex\ncontradictione axiom \\((A \\wedge \\neg A) \\rightarrow \\neg B \\)\ncorresponds with the following frame property: \\(\\forall X \\forall X'\n(X \\cap N(X) \\subseteq N(X'))\\).\n\nOnce there is more than just a single negation connective available,\nthe interplay between these operations can be considered. Although\nclassical and intuitionistic logic as well as the familiar systems of\nmodal logic comprise only one negation operation, there are also very\nnaturally arising logical systems with more than just one negation,\nand the motivation for taking into account multiple negations not only\ncomes from natural language semantics but also from the field of\nknowledge representation, see, for instance, Wagner 1994.\n\nA well-known example of a logic with two negation operations is\nHeyting-Brouwer logic, also known as bi-intuitionistic logic, see\nRauszer 1980, Goré 2000. In addition to intuitionistic\nnegation, bi-intuitionistic logic contains a so-called co-negation\nthat is in a sense dual to intuitionistic negation. In\nbi-intuitionistic logic \\(\\top\\) is definable as \\((p \\rightarrow p)\\)\nand \\(\\bot\\) as \\((p \\coimp p)\\) for some atomic formula \\(p\\). The\nintuitionistic negation \\(\\osim A\\) of \\(A\\) is then definable as \\((A\n\\rightarrow \\bot\\)) and the co-negation \\(- A\\) of \\(A\\) as \\((\\top\n\\coimp A)\\). Whereas intuitionistic negation is a forward-looking\nimpossibility operation with respect to the information order in\ncompatibility frames, i.e., \n\\[ {\\cal M}, w \\models \\osim A \\mbox{ iff } \\forall u (w\\leq u \\mbox{ implies } {\\cal M}, u \\not \\models A),\\]\n co-negation is a\nbackward-looking unnecessity operator: \n\\[ {\\cal M}, w \\models - A \\mbox{ iff } \\exists u (u \\leq w \\mbox{ and } {\\cal M}, u \\not \\models A).\\]\n\n\nAnother version of bi-intuitionistic logic, called\n2Int, with a different notion of co-implication and\nhence co-negation has been developed in Wansing 2016a. In particular,\nin the semantics of 2Int a distinction is drawn\nbetween a support of truth and a support of falsity relation between\nstates and formulas, and a state supports the truth of \\(-A\\) iff it\nsupports the falsity of \\(A\\).\n\nOther examples of logics with more than just one negation are provided\nby logics with Galois negations. Moreover, in so-called\ntrilattice logics (cf. Shramko and Wansing 2011) a\ndistinction is drawn between a truth negation \\(\\osim _t\\) and a\nfalsity negation \\(\\osim _f\\). Whereas truth negation is interpreted\nby a unary algebraic operation that inverts a truth order on a set of\ngeneralized truth values (see the entry on\n truth values),\n falsity negation is interpreted by an operation inverting a falsity\norder on generalized truth values. Furthermore, there is an\ninformation negation \\(\\osim _i\\) understood as an information order\ninversion. The three negations satisfy not only contraposition, but\nthey are also “period two” (involutive), i.e., they\nsatisfy the double negation law in both directions. Obviously, in such\na setting various double and triple negation laws may be considered,\nsee also Kamide and Wansing 2012. An in-depth investigation of a\nhierarchy of double negation principles can be found in Kamide\n2013.\n\nAfter examining the interplay between negation, implication, and\nco-implication, recent work on negation as a modal operator in display\ncalculi, a generalization of Gentzen’s seuqent calculi, can be\nconsidered. There the above notions of negation as impossibility and\nunnecessity can be captured by structural sequent rules, see the\nsupplement\n Substructural negations: negation as a modal operator in display calculi.\n2.4 Other conceptions of negation as a unary connective\n\nThere are several other approaches to negation that build on quite\ndifferent ideas of expressing semantic opposition. A meta-level\nconception of negation, for example, is the so-called negation\nas failure that has been developed in logic programming. The\nseminal paper Clark 1978 suggests the higher-level negation as failure\nrule (in a slightly irritating notation): \\(\\vdash \\osim \\vdash p\n\\mbox{ infer } \\vdash \\osim p\\). The idea is that \\(\\osim p\\) may be\ninferred if the exhaustive search for a proof of the atomic statement\n\\(p\\) failed.\n\nIn Hintikka’s (1973) game-theoretical semantics, negation is\nmodeled by a role-switch between two players in a semantic game (cf.\nthe entry on\n logic and games).\n A geometrical intuition of negation as inversion can\nbe found in a paper by Ramsey, who suggested that\n\n\n[w]e might, for instance, express negation not by inserting a word\n“not”, but by writing what we negate upside down. Such a\nsymbolism is only inconvenient because we are not trained to perceive\ncomplicated symmetry about a horizontal axis, and if we adopted it, we\nshould be rid of the redundant “not-not”, for the result\nof negating the sentence “\\(p\\)” twice would be simply the\nsentence “\\(p\\)” itself. (F.P. Ramsey 1927,\n161–2)\n\n\nThe idea of negation as the inversion of arrangements of truth values,\nsuch as truth value polygons, has been developed in Varzi and Warglien\n2003, see also Shramko and Wansing 2011 for negation as\norder-inversion in a logic of generalized truth values.\n\nIn order to extend Dummett’s verificationism (cf., e.g., Dummett\n1996) from mathematical to empirical discourse, a notion of\n“empirical negation” has been suggested (see De 2011,\n2013). A formula \\(\\osim A\\) is read as “\\(A\\) is not warranted\nby our current state of evidence” and it is evaluated with\nrespect to a distinguished base state \\(g\\) in a model \\(\\cal M\\):\n\\({\\cal M}, w \\models \\osim A\\) iff \\({\\cal M}, g \\not \\models\nA\\).\n\nThe supplement document\n “Additional Conceptions of Negation as a Unary Connective”\n briefly addresses the following approaches, where negation will be\ndenoted as \\(\\neg\\) (if not stated otherwise):\n\nNegation as the Routley star\nThe notion of Routley star negation is more general than the\nnotion of empirical negation. The Routley star is a unary function\n\\(^*\\) on possible worlds that delegates the semantic evaluation of a\nnegated formula \\(\\neg A\\) at a world or state \\(w\\) to the state\n\\(w^*\\): \\(\\neg A\\) is true at a \\(w\\) in a model \\(\\cal M\\) iff \\(A\\)\nis not true at \\(w^*\\) in \\(\\cal M\\).\nNegation as inconsistency\nThe notion of negation as inconsistency is based on the idea that\nthe negation of \\(A\\) expresses that \\(A\\) implies (or allows to\nderive) something absurd or even something\n“unwanted”.\nNegation as contradictoriness\nThe idea of negation as contradictoriness is to explicate negation\nby understanding \\(\\neg A\\) as the contradictory of \\(A\\), where the\nrelationship of contradiction may be defined in terms of certain\nlogical laws, such as the Law of Excluded Middle and the Law of\nNon-Contradiction.\nNegation as falsity\nAccording to negation as falsity, the negation \\(\\neg A\\) of \\(A\\)\nexpresses that \\(A\\) is definitely false. This approach to negation is\nrelated to the view that a proof of \\(\\neg A\\) is a direct\nfalsification of \\(A\\).\nNegation as cancellation\nNegation as cancellation develops the idea that the content of the\nproposition expressed by \\(\\neg A\\) erases or annihilates the content\nof the proposition expressed by \\(A\\).\nNegation by iteration\nThe idea of negation by iteration is to obtain a negation by a\ndouble application of a connective called “demi-negation”\nin Humberstone 1995, 2000b, or “square root of negation”\nin quantum computational logic, \\(\\sqrt{{\\tt not}}\\), see, for recent\nreferences, Dalla Chiara, Giuntini, Leporini, and Sergioli 2018, Paoli\n2019, and the entry on\n sentence connectives in formal logic.\n This clearly reminds one of the duplex negatio negat in\nnegative concord, see\n Section 1.8.2.\nPerfect negation\nPerfect negation is a rather restrictive notion of negation that\nhas been developed by Avron (1999, 2002) in terms of proof-theoretical\nas well as semantic conditions.\n\n2.5 Negation, rejection, and denial\n\nAs already remarked, negation has been analyzed, for example, as a\ntruth-functional operator, a modal operator, a propositional attitude,\nand a speech act. The exact relation between negation as a connective,\nthe propositional attitude of rejection and, notably, the speech act\nof denial is contentious. There is, as a kind of orthodox view, a\nthesis defended by Frege (1919) and Geach (1965), namely that denying\n\\(A\\) is the same as asserting \\(A\\)’s negation. This view implies\nwhat Ripley (2011b, 623) calls the denial\nequivalence:\n\n\nthat to assert the negation of a content \\(A\\) is equivalent, in its\nconversational effects and commitments carried, to denying \\(A\\). \n\n\n(Note that Parsons (1984) refers to the claim that denying \\(A\\) is\nalways the same as asserting \\(\\osim A\\) as the “Equivalence\nThesis.”) There is, however, no clear syntactic restriction on\nspeech acts of denial, as denials can be realized not only by\nassertions of negated sentences but, for example, also by means of\nirony. Moreover, whereas negated sentences can be embedded into\ncompound sentences, speech acts cannot be constituents of other speech\nacts. Therefore, if it is held that to deny is to\nassert a negation, the idea is that acts of denial can be analyzed as\nassertions of (propositions expressed by) negated sentences. It may,\nfor instance, be held that it is revealing to understand denials of\n\\(A\\) as assertions of \\(© A\\), for some contrary-forming negation\noperator \\(©\\).\n\nBut there is also a position called “rejectivism” defended\nby, for example, Price (1983, 1990), Smiley (1996), and Rumfitt\n(2000). Lloyd Humberstone (2000a: 331) characterizes rejectivism as\nfollows:\n\n\nWhether assent (“acceptance”) and dissent\n(“rejection”) are thought of as speech acts or as\npropositional attitudes, the idea of rejectivism is that a\ngrasp of the distinction between them is prior to our understanding of\nnegation as a sentence, this operator then being explicable as\napplying to \\(A\\) to yield something assent to which is tantamount to\ndissent from \\(A\\).\n\n\nAt issue is the conceptual priority of the notions of assertion and\ndenial over the concept of negation. But if the notion of denial is\nconceptually prior to the concept of negation, one may wonder why\nnegation is needed at all and how Frege’s argument that an\naccount of negation in terms of denial does not make sense of embedded\nnegations can be met.\n\nAs Ripley (2011b) remarks, rejectivists are typically inferentialists,\ni.e., they hold that the meaning of the logical operations can be\nexplicated in terms of meaning-conveying rules. If inferentialism is\ndeveloped in terms of rules for asserting and rules\nfor denying compound formulas (as, for example, in Price 1983, 1990;\nRumfitt 2000) according to Ripley (2011b), the above questions can be\nanswered by explaining that negation is a switch between warranted\nassertability conditions and warranted deniability conditions. This\nrole of negation is similar to the role strong negation in\nNelson’s logics plays in turning support of truth conditions\ninto support of falsity condition, and vice versa. Price\n(1990, 225) argues that\n\n\nif we allow that (an utterance of) \\(\\osim P\\) may properly be\nregarded both as a denial with content \\(P\\) and as an assertion with\ncontent \\(\\osim P\\), then Frege’s argument is powerless; for in\nthis case the latter reading is available to explain the contribution\nof \\(\\osim P\\) to complex constructions, in the standard way.\n\n\nBut one may require more from the rejectivist, namely that every\nformula is logically equivalent to a formula in what Humberstone\n(2000a, Footnote 10) calls “Bendall normal form”, namely\nto a formula that contains at most one occurrence of the negation sign\nas the principal connective. According to Bendall (1979, 68), the\nredundancy in this sense of the embedding of a negation operator,\n\n\nopens the way for an attempt to construe the meaning of negation as\nderiving from the mental or behavioral phenomena of judgment,\ndisbelief, and denial.\n\n\nThe normal form result holds for classical propositional logic\n(CPL) in the connectives \\(\\osim\\), \\(\\wedge\\),\n\\(\\vee\\), and \\(\\rightarrow\\). As Humberstone points out, it fails for\nthe negation, conjunction, disjunction fragment of\nCPL, since in classical propositional logic the\nBendall normal form (bnf) of a conjunction of atomic formulas \\((p\n\\wedge \\osim q)\\) is \\(\\osim (p \\rightarrow q)\\). Moreover, the\ntranslation of \\((\\osim p \\rightarrow q)\\) into bnf is \\((p \\vee q)\\),\nand the translation of \\(\\osim \\osim p\\) is \\(p\\). These pairs of\nformulas are not logically equivalent in intuitionistic propositional\nlogic (IPL). The translation of \\((\\osim p\n\\rightarrow \\osim q)\\) into bnf is \\((q \\rightarrow p)\\), which is not\nlogically equivalent to \\((\\osim p \\rightarrow \\osim q)\\) in\nN3 and N4. An in-depth investigation\nof sequent calculi using formulas prefixed by an assertion sign [+] or\na rejection sign [–], understood as non-embeddable force\nindicators, can be found in Bendall 1978, Humberstone 2000a.\n\nHumberstone (2000a, 368) challenges rejectivism, by asking the\nrejectivists to “show how the claim for the conceptual priority\nof rejection over negation is any more plausible than the\ncorresponding claim for the conceptual priority of alterjection over\ndisjunction—or indeed, ambi-assertion over conjunction,”\nwhere alterjection (ambi-assertion) is the supposedly primitive speech\nact the linguistic embodiment of which is disjunction\n(conjunction).\n\nAnother way of repulsing the denial equivalence is to argue that\ndenial and rejection are conceptually independent from the concept of\nnegation. Such an independence is defended, for example in van der\nSandt and Maier 2003\n (Other Internet Resources)\n and Priest 2006, Chapter 6. As mentioned in the\n supplement, section 3,\n according to Priest negation is for the main part a\ncontradictory-forming operator. Nevertheless, Priest believes that\nthere exist “dialetheia”, sentences \\(A\\) and \\(\\osim A\\)\nthat are both true. In the\n dialetheism\n entry, Berto, Priest, and Weber explain that\n\n\na dialetheist manifests her dialetheism in accepting, together with\nthe LNC [Law of Non-Contradiction], sentences that are inconsistent\nwith it, that is, true sentences whose negations are true:\ndialetheias.\n\n\nThis view seems to preclude dialetheists from expressing disagreement\nconcerning \\(A\\) as cases in which one person asserts \\(A\\) and\nanother person asserts \\(\\osim A\\). A dialetheist might assert \\(\\osim\nA\\) without disagreeing with \\(A\\). Therefore, if the assertion of\n\\(\\osim A\\) is declared to be conceptually independent from the denial\nof \\(A\\), disagreement concerning \\(A\\) can be represented as cases in\nwhich one person asserts \\(A\\) and another person denies \\(A\\). A\ncritical discussion of this approach may be found in Ripley 2011b.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Almukdad, A. and D. Nelson, 1984, “Constructible falsity and\ninexact predicates”, <em>Journal of Symbolic Logic</em>, 49:\n231–233.",
                "Alxatib, S. and F. J. Pelletier, 2011, “The psychology of\nvagueness: Borderline cases and contradictions”, <em>Mind and\nLanguage</em>, 26: 287–326.",
                "Aristotle, [<em>Cat.</em>] and [<em>De Int.</em>], <em>Categories\nand De Interpretatione</em>, ed. and trans. by J. Ackrill, Oxford:\nClarendon, 1963.",
                "–––, [Met.], <em>Metaphysics</em>, H. Apostle\n(ed.), Bloomington: Indiana University Press, 1966.",
                "–––, <em>Prior Analytics</em>, trans. Hugh\nTredinnick, Cambridge: Harvard University Press, 1967.",
                "–––, [<em>Soph. Elen.</em>], <em>Sophistici\nElenchi</em>, translated as <em>On Sophistical Refutations</em>, by W.\nA. Pickard-Cambridge, online book, Raleigh: Alex Catalogue.",
                "Atlas, J. D., 1977, “Negation, ambiguity, and\npresupposition”, <em>Linguistics and Philosophy</em>, 1:\n321–36.",
                "–––, 2012, “Negation”, in K. Allan\nand K. Jaszczolt (eds.), <em>Cambridge Handbook of Pragmatics</em>,\n351–376. Cambridge: Cambridge University Press.",
                "Avron, A., 1999, “Negation: Two points of view”, in\nGabbay and Wansing 1999: 3–22.",
                "–––, 2002, “On negation, completeness and\nconsistency”, in D. Gabbay and F. Guenthner (eds.), <em>Handbook\nof Philosophical Logic, vol. 9</em>, 287–319, Dordrecht:\nKluwer.",
                "van der Auwera, J., 1996, “Modality: The three-layered\nscalar square”, <em>Journal of Semantics</em>, 13:\n181–95.",
                "–––, 2010, “On the diachrony of\nnegation”, in Horn 2010b: 73–109.",
                "Ayer, A. J., 1952, “Negation”, <em>Journal of\nPhilosophy</em>, 49: 797–815.",
                "Bar-Asher Siegal, E., 2015, “The case for external\nsentential negation: Evidence from Jewish Babylonian Aramaic”,\n<em>Linguistics</em>, 53: 1031–1078.",
                "Barker, C., 2018, “Negative polarity as scope\nmarking”, <em>Linguistics and Philosophy,</em>, 41:\n483–510.",
                "Bartsch, R., 1973, “‘Negative transportation’\ngibt es nicht”, <em>Linguistische Berichte</em>, 27:\n1–7.",
                "Beaver, D. and B. Clark, 2008, <em>Sense and Sensitivity: How\nFocus Determines Meaning</em>, Oxford: Wiley-Blackwell.",
                "Belnap, N. D., 1977a, “A useful four-valued logic”, in\nJ.M. Dunn and G. Epstein (eds.) <em>Modern Uses of Multiple-Valued\nLogic</em>, 5–37, Dordrecht: Reidel.",
                "–––, 1977b, “How a computer should\nthink”, in G. Ryle (ed.), <em>Contemporary Aspects of\nPhilosophy</em>, 30–56, Stocksfield: Oriel Press.",
                "Bendall, K., 1978, “Natural deduction, separation, and the\nmeaning of logical operators”, <em>Journal of Philosophical\nLogic</em>, 7: 245–276.",
                "–––, 1979, “Negation as a sign of negative\njudgment”, <em>Notre Dame Journal of Formal Logic</em>, 20:\n68–76.",
                "van Benthem, J., 1979, “What Is Dialectical Logic?”,\n<em>Erkenntnis</em>, 14: 333–347.",
                "Bergson, H., 1911, <em>Creative Evolution</em>, trans. A.\nMitchell, New York: Modern.",
                "Berto, F., 2014, “A Modality Called\n‘Negation’”, <em>Mind</em>, 124: 761–793.",
                "Berto, F. and G. Restall, 2019, “Negation on the Australian\nPlan”, <em>Journal of Philosophical Logic</em>,\nhttps://doi.org/10.1007/s10992-019-09510-2.",
                "Bimbó, K. and J.M. Dunn, 2008, <em>Generalized Galois\nLogics. Relational Semantics of Nonclassical Logical Calculi</em>,\nStanford: CSLI Publications.",
                "Birkhoff, G. and J. von Neumann, 1936, “The logic of quantum\nmechanics”, <em>The Annals of Mathematics</em>, 37:\n823–843.",
                "Blanchette, F., 2009, <em>English Negative Concord, Negative\nPolarity, and Double Negation</em>, Ph.D. Dissertation, CUNY Graduate\nCenter, New York\n [<a href=\"https://tinyurl.com/y5z89efk\" target=\"other\">Blanchette 2015 available online</a>].",
                "Bogen, James, 1991, “Aristotelian contraries”,\n<em>Topoi</em>, 10: 53–66.",
                "Bosanquet, B., 1888, <em>Logic, Vol. 1</em>, Oxford:\nClarendon.",
                "Braakhuis, H.A.G., 1979, <em>De 13de eeuwse tractaten over\nsyncategorematische termen</em>, University of Leiden, Ph.D.\nthesis.",
                "Brown, P. and C. Levinson, 1987, <em>Politeness: Some Universals\nin Language Usage</em>, Cambridge: Cambridge University Press.",
                "Burton-Roberts, Noel, 1989, <em>The Limits to Debate: A Revised\nTheory of Semantic Presupposition</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1999, “Presupposition-cancellation\nand metalinguistic negation: A reply to Carston”, <em>Journal of\nLinguistics</em>, 25: 347–364.",
                "Carston, R., 1996, “Metalinguistic negation and echoic\nuse”, <em>Journal of Linguistics</em>, 25: 309–30.",
                "–––, 1999, “Negation, presupposition and\nmetarepresentation: A response to Noel Burton-Roberts”,\n<em>Journal of Linguistics</em>, 25: 365–389.",
                "Chellas, B. F., 1980, <em>Modal Logic. An Introduction</em>,\nCambridge: Cambridge University Press.",
                "Chierchia, G., 2013, <em>Logic in Logic in Grammar: Polarity, Free\nChoice, and Intervention</em>, Oxford: Oxford University Press.",
                "Clark, K., 1978, “Negation as Failure”, in H. Gallaire\nand J. Minker (eds.), <em>Logic and Data Bases</em>, 292–322,\nPlenum Press: New York.",
                "Colacito, A., D. de Jongh and A. L. Vargas, 2017,\n“Subminimal negation”, <em>Soft Computing</em>, 21:\n165–174.",
                "Collins, C. and P. Postal, 2014, <em>Classical NEG-Raising: An\nEssay in the Syntax of Negation</em>, Cambridge, MA: MIT Press.",
                "–––, 2018, “Disentangling two distinct\nnotions of NEG raising”, <em>Semantics and Pragmatics</em>,\n11.5: 1–21 (Early access version).\n [<a href=\"https://tinyurl.com/y297wluk\" target=\"other\">Collins and Postal 2018 available online.</a>]",
                "Copeland B.J., 1979, “On when a semantics is not a\nsemantics”, <em>Journal of Philosophical Logic</em>, 8:\n399–413.",
                "Dahl, Ö., 2010, “Typology of negation”, in Horn\n2010b: 9–38.",
                "Dalla Chiara, M.L., R. Giuntini, R. Leporini, and G. Sergioli,\n2018, <em>Quantum Computation and Logic. How Quantum Computers Have\nInspired Logical Investigations</em>, Dordrecht: Springer.",
                "De, M., 2011, <em>Negation in Context</em>, Ph.D. thesis,\nUniversity of St Andrews, Scotland.",
                "–––, 2013, “Empirical negation”,\n<em>Acta Analytica</em>, 28: 49–69.",
                "De, M. and H. Omori, 2018, “There is more to negation than\nmodality”, <em>Journal of Philosophical Logic</em>, 47:\n281–299.",
                "Došen, K., 1984, “Negative modal operators in\nintuitionistic logic”, <em>Publications de l’Institut\nMathématique. Nouvelle Série</em>, 35(49): 3–14.\n [<a href=\"https://eudml.org/doc/255086\" target=\"other\">Došen 1984 also available online</a>].",
                "–––, 1986, “Negation as a modal\noperator”, <em>Reports on Mathematical Logic</em>, 20:\n15–27.",
                "–––, 1999, “Negation in the Light of Modal\nLogic”, in Gabbay and Wansing 1999: 77–86.",
                "Ducrot, O., 1972, <em>Dire et ne pas dire</em>, Paris:\nHermann.",
                "–––, 1973, <em>La preuve et le dire</em>, Tours:\nMame.",
                "Dummett, M., 1996, <em>The seas of language</em>, Oxford: Oxford\nUniversity Press.",
                "Dunn, J.M., 1976, “Intuitive semantics for first-degree\nentailments and ‘coupled trees’”, <em>Philosophical\nStudies</em>, 29: 149–168.",
                "–––, 1993, “Star and perp: Two treatments\nof negation”, in J.Tomberlin (ed.), <em>Philosophical\nPerspectives (Philosophy of Language and Logic)</em>, 7,\n331–357.",
                "–––, 1996, “Generalized ortho\nnegation”, in Wansing 1996: 3–26.",
                "–––, 1999, “A comparative study of various\nmodel-theoretic treatments of negation: a history of formal\nnegation”, in Gabbay and Wansing 1999: 23–51.",
                "–––, 2000, “Partiality and its\ndual”, <em>Studia Logica</em>, 66: 5–40.",
                "Dunn, J.M. and C. Zhou, 2005, “Negation in the context of\ngaggle theory”, <em>Studia Logica</em>, 80: 235–264.",
                "Englebretsen, G., 1981, <em>Logical Negation</em>, Assen: Van\nGorcum.",
                "Espinal, M.T., 1992, “Expletive negation and logical\nabsorption”, <em>The Linguistic Review</em>, 9:\n333–358.",
                "Fauconnier, G., 1975, “Polarity and the scale\nprinciple”, in <em>CLS 11</em>, 188–199. Chicago: Chicago\nLinguistic Society.",
                "von Fintel, K., 1997, “Bare plurals, bare conditionals, and\n<em>only</em>”, <em>Journal of Semantics</em>, 14:\n1–56.",
                "–––, 2004, “Would you believe it? The king\nof France is back”, in A. Bezuidenhout and M. Reimer (eds.),\n<em>Descriptions and Beyond</em>, 269–96, Oxford: Oxford\nUniversity Press.",
                "Fodor, J. D., 1970, <em>The Linguistic Description of Opaque\nContexts</em>, Ph.D. thesis, MIT.",
                "–––, 1979, “In defense of the truth-value\ngap”, in D. Dinneen and C.-K. Oh (eds.), <em>Syntax and\nSemantics 11: Presupposition</em>, 199–224, New York: Academic\nPress.",
                "Frege, G., 1892, “On Sinn and Bedeutung”, in M. Beaney\n(ed.), <em>The Frege Reader</em>, 151–71, Oxford:\nBlackwell.",
                "–––, 1919, “Negation”, in M. Beaney\n(ed.), <em>The Frege Reader</em>, 346–61, Oxford:\nBlackwell.",
                "Gabbay, D.M., 1988, “What is negation in a system?”,\nin F. Drake and J. Truss (eds.), <em>Logic Colloquium ’86</em>,\n95–112, Amsterdam: Elsevier.",
                "Gabbay, D.M., F.J. Pelletier, and J. Woods (eds.), 2012,\n<em>Logic: A History of its Central Concepts, Vol. 11 (Handbook of the\nHistory of Logic)</em>, Amsterdam: Elsevier.",
                "Gabbay, D.M. and H. Wansing, 1996, “What is negation in a\nsystem? Negation in structured consequence relations”, in A.\nFuhrmann and H. Rott (eds.), <em>Logic, Action and Information</em>,\n328–350, Berlin: de Gruyter.",
                "––– (eds.), 1999, <em>What is Negation?</em>,\nDordrecht: Kluwer.",
                "Gajewski, J., 2007, “Neg-raising and polarity”,\n<em>Linguistics and Philosophy</em>, 30: 289–328.",
                "Gazdar, G., 1979, <em>Pragmatics: Implicature, Presupposition, and\nLogical Form</em>, New York: Academic Press.",
                "Geach, P.T., 1965, “Assertion”, <em>The Philosophical\nReview</em>, 74: 449–465.",
                "–––, 1972, <em>Logic Matters</em>, Berkeley:\nUniversity of California Press.",
                "Geurts, B., 1998, “The mechanisms of denial”,\n<em>Language</em>, 74: 274–307.",
                "Giannakidou, A., 2011, “Negative and positive polarity\nitems”, in K. von Heusinger, C. Maienborn and P. Portner (eds.),\n<em>Semantics: An International Handbook of Natural Language\nMeaning</em>, Vol. 2, 1660–1712, Berlin: de Gruyter.",
                "Giora, R., 2007, “A good Arab is not a dead Arab”: On\nthe accessibility of negated concepts, in I. Kecskes &amp; L. Horn\n(eds.), <em>Explorations in Pragmatics: Linguistic, Cognitive and\nIntercultural Aspects</em>, 129–162, Berlin: Mouton de\nGruyter.",
                "Givón, T., 1978, “Negation in language: pragmatics,\nfunction, ontology”, in P. Cole (ed.), <em>Syntax and Semantics\n9: Pragmatics</em>, 69–112, New York: Academic Press.",
                "Goldblatt, R., 1974, “Semantic analysis of\northologic”, <em>Journal of Philosophical Logic</em>, 3:\n19–35.",
                "Goré, R., 2000, “Dual intuitionistic logic\nrevisited”, in R. Dyckhoff (ed.), <em>Proceedings of the\nInternational Conference on Automated Reasoning with Analytic Tableaux\nand Related Methods</em>, 252–267, Berlin: Springer.",
                "Green, L., 2002, <em>African American English: A Linguistic\nIntroduction</em>, Cambridge: Cambridge University Press.",
                "Grice, H. P., 1989, <em>Studies in the Way of Words</em>,\nCambridge: Harvard University Press.",
                "Grimm, P., 2005, “What is a contradiction?”, in G.\nPriest, JC Beall, and B. Armour-Garb (eds.), <em>The Law of\nNon-Contradiction: New Philosophcial Essays</em>, 49–72, Oxford:\nOxford University Press.",
                "Gurevich, Y., 1977, “Intuitionistic logic with strong\nnegation”, <em>Studia Logica</em>, 36: 49–59.",
                "Haegeman, L. 2000, “Negative preposing, negative inversion,\nand the split CP”, in L. Horn and Y. Kato (eds.), <em>Negation\nand Polarity: Syntactic and Semantic Perspectives</em>, Oxford: Oxford\nUniversity Press, 147–192.",
                "Hazen, A., 1992, “Subminimal negation”, <em>Philosophy\nDepartment Preprint</em>, 1/92, University of Melbourne.",
                "Heine, B. and T. Kuteva, 2007, <em>The Genesis of Grammar</em>,\nOxford: Oxford University Press.",
                "Henry, D., 1967, <em>The Logic of St. Anselm</em>, Oxford:\nClarendon.",
                "Heyting, A., 1956, <em>Intuitionism: An Introduction</em>,\nAmsterdam: North-Holland Publishing.",
                "Hintikka, J., 1968, “Epistemic Logic and the Methods of\nPhilosophical Analysis”, <em>Australasian Journal of\nPhilosophy</em>, 46: 37–51.",
                "–––, <em>Logic, Language-Games and Information:\nKantian Themes in the Philosophy of Logic</em>, Oxford: Clarendon\nPress.",
                "Hoffmann, M., 1987, <em>Negatio Contrarii: A Study of Latin\nLitotes</em>, Assen: Van Gorcum.",
                "Hopkins, J., 1972, <em>A Companion to the Study of St.\nAnselm</em>, Minneapolis: University of Minnesota Press.",
                "Horn, L.R., 1978, “Remarks on neg-raising”, in P. Cole\n(ed.), <em>Syntax and Semantics 9: Pragmatics</em>, 129–220, New\nYork: Academic Press.",
                "–––, 1989, <em>A Natural History of\nNegation</em>, Chicago: University of Chicago Press. Reissued,\nStanford, CA: CSLI Publications, 2001.",
                "–––, 2000, “From <em>if</em> to\n<em>iff</em>: Conditional perfection as pragmatic\nstrengthening”, <em>Journal of Pragmatics</em>, 32:\n289–326.",
                "–––, 2005, “An un-paper for the\nunsyntactician”, in S. Mufwene et al. (eds.), <em>Polymorphous\nLinguistics: Jim McCawley’s Legacy</em>, 329–365,\nCambridge: MIT Press.",
                "–––, 2010a, “Multiple negation in English\nand other languages”, in Horn 2010b: 111–148.",
                "––– (ed.), 2010b, <em>The Expression of\nNegation</em>, Berlin: Mouton de Gruyter.",
                "–––, 2012, “Histoire d’*O: Lexical\npragmatics and the geometry of opposition”, in J.-Y.\nBéziau and G. Payette (eds.), <em>The Square of Opposition: A\nGeneral Framework for Cognition</em>, 383–416, Bern: Peter\nLang.",
                "–––, 2015, “On the contrary: Disjunctive\nsyllogism and pragmatic strengthening”, in A. Koslow and A.\nBuchsbaum (eds.), <em>The Road to Universal Logic</em>, 151–201.\nHeidelberg: Birkhäuser (Springer).",
                "–––, 2016, “Licensing NPIs: Some negative\n(and positive) results”, in P. Larrivée and C. Lee\n(eds.), <em>Negation and Polarity: Experimental Perspectives</em>,\n281–306. Berlin: Springer.",
                "–––, 2017, “Lie-toe-tease: Double\nnegatives and unexcluded middles”, <em>Philosophical\nStudies</em>, 174: 79–103.",
                "–––, 2018, “An (abridged) atlas of\nnegation”, in K. Turner and L. Horn (eds.), <em>Pragmatics,\nTruth and Underspecification: Towards an Atlas of Meaning</em>,\n3–53, Leiden: Brill. (CRiSPI 34.)",
                "Humberstone, L., 1986, “Extensionality in sentence\nposition”, <em>Journal of Philosophical Logic</em>, 15:\n27–54.",
                "–––, 1995, “Negation by iteration”,\n<em>Theoria</em>, 61: 1–24.",
                "–––, 2000a, “The Revival of Rejective\nNegation”, <em>Journal of Philosophical Logic</em>, 29:\n331–381.",
                "–––, 2000b, “Contra-classical\nlogics”, <em>Australasian Journal of Philosophy</em>, 78:\n438–474.",
                "–––, 2003, “Note on contraries and\nsubcontraries”, <em>Noûs</em>, 37: 690–705.",
                "–––, 2005, “Contrariety and\nsubcontrariety: the anatomy of negation (with special reference to an\nexample of J.-Y. Béziau)”, <em>Theoria</em>, 75:\n241–262.",
                "–––, 2011, <em>The Connectives</em>, Cambridge:\nMIT Press.",
                "–––, 2018, “Sentence Connectives in Formal\nLogic”, <em>The Stanford Encyclopedia of Philosophy</em> (Summer\n2018 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/connectives-logic/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/connectives-logic/</a>&gt;.",
                "–––, 2019, “Priest On Negation”, in\nC. Baskent and T.M. Ferguson (eds.), <em>Graham Priest on Dialetheism\nand Paraconsistency</em>, Dordrecht: Springer, 285–341.",
                "Israel, M., 2011, <em>The Grammar of Polarity: Pragmatics,\nSensitivity, and the Logic of Scales</em>, Cambridge: Cambridge\nUniversity Press.",
                "Jackendoff, R., 1969, “An interpretive theory of\nnegation”, <em>Foundations of Language</em>, 5:\n218–241.",
                "Jaspers, D., 2005. <em>Operators in the Lexicon: On the Negative\nLogic of Natural Language</em>, Universiteit Leiden dissertation,\nUtrecht: LOT.",
                "Jespersen, O., 1917, <em>Negation in English and Other\nLanguages</em>, Copenhagen: Høst.",
                "Johansson, I., 1937, “Der Minimalkalkül, ein\nreduzierter intuitionistischer Formalismus”, <em>Compositio\nMathematica</em>, 4: 119–136.",
                "Just, M.A. and Carpenter, P.A., 1971, “Comprehension of\nnegation with quantification”, <em>Journal of Verbal Learning\nand Verbal Behavior</em>, 12: 21–31.",
                "Kamide, N., 2013, “A hierarchy of weak double\nnegations”, <em>Studia Logica</em>, 101: 1277–1297.",
                "–––, 2017, “Paraconsistent double\nnegations as classical and intuitionistic negations”, <em>Studia\nLogica</em>, 105: 1167–1191.",
                "Kamide, N. and H. Wansing, 2012, “Proof theory of\nNelson’s paraconsistent logic: A uniform perspective”,\n<em>Theoretical Computer Science</em>, 415: 1–38.",
                "Kapsner, A., 2014, <em>Logics and Falsifications. A New\nPerspective on Constructivist Semantics</em>, Dordrecht:\nSpringer.",
                "Katz, J., 1972, <em>Semantic Theory</em>, New York: Harper &amp;\nRow.",
                "Keenan, E. and L. Faltz, 1985, <em>Boolean Semantics for Natural\nLanguage</em>, Dordrecht: D. Reidel.",
                "Kiparsky, P. and C. Condoravdi, 2006, “Tracking\nJespersen’s cycle”, in M. Janse (ed.), <em>Proceedings of\nthe Second International Conference of Modern Greek Dialects and\nLinguistic Theory</em>, 172–197. Patras: University of Patras\nPress.",
                "Kleene, S., 1952, <em>Introduction to Metamathematics</em>,\nAmsterdam: North-Holland.",
                "Klima, E., 1964, “Negation in English”, in J. A. Fodor\nand J. J. Katz (eds.), <em>The Structure of Language</em>,\n246–323, Englewood Cliffs: Prentice-Hall.",
                "Kolmogorov, A. N., 1925, “On the principle of excluded\nmiddle”, English translation in J. van Heijenoort (ed.),\n<em>From Frege to Gödel: a Source Book in Mathematical Logic,\n1879–1931</em>(third ed.), Cambridge (Mass.): Harvard University\nPress, 1977, 414–437.",
                "Kürbis, N., 2019, <em>Proof and Falsity: A Logical\nInvestigation</em>, Cambridge, Cambridge University Press.",
                "Labov, W., 1972, “Negative attraction and negative concord\nin English grammar”, <em>Language</em>, 48: 773–818.",
                "Ladusaw, W., 1980, <em>Negative Polarity as Inherent Scope\nRelations</em>, New York: Garland.",
                "–––, 1996, “Negation and polarity\nitems”, in S. Lappin (ed.), <em>Handbook of Contemporary\nSemantic Theory</em>, 299–319. Oxford: Blackwell.",
                "Lahav, O. and A. Avron, 2013, “A Unified Semantic Framework\nfor Fully Structural Propositional Sequent Systems”, <em>ACM\nTransactions on Computational Logic</em>, 14: 27:1–27:33.",
                "Lahav, O., J. Marcos, and J. Zohar, 2017, “Sequent Systems\nfor Negative Modalities”, <em>Logica Universalis</em>, 11:\n345–382.",
                "Lenzen, W., 1996, “Necessary conditions for negation\noperators”, in Wansing 1996: 37–58.",
                "Löbner, S., 2000, “Polarity and natural language:\nPredication, quantification, and negation in particularizing and\ncharacterizing sentences”, <em>Linguistics and Philosophy</em>,\n23: 213–308.",
                "Łukasiewicz, J., 1930, “Philosophical remarks on\nmany-valued systems of propositional logics”, in S. McCall\n(ed.), <em>Polish Logic 1920–1939</em>, 40–65, Oxford:\nClarendon.",
                "Malinowski, G., 1993, <em>Many-valued Logics</em>, Oxford:\nClarendon.",
                "Marcos, J., 2005, “On negation: Pure local rules”,\n<em>Journal of Applied Logic</em>, 3: 185–219.",
                "Mares, E., 2004, <em>Relevant Logic: A Philosophical\nInterpretation</em>, Cambridge: Cambridge University Press.",
                "Mates, B., 1953, <em>Stoic Logic</em>, Berkeley: University of\nCalifornia Press.",
                "McCall, S., 1967, “Contrariety”, <em>Notre Dame\nJournal of Formal Logic</em>, 8: 121–138.",
                "–––, 2012, “A History of\nConnexivity”, in Gabbay, Pelletier, and Woods 2012:\n415–449.",
                "McCawley, J.D., 1991, “Contrastive negation and\nmetalinguistic negation”, <em>Chicago Linguistic Society</em>,\n27.2: 189–206.",
                "Miestamo, M., 2005, <em>Standard Negation: The Negation of\nDeclarative Verbal Main Clauses in a Typological Perspective</em>,\nBerlin: Mouton de Gruyter.",
                "Montague, R., 1973, “The proper treatment of quantification\nin ordinary English”, in K.J.J. Hintikka, J.M.E. Moravcsik, and\nP. Suppes (eds.), <em>Approaches to Natural Language</em>,\n221–242. Dordrecht: Reidel,",
                "Nelson, D., 1949, “Constructible falsity”, <em>Journal\nof Symbolic Logic</em>, 14: 16–26.",
                "–––, 1959, “Negation and separation of\nconcepts in constructive systems”, in A. Heyting (ed.),\n<em>Constructivity in Mathematics</em>, 208–225, Amsterdam:\nNorth-Holland.",
                "Niki, S., forthcoming, “Subminimal Logics in Light of\nVakarelov’s Logic”, <em>Studia Logica</em>, first online\nNovember 1, 2019. doi:10.1007/s11225-019-09884-z",
                "Odintsov, S., 2008, <em>Constructive negations and\nparaconsistency</em>, Dordrecht: Springer.",
                "Omori H. and Wansing, H., 2017, “40 years of FDE: An\nIntroductory Overview”, <em>Studia Logica</em>, 105:\n1021–1049.",
                "–––, 2018,“On Contra-classical variants of\nNelson logic N4 and its classical extension”, <em>Review of\nSymbolic Logic</em>, 11: 805–820.",
                "Onishi, T., 2015, “ Substructural negations”,\n<em>Australasian Journal of Logic</em>, 12: 177–202.",
                "Oesterle, J., 1962, <em>Aristotle: On Interpretation. Commentary\nby St. Thomas and Cajetan</em>, Milwaukee: Marquette University\nPress.",
                "Pacuit, E., 2017, <em>Neighborhood Semantics for Modal Logic</em>,\nDordrecht: Springer.",
                "Paoli, F., 2019, “Bilattice logics and demi-negation”,\nin H. Omori and H. Wansing (ed.), <em>New Essays on Belnap-Dunn\nLogic</em>, 223–243, Dordrecht: Springer.",
                "Parsons, T., 1984, “Assertion, denial, and the liar\nparadox”, <em>Journal of Philosophical Logic</em>, 13:\n137–152.",
                "Payne, T., 1985, “Negation”, in T. Shopen (ed.),\n<em>Language Typology and Syntactic Description, Vol. 1</em>,\n197–242. Cambridge: Cambridge University Press.",
                "Penka, D., 2011, <em>Negative Indefinites</em>, Oxford: Oxford\nUniversity Press.",
                "Peters, S. and D. Westerståhl, 2006, <em>Quantifiers in\nLanguage and Logic</em>, Oxford: Oxford University Press.",
                "Pitts, A., 2009, “Exploring a ‘pragmatic\nambiguity’ of negation”, <em>Language</em>, 87:\n346–368.",
                "Plato, <em>The Sophist</em>, B. Jowett, trans., New York: Random\nHouse, 1937.",
                "Price, H., 1983, “Sense, assertion, Dummett, and\ndenial”, <em>Mind</em>, 92: 161–173.",
                "–––, 1990, “Why ‘not’?”,\n<em>Mind</em>, 99: 221–238.",
                "Priest, G., 1979, “The logic of paradox”, <em>Journal\nof Philosophical Logic</em>, 8: 219–241.",
                "–––, 1999, “What not? A defence of\ndialetheic theory of negation”, in Gabbay and Wansing 1999:\n101–120.",
                "–––, 2006, <em>Doubt Truth to be a Liar</em>,\nOxford: Oxford University Press.",
                "–––, 2008, <em>An Introduction to Non-Classical\nLogic: From Ifs to Is</em>, second edition, Cambridge: Cambridge\nUniversity Press.",
                "–––, 2010, “The logic of the\n<em>catuskoti</em>”, <em>Comparative Philosophy</em>, 1:\n24–54.",
                "Prior, A. N., 2006, “Negation”, in D.M. Borchert\n(ed.), <em>Encyclopedia of Philosophy, 2<sup>nd</sup> ed.</em>, Vol.\n6, 522–530, New York: Macmillan.",
                "Pullum, G., 2002, “Negation”, Chapter 9 in R.\nHuddleston &amp; G. Pullum, <em>The Cambridge Grammar of the English\nLanguage</em>, Cambridge: Cambridge University Press.",
                "Quine, W. V. O., 1960, <em>Word and Object</em>, Cambridge, MA:\nMIT Press.",
                "Ramsey, F. P., 1927, “Facts and Propositions”,\n<em>Proceedings of the Aristotelian Society (Suppl. Vol.)</em>, 7:\n153–170.",
                "Rauszer, C., 1980, <em>An Algebraic and Kripke-style Approach to a\nCertain Extension of Intuitionistic Logic</em>, Dissertationes\nMathematicae 167, Institute of Mathematics, Polish Academy of\nSciences, Warsaw.",
                "Restall, G., 1999, “Negation in relevant logics (How I\nstopped worrying and learned to love the Routley Star)”, in\nGabbay and Wansing 1999: 53–76.",
                "–––, 2000, <em>An Introduction to Substructural\nLogics</em>, London: Routledge, London.",
                "Ripley, D., 2009, <em>Negation in Natural Language</em>, Ph.D.\nDissertation, Philosophy Department, University of North\nCarolina/Chapel Hill\n [<a href=\"https://cdr.lib.unc.edu/record/uuid:8b50aebb-e71a-48a7-881e-d863d2e77ce1\" target=\"other\">Ripley 2009 available online</a>].",
                "–––, 2011a, “Contradictions at the\nborders”, in R. Nouwen, R. van Rooij, U. Sauerland and H.-C.\nSchmitz (eds.), <em>Vagueness in Communication</em>, 169–188,\nBerlin: Springer.",
                "–––, 2011b, “Negation, denial, and\nrejection”, <em>Philosophy Compass</em>, 6: 622–629.",
                "Rooth, M., 1992, “A theory of focus interpretation”,\n<em>Natural Language Semantics</em>, 1: 75–116.",
                "Routley, R. and V. Routley, 1972, “Semantics for first\ndegree entailment”, <em>Noûs</em>, 6: 335–59.",
                "–––, 1985, “Negation and\ncontradiction”, <em>Revista Colombiana de\nMatemáticas</em>, 19: 201–230.",
                "Rumfitt, I., 2000, “”Yes“ and\n”no“”, <em>Mind</em>, 109: 781–823.",
                "Russell, B., 1905, “On denoting”, <em>Mind</em>, 14:\n479–93.",
                "Sánchez Valencia, V., 1994, “Monotonicity in medieval\nlogic”, <em>Language and Cognition</em>, 4: 161–174.",
                "Segerberg, K., 1971, <em>An Essay in Classical Modal Logic</em>,\nvol. 1–3, Uppsala Philosophical Studies, Uppsala\nUniversity.",
                "Seuren, P. and D. Jaspers, 2014, “Logico-cognitive structure\nin the lexicon”, <em>Language</em>, 90: 607–43.",
                "Shramko, Y., 2005, “Dual intuitionistic logic and a variety\nof negations: the logic of scientific research”, <em>Studia\nLogica</em>, 80: 347–367.",
                "Shramko, Y. and H. Wansing, 2011, <em>Truth and Falsehood. An\nInquiry into Generalized Logical Values</em>, Dordrecht:\nSpringer.",
                "Smiley T., 1993, “Can Contradictions Be True?. I”,\n<em>Proceedings of the Aristotelian Society</em>, 67:\n17–34.",
                "–––, 1996, “ Rejection”,\n<em>Analysis</em>, 56:1–9.",
                "Sommers, F. and G. Englebretsen, 2000, <em>An Invitation to Formal\nReasoning: The Logic of Terms</em>, Aldershot: Ashgate.",
                "Speranza, J.L. and L. Horn, 2012, “A brief history of\nnegation”, in Gabbay, Pelletier, and Woods 2012:\n127–174.",
                "Spruyt, J., 1989, <em>Peter of Spain on Composition and\nNegation</em>, Nijmegen: Ingenium.",
                "Strawson, P.F., 1950, “On referring”, <em>Mind</em>,\n59: 320–44.",
                "–––, 1952, <em>Introduction to Logical\nTheory</em>, London: Methuen.",
                "de Swart, H., 2011, <em>Expression and Interpretation of Negation:\nAn OT Typology</em>, Dordrecht: Springer.",
                "Tottie, G. and A. Neukom-Hermann, 2010, Quantifier-negation\ninteraction in English: A corpus linguistic study of\n<em>all...not</em> constructions. In Horn 2010b: 149–185.",
                "Vakarelov, D., 1977, <em>Theory of Negation in Certain Logical\nSystems: Algebraic and Semantic Approach</em>, Ph.D. thesis,\nUniversity of Warsaw.",
                "–––, 1989a, “Intuitive semantics for some\nthree-valued logics connected with information, contrariety and\nsubcontrariety”, <em>Studia Logica</em>, 48: 565–575.",
                "–––, 1989b, “Consistency, Completeness and\nNegations”, in G. Priest, R. Routley, and J. Norman (eds.),\n<em>Paraconsistent Logic: Essays on the Inconsistent</em>,\n328–368, Munich: Philosophia Verlag.",
                "Varzi, A.C. and M. Warglien, 2003, “The Geometry of\nNegation”, <em>Journal of Applied Non-Classical Logics</em>,\n13:9–19.",
                "Wagner, G., 1994, <em>Vivid Logic: Knowledge-Based Reasoning with\nTwo Kinds of Negation</em>, Lecture Notes in Computer Science Volume\n764, Berlin: Springer.",
                "Wansing, H., 1993, <em>The Logic of Information Structures</em>,\nLecture Notes in AI 681, Berlin: Springer.",
                "–––, 1994, “Sequent calculi for normal\nmodal propositional logics”, <em>Journal of Logic and\nComputation</em>, 4: 125–142.",
                "––– (ed.), 1996, <em>Negation. A Notion in\nFocus</em>, Berlin: de Gruyter.",
                "–––, 1998, <em>Displaying Modal Logic</em>,\nDordrecht: Kluwer.",
                "–––, 2001, “Negation”, in L. Goble\n(ed.), <em>The Blackwell Guide to Philosophical Logic</em>,\n415–436, Oxford: Blackwell Publishers.",
                "–––, 2002, “Sequent systems for modal\nlogics”, in D. Gabbay and F. Guenthner (eds.), <em>Handbook of\nPhilosophical Logic. Vol. 8</em>, 61–145, Dordrecht:\nSpringer.",
                "–––, 2005, “Connexive modal logic”,\nin R. Schmidt et al. (eds.), <em>Advances in Modal Logic. Volume\n5</em>, 367–383, London: King’s College Publications.\n [<a href=\"http://www.aiml.net/volumes/volume5/\" target=\"other\">Wansing 2005 also available online</a>]",
                "–––, 2006, “Contradiction and contrariety.\nPriest on negation”, in J. Malinowski and A. Pietruszczak\n(eds.), <em>Essays in Logic and Ontology</em>, 81–93, Amsterdam:\nRodopi.",
                "–––, 2008, “Constructive negation,\nimplication, and co-implication”, <em>Journal of Non-Classical\nLogics</em>, 18: 341–364.",
                "–––, 2016a, “Falsification, natural\ndeduction, and bi-intuitionistic logic”, <em>Journal of Logic\nand Computation</em>, 26: 425–450 (first online 2013).",
                "–––, 2016b, “On split negation, strong\nnegation, information, falsification, and verification”, in K.\nBimbó (ed.), <em>J. Michael Dunn on Information Based\nLogics</em>, 161–189: Dordrecht: Springer.",
                "Wansing, H. and D. Skurt, 2018, “Negation as cancellation,\nconnexive logic, and qLPm”, <em>Australasian Journal of\nLogic</em>, 15: 476–488.",
                "Wason, P.C., 1965, “The contexts of plausible denial”,\n<em>Journal of Verbal Learning and Verbal Behavior</em>, 4:\n7–11.",
                "Wilson, D., 1975, <em>Presupposition and Non-Truth-Conditional\nSemantics</em>, New York: Academic Press.",
                "Wittgenstein, Ludwig, 1953, <em>Philosophical Investigations</em>,\ntrans. E. Anscombe, New York: Macmillan.",
                "Wood, L.M., 1933, “The paradox of negative judgment”,\n<em>Philosophical Review</em>, 42: 412–23.",
                "van der Wouden, T., 1996, <em>Negative Contexts: Collocation,\nPolarity, and Multiple Negation</em>, London: Routledge.",
                "von Wright, G.H., 1959, “On the logic of negation”,\n<em>Societas Scientiarum Fennica, Commentationes\nPhysico-Mathematicae</em>, 22: 1–30.",
                "Zeijlstra, H., 2004, <em>Sentential Negation and Negative\nConcord</em>, Utrecht: LOT.",
                "Zwarts, F., 1998, “Three types of polarity”, in F.\nHamm and E. Hinrichs (eds.), <em>Plural Quantification</em>,\n177–238. Dordrecht: Kluwer."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Almukdad, A. and D. Nelson, 1984, “Constructible falsity and\ninexact predicates”, <em>Journal of Symbolic Logic</em>, 49:\n231–233.</li>\n<li>Alxatib, S. and F. J. Pelletier, 2011, “The psychology of\nvagueness: Borderline cases and contradictions”, <em>Mind and\nLanguage</em>, 26: 287–326.</li>\n<li>Aristotle, [<em>Cat.</em>] and [<em>De Int.</em>], <em>Categories\nand De Interpretatione</em>, ed. and trans. by J. Ackrill, Oxford:\nClarendon, 1963.</li>\n<li>–––, [Met.], <em>Metaphysics</em>, H. Apostle\n(ed.), Bloomington: Indiana University Press, 1966.</li>\n<li>–––, <em>Prior Analytics</em>, trans. Hugh\nTredinnick, Cambridge: Harvard University Press, 1967.</li>\n<li>–––, [<em>Soph. Elen.</em>], <em>Sophistici\nElenchi</em>, translated as <em>On Sophistical Refutations</em>, by W.\nA. Pickard-Cambridge, online book, Raleigh: Alex Catalogue.</li>\n<li>Atlas, J. D., 1977, “Negation, ambiguity, and\npresupposition”, <em>Linguistics and Philosophy</em>, 1:\n321–36.</li>\n<li>–––, 2012, “Negation”, in K. Allan\nand K. Jaszczolt (eds.), <em>Cambridge Handbook of Pragmatics</em>,\n351–376. Cambridge: Cambridge University Press.</li>\n<li>Avron, A., 1999, “Negation: Two points of view”, in\nGabbay and Wansing 1999: 3–22.</li>\n<li>–––, 2002, “On negation, completeness and\nconsistency”, in D. Gabbay and F. Guenthner (eds.), <em>Handbook\nof Philosophical Logic, vol. 9</em>, 287–319, Dordrecht:\nKluwer.</li>\n<li>van der Auwera, J., 1996, “Modality: The three-layered\nscalar square”, <em>Journal of Semantics</em>, 13:\n181–95.</li>\n<li>–––, 2010, “On the diachrony of\nnegation”, in Horn 2010b: 73–109.</li>\n<li>Ayer, A. J., 1952, “Negation”, <em>Journal of\nPhilosophy</em>, 49: 797–815.</li>\n<li>Bar-Asher Siegal, E., 2015, “The case for external\nsentential negation: Evidence from Jewish Babylonian Aramaic”,\n<em>Linguistics</em>, 53: 1031–1078.</li>\n<li>Barker, C., 2018, “Negative polarity as scope\nmarking”, <em>Linguistics and Philosophy,</em>, 41:\n483–510.</li>\n<li>Bartsch, R., 1973, “‘Negative transportation’\ngibt es nicht”, <em>Linguistische Berichte</em>, 27:\n1–7.</li>\n<li>Beaver, D. and B. Clark, 2008, <em>Sense and Sensitivity: How\nFocus Determines Meaning</em>, Oxford: Wiley-Blackwell.</li>\n<li>Belnap, N. D., 1977a, “A useful four-valued logic”, in\nJ.M. Dunn and G. Epstein (eds.) <em>Modern Uses of Multiple-Valued\nLogic</em>, 5–37, Dordrecht: Reidel.</li>\n<li>–––, 1977b, “How a computer should\nthink”, in G. Ryle (ed.), <em>Contemporary Aspects of\nPhilosophy</em>, 30–56, Stocksfield: Oriel Press.</li>\n<li>Bendall, K., 1978, “Natural deduction, separation, and the\nmeaning of logical operators”, <em>Journal of Philosophical\nLogic</em>, 7: 245–276.</li>\n<li>–––, 1979, “Negation as a sign of negative\njudgment”, <em>Notre Dame Journal of Formal Logic</em>, 20:\n68–76.</li>\n<li>van Benthem, J., 1979, “What Is Dialectical Logic?”,\n<em>Erkenntnis</em>, 14: 333–347.</li>\n<li>Bergson, H., 1911, <em>Creative Evolution</em>, trans. A.\nMitchell, New York: Modern.</li>\n<li>Berto, F., 2014, “A Modality Called\n‘Negation’”, <em>Mind</em>, 124: 761–793.</li>\n<li>Berto, F. and G. Restall, 2019, “Negation on the Australian\nPlan”, <em>Journal of Philosophical Logic</em>,\nhttps://doi.org/10.1007/s10992-019-09510-2.</li>\n<li>Bimbó, K. and J.M. Dunn, 2008, <em>Generalized Galois\nLogics. Relational Semantics of Nonclassical Logical Calculi</em>,\nStanford: CSLI Publications.</li>\n<li>Birkhoff, G. and J. von Neumann, 1936, “The logic of quantum\nmechanics”, <em>The Annals of Mathematics</em>, 37:\n823–843.</li>\n<li>Blanchette, F., 2009, <em>English Negative Concord, Negative\nPolarity, and Double Negation</em>, Ph.D. Dissertation, CUNY Graduate\nCenter, New York\n [<a href=\"https://tinyurl.com/y5z89efk\" target=\"other\">Blanchette 2015 available online</a>].</li>\n<li>Bogen, James, 1991, “Aristotelian contraries”,\n<em>Topoi</em>, 10: 53–66.</li>\n<li>Bosanquet, B., 1888, <em>Logic, Vol. 1</em>, Oxford:\nClarendon.</li>\n<li>Braakhuis, H.A.G., 1979, <em>De 13de eeuwse tractaten over\nsyncategorematische termen</em>, University of Leiden, Ph.D.\nthesis.</li>\n<li>Brown, P. and C. Levinson, 1987, <em>Politeness: Some Universals\nin Language Usage</em>, Cambridge: Cambridge University Press.</li>\n<li>Burton-Roberts, Noel, 1989, <em>The Limits to Debate: A Revised\nTheory of Semantic Presupposition</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1999, “Presupposition-cancellation\nand metalinguistic negation: A reply to Carston”, <em>Journal of\nLinguistics</em>, 25: 347–364.</li>\n<li>Carston, R., 1996, “Metalinguistic negation and echoic\nuse”, <em>Journal of Linguistics</em>, 25: 309–30.</li>\n<li>–––, 1999, “Negation, presupposition and\nmetarepresentation: A response to Noel Burton-Roberts”,\n<em>Journal of Linguistics</em>, 25: 365–389.</li>\n<li>Chellas, B. F., 1980, <em>Modal Logic. An Introduction</em>,\nCambridge: Cambridge University Press.</li>\n<li>Chierchia, G., 2013, <em>Logic in Logic in Grammar: Polarity, Free\nChoice, and Intervention</em>, Oxford: Oxford University Press.</li>\n<li>Clark, K., 1978, “Negation as Failure”, in H. Gallaire\nand J. Minker (eds.), <em>Logic and Data Bases</em>, 292–322,\nPlenum Press: New York.</li>\n<li>Colacito, A., D. de Jongh and A. L. Vargas, 2017,\n“Subminimal negation”, <em>Soft Computing</em>, 21:\n165–174.</li>\n<li>Collins, C. and P. Postal, 2014, <em>Classical NEG-Raising: An\nEssay in the Syntax of Negation</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2018, “Disentangling two distinct\nnotions of NEG raising”, <em>Semantics and Pragmatics</em>,\n11.5: 1–21 (Early access version).\n [<a href=\"https://tinyurl.com/y297wluk\" target=\"other\">Collins and Postal 2018 available online.</a>]</li>\n<li>Copeland B.J., 1979, “On when a semantics is not a\nsemantics”, <em>Journal of Philosophical Logic</em>, 8:\n399–413.</li>\n<li>Dahl, Ö., 2010, “Typology of negation”, in Horn\n2010b: 9–38.</li>\n<li>Dalla Chiara, M.L., R. Giuntini, R. Leporini, and G. Sergioli,\n2018, <em>Quantum Computation and Logic. How Quantum Computers Have\nInspired Logical Investigations</em>, Dordrecht: Springer.</li>\n<li>De, M., 2011, <em>Negation in Context</em>, Ph.D. thesis,\nUniversity of St Andrews, Scotland.</li>\n<li>–––, 2013, “Empirical negation”,\n<em>Acta Analytica</em>, 28: 49–69.</li>\n<li>De, M. and H. Omori, 2018, “There is more to negation than\nmodality”, <em>Journal of Philosophical Logic</em>, 47:\n281–299.</li>\n<li>Došen, K., 1984, “Negative modal operators in\nintuitionistic logic”, <em>Publications de l’Institut\nMathématique. Nouvelle Série</em>, 35(49): 3–14.\n [<a href=\"https://eudml.org/doc/255086\" target=\"other\">Došen 1984 also available online</a>].</li>\n<li>–––, 1986, “Negation as a modal\noperator”, <em>Reports on Mathematical Logic</em>, 20:\n15–27.</li>\n<li>–––, 1999, “Negation in the Light of Modal\nLogic”, in Gabbay and Wansing 1999: 77–86.</li>\n<li>Ducrot, O., 1972, <em>Dire et ne pas dire</em>, Paris:\nHermann.</li>\n<li>–––, 1973, <em>La preuve et le dire</em>, Tours:\nMame.</li>\n<li>Dummett, M., 1996, <em>The seas of language</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Dunn, J.M., 1976, “Intuitive semantics for first-degree\nentailments and ‘coupled trees’”, <em>Philosophical\nStudies</em>, 29: 149–168.</li>\n<li>–––, 1993, “Star and perp: Two treatments\nof negation”, in J.Tomberlin (ed.), <em>Philosophical\nPerspectives (Philosophy of Language and Logic)</em>, 7,\n331–357.</li>\n<li>–––, 1996, “Generalized ortho\nnegation”, in Wansing 1996: 3–26.</li>\n<li>–––, 1999, “A comparative study of various\nmodel-theoretic treatments of negation: a history of formal\nnegation”, in Gabbay and Wansing 1999: 23–51.</li>\n<li>–––, 2000, “Partiality and its\ndual”, <em>Studia Logica</em>, 66: 5–40.</li>\n<li>Dunn, J.M. and C. Zhou, 2005, “Negation in the context of\ngaggle theory”, <em>Studia Logica</em>, 80: 235–264.</li>\n<li>Englebretsen, G., 1981, <em>Logical Negation</em>, Assen: Van\nGorcum.</li>\n<li>Espinal, M.T., 1992, “Expletive negation and logical\nabsorption”, <em>The Linguistic Review</em>, 9:\n333–358.</li>\n<li>Fauconnier, G., 1975, “Polarity and the scale\nprinciple”, in <em>CLS 11</em>, 188–199. Chicago: Chicago\nLinguistic Society.</li>\n<li>von Fintel, K., 1997, “Bare plurals, bare conditionals, and\n<em>only</em>”, <em>Journal of Semantics</em>, 14:\n1–56.</li>\n<li>–––, 2004, “Would you believe it? The king\nof France is back”, in A. Bezuidenhout and M. Reimer (eds.),\n<em>Descriptions and Beyond</em>, 269–96, Oxford: Oxford\nUniversity Press.</li>\n<li>Fodor, J. D., 1970, <em>The Linguistic Description of Opaque\nContexts</em>, Ph.D. thesis, MIT.</li>\n<li>–––, 1979, “In defense of the truth-value\ngap”, in D. Dinneen and C.-K. Oh (eds.), <em>Syntax and\nSemantics 11: Presupposition</em>, 199–224, New York: Academic\nPress.</li>\n<li>Frege, G., 1892, “On Sinn and Bedeutung”, in M. Beaney\n(ed.), <em>The Frege Reader</em>, 151–71, Oxford:\nBlackwell.</li>\n<li>–––, 1919, “Negation”, in M. Beaney\n(ed.), <em>The Frege Reader</em>, 346–61, Oxford:\nBlackwell.</li>\n<li>Gabbay, D.M., 1988, “What is negation in a system?”,\nin F. Drake and J. Truss (eds.), <em>Logic Colloquium ’86</em>,\n95–112, Amsterdam: Elsevier.</li>\n<li>Gabbay, D.M., F.J. Pelletier, and J. Woods (eds.), 2012,\n<em>Logic: A History of its Central Concepts, Vol. 11 (Handbook of the\nHistory of Logic)</em>, Amsterdam: Elsevier.</li>\n<li>Gabbay, D.M. and H. Wansing, 1996, “What is negation in a\nsystem? Negation in structured consequence relations”, in A.\nFuhrmann and H. Rott (eds.), <em>Logic, Action and Information</em>,\n328–350, Berlin: de Gruyter.</li>\n<li>––– (eds.), 1999, <em>What is Negation?</em>,\nDordrecht: Kluwer.</li>\n<li>Gajewski, J., 2007, “Neg-raising and polarity”,\n<em>Linguistics and Philosophy</em>, 30: 289–328.</li>\n<li>Gazdar, G., 1979, <em>Pragmatics: Implicature, Presupposition, and\nLogical Form</em>, New York: Academic Press.</li>\n<li>Geach, P.T., 1965, “Assertion”, <em>The Philosophical\nReview</em>, 74: 449–465.</li>\n<li>–––, 1972, <em>Logic Matters</em>, Berkeley:\nUniversity of California Press.</li>\n<li>Geurts, B., 1998, “The mechanisms of denial”,\n<em>Language</em>, 74: 274–307.</li>\n<li>Giannakidou, A., 2011, “Negative and positive polarity\nitems”, in K. von Heusinger, C. Maienborn and P. Portner (eds.),\n<em>Semantics: An International Handbook of Natural Language\nMeaning</em>, Vol. 2, 1660–1712, Berlin: de Gruyter.</li>\n<li>Giora, R., 2007, “A good Arab is not a dead Arab”: On\nthe accessibility of negated concepts, in I. Kecskes &amp; L. Horn\n(eds.), <em>Explorations in Pragmatics: Linguistic, Cognitive and\nIntercultural Aspects</em>, 129–162, Berlin: Mouton de\nGruyter.</li>\n<li>Givón, T., 1978, “Negation in language: pragmatics,\nfunction, ontology”, in P. Cole (ed.), <em>Syntax and Semantics\n9: Pragmatics</em>, 69–112, New York: Academic Press.</li>\n<li>Goldblatt, R., 1974, “Semantic analysis of\northologic”, <em>Journal of Philosophical Logic</em>, 3:\n19–35.</li>\n<li>Goré, R., 2000, “Dual intuitionistic logic\nrevisited”, in R. Dyckhoff (ed.), <em>Proceedings of the\nInternational Conference on Automated Reasoning with Analytic Tableaux\nand Related Methods</em>, 252–267, Berlin: Springer.</li>\n<li>Green, L., 2002, <em>African American English: A Linguistic\nIntroduction</em>, Cambridge: Cambridge University Press.</li>\n<li>Grice, H. P., 1989, <em>Studies in the Way of Words</em>,\nCambridge: Harvard University Press.</li>\n<li>Grimm, P., 2005, “What is a contradiction?”, in G.\nPriest, JC Beall, and B. Armour-Garb (eds.), <em>The Law of\nNon-Contradiction: New Philosophcial Essays</em>, 49–72, Oxford:\nOxford University Press.</li>\n<li>Gurevich, Y., 1977, “Intuitionistic logic with strong\nnegation”, <em>Studia Logica</em>, 36: 49–59.</li>\n<li>Haegeman, L. 2000, “Negative preposing, negative inversion,\nand the split CP”, in L. Horn and Y. Kato (eds.), <em>Negation\nand Polarity: Syntactic and Semantic Perspectives</em>, Oxford: Oxford\nUniversity Press, 147–192.</li>\n<li>Hazen, A., 1992, “Subminimal negation”, <em>Philosophy\nDepartment Preprint</em>, 1/92, University of Melbourne.</li>\n<li>Heine, B. and T. Kuteva, 2007, <em>The Genesis of Grammar</em>,\nOxford: Oxford University Press.</li>\n<li>Henry, D., 1967, <em>The Logic of St. Anselm</em>, Oxford:\nClarendon.</li>\n<li>Heyting, A., 1956, <em>Intuitionism: An Introduction</em>,\nAmsterdam: North-Holland Publishing.</li>\n<li>Hintikka, J., 1968, “Epistemic Logic and the Methods of\nPhilosophical Analysis”, <em>Australasian Journal of\nPhilosophy</em>, 46: 37–51.</li>\n<li>–––, <em>Logic, Language-Games and Information:\nKantian Themes in the Philosophy of Logic</em>, Oxford: Clarendon\nPress.</li>\n<li>Hoffmann, M., 1987, <em>Negatio Contrarii: A Study of Latin\nLitotes</em>, Assen: Van Gorcum.</li>\n<li>Hopkins, J., 1972, <em>A Companion to the Study of St.\nAnselm</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Horn, L.R., 1978, “Remarks on neg-raising”, in P. Cole\n(ed.), <em>Syntax and Semantics 9: Pragmatics</em>, 129–220, New\nYork: Academic Press.</li>\n<li>–––, 1989, <em>A Natural History of\nNegation</em>, Chicago: University of Chicago Press. Reissued,\nStanford, CA: CSLI Publications, 2001.</li>\n<li>–––, 2000, “From <em>if</em> to\n<em>iff</em>: Conditional perfection as pragmatic\nstrengthening”, <em>Journal of Pragmatics</em>, 32:\n289–326.</li>\n<li>–––, 2005, “An un-paper for the\nunsyntactician”, in S. Mufwene et al. (eds.), <em>Polymorphous\nLinguistics: Jim McCawley’s Legacy</em>, 329–365,\nCambridge: MIT Press.</li>\n<li>–––, 2010a, “Multiple negation in English\nand other languages”, in Horn 2010b: 111–148.</li>\n<li>––– (ed.), 2010b, <em>The Expression of\nNegation</em>, Berlin: Mouton de Gruyter.</li>\n<li>–––, 2012, “Histoire d’*O: Lexical\npragmatics and the geometry of opposition”, in J.-Y.\nBéziau and G. Payette (eds.), <em>The Square of Opposition: A\nGeneral Framework for Cognition</em>, 383–416, Bern: Peter\nLang.</li>\n<li>–––, 2015, “On the contrary: Disjunctive\nsyllogism and pragmatic strengthening”, in A. Koslow and A.\nBuchsbaum (eds.), <em>The Road to Universal Logic</em>, 151–201.\nHeidelberg: Birkhäuser (Springer).</li>\n<li>–––, 2016, “Licensing NPIs: Some negative\n(and positive) results”, in P. Larrivée and C. Lee\n(eds.), <em>Negation and Polarity: Experimental Perspectives</em>,\n281–306. Berlin: Springer.</li>\n<li>–––, 2017, “Lie-toe-tease: Double\nnegatives and unexcluded middles”, <em>Philosophical\nStudies</em>, 174: 79–103.</li>\n<li>–––, 2018, “An (abridged) atlas of\nnegation”, in K. Turner and L. Horn (eds.), <em>Pragmatics,\nTruth and Underspecification: Towards an Atlas of Meaning</em>,\n3–53, Leiden: Brill. (CRiSPI 34.)</li>\n<li>Humberstone, L., 1986, “Extensionality in sentence\nposition”, <em>Journal of Philosophical Logic</em>, 15:\n27–54.</li>\n<li>–––, 1995, “Negation by iteration”,\n<em>Theoria</em>, 61: 1–24.</li>\n<li>–––, 2000a, “The Revival of Rejective\nNegation”, <em>Journal of Philosophical Logic</em>, 29:\n331–381.</li>\n<li>–––, 2000b, “Contra-classical\nlogics”, <em>Australasian Journal of Philosophy</em>, 78:\n438–474.</li>\n<li>–––, 2003, “Note on contraries and\nsubcontraries”, <em>Noûs</em>, 37: 690–705.</li>\n<li>–––, 2005, “Contrariety and\nsubcontrariety: the anatomy of negation (with special reference to an\nexample of J.-Y. Béziau)”, <em>Theoria</em>, 75:\n241–262.</li>\n<li>–––, 2011, <em>The Connectives</em>, Cambridge:\nMIT Press.</li>\n<li>–––, 2018, “Sentence Connectives in Formal\nLogic”, <em>The Stanford Encyclopedia of Philosophy</em> (Summer\n2018 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/connectives-logic/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/connectives-logic/</a>&gt;.</li>\n<li>–––, 2019, “Priest On Negation”, in\nC. Baskent and T.M. Ferguson (eds.), <em>Graham Priest on Dialetheism\nand Paraconsistency</em>, Dordrecht: Springer, 285–341.</li>\n<li>Israel, M., 2011, <em>The Grammar of Polarity: Pragmatics,\nSensitivity, and the Logic of Scales</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Jackendoff, R., 1969, “An interpretive theory of\nnegation”, <em>Foundations of Language</em>, 5:\n218–241.</li>\n<li>Jaspers, D., 2005. <em>Operators in the Lexicon: On the Negative\nLogic of Natural Language</em>, Universiteit Leiden dissertation,\nUtrecht: LOT.</li>\n<li>Jespersen, O., 1917, <em>Negation in English and Other\nLanguages</em>, Copenhagen: Høst.</li>\n<li>Johansson, I., 1937, “Der Minimalkalkül, ein\nreduzierter intuitionistischer Formalismus”, <em>Compositio\nMathematica</em>, 4: 119–136.</li>\n<li>Just, M.A. and Carpenter, P.A., 1971, “Comprehension of\nnegation with quantification”, <em>Journal of Verbal Learning\nand Verbal Behavior</em>, 12: 21–31.</li>\n<li>Kamide, N., 2013, “A hierarchy of weak double\nnegations”, <em>Studia Logica</em>, 101: 1277–1297.</li>\n<li>–––, 2017, “Paraconsistent double\nnegations as classical and intuitionistic negations”, <em>Studia\nLogica</em>, 105: 1167–1191.</li>\n<li>Kamide, N. and H. Wansing, 2012, “Proof theory of\nNelson’s paraconsistent logic: A uniform perspective”,\n<em>Theoretical Computer Science</em>, 415: 1–38.</li>\n<li>Kapsner, A., 2014, <em>Logics and Falsifications. A New\nPerspective on Constructivist Semantics</em>, Dordrecht:\nSpringer.</li>\n<li>Katz, J., 1972, <em>Semantic Theory</em>, New York: Harper &amp;\nRow.</li>\n<li>Keenan, E. and L. Faltz, 1985, <em>Boolean Semantics for Natural\nLanguage</em>, Dordrecht: D. Reidel.</li>\n<li>Kiparsky, P. and C. Condoravdi, 2006, “Tracking\nJespersen’s cycle”, in M. Janse (ed.), <em>Proceedings of\nthe Second International Conference of Modern Greek Dialects and\nLinguistic Theory</em>, 172–197. Patras: University of Patras\nPress.</li>\n<li>Kleene, S., 1952, <em>Introduction to Metamathematics</em>,\nAmsterdam: North-Holland.</li>\n<li>Klima, E., 1964, “Negation in English”, in J. A. Fodor\nand J. J. Katz (eds.), <em>The Structure of Language</em>,\n246–323, Englewood Cliffs: Prentice-Hall.</li>\n<li>Kolmogorov, A. N., 1925, “On the principle of excluded\nmiddle”, English translation in J. van Heijenoort (ed.),\n<em>From Frege to Gödel: a Source Book in Mathematical Logic,\n1879–1931</em>(third ed.), Cambridge (Mass.): Harvard University\nPress, 1977, 414–437.</li>\n<li>Kürbis, N., 2019, <em>Proof and Falsity: A Logical\nInvestigation</em>, Cambridge, Cambridge University Press.</li>\n<li>Labov, W., 1972, “Negative attraction and negative concord\nin English grammar”, <em>Language</em>, 48: 773–818.</li>\n<li>Ladusaw, W., 1980, <em>Negative Polarity as Inherent Scope\nRelations</em>, New York: Garland.</li>\n<li>–––, 1996, “Negation and polarity\nitems”, in S. Lappin (ed.), <em>Handbook of Contemporary\nSemantic Theory</em>, 299–319. Oxford: Blackwell.</li>\n<li>Lahav, O. and A. Avron, 2013, “A Unified Semantic Framework\nfor Fully Structural Propositional Sequent Systems”, <em>ACM\nTransactions on Computational Logic</em>, 14: 27:1–27:33.</li>\n<li>Lahav, O., J. Marcos, and J. Zohar, 2017, “Sequent Systems\nfor Negative Modalities”, <em>Logica Universalis</em>, 11:\n345–382.</li>\n<li>Lenzen, W., 1996, “Necessary conditions for negation\noperators”, in Wansing 1996: 37–58.</li>\n<li>Löbner, S., 2000, “Polarity and natural language:\nPredication, quantification, and negation in particularizing and\ncharacterizing sentences”, <em>Linguistics and Philosophy</em>,\n23: 213–308.</li>\n<li>Łukasiewicz, J., 1930, “Philosophical remarks on\nmany-valued systems of propositional logics”, in S. McCall\n(ed.), <em>Polish Logic 1920–1939</em>, 40–65, Oxford:\nClarendon.</li>\n<li>Malinowski, G., 1993, <em>Many-valued Logics</em>, Oxford:\nClarendon.</li>\n<li>Marcos, J., 2005, “On negation: Pure local rules”,\n<em>Journal of Applied Logic</em>, 3: 185–219.</li>\n<li>Mares, E., 2004, <em>Relevant Logic: A Philosophical\nInterpretation</em>, Cambridge: Cambridge University Press.</li>\n<li>Mates, B., 1953, <em>Stoic Logic</em>, Berkeley: University of\nCalifornia Press.</li>\n<li>McCall, S., 1967, “Contrariety”, <em>Notre Dame\nJournal of Formal Logic</em>, 8: 121–138.</li>\n<li>–––, 2012, “A History of\nConnexivity”, in Gabbay, Pelletier, and Woods 2012:\n415–449.</li>\n<li>McCawley, J.D., 1991, “Contrastive negation and\nmetalinguistic negation”, <em>Chicago Linguistic Society</em>,\n27.2: 189–206.</li>\n<li>Miestamo, M., 2005, <em>Standard Negation: The Negation of\nDeclarative Verbal Main Clauses in a Typological Perspective</em>,\nBerlin: Mouton de Gruyter.</li>\n<li>Montague, R., 1973, “The proper treatment of quantification\nin ordinary English”, in K.J.J. Hintikka, J.M.E. Moravcsik, and\nP. Suppes (eds.), <em>Approaches to Natural Language</em>,\n221–242. Dordrecht: Reidel,</li>\n<li>Nelson, D., 1949, “Constructible falsity”, <em>Journal\nof Symbolic Logic</em>, 14: 16–26.</li>\n<li>–––, 1959, “Negation and separation of\nconcepts in constructive systems”, in A. Heyting (ed.),\n<em>Constructivity in Mathematics</em>, 208–225, Amsterdam:\nNorth-Holland.</li>\n<li>Niki, S., forthcoming, “Subminimal Logics in Light of\nVakarelov’s Logic”, <em>Studia Logica</em>, first online\nNovember 1, 2019. doi:10.1007/s11225-019-09884-z</li>\n<li>Odintsov, S., 2008, <em>Constructive negations and\nparaconsistency</em>, Dordrecht: Springer.</li>\n<li>Omori H. and Wansing, H., 2017, “40 years of FDE: An\nIntroductory Overview”, <em>Studia Logica</em>, 105:\n1021–1049.</li>\n<li>–––, 2018,“On Contra-classical variants of\nNelson logic N4 and its classical extension”, <em>Review of\nSymbolic Logic</em>, 11: 805–820.</li>\n<li>Onishi, T., 2015, “ Substructural negations”,\n<em>Australasian Journal of Logic</em>, 12: 177–202.</li>\n<li>Oesterle, J., 1962, <em>Aristotle: On Interpretation. Commentary\nby St. Thomas and Cajetan</em>, Milwaukee: Marquette University\nPress.</li>\n<li>Pacuit, E., 2017, <em>Neighborhood Semantics for Modal Logic</em>,\nDordrecht: Springer.</li>\n<li>Paoli, F., 2019, “Bilattice logics and demi-negation”,\nin H. Omori and H. Wansing (ed.), <em>New Essays on Belnap-Dunn\nLogic</em>, 223–243, Dordrecht: Springer.</li>\n<li>Parsons, T., 1984, “Assertion, denial, and the liar\nparadox”, <em>Journal of Philosophical Logic</em>, 13:\n137–152.</li>\n<li>Payne, T., 1985, “Negation”, in T. Shopen (ed.),\n<em>Language Typology and Syntactic Description, Vol. 1</em>,\n197–242. Cambridge: Cambridge University Press.</li>\n<li>Penka, D., 2011, <em>Negative Indefinites</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Peters, S. and D. Westerståhl, 2006, <em>Quantifiers in\nLanguage and Logic</em>, Oxford: Oxford University Press.</li>\n<li>Pitts, A., 2009, “Exploring a ‘pragmatic\nambiguity’ of negation”, <em>Language</em>, 87:\n346–368.</li>\n<li>Plato, <em>The Sophist</em>, B. Jowett, trans., New York: Random\nHouse, 1937.</li>\n<li>Price, H., 1983, “Sense, assertion, Dummett, and\ndenial”, <em>Mind</em>, 92: 161–173.</li>\n<li>–––, 1990, “Why ‘not’?”,\n<em>Mind</em>, 99: 221–238.</li>\n<li>Priest, G., 1979, “The logic of paradox”, <em>Journal\nof Philosophical Logic</em>, 8: 219–241.</li>\n<li>–––, 1999, “What not? A defence of\ndialetheic theory of negation”, in Gabbay and Wansing 1999:\n101–120.</li>\n<li>–––, 2006, <em>Doubt Truth to be a Liar</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2008, <em>An Introduction to Non-Classical\nLogic: From Ifs to Is</em>, second edition, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 2010, “The logic of the\n<em>catuskoti</em>”, <em>Comparative Philosophy</em>, 1:\n24–54.</li>\n<li>Prior, A. N., 2006, “Negation”, in D.M. Borchert\n(ed.), <em>Encyclopedia of Philosophy, 2<sup>nd</sup> ed.</em>, Vol.\n6, 522–530, New York: Macmillan.</li>\n<li>Pullum, G., 2002, “Negation”, Chapter 9 in R.\nHuddleston &amp; G. Pullum, <em>The Cambridge Grammar of the English\nLanguage</em>, Cambridge: Cambridge University Press.</li>\n<li>Quine, W. V. O., 1960, <em>Word and Object</em>, Cambridge, MA:\nMIT Press.</li>\n<li>Ramsey, F. P., 1927, “Facts and Propositions”,\n<em>Proceedings of the Aristotelian Society (Suppl. Vol.)</em>, 7:\n153–170.</li>\n<li>Rauszer, C., 1980, <em>An Algebraic and Kripke-style Approach to a\nCertain Extension of Intuitionistic Logic</em>, Dissertationes\nMathematicae 167, Institute of Mathematics, Polish Academy of\nSciences, Warsaw.</li>\n<li>Restall, G., 1999, “Negation in relevant logics (How I\nstopped worrying and learned to love the Routley Star)”, in\nGabbay and Wansing 1999: 53–76.</li>\n<li>–––, 2000, <em>An Introduction to Substructural\nLogics</em>, London: Routledge, London.</li>\n<li>Ripley, D., 2009, <em>Negation in Natural Language</em>, Ph.D.\nDissertation, Philosophy Department, University of North\nCarolina/Chapel Hill\n [<a href=\"https://cdr.lib.unc.edu/record/uuid:8b50aebb-e71a-48a7-881e-d863d2e77ce1\" target=\"other\">Ripley 2009 available online</a>].</li>\n<li>–––, 2011a, “Contradictions at the\nborders”, in R. Nouwen, R. van Rooij, U. Sauerland and H.-C.\nSchmitz (eds.), <em>Vagueness in Communication</em>, 169–188,\nBerlin: Springer.</li>\n<li>–––, 2011b, “Negation, denial, and\nrejection”, <em>Philosophy Compass</em>, 6: 622–629.</li>\n<li>Rooth, M., 1992, “A theory of focus interpretation”,\n<em>Natural Language Semantics</em>, 1: 75–116.</li>\n<li>Routley, R. and V. Routley, 1972, “Semantics for first\ndegree entailment”, <em>Noûs</em>, 6: 335–59.</li>\n<li>–––, 1985, “Negation and\ncontradiction”, <em>Revista Colombiana de\nMatemáticas</em>, 19: 201–230.</li>\n<li>Rumfitt, I., 2000, “”Yes“ and\n”no“”, <em>Mind</em>, 109: 781–823.</li>\n<li>Russell, B., 1905, “On denoting”, <em>Mind</em>, 14:\n479–93.</li>\n<li>Sánchez Valencia, V., 1994, “Monotonicity in medieval\nlogic”, <em>Language and Cognition</em>, 4: 161–174.</li>\n<li>Segerberg, K., 1971, <em>An Essay in Classical Modal Logic</em>,\nvol. 1–3, Uppsala Philosophical Studies, Uppsala\nUniversity.</li>\n<li>Seuren, P. and D. Jaspers, 2014, “Logico-cognitive structure\nin the lexicon”, <em>Language</em>, 90: 607–43.</li>\n<li>Shramko, Y., 2005, “Dual intuitionistic logic and a variety\nof negations: the logic of scientific research”, <em>Studia\nLogica</em>, 80: 347–367.</li>\n<li>Shramko, Y. and H. Wansing, 2011, <em>Truth and Falsehood. An\nInquiry into Generalized Logical Values</em>, Dordrecht:\nSpringer.</li>\n<li>Smiley T., 1993, “Can Contradictions Be True?. I”,\n<em>Proceedings of the Aristotelian Society</em>, 67:\n17–34.</li>\n<li>–––, 1996, “ Rejection”,\n<em>Analysis</em>, 56:1–9.</li>\n<li>Sommers, F. and G. Englebretsen, 2000, <em>An Invitation to Formal\nReasoning: The Logic of Terms</em>, Aldershot: Ashgate.</li>\n<li>Speranza, J.L. and L. Horn, 2012, “A brief history of\nnegation”, in Gabbay, Pelletier, and Woods 2012:\n127–174.</li>\n<li>Spruyt, J., 1989, <em>Peter of Spain on Composition and\nNegation</em>, Nijmegen: Ingenium.</li>\n<li>Strawson, P.F., 1950, “On referring”, <em>Mind</em>,\n59: 320–44.</li>\n<li>–––, 1952, <em>Introduction to Logical\nTheory</em>, London: Methuen.</li>\n<li>de Swart, H., 2011, <em>Expression and Interpretation of Negation:\nAn OT Typology</em>, Dordrecht: Springer.</li>\n<li>Tottie, G. and A. Neukom-Hermann, 2010, Quantifier-negation\ninteraction in English: A corpus linguistic study of\n<em>all...not</em> constructions. In Horn 2010b: 149–185.</li>\n<li>Vakarelov, D., 1977, <em>Theory of Negation in Certain Logical\nSystems: Algebraic and Semantic Approach</em>, Ph.D. thesis,\nUniversity of Warsaw.</li>\n<li>–––, 1989a, “Intuitive semantics for some\nthree-valued logics connected with information, contrariety and\nsubcontrariety”, <em>Studia Logica</em>, 48: 565–575.</li>\n<li>–––, 1989b, “Consistency, Completeness and\nNegations”, in G. Priest, R. Routley, and J. Norman (eds.),\n<em>Paraconsistent Logic: Essays on the Inconsistent</em>,\n328–368, Munich: Philosophia Verlag.</li>\n<li>Varzi, A.C. and M. Warglien, 2003, “The Geometry of\nNegation”, <em>Journal of Applied Non-Classical Logics</em>,\n13:9–19.</li>\n<li>Wagner, G., 1994, <em>Vivid Logic: Knowledge-Based Reasoning with\nTwo Kinds of Negation</em>, Lecture Notes in Computer Science Volume\n764, Berlin: Springer.</li>\n<li>Wansing, H., 1993, <em>The Logic of Information Structures</em>,\nLecture Notes in AI 681, Berlin: Springer.</li>\n<li>–––, 1994, “Sequent calculi for normal\nmodal propositional logics”, <em>Journal of Logic and\nComputation</em>, 4: 125–142.</li>\n<li>––– (ed.), 1996, <em>Negation. A Notion in\nFocus</em>, Berlin: de Gruyter.</li>\n<li>–––, 1998, <em>Displaying Modal Logic</em>,\nDordrecht: Kluwer.</li>\n<li>–––, 2001, “Negation”, in L. Goble\n(ed.), <em>The Blackwell Guide to Philosophical Logic</em>,\n415–436, Oxford: Blackwell Publishers.</li>\n<li>–––, 2002, “Sequent systems for modal\nlogics”, in D. Gabbay and F. Guenthner (eds.), <em>Handbook of\nPhilosophical Logic. Vol. 8</em>, 61–145, Dordrecht:\nSpringer.</li>\n<li>–––, 2005, “Connexive modal logic”,\nin R. Schmidt et al. (eds.), <em>Advances in Modal Logic. Volume\n5</em>, 367–383, London: King’s College Publications.\n [<a href=\"http://www.aiml.net/volumes/volume5/\" target=\"other\">Wansing 2005 also available online</a>]</li>\n<li>–––, 2006, “Contradiction and contrariety.\nPriest on negation”, in J. Malinowski and A. Pietruszczak\n(eds.), <em>Essays in Logic and Ontology</em>, 81–93, Amsterdam:\nRodopi.</li>\n<li>–––, 2008, “Constructive negation,\nimplication, and co-implication”, <em>Journal of Non-Classical\nLogics</em>, 18: 341–364.</li>\n<li>–––, 2016a, “Falsification, natural\ndeduction, and bi-intuitionistic logic”, <em>Journal of Logic\nand Computation</em>, 26: 425–450 (first online 2013).</li>\n<li>–––, 2016b, “On split negation, strong\nnegation, information, falsification, and verification”, in K.\nBimbó (ed.), <em>J. Michael Dunn on Information Based\nLogics</em>, 161–189: Dordrecht: Springer.</li>\n<li>Wansing, H. and D. Skurt, 2018, “Negation as cancellation,\nconnexive logic, and qLPm”, <em>Australasian Journal of\nLogic</em>, 15: 476–488.</li>\n<li>Wason, P.C., 1965, “The contexts of plausible denial”,\n<em>Journal of Verbal Learning and Verbal Behavior</em>, 4:\n7–11.</li>\n<li>Wilson, D., 1975, <em>Presupposition and Non-Truth-Conditional\nSemantics</em>, New York: Academic Press.</li>\n<li>Wittgenstein, Ludwig, 1953, <em>Philosophical Investigations</em>,\ntrans. E. Anscombe, New York: Macmillan.</li>\n<li>Wood, L.M., 1933, “The paradox of negative judgment”,\n<em>Philosophical Review</em>, 42: 412–23.</li>\n<li>van der Wouden, T., 1996, <em>Negative Contexts: Collocation,\nPolarity, and Multiple Negation</em>, London: Routledge.</li>\n<li>von Wright, G.H., 1959, “On the logic of negation”,\n<em>Societas Scientiarum Fennica, Commentationes\nPhysico-Mathematicae</em>, 22: 1–30.</li>\n<li>Zeijlstra, H., 2004, <em>Sentential Negation and Negative\nConcord</em>, Utrecht: LOT.</li>\n<li>Zwarts, F., 1998, “Three types of polarity”, in F.\nHamm and E. Hinrichs (eds.), <em>Plural Quantification</em>,\n177–238. Dordrecht: Kluwer.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, General Topics: logic",
            "Aristotle, General Topics: metaphysics",
            "Aristotle, Special Topics: on non-contradiction",
            "contradiction",
            "dialetheism",
            "future contingents",
            "generalized quantifiers",
            "Grice, Paul",
            "implicature",
            "logic: and games",
            "logic: classical",
            "logic: connexive",
            "logic: intuitionistic",
            "logic: many-valued",
            "logic: modal",
            "logic: paraconsistent",
            "logic: relevance",
            "Parmenides",
            "pragmatics",
            "presupposition",
            "semantics: Montague",
            "square of opposition",
            "truth values",
            "vagueness"
        ],
        "entry_link": [
            {
                "../aristotle-logic/": "Aristotle, General Topics: logic"
            },
            {
                "../aristotle-metaphysics/": "Aristotle, General Topics: metaphysics"
            },
            {
                "../aristotle-noncontradiction/": "Aristotle, Special Topics: on non-contradiction"
            },
            {
                "../contradiction/": "contradiction"
            },
            {
                "../dialetheism/": "dialetheism"
            },
            {
                "../future-contingents/": "future contingents"
            },
            {
                "../generalized-quantifiers/": "generalized quantifiers"
            },
            {
                "../grice/": "Grice, Paul"
            },
            {
                "../implicature/": "implicature"
            },
            {
                "../logic-games/": "logic: and games"
            },
            {
                "../logic-classical/": "logic: classical"
            },
            {
                "../logic-connexive/": "logic: connexive"
            },
            {
                "../logic-intuitionistic/": "logic: intuitionistic"
            },
            {
                "../logic-manyvalued/": "logic: many-valued"
            },
            {
                "../logic-modal/": "logic: modal"
            },
            {
                "../logic-paraconsistent/": "logic: paraconsistent"
            },
            {
                "../logic-relevance/": "logic: relevance"
            },
            {
                "../parmenides/": "Parmenides"
            },
            {
                "../pragmatics/": "pragmatics"
            },
            {
                "../presupposition/": "presupposition"
            },
            {
                "../montague-semantics/": "semantics: Montague"
            },
            {
                "../square/": "square of opposition"
            },
            {
                "../truth-values/": "truth values"
            },
            {
                "../vagueness/": "vagueness"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=negation\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/negation/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=negation&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/negation/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=negation": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/negation/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=negation&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/negation/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Georgiev, D., T. Tinchev, and D. Vakarelov,\n <a href=\"http://www.fmi.uni-sofia.bg/fmi/logic/sqema/index.jsp\" target=\"other\">SQEMA</a>,\n Sofia University.",
            "Horn, L.,\n “<a href=\"http://tinyurl.com/qxudaar\" target=\"other\">Negation</a>,”\n <em>Oxford Bibliographies</em>.",
            "van der Sandt, R. and E. Maier, 2003,\n <a href=\"http://philpapers.org/archive/VANDID\" target=\"other\">Denials in discourse</a>,\n University of Nijmegen.",
            "Yu, J., 2010,\n “<a href=\"https://www.sinoss.net/uploadfile/2010/1130/7107.pdf\" target=\"other\">Negation from the perspective of neighborhood semantics</a>.”"
        ],
        "listed_links": [
            {
                "http://www.fmi.uni-sofia.bg/fmi/logic/sqema/index.jsp": "SQEMA"
            },
            {
                "http://tinyurl.com/qxudaar": "Negation"
            },
            {
                "http://philpapers.org/archive/VANDID": "Denials in discourse"
            },
            {
                "https://www.sinoss.net/uploadfile/2010/1130/7107.pdf": "Negation from the perspective of neighborhood semantics"
            }
        ]
    }
}