{
    "url": "nietzsche-moral-political",
    "title": "Nietzsche’s Moral and Political Philosophy",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Brian Leiter\n<bleiter@uchicago.edu>",
        "author_links": [
            {
                "http://brianleiter.net/": "Brian Leiter"
            },
            {
                "mailto:bleiter%40uchicago%2eedu": "bleiter@uchicago.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://brianleiter.net/\" target=\"other\">Brian Leiter</a>\n&lt;<a href=\"mailto:bleiter%40uchicago%2eedu\"><em>bleiter<abbr title=\" at \">@</abbr>uchicago<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Aug 26, 2004",
        "substantive revision Thu Feb 27, 2020"
    ],
    "preamble": "\n\nNietzsche’s moral philosophy is primarily critical in\norientation: he attacks morality both for its commitment to untenable\ndescriptive (metaphysical and empirical) claims about human agency, as\nwell as for the deleterious impact of its distinctive norms and values\non the flourishing of the highest types of human beings\n(Nietzsche’s “higher men”). His positive ethical\nviews are best understood as combining (i) a kind of consequentialist\nperfectionism as Nietzsche’s implicit theory of the good, with\n(ii) a conception of human perfection involving both formal and\nsubstantive elements. Because Nietzsche, however, is an\nanti-realist about value, he takes neither his positive\nvision, nor those aspects of his critique that depend upon it, to have\nany special epistemic status, a fact which helps explain his rhetoric\nand the circumspect character of his “esoteric”\nmoralizing. Although Nietzsche’s illiberal attitudes\n(for example, about human equality) are apparent, there are no grounds\nfor ascribing to him a political philosophy, since he has no\nsystematic (or even partly systematic) views about the nature of state\nand society. As an esoteric moralist, Nietzsche aims at freeing higher\nhuman beings from their false consciousness about morality (their\nfalse belief that this morality is good for them), not at a\ntransformation of society at large.\n",
    "toc": [
        {
            "#CritMora": "1. The Critique of Morality"
        },
        {
            "#ScopCritMoraPejoSens": "1.1 Scope of the Critique: Morality in the Pejorative Sense"
        },
        {
            "#CritDescCompMPS": "1.2 Critique of the Descriptive Component of MPS"
        },
        {
            "#CritNormCompMPS": "1.3 Critique of the Normative Component of MPS"
        },
        {
            "#NietPosiEthiVisi": "2. Nietzsche’s Positive Ethical Vision"
        },
        {
            "#NietMeta": "3. Nietzsche’s Metaethics"
        },
        {
            "#PrivRead": "3.1 Privilege Readings"
        },
        {
            "#NietAntiReal": "3.2 Nietzsche’s Anti-Realism"
        },
        {
            "#NietLackPoliPhil": "4. Nietzsche’s Lack of a Political Philosophy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#NietWritKeyCita": "A. Nietzsche’s Writings and Key to Citations"
        },
        {
            "#BRefeWorkNietMoraPoliPhil": "B. References and Works on Nietzsche’s Moral and Political Philosophy"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Critique of Morality\n1.1 Scope of the Critique: Morality in the Pejorative Sense\n\nNietzsche is not a critic of all “morality.” He\nexplicitly embraces, for example, the idea of a “higher\nmorality” which would inform the lives of “higher\nmen” (Schacht 1983: 466–469), and, in so doing, he employs\nthe same German word — Moral, sometimes\nMoralität — for both what he attacks and what he\npraises. Moreover, Nietzsche aims to offer a revaluation of existing\nvalues in a manner that appears, itself, to involve appeal to broadly\n“moral” standards of some sort. As he writes in the\nPreface to Daybreak: “in this book faith in morality\n[Moral] is withdrawn — but why? Out of\nmorality [Moralität]! Or what else should we call\nthat which informs it — and us?….[T]here is no\ndoubt that a ‘thou shalt’ [du sollst] speaks to\nus too” (D 4). This means, of course, that morality as the\nobject of Nietzsche’s critique must be distinguishable from the\nsense of “morality” he retains and employs.\n\nYet Nietzsche also does not confine his criticisms of morality to some\none religiously, philosophically, socially or historically\ncircumscribed example. Thus, it will not suffice to say that he simply\nattacks Christian or Kantian or European or utilitarian morality\n— though he certainly at times attacks all of these. To do\njustice to the scope of his critique, we should ask what characterizes\n“morality” in Nietzsche’s pejorative sense —\nhereafter, “MPS” — that is, morality as the object\nof his critique.\n\nNietzsche believes that all normative systems which perform something\nlike the role we associate with “morality” share certain\nstructural characteristics, even as the meaning and value of these\nnormative systems varies considerably over time. In particular, all\nnormative systems have both descriptive and\nnormative components, in the sense that: (a) they presuppose\na particular descriptive account of human being and human agency, in\nthe sense that for the normative claims comprising the system to have\nintelligible application to humans, particular metaphysical and\nempirical claims about human beings and agency must be true; and (b)\nthe system’s norms favor the interests of some people, often\n(though not necessarily) at the expense of others. Any particular\nmorality will, in turn, be the object of Nietzsche’s critique\n(i.e., MPS) only if it:\n\npresupposes three particular descriptive claims about the nature\nof humans pertaining to free will, the transparency of the self, and\ntheir essential similarity in morally relevant respects (“the\nDescriptive Component”); and/or\nembraces norms that harm the “highest men” while\nbenefiting the “lowest” (“the Normative\nComponent”).\n\n\nWhile Nietzsche offers criticisms of both the Descriptive and\nNormative Components of MPS, what ultimately defines MPS as against\nunobjectionable normative systems is the distinctive normative agenda.\nThus, while Nietzsche criticizes the description of agency that is\npart of many versions of MPS, he also holds that “[i]t is\nnot error as error that” he objects to fundamentally in\nMPS (EH IV;7): that is, it is not the falsity of the\ndescriptive account of agency presupposed by MPS, per se,\nthat is the heart of the problem, but rather its distinctive normative\ncommitments. Thus, strictly speaking, it is true that an MPS would be\nobjectionable even if it did not involve a commitment to an untenable\ndescriptive account of agency (as, say, certain forms of\nutilitarianism do not). Because Nietzsche’s two most common\n— and closely related — specific targets are, however,\nChristian and Kantian morality, the critique of the descriptive\ncomponent of MPS figures prominently in Nietzsche’s writing, and\nany account of the logic of his critique that omitted it would not do\njustice to his concerns.\n1.2 Critique of the Descriptive Component of MPS\n\nMPS for Nietzsche depends for its intelligible application to human\nagents on three descriptive theses about human agency (cf. BGE 32; GM\nI:13; TI VI; EH III:5; EH IV:8):\n\n\n(1) Human agents possess a will capable of free choice (“Free\nWill Thesis”).\n\n(2) The self is sufficiently transparent that agents’ actions\ncan be distinguished on the basis of their respective motives\n(“Transparency of the Self Thesis”).\n\n(3) Human agents are sufficiently similar that one moral code is\nappropriate for (because in the interests of) all (“Similarity\nThesis”).\n\n\nThese three theses must be true in order for the normative judgments\nof MPS to be intelligible because the normative judgments of MPS are\nmarked for Nietzsche by three corresponding traits; namely, that\nthey:\n\n\n(1′) Hold agents responsible for their actions.\n\n(2′) Evaluate and “rank” the motives for which\nagents act.\n\n(3′) Presuppose that “morality” has universal\napplicability (MPS “says stubbornly and inexorably, ‘I am\nmorality itself, and nothing besides is morality’” [BGE\n202]).\n\n\nThus, the falsity of the picture of human beings would affect the\nintelligibility of moral judgments in the following three ways:\n\n\n(1″) If agents lacked “free will” they could not be\nheld responsible for their actions.\n\n(2″) If agent motives could not be distinguished then no\nevaluative distinctions could be drawn among acts in terms of their\nmotives.\n\n(3″) If humans were, in fact, different in some overlooked but\nrelevant respect, then it would, at least, not be prima facie\napparent that one morality should have universal application.\n\n\nIt is the burden, then, of Nietzsche’s critique of the\nDescriptive Component of MPS to show that, in fact, none of these\nlatter theses about the nature of agency hold. A brief review of these\narguments follows (a more detailed treatment is in Leiter 2002: 81–112\nand Leiter 2019: 115–146)\n\nAgainst the Free Will Thesis, Nietzsche argues against both the modern\nattempts to vindicate free will and moral responsibility. On\nlibertarian views, a free agent (that is, one sufficiently free to be\nmorally responsible) would have to be causa sui (i.e.,\nself-caused, or the cause of itself); but since we are not causa\nsui, no one can be a free agent. Nietzsche often takes for\ngranted — not implausibly — that our moral and religious\ntraditions are incompatibilist at their core: causally determined\nwills are not free wills. But Nietzsche also argues against\ncompatibilist views of free will and moral responsibility according to\nwhich (1) we are free and morally responsible as long as we do what we\ndesire or we “identify” with the desires on which we act;\nor (2) we are free and morally responsible as long as we are\nresponsive to relevant reasons for acting. (Rutherford 2011 suggests\nNietzsche has more in common with the Stoics and Spinoza when it comes\nto “free will”: free actions are just ones arising from\nour real inner nature, but we can not choose to be the type of person\nwhose actions arise from their real nature, since that too is a matter\nof fate.)\n\nNietzsche offers two kinds of arguments to show that we are not\ncausa sui: that it is logically impossible to be causa\nsui; and that human beings are not self-caused in a sense\nsufficient to underwrite ascriptions of moral responsibility. (I owe\nthe point that there are two different arguments at issue here to Eric\nVogelstein.) He says relatively little about the first point, other\nthan claiming that “the concept of a causa sui is\nsomething fundamentally absurd” (BGE 15), and that it is\n“the best self-contradiction that has been conceived so\nfar…a sort of rape and perversion of logic” (BGE 21),\nsuch that this,\n\ndesire for “freedom of the will” in the superlative\nmetaphysical sense…the desire to bear the entire and ultimate\nresponsibility for one’s actions oneself, and to absolve God,\nthe world, ancestors, chance, and society involves nothing less than\nto be precisely this causa sui and…to pull oneself up\ninto existence by the hair, out of the swamps of nothingness. (BGE 21)\n\n\nBut we cannot, needless to say, pull ourselves up “out of the\nswamps of nothingness,” and so we cannot have ultimate\nresponsibility for our actions.\n\nNietzsche quickly moves from the claim that being causa sui\ninvolves a contradiction, however, to an argument that depends on his\npicture of human agency. Nietzsche accepts what we may call a\n“Doctrine of Types” (Leiter 1998), according to which,\n\nEach person has a fixed psycho-physical constitution, which defines\nhim as a particular type of person.\n\n\nCall the relevant psycho-physical facts here “type-facts.”\nType-facts, for Nietzsche, are either physiological facts\nabout the person, or facts about the person’s unconscious drives\nor affects. The claim, then, is that each person has certain largely\nimmutable physiological and psychic traits that constitute the\n“type” of person he or she is.\n\nAlthough Nietzsche himself does not use this exact terminology, the\nconcept figures centrally in all his mature writings. A typical\nNietzschean form of argument, for example, runs as follows: a\nperson’s theoretical beliefs are best explained in terms of his\nmoral beliefs; and his moral beliefs are best explained in terms of\nnatural facts about the type of person he is (i.e., in terms of\ntype-facts). So Nietzsche says, “every great philosophy so far\nhas been…the personal confession of its author and a kind of\ninvoluntary and unconscious memoir”; thus, to really grasp this\nphilosophy, one must ask “at what morality does all this (does\nhe) aim” (BGE 6)? But the “morality” that a\nphilosopher embraces simply bears “decisive witness to who\nhe is” — i.e., who he essentially is —\nthat is, to the “innermost drives of his nature” (BGE\n6).\n\nThis explanation of a person’s moral beliefs in terms of\npsycho-physical facts about the person is a recurring theme in\nNietzsche. “[M]oralities are…merely a sign language of\nthe affects” (BGE 187), he says. “Answers to the questions\nabout the value of existence…may always be considered\nfirst of all as the symptoms of certain bodies” (GS P:2).\n“Moral judgments,” he says are, “symptoms and sign\nlanguages which betray the process of physiological prosperity or\nfailure” (WP 258). “[O]ur moral judgments and\nevaluations…are only images and fantasies based on a\nphysiological process unknown to us” (D 119), so that “it\nis always necessary to draw forth…the physiological\nphenomenon behind the moral predispositions and prejudices” (D\n542). A “morality of sympathy,” he claims is “just\nanother expression of … physiological overexcitability”\n(TI IX:37). Ressentiment — and the morality that grows\nout of it — he attributes to an “actual physiological\ncause [Ursache]” (GM I:15).\n\nNietzsche sums up the idea well in the preface to On the Genealogy\nof Morality (hereafter simply “Genealogy” or\n“GM”): “our thoughts, values, every\n‘yes,’ ‘no,’ ‘if’ and\n‘but’ grow from us with the same inevitability as fruits\nborne on the tree — all related and each with an affinity to\neach, and evidence of one will, one health, one earth, one sun”\n(GM P:2). Nietzsche seeks to understand in naturalistic terms the\ntype of “person” who would necessarily bear such\nideas and values, just as one might come to understand things about a\ntype of tree by knowing its fruits. And just as natural facts\nabout the tree explain the fruit it bears, so too type-facts about a\nperson will explain his values and actions. \n\nWe typically locate the “will,” as the seat of action, in\nvarious conscious states: for example, our beliefs and desires.\nAccording to Nietzsche, however, the “will” so conceived\nis nothing but the effect of type-facts about the person. This means\nthat the real story of the genesis of an action begins with the\ntype-facts, which explain both consciousness and a\nperson’s actions. Here is how Nietzsche puts it, after\nsuggesting that the “will” is related to, but conceptually\nprior to, the concepts of “consciousness” and\n“ego”:\n\nThe “inner world” is full of phantoms…: the will is\none of them. The will no longer moves anything, hence does not explain\nanything either — it merely accompanies events; it can also be\nabsent. The so-called motive: another error. Merely a surface\nphenomenon of consciousness — something alongside the deed that\nis more likely to cover up the antecedents of the deeds than to\nrepresent them….\n\n\nWhat follows from this? There are no mental [geistigen]\ncauses at all. (TI VI:3)\n\n\nIn the last line, Nietzsche must mean only that there are no\nconscious mental causes. Indeed, in other passages, he is\nexplicit that the target of this critique is the picture of conscious\nmotives as adequate to account for action. (For competing views of the\nscope of Nietzsche’s epiphenomenalism about consciousness, see,\non the one hand, Katsafanas 2005 and, on the other, Riccardi 2019,\nFowles 2019 and Leiter 2019: 135–139; more generally, on how Nietzsche\nviews consciousness, see Abel 2001 and Welshon 2014). As he writes in\nDaybreak, “we are accustomed to exclude all [the]\nunconscious processes from the accounting and to reflect on the\npreparation for an act only to the extent that it is conscious”\n(D 129), a view which Nietzsche plainly regards as mistaken, both here\nand in the passage quoted above. Indeed, the theme of the\n“ridiculous overestimation and misunderstanding of\nconsciousness” (GS 11) is a recurring one in Nietzsche.\n“[B]y far the greatest part of our spirit’s\nactivity,” says Nietzsche, “remains unconscious and\nunfelt” (GS 333; cf. GS 354).\n\nApart from the general evidence on behalf of the Doctrine of Types,\nNietzsche’s strongest targeted argument for the epiphenomenality\nof consciousness depends on a piece of phenomenology, namely,\n“that a thought comes when ‘it’ wishes, and not when\n‘I’ wish” (BGE 17). If that is right and if actions\nare apparently “caused” by thoughts (by particular beliefs\nand desires), then it follows that actions are not caused solely by\nour conscious mental states, but rather by whatever it is (i.e.,\ntype-facts) that determines the thoughts that enter consciousness.\nThus, it is the (autonomous) causal power of our conscious mental life\nthat Nietzsche must be attacking. Given, then, that Nietzsche claims\nconsciousness is epiphenomenal, and given our identification of the\n“will” with our conscious life, Nietzsche would have us\ndispense with the idea of the will as causal altogether. (This gives\nNietzsche a novel argument against hierarchical accounts of free will\nfavored by some compatibilists: see Leiter 2002: 93–96. It also\nundermines more recent forms of compatibilism based on\nreasons-responsiveness: if deliberation, or conscious reasoning,, is\nepiphenomenal, then why should an antecedent but non-causal\ncorrelation between antecedently consciously experienced reasons and a\nsubsequent action ground responsibility? Barometers drop before\nstorms, after all, but they do not cause them and are not blameworthy\nfor them. See Leiter 2019: 144–146). Since the conscious will is not\ncausal, the Free Will Thesis is false.\n\nAgainst the Transparency of the Self Thesis, Nietzsche claims that\n“every action is unknowable” (GS 335; cf. WP 291, 294); as\nhe writes in Daybreak:\n\nThe primeval delusion still lives on that one knows, and knows quite\nprecisely in every case, how human action is brought\nabout…. “I know what I want, what I have done, I am\nfree and responsible for it, I hold others responsible, I can call by\nits name every moral possibility and every inner motion which precedes\naction; you may act as you will — in this matter I understand\nmyself and understand you all!” — that is\nhow…almost everyone still thinks….[But] [a]ctions are\nnever what they appear to us to be! We have expended so much\nlabor on learning that external things are not as they appear to us to\nbe — very well! the case is the same with the inner world! Moral\nactions are in reality “something other than that” —\nmore we cannot say: and all actions are essentially unknown. (D 116)\n\n\nActions are unknown because “nothing…can be more\nincomplete than [one’s] image of the totality of drives\nwhich constitute [a man’s] being” (D 119). One “can\nscarcely name even the cruder ones: their number and strength, their\nebb and flow, their play and counterplay among one another, and above\nall the laws of their nutriment remain wholly unknown”\n(D 119). But as Nietzsche argues elsewhere (e.g., D 109), the self is\nmerely the arena in which the struggle of drives plays itself out, and\none’s actions are the outcomes of the struggle (see Leiter 2002:\n99–104; cf. Riccardi 2015b; for a general account of\nNietzsche’s philosophical psychology of drives, see Katsafanas\n2013a).\n\nAgainst the Similarity Thesis, Nietzsche once again deploys his\nDoctrine of Types. Nietzsche holds that agents are essentially\ndissimilar, insofar as they are constituted by different\ntype-facts. Since Nietzsche also holds that these natural type-facts\nfix the different conditions under which particular agents will\nflourish, it follows that one morality cannot be good for all.\n“Morality in Europe today is herd animal\nmorality,” says Nietzsche, “in other\nwords…merely one type of human morality beside which,\nbefore which, and after which many other types, above all\nhigher moralities, are, or ought to be, possible” (BGE\n202). Nietzsche illustrates the general point with his discussion of\nthe case of the Italian writer Cornaro in Twilight of the\nIdols (VI:1). Cornaro, says Nietzsche, wrote a book mistakenly\nrecommending “his slender diet as a recipe for a long and happy\nlife.” But why was this a mistake? Nietzsche explains:\n\nThe worthy Italian thought his diet was the cause of his long\nlife, whereas the precondition for a long life, the extraordinary\nslowness of his metabolism, the consumption of so little, was the\ncause of his slender diet. He was not free to eat little or\nmuch; his frugality was not a matter of “free will”: he\nbecame sick when he ate more. But whoever is not a carp not only does\nwell to eat properly, but needs to.\n\n\nThere exists, then, type-facts about Cornaro that explain why a\nslender diet is good for him: namely, “the extraordinary\nslowness of his metabolism.” These natural facts, in turn,\nconstrain what Cornaro can do, delivering him “feedback”\nabout the conditions under which he will and won’t flourish:\ngiven his slow metabolism, if Cornaro ate more “he became\nsick”; conversely, when he stuck to his slender diet, he did\nwell. In sum, “[h]e was not free to eat little or\nmuch.” Cornaro’s mistake consists, in effect, in his\nabsolutism: he thought the “good” diet was good for\neveryone, when in fact it was only good for certain types of bodies\n(namely, those with slow metabolisms). As with diets, so too with\nmoralities, according to Nietzsche. Agents are not similar in\ntype-facts, and so one moral “diet” cannot be “good\nfor all.” As he writes:\n\n[T]he question is always who he is, and who the\nother person is…Every unegoistic morality that takes\nitself for unconditional and addresses itself to all does not only sin\nagainst taste: it is a provocation to sins of omission, one\nmore seduction under the mask of philanthropy — and\nprecisely a seduction and injury for the higher, rarer, privileged.\n(BGE 221)\n\n\nThis point sets the stage for his core critique of morality.\n\n1.3 Critique of the Normative Component of MPS\n\nAll of Nietzsche’s criticisms of the normative component of MPS\nare parasitic upon one basic complaint — not, as some have held\n(e.g., Nehamas [1985], Geuss [1997]), the universality of moral\ndemands, per se, but rather that “the demand of one\nmorality for all is detrimental to the higher men” (BGE 228).\nUniversality would be unobjectionable if agents were relevantly\nsimilar, but because agents are relevantly different, a universal\nmorality must necessarily be harmful to some. As Nietzsche writes\nelsewhere: “When a decadent type of man ascended to the rank of\nthe highest type [via MPS], this could only happen at the expense\nof its countertype [emphasis added], the type of man that is\nstrong and sure of life” (EH III:5). In the preface to the\nGenealogy, Nietzsche sums up his basic concern particularly\nwell:\n\nWhat if a symptom of regression lurked in the “good,”\nlikewise a danger, a seduction, a poison, a narcotic, through which\nthe present lived at the expense of the future? Perhaps more\ncomfortably, less dangerously, but at the same time in a meaner style,\nmore basely? — So that morality itself were to blame if the\nhighest power and splendor [Mächtigkeit und\nPracht] possible to the type man was never in fact attained? So\nthat morality itself was the danger of dangers? (GM Pref:6; cf. BT\nAttempt:5)\n\n\nThis theme is sounded throughout Nietzsche’s work. In a book of\n1880, for example, he writes that, “Our weak, unmanly social\nconcepts of good and evil and their tremendous ascendancy over body\nand soul have finally weakened all bodies and souls and snapped the\nself-reliant, independent, unprejudiced men, the pillars of a\nstrong civilization” (D 163). Similarly, in a\nposthumously published note of 1885, he remarks that “men of\ngreat creativity, the really great men according to my understanding,\nwill be sought in vain today” because “nothing stands more\nmalignantly in the way of their rise and evolution…than what in\nEurope today is called simply ‘morality’” (WP 957).\nIn these and many other passages (e.g., BGE 62; GM III:14; A:5, 24; EH\nIV:4; WP 274, 345, 400, 870, 879.), Nietzsche makes plain his\nfundamental objection to MPS: simply put, that MPS thwarts the\ndevelopment of human excellence, i.e., “the highest power and\nsplendor possible to the type man” (for more on the\n“higher man,” see section (2)).\n\nThere is another, competing reading of Nietzsche’s central\ncomplaint about MPS: namely, that it is “harmful to life”\nor, more simply, “anti-nature.” Geuss, for example, says\nthat, “There is little doubt that ‘Life’…in\nNietzsche does seem to function as a criterion for evaluating\nmoralities” (1997: 10). So, too, Schacht claims that Nietzsche\n“takes ‘life’ in this world to be the sole locus of\nvalue, and its preservation, flourishing, and above all its\nenhancement to be ultimately decisive for determinations of\nvalue” (1983: 359). Thus, the question of the value of MPS is\nreally the question of its “value for life” (1983: 354).\nBut what does that mean? After all, it is obvious that Nietzsche has\nnothing but contempt for most forms of human life, from St. Paul to\nBismarck to the modern “herd.” So the real question has to\nbe: what does “life” refer to? Schacht, following a\nsuggestion of Nietzsche’s from the Nachlass (WP 254),\nsuggests that life is will to power, and thus degree of power\nconstitutes the standard of value. (We shall return to this suggestion\nin detail in section 3.1, below.) But this involves no gain in\nprecision. Nietzsche may, indeed, have thought that more\n“power” — in his sense — was more valuable\nthan less, but that still leaves us with the question: power of\nwhat or of whom? The only plausible candidate\n— given especially his other remarks discussed above — is\npower of people; just as the only plausible candidate for the\n“life” that Nietzsche considers it valuable to preserve\nand enhance must be the lives of people and, in particular,\nthe lives of the “highest men.”\n\nThat this is what Nietzsche means is revealed by the context of his\nactual remarks about the “value for life.” For example, he\ncomments that “a higher and more fundamental value for\nlife might have to be ascribed to deception, selfishness, and\nlust” (BGE 2, emphasis added). But what sort of\n“life” is, e.g., “selfishness” valuable for?\nAs Nietzsche writes elsewhere (e.g., GM Pref:5–6), it is simply\nthat life which manifests “the highest power and splendor\nactually possible to the type man.” And similarly, when\nNietzsche says that a “tendency hostile to life is therefore\ncharacteristic of morality,” it is clear in context that what\n“life” refers to is “the type man” who might\nbe “raised to his greatest splendor and power” (that is,\nbut for the interference of MPS) (WP 897). In short, then, the things\nNietzsche identifies as “valuable” for life are those he\ntakes to be necessary for the flourishing of the highest types of life\n(or human excellence), while those that he identifies as harmful to it\nare those that he takes to be things that constitute obstacles to such\nflourishing. This suggests, then, that the “life” for\nwhich things are either valuable or disvaluable must be the life (or\nlives) that manifest human excellence — i.e., the lives of\n“higher men.”\n\nSomething similar may be said for the claim that Nietzsche objects to\nMPS because it is “anti-nature.” For example, when\nNietzsche says in Ecce Homo (IV:7) that “it is the lack\nof nature, it is the utterly gruesome fact that antinature\nitself received the highest honors as morality” that he\ncentrally objects to in a morality, his claim will remain obscure\nunless we can say precisely what about MPS makes it\n“anti-natural.” Nietzsche, himself, offers guidance on\nthis in the same section when he explains that a MPS is anti-natural\ninsofar as it has the following sorts of characteristics: it teaches\nmen “to despise the very first instincts of life” and\n“to experience the presupposition of life, sexuality, as\nsomething unclean”; and it “looks for the evil principle\nin what is most profoundly necessary for growth, in severe\nself-love” (EH IV:7).\n\nBut from this it should be apparent, then, that it is not\nanti-naturalness itself that is objectionable, but the consequences of\nan anti-natural MPS that are at issue: for example, its opposition to\nthe instincts that are “profoundly necessary for growth.”\nThis point is even more explicit in The Antichrist, where\nNietzsche notes that Christian morality “has waged deadly war\nagainst this higher type of man; it has placed all the basic\ninstincts of his type under ban” (5, emphasis added). In\nother words, the anti-naturalness of MPS is objectionable because the\n“natural” instincts MPS opposes are precisely those\nnecessary for the growth of the “higher type of man.”\nThus, underlying Nietzsche’s worries about the anti-naturalness\nof MPS — just as underlying his worries about the threat MPS\nposes to life — is a concern for the effect of MPS on\n“higher men.”\n\nSo Nietzsche objects to the normative agenda of MPS because it is\nharmful to the highest men. In Nietzsche’s various accounts of\nwhat the objectionable agenda of MPS consists, he identifies a variety\nof normative positions (see, e.g., D 108, 132, 174; GS 116, 294, 328,\n338, 345, 352, 377; Z I:4, II:8, III:1, 9, IV:13, 10; BGE 197, 198,\n201–202, 225, 257; GM Pref:5, III: 11 ff.; TI II, V, IX:35,\n37–38, 48; A: 7, 43; EH III:D-2, IV:4, 7–8; WP 752). We may\ncharacterize these simply as “pro” and “con”\nattitudes, and we may say that a morality is the object of\nNietzsche’s critique (i.e., it is an MPS) if it contains one or\nmore of the following normative views (this is a representative, but\nnot exhaustive, list):\n\n\nPro\nCon \n\nHappiness\nSuffering \n\nAltruism/Selflessness\nSelf-love or self-interest \n\nEquality\nInequality \n\nPity/Compassion\nIndifference to the suffering \n\n\nThe various possible normative components of MPS should, of course, be\nunderstood construed as ideal-typical, singling out for\nemphasis and criticism certain important features of larger and more\ncomplex normative views. Let us call that which morality has a\n“pro” attitude towards is the “Pro-Object,”\nand that which morality has a “con” attitude towards the\n“Con-Object.” Keeping in mind that what seems to have\nintrinsic value for Nietzsche is human excellence or human\ngreatness (see the next section), Nietzsche’s attack on the\nnormative component of MPS can be summarized as having two parts:\n\n(a) With respect to the Pro-Object, Nietzsche argues either (i) that\nthe Pro-Object has no intrinsic value (in the cases where MPS\nclaims it does); or (ii) that it does not have any or not nearly as\nmuch extrinsic value as MPS treats it as having; and\n\n\n(b) With respect to the Con-Object, Nietzsche argues only\nthat the Con-Objects are extrinsically valuable for the\ncultivation of human excellence — and that this is obscured by\nthe “con” attitude endorsed by MPS.\n\n\nThus, what unifies Nietzsche’s seemingly disparate critical\nremarks — about altruism, happiness, pity, equality, Kantian\nrespect for persons, utilitarianism, etc. — is that he thinks a\nculture in which such norms prevail as morality will be a culture\nwhich eliminates the conditions for the realization of human\nexcellence — the latter requiring, on Nietzsche’s view,\nconcern with the self, suffering, a certain stoic indifference, a\nsense of hierarchy and difference, and the like. Indeed, when we turn\nto the details of Nietzsche’s criticisms of these norms we find\nthat, in fact, this is precisely what he argues. One detailed example\nwill have to suffice here.\n\nWhat could be harmful about the seemingly innocuous MPS valuation of\nhappiness (“pro”) and suffering (“con”)? An\nearly remark of Nietzsche’s suggests his answer:\n\nAre we not, with this tremendous objective of obliterating all the\nsharp edges of life, well on the way to turning mankind into\nsand? Sand! Small, soft, round, unending sand! Is that your\nideal, you heralds of the sympathetic affections? (D 174)\n\n\nIn a later work, Nietzsche says — referring to hedonists and\nutilitarians — that, “Well-being as you understand it\n— that is no goal, that seems to us an end, a state\nthat soon makes man ridiculous and contemptible…” (BGE\n225). By the hedonistic doctrine of well-being, Nietzsche takes the\nutilitarians to have in mind “English happiness,”\nnamely, “comfort and fashion” (BGE 228) — a\nconstrual which, if unfair to some utilitarians (like Mill), may do\njustice to our ordinary aspirations to happiness. In a similar vein,\nNietzsche has Zarathustra dismiss “wretched contentment”\nas an ideal (Z Pref:3), while also revealing that it was precisely\n“the last men” — the “most despicable\nmen” — who “invented happiness\n[Glück]” in the first place (Pref:5).\n\nSo happiness, according to Nietzsche, is not an intrinsically valuable\nend, and men who aim for it — directly or through cultivating\nthe dispositions that lead to it — would be “ridiculous\nand contemptible.” To be sure, Nietzsche allows that he himself\nand the “free spirits” will be “cheerful” or\n“gay” [frölich] — they are, after all,\nthe proponents of the “gay science.” But the point is that\nsuch “happiness” is not criterial of being a\nhigher person, and thus it is not something that the higher person\n— in contrast to the adherent of MPS — aims for.\n\nYet why does aiming for happiness make a person so unworthy of\nadmiration? Nietzsche’s answer appears to be this: because\nsuffering is positively necessary for the cultivation of\nhuman excellence — which is the only thing, recall, that\nwarrants admiration for Nietzsche. He writes, for example, that:\n\nThe discipline of suffering, of great suffering — do\nyou not know that only this discipline has created all\nenhancements of man so far? That tension of the soul in unhappiness\nwhich cultivates its strength, its shudders face to face with great\nruin, its inventiveness and courage in enduring, persevering,\ninterpreting, and exploiting suffering, and whatever has been granted\nto it of profundity, secret, mask, spirit, cunning, greatness —\nwas it not granted to it through suffering, through the discipline of\ngreat suffering? (BGE 225; cf. BGE 270)\n\n\nNietzsche is not arguing here that — in contrast to the view of\nMPS — suffering is really intrinsically valuable (not\neven MPS claims that). The value of suffering, according to Nietzsche,\nis only extrinsic: suffering — “great” suffering\n— is a prerequisite of any great human achievement. As Nietzsche\nputs the point elsewhere: “Only great pain is the ultimate\nliberator of the spirit….I doubt that such pain makes us\n‘better’; but I know that it makes us more profound”\n(GS Pref:3). Nietzsche’s attack, then, conforms to the model\nsketched above: (i) he rejects the view that happiness is\nintrinsically valuable; and (ii) he thinks that the negative\nattitude of MPS toward suffering obscures its important extrinsic\nvalue. (There is reason to think that, on this second point, Nietzsche\nis generalizing from his own experience with physical suffering, the\nworst periods of which coincided with his greatest productivity.\nIndeed, he believed that his suffering contributed essentially to his\nwork: as he writes, admittedly hyperbolically, in Ecce Homo:\n“In the midst of the torments that go with an uninterrupted\nthree-day migraine, accompanied by laborious vomiting of phlegm, I\npossessed a dialectician’s clarity par excellence and\nthought through with very cold blood matters for which under healthier\ncircumstances I am not mountain-climber, not subtle, not cold\nenough” (EH I:1).)\n\nEven if there is no shortage in the history of art and literature of\ncases of immense suffering being the spur to great creativity, there\nremains a serious worry about the logic of this line of Nietzschean\ncritique. Following Leiter (2002), we may call this the “Harm\nPuzzle,” and the puzzle is this: why should one think the\ngeneral moral prescription to alleviate suffering must stop the\nsuffering of great artists, hence stop them from producing great art?\nOne might think, in fact, that MPS could perfectly well allow an\nexception for those individuals whose own suffering is essential to\nthe realization of central life projects. After all, a prescription to\nalleviate suffering reflects a concern with promoting well-being,\nunder some construal. But if some individuals — nascent Goethes,\nNietzsches, and other geniuses — would be better off\nwith a good dose of suffering, then why would MPS recommend otherwise?\nWhy, then, should it be the case that MPS “harms”\npotentially “higher men”?\n\nThis seems the natural philosophical question to ask, yet it also\ninvolves an important misunderstanding of Nietzsche’s critique,\nwhich is not, we might say, about philosophical theory but\nrather about the real nature of culture. When MPS values come\nto dominate a culture, Nietzsche thinks (plausibly), they will affect\nthe attitudes of all members of that culture. If MPS values emphasize\nthe badness of suffering and the goodness of happiness, that will\ninfluence how individuals with the potential for great achievements\nunderstand, evaluate and conduct their own lives. If, in fact,\nsuffering is a precondition for these individuals to do anything\ngreat, and if they have internalized the norm that suffering must be\nalleviated, and that happiness is the ultimate goal, then we run the\nrisk that, rather than — to put it crudely — suffer and\ncreate, they will instead waste their energies pursuing pleasure,\nlamenting their suffering and seeking to alleviate it. MPS values may\nnot explicitly prohibit artists or other potentially\n“excellent” persons from ever suffering; but the risk is\nthat a culture — like ours — which has internalized the\nnorms against suffering and for pleasure will be a\nculture in which potential artists — and other doers of great\nthings — will, in fact, squander themselves in\nself-pity and the seeking of pleasure.\n\nSo Nietzsche’s response to the Harm Puzzle depends upon an\nempirical claim about what the real effect of MPS will be.\nThe normative component of MPS is harmful not because its specific\nprescriptions and proscriptions explicitly require potentially\nexcellent persons to forego that which allows them to flourish (the\nclaim is not that a conscientious application of the\n“theory” of MPS is incompatible with the flourishing of\nhigher men); rather, the normative component of MPS is harmful because\nin practice, and especially because of MPS’s commitment\nto the idea that one morality is appropriate for all, potentially\nhigher men will come to adopt such values as applicable to themselves\nas well. Thus, the normative component of MPS is harmful because, in\nreality, it will have the effect of leading potentially excellent\npersons to value what is in fact not conducive to their flourishing\nand devalue what is in fact essential to it.\n\nIn sum, Nietzsche’s central objection to MPS is that it thwarts\nthe development of human excellence. His argument for this, in each\ncase, turns on identifying distinctive valuations of MPS, and showing\nhow — as in the case of norms favoring happiness and devaluing\nsuffering — they undermine the development of individuals who\nwould manifest human excellence. (For discussion of other examples,\nsee Leiter 2002: 134–136; Leiter 2015: 108–110.)\n2. Nietzsche’s Positive Ethical Vision\n\nWhile Nietzsche clearly has views about the states of affairs to which\npositive intrinsic value attaches (namely, the flourishing of\nhigher men), there is more disagreement among interpreters about what\nkind of ethics arises from the latter valuation so central to his\ncritique of morality. The two leading candidates are that Nietzsche\nembraces a kind of virtue ethics (e.g., Hunt 1991, Swanton\n2005) and that he is a kind of perfectionist (Hurka 1993, Hurka 2007).\nThese accounts turn out to overlap — the perfections of\nthe latter account are often the virtues of the former\n— though the perfectionist account will prove to have certain\nother advantages, discussed below.\n\nAny account of Nietzsche’s “positive ethics”\nconfronts a threshold worry, namely, that Nietzsche’s\nnaturalistic conception of persons and agency — and, in\nparticular, his conception of persons as constituted by non-conscious\ntype-facts that determine their actions — makes it unclear how\nNietzsche could have a philosophical ethics in any conventional sense.\nIf, as Nietzsche, says, we face “a brazen wall of fate; we\nare in prison, we can only dream ourselves free, not\nmake ourselves free” (HAH II:33); if “the single human\nbeing is a piece of fatum from the front and from the rear,\none law more, one necessity more for all that is yet to come and to\nbe” (TI V:6); if (as he says more hyperbolically in\nNachlass material) “the voluntary is absolutely\nlacking…everything has been directed along certain lines from\nthe beginning” (WP 458); if (again hyperbolically) “one\nwill become only that which one is (in spite of all: that means\neducation, instruction, milieu, chance, and accident)” (WP 334);\nthen it is hardly surprising that Nietzsche should also say, “A\nman as he ought to be: that sounds to us as insipid as\n‘a tree as he ought to be’” (WP 332).\n\nYet a philosopher reluctant to talk about “man as he\nought to be” is plainly ill-suited to the task of\ndeveloping a normative ethics, understood as systematic and\ntheoretical guidance for how to live, whether that guidance comes in\nthe form of rules for behavior or dispositions of character to be\ncultivated. (There is an additional, and special difficulty, for those\nwho think Nietzsche is a virtue ethicist, namely, that he also thinks\ngenuine virtues are specific to individuals, meaning that there will\nbe nothing general for the theorist to say about them [see,\ne.g., Z I:5].) This means we must approach the question of\nNietzsche’s “positive” ethics in terms of\nexplicating (1) what it is Nietzsche values, (2) what his criteria of\nevaluation are, and (3) what evaluative structure, if any, is\nexhibited by the answers to (1) and (2). We go wrong at the start,\nhowever, if we expect Nietzsche to produce a normative theory of any\nfamiliar kind, whether a virtue ethics or otherwise.\n\nImportantly, the preceding points should not be read as denying that\nNietzsche thinks values and evaluative judgments can have a\ncausal impact on actions and how lives are lived. After all,\nthere would be no point in undertaking a “revaluation of\nvalues” if such a revaluation would not have consequences for,\ne.g., the flourishing of higher men, or if MPS values did not have\ndeleterious causal consequences for those same people. Values make a\ncausal difference, but, given Nietzsche’s epiphenomenalism about\nconsciousness (discussed, above, in 1.1), they do not make this\ndifference because of free, conscious choices individuals make to\nadopt certain moral rules or cultivate certain dispositions of\ncharacter.\n\nWe can better appreciate Nietzsche’s unusual views on this score\nby looking more closely at the popular, but mistaken, idea that\nNietzsche calls on people to “create themselves” (on the\ngeneral topic, see Leiter 1998). Alexander Nehamas, for example, reads\nNietzsche as endorsing an ethics of self-creation. For Nietzsche,\nNehamas says, “The people who ‘want to become those they\nare’ are precisely ‘human beings who are new, unique,\nincomparable, who give themselves laws, who create themselves’\n(GS, 335)” (1985, p. 174). Nehamas, however, truncates the quote\nfrom The Gay Science at a misleading point. For Nietzsche, in\nthe full passage, continues as follows:\n\nTo that end [of creating ourselves] we must become the best learners\nand discoverers of everything that is lawful and necessary in the\nworld: we must become physicists in order to be\ncreators in this sense [wir müssen Physiker sein,\num, in jenem Sinne, Schöpfer sein zu können]\n— while hitherto all valuations and ideals have been based on\nignorance of physics … . Therefore: long live physics!\n(GS 335)\n\n\nCreation “in this sense” is, then, a very special sense\nindeed: for it presupposes the discovery of what is “lawful and\nnecessary” as revealed by physical science. The passage begins\nto make more sense in context. For in this same section, Nietzsche\nclaims that “every action is unknowable,” though he\nadds:\n\n…our opinions, valuations, and tables of what is good certainly\nbelong among the most powerful levers in the involved mechanism of our\nactions, but…in any particular case the law of their mechanism\nis indemonstrable [unnachweisbar].\n\n\nThis observation leads Nietzsche immediately to the suggestion that we\nshould create “our own new tables of what is good,”\npresumably with an eye to effecting the causal determination of our\nactions in new ways. However, we need help from science to identify\nthe lawful patterns into which values and actions fall; even if the\nmechanisms are indemonstrable, science may at least reveal the\npatterns of value-inputs and action-outputs. So to create one’s\nself, “in this sense,” is to accept Nietzsche’s\nbasically deterministic picture of action — as determined by\nsub-conscious causes (type-facts) that are hard to identify —\nbut to use science to help identify those “values” which\nfigure in the causal determination of action in new, but predictable,\nways.\n\nValues, then, have a causal impact upon how people act and thus also\non their life trajectories; but we cannot expect these impacts to flow\nfrom free, conscious choices that persons make. This would explain, of\ncourse, why we find so little in Nietzsche by way of argumentative or\ndiscursive support for his evaluative judgments: such intellectual\ndevices are precisely the ones that would appeal to our conscious\nfaculties, and thus would be idle with respect to the desired\noutcomes. Nietzsche’s often violent rhetorical style, by\ncontrast, might be expected (or so Nietzsche presumably thinks) to\nhave the requisite non-rational effect on his desired readers —\nthose “whose ears are related to ours” (GS 381). (More on\nthis issue in Section 4, below.)\n\nIf Nietzsche does not have a typical normative ethics, he certainly\nhas no shortage of views about evaluative questions. For example, it\nis clear from the earlier discussion of Nietzsche’s critique of\nmorality that he assigns great intrinsic value to the flourishing of\nhigher men. But who are these “higher men” and why does\nNietzsche assign value to them? (Note that while Nietzsche speaks in\nThus Spoke Zarathustra of the “superman” as a\nkind of ideal higher type, this concept simply drops out of his mature\nwork (except for a brief mention in EH in the context of discussing\nZarathustra). “Higher men” is an important\nconcept in Nietzsche; the “superman” is nothing more than\na rhetorical trope in the highly stylized Zarathustra.)\n\nNietzsche has three favorite examples of “higher” human\nbeings: Goethe, Beethoven, and Nietzsche himself! What makes these\nfigures paradigms of the “higher” type for Nietzsche,\nbeyond their great creativity (as he says, “the men of great\ncreativity” are “the really great men according to my\nunderstanding” (WP 957))? Following Leiter (2002: 116–122;\nLeiter 2015: 92–100), we can identify five characteristics that\nNietzsche identifies as distinctive of “higher men”: the\nhigher type is solitary, pursues a “unifying project,” is\nhealthy, is life-affirming, and practices self-reverence. Taken\ntogether, they are plainly sufficient to make someone a higher type in\nNietzsche’s view, though it is not obvious that any one of these\nis necessary, and various combinations often seem sufficient for\nexplaining how Nietzsche speaks of higher human beings.\n\nFirst, higher types are solitary and deal with others only\ninstrumentally. “Every choice human being,” says\nNietzsche, “strives instinctively for a citadel and a secrecy\nwhere he is saved from the crowd, the many, the great\nmajority…” (BGE 26). “[T]he concept of\ngreatness,” he says in the same work, “entails being\nnoble, wanting to be by oneself, being able to be different, standing\nalone and having to live independently\n[auf-eigne-Faust-leben-müssen]” (BGE 212). Indeed,\nthe higher type pursues solitude with something of a vengeance, for he\n“knows how to make enemies everywhere,…[He] constantly\ncontradicts the great majority not through words but through\ndeeds” (WP 944). Unsurprisingly, then, the great or higher man\nlacks the “congeniality” and\n“good-naturedness” so often celebrated in contemporary\npopular culture. “A great man…is incommunicable: he finds\nit tasteless to be familiar…” (WP 962). More than that,\nthough, the higher type deals with others, when he has to, in a rather\ndistinctive way: “A human being who strives for something great\nconsiders everyone he meets on his way either as a means or as a delay\nand obstacle — or as a temporary resting place” (BGE 273).\nThus, “a great man…wants no ‘sympathetic’\nheart, but servants, tools; in his intercourse with men, he is always\nintent on making something out of them” (WP 962). The\ngreat man approaches others instrumentally not only because of his\nfundamental proclivity for solitude, but because of another\ndistinguishing characteristic: he is consumed by his work, his\nresponsibilities, his projects.\n\nSecond, higher types seek burdens and responsibilities, in the pursuit\nof some unifying project. “What is noble?”\nNietzsche again asks in a Nachlass note of 1888. His answer:\n“That one instinctively seeks heavy responsibilities” (WP\n944). So it was with Goethe: “he was not fainthearted but took\nas much as possible upon himself, over himself, into himself”\n(TI IX:49). But the higher type does not seek out responsibilities and\ntasks arbitrarily. “A great man,” says Nietzsche displays\n“a long logic in all of his activity…he has the ability\nto extend his will across great stretches of his life and to despise,\nand reject everything petty about him” (WP 962). This is the\ntrait Nietzsche sometimes refers to as having “style” in\n“character” (GS 290). (Note that this famous passage (GS\n290) merely describes those — “the strong and\ndomineering natures” — who are able “‘to\ngive’ style” to their character; it does not presuppose\nthat just anyone can do so and it is not a recommendation that\neveryone try to do so.) Indeed, Nietzsche understood his own life in\nthese terms:\n\n[T]he organizing “idea” that is destined to rule [in\none’s life and work] keeps growing deep down — it begins\nto command; slowly it leads us back from side roads and wrong\nroads; it prepares single qualities and fitnesses that will\none day prove to be indispensable as means toward a whole — one\nby one, it trains all subservient capacities before giving\nany hint of the dominant task, “goal,” “aim,”\nor “meaning.”\n\n\nConsidered in this way, my life is simply wonderful. For the task of a\nrevaluation of all values more capacities may have been\nneeded than have ever dwelt together in a single individual….I\nnever even suspected what was growing in me — and one day all my\ncapacities, suddenly ripe, leaped forth in their ultimate\nperfection. (EH II:9). \n\n\nEarlier in Ecce Homo, Nietzsche describes himself as a higher\ntype, “a well-turned-out-person” (EH I:2), and thus we may\nconclude that it is a characteristic only of the higher type\nthat he is driven in pursuit of a project in the way described here.\nIndeed, it turns out to be precisely this kind of instinctive\ndrivenness that Nietzsche has partly in mind when he praises\n“health.”\n\nThird, higher types are essentially healthy and resilient. One\nessential attribute of the “well-turned-out-person” is\nthat he “has a taste only for what is good for him; his\npleasure, his delight cease where the measure of what is good for him\nis transgressed. He guesses what remedies avail against what is\nharmful; he exploits bad accidents to his advantage” (EH I:2).\nBut this is just to say that a higher type is healthy, for\nhealth, Nietzsche tells us, means simply “instinctively\ncho[osing] the right means against wretched states” (EH\nI:2). This permits us to understand Nietzsche’s own declaration\nin Ecce Homo that he was “healthy at\nbottom” (EH I:2), a seemingly paradoxical claim for a\nphilosopher whose physical ailments were legion. Yet\n“health,” for Nietzsche, is a term of art, meaning not the\nabsence of sickness, but something closer to resilience, to\nhow one deals with ordinary (physical) sickness and setbacks.\n“For a typical healthy person,” Nietzsche says,\n“being sick can even become an energetic stimulus for\nlife, for living more. This, in fact, is how [my own] long period of\nsickness appears to me now…it was during the years of\nmy lowest vitality that I ceased to be a pessimist; the\ninstinct of self-restoration forbade me a philosophy of\npoverty and discouragement” (EH I:2). To cease to be a pessimist\nis to reject MPS, for only under the color of MPS does life appear to\nlack value. Thus, being healthy, in turn, entails a distinctive\nnon-pessimistic attitude towards life — which is yet a fourth\nmark of the higher type.\n\nFourth, higher types affirm life, meaning that they are prepared to\nwill the eternal return of their lives. In Beyond Good\nand Evil, Nietzsche describes “the opposite ideal” to\nthat of moralists and pessimists like Schopenhauer as “the ideal\nof the most high-spirited, alive, and world-affirming human being who\nhas not only come to terms and learned to get along with whatever was\nand is, but who wants to have what was and is repeated into\nall eternity” (BGE 56). Put more simply: the higher type\nembraces the doctrine of the eternal recurrence and thus evinces what\nNietzsche often calls a “Dionysian” or\n“life-affirming” attitude. A person, for Nietzsche, has a\nDionysian attitude toward life insofar as he affirms his life\nunconditionally; in particular, insofar as he affirms it including the\n“suffering” or other hardships it has involved. So someone\nwho says, “I would gladly live my life again, except for my\nfirst marriage,” would not affirm life in the requisite sense.\nThus, we may say that a person affirms his life in Nietzsche’s\nsense only insofar as he would gladly will its eternal return: i.e.,\nwill the repetition of his entire life through eternity. In fact,\nNietzsche calls “the idea of the eternal recurrence” the\n“highest formulation of affirmation that is at all\nattainable” (EH III:Z-1; cf. BGE 56). Higher men, then, are\nmarked by a distinctive Dionysian attitude toward their life: they\nwould gladly will the repetition of their life eternally.\n\nStrikingly, Nietzsche claims that precisely this attitude\ncharacterized both himself and Goethe. Speaking, for example, of the\nneglect by his contemporaries of his work, Nietzsche writes: “I\nmyself have never suffered from all this; what is necessary\ndoes not hurt me; amor fati [love of fate] is my inmost\nnature” (EH III:CW-4). Regarding Goethe, Nietzsche says that,\n“Such a spirit…stands amid the cosmos with a joyous and\ntrusting fatalism, in the faith…that all is redeemed\nand affirmed in the whole….Such a faith, however, is the\nhighest of all possible faiths: I have baptized it with the name of\nDionysus” (TI IX:49).\n\nFinally, the higher type of human being has a distinctive bearing\ntowards others and especially towards himself: he has self-reverence.\n“The ‘higher nature’ of the great man,” says\nNietzsche in a striking Nachlass note of 1888 “lies in\nbeing different, in incommunicability, in distance of rank, not in an\neffect of any kind — even if he made the whole globe\ntremble” (WP 876; cf. GS 55). This is perhaps the most unusual\nfeature of Nietzsche’s discussion of the higher type, for it\nsuggests that, at bottom, being a higher type is a matter of\n“attitude” or “bearing.” In a section of\nBeyond Good and Evil, Nietzsche once again answers the\nquestion, “What is noble?”, this time as follows:\n“It is not the works, it is the faith that is decisive\nhere, that determines the order of rank…: some fundamental\ncertainty that a noble soul has about itself, something that cannot be\nsought, nor found, nor perhaps lost. The noble soul has reverence\n[Ehrfurcht] for itself” (BGE 287). Self-reverence —\nto revere and respect oneself as one might a god — is no small\nachievement, as the proliferation of “self-help” programs\nand pop psychology slogans like “I’m OK, you’re\nOK” would suggest. Self-loathing, self-doubt, and\nself-laceration are the norm among human beings; to possess a\n“fundamental certainty” about oneself is, Nietzsche thinks\nquite plausibly, a unique state of affairs.\n\nAllied with this posture of self-reverence are other distinctive\nattitudes that distinguish the bearing of the higher man. “The\nnoble human being,” says Nietzsche, “honors himself as one\nwho is powerful, also as one who has power over himself, who knows how\nto speak and be silent, who delights in being severe and hard with\nhimself and respects all severity and hardness” (BGE 260). (The\nhigher man, unsurprisingly, is no hedonist: “What is\nnoble?” asks Nietzsche: “That one leaves happiness to the\ngreat majority: happiness as peace of soul, virtue, comfort,\nAnglo-angelic shopkeeperdom a la Spencer” (WP 944).) In an\nearlier work, Nietzsche explains that:\n\n[T]he passion that attacks those who are noble is peculiar….It\ninvolves the use of a rare and singular standard cold to everybody\nelse; the discovery of values for which no scales have been invented\nyet; offering sacrifices on altars that are dedicated to an unknown\ngod; a courage without any desire for honors; self-sufficiency that\noverflows and gives to men and things. (GS 55)\n\n\nIndeed, the ability to set his own standard of valuation is one of the\nmost distinctive achievements of the higher type, as we saw already in\nthe discussion of solitude. And “the highest man”\nsays Nietzsche is “he who determines values and directs\nthe will of millennia by giving direction to the highest\nnatures” (WP 999).\n\nConsidered all together, it becomes clear why creatives geniuses like\nGoethe, Beethoven, and Nietzsche himself should be the preferred\nexamples of the higher human being: for the characteristics of the\nhigher type so-described are precisely those that lend themselves to\nartistic and creative work. A penchant for solitude,\nan absolute devotion to one’s tasks, an indifference to external\nopinion, a fundamental certainty about oneself and one’s values\n(that often strikes others as hubris) — all these are the traits\nwe find, again and again, in artistic geniuses. (It turns out, for\nexample, that Beethoven, according to his leading biographer, had\nalmost all these characteristics to a striking degree; for discussion,\nsee Leiter 2002: 122–123.)\n\nIf “the men of great creativity, the really great men according\nto my understanding” (WP 957), men like Goethe and Beethoven,\nare Nietzsche’s paradigmatic higher types, whose lives are\nmodels of flourishing excellence, is there anything systematic to be\nsaid about the theory of value that undergirds these judgments and\ninforms, in turn, Nietzsche’s critique of morality (MPS) on the\ngrounds that it thwarts the development of such men?\n\nOne popular idea (e.g., Schacht 1983, Richardson 1996) is that higher\nmen exemplify “power,” which is claimed to be\nNietzsche’s fundamental criterion of value. Such readings, alas,\nhave to employ the concept of “power” rather elastically,\nsince the conglomeration of traits of higher human beings noted above\ndon’t seem to be, in any ordinary sense, instances of\n“power” or its manifestation. (Treating Nietzsche’s\nfundamental criterion of value as “power” confronts even\nmore serious textual and philosophical obstacles: see Section 3.1,\nbelow.)\n\nMore illuminating is Hurka’s view (1993 and Hurka 2007) that\nNietzsche’s evaluative posture conjoins perfectionism with\nmaximizing consequentialism: what has value are certain human\nexcellences (or perfections), and states of affairs are assessed in\nterms of their maximization of these excellences. As Hurka helpfully\nobserves (1993: 75), Nietzsche seems to operate with the opposite of\nRawls’s maximin principle, what Hurka calls appropriately\n“maximax.” Hurka states this as a rule for conduct\n(“each agent’s overriding goal should be not a sum or\naverage of lifetime value, but the greatest lifetime value of the\nsingle most perfect individual, or, if perfections are not fully\ncomparable, of the few most perfect individuals” [1993: 75]),\nbut given the earlier caveats about reading Nietzsche as a\nconventional normative theorist, it is better to treat maximax as\nreflecting the implicit structure of Nietzsche’s revaluation of\nvalues: he rejects MPS because it fails to maximize the perfection of\nthe highest human beings, and he does so without, it appears, any\nregard for the costs to the herd of such a rejection (see Section\n4).\n\nThis leaves the question whether there are (formal or substantive)\ncriteria of “perfection” for Nietzsche? Many writers\n(e.g., Hurka 2007; Nehamas 1985; Richardson 1996) are attracted to the\nidea that “style” or “unity” is a criterion of\nexcellence or perfection for Nietzsche, and, indeed, as noted above,\nthe pursuit of a unified or coherent life project is a characteristic\nfeature of those Nietzsche deems to be higher men. Whether such style\nor coherence suffices is a vexed interpretive question, since it is\nnot entirely clear that the formal criterion of style or unity is\navailable only to Goethes and Beethovens: did not Kant, that\n“catastrophic spider” as Nietzsche unflatteringly calls\nhim (A 11), exhibit an extraordinarily coherent style of creative\nproductivity over many years?\n\nOthers (e.g., Magnus 1978) take Nietzsche’s idea of eternal\nrecurrence (the hallmark of life-affirmation, as noted above) as the\ncriterion of a well-lived life: perfection is a matter of living in\nsuch a way that one is ready to gladly will the repetition of\none’s life, in all its particulars, in to eternity. This, too,\nseems both too thin and too severe as a criterion of perfection\nstanding alone: too thin, because anyone suitably superficial and\ncomplacent might will the eternal return; too severe, because it seems\nto require that a post-Holocaust Goethe gladly will the repetition of\nthe Holocaust.\n\nNehamas (1985), who shares some of Magnus’s view, adds a\nsurprising twist to this account: he claims that Nietzsche does not\ndescribe his ideal person — his “higher\nman” — but rather “exemplifies” such a person\nin the form of the “character” that is constituted by and\nexemplified in his corpus. Nietzsche, however, describes at\ngreat length and in many places (e.g. D 201; GS 55; BGE 287; NCW\nEpilogue:2; WP 943) the types of persons he admires; and he also\ndescribes himself as such a person (e.g., EH I:2) In any\ncase, Nehamas’s view would have the odd consequence that for\nNietzsche to have had a positive ethical vision at any point earlier\nin his career he would have had to anticipate writing the series of\nbooks he actually wrote, such that his ethical ideal would be properly\nexemplified in them! Needless to say, there is no reason to think this\nwas Nietzsche’s view.\n3. Nietzsche’s Metaethics\n\nNietzsche holds that moral (i.e., MPS) values are not conducive to the\nflourishing of human excellence, and it is by reference to\nthis fact that he proposed to assess their value. The\nenterprise of assessing the value of certain other values (call them\nthe ‘revalued values’) naturally invites the metaethical\nquestion: what status — metaphysical, epistemological — do\nthe values used to undertake this revaluation (the ‘assessing\nvalues’) enjoy? (It is doubtful Nietzsche has a definite\nsemantic view about judgments of value: cf. Hussain 2013, esp. 412.)\nFollowing Leiter (2019: 49–50), we may distinguish “Privilege\nReadings” of Nietzsche’s metaethics — which claim\nthat Nietzsche holds that his own evaluative standpoint is either\nveridical or better justified than its target — from those\nreadings which deny the claim of privilege. (Note that defenders of\nthis latter, “skeptical” view need not read Nietzsche as a\nglobal anti-realist — i.e., as claiming that there are no truths\nor facts about anything, let alone truths about value — a\nreading which has now been widely discredited. There is, on the\nskeptical view at issue here, a special problem about the\nobjectivity of value. For an argument that Nietzsche is a global\nanti-realist about value in particular, see Leiter 2019: 84–111.)\n3.1 Privilege Readings\n\nPrivilege Readings of Nietzsche come in two main varieties: Realist\nand Privilege Non-Realist (P-Non-Realist). The proponents of these\nviews would hold the following:\n\n\n(i) According to the Realist, there are normative facts.\n\n(ii) According to the P-Non-Realist, there are no normative facts, but\nsome normative judgments still enjoy a privilege by virtue of their\ninterpersonal appeal or acceptance.\n\n\nTo say that there are ‘normative facts’ will\nmean, for purposes here, that norms are (in some sense)\nobjective, i.e., mind- or attitude-independent features of\nthe world. Wilcox (1974), Schacht (1983) and Katsafanas (2013b), among\nmany others, have defended a Realist reading, while Foot (1973) has\ndefended a P-Non-Realist reading. We consider the difficulties\nafflicting these Privilege Readings in turn.\n\nRealist readings assign a special place to power (or will to power) in\nexplaining the objectivity of normative facts. On these views,\nNietzsche holds, first, that only power really has value and,\nsecond, that power is an objective, natural property.\nNietzsche’s evaluative perspective is privileged, in turn,\nbecause it involves assessing (i) prudential value (value\nfor an agent) in terms of degree of power, and (ii)\nnon-prudential value in terms of maximization of prudential value\n(i.e., maximization of power). \n\nAccording to Schacht, for example, Nietzsche’s account of\n“the fundamental character of life and the world” as\nwill to power is supposed to “ground” his own\nevaluative standpoint (1983: 348–349). As Nietzsche writes (in a\npassage Schacht quotes): “assuming that life itself is the will\nto power,” then “there is nothing to life that has value,\nexcept the degree of power” (WP 55). Nietzsche’s\nrevaluation of values, then, assesses moral values on the basis of\ntheir “degree of power,” something which constitutes an\n“objective measure of value” (WP 674). Hence the privilege\nof his view: it embraces as an evaluative standard the only thing in\nlife that (in fact) has value (namely power), and employs this\n“objective measure of value” in the revaluation (e.g., by\ncriticizing Christian morality because it does not maximize\n“power”).\n\nWhat exactly is Nietzsche’s argument on the N-Realist\nreading? Schacht writes:\n\nHuman life, for Nietzsche, is ultimately a part of a kind of vast\ngame…[which] is, so to speak, the only game in town….The\nnature of the game, he holds, establishes a standard for the\nevaluation of everything falling within its compass. The availability\nof this standard places evaluation on footing that is as firm as that\non which the comprehension of life and the world stands. (1983, p.\n398)\n\n\nTalk of “the only game in town” is far too metaphorical,\nhowever, to bear the philosophical weight demanded. From the fact that\n“life itself is the will to power,” how does it follow\nthat power is the only standard of value? From the fact, for\nexample, that all life obeys the laws of fundamental physics, nothing\nfollows about the appropriate standard of value. What Schacht and some\nothers seem to have in mind is something like John Stuart Mill’s\nargument for utilitarianism, which proceeds from the premise that\nsince happiness is the only thing people desire or aim for, it follows\nthat happiness is the only thing that possesses intrinsic value. This\nargument, though, is famously unsuccessful: from the fact that only\nhappiness is desired, nothing at all follows about what\nought to be desired. Attempts to construe Nietzsche’s\nargument in an analogous way encounter similar problems (Leiter 2000\nexplores the analogy in detail).\n\nOn Mill’s well-known and oft-criticized ‘proof’ of\nthe principle of utility from his 1861 Utilitarianism, to\nshow that something is visible, we must show that it is seen; and to\nshow that something is audible, we must show that it is heard;\nanalogously,\n\n(P) to show that something is desirable (i.e., valuable), show that it\nis desired.\n\n\nMillian hedonism holds that only happiness or pleasure is\nintrinsically desirable or valuable (‘Prescriptive\nHedonism’). Let us call ‘Value Nihilism’ the view\nthat there is nothing that has value or is valuable (or desirable). To\nget Prescriptive Hedonism from (P), then, plug in ‘Descriptive\nHedonism’ — the thesis that people do in fact desire\nonly pleasure as an end. If (P) is valid, Descriptive\nHedonism true, and Value Nihilism false, then the truth of\nPrescriptive Hedonism follows. ((P), of course, is not valid, a point\nto which we will return.)\n\nNotice, now, that the same type of argument seems to capture what the\nN-Realist construal of Nietzsche has in mind. That is, to get the\nN-Realist Nietzschean conclusion that what is valuable is power, take\n(P) and plug in a strong form of Nietzsche’s descriptive\ndoctrine of the will to power — the doctrine, roughly, that all\npersons intrinsically ‘desire’ only power. If (P) is\nvalid, Value Nihilism false, and the descriptive doctrine of the will\nto power is true, then the normative conclusion about power, which\nSchacht is after, seems to follow. (Note, of course, that the Millian\nModel argument as formulated so far would show only that power is what\nis non-morally valuable or good for an agent. Of course, if the\nMillian Model argument for prudential value or non-moral goodness does\nnot work, then that provides a very strong (if defeasible)\nreason for supposing that there is no further argument for the related\naccount of non-prudential value as consisting in maximization of\npower.)\n\nWhat are the problems with this “Millian argument”? The\nfirst problem, of course, is that (P) is not valid. While from the\nfact that x is heard, it follows that x is audible,\nit does not follow from that fact that x is desired that\nx is desirable in the sense necessary for the\nargument. For while ‘audible’ can be fairly rendered\nas ‘can be heard,’ ‘desirable,’ in the context\nof Prescriptive Hedonism, means ‘ought to be\ndesired’ (not ‘can’ or ‘is’ desired).\nThus, while it follows that:\n\nIf x is heard, then x can be heard (‘is\naudible’),\n\n\nit does not follow that,\n\nIf x is desired, then x ought to be desired\n(‘is desirable’).\n\n\nYet in claiming that pleasure or power are valuable, Mill and the\nN-Realist Nietzsche are advancing a normative thesis. The truth of\nthis normative thesis, however, simply does not follow from the\ncorresponding descriptive thesis.\n\nMany, of course, have thought this too facile a response. Supplement\nthe argument, then, by adding an ‘Internalist Constraint’\n(IC), one that many philosophers have found plausible in the theory of\nvalue:\n\n(IC) Something cannot be valuable for a person unless the person is\ncapable of caring about (desiring) it.\n\n\nThe (IC) is motivated by the thought that it cannot be right to say\nthat ‘X is valuable’ for someone when x is alien\nto anything a person cares about or could care about: any\nplausible notion of value, the (IC) supposes, must have some strong\nconnection to a person’s existing (or potential) motivational\nset.\n\nHow does the (IC) help? Recall (P):\n\n(P) To show that something is desirable (i.e., valuable) show that it\nis desired.\n\n\nNow the (IC) puts a constraint on what things can, in fact, be\ndesirable or valuable: namely, only those things that agents can, in\nfact, care about or desire. This suggests that we might reformulate\n(P) as follows:\n\n(P′) To show that something is desirable (i.e., valuable), show\nthat it is or can be desired.\n\n\n(P′) now is simply a different formulation of the (IC): if we\naccept the (IC) then we should accept (P′). But what happens,\nthen, if we grant the truth of Descriptive Hedonism: namely, that only\npleasure is, in fact, desired. In that case, it would now follow that\nonly pleasure is desirable (ought to be desired) (assuming, again,\nthat Value Nihilism is false). That is, since something ought to be\ndesired only if it can be desired (internalism), then if only\nx can be desired, then only x ought to be\ndesired (assuming that Value Nihilism is false).\n\nWill this argument rescue the N-Realist Nietzsche? Two obstacles\nremain. The first, and perhaps less serious one, is that we must have\nsome reason for accepting the (IC) — or, more modestly, some\nreason for thinking Nietzsche accepts it. It is not clear, however,\nthat there are adequate textual grounds for saying where Nietzsche\nstands on this question. Since the (IC) does, however, seem to be\npresupposed by the Nietzschean remarks from the Nachlass that\nsupport N-Realism — in the sense that such remarks do not\nconstitute a good argument without the (IC) — let us grant that\nNietzsche accepts the (IC), and let us simply put aside the\ncontentious issue of whether we ought to accept the (IC) as a general\nphilosophical matter.\n\nA second difficulty will still remain: namely, that the argument for\nN-Realism still depends on the truth of the relevant descriptive\nthesis, in Nietzsche’s case, the doctrine of the will to power.\nThis presents two problems. First, in the works Nietzsche chose to\npublish, it seems clear that he did not, in fact, accept the doctrine\nin the strong form required for the N-Realist argument (namely, that\nit is only power that persons ever aim for or desire). Second, it is\nsimply not a plausible doctrine in its strong form.\n\nFor the Millian Model argument for N-Realism to work in its new form\n(that is, supplemented with the (IC)) it must be the case that that\nwhich ought to be desired (‘is valuable’) are the\nonly things that are, in fact, desired. Since the N-Realist\nNietzschean conclusion is that only power is valuable, power must be\nthe only thing that is, in fact, desired (assuming, again, that\nsomething is valuable, i.e., that Value Nihilism is false).\nMany, of course, have thought that Nietzsche held precisely this view,\nand he plainly says much to suggest that. Zarathustra states that,\n“Where I found the living, there I found will to power” (Z\nII:12); Nietzsche refers to “the will to power which is the will\nof life” (GS 349); he says “the really fundamental\ninstinct of life…aims at the expansion of power”\n(GS 349); “life simply is will to power,” meaning\na striving “to grow, spread, seize, become predominant”\n(BGE 259); he refers to his “theory that in all events a\nwill to power is operating” (GM II:12); he claims that\n“[a] living thing seeks above all to discharge its\nstrength — life itself is will to power” (BGE\n13); and so on.\n\nThe difficulty is that Nietzsche says other things which might suggest\nthat the stronger remarks are misleading; for example:\n\nLife itself is to my mind the instinct for growth, for durability, for\nan accumulation of forces, for power: where the will to power\nis lacking there is decline. It is my contention that all the supreme\nvalues of mankind lack this will…. (A 6)\n\n\nBut if all actions manifested this will, then this\nwill could never be found lacking. Yet Nietzsche thinks it\ncan be lacking, which means he must countenance the possibility that\nnot everyone aims for (‘desires’) power.\n\nThis passage is not atypical. Later in the same work, he returns to\nthe same theme concerning “[w]herever the will to power declines\nin any form” (A 17). In the immediately preceding work he claims\nthat the “effects” of liberal institutions are\n“known well enough: they undermine the will to power” (TI\nIX:38). And in the immediately subsequent work (his last), Nietzsche\nrefers to “the terrible aspects of reality (in affects,\nin desires, in the will to power)…” (EH IV:4), which\ncertainly sounds as if will to power is simply one among various\ncharacteristics of reality — alongside affects and\ndesires, rather than the essential core of them all.\n\nThree other general textual considerations count against attributing\nthe strong doctrine of the will to power to Nietzsche. First, if, as\nthe defenders of the strong doctrine believe, “his fundamental\nprinciple is the ‘will to power’”, then it\nis hard to understand why he says almost nothing about will to power\n— and nothing at all to suggest it is his “fundamental\nprinciple” — in the two major self-reflective moments in\nthe Nietzschean corpus: his last major work, Ecce Homo, where\nhe reviews and assesses his life and writings, including specifically\nall his prior books (EH III); and the series of new prefaces he wrote\nfor The Birth of Tragedy, Human, All Too Human,\nDawn, and The Gay Science in 1886, in which he\nrevisits his major themes. That this putative “fundamental\nprinciple” merits no mention on either occasion strongly\nsuggests that its role in Nietzsche’s thought has been greatly\noverstated.\n\nSecond, the view at issue presupposes an unusually strong doctrine of\nthe will to power: a doctrine, to the effect, that all life\n(actions, events) reflects the will to power. But recent scholarship\nhas cast doubt on whether Nietzsche ultimately accepted such a\ndoctrine. The single most famous passage on will to power in the\nNietzschean corpus, for example, is the concluding section (1067) of\nThe Will to Power, where he affirms that, “This\nworld is the will to power — and nothing besides! And you\nyourselves are also this will to power — and nothing\nbesides!” Although a favorite of commentators for many years,\nthe passage has now been conclusively discredited by the leading\nscholar of the Nachlass, the late Mazzino Montinari.\nMontinari has shown that Nietzsche had, in fact, discarded the passage\nby the spring of 1887 (1982, pp. 103–104)! It was, as Montinari\nnotes, made part of the Köselitz-Forster compilation of The\nWill to Power (the basis for the English-language edition by\nKaufmann and Hollingdale) notwithstanding “Nietzsche’s\nliterary intentions” (1982, p. 104).\n\nFinally, Maudemarie Clark has argued that Nietzsche could not have\naccepted the very strongest form of the doctrine of the will to power\n— namely, that all force, animate and inanimate, is\nwill to power — given the putative argument he gives for it.\nClark points out that the only argument for this\ndoctrine of the will to power in Nietzsche’s published works\n— in Section 36 of Beyond Good and Evil — is cast\nin the conditional form: if we accept certain initial hypotheses,\nthen, Nietzsche thinks, the strong doctrine of the will to power\nfollows. But one of the antecedents of this conditional is the\n“causality of the will,” and Clark argues that Nietzsche\nclearly rejects such causality elsewhere in his work (e.g.,\nGS 127, TI II:5, TI VI:3). Therefore, this section cannot constitute\nan argument for the strongest doctrine of the will to power that\nNietzsche, himself, would actually accept! Rather than embracing the\nstrongest form of the doctrine, Clark argues that Nietzsche is,\nsomewhat ironically, illustrating the very flaw of philosophers he\nwarns against in the surrounding passages: namely, their tendency to\npropound theories of the essence of reality that are just projections\nof their own evaluative commitments (Clark 1990, pp. 212–227).\nThus, Nietzsche says of the Stoic talk of living “according to\nnature” that “while you pretend rapturously to read the\ncanon of your law in nature, you want something opposite….Your\npride wants to impose your morality, your ideal, on\nnature…” (BGE 9). How, Clark wonders, could\nNietzsche’s own doctrine of will to power be exempted from such\na charge? (Note, too, that Montinari claims that the one surviving\nrelic of 1067 of The Will to Power in the published works is\nprecisely the ironic Section 36 of Beyond Good and Evil\n(1982, p. 104).)\n\nWhat, then, does Nietzsche believe about will to power? There are, to\nbe sure, competing views in the secondary literature. Reginster 2006\ntreats will to power as a will to overcome resistances; Richardson\n1996 treats will to power as the tendency of every drive to redirect\nevery other drive towards its own ends. As others have noted (e.g.,\nClark 1990: 209–212), Nietzsche’s doctrine of will to\npower, in its original deployment and most of its later occurrences in\nthe published work, is psychological in character: the will\nto power is posited as the best psychological explanation for a wide\nvariety of human behaviors. Here Richardson’s account seems to\nfare somewhat better than Reginster’s. (Katsafanas 2013b follows\nReginster, and tries to develop a “constitutivist” account\nof objective value based on the idea that all actions aim to overcome\nresistances; Huddleston 2017 offers a trenchant critique of the\nplausibility of such a view.) Yet Richardson’s account has\ndifficulty with some of Nietzsche’s claims, as when he says that\n“every animal…instinctively strives for optimal conditions\nunder which it can…attain its maximum in the feeling of power”\n(GM III:7), which seems to propose desire for power as a competitor\nwith psychological hedonism. But a universal desire for either\npleasure or power feelings is not especially plausible, even if both\nmotives are important ones. Indeed, as the preceding passages and\nconsiderations make clear, Nietzsche could not have believed that will\nto power was the exclusive explanation for all human behavior. To the\nextent he sometimes seems to embrace this stronger claim (see the\nexample, above), we must simply take Nietzsche to have overstated his\ncase — something which his penchant for hyperbolic rhetoric and\npolemics often leads him to do — or to be engaged in the kind of\nironic move described by Clark, above. That would, of course, be quite\nfortunate, since it is hardly plausible that will to power is the\nexclusive explanation for all human behavior\n\nThere is an additional, textual worry for the argument that will to\npower provides an objective criterion of value lurking here as well.\nNietzsche only makes the remarks that seem to suggest that power is an\nobjective criterion in passages from the Nachlass, work that\nNietzsche never published during his lifetime. Thus, even if one\nthought that Nietzsche really held the strong descriptive doctrine of\nthe will to power — the doctrine that all animate force (perhaps\nall force) is will to power — in his published works,\nit is still the case that he only uses this doctrine to argue for the\nnormative conclusion in Nachlass material. Since scholars\nhave now raised important doubts about the canonical status of this\nNachlass material (Montinari 1982, pp. 92–104;\nHollingdale 1985, pp. 166–172, 182–186), this might\nsuggest that a view ought not to be attributed to Nietzsche\nsolely on the basis of its articulation in these notebooks,\nwhich is exactly what the N-Realist reading requires. (For more recent\ndebate about the relevance of the Nachlass material to\nunderstanding will to power, see Katsafanas 2013b, pp. 248–250 and\nLeiter 2019, pp. 60–62.)\n\nAlthough not attributing to Nietzsche any kind of value realism,\nPhilippa Foot, like Schacht, wants to show that Nietzsche is doing\nsomething more than simply expressing his idiosyncratic view, a view\nthat admits of no interpersonal justification. While agreeing that\nNietzsche’s intention is, in part, “to present us with a\nclash of interests — the good of the strong against that of the\nweak,” Foot adds that “this is not all he wants to\nsuggest” (1973: 162). Noting that Nietzsche “seems to want\nto say that anyone who is strong, independent, and so on —\nanyone who fits his description of the higher type of man — is\none who has value in himself” (163), Foot goes on to\nexplicate this notion of “value” as follows:\n\n[I]t does make sense to say that we value strong and\nexceptional individuals…. We do find patterns of reaction to\nexceptional men that would allow us to see here a valuing rather\nsimilar to valuing on aesthetic grounds…. I am thinking of the\ninterest and admiration which is the common attitude to remarkable men\nof exceptional independence of mind and strength of will….\n[Nietzsche] is appealing to our tendency to admire certain\nindividuals whom we see as powerful and splendid…. [There is] a\nsimilarity between the way we attribute value (aesthetic\nvalue) to art objects and the value that Nietzsche attributes\nto a certain kind of man, both resting on a set of common\nreactions…. (1973: 163)\n\n\nSo Nietzsche, on this account, does not claim that his evaluative\nperspective is veridical; he simply claims that it enjoys a certain\nsort of interpersonal appeal, owing to our “common attitude to\nremarkable men,” “our tendency to admire certain\nindividuals,” to find them aesthetically appealing. There may be\nno fact-of-the-matter as to whether higher men are or are not\nreally valuable, but Nietzsche’s evaluative standpoint\nis privileged by virtue of its appeal to all of us. We’re all\ninterested, it seems, in the flourishing of higher men.\n\nYet Nietzsche could not embrace the view that the flourishing of\n“higher men” will appeal to “our\ntendency” to admire such men or to any sort of\n“common” attitude, given the logic of his critique of\nmorality. This follows from what we may call Nietzsche’s\n‘Callicleanism,’ after Plato’s Callicles in the\nGorgias. It has now become something of a commonplace for\ncommentators to note that Nietzsche did not accept one sort\nof Calliclean view, namely, the view that “anyone who is to live\naright should suffer his appetites to grow to the greatest extent and\nnot check them” (Gorgias, 419e) (cf. Nehamas 1985:\n202–203; BGE 188). Yet there remains a more important respect in\nwhich Nietzsche’s view is Calliclean: namely, in its\nembrace of the Calliclean doctrine that the inferior employ morality\nto make “slaves of those who are naturally better”\n(Gorgias, 491e-492a), that the weaker folk, the\nmajority…frame the laws [and, we might add, the morals] for\ntheir own advantage’ in order to ‘frighten [the strong] by\nsaying that to overreach others is shameful and evil’\n(Gorgias, 483b-d). In short, Callicles’ view is that\nmorality is simply the prudence of the weak, who unable to do what the\nstrong can do, opt instead to put the actions of the strong under the\nban of morality. This, of course, is essentially Nietzsche’s\nview as well. So, for example, Nietzsche describes slave morality as\nsimply ‘the prudence [Klugheit] of the lowest\norder’ (GM I:13), and he observes that “everything that\nelevates an individual above the herd and intimidates the neighbor\nis…called evil” (BGE 201), that “[m]oral\njudgments and condemnations constitute the favorite revenge of the\nspiritually limited against those less limited” (BGE 219), and\nhe claims that the “chief means” by which the “weak\nand mediocre…weaken and pull down the stronger” is\n“the moral judgment” (WP 345).\n\nRecall, now, that Foot wanted to resist the view that in his\nrevaluation Nietzsche simply “present[s] us with a clash of\ninterests — the good of the strong against that of the\nweak” (1973: 162); instead, Foot suggests that Nietzsche is\nappealing to a ‘common’ tendency to admire higher men, men\nwho would otherwise be thwarted by the reign of moral values. But for\na Calliclean like Nietzsche, it is part of the very appeal of morality\nthat it does thwart the flourishing of higher men. If that is\nright, then he could not think that the flourishing of\n“higher men” would appeal to everyone. It is precisely\nbecause it doesn’t that morality arises in the first place, as a\nmeans for the low and base to thwart the flourishing of the high. This\nis not to deny that higher men may still be admirable in the eyes of\nthe base and low (hence their envy); it is to deny, however, that\nNietzsche’s evaluative perspective — that it is an\nobjection to morality that it thwarts the high — could\nenjoy a privilege in virtue of this shared admiration. On the\nCalliclean picture, there is a fundamental hostility between the high\nand low, the strong and the weak, one which will not be bridged by\ninviting the low to admire the high, or the weak, the strong.\n“The well-being of the majority and the well-being of the few\nare opposite viewpoints of value,” Nietzsche says in the\n‘Note’ at the end of the first essay of the\nGenealogy. And in Nietzsche’s revaluation, it appears,\nthere is no evaluative standpoint from which one could successfully\nmediate and reconcile the normative claims of the opposing\nmoralities.\n3.2 Nietzsche’s Anti-Realism\n\nIf Nietzsche is not a realist about value, then he must be an\nanti-realist: he must deny that there is any objective fact of the\nmatter that would privilege his evaluative perspective over its\ntarget. (This, in fact, is the most familiar reading outside the\nsecondary literature on Nietzsche; one finds this view of\nNietzsche’s metaethics, for example, in the sociologist Max\nWeber and the moral philosopher Alasdair MacIntyre, among many\nothers.) We must be careful about the kinds of judgments to which this\nanti-realism applies. Recall that in his critique of morality,\nNietzsche appears to hold that, e.g., “herd” morality is\ngood for the herd, but that it is bad for higher\nmen. He says, for example, that, “The ideas of the herd\nshould rule in the herd — but not reach out beyond\nit” (WP 287; emphasis added); and elsewhere he describes slave\nmorality as simply “the prudence of the lowest order” (GM\nI:13). It may appear that regarding value judgments pertaining to\nwelfare or prudential goodness — what is good or bad for\nparticular sorts of persons — Nietzsche believes there is an\nobjective fact of the matter, though one relative to type-facts about\npersons. But this is not right: while Nietzsche believes it is\nobjectively correct that different moralities have certain effects on\ndifferent kinds of people, that these effects are “good”\nor “bad” itself admits of anti-realist interpretation (cf.\nLeiter 2015: 119 for a revision of the view defended in Leiter 2002).\nEven more importantly, though, Nietzsche’s anti-realism applies\nto the “revaluative” judgment that follows upon these\njudgments about the effects of different moralities: that is, the\njudgment that because herd morality is good for the\nherd but bad for higher men, herd morality (or the universal\nreign of herd morality) is bad or disvaluable. (Leiter 2019: 84–111\nargues that Nietzsche’s anti-realism even extends to epistemic\nvalue, an issue beyond the scope of this entry.)\n\nNietzsche certainly says much that sounds like he is denying the\nobjectivity of values. Zarathustra tells us that, “Verily, men\ngave themselves all their good and evil [Gut und\nBöse]” (Z I:15) and that “good and evil that are\nnot transitory do not exist” (Z II:12). In The Gay\nScience, Nietzsche explains that, “Whatever has\nvalue in our world now does not have value in itself,\naccording to its nature — nature is always value-less, but has\nbeen given value at some time” (301; cf. D 3). Indeed,\nlike certain radical anti-realists, he tends to equate evaluative\nquestions with matters of taste. “What is now decisive against\nChristianity is our taste [Geschmack], no longer our\nreasons” (GS 132), he writes, noting later in the same work that\nwhat counts as “justice…is by all means a matter of\ntaste, nothing more” (GS 184).\n\nNietzsche’s primary argument for anti-realism about value is\nexplanatory: moral facts don’t figure in the\n“best explanation” of experience, and so are not real\nconstituents of the objective world (Leiter 2019: 17–48). Moral\nvalues, in short, can be “explained away.” Such a\nconclusion follows from Nietzsche’s naturalism (on the latter,\nsee the competing accounts in Janaway 2007 and Leiter 2013). As we saw\nin the context of Nietzsche’s critique of morality, Nietzsche\nthinks a person’s moral beliefs can be explained in naturalistic\nterms, i.e., in terms of type-facts about that person. Thus, to\nexplain a person’s moral judgments, one needn’t appeal to\nthe existence of objective moral facts: psycho-physical facts about\nthe person suffice. Thus, since non-evaluative type-facts are the\nprimary explanatory facts, and since explanatory power is the mark of\nobjective facts, it appears that there cannot be any value facts.\nMoral judgments and evaluations are “images” and\n“fantasies,” says Nietzsche, the mere effects of\ntype-facts about agents (D 119).\n\nTo describe Nietzsche as a moral anti-realist is so far only to\nascribe to him a metaphysical view: namely, that there are no\nobjective facts about what is morally right and wrong. It is a\nsomewhat vexed interpretive question whether we should also ascribe to\nNietzsche a particular view about the semantics of moral judgment, a\ntopic about which no philosopher prior to the 20th century\nhad a worked–out view (see again Hussain 2013). For example,\nwhile it seems clear (from the passages quoted above) that Nietzsche\nhas distinct views on the central metaphysical question about value,\nit seems equally apparent that there are inadequate textual resources\nfor ascribing to him a satisfying answer to the semantic question.\nElements of his view, for example, might suggest assimilation to what\nwe would call non-cognitivism and, in particular, expressivism. For\nexample, in describing master and Christian morality as\n“opposite forms in the optics of value [Werthe],”\nNietzsche goes on to assert that, as opposite “optical”\nforms, they “are…immune to reasons and refutations. One\ncannot refute Christianity; one cannot refute a disease of the\neye…. The concepts ‘true’ and ‘untrue’\nhave, as it seems to me, no meaning in optics” (CW Epilogue).\nThis passage — typical of putatively expressivist passages in\nNietzsche — is, however, ambiguous. For the passage could mean\nthat “true” and “false” are meaningless\nnot because evaluative judgments are essentially\nnon-cognitive, but rather because competing evaluative views are\nimmune to the effects of reasoning. There may be rational\ngrounds for thinking one view better than another, perhaps for\nthinking one true and the other false, but since reasoning has so\nlittle impact in this context, it is “meaningless” (in the\nsense of pointless) to raise issues of truth and falsity.\n\nMore recently, Hussain (2007) has argued that we read Nietzsche as a\nfictionalist about moral value: granted that Nietzsche is an\nanti-realist about value (there exists no objective fact\nabout what has value in-itself), Hussain wonders what it is those who\n“create values” can understand themselves to have done?\nValuation, in this Nietzschean world, Hussain argues, involves a kind\nof “make-believe,” pretending that things are\nvaluable-in-themselves, while knowing that nothing, in fact, has such\nvalue. There is a pressing philosophical question here — whether\n“make-believe” about value really could suffice for\nvaluing — but also an interpretive problem: does Nietzsche\nreally think that moral judgments express beliefs,\nthat is, truth-apt propositional attitudes which then requires\nfictionalist treatment? It would be astonishing if any\n19th-century philosopher were to have a clear\nanswer to such a question (Hussain 2013 seems to have come around to\nthis view).\n\nWhile Nietzsche was, to be sure, among the first to recognize the\nextent to which linguistic and grammatical practices generate\nmetaphysical assumptions and problems, he simply did not view\nmetaphysical questions themselves as best framed as issues\nabout the semantics of a given region of discourse (e.g., are the\nterms genuinely and successfully referential, or are they\n“merely” expressive?). It is doubtful, then, that there\nare adequate grounds for assigning Nietzsche a view on such subtle\nmatters as whether ethical language is primarily cognitive or\nnon-cognitive, when it clearly evinces aspects of both descriptive and\nprescriptive discourse.\n\nTwo aspects of Nietzsche’s work may, however, seem to be in\ntension with value anti-realism, even understood as only a\nmetaphysical doctrine: first, his reliance on the distinction between\n“higher” and “lower” types of human beings;\nand second, the force and seriousness with which he presents his\nevaluative judgments.\n\nAs we saw, above, Nietzsche’s critique of morality presupposes a\ndistinction between higher and lower types of people. But are there\nobjective facts about who is “high” and who is\n“low”? And if so, would such a view be compatible with\nanti-realism?\n\nSuppose there are objective facts about “high” and\n“low”: Goethe really is a higher type, and the\nherd animal really is a lower type. But there is still no\nobjective fact about whether MPS is non-prudentially\ndisvaluable just because it has the effect of thwarting the\nflourishing of objectively higher types. Realism about\n“high” and “low” does not entail realism about\nnon-prudential value, so the argument might go.\n\nSuch a response cannot work for two reasons. First, the judgment that\n“X is a higher person” includes a significant evaluative\ncomponent: “Goethe is a higher type” is not\nevaluatively neutral in the manner of “Goethe is a\ntaller than average type.” In saying that someone is a\nhigher type, we seem committed to some positive evaluative attitude\ntowards that person (e.g., that it is good to have persons like that\naround). If there is an objective fact that “X is a higher\ntype,” and it is a fact that MPS thwarts the flourishing of\nhigher types, then it would seem that at least some objective weight\nmust accrue to the Nietzschean position that MPS is disvaluable\nbecause of this effect it has.\n\nSecond, if it is an objective fact that Goethe is a higher type and,\nsay, Hitler is a herd animal, then the following counterfactual would\nseem to be true:\n\n(C) If Hitler had been like Goethe, he would have been better off.\n\n\nHe would have been better off because he would have been a higher\ntype, instead of a lower type — and it is an objective fact that\nthe high are really high, and the low are really\nlow. But this seemingly objective judgment — that Hitler would\nhave been better off had he been more like Goethe — is\na non-prudential value judgment; it is not a judgment about what is\ngood for Hitler under the circumstances, but rather a judgment about\nwhat would make Hitler better off, but for his circumstances. In\ngeneral, it seems that conceding the objectivity of “high”\nand “low” permits one to make objective non-prudential\nvalue judgments like: the good of the higher type is superior to the\ngood of the lower type.\n\nFor these reasons, if Nietzsche is an anti-realist about\nnon-prudential moral value, then he must also be an anti-realist about\njudgments of “high” and “low,” It may be an\nobjective fact that MPS thwarts the flourishing of those Nietzsche\nregards as higher types; but it is not an objective fact that\nthey are really higher.\n\nIn fact, there is textual evidence that this is exactly\nNietzsche’s view. For example, in Thus Spoke\nZarathustra, Nietzsche writes that, “Good and evil, and\nrich and poor, and high and low [Hoch und Gering], and all\nthe names of values — arms shall they be and clattering signs\nthat life must overcome itself again and again” (Z II:7). Here\nNietzsche is explicit that “high and low” are simply\n“names of values,” just like “good and evil.”\nBut since, as we have just seen, Nietzsche is an anti-realist about\nthese latter evaluative concepts, it should hardly be surprisingly\nthat he is an anti-realist about the former.\n\nThe actual contexts in which Nietzsche marks traits as\n“high” and “low” invite the same reading.\nConsider, for example, the exposition in the Genealogy (I:14)\nof the sense in which slave morality is the “prudence of the\nlowest order” (GM, I:13). According to Nietzsche, slave morality\ntakes certain typical characteristics of the “lowest\norder” and redescribes them in morally praiseworthy lights. So,\nfor example, their impotence becomes “goodness of heart,”\ntheir anxious lowliness becomes “humility,” their\n“inoffensiveness” and “lingering at the door”\nbecomes “patience”, and their desire for retaliation\nbecomes a desire for justice. If Nietzsche were really a realist about\nthe concept of “lowness”, then we ought to be able to\nidentify the objective facts in virtue of which something is really\nlow. Yet when Nietzsche tries to describe all patience as\nnothing more than a “lingering at the door” and\nall humility as simply “anxious lowliness,” it is\nnatural to think that there is no “objective” fact about\n“lowness” here but simply a polemical and evaluatively\nloaded characterization. To think that all humility is really\n“anxious lowliness” is just to identify oneself as one who\nshares Nietzsche’s evaluative sensibility, one “whose ears\nare related to ours” (GS 381), one “predisposed and\npredestined” for Nietzsche’s insights (BGE 30). In short,\ngiven the way in which Nietzsche actually speaks of the\n“high” and “low,” we should understand\nNietzsche’s metaethical position as also characterizing these\nterms: to say that “X is low” is not to describe an\nobjective fact, but rather to identify oneself as sharing in a certain\nevaluative sensibility or taste.\n\nThere remains a final interpretive difficulty: for Nietzsche simply\ndoes not write like someone who thinks his evaluative judgments are\nmerely his idiosyncratic preferences! On the metaethical position\nelaborated here, it seems Nietzsche must believe that if, in response\nto his point that “morality were to blame if the highest\npower and splendor actually possible to the type man was never in\nfact attained” (GM Pref:6), someone were to say, “So much\nthe better for morality!”, there would be nothing further to say\nto that person: at the best, Nietzsche might turn his back and say,\n“Oh well — doesn’t share my evaluative\ntastes.” Yet there seems to be a substantial amount of\nNietzschean rhetoric (see, e.g., BGE 259; TI V:6 & IX:35; EH IV:4,\n7, 8) that cannot be reconciled with this metaethical view, and which\ncries out instead for some sort of realist construal. Three sorts of\nconsiderations, however, block the inference from Nietzsche’s\nrhetoric to the conclusion that he embraced a realist metaphysics of\nvalue.\n\nFirst, while the rhetoric is forceful, the language of truth and\nfalsity is conspicuously absent. As some of the passages quoted above\nsuggest, Nietzsche writes with great force and passion in opposition\nto MPS. But it is striking that he does not use the epistemic value\nterms — the language of truth and falsity, real and unreal\n— in this context. This, of course, might not be notable, except\nfor the fact that in his equally forceful attacks on, e.g., Christian\ncosmology, or religious interpretations of natural events, he invokes\nthe conceptual apparatus of truth and falsity, truth and lie, reality\nand appearance, all the time (cf. Leiter 1994, pp. 336–338).\nThus, for example, Nietzsche lampoons Christian cosmology as lacking\n“even a single point of contact with reality” and as\n“pure fiction” which\n“falsifies…reality” (“die Wirklichtkeit\nfälscht”) (A, 15). Such epistemic value terms are\nstrikingly absent in Nietzsche’s remarks about value. One\nnatural explanation for this difference in rhetoric — natural\nespecially in light of the substantial evidence for his anti-realism\n— is precisely that in the moral case he does not think there is\nany fact of the matter.\n\nSecond, in undertaking a “revaluation of all values,”\nNietzsche, as we have seen, wants to alert “higher” types\nto the fact that MPS is not, in fact, conducive to their flourishing.\nThus, he needs to “wake up” his appropriate readers\n— those whose “ears are related” to his — to\nthe dangers of MPS, a task made all the more difficult by MPS’s\npretension to be “morality itself.” Given, then, that\nNietzsche’s target is a certain sort of misunderstanding on the\npart of higher men, and given the difficulty of supplanting the norms\nthat figure in this misunderstanding (the norms of MPS), it should be\nunsurprising that Nietzsche writes with passion and force: he must\nshake higher types out of their intuitive commitment to the moral\ntraditions of two millennia! Moreover, Nietzsche’s naturalism,\nand the prominent role it assigns to non-conscious drives and\ntype-facts, leads him to be skeptical about the efficacy of reasons\nand arguments. But a skeptic about the efficacy of rational persuasion\nmight very well opt for persuasion through other rhetorical\ndevices.\n\nThird, and perhaps most importantly, a rhetorical tone like\nNietzsche’s — looked at in the context of his life —\ndoes not really suggest realism about the content, but rather\ndesperation on the part of the author to reach an increasingly distant\nand uninterested audience. The Nietzsche who was almost completely\nignored during the years before illness erased his intellect and\ndeprived him of his sanity might have resorted to more and more\nstrident and violent rhetoric in frustration over not being heard\n— and not because he was a realist. Indeed, in the absence of\nexplicit evidence of value realism, this seems the most plausible\nexplanation for the vast majority of the passages with which we have\nbeen concerned in this section.\n\nFor these various reasons, then, the character of Nietzsche’s\nrhetoric can be understood as compatible with his anti-realism about\nvalue.\n4. Nietzsche’s Lack of a Political Philosophy\n\nWhen the Danish critic Georg Brandes (1842–1927) first\nintroduced a wider European audience to Nietzsche’s ideas during\npublic lectures in 1888, he concentrated on Nietzsche’s\nvitriolic campaign against morality and what Brandes dubbed (with\nNietzsche’s subsequent approval) Nietzsche’s\n“aristocratic radicalism.” On this reading, Nietzsche was\nprimarily concerned with questions of value and culture\n(especially the value of morality and its effect on culture), and his\nphilosophical standpoint was acknowledged to be a deeply\nilliberal one: what matters are great human beings, not the\n“herd.” The egalitarian premise of all contemporary moral\nand political theory — the premise, in one form or another, of\nthe equal worth or dignity of each person — is simply absent in\nNietzsche’s work. This naturally leads to the question: what\npolitics would Nietzsche recommend to us in light of his repudiation\nof the egalitarian premise?\n\nA striking feature of the reception of Nietzsche in the last thirty\nyears years is the large literature that has developed on\nNietzsche’s purported political philosophy. Two positions have\ndominated the literature: one attributes to Nietzsche a commitment to\naristocratic forms of social ordering (call this the\n“Aristocratic Politics View” [e.g., Detwiler 1990]), while\nthe other denies that Nietzsche has any political philosophy at all\n(call this the “Anti-Politics View” [e.g., Hunt 1985,\nLeiter 2002/2015]). \n\nEven the casual reader knows, of course, that Nietzsche has intense\nopinions about everything, from German cuisine to the\nunparalleled brilliance (in Nietzsche’s estimation) of\nBizet’s operas, not to mention various and sundry\n“political” matters. The interpretive question, however,\nis whether scattered remarks and parenthetical outbursts add up to\nsystematic views on questions of philosophical significance about\npolitics.\n\nIs Nietzsche even interested in political philosophy? Nussbaum (1997:\n1) declares that, “Nietzsche claimed to be a political thinker,\nindeed an important political thinker”, but she can produce no\nclear textual evidence in support of that contention. She notes that,\n“In Ecce Homo he announced that he was ‘a bringer\nof glad tidings like no one before me,’ and that those glad\ntidings are political” (1997: 1). In fact, Nietzsche does\nnot say the “tidings” are political; indeed, as\nthe earlier discussion of his critique of morality shows, the\n“tidings” are directed only at select readers, nascent\nhigher human beings, for whom morality is harmful. That this section\nfrom Ecce Homo (IV:1) concludes with the hyperbolic claim\nthat only with Nietzsche does “the earth [first] know[ ]\ngreat politics” does as little to establish that he has\na political philosophy as the claim, in the very same\npassage, that Nietzsche’s “glad tidings” will\ncause “upheavals, a convulsion of earthquakes, a moving of\nmountains and valleys” does to establish that he has a\ngeological theory.\n\nNussbaum goes on to suggest that “serious political\nthought” (1997: 2) must address seven precise topics (e.g.,\n“procedural justification” [“procedures…that\nlegitimate and/or justify the resulting proposals” for\n“political structure”], “gender and the\nfamily,” and “justice between nations”) — most\nof which, of course, Nietzsche does not address. (Marx does not\naddress most of them either.) Instead of drawing the natural\nconclusion — Nietzsche was not interested in questions of\npolitical philosophy — she, surprisingly, decries his\n“baneful influence” in political philosophy (1997:\n12).\n\nThose who claim to find a political philosophy in Nietzsche typically\nrely on a handful of passages — most often, sections 56–57\nof The Antichrist, but also section BGE 257 on\n“slavery” — as the slender evidence on the basis of\nwhich elaborate views about the ideal forms of social and political\norganization are attributed to Nietzsche. In particular, Nietzsche is\nsaid to endorse (in A 56–57) the caste-based society associated\nwith the Hindu Laws of Manu as his political ideal:\n\nThe order of castes, the supreme, the dominant law, is merely\nthe sanction of a natural order, a natural lawfulness of the\nfirst rank, over which no arbitrariness, no “modern idea”\nhas any power…Nature, not Manu, distinguishes the pre-eminently\nspiritual ones, those who are pre-eminently strong in muscle and\ntemperament, and those, the third type, who excel neither in one\nrespect nor in the other, the mediocre ones — the last as the\ngreat majority, the first as the elite. (A 57)\n\n\nThis reading, however, does not withstand scrutiny, as Thomas Brobjer\n(1998) has argued. As Brobjer notes, the only other published\ndiscussion of the laws of Manu, in Twilight of the Idols, is\nhighly critical, not laudatory (pp. 304–305); Nietzsche’s\ndiscussions of comparable caste-based societies are all critical (pp.\n308–309); and Nietzsche’s unpublished notebooks contain\nnumerous entries on the theme “a critique of the Laws of\nManu” (pp. 310–312). The passage from The\nAntichrist only seems laudatory when read out of\ncontext; as Brobjer remarks:\n\n[Nietzsche’s] purpose [in these passages in The\nAntichrist] is to make the contrast with Christianity as strong\nas possible, to provoke the reader, to make the reader\n“realize” that even the laws of Manu… is higher and\nmore humane than Christianity. Whereas Christianity destroys, the\nintention at least of the laws of Manu was to save and protect. (1998,\npp. 312–313)\n\n\nIn other words, the rhetorical context of the passage is\ncrucial, though it is typically ignored by commentators defending the\nAristocratic Politics View. Indeed, the passage quoted above from A 57\nis specifically introduced to illustrate the use of the “holy\nlie” (the lie being, in this case, the claim that “nature,\nnot Manu” distinguishes the castes). And as even the title of\nthe book would suggest, Nietzsche’s target is Christianity, and\nthe laws of Manu are invoked simply to drive home that point. Thus,\nalthough Manu and Christianity both depend on lies, at least\nthe Manu lies, according to Nietzsche, are not put in the service of\nChristian ends, i.e., “poisoning, slander, negation of life,\ncontempt for the body, the degradation and self-violation of man\nthrough the concept of sin” (A 56). Similarly, Nietzsche goes\nout of his way to show that Christian views of female sexuality\ncompare unfavorably with Manu views (A 56).\n\nThe most balanced and careful defense of the Aristocratic Politics\nView, Detwiler (1990), is not able to adduce much additional evidence.\nFor example, Detwiler (1990) ends up relying quite heavily on an essay\nthe 27-year-old Nietzsche never published (1990: 39–41, 63). As to\npassages in the “mature” corpus, Detwiler adduces ones\nthat “appear[ ] to have explicit political\nimplications” (1990: 43; cf. 44), or that “strongly\nsuggest…political consequences” (1990: 45–46), or\nthat “raise the issue of troubling political implications of\nNietzschean immoralism” (1990: 49). But\n“implications” and “consequences” are one\nthing, and having a political philosophy another. (See in this regard\nthe discussion of BGE 257 in Huddleston 2019: 113 n. 39). The canon of\npolitical philosophers is composed of thinkers (like Hobbes, Locke,\nRousseau, and Mill) who have philosophical views about political\nquestions — the justification of state power, the liberty of the\nindividual, political legitimacy, etc. — not thinkers whose\nviews about other topics merely had\n“implications” for politics. As the conscientious Detwiler\nadmits: “[t]he political implications of Nietzsche’s\nrevaluation of values are never center stage for long” (1990:\n58).\n\nYet it is natural to think that Nietzsche’s attack on morality\ndoes indeed have real political implications. When Nietzsche commends\nthe laws of Manu for “mak[ing] possible the higher and the\nhighest types” (A 57), this resonates, all too obviously, with\nNietzsche’s central concern that morality is harmful to the\nhighest types of human beings. Yet the undeniable\n“resonance” fails to show that Nietzsche endorses\nthe laws of Manu. Most obviously, the “higher types”\nprotected by the laws of Manu — essentially a priestly caste\n— have nothing in common with the nascent Goethes that concern\nNietzsche. Nietzsche’s worry for these potential higher types\nis, as we have seen, that they suffer from false\nconsciousness, i.e., the false belief that “morality in the\npejorative sense,” i.e., MPS, is good for them. MPS is a threat\nto the flourishing of nascent Goethes, and it is this flourishing that\ninterests Nietzsche above all. It would suffice for Nietzsche’s\npurposes that nascent Goethes give up their faith in MPS — in\nother words, it is individual attitudes not political structures that\nare Nietzsche’s primary object (“The ideas of the herd\nshould rule in the herd,” says Nietzsche, “and not reach\nout beyond it” [WP 287]). That should hardly be surprising if we\nrecall Nietzsche’s sustained hostility to politics throughout\nhis career, as defenders of the Anti-Politics View emphasize.\n\nEven in the early Untimely Meditations, this hostility is\nalready evident. So, for example, Nietzsche comments:\n\nEvery philosophy which believes that the problem of existence is\ntouched on, not to say solved, by a political event is a joke- and\npseudo-philosophy. Many states have been founded since the world\nbegan; that is an old story. How should a political innovation suffice\nto turn men once and for all into contented inhabitants of the earth?\n[That people think the answer to existential questions might come from\npolitics shows] that we are experiencing the consequences of the\ndoctrine…that the state is the highest goal of mankind and that\na man has no higher duty than to serve the state: in which doctrine I\nrecognize a relapse not into paganism but into stupidity. It may be\nthat a man who sees his highest duty in serving the state really knows\nno higher duties; but there are men and duties existing beyond this\n— and one of the duties that seems, at least to me, to be higher\nthan serving the state demands that one destroys stupidity in every\nform, and therefore in this form too. That is why I am concerned with\na species of man whose teleology extends somewhat beyond the welfare\nof a state…, and with [this kind of man] only in relation to a\nworld which is again fairly independent of the welfare of a state,\nthat of culture. (U III:4)\n\n\nThe same, vaguely anarchistic attitude is apparent in Thus Spoke\nZarathustra, where Nietzsche calls the “state…the\ncoldest of all cold monsters” and remarks, aptly enough, that\n“the state…whatever it says it lies…Everything\nabout it is false” (Z I:11). “Only where the state ends,\nthere begins the human being who is not superfluous” (Z I:11) Of\ncourse, it is only the latter individual that really\ninterests Nietzsche. And who is that individual? The next section (Z\nI:12) tells us: he is the one who values his “solitude,”\nwhich is precisely what the “marketplace” of politics\nviolates, with its “showmen and actors of great [sic]\nthings.” “Far from the market place and from fame happens\nall that is great” (Z I:12): in other words, great things (and\ngreat people) are to be found far from the realms of politics and\neconomics.\n\nPassages like these seem to support the Anti-Politics View. On this\naccount, Nietzsche occasionally expresses views about political\nmatters, but, read in context, they do not add up to a theoretical\naccount of any of the questions of political philosophy. He is more\naccurately read, in the end, as a kind of esoteric moralist,\ni.e., someone who has views about human flourishing, views he wants to\ncommunicate at least to a select few. “This book belongs to the\nvery few,” he says of The Antichrist, though the point\nholds more generally. Indeed, Nietzsche is clearly describing his own\nwork when he writes in an earlier book that,\n\nIt is not by any means necessarily an objection to a book when anyone\nfinds it impossible to understand: perhaps that was part of the\nauthor’s intention — he did not want to be understood by\njust ‘anybody.’ All the nobler spirits and tastes select\ntheir audience when they wish to communicate; and choosing that, one\nat the same time erects barriers against ‘the others.’ All\nthe more subtle laws of any style have their origin at this point:\nthey at the same time keep away, create a distance, forbid\n‘entrance,’ understanding, as said above — while\nthey open the ears of those whose ears are related to ours. (GS 381)\n\n\nOr similarly: “Our highest insights must — and should\n— sound like follies and sometimes like crimes when they are\nheard without permission by those who are not predisposed and\npredestined for them” (BGE 30). Nietzsche, the esoteric\nmoralist, wants to reach only select individuals — those nascent\nhigher human beings who are “predisposed and predestined”\nfor his ideas — and alter their consciousness about morality.\nThe larger world, including its forms of political and economic\norganization, is simply not his concern.\n\nEven without a political philosophy, however, there remain disturbing\nquestions about Nietzsche’s critique of morality and its\npolitical implications. For example, when Nietzsche objects\nthat morality is an obstacle to “the highest power and splendor\npossible” to man, one is tempted to object that this gets things\nperversely backwards. For surely it is the lack of morality\nin social policy and public institutions — a lack which permits\nwidespread poverty and despair to persist generation upon generation;\nthat allows daily economic struggle and uncertainty to define the\nbasic character of most people’s lives — that is most\nresponsible for a lack of human flourishing. Surely, in a more moral\nsociety, with a genuine commitment to social justice and human\nequality, there would be far more Goethes, far more creativity and\nadmirable human achievement. As Philippa Foot has sharply put it:\n“How could one see the present dangers that the world is in as\nshowing that there is too much pity and too little egoism\naround?” (1973, p. 168).\n\nHere, though, one must remember the earlier discussion of\nNietzsche’s critique of morality. Consider the Nietzsche who\nasks: “Where has the last feeling of decency and self-respect\ngone when even our statesmen, an otherwise quite unembarrassed type of\nman, anti-Christians through and through in their deeds, still call\nthemselves Christians today and attend communion?” (A 38).\nClearly this Nietzsche is under no illusions about the extent to which\npublic actors do not act morally. Indeed, Nietzsche continues in even\nmore explicit terms: “Every practice of every moment, every\ninstinct, every valuation that is translated into action is\ntoday anti-Christian: what a miscarriage of falseness must\nmodern man be, that he is not ashamed to be called a\nChristian in spite of all this!” (A 38). What, then, is going on\nhere? If Nietzsche is not, contrary to Foot’s suggestion,\nembracing the absurd view that there is too much pity and altruism in\nthe world, what exactly is his critical point?\n\nRecall Nietzsche’s paradigmatic worry: that a nascent creative\ngenius will come to take the norms of MPS so seriously that he will\nfail to realize his genius. Rather than tolerate (even welcome)\nsuffering, he will seek relief from hardship and devote himself to the\npursuit of pleasure; rather than practice what Nietzsche calls\n“severe self-love”, and attend to himself in the ways\nrequisite for productive creative work, he will embrace the ideology\nof altruism, and reject “self-love” as improper, and so\nforth. It is not, then, that Nietzsche thinks people practice\ntoo much altruism — after all, Nietzsche tells us that egoistic\nactions “have hitherto been by far the most frequent\nactions” (D 148) — but rather that they believe\ntoo much in the value of altruism, equality, happiness and the other\nnorms of MPS. Even though there is neither much altruism nor equality\nin the world, there is almost universal endorsement of the\nvalue of altruism and equality — even, notoriously (and\nas Nietzsche seemed well aware), by those who are its worst enemies in\npractice. So Nietzsche’s critique is that a culture in the grips\nof MPS, even without acting on MPS, poses the real obstacle to\nflourishing, because it teaches potential higher types to disvalue\nwhat would be most conducive to their creativity and value what is\nirrelevant or perhaps even hostile to it. Nietzsche’s worry, in\nshort, is that the man in the grips of MPS becomes\n“imprisoned among all sorts of terrible concepts\n[schrekliche Begriffe]” that leave him “sick,\nmiserable, malevolent against himself: full of hatred against the\nsprings of life, full of suspicion against all that was still strong\nand happy” (TI VII:2, emphasis added).\n\nSo, contrary to Foot, Nietzsche is not claiming that people are\nactually too altruistic and too egalitarian in their\npractice; he is worried that (as a consequence of the slave revolt in\nmorals, etc.) they are now “imprisoned\namong….concepts” of equality and altruism, and that this\nconceptual vocabulary of value is itself the obstacle to the\nrealization of certain forms of human excellence. That is a very\ndifferent charge, one that raises subtle psychological questions that\nno one, to date, has really explored.\n\nTo be sure, one might still object that if our society really\nwere more altruistic and egalitarian, more individuals would have the\nchance to flourish and do creative work. Yet it is precisely this\nmoral optimism common, for example, to utilitarians and Marxists\n— this belief that a more moral society would produce more\nopportunity for more people to do creative work — that Nietzsche\ndoes, indeed, want to question. Nietzsche’s illiberal attitudes\nin this regard are once again apparent; he says — to take but\none example — that, “We simply do not consider it\ndesirable that a realm of justice and harmony [Eintracht]\nshould be established on earth” (GS 377). It is bad enough for\nNietzsche that MPS values have so far succeeded in saying,\n“stubbornly and inexorably, ‘I am morality itself, and\nnothing besides is morality’” (BGE 202); it could only be\nworse on his view if more and more of our actions were really brought\ninto accord with these values. For Nietzsche wants to urge —\ncontrary to the moral optimists — that in a way largely\nunappreciated and (perhaps) unintended a thoroughly moral\nculture undermines the conditions under which the most splendid human\ncreativity is possible, and generates instead a society of\nZarathustra’s “last men” (Z P:5):\n\n“What is love? What is creation? What is longing? What is a\nstar?” thus asks the last man, and he blinks.\n\n\nThe earth has become small, and on it hops the last man, who makes\neverything small. His race is as in eradicable as the flea-beetle; the\nlast man lives longest.\n\n“We have invented happiness,” say the last men, and they\nblink….\n\n\nIf we are trained always to think of happiness and comfort and safety\nand the needs of others, we shall cut ourselves off from the\npreconditions for creative excellence on the Nietzschean picture:\nsuffering, hardship, danger, self-concern, and the rest.\n\nConsider a particularly powerful statement of this view. Speaking of\nthose “eloquent and profoundly scribbling slaves of the\ndemocratic taste and its ‘modern ideas’” who seek to\npromote “the universal green-pasture happiness of the\nherd” and who take “suffering itself…for something\nthat must be abolished” (BGE 44), Nietzsche retorts that when we\nlook at,\n\n…how the plant “man” has so far grown most\nvigorously to a height — we think that this has happened every\ntime under the opposite conditions, that to this end the dangerousness\nof his situation must first grow to the point of enormity, his power\nof invention and simulation (his “spirit”) had to develop\nunder prolonged pressure and constraint into refinement and\naudacity…. We think that…everything evil, terrible,\ntyrannical in man, everything in him that is kin to beasts of prey and\nserpents, serves the enhancement of the species “man” as\nmuch as its opposite does. Indeed, we do not even say enough when we\nsay only that much. (BGE 44)\n\n\nAt the end of this passage, Nietzsche does hint at a role for morality\nas well — it is just that what morality opposes is equally\nimportant. He, of course, qualifies this by suggesting that even to\nconcede their equal importance may “not even say enough”:\nthat is, perhaps there will not be much role for morality at all in\nthe conditions under which “the plant ‘man’”\nwill grow to its greatest heights. But notice that, even in this\npassage, what is called for is not a political\ntransformation, but an individual one, that of the nascent\nhigher human being: it is “his situation” that\n“must first grow to the point of enormity” and it is\n“his power of invention and simulation” that\n“had to develop under prolonged pressure and constraint into\nrefinement and audacity.” As he writes in a Nachlass\nnote of 1887, regarding those “human beings who are of any\nconcern to me”: “I wish [them] suffering, desolation,\nsickness, ill-treatment, indignities — I wish that they should\nnot remain unfamiliar with profound self-contempt, the torture of\nself-mistrust, the wretchedness of the vanquished” (WP 910).\nThis is not the outline of a political program, but rather a severe\nregimen for the realization of individual potential — at least\nfor the select few.\n",
    "bibliography": {
        "categories": [
            "A. Nietzsche’s Writings and Key to Citations",
            "B. References and Works on Nietzsche’s Moral and Political Philosophy"
        ],
        "cat_ref_text": {
            "A. Nietzsche’s Writings and Key to Citations": [
                "</h3>\n<p>\nFor untranslated material and emendations to existing translations, I\nhave relied on Friedrich Nietzsche, <em>Sämtliche Werke:\nKritische Studienausgabe in 15 Bänden</em>, ed. G. Colli &amp; M.\nMontinari (Berlin: de Gruyter, 1980); this is cited as KSA, followed\nby the volume number, a colon, and the fragment number(s).</p>\n<p>\nNietzsche’s works are cited as follows, unless otherwise noted:\nroman numerals refer to major parts or chapters in Nietzsche’s\nworks; Arabic numerals refer to sections, not pages.</p>\n<ul class=\"hanging\">",
                "<em>The Antichrist</em>, in <em>The Portable Nietzsche</em>\n(below). Cited as A.",
                "<em>Beyond Good and Evil</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as BGE.",
                "<em>The Birth of Tragedy</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as BT.",
                "<em>The Case of Wagner</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as CW.",
                "<em>Daybreak: Thoughts on the Prejudices of Morality</em>, trans.\nR.J. Hollingdale, ed. M. Clark &amp; B. Leiter, Cambridge: Cambridge\nUniversity Press, 1997. Cited as D.",
                "<em>Ecce Homo</em>, trans. W. Kaufmann, New York: Vintage, 1967.\nCited as EH.",
                "<em>The Gay Science</em>, trans. W. Kaufmann, New York: Vintage,\n1974. Cited as GS.",
                "<em>On the Genealogy of Morality</em>, trans. M. Clark &amp; A.\nSwensen, Indianapolis: Hackett, 1998. Cited as GM.",
                "<em>Human, All-too-Human</em>, trans. R.J. Hollingdale, Cambridge:\nCambridge University Press, 1986. Cited as HAH.",
                "<em>Nietzsche contra Wagner</em>, in <em>The Portable\nNietzsche</em> (below). Cited as NCW.",
                "<em>Philosophy in the Tragic Age of the Greeks</em>, trans. M.\nCowan, Washington, DC: Regnery Gateway, 1962. Cited as PTAG.",
                "<em>Philosophy and Truth: Selections from Nietzsche’s\nNotebooks of the Early 1870’s</em>, ed. &amp; trans. D.\nBreazeale, Atlantic Highlands, NJ: Humanities Press, 1979. Cited as\nPT, by <em>page</em> number.",
                "<em>The Portable Nietzsche</em>, ed. &amp; trans. W. Kaufmann, New\nYork: Viking, 1954. Cited as PN, by <em>page</em> number.",
                "<em>Thus Spoke Zarathustra</em>, in <em>The Portable\nNietzsche</em> (above). Cited as Z.",
                "<em>Twilight of the Idols</em>, in <em>The Portable Nietzsche</em>\n(above). Cited as TI.",
                "<em>Untimely Meditations</em>, trans. R.J. Hollingdale, Cambridge:\nCambridge University Press, 1983. Cited as U.",
                "<em>The Will to Power</em>, trans. W. Kaufmann &amp; R.J.\nHollingdale, New York: Vintage, 1968. Cited as WP.\n</ul>\n<h3 id=\"BRefeWorkNietMoraPoliPhil\">"
            ],
            "B. References and Works on Nietzsche’s Moral and Political Philosophy": [
                "</h3>\n<ul class=\"hanging\">",
                "Abel, Günther, 2001. “Bewusstein-Sprache-Natur.\nNietzsches Philosophie des Geistes,” <em>Nietzsche-Studien</em>,\n30: 1–43.",
                "Brobjer, Thomas, 1998. “The Absence of Political Ideals in\nNietzsche’s Writings: The Case of the Laws of Manu and the\nAssociated Caste-Society,” <em>Nietzsche-Studien</em>, 27:\n300–318.",
                "Clark, Maudemarie, 1990. <em>Nietzsche on Truth and\nPhilosophy</em>, Cambridge: Cambridge University Press.",
                "–––, 1994. “Nietzsche’s Immoralism\nand the Concept of Morality,” in Schacht (1994).",
                "–––, 2001. “On the Rejection of Morality:\nBernard Williams’s Debt to Nietzsche,” in Schacht\n(2001).",
                "Clark, Maudemarie and David Dudrick, 2012. <em>The Soul of\nNietzsche’s Beyond Good and Evil</em>, Cambridge: Cambridge\nUniversity Press.",
                "Clark, Maudemarie and Brian Leiter, 1997.\n“Introduction” to Nietzsche’s <em>Daybreak</em>,\nCambridge: Cambridge University Press.",
                "Detwiler, Bruce, 1990. <em>Nietzsche and the Politics of\nAristocratic Radicalism</em>, Chicago: University of Chicago\nPress.",
                "Foot, Philippa, 1973. “Nietzsche: The Revaluation of\nValues,” reprinted in Richardson &amp; Leiter (2001).",
                "Fowles, Christopher, 2019. “Nietzsche on Conscious and\nUnconscious Thought,” <em>Inquiry</em>, 62: 1–22.",
                "Gemes, Ken, and John Richardson (eds.), 2013. <em>The Oxford\nHandbook of Nietzsche</em>, Oxford: Oxford University Press.",
                "Geuss, Raymond, 1997. “Nietzsche and Morality,”\n<em>European Journal of Philosophy</em>, 5: 1–20.",
                "Hollingdale, R.J., 1985. <em>Nietzsche: The Man and His\nPhilosophy</em>, London: Ark Paperbacks.",
                "Huddleston, Andrew, 2017. “Normativity and the Will to\nPower: Challenges for a Nietzschean Constitutivism,” <em>Journal\nof Nietzsche Studies</em>, 47: 435–456.",
                "–––, 2019. <em>Nietzsche on the Decadence &amp;\nFlourishing of Culture</em>, Oxford: Oxford University Press.",
                "Hunt, Lester, 1985. “Politics and Anti-Politics:\nNietzsche’s View of the State,” <em>History of Philosophy\nQuarterly</em>, 2: 453–468.",
                "–––, 1991. <em>Nietzsche and the Origin of\nVirtue</em>, London: Routledge.",
                "–––, 1993. “The Eternal Recurrence and\nNietzsche’s Ethic of Virtue,” <em>International Studies in\nPhilosophy</em>, 25 (2): 3–11.",
                "Hurka, Thomas, 1993. <em>Perfectionism</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2007. “Nietzsche:\nPerfectionist,” in Leiter &amp; Sinhababu (2007).",
                "Hussain, Nadeem, 2007. “Honest Illusions: Valuing for\nNietzsche’s Free Spirits,” in Leiter &amp; Sinhababu\n(2007).",
                "–––, 2013. “Nietzsche’s Metaethical\nStance”, in Gemes and Richardson (2013).",
                "Janaway, Christopher, 2007. <em>Beyond Selflessness: Reading\nNietzsche’s Genealogy</em>, Oxford: Oxford University\nPress.",
                "Katsafanas, Paul, 2005. “Nietzsche’s Theory of Mind:\nConsciousness and Conceptualization,”<em>European Journal of\nPhilosophy</em>, 13: 1–31.",
                "–––, 2013a. “Nietzsche’s\nPhilosophical Psychology,”, in Gemes and Richardson (2013).",
                "–––, 2013b. <em>Agency and the Foundations of\nEthics: Nietzschean Constitutivism</em>, Oxford: Oxford University\nPress.",
                "Leiter, Brian, 1994. “Perspectivism in Nietzsche’s\n<em>Genealogy of Morals</em>,” in Schacht (1994).",
                "–––, 1997. “Nietzsche and the Morality\nCritics,” <em>Ethics</em>, 107: 250–285. Reprinted in\nRichardson &amp; Leiter (2001).",
                "–––, 1998. “On the Paradox of Fatalism and\nSelf-Creation in Nietzsche,” in C. Janaway (ed.), <em>Willing\nand Nothingness: Schopenhauer as Nietzsche’s Educator</em>,\nOxford: Oxford University Press. Reprinted in Richardson &amp; Leiter\n(2001).",
                "–––, 2002. <em>Nietzsche on Morality</em>,\nLondon: Routledge.",
                "–––, 2007. “Nietzsche’s Theory of\nthe Will,”<em>Philosophers’ Imprint</em>, 7 (7):\n1–15.",
                "–––, 2013. “Nietzsche’s Naturalism\nReconsidered,” in Gemes and Richardson (2013).",
                "–––, 2015. <em>Nietzsche on Morality</em>, 2nd\nedition, London: Routledge.",
                "–––, 2019. <em>Moral Psychology with\nNietzsche</em>, Oxford: Oxford University Press.",
                "Leiter, Brian and Neil Sinhababu (eds.), 2007. <em>Nietzsche and\nMorality</em>, Oxford: Oxford University Press.",
                "Magnus, Bernd, 1978. <em>Nietzsche’s Existential\nImperative</em>, Bloomington: Indiana University Press.",
                "May, Simon, 1999. <em>Nietzsche’s Ethics and his “War\non Morality”</em>, Oxford: Clarendon Press.",
                "Montinari, Mazzino, 1982. <em>Nietzsche Lesen</em>, Berlin: de\nGruyter.",
                "Nehamas, Alexander, 1985. <em>Nietzsche: Life as Literature</em>,\nCambridge, MA: Harvard University Press, esp. Chs. 5–7.",
                "Nussbaum, Martha, 1997. “Is Nietzsche a Political\nThinker?” <em>International Journal of Philosophical\nStudies</em>, 5: 1–13.",
                "Reginster, Bernard, 2006. <em>The Affirmation of Life: Nietzsche\non Overcoming Nihilism</em>, Cambridge, MA: Harvard University\nPress.",
                "Riccardi, Mattia, 2015. “Inner Opacity: Nietzsche on\nIntrospection and Agency”, <em>Inquiry</em>, 58:\n221–243.",
                "–––, 2019. “Nietzsche on the\nSuperficiality of Consciousness”, in M. Dries (ed.),\n<em>Nietzsche on Consciousness and the Embodied Mind</em>, Berlin, de\nGruyter.",
                "Richardson, John, 1996. <em>Nietzsche’s System</em>, Oxford:\nOxford University Press, esp. Ch 3.",
                "Richardson, John, and Brian Leiter (eds.), 2001.\n<em>Nietzsche</em>, Oxford: Oxford University Press.",
                "Rutherford, Donald, 2011. “Freedom as a Philosophical Ideal:\nNietzsche and his Antecedents” <em>Inquiry</em>, 54:\n512–540.",
                "Schacht, Richard, 1983. <em>Nietzsche</em>, London: Routledge,\nesp. Chs. IV-VII.",
                "––– (ed.), 1994. <em>Nietzsche, Genealogy,\nMorality</em>, Berkeley: University of California Press.",
                "Swanton, Christine, 2005. “Nietzschean Virtue\nEthics”,in S. Gardiner (ed.), <em>Virtue Ethics, Old and\nNew</em>, Ithaca, Cornell University Press.",
                "Welshon, Rex, 2014. <em>Nietzsche’s Dynamic\nMetapsychology</em>, London: Palgrave MacMillan.",
                "Wilcox, John, 1974. <em>Truth and Value in Nietzsche: A Study of\nHis Metaethics and Epistemology</em>, Ann Arbor: University of\nMichigan Press.",
                "Williams, Bernard, 1993. “Nietzsche’s Minimalist Moral\nPsychology,” <em>European Journal of Philosophy</em>, 1:\n4–14. Reprinted in Schacht (1994).\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"NietWritKeyCita\">A. Nietzsche’s Writings and Key to Citations</h3>\n<p>\nFor untranslated material and emendations to existing translations, I\nhave relied on Friedrich Nietzsche, <em>Sämtliche Werke:\nKritische Studienausgabe in 15 Bänden</em>, ed. G. Colli &amp; M.\nMontinari (Berlin: de Gruyter, 1980); this is cited as KSA, followed\nby the volume number, a colon, and the fragment number(s).</p>\n<p>\nNietzsche’s works are cited as follows, unless otherwise noted:\nroman numerals refer to major parts or chapters in Nietzsche’s\nworks; Arabic numerals refer to sections, not pages.</p>\n<ul class=\"hanging\">\n<li><em>The Antichrist</em>, in <em>The Portable Nietzsche</em>\n(below). Cited as A.</li>\n<li><em>Beyond Good and Evil</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as BGE.</li>\n<li><em>The Birth of Tragedy</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as BT.</li>\n<li><em>The Case of Wagner</em>, trans. W. Kaufmann, New York:\nVintage, 1966. Cited as CW.</li>\n<li><em>Daybreak: Thoughts on the Prejudices of Morality</em>, trans.\nR.J. Hollingdale, ed. M. Clark &amp; B. Leiter, Cambridge: Cambridge\nUniversity Press, 1997. Cited as D.</li>\n<li><em>Ecce Homo</em>, trans. W. Kaufmann, New York: Vintage, 1967.\nCited as EH.</li>\n<li><em>The Gay Science</em>, trans. W. Kaufmann, New York: Vintage,\n1974. Cited as GS.</li>\n<li><em>On the Genealogy of Morality</em>, trans. M. Clark &amp; A.\nSwensen, Indianapolis: Hackett, 1998. Cited as GM.</li>\n<li><em>Human, All-too-Human</em>, trans. R.J. Hollingdale, Cambridge:\nCambridge University Press, 1986. Cited as HAH.</li>\n<li><em>Nietzsche contra Wagner</em>, in <em>The Portable\nNietzsche</em> (below). Cited as NCW.</li>\n<li><em>Philosophy in the Tragic Age of the Greeks</em>, trans. M.\nCowan, Washington, DC: Regnery Gateway, 1962. Cited as PTAG.</li>\n<li><em>Philosophy and Truth: Selections from Nietzsche’s\nNotebooks of the Early 1870’s</em>, ed. &amp; trans. D.\nBreazeale, Atlantic Highlands, NJ: Humanities Press, 1979. Cited as\nPT, by <em>page</em> number.</li>\n<li><em>The Portable Nietzsche</em>, ed. &amp; trans. W. Kaufmann, New\nYork: Viking, 1954. Cited as PN, by <em>page</em> number.</li>\n<li><em>Thus Spoke Zarathustra</em>, in <em>The Portable\nNietzsche</em> (above). Cited as Z.</li>\n<li><em>Twilight of the Idols</em>, in <em>The Portable Nietzsche</em>\n(above). Cited as TI.</li>\n<li><em>Untimely Meditations</em>, trans. R.J. Hollingdale, Cambridge:\nCambridge University Press, 1983. Cited as U.</li>\n<li><em>The Will to Power</em>, trans. W. Kaufmann &amp; R.J.\nHollingdale, New York: Vintage, 1968. Cited as WP.</li>\n</ul>\n<h3 id=\"BRefeWorkNietMoraPoliPhil\">B. References and Works on Nietzsche’s Moral and Political Philosophy</h3>\n<ul class=\"hanging\">\n<li>Abel, Günther, 2001. “Bewusstein-Sprache-Natur.\nNietzsches Philosophie des Geistes,” <em>Nietzsche-Studien</em>,\n30: 1–43.</li>\n<li>Brobjer, Thomas, 1998. “The Absence of Political Ideals in\nNietzsche’s Writings: The Case of the Laws of Manu and the\nAssociated Caste-Society,” <em>Nietzsche-Studien</em>, 27:\n300–318.</li>\n<li>Clark, Maudemarie, 1990. <em>Nietzsche on Truth and\nPhilosophy</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1994. “Nietzsche’s Immoralism\nand the Concept of Morality,” in Schacht (1994).</li>\n<li>–––, 2001. “On the Rejection of Morality:\nBernard Williams’s Debt to Nietzsche,” in Schacht\n(2001).</li>\n<li>Clark, Maudemarie and David Dudrick, 2012. <em>The Soul of\nNietzsche’s Beyond Good and Evil</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Clark, Maudemarie and Brian Leiter, 1997.\n“Introduction” to Nietzsche’s <em>Daybreak</em>,\nCambridge: Cambridge University Press.</li>\n<li>Detwiler, Bruce, 1990. <em>Nietzsche and the Politics of\nAristocratic Radicalism</em>, Chicago: University of Chicago\nPress.</li>\n<li>Foot, Philippa, 1973. “Nietzsche: The Revaluation of\nValues,” reprinted in Richardson &amp; Leiter (2001).</li>\n<li>Fowles, Christopher, 2019. “Nietzsche on Conscious and\nUnconscious Thought,” <em>Inquiry</em>, 62: 1–22.</li>\n<li>Gemes, Ken, and John Richardson (eds.), 2013. <em>The Oxford\nHandbook of Nietzsche</em>, Oxford: Oxford University Press.</li>\n<li>Geuss, Raymond, 1997. “Nietzsche and Morality,”\n<em>European Journal of Philosophy</em>, 5: 1–20.</li>\n<li>Hollingdale, R.J., 1985. <em>Nietzsche: The Man and His\nPhilosophy</em>, London: Ark Paperbacks.</li>\n<li>Huddleston, Andrew, 2017. “Normativity and the Will to\nPower: Challenges for a Nietzschean Constitutivism,” <em>Journal\nof Nietzsche Studies</em>, 47: 435–456.</li>\n<li>–––, 2019. <em>Nietzsche on the Decadence &amp;\nFlourishing of Culture</em>, Oxford: Oxford University Press.</li>\n<li>Hunt, Lester, 1985. “Politics and Anti-Politics:\nNietzsche’s View of the State,” <em>History of Philosophy\nQuarterly</em>, 2: 453–468.</li>\n<li>–––, 1991. <em>Nietzsche and the Origin of\nVirtue</em>, London: Routledge.</li>\n<li>–––, 1993. “The Eternal Recurrence and\nNietzsche’s Ethic of Virtue,” <em>International Studies in\nPhilosophy</em>, 25 (2): 3–11.</li>\n<li>Hurka, Thomas, 1993. <em>Perfectionism</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2007. “Nietzsche:\nPerfectionist,” in Leiter &amp; Sinhababu (2007).</li>\n<li>Hussain, Nadeem, 2007. “Honest Illusions: Valuing for\nNietzsche’s Free Spirits,” in Leiter &amp; Sinhababu\n(2007).</li>\n<li>–––, 2013. “Nietzsche’s Metaethical\nStance”, in Gemes and Richardson (2013).</li>\n<li>Janaway, Christopher, 2007. <em>Beyond Selflessness: Reading\nNietzsche’s Genealogy</em>, Oxford: Oxford University\nPress.</li>\n<li>Katsafanas, Paul, 2005. “Nietzsche’s Theory of Mind:\nConsciousness and Conceptualization,”<em>European Journal of\nPhilosophy</em>, 13: 1–31.</li>\n<li>–––, 2013a. “Nietzsche’s\nPhilosophical Psychology,”, in Gemes and Richardson (2013).</li>\n<li>–––, 2013b. <em>Agency and the Foundations of\nEthics: Nietzschean Constitutivism</em>, Oxford: Oxford University\nPress.</li>\n<li>Leiter, Brian, 1994. “Perspectivism in Nietzsche’s\n<em>Genealogy of Morals</em>,” in Schacht (1994).</li>\n<li>–––, 1997. “Nietzsche and the Morality\nCritics,” <em>Ethics</em>, 107: 250–285. Reprinted in\nRichardson &amp; Leiter (2001).</li>\n<li>–––, 1998. “On the Paradox of Fatalism and\nSelf-Creation in Nietzsche,” in C. Janaway (ed.), <em>Willing\nand Nothingness: Schopenhauer as Nietzsche’s Educator</em>,\nOxford: Oxford University Press. Reprinted in Richardson &amp; Leiter\n(2001).</li>\n<li>–––, 2002. <em>Nietzsche on Morality</em>,\nLondon: Routledge.</li>\n<li>–––, 2007. “Nietzsche’s Theory of\nthe Will,”<em>Philosophers’ Imprint</em>, 7 (7):\n1–15.</li>\n<li>–––, 2013. “Nietzsche’s Naturalism\nReconsidered,” in Gemes and Richardson (2013).</li>\n<li>–––, 2015. <em>Nietzsche on Morality</em>, 2nd\nedition, London: Routledge.</li>\n<li>–––, 2019. <em>Moral Psychology with\nNietzsche</em>, Oxford: Oxford University Press.</li>\n<li>Leiter, Brian and Neil Sinhababu (eds.), 2007. <em>Nietzsche and\nMorality</em>, Oxford: Oxford University Press.</li>\n<li>Magnus, Bernd, 1978. <em>Nietzsche’s Existential\nImperative</em>, Bloomington: Indiana University Press.</li>\n<li>May, Simon, 1999. <em>Nietzsche’s Ethics and his “War\non Morality”</em>, Oxford: Clarendon Press.</li>\n<li>Montinari, Mazzino, 1982. <em>Nietzsche Lesen</em>, Berlin: de\nGruyter.</li>\n<li>Nehamas, Alexander, 1985. <em>Nietzsche: Life as Literature</em>,\nCambridge, MA: Harvard University Press, esp. Chs. 5–7.</li>\n<li>Nussbaum, Martha, 1997. “Is Nietzsche a Political\nThinker?” <em>International Journal of Philosophical\nStudies</em>, 5: 1–13.</li>\n<li>Reginster, Bernard, 2006. <em>The Affirmation of Life: Nietzsche\non Overcoming Nihilism</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Riccardi, Mattia, 2015. “Inner Opacity: Nietzsche on\nIntrospection and Agency”, <em>Inquiry</em>, 58:\n221–243.</li>\n<li>–––, 2019. “Nietzsche on the\nSuperficiality of Consciousness”, in M. Dries (ed.),\n<em>Nietzsche on Consciousness and the Embodied Mind</em>, Berlin, de\nGruyter.</li>\n<li>Richardson, John, 1996. <em>Nietzsche’s System</em>, Oxford:\nOxford University Press, esp. Ch 3.</li>\n<li>Richardson, John, and Brian Leiter (eds.), 2001.\n<em>Nietzsche</em>, Oxford: Oxford University Press.</li>\n<li>Rutherford, Donald, 2011. “Freedom as a Philosophical Ideal:\nNietzsche and his Antecedents” <em>Inquiry</em>, 54:\n512–540.</li>\n<li>Schacht, Richard, 1983. <em>Nietzsche</em>, London: Routledge,\nesp. Chs. IV-VII.</li>\n<li>––– (ed.), 1994. <em>Nietzsche, Genealogy,\nMorality</em>, Berkeley: University of California Press.</li>\n<li>Swanton, Christine, 2005. “Nietzschean Virtue\nEthics”,in S. Gardiner (ed.), <em>Virtue Ethics, Old and\nNew</em>, Ithaca, Cornell University Press.</li>\n<li>Welshon, Rex, 2014. <em>Nietzsche’s Dynamic\nMetapsychology</em>, London: Palgrave MacMillan.</li>\n<li>Wilcox, John, 1974. <em>Truth and Value in Nietzsche: A Study of\nHis Metaethics and Epistemology</em>, Ann Arbor: University of\nMichigan Press.</li>\n<li>Williams, Bernard, 1993. “Nietzsche’s Minimalist Moral\nPsychology,” <em>European Journal of Philosophy</em>, 1:\n4–14. Reprinted in Schacht (1994).</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "ethics: virtue",
            "free will",
            "moral anti-realism",
            "moral realism",
            "Nietzsche, Friedrich",
            "Schopenhauer, Arthur"
        ],
        "entry_link": [
            {
                "../ethics-virtue/": "ethics: virtue"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../moral-anti-realism/": "moral anti-realism"
            },
            {
                "../moral-realism/": "moral realism"
            },
            {
                "../nietzsche/": "Nietzsche, Friedrich"
            },
            {
                "../schopenhauer/": "Schopenhauer, Arthur"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=nietzsche-moral-political\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/nietzsche-moral-political/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=nietzsche-moral-political&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/nietzsche-moral-political/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=nietzsche-moral-political": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/nietzsche-moral-political/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=nietzsche-moral-political&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/nietzsche-moral-political/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.brianleiternietzsche.blogspot.com/\" target=\"other\">Brian Leiter’s Nietzsche Blog</a>",
            "<a href=\"http://www.hunter.cuny.edu/philosophy/jns/about_editorial.shtml\" target=\"other\">Journal of Nietzsche Studies</a>"
        ],
        "listed_links": [
            {
                "http://www.brianleiternietzsche.blogspot.com/": "Brian Leiter’s Nietzsche Blog"
            },
            {
                "http://www.hunter.cuny.edu/philosophy/jns/about_editorial.shtml": "Journal of Nietzsche Studies"
            }
        ]
    }
}