{
    "url": "perception-episprob",
    "title": "Epistemological Problems of Perception",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Jack Lyons\n<jack.lyons@glasgow.ac.uk>",
        "author_links": [
            {
                "mailto:jack%2elyons%40glasgow%2eac%2euk": "jack.lyons@glasgow.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nJack Lyons\n&lt;<a href=\"mailto:jack%2elyons%40glasgow%2eac%2euk\"><em>jack<abbr title=\" dot \">.</abbr>lyons<abbr title=\" at \">@</abbr>glasgow<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Dec 5, 2016",
        "substantive revision Tue Mar 14, 2023"
    ],
    "preamble": "\n\nThe central problem in the epistemology of perception is that of\nexplaining how perception could give us knowledge or justified belief\nabout an external world, about things outside of ourselves. This\nproblem has traditionally been viewed in terms of a skeptical argument\nthat purports to show that such knowledge and justification are\nimpossible. Skepticism about the external world highlights a number of\nepistemological difficulties regarding the nature and epistemic role\nof experience and the question of how perception might bring us into\ncontact with a mind-independent reality. The issues that arise are of\ncentral importance for understanding knowledge and justification more\ngenerally, even aside from their connection to skepticism.\n\nTwo main types of response to the skeptical argument have\ntraditionally been given: a metaphysical response that focuses on the\nnature of the world, perceptual experience, and/or the relation\nbetween them, in an effort to show that perceptual knowledge is indeed\npossible; and a more directly epistemological response that focuses on\nprinciples specifying what is required for knowledge and/or\njustification, in an effort to show that skepticism misstates the\nrequirements for knowledge.\n\nMuch of the philosophical tradition has viewed the central\nepistemological problems concerning perception largely and sometimes\nexclusively in terms of the metaphysical responses to skepticism. For\nthat reason, these will be addressed before moving on to the more\nexplicitly epistemological concerns.\n",
    "toc": [
        {
            "#ProbExteWorl": "1. The Problem of the External World"
        },
        {
            "#MetaSoluCentProb": "2. Metaphysical Solutions to the Central Problem"
        },
        {
            "#VariDirePres": "2.1 Varieties of Direct Presence"
        },
        {
            "#PhenDire": "2.1.1 Phenomenal Directness"
        },
        {
            "#RefeDire": "2.1.2 Referential Directness"
        },
        {
            "#PercDire": "2.1.3 Perceptual Directness"
        },
        {
            "#DireWorlInvo": "2.1.4 Direct World-Involvement"
        },
        {
            "#EpisDire": "2.1.5 Epistemological Directness"
        },
        {
            "#IdeaPhen": "2.2 Idealism and Phenomenalism"
        },
        {
            "#RealDireIndi": "2.3 Realisms, Direct and Indirect"
        },
        {
            "#SensData": "2.3.1 Sense-data"
        },
        {
            "#InteAdve": "2.3.2 Intentionalism and Adverbialism"
        },
        {
            "#DireReal": "2.3.3 Direct Realism"
        },
        {
            "#CommMetaSolu": "2.4 Comments on Metaphysical Solutions"
        },
        {
            "#EpisSolu": "3. Epistemological Solutions"
        },
        {
            "#EvidAppr": "3.1 Evidentialist Approaches"
        },
        {
            "#ClasFoun": "3.1.1 Classical Foundationalism"
        },
        {
            "#FundEpisPrin": "3.1.2 Fundamental Epistemic Principles"
        },
        {
            "#Cohe": "3.1.3 Coherentism"
        },
        {
            "#SeemInte": "3.1.4 Seemings Internalism"
        },
        {
            "#SellDileOtheChal": "3.1.5 The Sellarsian Dilemma and Other Challenges"
        },
        {
            "#SeemExte": "3.1.6 Seemings Externalism"
        },
        {
            "#EtioAppr": "3.2 Etiological Approaches"
        },
        {
            "#WorlInvoAppr": "3.3 World-involving Approaches"
        },
        {
            "#Conc": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Problem of the External World\n\nThe question of how our perceptual beliefs are justified or\nknown can be approached by first considering the question of\nwhether they are justified or known. A prominent skeptical\nargument is designed to show that our perceptual beliefs are not\njustified. Versions of this argument (or cluster of arguments) appear\nin René Descartes’s Meditations,\nAugustine’s Against the Academicians, and several of\nthe ancient and modern skeptics (e.g., Sextus Empiricus, Michel de\nMontaigne). The argument introduces some type of skeptical scenario,\nin which things perceptually appear to us just as things normally do,\nbut in which the beliefs that we would naturally form are radically\nfalse. To take some standard examples: differences in the sense organs\nand/or situation of the perceiver might make them experience as cold\nthings that we would experience as hot, or experience as bitter things\nthat we would experience as sweet; a person might mistake a vivid\ndream for waking life; or a brain in a vat might have its sensory\ncortices stimulated in such a way that it has the very same perceptual\nexperiences that I am currently having, etc.\n\nAll this suggests a “veil of perception” between us and\nexternal objects: we do not have direct unvarnished access to the\nworld, but instead have an access that is mediated by sensory\nappearances, the character of which might well depend on all kinds of\nfactors (e.g., condition of sense organs, direct brain stimulation,\netc.) besides those features of the external world that our perceptual\njudgments aim to capture. Paraphrasing David Hume (1739: I.2.vi,\nI.4.ii; 1748: sec 12.1; see also Locke 1690, Berkeley 1710, Russell\n1912): nothing is ever directly present to the mind in perception\nexcept perceptual appearances.\n\nBut if our only access to the external world is mediated by\npotentially misleading perceptual appearances, we ought to have some\nassurance that the appearances we are relying on are not of\nthe misleading variety. And here is where all the trouble arises, for\nit seems that there is no way we could have any evidence for the\nreliability of perception (i.e., perceptual appearances) without\nrelying on other perceptions. We have empirical reason, for example,\nto think that science is not yet capable of stimulating brains in a\nvery precise way, but appealing to this to rebut the possibility of\nbrain-in-a-vat scenarios seems blatantly question begging. At the\nheart of the problem of the external world is a skeptical argument\nreferred to here as “PEW,” one possible reconstruction of\nwhich follows. The premises are named, as we will want to discuss them\nindividually.\n\nNothing is ever directly present to the mind in\nperception except perceptual appearances. (Indirectness\nPrinciple) Thus:\nWithout a good reason for thinking perceptual\nappearances are veridical, we are not justified in our perceptual\nbeliefs. (Metaevidential Principle)\nWe have no good reason for thinking perceptual\nappearances are veridical. (No-Good-Reason\nClaim)\nTherefore, we are not justified in our perceptual\nbeliefs.\n\n\nA few comments on the logic of the argument are in order.\n (2)\n and\n (3)\n make up the meat of the argument; together they entail\n (4).\n This means that\n (1),\n which is motivated by the skeptical scenarios mentioned above and the\nassociated veil of perception view, would be unnecessary for deriving\nthe skeptical conclusion, as are those skeptical scenarios, were it\nnot for the fact that\n (1)\n is commonly taken to render perception inferential in such a\nway as to lend support to\n (2).\n If\n (1)\n is true, then, plausibly,\n (2)\n is: if our access is mediated by potentially nonveridical\nappearances, then we should only trust the appearances we have reason\nto think veridical. And no other reason to endorse\n (2)\n is immediately apparent (although an additional motivation for\n (2)\n will be discussed below, in\n section 3.1.1).\n (1) is therefore an important component of the traditional\nproblem. The plausibility of\n (3)\n derives from the idea that our only means of verifying the\nveridicality of appearances would itself depend on perception, in the\nquestion-begging manner sketched above.\n\nNotice that PEW addresses justification rather than knowledge. On the\nreasonable assumption that knowledge requires justification,\n (4)\n implies that our perceptual beliefs do not count as knowledge. One\nwho denies this assumption could easily rewrite PEW in terms of\nknowledge rather than justification with little or no reduction in\nplausibility. PEW has been reconstructed here in a way that is\nsupposed to be intuitively compelling. Were we to get specific about\nthe implicit quantification involved (we have no good reason for\nthinking that any perceptual appearances are veridical? that\nperceptual appearances are in general veridical? that\nthis perceptual appearance is veridical?), the argument would\nget a lot more complicated. The simpler version presented above is\nsufficient for our current purposes.\n\nThe problem of the external world should be distinguished from what is\ntypically called the problem of perception (see the entry on the\n problem of perception),\n even though they are motivated by similar considerations, in\nparticular, by the Indirectness Principle. The problem of perception\nis the problem of how perception is possible—how it is\npossible, for example, to see mind-independent objects,\nrather than inferring them from awareness of sense-experiences, in\nlight of the claim that only appearances are ever directly present to\nthe mind. The problem of the external world is a distinctively\nepistemological problem, and it focuses on the normative status of\nperceptual judgments about external objects; it matters little for\nthese purposes whether and how such judgments might amount to\nseeing. What matters is whether such judgments are or could\nbe justified.\n\nPEW illustrates the central problem of the epistemology of perception:\nif many or any of our perceptual beliefs are justified, PEW must have\ngone wrong somewhere. But where? Several subsidiary problems in the\nepistemology of perception arise in the efforts to solve this central\nproblem.\n2. Metaphysical Solutions to the Central Problem\n\nThe Indirectness Principle is a metaphysical principle: it\nsays something about the nature of perception. The Metaevidential\nPrinciple and the No-Good-Reason Claim are epistemic\nprinciples: one lays down specifically normative requirements for\njustified belief and the other denies that these requirements are\nsatisfied. Because PEW can be challenged by denying any of the\npremises, there are two main classes of solution to the central\nproblem: metaphysical solutions, which challenge the Indirectness\nPrinciple; and epistemological solutions, which challenge the\nMetaevidential Principle and/or the No-Good-Reason Claim. This section\naddresses the first class of solutions to the central problem.\n Section 3\n addresses the second class.\n\nPEW starts with the Indirectness Principle, and it has often been\nthought that the central skeptical worry is due to a metaphysics of\nperception that holds that, although worldly objects do exist outside\nof the mind, they are never directly present to the mind, but only\nindirectly so, through mental intermediaries. Thomas Reid, for\nexample, held that “Des Cartes’ system, which I shall beg\nleave to call the ideal system, … hath some original\ndefect; that this skepticism is inlaid in it, and reared along with\nit” (1785: 1.vii). Consequently, a great deal of philosophy\nsince Descartes has involved various attempts to block PEW by doing\naway with the intermediaries between the mind and the objects of\nperception, by offering a metaphysics of perception that puts these\nobjects directly before the mind. If perception is direct in the\nrelevant sense, then the skeptical problem never even gets off the\nground.\n\nThere are two main branches to this tradition. The more obvious and\ncommonsensical one originates with Reid (1764, 1785) who insists that\nphysical objects and their properties can be directly present to the\nmind as well as mental objects can. This is the direct realist option.\nEarlier on the scene, however, is a tradition tracing back to George\nBerkeley (1710, 1713), which agrees with Descartes that only mental\nitems are directly present to the mind but which holds that the\nobjects of perception—tables, rocks, cats, etc.—are really\nmental items after all. This is the idealist/phenomenalist option.\nDespite the manifest differences between realist and idealist\nmetaphysics, both branches of the “direct presence”\ntradition are united in rejecting the Indirectness Principle,\ninsisting that tables and such are indeed directly present to the mind\nin perception. If perception is thus direct, the Indirectness\nPrinciple is false, and support for the Metaevidential Principle is\nundercut, and PEW ceases to pose a threat to knowledge.\n2.1 Varieties of Direct Presence\n\nWhether in the realist or idealist tradition, the direct presence\ntheorist rejects the Indirectness Principle, insisting that when one\nperceives a cat, for example, the cat is directly in view, directly\npresent to, simply there before the mind. But what is meant\nby these spatial metaphors? The metaphors can be unpacked in several\nimportantly different ways, having different implications for the rest\nof PEW. The spatial/metaphorical terminology has been so vastly\nprevalent in the literature that it is very often hard to tell which\nauthor intends which conception(s) of directness. Consequently, it is\ndifficult to pin particular conceptions of directness on particular\nauthors, and the presentation here won’t try except where\nit’s quite obvious. Instead, the next five subsections aim to\nmap out the more salient possibilities. Later, in sections\n 2.2\n and\n 2.3,\n these distinctions will be used to examine how the traditional\nmetaphysical theories of perception bear on the epistemology of\nperception.\n\nNotice that what is metaphorical about “direct presence”\nis the notion of presence, not of directness. To be directly\npresent is to be present, but not in virtue of the presence of another\nthing (that would be indirect presence). Directness is merely\nunmediatedness, but what kind of mediation is at issue will depend on\nwhat kind of presence is intended.\n2.1.1 Phenomenal Directness\n\nOne dimension of directness, emphasized by Reid (1785), notes that\nperceptual judgments are phenomenally noninferential, in the sense\nthat they do not result from any discursive or ratiocinative process;\nthey are not introspectibly based on premises. This noninferentiality\nis usually understood loosely enough to allow for perceptual\nbeliefs’ being based on things other than beliefs (in\nparticular, on experiential states, as we will see below) and also to\nallow for the possibility of unconscious or subpersonal inferential\ninvolvement in the formation of perceptual beliefs, so long as the\nagent is not deliberately basing these perceptual beliefs on\nother beliefs. Without these two allowances, claims of\nnoninferentiality would quickly run afoul of standard views in\nepistemology and psychology, respectively. To claim that perception is\nphenomenally direct is to claim that it is noninferential in this\nsense.\n2.1.2 Referential Directness\n\nAnother way that perception might be direct is if perception\nrepresents external objects, as such, without that representation\nbeing mediated by representation of other things. Contrast this with\nthe classical empiricists’ opposing view, that the only way to\nrepresent external objects is as the cause of our sensations (Locke\n1690, Berkeley 1710). One might worry, however, that unless perception\nputs objects directly before us, we are in danger of not genuinely\nbeing able to think about the objective, external world at all, but\nonly about ourselves. To say that perception is referentially direct\nis to say that the ability of perceptual states to represent does not\ndepend on the ability of other states to represent.\n2.1.3 Perceptual Directness\n\nOne version of indirectness claims that we perceive outer\nthings by perceiving (or standing in a quasi-perceptual\nrelation to) inner things—usually sense-data (see below and the\nentry on\n sense-data).\n This makes it sound as if what we thought was ordinary direct\nperceiving of tables and rocks and such is really more like\n“perceiving” that someone has broken into your\nhouse—indirectly, on the basis of actually perceiving the broken\nwindow, empty area where the TV used to be, and so on. It is easy to\nsee how such perceptual indirectness may invite the semantic and\nepistemological worries we have been seeing. To claim that perception\nof external objects is perceptually direct is to claim that it is not\nmediated by the perception (or quasi-perceptual apprehension\nor awareness) of something else.\n2.1.4 Direct World-Involvement\n\nOne could endorse phenomenal directness and perceptual directness\nwhile still holding that perceptual contact is mediated by experience,\nwhere experience is conceived as something in virtue of which we have\nperceptual contact, though it is not the perceptual contact itself. An\nalternative is a relational metaphysics of perception according to\nwhich elements of the perceived world are literally parts of the\nperceptual experience. On idealist versions of this view, the mental\nstates whose immediate apprehension constitutes perceptual experience\njust are the objects of perception (or parts of these\nobjects). On (direct) realist versions of the view, perceptual\nexperiences are not internal mental states of the agent but are\nrelations between the agent and some external objects or states of\naffairs. Thus the agent is in a different type of mental state in the\ncase of veridical perception (the “good case”) than in the\ncase of hallucination (the “bad case”). Veridical\nperception is a certain kind of relation to a distal array, while\nhallucination or dreaming is an introspectively indistinguishable but\nmetaphysically distinct relation to something else entirely.\n2.1.5 Epistemological Directness\n\nFinally, one might hold that perception is direct in the sense that\none’s perceptual beliefs about external objects, like rocks and\ncats and such, enjoy a kind of justification or knowledge that does\nnot depend on—is not mediated by—any other justification\nor knowledge. Such beliefs are said to be “epistemically\nnoninferential”, or “epistemologically basic” and\nthe normative status is sometimes referred to as “immediate\njustification/knowledge” or “basic\njustification/knowledge”. This possibility will be explored in\nmore detail below, in\n section 3.\n Epistemological directness will be treated separately from the\nprevious senses of direct presence, which can all be viewed as\nmetaphysical senses of direct presence. The relation between\nmetaphysical and epistemological directness will be addressed below,\nin\n section 2.4.\n\nWith these distinctions in hand, we can better situate the traditional\ntheories of perception that are often thought to bear on the skeptical\nproblem.\n2.2 Idealism and Phenomenalism\n\nIdealism and phenomenalism are views that hold that ordinary objects\n(tables, clouds, rocks, etc.) are really collections of or constructs\nout of actual and/or possible mental states, especially perceptual\nexperiences. (I won’t try to distinguish phenomenalism from\nidealism but will use “idealism” to include both.) There\nare several varieties of idealism and several motivations for holding\nthe view. But one motivation is that it promises to solve the\nskeptical problem of the external world. Berkeley (1710) held that\nidealism was a cure for skepticism. Transcendental idealism (Kant\n1781) aims to split the difference with the skeptic by distinguishing\nthe phenomenal objects of perception—which are collections of\nappearances and about which we can know something—from the\nnoumenal objects—which are things in themselves and not mere\nappearances, and about which skepticism is true.\n\nIdealism promises to solve the skeptical problem by attacking the\nIndirectness Principle. If the problem of the external world starts\nwith the gap between the proximal and the distal objects of perceptual\nexperience, then idealism would avoid skepticism by simply closing\nthat gap. The idealist can embrace direct world-involvement while\nretaining the claim that nothing is ever directly present to the mind\nbut its own mental states, by holding that the world is fundamentally\nmental, that, e.g., tables are just collections of ideas. Although\nmetaphysical solutions are usually aimed at the Indirectness\nPrinciple, idealism might, additionally, undermine the No-Good-Reason\nClaim. Hume (1739) argued that we couldn’t reasonably posit\nexternal objects as plausible causes of our experiences without first\nobserving a constant conjunction between external objects and\nexperiences; but we can’t “observe” external objects\nunless we justifiedly believe in their existence, which we could only\ndo if we could reasonably posit them as plausible causes of our\nexperiences. Thus, a vicious circularity. On the other hand, if the\nobjects of perception are not external after all, we are in a better\nposition to infer causal relations between them and individual\nexperiences.\n\nThe main difference between idealism and an indirect realism concerns\nnot so much the metaphysics of perception as a larger metaphysical\nview about what else exists outside of the mind. Berkeley and\nDescartes agree about the direct objects of perception, but Descartes\nposits an additional stratum of mind-independent external objects in\naddition. The idealist denies that there is a veil of perception not\nbecause Descartes was wrong about the nature of perception, but\nbecause he was wrong about the natures of cats and rocks.\n\nIdealism has a few contemporary defenders (e.g., Foster 2008, Hoffman\n2009, Robinson 2022), though it is nowhere near the dominant view that\nit had been for almost two centuries after Berkeley. Most responses to\nPEW in the last century have endorsed some kind of realism instead,\ninsisting that ordinary objects are indeed mind-independent.\n2.3 Realisms, Direct and Indirect\n\nThe problem of the external world, especially the Indirectness\nPrinciple, sees its modern renaissance in Descartes’s\nrepresentative realism, which was offered as an alternative to both\nthe commonsense view of naive (aka direct) realism, and the\nhylomorphic theory standard among Scholastics. This latter doctrine\nholds that objects are combinations of primordial matter and forms\nimpressed upon them, which determine the objects’ properties;\nthese objects then cast off forms that can enter the mind through the\nsense organs. A red thing is simply something that has the form of\nRED, which it can transmit, making the receptive, perceiving mind\nalso—though presumably in a different sense—red.\n\nBoth theories have difficulty handling error. Science frequently\nteaches us that things are not in reality the way they appear to the\nsenses. The sun, for example, perceptually appears as a small disk\nrather than the large sphere that it is (Descartes 1641). This\nperceptual experience cannot involve either the transmission of forms\n(since the sun doesn’t have those forms), or the “direct\npick-up” of objective properties (again, those properties\naren’t there to pick up). Nor could we simply be picking up\nrelational properties, like looking small from here,\nDescartes argues, because I could have the very same perceptual\nexperience in a vivid dream (where even the relational properties are\nnot instantiated) as I do in waking life. Therefore, perceptual\nappearances must be entirely mental and internal, rather than\nrelational. Insofar as external objects are at all present to the\nmind, it is only because of these appearances, which thus serve as\ninner stand-ins, or proxies, for them. As John Locke puts it,\n\n\nthe understanding is not much unlike a closet wholly shut from light,\nwith only some little openings left, to let in external visible\nresemblances, or ideas of things without. (1690: 163)\n\n\nIt is this notion of standing in that the term “representative\nrealism” is supposed to capture. The representative realist may,\nbut need not, hold that these proxies are also\nrepresentations in the sense of having semantic contents,\ni.e., truth- or accuracy-conditions. In fact, the most recognizable\nform of representative realism denies that experiences are in this\nsense representational.\n2.3.1 Sense-data\n\nThis best known, though now widely rejected, form of representative\nrealism incorporates a sense-datum theory (see the entry on\n sense-data),\n which holds that every perceptual experience as of something’s\nbeing F involves the subject’s awareness of something\nthat really is F. My having a perceptual (veridical or\nhallucinatory) experience as of something’s being blue requires\nthere to be a nonphysical, inner, mental object—a\nsense-datum—that is blue. Sense-data are not normally taken to\nbe true or false, any more than rocks or tables are; nonetheless,\nsense-data constitute the inner rocks and tables in virtue of which we\nperceive external rocks and tables and are in that sense the\nlatter’s representatives. Two important features of this theory\nare worth highlighting: (i) that sense-data really do have the\nproperties that external objects appear to have, and (ii) that the\nrelation one stands in to one’s sense-data is a perceptual, or\nquasi-perceptual, relation: one is perceptually aware of objects due\nto a more fundamental awareness of one’s sense-data.\n\nAny version of representative realism is indirect in the sense of\ndenying direct world-involvement. The sense-datum theory further\ndenies perceptual directness, as it has us perceive objects by way of\nperceiving our sense-data; and it is typically fleshed out in such a\nway as to be incompatible with referential directness as well, holding\nthat we can think about mind-independent objects only as the external\ncauses of these sense-data. It is, however, compatible with phenomenal\nand epistemological directness. For example, one could deny that the\n“inference” from sense-data to external objects is\nconscious and deliberate and insist that only such deliberate\ninferences would render a belief epistemically inferential (i.e.,\nnonbasic) in the sense of\n 2.1.5\n above.\n2.3.2 Intentionalism and Adverbialism\n\nIntentionalism holds that to perceive (or hallucinate)\nsomething as being blue is to be in a state with a distinctively\nsemantic property of meaning blue, of referring to\nor predicating the property of blueness (see the entry on\n consciousness and intentionality).\n On this view, the inner states are not just representatives but\nrepresentations; they have semantic values. Such\nrepresentations typically lack the properties they depict external\nobjects as having. Furthermore, the relation one stands in to\none’s perceptual representations is not necessarily a\nquasi-perceptual one: it is normally held that one simply\nhas, or tokens, the representations; they are not in\nany sense objects of perception or awareness in the ordinary\ncourse of events, but the vehicles of perception (Huemer\n2001). They might, of course, become objects of awareness if we\nreflectively attend to them; and certain theories of consciousness\nhold that a perception only becomes conscious when it is the object of\na higher order quasi-perceptual state, but in general, being in the\nperceptual state does not require perceiving one’s\nperceptual representations.\n\nSense-datum and intentionalist views both see perceptual experience as\na two-place relation between perceiver and inner representative.\nAdverbialism, on the other hand, holds that perceptual\nexperience itself is monadic; it doesn’t involve the perceiver\nstanding in a relation to something (see the entry on the\n problem of perception).[1]\n Different kinds of perceptual experiences are simply different ways\nof sensing: one “senses greenly” or “is appeared to\nhorsely”, and such locutions do not commit us to the existence\nof either sense-data or representations. Adverbialism is sometimes\noffered as an ontologically neutral way of talking about experiences\n(Chisholm 1957), sometimes as the more contentious claim that\nperceptual experience is primitive and unanalyzable.\n\nIntentionalism and adverbialism deny direct world-involvement but are\ncompatible with the other varieties of directness. They are also\ncompatible with any of the corresponding varieties of\nindirectness.\n2.3.3 Direct Realism\n\nProponents of intentionalist and adverbialist theories have often\nthought of themselves as defending a kind of direct realism; Reid\n(1785), for example, clearly thinks his proto-adverbialist view is a\ndirect realist view. And perceptual experience is surely less indirect\non an intentionalist or adverbialist theory than on the typical\nsense-datum theory, at least in the sense of perceptual directness.\nNevertheless, intentionalist and adverbialist theories render the\nperception of worldly objects indirect in at least two important ways:\n(a) it is mediated by an inner state, in the sense that one\nis in perceptual contact with an outer object of perception only\n(though not entirely) in virtue of being in that inner state; and (b)\nthat inner state is one that we could be in even in cases of radical\nperceptual error (e.g., dreams, demonic deception, etc.). These\ntheories might thus be viewed as only “quasi-direct”\nrealist theories; experiences still screen off the external world in\nthe sense that the experience might still be the same, whether the\nagent is in the good case or the bad case. Quasi-direct theories thus\nreject the Indirectness Principle only under some readings of\n“directness”. A fully direct realism would offer an\nunequivocal rejection of the Indirectness Principle by denying that we\nare in the same mental states in the good and the bad cases. In recent\nyears, direct realists have wanted the perceptual relation to be\nentirely unmediated: we don’t achieve perceptual contact with\nobjects in virtue of having perceptual experiences; the\nexperience just is the perceptual contact with the object\n(Brewer 2011).This is the view that perceptual experience is\nconstituted by the subject’s standing in certain relations to\nexternal objects, where this relation is not mediated by or analyzable\nin terms of further, inner states of the agent. Thus, the brain in the\nvat could not have the same experiences as a normal veridical\nperceiver, because experience is itself already world-involving.\n\nThe type of direct realism that has received the most attention\nrecently is disjunctivism (e.g., Snowdon 1980, McDowell 1982, Martin\n2002, Haddock & Macpherson 2008; see the entry on the\n disjunctive theory of perception).\n There are many different versions of disjunctivism, but a common\nthread is the claim that the experiences involved in the veridical\ncase are ipso facto of a different type than those involved in the\nhallucinatory cases. The theory of appearing (Alston 1999) is a type\nof disjunctivism but one that emphasizes the direct world-involvement\nin the veridical case rather than the radical difference between the\ncases.\n\nSome forms of behaviorism, functionalism, and embodied mind are also\ndirect realist views. If, for example, having a certain perceptual\nexperience constitutively involves being disposed to act on worldly\nobjects and properties in certain ways—that is, if behavioral\ndispositions are themselves individuated as world-involving—then\nthis would render the experience relational in the way required by\ndirect realism; disembodied brains in vats could not have the same\nexperiences as we have in normal, veridical cases. Similar\nconsequences follow if perceptual experience is understood in terms of\n“skilled coping” (Dreyfus 2002) or “sensorimotor\nknow-how” (Noë 2004), again, provided that these terms are\nread as requiring certain interactions with real, external objects.\nAny such theory implies that brains in vats couldn’t have the\nsame experiences we do, because they’re causally disconnected\nfrom the physical world. Such a view need not be a form of\ndisjunctivism, however; depending on the details of the theory, a\nhallucinating subject who is nevertheless embedded in and disposed to\nact on the world in the right ways might have the same experience as a\nveridically perceiving subject.\n\nDirect realism is compatible with all the metaphysical species of\ndirect presence listed above. As such, it allows for an unequivocal\ndenial of premise\n (1)\n of PEW, while quasi-realist views only reject that premise under\ncertain understandings of direct presence.\n2.4 Comments on Metaphysical Solutions\n\nIf representative realism is the cause of the central epistemological\nproblem for perception, then perhaps direct realism or idealism will\nbe the solution. Some philosophers have thought that these\nmetaphysical views resolved the epistemological problem by closing the\ngap between appearance and reality, by making ordinary objects (e.g.,\ntables and rocks) directly present to the mind.\n\nOn further reflection, however, it is clear that the metaphysical\naccount will be, at best, a part of the solution.\n\nConsider again PEW:\n\nNothing is ever directly present to the mind in\nperception except perceptual appearances. (Indirectness\nPrinciple) Thus:\nWithout a good reason for thinking perceptual\nappearances are veridical, we are not justified in our perceptual\nbeliefs. (Metaevidential Principle)\nWe have no good reason for thinking perceptual\nappearances are veridical. (No-Good-Reason\nClaim)\nTherefore, we are not justified in our perceptual\nbeliefs.\n\n\nMost metaphysical solutions attack the Indirectness Principle as a way\nof undercutting the Metaevidential Principle. But they only attack\nmetaphysical readings of the Indirectness Principle, and while the\nvarious metaphysical theories of perception from sections\n 2.2\n and\n 2.3\n may have certain intuitive affinities with the Metaevidential\nPrinciple or its denial, it follows from Hume’s “no\nought from is” dictum that none of them\nimmediately implies either premise\n (2)\n or its negation. Epistemological directness does straightforwardly\nentail the rejection of\n (2),\n but epistemological directness is compatible with any of the\nmetaphysical theories of perception glossed above and is entailed by\nnone of them. At best, a metaphysical theory of perception will block\none avenue of intuitive support for\n (2),\n but it will not imply that\n (2)\n is false.\n\nAn idealist, for example, will allow that we sometimes dream and that\nthere is a real difference between hallucination and veridical\nperception, even though in both cases the direct object of awareness\nis a collection of ideas. The standard view (Berkeley 1710) is that a\nhallucinatory table is a different sort of collection of\nideas than a real table; certain counterfactuals are true of the\nlatter that are not true of the former (e.g., that if I were to will\ncertain movements, my visual perceptions would change in certain ways,\netc.). But this reopens the gap between perceptual experiences and\nordinary objects. Tables are not just experiences; they are larger\nentities of which experiences are parts, and those parts can be shared\nby hallucinations. So what is directly present to the mind is\nsomething common to hallucination and veridical perception. So my\nperceptual experience would seem to be neutral with respect to whether\nI am seeing or hallucinating a table. So to be justified in believing\nthere is a table in front of me, I will need some reason to think this\nparticular experience is veridical, and PEW is back in business\n(Alston 1993, Greco 2000).\n\nDirect realism precludes this particular relapse into skepticism by\ndenying that the experience is the same in the good and the bad cases.\nIf our perceptual evidence includes the experience, then our evidence\nin the good case is different from our evidence in the bad\ncase—they are different mental states. It does not follow,\nhowever, that these two bits of evidence have differing evidential\nimport; both may—for all we’ve been told so far—be\nevidentially neutral with respect to, e.g., whether there is actually\na chair in front of me or whether it merely appears so. Even if they\nare very different mental states, it doesn’t follow that they\nlicense different inferences; nothing prevents the direct realist from\nholding that both only license beliefs of the form ‘I’m\neither seeing or hallucinating a table’. Additionally, the\ndirect realist is free to impose a metaevidential demand on justified\nperceptual belief, a demand that we know which kind of experience we\nare having before that experience can serve as evidence.\nUnsurprisingly, direct realists often endorse some kind or other of\nepistemological directness\n (section 3.3\n below), though some endorse the Metaevidential Principle, and in any\ncase, the metaphysical view is by itself silent on this\nepistemological issue.\n\nEven with the metaphysical premise\n (1)\n removed, a purely epistemological version of PEW, consisting of\n (2)\n through\n (4),\n still challenges the justification of our perceptual beliefs. A\nsatisfying solution to the problem of the external world requires the\narticulation of some plausible epistemic principles, one that explains\nwhich of the two crucial premises\n (2)\n and\n (3)\n of PEW are being rejected, and provides an epistemological context\nwhich renders that rejection plausible. An entirely metaphysical\nsolution to the problem of the external world will not suffice. An\nepistemological solution to this epistemological problem will be\nneeded in addition or instead.\n3. Epistemological Solutions\n\nAny satisfactory, non-skeptical epistemology of perception is going to\ndeny one or more of the epistemological premises of PEW. But that\ndenial will have to be situated within the context of a larger\nepistemological theory of perceptual belief—or better yet, of\nbelief more generally. There are three broad, not necessarily\nexclusive, approaches to this question:\n\nan evidentialist approach, which holds that\nperceptual beliefs are justified when held on the basis of (or when\nthe agent is in possession of) something that counts as a good\nreason for holding that belief;\nan etiological approach, which holds that\nperceptual beliefs are justified when formed in an appropriate way\n(i.e., when the psychological processes by which the beliefs are\nproduced are the kind that generally conduce to justification);\nand\na world-involving approach, which holds that\nperceptual beliefs are justified when the agent is appropriately\nrelated to the worldly truthmaker for that belief (e.g., the\nperceptual belief that p is justified when the agent\nsees that p).\n\n\nThe first two are normally defended as parts of and continuous with a\nmore general epistemological view, encompassing not just perception\nbut also testimony, introspection, memory, inductive and deductive\ninference, and so on. The world-involving view, on the other hand, is\nformulated specifically to handle perception, though one could imagine\nit being extended to some of these other sources.\n\nAn important difference among these approaches is the way they handle\nperceptual experiences. On nearly any evidentialist view,\nexperiences—construed as internal, nonfactive (i.e.,\nnon-factively-individuated) mental states of the agent—play a\ncentral role in the epistemological story, although not necessarily an\nevidential role; indeed what that role is will differ\nconsiderably for the different evidentialist views. For an etiological\nview, experiences matter if and insofar as they are links in the\ncausal chain by which perceptual beliefs are formed, but they are no\nmore or less important than the other, nonexperiential, links. The\nworld-involving views bring experiences back to a position of\ncentrality, but only with a very different understanding of\nexperiences: not as inner states of an agent but as factive,\nrelational phenomena holding between a perceiving agent and a worldly\nstate of affairs.\n\nThese three are quite general approaches, and there is much room for\ndisagreement within each. Thus there are internalist as well as\nexternalist varieties of each as well as disagreement within each as\nto which of the epistemological premises of PEW is to be rejected.\n3.1 Evidentialist Approaches\n\nFor most of the history of philosophy, epistemologists have assumed a\nframework that is both internalist and at least weakly evidentialist.\nSince the mid-1960s, both the internalism and the evidentialism have\nbecome controversial views, rather than common ground that can simply\nbe assumed without argument, though they are still very much live\noptions.\n\nThe traditional framework is internalist in both of the two main\nsenses of mentalism, holding that all the factors relevant to\njustification supervene on the nonfactive mental states of the agent;\nand accessibilism, requiring that the presence of these\nfactors is knowable by the agent on the basis of mere reflection (see\nentry on\n internalist and externalist conceptions of epistemic justification).\n The framework is weakly evidentialist in requiring—at least for\nany proposition that is not directly (i.e., immediately)\njustified—that its justification derives from and is a function\nof an actual or potential basing relation to some ground, or reason,\nin relation to which that proposition is a reasonable one to believe.\nContemporary evidentialists tend to espouse a stronger kind of\nevidentialism, according to which all justification, and not\njust indirect justification, is a function of the agent’s\nevidence. But this is a later development. There’s no hint in\nDescartes or Locke, for example, that experiences serve as\nreasons for appearance beliefs; rather, their occurrence is\npartly constitutive of the reflectively transparent infallibility of\nthose introspective judgments, which gives these judgments the highest\ndegree of epistemic certainty.\n3.1.1 Classical Foundationalism\n\nFoundationalism is the view that some beliefs are epistemologically\ndirect, or “basic”—i.e., their justification does\nnot depend on evidential support from other beliefs—and all\nother justified beliefs ultimately derive their justification from\nthese. (Basically justified beliefs are sometimes referred to as\n“immediately justified” as well.) Classical\nfoundationalism is the view that (i) it is appearance\nbeliefs—i.e., beliefs about perceptual\nappearances—that are basic, and perceptual beliefs about\nordinary objects, events, and properties are based at least partly on\nthese, and (ii) perceptual justification requires us to have good\nreason to think that the relevant current appearances are veridical.\nBasing is a relation of epistemic dependence and does not\nimply explicit inference, although particular theories might hold that\nthe relation is satisfied only when inference occurs.\n\n(i) is defended in one of several ways. Here are brief versions of\nsome of the more common, often implicit, arguments:\n\nThe empirical foundation must consist of the most highly justified\ncontingent beliefs, and these are appearance beliefs.\nIn order for perception to give us genuine knowledge of the\nexternal world, perceptual knowledge must be grounded in direct\nacquaintance with something; we are not directly acquainted with\nphysical objects, but only with our experiences, so beliefs about\nthese experiences must serve as the foundations of perceptual\nknowledge.\nWe can and do articulate beliefs about our experiences in defense\nof our perceptual beliefs when challenged; so these appearance beliefs\nmust be at least part of our evidence for the perceptual beliefs.\nPerceptual beliefs about external objects are not self-evident (if\nthey were, they would be justified whenever held), so they must be\nbased on some other belief; the only candidates are appearance\nbeliefs, which plausibly are self-evident.\n\n\n(ii) includes an endorsement of the Metaevidential Principle. We have\nlooked at representative realism as one motivation for that principle,\nbut there are others. Classical foundationalists have traditionally\nendorsed it because it follows from two other claims they find\nplausible. The first is (i) above, that our perceptual beliefs are\nbased on appearance beliefs. The second is the claim that in order to\nbe justified in believing hypothesis h on the basis of\nevidence e, one must be justified in believing that\ne makes h probable (or that e entails\nh, or e is good evidence for h, etc.) This\nsecond claim is a version of Richard Fumerton’s “Principle\nof Inferential Justification” and is often defended by citing\nexamples (Fumerton 1995; see the entry on\n foundationalist theories of justification).\n My belief that you’re going to die soon cannot be justified on\nthe basis of your tarot card reading unless I’m justified in\nbelieving that tarot cards really do tell the future. Whether such\nexamples generalize to all inferences is an open question.\nSome forms of internalism (see the entry on\n internalist vs. externalist conceptions of epistemic justification)\n would imply the Principle of Inferential Justification as well.\n\nThe classical foundationalist avoids skepticism by rejecting the\nNo-Good-Reason Claim, insisting that we do often have good,\nnon-viciously-circular, reasons for thinking that our experiences are\nveridical. Two questions thus arise for classical foundationalism, one\nabout the nature and justification of appearance beliefs and one about\nthe allegedly non-circular inference from appearance beliefs to\nperceptual beliefs.\n\nAppearance beliefs are not based on other beliefs, so how are they\njustified?\n\nAppearance beliefs are a species of introspective belief, and\nintrospection is sometimes thought to involve a “direct\ncontact”, or “confrontation”, or “acquaintance\nwith”, or “access to”, or\n“self-presentation” of certain truths. As we saw in\n section 2.1,\n regarding “direct presence”, such metaphors could be\nunpacked in a variety of ways. If claims about\n“acquaintance” and the like (for simplicity, all of them\nwill be referred to indiscriminately as “acquaintance”)\nare given an epistemological reading, then they seem to restate or\nreiterate the classical foundationalist’s claim that we can have\nfoundational justification for appearance beliefs, rather than to\nexplain or argue for that claim. If they are making some metaphysical\nclaim, then the consequences for epistemology are indirect and\nunclear. Epistemologists are sometimes less than fully explicit about\nhow they are understanding acquaintance. And however acquaintance is\nunderstood, the classical foundationalist must make acquaintance broad\nenough that we are plausibly acquainted with appearances (on pain of\nskepticism) but narrow enough that we are not acquainted with physical\nobjects as well (or else endorse a very different kind of\nfoundationalism).\n\nRoderick Chisholm’s (1977) conception of acquaintance (he calls\nit “self-presentation”) is explicitly and fundamentally\nepistemic—a self-presenting state is simply one such that a\nperson is justified in believing they are in it whenever they actually\nare in it. This doesn’t explain or argue for the special\nepistemic status of appearance beliefs, but Chisholm denies that\nargument or explanation is needed: it is self-presenting that\nappearance beliefs are self-presenting.\n\nAttempts to explicate acquaintance in non-epistemic terms fall into\none of two categories. The traditional way to understand acquaintance\nis in terms of a containment relation between appearance beliefs and\nappearances, with the result that appearance beliefs entail their own\ntruth. This is the indirect realist’s analogue of the\nworld-involvement invoked by direct realists (above, sections\n 2.1.4,\n 2.3.3). Descartes (1641) held that appearance beliefs, like any\nbelief about one’s own mental states, are infallible for this\nreason, and transparently so, and thereby justified. Though some still\nendorse this view (McGrew 2003), most epistemologists deny that our\nself-attributions are infallible. A more modest claim is that only\nsome appearance beliefs are infallible. A certain kind of\ntoken-reflexive concept (“direct phenomenal concepts”)\nmight include phenomenal qualities as literal elements or constituents\n(Chalmers 2003), and so introspective judgments that involve the\napplication of such concepts cannot be mistaken.\n\nThis does not yet fully account for the distinctive epistemic status\nof appearance beliefs, as the epistemic implications of infallibility\nremain unclear, especially in the context of an internalist\nepistemology. One might believe some necessary truth as the result of\na lucky guess; the belief is infallible, but not justified. This seems\nat least in part to result from the fact that the infallibility\noccurs, in some sense, outside of the agent’s perspective. (The\ninfallibility involved in self-attribution, however, seems intuitively\nto fall within the agent’s perspective.)\n\nThe second type of approach views appearance beliefs as justified by\nsomething extrinsic to them, so that an appearance belief is justified\nwhen it is accompanied by acquaintance with the experiential fact that\nthe appearance belief describes. Laurence BonJour (2003), for example,\nunderstands acquaintance in terms of constitutivity, though in a very\ndifferent way from the one just seen. BonJour claims that awareness of\nthe sensory content of an experience is partly constitutive of what it\nis to have a conscious experience. That awareness is thus infallible,\nbut appearance beliefs—which purport to describe the\nexperience and constituent awareness—are fallible. Though, he\nhastens to point out, we are very likely to get them right in such\nconditions. Similarly, Fumerton (1995, 2001) claims that acquaintance\nis a nonepistemic relation, but that whenever we’re acquainted\nwith a fact, everything possibly relevant to the truth of that fact is\nunproblematically there before the mind.\n\nThese two views see acquaintance as a metaphysical (i.e.,\nnon-epistemic) relation. They lay down as a separate, further thesis\none that is not directly entailed by but is rendered highly plausible,\nproponents think, by the nature of the acquaintance relation: that\nwhen one is thus acquainted with an experience, one has a strong\nprima facie justification to believe that one has that\nexperience, and furthermore, that justification does not depend on any\nother beliefs. On either non-epistemic understanding of acquaintance,\nit puts us in a very good position to make correct judgments about our\ncurrent experiences. Most classical foundationalists allow that all\nappearance beliefs are defeasible (i.e., having a kind of\njustification that is capable of being overridden or undermined by\nfurther reasons); hence the claim made is merely for prima\nfacie, rather than ultima facie, justification. (To say\nthat a belief is prima facie [aka pro tanto]\njustified is to say that it is has some positive epistemic status, in\nthe sense that it is justified if it is not defeated by\noverriding or undermining considerations.) Chisholm (1977) and Timothy\nMcGrew (2003) endorse the stronger claim that acquaintance provides\nindefeasible, ultima facie justification.\n\nSo far we haven’t seen any talk of evidence; that will come\nlater for these views, in the movement from appearance beliefs to\nbeliefs about the external world. But a stronger kind of evidentialism\ncould hold that the experience (or acquaintance with it) serves not\nonly as a truth-maker and justifier for the appearance belief, but as\nevidence for that belief as well. By “evidence”\nis meant here not just any factor that serves to confer justification\non a belief, but something that serves as a ground, or\nreason, or rational basis, for that\n belief.[2]\n Not all justification-conferring or justification-relevant factors\ncount as evidence in this sense (if they did, evidentialism [see Conee\nand Feldman (2004) and entry on\n epistemology]\n would not be the controversial thesis that it is). Evidence, in the\ncurrent context, is something that an agent can possess and\non which they can base a belief; someone who possesses\nevidence that fits, or supports, some belief has\n(prima facie) propositional justification for that belief,\nand doxastic justification if that belief is based on that evidence.\nNot all justification-making factors fit this bill. For example,\nDescartes held that all clear and distinct judgments were justified,\nthough certain judgments—e.g., “I think”—are\njustified without evidential appeal to clarity and distinctness. It is\nthe fact that it is clear and distinct that makes it\njustified, not the agent’s awareness of that fact or\nappreciation of that fact’s epistemic significance, so clarity\nand distinctness are not functioning here as evidence. Similarly,\nreliabilism holds, roughly, that being reliably formed renders a\nbelief justified; although reliability need not—and typically\ndoes not—figure in as the agent’s evidence or grounds for\nbelieving something.\n\nThe stronger evidentialist view holds that even directly (i.e.,\nbasically/immediately) justified beliefs are justified by evidential\nconnections, but since these beliefs are basic, their evidence must\nconsist of something other than (justified) belief. Hence the popular\nclaim that perceptual experiences are nondoxastic (i.e., non-belief)\nstates that nevertheless serve as evidence for appearance beliefs, in\nmuch the way that beliefs serve as evidence for other beliefs, though\nwith one crucial difference: for one belief to serve as evidence for\nanother, the former must be justified; experiences on most views are\nnot susceptible to justification, thus can be neither justified nor\nunjustified, but—on the standard strongly evidentialist\nview—can nevertheless serve as evidence and confer justification\non beliefs. The justification of appearance beliefs on this view\ndepends on evidential connections to other mental states but not to\nother beliefs, and because experiences need not be justified in order\nto serve as evidence, the threatened regress is halted in a way that\nis consistent with foundationalism. The idea of such nondoxastic\nevidence raises several problems, as we will see shortly.\n\nClassical foundationalism is sometimes objected to on the grounds that\nwe typically do not have beliefs about our experiences (e.g., Pollock\n1986, Greco 2000), at least not consciously. This raises interesting\nand difficult issues about the natures of evidence and the basing\nrelation. For the belief that p to serve as justifying\nevidence for the belief that q, must I consciously form the\nbelief that p, or is it enough that, e.g., I have good reason\nto believe that p and be disposed to do so if the question\narises? Surely the classical foundationalist never denied phenomenal\ndirectness or thought our perceptual beliefs were reasoned out\nexplicitly. If one could show that only consciously formed beliefs\ncould ground other beliefs, this would be bad news indeed for\nclassical foundationalism, but this is a controversial claim.\nAlternatively, the objection might be that we are typically not even\nyet in a position to form justified appearance beliefs, in\nsome situations where we are nevertheless well justified in our\nperceptual beliefs. Being in a position to form justified appearance\nbeliefs would require further investigation, in an\n“inward” direction. This investigation is not always easy\n(Pollock 1986), and it is possible that such investigation would alter\nthe nature of the experience. In addition, some perceivers may lack\nthe conceptual resources to distinguish appearances from external\nobjects, although they seem to be justified in their perceptual\nbeliefs nonetheless.\n\nThe second big question for the classical foundationalist is how\nappearance beliefs provide justification for beliefs about external\nobjects.\n\nCartesian foundationalism was the strictest form of classical\nfoundationalism, requiring a deductive metaevidential argument for the\nreliability of perception. Descartes believed that he could give a\nnon-circular argument for thinking that some perceptual experiences\nwere veridical, by constructing an a priori argument for the\nreliability of perception. He also aimed for certainty, so his\nargument was a deductive one, starting with the existence and\nperfection of God and concluding that any clear and distinct awareness\n(including some elements of perceptual awarenesses) must be true; so\nsome perceptual experiences—namely, the clear and distinct\nones—are veridical. This would have licensed a rejection of the\nNo-Good-Reason Claim, by showing how we could have a good reason for\nthinking our experiences to be veridical. However, Descartes’s\na priori arguments for the existence of God were at best\ncontroversial, and the theology needed to deduce the reliability of\nperception from the perfection of the deity was unconvincing, so\ndeductive metaevidential arguments along these lines were not pursued\nfurther.\n\nNonCartesian forms of classical foundationalism have tried to combine\nthe a priority required by non-circularity with a probabilistic form\nof inference, the most promising candidate being abduction, or\ninference to the best explanation (Russell 1912, BonJour 2003).\nAccording to this view, the best explanation of our experiences is the\ncommonsense hypothesis that there is a mind-independent external world\nthat conforms in some measure to these experiences and is the cause of\nthem. The superiority of this explanation to the alternatives\n(idealism, a Cartesian demon, etc.) is held to be an a priori\nmatter, thus not dependent on assuming the veridicality of the very\nexperiences the argument is supposed to legitimate. There is a good\ndeal of intuitive plausibility to the claim that an external world\nserves as the best explanation for our sense experience, but making\nthat case in any detail, especially enough to satisfy the idealist,\nwould require taking on some large and complex issues, like what makes\none explanation better than another (see the entry on\n abduction),\n and—since the commonsense view is sometimes (e.g., Russell\n1912, BonJour 2010) held to be simpler than\ncompetitors—what counts as simplicity, a vexed question in the\nphilosophy of science (see the entry on\n simplicity).\n William Alston (1993) offers an influential critique of abductive\narguments for the reliability of sense-experience.\n\nFurthermore, if we are trying to explain how the ordinary\nperson’s perceptual beliefs are justified, then it is not enough\nthat there be some good deductive or abductive argument for\nthe reliability of perception; this argument must be in some important\nsense available to or possessed by the agent. Premise\n (2)\n of PEW, after all, is the claim that the agent must have\nsome good reason for thinking their experiences are veridical. Some\n(e.g., Pollock & Cruz 1999) think this imposes a significantly\nmore onerous burden on the proponent of classical foundationalism,\nalthough others (e.g., BonJour 2010) claim that the superiority of the\ncommonsense view is quite accessible to ordinary epistemic agents.\n3.1.2 Fundamental Epistemic Principles\n\nOther traditional foundationalists have responded to PEW by denying\nthe Metaevidential Principle, rather than the No-Good-Reason Claim.\nMost such views have rejected both parts of the standard argument for\nthe Metaevidential Principle\n (3.1.1\n above), but one important exception is worth noting. Chisholm (1966,\n1977) agrees with the classical foundationalist that perceptual\nbeliefs are based on appearance beliefs but denies that any argument\nfor the legitimacy of the appearance-reality inference is needed.\nChisholm posits as a fundamental epistemic principle that if one is\njustified in believing herself to be perceptually appeared to as if\np, then one is prima facie justified in believing\nthat p. The significance of insisting that this principle is\nfundamental is to insist on the legitimacy of the move from\np-appearance to p-reality while denying that that\nlegitimacy is derived from deduction or abduction. This move is\nsimilar to one taken by the antireductionist in the epistemology of\ntestimony (see the entry on\n epistemological problems of testimony).\n\nTo the classical foundationalist, this move seems illicitly ad\nhoc. Admittedly, it gives the answer we desire—that\nperceptual beliefs are justified—but it doesn’t explain\nhow this can be so or give us any reason to think it is true (Fumerton\n1995). The objection holds that the postulation of fundamental\nepistemic principles licensing the inferences we like, despite our\ninability to provide an argument for the legitimacy of such\ninferences, has, to borrow Bertrand Russell’s apt phrase, all\nthe advantages of theft over honest toil.\n3.1.3 Coherentism\n\nThe coherentist, like the classical foundationalist, endorses the\nMetaevidential Principle but holds that we can indeed have good\narguments for the reliability of perception. Coherentism is the view\nthat at least some justification comes from mutual support among\notherwise unsupported beliefs instead of tracing back to basic\nbeliefs. As such, coherentists are sometimes said to endorse certain\nkinds of circular (they prefer to call them holistic) argument, but a\ncoherentist will reject the No-Good-Reason Claim by insisting that\nthere is nothing viciously circular about our arguments for the\nreliability of perception (BonJour 1985, Lehrer 1990). Because it\nallows mutual support, coherentism can tolerate empirical\narguments for the reliability of perception, in principle, allowing\nappeals to track records, evolution, and other scientific\nevidence.\n\nCoherentism has traditionally been propounded as a doxastic theory:\none that holds that only beliefs can serve as evidence. This is in\npart because one of the major motivations for coherentism derives from\nan argument due to Wilfrid Sellars (1956), Donald Davidson (1986) and\nLaurence BonJour (1980) that purports to show that nondoxastic states\n(e.g., experiences) cannot play an evidential role (about which, more\nbelow, in\n section 3.1.5).\n Indeed, on this sort of view, experiences play no epistemic\nrole at all (though maybe a causal, psychological role), either\nevidential or otherwise. This doxasticism is the source of one of the\nmost notorious problems for coherentism, however, for the internal\ncoherence of a belief system could result from the ingenuity of the\nbeliever, rather than from its fit with reality. A detailed enough and\ncleverly constructed fairy tale could be highly internally coherent,\nbut surely I am not justified in believing the fairy tale, in my\ncurrent situation and environment. This is the famous isolation\nobjection to coherentism: a belief system could be isolated from\nthe world and yet be fully coherent. Since those beliefs would not be\njustified, coherence is not sufficient for justification.\n\nThe brunt of the isolation objection is that (doxastic) coherentism is\nunable to do justice to perception, for it does not require any\ngenuinely perceptual contact with the world. But without perception,\nthe whole of one’s beliefs is just another plausible story, not\nthe one true description of things. (Even with perception, there is\nunlikely to be a single best belief set, but the number of\nequally good contenders will be vastly reduced.) For some time,\nBonJour (1985) thought that the problem could be solved with more\nbeliefs; he required a candidate belief system to include a number of\nbeliefs attributing reliability to beliefs that seem to be\ninvoluntary, noninferential, and directly caused by the outside world.\nBut this solution seemed ad hoc, and it still didn’t\nrequire the belief set to be very highly constrained by perception; at\nbest it constrained the belief set by what the agent believes\nto be perception, and even then, only those putatively perceptual\nbeliefs about which the agent has favorable metabeliefs would need to\nconstrain the rest of the system in any way. This seems to render\nperception epistemically “optional”, in an objectionable\nway.\n\nAlthough BonJour (1997) has consequently abandoned this approach in\nfavor of a form of foundationalism, others have sought to incorporate\nexperiences into a nondoxastic coherentism (Conee 1988, Haack 1993,\nKvanvig 2012, Kvanvig & Riggs 1992). If experiences are among the\nrelata over which the coherence relation is defined, then a fully\nisolated agent won’t be able to satisfy the coherence\nrequirement, and the isolation objection may be averted.\n\nIt is unclear whether such a move genuinely rescues coherentism or\nsimply replaces it with a version of foundationalism. If consonance\nwith experience can increase the credibility of a belief, then it\nbegins to look as if that belief satisfies at least some\n(“weak”) foundationalist definitions of an\nepistemologically basic belief. Instead, the nondoxastic coherentist\nmight insist that experiences justify perceptual beliefs, but only in\nthe presence of the right background beliefs about which experiences\nreliably indicate which distal states of affairs, where these\nbackground beliefs are themselves justified in a coherentist manner\n(Gupta 2006). This view seems to be securely coherentist, though it\nthreatens to render coherence with experience optional in just the way\nBonJour’s older view did. The crucial question here is whether\nexperiences—alone, and in and of themselves—affect the\ncoherence of a belief system, or whether they do so only in the\npresence of the relevant metabeliefs. If the former, then\n“nondoxastic coherentism” may not be significantly\ndifferent from some form of foundationalism. If the latter, then an\nagent lacking the requisite metabeliefs might satisfy the coherence\nrequirements quite well but have a belief system that clashes with\ntheir experience, and the nondoxastic coherentist would have to hold\nthat the agent is none the worse, epistemically, for that fact.\n\nThe very spirit of coherentism seems to dictate that perception yields\njustification only because and insofar as the perceiver has\nmetabeliefs that favor perception, while it is central to the\nfoundationalist theory of perception that perceptual experience\nimposes epistemic constraints on us, whether we believe it or not.\n3.1.4 Seemings Internalism\n\nThe epistemological views considered so far can all be considered\negoistic theories, for they hold that justification for\nbeliefs about external objects depends in part on justification for\nbeliefs about oneself—about one’s current mental states,\nabout the connections between one’s experiences or putatively\nperceptual beliefs and certain distal states of affairs, rendering\nperceptual beliefs nonbasic. Modest foundationalism is a\nnonegoistic version of foundationalism, one that allows some beliefs\nabout external objects and their properties—particularly,\nperceptual beliefs—to be epistemologically basic. (Both types of\nfoundationalism also countenance other basic beliefs, e.g., beliefs\nabout simple arithmetical truths.) Modest foundationalism thus denies\nthe Metaevidential Principle; perceptual beliefs are not based on\nother beliefs and thus not based on appearance beliefs, and if they\nare based on something other than beliefs (namely, experiences) the\nagent need not have a justified belief about the reliability of this\nconnection.\n\nSome proponents of modest foundationalism go a step further and offer\na derivative denial of the No-Good-Reason Claim: since we already have\njustified beliefs about our surroundings, and introspective knowledge\nof the deliverances of perception, we can construct non-circular\narguments for the reliability of perception. Indeed, if I can have\nfirst-order knowledge about the world around me without first having\nmetaevidence about the reliability of perception, I should be able to\naccumulate empirical evidence for thinking that I am not a brain in a\nvat, that I am not dreaming, etc., without begging the question.\nWhether this should count as a virtue or a vice of the theory is a\nmatter of debate. Proponents of a “Moorean” response to\nskepticism (see the entries on\n skepticism\n and\n epistemic closure)\n will see this as a selling point for modest foundationalism (Pryor\n2000). Others (Vogel 2000, 2008; Cohen 2002) have interpreted this\nresult as revealing a fundamental flaw of the theory: it makes\njustification and knowledge “too easy”. It is as if I used\nan untested speedometer to form beliefs both about my speed and what\nthe meter indicated my speed to be, then used a number of such belief\npairs to inductively argue for the reliability of the speedometer.\n\nModest foundationalism endorses epistemological directness\n (section 2.1.5\n above) and could be considered a kind of epistemological direct\nrealism, for it makes the world and its elements “directly\npresent” to the mind in a fairly clear, epistemological sense:\nperceptual justification is not dependent on any other justification;\nno other beliefs are interposed between us and the world (in fact,\nJohn Pollock’s term for his [1971, 1986] modest foundationalism\nis “direct realism”; cf. Pollock & Cruz 1999). Modest\nfoundationalism is compatible with any metaphysical view about the\nnature of perception. Even a sense-datum theorist could embrace this\nepistemological direct realism, provided they held that the inference\nfrom sense-data to external objects was a kind of (perhaps unconscious\nor subpersonal) inference that does not impose evidential requirements\non the conclusion belief.\n\nModest foundationalism is usually associated with the internalist,\nstrongly evidentialist versions of the theory, of the sort initially\ndeveloped by Pollock (1971) and Anthony Quinton (1973), though given\nrenewed visibility in recent decades by James Pryor (2000), Michael\nHuemer (2001) and others. These views hold that perceptual beliefs\nabout external objects, events, and properties are directly justified\nby the corresponding perceptual experiences; it is the experiences\nthemselves, rather than beliefs about the experiences, that do the\njustificatory work. Thus, Huemer’s (2007) “phenomenal\nconservatism”, Pryor’s (2000) “dogmatism”, and\nPollock’s (1971, 1974, 1986) “direct realism” all\nendorse something like the following principle:\n\n\nIf S has a perceptual experience as of p, then\nS is prima facie justified in believing that\np.\n\n\nAlternatively:\n\n\nIf it perceptually seems to S that p, then\nS is prima facie justified in believing that\np.\n\n\nThat is, S is prima facie justified whether or\nnot perception is reliable for S and whether or not\nS has any evidence in favor of the claim that perception is\nreliable. Perceptual beliefs are justified by the experience alone, in\nvirtue of some intrinsic feature of that experience (its content, or\nphenomenal character, or assertive force, some combination of these,\netc.). Of course, because the justification here is only prima\nfacie justification, this justification could be defeated if,\nsay, S has good enough reason to think that perception is\nunreliable, or has independent evidence that p is false.\n\nTo have a neutral term, this view will be called “seemings\ninternalism”, for it holds that perceptual beliefs are\nbased on “seemings”, i.e., appearance states, i.e.,\nexperiences. (There is no fixed, established terminology here.)\nSeemings internalism is attractive on the grounds that it offers\nintuitively correct, nonskeptical verdicts about ordinary perceptual\nbelief and does so, according to some proponents, in a way that is\nless intellectually demanding than other internalist views, thus more\nlikely to get the result that animals and small children have\nperceptual knowledge, even though they’re not sophisticated\nenough to have beliefs about appearances.\n\nSusanna Schellenberg’s (2013, 2018) view is best classified as a\nform of seemings internalism, but only about one aspect or dimension\nof justification. On her view, any time it perceptually seems to you\nthat p, you have “phenomenal evidence” for\np. Full justification of the sort required for knowledge\nrequires another kind of justification in addition to phenomenal\nevidence (as we’ll see in section 3.3). She has a complex\nexternalist theory about what constitutes it seeming to you that p,\nbut there is no conflict between a seemings internalist epistemology\nand the various kinds of semantic externalism (see entry on\n externalism about the mind).\n\nMost seemings internalists are fairly liberal about the contents of\nthe seemings and thus about which perception-based beliefs are\ndirectly justified. Others, notably Elijah Chudnof (2018) and Matthew\nMcGrath (2013, 2018), are more conservative. Is my belief that\nthere’s a dog in front of me basic, or does its justification\ndepend on the justification of more elemental beliefs: that\nthere’s a medium sized, 3-dimensional object of such-and-such a\nshape and a furry texture, etc.? Is my belief that that’s Django\non the floor in front of me basic, or does it depend on the belief\nthat there’s a black and tan dog of a certain description, that\nDjango is a black and tan dog who fits that description, etc.?\nLiberals will take the former options, while conservatives will go\nwith something like the latter. Seemings internalism requires\nexperiential states whose contents match the contents of the basic\nbeliefs, so a liberal view about direct justification requires a\nliberal view about the contents of perceptual experience (see the\nentry on the\n contents of perception).\n Chudnoff (2018) combines a liberal theory about the contents of\nperception with a conservative view about basic beliefs by endorsing a\nrestricted kind of seemings internalism: not all perceptual\nexperiences provide prima facie justification, only the ones\nwith “presentational phenomenology”, which not all\nperceptual experiences do have.\n3.1.5 The Sellarsian Dilemma and Other Challenges\n\nPerhaps the most important problem for internalist, evidentialist\nviews concerns the relevant understanding of seemings, or perceptual\nexperience. It is clear that seemings must be non-belief states of\nsome sort, as their epistemological role is to confer justification on\nbasic beliefs, and the latter wouldn’t be basic if seemings were\nthemselves beliefs. The “Sellarsian dilemma” is a famous\nargument, in some ways due as much to BonJour (1978, 1985) as to\nSellars (1956), which claims that “experience” and\n“seemings” and the like are ambiguous in a way that\nundermines the epistemological role that a strongly evidentialist\nfoundationalism requires of experiences. That role, of course, is to\nprovide justification for beliefs without being themselves in need of\nit. Sellars (1956) starts with the justification of appearance\nbeliefs. He argues that there is a kind of noncognitive awareness of\nsensations that does not involve learning or the application of\nconcepts; this kind of awareness accompanies all conscious sensations,\nbut this kind of awareness does not account for the justification of\nour appearance beliefs, for one might well have this kind of awareness\nwithout having any idea what kind of experiences one is having (or any\nidea that there are such things as experiences). There is another kind\nof awareness of our sensations that does involve the application of\nconcepts and does entail knowledge and justification. But this\nawareness just is one’s knowledge of one’s\nexperiences (i.e., one’s justified, true, unGettiered appearance\nbelief). But that kind of awareness cannot then serve as a nondoxastic\nfoundation that confers justification on beliefs without being itself\nin need of justification (see Lyons 2016).\n\nThis argument--Sellars’s original argument--is aimed at a kind\nof classical foundationalism, but a modified version has more general\nambitions. Sellars himself (1956) thought that there are two elements\nto perception: a bare sensation, which is an inner event with\nqualitative character but no representational content; and a\nperceptual belief (or belief-like state, in cases where the agent does\nnot accept appearances at face value; see Reid 1764, 1785 for a\nsimilar view). Recent formulations of the Sellarsian dilemma have\nfocused on this mismatch in content between experience and perceptual\nbelief, and have modified the argument to include an attack on modest\nfoundationalism. There are several variants of the argument; what\nfollows is an amalgamated version.\n\nLet us say that a state is “cognitive” just\nin case it has conceptual and propositional content, and assertive\nforce; it is “noncognitive”\n otherwise.[3]\nIf an experience is noncognitive, then it cannot justify\na perceptual belief.\nIf an experience is cognitive, then it cannot justify\nany beliefs unless it is itself justified.\nTherefore, in neither case can an experience confer\njustification without being itself justified.\n\n\nIn defense of\n (2),\n experiences have frequently been construed as lacking\nrepresentational contents altogether (Sellars 1956, Martin 2002,\nBrewer 2011), or as having nonconceptual contents (Heck 2000, Peacocke\n2001).[4]\n An influential argument (e.g., McDowell 1994, Brewer 1999) holds that\nwithout conceptual content, an experience would have to stand outside\nthe “logical space of reasons” and thus cannot justify a\nbelief. This line is perhaps most plausible if the relevant mode of\njustification is assumed to be a specifically evidential one\n(see\n section 3.1.1\n above). To serve as evidence, the experience would need to stand in\nlogical or probabilistic relations to beliefs, and without\n(conceptual) contents, it is unclear how it could stand in evidential\nrelations to beliefs, or which beliefs it would serve as evidence for\n(McDowell 1994). A common response is that as long as experiences have\ncontents of any sort, they can have truth conditions and thus stand in\nentailment and probabilistic relations to beliefs (Heck 2000, Byrne\n2005). One way to follow through on the original argument for\n (2)\n is to emphasize the kind of content necessary for evidence\nappreciable as such by the perceiver. If experiences are\nnonconceptual, then it seems that I could have a nonconceptual\nexperience of a cat without being in any position to appreciate the\nfact that the experience is of a cat. In such a case, I could\nfail to have any justification for believing that there is cat in\nfront of me. So nonconceptual experiences cannot, by themselves,\njustify perceptual beliefs (Lyons 2016). Such an argument requires the\ncontroversial assumption that an agent must “appreciate”\ne’s evidential significance vis-à-vis\nh, in order for e to supply that agent with evidence\nfor h. Some (e.g., Alston 1988) have explicitly rejected this\nassumption, although some forms of access internalism require it.\n\nAs for the other horn of the dilemma, premise\n (3),\n one can argue that so-called “experiences” that have\nassertive force and the same contents as beliefs are, if not\nthemselves beliefs, at least sufficiently belief-like that\nthey are susceptible to epistemic evaluation in much the way that\nbeliefs are; if so and if only the “justified” ones can\nconfer justification on beliefs, then these experiences will not have\nfilled the role foundationalism had carved out for them (Sellars 1956,\nBonJour 1978, Sosa 2007).\n\nIn recent years, several authors (Lyons 2005, 2009; Bengson, Grube,\n& Korman 2011; Brogaard 2013) have argued that what we think of as\nperceptual experiences is actually a composite of two (or more)\ndistinct elements, what Chris Tucker (2010) calls the\n“sensation” (an imagistic state, rich in perceptual\nphenomenology) and a “seeming” (here construed as a purely\nrepresentational state, applying conceptual categories to things in\nthe world). Seemings understood in this way are still non-belief\nstates: in cases of known perceptual illusion, it might seem to me\nthat p, even though I don’t believe that p.\nSomething like the above Sellarsian dilemma can be run with this\ndistinction in hand: sensations without seemings are insufficient to\njustify beliefs; and seemings without sensations would be subjectively\ntoo similar to mere hunches to justify beliefs (Lyons 2009). The\nseemings internalist can reply by arguing that seemings alone, even\nconstrued as just one component of perceptual experience, can indeed\njustify beliefs (Tucker 2010), or by rejecting this composite view,\ninsisting that a seeming is a single, unified state, whose perceptual\nphenomenology and conceptual content are inextricably linked (Chudnoff\n& Didomenico 2015).\n\nSeemings internalism as formulated above claims that the content of\nthe experience is the same as the content of the belief, thus\nrejecting premise\n (3)\n of the Sellarsian argument. There may be variations close enough to\nstill count as seemings internalism that deny\n (2)\n instead, allowing experiences with nonconceptual contents to justify\nbeliefs. The standard schema would have to be modified:\n\n\nIf S has a perceptual experience as of p*, then\nS is prima facie justified in believing that\np.\n\n\nOne would, of course, want to say more about the relation between\np and p*. Although his concern is not with\nnonconceptual content, Nico Silins (2011) defends a view much like\nseemings internalism, where the experiences are not required to have\nthe same contents as the beliefs.\n\nA second problem is that of alien sense modalities (Bergmann 2006).\nThere are possible creatures with sense modalities and experiences\nthat are foreign to us: echolocation, electroreception, etc., and\npresumably these creatures can be justified in their alien perceptual\nbeliefs. If metaevidential beliefs are not necessary for perceptual\njustification, then these same experiences ought to justify\nus in those same beliefs. Intuitively, however, a sudden\nelectroreceptive experience would not justify me in believing there\nwas a medium sized animal about three feet behind me. In fact, a\nfamous objection to a different (reliabilist) theory seems to apply\nequally well to seemings internalism. Norman (BonJour 1980) has no\nreason for thinking that he has reliable clairvoyant powers, but one\nday he has a clairvoyant experience as of the president being in New\nYork; intuitively, he is not prima facie justified in\nbelieving that the president is in New York, yet seemings internalism\nseems to imply that he is. The clairvoyance objection is normally\npressed against reliabilist theories, not on the basis of the\nreliability component, but rather on the basis of their rejection of\nthe Metaevidential Principle, a rejection that is shared by seemings\ninternalism. One might reply that Norman’s experience is not\nexactly perceptual; perhaps this might offer a way out, especially if\none could explain why it isn’t perceptual and why that should\nmake a difference. Some versions of seemings internalism restrict\ntheir claims to perception (Pryor 2000), although some (Huemer 2007)\napply to seemings much more generally.\n\nAnother potential problem is that seemings internalism is insensitive\nto the etiology of the experience, although it intuitively seems that\nthis should matter. If the only reason Jack looks angry to Jill is\nthat she has an irrational fear that he would be angry, then her\nperceptual experience as of angry-Jack should not carry its usual\nevidential weight (Siegel 2011). This problem is sometimes framed in\nterms of the “cognitive penetration of perception”, a\ncontroversial empirical issue in the philosophy of perception. In\ngeneral, experiences that result from wishful thinking, fear, and\nvarious irrational processes should not have the same evidential\nimport as do experiences with a more respectable etiology (Markie\n2005, Siegel 2013). But seemings internalism makes the experience\nitself sufficient for (prima facie) justification and thus\nleaves no role for etiology to play. One response to these sorts of\ncases is that if it genuinely looks to Jill as if Jack is angry, then\nthe only appropriate thing for Jill to do is believe that he is angry\n(Huemer 2013). This is compatible with there still being something\nelse epistemically lacking in Jill; e.g., she presumably doesn’t\nknow that Jack is angry (even if he is). Chris Tucker (2014) argues\nthat cognitive penetration problems are a worry for everyone, not just\nfor seemings internalists.\n\nThis last concern in particular calls into question a phenomenal\ndetermination principle, assumed by all the epistemological views\ncanvassed so far, which holds that the phenomenal character of an\nexperience completely determines which beliefs that experience\ndirectly justifies: two agents cannot be alike with respect to their\nphenomenology and yet differ in which beliefs are directly (prima\nfacie) justified for them. The phenomenal determination principle\nhas some intuitive plausibility, but so does its denial. Cognitive\npenetration cases (Markie 2005, Siegel 2011) purport to offer cases\nwhere two agents have the same phenomenal states but different direct\njustification, and certain responses to the new evil demon objection\nto reliabilism (Lyons 2012) try to undermine intuitive support for the\nphenomenal determination principle.\n\nA different worry concerns the basing relation. Doxastic evidential\njustification is generally thought to require that the belief be based\non the justifying evidence, where basing is some kind of psychological\nrelation (which psychological relation is a matter of some\ncontroversy--see the entry on\n the epistemic basing relation).\n This makes it a partly empirical question whether we typically or\never actually do base perceptual beliefs on experiences. Although it\nseems intuitively plausible that we do, Jack Lyons (2020) argues that\nthe empirical facts about the contents of perceptual experiences and\nabout the time course of conscious experience and perceptual\ncategorization render this claim unlikely.\n\nA final worry for seemings internalism is one that we encountered\nabove in\n section 3.1.2\n in connection with a different view: the proposal seems to be an\nad hoc attempt to get the desired nonskeptical answer without\nfurther justification for the principle. What is it about seemings,\nafter all, that makes them able to generate justification? The desire\nthat p has propositional content but doesn’t justify\nthe belief that p; the unjustified belief that q has\nassertoric force but doesn’t justify the belief that q\n(Lyons 2008, Ghijsen 2014); imaginings can have phenomenal force but\ndon’t justify beliefs (Teng 2018), and so on. Chudnoff 2018,\n2021 holds that some seemings have a particular phenomenal character\n(“presentational phenomenology”), namely that of seeming\nto put us in direct contact with an extramental reality. But he holds\nthat only some seemings have this phenomenology, and it’s only\nthese that confer direct justification, so this view won’t give\nmost seemings internalists all they want. Pollock’s (1986)\nepistemological theory of concepts addresses this worry by claiming\nthat it is part of the concept of, e.g., red that a certain\nperceptual experience (or seeming) is a prima facie reason\nfor the belief that x is red. Most recent proponents of\nseemings internalism have not embraced this part of Pollock’s\nview.\n3.1.6 Seemings Externalism\n\nSome of the problems facing internalist evidentialist theories are at\nleast ostensibly solved by going externalist. A view we might call\n“seemings externalism” holds along with seemings\ninternalism that perceptual beliefs are justified when based on a\nfitting experience but is externalist about the fittingness relation,\nallowing that what makes for fittingness need not be accessible by\nreflection nor need supervene on the nonfactive mental states of the\nbeliever. This sort of view is premised on the rejection of the\nphenomenal determination principle articulated above. Assuming that\nexperiences are necessarily conscious and that conscious states are\nnecessarily accessible, seemings externalism nevertheless imposes an\ninternalist constraint on perceptual justification: one component of\njustification must be an accessible mental state of the agent. But the\nrest of the justificatory story is thoroughgoingly externalist. To\ndate, this sort of view has been developed in two ways, one\nreliabilist and one functionalist.\n\nAn example of the first approach is Alston’s (1988) internalist\nexternalism. He requires that every justified belief have some ground,\nor evidence, and that this ground be accessible; that is the\ninternalist element. He claims, however, that what makes a ground\n(good) evidence for some belief is that the ground reliably indicates\nthe truth of that belief, and this fact is one that need not be\naccessible to the agent; this is the externalist element. (See\nComesaña 2010 for a similar view.) Although Alvin Goldman is\nbest known for the reliabilist (etiological) theory to be addressed in\nsection 3.2, he also (2011) has developed a reliabilist/evidentialist\n“synthesis”, where experiential evidence plays a central\nrole in perception. (He does not, however, require that all justified\nperceptual beliefs be based on some experience.) He offers a\ntwo-factor reliabilist proposal for understanding evidence, which\ncombines process and indicator reliabilism (see entry on\n reliabilist epistemology);\n for e to be evidence for h (i) e must be\namong the inputs to a reliable process that outputs h, and\n(ii) there must be an objective fittingness relation between\ne and h, that is, e must reliably indicate\nthe truth of h, in the sense of making h objectively\nlikely to be true. Both components, (i) and (ii), are externalist in\nboth the mentalist and accessibilist senses.\n\nThe second approach says that an experience fits the belief that\np if it’s the function—in a biological or\nteleological sense—of the state to indicate p\n(Plantinga 1993, Bergmann 2006, 2013). On this view, there need not be\nany necessary or intrinsic connection between a certain kind of\nexperience and the belief it justifies, and the belief need not even\ntend to be true whenever the experience is undergone; all that’s\nrequired is that this belief be the proper response to the\nexperience, in the sense that a properly functioning agent (or an\nagent whose perceptual/doxastic system is functioning properly) will\nform that belief in response to that experience.\n\nObjections to these views are typically just specific applications of\nobjections to the relevant externalism: reliabilist and teleological\ntheories more generally. For instance, clairvoyance objections\n(BonJour 1980) aim to show that reliability is not sufficient for\nprima facie justification, and new evil demon arguments\n(Lehrer & Cohen 1983, Cohen 1984) insist that reliability is not\nnecessary (see the entry on\n reliabilist epistemology).\n One way to run the new evil demon argument is to image an\nexperiential state that seamlessly transitions from reliably\nindicating p to not reliably indicating p; intuitively the agent\nremains justified throughout and should not change their mind or\nsuspend belief halfway through (Smithies 2019, Pautz 2020).\nFunctionalists might have resources here that reliabilists do not,\nunless these arguments are sufficient to establish a general\ninternalism. However, they face the additional problem of the Swampman\n(Davidson 1987, Sosa 1993), who is a randomly occurring (therefore,\nlacking in any biological functions) molecular duplicate of a normal\nperson; intuitively he seems to have justified perceptual beliefs,\nalthough this cannot be accounted for in terms of function, at least\non some views about functions. Perhaps, however, Swampman can fairly\nquickly acquire some functions as the result of interactions with his\nenvironment (Graham 2019) and thereby have justification fairly soon\nafter his appearance, even if not immediately.\n3.2 Etiological Approaches\n\nIf experiences have justificatory power only when reliability or\nproper function are added into the mix, one might wonder if it’s\nbetter to just omit any reference to experience and instead simply\nanalyze perceptual justification directly in terms of reliability or\nproper function. Indeed, these make up two prominent etiological\napproaches to perceptual justification and knowledge. A third\netiological approach is an inferentialist one. All three reject the\nMetaevidential Principle and access internalism.\n\nGoldman (1979, 1986) argues that justification results from the\noperation or exercise of a cognitive process whose operation is\nobjectively likely to yield true beliefs; the process must really be\nreliable in this sense, but the agent need not be aware of that\nfact.[5]\n (To be ultima facie justified the agent must not have reasons to\nthink the process unreliable.)\n\nA reliabilist theory of perceptual justification falls out from a\nreliabilist theory of justification in general, the simplest version\nof which is one that holds\n\n(SR): a belief is prima facie justified iff it is the result\nof a reliable cognitive process.\n\nBy claiming that reliability is sufficient for perceptual\njustification, the theory allows for justification in the absence of\nexperiences or anything else that the agent might use as evidence for\nthe belief. It allows that blindsighters and zombies could have\nperceptual justification. (Blindsight is a real phenomenon where\npatients with damage to early visual cortex are capable of forming\nreliable perceptual judgments in the absence of perceptual\nexperiences; philosophical depictions of blindsight tend to be\nsomewhat fictionalized. Zombies in philosophical parlance are\ncreatures otherwise just like us but lacking conscious experiences\naltogether.) It is nonevidentialist in the further sense that even\nwhere some link in the causal chain happens to count as an evidential\nstate for the cognizer (i.e., one on which they might base a belief),\nthat state’s status as evidence is irrelevant to its epistemic\nrole, so long as it still makes the same contribution to the\nreliability of the overall process.\n\nA different kind of broadly reliabilist theory emphasizes skills or\ncompetences, rather than cognitive processes (Sosa 1991, 2007, 2021).\nSkills will likely be individuated in different ways than cognitive\nprocesses, and reliability might be assessed differently for different\nskills (as one does with performances more generally: a skillful\ndriver must almost never wreck the car, while a skillful batter might\nstrike out more than half the time). Nevertheless, the view is still\nreliabilist in that skill is a matter of having a high enough\npropensity to believe truly. Ernest Sosa’s influential\ndevelopment of this view distinguishes “animal\nknowledge”—a belief is true because competently\nformed—from “reflective knowledge”—where the\nsubject has true-because-competently-formed belief that a lower order\nbelief is true because competently formed. Concepts of animal and\nreflective justification are easily derived from these. Although Sosa\ndenies the Metaevidential Principle for animal\nknowledge/justification, he embraces it for reflective\nknowledge/justification.\n\nOne reliabilist theory that aims at perceptual justification in\nparticular holds that it is not merely reliability that gives\nperception its epistemic force but also the fact that perceptual\nbeliefs have a distinctive psychological provenance. In particular,\nthey are the outputs of (weakly) “modular” perceptual\nprocesses (where what counts as a perceptual module is spelled out in\narchitectural terms, rather than in terms of phenomenology or the\nagent’s background beliefs; Lyons 2009). This\n“inferentialist reliabilist” theory (so-called not because\nof its treatment of perception but because of its treatment of some\nnonperceptual belief) claims that reliability is only sufficient for\nthe (prima facie) justification of the outputs of modular\nprocesses, but that the reliabilist can and should impose inferential\nrequirements (understood in reliabilist ways) on other beliefs. Though\nthe view is designed as a version of reliabilism, a mentalist\ninternalist could accept the modularity part and drop the reliability\npart, claiming that the outputs of perceptual modules are thereby\nprima facie justified whenever held, irrespective of either\nexperience or reliability.\n\nIn addition to or instead of reliability, one could endorse a\nfunctionalist view about the justification of perceptual beliefs.\nTyler Burge (2003, 2020) and Peter Graham (2012, 2019) are the most\nprominent proponents of this sort of view in its non-evidentialist\nmode. Both hold that the belief-forming process need not be reliable,\nbut it must have the (teleological) function of producing\nreliably true beliefs. This requires that the process be (/have been)\nreliable in normal conditions—i.e., the conditions where\nproducing a particular result led to the establishment of that result\nas the function. For Burge, however, the functions derive from the\nfact that percepts and beliefs are representational states, and\nit’s an a priori condition on any representational state that it\nhas the function of representing correctly; thus the view is that\nperceptual justification (he calls it “entitlement”)\nrequires that the perceptual process and its elements be reliable in\nthose conditions in which the contents of those elements was fixed.\nFor Graham, the functions result from the empirical fact that the\nprocesses have done the organism (or its ancestors) some practical,\nbiological good.\n\nThese views are fully externalist, but there is a kind of etiological\nview that is compatible with mentalism. An\n“inferentialist” theory holds that perception involves an\ninferential or quasi-inferential process and that perceptual beliefs\nare justified or not, according as the inferential moves pass muster\nvis-a-vis whatever the ordinary standards are for inference more\ngenerally. The inference to be evaluated can be unconscious and of the\nHelmholtzian sort that perceptual psychologists talk about (Siegel\n2013, 2017), or it can be a move from conscious, person-level\ncontents, like low-level sensory contents, to high level perceptual\ncategorization beliefs (e.g., ‘there’s a cat’)\n(Markie 2006, 2013; McGrath 2013, 2018). The latter option ends up\nbeing a version of the evidentialist theories discussed above (usually\na conservative kind of modest foundationalism) and won’t get\nrepeated treatment here; but the former is a distinctive theory of\nperceptual justification. Susanna Siegel takes her inferentialism so\nfar as to claim that nondoxastic perceptual experiences are themselves\nepistemically evaluable and can be effectively unjustified, if their\netiology is an inferentially bad one. Although the inferentialist can\nmake explicit appeal to experiences, one can also develop an\ninferentialism that assigns no significant role to experience as such\n(Ghijsen 2021), and in any case, the experience is merely one link in\nthe inferential chain on the basis of which the perceptual belief is\nevaluated. (As stated above, the evidential, etiological, and\nworld-involving approaches were not held to be mutually exclusive.)\nOne putative counterexample to Siegel’s inferentialism involves\nan agent who believes for no good reason that the woods around them\nare full of snakes, and this irrational belief affects their\nperceptual experiences in such a way that they are now better at\nspotting snakes that are actually there (Lyons 2011). Intuitively, the\nagent is justified in their perceptual beliefs, despite an irrational\ninferential etiology.\n\nAs with the seeming externalist views, the standard clairvoyance, new\nevil demon, and Swampman objections to reliabilist and functionalist\ntheories are leveled against these theories of perceptual\njustification. Proponents of the phenomenal determination principle\n(section\n 3.1.5\n above) will reject all of these views as incompatible with that\nprinciple (Smithies 2019, Pautz 2020). A closely related issue\nconcerns agents who don’t have any experiences. Because these\ntheories allow perceptual justification in the absence of any\nexperience, they will allow zombies and blindsighters to have\nperceptual justification, so long as their perceptual processes are\nreliable, or functioning normally, or drawing rational unconscious\ninferences, and so on. Intuitions on this matter seem to be divided;\nsome authors think this consequence is a virtue of such views\n(Plantinga 1993, Lyons 2009, Tucker 2010), though others think it is\nclearly a vice (e.g., Smithies 2019, Johnston 2011).\n3.3 World-involving Approaches\n\nThe theories considered so far all consider the justification of a\nparticular belief to be independent of whether the agent is\nveridically perceiving on that occasion, or is hallucinating or being\ndeceived by a Cartesian demon, etc. (although some of these views\nwould allow that widespread and persistent deception reduces\nreliability, and certain kinds of hallucination might involve\na different relevant etiology from normal veridical perception). On a\nworld-involving view, the mere fact that the agent is veridically\nperceiving means that the agent has a kind of justification that no\nhallucinating subject could have. Such a view is sometimes also\nreferred to as “epistemological disjunctivism” (Pritchard\n2012), though some proponents reject this label (Schellenberg 2018).\nOn this sort of view, the agent in the “good” case\n(veridical perception) has the best sort of empirical evidence one\ncould hope for: the world itself is made manifest through perception;\nthe agent in the “bad” case (hallucination) has either no\njustification at all (Byrne 2014, 2016) or a different and presumably\ninferior kind of justification (Williamson 2000, Millar 2011, 2019,\nSchellenberg 2013, 2018).\n\nCommon to the various forms of epistemological disjunctivism is the\nidea that, normally, when you see a barn, you thereby know that\nthere’s a barn in front of you. This can be understood in two\nvery different ways. On the “evidential” construal, the\nrelevant seeing is a non-doxastic, non-epistemic factive experiential\nstate, on which your belief that there’s a barn is based. This\nstate can be understood along the lines of metaphysical disjunctivism\n (section 2.1.4,\n 2.3.3 above), as a world-involving relation of a subject to a\nperceptual object; or it can be understood as an internal (e.g.,\nrepresentational) state that has a different epistemic potency when\nit’s veridical. On the “constitutive” construal,\nyour seeing that there’s a barn just is your knowing that\nthere’s a barn, since seeing that p is a determinate of the\ndeterminable, knowing that p. The first kind of seeing is consistent\nwith the agent being in fake barn country (see entry on\n epistemology),\n or having good reasons to believe they’re being deceived, or\nsuspending belief about whether there’s a barn; the second kind\nof seeing—assuming that defeaters and environmental luck block\nknowledge, and that knowledge requires belief—is not.\n\nThe pioneer of this general approach is John McDowell (1982), although\nit is difficult to know just what view he endorses. There are hints of\nmetaphysical disjunctivism and an evidential construal of seeing,\nespecially in earlier writings, although he has long insisted that one\ndoes not see that there’s a barn in fake barn country. One\npossibility is that McDowell’s talk about seeing is simply a\nparticular kind of “conclusive reason” (in the sense of\nDretske 1971) (Graham and Pederson 2020).\n\nOne key motivation for a world-involving approach is the idea that if\nthe warrant (/evidence/justification) that we have in the good case is\nno different from the warrant we have in the bad case, then it must be\nin itself neutral between these possibilities and thus can’t\njustify, say, the belief that there’s a real table there, rather\nthan a hallucinated table—at least, not without a hefty\ncontribution from background knowledge (McDowell 1982, 2011, 2018). A\nsecond motivation is the claim that some or all evidence is factive.\nSome epistemologists hold that all evidence is factive, in the sense\nthat only true things can serve as evidence (Williamson 2000,\nLittlejohn 2012, Byrne 2014); this would preclude hallucinations from\nconferring evidence on perceptual beliefs. Schellenberg (2013, 2018)\nargues that successful exercises of perceptual capacities yield a\nspecial, superior, kind of evidence—“factive\nevidence”—which is absent in cases of hallucination,\nthough she thinks hallucinations do provide another kind of evidence\n (section 3.1.4\n above).\n\nDirect world-involvement theories tend to be instances of modest\nfoundationalism\n (section 3.1.4\n above), holding that perceptual knowledge and justification are\ndirect, and therefore denying the Metaevidential Principle, at least\nin a form that holds that the metaevidential knowledge/justification\nis prior to the perceptual knowledge/justification. Some\nproponents also reject the No-Good-Reason Claim, holding that in\nveridical perception, not only is the world manifest to us, but so is\nthat fact (Pritchard 2012, McDowell 2011), even though the good case\nand the bad case are in some sense indistinguishable. This would\nsupport a form of access internalism, though an unusual one and one\nthat some other internalists will find unsatisfactory (Smithies 2013).\nAlthough mentalist internalism is defined in terms of nonfactive\nmental states, McDowell’s defense of epistemological\ndisjunctivism has always been motivated by a kind of internalism, and\nhe thinks that states of seeing, though factive, satisfy whatever\nneeds our internalist intuitions demand. Other versions of the view\nare staunchly externalist (Williamson 2000, Schellenberg 2013).\n\nThe biggest objection to this general approach is that it\ndoesn’t allow or doesn’t illuminate perceptual\njustification in cases of error, at least not in cases of\nhallucination. Those with more conventional internalist intuitions\nwill think that some or all hallucination victims will be just as\njustified as veridical perceivers (even though the former won’t\nbe in a position thereby to know). In fact, the New Evil Demon\nobjection to reliabilism\n (section 3.1.6\n above, entry on\n reliabilist epistemology)\n takes this as an obvious starting point, and many externalists have\ncrafted or modified their theories to accommodate this intuition\n(Goldman 1986, 1988, Graham 2012). Some disjunctivists have tried to\nblunt the impact of this objection by suggesting that there’s\nanother kind of justification or another route to justification\navailable in the bad case. Schellenberg (2013, 2018) allows that\nthere’s a degree or dimension of justification available even in\nthe bad case; and Williamson (2000) suggests that sufficiently\nsophisticated hallucinators have introspective knowledge that things\nlook F, and this affords them inferential justification for thinking\nthat something is F.\n4. Conclusion\n\nThe epistemological problems of perception have traditionally centered\non the threat of skepticism, in particular, on the “veil of\nperception” implicated by a well-known metaphysics of\nperception, which threatens to lead to skepticism. Although much of\nthe history of philosophy has involved attempts to find metaphysical\nsolutions to this problem, recent decades have seen a proliferation of\ndedicatedly epistemological theories, offering more direct responses\nto these concerns. Even if we have a metaphysics in place, we will\nstill need to make difficult decisions about the epistemology. Various\nevidential, etiological, and direct world-involvement theories have\nbeen proposed, including combinations of these. Each of these three\nadmits of internalist as well as externalist variants. The result is\nan active and ongoing area of research in epistemology.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alston, William P., 1988, “An Internalist\nExternalism”, <em>Synthese</em>, 74(3): 265–283.\ndoi:10.1007/BF00869630",
                "–––, 1993, <em>The Reliability of Sense\nPerception</em>, Ithaca: Cornell University Press.",
                "–––, 1999, “Back to the Theory of\nAppearing”, <em>Philosophical Perspectives</em>, 13:\n181–203.",
                "Augustine, <em>Against the Academicians</em> and <em>The\nTeacher</em>, P. King (trans.), Indianapolis, Indiana: Hackett\nPublishing, 1995.",
                "Bengson, John, Enrico Grube, &amp; Daniel Z. Korman, 2011,\n“A New Framework for Conceptualism”, <em>Noûs</em>,\n45(1): 167–189. doi:10.1111/j.1468-0068.2010.00764.x",
                "Bergmann, Michael, 2004, “Externalist Justification without\nReliability”, <em>Philosophical Issues</em>, 14(1): 35–60.\ndoi:10.1111/j.1533-6077.2004.00019.x",
                "–––, 2006, <em>Justification Without Awareness:\nA Defense of Epistemic Externalism</em>, New York: Oxford University\nPress.",
                "–––, 2013, “Externalist Justification and\nthe Role of Seemings”, <em>Philosophical Studies,</em> 166 (1):\n163–184.",
                "Berkeley, George, 1710, <em>A Treatise Concerning the Principles\nof Human Knowledge</em>, reprinted in Berkeley 1975,\n61–127.",
                "–––, 1713, <em>Three Dialogues Between Hylas and\nPhilonous</em>, reprinted in Berkeley 1975, 129–207.",
                "–––, 1975, <em>George Berkeley: Philosophical\nWorks, Including the Works on Vision</em>, M. R. Ayers (ed.), London:\nDent.",
                "BonJour, Laurence, 1978, “Can Empirical Knowledge Have a\nFoundation?” <em>American Philosophical Quarterly</em>, 15(1):\n1–13.",
                "–––, 1980, “Externalist Theories of\nEmpirical Knowledge”, <em>Midwest Studies in Philosophy</em>,\n5(1): 53–73. doi:10.1111/j.1475-4975.1980.tb00396.x",
                "–––, 1985, <em>The Structure of Empirical\nKnowledge</em>, Cambridge: Harvard University Press.",
                "–––, 1997, “Haack on Justification and\nExperience”, <em>Synthese</em>, 112(1): 13–23.\ndoi:10.1023/A:1004972413209",
                "–––, 2003, “A Version of Internalist\nFoundationalism”, in Laurence BonJour &amp; Ernest Sosa,\n<em>Epistemic Justification: Internalism vs. Externalism, Foundations\nvs. Virtues</em>, Malden, MA: Blackwell, 3–96.",
                "–––, 2010, <em>Epistemology: Classic Problems\nand Contemporary Responses</em>, 2<sup>nd</sup> edition, Lanham, MD:\nRowman and Littlefield.",
                "Brewer, Bill, 1999, <em>Perception and Reason</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199250456.001.0001",
                "–––, 2011, <em>Perception and its Objects</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199260256.001.0001",
                "Brogaard, Berit, 2013, “Phenomenal Seemings and Sensible\nDogmatism”, in Chris Tucker (ed.), <em>Seemings and\nJustification: New Essays on Dogmatism and Phenomenal\nConservatism</em>, Oxford: Oxford University Press, 270–289.\ndoi:10.1093/acprof:oso/9780199899494.003.0012",
                "Byrne, Alex, 2005, “Perception and Conceptual\nContent”, in Ernest Sosa &amp; Matthias Steup (eds.),\n<em>Contemporary Debates in Epistemology</em>, Boston: Blackwell,\n231–250.",
                "–––, 2014, “Perception and\nEvidence”, <em>Philosophical Studies</em>, 170:\n101–13.",
                "–––, 2016, “The Epistemic Significance of\nExperience”, <em>Philosophical Studies</em>, 173(4):\n947–67. doi:10.1007/s11098-015-0537-7",
                "Burge, Tyler, 2003, “Perceptual Entitlement”,\n<em>Philosophy and Phenomenological Research</em>, 67(3):\n503–548.",
                "–––, 2020, “Entitlement: The Basis For\nEmpirical Warrant”, in Peter Graham &amp; Nikolaj Pedersen\n(eds.), <em>Epistemic Entitlement</em>, Oxford: Oxford University\nPress.",
                "Chalmers, David J., 2003, “The Content and Epistemology of\nPhenomenal Belief”, in Quentin Smith &amp; Aleksandar Jokic\n(eds.), <em>Consciousness: New Philosophical Perspectives</em>,\nOxford: Oxford University Press, 220–271.",
                "Chisholm, Roderick M., 1957, <em>Perceiving: A Philosophical\nStudy</em>, Ithaca, NY: Cornell University Press.",
                "–––, 1966, <em>Theory of Knowledge</em>,\nEnglewood Cliffs, NJ: Prentice-Hall",
                "–––, 1977, <em>Theory of Knowledge</em>,\n2<sup>nd</sup> edition, Englewood Cliffs, NJ: Prentice-Hall.",
                "Chudnoff, Elijah, 2018, “Epistemic Elitism and Other\nMinds”, <em>Philosophy and Phenomenological Research</em>,\n96(2): 276–298.",
                "–––, 2021, <em>Forming Impressions</em>, Oxford:\nOxford University Press.",
                "Chudnoff Elijah, &amp; David Didomenico, 2015, “The\nEpistemic Unity of Perception”, <em>Pacific Philosophical\nQuarterly</em>, 96(4): 535–549. doi:10.1111/papq.12114",
                "Cohen, Stewart, 1984, “Justification and Truth”,\n<em>Philosophical Studies</em>, 46: 279–295.",
                "–––, 2002, “Basic Knowledge and the\nProblem of Easy Knowledge”, <em style=\"text-indent:-2em\">Philosophy\nand Phenomenological\nResearch</em>, 65(2): 309–329.\ndoi:10.1111/j.1933-1592.2002.tb00204.x",
                "Comesaña, Juan, 2010, “Evidentialist\nReliabilism”, <em>Noûs</em>, 44(4): 571–600.\ndoi:10.1111/j.1468-0068.2010.00748.x",
                "Conee, Earl, 1988, “The Basic Nature of Epistemic\nJustification”, <em>The Monist</em>, 71(3): 389–404.\nReprinted in Conne &amp; Feldman 2004.\ndoi:10.1093/0199253722.003.0003",
                "Conee, Earl &amp; Richard Feldman, 2004, <em>Evidentialism: Essays\nin Epistemology</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199253722.001.0001",
                "Davidson, Donald, 1986, “A Coherence Theory of Truth and\nKnowledge”, in <em>Truth and Interpretation: Perspectives on the\nPhilosophy of Donald Davidson</em>, Ernest Lepore, (ed.), New York:\nBlackwell, 307–319.",
                "–––, 1987, “Knowing One’s Own\nMind”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 61(3): 441–58.\ndoi:10.2307/3131782",
                "Descartes, René, 1641, <em>Meditations on First\nPhilosophy</em>, in <em>The Philosophical Writings of Descartes</em>,\nJohn Cottingham, Robert Stoothoff, and Dugald Murdoch (trans.), vol.\n2, Cambridge: Cambridge University Press, 1985, 1–62.",
                "Dretske, Fred, 1971, “Conclusive Reasons”,\n<em>Australasian Journal of Philosophy</em>, 49: 1–22",
                "Dreyfus, Hubert L., 2002, “Intelligence Without\nRepresentation—Merleau-Ponty’s Critique of Mental\nRepresentation: The Relevance of Phenomenology to Scientific\nExplanation”, <em>Phenomenology and the Cognitive Sciences</em>,\n1(4): 367–383. doi:10.1023/A:1021351606209",
                "Feldman, Richard, 2003, <em>Epistemology</em>, Upper Saddle River,\nNJ: Prentice-Hall.",
                "Foster, John, 2008, <em>A World for Us: The Case for\nPhenomenalistic Idealism</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199297139.001.0001",
                "Fumerton, Richard A., 1995, <em>Metaepistemology and\nSkepticism</em>, Lanham, MD: Rowman and Littlefield.",
                "–––, 2001, “Classical\nFoundationalism”, in M. DePaul (ed.), <em>Resurrecting\nOld-fashioned Foundationalism.</em> Lanham, MD: Rowman and\nLittlefield, 3–20.",
                "Ghijsen, Harmen, 2014, “Phenomenalist Dogmatist\nExperientialism and the Distinctiveness Problem”,\n<em>Synthese</em>, 191(7): 1549–66.",
                "–––, 2021, “Predictive Processing and\nFoundationalism About Perception”, <em>Synthese</em>, 198(7):\n1751–69.",
                "Goldman, Alvin I., 1979, “What Is Justified Belief?”\nin G. Pappas (ed.), <em>Justification and Knowledge</em>, Dordrecht:\nReidel, 1–25.",
                "–––, 1986, <em>Epistemology and Cognition</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1988, “Strong and Weak\nJustification”, <em>Philosophical Perspectives</em>, 2:\n51–69.",
                "–––, 2011, “Commentary on Jack\nLyons’s <em>Perception and Basic Beliefs</em>”,\n<em>Philosophical Studies</em>, 153(3): 457–66.\ndoi:10.1007/s11098-010-9602-4",
                "Graham, Peter J., 2012, “Epistemic Entitlement”,\n<em>Noûs</em>, 46(3): 449–482.\ndoi:10.1111/j.1468-0068.2010.00815.x",
                "–––, 2019, “Why is Warrant\nNormative?”, <em>Philosophical Issues</em>, 29(1):\n110–128.",
                "Graham, Peter J., &amp; Nikolaj J. L. L. Pedersen, 2020,\n“Dretske &amp; McDowell on Perceptual Knowledge, Conclusive\nReasons, and Epistemological Disjunctivism”, <em>Philosophical\nIssues</em>, 30(1): 148–166.",
                "Greco, John, 2000, <em>Putting Skeptics in Their Place</em>,\nCambridge: Cambridge University Press.",
                "Gupta, Anil, 2006, <em>Empiricism and Experience</em>, Oxford:\nOxford University Press.",
                "Haack, Susan, 1993, <em>Evidence and Inquiry: Toward\nReconstruction in Epistemology</em>, Oxford: Blackwell.",
                "Haddock, Adrian &amp; Fiona Macpherson (eds.), 2008,\n<em>Disjunctivism: Perception, Action, Knowledge</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199231546.001.0001",
                "Heck, Richard G. Jr., 2000, “Nonconceptual Content and the\n‘Space of Reasons’”, <em>Philosophical Review</em>,\n109(4): 483–523. doi:10.2307/2693622",
                "Hoffman, Donald D., 2009, “The Interface Theory of\nPerception”, in Sven J. Dickinson, Michael J. Tarr, Aleš\nLeonardis, &amp; Bernt Schiele (eds.) <em>Object Categorization:\nComputer and Human Vision Perspectives</em>, Cambridge, UK: Cambridge\nUniversity Press, 148–165.",
                "Huemer, Michael, 2001, <em>Skepticism and the Veil of\nPerception</em>, Lanham, MD: Rowman and Littlefield.",
                "–––, 2007, “Compassionate Phenomenal\nConservatism”, <em>Philosophy and Phenomenological\nResearch</em>, 74(1): 30–55.\ndoi:10.1111/j.1933-1592.2007.00002.x",
                "–––, 2013, “Epistemological Asymmetries\nBetween Belief and Experience”, <em>Philosophical Studies</em>,\n162(3): 741–748. doi:10.1007/s11098-012-0056-8",
                "Hume, David, 1739, <em>A Treatise of Human Nature</em>, Peter H.\nNidditch (ed.), Oxford: Clarendon Press, 1978.",
                "–––, 1748, <em>Enquiry Concerning Human\nUnderstanding</em>, reprinted in <em>Enquiries Concerning Human\nUnderstanding and Concerning the Principle of Morals</em>, Peter H.\nNidditch (ed.), Oxford: Clarendon Press, 1975.",
                "Johnston, Mark, 2011, “On a Neglected Epistemic\nVirtue”, <em>Philosophical Issues</em>, 21: 165–218.",
                "Kant, Immanuel, 1781, <em>Critique of Pure Reason</em>, Norman\nKemp Smith, (trans.), London: Macmillan; New York: St. Martin’s\nPress, 1929.",
                "Kvanvig, Jonathan L., 2012, “Coherentism”, in Andrew\nCullison (ed.), <em>The Continuum Companion to Epistemology</em>, New\nYork: Continuum Press, 57–72.",
                "Kvanvig, Jonathan L. &amp; Wayne D. Riggs, 1992, “Can a\nCoherence Theory Appeal to Appearance States?” <em>Philosophical\nStudies</em>, 67(3): 197–217. doi:10.1007/BF00354536",
                "Lehrer, Keith, 1990, <em>Theory of Knowledge</em>, Boulder, CO:\nWestview.",
                "Lehrer, Keith &amp; Stewart Cohen, 1983, “Justification,\nTruth, and Coherence”, <em>Synthese</em>, 55(2): 191–207.\ndoi:10.1007/BF00485068",
                "Littlejohn, Clayton, 2012, <em>Justification and the\nTruth-Connection</em>, Cambridge: Cambridge University Press.",
                "Locke, John, 1690, <em>An Essay Concerning Human\nUnderstanding</em>, reprinted Clarendon Edition of the Works of John\nLocke, Peter H. Nidditch (ed.), Oxford: Oxford University Press,\n1975.",
                "Lyons, Jack C., 2005, “Perceptual Belief and Nonexperiential\nLooks”, <em>Philosophical Perspectives</em>, 19(1):\n237–256. doi:10.1111/j.1520-8583.2005.00061.x",
                "–––, 2008, “Evidence, Experience, and\nExternalism”, <em>Australasian Journal of Philosophy</em>, 86:\n461–79.",
                "–––, 2009, <em>Perception and Basic Beliefs:\nZombies, Modules, and the Problem of the External World</em>, New\nYork: Oxford University Press.",
                "–––, 2011, “Circularity, Reliability, and\nthe Cognitive Penetrability of Perception”, <em>Philosophical\nIssues</em>, 21: 289–311.",
                "–––, 2012, “Should Reliabilists be Worried\nAbout Demon Worlds?” <em>Philosophy and Phenomenological\nResearch</em>, 86(1): 1–40.\ndoi:10.1111/j.1933-1592.2012.00614.x",
                "–––, 2016, “Experiential Evidence?”\n<em>Philosophical Studies</em>, 173(4): 1053–79.\ndoi:10.1007/s11098-015-0540-z",
                "–––, 2020, “Two Dogmas of Empirical\nJustification”, <em>Philosophical Issues</em>, 30(1),\n221–237.",
                "Markie, Peter J., 2006, “Epistemically Appropriate\nPerceptual Belief”, <em>Noûs</em>, 40(1): 118–142.\ndoi:10.1111/j.0029-4624.2006.00603.x",
                "–––, 2013, “Searching for True\nDogmatism”, in <em>Seemings and Justification: New Essays on\nDgmatism and Phenomenal Conservatism</em>, pp. 248–69.",
                "Martin, M.G.F., 2002, “The Transparency of\nExperience”, <em>Mind and Language</em>, 17(4): 376–425.\ndoi:10.1111/1468-0017.00205",
                "McDowell, John, 1982, “Criteria, Defeasibility and\nKnowledge”, <em>Proceedings of the British Academy</em>, 68:\n455–79.\n [<a href=\"http://www.britac.ac.uk/pubs/proc/files/68p455.pdf\" target=\"other\">McDowell 1982 available online</a>]",
                "–––, 1994, <em>Mind and World</em>, Cambridge,\nMA: Harvard University Press.",
                "–––, 2011, <em style=\"text-indent:-2em\">Perception\nAs a Capacity for Knowledge,</em>\nMilwaukee, WI: Marquette University Press.",
                "–––, 2018, “Perceptual Experience and\nEmpirical Rationality”, A<em style=\"text-indent:-2em\">nalytic\nPhilosophy</em>, 59: 89–98.",
                "McGrath, Matthew, 2013, “Phenomenal Conservatism and\nCognitive Penetration: The ‘Bad Basis’\nCounterexamples”, in <em>Seemings and Justification: New Essays\non Dgmatism and Phenomenal Conservatism</em>, pp. 225–247.",
                "–––, 2018, “Looks and Perceptual\nJustification”, <em>Philosophy and Phenomenological\nResearch</em>, 96(1): 110–33.",
                "McGrew, Tim J., 2003. “A Defense of Strong\nFoundationalism”, in <em>The Theory of Knowledge</em>,\n3<sup>rd</sup> edition, Louis Pojman (ed.), Belmont, CA: Wadsworth,\n194–206.",
                "Millar, Alan, 2011, “How Visual Perception Yields Reasons\nfor Belief”, <em>Philosophical Issues</em>, 21(1):\n332–351. doi:10.1111/j.1533-6077.2011.00207.x",
                "–––, 2019, <em>Knowing By Perceiving</em>,\nOxford: Oxford University Press.",
                "Noë, Alva, 2004, <em>Action in Perception</em>, Cambridge,\nMA: MIT Press.",
                "Pautz, Adam, 2020, “The Arationality of Perception: Comments\non Susanna Siegel”, <em>Philosophy and Phenomenological\nResearch</em> 101(3): 755–63.",
                "Peacocke, Christopher, 2001, “Does Perception Have a\nNonconceptual Content?” <em>The Journal of Philosophy</em>,\n98(5): 239–264. doi:10.2307/2678383",
                "Plantinga, Alvin, 1993, <em>Warrant and Proper Function</em>,\nOxford: Oxford University Press.",
                "Pollock, John L., 1971, “Perceptual Knowledge”,\n<em>Philosophical Review</em>, 80(3): 287–319.",
                "–––, 1974, <em>Knowledge and Justification</em>,\nPrinceton: Princeton University Press.",
                "–––, 1986, <em>Contemporary Theories of\nKnowledge</em>, Savage, MD: Rowman &amp; Littlefield.",
                "Pollock, John L. &amp; Joseph Cruz, 1999, <em>Contemporary\nTheories of Knowledge</em>, 2<sup>nd</sup> edition, Lanham, MD: Rowman\nand Littlefield.",
                "Pritchard, Duncan, 2012, <em>Epistemological Disjunctivism</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199557912.001.0001",
                "Pryor, James, 2000, “The Skeptic and the Dogmatist”,\n<em>Noûs</em>, 34(4): 517–549.\ndoi:10.1111/0029-4624.00277",
                "Quinton, Anthony, 1973, <em>The Nature of Things</em>, London:\nRoutledge and Kegan Paul.",
                "Reid, Thomas, 1764, <em>An Inquiry Into the Human Mind on the\nPrinciples of Common Sense</em>, reprinted Derek R. Brookes (ed.),\nvol. 2, Edinburgh Edition of Thomas Reid, Knud Haakonssen (series\ned.), Edinburgh: Edinburgh University Press, 1997.",
                "–––, 1785, <em>Essays on the Intellectual Powers\nof Man</em>, reprinted Critical Edition, Derek R. Brookes (ed.), vol.\n3, Edinburgh Edition of Thomas Reid, Knud Haakonssen (series ed.),\nEdinburgh: Edinburgh University Press, 2002.",
                "Robinson, Howard, 2022. <em>Perception and Idealism: An Essay on\nHow the World Manifests Itself to Us, and How It (Probably) Is in\nItself</em>, Oxford: Oxford University Press.",
                "Russell, Bertrand, 1912, <em>The Problems of Philosophy</em>,\nLondon: Williams and Norgate; New York: Henry Holt and Company.",
                "Schellenberg, Susanna, 2013, “Experience and\nEvidence”, <em>Mind</em>, 122(487): 699–747.",
                "–––, 2016, “Phenomenal Evidence and\nFactive Evidence”, <em>Philosophical Studies</em>, 173(4):\n875–896. doi:10.1007/s11098-015-0528-8",
                "–––, 2018, <em>The Unity of Perception</em>,\nOxford: Oxford University Press.",
                "Sellars, Wilfrid, 1956, “Empiricism and the Philosophy of\nMind”, <em>Minnesota Studies in the Philosophy of Science</em>,\n1: 253–329.",
                "Siegel, Susanna, 2011, “Cognitive Penetrability and\nPerceptual Justification”, <em>Noûs</em>, 46(2):\n201–22. doi:10.1111/j.1468-0068.2010.00786.x",
                "–––, 2013, “The Epistemic Impact of the\nEtiology of Experience”, <em>Philosophical Studies</em>, 162(3):\n697–722. doi:10.1007/s11098-012-0059-5",
                "–––, 2017, <em>The Rationality of\nPerception,</em> Oxford: Oxford University Press.",
                "Silins, Nicholas, 2011, “Seeing Through the ‘Veil of\nPerception’”, <em>Mind</em>, 120(478): 329–67.\ndoi:10.1093/mind/fzr030",
                "Smithies, Declan, 2013, “Review of Duncan Pritchard,\n<em>Epistemological Disjunctivism</em>”, <em>Notre Dame\nPhilosophical Reviews</em>, 2013.01.02. URL =\n &lt;<a href=\"http://ndpr.nd.edu/news/36590-epistemological-disjunctivism/\" target=\"other\">http://ndpr.nd.edu/news/36590-epistemological-disjunctivism/</a>&gt;.",
                "–––, 2019, <em>The Epistemic Role of\nConsciousness</em>, Oxford: Oxford University Press.",
                "Snowdon, Paul., 1980, “Perception, Vision and\nCausation”, <em>Proceedings of the Aristotelian Society</em>,\nNew Series, 81: 175–92.",
                "Sosa, Ernest, 1991, <em>Knowledge in Perspective</em>, Cambridge:\nCambridge University Press.",
                "–––, 1993, “Proper Functionalism and\nVirtue Epistemology”, <em>Noûs</em>, 27(1):\n51–65.",
                "–––, 2007, <em>A Virtue Epistemology</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199297023.001.0001",
                "–––, 2021, <em>Epistemic Explanations</em>,\nOxford: Oxford University Press.",
                "Teng, Lu, “Is Phenomenal Force Sufficient for Immediate\nPerceptual Justification?”, <em>Synthese</em>, 195,\n637–56. https://doi.org/10.1007/s11229-016-1233-7",
                "Tucker, Chris, 2010, “Why Open-Minded People Should Endorse\nDogmatism”, <em>Philosophical Perspectives</em>, 24(1):\n529–545. doi:10.1111/j.1520-8583.2010.00202.x",
                "–––, 2014, “If Dogmatists Have a Problem\nWith Cognitive Penetration, You Do Too”, <em>Dialectica</em>,\n68(1): 35–62.",
                "Vogel, Jonathan, 2000, “Reliabilism Leveled”,\n<em>Journal of Philosophy</em>, 97(11): 602–623.\ndoi:10.2307/2678454",
                "–––, 2008, “Epistemic\nBootstrapping”, <em>Journal of Philosophy</em>, 105(9):\n518–39. doi:10.5840/jphil2008105931",
                "Williamson, Timothy, 2000, <em>Knowledge and its Limits.</em>\nOxford: Oxford University Press. doi:10.1093/019925656X.001.0001"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alston, William P., 1988, “An Internalist\nExternalism”, <em>Synthese</em>, 74(3): 265–283.\ndoi:10.1007/BF00869630</li>\n<li>–––, 1993, <em>The Reliability of Sense\nPerception</em>, Ithaca: Cornell University Press.</li>\n<li>–––, 1999, “Back to the Theory of\nAppearing”, <em>Philosophical Perspectives</em>, 13:\n181–203.</li>\n<li>Augustine, <em>Against the Academicians</em> and <em>The\nTeacher</em>, P. King (trans.), Indianapolis, Indiana: Hackett\nPublishing, 1995.</li>\n<li>Bengson, John, Enrico Grube, &amp; Daniel Z. Korman, 2011,\n“A New Framework for Conceptualism”, <em>Noûs</em>,\n45(1): 167–189. doi:10.1111/j.1468-0068.2010.00764.x</li>\n<li>Bergmann, Michael, 2004, “Externalist Justification without\nReliability”, <em>Philosophical Issues</em>, 14(1): 35–60.\ndoi:10.1111/j.1533-6077.2004.00019.x</li>\n<li>–––, 2006, <em>Justification Without Awareness:\nA Defense of Epistemic Externalism</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2013, “Externalist Justification and\nthe Role of Seemings”, <em>Philosophical Studies,</em> 166 (1):\n163–184.</li>\n<li>Berkeley, George, 1710, <em>A Treatise Concerning the Principles\nof Human Knowledge</em>, reprinted in Berkeley 1975,\n61–127.</li>\n<li>–––, 1713, <em>Three Dialogues Between Hylas and\nPhilonous</em>, reprinted in Berkeley 1975, 129–207.</li>\n<li>–––, 1975, <em>George Berkeley: Philosophical\nWorks, Including the Works on Vision</em>, M. R. Ayers (ed.), London:\nDent.</li>\n<li>BonJour, Laurence, 1978, “Can Empirical Knowledge Have a\nFoundation?” <em>American Philosophical Quarterly</em>, 15(1):\n1–13.</li>\n<li>–––, 1980, “Externalist Theories of\nEmpirical Knowledge”, <em>Midwest Studies in Philosophy</em>,\n5(1): 53–73. doi:10.1111/j.1475-4975.1980.tb00396.x</li>\n<li>–––, 1985, <em>The Structure of Empirical\nKnowledge</em>, Cambridge: Harvard University Press.</li>\n<li>–––, 1997, “Haack on Justification and\nExperience”, <em>Synthese</em>, 112(1): 13–23.\ndoi:10.1023/A:1004972413209</li>\n<li>–––, 2003, “A Version of Internalist\nFoundationalism”, in Laurence BonJour &amp; Ernest Sosa,\n<em>Epistemic Justification: Internalism vs. Externalism, Foundations\nvs. Virtues</em>, Malden, MA: Blackwell, 3–96.</li>\n<li>–––, 2010, <em>Epistemology: Classic Problems\nand Contemporary Responses</em>, 2<sup>nd</sup> edition, Lanham, MD:\nRowman and Littlefield.</li>\n<li>Brewer, Bill, 1999, <em>Perception and Reason</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199250456.001.0001</li>\n<li>–––, 2011, <em>Perception and its Objects</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199260256.001.0001</li>\n<li>Brogaard, Berit, 2013, “Phenomenal Seemings and Sensible\nDogmatism”, in Chris Tucker (ed.), <em>Seemings and\nJustification: New Essays on Dogmatism and Phenomenal\nConservatism</em>, Oxford: Oxford University Press, 270–289.\ndoi:10.1093/acprof:oso/9780199899494.003.0012</li>\n<li>Byrne, Alex, 2005, “Perception and Conceptual\nContent”, in Ernest Sosa &amp; Matthias Steup (eds.),\n<em>Contemporary Debates in Epistemology</em>, Boston: Blackwell,\n231–250.</li>\n<li>–––, 2014, “Perception and\nEvidence”, <em>Philosophical Studies</em>, 170:\n101–13.</li>\n<li>–––, 2016, “The Epistemic Significance of\nExperience”, <em>Philosophical Studies</em>, 173(4):\n947–67. doi:10.1007/s11098-015-0537-7</li>\n<li>Burge, Tyler, 2003, “Perceptual Entitlement”,\n<em>Philosophy and Phenomenological Research</em>, 67(3):\n503–548.</li>\n<li>–––, 2020, “Entitlement: The Basis For\nEmpirical Warrant”, in Peter Graham &amp; Nikolaj Pedersen\n(eds.), <em>Epistemic Entitlement</em>, Oxford: Oxford University\nPress.</li>\n<li>Chalmers, David J., 2003, “The Content and Epistemology of\nPhenomenal Belief”, in Quentin Smith &amp; Aleksandar Jokic\n(eds.), <em>Consciousness: New Philosophical Perspectives</em>,\nOxford: Oxford University Press, 220–271.</li>\n<li>Chisholm, Roderick M., 1957, <em>Perceiving: A Philosophical\nStudy</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 1966, <em>Theory of Knowledge</em>,\nEnglewood Cliffs, NJ: Prentice-Hall</li>\n<li>–––, 1977, <em>Theory of Knowledge</em>,\n2<sup>nd</sup> edition, Englewood Cliffs, NJ: Prentice-Hall.</li>\n<li>Chudnoff, Elijah, 2018, “Epistemic Elitism and Other\nMinds”, <em>Philosophy and Phenomenological Research</em>,\n96(2): 276–298.</li>\n<li>–––, 2021, <em>Forming Impressions</em>, Oxford:\nOxford University Press.</li>\n<li>Chudnoff Elijah, &amp; David Didomenico, 2015, “The\nEpistemic Unity of Perception”, <em>Pacific Philosophical\nQuarterly</em>, 96(4): 535–549. doi:10.1111/papq.12114</li>\n<li>Cohen, Stewart, 1984, “Justification and Truth”,\n<em>Philosophical Studies</em>, 46: 279–295.</li>\n<li>–––, 2002, “Basic Knowledge and the\nProblem of Easy Knowledge”, <em style=\"text-indent:-2em\">Philosophy\nand Phenomenological\nResearch</em>, 65(2): 309–329.\ndoi:10.1111/j.1933-1592.2002.tb00204.x</li>\n<li>Comesaña, Juan, 2010, “Evidentialist\nReliabilism”, <em>Noûs</em>, 44(4): 571–600.\ndoi:10.1111/j.1468-0068.2010.00748.x</li>\n<li>Conee, Earl, 1988, “The Basic Nature of Epistemic\nJustification”, <em>The Monist</em>, 71(3): 389–404.\nReprinted in Conne &amp; Feldman 2004.\ndoi:10.1093/0199253722.003.0003</li>\n<li>Conee, Earl &amp; Richard Feldman, 2004, <em>Evidentialism: Essays\nin Epistemology</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199253722.001.0001</li>\n<li>Davidson, Donald, 1986, “A Coherence Theory of Truth and\nKnowledge”, in <em>Truth and Interpretation: Perspectives on the\nPhilosophy of Donald Davidson</em>, Ernest Lepore, (ed.), New York:\nBlackwell, 307–319.</li>\n<li>–––, 1987, “Knowing One’s Own\nMind”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 61(3): 441–58.\ndoi:10.2307/3131782</li>\n<li>Descartes, René, 1641, <em>Meditations on First\nPhilosophy</em>, in <em>The Philosophical Writings of Descartes</em>,\nJohn Cottingham, Robert Stoothoff, and Dugald Murdoch (trans.), vol.\n2, Cambridge: Cambridge University Press, 1985, 1–62.</li>\n<li>Dretske, Fred, 1971, “Conclusive Reasons”,\n<em>Australasian Journal of Philosophy</em>, 49: 1–22</li>\n<li>Dreyfus, Hubert L., 2002, “Intelligence Without\nRepresentation—Merleau-Ponty’s Critique of Mental\nRepresentation: The Relevance of Phenomenology to Scientific\nExplanation”, <em>Phenomenology and the Cognitive Sciences</em>,\n1(4): 367–383. doi:10.1023/A:1021351606209</li>\n<li>Feldman, Richard, 2003, <em>Epistemology</em>, Upper Saddle River,\nNJ: Prentice-Hall.</li>\n<li>Foster, John, 2008, <em>A World for Us: The Case for\nPhenomenalistic Idealism</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199297139.001.0001</li>\n<li>Fumerton, Richard A., 1995, <em>Metaepistemology and\nSkepticism</em>, Lanham, MD: Rowman and Littlefield.</li>\n<li>–––, 2001, “Classical\nFoundationalism”, in M. DePaul (ed.), <em>Resurrecting\nOld-fashioned Foundationalism.</em> Lanham, MD: Rowman and\nLittlefield, 3–20.</li>\n<li>Ghijsen, Harmen, 2014, “Phenomenalist Dogmatist\nExperientialism and the Distinctiveness Problem”,\n<em>Synthese</em>, 191(7): 1549–66.</li>\n<li>–––, 2021, “Predictive Processing and\nFoundationalism About Perception”, <em>Synthese</em>, 198(7):\n1751–69.</li>\n<li>Goldman, Alvin I., 1979, “What Is Justified Belief?”\nin G. Pappas (ed.), <em>Justification and Knowledge</em>, Dordrecht:\nReidel, 1–25.</li>\n<li>–––, 1986, <em>Epistemology and Cognition</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1988, “Strong and Weak\nJustification”, <em>Philosophical Perspectives</em>, 2:\n51–69.</li>\n<li>–––, 2011, “Commentary on Jack\nLyons’s <em>Perception and Basic Beliefs</em>”,\n<em>Philosophical Studies</em>, 153(3): 457–66.\ndoi:10.1007/s11098-010-9602-4</li>\n<li>Graham, Peter J., 2012, “Epistemic Entitlement”,\n<em>Noûs</em>, 46(3): 449–482.\ndoi:10.1111/j.1468-0068.2010.00815.x</li>\n<li>–––, 2019, “Why is Warrant\nNormative?”, <em>Philosophical Issues</em>, 29(1):\n110–128.</li>\n<li>Graham, Peter J., &amp; Nikolaj J. L. L. Pedersen, 2020,\n“Dretske &amp; McDowell on Perceptual Knowledge, Conclusive\nReasons, and Epistemological Disjunctivism”, <em>Philosophical\nIssues</em>, 30(1): 148–166.</li>\n<li>Greco, John, 2000, <em>Putting Skeptics in Their Place</em>,\nCambridge: Cambridge University Press.</li>\n<li>Gupta, Anil, 2006, <em>Empiricism and Experience</em>, Oxford:\nOxford University Press.</li>\n<li>Haack, Susan, 1993, <em>Evidence and Inquiry: Toward\nReconstruction in Epistemology</em>, Oxford: Blackwell.</li>\n<li>Haddock, Adrian &amp; Fiona Macpherson (eds.), 2008,\n<em>Disjunctivism: Perception, Action, Knowledge</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199231546.001.0001</li>\n<li>Heck, Richard G. Jr., 2000, “Nonconceptual Content and the\n‘Space of Reasons’”, <em>Philosophical Review</em>,\n109(4): 483–523. doi:10.2307/2693622</li>\n<li>Hoffman, Donald D., 2009, “The Interface Theory of\nPerception”, in Sven J. Dickinson, Michael J. Tarr, Aleš\nLeonardis, &amp; Bernt Schiele (eds.) <em>Object Categorization:\nComputer and Human Vision Perspectives</em>, Cambridge, UK: Cambridge\nUniversity Press, 148–165.</li>\n<li>Huemer, Michael, 2001, <em>Skepticism and the Veil of\nPerception</em>, Lanham, MD: Rowman and Littlefield.</li>\n<li>–––, 2007, “Compassionate Phenomenal\nConservatism”, <em>Philosophy and Phenomenological\nResearch</em>, 74(1): 30–55.\ndoi:10.1111/j.1933-1592.2007.00002.x</li>\n<li>–––, 2013, “Epistemological Asymmetries\nBetween Belief and Experience”, <em>Philosophical Studies</em>,\n162(3): 741–748. doi:10.1007/s11098-012-0056-8</li>\n<li>Hume, David, 1739, <em>A Treatise of Human Nature</em>, Peter H.\nNidditch (ed.), Oxford: Clarendon Press, 1978.</li>\n<li>–––, 1748, <em>Enquiry Concerning Human\nUnderstanding</em>, reprinted in <em>Enquiries Concerning Human\nUnderstanding and Concerning the Principle of Morals</em>, Peter H.\nNidditch (ed.), Oxford: Clarendon Press, 1975.</li>\n<li>Johnston, Mark, 2011, “On a Neglected Epistemic\nVirtue”, <em>Philosophical Issues</em>, 21: 165–218.</li>\n<li>Kant, Immanuel, 1781, <em>Critique of Pure Reason</em>, Norman\nKemp Smith, (trans.), London: Macmillan; New York: St. Martin’s\nPress, 1929.</li>\n<li>Kvanvig, Jonathan L., 2012, “Coherentism”, in Andrew\nCullison (ed.), <em>The Continuum Companion to Epistemology</em>, New\nYork: Continuum Press, 57–72.</li>\n<li>Kvanvig, Jonathan L. &amp; Wayne D. Riggs, 1992, “Can a\nCoherence Theory Appeal to Appearance States?” <em>Philosophical\nStudies</em>, 67(3): 197–217. doi:10.1007/BF00354536</li>\n<li>Lehrer, Keith, 1990, <em>Theory of Knowledge</em>, Boulder, CO:\nWestview.</li>\n<li>Lehrer, Keith &amp; Stewart Cohen, 1983, “Justification,\nTruth, and Coherence”, <em>Synthese</em>, 55(2): 191–207.\ndoi:10.1007/BF00485068</li>\n<li>Littlejohn, Clayton, 2012, <em>Justification and the\nTruth-Connection</em>, Cambridge: Cambridge University Press.</li>\n<li>Locke, John, 1690, <em>An Essay Concerning Human\nUnderstanding</em>, reprinted Clarendon Edition of the Works of John\nLocke, Peter H. Nidditch (ed.), Oxford: Oxford University Press,\n1975.</li>\n<li>Lyons, Jack C., 2005, “Perceptual Belief and Nonexperiential\nLooks”, <em>Philosophical Perspectives</em>, 19(1):\n237–256. doi:10.1111/j.1520-8583.2005.00061.x</li>\n<li>–––, 2008, “Evidence, Experience, and\nExternalism”, <em>Australasian Journal of Philosophy</em>, 86:\n461–79.</li>\n<li>–––, 2009, <em>Perception and Basic Beliefs:\nZombies, Modules, and the Problem of the External World</em>, New\nYork: Oxford University Press.</li>\n<li>–––, 2011, “Circularity, Reliability, and\nthe Cognitive Penetrability of Perception”, <em>Philosophical\nIssues</em>, 21: 289–311.</li>\n<li>–––, 2012, “Should Reliabilists be Worried\nAbout Demon Worlds?” <em>Philosophy and Phenomenological\nResearch</em>, 86(1): 1–40.\ndoi:10.1111/j.1933-1592.2012.00614.x</li>\n<li>–––, 2016, “Experiential Evidence?”\n<em>Philosophical Studies</em>, 173(4): 1053–79.\ndoi:10.1007/s11098-015-0540-z</li>\n<li>–––, 2020, “Two Dogmas of Empirical\nJustification”, <em>Philosophical Issues</em>, 30(1),\n221–237.</li>\n<li>Markie, Peter J., 2006, “Epistemically Appropriate\nPerceptual Belief”, <em>Noûs</em>, 40(1): 118–142.\ndoi:10.1111/j.0029-4624.2006.00603.x</li>\n<li>–––, 2013, “Searching for True\nDogmatism”, in <em>Seemings and Justification: New Essays on\nDgmatism and Phenomenal Conservatism</em>, pp. 248–69.</li>\n<li>Martin, M.G.F., 2002, “The Transparency of\nExperience”, <em>Mind and Language</em>, 17(4): 376–425.\ndoi:10.1111/1468-0017.00205</li>\n<li>McDowell, John, 1982, “Criteria, Defeasibility and\nKnowledge”, <em>Proceedings of the British Academy</em>, 68:\n455–79.\n [<a href=\"http://www.britac.ac.uk/pubs/proc/files/68p455.pdf\" target=\"other\">McDowell 1982 available online</a>]</li>\n<li>–––, 1994, <em>Mind and World</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>–––, 2011, <em style=\"text-indent:-2em\">Perception\nAs a Capacity for Knowledge,</em>\nMilwaukee, WI: Marquette University Press.</li>\n<li>–––, 2018, “Perceptual Experience and\nEmpirical Rationality”, A<em style=\"text-indent:-2em\">nalytic\nPhilosophy</em>, 59: 89–98.</li>\n<li>McGrath, Matthew, 2013, “Phenomenal Conservatism and\nCognitive Penetration: The ‘Bad Basis’\nCounterexamples”, in <em>Seemings and Justification: New Essays\non Dgmatism and Phenomenal Conservatism</em>, pp. 225–247.</li>\n<li>–––, 2018, “Looks and Perceptual\nJustification”, <em>Philosophy and Phenomenological\nResearch</em>, 96(1): 110–33.</li>\n<li>McGrew, Tim J., 2003. “A Defense of Strong\nFoundationalism”, in <em>The Theory of Knowledge</em>,\n3<sup>rd</sup> edition, Louis Pojman (ed.), Belmont, CA: Wadsworth,\n194–206.</li>\n<li>Millar, Alan, 2011, “How Visual Perception Yields Reasons\nfor Belief”, <em>Philosophical Issues</em>, 21(1):\n332–351. doi:10.1111/j.1533-6077.2011.00207.x</li>\n<li>–––, 2019, <em>Knowing By Perceiving</em>,\nOxford: Oxford University Press.</li>\n<li>Noë, Alva, 2004, <em>Action in Perception</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Pautz, Adam, 2020, “The Arationality of Perception: Comments\non Susanna Siegel”, <em>Philosophy and Phenomenological\nResearch</em> 101(3): 755–63.</li>\n<li>Peacocke, Christopher, 2001, “Does Perception Have a\nNonconceptual Content?” <em>The Journal of Philosophy</em>,\n98(5): 239–264. doi:10.2307/2678383</li>\n<li>Plantinga, Alvin, 1993, <em>Warrant and Proper Function</em>,\nOxford: Oxford University Press.</li>\n<li>Pollock, John L., 1971, “Perceptual Knowledge”,\n<em>Philosophical Review</em>, 80(3): 287–319.</li>\n<li>–––, 1974, <em>Knowledge and Justification</em>,\nPrinceton: Princeton University Press.</li>\n<li>–––, 1986, <em>Contemporary Theories of\nKnowledge</em>, Savage, MD: Rowman &amp; Littlefield.</li>\n<li>Pollock, John L. &amp; Joseph Cruz, 1999, <em>Contemporary\nTheories of Knowledge</em>, 2<sup>nd</sup> edition, Lanham, MD: Rowman\nand Littlefield.</li>\n<li>Pritchard, Duncan, 2012, <em>Epistemological Disjunctivism</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199557912.001.0001</li>\n<li>Pryor, James, 2000, “The Skeptic and the Dogmatist”,\n<em>Noûs</em>, 34(4): 517–549.\ndoi:10.1111/0029-4624.00277</li>\n<li>Quinton, Anthony, 1973, <em>The Nature of Things</em>, London:\nRoutledge and Kegan Paul.</li>\n<li>Reid, Thomas, 1764, <em>An Inquiry Into the Human Mind on the\nPrinciples of Common Sense</em>, reprinted Derek R. Brookes (ed.),\nvol. 2, Edinburgh Edition of Thomas Reid, Knud Haakonssen (series\ned.), Edinburgh: Edinburgh University Press, 1997.</li>\n<li>–––, 1785, <em>Essays on the Intellectual Powers\nof Man</em>, reprinted Critical Edition, Derek R. Brookes (ed.), vol.\n3, Edinburgh Edition of Thomas Reid, Knud Haakonssen (series ed.),\nEdinburgh: Edinburgh University Press, 2002.</li>\n<li>Robinson, Howard, 2022. <em>Perception and Idealism: An Essay on\nHow the World Manifests Itself to Us, and How It (Probably) Is in\nItself</em>, Oxford: Oxford University Press.</li>\n<li>Russell, Bertrand, 1912, <em>The Problems of Philosophy</em>,\nLondon: Williams and Norgate; New York: Henry Holt and Company.</li>\n<li>Schellenberg, Susanna, 2013, “Experience and\nEvidence”, <em>Mind</em>, 122(487): 699–747.</li>\n<li>–––, 2016, “Phenomenal Evidence and\nFactive Evidence”, <em>Philosophical Studies</em>, 173(4):\n875–896. doi:10.1007/s11098-015-0528-8</li>\n<li>–––, 2018, <em>The Unity of Perception</em>,\nOxford: Oxford University Press.</li>\n<li>Sellars, Wilfrid, 1956, “Empiricism and the Philosophy of\nMind”, <em>Minnesota Studies in the Philosophy of Science</em>,\n1: 253–329.</li>\n<li>Siegel, Susanna, 2011, “Cognitive Penetrability and\nPerceptual Justification”, <em>Noûs</em>, 46(2):\n201–22. doi:10.1111/j.1468-0068.2010.00786.x</li>\n<li>–––, 2013, “The Epistemic Impact of the\nEtiology of Experience”, <em>Philosophical Studies</em>, 162(3):\n697–722. doi:10.1007/s11098-012-0059-5</li>\n<li>–––, 2017, <em>The Rationality of\nPerception,</em> Oxford: Oxford University Press.</li>\n<li>Silins, Nicholas, 2011, “Seeing Through the ‘Veil of\nPerception’”, <em>Mind</em>, 120(478): 329–67.\ndoi:10.1093/mind/fzr030</li>\n<li>Smithies, Declan, 2013, “Review of Duncan Pritchard,\n<em>Epistemological Disjunctivism</em>”, <em>Notre Dame\nPhilosophical Reviews</em>, 2013.01.02. URL =\n &lt;<a href=\"http://ndpr.nd.edu/news/36590-epistemological-disjunctivism/\" target=\"other\">http://ndpr.nd.edu/news/36590-epistemological-disjunctivism/</a>&gt;.</li>\n<li>–––, 2019, <em>The Epistemic Role of\nConsciousness</em>, Oxford: Oxford University Press.</li>\n<li>Snowdon, Paul., 1980, “Perception, Vision and\nCausation”, <em>Proceedings of the Aristotelian Society</em>,\nNew Series, 81: 175–92.</li>\n<li>Sosa, Ernest, 1991, <em>Knowledge in Perspective</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1993, “Proper Functionalism and\nVirtue Epistemology”, <em>Noûs</em>, 27(1):\n51–65.</li>\n<li>–––, 2007, <em>A Virtue Epistemology</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199297023.001.0001</li>\n<li>–––, 2021, <em>Epistemic Explanations</em>,\nOxford: Oxford University Press.</li>\n<li>Teng, Lu, “Is Phenomenal Force Sufficient for Immediate\nPerceptual Justification?”, <em>Synthese</em>, 195,\n637–56. https://doi.org/10.1007/s11229-016-1233-7</li>\n<li>Tucker, Chris, 2010, “Why Open-Minded People Should Endorse\nDogmatism”, <em>Philosophical Perspectives</em>, 24(1):\n529–545. doi:10.1111/j.1520-8583.2010.00202.x</li>\n<li>–––, 2014, “If Dogmatists Have a Problem\nWith Cognitive Penetration, You Do Too”, <em>Dialectica</em>,\n68(1): 35–62.</li>\n<li>Vogel, Jonathan, 2000, “Reliabilism Leveled”,\n<em>Journal of Philosophy</em>, 97(11): 602–623.\ndoi:10.2307/2678454</li>\n<li>–––, 2008, “Epistemic\nBootstrapping”, <em>Journal of Philosophy</em>, 105(9):\n518–39. doi:10.5840/jphil2008105931</li>\n<li>Williamson, Timothy, 2000, <em>Knowledge and its Limits.</em>\nOxford: Oxford University Press. doi:10.1093/019925656X.001.0001</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abduction",
            "consciousness: and intentionality",
            "epistemic closure",
            "justification, epistemic: foundationalist theories of",
            "mental content: nonconceptual",
            "perception: the contents of",
            "perception: the disjunctive theory of",
            "perception: the problem of",
            "reliabilist epistemology",
            "sense data",
            "simplicity",
            "skepticism"
        ],
        "entry_link": [
            {
                "../abduction/": "abduction"
            },
            {
                "../consciousness-intentionality/": "consciousness: and intentionality"
            },
            {
                "../closure-epistemic/": "epistemic closure"
            },
            {
                "../justep-foundational/": "justification, epistemic: foundationalist theories of"
            },
            {
                "../content-nonconceptual/": "mental content: nonconceptual"
            },
            {
                "../perception-contents/": "perception: the contents of"
            },
            {
                "../perception-disjunctive/": "perception: the disjunctive theory of"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../reliabilism/": "reliabilist epistemology"
            },
            {
                "../sense-data/": "sense data"
            },
            {
                "../simplicity/": "simplicity"
            },
            {
                "../skepticism/": "skepticism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=perception-episprob\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/perception-episprob/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=perception-episprob&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/perception-episprob/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=perception-episprob": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/perception-episprob/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=perception-episprob&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/perception-episprob/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "BonJour, Lawrence, “Epistemological Problems of\nPerception,” <em>Stanford Encyclopedia of Philosophy</em> (Fall\n2016 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2016/entries/perception-episprob/\" target=\"other\">https://plato.stanford.edu/archives/fall2016/entries/perception-episprob/</a>&gt;.\n [This was the previous entry on epistemological problems of\nperception in the <em>Stanford Encyclopedia of Philosophy</em> —\nsee the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=perception-episprob\" target=\"other\">version history</a>.]"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/fall2016/entries/perception-episprob/": "https://plato.stanford.edu/archives/fall2016/entries/perception-episprob/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=perception-episprob": "version history"
            }
        ]
    }
}