{
    "url": "presupposition",
    "title": "Presupposition",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "David I. Beaver\n<dib@mail.utexas.edu>\nBart Geurts\n<brtgrts@gmail.com>\nKristie Denlinger\n<kdenlinger@utexas.edu>",
        "author_links": [
            {
                "http://www.utexas.edu/cola/linguistics/faculty/profile.php?id=dib97": "David I. Beaver"
            },
            {
                "mailto:dib%40mail%2eutexas%2eedu": "dib@mail.utexas.edu"
            },
            {
                "http://www.ru.nl/ncs/bart/": "Bart Geurts"
            },
            {
                "mailto:brtgrts%40gmail%2ecom": "brtgrts@gmail.com"
            },
            {
                "mailto:kdenlinger%40utexas%2eedu": "kdenlinger@utexas.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.utexas.edu/cola/linguistics/faculty/profile.php?id=dib97\" target=\"other\">David I. Beaver</a>\n&lt;<a href=\"mailto:dib%40mail%2eutexas%2eedu\"><em>dib<abbr title=\" at \">@</abbr>mail<abbr title=\" dot \">.</abbr>utexas<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://www.ru.nl/ncs/bart/\" target=\"other\">Bart Geurts</a>\n&lt;<a href=\"mailto:brtgrts%40gmail%2ecom\"><em>brtgrts<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\nKristie Denlinger\n&lt;<a href=\"mailto:kdenlinger%40utexas%2eedu\"><em>kdenlinger<abbr title=\" at \">@</abbr>utexas<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Apr 1, 2011",
        "substantive revision Thu Jan 7, 2021"
    ],
    "preamble": "\n\nWe discuss presupposition, the phenomenon whereby speakers mark\nlinguistically information as being taken for granted, rather than\nbeing part of the main propositional content of a speech act.\nExpressions and constructions carrying presuppositions are called\n“presupposition triggers”, forming a large class including\ndefinites and factive verbs. The article first introduces a sample of\ntriggers, the basic properties of presuppositions such as projection\nand cancellability, and the diagnostic tests used to identify them.\nThe reader is then introduced to major models of presupposition from\nthe last 50 years, separated into three classes: Frege-Strawson\nderived semantic models, pragmatic models such as that offered by\nStalnaker, and dynamic models. Finally we discuss some of the main\ncurrent issues in presupposition theory. These involve accommodation,\nwhich occurs when a hearer’s knowledge state is adjusted to meet the\nspeaker’s presuppositions; presupposition failure, which occurs when a\npresupposition is (known to be) false; the interaction between\npresuppositions and attitudes; and variability in the behavior of\ntriggers and their presuppositions.\n",
    "toc": [
        {
            "#CharPres": "1. Characterizing Presupposition"
        },
        {
            "#Intr": "1.1 Introduction"
        },
        {
            "#Proj": "1.2 Projection"
        },
        {
            "#Canc": "1.3 Cancellability"
        },
        {
            "#FregStraTrad": "2. The Frege-Strawson tradition"
        },
        {
            "#PragPres": "3. Pragmatic presupposition"
        },
        {
            "#LocaContDynaTurn": "4. Local contexts and the dynamic turn"
        },
        {
            "#PresAnap": "4.1 Presupposition and anaphora"
        },
        {
            "#SatiLocaCont": "4.2 Satisfaction in local contexts"
        },
        {
            "#SatiTheo": "4.3 Satisfaction theories"
        },
        {
            "#Acco": "5. Accommodation"
        },
        {
            "#GlobLocaAcco": "5.1 Global and Local Accommodation"
        },
        {
            "#AccoPresSatiFram": "5.2 Accommodating Presuppositions in Satisfaction Framework"
        },
        {
            "#ResoAccoPresDRT": "5.3 Resolving and Accommodating Presuppositions in DRT"
        },
        {
            "#BornFailUnbo": "6. Born to fail, or unborn?"
        },
        {
            "#PresAtti": "7. Presuppositions and attitudes"
        },
        {
            "#PresVari": "8. Presupposition variability"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1 Characterizing Presupposition\n1.1 Introduction\n\nSpeakers take a lot for granted. That is, they presuppose\ninformation. As we wrote this, we presupposed that readers would\nunderstand English. We also presupposed as we wrote the last sentence,\nrepeated in (1), that there was a time when we wrote it, for otherwise\nthe fronted phrase “as we wrote this” would not have\nidentified a time interval.\n\n(1)\nAs we wrote this, we presupposed that readers would understand\nEnglish.\n\n\nFurther, we presupposed that the sentence was jointly authored, for\notherwise “we” would not have referred. And we presupposed\nthat readers would be able to identify the reference of\n“this”, i.e., the article itself. And we presupposed that\nthere would be at least two readers, for otherwise the bare plural\n“readers” would have been inappropriate. And so on.\n\nNote that some of these presuppositions arise by default from specific\nwords that we used. The existence of a time when we wrote the article\nis a requirement associated with our use of “as”. It is a\nrequirement built into the meaning of the temporal preposition\n“as”, which has a similar meaning to temporal \"while\",\nthat in a phrase “as X”, the\n“X” has to hold at some time. We say that\n“as” is a presupposition trigger. Similarly,\n“this” is a presupposition trigger requiring something\nsalient to refer to, the bare plural is a presupposition trigger\nrequiring existence of multiple individuals, and “would”\nis a presupposition trigger requiring a salient future or hypothetical\ncircumstance.\n\nIn contrast, some of the presuppositions above have nothing to do with\nthe meanings of any of those words. For example, we can say that the\npresupposition that the addressee speaks English, like the\npresupposition that the addressee is interested in what the speaker\n(or writer) has to say, is a conversational presupposition\nor, following Stalnaker (1972; 1974), speaker presupposition\nor pragmatic presupposition. The presuppositions associated\nwith specific triggers are said to be conventional or\nsemantic. The terminological distinction between semantic and\npragmatic presupposition is of theoretical import: as we will see\nlater, some theorists regard it as an open question whether there are\nany purely conventional presuppositions. A halfway house, suggested\nfor example by Karttunen (1973) and Soames (1982), is to define a\nnotion of utterance presupposition, thus involving a specific\nform that is uttered, but allowing that what is actually presupposed\nmay depend also on the attitudes of the speaker who utters it.\n\nIt is important to note that to call presuppositional expressions\n“conventional” or “semantic” is not\nnecessarily to imply that the presuppositions they trigger don’t\ndepend on the context in any way. For example, although\n“this” may be viewed as a conventional presupposition\ntrigger, the interpretation very much depends on the context, and the\npresupposition, although typically regarded as conventional, is\nnormally seen precisely as a constraint on the utterance context.\n\nWhat makes presuppositions special? That is, to the extent that\npresuppositions are just a part of the conventional meaning of some\nexpressions, what makes them sufficiently distinctive that they merit\ntheir own entries in handbooks and encyclopedias, as well as many\nhundreds of other articles and book chapters elsewhere? First,\npresuppositions are ubiquitous. And second, there are various respects\nin which the behavior of presuppositions differs sharply from other\naspects of meaning.\n\nAs regards the ubiquity of presuppositions, at least the following\nlexical classes and constructions are widely agreed to be\npresupposition triggers:\n\nfactives (Kiparsky and Kiparsky, 1970)\n\nBerlusconi knows that he is signing the end of Berlusconism.\n\n→ Berlusconi is signing the end of Berlusconism.\naspectual verbs (“stop, continue”) (Simons,\n2001; Abusch, 2002; Lorenz, 1992)\n\nChina has stopped stockpiling metals.\n\n→ China used to stockpile metals.\ntemporal clauses headed by “before”,\n“after”, “since”, etc. (Beaver and\nCondoravdi, 2003; Heinämäki, 1974)\n\nThe dude released this video before he went on a killing spree.\n\n→ The dude went on a killing spree.\nmanner adverbs (Abbott, 2000)\n\nJamie ducked quickly behind the wall.\n\n→ Jamie ducked behind the wall.\nsortally restricted predicates of various categories (e.g.,\n“bachelor”) (Thomason, 1972)\n\nJulius is a bachelor.\n\n→ Julius is an adult male.\ncleft sentences (Delin, 1995; Prince, 1986)\n\nIt was Jesus who set me free.\n\n→ Somebody set me free.\nquantifiers (Roberts, 1995; Gawron, 1995; Abusch and\nRooth, 2000; Cooper, 1983)\n\nI have written to every headmaster in Rochdale.\n\n→ There are headmasters in Rochdale.\ndefinite descriptions (Strawson, 1950)\n\nThe Prime Minister of Trinidad and Tobago stood up and wagged his\nfinger.\n\n→ Trinidad and Tobago have a (unique) prime minister.\nnames (van der Sandt, 1992)\n\nThe author is Julius Seidensticker.\n\n→ Julius Seidensticker exists.\nintonation (e.g., focus, contrast) (Jackendoff, 1972;\nGeurts and van der Sandt, 2004; Roberts, 1998)\n\nHE set me\n free.[1]\n\n→ Somebody set me free.\n\n\nAnd this is only a small sample of the words and syntactic\nconstructions that have been classified as presupposition triggers, so\neven if in some cases there may be doubts about this diagnosis, it can\nhardly be doubted that presupposition triggers abound in everyday\nlanguage. In the following sections we will discuss the behaviors\nwhich mark out presuppositions from ordinary entailments, and then\nintroduce some of the theories that have been developed to account for\nthose behaviors.\n1.2 Projection\n\nThe hallmark of presuppositions, as well as the most thoroughly\nstudied presuppositional phenomenon, is projection\n(Langendoen and Savin, 1971). Consider (2). This has all the\npresuppositions in (3). These presuppositions all follow from\nutterances of the base sentence in (2), as do the regular entailments\nin (4): someone who sincerely uttered (2) would certainly be expected\nto accept the truth of (3) and (4), as well:\n\n(2)\nIt’s the knave that stole the tarts.\n(3a)\nThere is a (salient and identifiable) knave.\n(3b)\nThere were (salient and identifiable) tarts.\n(3c)\nSomebody stole the tarts.\n(4a)\nThe knave did something illegal.\n(4b)\nThe knave took possession of the tarts.\n\n\nNow consider the sentences in (5):\n\n(5a)\nIt isn’t the knave that stole the tarts. (negation)\n(5b)\nIf it’s the knave that stole the tarts, he will be punished.\n(antecedent of a conditional)\n(5c)\nIs it the knave that stole the tarts? (question)\n(5d)\nMaybe/It is possible that it’s the knave that stole the tarts.\n(possibility modal)\n(5e)\nPresumably/probably it’s the knave that stole the tarts.\n(evidential modal, probability adverb)\n(5f)\nThe king thinks it’s the knave that stole the tarts. (belief\noperator)\n\n\nIn all these examples, sentence (2) is embedded under various\noperators. What is notable is that whereas the statements in (4) do\nnot follow from any of these embeddings (and would not be expected to\nfollow according to classical logics), the presuppositions do follow.\nWe say that the presuppositions are projected. Certainly, the\ninference is more robust in some cases than in others: while it is\nhard to imagine sincerely uttering (5a) without believing some tarts\nto be salient, it is easier to imagine a circumstance in which (5f)\ncould be uttered when in fact the tarts were not stolen, but hidden.\nBut in the absence of special factors, to which we will turn shortly,\nsomeone who sincerely uttered any of the sentences in (5) might be\nexpected to believe all of the presuppositions in (3a)–(3b).\n\nProjection from embeddings, especially negation, is standardly used as\na diagnostic for presupposition (hence the term “negation\ntest”). However it is important to try several types of\nembedding when testing for presupposition for a few different reasons.\nFirst of all, it is not always clear how to apply a given embedding\ndiagnostic. For example, although it is widely agreed that the\nadditive particle “too” is a presupposition-inducing\nexpression, the negation test is awkward to apply because it is not\nimmediately clear whether the negation outscopes the additive or\nvice versa in (6b), and it’s not obvious how the negation\ninteracts with focus:\n\n(6a)\nFred kissed BETTY, too.\n(6b)\nFred didn’t kiss BETTY, too.\n\n\nWe leave it as an exercise for the reader to show that embedding (6a)\nunder a different operator e.g., under a modal or in the antecedent of\na conditional, provides evidence that this sentence presupposes that\nsomeone other than Betty was kissed by Fred.\n\nAdditionally, some inferences seem to project from negation but not\nother embeddings. For example, both (7a) and (7b) seem to presuppose\nthat the speaker has sensory experience with the pie, and this type of\ndata has led some to conjecture that uses of predicates of personal\ntaste are associated with a presupposition that the judgment of taste\nresulted from direct\n experience.[2]\n However, we don’t get any projection of this inference from the\nconditional in (7c), and example (7d) seems to imply that the speaker\nhas not tasted the pie themselves. This data suggests that any account\nclaiming a presupposition of direct experience for predicates of\npersonal taste needs to be highly nuanced.\n\n(7a)\nThe pie is tasty.\n(7b)\nThe pie isn’t tasty.\n(7c)\nIf the pie is tasty, it will go quickly.\n(7d)\nIs the pie tasty?\n\n\nMore generally, such examples demonstrate why it’s important to look\nat a wide range of embeddings when identifying presuppositions on the\nbasis of their projection behavior.\n1.3 Cancellability\n\nWhat makes the “projection problem” problematic? If some\npart of the meaning of an expression α was never affected by the\nlinguistic context in which α was embedded, that would be\nphilosophically interesting, and would demand a theoretical\nexplanation, but it would at least be trivial to completely describe\nthe data: all presuppositional inferences would survive any embedding,\nend of story. But that isn’t what happens. Presuppositions typically\nproject, but often do not, and most of the empirical and theoretical\nwork on presupposition since the 1970s has been taken up with the task\nof describing and explaining when presuppositions project, and when\nthey don’t.\n\nWhen a presupposition does not project, it is sometimes said to be\n“cancelled”. The classic cases of cancellation occur when\nthe presupposition is directly denied, as in the following variants of\nsome of the sentences in (5):\n\n(8a)\nIn this court, it isn’t the knave that steals the tarts: the king\nemploys no knaves precisely because he suspects they are responsible\nfor large-scale tart-loss across his kingdom.\n(8b)\nIf it’s the knave that stole the tarts, then I’m a Dutchman: there\nis no knave here.\n(8c)\nIs it the knave that stole the tarts? Certainly not: there is no\nknave here.\n(8d)\nThe king thinks it’s the knave that stole the tarts, but he’s\nobviously gone mad, since there is no knave here.\n\n\nPresuppositional inferences are typically subject to cancellation by\ndirect denial only when the presupposition trigger is embedded under\nsome other operator. When the presupposition is not embedded, such\ncancellation (by the same speaker) is usually infelicitous, just as is\ncancellation of entailed content which is not embedded. Thus the\ndenial of a presupposition in (9) and the denial of an ordinary\nentailment in (10) both lead to pragmatically infelicitous utterances\n(marked by a “#”).\n\n(9)\n#It’s the knave that stole the tarts, but there is no knave.\n\n\n(10)\n#It’s the knave that stole the tarts, but he didn’t do anything\nillegal.\n\n\nThe fact that presuppositions associated with unembedded triggers are\nnot cancellable, except in an outright retraction of what the speaker\nhas previously claimed, is one of the features that distinguishes most\npresuppositions from Gricean conversational implicatures (Grice,\n1989). For example, an utterance of (11a) might ordinarily lead to the\nso-called scalar implicature in (11b). But while this implicature is\ncancellable, as in (11c), the presupposition that there is a knave,\nonce again, is not cancellable, as shown by the oddity of (11d).\n\n(11a)\nThe knave stole most of the tarts.\n(11b)\nThe knave did not steal all of the tarts.\n(11c)\nThe knave stole most of the tarts—in fact, he stole them\nall.\n(11d)\n#The knave stole most of the tarts, but there was no knave.\n\n\nWe can summarize the typical behavior of entailments, presuppositions,\nand conversational implicatures as follows:\n\n\n \nEntailments\nPresuppositions\nImplicatures \n\nProject from embeddings\nno\nyes\nno \n\nCancellable when embedded\n—\nyes\n— \n\nCancellable when unembedded\nno\nno\nyes \n\n\nBecause presuppositions are typically only cancellable when embedded,\nGazdar (1979a, 1979b) argues that presuppositions are usually entailed\nwhen the trigger is not embedded.\n\nThe literature is choc-a-bloc with examples of presuppositional\ninferences apparently disappearing. Whether such examples are\nappropriately described as involving cancellation is partly a\ntheoretical decision, and, as we will see, many scholars avoid using\nthe term “cancellation” for some or all such cases. One\nreason for this is that the term “cancellation” appears to\nsuggest that an inference has been made, and then removed. But in many\ncases there are theoretical reasons not to regard it as an apt\ncharacterization, and in considering early views on presupposition in\nthe next section, we will come across one class of such cases\n(specifically, cases involving hypothetical reasoning in\nconditionals).\n2. The Frege-Strawson tradition\n\nThe early literature on presupposition almost exclusively revolved\naround definite descriptions, which are said to presuppose the\nexistence of a unique referent. A problem arises when a definite\ndescription, like the King of France, fails to refer. Russell\n(1905) claimed that sentences like \"The King of France is bald\" are\nfalse because the logical form of definite descriptions contains a\nfalse existential claim. However, Strawson (1950) famously argued\nagainst Russell’s theory by proposing that when a definite description\nfails to refer, the result can be a sentence which lacks a truth\nvalue. Thus presuppositions are understood as definedness conditions,\nnecessary requirements for an expression to have a meaning.\n\nStrawson’s intuition, which can be traced back to Frege (1892), leads\nto the following\n definition:[3]\n\nDefinition 1 (Strawsonian presupposition)\n\nOne sentence presupposes another iff whenever the first is true\nor false, the second is true.\n\nAnother definition that is often used is this:\n\nDefinition 2 (Presupposition via negation)\n\nOne sentence presupposes another iff whenever the first\nsentence is true, the second is true, and whenever the negation of the\nfirst sentence is true, the second sentence is\n true.[4]\n\nhese two definitions are equivalent if negation maps true onto false,\nfalse onto true, and is undefined when its argument is undefined.\nHowever, the second definition is notable in the context of the above\ndiscussion of projection, because it seems to directly encode the\nprojection properties of at least one operator: negation.\nSpecifically, it says that presuppositions are inferences that survive\nembedding under\n negation.[5]\n\nIt is clear that if the above assumptions about presupposition are\nmade, then the presuppositions of a sentence will be the same as the\npresuppositions of the negation of the sentence. But what about\nprojection from embeddings other than negation? A very simple account\nof projection is based on the cumulative hypothesis, first\ndiscussed by Morgan (1969) and Langendoen and Savin (1971). This is\nthe idea that presuppositions always project from embedding, as if\nthere were no effects like cancellation. A trivalent semantics that\nyields this behavior is obtained by using the Weak Kleene\nconnectives (Kleene, 1952). Assume (for all the partial/multivalent\nsemantics given in this article) that for classically valued\narguments, the connectives behave classically. Then Weak Kleene\nconnectives (also known as the Bochvar Internal connectives) are\ndefined as follows:\n\nDefinition 3 (Weak Kleene)\n\nIf any argument of a sentence with a Weak Kleene connective lacks a\nclassical truth value, then the sentence as a whole lacks a truth\nvalue.\n\n\nWeak Kleene fails as a theory of presupposition because it entails\nthat presuppositions project uniformly, whereas in fact they do not.\nAnother system of Kleene’s, the Strong Kleene connectives, does not\nhave this property:\n\nDefinition 4 (Strong Kleene)\n\nIf the classically-valued arguments of a sentence with a Strong Kleene\nconnective would suffice to determine a truth value in standard logic,\nthen the sentence as a whole has that value; otherwise it doesn’t have\na classical value.\n\n\nFor example, in classical logic a conjunction is bound to be false if\none of its conjuncts is false, and therefore the same holds for Strong\nKleene “and”. Similarly, since in classical logic a\ndisjunction must be true if one of its disjuncts is true, the same\nholds for Strong Kleene “or”. We obtain the following\ntruth tables for the main binary connectives:\n\n\nConjunction\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\nf \n\n✭\n✭\nf\n✭ \n \nDisjunction\n\n\n\nφ ∨ ψ\nt\nf\n✭ \n\nt\nt\nt\nt \n\nf\nt\nf\n✭ \n\n✭\nt\n✭\n✭ \n \nImplication\n\n\n\nφ → ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nt\nt\nt \n\n✭\nt\n✭\n✭ \n  \n\n\nNow consider the following example:\n\n(12)\nIf there is a knave, then the knave stole the tarts.\n\n\nLet’s ignore all presupposition triggers in (12) save “the\nknave”, and show that Strong Kleene predicts that the sentence\nas a whole does not presuppose that there is a knave. Using Definition\n1, it suffices to find at least one model where (12) has a classical\ntruth value, but in which there is no knave. This is easy: in such a\nmodel, the antecedent is false, and inspection of the above Strong\nKleene table shows that when the antecedent of a conditional is false,\nthe conditional is true, as would be the case classically. In fact,\nStrong Kleene predicts no presupposition for (12). This is in\ncontradistinction to Weak Kleene, which would fail to give (12) a\nclassical value in knave-less models, and hence predict that (12)\npresupposes the existence of a knave.\n\nThere are other cases where Strong Kleene does predict a\npresupposition, and the presupposition predicted is not what we might\nhave expected. Thus Strong Kleene gives (13a) a classical truth value\nin all models where there is a knave, and in all models where there\nwas trouble. So while we might have expected the presupposition in\n(13b), Strong Kleene predicts the presupposition in\n (13c).[6]\n We will return to this issue shortly.\n\n(13a)\nIf the knave stole the tarts, then there was trouble.\n(13b)\nThere is a knave.\n(13c)\nIf there was no trouble, then there is a knave.\n\n\nMuch of the discussion of partial and multivalent approaches to\npresupposition over the last three decades has centered on the\ntreatment of\n negation.[7]\n Specifically, the issue has been the treatment of cancellation\nexamples like (14).\n\n(14)\nThe tarts were not stolen by the knave: there is no knave.\n\n\nA standard approach is to propose that negation is ambiguous between a\npresupposition-preserving negation and a presupposition-denying\nnegation; see e.g., the discussion by Horn (1985, 1989). The\npresupposition-preserving negation (aka choice negation) we\nhave already seen, and it is found in both the Weak and Strong Kleene\nsystems. The presupposition-denying (or exclusion) negation\nis typically taken to map true to false and false to true, as usual,\nbut also to map an argument lacking a classical value to true. Thus if\n(14) is interpreted in a model where there is no knave, but\n“not” is understood as a presupposition-denying negation,\nthen “the tarts were stolen by the knave” would lack a\nclassical value, but “The tarts were not stolen by the\nknave”, and (14) as a whole, would be true.\n3. Pragmatic presupposition\n\nProbably the most significant philosophical counterpoint to the\nFrege-Strawson approach to presupposition, other than the original\nnon-presuppositional work of Russell, is due to Stalnaker (1972, 1973,\n1974), and later clarified in Stalnaker\n (1998).[8]\n Stalnaker suggests that a pragmatic notion of presupposition is\nneeded, so that the proper object of philosophical study is not what\nwords or sentences presuppose, but what people presuppose when they\nare speaking. A pragmatic presupposition associated with a sentence is\na condition that a speaker would normally expect to hold in the common\nground between discourse participants when that sentence is\n uttered.[9]\n\nOne consequence of Stalnaker’s view is that, contra semantic\naccounts of presupposition, presupposition failure need not produce a\nsemantic catastrophe. There are, however, two weaker types of failure\nthat can occur: (i) a speaker uttering some sentence\nS can fail to assume that some proposition P is in\nthe common ground, even though most utterances of S would be\naccompanied by the presupposition that P; and (ii) a\nspeaker can presuppose something that is not in the common ground. We\nsee these two types of failure respectively in (15a), where there is\nno presupposition that Mullah Omar is alive, and (15b) where it is\npresupposed that Luke was alive.\n\n(15a)\nI don’t know that Mullah Omar is alive. I don’t know if he’s dead\neither. (General Dan McNeill, Reuters, 19 May 2008)\n(15b)\nVader didn’t know that Luke was alive, so he had no intentions of\nconverting Luke to the Sith. (Web example)\n\n\nThese examples involve a subclass of factive verbs called\n\"semifactives,\" which Karttunen (1971b) concluded only trigger a\npresupposition in some person and tense forms. As Karttunen himself\nrealized, such a stipulation is unmotivated. For Stalnaker’s pragmatic\naccount of presupposition, these examples are not problematic; the\nverb \"know\" need not presuppose that its complement is true. When an\naddressee hears the first sentence of (15a), he will realize that if\nit were in the common ground that Mullah Omar was alive, then the\nspeaker would know this, and so the speaker’s claim would be false.\nTherefore the hearer can reason that the speaker is not presupposing\nthe complement of “know” to be true. On the other hand,\nwhen a hearer is confronted by (15b), it is consistent to assume that\nLuke was alive. Since speakers using “know” typically\npresuppose the truth of the complement, we can assume that this is the\ncase here.\n\nStalnaker’s work was part of an avalanche of pragmatic attacks on the\nsemantic conception of presupposition. Working in the immediate\naftermath of Grice’s 1967 William James \n lectures[10],\n accounts like Atlas (1976; 1977; 1979), Atlas and Levinson (1981),\nKempson (1975), Wilson (1975), and Böer and Lycan (1976) all\npresent detailed arguments that presuppositions should be understood\nas something akin to conversational implicatures. Generally speaking,\nthese approaches justify presuppositional inferences by using the\nmaxims of relevance and quantity. Thus, for example, Atlas (1976)\nsuggests that an embedding of a definite under a negation will tend to\nproduce a meaning that is ruled out as insufficiently strong to\nsatisfy the maxim of quantity, unless it is strengthened by treating\nthe definite as if it had wide scope and could act referentially.\nContemporary descendants of this pragmatic tradition include Abbott\n(2000; 2006; 2008), Simons (2001; 2003; 2004; 2006; 2007), and\nSchlenker (2007; 2008). Both Abbott and Simons are at pains to\ndistinguish between different presupposition triggers, rather than\nlumping them all together. Thus Simons, for example, makes a case for\nderiving presuppositional inferences associated with factives and\naspectual adverbs using a combination of Stalnakerian and Gricean\nreasoning, allowing that typically anaphoric triggers like the\nadditive “too” might function conventionally. On the other\nhand, Schlenker’s pragmatic derivation of projection properties, using\nboth standard maxims and at least one rule specific to\n presuppositions[11],\n does not make fine-grained distinctions between presupposition\ntriggers.\n\nThere is a contrast among pragmatic approaches to presupposition as\nregards whether the source of presuppositions is discussed. The\napproaches mentioned in the preceding paragraph, which attempt to\nderive presuppositional inferences from general conversational\nprinciples, aim to explain both the source of presuppositions, and the\nphenomenon of projection. But Stalnaker made no attempt whatsoever to\nexplain where presuppositions came from, beyond indicating that they\nare inferential tendencies that might or might not be associated with\nsemantic presuppositions. This emphasis on the projection of\npresuppositions rather than their source, which holds also of the\ncontemporaneous work by Karttunen (1974; 1973), to which we shall turn\nshortly, lived on in much of the work influenced by these theories. It\nis particularly obvious in what we can collectively term\ncancellation-based theories of presupposition, led by Gazdar\n(1979a; 1979b), and including Soames (1979; 1982), Mercer (1987;\n1992), Gunji (1981), Marcu (1994), Horton (1987), Horton and Hirst\n(1988), Bridge (1991), and van der Sandt (1982; 1988).\n\nCancellation accounts can be traced back in spirit to Stalnaker’s\naccount of semifactives, discussed above, in which presuppositions are\ndefeated by competing conversational inferences: the general idea is\nsimply to make presuppositions into defaults, and wipe them out\nwhenever they would cause pragmatic embarrassment. Gazdar provided a\nremarkably straightforward formalization of this account, as well as\nextending to many other projection phenomena, based on a general\nprinciple he characterizes as “All the news that fits”. In\nGazdar’s model, the strategy for a hearer is first to identify sets of\nentailments, conversational implicatures, and presuppositions, and\nthen to try adding them to the speaker’s set of commitments.\n\nDefinition 5 (Gazdar: cancellation)\n\nImplicatures and entailments defeat presuppositions, so a hearer adds\nto his or her commitments only those presuppositions that are\ncompatible with both implicatures and entailments. All remaining\npresuppositions are cancelled.\n\n\nConsider (16a), and assume there are no relevant pre-existing\ncommitments:\n\n(16a)\nIf the king is angry, then the knave stole the tarts.\n(16b)\nIf there is a knave, then the knave stole the tarts.\n\n\nAccording to Gazdar, (16a) entails that if there is an angry king then\nthere is a knave and he stole some set of tarts. (This much all\ntheories agree on; some theories may predict stronger entailments.)\nThe set of implicatures would include the clausal implicature that the\nspeaker doesn’t know whether a king is angry, and doesn’t know whether\na knave stole tarts. The presuppositions (or “potential\npresuppositions”, in Gazdar’s terms) are that there is a unique\nking, a unique knave, and a unique set of tarts. The hearer proceeds\nby adding the entailments to (their representation of) the speaker’s\ncommitment set, then adding whatever implicatures fit in, and then\nadding the presuppositions that fit after that. In this case, all the\nentailments, implicatures, and presuppositions are consistent, and all\ncan be added without any being cancelled.\n\nBut now consider (16b), repeated from (12). Here there is an\nimplicature that the speaker doesn’t know whether there is a knave.\nThe hearer accepts this and other implicatures, and then considers the\npresuppositions that there is a knave and that there are some tarts.\nThe presupposition that there are tarts is unproblematic, and is\nadded, but the hearer cannot consistently add the presupposition that\nthere is a knave. So this presupposition is canceled, and (16b) does\nnot presuppose that there is a knave. Hence, according to Gazdar,\npresuppositions are sometimes blocked by conversational\nimplicatures.\n\nWithin the space of cancellation-based accounts of presupposition, it\nis hard to beat Gazdar’s for its conceptual and technical simplicity,\nand its empirical coverage. Some conceptual questions remain, however,\nsuch as why it should be that presuppositions are the last\nthings to be added in the process of updating commitments. Van der\nSandt’s (1982, 1988) reformulation of the cancellation model gives us\nan alternative way to think about this, by modeling projection in\nterms of whether presuppositions could have come first.\n\nDefinition 6 (Van der Sandt: cancellation)\n\nProject only those presuppositions that could be conjoined to the\nbeginning of the sentence while leaving the utterance consistent with\n(neo-Gricean) conversational\n principles.[12]\n\n\nThe intuitive idea underlying van der Sandt’s proposal is that\npresuppositions are given information, and in this sense\n“precede” their carrier sentences, if not de\nfacto then at least de jure, in the sense that the\ncontext would have legitimated their presence. In the case of (16),\nfronting the presupposition that there are some tarts yields the\nsentences in (17).\n\n(17a)\nThere are some tarts and if the king is angry then the knave stole\nthe tarts.\n(17b)\nThere are some tarts and if there is a knave, then the knave stole\nthe tarts.\n\n\nThe fronting of the presupposition does not lead to a clash with any\nGricean principles, so the presuppositions are predicted to project in\n(16a) and (16b). Similarly, fronting the presupposition that there is\na knave to (16a), as in (18a), produces no clash, so (16a) presupposes\nthat there is a knave. But adding the presupposition that there is a\nknave to (16b), as in (18b), does result in a clash: since (18b) is\ntruth-conditionally equivalent to the simple conjunction “there\nis a knave and the knave stole the tarts”, it is redundant,\nconflicting with the requirement of brevity in Grice’s Maxim of\nManner. On van der Sandt’s analysis, if fronting a presupposition\nwould produce a redundant result, then that presupposition cannot\nproject. So (16b) is correctly predicted not to presuppose that there\nis a knave.\n\n(18a)\nThere is a knave and if the king is angry then the knave stole the\ntarts.\n(18b)\nThere is a knave and if there is a knave, then the knave stole the\ntarts.\n\n\nIt should be noted, however, that even if (18b) is redundant, it is\narguably a felicitous discourse, and therefore some subtlety is needed\nin applying van der Sandt’s cancellation principle in the simplified\nform above. The issue is not simply whether a discourse is felicitous,\nbut whether there is any clash with the maxims. And this will of\ncourse depend on how exactly the maxims are formulated. But for the\npurposes of understanding the intention of van der Sandt’s analysis,\nwe can take it that though an utterance of (18b) could be felicitous,\nit would be a case of flouting (in Grice’s sense), a case\nwhere a maxim is disobeyed in order to preserve some greater\nconversational goal.\n\nA more recent pragmatic approach situates presuppositions in a wider\ntaxonomy of projective content based on the property of\nat-issueness. Once we’ve identified the QUD, we can identify\ncontent that is meant to be relevant towards answering it. In other\nwords, content that is at-issue. Simons et al (2010) propose that\nthis pragmatic property is relevant to projection such that only\nnot-at-issue content projects.\n\nDefinition 7 (Cancellation via at-issueness)\n\nProject only those presuppositions that are not-at-issue.\n\nConsider examples (19) and (20) from Beaver (2010). These examples\ninvolve the factive verb \"discover\", and hence are expected to trigger\na presupposition that its complement is true, i.e. that the\naddressee’s work is plagiarized. In (19), where \"discover\" is\nstressed, this presupposition seems to project, with the implication\nthat, absent the T.A. finding out what’s going on, the speaker is\nprepared to overlook the plagiarism. In this case, we might say that\nwhat is at-issue is the question of whether the T.A. finds out about\nthe plagiarism. However, in (20), where stress in on \"plagiarized\", it\nis far less clear whether the speaker believes the addressee’s work is\nplagiarized. This can be explained if stress on \"plagiarized\" is\nmarking the proposition that the work is plagiarized as at-issue. So,\nthe generalization in Definition 7 predicts that this proposition does\nnot project.\n\n(19)\nIf the T.A. disCOVers that your work is plagiarized, I will be\nforced to notify the Dean.\n(20)\nIf the T.A. discovers that your work is PLAgiarized, I will be\nforced to notify the Dean.\n\n\nPragmatic approaches to presupposition take the burden of projection\noff conventional triggering and allow for discourse structure to\ninfluence projection when triggers are placed in different contexts.\nOne consequence of this view is that it can be applied\ncross-lingustically (e.g. Tonhauser et al 2013) without running into\nthe issue of language-specific conventionalized triggers. Additionally\nit allows us to account for the projection of expressions that don’t\ndisplay other properties that we associate with presupposition, for\nexample appositives, expressives and honorifics (Potts 2005). In other\nwords, there’s a reason why some things that aren’t presuppositions\nstill behave like them.\n\nA new trend of psycholinguistic research potentially offers some\npromising new evidence about the degree to which presuppositions are\nprocessed like pragmatic inferences or semantic entailments. The\nmethods in these studies typically rely on identifying at what point\nduring the processing of an utterance presuppositions become available\nto the listener. The line of reasoning goes like this: if\npresuppositions are conventionally encoded in their triggers and are\nconditions for contexts to update, they should arise immediately when\na trigger is used. However, if presuppositions are the result of\npragmatic reasoning, there should be a delay in their processing.\nWhile the results of these studies have been somewhat inconsistent,\nthey largely suggest that presuppositions are processed immediately.\nFor example, one of the experiments in Tiemann et al. (2011) finds\nthat presupposition triggers themselves carry a processing cost\nrelative to other non-presuppositional expressions. In an eye-tracking\nstudy, Kim (2008) finds that there are shifts in eye movements quite\nrapidly after the utterance of the trigger only. These\nstudies and the methodologies used in them are still relatively\nnew. However, empirical work on the processing of presuppositions\nremains a promising strand of research in determining the extent to\nwhich we can consider presuppositions to be conventional\n4. Local contexts and the dynamic turn\n\nIn static theories of meaning, such as the trivalent accounts of\npresupposition discussed above, when a sentence is interpreted in a\ngiven context, every expression in that sentence is interpreted\nrelative to that same context. In dynamic theories of meaning, the\ncontext is allowed to change as a sentence is interpreted. The\nearliest and perhaps still clearest motivation for this dynamism is\nwhat might be termed the anaphoric asymmetry. The anaphoric\nasymmetry consists in pronouns across languages being usually resolved\nto expressions that have already occurred, and only being resolved\ncataphorically to expressions that occur later in the sentence in\nquite special configurations. The dynamic explanation for this is that\npronouns are resolved to referents via the context, and that the\ncontext is updated during processing so that it typically only\ncontains information about things that have already been mentioned.\nThe question might then be asked: how does the processing of anaphora\nrelate to the processing of presuppositions? It turns out that there\nare remarkably strong parallels between phenomena involving anaphora\nand presupposition, and this in turn provides a motivation for\nconsidering not only anaphora but also presupposition to be an\nintrinsically dynamic phenomenon. In this section, we will first study\nthe parallels between presupposition and anaphora, seen as a possible\nmotivation for considering context change in analyzing presupposition,\nand then describe in largely historical terms the sequence of\ndevelopments that led to contemporary dynamic theories.\n4.1 Presupposition and anaphora\n\nWhile a number of authors have noted that presuppositions behave in\nsome respects like anaphors (e.g., Kripke 2009 and Soames 1989), it\nwas van der Sandt (1989; 1992) who brought out the connection the most\nforcefully. He noted that for every configuration of anaphors and\nantecedents where a pronoun is interpreted anaphorically but is not\ninterpretable as a bound variable, a similar configuration is possible\nwith\n presuppositions.[13]\n In each of the following quadruples, we illustrate some configuration\nin the (a) and (b) examples, while the (c) and (d) cases show that a\nslight divergence from the original configurations (i.e. those in (a)\nand (b)), produces infelicity. Note that the (a) and (c) examples\ninclude an anaphoric pronoun (“it”), and the (b) and (d)\nexamples include the factive verb “knows”, which triggers\na presupposition that its propositional complement is true (i.e., that\nFred left). So, anaphora is felicitous in configurations in which\npresuppositions are felicitous, and anaphora is infelicitous in\nconfigurations in which presuppositions are infelicitous. It is clear\nthat connections between anaphoric pronouns and their antecedents on\nthe one hand, and presupposition triggers and their antecedents on the\nother, are sensitive to very similar configurational requirements.\nInter-sentential (discourse) anaphora\n\n(21a)\n There was a storm. It was fierce.\n(21b)\nFred left. Mary knows that Fred left.\n(21c)\n#It was fierce. There was a storm.\n(21d)\n#Mary knows that Fred left. Fred left.\n\nDonkey anaphora\n\n(22a)\nIf a farmer owns a donkey then he beats it.\n(22b)\nIf Fred left then Mary knows that Fred left.\n(22c)\n#If a farmer doesn’t own a donkey, then he beats it.\n(22d)\n#If Fred didn’t leave left then Mary knows that Fred left.\n\nModal subordination\n\n(23a)\nA wolf might come to the door. It would eat you.\n(23b)\nFred might have left. Mary would know that Fred has left.\n(23c)\n#A wolf might come to the door. It’s brown.\n(23d)\n#Fred might have left. Mary knows that Fred has left.\n\nBathroom anaphora\n\n(24a)\nEither there’s no bathroom in this house, or else it’s in a\nfunny place.\n(24b)\nEither Fred didn’t leave, or else Mary knows that he left.\n(24c)\n#Either there is a bathroom, or else it’s in a funny place.\n(24d)\n#Either Fred left, or else Mary knows that he left.\n\n4.2 Satisfaction in local contexts\n\nAs previously noted, early work on presupposition was primarily\nfocused on definite descriptions, and definite descriptions have\ncontinued to be the paradigmatic example of a presupposition trigger\nin philosophical literature over the last fifty years. However, by the\nearly 1970s, more linguistically oriented work had expanded the\nempirical domain of presupposition theory from definite descriptions\nto other trigger types, including factives (Kiparsky and Kiparsky,\n1970), implicatives (Karttunen, 1971a), focus particles (Horn, 1969),\nverbs of judging (Fillmore, 1971) and sortal constraints (Thomason,\n1972). Stalnaker’s discussion of Karttunen’s semifactives provides an\nearly example of how this linguistic expansion of the empirical domain\nhas impacted philosophical work. Also by the early 1970s, linguists\nhad expanded the empirical domain in another direction. The\nphilosophical literature was largely oriented towards unembedded\npresupposition triggers and triggers under negation, but as we have\nalready mentioned, Morgan (1969) and Langendoen and Savin (1971)\ngeneralized the issue by considering arbitrary embeddings. However, it\nwas not until Karttunen (1973) that the full complexity of the\nprojection problem became apparent. By methodically considering\nprojection behavior construction by construction, Karttunen showed\nthat there was more variation in projection behavior than had been\npreviously described, making it quite clear that none of the extant\nFrege-Strawson derived systems could hope to cover every case, and\nthis ultimately led to the application of dynamic models of meaning to\nthe problem of presupposition projection.\n\nKarttunen (1973) presented a taxonomy of embedding constructions that\ndivided them into three classes: plugs, holes and\nfilters. Plugs comprise a class of predicates and operators\nwhich Karttunen claimed block the projection of presuppositions, while\nholes are a class of predicates and operators which allow\npresuppositions to project freely. So, for example, since “told\nthat” is a plug, according to\n Karttunen,[14]\n (25) is predicted not to presuppose that there is a King of France.\nOn the other hand, since “perhaps” is a hole, (26) is\npredicted to presuppose that there is a King of France.\n\n(25)\nMary told Jim that the King of France was bald.\n\n\n(26)\nPerhaps the King of France is bald.\n\n\nKarttunen’s filters include the binary logical connectives “if\nthen”, “and”, and “or”. The intuition\nbehind the filter metaphor is that these constructions allow only some\npresuppositions to project, others being caught in the filter, and we\nhave already seen examples of this phenomenon. Thus example (12)\nshowed that sometimes a presupposition in the consequent of a\nconditional does not project: here the presupposition that there was a\nknave is filtered out. But the same example includes an occurrence of\nthe definite “the tarts” in the consequent, and the\npresupposition that there are (or at least were) some tarts projects\nfrom the conditional. Karttunen concluded that the consequent of a\nconditional acts as a hole to some presuppositions, but filters out\nall those presuppositions which are entailed by the antecedent, or,\nmore generally, by a combination of the antecedent and contextually\nsupplied background information.\n\nKarttunen’s key example showing the role of context bears\nrepetition:\n\n(27)\nEither Geraldine is not a mormon or she has given up wearing her\nholy underwear.\n\n\nThe second half of (27) contains (at least) two presupposition\ntriggers: the definite description “her holy underwear”\nand the aspectual verb “give up”, which trigger the\npresuppositions that Geraldine used to have and wear holy underwear,\nrespectively. Karttunen’s filtering condition for disjunctions removes\nfrom the right disjunct any presuppositions that are entailed by a\ncombination of the context and the negation of the left disjunct. Now\nconsider a context supporting the proposition that all mormons have\nholy underwear which they wear regularly. It follows from this\nproposition and the negation of the left disjunct, i.e., the\nproposition that Geraldine is a mormon, that Geraldine has holy\nunderwear and has worn it regularly. But these are exactly the\npresuppositions triggered in the right disjunct, so they are filtered\nout. It follows that (27) has no presuppositions.\n\nKarttunen’s (1973) account is of interest not only for its triptych of\nplugs, holes and filters, but also because it sets the background for\na crucial shift of perspective in Karttunen (1974), and thence to the\ndynamic approaches to presupposition that have been dominant in recent\nyears. What remained unclear in the 1973 paper was the motivation for\nfiltering, i.e. why presuppositions should be filtered out when\nentailed by other material. Karttunen (1974) suggests an alternative\nconception based on the idea of local contexts of evaluation.\nThe idea is that the parts of a sentence are not necessarily evaluated\nwith respect to the same context as that in which the sentence as a\nwhole is evaluated: a local context may contain more\ninformation than the global context. For example, when\nevaluating a conjunction, the second conjunct is evaluated in a local\ncontext which contains not only the information in the global context,\nbut also whatever information was given by the first conjunct.\nKarttunen (1974) defines local contexts of evaluation for a range of\nconstructions, and suggests the following requirement: presuppositions\nalways need to be entailed (or “satisfied”, as he put it)\nin the local context in which the trigger is evaluated. Given this\nrequirement, the overall presuppositions of a sentence will just be\nwhatever propositions must be in a context of an utterance in order to\nguarantee that the requirements associated with presupposition\ntriggers are satisfied in their local contexts of interpretation.\n\nKarttunen spelled out how local satisfaction should be calculated\nseparately for each connective and operator he considered. However,\nrecent developments in Schlenker (2008) provide a general way of\ncalculating what the local context should be. In the following\nreformulation of Karttunen’s model we incorporate Schlenker’s insights\nalong the lines proposed by Beaver (2008).\n\nLet us say that some clause in a complex sentence is\nredundant relative to some context of utterance if you can\nreplace that clause by a tautology without affecting the amount of\nfactual information conveyed by the sentence in that context. For\nexample, in (28), the first conjunct is redundant in any context of\nutterance. Here, the same factual information would be conveyed by\n“Mary is Mary and Mary owns a sheep”, where the first\nconjunct is replaced by the tautology “Mary is Mary”.\n\n(28)\nMary owns an animal and Mary owns a sheep.\n\n\nNow let us say that a clause is left-redundant if it is\npossible to tell by looking at the material in the sentence to the\nleft of the clause that the clause is redundant. So “Mary owns\nan animal” is not left-redundant in (28) (except if the context\nof utterance already entails that Mary owns an animal), because there\nis no material before that clause, implying that it is impossible to\ntell by looking at material to the left of the clause that the clause\nis redundant. On the other hand, the same sentential fragment,\n“Mary owns an animal”, is left-redundant in (29) and also\nin (20):\n\n(29)\nMary owns a sheep and Mary owns an animal. (Truth-conditionally\nequivalent to: Mary owns a sheep and Mary is Mary)\n\n\n(30)\nIf Mary owns a sheep then Mary owns an animal.\n(Truth-conditionally equivalent to: If Mary owns a sheep then\nMary is Mary)\n\n\nNow we use this idea of left redundancy, which echoes the above van\nder Sandt analysis of the effect of fronting presuppositions, to\ndefine the crucial notion in Karttunen’s (1974) account.\n\nDefinition 8 (Karttunen/Schlenker: Presupposition via\nsatisfaction)\n\nA presupposition P is satisfied at point X\nin S iff P would be left-redundant if added at point\nX. A sentence presupposes whatever propositions must hold in\nglobal contexts of utterance such that each locally triggered\npresupposition is satisfied where its trigger occurs.\n\n\nAs an example, let us consider the presuppositions predicted for (27),\nrepeated below:\n\n(27)\nEither Geraldine is not a mormon or she has given up wearing her\nholy underwear.\n\n\nNote first that for all sentences of the form “A or\nB”, the negation of A is satisfied within the\nright disjunct. So “Geraldine is a mormon” is satisfied in\nthe right disjunct of (27). And more generally, anything entailed by a\ncombination of propositions in the context and the negation of the\nleft disjunct will be satisfied in the right disjunct. Now, let us\nconsider the clause “she has given up wearing her holy\nunderwear”: we take this to trigger the presupposition that\nGeraldine has had holy underwear that she wore. This presupposition\nwill be satisfied provided the global context of utterance, combined\nwith the negation of the left disjunct, entails that she has had holy\nunderwear that she wore. And classically this will be the case if and\nonly if the context supports the conditional “if Geraldine is a\nmormon, then she has had holy underwear that she wore” (which\nwould also be the case if the context supported something stronger).\nHence, this conditional is the presupposition Karttunen (1974)\npredicts for (27).\n\nOne notable property of Karttunen’s 1974 treatment of examples like\n(27), a property not found in his 1973 model, is that the\npresupposition predicted is conditionalized. That is, (27) is not\npredicted to presuppose that Geraldine has had holy underwear that she\nwore, but that if she is a mormon then she has had such underwear. We\nalready encountered such conditionalized presuppositions in our\ndiscussion of Strong Kleene; in fact, Strong Kleene predicts exactly\nthe same conditionalized presupposition in this case. Karttunen’s 1974\nmodel also predicts conditionalized presuppositions when the\npresupposition trigger is in the right conjunct of a conjunction, or\nin the consequent of a\n conditional.[15]\n Thus in (16a), repeated below, the presuppositions predicted are that\nthere is a king (since presuppositions triggered in the antecedent are\nnot conditionalized), and that if the king is angry, then there is a\nknave. In (16b), the conditional presupposition (that if there is a\nknave, then there is a knave) is trivial, so in effect there is no net\n presupposition.[16]\n\n(16a)\nIf the king is angry then the knave stole the tarts.\n(16b)\nIf there is a knave, then the knave stole the tarts.\n\n\nAlthough Karttunen’s (1974) model is distinct conceptually from any of\nits predecessors, we have already noted that it shares at least some\npredictions with Strong Kleene. An observation made by Peters (1979)\nshowed that the 1974 model is surprisingly closely related to the\nsemantic accounts of presupposition discussed above. In particular,\nPeters showed that Karttunen’s way of calculating presuppositions for\nthe truth conditional connectives is equivalent to what would be\nobtained within a three-valued logic, but with special non-symmetric\nconnectives. Here is a general way of defining the Peters Connectives,\ninspired both by Schlenker (2009; 2008) and George (2008):\n\nDefinition 9 (Middle Kleene/Peters connectives)\n\nGo from left to right through the sentence. For each argument\nX that takes a non-classical value, check whether on the\nbasis of material on its left, assigning an arbitrary classical value\nto X could conceivably have an effect on the overall value.\nIf so, the sentence as a whole lacks a classical truth value. If not,\njust assign X an arbitrary value, and carry on. If this\nprocedure allows all non-classical values to be filled in classically,\nthen the sentence can be assigned a classical value.\n\n\nFor example, this procedure makes a conjunction classical if both its\narguments are classical, false if the left conjunct is false, and\nundefined otherwise. Thus undefinedness of the left conjunct forces\nundefinedness of the entire conjunction, whereas undefinedness of the\nright conjunct only sometimes yields undefinedness of the entire\nconjunct, as seen in the following comparison of truth tables in\nvarious systems. The net effect is that presuppositions of the left\nconjunct project in the Middle Kleene system, just as in the Weak\nKleene system, but presuppositions of the right conjunct are\nconditionalized, just as in the Strong Kleene system. This behavior\nprecisely mirrors that of the Karttunen (1974) model.\n\nDefinition 10 (Trivalent truth tables for\nconjunction)\n\n\nWeak Kleene\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\n✭ \n\n✭\n✭\n✭\n✭ \n \nMiddle Kleene/Peters\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\nf \n\n✭\n✭\n✭\n✭ \n \nStrong Kleene\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\nf \n\n✭\n✭\nf\n✭ \n  \n\n\nThe equivalence between Peters’ connectives and Karttunen’s model\npaved the way for a more complete reformulation of the Karttunen model\nin Karttunen and Peters (1977; 1979), where certain types of\npresupposition (which Karttunen and Peters regard as conventional\nimplicatures rather than presuppositions) are treated in a\ncompositional grammar fragment. This fragment uses two dimensions of\nmeaning, one for presupposition and one for assertion, and is\neffectively an implementation of the Peters connectives in a\nfour-valued logic; see Krahmer (1994); Krahmer (1998), Beaver (2001),\nand Beaver and Krahmer (2001) for discussion, and the latter for a\nfragment that mirrors that of Karttunen and Peters, but allows for\nricher interactions between presuppositions and\n quantifiers.[17]\n4.3 Satisfaction theories\n\nAlthough Karttunen’s (1974) model turned out to be equivalent to a\nsystem which, from a purely technical point of view, is in the\nFrege-Strawson tradition, Karttunen (1974) was one of the seminal\npapers of the dynamic zeitgeist that swept through semantics and\npragmatics in the last decades of the twentieth century. Also relevant\nhere are Hamblin (1970), Stalnaker (1972; 1974) , Gazdar (1979) and\nLewis (1979), all of whom advanced dynamic models of pragmatics in\nwhich the (joint) commitments of speakers and hearers evolve as new\nassertions are made and their content becomes part of the linguistic\ncontext available for future utterances. It is against this background\nthat Heim (1982; 1983) offered the first dynamic semantic account of\npresupposition. Heim’s model utilizes Stalnaker’s notion of a context\nas a set of all possible worlds compatible with what has been\nestablished at that point in a conversation, but involves a crucial\ntwist adapted from Karttunen. In Stalnaker’s model, a single\nglobal context is updated each time new information is\nasserted, but in Heim’s model the context is updated locally\nin the process of computing the meanings of subparts of a complex\n expression.[18]\n We can define a simplified version of Heim’s system as follows:\n\nDefinition 11 (Dynamic Semantics)\n\nAssuming that the context set C is a set of possible\nworlds and S and S′ are sentences:\n\n\nC + S = the subset of worlds in C that\nare compatible with S, but this is defined  iff\nS’s presuppositions (if any) are true in all worlds in\nC.\nC + ¬S = C − (C +\nS)\nC + S ∧ S′ = (C +\nS) + S′\nC + S ○ S′, where ○\nis some truth functional operator, is given by the simplest classical\ndefinition of ○ in terms of ¬ and ∧ that preserves the\norder of the two sub-clauses.\nS is satisfied in a context C iff\nC + S = C (i.e., updating C with\nS has no effect).\nS presupposes S′ iff\nS′ is satisfied in all contexts where update with\nS is defined.\n\n\n\nClause (iv) entails that update with a conditional is defined\nvia the equivalence A → B ≡ ¬\n(A ∧ ¬ B) (provided that the subordinate\nclause precedes the main clause). To see how this will work, let’s\nconsider the following example:\n\n(31)\nIf the king is angry, then the knave stole the tarts. ( =\n(16a))\n\nIn order to update a context with (31), we must do the\nequivalent of updating with (32a). Now clause (ii) says that\nto update a context with (32a), we must first try updating with (32b),\nand subtract the result from the original context (so as to leave\nbehind whichever worlds are not compatible with (32a)). But\n(32b) is a conjunction, so we must first update with the left conjunct\n(32c), and then with the right (32d). Updating with (32c) is only\ndefined if the presupposition that there is a king is satisfied in all\nworlds in the context set. We immediately see that (31) and (32a),\n(32b), and (32c) all have this requirement, i.e., they presuppose that\nthere is a king. Provided this presupposition is satisfied, updating\nwith (32c) produces a subset of worlds where the king is angry. We use\nthis reduced context set for update with (32d). But update with (32d)\nagain uses the negation clause (ii) of the above definition.\nSo we started off with a set of worlds where there is a king, we\nreduced it to a set of worlds where the king is angry, and now we must\nupdate that context with (32e), an update which will only be defined\nif there is a knave.\n\n(32a)\nIt’s not the case that [the king is angry and the knave didn’t\nsteal the tarts].\n(32b)\nThe king is angry and the knave didn’t steal the tarts.\n(32c)\nThe king is angry.\n(32d)\nThe knave didn’t steal the tarts.\n(32e)\nThe knave stole the tarts.\n\n\nThe upshot of the above argumentation is that update of a context with\n(31) is only defined for contexts in which (a) there is a king, and\n(b) all the worlds where the king is angry are worlds where there is a\nknave. Following the definitions through, it turns out that, once\nagain, the original sentence carries both a non-conditionalized\npresupposition, that there is a king, and the conditionalized\npresupposition that if the king is angry, then there is a knave.\n\nThe satisfaction based model has seen considerable further\ndevelopment—see e.g., Beaver (1992; 2001), Chierchia (1995),\nHeim (1992), Zeevat (1992), and, for a rather different formalization\nof a dynamic semantic approach, van Eijck (1993; 1994;\n 1995).[19]\n5. Accommodation\n\nThe most important feature of the satisfaction model not covered in\nthe description above is accommodation. Accommodation was first\ndiscussed by Karttunen (1974) and Stalnaker (1974), though only named\nas such by Lewis (1979). Karttunen introduces the concept as\nfollows:\n\nOrdinary conversation does not always proceed in the ideal orderly\nfashion described earlier. People do make leaps and shortcuts by using\nsentences whose presuppositions are not satisfied in the\nconversational context. This is the rule rather than the exception\n[…] I think we can maintain that a sentence is always taken to\nbe an increment to a context that satisfies its presuppositions. If\nthe current conversational context does not suffice, the listener is\nentitled and expected to extend it as required. (Karttunen 1974: 191)\n\n\nIf this looks reasonably straightforward, the reader should be warned\nthat accommodation is among the more contentious topics in\npresupposition theory.\n [20]\n\nTo begin with, there are various notions of accommodation, some of\nwhich are stricter than others. To explain, consider the following\nexample by Heim (1982):\n\n(33)\nJohn read a book about Schubert and wrote to the author.\n\n\nIn order to determine the intended meaning of “the\nauthor”, the hearer has to infer (i) that there is an\nauthor and (ii) that the said author wrote the book read by\nJohn. Whereas on a broad understanding of accommodation, all of this\nis accommodated, on a strict construal only (i) is, and\n(ii) is a bridging inference. This is not just a matter of\nterminology. If we choose to be strict, we can argue that there is\nsomething like an “accommodation module”, which as such\nhas nothing to do with world knowledge; whereas if the notion is\nconstrued more broadly, accommodation is of a piece with bridging. To\nfacilitate the following discussion, we will adopt a strict notion of\naccommodation, and take the naive view that what is accommodated is\nthe presupposition as triggered by, e.g., a definite NP or factive\nverb.\n5.1 Global and Local Accommodation\n\nWith these preliminaries out of the way, we turn to the first major\nquestion: Where are presuppositions accommodated? Though it\nmay seem odd at first, this question is inescapable if we assume, as\nis standard in dynamic semantics, that an expression may occur in\nseveral contexts at the same time (cf. Section 4.3). For Heim (1982),\nfollowing Lewis (1979), accommodation is a process whereby contexts\nare adjusted so as to make update possible when presuppositions are\nnot satisfied. In terms of her treatment of accommodation, Heim’s\nmajor innovation over Lewis was to allow this process to take place\nnot only in the global context of utterance, but also on local\ncontexts found midway through an update. To illustrate, consider the\nfollowing:\n\n(34a)\n(c0) Maybe (c1) Betty is\ntrying to give up drinking.\n(34b)\n(c0) Maybe (c1) Wilma\nthinks that (c2) her husband is having an\naffair.\n\n\nHere c0 refers to the global context in which a\ngiven sentence is uttered, and c1and\nc2 are auxiliary, or local, contexts. In (34a),\nthe modal “maybe” creates an auxiliary context of possible\nstates of affairs in which Betty is trying to give up drinking; the\nsame, mutatis mutandis, for (34b). The presupposition triggered in\n(34a), that Betty used to drink, can be accommodated\nglobally, i.e., in c0, or\nlocally, in c1. In the former case, the\nutterance is construed as meaning that Betty used to drink and may be\ntrying to kick the habit; in the latter, it conveys that, possibly,\nBetty used to drink and is trying to give up drinking. Likewise, in\n(34b), the presupposition that Wilma is married may be accommodated\nglobally, or locally in the most deeply embedded context. But here\nthere is a third option, as well: if the presupposition is\naccommodated in c1, the sentence is read as\n“Maybe Wilma is married and she thinks that her husband is\nhaving an affair”, and we speak of intermediate\naccommodation.\n\nIt is widely agreed that the following empirical generalization, made\nexplicit by Heim (1983), is correct:\n\nPGA: Global accommodation is preferred to non-global\naccommodation.\n\n\nWhile the PGA was initially based solely on intuitions, quantitative\nstudies on the speed of processing local and global interpretations\nhave since provided empirical support for it (e.g. Chemla and Bott\n2013 and Romoli and Schwartz 2014).\n\nIn the examples in (34) the PGA (preference for global accommodation)\nclearly holds: non-global interpretations may be possible, but they\nrequire special contexts. One such context may be that the\npresupposition contains a variable which is bound by a quantifier:\n\n(35)\nMost Germans wash their cars on Saturday.\n\n\nIn (35), with the possessive presupposition trigger “their\ncars”, there is a global context (outside of the scope of\n“most”), a local context corresponding to the scope of the\nquantifier (occupied by the VP “wash their cars on\nSaturday”), and also an intermediate context in the restrictor\nof the quantifier (occupied by “Germans”). The most\nnatural interpretation of this sentence surely is that most Germans\nwho own a car wash it on Saturday. So in this case intermediate\naccommodation seems to be the preferred option, and this might be\nexplained, following van der Sandt (1992), by supposing that the\npossessive pronoun contains a variable bound by the quantifier.\n\nThere are other cases where intermediate accommodation is virtually\nimpossible:\n\n(36)\n(c0) If (c1) Fred is\ncoming to the reception, (c2) he may\n(c3) bring his wife.\n\n\nIt is quite unlikely that this may be construed, with intermediate\naccommodation in c1, which is the antecedent of\nthe conditional, as “If Fred is married and is coming to the\nreception, he may bring his wife.” More generally, we don’t know\nof any clear-cut cases (i.e., cases in which accommodation is not\nforced by independent contextual factors) in which a presupposition\ntriggered in the consequent of a conditional is accommodated in the\nantecedent.\n\nThe picture is rather confusing. While in some cases, e.g., (34b) or\n(35), intermediate accommodation seems possible and sometimes even\npreferred, in other cases it doesn’t seem possible at all. And things\nget even more confused than this. Thus far, we have taken our examples\nat face value, but some authors have argued that we shouldn’t because,\nas a matter of fact, intermediate accommodation doesn’t exist. For\ninstance, according to Beaver (2001), the presupposition in (35) is\ntaken as evidence that the topic of conversation is car-owning\nGermans, and it is this topic that restricts the domain of the\nquantifier, making intermediate accommodation redundant. See also von\nFintel (1995) and Geurts and van der Sandt (1999) for discussion.\n\nReturning to the uncontested PGA, let us ask how it can be explained.\nHeim (1982) was not explicit about exactly how accommodation should\nwork and what should be accommodated. And oddly enough, although\nvirtually all theories of presupposition projection accept that the\nPGA holds, there haven’t been that many attempts at explanation. One\ncandidate is what Beaver (2001) calls the “Atlas\nPrinciple”, after Atlas (1976):\n\nAP: One accommodation alternative is preferred to\nanother if the former yields a stronger meaning than the latter (i.e.,\nif the first meaning unilaterally entails the second).\n\nAdvocates of the Atlas Principle include, besides its eponym, Yeom\n(1998), Zeevat (1999), and Blutner (2000). One thing to note about the\nAtlas Principle is that it does not necessarily vindicate the PGA\nacross the board: while the predictions made by the Atlas Principle\nwill tend to comply with the PGA, they don’t have to. However, it is\nsurprisingly difficult to say where exactly the Atlas Principle\ndeviates from the PGA, because this depends on various extraneous\nfactors; see Geurts (2000) for discussion.\n\nA major worry about the Atlas Principle is that it is ad hoc.\nDespite its soothing resemblance to Grice’s second Quantity Maxim, it\nis questionable whether hearers generally prefer stronger\ninterpretations to weaker ones. This suggests that the Atlas Principle\nmay not be justified as an instance of a more general constraint, and\nis therefore stipulative. The sad and somewhat embarrassing truth\nseems to be that, thus far, we don’t really know why the PGA should\nhold.\n\nOne last issue we would like to mention is that accommodation isn’t\nalways equally easy (or hard). For example:\n\n(37a)\nFred is looking for the person.\n(37b)\nWilma is pregnant, too.\n\n\nIn (37a) the presupposition triggered by “the person”\nclearly requires a salient discourse referent to hook on to; the\nsentence would be infelicitous when uttered out of the blue. The same\ngoes for the presupposition triggered by “too” in (37b),\nviz. that some salient person different from Wilma is pregnant. This\nsentence would be very peculiar when uttered out of the blue, or in\nany context where no salient person was under discussion who could be\npregnant. Put otherwise: unlike the presuppositions we have seen thus\nfar, it is very hard to deal with the presuppositions of “the\nperson” or “too” by accommodation\n alone.[21]\n Why should this be so?\n\nVan der Sandt (1992) proposes that presuppositions whose descriptive\ncontent is relatively poor are hard to accommodate. This\ngeneralization is borne out by pronouns, names, and semantically\nattenuate definite NPs like “the person”. However, it is\nnot very clear what “relatively poor” means. Definite NPs\nlike “the water molecule” or “the lonely\ncarpenter” don’t strike us as particularly poor, but may be hard\nto interpret by way of accommodation. Similarly, the presuppositions\nassociated with “too” may be quite rich, and nevertheless\nthey are generally hard to accommodate. Geurts and van der Sandt\n(2004) propose to account for the latter by adopting Heim’s (1992)\nidea that the presupposition triggered by “too” contains a\npronominal element, which blocks accommodation, but this proposal has\nbeen criticised by Beaver and Zeevat (2007). Be this as it may, it\nseems clear that van der Sandt’s generalization cannot be read as\nbiconditional: even if poor presuppositions are difficult to\naccommodate, the reverse doesn’t always hold.\n\nAnother problem with van der Sandt’s generalization is that it is not\nclear how it can be justified. Even if it somehow makes sense that\nlack of descriptive content should make accommodation hard, we would\nlike to know more precisely why this should be so. A possible answer\nto this question may be found in the work on definites by Hawkins\n(1978), Clark and Marshall (1981), Heim (1982), and others. As Heim\nobserves, “accommodation in response to definites is not\nnormally a matter of adding just the minimal amount of information\nthat would restore felicity.” (Heim 1982, p. 372) It seems\nplausible that this holds for accommodation generally, and it arguably\nfollows from the nature of accommodation. If a presupposition is to be\ninterpreted by way of accommodation, new information is presented\nas if it were given, and it has often been observed that this\nwill only work if the information is not contentious or otherwise\nremarkable. That is to say, it should always be possible to\nintegrate the new information into the common ground: it has\nto be linked to what is already given. This will be hard with\nsemantically attenuate NPs like “the thing” or pronouns\nlike “he”, but also with richer definites whose content\ncannot readily be linked to anything in the common ground.\nNevertheless, it will generally be easy with richer presuppositions,\nnot because they have more content, but simply because they\nare more likely to contain anchors into the common ground.\n5.2 Accommodating Presuppositions in Satisfaction Framework\n\nLocal satisfaction is at the heart of dynamic theories of\npresupposition, but we’ve already seen that it faces some empirical\nchallenges in accounting for conditionalized presuppositions.\nSpecifically, sometimes satisfaction theories generate weaker\nconditional presuppositions when intuitively the speaker is\npresupposing a stronger, unconditionalized presupposition. Geurts\n(1996,1999a) deems this \"The Proviso Problem,\" and the data\nsurrounding this problem has left quite a mess for proponents of\nsatisfaction theories to clean\n up.[22]\n\nAccording to satisfaction theories, only weak conditional\npresuppositions should follow from embedding presuppositions in\ncertain constructions, notably conditionals themselves. For example,\nimagine that you are about to go surfing for the first time in the\ncold waters of Northern California, and you and your interlocutor\nsuspect that a common acquaintance, Theo, is a scuba diver, and that\nhe may be able to help. In this context, the use of his in\n(38a) intuitively leads to the conditional inference in (38c):\n\n(38a)\nIf Theo is a scuba diver, then he will bring his wet suit.\n(38b)\nTheo has a wet suit.\n(38c)\nIf Theo is a scuba diver, then he has a wet suit.\n\n\nContrast this with (39a), which strongly suggests that the speaker\nbelieves that Theo has a wet suit (39b), and not the weaker\nconditional in (39c):\n\n(39a)\nIf Theo is in a generous mood, then he will bring his wet suit.\n(39b)\nTheo has a wet suit\n(39c)\nIf Theo is in a generous mood, then he has a wet suit.\n\n\nWhatever mechanism is used to determine what is accommodated, it must\nensure that sometimes conditional presuppositions are strengthened (to\nbecome unconditionalized), and sometimes they aren’t. What examples\nlike (38) and (39) suggest is that this might be explained in terms of\nplausibility: it could be that the conditional in (39c) is\nstrengthened because it seems implausible that a speaker would be\nassuming that Theo’s generosity was linked to his ownership of aquatic\nparaphernalia, whereas it seems more plausible that a speaker would\nsimply be assuming that Theo owned such equipment.\n\nSeveral proposals (e.g. Beaver 2001, Singh 2007, 2009; Schlenker 2011)\ntry to motivate this kind of strengthening mechanism to explain\nwhen exactly a conditionalized presupposition should be\nstrengthened. For example, Beaver’s model of accommodation, first\npublished in Beaver (1992) treats accommodation as a type of filtering\noperation. Beaver suggests that due to uncertainty about what the\nspeaker takes the common ground to be, the hearer has to entertain\nmultiple alternative context sets, with some ranking of which is the\nmost plausible. All these alternative contexts are updated\nsimultaneously. Accommodation is then what happens when the update is\nnot defined on what was previously considered to be the most plausible\ncontext, in which case the hearer drops that context from contention.\nWhat remains is a new set of contexts in which the most plausible one\nis a context that has been successfully updated.\n\nUnfortunately for this style of explanation of presupposition\nstrengthening, plausibility appears to have its limits. Consider the\ntwo examples in (40a,b). If we assume that a cleft \"it is X\nthat Y-ed\" presupposes an existential, roughly\n\"someone/something Y-ed\" then in a dynamic theory of\npresupposition (40b) will generate the same conditionalized\npresupposition as results from (40a), which involves the factive\n\"knows\", namely the conditional in (40c). However, there is a clear\ndifference in the inferences we would tend to draw from utterances of\n(40a) and (40b). Whereas (40a) licenses an inference only to the\nconditional presupposition in (40c), example (40b) leads to the\nstronger, unconditionalized presupposition in (40d). Under the\nassumptions we have made, namely that (40a) and (40b) generate exactly\nthe same underlying conditionalized presupposition, the plausibility\napproach used in Beaver’s framework fails to predict a difference in\nwhat is accommodated in these cases.\n\n(40a)\nPeter knows that if the problem was easy, someone solved it.\n(40b)\nIf the problem was easy then it was Kristie who solved it.\n(40c)\nIf the problem was easy, someone solved it.\n    [Conditional presupposition for (40a,b), accommodated for (40a)]\n(40d)\nSomeone solved the problem.\n    [Unconditionalized presupposition, accommodated for (40b) but not\n    (40a)]\n\n\nOne relevant factor here that might influence accomodation is\ninformation structure. In (40b), the cleft structure might be said to\nreflect the presence of a Question Under Discussion (QUD), in\nthe sense of Roberts (2012), concerning who solved the problem. To the\nextent that such a question is under discussion, the interlocutors\nwill presumably know that this is so. And if \"Who solved the problem?\"\nis indeed the question the interlocutors are trying to answer, then\nthey are likely to mutually accept that someone solved the problem,\nthus explaining projection. Crucially, this line of reasoning depends\non the cleft in (40b) having a particular information structural\nfunction, and a similar argument could not be made in a case like\n(39a), where there is no constructional marking of information\nstructure, and in particular no indicator that \"Who solved the\nproblem?\" is the QUD.\n\n(41a)\nIf the problem was easy then Peter knows that someone solved it.\n(41b)\nIf the problem was easy then Peter KNOWS that someone solved it.\n(41c)\nIf the problem was easy then even PETER knows that someone solved it.\n\n\nWe may have reasonable motivations for when we might expect a\nconditional presupposition to be strengthened. But even with such\nmechanisms, satisfaction theories still fall short when confronting\ncertain data. For example, consider (42) below.\n\n(42)\nIf when Sam gets back from vacation he finds moldy fruit in the\nkitchen, he’ll be annoyed that he had food in the house.\n\n\nHere, the consequent presupposes that Sam had food in the house, which\nis also entailed by the antecedent. Since satisfaction theories assume\nthat presuppositions in a complex sentence will be satisfied locally,\nwe’re left with a tautology. So, the local satisfaction constraint\ngenerates presuppositions which are redundant.\n\nThe proviso problem is still a relevant hurdle for proponents of\nmodern satisfaction theories. Mandelkern (2016) presents a version of\nsatisfaction theory designed to avoid the proviso problem entirely.\nRomoli et al (2011) explore this issue experimentally by asking which\npresupposition -the conditional or unconditional option- is more\nbasic. But, ultimately the proviso problem is less problematic for\nother accounts of presupposition, which don’t rely on local context\nupdates.\n5.3 Resolving and Accommodating Presuppositions in DRT\n\nIn order to account for both presupposition projection facts and the\nparallels between presupposition and anaphora, van der Sandt proposed\nan accommodation-based model as an extension of Discourse\nRepresentation Theory (see the SEP entry on\n discourse representation theory\n for an introduction). Presupposed information is information that is\npresented as given, and in van der Sandt’s theory this means that\npresuppositions want to have discourse referents to bind to. However,\nwhereas anaphoric pronouns are rarely interpretable in the absence of\na suitable antecedent, the same does not hold for all\npresupposition-inducing expressions. For instance, a speaker may\nfelicitously assert that he met “Fred’s sister” even if he\nknows full well that his audience isn’t aware that Fred has a sister.\nIn such cases, presuppositions are generally accommodated, which is to\nsay that the hearer accepts the information as given, and revises his\nrepresentation of the context accordingly. Accommodation, thus\nunderstood, is a form of exploitation in Grice’s sense: the purpose of\npresuppositional expressions is to signal that this or that\ninformation is given, and if some information is new but not\nparticularly interesting or controversial (like the fact that somebody\nhas a sister) the speaker may choose to “get it out of the\nway” by presuppositional means.\n\nVan der Sandt’s theory incorporates the notion of accommodation as\nfollows. Presuppositions, according van der Sandt, introduce\ninformation that prefers to be linked to discourse referents that are\nalready available in the hearer’s representation of the discourse, and\nin this respect they are like pronouns. Van der Sandt in fact uses the\nterm \"binding\" to refer to configurations in which presuppositions\nhave antecedents in the Discourse Representation Structure (DRS), thus\ngeneralizing the standard notion of a bound pronoun to cases involving\nmultiple discourse referents. However, if a suitable discourse\nantecedent is not available, a new one will be accommodated, and the\npresupposition is linked to that. Generally speaking, accommodation is\nnot an option in the interpretation of pronouns, and one reason that\nhas been suggested for this is that a pronoun’s descriptive content is\nrelatively poor (see Section 5.1 for discussion). Being told that\n“she” is wonderful is not particularly helpful if it isn’t\nclear who the pronoun is meant to refer to. By contrast, if the\nspeaker refers to “Pedro’s sister” there is more to go on,\nand accommodation becomes feasible. Hence, van der Sandt hypothesizes\nthat pronouns are a special class of presuppositional expressions:\nwhile all presupposition triggers prefer to be linked to antecedents,\npronouns almost always must be linked to antecedents because they are\ndescriptively attenuated, and therefore cannot be construed by way of\naccommodation.\n\nTo get a better idea how this is supposed to work, let us consider an\nexample with several presupposition triggers:\n\n(43)\nIf Fred is protesting, then his son is protesting, too.\n\n\nThis sentence contains the definite NP “his son”, which in\nits turn contains the pronoun “his”, and the focus\nparticle “too”. Assuming the pronoun’s antecedent is\n“Fred”, the definite NP triggers the presupposition that\nFred has a son, while the focus particle triggers the presupposition\nthat someone other than Fred’s son is protesting. Note that in this\nexample the presupposition triggered by the definite NP is\n“inherited” by the sentence as a whole, while the one\ntriggered by “too” is not: normally speaking, an utterance\nof (43) would license the inference that (according to the speaker)\nFred has a son, but not that someone else besides Fred’s son is\nprotesting.\n\nVan der Sandt’s theory accounts for these observations as follows. We\nsuppose that the grammar assigns (43) the intermediate semantic\nrepresentation in (44a). Here [ u1,…, um:\nφ1,…,φn] is a simple\nDiscourse Representation Structure in linear form, with u1,…,\num a list of discourse markers, and\nφ1,…,φn a list of\nconditions on those markers; connectives like ⇒ are used to build\nup complex conditions. We assume for convenience that most\ninterpretative problems have been cleared out of the way already, and\nthat the only thing that remains to be done is resolve the\npresuppositions triggered by “his”, “his son”\nand “too”, which are flagged by Beaver’s (1992) trigger\nsymbol, ∂.\n\n(44a)\n[x: Fred(x), [: protesting(x)] ⇒ [: ∂[z: ∂[y:], z\nis y’s son], protesting (z), ∂[u: u ≠ z, protesting(u)]]]\n\n…binding y to x…\n(44b)\n[x: Fred(x), [: protesting(x)] ⇒ [: ∂[z: z is x’s\nson], protesting(z), ∂[u: u ≠ z, protesting(u)]]]\n\n…accommodating x…\n(44c)\n[x, z: Fred(x), z is x’s son, [: protesting(x)] ⇒ [:\nprotesting(z), ∂[u: u ≠ z, protesting(u)]]]\n\n…binding u to x…\n(44d)\n[x, z: Fred(x), z is x’s son, [: protesting(x)] ⇒ [:\nprotesting(z), x ≠ z]]\n\n\n(44a) is the initial semantic representation associated with (43), in\nwhich three presuppositions remain to be resolved. The first of these,\ntriggered by the pronoun “his”, is bound to the discourse\nreferent representing Fred, which results in (44b). The second\npresupposition, that Fred has a son, cannot be bound, and therefore\nmust be interpreted by way of accommodation. Van der Sandt’s theory,\nlike Heim’s (Heim, 1983), stipulates that accommodation at the global\nlevel, as shown in (44c), is preferred to accommodation at other\nsites. Finally, the presupposition triggered by the focus particle can\nbe bound in the antecedent of the conditional; after simplification,\nthis results in (44d), which represents the most natural way of\ninterpreting (43).\n6. Born to fail, or unborn?\n\nWhat happens when a presupposition is false? The textbook\nproto-history of answers to this question goes as follows. According\nto Frege (1892), if an expression A suffers from\npresupposition failure, then any sentence containing A will\nlack a truth value; Russell (1905) famously denied this, holding that\nsuch a sentence will always be true or false; and then Strawson (1950)\nreaffirmed Frege’s position, more or less. What is less well known, at\nleast insofar as it usually doesn’t make it into introductory classes\non philosophy of language, is that in subsequent work, Strawson partly\nrecanted his initial view and came to doubt that presupposition\nfailure invariably entails lack of truth value.\n\nTaking a closer look at how speakers actually assess a sentence,\nStrawson’s (1964) paper argues that presupposition failure may but\nneed not cause a sentence to be infelicitous. Two of his examples are\nthe following:\n\n(45a)\nJones spent the morning at the local swimming pool.\n(45b)\nThe exhibition was visited yesterday by the king of France.\n\n\nIf there is no swimming pool locally, it is “natural\nenough”, according to Strawson, to say that (45a) is false, and\nsince the king of France doesn’t exist, the same applies to (45b). And\nif these sentences are false, their negations must be true. So, if\nthese subtle judgments are accepted, there are cases in which\npresupposition failure does not prevent us from saying that a sentence\nis true or false. But Strawson hasn’t changed his mind about Russell’s\nexample:\n\nConfronted with the classical example, “The king of France is\nbald”, we may well feel it natural to say, straight off, that\nthe question whether the statement is true or false doesn’t arise\nbecause there is no king of France. (Strawson 1964: 90)\n\n\nStrawson goes on to observe, however, that speakers who subscribe to\nthis judgment may want to reconsider their verdict if the context is\nset up the right way. For instance, if Russell’s sentence is used to\nanswer the question, “What examples, if any, are there of famous\ncontemporary figures who are bald?”, we may be more inclined to\nsay that the answer is simply false.\n\nStrawson’s explanation for these facts is given in terms of\ntopicality. The most likely purpose of a sentence like (45a) is to\ndescribe what Jones has been doing in the morning, rather than, say,\nwho the local swimming pool was visited by. That is, in the absence of\nfurther information about the context in which this sentence is\nuttered, its topic will be Jones’s exploits. Similarly, a sentence\nlike (45b) will normally be used to convey information about the\nexhibition. If so, although the sentence purports to refer to the king\nof France, it is not about him; the king of France is not the topic of\ndiscourse, nor part of the topic. In other words, the existence of the\nking of France is not at-issue. Strawson’s suggestion is that\nthis circumstance influences the way presupposition failure is dealt\nwith. On this view, presupposition failure results in infelicity only\nif it affects the topic of a sentence; otherwise the sentence will be\njudged true or false, as appropriate.\n\nOne of the appealing features of this analysis is that it takes into\naccount the context-dependence of speakers’ intuitions. As Strawson\nnotes, Russell’s sentence (46) will by default be construed as being\nabout the king of France, whence a strong tendency to judge the\nsentence infelicitous.\n\n(46)\nThe king of France is bald.\n\n\nIf, however, the discourse is about royal baldness in general, for\ninstance, the grammatical subject of (46) is used to say something\nabout that topic, and Strawson’s account predicts that the sentence is\nmore likely to be judged false, which seems correct. Another\nobservation that neatly falls into place is that word order may have\nan effect on speakers’ intuitions about presupposition failure. As\nStrawson observes, if we compare (45b) with (47), where the defective\ndescription is in subject position, we would be “a shade more\nsqueamish” to say that the sentence is simply false (p. 91).\nThis is precisely what one should expect if speakers’ intuitions were\ntopic-dependent.\n\n(47)\nThe king of France visited the exhibition yesterday.\n\n\nAssuming that Strawson’s observations are correct, should we say (a)\nthat non-topical definites are non-presuppositional, or (b) that they\ndo have presuppositions, whose failure happens not to affect speakers’\ntruth-value judgments? Some authors argue for the former (e.g.,\nReinhart 1982, Horn 1989); this is Strawson’s view, as well. Von\nFintel (2004) argues for the latter: topical or non-topical,\n“the king of France” always triggers the presupposition\nthat there is a king of France; it’s just our truth-value judgments\nthat fluctuate.\n\nVon Fintel’s position is in line with what has been a working\nhypothesis for many years in theories of projection. According to\nthese theories, presuppositions are never really cancelled: if a\npresupposition seems to disappear, it is because it projects to a\nnon-global context. It bears emphasizing that this view is not\nirrevocably linked to these theories. It’s just that there is no need\nto assume that there are part-time presupposition triggers (in a sense\nwe expand upon in Section 8 below), because non-global projection can\nbe relied upon to explain why presuppositions sometimes seem to\ndisappear. However, this working hypothesis may have to be reassessed\nif we want to account for Strawson’s observations, which might be\ntaken to show that presuppositions are cancellable not only in complex\nsentences but in simple sentences, as well.\n\nSo far we’ve only talked about definite descriptions. Some other\ntriggers show similar variability, but not all of them do. On the one\nhand, the domain presuppositions associated with strong quantifiers\nlike “all” and “most” behave very much like\ndefinite presuppositions (de Jong and Verkuyl 1985, Lappin and\nReinhart 1988, Geurts 2007). For example, when uttered out of the\nblue, (48) will sound odd, but when proffered in response to\nStrawson’s question, “What examples, if any, are there of famous\ncontemporary figures who are bald?”, it seems more likely to be\njudged false:\n\n(48)\nAll South-American monarchs are bald.\n\n\nOn the other hand, consider the following:\n\n(49a)\n#BENEDICT XVI is the incumbent pope, too.\n(49b)\n#Carnap managed to be born on May 18, 1891.\n\n\nGiven that there is only one incumbent pope and that it can’t have\ntaken Carnap any effort to be born on May 18, 1891, both (49a) and\n(49b) suffer from presupposition failure. But if someone who knew that\nthere was only one incumbent pope uttered (49a), it would not seem\nentirely natural to say that they had lied. One might even say that\nthese sentences are true, and this intuition does not seem to\nbe topic dependent. The reason for this may be that the\npresuppositions in question are incidental to the primary\ncontent of these sentences.\n7. Presuppositions and attitudes\n\nFor nearly four decades, the Holy Grail of presupposition research has\nbeen to explain the behavior of presuppositional expressions occurring\nin embedded positions. A particularly challenging mode of embedding\narises with attitude verbs. If we embed a presupposition trigger\nunder, e.g., “believe”, we observe two types of inference.\nThis is seen in the following examples, where “→”\nindicates that there is an inference, but of unspecified type:\n\n(50)\nBarney believes that his sister is drunk.\n\n→ Barney has a sister.\n\n→ Barney believes he has a sister.\n(51)\nWilma believes that Barney knows that his sister is\ndrunk.\n\n→ Barney’s sister is drunk.\n\n→ Wilma believes that Barney’s sister is drunk.\n\n\nBoth inferences are fairly robust, and both seem to exhibit projection\nbehavior, as we illustrate here by applying various embedding tests to\n(50):\n\n(52a)\nBarney doesn’t believe that his sister is drunk.\n(52b)\nPerhaps Barney believes that his sister is drunk.\n\n\n(52c)\nIf Barney has a sister, then he believes that his sister is\ndrunk.\n(52d)\nIf Barney believes that he has a sister, then he also believes\nthat his sister is drunk.\n\n\nIt is natural to infer from both (52a) and (52b) that Barney has a\nsister and that he believes that he has a sister, and these inferences\ncan be blocked in sentences such as those in (52c) and (52d) , where\n“his sister” occurs in the consequent of a conditional\nwhose antecedent makes one or the other inference explicit. It may\nseem odd at first that (52c) should block the inference that Barney\nbelieves that he has a sister, while (52d) blocks the inference that\nBarney has a sister. Note however that, generally speaking, Barney has\na sister iff he believes that he has a sister. We’ll return\nto this theme below.\n\nInterestingly, literally the same pattern of observations holds for\nother attitude verbs, like “want” for example:\n\n(53)\nBarney wants to phone his sister.\n\n→ Barney has a sister.\n\n→ Barney believes he has a sister.\n\n\nThe puzzling thing is that (53) does not license the inference that\nBarney wants to have a sister, but rather that he believes\nthat he has one.\n\nSo, in many cases at least, a presupposition φ triggered within\nthe scope of “x\nVA…”, where\nVA is an attitude verb, gives rise to two\ninferences with a candidature for presuppositional status: (a) that\nφ and (b) that x believes φ. Hence, we have three\npossible ways of proceeding, all of which have been defended in the\nliterature:\n\nBoth inferences are presuppositions (Zeevat 1992, at least for\ncertain triggers).\nOnly φ is a presupposition (Gazdar 1979a; van der Sandt 1988;\nGeurts 1998).\nOnly “x believes that φ” is a\npresupposition (Karttunen 1974; Heim 1992).\n\n\nThe first strategy seems to require a stipulation that certain\npresuppositions have to be accommodated twice, once inside a belief\ncontext, and once outside, and such a strategy is difficult to\nmotivate. On the other hand, for (ii) and (iii),\nthere is the obvious problem that if we adopt either one of them, we\nonly account for half of the observed inferences. How to explain the\nother half? Three possible answers to this question have been\ndiscussed in the literature, mainly by Heim (1992):\n\nDe re construal (Heim 1992) What at first looks like a\npresupposition projecting to the global context may in fact be due to\na de re construal of the presupposition trigger. This\nsolution has several serious drawbacks. In particular, it’s hard to\nsee how this proposal can give us both inferences at the same time,\nrather than one (de re) or the other (presupposition). For\nthis and other reasons (see Geurts 1998), we will not consider it any\nfurther.\nExportation (Karttunen 1974, Heim 1992, Kay 1992) If\nBarney believes that he has a sister, then it may plausibly be\ninferred that he has a sister. Therefore, if it is presupposed that\nBarney believes that he has a sister, then it may plausibly be\ninferred that he has a sister.\nImportation (Heim 1992, Geurts 1998) If Barney has a\nsister, then it may plausibly be inferred that he believes that he has\na sister. Therefore, if it is presupposed that Barney has a sister,\nthen it may plausibly be inferred that he believes that he has a\nsister.\n\n\nIf our presupposition theory predicts that the inferences projected\nfrom “x VA” are of\nthe form “x believes that φ”, then we can\nappeal to exportation to explain why φ is inferable, as well.\nVice versa, a theory which predicts that φ is presupposed\ncan use importation for deriving “x believes that\nφ”. So we have two options:\n\n\n \nx believes that φ\nφ \n\nOption A\nimportation\npresupposition \n\nOption B\npresupposition\nexportation \n\n\nWhich is it going to be? That’s a hard question, which raises various\nissues, only some of which we can mention here. First, it should be\nnoted that, whereas for theories of the satisfaction family it is hard\nto avoid making the prediction that presuppositions projected\nfrom attitude contexts are of the form “x believes that\nφ”, DRT-style theories are more flexible, and can predict\neither this or that the presupposition is simply φ. In other\nwords, satisfaction theories are more constrained (which is good), but\ntherefore practically forced to resort to Option B.\n\nOne of the issues that need to be addressed is that of the true nature\nof importation and exportation inferences. It seems reasonable to\nassume that, generally speaking, people’s beliefs are consistent with\nthe facts, and that we tend to assume by default that this is the\ncase. But even if this much is true, it is most unlikely that, by\ndefault, people will infer φ from “x believes\nφ” (for arbitrary x and φ), or vice versa.\nWhatever importation and exportation are, they aren’t general\nheuristics; rather, these inferences are almost certainly dependent on\nthe context to some degree.\n8. Presupposition variability\n\nMuch contemporary work on presupposition has been devoted to case\nstudies of particular triggers or families of triggers. More often\nthan not, these studies end up granting some sort of special\nconsideration to the trigger(s) in question. We have already seen\ninstances of trigger differentiation above; for example,\nanaphoric accounts identify a class of triggers whose content is\n\"descriptively poor\" to explain why their presuppositions are more\ndifficult to accommodate than those of other triggers (see Sections\n5.1 & 5.3). Researchers have noted more and more ways in which the\npresuppositions of triggers differ, mostly focused around questions of\nhow robustly the presupposition projects and in what sorts of contexts\nthe presupposition disappears.\n\nFor some, the blurry boundaries between the sorts of inferences that\nare covered by presupposition theories have opened up the door for new\ntriggers and presupposition-like things that might not be covered by\ntraditional labels. For example, Schlenker (2015, 2018) applies a\npresuppositional framework to iconic co-speech gestures, to identify\nwhat he calls \"cosuppositions.\" There are also inferences that seem to\nchallenge traditional diagnostics like projection. For instance,\nnon-restrictive relative clauses (\"Fred, who I like, ...\") produce\nprojection like presuppositions, but typically introduce new\ninformation to the discourse (Chierchia & McConnell-Ginet\n1990).\n\nFinally, the way that some theories model presuppositions can give\nrise to new types of related inferences. For example, Chemla (2008)\nnotes that the sentence in (54a) strongly suggests that the speaker\ndoes not have a sister. According to Heim (1991), this inference\narises from the fact that the speaker did not utter the alternative in\n(54b), which strongly presupposes that the speaker does have a sister.\nThis prediction follows from Heim’s Maximize Presupposition!\nprinciple, that a speaker will use the felicitous sentence with the\nstrongest presupposition among a set of alternatives. These types of\ninferences have been referred to in the literature as\n’anti-presuppositions,’ a term originating with Percus (2006).\n\n(54a) John believes I have a sister.\n\n(54b) John knows I have a sister.\n\nOne observed difference between some triggers is that they don’t seem\nto reliably generate presuppositions in certain contexts. As we\nmentioned in Section 6, theories of presupposition projection tend to\nadopt the working hypothesis that presuppositions are associated with\nexpression types: if an expression α triggers a presupposition\nφ, then φ will always be triggered by α. This is just a\nmatter of economy: since a projection theory already provides a\nmechanism for explaining how presuppositions, once triggered, can seem\nto disappear, there is no need for supposing that there are part-time\npresupposition triggers. Indeed, it would be a bit of a nuisance if it\nturned out that that some expressions or constructions trigger their\npresuppositions on a part-time basis, because then we would have two\nways of explaining why a given presupposition fails to appear: echoing\nour discussion in section 6, either it has been canceled (say through\nbeing resolved in an embedded context) or it wasn’t triggered in the\nfirst place.\n\nAre there compelling reasons for believing that there are part-time\ntriggers? Not as far as we know. There are suggestive facts, though.\nIn the following example from Fauconnier (1985), A and\nB are sitting in a bar observing a stranger who doesn’t seem\nto be too happy:\n\n(55)\nA: I wonder why that guy is looking so glum.\n\nB: Maybe his girlfriend jilted him.\n\n\nThe most natural interpretation of B’s answer, in this\ncontext, is that it is possible that the stranger has a girlfriend who\nhas jilted him; this construal will require local accommodation of the\ngirlfriend if we assume that “his girlfriend” always\ntriggers the presupposition that the pronoun’s referent has a\n girlfriend.[23]\n The problem is that if this is local accommodation, then it’s too\neasy. Local accommodation is supposed to be dispreferred. If\nwe allow that in this case the presupposition is locally accommodated,\nwhy can’t all embedded presuppositions just be locally accommodated\naway and not project? Allowing local accommodation to occur without\nconstraint would potentially destroy any claim to have explained the\nobservation that has defined the phenomenon of presupposition since\nits inception, the observation that presuppositions tend to\nproject.\n\nIf we could explain why this or that expression triggers such\nand such a presupposition, one of the corollaries might be that the\nexpression in question is a part-time trigger. To see how such an\nargument might run in outline, consider the presuppositions associated\nwith aspectual verbs like “start” or\n“stop”:\n\n(56a)\nJill has started smoking pot.\n\n→ Jill didn’t use to smoke pot.\n(56b)\nJill has stopped smoking pot.\n\n→ Jill used to smoke pot.\n\n\nAspectual verbs describe a transition from one state to another, and\nit is always the first state that is presupposed, as standard\nprojection tests confirm. An explanation might be sought in the idea\nthat interlocutors are more interested in where the story is going\nthan where it came from, and therefore tend to take the past as given.\nA purely pragmatic analysis might involve the hearer reasoning that\nsince the speaker is likely to intend to provide the information that\nis of greatest interest, they are probably assuming a context in which\nthe pre-state associated with a telic sentence is already in the\ncommon ground, i.e. presupposed. It might further be argued that such\nreasoning only applies when the hearer has reason to think that the\nspeaker has expertise on the situation being described. A part-time\ntrigger analysis might be based on the idea that the regularity with\nwhich pre-states of telic sentences are in the common ground has led\nto this pragmatic reasoning being conventionalized. A part-time\ntrigger analysis might involve a special triggering condition, e.g.\ninvolving the speaker’s expertise. So the part-time trigger analysis\nmight amount to the claim that when the context determines that the\nspeaker has expertise about an event, the pre-state is presupposed,\nbut when the context determines that the speaker lacks expertise,\nthere is no such presupposition.\n\nThe disappearance of a pre-state presupposition in example (57) could\nbe explained in this way. On a more standard view, the aspectual verb\ntriggers a quantified presupposition, roughly that x used to\nsmoke. This has to be accommodated locally, perhaps because as\nsuggested by van der Sandt (1992), bound presuppositions can never be\naccommodated outside of the scope of the binder, what he calls\ntrapping. But it is also conceivable that there is no\npresupposition to be trapped. The idea would be that the speaker lacks\nexpertise on the habits of the arbitrary individuals quantified over\nby the quantifier \"anyone\", and that this is just the situation in\nwhich a presupposition is not triggered. The ease with which the\nexistence presupposition of the possessive in example (55) disappears\ncould be explained along the same lines.\n\n(57)\nIf anyone stops smoking before July 1, they are eligible for a\npayment from the Tobacco Indemnity Fund. (Example adapted from\nAbusch 2002.)\n\n\nA different perspective has emerged in recent years to explain the why\ncertain triggers seem to only result in a presupposition part of the\ntime. Rather than proposing that there is variation in triggering,\nsome linguists interpret this behavior as the result of variation in\nthe inherent cancellability among triggers. Abusch (2002, 2010)\ndistinguishes between ‘soft’ triggers which are weak and\ncontext-dependent and ‘hard’ triggers, which are resistent to\ncancellation. For example, she classifies the achievement verb\nwin, in (58a), as a soft trigger, since the presupposition\nthat John participated in the race is contextually defeasible, whereas\nthe cleft construction in (58b) is considered a hard trigger because\nit cannot be cancelled by the speaker by explicitly expressing\nignorance.\n\n(58a)\n I have no idea whether John ended up participating in the Road\nRace yesterday. But if he won it, then he has more victories than\nanyone else in history.\n(58b)\n ??I have no idea whether anyone read that letter. But if it is\nJohn who read it, let’s ask him to be discreet about the content.\n\n\nAbusch’s soft/hard distinction suggests that degrees of cancellability\nare intrinsic properties of the triggers themselves, and those that\nbuy into this theory must motivate why that is. For Abusch,\nhard presuppositions are strictly semantic, whereas soft\npresuppositions arise from alternative sets generated in the context.\nRomoli (2011, 2014) takes this a step further by arguing that\npresuppositions from soft triggers aren’t presuppositions at all, but\nrather entailments or scalar implicatures. In contrast, Abrusán\n(2011a, 2011b, 2016) argues that the difference between soft and hard\ntriggers emerges from how both types interact with the context, for\nexample with regard to their focus sensitivity.\n\nDespite the arguments made for a distinction between soft and hard\ntriggers, empirical studies have challenged the view that triggers\ndiffer in their conventional properties. Jayez et al (2014)\nfind that projection differences between different triggers\ndepend more on context than on the classification of the trigger\nitself. Schwarz (2014) compares processing times between hard and soft\ntriggers and finds that there is no difference between the two.\n\nWith the rise of arguments for more fine-grained variability among\npresuppositions, inferences that we may have confidently called\n’presuppositions’ have become harder to think of as forming a natural\nclass. For some, the inconsistency in trigger behavior has fed into\nsomething of a presupposition identity crisis, a crisis dating at\nleast as far back as Böer and Lycan’s (1976) description of\nsemantic presupposition as a \"myth\". Karttunen (2016) reflects on the\nstate of the field with an air of regret, saying that the \"veritable\nzoo\" of triggers that were lumped into the same presuppositional cage\nshould never have been considered the same species in the first place.\nUltimately, in order to either salvage a unified notion of\npresupposition, or else argue in a grand tradition (following e.g.\nBöer and Lycan 1976 or Karttunen and Peters 1977) for rejecting\nthe possibility of a unified notion of presupposition, it has become\npressing for linguists to understand how triggers and their inferences\nvary and why, fueling a trend in recent years towards systematic\nempirical work, looking for evidence of cross-linguistic variation,\nand developing methods for experimentally testing the predictions of\ndifferent theories.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abbott, Barbara, 2000, “Presuppositions as\nnonassertions”, <em>Journal of Pragmatics</em>, 32(10):\n1419–1437.",
                "Abbott, Barbara, 2008, “Issues in the semantics and\npragmatics of definite descriptions in English”, in\n<em>Reference: Interdisciplinary Perspectives</em>, J.K. Gundel and N.\nHedberg (eds.), Oxford University Press.",
                "Abbott, Barbara, 2006, “Where have some of the\npresuppositions gone?”, in <em>Drawing the boundaries of\nmeaning: Neo-Gricean studies in pragmatics and semantics in honor of\nLaurence R. Horn</em>, Betty Birner and Gregory Ward (eds.),\nPhiladelphia: John Benjamins.",
                "Abrusan, Marta, 2011a, \"Predicting the presupposition of soft\ntriggers\", <em>Linguistics and Philosophy</em>, 34(6): 491–535.",
                "Abrusan, Marta, 2011b, \"A note on quasi-presupposition and focus\",\n<em>Journal of Semantics, 30</em>(2), 257–265.",
                "Abrusan, Marta, 2016, \"Presupposition cancellation: explaining the\n’soft-hard’ trigger distinction\", <em>Natural Language Semantics</em>,\n24(2): 165–202.",
                "Abusch, Dorit, 2002, “Lexical alternatives as a source of\npragmatic presuppositions”, in Jackson, Brendan (ed.),\n<em>Proceedings of SALT XII</em>, Ithaca, NY: CLC Publications,\n1–20.",
                "Abusch, Dorit, 2010, \"Factivity in exclamatives is a\npresupposition\", <em>Studia Linguistica</em>, 64(1): 141–157.",
                "Abusch, Dorit and Rooth, Mats, 2000, “Empty-domain effects\nfor presuppositional and non-presuppositional determiners”, To\nappear in Hans Kamp and Barbara Partee (eds), Context Dependency in\nthe Analysis of Linguistic Meaning.",
                "Atlas, Jay, 1976, <em>On the Semantics of Presupposition and\nNegation: an Essay in Philosophical Logic and the Foundations of\nLinguistics</em>, Ph.D. thesis, Princeton University.",
                "Atlas, Jay, 1977, “Negation, ambiguity and\npresupposition”, <em>Linguistics and Philosophy</em>, 1:\n321–336.",
                "Atlas, Jay, 1979, “How linguistics matters to philosophy:\nPresupposition, truth, and meaning”, in Oh, C. K. and Dineen, D.\nA. (eds.), <em>Presupposition</em>, New York: Academic Press, vol. 11\nof <em>Syntax and Semantics</em>, 265–281.",
                "Atlas, Jay and Levinson, Stephen, 1981, “It-clefts,\ninformativeness and logical form: Radical pragmatics”, in Cole,\nPeter (ed.), <em>Radical Pragmatics</em>, Academic Press,\n1–61.",
                "Beaver, David, 1992, “The kinematics of\npresupposition”, in Dekker, P. and Stockhof, M. (eds.),\n<em>Proceedings of the Eighth Amsterdam Colloquium</em>, University of\nAmsterdam: <small>ILLC</small>, 17–36.",
                "Beaver, David, 1997, “Presupposition”, in van Benthem,\nJ. and ter Meulen, A. (eds.), <em>The Handbook of Logic and\nLanguage</em>, Amsterdam: Elsevier, 939–1008.",
                "Beaver, David, 2001, <em>Presupposition and Assertion in Dynamic\nSemantics</em>, Stanford, CA: CSLI Publications.\n [<a href=\"http://semanticsarchive.net/Archive/jU1MDVmZ/\" target=\"other\">Available online</a>]",
                "Beaver, David, 2008, “As brief as possible (but no\nbriefer)”, <em>Theoretical Linguistics</em>, 34:\n213–228.",
                "Beaver, D. (2010). \"Have You Noticed that Your Belly Button Lint\nColor is Related to the Color of Your Clothing?\", in R. Bauerle, U.\nReyle, and T. Zimmermann (eds.) <i>Presuppositions and discourse:\nEssays offered to Hans Kamp, </i>Brill, 65–100.",
                "Beaver, David and Condoravdi, Cleo, 2003, “A uniform\nanalysis of ”before“ and ”after“”, in\n<em>Proceedings of Semantics and Linguistic Theory XIII</em>, Cornell,\nIthaca: CLC Publications, 37–54.",
                "Beaver, David and Denlinger, Kristin, 2020, \"Negation and\nPresupposition\", in Deprez, V. and Espinal, M. T. (eds.), <i>The\nOxford Handbook of Negation</i>, 369–390.",
                "Beaver, David and Krahmer, Emiel, 2001, “A partial account\nof presupposition projection”, <em>Journal of Logic, Language\nand Information</em>, 10: 147–182.",
                "Beaver, David and Zeevat, Henk, 2007, “Accommodation”,\nin Ramchand, G. and Reiss, C. (eds.), <em>The Oxford Handbook of\nLinguistic Interfaces</em>, Oxford University Press,\n533–538.",
                "Blamey, Steven, 1989, “Partiality”, in Gabbay, D. and\nGuenther, F. (eds.), <em>The Handbook of Philosophical Logic</em>,\nDordrecht: Reidel, vol. IV, 553–616.",
                "Blutner, Reinhard, 2000, “Some aspects of optimality in\nnatural language interpretation”, <em>Journal of Semantics</em>,\n17(3): 189–216.",
                "Bochvar, Dmitrii Anatoljevich, 1939, “Ob odnom trehznachom\niscislenii i ego primeneii k analizu paradoksov klassicskogo\nrassirennogo funkcional ‘nogo iscislenija’”, <em>Matematiciskij\nSbornik</em>, 4: 87–112. English Translation: <em>History and\nPhilosophy of Logic</em> 2, 1981, “On a Three-valued Calculus\nand Its Applications to the Analysis of the Paradoxes of the Classical\nExtended Functional Calculus”.",
                "Böer, Steven E. and Lycan, William G., 1976, “The myth\nof semantic presupposition”, in Zwicky, A. (ed.), <em>Papers in\nnonphonology</em>, Columbus, Ohio: Department of Linguistics, Ohio\nState University, vol. 21 of <em>Working Papers in Linguistics</em>,\n1–90.",
                "Bridge, Derek, 1991, <em>Computing Presuppositions in an\nIncremental Natural Language Processing System</em>, Ph.D. thesis,\nUniversity of Cambridge Computer Laboratory. Available as Technical\nReport No. 237.",
                "Chemla, Emmanuel, 2008, \"An anti-introduction to presuppositions\",\nin <em>Proceedings of MIT-France workshop on scalar implicature and\npresupposition</em>, 60.",
                "Chemla, Emmanuel and Bott, Lewis, 2013, \"Processing\npresuppositions: Dynamic semantics vs. pragmatic enrichment\",\n<em>Language and Cognitive Processes</em>, 28(3): 241–260.",
                "Chierchia, Gennaro, 1995, <em>Dynamics of Meaning</em>, Chicago:\nUniversity of Chicago Press.",
                "Chierchia, Gennaro &amp; Sally McConnell-Ginet. 1990. Meaning and\nGrammar. Cambridge, Mass.: MIT Press.",
                "Clark, Herbert H. and Marshall, C., 1981, “Definite\nreference and mutual knowledge”, in Joshi, A. and Webber, B. L.\nand Sag, I. (eds.), <em>Elements of Discourse Understanding</em>,\nCambridge University Press.",
                "Cooper, Robin, 1983, <em>Quantification and Syntactic Theory</em>,\nDordrecht: Reidel.",
                "de Jong, Franciska and Verkuyl, Henk, 1985, “Generalized\nquantifiers: the properness of their strength”, in ter Meulen,\nA. and van Benthem, J. (eds.), <em>Generalized Quantifiers: Theory and\nApplications</em>, Dordrecht: Foris, vol. 4 of <em>GRASS</em>,\n21–43.",
                "Delin, Judy, 1995, “Presupposition and shared knowledge in\nit-clefts”, <em>Language and Cognitive Processes</em>, 10(2):\n97–120.",
                "van Eijck, Jan, 1993, “The dynamics of description”,\n<em>Journal of Semantics</em>, 10: 239–267.",
                "van Eijck, Jan, 1994, “Presupposition failure: a comedy of\nerrors”, <em>Formal Aspects of Computing</em>, 6(6):\n766–787.",
                "van Eijck, Jan, 1995, “Presuppositions and dynamic\nlogic”, in <em>Papers from the Second CSLI Workshop on Logic,\nLanguage and Computation</em>, Makoto Kanazawa, Christopher\nPiñon, and Henriette de Swart (eds.), Stanford: CSLI\nPublications.",
                "Fauconnier, Gilles, 1985, <em>Mental Spaces: Aspects of Meaning\nConstruction in Natural Language</em>, Cambridge, Massachusetts: MIT\nPress.",
                "Fillmore, Charles, 1971, “Verbs of judging: An exercise in\nsemantic description”, in Fillmore, C. and Langendoen, D. T.\n(eds.), <em>Studies in Linguistic Semantics</em>, New York.: Holt,\nReinhardt and Winston, 272–289.",
                "von Fintel, Kai, 1995, <em>Restrictions on Quantifier\nDomains</em>, Ph.D. thesis, University of Massachussetts at\nAmherst.",
                "von Fintel, Kai, 2004, “Would you believe it? The king of\nFrance is back! Presuppositions and truth-value intuitions”, in\nReimer, M. and Bezuidenhout, A. (eds.), <em>Descriptions and\nBeyond</em>, Oxford University Press, 269–296.",
                "von Fintel, Kai, 2008, \"What’s Presupposition Accommodation,\nAgain?\", <em>Philosophical Perspectives</em>, 22: 137–170.",
                "Fraassen, Bas C. van, 1968, “Presupposition, implication,\nand self-reference”, <em>The Journal of Philosophy</em>, 65(5):\n136–152.",
                "Frege, Gottlob, 1892, “Uber Sinn und Bedeutung”,\n<em>Zeitschrift fur Philosophie und philosophische Kritik</em>, C:\n25–50. English Translation: “On Sense and Meaning”,\nin McGuinness, B. (ed), <em>Frege: collected works</em>, Oxford: Basil\nBlackwell, 157–177.",
                "Gamut, L. T. F., 1991, <em>Logic, Language and Meaning</em>, vol.\n1, University of Chicago Press.",
                "Gawron, Jean Mark, 1995, “Quantification, quantificational\ndomains and dynamic logic”, in <em>Handbook of Contemporary\nSemantic Theory</em>, Shalom Lappin (ed.), Oxford: Blackwell,\n247–267.",
                "Gazdar, Gerald, 1979a, <em>Pragmatics: Implicature, Presupposition\nand Logical Form</em>, New York: Academic Press.",
                "Gazdar, Gerald, 1979b, “A solution to the projection\nproblem”, in Oh, C.-K. and Dineen, D. (eds.), <em>Syntax and\nSemantics 11: Presupposition</em>, New York: Academic Press,\n57–89.",
                "George, Benjamin R., 2008, <em>Presupposition Repairs: a Static,\nTrivalent Approach to Predicting Projection</em>, Master’s thesis,\nUCLA.",
                "Geurts, Bart, 1996, “Local satisfaction guaranteed”,\n<em>Linguistics and Philosophy</em>, 19: 259–294.",
                "Geurts, Bart, 1998, “Presuppositions and anaphors in\nattitude contexts”, <em>Linguistics and Philosophy</em>, 21:\n545–601.",
                "Geurts, Bart, 1999a, <em>Presuppositions and Pronouns</em>, vol. 3\nof <em>CRiSPI</em>, Amsterdam: Elsevier.\n [<a href=\"http://ncs.ruhosting.nl/bart/papers/pp.pdf\" target=\"other\">Available online</a>]",
                "Geurts, Bart, 1999b, “Specifics”, in Geurts, B. and\nKrifka, M. and van der Sandt, R. (eds.), <em>Focus and presupposition\nin multi-speaker discourse</em>, Utrecht: ESSLLI 99,\n99–129.",
                "Geurts, Bart, 2000, “Buoyancy and strength”,\n<em>Journal of Semantics</em>, 17(4): 315–333.",
                "Geurts, Bart, 2007, “Existential import”, in\nComorovski, I. and von Heusinger, K. (eds.), <em>Existence: syntax and\nsemantics</em>, Dordrecht: Springer, 253–271.",
                "Geurts, Bart and van der Sandt, Rob, 1999, “Domain\nrestriction”, in Bosch, P. and van der Sandt, R. (eds.),\n<em>Focus: Linguistic, Cognitive, and Computational Perspectives</em>,\nCambridge: Cambridge University Press, 268–292.",
                "Geurts, Bart and van der Sandt, Rob, 2004, “Interpreting\nfocus”, <em>Theoretical Linguistics</em>, 30(1):\n1–44.",
                "Grice, H. Paul, 1989, <em>Studies in the Way of Words</em>,\nCambridge, Massachusetts: Harvard University Press.",
                "Groenendijk, Jeroen and Stokhof, Martin, 1991, “Dynamic\nPredicate Logic”, <em>Linguistics and Philosophy</em>, 14:\n39–100.",
                "Gunji, Takao, 1981, <em>Towards a Computational Theory of\nPragmatics—Discourse, Presupposition and Implicature</em>, Ph.D.\nthesis, Ohio State University.",
                "Hamblin, Charles L., 1970, <em>Fallacies</em>, London: Methuen\n&amp; Co.",
                "Hawkins, J.A., 1978, <em>Definiteness and Indefiniteness: A Study\nin Reference and Grammaticality Prediction</em>, Croom Helm.",
                "Heim, Irene, 1982, <em>On the Semantics of Definite and Indefinite\nNoun Phrases</em>, Ph.D. thesis, University of Massachusetts at\nAmherst.",
                "Heim, Irene, 1983, “On the projection problem for\npresuppositions”, in Barlow, M. and Flickinger, D. and Westcoat,\nM. (eds.), <em>Second Annual West Coast Conference on Formal\nLinguistics</em>, Stanford University, 114–126.",
                "Heim, Irene, 1992, “Presupposition Projection and the\nSemantics of Attitude Verbs”, <em>Journal of Semantics</em>, 9:\n183–221.",
                "Heinämäki, Orvokki, 1974, <em>Semantics of English\nTemporal Connectives</em>, Ph.D. thesis, University of Indiana at\nBloomington.",
                "Horn, Laurence, 1969, “A presuppositional analysis of\n<em>only</em> and <em>even</em>”, in <em>Papers from the Fifth\nRegional Meeting of the Chicago Linguistics Society</em>, University\nof Chicago, 98–107.",
                "Horn, Laurence, 1972, <em>On the semantic properties of logical\noperators in English</em>, Ph.D. thesis, University of California, Los\nAngeles.",
                "Horn, Laurence, 1985, “Metalinguistic Negation and Pragmatic\nAmbiguity”, <em>Language</em>, 61: 121–174.",
                "Horn, Laurence, 1989, <em>A Natural History of Negation</em>,\nUniversity of Chicago Press. Reissued with new introduction (2001),\nDavid Hume Series, CSLI Publications, Stanford.",
                "Horton, Diane, 1987, “Incorporating agents’ beliefs in a\nmodel of presupposition”, Tech. Rep. CSRI-201, Computer Systems\nResearch Institute, University of Toronto.",
                "Horton, Diane and Hirst, Graeme, 1988, “Presuppositions as\nbeliefs”, in <em>Proceedings of the International Conference on\nComputational Linguistics, COLING</em>, 255–260.",
                "Jackendoff, Ray, 1972, <em>Semantic Interpretation in Generative\nGrammar</em>, MIT Press.",
                "Jayez, Jacques, Mongelli, Valeria, Reboul, Anne and Van Der Henst,\nJean-Bapteiste, 2014 \"Weak and strong triggers\", in <em>Experimental\nperspectives on presuppositions</em>, Cham: Springer, 173–193.",
                "Karttunen, Lauri, 1971a, “Implicative verbs”,\n<em>Language</em>, 47(2): 340–358.",
                "Karttunen, Lauri, 1971b, “Some Observations on\nFactivity”, <em>Papers in Linguistics</em>, 5: 55–69.",
                "Karttunen, Lauri, 1973, “Presuppositions of Compound\nSentences”, <em>Linguistic Inquiry</em>, 4: 167–193.",
                "Karttunen, Lauri, 1974, “Presuppositions and Linguistic\nContext”, <em>Theoretical Linguistics</em>, 1:\n181–194.",
                "Karttunen, Lauri and Peters, Stanley, 1977, “Requiem for\npresupposition”, in <em>BLS3, Proceedings of the Third Annual\nMeeting of the Berkeley Linguistic Society</em>, Berkeley: California:\n266–278.",
                "Karttunen, Lauri and Peters, Stanley, 1979, “Conventional\nImplicatures in Montague Grammar”, in Oh, C.-K. and Dineen, D.\n(eds.), <em>Syntax and Semantics 11: Presupposition</em>, New York:\nAcademic Press, 1–56.",
                "Karttunen, Lauri, 2016, \"Presupposition: What went wrong?\", in\n<em>Semantics and Linguistic Theory</em>, 26: 705–731.",
                "Kay, Paul, 1992, “The inheritance of presuppositions”,\n<em>Linguistics and Philosophy</em>, 15: 333–381.",
                "Kempson, Ruth, 1975, <em>Presupposition and the Delimitation of\nSemantics</em>, Cambridge: Cambridge University Press.",
                "Kim, Christina, 2008, \"Processing presupposition: verifying\nsentences with ‘only’\", <em>University of Pennsylvania\nWorking Papers in Linguistics</em>, 14(1): 17.",
                "Kiparsky, Paul and Kiparsky, Carol, 1970, “Fact”, in\nBierwisch, M. and Heidolph, K. (eds.), <em>Progress in\nLinguistics</em>, The Hague: Mouton, 143–173.",
                "Kleene, Stephen, 1952, <em>Introduction to Metamathematics</em>,\nAmsterdam: North-Holland.",
                "Krahmer, Emiel, 1994, “Partiality and dynamics”, in\nDekker, P. and Stokhof, M. (eds.), <em>Proceedings of the Ninth\nAmsterdam Colloquium: Volume 2</em>, University of Amsterdam:\n<small>ILLC</small>, 391–410.",
                "Krahmer, Emiel, 1998, <em>Presupposition and Anaphora</em>,\nStanford: CSLI Publications.",
                "Kripke, Saul, 2009, “Presupposition and anaphora: Remarks on\nthe formulation of the projection problem”, <em>Linguistic\nInquiry</em>, 40: 367–386.",
                "Langendoen, D. Terence and Savin, Harris, 1971, “The\nprojection problem for presuppositions”, in Fillmore, C. and\nLangendoen, D. T. (eds.), <em>Studies in Linguistic Semantics</em>,\nNew York: Holt, Reinhardt and Winston, 373–388.",
                "Lappin, Shalom and Reinhart, Tanya, 1988, “Presuppositions\nof quantifiers: a processing account”, <em>Linguistics</em>, 26:\n1021–1037.",
                "Lewis, David, 1979, “Scorekeeping in a language game”,\n<em>Journal of Philosophical Logic</em>, 8: 339–359. Also in\nBäuerle, R. and Egli, U. and von Stechow, A. (eds.), 1979,\n<em>Semantics from Different Points of View</em>, Springer,\nBerlin.",
                "Lorenz, Sven, 1992, “On the role of reasoning about change\nin the projection of presuppositions”, Report 234, IWBS, IBM\nGermany.",
                "Mandelkern, Matthew, 2016, \"A note on the architecture of\npresupposition\", <em>Semantics and Pragmatics</em>, 9(13): 1–24.",
                "Marcu, Daniel, 1994, <em>A Formalisation and an Algorithm for\nComputing Pragmatic Inferences and Detecting Infelicities</em>, Ph.D.\nthesis, University of Toronto, Computer Systems Research Institute.\nAvailable as Technical Report CSRI-309, Computer Research Institute,\nUniversity of Toronto.",
                "McCawley, James, 1981, <em>Everything That Linguists Have Always\nWanted to Know about Logic (but Were Ashamed to Ask)</em>, University\nof Chicago Press.",
                "Mercer, Robert, 1987, <em>A Default Logic Approach to the\nDerivation of Natural Language Presuppositions</em>, Ph.D. thesis,\nUniversity of British Columbia.",
                "Mercer, Robert, 1992, “Default Logic: Towards a common\nlogical semantics for presupposition and entailment”,\n<em>Journal of Semantics</em>, 9: 223–250.",
                "Morgan, Jerry, 1969, “On the Treatment of Presupposition in\nTransformational Grammar”, in <em>Papers from the Fifth Regional\nMeeting, Chicago Linguistic Society</em>, University of Chicago,\n167–77.",
                "Nerlich, G., 1967, “Presupposition and Classical Logical\nRelations”, <em>Analysis</em>, 27(3): 104–106.",
                "Pearson, Hazel, 2013, \"A Judge-Free Semantics for Predicates of\nPersonal Taste\", Journal of Semantics, 30: 103–154.",
                "Peters, Stanley, 1979, “A truth-conditional formulation of\nKarttunen’s account of presupposition”, <em>Synthese</em>,\n40(2): 301–316.",
                "Percus, Orin, 2006, \"Antipresuppositions\", in A. Ueyama (ed.)\n<em>Theoretical and empirical studies of reference and anaphora</em>,\nJapan Society for the Promotion of Science: Report of the Grant-in-Aid\nfor Scientific Research B.",
                "Potts, Christopher, 2005, <em>The logic of conventional\nimplicatures</em>, New York: Oxford University Press.",
                "Prince, Ellen, 1986, “On the syntactic marking of\npresupposed open propositions”, in Farley, A. M. and Farley, P.\nT. and McCullough, K.-E. (eds.), <em>Papers from the Parasession on\nPragmatics and Grammatical Theory, 22nd Regional Meeting of the\nChicago Linguistic Society</em>, University of Chicago, 208–222.",
                "Reinhart, Tanya, 1982, “Pragmatics and Linguistics: An\nAnalysis of Sentence Topics”, <em>Philosophica</em>, 27:\n53–94.",
                "Roberts, Craige, 1995, “Domain Selection in Dynamic\nSemantics”, in Bach, E. Jelinek, E. and Kratzer, A. and Partee,\nB. (eds.), <em>Quantification in Natural Languages</em>, Dordrecht:\nKluwer, 661–700.",
                "Roberts, Craige, 1998, “Focus, the flow of information, and\nuniversal grammar”, in Culicover, P. and McNally, L. (eds.),\n<em>The Limits of Syntax</em>, New York: Academic Press, 109–160.",
                "Roberts, Craige., 2012, \"Information structure: Towards an\nintegrated formal theory of pragmatics\", Semantics and Pragmatics, 5:\n1–69.",
                "Romoli, Jacopo, 2011, \"The presuppositions of soft triggers aren’t\npresuppositions\", <em>Semantics and Linguistic Theory</em>, 21:\n236–256.",
                "Romoli, Jacopo, 2014, \"The presuppositions of soft triggers are\nobligatory scalar implicatures\", <em>Journal of Semantics</em>, 32(2):\n173–219.",
                "Romoli, Jacopo, Sudo, Yasutada and Snedeker, Jesse, 2011, \"An\nexperimental investigation of presupposition projection in conditional\nsentences\", <em>Semantics and Linguistic Theory</em>, 21:\n592–608.",
                "Romoli, Jacopo &amp; Schwarz, Florian (2014), \"An experimental\ncomparison between presuppositions and indirect scalar implicatures\",\nin F. Schwarz (ed.), <em>Experimental Perspectives on\nPresuppositions</em>, Cham: Springer, 215–240.",
                "van Rooij, Robert, 2007, “Strengthening conditional\npresuppositions”, <em>Journal of Semantics</em>, 24:\n289–304.",
                "Rothschild, Daniel, 2008, “Presupposition projection and\nlogical equivalence”, <em>Philosophical Perspectives</em>,\n22(1): 473–497.",
                "Russell, Bertrand, 1905, “On Denoting”, <em>Mind</em>,\n14: 479–493.",
                "Sæbø, Kjell Johan, 1996, “Anaphoric\npresuppositions and zero anaphora”, <em>Linguistics and\nPhilosophy</em>, 19: 187–209.",
                "van der Sandt, Rob, 1982, <em>Kontekst en Presuppositie: Een\nStudie van het Projektieprobleem en de Presuppositionele Eigenschappen\nvan de Logische Konnektieven</em>, Ph.D. thesis, Nijmegen Institute of\nSemantics.",
                "van der Sandt, Rob, 1988, <em>Context and Presupposition</em>,\nLondon: Croom Helm.",
                "van der Sandt, Rob, 1989, “Presupposition and discourse\nstructure”, in Bartsch, R. van Benthem, J. and van Emde Boas, P.\n(eds.), <em>Semantics and Contextual Expression</em>, Dordrecht:\nForis, 287–94.",
                "van der Sandt, Rob, 1992, “Presupposition projection as\nanaphora resolution”, <em>Journal of Semantics</em>, 9:\n333–377.",
                "Schlenker, Philippe, 2007, “Anti-dynamics: Presupposition\nprojection without dynamic semantics”, <em>Journal of Logic,\nLanguage and Information</em>, 16(3): 325–256.",
                "Schlenker, Philippe, 2008, “Be articulate: A pragmatic\ntheory of presupposition”, <em>Theoretical Linguistics</em>, 34:\n157–212.",
                "Schlenker, Philippe, 2009, “Local contexts”,\n<em>Semantics and Pragmatics</em>, 2(3): 1–78.",
                "Schlenker, Philippe, 2011, \"The proviso problem: a note\",\n<em>Natural Language Semantics</em>, 19(4): 395–422.",
                "Schlenker, Philippe, 2015, \"Gestural presuppositions\",\n<em>Snippets</em>, 30: 9–11.",
                "Schlenker, Philippe, 2018, \"Gesture projection and\ncosuppositions\", <em>Linguistics and Philosophy</em>, 41:\n295–365.",
                "Schwarz, Florian (ed.), 2014, <em>Experimental perspectives on\npresuppositions</em>, Cham: Springer.",
                "Sellars, W., 1954, “Presupposing”, <em>Philosophical\nReview</em>, 63: 197–215.",
                "Simons, Mandy, 2001, “On the conversational basis of some\npresuppositions”, in Hastings, R. and Jackson, B. and Zvolensky,\nZ. (eds.), <em>Proceedings of Semantics and Linguistics Theory\n11</em>, Ithaca, NY: CLC Publications, 431–448.",
                "Simons, Mandy, 2003, “Presupposition and accommodation:\nUnderstanding the Stalnakerian picture”, <em>Philosophical\nStudies</em>, 112(3): 251–278.",
                "Simons, Mandy, 2004, “Presupposition and relevance”,\nin Zoltán Szabó (ed.), <em>Semantics vs.\nPragmatics</em>, Oxford University Press, 329–355.",
                "Simons, Mandy, 2006, “Foundational issues in\npresupposition”, <em>Philosophy Compass</em>, 1(4):\n357–372.",
                "Simons, Mandy, 2007, “Observations on embedding verbs,\nevidentiality, and presupposition”, <em>Lingua</em>, 117(6):\n1034–1056.",
                "Simons, Mandy, Tonhauser, Judith, Beaver, David and Roberts,\nCraige, 2010, \"What projects and why\", <em>Semantics and Linguistic\nTheory</em>, 20: 309–327.",
                "Singh, Raj, 2007a, “Formal alternatives as a solution to the\nproviso problem”, in Gibson, M. and Friedman, T. (eds.),\n<em>Proceedings of the 17th Conference on Semantics and Linguistic\nTheory</em>, Ithaca, NY: CLC Publications, Cornell University,\n264–228.",
                "Singh, Raj, 2009, \"Symmetric and interacting alternatives for\nimplicature and accommodation\", in N. Klinedinst and D. Rothschild\n(eds.), <em>Proceedings of the ESSLLI 2009 Workshop: New directions in\nthe theory of presupposition</em>.",
                "Soames, Scott, 1979, “A projection problem for speaker\npresuppositions”, <em>Linguistic Inquiry</em>, 10:\n623–666.",
                "Soames, Scott, 1982, “How presuppositions are inherited: a\nsolution to the projection problem”, <em>Linguistic\nInquiry</em>, 13: 483–545.",
                "Soames, Scott, 1989, “Presupposition”, in Gabbay, D.\nand Guenther, F. (eds.), <em>Handbook of Philosophical Logic</em>,\nDordrecht: Reidel, vol. IV, 553–616.",
                "Stalnaker, Robert, 1972, “Pragmatics”, in Davidson, D.\nand Harman, G. (eds.), <em>Semantics of Natural Language</em>, Reidel:\nDordrecht, 389–408.",
                "Stalnaker, Robert, 1973, “Presuppositions”, <em>The\nJournal of Philosophical Logic</em>, 2: 447–457.",
                "Stalnaker, Robert, 1974, “Pragmatic presuppositions”,\nin Munitz, M. and Unger, P. (eds.), <em>Semantics and Philosophy</em>,\nNew York University Press, 197–214.",
                "Stalnaker, Robert, 1998, “On the representation of\ncontext”, <em>Journal of Logic, Language and Information</em>,\n7: 3–19.",
                "Strawson, Peter F., 1950, “On referring”,\n<em>Mind</em>, 59: 320–44.",
                "Strawson, Peter F., 1952, <em>Introduction to Logical Theory</em>,\nLondon: Methuen.",
                "Strawson, Peter F., 1954, “A Reply to Mr. Sellars”,\n<em>Philosophical Review</em>, 63: 216–231.",
                "Strawson, Peter F., 1964, “Identifying reference and\ntruth-values”, <em>Theoria</em>, 30: 96–118. Reprinted in:\n<em>Logico-linguistic Papers</em>. Methuen, London, 1974,\n75–95.",
                "Tiemann, Sonja, Schmid, Mareike, Bade, Nadine, Rolke, Bettina,\nHertrich, Ingo, Ackermann, Hermann, Knapp, Julia, and Beck, Sigrid,\n2011, \"Psycholinguistic evidence for presuppositions: On-line and\noff-line data\", in <em>Proceedings of Sinn &amp; Bedeutung</em>,\n15(15): 581–595.",
                "Tonhauser, Judith, 2012, \"Diagnosing (not-) at-issue content\",\n<em>Proceedings of Semantics of Under-represented Languages of the\nAmericas</em> (SULA), 6: 239–254",
                "Tonhauser, Judith, Beaver, David, Roberts, Craig, and Simons,\nMandy, 2013, \"Toward a taxonomy of projective content\",\n<em>Language</em>, 89(1): 66–109.",
                "Thomason, Richmond, 1972, “A semantic theory of sortal\nincorrectness”, <em>Journal of Philosophical Logic</em>, 1:\n209–258.",
                "Veltman, Frank, 1996, “Defaults in update semantics”,\n<em>Journal of Philosophical Logic</em>, 25: 221–261.",
                "Wilson, Deidre, 1975, <em>Presupposition and Non-truth-conditional\nSemantics</em>, London: Academic Press.",
                "Yeom, J.I., 1998, <em>A Presuppositional Analysis of Specific\nIndefinites: Common Grounds as Structured Information States</em>,\nGarland Publishing.",
                "Zeevat, H., 1999, “Explaining presupposition\ntriggers”, in <em>Proceedings of the Twelfth Amsterdam\nColloquium, ILLC, Amsterdam</em>, 19–24.",
                "Zeevat, Henk, 1992, “Presupposition and accommodation in\nupdate semantics”, <em>Journal of Semantics</em>, 9:\n379–412."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Abbott, Barbara, 2000, “Presuppositions as\nnonassertions”, <em>Journal of Pragmatics</em>, 32(10):\n1419–1437.</li>\n<li>Abbott, Barbara, 2008, “Issues in the semantics and\npragmatics of definite descriptions in English”, in\n<em>Reference: Interdisciplinary Perspectives</em>, J.K. Gundel and N.\nHedberg (eds.), Oxford University Press.</li>\n<li>Abbott, Barbara, 2006, “Where have some of the\npresuppositions gone?”, in <em>Drawing the boundaries of\nmeaning: Neo-Gricean studies in pragmatics and semantics in honor of\nLaurence R. Horn</em>, Betty Birner and Gregory Ward (eds.),\nPhiladelphia: John Benjamins.</li>\n<li>Abrusan, Marta, 2011a, \"Predicting the presupposition of soft\ntriggers\", <em>Linguistics and Philosophy</em>, 34(6): 491–535.</li>\n<li>Abrusan, Marta, 2011b, \"A note on quasi-presupposition and focus\",\n<em>Journal of Semantics, 30</em>(2), 257–265.</li>\n<li>Abrusan, Marta, 2016, \"Presupposition cancellation: explaining the\n’soft-hard’ trigger distinction\", <em>Natural Language Semantics</em>,\n24(2): 165–202.</li>\n<li>Abusch, Dorit, 2002, “Lexical alternatives as a source of\npragmatic presuppositions”, in Jackson, Brendan (ed.),\n<em>Proceedings of SALT XII</em>, Ithaca, NY: CLC Publications,\n1–20.</li>\n<li>Abusch, Dorit, 2010, \"Factivity in exclamatives is a\npresupposition\", <em>Studia Linguistica</em>, 64(1): 141–157.</li>\n<li>Abusch, Dorit and Rooth, Mats, 2000, “Empty-domain effects\nfor presuppositional and non-presuppositional determiners”, To\nappear in Hans Kamp and Barbara Partee (eds), Context Dependency in\nthe Analysis of Linguistic Meaning.</li>\n<li>Atlas, Jay, 1976, <em>On the Semantics of Presupposition and\nNegation: an Essay in Philosophical Logic and the Foundations of\nLinguistics</em>, Ph.D. thesis, Princeton University.</li>\n<li>Atlas, Jay, 1977, “Negation, ambiguity and\npresupposition”, <em>Linguistics and Philosophy</em>, 1:\n321–336.</li>\n<li>Atlas, Jay, 1979, “How linguistics matters to philosophy:\nPresupposition, truth, and meaning”, in Oh, C. K. and Dineen, D.\nA. (eds.), <em>Presupposition</em>, New York: Academic Press, vol. 11\nof <em>Syntax and Semantics</em>, 265–281.</li>\n<li>Atlas, Jay and Levinson, Stephen, 1981, “It-clefts,\ninformativeness and logical form: Radical pragmatics”, in Cole,\nPeter (ed.), <em>Radical Pragmatics</em>, Academic Press,\n1–61.</li>\n<li>Beaver, David, 1992, “The kinematics of\npresupposition”, in Dekker, P. and Stockhof, M. (eds.),\n<em>Proceedings of the Eighth Amsterdam Colloquium</em>, University of\nAmsterdam: <small>ILLC</small>, 17–36.</li>\n<li>Beaver, David, 1997, “Presupposition”, in van Benthem,\nJ. and ter Meulen, A. (eds.), <em>The Handbook of Logic and\nLanguage</em>, Amsterdam: Elsevier, 939–1008.</li>\n<li>Beaver, David, 2001, <em>Presupposition and Assertion in Dynamic\nSemantics</em>, Stanford, CA: CSLI Publications.\n [<a href=\"http://semanticsarchive.net/Archive/jU1MDVmZ/\" target=\"other\">Available online</a>]</li>\n<li>Beaver, David, 2008, “As brief as possible (but no\nbriefer)”, <em>Theoretical Linguistics</em>, 34:\n213–228.</li>\n<li>Beaver, D. (2010). \"Have You Noticed that Your Belly Button Lint\nColor is Related to the Color of Your Clothing?\", in R. Bauerle, U.\nReyle, and T. Zimmermann (eds.) <i>Presuppositions and discourse:\nEssays offered to Hans Kamp, </i>Brill, 65–100.</li>\n<li>Beaver, David and Condoravdi, Cleo, 2003, “A uniform\nanalysis of ”before“ and ”after“”, in\n<em>Proceedings of Semantics and Linguistic Theory XIII</em>, Cornell,\nIthaca: CLC Publications, 37–54.</li>\n<li>Beaver, David and Denlinger, Kristin, 2020, \"Negation and\nPresupposition\", in Deprez, V. and Espinal, M. T. (eds.), <i>The\nOxford Handbook of Negation</i>, 369–390.</li>\n<li>Beaver, David and Krahmer, Emiel, 2001, “A partial account\nof presupposition projection”, <em>Journal of Logic, Language\nand Information</em>, 10: 147–182.</li>\n<li>Beaver, David and Zeevat, Henk, 2007, “Accommodation”,\nin Ramchand, G. and Reiss, C. (eds.), <em>The Oxford Handbook of\nLinguistic Interfaces</em>, Oxford University Press,\n533–538.</li>\n<li>Blamey, Steven, 1989, “Partiality”, in Gabbay, D. and\nGuenther, F. (eds.), <em>The Handbook of Philosophical Logic</em>,\nDordrecht: Reidel, vol. IV, 553–616.</li>\n<li>Blutner, Reinhard, 2000, “Some aspects of optimality in\nnatural language interpretation”, <em>Journal of Semantics</em>,\n17(3): 189–216.</li>\n<li>Bochvar, Dmitrii Anatoljevich, 1939, “Ob odnom trehznachom\niscislenii i ego primeneii k analizu paradoksov klassicskogo\nrassirennogo funkcional ‘nogo iscislenija’”, <em>Matematiciskij\nSbornik</em>, 4: 87–112. English Translation: <em>History and\nPhilosophy of Logic</em> 2, 1981, “On a Three-valued Calculus\nand Its Applications to the Analysis of the Paradoxes of the Classical\nExtended Functional Calculus”.</li>\n<li>Böer, Steven E. and Lycan, William G., 1976, “The myth\nof semantic presupposition”, in Zwicky, A. (ed.), <em>Papers in\nnonphonology</em>, Columbus, Ohio: Department of Linguistics, Ohio\nState University, vol. 21 of <em>Working Papers in Linguistics</em>,\n1–90.</li>\n<li>Bridge, Derek, 1991, <em>Computing Presuppositions in an\nIncremental Natural Language Processing System</em>, Ph.D. thesis,\nUniversity of Cambridge Computer Laboratory. Available as Technical\nReport No. 237.</li>\n<li>Chemla, Emmanuel, 2008, \"An anti-introduction to presuppositions\",\nin <em>Proceedings of MIT-France workshop on scalar implicature and\npresupposition</em>, 60.</li>\n<li>Chemla, Emmanuel and Bott, Lewis, 2013, \"Processing\npresuppositions: Dynamic semantics vs. pragmatic enrichment\",\n<em>Language and Cognitive Processes</em>, 28(3): 241–260.</li>\n<li>Chierchia, Gennaro, 1995, <em>Dynamics of Meaning</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Chierchia, Gennaro &amp; Sally McConnell-Ginet. 1990. Meaning and\nGrammar. Cambridge, Mass.: MIT Press.</li>\n<li>Clark, Herbert H. and Marshall, C., 1981, “Definite\nreference and mutual knowledge”, in Joshi, A. and Webber, B. L.\nand Sag, I. (eds.), <em>Elements of Discourse Understanding</em>,\nCambridge University Press.</li>\n<li>Cooper, Robin, 1983, <em>Quantification and Syntactic Theory</em>,\nDordrecht: Reidel.</li>\n<li>de Jong, Franciska and Verkuyl, Henk, 1985, “Generalized\nquantifiers: the properness of their strength”, in ter Meulen,\nA. and van Benthem, J. (eds.), <em>Generalized Quantifiers: Theory and\nApplications</em>, Dordrecht: Foris, vol. 4 of <em>GRASS</em>,\n21–43.</li>\n<li>Delin, Judy, 1995, “Presupposition and shared knowledge in\nit-clefts”, <em>Language and Cognitive Processes</em>, 10(2):\n97–120.</li>\n<li>van Eijck, Jan, 1993, “The dynamics of description”,\n<em>Journal of Semantics</em>, 10: 239–267.</li>\n<li>van Eijck, Jan, 1994, “Presupposition failure: a comedy of\nerrors”, <em>Formal Aspects of Computing</em>, 6(6):\n766–787.</li>\n<li>van Eijck, Jan, 1995, “Presuppositions and dynamic\nlogic”, in <em>Papers from the Second CSLI Workshop on Logic,\nLanguage and Computation</em>, Makoto Kanazawa, Christopher\nPiñon, and Henriette de Swart (eds.), Stanford: CSLI\nPublications.</li>\n<li>Fauconnier, Gilles, 1985, <em>Mental Spaces: Aspects of Meaning\nConstruction in Natural Language</em>, Cambridge, Massachusetts: MIT\nPress.</li>\n<li>Fillmore, Charles, 1971, “Verbs of judging: An exercise in\nsemantic description”, in Fillmore, C. and Langendoen, D. T.\n(eds.), <em>Studies in Linguistic Semantics</em>, New York.: Holt,\nReinhardt and Winston, 272–289.</li>\n<li>von Fintel, Kai, 1995, <em>Restrictions on Quantifier\nDomains</em>, Ph.D. thesis, University of Massachussetts at\nAmherst.</li>\n<li>von Fintel, Kai, 2004, “Would you believe it? The king of\nFrance is back! Presuppositions and truth-value intuitions”, in\nReimer, M. and Bezuidenhout, A. (eds.), <em>Descriptions and\nBeyond</em>, Oxford University Press, 269–296.</li>\n<li>von Fintel, Kai, 2008, \"What’s Presupposition Accommodation,\nAgain?\", <em>Philosophical Perspectives</em>, 22: 137–170.</li>\n<li>Fraassen, Bas C. van, 1968, “Presupposition, implication,\nand self-reference”, <em>The Journal of Philosophy</em>, 65(5):\n136–152.</li>\n<li>Frege, Gottlob, 1892, “Uber Sinn und Bedeutung”,\n<em>Zeitschrift fur Philosophie und philosophische Kritik</em>, C:\n25–50. English Translation: “On Sense and Meaning”,\nin McGuinness, B. (ed), <em>Frege: collected works</em>, Oxford: Basil\nBlackwell, 157–177.</li>\n<li>Gamut, L. T. F., 1991, <em>Logic, Language and Meaning</em>, vol.\n1, University of Chicago Press.</li>\n<li>Gawron, Jean Mark, 1995, “Quantification, quantificational\ndomains and dynamic logic”, in <em>Handbook of Contemporary\nSemantic Theory</em>, Shalom Lappin (ed.), Oxford: Blackwell,\n247–267.</li>\n<li>Gazdar, Gerald, 1979a, <em>Pragmatics: Implicature, Presupposition\nand Logical Form</em>, New York: Academic Press.</li>\n<li>Gazdar, Gerald, 1979b, “A solution to the projection\nproblem”, in Oh, C.-K. and Dineen, D. (eds.), <em>Syntax and\nSemantics 11: Presupposition</em>, New York: Academic Press,\n57–89.</li>\n<li>George, Benjamin R., 2008, <em>Presupposition Repairs: a Static,\nTrivalent Approach to Predicting Projection</em>, Master’s thesis,\nUCLA.</li>\n<li>Geurts, Bart, 1996, “Local satisfaction guaranteed”,\n<em>Linguistics and Philosophy</em>, 19: 259–294.</li>\n<li>Geurts, Bart, 1998, “Presuppositions and anaphors in\nattitude contexts”, <em>Linguistics and Philosophy</em>, 21:\n545–601.</li>\n<li>Geurts, Bart, 1999a, <em>Presuppositions and Pronouns</em>, vol. 3\nof <em>CRiSPI</em>, Amsterdam: Elsevier.\n [<a href=\"http://ncs.ruhosting.nl/bart/papers/pp.pdf\" target=\"other\">Available online</a>]</li>\n<li>Geurts, Bart, 1999b, “Specifics”, in Geurts, B. and\nKrifka, M. and van der Sandt, R. (eds.), <em>Focus and presupposition\nin multi-speaker discourse</em>, Utrecht: ESSLLI 99,\n99–129.</li>\n<li>Geurts, Bart, 2000, “Buoyancy and strength”,\n<em>Journal of Semantics</em>, 17(4): 315–333.</li>\n<li>Geurts, Bart, 2007, “Existential import”, in\nComorovski, I. and von Heusinger, K. (eds.), <em>Existence: syntax and\nsemantics</em>, Dordrecht: Springer, 253–271.</li>\n<li>Geurts, Bart and van der Sandt, Rob, 1999, “Domain\nrestriction”, in Bosch, P. and van der Sandt, R. (eds.),\n<em>Focus: Linguistic, Cognitive, and Computational Perspectives</em>,\nCambridge: Cambridge University Press, 268–292.</li>\n<li>Geurts, Bart and van der Sandt, Rob, 2004, “Interpreting\nfocus”, <em>Theoretical Linguistics</em>, 30(1):\n1–44.</li>\n<li>Grice, H. Paul, 1989, <em>Studies in the Way of Words</em>,\nCambridge, Massachusetts: Harvard University Press.</li>\n<li>Groenendijk, Jeroen and Stokhof, Martin, 1991, “Dynamic\nPredicate Logic”, <em>Linguistics and Philosophy</em>, 14:\n39–100.</li>\n<li>Gunji, Takao, 1981, <em>Towards a Computational Theory of\nPragmatics—Discourse, Presupposition and Implicature</em>, Ph.D.\nthesis, Ohio State University.</li>\n<li>Hamblin, Charles L., 1970, <em>Fallacies</em>, London: Methuen\n&amp; Co.</li>\n<li>Hawkins, J.A., 1978, <em>Definiteness and Indefiniteness: A Study\nin Reference and Grammaticality Prediction</em>, Croom Helm.</li>\n<li>Heim, Irene, 1982, <em>On the Semantics of Definite and Indefinite\nNoun Phrases</em>, Ph.D. thesis, University of Massachusetts at\nAmherst.</li>\n<li>Heim, Irene, 1983, “On the projection problem for\npresuppositions”, in Barlow, M. and Flickinger, D. and Westcoat,\nM. (eds.), <em>Second Annual West Coast Conference on Formal\nLinguistics</em>, Stanford University, 114–126.</li>\n<li>Heim, Irene, 1992, “Presupposition Projection and the\nSemantics of Attitude Verbs”, <em>Journal of Semantics</em>, 9:\n183–221.</li>\n<li>Heinämäki, Orvokki, 1974, <em>Semantics of English\nTemporal Connectives</em>, Ph.D. thesis, University of Indiana at\nBloomington.</li>\n<li>Horn, Laurence, 1969, “A presuppositional analysis of\n<em>only</em> and <em>even</em>”, in <em>Papers from the Fifth\nRegional Meeting of the Chicago Linguistics Society</em>, University\nof Chicago, 98–107.</li>\n<li>Horn, Laurence, 1972, <em>On the semantic properties of logical\noperators in English</em>, Ph.D. thesis, University of California, Los\nAngeles.</li>\n<li>Horn, Laurence, 1985, “Metalinguistic Negation and Pragmatic\nAmbiguity”, <em>Language</em>, 61: 121–174.</li>\n<li>Horn, Laurence, 1989, <em>A Natural History of Negation</em>,\nUniversity of Chicago Press. Reissued with new introduction (2001),\nDavid Hume Series, CSLI Publications, Stanford.</li>\n<li>Horton, Diane, 1987, “Incorporating agents’ beliefs in a\nmodel of presupposition”, Tech. Rep. CSRI-201, Computer Systems\nResearch Institute, University of Toronto.</li>\n<li>Horton, Diane and Hirst, Graeme, 1988, “Presuppositions as\nbeliefs”, in <em>Proceedings of the International Conference on\nComputational Linguistics, COLING</em>, 255–260.</li>\n<li>Jackendoff, Ray, 1972, <em>Semantic Interpretation in Generative\nGrammar</em>, MIT Press.</li>\n<li>Jayez, Jacques, Mongelli, Valeria, Reboul, Anne and Van Der Henst,\nJean-Bapteiste, 2014 \"Weak and strong triggers\", in <em>Experimental\nperspectives on presuppositions</em>, Cham: Springer, 173–193.</li>\n<li>Karttunen, Lauri, 1971a, “Implicative verbs”,\n<em>Language</em>, 47(2): 340–358.</li>\n<li>Karttunen, Lauri, 1971b, “Some Observations on\nFactivity”, <em>Papers in Linguistics</em>, 5: 55–69.</li>\n<li>Karttunen, Lauri, 1973, “Presuppositions of Compound\nSentences”, <em>Linguistic Inquiry</em>, 4: 167–193.</li>\n<li>Karttunen, Lauri, 1974, “Presuppositions and Linguistic\nContext”, <em>Theoretical Linguistics</em>, 1:\n181–194.</li>\n<li>Karttunen, Lauri and Peters, Stanley, 1977, “Requiem for\npresupposition”, in <em>BLS3, Proceedings of the Third Annual\nMeeting of the Berkeley Linguistic Society</em>, Berkeley: California:\n266–278.</li>\n<li>Karttunen, Lauri and Peters, Stanley, 1979, “Conventional\nImplicatures in Montague Grammar”, in Oh, C.-K. and Dineen, D.\n(eds.), <em>Syntax and Semantics 11: Presupposition</em>, New York:\nAcademic Press, 1–56.</li>\n<li>Karttunen, Lauri, 2016, \"Presupposition: What went wrong?\", in\n<em>Semantics and Linguistic Theory</em>, 26: 705–731.</li>\n<li>Kay, Paul, 1992, “The inheritance of presuppositions”,\n<em>Linguistics and Philosophy</em>, 15: 333–381.</li>\n<li>Kempson, Ruth, 1975, <em>Presupposition and the Delimitation of\nSemantics</em>, Cambridge: Cambridge University Press.</li>\n<li>Kim, Christina, 2008, \"Processing presupposition: verifying\nsentences with ‘only’\", <em>University of Pennsylvania\nWorking Papers in Linguistics</em>, 14(1): 17.</li>\n<li>Kiparsky, Paul and Kiparsky, Carol, 1970, “Fact”, in\nBierwisch, M. and Heidolph, K. (eds.), <em>Progress in\nLinguistics</em>, The Hague: Mouton, 143–173.</li>\n<li>Kleene, Stephen, 1952, <em>Introduction to Metamathematics</em>,\nAmsterdam: North-Holland.</li>\n<li>Krahmer, Emiel, 1994, “Partiality and dynamics”, in\nDekker, P. and Stokhof, M. (eds.), <em>Proceedings of the Ninth\nAmsterdam Colloquium: Volume 2</em>, University of Amsterdam:\n<small>ILLC</small>, 391–410.</li>\n<li>Krahmer, Emiel, 1998, <em>Presupposition and Anaphora</em>,\nStanford: CSLI Publications.</li>\n<li>Kripke, Saul, 2009, “Presupposition and anaphora: Remarks on\nthe formulation of the projection problem”, <em>Linguistic\nInquiry</em>, 40: 367–386.</li>\n<li>Langendoen, D. Terence and Savin, Harris, 1971, “The\nprojection problem for presuppositions”, in Fillmore, C. and\nLangendoen, D. T. (eds.), <em>Studies in Linguistic Semantics</em>,\nNew York: Holt, Reinhardt and Winston, 373–388.</li>\n<li>Lappin, Shalom and Reinhart, Tanya, 1988, “Presuppositions\nof quantifiers: a processing account”, <em>Linguistics</em>, 26:\n1021–1037.</li>\n<li>Lewis, David, 1979, “Scorekeeping in a language game”,\n<em>Journal of Philosophical Logic</em>, 8: 339–359. Also in\nBäuerle, R. and Egli, U. and von Stechow, A. (eds.), 1979,\n<em>Semantics from Different Points of View</em>, Springer,\nBerlin.</li>\n<li>Lorenz, Sven, 1992, “On the role of reasoning about change\nin the projection of presuppositions”, Report 234, IWBS, IBM\nGermany.</li>\n<li>Mandelkern, Matthew, 2016, \"A note on the architecture of\npresupposition\", <em>Semantics and Pragmatics</em>, 9(13): 1–24.</li>\n<li>Marcu, Daniel, 1994, <em>A Formalisation and an Algorithm for\nComputing Pragmatic Inferences and Detecting Infelicities</em>, Ph.D.\nthesis, University of Toronto, Computer Systems Research Institute.\nAvailable as Technical Report CSRI-309, Computer Research Institute,\nUniversity of Toronto.</li>\n<li>McCawley, James, 1981, <em>Everything That Linguists Have Always\nWanted to Know about Logic (but Were Ashamed to Ask)</em>, University\nof Chicago Press.</li>\n<li>Mercer, Robert, 1987, <em>A Default Logic Approach to the\nDerivation of Natural Language Presuppositions</em>, Ph.D. thesis,\nUniversity of British Columbia.</li>\n<li>Mercer, Robert, 1992, “Default Logic: Towards a common\nlogical semantics for presupposition and entailment”,\n<em>Journal of Semantics</em>, 9: 223–250.</li>\n<li>Morgan, Jerry, 1969, “On the Treatment of Presupposition in\nTransformational Grammar”, in <em>Papers from the Fifth Regional\nMeeting, Chicago Linguistic Society</em>, University of Chicago,\n167–77.</li>\n<li>Nerlich, G., 1967, “Presupposition and Classical Logical\nRelations”, <em>Analysis</em>, 27(3): 104–106.</li>\n<li>Pearson, Hazel, 2013, \"A Judge-Free Semantics for Predicates of\nPersonal Taste\", Journal of Semantics, 30: 103–154.</li>\n<li>Peters, Stanley, 1979, “A truth-conditional formulation of\nKarttunen’s account of presupposition”, <em>Synthese</em>,\n40(2): 301–316.</li>\n<li>Percus, Orin, 2006, \"Antipresuppositions\", in A. Ueyama (ed.)\n<em>Theoretical and empirical studies of reference and anaphora</em>,\nJapan Society for the Promotion of Science: Report of the Grant-in-Aid\nfor Scientific Research B.</li>\n<li>Potts, Christopher, 2005, <em>The logic of conventional\nimplicatures</em>, New York: Oxford University Press.</li>\n<li>Prince, Ellen, 1986, “On the syntactic marking of\npresupposed open propositions”, in Farley, A. M. and Farley, P.\nT. and McCullough, K.-E. (eds.), <em>Papers from the Parasession on\nPragmatics and Grammatical Theory, 22nd Regional Meeting of the\nChicago Linguistic Society</em>, University of Chicago, 208–222.</li>\n<li>Reinhart, Tanya, 1982, “Pragmatics and Linguistics: An\nAnalysis of Sentence Topics”, <em>Philosophica</em>, 27:\n53–94.</li>\n<li>Roberts, Craige, 1995, “Domain Selection in Dynamic\nSemantics”, in Bach, E. Jelinek, E. and Kratzer, A. and Partee,\nB. (eds.), <em>Quantification in Natural Languages</em>, Dordrecht:\nKluwer, 661–700.</li>\n<li>Roberts, Craige, 1998, “Focus, the flow of information, and\nuniversal grammar”, in Culicover, P. and McNally, L. (eds.),\n<em>The Limits of Syntax</em>, New York: Academic Press, 109–160.</li>\n<li>Roberts, Craige., 2012, \"Information structure: Towards an\nintegrated formal theory of pragmatics\", Semantics and Pragmatics, 5:\n1–69.</li>\n<li>Romoli, Jacopo, 2011, \"The presuppositions of soft triggers aren’t\npresuppositions\", <em>Semantics and Linguistic Theory</em>, 21:\n236–256.</li>\n<li>Romoli, Jacopo, 2014, \"The presuppositions of soft triggers are\nobligatory scalar implicatures\", <em>Journal of Semantics</em>, 32(2):\n173–219.</li>\n<li>Romoli, Jacopo, Sudo, Yasutada and Snedeker, Jesse, 2011, \"An\nexperimental investigation of presupposition projection in conditional\nsentences\", <em>Semantics and Linguistic Theory</em>, 21:\n592–608.</li>\n<li>Romoli, Jacopo &amp; Schwarz, Florian (2014), \"An experimental\ncomparison between presuppositions and indirect scalar implicatures\",\nin F. Schwarz (ed.), <em>Experimental Perspectives on\nPresuppositions</em>, Cham: Springer, 215–240.</li>\n<li>van Rooij, Robert, 2007, “Strengthening conditional\npresuppositions”, <em>Journal of Semantics</em>, 24:\n289–304.</li>\n<li>Rothschild, Daniel, 2008, “Presupposition projection and\nlogical equivalence”, <em>Philosophical Perspectives</em>,\n22(1): 473–497.</li>\n<li>Russell, Bertrand, 1905, “On Denoting”, <em>Mind</em>,\n14: 479–493.</li>\n<li>Sæbø, Kjell Johan, 1996, “Anaphoric\npresuppositions and zero anaphora”, <em>Linguistics and\nPhilosophy</em>, 19: 187–209.</li>\n<li>van der Sandt, Rob, 1982, <em>Kontekst en Presuppositie: Een\nStudie van het Projektieprobleem en de Presuppositionele Eigenschappen\nvan de Logische Konnektieven</em>, Ph.D. thesis, Nijmegen Institute of\nSemantics.</li>\n<li>van der Sandt, Rob, 1988, <em>Context and Presupposition</em>,\nLondon: Croom Helm.</li>\n<li>van der Sandt, Rob, 1989, “Presupposition and discourse\nstructure”, in Bartsch, R. van Benthem, J. and van Emde Boas, P.\n(eds.), <em>Semantics and Contextual Expression</em>, Dordrecht:\nForis, 287–94.</li>\n<li>van der Sandt, Rob, 1992, “Presupposition projection as\nanaphora resolution”, <em>Journal of Semantics</em>, 9:\n333–377.</li>\n<li>Schlenker, Philippe, 2007, “Anti-dynamics: Presupposition\nprojection without dynamic semantics”, <em>Journal of Logic,\nLanguage and Information</em>, 16(3): 325–256.</li>\n<li>Schlenker, Philippe, 2008, “Be articulate: A pragmatic\ntheory of presupposition”, <em>Theoretical Linguistics</em>, 34:\n157–212.</li>\n<li>Schlenker, Philippe, 2009, “Local contexts”,\n<em>Semantics and Pragmatics</em>, 2(3): 1–78.</li>\n<li>Schlenker, Philippe, 2011, \"The proviso problem: a note\",\n<em>Natural Language Semantics</em>, 19(4): 395–422.</li>\n<li>Schlenker, Philippe, 2015, \"Gestural presuppositions\",\n<em>Snippets</em>, 30: 9–11.</li>\n<li>Schlenker, Philippe, 2018, \"Gesture projection and\ncosuppositions\", <em>Linguistics and Philosophy</em>, 41:\n295–365.</li>\n<li>Schwarz, Florian (ed.), 2014, <em>Experimental perspectives on\npresuppositions</em>, Cham: Springer.</li>\n<li>Sellars, W., 1954, “Presupposing”, <em>Philosophical\nReview</em>, 63: 197–215.</li>\n<li>Simons, Mandy, 2001, “On the conversational basis of some\npresuppositions”, in Hastings, R. and Jackson, B. and Zvolensky,\nZ. (eds.), <em>Proceedings of Semantics and Linguistics Theory\n11</em>, Ithaca, NY: CLC Publications, 431–448.</li>\n<li>Simons, Mandy, 2003, “Presupposition and accommodation:\nUnderstanding the Stalnakerian picture”, <em>Philosophical\nStudies</em>, 112(3): 251–278.</li>\n<li>Simons, Mandy, 2004, “Presupposition and relevance”,\nin Zoltán Szabó (ed.), <em>Semantics vs.\nPragmatics</em>, Oxford University Press, 329–355.</li>\n<li>Simons, Mandy, 2006, “Foundational issues in\npresupposition”, <em>Philosophy Compass</em>, 1(4):\n357–372.</li>\n<li>Simons, Mandy, 2007, “Observations on embedding verbs,\nevidentiality, and presupposition”, <em>Lingua</em>, 117(6):\n1034–1056.</li>\n<li>Simons, Mandy, Tonhauser, Judith, Beaver, David and Roberts,\nCraige, 2010, \"What projects and why\", <em>Semantics and Linguistic\nTheory</em>, 20: 309–327.</li>\n<li>Singh, Raj, 2007a, “Formal alternatives as a solution to the\nproviso problem”, in Gibson, M. and Friedman, T. (eds.),\n<em>Proceedings of the 17th Conference on Semantics and Linguistic\nTheory</em>, Ithaca, NY: CLC Publications, Cornell University,\n264–228.</li>\n<li>Singh, Raj, 2009, \"Symmetric and interacting alternatives for\nimplicature and accommodation\", in N. Klinedinst and D. Rothschild\n(eds.), <em>Proceedings of the ESSLLI 2009 Workshop: New directions in\nthe theory of presupposition</em>.</li>\n<li>Soames, Scott, 1979, “A projection problem for speaker\npresuppositions”, <em>Linguistic Inquiry</em>, 10:\n623–666.</li>\n<li>Soames, Scott, 1982, “How presuppositions are inherited: a\nsolution to the projection problem”, <em>Linguistic\nInquiry</em>, 13: 483–545.</li>\n<li>Soames, Scott, 1989, “Presupposition”, in Gabbay, D.\nand Guenther, F. (eds.), <em>Handbook of Philosophical Logic</em>,\nDordrecht: Reidel, vol. IV, 553–616.</li>\n<li>Stalnaker, Robert, 1972, “Pragmatics”, in Davidson, D.\nand Harman, G. (eds.), <em>Semantics of Natural Language</em>, Reidel:\nDordrecht, 389–408.</li>\n<li>Stalnaker, Robert, 1973, “Presuppositions”, <em>The\nJournal of Philosophical Logic</em>, 2: 447–457.</li>\n<li>Stalnaker, Robert, 1974, “Pragmatic presuppositions”,\nin Munitz, M. and Unger, P. (eds.), <em>Semantics and Philosophy</em>,\nNew York University Press, 197–214.</li>\n<li>Stalnaker, Robert, 1998, “On the representation of\ncontext”, <em>Journal of Logic, Language and Information</em>,\n7: 3–19.</li>\n<li>Strawson, Peter F., 1950, “On referring”,\n<em>Mind</em>, 59: 320–44.</li>\n<li>Strawson, Peter F., 1952, <em>Introduction to Logical Theory</em>,\nLondon: Methuen.</li>\n<li>Strawson, Peter F., 1954, “A Reply to Mr. Sellars”,\n<em>Philosophical Review</em>, 63: 216–231.</li>\n<li>Strawson, Peter F., 1964, “Identifying reference and\ntruth-values”, <em>Theoria</em>, 30: 96–118. Reprinted in:\n<em>Logico-linguistic Papers</em>. Methuen, London, 1974,\n75–95.</li>\n<li>Tiemann, Sonja, Schmid, Mareike, Bade, Nadine, Rolke, Bettina,\nHertrich, Ingo, Ackermann, Hermann, Knapp, Julia, and Beck, Sigrid,\n2011, \"Psycholinguistic evidence for presuppositions: On-line and\noff-line data\", in <em>Proceedings of Sinn &amp; Bedeutung</em>,\n15(15): 581–595.</li>\n<li>Tonhauser, Judith, 2012, \"Diagnosing (not-) at-issue content\",\n<em>Proceedings of Semantics of Under-represented Languages of the\nAmericas</em> (SULA), 6: 239–254</li>\n<li>Tonhauser, Judith, Beaver, David, Roberts, Craig, and Simons,\nMandy, 2013, \"Toward a taxonomy of projective content\",\n<em>Language</em>, 89(1): 66–109.</li>\n<li>Thomason, Richmond, 1972, “A semantic theory of sortal\nincorrectness”, <em>Journal of Philosophical Logic</em>, 1:\n209–258.</li>\n<li>Veltman, Frank, 1996, “Defaults in update semantics”,\n<em>Journal of Philosophical Logic</em>, 25: 221–261.</li>\n<li>Wilson, Deidre, 1975, <em>Presupposition and Non-truth-conditional\nSemantics</em>, London: Academic Press.</li>\n<li>Yeom, J.I., 1998, <em>A Presuppositional Analysis of Specific\nIndefinites: Common Grounds as Structured Information States</em>,\nGarland Publishing.</li>\n<li>Zeevat, H., 1999, “Explaining presupposition\ntriggers”, in <em>Proceedings of the Twelfth Amsterdam\nColloquium, ILLC, Amsterdam</em>, 19–24.</li>\n<li>Zeevat, Henk, 1992, “Presupposition and accommodation in\nupdate semantics”, <em>Journal of Semantics</em>, 9:\n379–412.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "assertion",
            "discourse representation theory",
            "pragmatics",
            "reference",
            "semantics: dynamic",
            "speech acts",
            "Strawson, Peter Frederick"
        ],
        "entry_link": [
            {
                "../assertion/": "assertion"
            },
            {
                "../discourse-representation-theory/": "discourse representation theory"
            },
            {
                "../pragmatics/": "pragmatics"
            },
            {
                "../reference/": "reference"
            },
            {
                "../dynamic-semantics/": "semantics: dynamic"
            },
            {
                "../speech-acts/": "speech acts"
            },
            {
                "../strawson/": "Strawson, Peter Frederick"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=presupposition\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/presupposition/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=presupposition&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/presupposition/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=presupposition": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/presupposition/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=presupposition&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/presupposition/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Work on presupposition at the\n <a href=\"http://semanticsarchive.net/cgi-bin/browse.pl?search=presupposition\" target=\"other\">Semantics Archive</a>.",
            "Work on presupposition identified by\n <a href=\"http://scholar.google.com/scholar?hl=en&amp;q=presupposition\" target=\"other\">Google Scholar</a>."
        ],
        "listed_links": [
            {
                "http://semanticsarchive.net/cgi-bin/browse.pl?search=presupposition": "Semantics Archive"
            },
            {
                "http://scholar.google.com/scholar?hl=en&q=presupposition": "Google Scholar"
            }
        ]
    }
}