{
    "url": "progress",
    "title": "Progress",
    "authorship": {
        "year": "Copyright © 2011",
        "author_text": "Margaret Meek Lange",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2011</a> by\n\n<br/>\nMargaret Meek Lange\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Feb 17, 2011"
    ],
    "preamble": "\n\nPhilosophical proponents of progress assert that the human condition\nhas improved over the course of history and will continue to improve.\nDoctrines of progress first appeared in 18th-century Europe and\nepitomize the optimism of that time and place.  Belief in progress\nflourished in the 19th century.  While skeptics of progress did exist\nalongside its supporters from the beginning, it was not until the 20th\ncentury that theorists backed away en masse from the notion.  Many\n20th-century thinkers rejected the notion of progress after horrendous\nevents such as the two World Wars, the Holocaust, and the use of\nnuclear weaponry.\n\n\nIn general, writings on progress tend to bear a close relationship to\nthe environment in which they were produced.  Because of the strong\nconnection between doctrines of progress and historical events, this\narticle is organized by time and place.  However, that principle of\norganization does not mean that each doctrine should not be assessed\non its own merits.  To help the reader, the next section briefly\nsummarizes the conceptual framework that is used throughout the rest\nof the article.\n\n",
    "toc": [
        {
            "#OveConIss": "1. Overview of Conceptual Issues "
        },
        {
            "#PreEnlTho": "2. Pre-Enlightenment Thought "
        },
        {
            "#EnlViePro": "3. Enlightenment Views on Progress "
        },
        {
            "#19tCenViePro": "4. 19th-Century Views on Progress "
        },
        {
            "#CriDocPro": "5. Criticisms of the Doctrine of Progress "
        },
        {
            "#20tCenBey": "6. The 20th Century and Beyond "
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Overview of Conceptual Issues \n\nThe problem of progress can be approached from many directions.  Three\nquestions will provide the starting points for this particular\nanalysis.  These are: (1) Does the theory under consideration\nrigorously define a conception of human well-being and, if so, what is\nit?  (2) What causes of long-term improvement and, especially, what\nlaws of historical development does the theorist propose? (3) What\nevidence or reasons does the theorist provide for the aforementioned\ncausal account? Note that the first question is normative, the second\nbelongs to social science, and the third is methodological and\nepistemological.\n\n\nTo argue successfully that human well-being is increasing over the long term, \ntheorists of progress must offer an interpretation of well-being compatible\nwith that claim. They are committed either to interpret human well-being as a \nsingle value, or as a set of incommensurable values that are empirically connected. \nIn the first case, value monism, the list of compelling alternatives is not long. \nIt includes freedom, happiness or utility, and the realization of human \ncapabilities.  In the second case, theorists can draw on a wider range of values, \nbut will have to show that the incommensurable components of human\nwell-being reinforce each other causally or at least do not clash.  As\nwe will see, faced with the difficulties of the task, some theorists\ndo not define well-being rigorously.  They may, however, formulate a\nconception of improvement for a circumscribed domain of social life,\nthe description of which is a part of their overall account.\n\n\nNext, each theorist of progress offers a causal story to explain the\nimprovement in the human condition that he thinks has occurred.  The\nnotion of a universal history, a historical narrative taking all of\nhumanity as its subject, came to prominence during the Enlightenment.\nUniversal historians aspired to surpass ordinary historians in breadth\nand depth and aimed to penetrate the surface play of events to\ndiscover fundamental laws of historical development.  These laws would\nnot only explain the past, but could be used to predict the future.\nAlthough a universal history need not be an account of improvement,\nall accounts of progress rest explicitly or implicitly on a universal\nhistory.\n\n\nThe content of the laws of progress, however, is an object of\ncontention. Many thinkers, including Hegel and Auguste Comte, view the\ndevelopment of ideas over time as the fundamental change that causes\noverall improvement.  Marx, in contrast, regards the growth of the\nmeans of production as primary.  Kant represents a third category,\narguing that a tension within human nature itself is the source of\nchange.  We will also see theorists who offer more eclectic causal\nstories and, because their accounts of change are more complicated,\nare less inclined to formalize their conclusions.  Next to content,\nthinkers differ in their treatment of episodes of devastation and\nconflict and periods of decline.  It is hard for anyone to sustain the\nargument that improvement is perfectly linear, but some theorists more\nthan others emphasize that such episodes and eras can be part of a\npattern of long-term improvement.  Furthermore, the extent to which\nthe laws are deterministic varies.  Some authors leave little room for\nchoice and contingency, while others frame their generalizations as\nloose trends that constrain rather than determine the course of\nevents.  Authors in the latter category often present their writings\nas political interventions that can shape the future as well as\npredict it.\n\n\nFinally, the question of method arises.  Most of the authors treated\nin this study wrote before quantitative and statistical methods in the\nsocial sciences became widespread.  Nevertheless, they do remark on\nmethod, in some cases in detail.  The most striking distinction is\nbetween those who rely on a priori reasoning and those who\ngeneralize from empirical facts in a social scientific fashion.  While\nthis study will not concentrate on method, a priori reasoning\nand problematic empirical assumptions will be attended to.\n\n2. Pre-Enlightenment Thought \n\nWhether any ancient philosophers proposed a doctrine of progress is a\nmatter of scholarly contention (Bury 1932, 11; Nesbit 1994, xi).\nHowever, it is clear that the figures of antiquity who exerted the\nmost influence on later thinkers did not believe in progress in the\nrobust sense used in this article.\n\n\nPlato and Aristotle hold a cyclical view of human affairs.  They allow\nthat certain developments occur spontaneously, but also see disaster\nand decline as inevitable.  In the Laws, Plato proposes that\nhuman society begins with the family, then moves through intermediate\nforms, and finally arrives at the city-state (680a-682d).  In\nthe Politics, Aristotle also presents this progression of\nforms (1252a24–1253a4).  Not only is man a political animal as a\nmatter of fact (Politics, 1253a2), it is also true that human\nexcellence is only possible within a city-state with a good\nconstitution.  But unhappily there is no tendency for the city-state,\nonce achieved, to realize or maintain such a constitution.  For\ninstance, while Aristotle cautiously admits that laws can and should\nimprove (1269a12–14), Book V of the Politics shows that all\nconstitutional forms—bad and good—are unstable.\n\n\nLarge-scale natural events also play an important role in Plato and\nAristotle's presentation of human affairs.  In\nthe Statesman, Plato adopts the traditional Greek story of a\ngolden age and a subsequent decline, written down by Hesiod\nin Works and Days.  Hesiod tells the story of five races of\nmen: the golden race (Lines 109–120), the silver race (121–139), the\nbronze race (140–155), the demi-gods (156–169b), and the iron race\n(170–201).  The golden race is the best of all, and the present race,\nthe iron race, is the worst.  According to Plato's story, the\nages described by Hesiod correspond to parts of a cycle during which\nthe earth rotates first in one direction and then in another.  While the \nearth moves in the first direction, the gods oversee the affairs of mankind.  \nAs a herdsman looks after his flock, the gods tend to the needs of human beings.  \nBecause they are under the perfect care of the gods, humans do not need to\ngovern themselves (Statesman, 271e-272a).  Plato suggests that the\ngolden age, the era of the golden race, occurred during such a period.\nWhen the earth changes course, a period of chaos ensues, which\ncorresponds to the end of the golden age.  Finally, when the earth\nmoves in the second direction, people are left on their own, which\nexplains the other ages described by Hesiod.  In the Laws,\nPlato does not return to this elaborate myth, but endorses the view\nthat “the human race has been repeatedly annihilated by floods\nand plagues and many other causes, so that only a fraction of it\nsurvived” (Laws, 677a). Aristotle also entertains the\npossibility of periodic flooding (Meteorology, 352a29–32) and\nsuggests that myths may contain the remnants of the wisdom of\ndestroyed civilizations (Metaphysics, 1074b9–13).\n\n\nAfter Plato and Aristotle, the most influential early philosopher is\nSt. Augustine of Hippo (354–430 C.E.).  In  The City of God\nagainst the Pagans, Augustine presents a radically new, Christian\nvision of human history.  Some humans, God's elect, are\npredestined for heaven.  The rest of humanity is predestined for\ndamnation.  Those who are saved belong to the “City of\nGod” and those who are damned belong to the “City of\nman” (426, XV.1).  Augustine rejects cyclical accounts of human\naffairs for a linear one.  He is especially concerned to repudiate the\ndoctrine of eternal recurrence, which says that events identical in\nall respects repeat over and over again.  He emphasizes that the\nbirth, death, and resurrection of Christ are unique occurrences (426,\nXII.14) and compares the history of the elect to an individual life\n(426, X.14).\n\n\nInsofar as it is linear, Augustine's narrative of salvation\nresembles doctrines of progress.  But his emphasis on the City of God\ncontrasts with the worldly, inclusive vision of theorists of progress.\nAs we will see, these theorists are concerned with humanity as a\nwhole, rather than with a part of it.  And their focus is on earth\nrather than on heaven.\n\n3. Enlightenment Views on Progress \n\nThe writings on progress of the 18th century drew inspiration from the\nintellectual achievements of the 16th and 17th centuries. During this\ntime, Europe witnessed an explosion of scientific and mathematical\nactivity.  In the natural sciences, the main fields of investigation\nwere physics and astronomy.  Major figures included Copernicus\n(1473–1543), Galileo (1564–1642), Kepler (1571–1630), and Newton\n(1642–1727).  Newton synthesized the work of the previous thinkers to\nbring the behavior of bodies on earth and bodies in space under a\nsingle scientific law, the law of universal gravitation.  This law\nstates that two bodies attract each other in proportion to their\nmasses and in inverse proportion to the square of the distance between\nthem (Palmer 1965, 265–271).\n\n\nThe discoveries of these scientists had broad implications.  First of\nall, the success of the new physics in unifying distinct phenomena and\npredicting behavior vindicated an underlying paradigm of scientific\ninvestigation and explanation.  Second, the rapid gains encouraged an\noptimistic view of humans' capability to understand and shape\ntheir world.  Here was a clear example of a communal activity in which\none human built on and improved the work of his predecessor.  The\nactivity resulted in the discovery of a scientific law, the law of\nuniversal gravitation, of unprecedented power (Palmer 1965, 271–273).\n\nTwo thinkers of the French Enlightenment, Anne-Robert-Jacques Turgot, Baron de Laume (1727-81), and  Marie Jean Caritat, Marquis de Condorcet (1743-1794), integrated reflection on scientific discoveries into their writings on progress. Turgot, a minister to Louis XVI, produced two influential works, A Philosophical Review of the Successive Advances of the Human Mind and On Universal History.  Condorcet was inspired by Turgot to write Outlines of an historical view of the Progress of the human mind, a piece that echoes many of Turgot's convictions.  Although Condorcet wrote his essay in prison during the Terror, he, like Turgot, evinces optimism about the future of France and of humanity as a whole. \n\n\nBoth authors suggest that philosophical progress is the deepest\ncondition of scientific progress.  Influenced by British empiricism,\nTurgot and Condorcet assert that all human knowledge is grounded in\nexperience.  According to Turgot, the renaissance of science first\nrequired an empiricist turn, the abandoning of explanations appealing\nto faculties and essences.  The scientific experiment then found its\nplace as the centerpiece of the scientific method and the vehicle of\nfurther progress (Turgot 1750, 45; 1751, 100–01).  Condorcet\nreiterates these points and also provides a wealth of examples of\nrecent scientific discoveries (1795, 168–170).  Turgot and Condorcet\nagree that scientific progress is dependent on mathematical and\ntechnological progress, and vice versa (Turgot 1750, 45; Condorcet\n1795, 231).\n\n\nAlthough neither author rigorously defines human well-being, both\nbelieve that, over the long term, scientific discoveries and\npolitical freedom reinforce each other and together further it.\nTurgot considers the role that political institutions play in\nadvancing science.  He thinks that individual genius moves science\nforward.  Political institutions are important to scientific progress\ninsofar as they allow geniuses to flourish.  Variation in scientific\nachievement is to be explained not by the concentration of genius but\nby the institutions that either suppress or encourage it (1751, 88).\nDespotic government is bad for genius, while republics nurture it.\nCondorcet also remarks that free institutions are the native\nenvironment of scientific discovery (1795, 129).  In turn, the growth\nof scientific knowledge will advance political freedom (Turgot 1750,\n43).\n\n\nTurgot and Condorcet also hold that short-term decline can be part of\na pattern of long-term improvement.  In the intellectual realm, the\npath to truth is rocky, and errors are frequently the first result of\nreflection (Turgot 1750, 44; Condorcet 1795, 37–38).  For instance,\nthe false scientific philosophy of faculties and essences is born of\nreflection on phenomena.  In the realm of action, devastating events\nlike war and conquest can ultimately unite scattered groups of people\nand ameliorate political organization (Turgot 1751, 71–2; Condorcet\n1795, 51).  Moreover, Turgot argues that individuals and groups that\ncontribute to progress are often motivated by emotion or personal\ninterest (1751, 69–70).  The second observation is related to the\nfirst, since Turgot thinks that the agents of creative destruction are\nusually narrowly self-interested or emotion-driven.\n\n\nDespite their many common convictions, Condorcet and Turgot part ways\non the question of religion.  Turgot is generally positive about\nChristianity, while a significant part of Condorcet's essay\nconsists of polemics against religion and especially priests (1795,\n123–124).  Condorcet states that as scientific knowledge spreads, an\nenlightened population will throw off the shackles of religion and its\npriests and demand greater freedom.\n\n\nThe Scottish and French Enlightenment were roughly contemporaneous and\ngrappled with the same social phenomena. It is difficult to draw hard\nand fast contrasts between the two bodies of thought, and better to\nconsider individual authors.  So we turn to writings of David Hume\n(1711–1776), which are characterized by both naturalism and\nskepticism.  Hume's essays on political questions reflect his general\nphilosophical orientation.  Although he is less likely than Condorcet\nand Turgot to make sweeping comments about progress, he explores the\ntopic of social development in various interesting ways.\n\n\nIn “Of the Rise and Progress of the Arts and Sciences,”\nHume connects political and intellectual development.  He begins with\nthe presumption that scientific and artistic progress requires a\nbackground of political security.  From this claim, he argues that the\narts and sciences cannot arise in a society without the rule of law.\nHume also asserts that no monarchy can develop the rule of law on its\nown, while republics must develop the rule of law if they are to\nsurvive at all.  He concludes that the arts and sciences first emerge\nin republics, not monarchies (1777, 59–62).\n\n\nAlthough the arts and sciences have their rise in republics, they may\nbe transplanted into “civilized monarchies” (67) and\ncontinue to improve in that environment.  Civilized monarchies are\nthose that have learned the rule of law from neighboring republics.\nHume even says that the arts progress more quickly in civilized\nmonarchies than in republics, because they are useful for flattering\nmonarchs.  On the other hand, according to Hume, the general\npopulation is more impressed by scientific discoveries with obvious\ntechnological applications than by artistic creations.  Therefore the\nsciences progress more quickly in republics, in which the general\npublic holds power, than in monarchies (68–69).\n\n\nHume thinks that countries can affect each other's progress.\nFor instance, competition can spur greater progress, and isolation can\ncause a country to stall (64–5).  On the other hand, countries can\nintimidate each other into inactivity (76).  Hume also asserts that\nthe arts and sciences cannot progress indefinitely in a single\ncountry.  Once they reach a certain height, members of the next\ngeneration are too intimidated by their predecessors to strike out on\ntheir own (75–76).\n\n\nA second Scottish Enlightenment figure, Adam Smith (1723–1790), is\noften regarded as an economist, but in fact he began his career as a\nphilosopher.  His first work, The Theory of the Moral\nSentiments, addressed the philosophy of moral judgment and\naction.  It is therefore not surprising that the Wealth of\nNations, the work on economic growth for which he is best known,\nhas a deeper philosophical resonance.\n\n\nSmith's central observation is that, in economic life, it often\nhappens that individuals in pursuit of their self-interest\nnevertheless contribute to the common good (1776, 484–485).  It is as\nthough they are “led by an invisible hand” (485) to take\nsocially beneficial actions.  For instance, Smith argues that the\ndivision of labor is the spontaneous outcome of the human\n“propensity to truck, barter, and exchange one thing for\nanother” (14).  Humans engage in this activity for\nself-interested reasons.  But growth in the productivity of labor in a\nsociety is largely due to a greater division of labor (3).  It is\nbecause of a greater division of labor, Smith contends, that the\npoorest members of European countries are richer than the richest\nmembers of societies in other parts of the world (13).\n\n\nFailure to see the work of the invisible hand will lead to unwise\npolicies.  Smith says that, in the absence of government intervention,\nself-interest leads each nation to produce only the goods in which it\nhas a comparative advantage.  Self-interested behavior in the presence\nof government attempts to support domestic industries actually results\nin a worse outcome.  One goal of the book is admittedly practical: to\nattack mercantilism, the doctrine that dominated economic policy in\nEurope from the 16th century onward.  Mercantilism holds that\naggressive government intervention is the key to increasing national\nwealth.  Accordingly, during this time, the governments of Europe\nattempted to steer and promote domestic industries, most notably by\nplacing high tariffs on foreign imports (Palmer 1965, 102).  Smith\nargues against these policies. He writes that tariffs on imports harm\nthe nation as a whole, by misdirecting its resources (1776, 485–487).\nIn general, he says, the government should play a circumscribed role\nin the economic life of a country, confining itself to the protection\nof property rights, the support of a national defense force, and the\nprovision of a few other key public goods (745).\n\n\nSmith's emphasis on spontaneous improvement in economic life\nwarrants treating him as a theorist of progress.  But, given his\nworries about mercantilism, it is clear he thinks that this type of\ndevelopment is fragile.  Nations will not maximize their wealth unless\nthey have the wisdom to allow spontaneous growth to occur.  Smith\nintends the Wealth of Nations to help policy makers recognize\nthe phenomena that he believes to have correctly identified.\n\n\nThe thinkers of the Scottish and French Enlightenment authors are\nempiricists.  Unlike them, the German Enlightenment figure Immanuel\nKant (1724–1804) reasons in an a priori manner to the\nconclusion that humanity is progressing.  Kant's writings on progress\nconsist of a series of short pieces from the 1780s and 90s, including\n“Ideas toward a Universal History with Cosmopolitan\nIntent,” and “Perpetual Peace.” In addition to its\nreliance on a priori reasoning, Kant's work is noteworthy for\nits emphasis on world peace and its detailed description of the\ndomestic and international institutions needed for peaceful\nconditions.\n\n\nKant remarks that certain trends are compatible with progress, but\ncautions that no trajectory can be inferred with certainty from the\nfacts (1784, 50).  His a priori argument begins with the\npremise that all animals have natural faculties.  If nature is not to\nbe in vain, we must assume that the faculties of an animal can be\ndeveloped.  Unlike other animals, the human being cannot develop all\nof its faculties in a lifetime.  If the faculties given to humans are\nnot to be considered useless, then the only other possibility is that\nthe human race as a whole, over time, will develop all the human\nfaculties (1784, 42–44).  The progress from one era to another is\nmeasured by the development of human faculties during that time.\n\n\nKant thinks that human faculties can reach their fullest expression\nonly in free and peaceful circumstances (1784, 50), which in turn\nrequire a particular set of institutions.  A federation of republics\nwill mark the final stage of human development.  A republic is a state\nbased on the rule of law whose members are free and equal citizens\n(1795, 99).  A federation is a group of nations who have agreed to\nobserve rules of peaceful conduct in their mutual relations (1795,\n98ff).  Kant argues that the domestic and international features of\nthis institutional constellation will reinforce each other.  Republics\nwill not go to war with each other because a declaration of war\nrequires the consent of the public, who are reluctant to pay a\nwar's price (1795, 100).  In turn, domestic conditions will be\nimproved in the absence of a state's constant involvement in\nwars (1784, 49).\n\n\nThe details of the development toward the peaceful federation are\ngiven by Kant's universal history.  This narrative is presented\nas, at best, consistent with empirical evidence.  Kant argues that,\nfor the most part, human psychology and the natural environment,\nrather than human reason, could have driven the human race forward.\nFirst, he attributes progress to the “unsocial\nsociability” (1784, 44) of human beings.  Humans are social\nbecause they cannot develop their capabilities in isolation.  Yet they\nare unsocial because they always want to get their own way.  These\ncharacteristics lead them to form associations in which all vie for\n“status” (1784, 44).  These associations are the seeds of\nrepublics.  But progressive human activity need not be lacking in\nawareness.  Kant maintains that a philosophy of progress can\naccelerate progress (1784, 51).\n\n4. 19th-Century Views on Progress \n\nThe 19th-century writers on progress took up and elaborated the notion\nthat conflict is an essential part of a progressive narrative.\nG.W.F. Hegel (1770–1831) is an example of such a writer. Hegel does\nnot give a straightforward account of human progress. But he puts a\nversion of universal history at the center of his metaphysics, from\nwhich a narrative of progress can be derived.  According to Hegel, the\nworld as a whole is in the process of development through conflict.\nPart of the world's development is the self-realization of its\nspiritual aspect, known simply as Geist, or Spirit.  The\nfreedom of Spirit is achieved through the achievement of free social\ninstitutions and free human beings.  So, we look to human history to\nunderstand the realization of Spirit.  Conversely we recognize that\nthe self-realization of Spirit, an entity not reducible to humanity,\nis the true meaning of human history.\n\n\nThe state is crucial to Hegel's philosophy of history.  For\nHegel, the state is the “march of God [Spirit] in the\nworld” (1821, §258Z).  At any point in time, a state or\ngroup of states represent the highest point achieved by humanity thus\nfar.  Hegel thinks that at the time of his writing, the states of\nWestern Europe play this role.  In the Philosophy of Right,\nhe argues that these states, however imperfectly, combine individual\nfreedom with social unity into one enduring whole.  The political\nconstitution of the society he describes is a constitutional monarchy.\nIt approximates the never-adopted constitution that Prussian reformers\ndrew up in 1819 (Wood 1990, 13).\n\n\nHistory, according to Hegel's metaphysical account, is driven by\nideological development.  Ideological—and therefore\nhistorical—change occurs when a new idea is nurtured in the\nenvironment of the old one, and eventually overtakes it.  Thus\ndevelopment necessarily involves periods of conflict when the old and\nnew ideas clash.  A second account of change is contained in the\nmaster-slave dialectic of Hegel's Phenomenology of\nSpirit (1807, 143–152; 192–198 ).  Certain forms of social\nhierarchy are intrinsically unstable.  The human desire for\nrecognition drives social development, which consists of repeated\nstruggles for recognition, until it reaches the liberal solution.  In\nthe liberal state, slave and masters are abolished, and all recognize\nall as free and equal.  This arrangement lacks the contradictions\ninherent in previous social forms.\n\n\nAccording to Hegel, conflict occurs within and between states.  But\n“world-historical” (1988, 35) individuals, like Napolean\nBonaparte, also have a key part to play in driving history forward.\nThese great men are often motivated by narrow, personal goals.  Hegel\npaints a disturbing picture of the historical tendency of great men to\n“trample” on and use ordinary ones, but he thinks great men\nare ultimately tools as well—of Spirit and its self-realization\n(1988, 35).  Hegel's justification of war and destruction in the\nname of progress reflects his overall philosophy.  He holds that we\ncan be reconciled to negative elements by seeing their place within a\nlarger pattern.  In the Phenomenology of Spirit, he\nsummarizes his thesis in the following slogan: “The true is the\nwhole” (1807, 11).\n\n\nFinally, in contrast to Kant, Hegel thinks that war is more than an\nengine of progress. Hegel argues that, without war, individuals in\nliberal societies become self-absorbed and weak, unwilling to work for\nthe common good.  There is moreover no outlet for human aggression.\nFor these reasons, war is ineliminable.  It will be a feature even of\nthe rational system of states that marks the end of historical\ndevelopment.\n\n\nKarl Marx (1818–1883) adopted Hegel's single-factor model of\nhistorical development but “turned [Hegel] right side up”\n(1873, 302) by replacing his idealism with materialism. According to\nMarx, the fundamental fact about a society at a given moment is not\nits ideological orientation but rather its “productive\nforces” (1845, 150), by which Marx means its material and\ntechnological resources.  Over the long run, the productive forces\ndetermine other aspects of the society, starting with the relations of\nproduction, the informal and formal rules that define and regulate\nproperty (1845, 151).  Marx builds on these assumptions to define\ncapitalism and communism and to predict the former's eventual\ntransformation into the latter.\n\n\nLike Hegel, Marx asserts that conflict drives historical development.\nBut in Marx's account, conflict occurs when the productive\nforces outgrow the relations of production (1845, 196).  A different\nclass of society represents each side of the conflict.  The class that\nbenefits from the outmoded relations of production seeks to maintain\nthem, while the losing class seeks to destroy them and replace them.\nFor instance, capitalism emerged from feudal aristocracy when the\nmerchants, through revolution, rewrote the laws in their favor (1848,\n477–8, 484).  Capitalism is a system in which land and labor are\ncommodities able to be bought and sold on the free market.  Marx\npredicts that communism will emerge from capitalism because the\nproductive forces developed within a capitalist society will\neventually make capitalist property rights unworkable (1848, 477).  At\nthis point, the working class, or proletariat, will successfully\noverthrow the old order (1845, 161–2).\n\n\nMarx's philosophy of history can seem like a deterministic\nmaterialism that ignores ideas and passes no judgment on the change it\ndescribes.  However, this picture is incomplete.  First of all, Marx\nthinks that consciousness of historical trends will guide at least\nsome of the future revolutionaries (1848, 481).  Second, Marx clearly\nthinks that communism is superior to capitalism because it eliminates\nbarriers to freedom such as alienation and exploitation and replaces\nthem with a community of free producers (1845, 197).  Marx's\nearly writings—published after his death—show that the\nvalue of freedom was as central a concern for him as it was for Kant\nor Hegel.\n\n\nAmong 19th-century thinkers, the French sociologist Auguste Comte\n(1798–1857) puts relatively little emphasis on violence and struggle\nas a source of change.  Comte actually coined the term\n“Sociology” (1853 v. 2, 201) to describe the scientific\ntreatment of human societies and their development.  Comte saw himself\nas giving sociology its content in addition to its name.  But many of\nhis arguments are not particularly original, including his most\nfundamental claim, that intellectual improvement drives progress\n(v. 2, 307).  His real contribution is to claim that intellectual\ndevelopment should be understood as change in the form of explanation\nemployed by individuals seeking to understand the world.  The form of\nexplanation affects social life insofar as it corresponds to a way of\npredicting and manipulating events.  It is true that this argument is\nimplicit in the writings of earlier thinkers such as Turgot and\nCondorcet.  But, unlike his predecessors, Comte works it out\nsystematically.\n\n\nComte's main sociological law is that every science goes through\nthree stages, which he terms the theological, the metaphysical, and\nthe positive (1853, v. 1, 2).  In the theological stage, scientific explanation\nis governed by the assumption that natural events are caused by divinities.  \nIn turn, \nhumans attempt to affect natural outcomes by appealing directly to the gods or \nGod to take action. The metaphysical stage follows, in which phenomena are \nexplained by referring to the abstract\nessences that entities are supposed to possess.  The third phase, the\npositive phase, explains phenomena by formulating scientific laws and\nthen subsuming individual phenomena under them (2).  Humans cannot\nchange these laws, but they can use their knowledge of them to predict\nand shape events.  The positive stage is the most modest in its\nepistemological aspirations.  Unlike the other two, it organizes\nappearances rather than looking beyond them (v. 1, 2, 4). However, it\nis the most successful of the three stages in guiding human\nintervention into nature.  This is no accident, since the same\npractical concerns that motivate scientific activity drive scientific\ndevelopment.  For Comte, the ultimate motivation for scientific\nactivity is practical: “From Science Comes Prevision: From\nPrevision Comes Action” (1853, v. 1, 21).\n\n\nWhile Comte holds that the driving force of human progress is\nintellectual development, he asserts that progress itself consists in\nmoral improvement.  Comte refrains from claiming that humans are\nbecoming subjectively happier (1853, v. 2, 232).  Instead, despite his\nrejection of Aristotelian metaphysics, Comte invokes a form of human\nflourishing akin to Aristotle's in the Nicomachean\nEthics (1097b22–1098a17).  Comte claims that human excellence is\nexercising the uniquely human capacity for reason.  The human race is\nprogressing because humans are becoming more rational and less\nemotional (v. 2, 299).\n\n\nIn the final part of his career, Comte turned his attention to\npolitical theory.  He had already rejected as\n“metaphysical” certain building blocks of the theory of\nliberal democracy, including popular sovereignty (1853, v. 2, 155–6)\nand liberty of conscience (v. 2, 151).  In System of Positive\nPolity, he envisions a socialist society governed by a few\nunelected officials, who are in turn educated and advised by an elite\npriesthood of social scientists (1875 (51), 82).  Guided by the\nprinciple that the temporal and spiritual powers of society should be \nseparate, Comte emphasizes that the priests of positivism should not exercise\npolitical leadership themselves (170).  Comte appeals to the same principle to\njustify the exclusion of women from public life (197).  He explains that\nwomen wield spiritual power as mothers and wives (260–1), \nand their spiritual authority would be jeopardized if they were to pursue a \nvocation outside the family.\n\n\nJohn Stuart Mill (1806–1873), Comte's contemporary, admired his\nprogressive philosophy of history (Mill 1865, 106) and shared his\nrespect for scientific expertise (97).  But Mill was disappointed by\nComte's basic distaste for democratic freedom and individuality\n(Mill 1865, 181).  Unlike Comte, Mill thought that a strong,\nscientifically oriented society could be a liberal democracy.  Such a\nsociety would best maintain the gains already achieved and nurture\nfurther improvement.  Mill articulates his twin commitment to progress\nand liberal democracy in his major writings, including A System of\nLogic (1843), Utilitarianism (1861), On Liberty\n(1859), and On Representative Government (1861).\n\n\nMill's writings establish connections among utility, liberty,\nand political institutions. Like his father, James Mill, and Jeremy\nBentham, Mill is a utilitarian. Utility, or aggregate pleasure (1861b,\n137), provides the ultimate standard for comparing two historical eras\nor two contemporaneous societies.  The claim that humanity is\nprogressing means that utility is increasing over time.  Then, in \nA System of Logic, Mill, following Comte (606), argues that the\ndevelopment of ideas drives the development of society as a whole\n(604).  Finally, in On Liberty and On Representative\nGovernment, Mill considers how a society's institutions can\nretard or accelerate ideological development.\n\n\nMill thinks that it is impossible to find a single set of institutions\nthat is progressive for all times and places.  The most that we can do\nis to specify what institutions are best for societies at a given\nlevel of civilization.  Mill controversially argues that despotic\ngovernments may push “barbarians” to the next level of\ncivilization (1859, 14–15). But Mill argues that in more advanced\nsocieties, free institutions promote further progress.  They do so by\nallowing ideological conflict, which is a powerful engine of\nideological development.  Mill worries about the transition from one\nset of institutions to another.  Civilizations can reach a certain\nlevel of development and then stagnate because they do not undergo\ninstitutional change (1861a, 234–5).\n\n\nDespite his reputation as a classic Victorian progressive, Mill is\nmore cautious and less deterministic than the other 19th-century\nwriters treated by this essay.  He believes that continued improvement\nis possible, but not by any means inevitable.  Progress in Europe will\ncome to a halt if institutions silence society's creative\nmembers (1859, 80–82).  Mill's works derive their urgency from\nthe fact that he clearly thinks they can make a real\ndifference.  On Liberty focuses on the argument for\ngovernment non-interference.  On Representative Government\ndiscusses some of the ways that democratic institutions could be\nreformed to promote different points of view actively.\n\n\nA fellow Victorian philosopher, Herbert Spencer (1820–1903) is much\nmore deterministic than Mill.  Spencer views human progress as one\naspect of a universe in perpetual development.  Spencer constructs his\nexplanatory framework from materials from the biological sciences.  He\nis keenly interested in theories of biological evolution, both\nLamarckian and then Darwinian.\n\n\nUnderstanding Spencer's theoretical orientation requires some\nbackground in 19th-century biology.  Darwin's theory of evolution was\nnot the first modern attempt to account for diversity of life on the\nplanet without invoking an act of divine creation (Levins and\nLewontin, 1985, 27–28).  Jean-Baptiste Lamarck (1744–1829)\nexplained the apparent match between each animal species and its\nenvironment by positing that individual animals could acquire and pass\non adaptive characteristics.  This explanation requires, first of all,\nthat animals strive to adapt to their environment.  Second, it\nrequires that the animals change physically as a result of their\nefforts, and third, that they pass on their acquired characteristics\nto their offspring (Levins and Lewontin, 30).  In contrast, Darwin\nhypothesized that randomly occurring variation among individual\norganisms could be preserved or destroyed in the population of\norganisms through differential reproductive success.  That is, he\nconjectured that some characteristics are correlated with the ability\nto produce a greater number of offspring.  These characteristics will\ntend to increase in a population over time.  Darwin called this\nmechanism natural selection.  Natural selection bypasses the\nproblematic assumption that individual organisms could alter\nthemselves through deliberate effort.  Yet it can still explain why\norganisms seem to fit into their natural environment so well (Levins\nand Lewontin, 1985, 31–34).\n\n\nIn Social Statics, Spencer asserts that evil is never\npermanent (59).  He reasons to this conclusion from two premises.\nFirst, he defines evil as the “non-adaptation of constitution to\nconditions” (1841, 59).  Second, he claims that all living\nbeings gradually change to fit into their environment (59–60).  He\nlists a great number of natural phenomena that supposedly illustrate\nthis law (60).  At the point of writing, Spencer was a Lamarckian, but\nhe later maintained essentially this argument as a proponent of\nDarwinism. Evil in the human sense exists because human beings, by\nvirtue of their selfishness, are unsuited to social living.  But this\nvariety of evil, like all evil, will pass away as humans adapt to their\ncircumstances.  He defines progress as the evolution of humans from\nselfishness to selflessness (1841, 63).\n\n\nIn “Progress, its Law and Cause,” Spencer makes a\ndifferent argument.  He defines progress as “an advance from\nhomogeneity of structure to heterogeneity of structure” (1857,\nv. 1, 9).  Progress occurs by way of “successive\ndifferentiations” (10).  The law of progress is simply that\n“every active force produces more than one change—every\ncause produces more than one effect” (37).  Spencer claims that\nall phenomena exhibit the same development from the simple to the\ncomplex for this same reason.  He finds evidence for progress in\nastronomy (10–11), geology (12–13), and linguistics (23–4).\n\n\nThe modern literature on progress generally argues that European\nscience, culture, and institutions are the best in the world at the\ntime the author is writing.  But claims or insinuations that Europeans\nare biologically superior are rarer.  Turgot, as we have seen, states\nthat individual genius occurs as frequently among non-Europeans as\namong Europeans.  Nor do Mill's claims for European superiority\nrest on biological arguments (1859, 80).  In other words, the\nparadigmatic progress narrative shows Europeans setting the standards\nand then the rest of the world catching up until everyone is a full\nparticipant in an enlightened order.\n\n\nThe introduction of biological evolution into writings on progress\nenabled a new form of Eurocentrism, one founded on biological\nracism.  Spencer enlists evolutionary theory to claim that different\nraces of human beings exist and form a clear hierarchy: “The\ncivilized man departs more widely from the general type of the\nplacental mammalia than do the lower human races” (1857, 18).\nThis includes mental characteristics: “Judging from the greater extent\nand variety of faculty he exhibits, we may infer that the civilized\nman has also a more complex or heterogenous nervous system than the\nuncivilized man” (1857, 18).  Spencer's racism is central to his\nview of humans as a group and of human potential.  Ultimately it calls\ninto question whether he can be said truly to propose an account of\nprogress.\n\n5. Criticisms of the Doctrine of Progress \n\nIf the 19th century is the high water mark of progress narratives, the\nfollowing period is the era of critics.  In general, criticisms of the\ndoctrine of progress fall into two categories.  The first category\ncontains straightforward denials of the claim that the human condition\nis improving.  The second category consists of condemnations of the\ndoctrine of progress on skeptical grounds.\n\n\nConsider the first group of criticisms.  If the human condition is not\nimproving, either circumstances are getting worse, or they are\nfluctuating between some upper and lower bound.  Each alternative is\ncertainly arguable.  Horrific human catastrophes, such as the\ngenocides, wars, and environmental destruction of the 20th century,\ncan bolster the argument that things are getting worse.  But less\ndramatic evidence, like increasing alienation in industrialized\nsocieties, could be cited in support of the same claim.  Then there\nare those who emphasize that natural limits will keep the human\ncondition within certain bounds.  Either the natural environment or\nhuman nature could place limits on improvement and, for that matter,\non deterioration.\n\n\nThe previous criticisms take for granted that it makes sense to speak\nof the human condition as improving or declining.  But one can\nquestion whether these statements are truly coherent.  To vindicate\nsuch sweeping claims, it must be possible to construct an ordering of\npast, present, and future states of affairs.  But, in reality, it is\nsometimes difficult even in the case of individuals to say whether\nchanges have been improvements or not.  Consider the person who is\nforced to reflect and regroup after a mild setback.  In the period\nimmediately after the setback, the person is less content but acting\nwith greater autonomy.  To evaluate the change in the person's\nstate, we must treat the values of being content and being autonomous\nas commensurable, and some will argue that they are not.  Evaluating a\nchange in an entire society involves the same kinds of difficult\ncomparisons, plus a whole collection of additional ones based on\ndistributive concerns.  For instance, if a society becomes wealthier\nand less egalitarian over time, is this an improvement or not?\nFinally, even if we think a complete ordering of states of affairs is\nachievable, we might question the use of dialectical accounts to\njustify violence and catastrophes.  Why should we be reconciled to a\nviolent war just because it set the stage for institutional\nimprovement?\n\n\nOther skeptical arguments point to the difficulty of inferring broad\nhistorical laws from available evidence.  In pursuit of a universal\nhistory, most theorists refuse to create a priori accounts\nand instead rely on empirical inferences.  It is possible to attack\nthe grounds on which theorists infer trends from past and present\nsocial phenomena.  For instance, it is a mistake to equate temporal\nand spatial distance.  Theorists sometimes use contemporary reports of\nAmerica or Africa to draw conclusions about an earlier time in Europe.\nOr, they take what they know about their own history and make\nassumptions about “primitive” societies based on that\ninformation.  Finally, even if one accurately captures a trend, it is\ndifficult to extrapolate into the future.  If we view humans as free,\nas long as institutional arrangements leave room for choice, the\nfuture is not entirely predictable.\n\n\nAll these arguments appear in the writings of critics of progress.\nProviding a comprehensive survey of the critics is beyond the scope of\nthis article.  Instead, the next section will treat a few important\nauthors who reject the doctrine of progress, as well as one who\nattempts to revive it.  Not all of the critics considered are\npessimists.  One may point out the possibility of a bright future\nwhile emphasizing that it is up to humans to choose it.\n\n6. The 20th Century and Beyond \n\nSome of the deepest criticisms of progress were produced during and\nafter the catastrophes and upheavals of the 20th century.  Theodor Adorno\n(1903–1969) wrote Minima Moralia, a collection of short\npieces, during World War II and its aftermath.  This work addresses a\nvariety of interlocking topics relating to fascism, capitalism, and\nthe war.  As a German and a Jew in exile, Adorno is concerned to\nconfront Nazism and the Holocaust.  Given his intellectual background\nas a scholar of Hegel and Marx, this confrontation takes the shape of\na critique of Hegel's philosophy of history.  Recall that Hegel\nclaims that a reflective individual who surveys the course of history\nwill be reconciled to tragedies when he understands their contribution\nto progress overall.  Adorno is viscerally repulsed by this notion.\nHe notes with indignation: “Millions of Jews have been murdered,\nand this is to be seen as an interlude and not as the catastrophe\nitself” (1951, 55).\n\n\nAdorno attacks Hegel from two directions.  First Adorno is simply\nskeptical that fascism and the Holocaust can be part of any upward\nhistorical trend (55–6).  Second, he points to a tension in\nHegel's own thought.  He notes that, in the Phenomenology of\nSpirit, Hegel advises “tarrying with the negative”\n(1807, §32), which means giving the negative moments in\nhistory a full dose of philosophical attention.  However, Adorno says,\nin practice Hegel often moves past human evils and individual fates in\na cursory fashion (1951, 16–17), hurrying toward the stage of\nreconcilation.  Adorno proposes a new method of examining history for\nmeaning, exemplified by Minima Moralia, that dwells on\nindividual experience and catastrophe.  Theoretically, Adorno reverses\nHegel, asserting “the whole is the false” (Adorno 1951,\n50).\n\n\nIn Minima Moralia, Adorno mentions that the writings of\nWalter Benjamin (1892–1940) are an inspiration to him.  In the “Theses\non History,” Benjamin offers a similar criticism of the Hegelian and\nMarxian philosophy of history.  The ninth thesis perhaps speaks for\nitself:\n\n\nA Klee painting named “Angelus Novus” shows an angel looking as though\nhe is about to move away from something he is fixedly contemplating.\nHis eyes are staring, his mouth is open, his wings are spread.  This\nis how one pictures the angel of history.  His face is turned toward\nthe past.  Where we perceive a chain of events, he sees one single\ncatastrophe which keeps piling wreckage upon wreckage and hurls it in\nfront of his feet.  The angel would like to stay, awaken the dead, and\nmake whole what has been smashed.  But a storm is blowing from\nParadise; it has caught in his wings with such violence that the angel\ncan no longer close them.  This storm irresistibly propels him into\nthe future to which his back is turned, while the pile of debris\nbefore him grows skyward.  This storm is what we call\nprogress. (Benjamin 1941, 257–8)\n\n\nBenjamin reverses the Hegelian worldview poetically, just as Adorno\ndoes so theoretically.\n\n\nDecolonization presented a second occasion for rethinking the concept of\nprogress.  In the twenty years after World War II, the European powers relinquished \nthe vast majority of the non-European colonies still in their possession \n(Hunt et. al. 1995, 996–99). Scholars from the former European colonies, \nreflecting on the colonial past, have noted that European apologists for \ncolonialism claimed that it modernized the supposedly backward non-European world. \nIn other words, the apologists situated colonialism in a progress narrative. \nImplicitly or explicitly, postcolonial critics hold that this use of the concept \nof progress calls it into question.   \n\n\nBeyond this common core, the criticisms offered vary. For instance, Samir Amin's \nstudy  Eurocentrism  is concerned to criticize a particular conception \nof progress. This conception, which he terms Eurocentrism, characterizes all major \nhistorical innovations as European.  It also views capitalist democracy as the ideal\nsocial system and colonialism as instrumental in spreading it throughout the world \n(Amin 1988, 108). Finally, Eurocentricism holds that current global economic \ninequality is caused by internal features of individual countries (77) and is in \nprinciple eliminable (111). Now, Amin does not reject the project of identifying \nmacro-historical movements. His reasoning is, in fact, influenced by Marxism. \nHe seeks only to replace Eurocentrism with a truer account. To do so, he first \npresents an alternate sketch of historical development that shines light on \nnon-European contributions.  He next argues that current global inequality is\nproduced by international capitalism and cannot be eradicated without dismantling\nthat system (112–14).  He ends by stating that some form of socialism is the only \nstable and humane political system, although it is far from inevitable (152). \n\n\nPostmodern postcolonial theorists offer a more radical critique of\nEuropean progress narratives than Amin does.  Michel Foucault, the\nFrench historian of ideas, is a major influence on the school.\nFoucault holds that discourses are what constitute and empower the\nsubjects that make history.  Thus he takes discourses as the\nfundamental objects of historical study.  In Orientalism,\nEdward Said (1935–2003) applies Foucault's method of discourse\nanalysis to 18th-, 19th-, and 20th-century writings about the Middle\nEast by British and French novelists, travelers, and academics (Said\n1978, 201). At the heart of the discourse of Orientalism is the\nconviction that the countries of the Middle East lag behind those of\nEurope and can only improve under the tutelage of Europeans (172,\n205–06).  Said argues that the discourse of Orientalism laid the\nfoundation for the colonial project and supported it once it was\nunderway (210).  In addition to Said, the historians of the subaltern\nstudies movement have adapted a Foucauldian view of history, in their\ncase to analyze Indian colonial history (Prakash 1994, 1480).  They\nhave drawn attention to historical actors they term\n“subaltern.” These are non-elite Indians that challenged\nthe discourses of both colonialism and anti-British nationalism by\nexploiting inconsistencies in those discourses (1482–3).\nAlthough at odds in many ways, both discourses drew heavily from\nprogress narratives (1475).  In general, postmodern postcolonialists\naim to show that the typical universal history is one discourse among\nmany incommensurable discourses, none of which are without\ninconsistencies.\n\n\nSo far, we have seen how the events of the 20th century provoked\ncriticisms of the typical European progress narrative. In contrast,\nthe collapse of communism inspired a minor revival of the traditional\nprogress narrative.  In his 1989 article “The End of\nHistory?” Francis Fukuyama proclaims: “What we may be\nwitnessing is not just the end of the Cold War … but the end of\nhistory as such: that is, the end point of mankind's ideological\ndevelopment and the universalization of Western liberal democracy as\nthe final form of human government” (1989, 3).  This article and\nits companion book, The End of History and the Last Man,\nendorse Hegelian social theory as Fukuyama interprets it.  For\nFukuyama, Hegel at once offers an idealist theory of social change and\nchampions liberal democracy.  Fukuyama argues that, according to\nHegel, history entered its final phase when the principles of liberal\ndemocracy first motivated a world historical event, namely the French\nRevolution (1992, xvii; 199).  After that crucial point, no more major\ndevelopments were in store, but instead the gradual spread and\nrealization of the liberal democratic ideal.\n\n\nOf course, this argument was seriously challenged by the rise of\nfascism and communism in the 20th century and the conflicts that\nensued.  But Fukuyama in 1989 was maximally situated to defend Hegel\nand to argue that these ideological alternatives to liberal democracy were\nessentially deviations from deeper trends.  According to Fukuyama,\nfascism clearly failed by the mid-century (16-17) and now, with the\nfall of the Soviet Union, it was evident that communism was also a\ndead end. Fukuyama states that the proximate cause of the Soviet regime's fall \nwas its lack of legitimacy with the governing elite (30–1). The elite lost faith in \nthe regime because they saw that it was ideologically bankrupt (31).\n\n\nAccording to Fukuyama, liberalism's great ideological rivals\nfailed in the long term for two reasons.  First of all, communism has the \nwrong theory of economic management (40, 93–95), and could not provide long-term\neconomic prosperity (28–29).  Thus Marx's claim that capitalism\nwas materially unstable proved true of communism instead.  Second,\nfollowing Hegel, Fukuyama asserts that only liberalism can satisfy the\nhuman desire for recognition in a stable fashion.\n\n\nFukuyama ends his book with an intriguing consideration of\nHegel's view of war. Fukuyama agrees with Hegel that liberal\ndemocracy's greatest weakness is its tendency to produce selfish\nand effete bourgeois types.  But he points out that war—at least\nmodern war—is destructive rather than invigorating (1992, 335).\nHe asserts that World War I was caused partly by widespread\nrestlessness (331–332), but its result was to devastate rather than\nre-energize Europe (335).  It may be that those who wish to abolish\nwar are naive, but Fukuyama argues persuasively that Hegel's\nview of war is equally naive.\n\n\nUnlike Fukuyama, John Rawls (1921–2002) never argues that the liberal\ndemocratic ideal is the necessary endpoint of historical development.\nInstead, Rawls's first priority is the justification of a particular\nconception of liberal justice, one that supports basic political and\ncivil freedoms, and also dictates significant economic redistribution.\nAt the same time, influenced by Kant and Hegel (2000, 330), Rawls is\nconcerned to show that the ideal he describes is possible (1996,\nxx). By this, he means that it is reachable from the present and, once\nattained, capable of lasting “in perpetuity” (1971, 131;\n1996, 18).  He also intends for his demonstration of a just\nsociety's possibility to increase its probability: he claims\nthat the Weimar Republic disintegrated into Nazism because its main\nplayers lost faith in the idea of a pluralistic society (1996,\nlxi–lxii).\n\n\nRawls defines a “well-ordered society” (1971, 4) as a just\nsociety whose members understand, endorse, and act from the principles\nof justice, and moreover are aware of each other's attitudes.  A\nwell-ordered society is “stable” (1971, 455) if its just\ninstitutions nurture rather than thwart the appropriate attitudes in\nits members.  Thus a stable well-ordered society is one whose\ninstitutions are reproduced over time by informed, morally motivated\ncitizens. Part III of A Theory of Justice argues that a\nsociety satisfying Rawlsian liberal principles of justice will be\nstable.\n\n\nIn Political Liberalism, Rawls yokes the question of the\npersistence of a liberal society to the question of its emergence.\nRawls draws on familiar historical events to illustrate how his ideal\nsociety could emerge.  He notes that freedom of religion started as a\n“modus vivendi” (1996, xli), or practical solution, to the\nwars of religion between Catholics and Protestants.  Both groups\nagreed to the solution because they were exhausted by the fighting,\nnot because they endorsed freedom of religion for its own sake.  Yet\nover time Europeans came to endorse freedom of religion on deeper\ngrounds than their immediate self-interest (xxv-xxvii).\n\n\nRawls thinks that political liberalism extends freedom of religion to\nmoral worldviews in general. Thus he hopes that an analogous path could lead to \nthe emergence of a well-ordered society. Individuals could first choose \nprinciples of justice as compromises to persistent moral disagreements, and over \ntime come to endorse such principles for their own sake.  Respectful public \ndebate—what Rawls calls the use of “public reason” (1996,\n213)—will aid the transformation (1996, 165–67).  Over time a\nsociety of many competing worldviews—or “reasonable\ncomprehensive doctrines”—can come to an “overlapping\nconsensus” on principles of justice governing the public sphere\n(1996, 134).  Other remarks suggest a different path to the same\nsituation.  Here Rawls suggests that his theory is an immanent working\nout of ideas already “embedded in our public life” (1980,\n307). This ideological connection to the present should at least\nfacilitate the emergence of a more just society.  In this way, Rawls\ncombines optimism and realism, rejecting the doctrine of progress but\nemphasizing the possibility of lasting improvement.\n\n\nIn contrast to Rawls' basic optimism, environmentalists have recently\nproduced some of the most alarming criticisms of the idea of progress.\nJared Diamond and Ronald Wright are examples.  The authors share three\nbasic theoretical commitments.  First, they point to the natural\nenvironment as the most important determinant of long-term social\nstability and change.  Next, they appeal to historical examples to\nargue that change is non-linear and that environmental variables\nexplain the non-linearity.  Then, extrapolating from past collapses,\nthey argue that recent growth rates should not encourage optimism.\nInstead, global collapse is a real possibility.\n\n\nDiamond's first book, Guns, Germs, and Steel (1997),\nbegins with the Columbian encounter.  Diamond asks why the Europeans\nconquered the Americans, rather than the other way around.  Assuming\nthat the answer lies with Europe's technological advantage over\nthe Americas, Diamond arrives at a second question.  Why, in the late\n15th and early 16th centuries, did the Europeans have this advantage\n(1997, 15)? If all pre-historic peoples began roughly at the same\nstarting point, this question implies a third: Why did pre-Columbian\nrates of development vary so much worldwide (16)?  Appealing to recent\nresearch in scientific anthropology, Diamond argues that environmental\nvariation satisfactorily accounts for the corresponding social and\ntechnological variation.  Diamond defends the thesis that features of\nthe natural environment, and the technology they directly enable, are\nthe driving forces of long-run development (1997, 87).\n\n Wright's A Short History of Progress (2004) also\nargues for the primacy of environmental variables, but shifts the\nfocus away from differential rates of development. Wright states that\nwhat is truly surprising is the similarity among developmental paths\nin areas isolated from one another (2004, 50).  In both Europe and the\nAmericas, we see a movement from illiterate, egalitarian\nhunter-gatherer societies to complex and hierarchical\nagriculturally-based ones.  At the time of their confrontation, the\nworlds of the Spanish and the Aztecs were more alike than they were\ndifferent.  Wright takes the similarity as strong evidence that\nuniversal environmental features and human needs drive development\n(51).\n\n\nThe trajectory from simplicity to complexity appears linear.  But\nWright and Diamond argue that appearances are misleading.  Looking\nclosely at human history, we see many instances of collapse.\nUnderstanding the cause of circumscribed collapses in the past will\nfoster healthy skepticism about where the human race as a whole is\nheaded.  Wright looks at failed societies such as the kingdom of Ur,\nAncient Maya and Rome, and Easter Island.  Diamond's second\nbook, Collapse (2005), considers some of the same failures.\nFailures occur when societies enter a progress trap (Wright 2004, 5).\nA progress trap is a practice that drives environmentally\nunsustainable growth and is difficult to halt once it is in motion.\nAlthough this definition of the term ‘progress trap’ is due to\nWright, Diamond studies essentially the same phenomenon and traces\nthe process in greater detail than Wright does.\n\nAssume the growth of a society is determined by its ability to exploit\nthe natural resources that it possesses.  Assume that it will exploit\nthem to its full potential.  As the society grows, its ability to\nexploit its environment increases, which in turn causes it to develop\nfurther.  Growth is not constant but accelerating.  The society grows\nexactly up to the point at which its resources are depleted.  At that\nmoment, the rate of development and the level of development are at a\nmaximum.  Immediately afterwards, with the material foundation of\nsociety gone, a dramatic collapse occurs.  Not only does past growth\nnot mean future growth, the trajectory is virtually discontinuous at\nthe moment of collapse.\n\n\nThis trajectory presupposes that the society makes no attempt to renew\nthe resources on which it depends.  Diamond isolates factors that\nexplain the blindness, one especially important one being the\nadherence to dysfunctional value systems (432–434).  Wright speaks of\n“sticking to entrenched beliefs and practices [and] robbing the future\nto pay the present” (2004, 79). For Diamond, the factors are\nchangeable by individual and collective acts of will.  Unlike Wright,\nDiamond documents successes as well as failures: societies that\nrecognized and altered their unsustainable practices before it was too\nlate.  Historical examples of these include Tokugawa, Japan (2005,\n294–306), and Tikopia, an island in the South Pacific (2005, 286–93).\nThese societies were flexible and farsighted where unsuccessful ones\nwere rigid and focused on the present.\n\n\nWright and Diamond see various aspects of the present as dangerous,\nincluding the growth of population and pollution (Wright 2002, 128),\nand the depletion of crucial resources (Diamond 2005, 487–490).  These\nare the features of a civilization immediately before a\ncollapse. Wright (2004, 64) and Diamond (2005, 118–119) suggest that\nincreasing interconnectedness means that the globe will succeed as a\nwhole or fail as a whole. But, ultimately, neither author is a\ncomplete environmental determinist or a complete pessimist.  Diamond\nsuggests that same kind of collective rationality that has prevented\nsmall-scale collapse can prevent global collapse (2005, 522).  Unlike\nDiamond, Wright is not detailed in his recommendations for change and\nhis vision of a truly sustainable globe remains murky.  But he too\nthinks that in the next 100 years, individual and group choices will\ndetermine whether or not collapse occurs (2004, 130–132).\n\n\nThe idea of progress is complex enough that it has attracted many\ntypes of criticism, and some of them seem especially hard to refute.\nFor one thing, the determinism inherent in the idea of progress is\ndifficult to maintain.  It is telling that many of the theorists do\nnot incorporate their act of writing and the reception they hope for\ninto a deterministic framework.  Second, whether we agree with the\nprecise claims made by Diamond and Wright, it is now clear that\nnatural limits on growth exist. The exact limits cannot be known for\ncertain unless they are reached.  But rather than proceeding as if no\nenvironmental limits exist, it is more prudent to estimate the limits\nand develop policy accordingly.  It is better to slow down and come to\na halt a few feet before a brick wall than to ignore it and slam into\nit.\n\n\nFor those who reject the idea of progress for these or other reasons,\nwhy care about theories of progress? Not all components of the\nwritings on progress are equally problematic. Three seem especially\nworthwhile. First, theories of progress draw attention to the power of the \nWestern scientific paradigm.  Next, some theorists of progress formulate plausible\nnormative standards for individual domains of human life.  Last, the\nwritings on progress contain some of the most powerful statements of\nthe Enlightenment ideals of freedom, equality, and cosmopolitan\njustice.\n\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adorno, T., 1951, <em>Minima Moralia: Reflections from Damaged\nLife</em>, E.F.N. Jephcott (trans.), London: Verso, 1997.",
                "Amin, S., 1988, <em>Eurocentrism</em>, R. Moore (trans.), New\nYork: Monthly Review Press, 1989.",
                "Aristotle, <em>Meteorology</em>, E.W. Webster (trans.), in <em>The\nComplete Works of Aristotle: Volume One</em>, J. Barnes (ed.),\nPrinceton, NJ: Princeton University Press, 1984.",
                "–––, <em>Metaphysics</em>, W.D. Ross (trans.),\nin <em>The Complete Works of Aristotle: Volume Two</em>, J. Barnes\n(ed.), Princeton, NJ: Princeton University Press, 1984.",
                "–––, <em>Nicomachean Ethics</em>, W.D. Ross\n(trans.), in <em>The Complete Works of Aristotle: Volume Two</em>,\nJ. Barnes (ed.), Princeton, NJ: Princeton University Press, 1984.",
                "–––, <em>Politics</em>, B. Jowett (trans.),\nin <em>The Complete Works of Aristotle: Volume Two</em>, J. Barnes\n(ed.), Princeton, NJ: Princeton University Press, 1984.",
                "Augustine, 426, <em>The City of God against the Pagans</em>,\nR.W. Dyson (trans.), Cambridge: Cambridge University Press,\n1998. ",
                "Benjamin, W., 1940, “Theses on the Philosophy of\nHistory,” in <em>Illuminations</em>, H. Zohn (trans.), H. Arendt\n(ed.), New York: Schocken, 1969, pp. 253–64. ",
                "Bury, J. B., 1932, <em>The Idea of Progress: an Inquiry into Its\nOrigin and Growth</em>, Middlesex, UK: The Echo Library, 2006.",
                "Comte, A., [1830–42], <em>The Positive Philosophy of Auguste\nComte: Freely Translated and Condensed by Harriet Martineau,</em>\nH. Martineau (trans). 3 vols. London: George Bell &amp; Sons,\n1896. ",
                "–––, <em>System of Positive Polity: vol. 1</em>,\nJ. H. Bridges (trans.), 4 vols. London: Longmans, Green, and Co.,\n1875. ",
                "Condorcet, M., 1795, <em>Outlines of an Historical View of the\nProgress of the Human Mind</em>, New York: M. Carey, H. and P. Rice\nand Co., 1796.",
                "Diamond, J., 1997, <em>Guns, Germs, and Steel: The Fates of Human\nSocieties</em>, New York: W.W. Norton and Company. ",
                "–––, 2005, <em>Collapse: How Societies Choose to\nFail or Succeed</em>, New York: Viking. ",
                "Fukuyama, F., 1989, “The End of History?,” <em>The\nNational Interest</em>, Summer: 3–18. ",
                "–––, 1992, <em>The End of History and the Last\nMan</em>, New York City: Avon Books, Inc. ",
                "Hesiod, <em>Works and Days</em>, M.L. West (trans.), Oxford:\nOxford World Classics, 1988.",
                "Hegel, G.W.F., <em>Introduction to The Philosophy of History</em>,\nL. Rauch (trans.), Indianapolis: Hackett, 1988. ",
                "–––, 1807, <em> Phenomenology of Spirit </em>,\nA.V. Miller (trans.), Oxford: Oxford University Press, 1997. ",
                "–––, 1821, <em>Elements of the Philosophy of\nRight</em>, H.B. Nisbet (trans.), A. W. Wood (ed.), Cambridge:\nCambridge University Press, 1991. ",
                "Hume, D., 1739–49, <em>A Treatise of Human Nature</em>,\nE.C. Mossner (ed.), London: Penguin Books, 1985.",
                "–––, 1777, “Of the Rise and Progress of\nthe Arts and Sciences,” in <em>Selected Essays</em>, S. Copley\nand A. Edgar (eds.), Oxford: Oxford University Press, 1993,\npp. 56–77.",
                "Hunt, L., Martin, T.R., Rosenwein, B.H., Hsia, R.P., and Smith, B.G.,  \n1995, <em>The Challenge of the West: Peoples and Cultures from the Stone\nAge to the Global Age</em>, Lexington, MA: D.C. Heath and Company.",
                "Kant, I., 1784, “Idea for a Universal History with a\nCosmopolitan Purpose,” in <em>Political Writings</em>,\nH.B. Nisbet (trans.), H. Reiss (ed.), Cambridge: Cambridge University\nPress, 1991. ",
                "–––, 1795, “Perpetual Peace,”\nin <em>Political Writings</em>, H.B. Nisbet (trans.), H. Reiss (ed.),\nCambridge: Cambridge University Press, 1991. ",
                "Levins, R., and R. Lewontin, 1985, <em>The Dialectical\nBiologist</em>, Cambridge, MA: Harvard University Press. ",
                "Marx, K., 1845, <em>The German Ideology: Part I</em>, in <em>The\nMarx-Engels Reader</em>, R. C. Tucker (ed.), London: W.W. Norton and\nCompany, 1978. ",
                "–––, 1873, <em>Capital, Volume One</em>,\nin <em>The Marx-Engels Reader</em>, R. C. Tucker (ed.), London:\nW.W. Norton and Company, 1978. ",
                "Marx, K. and F. Engels, 1848, <em>Manifesto of the Communist\nParty</em>, in <em>The Marx-Engels Reader</em>, R. C. Tucker (ed.),\nLondon: W.W. Norton and Company, 1978. ",
                "Mill, J.S., 1843, <em>A System of Logic, Ratiocinative and\nInductive</em>, London: Longmans, Green, and Co., 1906.",
                "–––, 1859,<em> On Liberty </em> in <em>On\nLiberty and Other Essays</em>, J. Gray (ed.), Oxford: Oxford\nUniversity Press, 1991. ",
                "–––, 1861a, <em> Considerations on\nRepresentative Government</em> in <em>On Liberty and other\nEssays</em>, John Gray (ed.), Oxford: Oxford University Press,\n1991. ",
                "–––, 1861b, <em> Utilitarianism</em> in <em>On\nLiberty and other Essays</em>, John Gray (ed.), Oxford: Oxford\nUniversity Press, 1991. ",
                "–––, 1865, <em> Auguste Comte and\nPositivism</em>, 4th ed. London: Kegan Paul, Trench, Trübner, and\nCo., 1891. ",
                "Nisbet, R, 1994, <em>History of the Idea of Progress</em>, New\nBrunswick, NJ: Transaction Publishers.",
                "Palmer, R.R. and J. Colton, 1965, <em> A History of the Modern\nWorld </em>, 3rd ed., Alfred A. Knopf: New York.",
                "Plato, <em>Laws</em>, T.J. Saunders (trans.), in <em>Plato:\nComplete Works</em>, J. Cooper and D. Hutchinson (eds.), Indianapolis,\nIN: Hackett, 1997.  ",
                "–––, <em>Statesman</em>, C.J. Rowe (trans.),\nin <em>Plato: Complete Works</em>, J. Cooper and D. Hutchinson (eds.),\nIndianapolis, IN: Hackett Publishing Company, 1997.  ",
                "Prakash, G., 1994, “Subaltern Studies as Postcolonial Criticism,” \n<em>The American Historical Review</em>, 99: 1475–90. ",
                "Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1980, <em>Kantian Constructivism in Moral\nTheory</em>, in <em>John Rawls: Collected Papers</em>, S. Freeman\n(ed.), Cambridge, MA: Harvard University Press, 1999.",
                "–––, 1996, <em>Political Liberalism</em>, New\nYork: Columbia University Press. ",
                "–––, 2000, <em>Lectures on the History of Moral\nPhilosophy</em>, B. Herman (ed.), Cambridge, MA: Harvard University\nPress.",
                "Said, E.W., 1978, <em> Orientalism, </em> New York: Vintage Books, 1979.",
                "Smith, A., 1759, <em>The Theory of the Moral Sentiments</em>,\nK. Haakonssen (ed.), Cambridge: Cambridge University Press, 2002.\n",
                "–––, 1776, <em>The Wealth of Nations</em>,\nE. Cannan (ed.), New York: Modern Library, 1994.\n",
                "Spencer, H., 1851, <em>Social Statics: or, The Conditions\nEssential to Human Happiness</em>, London: John Chapman, 142,\nStrand. ",
                "–––, 1857, “Progress: Its Law and\nCause,” in <em>Essays: Scientific, Political, and Speculative:\nVolume I</em>, New York: D. Appleton and Company, 1899, pp. 8–62.",
                "Teggart, F. J., <em>The Idea of Progress: A Collection of\nReadings</em>, Revised Edition, G. H. Hildebrand (ed.), Berkeley, CA:\nUniversity of California Press, 1949. ",
                "Turgot, A., 1750, <em>A Philosophical Review of the Successive\nAdvances of the Human Mind</em>, in <em>Turgot on Progress, Sociology\nand Economics</em>, R.L. Meek (ed.), Cambridge: Cambridge University\nPress, 1973.",
                "–––, 1751, <em>On Universal History</em>,\nin <em>Turgot on Progress, Sociology and Economics</em>, R.L. Meek\n(ed.), Cambridge: Cambridge University Press, 1973.",
                "Wood, A.W., 1990, <em>Hegel's Ethical Thought</em>, Cambridge:\nCambridge University Press.",
                "Wright, R., 2004, <em>A Short History of Progress</em>, Cambridge,\nMA: Da Capo Press. "
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Adorno, T., 1951, <em>Minima Moralia: Reflections from Damaged\nLife</em>, E.F.N. Jephcott (trans.), London: Verso, 1997.</li>\n<li>Amin, S., 1988, <em>Eurocentrism</em>, R. Moore (trans.), New\nYork: Monthly Review Press, 1989.</li>\n<li>Aristotle, <em>Meteorology</em>, E.W. Webster (trans.), in <em>The\nComplete Works of Aristotle: Volume One</em>, J. Barnes (ed.),\nPrinceton, NJ: Princeton University Press, 1984.</li>\n<li>–––, <em>Metaphysics</em>, W.D. Ross (trans.),\nin <em>The Complete Works of Aristotle: Volume Two</em>, J. Barnes\n(ed.), Princeton, NJ: Princeton University Press, 1984.</li>\n<li>–––, <em>Nicomachean Ethics</em>, W.D. Ross\n(trans.), in <em>The Complete Works of Aristotle: Volume Two</em>,\nJ. Barnes (ed.), Princeton, NJ: Princeton University Press, 1984.</li>\n<li>–––, <em>Politics</em>, B. Jowett (trans.),\nin <em>The Complete Works of Aristotle: Volume Two</em>, J. Barnes\n(ed.), Princeton, NJ: Princeton University Press, 1984.</li>\n<li>Augustine, 426, <em>The City of God against the Pagans</em>,\nR.W. Dyson (trans.), Cambridge: Cambridge University Press,\n1998. </li>\n<li>Benjamin, W., 1940, “Theses on the Philosophy of\nHistory,” in <em>Illuminations</em>, H. Zohn (trans.), H. Arendt\n(ed.), New York: Schocken, 1969, pp. 253–64. </li>\n<li>Bury, J. B., 1932, <em>The Idea of Progress: an Inquiry into Its\nOrigin and Growth</em>, Middlesex, UK: The Echo Library, 2006.</li>\n<li>Comte, A., [1830–42], <em>The Positive Philosophy of Auguste\nComte: Freely Translated and Condensed by Harriet Martineau,</em>\nH. Martineau (trans). 3 vols. London: George Bell &amp; Sons,\n1896. </li>\n<li>–––, <em>System of Positive Polity: vol. 1</em>,\nJ. H. Bridges (trans.), 4 vols. London: Longmans, Green, and Co.,\n1875. </li>\n<li>Condorcet, M., 1795, <em>Outlines of an Historical View of the\nProgress of the Human Mind</em>, New York: M. Carey, H. and P. Rice\nand Co., 1796.</li>\n<li>Diamond, J., 1997, <em>Guns, Germs, and Steel: The Fates of Human\nSocieties</em>, New York: W.W. Norton and Company. </li>\n<li>–––, 2005, <em>Collapse: How Societies Choose to\nFail or Succeed</em>, New York: Viking. </li>\n<li>Fukuyama, F., 1989, “The End of History?,” <em>The\nNational Interest</em>, Summer: 3–18. </li>\n<li>–––, 1992, <em>The End of History and the Last\nMan</em>, New York City: Avon Books, Inc. </li>\n<li>Hesiod, <em>Works and Days</em>, M.L. West (trans.), Oxford:\nOxford World Classics, 1988.</li>\n<li>Hegel, G.W.F., <em>Introduction to The Philosophy of History</em>,\nL. Rauch (trans.), Indianapolis: Hackett, 1988. </li>\n<li>–––, 1807, <em> Phenomenology of Spirit </em>,\nA.V. Miller (trans.), Oxford: Oxford University Press, 1997. </li>\n<li>–––, 1821, <em>Elements of the Philosophy of\nRight</em>, H.B. Nisbet (trans.), A. W. Wood (ed.), Cambridge:\nCambridge University Press, 1991. </li>\n<li>Hume, D., 1739–49, <em>A Treatise of Human Nature</em>,\nE.C. Mossner (ed.), London: Penguin Books, 1985.</li>\n<li>–––, 1777, “Of the Rise and Progress of\nthe Arts and Sciences,” in <em>Selected Essays</em>, S. Copley\nand A. Edgar (eds.), Oxford: Oxford University Press, 1993,\npp. 56–77.</li>\n<li>Hunt, L., Martin, T.R., Rosenwein, B.H., Hsia, R.P., and Smith, B.G.,  \n1995, <em>The Challenge of the West: Peoples and Cultures from the Stone\nAge to the Global Age</em>, Lexington, MA: D.C. Heath and Company.</li>\n<li>Kant, I., 1784, “Idea for a Universal History with a\nCosmopolitan Purpose,” in <em>Political Writings</em>,\nH.B. Nisbet (trans.), H. Reiss (ed.), Cambridge: Cambridge University\nPress, 1991. </li>\n<li>–––, 1795, “Perpetual Peace,”\nin <em>Political Writings</em>, H.B. Nisbet (trans.), H. Reiss (ed.),\nCambridge: Cambridge University Press, 1991. </li>\n<li>Levins, R., and R. Lewontin, 1985, <em>The Dialectical\nBiologist</em>, Cambridge, MA: Harvard University Press. </li>\n<li>Marx, K., 1845, <em>The German Ideology: Part I</em>, in <em>The\nMarx-Engels Reader</em>, R. C. Tucker (ed.), London: W.W. Norton and\nCompany, 1978. </li>\n<li>–––, 1873, <em>Capital, Volume One</em>,\nin <em>The Marx-Engels Reader</em>, R. C. Tucker (ed.), London:\nW.W. Norton and Company, 1978. </li>\n<li>Marx, K. and F. Engels, 1848, <em>Manifesto of the Communist\nParty</em>, in <em>The Marx-Engels Reader</em>, R. C. Tucker (ed.),\nLondon: W.W. Norton and Company, 1978. </li>\n<li>Mill, J.S., 1843, <em>A System of Logic, Ratiocinative and\nInductive</em>, London: Longmans, Green, and Co., 1906.</li>\n<li>–––, 1859,<em> On Liberty </em> in <em>On\nLiberty and Other Essays</em>, J. Gray (ed.), Oxford: Oxford\nUniversity Press, 1991. </li>\n<li>–––, 1861a, <em> Considerations on\nRepresentative Government</em> in <em>On Liberty and other\nEssays</em>, John Gray (ed.), Oxford: Oxford University Press,\n1991. </li>\n<li>–––, 1861b, <em> Utilitarianism</em> in <em>On\nLiberty and other Essays</em>, John Gray (ed.), Oxford: Oxford\nUniversity Press, 1991. </li>\n<li>–––, 1865, <em> Auguste Comte and\nPositivism</em>, 4th ed. London: Kegan Paul, Trench, Trübner, and\nCo., 1891. </li>\n<li>Nisbet, R, 1994, <em>History of the Idea of Progress</em>, New\nBrunswick, NJ: Transaction Publishers.</li>\n<li>Palmer, R.R. and J. Colton, 1965, <em> A History of the Modern\nWorld </em>, 3rd ed., Alfred A. Knopf: New York.</li>\n<li>Plato, <em>Laws</em>, T.J. Saunders (trans.), in <em>Plato:\nComplete Works</em>, J. Cooper and D. Hutchinson (eds.), Indianapolis,\nIN: Hackett, 1997.  </li>\n<li>–––, <em>Statesman</em>, C.J. Rowe (trans.),\nin <em>Plato: Complete Works</em>, J. Cooper and D. Hutchinson (eds.),\nIndianapolis, IN: Hackett Publishing Company, 1997.  </li>\n<li>Prakash, G., 1994, “Subaltern Studies as Postcolonial Criticism,” \n<em>The American Historical Review</em>, 99: 1475–90. </li>\n<li>Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1980, <em>Kantian Constructivism in Moral\nTheory</em>, in <em>John Rawls: Collected Papers</em>, S. Freeman\n(ed.), Cambridge, MA: Harvard University Press, 1999.</li>\n<li>–––, 1996, <em>Political Liberalism</em>, New\nYork: Columbia University Press. </li>\n<li>–––, 2000, <em>Lectures on the History of Moral\nPhilosophy</em>, B. Herman (ed.), Cambridge, MA: Harvard University\nPress.</li>\n<li>Said, E.W., 1978, <em> Orientalism, </em> New York: Vintage Books, 1979.</li>\n<li>Smith, A., 1759, <em>The Theory of the Moral Sentiments</em>,\nK. Haakonssen (ed.), Cambridge: Cambridge University Press, 2002.\n</li>\n<li>–––, 1776, <em>The Wealth of Nations</em>,\nE. Cannan (ed.), New York: Modern Library, 1994.\n</li>\n<li>Spencer, H., 1851, <em>Social Statics: or, The Conditions\nEssential to Human Happiness</em>, London: John Chapman, 142,\nStrand. </li>\n<li>–––, 1857, “Progress: Its Law and\nCause,” in <em>Essays: Scientific, Political, and Speculative:\nVolume I</em>, New York: D. Appleton and Company, 1899, pp. 8–62.</li>\n<li>Teggart, F. J., <em>The Idea of Progress: A Collection of\nReadings</em>, Revised Edition, G. H. Hildebrand (ed.), Berkeley, CA:\nUniversity of California Press, 1949. </li>\n<li>Turgot, A., 1750, <em>A Philosophical Review of the Successive\nAdvances of the Human Mind</em>, in <em>Turgot on Progress, Sociology\nand Economics</em>, R.L. Meek (ed.), Cambridge: Cambridge University\nPress, 1973.</li>\n<li>–––, 1751, <em>On Universal History</em>,\nin <em>Turgot on Progress, Sociology and Economics</em>, R.L. Meek\n(ed.), Cambridge: Cambridge University Press, 1973.</li>\n<li>Wood, A.W., 1990, <em>Hegel's Ethical Thought</em>, Cambridge:\nCambridge University Press.</li>\n<li>Wright, R., 2004, <em>A Short History of Progress</em>, Cambridge,\nMA: Da Capo Press. </li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Adorno, Theodor W.",
            "Comte, Auguste",
            "Hegel, Georg Wilhelm Friedrich",
            "history, philosophy of",
            "Kant, Immanuel: social and political philosophy",
            "Marx, Karl",
            "Mill, John Stuart: moral and political philosophy",
            "Rawls, John",
            "scientific progress",
            "Scottish Philosophy: in the 18th Century",
            "Spencer, Herbert"
        ],
        "entry_link": [
            {
                "../adorno/": "Adorno, Theodor W."
            },
            {
                "../comte/": "Comte, Auguste"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../history/": "history, philosophy of"
            },
            {
                "../kant-social-political/": "Kant, Immanuel: social and political philosophy"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../mill-moral-political/": "Mill, John Stuart: moral and political philosophy"
            },
            {
                "../rawls/": "Rawls, John"
            },
            {
                "../scientific-progress/": "scientific progress"
            },
            {
                "../scottish-18th/": "Scottish Philosophy: in the 18th Century"
            },
            {
                "../spencer/": "Spencer, Herbert"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=progress\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/progress/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=progress&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/progress/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=progress": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/progress/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=progress&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/progress/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://oll.libertyfund.org/\" target=\"other\">Online Library of Liberty</a>"
        ],
        "listed_links": [
            {
                "http://oll.libertyfund.org/": "Online Library of Liberty"
            }
        ]
    }
}