{
    "url": "qm-modal",
    "title": "Modal Interpretations of Quantum Mechanics",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Olimpia Lombardi\n<olimpiafilo@arnet.com.ar>\nDennis Dieks\n<D.G.B.J.Dieks@phys.uu.nl>",
        "author_links": [
            {
                "mailto:olimpiafilo%40arnet%2ecom%2ear": "olimpiafilo@arnet.com.ar"
            },
            {
                "mailto:D%2eG%2eB%2eJ%2eDieks%40phys%2euu%2enl": "D.G.B.J.Dieks@phys.uu.nl"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nOlimpia Lombardi\n&lt;<a href=\"mailto:olimpiafilo%40arnet%2ecom%2ear\"><em>olimpiafilo<abbr title=\" at \">@</abbr>arnet<abbr title=\" dot \">.</abbr>com<abbr title=\" dot \">.</abbr>ar</em></a>&gt;<br/>\nDennis Dieks\n&lt;<a href=\"mailto:D%2eG%2eB%2eJ%2eDieks%40phys%2euu%2enl\"><em>D<abbr title=\" dot \">.</abbr>G<abbr title=\" dot \">.</abbr>B<abbr title=\" dot \">.</abbr>J<abbr title=\" dot \">.</abbr>Dieks<abbr title=\" at \">@</abbr>phys<abbr title=\" dot \">.</abbr>uu<abbr title=\" dot \">.</abbr>nl</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Nov 12, 2002",
        "substantive revision Fri Oct 8, 2021"
    ],
    "preamble": "\n\nThe original “modal interpretation” of non-relativistic\nquantum theory was born in the early 1970s, and at that time the\nphrase referred to a single interpretation. The phrase now encompasses\na class of interpretations, and is best taken to refer to a\ngeneral approach to the interpretation of quantum theory. We shall\ndescribe the history of modal interpretations, how the phrase has come\nto be used in this way, and the general program of (at least some of)\nthose who advocate this approach.\n",
    "toc": [
        {
            "#OrigModaAppr": "1. The origin of the modal approach"
        },
        {
            "#GeneFeatModaInte": "2. General features of modal interpretations"
        },
        {
            "#RelaOtheNoncInte": "3. Relations to other non-collapse interpretations"
        },
        {
            "#BiorDecoSpecDecoModaInte": "4. Biorthogonal-decomposition and spectral-decomposition modal interpretations"
        },
        {
            "#PropCompAtomModaInte": "5. Property composition and atomic modal interpretation"
        },
        {
            "#DynaProp": "6. Dynamics of properties"
        },
        {
            "#PersModaInte": "7. Perspectival modal interpretation"
        },
        {
            "#ModaHamiInte": "8. Modal-Hamiltonian interpretation"
        },
        {
            "#NoniMeas": "9. Non-ideal measurements"
        },
        {
            "#RoleDeco": "10. The role of decoherence"
        },
        {
            "#MeasProbRevi": "11. The measurement problem revisited: completeness and hidden variables"
        },
        {
            "#InteProb": "12. The interpretation of probability"
        },
        {
            "#OpenProbPers": "13. Open problems and perspectives"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The origin of the modal approach\n\nIn traditional approaches to quantum measurement theory a central role\nis played by the projection postulate, which asserts that upon\nmeasurement the state of a physical system undergoes a discontinuous\nchange: it is projected (“collapses”) onto an eigenstate\ncorresponding to the measurement result. This postulate leads to many\ndifficulties: When exactly does a collapse takes place? What defines a\n“measurement” as opposed to an ordinary physical\ninteraction? The postulate is especially worrying when applied to\nentangled compound systems whose components are well-separated in\nspace. For example, in the Einstein-Podolsky-Rosen (EPR) experiment\nthere are strict correlations between two systems that have interacted\nin the past, in spite of the fact that the correlated quantities are\nnot sharply defined in the individual systems. The projection\npostulate in this case implies that the collapse resulting from a\nmeasurement on one of the systems instantaneously defines a sharp\nproperty in the distant other system. (See the discussion of the\ncollapse or projection postulate in the entry on\n philosophical issues in quantum theory.)\n\nA possible way out of these problems was noticed by van Fraassen\n(1972, 1974, 1991), who proposed to eliminate the projection postulate\nfrom the theory and to give a probabilistic interpretation to the\nremaining formalism of unitary quantum mechanics. Van Fraassen’s\ninterpretation relied on the distinction between the “dynamical\nstate” and the “value state” of a system at any\ninstant:\n\n The dynamical state determines what may be the\ncase: which physical properties the system may possess, and what\nprobabilities are attached to these possibilities.\n The value state represents what actually is the\ncase, that is, all the system’s physical properties that are\nsharply defined at the instant in question.\n\n\nThe dynamical state is the ordinary quantum state that occurs in the\nSchrödinger equation (in non-relativistic quantum mechanics), i.\ne. a vector or density matrix in Hilbert space, with the proviso that\nit always evolves unitarily, so never collapses.\n\nThe motivation for distinguishing between dynamical and value state is\nthe idea that a system may have a sharp value of an observable even if\nits unitarily evolving state is not an eigenstate of that observable.\nThis thought contradicts the so-called “eigenstate-eigenvalue\nlink”, which says that a system possesses a sharp value of an\nobservable (namely, one of its eigenvalues) if and only if its quantum\nstate is the corresponding eigenstate. The modal approach accepts the\n“if” part, but denies the “only if” part of\nthis statement. Van Fraassen accordingly introduced the notion of\n“value state”: a system’s physical properties (the\nsharply defined observables) are not one-to-one represented by the\ndynamical state, which occurs in the evolution equation, but by the\nvalue state, which typically differs from the dynamical state.\n\nVan Fraassen called his proposal “modal” because it\nnaturally connects to a modal logic of quantum propositions. Indeed,\nthe dynamical state in general only tells us what is possible and\nspecifies probabilities for the various possibilities. According to\nvan Fraassen, this modal and probabilistic aspect is fundamental to\nquantum mechanics and should not be viewed as arising from an\nincompleteness of the description (see Bueno 2014 for the relation\nbetween this and van Fraassen’s constructive empiricism).\n\nWhat then are the definite quantities and value states for a given\nsystem at a given time? Empirical adequacy requires that, in cases of\nmeasurement, the after-measurement value state of the measuring device\nshould correspond to a definite measurement result. Therefore, the\nscheme minimally has to generate the Born probability measure over\nvalue states that represent the possible measurement results. Van\nFraassen’s interpretation did not go further than this; it did\nnot specify precise value states outside of measurement situations and\ndefended agnosticism about the properties of physical systems in\ngeneral (see Ruetsche 1996 for critical discussion concerning this\npoint).\n\nIt is easy to see how these ideas could motivate a program for\nproviding a more elaborate modal interpretation of quantum theory that\nassigns definite properties to physical systems even when no\nmeasurements are taking place. To this more general modal program we\nnow turn.\n2. General features of modal interpretations\n\nIn the 1980s several authors presented realist interpretations which\ncan be regarded as variations on the just-mentioned modal themes (for\nan overview and references, see Dieks and Vermaas 1998). There are\ndifferences between these modal interpretations, but all agree on the\nfollowing points:\n\n The interpretation should be based on the standard formalism of\nquantum mechanics without the projection postulate: a modal\ninterpretation is a “non-collapse interpretation”, that\nis, an interpretation of unitary quantum mechanics.\n The interpretation should be “realist” in the sense\nthat it assumes that quantum systems always possess a number of\ndefinite properties, which may change with time.\n Quantum mechanics is taken to be universal: it applies both to\nmicroscopic and to macroscopic systems.\n The unitarily evolving state of the system contains information\nabout the possible physical properties of the system and the\ncorresponding probabilities. So, there is a probabilistic relation\nbetween the dynamical state and physical possibilities (represented by\npossible value states).\n A quantum measurement is an ordinary physical interaction, during\nwhich the dynamical state always evolves unitarily.\n\n\nThe Kochen-Specker theorem (1967) is an obstacle to any traditional\nrealist interpretation of quantum mechanics, since it proves the\nimpossibility of ascribing precise values to all physical\nquantities (observables) of a quantum system simultaneously, while\npreserving the functional relations between commuting observables.\n(See the entry on the\n the Kochen-Specker theorem.)\n Therefore, realist non-collapse interpretations are committed to\nselecting a (Boolean) subset of definite-valued observables out of all\nobservables. Each modal interpretation thus supplies a “rule of\ndefinite-value ascription” or “actualization rule”,\nwhich picks out, from the set of all the observables of a quantum\nsystem, the subset of definite-valued properties, which may change in\ntime.\n\nWhat should this actualization rule look like? In the mid-1990s a\nseries of authors confronted this question (Clifton 1995a, 1995b,\nDickson 1995a, 1995b). These authors proposed conditions\nto be satisfied by an actualization rule that defines a set of\npossibilities purely from the dynamical state, and concluded that the\npossible value states of the components of a two-part composite system\nshould be given by the states occurring in the Schmidt (bi-orthogonal)\ndecomposition of the dynamical state, or, equivalently, by the\nprojectors occurring in the spectral decomposition of the density\nmatrices representing partial systems (obtained by partial tracing)\n—see Section 4 for details.\n\nThe problem of definite-valued properties was approached in a more\ngeneral way by Bub and Clifton (1996); for an improved version, see\nBub, Clifton and Goldstein 2000). These authors started from the\nassumption that the definite-valued subset is determined by the\ndynamical state \\(\\ket{\\phi}\\) plus a “privileged\nobservable” \\(\\boldsymbol{R}\\), representing a property that is\nalways definite-valued a priori.\nFrom this perspective, Bub (1992, 1994, 1997) drew the conclusion that\nwith hindsight a number of traditional interpretations of quantum\ntheory might be viewed as modal interpretations. Among them are (what\nBub took to be) the Dirac-von Neumann interpretation and Bohr’s\ninterpretation; and, as a more clear-cut case, Bohm’s theory.\nIndeed, this theory (Bohm 1952) is a modal non-collapse interpretation\nwith position as the privileged observable\n\\(\\boldsymbol{R}\\). A more recent proposal for a modal scheme using a\nprivileged observable is the Modal-Hamiltonian interpretation (see\nSection 8).\n3. Relation to other non-collapse interpretations\n\nThe proposal to do without the projection postulate was also made by\nothers, before van Fraassen published his work. In particular,\nBohm’s hidden-variables theory (itself preceded by de\nBroglie’s proposals from the 1920s) and Everett’s (1957)\nrelative-state scheme (elaborated by De Witt (1970) into the\nmany-worlds interpretation) followed this path. According to\nBohm’s theory, physical systems are built up from particles that\nalways possess definite positions, while the wave function specifies\nthe probabilities associated with the various possible values these\npositions may have. There are no collapses in Bohm’s theory: the\nwave function evolves unitarily at all times. Therefore, the theory\nqualifies as a modal interpretation of quantum mechanics: the state\ndetermines a range of possible particle configurations and specifies\nthe probabilities for these possibilities to be actually realized.\n\nEverett (1957) also eliminated collapses, so that after a measurement\nobject system and measuring device (or observer) end up in an\nentangled superposition. To reconcile this description with the\nuniqueness of our experience, Everett introduced the notion of\nrelative state: individual terms of the superposition\nrepresent different definite measurement results, and relative\nto the corresponding device states the object systems possess\ndefinite properties as well. This interpretative move was worked out\nby DeWitt and others into the idea that all measurement\nresults represented in the post-measurement superposition are\nrealized: in a measurement worlds are multiplied, and in each world a\ndifferent measurement outcome becomes determinate.\n\nAs a matter of historical fact, it is unclear whether this idea of\nmany co-existing worlds accords with Everett’s own view: Everett\nstated that the wave function serves the purpose of providing us with\na set of factual and counterfactual descriptions of the world we live\nin, and this suggests that he rather saw his relative-state\ninterpretation as a theory about one single world. This would make\nEverett’s interpretation a modal interpretation (see for\nextensive discussion Dieks 2021).\n\nHowever this may be, the feature that distinguishes modal\ninterpretations from other non-collapse interpretations is that modal\ninterpretations pertain to one single world, about which they make\n“modal statements”, i.e. statements concerning\npossibilities and their probabilities.\n4. Biorthogonal-decomposition and spectral-decomposition modal interpretations\n\nWe now turn to those modal interpretations in which the set of\nphysical possibilities is determined by the (dynamical) quantum state\nof a system (see the penultimate paragraph of Section 2).\n\nIn the biorthogonal-decomposition interpretation (BDMI, sometimes\nknown as “Kochen-Dieks modal interpretation”, Kochen 1985,\nDieks 1988, 1989), the definite-valued observables are\npicked out by the biorthogonal (Schmidt) decomposition of the\nstate.\n\nBiorthogonal Decomposition Theorem:\n\nGiven a vector \\(\\ket{\\psi}\\) in a tensor-product Hilbert space\n\\(\\mathcal{H}^1 \\otimes \\mathcal{H}^2\\), there exist bases\n\\(\\{\\ket{a_i}\\}\\) and \\(\\{\\ket{p_i}\\}\\) for \\(\\mathcal{H}^1\\) and\n\\(\\mathcal{H}^2\\) respectively, such that \\(\\ket{\\psi}\\) can be\nwritten as a linear combination of terms of the form \\(\\ket{a_i}\n\\otimes \\ket{p_i}\\). If the absolute values (modulus) of the\ncoefficients in this linear combination are all unequal, then the\nbases are unique (see, for example, Schrödinger 1935 for a\nproof). \n\nApplied to quantum mechanics the theorem says that, given a composite\nsystem consisting of two subsystems, its state picks out (in many\ncases, uniquely) a basis for each of the subsystems. In BDMI, those\nbases are taken to generate the definite-valued properties of the\ncorresponding subsystems: the definite-valued observables are those\nthat commute with all the projections on these basis vectors.\n\nBDMI can be applied directly to the quantum measurement problem. Let\nus consider an ideal measurement according to the standard von Neumann\nmodel, in which a quantum measurement is an interaction between a\nsystem \\(S\\) and a measuring apparatus \\(M\\). Before the interaction,\n\\(M\\) is prepared in a ready-to-measure state \\(\\ket{p_0}\\),\neigenvector of the pointer observable \\(P\\) of \\(M\\), and the state of\n\\(S\\) is a superposition of the eigenstates \\(\\ket{a_i}\\) of an\nobservable \\(A\\) of \\(S\\). The interaction introduces a correlation\nbetween the eigenstates \\(\\ket{a_i}\\) of \\(A\\) and the eigenstates\n\\(\\ket{p_i}\\) of \\(P\\): \n\n\\[\n\\ket{\\psi_0} = \\sum_{i} c_i \\ket{a_i} \\otimes \\ket{p_0} \\rightarrow \n\\ket{\\psi} = \\sum_i c_i \\ket{a_i} \\otimes \\ket{p_i}\n\\]\n\n\nIn this case, according to the BDMI actualization rule, the preferred\ncontext of the measured object system \\(S\\) is defined by the set\n\\(\\{\\ket{a_i}\\}\\) and the preferred context of the measuring apparatus\n\\(M\\) is defined by the set \\(\\{\\ket{p_i}\\}\\). Therefore, the pointer\nposition is a definite-valued property of the apparatus: as a result\nof the interaction with the object system the pointer acquires one of\nits possible values (eigenvalues) \\(p_i\\). Likewise, after the\ninteraction the measured observable is a definite-valued property of\nthe object system, and acquires one of its possible values\n(eigenvalues) \\(a_i\\).\n\nIn spite of the fact that this modal interpretation is characterized\nby the central role played by biorthogonal decomposition, two\ndifferent versions can be distinguished. One of them adopts a\nmetaphysics in which all properties are relational and, as a\nconsequence, the fact that the application of the interpretation is\nrestricted to subsystems of a two-component compound system is not a\nproblem (Kochen 1985). This relation has been called\n“witnessing”: properties are not possessed by the system\nabsolutely, but only when it is “witnessed” by another\nsystem. Consider the measurement described above: the pointer\n“witnesses” the value acquired by the measured observable\nof the measured system.\n\nBy contrast, according to the other version the\nproperties ascribed to the system do not have a relational character.\nThis proposal therefore faces consistency questions about the\nassignments of definite values to observables according to different\nways of splitting up the total system into components. Consider, for\nexample, the three-component composite system \\(\\alpha \\beta \\chi\\).\nWe could apply the biorthogonal decomposition theorem to the\ntwo-component system (i) \\(\\alpha(\\beta \\chi)\\), or (ii) \\(\\beta(\\chi\n\\alpha)\\) or (iii) \\(\\chi(\\alpha \\beta)\\). Suppose that, as a result\nof this, in case (i) the system \\(\\alpha\\) has the definite-valued\nproperty \\(P\\), in case (ii) the system \\(\\beta\\) has the\ndefinite-valued property \\(Q\\), and in case (iii) the system \\(\\alpha\n\\beta\\) has the definite-valued property \\(R\\). How do the\ndefinite-valued properties of \\(\\alpha\\) and \\(\\beta\\) relate to those\nof \\(\\alpha \\beta\\)? Are the definite-values properties of system\n\\(\\alpha \\beta\\) \\(P \\amp Q\\), or \\(R\\), or both?\n\nA generalization is the spectral-decomposition modal interpretation\n(SDMI, Vermaas and Dieks 1995). SDMI is based on the spectral\ndecomposition of the reduced density operator: the definite-valued\nproperties \\(\\Pi_i\\) of a system and their corresponding probabilities\n\\(\\mathrm{Pr}_i\\) are given by the non-zero diagonal elements of the\nspectral decomposition of the system’s state, \n\n\\[\n \\varrho = \\sum_{i} \\alpha_i\\Pi_i\n\\qquad \n \\mathrm{Pr}_i = \\mathrm{Tr}(\\varrho \\Pi_i)\n\\]\n\n\nThis new proposal matches the old one in cases where the old one\napplies, and generalizes it by fixing the definite-valued properties\nin terms of multi-dimensional projectors when the biorthogonal\ndecomposition is degenerate: definite-valued properties need not\nalways be represented by one-dimensional\nvectors—higher-dimensional subspaces of the Hilbert space can\nalso occur.\n\nThe SDMI also has a direct application to the measurement situation.\nConsider quantum measurement as described above, where the reduced\nstates of the measured system \\(S\\) and the measuring apparatus \\(M\\)\nare \n\n\\[\\begin{align*}\n\\varrho_r^S &= \\mathrm{Tr}_{(M)} \\ket{\\psi} \\bra{\\psi} \n = \\sum_i \\norm{c_i}^2 \\ket{a_i} \\bra{a_i} \n = \\sum_i \\norm{c_i}^2 \\Pi_i^a \\\\\n\\varrho_r^M &= \\mathrm{Tr}_{(S)}\\ket{\\psi}\\bra{\\psi} \n = \\sum_i \\norm{c_i}^2 \\ket{p_i} \\bra{p_i} \n = \\sum_i \\norm{c_i}^2 \\Pi_i^p\n\\end{align*}\\]\n\n\nAccording to SDMI, the preferred context of \\(S\\) is defined by the\nprojectors \\(\\Pi_i^a\\) and the preferred context of \\(M\\) is defined\nby the projectors \\(\\Pi_i^p\\). Therefore, also in SDMI, the\nobservables \\(A\\) of \\(S\\) and \\(P\\) of \\(M\\) acquire actual definite\nvalues, whose probabilities are given by the diagonal elements of the\ndiagonalized reduced states.\n\nHealey (1989), who was among the first to make use of the biorthogonal\ndecomposition theorem for interpretational purposes, has proposed a\nsomewhat different modal scheme. After using the biorthogonal\ndecomposition theorem, Healey modifies the set of possible properties\nin order to fulfill a variety of additional desiderata, e.g.\npertaining to the relationship between composite systems and their\nsubsystems. The structure of definite-valued properties that emerges\nfrom these conditions is rather complicated. Some progress has been\nmade since Healey’s book was published (see Reeder and Clifton\n1995) but, in general, it remains difficult to see what the set of\ndefinite-valued properties is according to this approach.\n5. Property composition and atomic modal interpretation\n\nThe modal property attributions as reviewed above raise consistency\nquestions when a system can be split up into components in different\nways. Consider, for example, the three-component composite system\n\\(\\alpha \\beta \\chi\\). We could apply the biorthogonal decomposition\ntheorem to the two-component system (i) \\(\\alpha(\\beta \\chi)\\), or\n(ii) \\(\\beta(\\chi \\alpha)\\), or (iii) \\(\\chi(\\alpha \\beta)\\). Suppose\nthat, as a result of this, in case (i) the system \\(\\alpha\\) has the\ndefinite-valued property \\(P\\), in case (ii) the system \\(\\beta\\) has\nthe definite-valued property \\(Q\\), and in case (iii) the system\n\\(\\alpha \\beta\\) has the definite-valued property \\(R\\). How do the\ndefinite-valued properties of \\(\\alpha\\) and \\(\\beta\\) relate to those\nof \\(\\alpha \\beta\\)? Are the definite-values properties of system\n\\(\\alpha \\beta\\) \\(P \\amp Q\\), or \\(R\\), or both? This problem was\naddressed by different authors during the 1990s (see Vermaas 1999,\nBacciagaluppi 1996).\n\nElaborating on this, let us take a composite system \\(\\alpha \\beta\\),\nwhose component subsystems \\(\\alpha\\) and \\(\\beta\\) are represented by\nthe Hilbert spaces \\(\\mathcal{H}^{\\alpha}\\) and\n\\(\\mathcal{H}^{\\beta}\\), respectively, and consider a property\nrepresented by the projector \\(\\Pi^{\\alpha}\\) defined on\n\\(\\mathcal{H}^{\\alpha}\\). It is usual to assume that \\(\\Pi^{\\alpha}\\)\nrepresents the same property as that represented by \\(\\Pi^{\\alpha}\n\\otimes I^{\\beta}\\) defined on \\(\\mathcal{H}^{\\alpha} \\otimes\n\\mathcal{H}^{\\beta}\\), where \\(I^{\\beta}\\) is the identity operator on\n\\(\\mathcal{H}^{\\beta}\\). This assumption is based on the observational\nindistinguishability of the magnitudes represented by \\(\\Pi^{\\alpha}\\)\nand \\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\): if the\n\\(\\Pi^{\\alpha}\\)-measurement has a certain outcome, then the\n\\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\)-measurement has exactly the same\noutcome.\n\nThe question now arises whether the rules of BDMI and SDMI, applied to\n\\(\\alpha\\), assign a value to \\(\\Pi^{\\alpha}\\) that is the same as the\nvalue assigned to \\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\) when the rules\nare applied to the composite system \\(\\alpha \\beta\\) (a condition\nknown as Property Composition), and vice versa (Property\nDecomposition). The answer to this question is negative: BDMI and SDMI\nviolate Property Composition and Property Decomposition (for a proof,\nsee Vermaas 1998).\n\nIf one maintains that the projectors \\(\\Pi^{\\alpha}\\) and\n\\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\) must represent the same property,\nthe violation of Property Composition and Property Decomposition is a\nserious problem. Thus, Arntzenius (1990) finds the violation of\nProperty Composition bizarre, since different truth values are\nassigned to propositions like ‘the left-hand side of a table is\ngreen’ and ‘the table has a green left-hand side’; a\nsimilar argument is put forward by Clifton (1996, see also Clifton\n1995c).\n\nHowever, Vermaas (1998) argues that the observational\nindistinguishability of the magnitudes represented by \\(\\Pi^{\\alpha}\\)\nand \\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\) does not force one to consider\nthese two projectors as representing the same property: in fact, they\nare different from a theoretical viewpoint, since they are defined on\ndifferent Hilbert spaces. Moreover, he argues that the examples\ndeveloped by Arntzenius and Clifton sound bizarre precisely in the\nlight of Property Composition and Property Decomposition. But in the\nquantum realm we must accept that the questions of which properties\nare possessed by a system and which by its subsystems are different\nquestions: the properties of a composite system \\(\\alpha\\beta\\)\ndon’t always fix the properties of subsystem \\(\\alpha\\), and\nvice versa. Vermaas concludes that the tenet that \\(\\Pi^{\\alpha}\\) and\n\\(\\Pi^{\\alpha} \\otimes I^{\\beta}\\) do represent the same property can\nbe viewed as an addition to quantum mechanics, which can be denied as,\nfor instance, van Fraassen (1991) did.\n\nA similar problem is due to the fact that the factorization of Hilbert\nspaces is not unique: any given factorization \\(\\mathcal{H} =\n\\mathcal{H}^1 \\otimes \\mathcal{H}^2\\) can be “rotated” to\nproduce different factorizations \\(\\mathcal{H}' =\n\\mathcal{H}^1{}^\\prime \\otimes \\mathcal{H}^2{}^\\prime\\). Are we to\napply the same rules to each such factorization? How are the results\nrelated, if at all? A theorem due to Bacciagaluppi (1995, see also\nVermaas 1997) shows that if one applies SDMI to every factorization\nand insists that the values of observables that occur in the different\nfactorizations are factorization-independent, then one will end up\nwith a mathematical contradiction of the Kochen-Specker type.\n\nOne possible reaction to these difficulties is to assume that there is\na preferred factorization. (One may also regard the above problems as\nan indication that systems possess their properties in a relational\nway, see Section 5). The Atomic Modal Interpretation (AMI,\nBacciagaluppi and Dickson 1999) thus assumes that nature fixes a set\nof mutually disjoint atomic quantum systems \\(S^j\\) that constitute\nthe building blocks of all other quantum systems. From the\nmathematical point of view, this means that the Hilbert space\n\\(\\mathcal{H}^{\\univ}\\) of the entire universe can only be\nmeaningfully factorized in a single way, which defines a preferred\nfactorization. If each atomic quantum system \\(S^j\\) corresponds to a\nHilbert space \\(\\mathcal{H}^j\\), then the Hilbert space\n\\(\\mathcal{H}^{\\univ}\\) of the universe must be written as\n\n\\[\n\\mathcal{H}^{\\univ} = \\mathcal{H}^1 \\otimes \\mathcal{H}^2 \\otimes \\cdots \\otimes \\mathcal{H}^j \\otimes \\cdots\n\\]\n\n\nThe appeal of this idea is that it is in consonance with the standard\nmodel of particle physics, where the fundamental blocks of nature are\nthe elemental particles, e.g., quarks, electrons, photons, etc., and\ntheir interactions. Moreover, the problems mentioned above can be\nevaded in AMI: once the atomic building blocks have been assigned\ndefinite properties, one may stipulate that composite systems have\nproperties that follow from property composition. Some of these ideas\nare implemented in the Modal-Hamiltonian Interpretation, to be\ndiscussed in Section 8. The property ascription to the atomic quantum\nsystems in the AMI further follows the general idea of modal\ninterpretations, that is, the ascription depends via a fixed rule on\nthe dynamical state of the system.\n\nThe main challenge for AMI is to justify the assumption that there is\na preferred partition of the universe and to provide some idea about\nwhat this factorization should look like. AMI also faces another\nproblem. A non-atomic quantum system \\(S^{\\sigma}\\), defined as\ncomposite of atomic quantum systems, does not necessarily have\nproperties that correspond to the outcomes of measurements. The reason\nis that the system \\(S^{\\sigma}\\) might be in the quantum state\n\\(\\varrho^{\\sigma}\\) with an eigenprojector \\(\\Pi^{\\sigma}\\) such that\n\\(\\mathrm{Tr}^{\\sigma}(\\varrho^{\\sigma}\\Pi^{\\sigma}) = 1\\). This\nimplies that if one measured the property represented by\n\\(\\Pi^{\\sigma}\\), one would obtain a positive outcome with probability\n1. But it may be the case that the projector \\(\\Pi^{\\sigma}\\) is not a\ncomposite of atomic properties and, therefore, according to AMI, it is\nnot a property possessed by the composite quantum system\n\\(S^{\\sigma}\\). \n\nTwo answers to this difficulty have been proposed. The first allows\nthe existence of dispositional properties in addition to ordinary\nproperties (Clifton 1996). According to the second answer, the outcome\n1 of the projector \\(\\Pi^{\\sigma}\\) is a collective dynamical effect\nonto the measurement device (Dieks 1998): the composite quantum system\nmay behave as a collective entity, screening off the atomic quantum\nsystems. This implies that a non-atomic quantum system \\(S^{\\sigma}\\)\nmay sometimes be taken as if it were atomic within a coarse-grained\ndescription.\n6. Dynamics of properties\n\nAs we have seen, modal interpretations intend to provide, for every\ninstant, a set of definite-valued properties and their probabilities.\nSome advocates of modal interpretations are willing to leave the\nmatter at that. Others take it to be crucial that also questions of\nthe following form are answered: given that the property \\(P\\) of a\nsystem has the actual value \\(\\alpha\\) at time \\(t_0\\), what is the\nprobability that its property \\(P'\\) has the actual value \\(\\beta\\) at\ntime \\(t_1 \\gt t_0\\)? In other words, they want a dynamics of\nactual properties.\n\nThere are arguments on both sides (van Fraassen 1997). Those who argue for the necessity\nof such a dynamics maintain that we have to assure that the\ntrajectories of actual properties really are, at\nleast for macroscopic objects, like we see them to be, i.e., like the\nrecords contained in memories. For example, we should require not only\nthat the book at rest on the desk possesses a definite location, but\nalso that, if undisturbed, its location relative to the desk does not\nchange in time. Accordingly, one cannot get away with simply\nspecifying possible definite properties at each instant of time. We\nneed also to show that this specification is at least compatible with\na reasonable dynamics; better still, to specify this dynamics\nexplicitly.\n\nThose who consider a dynamics of actual properties to be superfluous\nreply that such a dynamics is more than what an interpretation of\nquantum mechanics needs to provide. Memory contents for each instant\nare enough to make empirical adequacy possible.\n\nRuetsche (2003) argues that it is important in this connection whether\nthe modal interpretation is viewed as leading to a\nhidden-variables theory, in which value states are added as\nhidden variables to the original formalism in order to obtain a full\ndescription of the physical situation, or rather as an interpretive\nmove that equips the original formalism with a new semantics (see also\nSection 11). In the first case one would expect a full dynamics of\nactual properties, in the second this is not so clear.\n\nOf course, modal interpretations admit a trivial dynamics, namely, one\nin which there is no correlation from one time to the next. In this\ncase, the probability of the transition from the property \\(P\\) having\nthe actual value \\(\\alpha\\) at \\(t_0\\) to the property \\(P'\\) having\nthe actual value \\(\\beta\\) at \\(t_1 \\gt t_0\\) is just the single-time\nprobability for \\(P'\\) having \\(\\beta\\) at \\(t_1\\). However, this\ndynamics is unlikely to interest those who feel the need for a\ndynamics at all. Several researchers have contributed to the project\nof constructing a more interesting form of dynamics for modal\ninterpretations (see Vermaas 1996, 1998). An important account is due\nto Bacciagaluppi and Dickson (1999, see also Bacciagaluppi 1998). That\nwork shows the most significant challenges that the construction of a\ndynamics of actual properties must face.\n\nThe first challenge is posed by the fact that the set of\ndefinite-valued properties—let us call it\n‘\\(S\\)’—may change over time. One therefore has to\ndefine a family of maps, each one being a 1–1 map from \\(S_0\\)\nat time \\(t_0\\) to a different \\(S_t\\) at time \\(t\\), for any time.\nWith such a family of maps, one can effectively define conditional\nprobabilities within a single state space, and then translate them\ninto “transition” probabilities. For this technique to\nwork, \\(S_t\\) must have the same cardinality at any time. However, in\ngeneral this is not the case: for instance, in SDMI, the number of\ndifferent projectors appearing in the spectral decomposition of the\ndensity matrix may vary with time.\n\nA way out of this is to augment \\(S\\) at each time so that its\ncardinality matches the highest cardinality that \\(S\\) ever achieves.\nOf course, one hopes to do so in a way that is not completely ad hoc.\nFor example, in the context of SDMI, Bacciagaluppi, Donald and Vermaas\n(1995) show that the “trajectory” through Hilbert space of\nthe spectral components of the reduced state of a physical system\nwill, under reasonable conditions, be continuous, or have only\nisolated discontinuities, so that the trajectory can be naturally\nextended to a continuous trajectory (see also Donald 1998). This\nresult suggests a natural family of maps as discussed above, which map\neach spectral component at one time to its unique continuous evolved\ncomponent at later times.\n\nThe second challenge to the construction of a dynamics arises from the\nfact that one wants to define transition probabilities over\ninfinitesimal units of time, and then derive the finite-time\ntransition probabilities from them. Bacciagaluppi and Dickson (1999)\nargue that, adapting results from the theory of stochastic processes,\none can show that the procedure may be carried out for modal\ninterpretations of at least some varieties.\n\nFinally, one must define infinitesimal transition probabilities that\nwill give rise to the proper quantum-mechanical probabilities at each\ntime. Following earlier papers by Bell (1984), Vink (1993), and\nothers, Bacciagaluppi and Dickson (1999) define an infinite class of\nsuch infinitesimal transition probabilities, such that all of them\ngenerate the correct single-time probabilities, which arguably are all\nwe can really test. However, Sudbery (2002) has contended that the\nform of the transition probabilities would be relevant to the\nprecise form of spontaneous decay or the “Dehmelt quantum\njumps”; he independently develops the dynamics of Bacciagaluppi\nand Dickson and applies it in such a way that it leads to the correct\npredictions for these experiments. Gambetta and Wiseman (2003, 2004)\nhave developed a dynamical modal account in the form of a\nnon-Markovian process with noise, also extending their approach to\npositive operator-valued measures (POVMs). More recently, Hollowood\n(2013a, 2013b, 2014) has elaborated the idea that the dynamics of\nvalue states can be modeled by a discrete-time Markov chain.\n7. Perspectival modal interpretation\n\nIn Section 5 it was discussed how the attribution of physical\nproperties to systems in an absolute (monadic) sense leads to\nconsistency questions. Such questions may be avoided if one adopts a\nmetaphysics in which properties are relational. In fact, it\ncan be argued that the mathematical structure of non-collapse quantum\nmechanics strongly suggests a relational picture anyhow, as evidenced,\nfor example, by Everett’s (1957) reasons for introducing his\nrelative states (these reasons relate to the non-collapse\ntreatment of Wigner’s friend paradox, see also Dieks 2019,\n2021).\n\nAn early relational modal interpretation was proposed by Kochen\n(1985). According to Kochen, in a bi-partite system one system possess\nproperties “as witnessed” by the other system.\n\nBene and Dieks (2002) have developed a more general perspectival modal\ninterpretation (PMI), in which the properties of any physical system\nare defined with respect to arbitrary other physical systems that\nserve as “reference systems” (Bene 1997). PMI is closely\nrelated to SDMI since similar rules are used to assign properties to\nquantum systems.\n\nIn more detail, the state of \\(S\\) with respect to the reference\nsystem \\(R\\) is denoted by \\(\\varrho_{R}^{S}\\). In the special case in\nwhich \\(R\\) coincides with \\(S\\), the state \\(\\varrho_{S}^{S}\\) is\ncalled “the state of S with respect to itself”.\nIf the system \\(S\\) is contained in a system \\(A\\), the state\n\\(\\varrho_{A}^{S}\\) is defined as the density operator that can be\nderived from \\(\\varrho_{A}^{A}\\) by taking the partial trace over the\ndegrees of freedom in \\(A\\) that do not pertain to \\(S\\):\n\n\\[\n\\varrho_{A}^{S} = \\mathrm{Tr}_{(A\\setminus S)} \\varrho_{A}^{A}\n\\]\n\n\nPMI starts with the dynamical state of the whole universe with respect\nto itself, which it is assumed to be a pure state \\(\\varrho_{U}^{U} =\n\\ket{\\psi} \\bra{\\psi}\\), evolving unitarily according to the\nSchrödinger equation. For any system \\(S\\) contained in the\nuniverse, its value state with respect to itself \\(\\varrho_{S}^{S}\\)\nis postulated to be one of the projectors of the spectral resolution\nof \\(\\varrho_{U}^{S} = \\mathrm{Tr}_{(U\\setminus S)} \\varrho_{U}^{U} =\n\\mathrm{Tr}_{(U\\setminus S)} \\ket{\\psi} \\bra{\\psi}\\). In particular,\nif there is no degeneracy among the eigenvalues of\n\\(\\varrho_{U}^{S}\\), \\(\\varrho_{S}^{S}\\) is the one-dimensional\nprojector \\(\\ket{\\psi_{S}} \\bra{\\psi_{S}}\\).\n\nWithin PMI it may happen that a system is localized from the\nperspective of one observer and, nevertheless, is delocalized from a\ndifferent perspective. However, when different observers look at the\nsame macroscopic object, this effect will be suppressed due to\ndecoherence effects.\n\nThe “metaphysical” idea behind this perspectival\ninterpretation is that different relational descriptions, given from\ndifferent perspectives, are to be considered as equally objective;\nphysical reality has a relational character and perspectival states\ncannot be reduced to more fundamental non-relational states.\n\nIn this relational/perspectival interpretation the course of events in\nexperiments of the EPR-type may be described in a local manner.\nIndeed, the change in the relational state of particle 2 with respect\nto particle 1 can be understood as a consequence of the change in the\nreference system brought about by the local measurement interaction\nbetween particle 1 and the measuring device. This local measurement is\nresponsible for the creation of a new perspective, and from this new\nperspective there is a new relational state of particle 2 (Dieks 2009, 2019).\n\nPMI agrees with Bohr’s statement that the definition of physical\nreality in the quantum realm should include the experimental context\n(see Dieks 2017 for a detailed discussion of Bohr’s views and a\ncomparison with the modal approach). However, PMI is more general and\ntechnically precise: PMI defines the state of a system with respect to\narbitrary contexts, not necessarily related to measurements. This\nremoves the threat of subjectivism, as the relational states follow\nunambiguously from the quantum formalism and the physics of the\nsituation.\n\nBerkovitz and Hemmo (2006) suggest that a relational approach is\nneeded to generalize modal interpretations to the relativistic case.\nDieks (2021) provides a detailed scheme with the help of which PMI can\nbe made relativistically covariant (borrowing ideas from the\nmany-worlds interpretation).\n\nRovelli and coworkers have also proposed a relational interpretation\nof quantum mechanics in which there is the possibility of different\nperspective-dependent descriptions of a physical system (Rovelli 1996,\nRovelli and Smerlak 2007, Laudisa and Rovelli 2021, see also van\nFraassen 2010 and the entry\n relational quantum mechanics.)\n There are points of contact between PMI and Rovelli’s\nrelational interpretation, but also differences. In Rovelli’s\nproposal, discrete interaction events (some of which correspond to\nmeasurements) are fundamental and the state has to be updated every\ntime such an interaction event occurs. By contrast, in PMI the state\nevolution is always unitary.\n8. Modal-Hamiltonian interpretation\n\nAs Bub (1997) points out (see Section 2), in most modal\ninterpretations the preferred context of definite-valued observables\nis determined solely by the dynamical state of the system; but one\ncould also introduce a preferred definite-valued observable. An\nexample is Bohmian mechanics, in which the preferred context is a\npriori defined by the position observable; in this case, property\ncomposition and property decomposition hold. But this is not the only\nreasonable possibility for a modal interpretation with a fixed\npreferred observable. In fact, the modal-Hamiltonian interpretation\n(MHI, Lombardi and Castagnino 2008) endows the Hamiltonian of a system\nwith a determining role, both in the definition of systems and\nsubsystems and in the selection of the preferred context.\n\nThe MHI is based on the following postulates:\n\nSystems postulate (SP):\n\nA quantum system \\(S\\) is represented by a pair \\((\\mathcal{O}, H)\\)\nsuch that (i) \\(\\mathcal{O}\\) is a space of self-adjoint operators on\na Hilbert space, representing the observables of the system, (ii) \\(H\n\\in \\mathcal{O}\\) is the time-independent Hamiltonian of the system\n\\(S\\), and (iii) if \\(\\varrho_0 \\in \\mathcal{O}'\\) (where\n\\(\\mathcal{O}'\\) is the dual space of \\(\\mathcal{O})\\) is the initial\nstate of \\(S\\), it evolves according to the Schrödinger\nequation.\n\nAlthough any quantum system can be decomposed in parts in many ways,\naccording to MHI a decomposition leads to parts which are also quantum\nsystems only when the components’ behaviors are dynamically\nindependent of each other, that is, when there is no interaction among\nthe subsystems:\n\nComposite systems postulate (CSP):\n\nA quantum system represented by \\(S: (\\mathcal{O}, H)\\), with initial\nstate \\(\\varrho_0 \\in \\mathcal{O}'\\), is composite when it\ncan be partitioned into two quantum systems \\(S^1 : (\\mathcal{O}^1,\nH^1)\\) and \\(S^2 : (\\mathcal{O}^2, H^2)\\) such that (i) \\(\\mathcal{O}\n= \\mathcal{O}^1 \\otimes \\mathcal{O}^2\\), and (ii) \\(H = H^1 \\otimes\nI^2 + I^1 \\otimes H^2\\) (where \\(I^1\\) and \\(I^2\\) are the identity\noperators in the corresponding tensor product spaces). In this case,\nwe say that \\(S^1\\) and \\(S^2\\) are subsystems of the\ncomposite system \\(S = S^1 \\cup S^2\\). If the system is not composite,\nit is elemental. \n\nWith respect to the preferred context, the basic idea of MHI is that\nthe Hamiltonian of the system defines actualization. Any observable\nthat does not have the symmetries of the Hamiltonian cannot acquire a\ndefinite actual value, since this actualization would break the\nsymmetry of the system in an arbitrary way.\n\nActualization rule (AR):\n\nGiven an elemental quantum system represented by \\(S: (\\mathcal{O},\nH)\\), the actual-valued observables of \\(S\\) are \\(H\\) and all the\nobservables commuting with \\(H\\) and having, at least, the same\nsymmetries as \\(H\\).\n\nThe selection of the preferred context exclusively on the basis of a\npreferred observable has been criticized by arguing that in the\nHilbert space formalism all observables are on an equal footing.\nHowever, quantum mechanics is not just Hilbert space mathematics: it\nis a physical theory that includes a dynamical law in which the\nHamiltonian is singled out to play a central role.\n The justification for selecting the Hamiltonian as the preferred\nobservable ultimately lies in the success of MHI and its ability to\nsolve interpretive difficulties (see Lombardi and Castagnino 2008,\nSections 5 and 6). With respect to the first point: the scheme has\nbeen applied to several well-known physical situations (free particle\nwith spin, harmonic oscillator, free hydrogen atom, Zeeman effect,\nfine structure, the Born-Oppenheimer approximation), leading to\nresults consistent with empirical evidence. With respect to\ninterpretation, MHI confronts quantum contextuality by selecting a\npreferred context, and has proved to be able to supply an account of\nthe measurement problem, both in its ideal and its non-ideal versions;\nmoreover, in the non-ideal case it gives a criterion to distinguish\nbetween reliable and non-reliable measurements, a criterion that can\nbe generalized when expressed in informational terms (Lombardi,\nFortin, and López 2015).\n\nIn MHI property composition and property decomposition hold because\nthe actualization rule only applies to elemental systems: the\ndefinite-valued properties of composite systems are selected on the\nbasis of those of the elemental components and following the usual\nquantum assumption according to which the observable \\(A^1\\) of a\nsubsystem \\(S^1\\) and the observable \\(A = A^1 \\otimes I^2\\) of the\ncomposite system \\(S = S^1 S^2\\) represent the same property (Ardenghi\nand Lombardi 2011).\n\nThe preferred context of MHI does not change with time: the\ndefinite-valued observables always commute with the Hamiltonian and,\ntherefore, they are constants of motion of the system. This means that\nthey are the same during the whole “life” of the quantum\nsystem as a closed system, since its initial “birth”, when\nit arises as a result of an interaction, up to its final\n“death”, when it disappears by interacting with another\nsystem. As a consequence, there is no need of accounting for the\ndynamics of the actual properties as in BDMI and SDMI.\n\nIn more recent years, MHI has extended its applications to further\nsituations, such as the non-collapse account of consecutive\nmeasurements in physics (Ardenghi, Lombardi, and Narvaja 2013) and the\nproblem of optical isomerism in chemistry (Fortin, Lombardi, and\nMartínez González 2018).\n9. Non-ideal measurements\n\nAbove we suggested that BDMI and SDMI immediately solve the\nmeasurement problem. This is right in the case of ideal von Neumann\nmeasurements, in which the eigenstates \\(\\ket{a_i}\\) of the measured\nobservable \\(A\\) of the object system \\(S\\) become perfectly\ncorrelated with the eigenstates \\(\\ket{p_i}\\) of the pointer \\(P\\) of\nthe measuring apparatus \\(M\\). However, ideal measurements can never\nbe achieved in practice: the interaction between \\(S\\) and \\(M\\) never\nproduces a completely perfect correlation between \\(A\\) and \\(P\\). Two\nkinds of non-ideal measurements are usually distinguished in the\nliterature:\n\n Imperfect measurement (first kind)\n\n\\(\\sum_i c_i \\ket{a_i} \\otimes \\ket{p_0} \\rightarrow \\sum_{ij} d_{ij}\n\\ket{a_i} \\otimes \\ket{p_j}\\) (in general, \\(d_{ij} \\ne 0\\) with \\(i\n\\ne j)\\)\n Disturbing measurement (second kind)\n\n\\(\\sum_i c_i \\ket{a_i} \\otimes \\ket{p_0} \\rightarrow \\sum_i c_i\n\\ket{a_i^d} \\otimes \\ket{p_i}\\) (in general, \\(\\braket{a_i^d}{a_j^d}\n\\ne \\delta_{ij}\\)) \n\n\nNote, however, that disturbing measurement can be rewritten as\nimperfect measurements (and vice versa).\n\nImperfect measurements pose a challenge to BDMI and SDMI, since their\nrules for selecting the definite-valued properties in this case do not\npick out the right properties for the apparatus (see Albert and Loewer\n1990, 1991, 1993; also Ruetsche 1995). An example that clearly brings\nout the difficulties was formulated in the context of Stern-Gerlach\nexperiments (Elby 1993). This argument uses the fact that the\nwavefunctions in the \\(z\\)-variable typically have infinite\n“tails” that introduce non-zero cross-terms; therefore,\nthe “tail” of the wavefunction of the “down”\nbeam may produce detection in the upper detector, and vice versa (see\nDickson 1994 for a detailed discussion).\n\nIf the biorthogonal decomposition is applied to the non-perfectly\ncorrelated state \\(\\sum_{ij} d_{ij} \\ket{a_i} \\otimes \\ket{p_j} =\n\\sum_i c_i' \\ket{a_i'} \\otimes \\ket{p_i'}\\), according to BDMI the\nresult does not select the pointer \\(P\\) as a definite-valued\nproperty, but a different observable \\(P'\\) with eigenstates\n\\(\\ket{p_i'}\\). In this case, in which the selected definite-valued\nproperties are different from those expected, the question arises how\ndifferent they are. In the case of an imperfect measurement, it may be\nassumed that the \\(d_{ij} \\ne 0\\), with \\(i \\ne j\\), be small; then,\nthe difference might be also small. But in the case of a disturbing\nmeasurement, the \\(d_{ij} \\ne 0\\), with \\(i \\ne j\\), need not be small\nand, as a consequence, the disagreement between the modal\ninterpretation assignment and the experimental result might be\nunacceptable (see a full discussion in Bacciagaluppi and Hemmo 1996).\nThis fact has been considered as a “silver bullet” for\nkilling the modal interpretations of the BDMI and SDMI types (Harvey\nBrown, cited in Bacciagaluppi and Hemmo 1996). This is premature: a\nfuller analysis involving environmental decoherence is able to remove\nmany of these problems—see below.\n\nAnother problem for the BDMI and SDMI interpretations relates to\ndegeneracy. When the final state of the composite system (measured\nsystem plus measuring device) is very nearly degenerate when written\nin the basis given by the measured observable and the apparatus’\npointer (that is, when the probabilities for the various results are\nalmost equal), the spectral decomposition need not, in general, select\ndefinite-valued properties that are close to those ideally expected.\nIn fact, the observables so selected may be incompatible\n(non-commuting) with the observables that we expect on the basis of\nobservation (Bacciagaluppi and Hemmo 1994, 1996).\n\nIn order to solve these problems, several authors have appealed to the\nphenomenon of decoherence; this will now be discussed.\n10. The role of decoherence\n\nAccording to the environment-induced approach to decoherence (Zurek\n1981, 2003; see also Schlosshauer 2007), any macroscopic measuring\napparatus is an open system in continuous interaction with its\nenvironment; as a consequence of this interaction, the reduced state\nof the apparatus becomes, almost instantaneously, indistinguishable\nfrom a state that would represent an ignorance mixture (“proper\nmixture”) over unknown but definite positions of the\napparatus’ macroscopic pointer. The idea that decoherence might\nplay an important role in modal interpretations, by making macroscopic\nquantities definite, was suggested by several authors early on (Dieks\n1989, Healey 1995). Consideration of decoherence has acquired central\nrelevance in the discussion of non-ideal measurements.\n\nAs we have seen, in BDMI and SDMI, the biorthogonal and spectral\ndecompositions do generally not pick out the right properties for the\napparatus in non-ideal measurements. However, Bacciagaluppi and Hemmo\n(1996) show that, when the apparatus is a finite-dimensional system in\ninteraction with an environment containing a large number of degrees\nof freedom, decoherence guarantees that the spectral decomposition of\nthe reduced apparatus’ state will be very close to the ideally\nexpected result and, as a consequence, an observable very close to and\nindistinguishable from the apparatus pointer will be selected as\ndefinite-valued. Alternatively, Bub (1997) suggests that instead of\ndecoherence—with the “tracing out” of the\nenvironment and the diagonalization of the reduced state of the\napparatus—the triorthogonal or \\(n\\)-orthogonal decomposition\ntheorem involving the environment may be used to single out a unique\npointer basis for the apparatus.\n\nIn either case, interaction with the environment solves the problem of\nnon-ideal measurements in BDMI and SDMI for the case of\nfinite-dimensional macroscopic apparatuses. However, the case of\ninfinitely many distinct states for the apparatus is more\ntroublesome. Bacciagaluppi (2000) has analyzed this situation, using a\ncontinuous model of the apparatus’ interaction with the\nenvironment. He concludes that in this case the spectral decomposition\nof the reduced state of the apparatus generally does not pick out\nproperties that are close enough to empirically required ones. This\nresult seems to apply generally to cases where a macroscopic system\nwith infinitely many degrees of freedom experiences decoherence due to\ninteraction with its environment (see Donald 1998). However, model\ncalculations by Hollowood (2013, 2014) indicate that the problem may\nbe less severe in realistic circumstances than originally supposed,\nand the issue needs further investigation.\n\nModal interpretations with an a priori fixed preferred observable\n(MHI, and Bohm’s interpretation) are immune to the above\nobjections: decoherence by the environment need not be invoked in\norder to account for the definiteness of the apparatus’ pointer\nposition (neither in ideal nor in non-ideal measurements). However, in\nMHI there still is a relation with the decoherence program. In fact,\nthe measuring apparatus is always a macroscopic system with a huge\nnumber of degrees of freedom, and the pointer must therefore be a\n“collective” and empirically accessible observable; as a\nconsequence, the many degrees of freedom —and the corresponding\ndegeneracies— of the pointer play the role of a decohering\n“internal environment” (for details, see Lombardi et\nal. 2011). The role of decoherence in the MHI becomes clearer when the\nphenomenon of decoherence is understood from a closed-system\nperspective (Castagnino, Fortin, and Lombardi 2010). (See the entry on\nthe role of decoherence in quantum mechanics.)\n11. The measurement problem revisited: completeness and hidden variables\n\nThe measurement problem is usually given the form of the\nincompatibility of three assertions of the following form (cf. Maudlin\n1995, Myrvold 2018):\n\nThe quantum state is “complete”.\nThe quantum state always evolves in accordance with a linear\ndynamical equation (e.g., the Schrödinger equation).\nSuccessful measurements have unique and determinate outcomes.\n\n\nTo avoid inconsistency three interpretive strategies are standardly\nconsidered: denying completeness (a), which is often taken to lead to\nhidden-variable theories; denying (b), which results in theories\naccording to which collapses take place; or denying (c), which leads\nto many worlds.\n \nModal interpretations accept both (b) and (c), so that it follows\nthat they must violate (a). Thus, it seems clear that modal\ninterpretations have to view quantum mechanics as\n“incomplete”. Indeed, it is true that according to modal\ninterpretations the quantum state does not fix all actual physical\nproperties (i.e., the actual values of all definite-valued physical\nquantities) of a system, which is the criterion of incompleteness\npresupposed in (a).\n \nHowever, many proponents of modal schemes argue that the latter\nfeature is not appropriately expressed by saying that quantum\nmechanics, modally conceived, is incomplete. They object that this\nincompleteness terminology is apt to suggest a defect of the theory,\nand the need for completion (by hidden variables). But modal theorists\nmaintain that their interpretations of quantum mechanics are not in\nneed of additions, because these interpretations already contain\neverything that can reasonably be expected from theories describing a\nfundamentally probabilistic (indeterministic) world. First, modal\nschemes completely specify which observables are\ndefinite-valued. Second, they fix the possible values that may be\ntaken by these observables and they provide the probabilities with\nwhich these values may be realized. Since it is a core modal principle\nthat the actualization of properties in the quantum world is a\nfundamentally probabilistic (indeterministic) process, nothing more\nthan this probabilistic description is possible. From this viewpoint,\ninsisting that modally interpreted quantum mechanics is necessarily\nincomplete is tantamount to stipulating that any probabilistic theory\nmust be incomplete by definition—even if it applies to a\nfundamentally probabilistic world. But that appears an inappropriate\nuse of terminology.\n12. The interpretation of probability\n\nThe leading ideas of modal interpretations are thus\nindeterminism and probabilism: quantum mechanics\ndoes not describe actuality but provides us with a list of\npossibilities and their probabilities. This central position of the\nconcept of probability raises two issues: the formal treatment of\nprobabilities and the interpretation of probability.\n\nSince the set of all projector operators on a given Hilbert space does\nnot have a Boolean structure, the Born probability (which is defined\nover these projectors) does not satisfy the definition of probability\nof Kolmogorov (which applies to a Boolean algebra of events). For this\nreason, some authors define a generalized non-Kolmogorovian\nprobability function over the ortho-algebra of quantum events (Hughes\n1989, Cohen 1989). Modal interpretations do not follow this path: they\nconceive probabilities as represented by a Kolmogorovian measure on\nthe Boolean algebra representing the definite-valued quantities,\ngenerated by mutually commuting projectors. As we have seen, the\nvarious modal interpretations differ from each other in their\ndefinitions of the preferred context on which the Kolmogorovian\nprobability is defined.\n\nIn general, a context can be described as a complete set of orthogonal\nprojectors \\(\\{\\Pi_{\\alpha}\\}\\), such that \\(\\sum_{i} \\Pi_{i} = I\\)\nand \\(\\Pi_{i}\\Pi_j = \\delta_{ij}\\Pi_{i}\\), where \\(I\\) is the identity\noperator in \\(\\mathcal{H} \\otimes \\mathcal{H}\\). Each such context\ngenerates a Boolean structure, and the state of the system defines a\nKolmogorovian probability function on each individual\ncontext. However, only the probabilities defined on the preferred\ncontext selected by the modal interpretation at hand correspond to\nphysical possibilities, one of which is actual.\n\nSo we are dealing with possible events, among which only one is\nactual. The fact that the actual event is not singled out by modal\ninterpretations, as a point of principle, is what makes them\nfundamentally probabilistic. This aspect distinguishes modal\ninterpretations from many-worlds interpretations, where all events are\nactual and in which probability must consequently be a problematic\nnotion. Nevertheless, this modal unanimity about the fundamental role\nof probability does not mean that all modal interpretations agree\nabout the interpretation of probability.\n\nIn the context of BDMI, SDMI and PMI it is usually claimed that, given\nthe space of possible events, the state generates an\nignorance-interpretable probability measure over this set: quantum\nprobabilities quantify the ignorance of the observer about the actual\nvalues acquired by the system’s observables (see, e.g. Dieks\n1988, Clifton 1995a, Vermaas 1999, Bene and Dieks 2002).\n\nBy contrast to this “actualism”—the conception that\nreduces possibility to actuality (see Bueno\n2014)—some modal interpretations, in particular MHI, adopt a\npossibilist conception, according to which possible\nevents—possibilia—constitute a basic ontological\ncategory (see Menzel 2018). The probability measure is in this case\nseen as a representation of an ontological propensity of a possible\nquantum event to become actual (Suárez 2004; Terekhovich 2019 \n[Other Internet Resources]).\n\nIt is to be noted that the indeterminism of modal quantum mechanics\ndoes not imply that the present quantum state of a system fails to\ndetermine its future quantum states. The Schrödinger equation is\ndeterministic, and the probabilities encoded in the quantum state\ntherefore evolve in a deterministic way. Indeterminism comes in when\nwe consider the actual values of observables, which are not\npredetermined even if the quantum state is completely fixed: modal\ninterpretations take processes of actualization to be essentially\nprobabilistic.\n\nIn this context, the two mentioned views about probability (actualism\nversus possibilism) do not exclude each other. That probabilities\nquantify ignorance about actual values of observables (as in\nactualism) does not entail that this ignorance is due to a lack of\nknowledge about underlying deterministic processes. Possibilism adds\nthat quantum probabilities represent propensities and that our\nignorance is a necessary consequence of the indeterministic ontology\nof the physical world, in which propensities constitute a fundamental\ncategory.\n13. Open problems and perspectives\n\nMany quantum physicists implicitly subscribe to modal ideas in their\nwork, in the sense that they employ the formalism of unitary quantum\nmechanics in order to make probabilistic statements about one single\nworld (our own). This use of unitary quantum mechanics is especially\npopular in quantum information theory. There is also a growing\ninterest in questions concerning the conceptual consequences of a\nconsistent application of unitary (noncollapse) quantum mechanics to\nthe physical world (see, e.g., Frauchiger and Renner 2018 and ensuing\ndiscussions). These questions find their natural place within the\nmodal interpretation program.\n\nDuring the last decade, modal interpretations have also more\nexplicitly drawn the attention of practicing physicists and\nmathematicians interested in foundational matters. For instance,\nHollowood (2014) offers an interpretation of quantum mechanics\ninspired by PMI: in this account the state of an open system\nrepresents its properties as seen from the perspective of the closed\nsystem of which it is a subsystem. Barandes and Kagan (2014a, 2014b,\n2020) propose a “minimal modal interpretation”, inspired\nby SDMI, according to which the preferred context is given by the\nevolving reduced state of the open system. Nakayama (2014a, 2014b) has\nexplored connections between the modal interpretation and the\nframework of topos theory.\n\nThere are also several specifically philosophical issues connected to\nthe modal program: about the nature of the “things” to\nwhich quantum mechanics refers, that is, about the basic categories of\nthe quantum ontology. As we have seen, in general the properties of\nquantum systems are considered to be monadic in modal interpretations,\nwith the exception of the perspectival version PMI where these\nproperties are relational. In both cases, it may be asked whether a\nquantum system has to be conceived as an individual substratum\nsupporting properties or as a mere “bundle” of properties\nwhich do not need to constitute an individual in the ordinary sense.\nFollowing an original idea of the MHI, da\nCosta, Lombardi and Lastiri (2013) and da Costa and Lombardi (2014)\nhave suggested that, in the modal context, the bundle view is the most\nappropriate one to supply an answer to the problem of\nindistinguishability of identical quantum particles (French and Krause\n2006). As noticed by Steven French (2020 [Other Internet Resources]),\nthis view of non-individual bundles finds a natural resonance with\nontic structural realism, which was mainly motivated by the\nontological challenges of quantum mechanics (Ladyman 1998). Moreover,\nthis ontology of properties has been taken as a basis for a\nmetaphysical interpretation of relational quantum mechanics (Oldofredi\n2021). It should be noted that this bundle ontology does not\ncontradict the emergence of classical distinguishable particles in\ncertain situations, e.g. the classical limiting case (Lombardi and\nDieks 2016).\n\nAlso other ontological topics relating to modal interpretations have\nrecently become subjects of discussion. Thus, Calosi (2018) argues\nthat BDMI and AMI pose significant challenges to quantum monism, that\nis, the view according to which there is only one fundamental entity\n—the universe as a whole. In the context of the discussion about\nthe classification between \\({\\psi}\\)-ontic and \\({\\psi}\\)-epistemic\nmodels, Oldofredi and López (2020) show that such a classification is\ntoo narrow to include relational interpretations such as PMI.\n\nThere are also more technical issues that await further discussion.\nModal interpretations as discussed here are based on the standard\nHilbert space formalism of quantum mechanics. However, Brown,\nSuárez, and Bacciagaluppi (1998) argue that there is more to\nquantum reality than what is described by operators and quantum\nstates: they claim that gauges and coordinate systems are important to\nour description of physical reality as well, while modal\ninterpretations (AM, BDMI and SDMI) have standardly not taken such\nthings into consideration. In a similar vein, in the context of the\nMHI it has been argued that Galilean space-time symmetries endow the\nformal skeleton of quantum mechanics with physical flesh and blood and\nidentify the fundamental physical magnitudes that allow the theory to\nbe applied to concrete physical situations. If the set of\ndefinite-valued observables of a system is postulated to be invariant\nunder Galilean transformations (the intuition being that a mere change\nin inertial reference frame does not change this set), the MHI rule of\nactualization can be reformulated in an explicitly invariant form, in\nterms of the Casimir operators of the Galilean group (Ardenghi,\nCastagnino, and Lombardi 2009, Lombardi, Castagnino, and Ardenghi\n2010).\n\nAnother fundamental question is the relativistic extension of the\nmodal approach. Dickson and Clifton (1998) have shown that a large\nclass of modal interpretations of ordinary quantum mechanics cannot be\nmade Lorentz-invariant in a straightforward way (see also Myrvold\n2002). With respect to the extension to algebraic quantum field theory\n(see Dieks 2002, Kitajima 2004), Clifton (2000) proposed a natural\ngeneralization of the non-relativistic modal scheme, but Earman and\nRuetsche (2005) showed that it is not yet clear whether it will be\nable to deal with measurement situations and whether it is empirically\nadequate. The problems revealed by these investigations relate to the\nfact that modal interpretations employ the non-relativistic concept of\na global state, of an extended system, at one instant. In a local\nfield-theoretic context this becomes different, and this may help\navoiding conflicts with relativity (Earman and Ruetsche 2005).\nBerkovitz and Hemmo (2005) and Hemmo and Berkovitz (2005) propose a\ndifferent way out: they argue that perspectivalism can come to the\nrescue here (see also Berkovitz and Hemmo 2006). The idea that\nperspectivalism is essential for ensuring compatibility with special\nrelativity is elaborated by Dieks (2021), who puts forward a\nrelativistically covariant treatment of experiments of the EPR-type,\nbased on PMI.\n\nIn the context of MHI an alternative program for achieving\nrelativistic covariance has been developed, based on the idea that the\nactualization rule, expressed in terms of the Casimir operators of the\nGalilean group in non-relativistic quantum mechanics, can be\ntransferred to the relativistic domain by changing the symmetry group\naccordingly. In this case the definite-valued observables of a system\nbecome those represented by the Casimir operators of the\nPoincaré group. Since the mass operator and the squared spin\noperator are the only Casimir operators of the Poincaré group,\nthese then are always definite-valued observables. This conclusion is\nin agreement with a usual assumption in quantum field theory:\nelemental particles always have definite values of mass and spin, and\nthose values are precisely what define the different kinds of\nelemental particles of the theory (Lombardi, Castagnino, and Ardenghi\n2010).\n\nThese various proposals and developments have arisen in the context of\ndetailed technical investigations. This illustrates two features of\nthe modal approach: on the one hand it makes use of a precise\nmathematical framework; on the other hand it is flexible and\nopen-ended, and can accommodate different views concerning the rules\ndetermining the set of definite-valued observables. It is natural to\nexpect new offshoots; for example, it seems plausible that strategies\nfollowed in many-worlds interpretations to define different\n“branches” can also be incorporated in the modal approach\nin order to define single-world possibilities. Whatever these\nprospects, one can at least say that the modal approach has given rise\nto a fruitful series of investigations into the structure of quantum\ntheory.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Albert, D. and B. Loewer, 1990, “Wanted dead or alive: two\nattempts to solve Schrödinger’s paradox,” in\n<em>Proceedings of the PSA 1990</em>, Vol. 1, A. Fine, M. Forbes, and\nL. Wessels (eds.), East Lansing, Michigan: Philosophy of Science\nAssociation, pp. 277–285.",
                "–––, 1991, “Some alleged solutions to the\nmeasurement problem,” <em>Synthese</em>, 88: 87–98.",
                "–––, 1993, “Non-ideal measurements,”\n<em>Foundations of Physics Letters</em>, 6: 297–305.",
                "Ardenghi, J. S., M. Castagnino, and O. Lombardi, 2009,\n“Quantum mechanics: modal interpretation and Galilean\ntransformations,” <em>Foundations of Physics</em>, 39:\n1023–1045.",
                "Ardenghi, J. S. and O. Lombardi, 2011, “The\nModal-Hamiltonian Interpretation of quantum mechanics as a kind of\n‘atomic’ interpretation,” <em>Physics Research\nInternational</em>, 2011: 379604.",
                "Ardenghi, J. S., O. Lombardi, and M. Narvaja, 2013, “Modal\ninterpretations and consecutive measurements,” in <em>EPSA 2011:\nPerspectives and Foundational Problems in Philosophy of Science</em>,\nV. Karakostas, and D. Dieks (eds.), Berlin: Springer, pp.\n207–217.",
                "Arntzenius, F., 1990, “Kochen’s interpretation of\nquantum mechanics,” in <em>Proceedings of the PSA 1990</em>,\nVol. 1, A. Fine, M. Forbes, and L. Wessels (eds.), East Lansing,\nMichigan: Philosophy of Science Association, pp. 241–249.",
                "Bacciagaluppi, G., 1995, “A Kochen-Specker theorem in the\nmodal interpretation of quantum mechanics,” <em>International\nJournal of Theoretical Physics</em>, 34: 1205–1216.",
                "–––, 1996, <em>Topics in the Modal\nInterpretation of Quantum Mechanics</em>. Dissertation, Cambridge\nUniversity.",
                "–––, 1998, “Bohm-Bell dynamics in the\nmodal interpretation,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 177–211.",
                "–––, 2000, “Delocalized properties in the\nmodal interpretation of a continuous model of decoherence,”\n<em>Foundations of Physics</em>, 30: 1431–1444.",
                "Bacciagaluppi, G. and M. Dickson, 1999, “Dynamics for modal\ninterpretations,” <em>Foundations of Physics</em>, 29:\n1165–1201.",
                "Bacciagaluppi, G., M. Donald, and P. Vermaas, 1995,\n“Continuity and discontinuity of definite properties in the\nmodal interpretation,” <em>Helvetica Physica Acta</em>, 68:\n679–704.",
                "Bacciagaluppi, G. and M. Hemmo, 1994, “Making sense of\napproximate decoherence,” in <em>Proceedings of the PSA\n1994</em>, Vol. 1, D. Hull, M. Forbes, and R. Burian (eds.), East\nLansing, Michigan: Philosophy of Science Association, pp.\n345–354.",
                "–––, 1996, “Modal interpretations,\ndecoherence and measurements,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 27: 239–277.",
                "Ballentine, L., 1998, <em>Quantum Mechanics: A Modern\nDevelopment</em>, Singapore: World Scientific.",
                "Barandes, J. and D. Kagan, 2014a, “A synopsis of the minimal\nmodal interpretation of quantum theory,” <em>arXiv</em>:\n1405.6754v3.",
                "–––, 2014b, “The minimal modal\ninterpretation of quantum theory,” <em>arXiv</em>:\n1405.6755v3.",
                "–––, 2020, “Measurement and quantum\ndynamics in the minimal modal interpretation of quantum theory,”\n<em>Foundations of Physics</em>, 50: 1189–1218.",
                "Bell, J. S., 1984, “Beables for quantum field theory,”\nin <em>Speakable and Unspeakable in Quantum Mechanics</em> (1987),\nCambridge: Cambridge University Press, pp. 173–180.",
                "Bene, G., 1997, “Quantum reference systems: A new framework\nfor quantum mechanics,” <em>Physica A</em>, 242:\n529–565.",
                "Bene, G. and D. Dieks, 2002, “A perspectival version of the\nmodal interpretation of quantum mechanics and the origin of\nmacroscopic behavior,” <em>Foundations of Physics</em>, 32:\n645–671.",
                "Berkovitz, J. and M. Hemmo, 2005, “Can modal interpretations\nof quantum mechanics be reconciled with relativity?,”\n<em>Philosophy of Science</em>, 72: 789–801.",
                "–––, 2006, “A new modal interpretation in\nterms of relational properties,” in <em>Physical Theory and its\nInterpretation: Essays in honor of Jeffrey Bub</em>, W. Demopoulos,\nand I. Pitowsky (eds.), New York: Springer, pp.1–28.",
                "Bohm, D., 1952, “A suggested interpretation of the quantum\ntheory in terms of ‘hidden’ variables, I and II,”\n<em>Physical Review</em>, 85: 166–193.",
                "Brown, H., M. Suárez, and G. Bacciagaluppi, 1998,\n“Are ‘sharp values’ of observables always objective\nelements of reality?,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 69–101.",
                "Bub, J., 1992, “Quantum mechanics without the projection\npostulate,” <em>Foundations of Physics</em>, 22:\n737–754.",
                "–––, 1994, “On the structure of quantal\nproposition systems,” <em>Foundations of Physics</em>, 24:\n1261–1279.",
                "–––, 1997, <em>Interpreting the Quantum\nWorld</em>, Cambridge: Cambridge University Press.",
                "Bub, J. and R. Clifton, 1996, “A uniqueness theorem for\ninterpretations of quantum mechanics,” <em>Studies in History\nand Philosophy of Modern Physics</em>, 27: 181–219.",
                "Bub, J., R. Clifton, and S. Goldstein, 2000, “Revised proof\nof the uniqueness theorem for ‘no collapse’\ninterpretations of quantum mechanics,” <em>Studies in History\nand Philosophy of Modern Physics</em>, 31: 95–98.",
                "Bueno, O., 2014, “Constructive empiricism, partial\nstructures and the modal interpretation of quantum mechanics,”\n<em>Quanta</em>, 3: 1–15.",
                "Calosi, C., 2018, “Quantum monism: an assessment,”\n<em>Philosophical Studies</em>, 175: 3217–3236.",
                "Castagnino, M., S. Fortin, and O. Lombardi, 2010, “Is the\ndecoherence of a system the result of its interaction with the\nenvironment?,” <em>Modern Physics Letters A</em>, 25:\n1431–1439.",
                "Clifton, R., 1995a, “Independently motivating the\nKochen-Dieks modal interpretation of quantum mechanics,” <em>The\nBritish Journal for the Philosophy of Science</em>, 46:\n33–57.",
                "–––, 1995b, “Making sense of the\nKochen-Dieks ‘no-collapse’ interpretation of quantum\nmechanics independent of the measurement problem,” <em>Annals of\nthe New York Academy of Science</em>, 755: 570–578.",
                "–––, 1995c, “Why modal interpretations of\nquantum mechanics must abandon classical reasoning about the physical\nproperties,” <em>International Journal of Theoretical\nPhysics</em>, 34: 1302–1312.",
                "–––, 1996, “The properties of modal\ninterpretations of quantum mechanics,” <em>The British Journal\nfor the Philosophy of Science</em>, 47: 371–398.",
                "–––, 2000, “The modal interpretation of\nalgebraic quantum field theory,” <em>Physics Letters A</em>,\n271: 167–177.",
                "Cohen, D. W., 1989, <em>An Introduction to Hilbert Space and\nQuantum Logic</em>, New York: Springer-Verlag.",
                "Da Costa, N. and O. Lombardi, 2014, “Quantum mechanics:\nontology without individuals,” <em>Foundations of Physics</em>,\n44: 1246–1257.",
                "Da Costa, N., O. Lombardi, and M. Lastiri, 2013, “A modal\nontology of properties for quantum mechanics,”\n<em>Synthese</em>, 190: 3671–3693.",
                "De Witt, B. S. M., 1970, “Quantum mechanics and\nreality,” <em>Physics Today</em>, 23: 30–35.",
                "Dickson, M., 1994, “Wavefunction tails in the modal\ninterpretation,” in <em>Proceedings of the PSA 1994</em>, Vol.\n1, D. Hull, M. Forbes, and R. Burian (eds.), East Lansing, Michigan:\nPhilosophy of Science Association, pp. 366–376.",
                "–––, 1995a, “Faux-Boolean algebras,\nclassical probability, and determinism,” <em>Foundations of\nPhysics Letters</em>, 8: 231–242.",
                "–––, 1995b, “Faux-Boolean algebras and\nclassical models,” <em>Foundations of Physics Letters</em>, 8:\n401–415.",
                "Dickson, M. and R. Clifton, 1998, “Lorentz-invariance in\nmodal interpretations,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 9–48.",
                "Dieks, D., 1988, “The formalism of quantum theory: an\nobjective description of reality?,” <em>Annalen der Physik</em>,\n7: 174–190.",
                "–––, 1989, “Resolution of the measurement\nproblem through decoherence of the quantum state,” <em>Physics\nLetters A</em>, 142: 439–446.",
                "–––, 1998, “Preferred factorizations and\nconsistent property attribution”, in <em>Quantum Measurement:\nBeyond Paradox</em>, R. Healey and G. Hellman (eds.), Minneapolis:\nUniversity of Minnesota Press, pp. 144–160.",
                "–––, 2002, “Events and covariance in the\ninterpretation of quantum field theory,” in <em>Ontological\nAspects of Quantum Field Theory</em>, M. Kuhlmann, H. Lyre, and A.\nWayne (eds.), Singapore: World Scientific, pp. 215–234.",
                "–––, 2009, “Objectivity in perspective:\nrelationism in the interpretation of quantum mechanics,” \n<em>Foundations of Physics</em>, 39: 760–775.",
                "–––, 2017, “Niels Bohr and the formalism\nof quantum mechanics,” in J. Faye and H. J.  Folse (eds.),\n<em>Niels Bohr and the Philosophy of Physics: Twenty-First-Century\nPerspectives</em>, London: Bloomsbury Academic, pp. 303–333.",
                "–––, 2019, “Quantum mechanics and\nperspectivalism,” in O. Lombardi, S. Fortin, C.  López,\nand F. Holik (eds.), <em>Quantum Worlds: Perspectives on the Ontology\nof Quantum Mechanics</em>, Cambridge: Cambridge University Press,\npp. 51–70.",
                "–––, 2021, “Modal interpretations of\nquantum mechanics,” in O. Freire (ed.), <em>Oxford Handbook of\nthe History of Interpretations of Quantum Mechanics</em>, Oxford:\nOxford University Press, Ch. 47.",
                "Dieks, D. and P. Vermaas (eds.), 1998, <em>The Modal\nInterpretation of Quantum Mechanics</em>, Dordrecht: Kluwer Academic\nPublishers.",
                "Donald, M., 1998, “Discontinuity and continuity of definite\nproperties in the modal interpretation,” in <em>The Modal\nInterpretation of Quantum Mechanics</em>, D. Dieks and P. Vermaas\n(eds.), Dordrecht: Kluwer Academic Publishers, pp. 213–222.",
                "Earman, J. and L. Ruetsche, 2005, “Relativistic invariance\nand modal interpretations,” <em>Philosophy of Science</em>, 72:\n557–583.",
                "Elby, A., 1993, “Why ‘modal’ interpretations of\nquantum mechanics don’t solve the measurement problem,”\n<em>Foundations of Physics Letters</em>, 6: 5–19.",
                "Everett, H., 1957, “<em>Relative state</em> formulation of\nquantum mechanics,” <em>Review of Modern Physics</em>, 29:\n454–462.",
                "Fortin, S., O. Lombardi, and J. C. Martínez\nGonzález, 2018, “A new application of the\nmodal-Hamiltonian interpretation of quantum mechanics: the problem of\noptical isomerism,” <em>Studies in History and Philosophy of\nModern Physics</em>, 62: 123–135.",
                "Frauchiger, D. and R. Renner, 2018, “Quantum theory cannot\nconsistently describe the use of itself,” <em>Nature\nCommunications</em>, 9: 3711.",
                "French, S. and D. Krause, 2006, <em>Identity in Physics: A\nHistorical, Philosophical and Formal Analysis</em>, Oxford: Oxford\nUniversity Press.",
                "Gambetta, J. and H. M. Wiseman, 2003, “Interpretation of\nnon-Markovian stochastic Schrödinger equations as a\nhidden-variable theory,” <em>Physical Review A</em>, 68:\n062104.",
                "–––, 2004, “Modal dynamics for positive\noperator measures,” <em>Foundations of Physics</em>, 34:\n419–448.",
                "Healey, R., 1989, <em>The Philosophy of Quantum Mechanics: An\nInteractive Interpretation</em>, Cambridge: Cambridge University\nPress.",
                "–––, 1995, “Dissipating the quantum\nmeasurement problem,” <em>Topoi</em>, 14: 55–65.",
                "Hemmo, M. and J. Berkovitz, 2005, “Modal interpretations of\nquantum mechanics and relativity: a reconsideration,”\n<em>Foundations of Physics</em>, 35: 373–397.",
                "Hollowood, T., 2013a, “The Copenhagen interpretation as an\nemergent phenomenon,” <em>Journal of Physics A: Mathematical and\nTheoretical</em>, 46: 325302.",
                "–––, 2013b, “New modal quantum\nmechanics,” <em>arXiv</em>: 1312.4751v1.",
                "–––, 2014, “The emergent Copenhagen\ninterpretation of quantum mechanics,” <em>Journal of Physics A:\nMathematical and Theoretical</em>, 47: 18530.",
                "Hughes, R. I. G., 1989, <em>The Structure and Interpretation of\nQuantum Mechanics</em>, Cambridge. Massachusetts: Harvard University\nPress.",
                "Kitajima, Y., 2004, “A remark on the modal interpretation of\nalgebraic quantum field theory,” <em>Physics Letters A</em>,\n331: 181–186.",
                "Kochen, S., 1985, “A new interpretation of quantum\nmechanics,” in <em>Symposium on the Foundations of Modern\nPhysics 1985</em>, P. Mittelstaedt and P. Lahti (eds.), Singapore:\nWorld Scientific, pp. 151–169.",
                "Kochen, S. and E. Specker, 1967, “The problem of hidden\nvariables in quantum mechanics,” <em>Journal of Mathematics and\nMechanics</em>, 17: 59–87.",
                "Ladyman, J., 1998, “What is structural realism?,”\n<em>Studies in History and Philosophy of Science</em>, 29:\n409–424.",
                "Laudisa, F. and C. Rovelli, 2021, “Relational quantum\nmechanics,” in <em>The Stanford Encyclopedia of Philosophy</em>,\nSpring 2021 Edition, Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2021/entries/qm-relational/\">https://plato.stanford.edu/archives/spr2021/entries/qm-relational/</a>&gt;.",
                "Lombardi, O., J. S. Ardenghi, S. Fortin, and M. Castagnino, 2011,\n“Compatibility between environment-induced decoherence and the\nmodal-Hamiltonian interpretation of quantum mechanics,”\n<em>Philosophy of Science</em>, 78: 1024–1036.",
                "Lombardi, O. and M. Castagnino, 2008, “A modal-Hamiltonian\ninterpretation of quantum mechanics,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 39: 380–443.",
                "Lombardi, O., M. Castagnino, and J. S. Ardenghi, 2010, “The\nmodal-Hamiltonian interpretation and the Galilean covariance of\nquantum mechanics,” <em>Studies in History and Philosophy of\nModern Physics</em>, 41: 93–103.",
                "Lombardi, O. and D. Dieks, 2016, “Particles in a quantum\nontology of properties,” in <em>Metaphysics in Contemporary\nPhysics</em>, T. Bigaj, and C. Wüthrich (eds.), Leiden:\nBrill-Rodopi, pp. 123–143.",
                "Lombardi, O., S. Fortin, and C. López, 2015,\n“Measurement, interpretation and information,”\n<em>Entropy</em>, 17: 7310–7330.",
                "Maudlin, T., 1995, “Three measurement problems,”\n<em>Topoi</em>, 14: 7–15.",
                "Menzel, C., 2018, “Actualism,” in <em>The Stanford\nEncyclopedia of Philosophy</em>, Summer 2018 Edition, Edward N. Zalta\n(ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/actualism/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/actualism/</a>&gt;).",
                "Myrvold, W., 2002, “Modal interpretations and\nrelativity,” <em>Foundations of Physics</em>, 32:\n1773–1784.",
                "–––, 2018, “Philosophical issues in\nquantum theory,” in <em>The Stanford Encyclopedia of\nPhilosophy</em>, Fall 2018 Edition, Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/fall2018/entries/qt-issues/\" target=\"other\">https://plato.stanford.edu/archives/fall2018/entries/qt-issues/</a>&gt;).",
                "Nakayama, K., 2008a, “Reformulation of a modal\ninterpretation of quantum mechanics in the topos M-set,”\n<em>Ryokoku Journal of Humanities and Sciences</em>, 29:\n159–168.",
                "–––, 2008b, “Topos-theoretic extension of\na modal interpretation of quantum mechanics,” <em>International\nJournal of Theoretical Physics</em>, 47: 2065–2094.",
                "Oldofredi, A., 2021, “The bundle theory approach to\nrelational quantum mechanics,” <em>Foundations of Physics</em>,\n51: 1–22.",
                "Oldofredi, A. and C. López, 2020, “On the\nclassification between \\({\\psi}\\)-ontic and \\({\\psi}\\)-epistemic\nontological models,” <em>Foundations of Physics</em>, 50:\n1315–1345.",
                "Reeder, N. and R. Clifton, 1995, “Uniqueness of prime\nfactorizations of linear operators in quantum mechanics,”\n<em>Physics Letters A</em>, 204: 198–204.",
                "Rovelli, C., 1996, “Relational quantum mechanics,”\n<em>International Journal of Theoretical Physics</em>, 35:\n1637–1678.",
                "Rovelli, C. and M. Smerlak, 2007, “Relational EPR,”\n<em>Foundations of Physics</em>, 37: 427–445.",
                "Ruetsche, L., 1995, “Measurement error and the Albert-Loewer\nproblem,” <em>Foundations of Physics Letters</em>, 8:\n327–344.",
                "–––, 1996, “Van Fraassen on preparation\nand measurement,” <em>Philosophy of Science</em>, 63:\nS338–S346.",
                "–––, 2003, “Modal semantics, modal\ndynamics and the problem of state preparation,”\n<em>International Studies in the Philosophy of Science</em>, 17:\n25–41.",
                "Schlosshauer, M., 2007, <em>Decoherence and the\nQuantum-to-Classical Transition</em>, Heidelberg-Berlin:\nSpringer.",
                "Schrödinger, E., 1935, “Discussion of probability\nrelations between separated systems,” <em>Proceedings of the\nCambridge Philosophical Society</em>, 31: 555–563.",
                "Suárez, M., 2004, “Quantum selections, propensities\nand the problem of measurement,” <em>The British Journal for the\nPhilosophy of Science</em>, 55: 219–255.",
                "Sudbery, A., 2002, “Diese verdammte\nQuantenspringerei,” <em>Studies in History and Philosophy of\nModern Physics</em>, 33: 387–411.",
                "van Fraassen, B. C., 1972, “A formal approach to the\nphilosophy of science,” in <em>Paradigms and Paradoxes: The\nPhilosophical Challenge of the Quantum Domain</em>, R. Colodny (ed.),\nPittsburgh: University of Pittsburgh Press, pp. 303–366.",
                "–––, 1974, “The Einstein-Podolsky-Rosen\nparadox,” <em>Synthese</em>, 29: 291–309.",
                "–––, 1991, <em>Quantum Mechanics</em>, Oxford:\nClarendon Press.",
                "–––, 1997, \n“Modal interpretation of repeated measurement: A rejoinder to Leeds and Healey,” <em>Philosophy of Science</em>, 64: 669–676.",
                "–––, 2010, “Rovelli’s world,”\n<em>Foundations of Physics</em>, 40: 390–417.",
                "Vermaas, P., 1996, “Unique transition probabilities in the\nmodal interpretation,” <em>Studies in History and Philosophy of\nModern Physics</em>, 27: 133–159.",
                "–––, 1997, “A no-go theorem for joint\nproperty ascriptions in modal interpretations of quantum\nmechanics,” <em>Physical Review Letters</em>, 78:\n2033–2037.",
                "–––, 1998, “The pros and cons of the\nKochen-Dieks and the atomic modal interpretation,” in <em>The\nModal Interpretation of Quantum Mechanics</em>, D. Dieks and P.\nVermaas (eds.), Dordrecht: Kluwer Academic Publishers, pp.\n103–148.",
                "–––, 1999, <em>A Philosopher’s\nUnderstanding of Quantum Mechanics: Possibilities and Impossibilities\nof a Modal Interpretation</em>, Cambridge: Cambridge University\nPress.",
                "Vermaas, P. and D. Dieks, 1995, “The modal interpretation of\nquantum mechanics and its generalization to density operators,”\n<em>Foundations of Physics</em>, 25: 145–158.",
                "Vink, J., 1993, “Quantum mechanics in terms of discrete\nbeables,” <em>Physical Review A</em>, 48: 1808–1818.",
                "Zurek, W. H., 1981, “Pointer basis of quantum apparatus:\ninto what mixtures does the wave packet collapse?,” <em>Physical\nReview D</em>, 24: 1516–1525.",
                "–––, 2003, “Decoherence, einselection, and\nthe quantum origins of the classical,” <em>Reviews of Modern\nPhysics</em>, 75: 715–776."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Albert, D. and B. Loewer, 1990, “Wanted dead or alive: two\nattempts to solve Schrödinger’s paradox,” in\n<em>Proceedings of the PSA 1990</em>, Vol. 1, A. Fine, M. Forbes, and\nL. Wessels (eds.), East Lansing, Michigan: Philosophy of Science\nAssociation, pp. 277–285.</li>\n<li>–––, 1991, “Some alleged solutions to the\nmeasurement problem,” <em>Synthese</em>, 88: 87–98.</li>\n<li>–––, 1993, “Non-ideal measurements,”\n<em>Foundations of Physics Letters</em>, 6: 297–305.</li>\n<li>Ardenghi, J. S., M. Castagnino, and O. Lombardi, 2009,\n“Quantum mechanics: modal interpretation and Galilean\ntransformations,” <em>Foundations of Physics</em>, 39:\n1023–1045.</li>\n<li>Ardenghi, J. S. and O. Lombardi, 2011, “The\nModal-Hamiltonian Interpretation of quantum mechanics as a kind of\n‘atomic’ interpretation,” <em>Physics Research\nInternational</em>, 2011: 379604.</li>\n<li>Ardenghi, J. S., O. Lombardi, and M. Narvaja, 2013, “Modal\ninterpretations and consecutive measurements,” in <em>EPSA 2011:\nPerspectives and Foundational Problems in Philosophy of Science</em>,\nV. Karakostas, and D. Dieks (eds.), Berlin: Springer, pp.\n207–217.</li>\n<li>Arntzenius, F., 1990, “Kochen’s interpretation of\nquantum mechanics,” in <em>Proceedings of the PSA 1990</em>,\nVol. 1, A. Fine, M. Forbes, and L. Wessels (eds.), East Lansing,\nMichigan: Philosophy of Science Association, pp. 241–249.</li>\n<li>Bacciagaluppi, G., 1995, “A Kochen-Specker theorem in the\nmodal interpretation of quantum mechanics,” <em>International\nJournal of Theoretical Physics</em>, 34: 1205–1216.</li>\n<li>–––, 1996, <em>Topics in the Modal\nInterpretation of Quantum Mechanics</em>. Dissertation, Cambridge\nUniversity.</li>\n<li>–––, 1998, “Bohm-Bell dynamics in the\nmodal interpretation,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 177–211.</li>\n<li>–––, 2000, “Delocalized properties in the\nmodal interpretation of a continuous model of decoherence,”\n<em>Foundations of Physics</em>, 30: 1431–1444.</li>\n<li>Bacciagaluppi, G. and M. Dickson, 1999, “Dynamics for modal\ninterpretations,” <em>Foundations of Physics</em>, 29:\n1165–1201.</li>\n<li>Bacciagaluppi, G., M. Donald, and P. Vermaas, 1995,\n“Continuity and discontinuity of definite properties in the\nmodal interpretation,” <em>Helvetica Physica Acta</em>, 68:\n679–704.</li>\n<li>Bacciagaluppi, G. and M. Hemmo, 1994, “Making sense of\napproximate decoherence,” in <em>Proceedings of the PSA\n1994</em>, Vol. 1, D. Hull, M. Forbes, and R. Burian (eds.), East\nLansing, Michigan: Philosophy of Science Association, pp.\n345–354.</li>\n<li>–––, 1996, “Modal interpretations,\ndecoherence and measurements,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 27: 239–277.</li>\n<li>Ballentine, L., 1998, <em>Quantum Mechanics: A Modern\nDevelopment</em>, Singapore: World Scientific.</li>\n<li>Barandes, J. and D. Kagan, 2014a, “A synopsis of the minimal\nmodal interpretation of quantum theory,” <em>arXiv</em>:\n1405.6754v3.</li>\n<li>–––, 2014b, “The minimal modal\ninterpretation of quantum theory,” <em>arXiv</em>:\n1405.6755v3.</li>\n<li>–––, 2020, “Measurement and quantum\ndynamics in the minimal modal interpretation of quantum theory,”\n<em>Foundations of Physics</em>, 50: 1189–1218.</li>\n<li>Bell, J. S., 1984, “Beables for quantum field theory,”\nin <em>Speakable and Unspeakable in Quantum Mechanics</em> (1987),\nCambridge: Cambridge University Press, pp. 173–180.</li>\n<li>Bene, G., 1997, “Quantum reference systems: A new framework\nfor quantum mechanics,” <em>Physica A</em>, 242:\n529–565.</li>\n<li>Bene, G. and D. Dieks, 2002, “A perspectival version of the\nmodal interpretation of quantum mechanics and the origin of\nmacroscopic behavior,” <em>Foundations of Physics</em>, 32:\n645–671.</li>\n<li>Berkovitz, J. and M. Hemmo, 2005, “Can modal interpretations\nof quantum mechanics be reconciled with relativity?,”\n<em>Philosophy of Science</em>, 72: 789–801.</li>\n<li>–––, 2006, “A new modal interpretation in\nterms of relational properties,” in <em>Physical Theory and its\nInterpretation: Essays in honor of Jeffrey Bub</em>, W. Demopoulos,\nand I. Pitowsky (eds.), New York: Springer, pp.1–28.</li>\n<li>Bohm, D., 1952, “A suggested interpretation of the quantum\ntheory in terms of ‘hidden’ variables, I and II,”\n<em>Physical Review</em>, 85: 166–193.</li>\n<li>Brown, H., M. Suárez, and G. Bacciagaluppi, 1998,\n“Are ‘sharp values’ of observables always objective\nelements of reality?,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 69–101.</li>\n<li>Bub, J., 1992, “Quantum mechanics without the projection\npostulate,” <em>Foundations of Physics</em>, 22:\n737–754.</li>\n<li>–––, 1994, “On the structure of quantal\nproposition systems,” <em>Foundations of Physics</em>, 24:\n1261–1279.</li>\n<li>–––, 1997, <em>Interpreting the Quantum\nWorld</em>, Cambridge: Cambridge University Press.</li>\n<li>Bub, J. and R. Clifton, 1996, “A uniqueness theorem for\ninterpretations of quantum mechanics,” <em>Studies in History\nand Philosophy of Modern Physics</em>, 27: 181–219.</li>\n<li>Bub, J., R. Clifton, and S. Goldstein, 2000, “Revised proof\nof the uniqueness theorem for ‘no collapse’\ninterpretations of quantum mechanics,” <em>Studies in History\nand Philosophy of Modern Physics</em>, 31: 95–98.</li>\n<li>Bueno, O., 2014, “Constructive empiricism, partial\nstructures and the modal interpretation of quantum mechanics,”\n<em>Quanta</em>, 3: 1–15.</li>\n<li>Calosi, C., 2018, “Quantum monism: an assessment,”\n<em>Philosophical Studies</em>, 175: 3217–3236.</li>\n<li>Castagnino, M., S. Fortin, and O. Lombardi, 2010, “Is the\ndecoherence of a system the result of its interaction with the\nenvironment?,” <em>Modern Physics Letters A</em>, 25:\n1431–1439.</li>\n<li>Clifton, R., 1995a, “Independently motivating the\nKochen-Dieks modal interpretation of quantum mechanics,” <em>The\nBritish Journal for the Philosophy of Science</em>, 46:\n33–57.</li>\n<li>–––, 1995b, “Making sense of the\nKochen-Dieks ‘no-collapse’ interpretation of quantum\nmechanics independent of the measurement problem,” <em>Annals of\nthe New York Academy of Science</em>, 755: 570–578.</li>\n<li>–––, 1995c, “Why modal interpretations of\nquantum mechanics must abandon classical reasoning about the physical\nproperties,” <em>International Journal of Theoretical\nPhysics</em>, 34: 1302–1312.</li>\n<li>–––, 1996, “The properties of modal\ninterpretations of quantum mechanics,” <em>The British Journal\nfor the Philosophy of Science</em>, 47: 371–398.</li>\n<li>–––, 2000, “The modal interpretation of\nalgebraic quantum field theory,” <em>Physics Letters A</em>,\n271: 167–177.</li>\n<li>Cohen, D. W., 1989, <em>An Introduction to Hilbert Space and\nQuantum Logic</em>, New York: Springer-Verlag.</li>\n<li>Da Costa, N. and O. Lombardi, 2014, “Quantum mechanics:\nontology without individuals,” <em>Foundations of Physics</em>,\n44: 1246–1257.</li>\n<li>Da Costa, N., O. Lombardi, and M. Lastiri, 2013, “A modal\nontology of properties for quantum mechanics,”\n<em>Synthese</em>, 190: 3671–3693.</li>\n<li>De Witt, B. S. M., 1970, “Quantum mechanics and\nreality,” <em>Physics Today</em>, 23: 30–35.</li>\n<li>Dickson, M., 1994, “Wavefunction tails in the modal\ninterpretation,” in <em>Proceedings of the PSA 1994</em>, Vol.\n1, D. Hull, M. Forbes, and R. Burian (eds.), East Lansing, Michigan:\nPhilosophy of Science Association, pp. 366–376.</li>\n<li>–––, 1995a, “Faux-Boolean algebras,\nclassical probability, and determinism,” <em>Foundations of\nPhysics Letters</em>, 8: 231–242.</li>\n<li>–––, 1995b, “Faux-Boolean algebras and\nclassical models,” <em>Foundations of Physics Letters</em>, 8:\n401–415.</li>\n<li>Dickson, M. and R. Clifton, 1998, “Lorentz-invariance in\nmodal interpretations,” in <em>The Modal Interpretation of\nQuantum Mechanics</em>, D. Dieks and P. Vermaas (eds.), Dordrecht:\nKluwer Academic Publishers, pp. 9–48.</li>\n<li>Dieks, D., 1988, “The formalism of quantum theory: an\nobjective description of reality?,” <em>Annalen der Physik</em>,\n7: 174–190.</li>\n<li>–––, 1989, “Resolution of the measurement\nproblem through decoherence of the quantum state,” <em>Physics\nLetters A</em>, 142: 439–446.</li>\n<li>–––, 1998, “Preferred factorizations and\nconsistent property attribution”, in <em>Quantum Measurement:\nBeyond Paradox</em>, R. Healey and G. Hellman (eds.), Minneapolis:\nUniversity of Minnesota Press, pp. 144–160.</li>\n<li>–––, 2002, “Events and covariance in the\ninterpretation of quantum field theory,” in <em>Ontological\nAspects of Quantum Field Theory</em>, M. Kuhlmann, H. Lyre, and A.\nWayne (eds.), Singapore: World Scientific, pp. 215–234.</li>\n<li>–––, 2009, “Objectivity in perspective:\nrelationism in the interpretation of quantum mechanics,” \n<em>Foundations of Physics</em>, 39: 760–775.</li>\n<li>–––, 2017, “Niels Bohr and the formalism\nof quantum mechanics,” in J. Faye and H. J.  Folse (eds.),\n<em>Niels Bohr and the Philosophy of Physics: Twenty-First-Century\nPerspectives</em>, London: Bloomsbury Academic, pp. 303–333.</li>\n<li>–––, 2019, “Quantum mechanics and\nperspectivalism,” in O. Lombardi, S. Fortin, C.  López,\nand F. Holik (eds.), <em>Quantum Worlds: Perspectives on the Ontology\nof Quantum Mechanics</em>, Cambridge: Cambridge University Press,\npp. 51–70.</li>\n<li>–––, 2021, “Modal interpretations of\nquantum mechanics,” in O. Freire (ed.), <em>Oxford Handbook of\nthe History of Interpretations of Quantum Mechanics</em>, Oxford:\nOxford University Press, Ch. 47.</li>\n<li>Dieks, D. and P. Vermaas (eds.), 1998, <em>The Modal\nInterpretation of Quantum Mechanics</em>, Dordrecht: Kluwer Academic\nPublishers.</li>\n<li>Donald, M., 1998, “Discontinuity and continuity of definite\nproperties in the modal interpretation,” in <em>The Modal\nInterpretation of Quantum Mechanics</em>, D. Dieks and P. Vermaas\n(eds.), Dordrecht: Kluwer Academic Publishers, pp. 213–222.</li>\n<li>Earman, J. and L. Ruetsche, 2005, “Relativistic invariance\nand modal interpretations,” <em>Philosophy of Science</em>, 72:\n557–583.</li>\n<li>Elby, A., 1993, “Why ‘modal’ interpretations of\nquantum mechanics don’t solve the measurement problem,”\n<em>Foundations of Physics Letters</em>, 6: 5–19.</li>\n<li>Everett, H., 1957, “<em>Relative state</em> formulation of\nquantum mechanics,” <em>Review of Modern Physics</em>, 29:\n454–462.</li>\n<li>Fortin, S., O. Lombardi, and J. C. Martínez\nGonzález, 2018, “A new application of the\nmodal-Hamiltonian interpretation of quantum mechanics: the problem of\noptical isomerism,” <em>Studies in History and Philosophy of\nModern Physics</em>, 62: 123–135.</li>\n<li>Frauchiger, D. and R. Renner, 2018, “Quantum theory cannot\nconsistently describe the use of itself,” <em>Nature\nCommunications</em>, 9: 3711.</li>\n<li>French, S. and D. Krause, 2006, <em>Identity in Physics: A\nHistorical, Philosophical and Formal Analysis</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Gambetta, J. and H. M. Wiseman, 2003, “Interpretation of\nnon-Markovian stochastic Schrödinger equations as a\nhidden-variable theory,” <em>Physical Review A</em>, 68:\n062104.</li>\n<li>–––, 2004, “Modal dynamics for positive\noperator measures,” <em>Foundations of Physics</em>, 34:\n419–448.</li>\n<li>Healey, R., 1989, <em>The Philosophy of Quantum Mechanics: An\nInteractive Interpretation</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1995, “Dissipating the quantum\nmeasurement problem,” <em>Topoi</em>, 14: 55–65.</li>\n<li>Hemmo, M. and J. Berkovitz, 2005, “Modal interpretations of\nquantum mechanics and relativity: a reconsideration,”\n<em>Foundations of Physics</em>, 35: 373–397.</li>\n<li>Hollowood, T., 2013a, “The Copenhagen interpretation as an\nemergent phenomenon,” <em>Journal of Physics A: Mathematical and\nTheoretical</em>, 46: 325302.</li>\n<li>–––, 2013b, “New modal quantum\nmechanics,” <em>arXiv</em>: 1312.4751v1.</li>\n<li>–––, 2014, “The emergent Copenhagen\ninterpretation of quantum mechanics,” <em>Journal of Physics A:\nMathematical and Theoretical</em>, 47: 18530.</li>\n<li>Hughes, R. I. G., 1989, <em>The Structure and Interpretation of\nQuantum Mechanics</em>, Cambridge. Massachusetts: Harvard University\nPress.</li>\n<li>Kitajima, Y., 2004, “A remark on the modal interpretation of\nalgebraic quantum field theory,” <em>Physics Letters A</em>,\n331: 181–186.</li>\n<li>Kochen, S., 1985, “A new interpretation of quantum\nmechanics,” in <em>Symposium on the Foundations of Modern\nPhysics 1985</em>, P. Mittelstaedt and P. Lahti (eds.), Singapore:\nWorld Scientific, pp. 151–169.</li>\n<li>Kochen, S. and E. Specker, 1967, “The problem of hidden\nvariables in quantum mechanics,” <em>Journal of Mathematics and\nMechanics</em>, 17: 59–87.</li>\n<li>Ladyman, J., 1998, “What is structural realism?,”\n<em>Studies in History and Philosophy of Science</em>, 29:\n409–424.</li>\n<li>Laudisa, F. and C. Rovelli, 2021, “Relational quantum\nmechanics,” in <em>The Stanford Encyclopedia of Philosophy</em>,\nSpring 2021 Edition, Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2021/entries/qm-relational/\">https://plato.stanford.edu/archives/spr2021/entries/qm-relational/</a>&gt;.</li>\n<li>Lombardi, O., J. S. Ardenghi, S. Fortin, and M. Castagnino, 2011,\n“Compatibility between environment-induced decoherence and the\nmodal-Hamiltonian interpretation of quantum mechanics,”\n<em>Philosophy of Science</em>, 78: 1024–1036.</li>\n<li>Lombardi, O. and M. Castagnino, 2008, “A modal-Hamiltonian\ninterpretation of quantum mechanics,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 39: 380–443.</li>\n<li>Lombardi, O., M. Castagnino, and J. S. Ardenghi, 2010, “The\nmodal-Hamiltonian interpretation and the Galilean covariance of\nquantum mechanics,” <em>Studies in History and Philosophy of\nModern Physics</em>, 41: 93–103.</li>\n<li>Lombardi, O. and D. Dieks, 2016, “Particles in a quantum\nontology of properties,” in <em>Metaphysics in Contemporary\nPhysics</em>, T. Bigaj, and C. Wüthrich (eds.), Leiden:\nBrill-Rodopi, pp. 123–143.</li>\n<li>Lombardi, O., S. Fortin, and C. López, 2015,\n“Measurement, interpretation and information,”\n<em>Entropy</em>, 17: 7310–7330.</li>\n<li>Maudlin, T., 1995, “Three measurement problems,”\n<em>Topoi</em>, 14: 7–15.</li>\n<li>Menzel, C., 2018, “Actualism,” in <em>The Stanford\nEncyclopedia of Philosophy</em>, Summer 2018 Edition, Edward N. Zalta\n(ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/actualism/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/actualism/</a>&gt;).</li>\n<li>Myrvold, W., 2002, “Modal interpretations and\nrelativity,” <em>Foundations of Physics</em>, 32:\n1773–1784.</li>\n<li>–––, 2018, “Philosophical issues in\nquantum theory,” in <em>The Stanford Encyclopedia of\nPhilosophy</em>, Fall 2018 Edition, Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/fall2018/entries/qt-issues/\" target=\"other\">https://plato.stanford.edu/archives/fall2018/entries/qt-issues/</a>&gt;).</li>\n<li>Nakayama, K., 2008a, “Reformulation of a modal\ninterpretation of quantum mechanics in the topos M-set,”\n<em>Ryokoku Journal of Humanities and Sciences</em>, 29:\n159–168.</li>\n<li>–––, 2008b, “Topos-theoretic extension of\na modal interpretation of quantum mechanics,” <em>International\nJournal of Theoretical Physics</em>, 47: 2065–2094.</li>\n<li>Oldofredi, A., 2021, “The bundle theory approach to\nrelational quantum mechanics,” <em>Foundations of Physics</em>,\n51: 1–22.</li>\n<li>Oldofredi, A. and C. López, 2020, “On the\nclassification between \\({\\psi}\\)-ontic and \\({\\psi}\\)-epistemic\nontological models,” <em>Foundations of Physics</em>, 50:\n1315–1345.</li>\n<li>Reeder, N. and R. Clifton, 1995, “Uniqueness of prime\nfactorizations of linear operators in quantum mechanics,”\n<em>Physics Letters A</em>, 204: 198–204.</li>\n<li>Rovelli, C., 1996, “Relational quantum mechanics,”\n<em>International Journal of Theoretical Physics</em>, 35:\n1637–1678.</li>\n<li>Rovelli, C. and M. Smerlak, 2007, “Relational EPR,”\n<em>Foundations of Physics</em>, 37: 427–445.</li>\n<li>Ruetsche, L., 1995, “Measurement error and the Albert-Loewer\nproblem,” <em>Foundations of Physics Letters</em>, 8:\n327–344.</li>\n<li>–––, 1996, “Van Fraassen on preparation\nand measurement,” <em>Philosophy of Science</em>, 63:\nS338–S346.</li>\n<li>–––, 2003, “Modal semantics, modal\ndynamics and the problem of state preparation,”\n<em>International Studies in the Philosophy of Science</em>, 17:\n25–41.</li>\n<li>Schlosshauer, M., 2007, <em>Decoherence and the\nQuantum-to-Classical Transition</em>, Heidelberg-Berlin:\nSpringer.</li>\n<li>Schrödinger, E., 1935, “Discussion of probability\nrelations between separated systems,” <em>Proceedings of the\nCambridge Philosophical Society</em>, 31: 555–563.</li>\n<li>Suárez, M., 2004, “Quantum selections, propensities\nand the problem of measurement,” <em>The British Journal for the\nPhilosophy of Science</em>, 55: 219–255.</li>\n<li>Sudbery, A., 2002, “Diese verdammte\nQuantenspringerei,” <em>Studies in History and Philosophy of\nModern Physics</em>, 33: 387–411.</li>\n<li>van Fraassen, B. C., 1972, “A formal approach to the\nphilosophy of science,” in <em>Paradigms and Paradoxes: The\nPhilosophical Challenge of the Quantum Domain</em>, R. Colodny (ed.),\nPittsburgh: University of Pittsburgh Press, pp. 303–366.</li>\n<li>–––, 1974, “The Einstein-Podolsky-Rosen\nparadox,” <em>Synthese</em>, 29: 291–309.</li>\n<li>–––, 1991, <em>Quantum Mechanics</em>, Oxford:\nClarendon Press.</li>\n<li>–––, 1997, \n“Modal interpretation of repeated measurement: A rejoinder to Leeds and Healey,” <em>Philosophy of Science</em>, 64: 669–676.</li>\n<li>–––, 2010, “Rovelli’s world,”\n<em>Foundations of Physics</em>, 40: 390–417.</li>\n<li>Vermaas, P., 1996, “Unique transition probabilities in the\nmodal interpretation,” <em>Studies in History and Philosophy of\nModern Physics</em>, 27: 133–159.</li>\n<li>–––, 1997, “A no-go theorem for joint\nproperty ascriptions in modal interpretations of quantum\nmechanics,” <em>Physical Review Letters</em>, 78:\n2033–2037.</li>\n<li>–––, 1998, “The pros and cons of the\nKochen-Dieks and the atomic modal interpretation,” in <em>The\nModal Interpretation of Quantum Mechanics</em>, D. Dieks and P.\nVermaas (eds.), Dordrecht: Kluwer Academic Publishers, pp.\n103–148.</li>\n<li>–––, 1999, <em>A Philosopher’s\nUnderstanding of Quantum Mechanics: Possibilities and Impossibilities\nof a Modal Interpretation</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Vermaas, P. and D. Dieks, 1995, “The modal interpretation of\nquantum mechanics and its generalization to density operators,”\n<em>Foundations of Physics</em>, 25: 145–158.</li>\n<li>Vink, J., 1993, “Quantum mechanics in terms of discrete\nbeables,” <em>Physical Review A</em>, 48: 1808–1818.</li>\n<li>Zurek, W. H., 1981, “Pointer basis of quantum apparatus:\ninto what mixtures does the wave packet collapse?,” <em>Physical\nReview D</em>, 24: 1516–1525.</li>\n<li>–––, 2003, “Decoherence, einselection, and\nthe quantum origins of the classical,” <em>Reviews of Modern\nPhysics</em>, 75: 715–776.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "quantum mechanics",
            "quantum mechanics: Bohmian mechanics",
            "quantum mechanics: Everettian",
            "quantum mechanics: Kochen-Specker theorem",
            "quantum mechanics: many-worlds interpretation of",
            "quantum mechanics: relational",
            "quantum mechanics: the role of decoherence in",
            "quantum theory: philosophical issues in",
            "quantum theory: the Einstein-Podolsky-Rosen argument in"
        ],
        "entry_link": [
            {
                "../qm/": "quantum mechanics"
            },
            {
                "../qm-bohm/": "quantum mechanics: Bohmian mechanics"
            },
            {
                "../qm-everett/": "quantum mechanics: Everettian"
            },
            {
                "../kochen-specker/": "quantum mechanics: Kochen-Specker theorem"
            },
            {
                "../qm-manyworlds/": "quantum mechanics: many-worlds interpretation of"
            },
            {
                "../qm-relational/": "quantum mechanics: relational"
            },
            {
                "../qm-decoherence/": "quantum mechanics: the role of decoherence in"
            },
            {
                "../qt-issues/": "quantum theory: philosophical issues in"
            },
            {
                "../qt-epr/": "quantum theory: the Einstein-Podolsky-Rosen argument in"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=qm-modal\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/qm-modal/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=qm-modal&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/qm-modal/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=qm-modal": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/qm-modal/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=qm-modal&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/qm-modal/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "French, S., 2020, \n“<a href=\"http://philsci-archive.pitt.edu/id/eprint/16921\" target=\"other\">What is this thing called structure? (Rummaging in the toolbox of metaphysics for an answer)</a>,” unpublished manuscript, PhiSci Archives.",
            "Terekhovich, V., 2019, \n“<a href=\"https://arxiv.org/abs/1909.10046v1\" target=\"other\">Modal approaches in metaphysics and quantum mechanics</a>,” manuscript at arXiv.org. Published in Russian in <em>Metaphysics</em>, 2015, 1(15): 129–152."
        ],
        "listed_links": [
            {
                "http://philsci-archive.pitt.edu/id/eprint/16921": "What is this thing called structure? (Rummaging in the toolbox of metaphysics for an answer)"
            },
            {
                "https://arxiv.org/abs/1909.10046v1": "Modal approaches in metaphysics and quantum mechanics"
            }
        ]
    }
}