{
    "url": "qualia-inverted",
    "title": "Inverted Qualia",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Alex Byrne\n<a",
        "author_links": [
            {
                "http://web.mit.edu/philosophy/byrne.html": "Alex Byrne"
            },
            {
                "mailto:abyrne%40mit%2eedu": "abyrne@mit.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://web.mit.edu/philosophy/byrne.html\" target=\"other\">Alex Byrne</a>\n&lt;<a href=\"mailto:abyrne%40mit%2eedu\"><em>abyrne<abbr title=\" at \">@</abbr>mit<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Nov 10, 2004",
        "substantive revision Wed Aug 26, 2020"
    ],
    "preamble": "\n\n\nQualia inversion thought experiments are ubiquitous in contemporary\nphilosophy of mind (largely due to the influence of Shoemaker 1982 and\nBlock 1990). The most popular kind is one or another variant of Locke’s\nhypothetical case of “spectrum inversion”, in which\nstrawberries and ripe tomatoes produce visual experiences of the sort\nthat are actually produced by grass and cucumbers, grass and cucumbers\nproduce experiences of the sort that are actually produced by\nstrawberries and ripe tomatoes, and so on. This entry surveys the main\nphilosophical applications of what Dennett has called “one of\nphilosophy’s most virulent memes” (1991, 389).\n\n\nSection 1 explains what “qualia” are supposed to be.\nSection 2 describes the many different sorts of “inverted\nqualia” (specifically, “inverted spectrum”) thought\nexperiments, including a close cousin that does not involve inversion.\nSection 3 discusses the major philosophical arguments that appeal to\nspectrum inversion.\n\n\nThis article is long and goes into intricate details that some readers\nwill wish to ignore. Those wanting a shorter introduction should read\nsection 1 (skipping subsection 1.1), section 2 (subsections 2.1, 2.2,\n2.3), and subsection 3.1. (Another shorter introduction is Ross 2020.)\nThose new to the topic should first read the entry on\n qualia.\n",
    "toc": [
        {
            "#Qua": "1. Qualia"
        },
        {
            "#OthUseQua": "1.1 Other uses of ‘qualia’"
        },
        {
            "#InvQuaSce": "2. Inverted qualia scenarios"
        },
        {
            "#SimInvQuaSce": "2.1 A Simple Inverted Qualia Scenario"
        },
        {
            "#LocInvSpeSce": "2.2 Locke’s Inverted Spectrum Scenario"
        },
        {
            "#OthInvSpeSce": "2.3 Other Inverted Spectrum Scenarios"
        },
        {
            "#BehUndSce": "2.3.1 Behaviorally Undetectable Scenarios"
        },
        {
            "#IntIntSce": "2.3.2 Intrapersonal and Interpersonal Scenarios"
        },
        {
            "#InvEar": "2.3.3 Inverted Earth"
        },
        {
            "#ShiQua": "2.4 Shifted Qualia"
        },
        {
            "#SpeInvArg": "3. Spectrum Inversion in an Argument…"
        },
        {
            "#HAgBehFunPhy": "3.1 …Against Behaviorism, Functionalism, and Physicalism"
        },
        {
            "#HAgRep": "3.2 …Against Representationalism"
        },
        {
            "#HFoAppPro": "3.3 …For Appearance Properties"
        },
        {
            "#HFoModPre": "3.4 …For Modes of Presentation"
        },
        {
            "#HFoRel": "3.5 …For Relativism"
        },
        {
            "#HFoSkeAboOthMin": "3.6 …For Skepticism About Others’ Minds"
        },
        {
            "#HFoExpGap": "3.7 …For the Explanatory Gap"
        },
        {
            "#HFoIneQua": "3.8 …For the Ineffability of Qualia"
        },
        {
            "#ForIncConExtRepQuaInt": "3.9 ...For the Inconsistency of Content-Externalism, Representationalism, and Qualia-Internalism"
        },
        {
            "#SumReqFeaInvSpeSce": "3.10 Summary: Required Features of Inverted Spectrum Scenarios"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Qualia\n\n\nQualia (singular ‘quale’), in a common modern usage, are\nproperties of experiences that type them in phenomenological respects.\nImagine seeing three colored patches against a neutral background in\ngood light, one after the other. In particular, imagine seeing a\nvermilion patch, then a crimson patch, and finally a turquoise patch.\n(Those with poor imaginations may consult Figure 1.)\n\n\nFigure 1:\nvermilion, crimson, and turquoise patches\n\n\n\nThree experiences of the imagined sort differ in their\nphenomenology, or in “what it’s like” to undergo them. What\nit’s like to see the crimson patch is not the same as what it’s like to\nsee the turquoise patch, for example. Further—assuming you have\nnormal color vision—seeing the crimson patch is more similar,\nin phenomenological respects, to seeing the vermilion patch than it is\nto seeing the turquoise patch.\n\n\nThus your experience of the crimson patch has a quale (call it\n‘\\(Q_{C}\\)’) that your experiences of\nthe vermilion and turquoise patches lack. Your experience of the\nvermilion patch has a quale \\((Q_{V})\\) that your\nexperiences of the crimson and turquoise patches lack; likewise, your\nexperience of the turquoise patch has quale\n\\(Q_{T}\\). What about an experience of all three\npatches, as when viewing the whole of figure 1? Which of\n\\(Q_{C}, Q_{V}\\), and\n\\(Q_{T}\\) does that have? The answer usually\nimplicit in the literature is ‘All three’ (as opposed to\n ‘None’).[1]\n This is probably the more natural way of\nunderstanding qualia terminology, given the explanation so far, and is\nthe one adopted in this article.\n\n\nIn addition to the quale \\(Q_{C}\\), your\nexperience of the crimson patch has quale\n\\(Q_{R}\\) which it shares with your experiences\nof the vermilion patch, blood, fire trucks, strawberries, ripe\ntomatoes, and so on. Your experience of the turquoise patch (in\nisolation) lacks \\(Q_{R}\\).\n\n\nIt must be emphasized that\n‘\\(Q_{C}\\)’, for example, is not\nexplicitly defined using color terminology.\n‘\\(Q_{C}\\)’ is not stipulated to be\nan abbreviation of ‘the property of being an experience of\nsomething’s looking crimson’, for instance. Rather, the role of\ndescriptions like the latter is simply to draw attention to the salient\nproperty that ‘\\(Q_{C}\\)’ is supposed\nto be a name for, in much the same way that one might introduce the\nunfamiliar name ‘Eugene Cernan’ by saying that it refers to\nthe last man to walk on the moon. In the jargon, the description\n‘the property of being an experience of something’s looking\ncrimson’ can be used to fix the reference of\n‘\\(Q_{C}\\)’. (See the entry on\n reference.)\n\n\nQualia terminology can be introduced in a similar manner for other\nsorts of visual experiences (seeing differently shaped patches, for\ninstance), for other perceptual modalities, for bodily sensations, and\nfor thoughts, imagery, emotions, and so forth. It is controversial\nwhether some of these mental events/states have qualia—in\nparticular, episodes of conscious thought, at least some of which seem\ndevoid of\n phenomenology.[2]\n\n\nOne might wonder why some special terminology is required.\nAdmittedly ‘\\(Q_{R}\\)’, for example,\nis not defined in terms of ‘red’, but isn’t\n\\(Q_{R}\\) in fact the property of being an\nexperience of something’s looking\n red?[3]\n And if it is, why\nintroduce another name? However, as discussed later (subsection 3.2),\nthere is an argument against this identification.\n1.1 Other uses of ‘qualia’\n\n\n‘Qualia’ is an especially confusing piece of\nterminology, even by the standards of the profession that brought us\n‘realism’. In the sense just explained, the claim that\nexperiences have qualia seems fairly\n harmless.[4]\n The innocent student\nmight well be puzzled, then, to learn of Frank Jackson’s controversial\n“knowledge argument for qualia” (Jackson 1982), and\nDennett’s attempt to dismiss qualia as a philosopher’s invention\n(Dennett 1988). But on closer examination, much of this apparent\ndisagreement is merely terminological. On Jackson’s use of the term,\nqualia are properties of mental states “which no amount of purely\nphysical information includes” (1982, 273); on Dennett’s, they\nare “ineffable”, “intrinsic”,\n“private”, and “directly or immediately apprehensible\nin consciousness” (1988, 229; cf. Tye 2002, 447). And none of\nthis is part of the official explanation of ‘qualia’ in the\nprevious section.\n\n\nAnother use of ‘qualia’ that is particularly important\nto distinguish from the present one is Dretske’s. According to Dretske,\nqualia include colors—properties of objects like\ntomatoes, not experiences. This is because he explains qualia as\n“the ways objects phenomenally appear or seem” (1995, 73),\nand red is one way that tomatoes\n appear.[5]\n Qualia, on Dretske’s\nuse, are properties of objects of experiences; in this article\nqualia are properties of experiences.\n\n\nThe American pragmatist C. I. Lewis introduced ‘qualia’\ninto contemporary\n philosophy.[6]\n Qualia, he explains in Mind and the\nWorld Order, are “recognizable qualitative characters of the\ngiven” (1929, 121). According to Lewis, what is\n“given” in experience are sense-data (although Lewis\nhimself preferred other terminology: see 55–7), not objects like\ntomatoes. Goodman’s well-known discussion of qualia in The\nStructure of Appearance (1951) follows Lewis’s use. Among\nJackson, Dennett, and Dretske, Dretske’s use of ‘qualia’ is\nthe closest to Lewis’s. Restricting attention to the case of veridical\nperception, we may think of Dretske as basically agreeing with Lewis\nabout the characterization of qualia, but disagreeing with Lewis about\nthe given. When one sees that a tomato is red, according to Lewis a\nsense-datum, not the tomato, is given; according to Dretske what is\ngiven is the tomato. So, since a “recognizable qualitative\ncharacter” of the tomato is its color, Dretske thinks that colors\nare examples of\n qualia.[7]\n2. Inverted qualia scenarios\n\n\nLet us say that a scenario is a (more-or-less detailed)\nstory, which may be possible or impossible. (So, for example, there is\na scenario in which someone squares the circle.) Corresponding to a\nscenario is what we can call a hypothesis: that the scenario\nis possible. So, for example, the hypothesis corresponding to\na circle-squaring scenario is false. There are a variety of\n“inverted qualia” scenarios in the literature—almost \nalways involving color perception—whose corresponding\nhypotheses differ in plausibility. These hypotheses are used as\npremises in a number of philosophical arguments, discussed in section 3\nbelow.\n2.1 A Simple Inverted Qualia Scenario\n\n\nConsider the hue circle in figure 2, taken from the Natural Color\nSystem color space, which is organized around the four hues red, green,\nblue, and\n yellow.[8]\n These are the unique hues:\nthey have shades that are not perceptual mixtures of any other hue. For\nexample, there is a shade of green that is neither bluish nor\nyellowish. The other hues are binary: all of their shades are\nperceptual mixtures of two unique hues. For example, every shade of\npurple is bluish and reddish. The four unique hues—yellow, red,\nblue, green—come in two opponent pairs: red-green and\nblue-yellow. Red is opposed to green in the sense that there are no\nreddish-greens or greenish-reds; likewise there are no bluish-yellows\nor yellowish-blues. The unique hues are equally spaced around the NCS\ncircle, and the other hues are spaced according to their perceptible\nproportion of the unique hues. So, for example, the orange patch\nequidistant from the unique yellow pole and unique red pole is equally\nsimilar to both.\n\n\nFigure 2:\nNCS hue circle[9]\n\n\n\nLet \\(I\\) be the function that takes each shade to its opposing\nshade, thus rotating the hue circle 180°. \\(I\\) maps reds to\ngreens, blues to yellows, bluish-greens to yellowish-reds, and so on\n(see figure 3).\n\n\nFigure 3:\nthe function \\(I\\)\n\n\n\nIntroduce another perceiver, Invert (you are Nonvert). Imagine you\nare looking at scene \\(S\\): an arrangement of some fruits (see the\nleft-hand part of figure 4). Now take the apparent hues of objects in\n\\(S\\), and transform them using the function \\(I\\). Use this\ntransformation to create a new scene \\(S_{I}\\), exactly\nlike the old scene \\(S\\) except that it looks to have differently\ncolored “inverted” fruits (etc.). That is, if a banana\noriginally looks to have hue \\(h\\), in \\(S_{I}\\) it\nlooks to have hue \\(I(h)\\). (See the right-hand part of\nfigure 4; notice that the greens in \\(S\\) are rather yellowish,\nand hence get mapped to bluish-reds.) Then one simple inverted qualia\nscenario is this: what it’s like for Invert to look at \\(S\\) is\nexactly the same as what it’s like for Nonvert (i.e., you) to look at\n\\(S_{I}\\), and similarly for all other scenes that Invert\nencounters. According to this scenario, if you look at the right-hand\npart of figure 4, your experience is phenomenologically the same as\nInvert’s experience when she looks at the left-hand part of figure 4.\nIn qualia terminology: if an object \\(O_{1}\\) looks to\nhave hue \\(h\\) to Nonvert (with \\(Q\\) being the corresponding\nquale of her experience), and \\(O_{2}\\) looks to have hue\n\\(I(h)\\) (with corresponding quale \\(Q^*\\)), then\nInvert’s experience of \\(O_{1}\\) has quale \\(Q^*\\) and\nher experience of \\(O_{2}\\) has quale \\(Q\\). In this\nsense Invert’s qualia are ‘inverted’ with respect to\nNonvert’s.\n\n\nFigure 4:\n180° hue inversion\n\n\n\nBecause the example concerns color qualia, this sort of inverted\nqualia scenario is usually described as a case of “spectrum\ninversion”. (Note that the 180° inversion takes unique hues\nto unique hues, and binary hues to binary hues. An inversion scenario\nproduced by a rotation of 45° would take the unique hue red to the\nbinary hue orange; and so presumably would be behaviorally detectable:\nsee subsection 2.3.1 below.)\n\n\nPhilosophy is stuck with the terminology of ‘spectrum\ninversion’, but it is potentially\n misleading.[10]\n First, a\nspectrum inversion scenario sounds like one which inverts either the\nspectrum or the colors of objects, but it actually inverts neither. In\na typical spectrum inversion scenario, the spectral band 650–700nm\nremains red, and lemons remain\n yellow.[11]\n\n\nSecond, even when properly taken as an inversion of experiences, one\nmight suppose that the “spectrum inversion” function\ncorresponds to flipping the spectrum over. That is, using the\ntraditional names for the spectral bands, one might suppose the\nfunction maps red to violet, orange to indigo, yellow to blue, green to\ngreen, blue to yellow, indigo to orange, and violet to red. However,\nthis is not the usual sort of inversion scenario (red is not mapped to\ngreen, for example). Further, this function is not defined for all\nhues. Many hues—in particular, a large range of\n“extra-spectral” purples—are not found in the\nspectrum.\n2.2 Locke’s Inverted Spectrum Scenario\n\n\nLocke appears to have been the first to formulate explicitly an\ninverted spectrum scenario. (An immediate precursor is \nMalebranche.[12]) \nIn the chapter of the Essay titled\nOf True and False Ideas, Locke writes:\nNeither would it carry any Imputation of Falshood\nto our simple Ideas, \\(if\\) by the different Structure of\nour Organs, it were so ordered, That the same Object should produce\nin several Men’s Minds different Ideas at the same time;\nv.g. if the Idea, that a Violet produced in\none Man’s Mind by his Eyes, were the same that a Marigold\nproduces in another Man’s, and vice versâ. For since\nthis could never be known: because one Man’s Mind could not pass into\nanother Man’s Body, to perceive, what Appearances were produced by\nthose Organs; neither the Ideas hereby, nor the Names, would\nbe at all confounded, or any Falshood be in either. For all\nThings, that had the Texture of a Violet, producing constantly\nthe Idea, which he called Blue, and those which had\nthe Texture of a Marigold, producing constantly the\nIdea, which he as constantly called Yellow, whatever\nthose Appearances were in his Mind; he would be able as regularly to\ndistinguish Things for his Use by those Appearances, and understand,\nand signify those distinctions, marked by the Names Blue and\nYellow, as if the Appearances, or Ideas in his Mind,\nreceived from those two Flowers, were exactly the same, with the\nIdeas in other Men’s Minds. (1689/1975, II, xxxii,\n15)\n\n\nLocke’s description of this inverted spectrum scenario is laden with\nhis own commitment to “Ideas”, which (on one\ninterpretation) are sense-data, some of which possess both color and\n shape.[13]\n On this view, spectrum inversion is a case\nof “sense-datum inversion”: when Invert looks at a violet\nshe becomes acquainted with the kind of sense-datum Nonvert is\nacquainted with when he looks at a marigold. Setting this tendentious\ntheoretical gloss aside, Locke’s scenario has three notable features.\nFirst, it is a case of spectrum inversion from birth. Second,\nit is a case of inversion within the same linguistic\ncommunity. Third, it is (or is naturally read as being) a case in\nwhich Invert and Nonvert are behaviorally alike—a\nbehaviorally undetectable spectrum inversion.\n\n\nLocke does not fill in the details of his scenario, so it is left\nunclear whether, for example, the leaves of marigolds and violets would\nproduce “Red Ideas” in the mind of the inverted subject.\nBut suppose, reasonably enough, that Locke’s scenario involved a\nrotation of the hue circle. Locke evidently thought that the hypothesis\ncorresponding to his scenario was true: that his scenario is possible.\nWas he right?\n\n\nIf we assume that Invert is otherwise like a normal human perceiver,\nthen a major asymmetry in color space shows that Locke was incorrect.\nHue (red, green, bluish-red, etc.) is not the only perceptually salient\ndimension along which colors can vary: there are (usually taken to be)\ntwo other dimensions, saturation and\n lightness.[14]\n A color is saturated to the extent to\nwhich its hue is intense or vivid: pastels are desaturated, and\nachromatic colors (blacks, whites, and grays) have no saturation.\nColors become lighter as they become less grayish or blackened.\nArranging the colors along these three dimensions produces a color\nsolid, an example of which is shown in figure 5:\n\n\nFigure 5:\n3D color space: the Munsell color solid[15]\n\n\n\n\nThe lightness dimension corresponds to the central vertical axis,\nwith white at the top. The hue and saturation dimensions correspond,\nrespectively, to the angle around the vertical axis, and to the\ndistance from it. Thus the shades of maximum saturation are on the\noutside of the solid. Notice that the yellows have their maximum\nsaturation at higher levels of lightness than the reds and the blues.\nSo, assuming that Invert’s judgments of the relations between colors\nare—modulo the inversion—normal, a possible Lockean\n180° hue rotation scenario would be behaviorally detectable. Invert\nwould judge the maximally saturated colors she calls ‘shades of\nblue’ to be lighter than the maximally saturated colors she calls\n‘shades of yellow’. Further, there are more distinguishable\nhue steps between blue and red than there are between yellow and \ngreen—a fact that is reflected in the Munsell space, whose hue circle\nhas five hues equally spaced: red, yellow, green, blue, purple.\n(Contrast the NCS space mentioned in the previous subsection.) Hence\nthe Lockean inversion function \\(I\\), assuming it is defined on\nall hues, would map some distinct hues (in particular, some bluish\nreds) to the same hue (in particular, the same yellowish green). The\nrange of \\(I\\) would therefore contain fewer hues than its domain.\nInvert would not be able to distinguish some stimuli (those she calls\n‘bluish red’) that Nonvert could tell apart, and so again\nthe inversion would be behaviorally detectable.\n2.3 Other Inverted Spectrum Scenarios\n2.3.1 Behaviorally Undetectable Scenarios\n\n\nAs discussed in section 3 below, inverted spectrum scenarios have a\nwide range of philosophical uses, and come in a correspondingly wide\nrange of flavors. It is not always required, for example, that Invert\nand Nonvert are behaviorally alike. But suppose that a behaviorally\nundetectable scenario is needed, and moreover one that is genuinely\npossible. With the assumption that Invert is otherwise normal, we just\nsaw that Locke’s behaviorally undetectable scenario is not possible.\nWithout relaxing the simple assumption about Invert, can we find one\nthat is?\n\n\nSuppose we stay with the full range of normal human color\nexperience, and so with the color solid as illustrated in figure 5. The\ndiscussion of Locke’s scenario shows that a scenario corresponding to a\nrotation of the color solid around the lightness axis should be\navoided. However, as Palmer points out (1999a, 926), there are three\ninversion scenarios that at least solve the problem posed by the light\nand saturated yellows. These three scenarios correspond to,\nrespectively, a reversal of the red-green axis; a reversal of the\nblue-yellow and black-white axes; and the previous two reversals taken\ntogether: a reversal of the red-green, blue-yellow, and black-white\naxes. These three scenarios are (approximately) illustrated in Figure 6\nbelow.\n\n\nFigure 6:\nthree inversions: red-green (top right); blue-yellow/black-white (bottom left);\nred-green/blue-yellow/black-white (bottom right)\n\n\n\nAs noted in the previous subsection, there are more perceptually\ndistinguishable shades between red and blue than there are between\ngreen and yellow, which would make red-green inversion behaviorally\n detectable.[16]\n And there are yet further asymmetries.\nDark yellow is brown (qualitatively different from yellow), whereas\ndark blue is blue (see figure 6). Similarly, desaturated bluish-red is\npink (qualitatively different from saturated bluish-red), whereas\ndesaturated greenish-yellow is similar to saturated greenish-yellow.\nAgain, red is a “warm” color, whereas blue is\n“cool”—and perhaps this is not a matter of learned\nassociations with temperature (see Hardin 1997, 297–7). In any event,\nthere is clearly scope to resist the claim that one of Palmer’s three\ninversions would be behaviorally\n undetectable.[17]\n\n\nFaced with these difficulties, philosophers seeking a clearly\npossible behaviorally undetectable inversion scenario have either\nconsidered a perceiver with limited color vision (for instance\nblack-white vision), or else a perceiver with alien/quasi color vision,\nwhere any alien/quasi color space that represents perceptible\nsimilarities and differences is stipulated to have appropriate\nsymmetries. Here is Shoemaker trying the first strategy:\nBut even if our color experience is not in fact such that a\nmapping of this [behaviorally undetectable] sort is possible, it seems\nto me conceivable that it might have been—and that is what\nmatters for our present philosophical purposes. For example, I think we\nknow well enough what it would be like to see the world\nnonchromatically, i.e., in black, white, and the various shades of \ngrey—for we frequently do see it in this way in photographs, moving\npictures, and television. And there is an obvious mapping of the\nnonchromatic shades onto each other which satisfies the conditions for\ninversion. In the discussion that follows I shall assume, for\nconvenience, that such a mapping is possible for the full range of\ncolors—but I do not think that anything essential turns on\nwhether this assumption is correct. (Shoemaker 1975a, 196; note\nomitted).\n\n\nFor some responses, see Tye 1995, 205, and Hilbert and Kalderon 2000,\n206. “Black-white” inversion is also discussed by Clark\n(1996) (Other Internet Resources), Myin (2001) and Broackes (2007), and was briefly\nmentioned by Wittgenstein (1977,\n III-84).[18]\n For a short autobiography of a complete\nachromat (someone with only black-white rod vision) who is also a\nvision scientist, see Nordby 1996 (Other Internet\n Resources).[19]\n\n\nHere is Block trying the second strategy:\n[D]o the empirical issues really matter for the challenge\nthat the possibility of an inverted spectrum poses for functionalism?\nMy answer is: only in a subtle and indirect way. For if there could\nbe creatures who have color experience or at least visual\nexperience for whom the relevant empirical points do not apply, then\nfunctionalism is refuted even if human spectra cannot be\ninverted. For example, perhaps it is a consequence of the human genome\nthat humans tend to be unwilling to give a name to light green, even\nthough they are willing to give a name to light red\n(‘pink’). Still, there could be people whose\nvisual experience is similar if not identical to ours who find it\nequally natural to give names to light green as to light red. (Perhaps\nwe could even genetically engineer humans to become so willing.) (Block\n1999, 946; cf. Shoemaker 1982, 336–8, and Levine 1991,\n34–6.)\n\n\nFor some doubts about the second strategy, see Hardin 1997,\n299–300.\n\n\nHilbert and Kalderon argue that “every possible quality space\nmust be asymmetrical” (2000, 204) (that is, must lack\nany symmetries); if so, both strategies are misguided (see also Dennett\n1991, 389–98; 1993, 927; 1994).\n2.3.2 Intrapersonal and Interpersonal Scenarios\n\n\nIf a behaviorally undetectable spectrum inversion scenario is\npossible, how do we know it does not actually obtain? There is a\ntemptation to say that we do not know—moreover, that we cannot\nknow. (For more discussion, see subsection 3.6 below.) And if we cannot\nverify or falsify the claim that such a scenario does not obtain, then\naccording to the verificationist theory of meaning held by the logical\npositivists (Ayer 1959) the scenario is meaningless. Indeed, the\nlogical positivists sometimes gave spectrum inversion as an example of\nan unverifiable claim (Schlick 1932/3, 93, quoted in Shoemaker 1982,\n339; see also Ayer 1936, 173–4, and Wittgenstein 1958, §272).\n\n\nThe allegedly meaningless scenario is a case of\ninterpersonal (or intersubjective) spectrum inversion: Invert\nis spectrally inverted with respect to another person, Nonvert. But\nthere is another sort of inversion scenario, in which a single person’s\nqualia are inverted with respect to her qualia at an earlier time. As\nShoemaker notes (1982, 327), a case of intrapersonal (or\nintrasubjective) spectrum inversion appears to have been first\ndiscussed by Wittgenstein:\nConsider this case: someone says ‘I can’t understand\nit, I see everything red blue today and vice versa.’ We answer\n‘it must look queer!’ He says it does and, e.g., goes on to\nsay how cold the glowing coal looks and how warm the clear (blue) sky.\nI think we should under these or similar circumstances be inclined to\nsay that he saw red what we saw blue. And again we should say that we\nknow that he means by the words ‘blue’ and\n‘red’ what we do as he has always used them as we do.\n(Wittgenstein 1968, 284; quoted in Shoemaker 1982,\n 327–8)[20]\n\n\nAlthough Wittgenstein seems to have thought that a behaviorally\nundetectable interpersonal spectrum inversion scenario is not possible\n(arguably for verificationist reasons), Shoemaker claims that once the\npossibility of a Wittgensteinian intrapersonal inversion is\ngranted, there is an inexorable slide to the possibility of a\nbehaviorally undetectable interpersonal scenario:\n…if the color experience of a person can differ from\nthat of others at some point during his career, it should be possible\nfor such a difference to exist throughout a person’s career. But if\nthis a possibility, then it does seem perfectly coherent to suppose,\nand perfectly compatible with all the behavioral evidence we have about\nthe experiences of others, that, in Wittgenstein’s words, “one\nsection of mankind has one sensation of red and another section\nanother.” (Shoemaker 1982,\n 329)[21]\n\n\nWe can think of this sort of argument as proceeding in four steps\n(see Block 1990, Shoemaker 1996b):\n\nStep 1: this is possible: an\n“overnight” intrapersonal inversion, as in the quotation\nfrom Wittgenstein.\nStep 2: if (Step 1), then this is possible: an\n“overnight” inversion followed by semantic adaptation\n(applying ‘red’ to glowing coal, ‘blue’ to the\nsky, etc.), but with memory of one’s experiences before the inversion.\nThat is, one (re)learns to use color terminology like a normal person,\nwhile remembering that one’s experiences of glowing coal (etc.) used to\nbe very different. The inversion remains detectable, because one\nasserts, for example, that one’s experiences have drastically\nchanged.\nStep 3: if (Step 2), then this is possible: an\n“overnight” inversion followed by semantic adaptation,\nfollowed by amnesia about one’s past experiences, with the result that\none’s pre- and post- inversion behavioral dispositions are the same. At\nthis step, one’s behavior is just as it would have been if one had\nsimply been stricken with amnesia, with no prior inversion.\nStep 4: if (Step 3), then this is possible: a\n“from birth” behaviorally undetectable\ninterpersonal inversion scenario.\n\n\n\nSimilar arguments starting from a Wittgensteinian intrapersonal\nscenario can be given for the other kinds of interpersonal inversion\nhypotheses discussed in section 3 below.\n\n\nOne might think that at least step 4 is unproblematic. However,\naccording to the “Frege-Schlick view” (Shoemaker 1982,\n339), interpersonal comparisons of qualia (unlike\nintrapersonal comparisons) do not make sense. The\nFrege-Schlick view could be supported on verificationist grounds; for\na more interesting line of defense, see Stalnaker 1999, 2006, and\nShoemaker 2006b and Block 2007, 103–7, for discussion. Since it makes\nperfect sense (and indeed is often true) to say that tomatoes look red\nto most people, a proponent of the Frege-Schlick view must deny, for\nexample, that \\(Q_{R}\\) is the property of being\nan experience of something’s looking red (see section 1 above and\nStalnaker 1999, 225).\n2.3.3 Inverted Earth\n\n\nAsymmetries in color space pose problems for step 3 of the previous\nargument. But—especially for those with verificationist\nsympathies—step 3 is problematic even if these concerns are\nwaived. Why be so sure that the “total adaptation”\n(semantic adaptation plus amnesia) doesn’t reinvert the qualia? After\nall, if you imagine being the subject yourself, after the period of\namnesia you have no sense that anything is amiss—so perhaps\nnothing is. Similar doubts can be raised about step 2: suppose you use\ncolor terminology exactly as you did before the step 1 \ninversion—that is, spontaneously on the basis of how things \nlook—but you seem to recall that your past experiences were radically\ndifferent. Would you be confident that you hadn’t misremembered your\npast experiences? (See Dennett 1988; 1991, Ch. 12; 1993; 1994; and Rey\n1992.)\n\n\nAlthough Block thinks “that these criticisms can be defeated\non their own terms” (1990, 61), his “Inverted Earth”\nscenario is designed to sidestep them. (See Block 1990, 1996a,\n 2003.)[22]\n Instead of considering an\n“overnight” inversion and the consequent confusion,\nsemantic adaptation and amnesia, your eyes are fitted with “color\ninverting lenses” and you are transported to another \nplanet—Inverted Earth. This is a place just like Earth except that\neach object has “the complementary color of [its counterpart] on\nEarth. The sky is yellow, grass is red, fire hydrants are green,\netc.” (1990, 60). The inhabitants also speak Color Inverted\nEnglish (‘red’ means green, ‘blue’\nmeans yellow, etc.). The right hand part of figure 4 above\ndisplays a photograph of fruits taken on Inverted Earth with an\nordinary Earthly camera. (Despite the yellow sky, the illumination on\nInverted Earth is the same as it is on Earth. Note that achromatic\ncolors are not inverted—on Inverted Earth snow is white and\ncoal is\n black.)[23]\n Because of the inverting lenses—and \nignoring complications such as those mentioned in subsection \n2.3.1—when you arrive on Inverted Earth you notice no visible change.\nYour experience when you look at an arrangement of fruits on Inverted\nEarth is phenomenologically the same as your previous experience of the\ncounterpart arrangement on Earth (see the left hand part of figure 4),\nand conversation with the locals proceeds just as smoothly as it did\nback on Earth. This scenario is therefore the converse of typical\ninverted spectrum scenarios: instead of keeping the environment fixed\nand varying the internal constitution of the subject, Inverted Earth\nvaries the environment and (due to the inverting lenses) keeps the\nsubject’s internal constitution fixed. Block uses Inverted Earth in an\nargument against functionalism and representationalism (see subsections\n3.1 and 3.2\n below).[24]\n2.4 Shifted Qualia\n\n\nThe qualia inversion scenarios discussed so far are merely\nhypothetical—more cautiously, we do not know whether any of\nthem\n obtain.[25]\n There are, however, “shifted”\nqualia scenarios that actually obtain. And, in fact, many of\nthe philosophical arguments that appeal to the possibility of an\ninversion scenario can make do instead by appealing to the actual\nshifted qualia scenario, hence avoiding potentially controversial\nclaims about possibility.\n\n\nThe shifted qualia scenario that is usually discussed \nconcerns—unsurprisingly—color vision. There is a substantial\namount of variation between people classified as having\n“normal” color vision by standard tests, due to differences\nin the lens of the eye and photoreceptor pigments, among other factors.\nIn one experiment, introduced into the philosophical literature by\nHardin (1993, 79–80), Hurvich et al. (1968) found that the apparent\nlocation of unique green for spectral lights among 50 subjects varied\nfrom 490 to\n 520nm.[26]\n This is a large range: 15nm either side of\nunique green looks distinctly bluish or yellowish. For example, when\nSmith looks at the third patch in figure 7 (in isolation), his\nexperience might have the quale that Jones’s experience has when she\nlooks at the fourth patch in Figure 7, keeping the viewing\ncircumstances fixed. And when Smith looks at the fourth patch, his\nexperience might have the quale that Jones’s experience has when she\nlooks at the fifth patch. Thus—at least over a small\nrange of hues—Jones’s and Smith’s color qualia are\n“shifted” with respect to each other. Accordingly, this\nsort of scenario can be described as a case of “shifted spectra”\n(Block 1999). (NB: here we are assuming that the Frege-Schlick view\nmentioned in subsection 2.3.2 is incorrect.)\n\n\nFigure 7:\nfive patches: yellowish-green to bluish-green\n\n\n\nNotice that if a behaviorally undetectable scenario is wanted, an\nactual case of shifted spectra will not fit the bill.\n3. Spectrum Inversion in an Argument…\n\n\nInversion scenarios—in particular, spectrum \ninversion—turn up in a wide range of philosophical arguments, which we\nare now in a position to examine.\n3.1 …Against Behaviorism, Functionalism, and Physicalism\n\nBehaviorism in the philosophy of mind is the view that the\nmental is nothing over and above behavior (including dispositions to\nbehave). Any version of behaviorism implies that the mental supervenes\non behavior. That is: necessarily, two creatures who are behaviorally\nalike are also mentally alike. Likewise, any version of\nfunctionalism or physicalism implies that the mental\nsupervenes on, respectively, functional organization and physical\nmakeup. For the purposes of this subsection, it is not necessary to\nget into the details of these theories. However, two points should be\nnoted. First, it should not be assumed that either behavior,\nfunctional organization, or physical makeup is an intrinsic \nmatter—the relevant sorts of behavioral, functional, and physical\nproperties may be extrinsic.\n In other words,\nperfect duplicates may differ in behavioral, functional, or physical\n respects.[27]\n Second, as these theories are usually\nunderstood, difference in behavioral respects implies difference in\nfunctional respects, which in turn implies difference in physical\nrespects; none of the converse implications\n holds.[28]\n So the three\nsupervenience theses just mentioned are related as follows: the\nbehaviorist supervenience thesis implies the functionalist thesis,\nwhich in turn implies the physicalist thesis.\n\n\nIf some behaviorally undetectable inverted spectrum hypothesis is\ncorrect, then there could be a pair of creatures who are behaviorally\nalike but mentally different: Invert and Nonvert are in different\nmental states when they each look at a tomato, and are behaviorally\nalike. Hence, if the inverted spectrum hypothesis is correct,\nbehaviorism is false. This gives us an argument against\nbehaviorism:\n\nArgument Aa\n\nP1a.\nThe following spectrum inversion scenario is possible: Invert\nand Nonvert are behaviorally alike, and are both looking at a\n tomato.[29]\n\nSince P1a implies that the mental does not supervene on\nbehavior:\n\nCa.\n\nBehaviorism is false.\n\n\n\nSince behaviorism is not a popular position these days, this\napplication of an inverted qualia scenario is perhaps not so\ninteresting. And given the complications discussed in subsection 2.3.1,\nthere is even room for a behaviorist to resist. However, of\nconsiderably more interest are similar arguments against functionalism\n(and physicalism). Block and Fodor (1972), who invented the terminology\nof ‘inverted qualia’, were the first to formulate an\ninverted spectrum argument against functionalism, specifically Turing\nmachine functionalism as defended in Putnam\n 1967.[30]\n Ignoring the details\nof particular functionalisms, the argument is exactly parallel to the\none against behaviorism. (Similar remarks go for the inverted spectrum\nargument against physicalism.) According to functionalism, mental\nstates are functional states: states defined by their causal role with\nrespect to inputs, outputs, and other states. So, according to\nfunctionalism, necessarily, two creatures who are functionally alike\nare also mentally alike. In order to complete the argument, an\nappropriate inverted spectrum hypothesis must be established, where\nInvert and Nonvert are functional duplicates.\n\n\nThe anti-functionalist analogue of argument Aa is:\n\nArgument Ab\n\nP1b\n\nThe following spectrum inversion scenario is possible: Invert\nand Nonvert are functionally alike, and are both looking at a\ntomato.\n\n\nSince P1b implies that the mental does not supervene on functional\norganization:\n\nCb.\n\nFunctionalism is false.\n\n\n\nThe possibility of a behaviorally undetectable inversion scenario\n(P1a) can be motivated by appeal to the sorts of considerations\ndiscussed in 2.3.1 above. However, in order to refute functionalism a\nstronger inversion hypothesis (P1b) is needed. As Block and Fodor point\nout, functionalism allows us to deny that “two organisms\nare in the same psychological state whenever their behaviors and/or\nbehavioral dispositions are identical” (1972, 86), hence avoiding\nthe stock objections to behaviorism. The functionalist, then, has no\nproblem with behaviorally undetectable inversions. But why should she\nconcede the possibility of a functionally undetectable\ninversion? The question can be made more pointed by observing that (a)\nno one has ever articulated a detailed functionalist theory of any\nmental state, and (b) any realistic version of such a theory would be\nextremely\n complicated.[31]\n In favor of the possibility of a\nfunctionally undetectable inversion, Block and Fodor offer its\n“conceptual coherence”:\nIt seems to us that the standard verificationist\ncounterarguments against the view that the ‘inverted\nspectrum’ [scenario] is conceptually coherent are not persuasive.\nIf this is correct, it looks as though the possibility of qualia\ninversion poses a serious prima facie argument against functionalist\naccounts of the criteria for type identity of psychological states.\n(91)\n\n\nBlock and Fodor’s apparent move from the “conceptual\ncoherence” of the inversion scenario to its possibility can be\nquestioned. Even though one cannot know a priori that not-p (that is, p\nis conceptually coherent), p may yet be impossible. For example, one\ncannot know a priori that gold does not have the atomic number 79, but\nit is a necessary truth that gold has this atomic number. (This sort of\nseparation between conceptual coherence and possibility is not\nuncontroversial, but is commonly\n accepted.[32])\n\n\nIn any case, there are other conceptually coherent scenarios that are\nconsiderably more straightforward than an inverted spectrum scenario,\nfor example a scenario containing a conscious subject and a functional\nduplicate who is not conscious at all (a “zombie”, in the\nphilosophical sense). So if the move from conceptual coherence to\npossibility is in fact legitimate, functionalism may be refuted by a\nsimpler argument that does not have an inversion hypothesis as a\npremise. (Shoemaker is a notable dissenter on this point; he holds\nthat while inverted spectrum scenarios are conceptually coherent,\nzombie scenarios are not. See Shoemaker 1975a, 1981, 1991.)\n\n\nA defender of the utility of an inversion scenario in an argument\nagainst functionalism might reply that the scenario’s possibility does\nnot merely rest on its conceptual coherence. In addition—this\nreply continues—there is a positive “Cartesian\nintuition” that such an inversion scenario is possible (a\n“clear and distinct idea” of the scenario, perhaps), and\nthis is prima facie evidence that it \\(is\\) possible.\n\n\nHowever, Cartesian intuition, just like conceptual coherence, is not\na very discriminating weapon, tending to spread possibility over a wide\nlandscape (cf. Tye 2003, section 4). Cartesian intuition also tends to\ncertify the possibility of scenarios containing zombies, thinking\nrocks, entirely disembodied minds (not even embodied in ectoplasm), and\nso forth—all impossibilities, according to the\nfunctionalist. So, as with conceptual coherence, any inverted spectrum\nargument against functionalism that relies on Cartesian intuitions can\nbe converted into an equally plausible and simpler argument that makes\nno mention of the inverted spectrum.\n\n\nThere is one other defense of the utility of inversion scenarios in\nanti-functionalist arguments, namely that some of them are\nbiologically possible—and hence not as far fetched as\nscenarios containing zombies or thinking rocks. If this is right, then\nspectrum inversion would be of special significance, since we have a\nfirmer grip on possibilities that are closer to home.\n\n\nHere is it is helpful to examine Block’s Inverted Earth argument\nagainst functionalism, which at a superficial glance might not seem to\nstray beyond the constraints of Earthly biology. As we saw in\nsubsection 2.3.3, the Inverted Earth scenario is designed to avoid\ncertain objections to the usual argument from intrapersonal inversion\nhypotheses to interpersonal inversion hypotheses. How is the scenario\nturned into an argument against functionalism?\n\n\nThe brand of functionalism (about qualia) that Block sets out to\nrefute is this:\nAn experience has [\\(Q_{R}\\)] if [and\nonly if] it functions in the right way—if it is caused by red\nthings in the right circumstances, and used in thought about red things\nand action with respect to red things rightly. The functional roles I\nam talking about are what I call ‘long-arm’ roles, roles\nthat include real things in the world as the inputs and outputs. They\nare to be distinguished from the ‘short-arm’ roles that\nfunctionalists sometimes prefer, roles that stop at the skin. (1990,\n58, note\n omitted)[33]\n\n\nBlock then tries to establish that after a suitable period of time\non Inverted Earth, your beliefs and judgments about the colors of\nthings would be correct: like the locals, you would believe\nthat fire hydrants are green, the sky is yellow, and so on:\n[A]ccording to me, after enough time has passed on Inverted\nEarth, your embedding in the physical and linguistic environment of\nInverted Earth would dominate, and so your intentional contents would\nshift so as to be the same as those of the natives. Consider an analogy\n(supplied by Martin Davies): if you had a Margaret Thatcher\nrecognitional capacity before your journey to Inverted Earth, and on\narriving misidentify twin MT as MT, you are mistaken. But eventually\nyour ‘That’s MT’ judgements get to be about twin MT, and so\nbecome right after having started out wrong. If you were [transported]\nat age 15, by the time 50 years have passed, you use ‘red’\nto mean green, just as the natives do. (64)\n\n\n(We can also add that you know that you are on Inverted Earth, and\nmake an effort to speak the local language; see Block 1996a, 42;\n2003.)\n\n\nThis step of the argument appeals to externalism about\nmental content (Putnam 1975, Burge 1979), specifically some sort of\ncausal covariational theory (see the entry\n externalism about mental content).\nPutting the basic idea crudely: after a while on Inverted Earth certain\nof your inner states that on Earth were reliably caused by the presence\nof red things and thereby represented redness will instead be reliably\ncaused by the presence of green things, and thereby will come to\nrepresent greenness.\n\n\nThis gives us an apparent counterexample against the “long\narm” functionalist theory. On Inverted Earth your experiences\nhave the functional role that the functionalist theory says is\nnecessary and sufficient for possessing\n\\(Q_{R}\\): they are “caused by red things in the\nright circumstances, and used in thought about red things and action\nwith respect to red things rightly”. But on Inverted Earth your\nexperiences with this functional role have\n\\(Q_{G}\\), not (or not always)\n\\(Q_{R}\\).\n\n\nIf we insist that the Inverted Earth scenario is constrained by\nactual biology, can it still be maintained that your experiences caused\nby red things on Inverted Earth have the\n\\(Q_{R}\\)-role? That is not clear, even if we\ngrant Block’s claim about the “shift in intentional\ncontents” without a corresponding change in qualia. The problem\nis twofold. First, because of asymmetries in color space and additional\ncomplications (see footnote 23),\n to say nothing of the details of the\n“inverting lenses”, your total functional organization\nwould certainly change in various respects after traveling to a\nbiologically possible Inverted Earth. Second, Block’s description of\nthe long-arm functional theory is highly schematic. It may be that a\nsuitably sophisticated and developed form of this theory would not have\nthe consequence that, on a biologically possible Inverted Earth, your\nexperiences caused by red things have the\n\\(Q_{R}\\)-role. Similar points go for an argument\nagainst functionalism using a traditional inverted spectrum\nscenario.\n\n\nUnsurprisingly, Block does not rest very much—if \nany—weight on the biological possibility of the Inverted Earth\nscenario:\nBut what if the facts of human physiology get in the way of\nthe case as I described it? My response is the same as the one\nmentioned earlier (based on Shoemaker’s rebuttal of Harrison), namely\nthat it is possible for there to be a race of people very much like us,\nwith color vision, and color sensations, but whose physiology does not\nrule out the case described (or spectrum inversion). The functionalist\ncan hardly be satisfied with the claim that our experiences are\nfunctional states but the other race’s experiences are not. (1990,\n64)\n\n\nThis response concedes that the Inverted Earth argument against\nfunctionalism may need to appeal to more-or-less outlandish\npossibilities. And if it does, then since other possibilities not\ninvolving inversions, and arguably no more outlandish, will do just as\nwell, it is doubtful that Inverted Earth-type scenarios have an\nessential role to play in arguments against\n functionalism.[34]\n\n\nThe anti-physicalist inverted spectrum argument is:\n\nArgument Ac\n\nP1c.\n\nThe following spectrum inversion scenario is possible: Invert\nand Nonvert are physically alike, and are both looking at a\ntomato.\n\nSince P1c implies that the mental does not supervene on physical\nmakeup:\n\nCc.\n\nPhysicalism is false.\n\n\n\nAlthough there is some controversy about just how science-fictional\nanti-functionalist inversion scenarios need to be,\nanti-physicalist inversion scenarios are usually supposed to\nbe very remote from actuality, and their possibility is hotly disputed.\nAlmost uncontroversially: if an inverted spectrum argument against\nphysicalism works at all, then a simple zombie scenario will equally\nserve the\n purpose.[35]\n3.2 …Against Representationalism\n\n\nIt is widely held that perceptual experiences represent the\nperceiver’s environment as being a certain way. For example, the\nexperience of someone with normal color vision looking at figure 1\nrepresents (inter alia) her environment as containing a crimson,\nvermilion, and turquoise square. In the terminology of Chalmers 2004\n(slightly adapted), a representational property is a property\nof a mental state/event that specifies (perhaps only in part) the\nstate/event’s representational content. For example, the property of\nbeing a visual experience that represents that there is a crimson\nsquare before one is a representational property (for a taxonomy of\nrepresentational properties, see Chalmers 2004, section 2). The basic\nidea of representationalism or intentionalism is that\nqualia are representational properties, or at least supervene on\nrepresentational properties. One advantage of representationalism is\nthat it appears to reduce “phenomenal consciousness” (Block\n1995) to a certain kind of intentionality. Since the problem of\nproviding a naturalistic account of intentionality is often thought to\nbe tractable, representationalism brings the possibility of a\nnaturalistic account of consciousness (see, e.g., Dretske 1995, Lycan\n1996, Tye 2000, and Speaks 2015).[36]\n\n\nSpectrum inversion scenarios help to focus the dispute between\nrepresentationalists and their critics. (Actual cases of shifted\nspectra can also serve: see Block 1999.) Any version of\nrepresentationalism is committed to the following thesis. Consider a\ncase of red-green spectrum inversion, and imagine Invert and Nonvert\nare both looking at the red peppers depicted in figure 6, against a\nneutral background. Nonvert’s experience has\n\\(Q_{R}\\), while Invert’s experience has\n\\(Q_{G}\\). Because the two experiences have\ndifferent qualia, any version of representationalism implies that, if\nthis scenario is possible, the two experiences differ in\nrepresentational content. Hence, if the foregoing scenario can be\nfilled out so that (a) the two experiences have the same\ncontent and (b) the scenario is possible, then representationalism is\nrefuted.\n\n\nHow can these two desiderata be satisfied? Fortunately for the\nanti-representationalist—or phenomenist (Block \n2003)—the usual ways of trying to secure (a) do not require Invert\nand Nonvert to be behavioral duplicates (or, for that matter,\nfunctional duplicates). The anti-representationalist can therefore\ndismiss concerns that a behaviorally undetectable inversion scenario is\nimpossible.\n\n\nThe description of the anti-representationalist scenario is\ntypically completed with the following three features. First, Invert is\nable to use her color vision to reidentify objects, distinguish objects\nfrom their backgrounds, etc., with more-or-less the facility of\nNonvert. In Locke’s phrase, Invert “would be able as regularly to\ndistinguish Things for [her] Use by those Appearances”. Second,\nInvert has been spectrally inverted from birth (or at least for a long\nperiod of time). Third, Nonvert and Invert belong to the same\nlinguistic community: in particular, they use color vocabulary in the\nsame way, applying ‘red’ to tomatoes, ‘yellow’\nto bananas, and so forth.\n\n\nAssume that this scenario is possible (for an argument that it isn’t,\nsee Sundström 2002 and Gibbons 2005; for a reply see Littlejohn\n2009). The three features just mentioned are intended to support the\nview that this scenario is one in which, when Invert and Nonvert both\nlook at the fruits depicted in figure 6, their experiences have\nthe same representational properties. In particular (glossing\nover a complication to be discussed in subsection 3.3 below), the\nbanana looks yellow to both Invert and Nonvert, the\nstrawberries look red to both, and so on. So, assuming that\nbananas are yellow, strawberries are red, etc., neither Invert nor\nNonvert is suffering from some global color illusion. If this inverted\nspectrum hypothesis is correct, then qualia do not supervene on\nrepresentational properties, and therefore representationalism is\nfalse.\n\n\n(Here is one way of putting the Inverted Earth version of this\nargument (see subsections 2.3.3 and 3.1). After first arriving on\nInverted Earth, your word ‘red’ means red, and to\nyou the green peppers on Inverted Earth look red. But after a period of\nacclimatization, you come to speak the language of the locals, and your\nexperiences come to represent correctly the colors of things—green \npeppers on Inverted Earth look green. Now compare your present\nexperience of a green pepper on Inverted Earth with your previous\nexperience of peppers of exactly that shade back on Earth. Same\ncontent, but different qualia. Alternatively, the\nanti-representationalist argument can proceed by exhibiting an example\nof the converse: same qualia, but different content—see Block\n1990, 64–7.)\n\n\nThe three features of the anti-representationalist scenario can\nmotivate the conclusion that Invert is not systematically misperceiving\nthe colors of things as follows. First, because Invert’s color vision\nis as useful as Nonvert’s for discriminating and identifying objects,\nsurely it would be arbitrary to suppose that Invert’s color vision, but\nnot Nonvert’s, is the source of pervasive illusions. Second, because\nNonvert has been inverted since birth, a complicated system of causal\nconnections between the colors of objects in her environment and states\nof her visual system has been in place for a long period. In\nparticular, there is a reliable causal connection between the presence\nof a red object before Invert’s eyes and a certain neural event\noccurring in Invert; this sort of causal connection is plausibly\nsufficient to bestow the property of representing redness on this type\nof neural event. Third, because Invert and Nonvert belong to the same\nlinguistic community, Invert’s word ‘red’ means\nred. So when Invert says (as she does), ‘Strawberries\nlook red to me’, she means that strawberries look red to\nher. So, if strawberries do not look red to her, Invert is\nsystematically in error about how things look, and this result is not\n credible.[37]\n\n\nNaturally, each of these reasons for thinking that Invert is not\nmisperceiving the colors of objects can be questioned. Against the\nfirst, one might dispute the claim that it would be arbitrary to\nconvict only Invert of error—after all, for all that’s been\nsaid, Nonvert and Invert might differ functionally, which is presumably\na relevant difference. Against the second, there are well-known\nproblems for the “causal covariational” account of mental\ncontent that it assumes (see, e.g., Fodor 1992, Ch. 3). Finally,\nagainst the third, it may be argued that the consequence that Invert is\nmistaken about the content of her experience is not unacceptable (Tye\n2002,\n 451).[38]\n\n\nIt will be useful to set out the anti-representationalist argument\nmore carefully. Assume as a suppressed premise that the inverted\nspectrum scenario just described is possible, and suppose that Invert\nand Nonvert are both looking at a ripe tomato in good light:\n\nArgument B\n\nP1.\n\nNeither Invert nor Nonvert is misperceiving the color of the\ntomato.\nP2.\n\nThe tomato is red (and not any other color).\nHence:\n\nC1.\n\nThe tomato looks the same color (namely, red) to both Invert and\nNonvert.\nP3.\n\nIf representationalism is true, then the phenomenal difference\nbetween Invert and Nonvert is due to a difference in the colors that\ntheir experiences represent the tomato as having.\nHence, from C1 and P3:\n\nC2.\n\nRepresentationalism is false.\n\n\n\nSome of the dialectic surrounding P1 has been described. In the\nfollowing three subsections, other ways of resisting the argument will\nbe discussed.\n\n\nIf Argument B is sound, tomatoes look red to both Invert and\nNonvert, although the corresponding qualia are different. This is why\nspectrum inversion was not described in subsection 2.1 as a case where\ntomatoes look green to Invert (and look red to\nNonvert). If spectrum inversion is explained in these terms, the\nthought experiment is quite unsuitable for anti-representationalist\npurposes.\n\n\nAccording to the (orthodox) representationalist, an experience has\n\\(Q_{B}\\), say, just in case it is an experience\nthat represents blue. According to the phenomenist who endorses\nArgument B, an experience has \\(Q_{B}\\) just in\ncase it has a certain non-representational property. Let us\nstipulate that ‘\\(B\\)’ refers to this non-representational property,\nif such a thing exists. Then the two views may be put as follows:\n\nPhenomenism\n\\(Q_{B} = B\\) (a certain nonrepresentational\nproperty).\n\nOrthodox representationalism\n\\(Q_{B}\\) = property of visually representing\nblue (i.e., being an experience of something’s looking blue).\n\n\nThe sense-datum theory is usually taken to be a form of phenomenism;\nit will be treated as such\n here.[39]\n According to the sense-datum theorist, sense-data that are associated\nwith experiences of seeing the sky, lapis lazuli, cobalt glass, etc.,\nhave a distinctive property; the traditional sense-datum theorist took\nthis property to be the color blue (see, e.g., Moore 1953, 30, n.2),\nbut let us speak more neutrally and call it ‘blue\\('\\)’\n(Peacocke 1983, Ch. 1). Then, according to the sense-datum theorist,\nthe phenomenist equation can be spelled out more informatively\nthus:\nSense-data theory\n\\(Q_{B} = B\\) = being a sensing of a\nblue\\('\\) sense-datum.\n\nOrthodox phenomenists (for instance Block and Levine) have\nno truck with sense-data, and typically leave the phenomenist equation\nunadorned. However, the sense-datum theorist can offer the following\nconsideration in her favor.\n\n\nImagine two experiences: first, an experience (call it\n‘\\(e_{1}\\)’) of a blue triangle next to a red\nsquare; second, an experience \\((e_{2})\\) of\na red triangle next to a blue square. \\(e_{1}\\) has color\nqualia \\(Q_{B}\\) and\n\\(Q_{R}\\), and also “spatial qualia”,\nwhich we can label ‘\\(Q_{Tr}\\)’ and\n‘\\(Q_{Sq}\\)’. The reference of these\nfour bits of qualia terminology\n(‘\\(Q_{B}\\)’,\n‘\\(Q_{R}\\)’,\n‘\\(Q_{Tr}\\)’, and\n‘\\(Q_{Sq}\\)’) has been fixed by, respectively,\nexperiences of blue objects, experiences of red objects, experiences of\ntriangles, and experiences of squares. \\(e_{2}\\), of\ncourse, also has \\(Q_{B},\nQ_{R}, Q_{Tr}\\), and\n\\(Q_{Sq}\\). Yet \\(e_{1}\\) and\n\\(e_{2}\\) differ phenomenologically, and therefore differ\nin qualia. So more qualia terminology is required: in particular, a\nquale name whose reference is fixed by experiences of blue triangles\nand red squares, and another name whose reference is fixed by\nexperiences of red triangles and blue squares. In a useful notation,\nthe first quale name is\n‘\\(Q_{Rx \\amp Sq(x) \\amp By \\amp Tr(y)}\\)’,\n and the second is\n‘\\(Q_{Rx \\amp Tr(x) \\amp By \\amp Sq(y)}\\)’.\n Obviously further qualia names with ever-more complicated subscripts will be\nneeded.\n\n\nNow notice that there are many entailment relations between\nqualia-statements—for example, ‘\\(e\\) has\n\\(Q_{Rx \\amp Sq(x)}\\)’\nentails ‘\\(e\\) has \\(Q_{Rx}\\)’,\nand ‘\\(e\\) has\n\\(Q_{Rx \\amp Tr(x) \\amp By \\amp Sq(y)}\\)’\n entails ‘\\(e\\) has\n\\(Q_{Rx \\amp Sq(y)}\\)’,\nand so on. The orthodox representationalist and the sense-datum\ntheorist have simple accounts of these entailments in terms of the\nstructure of the objects of experiences (apparent\nstructure, for the representationalist; actual structure, for\nthe sense-datum theorist). Assuming representationalism:\n‘\\(e\\) has\n\\(Q_{Rx \\amp Sq(x)}\\)’\n(equivalently, ‘\\(e\\) is an experience of something’s\nlooking red and square’) clearly entails ‘\\(e\\) has\n\\(Q_{Rx}\\)’ (equivalently, ‘e is an\nexperience of something’s looking red’). Assuming the sense-datum\ntheory: ‘\\(e\\) has\n\\(Q_{Rx \\amp Sq(x)}\\)’\n(equivalently, ‘\\(e\\) is a sensing of a red and square\nsense-datum’) clearly entails ‘\\(e\\) has\n\\(Q_{Rx}\\)’ (equivalently,\n‘\\(e\\) is a sensing of a red sense-datum’). The\northodox phenomenist cannot give a similar explanation of these\nentailments, and it is not clear whether she is entitled to them at\n all.[40]\n3.3 …For Appearance Properties\n\n\nReturn to the anti-representationalist argument of the previous\nsubsection:\n\nArgument B\n\nP1.\n\nNeither Invert nor Nonvert is misperceiving the color of the\ntomato.\nP2.\n\nThe tomato is red (and not any other color).\nHence:\n\nC1.\n\nThe tomato looks the same color (namely, red) to both Invert and\nNonvert.\nP3.\n\nIf representationalism is true, then the phenomenal difference\nbetween Invert and Nonvert is due to a difference in the colors that\ntheir experiences represent the tomato as having.\nHence, from C1 and P3:\n\nC2.\n\nRepresentationalism is false.\n\n\n\nRepresentationalists usually resist P1. But there are other options.\nAccording to Shoemaker, the flaw in the argument is not P1, but rather\nP3. In addition to representing colors, Shoemaker thinks that visual\nexperiences represent other (“colorlike”) properties that\nwe do not have words for in English, and which he calls appearance\n properties.[41]\n On this view, both Invert and Nonvert’s\nexperiences represent the tomato as red. However, Invert’s\nexperience also represents the tomato as having a certain salient\nappearance property (call it\n‘\\(AP_{G}\\)’), while Nonvert’s\nexperience represents the tomato as having a certain salient appearance\nproperty \\((AP_{R})\\). It is this\nrepresentational difference between Invert and Nonvert that accounts\nfor the phenomenological difference between their experiences. One may,\nthen, view Shoemaker’s main argument for appearance properties as\nproceeding from P1, P2, and representationalism (i.e., not-C2), to the\nconclusion that P3 is false.\n\n\nWhat are the appearance properties \\(AP_{G}\\)\nand \\(AP_{R}\\)? Since Shoemaker thinks that it\nis implausible that Invert is systematically misperceiving the colors,\nit is not surprising that he also thinks that neither Nonvert nor\nInvert is systematically misperceiving the appearance properties. The\ntomato, then, has both \\(AP_{G}\\) and\n\\(AP_{R}\\). In Shoemaker 1994b,\n\\(AP_{R}\\) is said to be (where\n\\(Q_{R}\\) “is the quale that characterizes\n[Nonvert’s] experience of red things”) the property of\n“currently producing [a \\(Q_{R}\\)]\nexperience in someone related to it in a certain way, namely someone\nviewing it under normal lighting conditions” (254), and\nsimilarly for \\(AP_{G}\\) (see also Shoemaker\n1994a). This secures the result that the tomato has\n\\(AP_{R}\\) when Nonvert is looking at it; as\nShoemaker notes, it implies that the tomato lacks\n\\(AP_{R}\\) when it is not being perceived. This\naccount of appearance properties has been substantially revised and\ndeveloped in Shoemaker’s later work. According to Shoemaker 2002,\nappearance properties include dispositions to produce certain\nexperiences in certain perceivers (a suggestion that was considered\nbut rejected in Shoemaker 1994a, b). Shoemaker 2006a revises the\naccount further; for discussion, see Egan 2006 and Speaks 2015, ch. 22.\n\n\nThau (2002, Ch. 5) holds a similar view, but there are some\nimportant differences. First, Thau’s argument does not turn on the need\nto secure spectrum inversion without misrepresentation, and instead\ndeploys an adaptation of Jackson’s (1982) thought experiment concerning\nblack-and-white Mary. (See the entry on\n qualia: the knowledge argument.)\n Second, because Thau is not concerned to\nensure that neither Invert nor Nonvert is misperceiving the tomato, he\ndoes not try to argue that the tomato has both\n\\(AP_{G}\\) and \\(AP_{R}\\),\nleaving the question unexamined. Third, Thau’s argument for appearance\nproperties commits him to the view that they cannot be named (222–5);\nShoemaker is not so committed. Finally, Thau does not think, unlike\nShoemaker, that colors are visually represented (211). According to\nThau, beliefs about the colors of things are based on experiences that\nrepresent objects as having appearance properties. These beliefs are\njustified, Thau argues, because there is a correlation between an\nobject’s having color \\(C\\) and its looking to have\nAP\\(_{C}\\) (235–6).\n3.4 …For Modes of Presentation\n\n\nAn illustration of “Frege’s puzzle” is this. It is\napparently possible to believe that Michael Caine is a Cockney, while\nnot believing that Maurice Micklewhite is a Cockney. But how can this\nbe, since Michael Caine and Maurice Micklewhite are the same\nindividual?\n\n\nAccording to many philosophers, appearances are not misleading, and\nthe two beliefs really are different: specifically, they represent the\nvery same individual, the beloved star of Alfie, in different\nways, or under different modes of presentation. On this view, the\npropositional content of a belief is a Fregean Thought, with modes of\npresentation as constituents—as opposed to a structured\nRussellian proposition, with objects and properties as\n constituents.[42]\n Put differently but connectedly, the\nexample shows that the names ‘Michael Caine’ and\n‘Maurice Micklewhite’ have different Fregean\nsenses—their semantic values cannot simply be their\nreferents.\n\n\nA similar issue arises in the philosophy of perception (see, e.g.,\nBoghossian and Velleman 1991, Peacocke 2001, Thau 2002). When one looks\nat a cucumber, does the propositional content of one’s experience have\na constituent that is a “mode of presentation” of greenness\n(a neo-Fregean view) or does it instead simply contain the property\ngreenness itself? Using the familiar ordered pair notation for\npropositional content (see, e.g., Thau 2002, 83), and ignoring issues\nabout whether the cucumber itself is associated with a mode of\npresentation, the dispute may be put as follows. On the neo-Fregean\nview, the content of one’s experience of the cucumber is \\(\\langle\\)the\ncucumber, \\(\\mathrm{MOP_{greenness}} \\rangle\\); on the neo-Russellian view, the\ncontent of one’s experiences is \\(\\langle\\)the cucumber, greenness\\(\\rangle\\).\n\n\nRecall the third premise of argument B (see the previous two\nsubsections):\n\nP3.\n\nIf representationalism is true, then the phenomenal\ndifference between Invert and Nonvert is due to a difference in the\ncolors that their experiences represent the tomato as\nhaving.\n\n\nAs explained in subsection 3.3, one may resist P3 by claiming that\ncolor experience represents appearance properties. That\namounts to a defense of representationalism by introducing a\ndistinction “at the level of reference”. However, P3 may\nalso be denied by introducing a distinction “at the level of\nsense”. On this view, the difference between Invert and Nonvert\nis like the difference—as the Fregean has it—between\nIan, who believes that Michael Caine is a Cockney, and Nan, who\nbelieves that Maurice Micklewhite is a Cockney. On this Fregean view of\nthe content of perception, the difference between Invert’s and\nNonvert’s experiences is that they represent the very same property,\nnamely redness, in different ways, or under different modes of\npresentation.\n\n\nThau 2002 argues against modes of presentation (and also points out\nthe close connections between the inverted spectrum and Frege’s\npuzzle). Chalmers 2004 and Block 2007 defend a Fregean view.\n3.5 …For Relativism\n\n\nWe are not quite finished with Argument B:\n\nArgument B\n\nP1.\n\nNeither Invert nor Nonvert is misperceiving the color of the\ntomato.\nP2.\n\nThe tomato is red (and not any other color).\nHence:\n\nC1.\n\nThe tomato looks the same color (namely, red) to both Invert and\nNonvert.\nP3.\n\nIf representationalism is true, then the phenomenal difference\nbetween Invert and Nonvert is due to a difference in the colors that\ntheir experiences represent the tomato as having.\nHence, from C1 and P3:\n\nC2.\n\nRepresentationalism is false.\n\n\n\nSo far, reasons to reject P1 and P3 have been discussed. But one\nmight also question the step from P1 and P2 to C1. As an analogy,\nsuppose that Hare is on a train, looking at a tomato in his lunchbox,\nand that Tortoise is on the platform, looking at the tomato as the\ntrain speeds by. Both Hare and Tortoise have normal vision, in\nparticular, normal visual motion perception. Consider the following\nargument.\n\nArgument B*\n\nP1*.\n\nNeither Hare nor Tortoise is misperceiving the motion of the\ntomato.\nP2*.\n\nThe tomato is moving (not stationary).\nHence:\n\nC1*.\n\nThe tomato looks to be moving to both Hare and Tortoise.\n\n\n\nSince the tomato is moving relative to Tortoise, and is not\nmoving relative to Hare, if P2* is true, it must not be taken\nto mean that the tomato is moving relative to Hare. Assume, then, that\nP2* is given the following true interpretation: the tomato is moving\nrelative to Tortoise. However, Hare does not have to perceive that the\ntomato is moving relative to Tortoise in order to perceive (correctly)\nthe tomato’s motion—perceiving it as not moving\nrelative to himself will also suffice. Hence, Hare’s and Tortoise’s\nexperiences can both be veridical, despite representing the tomato’s\nmotion differently, which is to say that Argument B* is invalid.\n\n\nOne might diagnose a similar mistake in Argument B, and thus endorse\nrelativism about color. According to relativism the tomato is\nnot red simpliciter: rather, it is red relative to Nonvert\n(not green relative to Nonvert), and green relative to Invert (not red\nrelative to Invert). In other words, the tomato is simultaneously\nred-for-Nonvert and green-for-Invert. Since, on this\nview, the tomato looks red-for-Nonvert to Nonvert, and red-for-Invert\nto Invert, both their experiences are veridical, despite representing\nthe tomato differently.\n\n\nWhat is this property of being red-for-Nonvert? The usual answer is\nsomething along the lines of the account of appearance properties in\nShoemaker 2002: something is red-for-Nonvert iff it is disposed to\ncause experiences with \\(R\\) in perceivers of Nonvert’s kind. And\nthis, of course, is essentially the “secondary quality”\naccount of color that many find in Locke. Sometimes relativism is\ncombined with representationalism (McGinn 1983, Tye 1994), but it\narguably fits more naturally with phenomenism (McLaughlin 2003, Cohen\n2004).\n\n\nShoemaker did not block Argument B in this straightforward fashion\nbecause he finds relativism implausible. As he puts it in a review of\nMcGinn 1983:\nSuppose…that overnight we all undergo\nintrasubjective ‘spectrum inversion’…It cannot\nseriously be maintained that the result of the change would be that\nhenceforth grass \\(is\\) red, port wine green, etc. And it is\nplausible that, once we were accustomed to the change, we would no\nlonger say that grass looks red (for it would look the way we\nhad become accustomed to having green things look). This point is even\nclearer if we imagine that we undergo intrasubjective inversion one at\na time rather than all of us at once. (1986, 411)\n\n\nLike the argument for appearance properties, the argument for\nrelativism can be made by appeal to shifted spectra (see, in\nparticular, Cohen 2004). Averill 1992 argues for a version of\nrelativism using physically possible intrapersonal shifted spectra\nscenarios, involving a slight change in the eye, or in the\n atmosphere.[43]\n3.6 …For Skepticism About Others’ Minds\n\n\nThe “inverted spectrum” quotation from Locke in\nsubsection 2.2 above continues:\nI am nevertheless very apt to think, that the sensible\nIdeas, produced by any Object in different Men’s Minds, are most\ncommonly very near and undiscernibly alike. For which Opinion, I think,\nthere might be many Reasons offered: but that being besides my present\nBusiness, I shall not trouble my Reader with them; but only mind him,\nthat the contrary Supposition, if it could be proved, is of little use,\neither for the Improvement of our Knowledge, or Conveniency of Life;\nand so we need not trouble our selves to examine it. (1689/1975, II,\nxxxii, 15)\n\n\nIt is regrettable that Locke did not trouble his Reader, because it\nis not at all clear what reasons may be offered. Malebranche was of the contrary opinion: \nYet I believe that it never, or almost never, happens that people see black or white other than as we see them, though they may not seem equally black or white to them. But as for the intermediate colors, such as red, yellow, blue, and especially those compounded from these three, I do not think there are many people who have exactly the same sensation of them. \n (1674–5/1997, I, 13, VI)\n\n\nLet \\(p\\) be the claim that when others look at ripe tomatoes, their\nexperiences have \\(Q_{R}\\). Let \\(S\\) be a\nspectrum inversion scenario with the following simple feature: when\nothers look at ripe tomatoes, their experiences have\n\\(Q_{G}\\), not \\(Q_{R}\\).\n(So \\(p\\) and \\(S\\) are incompatible.) Consider the following\nskeptical argument:\n\nArgument C\n\nP1.\n\nOne’s evidence about others’ behavior and use of color words\ndoes not favor \\(p\\) over \\(S\\).\nP2.\n\nOne has no other evidence that favors \\(p\\) over \\(S\\).\nP3.\n\nIf one’s evidence does not favor \\(p\\) over \\(S\\), one does not know \\(p\\).\nTherefore:\n\nC.\n\nOne does not know \\(p\\).\n\n\n\nAlthough philosophers have generally not been impressed by similar\narguments for skepticism about the external world, there is little\nconsensus on the status of arguments along the above lines. For\nexample, Block writes: “I claim we simply do not know whether\nspectrum inversion obtains or not” (1990, 57). Argument C is less\nthreatening than some other skeptical arguments because, even if sound,\ngeneralizations of it to skepticism about other kinds of mental states\nare implausible. For example, a parallel argument against one’s\nknowledge of other’s beliefs would have a dubious first premise.\n\n\nP1 will be denied by an orthodox representationalist. Setting a\ncontroversial skepticism about testimony aside, presumably one can know\non the basis of testimony that tomatoes look red to many people. (See\nShoemaker 1982, 334.) So, since orthodox representationalism equates\n\\(Q_{R}\\) with the property of being an\nexperience of something’s looking red, one may know on the basis of\ntestimony that when others look at tomatoes, their experiences have\n\\(Q_{R}\\).\n\n\nSome philosophers think that the fact that others are biologically\nsimilar to oneself is an important piece of evidence for their mental\nsimilarity (see, e.g., Hill 1991, Ch. 9), and P2 might be denied on\nthese grounds (see, e.g., Papineau 2002, 132). For more discussion, see\nBlock\n 2002.[44]\n3.7 …For the Explanatory Gap\n\n\nMany philosophers think there is an “explanatory gap”\n(Levine 1983, 2001) between physical facts and facts about conscious\nexperience. On this view, even if consciousness is a physical\nphenomenon, it cannot be given a physical explanation. Inverted\nspectrum scenarios often play a role in arguments for the gap:\nLet’s call the physical story for seeing red\n“\\(R\\)” and the physical story for seeing green\n“\\(G\\ldots\\)” When we consider the qualitative\ncharacter of our visual experiences when looking at ripe McIntosh\napples, as opposed to looking at ripe cucumbers, the difference is not\nexplained by appeal to \\(G\\) and \\(R\\). For \\(R\\)\ndoesn’t really explain why I have the one kind of qualitative\nexperience—the kind I have when looking at McIntosh \napples—and not the other. As evidence for this, note that it seems\njust as easy to imagine \\(G\\) as to imagine \\(R\\) underlying\nthe qualitative experience that is in fact associated with \\(R\\).\nThe reverse, of course, also seems quite imaginable. (Levine 1983,\n356–7)\n\n\nThe argument for the gap suggested by Levine 1983 can be set out as\nfollows:\n\nArgument D\n\nP1.\n\nIf a physical theory \\(T\\) explains the fact that we have\nexperiences with \\(Q_{R}\\) when looking at\nMcIntosh apples, and experiences with \\(Q_{G}\\)\nwhen looking at cucumbers, then it is not imaginable that the explanans\nholds without the explanandum. That is, it is not imaginable that\n\\(T\\) holds and we do not have experiences with\n\\(Q_{R}\\) when looking at McIntosh apples\n(etc.).\nP2.\n\nA red-green spectrum inversion scenario in which \\(T\\)\nholds is imaginable.\nHence:\n\nC.\n\nNo physical theory explains the fact that we have experiences\nwith \\(Q_{R}\\) when looking at McIntosh apples,\nand experiences with \\(Q_{G}\\) when looking at\ncucumbers.\n\n\n\nNotice that Argument D does not have as a premise a spectrum\ninversion hypothesis—that a certain spectrum inversion\nscenario is possible. All the argument requires is that the\nspectrum inversion scenario is imaginable. Indeed, since\nLevine is a physicalist, he thinks that this scenario is not\npossible.\n\n\nWhat is the intended interpretation of ‘imagine’ in P1\nand P2? (In the literature ‘conceive’ is used\ninterchangeably.) The usual answer (Levine 2001, Ch. 2) is this:\n\\(p\\) is imaginable iff not-\\(p\\) is not a priori.\nOn this interpretation, P1 amounts to this: it is a priori\nthat if the explanans holds, so does the explanandum; that is, that the\nexplanans a priori entails the explanandum. This can be\nmotivated by appeal to the “deductive-nomological” model of\nexplanation (see Hempel 1965, and the entry on\n scientific explanation);\n this\nmodel is controversial, and in fact Levine rejects it, but he argues\nthat there is a broader motivation:\nFrom the brief survey of current theories of scientific\nexplanation just presented, I think the following claim can be\njustified: in a good scientific explanation, the explanans either\nentails the explanandum, or it entails a probability distribution over\na range of alternatives, among which the explanandum resides. (2001,\n74)\n\n\nOne might resist Argument D by denying P2 (for some ammunition, see\nHardin 1987; 1993, 134–42; for a reply see Levine 1991; see also Hardin\n1991). A much more common response is to deny P1 (Block and Stalnaker\n1999; for a reply see Chalmers and Jackson 2001).\n\n\nOne exegetical complication is that Levine himself now denies P1,\nwhile continuing to maintain the existence of the explanatory gap on\nthe basis of an argument related to Argument D, although somewhat more\ncomplicated (2001, Ch. 3). And in any case, just like the inverted\nspectrum argument against behaviorism, functionalism and physicalism\n(see subsection 3.1 above), inverted spectrum scenarios are not playing\nan essential role in the case for the gap, and indeed Levine 2001 leans\nmore heavily on “absent qualia” scenarios: “The\nconceivability of zombies…is the principal manifestation of the\nexplanatory gap” (79).\n3.8 …For the Ineffability of Qualia\n\n\nThe introduction of ‘\\(Q_{R}\\)’,\n‘\\(Q_{G}\\)’, and so forth, at the\nstart of this article might have occasioned some suspicion. Assume\nthat spectrum inversion does not occur, and consider a\ncounterfactual situation in which, as Block puts it,\n“spectrum inversion is rife” (1990, 55). Suppose\nthat philosophers in this counterfactual situation introduced qualia\nterminology in the way it was introduced in section 1. If their qualia\nterminology is meaningless, then it is hard to see why our terminology\nis better off—we use\n‘\\(Q_{R}\\)’ just as it is used in\nthe counterfactual situation. If, on the other hand, their qualia\nterminology is meaningful, then presumably\n‘\\(Q_{R}\\)’, as they use it, refers\nto something other than a quale. (Since spectrum inversion is rife,\ntheir use of ‘\\(Q_{R}\\)’ is not\nassociated with any particular quale.) Again, given the overlap in\nuse, why suppose that our word\n‘\\(Q_{R}\\)’ is any different? Either\nway: ‘\\(Q_{R}\\)’ does not refer to a\nquale. There is a threat, then, that qualia cannot be named in a\npublic language—that they are ineffable (cf. Dennett\n1988, 228–9). Indeed, that seems to be Block’s opinion: “if an\ninverted spectrum is possible, then experiential contents that can be\nexpressed in public language (for example, looking red) are\nnot qualitative contents, but rather intentional contents”\n(1990, 55; see also Block 2007, 73–4). (“Qualitative\ncontents” are qualia that are not representational properties:\nsee subsection 3.2.)\n\n\nFrege held a version of the ineffability view. One of his theses in\nThe Foundations of Arithmetic is that arithmetic is\n“objective”, which he explains as follows:\nWhat is objective…is what is subject to laws, what\ncan be conceived and judged, what is expressible in words. What is\npurely intuitable is not communicable. To make this clear, let us\nsuppose two rational beings such that projective properties and\nrelations are all they can intuit—the lying of three points on\na line, of four points on a plane, and so on; and let what the one\nintuits as plane appear to the other as a point, and vice versa, so\nthat what for the one is the line joining two points for the other is\nthe line of intersection of two planes, and so on with the one\nintuition always dual to the other. In these circumstances they could\nunderstand one another quite well and would never realize the\ndifference between their intuitions, since in projective geometry every\nproposition has its dual counterpart; any disagreements over points of\naesthetic appreciation would not be conclusive evidence. Over all\ngeometrical theorems they would be in complete agreement, only\ninterpreting the words in terms of their respective intuitions. With\nthe word ‘point’, for example, one would connect one\nintuition and the other another. We can therefore still say that this\nword has for them an objective meaning, provided only that by this\nmeaning we do not understand any of the peculiarities of their\nrespective intuitions. (1884/1953, §26)\n\n\nThis is an inverted spatial qualia scenario. According to Frege, the\ninversion would not show up in the semantics of words: both Nonvert and\nInvert use the word ‘point’ with the same meaning, despite\nassociating very different “intuitions” with it. In the\nnext paragraph, Frege makes a similar claim about color\nterminology.\nThe word ‘white’ ordinarily makes us think of a\ncertain sensation, which is, of course, entirely subjective; but even\nin ordinary everyday speech, it often bears, I think, an objective\nsense. When we call snow white, we mean to refer to an objective\nquality which we recognize, in ordinary daylight, by a certain\nsensation. If the snow is being seen in a coloured light, we take that\ninto account in our judgement and say, for instance, ‘It\nappears red at present, but it \\(is\\) white.’ Even\na colour-blind man can speak of red and green, in spite of the fact\nthat he does not distinguish between these colors in his sensations; he\nrecognizes the distinction by the fact that others make it, or perhaps\nby making a physical experiment. Often, therefore, a colour word does\nnot signify our subjective sensation, which we cannot know to agree\nwith anyone else’s (for obviously calling things by the same name does\nnot guarantee as much), but rather an objective quality.\n(§26)\n\n\nAlthough Frege seems to concede that sometimes a color word\n“signifies our subjective sensation”, the general drift of\nthe argument points to a much stronger conclusion, that our subjective\nsensations are simply not “expressible in words”. A related\nexample is Wittgenstein’s “beetle in the box”:\nSuppose everyone had a box with something in it: we call it\na ‘beetle’. No one can look into anyone else’s box, and\neveryone says he knows what a beetle is only by looking at his\nbeetle.—Here it would be quite possible for everyone to have\nsomething different in his box. One might even imagine such a thing\nconstantly changing.—But suppose the word ‘beetle’\nhad a use in these people’s language?—If so it would not be\nused as the name of a thing. The thing in the box has no place in the\nlanguage game at all; not even as a something: for the box might even\nbe empty. No, one can ‘divide through’ by the thing in the\nbox; it cancels out, whatever it is. (1958, §293)\n\n\n(Notice that Wittgenstein imagines “absent beetles”,\ncorresponding to an “absent qualia” scenario.)\n\n\nHere is one argument suggested by these passages.\n\n\nSuppose that Humbert is semantically (and otherwise) competent, has\nnormal color vision, is a member of our linguistic community, and uses\nqualia terminology (‘\\(Q_{R}\\)’,\n‘\\(Q_{G}\\)’, etc.), as introduced in\nsection 1 above. Further suppose that spectrum inversion does not in\nfact occur.\n\n\nNow consider a counterfactual spectrum inversion scenario in which\n“spectrum inversion is rife”. Invert has been spectrally\ninverted with respect to some other members of his community since\nbirth, all of whom use color terminology in much the same way. Nonvert\nis spectrally inverted with respect to his neighbor Invert, but—comparing \nthis scenario with the actual scenario described in the\nprevious paragraph—is not spectrally inverted with respect to\nHumbert. Further suppose that Nonvert and his neighbor Invert use\nqualia terminology as introduced in section 1 above. Assume as a\nsuppressed premise that this scenario is possible.\n\n\nLet ‘\\(X\\)’ abbreviate the definite description ‘the quale\ndistinctive of Humbert’s experiences of red things’ (by hypothesis,\nthis definite description is coextensive with ‘the quale\ndistinctive of Nonvert’s experiences of red things in the\ncounterfactual inversion scenario’).\n\nArgument E\n\nP1.\n\n‘\\(Q_{R}\\)’, as Invert uses\nit, and ‘\\(Q_{R}\\)’, as Nonvert uses\nit, refer (if at all) to the same property.\nP2.\n\n‘\\(Q_{R}\\)’, as Invert uses\nit, does not refer to \\(X\\).\nHence:\n\nC1.\n\n‘\\(Q_{R}\\)’, as Nonvert uses\nit, does not refer to \\(X\\).\nP3.\n\n‘\\(Q_{R}\\)’, as Humbert uses\nit, and ‘\\(Q_{R}\\)’, as Nonvert uses\nit, refer (if at all) to the same property.\n\nHence, from C1 and P3:\n\nC2.\n\n‘\\(Q_{R}\\)’, as Humbert uses\nit, does not refer to \\(X\\).\n\n\n\nSince the rest of us are in no better position than Humbert, C2\nleads inevitably to the conclusion that\n‘\\(Q_{R}\\)’,\n‘\\(Q_{G}\\)’, etc., as introduced in\nthe manner of section 1, do not in fact refer to qualia. One might view\nArgument E as showing that certain salient aspects of our mental lives\nare linguistically elusive (as Frege apparently did); alternatively,\none might follow Wittgenstein and conclude that the very idea of qualia\nrests on a conceptual confusion.\n\n\nIn fact, C2 does not imply that qualia are completely\nunspeakable—it does not, that is, imply that \\(no\\)\nexpression refers to \\(X\\) (i.e., the quale distinctive of\nHumbert’s experiences of red things). Indeed, if the sentence to the\nright of ‘C2’ succeeds in expressing a truth, then\n‘\\(X\\)’ (and so ‘the quale distinctive of Humbert’s\nexperiences of red things’) refers to \\(X\\). If Argument E\nis as far as we can go, then the moral seems to be that particular\nqualia can only be picked out ‘by description’—they\ncannot be referred to by semantically simple expressions, such as\n‘\\(Q_{R}\\)’ and\n ‘\\(Q_{G}\\)’.[45]\n But—bearing\nin mind Wittgenstein’s remark that “the box might even be\nempty”—one might attempt to extend the argument to show\nthat even the word ‘qualia’ itself is devoid of\nsignificance.\n\n\nHowever, Argument E is not obviously sound. The premise in need of\nmost defense is\n P3.[46]\n When qualia terminology was introduced in\nsection 1, it was tacitly presupposed that spectrum inversion was\nnot rife. In Invert’s and Nonvert’s community, that\npresupposition is false, and so it should not be surprising if the\nattempt to introduce ‘\\(Q_{R}\\)’ into\ntheir public language fails. But in Humbert’s community the\npresupposition is true; so why wouldn’t\n‘\\(Q_{R}\\)’, as the members of this\ncommunity use it, successfully refer to the quale distinctive of\nHumbert’s experiences of red\n things?[47]\n3.9 ...For the Inconsistency of Content-Externalism, Representationalism, and Qualia-Internalism\n\nExternalism about beliefs and other propositional\nattitudes, and also about perceptual experiences, was alluded to in\nsubsections 3.1 and 3.2. Premise P1 of our much-scrutinized \nArgument B—‘Neither Invert nor Nonvert is misperceiving the color of\nthe tomato’—was supported, in part, by a particular\nexternalist theory of perceptual content. According to the externalist,\nsome representational properties of subjects, like the property of\nbelieving that water is wet, or that arthritis is painful, or the\nproperty of having an experience of something’s looking red, are\nextrinsic: these properties are not necessarily shared between perfect\nduplicates (or even less-than-perfect duplicates with perfectly\nduplicated\n brains).[48]\n Smith may believe that water is wet, yet\ntwin-Smith on Putnam’s Twin Earth does not believe that water is wet.\nThe tomato may look red to Jones, yet not to twin-Jones on Inverted\nEarth. (In an alternative scenario, twin-Jones has just been created by\nhappenstance in a swamp: see Davidson 1987.)\n\n\nIt is also widely held that qualia are intrinsic (see,\ne.g., Block 1990, 68). (More exactly: properties of subjects like\nhaving an experience with quale Q, are intrinsic.) If Jones is\nhaving an experience with quale \\(Q\\), then there is no possible\nworld w in which twin-Jones is not having an experience with quale\n\\(Q\\).\n\n\nFinally, representationalism (see subsection 3.2 above) is—if \nnot as popular as the previous two claims—at least defended\nby many contemporary philosophers.\n\n\nNow consider the following argument (cf. Byrne and Hilbert 1997b,\n271–2):\n\nArgument F\n\nP1.\n\nRepresentational properties are extrinsic.\nP2.\n\nRepresentationalism is true (for simplicity, in the simple form\nof subsection 3.2 above: \\(Q_{C}\\) = the property\nof being an experience of something’s looking to have color\n\\(C)\\).\nP3.\n\nQualia are intrinsic.\n\n\n\nConsider the representational property of having an experience of\nsomething’s looking red. By P1, this property is extrinsic, and so\nthere is a possible world \\(w\\) in which a subject \\(x\\) has\nthis property and \\(y\\)—a perfect duplicate of \n\\(x\\)—lacks it. Solely for illustration, we may take \\(w\\) to be\na possible world in which Nonvert and his twin Invert are both looking\nat a tomato in a white bowl (but perhaps the twins are on different\nplanets). Nonvert is having an experience of something’s looking red,\nand Invert is not; more specifically: (i) the tomato looks red, and\nnothing looks green, to Nonvert; (ii) the tomato looks green, and\nnothing looks red, to Invert. By P2, Nonvert’s experience has\n\\(Q_{R}\\) (and not\n\\(Q_{G})\\); conversely for Invert. So Nonvert and\nInvert are twins whose experiences do not share qualia; in other words,\nqualia are not intrinsic. By P3, contradiction. Hence:\n\nC.\n\nAt least one of P1, P2, and P3 is false.\n\n\nNotice that Argument F does not assume the possibility of a scenario\nin which duplicate perceivers are spectrally inverted. This spectrum\ninversion hypothesis is ruled out by P3, and P3 is of course consistent\nwith Argument F’s conclusion.\n\n\nArgument F shows that either content-externalism, representationalism,\nor qualia-internalism should be rejected. For a discussion of this\nproblem, see Egan and John 2003 (Other Internet Resources); Dretske\n(1995, Ch. 5) argues against P3 (see also Tye 1995, 150–5; 2002,\nCh. 6; Lycan 1996, 115–7; and Noë 2005, Ch. 7); P1 is\ndenied in Chalmers 2004.\n\n\nRelatedly, McGinn (1989, 58–94) runs a “spatially Inverted\nEarth” argument against what he calls ‘strong\nexternalism’ about perceptual content (a particular kind of\nexternalism); Davies (1997) adapts McGinn’s example to argue for\nexternalism about perceptual content. Both sides of the\n“externalism/internalism” debate as encapsulated in\nArgument F presuppose that it is possible to keep a perceiver’s\ninternal constitution fixed while greatly varying the environment; this\nassumption is critically examined in Hurley 1998, Chs. 7, 8, and Myin\n2001.\n3.10 Summary: Required Features of Inverted Spectrum Scenarios\n\n\nConclusion \nRequired features of scenario \n\n\nBehaviorism is false.\nBehaviorally undetectable inversion.\n\n\nFunctionalism is false.\nFunctionally undetectable inversion.\n\n\nPhysicalism is false.\nPhysically undetectable inversion.\n\n\nRepresentationalism is false.\nInversion with no misperception (so a behaviorally undetectable\ninversion is not required); in addition, lifelong inversion and same\nlinguistic community. Shifted spectra might do as well.\n\n\nThere are appearance properties.\nAs immediately above (“Representationalism is\nfalse”).\n\n\nThere are perceptual modes of presentation.\nAs immediately above.\n\n\nColor relativism is true.\nAs immediately above.\n\n\nOne does not know about others’ qualia.\nInversion that is not ruled out by one’s actual evidence about\nothers’ behavior and use of color words.\n\n\nThere is an explanatory gap.\nInversion that obtains together with the actual physical theory of\ncolor experiences; the scenario does not need to be possible, only\nimaginable.\n\n\nQualia are ineffable.\nInverted and noninverted subjects in same community, with the use\nof qualia terminology similar to the actual use.\n\n\nContent-externalism, representationalism, and qualia-internalism\nare inconsistent.\nInverted subjects who are perfect duplicates; this scenario is not\nassumed to be possible.\n\n\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Allen, K., 2010, “Locke and the Nature of Ideas”,\n<em>Archiv für Geschichte der Philosophie</em>, 92:\n236–255.",
                "Averill, E. W., 1992, “The Relational Nature of Color”,\n<em>Philosophical Review</em>, 101: 551–88.",
                "Ayer, A. J., 1936, <em>Language, Truth and Logic</em>, London:\nVictor Gollancz; page reference is to the 1971 reprint, Harmondsworth,\nEngland: Pelican Books.",
                "–––, (ed.), 1959, <em>Logical Positivism</em>,\nNew York: The Free Press.",
                "Block, N., 1980, “Troubles with Functionalism”, in\n<em>Readings in Philosophy of Psychology</em>, Vol. 1, N. Block (ed.),\nCambridge, MA: Harvard University Press, pp. 268–305.",
                "–––, 1990, “Inverted Earth”,\n<em>Philosophical Perspectives</em>, 4: 53–79.",
                "–––, 1995, “On a Confusion about a\nFunction of Consciousness”, <em>Behavioral and Brain\nSciences</em>, 18: 227–47.",
                "–––, 1996a, “Mental Paint and Mental\nLatex”, <em>Philosophical Issues</em>, 7: 19–49.",
                "–––, 1996b, “Functionalism”, in\n<em>The Encyclopedia of Philosophy Supplement</em>, D. Borchert (ed.),\nNew York: Macmillan, pp. 756–761.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/functionalism.pdf\" target=\"other\">Preprint available online in PDF</a>.]",
                "–––, 1999, “Sexism, Racism, Ageism and the\nNature of Consciousness”, in <em>Philosophical Topics</em>, 26\n(1&amp;2).\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/sexism.html\" target=\"other\">Preprint available online</a>.]",
                "–––, 2002, “The Harder Problem of\nConsciousness”, <em>Journal of Philosophy</em>, 94: 1–35.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/2002.HarderProblem.pdf\" target=\"other\">Preprint available online</a>.]",
                "–––, 2003, “Mental Paint”, in\n<em>Reflections and Replies: Essays on the Philosophy of Tyler\nBurge</em>, M. Hahn and B. Ramberg (eds.), Cambridge, MA: MIT Press, pp. 165–200.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/mentalpaint.pdf\" target=\"other\">Preprint available online in PDF</a>.]",
                "–––, 2007, “Wittgenstein and\nQualia”, <em>Philosophical Perspectives</em>, 21: 73–115.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/Wittgenstein_Qualia.pdf\" target=\"other\">Preprint available online in PDF</a>.]",
                "Block, N. and Fodor, J., 1972, “What Psychological States Are\nNot”, <em>Philosophical Review</em>, 81: 159–81.",
                "Block, N. and Stalnaker, R., 1999, “Conceptual Analysis,\nDualism, and the Explanatory Gap”, <em>Philosophical Review</em>\n108: 1–46. \n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/ExplanatoryGap.html\" target=\"other\">Preprint available online</a>.]",
                "Boghossian, P., and Velleman, J. D., 1991, “Physicalist\nTheories of Color”, <em>Philosophical Review</em>, 100: 67–106.\nReprinted in Byrne and Hilbert 1997a.",
                "Brenner, W. H., 2015, “From Inverted Spectra to Colorless\nQualia: A Wittgensteinian Critique”,\n<em>Philosophical Investigations</em>, 38(4): 360–381;\nfirst published online 2014. doi:10.1111/phin.12048",
                "Broackes, J., 2007, “Black and White and the Inverted\nSpectrum”, <em>Philosophical Quarterly</em>, 57:\n161–75.",
                "Burge, T., 1979, “Individualism and the Mental”,\n<em>Midwest Studies in Philosophy</em>, 4: 73–121.",
                "Byrne, A., 2001, “Intentionalism Defended”,\n<em>Philosophical Review</em>, 110: 199–240.",
                "–––, 2002, “Something About Mary”,\n<em>Grazer Philosophische Studien</em>, 63: 123–40.",
                "Byrne, A., and Hilbert, D. R., 1997a, <em>Readings on Color, Volume\n1: The Philosophy of Color</em>, Cambridge, MA: MIT Press.",
                "–––, 1997b, “Colors and\nReflectances”, in Byrne and Hilbert 1997a, pp. 263–288. \n [<a href=\"http://mit.edu/abyrne/www/colors&amp;reflectances.html\" target=\"other\">Preprint available online</a>.]",
                "–––, 2003a, “Color Realism and Color\nScience”, <em>Behavioral and Brain Sciences</em>, 26: 3–21.\n [<a href=\"http://mit.edu/abyrne/www/ColorRealism.html\" target=\"other\">Preprint available online</a>\n].",
                "–––, 2003b, “Color Realism Redux”,\n<em>Behavioral and Brain Sciences</em>, 26: 52–63.\n [<a href=\"http://mit.edu/abyrne/www/colorrealismredux.html\" target=\"other\">Preprint available online</a>.]",
                "Campbell, N., 2000, “Physicalism, Qualia Inversion, and\nAffective States”, <em>Synthese</em>, 124: 239–55.",
                "Canfield, J., 2001, “Ned Block, Wittgenstein, and the\nInverted Spectrum”, <em>Philosophia</em>, 37: 691–712.",
                "Carruthers, P., 2000, <em>Phenomenal Consciousness</em>, Cambridge:\nCambridge University Press.",
                "Casati, R., 1990, “What is Wrong in Inverting Spectra?”\n<em>Theoria</em>, 10: 183–6.",
                "Chalmers, D., 1995, “Absent Qualia, Fading Qualia, Dancing\nQualia”, in <em>Conscious Experience</em>, T. Metzinger (ed.),\nFerdinand-Schoningh: Paderborn, pp. 309–328. ",
                "–––, 1996, <em>The Conscious Mind</em>, Oxford:\nOxford University Press.",
                "–––, 2002, <em>Philosophy of Mind</em>, Oxford:\nOxford University Press.",
                "–––, 2004, “The Representational Character\nof Experience”, in <em>The Future for Philosophy</em>, B. Leiter\n(ed.), Oxford: Oxford University Press, pp. 153–181. \n [<a href=\"http://consc.net/papers/representation.pdf\" target=\"other\">Preprint available online</a>.]",
                "Chalmers, D., and Jackson, F., 2001, “Conceptual Analysis and\nReductive Explanation”, <em>Philosophical Review</em>, 110:\n315–61. \n [<a href=\"http://consc.net/papers/analysis.pdf\" target=\"other\">Preprint available online</a>.]",
                "Churchland, P. M., and Churchland, P. S., 1981,\n“Functionalism, Qualia, and Intentionality”,\n<em>Philosophical Topics</em>, 12: 121–46.",
                "Clark, A., 1985, “Spectrum Inversion and the Color\nSolid”, <em>Southern Journal of Philosophy</em>, 23(4):\n431–43.  doi:10.1111/j.2041-6962.1985.tb00413.x",
                "–––, 1993, <em>Sensory Qualities</em>, Oxford:\nOxford University Press.",
                "–––, 2000, <em>A Theory of Sentience</em>,\nOxford: Oxford University Press.",
                "Cohen, J., 2001, “Color, Content, and Fred: On a Proposed\nReductio of the Inverted Spectrum Hypothesis”, <em>Philosophical\nStudies</em>, 103: 121–44.",
                "–––, 2004, “Color Properties and\nColor Ascriptions: A Relationalist Manifesto”, <em>Philosophical\n Review</em>, 113 (October): 451–506, \n [<a href=\"http://aardvark.ucsd.edu/color/relational.pdf\" target=\"other\">Preprint available online</a>.]",
                "Cole, D. J., 1990, “Functionalism and Inverted\nSpectra”, <em>Synthese</em>, 82: 207–22.",
                "Crane, T., 2000, “The Origins of Qualia”, in\n<em>History of the Mind-Body Problem</em>, T. Crane and S. Patterson\n(eds.), London: Routledge, pp. 169–194.",
                "Davidson, D., 1987, “Knowing One’s Own Mind”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 60: 441–58. Reprinted in Davidson, 2001,\n<em>Subjective, Intersubjective, Objective</em>, Oxford: Oxford\nUniversity Press.",
                "Davies, M., 1997, “Externalism and Experience”, in\n<em>The Nature of Consciousness</em>, N. Block, O. Flanagan and G.\nGüzeldere (eds.), Cambridge, MA: MIT Press, pp. 309–327.",
                "Dennett, D. C., 1988, “Quining Qualia”, in\n<em>Consciousness and Contemporary Science</em>, A. Marcel and E.\nBisiach (eds.), Oxford: Oxford University Press, pp. 226–246;\npage reference is to the reprint in Chalmers 2002.",
                "–––, 1991, <em>Consciousness Explained</em>,\nBoston: Little, Brown.",
                "–––, 1993, “The Message is: There is no\n\\(Me\\)dium”, <em>Philosophy and Phenomenological\nResearch</em>, 53: 919–31.",
                "–––, 1994, “Instead of Qualia”, in\n<em>Consciousness in Philosophy and Cognitive Neuroscience,</em>\nA. Revonsuo and M. Kamppinen (eds.), Hillsdale, NJ: Lawrence\nErlbaum, pp. 129–139.",
                "Dretske, F., 1995, <em>Naturalizing the Mind</em>, Cambridge, MA:\nMIT Press.",
                "Egan, A., 2006, “Appearance Properties?”,\n<em>Noûs</em>, 40(3): 495–521.\n [<a href=\"http://sitemaker.umich.edu/egana/files/aps.pdf\" target=\"other\">Preprint available online</a>]",
                "Fodor, J., 1992, <em>A Theory of Content and Other Essays</em>,\nCambridge, MA: MIT Press.",
                "Ford, J., 2011, “Tye-dyed Teleology and the Inverted Spectrum”,\n<em>Philosophical Studies</em>, 156: 267–81.",
                "Frege, G., 1884 [1953], <em>The Foundations of Arithmetic</em>,\nOxford: Blackwell.",
                "Gert, B., 1965, “Imagination and Verifiability”,\n<em>Philosophical Studies</em>, 16: 44–47.",
                "–––, 2017, <em>Primitive Colors</em>, Oxford:\nOxford University Press.",
                "Gibbons, J., 1965, “Qualia: They’re not what they seem”,\n<em>Philosophical Studies</em>, 126: 397–428.",
                "Goodman, N., 1951, <em>The Structure of Appearance</em>, Cambridge,\nMA: Harvard University Press.",
                "Hardin, C. L., 1987, “Qualia and Materialism: Closing the\nExplanatory Gap”, <em>Philosophy and Phenomenological\nResearch</em>, 48: 281–98.",
                "–––, 1991, “Reply to Levine’s ‘Cool\nRed’”, <em>Philosophical Psychology</em>, 4: 41–50.",
                "–––, 1993, <em>Color for Philosophers</em>\n(expanded edition), Indianapolis: Hackett.",
                "–––, 1997, “Reinverting the\nSpectrum”, in <em>Readings on Color, Volume 1: The Philosophy of\nColor,</em> A. Byrne and D. R. Hilbert (eds.), Cambridge, MA: MIT\nPress, pp. 289–312.",
                "–––, 1999a, “Color Quality and\nStructure”, in <em>Toward a Science of Consciousness III: The\nThird Tucson Discussions and Debates</em>, S. Hameroff, A. Kaszniak,\nD. Chalmers, (eds.), Cambridge, MA: MIT Press, pp.65–74.\n",
                "–––, 1999b, “Color Relations and the\nPower of Complexity”, <em>Behavioral and Brain Sciences</em>,\n22: 963–4.",
                "–––, 2003, “A Spectral Reflectance Doth\nNot a Color Make”, <em>Journal of Philosophy</em>, 100:\n191–202.",
                "Harman, G., 1982, “Conceptual Role Semantics”,\n<em>Notre Dame Journal of Formal Logic</em>, 23: 242–56.",
                "–––, 1990, “The Intrinsic Quality of\nExperience”, <em>Philosophical Perspectives</em>, 4: 31–52.",
                "Harrison, B., 1967, “On Describing Colors”,\n<em>Inquiry</em>, 10: 38–52.",
                "–––, 1973, <em>Form and Content</em>, Oxford:\nBlackwell.",
                "Harvey, J., 1979, “Systematic Transposition of\nColours”, <em>Australasian Journal of Philosophy</em>, 57:\n211–19.",
                "Hellie, B., 2004, “Inexpressible Truths and the Allure of the\nKnowledge Argument”, in <em>There’s Something about Mary</em>, P.\nLudlow, Y. Nagasawa, and D. Stoljar (eds.), Cambridge, MA: MIT\nPress, pp. 333–364.",
                "Hempel, C., 1965, “Aspects of Scientific Explanation”,\nin <em>Aspects of Scientific Explanation and other Essays in the\nPhilosophy of Science</em>, C. Hempel, New York: Free Press,\npp. 331–496.",
                "Hilbert, D. R., and Kalderon, M., 2000, “Color and the\nInverted Spectrum”, in <em>Color Perception: Philosophical,\nPsychological, Artistic, and Computational Perspectives</em>, S. Davis\n(ed.), Oxford: Oxford University Press, pp. 187–214.",
                "Hill, C., 1991, <em>Sensations: A Defense of Type Materialism</em>,\nCambridge: Cambridge University Press.",
                "Horgan, T., 1984, “Functionalism, Qualia, and the Inverted\nSpectrum”, <em>Philosophy and Phenomenological Research,</em> 44:\n453–70.",
                "Horgan, T., and Tienson, J., 2002, “The Intentionality of\nPhenomenology and the Phenomenology of Intentionality”, in\n<em>Philosophy of Mind</em>, D. Chalmers (ed.), Oxford: Oxford\nUniversity Press, pp.520–533.",
                "Hurley, S. L., 1998, <em>Consciousness in Action</em>, Cambridge,\nMA: Harvard University Press.",
                "Hurvich, L. M., Jameson, D., and Cohen, J. D., 1968, “The\nExperimental Determination of Unique Green in the Spectrum”,\n<em>Perceptual Psychophysics</em>, 4: 65–8.",
                "Jacovides, M., 1999, “Locke’s Resemblance Theses”,\n<em>Philosophical Review</em>, 108: 461–96.",
                "Jackson, F., 1977, <em>Perception</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1982, “Epiphenomenal Qualia”,\n<em>Philosophical Quarterly</em>, 32: 127–36. Reprinted in Chalmers\n2002.",
                "–––, 1998, <em>From Metaphysics to Ethics: A\nDefense of Conceptual Analysis</em>, Oxford: Oxford University\nPress.",
                "Johnsen, B. C., 1986, “The Inverted Spectrum”,\n<em>Australasian Journal of Philosophy</em>, 64: 471–6.",
                "–––, 1993, “The Intelligibility of\nSpectrum Inversion”, <em>Canadian Journal of Philosophy</em>,\n23: 631–6.",
                "Kaiser, P. K., and Boynton, R. M., 1996, <em>Human Color\nVision</em>, Washington, DC: Optical Society of America.",
                "Kay, P., 1999, “Asymmetries in the Distribution of Composite\nand Derived Basic Color Categories”, <em>Behavioral and Brain\nSciences</em>, 22: 957–8.",
                "Kirk, R., 1982, “Goodbye to Transposed Qualia”,\n<em>Proceedings of the Aristotelian Society</em>, 82: 33–44.",
                "–––, 1994, <em>Raw Feeling</em>, Oxford: Oxford\nUniversity Press.",
                "Kuehni, R. G., 2003, <em>Color Space and Its Divisions: Color Order\nfrom Antiquity to the Present</em>, Hoboken, NJ: Wiley.",
                "Levine, J., 1983, “Materialism and Qualia: The Explanatory\nGap”, <em>Pacific Philosophical Quarterly</em>, 64:\n354–61; page reference is to the reprint in Chalmers 2002.",
                "–––, 1988, “Absent and Inverted Qualia\nRevisited”, <em>Mind and Language</em>, 3: 271–87.",
                "–––, 1991, “Cool Red”,\n<em>Philosophical Psychology</em>, 4: 27–40.",
                "–––, 2001, <em>Purple Haze: The Puzzle of\nConsciousness</em>, Oxford: Oxford University Press.",
                "Lewis, C. I., 1929, <em>Mind and the World Order</em>, New York:\nScribner’s.",
                "Lewis, D., 1980, “Mad Pain and Martian Pain”, in\n<em>Readings in Philosophy of Psychology</em>, Vol. 1, N. Block, (ed.),\nCambridge, MA: Harvard University Press, pp. 216–222.",
                "–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Blackwell.",
                "Littlejohn, C., 2009, “On the Coherence of\nInversion”, <em>Acta Analytica</em>, 24: 127–37.",
                "Locke, J., 1689/1975, <em>Essay Concerning Human\nUnderstanding</em>, Oxford: Oxford University Press.",
                "Lycan, W. G., 1973, “Inverted Spectrum”,\n<em>Ratio</em>, 15: 315–9.",
                "–––, 1987, <em>Consciousness</em>, Cambridge,\nMA: MIT Press.",
                "–––, 1996, <em>Consciousness and\nExperience</em>, Cambridge, MA: MIT Press.",
                "MacLaury, R. E., 1999, “Asymmetry Among Hering Primaries\nThwarts the Inverted Spectrum Argument”, <em>Behavioral and Brain\nSciences</em>, 22: 960–961.",
                "Macpherson, F., 2005, “Colour Inversion Problems for\nRepresentationalism”, <em>Philosophy and Phenomenological\nResearch</em>, 70: 127–52.",
                "Malebranche, N. 1674–5 [1997], <em>The Search After\nTruth</em>, T. Lennon and P. Olscamp (eds. and trans.), Cambridge:\nCambridge University Press.",
                "Marcus, E., 2006, “Intentionalism and the Imaginability of\nthe Inverted Spectrum”, <em>Philosophical Quarterly</em>, 56:\n321–39.",
                "Mausfeld, R., 2003, “‘Colour’ as Part of the\nFormat of Different Perceptual Primitives: the Dual Coding of\nColour”, in <em>Colour Perception: Mind and the Physical\nWorld</em>, R.  Mausfeld and D. Heyer (eds.), Oxford: Oxford\nUniversity Press, pp. 381–430. ",
                "McGinn, C., 1983, <em>The Subjective View</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1989, <em>Mental Content</em>, Oxford:\nBlackwell.",
                "McLaughlin, B., 2003, “The Place of Color in Nature”,\nin <em>Colour Perception: Mind and the Physical World</em>, R. Mausfeld and D.\nHeyer (eds.), Oxford: Oxford University Press, pp. 475–502. ",
                "Meyer, U., 2000, “Do Pseudonormal Persons Have Inverted\nQualia? Scientific Hypotheses and Philosophical Interpretations”,\n<em>Facta Philosophica</em>, 2: 309–25.",
                "Mollon, J., Pokorny, J., and Knoblauch, K. (eds.), 2003, <em>Normal\nand Defective Colour Vision</em>, Oxford: Oxford University Press.",
                "Moore, G. E., 1953, <em>Some Main Problems of Philosophy</em>,\nLondon: George Allen &amp; Unwin.",
                "Myin, E., 2001, “Color and the Duplication Assumption”,\n<em>Synthese</em>, 129: 61–77.",
                "Nida-Rümelin, M., 1996, “Pseudonormal Vision: An Actual\nCase of Qualia Inversion?”, <em>Philosophical Studies</em>, 82:\n145–57. Reprinted in Chalmers 2002.",
                "–––, 1999, “Intrinsic Phenomenal\nProperties in Color Vision Science: A Reply to Peter\nRoss”, <em>Consciousness and Cognition</em>, 8:\n571–574.",
                "Noë, A., 2005, <em>Action in Perception</em>,\nCambridge, MA: MIT Press.",
                "Palmer, S., 1999a, “Color, Consciousness, and the Isomorphism\nConstraint”, <em>Behavioral and Brain Sciences</em>, 22:\n923–43.",
                "–––, 1999b, “On Qualia, Relations, and\nStructure in Color Experience”, <em>Behavioral and Brain\nSciences</em>, 22: 976–85.",
                "Papineau, D., 2002, <em>Thinking About Consciousness</em>, Oxford:\nOxford University Press.",
                "Peacocke, C., 1983, <em>Sense and Content</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1988, “The Limits of Intelligibility:\nA Post-Verificationist Proposal”, <em>Philosophical Review</em>,\n97: 463–96.",
                "–––, 2001. “Does Perception have a\nNonconceptual Content?”, <em>Journal of Philosophy</em>, 98:\n239–64.",
                "Piantanida, T. P., 1974, “A Replacement Model of X-linked\nRecessive Colour Vision Defects”, <em>Annals of Human\nGenetics</em>, 37: 393–404.",
                "Putnam, H., 1967, “Psychological Predicates”, in\n<em>Art, Mind and Religion</em>, W. Capitan and D. Merrill (eds.),\nPittsburgh: University of Pittsburgh Press,\npp. 37–48.. Reprinted as “The Nature of Mental\nStates” in Putnam, 1975, <em>Mind, Language, and Reality</em>,\nCambridge: Cambridge University Press.",
                "–––, 1975, “The Meaning of\n‘Meaning’”,<em>Minnesota Studies in the Philosophy\nof Science</em>, 7: 131–193; reprinted in Putnam,\n1975, <em>Mind, Language, and Reality</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1981, <em>Reason, Truth and History</em>,\nCambridge: Cambridge University Press.",
                "Ren, H., 2016, “Inverted Earth Revisited”,\n<em>Erkenntnis</em>, 81: 1093–107.",
                "Rey, G., 1992, “Sensational Sentences Switched”,\n<em>Philosophical Studies</em>, 68: 289–319.",
                "–––, 1998, “A Narrow Representationalist\nAccount of Qualitative Experience”, <em>Philosophical\nPerspectives</em>, 12: 435–58.",
                "Robinson, H., 1994, <em>Perception</em>, London: Routledge.",
                "Ross, P. W., 1999a, “Color Science and Spectrum Inversion:\nFurther Thoughts”, <em>Consciousness and Cognition</em>, 8:\n566–70.",
                "–––, 1999b, “Color Science and Spectrum\nInversion: A Reply to Nida-Rümelin”, <em>Consciousness and\nCognition</em>, 8: 575–576.",
                "–––, 2020, “Spectrum\nInversion”, <em>Routledge Handbook of Philosophy of Colour</em>,\nD. Brown and F. Macpherson (eds.), London: Routledge.",
                "Russell, B., 1927, <em>The Analysis of Matter</em>, London: Kegan\nPaul, Trench, Trubner &amp; Co. Ltd.",
                "Sacks, O., 1997, <em>The Island of the Colorblind</em>, New York:\nKnopf.",
                "Schlick, M., 1932/3, “Positivism and Realism”,\n<em>Erkenntnis</em>, 3; page reference is to the reprint in Ayer\n1959.",
                "Schoettle, T., 2009, “How I Learned to Stop Worrying and\nLove the Inverted Spectrum”,\n<em>Pacific Philosophical Quarterly</em>, 90: 98–115.",
                "Shoemaker, S., 1975a, “Functionalism and Qualia”,\n<em>Philosophical Studies</em>, 27: 291–315. Reprinted in Shoemaker\n1984.",
                "–––, 1975b, “Phenomenal Similarity”,\n<em>Critica</em>, 7: 3–37. Reprinted in Shoemaker 1984.",
                "–––, 1981, “Absent Qualia Are\nImpossible”, <em>Philosophical Review</em>, 90:\n581–99. Reprinted in Shoemaker 1984.",
                "–––, 1982, “The Inverted Spectrum”,\n<em>Journal of Philosophy,</em> 79: 357–81; page reference is to the\nreprint in Shoemaker 1984.",
                "–––, 1984, <em>Identity, Cause, and Mind,</em>\nCambridge: Cambridge University Press.",
                "–––, 1986, “Review of Colin McGinn’s\n<em>The Subjective View</em>”, <em>Journal of Philosophy</em>,\n83: 407–13.",
                "–––, 1991, “Qualia and\nConsciousness”, <em>Mind,</em> 100: 507–24. Reprinted in\nShoemaker 1996a.",
                "–––, 1994a, “Phenomenal Character”,\n<em>Noûs</em>, 28: 21–38.",
                "–––, 1994b, “Self-Knowledge and\n‘Inner-Sense’”, <em>Philosophy and Phenomenological\nResearch</em>, 54: 249–314; page reference is to the reprint in\nShoemaker 1996a.",
                "–––. 1996a, <em>The First-Person Perspective and\nOther Essays</em>, Cambridge: Cambridge University Press.",
                "–––, 1996b,\n“Intersubjective/Intrasubjective”, in Shoemaker\n1996a, pp. 141–154.",
                "–––, 2002, “Content, Character, and\nColor”, Whitehead lectures, Harvard University.",
                "–––, 2006a, “On the Ways Things\nAppear”, in <em>Perceptual Experience</em>, T. Gendler and\nJ. Hawthorne (eds.), Oxford: Oxford University Press, pp.461–480.",
                "–––, 2006b, ‘The Frege-Schlick\nView’, in <em>Content and Modality</em>, J. Thomson and\nA. Byrne (eds.), Oxford: Oxford University Press, pp.18–33.",
                "Speaks, J., 2011, “Spectrum Inversion Without a\nDifference in Representation is Impossible”, <em>Philosophical\nStudies</em>, 156: 339–61.",
                "–––, 2015, <em>The Phenomenal and the\nRepresentational</em>, Oxford: Oxford University Press.",
                "Stalnaker, R., 1987, <em>Inquiry</em>, Cambridge, MA: MIT\nPress.",
                "–––, 1999, “Comparing Qualia Across\nPersons”, <em>Philosophical Topics</em>, 26: 385–405; page\nreference is to the reprint in Stalnaker, 2003, <em>Ways a World Might\nBe</em>, Oxford: Oxford University Press.",
                "–––, 2006, “Shoemaker,\n‘Frege-Schlick View’” (A Response to Shoemaker), in\n<em>Content and Modality</em>, J. Thomson and A. Byrne (eds.), Oxford:\nOxford University Press, pp. 254–257.",
                "Strawson, G., 1989, “Red and ‘Red’”,\n<em>Synthese</em>, 78: 193–232.",
                "–––, 1994, <em>Mental Reality</em>, Cambridge,\nMA: MIT Press.",
                "Sundström, P., 2002, “An Argument Against Spectrum\nInversion”, in <em>Physicalism, Consciousness and Modality:\nEssays in the Philosophy of Mind</em>, S. Lindström and S.\nSundström (eds.), Umeå: The Department of Philosophy and\n Linguistics, pp. 65–94.. \n [<a href=\"http://philpapers.org/archive/SUNAAA\" target=\"other\">Preprint available online in PDF</a>.]",
                "Taylor, D., 1966, “The Incommunicability of Content”,\n<em>Mind</em>, 75: 527–41.",
                "Thau, M., 2002, <em>Consciousness and Cognition</em>, Oxford:\nOxford University Press.",
                "Thompson, B., 2008, “Representationalism and the\nConceivability of Inverted Spectra”, <em>Synthese</em>, 160:\n203–13.",
                "Tye, M., 1994, “Qualia, Content, and the Inverted\nSpectrum”, <em>Noûs</em>, 28: 159–183.",
                "–––, 1995, <em>Ten Problems of\nConsciousness</em>, Cambridge, MA: MIT Press.",
                "–––, 2000, <em>Consciousness, Color, and\nContent</em>, Cambridge, MA: MIT Press.",
                "–––, 2002, “Visual Qualia and Visual\nContent Revisited”, in <em>Philosophy of Mind</em>, D. Chalmers\n(ed.), Oxford: Oxford University Press, pp. 447–456.",
                "–––, 2003, “Qualia”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2003\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2003/entries/qualia/\">https://plato.stanford.edu/archives/sum2003/entries/qualia/</a>&gt;.",
                "Westphal, J., 1991, <em>Colour: A Philosophical Introduction</em>,\nOxford: Blackwell.",
                "White. S., 1994, “Color and Notional Content”,\n<em>Philosophical Topics</em>, 22: 471–503.",
                "Wittgenstein, L., 1958, <em>Philosophical Investigations</em>,\nOxford: Blackwell.",
                "–––, 1968, “Notes for Lectures on\n‘Private Experience’ and ‘Sense-data’”,\n<em>Philosophical Review</em>, 77: 275–320.",
                "–––, 1977, <em>Remarks on Colour</em>, Berkeley:\nUniversity of California Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Allen, K., 2010, “Locke and the Nature of Ideas”,\n<em>Archiv für Geschichte der Philosophie</em>, 92:\n236–255.</li>\n<li>Averill, E. W., 1992, “The Relational Nature of Color”,\n<em>Philosophical Review</em>, 101: 551–88.</li>\n<li>Ayer, A. J., 1936, <em>Language, Truth and Logic</em>, London:\nVictor Gollancz; page reference is to the 1971 reprint, Harmondsworth,\nEngland: Pelican Books.</li>\n<li>–––, (ed.), 1959, <em>Logical Positivism</em>,\nNew York: The Free Press.</li>\n<li>Block, N., 1980, “Troubles with Functionalism”, in\n<em>Readings in Philosophy of Psychology</em>, Vol. 1, N. Block (ed.),\nCambridge, MA: Harvard University Press, pp. 268–305.</li>\n<li>–––, 1990, “Inverted Earth”,\n<em>Philosophical Perspectives</em>, 4: 53–79.</li>\n<li>–––, 1995, “On a Confusion about a\nFunction of Consciousness”, <em>Behavioral and Brain\nSciences</em>, 18: 227–47.</li>\n<li>–––, 1996a, “Mental Paint and Mental\nLatex”, <em>Philosophical Issues</em>, 7: 19–49.</li>\n<li>–––, 1996b, “Functionalism”, in\n<em>The Encyclopedia of Philosophy Supplement</em>, D. Borchert (ed.),\nNew York: Macmillan, pp. 756–761.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/functionalism.pdf\" target=\"other\">Preprint available online in PDF</a>.]</li>\n<li>–––, 1999, “Sexism, Racism, Ageism and the\nNature of Consciousness”, in <em>Philosophical Topics</em>, 26\n(1&amp;2).\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/sexism.html\" target=\"other\">Preprint available online</a>.]</li>\n<li>–––, 2002, “The Harder Problem of\nConsciousness”, <em>Journal of Philosophy</em>, 94: 1–35.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/2002.HarderProblem.pdf\" target=\"other\">Preprint available online</a>.]</li>\n<li>–––, 2003, “Mental Paint”, in\n<em>Reflections and Replies: Essays on the Philosophy of Tyler\nBurge</em>, M. Hahn and B. Ramberg (eds.), Cambridge, MA: MIT Press, pp. 165–200.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/mentalpaint.pdf\" target=\"other\">Preprint available online in PDF</a>.]</li>\n<li>–––, 2007, “Wittgenstein and\nQualia”, <em>Philosophical Perspectives</em>, 21: 73–115.\n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/Wittgenstein_Qualia.pdf\" target=\"other\">Preprint available online in PDF</a>.]</li>\n<li>Block, N. and Fodor, J., 1972, “What Psychological States Are\nNot”, <em>Philosophical Review</em>, 81: 159–81.</li>\n<li>Block, N. and Stalnaker, R., 1999, “Conceptual Analysis,\nDualism, and the Explanatory Gap”, <em>Philosophical Review</em>\n108: 1–46. \n [<a href=\"http://www.nyu.edu/gsas/dept/philo/faculty/block/papers/ExplanatoryGap.html\" target=\"other\">Preprint available online</a>.]</li>\n<li>Boghossian, P., and Velleman, J. D., 1991, “Physicalist\nTheories of Color”, <em>Philosophical Review</em>, 100: 67–106.\nReprinted in Byrne and Hilbert 1997a.</li>\n<li>Brenner, W. H., 2015, “From Inverted Spectra to Colorless\nQualia: A Wittgensteinian Critique”,\n<em>Philosophical Investigations</em>, 38(4): 360–381;\nfirst published online 2014. doi:10.1111/phin.12048</li>\n<li>Broackes, J., 2007, “Black and White and the Inverted\nSpectrum”, <em>Philosophical Quarterly</em>, 57:\n161–75.</li>\n<li>Burge, T., 1979, “Individualism and the Mental”,\n<em>Midwest Studies in Philosophy</em>, 4: 73–121.</li>\n<li>Byrne, A., 2001, “Intentionalism Defended”,\n<em>Philosophical Review</em>, 110: 199–240.</li>\n<li>–––, 2002, “Something About Mary”,\n<em>Grazer Philosophische Studien</em>, 63: 123–40.</li>\n<li>Byrne, A., and Hilbert, D. R., 1997a, <em>Readings on Color, Volume\n1: The Philosophy of Color</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1997b, “Colors and\nReflectances”, in Byrne and Hilbert 1997a, pp. 263–288. \n [<a href=\"http://mit.edu/abyrne/www/colors&amp;reflectances.html\" target=\"other\">Preprint available online</a>.]</li>\n<li>–––, 2003a, “Color Realism and Color\nScience”, <em>Behavioral and Brain Sciences</em>, 26: 3–21.\n [<a href=\"http://mit.edu/abyrne/www/ColorRealism.html\" target=\"other\">Preprint available online</a>\n].</li>\n<li>–––, 2003b, “Color Realism Redux”,\n<em>Behavioral and Brain Sciences</em>, 26: 52–63.\n [<a href=\"http://mit.edu/abyrne/www/colorrealismredux.html\" target=\"other\">Preprint available online</a>.]</li>\n<li>Campbell, N., 2000, “Physicalism, Qualia Inversion, and\nAffective States”, <em>Synthese</em>, 124: 239–55.</li>\n<li>Canfield, J., 2001, “Ned Block, Wittgenstein, and the\nInverted Spectrum”, <em>Philosophia</em>, 37: 691–712.</li>\n<li>Carruthers, P., 2000, <em>Phenomenal Consciousness</em>, Cambridge:\nCambridge University Press.</li>\n<li>Casati, R., 1990, “What is Wrong in Inverting Spectra?”\n<em>Theoria</em>, 10: 183–6.</li>\n<li>Chalmers, D., 1995, “Absent Qualia, Fading Qualia, Dancing\nQualia”, in <em>Conscious Experience</em>, T. Metzinger (ed.),\nFerdinand-Schoningh: Paderborn, pp. 309–328. </li>\n<li>–––, 1996, <em>The Conscious Mind</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2002, <em>Philosophy of Mind</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2004, “The Representational Character\nof Experience”, in <em>The Future for Philosophy</em>, B. Leiter\n(ed.), Oxford: Oxford University Press, pp. 153–181. \n [<a href=\"http://consc.net/papers/representation.pdf\" target=\"other\">Preprint available online</a>.]</li>\n<li>Chalmers, D., and Jackson, F., 2001, “Conceptual Analysis and\nReductive Explanation”, <em>Philosophical Review</em>, 110:\n315–61. \n [<a href=\"http://consc.net/papers/analysis.pdf\" target=\"other\">Preprint available online</a>.]</li>\n<li>Churchland, P. M., and Churchland, P. S., 1981,\n“Functionalism, Qualia, and Intentionality”,\n<em>Philosophical Topics</em>, 12: 121–46.</li>\n<li>Clark, A., 1985, “Spectrum Inversion and the Color\nSolid”, <em>Southern Journal of Philosophy</em>, 23(4):\n431–43.  doi:10.1111/j.2041-6962.1985.tb00413.x</li>\n<li>–––, 1993, <em>Sensory Qualities</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2000, <em>A Theory of Sentience</em>,\nOxford: Oxford University Press.</li>\n<li>Cohen, J., 2001, “Color, Content, and Fred: On a Proposed\nReductio of the Inverted Spectrum Hypothesis”, <em>Philosophical\nStudies</em>, 103: 121–44.</li>\n<li>–––, 2004, “Color Properties and\nColor Ascriptions: A Relationalist Manifesto”, <em>Philosophical\n Review</em>, 113 (October): 451–506, \n [<a href=\"http://aardvark.ucsd.edu/color/relational.pdf\" target=\"other\">Preprint available online</a>.]</li>\n<li>Cole, D. J., 1990, “Functionalism and Inverted\nSpectra”, <em>Synthese</em>, 82: 207–22.</li>\n<li>Crane, T., 2000, “The Origins of Qualia”, in\n<em>History of the Mind-Body Problem</em>, T. Crane and S. Patterson\n(eds.), London: Routledge, pp. 169–194.</li>\n<li>Davidson, D., 1987, “Knowing One’s Own Mind”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 60: 441–58. Reprinted in Davidson, 2001,\n<em>Subjective, Intersubjective, Objective</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Davies, M., 1997, “Externalism and Experience”, in\n<em>The Nature of Consciousness</em>, N. Block, O. Flanagan and G.\nGüzeldere (eds.), Cambridge, MA: MIT Press, pp. 309–327.</li>\n<li>Dennett, D. C., 1988, “Quining Qualia”, in\n<em>Consciousness and Contemporary Science</em>, A. Marcel and E.\nBisiach (eds.), Oxford: Oxford University Press, pp. 226–246;\npage reference is to the reprint in Chalmers 2002.</li>\n<li>–––, 1991, <em>Consciousness Explained</em>,\nBoston: Little, Brown.</li>\n<li>–––, 1993, “The Message is: There is no\n\\(Me\\)dium”, <em>Philosophy and Phenomenological\nResearch</em>, 53: 919–31.</li>\n<li>–––, 1994, “Instead of Qualia”, in\n<em>Consciousness in Philosophy and Cognitive Neuroscience,</em>\nA. Revonsuo and M. Kamppinen (eds.), Hillsdale, NJ: Lawrence\nErlbaum, pp. 129–139.</li>\n<li>Dretske, F., 1995, <em>Naturalizing the Mind</em>, Cambridge, MA:\nMIT Press.</li>\n<li>Egan, A., 2006, “Appearance Properties?”,\n<em>Noûs</em>, 40(3): 495–521.\n [<a href=\"http://sitemaker.umich.edu/egana/files/aps.pdf\" target=\"other\">Preprint available online</a>]</li>\n<li>Fodor, J., 1992, <em>A Theory of Content and Other Essays</em>,\nCambridge, MA: MIT Press.</li>\n<li>Ford, J., 2011, “Tye-dyed Teleology and the Inverted Spectrum”,\n<em>Philosophical Studies</em>, 156: 267–81.</li>\n<li>Frege, G., 1884 [1953], <em>The Foundations of Arithmetic</em>,\nOxford: Blackwell.</li>\n<li>Gert, B., 1965, “Imagination and Verifiability”,\n<em>Philosophical Studies</em>, 16: 44–47.</li>\n<li>–––, 2017, <em>Primitive Colors</em>, Oxford:\nOxford University Press.</li>\n<li>Gibbons, J., 1965, “Qualia: They’re not what they seem”,\n<em>Philosophical Studies</em>, 126: 397–428.</li>\n<li>Goodman, N., 1951, <em>The Structure of Appearance</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Hardin, C. L., 1987, “Qualia and Materialism: Closing the\nExplanatory Gap”, <em>Philosophy and Phenomenological\nResearch</em>, 48: 281–98.</li>\n<li>–––, 1991, “Reply to Levine’s ‘Cool\nRed’”, <em>Philosophical Psychology</em>, 4: 41–50.</li>\n<li>–––, 1993, <em>Color for Philosophers</em>\n(expanded edition), Indianapolis: Hackett.</li>\n<li>–––, 1997, “Reinverting the\nSpectrum”, in <em>Readings on Color, Volume 1: The Philosophy of\nColor,</em> A. Byrne and D. R. Hilbert (eds.), Cambridge, MA: MIT\nPress, pp. 289–312.</li>\n<li>–––, 1999a, “Color Quality and\nStructure”, in <em>Toward a Science of Consciousness III: The\nThird Tucson Discussions and Debates</em>, S. Hameroff, A. Kaszniak,\nD. Chalmers, (eds.), Cambridge, MA: MIT Press, pp.65–74.\n</li>\n<li>–––, 1999b, “Color Relations and the\nPower of Complexity”, <em>Behavioral and Brain Sciences</em>,\n22: 963–4.</li>\n<li>–––, 2003, “A Spectral Reflectance Doth\nNot a Color Make”, <em>Journal of Philosophy</em>, 100:\n191–202.</li>\n<li>Harman, G., 1982, “Conceptual Role Semantics”,\n<em>Notre Dame Journal of Formal Logic</em>, 23: 242–56.</li>\n<li>–––, 1990, “The Intrinsic Quality of\nExperience”, <em>Philosophical Perspectives</em>, 4: 31–52.</li>\n<li>Harrison, B., 1967, “On Describing Colors”,\n<em>Inquiry</em>, 10: 38–52.</li>\n<li>–––, 1973, <em>Form and Content</em>, Oxford:\nBlackwell.</li>\n<li>Harvey, J., 1979, “Systematic Transposition of\nColours”, <em>Australasian Journal of Philosophy</em>, 57:\n211–19.</li>\n<li>Hellie, B., 2004, “Inexpressible Truths and the Allure of the\nKnowledge Argument”, in <em>There’s Something about Mary</em>, P.\nLudlow, Y. Nagasawa, and D. Stoljar (eds.), Cambridge, MA: MIT\nPress, pp. 333–364.</li>\n<li>Hempel, C., 1965, “Aspects of Scientific Explanation”,\nin <em>Aspects of Scientific Explanation and other Essays in the\nPhilosophy of Science</em>, C. Hempel, New York: Free Press,\npp. 331–496.</li>\n<li>Hilbert, D. R., and Kalderon, M., 2000, “Color and the\nInverted Spectrum”, in <em>Color Perception: Philosophical,\nPsychological, Artistic, and Computational Perspectives</em>, S. Davis\n(ed.), Oxford: Oxford University Press, pp. 187–214.</li>\n<li>Hill, C., 1991, <em>Sensations: A Defense of Type Materialism</em>,\nCambridge: Cambridge University Press.</li>\n<li>Horgan, T., 1984, “Functionalism, Qualia, and the Inverted\nSpectrum”, <em>Philosophy and Phenomenological Research,</em> 44:\n453–70.</li>\n<li>Horgan, T., and Tienson, J., 2002, “The Intentionality of\nPhenomenology and the Phenomenology of Intentionality”, in\n<em>Philosophy of Mind</em>, D. Chalmers (ed.), Oxford: Oxford\nUniversity Press, pp.520–533.</li>\n<li>Hurley, S. L., 1998, <em>Consciousness in Action</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Hurvich, L. M., Jameson, D., and Cohen, J. D., 1968, “The\nExperimental Determination of Unique Green in the Spectrum”,\n<em>Perceptual Psychophysics</em>, 4: 65–8.</li>\n<li>Jacovides, M., 1999, “Locke’s Resemblance Theses”,\n<em>Philosophical Review</em>, 108: 461–96.</li>\n<li>Jackson, F., 1977, <em>Perception</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1982, “Epiphenomenal Qualia”,\n<em>Philosophical Quarterly</em>, 32: 127–36. Reprinted in Chalmers\n2002.</li>\n<li>–––, 1998, <em>From Metaphysics to Ethics: A\nDefense of Conceptual Analysis</em>, Oxford: Oxford University\nPress.</li>\n<li>Johnsen, B. C., 1986, “The Inverted Spectrum”,\n<em>Australasian Journal of Philosophy</em>, 64: 471–6.</li>\n<li>–––, 1993, “The Intelligibility of\nSpectrum Inversion”, <em>Canadian Journal of Philosophy</em>,\n23: 631–6.</li>\n<li>Kaiser, P. K., and Boynton, R. M., 1996, <em>Human Color\nVision</em>, Washington, DC: Optical Society of America.</li>\n<li>Kay, P., 1999, “Asymmetries in the Distribution of Composite\nand Derived Basic Color Categories”, <em>Behavioral and Brain\nSciences</em>, 22: 957–8.</li>\n<li>Kirk, R., 1982, “Goodbye to Transposed Qualia”,\n<em>Proceedings of the Aristotelian Society</em>, 82: 33–44.</li>\n<li>–––, 1994, <em>Raw Feeling</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Kuehni, R. G., 2003, <em>Color Space and Its Divisions: Color Order\nfrom Antiquity to the Present</em>, Hoboken, NJ: Wiley.</li>\n<li>Levine, J., 1983, “Materialism and Qualia: The Explanatory\nGap”, <em>Pacific Philosophical Quarterly</em>, 64:\n354–61; page reference is to the reprint in Chalmers 2002.</li>\n<li>–––, 1988, “Absent and Inverted Qualia\nRevisited”, <em>Mind and Language</em>, 3: 271–87.</li>\n<li>–––, 1991, “Cool Red”,\n<em>Philosophical Psychology</em>, 4: 27–40.</li>\n<li>–––, 2001, <em>Purple Haze: The Puzzle of\nConsciousness</em>, Oxford: Oxford University Press.</li>\n<li>Lewis, C. I., 1929, <em>Mind and the World Order</em>, New York:\nScribner’s.</li>\n<li>Lewis, D., 1980, “Mad Pain and Martian Pain”, in\n<em>Readings in Philosophy of Psychology</em>, Vol. 1, N. Block, (ed.),\nCambridge, MA: Harvard University Press, pp. 216–222.</li>\n<li>–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Blackwell.</li>\n<li>Littlejohn, C., 2009, “On the Coherence of\nInversion”, <em>Acta Analytica</em>, 24: 127–37.</li>\n<li>Locke, J., 1689/1975, <em>Essay Concerning Human\nUnderstanding</em>, Oxford: Oxford University Press.</li>\n<li>Lycan, W. G., 1973, “Inverted Spectrum”,\n<em>Ratio</em>, 15: 315–9.</li>\n<li>–––, 1987, <em>Consciousness</em>, Cambridge,\nMA: MIT Press.</li>\n<li>–––, 1996, <em>Consciousness and\nExperience</em>, Cambridge, MA: MIT Press.</li>\n<li>MacLaury, R. E., 1999, “Asymmetry Among Hering Primaries\nThwarts the Inverted Spectrum Argument”, <em>Behavioral and Brain\nSciences</em>, 22: 960–961.</li>\n<li>Macpherson, F., 2005, “Colour Inversion Problems for\nRepresentationalism”, <em>Philosophy and Phenomenological\nResearch</em>, 70: 127–52.</li>\n<li>Malebranche, N. 1674–5 [1997], <em>The Search After\nTruth</em>, T. Lennon and P. Olscamp (eds. and trans.), Cambridge:\nCambridge University Press.</li>\n<li>Marcus, E., 2006, “Intentionalism and the Imaginability of\nthe Inverted Spectrum”, <em>Philosophical Quarterly</em>, 56:\n321–39.</li>\n<li>Mausfeld, R., 2003, “‘Colour’ as Part of the\nFormat of Different Perceptual Primitives: the Dual Coding of\nColour”, in <em>Colour Perception: Mind and the Physical\nWorld</em>, R.  Mausfeld and D. Heyer (eds.), Oxford: Oxford\nUniversity Press, pp. 381–430. </li>\n<li>McGinn, C., 1983, <em>The Subjective View</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1989, <em>Mental Content</em>, Oxford:\nBlackwell.</li>\n<li>McLaughlin, B., 2003, “The Place of Color in Nature”,\nin <em>Colour Perception: Mind and the Physical World</em>, R. Mausfeld and D.\nHeyer (eds.), Oxford: Oxford University Press, pp. 475–502. </li>\n<li>Meyer, U., 2000, “Do Pseudonormal Persons Have Inverted\nQualia? Scientific Hypotheses and Philosophical Interpretations”,\n<em>Facta Philosophica</em>, 2: 309–25.</li>\n<li>Mollon, J., Pokorny, J., and Knoblauch, K. (eds.), 2003, <em>Normal\nand Defective Colour Vision</em>, Oxford: Oxford University Press.</li>\n<li>Moore, G. E., 1953, <em>Some Main Problems of Philosophy</em>,\nLondon: George Allen &amp; Unwin.</li>\n<li>Myin, E., 2001, “Color and the Duplication Assumption”,\n<em>Synthese</em>, 129: 61–77.</li>\n<li>Nida-Rümelin, M., 1996, “Pseudonormal Vision: An Actual\nCase of Qualia Inversion?”, <em>Philosophical Studies</em>, 82:\n145–57. Reprinted in Chalmers 2002.</li>\n<li>–––, 1999, “Intrinsic Phenomenal\nProperties in Color Vision Science: A Reply to Peter\nRoss”, <em>Consciousness and Cognition</em>, 8:\n571–574.</li>\n<li>Noë, A., 2005, <em>Action in Perception</em>,\nCambridge, MA: MIT Press.</li>\n<li>Palmer, S., 1999a, “Color, Consciousness, and the Isomorphism\nConstraint”, <em>Behavioral and Brain Sciences</em>, 22:\n923–43.</li>\n<li>–––, 1999b, “On Qualia, Relations, and\nStructure in Color Experience”, <em>Behavioral and Brain\nSciences</em>, 22: 976–85.</li>\n<li>Papineau, D., 2002, <em>Thinking About Consciousness</em>, Oxford:\nOxford University Press.</li>\n<li>Peacocke, C., 1983, <em>Sense and Content</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1988, “The Limits of Intelligibility:\nA Post-Verificationist Proposal”, <em>Philosophical Review</em>,\n97: 463–96.</li>\n<li>–––, 2001. “Does Perception have a\nNonconceptual Content?”, <em>Journal of Philosophy</em>, 98:\n239–64.</li>\n<li>Piantanida, T. P., 1974, “A Replacement Model of X-linked\nRecessive Colour Vision Defects”, <em>Annals of Human\nGenetics</em>, 37: 393–404.</li>\n<li>Putnam, H., 1967, “Psychological Predicates”, in\n<em>Art, Mind and Religion</em>, W. Capitan and D. Merrill (eds.),\nPittsburgh: University of Pittsburgh Press,\npp. 37–48.. Reprinted as “The Nature of Mental\nStates” in Putnam, 1975, <em>Mind, Language, and Reality</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1975, “The Meaning of\n‘Meaning’”,<em>Minnesota Studies in the Philosophy\nof Science</em>, 7: 131–193; reprinted in Putnam,\n1975, <em>Mind, Language, and Reality</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1981, <em>Reason, Truth and History</em>,\nCambridge: Cambridge University Press.</li>\n<li>Ren, H., 2016, “Inverted Earth Revisited”,\n<em>Erkenntnis</em>, 81: 1093–107.</li>\n<li>Rey, G., 1992, “Sensational Sentences Switched”,\n<em>Philosophical Studies</em>, 68: 289–319.</li>\n<li>–––, 1998, “A Narrow Representationalist\nAccount of Qualitative Experience”, <em>Philosophical\nPerspectives</em>, 12: 435–58.</li>\n<li>Robinson, H., 1994, <em>Perception</em>, London: Routledge.</li>\n<li>Ross, P. W., 1999a, “Color Science and Spectrum Inversion:\nFurther Thoughts”, <em>Consciousness and Cognition</em>, 8:\n566–70.</li>\n<li>–––, 1999b, “Color Science and Spectrum\nInversion: A Reply to Nida-Rümelin”, <em>Consciousness and\nCognition</em>, 8: 575–576.</li>\n<li>–––, 2020, “Spectrum\nInversion”, <em>Routledge Handbook of Philosophy of Colour</em>,\nD. Brown and F. Macpherson (eds.), London: Routledge.</li>\n<li>Russell, B., 1927, <em>The Analysis of Matter</em>, London: Kegan\nPaul, Trench, Trubner &amp; Co. Ltd.</li>\n<li>Sacks, O., 1997, <em>The Island of the Colorblind</em>, New York:\nKnopf.</li>\n<li>Schlick, M., 1932/3, “Positivism and Realism”,\n<em>Erkenntnis</em>, 3; page reference is to the reprint in Ayer\n1959.</li>\n<li>Schoettle, T., 2009, “How I Learned to Stop Worrying and\nLove the Inverted Spectrum”,\n<em>Pacific Philosophical Quarterly</em>, 90: 98–115.</li>\n<li>Shoemaker, S., 1975a, “Functionalism and Qualia”,\n<em>Philosophical Studies</em>, 27: 291–315. Reprinted in Shoemaker\n1984.</li>\n<li>–––, 1975b, “Phenomenal Similarity”,\n<em>Critica</em>, 7: 3–37. Reprinted in Shoemaker 1984.</li>\n<li>–––, 1981, “Absent Qualia Are\nImpossible”, <em>Philosophical Review</em>, 90:\n581–99. Reprinted in Shoemaker 1984.</li>\n<li>–––, 1982, “The Inverted Spectrum”,\n<em>Journal of Philosophy,</em> 79: 357–81; page reference is to the\nreprint in Shoemaker 1984.</li>\n<li>–––, 1984, <em>Identity, Cause, and Mind,</em>\nCambridge: Cambridge University Press.</li>\n<li>–––, 1986, “Review of Colin McGinn’s\n<em>The Subjective View</em>”, <em>Journal of Philosophy</em>,\n83: 407–13.</li>\n<li>–––, 1991, “Qualia and\nConsciousness”, <em>Mind,</em> 100: 507–24. Reprinted in\nShoemaker 1996a.</li>\n<li>–––, 1994a, “Phenomenal Character”,\n<em>Noûs</em>, 28: 21–38.</li>\n<li>–––, 1994b, “Self-Knowledge and\n‘Inner-Sense’”, <em>Philosophy and Phenomenological\nResearch</em>, 54: 249–314; page reference is to the reprint in\nShoemaker 1996a.</li>\n<li>–––. 1996a, <em>The First-Person Perspective and\nOther Essays</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1996b,\n“Intersubjective/Intrasubjective”, in Shoemaker\n1996a, pp. 141–154.</li>\n<li>–––, 2002, “Content, Character, and\nColor”, Whitehead lectures, Harvard University.</li>\n<li>–––, 2006a, “On the Ways Things\nAppear”, in <em>Perceptual Experience</em>, T. Gendler and\nJ. Hawthorne (eds.), Oxford: Oxford University Press, pp.461–480.</li>\n<li>–––, 2006b, ‘The Frege-Schlick\nView’, in <em>Content and Modality</em>, J. Thomson and\nA. Byrne (eds.), Oxford: Oxford University Press, pp.18–33.</li>\n<li>Speaks, J., 2011, “Spectrum Inversion Without a\nDifference in Representation is Impossible”, <em>Philosophical\nStudies</em>, 156: 339–61.</li>\n<li>–––, 2015, <em>The Phenomenal and the\nRepresentational</em>, Oxford: Oxford University Press.</li>\n<li>Stalnaker, R., 1987, <em>Inquiry</em>, Cambridge, MA: MIT\nPress.</li>\n<li>–––, 1999, “Comparing Qualia Across\nPersons”, <em>Philosophical Topics</em>, 26: 385–405; page\nreference is to the reprint in Stalnaker, 2003, <em>Ways a World Might\nBe</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2006, “Shoemaker,\n‘Frege-Schlick View’” (A Response to Shoemaker), in\n<em>Content and Modality</em>, J. Thomson and A. Byrne (eds.), Oxford:\nOxford University Press, pp. 254–257.</li>\n<li>Strawson, G., 1989, “Red and ‘Red’”,\n<em>Synthese</em>, 78: 193–232.</li>\n<li>–––, 1994, <em>Mental Reality</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Sundström, P., 2002, “An Argument Against Spectrum\nInversion”, in <em>Physicalism, Consciousness and Modality:\nEssays in the Philosophy of Mind</em>, S. Lindström and S.\nSundström (eds.), Umeå: The Department of Philosophy and\n Linguistics, pp. 65–94.. \n [<a href=\"http://philpapers.org/archive/SUNAAA\" target=\"other\">Preprint available online in PDF</a>.]</li>\n<li>Taylor, D., 1966, “The Incommunicability of Content”,\n<em>Mind</em>, 75: 527–41.</li>\n<li>Thau, M., 2002, <em>Consciousness and Cognition</em>, Oxford:\nOxford University Press.</li>\n<li>Thompson, B., 2008, “Representationalism and the\nConceivability of Inverted Spectra”, <em>Synthese</em>, 160:\n203–13.</li>\n<li>Tye, M., 1994, “Qualia, Content, and the Inverted\nSpectrum”, <em>Noûs</em>, 28: 159–183.</li>\n<li>–––, 1995, <em>Ten Problems of\nConsciousness</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2000, <em>Consciousness, Color, and\nContent</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2002, “Visual Qualia and Visual\nContent Revisited”, in <em>Philosophy of Mind</em>, D. Chalmers\n(ed.), Oxford: Oxford University Press, pp. 447–456.</li>\n<li>–––, 2003, “Qualia”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2003\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2003/entries/qualia/\">https://plato.stanford.edu/archives/sum2003/entries/qualia/</a>&gt;.</li>\n<li>Westphal, J., 1991, <em>Colour: A Philosophical Introduction</em>,\nOxford: Blackwell.</li>\n<li>White. S., 1994, “Color and Notional Content”,\n<em>Philosophical Topics</em>, 22: 471–503.</li>\n<li>Wittgenstein, L., 1958, <em>Philosophical Investigations</em>,\nOxford: Blackwell.</li>\n<li>–––, 1968, “Notes for Lectures on\n‘Private Experience’ and ‘Sense-data’”,\n<em>Philosophical Review</em>, 77: 275–320.</li>\n<li>–––, 1977, <em>Remarks on Colour</em>, Berkeley:\nUniversity of California Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "behaviorism",
            "color",
            "consciousness: and intentionality",
            "consciousness: representational theories of",
            "externalism about the mind",
            "functionalism",
            "Locke, John",
            "mental content",
            "mental content: causal theories of",
            "mental content: narrow",
            "mental content: teleological theories of",
            "other minds",
            "perception: the problem of",
            "physicalism",
            "qualia",
            "sense data"
        ],
        "entry_link": [
            {
                "../behaviorism/": "behaviorism"
            },
            {
                "../color/": "color"
            },
            {
                "../consciousness-intentionality/": "consciousness: and intentionality"
            },
            {
                "../consciousness-representational/": "consciousness: representational theories of"
            },
            {
                "../content-externalism/": "externalism about the mind"
            },
            {
                "../functionalism/": "functionalism"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../content-causal/": "mental content: causal theories of"
            },
            {
                "../content-narrow/": "mental content: narrow"
            },
            {
                "../content-teleological/": "mental content: teleological theories of"
            },
            {
                "../other-minds/": "other minds"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../physicalism/": "physicalism"
            },
            {
                "../qualia/": "qualia"
            },
            {
                "../sense-data/": "sense data"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=qualia-inverted\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/qualia-inverted/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=qualia-inverted&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/qualia-inverted/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=qualia-inverted": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/qualia-inverted/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=qualia-inverted&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/qualia-inverted/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Clark, A., 1996,\n “<a href=\"https://web.archive.org/web/20120202150629/http://selfpace.uconn.edu/paper/CAMPTALK.HTM\" target=\"other\">Inversions Spectral and Bright</a>”,\n comments on Melinda Campbell, Meetings of the Society for Philosophy &amp;\n Psychology, San Francisco.",
            "Egan, A., and John, J., 2003, \n “<a href=\"http://sitemaker.umich.edu/egana/files/puzzperc.pdf\" target=\"other\">A Puzzle about Perception</a>” (pdf).",
            "Nordby, K., 1996, \n “<a href=\"http://consc.net/misc/achromat.html\" target=\"other\">Vision in a Complete Achromat: A Personal Account</a>”.",
            "Rolf Kuehni’s\narticle on <a href=\"http://www.scholarpedia.org/article/Color_spaces\" target=\"other\">Color Spaces</a>.",
            "Wikipedia entry on the <a href=\"https://en.wikipedia.org/wiki/Munsell_color_system\" target=\"other\">Munsell color system</a>.",
            "Eric Schwitzgebel’s <a href=\"http://schwitzsplinters.blogspot.com/2010/06/winner-of-sound-color-qualia-inversion.html\" target=\"other\">Sound-Color Qualia Inversion Contest</a>."
        ],
        "listed_links": [
            {
                "https://web.archive.org/web/20120202150629/http://selfpace.uconn.edu/paper/CAMPTALK.HTM": "Inversions Spectral and Bright"
            },
            {
                "http://sitemaker.umich.edu/egana/files/puzzperc.pdf": "A Puzzle about Perception"
            },
            {
                "http://consc.net/misc/achromat.html": "Vision in a Complete Achromat: A Personal Account"
            },
            {
                "http://www.scholarpedia.org/article/Color_spaces": "Color Spaces"
            },
            {
                "https://en.wikipedia.org/wiki/Munsell_color_system": "Munsell color system"
            },
            {
                "http://schwitzsplinters.blogspot.com/2010/06/winner-of-sound-color-qualia-inversion.html": "Sound-Color Qualia Inversion Contest"
            }
        ]
    }
}