{
    "url": "science-theory-observation",
    "title": "Theory and Observation in Science",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Nora Mills Boyd\n<nboyd@siena.edu>\nJames Bogen",
        "author_links": [
            {
                "https://facultyweb.siena.edu/~nboyd/": "Nora Mills Boyd"
            },
            {
                "mailto:nboyd%40siena%2eedu": "nboyd@siena.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://facultyweb.siena.edu/~nboyd/\" target=\"other\">Nora Mills Boyd</a>\n&lt;<a href=\"mailto:nboyd%40siena%2eedu\"><em>nboyd<abbr title=\" at \">@</abbr>siena<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nJames Bogen\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Jan 6, 2009",
        "substantive revision Mon Jun 14, 2021"
    ],
    "preamble": "\n\nScientists obtain a great deal of the evidence they use by collecting\nand producing empirical results. Much of the standard philosophical\nliterature on this subject comes from 20th century logical\nempiricists, their followers, and critics who embraced their issues\nwhile objecting to some of their aims and assumptions. Discussions\nabout empirical evidence have tended to focus on epistemological\nquestions regarding its role in theory testing. This entry follows\nthat precedent, even though empirical evidence also plays important\nand philosophically interesting roles in other areas including\nscientific discovery, the development of experimental tools and\ntechniques, and the application of scientific theories to practical\nproblems.\n\nThe logical empiricists and their followers devoted much of their\nattention to the distinction between observables and unobservables,\nthe form and content of observation reports, and the epistemic bearing\nof observational evidence on theories it is used to evaluate.\nPhilosophical work in this tradition was characterized by the aim of\nconceptually separating theory and observation, so that observation\ncould serve as the pure basis of theory appraisal. More recently, the\nfocus of the philosophical literature has shifted away from these\nissues, and their close association to the languages and logics of\nscience, to investigations of how empirical data are generated,\nanalyzed, and used in practice. With this shift, we also see\nphilosophers largely setting aside the aspiration of a pure\nobservational basis for scientific knowledge and instead embracing a\nview of science in which the theoretical and empirical are usefully\nintertwined. This entry discusses these topics under the following\nheadings:\n",
    "toc": [
        {
            "#Int": "1. Introduction"
        },
        {
            "#Observationanddata": "2. Observation and data"
        },
        {
            "#Traditionalempiricism": "2.1 Traditional empiricism"
        },
        {
            "#Irrelevanceofobservation": "2.2 The irrelevance of observation per se"
        },
        {
            "#Dataandphenomena": "2.3 Data and phenomena"
        },
        {
            "#Theoryandvalueladenness": "3. Theory and value ladenness"
        },
        {
            "#Perception": "3.1 Perception"
        },
        {
            "#Assuming": "3.2 Assuming the theory to be tested"
        },
        {
            "#Semantics": "3.3 Semantics"
        },
        {
            "#Values": "3.4 Values"
        },
        {
            "#Reuse": "3.5 Reuse"
        },
        {
            "#Epistemicvalue": "4. The epistemic value of empirical evidence"
        },
        {
            "#Confirmation": "4.1 Confirmation"
        },
        {
            "#Saving": "4.2 Saving the phenomena"
        },
        {
            "#Empirical": "4.3 Empirical adequacy"
        },
        {
            "#Con": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nPhilosophers of science have traditionally recognized a special role\nfor observations in the epistemology of science. Observations are the\nconduit through which the ‘tribunal of experience’\ndelivers its verdicts on scientific hypotheses and theories. The\nevidential value of an observation has been assumed to depend on how\nsensitive it is to whatever it is used to study. But this in turn\ndepends on the adequacy of any theoretical claims its sensitivity may\ndepend on. For example, we can challenge the use of a particular\nthermometer reading to support a prediction of a patient’s\ntemperature by challenging theoretical claims having to do with\nwhether a reading from a thermometer like this one, applied in the\nsame way under similar conditions, should indicate the patient’s\ntemperature well enough to count in favor of or against the\nprediction. At least some of those theoretical claims will be such\nthat regardless of whether an investigator explicitly endorses, or is\neven aware of them, her use of the thermometer reading would be\nundermined by their falsity. All observations and uses of\nobservational evidence are theory laden in this sense (cf. Chang 2005,\nAzzouni 2004). As the example of the thermometer illustrates,\nanalogues of Norwood Hanson’s claim that seeing is a theory\nladen undertaking apply just as well to equipment generated\nobservations (Hanson 1958, 19). But if all observations and empirical\ndata are theory laden, how can they provide reality-based, objective\nepistemic constraints on scientific reasoning?\n\nRecent scholarship has turned this question on its head. Why think\nthat theory ladenness of empirical results would be problematic in the\nfirst place? If the theoretical assumptions with which the results are\nimbued are correct, what is the harm of it? After all, it is in virtue\nof those assumptions that the fruits of empirical investigation can be\n‘put in touch’ with theorizing at all. A number scribbled\nin a lab notebook can do a scientist little epistemic good unless she\ncan recruit the relevant background assumptions to even recognize it\nas a reading of the patient’s temperature. But philosophers have\nembraced an entangled picture of the theoretical and empirical that\ngoes much deeper than this. Lloyd (2012) advocates for what she calls\n“complex empiricism” in which there is “no pristine\nseparation of model and data” (397). Bogen (2016) points out\nthat “impure empirical evidence” (i.e. evidence that\nincorporates the judgements of scientists) “often tells us more\nabout the world that it could have if it were pure” (784).\nIndeed, Longino (2020) has urged that “[t]he naïve fantasy\nthat data have an immediate relation to phenomena of the world, that\nthey are ‘objective’ in some strong, ontological sense of\nthat term, that they are the facts of the world directly speaking to\nus, should be finally laid to rest” and that “even the\nprimary, original, state of data is not free from researchers’\nvalue- and theory-laden selection and organization” (391).\n\nThere is not widespread agreement among philosophers of science about\nhow to characterize the nature of scientific theories. What is a\ntheory? According to the traditional syntactic view, theories are\nconsidered to be collections of sentences couched in logical language,\nwhich must then be supplemented with correspondence rules in order to\nbe interpreted. Construed in this way, theories include maximally\ngeneral explanatory and predictive laws (Coulomb’s law of\nelectrical attraction and repulsion, and Maxwellian electromagnetism\nequations for example), along with lesser generalizations that\ndescribe more limited natural and experimental phenomena (e.g., the\nideal gas equations describing relations between temperatures and\npressures of enclosed gasses, and general descriptions of positional\nastronomical regularities). In contrast, the semantic view casts\ntheories as the space of states possible according to the theory, or\nthe set of mathematical models permissible according to the theory\n(see Suppe 1977). However, there are also significantly more\necumenical interpretations of what it means to be a scientific theory,\nwhich include elements of diverse kinds. To take just one illustrative\nexample, Borrelli (2012) characterizes the Standard Model of particle\nphysics as a theoretical framework involving what she calls\n“theoretical cores” that are composed of mathematical\nstructures, verbal stories, and analogies with empirical references\nmixed together (196). This entry aims to accommodate all of these\nviews about the nature of scientific theories.\n\nIn this entry, we trace the contours of traditional philosophical\nengagement with questions surrounding theory and observation in\nscience that attempted to segregate the theoretical from the\nobservational, and to cleanly delineate between the observable and the\nunobservable. We also discuss the more recent scholarship that\nsupplants the primacy of observation by human sensory perception with\nan instrument-inclusive conception of data production and that\nembraces the intertwining of theoretical and empirical in the\nproduction of useful scientific results. Although theory testing\ndominates much of the standard philosophical literature on\nobservation, much of what this entry says about the role of\nobservation in theory testing applies also to its role in inventing,\nand modifying theories, and applying them to tasks in engineering,\nmedicine, and other practical enterprises.\n2. Observation and data\n2.1 Traditional empiricism\n\nReasoning from observations has been important to scientific practice\nat least since the time of Aristotle, who mentions a number of sources\nof observational evidence including animal dissection (Aristotle(a),\n763a/30–b/15; Aristotle(b), 511b/20–25).\nFrancis Bacon argued long ago that the best way to discover things\nabout nature is to use experiences (his term for observations as well\nas experimental results) to develop and improve scientific theories\n(Bacon 1620, 49ff). The role of observational evidence in scientific\ndiscovery was an important topic for Whewell (1858) and Mill (1872)\namong others in the 19th century. But philosophers didn’t talk\nabout observation as extensively, in as much detail, or in the way we\nhave become accustomed to, until the 20th century when\nlogical empiricists transformed philosophical thinking about it.\n\nOne important transformation, characteristic of the linguistic turn in\nphilosophy, was to concentrate on the logic of observation reports\nrather than on objects or phenomena observed. This focus made sense on\nthe assumption that a scientific theory is a system of sentences or\nsentence-like structures (propositions, statements, claims, and so on)\nto be tested by comparison to observational evidence. It was assumed\nthat the comparisons must be understood in terms of inferential\nrelations. If inferential relations hold only between sentence-like\nstructures, it follows that theories must be tested, not against\nobservations or things observed, but against sentences, propositions,\netc. used to report observations (Hempel 1935,\n50–51; Schlick 1935). Theory testing was treated as\na matter of comparing observation sentences describing observations\nmade in natural or laboratory settings to observation sentences that\nshould be true according to the theory to be tested. This was to be\naccomplished by using laws or lawlike generalizations along with\ndescriptions of initial conditions, correspondence rules, and\nauxiliary hypotheses to derive observation sentences describing the\nsensory deliverances of interest. This makes it imperative to ask what\nobservation sentences report.\n\nAccording to what Hempel called the phenomenalist account,\nobservation reports describe the observer’s subjective\nperceptual experiences.\n\n… Such experiential data might be conceived of as being\nsensations, perceptions, and similar phenomena of immediate\nexperience. (Hempel 1952, 674)\n\n\nThis view is motivated by the assumption that the epistemic value of\nan observation report depends upon its truth or accuracy, and that\nwith regard to perception, the only thing observers can know with\ncertainty to be true or accurate is how things appear to them. This\nmeans that we cannot be confident that observation reports are true or\naccurate if they describe anything beyond the observer’s own\nperceptual experience. Presumably one’s confidence in a\nconclusion should not exceed one’s confidence in one’s\nbest reasons to believe it. For the phenomenalist, it follows that\nreports of subjective experience can provide better reasons to believe\nclaims they support than reports of other kinds of evidence.\n\nHowever, given the expressive limitations of the language available\nfor reporting subjective experiences, we cannot expect phenomenalistic\nreports to be precise and unambiguous enough to test theoretical\nclaims whose evaluation requires accurate, fine-grained perceptual\ndiscriminations. Worse yet, if experiences are directly available only\nto those who have them, there is room to doubt whether different\npeople can understand the same observation sentence in the same way.\nSuppose you had to evaluate a claim on the basis of someone\nelse’s subjective report of how a litmus solution looked to her\nwhen she dripped a liquid of unknown acidity into it. How could you\ndecide whether her visual experience was the same as the one you would\nuse her words to report?\n\nSuch considerations led Hempel to propose, contrary to the\nphenomenalists, that observation sentences report ‘directly\nobservable’, ‘intersubjectively ascertainable’ facts\nabout physical objects\n\n… such as the coincidence of the pointer of an instrument with a\nnumbered mark on a dial; a change of color in a test substance or in\nthe skin of a patient; the clicking of an amplifier connected with a\nGeiger counter; etc. (ibid.)\n\n\nThat the facts expressed in observation reports be intersubjectively\nascertainable was critical for the aims of the logical empiricists.\nThey hoped to articulate and explain the authoritativeness widely\nconceded to the best natural, social, and behavioral scientific\ntheories in contrast to propaganda and pseudoscience. Some\npronouncements from astrologers and medical quacks gain wide\nacceptance, as do those of religious leaders who rest their cases on\nfaith or personal revelation, and leaders who use their political\npower to secure assent. But such claims do not enjoy the kind of\ncredibility that scientific theories can attain. The logical\nempiricists tried to account for the genuine credibility of scientific\ntheories by appeal to the objectivity and accessibility of observation\nreports, and the logic of theory testing. Part of what they meant by\ncalling observational evidence objective was that cultural and ethnic\nfactors have no bearing on what can validly be inferred about the\nmerits of a theory from observation reports. So conceived, objectivity\nwas important to the logical empiricists’ criticism of the Nazi\nidea that Jews and Aryans have fundamentally different thought\nprocesses such that physical theories suitable for Einstein and his\nkind should not be inflicted on German students. In response to this\nrationale for ethnic and cultural purging of the German educational\nsystem, the logical empiricists argued that because of its\nobjectivity, observational evidence (rather than ethnic and cultural\nfactors) should be used to evaluate scientific theories (Galison\n1990). In this way of thinking, observational evidence and its\nsubsequent bearing on scientific theories are objective also in virtue\nof being free of non-epistemic values.\n\nEnsuing generations of philosophers of science have found the logical\nempiricist focus on expressing the content of observations in a\nrarefied and basic observation language too narrow. Search for a\nsuitably universal language as required by the logical empiricist\nprogram has come up empty-handed and most philosophers of science have\ngiven up its pursuit. Moreover, as we will discuss in the following\nsection, the centrality of observation itself (and pointer readings)\nto the aims of empiricism in philosophy of science has also come under\nscrutiny. However, leaving the search for a universal pure observation\nlanguage behind does not automatically undercut the norm of\nobjectivity as it relates to the social, political, and cultural\ncontexts of scientific research. Pristine logical foundations aside,\nthe objectivity of ‘neutral’ observations in the face of\nnoxious political propaganda was appealing because it could serve as\nshared ground available for intersubjective appraisal. This appeal\nremains alive and well today, particularly as pernicious\nmisinformation campaigns are again formidable in public discourse (see\nO’Connor and Weatherall 2019). If individuals can genuinely\nappraise the significance of empirical evidence and come to\nwell-justified agreement about how the evidence bears on theorizing,\nthen they can protect their epistemic deliberations from the undue\ninfluence of fascists and other nefarious manipulators. However, this\naspiration must face subtleties arising from the social epistemology\nof science and from the nature of empirical results themselves. In\npractice, the appraisal of scientific results can often require\nexpertise that is not readily accessible to members of the public\nwithout the relevant specialized training. Additionally, precisely\nbecause empirical results are not pure observation reports, their\nappraisal across communities of inquirers operating with different\nbackground assumptions can require significant epistemic work.\n\nThe logical empiricists paid little attention to the distinction\nbetween observing and experimenting and its epistemic implications.\nFor some philosophers, to experiment is to isolate, prepare, and\nmanipulate things in hopes of producing epistemically useful evidence.\nIt had been customary to think of observing as noticing and attending\nto interesting details of things perceived under more or less natural\nconditions, or by extension, things perceived during the course of an\nexperiment. To look at a berry on a vine and attend to its color and\nshape would be to observe it. To extract its juice and apply reagents\nto test for the presence of copper compounds would be to perform an\nexperiment. By now, many philosophers have argued that contrivance and\nmanipulation influence epistemically significant features of\nobservable experimental results to such an extent that epistemologists\nignore them at their peril. Robert Boyle (1661), John Herschell\n(1830), Bruno Latour and Steve Woolgar (1979), Ian Hacking (1983),\nHarry Collins (1985) Allan Franklin (1986), Peter Galison (1987), Jim\nBogen and Jim Woodward (1988), and Hans-Jörg Rheinberger (1997),\nare some of the philosophers and philosophically-minded scientists,\nhistorians, and sociologists of science who gave serious consideration\nto the distinction between observing and experimenting. The logical\nempiricists tended to ignore it. Interestingly, the contemporary\nvantage point that attends to modeling, data processing, and empirical\nresults may suggest a re-unification of observation and intervention\nunder the same epistemological framework. When one no longer thinks of\nscientific observation as pure or direct, and recognizes the power of\ngood modeling to account for confounds without physically intervening\non the target system, the purported epistemic distinction between\nobservation and intervention loses its bite.\n2.2 The irrelevance of observation per se\n\nObservers use magnifying glasses, microscopes, or telescopes to see\nthings that are too small or far away to be seen, or seen clearly\nenough, without them. Similarly, amplification devices are used to\nhear faint sounds. But if to observe something is to perceive it, not\nevery use of instruments to augment the senses qualifies as\nobservational.\n\nPhilosophers generally agree that you can observe the moons of Jupiter\nwith a telescope, or a heartbeat with a stethoscope. The van Fraassen\nof The Scientific Image is a notable exception, for whom to\nbe ‘observable’ meant to be something that, were it\npresent to a creature like us, would be observed. Thus, for van\nFraassen, the moons of Jupiter are observable “since astronauts\nwill no doubt be able to see them as well from close up” (1980,\n16). In contrast, microscopic entities are not observable on van\nFraassen’s account because creatures like us cannot\nstrategically maneuver ourselves to see them, present before us, with\nour unaided senses.\n\nMany philosophers have criticized van Fraassen’s view as overly\nrestrictive. Nevertheless, philosophers differ in their willingness to\ndraw the line between what counts as observable and what does not\nalong the spectrum of increasingly complicated instrumentation. Many\nphilosophers who don’t mind telescopes and microscopes still\nfind it unnatural to say that high energy physicists\n‘observe’ particles or particle interactions when they\nlook at bubble chamber photographs—let alone digital\nvisualizations of energy depositions left in calorimeters that are not\nthemselves inspected. Their intuitions come from the plausible\nassumption that one can observe only what one can see by looking, hear\nby listening, feel by touching, and so on. Investigators can neither\nlook at (direct their gazes toward and attend to) nor visually\nexperience charged particles moving through a detector. Instead they\ncan look at and see tracks in the chamber, in bubble chamber\nphotographs, calorimeter data visualizations, etc.\n\nIn more contentious examples, some philosophers have moved to speaking\nof instrument-augmented empirical research as more like tool use than\nsensing. Hacking (1981) argues that we do not see through a\nmicroscope, but rather with it. Daston and Galison (2007)\nhighlight the inherent interactivity of a scanning tunneling\nmicroscope, in which scientists image and manipulate atoms by\nexchanging electrons between the sharp tip of the microscope and the\nsurface to be imaged (397). Others have opted to stretch the meaning\nof observation to accommodate what we might otherwise be tempted to\ncall instrument-aided detections. For instance, Shapere (1982) argues\nthat while it may initially strike philosophers as counter-intuitive,\nit makes perfect sense to call the detection of neutrinos from the\ninterior of the sun “direct observation.”\n\nThe variety of views on the observable/unobservable distinction hint\nthat empiricists may have been barking up the wrong philosophical\ntree. Many of the things scientists investigate do not interact with\nhuman perceptual systems as required to produce perceptual experiences\nof them. The methods investigators use to study such things argue\nagainst the idea—however plausible it may once have\nseemed—that scientists do or should rely exclusively on their\nperceptual systems to obtain the evidence they need. Thus Feyerabend\nproposed as a thought experiment that if measuring equipment was\nrigged up to register the magnitude of a quantity of interest, a\ntheory could be tested just as well against its outputs as against\nrecords of human perceptions (Feyerabend 1969, 132–137).\nFeyerabend could have made his point with historical examples instead\nof thought experiments. A century earlier Helmholtz estimated the\nspeed of excitatory impulses traveling through a motor nerve. To\ninitiate impulses whose speed could be estimated, he implanted an\nelectrode into one end of a nerve fiber and ran a current into it from\na coil. The other end was attached to a bit of muscle whose\ncontraction signaled the arrival of the impulse. To find out how long\nit took the impulse to reach the muscle he had to know when the\nstimulating current reached the nerve. But\n\n[o]ur senses are not capable of directly perceiving an individual\nmoment of time with such small duration …\n\n\nand so Helmholtz had to resort to what he called ‘artificial\nmethods of observation’ (Olesko and Holmes 1994, 84). This meant\narranging things so that current from the coil could deflect a\ngalvanometer needle. Assuming that the magnitude of the deflection is\nproportional to the duration of current passing from the coil,\nHelmholtz could use the deflection to estimate the duration he could\nnot see (ibid). This sense of ‘artificial observation’ is\nnot to be confused e.g., with using magnifying glasses or telescopes\nto see tiny or distant objects. Such devices enable the observer to\nscrutinize visible objects. The minuscule duration of the current flow\nis not a visible object. Helmholtz studied it by cleverly concocting\ncircumstances so that the deflection of the needle would meaningfully\nconvey the information he needed. Hooke (1705,\n16–17) argued for and designed instruments to\nexecute the same kind of strategy in the 17th century.\n\nIt is of interest that records of perceptual observation are not\nalways epistemically superior to data collected via experimental\nequipment. Indeed, it is not unusual for investigators to use\nnon-perceptual evidence to evaluate perceptual data and correct for\nits errors. For example, Rutherford and Pettersson conducted similar\nexperiments to find out if certain elements disintegrated to emit\ncharged particles under radioactive bombardment. To detect emissions,\nobservers watched a scintillation screen for faint flashes produced by\nparticle strikes. Pettersson’s assistants reported seeing\nflashes from silicon and certain other elements. Rutherford’s\ndid not. Rutherford’s colleague, James Chadwick, visited\nPettersson’s laboratory to evaluate his data. Instead of watching\nthe screen and checking Pettersson’s data against what he saw,\nChadwick arranged to have Pettersson’s assistants watch the\nscreen while unbeknownst to them he manipulated the equipment,\nalternating normal operating conditions with a condition in which\nparticles, if any, could not hit the screen. Pettersson’s data\nwere discredited by the fact that his assistants reported flashes at\nclose to the same rate in both conditions (Stuewer 1985,\n284–288).\n\nWhen the process of producing data is relatively convoluted, it is\neven easier to see that human sense perception is not the ultimate\nepistemic engine. Consider functional magnetic resonance images (fMRI)\nof the brain decorated with colors to indicate magnitudes of\nelectrical activity in different regions during the performance of a\ncognitive task. To produce these images, brief magnetic pulses are\napplied to the subject’s brain. The magnetic force coordinates\nthe precessions of protons in hemoglobin and other bodily stuffs to\nmake them emit radio signals strong enough for the equipment to\nrespond to. When the magnetic force is relaxed, the signals from\nprotons in highly oxygenated hemoglobin deteriorate at a detectably\ndifferent rate than signals from blood that carries less oxygen.\nElaborate algorithms are applied to radio signal records to estimate\nblood oxygen levels at the places from which the signals are\ncalculated to have originated. There is good reason to believe that\nblood flowing just downstream from spiking neurons carries appreciably\nmore oxygen than blood in the vicinity of resting neurons. Assumptions\nabout the relevant spatial and temporal relations are used to estimate\nlevels of electrical activity in small regions of the brain\ncorresponding to pixels in the finished image. The results of all of\nthese computations are used to assign the appropriate colors to pixels\nin a computer generated image of the brain. In view of all of this,\nfunctional brain imaging differs, e.g., from looking and seeing,\nphotographing, and measuring with a thermometer or a galvanometer in\nways that make it uninformative to call it observation. And similarly\nfor many other methods scientists use to produce non-perceptual\nevidence.\n\nThe role of the senses in fMRI data production is limited to such\nthings as monitoring the equipment and keeping an eye on the subject.\nTheir epistemic role is limited to discriminating the colors in the\nfinished image, reading tables of numbers the computer used to assign\nthem, and so on. While it is true that researchers typically use their\nsense of sight to take in visualizations of processed fMRI\ndata—or numbers on a page or screen for that\nmatter—this is not the primary locus of epistemic\naction. Researchers learn about brain processes through fMRI data, to\nthe extent that they do, primarily in virtue of the suitability of the\ncausal connection between the target processes and the data records,\nand of the transformations those data undergo when they are processed\ninto the maps or other results that scientists want to use. The\ninteresting questions are not about observability, i.e. whether\nneuronal activity, blood oxygen levels, proton precessions, radio\nsignals, and so on, are properly understood as observable by creatures\nlike us. The epistemic significance of the fMRI data depends on their\ndelivering us the right sort of access to the target, but observation\nis neither necessary nor sufficient for that\naccess.\n\nFollowing Shapere (1982), one could respond by adopting an extremely\npermissive view of what counts as an ‘observation’ so as\nto allow even highly processed data to count as observations. However,\nit is hard to reconcile the idea that highly processed data like fMRI\nimages record observations with the traditional empiricist notion that\ncalculations involving theoretical assumptions and background beliefs\nmust not be allowed (on pain of loss of objectivity) to intrude into\nthe process of data production. Observation garnered its special\nepistemic status in the first place because it seemed more direct,\nmore immediate, and therefore less distorted and muddled than (say)\ndetection or inference. The production of fMRI images requires\nextensive statistical manipulation based on theories about the radio\nsignals, and a variety of factors having to do with their detection\nalong with beliefs about relations between blood oxygen levels and\nneuronal activity, sources of systematic error, and more. Insofar as\nthe use of the term ‘observation’ connotes this extra\nbaggage of traditional empiricism, it may be better to replace\nobservation-talk with terminology that is more obviously permissive,\nsuch as that of ‘empirical data’ and ‘empirical\nresults.’\n2.3 Data and phenomena\n\nDeposing observation from its traditional perch in empiricist\nepistemologies of science need not estrange philosophers from\nscientific practice. Terms like ‘observation’ and\n‘observation reports’ do not occur nearly as much in\nscientific as in philosophical writings. In their place, working\nscientists tend to talk about data. Philosophers who adopt\nthis usage are free to think about standard examples of observation as\nmembers of a large, diverse, and growing family of data production\nmethods. Instead of trying to decide which methods to classify as\nobservational and which things qualify as observables, philosophers\ncan then concentrate on the epistemic influence of the factors that\ndifferentiate members of the family. In particular, they can focus\ntheir attention on what questions data produced by a given method can\nbe used to answer, what must be done to use that data fruitfully, and\nthe credibility of the answers they afford (Bogen 2016).\n\nSatisfactorily answering such questions warrants further philosophical\nwork. As Bogen and Woodward (1988) have argued, there is often a long\nroad between obtaining a particular dataset replete with\nidiosyncrasies born of unspecified causal nuances to any claim about\nthe phenomenon ultimately of interest to the researchers. Empirical\ndata are typically produced in ways that make it impossible to predict\nthem from the generalizations they are used to test, or to derive\ninstances of those generalizations from data and non ad hoc auxiliary\nhypotheses. Indeed, it is unusual for many members of a set of\nreasonably precise quantitative data to agree with one another, let\nalone with a quantitative prediction. That is because precise,\npublicly accessible data typically cannot be produced except through\nprocesses whose results reflect the influence of causal factors that\nare too numerous, too different in kind, and too irregular in behavior\nfor any single theory to account for them. When Bernard Katz recorded\nelectrical activity in nerve fiber preparations, the numerical values\nof his data were influenced by factors peculiar to the operation of\nhis galvanometers and other pieces of equipment, variations among the\npositions of the stimulating and recording electrodes that had to be\ninserted into the nerve, the physiological effects of their insertion,\nand changes in the condition of the nerve as it deteriorated during\nthe course of the experiment. There were variations in the\ninvestigators’ handling of the equipment. Vibrations shook the\nequipment in response to a variety of irregularly occurring causes\nranging from random error sources to the heavy tread of Katz’s\nteacher, A.V. Hill, walking up and down the stairs outside of the\nlaboratory. That’s a short list. To make matters worse, many of\nthese factors influenced the data as parts of irregularly occurring,\ntransient, and shifting assemblies of causal influences.\n\nThe effects of systematic and random sources of error are typically\nsuch that considerable analysis and interpretation are required to\ntake investigators from data sets to conclusions that can be used to\nevaluate theoretical claims. Interestingly, this applies as much to\nclear cases of perceptual data as to machine produced records. When\n19th and early 20th century astronomers looked\nthrough telescopes and pushed buttons to record the time at which they\nsaw a star pass a crosshair, the values of their data points depended,\nnot only upon light from that star, but also upon features of\nperceptual processes, reaction times, and other psychological factors\nthat varied from observer to observer. No astronomical theory has the\nresources to take such things into account.\n\nInstead of testing theoretical claims by direct comparison to the data\ninitially collected, investigators use data to infer facts about\nphenomena, i.e., events, regularities, processes, etc. whose instances\nare uniform and uncomplicated enough to make them susceptible to\nsystematic prediction and explanation (Bogen and Woodward 1988, 317).\nThe fact that lead melts at temperatures at or close to 327.5 C is an\nexample of a phenomenon, as are widespread regularities among\nelectrical quantities involved in the action potential, the motions of\nastronomical bodies, etc. Theories that cannot be expected to predict\nor explain such things as individual temperature readings can\nnevertheless be evaluated on the basis of how useful they are in\npredicting or explaining phenomena. The same\nholds for the action potential as opposed to the electrical data from\nwhich its features are calculated, and the motions of astronomical\nbodies in contrast to the data of observational astronomy. It is\nreasonable to ask a genetic theory how probable it is (given similar\nupbringings in similar environments) that the offspring of a parent or\nparents diagnosed with alcohol use disorder will develop one or more\nsymptoms the DSM classifies as indicative of alcohol use disorder. But\nit would be quite unreasonable to ask the genetic theory to predict or\nexplain one patient’s numerical score on one trial of a\nparticular diagnostic test, or why a diagnostician wrote a particular\nentry in her report of an interview with an offspring of one of such\nparents (see Bogen and Woodward, 1988,\n319–326).\n\nLeonelli has challenged Bogen and Woodward’s (1988) claim that\ndata are, as she puts it, “unavoidably embedded in one\nexperimental context” (2009, 738). She argues that when data are\nsuitably packaged, they can travel to new epistemic contexts and\nretain epistemic utility—it is not just claims about\nthe phenomena that can travel, data travel too. Preparing data for\nsafe travel involves work, and by tracing data ‘journeys,’\nphilosophers can learn about how the careful labor of researchers,\ndata archivists, and database curators can facilitate useful data\nmobility. While Leonelli’s own work has often focused on data in\nbiology, Leonelli and Tempini (2020) contains many diverse case\nstudies of data journeys from a variety of scientific disciplines that\nwill be of value to philosophers interested in the methodology and\nepistemology of science in practice.\n\nThe fact that theories typically predict and explain features of\nphenomena rather than idiosyncratic data should not be interpreted as\na failing. For many purposes, this is the more useful and illuminating\ncapacity. Suppose you could choose between a theory that predicted or\nexplained the way in which neurotransmitter release relates to\nneuronal spiking (e.g., the fact that on average, transmitters are\nreleased roughly once for every 10 spikes) and a theory which\nexplained or predicted the numbers displayed on the relevant\nexperimental equipment in one, or a few single cases. For most\npurposes, the former theory would be preferable to the latter at the\nvery least because it applies to so many more cases. And similarly for\ntheories that predict or explain something about the probability of\nalcohol use disorder conditional on some genetic factor or a theory\nthat predicted or explained the probability of faulty diagnoses of\nalcohol use disorder conditional on facts about the training that\npsychiatrists receive. For most purposes, these would be preferable to\na theory that predicted specific descriptions in a single particular\ncase history.\n\nHowever, there are circumstances in which scientists do want to\nexplain data. In empirical research it is often crucial to getting a\nuseful signal that scientists deal with sources of background noise\nand confounding signals. This is part of the long road from newly\ncollected data to useful empirical results. An important step on the\nway to eliminating unwanted noise or confounds is to determine their\nsources. Different sources of noise can have different characteristics\nthat can be derived from and explained by theory. Consider the\ndifference between ‘shot noise’ and ‘thermal\nnoise,’ two ubiquitous sources of noise in precision electronics\n(Schottky 1918; Nyquist 1928; Horowitz and Hill 2015). ‘Shot\nnoise’ arises in virtue of the discrete nature of a signal. For\ninstance, light collected by a detector does not arrive all at once or\nin perfectly continuous fashion. Photons rain onto a detector shot by\nshot on account of being quanta. Imagine building up an image one\nphoton at a time—at first the structure of the image\nis barely recognizable, but after the arrival of many photons, the\nimage eventually fills in. In fact, the contribution of noise of this\ntype goes as the square root of the signal. By contrast, thermal noise\nis due to non-zero temperature—thermal fluctuations\ncause a small current to flow in any circuit. If you cool your\ninstrument (which very many precision experiments in physics do) then\nyou can decrease thermal noise. Cooling the detector is not going to\nchange the quantum nature of photons though. Simply collecting more\nphotons will improve the signal to noise ratio with respect to shot\nnoise. Thus, determining what kind of noise is affecting one’s\ndata, i.e. explaining features of the data themselves that are\nidiosyncratic to the particular instruments and conditions prevailing\nduring a specific instance of data collection, can be critical to\neventually generating a dataset that can be used to answer questions\nabout phenomena of interest. In using data that require statistical\nanalysis, it is particularly clear that “empirical assumptions\nabout the factors influencing the measurement results may be used to\nmotivate the assumption of a particular error distribution”,\nwhich can be crucial for justifying the application of methods of\nanalysis (Woodward 2011, 173).\n\nThere are also circumstances in which scientists want to provide a\nsubstantive, detailed explanation for a particular idiosyncratic\ndatum, and even circumstances in which procuring such explanations is\nepistemically imperative. Ignoring outliers without good epistemic\nreasons is just cherry-picking data, one of the canonical\n‘questionable research practices.’ Allan Franklin has described Robert\nMillikan’s convenient exclusion of data he collected from\nobserving the second oil drop in his experiments of April 16, 1912\n(1986, 231). When Millikan initially recorded the data for this drop,\nhis notebooks indicate that he was satisfied his apparatus was working\nproperly and that the experiment was running well—he\nwrote “Publish” next to the data in his lab notebook.\nHowever, after he had later calculated the value for the fundamental\nelectric charge that these data yielded, and found it aberrant with\nrespect to the values he calculated using data collected from other\ngood observing sessions, he changed his mind, writing\n“Won’t work” next to the calculation (ibid., see\nalso Woodward 2010, 794). Millikan not only never published this\nresult, he never published why he failed to publish it. When data are\nexcluded from analysis, there ought to be some explanation justifying\ntheir omission over and above lack of agreement with the\nexperimenters’ expectations. Precisely because they are\noutliers, some data require specific, detailed, idiosyncratic causal\nexplanations. Indeed, it is often in virtue of those very explanations\nthat outliers can be responsibly rejected. Some explanation of data\nrejected as ‘spurious’ is required. Otherwise, scientists\nrisk biasing their own work.\n\nThus, while in transforming data as collected into something useful\nfor learning about phenomena, scientists often account for features of\nthe data such as different types of noise contributions, and sometimes\neven explain the odd outlying data point or artifact, they simply do\nnot explain every individual teensy tiny causal contribution to the\nexact character of a data set or datum in full detail. This is because\nscientists can neither discover such causal minutia nor would their\ninvocation be necessary for typical research questions. The fact that\nit may sometimes be important for scientists to provide detailed\nexplanations of data, and not just claims about phenomena inferred\nfrom data, should not be confused with the dubious claim that\nscientists could ‘in principle’ detail every causal quirk\nthat contributed to some data (Woodward 2010; 2011).\n\nIn view of all of this, together with the fact that a great many\ntheoretical claims can only be tested directly against facts about\nphenomena, it behooves epistemologists to think about how data are\nused to answer questions about phenomena. Lacking space for a detailed\ndiscussion, the most this entry can do is to mention two main kinds of\nthings investigators do in order to draw conclusions from data. The\nfirst is causal analysis carried out with or without the use of\nstatistical techniques. The second is non-causal statistical\nanalysis.\n\nFirst, investigators must distinguish features of the data that are\nindicative of facts about the phenomenon of interest from those which\ncan safely be ignored, and those which must be corrected for.\nSometimes background knowledge makes this easy. Under normal\ncircumstances investigators know that their thermometers are sensitive\nto temperature, and their pressure gauges, to pressure. An astronomer\nor a chemist who knows what spectrographic equipment does, and what\nshe has applied it to will know what her data indicate. Sometimes it\nis less obvious. When Santiago Ramón y Cajal looked through his\nmicroscope at a thin slice of stained nerve tissue, he had to figure\nout which, if any, of the fibers he could see at one focal length\nconnected to or extended from things he could see only at another\nfocal length, or in another slice. Analogous considerations apply to\nquantitative data. It was easy for Katz to tell when his equipment was\nresponding more to Hill’s footfalls on the stairs than to the\nelectrical quantities it was set up to measure. It can be harder to\ntell whether an abrupt jump in the amplitude of a high frequency EEG\noscillation was due to a feature of the subjects brain activity or an\nartifact of extraneous electrical activity in the laboratory or\noperating room where the measurements were made. The answers to\nquestions about which features of numerical and non-numerical data are\nindicative of a phenomenon of interest typically depend at least in\npart on what is known about the causes that conspire to produce the\ndata.\n\nStatistical arguments are often used to deal with questions about the\ninfluence of epistemically relevant causal factors. For example, when\nit is known that similar data can be produced by factors that have\nnothing to do with the phenomenon of interest, Monte Carlo\nsimulations, regression analyses of sample data, and a variety of\nother statistical techniques sometimes provide investigators with\ntheir best chance of deciding how seriously to take a putatively\nilluminating feature of their data.\n\nBut statistical techniques are also required for purposes other than\ncausal analysis. To calculate the magnitude of a quantity like the\nmelting point of lead from a scatter of numerical data, investigators\nthrow out outliers, calculate the mean and the standard deviation,\netc., and establish confidence and significance levels. Regression and\nother techniques are applied to the results to estimate how far from\nthe mean the magnitude of interest can be expected to fall in the\npopulation of interest (e.g., the range of temperatures at which pure\nsamples of lead can be expected to melt).\n\nThe fact that little can be learned from data without causal,\nstatistical, and related argumentation has interesting consequences\nfor received ideas about how the use of observational evidence\ndistinguishes science from pseudoscience, religion, and other\nnon-scientific cognitive endeavors. First, scientists are not the only\nones who use observational evidence to support their claims;\nastrologers and medical quacks use them too. To find epistemically\nsignificant differences, one must carefully consider what sorts of\ndata they use, where it comes from, and how it is employed. The\nvirtues of scientific as opposed to non-scientific theory evaluations\ndepend not only on its reliance on empirical data, but also on how the\ndata are produced, analyzed and interpreted to draw conclusions\nagainst which theories can be evaluated. Secondly, it does not take\nmany examples to refute the notion that adherence to a single,\nuniversally applicable ‘scientific method’ differentiates\nthe sciences from the non-sciences. Data are produced, and used in far\ntoo many different ways to treat informatively as instances of any\nsingle method. Thirdly, it is usually, if not always, impossible for\ninvestigators to draw conclusions to test theories against\nobservational data without explicit or implicit reliance on\ntheoretical resources.\n\nBokulich (2020) has helpfully outlined a taxonomy of various ways in\nwhich data can be model-laden to increase their epistemic utility. She\nfocuses on seven categories: data conversion, data correction, data\ninterpolation, data scaling, data fusion, data assimilation, and\nsynthetic data. Of these categories, conversion and correction are\nperhaps the most familiar. Bokulich reminds us that even in the case\nof reading a temperature from an ordinary mercury thermometer, we are\n‘converting’ the data as measured, which in this case is\nthe height of the column of mercury, to a temperature (ibid., 795). In\nmore complicated cases, such as processing the arrival times of\nacoustic signals in seismic reflection measurements to yield values\nfor subsurface depth, data conversion may involve models (ibid.). In\nthis example, models of the composition and geometry of the subsurface\nare needed in order to account for differences in the speed of sound\nin different materials. Data ‘correction’ involves common\npractices we have already discussed like modeling and mathematically\nsubtracting background noise contributions from one’s dataset\n(ibid., 796). Bokulich rightly points out that involving models in\nthese ways routinely improves the epistemic uses to which data can be\nput. Data interpolation, scaling, and ‘fusion’ are also\nrelatively widespread practices that deserve further philosophical\nanalysis. Interpolation involves filling in missing data in a patchy\ndata set, under the guidance of models. Data are scaled when they have\nbeen generated in a particular scale (temporal, spatial, energy) and\nmodeling assumptions are recruited to transform them to apply at\nanother scale. Data are ‘fused,’ in Bokulich’s\nterminology, when data collected in diverse contexts, using diverse\nmethods are combined, or integrated together. For instance, when data\nfrom ice cores, tree rings, and the historical logbooks of sea\ncaptains are merged into a joint climate dataset. Scientists must take\ncare in combining data of diverse provenance, and model new\nuncertainties arising from the very amalgamation of datasets (ibid.,\n800).\n\nBokulich contrasts ‘synthetic data’ with what she calls\n‘real data’ (ibid., 801–802). Synthetic data are virtual,\nor simulated data, and are not produced by physical interaction with\nworldly research targets. Bokulich emphasizes the role that simulated\ndata can usefully play in testing and troubleshooting aspects of data\nprocessing that are to eventually be deployed on empirical data\n(ibid., 802). It can be incredibly useful for developing and\nstress-testing a data processing pipeline to have fake datasets whose\ncharacteristics are already known in virtue of having been produced by\nthe researchers, and being available for their inspection at will.\nWhen the characteristics of a dataset are known, or indeed can be\ntailored according to need, the effects of new processing methods can\nbe more readily traced than without. In this way, researchers can\nfamiliarize themselves with the effects of a data processing pipeline,\nand make adjustments to that pipeline in light of what they learn by\nfeeding fake data through it, before attempting to use that pipeline\non actual science data. Such investigations can be critical to\neventually arguing for the credibility of the final empirical results\nand their appropriate interpretation and use.\n\nData assimilation is perhaps a less widely appreciated aspect of\nmodel-based data processing among philosophers of science, excepting\nParker (2016; 2017). Bokulich characterizes this method as “the\noptimal integration of data with dynamical model estimates to provide\na more accurate ‘assimilation estimate’ of the\nquantity” (2020, 800). Thus, data assimilation involves\nbalancing the contributions of empirical data and the output of models\nin an integrated estimate, according to the uncertainties associated\nwith these contributions.\n\nBokulich argues that the involvement of models in these various\naspects of data processing does not necessarily lead to better\nepistemic outcomes. Done wrong, integrating models and data can\nintroduce artifacts and make the processed data unreliable for the\npurpose at hand (ibid., 804). Indeed, she notes that “[t]here is\nmuch work for methodologically reflective scientists and philosophers\nof science to do in string out cases in which model-data symbiosis may\nbe problematic or circular” (ibid.)\n3. Theory and value ladenness\n\nEmpirical results are laden with values and theoretical commitments.\nPhilosophers have raised and appraised several possible kinds of\nepistemic problems that could be associated with theory and/or\nvalue-laden empirical results. They have worried about the extent to\nwhich human perception itself is distorted by our commitments. They\nhave worried that drawing upon theoretical resources from the very\ntheory to be appraised (or its competitors) in the generation of\nempirical results yields vicious circularity (or inconsistency). They\nhave also worried that contingent conceptual and/or linguistic\nframeworks trap bits of evidence like bees in amber so that they\ncannot carry on their epistemic lives outside of the contexts of their\norigination, and that normative values necessarily corrupt the\nintegrity of science. Do the theory and value-ladenness of empirical\nresults render them hopelessly parochial? That is, when scientists\nleave theoretical commitments behind and adopt new ones, must they\nalso relinquish the fruits of the empirical research imbued with their\nprior commitments too? In this section, we discuss these worries and\nresponses that philosophers have offered to assuage them.\n3.1 Perception\n\nIf you believe that observation by human sense perception is the\nobjective basis of all scientific knowledge, then you ought to be\nparticularly worried about the potential for human perception to be\ncorrupted by theoretical assumptions, wishful thinking, framing\neffects, and so on. Daston and Galison recount the striking example of\nArthur Worthington’s symmetrical milk drops (2007, 11–16).\nWorking in 1875, Worthington investigated the hydrodynamics of falling\nfluid droplets and their evolution upon impacting a hard surface. At\nfirst, he had tried to carefully track the drop dynamics with a strobe\nlight to burn a sequence of images into his own retinas. The images he\ndrew to record what he saw were radially symmetric, with rays of the\ndrop splashes emanating evenly from the center of the impact. However,\nwhen Worthington transitioned from using his eyes and capacity to draw\nfrom memory to using photography in 1894, he was shocked to find that\nthe kind of splashes he had been observing were irregular splats\n(ibid., 13). Even curiouser, when Worthington returned to his\ndrawings, he found that he had indeed recorded some unsymmetrical\nsplashes. He had evidently dismissed them as uninformative accidents\ninstead of regarding them as revelatory of the phenomenon he was\nintent on studying (ibid.) In attempting to document the ideal form of\nthe splashes, a general and regular form, he had subconsciously\ndown-played the irregularity of individual splashes. If theoretical\ncommitments, like Worthington’s initial commitment to the\nperfect symmetry of the physics he was studying, pervasively and\nincorrigibly dictated the results of empirical inquiry, then the\nepistemic aims of science would be seriously undermined.\n\nPerceptual psychologists, Bruner and Postman, found that subjects who\nwere briefly shown anomalous playing cards, e.g., a black four of\nhearts, reported having seen their normal counterparts e.g., a red\nfour of hearts. It took repeated exposures to get subjects to say the\nanomalous cards didn’t look right, and eventually, to describe\nthem correctly (Kuhn 1962, 63). Kuhn took such studies to indicate\nthat things don’t look the same to observers with different\nconceptual resources. (For a more up-to-date discussion of theory and\nconceptual perceptual loading see Lupyan 2015.) If so, black hearts\ndidn’t look like black hearts until repeated exposures somehow\nallowed subjects to acquire the concept of a black heart. By analogy,\nKuhn supposed, when observers working in conflicting paradigms look at\nthe same thing, their conceptual limitations should keep them from\nhaving the same visual experiences (Kuhn 1962, 111,\n113–114, 115, 120–1). This would\nmean, for example, that when Priestley and Lavoisier watched the same\nexperiment, Lavoisier should have seen what accorded with his theory\nthat combustion and respiration are oxidation processes, while\nPriestley’s visual experiences should have agreed with his\ntheory that burning and respiration are processes of phlogiston\nrelease.\n\nThe example of Pettersson’s and Rutherford’s scintillation\nscreen evidence (above) attests to the fact that observers working in\ndifferent laboratories sometimes report seeing different things under\nsimilar conditions. It is plausible that their expectations influence\ntheir reports. It is plausible that their expectations are shaped by\ntheir training and by their supervisors’ and associates’\ntheory driven behavior. But as happens in other cases as well, all\nparties to the dispute agreed to reject Pettersson’s data by\nappealing to results that both laboratories could obtain and interpret\nin the same way without compromising their theoretical commitments.\nIndeed, it is possible for scientists to share empirical results, not\njust across diverse laboratory cultures, but even across serious\ndifferences in worldview. Much as they disagreed about the nature of\nrespiration and combustion, Priestley and Lavoisier gave\nquantitatively similar reports of how long their mice stayed alive and\ntheir candles kept burning in closed bell jars. Priestley taught\nLavoisier how to obtain what he took to be measurements of the\nphlogiston content of an unknown gas. A sample of the gas to be tested\nis run into a graduated tube filled with water and inverted over a\nwater bath. After noting the height of the water remaining in the\ntube, the observer adds “nitrous air” (we call it nitric\noxide) and checks the water level again. Priestley, who thought there\nwas no such thing as oxygen, believed the change in water level\nindicated how much phlogiston the gas contained. Lavoisier reported\nobserving the same water levels as Priestley even after he abandoned\nphlogiston theory and became convinced that changes in water level\nindicated free oxygen content (Conant 1957,\n74–109).\n\nA related issue is that of salience. Kuhn claimed that if Galileo and\nan Aristotelian physicist had watched the same pendulum experiment,\nthey would not have looked at or attended to the same things. The\nAristotelian’s paradigm would have required the experimenter to\nmeasure\n\n… the weight of the stone, the vertical height to which it had\nbeen raised, and the time required for it to achieve rest (Kuhn 1962,\n123)\n\n\nand ignore radius, angular displacement, and time per swing (ibid.,\n124). These last were salient to Galileo because he treated pendulum\nswings as constrained circular motions. The Galilean quantities would\nbe of no interest to an Aristotelian who treats the stone as falling\nunder constraint toward the center of the earth (ibid., 123). Thus\nGalileo and the Aristotelian would not have collected the same data.\n(Absent records of Aristotelian pendulum experiments we can think of\nthis as a thought experiment.)\n\nInterests change, however. Scientists may eventually come to\nappreciate the significance of data that had not originally been\nsalient to them in light of new presuppositions. The moral of these\nexamples is that although paradigms or theoretical commitments\nsometimes have an epistemically significant influence on what\nobservers perceive or what they attend to, it can be relatively easy\nto nullify or correct for their effects. When presuppositions cause\nepistemic damage, investigators are often able to eventually make\ncorrections. Thus, paradigms and theoretical commitments actually do\ninfluence saliency, but their influence is neither inevitable nor\nirremediable.\n3.2 Assuming the theory to be tested\n\nThomas Kuhn (1962), Norwood Hanson (1958), Paul Feyerabend (1959) and\nothers cast suspicion on the objectivity of observational evidence in\nanother way by arguing that one cannot use empirical evidence to test\na theory without committing oneself to that very theory. This would be\na problem if it leads to dogmatism but assuming the theory to be\ntested is often benign and even necessary.\n\nFor instance, Laymon (1988) demonstrates the manner in which the very\ntheory that the Michelson-Morley experiments are considered to test is\nassumed in the experimental design, but that this does not engender\ndeleterious epistemic effects (250). The Michelson-Morley apparatus\nconsists of two interferometer arms at right angles to one another,\nwhich are rotated in the course of the experiment so that, on the\noriginal construal, the path length traversed by light in the\napparatus would vary according to alignment with or against the\nEarth’s velocity (carrying the apparatus) with respect to the\nstationary aether. This difference in path length would show up as\ndisplacement in the interference fringes of light in the\ninterferometer. Although Michelson’s intention had been to\nmeasure the velocity of the Earth with respect to the all-pervading\naether, the experiments eventually came to be regarded as furnishing\ntests of the Fresnel aether theory itself. In particular, the null\nresults of these experiments were taken as evidence against the\nexistence of the aether. Naively, one might suppose that whatever\nassumptions were made in the calculation of the results of these\nexperiments, it should not be the case that the theory under the gun\nwas assumed nor that its negation was.\n\nBefore Michelson’s experiments, the Fresnel aether theory did\nnot predict any sort of length contraction. Although Michelson assumed\nno contraction in the arms of the interferometer, Laymon argues that\nhe could have assumed contraction, with no practical impact on the\nresults of the experiments. The predicted fringe shift is calculated\nfrom the anticipated difference in the distance traveled by light in\nthe two arms is the same, when higher order terms are neglected. Thus,\nin practice, the experimenters could assume either that the\ncontraction thesis was true or that it was false when determining the\nlength of the arms. Either way, the results of the experiment would be\nthe same. After Michelson’s experiments returned no evidence of\nthe anticipated aether effects, Lorentz-Fitzgerald contraction was\npostulated precisely to cancel out the expected (but not found)\neffects and save the aether theory. Morley and Miller then set out\nspecifically to test the contraction thesis, and still assumed no\ncontraction in determining the length of the arms of their\ninterferometer (ibid., 253). Thus Laymon argues that the\nMichelson-Morley experiments speak against the tempting assumption\nthat “appraisal of a theory is based on phenomena which can be\ndetected and measured without using assumptions drawn from the theory\nunder examination or from competitors to that theory”\n(ibid., 246).\n\nEpistemological hand-wringing about the use of the very theory to be\ntested in the generation of the evidence to be used for testing, seems\nto spring primarily from a concern about vicious circularity. How can\nwe have a genuine trial, if the theory in question has been presumed\ninnocent from the outset? While it is true that there would be a\nserious epistemic problem in a case where the use of the theory to be\ntested conspired to guarantee that the evidence would turn\nout to be confirmatory, this is not always the case when theories are\ninvoked in their own testing. Woodward (2011) summarizes a tidy\ncase:\n\nFor example, in Millikan’s oil drop experiment, the mere fact\nthat theoretical assumptions (e.g., that the charge of the electron is\nquantized and that all electrons have the same charge) play a role in\nmotivating his measurements or a vocabulary for describing his results\ndoes not by itself show that his design and data analysis were of such\na character as to guarantee that he would obtain results supporting\nhis theoretical assumptions. His experiment was such that he might\nwell have obtained results showing that the charge of the electron was\nnot quantized or that there was no single stable value for this\nquantity. (178)\n\n\nFor any given case, determining whether the theoretical assumptions\nbeing made are benign or straight-jacketing the results that it will\nbe possible to obtain will require investigating the particular\nrelationships between the assumptions and results in that case. When\ndata production and analysis processes are complicated, this task can\nget difficult. But the point is that merely noting the involvement of\nthe theory to be tested in the generation of empirical results does\nnot by itself imply that those results cannot be objectively useful\nfor deciding whether the theory to be tested should be accepted or\nrejected.\n3.3 Semantics\n\nKuhn argued that theoretical commitments exert a strong influence on\nobservation descriptions, and what they are understood to mean (Kuhn\n1962, 127ff; Longino 1979, 38–42). If so, proponents of a caloric\naccount of heat won’t describe or understand descriptions of\nobserved results of heat experiments in the same way as investigators\nwho think of heat in terms of mean kinetic energy or radiation. They\nmight all use the same words (e.g., ‘temperature’) to\nreport an observation without understanding them in the same way. This\nposes a potential problem for communicating effectively across\nparadigms, and similarly, for attributing the appropriate significance\nto empirical results generated outside of one’s own linguistic\nframework.\n\nIt is important to bear in mind that observers do not always use\ndeclarative sentences to report observational and experimental\nresults. Instead, they often draw, photograph, make audio recordings,\netc. or set up their experimental devices to generate graphs,\npictorial images, tables of numbers, and other non-sentential records.\nObviously investigators’ conceptual resources and theoretical\nbiases can exert epistemically significant influences on what they\nrecord (or set their equipment to record), which details they include\nor emphasize, and which forms of representation they choose (Daston\nand Galison 2007, 115–190,\n309–361). But disagreements about the epistemic\nimport of a graph, picture or other non-sentential bit of data often\nturn on causal rather than semantical considerations. Anatomists may\nhave to decide whether a dark spot in a micrograph was caused by a\nstaining artifact or by light reflected from an anatomically\nsignificant structure. Physicists may wonder whether a blip in a\nGeiger counter record reflects the causal influence of the radiation\nthey wanted to monitor, or a surge in ambient radiation. Chemists may\nworry about the purity of samples used to obtain data. Such questions\nare not, and are not well represented as, semantic questions to which\nsemantic theory loading is relevant. Late 20th century\nphilosophers may have ignored such cases and exaggerated the influence\nof semantic theory loading because they thought of theory testing in\nterms of inferential relations between observation and theoretical\nsentences.\n\nNevertheless, some empirical results are reported as declarative\nsentences. Looking at a patient with red spots and a fever, an\ninvestigator might report having seen the spots, or measles symptoms,\nor a patient with measles. Watching an unknown liquid dripping into a\nlitmus solution an observer might report seeing a change in color, a\nliquid with a PH of less than 7, or an acid. The appropriateness of a\ndescription of a test outcome depends on how the relevant concepts are\noperationalized. What justifies an observer to report having observed\na case of measles according to one operationalization might require\nher to say no more than that she had observed measles symptoms, or\njust red spots according to another.\n\nIn keeping with Percy Bridgman’s view that\n\n… in general, we mean by a concept nothing more than a set of\noperations; the concept is synonymous with the corresponding sets of\noperations (Bridgman 1927, 5)\n\n\none might suppose that operationalizations are definitions or meaning\nrules such that it is analytically true, e.g., that every liquid that\nturns litmus red in a properly conducted test is acidic. But it is\nmore faithful to actual scientific practice to think of\noperationalizations as defeasible rules for the application of a\nconcept such that both the rules and their applications are subject to\nrevision on the basis of new empirical or theoretical developments. So\nunderstood, to operationalize is to adopt verbal and related practices\nfor the purpose of enabling scientists to do their work.\nOperationalizations are thus sensitive and subject to change on the\nbasis of findings that influence their usefulness (Feest 2005).\n\nDefinitional or not, investigators in different research traditions\nmay be trained to report their observations in conformity with\nconflicting operationalizations. Thus instead of training observers to\ndescribe what they see in a bubble chamber as a whitish streak or a\ntrail, one might train them to say they see a particle track or even a\nparticle. This may reflect what Kuhn meant by suggesting that some\nobservers might be justified or even required to describe themselves\nas having seen oxygen, transparent and colorless though it is, or\natoms, invisible though they are (Kuhn 1962, 127ff). To the contrary,\none might object that what one sees should not be confused with what\none is trained to say when one sees it, and therefore that talking\nabout seeing a colorless gas or an invisible particle may be nothing\nmore than a picturesque way of talking about what certain\noperationalizations entitle observers to say. Strictly speaking, the\nobjection concludes, the term ‘observation report’ should\nbe reserved for descriptions that are neutral with respect to\nconflicting operationalizations.\n\nIf observational data are just those utterances that meet\nFeyerabend’s decidability and agreeability conditions, the\nimport of semantic theory loading depends upon how quickly, and for\nwhich sentences reasonably sophisticated language users who stand in\ndifferent paradigms can non-inferentially reach the same decisions\nabout what to assert or deny. Some would expect enough agreement to\nsecure the objectivity of observational data. Others would not. Still\nothers would try to supply different standards for objectivity.\n\nWith regard to sentential observation reports, the significance of\nsemantic theory loading is less ubiquitous than one might expect. The\ninterpretation of verbal reports often depends on ideas about causal\nstructure rather than the meanings of signs. Rather than worrying\nabout the meaning of words used to describe their observations,\nscientists are more likely to wonder whether the observers made up or\nwithheld information, whether one or more details were artifacts of\nobservation conditions, whether the specimens were atypical, and so\non.\n\nNote that the worry about semantic theory loading extends beyond\nobservation reports of the sort that occupied the logical empiricists\nand their close intellectual descendents. Combining results of diverse\nmethods for making proxy measurements of paleoclimate temperatures in\nan epistemically responsible way requires careful attention to the\nvariety of operationalizations at play. Even if no ‘observation\nreports’ are involved, the sticky question about how to usefully\nmerge results obtained in different ways in order to satisfy\none’s epistemic aims remains. Happily, the remedy for the worry\nabout semantic loading in this broader sense is likely to be the\nsame—investigating the provenance of those results\nand comparing the variety of factors that have contributed to their\ncausal production.\n\nKuhn placed too much emphasis on the discontinuity between evidence\ngenerated in different paradigms. Even if we accept a broadly Kuhnian\npicture, according to which paradigms are heterogeneous collections of\nexperimental practices, theoretical principles, problems selected for\ninvestigation, approaches to their solution, etc., connections between\ncomponents are loose enough to allow investigators who disagree\nprofoundly over one or more theoretical claims to nevertheless agree\nabout how to design, execute, and record the results of their\nexperiments. That is why neuroscientists who disagreed about whether\nnerve impulses consisted of electrical currents could measure the same\nelectrical quantities, and agree on the linguistic meaning and the\naccuracy of observation reports including such terms as\n‘potential’, ‘resistance’,\n‘voltage’ and ‘current’. As we discussed\nabove, the success that scientists have in repurposing results\ngenerated by others for different purposes speaks against the\nconfinement of evidence to its native paradigm. Even when scientists\nworking with radically different core theoretical commitments cannot\nmake the same measurements themselves, with enough contextual\ninformation about how each conducts research, it can be possible to\nconstruct bridges that span the theoretical divides.\n3.4 Values\n\nOne could worry that the intertwining of the theoretical and empirical\nwould open the floodgates to bias in science. Human cognizing, both\nhistorical and present day, is replete with disturbing commitments\nincluding intolerance and narrow mindedness of many sorts. If such\ncommitments are integral to a theoretical framework, or endemic to the\nreasoning of a scientist or scientific community, then they threaten\nto corrupt the epistemic utility of empirical results generated using\ntheir resources. The core impetus of the ‘value-free\nideal’ is to maintain a safe distance between the appraisal of\nscientific theories according to the evidence on one hand, and the\nswarm of moral, political, social, and economic values on the other.\nWhile proponents of the value-free ideal might admit that the\nmotivation to pursue a theory or the legal protection of human\nsubjects in permissible experimental methods involve non-epistemic\nvalues, they would contend that such values ought not ought not enter\ninto the constitution of empirical results themselves, nor the\nadjudication or justification of scientific theorizing in light of the\nevidence (see Intemann 2021, 202).\n\nAs a matter of fact, values do enter into science at a variety of\nstages. Above we saw that ‘theory-ladenness’ could refer\nto the involvement of theory in perception, in semantics, and in a\nkind of circularity that some have worried begets unfalsifiability and\nthereby dogmatism. Like theory-ladenness, values can and sometimes do\naffect judgments about the salience of certain evidence and the\nconceptual framing of data. Indeed, on a permissive construal of the\nnature of theories, values can simply be understood as part of a\ntheoretical framework. Intemann (2021) highlights a striking example\nfrom medical research where key conceptual resources include notions\nlike ‘harm,’ ‘risk,’ ‘health\nbenefit,’ and ‘safety.’ She refers to research on\nthe comparative safety of giving birth at home and giving birth at a\nhospital for low-risk parents in the United States. Studies reporting\nthat home births are less safe typically attend to infant and birthing\nparent mortality rates—which are low for these\nsubjects whether at home or in hospital—but leave\nout of consideration rates of c-section and episiotomy, which are both\nrelatively high in hospital settings. Thus, a value-laden decision\nabout whether a possible outcome counts as a harm worth considering\ncan influence the outcome of the study—in this case\ntipping the balance towards the conclusion that hospital births are\nmore safe (ibid., 206).\n\nNote that the birth safety case differs from the sort of cases at\nissue in the philosophical debate about risk and thresholds for\nacceptance and rejection of hypotheses. In accepting an hypothesis, a\nperson makes a judgement that the risk of being mistaken is\nsufficiently low (Rudner 1953). When the consequences of being wrong\nare deemed grave, the threshold for acceptance may be correspondingly\nhigh. Thus, in evaluating the epistemic status of an hypothesis in\nlight of the evidence, a person may have to make a value-based\njudgement. However, in the birth safety case, the judgement comes into\nplay at an earlier stage, well before the decision to accept or reject\nthe hypothesis is to be made. The judgement occurs already in deciding\nwhat is to count as a ‘harm’ worth considering for the\npurposes of this research.\n\nThe fact that values do sometimes enter into scientific reasoning does\nnot by itself settle the question of whether it would be better if\nthey did not. In order to assess the normative proposal, philosophers\nof science have attempted to disambiguate the various ways in which\nvalues might be thought to enter into science, and the various\nreferents that get crammed under the single heading of\n‘values.’ Anderson (2004) articulates eight stages of\nscientific research where values (‘evaluative\npresuppositions’) might be employed in epistemically fruitful\nways. In paraphrase: 1) orientation in a field, 2) framing a research\nquestion, 3) conceptualizing the target, 4) identifying relevant data,\n5) data generation, 6) data analysis, 7) deciding when to cease data\nanalysis, and 8) drawing conclusions (Anderson 2004, 11). Similarly,\nIntemann (2021) lays out five ways “that values play a role in\nscientific reasoning” with which feminist philosophers of\nscience have engaged in particular:\n\n(1) the framing [of] research problems, (2) observing phenomena and\ndescribing data, (3) reasoning about value-laden concepts and\nassessing risks, (4) adopting particular models, and (5) collecting\nand interpreting evidence. (208)\n\n\nWard (2021) presents a streamlined and general taxonomy of four\nways in which values relate to choices: as reasons motivating or\njustifying choices, as causal effectors of choices, or as goods\naffected by choices. By investigating the role of values in these\nparticular stages or aspects of research, philosophers of science can\noffer higher resolution insights than just the observation that values\nare involved in science at all and untangle crosstalk.\n\nSimilarly, fine points can be made about the nature of values involved\nin these various contexts. Such clarification is likely important for\ndetermining whether the contribution of certain values in a given\ncontext is deleterious or salutary, and in what sense. Douglas (2013)\nargues that the ‘value’ of internal consistency of a\ntheory and of the empirical adequacy of a theory with respect to the\navailable evidence are minimal criteria for any viable scientific\ntheory (799–800). She contrasts these with the sort of values that\nKuhn called ‘virtues,’ i.e. scope, simplicity, and\nexplanatory power that are properties of theories themselves, and\nunification, novel prediction and precision, which are properties a\ntheory has in relation to a body of evidence (800–801). These are the\nsort of values that may be relevant to explaining and justifying\nchoices that scientists make to pursue/abandon or accept/reject\nparticular theories. Moreover, Douglas (2000) argues that what she\ncalls “non-epistemic values” (in particular, ethical value\njudgements) also enter into decisions at various stages\n“internal” to scientific reasoning, such as data\ncollection and interpretation (565). Consider a laboratory toxicology\nstudy in which animals exposed to dioxins are compared to unexposed\ncontrols. Douglas discusses researchers who want to determine the\nthreshold for safe exposure. Admitting false positives can be expected\nto lead to overregulation of the chemical industry, while false\nnegatives yield underregulation and thus pose greater risk to public\nhealth. The decision about where to set the unsafe exposure threshold,\nthat is, set the threshold for a statistically significant difference\nbetween experimental and control animal populations, involves\nbalancing the acceptability of these two types of errors. According to\nDouglas, this balancing act will depend on “whether we are more\nconcerned about protecting public health from dioxin pollution or\nwhether we are more concerned about protecting industries that produce\ndioxins from increased regulation” (ibid., 568). That scientists\ndo as a matter of fact sometimes make such decisions is clear. They\njudge, for instance, a specimen slide of a rat liver to be tumorous or\nnot, and whether borderline cases should count as benign or malignant\n(ibid., 569–572). Moreover, in such cases, it is not clear that the\nresponsibility of making such decisions could be offloaded to\nnon-scientists.\n\nMany philosophers accept that values can contribute to the generation\nof empirical results without spoiling their epistemic utility.\nAnderson’s (2004) diagnosis is as follows:\n\nDeep down, what the objectors find worrisome about allowing value\njudgments to guide scientific inquiry is not that they have evaluative\ncontent, but that these judgments might be held dogmatically, so as to\npreclude the recognition of evidence that might undermine them. We\nneed to ensure that value judgements do not operate to drive inquiry\nto a predetermined conclusion. This is our fundamental criterion for\ndistinguishing legitimate from illegitimate uses of values in science.\n(11)\n\n\nData production (including experimental design and execution) is\nheavily influenced by investigators’ background assumptions.\nSometimes these include theoretical commitments that lead\nexperimentalists to produce non-illuminating or misleading evidence.\nIn other cases they may lead experimentalists to ignore, or even fail\nto produce useful evidence. For example, in order to obtain data on\norgasms in female stumptail macaques, one researcher wired up females\nto produce radio records of orgasmic muscle contractions, heart rate\nincreases, etc. But as Elisabeth Lloyd reports, “… the\nresearcher … wired up the heart rate of the male macaques as\nthe signal to start recording the female orgasms. When I pointed out\nthat the vast majority of female stumptail orgasms occurred during sex\namong the females alone, he replied that yes he knew that, but he was\nonly interested in important orgasms” (Lloyd 1993, 142).\nAlthough female stumptail orgasms occurring during sex with males are\natypical, the experimental design was driven by the assumption that\nwhat makes features of female sexuality worth studying is their\ncontribution to reproduction (ibid., 139). This assumption influenced\nexperimental design in such a way as to preclude learning about the\nfull range of female stumptail orgasms.\n\nAnderson (2004) presents an influential analysis of the role of values\nin research on divorce. Researchers committed to an interpretive\nframework rooted in ‘traditional family values’ could\nconduct research on the assumption that divorce is mostly bad for\nspouses and any children that they have (ibid., 12). This background\nassumption, which is rooted in a normative appraisal of a certain\nmodel of good family life, could lead social science researchers to\nrestrict the questions with which they survey their research subjects\nto ones about the negative impacts of divorce on their lives, thereby\ncurtailing the possibility of discovering ways that divorce may have\nactually made the ex-spouses lives better (ibid., 13). This is an\nexample of the influence that values can have on the nature of the\nresults that research ultimately yields, which is epistemically\ndetrimental. In this case, the values in play biased the research\noutcomes to preclude recognition of countervailing evidence. Anderson\nargues that the problematic influence of values comes when research\n“is rigged in advance” to confirm certain\nhypotheses—when the influence of values amounts to incorrigible\ndogmatism (ibid., 19). “Dogmatism” in her sense is\nunfalsifiability in practice, “their stubbornness in the face of\nany conceivable evidence”(ibid., 22).\n\nFortunately, such dogmatism is not ubiquitous and when it occurs it\ncan often be corrected eventually. Above we noted that the mere\ninvolvement of the theory to be tested in the generation of an\nempirical result does not automatically yield vicious\ncircularity—it depends on how the theory is\ninvolved. Furthermore, even if the assumptions initially made in the\ngeneration of empirical results are incorrect, future scientists will\nhave opportunities to reassess those assumptions in light of new\ninformation and techniques. Thus, as long as scientists continue their\nwork there need be no time at which the epistemic value of an\nempirical result can be established once and for all. This should come\nas no surprise to anyone who is aware that science is fallible, but it\nis no grounds for skepticism. It can be perfectly reasonable to trust\nthe evidence available at present even though it is logically possible\nfor epistemic troubles to arise in the future. A similar point can be\nmade regarding values (although cf. Yap 2016).\n\nMoreover, while the inclusion of values in the generation of an\nempirical result can sometimes be epistemically bad, values properly\ndeployed can also be harmless, or even epistemically helpful. As in\nthe cases of research on female stumptail macaque orgasms and the\neffects of divorce, certain values can sometimes serve to illuminate\nthe way in which other epistemically problematic assumptions have\nhindered potential scientific insight. By valuing knowledge about\nfemale sexuality beyond its role in reproduction, scientists can\nrecognize the narrowness of an approach that only conceives of female\nsexuality insofar as it relates to reproduction. By questioning the\nabsolute value of one traditional ideal for flourishing families,\nresearchers can garner evidence that might end up destabilizing the\nempirical foundation supporting that ideal.\n3.5 Reuse\n\nEmpirical results are most obviously put to epistemic work in their\ncontexts of origin. Scientists conceive of empirical research, collect\nand analyze the relevant data, and then bring the results to bear on\nthe theoretical issues that inspired the research in the first place.\nHowever, philosophers have also discussed ways in which empirical\nresults are transferred out of their native contexts and applied in\ndiverse and sometimes unexpected ways (see Leonelli and Tempini 2020).\nCases of reuse, or repurposing of empirical results in different\nepistemic contexts raise several interesting issues for philosophers\nof science. For one, such cases challenge the assumption that theory\n(and value) ladenness confines the epistemic utility of empirical\nresults to a particular conceptual framework. Ancient Babylonian\neclipse records inscribed on cuneiform tablets have been used to\ngenerate constraints on contemporary geophysical theorizing about the\ncauses of the lengthening of the day on Earth (Stephenson, Morrison,\nand Hohenkerk 2016). This is surprising since the ancient observations\nwere originally recorded for the purpose of making astrological\nprognostications. Nevertheless, with enough background information,\nthe records as inscribed can be translated, the layers of assumptions\nbaked into their presentation peeled back, and the results repurposed\nusing resources of the contemporary epistemic context, the likes of\nwhich the Babylonians could have hardly dreamed.\n\nFurthermore, the potential for reuse and repurposing feeds back on the\nmethodological norms of data production and handling. In light of the\ndifficulty of reusing or repurposing data without sufficient\nbackground information about the original context, Goodman et al.\n(2014) note that “data reuse is most possible when: 1) data; 2)\nmetadata (information describing the data); and 3) information about\nthe process of generating those data, such as code, all all\nprovided” (3). Indeed, they advocate for sharing data and code\nin addition to results customarily published in science. As we have\nseen, the loading of data with theory is usually necessary to putting\nthat data to any serious epistemic\nuse—theory-loading makes theory appraisal possible.\nPhilosophers have begun to appreciate that this epistemic boon does\nnot necessarily come at the cost of rendering data “tragically\nlocal” (Wylie 2020, 285, quoting Latour 1999). But it is\nimportant to note the useful travel of data between contexts is\nsignificantly aided by foresight, curation, and management for that\naim.\n\nIn light of the mediated nature of empirical results, Boyd (2018)\nargues for an “enriched view of evidence,” in which the\nevidence that serves as the ‘tribunal of experience’ is\nunderstood to be “lines of evidence” composed of the\nproducts of data collection and all of the products of their\ntransformation on the way to the generation of empirical results that\nare ultimately compared to theoretical predictions, considered\ntogether with metadata associated with their provenance. Such metadata\nincludes information about theoretical assumptions that are made in\ndata collection, processing, and the presentation of empirical\nresults. Boyd argues that by appealing to metadata to\n‘rewind’ the processing of assumption-imbued empirical\nresults and then by re-processing them using new resources, the\nepistemic utility of empirical evidence can survive transitions to new\ncontexts. Thus, the enriched view of evidence supports the idea that\nit is not despite the intertwining of the theoretical and empirical\nthat scientists accomplish key epistemic aims, but often in virtue of\nit (ibid., 420). In addition, it makes the epistemic value of metadata\nencoding the various assumptions that have been made throughout the\ncourse of data collection and processing explicit.\n\nThe desirability of explicitly furnishing empirical data and results\nwith auxiliary information that allow them to travel can be\nappreciated in light of the ‘objectivity’ norm, construed\nas accessibility to interpersonal scrutiny. When data are repurposed\nin novel contexts, they are not only shared between subjects, but can\nin some cases be shared across radically different paradigms with\nincompatible theoretical commitments.\n4. The epistemic value of empirical evidence\n\nOne of the important applications of empirical evidence is its use in\nassessing the epistemic status of scientific theories. In this section\nwe briefly discuss philosophical work on the role of empirical\nevidence in confirmation/falsification of scientific theories,\n‘saving the phenomena,’ and in appraising the empirical\nadequacy of theories. However, further philosophical work ought to\nexplore the variety of ways that empirical results bear on the\nepistemic status of theories and theorizing in scientific practice\nbeyond these.\n4.1 Confirmation\n\nIt is natural to think that computability, range of application, and\nother things being equal, true theories are better than false ones,\ngood approximations are better than bad ones, and highly probable\ntheoretical claims are better than less probable ones. One way to\ndecide whether a theory or a theoretical claim is true, close to the\ntruth, or acceptably probable is to derive predictions from it and use\nempirical data to evaluate them. Hypothetico-Deductive (HD)\nconfirmation theorists proposed that empirical evidence argues for\nthe truth of theories whose deductive consequences it verifies, and\nagainst those whose consequences it falsifies (Popper 1959, 32–34).\nBut laws and theoretical generalization seldom if ever entail\nobservational predictions unless they are conjoined with one or more\nauxiliary hypotheses taken from the theory they belong to. When the\nprediction turns out to be false, HD has trouble explaining which of\nthe conjuncts is to blame. If a theory entails a true prediction, it\nwill continue to do so in conjunction with arbitrarily selected\nirrelevant claims. HD has trouble explaining why the prediction does\nnot confirm the irrelevancies along with the theory of interest.\n\nAnother approach to confirmation by empirical evidence is Inference to the Best Explanation (IBE). The idea is roughly that an explanation of the evidence that exhibits certain desirable characteristics with respect to a family of candidate explanations is likely to be the true on (Lipton 1991). On this approach, it is in virtue of their successful explanation of the empirical evidence that theoretical claims are supported. Naturally, IBE advocates face the challenges of defending a suitable characterization of what counts as the ‘best’ and of justifying the limited pool of candidate explanations considered (Stanford 2006).\n\nBayesian approaches to scientific confirmation have garnered significant attention and are now widespread in philosophy of science. Bayesians hold that the evidential bearing of empirical evidence on a theoretical claim is to be understood in terms of likelihood or conditional probability. For example, whether empirical evidence\nargues for a theoretical claim might be thought to depend upon whether\nit is more probable (and if so how much more probable) than its denial\nconditional on a description of the evidence together with background\nbeliefs, including theoretical commitments. But by Bayes’\nTheorem, the posterior probability of the claim of interest (that is, its probability given the evidence) is proportional to that claim’s prior probability. How to justify the choice of these prior probability assignments is one of the most notorious points of contention arising for Bayesians. If one makes the assignment of priors a subjective matter decided by epistemic agents, then it is not clear that they can be justified. Once again, one’s use of evidence to evaluate a theory depends in part upon one’s theoretical commitments (Earman 1992, 33–86; Roush 2005, 149–186). If one instead appeals to chains of successive updating using Bayes’ Theorem based on past evidence, one has to invoke assumptions that generally do not obtain in actual scientific reasoning. For instance, to ‘wash out’ the influence of priors a limit theorem is invoked wherein we consider very many updating iterations, but much scientific reasoning of interest does not happen in the limit, and so in practice priors hold unjustified sway (Norton 2021, 33).\n\nRather than attempting to cast all instances of confirmation based on empirical evidence as belonging to a universal schema, a better approach may be to ‘go local’. Norton’s material theory of induction argues that inductive support arises from background knowledge, that is, from material facts that are domain specific. Norton argues that, for instance, the induction from “Some samples of the element bismuth melt at 271°C” to “all samples of the element bismuth melt at 271°C” is admissible not in virtue of some universal schema that carries us from ‘some’ to ‘all’ but matters of fact (Norton 2003). In this particular case, the fact that licenses the induction is a fact about elements: “their samples are generally uniform in their physical properties” (ibid., 650). This is a fact pertinent to chemical elements, but not to samples of material like wax (ibid.). Thus Norton repeatedly emphasizes that “all induction is local”.\n    \nStill, there are those who may be skeptical about the very possibility of confirmation or of successful induction. Insofar as the bearing of evidence on theory is never totally decisive, insofar there is no single trusty universal schema that captures empirical support, perhaps the relationship between empirical evidence and scientific theory is not really about support after all. Giving up on empirical support would not automatically mean abandoning any epistemic value for empirical evidence. Rather than confirm theory, the epistemic role of evidence could be to constrain, for example by furnishing phenomena for theory to systematize or to adequately model.\n\n4.2 Saving the phenomena\n\nTheories are said to ‘save’ observable phenomena if they\nsatisfactorily predict, describe, or systematize them. How well a\ntheory performs any of these tasks need not depend upon the truth or\naccuracy of its basic principles. Thus according to Osiander’s\npreface to Copernicus’ On the Revolutions, a locus\nclassicus, astronomers “… cannot in any way attain to true\ncauses” of the regularities among observable astronomical\nevents, and must content themselves with saving the phenomena in the\nsense of using\n\n… whatever suppositions enable … [them] to be computed\ncorrectly from the principles of geometry for the future as well as\nthe past … (Osiander 1543, XX)\n\n\nTheorists are to use those assumptions as calculating tools without\ncommitting themselves to their truth. In particular, the assumption\nthat the planets revolve around the sun must be evaluated solely in\nterms of how useful it is in calculating their observable relative\npositions to a satisfactory approximation. Pierre Duhem’s\nAim and Structure of Physical Theory articulates a related\nconception. For Duhem a physical theory\n\n… is a system of mathematical propositions, deduced from a small\nnumber of principles, which aim to represent as simply and completely,\nand exactly as possible, a set of experimental laws. (Duhem 1906, 19)\n\n\n‘Experimental laws’ are general, mathematical descriptions\nof observable experimental results. Investigators produce them by\nperforming measuring and other experimental operations and assigning\nsymbols to perceptible results according to pre-established\noperational definitions (Duhem 1906, 19). For Duhem, the main function\nof a physical theory is to help us store and retrieve information\nabout observables we would not otherwise be able to keep track of. If\nthat is what a theory is supposed to accomplish, its main virtue\nshould be intellectual economy. Theorists are to replace reports of\nindividual observations with experimental laws and devise higher level\nlaws (the fewer, the better) from which experimental laws (the more,\nthe better) can be mathematically derived (Duhem 1906, 21ff).\n\nA theory’s experimental laws can be tested for accuracy and\ncomprehensiveness by comparing them to observational data. Let EL be\none or more experimental laws that perform acceptably well on such\ntests. Higher level laws can then be evaluated on the basis of how\nwell they integrate EL into the rest of the theory. Some data that\ndon’t fit integrated experimental laws won’t be\ninteresting enough to worry about. Other data may need to be\naccommodated by replacing or modifying one or more experimental laws\nor adding new ones. If the required additions, modifications or\nreplacements deliver experimental laws that are harder to integrate,\nthe data count against the theory. If the required changes are\nconducive to improved systematization the data count in favor of it.\nIf the required changes make no difference, the data don’t argue\nfor or against the theory.\n4.3 Empirical adequacy\n\nOn van Fraassen’s (1980) semantic account, a theory is\nempirically adequate when the empirical structure of at least one\nmodel of that theory is isomorphic to what he calls the\n“appearances” (45). In other words, when the theory\n“has at least one model that all the actual phenomena fit\ninside” (12). Thus, for van Fraassen, we continually check the\nempirical adequacy of our theories by seeing if they have the\nstructural resources to accommodate new observations. We’ll\nnever know that a given theory is totally empirically adequate, since\nfor van Fraassen, empirical adequacy obtains with respect to all that\nis observable in principle to creatures like us, not all that has\nalready been observed (69).\n\nThe primary appeal of dealing in empirical adequacy rather than\nconfirmation is its appropriate epistemic humility. Instead of\nclaiming that confirming evidence justifies belief (or boosted\nconfidence) that a theory is true, one is restricted to saying that\nthe theory continues to be consistent with the evidence as far as we\ncan tell so far. However, if the epistemic utility of empirical\nresults in appraising the status of theories is just to judge their\nempirical adequacy, then it may be difficult to account for the\ndifference between adequate but unrealistic theories, and those\nequally adequate theories that ought to be taken seriously as\nrepresentations. Appealing to extra-empirical virtues like parsimony\nmay be a way out, but one that will not appeal to philosophers\nskeptical of the connection thereby supposed between such virtues and\nrepresentational fidelity.\n5. Conclusion\n\nOn an earlier way of thinking, observation was to serve as the\nunmediated foundation of science—direct access to\nthe facts upon which the edifice of scientific knowledge could be\nbuilt. When conflict arose between factions with different ideological\ncommitments, observations could furnish the material for neutral\narbitration and settle the matter objectively, in virtue of being\nindependent of non-empirical commitments. According to this view,\nscientists working in different paradigms could at least appeal to the\nsame observations, and propagandists could be held accountable to the\npublicly accessible content of theory and value-free observations.\nDespite their different theories, Priestley and Lavoisier could find\nshared ground in the observations. Anti-Semites would be compelled to\nadmit the success of a theory authored by a Jewish physicist, in\nvirtue of the unassailable facts revealed by\nobservation.\n\nThis version of empiricism with respect to science does not accord\nwell with the fact that observation per se plays a relatively small\nrole in many actual scientific methodologies, and the fact that even\nthe most ‘raw’ data is often already theoretically imbued.\nThe strict contrast between theory and observation in science is more\nfruitfully supplanted by inquiry into the relationship between\ntheorizing and empirical results.\n\nContemporary philosophers of science tend to embrace the theory\nladenness of empirical results. Instead of seeing the integration of\nthe theoretical and the empirical as an impediment to furthering\nscientific knowledge, they see it as necessary. A ‘view from\nnowhere’ would not bear on our particular theories. That is, it\nis impossible to put empirical results to use without recruiting some\ntheoretical resources. In order to use an empirical result to\nconstrain or test a theory it has to be processed into a form that can\nbe compared to that theory. To get stellar spectrograms to bear on\nNewtonian or relativistic cosmology, they need to be\nprocessed—into galactic rotation curves, say. The spectrograms\nby themselves are just artifacts, pieces of paper. Scientists need\ntheoretical resources in order to even identify that such artifacts\nbear information relevant for their purposes, and certainly to put\nthem to any epistemic use in assessing theories.\n\nThis outlook does not render contemporary philosophers of science all\nconstructivists, however. Theory mediates the connection between the\ntarget of inquiry and the scientific worldview, it does not sever it.\nMoreover, vigilance is still required to ensure that the particular\nways in which theory is ‘involved’ in the production of\nempirical results are not epistemically detrimental. Theory can be\ndeployed in experiment design, data processing, and presentation of\nresults in unproductive ways, for instance, in determining whether the\nresults will speak for or against a particular theory regardless of\nwhat the world is like. Critical appraisal of the roles of theory is\nthus important for genuine learning about nature through science.\nIndeed, it seems that extra-empirical values can sometimes assist such\ncritical appraisal. Instead of viewing observation as the theory-free\nand for that reason furnishing the content with which to appraise\ntheories, we might attend to the choices and mistakes that can be made\nin collecting and generating empirical results with the help of\ntheoretical resources, and endeavor to make choices conducive to\nlearning and correct mistakes as we discover them.\n\nRecognizing the involvement of theory and values in the constitution\nand generation of empirical results does not undermine the special\nepistemic value of empirical science in contrast to propaganda and\npseudoscience. In cases where the influence of cultural, political,\nand religious values hinder scientific inquiry, it is often the case\nthat they do so by limiting or determining the nature of the empirical\nresults. Yet, by working to make the assumptions that shape results\nexplicit we can examine their suitability for our purposes and attempt\nto restructure inquiry as necessary. When disagreements arise,\nscientists can attempt to settle them by appealing to the causal\nconnections between the research target and the empirical data. The\ntribunal of experience speaks through empirical results, but it only\ndoes so through via careful fashioning with theoretical resources.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Anderson, E., 2004, “Uses of Value Judgments in Science: A\nGeneral Argument, with Lessons from a Case Study of Feminist Research\non Divorce,” <em>Hypatia</em>, 19(1): 1–24.",
                "Aristotle(a), <em>Generation of Animals</em> in <em>Complete Works\nof Aristotle</em> (Volume 1), J. Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995, pp. 774–993",
                "Aristotle(b), <em>History of Animals</em> in <em>Complete Works of\nAristotle</em> (Volume 1), J. Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995, pp. 1111–1228.",
                "Azzouni, J., 2004, “Theory, Observation, and Scientific\nRealism,” <em>British Journal for the Philosophy of\nScience</em>, 55(3): 371–92.",
                "Bacon, Francis, 1620, <em>Novum Organum with other parts of the\nGreat Instauration</em>, P. Urbach and J. Gibson (eds. and trans.), La\nSalle: Open Court, 1994.",
                "Bogen, J., 2016, “Empiricism and After,”in P.\nHumphreys (ed.), <em>Oxford Handbook of Philosophy of Science</em>,\nOxford: Oxford University Press, pp. 779–795.",
                "Bogen, J, and Woodward, J., 1988, “Saving the\nPhenomena,” <em>Philosophical Review</em>, XCVII (3):\n303–352.",
                "Bokulich, A., 2020, “Towards a Taxonomy of the\nModel-Ladenness of Data,” <em>Philosophy of Science</em>, 87(5):\n793–806.",
                "Borrelli, A., 2012, “The Case of the Composite Higgs: The\nModel as a ‘Rosetta Stone’ in Contemporary High-Energy\nPhysics,” <em>Studies in History and Philosophy of Science</em> (Part\nB: Studies in History and Philosophy of Modern Physics), 43(3):\n195–214.",
                "Boyd, N. M., 2018, “Evidence Enriched,” <em>Philosophy\nof Science</em>, 85(3): 403–21.",
                "Boyle, R., 1661, <em>The Sceptical Chymist</em>, Montana:\nKessinger (reprint of 1661 edition).",
                "Bridgman, P., 1927, <em>The Logic of Modern Physics</em>, New\nYork: Macmillan.",
                "Chang, H., 2005, “A Case for Old-fashioned Observability,\nand a Reconstructive Empiricism,” <em>Philosophy of\nScience</em>, 72(5): 876–887.",
                "Collins, H. M., 1985 <em>Changing Order</em>, Chicago: University\nof Chicago Press.",
                "Conant, J.B., 1957, (ed.) “The Overthrow of the Phlogiston\nTheory: The Chemical Revolution of 1775–1789,” in\nJ.B.Conant and L.K. Nash (eds.), <em>Harvard Studies in Experimental\nScience</em>, Volume I, Cambridge: Harvard University Press, pp.\n65–116).",
                "Daston, L., and P. Galison, 2007, <em>Objectivity</em>, Brooklyn:\nZone Books.",
                "Douglas, H., 2000, “Inductive Risk and Values in\nScience,” <em>Philosophy of Science</em>, 67(4):\n559–79.",
                "–––, 2013, “The Value of Cognitive\nValues,” <em>Philosophy of Science</em>, 80(5):\n796–806.",
                "Duhem, P., 1906, <em>The Aim and Structure of Physical\nTheory</em>, P. Wiener (tr.), Princeton: Princeton University Press,\n1991.",
                "Earman, J., 1992, <em>Bayes or Bust?</em>, Cambridge: MIT\nPress.",
                "Feest, U., 2005, “Operationism in psychology: what the\ndebate is about, what the debate should be about,” <em>Journal\nof the History of the Behavioral Sciences</em>, 41(2):\n131–149.",
                "Feyerabend, P.K., 1969, “Science Without Experience,”\nin P.K. Feyerabend, <em>Realism, Rationalism, and Scientific\nMethod</em> (Philosophical Papers I), Cambridge: Cambridge University\nPress, 1985, pp. 132–136.",
                "Franklin, A., 1986, <em>The Neglect of Experiment</em>, Cambridge:\nCambridge University Press.",
                "Galison, P., 1987, <em>How Experiments End</em>, Chicago:\nUniversity of Chicago Press.",
                "–––, 1990, “Aufbau/Bauhaus: logical positivism and\narchitectural modernism,” <em>Critical Inquiry</em>, 16 (4):\n709–753.",
                "Goodman, A., et al., 2014, “Ten Simple Rules for the Care and\nFeeding of Scientific Data,” <em>PLoS Computational\nBiology</em>, 10(4): e1003542.",
                "Hacking, I., 1981, “Do We See Through a Microscope?,”\n<em>Pacific Philosophical Quarterly</em>, 62(4): 305–322.",
                "–––, 1983, <em>Representing and\nIntervening</em>, Cambridge: Cambridge University Press.",
                "Hanson, N.R., 1958, <em>Patterns of Discovery</em>, Cambridge,\nCambridge University Press.",
                "Hempel, C.G., 1952, “Fundamentals of Concept Formation in\nEmpirical Science,” in <em>Foundations of the Unity of\nScience</em>, Volume 2, O. Neurath, R. Carnap, C. Morris (eds.),\nChicago: University of Chicago Press, 1970, pp. 651–746.",
                "Herschel, J. F. W., 1830, <em>Preliminary Discourse on the Study\nof Natural Philosophy</em>, New York: Johnson Reprint Corp.,\n1966.",
                "Hooke, R., 1705, “The Method of Improving Natural\nPhilosophy,” in R. Waller (ed.), <em>The Posthumous Works of\nRobert Hooke</em>, London: Frank Cass and Company, 1971.",
                "Horowitz, P., and W. Hill, 2015, <em>The Art of Electronics</em>,\nthird edition, New York: Cambridge University Press.",
                "Intemann, K., 2021, “Feminist Perspectives on Values in\nScience,” in S. Crasnow and L. Intemann (eds.), <em>The\nRoutledge Handbook of Feminist Philosophy of Science</em>, New York:\nRoutledge, pp. 201–15.",
                "Kuhn, T.S., <em>The Structure of Scientific Revolutions</em>,\n1962, Chicago: University of Chicago Press, reprinted,1996.",
                "Latour, B., 1999, “Circulating Reference: Sampling the Soil\nin the Amazon Forest,” in <em>Pandora’s Hope: Essays on the\nReality of Science Studies</em>, Cambridge, MA: Harvard University\nPress, pp. 24–79.",
                "Latour, B., and Woolgar, S., 1979, <em>Laboratory Life, The\nConstruction of Scientific Facts</em>, Princeton: Princeton University\nPress, 1986.",
                "Laymon, R., 1988, “The Michelson-Morley Experiment and the\nAppraisal of Theories,” in A. Donovan, L. Laudan, and R. Laudan\n(eds.), <em>Scrutinizing Science: Empirical Studies of Scientific\nChange</em>, Baltimore: The Johns Hopkins University Press,\npp. 245–266.",
                "Leonelli, S., 2009, “On the Locality of Data and Claims\nabout Phenomena,” <em>Philosophy of Science</em>, 76(5):\n737–49.",
                "Leonelli, S., and N. Tempini (eds.), 2020, <em>Data Journeys in\nthe Sciences</em>, Cham: Springer.",
                "Lipton, P., 1991, <em>Inference to the Best Explanation</em>, London: Routledge.",
                "Lloyd, E.A., 1993, “Pre-theoretical Assumptions In\nEvolutionary Explanations of Female Sexuality,”\n<em>Philosophical Studies</em>, 69: 139–153.",
                "–––, 2012, “The Role of ‘Complex’\nEmpiricism in the Debates about Satellite Data and Climate\nModels,”, <em>Studies in History and Philosophy of Science</em> (Part\nA), 43(2): 390–401.",
                "Longino, H., 1979, “Evidence and Hypothesis: An Analysis of\nEvidential Relations,” <em>Philosophy of Science</em>, 46(1):\n35–56.",
                "–––, 2020, “Afterward:Data in\nTransit,” in S.  Leonelli and N. Tempini (eds.), <em>Data\nJourneys in the Sciences</em>, Cham: Springer, pp. 391–400.",
                "Lupyan, G., 2015, “Cognitive Penetrability of Perception in\nthe Age of Prediction – Predictive Systems are Penetrable\nSystems,” <em>Review of Philosophical Psychology</em>, 6(4):\n547–569. doi:10.1007/s13164-015-0253-4",
                "Mill, J. S., 1872, <em>System of Logic</em>, London: Longmans,\nGreen, Reader, and Dyer.",
                "Norton, J., 2003, “A Material Theory of Induction,” <em>Philosophy of Science</em>, 70(4): 647–70.",
                "–––, 2021, <em>The Material Theory of Induction</em>, <a href=\"http://www.pitt.edu/~jdnorton/papers/material_theory/Material_Induction_March_14_2021.pdf\">http://www.pitt.edu/~jdnorton/papers/material_theory/Material_Induction_March_14_2021.pdf</a>.",
                "Nyquist, H., 1928, “Thermal Agitation of Electric Charge in\nConductors,” <em>Physical Review</em>, 32(1): 110–13.",
                "O’Connor, C. and J. O. Weatherall, 2019, <em>The\nMisinformation Age: How False Beliefs Spread</em>, New Haven: Yale\nUniversity Press.",
                "Olesko, K.M. and Holmes, F.L., 1994, “Experiment,\nQuantification and Discovery: Helmholtz’s Early Physiological\nResearches, 1843–50,” in D. Cahan, (ed.), <em>Hermann\nHelmholtz and the Foundations of Nineteenth Century Science</em>,\nBerkeley: UC Press, pp. 50–108.",
                "Osiander, A., 1543, “To the Reader Concerning the Hypothesis\nof this Work,” in N. Copernicus <em>On the Revolutions</em>, E.\nRosen (tr., ed.), Baltimore: Johns Hopkins University Press, 1978, p.\nXX.",
                "Parker, W. S., 2016, “Reanalysis and Observation:\nWhat’s the Difference?,” <em>Bulletin of the\nAmerican Meteorological Society</em>, 97(9): 1565–72.",
                "–––, 2017, “Computer Simulation,\nMeasurement, and Data Assimilation,” <em>The British Journal for\nthe Philosophy of Science</em>, 68(1): 273–304.",
                "Popper, K.R.,1959, <em>The Logic of Scientific Discovery</em>,\nK.R. Popper (tr.), New York: Basic Books.",
                "Rheinberger, H. J., 1997, <em>Towards a History of Epistemic\nThings: Synthesizing Proteins in the Test Tube</em>, Stanford:\nStanford University Press.",
                "Roush, S., 2005, <em>Tracking Truth</em>, Cambridge: Cambridge\nUniversity Press.",
                "Rudner, R., 1953, “The Scientist Qua Scientist Makes Value\nJudgments,” <em>Philosophy of Science</em>, 20(1):\n1–6.",
                "Schlick, M., 1935, “Facts and Propositions,” in\n<em>Philosophy and Analysis</em>, M. Macdonald (ed.), New York:\nPhilosophical Library, 1954, pp. 232–236.",
                "Schottky, W. H., 1918, “Über spontane Stromschwankungen\nin verschiedenen Elektrizitätsleitern,” <em>Annalen der\nPhysik</em>, 362(23): 541–67.",
                "Shapere, D., 1982, “The Concept of Observation in Science\nand Philosophy,” <em>Philosophy of Science</em>, 49(4):\n485–525.",
                "Stanford, K., 1991, <em>Exceeding Our Grasp: Science, History, and the Problem of Unconceived Alternatives</em>, Oxford: Oxford University Press.",
                "Stephenson, F. R., L. V. Morrison, and C. Y. Hohenkerk, 2016,\n“Measurement of the Earth’s Rotation: 720 BC to AD\n2015,” <em>Proceedings of the Royal Society A: Mathematical,\nPhysical and Engineering Sciences</em>, 472: 20160404.",
                "Stuewer, R.H., 1985, “Artificial Disintegration and the\nCambridge-Vienna Controversy,” in P. Achinstein and O. Hannaway\n(eds.), <em>Observation, Experiment, and Hypothesis in Modern Physical\nScience</em>, Cambridge, MA: MIT Press, pp. 239–307.",
                "Suppe, F., 1977, in F. Suppe (ed.) <em>The Structure of Scientific\nTheories</em>, Urbana: University of Illinois Press.",
                "Van Fraassen, B.C, 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.",
                "Ward, Z. B., 2021, “On Value-Laden Science,”\n<em>Studies in History and Philosophy of Science Part A</em>, 85: 54–62.",
                "Whewell, W., 1858, <em>Novum Organon Renovatum</em>, Book II, in\n<em>William Whewell Theory of Scientific Method</em>, R.E. Butts\n(ed.), Indianapolis: Hackett Publishing Company, 1989, pp.\n103–249.",
                "Woodward, J. F., 2010, “Data, Phenomena, Signal, and\nNoise,” <em>Philosophy of Science</em>, 77(5):\n792–803.",
                "–––, 2011, “Data and Phenomena: A Restatement\nand Defense,” <em>Synthese</em>, 182(1): 165–79.",
                "Wylie, A., 2020, “Radiocarbon Dating in Archaeology:\nTriangulation and Traceability,” in S. Leonelli and N. Tempini\n(eds.), <em>Data Journeys in the Sciences</em>, Cham: Springer,\npp. 285–301.",
                "Yap, A., 2016, “Feminist Radical Empiricism, Values, and\nEvidence,” <em>Hypatia</em>, 31(1): 58–73."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Anderson, E., 2004, “Uses of Value Judgments in Science: A\nGeneral Argument, with Lessons from a Case Study of Feminist Research\non Divorce,” <em>Hypatia</em>, 19(1): 1–24.</li>\n<li>Aristotle(a), <em>Generation of Animals</em> in <em>Complete Works\nof Aristotle</em> (Volume 1), J. Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995, pp. 774–993</li>\n<li>Aristotle(b), <em>History of Animals</em> in <em>Complete Works of\nAristotle</em> (Volume 1), J. Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995, pp. 1111–1228.</li>\n<li>Azzouni, J., 2004, “Theory, Observation, and Scientific\nRealism,” <em>British Journal for the Philosophy of\nScience</em>, 55(3): 371–92.</li>\n<li>Bacon, Francis, 1620, <em>Novum Organum with other parts of the\nGreat Instauration</em>, P. Urbach and J. Gibson (eds. and trans.), La\nSalle: Open Court, 1994.</li>\n<li>Bogen, J., 2016, “Empiricism and After,”in P.\nHumphreys (ed.), <em>Oxford Handbook of Philosophy of Science</em>,\nOxford: Oxford University Press, pp. 779–795.</li>\n<li>Bogen, J, and Woodward, J., 1988, “Saving the\nPhenomena,” <em>Philosophical Review</em>, XCVII (3):\n303–352.</li>\n<li>Bokulich, A., 2020, “Towards a Taxonomy of the\nModel-Ladenness of Data,” <em>Philosophy of Science</em>, 87(5):\n793–806.</li>\n<li>Borrelli, A., 2012, “The Case of the Composite Higgs: The\nModel as a ‘Rosetta Stone’ in Contemporary High-Energy\nPhysics,” <em>Studies in History and Philosophy of Science</em> (Part\nB: Studies in History and Philosophy of Modern Physics), 43(3):\n195–214.</li>\n<li>Boyd, N. M., 2018, “Evidence Enriched,” <em>Philosophy\nof Science</em>, 85(3): 403–21.</li>\n<li>Boyle, R., 1661, <em>The Sceptical Chymist</em>, Montana:\nKessinger (reprint of 1661 edition).</li>\n<li>Bridgman, P., 1927, <em>The Logic of Modern Physics</em>, New\nYork: Macmillan.</li>\n<li>Chang, H., 2005, “A Case for Old-fashioned Observability,\nand a Reconstructive Empiricism,” <em>Philosophy of\nScience</em>, 72(5): 876–887.</li>\n<li>Collins, H. M., 1985 <em>Changing Order</em>, Chicago: University\nof Chicago Press.</li>\n<li>Conant, J.B., 1957, (ed.) “The Overthrow of the Phlogiston\nTheory: The Chemical Revolution of 1775–1789,” in\nJ.B.Conant and L.K. Nash (eds.), <em>Harvard Studies in Experimental\nScience</em>, Volume I, Cambridge: Harvard University Press, pp.\n65–116).</li>\n<li>Daston, L., and P. Galison, 2007, <em>Objectivity</em>, Brooklyn:\nZone Books.</li>\n<li>Douglas, H., 2000, “Inductive Risk and Values in\nScience,” <em>Philosophy of Science</em>, 67(4):\n559–79.</li>\n<li>–––, 2013, “The Value of Cognitive\nValues,” <em>Philosophy of Science</em>, 80(5):\n796–806.</li>\n<li>Duhem, P., 1906, <em>The Aim and Structure of Physical\nTheory</em>, P. Wiener (tr.), Princeton: Princeton University Press,\n1991.</li>\n<li>Earman, J., 1992, <em>Bayes or Bust?</em>, Cambridge: MIT\nPress.</li>\n<li>Feest, U., 2005, “Operationism in psychology: what the\ndebate is about, what the debate should be about,” <em>Journal\nof the History of the Behavioral Sciences</em>, 41(2):\n131–149.</li>\n<li>Feyerabend, P.K., 1969, “Science Without Experience,”\nin P.K. Feyerabend, <em>Realism, Rationalism, and Scientific\nMethod</em> (Philosophical Papers I), Cambridge: Cambridge University\nPress, 1985, pp. 132–136.</li>\n<li>Franklin, A., 1986, <em>The Neglect of Experiment</em>, Cambridge:\nCambridge University Press.</li>\n<li>Galison, P., 1987, <em>How Experiments End</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>–––, 1990, “Aufbau/Bauhaus: logical positivism and\narchitectural modernism,” <em>Critical Inquiry</em>, 16 (4):\n709–753.</li>\n<li>Goodman, A., et al., 2014, “Ten Simple Rules for the Care and\nFeeding of Scientific Data,” <em>PLoS Computational\nBiology</em>, 10(4): e1003542.</li>\n<li>Hacking, I., 1981, “Do We See Through a Microscope?,”\n<em>Pacific Philosophical Quarterly</em>, 62(4): 305–322.</li>\n<li>–––, 1983, <em>Representing and\nIntervening</em>, Cambridge: Cambridge University Press.</li>\n<li>Hanson, N.R., 1958, <em>Patterns of Discovery</em>, Cambridge,\nCambridge University Press.</li>\n<li>Hempel, C.G., 1952, “Fundamentals of Concept Formation in\nEmpirical Science,” in <em>Foundations of the Unity of\nScience</em>, Volume 2, O. Neurath, R. Carnap, C. Morris (eds.),\nChicago: University of Chicago Press, 1970, pp. 651–746.</li>\n<li>Herschel, J. F. W., 1830, <em>Preliminary Discourse on the Study\nof Natural Philosophy</em>, New York: Johnson Reprint Corp.,\n1966.</li>\n<li>Hooke, R., 1705, “The Method of Improving Natural\nPhilosophy,” in R. Waller (ed.), <em>The Posthumous Works of\nRobert Hooke</em>, London: Frank Cass and Company, 1971.</li>\n<li>Horowitz, P., and W. Hill, 2015, <em>The Art of Electronics</em>,\nthird edition, New York: Cambridge University Press.</li>\n<li>Intemann, K., 2021, “Feminist Perspectives on Values in\nScience,” in S. Crasnow and L. Intemann (eds.), <em>The\nRoutledge Handbook of Feminist Philosophy of Science</em>, New York:\nRoutledge, pp. 201–15.</li>\n<li>Kuhn, T.S., <em>The Structure of Scientific Revolutions</em>,\n1962, Chicago: University of Chicago Press, reprinted,1996.</li>\n<li>Latour, B., 1999, “Circulating Reference: Sampling the Soil\nin the Amazon Forest,” in <em>Pandora’s Hope: Essays on the\nReality of Science Studies</em>, Cambridge, MA: Harvard University\nPress, pp. 24–79.</li>\n<li>Latour, B., and Woolgar, S., 1979, <em>Laboratory Life, The\nConstruction of Scientific Facts</em>, Princeton: Princeton University\nPress, 1986.</li>\n<li>Laymon, R., 1988, “The Michelson-Morley Experiment and the\nAppraisal of Theories,” in A. Donovan, L. Laudan, and R. Laudan\n(eds.), <em>Scrutinizing Science: Empirical Studies of Scientific\nChange</em>, Baltimore: The Johns Hopkins University Press,\npp. 245–266.</li>\n<li>Leonelli, S., 2009, “On the Locality of Data and Claims\nabout Phenomena,” <em>Philosophy of Science</em>, 76(5):\n737–49.</li>\n<li>Leonelli, S., and N. Tempini (eds.), 2020, <em>Data Journeys in\nthe Sciences</em>, Cham: Springer.</li>\n<li>Lipton, P., 1991, <em>Inference to the Best Explanation</em>, London: Routledge.</li>\n<li>Lloyd, E.A., 1993, “Pre-theoretical Assumptions In\nEvolutionary Explanations of Female Sexuality,”\n<em>Philosophical Studies</em>, 69: 139–153.</li>\n<li>–––, 2012, “The Role of ‘Complex’\nEmpiricism in the Debates about Satellite Data and Climate\nModels,”, <em>Studies in History and Philosophy of Science</em> (Part\nA), 43(2): 390–401.</li>\n<li>Longino, H., 1979, “Evidence and Hypothesis: An Analysis of\nEvidential Relations,” <em>Philosophy of Science</em>, 46(1):\n35–56.</li>\n<li>–––, 2020, “Afterward:Data in\nTransit,” in S.  Leonelli and N. Tempini (eds.), <em>Data\nJourneys in the Sciences</em>, Cham: Springer, pp. 391–400.</li>\n<li>Lupyan, G., 2015, “Cognitive Penetrability of Perception in\nthe Age of Prediction – Predictive Systems are Penetrable\nSystems,” <em>Review of Philosophical Psychology</em>, 6(4):\n547–569. doi:10.1007/s13164-015-0253-4</li>\n<li>Mill, J. S., 1872, <em>System of Logic</em>, London: Longmans,\nGreen, Reader, and Dyer.</li>\n<li>Norton, J., 2003, “A Material Theory of Induction,” <em>Philosophy of Science</em>, 70(4): 647–70.</li>\n<li>–––, 2021, <em>The Material Theory of Induction</em>, <a href=\"http://www.pitt.edu/~jdnorton/papers/material_theory/Material_Induction_March_14_2021.pdf\">http://www.pitt.edu/~jdnorton/papers/material_theory/Material_Induction_March_14_2021.pdf</a>.</li>\n<li>Nyquist, H., 1928, “Thermal Agitation of Electric Charge in\nConductors,” <em>Physical Review</em>, 32(1): 110–13.</li>\n<li>O’Connor, C. and J. O. Weatherall, 2019, <em>The\nMisinformation Age: How False Beliefs Spread</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Olesko, K.M. and Holmes, F.L., 1994, “Experiment,\nQuantification and Discovery: Helmholtz’s Early Physiological\nResearches, 1843–50,” in D. Cahan, (ed.), <em>Hermann\nHelmholtz and the Foundations of Nineteenth Century Science</em>,\nBerkeley: UC Press, pp. 50–108.</li>\n<li>Osiander, A., 1543, “To the Reader Concerning the Hypothesis\nof this Work,” in N. Copernicus <em>On the Revolutions</em>, E.\nRosen (tr., ed.), Baltimore: Johns Hopkins University Press, 1978, p.\nXX.</li>\n<li>Parker, W. S., 2016, “Reanalysis and Observation:\nWhat’s the Difference?,” <em>Bulletin of the\nAmerican Meteorological Society</em>, 97(9): 1565–72.</li>\n<li>–––, 2017, “Computer Simulation,\nMeasurement, and Data Assimilation,” <em>The British Journal for\nthe Philosophy of Science</em>, 68(1): 273–304.</li>\n<li>Popper, K.R.,1959, <em>The Logic of Scientific Discovery</em>,\nK.R. Popper (tr.), New York: Basic Books.</li>\n<li>Rheinberger, H. J., 1997, <em>Towards a History of Epistemic\nThings: Synthesizing Proteins in the Test Tube</em>, Stanford:\nStanford University Press.</li>\n<li>Roush, S., 2005, <em>Tracking Truth</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Rudner, R., 1953, “The Scientist Qua Scientist Makes Value\nJudgments,” <em>Philosophy of Science</em>, 20(1):\n1–6.</li>\n<li>Schlick, M., 1935, “Facts and Propositions,” in\n<em>Philosophy and Analysis</em>, M. Macdonald (ed.), New York:\nPhilosophical Library, 1954, pp. 232–236.</li>\n<li>Schottky, W. H., 1918, “Über spontane Stromschwankungen\nin verschiedenen Elektrizitätsleitern,” <em>Annalen der\nPhysik</em>, 362(23): 541–67.</li>\n<li>Shapere, D., 1982, “The Concept of Observation in Science\nand Philosophy,” <em>Philosophy of Science</em>, 49(4):\n485–525.</li>\n<li>Stanford, K., 1991, <em>Exceeding Our Grasp: Science, History, and the Problem of Unconceived Alternatives</em>, Oxford: Oxford University Press.</li>\n<li>Stephenson, F. R., L. V. Morrison, and C. Y. Hohenkerk, 2016,\n“Measurement of the Earth’s Rotation: 720 BC to AD\n2015,” <em>Proceedings of the Royal Society A: Mathematical,\nPhysical and Engineering Sciences</em>, 472: 20160404.</li>\n<li>Stuewer, R.H., 1985, “Artificial Disintegration and the\nCambridge-Vienna Controversy,” in P. Achinstein and O. Hannaway\n(eds.), <em>Observation, Experiment, and Hypothesis in Modern Physical\nScience</em>, Cambridge, MA: MIT Press, pp. 239–307.</li>\n<li>Suppe, F., 1977, in F. Suppe (ed.) <em>The Structure of Scientific\nTheories</em>, Urbana: University of Illinois Press.</li>\n<li>Van Fraassen, B.C, 1980, <em>The Scientific Image</em>, Oxford:\nClarendon Press.</li>\n<li>Ward, Z. B., 2021, “On Value-Laden Science,”\n<em>Studies in History and Philosophy of Science Part A</em>, 85: 54–62.</li>\n<li>Whewell, W., 1858, <em>Novum Organon Renovatum</em>, Book II, in\n<em>William Whewell Theory of Scientific Method</em>, R.E. Butts\n(ed.), Indianapolis: Hackett Publishing Company, 1989, pp.\n103–249.</li>\n<li>Woodward, J. F., 2010, “Data, Phenomena, Signal, and\nNoise,” <em>Philosophy of Science</em>, 77(5):\n792–803.</li>\n<li>–––, 2011, “Data and Phenomena: A Restatement\nand Defense,” <em>Synthese</em>, 182(1): 165–79.</li>\n<li>Wylie, A., 2020, “Radiocarbon Dating in Archaeology:\nTriangulation and Traceability,” in S. Leonelli and N. Tempini\n(eds.), <em>Data Journeys in the Sciences</em>, Cham: Springer,\npp. 285–301.</li>\n<li>Yap, A., 2016, “Feminist Radical Empiricism, Values, and\nEvidence,” <em>Hypatia</em>, 31(1): 58–73.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Bacon, Francis",
            "Bayes’ Theorem",
            "constructive empiricism",
            "Duhem, Pierre",
            "empiricism: logical",
            "epistemology: Bayesian",
            "feminist philosophy, topics: perspectives on science",
            "incommensurability: of scientific theories",
            "Locke, John",
            "measurement: in science",
            "models in science",
            "physics: experiment in",
            "science: and pseudo-science",
            "scientific objectivity",
            "scientific research and big data",
            "statistics, philosophy of"
        ],
        "entry_link": [
            {
                "../francis-bacon/": "Bacon, Francis"
            },
            {
                "../bayes-theorem/": "Bayes’ Theorem"
            },
            {
                "../constructive-empiricism/": "constructive empiricism"
            },
            {
                "../duhem/": "Duhem, Pierre"
            },
            {
                "../logical-empiricism/": "empiricism: logical"
            },
            {
                "../epistemology-bayesian/": "epistemology: Bayesian"
            },
            {
                "../feminist-science/": "feminist philosophy, topics: perspectives on science"
            },
            {
                "../incommensurability/": "incommensurability: of scientific theories"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../measurement-science/": "measurement: in science"
            },
            {
                "../models-science/": "models in science"
            },
            {
                "../physics-experiment/": "physics: experiment in"
            },
            {
                "../pseudo-science/": "science: and pseudo-science"
            },
            {
                "../scientific-objectivity/": "scientific objectivity"
            },
            {
                "../science-big-data/": "scientific research and big data"
            },
            {
                "../statistics/": "statistics, philosophy of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=science-theory-observation\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/science-theory-observation/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=science-theory-observation&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/science-theory-observation/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=science-theory-observation": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/science-theory-observation/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=science-theory-observation&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/science-theory-observation/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.iep.utm.edu/c/conf-ind.htm\" target=\"other\">Confirmation</a>,\n by Franz Huber, in the <em>Internet Encyclopedia of\nPhilosophy</em>.",
            "<a href=\"https://ncse.com/files/pub/legal/kitzmiller/highlights/2005-12-20_Kitzmiller_decision.pdf\" target=\"other\">Transcript of Katzmiller v. Dover Area School District</a>\n (on the teaching of intelligent design)."
        ],
        "listed_links": [
            {
                "http://www.iep.utm.edu/c/conf-ind.htm": "Confirmation"
            },
            {
                "https://ncse.com/files/pub/legal/kitzmiller/highlights/2005-12-20_Kitzmiller_decision.pdf": "Transcript of Katzmiller v. Dover Area School District"
            }
        ]
    }
}