{
    "url": "skepticism-ancient",
    "title": "Ancient Skepticism",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Katja Vogt\n<kv2101@columbia.edu>",
        "author_links": [
            {
                "http://www.columbia.edu/cu/philosophy/fac-bios/vogt/faculty.html": "Katja Vogt"
            },
            {
                "mailto:kv2101%40columbia%2eedu": "kv2101@columbia.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.columbia.edu/cu/philosophy/fac-bios/vogt/faculty.html\" target=\"other\">Katja Vogt</a>\n&lt;<a href=\"mailto:kv2101%40columbia%2eedu\"><em>kv2101<abbr title=\" at \">@</abbr>columbia<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Feb 24, 2010",
        "substantive revision Wed Sep 21, 2022"
    ],
    "preamble": "\n\nThe Greek word skepsis means investigation. Literally, a\n“skeptic” is an inquirer. Not all ancient philosophers\nwhom in retrospect we call “skeptics” refer to themselves\nas such. Nevertheless, they all embrace ways of life that are devoted\nto inquiry. Ancient skepticism is as much concerned with belief\nas with knowledge. As long as knowledge has not been attained, the\nskeptics aim not to affirm anything. This gives rise to their most\ncontroversial ambition: a life without belief.\n\nAncient skepticism is, for the most part, a phenomenon of\nPost-Classical, Hellenistic philosophy. The Academic and Pyrrhonian\nskeptical movements begin roughly in the third century BCE, and end\nwith Sextus Empiricus in the second century CE. Hellenistic philosophy\nis a large-scale conversation, not unlike philosophy today. The\nskeptics (among them Pyrrho, Timon, Arcesilaus, Carneades,\nAenesidemus, and Sextus Empiricus) do engage with Pre-Socratic\nphilosophy, Socrates, Protagorean relativism, Plato, and perhaps\nAristotle. But their contemporary and principal interlocutors are\nEpicureans, Stoics, Cynics, and Megarian logicians (cf. Long 2006, ch.\n4 and 5).\n",
    "toc": [
        {
            "#CenQue": "1. The Central Questions"
        },
        {
            "#SkeIdeEarClaGre": "2. Skeptical Ideas in Early and Classical Greek Philosophy"
        },
        {
            "#EarGre": "2.1 Early Greek Philosophy"
        },
        {
            "#Pla": "2.2 Plato"
        },
        {
            "#Ari": "2.3 Aristotle"
        },
        {
            "#AcaSke": "3. Academic Skepticism"
        },
        {
            "#Arc": "3.1 Arcesilaus"
        },
        {
            "#Car": "3.2 Carneades"
        },
        {
            "#LatAcaSke": "3.3 Later Academic Skepticism"
        },
        {
            "#PyrSke": "4. Pyrrhonian Skepticism"
        },
        {
            "#EarFigPyrTim": "4.1 Early Figures: Pyrrho and Timon"
        },
        {
            "#AenTenModApp": "4.2 Aenesidemus, the Ten Modes, and Appearances"
        },
        {
            "#AgrFivMod": "4.3 Agrippa, and the Five Modes"
        },
        {
            "#SexEmp": "4.4 Sextus Empiricus"
        },
        {
            "#AncModSkeTra": "5. Ancient and Modern Skepticism: Transitions"
        },
        {
            "#AugReConSkeTheFra": "5.1 Augustine: Re-Conceiving Skepticism in a Theological Framework"
        },
        {
            "#SkeAboInd": "5.2 Skepticism About Induction"
        },
        {
            "#SubOthMin": "5.3 Subjectivity, and Other Minds"
        },
        {
            "#ExtWorSke": "5.4 External World Skepticism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Central Questions\n\nThe core concepts of ancient skepticism are belief, suspension of\njudgment, criterion of truth, appearances, and investigation.\nImportant notions of modern skepticism such as knowledge, certainty,\njustified belief, and doubt play no or almost no role. This is not to\nsay that the ancients would not engage with questions that figure in\ntoday’s philosophical discussions. Ancient debates address\nquestions that today we associate with epistemology and philosophy of\nlanguage, as well as with theory of action, rather than specifically\nwith the contemporary topic of skepticism. They focus on the nature of\nbelief, the relationship of belief to speech and action, and the\nmental states of inquiry (on the role of ancient skepticism throughout\nthe history of Western philosophy up to today, cf. Lagerlund 2020; on\nthe relation between ancient skepticism and philosophical debates\ntoday, cf. Machuca and Reed 2018, Vlasits and Vogt 2020, and Machuca\n2022).\n\nFrom the point of view of the ancient skeptics, assertions are\nexpressions of dogmatism. And yet, the best-known ancient skeptic,\nSextus Empiricus, wrote extensively. Can the skeptics say anything\nmeaningful about their philosophy without asserting anything about how\nthings are (Bett 2013, 2019)? Skeptical writings have a peculiar\nformat, one that comes with its own challenges: the skeptics aim to\ndescribe their philosophy tout court, as they practice it,\nwithout laying out any particular theories or doctrines. Skeptical\nideas have been charged with a family of objections: they might be\nself-refuting, inconsistent, self-contradictory, and so on (Castagnoli\n2010). Another line of objection is associated with Hume, namely that\n“nature is always too strong for principle.” As Hume puts\nit, “a Pyrrhonian cannot expect that his philosophy will have\nany constant influence on the mind” (part 2 of section 12,\n“Of the Academical or Sceptical Philosophy,” An\nEnquiry Concerning Human Understanding, London, 1748). It is one\nthing for skepticism to be coherent. It is another thing for it to be\nlikely that anyone, no matter how much they rehearse skeptical\narguments in their mind, will succeed in adhering to it (Johnson\n2001), as ancient Pyrrhonist philosophers claimed to be able to\ndo.\n\nLike later epistemologists, the ancient skeptics start from questions\nabout knowledge. But discussion quickly turns to beliefs (Fine 2000).\nThe Greek term translated here as belief, doxa, can also be\ntranslated as opinion. The root of doxa is dokein,\nseeming. In a belief, something seems so-and-so to someone. But there\nis also an element of judgment or acceptance. The relevant verb,\ndoxazein, often means ‘to judge that something is\nso-and-so.’ Hellenistic discussions envisage three attitudes\nthat cognizers take to impressions (how things seem to them): assent,\nrejection, and suspension of judgment (epochê).\n\nSuspension is a core element of skepticism: the skeptic suspends\njudgment. However, if this means that the skeptic forms no beliefs\nwhatsoever, then skepticism may be a kind of cognitive suicide.\nArguably, belief-formation is a basic feature of human cognitive\nactivity. It is not clear whether one can lead an ordinary human life\nwithout belief, or indeed, ancient opponents of the skeptics say,\nwhether one can even survive. Perhaps even the simplest actions, such\nas eating or leaving a room without running into a wall, involve\nbeliefs (Annas-Barnes 1985, 7; Burnyeat 1980). It is also hard to say\nwhether someone who succeeded in not forming any beliefs could\ncommunicate with others, whether they could engage in philosophical\ninvestigation, or whether they could even think at all.\n\nThe ancient skeptics are well aware of these objections. The most\nwidely discussed charge is that they cannot act without belief\n(Apraxia Charge). In response, the skeptics describe their actions\nvariously as guided by the plausible, the convincing, or by\nappearances. The notion of appearances gains great importance in\nPyrrhonian skepticism, and poses difficult interpretive questions\n(Barney 1992). When something appears so-and-so to someone, does this\nfor the skeptics involve some kind of judgment on their part? Or do\nthey have in mind a purely phenomenal kind of appearing? The skeptical\nproposals (that the skeptic adheres to the plausible, the convincing,\nor to appearances) have in common their appeal to something less than\nfull-fledged belief about how things are, while allowing something\nsufficient to generate and guide action.\n\nHowever, the claim that ancient skepticism is about belief, while\nmodern skepticism is about knowledge, needs to be qualified. Ancient\nskepticism is not alone in being concerned with belief. Descartes\nspeaks repeatedly of demolishing his opinions (for example,\nMed 2:12, AT 7:18; cf. Broughton, 2002,\n33–61). Contemporary epistemology often pays equal attention to\nthe notions of both belief and knowledge. The distinctive focus\nof ancient skepticism on belief becomes clearer once we consider a\nthird concept that figures centrally in ancient discussions: the criterion\nof truth. The skeptics and their opponents discuss how one\nrecognizes a true impression as true. Are there some evident things\n(some kind of impressions), which can be used as standards or\ncriteria, so that nothing is to be accepted as true if it is not in\nagreement with these evident things? The Stoics and Epicureans\nformulate theories that conceive of such criteria. The skeptics\nrespond critically to their proposals. Accordingly, the conception of\na criterion of truth assumes as central a role in ancient debates as\ndoes the notion of knowledge in modern discussions. This debate\nincludes in-depth analysis of sense perception and its relation to\nbelief. According to Epicurus, all sense perceptions are true, but\njudgments based on these perceptions are true or false (Striker 1977,\nVogt 2017). The Stoics explore differences between sense perception,\nillusion, and hallucination (Vasiliou 2019). Their account of the\ncriterion of truth starts from perceptual impressions that qualify, or\nfail to qualify, as cognitive (Shogry 2018). The Stoics propose that\nwe should accept only cognitive impressions, and accordingly we should\nonly form beliefs based on a subset of true perceptual\nimpressions.\n\nDiscussion of the criterion of truth arguably also covers some of the\nground that is later discussed in terms of certainty. The Stoics say\nthat a particular kind of impression is the criterion of truth: the\ncognitive impression. Cognitive impressions make it clear through\nthemselves that they reveal things precisely as they are. This notion\nis an ancestor to the later conception of clear and distinct\nimpressions, and thus, to discussions of certainty.\n\nConsider next the notion of doubt. Doubt is often considered the\nhallmark of skepticism. So how can it be that ancient skepticism is\nnot about doubt (Corti 2010, Vogt 2014a)? Insofar as ‘to\ndoubt’ means no more than ‘to call into question,’\nthe ancient skeptics might be described as doubting things. However,\nskeptical investigation as Sextus Empiricus describes it does not\ninvolve doubt (I shall focus here on Pyrrhonism; on Cicero’s use\nof dubitari, see Section 3.3). Skeptics find themselves\nstruck by the discrepancies among impressions. This experience is\ndescribed as turmoil (Machuca 2019). They aim to resolve this\ndisturbance by settling what is true and what is false among them. But\ninvestigation leads them to suspension of judgment, which brings its\nown peace of mind (Outlines of Skepticism [= PH]\n1.25–30). Where in this account should we locate doubt? Is the\ninitial turmoil the ancient skeptic experiences a kind of doubt? Are\nthe ancient skeptic’s investigations a kind of doubting? Should\nwe describe suspension of judgment as a kind of doubt? All three\nstages may resemble doubt, at least insofar as the ancient skeptics\nhave not settled on answers to the questions they investigate. But all\nthree stages are also different from doubt as it is conceived in later\nepistemology. The ancient skeptics do not describe themselves as\nmaking an active effort at doubting what ordinarily they would\nbelieve, as some philosophers in the Cartesian tradition have it.\nInstead the ancient skeptics find themselves in turmoil because of\ndiscrepancies in how things strike them. Moreover, the progression\nthat ancient skeptics describe differs from the doubt-belief model\nthat later thinkers tend to employ. The ancient skeptics improve their\npsychological condition by moving from turmoil to suspension of\njudgment, not by removing doubt. It seems best, then, to refrain from\ninvoking the modern conception of doubt as at all fundamental in the\nreconstruction of ancient Greek skepticism.\n\nSome of the distinctness of ancient skepticism lies in the fact that\nit is developed by philosophers who genuinely think of themselves as\nskeptics. In later epistemology, skepticism is largely construed from\nthe outside. In particular, early modern skepticism is, for the most\npart, conceived by philosophers who aim to refute it. But ancient\nskepticism is explored by skeptics, and that is, by philosophers who\nintend their lives to be reflective of their philosophy (Cooper 2012\nch. 5.5–7; Bett 2013b). Socrates raises the challenge that it\nmight be truly bad (for one’s life, for the state of one’s\nsoul, and so on) to base one’s actions on unexamined beliefs.\nFor all one knows, these beliefs could be false, and without\ninvestigation, one does not even aim to rid oneself of false belief,\nwhich is admittedly a bad thing for one’s soul. Only an examined\nlife is worth living (Cooper 2007). Once we take this challenge\nseriously, as the ancient skeptics do, we embark on a kind of\ninvestigation that is seen as directly relevant to our lives. Our\nbeliefs are assumed, at this pre-skeptical phase, to be guiding our\nactions. Confidence in unexamined views seems misplaced. Others\nregularly disagree with us. In favor of each view, some arguments\ncan be adduced, some practices invoked, some experiences cited. These\nconflicting arguments, practices and experiences need to be examined.\nBut that just raises further views that are in conflict. As a\nconsequence, suspension of judgment on every such question looks\nrationally mandatory. But it is also rational to persist in\ninvestigation. The skeptic is committed to a search for the truth, on\nvirtually all questions, even if this search repeatedly and\npredictably leads to suspension of judgment (Cooper 2012).\n2. Skeptical Ideas in Early and Classical Greek Philosophy\n2.1 Early Greek Philosophy\n\nThe early Greek philosophers develop distinctions between reality and\nappearances, knowledge and belief, and the non-evident and the\nevident. These distinctions form the framework in which skepticism can\nbe conceived. The idea that truth is seen and knowledge gained from\nsome perspective outside of the ordinary ways of mortal life, and that\nmortals rely on something lesser, be it the hear-say of fame, or\nsigns, or appearances, runs through much of early Greek thought.\nHowever, few early Greek thinkers seem to have had skeptical or\nproto-skeptical inclinations. Xenophanes and Democritus are perhaps\nthe most prominent apparent exceptions.\n\nXenophanes famously insists that all conceptions of the gods are\nanthropomorphic and culturally contingent (DK 21B14, B15). The\nEthiopians pray to gods who look like Ethiopians, the Thracians to\ngods who look like Thracians (B16). If horses and cows had hands, the\nhorses would draw pictures of gods that look like horses, and the cows\nwould draw gods as cows (B15). Xenophanes puts forward a number of\ntheological theses of his own. But he says that no man will know the\nclear truth about such matters. He makes a point that has lasting\nrelevance in discussions of skepticism: even if someone succeeded in\nsaying something that actually is the case, he himself would not know\nthis. Thus, all is belief (120: B34) (cf. Sassi 2011 on\ninterpretations of Xenophanes that influence the history of\nskepticism).\n\nAtomism—a theory which thrives in Hellenistic times as the\nphysical theory of Epicureanism, and is thus an interlocutor of\nskepticism—leads into difficult epistemological questions. The\natomist can argue that sense perceptions are explicable as complex\nevents, initiated by objects each one made up of a lot of atoms\nfloating in the void, from which atoms proceed and traverse the\nintervening space, and affect the senses. It is certain objects, made\nup by the atoms proceeding from the objects in question (filmy images)\nthat we actually perceive. We neither perceive ‘real\nreality’ (atoms and void), nor even macroscopic objects and\ntheir properties (for example, a square tower). Democritus seems to\nhave argued along these lines (SE M 7.135–9; cf. fr. 9,\nSE M 7.136; Theophrastus, De Sensibus 2.60–1,\n63–4), and accordingly his atomist view of perception can be\nseen as grounding a kind of proto-skepticism.\n\nDemocritus’ student Metrodorus of Chios says at the beginning of\nhis book On Nature “None of us knows anything, not even\nthis, whether we know or we do not know; nor do we know what ‘to\nnot know’ or ‘to know’ are, nor on the whole,\nwhether anything is or is not” (Cicero, Acad. 2.73;\ntrans. Lee (2010) = DK 70B1; SE M 7.48, 87–8; Eusebius,\nPraep. evang. 14.19.9). This formulation reflects awareness\nof the fact that a simpler statement than the one reported in Cicero,\nsuch as “there is no knowledge,” can be turned against\nitself. In particular, Metrodorus recognizes the role that\nunderstanding concepts plays in any such statement. Does its proponent\nknow something, merely by virtue of understanding what the terms she\nuses in her philosophizing refer to? Sextus presents Metrodorus’\npronouncement as related to an enigmatic idea that he ascribes to two\nother philosophers, the Democritean Anaxarchus of Abdera and the Cynic\nMonismus (SE M 7.87–88). Both are said to have likened existing\nthings to a stage-painting. This comparison, which Burnyeat captures\nin the catch-phrase “all the world’s a\nstage-painting,” is open to a range of interpretations (Burnyeat\n2017). For Monismus, Burnyeat argues, it is likely to have had a\nmoralistic upshot, along the lines of “all is vanity.” In\nDemocritean philosophy, and insofar as later skepticism recalls the\nsaying, it is bound to be a proposal in epistemology (or possibly\nepistemology and metaphysics).\n\nThe 5th century sophists develop forms of debate which are\nancestors of skeptical argumentation (Bett 2020b). They take pride in\narguing in a persuasive fashion for both sides of an issue and\nin developing an agonistic art of refuting any claim put forward.\nFurther, the sophists are interested in the contrast between nature\nand convention. The formative roles of custom and law were discussed\nby some of the earliest Greek authors (consider Pindar’s\n“law is king” and its many interpretations, for example in\nHerodotus). The sophists explore the idea that, if things are\ndifferent for different cultures, there may be no fact of the matter\nof how those things really are. The skeptics engage with both legs of\nthe distinction between nature and convention. Pyrrhonian skepticism\nemploys an argument to the effect that, if something is by nature\nF, it is F for everyone (affects everyone as\nF) (see sections 4.2 and 4.4). Pyrrhonism further associates\nconvention with appearances, so that the sceptic, by adhering to\nappearances, can lead an ordinary life (see section 4). However, the\ncontrast between nature and convention does not figure importantly in\nancient skepticism, and there is no skeptical school that would\nconfine itself to ‘moral’ skepticism, or skepticism about\nvalues.\n\nSextus Empiricus, whose writings provide the most detailed extant\naccount of Pyrrhonian skepticism, emphasizes how strongly the skeptics\ndepart from all other philosophers. As he presents it, the\nPre-Socratics who put forward some of the views cited above are what\nhe calls dogmatists. They make claims about nature, reality,\nknowability, and so on. The second-most detailed extant account of\nPyrrhonian skepticism is offered by Diogenes Laertius, in his\nLives of Eminent Philosophers 9.61–116. It contains a\nlarge number of references to early Greek poets and Pre-Socratic\nphilosophers, suggesting that these early thinkers formulate ideas\nthat are similar to skeptic ideas (§§61–73). It is\ncontroversial whether the skeptics Diogenes has in mind claim this\nancestry. Alternatively, other philosophers may have charged the\nskeptics with sharing ideas with non-skeptical thinkers, thereby\ndeparting from their non-dogmatic approach (Warren 2015). Either way,\ntwo observations seem relevant. Contrary to a classic assessment of\nDiogenes’ report by Jonathan Barnes (1992), the sections of text\nin which connections are made between early Greek thought and\nskepticism may be worth exploring. Moreover, scholars may have paid\ntoo little attention to skepticism’s ancestry in poetry (Clayman\n2009). Pyrrho seems to have referred to Homer as a proponent of ideas\nhe approves of, ideas about change, the status of human rationality\nand language, and more.\n2.2 Plato\n\nThe Socrates of Plato’s Apology tries to solve a\npuzzle. The Delphic oracle says that no one is wiser than Socrates.\nBut Socrates does not think himself wise. He calls into question the\ntruth of neither the oracle’s pronouncements nor his\nself-perception. Accordingly, he must figure out how both are\nconsistent with each other. In order to do so, Socrates talks to\nvarious groups of experts in Athens: politicians, poets, and\ncraftsmen. As it turns out, all of them think that they know something\nabout great and important things, but in fact, it seems clear to\nSocrates, they do not. When asked they cannot provide reasons for\nbelieving the things they claim to know that are rationally\nsatisfactory. Socrates knows that he does not know about these most\nimportant matters (megista; 22d); his interlocutors, it\nappears, do not know that they lack this knowledge. In this respect,\nSocrates is wiser than everyone else who has any general reputation\nfor wisdom. In the course of recounting his conversations with others,\nSocrates says something enigmatic: “About myself I knew that I\nknow nothing” (22d; cf. Fine 2008). Some readers (ancient and\nmodern) take Socrates to profess that he knows nothing. But the\ncontext of the dialogue allows us to read his pronouncement as\nunproblematical. Socrates knows that he does not know about important\nthings. He advocates the importance of critically examining\none’s own and others’ views on important matters,\nprecisely because one does not know about them (Vogt 2012a, ch. 1).\nSuch examination is the only way to find out.\n\nSocrates’ commitment to reason—examination as the way to\nfind out—inspires the skepticism of the Hellenistic Academy\n(Cooper 2004b, Vogt 2013). One is bound to lead one’s life based\non one’s beliefs, he assumes. Therefore, one ought to examine\none’s beliefs, and abandon those that one finds to be false. One\nought to do so because otherwise one might lead a bad life.\nSocrates’ questioning is rooted in a concern with the good life.\nInsofar as it is, one might think that the Socratic roots of ancient\nskepticism lead one toward a kind of limited, wholly moral skepticism.\nHowever, Socrates’ examinations are not confined to value\nquestions. While ethical questions may be the starting-point, they\nimmediately lead to questions about the soul, the gods, knowledge, and\nso on. For Socrates and his Hellenistic followers, value questions\ncannot be insulated from questions of psychology, physics, and\nepistemology.\n\nAnother strand of skeptical thought begins with questions about the\nnature of philosophical investigation. In the Meno, Plato\nformulates a famous puzzle. How is investigation possible? We cannot\ninvestigate either what we know or what we do not know. In the former\ncase, there is no need to investigate, and besides, if we really do\nknow we already have in mind everything that investigation could\nreveal to us about the matter. In the latter case, we would not know\nwhat to look for, and we would not recognize it if we found it\n(80d-86c). So there is no room for investigating anything. Socrates\ncalls this an eristic argument, thus drawing attention to the fact\nthat this is a puzzle that sophists have put forward (cf.\nPlato’s Euthydemus).\n\nPlato’s solutions to this puzzle are difficult to assess (Fine\n2014). Learning is recollection, says one proposal (this is the one\nthat Socrates himself immediately offers). We already know, but only\nin some implicit way, what it takes investigation to come to know\nexplicitly. This is the famous Anamnesis theory (81a-d). If we give up\non investigation, we shall be lazy people, says another argument\n(81d-e). A third solution of the puzzle arguably says that one of its\npremises is false. It is not the case that, for everything, we either\nknow it or are entirely ignorant of it. Rather, there is a third\nstate, namely belief (83a-86a). Investigation can begin from\nbeliefs.\n\nThe Meno explores a mix of these solutions. Plato develops\nwhat he calls a hypothetical method (86c-100b). That is, the\ninterlocutors in some sense begin from their beliefs (for example,\n“virtue is good”). But they do not endorse them. They set\nthem up as hypotheses, and employ these hypotheses in investigation\n(on the relationship between Pyrrhonian skepticism and Plato’s\nand Aristotle’s notions of hypothesis, cf. Corti 2011). A\nspurious dialogue, the Sisyphus, discusses a similar puzzle,\nthough with respect to deliberation. Deliberation either involves\nknowledge or is mere guesswork; either way, deliberation is\nimpossible. Here, too, we may ask whether the distinction between\nknowing and not knowing is exhaustive, or whether attention to belief\nchanges the picture (Fine 2021, ch. 8).\n\nPlato discusses and re-formulates several of the metaphysical\nconsiderations that back up proto-skeptical and early skeptical\nintuitions. The relevant passages are spread out over a number of\ndialogues, among which passages in the Phaedo,\nRepublic, Theaetetus and Timaeus are\nperhaps most important. In these dialogues, Plato develops some of his\nown metaphysical ideas. He also engages critically with metaphysical\ntheories that he does not ultimately adopt. However, in order to\nexplore these theories he formulates them in detail, often invoking a\nPre-Socratic ancestor as a proponent of a given idea. These\ndiscussions are a great source of inspiration for Pyrrhonian skeptics,\nwho are interested in what may be called a metaphysics of\nindeterminacy (Bett 2000, Vogt 2021).\n\nIn contrasting the Forms with the perceptible realm, Plato discusses\nproperties. For example, for all sensible items, A is tall\nrelative to some B and short relative to some C.\nThere is no such thing as anything’s being tall\nsimpliciter. When we call something tall, we measure it\nagainst something else, look at it from a particular perspective, and\nso on. As we might say, “tall” and “short”\nare relative predicates. But perhaps many more, or indeed all,\npredicates work that way, even where this is less obvious.\nPlato’s arguments lead to the question of whether it is\nconceivable that all our predications are, in this particular sense,\nrelative. If this were the case, it might quite fundamentally upset\nour conception of the world as furnished with objects that have\nproperties. Such considerations lead to another idea about properties\nin the perceptual realm. If a fence is low and high, a cloud is bright\nand dark, a vase beautiful and ugly, and so on, then it seems that,\nperhaps quite generally, perceptual things are F and\nnot-F. Only the Form of F is F (for\nexample, only the Beautiful is beautiful). While the relevant passages\nare difficult to interpret, it is clear enough which line of thought\ncomes to influence later skeptics. The skeptics engage with the idea\nthat, if something appears to be F and not-F, it is\nnot really (or: by nature) either F or not-F.\n\nIn the Timaeus, Plato argues that an account of the natural\nworld can only be ‘likely’: it is an eikôs\nlogos. Most generally speaking, the idea here is that certain\nexplananda are such that theorizing about them can do no more than\nmirror their, comparatively speaking deficient, nature. This idea has\nancestors in Xenophanes and Parmenides, and it plays a crucial role in\nthe Timaeus (Bryan 2012). Academic skeptics employ various\nnotions of the plausible and the convincing, thus developing further\nthis tradition, albeit no longer with the assumption that different\ndomains require different kinds of theorizing.\n\nIn the Theaetetus, Plato explores the kind of cultural\nrelativism that is associated with some sophists. In his examination\nrelativism is extended to a general theory, not restricted to the\ndomain of values. Socrates (as main speaker of the dialogue) ascribes\nrelativism to Protagoras, who is famous for saying that “man is\nthe measure.” Socrates reformulates this claim as follows: what\nappears to A is true for A, and what appears to\nB is true for B. On this premise, Socrates argues,\nthere is no rational way to prefer our perceptions while awake to our\nperceptions while asleep, or similarly, to prefer sober to intoxicated\nor deranged perceptions. In each state, our perceptions are true for\nus. Socrates analyzes relativism in several steps, pointing to ever\nmore radical implications. Along the way, he envisages a moderate\nmetaphysics of flux, where objects do not have stable properties. But\neventually he points out that relativism is committed to an even\nstarker revisionist metaphysics, radical flux. For it to be possible\nthat what seems to A is true for A, and what seems\nto B is true for B, there cannot be a stable world\nthat A and B both refer to. Rather,\n“everything is motion” (Tht. 179c-184b). The\nskeptics employ versions of some of the arguments in the\nTheaetetus, without, however, arriving at relativist\nconclusions. Schematically speaking, the relativist says that,\nif X is F for A and F*\nfor B, then X is F-for-A and\nF*-for-B. Pyrrhonian skepticism of the variant found\nin Sextus reacts by continued investigation into whether X is\nF or F* (or both or neither).\n2.3 Aristotle\n\nAristotle engages, at several points in his works, with the\nMeno Problem. For example, Aristotle points out that, for\nsuccessful investigation to proceed, one first needs a well-formulated\nquestion. One needs to know the knot in order to untie it. In order to\nknow what to look for and recognize it when one finds it, one needs to\nfirst think one’s way through the difficulties involved, and\nthereby formulate a question. If one does, then one shall be able to\nrecognize the solution once one hits upon it (Met. 3.1,\n995a24–b4). These ideas are highly relevant to Hellenistic\ndiscussions. The skeptic is an investigator, and one anti-skeptical\ncharge says that, if indeed a skeptic knew nothing, they could not\neven formulate the questions they investigate. Interpreters have\nemphasized a contrast between Aristotle and the skeptics. For\nAristotle, formulating puzzles and thinking one’s way through\nthem puts one in a better position, such that one gets clear about how\nmatters are. This may be different for the skeptics: engagement with\ndifferent angles of philosophical problems leads them to suspension of\njudgment (Long 2006, Code 2010). Other scholars argue that the\nskeptics’ way of thinking through puzzles improves their\ncognitive condition even though they do not settle for an answer to a\ngiven question (Vogt 2012a, ch. 5). Also, scholars point to modes of\nthinking in Plato and Aristotle that are not primarily concerned with\nresults. In contemplation, a cognizer may think again and again\nthrough the same kinds of matters, and yet doing so presumably\nimproves their cognitive condition (Olfert 2014).\n\nIn Posterior Analytics I.1, Aristotle says that all teaching\nand learning comes about through things we already know. When we\nphrase questions, we already have ‘That-Knowledge’ and\n‘What-Knowledge.’ For example, when we ask questions about\ntriangles, we need to know that there are triangles (otherwise we\nwould not have questions about their properties). We also need to have\na notion of what triangles are (we draw a triangle, not a square, when\nwe phrase a question about its properties). Another way in which\nAristotle addresses the Meno Problem conceives of particular\nperceptions as the starting-points of investigation. Complex cognitive\nactivities arise from simpler ones. Many particular perceptions lead\nto memory, to experience, and eventually to expert understanding\n(Met. 1.1, An. Post. II.19). With the\ngeneralizations of memory, experience, and expertise comes the ability\nto investigate. With respect to skepticism, the important point here\nis that the starting-points of investigation are not themselves in\nneed of justification.\n\nLike Plato, Aristotle engages with the Protagorean claim that, as\nAristotle puts it, all seemings (dokounta) and appearances\n(phainomena) are true (Met 4.5). If this were so,\nAristotle says, everything would have to be true and false at the same\ntime. Aristotle argues that earlier thinkers arrived at such views\nbecause they identified being solely with the perceptual (4.5,\n1010a1–3). Caught up in this assumption, they did not see who or\nwhat was going to judge between conflicting sense perceptions. For\nexample, it seemed unsatisfactory to dismiss the views of sick and mad\npeople simply on the grounds that they are in the minority, thereby\nconsidering as true what appears to the greater number of people.\nSimilarly, Aristotle reports that these earlier thinkers looked at the\nways in which things appear differently to different kinds of living\nbeings, and to one person at different times (4.5,\n1099b1–11).\n\nIn Metaphysics 4.4, Aristotle notes that some people consider\nit possible for the same thing to be and not to be, and for someone to\nbelieve so (he refers to a range of positions, all of which in some\nway are related to denial of the Principle of Non-Contradiction; see\nCastagnoli 2010, I.5.4). Against this, Aristotle says it is the\nfirmest of principles that things cannot be and not be at the same\ntime. To deny this shows a lack of training. With adequate training,\none recognizes for which things proof should be sought, and for which\nit ought not to be sought (see also An. Post. I.3). It is\nimpossible that there be demonstration for everything. Otherwise\ndemonstration would go on ad infinitum. Scholars often refer\nto this point when discussing the skeptical modes of argument. The\nskeptics might be guilty of what, from Aristotle’s perspective,\nwould be a mistake of exactly this kind (on this theme in later\nAristotelian logic, cf. Malink 2020).\n\nAristotle continues in a way that is highly relevant to discussions of\nskeptical language and action. A person who wishes to deny that things\ncannot be and not be at the same time has two options. Either they say\nnothing, or they talk to us. In the first case, there is no need for\nus to refute them. This person is like a plant—they do not talk.\nIn the second case, either their utterance signifies something, or it\nsignifies nothing. If it signifies something, then they say that\nsomething is so-and-so (which Aristotle takes to be self-defeating for\nthem). If it signifies nothing, then it does not qualify as speech.\nEven though they make an utterance, the person is in effect not\nspeaking with us (or to themselves). Aristotle also explains the\nplant-metaphor in terms of action (1008b10-30). A person who believes\nnothing is like a plant because they cannot act. Pursuit and avoidance\ntestify to the fact that people have beliefs. (On Aristotle and\nskepticism, see the papers collected in Irwin 1995.)\n3. Academic Skepticism\n3.1 Arcesilaus\n\nWith Arcesilaus (316/5–241/0 BCE) and his role as leader of the\nAcademy (266/268 BCE), Plato’s Academy turns skeptical.\nArcesilaus does not refer to himself as a skeptic—this\nnomenclature is a later designation. However, Arcesilaus stands at the\nbeginning of a re-orientation in the history of Platonically inspired\nphilosophy. He rediscovers Socrates the examiner, arguably based on\nhis reading of Plato’s dialogues (Thorsrud 2018).\nSocrates’ commitment to investigation, to the testing and\nexploring of one’s own and others’ beliefs, and his\npassion for weeding out falsehoods, are the starting-points of his\nAcademic skepticism (Cicero, Acad. 2.74, 1.46). Throughout\nthe history of this skeptical school, these traits, and the\ncorresponding commitment to a life guided by reason, remain alive\n(Cooper 2004b, Vogt 2013). When, as we shall see below, Arcesilaus\ndefends a skeptical life without belief, this is because, as he\nthinks, reason itself, if properly and faithfully followed, leads us\nto live that way. To Arcesilaus, the skeptical life is a life lived\nfollowing reason, a life based on reason—just as the\ncompeting Stoic and Epicurean lives are alleged by their proponents to\nbe. Arcesilaus engages with the epistemologies of these contemporaries\nof his. In particular, the Academics call into question that there is\na criterion of truth, as both Epicureans and Stoics, beginning in the\ngeneration before Arcesilaus, claim there is. One interpretive\nquestion that concerns Arcesilaus, but also later Academic skeptics,\nis especially vexed. According to Seneca (Letter 88,\n44), the Academics paradoxically claim to know that nothing can be\nknown. Scholars disagree on how this and similar reports fit together\nwith the picture of Academic skeptics as open-minded inquirers (Allen\n2017). According to Sextus Empiricus, the Academics skeptics say that\neverything is inapprehensible (PH 1.226, cf. PH 1.3). Is\n“everything is inapprehensible” the single thing that can\nbe apprehended? Does so-called “non-apprehension”\n(akatalêpsia) amount to the general claim that there is\nno knowledge? Alternatively, the Academics may dialectically\nappeal to the Stoic notion of katalêpsis, and argue\nmerely that the Stoic notion of apprehension is not compelling (Allen\n2022).\n\nLike Socrates, Arcesilaus did not write anything. His views must be\nunearthed from Sextus’ comparisons between Pyrrhonian and\nAcademic skepticism, from Cicero’s discussions in the\nAcademica, and from a range of shorter (and sometimes\nhostile) reports. Major themes in Arcesilaus’ philosophy are (i)\nhis dialectical method, (ii) discussion of whether there is a\ncriterion of truth, and (iii) his defense of the skeptic’s\nability to act.\n\n(i) Method. Arcesilaus embraces what scholars call a dialectical\nmethod (Couissin 1929 [1983], Perin 2013, Thorsrud 2018). This method\nis inspired by Socrates. It proceeds by asking one’s real or\nimaginary interlocutor what they think about a given question, then\nplunging into an examination of their views, employing their premises.\nCan they explain their position without running into inconsistencies,\nand without having to accept implications that they want to resist? As\na consequence of this method, it sometimes appears as if a skeptic,\nwhile examining someone’s view and its consequences, makes a\npositive claim: “so, such-and-such is not so-and-so.”\nHowever, within a dialectical exchange, this should be read as\n“according to your premises, such-and-such\nfollows.” This method remains a key ingredient of Greek\nskepticism. While the different skeptical schools develop variants of\nthe dialectical method, skeptical argument is often characterized by\nthe fact that skeptics think of themselves as engaging with\n“dogmatic” interlocutors. In the skeptical tradition, as\narticulated for example by Sextus Empiricus (see section 4.4.),\n“dogmatists” are philosophers who put forward, and defend,\npositive answers to philosophical questions about reality, knowledge,\nethical values, etc. They need not do so dogmatically or rigidly or\nwithout consideration of alternatives in order to count, in skeptical\nterms, as “dogmatists.”\n\n(ii) The Criterion of Truth. Zeno, the founder of Stoicism, and\nroughly 20–30 years Arcesilaus’ senior, was for a time a\nstudent at the Academy. He was still in the Academy when he formulated\nkey Stoic doctrines. Like Arcesilaus, he claims Socratic ancestry.\nZeno is inspired by some of the same ideas that inspire the skeptics.\nIn particular, he engages with the Socratic idea that knowledge is\nintegral to virtue. Contrary to Arcesilaus, Zeno aims to give accounts\nof knowledge and virtue, and holds them up as ideals that human nature\npermits us to achieve. For him, knowledge is very difficult to attain,\nbut ultimately within the reach of human beings. From the point of\nview of Arcesilaus, Zeno’s claim to Socratic heritage is almost\noffensive: Zeno seems to be too optimistic about our cognitive powers\nto be following Socrates (Frede 1983). Scholars have traditionally\nenvisaged an exchange of arguments between Zeno and Arcesilaus, where\neach modified his views in the light of the other’s criticism.\nHowever, Zeno most likely formulated his views between 300–275,\nand Arcesilaus argued against him c. 275 to 240, when Zeno (who died\nc. 263) was probably already retired (Brittain 2006, xiii; Alesse\n2000, 115 f.; Long 2006, ch. 5).\n\nThe core of the dispute between Arcesilaus and the early Stoics\nconcerns the question of whether there is a criterion of truth. The\nnotion of a criterion is introduced into Hellenistic discussions by\nEpicurus, who speaks about the kanôn (literally\nmeasuring stick) and kritêrion. For Epicurus, a\ncriterion is that evident thing, viz., the content of a\nsense-perception, against which claims about the non-evident are\ntested. For example, physics advances claims about non-evident things,\nsuch as atoms and void. These are not accessible to the senses, and\naccordingly, do not count as evident. Perception rules out various\nphysical theories. For example, a physical or metaphysical theory\naccording to which there is no movement can be dismissed because it is\nin disagreement with the evident.\n\nZeno argues that a certain kind of impression—namely a cognitive\nimpression (phantasia\nkatalêptikê)—is the criterion of truth (cf.\nShogry 2018). Zeno’s conception of cognition\n(katalêpsis, literally grasping, apprehension), and the\nrelated notion of a cognitive impression, aim to solve an\nepistemological problem. Belief-formation aims at the truth; there is\na norm inherent in the practice of believing that one should only\nbelieve truths. It is not transparent to us, however, which of our\nbeliefs, or claims to the effect that such-and-such is true, are\nsuccessful in their aim and hit the truth. Zeno argues that some\nimpressions are cognitive. A number of Stoic definitions of the\ncognitive impression, formulated by Zeno and his successors, are\ntransmitted.  Scholars approach them in at least three ways. First,\nsome scholars consider one of the Stoic definitions (SE M 7.247–52) as\ncanonical (Nawar 2014, Shogry 2018). Two, scholars at times examine\nspecific exchanges between Stoics and skeptics in the assumption that\nsome clauses in Stoic definitions respond to skeptic objections (for\nexample, Nawar 2017). Three, scholars have also pointed out that, here\nas elsewhere, the Stoics offer a multitude of definitions, without\nprivileging one of them as “the” definition; different\ndefinitions may speak to different dialectical contexts or theoretical\nfoci (Vogt 2022).\n\nWith some simplification, a cognitive impression reveals its content\nand that it is kataleptic (cf. Cicero, Academica\n2.77–8). For example, when I look at my computer screen\nwhile typing this, I may very well have a cognitive impression that\nthis is my computer screen. When I look up and out of the window, I\nhave an impression of a friend walking across campus that is probably\nnon-cognitive. This impression might be true. But since I see her from\nsuch a distance, it is pretty surely not cognitive. That is, not all\ntrue impressions are cognitive, but all cognitive impressions are\ntrue. We should only assent to cognitive impressions, and so in\nforming our beliefs, hold only those certified beliefs (cf. Brittain\n2014 on the Stoic view that assent to cognitive impressions is not\ncompelled).\n\nArcesilaus calls into question whether there are impressions of this\nkind. His main point seems to be that there could be an impression\nthat is phenomenologically indistinguishable from cognitive\nimpressions, but nevertheless misrepresents the matters it gives an\nimpression about. To use an example that may derive from Carneades\n(see section 3.2), there is no impression of a given egg such that no\nimpression of any other egg could be phenomenologically\nindistinguishable from it (Shogry 2018 and 2021, Machek and Veres\nforthcoming). Assuming that some clauses in Stoic definitions respond\nto specific skeptic challenges, the following clause, added to a\nshorter definition, appears to speak to these cases: “and\nof such a kind as could not arise from what is not”\n(Long and Sedley (1987) [= LS] 40; DL 7.46, 54; Cicero Acad.\n1.40–1, 2.77–8; SE M 7.247–52). Absent a\ncriterion of truth, Arcesilaus’ skeptic suspends judgment about\neverything (PH 1.232). Reason itself, Arcesilaus thinks,\ndemands such suspension.\n\n(iii) Action. If skeptics suspend judgment, argues their dogmatic\nopponent, they are not able to act. Stoic philosophy conceives of\nthree movements of the mind: impression, assent, and impulse\n(Plutarch, Col. 1122a-d). All three figure in action. The\nagent assents to the impression that A is to be done; their\nassent is an impulse for the action A; if there is no\nexternal impediment, the impulse sets off the action (Inwood 1985). It\nis a cornerstone of Stoic philosophy that there can be no action\nwithout assent, and so without the belief that the action done is\nto be done. The Stoics aim to avoid the kind of determinism\naccording to which actions are not ‘up to’ the agent\n(Bobzien 1998); for them, assent, but not impression, is up to the\nagent. In response to the Apraxia Charge, Arcesilaus seems to have\nargued that the skeptic can act without having assented (Plutarch,\nCol. 1122A-d), and so without believing that the action done\nis to be done. However, this is not his complete response.\nFrom the point of view of the Stoics, skeptical action, if performed\nwithout the relevant kind of assent (that is, assent that it is up to\nthe agent to give, and that is a rational acceptance of the\nimpression), is like the action of a non-rational animal, or like the\nautomatic movement of plants when they grow and flourish. Arcesilaus\nis robbing people of their minds (Cicero Acad. 2.37–9;\nObdrzalek 2013). But Arcesilaus need not and does not go so far as to\ncompare human agents with non-rational agents. As human beings,\nskeptics have rational impressions. They perceive the world\nconceptually, and think about it. Arcesilaus does not suggest that\nskeptical action is causally set off by impressions, or in the way,\nwhatever that is, that animal actions are set off. This would be a\nproblematic proposal, for it would disregard that the skeptic has a\nhuman mind. Given the complexity of human thought, the skeptic is\nlikely to have several, and often competing impressions. If all\nimpressions triggered impulses, the skeptic would be inactive due to a\nkind of paralysis. The second component of Arcesilaus’ reply,\nthus, is that the skeptic, in acting without assenting, adheres to the\nreasonable (eulogon) (SE M 7.158; 7.150; Striker\n2010). That is, Arcesilaus aims to explain skeptic action as rational\nagency (Cooper 2004b). Arcesilaus disputes the dogmatic claim that\nsome impressions can be identified as true, and the related claim that\none can only act on the belief that some impression is true.\nBut he does not argue that there are no differences between\nimpressions which agents could take into account. His agents are\nrational: they think about their options, and go with what looks, in\none way or another, more plausible.\n\nArcesilaus defends skeptical action also against Epicurean critics\n(Plutarch, Col. 1122A-d), again by showing on the basis of\nthe Epicureans’ own premises that skeptical action is possible.\nCan the sceptic explain why, when leaving a room, they go through the\ndoor rather than running into the wall? Arcesilaus seems to have\nexploited the Epicurean view that, while all sense-perception is true,\nbelief can introduce falsehood. Like the Epicurean, the skeptic can\nkeep apart the perception and a view formed on its basis. By not\nassenting to the perception, thus adding belief (“here is the\ndoor”), the skeptic guards against the source of falsehood,\nnamely belief. But a skeptic has perception of the door available to\nthem, which is enough for not running into walls.\n3.2 Carneades\n\nLike Arcesilaus, Carneades (214–129/8 BCE) refrains from writing\nand philosophizes in a Socratic spirit. Carneades led an embassy of\nthree philosophers from Athens to Rome in 156/5 BCE. Aside from his\nofficial role, he is said to have given two speeches, arguing for\njustice one day and against justice the next. Whether or not this is\nhistorically correct (Powell 2013), the traditional take on\nCarneades’ speeches is not that he aims to overthrow justice.\nInstead, the upshot is taken to be that he wants to show that the\nsupporters of justice—including Plato and Aristotle—do not\nhave the successful arguments they think they have to show what\njustice is and what it requires (Lactantius, Epitome 55.8, LS\n68M). Like Arcesilaus, Carneades (i) engages with Stoic epistemology.\nHis account of skeptical action includes (ii) a detailed proposal\nregarding the criterion. As part of his less radical skepticism,\nCarneades seems (iii) to allow for a certain kind of assent, and\nperhaps for belief.\n\n(i) The Stoic-Academic Debate. Chrysippus, the third major Stoic\n(after Zeno and Cleanthes), and his student Diogenes of Babylon,\nrevise Zeno’s epistemology, defending it against\nArcesilaus’ arguments (Brittain 2006, xiii). In response to\ntheir arguments, Carneades continues the exchange with the Stoics that\nArcesilaus began (SE M 7.402–10). His first move\naddresses the link between mental states and action. People in states\nof madness, he argues, act just as easily and naturally on their\nimpressions as other people, even those who act on cognitive\nimpressions (if there are any). From the point of view of exhibited\nbehavior, there does not seem to be a difference: any and all\nimpressions, even those the Stoics think clearly arise from something\nthat is not, are in all respects relevant to action completely on a\npar. Cognitive impressions, if there are any, have no superiority.\n\nIn a second argument, Carneades points to objects that are similar to\none another: can the wise person discern any two eggs, two grains of\nsand, and so on? The Stoics have multiple replies. It is conceivable\nthat, in some contexts of action, the wise person assents to what is\nreasonable (eulogon) (DL 1.177), without having a cognitive\nimpression of how things are. Or, if faced with the task to identify\ngrains of sand while lacking a cognitive impression, the wise person\ncan suspend judgment. However, the wise will train themselves so as to\nbe able to perceive minute differences (Cicero, Acad. 2.57),\nwhere it might be important to do so. This point is backed up by Stoic\nphysics: no two items in the universe are identical, and their\ndifferences are in principle perceptible (Sedley 1982, 2002).\nCarneades replies that even if no two things were exactly alike\n(consistent with his general line of argument, he does not take a\nstance on such questions), a very close similarity could appear to\nexist for all perceivers (Cicero, Acad. 2.83–5); that\nis, the impressions of two items, though in fact these items might\ndiffer from each other, could be indistinguishable (Nawar 2017, Shogry\n2018 and 2021). Discussion continues with a move on the part of the\nStoics: they add to their definition of the cognitive impression\n“one that has no impediment.” Sometimes an impression\nis—as it were, by itself—cognitive, but is unconvincing\ndue to external circumstances (SE M 7.253). It is a difficult\nquestion whether this addition harms the Stoics more than it helps\nthem. If the initial conception of a cognitive impression hangs on the\nidea that something about its phenomenological nature, or something\ninternal to the impression, marks it as cognitive, the Stoics give up\non a crucial assumption if they grant that sometimes there are\n“impediments.” If, however, cognitive impressions are\ndifferentiated by a causal feature (the way they are caused by the\n‘imprinter’ which causes the ‘imprint’), the\nfurther addition might help (Frede 1983, Nawar 2014), since the\nimpediment might need to be removed before the causal connection could\nbe confirmed (Hankinson 2003).\n\n(ii) Carneades’ Criterion. Even though Carneades further pursues\na discussion begun by Arcesilaus, he does not simply continue within\nthe framework of Arcesilaus’ skepticism. The distinctiveness of\nhis position is best seen in the context of his criterion: the\npersuasive (pithanon). The notion of the persuasive can be\nunderstood in two distinctively different ways. Persuasiveness might\nbe a causal feature, so that a persuasive impression sets off a\nphysiological process of being moved in a certain way. But there may\nalso be a rational kind of persuasiveness. Carneades construes\npersuasiveness in rational terms. For him, the persuasive is the\nconvincing, or perhaps even the plausible.\n\nCarneades develops a three-stage criterion: (1) In matters of\nimportance, skeptics adhere to the persuasive. (2) In matters of\ngreater importance, they adhere to the persuasive and undiverted. A\npersuasive impression is undiverted if there is no tension between it\nand its surrounding impressions. (3) In matters that contribute to\nhappiness, skeptics adhere to persuasive, undiverted, and thoroughly\nexplored impressions. A persuasive impression is undiverted and\nthoroughly explored when it and the surrounding impressions are\nclosely examined without its persuasiveness being diminished (SE\nM 7.166–84). Consider an example. A skeptic looks in a\ndark room for a rope. Before they pick up what appears to them to be a\nrope, they look closely and poke it with a stick. Coiled objects can\nbe ropes, but they can also be snakes. The persuasive impression that\nthis is a rope must be examined before the skeptic adheres to it\n(M 7.187).\n\nThe three-stage criterion is put forward in the context of action.\nHowever, Sextus describes Carneades’ criterion as a criterion of\ntruth, not a criterion of action (M 7.173). Carneades might\ntake himself to offer more than a practical criterion. His discussions\nof the persuasive come close to a general epistemological theory\n(Couissin 1929 [1983], Striker 1980, Bett 1989 and 1990, Allen 1994\nand 2004 [2006], Brittain 2001). Cicero renders the Greek\npithanon as probabile (and sometimes as veri\nsimile), which modern editors sometimes translate in terms of\nwhat is probable or likely to be true. Some scholars think that\nCarneades is an early thinker about likelihoods, and argue that he\ndevelops a fallibilist epistemology (Obdrzalek 2004).\n\n(iii) Assent and Belief. Does adherence to persuasive impressions\ninvolve belief? Carneades coins a term for the kind of adherence he\nhas been describing: approval (Cicero, Acad. 2.99). He\ndistinguishes it from assent in the sense of Stoic and other dogmatic\ntheories, which establishes a belief that something is in actual fact\ntrue; but he nevertheless describes it as a kind of assent (Cicero,\nAcad. 2.104). Carneades’ disciples disagree on whether\napproval is any kind of genuine assent. That is, they disagree on\nwhether, in approval, one forms a belief. Philo and Metrodorus think\nthat Carneades allows for some kind of belief, close to or identical\nwith belief as the Stoics understand it. Clitomachus disagrees, and\nCicero follows Clitomachus (Acad. 2.78, see also 2.59, 2.67).\nScholars continue to debate these issues (Allen 2022), and the basic\nproblem remains unchanged. It is not clear whether there is a\nplausible notion of belief according to which belief falls short of\n‘holding to be true’ (or according to which, though some\nkind of ‘holding true’ is involved, the relevant\naffirmation-as-true is weaker than in beliefs as Stoics and other\ndogmatist epistemologists conceive of them). In any event,\naffirmations as true, at least of the full and flat-out (“in\nactual fact”) sort the Stoics think of, are precisely what the\nskeptic does not make.\n\nAnother approach to Carneades’ stance toward belief is to ask\nwhether he might invoke Platonic considerations. Consider that\nSocrates, when asked in the Republic what he thinks the good\nis, refuses to reply because he thinks beliefs without knowledge are\nshameful (Rp. 506c). In response to this, his interlocutors\npoint out that there is a difference between putting forward\none’s beliefs as if one knew them to be true, and putting them\nforward with the proviso that they are merely beliefs (Vogt 2012a, ch.\n2). The shamefulness of mere belief might disappear through this\nproviso. A passage in Cicero’s Academica suggests that\nCarneades invokes this thought. According to Carneades, the wise\nperson can hold beliefs if they fully understand them to be beliefs\n(2.148). Along similar lines, it has been suggested that Carneades\nmight conceive of a hypothetical mode of believing (Striker 1980\n[1996, 112]), perhaps engaging with a move in Plato’s\nMeno. Investigation cannot get off the ground if we do not,\nin some sense, begin with our beliefs about the matter under\ninvestigation. But how can we do so without endorsing our beliefs, not\nknowing whether our views are true? Plato’s answer at this point\nis: by hypothesizing our beliefs. Today we would insist that\nhypotheses are not beliefs. However, it is conceivable that Carneades\nargued along these lines, and that the details of his vocabulary got\nlost or confused in doxography.\n3.3 Later Academic Skepticism\n\nCarneades was an enigma to his students and immediate successors.\nClitomachus (head of the Academy from 127 to 110 BCE) seems to have\nattempted the impossible: to adhere closely to Carneades’\nphilosophy, even though he never understood what Carneades truly meant\n(Levy 2010). The cornerstone of his adherence lies in the view that\nCarneades argues for suspension of judgment and against beliefs\nunderstood as Stoics understand them. Philo of Larissa, another\nstudent of Carneades, interprets his teacher as allowing for tentative\nbeliefs in the skeptic’s life. With Philo, the skeptical era of\nPlato’s Academy comes to an end. Philo’s philosophy seems\nto divide into two phases. In Athens, and as head of the Academy, he\nstays relatively close to Carneades. Moving to Rome later in his\ncareer, he develops a markedly different position. He argues only\nnarrowly against the Stoic criterion and their conception of\ncognition. One can apprehend things and so come to know\nthem—one just cannot apprehend them in the way in which the\nStoics construe cognition (PH 1.235). The fact that there is\nno apprehension in the sense of the Stoics does not mean that there is\nno knowledge (Acad. 2.14). This move shifts the discussion in\nseveral important ways. First, Philo can be interpreted as a kind of\nexternalist: one can know something without knowing that one knows it.\nAbsent Stoic cognitive impressions, we are not able to identify which\ninstances of ‘holding-true’ qualify as knowledge; but we\nnevertheless have some knowledge (Hankinson 2010). Second, this\nproposal is a step toward modern skepticism, which is not concerned\nwith criteria of truth, but with knowledge.\n\nCicero’s skeptical philosophy in his own philosophical writings\nis again distinctively different. In line with his notions of what is\nprobable (probabile) or likely to be true (veri\nsimile), Cicero often examines a range of philosophical\npositions, aiming to find out which of them is most rationally\ndefensible. He thinks it is better for us to adopt a view that is\nlikely to be true, rather than remain unconvinced by either side\n(Thorsrud 2009, 84–101). Cicero is of the greatest importance\nfor the transition between ancient and early modern skepticism. As in\nother fields of philosophy, Cicero’s influence is partly the\ninfluence of the translator. In transposing philosophical ideas into\nthe language of a different culture, the ideas change. Cicero\nsometimes speaks of doubting, dubitari (e.g., Acad.\n2.27, 106; however, he often sticks with the earlier language of\nassent and suspension). But doubt has no place in Greek skepticism\n(see section 1).\n4. Pyrrhonian Skepticism\n4.1 Early Figures: Pyrrho and Timon\n\nWhen comparing Pyrrhonian and Academic skepticism, two topics stand\nout: Pyrrhonism aims at tranquility; and it assigns pride of place to\nappearances. Anecdotes about Pyrrho’s life (365/60–275/70\nBC) convey how unaffected he was (DL 9.61–69). This kind of\nideal—a tranquil state of mind—is not part of Academic\nskepticism, and scholars disagree on its role in Pyrrhonism\n(Machuca 2006; Striker 2010; Perin 2020; on Democritean\ninfluences on tranquility in Pyrrho and Timon, cf. Svavarsson 2013).\nInsofar as the point of the anecdotes about Pyrrho’s life is\nthat Pyrrho did not avoid or pursue anything with fervor, or that he\ndid not despair about things that other people find terrible, they\ncapture ideas that remain central to Pyrrhonism (for a general account\nof early Pyrrhonism, cf. Castagnoli 2013; on Sextus’ take\non Pyrrhonian tranquility, cf. Svavarsson 2015).\n\nThe biographical anecdotes portray Pyrrho as a strikingly\nunconventional figure, unaffected not just by emotion and belief, but\nalso by perception—to the extent that friends had to pull him\noff the street when a wagon approached (DL 9.62). At the same time,\nPyrrho seems to have said that the skeptic adheres to appearances\n(phainomena) (DL 9.106; Bett 2000, 84–93; on earlier\nnotions of appearances relevant to skepticism, cf. Barney 1992). This\nmight suggest that he would not cross the street when a wagon is\napproaching, and so appears to him. One story makes Pyrrho appear\nnot only unusual, but arguably a not so sympathetic character. Passing\nby a drowning man, he was so unmoved that he simply walked on (DL\n9.63). This is in rather stark contrast with Stoic notions of\nunaffectedness, where the idea would be that, not being disturbed by\nemotions like fear and panic, the passerby is ideally equipped to help\neffectively. Some biographical details can seem to mold\nPyrrho’s life to fit the schema of the sage: a traveler to the\nEast (Flintoff 1980), whose insights are conveyed in brief sayings; an\nenigmatic figure, exemplary and shocking at the same time. Though it\nis difficult to assess the testimony on Pyrrho’s travels,\nscholars increasingly explore resonances between Pyrrho’s\npronouncements, later Pyrrhonian skepticism, and dimensions of\nBuddhist philosophy (Hanner 2020). For example, Mill (2018) argues\nthat a tradition in classical Indian philosophy develops a\n“skepticism about philosophy” that resembles dimensions of\nPyrrhonian thought.\n\nEven though he discussed tranquility and adherence to appearances,\nPyrrho was arguably no Pyrrhonian skeptic (Bett 2000, 14–62).\nThat is, it is likely that he put forward a dogmatic position, in the\nsense that he had positive philosophical views about the character of\nreality. Pyrrho wrote nothing. Much of what we know about him is\npreserved through the writings of Timon, his adherent\n(325/20–235/30 BCE) (Burnyeat 1980b; Clayman 2009). The\nmost important piece of testimony is a passage reporting an account by\nTimon:\n\nIt is necessary above all to consider our own knowledge; for if it is\nin our nature to know nothing, there is no need to inquire any further\ninto other things. […] Pyrrho of Elis was also a powerful\nadvocate of such a position. He himself has left nothing in writing;\nhis pupil Timon, however, says that the person who is to be happy must\nlook to these three points: first, what are things like by nature?\nsecond, in what way ought we to be disposed towards them? and finally,\nwhat will be the result for those who are so disposed? He [Timon] says\nthat he [Pyrrho] reveals that things are equally indifferent and\nunstable and indeterminate (adiaphora kai astathmêta kai\nanepikrita); for this reason, neither our perceptions nor our\nbeliefs tell the truth or lie (adoxastous kai aklineis kai\nakradantous). For this reason, then, we should not trust them,\nbut should be without opinions and without inclinations and without\nwavering, saying about each single thing that it no more is than is\nnot, or both is and is not, or neither is nor is not (ou mallon\nestin ê ouk estin ê kai esti kai ouk estin\nê oute estin oute ouk estin). Timon says that the result\nfor those who are so disposed will be first speechlessness\n(aphasia), but then freedom from worry (ataraxia);\nand Aenesidemus says pleasure. These, then, are the main points of\nwhat they say (Aristocles in Eusebius PE 14.18.1–5 =\nDC53; tr. Bett 2000 with changes)\n\n\nIn response to the first question, how things are in their nature,\nPyrrho makes a metaphysical claim: they are indeterminate (Bett 2000,\n14–29). There are no stable items, or no items with stable\nproperties. Scholars sometimes hesitate to ascribe such a position to\nPyrrho, because it is undoubtedly dogmatic. Perhaps the text can be\ngiven an epistemological reading: things are indifferentiable and\nunmeasurable and undecidable, because we fail in differentiating,\nmeasuring, and determining how they are (Svavarsson 2010; Thorsrud\n2010). But Pyrrho’s response to the second question may only\nfollow if we adopt the metaphysical reading (Bett 2000, 29–37).\nPyrrho infers that our perceptions and beliefs are neither true nor\nfalse. They are not truth-evaluable, presumably because there are no\nfacts which could be correctly captured. Third, if we understand these\nthings, speechlessness (aphasia) follows, and then\ntranquility (ataraxia). Pyrrho does not say that we should\ncease to speak. He suggests that we adopt a complicated mode of\nspeech, constructed around the expression ou mallon\n(“no more”), which aims to capture the indeterminate\nnatures of things, when we attempt to say anything about anything\n(Bett 2000, 37–39; Vogt 2021).\n4.2 Aenesidemus, the Ten Modes, and Appearances\n\nAenesidemus (first century BCE) was discontented with the views\ndiscussed in the Academy at his time, of which he began as an\nadherent. Philo’s proto-externalism as well as a counterposition\nformulated by Antiochus both appeared to him dogmatic. Aenesidemus\naimed to revive a more radical skepticism, and left the Academy for\nthis purpose. Arguably, he is the first Pyrrhonian skeptic.\nAenesidemus wrote a treatise, the Pyrrhonian Discourses,\nprobably similar in structure to Sextus’ Outlines of\nPyrrhonism and partially preserved in a summary by Photius:\na general account of skepticism, followed by books on particular\nphilosophical questions (Hankinson 2010). The basic elements of\nAenesidemus’ skepticism are: the skeptic puts appearances and\nthoughts into opposition; this generates equipollence\n(isostheneia, lit. “of equal weight”) between\nseveral appearances and/or thoughts; suspension of judgment follows;\nwith it comes tranquility; and the skeptic leads a life according to\nappearances (DL 9.62, 78, 106–7). However, we do not know much\ndetail of his views on these matters. Instead, Aenesidemus is famous\nfor having developed Ten Modes or Tropes—forms of argument by\nwhich the sceptic puts appearances and thoughts into opposition. Key\nquestions about Aenesidemus’ skepticism concern (i) the\ninterpretation of his Modes, (ii) the relationship of his philosophy\nto competing theories, (iii) the scope of the Ten Modes, and (iv) the\nskeptic’s mode of speech.\n\n(i) Conflicting Appearances or Causal Invariance. The Ten Modes are\npreserved in Diogenes Laertius (9.78–88), Philo of Alexandria\n(On Drunkenness 169–202), and Sextus. Diogenes’\naccount of the Ten Modes may postdate Sextus’ (Sedley\n2015). Sextus gives extensive illustrations, and integrates the Ten\nModes into his general account of Pyrrhonism (PH\n1.36–163; cf. M 7.345 for ascription of the Ten Modes\nto Aenesidemus; cf. Annas-Barnes 1985 and Hankinson 1995, 268; the\nsequence below follows Sextus). Here is the first of the Ten Modes,\ninterpreted in two ways.\n\n\n10–1:\n\nArguments concerning oppositions based on the differences between\nkinds of animals.\n\nConflicting Appearances Interpretation:\n\nX appears F to animal of kind A (e.g.,\nhumans) and F* to animal of kind B [where F\nand F* are opposite or otherwise incompatible properties]. We\ncannot judge how X really is, because we are a party to the\ndispute.\n\nCausal Invariance Interpretation:\n\nFor something to be ‘really’ F, it would have to\nconsistently affect different perceivers as F. But different\nconstitutions of different animals cause different impressions of the\nsame thing. For different animals, something is F and\nF* (where F and F* are opposite or\notherwise incompatible properties). Therefore, things do not seem to\nreally be F or F*.\n\n\nThe Conflicting Appearances Interpretation is based on Sextus’\naccount (Annas-Barnes 1985). The focus here is on the idea that every\nkind of animal, perceiver, sensory faculty, thinker, or judger\n(depending on which mode we consider) is only one of several animals,\nperceivers, sensory faculties, thinkers, or judgers. The object is\nperceived or considered from a particular point of view. Everyone is a\nparty to the dispute, and there is no ‘view from nowhere.’\nAccordingly, the dispute cannot be decided. The Causal Invariance\nInterpretation, on the other hand, suggests that the focus on\ndecidability is introduced by Sextus. Aenesidemus may (implicitly or\nexplicitly) have endorsed the following idea: if X were\nF by nature, X would affect everyone as F.\nIf X affects different people (living beings, sensory\nfaculties, etc.) as F and F*, X is by\nnature neither F nor F*. For example, if X\nis harmful to A and beneficial to B, it is neither\nharmful nor beneficial in its nature (Woodruff 2010, Bett 2000). The\nTen Modes can generally be construed as engaging either with conflicts\nbetween appearances or with causal invariance:\n\n\n10–2:\n\nArguments based on the differences among human beings (differences in\nbody and in soul).\n\n10–3:\n\nArguments based on the differences between the senses and on the\ncomplexity of perceived objects.\n\n10–4:\n\nArguments based on states (dispositions and conditions of a human\nbeing, such as age, motion versus rest, emotions, etc.).\n\n10–5:\n\nArguments based on positions, distances, and places.\n\n10–6:\n\nArguments based on mixtures (objects in conjunction with external\nthings like air and humidity; physical constituents of sense organs;\nphysiology of thought).\n\n10–7:\n\nArguments based on the composition of the perceived object.\n\n10–8:\n\nArguments based on relativity (to the judging subject, to\ncircumstances, etc.). 10–8 comprises at least 10–1 to 10–7, or all Ten\nModes.\n\n10–9:\n\nArguments based on constancy or rarity of occurrence.\n\n10–10:\n\nArguments concerned with ways of life, customs, laws, mythical\nbeliefs, and dogmatic assumptions, all of which can be put into\nopposition to each other.\n\n\n(ii) Skepticism, Relativism, Epicureanism. Consider first the\nrelationship between skepticism and relativism (cf. Bett 2000; Vogt\n2012a, ch. 4). Relativism, as envisaged in Plato’s\nTheaetetus, looks at a similar range of phenomena. Things\nappear different to different kinds of animals; to different people;\nand so on. Relativism embraces the intuition that there is (as we\nwould say today) faultless disagreement. That is, you and I disagree,\nbut neither of us is wrong. Accordingly, metaphysical relativism\nclaims we must give up the intuition that we both refer to the same\nthing. In the Theaetetus, the world dissolves into radical\nflux: there are no stable items with stable properties that we both\nrefer to.\n\nThe Ten Modes, according to Conflicting Appearances, differ from\nrelativism by turning precisely the other way (Annas-Barnes 1985,\n97–8; Pellegrin 1997, 552–3). They implicitly rely on the\nintuition that there are stable items with stable properties. Of\ncourse, the skeptic is not committed to the thesis that opposites\ncannot hold of the same thing, and that therefore no two conflicting\nappearances can be true. However, the modes presuppose a common sense\nmetaphysics that does not accommodate faultless disagreement. In all\ncases of disagreement, at best one of us can be right. If we cannot\nfigure out which view is right, we should suspend. This does not mean\nthat Pyrrhonians are committed to a common-sense metaphysics. The Ten\nModes are only one of several tools that skeptics have at their\ndisposal. They may thus imply a metaphysics that, at other points,\nskeptics would call into question (cf. Fine 2003b, 352).\n\nCausal Invariance differs from Conflicting Appearances precisely with\nrespect to the metaphysics that is, even if only dialectically,\ninvoked. Aenesidemus seems to have explored the relationship between\nskepticism and flux. He remarks that skepticism leads to Heraclitean\nphilosophy. The idea that one thing appears to have contrary\nproperties (the ones it appears to different animals/persons/senses to\nhave) leads to the idea that one thing actually has contrary\nproperties (PH 1.210; cf. Schofield 2007 on the role of\nHeraclitus and causal invariance). This remark can be taken as an\nexpression both of moderate flux and of relativism (Aenesidemus does\nnot seem to think of radical flux, where it is no longer even possible\nto refer to anything). There is no stable reality of how things are\n(moderate flux); X is F and F* insofar as,\nif X seems F to A, this is true for\nA, and F* to B, this is true for B\n(relativism). This proposal differs from the Causal Invariance\ninterpretation of the Modes presented above. There, Aenesidemus seems\nto argue that things do not really have stable properties (they are\nneither F nor F* by nature); he does not say that\nthey are F and F* (as relativism says).\n\nA third approach, competing with skepticism and relativism, is\nEpicurean epistemology. Again, the set of phenomena to be accounted\nfor is the same. But it is described differently. Epicurus insists\nthat we should not even speak of conflicting appearances. Rather, we\nshould speak of different perceptions. Perceptions cannot refute each\nother, because they are of the same weight. Epicurus here uses the\nterm that is central to Pyrrhonism: equal weight,\nisostheneia (DL 10.31–2). The fact that\nperceptions differ has perfectly reasonable explanations: I look from\na distance, you look from nearby; I have a cold, you are healthy; I am\na human being, another cognizer is a dog; and so on. These facts\nfigure in the explanations of how our perceptions are constituted.\nAccordingly, Epicurus argues, all perceptions, even though they\ndiffer, are true. They all have a causal history that physics can\nexplain. The precise interpretation of this proposal is controversial.\nOne might object that the notion of truth employed here is deeply\npuzzling. It is not clear what it means to describe all perceptions as\ntrue if they cannot be true or false.\n\n(iii) Scope. For the greatest part, the Ten Modes seem to be concerned\nwith perception in a broad sense, so that it includes pleasure and\npain, harm and benefit, as well as pursuit and avoidance. To perceive\nsomething as pleasant or beneficial is to pursue it. Perception and\nevaluation are also mixed in another way: depending on the frequency\nwith which we perceive something, it seems more or less amazing and\nprecious to us. 10–10 envisages oppositions that can\nbe construed with the help of dogmatic theses. The Ten Modes thus fit\nSextus’ description of what skepticism is: the ability to put\nappearances and thoughts (phainomena and nooumena)\ninto opposition (PH 1.8, 1.31–33; cf. DL 9.78).\n\nAnother issue concerning the scope of the Ten Modes is whether they\naddress general or particular matters. Compare the example of whether\nthe tower is round or square (T) to the example of whether honey is\nsweet or bitter (H). (T) is a particular; the question is whether this\ntower is round or square. (H) can be construed as a particular\n(“is this bit of honey sweet?”), or as a general issue\n(“is honey sweet?”). The Ten Modes offer strategies for\nsuspension of judgment on both kinds of questions.\n\nScholars have asked whether it is a problem for skepticism if the Ten\nModes appear ‘systematic’ (Sedley 2015). A set of\narguments that aims to be complete, covering domains according to a\nstandardized pattern, may appear to be out of tune with the\nskeptic’s presumed mode of investigation. Purportedly, skeptics\nthink through given questions as they arise, arriving at suspension of\njudgment in a piecemeal fashion. If this self-description is to be\ntaken at face value, then modes of generating suspension of judgment\nacross the board may appear problematic. In this respect, Diogenes\nLaertius’ report of the Ten Modes may be superior to\nSextus’ account. Diogenes begins with a remark that suggests\nthat skeptics pick up where other philosophers have already begun to\nmake an argument (9.78–9). Other philosophers have collected,\npresumably, ways in which ‘we are persuaded’, say, because\nthings regularly appear the same way. Now the skeptics, as it were in\nresponse to this, add a collection of further cases, where things do\nnot appear the same way to different cognizers. If this is the\ndialectical set-up, the Ten Modes may not be ‘systematic’\nin ways that harm skepticism. They may co-opt the patterns of dogmatic\nreports about cases where appearances are stable (Sedley 2015).\n\n(iv) Language. Aenesidemus contributes an interesting move to the\nquestion of how the skeptic can speak. Consider the relationship\nbetween a skeptic’s state of mind and their utterances. One way\nto construe this relationship is that an utterance reflects a state of\nmind. This is a background assumption to the idea that, if skeptics\nuse assertoric language, they hold beliefs. Another option is to\nassume that language does not have the means to capture the\nskeptic’s state of mind. On this premise, a skeptic might flag\ntheir utterances as falling short of doing so. This is\nAenesidemus’ strategy. He says that the Pyrrhonian determines\nnothing, and not even this fact that he determines nothing. The\nPyrrhonian puts matters in such terms, he says, because he has no way\nto express the actual thought of the sceptic in determining nothing\n(Photius, Bibl. 169b40–170a14, = 71C(6)-(8) LS).\n4.3 Agrippa, and the Five Modes\n\nAlmost nothing is known about Agrippa (1st to\n2nd century CE; SE PH 1.164–177; DL\n9.88–89). However, the modes of argument that Sextus calls the\nFive Modes are attributed to him. These modes are among the most\nfamous arguments of ancient skepticism (Barnes 1990, Hankinson\n2010).\n\n\n5–1 Diaphônia:\n\nThe mode that argues from disagreement. With respect to some matter\nthat presents itself, there is undecided (anepikriton)\nconflict, both among the views of ordinary life and the views held by\nphilosophers. Due to this, we are unable to choose or reject one\nthing, and must fall back on suspension.\n\n5–2 Eis apeiron ekballonta:\n\nArguments that throw one into an infinite regress. That which\nis brought forward to make a given matter credible needs yet something\nelse to make it credible, and so on ad infinitum.\nSince we thus have no starting point for our argument, suspension of\njudgment follows.\n\n5–3 Pros ti:\n\nArguments from relativity. X only ever appears\nsuch-and-such in relation to the subject judging and to the things\nobserved together with it. Suspension on how X really is\nfollows.\n\n5–4 Hypothesis:\n\nSomeone makes an assumption without providing argument. A dogmatist,\nif thrown back into an infinite regress of arguments, just assumes\nsomething as a starting-point, without providing an argument\n(anapodeiktôs). We suspend over mere\nhypotheses—they could be false, opposite hypotheses could be\nformulated, and so on.\n\n5–5 Ton diallêlon:\n\nArguments that disclose a circularity. This mode is used when\nthat which ought to confirm a given investigated matter requires\nconfirmation (pistis—credibility) from that matter. We\nare unable to assume either in order to establish the other. We\nsuspend judgment on both.\n\n\nIt is a commonplace to say that, while the Ten Modes, as presented in\nSextus, are concerned with conflicting appearances, the Five Modes are\nabout argument or proof. In these modes, the skeptics develop\nstrategies by which to attack theories that the dogmatists defend. If\nthis is how we characterize the Modes, Aristotle’s objection\n(section 2.3) immediately comes to mind. Do the Five Modes reveal the\nskeptic’s lack of understanding because they presuppose that\neverything is subject to proof? (Barnes 1990; Hankinson 1995,\n182–92; Long 2006, ch.3) The three so-called formal\nmodes—Regress, Hypothesis, and Circularity—can be\nconstrued in this fashion: when employing them, the skeptic can argue\nthat every premise must be supported by argument; if it is not so\nsupported, the theory begins from a mere hypothesis (on earlier uses\nof the term hupothesis in Plato and in medicine, cf. Cooper\n2002 [2004a]); or it is ultimately circular.\n\nHowever, the skeptic might not be vulnerable to this objection. First,\nthe Five Modes can be construed as dialectical, invoking dogmatic\ntheories of justification (Striker 2004). Second, they might be\nbroader in scope. 5–1 and 5–3\nexplore disagreement and relativity. Skeptical examination often\nbegins with the Mode of Disagreement: different answers to a given\nquestion are surveyed, and the conflict between them is observed. The\ninterpretation of 5–1 hangs, for the most part, on\nthe question of whether anepikriton should be translated as\n‘undecided’ or ‘undecidable’ (Barnes 1990). It\nwould be dogmatic to claim that matters are undecidable. The\nPyrrhonist must prefer the idea that, up to now, matters have not been\ndecided. In applying the Mode of Disagreement, skeptics can\neither record a conflicting argument that others have formulated or\ncome up with an argument that disagrees with a view formulated by a\ndogmatist (cf. Sienkiewicz 2019, 47–51). This leads to the question of\nwhether something can be found that would decide matters, and thus to\nthe application of further modes. Scholars have observed that\n5–3, the Mode of Relativity, does not really fit into\nthe Five Modes. However, the Five Modes could be designed to supersede\nand include the Ten Modes, and 5–3 might be viewed as\ncapturing the common thread of the Ten Modes. With the help of\n5–3, the skeptic can argue that the premises that\ntheorists employ are formulated from particular points of view, in\nparticular contexts, and so on (for a reading that emphasizes the role\nof the first mode at the expense of the role of the third, cf.\nSienkiewicz 2019).\n\nThird, even the so-called formal modes (5-2,\n5–4, 5–5) might not be narrowly\nconcerned with proof, but rather with everything that can lend\ncredibility to something else. Consider Regress\n(5–2), the first of the formal modes. The text does\nnot actually speak of proof (apodeixis) (this is obscured by\nBury’s Loeb translation; 5–4 is the only place\nin Sextus’ report of the Five Modes that uses a cognate of\napodeixis). Sextus’ language is wider: the mode deals\nwith everything that can make something else credible. We might read\nthis in the context of the Hellenistic view that proof is a species of\nsign (PH 2.122). A sign reveals something non-evident. Smoke\nthat reveals fire has, from this point of view, a function and\nstructure that is similar to a proof. The target of the Five Modes\nmight be sign-inferences in general. If this is so, then their target\nmight include what we would call inductive reasoning and causal\nexplanations (when Sextus introduces a further set of modes, the\nCausal Modes, he says that they are not really needed, because the\nrelevant work can be done by the Five Modes; PH\n1.180–86). Taken together, the Five Modes deny all “proof,\ncriterion, sign, cause, movement, learning, coming into being, and\nthat there is anything by nature good or bad.” (DL 9.90). This\nis notably more than just proof. Indeed, it is an excellent summary of\nthe key topics in Sextus’ discussions of logic, physics, and\nethics.\n4.4 Sextus Empiricus\n\nSextus’ (ca. 160–210 CE) epithet, Empiricus, indicates\nthat he belonged to the empiricists, a medical school (cf.\nSvavarson 2014 for a brief conspectus of Sextus’ philosophy).\nThe empiricist medical school argued against rationalistic tendencies\nin medicine (Frede 1990; Allen 2010). Rationalism in medicine aims to\ngive causal explanations as a basis for therapies. Empiricism, on the\ncontrary, confines itself to observation and memory. Somewhat\nconfusingly (considering his name), Sextus discusses differences\nbetween Pyrrhonism and empiricism, and says that skepticism is closer\nto medical methodism than to empiricism (Allen 2010). On the whole, it\nmay be safest to think of Sextus as rejecting medical rationalism as\nwell as other trends within medicine that by Sextus’ lights are\ndogmatic. Methodism follows appearances, and derives from them what\nseems beneficial. No explanations are attempted, no underlying\nsubstances postulated, and no regularities assumed—these are\nsome of the rationalistic methods that both methodism and empiricism\nargue against. Methodism also makes no statements to the effect that\nsuch explanations cannot be given, or that underlying substances and\nregularities do not exist, as Sextus says empiricism does (SE\nPH 1.236–241). Beyond the fact that Sextus was a\ndoctor and wrote on medicine (M 7.202, M 1.61), his philosophical\nthinking seems shaped by engagement with medical writers. Scholars\nhave long been interested in the relationship between medicine and\nskeptical arguments that pertain to be therapeutic (Voelke 1990). More\nrecently, scholars explore ways in which medical writings, in\nparticular by Galen, inform Sextus’ thinking, even on specific\nissues such as how to conceive of and solve sophisms (Schmitt,\nforthcoming). It has also been argued that the skeptics’\napplication of the modes should be interpreted in light of the\nmethodological commitments of non-rationalist medicine (Sienkiewicz\n2019, 2021).\n\nSextus’ philosophical writings are traditionally divided into\ntwo groups. The Outlines of Pyrrhonism [PH] consists\nof three books. PH 1 is the only general account of\nPyrrhonism that survives. PH 2 and 3 discuss questions of\nlogic, physics, and ethics. The other writings are summarily referred\nto, traditionally, as Against the Mathematicians\n[M]. In fact, they oppose not just mathematical, but also\nother theorists: the title really means Against the\nTheoreticians, or Against the Learned (Bett 2012). In a\nsense, only M 1–6 should go by that title. It is a\ncomplete work, and M 7 does not seem to be its continuation\n(Bett 2012, “Introduction”). M 1–6 discuss\ngrammar, rhetoric, geometry, arithmetic, astrology, and music theory.\nThey argue against theoretical ‘learning’ in these fields.\nM 7–11 discuss core questions of the three\nphilosophical disciplines, logic, physics, and ethics, and could\nplausibly be referred to as Against the Logicians (M\n7–8), Against the Physicists (M 9–10),\nand Against the Ethicists (M 11). Scholars disagree\non whether M is earlier (Bett 1997) or later than PH\n(Janacek 1948 and 1972). Scholars also disagree on whether we can\nevaluate different strands of skepticism within Sextus as more or less\nsophisticated. Those who consider PH as later often do so\nbecause they think it shows greater philosophical sophistication,\neither by avoiding claims that a certain matter cannot be known\n(sometimes described as negative dogmatism), as found in M\n1–6 and M 11, or by streamlining discussions from\nM 7–10 (Bett 1997; Brunschwig 1980).\n\nThese questions are complicated further by Sextus’ attempt to\nincorporate diverse material, such as different sets of Modes, into\nhis skepticism. According to recent interpretations, the\ndifferent sets of modes are part of an integrated philosophical\napproach (Powers 2010). Morison (2018) argues that the Ten Modes and\nFive Modes both serve the same purpose: to produce equal and opposing\narguments to arguments in support of philosophical or scientific\nviews. Arguably, two kinds of consistency are at work in Sextus’\nwritings. On the one hand, Sextus aims at the consistency of one\nphilosophical outlook. On the other hand, he aims at the consistency\nof having a response to every objection. These two aims overlap\ngreatly, but they can also come apart. A given argument might refute a\nparticular critic. This argument may go back to various earlier\nversions of Pyrrhonism. Similarly, the critical objection that is\nrefuted may be traced to dogmatic theories formulated over the course\nof several centuries. As a result, a given argument in Sextus may be\neffective against a given objection he has in mind. It may thus\npreserve consistency in the sense of leaving the skeptic unharmed by\ndogmatic criticism. But at the same time, this argument may have\nimplications that are in tension with the way in which Sextus explains\nskepticism in other passages. Such tensions are particularly important\nwith respect to the way in which Sextus uses core concepts. For\nexample, it is not clear that Sextus uses the notion of appearances\n(phainomena) in a consistent fashion (PH\n1.8–9; 1.15; 1.22; for the view that Sextus employs the notion\nconsistently throughout, see Barney 1992). At times, he draws on the\ncontrast between appearances and thoughts (noumena). But for\nthe most part, the term refers to all cases where something seems\nso-and-so to the skeptic, either perceptually or in thought. In some\ncontexts, Sextus draws on the idea that appearances are impressions,\ninvoking the dogmatic assumption that impressions are passive. In\nother contexts, he does not envisage appearances as entirely passively\nexperienced (Vogt 2012b).\n\nIt is thus no surprise that the interpretation of Sextus’\nPyrrhonism is quite controversial. This applies in particular to the\nquestion of whether the skeptic has any beliefs, or beliefs of any\nkind. In the past 40 years, scholars have paid attention to this\nquestion more than to any other interpretive issue. Insofar as the\ntexts may contain different strands of Pyrrhonian argument, exegesis\nis to some extent shaped by the philosophical interests we bring to\nthe texts. Two ideas are particularly prominent here. First, some\nscholars find in Sextus an account of action that challenges standard\nancient and modern theories of agency. These theories might portray\nordinary agents as all-too-rational, as if every action involved an\nactively formed belief that such-and-such is good. Scholars explore\nhow far we can draw on Sextus, asking whether a life guided by\nappearances (as Sextus says the skeptic’s life is) might after\nall be rather ordinary (Frede 1979 [1997]). Second, one might on the\nother hand embrace those aspects of Sextus’ texts that make\nPyrrhonism look radically different from ordinary life. From this\nperspective, Sextus’ writings invite reflection on the question\nof whether it would be possible to live without belief (Burnyeat 1980\n[1997]; Barnes 1982 [1997]; Burnyeat 1984 [1997]).\n\nPH 1, which figures most prominently in scholarly\ndiscussions, is a tour de force. Sextus gives a general\naccount of what skepticism is, including skeptical investigation,\nsuspension of judgment, the skeptic’s end, action, and language;\nhe gives lists and illustrations of various sets of Modes; he explains\nthe so-called skeptical formulae (phônai), such as\n“I determine nothing,” “non-assertion,”\n“maybe,” and so on; and he compares skepticism to\nrelevantly similar philosophies.\n\nSextus emphasizes that the skeptic is an investigator. Others either\narrive at theories (dogmatism) or at claims about inapprehensibility\n(negative dogmatism—that the matter investigated is beyond\none’s capacity to decide, and so is unknowable). But the skeptic\ncontinues to investigate (PH 1.1–4). Investigation is\ndescribed as setting appearances and thoughts into opposition\n(PH 1.8) (Morison 2011 offers a reconstruction of skepticism\nthat takes its starting–point from this description), and as the\napplication of the various sets of Modes (PH 1.36–186).\nSkepticism does not have teachings, but it is an approach in\nphilosophy (Smith 2022). Many of the thoughts the skeptics arrive at\nare expressed in the skeptical formulae (PH 1.13–15;\n187–209). The starting–point (archê) of\nskepticism is divergency—anômalia. The\nproto-skeptics are disturbed by the discrepancies they encounter, and\nbegin to investigate (PH 1.12). They hope to gain quietude by settling\nwhat is true and what is false. But then they have a surprising\nexperience. Encountering disagreement where several views appear to be\nof equal weight (isostheneia), they find themselves unable to\ndecide things, give up, and experience tranquility (ataraxia)\n(Striker 1990 [1996]; Nussbaum 1994). The skeptic’s end\n(telos) is tranquility in matters of belief (kata\ndoxan) and moderate affection (metriopatheia) in matters\nthat are forced upon us (PH 1.25–29). That is, skeptics\ncan free themselves from those kinds of turmoil that come with holding\nbeliefs. They cannot free themselves from freezing, thirst, or pain.\nBut they suffer less than others, for they do not add the belief\n(prosdoxazein) that, for example, pain is bad. The skeptic\nmust explain how, without belief (adoxastôs), they can\nbe active. Sextus says that skeptics follow appearances, and that is,\nthat they adhere to the fourfold ways of life (PH\n1.21–24). Nature supplies them with perception and thought;\nnecessary affections compel them (for example, thirst guides them to\ndrink); they go along with traditions and customs; and they can do\ntechnical things by having been instructed in skills. The notion of\nappearances is also central to Sextus’ account of how the\nskeptic can speak. Without making assertions, a skeptic reports\n(apangellein) like a chronicler (historikôs)\nwhat appears to them now (PH 1.4).\n\nI shall discuss the following aspects of Sextus’ skepticism: (i)\ninvestigation and tranquility, (ii) concepts and inference rules,\n(iii) belief, (iv) the formulae, (v) appearances, (vi) language, (vii)\naction, and (viii) the so-called special arguments (that is, arguments\nthat do not explain the nature of Pyrrhonism, but engage with specific\ndogmatic theories in logic, physics, and ethics).\n\n(i) Investigation and tranquility. Investigation must aim at discovery\nof the truth, otherwise it is not genuine investigation. However, a\nskeptic seems to mechanically apply the skeptical Modes, in order to\ngenerate suspension of judgment and tranquility. Scholars disagree on\nwhether the skeptics genuinely aim at the truth (Palmer 2000;\nStriker 2001; Perin 2006; Veres 2020b), while they (also) aim at\ntranquility. Note that this objection, unlike the other problems\ncentral to contemporary engagement with ancient skepticism, was not\nraised in antiquity. If ancient skepticism is approached in the\ncontext of the larger study of ancient philosophy, we might first of\nall note that the skeptics in a sense agree with Socrates, Plato,\nAristotle, Epicurus, and the Stoics. All these philosophers defend, in\nso many formulations, a life of reason, of contemplation, of wisdom,\nor of inquiry as the best or at least a very good human life (on\naffinities between the skeptics’ commitment to inquiry and\nAristotle, cf. Olfert 2015). The objection that skeptical inquiry\nseems insincere, then, may not have come up in antiquity in quite the\nway in which it is discussed today because a commitment to inquiry\nwould be common ground among most philosophers. Further, we might\nobserve that aiming at the truth includes two aims: to accept truths,\nand to avoid falsehoods. The Modes are tailored to keep us from\nassenting to something that could be false. Insofar as the\nskeptic’s effort to avoid falsehoods expresses a valuation for\nthe truth, the skeptic might be a genuine investigator (Vogt 2012a,\nch. 5; Olfert 2014).\n\nA related objection calls into question the actual practice of\nskeptical inquiry. Does Sextus rely on the assumption that, in any\ngiven case of putting several arguments into opposition, these\narguments are equally persuasive for the skeptic? This seems\nunrealistic: at least in some cases, skeptical inquirers are bound to\nbe more strongly attracted to one view than to another. How then do\nthey arrive at suspension of judgment? One skeptical strategy is to\nremind oneself that additional arguments will be formulated in the\nfuture (PH 1.33–34, 89, 96–97; 2.38–41;\n3.233–34). Another strategy is to consider that different\narguments are persuasive to different people (Svararsson 2014).\nRelatedly, skeptics may find themselves in a position comparable to a\nstudent who takes a seminar on freedom and determinism: it is possible\nto be more attracted to one view rather than another, and at the same\ntime be aware that as far as the arguments are concerned, there is\nunresolved disagreement among several views, to the effect that\nneither of the views seems compelling in ways that warrant assent (cf.\nVogt 2012a, ch. 5, on how the skeptical expression “as far as\nthe argument is concerned” bears on this question; for general\ndiscussion of this expression, cf. Brunschwig 1990).\n\n(ii) Concepts and rules of inference. If skeptics do not assent, then\nhow can they understand the terms philosophers use (M\n8.337–332a)? Even more radically, how can they even think\n(PH 2.1–12)? This objection, which Sextus says is\ncontinually raised against the skeptics, proceeds on the assumption\nthat possession of concepts involves the acceptance of assumptions.\nFor example, in order to examine a given theory of proof, the skeptic\nmust have a notion of what proofs are. This involves assumptions: for\nexample, the assumption that a proof contains premises and a\nconclusion. Sextus’ response to this objection invokes the\nEpicurean and Stoic theories of preconceptions. Human beings are not\nborn with reason (Frede 1994, 1996). The acquisition of reason is a\nnature-guided process of concept acquisition. At a given age, children\nhave completed this process. They have become rational, which means\nthat they can perceive and think in a conceptual way. Only now, they\nhave rational impressions to which they can assent. The acquisition of\npreconceptions did not involve assent, simply because the child was\nnot yet rational (Brittain 2005).\n\nSextus invokes dogmatic ideas about the acquisition of reason (or: the\nabilities of conceptual thought) in his response to the Apraxia Charge\n(PH 1.23–4). Skeptics are, first of all, active because\nnature has equipped them with perception and thought (Vogt 1998,\n2010). More generally, the skeptics’ ability to think and\ninvestigate depends on the fact that they have acquired concepts as\npart of growing up. This process did not involve assent, and\naccordingly, Sextus argues that the skeptic’s ability to think\ndoes not violate suspension of judgment (cf. Brunschwig 1988; Vogt\n2012a ch. 6; Grgic 2008; Fine 2011). It is conceivable, though, that\nthe skeptic’s ability to understand involves some knowledge,\nnamely a kind of knowledge that does not entail any belief (Corti\n2009, part III; Corti 2015). This option appears counterintuitive\ngiven today’s premises in epistemology, according to which\nsomeone who knows that p also believes that p. The relevant notion of\nbelief in skeptical discussions, doxa, as well as the\nrelevant ancient notions of knowledge, however, may behave quite\ndifferently (cf. Vogt 2012a and Moss and Schwab 2019 on belief;\nBurnyeat 1980c, Frede 2008 and Schwab 2016 on knowledge). Insofar as\ndoxa is an inherently deficient activity and attitude, and\ninsofar as knowledge is conceived in elevated ways, knowledge without\nbelief is a rather intuitive option within ancient epistemology. If\nunderstanding concepts and arguments involves knowledge that does not\nentail beliefs, the skeptics may be taken to have such knowledge.\nModern critics raise the further question of whether the skeptic must\nendorse logical laws (such as the Principle of Non-Contradiction) and\nrules of inference. In particular, they ask whether a skeptic is\ncommitted to the logical validity of the conditionals they formulate\nwhen arguing against the dogmatists (Sorensen 2004). Sextus records no\nancient version of this complaint, and accordingly no direct\nresponse. Relatedly, one may ask whether Sextus’ method, in\nparticular regarding the Five Modes, is systematic in a way that is in\ntension with suspension of judgment (cf. Sienkiewicz 2021, who defends\nSextus against this charge).\n\n(iii) Belief. Bury, in his Loeb translation, translates\nadoxastôs as “undogmatically,” for example,\nwhen Sextus speaks (PH 1.15) of skeptics as saying that\n“nothing is true.” This translation suggests that Sextus\nbans dogmatism from the skeptic’s life, where this still leaves\nroom for other, non-dogmatic beliefs. But adoxastôs\nmeans non-doxastically or ‘without belief’ (cf. Burnyeat\n1980 [1997]). As noted above, the skeptic’s end is tranquility\nin matters relating to belief—kata doxan. A skeptic\nlives adoxastôs. And even more confusingly, the\nskeptics assent adoxastôs, when they act.\n\nContemporary interest in Pyrrhonian skepticism was much spurred by\nMichael Frede’s paper “The Sceptic’s Beliefs”\n(1979 [1997]). Frede argues that ancient skepticism was traditionally\ndismissed too easily as vulnerable to the Apraxia Charge, the charge\nthat, without belief, the skeptic cannot act. The skeptics seem to be\nconfident that they have replies to this objection. Thus, it seems\nuncharitable not to look closely at these replies. Further, insofar as\nthese replies respond to the charge that without belief one cannot\nact, we should focus on what the skeptics say about the role of belief\nin their lives. Frede cites PH 1.13, and claims that in this\npassage we find a distinction between two kinds of belief:\n\nWhen we say that the skeptic does not dogmatize, we are not using\n‘dogma’ in the more general sense in which some say it is\ndogma to accept anything (for the skeptic does assent to the\nexperiences forced upon him in virtue of this-or-that impression: for\nexample, he would not say, when warmed or cooled, ‘I seem not to\nbe warmed or cooled’). Rather, when we say he does not\ndogmatize, we mean ‘dogma’ in the sense in which some say\nthat dogma is assent to any of the non-evident matters investigated by\nthe sciences. For the Pyrrhonist assents to nothing that is\nnon-evident. (PH 1.13; trans. Burnyeat (1984) [1997] with\nchanges)\n\n\nFollowing Frede, several scholars focus on PH 1.13 when\ndiscussing skeptical belief (with the notable exceptions of Barnes\n1980 [1997] and Barney 1992). They take it to be obvious that, in this\nparagraph, Sextus distinguishes between two kinds of belief, one which\nhe bans from the skeptic’s life, and one which he allows into\nthe skeptic’s life. Barnes (1982 [1997]) employs a distinction\nbetween rustic and urbane skepticism. The rustic skeptic suspends on\nall matters. The urbane skeptic suspends on scientific matters, but\nholds ordinary beliefs. The clause “non-evident matters\ninvestigated in the sciences” in PH 1.13 might be taken\nas a point of reference for the urbane interpretation. However, Barnes\npoints out that this cannot be right. Everything can be considered as\na non-evident matter, even such things as whether honey is sweet.\n\nAgainst Barnes, Frede argues that the relevant distinction must be\ndrawn between two kinds of assent, such that “having a view\ninvolves one kind of assent, whereas taking a position, or making a\nclaim, involves another kind of assent, namely the kind of assent the\nsceptic will withhold” (1984 [1997], 128). Sextus characterizes\nskeptical assent in three ways. He speaks of forced assent (PH\n1.23–24), involuntary assent (PH 1.19), and\nadoxastôs assent (PH 2.102). Frede does not explore the\ndetails of how Sextus uses these notions. The core of his proposal is\nthat Sextus allows for a kind of assent that does not involve a claim\nas to how things are in actual fact.\n\nIn (1979 [1997]), Frede is predominantly concerned with the\nskeptic’s reply to the Apraxia Charge. In (1984 [1997]) his\nfocus is on skeptical pronouncements such as “nothing can be\nknown.” His distinction between two kinds of assent, and\naccordingly two kinds of belief, is explored with respect to such\nsentences. Frede writes that “[t]o be left with the impression\nor thought that p […] does not involve the further thought that\nit is true that p” (133). This is the sense in which, on his\ninterpretation, the skeptic might think “nothing is\nknown.” The thought counts as a belief, but not as a claim that,\nin actual fact, nothing is known by anybody. Contrary to Frede’s\ninterpretation, one might argue that to believe simply is to hold\ntrue, at least according to the notions of belief that the skeptics\ninvoke in discussions with their contemporary critics (Vogt 2012b). It\nis thus not clear that Frede’s distinction is genuinely one\nbetween two kinds of beliefs (Burnyeat 1980 [1997]). Perhaps it is a\ndistinction between two different propositional attitudes, only one of\nwhich is belief. As Striker (2001) points out, there is a danger that\ndebates over this issue become merely terminological. We might thus\ndraw a distinction between two issues. It is one thing to disagree\nwith Frede on what should or should not be called belief, and another\nto dispute whether he identifies and characterizes a phenomenon in the\nskeptic’s mental life. As Frede argues, skeptics find themselves\nwith a rather persistent thought, without having accepted it as true\nin actual fact. This appears to capture a core element of skepticism:\nthe way in which the skeptic thinks such thoughts as “everything\nis inapprehensible.”\n\n(iv) The Skeptical Formulae. PH 1.13, the passage in which\nscholars find a distinction between two kinds of belief, occurs in a\nchapter entitled “Does the Skeptic dogmatize?” One angle\nfrom which we might disagree with Frede is to insist that PH\n1.13 addresses the status of the core thoughts of skeptical\nphilosophy, rather than the question of skeptical belief. Consider the\nrest of the chapter:\n\nNot even in uttering the skeptical formulae about unclear\nmatters—for example, “In no way more,” or “I\ndetermine nothing,” or one of the other formulae which we shall\nlater discuss—do they dogmatize (dogmatizein). For if\nyou dogmatize, then you posit as real the things that you are said to\ndogmatize about; but skeptics posit these formulae not as necessarily\nbeing real. For they suppose that, just as the formula\n“Everything is false” says that it too, along with\neverything else, is false (and similarly for “Nothing is\ntrue”), so also “In no way more” says that it too,\nalong with everything else, is no more so than not so, and hence\ncancels itself along with everything else. And we say the same of the\nother skeptical formulae. Thus, if people who dogmatize posit as real\nthe things they dogmatize about, while skeptics utter their own\nphrases in such a way that they are implicitly cancelled by\nthemselves, then they cannot be said to dogmatize in uttering them.\nBut the main point is this: in uttering these formulae they say what\nappears to themselves and report their own feelings without any belief\n(adoxastôs), affirming nothing about external objects.\n(PH 1.14–15; trans. Annas-Barnes with changes)\n\n\nWhen explaining in PH 1.13 how the skeptic does not\ndogmatize, Sextus may have a particular issue in mind: that some\nskeptical formulae look like doctrines, and have traditionally been\nturned against themselves due to their dogmatic surface-structure. For\nexample, “all things are indeterminate” looks like a\nstraightforward dogmatic statement. There is a long history of\nskeptical attempts to explain the nature of such pronouncements so\nthat they no longer undermine themselves. Sextus arguably mentions\nseveral solutions to this problem (PH 1.13–15 and\n1.187–209; cf. Pellegrin 2010). In PH 1.15, Sextus\nidentifies the following as his main point: the skeptic merely reports\nwhat appears to them. Along these lines, Sextus calls indeterminacy an\naffection of thought (pathos dianoias; PH 1.198), a\nstate that the utterance “all things are indeterminate”\naims to capture. The other solution mentioned in PH\n1.14–15 is somewhat more problematic: the skeptical formulae\ncancel themselves out. That is, one can say them and convey something\nthrough them. But then, once one has made a point, they as it were\nturn back upon themselves and eat themselves up—as fire first\nburns combustible materials and then destroys itself. This idea became\nfamous through another comparison Sextus uses (invoked by Wittgenstein\n1922, 6.54): the skeptical pronouncements are like a ladder that\none climbs up; once one is on top, one can throw the ladder away\n(M 8.481). Scholars disagree on whether Sextus in some sense\nadmits that these statements are self-refuting (McPherran 1987), or\nwhether he defuses their self-refutational structure (Castagnoli 2010,\nIII.14).\n\n(v) Appearances (phainomena). While it is difficult to\nestablish a clear distinction between two kinds of belief in Sextus,\nthere is a comparatively more explicit distinction between two ways of\nengaging with appearances. Sextus says that, while things\nappear X to the skeptic, the skeptic does not affirm that\nthey are X. Questions that are traditionally discussed in\nterms of whether the skeptic has beliefs thus might be addressed in\nterms of whether the way things appear to the skeptic has a\njudgment-component. Arguably, “A appears X to\nme now” can be construed in different ways. Certain examples\n(say, the way in which it makes sense to say both that the moon\nappears small and that it appears large) may suggest that appearance\ncan but need not involve something like a judgment (Barney 1992). Some\nformulations in Sextus seem to insist on a significant difference\nbetween the mental activity of something appearing to a cognizer on\nthe one hand, and on the other hand the mental activity that, on the\nlevel of language, is represented by assertion. This suggests that,\nfor Sextus, A appearing F to me now does not entail\nthat I hold it to be true that A is F (Vogt\n2012b).\n\n(vi) Language. Another approach to the question of whether the skeptic\nhas beliefs looks at skeptical language. Sextus insists that the\nskeptic does not accept or reject any impression, and associates the\nabsence of these mental acts with the fact that the skeptic does not\naffirm or deny anything (e.g., PH 1.4, 7, 10). Arguably, we\ncan infer from Sextus’ account of the skeptic’s utterances\nwhat Sextus wants to say about the skeptic’s mental states and\nacts. That is, the question of language immediately bears on the\nquestion of belief. The report on Pyrrhonian skepticism in Diogenes\nLaertius is particularly instructive in this respect. Contrary to\nscholarly focus on belief in reconstructing skepticism, it barely\nmentions belief. Discussion of the skeptics’ attitudes is almost\nentirely conducted in terms of skeptical language and the skeptical\nformulae (for detailed discussion of the relevant paragraphs, DL\n9.74–7, cf. Corti 2015). If Sextus is read in light of the\nreport in DL IX, PH 1.13 may appear to be more of an isolated\npassage than scholarly debates imply. Sextus too devotes much space to\naccounts of skeptical expressions and language. It may thus be asked\nwhether scholars should reframe discussions, and pay more attention to\nskeptical language then they previously have. As of now, there is one\nmonograph on skeptical language, Corti (2009), and one approach to\nbelief that focuses on language, Vogt (1998). Both scholars pursue\nfurther ideas put forward by Barnes (1982 [1997]), who compares the\nskeptic’s utterances to avowals. The skeptic lays open their\nstate of mind, they announce or record (apangellein) it (Fine\n2003a). In order to do this, the skeptic must misuse language\n(Burnyeat 1984 [1997]). Some strategies to avoid assertion are given\nin the context of the skeptical formulae (“non-assertion,”\n“I determine nothing,” and so on). (i) Skeptical\nexpressions can be used as signs, which reveal a state of mind\n(PH 1.187). (ii) Expressions like “ou\nmallon” (no more) and “ouden mallon”\n(nowise more) can be used indifferently (in the sense of\ninterchangeably) (PH 1.188). (iii) As is the practice in\nordinary language, the skeptic can use expressions elliptically; for\nexample “no more” for “no more this-than-that”\n(PH 1.188). (iv) People often use questions instead of\nassertions and the other way around. Similarly, “no more”\ncan be construed as a question: “Why more this-than-that?”\n(v) The skeptic misuses language and uses it in a loose way\n(PH 1.191).\n\nIn M 1 and M 2, Sextus says that the skeptic goes\nalong with ordinary ways of using language (M 1.172, 193, 206, 218,\n229, 233; M 2.52–3, 58–9). This seems to be a key resource\nin construing skeptical ways of speaking: the skeptic exploits the\nways in which ordinary speakers can diverge from grammatically correct\nspeech, and still be understood. Apart from using their skeptical\nformulae, and apart from conducting philosophical investigations,\nwhich they can do in a dialectical mode, referring to theses,\narguments, and inferences, the skeptic also has to talk in everyday\ncontexts. It is here where we see best how skeptical utterances are\ntailored to reveal a state of mind in which nothing is accepted or\nrejected. Sextus takes great pains to construe his examples of\nskeptical utterances according to the following schema:\n“X appears F to me now.” This will\ngenerally be understood as an elliptical version of “X\nappears to be F to me now.” However, Sextus\nconsistently avoids “to be” (Vogt 1998; for the view that\n“X appears F” avoids reference to external\nobjects, see Everson 1991). The peculiar form of skeptical utterances\nsuggests that Sextus sees a relevant difference between\n“X appears to be F to me now” and\n“X appears F to me now.” The former\nmight imply reference to a state of affairs, and an epistemic usage of\n“to appear” that could be rendered as “It appears to\nme, that p,” or, “I take it that p.” This, however,\nwould be assertoric: the skeptic would state that it appears to them\nthat such-and-such is the case. But the skeptic’s elliptical\nutterances about what appears to them aim to be purely\nphenomenological. They aim to report a condition of the\nskeptic’s mind, without expressing a judgment of any kind\n(Burnyeat 1984 [1997]; Annas-Barnes 1985, 23–4; for an\nassessment of these strategies in terms of modern philosophy of\nlanguage, cf. Pagin 2020). As part of the skeptics’ way of life,\nlanguage can also be seen as an activity. That is, how the skeptics\ncan speak can be considered a sub–question of how the skeptics\ncan act. Skeptical utterances have been compared to Wittgensteinian\nconfessions, arguably a kind of speech act that is consistent with the\nskeptics’ avoidance of belief (Corti 2009, Parts I and II).\nMoreover, the skeptics not only speak. They presumably also understand\nwhat others say. A persuasive account of skeptical language must\nexplain both speaking and understanding (Corti 2009, Part III).\n\n(vii) Action. Sextus says that appearances (phainomena) are\nthe practical criterion of the skeptic (PH 1.23–24). By\nadhering to appearances, the skeptic is prevented from inactivity\n(anenergêsia). Note that Sextus does not describe the\nskeptic as performing actions in the sense of dogmatic theory of\naction, which involves belief and choice (cf. M\n11.162–166). Contrary to the Academic skeptic, a Sextan skeptic\ndoes not view themselves as a rational agent, who chooses one course\nof action over another. Sextus claims an active life for the skeptic,\nbut not the life of a rational agent, as conceived by dogmatic\nphilosophers (Vogt 2010; Schwab 2020). This attitude has been\ncritically discussed for a long time, for example, with respect to its\nethical (Bett 2019) and political upshots (Marchand 2015) and with\nrespect to the skeptics’ relation to the law (Marchand\n2021).\n\nThe skeptic’s forced assent is situated in the domain of action\n(PH 1.13, 19, 29–30, 193, 237–8). Thirst, for\nexample, necessitates assent, and that means, it moves the skeptic to\ndrink. This kind of assent may be genuinely unrelated to\nbelief-formation of any kind. Rather, forced assent generates the\nmovement of action. But what about more complex kinds of activities,\nsuch as applying a medication, or attending a festival? Sextus argues\nthat the skeptic adheres to custom, convention, and tradition, and to\nwhat they have been trained to do. In explaining how adherence to\nappearances in these domains generates activity, Sextus does not\nmention assent. However, he might have to concede that, like drinking\nwhen thirsty, more complex actions also involve some kind of assent.\nIn PH 2.102, Sextus says that the sceptic assents\nnon-doxastically (adoxastôs) to the things relied on in\nordinary life. In PH 1.19, he mentions involuntary assent.\nAccordingly, non-doxastic and involuntary assent may figure in those\ndomains of skeptical action that do not involve necessitation by\nbodily affections. Non-doxastic assent is, from the point of view of\nthe Stoics, a contradiction in terms, just like forced and involuntary\nassent. Assent is defined as in our power, and as that by which\nbeliefs are formed. If Sextus intends skeptical assent to be genuinely\nnon-doxastic and involuntary, then it does not have the core features\nof assent as defined by the dogmatists.\n\n(viii) Logic, Physics, Ethics, and the “disciplines.” The\nspecial arguments of the skeptic are directed against particular\ntheories in the three disciplines of Hellenistic philosophy: logic,\nphysics, and ethics. In addition, they address the so-called\ndisciplines, namely grammar, rhetoric, geometry, arithmetic,\nastrology, and music-theory. Sextus’ treatments of logic divide\nup into two main topics: sign and criterion (cf. Bett 2005 on signs).\nThis structure reflects central concerns of Hellenistic epistemology\nas well as of ancient skepticism. Skepticism looks for a\n‘decider’ between conflicting appearances and thoughts. A\ndecider could be something evident. Dogmatic philosophers associate\nthe evident with the criterion of truth. For something to serve the\nrole of criterion, it cannot be equally disputed as the matters it\nhelps to decide. Or something non-evident could take on the role of\ndecider. For that to be the case, the skeptics argue, it would have to\nbe conclusively revealed by a sign or proof. If there is no compelling\ntheory of the criterion and no compelling account of sign and proof,\nthen there is nothing that can decide between several conflicting\nviews. Sextus’ treatises on logic thus are not simply a\ncollection of individual arguments against various dogmatic theories.\nTheir main line of thought sketches a route into\nskepticism. Along these lines, Vlasits (2020b) argues that\nSextus’ treatment of logic in PH 2 is unified. Sextus’\nargument is structured such as to lead to suspension of judgment on\nthe methodologies of the dogmatists. The final section of M 8 (463–81)\nformulates a challenge for the skeptic that scholars interested in\nself-refutational arguments have examined (Castagnoli 2010): does the\nskeptic aim to prove that proof does not exist (Sienkiewicz\n2022)?\n\nSextus’ discussions of ethics also focus on issues that\nplausibly lead into skepticism. Again, there are two central\nquestions: whether there is anything good and bad by nature; and\nwhether there is an art of life (Bett 2010, 2011 and 2019),\nas the Epicureans and Stoics claim there is. If we could settle what\nis good and what is bad, some of the most disturbing anomalies would\nbe resolved. If there were an art of life, there would be a teachable\nbody of knowledge about the good and the bad. In both cases, questions\nthat can cause a great deal of puzzlement would be resolved.\nSextus’ discussions of ethics are in part famous because Sextus\nascribes outlandish and shocking views to the Stoics. As Sextus\nconstrues his arguments, the contrast between ‘ordinary\nlife’ and philosophical views leads to suspension of judgment\n(Vogt 2008a, ch. 1). In the modern tradition, a number of philosophers\nincluding Hegel and Nietzsche have engaged with aspects of\nSextus’ outlook and in particular with the skeptical adherence\nto ordinary life (Berry 2010 and 2020; Bett 2020a). Recently,\nscholars have asked how ethical a skeptic can be, to use a phrased\nemployed by Bett (2019), given that it may seem that suspension of\njudgment on grave ethical challenges can seem facile. At the same\ntime, scholars point out that some dimensions of ethical frameworks\nwent unquestioned a long time, for example, with respect to gender;\nhere suspension of judgment may appear innovative (Olfert\nforthcoming).\n\nThe books on physics discuss god, cause, matter, bodies, mixture,\nmotion, increase and decrease, subtraction and addition, whole and\npart, change, becoming and perishing, rest, place, time, and number.\nNotably, god is one of the topics explored in physics. This stands in\nstark contrast to medieval and early modern discussions, where the\nquest for knowledge of God often frames and motivates engagement with\nskepticism. In PH 3, Sextus prefaces his discussion of arguments\nfor and against the existence of gods by saying that the\nskeptics’ ordinary life without opinions\n(adoxastôs) includes the following: the skeptics say\nthat there are gods, are pious toward the gods, and say that the gods\nare provident. Scholars discuss how this relates to Sextus’\ndiscussions of theology qua topic in physics on the one hand (PH\n3.2–12, M 9.11–194), and to his portrayal of the skeptics’\nordinary life in PH 1 on the other hand (Annas 2011, Veres 2020a). The\nskeptics come to suspend judgment on all central questions in ancient\nphysics (Bett 2012). This means, they come to suspend judgment on\nwhether, for example, there are causes, time, place, and bodies (cf.\nBobzien 2015 and Warren 2015). Their suspension does not merely mean\nthat they have not yet found a satisfying theory of, say, body. It\nmeans that they find themselves unable to say whether there is body\n(Burnyeat 1997). (On the cumulative force of these arguments, see\nsection 5.4.)\n\nThe six books entitled Against those in the Disciplines\n(M 1–6) have traditionally received less attention.\nOnly in the last few years have scholars begun to explore them with\nthe kind of philosophical subtlety that has been brought to bear in\nthe study of ancient skepticism in recent decades. M\n1–6 skeptically examine six fields of study, namely grammar,\nrhetoric, geometry, arithmetic, astronomy, and music-theory. Sextus\nbegins with an astonishing move. Contrary to his usual strategy of\nemphasizing the distance between skeptics and dogmatists, he admits\nthat Pyrrhonians and Epicureans share much in viewing standard\ndisciplines as useless (M 1.1–7; cf. Thorsrud 2019).\nGenerally speaking, increased attention to M 1–6 may\nprovide additional occasion to modify the long-standing assumption\nthat the Stoics are Sextus’ most important dogmatic\ninterlocutors. Throughout M 1–6, resonances between\nEpicurean and Pyrrhonian philosophy are remarkably visible (Bett 2018,\n“Introduction”). Engagement with Epicurean philosophy\nshapes Sextus’ approach deeply, to the extent that both schools,\nStoics and Epicureans, should be considered fundamental points of\nreference.\n\nAfter his remarks on how Pyrrhonians and Epicureans take issue with\nthe presumed usefulness of the disciplines, Sextus lays out general\narguments, suitable for skeptical examination of any field. He argues\nthat, for there to be a discipline, there must be the matter being\ntaught, the teacher, the learner, and the means of learning. If,\nhowever, neither of these things exists, then the discipline\ndoesn’t exist. This is how Sextus proceeds. He argues, or seems\nto argue, for the non-existence of the disciplines (M 1.9).\nAlready in the very first sentence of M 1, Sextus describes\nhis own approach as one of putting forward counterarguments, a\nstrategy that he mentions repeatedly throughout M\n1–6.\n\nThese moves give rise to the most contentious question regarding\nM 1–6. Are these books negatively dogmatic? Or do they\nfit in with Sextus’s outlook in PH 1–3, where\nskeptical arguments are described as leading up to suspension of\njudgment? Bett (2018, “Introduction”) argues that, with\nsome qualifications, Sextus’ approach is to be explained as\nfollows. Sextus lays out counterarguments based on the assumption that\nthe arguments of the dogmatists have already been formulated. For\nthere to be arguments of equal weight on both sides, only the\nanti-dogmatic arguments need to be adduced. The intended effect is\nthat jointly, these opposing sets of arguments lead us to suspend\njudgment. In addition, Bett notes that the remarkable emphasis on\ncounterarguments, non-existence, and uselessness suggests that some of\nthe material in M 1–6 goes back to an earlier phase of\nPyrrhonism.\n\nIn four of the six fields, namely grammar, rhetoric, music, and\nastrology, Sextus admits non-technical versions into the\nskeptic’s life, while subjecting all theoretical claims to\nskeptical examination. For example, he distinguishes between the\nordinary ability to read and write on the one hand and grammar as a\ntechnical discipline on the other, or the ability to play a musical\ninstrument on the one hand and music theory on the other (cf. Corti\n2015b on why this kind of contrast does not come up in the books on\narithmetic and geometry, Corti 2015c on Sextus’ attack on\nthe Platonic-Pythagorean notion of the Two, and Corti\nforthcoming).\n\nIt is remarkable that, qua theoretical field, Sextus examines\nastrology rather than astronomy. The latter would make for a more\ntypical sequence: apart from the fact that in Sextus, logic is\nconsidered part of philosophy rather than a “discipline,”\nthe six fields otherwise correspond to the so-called trivium of\ngrammar, logic, and rhetoric and quadrivium of arithmetic, geometry,\nastronomy, and music theory. Sextus’ attention to astrology\nrather than astronomy highlights a deep feature of his philosophy\n(Corti 2015, Bett 2018). Astronomy, from Sextus’ point of view,\nis concerned with appearances; and hence there is a sense in which the\nskeptic does not object to it. Astronomy, then, is the\n“version” of astrology that skeptics can admit into their\nadherence to ordinary life (M 5.1–3). Presumably,\nastronomy is concerned with predicting things like droughts, floods,\nearthquakes, and plagues based on appearances. Astrology, on the other\nhand, is concerned with matters of great obscurity.\n5. Ancient and Modern Skepticism: Transitions\n5.1 Augustine: Re-Conceiving Skepticism in a Theological Framework\n\nHistorians of philosophy sometimes argue that Henri Etienne’s\nrediscovery of Sextus in 1562 initiated an era of epistemology. Early\nmodern engagement with skepticism is here seen as a turn to arguments\nfound in Sextus (Annas-Barnes 1985, 5–7; Bailey 2002,\n1–20). Via Cicero, early modern and modern philosophers seem to\nhave engaged also with Academic arguments (for a recent analysis of\nAcademic skepticism in Hume and Kant, cf. González Quintero\n2022). In particular the beginning of Descartes’\nMeditations may display a kind of Socratic spirit: a\ncommitment to calling into question all one’s beliefs. However,\nearly modern philosophers work within a theologically framed tradition\nthat importantly begins with St. Augustine (354–430) (cf. Menn\n1998 and Lagerlund 2009; on the history of medieval skepticism cf.\nLagerlund ed. 2009; cf. Carriero 2009 on Descartes’ engagement\nwith Aquinas; for an analysis of the transformation of skepticism that\nturns immediately to Descartes, cf. Williams 2010).\n\nA major part of Augustine’s early education consisted in the\nstudy of Cicero’s writings. He was thus closely acquainted with\nAcademic skepticism (Cicero was one kind of Academic skeptic).\nAugustine sees the force of ancient skeptical strategies. Even though\nhe does not become a skeptic, he integrates distinctively skeptical\nmoves into his thought. This has a long-standing effect on the history\nof theology and science. For example, Galileo Galilei is able to cite\nAugustine when he defends himself against the charge that his physics\nis in opposition to the Bible (Letter to the Grand Duchess,\nin Drake 1957). Augustine supplies arguments to the effect that we\nshould keep an open mind. Both our physical theories and our\ninterpretations of the Bible are likely to evolve. This idea figures\nimportantly in Pyrrhonism. Past experience tells us that, on every\ngiven issue, someone eventually came up with a new argument.\nAccordingly, even if the skeptics cannot find an objection to a given\nclaim right now, they expect that in the future, a conflicting view\nwill be formulated.\n\nHowever, such traces of skepticism are integrated into an ultimately\nnon-skeptical philosophy. In Contra Academicos, Augustine\nrecognizes a core feature of ancient skepticism, namely that it is a\ncommitment to ongoing inquiry (cf. Nawar 2019 on Augustine’s\ndefense of knowledge against the skeptics in Contra\nAcademicos 3). The question that Augustine considers vital, then,\nis whether a life devoted to inquiry can be compelling, if seemingly\nthere is no prospect for ever attaining truth (cf. Lagerlund 2009). It\nis as a philosophy of inquiry that skepticism makes a lasting\ncontribution to ethics, continuing, as it were, a Socratic legacy\n(Vogt 2017).\n\nAugustine creates the framework that will become characteristic of\nearly modern discussions. First, in his work skeptical arguments are\nexplored in order to be refuted. Second, the key issue is whether we\nhave knowledge, not whether we should hold anything to be true. In\nAugustine, the background for caring so much about knowledge is the\npressing question of whether we can know God: whether we can know that\nhe exists and what his properties are. This might also be the reason\nwhy knowledge of testimony gains importance (De Trinitate,\n15.12; in Schoedinger 1996). The Bible, or parts of it, might be\nconsidered testimony about God, and accordingly as one possible way of\nattaining knowledge of God.\n\nThird, in the process of asking whether we can have knowledge of God\nit makes sense to distinguish between kinds of knowledge (sensory,\nrational, by testimony, etc.). If we know God, then we do so via one\nof the kinds of knowledge. This becomes a standard feature of\ndiscussions of skepticism. Philosophers go through the different kinds\nof knowledge that are conceivable, and examine them in turn. In\nAugustine as well as later authors, this includes mathematical\nknowledge (Nawar 2022). Though Sextus wrote on geometry and\narithmetic, questions about knowledge in mathematics do not shape\nHellenistic debates between skeptics on the one hand and Epicureans\nand Stoics on the other hand. Fourth, Augustine conceives of what he\ncalls ‘inner knowledge.’ He envisages a skeptical\nscenario. Suppose we have no sensory knowledge, no rational knowledge,\nand no knowledge of testimony. We still know that we think, love,\njudge, live, and are (De Trinitate 15.12). In the City of\nGod 11.26, Augustine uses his well-known phrase “si\nenim fallor, sum” (even if I err, I am). That is, Augustine\nsuggests that we have knowledge of our mental acts (cf. Nawar 2022 on\nAugustine’s concern with self-knowledge). However, Augustine\ndoes not consider these pieces of knowledge foundational. While he\npoints to them when he discusses the challenges of Academic\nskepticism, he does not systematically build upon them in refuting\nskepticism about sense perception, rational knowledge, and knowledge\nof testimony. Rather, he refutes skepticism by stating that God\ncreated us and the things that are known to us; God wanted these\nthings to be known to us (De Trinitate 15.12). In later\nepistemology, the idea of the turn into one’s mind and an\nintrospective access to one’s mental acts becomes a secular\nidea. Augustine is a transitional figure in the philosophy of mind,\nand thereby re-conceives skepticism. By focussing on a gap between\n‘what is in the mind’ and the world outside, he as it were\ninvites external world skepticism (Vogt 2014a). But Augustine is\nconcerned with the path to God: the mind turns into itself and\nfrom there it moves further, toward God (e.g., Confessions 7.\n17,23).\n\nNext to Augustine, Al-Ghazali (1085-1111) plays a major role in\nre-conceiving the questions relevant to skepticism (Menn 2003,\nKukkonen 2009). In The Rescuer From Error, Al-Ghazali\nliterally describes God as the rescuer from error (in Khalidi 2005).\nLike Augustine before and Descartes after him, Al-Ghazali moves\nthrough different cognitive faculties. Do the senses or reason allow\nus to gain knowledge? These questions are framed by the quest for\nknowledge of God. While Augustine thinks that knowledge of God comes\nthrough a combination of seeking God on the one hand and God’s\ngrace on the other, Al-Ghazali thinks it comes through spiritual\nexercises. However, once confidence in God is secured, trust in the\nmore familiar ways of gaining knowledge—sense perception,\nrational reasoning, and so on—is restored (for a detailed\ntreatment of skepticism in Classical Islam, cf. Heck 2014).\n\nOne key difference between ancient skepticism on the one hand, and\nmedieval as well as Cartesian skepticism on the other, is that ancient\nskepticism is not framed by theological concerns. Note that in\nCartesian skepticism, God is not only invoked when it comes to\nrefuting skepticism. More importantly, the skeptical problems arise in\na way that depends on God as creator. Our cognitive faculties are seen\nas created faculties, and the world as a created world. A kind of\n‘faculty-skepticism’ that asks whether our cognitive\nfaculties are built so as to be erroneous is formulated, and a\npotential gap between our minds and the world opens up. Perhaps God\nmade us in such a way that we are fundamentally wrong about everything\n(or, as later secular versions have it, a mad scientist experiments on\na “brain in a vat”).\n\nThese are important steps away from the non-theological ancient\nconstrual of skepticism. The theological premises of early modern\nskepticism are not only foreign to ancient debates; they would be seen\nas misguided. From the Hellenistic point of view, theology is part of\nphysics. An account of god is part of an account of the natural world\n(as such, it is unrecognizable as ‘theology’ from the\npoint of view of later theologies). Human beings and their cognitive\nfaculties are natural parts of a natural world. They are organic and\nfunctional parts, interconnected with the other parts of the large\nwhole which the universe is. A mind-world-gap (of the kind envisaged\nin the Cartesian tradition) is inconceivable. Each ‘mind,’\nand that is, rational soul, is an integrated physical part of the\nphysical world. Like a part of a complex organism, it would not exist\nwere it not for the interrelations it has with the other parts. A\nphysiological account of the mind makes the stark divide between mind\nand world that figures in early modern skepticism unimaginable.\n5.2 Skepticism About Induction\n\nContemporary discussions inherit long-standing problems from early\nmodern philosophy. Among them, external world skepticism, skepticism\nabout other minds, and skepticism about induction are particularly\nprominent. In assessing ancient skepticism, we might ask whether the\nancients saw these problems.\n\nAmong the skeptical problems of modern philosophy, skepticism about\ninduction stands out. Its early formulation in Hume does not depend on\nthe idea that our faculties are created by God, who also created the\nworld. Hume takes himself to engage with Pyrrhonian skepticism\n(Ainslie 2003). Induction proceeds from particular observations to a\ngeneral conclusion. Skepticism about induction points out that, no\nmatter how many particulars were observed, the general claim\npronounces also on what has not been observed. In this respect, the\ninference seems unwarranted and so we should suspend judgement on its\neffectiveness. Induction can concern the ascription of properties to\nsome kind of entity as well as causal claims. In the latter, the\nskeptic observes that what regularly precedes a type of event may not\nbe its cause. Perhaps we cannot infer anything from the fact that\ncertain properties or events regularly occur together (Vlasits 2020a;\nfor a related argument in Al-Ghazali, cf. Kukkonen 2009).\n\nRelevant ideas can be traced in various aspects of Sextus’\nphilosophy. First, Sextus sides with anti-rationalist tendencies in\nmedicine. According to these schools, a doctor remembers that, in\nearlier cases, symptom A was alleviated by medication\nB. They do not infer that medication B makes symptom\nA disappear, or that the illness C is the cause of\nsymptom A. Second, the Five Modes do not exclusively target\nproof. They address everything that lends credibility to something\nelse. They may thus also call into question signs that are taken as\nindicative of their causes. Sextus’ skeptic does not accept such\nindicative signs. Third, Sextus discusses the role of so-called\ncommemorative signs in the skeptic’s life (PH\n2.100–102; Allen 2001). For example, a scar is a commemorative\nsign of a wound. Both were co-observed in the past. A skeptic will\nthink of a wound when seeing a scar. But they do not commit to causal\nor explanatory claims. Fourth, Sextus records a set of Causal Modes\n(PH 1.180–86), which are specifically targeted toward\ncausal explanations (Corti 2014; on the relation between the Causal\nModes and Hume cf. Garrett 2020). He does not ascribe the kind of\nrelevance to them that the Ten Modes and the Five Modes have. Indeed,\nhe thinks the Five Modes can do the work of Causal Modes (that is,\ncall into question causal and explanatory theses and theories).\nHowever, the Causal Modes go into great detail on how the skeptic\ninvestigates any kind of causal thesis or theory.\n5.3 Subjectivity and Other Minds\n\nThe distinction between subjectivity and objectivity is central to\nmodern discussions of skepticism. It is not envisaged in ancient\nthought. However, this does not mean that ancient philosophers do not\nreflect on questions relevant to this distinction. Arguably,\nPyrrhonism conceives of the affections of the mind in ways that\nanticipate later thought about subjectivity (Fine 2003a and 2003b).\nSextus describes the skeptic’s states of\n‘being-appeared-to’ as affections of the mind. A skeptic\ncan report these states in their utterances. Illustrating this point,\nSextus uses expressions associated with the Cyrenaics, a Socratic\nschool of thought. These expressions literally mean something like\n‘I am being heated’ or ‘I am being whitened.’\nThey aim to record affections without claiming anything about the\nworld. Fine argues that the skeptic’s beliefs are beliefs about\nthese affections (2000). With this proposal, Fine turns against two\nprominent positions in scholarly debate about skeptical belief (see\nsection 4.4), that skeptics have no beliefs whatsoever, and that they\nhave beliefs that fall short of holding true. Fine envisages\nreflective beliefs: beliefs about one’s states of mind (on\nrelated issues in contemporary epistemology, cf. Feeney and\nSchellenberg 2020 and Glüer 2020).\n\nWhether or not Sextus’ account of the skeptic’s mental\nlife includes reflective beliefs about one’s mental states, we\nshould note an important difference to later proposals of that kind.\nLater philosophers focus on the particular kind of certainty attached\nto reflective knowledge. Reflective knowledge is sometimes seen as a\nstepping-stone towards greater confidence in our cognitive powers, and\nour ability to also attain other kinds of knowledge. But it may not be\nobvious that reflective knowledge can take on this important role. In\nthis respect, Augustine is still closer to ancient than to modern\nintuitions. He says that such pieces of knowledge as “I know\nthat I think” are not what we are looking for. Augustine\nenvisages that reflective knowledge-claims can be iterated, so that we\nwould have infinitely many pieces of knowledge (“I know that I\nknow that I think…”). But from his point of view, this\nkind of knowledge leads nowhere. When we ask whether we can have\nknowledge, we are interested in knowledge of the world and of God\n(De Trinitate 15.12).\n\nModern philosophers also pay great attention to the privileged access\ncognizers have to their own cognitive activities. Augustine introduces\na distinction that paves the way for this idea. He argues that the\nmind cannot know what kind of stuff it is (De Trinitate 10.10\nand 15.12). The mind does not know its substance, but it knows its\nactivities. For Augustine, this means that the mind knows itself. The\nmind is precisely what it knows itself to be: in knowing that one\nthinks, judges, lives, and so on, one knows the mind (Vogt 2014a).\nNote that this argument indicates that knowing that one lives and is\nare not pieces of knowledge about one’s bodily existence, but\nabout the activities of the mind.\n\nFinally, modern philosophers conceive of the special kind of access to\none’s own mind not only in contrast with our access to the\nworld. They also compare it to our access to what goes on in other\nminds. One of their core problems is skepticism about other minds. If\nour own minds are accessible to us in the way nothing else is, then we\nmight not be able to ascribe mental states to others. For example, we\nmight not know that someone who looks as if she is in pain really is\nin pain. The ancient skeptics envisage nothing of this kind (Warren\n2011). This suggests that, insofar as they draw a distinction between\naffections of the mind and the world, this distinction is construed\ndifferently than in modern skepticism.\n5.4 External World Skepticism\n\nIn its early modern versions, external world skepticism involves the\nidea that there is a creator—someone who made the world and our\nfaculties, and the fit or misfit between them. If this assumption is\ncrucial to external world skepticism, then the ancients do not\nconceive of this skeptical problem. From the point of view of modern\nphilosophy, ancient skepticism may appear limited by not addressing\nsome of the most radical skeptical scenarios (Burnyeat 1980 [1997] and\n1982; Williams 1988; Fine 2003a and 2003b). From the point of view of\nancient skepticism, early modern skepticism and the long life that its\nproblems enjoy, however, would seem to originate in a flawed\ntheology.\n\nContemporary philosophers sometimes discuss external world skepticism\nin terms of a paradox: one thinker finds herself torn between the\nstrength of skeptical arguments and her ordinary convictions. For\nexample, she thinks that this is her hand. But she concedes\nthat the skeptical hypothesis that a mad scientist might have set\nthings up so that she has such perceptions and thoughts (the so-called\nbrain in a vat scenario) is hard to refute. This way of framing\ndiscussions of skepticism is foreign to antiquity. In antiquity,\nskeptics and their opponents are different thinkers, each of them with\none set of intuitions, arguing against each other. It is also foreign\nto ancient skepticism insofar as it inherits the early modern idea\nthat some greatly powerful agent sets things up, and in a sense\ncreates the thinker’s faculties and the world as it appears to\nthem.\n\nHowever, the ancient skeptics might conceive of their own kind of\nexternal world skepticism. One way to explore this question is to turn\nto the way in which Sextus describes that which is outside of the\nskeptic’s mind (Fine 2003 and 2003(2)). Throughout his work,\nSextus employs the distinction between appearances and what really is\nthe case. Consider some of the detail of how he characterizes the\nlatter. One phrase in the Ten Modes is “ta ektos\nhupokeimena,” the externally underlying things\n(PH 1.61, 127, 128, 134, 144). Other phrases, meant to\ndemarcate roughly the same contrast with appearances, are how things\nare in their nature (phusei) (PH 1.78, 123, 140),\n“the underlying things” (hupokeimena)\n(PH 1.106), as well as a combination: “the nature of\nthe underlying external things” (PH 1.117, 163). The\nexpressions which contain the word “external” might read\nas if Sextus was talking about the external world in a sense familiar\nto us from early modern skepticism.\n\nBut what are the underlying or external objects, as Sextus conceives\nof them? For example, Sextus speaks of the underlying reality of\nwhether honey really is sweet (PH 1.19). In such a case, it\nis assumed that there are ordinary objects. But we do not have access\nto the properties they really have (Fine calls this Property\nSkepticism, 2003b). However, external objects in Sextus’ sense\nalso include objects that later philosophers would not obviously see\nas part of the external word. For example, an answer to the question\nof what kind of life really is good would count as a claim about\nexternal or underlying reality (cf. Pellegrin 2010).\n\nAnother approach to the question of whether Sextus envisages some kind\nof external world skepticism is to turn to his discussions of physics.\nOrdinarily we take ourselves to live in a world in which there are\nbodies, movement, place, time, and so on. But as Sextus argues, we do\nnot have compelling accounts of any of these core conceptions of\nphysics. This leads to suspension of judgment on whether there are\nbodies, movement, place, time, and so on. Sextus’ discussions of\nphysics might add up to a rather far-reaching skepticism about the\nnatural world.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSou\">Primary Sources</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Annas, J. and J. Barnes (ed. and trans.), 2000, <em>Sextus\nEmpiricus, Outlines of Scepticism</em>, Cambridge: Cambridge\nUniversity Press, 2<sup>nd</sup> edition.",
                "Bett, R. (ed. and trans. with commentary), 1997, <em>Sextus\nEmpiricus: Against the Ethicists</em> (Adversus Mathematicos XI),\nOxford: Oxford University Press.",
                "Bett, R. (ed. and trans. with commentary), 2005, <em>Sextus\nEmpiricus: Against the Logicians</em>, Cambridge: Cambridge University\nPress.",
                "Bett, R. (ed. and trans. with commentary), 2012, <em>Sextus\nEmpiricus: Against the Physicists</em>, Cambridge: Cambridge\nUniversity Press.",
                "Bett, R. (trans. with an introduction and notes), 2018, <em>Sextus\nEmpiricus: Against Those in the Disciplines</em>, Oxford: Oxford\nUniversity Press.",
                "Bettenson, H. (trans.), 2003, <em>Augustine: City of God</em>,\nLondon: Penguin.",
                "Blank, D.L. (ed. and trans. with commentary), 1998, <em>Sextus\nEmpiricus: Against the Grammarians</em> (Adversus Mathematicos I),\nOxford: Oxford University Press.",
                "Brittain, C. (trans. with introduction), 2006, <em>Cicero: On\nAcademic Scepticism</em>, Indianapolis and Cambridge, MA:\nHackett.",
                "Bury, R.G. (trans.), 1933–49, <em>Sextus Empiricus</em>\n(Loeb Classical Library), 4 volumes, Cambridge, MA: Harvard University\nPress.",
                "Chadwick, H. (trans.), 1991, <em>Augustine: Confessions</em>,\nOxford: Oxford University Press.",
                "Corti, L. (trans. with introduction and commentary)\n(forthcoming), <em>Sextus Empiricus: Against the\nArithmeticians</em>,  Leiden: Brill.",
                "Decleva Caizzi, F. (trans. and commentary), 1981, <em>Pirrone:\nTestimonianze</em>, Naples: Bibliopolis.",
                "Diels, H. and W. Kranz (eds.), 1996, <em>Die Fragmente der\nVorsokratiker</em>, 3 volumes., reprint of sixth edition (Berlin\n1996), Berlin: Weidmann [= <strong>DK</strong>].",
                "Drake, S. (trans.), 1957, <em>Discoveries and Opinions of\nGalileo</em>, New York: Doubleday.",
                "Hicks, R. (ed. and trans.), 1991, <em>Diogenes Laertius: Lives of\nEminent Philosophers</em> (Loeb Classical Library), 2 volumes,\nCambridge MA: Harvard University Press, reprint of second edition [=\n<strong>DL</strong>].",
                "Hume, D., 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London; reprinted in <em>Enquiries Concerning the\nHuman Understanding and Concerning the Principles of Morals</em>, L.\nA. Selby-Bigge (ed.), revised P. H. Nidditch, Oxford: Oxford\nUniversity Press, 1975.",
                "Khalidi, M.A., K. Ameriks, and D. Clarke (eds.), 2005,\n<em>Medieval Islamic Philosophical Writings</em>, Cambridge: Cambridge\nUniversity Press.",
                "Long, A. A., and D.N. Sedley (eds. and trans.), 1987, <em>The\nHellenistic Philosophers</em>, translation and philosophical\ncommentary in vol 1, Greek and Latin texts, and philological\ncommentary in vol. 2, Cambridge: Cambridge University Press [=\n<strong>LS</strong>].",
                "Mates, B., (trans. and commentary), 1996, <em>The Skeptic Way:\nSextus Empiricus’ Outlines of Pyrrhonism</em>, New York: Oxford\nUniversity Press.",
                "Schoedinger, A. B. (ed. and trans.), 1996, <em>Readings in\nMedieval Philosophy</em> , New York: Oxford University Press.",
                "Vogt, K. (ed.) (co-trans. and co-commentator), 2015,\n<em>Pyrrhonian Skepticism in Diogenes Laertius</em> (SAPERE: Volume\n25), Tübingen: Mohr Siebeck.",
                "Wittgenstein, L., 1922, <em>Tractatus Logico-Philosophicus</em>,\nC. K. Ogden (trans.), London: Routledge &amp; Kegan Paul.\n</ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Ainslie, D. C., 2003, “Hume’s Scepticism and Ancient\nScepticisms,” in <em>Hellenistic and Early Modern\nPhilosophy</em>, J. Miller and B. Inwood (eds.), Cambridge: Cambridge\nUniversity Press, pp. 251–73.",
                "Algra, K, J. Barnes, J. Mansfeld, and M. Schofield (eds.), 1999,\n<em>The Cambridge History of Hellenistic Philosophy</em>, Cambridge:\nCambridge University Press.",
                "Alesse, F., 1999, <em>La Stoa e la Tradizione Socratica</em>,\nNapoli: Bibliopolis.",
                "Allen, J., 1994, “Academic probabilism and Stoic\nepistemology,” <em>Classical Quarterly</em>, 44:\n85–113.",
                "–––, 2001, <em>Inference From Signs: Ancient\nDebates About the Nature of Evidence</em>, Oxford: Oxford University\nPress.",
                "–––, 2004, “Carneades,” <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2004 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2004/entries/carneades/\">https://plato.stanford.edu/archives/fall2004/entries/carneades/</a>&gt;.",
                "–––, 2010, “Pyrrhonism and\nMedicine,” in <em>The Cambridge Companion to Ancient\nScepticism</em>, R. Bett (ed.), Cambridge: Cambridge University Press,\npp. 232–248.",
                "–––, 2018, “Aporia and the New\nAcademy,” in <em>The Aporetic Tradition in Ancient\nPhilosophy</em>, G. Karamanolis and V. Politis (eds.), Cambridge:\nCambridge University Press, pp. 172–191.",
                "–––, 2022, “Radicalism and Moderation\nin the New Academy,” <em>Phronesis</em>, 67:\n133–160.",
                "Annas, J., 1996, “Scepticism, Old and New,” in\n<em>Rationality in Greek Thought</em>, M. Frede and G. Striker (eds.),\nOxford: Oxford University Press, pp. 239–254.",
                "Annas, J., 2000, “Hume and Scepticism,” in <em>Ancient\nScepticism and the Sceptical Tradition</em> (Acta Philosophica\nFennica, Volume. 66), J. Sihvola (ed.), Helsinki: Academic Bookstore,\npp. 271–285.",
                "Annas, J. and J. Barnes, 1985, <em>The Modes of Scepticism:\nAncient Texts and Modern Interpretations</em>, Cambridge: Cambridge\nUniversity Press.",
                "Arenson, K. (ed.), 2020. <em>The Routledge Handbook of Hellenistic\nPhilosophy</em>, New York: Routledge.",
                "Bailey, A., 2002, <em>Sextus Empiricus and Pyrrhonean\nScepticism</em>, Oxford: Oxford University Press.",
                "Barnes, J., 1982, “The beliefs of a Pyrrhonist,”\n<em>Proceedings of the Cambridge Philological Society</em>, 28:\n1–29; reprinted in M. Burnyeat and M. Frede 1997, pp.\n58–91.",
                "–––, 1983, “Ancient Skepticism and\nCausation,” in <em>The Skeptical Tradition</em>, M. Burnyeat\n(ed.), Berkeley: University of California Press, pp.\n149–203.",
                "–––, 1990a, <em>The Toils of Scepticism</em>,\nCambridge: Cambridge University Press.",
                "–––, 1990b, “Pyrrhonism, Belief and\nCausation: Observations on the Scepticism of Sextus Empiricus,”\n<em>Aufstieg und Niedergang der Römischen Welt II</em>, 36 (4):\n2608–95.",
                "–––, 1992, “Diogenes Laertius IX\n61–116: the Philosophy of Pyrrhonism,” in <em>Aufstieg und\nNiedergang der Römischen Welt II</em>, 36 (6):\n4241–301.",
                "Barnes, J., J. Brunschwig, M. Burnyeat, and M. Schofield (eds.),\n1982, <em>Science and Speculation: Studies in Hellenistic Theory and\nPractice</em>, Cambridge: Cambridge University Press.",
                "Barney, R., 1992, “Impressions and Appearances,”\n<em>Phronesis</em>, 37 (3): 283–313.",
                "Berry, J., 2011. <em>Nietzsche and the Ancient Skeptical\nTradition</em>, Oxford: Oxford University Press.",
                "–––, 2020, “Sextan Skepticism and\nthe Rise and Fall of German Idealism”, in <em>Epistemology After\nSextus Empiricus</em>, K. M. Vogt and J. Vlasits (eds.), New York:\nOxford University Press.",
                "Bett, R., 1989, “Carneades’ <em>Pithanon</em>: A\nreappraisal of its Role and Status,” <em>Oxford Studies in\nAncient Philosophy</em>, 7: 59–94.",
                "–––, 1990, “Carneades’ Distinction\nbetween Assent and Approval,” <em>Monist</em>, 73 (3):\n3–20.",
                "–––, 1994, “What did Pyrrho think about\n‘The Nature of the Divine and the Good’?”,\n<em>Phronesis</em>, 39: 303–37.",
                "–––, 1994, “Sextus’s <em>Against the\nEthicists</em>: Scepticism, Relativism, or Both?”,\n<em>Apeiron</em>, 27: 123–61.",
                "–––, 2000, <em>Pyrrho, his Antecedents, and his\nLegacy</em>, Oxford: Oxford University Press.",
                "–––, 2006a, “Pyrrho,” <em>The\nStanford Encyclopedia of Philosophy</em> (Summer 2006 edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2006/entries/pyrrho/\">https://plato.stanford.edu/archives/sum2006/entries/pyrrho/</a>&gt;",
                "–––, 2006b, “Timon of Phlius,”\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2006\nedition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2006/entries/timon-phlius/\">https://plato.stanford.edu/archives/sum2006/entries/timon-phlius/</a>&gt;",
                "–––, “Le signe dans la tradition\npyrrhonienne,” in José Kany-Turpin (ed.), <em>Signe et\nprédiction dans l’antiquité</em>\n(Saint-Étienne: Publications de l’Université de\nSaint-Étienne, 2005), pp. 29–48.",
                "–––, 2006, “Socrates and the\nSceptics,” in <em>A Companion to Socrates</em>, S. Ahbel-Rappe\nand R. Kamtekar (eds.), Oxford: Oxford University Press, pp.\n298–311.",
                "––– (ed.), 2010, <em>The Cambridge Companion to\nAncient Scepticism</em>, Cambridge: Cambridge University Press.",
                "–––, 2010a, “Scepticism and Ethics,”\nin Bett (ed.) 2010, pp. 181–194.",
                "–––, 2011, “How Ethical Can an Ancient\nSceptic Be?,” in <em>Pyrrhonism in Ancient, Modern, and\nContemporary Philosophy</em>, Diego Machuca (ed.), Dordrecht:\nSpringer, pp. 3–17.",
                "–––, 2013, “The Pyrrhonist’s\nDilemma: What to Write if you Have Nothing to Say,” in\n<em>Argument und Literarischer Form in antiker Philosophie</em>, Akten\ndes 3. Kongresses der Gesellschaft für antike Philosophie 2010,\nMichael Erler &amp; Jan Erik Hessler (eds.), Berlin: De Gruyter, pp.\n389–410.",
                "–––, 2013b, “Ancient Scepticism,” in\n<em>Oxford Handbook of the History of Ethics</em>, Roger Crisp (ed.),\nOxford: Oxford University Press, pp. 112–28.",
                "–––, 2019, <em>How to be a Pyrrhonist: The\nPractice and Significance of Pyrrhonian Skepticism</em>, Cambridge:\nCambridge University Press.",
                "–––, 2020a, “Echoes of Sextus Empiricus in\nNietzsche?,” in <em>Epistemology After Sextus Empiricus</em>, K.\nM. Vogt and J. Vlasits (eds.), New York: Oxford University Press.",
                "–––, 2020b, “Gorgias’\nΠερὶ τοῦ μὴ\nὄντος and Its Relation to\nSkepticism,” <em>International Journal for the Study of\nSkepticism</em>, 10 (3–4): 187–208.",
                "Bobzien, S., 1998, <em>Determinism and Freedom in Stoic\nPhilosophy</em>, Oxford: Oxford University Press.",
                "–––, 2015, “Sextus on Time: Notes on\nSceptical Method and Doxographical Transmission,” in <em>Sextus\nEmpiricus and Ancient Physics</em>, K. Algra and K. Ierodiakonou\n(eds.), Cambridge: Cambridge University Press, pp. 275–323.",
                "Brittain, C., 2001, <em>Philo of Larissa: The Last of the Academic\nSceptics</em>, Oxford: Oxford University Press.",
                "–––, 2005, “Arcesilaus,” <em>The\nStanford Encyclopedia of Philosophy</em> (Spring 2005 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2005/entries/arcesilaus/\">https://plato.stanford.edu/archives/spr2005/entries/arcesilaus/</a>&gt;",
                "–––, 2005, “Common sense: concepts,\ndefinition and meaning in and out of the Stoa,” in <em>Language\nand Learning. Philosophy of Language in the Hellenistic Age</em>\n(Proceedings of the Ninth Symposium Hellenisticum), D. Frede and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n164–209.",
                "–––, 2014, “The Compulsions of Stoic\nAssent,”, in <em>Strategies of Argument: Essays in Ancient\nEthics, Epistemology, and Logic</em>, Mi-Kyoung (Mitzi) Lee (ed.), New\nYork: Oxford University Press, pp. 332–355.",
                "Brittain, C. and J. Palmer, 2001, “The New Academy’s\nAppeals to the Presocratics,” <em>Phronesis</em>, 46:\n38–72.",
                "Broughton, J., 2002, <em>Descartes’s Method of Doubt</em>,\nPrinceton: Princeton University Press.",
                "Brunschwig, J., 1988, “Sextus Empiricus on the\n<em>kritêrion</em>: the sceptic as conceptual legatee,” in\n<em>The Question of ‘Eclecticism’: Studies in Later Greek\nPhilosophy</em>, J. Dillon and A. Long (eds.), Berkeley: University of\nCalifornia Press, pp. 145–175.",
                "–––, 1990, “La formule <em>hoson epi\ntôi logôi</em> chez Sextus Empiricus,” in <em>Le\nScepticisme Antique</em>, <em>Cahier de la Revue de Théologie\net de Philosophie</em>, 15: 107–121, A.–J. Voelke (ed.);\nEnglish translation in J. Brunschwig, 1994, <em>Papers in Hellenistic\nPhilosophy</em>, Cambridge: Cambridge University Press, pp.\n244–258.",
                "Burnyeat, M. F., 1976, “Protagoras and Self-Refutation in\nLater Greek Philosophy,” <em>Philosophical Review</em>, 135:\n44–69.",
                "–––, 1978, “The Upside-Down Back-to-Front\nSceptic of Lucretius IV 472,” <em>Philologus</em>, 122:\n197–206.",
                "–––, 1980, “Can the sceptic live his\nscepticism?” in <em>Doubt and Dogmatism: Studies in Hellenistic\nEpistemology</em>, M. Schofield, M. Burnyeat and J. Barnes (eds.),\nOxford: Oxford University Press, pp. 20–53; reprinted in\nBurnyeat and Frede (eds.) 1997, pp. 25–57.",
                "–––, 1980b, “Tranquillity without a Stop:\nTimon, Frag. 68,” <em>Classical Quarterly</em>, 30:\n86–93.",
                "–––, 1980c, “Socrates and the Jury:\nParadoxes in Plato’s Distinction between Knowledge and True\nBelief, Part I,” <em>Proceedings of the Aristotelian\nSociety</em> (Supplement), 54: 173–191.",
                "–––, 1982, “Idealism and Greek Philosophy:\nWhat Descartes Saw and Berkeley Missed,” <em>Philosophical\nReview</em>, 91: 3–40.",
                "––– (ed.), 1983, <em>The Skeptical\nTradition</em>, Berkeley: University of California Press.",
                "–––, 1984, “The sceptic in his place and\ntime,” in <em>Philosophy in History</em>, R. Rorty, J.B.\nSchneewind, and Q. Skinner (eds.), Cambridge: Cambridge University\nPress, pp. 225–254; reprinted in Burnyeat and Frede (eds.),\n1997, pp. 92–126.",
                "–––, 2017, “All the World’s a\nStage-Painting: Scenery, Optics, and Greek Epistemology,”\n<em>Oxford Studies in Ancient Philosophy</em>, 52: 33–75.",
                "Burnyeat, M. and M. Frede (eds.), 1997, <em>The Original\nSceptics</em>, Indianapolis and Cambridge, Mass.: Hackett.",
                "Carriero, J., 2008, <em>Between Two Worlds: A Reading of\nDescartes’s Meditations</em>, Princeton: Princeton University\nPress.",
                "Castagnoli, L., 2000, “Self-Bracketing Pyrrhonism,”\n<em>Oxford Studies in Ancient Philosophy</em>, 18: 263–328.",
                "–––, 2010, <em>Ancient Self-Refutation: The\nLogic and History of the Self-Refutation Argument from Democritus to\nAugustine</em>, Cambridge: Cambridge University Press.",
                "Clayman, D., 2009, <em>Timon of Phlius: Pyrrhonism into\nPoetry</em>, Berlin: De Gruyter.",
                "Code, A., 2010, “Aristotle and the History of\nSkepticism,” in <em>Ancient Models of Mind: Studies in Human and\nDivine Rationality</em>, Andrea Nightingale and David Sedley (eds.),\nCambridge: Cambridge University Press, pp. 97–109.",
                "Cooper, J., 2002, “Method and Science in <em>On Ancient\nMedicine</em>,” in <em>Interpretation and Argument</em>, H.\nLinneweber-Lammerskitten and G. Mohr (eds.), Würzburg:\nKönigshausen und Neumann; reprinted in Cooper 2004a, pp.\n3–42.",
                "–––, 2004a, <em>Knowledge, Nature, and the Good:\nEssays on Ancient Philosophy</em>, Princeton: Princeton University\nPress.",
                "–––, 2004b, “Arcesilaus: Socratic and\nSceptic” in <em>Year of Socrates 2001—Proceedings</em>, V.\nKarasmanis (ed.), Athens: European Cultural Center of Delphi;\nreprinted in Cooper 2004a, pp. 81–103.",
                "–––, 2012, Pursuits of Wisdom: Six Ways of Life\nin Ancient Philosophy from Socrates to Plotinus, Princeton: Princeton\nUniversity Press.",
                "Corti, L., 2009, <em>Scepticisme et langage</em>, Paris:\nVrin.",
                "–––, 2010, “Scepticisme sans doute,”\nin ‘Quid est veritas?’ Hommage à Jonathan Barnes,\nA. Longo and M. Bonelli (eds.), Naples: Bibliopolis, pp.\n157–77.",
                "–––, 2011, “Skepticism and Hypothetical\nMethod,” <em>Elenchos: Argument from Hypothesis in Ancient\nPhilosophy</em>, Angela Longo and Davide del Forno (eds.), Naples:\nBibliopolis, pp. 281–302.",
                "–––, 2014, “Hidden Causes: Ancient\nSkeptics and Doctors and Modern Thinkers on the Perceivability of\nCausal Links,” in <em>Le débat sur les causes à\nl’âge hellénistique et imperial</em>, C. Natali and\nC. Viano (eds.), Louvain-la-Neuve, Peeters, pp. 95–117.",
                "–––, 2015, “DL IX 74–77: Mind and\nLanguage of the Laërtian Pyrrhonist,” in K. Vogt (ed.), pp.\n123–145.",
                "–––, 2015b, “Scepticism, number and\nappearances: the\nἀριθμητικὴ\nτέχνη and Sextus’ targets in M I-VI,”\n<em>Philosophie Antique</em>, 15: 123–147.",
                "–––, 2015c, “Sextus, the number two and\nthe Phaedo,” in <em>Ancient Readings of Plato’s\nPhaedo</em>, S. Delcomminette et al. (eds.), Leiden: Brill, pp.\n90–106.",
                "Couissin, P., 1983, “The Stoicism of the New Academy,”\nin Burnyeat (ed.) 1983, pp. 31–63. Translation of Couissin 1929,\n“Le stoicisme de la nouvelle Academie,” <em>Revue\nd’historie de la philosophie</em>, 3: 241–76.",
                "Everson, S., 1990, “Epicurus on the Truth of the\nSenses,” in <em>Epistemology: Companions to Ancient Thought\n1</em>, S. Everson (ed.), Cambridge: Cambridge University Press, pp.\n161–83.",
                "–––, 1990, <em>Epistemology: Companions to\nAncient Thought 1</em>, Cambridge: Cambridge University Press.",
                "–––, 1991, “The Objective Appearance of\nPyrhonism,” <em>Psychology</em>: <em>Companions to Ancient\nThought 2</em>, in S. Everson (ed.), Cambridge: Cambridge University\nPress, pp. 121–147.",
                "Feeney, M. and S. Schellenberg, 2020, “Bayesian\nLiberalism,” in: <em>Epistemology After Sextus Empiricus</em>,\nJ. Vlasits and K. Vogt (eds.), New York: Oxford University Press, pp.\n75–88.",
                "Fine, G., 2000a, “Sceptical Dogmata: <em>Outlines of\nPyrrhonism I 13</em>,” <em>Methexis</em>, 13: 81–105.",
                "–––, 2000b, “Descartes and Ancient\nSkepticism: Reheated Cabbage?”, <em>Philosophical Review</em>,\n109: 195–234.",
                "–––, 2003a, “Subjectivity, Ancient and\nModern: The Cyrenaics, Sextus, and Descartes,” in\n<em>Hellenistic and Early Modern Philosophy</em>, J. Miller and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n192–231.",
                "–––, 2003b, “Sextus and External World\nScepticism,” <em>Oxford Studies in Ancient Philosophy</em>, 23:\n341–385.",
                "–––, 2008, “Does Socrates Claim To Know\nThat He Knows Nothing?”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 35: 49–88.",
                "–––, 2011, “Concepts and inquiry: Sextus\nand the Epicureans,” in <em>Episteme, etc.: Essays in Honour of\nJonathan Barnes</em>, Ben Morison and Katerina Ierodiakonou (eds.),\nOxford: Oxford University Press, pp. 90–113.",
                "–––, 2014, <em>The Possibility of Inquiry:\nMeno’s Paradox from Socrates to Sextus</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2021, <em>Essays in Ancient\nEpistemology</em>, Oxford: Oxford University Press.",
                "Frede, M., 1979, “Des Skeptikers Meinungen,” <em>Neue\nHefte für Philosophie</em>, 15/16: 102–29; reprinted as\n“The Sceptic’s Beliefs,” in Burnyeat and Frede\n(eds.) 1997, pp. 1–24.",
                "–––, 1983, “Stoics and Sceptics on clear\nand distinct impressions,” in M. Burnyeat (ed.) 1983, pp.\n65–94.",
                "–––, 1984, “The Sceptic’s Two Kinds\nof Assent and the Question of the Possibility of Knowledge” in\n<em>Philosophy in History</em>, R. Rorty, J.B. Schneewind, and Q.\nSkinner (eds.), <em>Philosophy in History</em>, Cambridge: Cambridge\nUniversity Press, pp. 255–78; reprinted in Burnyeat and Frede\n(eds.) 1997, pp. 127–151.",
                "–––, 1990, “An Empiricist View of\nKnowledge: Memorism,” in S. Everson (ed.) 1990, pp.\n225–250.",
                "–––, 1994, “The Stoic Conception of\nReason,” in <em>Hellenistic Philosophy</em> (Volume 2), K. J.\nBoudouris (ed.), Athens: International Center for Greek Philosophy,\npp. 50–61.",
                "–––, 1996, “Introduction,” in\n<em>Rationality in Greek Thought</em>, M. Frede and G. Striker (eds.),\nOxford: Oxford University Press, pp. 1–28.",
                "–––, 1997, “The sceptics,” in\n<em>Routledge History of Philosophy. Volume II. From Aristotle to\nAugustine</em>, D. Furley (ed.), London: Routledge, pp.\n253–86.",
                "–––, 1999, “Stoic Epistemology,” in\nAlgra <em>et al</em>. (eds.) 1999, pp. 295–322.",
                "–––, 2008, “Aristotle on Thinking,”\n<em>Rhizai: A Journal for Ancient Philosophy and Science</em>, 2:\n287–301.",
                "Flintoff, E., 1980, “Pyrrho and India,”\n<em>Phronesis</em>, 25: 88–108.",
                "Garrett, D., 2020, “Pyrrhonian Skepticism and Humean\nSkepticism: Belief, Evidence, and Causal Power,” in\n<em>Epistemology After Sextus Empiricus</em>, K. M. Vogt and J.\nVlasits (eds.), New York: Oxford University Press, 213–236.",
                "Glidden, D. K., 1983, “Skeptic Semiotics,”\n<em>Phronesis</em>, 28: 213–255.",
                "Glüer, K., 2020, “Illusory Looks,” in\n<em>Epistemology After Sextus Empiricus</em>, J. Vlasits and K. Vogt\n(eds.), New York: Oxford University Press, pp. 48–74.",
                "González Quintero, C., 2022, <em>Academic Skepticism in\nHume and Kant</em>, Cham: Springer International Publishing.",
                "Grgic, F., 2006, “Sextus Empiricus on the Goal of\nSkepticism,” <em>Ancient Philosophy</em>, 26: 141–60.",
                "Hankinson, R.J., 1987, “Causes and Empiricism: A Problem in\nthe Interpretation of Later Greek Medical Method,”\n<em>Phronesis</em>, 32: 329–48.",
                "––– (ed.), 1988, <em>Method, Medicine and\nMetaphysics: Studies in the Philosophy of Ancient Science</em>,\n<em>Apeiron</em>, XXI (2).",
                "–––, 1994, “Values, objectivity and\ndialectic: the sceptical attack on ethics; its methods, aims and\nsuccess,” <em>Phronesis</em>, 49: 45–6.",
                "–––, 1995, <em>The Sceptics</em>, London:\nRoutledge.",
                "–––, 2003, “Stoic Epistemology,” in\nB. Inwood (ed.) 2003, pp. 59–84.",
                "–––, 2010, “Aenesidemus and the Rebirth of\nPyrrhonism,” in Bett (ed.) 2010, pp. 105–119.",
                "Hanner, O. (ed.), 2020, <em>Buddhism and Scepticism:\nHistorical, Philosophical, and Comparative\nPerspectives</em>, Freiburg/Bochum: Project Verlag.",
                "Heck, P., 2014, <em>Skepticism in Classical Islam: Moments of\nConfusion</em>, London: Routledge.",
                "House, D.K., 1980, “The Life of Sextus Empiricus,”\n<em>Classical Quarterly</em>, 30: 227–238.",
                "Inwood, B., 1985, <em>Ethics and Human Action in Early\nStoicism</em>, Oxford: Oxford University Press.",
                "––– (ed.), 2003, <em>Cambridge Companion to the\nStoics</em>, Cambridge: Cambridge University Press.",
                "Inwood, B. and J. Mansfeld (eds.), 1997, <em>Assent and\nArgument</em> (Studies in Cicero’s Academic Books),\n<em>Proceedings of the Seventh Symposium Hellenisticum</em>, Leiden:\nBrill.",
                "Irwin, T. (ed.), 1995, <em>Classical Philosophy: Collected\nPapers</em>, 8 volumes, New York: Garland.",
                "Janácek, K., 1948, <em>Prolegomena to Sextus\nEmpiricus</em>, Olomouc: Nákladem Palackého\nUniversity.",
                "Janácek, K., 1972, <em>Sextus Empiricus’ Sceptical\nMethods</em>, Prague: Universita Karlova.",
                "Johnson, B., 2001, “On the coherence of Pyrrhonian\nSkepticism,” <em>The Philosophical Review</em>, 110:\n521–61.",
                "Kirwan, C., 1983, “Augustine Against the Skeptics,” in\nBurnyeat (ed.) 1983, pp. 205–223.",
                "Kukkonen, T., 2009, “Al-Ghazali’s Skepticism\nRevisited,”, in <em>A History of Skepticism in the Middle\nAges</em>, Lagerlund (ed.), Leiden: Brill, pp. 29–59.",
                "Lagerlund, H. (ed.), 2009, <em>A History of Skepticism in the\nMiddle Ages</em>, Leiden: Brill.",
                "Lagerlund, H., 2009, “Introduction,”, in <em>A History\nof Skepticism in the Middle Ages</em>, Lagerlund (ed.), Leiden: Brill,\npp.1–28.",
                "–––, 2020, <em>Skepticism in Philosophy: A\nComprehensive, Historical Introduction</em>, New York:\nRoutledge.",
                "Lee, M., 2005, <em>Epistemology after Protagoras: Responses to\nRelativism in Plato, Aristotle, and Democritus</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2010, “Antecedents in Early Greek\nPhilosophy,” in Bett (ed.) 2010, pp. 13–35.",
                "Lesher, J. H., 1999, “Early Interest in Knowledge,” in\n<em>Cambridge Companion to Early Greek Philosophy</em>, A. A. Long\n(ed.), Cambridge: Cambridge University Press, pp. 225–249.",
                "Lévy, C., 2010, “The Sceptical Academy: Decline and\nAfterlife,” in Bett (ed.) 2010, pp. 81–104.",
                "Long, A. A., 2006, <em>From Epicurus to Epictetus: Studies in\nHellenistic and Roman Philosophy</em>, Oxford: Oxford University\nPress.",
                "Machuca, D. E., 2006, “The Pyrrhonist’s\n<em>ataraxia</em> and <em>philanthrôpia</em>,” <em>Ancient\nPhilosophy</em>, 26: 111–139.",
                "–––, D. E., 2019, “Sources of Doxastic\nDisturbance in Sextus Empiricus” <em>Oxford Studies in Ancient\nPhilosophy</em>, 56: 193–214.",
                "–––, D. E., 2022, <em>Pyrrhonism Past and\nPresent: Inquiry, Disagreement, Self-Knowledge, and Rationality</em>,\nCham: Springer International Press.",
                "Machuca, D. and Reed, B., 2018, <em>Skepticism: From Antiquity to\nthe Present</em>, London: Bloomsbury.",
                "Machek, D. and Veres, M., 2021),\n“Expert Impressions in Stoicism,” <em>Archiv für\nGeschichte der Philosophie</em>. doi:10.1515/agph-2021-0038",
                "Malink, M., 2020, “Hypothetical Syllogisms and Infinite\nRegress,” in <em>Epistemology after Sextus Empiricus</em>, K.\nVogt and J. Vlasits (eds.), New York: Oxford University Press, pp.\n129–151.",
                "Marchand, S., 2015, “Sextus Empiricus: les effets politiques\nde la suspension du jugement” <em>Elenchos: Rivista di studi sul\npensiero antico</em>, 35 (2): 311–342.",
                "–––, 2021, “Pyrrhonism and the Value of\nLaw,” <em>Polis: The Journal for Ancient Greek and Roman\nPolitical Thought</em>, 38 (3): 573–587.",
                "McPherran, M., 1987, “Sceptical Homeopathy and\nSelf-Refutation,” <em>Phronesis</em>, 32: 290–328.",
                "McPherran, M., 1989, “<em>Ataraxia</em> and\n<em>Eudaimonia</em> in Ancient Pyrrhonism: Is the Sceptic Really\nHappy?,” in <em>Proceedings of the Boston Area Colloquium in\nAncient Philosophy</em>, J. J. Cleary and D. C. Shartin (eds.), pp.\n135–171.",
                "McPherran, M., 1990, “Pyrrhonism’s Arguments against\nValue,” <em>Philosophical Studies</em>, 60: 127–142.",
                "Menn, S., 1998, <em>Descartes and Augustine</em>, Cambridge:\nCambridge University Press.",
                "–––, 2003, “The Discourse on the Method\nand the Tradition of Intellectual Autobiography,” in\n<em>Hellenistic and Early Modern Philosophy</em>, J. Miller and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n141–191.",
                "Mill, E., 2018, <em>Three Pillars of Skepticism in Classical\nIndia: Nāgārjuna, Jayarāśi, and Śrī\nHarṣa</em>, Lanham: Lexington Books.",
                "Morison, B., 2011, “The Logical Structure of the\nSceptic’s Opposition,” in Allen, Emilsson, Morison and\nMann (eds.), <em>Essays in Memory of Michael Frede</em>, <em>Oxford\nStudies in Ancient Philosophy</em>, 40: 265–295.",
                "–––, 2018, “The Sceptic’s\nModes of Argumentation,” in <em>Dialectic after Plato and\nAristotle</em> (Proceedings of the 2013 Symposium Hellenisticum), T.\nBénatouïl and K. Ierodiakonou (eds.), Cambridge: Cambridge\nUniversity Press, pp. 283–317.",
                "Moss, J. and W. Schwab, 2019, “The Birth of Belief,”\n<em>Journal of the History of Philosophy</em>, 57 (1): \n1–32.",
                "Nawar, T. 2014, “The Stoic Account of Apprehension,”\n<em>Philosophers’ Imprint</em>, 14 (29), \n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.029\" target=\"other\">Nawar 2014 available online</a>].",
                "–––, 2017, “The Stoics on Identity,\nIdentiﬁcation, and Peculiar\nQualities,” <em>Proceedings of the Boston Area Colloquium\nof Ancient Philosophy</em>, 32 (1): 113–59.",
                "–––, 2019, “Augustine’s Defense of\nKnowledge against the Skeptics,” O<em>xford Studies in\nAncient Philosophy</em>, 56: 215–65.",
                "Nussbaum, M., 1994, “Sceptic Purgatives: Disturbance and the\nLife Without Belief,” in <em>The Therapy of Desire: Theory and\nPractice in Hellenistic Ethics</em>, M. Nussbaum, Princeton: Princeton\nUniversity Press, pp. 280–315.",
                "Obdrzalek, S., 2006, “Living in Doubt: Carneades’\n<em>Pithanon</em> Reconsidered,” <em>Oxford Studies in Ancient\nPhilosophy</em>, 31: 243–80.",
                "–––, 2013, “From Skepticism to\nParalysis,” <em>Ancient Philosophy</em>, 32 (2):\n369–392.",
                "Olfert, C., 2015, “Skeptical Investigation and its\nPerks,” in <em>Diogenes Laertius’s Lives of Philosophers\nIX.61–161</em>, Katja Vogt (ed.), SAPERE series by Mohr Siebeck,\npp. 147–170.",
                "–––, forthcoming, “Pyrrhonian Skepticism\non Gender and Virtue,” in <em>The Routledge Handbook of\nWomen and Ancient Greek Philosophy</em>, Sara Brill and Catherine\nMcKeen (eds.).",
                "Pagin, P., 2020, “The Force of Assumptions and\nSelf-Attributions,” in: <em>Epistemology After Sextus\nEmpiricus</em>, K. Vogt and J. Vlasits (eds.), New York: Oxford\nUniversity Press, pp. 116–128.",
                "Palmer, J., 2000, “Skeptical Investigation,”\n<em>Ancient Philosophy</em>, 20: 351–73.",
                "Pellegrin, P., 2010, “Sextus Empiricus,” in Bett (ed.)\n2010, pp. 120–142.",
                "Perin, C., 2006, “Pyrrhonian Scepticism and the Search for\nTruth,” <em>Oxford Studies in Ancient Philosophy</em>, 30:\n337–360.",
                "–––, 2013, “Making Sense of\nArcesilaus,” <em>Oxford Studies in Ancient Philosophy</em>, 45:\n313–338.",
                "Powell, J. G. F., 2013, “The Embassy of the Three\nPhilosophers to Rome in 155 bc,” in: <em>Hellenistic Oratory:\nContinuity and Change</em>, Christos Kremmydas and Kathryn Tempest\n(eds.), Oxford: Oxford University Press, pp. 219–247.",
                "Powers, N., 2010, “The System of the Sceptical Modes in\nSextus Empiricus,” <em>Apeiron</em>, 43: 157–171.",
                "Ricken, F., 1984, <em>Antike Skeptiker</em>, Munich: Beck\nVerlag.",
                "Sassi, M. M., 2011, “Senofane Fra I Sofisti. Dai Limiti\nDella Conoscenza (21B34 DK),” <em>Methexis</em>, 24:\n7–20.",
                "Schmitt, J., forthcoming, “Sextus versus Galen on\nSophisms,” in <em>Sextus’ Logic in Context</em>, M. Veres\nand J. Vlasits (eds.), Cambridge: Cambridge University Press.",
                "Schofield, M., M. Burnyeat, and J. Barnes (eds.), 1980, <em>Doubt\nand Dogmatism: Studies in Hellenistic Epistemology</em>, Oxford:\nOxford University Press.",
                "Schwab, W., 2016, “Understanding Episteme in Plato’s\n<em>Republic</em>,” in <em>Oxford Studies in Ancient\nPhilosophy</em>, 51: 41–85.",
                "–––, 2020, “Skeptical Defenses Against the\nInaction Objection,” in Kelly Arenson (ed.), <em>The Routledge\nHandbook of Hellenistic Philosophy</em>, London: Routledge,\npp. 184–198.",
                "Sedley, D. N., 1982, “The Stoic Criterion of\nIdentity,” <em>Phronesis</em>, 27 (3): 255–275.",
                "–––, 1983, “The Motivation of Greek\nSkepticism,” in Burnyeat (ed.) 1983, pp. 9–29.",
                "–––, 2002, “Zeno’s Deﬁnition\nof Phantasia Kataleptike,” in: <em>The Philosophy of\nZeno</em>, T. Scaltsas and A. S. Mason (eds.), Larnaca: The\nMunicipality of Larnaca, pp. 133–54.",
                "–––, 2015, “Diogenes Laertius on the Ten\nPyrrhonist Modes,” in K. Vogt (ed.), pp. 171–185.",
                "Shogry, S., 2018, “Creating a Mind Fit for Truth: the Stoic\nAccount of the Kataleptic Impression,” <em>Ancient\nPhilosophy</em>, 38 (2): 357–81.",
                "–––, 2019, “What Do Our Impressions Say?\nThe Stoic Theory of Perceptual Content and Belief Formation,”\n<em>Apeiron</em>, 52 (1): 29–63.",
                "–––, 2021, “The Stoic Appeal to\nExpertise: Platonic Echoes in the Reply to\nIndistinguishability,” <em>Apeiron</em>, 54 (2):\n129–59.",
                "Sienkiewicz, S., 2019, <em>Five Modes of Scepticism: Sextus\nEmpiricus and the Agrippan Modes</em>, Oxford: Oxford University\nPress.",
                "–––, 2021. “The Sceptic’s Art:\nVarieties of Expertise in Sextus Empiricus,” in Productive\nKnowledge in Ancient Philosophy, T. Johansen (ed.), Cambridge:\nCambridge University Press, pp. 226–244.",
                "–––, 2022, “Proof Against Proof: A reading\nof Sextus Empiricus’ Against the Logicians 8. 463–\n81” <em>Oxford Studies in Ancient Philosophy</em>, 61 Winter\n2021 (delayed publication in 2022)",
                "Sihvola, J. (ed.), 2000, <em>Ancient Scepticism and the Sceptical\nTradition</em> (Acta Philosophica Fennica, Volume 66), Helsinki:\nAcademic Bookstore.",
                "Smith, P. J., 2022, <em>Sextus Empiricus’ Neo-Pyrrhonism:\nSkepticism as a Rationally Ordered Experience</em>, Cham: Springer,\nSynthese Library.",
                "Sorensen, R., 2004, “Commercial Applications of\nSkepticism” in <em>Pyrrhonian Scepticism</em>, W.\nSinnott-Armstrong (ed.), New York: Oxford University Press, pp.\n208–32.",
                "Striker, G., 1974, “<em>Kritêrion tês\nalêtheias</em>,” <em>Nachrichten der Akademie der\nWissenschaften</em> <em>zu Gottingen</em>, I. Phil.-hist. Klasse 2:\n48–110; reprinted in Striker 1996, pp. 22–76.",
                "–––, 1980, “Sceptical Strategies,”\nin Schofield <em>et al</em>. (eds.) 1980, pp. 54–83; reprinted\nin Striker 1996, pp. 92–115.",
                "–––, 1981, “Über den Unterschied\nzwischen den Pyrrhoneern und den Akademikern,”\n<em>Phronesis</em>, 26: 353–69; English translation in Striker\n1996, pp. 135–149.",
                "–––, 1983, “The Ten Tropes of\nAenesidemus,” in Burnyeat (ed.) 1983, pp. 95–115.",
                "–––, 1990, “The Problem of the\nCriterion,” in Everson (ed.) 1990, pp. 143–60.",
                "–––, 1990, “<em>Ataraxia</em>: Happiness\nas Tranquillity,” <em>Monist</em>, 73: 97–110; reprinted\nin Striker 1996, pp. 183–95.",
                "–––, 1996, <em>Essays on Hellenistic\nEpistemology and Ethics</em>, Cambridge: Cambridge University\nPress.",
                "–––, 1996, “<em>Ataraxia</em>: Happiness\nas Tranquillity,” in Striker 1996, pp. 183–195.",
                "–––, 2001, “Scepticism as a Kind of\nPhilosophy,” <em>Archiv für Geschichte der\nPhilosophie</em>, 83: 113–129.",
                "–––, 2004, “Historical Reflections on\nClassical Pyrrhonism and Neo-Pyrrhonism,” in Sinnott-Armstrong\n(ed.) 2004, pp. 13–24.",
                "–––, 2010, “Academics Versus Pyrrhonists,\nReconsidered,” in Bett (ed.) 2010, pp. 195–207.",
                "Svavarsson, S. H., 2002, “Pyrrho’s Dogmatic\nNature,” <em>Classical Quarterly</em>, 52 (1):\n248–56.",
                "–––, 2004, “Pyrrho’s Undecidable\nNature,” <em>Oxford Studies in Ancient Philosophy</em>, 27:\n249–95.",
                "–––, 2010, “Pyrrho and Early\nPyrrhonism,” in Bett (ed.) 2010, pp. 36–57.",
                "–––, 2014, “Sextus Empiricus on\nPersuasiveness and Equipollence, ” in <em>Strategies of\nArgument: Essays in Ancient Ethics, Epistemology, and Logic</em>,\nMi-Kyoung (Mitzi) Lee (ed.), Oxford: Oxford University Press, pp.\n356–374.",
                "Taylor, C. C. W., 1980, “All Perceptions are True,” in\nSchofield <em>et al</em>. (eds.) 1980, pp. 105–24.",
                "Thorsrud, H., 2009, <em>Ancient Scepticism</em>, Berkeley:\nUniversity of California Press.",
                "–––, 2010, “Arcesilaus and\nCarneades,” in Bett (ed.) 2010, pp. 58–80.",
                "–––, 2018, “Arcesilaus: Socratic\nSkepticism in Plato's Academy” <em>Lexicon Philosophicum:\nInternational Journal for the History of Texts and Ideas</em>.\ndoi:10.19283/lph-2018.568",
                "–––, 2019, “Sextus Empiricus on the\nSiren Song of Reason and the Skeptical Defense of Ordinary\nLife,” <em>Logos and Episteme</em>, 10 (1): 15–29.",
                "Vasiliou, I., 2019, “Ancient Philosophy and Disjunctivism:\nThe Case of the Stoics,” in <em>New Issues in Epistemological\nDisjunctivism</em>, Casey Doyle, Joseph Milburn, and Duncan Pritchard\n(eds.), London and New York: Routledge, pp. 61–88.",
                "Veres, M., 2020a, “Sextus Empiricus on Religious\nDogmatism,” V. Caston (ed.), <em>Oxford Studies in Ancient\nPhilosophy</em>, 58: 239–280.",
                "–––, 2020b, “Keep Calm and Carry On:\nSextus Empiricus on the Origins of Pyrrhonism,” <em>History of\nPhilosophy and Logical Analysis</em>, 23 (1): 100–122.",
                "–––, 2021, “How to Resist Musical\nDogmatism: The Aim and Methods of Pyrrhonian Inquiry in Sextus\nEmpiricus' Against the Musicologists (Math. 6),” in: <em>Music\nand Philosophy in the Roman Empire</em>, F. Pelosi and F. M. Petrucci\n(eds.), Cambridge: Cambridge University Press, pp. 108–130.",
                "Vlasits, J., 2020a, “The First Riddle of Induction: Sextus\nEmpiricus and the Formal Learning Theorists” in Vogt and Vlasits\n(eds.), <em>Epistemology After Sextus Empiricus</em>, New York: Oxford\nUniversity Press, pp. 237–253.",
                "–––, 2020b, “Pyrrhonism and the\nDialectical Methods: The Aims and Argument of Outlines of Pyrrhonism\nII,” <em>History of Philosophy &amp; Logical Analysis</em>,\n23: 225–252.",
                "Vlasits, J. and K. M. Vogt (eds.), 2020, Epistemology After Sextus\nEmpiricus, New York: Oxford University Press.",
                "Vogt, K., 1998, <em>Skepsis und Lebenspraxis</em>, Stuttgart:\nAlber Verlag.",
                "–––, 2008, <em>Law, Reason, and the Cosmic City:\nPolitical Philosophy in the Early Stoa</em>, New York: Oxford\nUniversity Press.",
                "–––, 2010, “Scepticism and Action,”\nin Bett (ed.) 2010, pp. 165–180.",
                "–––, 2012a, <em>Belief and Truth: A Skeptic\nReading of Plato</em>, New York: Oxford University Press.",
                "–––, 2012b, “Appearances and Assent:\nSkeptical Belief Reconsidered,” <em>Classical Quarterly</em>, 62:\n648–663.",
                "–––, 2013, “The Hellenistic\nAcademy,” in <em>Routledge Companion to Ancient Philosophy</em>,\nFrisbee Sheffield and James Warren (eds.), Routledge: New York and\nLondon, pp. 482–495.",
                "–––, 2015a, “From Investigation to Doubt:\nThe Beginnings of Modern Skepticism,” in <em>Roman Reflections:\nEssays on Latin Philosophy</em>, G. Williams and K. Volk (eds.),\nOxford: Oxford University Press, pp. 260–274.",
                "–––, 2017, “All Sense-Perceptions are\nTrue: Epicurean Responses to Skepticism and Relativism,” in\n<em>Lucretius and Modernity</em>, Jacques Lezra (ed.), London:\nPalgrave, pp. 145–159.",
                "–––, 2021, “No More This Than That:\nPyrrhonian Indeterminacy,” <em>Midwest Studies in Philosophy\nVolume</em>, 45: 57–76.",
                "–––, 2022, “Vagueness and Kataleptic\nImpressions,” <em>Proceedings of the\nAristotelian Society</em> (Supplement), XCVI: 165–183.",
                "Vogt, K. (ed.) (co-trans. and co-commentator), 2015,\n<em>Pyrrhonian Skepticism in Diogenes Laertius</em> (SAPERE: Volume\n25), Tübingen: Mohr Siebeck.",
                "Voelke, A.-J., 1990, “Soigner par le logos: La\nthérapeutique de Sextus Empiricus,” in A.-J. Voelke\n(ed.), <em>Le scepticisme antique: perspectives historiques et\nsystématiques</em>, <em>Cahiers de la Revue de Théologie\net de Philosophie</em>, 15: 181–92.",
                "Warren, J., 2015, “Precursors of Pyrrhonism: Diog. Laert.\n9.67–73,” in K. Vogt (ed.) 2015, pp. 105–121.",
                "Williams, M., 1988, “Skepticism without Theory,”\n<em>The Review of Metaphysics</em>, 41 (3): 547–588.",
                "–––, 2010, “Descartes’\nTransformation of the Sceptical Tradition,” in Bett (ed.) 2010,\npp. 288–313.",
                "Woodruff, P., 1986, “The sceptical side of Plato’s\nmethod,” <em>Revue Internationale de Philosophie</em>, 40:\n22–37.",
                "–––, 1988, “Aporetic Pyrrhonism”,\n<em>Oxford Studies in Ancient Philosophy</em>, 6: 139–68.",
                "–––, 2010, “The Pyrrhonian Modes,”\nin Bett (ed.) 2010, pp. 208–231.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSou\">Primary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Annas, J. and J. Barnes (ed. and trans.), 2000, <em>Sextus\nEmpiricus, Outlines of Scepticism</em>, Cambridge: Cambridge\nUniversity Press, 2<sup>nd</sup> edition.</li>\n<li>Bett, R. (ed. and trans. with commentary), 1997, <em>Sextus\nEmpiricus: Against the Ethicists</em> (Adversus Mathematicos XI),\nOxford: Oxford University Press.</li>\n<li>Bett, R. (ed. and trans. with commentary), 2005, <em>Sextus\nEmpiricus: Against the Logicians</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Bett, R. (ed. and trans. with commentary), 2012, <em>Sextus\nEmpiricus: Against the Physicists</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Bett, R. (trans. with an introduction and notes), 2018, <em>Sextus\nEmpiricus: Against Those in the Disciplines</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Bettenson, H. (trans.), 2003, <em>Augustine: City of God</em>,\nLondon: Penguin.</li>\n<li>Blank, D.L. (ed. and trans. with commentary), 1998, <em>Sextus\nEmpiricus: Against the Grammarians</em> (Adversus Mathematicos I),\nOxford: Oxford University Press.</li>\n<li>Brittain, C. (trans. with introduction), 2006, <em>Cicero: On\nAcademic Scepticism</em>, Indianapolis and Cambridge, MA:\nHackett.</li>\n<li>Bury, R.G. (trans.), 1933–49, <em>Sextus Empiricus</em>\n(Loeb Classical Library), 4 volumes, Cambridge, MA: Harvard University\nPress.</li>\n<li>Chadwick, H. (trans.), 1991, <em>Augustine: Confessions</em>,\nOxford: Oxford University Press.</li>\n<li>Corti, L. (trans. with introduction and commentary)\n(forthcoming), <em>Sextus Empiricus: Against the\nArithmeticians</em>,  Leiden: Brill.</li>\n<li>Decleva Caizzi, F. (trans. and commentary), 1981, <em>Pirrone:\nTestimonianze</em>, Naples: Bibliopolis.</li>\n<li>Diels, H. and W. Kranz (eds.), 1996, <em>Die Fragmente der\nVorsokratiker</em>, 3 volumes., reprint of sixth edition (Berlin\n1996), Berlin: Weidmann [= <strong>DK</strong>].</li>\n<li>Drake, S. (trans.), 1957, <em>Discoveries and Opinions of\nGalileo</em>, New York: Doubleday.</li>\n<li>Hicks, R. (ed. and trans.), 1991, <em>Diogenes Laertius: Lives of\nEminent Philosophers</em> (Loeb Classical Library), 2 volumes,\nCambridge MA: Harvard University Press, reprint of second edition [=\n<strong>DL</strong>].</li>\n<li>Hume, D., 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London; reprinted in <em>Enquiries Concerning the\nHuman Understanding and Concerning the Principles of Morals</em>, L.\nA. Selby-Bigge (ed.), revised P. H. Nidditch, Oxford: Oxford\nUniversity Press, 1975.</li>\n<li>Khalidi, M.A., K. Ameriks, and D. Clarke (eds.), 2005,\n<em>Medieval Islamic Philosophical Writings</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Long, A. A., and D.N. Sedley (eds. and trans.), 1987, <em>The\nHellenistic Philosophers</em>, translation and philosophical\ncommentary in vol 1, Greek and Latin texts, and philological\ncommentary in vol. 2, Cambridge: Cambridge University Press [=\n<strong>LS</strong>].</li>\n<li>Mates, B., (trans. and commentary), 1996, <em>The Skeptic Way:\nSextus Empiricus’ Outlines of Pyrrhonism</em>, New York: Oxford\nUniversity Press.</li>\n<li>Schoedinger, A. B. (ed. and trans.), 1996, <em>Readings in\nMedieval Philosophy</em> , New York: Oxford University Press.</li>\n<li>Vogt, K. (ed.) (co-trans. and co-commentator), 2015,\n<em>Pyrrhonian Skepticism in Diogenes Laertius</em> (SAPERE: Volume\n25), Tübingen: Mohr Siebeck.</li>\n<li>Wittgenstein, L., 1922, <em>Tractatus Logico-Philosophicus</em>,\nC. K. Ogden (trans.), London: Routledge &amp; Kegan Paul.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Ainslie, D. C., 2003, “Hume’s Scepticism and Ancient\nScepticisms,” in <em>Hellenistic and Early Modern\nPhilosophy</em>, J. Miller and B. Inwood (eds.), Cambridge: Cambridge\nUniversity Press, pp. 251–73.</li>\n<li>Algra, K, J. Barnes, J. Mansfeld, and M. Schofield (eds.), 1999,\n<em>The Cambridge History of Hellenistic Philosophy</em>, Cambridge:\nCambridge University Press.</li>\n<li>Alesse, F., 1999, <em>La Stoa e la Tradizione Socratica</em>,\nNapoli: Bibliopolis.</li>\n<li>Allen, J., 1994, “Academic probabilism and Stoic\nepistemology,” <em>Classical Quarterly</em>, 44:\n85–113.</li>\n<li>–––, 2001, <em>Inference From Signs: Ancient\nDebates About the Nature of Evidence</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2004, “Carneades,” <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2004 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2004/entries/carneades/\">https://plato.stanford.edu/archives/fall2004/entries/carneades/</a>&gt;.</li>\n<li>–––, 2010, “Pyrrhonism and\nMedicine,” in <em>The Cambridge Companion to Ancient\nScepticism</em>, R. Bett (ed.), Cambridge: Cambridge University Press,\npp. 232–248.</li>\n<li>–––, 2018, “Aporia and the New\nAcademy,” in <em>The Aporetic Tradition in Ancient\nPhilosophy</em>, G. Karamanolis and V. Politis (eds.), Cambridge:\nCambridge University Press, pp. 172–191.</li>\n<li>–––, 2022, “Radicalism and Moderation\nin the New Academy,” <em>Phronesis</em>, 67:\n133–160.</li>\n<li>Annas, J., 1996, “Scepticism, Old and New,” in\n<em>Rationality in Greek Thought</em>, M. Frede and G. Striker (eds.),\nOxford: Oxford University Press, pp. 239–254.</li>\n<li>Annas, J., 2000, “Hume and Scepticism,” in <em>Ancient\nScepticism and the Sceptical Tradition</em> (Acta Philosophica\nFennica, Volume. 66), J. Sihvola (ed.), Helsinki: Academic Bookstore,\npp. 271–285.</li>\n<li>Annas, J. and J. Barnes, 1985, <em>The Modes of Scepticism:\nAncient Texts and Modern Interpretations</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Arenson, K. (ed.), 2020. <em>The Routledge Handbook of Hellenistic\nPhilosophy</em>, New York: Routledge.</li>\n<li>Bailey, A., 2002, <em>Sextus Empiricus and Pyrrhonean\nScepticism</em>, Oxford: Oxford University Press.</li>\n<li>Barnes, J., 1982, “The beliefs of a Pyrrhonist,”\n<em>Proceedings of the Cambridge Philological Society</em>, 28:\n1–29; reprinted in M. Burnyeat and M. Frede 1997, pp.\n58–91.</li>\n<li>–––, 1983, “Ancient Skepticism and\nCausation,” in <em>The Skeptical Tradition</em>, M. Burnyeat\n(ed.), Berkeley: University of California Press, pp.\n149–203.</li>\n<li>–––, 1990a, <em>The Toils of Scepticism</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1990b, “Pyrrhonism, Belief and\nCausation: Observations on the Scepticism of Sextus Empiricus,”\n<em>Aufstieg und Niedergang der Römischen Welt II</em>, 36 (4):\n2608–95.</li>\n<li>–––, 1992, “Diogenes Laertius IX\n61–116: the Philosophy of Pyrrhonism,” in <em>Aufstieg und\nNiedergang der Römischen Welt II</em>, 36 (6):\n4241–301.</li>\n<li>Barnes, J., J. Brunschwig, M. Burnyeat, and M. Schofield (eds.),\n1982, <em>Science and Speculation: Studies in Hellenistic Theory and\nPractice</em>, Cambridge: Cambridge University Press.</li>\n<li>Barney, R., 1992, “Impressions and Appearances,”\n<em>Phronesis</em>, 37 (3): 283–313.</li>\n<li>Berry, J., 2011. <em>Nietzsche and the Ancient Skeptical\nTradition</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2020, “Sextan Skepticism and\nthe Rise and Fall of German Idealism”, in <em>Epistemology After\nSextus Empiricus</em>, K. M. Vogt and J. Vlasits (eds.), New York:\nOxford University Press.</li>\n<li>Bett, R., 1989, “Carneades’ <em>Pithanon</em>: A\nreappraisal of its Role and Status,” <em>Oxford Studies in\nAncient Philosophy</em>, 7: 59–94.</li>\n<li>–––, 1990, “Carneades’ Distinction\nbetween Assent and Approval,” <em>Monist</em>, 73 (3):\n3–20.</li>\n<li>–––, 1994, “What did Pyrrho think about\n‘The Nature of the Divine and the Good’?”,\n<em>Phronesis</em>, 39: 303–37.</li>\n<li>–––, 1994, “Sextus’s <em>Against the\nEthicists</em>: Scepticism, Relativism, or Both?”,\n<em>Apeiron</em>, 27: 123–61.</li>\n<li>–––, 2000, <em>Pyrrho, his Antecedents, and his\nLegacy</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2006a, “Pyrrho,” <em>The\nStanford Encyclopedia of Philosophy</em> (Summer 2006 edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2006/entries/pyrrho/\">https://plato.stanford.edu/archives/sum2006/entries/pyrrho/</a>&gt;</li>\n<li>–––, 2006b, “Timon of Phlius,”\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2006\nedition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2006/entries/timon-phlius/\">https://plato.stanford.edu/archives/sum2006/entries/timon-phlius/</a>&gt;</li>\n<li>–––, “Le signe dans la tradition\npyrrhonienne,” in José Kany-Turpin (ed.), <em>Signe et\nprédiction dans l’antiquité</em>\n(Saint-Étienne: Publications de l’Université de\nSaint-Étienne, 2005), pp. 29–48.</li>\n<li>–––, 2006, “Socrates and the\nSceptics,” in <em>A Companion to Socrates</em>, S. Ahbel-Rappe\nand R. Kamtekar (eds.), Oxford: Oxford University Press, pp.\n298–311.</li>\n<li>––– (ed.), 2010, <em>The Cambridge Companion to\nAncient Scepticism</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2010a, “Scepticism and Ethics,”\nin Bett (ed.) 2010, pp. 181–194.</li>\n<li>–––, 2011, “How Ethical Can an Ancient\nSceptic Be?,” in <em>Pyrrhonism in Ancient, Modern, and\nContemporary Philosophy</em>, Diego Machuca (ed.), Dordrecht:\nSpringer, pp. 3–17.</li>\n<li>–––, 2013, “The Pyrrhonist’s\nDilemma: What to Write if you Have Nothing to Say,” in\n<em>Argument und Literarischer Form in antiker Philosophie</em>, Akten\ndes 3. Kongresses der Gesellschaft für antike Philosophie 2010,\nMichael Erler &amp; Jan Erik Hessler (eds.), Berlin: De Gruyter, pp.\n389–410.</li>\n<li>–––, 2013b, “Ancient Scepticism,” in\n<em>Oxford Handbook of the History of Ethics</em>, Roger Crisp (ed.),\nOxford: Oxford University Press, pp. 112–28.</li>\n<li>–––, 2019, <em>How to be a Pyrrhonist: The\nPractice and Significance of Pyrrhonian Skepticism</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2020a, “Echoes of Sextus Empiricus in\nNietzsche?,” in <em>Epistemology After Sextus Empiricus</em>, K.\nM. Vogt and J. Vlasits (eds.), New York: Oxford University Press.</li>\n<li>–––, 2020b, “Gorgias’\nΠερὶ τοῦ μὴ\nὄντος and Its Relation to\nSkepticism,” <em>International Journal for the Study of\nSkepticism</em>, 10 (3–4): 187–208.</li>\n<li>Bobzien, S., 1998, <em>Determinism and Freedom in Stoic\nPhilosophy</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2015, “Sextus on Time: Notes on\nSceptical Method and Doxographical Transmission,” in <em>Sextus\nEmpiricus and Ancient Physics</em>, K. Algra and K. Ierodiakonou\n(eds.), Cambridge: Cambridge University Press, pp. 275–323.</li>\n<li>Brittain, C., 2001, <em>Philo of Larissa: The Last of the Academic\nSceptics</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2005, “Arcesilaus,” <em>The\nStanford Encyclopedia of Philosophy</em> (Spring 2005 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2005/entries/arcesilaus/\">https://plato.stanford.edu/archives/spr2005/entries/arcesilaus/</a>&gt;</li>\n<li>–––, 2005, “Common sense: concepts,\ndefinition and meaning in and out of the Stoa,” in <em>Language\nand Learning. Philosophy of Language in the Hellenistic Age</em>\n(Proceedings of the Ninth Symposium Hellenisticum), D. Frede and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n164–209.</li>\n<li>–––, 2014, “The Compulsions of Stoic\nAssent,”, in <em>Strategies of Argument: Essays in Ancient\nEthics, Epistemology, and Logic</em>, Mi-Kyoung (Mitzi) Lee (ed.), New\nYork: Oxford University Press, pp. 332–355.</li>\n<li>Brittain, C. and J. Palmer, 2001, “The New Academy’s\nAppeals to the Presocratics,” <em>Phronesis</em>, 46:\n38–72.</li>\n<li>Broughton, J., 2002, <em>Descartes’s Method of Doubt</em>,\nPrinceton: Princeton University Press.</li>\n<li>Brunschwig, J., 1988, “Sextus Empiricus on the\n<em>kritêrion</em>: the sceptic as conceptual legatee,” in\n<em>The Question of ‘Eclecticism’: Studies in Later Greek\nPhilosophy</em>, J. Dillon and A. Long (eds.), Berkeley: University of\nCalifornia Press, pp. 145–175.</li>\n<li>–––, 1990, “La formule <em>hoson epi\ntôi logôi</em> chez Sextus Empiricus,” in <em>Le\nScepticisme Antique</em>, <em>Cahier de la Revue de Théologie\net de Philosophie</em>, 15: 107–121, A.–J. Voelke (ed.);\nEnglish translation in J. Brunschwig, 1994, <em>Papers in Hellenistic\nPhilosophy</em>, Cambridge: Cambridge University Press, pp.\n244–258.</li>\n<li>Burnyeat, M. F., 1976, “Protagoras and Self-Refutation in\nLater Greek Philosophy,” <em>Philosophical Review</em>, 135:\n44–69.</li>\n<li>–––, 1978, “The Upside-Down Back-to-Front\nSceptic of Lucretius IV 472,” <em>Philologus</em>, 122:\n197–206.</li>\n<li>–––, 1980, “Can the sceptic live his\nscepticism?” in <em>Doubt and Dogmatism: Studies in Hellenistic\nEpistemology</em>, M. Schofield, M. Burnyeat and J. Barnes (eds.),\nOxford: Oxford University Press, pp. 20–53; reprinted in\nBurnyeat and Frede (eds.) 1997, pp. 25–57.</li>\n<li>–––, 1980b, “Tranquillity without a Stop:\nTimon, Frag. 68,” <em>Classical Quarterly</em>, 30:\n86–93.</li>\n<li>–––, 1980c, “Socrates and the Jury:\nParadoxes in Plato’s Distinction between Knowledge and True\nBelief, Part I,” <em>Proceedings of the Aristotelian\nSociety</em> (Supplement), 54: 173–191.</li>\n<li>–––, 1982, “Idealism and Greek Philosophy:\nWhat Descartes Saw and Berkeley Missed,” <em>Philosophical\nReview</em>, 91: 3–40.</li>\n<li>––– (ed.), 1983, <em>The Skeptical\nTradition</em>, Berkeley: University of California Press.</li>\n<li>–––, 1984, “The sceptic in his place and\ntime,” in <em>Philosophy in History</em>, R. Rorty, J.B.\nSchneewind, and Q. Skinner (eds.), Cambridge: Cambridge University\nPress, pp. 225–254; reprinted in Burnyeat and Frede (eds.),\n1997, pp. 92–126.</li>\n<li>–––, 2017, “All the World’s a\nStage-Painting: Scenery, Optics, and Greek Epistemology,”\n<em>Oxford Studies in Ancient Philosophy</em>, 52: 33–75.</li>\n<li>Burnyeat, M. and M. Frede (eds.), 1997, <em>The Original\nSceptics</em>, Indianapolis and Cambridge, Mass.: Hackett.</li>\n<li>Carriero, J., 2008, <em>Between Two Worlds: A Reading of\nDescartes’s Meditations</em>, Princeton: Princeton University\nPress.</li>\n<li>Castagnoli, L., 2000, “Self-Bracketing Pyrrhonism,”\n<em>Oxford Studies in Ancient Philosophy</em>, 18: 263–328.</li>\n<li>–––, 2010, <em>Ancient Self-Refutation: The\nLogic and History of the Self-Refutation Argument from Democritus to\nAugustine</em>, Cambridge: Cambridge University Press.</li>\n<li>Clayman, D., 2009, <em>Timon of Phlius: Pyrrhonism into\nPoetry</em>, Berlin: De Gruyter.</li>\n<li>Code, A., 2010, “Aristotle and the History of\nSkepticism,” in <em>Ancient Models of Mind: Studies in Human and\nDivine Rationality</em>, Andrea Nightingale and David Sedley (eds.),\nCambridge: Cambridge University Press, pp. 97–109.</li>\n<li>Cooper, J., 2002, “Method and Science in <em>On Ancient\nMedicine</em>,” in <em>Interpretation and Argument</em>, H.\nLinneweber-Lammerskitten and G. Mohr (eds.), Würzburg:\nKönigshausen und Neumann; reprinted in Cooper 2004a, pp.\n3–42.</li>\n<li>–––, 2004a, <em>Knowledge, Nature, and the Good:\nEssays on Ancient Philosophy</em>, Princeton: Princeton University\nPress.</li>\n<li>–––, 2004b, “Arcesilaus: Socratic and\nSceptic” in <em>Year of Socrates 2001—Proceedings</em>, V.\nKarasmanis (ed.), Athens: European Cultural Center of Delphi;\nreprinted in Cooper 2004a, pp. 81–103.</li>\n<li>–––, 2012, Pursuits of Wisdom: Six Ways of Life\nin Ancient Philosophy from Socrates to Plotinus, Princeton: Princeton\nUniversity Press.</li>\n<li>Corti, L., 2009, <em>Scepticisme et langage</em>, Paris:\nVrin.</li>\n<li>–––, 2010, “Scepticisme sans doute,”\nin ‘Quid est veritas?’ Hommage à Jonathan Barnes,\nA. Longo and M. Bonelli (eds.), Naples: Bibliopolis, pp.\n157–77.</li>\n<li>–––, 2011, “Skepticism and Hypothetical\nMethod,” <em>Elenchos: Argument from Hypothesis in Ancient\nPhilosophy</em>, Angela Longo and Davide del Forno (eds.), Naples:\nBibliopolis, pp. 281–302.</li>\n<li>–––, 2014, “Hidden Causes: Ancient\nSkeptics and Doctors and Modern Thinkers on the Perceivability of\nCausal Links,” in <em>Le débat sur les causes à\nl’âge hellénistique et imperial</em>, C. Natali and\nC. Viano (eds.), Louvain-la-Neuve, Peeters, pp. 95–117.</li>\n<li>–––, 2015, “DL IX 74–77: Mind and\nLanguage of the Laërtian Pyrrhonist,” in K. Vogt (ed.), pp.\n123–145.</li>\n<li>–––, 2015b, “Scepticism, number and\nappearances: the\nἀριθμητικὴ\nτέχνη and Sextus’ targets in M I-VI,”\n<em>Philosophie Antique</em>, 15: 123–147.</li>\n<li>–––, 2015c, “Sextus, the number two and\nthe Phaedo,” in <em>Ancient Readings of Plato’s\nPhaedo</em>, S. Delcomminette et al. (eds.), Leiden: Brill, pp.\n90–106.</li>\n<li>Couissin, P., 1983, “The Stoicism of the New Academy,”\nin Burnyeat (ed.) 1983, pp. 31–63. Translation of Couissin 1929,\n“Le stoicisme de la nouvelle Academie,” <em>Revue\nd’historie de la philosophie</em>, 3: 241–76.</li>\n<li>Everson, S., 1990, “Epicurus on the Truth of the\nSenses,” in <em>Epistemology: Companions to Ancient Thought\n1</em>, S. Everson (ed.), Cambridge: Cambridge University Press, pp.\n161–83.</li>\n<li>–––, 1990, <em>Epistemology: Companions to\nAncient Thought 1</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1991, “The Objective Appearance of\nPyrhonism,” <em>Psychology</em>: <em>Companions to Ancient\nThought 2</em>, in S. Everson (ed.), Cambridge: Cambridge University\nPress, pp. 121–147.</li>\n<li>Feeney, M. and S. Schellenberg, 2020, “Bayesian\nLiberalism,” in: <em>Epistemology After Sextus Empiricus</em>,\nJ. Vlasits and K. Vogt (eds.), New York: Oxford University Press, pp.\n75–88.</li>\n<li>Fine, G., 2000a, “Sceptical Dogmata: <em>Outlines of\nPyrrhonism I 13</em>,” <em>Methexis</em>, 13: 81–105.</li>\n<li>–––, 2000b, “Descartes and Ancient\nSkepticism: Reheated Cabbage?”, <em>Philosophical Review</em>,\n109: 195–234.</li>\n<li>–––, 2003a, “Subjectivity, Ancient and\nModern: The Cyrenaics, Sextus, and Descartes,” in\n<em>Hellenistic and Early Modern Philosophy</em>, J. Miller and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n192–231.</li>\n<li>–––, 2003b, “Sextus and External World\nScepticism,” <em>Oxford Studies in Ancient Philosophy</em>, 23:\n341–385.</li>\n<li>–––, 2008, “Does Socrates Claim To Know\nThat He Knows Nothing?”, <em>Oxford Studies in Ancient\nPhilosophy</em>, 35: 49–88.</li>\n<li>–––, 2011, “Concepts and inquiry: Sextus\nand the Epicureans,” in <em>Episteme, etc.: Essays in Honour of\nJonathan Barnes</em>, Ben Morison and Katerina Ierodiakonou (eds.),\nOxford: Oxford University Press, pp. 90–113.</li>\n<li>–––, 2014, <em>The Possibility of Inquiry:\nMeno’s Paradox from Socrates to Sextus</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2021, <em>Essays in Ancient\nEpistemology</em>, Oxford: Oxford University Press.</li>\n<li>Frede, M., 1979, “Des Skeptikers Meinungen,” <em>Neue\nHefte für Philosophie</em>, 15/16: 102–29; reprinted as\n“The Sceptic’s Beliefs,” in Burnyeat and Frede\n(eds.) 1997, pp. 1–24.</li>\n<li>–––, 1983, “Stoics and Sceptics on clear\nand distinct impressions,” in M. Burnyeat (ed.) 1983, pp.\n65–94.</li>\n<li>–––, 1984, “The Sceptic’s Two Kinds\nof Assent and the Question of the Possibility of Knowledge” in\n<em>Philosophy in History</em>, R. Rorty, J.B. Schneewind, and Q.\nSkinner (eds.), <em>Philosophy in History</em>, Cambridge: Cambridge\nUniversity Press, pp. 255–78; reprinted in Burnyeat and Frede\n(eds.) 1997, pp. 127–151.</li>\n<li>–––, 1990, “An Empiricist View of\nKnowledge: Memorism,” in S. Everson (ed.) 1990, pp.\n225–250.</li>\n<li>–––, 1994, “The Stoic Conception of\nReason,” in <em>Hellenistic Philosophy</em> (Volume 2), K. J.\nBoudouris (ed.), Athens: International Center for Greek Philosophy,\npp. 50–61.</li>\n<li>–––, 1996, “Introduction,” in\n<em>Rationality in Greek Thought</em>, M. Frede and G. Striker (eds.),\nOxford: Oxford University Press, pp. 1–28.</li>\n<li>–––, 1997, “The sceptics,” in\n<em>Routledge History of Philosophy. Volume II. From Aristotle to\nAugustine</em>, D. Furley (ed.), London: Routledge, pp.\n253–86.</li>\n<li>–––, 1999, “Stoic Epistemology,” in\nAlgra <em>et al</em>. (eds.) 1999, pp. 295–322.</li>\n<li>–––, 2008, “Aristotle on Thinking,”\n<em>Rhizai: A Journal for Ancient Philosophy and Science</em>, 2:\n287–301.</li>\n<li>Flintoff, E., 1980, “Pyrrho and India,”\n<em>Phronesis</em>, 25: 88–108.</li>\n<li>Garrett, D., 2020, “Pyrrhonian Skepticism and Humean\nSkepticism: Belief, Evidence, and Causal Power,” in\n<em>Epistemology After Sextus Empiricus</em>, K. M. Vogt and J.\nVlasits (eds.), New York: Oxford University Press, 213–236.</li>\n<li>Glidden, D. K., 1983, “Skeptic Semiotics,”\n<em>Phronesis</em>, 28: 213–255.</li>\n<li>Glüer, K., 2020, “Illusory Looks,” in\n<em>Epistemology After Sextus Empiricus</em>, J. Vlasits and K. Vogt\n(eds.), New York: Oxford University Press, pp. 48–74.</li>\n<li>González Quintero, C., 2022, <em>Academic Skepticism in\nHume and Kant</em>, Cham: Springer International Publishing.</li>\n<li>Grgic, F., 2006, “Sextus Empiricus on the Goal of\nSkepticism,” <em>Ancient Philosophy</em>, 26: 141–60.</li>\n<li>Hankinson, R.J., 1987, “Causes and Empiricism: A Problem in\nthe Interpretation of Later Greek Medical Method,”\n<em>Phronesis</em>, 32: 329–48.</li>\n<li>––– (ed.), 1988, <em>Method, Medicine and\nMetaphysics: Studies in the Philosophy of Ancient Science</em>,\n<em>Apeiron</em>, XXI (2).</li>\n<li>–––, 1994, “Values, objectivity and\ndialectic: the sceptical attack on ethics; its methods, aims and\nsuccess,” <em>Phronesis</em>, 49: 45–6.</li>\n<li>–––, 1995, <em>The Sceptics</em>, London:\nRoutledge.</li>\n<li>–––, 2003, “Stoic Epistemology,” in\nB. Inwood (ed.) 2003, pp. 59–84.</li>\n<li>–––, 2010, “Aenesidemus and the Rebirth of\nPyrrhonism,” in Bett (ed.) 2010, pp. 105–119.</li>\n<li>Hanner, O. (ed.), 2020, <em>Buddhism and Scepticism:\nHistorical, Philosophical, and Comparative\nPerspectives</em>, Freiburg/Bochum: Project Verlag.  </li>\n<li>Heck, P., 2014, <em>Skepticism in Classical Islam: Moments of\nConfusion</em>, London: Routledge.</li>\n<li>House, D.K., 1980, “The Life of Sextus Empiricus,”\n<em>Classical Quarterly</em>, 30: 227–238.</li>\n<li>Inwood, B., 1985, <em>Ethics and Human Action in Early\nStoicism</em>, Oxford: Oxford University Press.</li>\n<li>––– (ed.), 2003, <em>Cambridge Companion to the\nStoics</em>, Cambridge: Cambridge University Press.</li>\n<li>Inwood, B. and J. Mansfeld (eds.), 1997, <em>Assent and\nArgument</em> (Studies in Cicero’s Academic Books),\n<em>Proceedings of the Seventh Symposium Hellenisticum</em>, Leiden:\nBrill.</li>\n<li>Irwin, T. (ed.), 1995, <em>Classical Philosophy: Collected\nPapers</em>, 8 volumes, New York: Garland.</li>\n<li>Janácek, K., 1948, <em>Prolegomena to Sextus\nEmpiricus</em>, Olomouc: Nákladem Palackého\nUniversity.</li>\n<li>Janácek, K., 1972, <em>Sextus Empiricus’ Sceptical\nMethods</em>, Prague: Universita Karlova.</li>\n<li>Johnson, B., 2001, “On the coherence of Pyrrhonian\nSkepticism,” <em>The Philosophical Review</em>, 110:\n521–61.</li>\n<li>Kirwan, C., 1983, “Augustine Against the Skeptics,” in\nBurnyeat (ed.) 1983, pp. 205–223.</li>\n<li>Kukkonen, T., 2009, “Al-Ghazali’s Skepticism\nRevisited,”, in <em>A History of Skepticism in the Middle\nAges</em>, Lagerlund (ed.), Leiden: Brill, pp. 29–59.</li>\n<li>Lagerlund, H. (ed.), 2009, <em>A History of Skepticism in the\nMiddle Ages</em>, Leiden: Brill.</li>\n<li>Lagerlund, H., 2009, “Introduction,”, in <em>A History\nof Skepticism in the Middle Ages</em>, Lagerlund (ed.), Leiden: Brill,\npp.1–28.</li>\n<li>–––, 2020, <em>Skepticism in Philosophy: A\nComprehensive, Historical Introduction</em>, New York:\nRoutledge. </li>\n<li>Lee, M., 2005, <em>Epistemology after Protagoras: Responses to\nRelativism in Plato, Aristotle, and Democritus</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2010, “Antecedents in Early Greek\nPhilosophy,” in Bett (ed.) 2010, pp. 13–35.</li>\n<li>Lesher, J. H., 1999, “Early Interest in Knowledge,” in\n<em>Cambridge Companion to Early Greek Philosophy</em>, A. A. Long\n(ed.), Cambridge: Cambridge University Press, pp. 225–249.</li>\n<li>Lévy, C., 2010, “The Sceptical Academy: Decline and\nAfterlife,” in Bett (ed.) 2010, pp. 81–104.</li>\n<li>Long, A. A., 2006, <em>From Epicurus to Epictetus: Studies in\nHellenistic and Roman Philosophy</em>, Oxford: Oxford University\nPress.</li>\n<li>Machuca, D. E., 2006, “The Pyrrhonist’s\n<em>ataraxia</em> and <em>philanthrôpia</em>,” <em>Ancient\nPhilosophy</em>, 26: 111–139.</li>\n<li>–––, D. E., 2019, “Sources of Doxastic\nDisturbance in Sextus Empiricus” <em>Oxford Studies in Ancient\nPhilosophy</em>, 56: 193–214.</li>\n<li>–––, D. E., 2022, <em>Pyrrhonism Past and\nPresent: Inquiry, Disagreement, Self-Knowledge, and Rationality</em>,\nCham: Springer International Press. </li>\n<li>Machuca, D. and Reed, B., 2018, <em>Skepticism: From Antiquity to\nthe Present</em>, London: Bloomsbury.</li>\n<li>Machek, D. and Veres, M., 2021),\n“Expert Impressions in Stoicism,” <em>Archiv für\nGeschichte der Philosophie</em>. doi:10.1515/agph-2021-0038</li>\n<li>Malink, M., 2020, “Hypothetical Syllogisms and Infinite\nRegress,” in <em>Epistemology after Sextus Empiricus</em>, K.\nVogt and J. Vlasits (eds.), New York: Oxford University Press, pp.\n129–151.</li>\n<li>Marchand, S., 2015, “Sextus Empiricus: les effets politiques\nde la suspension du jugement” <em>Elenchos: Rivista di studi sul\npensiero antico</em>, 35 (2): 311–342.</li>\n<li>–––, 2021, “Pyrrhonism and the Value of\nLaw,” <em>Polis: The Journal for Ancient Greek and Roman\nPolitical Thought</em>, 38 (3): 573–587.</li>\n<li>McPherran, M., 1987, “Sceptical Homeopathy and\nSelf-Refutation,” <em>Phronesis</em>, 32: 290–328.</li>\n<li>McPherran, M., 1989, “<em>Ataraxia</em> and\n<em>Eudaimonia</em> in Ancient Pyrrhonism: Is the Sceptic Really\nHappy?,” in <em>Proceedings of the Boston Area Colloquium in\nAncient Philosophy</em>, J. J. Cleary and D. C. Shartin (eds.), pp.\n135–171.</li>\n<li>McPherran, M., 1990, “Pyrrhonism’s Arguments against\nValue,” <em>Philosophical Studies</em>, 60: 127–142.</li>\n<li>Menn, S., 1998, <em>Descartes and Augustine</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2003, “The Discourse on the Method\nand the Tradition of Intellectual Autobiography,” in\n<em>Hellenistic and Early Modern Philosophy</em>, J. Miller and B.\nInwood (eds.), Cambridge: Cambridge University Press, pp.\n141–191.</li>\n<li>Mill, E., 2018, <em>Three Pillars of Skepticism in Classical\nIndia: Nāgārjuna, Jayarāśi, and Śrī\nHarṣa</em>, Lanham: Lexington Books.</li>\n<li>Morison, B., 2011, “The Logical Structure of the\nSceptic’s Opposition,” in Allen, Emilsson, Morison and\nMann (eds.), <em>Essays in Memory of Michael Frede</em>, <em>Oxford\nStudies in Ancient Philosophy</em>, 40: 265–295.</li>\n<li>–––,  2018, “The Sceptic’s\nModes of Argumentation,” in <em>Dialectic after Plato and\nAristotle</em> (Proceedings of the 2013 Symposium Hellenisticum), T.\nBénatouïl and K. Ierodiakonou (eds.), Cambridge: Cambridge\nUniversity Press, pp. 283–317.</li>\n<li>Moss, J. and W. Schwab, 2019, “The Birth of Belief,”\n<em>Journal of the History of Philosophy</em>, 57 (1): \n1–32.</li>\n<li>Nawar, T. 2014, “The Stoic Account of Apprehension,”\n<em>Philosophers’ Imprint</em>, 14 (29), \n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.029\" target=\"other\">Nawar 2014 available online</a>].</li>\n<li>–––, 2017, “The Stoics on Identity,\nIdentiﬁcation, and Peculiar\nQualities,” <em>Proceedings of the Boston Area Colloquium\nof Ancient Philosophy</em>, 32 (1): 113–59.</li>\n<li>–––, 2019, “Augustine’s Defense of\nKnowledge against the Skeptics,” O<em>xford Studies in\nAncient Philosophy</em>,  56: 215–65.</li>\n<li>Nussbaum, M., 1994, “Sceptic Purgatives: Disturbance and the\nLife Without Belief,” in <em>The Therapy of Desire: Theory and\nPractice in Hellenistic Ethics</em>, M. Nussbaum, Princeton: Princeton\nUniversity Press, pp. 280–315.</li>\n<li>Obdrzalek, S., 2006, “Living in Doubt: Carneades’\n<em>Pithanon</em> Reconsidered,” <em>Oxford Studies in Ancient\nPhilosophy</em>, 31: 243–80.</li>\n<li>–––, 2013, “From Skepticism to\nParalysis,” <em>Ancient Philosophy</em>, 32 (2):\n369–392.</li>\n<li>Olfert, C., 2015, “Skeptical Investigation and its\nPerks,” in <em>Diogenes Laertius’s Lives of Philosophers\nIX.61–161</em>, Katja Vogt (ed.), SAPERE series by Mohr Siebeck,\npp. 147–170.</li>\n<li>–––, forthcoming, “Pyrrhonian Skepticism\non Gender and Virtue,” in <em>The Routledge Handbook of\nWomen and Ancient Greek Philosophy</em>, Sara Brill and Catherine\nMcKeen (eds.).</li>\n<li>Pagin, P., 2020, “The Force of Assumptions and\nSelf-Attributions,” in: <em>Epistemology After Sextus\nEmpiricus</em>, K. Vogt and J. Vlasits (eds.), New York: Oxford\nUniversity Press, pp. 116–128.</li>\n<li>Palmer, J., 2000, “Skeptical Investigation,”\n<em>Ancient Philosophy</em>, 20: 351–73.</li>\n<li>Pellegrin, P., 2010, “Sextus Empiricus,” in Bett (ed.)\n2010, pp. 120–142.</li>\n<li>Perin, C., 2006, “Pyrrhonian Scepticism and the Search for\nTruth,” <em>Oxford Studies in Ancient Philosophy</em>, 30:\n337–360.</li>\n<li>–––, 2013, “Making Sense of\nArcesilaus,” <em>Oxford Studies in Ancient Philosophy</em>, 45:\n313–338.</li>\n<li>Powell, J. G. F., 2013, “The Embassy of the Three\nPhilosophers to Rome in 155 bc,” in: <em>Hellenistic Oratory:\nContinuity and Change</em>, Christos Kremmydas and Kathryn Tempest\n(eds.), Oxford: Oxford University Press, pp. 219–247.</li>\n<li>Powers, N., 2010, “The System of the Sceptical Modes in\nSextus Empiricus,” <em>Apeiron</em>, 43: 157–171.</li>\n<li>Ricken, F., 1984, <em>Antike Skeptiker</em>, Munich: Beck\nVerlag.</li>\n<li>Sassi, M. M., 2011, “Senofane Fra I Sofisti. Dai Limiti\nDella Conoscenza (21B34 DK),” <em>Methexis</em>, 24:\n7–20.</li>\n<li>Schmitt, J., forthcoming, “Sextus versus Galen on\nSophisms,” in <em>Sextus’ Logic in Context</em>, M. Veres\nand J. Vlasits (eds.), Cambridge: Cambridge University Press.</li>\n<li>Schofield, M., M. Burnyeat, and J. Barnes (eds.), 1980, <em>Doubt\nand Dogmatism: Studies in Hellenistic Epistemology</em>, Oxford:\nOxford University Press.</li>\n<li>Schwab, W., 2016, “Understanding Episteme in Plato’s\n<em>Republic</em>,” in <em>Oxford Studies in Ancient\nPhilosophy</em>, 51: 41–85.</li>\n<li>–––, 2020, “Skeptical Defenses Against the\nInaction Objection,” in Kelly Arenson (ed.), <em>The Routledge\nHandbook of Hellenistic Philosophy</em>, London: Routledge,\npp. 184–198.</li>\n<li>Sedley, D. N., 1982, “The Stoic Criterion of\nIdentity,” <em>Phronesis</em>, 27 (3): 255–275.</li>\n<li>–––, 1983, “The Motivation of Greek\nSkepticism,” in Burnyeat (ed.) 1983, pp. 9–29.</li>\n<li>–––, 2002, “Zeno’s Deﬁnition\nof Phantasia Kataleptike,” in: <em>The Philosophy of\nZeno</em>, T. Scaltsas and A. S. Mason (eds.), Larnaca: The\nMunicipality of Larnaca, pp. 133–54.</li>\n<li>–––, 2015, “Diogenes Laertius on the Ten\nPyrrhonist Modes,” in K. Vogt (ed.), pp. 171–185.</li>\n<li>Shogry, S., 2018, “Creating a Mind Fit for Truth: the Stoic\nAccount of the Kataleptic Impression,” <em>Ancient\nPhilosophy</em>, 38 (2): 357–81.</li>\n<li>–––, 2019, “What Do Our Impressions Say?\nThe Stoic Theory of Perceptual Content and Belief Formation,”\n<em>Apeiron</em>, 52 (1): 29–63.</li>\n<li>–––, 2021, “The Stoic Appeal to\nExpertise: Platonic Echoes in the Reply to\nIndistinguishability,” <em>Apeiron</em>, 54 (2):\n129–59.</li>\n<li>Sienkiewicz, S., 2019, <em>Five Modes of Scepticism: Sextus\nEmpiricus and the Agrippan Modes</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2021. “The Sceptic’s Art:\nVarieties of Expertise in Sextus Empiricus,” in Productive\nKnowledge in Ancient Philosophy, T. Johansen (ed.), Cambridge:\nCambridge University Press, pp. 226–244.</li>\n<li>–––, 2022, “Proof Against Proof: A reading\nof Sextus Empiricus’ Against the Logicians 8. 463–\n81” <em>Oxford Studies in Ancient Philosophy</em>, 61 Winter\n2021 (delayed publication in 2022)</li>\n<li>Sihvola, J. (ed.), 2000, <em>Ancient Scepticism and the Sceptical\nTradition</em> (Acta Philosophica Fennica, Volume 66), Helsinki:\nAcademic Bookstore.</li>\n<li>Smith, P. J., 2022, <em>Sextus Empiricus’ Neo-Pyrrhonism:\nSkepticism as a Rationally Ordered Experience</em>, Cham: Springer,\nSynthese Library.</li>\n<li>Sorensen, R., 2004, “Commercial Applications of\nSkepticism” in <em>Pyrrhonian Scepticism</em>, W.\nSinnott-Armstrong (ed.), New York: Oxford University Press, pp.\n208–32.</li>\n<li>Striker, G., 1974, “<em>Kritêrion tês\nalêtheias</em>,” <em>Nachrichten der Akademie der\nWissenschaften</em> <em>zu Gottingen</em>, I. Phil.-hist. Klasse 2:\n48–110; reprinted in Striker 1996, pp. 22–76.</li>\n<li>–––, 1980, “Sceptical Strategies,”\nin Schofield <em>et al</em>. (eds.) 1980, pp. 54–83; reprinted\nin Striker 1996, pp. 92–115.</li>\n<li>–––, 1981, “Über den Unterschied\nzwischen den Pyrrhoneern und den Akademikern,”\n<em>Phronesis</em>, 26: 353–69; English translation in Striker\n1996, pp. 135–149.</li>\n<li>–––, 1983, “The Ten Tropes of\nAenesidemus,” in Burnyeat (ed.) 1983, pp. 95–115.</li>\n<li>–––, 1990, “The Problem of the\nCriterion,” in Everson (ed.) 1990, pp. 143–60.</li>\n<li>–––, 1990, “<em>Ataraxia</em>: Happiness\nas Tranquillity,” <em>Monist</em>, 73: 97–110; reprinted\nin Striker 1996, pp. 183–95.</li>\n<li>–––, 1996, <em>Essays on Hellenistic\nEpistemology and Ethics</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1996, “<em>Ataraxia</em>: Happiness\nas Tranquillity,” in Striker 1996, pp. 183–195.</li>\n<li>–––, 2001, “Scepticism as a Kind of\nPhilosophy,” <em>Archiv für Geschichte der\nPhilosophie</em>, 83: 113–129.</li>\n<li>–––, 2004, “Historical Reflections on\nClassical Pyrrhonism and Neo-Pyrrhonism,” in Sinnott-Armstrong\n(ed.) 2004, pp. 13–24.</li>\n<li>–––, 2010, “Academics Versus Pyrrhonists,\nReconsidered,” in Bett (ed.) 2010, pp. 195–207.</li>\n<li>Svavarsson, S. H., 2002, “Pyrrho’s Dogmatic\nNature,” <em>Classical Quarterly</em>, 52 (1):\n248–56.</li>\n<li>–––, 2004, “Pyrrho’s Undecidable\nNature,” <em>Oxford Studies in Ancient Philosophy</em>, 27:\n249–95.</li>\n<li>–––, 2010, “Pyrrho and Early\nPyrrhonism,” in Bett (ed.) 2010, pp. 36–57.</li>\n<li>–––, 2014, “Sextus Empiricus on\nPersuasiveness and Equipollence, ” in <em>Strategies of\nArgument: Essays in Ancient Ethics, Epistemology, and Logic</em>,\nMi-Kyoung (Mitzi) Lee (ed.), Oxford: Oxford University Press, pp.\n356–374.</li>\n<li>Taylor, C. C. W., 1980, “All Perceptions are True,” in\nSchofield <em>et al</em>. (eds.) 1980, pp. 105–24.</li>\n<li>Thorsrud, H., 2009, <em>Ancient Scepticism</em>, Berkeley:\nUniversity of California Press.</li>\n<li>–––, 2010, “Arcesilaus and\nCarneades,” in Bett (ed.) 2010, pp. 58–80.</li>\n<li>–––, 2018, “Arcesilaus: Socratic\nSkepticism in Plato's Academy” <em>Lexicon Philosophicum:\nInternational Journal for the History of Texts and Ideas</em>.\ndoi:10.19283/lph-2018.568</li>\n<li>–––, 2019, “Sextus Empiricus on the\nSiren Song of Reason and the Skeptical Defense of Ordinary\nLife,” <em>Logos and Episteme</em>, 10 (1): 15–29.</li>\n<li>Vasiliou, I., 2019, “Ancient Philosophy and Disjunctivism:\nThe Case of the Stoics,” in <em>New Issues in Epistemological\nDisjunctivism</em>, Casey Doyle, Joseph Milburn, and Duncan Pritchard\n(eds.), London and New York: Routledge, pp. 61–88.</li>\n<li>Veres, M., 2020a, “Sextus Empiricus on Religious\nDogmatism,” V. Caston (ed.), <em>Oxford Studies in Ancient\nPhilosophy</em>, 58: 239–280.</li>\n<li>–––, 2020b, “Keep Calm and Carry On:\nSextus Empiricus on the Origins of Pyrrhonism,” <em>History of\nPhilosophy and Logical Analysis</em>, 23 (1): 100–122.</li>\n<li>–––, 2021, “How to Resist Musical\nDogmatism: The Aim and Methods of Pyrrhonian Inquiry in Sextus\nEmpiricus' Against the Musicologists (Math. 6),” in: <em>Music\nand Philosophy in the Roman Empire</em>, F. Pelosi and F. M. Petrucci\n(eds.), Cambridge: Cambridge University Press, pp. 108–130.</li>\n<li>Vlasits, J., 2020a, “The First Riddle of Induction: Sextus\nEmpiricus and the Formal Learning Theorists” in Vogt and Vlasits\n(eds.), <em>Epistemology After Sextus Empiricus</em>, New York: Oxford\nUniversity Press, pp. 237–253.</li>\n<li>–––, 2020b, “Pyrrhonism and the\nDialectical Methods: The Aims and Argument of Outlines of Pyrrhonism\nII,” <em>History of Philosophy &amp; Logical Analysis</em>,\n23: 225–252. </li>\n<li>Vlasits, J. and K. M. Vogt (eds.), 2020, Epistemology After Sextus\nEmpiricus, New York: Oxford University Press.  </li>\n<li>Vogt, K., 1998, <em>Skepsis und Lebenspraxis</em>, Stuttgart:\nAlber Verlag.</li>\n<li>–––, 2008, <em>Law, Reason, and the Cosmic City:\nPolitical Philosophy in the Early Stoa</em>, New York: Oxford\nUniversity Press.</li>\n<li>–––, 2010, “Scepticism and Action,”\nin Bett (ed.) 2010, pp. 165–180.</li>\n<li>–––, 2012a, <em>Belief and Truth: A Skeptic\nReading of Plato</em>, New York: Oxford University Press.</li>\n<li>–––, 2012b, “Appearances and Assent:\nSkeptical Belief Reconsidered,” <em>Classical Quarterly</em>, 62:\n648–663.</li>\n<li>–––, 2013, “The Hellenistic\nAcademy,” in <em>Routledge Companion to Ancient Philosophy</em>,\nFrisbee Sheffield and James Warren (eds.), Routledge: New York and\nLondon, pp. 482–495.</li>\n<li>–––, 2015a, “From Investigation to Doubt:\nThe Beginnings of Modern Skepticism,” in <em>Roman Reflections:\nEssays on Latin Philosophy</em>, G. Williams and K. Volk (eds.),\nOxford: Oxford University Press, pp. 260–274.</li>\n<li>–––, 2017, “All Sense-Perceptions are\nTrue: Epicurean Responses to Skepticism and Relativism,” in\n<em>Lucretius and Modernity</em>, Jacques Lezra (ed.), London:\nPalgrave, pp. 145–159.</li>\n<li>–––, 2021, “No More This Than That:\nPyrrhonian Indeterminacy,” <em>Midwest Studies in Philosophy\nVolume</em>, 45: 57–76.</li>\n<li>–––, 2022, “Vagueness and Kataleptic\nImpressions,” <em>Proceedings of the\nAristotelian Society</em> (Supplement), XCVI:  165–183.</li>\n<li>Vogt, K. (ed.) (co-trans. and co-commentator), 2015,\n<em>Pyrrhonian Skepticism in Diogenes Laertius</em> (SAPERE: Volume\n25), Tübingen: Mohr Siebeck.</li>\n<li>Voelke, A.-J., 1990, “Soigner par le logos: La\nthérapeutique de Sextus Empiricus,” in A.-J. Voelke\n(ed.), <em>Le scepticisme antique: perspectives historiques et\nsystématiques</em>, <em>Cahiers de la Revue de Théologie\net de Philosophie</em>, 15: 181–92.</li>\n<li>Warren, J., 2015, “Precursors of Pyrrhonism: Diog. Laert.\n9.67–73,” in K. Vogt (ed.) 2015, pp. 105–121.</li>\n<li>Williams, M., 1988, “Skepticism without Theory,”\n<em>The Review of Metaphysics</em>, 41 (3): 547–588.</li>\n<li>–––, 2010, “Descartes’\nTransformation of the Sceptical Tradition,” in Bett (ed.) 2010,\npp. 288–313.</li>\n<li>Woodruff, P., 1986, “The sceptical side of Plato’s\nmethod,” <em>Revue Internationale de Philosophie</em>, 40:\n22–37.</li>\n<li>–––, 1988, “Aporetic Pyrrhonism”,\n<em>Oxford Studies in Ancient Philosophy</em>, 6: 139–68.</li>\n<li>–––, 2010, “The Pyrrhonian Modes,”\nin Bett (ed.) 2010, pp. 208–231.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Arcesilaus",
            "Aristotle",
            "Carneades",
            "moral skepticism",
            "perception: epistemological problems of",
            "Plato",
            "Pyrrho",
            "skepticism",
            "skepticism: medieval",
            "Stoicism",
            "Timon of Phlius"
        ],
        "entry_link": [
            {
                "../arcesilaus/": "Arcesilaus"
            },
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../carneades/": "Carneades"
            },
            {
                "../skepticism-moral/": "moral skepticism"
            },
            {
                "../perception-episprob/": "perception: epistemological problems of"
            },
            {
                "../plato/": "Plato"
            },
            {
                "../pyrrho/": "Pyrrho"
            },
            {
                "../skepticism/": "skepticism"
            },
            {
                "../skepticism-medieval/": "skepticism: medieval"
            },
            {
                "../stoicism/": "Stoicism"
            },
            {
                "../timon-phlius/": "Timon of Phlius"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=skepticism-ancient\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/skepticism-ancient/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=skepticism-ancient&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/skepticism-ancient/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=skepticism-ancient": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/skepticism-ancient/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=skepticism-ancient&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/skepticism-ancient/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Groarke, Leo, “Ancient Skepticism”, <em>Stanford\nEncyclopedia of Philosophy</em> (Spring 2009 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2009/entries/skepticism-ancient/\">https://plato.stanford.edu/archives/spr2009/entries/skepticism-ancient/</a>&gt;.\n [This was the previous entry on ancient skepticism in the\n<em>Stanford Encyclopedia of Philosophy</em> — see the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=skepticism-ancient\" target=\"other\">version history</a>.]",
            "Podcasts on ancient skepticism by Peter Adamson:\n\n <ul>\n<a href=\"http://www.historyofphilosophy.net/pyrrho\" target=\"other\">Beyond Belief: Pyrrho and Skepticism</a>\n<a href=\"http://www.historyofphilosophy.net/skeptics-academy\" target=\"other\">The Know Nothing Party: the Skeptical Academy</a>\n<a href=\"http://www.historyofphilosophy.net/sextus\" target=\"other\">Healthy Skepticism: Sextus Empiricus</a>\n</ul>\n",
            "<a href=\"http://www.historyofphilosophy.net/pyrrho\" target=\"other\">Beyond Belief: Pyrrho and Skepticism</a>",
            "<a href=\"http://www.historyofphilosophy.net/skeptics-academy\" target=\"other\">The Know Nothing Party: the Skeptical Academy</a>",
            "<a href=\"http://www.historyofphilosophy.net/sextus\" target=\"other\">Healthy Skepticism: Sextus Empiricus</a>"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/spr2009/entries/skepticism-ancient/": "https://plato.stanford.edu/archives/spr2009/entries/skepticism-ancient/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=skepticism-ancient": "version history"
            },
            {
                "http://www.historyofphilosophy.net/pyrrho": "Beyond Belief: Pyrrho and Skepticism"
            },
            {
                "http://www.historyofphilosophy.net/skeptics-academy": "The Know Nothing Party: the Skeptical Academy"
            },
            {
                "http://www.historyofphilosophy.net/sextus": "Healthy Skepticism: Sextus Empiricus"
            }
        ]
    }
}