{
    "url": "spacetime-holearg",
    "title": "The Hole Argument",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "John D. Norton\n<jdnorton+@pitt.edu>\nOliver Pooley\n<oliver.pooley@philosophy.ox.ac.uk>\nJames Read\n<james.read@philosophy.ox.ac.uk>",
        "author_links": [
            {
                "http://www.pitt.edu/~jdnorton/jdnorton.html": "John D. Norton"
            },
            {
                "mailto:jdnorton+%40pitt%2eedu": "jdnorton+@pitt.edu"
            },
            {
                "mailto:oliver%2epooley%40philosophy%2eox%2eac%2euk": "oliver.pooley@philosophy.ox.ac.uk"
            },
            {
                "http://users.ox.ac.uk/~orie2304/": "James Read"
            },
            {
                "mailto:james%2eread%40philosophy%2eox%2eac%2euk": "james.read@philosophy.ox.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://www.pitt.edu/~jdnorton/jdnorton.html\" target=\"other\">John D. Norton</a>\n&lt;<a href=\"mailto:jdnorton+%40pitt%2eedu\"><em>jdnorton+<abbr title=\" at \">@</abbr>pitt<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nOliver Pooley\n&lt;<a href=\"mailto:oliver%2epooley%40philosophy%2eox%2eac%2euk\"><em>oliver<abbr title=\" dot \">.</abbr>pooley<abbr title=\" at \">@</abbr>philosophy<abbr title=\" dot \">.</abbr>ox<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;<br/>\n<a href=\"http://users.ox.ac.uk/~orie2304/\" target=\"other\">James Read</a>\n&lt;<a href=\"mailto:james%2eread%40philosophy%2eox%2eac%2euk\"><em>james<abbr title=\" dot \">.</abbr>read<abbr title=\" at \">@</abbr>philosophy<abbr title=\" dot \">.</abbr>ox<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Feb 1, 1999",
        "substantive revision Tue Jun 6, 2023"
    ],
    "preamble": "\n\nWhat is space? What is time? Do they exist independently of the things\nand processes in them? Or is their existence parasitic on those things\nand processes? Are they like a canvas onto which an artist paints;\nthey exist whether or not the artist paints on them? Or are they akin\nto parenthood; there is no parenthood until there are parents and\nchildren? That is, is there no space and time until there are things\nwith spatial properties and processes with temporal durations?\n\nThese questions have long been debated and continue to be debated. The\nhole argument arose when these questions were asked in the context of\nmodern spacetime physics, and in particular in the context of\nEinstein’s general theory of relativity. In that context, space\nand time are fused into a single entity, spacetime, and we inquire\ninto its status. One view is that spacetime is a substance: a thing\nthat exists independently of the processes occurring within it. This\nis spacetime substantivalism. The hole argument seeks to show that\nthis viewpoint leads to unpalatable conclusions in a large class of\nspacetime theories. In particular, it seeks to show that spacetime\nsubstantivalism leads to a failure of determinism, meaning that a\ncomplete specification of the state of the universe at a given time,\nalongside the laws of nature of the theory under consideration (e.g.,\nthe laws of general relativity, which are Einstein’s field\nequations), fails to determine uniquely how the universe will evolve\nto the future. It also presents a verificationist dilemma, for it\nappears to lead to the unexpected conclusion that there are facts\nabout the world which we can never know. Although these problems\nare neither logically contradictory nor refuted by experience, many\nwould nevertheless regard them as being unpalatable.\n\nThereby, the hole argument provides a template for the analysis of\nwhat are known as ’gauge redundancies’ in physical\ntheories: i.e., the existence of surplus mathematical structure in\nsuch theories. We learn from it that the identification of surplus\nmathematical structure cannot be achieved by any a priori or purely\nmathematical rule. Some physical grounds are needed. In line with the\nabove, the hole argument provides two grounds that can be used: (i)\nverifiability—changes in the candidate surplus structure make no\ndifference to what can be verified in observation; and (ii)\ndeterminism—the laws of the theory are unable to fix the\ncandidate surplus structure.\n\nThe hole argument was invented for slightly different purposes by\nAlbert Einstein late in 1913 as part of his quest for the general\ntheory of relativity. It was revived and reformulated in the modern\ncontext by John3 = John Earman \\(\\times\\) John Stachel\n\\(\\times\\) John Norton.\n\nSee Stachel (2014) for a review that covers the historical aspects of\nthe hole argument and its significance in philosophy and physics. It\nis written at a technically more advanced level than this article. For\nanother recent review of the hole argument, see Pooley (2021).\n",
    "toc": [
        {
            "#ModeSpacTheoBegiGuid": "1. Modern Spacetime Theories: A Beginner’s Guide"
        },
        {
            "#FreeGeneCova": "2. The Freedom of General Covariance"
        },
        {
            "#PresInva": "3. The Preservation of Invariants"
        },
        {
            "#Inva": "3.1 Invariants"
        },
        {
            "#InvaObse": "3.2 Invariants and Observables"
        },
        {
            "#WhatReprSpac": "4. What Represents Spacetime?"
        },
        {
            "#PricSpacSubs": "5. The Price of Spacetime Substantivalism"
        },
        {
            "#UnhaCons": "6. Unhappy Consequences"
        },
        {
            "#HoleArguBrie": "7. The Hole Argument in Brief"
        },
        {
            "#HistHoleArgu": "8. The History of the Hole Argument"
        },
        {
            "#EinsFallHole": "8.1 Einstein Falls into the Hole…"
        },
        {
            "#HandClimOutAgai": "8.2 …and Climbs out Again"
        },
        {
            "#RespHoleArgu": "9. Responses to the Hole Argument"
        },
        {
            "#RejeSubs": "9.1 Reject substantivalism"
        },
        {
            "#AcceInde": "9.2 Accept the indeterminacy"
        },
        {
            "#MetrEsse": "9.3 Metric essentialism"
        },
        {
            "#SophSubs": "9.4 Sophisticated substantivalism"
        },
        {
            "#MathResp": "9.5 Mathematical/formalist responses"
        },
        {
            "#BroaSignHoleArgu": "10. Broader Significance of the Hole Argument"
        },
        {
            "#LimiScieReal": "10.1 A Limit to Scientific Realism"
        },
        {
            "#HoleArguQuanGrav": "10.2 The Hole Argument and the Quantization of Gravity"
        },
        {
            "#HoleArguGaugFree": "10.3 The Hole Argument and Gauge Freedoms"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Prep": "Preprints"
        },
        {
            "#OtheReso": "Other Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Modern Spacetime Theories: A Beginner’s Guide\n\nVirtually all modern spacetime theories are now built in the same way.\nThe theory posits a manifold of events and then assigns further\nstructures to those events to represent the content of spacetime. A\nstandard example is Einstein’s general theory of relativity. As\na host for the hole argument, we will pursue one of its best known\napplications, the expanding universes of modern relativistic\ncosmology.\n\nThis one example illustrates the core content of the hole argument.\nWith only a little further effort, the argument can be made more\nprecise and general. This will be done concurrently in these\n notes,[1]\n intended for readers with some background in differential geometry\nand general relativity.\n\nHere are the two basic building blocks of modern, relativistic\ncosmology: a manifold of events and the fields defined on it.\n\nManifold of Events. Consider our universe, which\nrelativistic cosmologies attempt to model. Its spacetime is the\nentirety of all space through all time. The events of this spacetime\nare generalizations of the dimensionless points of ordinary spatial\ngeometry. A geometric point in ordinary spatial geometry is just a\nparticular spot in the space and has no extension. Correspondingly, an\nevent in spacetime is a particular point in a cosmological space at a\nparticular moment of time.\n\nSo far, all we have defined is a set of events. To be a\nfour-dimensional manifold, the set of events must be a little bit more\norganized. In a real spacetime, we have the idea that each event sits\nin some local neighborhood of events; and this neighborhood sits\ninside a larger neighborhood of events; and so on. That extra\norganization comes from the requirement that we can label the events\nwith four numbers—or at least we can do this for any\nsufficiently small chunk of the manifold. These labels form coordinate\nsystems. The fact that four numbers are just sufficient to label the\nevents makes the manifold four-dimensional. We can now pick out\nneighborhoods of some event as the set of all points whose spacetime\ncoordinates differ from our starting event by at most one unit; or two\nunits; or three units; etc.. That gives us the nested neighborhoods of\nevents. Figure 1 illustrates how a set of events may be made into a\ntwo dimensional manifold by assigning “\\(x\\)” and\n“\\(y\\)” coordinates to the events.\n\n\n\nFigure 1. Forming a manifold of\nevents\n\n\nMetrical Structure and Matter Fields. In specifying\nthat events form a four dimensional manifold, there is still a lot we\nhave not said about the events. We have not specified which\nevents lie in the future and past of which other events, how much time\nelapses between these events, which events are simultaneous with\nothers so that they can form three dimensional spaces, what spatial\ndistances separates these events, and many more related\nproperties.\n\nThese additional properties are introduced by specifying the metric\nfield. To see how this field provides that information, imagine a\ncurve connecting a given pairs of events in spacetime. The information\nabout times elapsed and spatial distances is given by the times\nelapsed and distances along such curves. See Figure 2:\n\n\n\nFigure 2. The function of the metric\nfield.\n\n\nThat information could be supplied by a huge catalog that specifies\nthe spatial or temporal distance between pairs of events along curves\nconnecting them. Such a huge catalog would be massively redundant,\nhowever. If we know the distance from \\(A\\) to \\(B\\) and\nfrom \\(B\\) to \\(C\\) along some curve, then we know the\ndistance from \\(A\\) to \\(C\\) along that curve as well. The\nminimum information we need is the temporal and spatial distance\nbetween each event and all those (loosely speaking) infinitesimally\nclose to it. That information is what the metric field provides. It is\na “field” since that information belongs just to one\nevent. We can then piece together temporal and spatial distance along\nany curve just by summing all the distances between successive\ninfinitesimally close points along the curve. \n\nThe matter of the universe is represented by matter fields. The\nsimplest form of matter—the big lumps that make\ngalaxies—can be represented by worldlines that trace out the\nhistory of each galaxy through time. In standard models, the galaxies\nrecede from one another and this is represented by a spreading apart\nof the galactic worldlines as we proceed to later times. See Figure\n3:\n\n\n\nFigure 3. Galaxies in an expanding\nuniverse.\n\n2. The Freedom of General Covariance\n\nNewton’s first law states that force-free bodies move on\nstraight-line trajectories through spacetime. Clearly, this law as\nstated cannot be true in all coordinate systems, for imagine such a\nsystem accelerating with respect to one in which the law holds true:\nin the accelerating coordinate system, the force-free bodies will also\nappear to accelerate! So Newton’s first law is not—to use\na piece of terminology introduced by Einstein in his quest for the\ngeneral theory of relativity in the 1910s—‘generally\ncovariant’. When Einstein finally arrived at his completed\ntheory of general relativity in 1915, one of its novel features was\nits general covariance: unlike Newton’s first law in its\nformulation above, if the Einstein field equations of general\nrelativity hold in one coordinate system, then they hold true in all\ncoordinate systems related to that original system by smooth but\notherwise arbitrary transformations. General relativity was, indeed,\nthe first spacetime theory in which one was free to use arbitrary\nspacetime coordinate systems in this way. This feature is now shared\nby virtually all modern formulations of spacetime theories, including\nmodern versions of special relativity and (perhaps surprisingly!)\nNewtonian spacetime theory (on the latter, see e.g. Friedman\n(1983)).\n\nIn its original form, general covariance was understood\n“passively”; that is, as a freedom to describe structures\nin spacetime by means of arbitrarily chosen coordinate systems. That\nfreedom is closely related to another freedom, known as\n“active” general covariance. According to active general\ncovariance, we are licensed to spread structures like metric fields\nover the manifold in as many different ways as there are coordinate\ntransformations, and the resulting redistributions of said fields on\nthe manifold will preserve solutionhood of the theory under\nconsideration. Passive general covariance is not equivalent to active\ngeneral covariance defined in this way, for a theory can be passively\ngenerally covariant and yet arbitrary smooth redistributions of the\nfields on the manifold will in general fail to preserve solutionhood:\nthe details are not important here, but see Pooley (2017) for further\ndiscussion. (For a more extensive account of the relationship between\nactive and passive covariance, see also the supplementary document:\n Active and Passive Covariance.)[2]\n What is important is that every ‘local’ spacetime theory\n(to use terminology of Earman & Norton (1987)) is actively\ngenerally covariant, and so will be subject to a version of the hole\nargument—this includes both special relativity and certain\nformulations of Newtonian mechanics. (One view is that this goes too\nfar, and that general relativity is distinct from many other spacetime\ntheories in that its spacetime geometry has become dynamical and it is\nonly in such theories that the hole argument should be mounted: for\nfurther discussion, see Earman (1989, Ch.9, Section 5), Stachel\n(1993), and Iftime and Stachel (2006).)\n\nIn what follows, we’ll focus on active general covariance, which\nis indeed a property possessed by general relativity (as well as other\nlocal spacetime theories). The essential manipulation of the hole\nargument involves exercising this freedom. Figure 4 illustrates one\nway that we might spread the metrical structure and matter fields over\nthe manifold of spacetime events:\n\n\n\nFigure 4. One way to spread metric and\nmatter over the manifold.\n\n\nFigure 5 illustrates a second way:\n\n\n\nFigure 5. Another way to spread metric\nand matter over the manifold.\n\n\nWe shall call the transformation between the two spreadings a\n“hole transformation.” The dotted region is The Hole. The\nfirst distribution of metric and matter fields is transformed into the\nsecond in a way that\n\nleaves the fields unchanged outside the hole;\nwithin the hole they are spread differently;\nand the spreadings inside and outside the hole join\n smoothly.[3]\n\n\nImportantly, both the pre- and post-transformed states in Figure 5 are\nsolutions of Einstein’s field equations of general\nrelativity—meaning that they both represent possible ways for\nthe world to be, according to the theory.\n3. The Preservation of Invariants\n3.1 Invariants\n\nThe two different spreadings share one vital characteristic upon which\nthe hole argument depends: the two spreadings agree completely on all\ninvariant properties.\n\nThese invariant properties are, loosely speaking, the ones that are\nintrinsic to the geometry and dynamics, such as distance along spatial\ncurves and time along worldlines of galaxies, the rest mass of the\ngalaxy, the number of particles in it, as well as a host of other\nproperties, such as whether the spacetimes are metrically flat or\ncurved.\n\nThe invariant properties are distinguished from non-invariant\nproperties. Best known of the non-invariant properties are those\ndependent on a particular choice of coordinate system. For example,\njust one event in a two-dimensional Euclidean space lies at the origin\nof a coordinate system, that is, at \\(x=0,\\) \\(y=0\\). But\nwhich event that is changes when we change our coordinate system. So\n“being at the origin” is not an invariant. The spatial\ndistance between two points, however, is that same no matter which\ncoordinate system is used to describe the space. It is an\ninvariant.\n\nWhile the fields are spread differently in the two cases, they agree\nin all invariant properties; so, in invariant terms, they are the\nsame.\n3.2 Invariants and Observables\n\nThere is a special relationship between the invariants of a spacetime\ntheory and its observables, i.e. those quantities which are accessible\nto observational verification:\n\nAll observables can be reduced to invariants.\n\n\nFor example, if one makes a journey from one galaxy to another, all\nobservables pertinent to the trip will be invariants. These include\nthe time elapsed along the journey, whether the spaceship is\naccelerating or not at any time in its journey, the age of the galaxy\none leaves at the start of the trip and the age of the destination\ngalaxy at the end and all operations that may involve signaling with\nparticles or light pulses.\n\nTherefore, since the two spreadings or distributions of metric and\nmatter fields of a hole transformation agree on invariants, they also\nagree on all observables. They are observationally\nindistinguishable.\n4. What Represents Spacetime?\n\nRecall our original concern: we want to know whether we can conceive\nof spacetime as a substance—that is, as something that exists\nindependently of the material events which unfold within it. To do\nthis, we need to know what in the above structures represents\nspacetime. One popular answer to that question is that the manifold of\nevents represents spacetime. This choice is natural since modern\nspacetime theories are built up by first positing a manifold of events\nand then defining further structures on them. So, on a realist view of\nphysical theories on which they are to be understood\n‘literally’, it is very natural to regard the manifold as\nbeing an independently existing structure that bears properties, and\nwhich thereby plays the role of a container just as we expect that\nspacetime\n does.[4]\n\nOne might wonder whether some of the further structures defined on the\nmanifold represent further properties of spacetime rather than what is\ncontained within spacetime. In particular, the metric field contains\nimportant information on spatial distances and times elapsed. Ought\nthat not also to be considered a part of the containing spacetime as\nopposed to what is contained within spacetime?\n\nAgainst this line of thought, some would argue that general relativity\nmakes it hard to view the metric field simply as being part of the\ncontaining spacetime. For, in addition to spatial and temporal\ninformation, the metric field also represents the gravitational field.\nTherefore it also carries energy and momentum—the energy and\nmomentum of the gravitational field (although a notorious technical\nproblem in general relativity precludes identifying the energy and\nmomentum density of the gravitational field at any particular\nevent in spacetime). This energy and momentum is freely interchanged\nwith other matter fields in spacetimes. To carry energy and momentum\nis (the thought goes) a natural distinguishing characteristic of\nmatter contained within spacetime.\n\nSo, the metric field of general relativity seems to defy easy\ncharacterization. We would like it to be exclusively part of spacetime\nthe container, or exclusively part of matter the contained. Yet it\nseems to be part of both. But in any case, the crucial point to note\nhere (contrary to some historical writing on the hole argument) is\nthat one need not settle this issue in order to get the hole argument\noff the ground! As long as one is dealing with a theory which is\nactively generally covariant in the sense articulated above, the hole\nargument will rear its head, as we will now see.\n5. The Price of Spacetime Substantivalism\n\nSo far we have characterized the substantivalist doctrine as the view\nthat spacetime has an existence independent of its contents. This\nformulation conjures up powerful if vague intuitive pictures, but it\nis not clear enough to be deployed in the context of the\ninterpretation of physical theories. If we represent spacetime by a\nmanifold of events, how do we characterize the independence of its\nexistence? Is it the counterfactual claim that were there no metric or\nmatter fields, there would still be a manifold of events? That\ncounterfactual is automatically denied by the standard formulation\nwhich posits that all spacetimes have at least metrical structure.\nThat seems too cheap a refutation of manifold substantivalism. Surely,\nthere must be an improved formulation. Fortunately, we do not need to\nwrestle with finding it. For present purposes we need only consider a\nconsequence of the substantivalist view and can set aside the task of\ngiving a precise formulation of that view.\n\nIn their celebrated debate over space and time, Leibniz taunted the\nsubstantivalist Newton’s representative, Clarke, by asking how\nthe world would change if East and West were switched. For Leibniz\nthere would be no change since all spatial relations between bodies\nwould be preserved by such a switch. But the Newtonian substantivalist\nhad to concede that the bodies of the world were now located in\ndifferent spatial positions, so the two systems were physically\ndistinct.\n\nCorrespondingly, when we spread the metric and matter fields\ndifferently over a manifold of events, we are now assigning metrical\nand material properties in different ways to the events of the\nmanifold. For example, imagine that a galaxy passes through some event\nE in the hole. After the hole transformation, this galaxy might not\npass through that event. For the manifold substantivalist, this must\nbe a matter of objective physical fact: either the galaxy passes\nthrough E or not. The two distributions represent two physically\ndistinct possibilities.\n\n\n\nFigure 6. Does the galaxy pass through\nevent \\(E\\)?\n\n\nThat is, manifold substantivalists must (it seems) deny an equivalence\ninspired by Leibniz’ taunt which is thus named after\n him:[5]\n\nLeibniz Equivalence. If two distributions of fields\nare related by a smooth transformation, then they represent the same\nphysical systems.\n\n\nThe supplementary document\n Visualizing Leibniz Equivalence Through Map Projections\n illustrates the essential idea of Leibniz Equivalence through an\nanalogy with different map projections of the Earth’s\nsurface.\n6. Unhappy Consequences\n\nWe can now assemble the pieces above to generate unhappy consequences\nfor the manifold substantivalist. Consider the two distributions of\nmetric and material fields related by a hole transformation. Since the\nmanifold substantivalist denies Leibniz Equivalence, the\nsubstantivalist must hold that the two systems represent distinct\nphysical systems. But the properties that distinguish the two are very\nelusive. They escape both (a) observational verification and (b) the\ndetermining power of cosmological theory.\n\n(a) Observational verification. The substantivalist must\ninsist that it makes a physical difference whether the galaxy passes\nthrough event \\(E\\) or not. But we have already noticed that the\ntwo distributions are observationally equivalent: no observation can\ntell us if we are in a world in which the galaxy passes through event\n\\(E\\) or misses event \\(E\\).\n\nIt might be a little hard to see from Figure 6 that the two\ndistributions are observationally equivalent. In the first\ndistribution on the left, the middle galaxy moves in what looks like a\nstraight line and stays exactly at the spatial midpoint between the\ngalaxies on either side. In the second distribution on the right, all\nthat seems to be undone. The galaxy looks like it accelerates in\ntaking a swerve to the right, so that it moves closer to the galaxy on\nits right.\n\nThese differences that show up in the portrayal of Figure 6 are all\nnon-invariant differences. For the right hand distribution, the galaxy\ndoes veer to the right in the figure, but at the same time, distances\nbetween events get stretched as well, just as they get stretched in\nthe various map projections shown in the supplement,\n Visualizing Leibniz Equivalence Through Map Projections.\n So the galaxy always remains at the spatial midpoint of the galaxies\non either side; it just doesn’t look like it is at the spatial\nmidpoint from the way the figure is drawn.\n\nSimilarly, an acceleration vector along the galaxy’s worldline\ndetermines whether the galaxy is accelerating. That acceleration\nvector is an invariant. So, if the galaxy in the left hand\ndistribution has a zero acceleration vector, then the corresponding\ngalaxy in the right hand distribution will also have a zero\nacceleration vector. Remember, a hole transformation preserves\ninvariants. So if a galaxy is unaccelerated in the left hand\ndistribution, it is also unaccelerated in the right hand\ndistribution.\n\n(b) Determinism. The physical theory of relativistic\ncosmology is unable to pick between the two cases. This is manifested\nas an indeterminism of the theory. We can specify the distribution of\nmetric and material fields throughout the manifold of events,\nexcepting within the region designated as The Hole. Then the theory is\nunable to tell us how the fields will develop into The Hole. Both the\noriginal and the transformed distribution are legitimate extensions of\nthe metric and matter fields outside The Hole into The Hole, since\neach satisfies all the laws of the theory of relativistic cosmology.\nThe theory has no resources which allow us to insist that one only is\nadmissible.\n\nIt is important to see that the unhappy consequence does not consist\nmerely of a failure of determinism. We are all too familiar with such\nfailures and it is certainly not automatic grounds for dismissal of a\nphysical theory. The best known instance of a widely celebrated,\nindeterministic theory is quantum theory, where, in the standard\ninterpretation, the measurement of a system can lead to an\nindeterministic collapse onto one of many possible outcomes. Less well\nknown is that it is possible to devise indeterministic systems in\nclassical physics as well. Most examples involves oddities such as\nbodies materializing at unbounded speed from spatial infinity, so\ncalled “space invaders.” (Earman, 1986a, Ch. III; see also\n determinism: causal)\n Or they may arise through the interaction of infinitely many bodies\nin a supertask\n (Supertasks).\n More recently, an extremely simple example has emerged in which a\nsingle mass sits atop a dome and spontaneously sets itself into motion\nafter an arbitrary time delay and in an arbitrary direction (Norton,\n2003, Section 3).\n\nThe problem with the failure of determinism in the hole argument is\nnot the fact of failure but the way that it fails. If we deny manifold\nsubstantivalism and accept Leibniz Equivalence, then the indeterminism\ninduced by a hole transformation is eradicated. While there are\nuncountably many mathematically distinct developments of the fields\ninto the hole, under Leibniz Equivalence, they are all physically the\nsame. That is, there is a unique development of the physical fields\ninto the hole after all. Thus the indeterminism is a direct\nconsequence of the substantivalist’s metaphysical commitments.\nSimilarly, if we accept Leibniz Equivalence, then we are no longer\ntroubled that the two distributions cannot be distinguished by any\npossible observation. They are merely different mathematical\ndescriptions of the same physical reality and so should agree on all\nobservables.\n\nSo, the anti-substantivalist conclusion invited by the hole argument\nis this. We can load up any physical theory with objects or properties\n(here: spacetime events) that cannot be fixed by observation. If their\ninvisibility to observation is not already sufficient warning that\nthese properties are illegitimate, then finding that they visit\nindeterminism onto a theory that is otherwise deterministic ought to\nbe warning enough. Therefore, such objects or properties (again, here\nspacetime events) should be discarded along with any doctrine that\nrequires their retention.\n7. The Hole Argument in Brief\n\nIn sum, the hole argument amounts to\n this:[6]\n\nIf one has two distributions of metric and material fields related\nby a hole transformation, then manifold substantivalists must maintain\nthat the two systems represent two distinct physical systems (i.e.,\nthey must deny Leibniz Equivalence).\nThis physical distinctness transcends both observation and the\ndetermining power of the theory since:\n\n\nThe two distributions are observationally identical.\nThe laws of the theory cannot pick between the two developments of\nthe fields into the hole.\n \nTherefore, the manifold substantivalist advocates a problematic\nmetaphysics which should be discarded.\n\n8. The History of the Hole Argument\n8.1 Einstein Falls into the Hole…\n\nThe hole argument was created by Albert Einstein late in 1913 as an\nact of desperation when his quest for his general theory of relativity\nhad encountered what appeared to be insuperable obstacles. Over the\nprevious year, he had been determined to find a gravitation theory\nthat was generally covariant in the sense introduced above. He had\neven considered essentially the celebrated generally covariant\nequations he would settle upon in November 1915 and which now appear\nin all the textbooks.\n\nUnfortunately, Einstein had at least initially been unable to see that\nthese equations were admissible. Newton’s theory of gravitation\nworked virtually perfectly for weak gravitational fields. So it was\nessential that Einstein’s theory revert to Newton’s in\nthat case. But try as he might, Einstein could not see that his\nequations and many variants of them could properly mesh with\nNewton’s theory. In mid 1913 he published a compromise: a sketch\nof a relativistic theory of gravitation that was not generally\ncovariant. (For further details of these struggles, see Norton\n(1984).)\n\nHis failure to find an admissible generally covariant theory troubled\nEinstein greatly. Later in 1913 he sought to transform his failure\ninto a victory of sorts: he thought he could show that no generally\ncovariant theory at all is admissible. Any such theory would violate\nwhat he called the Law of Causality—we would now call it\ndeterminism. He sought to demonstrate this remarkable claim with the\nhole argument.\n\nIn its original incarnation, Einstein considered a spacetime filled\nwith matter excepting one region, the hole, which was matter-free. (So\nin this original form, the term “hole” makes more sense\nthan in the modern version.) He then asked if a full specification of\nboth metric and material fields outside the hole would fix the metric\nfield within. Since he had tacitly eschewed Leibniz Equivalence,\nEinstein thought that the resulting negative answer sufficient to damn\nall generally covariant theories.\n8.2 …and Climbs out Again\n\nEinstein struggled on for two years with his misshapen theory of\nlimited covariance. Late in 1915, as evidence of his errors mounted\ninexorably, Einstein was driven to near despair and ultimately\ncapitulation. He returned to the search for generally covariant\nequations with a new urgency, fueled in part by the knowledge that\nnone other than David Hilbert had thrown himself into analysis of his\ntheory. Einstein’s quest came to a happy close in late November\n1915 with the completion of his theory in generally covariant\nform.\n\nFor a long time it was thought that Hilbert had beaten Einstein by\nfive days to the final theory. New evidence in the form of the proof\npages of Hilbert’s paper now suggests he may not have. More\nimportantly, it shows clearly that Hilbert, like Einstein, at least\ntemporarily believed that the hole argument precluded all generally\ncovariant theories and that the belief survived at least as far as the\nproof pages of his paper. (See Corry, Renn and Stachel 1997.)\n\nWhile Einstein had tacitly withdrawn his objections to generally\ncovariant theories, he had not made public where he thought the hole\nargument failed. This he finally did when he published what John\nStachel calls the “point-coincidence argument.” This\nargument, well known from Einstein’s (1916, p.117) review of his\ngeneral theory of relativity, amounts to a defence of Leibniz\nEquivalence. He urges that the physical content of a theory is\nexhausted by the catalog of the spacetime coincidences it licenses.\nFor example, in a theory that treats particles only, the coincidences\nare the points of intersection of the particle worldlines. These\ncoincidences are preserved by transformations of the fields. Therefore\ntwo systems of fields that can be intertransformed have the same\nphysical content; they represent the same physical system.\n\nOver the years, the hole argument was deemed to be a trivial error by\nan otherwise insightful Einstein. It was John Stachel (1980) who\nrecognized its highly non-trivial character and brought this\nrealization to the modern community of historians and philosophers of\nphysics. (See also Stachel, 1986.) In Earman and Norton (1987), the\nargument was recast as one that explicitly targets spacetime\nsubstantivalism. For further historical discussion, see Howard and\nNorton (1993), Janssen (1999), Klein (1995) and Norton (1987). A\nthorough, synoptic treatment in four volumes is Renn (2007); for a\nhistory of the philosophical revival of the hole argument, see\nWeatherall (2020).\n\nFor an account of the appropriation and misappropriation of\nEinstein’s point-coincidence argument by the logical\nempiricists, see Giovanelli (2013).\n9. Responses to the Hole Argument\n\nThere are at least as many responses to the hole argument as authors\nwho have written on it. In this section, we regiment the literature by\nconsidering five broad classes of response to the argument since it\nwas revitalised in the philosophical literature of the 1980s. In the\ncourse of scrutinizing the argument, by now virtually all its aspects\nhave been weighed and tested.\n9.1 Reject substantivalism\n\nOne line of thought simply agrees that the hole argument makes\nacceptance of Leibniz Equivalence compelling. It seeks to make more\ntransparent what that acceptance involves by trying to find a single\nmathematical structure that represents a physical spacetime system\nrather than the equivalence class of intertransformable structures\nlicensed by Leibniz Equivalence. One such attempt involves the notion\nof a “Leibniz algebra” (see Earman, 1989, Ch. 9, Sect. 9).\nIt is unclear that such attempts can succeed. Just as\nintertransformable fields represent the same physical system, there\nare distinct but intertransformable Leibniz algebras with the same\nphysical import. If the formalisms of manifolds and of Leibniz\nalgebras are intertranslatable, one would expect the hole argument to\nreappear in the latter formalism as well under this translation. (See\nRynasiewicz, 1992.)\n\nAnother approach seeks to explain Leibniz Equivalence and demonstrate\nthe compatibility of general relativity with the hole argument through\nthe individuation of spacetime points by means of “Dirac\nobservables” and an associated gauge fixing stipulation (Lusanna\nand Pauri, 2006). More generally, we may well wonder whether the\nproblems faced by spacetime substantivalism are artifacts of the\nparticular formalism described above. Bain (1998, 2003) has explored\nthe effect of a transition to other formalisms (including but not\nlimited to Leibniz algebras).\n9.2 Accept the indeterminacy\n\nAn alternative response to the hole argument is to accept that\ngenerally covariant theories of space and time such as general\nrelativity are indeterministic. Perhaps (the thought goes) this\nindeterminism is not troubling, because it is an indeterminism only\nabout which objects instantiate which properties and not about which\npatterns of properties are instantiated. It is not obvious, however,\nthat this is sufficient to defuse worries about indeterminism: at the\nvery least, if another response to the argument were available, they\nwould seem to be preferable.\n\nA related response here is to redefine determinism, and to\nargue that, in the relevant sense, theories such as general relativity\nare deterministic after all, in spite of the hole argument.\nModifications to the definition of determinism in light of the hole\nargument have been explored by Belot (1995b), Brighouse (1994, 2020),\nButterfield (1989), Melia (1999), and Pooley (2021).\n9.3 Metric essentialism\n\nIn his own highly original response to the hole argument, Maudlin\n(1990) urges that each spacetime event carries its metrical properties\nessentially; that is, it would not be that very event if (after\nredistribution of the fields) we tried to assign different metrical\nproperties to it. As a result, although there appears to be a class of\ndistinct possible worlds associated with each class of\nintertransformable solutions of general relativity (or whatever other\nactively generally covariant theory in which one is interested), in\nfact only one such world is metaphysically possible, and thereby the\nhole argument is vitiated. Teitel (2019) has explored a refined\nversion of this essentialist response but concludes that it fails to\nimprove on standard modal responses to the hole argument. Butterfield\n(1989) portrays intertransformable systems as different possible\nworlds and uses counterpart theory to argue that at most one can\nrepresent an actual spacetime. (For an updated version of\nButterfield’s appeal to counterpart theory, see Butterfield\n& Gomes (2023a, 2023b).)\n9.4 Sophisticated substantivalism\n\nMaudlin’s metrical essentialism is an example of\n‘sophisticated substantivalism’. This term was\nintroduced—in a somewhat pejorative sense—by Belot &\nEarman (2001) to refer to a class of views according to which it is\nlegitimate after all for a substantivalist to deny that systems\nrelated by hole transformation represent distinct possibilities,\nthereby side-stepping the hole argument. Another version of\nsophisticated substantivalism is anti-haecceitist substantivalism,\naccording to which physical spacetime points do not possess\ntrans-world identities. The distinctness of worlds in which the\nmaterial content of the universe is shifted from its distribution in\nthe actual world presupposes such identities. Thus the apparent\nindeterminism of general relativity and other actively generally\ncovariant theories is avoided by denying such identities. This\nposition is currently a popular response to the hole argument: for\ndiscussion e.g. Hoefer (1996) and Pooley (2006b); for some concerns\nthat the position is metaphysically obscure, see Dasgupta (2011).\n\nAnother related version of sophisticated substantivalism has it that\nspacetime is better represented not by the manifold of events alone\nbut by some richer structure, such as the manifold of events in\nconjunction with metrical properties. (See, for example, Hoefer,\n1996.) What motivates this escape is the idea that the manifold of\nevents lacks properties essential to spacetime. For example, there is\nno notion of past and future, of time elapsed or of spatial distance\nin the manifold of events. Thus one might be tempted to identify\nspacetime with the manifold of events plus some further\nstructure that supplies these spatiotemporal notions. Thereby, the\nthought might go, it is the metrical structure which individuates\nspacetime points non-rigidly. This escape from the hole argument\nsometimes succeeds and sometimes fails. In certain important special\ncases, alternative versions of the hole argument can be mounted\nagainst the view: see Norton (1988).\n9.5 Mathematical/formalist responses\n\nPerhaps the simplest possible challenge to the hole argument maintains\nthat Leibniz Equivalence is a standard presumption in the modern\nmathematical physics literature and suggests that even entertaining\nits denial is a mathematical blunder unworthy of serious attention.\nBut in response: while acceptance of Leibniz Equivalence is widespread\nin the physics literature, it is not a logical truth that can\nonly be denied on pain of contradiction. That it embodies non-trivial\nassumptions whose import must be accepted with sober reflection is\nindicated by the early acceptance of the hole argument by none other\nthan David Hilbert himself. (See\n Section 8.2\n above.) If denial of Leibniz Equivalence is a blunder so egregious\nthat no competent mathematician would make it, then our standards for\ncompetence have become unattainably high, for they must exclude David\nHilbert in 1915 at the height of his powers.\n\nThe question has nevertheless been reopened recently by Weatherall\n(2018), who aargues that intertransformable mathematical structures\nare taken in standard mathematical practice to be the same structure.\nThus they should represent the same physical system, precluding the\ndenial of Leibniz Equivalence. Curiel (2018) argues for a similar\ntriviality conclusion as Weatherall but on a different basis: there is\nno physical correlate to the hole transformation in standard\nphysical practice. For a response to arguments of this kind, defending\nthe view that this kind of ‘mathematical structuralism’ is\ninsufficient to block the hole argument, see Pooley & Read (2021);\nlikewise, Roberts (2020) has responded that Nature—not\nmathematical practice—should decide whether two mathematical\nstructures represent the same physical system.\n\nRecently, some authors have argued that modifying the foundations of\nmathematics from the set-theoretic orthodoxy would be sufficient to\nblock the hole argument: see Ladyman & Presnell (2020) and\nDougherty (2020) for discussions of such arguments in the particular\ncontext of homotopy type theory. Separately, Halvorson and Manchak\n(2021) have argued that because there is a unique metric-preserving\nmap (‘isometry’) relating two solutions of general\nrelativity related by the hole transformation, the hole argument is\nthereby blocked; for sceptical responses to this argument, see Menon\n& Read (2023).\n\nBelot (2018) argues against a single decision univocally in favor or\ncontrary to Leibniz Equivalence. While allowing that hole\ntransformations relate systems that are physically the same, he argues\nthat in some sectors of general relativity, some transformations that\npreserve the metric may relate physically distinct systems.\n10. Broader Significance of the Hole Argument\n\nThe hole argument has had a broader significance in the philosophy of\nscience, pertaining inter alia to realism about theoretical\nentities, to theories of quantum gravity, and to the issue of gauge\nfreedoms in our physical theories. We discuss all three of these\nrelations in this section; there is also a supplementary document\nwhich expands upon the third. \n10.1 A Limit to Scientific Realism\n\nThe hole argument has presented a new sort of obstacle to the rise of\nscientific realism. According to that view, we should read the\nassertions of our mature theories literally. So, if general relativity\ndescribes a manifold of events and a metrical structure, then that is\nliterally what is there in the view of the strict scientific realist.\nTo think otherwise, it is asserted, would be to leave the success of\nthese theories an unexplained miracle. If spacetime does not really\nhave the geometrical structure attributed to it by general relativity,\nthen how can we explain the theory’s success?\n\nAppealing as this view is, the hole argument shows that some limits\nmust be placed on our literal reading of a successful theory. Or at\nleast that persistence in such literal readings comes with a high\nprice. The hole argument shows us that we might want to admit that\nthere is something a little less really there than the literal reading\nsays, lest we be forced to posit physically real properties that\ntranscend both observation and the determining power of our\ntheory.\n10.2 The Hole Argument and the Quantization of Gravity\n\nOne of the most tenacious problems in modern theoretical physics is\nthe quantization of gravity. While Einstein’s 1915 general\ntheory of relativity produced a revolutionary new way of thinking of\ngravitation in terms of the curvature of spacetime, it is generally\nagreed now that it cannot be the final account of gravity. The reason\nis that it is still a classical theory. It does not treat matter in\naccord with the quantum theory.\n\nThe problem of bringing quantum theory and general relativity together\nin a single theory remains unsolved. (See\n Quantum Gravity.)\n There are many contenders, notably string theory and loop quantum\ngravity. One of the issues that has been raised is that the hole\nargument has shown us (so goes the claim) that no successful theory of\nquantum gravity can be set against an independent, container\nspacetime. John Stachel was an early proponent of this outcome of the\nhole argument. See Stachel (2006). This issue has often been raised by\nloop quantum gravity theorists specifically as a criticism of string\ntheoretic approaches, for string theoretic approaches have such a\nbackground spacetime. See Rovelli and Gaul (2000) and Smolin (2006);\nfor philosophical engagement with these issues of “background\nindependence”, see Pooley (2017) and Read (2023).\n\nIn a related development, Gryb and Thébault (2016) have argued\nthat the problem of the hole argument and the “problem of\ntime” of quantum gravity are essentially the same, given\nsuitable assumptions. For more, see\n Problem of Time\n in the article on quantum gravity.\n10.3 The Hole Argument and Gauge Freedoms\n\nThe hole argument has played a role in the growing recognition in\nphilosophy of physics of the importance of gauge transformations:\ntransformations acting on certain degrees of freedom in our physical\ntheories which are supposed to have no correlates in physical reality.\nThe analysis of the hole argument provides philosophers of physics\nwith a convenient template when they are trying to decide whether or\nnot something is a gauge freedom. As mentioned in the introduction, we\nlearn from the hole argument that the identification of surplus\nmathematical structure cannot be achieved by any a priori or purely\nmathematical rule (at least on the assumption that the\nmathematical/formalist responses to the hole argument discussed above\ndo not succeed). Rather, some physical grounds are needed. The hole\nargument provides two grounds that can be used: (i)\nverifiability—changes in the candidate surplus structure make no\ndifference to what can be verified in observation; and (ii)\ndeterminism—the laws of the theory are unable to fix the\ncandidate surplus structure. For more detailed discussion on the hole\nargument and gauge freedoms, see the supplement\n The Hole Argument as a Template for Analyzing Gauge Freedoms.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Bain, Jonathan, 1998, <em>Representations of Spacetime: Formalism\nand Ontological Commitment</em>, Ph.D. Dissertation, Department of\nHistory and Philosophy of Science, University of Pittsburgh.",
                "–––, 2003, “Einstein Algebras and the Hole\nArgument,” <em>Philosophy of Science</em>, 70:\n1073–1085.",
                "Belot, Gordon, 1995a, “Indeterminism and Ontology,”\n<em>International Studies in the Philosophy of Science</em>, 9:\n85–101.",
                "–––, 1995b, “New Work for Counterpart\nTheorists”, <em>British Journal for the Philosophy of\nScience</em>, 46(2): 185–195.",
                "–––, 1996, <em>Whatever is Never and Nowhere is\nNot: Space, Time and Ontology in Classical and Quantum Gravity</em>\nPh. D. Dissertation, Department of Philosophy, University of\nPittsburgh.",
                "–––, 1996a, “Why General Relativity\n<em>Does</em> Need an Interpretation,” <em>Philosophy of\nScience</em>, 63 (Supplement): S80–S88.",
                "–––, 2018, “Fifty Million Elvis Fans\nCan’t be Wrong,” <em>Noûs</em>, 52:\n946–981.",
                "Belot, Gordon and Earman, John, 2001, “Pre-Socratic Quantum\nGravity”, in C. Callender and N. Huggett (eds.), <em>Physics\nMeets Philosophy at the Planck Scale</em>, Cambridge: Cambridge\nUniversity Press. pp. 213–255.",
                "Brighouse, Carolyn, 1994, “Spacetime and Holes,” in D.\nHull, M. Forbes and R. M. Burian (eds.), <em>PSA 1994</em>, Volume 1,\npp. 117–125.",
                "–––, 2020, “Confessions of a (Cheap)\nSophisticated Substantivalist”, <em>Foundations of Physics\n</em>, 50: 348–359.",
                "Butterfield, Jeremy, 1988, “Albert Einstein meets David\nLewis,” in A. Fine and J. Leplin (eds.), <em>PSA 1988</em>,\nVolume 2, pp. 56–64.",
                "–––, 1989, “The Hole Truth,”\n<em>British Journal for the Philosophy of Science</em>, 40:\n1–28.",
                "Brading, Katherine and Castellani, Elena (eds.), 2003,\n<em>Symmetries in Physics:Philosophical Reflections</em>, Cambridge:\nCambridge University Press, pp. 334–345.",
                "Corry, Leo, Renn, Juergen, and Stachel, John, 1997, “Belated\nDecision in the Hilbert-Einstein Priority Dispute,”\n<em>Science</em>, 278: 1270–73.",
                "Curiel, Erik, 2018, “On the Existence of Spacetime\nStructure,” <em>British Journal for the Philosophy of\nScience</em>, 69: 447–483.",
                "Dasgupta, Shamik, 2011, “The Bare Necessities”,\n<em>Philosophical Perspectives</em>, 25: 115–160.",
                "Dougherty, John, 2020, “The Hole Argument, Take\n\\(n\\)”, <em>Foundations of Physics</em>, 50:\n330–347.",
                "Earman, John, 1986, “Why Space is not a Substance (At Least\nNot to First Degree),” <em>Pacific Philosophical Quarterly</em>,\n67: 225–244.",
                "–––, 1986a, <em>A Primer on Determinism</em>,\nDordrecht: Reidel.",
                "–––, 1989, <em>World Enough and Space-Time:\nAbsolute Versus Relational Theories of Space and Time</em>, Cambridge,\nMA: MIT Bradford.",
                "–––, 2003, “Tracking down gauge: an ode to\nthe constrained Hamiltonian formalism”, in K. Brading and E.\nCastellani (eds.), <em>Symmetries in Physics: Philosophical\nReflections</em>, Cambridge: Cambridge University Press, pp.\n140–162.",
                "Earman, John and Norton, John D., 1987, “What Price\nSpacetime Substantivalism,” <em>British Journal for the\nPhilosophy of Science</em>, 38: 515–525.",
                "Einstein, Albert, 1916, “The Foundation of the General\nTheory of Relativity,” in H.A. Lorentz et al., <em>The Principle\nof Relativity</em>, New York: Dover, 1952, pp. 111–164.",
                "Friedman, Michael, 1983. <em>Foundations of Space-Time Theories:\nRelativistic Physics and Philosophy of Science, </em>Princeton, NJ:\nPrinceton University Press.",
                "Giovanelli, Marco, 2013 “Erich Kretschmann as a\nProto-Logical-Empiricist: Adventures and Misadventures of the\nPoint-Coincidence Argument,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 44: 115–134.",
                "Gomes, Henrique and Butterfield, Jeremy, 2023a, “The Hole\nArgument and Beyond, Part I: The Story so Far”.",
                "–––, 2023b, “The Hole Argument and Beyond,\nPart II: Treating Non-isomorphic Spacetimes”.",
                "Gryb, Sean and Thébault, Karim P. Y., 2016,\n“Regarding the ‘Hole Argument’ and the\n‘Problem of Time’,” <em>Philosophy of Science</em>,\n83: 563–584.",
                "Halvorson, Hans and Manchak, J.B., “Closing the Hole\nArgument”, <em>British Journal for the Philosophy of\nScience</em>, 2021.",
                "Healey, Richard, 1999, “On the Reality of Gauge\nPotentials,” <em>Philosophy of Science</em>, 68:\n432–55.",
                "Hoefer, Carl, 1996, “The Metaphysics of Space-Time\nSubstantivalism,” <em>Journal of Philosophy</em>, 93:\n5–27.",
                "Hoefer, Carl and Cartwright, Nancy, 1993, “Substantivalism\nand the Hole Argument,” in J. Earman <em>et al</em>. (eds.),\n<em>Philosophical Problems of the Internal and External Worlds: Essays\non the Philosophy of Adolf Gruenbaum</em>, Pittsburgh: University of\nPittsburgh Press/Konstanz: Universitaetsverlag Konstanz, pp.\n23–43.",
                "Howard, Don and Norton, John D., 1993, “Out of the\nLabyrinth? Einstein, Hertz and the Goettingen Answer to the Hole\nArgument,” in John Earman, Michel Janssen, John D. Norton\n(eds.), <em>The Attraction of Gravitation: New Studies in History of\nGeneral Relativity</em> Boston: Birkhäuser, pp. 30–62.",
                "Iftime, Mihaela and Stachel, John, 2006, “The Hole Argument\nfor Covariant Theories,” <em>General Relativity and\nGravitation</em>, 38: 1241–1252.",
                "Janssen, Michel, 1999, “Rotation as the Nemesis of\nEinstein’s ‘Entwurf’ Theory,” in Hubert\nGoenner <em>et al</em>. (eds.), <em>Einstein Studies: Volume 7. The\nExpanding Worlds of General Relativity</em>, Boston: Birkhaeuser, pp.\n127–157.",
                "Jammer, Max, 1993, <em>Concepts of Space: The History of Theories\nof Space in Physics</em>, third enlarged edition, New York: Dover,\nChapter 6. “Recent Developments.”",
                "Klein, Martin J. <em>et al</em>. (eds.), 1995, <em>The Collected\nPapers of Albert Einstein: Volume 4. The Swiss Years: Writing,\n1912–1914</em>, Princeton: Princeton University Press.",
                "Ladyman, James and Presnell, Stuart, 2020, “The Hole\nArgument in Homotopy Type Theory”, <em>Foundations of\nPhysics</em>, 50: 319–329.",
                "Lusanna, Luca and Pauri, Massimo, 2006 “Explaining Leibniz\nEquivalence as Difference of Non-inertial Appearances: Dis-solution of\nthe Hole Argument and Physical Individuation of Point-Events,”\n<em>Studies in History and Philosophy of Modern Physics</em>, 37:\n692–725",
                "Liu, Chuang, 1996, “Realism and Spacetime: Of Arguments\nAgainst Metaphysical Realism and Manifold Realism,”\n<em>Philosophia Naturalis</em>, 33: 243–63.",
                "–––, 1996a, “Gauge Invariance,\nIndeterminism, and Symmetry Breaking,” <em>Philosophy of\nScience</em>, 63 (Supplement): S71–S80.",
                "Leeds, Stephen, 1995, “Holes and Determinism: Another\nLook,” <em>Philosophy of Science</em>, 62: 425–437.",
                "Macdonald, Alan, 2001, “Einstein’s Hole\nArgument,” <em>American Journal of Physics</em>, 69:\n223–25",
                "Maudlin, Tim, 1989, “The Essence of Spacetime,” in A.\nFine and J. Leplin (eds.), <em>PSA 1988</em>, Volume 2, pp.\n82–91.",
                "–––, 1990, “Substances and Spacetimes:\nWhat Aristotle Would have Said to Einstein,” <em>Studies in the\nHistory and Philosophy of Science</em>, 21: 531–61.",
                "Melia, Joseph, 1999, “Holes, Haecceitism and Two Conceptions\nof Determinism”, <em>British Journal for the Philosophy of\nScience</em>, 50(4):639–664.",
                "Menon, Tushar and Read, James, 2023, “Some Remarks on Recent\nMathematical-<em>cum</em>-formalist Responses to the Hole\nArgument”, <em>Philosophy of Science</em>.",
                "Muller, Fred A., 1995, “Fixing a Hole,”\n<em>Foundations of Physics Letters</em>, 8: 549–562.",
                "Mundy, Brent, 1992, “Spacetime and Isomorphism,” in D.\nHull, M. Forbes and K. Okruhlik (eds.), <em>PSA 1992</em>, Volume 1,\npp. 515–527.",
                "Norton, John D., 1984, “How Einstein found his Field\nEquations: 1912–1915,” <em>Historical Studies in the\nPhysical Sciences</em>, 14: 253–316; reprinted in Don Howard and\nJohn Stachel (eds.), <em>Einstein and the History of General\nRelativity: Einstein Studies</em>, Volume 1, Boston: Birkhäuser,\n1989, pp. 101–159.",
                "–––, 1987, “Einstein, the Hole Argument\nand the Reality of Space,” in John Forge (ed.), <em>Measurement,\nRealism and Objectivity</em>, Dordrecht: Reidel, pp. 153–188\n.",
                "–––, 1988, “The Hole Argument,” in\nA. Fine and J. Leplin (eds.), <em>PSA 1988</em>, Volume 2, pp.\n56–64.",
                "–––, 1989, “Coordinates and Covariance:\nEinstein’s view of spacetime and the modern view,”\n<em>Foundations of Physics</em>, 19: 1215–1263.",
                "–––, 1992, “The Physical Content of\nGeneral Covariance,” in J. Eisenstaedt and A. Kox (eds.),\n<em>Studies in the History of General Relativity</em> (Volume 3:\nEinstein Studies), Boston: Birkhauser, pp. 281–315.",
                "–––, 1992a, “Philosophy of Space and\nTime,” in M.H. Salmon <em>et al</em>., <em>Introduction to the\nPhilosophy of Science</em>, Englewood Cliffs, NJ: Prentice-Hall;\nreprinted Hackett Publishing, pp. 179–231.",
                "–––, 1993, “General Covariance and the\nFoundations of General Relativity: Eight Decades of Dispute,”\n<em>Reports on Progress in Physics</em>, 56: 791–858.",
                "–––, 2003, “Causation as Folk\nScience,” <em>Philosophers’ Imprint</em>, 3 (4)\n [<a href=\"http://www.philosophersimprint.org/003004/\" target=\"other\">available Online</a>].",
                "–––, 2003a, “General Covariance, Gauge\nTheories, and the Kretschmann Objection,” in K. Brading and E.\nCastellani (eds.), <em>Symmetries in Physics: Philosophical\nReflections</em>, Cambridge: Cambridge University Press, pp.\n110–123.",
                "–––, 2019, “Ontology of Space and Time:\nThe Hole Argument”, in <em>Einstein for Everyone</em>:\n <a href=\"https://sites.pitt.edu/~jdnorton/teaching/HPS_0410/chapters/significance_GR_hole_argument/significance_GR_hole_argument.html\">available online</a>.",
                "Pooley, Oliver, 2002, <em>The Reality of Spacetime</em>, D.Phil.\nthesis, University of Oxford.",
                "–––, 2006a, “A Hole Revolution, or are We\nBack Where We Started?”, <em>Studies in History and Philosophy\nof Modern Physics</em>, 37(2): 372–380.",
                "–––, 2006b, “Points, Particles, and\nStructural Realism,” in D. Rickles <em>et al. </em>(eds),\n<em>The Structural Foundations of Quantum Gravity</em>, Oxford: Oxford\nUniversity Press, pp. 83–120.",
                "–––, 2013, “Substantivalist and\nRelationalist Approaches to Spacetime,” in R. W. Batterman\n(ed.), <em>The Oxford Handbook of Philosophy of Physics</em>, Oxford:\nOxford University Press, pp. 522–586.",
                "–––, 2017, “Background Independence,\nDiffeomorphism Invariance and the Meaning of Coordinates”, in D.\nLehmkuhl, G. Schiemann and E. Scholz (eds.), <em>Towards a Theory of\nSpacetime Theories,</em> Basel: Birkhäuser, pp.\n105–144.",
                "–––, 2021, “The Hole Argument”, in\nE. Knox and A. Wilson (eds.), <em>The Routledge Companion to\nPhilosophy of Physics</em>, London: Routledge, pp. 145–159.",
                "Pooley, Oliver and Read, James, 2021, “On the Mathematics\nand Metaphysics of the Hole Argument”, <em>British Journal for\nthe Philosophy of Science</em>.",
                "Read, James, 2023, <em>Background Independence in Classical and\nQuantum Gravity, </em>Oxford: Oxford University Press.",
                "Renn, Juergen, <em>et al</em>. (eds.), 2007, <em>The Genesis of\nGeneral Relativity: Sources and Interpretations</em>, (Boston Studies\nin the Philosophy of Science, Volume 250), 4 Volumes, Berlin:\nSpringer.",
                "Rickles, Dean, 2005, “A New Spin on the Hole\nArgument,” <em>Studies in History and Philosophy of Modern\nPhyscis</em>, 36: pp. 415–34.",
                "Roberts, Bryan W., 2020, “Regarding ‘Leibniz\nEquivalence’”, <em>Foundations of Physics</em> 50:\n250–269.",
                "Rovelli, Carlo and Gaul, Marcus, 2000, “Loop Quantum Gravity\nand the Meaning of Diffeomorphism Invariance”, in Jerzy\nKowalski-Glikman (ed.), <em>Towards Quantum Gravity,</em> Berlin:\nSpringer, pp. 277–324.",
                "Rynasiewicz, Robert, 1992, “Rings, Holes and\nSubstantivalism: On the Program of Leibniz Algebras,”\n<em>Philosophy of Science</em>, 45: 572–89.",
                "–––, 1994, “The Lessons of the Hole\nArgument,” <em>British Journal for the Philosophy of\nScience</em>, 45: 407–436.",
                "–––, 1996, “Is There a Syntactic Solution\nto the Hole Problem,” <em>Philosophy of Science</em>, 64\n(Proceedings): S55–S62.",
                "–––, 2012, “Simultaneity, convention, and\ngauge freedom” <em>Studies in History and Philosophy of Modern\nPhysics</em>, 43: 90–94.",
                "Smolin, Lee, 2006, “The Case for Background\nIndependence”, in Dean Rickles, Steven French and Juha T. Saatsi\n(eds.), <em>The Structural Foundations of Quantum Gravity</em>,\nOxford: Oxford University Press. pp. 196–239.",
                "Stachel, John, 1980, “Einstein’s Search for General\nCovariance,” in Don Howard and John Stachel (eds.), <em>Einstein\nand the History of General Relativity</em> (Einstein Studies, Volume\n1), Boston: Birkhäuser, 1989, pp. 63–100. [This paper was\nfirst paper read at the Ninth International Conference on General\nRelativity and Gravitation, Jena.]",
                "–––, 1986, “What can a Physicist Learn\nfrom the Discovery of General Relativity?,” <em>Proceedings of\nthe Fourth Marcel Grossmann Meeting on Recent Developments in General\nRelativity</em>, R. Ruffini (ed.), Amsterdam: North-Holland, pp.\n1857–1862.",
                "–––, 1993, “The Meaning of General\nCovariance,” in J. Earman <em>et al</em>. (eds.),\n<em>Philosophical Problems of the Internal and External Worlds: Essays\non the Philosophy of Adolf Gruenbaum</em>, Pittsburgh: University of\nPittsburgh Press/Konstanz: Universitaetsverlag Konstanz, pp.\n129–160.",
                "–––, 2006, “Structure, Individuality and\nQuantum Gravity”, in Dean Rickles, Steven French and Juha T.\nSaatsi (eds.), <em>The Structural Foundations of Quantum Gravity</em>,\nOxford: Oxford University Press. pp. 53–82.",
                "–––, 2014 “The Hole Argument and Some\nPhysical and Philosophical Implications,” <em>Living Reviews in\nRelativity</em>, 17(1):\n <a href=\"http://www.livingreviews.org/lrr-2014-1\" target=\"other\">available online</a>.",
                "Teller, Paul, 1991, “Substances, Relations and Arguments\nAbout the Nature of Spacetime,” <em>The Philosophical\nReview</em>, 100(3): 363–97.",
                "Teitel, Trevor, 2019, “Holes in Spacetime: Some Neglected\nEssentials,” <em>Journal of Philosophy</em>, forthcoming,\n <a href=\"http://philsci-archive.pitt.edu/id/eprint/15972\" target=\"other\">preprint available online</a>.",
                "Weatherall, James O., 2018, “Regarding the ‘Hole\nArgument’,” <em>British Journal for the Philosophy of\nScience</em>, 69: 329–350,\n <a href=\"http://philsci-archive.pitt.edu/id/eprint/11578\" target=\"other\">preprint available online</a>.",
                "–––, 2020. “Some Philosophical Prehistory\nof the (Earman-Norton) Hole Argument”, <em>Studies in History\nand Philosophy of Modern Physics</em>, 70: 79–87.",
                "Wilson, Mark, 1993, “There’s a Hole and a Bucket, Dear\nLeibniz,” in P. A. French, T. E. Uehling and H. K. Wettstein\n(eds.), <em>Philosophy of Science</em>, Notre Dame: University of\nNotre Dame Press, pp. 202–241."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Bain, Jonathan, 1998, <em>Representations of Spacetime: Formalism\nand Ontological Commitment</em>, Ph.D. Dissertation, Department of\nHistory and Philosophy of Science, University of Pittsburgh.</li>\n<li>–––, 2003, “Einstein Algebras and the Hole\nArgument,” <em>Philosophy of Science</em>, 70:\n1073–1085.</li>\n<li>Belot, Gordon, 1995a, “Indeterminism and Ontology,”\n<em>International Studies in the Philosophy of Science</em>, 9:\n85–101.</li>\n<li>–––, 1995b, “New Work for Counterpart\nTheorists”, <em>British Journal for the Philosophy of\nScience</em>, 46(2): 185–195.</li>\n<li>–––, 1996, <em>Whatever is Never and Nowhere is\nNot: Space, Time and Ontology in Classical and Quantum Gravity</em>\nPh. D. Dissertation, Department of Philosophy, University of\nPittsburgh.</li>\n<li>–––, 1996a, “Why General Relativity\n<em>Does</em> Need an Interpretation,” <em>Philosophy of\nScience</em>, 63 (Supplement): S80–S88.</li>\n<li>–––, 2018, “Fifty Million Elvis Fans\nCan’t be Wrong,” <em>Noûs</em>, 52:\n946–981.</li>\n<li>Belot, Gordon and Earman, John, 2001, “Pre-Socratic Quantum\nGravity”, in C. Callender and N. Huggett (eds.), <em>Physics\nMeets Philosophy at the Planck Scale</em>, Cambridge: Cambridge\nUniversity Press. pp. 213–255.</li>\n<li>Brighouse, Carolyn, 1994, “Spacetime and Holes,” in D.\nHull, M. Forbes and R. M. Burian (eds.), <em>PSA 1994</em>, Volume 1,\npp. 117–125.</li>\n<li>–––, 2020, “Confessions of a (Cheap)\nSophisticated Substantivalist”, <em>Foundations of Physics\n</em>, 50: 348–359.</li>\n<li>Butterfield, Jeremy, 1988, “Albert Einstein meets David\nLewis,” in A. Fine and J. Leplin (eds.), <em>PSA 1988</em>,\nVolume 2, pp. 56–64.</li>\n<li>–––, 1989, “The Hole Truth,”\n<em>British Journal for the Philosophy of Science</em>, 40:\n1–28.</li>\n<li>Brading, Katherine and Castellani, Elena (eds.), 2003,\n<em>Symmetries in Physics:Philosophical Reflections</em>, Cambridge:\nCambridge University Press, pp. 334–345.</li>\n<li>Corry, Leo, Renn, Juergen, and Stachel, John, 1997, “Belated\nDecision in the Hilbert-Einstein Priority Dispute,”\n<em>Science</em>, 278: 1270–73.</li>\n<li>Curiel, Erik, 2018, “On the Existence of Spacetime\nStructure,” <em>British Journal for the Philosophy of\nScience</em>, 69: 447–483.</li>\n<li>Dasgupta, Shamik, 2011, “The Bare Necessities”,\n<em>Philosophical Perspectives</em>, 25: 115–160.</li>\n<li>Dougherty, John, 2020, “The Hole Argument, Take\n\\(n\\)”, <em>Foundations of Physics</em>, 50:\n330–347.</li>\n<li>Earman, John, 1986, “Why Space is not a Substance (At Least\nNot to First Degree),” <em>Pacific Philosophical Quarterly</em>,\n67: 225–244.</li>\n<li>–––, 1986a, <em>A Primer on Determinism</em>,\nDordrecht: Reidel.</li>\n<li>–––, 1989, <em>World Enough and Space-Time:\nAbsolute Versus Relational Theories of Space and Time</em>, Cambridge,\nMA: MIT Bradford.</li>\n<li>–––, 2003, “Tracking down gauge: an ode to\nthe constrained Hamiltonian formalism”, in K. Brading and E.\nCastellani (eds.), <em>Symmetries in Physics: Philosophical\nReflections</em>, Cambridge: Cambridge University Press, pp.\n140–162.</li>\n<li>Earman, John and Norton, John D., 1987, “What Price\nSpacetime Substantivalism,” <em>British Journal for the\nPhilosophy of Science</em>, 38: 515–525.</li>\n<li>Einstein, Albert, 1916, “The Foundation of the General\nTheory of Relativity,” in H.A. Lorentz et al., <em>The Principle\nof Relativity</em>, New York: Dover, 1952, pp. 111–164.</li>\n<li>Friedman, Michael, 1983. <em>Foundations of Space-Time Theories:\nRelativistic Physics and Philosophy of Science, </em>Princeton, NJ:\nPrinceton University Press.</li>\n<li>Giovanelli, Marco, 2013 “Erich Kretschmann as a\nProto-Logical-Empiricist: Adventures and Misadventures of the\nPoint-Coincidence Argument,” <em>Studies in History and\nPhilosophy of Modern Physics</em>, 44: 115–134.</li>\n<li>Gomes, Henrique and Butterfield, Jeremy, 2023a, “The Hole\nArgument and Beyond, Part I: The Story so Far”.</li>\n<li>–––, 2023b, “The Hole Argument and Beyond,\nPart II: Treating Non-isomorphic Spacetimes”.</li>\n<li>Gryb, Sean and Thébault, Karim P. Y., 2016,\n“Regarding the ‘Hole Argument’ and the\n‘Problem of Time’,” <em>Philosophy of Science</em>,\n83: 563–584.</li>\n<li>Halvorson, Hans and Manchak, J.B., “Closing the Hole\nArgument”, <em>British Journal for the Philosophy of\nScience</em>, 2021.</li>\n<li>Healey, Richard, 1999, “On the Reality of Gauge\nPotentials,” <em>Philosophy of Science</em>, 68:\n432–55.</li>\n<li>Hoefer, Carl, 1996, “The Metaphysics of Space-Time\nSubstantivalism,” <em>Journal of Philosophy</em>, 93:\n5–27.</li>\n<li>Hoefer, Carl and Cartwright, Nancy, 1993, “Substantivalism\nand the Hole Argument,” in J. Earman <em>et al</em>. (eds.),\n<em>Philosophical Problems of the Internal and External Worlds: Essays\non the Philosophy of Adolf Gruenbaum</em>, Pittsburgh: University of\nPittsburgh Press/Konstanz: Universitaetsverlag Konstanz, pp.\n23–43.</li>\n<li>Howard, Don and Norton, John D., 1993, “Out of the\nLabyrinth? Einstein, Hertz and the Goettingen Answer to the Hole\nArgument,” in John Earman, Michel Janssen, John D. Norton\n(eds.), <em>The Attraction of Gravitation: New Studies in History of\nGeneral Relativity</em> Boston: Birkhäuser, pp. 30–62.</li>\n<li>Iftime, Mihaela and Stachel, John, 2006, “The Hole Argument\nfor Covariant Theories,” <em>General Relativity and\nGravitation</em>, 38: 1241–1252.</li>\n<li>Janssen, Michel, 1999, “Rotation as the Nemesis of\nEinstein’s ‘Entwurf’ Theory,” in Hubert\nGoenner <em>et al</em>. (eds.), <em>Einstein Studies: Volume 7. The\nExpanding Worlds of General Relativity</em>, Boston: Birkhaeuser, pp.\n127–157.</li>\n<li>Jammer, Max, 1993, <em>Concepts of Space: The History of Theories\nof Space in Physics</em>, third enlarged edition, New York: Dover,\nChapter 6. “Recent Developments.”</li>\n<li>Klein, Martin J. <em>et al</em>. (eds.), 1995, <em>The Collected\nPapers of Albert Einstein: Volume 4. The Swiss Years: Writing,\n1912–1914</em>, Princeton: Princeton University Press.</li>\n<li>Ladyman, James and Presnell, Stuart, 2020, “The Hole\nArgument in Homotopy Type Theory”, <em>Foundations of\nPhysics</em>, 50: 319–329.</li>\n<li>Lusanna, Luca and Pauri, Massimo, 2006 “Explaining Leibniz\nEquivalence as Difference of Non-inertial Appearances: Dis-solution of\nthe Hole Argument and Physical Individuation of Point-Events,”\n<em>Studies in History and Philosophy of Modern Physics</em>, 37:\n692–725</li>\n<li>Liu, Chuang, 1996, “Realism and Spacetime: Of Arguments\nAgainst Metaphysical Realism and Manifold Realism,”\n<em>Philosophia Naturalis</em>, 33: 243–63.</li>\n<li>–––, 1996a, “Gauge Invariance,\nIndeterminism, and Symmetry Breaking,” <em>Philosophy of\nScience</em>, 63 (Supplement): S71–S80.</li>\n<li>Leeds, Stephen, 1995, “Holes and Determinism: Another\nLook,” <em>Philosophy of Science</em>, 62: 425–437.</li>\n<li>Macdonald, Alan, 2001, “Einstein’s Hole\nArgument,” <em>American Journal of Physics</em>, 69:\n223–25</li>\n<li>Maudlin, Tim, 1989, “The Essence of Spacetime,” in A.\nFine and J. Leplin (eds.), <em>PSA 1988</em>, Volume 2, pp.\n82–91.</li>\n<li>–––, 1990, “Substances and Spacetimes:\nWhat Aristotle Would have Said to Einstein,” <em>Studies in the\nHistory and Philosophy of Science</em>, 21: 531–61.</li>\n<li>Melia, Joseph, 1999, “Holes, Haecceitism and Two Conceptions\nof Determinism”, <em>British Journal for the Philosophy of\nScience</em>, 50(4):639–664.</li>\n<li>Menon, Tushar and Read, James, 2023, “Some Remarks on Recent\nMathematical-<em>cum</em>-formalist Responses to the Hole\nArgument”, <em>Philosophy of Science</em>.</li>\n<li>Muller, Fred A., 1995, “Fixing a Hole,”\n<em>Foundations of Physics Letters</em>, 8: 549–562.</li>\n<li>Mundy, Brent, 1992, “Spacetime and Isomorphism,” in D.\nHull, M. Forbes and K. Okruhlik (eds.), <em>PSA 1992</em>, Volume 1,\npp. 515–527.</li>\n<li>Norton, John D., 1984, “How Einstein found his Field\nEquations: 1912–1915,” <em>Historical Studies in the\nPhysical Sciences</em>, 14: 253–316; reprinted in Don Howard and\nJohn Stachel (eds.), <em>Einstein and the History of General\nRelativity: Einstein Studies</em>, Volume 1, Boston: Birkhäuser,\n1989, pp. 101–159.</li>\n<li>–––, 1987, “Einstein, the Hole Argument\nand the Reality of Space,” in John Forge (ed.), <em>Measurement,\nRealism and Objectivity</em>, Dordrecht: Reidel, pp. 153–188\n.</li>\n<li>–––, 1988, “The Hole Argument,” in\nA. Fine and J. Leplin (eds.), <em>PSA 1988</em>, Volume 2, pp.\n56–64.</li>\n<li>–––, 1989, “Coordinates and Covariance:\nEinstein’s view of spacetime and the modern view,”\n<em>Foundations of Physics</em>, 19: 1215–1263.</li>\n<li>–––, 1992, “The Physical Content of\nGeneral Covariance,” in J. Eisenstaedt and A. Kox (eds.),\n<em>Studies in the History of General Relativity</em> (Volume 3:\nEinstein Studies), Boston: Birkhauser, pp. 281–315.</li>\n<li>–––, 1992a, “Philosophy of Space and\nTime,” in M.H. Salmon <em>et al</em>., <em>Introduction to the\nPhilosophy of Science</em>, Englewood Cliffs, NJ: Prentice-Hall;\nreprinted Hackett Publishing, pp. 179–231.</li>\n<li>–––, 1993, “General Covariance and the\nFoundations of General Relativity: Eight Decades of Dispute,”\n<em>Reports on Progress in Physics</em>, 56: 791–858.</li>\n<li>–––, 2003, “Causation as Folk\nScience,” <em>Philosophers’ Imprint</em>, 3 (4)\n [<a href=\"http://www.philosophersimprint.org/003004/\" target=\"other\">available Online</a>].</li>\n<li>–––, 2003a, “General Covariance, Gauge\nTheories, and the Kretschmann Objection,” in K. Brading and E.\nCastellani (eds.), <em>Symmetries in Physics: Philosophical\nReflections</em>, Cambridge: Cambridge University Press, pp.\n110–123.</li>\n<li>–––, 2019, “Ontology of Space and Time:\nThe Hole Argument”, in <em>Einstein for Everyone</em>:\n <a href=\"https://sites.pitt.edu/~jdnorton/teaching/HPS_0410/chapters/significance_GR_hole_argument/significance_GR_hole_argument.html\">available online</a>.</li>\n<li>Pooley, Oliver, 2002, <em>The Reality of Spacetime</em>, D.Phil.\nthesis, University of Oxford.</li>\n<li>–––, 2006a, “A Hole Revolution, or are We\nBack Where We Started?”, <em>Studies in History and Philosophy\nof Modern Physics</em>, 37(2): 372–380.</li>\n<li>–––, 2006b, “Points, Particles, and\nStructural Realism,” in D. Rickles <em>et al. </em>(eds),\n<em>The Structural Foundations of Quantum Gravity</em>, Oxford: Oxford\nUniversity Press, pp. 83–120.</li>\n<li>–––, 2013, “Substantivalist and\nRelationalist Approaches to Spacetime,” in R. W. Batterman\n(ed.), <em>The Oxford Handbook of Philosophy of Physics</em>, Oxford:\nOxford University Press, pp. 522–586.</li>\n<li>–––, 2017, “Background Independence,\nDiffeomorphism Invariance and the Meaning of Coordinates”, in D.\nLehmkuhl, G. Schiemann and E. Scholz (eds.), <em>Towards a Theory of\nSpacetime Theories,</em> Basel: Birkhäuser, pp.\n105–144.</li>\n<li>–––, 2021, “The Hole Argument”, in\nE. Knox and A. Wilson (eds.), <em>The Routledge Companion to\nPhilosophy of Physics</em>, London: Routledge, pp. 145–159.</li>\n<li>Pooley, Oliver and Read, James, 2021, “On the Mathematics\nand Metaphysics of the Hole Argument”, <em>British Journal for\nthe Philosophy of Science</em>.</li>\n<li>Read, James, 2023, <em>Background Independence in Classical and\nQuantum Gravity, </em>Oxford: Oxford University Press.</li>\n<li>Renn, Juergen, <em>et al</em>. (eds.), 2007, <em>The Genesis of\nGeneral Relativity: Sources and Interpretations</em>, (Boston Studies\nin the Philosophy of Science, Volume 250), 4 Volumes, Berlin:\nSpringer.</li>\n<li>Rickles, Dean, 2005, “A New Spin on the Hole\nArgument,” <em>Studies in History and Philosophy of Modern\nPhyscis</em>, 36: pp. 415–34.</li>\n<li>Roberts, Bryan W., 2020, “Regarding ‘Leibniz\nEquivalence’”, <em>Foundations of Physics</em> 50:\n250–269.</li>\n<li>Rovelli, Carlo and Gaul, Marcus, 2000, “Loop Quantum Gravity\nand the Meaning of Diffeomorphism Invariance”, in Jerzy\nKowalski-Glikman (ed.), <em>Towards Quantum Gravity,</em> Berlin:\nSpringer, pp. 277–324.</li>\n<li>Rynasiewicz, Robert, 1992, “Rings, Holes and\nSubstantivalism: On the Program of Leibniz Algebras,”\n<em>Philosophy of Science</em>, 45: 572–89.</li>\n<li>–––, 1994, “The Lessons of the Hole\nArgument,” <em>British Journal for the Philosophy of\nScience</em>, 45: 407–436.</li>\n<li>–––, 1996, “Is There a Syntactic Solution\nto the Hole Problem,” <em>Philosophy of Science</em>, 64\n(Proceedings): S55–S62.</li>\n<li>–––, 2012, “Simultaneity, convention, and\ngauge freedom” <em>Studies in History and Philosophy of Modern\nPhysics</em>, 43: 90–94.</li>\n<li>Smolin, Lee, 2006, “The Case for Background\nIndependence”, in Dean Rickles, Steven French and Juha T. Saatsi\n(eds.), <em>The Structural Foundations of Quantum Gravity</em>,\nOxford: Oxford University Press. pp. 196–239.</li>\n<li>Stachel, John, 1980, “Einstein’s Search for General\nCovariance,” in Don Howard and John Stachel (eds.), <em>Einstein\nand the History of General Relativity</em> (Einstein Studies, Volume\n1), Boston: Birkhäuser, 1989, pp. 63–100. [This paper was\nfirst paper read at the Ninth International Conference on General\nRelativity and Gravitation, Jena.]</li>\n<li>–––, 1986, “What can a Physicist Learn\nfrom the Discovery of General Relativity?,” <em>Proceedings of\nthe Fourth Marcel Grossmann Meeting on Recent Developments in General\nRelativity</em>, R. Ruffini (ed.), Amsterdam: North-Holland, pp.\n1857–1862.</li>\n<li>–––, 1993, “The Meaning of General\nCovariance,” in J. Earman <em>et al</em>. (eds.),\n<em>Philosophical Problems of the Internal and External Worlds: Essays\non the Philosophy of Adolf Gruenbaum</em>, Pittsburgh: University of\nPittsburgh Press/Konstanz: Universitaetsverlag Konstanz, pp.\n129–160.</li>\n<li>–––, 2006, “Structure, Individuality and\nQuantum Gravity”, in Dean Rickles, Steven French and Juha T.\nSaatsi (eds.), <em>The Structural Foundations of Quantum Gravity</em>,\nOxford: Oxford University Press. pp. 53–82.</li>\n<li>–––, 2014 “The Hole Argument and Some\nPhysical and Philosophical Implications,” <em>Living Reviews in\nRelativity</em>, 17(1):\n <a href=\"http://www.livingreviews.org/lrr-2014-1\" target=\"other\">available online</a>.</li>\n<li>Teller, Paul, 1991, “Substances, Relations and Arguments\nAbout the Nature of Spacetime,” <em>The Philosophical\nReview</em>, 100(3): 363–97.</li>\n<li>Teitel, Trevor, 2019, “Holes in Spacetime: Some Neglected\nEssentials,” <em>Journal of Philosophy</em>, forthcoming,\n <a href=\"http://philsci-archive.pitt.edu/id/eprint/15972\" target=\"other\">preprint available online</a>.</li>\n<li>Weatherall, James O., 2018, “Regarding the ‘Hole\nArgument’,” <em>British Journal for the Philosophy of\nScience</em>, 69: 329–350,\n <a href=\"http://philsci-archive.pitt.edu/id/eprint/11578\" target=\"other\">preprint available online</a>.</li>\n<li>–––, 2020. “Some Philosophical Prehistory\nof the (Earman-Norton) Hole Argument”, <em>Studies in History\nand Philosophy of Modern Physics</em>, 70: 79–87.</li>\n<li>Wilson, Mark, 1993, “There’s a Hole and a Bucket, Dear\nLeibniz,” in P. A. French, T. E. Uehling and H. K. Wettstein\n(eds.), <em>Philosophy of Science</em>, Notre Dame: University of\nNotre Dame Press, pp. 202–241.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "determinism: causal",
            "Einstein, Albert: philosophy of science",
            "general relativity: early philosophical interpretations of",
            "physics: symmetry and symmetry breaking",
            "substance"
        ],
        "entry_link": [
            {
                "../determinism-causal/": "determinism: causal"
            },
            {
                "../einstein-philscience/": "Einstein, Albert: philosophy of science"
            },
            {
                "../genrel-early/": "general relativity: early philosophical interpretations of"
            },
            {
                "../symmetry-breaking/": "physics: symmetry and symmetry breaking"
            },
            {
                "../substance/": "substance"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=spacetime-holearg\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/spacetime-holearg/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=spacetime-holearg&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/spacetime-holearg/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=spacetime-holearg": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/spacetime-holearg/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=spacetime-holearg&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/spacetime-holearg/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Iftime, Mihaela, 2006,\n “<a href=\"http://arxiv.org/abs/gr-qc/0612141\" target=\"other\">Gauge and the Hole Argument</a>,”\n [Preprint at arXiv.org]",
            "Lyre, Holger, 1999,\n “<a href=\"http://arxiv.org/abs/gr-qc/9904036v1\" target=\"other\">Gauges, Holes, and their ‘Connections’</a>,”\n [Preprint at arXiv.org]",
            "<a href=\"http://www.pitt.edu/~jdnorton/Goodies/index.html\" target=\"other\">John Norton’s “Goodies” Pages</a>"
        ],
        "listed_links": [
            {
                "http://arxiv.org/abs/gr-qc/0612141": "Gauge and the Hole Argument"
            },
            {
                "http://arxiv.org/abs/gr-qc/9904036v1": "Gauges, Holes, and their ‘Connections’"
            },
            {
                "http://www.pitt.edu/~jdnorton/Goodies/index.html": "John Norton’s “Goodies” Pages"
            }
        ]
    }
}