{
    "url": "spinoza-attributes",
    "title": "Spinoza’s Theory of Attributes",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Noa Shein\n<sheinn@bgu.ac.il>",
        "author_links": [
            {
                "mailto:sheinn%40bgu%2eac%2eil": "sheinn@bgu.ac.il"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nNoa Shein\n&lt;<a href=\"mailto:sheinn%40bgu%2eac%2eil\"><em>sheinn<abbr title=\" at \">@</abbr>bgu<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>il</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Feb 3, 2009",
        "substantive revision Sat Jun 3, 2023"
    ],
    "preamble": "\n\nAttributes sit at the very heart of Spinoza’s metaphysics. They\nenable us to understand and talk about an extended world and a\nthinking world in terms of which we understand such things as bodies\nand minds. Furthermore, it is due to the relation of attributes to one\nanother and to the infinite substance that an elegant resolution to\nthe Cartesian mind–body problem is possible. Attributes furnish\nSpinoza’s substance with variety while preventing it from being\nan ephemeral, homogenous totality—an eleatic “one”\nof which nothing can be said or known. They constitute variety without\ndissolving the infinite substance into multiple substances.\n\nSpinoza defines the term “attribute” in Definition 4 of\nPart One of the Ethics thus: “Per attributum\nintelligo id, quod intellectus de substantia percipit, tanquam ejusdem\nessentiam constituens.” That is, “By attribute I\nunderstand what the intellect perceives of substance as constituting\nits\n essence.”[1]\n Nonetheless, it is astonishing how little agreement there is among\nscholars as to some of the most basic features of Spinoza’s\ntheory of attributes. For this reason, this article first considers\nthe important places where Spinoza establishes fundamental\ncharacteristics of attributes: such as their definition, their real\ndistinction, and their identification with the substance. It then\nexplains the main issue on which interpretations diverge and signals\nin broad terms which interpretative avenues have been taken or are\nconceptually open (without delving too deeply into any one of them).\nIn light of these very different interpretative avenues the article\nrevisits some of the characteristics explained in the first part and\nconsiders how they are affected by the different kinds of\ninterpretations. Finally, and perhaps most importantly, given the\nholistic and systematic nature of Spinoza’s metaphysics and the\ncentral role attributes play in it, the article points out how the\ndifferent interpretative options on one issue bear on others (e.g. the\nnumber of attributes and the understanding of 2P7 and its scholium).\nThe different ways of understanding Spinoza’s theory of\nattributes inevitably give rise to very different conceptions of\nSpinoza’s metaphysics as a whole.\n",
    "toc": [
        {
            "#AttrEthi": "1. Attributes in the Ethics"
        },
        {
            "#WhatAttr": "1.1 What are Attributes?"
        },
        {
            "#DefiAttr": "1.2 Definition of Attribute"
        },
        {
            "#RealDist": "1.3 Real Distinction"
        },
        {
            "#IdenAttrSubs": "1.4 The Identification of Attributes with Substance"
        },
        {
            "#ExteDiviAttr": "1.5 Extension as a Divine Attribute"
        },
        {
            "#N2P7Doct": "1.6 The 2P7 Doctrine"
        },
        {
            "#TwoKnowAttr": "1.7 The Two Known Attributes"
        },
        {
            "#AmbiInteDire": "1.8 Ambiguities and Interpretative Directions"
        },
        {
            "#SubjInte": "1.8.1 Subjective Interpretations"
        },
        {
            "#ObjeInte": "1.8.2 Objective Interpretations"
        },
        {
            "#ImplVariReadOtheSpinDoct": "1.9 Implications of the Various Readings on Other Spinozistic Doctrines"
        },
        {
            "#NumbAttr": "1.9.1 Number of Attributes"
        },
        {
            "#MetaStru2P7Scho": "1.9.2 The Metaphysical Structure of 2P7 and its Scholium"
        },
        {
            "#NatuIdenSubsAttr": "1.9.3 The Nature of the Identification of Substance and the Attributes"
        },
        {
            "#NatuUnioMindBody": "1.9.4 The Nature of the Union of Mind and Body"
        },
        {
            "#AttrShorTrea": "2. Attributes in the Short Treatise"
        },
        {
            "#Conc": "3. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Attributes in the Ethics\n\nBefore discussing the theory of attributes in the Ethics, it\nwill be helpful to keep in mind a rudimentary sketch of the general\nstructure of Spinoza’s\n ontology:[2]\n\n\n\nAttributes/Substance:\nThought ––– God\n––– Extension \n\n\n|\n\n| \n\nInfinite Modes:\nInfinite Intellect\n      \nMotion and Rest \n\n\n|\n\n| \n\nFinite Modes:\nA Mind\n\nA Body \n\n\nThere is only an infinite substance (1P14), that is, there are no\ncreated substances. The infinite substance consists of infinite\nattributes (1D6). Every mode, be it finite or infinite, must be\nconceived through an attribute (1D5, 1P10Schol, 2P6 and 2P6Dem).\nFinally, what other philosophers consider to be “created\nsubstances,” such as my mind (as well as my body), are finite\nmodes for Spinoza\n (1P11).[3]\n\n1.1 What are Attributes?\n\nSpinoza is not the first to furnish his metaphysics with attributes\nand in that he is following a very long tradition. He is, though,\nmostly influenced by Descartes, and in some ways is trying to keep\nwith Descartes’ notion of “attribute.” It therefore\nwill be useful to look back and get a sense of what Descartes had in\nmind and thus get a preliminary grasp (which will be revised) of what\nSpinoza means by “attribute.” Descartes states in the\nPrinciples of Philosophy that attributes are the essence of a\nthing, so the essence of mind is thought or thinking, and the essence\nof body is to be extended (Principles, I, §53, CSM, I,\np. 210, AT 25). To see why this is so, it is worth revisiting the\nfirst and second Meditations, even if very briefly. Let us\nbegin with body and Extension. To understand the essence of body, we\ncan look to the famous wax example in Meditation Two (CSM,\nII, p. 20–21, AT 30–32). While sitting by the fireplace,\nDescartes inspects a piece of wax and asks himself what he knows of\nthe wax. He begins by listing all the sensory properties of the wax:\nit is white, has a certain smell, makes a certain sound when one raps\nit with one’s finger, is hard, and has a certain taste. After\nlisting all its sensory properties, he then places the piece of wax by\nthe fire and sees how it loses all those properties: it\nchanges color, smell, texture, taste, etc. Descartes concludes, among\nother things, that the essence of the wax, insofar as it is a body, is\nthat it is extended in length, breadth, and depth since that\nis the only thing that remains constant about the wax. In this\nrespect, the piece of wax is no different from any other\nbody—that is, its essence is to be extended. Extension, then,\naccording to Descartes, is the essence of body. In the\nMeditations we also, famously, come to recognize our own\nessence as thinking things. We realize this by recognizing that we\ncannot doubt that we are doubting while doubting. Furthermore, we\nrealize that doubting in this sense is no different from\nunderstanding, affirming, denying, willing, unwilling, imagining, and\nhaving sense perceptions (seeming to see, etc.) (CSM, II, p. 19, AT\n28). Descartes then reaches the conclusion that the essence of the\nmind is Thought. For these reasons, Descartes claims that Thought and\nExtension are the principal attributes of mind and body and that they\nare “really distinct”, that is, they exist independently\none from the\n other.[4]\n It is important to note that for Descartes, any created\nsubstance has only one principal attribute, as opposed to God who\nhas infinite attributes.\n\nSpinoza adopts some aspects of the Cartesian set up while rejecting\nothers. He agrees that Thought and Extension are attributes (2P1, 2P2)\nand are related to essences (1D4). He agrees they are “really\ndistinct” from each other\n (1P10Schol).[5]\n Furthermore, he agrees that “mind” has to be conceived\nthrough Thought, and “body” through Extension. (2P5 and\nits demonstration make the case with regard to ideas and Thought; 2D1\nestablishes it for bodies and Extension. This is also made very clear\nin 3P2 and its demonstration.) However, he does not agree that they\nare attributes of created substances, since he rejects the\npossibility of created substances altogether (1P6Cor., 1P8Schol1,\n1P14). One way to understand Spinoza is to see how he can hold both\nThought and Extension (and other attributes, if there are others) to\nbe divine attributes or attributes of one and the same (infinite)\n substance.[6]\n\n1.2 Definition of Attribute\n\nSpinoza defines the term “attribute” thus:\n“By attribute I understand what the intellect perceives\nof substance as constituting its essence” (1D4). This definition\nis reminiscent of Descartes’ notion of attributes as it appears\nin the Principle of Philosophy insofar as attributes are\nrelated to the essence (or essences) of substance. However, as many\nhave noticed, it is not clear from the definition alone what exactly\nSpinoza means. There are several, by now famous, ambiguities in the\n definition.[7]\n These, together with the different interpretative options, are\ndiscussed in Section 1.8.\n1.3 Real Distinction\n\nSpinoza makes a very important claim about attributes in the Scholium\nto Proposition 10 of Part One: “…although two attributes\nmay be conceived to be really distinct (i.e., one may be conceived\nwithout the aid of the other), we still cannot infer from that that\nthey constitute two beings, or two different\nsubstances.” Spinoza here is explaining something about the\nrelationship among attributes—one may be conceived without the\naid of the other—and about the relation of the attributes to the\nsubstance, namely, that conceiving attributes independently is not\nevidence of the existence of independent substances.\n\nTo understand why this scholium is so important, it is helpful to\nrecall Descartes’ definition of a “real\ndistinction.” In the Principles of Philosophy,\nDescartes says: “Strictly speaking, a real distinction\nexists only between two or more substances; and we can perceive that\ntwo substances are really distinct simply from the fact that we can\nclearly and distinctly understand one apart from the other”\n(Principles, I, §60, CSM, I, p. 213, AT 28). For\nDescartes, this anchors the strict epistemological and ontological\nseparation between mind and body. One of the things we learn from\ngoing through the Meditations is that we are capable of\nclearly and distinctly perceiving ourselves without a body—the\ncogito in the Second Meditation, and we clearly and\ndistinctly perceive body without thinking in the Fifth\nMeditation. (Of course, in retrospect, we realize that we already\ndid this in a sense with the wax as well). Descartes thus concludes\nthat mind and body are really distinct, that is, one can\nexist without the other.\n\nOne important implication of this distinction is that it allows for a\nfully mechanistic explanation of the physical world. To explain the\ninteraction between two bodies requires alluding only to their\nphysical properties (size, shape and motion) without the need to take\nrecourse to any Aristotelian explanation involving\n final causes.\n Making room for mechanistic explanations, that is, for the New\nScience, was one of Descartes’ chief motivations for writing the\nMeditations. Spinoza preserves this aspect of Cartesian\ndoctrine (cf. appendix to Part One of the Ethics and\ndiscussion below).\n\nHaving separated the mind so sharply from the body, Descartes is left\nwith having to explain their evident unity. More specifically, he is\nburdened with trying to explain how two really distinct substances\nseem to interact causally. Their causal interaction seems problematic\nbecause, according to Descartes, each substance is independent; the\ninfinite substance depends on nothing but itself (Principles,\nI, §51, CSM, I, p. 210, AT 24), while created substances depend\non nothing but God for their existence (Principles,\nI, §52, CSM I, p. 210, AT 25). If distinct substances interact\ncausally then they seem to depend on one another, and this would go\nagainst their nature qua substances. This is why the\nunion of the mind and body is a thorny issue for Descartes,\nand was and continues to be a source of much debate (Cf. for example,\nHoffman, 1986). For some, a version of this problem translates into\nSpinoza’s metaphysics (cf. Section 1.9.4). The issue of the\nnature of the “real distinction” for Spinoza is discussed\nin the subsequent section.\nNo Cross-Attribute Causation or Conception\n\nFor Descartes, then, there is the epistemological claim that\nperceiving Thought does not involve perceiving Extension and vice\nversa. Each is explanatorily independent from the other, (although not\nfrom God). Spinoza adopts this aspect of Cartesian philosophy and\nholds, as well, that there is what Della Rocca calls, “a\nconceptual barrier” between Thought and Extension as Spinoza\nstates in the scholium “i.e., one may be conceived without the\naid of the other” (Della Rocca, 1996, 9–17). Spinoza holds\nThought and Extension to be explanatorily self-contained. Physical\nchanges are to be understood in terms of other physical items, and\nideas are to be understood in terms of other ideas. What is ruled out\nis what can be called “cross attribute explanations.” For\nexample, explaining the movement of my hand by my desire to move my\nhand. According to Spinoza, the movement of my hand is to be explained\npurely physically by alluding to other bodies and their motions, while\nmy desire is to be explained by other desires and ideas. Spinoza makes\nthis very clear in 3P2, its demonstration and scholium:\n\n\n3P2: The body cannot determine the mind to thinking, and the mind\ncannot determine the body to motion, to rest, or to anything else (if\nthere is anything else).\n\nDem.: All modes of thinking have God for a cause, insofar as he is a\nthinking thing, and not insofar as he is explained by another\nattribute (by 2P6). So what determines the mind to thinking is a mode\nof thinking and not of extension, that is (by 2D1), it is not the\nbody. This was the first thing.\n\nNext, the motion and rest of a body must arise from another\nbody…whatever arises in the body must have arisen from God\ninsofar as he is considered to be affected by some mode of extension,\nand not insofar as he is considered to be affected by some mode of\nthinking (also 2P6), that is, it cannot arise from the mind, which (by\n2P11) is a mode of thinking. This was the second point. Therefore, the\nbody cannot determine the mind, and so on, q.e.d.\n\n\nAlthough this is reminiscent of Descartes in some respects, there is,\nof course, one crucial difference. For Descartes the fact that one can\nconceive Thought distinctly from Extension is evidence for the\nexistence of two substances—mind and body. For Spinoza, this is\nnot the case, and this is the point he is making in this central\nproposition (1P10), namely, that although two attributes may be\nconceived independently—one without the other—this does\nnot imply that there are two substances existing separately.\nFor Spinoza there is only one substance with infinite attributes, and\nalthough each attribute is conceived independently from the other/s\nthey still are, nonetheless, all attributes of one and the same\nsubstance. It is possible then to conceive, think, or completely\nexplain the entire universe, or everything that exists, under each one\nof the attributes. That is, we can give a complete physical\ndescription of everything that exists, or alternatively explain,\ndescribe, or conceive everything as ideas or thought. Being able to\nexplain the entire universe under the attribute of Extension is what\nallows Spinoza to preserve Descartes’ effort of providing room\nfor progress in the New Science (Cf. Appendix to Part One).\n\nSpinoza and Descartes agree about the epistemological separation\nbetween Thought and Extension, but not about the ontological one.\nDescartes calls the distinction between attributes of the same\nsubstance, and between a given attribute and its substance a\n“rational distinction,” (Principles, I, §62,\nCSM, I, p. 214, AT 30) and so, insofar as Thought and Extension belong\nto the same substance for Spinoza, they would be, in Descartes’\nterminology, rationally\n distinct.[8]\n Spinoza however, says that they are “really\ndistinct.” How exactly to understand the “reality”\nof the distinction among the attributes is a crucial interpretative\nmatter and is discussed in Sections 1.8.1–1.8.2.\n1.4 The Identification of Attributes with Substance\n\nAnother claim that has to be taken into account in an analysis of\nSpinoza’s view on attributes is that God is his\nattributes: 1P4: “Therefore, there is nothing outside the\nintellect through which a number of things can be distinguished from\none another except substance, or what is the same (by 1D4),\ntheir attributes, and their affections” (italics added), 1P19:\n“God is eternal, or [sive] all God’s\nattributes are eternal,” 1P20Cor.: “It follows second,\nthat God, or [sive] all of God’s attributes,\nare immutable.” Some might consider 1P29Schol to be making an\nidentity claim as well: “But by Natura Naturata I\nunderstand whatever follows from the necessity of God’s nature,\nor [sive] from any of God’s\nattributes…” Spinoza in these places seems to be claiming\nthat there is an identification of the substance with its attributes.\nHowever, this identification can be understood in several ways and in\nvarious degrees of strictness. How one reads this claim depends on\nother considerations discussed in Section 1.9.3.\n1.5 Extension as a Divine Attribute\n\nOne of the important things that Spinoza does in the first two parts\nof the Ethics is to establish Extension as a divine attribute\n(elements of this view are evident already in KV I/25). Although\nSpinoza adopts many important aspects of Cartesian metaphysics, he\ncollapses the divide between the infinite and created substances. This\nmeans that principal attributes that were at the “created\nsubstance” level in the Cartesian set-up are “moved\nup”, so to speak, to the infinite substance level for Spinoza.\nOne of these attributes is, of course, Extension. Spinoza has to\nexplain to a resistant audience how Extension can be considered a\ndivine attribute.\n\nThe important steps that will allow Spinoza to claim that Extension\ncan be an attribute of God are the following. He defines God as a\nsubstance consisting of infinite attributes\n (1D6).[9]\n He shows that substances cannot share attributes (1P5), that every\nsubstance is infinite (1D8), that a single substance can have several\nattributes (1P10schol), and that an infinite substance exists (1P11).\nWith an eye towards specifically establishing Extension as a divine\nattribute, he claims in 1P12: “No attribute of a substance can\nbe truly conceived from which it follows that the substance can be\ndivided.” In 1P13, he states: “A substance which is\nabsolutely infinite is indivisible,” and in the corollary, he\nmakes the point especially clear with respect to Extension:\n“From these propositions it follows that no substance, and\nconsequently no corporeal substance, insofar as it is a\nsubstance, is divisible.” In 1P14, he establishes that\nthere is only one substance (or rather, that there are no created\nsubstances). Finally in 1P15 he claims: “Whatever is, is in God,\nand nothing can be or be conceived without God.” With this, the\nstage is set for Extension being a divine attribute or applicable to\nGod, if in fact it is a genuine attribute (which is established only\nin Part Two).\n\nSpinoza is aware that this will be received with great resistance. The\npossible objection he imagines is that since Extension is divisible by\nits very nature then, if Extension were an attribute of God, God would\nbe divisible. God, of course, cannot be divisible, for then he would\nnot be infinite. In the Scholium to 1P15 he shows the ensuing\ncontradictions if one holds Extension to be by its very nature\ndivisible. It is important for him to show that Extension cannot imply\ndivisibility in answer to possible objectors holding traditional\nviews. Moreover, he has just shown that there is only one substance,\nwhich is indivisible (1P12 and 1P13), and so whatever attributes it\nhas, none of them can imply divisibility in the only substance.\nSpinoza then shows that if Extension is an attribute, it is applicable\nto God, and there is no danger of that implying any real division in\nthe substance. One important result of this is that what appear to be\nindividuated bodies cannot be really individuated in the Cartesian\nsense of implying real distinction and the existence of multiple\nsubstances. Rather, what appear to be individuated bodies are only\nmodes of substance under the attribute of\n Extension.[10]\n Only in Part Two does Spinoza show that Extension (as well as\nThought) are in fact attributes of God: “Thought is an attribute\nof God, or [sive] God is a thinking thing”\n(2P1) and “Extension is an attribute of God, or\n[sive] God is an extended thing” (2P2).\n1.6 The 2P7 Doctrine\n\nA very important characteristic regarding attributes is established in\n2P7 and its scholium, which is sometimes referred to in the literature\nas the “parallelism doctrine.” However, as will be\ndiscussed in Section 1.9.2, this nomenclature is laden with a\nsignificant amount of interpretative bias and the term is nowhere to\nbe found in the Ethics itself. It is thus advisable to stay\nclear of it and simply refer to it as “the 2P7 Doctrine.”\n2P7 states: “The order and connection of ideas is the same as\nthe order and connection of things,” (“ordo, &\nconnexio idearum idem est, ac ordo & connexio rerum”).\nSpinoza explains this proposition in the scholium:\n\nFor example, a circle existing in Nature and the idea of the existing\ncircle, which is also in God, are one and the same thing, which is\nexplained through different attributes…Therefore, whether we\nconceive Nature under the attribute of extension, or under the\nattribute of thought, or under any attribute, we shall find one and\nthe same order, or one and the same connection of causes, that is,\nthat the same things follow one another.\n\n\nSpinoza is claiming here that a mode X under the attribute of\nThought is one and the same as mode X under\nAttributey. A good way to get some intuitive sense\nof this is to see how this works with respect to ourselves. Under the\nattribute of Thought, I am a finite mode—an idea or mind. Under\nthe attribute of Extension, I am a finite mode, that is, a body. The\nclaim in 2P7 and its scholium is that my mind (a mode of Thought) and\nmy body (a mode of Extension) are one and the same. This is the case\nfor all modes. Furthermore, whatever causal relation my body, say,\nbears to other modes of Extension, my mind will bear to the other\nmodes of Thought. The understanding of this doctrine and its\nimplications in more depth depends, probably more than any other\ndoctrine, on how one construes other central elements of\nSpinoza’s theory of attributes (e.g. the number of attributes).\nIn Section 1.9.2 different directions of interpretation are considered\nregarding 2P7 and its scholium.\n1.7 The Two Known Attributes\n\nSpinoza famously claims that we, human minds, only know two\nattributes—Thought and Extension. This can be seen as arising\nfrom the axioms in Part Two: 2A2: “Man thinks,” 2A4:\n“We feel a certain body is affected in many ways,” 2A5:\n“We neither feel nor perceive any singular things, except bodies\nand modes of thinking,” as well as 2P13: “The object of\nthe idea constituting the human mind is the body, or\n[sive] a certain mode of extension which actually exists,\nand nothing else” [italics added] (this is true already\nin KV, 1/27). In Letter 64 Spinoza tries to explain why we can only\nperceive these two attributes, and he does so by referring back to\n2P13 and claims in the letter: “Therefore, the mind’s\npower of understanding extends only as far as that which this idea of\nthe body contains within itself, or which follows therefrom. Now this\nidea of the body involves and expresses no other attributes of God\nthan extension and thought.” Although some have found this line\nof argumentation unsatisfying (e.g. Bennett, 1984, 78–79) it is\nworth noting that Spinoza here is relying on axioms.\n1.8 Ambiguities and Interpretative Directions\n\nThe attempt to understand Spinoza’s doctrine regarding the\nattributes has traditionally led interpreters in two main directions,\nalthough others have been proposed (e.g. Lennon, 2005. 12–30;\nShein,\n 2009).[11]\n The first is what is known as the “subjective”\ninterpretation which follows Hegel, and is given its paradigmatic\nexpression by Wolfson. More recently, Michael Della Rocca as been\nadvocating a more idealistic interpretation of the attributes, which\nshares certain important features with the subjectivist camp. The\nother, which has become the standard, is the “objective”\ninterpretation. These two principal avenues stem from some important\nambiguities in the definition of “attribute”: “By\nattribute I understand what the intellect perceives of substance as\nconstituting its essence”\n (1D4).[12]\n The first term that is ambiguous is “intellect,” since it\ncan refer either to the finite intellect or the infinite one (cf.\ndiagram in Section 1). The second important ambiguity lies in the\nLatin term tanquam, since it can mean either “as if,\nbut not in fact,” or “as in fact.” The definition\ncan therefore be read, either as stating that attributes are what the\nintellect perceives of substance as constituting its actual\nessence, or that attributes are what the intellect perceives only\nas if they are what constitute the essence but are not what\nin fact constitutes it or them. The subjectivists accordingly claim\nthat attributes are what the finite intellect perceives of substance\nas if constituting its essence. The objectivists, by and\nlarge, instead claim that it is the infinite intellect that perceives\nthe attribute as in fact constituting the essence of\nsubstance. In the following sections the different interpretative\noptions are explained a grosso modo. The ways in which the\ndifferent interpretative avenues affect other Spinozistic doctrines\nare discussed in Sections 1.9.1–1.9.4.\n1.8.1 Subjective Interpretations\n\nAs is well known, Hegel, in various respects, considered himself to be\nmodifying Spinoza’s doctrine (“to be a follower of Spinoza\nis the essential commencement of all philosophy”) and his\ninterpretation of Spinoza was extremely influential. In\nhis Lectures on the History of Philosophy, Hegel says that\nwhat has utmost reality for Spinoza is the absolute (or the infinite\nsubstance) and that anything else (finite modes, in particular) are\nways of negating this absolute. He goes on to explain that the\nunderstanding [or “intellect”] grasps the reality of\nsubstance through attributes, but “it is only reality in view of\nthe understanding.” He stresses that understanding in terms of\nattributes is due to the nature of the understanding and not because\nof the nature of the absolute (or the infinite substance) as such. It\nis clear that he considers the understanding to be the understanding\nof finite minds, because he goes on to explain that Spinoza’s\nclaim that there are “infinite attributes” has to be\ninterpreted as “infinite in character” and not in number\nand that there are only the two attributes known to finite\nminds—Thought and Extension.\n\nWhat is referred to in the literature as the subjectivist reading,\nfollowing Hegel, holds that the intellect perceiving the attributes is\nthe finite intellect and that the attributes are projections of the\nfinite mind onto the infinite substance which it cannot fully\ncomprehend. In other words, according to the subjectivist\ninterpretation, the definition of attribute states that attributes are\nwhat the finite intellect perceives of substance as if (but not in\nfact) constituting its essence. In contrast, the objectivist\nreading takes the intellect in question to be the infinite one, and\nthe tanquam to mean “as in fact,” and so it read\nthe definition as claiming that attributes are what the infinite\nintellect perceives of substance as (in fact) constituting\nits essence. Wolfson summarizes the difference between the two\npositions thus:\n\nAccording to the former interpretation [subjectivism], to be perceived\nby the mind means to be invented by the mind, for of\nthemselves the attributes have no independent existence at all but are\nidentical with the essence of the substance. According to the latter\ninterpretation [objectivism], to be perceived by the mind means only\nto be discovered by the mind, for even of themselves the\nattributes have independent existence in the essence of substance\n(Wolfson, 1934, 146).\n\n\nOne of the motivations behind Wolfson’s view is that he\nconsiders Spinoza to be the last of the medieval Jewish rationalists,\nand in following with that tradition, Spinoza locates all multiplicity\nnot in the infinite substance (God), but rather in the human mind.\nThat is, the fact that God has multiple attributes is explained not by\nhis having multiple essences, natures, or aspects, but rather because\nof the nature of the human mind. This is based on the conviction that\nGod’s true nature is simple and any multiplicity is merely\napparent but not real. It is because of the limitations of the finite\nmind that it attributes multiplicity to the infinite substance, when\nin reality the infinite substance is simple. In this view there is a\ngap between the attributes and the infinite substance. The infinite\nsubstance as it is in itself, so to speak, is unknowable to the finite\nmind. With respect to the “real distinction,” the\ndistinction between the attributes in this view is grounded in the\ndifferent ways the finite mind has of conceiving the infinite\nsubstance. That is, the distinction between the attributes is not\nbased on the nature of the infinite substance itself, but it reveals,\nin a way, something about the nature of finite perception. It is in\nthese terms that the “reality” of the distinction is to be\nunderstood, i.e., as if but not in fact.\n1.8.1.1 Objections to Subjectivism \n\nTwo main objections have been brought forth against the subjectivist\ninterpretation. These are considered by most commentators to be\nforceful enough for rejecting subjectivism as a serious contender for\na satisfying interpretation of Spinoza’s theory of attributes.\nThe first objection to subjectivism is that, finite minds can never\nhave true knowledge of God, but only knowledge “as if.”\nAll knowledge is rendered illusory. The reason for this is quite\nclear. In the subjectivist interpretation the attributes are\nprojections of the finite mind, therefore the finite mind can never\ncome to know the infinite substance as it is in itself. This seems to\ncontradict Spinoza’s claim that the finite mind can have\nadequate, that is, perfect knowledge of God’s essence (2P47).\nThe second objection is that this interpretation seems irreconcilable\nwith those places in the text where Spinoza identifies the attributes\nand God (cf. 1P4, 1P19 and 1P20Cor.). Again, as projections of the\nfinite intellect, the attributes do not properly pertain to the\nsubstance, and therefore cannot be identical to it. For these reasons,\namong others, the subjective interpretation (understood in these\nterms) has fallen out of\n favor.[13]\n Michael Della Rocca, however, has been advocating more recently that\nattributes (and diversity more generally), are mind-dependent yet not\nillusory. Thus he aims to overcome some of the traditional objections\nto subjectivism (primarily “illusory knowledge”\nobjections) while insisting on the mind-dependent status of\nattributes. He takes the mind-dependant nature of diversity (be it of\nattribute or modes) to be an inevitable consequence of Spinoza’s\nadoption of the Principle of Sufficient Reason (cf. Della Rocca,\n2012).\n1.8.2 Objective Interpretations\n\nIn light of these kinds of criticisms to the subjectivist\ninterpretation, commentators have turned towards what are known as\n“objectivist” accounts. Although the details of these\naccounts are quite diverse, there are a few key elements they\nshare—all related to the fact that they do not wish to be\nsubjectivist. The first of these characteristics is that they hold\nthat knowledge in the system cannot be illusory. That is, knowledge\nthrough attributes must yield true, or adequate, knowledge. One way to\ndo this is to claim that it is the infinite intellect that perceives\nthe attributes, and so knowledge through attributes is the kind of\nknowledge the infinite intellect has, and therefore is not illusory\n(e.g. Bennett, 1984, 147; Delahunty, 1985, 116; Della Rocca 1996, 157;\nHaserot, 1972, 32–35). Therefore, the tanquam in the\ndefinition is to be read “as in fact” and not “as\nif.”\n\nAs opposed to subjectivism, which does not emphasize the\n“reality” of the distinction between the attributes, or\nrather, does not ground the distinction in the nature of the infinite\nsubstance, objectivist interpretations place ontological weight on the\n“real distinction” between the attributes. In other words,\nfor the multiplicity to have a certain reality and not be illusory, it\nmust somehow be grounded not in the perceiver but in the thing\nperceived, namely, the infinite substance. The danger of this kind of\ninterpretation is that if the distinction is stressed too strongly,\nthe unity of the substance is lost. If the infinite substance has\n“really distinct” attributes, and this distinction is\ngrounded in, say, distinct natures or essences of the infinite\nsubstance, then there has to be an explanation of how a multiplicity\nof natures or essences can be united to form one substance. (This\nissue is addressed in further detail in Section 1.9.4 as it emerges in\nthe discussion of the nature of the union of mind and body).\n\nAny interpretation of Spinoza must characterize the relation between\nany given attribute and the substance. As mentioned, in the\nsubjectivist account there is a problematic gap between the substance\nand any given attribute. The alternative is to deny this gap. For\nexample, Bennett claims the following:\n\nI think that here [Ep. 9] he is saying that substance differs from\nattribute only by the difference between a substance and an adjectival\npresentation of the very same content. If we look for how that\nwhich is extended (substance) differs from extension\n(attribute), we find that it consists only in the notion of that\nwhich has… extension or thought or whatever; and that,\nSpinoza thinks, adds nothing to the conceptual content of\nextension, but merely marks something about how the content\nis logically structured. As I did in §12.7, he is rejecting the\nview that a property bearer is an item whose nature qualifies it to\nhave properties, in favour of the view that the notion of a property\nbearer, of a thing which…, is a bit of formal apparatus,\nsomething which organizes conceptual content without adding to it.\nAccording to this view, there is an emptiness about the difference\nbetween substance and attribute (Bennett, 1984, 62–63).\n\n\nAlthough Bennett claims there is an emptiness about the distinction\nbetween the two, he does not consider it an absolute identity either.\nHe finds an identity claim to be irreconcilable with the claim that\nattributes are really distinct. Della Rocca has suggested\nintentionality as a way of denying the gap and treats “…\nis extended” and “… is thinking” as\nreferentially opaque. In other words, what is being picked out by the\ninfinite intellect in either instance is the same, but the way in\nwhich it is picked out is different. Yet another way of denying the\ngap is to claim, along with Descartes, that the distinction between an\nattribute and the substance is only a rational distinction. That is,\nin reality there is no distinction, but in the finite mind we\ncan separate, contra natura, the attribute from the\nsubstance. Or in other words, the finite mind can abstract the\nattribute from the substance, but in reality they are not\nseparated. This type of view must be supplemented by an account, then,\nof what is meant by the “real distinction” among the\nattributes.\n1.9 Implications of the Various Readings on Other Spinozistic Doctrines\n1.9.1 Number of Attributes\n\nAlthough Spinoza claims that there are infinite attributes, a question\narises as to how many there are, because “infinity” may\nnot necessarily refer to numeric\n infinity.[14]\n Bennett, among others, has made the case that infinity in early\nmodern philosophy means totality (Bennett, 1984, 75–79).\nSpinoza’s claims, then, that the infinite substance has infinite\nattributes can be understood as the claim that the infinite substance\nhas all the attributes there are to be\n had.[15]\n This is consistent with there being, say, only the two known\nattributes. There are sections in the text, on the other hand, that\nseem to suggest that infinity means a numerical infinity, and thus the\ninfinite substance has as attributes Thought and Extension, as well as\ninfinitely many other unknown attributes. The places used as evidence\nfor those wishing to claim there are more than two attributes are the\nfollowing:\n\n\n1D6: By God I understand a being absolutely infinite, that is, a\nsubstance consisting of an infinity of attributes, of which each one\nexpresses an eternal and infinite essence.\n\nExp.: I say absolutely infinite, not infinite in its own kind; for if\nsomething is only infinite in its own kind, we can deny infinite\nattributes of it; but if something is absolutely infinite, whatever\nexpresses essence and involves no negation pertains to its\nessence.\n\n2P7Schol: Therefore whether we conceive Nature under the attribute of\nExtension, or the attribute of Thought, or any other attribute, we\nshall find one and the same order, or one and the same connection of\ncauses, that is the same things follow one another.\n\nLetter 56: To your [Hugo Boxel] question as to whether I have as clear\nan idea of God as of a triangle, I reply in the affirmative. But if\nyou ask me whether I have as clear a mental image of God as of a\ntriangle, I reply in the negative. We cannot imagine God, but we can\napprehend him by the intellect. Here it should also be observed that I\ndo not claim to have complete knowledge of God, but that I do\nunderstand some of his attributes—not indeed all of them, or the\ngreater part—and it is certain that my ignorance of very many\nattributes does not prevent me from having knowledge of some of them.\nWhen I was studying Euclid’s Elements, I understood\nearly on that the three angles of a triangle are equal to two right\nangles, and I clearly perceived this property of a triangle although I\nwas ignorant of many others.\n\n\nThis issue can be linked to the previous discussion regarding the\nambiguities in the definition of attribute, although this is not\nalways done. If one holds that it is the infinite intellect that is\ndoing the relevant perceiving, there seems to be no reason to limit\nthe number of attributes it perceives. Conversely, it might be claimed\nthat if the infinite intellect perceives only two attributes, there\nmust be a sufficient reason why there are only two, and why they are\nThought and Extension and not other attributes. If, on the other hand,\none holds that it is the finite intellect that conceives the\nattributes, and it only conceives Thought and Extension, then these\nare the only two attributes there are. In the literature, however,\nthis line of reasoning is not always followed, and examples can be\nfound of interpreters who hold that it is the infinite intellect that\ndoes the perceiving, but that there need not be more than two\nattributes (Bennett, 1984, 75–76). At the same time, there are\ninterpreters who claim it is the finite intellect that perceives the\nattributes while there are infinitely many attributes (Wolfson, 1934,\n226). How many attributes there are affects how one reads another\ncentral doctrine in Spinoza’s metaphysics, such as 2P7 and\n2P7Schol, to which we turn next.\n1.9.2 The Metaphysical Structure of 2P7 and its Scholium\n\nA crucial role in Spinoza’s system is played by 2P7 and its\nscholium, since they lay the ground for solving, or rather dissolving,\nthe mind–body problem. Therefore, the understanding of the\nnature of the union of mind and body depends on one’s\ninterpretation of Spinoza’s theory of attributes and 2P7 and its\nscholium in particular. (For a discussion of the issues regarding the\nunion of Mind and Body, see Section 1.9.4). The interpretation of the\nmetaphysical structure of what is expressed in 2P7 and its scholium is\naffected greatly by the number of attributes one believes there are in\nSpinoza’s system and how one understands the relation between\nthe attributes and the substance. The general description of 2P7 and\nits scholium is discussed above in Section 1.6.\n\n2P7 and its scholium can be understood in very different ways. In what\nfollows three types of interpretive directions are described. This is\nnot meant to be exhaustive by any means, but it will provide a sense\nof the kinds of options that have been offered by commentators. Let us\nbegin with the simplest option first. If one holds that there are only\ntwo attributes, Thought and Extension, the metaphysical structure of\n2P7 and its scholium is quite straightforward. Every mode under the\nattribute of Thought is associated with a mode in Extension, and\nvice versa and the relations between modes in one attribute\nare mirrored in the other. Those that hold this kind of view must, of\ncourse, provide a convincing argument to the effect that there are\nonly two attributes.\n\nHowever, if one takes there to be more than two attributes, the\nstructure gets quite a bit more complex. One option that has been\nadvanced is that Thought is a special attribute and encompasses ideas\nof all the modes in all the other attributes (Cf. for example Curley,\n1969, 146; and more recently, Melamed, 2009, Chapters 1–2).\nThought turns out to be “special” in this kind of\ninterpretation because there are many more modes (ideas) or facets of\nmodes in Thought than there are under any other attribute. Another way\nof expressing this is by saying that 2P7 is not a biconditional. The\nrequirement of an associated mode goes only in one direction from any\nmode in any attribute to a mode in Thought. The burden on this type of\nview is that it must account for the favoring of Thought over the\nother attributes, and perhaps also for the relation between all the\nnon-Thought modes in the other attributes.\n\nAnother option (or class of options) that is available is to claim\nthat attributes come in pairs: an object-like attribute coupled with a\nthought-like attribute (Curley entertains this option as well; Curley,\n1969, 146). Under this type of interpretation we would get Thought and\nExtension following the structure of the first alternative, that is,\neach idea in Thought is associated with (one and the same) a mode in\nExtension. Taking there to be more than just two attributes, we also\nget Thoughtx coupled with Extensionx in which\neach ideax is one and the same as bodyx under\nExtensionx, and Thoughty coupled with\nExtensiony, and so on. Letter 66 provides some support for\nthis view. This kind of account has to be supplemented, of course,\nwith an account of the relations among these Thought-like /\nExtension-like pairs of attributes.\n1.9.3 The Nature of the Identification of Substance and the Attributes\n\nAs mentioned earlier, Spinoza identifies God, or the infinite\nsubstance with the attributes (1P4, 1P19 and 1P20Cor.). The nature of\nthis identification is also affected by one’s interpretative\nstance regarding the attributes. The traditional subjectivist view,\nsince it claims that the attributes are a projection of the finite\nmind onto the substance, cannot hold this identification to be strict.\nObjectivist views, which stress the distinctness of attributes, also\ncannot accept these claims literally (E.g., Bennett, 1984, 64; Curley,\n1988, 13; Gueroult, 1968, 50). The reason for this is as follows: if\nthe substance is strictly identical to any one of its attributes, then\nattributes will be identical to each other (by transitivity), and\ntherefore no longer distinct, as Spinoza claims. Different objectivist\ninterpretations address this issue differently. Curley, for example,\nholds that the identity is not one that holds between any given\nattribute and the substance, but rather between the totality of the\nattributes and the substance (Curley, 1988, 30). Bennett, on the other\nhand, believes Spinoza is simply overstating the case (Bennett, 1984,\n64).\n\nThis identity can be understood strictly if the distinction between\nthe attributes and the substance is taken to be only rationally\ndistinct, that is identical in reality, and at the same time\ntaking the distinction between attributes to be only epistemological\nand not ontological.\n1.9.4 The Nature of the Union of Mind and Body\n\nAnother doctrine that is heavily affected by how one understands the\nattributes is the union of mind and body. For Descartes, the issue was\nhow to unite two really distinct created substances—uniting\nminds with bodies. Descartes’ reply is that God unites these two\nsubstances, and we have tools by which to recognize that we are united\nin this way, i.e., sensory experience (Meditation Six).\nSpinoza, of course, cannot allude to God as creator to unite minds and\nbodies, since what is being united are not created substances\nbut finite modes. The possible problem can be\narticulated as follows: How can Spinoza claim, on the one hand, that\nthere are modes of really distinct attributes, e.g., my mind and my\nbody, and therefore there is a real distinction between my mind and my\nbody, and, on the other, claim in the Scholium to 2P7 that my mind and\nbody are one and the same?\n\nThis problem which arises for the objectivist interpretations has been\naddressed in a variety of ways. It is worth noting that this problem\ndoes not arise for subjectivist views. This possible tension in\nSpinoza does not present itself for the subjectivists, since they do\nnot claim that the “real distinction” between the\nattributes has ontological weight. That is, there are no two things\nthat have to be united. Commentators wishing to stress the\n“distinctness” of the attributes find themselves having to\nexplain the sense in which Spinoza can mean that the mind and the body\nare “one and the same.” A common strategy among\ncommentators has been to appeal to a structure that is\nattribute-neutral in order to account for the unity. To better\nunderstand this issue it is useful to consider a few examples.\n\nOne important example is Bennett, who claims that the unity is to be\nunderstood as a unity of properties, but not of the modes\nthemselves:\n\n…his [Spinoza’s] thesis about the identity of physical\nand mental particulars is really about the identity of properties. He\ncannot be saying that physical P1=mental\nM1; that is impossible because they belong to\ndifferent attributes. His thesis is rather that if\nP1 is systematically linked with\nM1, then P1 is\nextension—and—F for some differentia F\nsuch that M1 is\nthought—and—F. What it takes for an extended\nworld to contain my body is exactly what it takes for a thinking world\nto contain my mind (Bennett, 1984, 141)\n\n\nThat is, Bennett thinks that there is some trans-attribute feature\n(what he calls “differentia F”) such that it can\nbe added to Extension to get extended-F, and added it to\nThought to get thinking-F. Bennett admits that nothing like\nthis is found anywhere in the text, but he believes that this way we\ncan make sense of Spinoza’s holding that the attributes are\n“really distinct” from each other and, at the same time,\nthat thinking-F and extended-F are one and the\nsame.\n\nDella Rocca, while holding a view different from that of Bennett\nregarding Spinoza’s theory of attributes, also finds himself\nhaving to account in some way for the unity of mind and body, and so\nhe suggests that modes are said to be numerically identical when they\nshare all of their neutral properties, where “neutral\nproperties” are those properties which do not involve being\nthought under any particular attributes. This is contrasted with\n“intentional properties” which are attribute-dependent\nsuch as “being of a certain volume.” As an example of a\nneutral property, Della Rocca offers “having five immediate\neffects.” He then claims that if modes share all of their\nneutral properties, they are identical (that is, one and the same).\nTherefore, since my mind and my body share all of their neutral\nproperties, they are identical (Della Rocca, 1996, 133–38).\n\nThe final example that shall be considered is Gueroult’s\ninterpretation. Gueroult, in order to account for the professed\nidentity between modes of different attributes in 2P7 and its\nscholium, considers 1P28 which states:\n\nEvery singular thing, or any thing which is finite and has a\ndeterminate existence, can neither exist nor be determined to produce\nan effect unless it is determined to exist and produce an effect by\nanother cause, which is also finite and has a determinate existence;\nand again, this cause also can neither exist nor be determined to\nproduce an effect unless it is determined to exist and produce an\neffect by another, which is also finite and has a determinate\nexistence, and so on, to infinity.\n\n\nTo explain this proposition, Gueroult draws a distinction between\n“modes of substance” and “modes of\nattributes.” The claim is that 1P28 treats only modes of\nsubstance and not attributes, and is therefore unique. In other words,\nthe identity is then understood in reference to “modes of\nsubstance” and not “modes of attributes” (Gueroult,\n1968, 338–39). Again, we see an attribute-independent\nstructure—the chain of modes of substance—that is meant to\naccount for the “one and the sameness” of modes of\ndifferent attributes.\n\nIt has been pointed out, however, that this type of solution is not\nwithout serious problems (Shein, 2009). Briefly, the issue is as\nfollows: The main reason for rejecting the subjectivist view is that\nin that type of interpretation, God, as he is in himself, remains\nunknowable, and this conflicts with Spinoza’s view that adequate\nknowledge is possible. However, as Spinoza makes clear in 1P10Schol,\nnature must be conceived under attributes. In light of this, an\nattribute-independent structure, by its very nature as\n“attribute-independent,” is unknowable as well. Therefore,\nin this view, knowledge of the union or the nature of the identity\nbetween mind and body, is in principle unknowable, and, in that\nrespect, does not provide any advantage over subjectivist views.\n\nAn alternative mentioned above that has been suggested is to deny the\ngap between the attributes and the substance by claiming that, along\nwith Descartes, Spinoza holds there to be a rational distinction\nbetween them, that is, in reality they are identical (Shein,\n2009). This avoids the kind of problems that are raised for the\nsubjectivist view, since, in this interpretation to know the\nattributes is to know the substance. Since in this view the attributes\nare only rationally distinct from the substance, the “real\ndistinction” between the attributes, that Spinoza states in\n1P10Schol, is understood as being only an epistemological claim, as he\nstates in the text—“i.e., one may be conceived without the\nother” (1P10Schol). That is, it does not carry additional\nontological weight as the objectivists hold. This avoids having to\nimpose onto the Spinozistic system an attribute-independent structure\nto account for the unity which does not seem to fit with his\nepistemology.\n2. Attributes in the Short Treatise\n\nIn the Short Treatise Spinoza develops ideas that will come\nto a full articulation later on in the Ethics, such as the\nidea that, strictly speaking, there are only two attributes through\nwhich we can properly come to have knowledge of God—Thought and\nExtension. However, unlike in the Ethics, he does not simply\ndismiss the more traditional attributes such as omnipotence,\neternality, immutability, and infinity. To maintain some sense of\nthese traditional divine attributes, Spinoza explains that they are\nnot attributes strictly speaking, but rather propria of God.\nThis is stated first clearly in the first footnote to Chapter III\n(“How God is the Cause of All Things”):\n\nThe following are called Propria because they are nothing but\nAdjectives which cannot be understood without their\nSubstantives. I.e., without them God would indeed not be God;\nbut still, he is not God through them, for they do not make known\nanything substantial, and it is only through what is substantial that\nGod exists.\n\n\nSpinoza then, is distinguishing between that which gives us knowledge\nof God, or better yet, through which God can be known—Thought\nand Extension—and things that can be said of God, that is,\nadjectival, but give us no knowledge—what he terms\npropria. This is explained most explicitly in Chapter VII of\nthe Short Treatise. The difference Spinoza wishes to draw\nbetween these is that although these traditional divine attributes can\nbe said of God, they do not teach us anything about what God is really\nlike. An analysis of these traditional attributes (propria)\nshows them either to be said of God when considering all of the\nattributes or to be only modes of attributes. For example, Spinoza\nclaims that when statements such as that “God is one,”\n“eternal” and “immutable” are said of God,\nthey are said “in consideration of all his attributes.” On\nthe other hand, something like “omniscience” is only a\nmode of an attribute, since it is only said of God when he is\nconceived through, or considered under, the attribute of Thought. That\nis, only when God is thought of as a thinking thing, can he be said to\nbe omniscient. Similarly, when God is said to be\n“omnipresent,” it is only when he is conceived of through\nExtension. In the Ethics though, Spinoza does away with the\ntalk of propria and does not accord them really any status as\nsuch.\n3. Conclusion\n\nWith the collapse of the divide between created substances and the\ninfinite substance, attributes play a new role for Spinoza;\ntraditional divine attributes are eliminated while attributes\ntraditionally associated with created substances (Extension in\nparticular) are attributed to the infinite substance. Furthermore,\nwith the elimination of this divide and the establishment of the\ninfinite substance as the only substance, Spinoza hopes that\nattributes account for variety in the substance without jeopardizing\nits unity. All interpreters and readers of Spinoza are forced to\nwrestle with making sense of this double role since it sits at the\nvery core of his metaphysics. It is vital to realize that this\nendeavor is necessarily and beautifully linked to other fundamental\naspects of Spinoza’s metaphysics such as the “real\ndistinction” between the attributes, the proclaimed identity of\nthe substance and its attributes, the nature of the conceiving\nintellect in the definition of ‘attribute’, the nature of\nthis intellect’s conceptions (illusory or not), the number of\nattributes, the structure of 2P7 and its scholium, and finally the\nnature of the union of mind and body. These inter-connections are a\nreflection of the fully systematic nature of Spinoza’s\nmetaphysics.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Allison, Henry E., 1987. <em>Benedict De Spinoza: An\nIntroduction</em>, New Haven: Yale University Press.",
                "Bennett, Jonathan Francis, 1984. <em>A Study of Spinoza’s\nEthics</em>, Indianapolis, IN: Hackett.",
                "Costa, Emanuele, 2023. “Spinoza and the Hybrid Distinction\nof Attributes,” <em>History of Philosophy &amp; Logical\nAnalysis</em>, 1–26. doi:10.30965/26664275-bja10063",
                "Curley, Edwin M., 1988. <em>Behind the Geometrical Method: A Reading\nof Spinoza’s Ethics</em>, Princeton, N.J.: Princeton University\nPress, 1988.",
                "–––, 1969. <em>Spinoza’s Metaphysics: An\nEssay in Interpretation</em>, Cambridge: Harvard University\nPress.",
                "Delahunty, R. J., 1985. <em>Spinoza</em>, Boston: Routledge &amp;\nKegan Paul.",
                "Della Rocca, Michael, 1996. <em>Representation and the\nMind–Body Problem in Spinoza</em>, New York: Oxford University\nPress.",
                "–––, 2008. <em>Spinoza</em>, London:\nRoutledge.",
                "–––, 2012. “Rationalism, idealism, monism,\nand beyond,” inn E. Förster &amp; Y. Melamed (eds.),\n<em>Spinoza and German Idealism</em>, pp. 7–26, Cambridge:\nCambridge University Press.",
                "Descartes, René. <em>The Philosophical Writings of\nDescartes</em>, Translated by John Cottingham, Robert Stoothoff and\nDugald Murdoch. 3 vols. Cambridge Cambridgeshire; New York: Cambridge\nUniversity Press, 1984.",
                "Di Poppa, Francesca, 2010. “Spinoza and Process\nOntology,” <em>Southern Journal of Philosophy</em>, 48(3):\n272–294.",
                "–––, 2009. “Spinoza’s Concept of\nSubstance and Attribute: A Reading of the Short Treatise,”\n<em>British Journal for the History of Philosophy</em>, 17(5):\n921–938.",
                "Donagan, Alan, 1966. “A Note on Spinoza,\n‘Ethics’, I, 10,” <em>Philosophical Review</em>, 75:\n380–82.",
                "–––, 1973. “Essence and the Distinction of\nAttributes in Spinoza’s Metaphysics,” in <em>Spinoza, a\nCollection of Critical Essays</em>, edited by Marjorie Glicksman\nGrene, 164–81. Garden City, N.Y.: Anchor Books.",
                "–––, 1989. <em>Spinoza</em>, Chicago: University\nof Chicago Press.",
                "Driggers, R. Kyle, 2021. “The unity of substance and attribute\nin Spinoza,” <em>British Journal for the History of\nPhilosophy</em>, 29(1): 45–63.",
                "Eisenberg, Paul, 1990. “On the Attributes and Their Alleged\nIndependence of One Another: A Commentary on Spinoza’s\n<em>Ethics</em> 1p10,” in <em>Spinoza: Issues and Directions:\nThe Proceedings of the Chicago Spinoza Conference</em>, edited by E.\nM. Curley and Pierre-François Moreau, 1–15. Leiden, New\nYork: E.J. Brill.",
                "Garrett, Aaron, 2003. <em>Meaning in Spinoza’s Method</em>,\nCambridge: Cambridge University Press.",
                "Gueroult, Martial, 1968. <em>Spinoza I – Dieu (Ethique,\nI)</em>, Hildesheim,: G. Olms.",
                "Haserot, Francis S., 1972. “Spinoza’s Definition of\nAttribute,” in <em>Studies in Spinoza, Critical and Interpretive\nEssays</em>, edited by S. Paul Kashap, 43–67. Berkeley:\nUniversity of California Press.",
                "Hegel, Georg Wilhelm Friedrich, <em>Hegel’s Lectures on the\nHistory of Philosophy</em> (Vol. 3), Elizabeth Sanderson Haldane, and\nFrances H. Simson (eds.), London New York: Routledge and Kegan Paul;\nHumanities Press, 1974, 252–90.",
                "Hoffman, Paul, 1986. “The Unity of Descartes’s\nMan,” <em>The Philosophical Review</em>, 95(3):\n339–70.",
                "Homan, Matthew, 2016. “On the Alleged Exceptional Nature of\nThought in Spinoza,” <em>Journal Of Philosophical Research</em>,\n41, 1–16.",
                "Jarrett, Charles, 1978. “The Logical Structure of\nSpinoza’s <em>Ethics</em>, Part I,” <em>Synthese</em>, 37:\n55–56.",
                "Keizer, Henk, 2012. “Spinoza’s Definition of\nAttribute: An Interpretation,” <em>British Journal for the\nHistory of Philosophy</em>, 20(3): 479–498.",
                "Lennon, Thomas M., 2005. “The Rationalist Conception of\nSubstance,” in <em>A Companion to Rationalism</em>, edited by\nAlan Nelson, Malden, MA: Blackwell, 12–30.",
                "–––, 2007. “The Eleatic Descartes,”\n<em>Journal of the History of Philosophy</em>, 45(1):\n29–47.",
                "Lin, Martin, 2006. “Substance, Attribute, and Mode in\nSpinoza,” <em>Philosophy Compass</em>, 1(2): 144–153.",
                "Melamed, Yitzhak, 2013. <em>Spinoza’s Metaphysics of\nSubstance and Thought</em>, Oxford: Oxford University Press.",
                "Newlands, Samuel, 2012. “Thinking, Conceiving, and Idealism\nin Spinoza,” <em>Archiv Fuer Geschichte Der Philosophie</em>,\n94(1): 31–52.",
                "–––, 2011. “Hegel’s Idealist Reading\nof Spinoza,” <em>Philosophy Compass</em>, 6(2):\n100–108.",
                "–––, 2011. “More Recent Idealist Readings\nof Spinoza,” <em>Philosophy Compass</em>, 6(2):\n109–119.",
                "Palmer, Eric, 1999. “Descartes on Nothing in Particular,” in\n<em>New Essays on the Rationalists</em>, ed. Rocco J. Gennaro and\nCharles Huenemann, New York: Oxford University Press,\n26–47.",
                "Salgado Borge, A., 2022.“Spinoza on the Distinction Between\nSubstance and Attribute,” <em>Philosophy</em>, 97(2):\n207–231.",
                "Shein, Noa, 2009. “The False Dichotomy between Objective and\nSubjective Interpretations of Spinoza’s Theory of\nAttributes,” <em>British Journal for the History of\nPhilosophy</em>, 17(3): 505–532.",
                "Silverman, Alex, 2016, “Two Meanings of\n‘Attribute’ in Spinoza,” <em>Archiv Fuer Geschichte\nDer Philosophie</em>. 98(1): 55–88.",
                "Sowaal, Alice, 2004. “Cartesian Bodies,” <em>Canadian\nJournal of Philosophy</em>, 34(2): 217–40.",
                "Spinoza, Baruch, <em>The Collected Works of Spinoza</em>,\ntranslated and edited by Edwin Curley, Volume 1, Princeton: Princeton\nUniversity Press, 1985.",
                "–––, <em>Opera</em>, edited by Carl Gebhardt, 4\nvolumes, Heidelberg: Carl Winter, 1925.",
                "Trisokkas, Ioannis, 2017. “The Two-Sense Reading of Spinoza's\ndefinition of attribute,” <em>British Journal for the History of\nPhilosophy</em>, 25(6): 1093–1115.",
                "Whiting, Daniel, 2011. “Spinoza, the no Shared Attribute\nThesis, and the Principle of Sufficient Reason,” <em>British\nJournal for the History of Philosophy</em>, 19(3): 543–548.",
                "Wolfson, Harry Austryn, 1934. <em>The Philosophy of Spinoza,\nUnfolding the Latent Processes of His Reasoning</em>, Cambridge,\nMass.: Harvard University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Allison, Henry E., 1987. <em>Benedict De Spinoza: An\nIntroduction</em>, New Haven: Yale University Press.</li>\n<li>Bennett, Jonathan Francis, 1984. <em>A Study of Spinoza’s\nEthics</em>, Indianapolis, IN: Hackett.</li>\n<li>Costa, Emanuele, 2023. “Spinoza and the Hybrid Distinction\nof Attributes,” <em>History of Philosophy &amp; Logical\nAnalysis</em>, 1–26. doi:10.30965/26664275-bja10063</li>\n<li>Curley, Edwin M., 1988. <em>Behind the Geometrical Method: A Reading\nof Spinoza’s Ethics</em>, Princeton, N.J.: Princeton University\nPress, 1988.</li>\n<li>–––, 1969. <em>Spinoza’s Metaphysics: An\nEssay in Interpretation</em>, Cambridge: Harvard University\nPress.</li>\n<li>Delahunty, R. J., 1985. <em>Spinoza</em>, Boston: Routledge &amp;\nKegan Paul.</li>\n<li>Della Rocca, Michael, 1996. <em>Representation and the\nMind–Body Problem in Spinoza</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2008. <em>Spinoza</em>, London:\nRoutledge.</li>\n<li>–––, 2012. “Rationalism, idealism, monism,\nand beyond,” inn E. Förster &amp; Y. Melamed (eds.),\n<em>Spinoza and German Idealism</em>, pp. 7–26, Cambridge:\nCambridge University Press.</li>\n<li>Descartes, René. <em>The Philosophical Writings of\nDescartes</em>, Translated by John Cottingham, Robert Stoothoff and\nDugald Murdoch. 3 vols. Cambridge Cambridgeshire; New York: Cambridge\nUniversity Press, 1984.</li>\n<li>Di Poppa, Francesca, 2010. “Spinoza and Process\nOntology,” <em>Southern Journal of Philosophy</em>, 48(3):\n272–294.</li>\n<li>–––, 2009. “Spinoza’s Concept of\nSubstance and Attribute: A Reading of the Short Treatise,”\n<em>British Journal for the History of Philosophy</em>, 17(5):\n921–938.</li>\n<li>Donagan, Alan, 1966. “A Note on Spinoza,\n‘Ethics’, I, 10,” <em>Philosophical Review</em>, 75:\n380–82.</li>\n<li>–––, 1973. “Essence and the Distinction of\nAttributes in Spinoza’s Metaphysics,” in <em>Spinoza, a\nCollection of Critical Essays</em>, edited by Marjorie Glicksman\nGrene, 164–81. Garden City, N.Y.: Anchor Books.</li>\n<li>–––, 1989. <em>Spinoza</em>, Chicago: University\nof Chicago Press.</li>\n<li>Driggers, R. Kyle, 2021. “The unity of substance and attribute\nin Spinoza,” <em>British Journal for the History of\nPhilosophy</em>, 29(1): 45–63.</li>\n<li>Eisenberg, Paul, 1990. “On the Attributes and Their Alleged\nIndependence of One Another: A Commentary on Spinoza’s\n<em>Ethics</em> 1p10,” in <em>Spinoza: Issues and Directions:\nThe Proceedings of the Chicago Spinoza Conference</em>, edited by E.\nM. Curley and Pierre-François Moreau, 1–15. Leiden, New\nYork: E.J. Brill.</li>\n<li>Garrett, Aaron, 2003. <em>Meaning in Spinoza’s Method</em>,\nCambridge: Cambridge University Press.</li>\n<li>Gueroult, Martial, 1968. <em>Spinoza I – Dieu (Ethique,\nI)</em>, Hildesheim,: G. Olms.</li>\n<li>Haserot, Francis S., 1972. “Spinoza’s Definition of\nAttribute,” in <em>Studies in Spinoza, Critical and Interpretive\nEssays</em>, edited by S. Paul Kashap, 43–67. Berkeley:\nUniversity of California Press.</li>\n<li>Hegel, Georg Wilhelm Friedrich, <em>Hegel’s Lectures on the\nHistory of Philosophy</em> (Vol. 3), Elizabeth Sanderson Haldane, and\nFrances H. Simson (eds.), London New York: Routledge and Kegan Paul;\nHumanities Press, 1974, 252–90.</li>\n<li>Hoffman, Paul, 1986. “The Unity of Descartes’s\nMan,” <em>The Philosophical Review</em>, 95(3):\n339–70.</li>\n<li>Homan, Matthew, 2016. “On the Alleged Exceptional Nature of\nThought in Spinoza,” <em>Journal Of Philosophical Research</em>,\n41, 1–16.</li>\n<li>Jarrett, Charles, 1978. “The Logical Structure of\nSpinoza’s <em>Ethics</em>, Part I,” <em>Synthese</em>, 37:\n55–56.</li>\n<li>Keizer, Henk, 2012. “Spinoza’s Definition of\nAttribute: An Interpretation,” <em>British Journal for the\nHistory of Philosophy</em>, 20(3): 479–498.</li>\n<li>Lennon, Thomas M., 2005. “The Rationalist Conception of\nSubstance,” in <em>A Companion to Rationalism</em>, edited by\nAlan Nelson, Malden, MA: Blackwell, 12–30.</li>\n<li>–––, 2007. “The Eleatic Descartes,”\n<em>Journal of the History of Philosophy</em>, 45(1):\n29–47.</li>\n<li>Lin, Martin, 2006. “Substance, Attribute, and Mode in\nSpinoza,” <em>Philosophy Compass</em>, 1(2): 144–153.</li>\n<li>Melamed, Yitzhak, 2013. <em>Spinoza’s Metaphysics of\nSubstance and Thought</em>, Oxford: Oxford University Press.</li>\n<li>Newlands, Samuel, 2012. “Thinking, Conceiving, and Idealism\nin Spinoza,” <em>Archiv Fuer Geschichte Der Philosophie</em>,\n94(1): 31–52.</li>\n<li>–––, 2011. “Hegel’s Idealist Reading\nof Spinoza,” <em>Philosophy Compass</em>, 6(2):\n100–108.</li>\n<li>–––, 2011. “More Recent Idealist Readings\nof Spinoza,” <em>Philosophy Compass</em>, 6(2):\n109–119.</li>\n<li>Palmer, Eric, 1999. “Descartes on Nothing in Particular,” in\n<em>New Essays on the Rationalists</em>, ed. Rocco J. Gennaro and\nCharles Huenemann, New York: Oxford University Press,\n26–47.</li>\n<li>Salgado Borge, A., 2022.“Spinoza on the Distinction Between\nSubstance and Attribute,” <em>Philosophy</em>, 97(2):\n207–231.</li>\n<li>Shein, Noa, 2009. “The False Dichotomy between Objective and\nSubjective Interpretations of Spinoza’s Theory of\nAttributes,” <em>British Journal for the History of\nPhilosophy</em>, 17(3): 505–532.</li>\n<li>Silverman, Alex, 2016, “Two Meanings of\n‘Attribute’ in Spinoza,” <em>Archiv Fuer Geschichte\nDer Philosophie</em>. 98(1): 55–88.</li>\n<li>Sowaal, Alice, 2004. “Cartesian Bodies,” <em>Canadian\nJournal of Philosophy</em>, 34(2): 217–40.</li>\n<li>Spinoza, Baruch, <em>The Collected Works of Spinoza</em>,\ntranslated and edited by Edwin Curley, Volume 1, Princeton: Princeton\nUniversity Press, 1985.</li>\n<li>–––, <em>Opera</em>, edited by Carl Gebhardt, 4\nvolumes, Heidelberg: Carl Winter, 1925.</li>\n<li>Trisokkas, Ioannis, 2017. “The Two-Sense Reading of Spinoza's\ndefinition of attribute,” <em>British Journal for the History of\nPhilosophy</em>, 25(6): 1093–1115.</li>\n<li>Whiting, Daniel, 2011. “Spinoza, the no Shared Attribute\nThesis, and the Principle of Sufficient Reason,” <em>British\nJournal for the History of Philosophy</em>, 19(3): 543–548.</li>\n<li>Wolfson, Harry Austryn, 1934. <em>The Philosophy of Spinoza,\nUnfolding the Latent Processes of His Reasoning</em>, Cambridge,\nMass.: Harvard University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Descartes, René",
            "Descartes, René: physics",
            "dualism",
            "Spinoza, Baruch",
            "Spinoza, Baruch: modal metaphysics",
            "Spinoza, Baruch: physical theory",
            "Spinoza, Baruch: psychological theory",
            "substance"
        ],
        "entry_link": [
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../descartes-physics/": "Descartes, René: physics"
            },
            {
                "../dualism/": "dualism"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../spinoza-modal/": "Spinoza, Baruch: modal metaphysics"
            },
            {
                "../spinoza-physics/": "Spinoza, Baruch: physical theory"
            },
            {
                "../spinoza-psychological/": "Spinoza, Baruch: psychological theory"
            },
            {
                "../substance/": "substance"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=spinoza-attributes\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/spinoza-attributes/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=spinoza-attributes&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/spinoza-attributes/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=spinoza-attributes": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/spinoza-attributes/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=spinoza-attributes&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/spinoza-attributes/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.perturbedintellect.typepad.com/necessarilyeternal/\" target=\"other\">Necessarily Eternal: A Catablog of All Things Spinoza</a>"
        ],
        "listed_links": [
            {
                "http://www.perturbedintellect.typepad.com/necessarilyeternal/": "Necessarily Eternal: A Catablog of All Things Spinoza"
            }
        ]
    }
}