{
    "url": "suicide",
    "title": "Suicide",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Michael Cholbi\n<mcholbi@ed.ac.uk>",
        "author_links": [
            {
                "http://michael.cholbi.com/": "Michael Cholbi"
            },
            {
                "mailto:mcholbi%40ed%2eac%2euk": "mcholbi@ed.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://michael.cholbi.com/\" target=\"other\">Michael Cholbi</a>\n&lt;<a href=\"mailto:mcholbi%40ed%2eac%2euk\"><em>mcholbi<abbr title=\" at \">@</abbr>ed<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue May 18, 2004",
        "substantive revision Tue Nov 9, 2021"
    ],
    "preamble": "\n\nThroughout history, suicide has evoked an astonishingly wide range of\nreactions—bafflement, dismissal, heroic glorification, sympathy,\nanger, moral or religious condemnation—but it is never\nuncontroversial. For example, suicide has long been a central concern\nwithin many academic disciplines, including sociology, anthropology,\npsychology, and psychiatry. These disciplines converge in the\nmultidisciplinary field of suicidology. But there remain many\ncontroversies within suicidology, including which methodologies are\nbest suited to identify the causes of suicide and whether the study of\nsuicide can be fully disentangled from researchers’ political or\ninstitutional commitments. (Maung 2020; for concerns about the\npolitical dimensions of suicide research, see work within\n’critical suicidology’ such as White et al. 2016)\n\nBut perhaps the most enduring controversies surrounding suicide are\nphilosophical. For philosophers, suicide raises a host of conceptual,\nmoral, and psychological questions. Among these questions are: What\nmakes a person’s behavior suicidal? What motivates such\nbehavior? Is suicide morally permissible, or even morally required in\nsome extraordinary circumstances? Is suicidal behavior rational? Is\naiding others to commit suicide morally permissible or even required\nin some extraordinary circumstances? This article will examine the\nmain currents of historical and contemporary Western philosophical\nthought surrounding these questions.\n",
    "toc": [
        {
            "#ChaSui": "1. Characterizing Suicide"
        },
        {
            "#HigHisTho": "2. Highlights of Historical Western Thought"
        },
        {
            "#AncClaVieSui": "2.1 Ancient and Classical Views of Suicide"
        },
        {
            "#ChrPro": "2.2 The Christian Prohibition"
        },
        {
            "#EnlModDev": "2.3 The Enlightenment and Modern Developments"
        },
        {
            "#MorRatSui": "3. The Morality and Rationality of Suicide"
        },
        {
            "#MorPer": "3.1 Moral Permissibility"
        },
        {
            "#DeoArgSanLif": "3.2 The Deontological Argument from the Sanctity of Life"
        },
        {
            "#RelArg": "3.3 Religious Arguments"
        },
        {
            "#LibVieRigSui": "3.4 Libertarian Views and the Right to Suicide"
        },
        {
            "#SocUtiRolBasArg": "3.5 Social, Utilitarian, and Role-Based Arguments"
        },
        {
            "#SuiMorDut": "3.6 Suicide as a Moral Duty?"
        },
        {
            "#AutRatRes": "3.7 Autonomy, Rationality, and Responsibility"
        },
        {
            "#DutTowSui": "3.8 Duties Toward the Suicidal"
        },
        {
            "#SuiVirMean": "3.9 Suicide, Virtue, and Life’s Meaning "
        },
        {
            "#Con": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#HisPre190WorCit": "A. Historical (pre-1900) Works Cited"
        },
        {
            "#WorCit190Pre": "B. Works Cited, 1900–Present"
        },
        {
            "#FurRea": "C. Further Reading"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Characterizing Suicide\n\nCharacterizing suicide precisely faces a number of philosophical\nchallenges.\n\nOne challenge stems from the strongly negative emotional or moral\nconnotations of the term ‘suicide’. Efforts to distinguish\nsuicidal behavior from other behavior often clandestinely import moral\njudgments about the aims or moral worth of such behavior. That is,\nviews about the nature of suicide often incorporate, sometimes\nunknowingly, views about the prudential or moral justifiability of\nsuicide and are therefore not value-neutral descriptions of suicide\n(Paterson 2003, 353, Cholbi 2011, 17–20). For example, Hitler,\nmost people contend, clearly died due to suicide, but Socrates and\nJesus did not (though on Socrates, see Frey 1978). That the deaths of\nthe morally villainous are more readily seen as suicides than the\ndeaths of the morally admirable illustrates that suicide still carries\na strongly negative subtext. A similar phenomenon is present within\nsocietal discourse concerning individuals near the end of life who\nseek medical assistance to die. Advocacy and professional\norganizations have largely succeeded in changing the terminology used\nin public discussions of such individuals from ‘assisted\nsuicide’ or ‘physician-assisted suicide’ to\n‘assisted dying’ or ‘death with dignity,’\ndespite the strong similarities between these acts and suicide of\nother kinds. (Friesen 2020, Reed 2020) Presumably, such groups have\ndone so from the belief that the negative connotations of\n‘suicide’ will reduce public support for the cause of\nlegalizing medical assistance in dying.\n\n‘Suicide’ may well turn out to be a value-laden concept,\none that cannot be defined in a morally neutral way.\nNevertheless, it would be desirable to identify a\ndefensible conception of suicide that is not value-laden\n(Stern-Gillett 1987, Kupfer 1990) For those debating the morality of\n‘suicide’ are likely to be at cross purposes if some\ndefine ‘suicide’ as wrongful\nself-killing (in the way that ‘murder’ can be\ndefined as wrongful killing of another) while others\noperate with a definition that does not entail that all acts of\nsuicide are wrongful. The former rules out the prospect of\nmorally defensible ‘suicide’ while the latter allows for\nit. A more fruitful debate is likely to result if such debates are\norganized around a shared descriptive definition of suicide that does\nnot beg the question about the possibility of its being justified.\n\nIf a purely descriptive account of suicide is possible, where should\nit begin? While it is tempting to say that suicide is any self-caused\ndeath, this account is vulnerable to obvious counterexamples (though\nfor a defense of such a view, see Dowie 2020). An individual who knows\nthe health risks of smoking or of skydiving, but willfully engages in\nthese behaviors and dies as a result, could be said to be causally\nresponsible for her own death but not to have died by suicide.\nSimilarly, an individual who takes a swig of hydrochloric acid,\nbelieving it to be lemonade, and subsequently dies causes her own\ndeath but does not engage in suicidal behavior. Moreover, not only are\nthere self-caused deaths that are not suicides, but there are\nbehaviors that result in death and are arguably suicidal in which the\nagent is not the cause of her own death or is so only at one remove.\nThis can occur when an individual arranges the circumstances for her\ndeath. A terminally ill patient who requests that another person\ninject her with a lethal dose of tranquilizers has, intuitively, died\nby suicide. Though she is not immediately causally responsible for her\ndeath, she appears morally responsible for her death, since she\ninitiates a sequence of events which she intended to culminate in her\ndeath, a sequence which cannot be explained without reference to her\nbeliefs and desires. (Such a case exemplifies\n voluntary euthanasia.)\n Likewise, those who die via ‘suicide by cop,’ where an\narmed crime is committed in order to provoke police into killing its\nperpetrator, are responsible for their own deaths despite not being\nthe causes of their deaths. In these kinds of cases, such agents would\nnot die, or would not be at an elevated risk for death, were it not\nfor their initiating such causal sequences. (See Brandt 1975, Tolhurst\n1983, Frey 1981, but for a possible objection see Kupfer 1990.)\n\nFurthermore, many philosophers (Fairbairn 1995, chapter 5) doubt\nwhether an act’s actually resulting in death is essential to\nsuicide at all. Just as there can be attempted murders or attempted\nacts of deception, so too can there be ‘attempted’\nsuicides, instances where because of agents’ false beliefs\n(about the lethality of their behavior, for example), unforeseen\nfactual circumstances, others’ interventions, etc., an act which\nmight have resulted in an agent’s death does not.\n\nHence, suicidal behavior need not result in death, nor must the\ncondition that hastens death be self-caused. Definitions according to\nwhich suicide occurs when a person acts knowing that her act will\ncause her own death (Durkheim (1897)) thus fail to capture how death\nis in some respect an aim of suicidal behavior. Second, what\nappears essential for a behavior to count as suicide is that the\nperson in question chooses to die. From the perspective of\nthe suicidal actor, that she may die from her act is, in the case of\nsuicide, not a mere coincidence. An act’s being suicide, rather\nthan merely being risky to one’s life, thus seems to depend on\nthe individual’s intentions, where an intention\nimplicates an individual’s beliefs and desires about her action.\n(See Brandt 1975, Graber 1981 Tolhurst 1983, Frey 1978, O’Keeffe\n1981, McMahan 2002, 455, Paterson 2003, Cholbi 2011, 20–31, Hill\n2011) An intention-based account of suicide would say, roughly,\nthat\n\nA person S’s behavior B is suicidal iff\n\n\nS believed that B, or some causal consequence of\nB, would hasten her death (i.e, her death would occur earlier\nin time than it would have in B’s absence), and\nS intended to die by engaging in B.\n \n\n\nThis account renders more precise the notion of suicide as an effort\nto bring about one’s own death, but it is not unproblematic.\n\nCondition (a) is a doxastic condition. It implies that deaths\n(or increased risks for death) resulting from an individual’s\nact that causes death (or the risk thereof) are not suicides if the\nindividual acts in ignorance of the relevant risks of her behavior\n(for example, when an individual accidentally takes a lethal dose of a\nprescription drug). At the same time, (a) accounts for cases such as\nthe aforementioned terminally ill patient whose death is caused only\nindirectly by her request to die. Condition (a) does not require that\nS know that B will put her at a\nsignificantly greater risk for death, nor even that S’s\nbeliefs about B’s lethality be true or even justified.\nSuicidal individuals sometimes have false beliefs about the lethality\nof their chosen suicide methods, greatly overestimating the lethality\nof over the counter painkillers while underestimating the lethality of\nhandguns, for instance. An individual could believe falsely, or on the\nbasis of inadequate evidence, that placing one’s head in an\nelectric oven significantly increases one’s chances of dying,\nbut that behavior is nonetheless suicidal. The demand that S\nbelieve that B makes death highly likely is admittedly\ninexact, but it permits us to navigate between two extreme and\nmistaken views. On the one hand, it implies that behavior which is in\nfact only marginally more likely to cause a person’s death is\nnot suicidal (you are more likely to die driving your car than in your\nliving room, but driving your car hardly qualifies as\n‘suicidal’). On the other hand, to demand that S believe\nthat B certainly or almost certainly will cause\nS’s death is too strict, since it will rarely be the\ncase (given the possibility of intervening conditions, etc.) that\nB will necessarily cause S’s death, and in\nfact many suicidal individuals are ambivalent about their actions\n(Cholbi 2011, 31–35), an ambivalence which is in turn reflected\nin their selecting suicide methods that are far from certain to cause\ndeath. Condition (a) also allows us to distinguish genuinely suicidal\nbehavior from suicidal gestures, in which individuals engage\nin behavior they believe is not likely to cause their death\nbut is nonetheless associated with suicide attempts, while in fact\nhaving some other intention (e.g., gaining others’ attention) in\nmind.\n\nCondition (b), however, is far more knotty. For what is it to intend\nthat death result from one’s behavior? There are examples in\nwhich condition (a) is clearly met, but whether (b) is met is more\nproblematic. For instance, does a soldier who leaps upon a live\ngrenade tossed into a foxhole in order to save his comrades engage in\nsuicidal behavior? Many, especially partisans of\n the doctrine of double effect\n would answer ‘no’: Despite the fact that the soldier knew\nhis behavior would likely cause him to die, his intention was to\nabsorb the blast so as to save the other soldiers, whereas his death\nwas only a foreseen outcome of his action. Needless to say, whether a\nclear divide exists between foreseen and intended outcomes is\ncontroversial, and critics raise the worry that almost any outcome can\nbe described as foreseen (Glover 1990, ch. 6). (It is of course\npossible that whether death is foreseen or intended has no bearing on\nwhether an act counts as suicide but still bears on whether any\nparticular suicidal act is justified.) Some would argue that given the\nnear certainty of his dying by jumping on the grenade, his death was\nintended, for even though death is not the justifying aim of his\naction and he may prefer not to die, his dying nevertheless has his\nendorsement in the circumstances in which he acts (Tolhurst 1983,\nCholbi 2011, 26–31). A further complication is that current\npsychological evidence suggests that suicide is often an ambivalent\nact in which individuals who wish to die must nevertheless overcome\nthe ordinary human fear of death (Cholbi 2011, 31–34, Joiner\n2010, 62–70). Given this ambivalence, whether an act that\nposed an apparently lethal threat to the agent who performed it\nwas intended to hasten her death can be hard to decipher. When a\nperson dies in such circumstances, it may prove difficult whether to\nclassify the death as resulting from suicide (i.e., intentional\nself-killing) or as accidental. Such cases might indicate the need for\na third category besides intentional suicide and accidental death\n(Cholbi 2007).\n\nThe essential logical difficulty here resides in the notion of\nintending to die, for acting so as to produce one’s death nearly\nalways has some other aim or justification. That is, death is\ngenerally not chosen for its own sake, or is not the end of suicidal\nbehavior. Suicidal behavior can have any number of objectives: the\nrelief of physical pain, the relief of psychological anguish,\nmartyrdom in the service of a moral cause, the fulfillment of\nperceived societal duties (e.g., suttee and\nseppuku), the avoidance of judicial execution, revenge on\nothers, protection of others’ interests or well-being. (See\nFairbairn 1995, ch. 9, for a taxonomy of the varieties of suicide.)\nTherefore, it is not the case that suicidal individuals intend death\nper se, but rather that death is perceived, rightly or wrongly, as a\nmeans for the fulfillment of another of the agent’s aims (Graber\n1981, 56). In short, there do not appear to be any compelling examples\nof “noninstrumental” self-killings in which “the\noverriding intention is simply to end one’s life and there is no\nfurther independent objective involved in the action”\n(O’Keeffe 1981, 357). Nor does requiring that the individual\nwish to be dead (Fairbairn 1995, ch. 6) address this issue,\nsince again, what one wishes is presumably not death itself but some\noutcome of death. Both the grenade-jumping soldier and the depressed\nindividual may wish not to die insofar as they might prefer that their\ndesires could be satisfied without dying or without putting themselves\nat the risk thereof. However, this is consistent with their willingly\nchoosing to die in order to satisfy their aims.\n\nSome (e.g., Beauchamp 1992, Cholbi 2011, 35–37) might wish to\nadd a further condition to (a) and (b) above:\n\nS was not coerced into B-ing.\n\n\nWhat speaks in favor of condition (c)? Typically, coercion\ndenotes intervention by others wherein a person comes to find\nherself with a reason to act in a certain way because of\nanother’s threat or use of force. Coerced decisions seem not to\nbe entirely our own, inasmuch we act in accordance with the will of\nthe coercer rather than acting freely on the basis of our own prior\ndesires. Applied to cases where individuals act intentionally to\nhasten their own deaths, this implies that such cases are not\ninstances of suicide, for while the individual may cause their own\ndeath, they do not have their own reasons to end their\nlives. Hence, according to condition (c), a spy threatened with\ntorture lest he relinquish crucial military secrets who then poisons\nhimself did not die by suicide since the spy’s captors compelled\nhim to take his life. \n\nWhether an attempt to intentionally hasten one’s death is\ncoerced or not is relevant to whether that attempt is\njustified. But condition (c) may rest on an\nirrelevant distinction: Many of the reasons individuals have for\nintentionally hastening death arguably originate outside themselves\nmuch in the way that a coerced agent’s reasons originate outside\nthemselves too. An extremely ill patient S may opt to take their own\nlife rather endure severe and ongoing physical pain. But compare\nS to T, who opts to take their own life because of severe and ongoing\nphysical pain caused by the choices of her torturer U. S and T seem to\nhave the same kinds of reasons to intentionally hasten their own\ndeaths, reasons originating outside themselves. According to condition\n(c), the crucial difference is that T is not engaging in suicide\nbecause T’s reasons originate in U’s decision to engage in\ntorture, whereas S is engaging in suicide because S’s reasons do\nnot originate in the will or decisions of another individual. Can the\nnature of an action depend upon whether the reasons that justify it\noriginate in another person’s will or decisions? This does not\nseem obvious. Coercion does not seem to alter the action as such, even\nif it alters whether their actions are justified or blameworthy. A\nperson coerced into singing is singing, no less than a person who\nsings of her own accord; a person coerced into withdrawing money from\nher bank account withdraws money from her bank account, no less than\nif she did of her own accord; etc. Condition (c) thus seems to impose\non the definition of suicide a requirement that does not seem to apply\nto other types of action.\n\nThis brief attempt at conceptual analysis of suicide illustrates the\nfrustrations of such a project, as the unclear notion of suicide is\napparently replaced by equally unclear notions such as intention and\ncoercion. We may be attracted to increasingly convoluted analyses of\nsuicide (Donnelly 1998, 20) or accept that suicide is an ‘open\ntextured’ concept instances of which are bound together only by\nweak Wittgensteinian family resemblance and hence resistant to\nanalysis in terms of necessary and sufficient conditions (Windt\n1981).\n\nAn alternative to providing necessary and sufficient conditions for\nsuicidal behavior is to view it along a continuum. In the\npsychological sciences, many suicidologists view suicide not as an\neither/or notion but as a gradient notion, admitting of degrees based\non individuals’ beliefs, strength of intentions, and attitudes.\nThe Beck Scale for Suicidal Ideation is perhaps the best example of\nthis approach. (See Beck 1979.)\n2. Highlights of Historical Western Thought This section outlines the main currents of historical\nphilosophical thought about suicide in ‘the West’ (Europe,\nthe Middle East, and North America). Such an emphasis should not\nobscure the rich traditions of thought originating outside those\ngeographical confines, however. Important thinkers from Africa, Asia,\nand the indigenous populations of the Western hemisphere took a\nphilosophical interest in suicide. Little appears to unite\nphilosophical thinking about suicide from these traditions aside from\nthe fact that they are far less influenced by monotheism than is the\nWestern tradition. Some of the ethical considerations concerning\nsuicide raised in these traditions are also found in Western thought.\nFor instance, the claim that suicide may violate ethical duties to\nothers is addressed by Confucius, who primarily views the matter\nthrough the lens of filial piety (Confucius 2003). Others, for example\nthe Jain practice of sallekhana, a type of spiritual fasting\nintended to hasten death, do not seem to have correlates in the\nWestern tradition (Umaswati 1992). Unfortunately, the diversity of\npositions within the non-Western traditions preclude easy summation.\nThose interested in these traditions are urged to consult Battin\n(2015). (The\n online archive\n of Battin (2015) is particularly useful in this regard; users can\nsearch for philosophical writings on suicide based on geographic\norigin and intellectual tradition.)\n\n2.1 Ancient and Classical Views of Suicide\n\nWestern philosophical discourse about suicide stretches back at least\nto the time of Plato. As John Cooper has noted (Cooper 1989, 10),\nneither ancient Greek nor Latin had a single word that aptly\ntranslates our ‘suicide,’ even though most of the ancient\ncity-states criminalized self-killing.\n\nPlato explicitly discussed suicide in two works. First, in\nPhaedo, Socrates expresses guarded enthusiasm for the thesis,\nassociated with the Pythagoreans, that suicide is always wrong because\nit represents our releasing ourselves (i.e., our souls) from a\n“guard-post” (i.e., our bodies) the gods have placed us in\nas a form of punishment (Phaedo 61b-62c). Later, in the\nLaws, Plato claimed that suicide is disgraceful and its\nperpetrators should be buried in unmarked graves. However, Plato\nrecognized four exceptions to this principle: (1) when one’s\nmind is morally corrupted and one’s character can therefore not\nbe salvaged (Laws IX 854a3–5), (2) when the\nself-killing is done by judicial order, as in the case of Socrates,\n(3) when the self-killing is compelled by extreme and unavoidable\npersonal misfortune, and (4) when the self-killing results from shame\nat having participated in grossly unjust actions (Laws IX\n873c-d). Suicide under these circumstances can be excused, but,\naccording to Plato, it is otherwise an act of cowardice or laziness\nundertaken by individuals too delicate to manage life’s\nvicissitudes. Aristotle’s only discussion of suicide\n(Nicomachean Ethics 1138a5–14) occurs in the midst of a\ndiscussion of the possibility of treating oneself unjustly. Aristotle\nconcludes that self-killing does not treat oneself unjustly so long as\nit is done voluntarily because the harm done to oneself is consensual.\nHe concludes that suicide is somehow a wrong to the state or the\ncommunity, though he does not outline the nature of this wrong or the\nspecific vices that suicidal individuals allegedly exhibit.\n\nTo contemporary readers, the most striking feature of Plato’s\nand Aristotle’s texts on suicide is their relative absence of\nconcern for individual well-being or rights. Both limit the\njustifications for suicide largely to considerations about an\nindividual’s social roles and obligations. In contrast, the\nStoics held that whenever the means to living a naturally flourishing\nlife are not available to us, suicide may be justified, regardless of\nthe character or virtue of the individual in question. Our natures\nrequire certain “natural advantages” (e.g., physical\nhealth) in order for us to be happy, and a wise person who recognizes\nthat such advantages may be lacking in her life sees that ending her\nlife neither enhances nor diminishes her moral virtue.\n\nWhen a man’s circumstances contain a preponderance of things in\naccordance with nature, it is appropriate for him to remain alive;\nwhen he possesses or sees in prospect a majority of the contrary\nthings, it is appropriate for him to depart from life…. Even\nfor the foolish, who are also miserable, it is appropriate for them to\nremain alive if they possess a predominance of those things which we\npronounce to be in accordance with nature (Cicero, III, 60–61).\n\n\nHence, not only may concerns related to one’s obligations to\nothers justify suicide, but one’s own private good is relevant\ntoo. The Roman Stoic Seneca, who was himself compelled to engage in\nsuicide, was even bolder, claiming that since “mere living is\nnot a good, but living well”, a wise person “lives as long\nas he ought, not as long as he can.” For Seneca, it is the\nquality, not the quantity, of one’s life that matters.\n2.2 The Christian Prohibition\n\nThe advent of institutional Christianity was perhaps the most\nimportant event in the philosophical history of suicide, for Christian\ndoctrine has by and large held that suicide is morally wrong, despite\nthe absence of clear Scriptural guidance regarding suicide. Although\nthe early church fathers opposed suicide, St. Augustine is generally\ncredited with offering the first justification of the Christian\nprohibition on suicide (Amundsen 1989). He saw the prohibition as a\nnatural extension of the fifth commandment:\n\nGod’s command ‘Thou shalt not kill,’ is to be taken\nas forbidding self-destruction, especially as it does not add\n‘thy neighbor’, as it does when it forbids false witness,\n‘Thou shalt not bear false witness against thy neighbor.’\n(Augustine, book I, chapter 20)\n\n\nSuicide, Augustine determined, was an unrepentable sin. St. Thomas\nAquinas later defended this prohibition on three grounds. (1) Suicide\nis contrary to natural self-love, whose aim is to preserve us. (2)\nSuicide injures the community of which an individual is a part. (3)\nSuicide violates our duty to God because God has given us life as a\ngift and in taking our lives we violate His right to determine the\nduration of our earthly existence (Aquinas 1271, part II, Q64, A5).\nThis conclusion was codified in the medieval doctrine that suicide\nnullified human beings’ relationship to God, for our control\nover our body was limited to usus (possession, employment)\nwhere God retained dominium (dominion, authority). Law and\npopular practice in the Middle Ages sanctioned the desecration of the\nsuicidal corpse, along with confiscation of the individual’s\nproperty and denial of Christian burial.\n\nThe rediscovery of numerous texts of classical antiquity was one of\nthe spurs of the Renaissance, but for the most part, Renaissance\nintellectuals generally affirmed the Church’s opposition to\nsuicide and were not sympathetic to the more permissive attitudes\ntoward suicide found among the ancient pagans. Two intriguing\nsixteenth century exceptions were Thomas More and Michel de Montaigne.\nIn his Utopia, More appears to recommend voluntary suicide\nfor those suffering from painful and incurable diseases, though the\nsatirical and fantastical tone of that work makes it doubtful that\nMore supported this proposal in reality. In his Essais,\nMontaigne relates several anecdotes of individuals taking their own\nlives and intersperses these anecdotes with quotations from Roman\nwriters praising suicide. While his general skepticism prevented\nMontaigne from staking out a firm moral position on suicide, he gives\nonly a nod to the orthodox Christian position and conceptualizes the\nissue not in traditional theological terms but as a matter of personal\njudgment or conscience (Minois 1999, 89–92).\n\nThe Protestant Reformers, including Calvin, condemned suicide as\nroundly as did the established Church, but held out the possibility of\nGod treating suicide mercifully and permitting repentance. Interest in\nmoral questions concerning suicide was particularly strong in this\nperiod among England’s Protestants, notably the Puritans (Sprott\n1961). Nonetheless, the traditional Christian view prevailed well into\nthe late seventeenth century, where even an otherwise liberal thinker\nsuch as John Locke echoed earlier Thomistic arguments, claiming that\nthough God bestowed upon us our natural personal liberty, that liberty\ndoes not include the liberty to destroy oneself (Locke 1690, ch. 2,\npara. 6).\n\nIn all likelihood, the first comprehensive modern defense of suicide\nwas John Donne’s Biathanatos (c. 1607). Not intended\nfor publication, Biathanatos drew upon an array of classical\nand modern legal and theological sources to argue that Christian\ndoctrine should not hold that suicide is necessarily sinful. His\ncritique is in effect internal, drawing upon the logic of Christian\nthought itself to suggest that suicide is not contrary to the laws of\nnature, of reason, or of God. Were it contrary to the law of nature\nmandating self-preservation, all acts of self-denial or privation\nwould be similarly unlawful. Moreover, there may be circumstances in\nwhich reason might recommend suicide. Finally, Donne observes, not\nonly does Biblical Scripture lack a clear condemnation of suicide,\nChristian doctrine has permitted other forms of killing such as\nmartyrdom, capital punishment and killing in wartime (Minois 1999,\n20–21).\n2.3 The Enlightenment and Modern Developments\n\nDonne’s casuistical treatise was an early example of the\nliberalized Enlightenment attitudes of the 1700s. The Thomistic\nnatural-law stance on suicide came under increasing attack as suicide\nwas examined through the lens of science and psychology. Where\nChristian theology has understood suicide as “an affair between\nthe devil and the individual sinner” (Minois 1999, 300),\nEnlightenment philosophers tended to conceive of suicide in secular\nterms, as resulting from facts about individuals, their natural\npsychologies, and their particular social settings. David Hume gave\nvoice to this new approach with a direct assault on the Thomistic\nposition in his essay “Of suicide” (1783). Hume saw\ntraditional attitudes toward suicide as muddled and superstitious,\nrooted in confused understandings of God’s relation to the\ncreated human world. (Lecaldano 2016) According to the Thomistic\nargument, suicide violates the order God established for the world and\nusurps God’s prerogative in determining when we shall die.\nHume’s argument against this thesis is intricate but rests on\nthe following considerations:\n\nIf by the ‘divine order’ is meant the causal laws\ncreated by God, then it would always be wrong to contravene these laws\nfor the sake of our own happiness. But clearly it is not wrong, since\nGod frequently permits us to contravene these laws, for he does not\nexpect us not to respond to disease or other calamities. Therefore,\nthere is not apparent justification, as Hume put it, for God’s\npermitting us to disturb nature in some circumstances but not in\nothers. Just as God permits us to divert rivers for irrigation, so too\nought he permit us to divert blood from our veins.\nIf by ‘divine order’ is meant the natural laws God has\nwilled for us, which are (a) discerned by reason, (b) such that\nadherence to them will produce our happiness, then why should not\nsuicide conform to such laws when it appears rational to us that the\nbalance of our happiness is best served by dying?\nFinally if by ‘divine order’ is meant simply that\nwhich occurs according to God’s consent, then God appears to\nconsent to all our actions (since an omnipotent God can\npresumably intervene in our acts at any point) and no distinction\nexists between those of our actions to which God consents and those to\nwhich He does not. If God has placed us upon the Earth like a\n“sentinel,” then our choosing to leave this post and take\nour lives occurs as much with his cooperation as with any other act we\nperform.\n\n\nFurthermore, suicide does not necessarily violate any duties toward\nother people, according to Hume. Reciprocity may require that we\nbenefit society in exchange for the benefits it provides, but surely\nsuch reciprocity reaches its limit when by living we provide only a\n“frivolous advantage” to society at the expense of\nsignificant harm or suffering for ourselves. In more extreme\nsituations, we are actually burdens to others, in which case our\ndeaths are not only “innocent, but laudable.”\n\nFinally, Hume rejects the thesis that suicide violates our duties to\nself. Sickness, old age, and other misfortunes can make life\nsufficiently miserable that continued existence is worse than death.\nAs to worries that people are likely to attempt to take their lives\ncapriciously, Hume replies that our natural fear of death ensures that\nonly after careful deliberation and assessment of our future prospects\nwill we have the courage and clarity of mind to kill ourselves. In the\nend, Hume concludes that suicide “may be free of imputation of\nguilt and blame.” His position is largely utilitarian, allied\nwith a strong presumption of personal liberty.\n\nBut Enlightenment philosophy was not univocal in its comparatively\npermissive attitudes toward suicide. The most noteworthy opponent of\nsuicide in this period was Immanuel Kant. Kant’s arguments,\nthough they reflect earlier natural law arguments, draw upon his view\nof moral worth as emanating from the autonomous rational wills of\nindividuals (Cholbi 2000, 2010). For Kant, our rational wills are the\nsource of our moral duty, and it is therefore a kind of practical\ncontradiction to suppose that the same will can permissibly destroy\nthe very body that carries out its volitions and choices. Given the\ndistinctive worth of an autonomous rational will, suicide is an attack\non the very source of moral authority.\n\nTo annihilate the subject of morality in one’s person is to root\nout the existence of morality itself from the world as far as one can,\neven though morality is an end in itself. Consequently, disposing of\noneself as a mere means to some discretionary end is debasing humanity\nin one’s person… (Kant 423)\n\n\n(For a contemporary expression of this Kantian view of suicide, see\nVelleman 1999.)\n\nSuicide continued to be an important topic in post-Kantian German\nphilosophy (see Stellino 2020). Like Hume, Arthur Schopenhauer\nrejected virtually all moral arguments for the moral objectionability\nof suicide. Surprisingly though, Schopenhauer’s pessimistic\nphilosophical outlook nevertheless led him to condemn suicide. The\ndesire to end our lives, according to Schopenhauer, arises from our\nwill’s unceasing but ultimately futile pursuit of our desires.\nHence, rather than denying this striving or extricating us from the\nfundamental predicament of human existence, suicide ends up affirming\nthis striving and so represents a misguided grasp at freedom.\n(1819:425–27) Friedrich Nietzsche, in contrast, shared\nSchopenhauer’s rejection of pious moralizing about suicide and\nhis belief in the striving of the will, but concluded that suicide is\nat least sometimes rational. For Nietzsche, suicide can be a\npraiseworthy assertion of one’s will, a way to lend one’s\nindividual life meaning in an otherwise meaningless world. (1883)\n\nThe nineteenth and early twentieth centuries also brought several\ndevelopments that, while not explicitly philosophical, have shaped\nphilosophical thought about suicide. The first was the emergence, in\nnovels by Rousseau, Goethe, and Flaubert, of a Romantic idealized\n‘script’ for suicide, according to which suicide was the\ninevitable response of a misunderstood and anguished soul jilted by\nlove or shunned by society (Lieberman 2003). The second was the\nemergence of psychiatry as an autonomous discipline, populated by\nexperts asserting their ability to diagnose and treat melancholy,\nhysteria and other ailments sometimes thought responsible for suicide.\nLastly, largely thanks to the work of sociologists such as Durkheim\nand Laplace, suicide was increasingly viewed as a social ill\nreflecting widespread alienation, anomie, and other attitudinal\nbyproducts of modernity. In many European nations, the rise in suicide\nrates was thought to signal a cultural decline. These latter two\ndevelopments made suicide prevention a bureaucratic and medical\npreoccupation, leading to a wave of institutionalization for suicidal\npersons. All three conspired to suggest that suicide is caused by\nimpersonal social or psychological forces rather than by the agency of\nindividuals.\n3. The Morality and Rationality of Suicide\n3.1 Moral Permissibility\n\nThe principal moral issue surrounding suicide has long been whether\nthere are conditions under which suicide is morally justified, and if\nso, which conditions. Several important historical answers to this\nquestion have already been mentioned.\n\nThis question should be distinguished from three others:\n\nShould other individuals attempt to prevent suicide?\nShould the state criminalize suicide or attempt to prevent\nit?\nIs suicide ever rational or prudent?\n\n\nThese four questions interrelate in complex ways. For instance, it\nmight be assumed that if suicide is morally permissible in some\ncircumstances, then neither other individuals nor the state should\ninterfere with suicidal behavior (in those same circumstances).\nHowever, this conclusion might not follow if those same suicidal\nindividuals are irrational and interference is required in order to\nprevent them from taking their lives, an outcome they would regret\nwere they more fully rational. Furthermore, for those moral theories\nthat emphasize rational autonomy, whether an individual has rationally\nchosen to take her own life may settle all four questions. In any\nevent, the interrelationships among suicide’s moral\npermissibility, its rationality, and the duties of others and of\nsociety as a whole is complex, and we should be wary of assuming that\nan answer to any one of these four questions decisively settles the\nother three.\n3.2 The Deontological Argument from the Sanctity of Life\n\nThe simplest moral outlook on suicide holds that it is necessarily\nwrong because human life is sacred. Though this position is often\nassociated with religious thinkers, especially Catholics, Ronald\nDworkin (1993) points out that atheists may appeal to this claim as\nwell. According to this ‘sanctity of life’ view, human\nlife is inherently valuable and precious, demanding respect from\nothers and reverence for oneself. Hence, suicide is wrong because it\nviolates our moral duty to honor the inherent value of human life,\nregardless of the value of that life to others or to the person whose\nlife it is. The sanctity of life view is thus a deontological position\non suicide.\n\nThe great merit of the sanctity of life position is that it reflects a\ncommon moral sentiment, namely, that killing is wrong in itself. But\nthe sanctity of life view faces several challenges. The first is that\nits proponents need to show that it is consistent with the\njustifiability of other forms of killing many have thought defensible,\nsuch as killing in wartime or killing in self-defense. Why, in other\nwords, are other forms of killing morally permitted but suicide is\nnot? Second, the sanctity of life view appears to assert that simply\nbeing alive, irrespective of the current or expected quality of a\nperson’s life, confers value on a human life. But Peter Singer\n(1994) and others have argued against the sanctity of life position on\nthe grounds that the value of a continuing life is not intrinsic but\nextrinsic, to be judged on the basis of the individual’s likely\nfuture quality of life. If the value of a person’s continued\nlife is measured by its likely quality, then suicide may be\npermissible when that quality is low (see\n section 3.5).\n Third, we may question the inference from the sanctity of life to the\nmoral impermissibility of suicide. Those who engage in suicidal\nbehavior when their futures promise to be extraordinarily bleak do not\nseem to exhibit insufficient regard for the sanctity of life (Dworkin\n1993, 238). Indeed, it may be argued that suicide may affirm the value\nof human lives in those circumstances where medical or psychological\nconditions reduce individuals to shadows of their former fully capable\nselves (Cholbi 2002).\n3.3 Religious Arguments\n\nTwo general categories of arguments for the moral impermissibility of\nsuicide have emerged from the Christian religious tradition. The first\nof these is the aforementioned Thomistic natural law position,\ncritiqued by Hume (see\n section 2.3)\n According to this tradition, suicide violates the natural law God has\ncreated to govern the natural world and human existence. This natural\nlaw can be conceived of in terms of (a) natural causal laws, such that\nsuicide violates this causal order, (b) teleological laws, according\nto which all natural beings seek to preserve themselves, or (c) the\nlaws governing human nature, from which it follows that suicide is\n‘unnatural’ (Pabst Battin 1996, 41–48). These\nnatural law arguments are no longer the main focus of philosophical\ndiscussion, as they have been subjected to strenuous criticism by Hume\nand others (though see Gay-Williams 1996). These criticisms include\nthe following: (1) the natural law arguments cannot be disentangled\nfrom a highly speculative theistic metaphysics; (2) the claims of\nnatural law are confuted by observations of human nature (e.g., the\nexistence of self-destructive human behaviors casts doubt on the claim\nthat we “naturally” preserve ourselves); and (3) other\nacts (e.g., religious martyrdom) which God is assumed not to condemn,\nalso violate these natural laws, making the prohibition on suicide\nappear arbitrary.\n\nThe second general category of religious arguments rest on analogies\nconcerning the relationship between God and humanity. For the most\npart, these arguments aim to establish that God, and not human\nindividuals, has the proper moral authority to determine the\ncircumstances of their deaths. One historically prominent analogy\n(suggested by Aquinas and Locke) states that we are God’s\nproperty and so suicide is a wrong to God akin to theft or destruction\nof property. This analogy seems weak on several fronts. First, if we\nare God’s property, we are an odd sort of property, in that God\napparently bestowed upon us free will that permits us to act in ways\nthat are inconsistent with God’s wishes or intentions. It is\ndifficult to see how an autonomous entity with free will can be\nsubject to the kind of control or dominion to which other sorts of\nproperty are subject. Second, the argument appears to rest on the\nassumption that God does not wish his property destroyed. Yet given\nthe traditional theistic conception of God as not lacking in any way,\nhow could the destruction of something God owns (a human life) be a\nharm to God or to his interests (Holley 1989, 105)? Third, it is\ndifficult to reconcile this argument with the claim that God is\nall-loving. If a person’s life is sufficiently bad, an\nall-loving God might permit his property to be destroyed through\nsuicide. Finally, some have questioned the extent of the duties\nimposed by God’s property right in us by arguing that the\ndestruction of property might be morally justified in order to prevent\nsignificant harm to oneself. If the only available means to save\nmyself from a ticking bomb is to stash it in the trunk of the nearest\ncar to dampen the blast, and the nearest car belongs to my neighbor,\nthen destroying his property appears justified in order to avoid\nserious harm to myself. Likewise, if only by killing myself can I\navoid a serious future harm to myself, I appear justified in\ndestroying my life even if it is God’s property.\n\nAnother common analogy asserts that God bestows life upon us as a\ngift, and it would be a mark of ingratitude or neglect to reject that\ngift by taking our lives. The obvious weakness with this “gift\nanalogy” is that a gift, genuinely given, does not come with\nconditions such as that suggested by the analogy, i.e., once given, a\ngift becomes the property of its recipient and its giver no longer has\nany claim on what the recipient does with this gift. It may perhaps be\nimprudent to waste an especially valuable gift, but it does not appear\nto be unjust to a gift giver to do so. As Kluge (1975, 124) put it,\n“a gift we cannot reject is not a gift”. A\nvariation of this line of argument holds that we owe God a debt of\ngratitude for our lives, and so to kill ourselves would be\ndisrespectful or even insulting to God, (Ramsey 1978, 146) or would\namount to an irresponsible use of this gift. Yet this variation does\nnot really evade the criticism directed at the first version: Even if\nwe owe God a debt of gratitude, disposing of our lives does not seem\ninconsistent with our expressing gratitude for having lived at all\n(Beauchamp 1992). Furthermore, if a person’s life is rife with\nmisery and unhappiness, it is far from clear that she owes God much in\nthe way of gratitude for this apparently ill-chosen “gift”\nof life. Defenders of the gift analogy must therefore defend the claim\nthat life, simply because it is given to us by a loving God, is an\nexpression of God’s benevolent nature and is therefore\nnecessarily a benefit to us (Holley 1989, 113–114).\n\nIn addition, there is a less recognized undercurrent of religious\nthought that favors suicide. For example, suicide permits us\nto reunite with deceased loved ones, allows those who have been\nabsolved of sin to assure their entrance to heaven, and releases the\nsoul from the bondage of the body. In both Christian and Asian\nreligious traditions, suicide holds the promise of a vision of, or\nunion with, the divine (Pabst Battin 1996, 53–64).\n3.4 Libertarian Views and the Right to Suicide\n\nFor libertarians, suicide is morally permissible because individuals\nenjoy a right to suicide. (It does not of course follow that\nsuicide is necessarily rational or prudent.) Libertarianism, which has\nhistorical precedent in the Stoics and in Schopenhauer, is strongly\nassociated with the ‘anti-psychiatry’ movement of the last\nhalf century. According to that movement, attempts by the state or by\nthe medical profession to interfere with suicidal behavior are\nessentially coercive attempts to pathologize morally permissible\nexercises of individual freedom (Szasz 2002).\n\nLibertarianism typically asserts that the right to suicide is a\nright of noninterference, to wit, that others are morally\nbarred from interfering with suicidal behavior. Some assert the\nstronger claim that the right to suicide is a liberty right,\nsuch that individuals have no duty to forego suicide (i.e., that\nsuicide violates no moral duties), or a claim right,\naccording to which other individuals may be morally obliged not only\nnot to interfere with a person’s suicidal behavior but to assist\nin that behavior. (See the entry on\n rights.)\n Our having a claim right to suicide implies that we also have rights\nof noninterference and of liberty and is a central worry about\nphysician-assisted suicide (Pabst Battin 1996, 163–164). Since\nwhether we have a liberty right to suicide concerns whether it\nviolates other moral obligations, including obligations to other\npeople, I shall leave discussion of that issue to\n section 3.5\n and focus here on whether there is a right of noninterference.\n(Whether suicidal individuals have a claim right to others’\nassistance is addressed in\n section 3.8.)\n\nA popular basis supporting a right to suicide is the idea that we own\nour bodies and hence are morally permitted to dispose of them as we\nwish. (Recall from\n section 3.3\n that some religious arguments for the impermissibility of suicide\ndepend on God’s ownership of our bodies.) On this view, our\nrelationship to our bodies is like that of our relationship to other\nitems over which we enjoy property rights: Just as our having a right\nto a wristwatch permits us to use, improve, and dispose of it as we\nwish, so too does our having a right to our bodies permit us to\ndispose of them as we see fit. Consequently, since property rights are\nexclusive (i.e., our having property rights to a thing prohibits\nothers from interfering with it), others may not interfere with our\nefforts to end our lives.\n\nThe notion of self-ownership gives rise to certain puzzles though.\nOwnership seems to (a) involve two metaphysically distinct entities,\nthe owned (my wristwatch) and the owner (me), and (b), an act or event\nby which one acquires a property right in thing owned. It is not\nobvious how to make sense of either of these facts in the case of\nself-ownership or ownership of one’s body. While we can give\naway our bodies (donating a kidney, for example, or willing that our\ncorpses be used for scientific research), our coming to own our bodies\nis harder to grasp. We did not, after all, create our own bodies,\npurchase them, etc. And while it may be true that we come to own our\nbodies because they are a gift from others (God or our biological\nparents), this seems to require that there already exist some\nnon-embodied self to serve as the recipient of this gift.\nSelf-ownership might therefore seem to require a controversial\ndualistic metaphysics of the self, at odds with a naturalistic\nphilosophical perspective wherein we are essentially embodied beings.\n(Cholbi 2011, 84–86) Perhaps self-ownership is a metaphor meant\nto capture a similar property-like set of rights we have toward our\nbodies,rights that allow us to exercise property-like control or\nauthority over our bodies. (Kluge 1975, 119) Finally, a right to\nsuicide rooted in a putative right of self-ownership would not be\nunlimited. For uses of one’s property, including its\ndestruction, can be harmful to others. Thus, even on the assumption\nthat we do own our own bodies, we may be morally required to refrain\nfrom suicide when and because the destruction of our bodies harms\nothers. (See\n section 3.5\n for arguments concerning duties to others.)\n3.5 Social, Utilitarian, and Role-Based Arguments\n\nA fourth approach to the question of suicide’s permissibility\nasks not whether others may interfere with suicidal behavior but\nwhether we have a liberty right to suicide, whether, that is, suicide\nviolates any moral duties to others. Those who argue that suicide can\nviolate our duties to others generally claim that suicide can harm\neither specific others (family, friends, etc.) or is a harm to the\ncommunity as a whole.\n\nNo doubt the suicide of a family member or loved one produces a number\nof harmful psychological and economic effects. In addition to the\nusual grief, suicide “survivors” confront a complex array\nof feelings. Various forms of guilt are quite common, such as that\narising from (a) the belief that one contributed to the suicidal\nperson’s anguish, or (b) the failure to recognize that anguish,\nor (c) the inability to prevent the suicidal act itself. Suicide also\nleads to rage, loneliness, and awareness of vulnerability in those\nleft behind. Still, some of these reactions may be due to the strong\nstigma and shame associated with suicide, in which case these\nreactions cannot, without logical circularity, be invoked in arguments\nthat suicide is wrong because it produces these psychological\nreactions (Pabst Battin 1996, 68–69), i.e., the wrongfulness of\nsuicide cannot rest on the emotions provoked by the belief that it is\nwrong. Suicide can also cause clear economic or material harm, as when\nthe suicidal person leaves behind dependents unable to support\nthemselves financially. Suicide can therefore be understood as a\nviolation of the distinctive “role obligations” applicable\nto spouses, parents, caretakers, and loved ones. However, even if\nsuicide is harmful to family members or loved ones, this does not\nsupport an absolute prohibition on suicide, since some suicides will\nnot leave survivors, and among those that do, the extent of these\nharms is likely to differ such that the stronger these relationships\nare, the more harmful suicide is and the more likely it is to be\nmorally wrong. Besides, from a utilitarian perspective, these harms\nwould have to be weighed against the harms done to the would-be\nsuicide by continuing to live a difficult or painful life. At most,\nthe argument that suicide is a harm to family and to loved ones\nestablishes that it is sometimes wrong (Cholbi 2011, 62–64).\n\nA second brand of social argument echoes Aristotle in asserting that\nsuicide is a harm to the community or the state. One general form such\narguments take is that because a community depends on the economic and\nsocial productivity of its members, its members have an obligation to\ncontribute to their society, an obligation clearly violated by suicide\n(Pabst Battin 1996, 70–78, Cholbi 2011, 58–60). For\nexample, suicide denies a society the labor provided by its members,\nor in the case of those with scarce talents such as medicine, art, or\npolitical leadership, the crucial goods their talents enable them to\nprovide. Another version states that suicide deprives society of\nwhatever individuals might contribute to society morally (by way of\ncharity, beneficence, moral example, etc.) Still, it is difficult to\nshow that a society has a moral claim on its members’ labor,\ntalents, or virtue that compels its members to contribute to\nsocietal well-being no matter what. After all, individuals often fail\nto contribute as much as they might in terms of their labor or special\ntalents without incurring moral blame. It does not therefore seem to\nbe the case that individuals are morally required to benefit society\nin whatever way they are capable, regardless of the harms to\nthemselves. Again, this line of argument appears to show at most only\nthat suicide is sometimes wrong, namely, when the benefit (in terms of\nfuture harm not suffered) the individual gains by dying is less than\nthe benefits she would deny to society by dying.\n\nA modification of this argument claims that suicide violates a\nperson’s duty of reciprocity to society (Cholbi 2011,\n60–62). On this view, an individual and the society in which she\nlives stand in a reciprocal relationship such that in exchange for the\ngoods the society has provided to the individual, the individual must\ncontinue to live in order to provide her society with the goods that\nrelationship demands. Yet in envisioning the relationship between\nsociety and the individual as quasi-contractual in nature, the\nreciprocity argument reveals its principal flaw: The conditions of\nthis “contract” may not be met, and also, once met, impose\nno further obligations upon the parties. As Baron d’Holbach\n(1970, 136–137) pointed out, the contract between an individual\nand her society is a conditional one, presupposing “mutual\nadvantages between the contracting parties.” Hence, if a society\nfails to fulfill its obligations under the contract, namely to provide\nindividuals with the goods needed for a decent quality of life, then\nthe individual is not morally required to live in order to reciprocate\nan arrangement that society has already reneged on. Moreover, once an\nindividual has discharged her obligations under this societal\ncontract, she no longer is under an obligation to continue her life.\nHence, the aged or others who have already made substantial\ncontributions to societal welfare would be morally permitted to engage\nin suicide under this argument.\n3.6 Suicide as a Moral Duty?\n\nTo this point, we have addressed arguments that concern whether a\nmoral permission to engage in suicidal behavior exists, and\nindeed, it is this question that has dominated ethical discussion of\nsuicide. Yet the social arguments against suicide are fundamentally\nconsequentialist, and some act-utilitarians have discussed the\ncorrelative possibility that the good consequences of suicide might so\noutweigh its bad consequences as to render suicide admirable or even\nmorally obligatory (Cosculluela 1995, 76–81). In fact,\nin some cases, suicide may be honorable. Suicides that are clearly\nother-regarding, aiming at protecting the lives or well-being of\nothers, or at political protest, may fall into this category (Kupfer\n1990, 73–74). Examples of this might include the grenade-jumping\nsoldier mentioned earlier, or the spy who takes his life in order not\nto be subjected to torture that will lead to his revealing vital\nmilitary secrets. Utilitarians have given particular attention to the\nquestion of end-of-life euthanasia, suggesting that at the very least,\nthose with painful terminal illnesses have a right to voluntary\neuthanasia (Glover 1990, chs. 14–15, Singer 1993, ch. 7). Yet\nutilitarian views hold that we have a moral duty to maximize\nhappiness, from which it follows that when an act of suicide will\nproduce more happiness than will remaining alive, then that suicide is\nnot only morally permitted, but morally required.\n\nHowever, the thesis that there may exist a “duty to die”\nneed not be defended by appeal to overtly consequentialist or\nutilitarian reasoning. In the course of articulating what he terms a\n“family-centered” approach to bioethics, the philosopher\nJohn Hardwig (1996, 1997) has argued that sometimes the burdens that a\nperson imposes on others, particularly on family members or loved\nones, by continuing to live are sufficiently great that one may have a\nduty to die in order to relieve them of these burdens. Hardwig’s\nargument thus seems to turn not on the overall balance of costs and\nbenefits that result from a person living or dying, but on the\nfairness of the burdens that a person imposes on others by continuing\nto live.\n\nWhile generally acknowledging Hardwig’s suggestion that duties\nto others have been neglected in discussion of the ethics of suicide,\ncritics of morally required suicide raise a number of objections to\nhis proposal. (See Hardwig et al. 2000, Humber & Almeder 2000.)\nSome doubt that the duty of beneficence to which Hardwig appeals\njustifies anything stronger than a permission to take one’s own\nlife when continuing to live is burdensome to others (Cholbi 2010b).\nOthers worry that a moral requirement to engage in suicide raises the\nsinister and totalitarian prospect that individuals may be obliged to\nengage in suicide against their wishes (Moreland & Geisler 1990,\n94, Pabst Battin 1996, 94–95). This worry may reflect an\nimplicit acceptance of a variation of the sanctity of life view (see\n section 3.2)\n or may reflect concerns about infringements upon individual’s\nautonomy (see\n section 3.6).\n Other critics suggest that even if there is a duty to die, this duty\nshould not be understood as a duty that entails that others may compel\nthose with such a duty to take their lives (Menzel 2000, Narveson\n2000). Questions about social justice and equality (whether, for\nexample, especially vulnerable populations such as women or the poor\nmight be more likely to act on such a duty) are also raised. One\nutilitarian response to these objections is to reject a duty to die on\nrule utilitarian grounds: Suicide would be morally forbidden because\ngeneral adherence to a rule prohibiting suicide would produce better\noverall consequences than would general adherence to a rule permitting\nsuicide (Brandt 1975, Pabst Battin 1996, 96–98).\n3.7 Autonomy, Rationality, and Responsibility\n\nA more restricted version of the claim that we have a right to\nnoninterference regarding suicide holds that suicide is permitted so\nlong as—leaving aside questions of duties to others—it is\nrationally chosen. In a similar vein, Kantians might claim that\nsuicidal choices must be respected if those choices are\nautonomous, that is, if an individual chooses to end her life\non the basis of reasons that she acknowledges as relevant to her\nsituation. Such positions are narrower than the libertarian view, in\nthat they permit suicide only when it is performed on a rational basis\n(or a rational basis that the individual acknowledges as relevant to\nher situation) and permits others to interfere only when it is not\nperformed on that basis.\n\nOne initial challenge to the possibility of rational suicide rests on\nthe notion that suicide, being a choice to end one’s life, is\nnecessarily irrational. The thought here is that any coherent\njudgment of suicide’s rationality requires comparing the state\nof being alive (or continuing to live) with being dead. But either\nbecause no one has sufficient knowledge of the state of being dead\n(Devine 1978) or because suicide ensures that the suicidal person has\nno future to look forward to (Cowley 2006), judgments that ending\none’s life is rational are incoherent or misplaced.\n\nIn recent years, this ‘two-state’ requirement (that death\ncan only be judged rational or irrational if it is possible to compare\nthe state of being alive with the state of being dead) has been widely\nrejected. In particular, the rationality of the decision to end\none’s life need not be construed in terms of the value of being\nalive versus the value of being dead (Luper 2009, 82–88).\nRather, the rationality of suicide concerns a choice about the value\nor quality of different lives one could have: a shorter life, whose\nduration is truncated by suicide, versus the longer life an individual\nwould be most likely to have if they forego suicide. As Richard Brandt\nhas put it, what those contemplating ending their lives are\nconsidering are different durations or courses of their lives:\n\nThe person who is contemplating suicide is obviously making a choice\nbetween future world-courses: the world-course that includes his\ndemise, say, an hour from now, and several possible ones that contain\nhis demise at a later point… The basic question a person must\nanswer in order to determine which world-course is best or rational\nfor him to choose, is which he would choose under conditions\nof optimal use of information, when all of his desires are\ntaken into account. (Brandt 1975)\n\n\nHence, on this view, a rational judgment about one’s own death\nrequires a comparison between the overall goodness of one’s life\nas it would be if it continued on its present course and the overall\ngoodness of one’s life if that life ended before its present\ncourse.\n\nThat suicide’s rationality depends on comparing a life shortened\nby suicide to a longer life has given rise to a rich philosophical\nliterature trying to identify the specific conditions under which a\nperson’s decision to die is rational. For the most part, this\nliterature divides the conditions for rational suicide into\ncognitive conditions, conditions ensuring that\nindividuals’ appraisals of their situation are rational and\nwell-informed, and interest conditions, conditions ensuring\nthat suicide in fact accords with individuals’ considered\ninterests.\n\nExamples of this approach include Glenn Graber, who states that a\nsuicide is rationally justified “if a reasonable appraisal of\nthe situation reveals that one is better off dead.” (Graber\n1981, 65). An appraisal is reasonable, according to Graber, if it\nresults from a clearheaded assessment of how suicide would further or\nimpede one’s overall interests, including one’s present\nand probable future values and preferences. Margaret Battin identifies\nthree cognitive conditions for rational suicide (a facility for causal\nand inferential reasoning, possession of a realistic world view, and\nadequacy of information relevant to one’s decision), along with\ntwo interest conditions (that dying enables one to avoid future harms,\nand that dying accords with one’s most fundamental interests and\ncommitments) (Pabst Battin 1996, 115).\n\nFor the most part, suicidal individuals do not manifest signs of\nsystemic irrationality, much less the signs of legally\ndefinable insanity, (Radden 1982) and engage in suicidal conduct\nvoluntarily. However, these facts are consistent with the choice to\nengage in suicidal behavior being irrational, and serious questions\ncan be raised about just how often the conditions for rational suicide\nare met in actual cases of self-inflicted death. Indeed, the\npossibility of rational suicide requires that certain assumptions\nabout suicidal individuals’ rational autonomy be true which may\nnot be in many cases. A person’s choice to undertake suicidal\nbehavior may not be a reflection of her considered interests, and so\nher self-inflicted death would be an act that she would, in calmer and\nclearer moments, recoil at. For instance, only some suicidal persons\nengage in extensive planning for their own deaths. In many instances,\nthe final determination to end one’s life is instead impulsive,\nreflecting suicidal persons’ proclivity toward volatility and\nagitation (Cholbi 2002, Joiner 2010, 70–84). And although\nrepeated suicide attempts by the same individual are common, the\nimpulse to suicidal behavior is often transient and dissipates of its\nown accord (Blauner 2003). Suicidal persons can also have difficulty\nappreciating the finality of their deaths, believing that (assuming\nthere is no afterlife) they will somehow continue to be subjects of\nconscious experience after they die. They may occasionally exhibit\nromanticized and grandiose beliefs about the likely effects of their\ndeaths (delusions of martyrdom, revenge, etc.) Furthermore, suicidal\npersons are often hesitant about their own actions, hoping that others\nwill intervene and signaling to others the hope that they will\nintervene (Shneidman 1985). Considerations such as these seem to imply\nthat the choice to engage in suicide is often not rational in that it\ndoes not reflect sound reasoning, an adequate grasp of one’s\nsituation, or a clearheaded understanding of the implications of\none’s suicide in relation to one’s long-term\ninterests.\n\nA further complication about the rationality of suicide is the evident\nlink between suicidal thoughts and mental illnesses such as\ndepression. Some studies of suicide indicate that over 90% of suicidal\npersons displayed symptoms of depression before death, while others\nestimate that suicide is at least 20 times more common among those\nwith clinical depression than in the general population. In cases of\nsuicide linked with depression, individuals’ attitudes toward\ntheir own death are colored by strongly negative and occasionally\ndistorted beliefs about their life situations (career prospects,\nrelationships, etc.). As Brandt (1975) observed, depression can\n“primitivize one’s intellectual processes,” leading\nto poor estimation of probabilities and an irrational focus on present\nsuffering rather than on possible future goods. Such findings provide\nevidence that suicidal behavior is typically, though not necessarily,\nirrational.\n\nAll the same, caution is in order both about the relationship between\nsuicidal thought and mental illness and about the relation between\nmental illness and suicidal choices being rational or autonomous. The\nmere fact of having a mental illness does not entail that one is\nirrational or incompetent to make one’s own choices. (See\n decision making capacity.) All\n the more, disagreement continues about the strength of the link\nbetween suicide and mental illness, (Pabst Battin 1996, 5) and while\nmany of those who engage in suicidal behavior seem to be mentally ill,\nthe relationship is rather weak in the other direction: Most of those\nwith diagnosed mental illness such as depression do not\nengage in suicidal behavior, implying that other factors besides\nmental illness may be equally important in predicting suicide. (Joiner\n2010) In addition, doubts can be raised about how the link is\nunderstood. Some have argued that the mental health professions have\ncome to see some mental illness as defined by suicidal behavior, i.e.,\nthat it is a sign or symptom of a disorder such as depression or\nschizophrenia that the individual in question is suicidal. But under\nthis understanding of the relationship, that mental illness is\nresponsible for suicidal behavior does not seem to be a testable\nempirical or scientific hypothesis but a normative judgment about the\nrationality of suicide. In other words, the link between suicide and\nmental illness turns out to reflect a controversial normative judgment\nthat those contemplating ending their lives have\n‘disordered’ minds. (Maung forthcoming)\n3.8 Duties Toward the Suicidal\n\nWith the exception of the unqualified libertarian position that each\nperson has a right against others that they not interfere with her\nsuicidal intentions (Szasz 2002) each of the moral positions on\nsuicide we have addressed so far would appear to justify others\nintervening in suicidal plans, at least on some occasions. Little\njustification is necessary for actions that aim to prevent\nanother’s suicide but are non-coercive. Pleading with a suicidal\nindividual, trying to convince her of the value of continued life,\nrecommending counseling, etc. are morally unproblematic, since they do\nnot interfere with the individual’s conduct or plans except by\nengaging her rational capacities (Cosculluela 1994, 35; Cholbi 2002,\n252). The more challenging moral question is whether more coercive\nmeasures such as physical restraint, medication, deception, or\ninstitutionalization are ever justified to prevent suicide and when.\nIn short, the question of suicide intervention is a question of how to\njustify paternalistic interference (Kleinig 1983, 96–104).\n\nAs mentioned in\n section 3.6,\n the impulse toward suicide is often sporadic, ambivalent, and\ninfluenced by mental illnesses such as depression, all indicators that\nsuicide may be undertaken on irrational grounds. And while individuals\nusually have the right to make bad or irrational decisions on their\nown behalf, these indicators, when juxtaposed with the stakes of the\ndecision to end one’s life (that death is irreversible, that\ncontinued life is a condition of all other goods, etc.), justify\nintervention in others’ suicidal plans on the ‘soft’\npaternalist grounds that suicide is not in the individual’s\ninterests as they would rationally conceive those interests. We might\ncall this the ‘no regrets’ or ‘err on the side of\nlife’ approach to suicide intervention (Martin 1980; Pabst\nBattin 1996, 141; Cholbi 2002). Since most situations in which another\nperson intends to kill herself will be ones where we are unsure of\nwhether she is rationally choosing to die, it may well be justifiable\nto temporarily prevent “an informed person who is in control of\nhimself from committing suicide” than to do “nothing\nwhile, say, a confused person kills himself, especially since, in all\nlikelihood, the would-be suicide could make another attempt if this\none were prevented and since the suicidal option is irreversible if\nsuccessful” (Cosculluela 1994, 40). Further psychiatric or\nmedical examinations may settle the matter regarding the rationality\nof the suicidal individual’s decision. The coerciveness of the\nmeasures used should be proportional to the apparent seriousness of\nthe suicidal person’s intention to die (Cholbi 2011,\n122–129).\n\nInquiry into the ethics of suicide prevention should also take stock\nof variations in when preventive actions occur and how carefully\ntargeted they are. Some preventive actions, such as the short-term\ninstitutionalization of suicidal persons, are undertaken in clinical\nor criminal justice settings, whereas other preventive actions (such\nas calls to suicide hotlines) occur at greater distance from the\nsuicidal individual. These different settings raise different ethical\nconcerns about individual rights, privacy, and autonomy, as well as\nconcerns trust and honesty. (On ethical questions related to suicide\nhotlines, see Martin 2011.) Still other preventive actions\n(restricting legal access to firearms or household poisons often used\nin suicide, or adding lithium to drinking water supplies to reduce the\nincidence of suicidal emotions) occur at a population level, thus\nraising concerns not only about their efficacy but about the risks\nposed to the non-suicidal individuals’ well-being and rights.\n(Cholbi 2011, 135–138, Ng, Sjöstrand, and Eyal, 2019)\n\nLastly, if there is sometimes a duty to prevent acts of suicide, is it\never morally permissible, or even morally obligatory, to aid others in\nending their lives? (This possibility is directly related to\nphysician-assisted suicide and the larger question of whether the\nright to suicide is a claim right.) If there are circumstances that\njustify our intervening to prevent suicide undertaken irrationally or\ncontrary to a person’s self-interest, then the same\npaternalistic rationale would justify our helping to promote or enable\nthose suicides that are rational and in accordance with a\nperson’s self-interest.\n\nCritics of a duty to assist in suicide assert that the widespread\nmoral acceptance of aiding others in suicide invites the prospect of a\n‘slippery slope,’ wherein assisted suicide becomes so\ncommonplace that individuals (particularly members of vulnerable\npopulations such as the aged, the disabled, or socially marginalized\npopulations) for whom suicide is not rational could nevertheless be\nsusceptible to various forms of abuse, manipulation, or undue\npressure, By giving license for others to assist in suicides, critics\nallege, we may unwittingly permit them to encourage suicides not\nbecause those suicides are in fact in the best interests of the\nindividual in question, but because those suicides advance the\ninterests of other people or of institutions.(Pabst Battin 1996,\n145–157). Whether such ‘slippery slope’ worries are\nwarranted is an empirical matter, and existing studies of societies\nthat have legalized assisted suicide by medical personnel do not\nprovide unequivocal support for these worries (Cholbi 2011,\n148–157).\n3.9 Suicide, Virtue, and Life’s Meaning\n\nSections 3.1–3.8 largely address suicide as a question of\ninterpersonal morality, that is, as a question about our duties to one\nanother (though it should be noted that Kant’s opposition to\nsuicide was rooted in his belief that it violates duties we owe to\nourselves rather than duties we owe to others). However, suicide also\nraises what might be termed ethical questions, such as whether suicide\nexemplifies virtue. Bogen (1980) observes that even when we have\nadequately determined that a given act of suicide is morally\npermissible, questions remain about whether that act represents\n“the best way to live and to end one’s life.” A full\naccount of the ethics of suicide may therefore benefit by\nsupplementing the language of interpersonal obligation and rights with\nthe language of virtues and vices: Under what conditions does an act\nof suicide exhibit a vice such as cowardice, for example? (Benatar\n2021: 220–221) While such questions are germane to whether\nsuicide is defensible all things considered, they are infrequently\naddressed in the philosophical literature (though see van Zyl 2000;\nHardwig 1997 can plausibly be read as claiming that continuing to live\nis sometimes selfish).\n\nSuicide also raises other normative questions that are not obviously\nmoral, such as how suicide may contribute to or detract from the\nmeaningfulness of an individual’s life. For the twentieth\ncentury existentialists, suicide was not a choice to be made mainly by\nappeal to moral considerations but by analyzing whether suicide is an\nappropriate response to the absurdity or meaninglessness of the world\nand of human endeavor. Albert Camus illustrated this absurdity in his\nphilosophical essay The Myth of Sisyphus. For Camus, Sisyphus\nheroically does not try to escape his absurd task of endlessly and\nfutilely pushing a rock up a mountain, but instead perseveres and in\nso doing resists the lure of suicide. An appreciation of the absurdity\nof life, Camus contends, should lead us to repudiate rather than\nembrace suicide. For suicide avoids the encounter between human life\nand its absurdity in an indifferent universe. (DeLancey 2021)\n.Jean-Paul Sartre was likewise struck by the possibility of suicide as\nan assertion of authentic human will in the face of absurdity. Suicide\nrepresents, according to Sartre, an opportunity to stake out our\nunderstanding of our essence as individuals in a godless world.\nQuestions of whether a life saturated with pain or suffering can be\nmeaningful have also played a part in recent debates about the\njustification of assisted suicide (Little 1999, Varelius 2013).\n4. Conclusion\n\nAs the foregoing discussion indicates, suicide has been and continues\nto be a rich field of philosophical investigation. Recent advances in\nmedical technology are responsible for the extensive philosophical\nattention paid to one kind of suicide, euthanasia or\nphysician-assisted suicide (PAS), while more\n“run-of-the-mill” suicide motivated by psychological\nanguish is somewhat overlooked. This is somewhat unfortunate:\nEuthanasia and physician-assisted suicide raise issues beyond those\nassociated with other suicides, including the allocation of health\ncare resources, the nature of the medical profession, the\npatient-physician relationship, and the prospect that allowing\nrelatively benign forms of killing such as voluntary euthanasia of PAS\nwill lead down a “slippery slope” to more morally\nworrisome killings. However, many of the same issues and concerns that\nsurround PAS and euthanasia also surround run-of-the mill suicide, and\nmany writers who address the former often disregard the vast\nliterature on the latter. (In addition to the entry on voluntary\neuthanasia, Dworkin et al. 1998, Barry 2007, Pabst Battin\n2003, and Cholbi 2011, 139–61, provide overviews of the moral\ndebates surrounding euthanasia and PAS.)\n\nNot only is suicide worthy of philosophical investigation in its own\nright, it is a source of insight for various philosophical\nsubdisciplines: moral psychology, ethical theory, social and political\nphilosophy, the metaphysics of personhood, and action theory. Suicide\nis also an area where philosophical interests intersect with those of\nthe empirical sciences. The collective efforts of philosophers and\nothers continue to illuminate one of the most enigmatic of human\nbehaviors.\n",
    "bibliography": {
        "categories": [
            "<a name=\"HisPre190WorCit\">A. Historical (pre-1900) Works Cited</a>",
            "<a name=\"WorCit190Pre\">B. Works Cited, 1900–Present</a>",
            "<a name=\"FurRea\">C. Further Reading</a>"
        ],
        "cat_ref_text": {
            "<a name=\"HisPre190WorCit\">A. Historical (pre-1900) Works Cited</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Aquinas, St. Thomas, 1273, <em>Summa Theologica,</em> Fathers\nof the English Dominican Province (trans.), Notre Dame, IN:\nChristian Classics, 1981.",
                "Aristotle, c. 330 BCE, <em>Nicomachean Ethics</em>, Roger Crisp\n(trans.), Cambridge: Cambridge University Press, 2000.",
                "Augustine, St., c. 413–426 CE, <em>City of God</em>, Gerald\nG. Walsh, Demetrius B. Zema, Grace Monahan, Daniel J. Honan (trans.),\nGarden City, NY: Image Books, 1958.",
                "Cicero, 45 BCE, <em>De Finibus</em>, H. Rackham (trans.), London:\nWilliam Heinemann, 1914.",
                "Confucius, 5th century BCE, <em>Analects</em>, E. Lang Harris\n(trans.), Indianapolis: Hackett, 2003.",
                "Donne, J., 1608, <em>Biathanatos, A Declaration of that Paradoxe,\nor Thesis, that Selfe-homicide is not so naturally Sinne, that it may\nnever be Otherwise</em>, London: Humphrey Moseley, 1648.",
                "Durkheim, E., 1897, <em>Le Suicide</em>, Paris: G.\nBaillière.",
                "d’Holbach, Baron, 1770, <em>The System of Nature, or Laws of\nthe Moral and Physical World</em>, Volume 1, Robinson (trans.), New\nYork: Burt Franklin, 1970.",
                "Hume, D., 1783, <em>Of Suicide</em>, New York: Penguin, 2005.\n [<a href=\"http://www.davidhume.org/texts/suis.html\" target=\"other\">Available online</a>].",
                "Kant, I., 1785, <em>Metaphysics of Morals</em>, M. Gregor\n(trans.), Cambridge: Cambridge University Press, 1996.",
                "Locke, J., 1690, <em>Two Treatises of Government</em>, Cambridge:\nCambridge University Press, 1988.",
                "Montaigne, M., 1595, <em>Essais</em> Fortunat Strowski <em>et\nal.</em> (eds.), 5 vols., Bordeaux: Pech, 1906–1933.",
                "More, T., 1516, <em>Utopia</em>, George Logan and Robert Merrihew\n(eds.), Cambridge: Cambridge University Press, 2002.",
                "Nietzsche, F. 1883. <em>Thus Spoke Zarathustra, </em>A. Del\nCaro and R. Pippin, (eds.), Cambridge: Cambridge University Press,\n2006.",
                "Plato, c. 340 BCE, <em>Phaedo</em>, David Gallop (trans.), Oxford,\nOxford University Press, 1975.",
                "–––, c. 340 BCE, <em>Laws</em>, 2 vols., R.G.\nBury (trans.), New York: G.P. Putnam’s Sons, 1926.",
                "Schopenhauer, A. 1819. <em>The World as Will and\nRepresentation</em>, Volume 1, J. Norman, A. Welchman, and C. Janaway,\n(eds.), (Cambridge Edition of the Works of Schopenhauer). Cambridge:\nCambridge University Press, 2010.",
                "Seneca, c. 60 CE, “On the Proper Time to Slip the\nCable,” <em>L. Annaei Senecae Ad Lucilium Epistulae\nMorales</em>, L.D. Reynolds (ed.), Oxford: Oxford University Press,\n1965.",
                "Umaswati, A., 2nd-5th centuries CE, <em>Tattvartha Suttra</em>,\nS.A. Jain (trans.), <em>Reality: English Translation of Srimat\nPujyapadacarya’s Sarvarthasiddhi</em>, Jwalamalini Trust,\n1992.\n</ul>\n<h3>"
            ],
            "<a name=\"WorCit190Pre\">B. Works Cited, 1900–Present</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Amundsen, D., 1989, “Suicide and Early Christian\nValues”, in <em>Suicide and Euthanasia: Historical and\nContemporary Themes</em>, B. Brody (ed.), Dordrecht: Kluwer, pp.\n77–153.",
                "Barry, V., 2007, <em>Philosophical Thinking about Death and\nDying</em>, Belmont: Wadsworth.",
                "Beauchamp, T.L., 1992, “Suicide”, in <em>Matters of\nLife and Death</em>, T. Regan (ed.), New York: McGraw-Hill.",
                "Beck, A.T., Kovacs, M., and Weissman A., 1979, “Assessment\nof Suicidal Ideation: The Scale for Suicidal Ideation”,\n<em>Journal of Consulting and Clinical Psychology</em>, 47(2):\n343–352.",
                "Benatar, D., 2021, “Suicide is <em>Sometimes</em> Rational\nand Morally Defensible”, in M. Cholbi and T. Timmerman (eds.),\n<em>Exploring the Philosophy of Death and Dying: Classical and\nContemporary Perspectives</em>, New York: Routledge, pp.\n217–223.",
                "Blauner, S.R., 2002, <em>How I Stayed Alive When My Brain Was\nTrying to Kill Me: One Person’s Guide to Suicide\nPrevention</em>, New York: HarperCollins.",
                "Bogen, J., 1980, “Suicide and Virtue”, in M. Battin\nand D. Mayo (eds.), <em>Suicide: The Philosophical Issues</em>. New\nYork: St. Martin’s.",
                "Brandt, R., 1975, “The Morality and Rationality of\nSuicide”, in <em>A Handbook for the Study of Suicide</em>, S.\nPerlin (ed.) Oxford: Oxford University Press, pp. 66–76.",
                "Campbell, R., and Collinson, D., 1988, <em>Ending Lives</em>,\nOxford: Basil Blackwell.",
                "Camus, A. 1975, <em>The Myth of Sisyphus</em>. New York:\nPenguin.",
                "Cholbi, M., 2000, “Kant and the Irrationality of\nSuicide”, <em>History of Philosophy Quarterly</em>, 17(2):\n159–176.",
                "–––, 2002, “Suicide Intervention and\nNon-ideal Kantian Theory”, <em>Journal of Applied\nPhilosophy</em>, 19: 245–259.",
                "–––, 2007,\n“‘Self-manslaughter’ and the Forensic Classification\nof Self-inflicted Deaths,” <em>Journal of Medical Ethics</em>,\n33: 155–157.",
                "–––, 2010a, “A Kantian Defense of\nPrudential Suicide,” <em>Journal of Moral Philosophy</em>, 7:\n489–515.",
                "–––, 2010b, “The Duty to Die and the\nBurdensomeness of Living,” <em>Bioethics</em>, 24:\n412–420.",
                "–––, 2011, <em>Suicide: The Philosophical\nDimensions</em>, Peterborough, Ontario: Broadview.",
                "Cooper, J. M., 1989, “Greek Philosophers on Suicide and\nEuthanasia”, in <em>Suicide and Euthanasia: Historical and\nContemporary Themes</em>, B. Brody (ed.), Dordrecht: Kluwer, pp.\n9–38.",
                "Cosculluela, V. 1994, “The Ethics of Suicide\nPrevention”, <em>International Journal of Applied\nPhilosophy</em>, 9: 35–41.",
                "–––, 1995, <em>The Ethics of Suicide</em>, New\nYork: Garland.",
                "Cowley, C., 2006, “Suicide Is Neither Rational Nor\nIrrational”, <em>Ethical Theory and Moral Practice</em>, 9:\n495–504.",
                "DeLancey, C., 2021, “Camus’s Absurd and the Argument\nagainst Suicide”, <em>Philosophia</em>,\ndoi:10.1007/s11406-021-00333-7",
                "Devine, P.E., 1978, “On Choosing Death”, in <em>The\nEthics of Homicide</em>, Ithaca: Cornell University Press.",
                "Donnelly, J., 1998, “Introduction,” in <em>Suicide:\nRight or Wrong?</em>, J. Donnelly (ed.), Amherst, NY: Prometheus, pp.\n7–31.",
                "Dowie, S., 2020, “What is Suicide? Classifying Self-Killing\n”, <em>Medicine, Health Care, and Philosophy</em>, 23:\n717–773.",
                "Dworkin, G., Frey, R.G., and Bok, S., 1998, <em>Euthanasia and\nPhysician-Assisted Suicide:For and Against</em>, Cambridge: Cambridge\nUniversity Press.",
                "Dworkin, R., 1993, <em>Life’s Dominion</em>, New York:\nKnopf.",
                "Fairbairn, G., 1995, <em>Contemplating Suicide: The Language and\nEthics of Self-Harm</em>, London: Routledge.",
                "Fedden, H.R., 1938, <em>Suicide: A Social and Historical\nStudy</em>, London: Peter Davies.",
                "Frey, R.G., 1978, “Did Socrates Commit Suicide?”,\n<em>Philosophy</em>, 53: 106–108.",
                "–––, 1981, “Suicide and Self-Inflicted\nDeath”, <em>Philosophy</em>, 56: 193–202.",
                "Friesen, P., 2020, “Medically Assisted Dying and Suicide:\nHow Are They Different, and How Are They Similar?”, <em>Hastings\nCenter Report</em>, 50: 32–43.",
                "Gay-Willliams, J., 1996, “The Wrongfulness of\nEuthanasia”, in <em>Intervention and Reflection: Basic Issues in\nMedical Ethics</em>, R. Munson (ed.), Belmont: Wadsworth, pp.\n156–163.",
                "Glover, J., 1990, <em>Causing Death and Saving Lives</em>, London:\nPenguin.",
                "Graber, G.C., 1981, “The Rationality of Suicide” in\n<em>Suicide and Euthanasia: The Rights of Personhood</em>, S. Wallace\nand A. Eser (eds.), Knoxville, TN: University of Tennessee Press, pp.\n51–65.",
                "Hayry, M., 1991, “Measuring the Quality of Life: Why, How\nand What?”, <em>Theoretical Medicine</em>, 2: 97–116.",
                "Hardwig, J., 1996, “Dying at the Right Time: Reflections on\nAssisted and Unassisted Suicide,” in <em>Ethics in\nPractice</em>, H. LaFollette (ed.), New York: Blackwell.",
                "–––, 1997, “Is There a Duty to\nDie?”, <em>Hastings Center Report</em>, 27: 34–42",
                "Hardwig, J. <em>et al</em>., 2000, <em>Is There a Duty to Die?:And\nOther Essays in Bioethics</em>, New York: Routledge, pp.\n48–58.",
                "Hill, D.J., 2011, “What is It to Commit Suicide?”,\n<em>Ratio</em>, 24: 192–205.",
                "Holley, D.M., 1989, “Voluntary Death, Property Rights, and\nthe Gift of Life”, <em>Journal of Religious Ethics</em>, 17:\n103–121.",
                "Humber, J., and Almeder, R. (eds.), 2000, <em>Is There a Duty to\nDie?</em>, Totowa, NJ: Humana Press.",
                "Joiner, T., 2010, <em>Myths about Suicide </em>, Cambridge:\nCambridge University Press.",
                "Kleinig, J., 1983,  <em>Paternalism</em>, Manchester:\nManchester University Press.",
                "Kluge, E.W., 1975, <em>The Practice of Death</em>, New Haven: Yale\nUniversity Press.",
                "Kupfer, Joseph, 1990, “Suicide: Its Nature and Moral\nEvaluation”, <em>Journal of Value Inquiry</em>, 24:\n67–81.",
                "Lecaldano, E., 2016, “Hume on Suicide”, in P.Russell,\n(ed.), <em>Oxford Handbook of Hume</em>, Oxford: Oxford University\nPress, pp. 660–668.",
                "Lieberman, L., 2003, <em>Leaving You: The Cultural Meaning of\nSuicide</em>, Chicago: Ivan R. Dee.",
                "Little , M., 1999, “Assisted Suicide, Suffering, and the\nMeaning of Life”, <em>Theoretical Medicine and Bioethics</em>,\n20: 287–298.",
                "Luper, S., 2009, <em>Philosophy of Death</em>, Cambridge:\nCambridge University Press.",
                "Martin, N., 2011, “Preserving Trust, Maintaining Care, and\nSaving Lives: Competing Feminist Values in Suicide Prevention,”\n<em>International Journal of Feminist Approaches to Bioethics</em>, 4:\n164–187.",
                "Martin, R.M., 1980, “Suicide and False Desires”, in\n<em>Suicide: The Philosophical Issues</em>, M. Battin and D. Mayo\n(eds.), New York: St. Martin’s, pp. 144–150.",
                "Maung, H., 2020, “Pluralism and Incommensurability in\nSuicide Research”, <em>Studies in History and Philosophy of\nScience Part C</em> (Studies in History and Philosophy of Biological\nand Biomedical Sciences), 80 (April): 101247.\ndoi:10.1016/j.shpsc.2019.101247",
                "–––, 2021, “Mental Disorder and Suicide:\nWhat’s the Connection?” <em>Journal of Medicine and\nPhilosophy</em>, doi:10.1093/jmp/jhab015",
                "Menzel, P.T., 2000, “The Nature, Scope, and Implications of\na Personal Moral Duty to Die,” in J. Humber and R. Almeder\n(eds.), <em>Is There a Duty to Die?</em>, Totowa, NJ: Humana Press,\npp. 93–114.",
                "McMahan, J., 2002, <em>The Ethics of Killing: Problems at the\nMargins of Life</em>, Oxford: Oxford University Press.",
                "Minois, G., 1999, <em>History of Suicide: Voluntary Death in\nWestern Culture</em>, Baltimore: Johns Hopkins University Press.",
                "Moreland, J.P. and Geisler, N.L., 1990, <em>The Life and Death\nDebate</em>, Westport: Greenwood Press.",
                "Narveson, J., 2000, “Is There a Duty to Die?” in J.\nHumber and R. Almeder (eds.), <em>Is There a Duty to Die?</em>,\nTotowa, NJ: Humana Press.",
                "Ng, J., Sjöstrand, M., and Eyal, N., 2019, “ Adding\nLithium to Drinking Water for Suicide Prevention: The Ethics”,\n<em>Public Health Ethics</em>, 12: 274–286.",
                "O’Keeffe, T.M., 1981, “Suicide and\nSelf-Starvation”, <em>Philosophy</em>, 56: 349–363.",
                "Pabst Battin, M., 1996, <em>The Death Debate. Ethical Issues in\nSuicide</em>, Upper Saddle River, NJ: Prentice-Hall.",
                "–––, 2003, “Euthanasia and\nPhysician-Assisted Suicide,” in H. LaFollette (ed)., <em>Oxford\nHandbook of Practical Ethics</em>, Oxford: Oxford University Press,\npp. 673–704.",
                "–––, 2015, <em>The Ethics of Suicide: Historical\nSources</em>, Oxford: Oxford University Press.",
                "Paterson, C., 2003, “On Clarifying Terms in Applied Ethics\nDiscourse: Suicide, Assisted Suicide and Euthanasia”,\n<em>International Philosophical Quarterly</em>, 43(3):\n351–358.",
                "Radden, J., 1982, “Diseases as Excuses:Durham and the\nInsanity Defense”, <em>Philosophical Studies</em>, 42(3):\n349–362.",
                "Reed, P., 2020, “Against Recategorizing Physician-Assisted\nSuicide”, <em>Public Affairs Quarterly</em>, 34:\n50–71.",
                "Ramsey, P., 1978, <em>Ethics at the Edges of Life</em>, New Haven:\nYale University Press.",
                "Shneidman, E., 1985, <em>Definition of Suicide</em>, New York:\nWiley &amp; Sons.",
                "Singer, P., 1993, <em>Practical Ethics</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1994, <em>Rethinking Life and Death</em>,\nNew York: St. Martin’s.",
                "Sprott, S.E., 1961, <em>The English Debate on Suicide from Donne\nto Hume</em>, LaSalle, IL: Open Court.",
                "Stellino, P., 2020, <em>Philosophical Perspectives on Suicide:\nKant, Schopenhauer, Nietzsche, and Wittgenstein</em>, Cham: Palgrave\nMacmillan.",
                "Stern-Gillett, S., 1987, “The Rhetoric of Suicide”,\n<em>Philosophy and Rhetoric</em>, 20(3): 160–170.",
                "Szasz, T., 2002, <em>Fatal Freedom: The Ethics and Politics of\nSuicide</em>, Syracuse: Syracuse University Press.",
                "Tolhurst, W.E., 1983, “Suicide, Self-sacrifice, and\nCoercion”, <em>Southern Journal of Philosophy</em>, 21:\n109–121.",
                "Tong, R., 2000, “Duty to Die,” in J. Humber and R.\nAlmeder (eds.), <em>Is There a Duty to Die?</em>, Totowa, NJ: Humana\nPress.",
                "van Zyl, L., 2000, <em>Death and Compassion: A Virtue-based\nApproach to Euthanasia</em>, London: Ashgate.",
                "Varelius, J., 2013, “Ending Life, Morality, and\nMeaning”, <em>Ethical Theory and Moral Practice</em>, 16:\n559–574.",
                "Velleman, J.D., 1999, “Is There a Right of\nSelf-Termination?”, <em>Ethics</em>, 109: 606–628.",
                "White, J., Marsh, I., Kral, M.J., and Morris, J., 2016,\n<em>Critical Suicidology: Transforming Suicide Research and Prevention\nfor the 21st Century</em>, Vancouver: University of British Columbia\nPress.",
                "Windt, P., 1981, “The Concept of Suicide”, in\n<em>Suicide: The Philosophical Issues</em>, M. Pabst-Battin and D.J.\nMayo (eds.), London: Peter Owen, pp. 42–43.\n</ul>\n<h3>"
            ],
            "<a name=\"FurRea\">C. Further Reading</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Alvarez, A., 1982, <em>The Savage God: A Study of Suicide</em>.\nNew York: Bantam.",
                "Battin, M. and Mayo, D. (eds.), 1980, <em>Suicide: The\nPhilosophical Issues</em>. New York: St. Martin’s.",
                "Donnelly, J. (ed.), 1998, <em>Suicide: Right or Wrong?</em>\nAmherst, NY: Prometheus.",
                "Hecht, J.M., 2013, <em>Stay: A History of Suicide and the\nPhilosophies Against It</em>. New Haven: Yale University Press.",
                "Joiner, T., 2005, <em>Why People Die by Suicide</em>. Cambridge,\nMA: Harvard University Press.",
                "Maltsberger, J.T., and Goldblatt, M., 1996, <em>Essential Papers\non Suicide</em>, New York: New York University Press.",
                "Mayo, D., 1986, “The Concept of Rational Suicide”,\n<em>Journal of Medicine and Philosophy</em>, 2: 143–155.",
                "Nagel, T., 1970, “Death”, <em>Noûs</em>, 4:\n73–80.",
                "Novak, D., 1976, <em>Suicide and Morality: The Theories of Plato,\nAquinas, and Kant and Their Relevance for Suicidology</em>, Scholars\nStudies Press.",
                "Shneidman, E.S., 1998, <em>The Suicidal Mind</em>, Oxford: Oxford\nUniversity Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"HisPre190WorCit\">A. Historical (pre-1900) Works Cited</a></h3>\n<ul class=\"hanging\">\n<li>Aquinas, St. Thomas, 1273, <em>Summa Theologica,</em> Fathers\nof the English Dominican Province (trans.), Notre Dame, IN:\nChristian Classics, 1981.</li>\n<li>Aristotle, c. 330 BCE, <em>Nicomachean Ethics</em>, Roger Crisp\n(trans.), Cambridge: Cambridge University Press, 2000.</li>\n<li>Augustine, St., c. 413–426 CE, <em>City of God</em>, Gerald\nG. Walsh, Demetrius B. Zema, Grace Monahan, Daniel J. Honan (trans.),\nGarden City, NY: Image Books, 1958.</li>\n<li>Cicero, 45 BCE, <em>De Finibus</em>, H. Rackham (trans.), London:\nWilliam Heinemann, 1914.</li>\n<li>Confucius, 5th century BCE, <em>Analects</em>, E. Lang Harris\n(trans.), Indianapolis: Hackett, 2003.</li>\n<li>Donne, J., 1608, <em>Biathanatos, A Declaration of that Paradoxe,\nor Thesis, that Selfe-homicide is not so naturally Sinne, that it may\nnever be Otherwise</em>, London: Humphrey Moseley, 1648.</li>\n<li>Durkheim, E., 1897, <em>Le Suicide</em>, Paris: G.\nBaillière.</li>\n<li>d’Holbach, Baron, 1770, <em>The System of Nature, or Laws of\nthe Moral and Physical World</em>, Volume 1, Robinson (trans.), New\nYork: Burt Franklin, 1970.</li>\n<li>Hume, D., 1783, <em>Of Suicide</em>, New York: Penguin, 2005.\n [<a href=\"http://www.davidhume.org/texts/suis.html\" target=\"other\">Available online</a>].</li>\n<li>Kant, I., 1785, <em>Metaphysics of Morals</em>, M. Gregor\n(trans.), Cambridge: Cambridge University Press, 1996.</li>\n<li>Locke, J., 1690, <em>Two Treatises of Government</em>, Cambridge:\nCambridge University Press, 1988.</li>\n<li>Montaigne, M., 1595, <em>Essais</em> Fortunat Strowski <em>et\nal.</em> (eds.), 5 vols., Bordeaux: Pech, 1906–1933.</li>\n<li>More, T., 1516, <em>Utopia</em>, George Logan and Robert Merrihew\n(eds.), Cambridge: Cambridge University Press, 2002.</li>\n<li>Nietzsche, F. 1883. <em>Thus Spoke Zarathustra, </em>A. Del\nCaro and R. Pippin, (eds.), Cambridge: Cambridge University Press,\n2006.</li>\n<li>Plato, c. 340 BCE, <em>Phaedo</em>, David Gallop (trans.), Oxford,\nOxford University Press, 1975.</li>\n<li>–––, c. 340 BCE, <em>Laws</em>, 2 vols., R.G.\nBury (trans.), New York: G.P. Putnam’s Sons, 1926.</li>\n<li>Schopenhauer, A. 1819. <em>The World as Will and\nRepresentation</em>, Volume 1, J. Norman, A. Welchman, and C. Janaway,\n(eds.), (Cambridge Edition of the Works of Schopenhauer). Cambridge:\nCambridge University Press, 2010.</li>\n<li>Seneca, c. 60 CE, “On the Proper Time to Slip the\nCable,” <em>L. Annaei Senecae Ad Lucilium Epistulae\nMorales</em>, L.D. Reynolds (ed.), Oxford: Oxford University Press,\n1965.</li>\n<li>Umaswati, A., 2nd-5th centuries CE, <em>Tattvartha Suttra</em>,\nS.A. Jain (trans.), <em>Reality: English Translation of Srimat\nPujyapadacarya’s Sarvarthasiddhi</em>, Jwalamalini Trust,\n1992.</li>\n</ul>\n<h3><a name=\"WorCit190Pre\">B. Works Cited, 1900–Present</a></h3>\n<ul class=\"hanging\">\n<li>Amundsen, D., 1989, “Suicide and Early Christian\nValues”, in <em>Suicide and Euthanasia: Historical and\nContemporary Themes</em>, B. Brody (ed.), Dordrecht: Kluwer, pp.\n77–153.</li>\n<li>Barry, V., 2007, <em>Philosophical Thinking about Death and\nDying</em>, Belmont: Wadsworth.</li>\n<li>Beauchamp, T.L., 1992, “Suicide”, in <em>Matters of\nLife and Death</em>, T. Regan (ed.), New York: McGraw-Hill.</li>\n<li>Beck, A.T., Kovacs, M., and Weissman A., 1979, “Assessment\nof Suicidal Ideation: The Scale for Suicidal Ideation”,\n<em>Journal of Consulting and Clinical Psychology</em>, 47(2):\n343–352.</li>\n<li>Benatar, D., 2021, “Suicide is <em>Sometimes</em> Rational\nand Morally Defensible”, in M. Cholbi and T. Timmerman (eds.),\n<em>Exploring the Philosophy of Death and Dying: Classical and\nContemporary Perspectives</em>, New York: Routledge, pp.\n217–223. </li>\n<li>Blauner, S.R., 2002, <em>How I Stayed Alive When My Brain Was\nTrying to Kill Me: One Person’s Guide to Suicide\nPrevention</em>, New York: HarperCollins.</li>\n<li>Bogen, J., 1980, “Suicide and Virtue”, in M. Battin\nand D. Mayo (eds.), <em>Suicide: The Philosophical Issues</em>. New\nYork: St. Martin’s.</li>\n<li>Brandt, R., 1975, “The Morality and Rationality of\nSuicide”, in <em>A Handbook for the Study of Suicide</em>, S.\nPerlin (ed.) Oxford: Oxford University Press, pp. 66–76.</li>\n<li>Campbell, R., and Collinson, D., 1988, <em>Ending Lives</em>,\nOxford: Basil Blackwell.</li>\n<li>Camus, A. 1975, <em>The Myth of Sisyphus</em>. New York:\nPenguin.</li>\n<li>Cholbi, M., 2000, “Kant and the Irrationality of\nSuicide”, <em>History of Philosophy Quarterly</em>, 17(2):\n159–176.</li>\n<li>–––, 2002, “Suicide Intervention and\nNon-ideal Kantian Theory”, <em>Journal of Applied\nPhilosophy</em>, 19: 245–259.</li>\n<li>–––, 2007,\n“‘Self-manslaughter’ and the Forensic Classification\nof Self-inflicted Deaths,” <em>Journal of Medical Ethics</em>,\n33: 155–157.</li>\n<li>–––, 2010a, “A Kantian Defense of\nPrudential Suicide,” <em>Journal of Moral Philosophy</em>, 7:\n489–515.</li>\n<li>–––, 2010b, “The Duty to Die and the\nBurdensomeness of Living,” <em>Bioethics</em>, 24:\n412–420.</li>\n<li>–––, 2011, <em>Suicide: The Philosophical\nDimensions</em>, Peterborough, Ontario: Broadview.</li>\n<li>Cooper, J. M., 1989, “Greek Philosophers on Suicide and\nEuthanasia”, in <em>Suicide and Euthanasia: Historical and\nContemporary Themes</em>, B. Brody (ed.), Dordrecht: Kluwer, pp.\n9–38.</li>\n<li>Cosculluela, V. 1994, “The Ethics of Suicide\nPrevention”, <em>International Journal of Applied\nPhilosophy</em>, 9: 35–41.</li>\n<li>–––, 1995, <em>The Ethics of Suicide</em>, New\nYork: Garland.</li>\n<li>Cowley, C., 2006, “Suicide Is Neither Rational Nor\nIrrational”, <em>Ethical Theory and Moral Practice</em>, 9:\n495–504.</li>\n<li>DeLancey, C., 2021, “Camus’s Absurd and the Argument\nagainst Suicide”, <em>Philosophia</em>,\ndoi:10.1007/s11406-021-00333-7</li>\n<li>Devine, P.E., 1978, “On Choosing Death”, in <em>The\nEthics of Homicide</em>, Ithaca: Cornell University Press.</li>\n<li>Donnelly, J., 1998, “Introduction,” in <em>Suicide:\nRight or Wrong?</em>, J. Donnelly (ed.), Amherst, NY: Prometheus, pp.\n7–31.</li>\n<li>Dowie, S., 2020, “What is Suicide? Classifying Self-Killing\n”, <em>Medicine, Health Care, and Philosophy</em>, 23:\n717–773.</li>\n<li>Dworkin, G., Frey, R.G., and Bok, S., 1998, <em>Euthanasia and\nPhysician-Assisted Suicide:For and Against</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Dworkin, R., 1993, <em>Life’s Dominion</em>, New York:\nKnopf.</li>\n<li>Fairbairn, G., 1995, <em>Contemplating Suicide: The Language and\nEthics of Self-Harm</em>, London: Routledge.</li>\n<li>Fedden, H.R., 1938, <em>Suicide: A Social and Historical\nStudy</em>, London: Peter Davies.</li>\n<li>Frey, R.G., 1978, “Did Socrates Commit Suicide?”,\n<em>Philosophy</em>, 53: 106–108.</li>\n<li>–––, 1981, “Suicide and Self-Inflicted\nDeath”, <em>Philosophy</em>, 56: 193–202.</li>\n<li>Friesen, P., 2020, “Medically Assisted Dying and Suicide:\nHow Are They Different, and How Are They Similar?”, <em>Hastings\nCenter Report</em>, 50: 32–43.</li>\n<li>Gay-Willliams, J., 1996, “The Wrongfulness of\nEuthanasia”, in <em>Intervention and Reflection: Basic Issues in\nMedical Ethics</em>, R. Munson (ed.), Belmont: Wadsworth, pp.\n156–163.</li>\n<li>Glover, J., 1990, <em>Causing Death and Saving Lives</em>, London:\nPenguin.</li>\n<li>Graber, G.C., 1981, “The Rationality of Suicide” in\n<em>Suicide and Euthanasia: The Rights of Personhood</em>, S. Wallace\nand A. Eser (eds.), Knoxville, TN: University of Tennessee Press, pp.\n51–65.</li>\n<li>Hayry, M., 1991, “Measuring the Quality of Life: Why, How\nand What?”, <em>Theoretical Medicine</em>, 2: 97–116.</li>\n<li>Hardwig, J., 1996, “Dying at the Right Time: Reflections on\nAssisted and Unassisted Suicide,” in <em>Ethics in\nPractice</em>, H. LaFollette (ed.), New York: Blackwell.</li>\n<li>–––, 1997, “Is There a Duty to\nDie?”, <em>Hastings Center Report</em>, 27: 34–42</li>\n<li>Hardwig, J. <em>et al</em>., 2000, <em>Is There a Duty to Die?:And\nOther Essays in Bioethics</em>, New York: Routledge, pp.\n48–58.</li>\n<li>Hill, D.J., 2011, “What is It to Commit Suicide?”,\n<em>Ratio</em>, 24: 192–205.</li>\n<li>Holley, D.M., 1989, “Voluntary Death, Property Rights, and\nthe Gift of Life”, <em>Journal of Religious Ethics</em>, 17:\n103–121.</li>\n<li>Humber, J., and Almeder, R. (eds.), 2000, <em>Is There a Duty to\nDie?</em>, Totowa, NJ: Humana Press.</li>\n<li>Joiner, T., 2010, <em>Myths about Suicide </em>, Cambridge:\nCambridge University Press.</li>\n<li>Kleinig, J., 1983,  <em>Paternalism</em>, Manchester:\nManchester University Press.</li>\n<li>Kluge, E.W., 1975, <em>The Practice of Death</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Kupfer, Joseph, 1990, “Suicide: Its Nature and Moral\nEvaluation”, <em>Journal of Value Inquiry</em>, 24:\n67–81.</li>\n<li>Lecaldano, E., 2016, “Hume on Suicide”, in P.Russell,\n(ed.), <em>Oxford Handbook of Hume</em>, Oxford: Oxford University\nPress, pp. 660–668.</li>\n<li>Lieberman, L., 2003, <em>Leaving You: The Cultural Meaning of\nSuicide</em>, Chicago: Ivan R. Dee.</li>\n<li>Little , M., 1999, “Assisted Suicide, Suffering, and the\nMeaning of Life”, <em>Theoretical Medicine and Bioethics</em>,\n20: 287–298.</li>\n<li>Luper, S., 2009, <em>Philosophy of Death</em>, Cambridge:\nCambridge University Press.</li>\n<li>Martin, N., 2011, “Preserving Trust, Maintaining Care, and\nSaving Lives: Competing Feminist Values in Suicide Prevention,”\n<em>International Journal of Feminist Approaches to Bioethics</em>, 4:\n164–187.</li>\n<li>Martin, R.M., 1980, “Suicide and False Desires”, in\n<em>Suicide: The Philosophical Issues</em>, M. Battin and D. Mayo\n(eds.), New York: St. Martin’s, pp. 144–150.</li>\n<li>Maung, H., 2020, “Pluralism and Incommensurability in\nSuicide Research”, <em>Studies in History and Philosophy of\nScience Part C</em> (Studies in History and Philosophy of Biological\nand Biomedical Sciences), 80 (April): 101247.\ndoi:10.1016/j.shpsc.2019.101247</li>\n<li>–––, 2021, “Mental Disorder and Suicide:\nWhat’s the Connection?” <em>Journal of Medicine and\nPhilosophy</em>, doi:10.1093/jmp/jhab015</li>\n<li>Menzel, P.T., 2000, “The Nature, Scope, and Implications of\na Personal Moral Duty to Die,” in J. Humber and R. Almeder\n(eds.), <em>Is There a Duty to Die?</em>, Totowa, NJ: Humana Press,\npp. 93–114.</li>\n<li>McMahan, J., 2002, <em>The Ethics of Killing: Problems at the\nMargins of Life</em>, Oxford: Oxford University Press.</li>\n<li>Minois, G., 1999, <em>History of Suicide: Voluntary Death in\nWestern Culture</em>, Baltimore: Johns Hopkins University Press.</li>\n<li>Moreland, J.P. and Geisler, N.L., 1990, <em>The Life and Death\nDebate</em>, Westport: Greenwood Press.</li>\n<li>Narveson, J., 2000, “Is There a Duty to Die?” in J.\nHumber and R. Almeder (eds.), <em>Is There a Duty to Die?</em>,\nTotowa, NJ: Humana Press.</li>\n<li>Ng, J., Sjöstrand, M., and Eyal, N., 2019, “ Adding\nLithium to Drinking Water for Suicide Prevention: The Ethics”,\n<em>Public Health Ethics</em>, 12: 274–286.</li>\n<li>O’Keeffe, T.M., 1981, “Suicide and\nSelf-Starvation”, <em>Philosophy</em>, 56: 349–363.</li>\n<li>Pabst Battin, M., 1996, <em>The Death Debate. Ethical Issues in\nSuicide</em>, Upper Saddle River, NJ: Prentice-Hall.</li>\n<li>–––, 2003, “Euthanasia and\nPhysician-Assisted Suicide,” in H. LaFollette (ed)., <em>Oxford\nHandbook of Practical Ethics</em>, Oxford: Oxford University Press,\npp. 673–704.</li>\n<li>–––, 2015, <em>The Ethics of Suicide: Historical\nSources</em>, Oxford: Oxford University Press.</li>\n<li>Paterson, C., 2003, “On Clarifying Terms in Applied Ethics\nDiscourse: Suicide, Assisted Suicide and Euthanasia”,\n<em>International Philosophical Quarterly</em>, 43(3):\n351–358.</li>\n<li>Radden, J., 1982, “Diseases as Excuses:Durham and the\nInsanity Defense”, <em>Philosophical Studies</em>, 42(3):\n349–362.</li>\n<li>Reed, P., 2020, “Against Recategorizing Physician-Assisted\nSuicide”, <em>Public Affairs Quarterly</em>, 34:\n50–71.</li>\n<li>Ramsey, P., 1978, <em>Ethics at the Edges of Life</em>, New Haven:\nYale University Press.</li>\n<li>Shneidman, E., 1985, <em>Definition of Suicide</em>, New York:\nWiley &amp; Sons.</li>\n<li>Singer, P., 1993, <em>Practical Ethics</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1994, <em>Rethinking Life and Death</em>,\nNew York: St. Martin’s.</li>\n<li>Sprott, S.E., 1961, <em>The English Debate on Suicide from Donne\nto Hume</em>, LaSalle, IL: Open Court.</li>\n<li>Stellino, P., 2020, <em>Philosophical Perspectives on Suicide:\nKant, Schopenhauer, Nietzsche, and Wittgenstein</em>, Cham: Palgrave\nMacmillan.</li>\n<li>Stern-Gillett, S., 1987, “The Rhetoric of Suicide”,\n<em>Philosophy and Rhetoric</em>, 20(3): 160–170.</li>\n<li>Szasz, T., 2002, <em>Fatal Freedom: The Ethics and Politics of\nSuicide</em>, Syracuse: Syracuse University Press.</li>\n<li>Tolhurst, W.E., 1983, “Suicide, Self-sacrifice, and\nCoercion”, <em>Southern Journal of Philosophy</em>, 21:\n109–121.</li>\n<li>Tong, R., 2000, “Duty to Die,” in J. Humber and R.\nAlmeder (eds.), <em>Is There a Duty to Die?</em>, Totowa, NJ: Humana\nPress.</li>\n<li>van Zyl, L., 2000, <em>Death and Compassion: A Virtue-based\nApproach to Euthanasia</em>, London: Ashgate.</li>\n<li>Varelius, J., 2013, “Ending Life, Morality, and\nMeaning”, <em>Ethical Theory and Moral Practice</em>, 16:\n559–574.</li>\n<li>Velleman, J.D., 1999, “Is There a Right of\nSelf-Termination?”, <em>Ethics</em>, 109: 606–628.</li>\n<li>White, J., Marsh, I., Kral, M.J., and Morris, J., 2016,\n<em>Critical Suicidology: Transforming Suicide Research and Prevention\nfor the 21st Century</em>, Vancouver: University of British Columbia\nPress.</li>\n<li>Windt, P., 1981, “The Concept of Suicide”, in\n<em>Suicide: The Philosophical Issues</em>, M. Pabst-Battin and D.J.\nMayo (eds.), London: Peter Owen, pp. 42–43.</li>\n</ul>\n<h3><a name=\"FurRea\">C. Further Reading</a></h3>\n<ul class=\"hanging\">\n<li>Alvarez, A., 1982, <em>The Savage God: A Study of Suicide</em>.\nNew York: Bantam.</li>\n<li>Battin, M. and Mayo, D. (eds.), 1980, <em>Suicide: The\nPhilosophical Issues</em>. New York: St. Martin’s.</li>\n<li>Donnelly, J. (ed.), 1998, <em>Suicide: Right or Wrong?</em>\nAmherst, NY: Prometheus.</li>\n<li>Hecht, J.M., 2013, <em>Stay: A History of Suicide and the\nPhilosophies Against It</em>. New Haven: Yale University Press.</li>\n<li>Joiner, T., 2005, <em>Why People Die by Suicide</em>. Cambridge,\nMA: Harvard University Press.</li>\n<li>Maltsberger, J.T., and Goldblatt, M., 1996, <em>Essential Papers\non Suicide</em>, New York: New York University Press.</li>\n<li>Mayo, D., 1986, “The Concept of Rational Suicide”,\n<em>Journal of Medicine and Philosophy</em>, 2: 143–155.</li>\n<li>Nagel, T., 1970, “Death”, <em>Noûs</em>, 4:\n73–80.</li>\n<li>Novak, D., 1976, <em>Suicide and Morality: The Theories of Plato,\nAquinas, and Kant and Their Relevance for Suicidology</em>, Scholars\nStudies Press.</li>\n<li>Shneidman, E.S., 1998, <em>The Suicidal Mind</em>, Oxford: Oxford\nUniversity Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "autonomy: in moral and political philosophy",
            "autonomy: personal",
            "death",
            "double effect, doctrine of",
            "euthanasia: voluntary",
            "libertarianism",
            "mental disorder",
            "paternalism",
            "rights",
            "well-being"
        ],
        "entry_link": [
            {
                "../autonomy-moral/": "autonomy: in moral and political philosophy"
            },
            {
                "../personal-autonomy/": "autonomy: personal"
            },
            {
                "../death/": "death"
            },
            {
                "../double-effect/": "double effect, doctrine of"
            },
            {
                "../euthanasia-voluntary/": "euthanasia: voluntary"
            },
            {
                "../libertarianism/": "libertarianism"
            },
            {
                "../mental-disorder/": "mental disorder"
            },
            {
                "../paternalism/": "paternalism"
            },
            {
                "../rights/": "rights"
            },
            {
                "../well-being/": "well-being"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=suicide\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/suicide/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=suicide&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/suicide/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=suicide": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/suicide/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=suicide&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/suicide/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.suicidology.org/\" target=\"other\">American Association of Suicidology</a>",
            "<a href=\"http://www.afsp.org/\" target=\"other\">American Foundation for Suicide Prevention</a>"
        ],
        "listed_links": [
            {
                "http://www.suicidology.org/": "American Association of Suicidology"
            },
            {
                "http://www.afsp.org/": "American Foundation for Suicide Prevention"
            }
        ]
    }
}