{
    "url": "theories-biological-development",
    "title": "Theories of Biological Development",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Melinda Bonnie Fagan\n<mel.fagan@utah.edu>\nJane Maienschein",
        "author_links": [
            {
                "https://faculty.utah.edu/u0976724-MELINDA_BONNIE_FAGAN/hm/index.hml": "Melinda Bonnie Fagan"
            },
            {
                "mailto:mel%2efagan%40utah%2eedu": "mel.fagan@utah.edu"
            },
            {
                "https://sols.asu.edu/people/jane-maienschein": "Jane Maienschein"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"https://faculty.utah.edu/u0976724-MELINDA_BONNIE_FAGAN/hm/index.hml\" target=\"other\">Melinda Bonnie Fagan</a>\n&lt;<a href=\"mailto:mel%2efagan%40utah%2eedu\"><em>mel<abbr title=\" dot \">.</abbr>fagan<abbr title=\" at \">@</abbr>utah<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://sols.asu.edu/people/jane-maienschein\" target=\"other\">Jane Maienschein</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Jun 3, 2022"
    ],
    "preamble": "\n\nDevelopment is a central biological process, and ideas about its\nnature have been influential in biological thought. This entry surveys\nthe history of these ideas through the lens of “epigenesis vs.\npreformation”. Epigenesis is, roughly, the thesis that every\ndeveloping entity starts from material that is unformed, with form\nemerging gradually, over time, in the process of development.\nPreformation, in contrast, is the thesis that development begins with\nthe entity in some way already preformed, or predelineated, or\npredetermined. The question “epigenesis or preformation?”\nis in part metaphysical: what is it that exists—form or also the\nunformed that becomes the formed? And it is partly epistemological:\nhow do we know—through observation or inference? Debate on these\nentangled questions has persisted since ancient times, and today plays\nout as genetic determinists appeal to the already “formed”\nthrough genetic inheritance, while others insist on the efficacy of\nenvironmental plasticity. This entry surveys the main theories of\ndevelopment that engage this debate, from Aristotle on generation, to\nrecent systems-theoretic and stem cell-based views. Of course,\n“epigenesis vs. preformation” is not the only longstanding\ntheoretical opposition that bears on development. But this framing is\nan inclusive way to capture patterns of transformation and constancy\nin debates about biological development. Nature or nurture, epigenesis\nor preformation, genetic determinism or developmental free will, or is\nsome version of a middle ground possible? The terms of this perennial\ndiscussion, and the underlying assumptions, continue to shape debates\nabout when life begins and have profound bioethical and policy\nimplications.\n",
    "toc": [
        {
            "#CaveAbouTheo": "1. A Caveat About Theories"
        },
        {
            "#Prob": "2. The Problem"
        },
        {
            "#ArisAris": "3. Aristotle and Aristotelianism"
        },
        {
            "#EighCentDeba": "4. Eighteenth-Century Debates"
        },
        {
            "#EvolEmbrNewPref": "5. Evolution and Embryos: A New Preformationism"
        },
        {
            "#LateNineCentDebaWeisHert": "6. Late Nineteenth-Century Debates: Weismann and Hertwig"
        },
        {
            "#LateNineCentDebaRouxDrie": "7. Late Nineteenth-Century Debates: Roux and Driesch"
        },
        {
            "#ReguTheoDeve": "8. Regulative Theories of Development"
        },
        {
            "#OrgaGradFiel": "8.1 Organicism, gradients, and fields"
        },
        {
            "#TuriReacDiffMode": "8.2 Turing’s reaction-diffusion model"
        },
        {
            "#PosiInfo": "8.3 Positional information"
        },
        {
            "#TwenCentGeneNewPred": "9. Twentieth-Century Genetics: A New Predeterminism"
        },
        {
            "#WaddLand": "9.1 Waddington’s landscape"
        },
        {
            "#GeneProg": "9.2 The genetic program"
        },
        {
            "#ReguGeno": "9.3 The regulatory genome"
        },
        {
            "#TwenFirsCentAlteNewEpig": "10. Twenty-First-Century Alternatives: A New Epigenesis?"
        },
        {
            "#DeveSystCycl": "10.1 Developmental systems and cycles"
        },
        {
            "#PhysDynaSyst": "10.2 Physical and dynamic systems"
        },
        {
            "#StemCellLine": "10.3 Stem cells and lineages"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. A Caveat About Theories\n\nA theory of development should explain the core phenomena of\ngrowth, cell differentiation, and morphogenesis, which together\ntransform an egg into a mature organism. However, beyond this rough\nconsensus uncertainty abounds. Exactly what entities undergo\ndevelopment, and what are the process’ temporal, spatial, and\nfunctional boundaries? These questions are debated in biology and\nphilosophy (Bonner 1974; Pradeu et al. 2011). Also unsettled are the\nnature and significance of scientific theories. Whether a general\ntheory of development is possible or desirable hinges in part on how\n“theory” is defined. Yet there is no philosophical\nconsensus to fall back on. Furthermore, developmental biology is not a\ntraditionally theoretical field (in contrast to, say, evolutionary\nbiology; see the entry on\n developmental biology).\n A recent edited collection, Towards a Theory of Development,\nreveals a variety of viewpoints and frameworks, ranging from\nskepticism about any such theory, to specific proposals influenced by\nphysics, mathematics, biochemistry, systems biology, and more (Minelli\n& Pradeu 2014a). Broadly speaking, however,\n\n\nmost developmental biologists have not been strongly interested in\nconstructing an overarching theory of development and…\ndevelopmental biology has not been a focal topic for philosophers of\nbiology. (Burian 2014: xii)\n\n\nThe subject has received little focused attention in biology or\nphilosophy.\n\nThe term “theory”, for the purpose of this entry, refers\nto broad conceptual frameworks about the nature of the developmental\nprocess as a whole. This is more inclusive and less demanding than\ntraditional philosophical notions of theory; “big picture”\nviews offering an overall characterization of and/or basic principles\nfor understanding development. Epigenesis and preformation are\nalternative theories in this sense: two persistent ways of describing\nand seeking to explain the development of individual organic form.\n2. The Problem\n\nThe core question underlying the existence of these two competing\nphilosophical traditions is the extent to which something is formed or\norganized from “the beginning” or whether organization and\nform arise only over time. Nineteenth-century uses of the term\n“evolution” included a sense of unfolding of preexisting\nform, a sort of preformationism in contrast to the epigenesis of the\nday. Discussions of “evolution” and\n“epigenesis” can therefore be misleading in retrospect\nsince the former term has assumed a meaning closer to the older\nmeaning of epigenesis (Bowler 1975). Making things even more\ncomplicated, by the late nineteenth century\n“preformationism” really was more about various versions\nof predetermination or predelineation than preexistence of form as\nsuch. Furthermore some authors saw epigenesis or preformation as\nentirely internally directed, while others in each case allowed\nresponses to the environment. In the background lie debates about the\nrelative significance of predestination and free will, for persons,\nfor organic beings, or even for the inorganic. In each case, it is\nimportant to keep in mind what the particular writer was saying and\nthe arguments presented. Thus, discussions of epigenesis and\npreformation often bring in other ancillary questions and are\ndifficult to separate from their contexts. This entry is an effort to\nextract what is centrally at issue and to focus on key contributions\nto the discussion.\n\nThe terms of debate can in principle apply to the inorganic world;\ne.g., solar systems can “evolve” and could develop\nepigenetically. Yet they are not thought of as doing so, typically,\nand so epigenesis and preformation are primarily applied to the\norganic world. Species can evolve or develop more or less gradually,\nwith more or less form already physically existing or programmed in\nfrom the beginning. Yet typically discussions of epigenesis and\npreformation have focused on individual organisms and their\ndevelopment rather than on species. The emphasis is on different\ninterpretations of the actual developmental process as it plays out in\ntime, in individual organisms. Therefore, this entry focuses on\nindividual organisms and understandings of their development\nprocesses. Even more specifically, this means looking at the\ndevelopment of their form and to a lesser extent also function.\nEpigenesis and preformation offer two competing interpretations of\nwhat is involved, with a range of alternatives in between. The two\napproaches draw on different metaphysical and different\nepistemological sets of assumptions. We can get at the central issues\nby looking most closely at a series of focused episodes.\n3. Aristotle and Aristotelianism\n\nAristotle was a keen observer of many things, including embryos.\nLooking at chicks, for example, and drawing on his interpretations\ndeveloped earlier for the physical sciences, he saw material, final,\nformal, and efficient causes at work in the generation of individual\norganisms. The early egg was not formed; it did not already contain a\nlittle chick (or whatever the species). Instead, an individual animal\nonly gradually acquired a heart that began beating; likewise for the\nother parts that make it a chick. The material may be there from the\nbeginning, but the formal cause only gradually plays out along with\nthe efficient cause of embryonic development.\n\nThus, Aristotle could fit his observations of embryos into his larger\ntheoretical interpretations of the world. In sexual generation,\nindividual organisms begin when the fluids from the mother and the\nfather come together. This combines the essential causes and initiates\nthe developmental process. The maternal contribution is the material\ncause, which resides in the menstrual blood. After “the\ndischarge is over and most of it has passed off, then what remains\nbegins to take shape as a fetus” (Aristotle De Generatione\nAnimalium [GA], 1.727b17–18). Yet the menstrual blood, or female\nsemen, is only that out of which it generates and must be acted upon\nby the male semen which is that which generates. Together, consistent\nwith the essential nature of the species and telos (or final\ncause) in question, the formal cause and efficient causal process act\nto bring a formed individual organism from potential into actual\nbeing. Gradually, over time, an individual organism’s form\nbegins to emerge from the unformed. The male and female parents serve\nas the “principles of generation” for each individual\norganism (in sexually-generating species).\n\nFor Aristotle, an individual life begins when the male and female\nsemen are brought together. This is an external action, which starts\nthe individual formative process. From that point on, the process is\ninternal, initially driven by causes internal to the combined fluids.\nThe process then leads to formation of the individual’s type,\nsince “once a thing has been formed, it must of necessity\ngrow” (Aristotle GA 1.735a18–19). (See Lennox 2001 for\ndiscussion of Aristotle’s predecessors on these points; see Van\nSpeybroeck et al. 2002; Vinci & Robert 2005; Connell 2016, 2020;\nFalcon & Lefebvre 2017; Henry 2017; Hopwood et al. 2018; on\nAristotle’s theory of generation and subsequent scientific\ndevelopment of these ideas.)\n\nAn individual organic life requires an internal source of motion, or\n“soul”, which resides in the material body from the\noutset. This soul guides the gradual epigenetic process of\ndevelopment. This is the Aristotelian and not the Christian soul. Soul\nconsists of the vegetative (for all organisms), locomotory (for\nanimals), and rational (for humans). The soul, consisting of one to\nthree parts depending on the kind of living being, resides in the\ncombination of male and female semen. The living differs from the dead\nbecause of the action of the soul. Therefore, it is the teleological\ndrive of the potential that actualizes the individual and its form and\nfunction, epigenetically, gradually, and internally.\n\nAristotelians followed Aristotle and without much further study of\nembryos interpreted the process of generation, including human\ndevelopment, as gradual and epigenetic. Traditional Catholicism\nagreed. St. Augustine and St. Thomas Aquinas both held that\nhominization, or the coming into being of the human, occurs only\ngradually. Quickening was thought to occur around 40 days, and to be\nthe point at which the merely animal mix of material fluids was\nensouled. Until 1859, when Pope Pius IX decreed that life begins at\n“conception”, the Church was epigenetic along with the\nAristotelians (see Maienschein 2003).\n4. Eighteenth-Century Debates\n\nShirley Roe’s discussion of the eighteenth-century debates is an\nexcellent examination of the context. Enthusiasm for scientific study\nof natural phenomena of all sorts was combined with particular\ninterest in natural history and changes over time and with newly\navailable microscopic methods to stimulate interest in development\n(Roe 1981). Aristotelian epigenesis still provided the background\nassumptions about individual development as the eighteenth century\nbegan, and researchers sought to observe the gradual emergence of form\nfrom non-form. Yet Aristotelian accounts called for the efficacy of\nthe causes, acting through the process of ensoulment. In effect, this\ninterpretation of epigenesis depended on a life force within the\norganism driving its emergence of form. Those who accepted epigenesis\nalso accepted a form of vitalism (see Detlefsen 2006, Zammito 2018 for\nmore on early modern vitalism debates).\n\nMatter in motion, by itself, would not seem to have the capacity to\nproduce these results. How could unformed matter become formed? How\ncould the emerging form acquire capacity to function without some\nvital force or factor that was not strictly material? This was the\nproblem for materialists. Those who began with a materialist\nmetaphysics, assuming that all that can exist is matter in motion,\ncould not see how gradual epigenetic emergence of form could occur.\nThe early modern period brought debates between those who started from\nmetaphysical assumptions of materialism and those who started from\nepistemological assumptions that empirical observation should provide\nthe basis for scientific knowledge.\n\nOne popular representation of the alternative, preformationist view\nwas the homunculus. Whether initially intended seriously or as a way\nto capture alternative ideas, the idea of a tiny preformed little\nperson did capture attention. Nicolaas von Hartsoeker gave us the\nimage in 1694 of a tiny man in the sperm, which became the starting\npoint for spermists. Others, ovists, accepted the idea of a preformed\norganism—but in the egg rather than sperm. Both views are\npreformationism taken quite literally. The form that the individual\nadult organism would assume was, physically and materially, preformed\nfrom the earliest stages of development. The subsequent process was\njust growth.\n\nNot all preformationists took their preformationism quite so literally\nor graphically. But that view did present a competing alternative to\nAristotelian epigenesis by the eighteenth century (see Bowler 1971,\nPinto-Correia 1997). As Iris Fry has argued in her study of origins of\nlife debates, only with preformation could a materialistic mechanist\nbe a good Christian in the eighteenth century (Fry 2000: 26, citing\nFarley 1977: 29). This debate played out, for example, in the work of\nCaspar Friedrich Wolff and Charles Bonnet, both looking at chick\ndevelopment (Detlefsen 2006). They looked at the same thing and even\nfundamentally agreed about what they saw, but their conclusions were\nquite different. This story can be seen as a debate about scientific\ntheory. Wolff was an epigenesist, maintaining that form emerges only\ngradually. Bonnet was a preformationist, insisting that form exists\nfrom the beginning of each individual organism and only experiences\ngrowth over time. In addition to these theoretical and epistemological\nissues, there is also a story about metaphysics. The eighteenth\ncentury brought debates between metaphysical materialists who were\nforced into preformationism, and epistemological epigenesists who\nobserved form emerging only gradually and who were willing to accept\nvitalism as the only apparent causal explanation for the emergence of\nform from the not-formed (Roe 1981; Maienschein 2000; Nicoglou &\nWolfe 2018 [and references therein]; Wolfe 2021).\n5. Evolution and Embryos: A New Preformationism\n\nIn 1859, Darwin focused on embryos and their usefulness for\nunderstanding evolutionary relationships. Ernst Haeckel brought the\nstudy of embryos to popular attention. And histologists and\nembryologists, especially in Germany and the United States, used\nrapidly improving microscopic techniques to observe far more than had\nbeen possible before. These observations, in the context of\nevolutionary interpretations, raised new questions and provoked new\nanswers. The understanding of both epigenesis and preformation\nunderwent transformation so that the debates brought new questions\nalong with the traditional differences.\n\nDarwin pointed to embryology as fundamental for interpreting\nhistorical relationships. In Chapter 13 of the Origin he\nasked\n\n\nHow, then, can we explain these several facts in\nembryology,—namely the very general, but not universal\ndifference in structure between the embryo and the adult;—of\nparts in the same individual embryo, which ultimately become very\nunlike and serve for diverse purposes, being at this early period of\ngrowth alike;—of embryos of different species within the same\nclass, generally, but not universally, resembling each other;—of\nthe structure of the embryo not being closely related to its\nconditions of existence, except when the embryo becomes at any period\nof life active and has to provide for itself;—of the embryo\napparently having sometimes a higher organisation than the mature\nanimal, into which it is developed. (1859: 442–443)\n\n\nBut we know that this was a rhetorical question, and sure enough he\nconcluded that\n\n\nI believe that all these facts can be explained, as follows, on the\nview of descent with modification. (1859: 443)\n\n\nAnd that furthermore,\n\n\nthe leading facts in embryology, which are second in importance to\nnone in natural history, are explained on the principle of slight\nmodifications not appearing, in the many descendants from some one\nancient progenitor, at a very early period in the life of each, though\nperhaps caused at the earliest, and being inherited at a corresponding\nnot early period. Embryology rises greatly in interest, when we thus\nlook at the embryo as a picture, more or less obscured, of the common\nparent-form of each great class of animals. (Darwin 1859: 450)\n\n\nHaeckel saw ontogeny as the brief and rapid recapitulation of\nphylogeny and saw each individual’s development as following the\nsequence of, and indeed caused by, the evolutionary history of that\nindividual organism’s species. In his highly popular books,\nwidely translated and widely read, Haeckel offered pictures of\ncomparative embryology. See, he seemed to suggest, the human form\nemerges following the evolutionary development and adaptations of its\nancestors. Form comes from form of the ancestors, and it unfolds\nfollowing pre-scripted stages (Haeckel 1866).\n\nDarwin was not an embryologist, and he did not contribute to our\nunderstanding of embryogenesis as such. Nor did Haeckel, really. But\nwhile Darwin’s use of the embryo in supporting evolutionary\ntheory and in helping to interpret evolutionary relationships was\nconsistent with various versions of either epigenetic or\npreformationist development, Haeckel’s view was decidedly\npreformationist. Here, then, was a preformationist interpretation\nbased not on additional embryological observations but on adherence to\nHaeckel’s own metaphysical view—monistic\nmaterialism—and to his desire to provide evidence for evolution.\nThe Haeckelian approach reflected the context in which those studying\ncells and embryos worked at the end of the nineteenth century.\n6. Late Nineteenth-Century Debates: Weismann and Hertwig\n\nIn 1899, American biologist William Morton Wheeler suggested that\nthere are just two different kinds of thinkers. Some see change and\nprocess, while others see stability. Heraclitus, Aristotle,\nphysiology, and epigenesis characterize one way of looking at the\nworld, while Parmenides, Plato, morphology, and preformationism\ncharacterizes another. These are, Wheeler felt, stable and persistent\nclasses, with just the nature and details of their differences\nchanging over time. Yet by the end of the nineteenth century, he\nargued, neither a strict preformationist nor a strict epigeneticist\nshould prevail. Rather he called for a middle ground, for:\n\n\nThe pronounced “epigenecist” of to-day who postulates\nlittle or no pre-determination in the germ must gird himself to\nperform Herculean labors in explaining how the complex heterogeneity\nof the adult organism can arise from chemical enzymes, while the\npronounced “preformationist” of to-day is bound to\nelucidate the elaborate morphological structure which he insists must\nbe present in the germ.\n\n\nFurthermore, it is not to philosophy but to science that we must look\nto resolve the relative contributions of each, for “Both\ntendencies will find their correctives in investigation”\n(Wheeler 1899: 284).\n\nWheeler was stimulated by recent late nineteenth-century debates,\nthemselves provoked by a flood of new discoveries. August Weismann and\nOscar Hertwig provided particularly strong and contrasting positions.\nWeismann had begun from an epigenetic viewpoint and initially rejected\nthe idea that individual form emerges through the unfolding, or\nevolution, of pre-existent form in the inherited germ. But by the time\nhis Das Keimplasm appeared in 1892 (translated into English\nin 1893), Weismann had changed his mind. As Weismann wrote:\n\n\nMy doubts as to the validity of Darwin’s theory were for a long\ntime not confined to this point alone: the assumption of the existence\nof preformed constituents of all parts of the body seemed to me far\ntoo easy a solution of the difficult, besides entailing an\nimpossibility in the shape of an absolutely inconceivable aggregation\nof primary constituents. I therefore endeavoured to see if it were not\npossible to imagine that the germ-plasm, though of complex structure,\nwas not composed of such an immense number of particles, and that its\nfurther complication arose subsequently in the course of development.\nIn other words, what I sought was a substance from which the whole\norganism might arise by epigenesis, and not by evolution. After\nrepeated attempts in which I more than once imagined myself\nsuccessful, but all of which broke down when further tested by facts.\nI finally became convinced that an epigenetic development is an\nimpossibility. Moreover, I found an actual proof of the reality of\nevolution, which … is so simple that I can scarcely understand\nhow it was possible that it should have escaped my notice so long.\n(Weismann 1892 [1893: xiii–xiv])\n\n\nHis “proof” provided an account of how, within the context\nof cell theory and given that the entire body begins in one fertilized\ncell, all the diverse body parts can become so diversely\ndifferentiated. The key is in the special material of the germ cells,\nWeismann decided. Within these cells lies all the determinants\nnecessary to direct development. Inheritance, that is, causes\ndevelopment and differentiation.\n\nWeismann’s theory postulated the existence of several levels of\nhypothetical units. By the 1890s, it was agreed that individuals begin\nas cells, those cells contain nuclei, and that nuclei contain\nchromosomes. The chromosomes are the material of heredity, Weismann\npostulated, and they consist of a string of determinants, correlated\nwith characters in the organism. Each determinant consisted of a\nnumber of material particles called biophores, inherited from both\nparents. These biophores compete with each other and some prevail,\nwhich then determines the character of the determinant, which in turn\ndetermines the character of the organism. During each cell division,\nthe original whole chromosomal material is divided up, so that the\neffect is like a mosaic. Each cell becomes the right type just because\nof the action of the determinants distributed to it. As Weismann put\nit,\n\n\nOntogeny, or the development of the individual, depends therefore on a\nseries of gradual qualitative changes in the nuclear substance of the\negg-cell.\n\n\nCells are self-differentiating\n\n\nthat is to say, the fate of the cells is determined by forces situated\nwithin them, and not by external influences. (Weismann 1892 [1893: 32,\n134])\n\n\nConditions external to the cell itself cannot guide development, but\nrather the causes lie within. And cell differentiations that make up\ncomplex organisms are predetermined. Frederick Churchill’s\nmagnificent biography of Weismann discusses these ideas in depth\n(Churchill 2015).\n\nOscar Hertwig disagreed. He felt that Weismann made too many\nassumptions and actually provided no real explanation of development\nand differentiation at all. In his work of 1894, Präformation\noder Epigenese, Hertwig complained that Weismann’s\ntheory:\n\n\nmerely transfers to an invisible region the solution of a problem that\nwe are trying to solve, at least partially, by investigation of\nvisible characters; and in the invisible region it is impossible to\napply the methods of science. So, by its very nature, it is barren to\ninvestigation, as there is no means by which investigation may be put\nto the proof. In this respect it is like its predecessor, the theory\nof preformation of the eighteenth century. (Hertwig 1894 [1900:\n140])\n\n\nIn contrast to Weismann’s preformationism, Hertwig pointed to\nthe interactions of cells and to the differences among cells for the\nsource of differentiation. Complexity is not built in from the\nbeginning, but emerges over time, dynamically, and interactively. A\ncytologist himself, Hertwig saw the intricate structures already part\nof the unfertilized egg, and the changes that occur with\nfertilization. The egg is not a completely unstructured blob, but\nrather a complex of different materials that can respond to influences\nboth within the egg and from the external environment. Cells behave\nlike small organisms, and it is the interactions of these separate\norganisms that makes the whole. As Hertwig put it:\n\n\nI shall explain the gradual, progressive organization of the whole\norganism as due to the influences upon each other of these numerous\nelementary organisms in each stage of the development. I cannot regard\nthe development of any creature as a mosaic work. I hold that all the\nparts develop in connection with each other, the development of each\npart always being dependent upon the development of the whole.\n\n\nFurthermore,\n\n\nduring the course of development, there are forces external to the\ncells that bid them assume the individual characters appropriate to\ntheir individual relations to the whole; the determining forces are\nnot within the cells, as the doctrine of determinants supposed.\n(Hertwig 1894 [1900: 105–106, 138])\n\n\nHertwig and Weismann continued to argue, as did others, both about the\nmetaphysical nature of the organism as well as about the\nepistemological demands for gaining knowledge about it, with no\ngenerally accepted way to resolve the issues. Given the information at\nhand, it seemed that Wheeler was right. There were just two different\ntypes of people, drawing on two different sets of values and emphases.\nBoth relied on assumptions, and only new evidence could move the\ndiscussion forward.\n7. Late Nineteenth-Century Debates: Roux and Driesch\n\nWilhelm Roux adopted much the same approach as Weismann’s and\nso, at first, did Hans Driesch. Yet their experiments ultimately led\nto new approaches and revised interpretations of what was at issue\nwith epigenesist and preformationist accounts of development\n(Maienschein 1991b and Weber 2022). In 1888, Roux published results of\nhis experiments on frog eggs. Working on the assumption of a mosaic\ntype preformationism, Roux was persuaded that starting from the very\nfirst cell division, each cell would be different because it was\nalready predetermined to be different.\n\nRoux proposed an experiment, a simple and elegant experiment on the\nface of it. He proposed to take a developing frog egg, after the first\ncell division, and to separate the two cells. Finding it impossible to\nseparate the two cells, however, he simply killed one by inserting a\nhot needle. That cell just hung there like a blob of material and no\nlonger differentiated. The other half organism, or single cell\nproceeded to develop, in Roux’s interpretation, as it normally\nwould have developed (Roux 1888). The half became a half, just as it\nshould if it were already preformed or predetermined as to its fate in\nthe organism. Roux had, it seemed, confirmed the mosaic\nhypothesis.\n\nA few years later, Driesch was working at Naples and had access to sea\nurchin eggs. Fortunately, because of Oscar and his brother Richard\nHertwig’s study of these eggs, Driesch knew that if he shook the\ntwo cells they would separate completely. Driesch reported agreeing\nwith Roux and intending to confirm Roux’s results. But since the\nsea urchin eggs could actually be separated, he felt that his results\nwould be even more convincing. Imagine his surprise when he looked the\nnext morning after separating the eggs and found not two half embryos\nbut two smaller sized urchin larvae. As he noted,\n\n\nI must confess that the idea of a free-swimming hemisphere or a half\ngastrula open lengthwise seemed rather extraordinary. I thought the\nformations would probably die.\n\n\nNot so.\n\n\nInstead, the next morning I found in their respective dishes typical,\nactively swimming blastulae of half size. (Driesch 1892 [1964:\n46])\n\n\nIn later experiments they developed even further, into apparently\nperfectly normal pluteus larvae, and even the four cell stage could do\nthe same.\n\nDriesch concluded with an epigenetic account, but an epigenesis\nrelying strictly on materialistic factors (at least that was his\ninitial response; Driesch did turn later to a version of vitalism).\nThe early embryo retains its totipotency, he concluded. The fertilized\negg clearly has the capacity to become a whole organism and so,\napparently, do the cells after the early cell divisions. Not a mosaic\nof cells already predetermined by their inherited determinants in the\nnucleus, the early embryonic stages are instead a population of\nseparate totipotent organisms, each capable of becoming a whole. It is\nonly the interactions among them under normal conditions that lead to\na complex, organized, integrated differentiated organism.\n\nIt might seem that Roux would have had to acknowledge the superiority\nof Driesch’s approach, since Driesch had actually separated the\ncells. But no. Instead Roux countered with an additional hypothesis.\nThe nucleus retains the capacity to adapt, especially in simpler\norganisms. They need the capacity to regenerate when injured, and\ntherefore the mosaic determination simply has not occurred yet. Each\ncell retains a “reserve idioplasm”, he argued, and this\nprovides the necessary backup determination needed to form a whole\norganism (see Churchill 1966, 1973).\n\nIt seems that Wheeler was right. Roux, Weismann, and others had\ndecided that development must be guided by predetermined mosaic\ndifferences. Preformation, stability, and predictability stood on one\nside, with epigenesis, dynamic process, and change on the other. And,\nas Wheeler noted, by 1899 the way forward lay between the extremes of\nstrict preformation or epigenesis. Wheeler’s dissertation\ndirector Charles Otis Whitman agreed. Whitman felt that what biology\nneeded was a clear statement of the alternative views, and then\nmovement to a new standpoint examining how much depends on the\norganism’s developmental response to external conditions drawing\non preformation, rather than on programmed internal unfolding\nalone.\n\nWhitman, Edmund Beecher Wilson, and others at the Marine Biological\nLaboratory in Woods Hole, Massachusetts, dedicated considerable energy\nto discovering the nature of each cell and its internal organization\nand relationships, in an attempt to discover the relative\ncontributions of preformation and epigenetic development to a\nmaterialistic explanation of development. By the early twentieth\ncentury, they had moved toward an understanding that included a\nfertilized egg that was to some extent preorganized and\ndifferentiated, including in the nuclear chromosomes, and also a\ncapacity of the individual organism to respond to changes in its\nenvironment or to self-regulate. This was epigenesis allowing some\nminimal predeterminism.\n8. Regulative Theories of Development\n\nThis “epigenesis-first” view of development set the stage\nfor a strand of theorizing that continued well into the twentieth\ncentury. The main theoretical tension in twentieth- and\ntwenty-first-century studies of development is not between classic\npreformation and epigenesis, but between different views about control\nof developmental processes. If genes are the primary source of\ncontrol, then organismal development is preformationist in an\nimportant sense: it is genetically determined. But if control is more\ndistributed or holistic, such that developing organisms are (in some\nsense) self-organizing, then the process is regulated in a way\nrecalling classic theories of epigenesis. Several influential theories\nof morphogenesis and pattern formation take the latter view.\nGene-based accounts of development take the former. In this way, the\nclassic theoretical opposition between preformation and epigenesis is\ntransformed and carried forward into the twentieth and twenty-first\ncenturies. In the first half of the twentieth century, theoretical\nconcepts associated with epigenesis played a significant role in\nstudies of development. This section surveys the main theoretical\nefforts along these lines.\n8.1 Organicism, gradients, and fields\n\nDriesch’s experiments (see\n Section 7)\n demonstrated regulative development: the developing embryo\ncompensated for experimental intervention rather than following a\npre-determined plan. To account for this phenomenon without resorting\nto vitalism, a new theoretical approach was needed. One such was\norganicism, which Donna Haraway (1976) casts as a new Kuhnian paradigm\nfor embryology in the first half of the twentieth century. Its tenets\nincluded:\n\nthe organism is a unified whole, with multiple connections between\nlevels of complexity/organization;\ndevelopment is a goal-directed process, regulated throughout\nrather than pre-determined; and\norganismal shape and structure should be understood in terms of\nprinciples for achieving form.\n\n\nLenoir (1982) traces these ideas to Kant’s Critique of\nJudgment, notably reciprocal determination of parts and the whole\norganism during the process of development. A more explicit influence\nwas von Bertalanffy’s systems theory of development (1928 [1933,\ntrans. Woodger]; see the entries on\n levels of organization in biology and\n systems and synthetic biology). Another influence was D’Arcy\nThompson’s seminal On Growth and Form (1917; see the entry on\n developmental biology).\n A key idea was that organismal form emerges from a self-organizing\nsystem, not the unfolding of a pre-existing program.\n\nHaraway (1976) identifies four main elements of organicism:\n\nthe goal of explaining organismal form;\nconcepts of symmetry, polarity, and pattern;\nfield-particle duality (analogous to physics); and\nlinks to structuralism in philosophy (i.e., a structure as a\nself-regulating, complex system involving multiple interacting levels\nof organization and spatio-temporal scales).\n\n\nShe examines these elements in the work of the paradigm’s\nprincipal architects in twentieth-century developmental biology: Ross\nHarrison, Joseph Needham, and Paul Weiss. Organicists sought\nmathematical yet autonomously biological laws to account for emergent\norder in developmental processes. Although such laws did not\nmaterialize, Haraway argues that metaphors (principally those of\ncrystals and fields) played significant theoretical roles in their\nstead. More abstract theoretical concepts—of polarity,\ngradients, and fields—were also used to explain organismal form\nin the first half of the twentieth century. For example, Hans Spemann\n(1936 [1938]) proposed that\n\n\nthe body of many, if not all animals, at least in the embryonic state,\npossesses one or several axes with unequal poles along which there\nexists a gradient of some sort. The course of development depends upon\nthese gradients to a high degree. (1936 [1938: 318]).\n\n\nSimilarly, Charles Manning Child hypothesized that organismal\ndevelopment is based on “activity gradients” grounded in\nmetabolism. Others objected that these concepts are unclear,\nmetaphysically murky, and unscientifically vitalist (see Gilbert,\nOpitz, & Raff 1996).\n\nAn important spur to gradient and field theories was the phenomenon of\n“the organizer”, demonstrated by Hilde Mangold’s\nexperiments transplanting newt tissue. She moved a small piece from\nthe dorsal lip of a developing Triton cristatus embryo into\nthe early gastrula of another newt species (Triton\ntaeniatus). Donor tissue thus came in contact with\nundifferentiated ectoderm of another species. The result: two\nconjoined embryos with different body axes. This indicated that dorsal\nlip tissue somehow “organized” host cells and tissues into\nanother embryonic body. Spemann designated the dorsal lip of the\nembryo “the organization-center” or\n“organizer”. But how did this work? The proposed answer\nsuggested that body axes result from a gradient of some chemical\nsubstance emanating from cells of the organizer. This was the\nstarting-point for “field theories”; e.g.,\n\n\n…the egg and early embryo consist of fields—gradients or\ndifferentiation centers in which the specific properties drop off in\nintensity as the distance from the field center increases….\n(Harrison 1969: 258)\n\n\nIn discussions with other members of Cambridge’s Theoretical\nBiology Club, Joseph Needham sought a theory of the chemical nature of\nthe “organizer”. Building on D’Arcy Thompson’s\ntheories of biological form and insights from biochemistry, he\nconceptualized fields as spatial regions of a developing embryo, which\ndetermine for all points within a region a specific quality,\ndirection, and intensity. The field as a whole exhibits (in)stability\nand equilibrium positions. Organismal development is thus defined\nas\n\n\na progressive restriction of potencies by determination of the parts\nto pursue fixed fates…this state of affairs can best be\npictured in the manner of a series of equilibrium states. (Needham\n1936: 58)\n\n\nThe overall process is to be explained by probabilistic “field\nlaws” describing a sequence of equilibrium positions for a\nfield, extending from proteins and fibers to cell shape and organismal\nmorphology. Although Needham did not flesh out his theoretical ideas\nin detail, they show clear parallels with Waddington’s view of\ndevelopment, as well as recent systems approaches (see\n Section 9.1\n and\n section 10.2).\n\nWorking in the US, Paul Weiss also elaborated field and gradient\nconcepts to sketch a theory of development that anticipated key ideas\nof systems biology today (see the entry on\n systems and synthetic biology).\n His mature theory (“molecular ecology”) posited an array\nof molecular species in a cell, distributed, arranged, grouped in ways\ndetermined by their sterically-mediated interactions and physical\nenvironment (1968). Steric interactions are based on molecules’\nshape and charge; biochemical features such as bonding and repulsion.\nWeiss theorized that these molecular interactions are organized by\nhigher-level fields so as to produce patterns of cell differentiation,\ngrowth, and morphogenesis according to the principle of “gradual\ndetermination”. There is no pre-existing “seat” of\nembryonic organization in the egg or early embryo—instead,\norganization emerges in the process itself, through a physiological\ngradient. Weiss’s theory was based on extensive research on limb\nregeneration, neural development, grafting, and cell culture. A\nregenerated amphibian limb, for example, shows the correct orientation\nand organization of parts, even if derived from different cell types\nin another body part. How do the new parts acquire a “sense of\ndirection” yielding correct morphological organization?\nWeiss’s answer is that some physiological gradient in the body,\ntells the cells “where they are and what to do”.\n\nWeiss theorized this idea in terms of fields:\n\n\nfactors which cause the originally indefinite course of the individual\nparts of a germ to become definite and specific, and, furthermore,\ncause this to occur in compliance with a typical pattern. (1939:\n290)\n\n\nA field is organized from center to periphery, with a focal point of\nmaximal intensity and gradual decrease from this center. This\norganization entails a “physiological gradient”: a robust\ndistribution of (molecular) properties, which vary along the three\nspatial dimensions and along one or more axes (polarity). Its causal\nactivity is holistic, determining cell behavior, which in turn\nproduces growth, differentiation, and morphogenesis. Haraway (1976),\nKeller (2002), and Vecchi and Hernández (2014) examine the\ncomplex and uneven history of gradient and field concepts in\ndevelopmental biology. Haraway, as discussed above, is concerned\nprimarily with these concepts as metaphors structuring the organicist\nparadigm via the work of Harrison, Needham, and Weiss. Evelyn Fox\nKeller considers these concepts as part of the (so far largely\nunsuccessful) tradition of mathematicizing biology to understand\ndevelopment. Davide Vecchi and Isaac Hernández elaborate on\nKeller’s view, arguing that the concept of “morphogenetic\nfield” was supplanted by Wolpert’s concept of\n“positional information”, part of the\nmid-twentieth-century theoretical shift from organicist ideas to\ngenetic control of development (see\n Section 8.3).\n8.2 Turing’s reaction-diffusion model\n\nEschewing genetics, Turing’s theory of morphogenesis (1952)\nsought to explain how patterns first emerge in an early embryo. His\nanswer was a simple model consisting of two reaction-diffusion\nequations, representing chemical “morphogens” X\nand Y diffusing through a tissue\nat rates determined by constants \\(D_x\\) and \\(D_y,\\) coupled to\nchemical reactions with effects represented by functions f\nand g: \n\n\\[\\begin{align} X_t &= f(X,Y) + D_x\\nabla^2X \\\\ Y_t &= g(X,Y) + D_y\\nabla^2Y \\end{align}\\]\n\n\n(These equations follow Keller’s 2002 presentation, which is\nmore streamlined than Turing’s original.) One morphogen is an\nactivator, the other an inhibitor. Both are made and destroyed at\nconstant rates. Initially, the tissue is homogeneous, lacking any\nspatial organization. Crucially, for stable patterns to emerge\nX and Y must diffuse at different rates, the\ninhibitor having the larger diffusion coefficient. Under these\nparameter values, random fluctuations in the system lead to\ninstability resulting in pattern-formation. That is, from an initially\nstable, homogeneous system of cells/tissue, interaction between two\ndiffusing chemicals (morphogens) leads to emergence of a stable\nchemical pattern. Turing assumes that steady-state chemical patterns\ndetermine patterns at the cell/tissue level (through mechanisms wholly\nunspecified). Given that assumption, the model accounts for pattern\nformation in a group of cells or a tissue.\n\nTuring’s model of morphogenesis has several striking features.\nFirst, it is based on physics and chemistry rather than biology:\nreaction-diffusion equations incorporating Fourier series and the law\nof mass action. Reaction-diffusion equations are a class of non-linear\npartial differential equations. (Hodgkin and Huxley’s model of\nneural propagation is also of this class—at the time, one of the\nfew applications of these equations to biology; see the entry on\n mechanisms in science.)\n Turing’s use of these equations to model the transition from\nhomogeneity to spatial patterning is rather counterintuitive, as\ndiffusion is a characteristically homogenizing process. So his model\nwas a theoretical advance, extending the insight that\nreaction-diffusion equations can model transitions and “waves of\nadvance” (e.g., in neurons) to morphogenesis (Berestycki 2013).\nSecond, the model is strikingly abstract—“…a\nsimplification and an idealization, and consequently a\nfalsification” (Turing 1952: 37). Yet it has many biological\napplications. Turing (1952) explored mainly simple cases of chemical\ndiffusion through a tissue of fixed size. But he also applied the\nmodel to chemical waves on spheres to represent gastrulation. That\nmore complex case, with three interacting morphogens, can produce\ntraveling waves and out-of-phase oscillations. Turing also applied his\nmodel to plant development, specifically phyllotaxis (arrangement of\nleaves on a stem; see S. B. Cooper & van Leeuwen 2013). Subsequent\ngeneralizations of Turing’s equations have been used to model a\nwide variety of developmental phenomena, including fish pigmentation\npatterns, human mesenchymal cell differentiation, butterfly wing\npatterns, mouse hair follicles/coat color patterns, limb and tooth\ndevelopment, and bacterial colony growth dynamics (Meinhardt 1982,\nMurray 1989). However, its explanatory role is controversial,\nprimarily because it is hard to show that Turing’s model\ndescribes how development actually proceeds in real organisms.\n\nKeller (2002) discusses this issue, as well as major features of\nTuring’s model. One key problem (noted by Waddington at the\ntime) is that “pure homogeneity” as a starting point for\ndevelopment is unrealistic; the egg or early embryo is never a\n“blank slate” as Turing assumed. She argues that\nTuring’s was a premature attempt at mathematical biology, noting\nas well the challenge it posed to prevalent ideas about causality:\norganismal form as emergent, self-organizing; holistic, arising from\nthe system rather than driven by genes. Vecchi and Hernández\n(2014) build on Keller’s view, diagnosing “a clash of\ncausal ideologies” in the different possible interpretations of\ninitiating cause in Turing’s model. They are more optimistic\nabout its biological relevance and influence. Scientists continue to\napply and reflect on Turing’s model of morphogenesis (e.g.,\nKondo & Miura 2010). As the latter scholars note, Francis\nCrick’s source-sink model of embryonic development (1970) can be\nconsidered the simplest form of a reaction-diffusion model, with the\nreaction term removed. However, Crick’s model is mechanistically\nsimpler, with morphogenesis controlled by a single morphogen diffusing\nalong a line of cells:\n\n\nAt one end of a line of cells one postulates a source—a cell\nthat produces a chemical (which I shall call a morphogen) and\nmaintains it at a constant level. At the other end the extreme cell\nacts as a sink: that is, it destroys the molecule, holding the\nconcentration at that point to a fixed low level. The morphogen can\ndiffuse from one cell to another along a line of cells. (Crick 1970:\n420)\n\n\nUnlike Turing’s more holistic model, in which patterns emerge\nfrom initial random instability due to interaction of multiple\nmorphogens, Crick’s model grounds morphogenesis in simple\nchemical diffusion. Agutter, Malone, and Wheatley (2000) and Vecchi\nand Hernández (2014) argue that Crick’s model lacks\nexplanatory power. However, Minelli (2009) suggests an updated\nsource-sink model, informed by advances in molecular and cell\nbiology.\n8.3 Positional information\n\nMore influential for mainstream developmental biology was the concept\nof positional information. Though originally a contribution to\nregulative theories of development, the concept soon transformed to\nsupport theories of genetic control. This epitomizes the shift in\nbiological thought that followed breakthroughs on DNA structure,\nprotein coding, and other phenomena of molecular genetics (see the entry on\n molecular genetics).\n Lewis Wolpert (1969) introduced the concept of positional information\nto solve (like Turing)\n\n\nthe problem of assigning specific states to an ensemble of identical\ncells, whose initial states are relatively similar, such that the\nresulting ensemble of states forms a well-defined spatial pattern.\n(1969: 4)\n\n\nWolpert’s answer was that each cell in a developing system has a\nunique value reflecting its position in that system, encoded by the\nspatial gradient of a diffusible molecule across the system.\nSpecification of a cell’s position in the system is relative to\none or more points in the system: the source(s) of the diffusible\nmolecule or cell property. Cells that share the same set of points\nrelative to which their position is specified make up a field. Wolpert\nused this model to explain a range of experimental results and\nobservations of development in various species (as well as the toy\n“French flag” example). In 1969, Wolpert saw the next task\nas discovering and articulating rules (and underlying mechanisms) for\nspecification of positional information and polarity, the nature of\npoints and boundaries, and “new meaning to classical concepts\nsuch as induction, dominance and field” (1969: 1).\n\nWolpert’s theoretical approach differed from predecessors in its\nrelation to genetic information. Positional information was proposed\nas a “universal mechanism” for “translation of\ngenetic information into spatial patterns of differentiation”\n(Wolpert 1969: 1). The concept was designed to integrate gene-based\nand organicist approaches to development. Cells\n“interpret” changes in their positional information, so as\nto change the pattern of gene activation in a cell. Changing patterns\nof gene expression drive cell differentiation in a developing\norganism. This in turn effects spatial distribution of cell forces\n(e.g., contraction, motility, cell-cell contact), which drives\norganism-level morphogenesis. However, by 1975, Wolpert’s\nthinking about development had undergone a conceptual shift (Keller\n2002). Between 1971 and 1975, Wolpert’s ideas were\n“geneticized”, after which he accepted the idea of a\ngenetic program for development and the embryo as\n“computable” from an egg. In this way, the idea of a\nmorphogen gradient establishing positional information for cells was\nput under genetic control (see\n Section 9).\n\nWolpert and Lewis (1975) proposed a research program of computational\nembryology aimed at a\n\n\ntheory of development [that] would effectively enable one to compute\nthe adult organism from the genetic information in the egg. The\nproblem may be approached by viewing the egg as containing a program\nfor development. (1975: 14)\n\n\nPhilosopher Alexander Rosenberg (1997) endorses this version of\nWolpert’s theory as vindication of strong molecular reductionism\nin developmental biology. Manfred Laubichler and Günter Wagner\n(2001), alongside other biological theorists, reject this version of\nreductionism (see\n Section 10).\n Jaeger, Irons, and Monk (2008) propose to reverse Wolpert’s\nconceptual shift with their “relativistic theory of positional\ninformation”, adding a role for regulative feedback by\nresponding cells. Vecchi and Hernández (2014) criticize\nWolpert’s and Rosenberg’s reductionist computational\nembryology as classically preformationist and note explanatory lacunae\nof the idea of a genetic program pre-established in the egg. This\nfollows Keller (2002), who argues that the twentieth-century consensus\non development is essentially preformationist. This brings us to\n\n\nthe widespread reductionist and deterministic view of development as\nprogrammed in genes…with the implicit idea that the final form\nof the organism is “already there” in the instructions\ncontained in its genome as early as the egg stage. (Minelli &\nPradeu 2014b: 4)\n\n9. Twentieth-Century Genetics: A New Predeterminism\n\nEarly twentieth-century embryology highlighted epigenesis. But a new\ntwist on preformationism soon arose in the form of genetics. This\npointed to the nuclear chromosomes as loci for the causes of\ndifferentiation. Yet unlike Weismann and Roux, new geneticists did not\nsee the genetic material as divided up into a mosaic to explain\nensuing cell and tissue differences. Rather, the inherited nuclear\nmaterial was the same in every cell, but it acted differently\naccording to an internal program. This interpretation appealed to some\nscientists for metaphysical reasons since it focused on the material\nunits of heredity and apparently of causation. Epistemologically, it\nwas more difficult to point to evidence that inherited genes explain\ndevelopment.\n\nThis is not the place for a history of genetics, which has been\noffered many times elsewhere. The important point here is that\ngenetics brought a new form of preformationism. Instead of a\ndynamically acting organism taking its cues from the environmental\nconditions and from the way that cells interact with each cell\ndivision, the twentieth century brought a dominant and popular view\nthat has often emphasized genes as programmed to carry the information\nof heredity, which was also the information necessary to construct an\nindividual. Of course, there have been calls for alternatives or\ninteractionist models where heredity and development, epigenesis and\npreformation, work together, but these have often been offered as\nalternatives than as central interpretations (see\n Section 10).\n\nIn the beginning of the twentieth century, at first Thomas Hunt Morgan\nresisted the Mendelian-chromosome theory of inheritance that saw\ninherited units of heredity carried on chromosomes as determinants of\ndeveloped characters. If all the cells contain the same chromosomes,\nthen how can their inheritance explain anything, he asked. Instead, he\ninsisted that “We have two factors determining characters:\nheredity and the modification during development” (Morgan 1910a:\n477). Morgan wrote to a friend that “my field is experimental\nembryology” and not the genetics with which he became associated\n(Morgan 1908). Like his Woods Hole colleagues at the Marine Biological\nLaboratory, Morgan did not see how inherited chromosomes could explain\ndevelopment of form from non-form. He had rejected Weismann’s\ninterpretations and continued to reject the idea of inherited\ndeterminants.\n\nAlso in 1910, however, he was studying many different kinds of\norganisms in pursuit of explanations of heredity as well as\ndifferentiation. A white-eyed male Drosophila fly famously caught his\nattention, and led him to the conclusion that some inherited factors\nmust, indeed, cause expression in the emerging organism (Morgan\n1910b). It is not that Morgan changed his mind about how to do\nscience, but rather that the evidence carried him in new directions\n(Maienschein 1991a).\n\nThe fertilized egg cell contains a nucleus made up of chromosomes\ninherited from both parents. Along these chromosomes are lined up\nunits of heredity that serve like Weismann’s determinants, now\ncalled genes. These genes correlate with some characters in the\nresulting organism, and therefore in some sense the resulting form was\npredetermined in the egg. Yet it was not already formed. And, indeed,\nthe mere correlation of genes and characters tells us virtually\nnothing about how the differentiation occurs nor about how form\nbecomes formed (the problem of morphogenesis). Therefore, yes,\ngenetics brings a sort of new preformation or more accurately\npredeterminism. But that in itself brings a description and a\ncorrelation but no explanation. Or so Morgan initially felt, as did\nhis embryologist colleagues. Advances in genetics soon changed the\ntheoretical landscape. In 1934, Morgan posited differential gene\nactivity as the key to understanding organismal development. On his\nview, genes are inherited, their activity controlled by cytoplasmic\nfactors. The latter are originally heterogeneously distributed in the\negg. Differential gene activity so-driven leads in turn to\ndifferential cytoplasmic factor distribution, and the cycle continues,\ninfluenced by signals from a cell’s environment (primarily\nneighboring cells). Ideas of preformation and epigenesis are combined\nin pre-determined genes acting in response to diverse environmental\nfactors. Burian (2005) argues that the old theoretical opposition was\nreinscribed in the disciplinary separation of embryology and genetics,\nparticularly in the US. In that context, studies of development\nemphasizing the nucleus endorsed preformationism, while those focusing\non cytoplasm and cell lineage differentiation tended to epigenesis.\nThis theoretical rift was healed when research focus shifted from\n“cytoplasm vs. nucleus” to mechanisms of gene expression\n(Burian 2005). Theoretical concepts grounded in genetics and molecular\nbiology thereafter increasingly dominated thinking about\ndevelopment.\n\nBy mid-twentieth century, and especially after the discovery of\nDNA’s structure (which apparently also explained its function),\nresearchers began to forget or at least ignore questions about\nmorphogenesis and epigenesis (see, for example, Olby 1974, Judson\n1979). Instead they asked how, actually, genes give rise to\ndifferentiated form? Somehow that works, seemed to be the answer.\nGenetics predominated over what C.H. Waddington referred to as the\nepigenetics of development (Waddington 1942). Of course not everyone\nignored development, but it became a seriously neglected field and\neven professional societies and journals that had focused on\n“embryology” shifted to “developmental\ngenetics” (Oppenheimer 1967). When Robert Briggs and Thomas King\ncloned frogs in the 1950s and John Gurdon extended the research in the\n1960s, it seemed that nuclear transfer could come from only early\nstages of development. Furthermore, the resulting clones were like\ntheir donors from whom the nuclei came rather than like the mothers\nfrom whom the eggs came (Briggs & King 1952; Gurdon & Colman\n1999; McLaren 2000). Apparently development brings differentiation\nthat is unidirectional. Preformationist/ predeterminist thinking\nprevailed. Epigenetic development and regulatory response to\nenvironmental conditions seemed to have strict limits for those\nadopting the mid-twentieth-century predeterminist emphasis.\n9.1 Waddington’s landscape\n\nIn this context, Waddington’s theoretical approach was\ndistinctive, aiming to integrate genetics and epigenetic development.\nHis main device for doing so was “the epigenetic\nlandscape”, first articulated in 1939 and iconically diagrammed\nin The Strategy of the Genes (1957). Waddington’s\nlandscape model represents developmental potential as\n\n\na more or less flat, or rather undulating surface, which is tilted so\nthat points representing later states are lower than those\nrepresenting earlier ones … Then if something, such as a ball,\nwere placed on the surface, it would run down toward some final end\nstate at the bottom edge. (1957: 29).\n\n\nThe model visualizes three “essentially formal” properties\nof development: unidirectionality in time (via the landscape’s\ntilt), multiple discrete termini from a single undifferentiated start\n(via branching tracks), and robustness of developmental processes (via\nsteepness of valley walls).\n\nThese topographic features reflect generalizations about animal\ndevelopment, based mainly on experiments on chick and Drosophila. A\nrolling ball’s path down the incline corresponds to the\ndevelopment of some cell or tissue from an early undifferentiated\nstate to a mature differentiated state.\n\nWhat controls the path taken by a cell or piece of developing\ntissue—a pre-determined genetic program or ongoing orchestration\nof stimuli? Waddington (1939, 1940, 1957) identified genes as the\ndeterminants of epigenetic landscape topography. This is depicted in a\ncompanion diagram showing the landscape’s\n“underside” as a network of interacting biochemical\nproducts “which are ultimately controlled by genes” (1957:\n36). Waddington first articulated the landscape analogy in 1939, as a\ngeneralization of time- and dose-effect curves representing the role\nof genes in producing specific phenotypic effects. The landscape model\nresults from including interactive effects of the entire genome on a\nparticular pathway:\n\n\n[o]ne might roughly say that all these genes correspond to the\ngeological structure which moulds the form of the valley. (1939:\n182)\n\n\nAlthough he featured genetic control, Waddington’s designation\nof the landscape as “epigenetic” suggests a view of\ndevelopment allowing more of a role for epigenesis than more\ngene-focused contemporaries. Scott Gilbert (1991) argues that the\nbranching-track lineage structure unifies development and genetics,\nvisualizing a formal analogy between cellular, genetic, and organismal\ndevelopment. Fagan (2012, 2013a) extends this argument, focusing on\nWaddington’s unification of two complementary landscape images:\nrobust pathways above, and interacting gene products below, with genes\nat the bottom, metaphorically “pulling the strings”.\nNicoglou and Merlin (2017) and Nicoglou (2018) discuss this unifying,\nintegrative feature of Waddington’s landscape model as one\nstrand of twentieth-century epigenetics.\n\nWaddington’s own later theorizing took a mathematical turn,\ninterpreting the notion of a field in terms of spatial relations and\nusing Réné Thom’s topology to theorize\ndevelopmental pathways as an epigenetic system (1968). This work\nemphasized the concept of “chreod”, a trajectory (directed\npath) of normal development within multidimensional space, with axes\nfor time, three spatial dimensions, and concentrations of chemicals.\nAlthough not fruitful in biology at the time, Waddington’s\nmathematical approach anticipated twenty-first-century alternatives to\nthe idea of genetic control (see\n Section 10).\n In that context, the landscape model has experienced a renaissance.\nThe underside image is replaced by complex gene regulatory networks,\ntopside surfaces explicated in terms of systems biology and/or stem\ncell concepts (Fagan 2012, 2013a). Fusco and colleagues (2014) discuss\nrecent theoretical proposals (e.g., Wang, Wang, & Huang 2010) to\n“rehabilitate” Waddington’s landscape as a dynamical\nsystems model, which require significant changes from the original.\nThey conclude that landscape models (updated or not) are good for\nvisualizing cell differentiation but not other important developmental\nprocesses—and so not well-suited for a comprehensive theory of\ndevelopment. As a metaphorical aid to understanding, however,\nWaddington’s landscape remains influential. Jan Baedke (2013)\nexamines its broader impact across the life sciences, extending beyond\norganismal development to developmental psychology and cultural\nanthropology.\n9.2 The genetic program\n\nIn his influential book What is Life (1944)? Erwin\nSchrödinger speculated that development is controlled by “a\ncode-script structure” localized to chromosomes,\ninformation-patterns\n\n\ninstrumental in bringing about the development they\nforeshadow…architect’s plan and builder’s craft all\nin one. (1944: 18–19)\n\n\nTwentieth-century triumphs in genetics bolstered this idea. The main\nchallenge for such theories is how invariant genes, the same in every\ncell of an organism, can control the process of diversification of\nthose cells, their temporally-orchestrated movements and organization\ninto tissues, bodily structures, and complex organs. Frank Lillie\n(1927) put the point starkly (discussed in Burian 2005):\n\n\nThe essential problem of development is precisely that differentiation\nin relation to space and time within the life-history of the\nindividual which genetics appears implicitly to ignore… Those\nwho desire to make genetics the basis of physiology of development\nwill have to explain how an unchanging complex can direct the course\nof an ordered developmental stream. (1927: 365–367)\n\n\nResponses to what Burian has labelled “Lillie’s\nparadox” hinge on differences in gene expression among cells and\ntissues. Chromosomal DNA is a linear template for an mRNA transcript,\nwhich is in turn a template for a sequence of amino acids making up a\nprotein. Cell phenotype depends on which genes are transcribed and\nthen translated. But DNA does not express itself. The challenge then\nis to account for gene expression in a way that preserves genetic\ncontrol of development. The concept of a “genetic program for\ndevelopment” responds to this challenge.\n\nThe idea was forcefully articulated by François Jacob and\nJacques Monod:\n\n\nDuring embryonic development, the instructions contained in the\nchromosomes of the egg are gradually translated and executed…\nThe whole plan of growth, the whole series of operations to be carried\nout, the order and the site of syntheses and their coordination are\nall written down in the nucleic-acid message. (Jacob 1970 [1973:\n313])\n\n\nJacob and Monod’s view was grounded on their pioneering work on\nbacterial gene expression (1961a, 1961b). Their key result, the operon\nmodel, explains how gene expression in E. coli bacteria is\nregulated by environmental signals. Briefly, the model represents\ninteractions among various components: protein-encoding DNA sequences,\nregulatory DNA sequences, the “operator region” of DNA\nlocated near the start of protein-encoding genes, repressor protein,\nand small molecules (e.g., allolactose). If a repressor binds the\noperator region, this blocks protein synthesis at nearby coding\nsequences. Small molecules like allolactose bind the repressor,\ninhibiting its inhibition, so the protein-encoding genes associated\nwith the “de-repressed” operator are expressed. Those\ngenes encode enzymes involved in metabolizing the small molecules,\nneatly closing the regulatory loop. Jacob and Monod singled out DNA as\nthe controlling molecule of this regulatory system. Furthermore, as\nMichael Morange (2000) discusses, they extrapolated the E.\ncoli operon model to gene regulation in general, positing that\nall organismal development is controlled by a small set of regulatory\ngenes.\n\nJacob and Monod’s subsequent work emphasized molecular genetic\nreductionism and the idea of a genetic program for development. For\nexample, Jacob began The Logic of Life (1970 [1973]) with\nreflections on “The Programme”:\n\n\n… the structure of macromolecules is determined down to the\nlast detail by sequences of four chemical radicals contained in the\ngenetic heritage. What are transmitted from generation to generation\nare the “instructions” specifying the molecular\nstructures: the architectural plans of the future organism. They are\nalso the means of executing those plans and of coordinating the\nactivities of the system. In the chromosomes received from its\nparents, each egg therefore contains its entire future: the stages of\nits development, the shape and the properties of the living being\nwhich will emerge. The organism thus becomes the realization of a\nprogramme prescribed by its heredity. (1970 [1973: 1–2])\n\n\nHowever, extrapolation from bacterial gene regulation to development\nin multicellular organisms proved unfounded. Limitations of the operon\nmodel soon became evident. In eukaryotic, multicellular organisms,\ngene expression is far more complex. Fifty years of molecular biology\nhave revealed a menagerie of mechanisms implicated in the complex\ncellular machinery of gene expression (see the entry on\n molecular biology).\n And this is not to mention interactions among cells and tissues,\nabout which classic molecular biology was silent. Brian Goodwin, a\nstudent of Waddington’s, charted an alternative theoretical path\nthat skirted these limitations. In the 1960s, he developed equations\nto model genetic oscillation, building on Jacob and Monod’s\noperon model (Goodwin 1965). But his subsequent theorizing about\ndevelopment emphasized self-organization due to chemical gradients and\nmechanical strain in cytoplasm, presaging dynamic and physical\ntheories that gained prominence around the turn of the millennium\n(Goodwin & Trainor 1985, see\n Section 10.2\n and the entry on\n systems and synthetic biology).\n\nThe next experimental milestone for theories of genetic control of\ndevelopment was Christiane Nüsslein-Volhard and\ncollaborators’ painstaking characterization of mechanisms of\nbody patterning and polarity in Drosophila (e.g., Driever &\nNüsslein-Volhard 1988). They distinguished three regions along\nthe early embryo’s anteroposterior body axis (anterior,\nposterior, and terminal), the basic patterns and structures of which\nare controlled by distinct sets of maternal genes. A few such genes\nhave long-range “organizing” effects. Notably, Driever and\nNüsslein-Volhard (1988) showed that bicoid protein acts as a\nmorphogen, controlling formation of a fly’s anterior (including\nhead and thorax) in accordance with its concentration gradient.\nSignificantly, their experimental manipulations were DNA sequence\nmutations (known to effect anterior body plan development or bicoid\ncopy number). The experiments thereby charted a causal pathway from\nDNA to mRNA to protein to cell differentiation to morphogenesis. This\ndemonstration of changes in body-plan correlated with maternal genetic\nmutations was powerful vindication of the idea that genes control\ndevelopment. Moreover, central concepts of the organicist alternative\n(gradients and positional information) were brought under the rubric\nof that theory. Nüsslein-Volhard’s gene-based approach\nremains influential in developmental biology (see the entry on\n developmental biology).\n9.3 The regulatory genome\n\nThe above and other experimental successes underpin Eric\nDavidson’s theory of “the regulatory genome” (2006),\nwhich combines new experimental data (mainly from Drosophila\nand sea urchin) with systems and network concepts—in effect,\nupdating Jacob and Monod’s notion of the genetic program. On\nthis view, development is controlled by a DNA-encoded program made up\nof short sequences that specifically bind transcription factor\nproteins and thereby make a difference to gene expression. The first\nstep of gene expression in higher organisms is typically the binding\nof one or more protein factors to a regulatory region of DNA located\nnear the sequence to be transcribed (“read” into mRNA and\nthence to protein). Davidson terms these DNA sequences\n“cis-regulatory modules”. Each module’s effect is\nrepresented as a conditional rule of the form: “If protein\nX is present, then gene Y is expressed at level Z”.\nEach gene has a set of such modules associated with it, which\ncollectively specify its expression pattern under various conditions.\nThat expression pattern, in turn, determines a cell’s phenotype\nand developmental fate. Control of development is therefore attributed\nentirely to the DNA components of molecular complexes that make a\ndifference to gene expression. Transcription factor proteins and other\ncomponents are conceived as “inputs” to the\ninformation-processing modules, and effects on gene expression as\n“outputs”.\n\nThese basic “cis-regulatory” units are organized into\nsystems of interacting modules. Because transcription factor proteins\nare products of gene expression, the regulatory modules that control\ntheir expression are sites of “primary core control” for\ndevelopment. These core control modules form an interconnected\nnetwork, reflecting the influences of transcription factor proteins on\none another’s expression. All organisms have a genetic\nregulatory network composed of DNA sequences distributed throughout\nits genome, which constitutes a stable underlying program for\ndevelopment. Collectively, DNA modules act as “a vast,\ndelocalized computational device” that processes regulatory\nstates of a cell (Davidson 2006: 185). Furthermore, regulatory DNA\nsequences are (for the most part) invariant across cells of an\norganism, and organisms of a species, with a relatively small set of\n“hub” transcription factors conserved throughout much of\nthe animal kingdom. The regulatory genome therefore offers a unified\nexplanation of animal evolution and development. However, there are\ngood reasons to think the role of DNA sequences in gene expression is\nnot distinctive, causally or informationally (see the entries on\n gene, \n genetics, and\n reductionism in biology). \n Other recent theoretical approaches tend toward more\ninclusive, less gene-centric explanations of development.\n10. Twenty-First-Century Alternatives: A New Epigenesis?\n\nThe end of the twentieth century brought discoveries that challenged\nprevailing genetic determinism, and also began to replace the extreme\nforms of either preformationism or epigenesis with the sorts of\ninteractionist models that were only offered as outlying alternatives\nin earlier decades. A modified form of epigenesis, in which the\norganism is seen as beginning from an inherited egg and sperm that do\ninclude genes, seems to be on the rise again. Research on cell\ndevelopment, stem cells, and tissue engineering shows that the\nidentity of any particular cell is not predetermined, but also depends\non interactions with its neighbors and context. Ian Wilmut’s\nteam’s success in cloning Dolly, reported in 1997, and John\nGearhart and James Thomson’s successes with developing human\nstem cell lines, both reported in 1998, challenged prevailing\nassumptions (Wilmut et al 1997, Wilmut, Campbell, & Tudge 2000;\nThomson et al. 1998; Shamblott et al. 1998; Gearhart 1998). Both\nsuggested that development is a good deal more flexible, plastic, and\ninteractive than preformationist interpretations allow. These\nexperimental results, alongside conceptual issues, spur alternative\ntheories of development. Gilbert (2004) notes increased emphasis on\ninteraction, change, emergence, and reciprocal\n“determination” relations between whole and component\nparts. His own work emphasizes the need for multiple perspectives in\nunderstanding development; notably diversification in the location of\ncausal control beyond genes alone (see the entry on\n evolution and development).\n This section focuses on philosophical efforts along these lines.\n10.1 Developmental systems and cycles\n\nSusan Oyama’s monograph The Ontogeny of Information\n(1985 [2000a]) critiques gene-based theories of development. She\nargues that genetic information for development is causally\nderivative, existing as such only in the context of an ongoing\ndevelopmental process. That process, in all its contingency and\nhistorical specificity, is causally primary. Neither DNA nor\nenvironmental factors are causes of development outside the\ninteractive context that makes features of the physical world an\norganism’s environment and induces patterns of gene activation\nwithin cells. Genetic information emerges from the interactions of\nheterogeneous, dispersed, developmental resources. Central to\nOyama’s view is the\n\n\nconception of a developmental system, not as the reading off of a\npreexisting code, but as a complex of interacting influences, some\ninside the organism’s skin, some external to it, and including\nits ecological niche in all its spatial and temporal aspects. (1985\n[2000a: 39])\n\n\nAs in earlier organicism, patterns and form emerge from ongoing\ninteraction, within and among multiple levels of organization, on\nmultiple time-scales. But unlike the organicists, Oyama has an\nestablished theoretical alternative to contend with. Much of her\nargument is negative, rejecting the gene/environment dichotomy,\nprimacy of genes as causes, and lingering preformationism of the idea\nof a genetic program for development. Her theoretical perspective aims\nto overcome entrenched (and often unrecognized) dichotomies in\nbiological thought. Although criticized for their complexity, apparent\nincompatibility with scientific generalization, and lack of connection\nto experimental practices, Oyama’s ideas about developmental\nsystems have been influential in twenty-first-century philosophy of\nbiology.\n\nOne impact is further articulation of developmental systems theory\n(DST; see the entries on \n inheritance systems\nand\n replication and reproduction). \n In the introduction to\ntheir 2001 edited volume, Cycles of Contingency, Oyama, Paul\nGriffiths, and Russell Gray set out DST’s major themes and\ncommitments: joint determination by multiple causes (causal parity),\ncontext sensitivity and contingency, extended inheritance, development\nas construction, distributed control, and evolution as construction.\nAnother core tenet is rejection of opposed dualities such as\nnature/nurture, gene/environment, and biology/culture—not\narguing that an adequate theory of development must include both sides\nof opposition, but that the oppositions themselves have no place in an\nadequate theory of development. Relatedly, genes are not privileged\ncauses of development (Griffiths & Knight 1998). This\n“parity thesis” is sometimes misunderstood as a\ntheoretical claim that all causes of development are equally\nimportant. But it is better understood as a constraint on theories of\ndevelopment (and evolution): to not presuppose any fundamental\ndistinction between genes and all other causes (Oyama et al. 2001: 3).\nDST’s other themes are similarly arrayed against\ntwentieth-century predeterminism. In this way, DST entails a\nconceptual reorientation in thinking about inheritance, development,\nand evolution, and a point of departure for philosophical exploration\nof alternatives to gene-centrism and entrenched dichotomies. Much of\nthis research focuses on integrating development and\nevolution—i.e., evo-devo theories (see the entry on\n evolution and development).\n DST-affiliated projects that focus on organismal development are\ndiscussed here.\n\nA developmental system is\n\n\na heterogeneous and causally complex mix of interacting entities and\ninfluences that produces the life cycle of an organism. (Oyama 2000b:\n1)\n\n\nJames Griesemer (2000a, 2000b, 2014a, 2014b) further articulates this\nidea by conceptualizing development as part of a more general theory\nof reproduction (see the entry on\n replication and reproduction).\n In this theory,\n\n\ndevelopment is the acquisition of the capacity to reproduce, where\nreproduction involves material propagation of developmental capacities\nfrom parents to offspring. (2014b: 199)\n\n\nIf development is so conceived,\n\n\n…then it turns out all traditional life cycles are\ncomplex…[i.e.] there is typically at least one substantial\nchange of developmental context or niche, with multiple generations of\nprogenerants, before a life cycle is completed. (2014b:\n191–192)\n\n\nComplex life cycles of parasites and viruses, then, are not\nidiosyncratic but rather exemplars of complex, context-dependent\ndevelopmental processes. Griesemer’s theoretical reorientation\ndeparts from the traditional idea of development as proceeding\nlinearly from egg to embryo to adult. Instead, developmental\ncapacities are properties of life cycles involving multiple organismal\nforms. This motivates a new theoretical concept: scaffolding\ninteractions that bring a developing entity and aspects of the\nenvironment into such close association as to qualify as a new\n“hybrid” entity with new developmental potentialities\n(Griesemer 2014a). The original entity and environment are as\n“parents” to the new “hybrid” developmental\nsystem (e.g., HIV integrated into host genome vs. free virus and\nuninfected human cell/genome). Genes are demoted to “a special\nkind of evolved class of scaffolding developmental mechanisms”\n(2014b: 198).\n\nBiologist Alessandro Minelli (2009, 2014) endorses a similar view of\ndevelopment, arguing that the first step toward a satisfactory theory\nis characterizing the full range of developmental processes, beyond\nthe traditional “adultocentric perspective” tracing the\nformation of a mature organism from an egg cell. Although Minelli does\nnot theorize development in terms of reproducers, he does\nconceptualize the process in terms of life cycles (see also Bonner\n1974). Life cycles can be multigenerational, multigenomic,\nunicellular—and so developmental processes include these too,\nimplicating haploid stages in sexually-reproducing organisms,\nalternation of generations, mixed sexual/asexual reproduction as in\ncolonial tunicates and plants, etc. Minelli proposes to use this\nexpanded view of “developmental disparity”, encompassing\nthe full range of diversity of life cycles of living things, alongside\n“traditional, or naïve, concepts of development” to\narrive at a satisfactory general framework (2014: 228).\n\nJason Scott Robert (2004) extends Oyama’s critique of the\nprevailing view that\n\n\ndevelopment is now standardly construed as the epigenesis of something\npreformed in the DNA. (2004: 35)\n\n\nThis combination of old theoretical opposites, he argues, is\nunbalanced in favor of preformationism. Robert proposes instead\n“creative development”:\n\n\nthe organism’s semi-autonomous self-constitution from a range of\nontogenetic raw materials,\n\n\nco-constructed with its environment (2004: 87). Burian (2005)\nsimilarly challenges the adequacy of genetic determinism for\nunderstanding development, arguing that experimental results better\nsupport multilevel causation. Although grounded in experimental\npractices and associated concepts rather than abstract theory,\nBurian’s arguments motivate search for new theories to account\nfor robustness of developmental processes and outcomes.\n10.2 Physical and dynamic systems\n\nAnother strand of theorizing development draws on physics of\nmaterials. Stuart Newman (2003) argues that physical factors played a\nmajor role in the early evolutionary history of multicellular\norganisms. Living tissues undergoing development have properties of\nliquid-like “soft matter”, such as viscous flow,\nelasticity, surface tension. They are also\n“excitable”,\n\n\nsimultaneously hav[ing] chemical, mechanical, and electrical\nproperties, they behave in a multiscale fashion, continuously and\nsimultaneously changing their composition and organizational\nproperties on several temporal and spatial scales. (2003: 96)\n\n\nThese material properties allow living tissues to be analyzed in terms\nof physical theories and constraints. Although developmental processes\nin organisms today appear to follow pre-determined genetic programs,\nphysical forces and constraints are at the origin of developmental\nsystems and still play a vital role within them.\n\nNewman’s theoretical approach “link[s] the modern physics\nof materials with contemporary knowledge of genetic\ndeterminants” (2014: 107; see also Newman 2003; Forgacs &\nNewman 2005). A core thesis of this theoretical approach is that\nexcitable soft matter can exhibit self-organization in the absence of\nany pre-existing program; e.g., synchronized oscillations, local\ndiffusion gradients, compartment-formation via cell adhesion. (This\ntheoretical approach is anticipated in the work of Brian Goodwin, see\n Section 9.2.)\n Newman posits that the earliest multicellular organisms underwent\ndevelopment spurred by these physical processes, together yielding a\nbasic body plan. Over long evolutionary timescales, gene regulatory\nnetworks are overlaid upon physics-driven self-organizing processes.\nThe result is a highly-conserved set of dynamical patterning modules\n(DPMs) that make basic shapes in a developing embryo: layers, lumens,\nfolds, tubes, segments, etc. Importantly, DPMs are not predetermined\ngenetic programs, but more inclusive systems capable of\nself-organization. Newman and colleagues use computer simulation to\nstudy the possible patterns generated by dynamical gene network models\nrepresenting DPMs (Salazar-Ciudad, Newman, & Solé 2001).\nThis method brings in dynamical systems theory, which has recently\nbecome central to systems biology (see the entry on\n systems and synthetic biology).\n\nDynamical systems approaches to development, being committed to holism\nand temporal unfolding, echo classic epigenesis and early\ntwentieth-century organicism. These earlier ideas are brought to bear\non new high-throughput quantitative datasets using simulation\ntechnology—updating and revitalizing the earlier systems\ntheoretic approaches of D’Arcy Thompson and von Bertalanffy.\nAlthough most work in systems biology focuses on single-cell organisms\nand intracellular networks, some researchers look to dynamical systems\ntheory to construct a general theory of development. Following\nGoodwin’s theories, Johannes Jaeger and colleagues seek to\nidentify a finite core set of basic developmental processes\nimplemented by genetic-epigenetic-cellular regulatory systems (e.g.,\nJaeger & Sharpe 2014). They use computer simulation of regulatory\nnetwork models to identify classes of geometrically similar networks\nthat perform specific functions (such as producing stripe patterns).\nThe goal is a rational classification scheme for\nfunctionally-characterized developmental mechanisms, which can in turn\nserve as groundwork for a general theory of development. It remains\nunclear, however, if biological functions in development can be\ncharacterized in a context-independent (modular) way, allowing for a\ntractable theory. Relatedly, Jonathan Bard (2011, 2013) posits a\nrelatively small set of developmental networks driving\n“patterning, signaling, proliferation, differentiation, and\nmorphogenesis”, “themes used over and over again” in\nnetworks of signaling pathways. Bard’s graphical network\napproach is distinctive in cutting across spatial scales and levels of\nhierarchical organization. Core processes (as networks) are\ndistributed across levels; there is no preferred level of\ndevelopmental activity, but all involved simultaneously. The resulting\nnetwork structures are quite complex.\n10.3 Stem cells and lineages\n\nResults of stem cell experiments prompt re-examination of now-standard\nassumptions about the nature of development. At early stages of\nmammalian development when embryonic stem cells are most plentiful, in\nthe blastocyst stage just before implantation, stem cells can be\nharvested and cultured to become a large number of different kinds of\ncells (Thomson et al. 1998). In theory, they have the capacity to\nbecome any kind of differentiated cell, but it is impossible to prove\nthat conclusively (Fagan 2013b). Position in the organism and with\nrespect to other cells seems to be decisive in directing\ndifferentiation. Although genetics provides information about the\nrange of possibilities, regulation of gene expression involves diverse\nfactors—and stem cells’ plasticity and context-dependence\nfits a more epigenetic view. Cell reprogramming, for example, is a\nmethod of producing stem cells (induced pluripotent stem cells) from\nmore differentiated cells, effectively reversing normal development\n(Takahashi & Yamanaka 2006). This contradicts any strict principle\nof development as irreversible and internally-directed, undermining\nthe notion of a fixed program for development (Brandt 2010). Melinda\nCooper (2003) examines how central concepts of stem cell research\n(potency, differentiation, form, and regeneration) fit within the long\ntradition of theorizing about epigenesis and self-organization, dating\nfrom seventeenth-century revivals of Aristotelian embryology.\n\nAriane Dröscher (2014) traces the history of conceptual change\nconcerning stem cells via lineage tree diagrams, a form of visual\nrepresentation common to studies of development and of evolution.\nLineage diagrams track relations between generations of reproducing\nentities. From Haeckel’s speculative image of the Tree of Life\nand Weismann’s introduction of “cytogenetic tree\ndiagrams”, Dröscher examines this cell-centric way of\nunderstanding development from the mid-nineteenth century onward.\nScott Gilbert (1991) shows that branching tracks have been used to\nrepresent cell development since the late nineteenth century, most\nprominently in cell lineage diagrams that track cell pedigrees and\ndivision events. In these models, branch-points represent cell\ndivision events and branching tracks represent genealogical relations\namong cells. Other cell characteristics are also represented, such as\nposition within the developing embryo, morphology, and developmental\nfate. Waddington’s landscape is a model of this type (see\n Section 8.1).\n Fagan (2013a) uses this modeling approach to characterize cell\ndevelopment in general. Any process of cell development produces a\ncell lineage tree with a specific topology, representing developmental\nand reproductive relations between cells. Different stem cell concepts\ncorrespond to models that differentially constrain the space of\npossible topologies for cell lineage trees. This framework provides a\nsystematic representation of the many different varieties of stem\ncell.\n\nFagan (2013a, 2017) extends this cell lineage framework to\ncell-molecular and cell-organism relations, yielding a cell-centric\nmulti-level model of development. Her view of the cell-molecular\nrelation is that of systems biology: a cell state is a pattern of gene\nexpression and molecular interactions that determines a cell’s\nstructural and functional characteristics. The cell-organism relation\nis “enkaptic”—that is, cells reproduce and\ndifferentiate (the two defining stem cell abilities) and are collected\nor encapsulated into a higher-level system: gastrula, tissue, organ,\nor an experimentally-produced organoid or embryo-like structure. The\nhigher-level system emerges via formation of a boundary separating it\nfrom its environment. So different levels or scales of a developmental\nprocess are related by “boundary-formation”. On this view,\ndevelopment is a process comprised of multi-layered interactive\nnetworks, arranged in strata (layers) related by an encapsulating\nboundary. Each network is related to the one below by\nboundary-formation, conceived as emerging out of (and imposing\nconstraints on) smaller-scale interactions such that an encapsulating\nsystem is distinguished from its environment.\n\nJane Maienschien and Kate MacCord offer a suggestive look at\nregeneration as a response of complex systems to injury through\nrepair. (Maienschein and MacCord, 2022) The repair draws on inherited\nand in some ways predelineated organization, as well as on responses\nto changing environments. Both Fagan’s stem cell-based\nalternatives to predetermined development and Maienschein and\nMacCord’s suggestions about regeneration across all scales of\nlife hark back to Morgan’s suggestion that\n\n\na process of pure epigenetic development, as generally understood\nnowadays, may also be predetermined in the egg. (Morgan 1901: 968)\n\n\nThe nowadays of the twenty-first century may take us back to some of\nthe understanding and insights of the early twentieth, a time when a\nbalance of epigenesis and preformation seemed likely.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Agutter, Paul S., P. Colm Malone, and Denys N. Wheatley, 2000,\n“Diffusion Theory in Biology: A Relic of Mechanistic\nMaterialism”, <em>Journal of the History of Biology</em>, 33(1):\n71–111. doi:10.1023/A:1004745516972",
                "Aristotle, [GA] <em>De Generatione Animalium</em>. Translated as\n<em>Generation of Animals</em>, Greek and English, A. L. Peck\n(trans.), (Loeb Classical Library 366), Cambridge, MA: Harvard\nUniversity Press, 1979.",
                "Baedke, Jan, 2013, “The Epigenetic Landscape in the Course\nof Time: Conrad Hal Waddington’s Methodological Impact on the\nLife Sciences”, <em>Studies in History and Philosophy of Science\nPart C: Studies in History and Philosophy of Biological and Biomedical\nSciences</em>, 44(4): 756–773.\ndoi:10.1016/j.shpsc.2013.06.001",
                "–––, 2018, <em>Above the Gene, beyond Biology:\nToward a Philosophy of Epigenetics</em>, Pittsburgh, PA: University of\nPittsburgh Press.",
                "Bard, Jonathan, 2011, “A Systems Biology Representation of\nDevelopmental Anatomy”, <em>Journal of Anatomy</em>, 218(6):\n591–599. doi:10.1111/j.1469-7580.2011.01371.x",
                "–––, 2013, “Driving Developmental and\nEvolutionary Change: A Systems Biology View”, <em>Progress in\nBiophysics and Molecular Biology</em>, 111(2–3): 83–91.\ndoi:10.1016/j.pbiomolbio.2012.09.006",
                "Berestycki, Henri, 2013, “Alan Turing and Reaction-Diffusion\nEquations”, in S. B. Cooper and van Leeuwen 2013:\n723–732.",
                "von Bertalanffy, Ludwig von, 1928 [1933], <em>Kritische Theorie\nder Formenbildung</em>, Berlin: Gebruder Borntraeger. Translated as\n<em>Modern Theories of Development: An Introduction to Theoretical\nBiology</em>, J. H. Woodger (trans.), London: Oxford University Press,\n1933.",
                "Beurton, Peter J., Raphael Falk, and Hans-Jörg Rheinberger\n(eds.), 2000, <em>The Concept of the Gene in Development and\nEvolution: Historical and Epistemological Perspectives</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511527296",
                "Bonner, John Tyler, 1974, <em>On Development: The Biology of\nForm</em>, Cambridge, MA: Harvard University Press.",
                "Bowler, Peter J., 1971, “Preformation and Pre-Existence in\nthe Seventeenth Century: A Brief Analysis”, <em>Journal of the\nHistory of Biology</em>, 4(2): 221–244.\ndoi:10.1007/BF00138311",
                "–––, 1975, “The Changing Meaning of\n‘Evolution’”, <em>Journal of the History of\nIdeas</em>, 36(1): 95–114. doi:10.2307/2709013",
                "Brandt, Christina, 2010, “The Metaphor of ‘Nuclear\nReprogramming’: 1970’s Cloning Research and Beyond”,\nin <em>Hereditary Hourglass. Genetics and Epigenetics,\n1868–2000</em>, Ana Barahona, Edna Suárez Díaz,\nand Hans-Jörg Rheinberger (eds.), Berlin: Max Planck Institute\nfor History of Science, 85–95.",
                "Briggs, Robert and Thomas J. King, 1952, “Transplantation of\nLiving Nuclei from Blastula Cells into Enucleated Frogs’\nEggs”, <em>Proceedings of the National Academy of Sciences</em>,\n38(5): 455–463. doi:10.1073/pnas.38.5.455",
                "Burian, Richard M., 2005, <em>The Epistemology of Development,\nEvolution, and Genetics</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511610271",
                "–––, 2014 “Foreword: A Philosopher’s\nView”, in Minelli and Pradeu 2014a: xi–xiii.",
                "Burian, Richard M. and Denis Thieffry (eds), 2000, <em>From\nEmbryology to Developmental Biology</em>, special issue of <em>History\nand Philosophy of the Life Sciences</em>, 22(3).",
                "Churchill, Frederick Barton, 1966, “Wilhelm Roux and a\nProgram for Embryology”, Ph.D. dissertation, Cambridge, MA:\nHarvard University.",
                "–––, 1973, “Chabry, Roux, and the\nexperimental method in nineteenth century embryology”, in\n<em>Foundations of the Scientific Method: the Nineteenth Century</em>,\nRonald N. Giere and Richard S. Westfall (eds), Bloomington, IN:\nIndiana University Press, 161–205.",
                "–––, 2015, <em>August Weismann: Development,\nHeredity, and Evolution</em>, Cambridge, MA: Harvard University\nPress.",
                "Connell, Sophia M., 2016, <em>Aristotle on Female Animals: A Study\nof the “Generation of Animals”</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781316479766",
                "–––, 2020, “The Female Contribution to\nGeneration and Nutritive Soul in Aristotle’s Embryology”,\nin <em>Nutrition and Nutritive Soul in Aristotle and\nAristotelianism</em>, Giouli Korobili and Roberto Lo Presti (eds.),\nBerlin: De Gruyter, 63–84. doi:10.1515/9783110690552-006",
                "Cooper, Melinda, 2003, “Rediscovering the Immortal\nHydra : Stem Cells and the Question of Epigenesis”,\n<em>Configurations</em>, 11(1): 1–26.\ndoi:10.1353/con.2004.0010",
                "Cooper, S. Barry and Jan van Leeuwen (eds.), 2013, <em>Alan\nTuring: His Work and Impact</em>, Waltham, MA: Elsevier.\ndoi:10.1016/C2010-0-66380-2",
                "Crick, Francis, 1970, “Diffusion in Embryogenesis”,\n<em>Nature</em>, 225(5231): 420–422. doi:10.1038/225420a0",
                "Darwin, Charles, 1859, <em>On the Origin of Species</em>, London:\nJohn Murray.\n [<a href=\"http://darwin-online.org.uk/content/frameset?itemID=F373&amp;viewtype=text&amp;pageseq=442\" target=\"other\">Darwin 1859 available online</a>]",
                "Davidson, Eric H., 1968, <em>Gene Activity in Early\nDevelopment</em>, first edition, New York: Academic Press. Second\nedition, 1976; third edition, 1986.",
                "–––, 2001, <em>Genomic Regulatory Systems:\nDevelopment and Evolution</em>, San Diego, CA: Academic Press.",
                "–––, 2006, <em>The Regulatory Genome: Gene\nRegulatory Networks in Development and Evolution</em>, Burlington,\nMA ; San Diego: Academic Press.",
                "Davidson, Eric H. and Michael S. Levine, 2008, “Properties\nof Developmental Gene Regulatory Networks”, <em>Proceedings of\nthe National Academy of Sciences</em>, 105(51): 20063–20066.\ndoi:10.1073/pnas.0806007105",
                "Detlefsen, Karen, 2006, “Explanation and Demonstration in\nthe Haller-Wolff Debate”, in <em>The Problem of Animal\nGeneration in Early Modern Philosophy</em>, Justin E. H. Smith (ed.),\nCambridge: Cambridge University Press, 235–261.\ndoi:10.1017/CBO9780511498572.012",
                "Driesch, Hans, 1892 [1964], “Entwicklungsmechanische\nStudien. I. Der Werth der beiden ersten Furchungszellen in der\nEchinodermentwicklung. Experimentelle Erzeugen von Theil- und\nDoppelbildung”, <em>Zeitschrift für wissenschafliche\nZoologie</em>, 53: 160–178. Abridged translation as “The Potency\nof the First Two Cleavage Cells in Echinoderm Development.\nExperimental Production of Partial and Double Formations.” L.\nMezger, M. Hamburger, V. Hamburger, and T.S. Hall (trans.), in Willier\nand Oppenheimer 1964: 38–50.",
                "Driever, Wolfgang and Christiane Nüsslein-Volhard, 1988,\n“The <em>bicoid</em> Protein Determines Position in the\nDrosophila Embryo in a Concentration-Dependent Manner”,\n<em>Cell</em>, 54(1): 95–104.\ndoi:10.1016/0092-8674(88)90183-3",
                "Dröscher, Ariane, 2014, “Images of Cell Trees, Cell\nLines, and Cell Fates: The Legacy of Ernst Haeckel and August Weismann\nin Stem Cell Research”, <em>History and Philosophy of the Life\nSciences</em>, 36(2): 157–186.\ndoi:10.1007/s40656-014-0028-8",
                "Fagan, Melinda Bonnie, 2012, “Waddington Redux: Models and\nExplanation in Stem Cell and Systems Biology”, <em>Biology &amp;\nPhilosophy</em>, 27(2): 179–213.\ndoi:10.1007/s10539-011-9294-y",
                "–––, 2013a, <em>Philosophy of Stem Cell Biology:\nKnowledge in Flesh and Blood</em>, New York: Palgrave Macmillan.\ndoi:10.1057/9781137296023",
                "–––, 2013b, “The Stem Cell Uncertainty\nPrinciple”, <em>Philosophy of Science</em>, 80(5):\n945–957. doi:10.1086/674014",
                "–––, 2016, “Stem Cells and Systems Models:\nClashing Views of Explanation”, <em>Synthese</em>, 193(3):\n873–907. doi:10.1007/s11229-015-0776-3",
                "–––, 2017, “Stem Cell Lineages: Between\nCell and Organism”, <em>Ontologies of Living Beings</em> special\nissue of <em>Philosophy, Theory, and Practice in Biology</em>, 9:\narticle 6. doi:10.3998/ptb.6959004.0009.006",
                "Falcon, Andrea and David Lefebvre (eds.), 2017,\n<em>Aristotle’s “Generation of Animals”: A Critical\nGuide</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781316459386",
                "Farley, John, 1977, <em>The Spontaneous Generation Controversy\nfrom Descartes to Oparin</em>, Baltimore, MD: Johns Hopkins University\nPress.",
                "Forgacs, Gabor and Stuart Newman, 2005, <em>Biological Physics of\nthe Developing Embryo</em>, Cambridge/New York: Cambridge University\nPress.",
                "Fry, Iris, 2000, <em>The Emergence of Life on Earth: A Historical\nand Scientific Overview</em>, New Brunswick, NJ: Rutgers University\nPress.",
                "Fusco, Giuseppe, Roberto Carrer, and Emanuele Serrelli, 2014,\n“The Landscape Metaphor in Development”, in Minelli and\nPradeu 2014a: 114–128 (chap. 7).",
                "Gearhart, John, 1998, “New Potential for Human Embryonic\nStem Cells”, <em>Science</em>, 282(5391): 1061–1062.\ndoi:10.1126/science.282.5391.1061",
                "Gilbert, Scott F., 1991, “Epigenetic Landscaping:\nWaddington’s Use of Cell Fate Bifurcation Diagrams”,\n<em>Biology &amp; Philosophy</em>, 6(2): 135–154.\ndoi:10.1007/BF02426835",
                "–––, 2004, “Foreword”, in\n<em>Crystals, Fabrics, and Fields: Metaphors that Shape Embryos</em>,\nby Donna Jeanne Haraway, Berkeley, CA: North Atlantic Books, pages\nxi–xv.",
                "Gilbert, Scott F., John M. Opitz, and Rudolf A. Raff, 1996,\n“Resynthesizing Evolutionary and Developmental Biology”,\n<em>Developmental Biology</em>, 173(2): 357–372.\ndoi:10.1006/dbio.1996.0032",
                "Goodwin, Brian C., 1965, “Oscillatory Behavior in Enzymatic\nControl Processes”, <em>Advances in Enzyme Regulation</em>, 3:\n425–437. doi:10.1016/0065-2571(65)90067-1",
                "Goodwin, Brian C. and Lynn E. H. Trainor, 1985, “Tip and\nWhorl Morphogenesis in ‘Acetabularia’ by Calcium-Regulated\nStrain Fields”, <em>Journal of Theoretical Biology</em>, 117(1):\n79–106. doi:10.1016/S0022-5193(85)80165-X",
                "Griesemer, James R., 2000a, “Development, Culture, and the\nUnits of Inheritance”, <em>Philosophy of Science</em>, 67(S3):\nS348–S368. doi:10.1086/392831",
                "–––, 2000b, “Reproduction and the\nReduction of Genetics”, in Beurton, Falk, and Rheinberger 2000:\n240–285. doi:10.1017/CBO9780511527296.013",
                "–––, 2014a, “Reproduction and the\nScaffolded Development of Hybrids”, in <em>Developing Scaffolds\nin Evolution, Culture, and Cognition</em>, Linnda R. Caporael, James\nR. Griesemer, and William C. Wimsatt (eds.), Cambridge, MA: The MIT\nPress, 23–56. doi:10.7551/mitpress/9780262019552.003.0002",
                "–––, 2014b, “Reproduction and Scaffolded\nDevelopmental Processes: An Integrated Evolutionary Perspective”\nin Minelli and Pradeu 2014a: 183–202 (chap. 12).",
                "Griffiths, Paul E. and Robin D. Knight, 1998, “What Is the\nDevelopmentalist Challenge?”, <em>Philosophy of Science</em>,\n65(2): 253–258. doi:10.1086/392636",
                "Gurdon, J. B. and Alan Colman, 1999, “The Future of\nCloning”, <em>Nature</em>, 402(6763): 743–746.\ndoi:10.1038/45429",
                "Haeckel, Ernst, 1866, <em>Generelle Morphologie der Organismen :\nallgemeine Grundzüge der organischen Formen-Wissenschaft,\nmechanisch begründet durch die von Charles Darwin reformirte\nDescendenz-Theorie</em>, Berlin: G. Reimer.",
                "Haraway, Donna Jeanne, 1976 [2004], <em>Crystals, Fabrics, and\nFields: Metaphors of Organicism in Twentieth-Century Developmental\nBiology</em>, New Haven, CT: Yale University Press. Reprinted\nBerkeley, CA: North Atlantic Books, 2004.",
                "Harrison, Ross G., 1969, <em>Organization and Development of the\nEmbryo</em>, Sally Wilens (ed.), (Yale University. Mrs. Hepsa Ely\nSilliman Memorial Lectures), New Haven, CT: Yale University\nPress.",
                "Henry, Devin, 2017, “Aristotle on Epigenesis: Two Senses of\nEpigenesis”, in Falcon and Lefebvre 2017: 89–107.\ndoi:10.1017/9781316459386.007",
                "Hertwig, Oscar, 1894 [1900], <em>Zeit- und Streitfragen der\nBiologie</em>, 2 vols., Jena: Gustav Fischer. Translated as <em>The\nBiological Problem of Today: Preformation or Epigenesis? The Basis of\na Theory of Organic Development, by Professor Dr. Oscar Hertwig</em>,\nP. Chalmers Mitchell (trans.), New York: The Macmillan Company, 1900.\ndoi:10.5962/bhl.title.1492",
                "Hopwood, Nick, Rebecca Flemming, and Lauren Kassell (eds.), 2018,\n<em>Reproduction: Antiquity to the Present Day</em>, Cambridge:\nCambridge University Press.",
                "Jacob, François, 1970 [1973], <em>La logique du vivant: une\nhistoire de l’hérédité</em>,\n(Bibliothèque des sciences humaines), Paris: Gallimard.\nTranslated as <em>The Logic of Life: A History of Heredity</em>, Betty\nE. Spillmann (trans.), New York: Pantheon Books, 1973.",
                "Jacob, François and Jacques Monod, 1961a, “On the\nRegulation of Gene Activity”, <em>Cold Spring Harbor Symposia on\nQuantitative Biology</em>, 26: 193–211.\ndoi:10.1101/SQB.1961.026.01.024",
                "–––, 1961b, “Genetic Regulatory Mechanisms\nin the Synthesis of Proteins”, <em>Journal of Molecular\nBiology</em>, 3(3): 318–356.\ndoi:10.1016/S0022-2836(61)80072-7",
                "Jaeger, Johannes, David Irons, and Nick Monk, 2008,\n“Regulative Feedback in Pattern Formation: Towards a General\nRelativistic Theory of Positional Information”,\n<em>Development</em>, 135(19): 3175–3183.\ndoi:10.1242/dev.018697",
                "Jaeger, Johannes and James Sharpe, 2014, “On the Concept of\nMechanism in Development”, in Minelli and Pradeu 2014a:\n56–78 (chap. 4).",
                "Judson, Horace Freeland, 1979, <em>The Eighth Day of Creation:\nMakers of the Revolution in Biology</em>, New York: Simon and\nSchuster.",
                "Keller, Evelyn Fox, 1983, “The Force of the Pacemaker\nConcept in Theories of Aggregation in Cellular Slime Mold”,\n<em>Perspectives in Biology and Medicine</em>, 26(4): 515–521.\ndoi:10.1353/pbm.1983.0049",
                "–––, 2002, <em>Making Sense of Life: Explaining\nBiological Development with Models, Metaphors, and Machines</em>,\nCambridge, MA: Harvard University Press.",
                "Kondo, Shigeru and Takashi Miura, 2010, “Reaction-Diffusion\nModel as a Framework for Understanding Biological Pattern\nFormation”, <em>Science</em>, 329(5999): 1616–1620.\ndoi:10.1126/science.1179047",
                "Laubichler, Manfred D. and Günter P. Wagner, 2001, “How\nMolecular Is Molecular Developmental Biology? A Reply to Alex\nRosenberg’s ‘Reductionism Redux: Computing the\nEmbryo’”, <em>Biology &amp; Philosophy</em>, 16(1):\n53–68. doi:10.1023/A:1006750126784",
                "Lennox, James G. (ed.), 2001, <em>Aristotle: On the Parts of\nAnimals I–IV</em>, Oxford: Clarendon Press.",
                "Lenoir, Timothy, 1982, <em>The Strategy of Life: Teleology and\nMechanics in Nineteenth Century German Biology</em>, Dordrecht,\nHolland: D. Reidel Publishing Company. doi:10.1007/978-94-009-6951-3",
                "Lillie, Frank R., 1927, “The Gene and the Ontogenetic\nProcess”, <em>Science</em>, 66(1712): 361–368.\ndoi:10.1126/science.66.1712.361",
                "Maienschein, Jane, 1991a, “T.H. Morgan’s Regeneration,\nEpigenesis, and (W)Holism”, in <em>A History of Regeneration\nResearch: Milestones in the Evolution of a Science</em>, Charles E.\nDinsmore (ed.), Cambridge/New York: Cambridge University Press,\n133–149.",
                "–––, 1991b, “The Origins of\nEntwicklungsmechanik,” in Scott Gilbert, editor, <em>A\nConceptual History of Modern Developmental Biology</em>, New York:\nPlenum Press, 43–61.",
                "–––, 2000, “Competing Epistemologies and\nDevelopmental Biology”, in <em>Biology and Epistemology</em>,\nRichard Creath and Jane Maienschein (eds.), Cambridge/New York:\nCambridge University Press, 122–137.",
                "–––, 2003, <em>Whose View of Life? Embryos,\nCloning, and Stem Cells</em>, Cambridge, MA: Harvard University\nPress.",
                "Maienschein, Jane and Kate MacCord, 2022, <em>What is\nRegeneration?</em>, Chicago: University of Chicago Press.",
                "McLaren, Anne, 2000, “Cloning: Pathways to a Pluripotent\nFuture”, <em>Science</em>, 288(5472): 1775–1780.\ndoi:10.1126/science.288.5472.1775",
                "Meinhardt, Hans, 1982, <em>Models of Biological Pattern\nFormation</em>, London/New York: Academic Press.",
                "Minelli, Alessandro, 2009, <em>Perspectives in Animal Phylogeny\nand Evolution</em>, (Oxford Biology), Oxford/New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198566205.001.0001",
                "–––, 2014, “Developmental\nDisparity”, in Minelli and Pradeu 2014a: 227–245 (chap.\n15).",
                "Minelli, Alessandro and Thomas Pradeu (eds.), 2014a, <em>Towards a\nTheory of Development</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199671427.001.0001",
                "–––, 2014b, “Theories of Development in\nBiology—Problems and Perspectives”, in Minelli and Pradeu\n2014a: 1–14. doi:10.1093/acprof:oso/9780199671427.003.0001",
                "Monod, Jacques, 1970 [1971], <em>Le hasard et la\nnécessité: essai sur la philosophie naturelle de la\nbiologie moderne</em>, Paris: Éditions du Seuil. Translated as\n<em>Chance and Necessity: An Essay on the Natural Philosophy of Modern\nBiology</em>, Austryn Wainhouse (trans.), New York: Knopf.",
                "Morange, Michel, 2000, “The Developmental Gene Concept:\nHistory and Limits”, in Beurton, Falk, and Rheinberger 2000:\n193–216. doi:10.1017/CBO9780511527296.011",
                "Morgan, Thomas Hunt, 1901, “Regeneration in the Egg, Embryo,\nand Adult”, <em>The American Naturalist</em>, 35(420):\n949–973. doi:10.1086/278049",
                "–––, 1908, letter to his friend Ross Harrison in\n1908 that embryology was his field, Harrison Papers, Yale University\nArchives.",
                "–––, 1910a, “Chromosomes and\nHeredity”, <em>The American Naturalist</em>, 44(524):\n449–496.",
                "–––, 1910b, “Sex Limited Inheritance in\n<em>Drosophila</em>”, <em>Science</em>, 32(812): 120–122.\ndoi:10.1126/science.32.812.120",
                "–––, 1934, <em>Embryology and Genetics</em>, New\nYork: Columbia University Press.",
                "Müller, Gerd B. and Stuart A. Newman (eds.), 2003,\n<em>Origination of Organismal Form: Beyond the Gene in Developmental\nand Evolutionary Biology</em>, Cambridge, MA: The MIT Press.\ndoi:10.7551/mitpress/5182.001.0001",
                "Murray, James D., 1989, <em>Mathematical Biology</em>, Berlin:\nSpringer Verlag.",
                "Needham, Joseph, 1936, <em>Order and Life</em>, (Terry Lectures),\nNew Haven, CT: Yale University Press.",
                "–––, 1951, “Biochemical Aspects of Form\nand Growth”, in <em>Aspects of Form</em>, L.L. Whyte (ed.), New\nYork: Pellegrini and Cudahy, 77–-90.",
                "Newman, Stuart A., 2003, “From Physics to Development: The\nEvolution of Morphogenetic Mechanisms”, in Müller and\nNewman 2003: 221–239 (chap. 13).\ndoi:10.7551/mitpress/5182.003.0019",
                "–––, 2014, “Physico-Genetics of\nMorphogenesis: The Hybrid Nature of Developmental Mechanisms”,\nin Minelli and Pradeu 2014a: 95–113 (chap. 6).",
                "Nicoglou, Antonine, 2018, “Waddington’s Epigenetics or\nthe Pictorial Meetings of Development and Genetics”, <em>History\nand Philosophy of the Life Sciences</em>, 40(4): article 61.\ndoi:10.1007/s40656-018-0228-8",
                "Nicoglou, Antonine and Francesca Merlin, 2017, “Epigenetics:\nA Way to Bridge the Gap between Biological Fields”, <em>Studies\nin History and Philosophy of Science Part C: Studies in History and\nPhilosophy of Biological and Biomedical Sciences</em>, 66:\n73–82. doi:10.1016/j.shpsc.2017.10.002",
                "Nicoglou, Antonine and Charles T. Wolfe, 2018,\n“Introduction: Sketches of a Conceptual History of\nEpigenesis”, <em>History and Philosophy of the Life\nSciences</em>, 40(4): art. 64. doi:10.1007/s40656-018-0230-1",
                "Olby, Robert Cecil, 1974, <em>The Path to the Double Helix: The\nDiscovery of DNA</em>, Seattle, WA: University of Washington\nPress.",
                "Oppenheimer, Jane M., 1967, <em>Essays in the History of\nEmbryology and Biology</em>, Cambridge, MA: MIT Press.",
                "Oyama, Susan, 1985 [2000a], <em>The Ontogeny of Information:\nDevelopmental Systems and Evolution</em>, Cambridge/New York:\nCambridge University Press. Second revised and expanded edition,\nDurham, NC: Duke University Press, 2000.",
                "–––, 2000b, <em>Evolution’s Eye: A Systems\nView of the Biology-Culture Divide</em>, (Science and Cultural\nTheory), Durham, NC: Duke University Press.",
                "Oyama, Susan, Paul E. Griffiths, and Russell D. Gray, 2001,\n“Introduction: What Is Developmental Systems Theory?”, in\n<em>Cycles of Contingency: Developmental Systems and Evolution</em>,\nSusan Oyama, Paul E. Griffiths, and Russell D. Gray (eds.), (Life and\nMind), Cambridge, MA: MIT Press, 1–11.",
                "Pinto-Correia, Clara, 1997, <em>The Ovary of Eve: Egg and Sperm\nand Preformation</em>, Chicago: University of Chicago Press.",
                "Pradeu, Thomas, Lucie Laplane, Michel Morange, Antonine Nicoglou,\nand Michel Vervoort, 2011, “The Boundaries of\nDevelopment”, <em>Biological Theory</em>, 6(1): 1–3.\ndoi:10.1007/s13752-011-0001-7",
                "Robert, Jason Scott, 2004, <em>Embryology, Epigenesis, and\nEvolution: Taking Development Seriously</em>, (Cambridge Studies in\nPhilosophy and Biology), Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511498541",
                "Roe, Shirley A., 1981, <em>Matter, Life, and Generation:\nEighteenth-Century Embryology and the Haller-Wolff Debate</em>,\nCambridge/New York: Cambridge University Press.",
                "Rosenberg, Alex, 1997, “Reductionism Redux: Computing the\nEmbryo”, <em>Biology &amp; Philosophy</em>, 12(4):\n445–470. doi:10.1023/A:1006574719901",
                "Roux, Wilhelm, 1888, “Beiträge zur\nEntwickelungsmechanik des Embryo. Über die künstliche\nHervorbringung halber Embryonen durch Zerstörung einer der beiden\nersten Furchungskugeln, sowie über die Nachentwickelung\n(Postgeneration) der fehlenden Körperhälfte”,\n<em>Virchows Archiv</em>, 114: 113–153. Translated by Hans\nLaufer as “Contributions to the Developmental Mechanics of the\nEmbryo. On the Artificial Production of Half-Embryos by Destruction of\nOne of the First Two Blastomeres, and the Later Development\n(Postgeneration) of the Missing Half of the Body,” in Willier\nand Oppenheimer 1964: 2–37.",
                "Salazar-Ciudad, I., S. A. Newman, and R. V. Solé, 2001,\n“Phenotypic and Dynamical Transitions in Model Genetic Networks\nI. Emergence of Patterns and Genotype-Phenotype Relationships”,\n<em>Evolution and Development</em>, 3(2): 84–94.\ndoi:10.1046/j.1525-142x.2001.003002084.x",
                "Saunders, Paul, 2013, “Introduction: Alan Turing’s\nWork in Biology”, in S. B. Cooper and van Leeuwen 2013:\n683–684.",
                "Schrödinger, Erwin, 1944, <em>What Is Life? The Physical\nAspect of the Living Cell</em>, Cambridge: Cambridge University\nPress.",
                "Shamblott, Michael J., Joyce Axelman, Shunping Wang, Elizabeth M.\nBugg, John W. Littlefield, Peter J. Donovan, Paul D. Blumenthal,\nGeorge R. Huggins, and John D. Gearhart, 1998, “Derivation of\nPluripotent Stem Cells from Cultured Human Primordial Germ\nCells”, <em>Proceedings of the National Academy of\nSciences</em>, 95(23): 13726–13731.\ndoi:10.1073/pnas.95.23.13726",
                "Spemann, Hans, 1936 [1938], <em>Experimentelle Beiträge zu\neiner Theorie der Entwicklung</em>, Berlin: Verlag von Julius\nSpringer. Given as the 1933 Silliman Memorial Lectures at Yale.\nTranslated as <em>Embryonic Development and Induction</em>, New Haven,\nCT: Yale University Press, 1938.",
                "Takahashi, Kazutoshi, and Shinya Yamanaka, 2006, “Induction\nof pluripotent stem cells from mouse embryonic and adult fibroblast\ncultures by defined factors.” Cell 126: 663–76. doi:\n10.1016/j.cell.2006.07.024",
                "Thompson, D’Arcy Wentworth, 1917, <em>On Growth and\nForm</em>, Cambridge: Cambridge University Press.",
                "Thomson, James A., Joseph Itskovitz-Eldor, Sander S. Shapiro,\nMichelle A. Waknitz, Jennifer J. Swiergiel, Vivienne S. Marshall, and\nJeffrey M. Jones, 1998, “Embryonic Stem Cell Lines Derived from\nHuman Blastocysts”, <em>Science</em>, 282(5391):\n1145–1147. doi:10.1126/science.282.5391.1145",
                "Turing, Alan Mathison, 1952, “The Chemical Basis of\nMorphogenesis”, <em>Philosophical Transactions of the Royal\nSociety of London. Series B, Biological Sciences</em>, 237(641):\n37–72. doi:10.1098/rstb.1952.0012",
                "Van Speybroeck, Linda, Dani De Waele, and Gertrudis Van de Vijver,\n2002, “Theories in Early Embryology: Close Connections between\nEpigenesis, Preformationism, and Self-Organization”, <em>Annals\nof the New York Academy of Sciences</em>, 981: 7–49.",
                "Waddington, Conrad H., 1939, <em>An Introduction to Modern\nGenetics</em>, New York: The Macmillian Company.",
                "–––, 1940, <em>Organisers and Genes</em>,\nCambridge: Cambridge University Press.",
                "–––, 1942, “The Epigenotype”,\n<em>Endeavour</em>, 1: 18–20.",
                "–––, 1956, <em>Principles of Embryology</em>,\nNew York: Macmillan.",
                "–––, 1957, <em>The Strategy of the Genes: A\nDiscussion of Some Aspects of Theoretical Biology</em>, New York:\nMacmillan.",
                "––– (ed.), 1968, <em>Towards a Theoretical\nBiology: An IUBS Symposium</em>, Chicago: Aldine Publishing.",
                "Wang, Jin, Li Xu, Erkang Wang, and Sui Huang, 2010, “The\nPotential Landscape of Genetic Circuits Imposes the Arrow of Time in\nStem Cell Differentiation”, <em>Biophysical Journal</em>, 99(1):\n29–39. doi:10.1016/j.bpj.2010.03.058",
                "Weber, Marcel, 2022, <em>Philosophy of Developmental Biology</em>\n(Elements in the Philosophy of Biology), Cambridge: Cambridge\nUniversity Press. doi:10.1017/9781108954181",
                "Weismann, August, 1892 [1893], <em>Das Keimplasma: eine theorie\nder Vererbung</em>, Jena: G. Fischer. Translated as <em>The\nGerm-Plasm: A Theory of Heredity</em>, W. Newton Parker and Harriet\nRönnfeldt (trans.), New York: Scribner’s, 1893.",
                "Weiss, Paul A., 1939, <em>Principles of Development: A Text in\nExperimental Embryology. Print</em>, New York: H. Holt and Co.",
                "–––, 1968, <em>Dynamics of Development:\nExperiments and Inferences: Selected Papers on Developmental\nBiology</em>, New York: Academic Press.",
                "Wheeler, William Morton, 1899, “Caspar Friedrich Wolff and\nthe Theoria Generationis”, <em>Biological Lectures from the\nMarine Biological Laboratory, Wood’s Holl, Mass</em>, 1898:\n265–284.\n [<a href=\"https://hdl.handle.net/1912/22017\" target=\"other\">Wheeler 1899 available online</a>]",
                "Willier, Benjamin H. and Jane M. Oppenheimer (eds), 1964,\n<em>Foundations of Experimental Embryology</em>, Englewood Cliffs, NJ:\nPrentice-Hall.",
                "Wilmut, Ian, Angelica E. Schnieke, Jim McWhir, Alex J. Kind, and\nKeith H. S. Campbell, 1997, “Viable offspring derived from fetal\nand adult mammalian cells.” Nature 385: 810–3.",
                "Wilmut, Ian, Keith Campbell, and Colin Tudge, 2000, <em>The Second\nCreation: The Age of Biological Control by the Scientists Who Cloned\nDolly</em>, London: Headline.",
                "Wolfe, Charles T., 2021, “Vitalism and the Metaphysics of\nLife: The Discreet Charm of Eighteenth-Century Vitalism”, in\n<em>Life and Death in Early Modern Philosophy</em>, Susan James (ed.),\nOxford: Oxford University Press, 292–314.\ndoi:10.1093/oso/9780192843616.003.0016",
                "Wolpert, Lewis, 1969, “Positional Information and the\nSpatial Pattern of Cellular Differentiation”, <em>Journal of\nTheoretical Biology</em>, 25(1): 1–47.\ndoi:10.1016/S0022-5193(69)80016-0",
                "–––, 1989, “Positional Information\nRevisited”, <em>Development</em>, 107(Supplement): 3–12.\ndoi:10.1242/dev.107.Supplement.3",
                "–––, 1994, “Do We Understand\nDevelopment?”, <em>Science</em>, 266(5185): 571–572.\ndoi:10.1126/science.7939707",
                "Wolpert, L. and J. H. Lewis, 1975, “Towards a Theory of\nDevelopment”, <em>Federation Proceedings</em>, 34(1):\n14–20.",
                "Vecchi, Davide and Isaac Hernández, 2014, “The\nEpistemological Resilience of the Concept of Morphogenetic\nField”, in Minelli and Pradeu 2014a: 79–94 (chap. 5).",
                "Vinci, Thomas C. and Jason Scott Robert, 2005, “Aristotle\nand Modern Genetics”, <em>Journal of the History of Ideas</em>,\n66(2): 201–221. doi:10.1353/jhi.2005.0041",
                "Zammito, John H., 2018, <em>The Gestation of German Biology:\nPhilosophy and Physiology from Stahl to Schelling</em>,\nChicago/London: The University of Chicago Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Agutter, Paul S., P. Colm Malone, and Denys N. Wheatley, 2000,\n“Diffusion Theory in Biology: A Relic of Mechanistic\nMaterialism”, <em>Journal of the History of Biology</em>, 33(1):\n71–111. doi:10.1023/A:1004745516972</li>\n<li>Aristotle, [GA] <em>De Generatione Animalium</em>. Translated as\n<em>Generation of Animals</em>, Greek and English, A. L. Peck\n(trans.), (Loeb Classical Library 366), Cambridge, MA: Harvard\nUniversity Press, 1979.</li>\n<li>Baedke, Jan, 2013, “The Epigenetic Landscape in the Course\nof Time: Conrad Hal Waddington’s Methodological Impact on the\nLife Sciences”, <em>Studies in History and Philosophy of Science\nPart C: Studies in History and Philosophy of Biological and Biomedical\nSciences</em>, 44(4): 756–773.\ndoi:10.1016/j.shpsc.2013.06.001</li>\n<li>–––, 2018, <em>Above the Gene, beyond Biology:\nToward a Philosophy of Epigenetics</em>, Pittsburgh, PA: University of\nPittsburgh Press.</li>\n<li>Bard, Jonathan, 2011, “A Systems Biology Representation of\nDevelopmental Anatomy”, <em>Journal of Anatomy</em>, 218(6):\n591–599. doi:10.1111/j.1469-7580.2011.01371.x</li>\n<li>–––, 2013, “Driving Developmental and\nEvolutionary Change: A Systems Biology View”, <em>Progress in\nBiophysics and Molecular Biology</em>, 111(2–3): 83–91.\ndoi:10.1016/j.pbiomolbio.2012.09.006</li>\n<li>Berestycki, Henri, 2013, “Alan Turing and Reaction-Diffusion\nEquations”, in S. B. Cooper and van Leeuwen 2013:\n723–732.</li>\n<li>von Bertalanffy, Ludwig von, 1928 [1933], <em>Kritische Theorie\nder Formenbildung</em>, Berlin: Gebruder Borntraeger. Translated as\n<em>Modern Theories of Development: An Introduction to Theoretical\nBiology</em>, J. H. Woodger (trans.), London: Oxford University Press,\n1933.</li>\n<li>Beurton, Peter J., Raphael Falk, and Hans-Jörg Rheinberger\n(eds.), 2000, <em>The Concept of the Gene in Development and\nEvolution: Historical and Epistemological Perspectives</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511527296</li>\n<li>Bonner, John Tyler, 1974, <em>On Development: The Biology of\nForm</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Bowler, Peter J., 1971, “Preformation and Pre-Existence in\nthe Seventeenth Century: A Brief Analysis”, <em>Journal of the\nHistory of Biology</em>, 4(2): 221–244.\ndoi:10.1007/BF00138311</li>\n<li>–––, 1975, “The Changing Meaning of\n‘Evolution’”, <em>Journal of the History of\nIdeas</em>, 36(1): 95–114. doi:10.2307/2709013</li>\n<li>Brandt, Christina, 2010, “The Metaphor of ‘Nuclear\nReprogramming’: 1970’s Cloning Research and Beyond”,\nin <em>Hereditary Hourglass. Genetics and Epigenetics,\n1868–2000</em>, Ana Barahona, Edna Suárez Díaz,\nand Hans-Jörg Rheinberger (eds.), Berlin: Max Planck Institute\nfor History of Science, 85–95.</li>\n<li>Briggs, Robert and Thomas J. King, 1952, “Transplantation of\nLiving Nuclei from Blastula Cells into Enucleated Frogs’\nEggs”, <em>Proceedings of the National Academy of Sciences</em>,\n38(5): 455–463. doi:10.1073/pnas.38.5.455</li>\n<li>Burian, Richard M., 2005, <em>The Epistemology of Development,\nEvolution, and Genetics</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511610271</li>\n<li>–––, 2014 “Foreword: A Philosopher’s\nView”, in Minelli and Pradeu 2014a: xi–xiii.</li>\n<li>Burian, Richard M. and Denis Thieffry (eds), 2000, <em>From\nEmbryology to Developmental Biology</em>, special issue of <em>History\nand Philosophy of the Life Sciences</em>, 22(3).</li>\n<li>Churchill, Frederick Barton, 1966, “Wilhelm Roux and a\nProgram for Embryology”, Ph.D. dissertation, Cambridge, MA:\nHarvard University.</li>\n<li>–––, 1973, “Chabry, Roux, and the\nexperimental method in nineteenth century embryology”, in\n<em>Foundations of the Scientific Method: the Nineteenth Century</em>,\nRonald N. Giere and Richard S. Westfall (eds), Bloomington, IN:\nIndiana University Press, 161–205.</li>\n<li>–––, 2015, <em>August Weismann: Development,\nHeredity, and Evolution</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Connell, Sophia M., 2016, <em>Aristotle on Female Animals: A Study\nof the “Generation of Animals”</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781316479766</li>\n<li>–––, 2020, “The Female Contribution to\nGeneration and Nutritive Soul in Aristotle’s Embryology”,\nin <em>Nutrition and Nutritive Soul in Aristotle and\nAristotelianism</em>, Giouli Korobili and Roberto Lo Presti (eds.),\nBerlin: De Gruyter, 63–84. doi:10.1515/9783110690552-006</li>\n<li>Cooper, Melinda, 2003, “Rediscovering the Immortal\nHydra : Stem Cells and the Question of Epigenesis”,\n<em>Configurations</em>, 11(1): 1–26.\ndoi:10.1353/con.2004.0010</li>\n<li>Cooper, S. Barry and Jan van Leeuwen (eds.), 2013, <em>Alan\nTuring: His Work and Impact</em>, Waltham, MA: Elsevier.\ndoi:10.1016/C2010-0-66380-2</li>\n<li>Crick, Francis, 1970, “Diffusion in Embryogenesis”,\n<em>Nature</em>, 225(5231): 420–422. doi:10.1038/225420a0</li>\n<li>Darwin, Charles, 1859, <em>On the Origin of Species</em>, London:\nJohn Murray.\n [<a href=\"http://darwin-online.org.uk/content/frameset?itemID=F373&amp;viewtype=text&amp;pageseq=442\" target=\"other\">Darwin 1859 available online</a>]</li>\n<li>Davidson, Eric H., 1968, <em>Gene Activity in Early\nDevelopment</em>, first edition, New York: Academic Press. Second\nedition, 1976; third edition, 1986.</li>\n<li>–––, 2001, <em>Genomic Regulatory Systems:\nDevelopment and Evolution</em>, San Diego, CA: Academic Press.</li>\n<li>–––, 2006, <em>The Regulatory Genome: Gene\nRegulatory Networks in Development and Evolution</em>, Burlington,\nMA ; San Diego: Academic Press.</li>\n<li>Davidson, Eric H. and Michael S. Levine, 2008, “Properties\nof Developmental Gene Regulatory Networks”, <em>Proceedings of\nthe National Academy of Sciences</em>, 105(51): 20063–20066.\ndoi:10.1073/pnas.0806007105</li>\n<li>Detlefsen, Karen, 2006, “Explanation and Demonstration in\nthe Haller-Wolff Debate”, in <em>The Problem of Animal\nGeneration in Early Modern Philosophy</em>, Justin E. H. Smith (ed.),\nCambridge: Cambridge University Press, 235–261.\ndoi:10.1017/CBO9780511498572.012</li>\n<li>Driesch, Hans, 1892 [1964], “Entwicklungsmechanische\nStudien. I. Der Werth der beiden ersten Furchungszellen in der\nEchinodermentwicklung. Experimentelle Erzeugen von Theil- und\nDoppelbildung”, <em>Zeitschrift für wissenschafliche\nZoologie</em>, 53: 160–178. Abridged translation as “The Potency\nof the First Two Cleavage Cells in Echinoderm Development.\nExperimental Production of Partial and Double Formations.” L.\nMezger, M. Hamburger, V. Hamburger, and T.S. Hall (trans.), in Willier\nand Oppenheimer 1964: 38–50.</li>\n<li>Driever, Wolfgang and Christiane Nüsslein-Volhard, 1988,\n“The <em>bicoid</em> Protein Determines Position in the\nDrosophila Embryo in a Concentration-Dependent Manner”,\n<em>Cell</em>, 54(1): 95–104.\ndoi:10.1016/0092-8674(88)90183-3</li>\n<li>Dröscher, Ariane, 2014, “Images of Cell Trees, Cell\nLines, and Cell Fates: The Legacy of Ernst Haeckel and August Weismann\nin Stem Cell Research”, <em>History and Philosophy of the Life\nSciences</em>, 36(2): 157–186.\ndoi:10.1007/s40656-014-0028-8</li>\n<li>Fagan, Melinda Bonnie, 2012, “Waddington Redux: Models and\nExplanation in Stem Cell and Systems Biology”, <em>Biology &amp;\nPhilosophy</em>, 27(2): 179–213.\ndoi:10.1007/s10539-011-9294-y</li>\n<li>–––, 2013a, <em>Philosophy of Stem Cell Biology:\nKnowledge in Flesh and Blood</em>, New York: Palgrave Macmillan.\ndoi:10.1057/9781137296023</li>\n<li>–––, 2013b, “The Stem Cell Uncertainty\nPrinciple”, <em>Philosophy of Science</em>, 80(5):\n945–957. doi:10.1086/674014</li>\n<li>–––, 2016, “Stem Cells and Systems Models:\nClashing Views of Explanation”, <em>Synthese</em>, 193(3):\n873–907. doi:10.1007/s11229-015-0776-3</li>\n<li>–––, 2017, “Stem Cell Lineages: Between\nCell and Organism”, <em>Ontologies of Living Beings</em> special\nissue of <em>Philosophy, Theory, and Practice in Biology</em>, 9:\narticle 6. doi:10.3998/ptb.6959004.0009.006</li>\n<li>Falcon, Andrea and David Lefebvre (eds.), 2017,\n<em>Aristotle’s “Generation of Animals”: A Critical\nGuide</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781316459386</li>\n<li>Farley, John, 1977, <em>The Spontaneous Generation Controversy\nfrom Descartes to Oparin</em>, Baltimore, MD: Johns Hopkins University\nPress.</li>\n<li>Forgacs, Gabor and Stuart Newman, 2005, <em>Biological Physics of\nthe Developing Embryo</em>, Cambridge/New York: Cambridge University\nPress.</li>\n<li>Fry, Iris, 2000, <em>The Emergence of Life on Earth: A Historical\nand Scientific Overview</em>, New Brunswick, NJ: Rutgers University\nPress.</li>\n<li>Fusco, Giuseppe, Roberto Carrer, and Emanuele Serrelli, 2014,\n“The Landscape Metaphor in Development”, in Minelli and\nPradeu 2014a: 114–128 (chap. 7).</li>\n<li>Gearhart, John, 1998, “New Potential for Human Embryonic\nStem Cells”, <em>Science</em>, 282(5391): 1061–1062.\ndoi:10.1126/science.282.5391.1061</li>\n<li>Gilbert, Scott F., 1991, “Epigenetic Landscaping:\nWaddington’s Use of Cell Fate Bifurcation Diagrams”,\n<em>Biology &amp; Philosophy</em>, 6(2): 135–154.\ndoi:10.1007/BF02426835</li>\n<li>–––, 2004, “Foreword”, in\n<em>Crystals, Fabrics, and Fields: Metaphors that Shape Embryos</em>,\nby Donna Jeanne Haraway, Berkeley, CA: North Atlantic Books, pages\nxi–xv.</li>\n<li>Gilbert, Scott F., John M. Opitz, and Rudolf A. Raff, 1996,\n“Resynthesizing Evolutionary and Developmental Biology”,\n<em>Developmental Biology</em>, 173(2): 357–372.\ndoi:10.1006/dbio.1996.0032</li>\n<li>Goodwin, Brian C., 1965, “Oscillatory Behavior in Enzymatic\nControl Processes”, <em>Advances in Enzyme Regulation</em>, 3:\n425–437. doi:10.1016/0065-2571(65)90067-1</li>\n<li>Goodwin, Brian C. and Lynn E. H. Trainor, 1985, “Tip and\nWhorl Morphogenesis in ‘Acetabularia’ by Calcium-Regulated\nStrain Fields”, <em>Journal of Theoretical Biology</em>, 117(1):\n79–106. doi:10.1016/S0022-5193(85)80165-X</li>\n<li>Griesemer, James R., 2000a, “Development, Culture, and the\nUnits of Inheritance”, <em>Philosophy of Science</em>, 67(S3):\nS348–S368. doi:10.1086/392831</li>\n<li>–––, 2000b, “Reproduction and the\nReduction of Genetics”, in Beurton, Falk, and Rheinberger 2000:\n240–285. doi:10.1017/CBO9780511527296.013</li>\n<li>–––, 2014a, “Reproduction and the\nScaffolded Development of Hybrids”, in <em>Developing Scaffolds\nin Evolution, Culture, and Cognition</em>, Linnda R. Caporael, James\nR. Griesemer, and William C. Wimsatt (eds.), Cambridge, MA: The MIT\nPress, 23–56. doi:10.7551/mitpress/9780262019552.003.0002</li>\n<li>–––, 2014b, “Reproduction and Scaffolded\nDevelopmental Processes: An Integrated Evolutionary Perspective”\nin Minelli and Pradeu 2014a: 183–202 (chap. 12).</li>\n<li>Griffiths, Paul E. and Robin D. Knight, 1998, “What Is the\nDevelopmentalist Challenge?”, <em>Philosophy of Science</em>,\n65(2): 253–258. doi:10.1086/392636</li>\n<li>Gurdon, J. B. and Alan Colman, 1999, “The Future of\nCloning”, <em>Nature</em>, 402(6763): 743–746.\ndoi:10.1038/45429</li>\n<li>Haeckel, Ernst, 1866, <em>Generelle Morphologie der Organismen :\nallgemeine Grundzüge der organischen Formen-Wissenschaft,\nmechanisch begründet durch die von Charles Darwin reformirte\nDescendenz-Theorie</em>, Berlin: G. Reimer.</li>\n<li>Haraway, Donna Jeanne, 1976 [2004], <em>Crystals, Fabrics, and\nFields: Metaphors of Organicism in Twentieth-Century Developmental\nBiology</em>, New Haven, CT: Yale University Press. Reprinted\nBerkeley, CA: North Atlantic Books, 2004.</li>\n<li>Harrison, Ross G., 1969, <em>Organization and Development of the\nEmbryo</em>, Sally Wilens (ed.), (Yale University. Mrs. Hepsa Ely\nSilliman Memorial Lectures), New Haven, CT: Yale University\nPress.</li>\n<li>Henry, Devin, 2017, “Aristotle on Epigenesis: Two Senses of\nEpigenesis”, in Falcon and Lefebvre 2017: 89–107.\ndoi:10.1017/9781316459386.007</li>\n<li>Hertwig, Oscar, 1894 [1900], <em>Zeit- und Streitfragen der\nBiologie</em>, 2 vols., Jena: Gustav Fischer. Translated as <em>The\nBiological Problem of Today: Preformation or Epigenesis? The Basis of\na Theory of Organic Development, by Professor Dr. Oscar Hertwig</em>,\nP. Chalmers Mitchell (trans.), New York: The Macmillan Company, 1900.\ndoi:10.5962/bhl.title.1492</li>\n<li>Hopwood, Nick, Rebecca Flemming, and Lauren Kassell (eds.), 2018,\n<em>Reproduction: Antiquity to the Present Day</em>, Cambridge:\nCambridge University Press.</li>\n<li>Jacob, François, 1970 [1973], <em>La logique du vivant: une\nhistoire de l’hérédité</em>,\n(Bibliothèque des sciences humaines), Paris: Gallimard.\nTranslated as <em>The Logic of Life: A History of Heredity</em>, Betty\nE. Spillmann (trans.), New York: Pantheon Books, 1973.</li>\n<li>Jacob, François and Jacques Monod, 1961a, “On the\nRegulation of Gene Activity”, <em>Cold Spring Harbor Symposia on\nQuantitative Biology</em>, 26: 193–211.\ndoi:10.1101/SQB.1961.026.01.024</li>\n<li>–––, 1961b, “Genetic Regulatory Mechanisms\nin the Synthesis of Proteins”, <em>Journal of Molecular\nBiology</em>, 3(3): 318–356.\ndoi:10.1016/S0022-2836(61)80072-7</li>\n<li>Jaeger, Johannes, David Irons, and Nick Monk, 2008,\n“Regulative Feedback in Pattern Formation: Towards a General\nRelativistic Theory of Positional Information”,\n<em>Development</em>, 135(19): 3175–3183.\ndoi:10.1242/dev.018697</li>\n<li>Jaeger, Johannes and James Sharpe, 2014, “On the Concept of\nMechanism in Development”, in Minelli and Pradeu 2014a:\n56–78 (chap. 4).</li>\n<li>Judson, Horace Freeland, 1979, <em>The Eighth Day of Creation:\nMakers of the Revolution in Biology</em>, New York: Simon and\nSchuster.</li>\n<li>Keller, Evelyn Fox, 1983, “The Force of the Pacemaker\nConcept in Theories of Aggregation in Cellular Slime Mold”,\n<em>Perspectives in Biology and Medicine</em>, 26(4): 515–521.\ndoi:10.1353/pbm.1983.0049</li>\n<li>–––, 2002, <em>Making Sense of Life: Explaining\nBiological Development with Models, Metaphors, and Machines</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Kondo, Shigeru and Takashi Miura, 2010, “Reaction-Diffusion\nModel as a Framework for Understanding Biological Pattern\nFormation”, <em>Science</em>, 329(5999): 1616–1620.\ndoi:10.1126/science.1179047</li>\n<li>Laubichler, Manfred D. and Günter P. Wagner, 2001, “How\nMolecular Is Molecular Developmental Biology? A Reply to Alex\nRosenberg’s ‘Reductionism Redux: Computing the\nEmbryo’”, <em>Biology &amp; Philosophy</em>, 16(1):\n53–68. doi:10.1023/A:1006750126784</li>\n<li>Lennox, James G. (ed.), 2001, <em>Aristotle: On the Parts of\nAnimals I–IV</em>, Oxford: Clarendon Press.</li>\n<li>Lenoir, Timothy, 1982, <em>The Strategy of Life: Teleology and\nMechanics in Nineteenth Century German Biology</em>, Dordrecht,\nHolland: D. Reidel Publishing Company. doi:10.1007/978-94-009-6951-3</li>\n<li>Lillie, Frank R., 1927, “The Gene and the Ontogenetic\nProcess”, <em>Science</em>, 66(1712): 361–368.\ndoi:10.1126/science.66.1712.361</li>\n<li>Maienschein, Jane, 1991a, “T.H. Morgan’s Regeneration,\nEpigenesis, and (W)Holism”, in <em>A History of Regeneration\nResearch: Milestones in the Evolution of a Science</em>, Charles E.\nDinsmore (ed.), Cambridge/New York: Cambridge University Press,\n133–149.</li>\n<li>–––, 1991b, “The Origins of\nEntwicklungsmechanik,” in Scott Gilbert, editor, <em>A\nConceptual History of Modern Developmental Biology</em>, New York:\nPlenum Press, 43–61.</li>\n<li>–––, 2000, “Competing Epistemologies and\nDevelopmental Biology”, in <em>Biology and Epistemology</em>,\nRichard Creath and Jane Maienschein (eds.), Cambridge/New York:\nCambridge University Press, 122–137.</li>\n<li>–––, 2003, <em>Whose View of Life? Embryos,\nCloning, and Stem Cells</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Maienschein, Jane and Kate MacCord, 2022, <em>What is\nRegeneration?</em>, Chicago: University of Chicago Press.</li>\n<li>McLaren, Anne, 2000, “Cloning: Pathways to a Pluripotent\nFuture”, <em>Science</em>, 288(5472): 1775–1780.\ndoi:10.1126/science.288.5472.1775</li>\n<li>Meinhardt, Hans, 1982, <em>Models of Biological Pattern\nFormation</em>, London/New York: Academic Press.</li>\n<li>Minelli, Alessandro, 2009, <em>Perspectives in Animal Phylogeny\nand Evolution</em>, (Oxford Biology), Oxford/New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198566205.001.0001</li>\n<li>–––, 2014, “Developmental\nDisparity”, in Minelli and Pradeu 2014a: 227–245 (chap.\n15).</li>\n<li>Minelli, Alessandro and Thomas Pradeu (eds.), 2014a, <em>Towards a\nTheory of Development</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199671427.001.0001</li>\n<li>–––, 2014b, “Theories of Development in\nBiology—Problems and Perspectives”, in Minelli and Pradeu\n2014a: 1–14. doi:10.1093/acprof:oso/9780199671427.003.0001</li>\n<li>Monod, Jacques, 1970 [1971], <em>Le hasard et la\nnécessité: essai sur la philosophie naturelle de la\nbiologie moderne</em>, Paris: Éditions du Seuil. Translated as\n<em>Chance and Necessity: An Essay on the Natural Philosophy of Modern\nBiology</em>, Austryn Wainhouse (trans.), New York: Knopf.</li>\n<li>Morange, Michel, 2000, “The Developmental Gene Concept:\nHistory and Limits”, in Beurton, Falk, and Rheinberger 2000:\n193–216. doi:10.1017/CBO9780511527296.011</li>\n<li>Morgan, Thomas Hunt, 1901, “Regeneration in the Egg, Embryo,\nand Adult”, <em>The American Naturalist</em>, 35(420):\n949–973. doi:10.1086/278049</li>\n<li>–––, 1908, letter to his friend Ross Harrison in\n1908 that embryology was his field, Harrison Papers, Yale University\nArchives.</li>\n<li>–––, 1910a, “Chromosomes and\nHeredity”, <em>The American Naturalist</em>, 44(524):\n449–496.</li>\n<li>–––, 1910b, “Sex Limited Inheritance in\n<em>Drosophila</em>”, <em>Science</em>, 32(812): 120–122.\ndoi:10.1126/science.32.812.120</li>\n<li>–––, 1934, <em>Embryology and Genetics</em>, New\nYork: Columbia University Press.</li>\n<li>Müller, Gerd B. and Stuart A. Newman (eds.), 2003,\n<em>Origination of Organismal Form: Beyond the Gene in Developmental\nand Evolutionary Biology</em>, Cambridge, MA: The MIT Press.\ndoi:10.7551/mitpress/5182.001.0001</li>\n<li>Murray, James D., 1989, <em>Mathematical Biology</em>, Berlin:\nSpringer Verlag.</li>\n<li>Needham, Joseph, 1936, <em>Order and Life</em>, (Terry Lectures),\nNew Haven, CT: Yale University Press.</li>\n<li>–––, 1951, “Biochemical Aspects of Form\nand Growth”, in <em>Aspects of Form</em>, L.L. Whyte (ed.), New\nYork: Pellegrini and Cudahy, 77–-90.</li>\n<li>Newman, Stuart A., 2003, “From Physics to Development: The\nEvolution of Morphogenetic Mechanisms”, in Müller and\nNewman 2003: 221–239 (chap. 13).\ndoi:10.7551/mitpress/5182.003.0019</li>\n<li>–––, 2014, “Physico-Genetics of\nMorphogenesis: The Hybrid Nature of Developmental Mechanisms”,\nin Minelli and Pradeu 2014a: 95–113 (chap. 6).</li>\n<li>Nicoglou, Antonine, 2018, “Waddington’s Epigenetics or\nthe Pictorial Meetings of Development and Genetics”, <em>History\nand Philosophy of the Life Sciences</em>, 40(4): article 61.\ndoi:10.1007/s40656-018-0228-8</li>\n<li>Nicoglou, Antonine and Francesca Merlin, 2017, “Epigenetics:\nA Way to Bridge the Gap between Biological Fields”, <em>Studies\nin History and Philosophy of Science Part C: Studies in History and\nPhilosophy of Biological and Biomedical Sciences</em>, 66:\n73–82. doi:10.1016/j.shpsc.2017.10.002</li>\n<li>Nicoglou, Antonine and Charles T. Wolfe, 2018,\n“Introduction: Sketches of a Conceptual History of\nEpigenesis”, <em>History and Philosophy of the Life\nSciences</em>, 40(4): art. 64. doi:10.1007/s40656-018-0230-1</li>\n<li>Olby, Robert Cecil, 1974, <em>The Path to the Double Helix: The\nDiscovery of DNA</em>, Seattle, WA: University of Washington\nPress.</li>\n<li>Oppenheimer, Jane M., 1967, <em>Essays in the History of\nEmbryology and Biology</em>, Cambridge, MA: MIT Press.</li>\n<li>Oyama, Susan, 1985 [2000a], <em>The Ontogeny of Information:\nDevelopmental Systems and Evolution</em>, Cambridge/New York:\nCambridge University Press. Second revised and expanded edition,\nDurham, NC: Duke University Press, 2000.</li>\n<li>–––, 2000b, <em>Evolution’s Eye: A Systems\nView of the Biology-Culture Divide</em>, (Science and Cultural\nTheory), Durham, NC: Duke University Press.</li>\n<li>Oyama, Susan, Paul E. Griffiths, and Russell D. Gray, 2001,\n“Introduction: What Is Developmental Systems Theory?”, in\n<em>Cycles of Contingency: Developmental Systems and Evolution</em>,\nSusan Oyama, Paul E. Griffiths, and Russell D. Gray (eds.), (Life and\nMind), Cambridge, MA: MIT Press, 1–11.</li>\n<li>Pinto-Correia, Clara, 1997, <em>The Ovary of Eve: Egg and Sperm\nand Preformation</em>, Chicago: University of Chicago Press.</li>\n<li>Pradeu, Thomas, Lucie Laplane, Michel Morange, Antonine Nicoglou,\nand Michel Vervoort, 2011, “The Boundaries of\nDevelopment”, <em>Biological Theory</em>, 6(1): 1–3.\ndoi:10.1007/s13752-011-0001-7</li>\n<li>Robert, Jason Scott, 2004, <em>Embryology, Epigenesis, and\nEvolution: Taking Development Seriously</em>, (Cambridge Studies in\nPhilosophy and Biology), Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511498541</li>\n<li>Roe, Shirley A., 1981, <em>Matter, Life, and Generation:\nEighteenth-Century Embryology and the Haller-Wolff Debate</em>,\nCambridge/New York: Cambridge University Press.</li>\n<li>Rosenberg, Alex, 1997, “Reductionism Redux: Computing the\nEmbryo”, <em>Biology &amp; Philosophy</em>, 12(4):\n445–470. doi:10.1023/A:1006574719901</li>\n<li>Roux, Wilhelm, 1888, “Beiträge zur\nEntwickelungsmechanik des Embryo. Über die künstliche\nHervorbringung halber Embryonen durch Zerstörung einer der beiden\nersten Furchungskugeln, sowie über die Nachentwickelung\n(Postgeneration) der fehlenden Körperhälfte”,\n<em>Virchows Archiv</em>, 114: 113–153. Translated by Hans\nLaufer as “Contributions to the Developmental Mechanics of the\nEmbryo. On the Artificial Production of Half-Embryos by Destruction of\nOne of the First Two Blastomeres, and the Later Development\n(Postgeneration) of the Missing Half of the Body,” in Willier\nand Oppenheimer 1964: 2–37.</li>\n<li>Salazar-Ciudad, I., S. A. Newman, and R. V. Solé, 2001,\n“Phenotypic and Dynamical Transitions in Model Genetic Networks\nI. Emergence of Patterns and Genotype-Phenotype Relationships”,\n<em>Evolution and Development</em>, 3(2): 84–94.\ndoi:10.1046/j.1525-142x.2001.003002084.x</li>\n<li>Saunders, Paul, 2013, “Introduction: Alan Turing’s\nWork in Biology”, in S. B. Cooper and van Leeuwen 2013:\n683–684.</li>\n<li>Schrödinger, Erwin, 1944, <em>What Is Life? The Physical\nAspect of the Living Cell</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Shamblott, Michael J., Joyce Axelman, Shunping Wang, Elizabeth M.\nBugg, John W. Littlefield, Peter J. Donovan, Paul D. Blumenthal,\nGeorge R. Huggins, and John D. Gearhart, 1998, “Derivation of\nPluripotent Stem Cells from Cultured Human Primordial Germ\nCells”, <em>Proceedings of the National Academy of\nSciences</em>, 95(23): 13726–13731.\ndoi:10.1073/pnas.95.23.13726</li>\n<li>Spemann, Hans, 1936 [1938], <em>Experimentelle Beiträge zu\neiner Theorie der Entwicklung</em>, Berlin: Verlag von Julius\nSpringer. Given as the 1933 Silliman Memorial Lectures at Yale.\nTranslated as <em>Embryonic Development and Induction</em>, New Haven,\nCT: Yale University Press, 1938.</li>\n<li>Takahashi, Kazutoshi, and Shinya Yamanaka, 2006, “Induction\nof pluripotent stem cells from mouse embryonic and adult fibroblast\ncultures by defined factors.” Cell 126: 663–76. doi:\n10.1016/j.cell.2006.07.024</li>\n<li>Thompson, D’Arcy Wentworth, 1917, <em>On Growth and\nForm</em>, Cambridge: Cambridge University Press.</li>\n<li>Thomson, James A., Joseph Itskovitz-Eldor, Sander S. Shapiro,\nMichelle A. Waknitz, Jennifer J. Swiergiel, Vivienne S. Marshall, and\nJeffrey M. Jones, 1998, “Embryonic Stem Cell Lines Derived from\nHuman Blastocysts”, <em>Science</em>, 282(5391):\n1145–1147. doi:10.1126/science.282.5391.1145</li>\n<li>Turing, Alan Mathison, 1952, “The Chemical Basis of\nMorphogenesis”, <em>Philosophical Transactions of the Royal\nSociety of London. Series B, Biological Sciences</em>, 237(641):\n37–72. doi:10.1098/rstb.1952.0012</li>\n<li>Van Speybroeck, Linda, Dani De Waele, and Gertrudis Van de Vijver,\n2002, “Theories in Early Embryology: Close Connections between\nEpigenesis, Preformationism, and Self-Organization”, <em>Annals\nof the New York Academy of Sciences</em>, 981: 7–49.</li>\n<li>Waddington, Conrad H., 1939, <em>An Introduction to Modern\nGenetics</em>, New York: The Macmillian Company.</li>\n<li>–––, 1940, <em>Organisers and Genes</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1942, “The Epigenotype”,\n<em>Endeavour</em>, 1: 18–20.</li>\n<li>–––, 1956, <em>Principles of Embryology</em>,\nNew York: Macmillan.</li>\n<li>–––, 1957, <em>The Strategy of the Genes: A\nDiscussion of Some Aspects of Theoretical Biology</em>, New York:\nMacmillan.</li>\n<li>––– (ed.), 1968, <em>Towards a Theoretical\nBiology: An IUBS Symposium</em>, Chicago: Aldine Publishing.</li>\n<li>Wang, Jin, Li Xu, Erkang Wang, and Sui Huang, 2010, “The\nPotential Landscape of Genetic Circuits Imposes the Arrow of Time in\nStem Cell Differentiation”, <em>Biophysical Journal</em>, 99(1):\n29–39. doi:10.1016/j.bpj.2010.03.058</li>\n<li>Weber, Marcel, 2022, <em>Philosophy of Developmental Biology</em>\n(Elements in the Philosophy of Biology), Cambridge: Cambridge\nUniversity Press. doi:10.1017/9781108954181</li>\n<li>Weismann, August, 1892 [1893], <em>Das Keimplasma: eine theorie\nder Vererbung</em>, Jena: G. Fischer. Translated as <em>The\nGerm-Plasm: A Theory of Heredity</em>, W. Newton Parker and Harriet\nRönnfeldt (trans.), New York: Scribner’s, 1893.</li>\n<li>Weiss, Paul A., 1939, <em>Principles of Development: A Text in\nExperimental Embryology. Print</em>, New York: H. Holt and Co.</li>\n<li>–––, 1968, <em>Dynamics of Development:\nExperiments and Inferences: Selected Papers on Developmental\nBiology</em>, New York: Academic Press.</li>\n<li>Wheeler, William Morton, 1899, “Caspar Friedrich Wolff and\nthe Theoria Generationis”, <em>Biological Lectures from the\nMarine Biological Laboratory, Wood’s Holl, Mass</em>, 1898:\n265–284.\n [<a href=\"https://hdl.handle.net/1912/22017\" target=\"other\">Wheeler 1899 available online</a>]</li>\n<li>Willier, Benjamin H. and Jane M. Oppenheimer (eds), 1964,\n<em>Foundations of Experimental Embryology</em>, Englewood Cliffs, NJ:\nPrentice-Hall.</li>\n<li>Wilmut, Ian, Angelica E. Schnieke, Jim McWhir, Alex J. Kind, and\nKeith H. S. Campbell, 1997, “Viable offspring derived from fetal\nand adult mammalian cells.” Nature 385: 810–3.</li>\n<li>Wilmut, Ian, Keith Campbell, and Colin Tudge, 2000, <em>The Second\nCreation: The Age of Biological Control by the Scientists Who Cloned\nDolly</em>, London: Headline.</li>\n<li>Wolfe, Charles T., 2021, “Vitalism and the Metaphysics of\nLife: The Discreet Charm of Eighteenth-Century Vitalism”, in\n<em>Life and Death in Early Modern Philosophy</em>, Susan James (ed.),\nOxford: Oxford University Press, 292–314.\ndoi:10.1093/oso/9780192843616.003.0016</li>\n<li>Wolpert, Lewis, 1969, “Positional Information and the\nSpatial Pattern of Cellular Differentiation”, <em>Journal of\nTheoretical Biology</em>, 25(1): 1–47.\ndoi:10.1016/S0022-5193(69)80016-0</li>\n<li>–––, 1989, “Positional Information\nRevisited”, <em>Development</em>, 107(Supplement): 3–12.\ndoi:10.1242/dev.107.Supplement.3</li>\n<li>–––, 1994, “Do We Understand\nDevelopment?”, <em>Science</em>, 266(5185): 571–572.\ndoi:10.1126/science.7939707</li>\n<li>Wolpert, L. and J. H. Lewis, 1975, “Towards a Theory of\nDevelopment”, <em>Federation Proceedings</em>, 34(1):\n14–20.</li>\n<li>Vecchi, Davide and Isaac Hernández, 2014, “The\nEpistemological Resilience of the Concept of Morphogenetic\nField”, in Minelli and Pradeu 2014a: 79–94 (chap. 5).</li>\n<li>Vinci, Thomas C. and Jason Scott Robert, 2005, “Aristotle\nand Modern Genetics”, <em>Journal of the History of Ideas</em>,\n66(2): 201–221. doi:10.1353/jhi.2005.0041</li>\n<li>Zammito, John H., 2018, <em>The Gestation of German Biology:\nPhilosophy and Physiology from Stahl to Schelling</em>,\nChicago/London: The University of Chicago Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "developmental biology",
            "developmental biology: evolution and development",
            "genetics: molecular",
            "levels of organization in biology",
            "mechanism in science",
            "molecular biology",
            "replication and reproduction",
            "systems and synthetic biology, philosophy of"
        ],
        "entry_link": [
            {
                "../biology-developmental/": "developmental biology"
            },
            {
                "../evolution-development/": "developmental biology: evolution and development"
            },
            {
                "../molecular-genetics/": "genetics: molecular"
            },
            {
                "../levels-org-biology/": "levels of organization in biology"
            },
            {
                "../science-mechanisms/": "mechanism in science"
            },
            {
                "../molecular-biology/": "molecular biology"
            },
            {
                "../replication/": "replication and reproduction"
            },
            {
                "../systems-synthetic-biology/": "systems and synthetic biology, philosophy of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theories-biological-development\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/theories-biological-development/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=theories-biological-development&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/theories-biological-development/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=theories-biological-development": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/theories-biological-development/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=theories-biological-development&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/theories-biological-development/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}