{
    "url": "time",
    "title": "Time",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Nina Emery\n<emery@mtholyoke.edu>\nNed Markosian\n<markosian@umass.edu>\nMeghan Sullivan\n<sullivan.meghan@gmail.com>",
        "author_links": [
            {
                "https://www.mtholyoke.edu/directory/faculty-staff/nina-emery": "Nina Emery"
            },
            {
                "mailto:emery%40mtholyoke%2eedu": "emery@mtholyoke.edu"
            },
            {
                "http://www.umass.edu/philosophy/faculty/faculty-pages/markosian.htm": "Ned Markosian"
            },
            {
                "mailto:markosian%40umass%2eedu": "markosian@umass.edu"
            },
            {
                "https://philosophy.nd.edu/people/faculty/meghan-sullivan/": "Meghan Sullivan"
            },
            {
                "mailto:sullivan%2emeghan%40gmail%2ecom": "sullivan.meghan@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://www.mtholyoke.edu/directory/faculty-staff/nina-emery\" target=\"other\">Nina Emery</a>\n&lt;<a href=\"mailto:emery%40mtholyoke%2eedu\"><em>emery<abbr title=\" at \">@</abbr>mtholyoke<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://www.umass.edu/philosophy/faculty/faculty-pages/markosian.htm\" target=\"other\">Ned Markosian</a>\n&lt;<a href=\"mailto:markosian%40umass%2eedu\"><em>markosian<abbr title=\" at \">@</abbr>umass<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://philosophy.nd.edu/people/faculty/meghan-sullivan/\" target=\"other\">Meghan Sullivan</a>\n&lt;<a href=\"mailto:sullivan%2emeghan%40gmail%2ecom\"><em>sullivan<abbr title=\" dot \">.</abbr>meghan<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 25, 2002",
        "substantive revision Tue Nov 24, 2020"
    ],
    "preamble": "\n\nDiscussions of the nature of time, and of various issues related to\ntime, have always featured prominently in philosophy, but they have\nbeen especially important since the beginning of the twentieth\ncentury. This article contains a brief overview of some of the main\ntopics in the philosophy of time—(1) fatalism; (2) reductionism\nand Platonism with respect to time; (3) the topology of time; (4)\nMcTaggart’s argument; (5) the A-theory and the B-theory; (6)\npresentism, eternalism, and the growing block theory; (7) the 3D/4D\ndebate about persistence; (8) the dynamic and the static theory; (9)\nthe moving spotlight theory; (10) time travel; (11) time and physics\nand (12) time and rationality. We include some suggestions for further\nreading on each topic and a bibliography.\n\nNote: This entry does not discuss the consciousness, perception,\nexperience, or phenomenology of time. A historical overview and\ngeneral presentation of the various views is available in the entry on\n temporal consciousness.\n Further coverage can be found in the SEP entry on the\n experience and perception of time.\n For those interested specifically in phenomenological views, see the\nentries on\n Husserl\n (Section 6), and\n Heidegger\n (Section 2: Being and Time).\n",
    "toc": [
        {
            "#Fata": "1. Fatalism"
        },
        {
            "#ReduPlatRespTime": "2. Reductionism and Platonism with Respect to Time"
        },
        {
            "#TopoTime": "3. The Topology of Time"
        },
        {
            "#McTaArgu": "4. McTaggart’s Argument"
        },
        {
            "#TheoBTheo": "5. The A-Theory and the B-Theory"
        },
        {
            "#PresEterGrowBlocTheo": "6. Presentism, Eternalism, and the Growing Block Theory"
        },
        {
            "#ThreDimeFourDime": "7. Three-Dimensionalism and Four-Dimensionalism"
        },
        {
            "#DynaStatTheo": "8. The Dynamic and the Static Theory"
        },
        {
            "#MoviSpotTheo": "9. The Moving Spotlight Theory"
        },
        {
            "#TimeTrav": "10. Time Travel"
        },
        {
            "#TimePhys": "11. Time and Physics"
        },
        {
            "#TimeRati": "12. Time and Rationality"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Fatalism\n\nMany logical questions about time historically arose from questions\nabout freedom and determinism—in particular worries about\nfatalism. Fatalism can be understood as the doctrine that whatever\nwill happen in the future is already unavoidable (where to\nsay that an event is unavoidable is to say that no agent is able to\nprevent it from occurring). Here is a typical argument for\nfatalism:\n\n(1)\nThere are now propositions about everything that might happen in\nthe future.\n(2)\nEvery proposition is either true or else false.\n(3)\nIf (1) and (2), then there is now a set of true propositions that,\ntaken together, correctly predict everything that will happen in the\nfuture.\n(4)\nIf there is now a set of true propositions that, taken together,\ncorrectly predict everything that will happen in the future, then\nwhatever will happen in the future is already unavoidable.\n∴ (5)\nWhatever will happen in the future is already unavoidable.\n\n\nThe conclusion appears shocking. Future moral catastrophes are\nunavoidable. Every weighty decision that now feels up to you is\nalready determined.\n\nThe argument for fatalism makes some significant metaphysical\nassumptions that raise more general questions about logic, time, and\nagency.\n\nFor example, Premise (1) assumes that propositions describing the\nfuture do not come into or go out of existence. It assumes that there\nare propositions now that can accurately represent every future way\nthings might go. This is a non-trivial logical assumption. You might,\nfor instance, think that different times becoming present and actual\n(like perhaps possible worlds) have different associated sets of\npropositions that become present and actual.\n\nPremise (2) appears to be a fundamental principle of semantics,\nsometimes referred to as the Principle of Bivalence.\n\nThe rationale for premise (4) is that it appears no one is able to\nmake a true prediction turn out false. (4) assumes that one and the\nsame proposition does not change its truth value over time. The\nshockingness of the conclusion also depends on identifying meaningful\nagency with the capacity to make propositions come out true or\nfalse.\n\nA proper discussion of fatalism would include a lengthy consideration\nof premises (1) and (4), which make important assumptions about the\nnature of propositional content and the nature of agency. That would\ntake us beyond the scope of this article. For our purposes, it is\nimportant to note that many writers have been motivated by this kind\nof fatalist argument to deny (2), the Principle of Bivalence.\nAccording to this line, there are many propositions—namely,\npropositions about events that are both in the future and\ncontingent—that are neither true nor false right now. Consider\nthe proposition that you will have lunch tomorrow. Perhaps that\nproposition either has no truth value right now, or else has a third\ntruth value: indeterminate. When the relevant time comes, and you\neither have lunch or don’t, then the proposition will come to be\neither true or false, and from then on that proposition will forever\nretain that determinate truth value.\n\nThis strategy for rejecting fatalism is sometimes referred to as the\n“Open Future” response. The Open Future response\npresupposes that a proposition can have a truth value, but only\ntemporarily—truth values for complete propositions can change as\ntime passes and the world itself changes. This raises further\nquestions about the correct way to link up propositions, temporal\npassage and truth values. For example, which of the following formulas\nexpresses a genuine proposition about the present?\n\n\nTensed Proposition: “Sullivan is eating a burrito”.\n\nTenseless Proposition: “Sullivan eats a burrito at <insert\npresent time stamp>”.\n\n\nThe tensed proposition will no longer be true when Sullivan finishes\nher lunch. So it has, at best, a temporary truth value. The tenseless\nproposition expresses something like “Sullivan eats a burrito at\n3pm on July 20th 2019”. That proposition is always true.\n\nSome philosophers argue that only the latter, eternally true kind of\nproposition could make sense of how we use propositions to reason over\ntime. We need propositions to have stable truth values if we are to\nuse them as the contents of thoughts and communication. Other\nphilosophers—particularly those who believe that reality itself\nchanges over time—think that tensed propositions are needed to\naccurately reason about the world. We’ll return to these issues\nin\n Section 4\n and\n Section 5.\n\nSuggestions for Further Reading: Aristotle, De\nInterpretatione, Ch. 9; Barnes and Cameron 2009; Boethius,\nThe Consolation of Philosophy, Book V; Crisp 2007; Evans\n1985; Lewis 1986; Markosian 1995; McCall 1994; Miller 2005; Richard\n1981; Sullivan 2014; Taylor 1992; Torre 2011; Van Inwagen 1983.\n2. Reductionism and Platonism with Respect to Time\n\nWhat if one day things everywhere ground to a halt? What if birds\nfroze in mid-flight, people froze in mid-sentence, and planets and\nsubatomic particles alike froze in mid-orbit? What if all change,\nthroughout the entire universe, completely ceased for a period of,\nsay, one year? Is such a thing possible?\n\nIf the answer to this last question is “yes”—if it\nis possible for there to be time without change—then time is in\nsome important sense independent of the events within time. Other ways\nof investigating whether time is independent of the events within time\ninclude asking whether all of the physical processes that happen in\ntime could happen at a faster or slower rate, and asking whether all\nevents could have happened slightly earlier or later in time. After\nall, if every physical process could suddenly happen twice as fast, or\nif every event could take place slightly earlier or later in time,\nthen it follows that in some important sense time can remain the same\neven if the way that events are distributed in time changes\nwholesale.\n\nAristotle and Leibniz, among others, have argued that time is not\nindependent of the events that occur in time. This view is typically\ncalled either “reductionism with respect to time” or\n“relationism with respect to time”, since according to\nthis view, all talk that appears to be about time can somehow be\nreduced to talk about temporal relations among things and events. The\nopposing view, normally referred to either as “Platonism with\nrespect to time” or “substantivalism with respect to\ntime” or “absolutism with respect to time”, has been\ndefended by Plato, Newton, and others. On this view, time is like an\nempty container into which things and events may be placed; but it is\na container that is independent of what (if anything) is placed in\nit.\n\nAnother way to present this distinction is to say that those like\nPlato and Newton who think that time is independent of the events that\noccur in time believe in “absolute time”. Those like\nAristotle and Leibniz, who think that time is not independent of the\nevents that occur in time, deny the existence of absolute time, though\nthey still endorse “relative time”, where relative time is\nnothing over and above the temporal relations between events.\n\nThese views about time are closely connected to views about space and\nabout motion. Most obviously, these views about time have\nstraightforward spatial analogues—one may be a substantivalist\nabout space (and thus endorse the existence of absolute space in\naddition to spatial relations between things), or one may be a\nrelationist about space (and thus deny the existence of absolute\nspace). Substantivalism and relationism about time have traditionally\nbeen taken to stand or fall with their spatial counterparts. In\naddition, the choice between substantivalism and relationism about\nspace and time has consequences for your theory of motion. If you are\na relationist about space and time then you must also be a relationist\nabout motion: all motion is motion relative to something. If you are a\nsubstantivalist about space and time, you will endorse, in addition to\nrelative motion, the notion of absolute motion, where absolute motion\nis motion relative to absolute space and time. If you are a\nsubstantivalist, in addition to facts about whether and how fast a\ntrain car is moving relative to the track, whether and how fast it is\nmoving relative to the cars, and so on, there will also be a fact\nabout whether and how fast the train car is really\nmoving—whether and how fast it is moving relative to absolute\nspace and time.\n\nWhy would someone endorse the existence of absolute time? One reason\nis that the empty container metaphor has a lot of intuitive appeal.\nAnother reason is that some philosophers have thought that there must\nbe such a thing as absolute motion—as opposed to merely relative\nmotion—in order to explain certain physical phenomena, like the\nforces felt during acceleration. Newton had an especially famous\nargument along these lines involving a spinning bucket of\nwater—the entry on\n Newton’s views on space, time,\n and motion has a careful discussion of this argument.\n\nWhy would someone deny the existence of absolute time? Some\nrelationists have put forward arguments that are supposed to show that\nabsolute space and time are philosophically problematic in some\nimportant way. Perhaps most famously, Leibniz argued that the\nexistence of absolute space or time would lead to violations of the\nprinciple of sufficient reason and violations of the identity of\nindiscernibles.\n\nIn order to see why, consider two ways of describing the way things\ncould be. On the one hand, everything is as it actually is. On the\nother, every event happens one second later than it actually does, but\nis otherwise exactly the same. If there is such a thing as absolute\ntime then these two descriptions would pick out distinct possible\nworlds. But this, Leibniz claimed, would violate the principle of\nsufficient reason. For given that the actual world and the\none-second-late world are exactly the same except for where things are\nlocated in absolute time, there could not (at least according to\nLeibniz) be any reason why one exists rather than the other. Moreover,\nLeibniz claimed, the actual world and the one-second-late world are\nindistinguishable; so if they were in fact distinct possible worlds,\nthat would violate the principle that if two things are\nindistinguishable, then they are identical.\n\nLeibniz’s arguments are examples of arguments that attempt to\nidentify something philosophically problematic with absolute time and\nspace. Perhaps more generally, many philosophers have been moved by\nthe idea that even if absolute time and space are not problematic in a\nway that makes them unacceptable, they are still the kinds of things\nthat we should do without if we can. This kind of attitude can be\nmotivated by a straightforward kind of parsimony—we should\nalways make do with the fewest types of entities possible. Or it can\nbe motivated by a more specific worry about the nature of absolute\nspace and time. You might, for instance, be especially loath to\nadmit unobservable entities into your ontology—you are willing\nto admit them if you must, but you would rather eliminate them\nwherever possible. As absolute space and time are unobservable,\nsomeone who endorses this attitude will be inclined to think there are\nno such things.\n\nSuggestions for Further Reading: Alexander 1956;\nAriew 2000; Arntzenius 2012; Coope 2001; Mitchell 1993; Newton,\nPhilosophical Writings; Newton-Smith 1980; Shoemaker\n1969.\n3. The Topology of Time\n\nIt’s natural to think that time can be represented by a line.\nBut a line has a shape. What shape should we give to the line that\nrepresents time? This is a question about the topology, or structure,\nof time.\n\nOne natural way to answer our question is to say that time should be\nrepresented by a single, straight, non-branching, continuous line that\nextends without end in each of its two directions. This is the\n“standard topology” for time. But for each of the features\nattributed to time in the standard topology, two interesting questions\narise: (a) does time in fact have that feature? and (b) if time does\nhave the feature in question, is this a necessary or a contingent fact\nabout time?\n\nQuestions about the topology of time appear to be closely connected to\nthe issue of Platonism versus relationism with respect to time. For if\nrelationism is true, then it seems likely that time’s\ntopological features will depend on contingent facts about the\nrelations among things and events in the world, whereas if Platonism\nis true, so that time exists independently of whatever is in time,\nthen time will presumably have its topological properties as a matter\nof necessity. But even if we assume that Platonism is true, it’s\nnot clear exactly what topological properties should be attributed to\ntime.\n\nConsider the question of whether time should be represented by a line\nwithout a beginning (so a line, rather than a line segment). Aristotle\nhas argued (roughly) that time cannot have a beginning on the grounds\nthat in order for time to have a beginning, there must be a first\nmoment of time, but that in order to count as a moment of time, that\nallegedly first moment would have to come between an earlier period of\ntime and a later period of time, which is inconsistent with its being\nthe first moment of time. (Aristotle argues in the same way that time\ncannot have an end.)\n\nAristotle’s argument may or may not be a good one, but even if\nit is unsound, many people will feel, purely on intuitive grounds,\nthat the idea of time having a beginning (or an end) just does not\nmake sense. And here we have an excellent illustration of what is at\nstake in the controversy over whether time has its topological\nproperties as a contingent matter or as a matter of necessity. For\nsuppose we come to have excellent evidence that the universe itself\nhad a beginning in time. (This seems like the kind of thing that could\nbe supported by empirical evidence in cosmology.) This would still\nleave open the question of whether the beginning of the universe\noccurred after an infinitely long period of “empty” time,\nor, instead, coincided with the beginning of time itself. There are\ninteresting and plausible arguments for each of these positions.\n\nIt is also worth asking whether time must be represented by a single\nline. Perhaps we should take seriously the possibility of time’s\nconsisting of multiple time streams, each one of which is isolated\nfrom each other, so that every moment of time stands in temporal\nrelations to other moments in its own time stream, but does not bear\nany temporal relations to any moment from another time stream.\nLikewise we can ask whether time could correspond to a branching line\n(perhaps to allow for the possibility of time travel or to model an\nopen future), or to a closed loop, or to a discontinuous line. And we\ncan also wonder whether one of the two directions of time is in some\nway privileged, in a way that makes time itself asymmetrical. (We say\nmore about this last option in particular in the section on time and\nphysics.)\n\nSuggestions for Further Reading: (1) On the beginning\nand end of time: Aristotle, Physics, Bk.  VIII; Kant, The\nCritique of Pure Reason (especially pp.  75ff); Newton-Smith\n1980, Ch. V. (2) On the linearity of time: Newton-Smith 1980, Ch. III;\nSwinburne 1966, 1968. (3) On the direction of time: Price 1994, 1996;\nSavitt 1995; and Sklar 1974. (4) On all of these topics: Newton-Smith\n1980.\n4. McTaggart’s Argument\n\nIn a famous paper published in 1908, J.M.E. McTaggart argued that\nthere is in fact no such thing as time, and that the appearance of a\ntemporal order to the world is a mere appearance. Other philosophers\nbefore and since (including, especially, F.H. Bradley) have argued for\nthe same conclusion. We will focus here only on McTaggart’s\nargument against the reality of time, which has been by far the most\ninfluential.\n\nMcTaggart begins his argument by distinguishing two ways in which\npositions in time can be ordered. First, he says, positions in time\ncan be ordered according to their possession of properties like being\ntwo days future, being one day future, being present, being one day\npast, etc. These properties are often referred to now as\n“A properties” because McTaggart calls the series\nof times ordered by these properties “the A\nseries”. But he says that positions in time can also be ordered\nby two-place relations like two days earlier than, one day earlier\nthan, simultaneous with, etc. These relations are now often called\n“B relations” because McTaggart calls the series of\ntimes ordered by these relations “the B\nseries”.\n\nMcTaggart argues that the B series alone does not constitute a\nproper time series; the A series is essential to time. His\nreason for this is that he assumes change is essential to time, and\nthe B series without the A series does not involve\ngenuine change (since B series positions are forever\n“fixed”, whereas A series positions are constantly\nchanging).\n\nMcTaggart also argues that the A series is inherently\ncontradictory. For, he says, the different A properties are\nincompatible with one another. No time can be both future and past,\nfor example. Nevertheless, he insists, each time in the A\nseries must possess all of the different A properties, since a\ntime that is future will be present and then will be past. McTaggart\nconcludes that, since neither the A-series nor the B-series can order\nthe time series, time is unreal.\n\nOne response to this argument that McTaggart anticipates involves\nclaiming that it’s not true of any time, t, that t\nis both future and past. Rather, the objection goes, we must say that\nit was future at some moment of past time and will\nbe past at some moment of future time. But this objection fails,\naccording to McTaggart, because the additional times that are invoked\nin order to explain t’s possession of the incompatible\nA properties must themselves possess all of the same A\nproperties (as must any further times invoked on account of these\nadditional times, and so on ad infinitum). Thus, according to\nMcTaggart, we never resolve the original contradiction inherent in the\nA series, but, instead, merely generate an infinite regress of\nmore and more contradictions.\n\nMcTaggart’s argument has had staying power because it organizes\ncrucial debates about the metaphysics of temporal passage, because it\nhints at how those debates connect to further debates about where\nevidence for the time series and the nature of change come from, and\nbecause the difference between A-theoretic and B-theoretic approaches\nto the debate has continued in the intervening century.\n\nSuggestions for Further Reading: Bradley 1893; Dyke\n2002; McTaggart 1908; Mellor 1998; Prior 1967, 1968.\n5. The A-Theory and the B-Theory\n\nIn\n Section 1,\n we introduced the distinction between a tensed proposition and a\ntenseless proposition. Tensed propositions can fully and accurately\ndescribe the world, but nevertheless change truth value over time.\nTenseless propositions, on the other hand, are always true or always\nfalse—they reference a particular time in the proposition and\nnever change. Propositions represent ways reality could be. So, which\nview of propositions we adopt depends on what we think it means for\nreality itself to undergo change.\n\nIn\n section 4,\n we discussed McTaggart’s distinction between time conceived of\nas a B-series (events ordered by which come before and which come\nafter) and time conceived of as an A-series (events ordered by which\nare present, which are past, and which are future). Though not\nparticularly creative as names, the A/B distinction has stuck around\nas a way of classifying theories of change.\n\nB-theorists think all change can be described in before-after terms.\nThey typically portray spacetime as a spread-out manifold with events\noccurring at different locations in the manifold (often assuming a\nsubstantivalist picture). Living in a world of change means living in\na world with variation in this manifold. To say that a certain autumn\nleaf changed color is just to say that the leaf is green in an earlier\nlocation of the manifold and red in a later location. The locations,\nin these cases, are specific times in the manifold. And all of the\nmetaphysically important facts about change can be captured by\ntenseless propositions like “The leaf is red at October 7,\n2019”. “The leaf is not red at September 7,\n2019”.\n\nA-theorists, on the other hand, believe that at least some important\nforms of change require classifying events as past, present or future.\nAnd accurately describing this kind of change requires some tensed\npropositions—there is a way reality is (now, presently) which is\ncomplete but was different in the past and also will\nbe different in the future. These tensed propositions also\nexplain why we tend to attribute significance to the\npast-present-future distinction. For example, you might think the\nA-theorist is in a better position to explain why we care whether a\nhorrible event is already in the past versus still in the future. Some\nA-theorists will argue that we aren’t concerned with\nlocation—we care that the event is over with in reality.\n\nNote, also, there is a significant range of views within the A-theory\ncamp about whether there is a spacetime manifold (Moving Spotlighters\nthink there is), or whether only present events are real (the\npresentist view), or whether only present and past events are real\n(the Growing Block view). We say more about all of these views below.\nA-theorists also debate whether objects themselves undergo A-theoretic\nchange or whether it is only entire regions of spacetime that change\nthis way.\n\nA-theorists and B-theorists appeal to different sources of evidence\nfor their different views of passage. A-theorists typically emphasize\nhow psychologically we seem to perceive a world of robust passage or\n“flow” of time. In physics, the laws of thermodynamics\nseem to imply a strong past-to-future direction to time. And quantum\nmechanics seems to identify an important sense of simultaneity, which\ncould be identified with presentness (see\n section 11\n below). Finally many commonsense ways of thinking of change seem to\nrely on A-theory descriptions of passage. For instance, they will use\nthe fact that we care so much about whether bad events are past as\nevidence that there are ineliminable tensed propositions and those\npropositions represent ineliminable A-properties.\n\nB-theorists typically emphasize how special relativity eliminates the\npast/present/future distinction from physical models of space and\ntime. Thus what seems like an awkward way to express facts about time\nin ordinary English is actually much closer to the way we express\nfacts about time in physics. Moreover, thinking of change in tenseless\nterms makes it easier to describe in a logically consistent way how\nobjects survive change—objects have properties only relative to\nparticular times, so there is no worry about attributing absolutely\ninconsistent properties to anything. We’ll consider some of\nthese arguments in more detail in the remaining sections of this\nentry, as we consider more specific variations on A-theories and\nB-theories of time.\n\nSuggestions for Further Reading: For general\ndiscussion of The A theory and The B theory: Emery 2017;\nLe Poidevin 1998; Le Poidevin and McBeath 1993; Markosian 1993;\nMaudlin 2007 (especially Chapter 4); Mellor 1998; Paul 2010; Prior\n1959 [1976], 1962 [1968], 1967, 1968, 1970, 1996; Sider 2001; Skow\n2009; Smart 1963, 1949; Smith 1993; Sullivan 2012a; Williams 1951;\nZimmerman 2005; Zwart 1976.\n6. Presentism, Eternalism, and the Growing Block Theory\n\nA further question that you might ask about time is an ontological\nquestion. Does whether something is past, present, or future make a\ndifference to whether it exists? And how do these ontological theses\nconnect to debates about the A-theory and the B-theory?\n\nAccording to presentism, only present objects exist. More precisely,\npresentism is the view that, necessarily, it is always true that only\npresent objects exist. Even more precisely, no objects exist in time\nwithout being present (abstract objects might exist outside of time).\n(Note that some writers have used the name differently, and unless\notherwise indicated, what is meant here by “present” is\ntemporally present, as opposed to spatially present.) According to\npresentism, if we were to make an accurate list of all the things that\nexist—i.e., a list of all the things that our most unrestricted\nquantifiers range over—there would be not a single merely past\nor merely future object on the list. Thus, you and the Taj Mahal would\nbe on the list, but neither Socrates nor any future Martian outposts\nwould be included. (Assuming, that is, both (i) that each person is\nidentical to his or her body, and (ii) that Socrates’s body\nceased to be present—thereby going out of existence, according\nto presentism—shortly after he died. Those who reject the first\nof these assumptions should simply replace the examples in this\narticle involving allegedly non-present people with appropriate\nexamples involving the non-present bodies of those people.) And it is\nnot just Socrates and future Martian outposts, either—the same\ngoes for any other putative object that lacks the property of being\npresent. No such objects exist, according to presentism.\n\nThere are different ways to oppose presentism—that is, to defend\nthe view that at least some non-present objects exist. One version of\nnon-presentism is eternalism, which says that objects from both the\npast and the future exist. According to eternalism, non-present\nobjects like Socrates and future Martian outposts exist now, even\nthough they are not currently present. We may not be able to see them\nat the moment, on this view, and they may not be in the same\nspace-time vicinity that we find ourselves in right now, but they\nshould nevertheless be on the list of all existing things.\n\nIt might be objected that there is something odd about attributing to\na non-presentist the claim that Socrates exists now, since there is a\nsense in which that claim is clearly false. In order to forestall this\nobjection, let us distinguish between two senses of “x\nexists now”. In one sense, which we can call the temporal\nlocation sense, this expression is synonymous with “x is\npresent”. The non-presentist will admit that, in the temporal\nlocation sense of “x exists now”, it is true that\nno non-present objects exist now. But in the other sense of\n“x exists now”, which we can call the ontological\nsense, to say that “x exists now” is just to say\nthat x is now in the domain of our most unrestricted\nquantifiers. Using the ontological sense of “exists”, we\ncan talk about something existing in a perfectly general sense,\nwithout presupposing anything about its temporal location. When we\nattribute to non-presentists the claim that non-present objects like\nSocrates exist right now, we commit non-presentists only to the claim\nthat these non-present objects exist now in the ontological sense (the\none involving the most unrestricted quantifiers).\n\nAccording to the eternalist, temporal location does not affect\nontology. But according to a somewhat less popular version of\nnon-presentism, temporal location does matter when it comes to\nontology, because only objects that are either past or present exist.\nOn this view, which is often called the growing block theory, the\ncorrect ontology is always increasing in size, as more and more things\nare added on to the leading “present” edge (temporally\nspeaking). (Note, however, that the growing block theory does not\ninvolve any commitment to four-dimensionalism as discussed in\n section 7.\n In this way, the name “growing block” is somewhat\nmisleading and the view is probably better described as the growing\nuniverse theory.) Both presentism and the growing block theory are\nversions of the A-theory.\n\nDespite the claim by some presentists that theirs is the commonsense\nview, it is pretty clear that there are some major problems facing\npresentism (and, to a lesser extent, the growing block theory; but in\nwhat follows we will focus on the problems facing presentism). One\nproblem has to do with what appears to be perfectly meaningful talk\nabout non-present objects, such as Socrates and the year 3000. If\nthere really are no non-present objects, then it is hard to see what\nwe are referring to when we use expressions such as\n“Socrates” and “the year 3000”.\n\nAnother problem for the presentist has to do with relations involving\nnon-present objects. It is natural to say, for example, that Abraham\nLincoln was taller than Napoleon Bonaparte, and that World War II was\na cause of the end of The Depression. But how can we make sense of\nsuch talk, if there are no non-present objects to be the relata of\nthose relations?\n\nA third problem for the presentist has to do with the very plausible\nprinciple that for every truth, there is a truth-maker—something\nwhose existence suffices for the truth of the proposition or\nstatement. If you are a presentist, it is hard to see what the\ntruth-makers could be for truths such as that there were dinosaurs and\nthat there will be Martian outposts.\n\nFinally, the presentist, in virtue of being an A-theorist, must deal\nwith the arguments against the A-theory that were mentioned above,\nincluding especially the worry that the A-theory is incompatible with\nspecial relativity. We will discuss these physics-based objections\nbelow.\n\nSuggestions for Further Reading: Adams 1986; Bourne\n2006; Bigelow 1996; Emery 2020; Hinchliff 1996; Ingram 2016; Keller\nand Nelson 2001; Markosian 2004, 2013; McCall 1994; Rini and Cresswell\n2012; Sider 1999, 2001; Sullivan 2012b; Tooley 1997; Zimmerman 1996,\n1998.\n7. Three-Dimensionalism and Four-Dimensionalism\n\nIn\n Section 4\n and\n Section 5\n we saw that there have been two main theories developed in response\nto McTaggart’s Argument: The A-theory and The B-theory. Then, in\n Section 6\n we saw that there are two main ways of thinking about the relation\nbetween ontology and time: presentism and eternalism. (There was also\na third way, The Growing Block Theory, which we will mainly set aside\nfor the sake of simplicity in this section.) Two main ways of thinking\nabout time emerge from these discussions. On the one hand, A-theorists\nand presentists think that our pre-theoretical idea of time as flowing\nor passing, and thus being very different from the dimensions of\nspace, corresponds to something objective and real. B-theorists and\neternalists, on the other hand, reject the idea of time’s\npassage and instead embrace the idea of time as being a dimension like\nspace. There is another important way in which philosophers in the\nsecond camp (the B-theory/eternalist camp) think time is like space,\nand it has to do with how objects and events persist over time. The\ndebate typically centers around the doctrine of “temporal\nparts”, which those in the B-theory/eternalist camp tend to\naccept while those in the A-theory/presentist camp tend to reject.\n\nTo get an intuitive idea of what temporal parts are supposed to be,\nthink of a film strip depicting you as you walk across a room. It is\nmade up of many frames, and each frame shows you at a moment of time.\nNow picture cutting the frames, and stacking them, one on top of\nanother. Finally, imagine turning the stack sideways, so that the\ntwo-dimensional images of you are all right-side-up. Each image of you\nin one of these frames represents a temporal part of you, in\na specific position, at a particular location in space, at a single\nmoment of time. And what you are, on this way of thinking, is the\nfusion of all these temporal parts. You are a “spacetime\nworm” that curves through the four-dimensional manifold known as\nspacetime. Moreover, on this view, what it is to have a\nmomentary property at a time is to have a temporal part at the time\nthat has the property in question. So you are sitting right now in\nvirtue of the fact that your current temporal part is sitting.\n\nThe doctrine of temporal parts that B-theorists and eternalists tend\nto like can be stated like this:\n\n\nFour-Dimensionalism: Any physical object that is\nlocated at different times has a different temporal part for each\nmoment at which it is located.\n\n\nOn this view you have a temporal part right now, which is a\nthree-dimensional “time slice” of you. And you have a\ndifferent temporal part at noon yesterday, but no temporal parts in\nthe year 1900 (since you are not located at any time in 1900). Also on\nthis view, the physical object that is you is a fusion of all of your\nmany temporal parts. (Note: there is a variation on the standard\nfour-dimensional view, which is sometimes called “the worm\nview”. The variation, known as “the stage view”,\nholds that names and personal pronouns normally refer, not to entire\nfusions of temporal parts but, rather, to the individual\nperson-stages, each of which is located at just an instant of time,\nand each of which counts as a person, rather than a mere part of a\nperson).\n\nThe opposing view is three-dimensionalism, which is just the denial of\nthe claim that temporally extended physical objects must have temporal\nparts. Here is a formulation of the view:\n\n\nThree-Dimensionalism: Any physical object that is\nlocated at different times is wholly present at each moment at which\nit is located.\n\n\nAccording to three-dimensionalism, the thing that was doing whatever\nyou were doing at noon yesterday was you. It was you who was doing\nthat, and now you are doing something different (namely, reading this\nsentence). So the relation between “you then” and\n“you now” is identity. According to\nfour-dimensionalism, on the other hand, the thing that was doing\nwhatever you were doing at noon yesterday was an earlier temporal part\nof the thing that is you, and the thing that is doing what you are\ndoing now is the present temporal part of you. The relation between\n“you then” and “you now” is the temporal\ncounterpart relation. (This is similar to the relation between\nyour left hand and your right hand, which is the spatial\ncounterpart relation. Your two hands are distinct parts of a\nbigger thing that contains them both.)\n\nDavid Lewis, one of the main proponents of four-dimensionalism,\nsuggests that the principal reason to accept the view is to solve what\nhe calls “the problem of temporary intrinsics”. How can a\nsingle thing—Lewis, for example—have different intrinsic\nproperties—like being straight, while he is standing, and then\nbeing bent, while seated—at different times? Not by standing in\ndifferent relations—the being straight at and being\nbent at relations—to different times, he argues. (Since, he\nsays, being straight and being bent are genuine\nproperties rather than disguised relations.) And not in virtue of\nthere being only one reality—such as the time when Lewis is\nbent—so that reality consists of Lewis, and every other thing,\nbeing the way it is now and not any other way. (For Lewis points out\nthat we all believe we have a past and a future, in addition to a\npresent.) So Lewis suggests that the best answer to the question about\nhow a single thing can have different intrinsic properties at\ndifferent times is that such an object has different temporal parts\nwhich themselves have the different intrinsic properties.\n\nThere is, however, a natural three-dimensionalist response to this\nargument. It involves appealing to a certain way of thinking about\ntime, truth, and propositions that we touched on briefly in\n Section 1,\n namely, the idea that propositions are in some way\n“tensed” as opposed to “tenseless”. Here is a\nway to formulate the relevant semantic thesis:\n\n\nThe Tensed Conception of Semantics\n\nPropositions have truth values at times rather than\nsimpliciter and can, in principle, change their truth values\nover time.\nWe cannot eliminate verbal tenses like is, was,\nand will be from an ideal language.\n\n\n\nOn this view, a sentence like “Sullivan is eating a\nburrito” expresses a proposition that used to be true, but is\nfalse now.\n\nThe alternative to the tensed conception of semantics is the\ntenseless conception of semantics. On the latter view, an\nutterance of a sentence like “Sullivan is eating a\nburrito” expresses a proposition about a B-relation between\nevents—it says that Sullivan’s eating a burrito is\nsimultaneous with the utterance itself (or perhaps with the time of\nthe utterance). Here is a way of stating this view:\n\n\nThe Tenseless Conception of Semantics\n\nPropositions have truth values simpliciter rather than at\ntimes, and so cannot change their truth values over time.\nWe can in principle eliminate verbal tenses like is,\nwas, and will be from an ideal language.\n\n\n\nConsideration of Lewis’s argument from temporary intrinsics has\nshown that a three-dimensionalist should probably endorse the tensed\nconception of semantics, in order to account for changing truths about\nthe world and its objects. And once we have seen this, it also becomes\nclear that A-theorists, presentists, and proponents of the growing\nblock theory all have similar reasons for adopting the tensed\nconception of semantics. For the A-theorist is committed to there\nbeing changing truths about which times and events are future, which\nare present, and which are past; and presentists and growing block\ntheorists are both committed to there being changing truths about what\nexists.\n\nSuggestions for Further Reading: Hawley 2004 [2020];\nLewis 1986; Sider 2001; Thomson 1983; van Inwagen 1990\n8. The Dynamic and the Static Theory\n\nMany of the above considerations—especially those about\nMcTaggart’s Argument; the A-theory and the B-theory; presentism,\neternalism, and the growing block theory; and the dispute between\nthree-dimensionalism and four-dimensionalism—suggest that there\nare, generally speaking, two very distinct ways of thinking about the\nnature of time. The first is the Static Theory of Time, according to\nwhich time is like space, and there is no such thing as the passage of\ntime; and the second is the Dynamic Theory of Time, according to which\ntime is very different from space, and the passage of time is a real\nphenomenon. These two ways of thinking about time are not the only\nsuch ways, but they correspond to the two most popular combinations of\nviews about time to be found in the literature, which are arguably the\nmost natural combinations of views on these issues. In this section we\nwill spell out these two popular combinations, mainly as a way to\nsynthesize much of the preceding material, and also to allow the\nreader to appreciate in a big-picture way how the different disputes\nabout the nature of time are normally taken to be interrelated.\n\nThe guiding thought behind the Static Theory of Time is that time is\nlike space. Here are six ways in which this thought is typically\nspelled out. (Note: The particular combination of these six theses is\na natural and popular combination of related claims. But it is not\ninevitable. It is also possible to mix and match from among the tenets\nof the Static Theory and its rival, the Dynamic Theory.)\n\n\nThe Static Theory of Time\n\nThe universe is spread out in four similar dimensions, which\ntogether make up a unified, four-dimensional manifold, appropriately\ncalled spacetime.\nAny physical object that is located at different times has a\ndifferent temporal part for each moment at which it is located.\nThere are no genuine and irreducible A-properties; all talk that\nappears to be about A-properties can be correctly analyzed in terms of\nB-relations. Likewise, the temporal facts about the world include\nfacts about B-relations, but they do not include any facts about\nA-properties.\nThe correct ontology does not change over time, and it always\nincludes objects from every region of spacetime.\nPropositions have truth values simpliciter rather than at\ntimes, and so cannot change their truth values over time. Also, we can\nin principle eliminate verbal tenses like is, was,\nand will be from an ideal language.\nThere is no dynamic aspect to time; time does not pass.\n\n\n\nStatic Theorists of course admit that time seems special to\nus, and that it seems to pass. But they insist that this is just a\nfeature of consciousness—of how we perceive the world—and\nnot a feature of reality that is independent of us.\n\nThe second of the main ways of thinking about time is the Dynamic\nTheory of Time. The guiding thought behind this way of thinking is\nthat time is very different from space. Here are six ways in which\nthis thought is typically spelled out. (Note: The particular\ncombination of these six theses is a natural and popular combination\nof related claims. But, like the Static Theory, it is not inevitable.\nIt is also possible to mix and match from among the tenets of the\nDynamic Theory and the Static Theory.)\n\n\nThe Dynamic Theory of Time\n\nThe universe is spread out in the three dimensions of physical\nspace, and time, like modality, is a completely different kind of\ndimension from the spatial dimensions.\nAny physical object that is located at different times is wholly\npresent at each moment at which it is located.\nThere are genuine and irreducible A-properties, which cannot be\ncorrectly analyzed in terms of B-relations. The temporal facts about\nthe world include ever-changing facts involving A-properties,\nincluding facts about which times are past, which time is present, and\nwhich times are future.\nThe correct ontology changes over time, and it is always true that\nonly present objects exist.\nPropositions have truth values at times rather than\nsimpliciter and can, in principle, change their truth values\nover time. Also, we cannot eliminate verbal tenses like is,\nwas, and will be from an ideal language.\nThe passage of time is a real and mind-independent\nphenomenon.\n\n\n\nOpponents of the Dynamic Theory (and sometimes proponents as well)\nlike to characterize the theory using the metaphor of a moving\nspotlight that slides along the temporal dimension, brightly\nilluminating just one moment of time, the present, while the future is\na foggy region of potential and the past is a shadowy realm of what\nhas been. The moving spotlight is an intuitively appealing way to\ncapture the central idea behind the Dynamic Theory, but in the end, it\nis just a metaphor. What the metaphor represents is the idea that\nA-properties like being future, being present, and\nbeing past are objective and metaphysically significant\nproperties of times, events, and things. Also, the metaphor of the\nmoving spotlight represents the fact that, according to the Dynamic\nTheory, each time undergoes a somewhat peculiar but inexorable\nprocess, sometimes called temporal becoming. It goes from\nbeing in the distant future to the near future, has a brief moment of\nglory in the present, and then recedes forever further and further\ninto the past.\n\nDespite its being intuitively appealing (especially for Static\nTheorists, who see it as a caricature of the Dynamic Theory), the\nmoving spotlight metaphor has a major drawback, according to some\nproponents of the Dynamic Theory: it encourages us to think of time as\na fourth dimension, akin to the dimensions of space. For many\nproponents of the Dynamic Theory, this way of\nthinking—“spatializing time”—is a mistake.\nInstead, we should take seriously the ways that time seems completely\ndifferent from the dimensions of space—for instance,\ntime’s apparent directionality, and the distinctive ways that\ntime governs experience.\n\nSuggestions for Further Reading: Hawley 2001; Lewis\n1986; Markosian 1993; Markosian 2004; Markosian (forthcoming); Moss\n2012; Price 1977; Prior 1967; Prior 1968; Sider 2001; Smart 1949;\nSullivan 2012a; Thomson 1983; and Williams 1951.\n9. The Moving Spotlight Theory\n\nAbove we mentioned that a metaphor sometimes used to characterize the\nDynamic Theory is that of a moving spotlight that slides along the\ntemporal dimension and that is such that only objects within the\nspotlight exist. A similar sort of metaphor can also be used to\ncharacterize the Moving Spotlight Theory, which is an interesting\nhybrid of the Static Theory and the Dynamic Theory. Like the Static\nTheory, the Moving Spotlight Theory incorporates the idea of spacetime\nas a unified manifold, with objects spread out along the temporal\ndimension in virtue of having different temporal parts at different\ntimes, and with past, present, and future parts of the manifold all\nequally real. But like the Dynamic Theory, it incorporates the thesis\nthat A-properties are objective and irreducible properties, as well as\nthe idea that time genuinely passes. The metaphor that characterizes\nthe Moving Spotlight Theory is one on which there is a moving\nspotlight that slides along the temporal dimension and that is such\nthat only things that are within the spotlight are present (but things\nthat are outside the spotlight still exist).\n\nThus the Moving Spotlight Theory is an example of an eternalist\nA-theory that subscribes to the dynamic thesis. Unlike presentist or\ngrowing block theories, spotlighters deny that any objects come into\nor out of existence. Unlike the B-theories, however, spotlighters\nthink that there is an important kind of change that cannot be\ndescribed just as mere variation in a spacetime manifold. Spotlighters\nthink instead that there is a spacetime manifold, but one particular\nregion of the manifold is objectively distinguished—the present.\nAnd this distinction is only temporary—facts about which region\nof spacetime count as the present change over time. For example, right\nnow a region of 2019 is distinguished as present. But in a year, a\nregion of 2020 will enjoy this honor. The term “moving spotlight\ntheory” was coined by C.D. Broad—himself a growing\nblocker—because he thought this view of time treated passage on\nthe metaphor of a policeman’s “bull’s eye”\nscanning regions in sequence and focusing attention on their\ncontents.\n\nJust as there are different understandings of presentism and\neternalism, there are different versions of the moving spotlight\ntheory. Some versions think that even though the present is\ndistinguished, there is still an important sense in which the past and\nfuture are concrete. Other versions (like Cameron 2015) treat the\nspotlight theory more like a variant of presentism—past and\nfuture objects still exist, but their intrinsic properties are\nradically unlike those of present objects. Fragmentalists (see Fine\n2005) think that there is a spacetime manifold but that every point in\nthe manifold has its own type of objective presentness, which defines\na past and future relative to the point.\n\nWhy be a spotlighter? Advocates think it combines some of the best\nfeatures of eternalism while still making sense of how we seem to\nperceive a world of substantive passage. It also inherits some of the\ncounterintuitive consequences of eternalism (i.e., believing dinosaurs\nstill exist) and the more complicated logic of the A-theories (i.e.,\nit requires rules for reasoning about tensed propositions involving\nthe spotlight).\n\nSuggestions for Further Reading: Broad 1923; Cameron\n2015; Fine 2005; Hawley 2004 [2020]; Lewis 1986 (especially Chapter\n4.2); Sider 2001; Skow 2015; Thomson 1983; Van Inwagen 1990; Zimmerman\n1998.\n10. Time Travel\n\nWe are all familiar with time travel stories, and there are few among\nus who have not imagined traveling back in time to experience some\nparticular period or meet some notable person from the past. But is\ntime travel even possible?\n\nOne question that is relevant here is whether time travel is permitted\nby the prevailing laws of nature. This is presumably a matter of\nempirical science (or perhaps the correct philosophical interpretation\nof our best theories from the empirical sciences). But a further\nquestion, and one that falls squarely under the heading of philosophy,\nis whether time travel is permitted by the laws of logic and\nmetaphysics. For it has been argued that various absurdities follow\nfrom the supposition that time travel is (logically and\nmetaphysically) possible. Here is an example of such an argument:\n\n(1)\nIf you could travel back in time, then you could kill your\ngrandfather before your father was ever conceived. (For what’s\nto stop you from bringing a gun with you and simply shooting\nhim?)\n(2)\nIt’s not the case that you could kill your grandfather\nbefore your father was ever conceived. (Because if you did, then you\nwould ensure that you never existed, and that is not something that\nyou could ensure.)\n∴ (3)\nYou cannot travel back in time.\n\n\nAnother argument that might be raised against the possibility of time\ntravel depends on the claim that presentism is true. For if presentism\nis true, then neither past nor future objects exist. And in that case,\nit is hard to see how anyone could travel to the past or the\nfuture.\n\nA third argument, against the possibility of time travel to the past,\nhas to do with the claim that backward causation is impossible. For if\nthere can be no backward causation, then it is not possible that, for\nexample, your pushing the button in your time machine in 2020 can\ncause your appearance, seemingly out of nowhere, in, say, 1900. And\nyet it seems that any story about time travel to the past would have\nto include such backward causation, or else it would not really be a\nstory about time travel.\n\nDespite the existence of these and other arguments against the\npossibility of time travel, there may also be problems associated with\nthe claim that time travel is not possible. For one thing,\nmany scientists and philosophers believe that the actual laws of\nphysics are in fact compatible with time travel. And for another\nthing, as we mentioned at the beginning of this section, we often\nthink about time travel stories; but when we do so, those thoughts do\nnot have the characteristic, glitchy feeling that is normally\nassociated with considering an impossible story. To get a sense of the\nrelevant glitchy feeling, consider this story: Once upon a time\nthere was a young girl, and two plus two was equal to five. When\nyou try to consider that literary gem, you mainly have a feeling that\nsomething has gone wrong (you immediately want to respond, “No,\nit wasn’t”), and the source of that feeling seems to be\nthe metaphysical impossibility of the story being told. But nothing\nlike this happens when you consider a story about time travel\n(especially if it is one of the logically consistent stories about\ntime travel, such as the one depicted in the movie Los\nCronocrímenes (Timecrimes)). One task facing the\nphilosopher who claims that time travel is impossible, then, is to\nexplain the existence of a large number of well-known stories that\nappear to be specifically about time travel, and that do not cause any\nparticular cognitive dissonance.\n\nSuggestions for Further Reading: Bernstein 2015,\n2017; Dyke 2005; Earman 1995; Markosian (forthcoming); Meiland 1974;\nMiller 2017; Sider 2001; Thorne 1994; Vihvelin 1996; Yourgrau\n1999.\n11. Time and Physics\n\nOur best physical theories have often had implications for the nature\nof time, and by and large, it is assumed that philosophers working on\ntime need to be sensitive to the claims of contemporary physics. One\nexample of the interaction between physics and philosophy of time that\nwas mentioned in\n Section 2\n was Newton’s bucket argument, which used the observed effects\nof acceleration to argue for absolute motion (and thus absolute space\nand time). Another example mentioned above was the worry that the\nA-theory conflicted with special relativity. The latter has proved\nespecially influential in contemporary metaphysics of time and so\ndeserves some further discussion.\n\nAccording to standard presentations of special relativity, there is no\nfact of the matter as to whether two spatially separated events happen\nat the same time. This principle, which is known as the relativity\nof simultaneity, creates serious difficulty for the A-theory in\ngeneral and for presentism in particular. After all, it follows from\nthe relativity of simultaneity that there is no fact of the matter as\nto what is present, and according to any A-theory there is an\nimportant distinction between what is present and what is merely past\nor future. According to presentism, that distinction is one of\nexistence—only what is present exists.\n\nA different way of describing the relativity of simultaneity involves\nthe combination of two claims:\n\nthe claim that whether two spatially separated events happen at\nthe same time depends on the reference frame you use to describe them,\nand\nthe claim that no reference frame is privileged.\n\n\nThis way of putting the relativity of simultaneity requires a new bit\nof technical jargon: the notion of a reference frame. For our\npurposes, a reference frame is nothing more than a coordinate\nsystem that is used to identify the same point in space at different\ntimes. Someone on a steadily moving train, for instance, will\nnaturally use a reference frame that is different from someone who is\nstanding on the station platform, since it is natural for the person\non the train to think of themselves as stationary, while for the\nperson on the platform it seems obvious that they are moving.\n\nThe reason why it is worth introducing this bit of jargon is that once\nyou present the relativity of simultaneity as the combination of\nclaims (i) and (ii), you can also note that the motivation for claim\n(i) is importantly different from the motivation for claim (ii). The\nmotivation for (i) is a series of empirical results at the end of the\nnineteenth and beginning of the twentieth century, including, most\nfamously, the Michelson-Morley experiment. No one should deny this\npart of the relativity of simultaneity. The motivation for (ii), by\ncontrast, is less often explicitly discussed, and seems to involve the\ncommitment to some sort of general extra-empirical principle like\n“eliminate unobservable entities whenever possible”, or\n“eliminate excess spacetime structure whenever possible”.\nThis means that presentists and other A-theorists have a way of\navoiding the worry from relativity without any conflict with empirical\nresults—they can reject whatever extra-empirical principle\nmotivates (ii). Whether you think the costs associated with this move\nare worth paying will depend on your degree of commitment to the\nA-theory, what exactly you think of the relevant extra-empirical\nprinciple supporting (ii), and whether that principle plays an\nimportant role elsewhere in physics.\n\nIt is often said that philosophers should defer to physics with\nrespect to what the latter says about time. But the interaction\nbetween the A-theory and special relativity illustrates one way in\nwhich that claim is more complicated than it first appears. Must\nphilosophers respect both the empirical and the\nextra-empirical aspects of our best physical theories? Or is it\nsufficient that they respect the former?\n\nAnother way in which this assumption is complicated is that different\nphysical theories often seem to imply different things about the\nnature of time. Consider, for instance, the fact that in general\nrelativity there is sometimes (though not always!) a preferred way of\n“foliating” spacetime into instants of time and thus\nreintroducing a notion of absolute simultaneity, or the fact that on\nsome interpretations of quantum mechanics, the dynamical laws seem to\nrequire a notion of absolute simultaneity.\n\nTwo additional questions about the nature of time that have been\nespecially influenced by contemporary physics have to do with the\narrow of time and the extent to which time itself might be\nemergent.\n\nTo motivate the first question, start from the observation that the\norder in which events happen in time seems to matter a great deal.\nThere seems to be an important difference, for instance between a\ntrain traveling from Boston to Providence and a train traveling from\nProvidence to Boston. This is because, even though both of these\nsequences may be constituted by the very same events, those events are\nin a different order in each sequence. In the former sequence the\ntrain being in Boston happens earlier than the train being in\nProvidence. In the latter, the train being in Boston happens\nlater.\n\nThese straightforward observations show that we experience time as\nhaving a direction. This is what philosophers call “the arrow of\ntime”. But is the arrow of time a fundamental feature of the\nworld? Or can it be reduced to some other feature, thus simplifying\nour metaphysics as a whole?\n\nOne way to try to eliminate the arrow of time at the fundamental level\nis to make use of certain interpretations of statistical mechanics\ninspired by Ludwig Boltzmann’s work. Imagine the history of the\nuniverse as a long timeline, but with no indication of which end of\nthe time line represents the first moment of time and which end\nrepresents the last moment. It follows from certain interpretations of\nstatistical mechanics that there is a physical quantity, the\nentropy of the universe, that will be relatively low at one\nend of the timeline and relatively high at the other end and will\nalways increase as you move from the former end of the timeline to the\nlatter. (More carefully, the entropy will almost always increase or at\nleast stay constant.) The thought, then, is that we might be able to\nreduce the arrow of time to this entropy gradient. Earlier moments of\ntime are just moments of time when the entropy of the universe is\nlower.\n\nThis way of eliminating the arrow of time from the fundamental level\nis promising, but has at least some unintuitive consequences. For\ninstance, it seems natural to think that entropy could have decreased\nover time, instead of increasing over time as it actually does. But\ngiven the reduction described above, it is not in fact possible for\nentropy to decrease over time.\n\nThe second question mentioned above is a question about whether time\nitself—as opposed to just some particular feature of time, like\ntime’s arrow—might merely be an emergent feature of the\nworld. This question has become especially pressing as philosophers of\nphysics have turned their attention to theories of quantum gravity in\nwhich there does not seem to be anything like temporal structure at\nthe fundamental level. Work in this area is nascent, but some of the\nquestions of interest include: Does quantum gravity eliminate time\nentirely or does it merely make time a non-fundamental feature of the\nworld? What would it mean for something temporal to be grounded in\nsomething atemporal and what sort of grounding relation would be\ninvolved? What is the distinction between causal structure (especially\nthe causal structure in causal set theory—one approach to\nquantum gravity) and temporal structure? And how can a theory that\neliminates time entirely be empirically confirmed or disconfirmed?\n\nSuggestions for Further Reading: Albert 2000; Emery\n2019 & forthcoming; Godfrey-Smith 1979; Healey 2002; Huggett and\nWüthrich 2013; Knox 2013; Markosian 2004; Maxwell 1985; Monton\n2006; Price 1996; Putnam 1967; Rovelli 2017; Savitt 2000; Stein 1968,\n1970; Weingard 1972; Wüthrich and Callender 2017.\n12. Time and Rationality\n\nA final important question concerns how considerations about the\nnature of time ought to impact the ways that we reason about time. For\nexample, if it turns out that a B-theory is true, and there is no\nmetaphysically important difference between the past and future, then\nshould we adopt a more neutral attitude about events in our personal\npast and future? Epicurean philosopher Lucretius famously suggested\nthat if there is no substantive difference between the times in the\npast before we came to exist and the times in the future after we die,\nwe should care much less about the deprivation that death will bring.\nBut we may think that even if the B-theory can describe everything\nthat is metaphysically important without positing an important\ndifference between the past and future, there is still an\nindispensable psychological importance to the past/future distinction\nthat rational agents honor. Still other A-theorists argue that while\nthere is an important metaphysical distinction between the past and\nfuture, the distinction has no normative importance.\n\nIf we deny three-dimensionalism and instead view ourselves as objects\nthat persist through time by having temporal parts, then does that\njustify caring less about temporal parts in the distant future that\nare less strongly linked with our present part? Derek Parfit famously\nargued that a proper understanding of what we care about when we care\nabout our own future persistence should motivate us to be less\nself-interested and more interested in redistributing resources to\nothers. Endurantists have argued that facts about how we persist\nthrough time underwrite a strong distinction between moral principles\n(which concern what we owe to others now) and prudential rationality\n(which concerns what we owe to our future selves).\n\nAnother interesting line of research uses empirical work in psychology\nto better understand what is happening cognitively when we judge time\nas passing. This is especially pressing for B-theorists, who must\nexplain why time seems to pass in psychologically or rationally\nsignificant ways, even though all passage is really just variation in\nan eternal manifold. Some B-theorists explain the apparent passage of\ntime as an illusion of flow caused by perceptual processes that\nattribute apparent motion to events that happen in sequence. Another,\ncompatible approach considers the way that evolutionary pressures\nmight have shaped emotions and cognitive heuristics to give us a\nstrong past/future distinction in our reasoning.\n\nSuggestions for Further Reading: Brink 2003; Suhler\nand Callender 2012; Parfit 1971; Paul 2010; Prosser 2016; Sullivan\n2018.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adams, Robert Merrihew, 1986, “Time and Thisness”,\n<em>Midwest Studies in Philosophy</em>, 11: 315–329.\ndoi:10.1111/j.1475-4975.1986.tb00501.x",
                "Albert, David, 2000, <em>Time and Chance</em>, Cambridge, MA:\nHarvard University Press.",
                "Alexander, H.G. (ed. and trans.), 1956, <em>The Leibniz-Clarke\nCorrespondence</em>, Manchester: Manchester University Press.",
                "Ariew, Roger (ed), 2000, <em>Leibniz and Clarke:\nCorrespondence</em>, Indianapolis, IN: Hackett Publishing.",
                "Aristotle, <em>De Interpretatione</em>, in Aristotle, <em>The\nComplete Works of Aristotle</em>, Princeton, NJ: Princeton University\nPress, 1984, Chapter 9.",
                "–––, <em>Physics</em>, in Aristotle, <em>The\nComplete Works of Aristotle</em>, Princeton, NJ: Princeton University\nPress, 1984, Book VIII.",
                "Arntzenius, Frank, 2012, <em>Space, Time, and Stuff</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199696604.001.0001",
                "Baker, Alan, 2004 [2016], “Simplicity”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2016 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/simplicity/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/simplicity/</a>&gt;.",
                "Barnes, Elizabeth and Ross Cameron, 2009, “The Open Future:\nBivalence, Determinism and Ontology”, <em>Philosophical\nStudies</em>, 146(2): 291–309.\ndoi:10.1007/s11098-008-9257-6",
                "Bernstein, Sara, 2015, “Nowhere Man: Time Travel and Spatial\nLocation: Nowhere Man”, <em>Midwest Studies In Philosophy</em>,\n39: 158–168. doi:10.1111/misp.12041",
                "–––, 2017, “Time Travel and the Movable\nPresent”, in <em>Being, Freedom, and Method</em>, John A. Keller\n(ed.), Oxford: Oxford University Press, 80–92.\ndoi:10.1093/acprof:oso/9780198715702.003.0005",
                "Beyer, Christian, 2003 [2018] “Edmund Husserl”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2018\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/husserl/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/husserl/</a>&gt;.",
                "Bigelow, John, 1996, “Presentism and Properties”,\n<em>Philosophical Perspectives</em>, 10: 35–52.\ndoi:10.2307/2216235",
                "Boethius, <em>The Consolation of Philosophy</em>, Book V, Prose\nvi.",
                "Bourne, Craig, 2006, <em>A Future for Presentism</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199212804.001.0001",
                "Bradley, F.H., 1893, <em>Appearance and Reality</em>, London: Swan\nSonnenschein; second edition, with an appendix, 1897; ninth\nimpression, corrected, Oxford: Clarendon Press, 1930.",
                "Brink, David O., 2003, “Prudence and Authenticity:\nIntrapersonal Conflicts of Value”, <em>Philosophical\nReview</em>, 112(2): 215–245.\ndoi:10.1215/00318108-112-2-215",
                "Broad, C.D., 1923, <em>Scientific Thought</em>, New York:\nHarcourt, Brace and Co.",
                "Cameron, Ross P., 2015, <em>The Moving Spotlight: An Essay on Time\nand Ontology</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198713296.001.0001",
                "Coope, Ursula, 2001, “Why Does Aristotle Say That There Is\nNo Time Without Change?”, <em>Proceedings of the Aristotelian\nSociety</em>, 101(1): 359–367.\ndoi:10.1111/j.0066-7372.2003.00036.x",
                "Crisp, Thomas M., 2007, “Presentism and The Grounding\nObjection”, <em>Noûs</em>, 41(1): 90–109.\ndoi:10.1111/j.1468-0068.2007.00639.x",
                "Dainton, Barry, 2010 [2018], “Temporal Consciousness”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2018\nEdition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/win2018/entries/consciousness-temporal/\" target=\"other\">https://plato.stanford.edu/archives/win2018/entries/consciousness-temporal/</a>&gt;.",
                "Dyke, Heather, 2002, “McTaggart and the Truth about\nTime”, in <em>Time, Reality &amp; Experience</em>, Craig\nCallender (ed.), Cambridge: Cambridge University Press, 137–152.\ndoi:10.1017/CBO9780511550263.008",
                "–––, 2005, “The Metaphysics and\nEpistemology of Time Travel”, <em>Think</em>, 3:\n43–52.",
                "Earman, John, 1995, “Recent Work on Time Travel”, in\nSavitt 1995: 268–310. doi:10.1017/CBO9780511622861.014",
                "Emery, Nina, 2017, “Temporal Ersatzism”,\n<em>Philosophy Compass</em>, 12(9): e12441.\ndoi:10.1111/phc3.12441",
                "–––, 2019, “Actualism without Presentism?\nNot by Way of the Relativity Objection”, <em>Noûs</em>,\n53(4): 963–986. doi:10.1111/nous.12247",
                "–––, 2020, “Actualism, Presentism and the\nGrounding Objection”, <em>Erkenntnis</em>, 85(1): 23–43.\ndoi:10.1007/s10670-018-0016-6",
                "–––, forthcoming, “Temporal Ersatzism and\nRelativity”, <em>Australasian Journal of Philosophy</em>, first\nonline: 7 July 2020. doi:10.1080/00048402.2020.1780621",
                "Evans, Gareth, 1985, “Does Tense Logic Rest on a\nMistake?” in <em>Collected Papers: Gareth Evans</em>, Oxford:\nClarendon Press, pp. 343–363.",
                "Fine, Kit, 2005, <em>Modality and Tense: Philosophical\nPapers</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199278709.001.0001",
                "Godfrey-Smith, William, 1979, “Special Relativity and the\nPresent”, <em>Philosophical Studies</em>, 36(3): 233–244.\ndoi:10.1007/BF00372628",
                "Hawley, Katherine, 2001, <em>How Things Persist</em>, Oxford:\nOxford University Press.",
                "–––, 2004 [2020], “Temporal Parts”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2020\nEdition), Edward N. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/sum2020/entries/temporal-parts/\">https://plato.stanford.edu/archives/sum2020/entries/temporal-parts/</a>&gt;.",
                "Healey, Richard, 2002, “Can Physics Coherently Deny the\nReality of Time?”, <em>Royal Institute of Philosophy\nSupplement</em>, 50: 293–316. doi:10.1017/S1358246100010614",
                "Hinchliff, Mark, 1996, “The Puzzle of Change”,\n<em>Philosophical Perspectives</em>, 10: 119–136.\ndoi:10.2307/2216239",
                "Huggett, Nick and Christian Wüthrich, 2013, “Emergent\nSpacetime and Empirical (in)Coherence”, <em>Studies in History\nand Philosophy of Science Part B: Studies in History and Philosophy of\nModern Physics</em>, 44(3): 276–285.\ndoi:10.1016/j.shpsb.2012.11.003",
                "Ingram, David, 2016, “The Virtues of Thisness\nPresentism”, <em>Philosophical Studies</em>, 173(11):\n2867–2888. doi:10.1007/s11098-016-0641-3",
                "Kant, Immanuel, 1771/87, <em>The Critique of Pure Reason</em>,\nNorman Kemp Smith (trans.), London: Macmillan, 1963, pp. 75ff.",
                "Keller, Simoon and Michael Nelson, 2001, “Presentists Should\nBelieve in Time-Travel”, <em>Australasian Journal of\nPhilosophy</em>, 79(3): 333–345. doi:10.1080/713931204",
                "Knox, Eleanor, 2013, “Effective Spacetime Geometry”,\n<em>Studies in History and Philosophy of Science Part B: Studies in\nHistory and Philosophy of Modern Physics</em>, 44(3): 346–356.\ndoi:10.1016/j.shpsb.2013.04.002",
                "Le Poidevin, Robin (ed.), 1998, <em>Questions of Time and\nTense</em>, Oxford: Oxford University Press.",
                "–––, 2000 [2019], “The Experience and\nPerception of Time”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2019 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2019/entries/time-experience/\" target=\"other\">https://plato.stanford.edu/archives/sum2019/entries/time-experience/</a>&gt;.",
                "Le Poidevin, Robin and Murray McBeath (eds.), 1993, <em>The\nPhilosophy of Time</em>, Oxford: Oxford University Press.",
                "Lewis, David, 1986, “The Paradoxes of Time Travel”, in\nhis <em>Philosophical Papers</em>, Volume 2, Oxford: Oxford University\nPress, pp. 67–80.",
                "Markosian, Ned, 1993, “How Fast Does Time Pass?”,\n<em>Philosophy and Phenomenological Research</em>, 53(4):\n829–844. doi:10.2307/2108255",
                "–––, 1995, “The Open Past”,\n<em>Philosophical Studies</em>, 79(1): 95–105.\ndoi:10.1007/BF00989786",
                "–––, 2004, “A Defense of\nPresentism”, in <em>Oxford Studies in Metaphysics</em>, volume\n1, Dean W. Zimmerman (ed.), Oxford: Oxford University Press, pp.\n47–82.",
                "–––, 2013, “The Truth About the Past and\nthe Future”, in <em>Around the Tree: Semantic and Metaphysical\nIssues Concerning Branching Time and the Open Future</em>, Fabrice\nCorreia and Andrea Iacona (eds.), Dordrecht: Springer Netherlands,\n127–141. doi:10.1007/978-94-007-5167-5_8",
                "–––, forthcoming, “The Dynamic Theory of\nTime and Time Travel to the Past”, <em>Disputatio</em>.",
                "Maudlin, Tim, 2007, “On the Passing of Time”, in his\n<em>The Metaphysics Within Physics</em>, Oxford: Oxford University\nPress, Chapter 4.",
                "Maxwell, Nicholas, 1985, “Are Probabilism and Special\nRelativity Incompatible?”, <em>Philosophy of Science</em>,\n52(1): 23–43.",
                "McCall, Storrs, 1994, <em>A Model of the Universe: Space-Time,\nProbability, and Decision</em>, Oxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780198236221.001.0001",
                "McTaggart, J. M. Ellis, 1908, “The Unreality of Time”,\n<em>Mind</em>, 17(4): 457–474. Reprinted in Le Poidevin and\nMcBeath 1993: 23–34. doi:10.1093/mind/XVII.4.457",
                "Mellor, D.H., 1998, <em>Real Time II</em>, London: Routledge.",
                "Meiland, Jack W., 1974, “A Two-Dimensional Passage Model of\nTime for Time Travel”, <em>Philosophical Studies</em>,\n26(3–4): 153–173. doi:10.1007/BF00398876",
                "Miller, Kristie, 2005, “Time Travel and the Open\nFuture”, <em>Disputatio</em>, 1(19): 223–232.\ndoi:10.2478/disp-2005-0009",
                "–––, 2017, “Is Some Backwards Time Travel\nInexplicable?” <em>American Philosophical Quarterly</em>, 54(2):\n131–141.",
                "Mitchell, Sam, 1993, “Mach’s Mechanics and Absolute\nSpace and Time”, <em>Studies in History and Philosophy of\nScience Part A</em>, 24(4): 565–583.\ndoi:10.1016/0039-3681(93)90053-M",
                "Monton, Bradley, 2006, “Presentism and Quantum\nGravity”, in <em>The Ontology of Spacetime</em>, Dennis Dieks\n(ed.), (Philosophy and Foundations of Physics 1), Dordrecht: Elsevier,\n263–280. doi:10.1016/S1871-1774(06)01014-X",
                "Moss, Sarah, 2012, “Four-Dimensionalist Theories of\nPersistence”, <em>Australasian Journal of Philosophy</em>, 90:\n671–686.",
                "Newton, Isaac, 2004, <em>Isaac Newton: Philosophical\nWritings</em>, Andrew Janiak (ed.), Cambridge: Cambridge University\nPress. doi:10.1017/CBO9780511809293",
                "Newton-Smith, W.H., 1980, <em>The Structure of Time</em>, London:\nRoutledge &amp; Kegan Paul. doi:10.4324/9780429020506",
                "Parfit, Derek, 1971, “Personal Identity”, <em>The\nPhilosophical Review</em>, 80(1): 3–27. doi:10.2307/2184309",
                "Paul, L. A., 2010, “Temporal Experience”, <em>Journal\nof Philosophy</em>, 107(7): 333–359.\ndoi:10.5840/jphil2010107727",
                "Price, Huw, 1994, “A Neglected Route to Realism about\nQuantum Mechanics”, <em>Mind</em>, 103(411): 303–336.\ndoi:10.1093/mind/103.411.303",
                "–––, 1996, <em>Time’s Arrow and\nArchimedes’ Point: New Directions for the Physics of Time</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195117981.001.0001",
                "Price, Marjorie, 1977, “Identity Through Time”,\n<em>The Journal of Philosophy</em>, 74: 201–217.",
                "Prior, Arthur N., 1959 [1976], “Thank Goodness That’s\nOver”, <em>Philosophy</em>, 34(128): 12–17. Reprinted in\nhis <em>Papers in Logic and Ethics</em>, P. T. Geach and A. J. P.\nKenny (eds), London: Duckworth, 1976, pp. 78–84.\ndoi:10.1017/S0031819100029685",
                "–––, 1962 [1968], <em>Changes in Events and\nChanges in Things</em> (Lindley Lecture Series), Lawrence, KS:\nUniversity of Kansas. Reprinted in Prior 1968b: 1–14.\n [<a href=\"http://hdl.handle.net/1808/12377\" target=\"other\">Prior 1962 available online</a>]",
                "–––, 1967, <em>Past, Present, and Future</em>,\nOxford: Oxford University Press.",
                "–––, 1968, <em>Papers on Time and Tense</em>,\nOxford: Oxford University Press.",
                "–––, 1970, “The Notion of the\nPresent”, <em>Studium Generale</em>, 23: 245–248.\nReprinted in <em>The Study of Time</em>, J. T. Fraser, F. C. Haber,\nand G. H. Müller (eds), Berlin: Springer-Verlag, 1972,\n320–323.",
                "–––, 1996, “Some Free Thinking About\nTime”, an undated manuscript first published after his death in\n<em>Logic and Reality: Essays on the Legacy of Arthur Prior</em>, Jack\nCopeland (ed.), Oxford: Clarendon Press, pp. 47–51.",
                "Prosser, Simon, 2016, <em>Experiencing Time</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198748946.001.0001",
                "Putnam, Hilary, 1967, “Time and Physical Geometry”:,\n<em>Journal of Philosophy</em>, 64(8): 240–247.\ndoi:10.2307/2024493",
                "Rini, Adriane A. and Max J. Cresswell, 2012, <em>The\nWorld–Time Parallel: Tense and Modality in Logic and\nMetaphysics</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139084215",
                "Richard, Mark, 1981, “Temporalism and Eternalism”,\n<em>Philosophical Studies</em>, 39(1): 1–13.\ndoi:10.1007/BF00354808",
                "Rovelli, Carlo, 2017, <em>Reality is Not What It Seems: The\nJourney to Quantum Gravity</em>, New York: Riverhead Books.",
                "Rynasiewicz, Robert, 2004 [2014], “Newton’s Views on\nSpace, Time, and Motion”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2014/entries/newton-stm/\" target=\"other\">https://plato.stanford.edu/archives/sum2014/entries/newton-stm/</a>&gt;.",
                "Savitt, Steven F. (ed.), 1995, <em>Time’s Arrows Today:\nRecent Physical and Philosophical Work on the Direction of Time</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511622861",
                "–––, 2000, “There’s No Time like the\nPresent (In Minkowski Spacetime)”, <em>Philosophy of\nScience</em>, 67(supplement: Proceedings of the 1998 Biennial Meetings\nof the Philosophy of Science Association): S563–S574.\ndoi:10.1086/392846",
                "Shoemaker, Sydney, 1969, “Time Without Change”,\n<em>The Journal of Philosophy</em>, 66(12): 363–381.\ndoi:10.2307/2023892",
                "Sider, Theodore, 1999, “Presentism and Ontological\nCommitment”, <em>The Journal of Philosophy</em>, 96(7): 325.\ndoi:10.2307/2564601",
                "–––, 2001, <em>Four-Dimensionalism: An Ontology\nof Persistence and Time</em>, Oxford: Oxford University Press.\ndoi:10.1093/019924443X.001.0001",
                "Sklar, Lawrence, 1974, <em>Space, Time, and Spacetime</em>,\nBerkeley, CA: University of California Press.",
                "Skow, Bradford, 2009, “Relativity and the Moving\nSpotlight”:, <em>Journal of Philosophy</em>, 106(12):\n666–678. doi:10.5840/jphil20091061224",
                "–––, 2015, <em>Objective Becoming</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780198713272.001.0001",
                "Smart, J. J. C., 1949, “The River of Time”,\n<em>Mind</em>, 58(232): 483–494. Reprinted in Antony Flew (ed.),\n<em>Essays in Conceptual Analysis</em>, New York: St. Martin’s\nPress, 1966, pp. 213–227. doi:10.1093/mind/LVIII.232.483",
                "–––, 1963, <em>Philosophy and Scientific\nRealism</em>, London: Routledge &amp; Kegan Paul.",
                "Smith, Quentin, 1993, <em>Language and Time</em>, Oxford: Oxford\nUniversity Press.",
                "Stein, Howard, 1968, “On Einstein-Minkowski\nSpace-Time”:, <em>Journal of Philosophy</em>, 65(1): 5–23.\ndoi:10.2307/2024512",
                "–––, 1970, “A Note on Time and Relativity\nTheory”:, <em>Journal of Philosophy</em>, 67(9): 289–294.\ndoi:10.2307/2024388",
                "Suhler, Christopher and Craig Callender, 2012, “Thank\nGoodness That Argument Is Over: Explaining the Temporal Value\nAsymmetry”, <em>Philosopher’s Imprint</em>, 12: art. 15.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0012.015\" target=\"other\">Suhler and Callender 2012 available online</a>]",
                "Sullivan, Meghan, 2012a, “The Minimal A-Theory”,\n<em>Philosophical Studies</em>, 158(2): 149–174.\ndoi:10.1007/s11098-012-9888-5",
                "–––, 2012b, “Problems for Temporary\nExistence in Tense Logic”, <em>Philosophy Compass</em>, 7(1):\n43–57. doi:10.1111/j.1747-9991.2011.00457.x",
                "–––, 2014, “Change We Can Believe In (and\nAssert): Change We Can Believe In (and Assert)”,\n<em>Noûs</em>, 48(3): 474–495.\ndoi:10.1111/j.1468-0068.2012.00874.x",
                "–––, 2018, <em>Time Biases: A Theory of Rational\nPlanning and Personal Persistence</em>, Oxford: Oxford University\nPress. doi:10.1093/oso/9780198812845.001.0001",
                "Swinburne, R. G., 1966, “The Beginning of the\nUniverse”, <em>Aristotelian Society Supplementary Volume</em>,\n40: 125–138. doi:10.1093/aristoteliansupp/40.1.125",
                "–––, 1968, <em>Space and Time</em>, London:\nMacmillan.",
                "Taylor, Richard, 1992, “Fate”, in his\n<em>Metaphysics</em>, fourth Edition, Englewood Cliffs, NJ:\nPrentice-Hall, Chapter 6.",
                "Thomson, Judith Jarvis, 1983, “Parthood and Identity Across\nTime”, <em>The Journal of Philosophy</em>, 80(4): 201–220.\ndoi:10.2307/2026004",
                "Thorne, Kip S., 1994, <em>Black Holes and Time Warps</em>, New\nYork: W.W. Norton.",
                "Tooley, Michael, 1997, <em>Time, Tense, and Causation</em>,\nOxford: Oxford University Press. doi:10.1093/0198250746.001.0001",
                "Torre, Stephan, 2011, “The Open Future”,\n<em>Philosophy Compass</em>, 6(5): 360–373.\ndoi:10.1111/j.1747-9991.2011.00395.x",
                "Van Inwagen, Peter, 1983, <em>An Essay on Free Will</em>, Oxford:\nClarendon Press.",
                "–––, 1990, “Symposia Papers:\nFour-Dimensional Objects”, <em>Noûs</em>, 24(2):\n245–255. doi:10.2307/2215526",
                "Vihvelin, Kadri, 1996, “What Time Travelers Cannot\nDo”, <em>Philosophical Studies</em>, 81(2–3):\n315–330. doi:10.1007/BF00372789",
                "Weingard, Robert, 1972, “Relativity and the Reality of Past\nand Future Events”, <em>The British Journal for the Philosophy\nof Science</em>, 23(2): 119–121. doi:10.1093/bjps/23.2.119",
                "Wheeler, Michael, 2011 [2018], “Martin Heidegger”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2018\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2018/entries/heidegger/\" target=\"other\">https://plato.stanford.edu/archives/win2018/entries/heidegger/</a>&gt;.",
                "Williams, Donald C., 1951, “The Myth of Passage”:,\n<em>Journal of Philosophy</em>, 48(15): 457–472.\ndoi:10.2307/2021694",
                "Wüthrich, Christian and Craig Callender, 2017, “What\nBecomes of a Causal Set?”, <em>The British Journal for the\nPhilosophy of Science</em>, 68(3): 907–925.\ndoi:10.1093/bjps/axv040",
                "Yourgrau, Palle, 1999, <em>Gödel Meets Einstein: Time Travel\nin the Göodel Universe</em>, La Salle: Open Court.",
                "Zimmerman, Dean W., 1996, “Persistence and\nPresentism”, <em>Philosophical Papers</em>, 25(2):\n115–126. doi:10.1080/05568649609506542",
                "–––, 1998, “Temporary Intrinsics and\nPresentism”, in Peter van Inwagen and Dean W. Zimmerman (eds.),\n<em>Metaphysics: The Big Questions</em>, Oxford: Basil Blackwell, pp.\n206–209.",
                "–––, 2005, “The A-Theory of Time, The\nB-Theory of Time, and ‘Taking Tense Seriously’”,\n<em>Dialectica</em>, 59(4): 401–457.\ndoi:10.1111/j.1746-8361.2005.01041.x",
                "Zwart, P.J., 1976, <em>About Time</em>, Amsterdam: North-Holland\nPublishing Co."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adams, Robert Merrihew, 1986, “Time and Thisness”,\n<em>Midwest Studies in Philosophy</em>, 11: 315–329.\ndoi:10.1111/j.1475-4975.1986.tb00501.x</li>\n<li>Albert, David, 2000, <em>Time and Chance</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Alexander, H.G. (ed. and trans.), 1956, <em>The Leibniz-Clarke\nCorrespondence</em>, Manchester: Manchester University Press.</li>\n<li>Ariew, Roger (ed), 2000, <em>Leibniz and Clarke:\nCorrespondence</em>, Indianapolis, IN: Hackett Publishing.</li>\n<li>Aristotle, <em>De Interpretatione</em>, in Aristotle, <em>The\nComplete Works of Aristotle</em>, Princeton, NJ: Princeton University\nPress, 1984, Chapter 9.</li>\n<li>–––, <em>Physics</em>, in Aristotle, <em>The\nComplete Works of Aristotle</em>, Princeton, NJ: Princeton University\nPress, 1984, Book VIII.</li>\n<li>Arntzenius, Frank, 2012, <em>Space, Time, and Stuff</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199696604.001.0001</li>\n<li>Baker, Alan, 2004 [2016], “Simplicity”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2016 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/simplicity/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/simplicity/</a>&gt;.</li>\n<li>Barnes, Elizabeth and Ross Cameron, 2009, “The Open Future:\nBivalence, Determinism and Ontology”, <em>Philosophical\nStudies</em>, 146(2): 291–309.\ndoi:10.1007/s11098-008-9257-6</li>\n<li>Bernstein, Sara, 2015, “Nowhere Man: Time Travel and Spatial\nLocation: Nowhere Man”, <em>Midwest Studies In Philosophy</em>,\n39: 158–168. doi:10.1111/misp.12041</li>\n<li>–––, 2017, “Time Travel and the Movable\nPresent”, in <em>Being, Freedom, and Method</em>, John A. Keller\n(ed.), Oxford: Oxford University Press, 80–92.\ndoi:10.1093/acprof:oso/9780198715702.003.0005</li>\n<li>Beyer, Christian, 2003 [2018] “Edmund Husserl”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2018\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/husserl/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/husserl/</a>&gt;.</li>\n<li>Bigelow, John, 1996, “Presentism and Properties”,\n<em>Philosophical Perspectives</em>, 10: 35–52.\ndoi:10.2307/2216235</li>\n<li>Boethius, <em>The Consolation of Philosophy</em>, Book V, Prose\nvi.</li>\n<li>Bourne, Craig, 2006, <em>A Future for Presentism</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199212804.001.0001</li>\n<li>Bradley, F.H., 1893, <em>Appearance and Reality</em>, London: Swan\nSonnenschein; second edition, with an appendix, 1897; ninth\nimpression, corrected, Oxford: Clarendon Press, 1930.</li>\n<li>Brink, David O., 2003, “Prudence and Authenticity:\nIntrapersonal Conflicts of Value”, <em>Philosophical\nReview</em>, 112(2): 215–245.\ndoi:10.1215/00318108-112-2-215</li>\n<li>Broad, C.D., 1923, <em>Scientific Thought</em>, New York:\nHarcourt, Brace and Co.</li>\n<li>Cameron, Ross P., 2015, <em>The Moving Spotlight: An Essay on Time\nand Ontology</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198713296.001.0001</li>\n<li>Coope, Ursula, 2001, “Why Does Aristotle Say That There Is\nNo Time Without Change?”, <em>Proceedings of the Aristotelian\nSociety</em>, 101(1): 359–367.\ndoi:10.1111/j.0066-7372.2003.00036.x</li>\n<li>Crisp, Thomas M., 2007, “Presentism and The Grounding\nObjection”, <em>Noûs</em>, 41(1): 90–109.\ndoi:10.1111/j.1468-0068.2007.00639.x</li>\n<li>Dainton, Barry, 2010 [2018], “Temporal Consciousness”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2018\nEdition), Edward N. Zalta (ed.),\n URL=&lt;<a href=\"https://plato.stanford.edu/archives/win2018/entries/consciousness-temporal/\" target=\"other\">https://plato.stanford.edu/archives/win2018/entries/consciousness-temporal/</a>&gt;.</li>\n<li>Dyke, Heather, 2002, “McTaggart and the Truth about\nTime”, in <em>Time, Reality &amp; Experience</em>, Craig\nCallender (ed.), Cambridge: Cambridge University Press, 137–152.\ndoi:10.1017/CBO9780511550263.008</li>\n<li>–––, 2005, “The Metaphysics and\nEpistemology of Time Travel”, <em>Think</em>, 3:\n43–52.</li>\n<li>Earman, John, 1995, “Recent Work on Time Travel”, in\nSavitt 1995: 268–310. doi:10.1017/CBO9780511622861.014</li>\n<li>Emery, Nina, 2017, “Temporal Ersatzism”,\n<em>Philosophy Compass</em>, 12(9): e12441.\ndoi:10.1111/phc3.12441</li>\n<li>–––, 2019, “Actualism without Presentism?\nNot by Way of the Relativity Objection”, <em>Noûs</em>,\n53(4): 963–986. doi:10.1111/nous.12247</li>\n<li>–––, 2020, “Actualism, Presentism and the\nGrounding Objection”, <em>Erkenntnis</em>, 85(1): 23–43.\ndoi:10.1007/s10670-018-0016-6</li>\n<li>–––, forthcoming, “Temporal Ersatzism and\nRelativity”, <em>Australasian Journal of Philosophy</em>, first\nonline: 7 July 2020. doi:10.1080/00048402.2020.1780621</li>\n<li>Evans, Gareth, 1985, “Does Tense Logic Rest on a\nMistake?” in <em>Collected Papers: Gareth Evans</em>, Oxford:\nClarendon Press, pp. 343–363.</li>\n<li>Fine, Kit, 2005, <em>Modality and Tense: Philosophical\nPapers</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199278709.001.0001</li>\n<li>Godfrey-Smith, William, 1979, “Special Relativity and the\nPresent”, <em>Philosophical Studies</em>, 36(3): 233–244.\ndoi:10.1007/BF00372628</li>\n<li>Hawley, Katherine, 2001, <em>How Things Persist</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2004 [2020], “Temporal Parts”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Summer 2020\nEdition), Edward N. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/sum2020/entries/temporal-parts/\">https://plato.stanford.edu/archives/sum2020/entries/temporal-parts/</a>&gt;.</li>\n<li>Healey, Richard, 2002, “Can Physics Coherently Deny the\nReality of Time?”, <em>Royal Institute of Philosophy\nSupplement</em>, 50: 293–316. doi:10.1017/S1358246100010614</li>\n<li>Hinchliff, Mark, 1996, “The Puzzle of Change”,\n<em>Philosophical Perspectives</em>, 10: 119–136.\ndoi:10.2307/2216239</li>\n<li>Huggett, Nick and Christian Wüthrich, 2013, “Emergent\nSpacetime and Empirical (in)Coherence”, <em>Studies in History\nand Philosophy of Science Part B: Studies in History and Philosophy of\nModern Physics</em>, 44(3): 276–285.\ndoi:10.1016/j.shpsb.2012.11.003</li>\n<li>Ingram, David, 2016, “The Virtues of Thisness\nPresentism”, <em>Philosophical Studies</em>, 173(11):\n2867–2888. doi:10.1007/s11098-016-0641-3</li>\n<li>Kant, Immanuel, 1771/87, <em>The Critique of Pure Reason</em>,\nNorman Kemp Smith (trans.), London: Macmillan, 1963, pp. 75ff.</li>\n<li>Keller, Simoon and Michael Nelson, 2001, “Presentists Should\nBelieve in Time-Travel”, <em>Australasian Journal of\nPhilosophy</em>, 79(3): 333–345. doi:10.1080/713931204</li>\n<li>Knox, Eleanor, 2013, “Effective Spacetime Geometry”,\n<em>Studies in History and Philosophy of Science Part B: Studies in\nHistory and Philosophy of Modern Physics</em>, 44(3): 346–356.\ndoi:10.1016/j.shpsb.2013.04.002</li>\n<li>Le Poidevin, Robin (ed.), 1998, <em>Questions of Time and\nTense</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2000 [2019], “The Experience and\nPerception of Time”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2019 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2019/entries/time-experience/\" target=\"other\">https://plato.stanford.edu/archives/sum2019/entries/time-experience/</a>&gt;.</li>\n<li>Le Poidevin, Robin and Murray McBeath (eds.), 1993, <em>The\nPhilosophy of Time</em>, Oxford: Oxford University Press.</li>\n<li>Lewis, David, 1986, “The Paradoxes of Time Travel”, in\nhis <em>Philosophical Papers</em>, Volume 2, Oxford: Oxford University\nPress, pp. 67–80.</li>\n<li>Markosian, Ned, 1993, “How Fast Does Time Pass?”,\n<em>Philosophy and Phenomenological Research</em>, 53(4):\n829–844. doi:10.2307/2108255</li>\n<li>–––, 1995, “The Open Past”,\n<em>Philosophical Studies</em>, 79(1): 95–105.\ndoi:10.1007/BF00989786</li>\n<li>–––, 2004, “A Defense of\nPresentism”, in <em>Oxford Studies in Metaphysics</em>, volume\n1, Dean W. Zimmerman (ed.), Oxford: Oxford University Press, pp.\n47–82.</li>\n<li>–––, 2013, “The Truth About the Past and\nthe Future”, in <em>Around the Tree: Semantic and Metaphysical\nIssues Concerning Branching Time and the Open Future</em>, Fabrice\nCorreia and Andrea Iacona (eds.), Dordrecht: Springer Netherlands,\n127–141. doi:10.1007/978-94-007-5167-5_8</li>\n<li>–––, forthcoming, “The Dynamic Theory of\nTime and Time Travel to the Past”, <em>Disputatio</em>.</li>\n<li>Maudlin, Tim, 2007, “On the Passing of Time”, in his\n<em>The Metaphysics Within Physics</em>, Oxford: Oxford University\nPress, Chapter 4.</li>\n<li>Maxwell, Nicholas, 1985, “Are Probabilism and Special\nRelativity Incompatible?”, <em>Philosophy of Science</em>,\n52(1): 23–43.</li>\n<li>McCall, Storrs, 1994, <em>A Model of the Universe: Space-Time,\nProbability, and Decision</em>, Oxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780198236221.001.0001</li>\n<li>McTaggart, J. M. Ellis, 1908, “The Unreality of Time”,\n<em>Mind</em>, 17(4): 457–474. Reprinted in Le Poidevin and\nMcBeath 1993: 23–34. doi:10.1093/mind/XVII.4.457</li>\n<li>Mellor, D.H., 1998, <em>Real Time II</em>, London: Routledge.</li>\n<li>Meiland, Jack W., 1974, “A Two-Dimensional Passage Model of\nTime for Time Travel”, <em>Philosophical Studies</em>,\n26(3–4): 153–173. doi:10.1007/BF00398876</li>\n<li>Miller, Kristie, 2005, “Time Travel and the Open\nFuture”, <em>Disputatio</em>, 1(19): 223–232.\ndoi:10.2478/disp-2005-0009</li>\n<li>–––, 2017, “Is Some Backwards Time Travel\nInexplicable?” <em>American Philosophical Quarterly</em>, 54(2):\n131–141.</li>\n<li>Mitchell, Sam, 1993, “Mach’s Mechanics and Absolute\nSpace and Time”, <em>Studies in History and Philosophy of\nScience Part A</em>, 24(4): 565–583.\ndoi:10.1016/0039-3681(93)90053-M</li>\n<li>Monton, Bradley, 2006, “Presentism and Quantum\nGravity”, in <em>The Ontology of Spacetime</em>, Dennis Dieks\n(ed.), (Philosophy and Foundations of Physics 1), Dordrecht: Elsevier,\n263–280. doi:10.1016/S1871-1774(06)01014-X</li>\n<li>Moss, Sarah, 2012, “Four-Dimensionalist Theories of\nPersistence”, <em>Australasian Journal of Philosophy</em>, 90:\n671–686.</li>\n<li>Newton, Isaac, 2004, <em>Isaac Newton: Philosophical\nWritings</em>, Andrew Janiak (ed.), Cambridge: Cambridge University\nPress. doi:10.1017/CBO9780511809293</li>\n<li>Newton-Smith, W.H., 1980, <em>The Structure of Time</em>, London:\nRoutledge &amp; Kegan Paul. doi:10.4324/9780429020506</li>\n<li>Parfit, Derek, 1971, “Personal Identity”, <em>The\nPhilosophical Review</em>, 80(1): 3–27. doi:10.2307/2184309</li>\n<li>Paul, L. A., 2010, “Temporal Experience”, <em>Journal\nof Philosophy</em>, 107(7): 333–359.\ndoi:10.5840/jphil2010107727</li>\n<li>Price, Huw, 1994, “A Neglected Route to Realism about\nQuantum Mechanics”, <em>Mind</em>, 103(411): 303–336.\ndoi:10.1093/mind/103.411.303</li>\n<li>–––, 1996, <em>Time’s Arrow and\nArchimedes’ Point: New Directions for the Physics of Time</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195117981.001.0001</li>\n<li>Price, Marjorie, 1977, “Identity Through Time”,\n<em>The Journal of Philosophy</em>, 74: 201–217.</li>\n<li>Prior, Arthur N., 1959 [1976], “Thank Goodness That’s\nOver”, <em>Philosophy</em>, 34(128): 12–17. Reprinted in\nhis <em>Papers in Logic and Ethics</em>, P. T. Geach and A. J. P.\nKenny (eds), London: Duckworth, 1976, pp. 78–84.\ndoi:10.1017/S0031819100029685</li>\n<li>–––, 1962 [1968], <em>Changes in Events and\nChanges in Things</em> (Lindley Lecture Series), Lawrence, KS:\nUniversity of Kansas. Reprinted in Prior 1968b: 1–14.\n [<a href=\"http://hdl.handle.net/1808/12377\" target=\"other\">Prior 1962 available online</a>]</li>\n<li>–––, 1967, <em>Past, Present, and Future</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 1968, <em>Papers on Time and Tense</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 1970, “The Notion of the\nPresent”, <em>Studium Generale</em>, 23: 245–248.\nReprinted in <em>The Study of Time</em>, J. T. Fraser, F. C. Haber,\nand G. H. Müller (eds), Berlin: Springer-Verlag, 1972,\n320–323.</li>\n<li>–––, 1996, “Some Free Thinking About\nTime”, an undated manuscript first published after his death in\n<em>Logic and Reality: Essays on the Legacy of Arthur Prior</em>, Jack\nCopeland (ed.), Oxford: Clarendon Press, pp. 47–51.</li>\n<li>Prosser, Simon, 2016, <em>Experiencing Time</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198748946.001.0001</li>\n<li>Putnam, Hilary, 1967, “Time and Physical Geometry”:,\n<em>Journal of Philosophy</em>, 64(8): 240–247.\ndoi:10.2307/2024493</li>\n<li>Rini, Adriane A. and Max J. Cresswell, 2012, <em>The\nWorld–Time Parallel: Tense and Modality in Logic and\nMetaphysics</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139084215</li>\n<li>Richard, Mark, 1981, “Temporalism and Eternalism”,\n<em>Philosophical Studies</em>, 39(1): 1–13.\ndoi:10.1007/BF00354808</li>\n<li>Rovelli, Carlo, 2017, <em>Reality is Not What It Seems: The\nJourney to Quantum Gravity</em>, New York: Riverhead Books.</li>\n<li>Rynasiewicz, Robert, 2004 [2014], “Newton’s Views on\nSpace, Time, and Motion”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2014/entries/newton-stm/\" target=\"other\">https://plato.stanford.edu/archives/sum2014/entries/newton-stm/</a>&gt;.</li>\n<li>Savitt, Steven F. (ed.), 1995, <em>Time’s Arrows Today:\nRecent Physical and Philosophical Work on the Direction of Time</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511622861</li>\n<li>–––, 2000, “There’s No Time like the\nPresent (In Minkowski Spacetime)”, <em>Philosophy of\nScience</em>, 67(supplement: Proceedings of the 1998 Biennial Meetings\nof the Philosophy of Science Association): S563–S574.\ndoi:10.1086/392846</li>\n<li>Shoemaker, Sydney, 1969, “Time Without Change”,\n<em>The Journal of Philosophy</em>, 66(12): 363–381.\ndoi:10.2307/2023892</li>\n<li>Sider, Theodore, 1999, “Presentism and Ontological\nCommitment”, <em>The Journal of Philosophy</em>, 96(7): 325.\ndoi:10.2307/2564601</li>\n<li>–––, 2001, <em>Four-Dimensionalism: An Ontology\nof Persistence and Time</em>, Oxford: Oxford University Press.\ndoi:10.1093/019924443X.001.0001</li>\n<li>Sklar, Lawrence, 1974, <em>Space, Time, and Spacetime</em>,\nBerkeley, CA: University of California Press.</li>\n<li>Skow, Bradford, 2009, “Relativity and the Moving\nSpotlight”:, <em>Journal of Philosophy</em>, 106(12):\n666–678. doi:10.5840/jphil20091061224</li>\n<li>–––, 2015, <em>Objective Becoming</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780198713272.001.0001</li>\n<li>Smart, J. J. C., 1949, “The River of Time”,\n<em>Mind</em>, 58(232): 483–494. Reprinted in Antony Flew (ed.),\n<em>Essays in Conceptual Analysis</em>, New York: St. Martin’s\nPress, 1966, pp. 213–227. doi:10.1093/mind/LVIII.232.483</li>\n<li>–––, 1963, <em>Philosophy and Scientific\nRealism</em>, London: Routledge &amp; Kegan Paul.</li>\n<li>Smith, Quentin, 1993, <em>Language and Time</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Stein, Howard, 1968, “On Einstein-Minkowski\nSpace-Time”:, <em>Journal of Philosophy</em>, 65(1): 5–23.\ndoi:10.2307/2024512</li>\n<li>–––, 1970, “A Note on Time and Relativity\nTheory”:, <em>Journal of Philosophy</em>, 67(9): 289–294.\ndoi:10.2307/2024388</li>\n<li>Suhler, Christopher and Craig Callender, 2012, “Thank\nGoodness That Argument Is Over: Explaining the Temporal Value\nAsymmetry”, <em>Philosopher’s Imprint</em>, 12: art. 15.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0012.015\" target=\"other\">Suhler and Callender 2012 available online</a>]</li>\n<li>Sullivan, Meghan, 2012a, “The Minimal A-Theory”,\n<em>Philosophical Studies</em>, 158(2): 149–174.\ndoi:10.1007/s11098-012-9888-5</li>\n<li>–––, 2012b, “Problems for Temporary\nExistence in Tense Logic”, <em>Philosophy Compass</em>, 7(1):\n43–57. doi:10.1111/j.1747-9991.2011.00457.x</li>\n<li>–––, 2014, “Change We Can Believe In (and\nAssert): Change We Can Believe In (and Assert)”,\n<em>Noûs</em>, 48(3): 474–495.\ndoi:10.1111/j.1468-0068.2012.00874.x</li>\n<li>–––, 2018, <em>Time Biases: A Theory of Rational\nPlanning and Personal Persistence</em>, Oxford: Oxford University\nPress. doi:10.1093/oso/9780198812845.001.0001</li>\n<li>Swinburne, R. G., 1966, “The Beginning of the\nUniverse”, <em>Aristotelian Society Supplementary Volume</em>,\n40: 125–138. doi:10.1093/aristoteliansupp/40.1.125</li>\n<li>–––, 1968, <em>Space and Time</em>, London:\nMacmillan.</li>\n<li>Taylor, Richard, 1992, “Fate”, in his\n<em>Metaphysics</em>, fourth Edition, Englewood Cliffs, NJ:\nPrentice-Hall, Chapter 6.</li>\n<li>Thomson, Judith Jarvis, 1983, “Parthood and Identity Across\nTime”, <em>The Journal of Philosophy</em>, 80(4): 201–220.\ndoi:10.2307/2026004</li>\n<li>Thorne, Kip S., 1994, <em>Black Holes and Time Warps</em>, New\nYork: W.W. Norton.</li>\n<li>Tooley, Michael, 1997, <em>Time, Tense, and Causation</em>,\nOxford: Oxford University Press. doi:10.1093/0198250746.001.0001</li>\n<li>Torre, Stephan, 2011, “The Open Future”,\n<em>Philosophy Compass</em>, 6(5): 360–373.\ndoi:10.1111/j.1747-9991.2011.00395.x</li>\n<li>Van Inwagen, Peter, 1983, <em>An Essay on Free Will</em>, Oxford:\nClarendon Press.</li>\n<li>–––, 1990, “Symposia Papers:\nFour-Dimensional Objects”, <em>Noûs</em>, 24(2):\n245–255. doi:10.2307/2215526</li>\n<li>Vihvelin, Kadri, 1996, “What Time Travelers Cannot\nDo”, <em>Philosophical Studies</em>, 81(2–3):\n315–330. doi:10.1007/BF00372789</li>\n<li>Weingard, Robert, 1972, “Relativity and the Reality of Past\nand Future Events”, <em>The British Journal for the Philosophy\nof Science</em>, 23(2): 119–121. doi:10.1093/bjps/23.2.119</li>\n<li>Wheeler, Michael, 2011 [2018], “Martin Heidegger”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2018\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2018/entries/heidegger/\" target=\"other\">https://plato.stanford.edu/archives/win2018/entries/heidegger/</a>&gt;.</li>\n<li>Williams, Donald C., 1951, “The Myth of Passage”:,\n<em>Journal of Philosophy</em>, 48(15): 457–472.\ndoi:10.2307/2021694</li>\n<li>Wüthrich, Christian and Craig Callender, 2017, “What\nBecomes of a Causal Set?”, <em>The British Journal for the\nPhilosophy of Science</em>, 68(3): 907–925.\ndoi:10.1093/bjps/axv040</li>\n<li>Yourgrau, Palle, 1999, <em>Gödel Meets Einstein: Time Travel\nin the Göodel Universe</em>, La Salle: Open Court.</li>\n<li>Zimmerman, Dean W., 1996, “Persistence and\nPresentism”, <em>Philosophical Papers</em>, 25(2):\n115–126. doi:10.1080/05568649609506542</li>\n<li>–––, 1998, “Temporary Intrinsics and\nPresentism”, in Peter van Inwagen and Dean W. Zimmerman (eds.),\n<em>Metaphysics: The Big Questions</em>, Oxford: Basil Blackwell, pp.\n206–209.</li>\n<li>–––, 2005, “The A-Theory of Time, The\nB-Theory of Time, and ‘Taking Tense Seriously’”,\n<em>Dialectica</em>, 59(4): 401–457.\ndoi:10.1111/j.1746-8361.2005.01041.x</li>\n<li>Zwart, P.J., 1976, <em>About Time</em>, Amsterdam: North-Holland\nPublishing Co.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "causation: backward",
            "consciousness: temporal",
            "fatalism",
            "future contingents: medieval theories of",
            "Heidegger, Martin",
            "Husserl, Edmund",
            "indexicals",
            "logic: temporal",
            "McTaggart, John M. E.",
            "Newton, Isaac: views on space, time, and motion",
            "presentism",
            "Prior, Arthur",
            "propositions: singular",
            "quantum theory: quantum gravity",
            "space and time: absolute and relational space and motion, post-Newtonian theories",
            "space and time: being and becoming in modern physics",
            "space and time: conventionality of simultaneity",
            "temporal parts",
            "time: the experience and perception of",
            "time: thermodynamic asymmetry in",
            "time travel",
            "time travel: and modern physics",
            "Zeno of Elea: Zeno’s paradoxes"
        ],
        "entry_link": [
            {
                "../causation-backwards/": "causation: backward"
            },
            {
                "../consciousness-temporal/": "consciousness: temporal"
            },
            {
                "../fatalism/": "fatalism"
            },
            {
                "../medieval-futcont/": "future contingents: medieval theories of"
            },
            {
                "../heidegger/": "Heidegger, Martin"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../indexicals/": "indexicals"
            },
            {
                "../logic-temporal/": "logic: temporal"
            },
            {
                "../mctaggart/": "McTaggart, John M. E."
            },
            {
                "../newton-stm/": "Newton, Isaac: views on space, time, and motion"
            },
            {
                "../presentism/": "presentism"
            },
            {
                "../prior/": "Prior, Arthur"
            },
            {
                "../propositions-singular/": "propositions: singular"
            },
            {
                "../quantum-gravity/": "quantum theory: quantum gravity"
            },
            {
                "../spacetime-theories/": "space and time: absolute and relational space and motion, post-Newtonian theories"
            },
            {
                "../spacetime-bebecome/": "space and time: being and becoming in modern physics"
            },
            {
                "../spacetime-convensimul/": "space and time: conventionality of simultaneity"
            },
            {
                "../temporal-parts/": "temporal parts"
            },
            {
                "../time-experience/": "time: the experience and perception of"
            },
            {
                "../time-thermo/": "time: thermodynamic asymmetry in"
            },
            {
                "../time-travel/": "time travel"
            },
            {
                "../time-travel-phys/": "time travel: and modern physics"
            },
            {
                "../paradox-zeno/": "Zeno of Elea: Zeno’s paradoxes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=time\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/time/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=time&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/time/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=time": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/time/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=time&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/time/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.prior.aau.dk/\" target=\"other\">A.N. Prior: The Founding Father of Temporal Logic</a>,\n a web site devoted to the study of Arthur Norman Prior (the founder\nof tense logic), at the Danish Centre for Philosophy and Science\nStudies",
            "<a href=\"https://www.sydney.edu.au/arts/our-research/centres-institutes-and-groups/centre-for-time.html\" target=\"other\">The Centre for Time</a>\n at the Department of Philosophy, University of Sydney.",
            "<a href=\"https://en.wikipedia.org/wiki/Eternalism_%28philosophy_of_time%29\" target=\"other\">Eternalism</a>,\n entry in <em>Wikipedia</em>",
            "<a href=\"https://en.wikipedia.org/wiki/Philosophy_of_space_and_time\" target=\"other\">Philosophy of space and time</a>,\n entry in <em>Wikipedia</em>",
            "<a href=\"https://en.wikipedia.org/wiki/Presentism_%28philosophy_of_time%29\" target=\"other\">Philosophical presentism</a>,\n entry in <em>Wikipedia</em>",
            "<a href=\"https://en.wikipedia.org/wiki/Time\" target=\"other\">Time</a>,\n entry in <em>Wikipedia</em>",
            "<a href=\"https://www.iep.utm.edu/t/timetrav.htm\" target=\"other\">Time Travel</a>,\n entry in the <em>Internet Encyclopedia of Philosophy</em>"
        ],
        "listed_links": [
            {
                "https://www.prior.aau.dk/": "A.N. Prior: The Founding Father of Temporal Logic"
            },
            {
                "https://www.sydney.edu.au/arts/our-research/centres-institutes-and-groups/centre-for-time.html": "The Centre for Time"
            },
            {
                "https://en.wikipedia.org/wiki/Eternalism_%28philosophy_of_time%29": "Eternalism"
            },
            {
                "https://en.wikipedia.org/wiki/Philosophy_of_space_and_time": "Philosophy of space and time"
            },
            {
                "https://en.wikipedia.org/wiki/Presentism_%28philosophy_of_time%29": "Philosophical presentism"
            },
            {
                "https://en.wikipedia.org/wiki/Time": "Time"
            },
            {
                "https://www.iep.utm.edu/t/timetrav.htm": "Time Travel"
            }
        ]
    }
}