{
    "url": "wolff-christian",
    "title": "Christian Wolff",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Matt Hettche\n<mhettch@ncsu.edu>\nCorey Dyck\n<cdyck5@uwo.ca>",
        "author_links": [
            {
                "mailto:mhettch%40ncsu%2eedu": "mhettch@ncsu.edu"
            },
            {
                "mailto:cdyck5%40uwo%2eca": "cdyck5@uwo.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nMatt Hettche\n&lt;<a href=\"mailto:mhettch%40ncsu%2eedu\"><em>mhettch<abbr title=\" at \">@</abbr>ncsu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nCorey Dyck\n&lt;<a href=\"mailto:cdyck5%40uwo%2eca\"><em>cdyck5<abbr title=\" at \">@</abbr>uwo<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jul 3, 2006",
        "substantive revision Mon Sep 30, 2019"
    ],
    "preamble": "\n\nChristian Wolff (1679–1754) was a philosopher, mathematician,\nand scientist of the German Enlightenment. He is widely and rightly\nregarded as the most important and influential German philosopher\nbetween Leibniz and Kant. His scholarly output was prolific, numbering\nmore than 50 (most multi-volume) titles, in addition to dozens of\nshorter essays and prefaces and nearly 500 book reviews. Through his\nseries of textbooks, published first in German and then in Latin,\nWolff made signal contributions to nearly every area of philosophical\ninvestigation of his time, including but not limited to logic,\nmetaphysics, ethics, political philosophy, and aesthetics. Wolff is\nperhaps best known in his role as (co-)founder of the\n“Leibnizian-Wolffian philosophy”, and while Wolff himself\nrejected the term, the philosophical system it designates quickly\ngained broad, if not universal, acceptance within German universities\nin the first half of the eighteenth century.\n\nWolff’s influence on German philosophy is manifold and profound.\nThrough his textbooks and his “martyrdom” for the cause of\nEnlightenment, he succeeded in placing modern philosophical ideas at\nthe forefront of German academic debate. Moreover, since he was among\nthe first to publish philosophical texts in German, Wolff had a\nformative role in establishing German itself as a philosophical\nlanguage. Wolff’s philosophy gained an ascendant position in the\nGerman academy as a result of his own (seemingly tireless) defense of\nhis ideas as well as through his many students and sympathizers,\nincluding Georg Bernhard Bilfinger (1693–1750), Ludwig Philipp\nThümmig (1697–1728), F. Chr. Baumeister (1709–85), A.\nG. Baumgarten (1714–62), G. F. Meier (1718–77), and J. C.\nGottsched (1700–66). Among his more prominent adherents and\n(sometime) admirers, Wolff could count Voltaire, Émilie du\nChâtelet, Moses Mendelssohn, Frederick the Great (who had a hand\nin translating one of his works), and Catherine the Great (who offered\nhim a pension). Kant, who himself owed much to Wolff for both the form\nand content of his philosophy, would later recognize him in the\nPreface to the Critique of Pure Reason as “the greatest\nof all dogmatic philosophers” (B xxxvi).\n",
    "toc": [
        {
            "#BiogSket": "1. Biographical Sketch"
        },
        {
            "#PhilSourRelaLeib": "2. Philosophical Sources and Relationship with Leibniz"
        },
        {
            "#WolfPhilScieMeth": "3. Wolff on Philosophy, Science, and Method"
        },
        {
            "#WolfRati": "4. Wolffian Rationalism"
        },
        {
            "#Meta": "5. Metaphysics"
        },
        {
            "#Onto": "5.1 Ontology"
        },
        {
            "#Cosm": "5.2 Cosmology"
        },
        {
            "#PsycEmpiRati": "5.3 Psychology (Empirical and Rational)"
        },
        {
            "#NatuTheo": "5.4 Natural Theology"
        },
        {
            "#PracPhil": "6. Practical Philosophy"
        },
        {
            "#OthePhilCont": "7. Other Philosophical Contributions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#WolfPrinWork": "Wolff’s Principal Works"
        },
        {
            "#WolfGermText": "Wolff’s German Texts"
        },
        {
            "#WolfLatiText": "Wolff’s Latin Texts"
        },
        {
            "#PrimLiteEnglTran": "Primary Literature in English Translation"
        },
        {
            "#OthePrimSour": "Other Primary Sources"
        },
        {
            "#SeleSecoLite": "Selected Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Biographical Sketch\n\nChristian Wolff was born 24 January 1679 in Breslau in the province of\nSilesia (now part of Poland) to parents of modest\n means.[1]\n Wolff was educated at the Lutheran-humanist\nMaria-Magdelena-Gymansium, where his teachers included Christian\nGryphius (1649–1706), a baroque poet and dramatist, and Caspar\nNeumann (1648–1715), the latter of whom Wolff credited with\nintroducing him to the Cartesian philosophy. In 1699, Wolff enrolled\nat the University of Jena, where he pursued a course of study in\ntheology, physics, and mathematics, moving from there to Leipzig in\n1702 where he would sit the Magisterexamen and then complete\nhis Habilitationsschrift in 1703 entitled: Philosophia\npractica universalis, methodo mathematica conscripta (On\nUniversal Practical Philosophy, composed according to the Mathematical\nMethod). Otto Mencke (1644–1707), the founder of the learned\njournal Acta eruditorum, served as an examiner for the\ndissertation and, impressed, sent it to Leibniz, with whom Wolff\nsubsequently struck up a correspondence that continued until Leibniz’s death in 1716.\n\nDue in part to Leibniz’s support, Wolff was soon offered, and\naccepted, a position in Giessen (though he had also been offered\npositions at Danzig and Wismar) which he intended to take up after\nvisiting his family in Breslau. However, on his homeward journey the\noccupation of Saxony by Charles XII of Sweden required Wolff to take a\ndetour through nearby Halle in Prussia, whose recently founded\nuniversity also happened to be in need of a professor of mathematics.\nWolff was offered the position and, again with Leibniz’s\nassistance, was able to extricate himself from his commitment to\nGiessen, delivering his inaugural lecture at Halle in early 1707.\nDuring the next 15 years he enjoyed a prolific period, publishing and\nlecturing at first primarily in mathematics and natural science,\nthough he began to lecture in philosophy proper around\n 1710.[2]\n Wolff’s first major philosophical textbook was published in\n1713, the Vernünfftige Gedancken von den Kräfften des\nmenschlichen Verstandes und ihrem richtigen Gebrauche in\nErkäntnis der Wahrheit (Rational Thoughts on the Powers of\nthe Human Understanding and its Propert Use in the Cognition of Truth)\n[the German Logic, hereafter GL]. In 1720, Wolff published\nhis German textbook on metaphysics, the Vernünftige Gedanken\nvon Gott, der Welt und der Seele des Menschen, auch allen Dingen\nüberhaupt (Rational Thoughts on God, the World and the Soul\nof Man, and on All Things in General) [the German\nMetaphysics, hereafter GM]. These were followed by further German\ntextbooks on ethics (1720), politics (1721), and physics (1723).\n\nWolff’s expanding philosophical activity, especially concerning\ntopics in natural theology, as well as his popularity as a lecturer\nand growing influence within the university drew the ire of his\nPietist colleagues in the faculty of theology, including August\nHermann Francke (1663–1723), the founder of the famous\nWaisenhaus (orphanage), and Joachim Lange (1670–1744).\nThey took exception to a number of doctrines expressed in\nWolff’s German Metaphysics, including its privileging\nof the intellect to the will, its apparent demotion of freedom to mere\nspontaneity, and the diminished role played by revelation in matters\nof theological interest. While the Pietists were at first content to\nwage a behind-the-scenes campaign, Wolff’s address as outgoing\nrector of the university on 12 July 1721, in which he defended the\nreasonableness of Confucian moral philosophy, led to a significant\nescalation of the dispute. Wolff, asserting the independence of the\nphilosophical faculty, refused to submit the text of his lecture for\nsubsequent examination by the faculty of theology, a conflict that\ncame to involve the university senate and even king Frederick Wilhelm\nI (the “soldier king”) himself. While Wolff enjoyed the\nsupport of officials within the royal court, the Pietists exploited\ntheir personal connections with the king, who was ultimately persuaded\nthat Wolff’s endorsement of the pre-established harmony\nrepresented a threat to military discipline (as the acts of deserters\nwould be pre-established and so not subject to sanction). On 8\nNovember 1723, the king issued an edict removing Wolff from his\nuniversity position and ordering him to leave Prussia within 48 hours\non pain of hanging. The edict was received in Halle four days later,\nand Wolff immediately left Prussian lands on 12 November 1723.\n\nWhile Wolff’s Pietist colleagues celebrated Wolff’s exile\n(reportedly even from the pulpit), it ultimately served only to\nenhance Wolff’s reputation, bringing him to the attention of\nluminaries of the Enlightenment, including Voltaire. He was\nimmediately offered positions in Leipzig and Marburg, the latter of\nwhich he accepted though a special exemption had to be granted to\nallow a Lutheran to teach at a Reformed university. And even as the\ndispute with his critics continued, generating a substantial\nliterature in its own right, Wolff managed during his Marburg years to\ncomplete a reworked Latin presentation of his theoretical philosophy\nintended to make his ideas available to a pan-European audience. These\ntexts include: Philosophia rationalis sive Logica\n(Rational Philosophy, or Logic) of 1728 [the Latin\nLogic, hereafter LL], the first part of which is the\nDiscursus praeliminaris de philosophia in genere\n(Preliminary Discourse on Philosophy in General) [DP]; the\nPhilosophia prima sive Ontologia (First Philosophy, or\nOntology) of 1730 [Ont.]; Cosmologia generalis\n(General Cosmology) of 1731 [Cosm.]; Psychologia\nempirica (Empirical Psychology) of 1732 [EP]; the\nPsychologia rationalis (Rational Psychology) of 1734\n[RP]; and the two-volume Theologia naturalis (Natural\nTheology) of 1736–37 [NT].\n\nFriedrich Wilhelm I eventually thought better of his precipitous\naction against Wolff, as he attempted in 1733 to entice him\n(unsuccessfully) back to Halle and in 1736 lifted a prohibition he had\nenacted against the teaching of Wolffian texts. However, Wolff\nremained in Marburg, collecting tributes and memberships in learned\nsocieties, until the ascension of Friedrich Wilhelm I’s son,\nFriedrich II (the Great), himself an enlightened monarch and admirer\nof Wolff. Wolff accepted the new king’s offer of a\nprofessorship and vice-chancellorship at his previous institution in\nHalle and returned to the city on 6 December 1740 to take up his new\nposition. Wolff continued to lecture and publish actively, with his\nlater efforts devoted particularly to works on the law of peoples,\nnatural law, and ethics. He died in Halle on 9 April 1754.\n2. Philosophical Sources and Relationship with Leibniz\n\nWolff’s wide intellectual interests saw him exposed to a diverse\nset of influences. Neumann not only acquainted Wolff during his time\nat Gymansium with the Cartesian philosophy but impressed on him the\nneed for “mathematical” treatments of philosophical topics\n(including natural theology and practical philosophy). Wolff also\nfamiliarized himself with late Scholastic philosophy, through a\ntextbook by Johannes Scharf (1595–1660), a follower of Suarez;\nindeed, Wolff’s mastery of Scholastic thinking was displayed in\nhis successful disputations with students at the rival (Catholic)\nSt.-Elizabeth-Gymnasium. While Wolff’s own later philosophy\nwould likewise be branded a form of scholasticism, or\nSchulphilosophie, the extent of the influence of Scholastic\nphilosophers, such as Suarez, upon his thought is debated\n(École 2001, Leduc 2018). Wolff’s interest in mathematics\nwas encouraged by his teachers, which interest ultimately brought him\nto Jena where he attended classes from G. A. Hamberger\n(1662–1716), the successor of Erhard Weigel (1625–99); he\nalso studied a Euclidean textbook by J. C. Sturm (1635–1703),\nthough his reflection on its obscurities reportedly brought him his\n“first light concerning the ancient method of\ndemonstration” (Wuttke 1841: 122–3).\n\nA rather important if under-appreciated early influence on\nWolff’s thinking, particularly concerning scientific method, was\nEhrenfried Walther von Tschirnhaus (1651–1708). Tschirnhaus, a\nSaxon nobleman, studied at the University of Leiden where the\nCartesian Geulincx was\n active,[3]\n and was an important member of Spinoza’s circle of friends\n(among whom he circulated the Ethics). Yet, Tschirnhaus was\nalso an active scientist, mathematician, and inventor, who among other\nthings played a (perhaps the) key role in the discovery of\nthe secret for making porcelain. Tschirnhaus’ principal\nphilosophical work is his Medicina mentis (1687,\n2nd ed. 1695), and he characterizes his aim there as\noutlining a “certain and constant method” for the\ndiscovery of all unknown truths. Wolff first gained an interest in\nreading the Medicina mentis while at Gymnasium, but it was\nonly after taking up his mathematical studies in Jena in 1699 that he\nfound himself able to profit from reading it. Wolff evidently read the\ntext with great interest and care, marking his own copy with comments\nand queries and later preparing an excerpted text for use in lectures\nfor students without the requisite mathematical background. Wolff even\nsought out Tschirnhaus himself during an Easter book fair in Leipzig\nto press him with his concerns relating to his method. (After\nTschirnhaus’ death in 1708 Wolff inquired as to the status of\nhis manuscripts but was disappointed to learn that, like Spinoza, he\nhad ordered them destroyed).\n\nIt was G. W. Leibniz, however, who would exercise the most\nconsequential influence on Wolff, both professionally (as seen above)\nand philosophically. Wolff is often described as a disciple or\nfollower of Leibniz, a characterization for which there is some\njustification. So, central tenets of Wolff’s philosophical\nsystem closely resemble those advanced by Leibniz. The commitment to\nmetaphysics, the extensive use of the principle of sufficient reason,\nand the (qualified) endorsement of the pre-established harmony are\namong many striking points of agreement. Indeed, Wolff appears not\nonly to accept the principles and methods of analysis posed by\nLeibniz, but he also identifies opponents to his system, such as\nDescartes, Spinoza, and the Atomists, that Leibniz opposed in his\nown.\n\nTo describe Wolff as merely a disciple of Leibniz, however, is\nmisleading in several respects. First and foremost, this\ncharacterization undercuts the important philosophical differences\nthat existed between the two men. Second it misconstrues the nature of\ntheir relationship and the type of intellectual exchange that\ntranspired between them. During the early part of Wolff’s\ncareer, and the period when he corresponded with Leibniz,\nWolff’s primary focus was in the field of mathematics. It is\nmaintained that Wolff was the first to teach calculus formally in\nGermany (Beck 1969: 257). According to Wolff’s own report\n(Wuttke 1841: 146), when he arrived at Halle in 1707, mathematics was\n“entirely neglected, nay quite unknown, in that\nplace”. With the\nexception of his German Logic, Wolff’s energy early in\nhis career was directed at producing a four-volume Elements of All\nthe Mathematical Sciences [German edition 1710, and Latin edition\n1713] as well as a Mathematical Lexicon [1716]. In this\nlight, it is perhaps not surprising to find the bulk of the\nWolff-Leibniz correspondence dedicated to issues in mathematics.\nAlthough they also exchanged ideas on philosophical topics (for\ndiscussion, see Rutherford 2004), their philosophical\ncorrespondence centered primarily on ethics and philosophical\ntheology.\n\nLeibniz published his Theodicy in 1710, and this work\nremained the only extended presentation of his philosophical ideas\npublished in his lifetime. Apart from a handful of other smaller\narticles written on philosophical topics, most notably,\nMeditations on Knowledge, Truth, and Ideas [1684], A\nSpecimen of Dynamics [1695], and On Nature Itself\n[1698], there were relatively few texts available, and hardly any from\nwhat is regarded today as the core of Leibniz’s corpus,\nfrom which Wolff could have extracted a definitive statement of\nLeibniz’s philosophy. Consider a remark by Leibniz to Nicolas\nRemond, in a letter dated July 1714:\n\n\nMr. Wolff has adopted some of my opinions, but since he is very busy\nwith teaching, especially in mathematics, and we have not had much\ncorrespondence together on philosophy, he can know very little about\nmy opinions beyond those which I have published. (Leibniz 1989b:\n657)\n\n\nThe philosophical works by Leibniz that we typically consider today to\nrepresent his mature philosophical views were published posthumously.\nThe Principles of Nature and Grace appeared in 1718, The\nMonadology in 1720, and the New Essays Concerning Human\nUnderstanding as late as 1765. Although the early Kant and later\nGerman thinkers had the benefit of these texts, Wolff had no such\nluxury when writing his German Metaphysics in 1719.\n\nWhat is significant about considering the relationship between Wolff\nand Leibniz is that although there is clear evidence that Leibniz was\na direct influence on Wolff, there is also equal evidence that\ntestifies to Wolff’s independence from Leibniz, particularly\nwhen Wolff was formulating and first presenting his philosophical\nviews (cf. Corr 1975 for an influential discussion). Recognizing\nWolff’s independence is perhaps important for understanding what\nKant and his contemporaries understood by the expression\n“Leibnizian-Wolffian philosophy”. Instead of taking this\nexpression to mean “the philosophy of Leibniz, interpreted and\npresented by Wolff and his followers”, as it commonly is, it is\nperhaps preferable to understand the expression to mean\n“Wolff’s philosophical system, variously corrected and\nimproved through the posthumously discovered views of\nLeibniz”.\n3. Wolff on Philosophy, Science, and Method\n\nEarly in his career, until shortly after his expulsion from Halle,\nWolff primarily presented his work in the German vernacular. His\nreasons for choosing German, rather than Latin, the standard languages\nfor academic texts in Germany at the time, were both tactical and\ntheoretical. Before Wolff, there were very few philosophical works\nwritten in German. By providing treatises on logic and metaphysics,\nWolff was able to service a noticeable gap in the German university\ncurriculum while at the same time promoting his own philosophical\nagenda. Prior to Wolff’s contributions, the standard text books\nin philosophy were largely outdated Lutheran-scholastic treatises\nmodeled after the treatises of Philipp Melanchthon (1497–1560)\n(cf. Beck 1969: 189–94, 101–10). Unlike English and French\nuniversities, which had set aside hidebound scholasticism and embraced\nmodern ideas and systems, German universities (often under the direct\njurisdiction of local theological authorities) were slow to make such\na change.\n\nBut Wolff also had deep-seated theoretical reasons for writing a\nGerman-language philosophy. He believed that the goal and purpose of\nphilosophy should not only be rooted in what he calls “the\npursuit of the knowledge of the truth” but also in its utility\nand the practical value it has for humans in their everyday life. In\nthe preface to his German Logic, he writes: \n\n\na person should learn philosophy …[not with] a view to the\nvicious taste of the schools for idle disputation and wrangling, but\nin order to [enjoy its] usefulness in future life…. (GL:\nlxxvii; cf. also Corr 1970) \n\n\nBy writing a German-language philosophy, Wolff sought to transform\nphilosophy from a discipline that had become mired in formalism and\ncentered around traditionally defined topics to a discipline that had\ngenuine utility for German students.\n\nAmong the practical aims of Wolff’s philosophy is outfitting the\nmind with the tools it needs to pursue and attain properly scientific\nknowledge, in contrast with “common” or\n“vulgar” knowledge, or as Wolff sometimes says “the\nnatural way of thinking”. If certain groups of facts can be\nshown to follow from “well-grounded” assumptions according\nto strict requirements of demonstration, the class of facts is deemed\nby Wolff to constitute a “science”. Wolff gives several\ndefinitions of the term science:\n\n\nBy science, I understand, that habit of the understanding, whereby, in\na manner not to be refuted, we establish our assertions on\nirrefragable grounds or principles (GL: c. 1, §2).\n\nBy science here I mean the habit of demonstrating propositions, i.e.,\nthe habit of inferring conclusions by legitimate sequence from certain\nand immutable principles (DP: §30).\n\nScience is the capacity to prove from indisputable grounds everything\none asserts or, in a word, the capacity to demonstrate; and in\ndemonstration truths are connected together; therefore through science\none knows the connection of truths, and thus science comes from reason\n(GM: §383).\n\n\nWhile Wolff emphasizes that science is a “habit of the\nunderstanding”, this should be taken to also involve the human\ncapacity of reason, inasmuch as it is the faculty for\nperceiving the connection between truths. When properly employed,\nthen, human reason can discern groups of facts, establish a certain\norder and interconnectedness between these facts, and ultimately\njustify them as being certain parts of human knowledge. Put slightly\ndifferently, science is a disposition or ability of the human mind to\nconceive the facts of reality in an ordered and structured way.\nIndividual sciences, therefore, such as theology, cosmology, or\npsychology, are simply the various sets, or subsets of demonstrable\ncognitions and the principles (including axioms, definitions, and\nempirical facts) from which they are derived.\n\nWolff’s system is also structured according to a notion of\nrational order. The “order of science” pertains to the\nrelationship not only between individual sciences but also between the\nsets of discoverable facts within each given discipline (cf. DP:\n§§132–5). The central idea here is that certain truths\nare known prior to, and serve as a basis for discovering, other\ntruths. And just as there are certain facts that are more fundamental\nand serve as a basis for discovering other facts, there are, Wolff\nbelieves, certain sciences whose subject matter is more basic and\nwhich ultimately stand as the foundation for other sciences that have\na more specialized focus. For example, in the “order of\ndemonstration”, physics follows general cosmology which, in\nturn, follows ontology (or first philosophy) (DP:\n§§94–5).\n\nIt appears, at first glance, that Wolff’s insistence on the\nrational order of science simply follows from a dogmatic metaphysical\nclaim about the structure of reality. A reasonable objection to Wolff\nmight be that his conception of the rational order of science is based\non an unwarranted assumption about the harmonious order he believes to\nbe present in all facets of reality. This harmonious order (the\nobjection continues) illicitly presupposes that a divine architect has\ncreated everything according to a plan and thus the rational order of\nhuman science is simply an upshot of God’s creative power. There\nare certainly passages of Wolff’s works that lend support to\nsuch an objection (see for instance GL: c. 16, §3). However, to\nreduce Wolff’s view of the rational order of science to simply a\ndogmatic metaphysical claim really ignores the practical and common\nsense dimensions to his thought. An important part of the reason why\nWolff believes that there is a rational order to science is because of\nthe progress he believes he has witnessed in such sciences as\nastronomy and optics, which he believes have utilized such an order\nwhen establishing various scientific truths (DP: §139). By virtue\nof the very interconnectedness of the different disciplines (most\nnotably, mathematics with physics and physics with astronomy) the\nclaim for an intrinsic rational order among the sciences is seen by\nWolff to be a pragmatic explanation for what is already largely\nobserved and accepted as the status quo among many natural\nphilosophers (GL: c. 1, §39). Unlike Leibniz, Wolff was much more\nwilling to embrace the advances brought in the name of Newtonian\nnatural philosophy (on this, see the next section).\n\nWolff gives the following definition of philosophy in his German\nLogic: “[p]hilosophy is the science of all\npossible things, together with the manner and reason of their\npossibility” (Preface, §1). Now because of its subject\nmatter, philosophy is considered by Wolff to be the broadest and most\nfundamental science. In the classification of sciences given in his\nPreliminary Discourse, Wolff first divides philosophy into\ntwo branches: practical philosophy, on one hand, and theoretical\nphilosophy, on the other. Practical philosophy deals (in general) with\nhuman actions and includes morality, politics, jurisprudence, and\neconomics. Theoretical philosophy, by contrast, deals with sets of\npossible and actual objects and is (itself) divided into three\nseparate branches: (1) ontology, or metaphysics proper, (2)\n“special” metaphysics, which includes general cosmology,\npsychology and natural theology, and (3) physics (DP: §92).\nWhereas ontology and general cosmology are considered by Wolff to be\ncompletely “pure” (or a priori) sciences,\npsychology, natural theology, and physics are considered to be based\nupon empirical (i.e., historical) principles. As a brief aside, Wolff\nand the Critical Kant hold very different views on the relationship\nbetween practical and theoretical philosophy. Whereas Wolff believes\nthat all of practical philosophy is subordinated to metaphysics (i.e.,\nontology as well as the three sub-disciplines that comprise special\nmetaphysics), the Critical Kant argues for the independence of\npractical from theoretical principles. Wolff, in stark contrast,\nmaintains that discoveries and conclusions made in practical\nphilosophy are necessarily based upon prior conclusions drawn from\nontology or metaphysics.\n\nBefore turning to an examination of Wolff’s theoretical\nphilosophy, and metaphysics in particular, it will be helpful to first\nconsider Wolff’s distinctive, and often misunderstood,\nrationalism.\n4. Wolffian Rationalism\n\nPhilosophical rationalism can be understood to involve any or all of\nthe following: commitment to the existence of innate ideas or\nprinciples, the privileging of a priori cognition to\ncognition known a posteriori, and endorsement of the\nprinciple of sufficient reason (PSR). Even though Wolff is\nofficially agnostic regarding innate ideas, a priori\ncognition (at least in the traditional sense of a cognition from\ngrounds) enjoys a privileged place in his system, and to be sure,\nPSR is central to Wolff’s entire exposition of\nmetaphysics and figures prominently in all levels of his philosophical\nsystem. Wolff is, accordingly, correctly identified as a philosophical\nrationalist; yet, this label has often inspired misleading\ncharacterizations of Wolff’s thought as abjuring all reliance\nupon experience in the aim of constructing a pure intellectual system\nfounded solely on the principle of contradiction. Such a caricature,\nhowever persistent, is to be firmly rejected on both historical and\nphilosophical grounds.\n\nHistorically, this misrepresentation of Wolff as an arch-rationalist\nignores his liberal borrowings from, and deep engagement with,\nempiricistic and scientifically-minded thinkers, most notably Locke\nand Newton. In his capacity as reviewer for the Acta\neruditorum, Wolff was intimately familiar with intellectual\ndevelopments in England—indeed he was brought on by Mencke\nspecifically in order to comment on the mathematical and scientific\ndevelopments there (for which task Wolff taught himself English over a\nSummer)—and he wrote approving early reviews of Newton’s\nOptics and Locke’s Opera posthuma. In general,\nWolff took Locke’s “historical, plain method” as a\nmodel for his own empirical psychology, and admired the blending of\nreason and experiment that characterized Newton’s method, even\nif Wolff was deeply skeptical of Newton’s speculative and\nmetaphysical excursions in the Queries in the Latin edition of the\nOptics and in the General Scholium of the second edition of\nthe Principia (not to mention the metaphysical views\nexplicitly defended by Samuel Clarke in the correspondence with\nLeibniz, for the German edition of which Wolff wrote the preface).\nEven so, Wolff’s importance for the reception of Locke in\nGermany is currently under-appreciated (vide Fischer 1975),\nand his contributions to the reception of Newton have only recently\nbeen explored in some detail (see Dunlop 2013, Stan 2012).\n\nIt might nonetheless be thought that Wolff’s philosophy itself\ndoes not reflect this engagement with empiricism. Indeed, Wolff\nhimself gives this impression when he states in the German\nMetaphysics that experience is opposed to reason such that they\nconstitute “two paths to truth” (GM: §372), and while\nthe path of experience might suffice for the concerns of ordinary\nlife, Wolff makes clear that the philosopher cannot rest content with\nit but must use reason to press beyond what experience offers. That\nthis is so is reflected in Wolff’s distinction between\n“common knowledge or cognition [gemeine\nErkäntniss]” and “the cognition of a philosopher\n[Erkänntniss eines Welt-Weisen]” which he first\noffers in the German Logic:\n\n\nIt can now be seen how common cognition is distinguished from the\ncognition of a philosopher, namely, one who has no understanding of\nphilosophy can learn many things about what is possible from\nexperience, yet, he will not know how to indicate the reason why it\n[i.e., that which he learns from experience] can be. For instance, he\nlearns from experience that it can rain, but cannot say how it happens\n[…] nor indicate the causes why it rains. (GL: Preface,\n§6)\n\n\nThis would suggest, then, that for Wolff the path to genuinely\nphilosophical truth is ultimately that of reason pursued independently\nof experience.\n\nYet, a more careful look at Wolff’s texts reveals that, rather\nthan representing completely divergent paths, reason and experience\nare envisioned as forming a complementary whole, where experience\nprovides an indispensable basis for properly philosophical cognition\nand even serves to confirm the latter’s results. Indeed, the\nimportant dependence of philosophical cognition upon\nexperiential cognition is emphasized in Wolff’s later discussion\nin the Preliminary Discourse. There, Wolff labels the\ncognition of that which is and which happens historical\ncognition (DP: §3), and contends that cognition of the reason of\nthat which is or occurs, that is, philosophical cognition (DP:\n§6), frequently relies on historical cognition as its foundation\n(fundamenta). This is the case, for instance, when we\ndiscover by means of experience something that can serve as the ground\nfor something else that is or occurs (DP: §10). Since that which\nis known directly through experience is, for Wolff, “firm and\nunshakeable” (DP: §11), it follows that anyone who strives\nfor philosophical cognition should not neglect the historical, or as\nWolff claims, that \n\n\nhistorical cognition should precede philosophical cognition and be\nconstantly conjoined with it so that it does not lack a firm\nfoundation. (DP: §11; cf. Kreimendahl 2007)\n\n\nUnsurprisingly, Wolff sets up his distinctive emphasis on experience\nand introduces his innovations in philosophical method in conscious\nopposition to his rationalist predecessors. He faults Descartes, for\ninstance, for attempting to posit universal metaphysical principles\n“from which one will deduce through the mere understanding\neverything that is possible in nature” (Wolff 1723\n[Preface]). Instead,\nWolff recommends near the end of the German Logic that the\nphilosopher should be trained \n\n\nto draw determinate propositions from experience and with the help of\nsome to find the ground of others, consequently, to unite reason with\nexperience (GL: c. 16, §11) \n\n\nand later, in his oft-used metaphor, Wolff characterizes philosophical\ncognition itself as a “marriage of reason and experience\n[connubium rationis et experientiae]” (LL: §1232;\ncf. Cataldi Madonna 2001). Ideally, then, Wolff construes reason and\nexperience as converging toward a common end rather than constituting\ndivergent paths, and the philosopher is warned against pursuing one at\nthe expense of the other (DP: §11). In this way, Wolff’s\nrationalism clearly separates itself from the spirit of classical\nrationalism.\n5. Metaphysics\n\nPhilosophy is a science of possible and actual reality. According to\nWolff’s own taxonomy, theoretical philosophy is divided into\nthree separate branches: ontology (or metaphysics proper),\nspecial metaphysics, and physics. Cosmology, as a branch of\nmetaphysics, is a special or restricted science insofar as its subject\nmatter deals with the “world-whole” rather than\n“being in general” (the subject matter of ontology).\nAlthough there is an important sense for Wolff in which ontology is\nrelevant for, and even necessarily grounds cosmology and the other\nspecial sciences, cosmology (itself) stands in a grounding\nrelationship to physics that is, yet again, a more narrow and\nspecialized discipline (Cosm. §121). Just as there are certain\nprinciples and certain truths established in ontology that are\nrelevant for cosmology, there are certain principles and certain\ntruths established in cosmology that are relevant for the more\nspecialized science of physics. In fact, within Wolff’s system\nthere is complete uniformity from the top-down (so to speak), so that\neven principles of ontology are relevant for the discipline of\nphysics.\n5.1 Ontology\n\nWolff’s ontology is constructed on two foundational principles,\nnamely, the principle of contradiction [PC hereafter] and the\nprinciple of sufficient reason. According to Wolff, PC is the\nfundamental principle of human thought, the very first principle of\n“all metaphysical first principles”, and the “font\n[or source] of all certitude” (Ont. §§54–5). It\nis regarded by him to be a self-evident first principle, its truth\nmade manifest through our inability to think in a manner contrary to\nit. In the Ontologia, he writes:\n\n\n§27. We experience…[PC]… in the nature of\nour mind, in that, while it judges something to be, it is impossible\nat the same time to judge the same not to be….\n\n§28.…[I]t cannot happen that the same thing simultaneously\nis and is not….\n\n§30.…[For] … contradiction is simultaneity in\naffirming and denying.\n\n\nPC is the “font of all certitude” insofar as, if\nit were called into question, the most evident and secure judgments of\nhuman knowledge, such as knowledge of the self (as a thinking thing),\ncould likewise be called into question. We recognize the fact of our\nown existence by recognizing the psychological impossibility of\ndenying it. But if it were possible both to affirm and also deny our\nown existence (simultaneously), then the experience of certitude that\naccompanies this cognition would thereby be undermined.\n\nWolff contends that PC is not only for our thinking but, in\ndefining the limits of what is conceivable or not, also serves to\ndistinguish the possible from the impossible. So, impossibility,\ndefined formally, is that which involves a contradiction, whereas that\nwhich does not is taken to be possible. Now for Wolff,\n“possible” and “possible thing” are basically\nsynonymous terms. What is possible as a concept is simply reducible to\nwhat is possible as a thing. The realm of concepts and the ontological\nrealm of objects converge in the Wolffian system (Kuehn 1997). A thing\nor “being” is defined as “that which does not\ninvolve a contradiction” (Ont. §135). A possible concept,\nconsequently, is that which corresponds to a possible object (Ont.\n§§57, 59, 60). This analysis of the concept of the possible\ntypifies Wolff’s non-existential and essence-centered approach\nto ontology. Very briefly, Wolff’s understanding of being (or\nwhat is) involves regarding being in its most general sense. A being\nis “something” if and only if it is intrinsically\npossible, and something is intrinsically possible, if and only if its\npredicates or “determinations” are not contradictory.\n“Nothing”, in contrast, is simply a term that is empty of\nall content. In the ontological realm of objects there is literally\nno thing to which “nothing” corresponds (Ont.\n§57). Nothing, by definition, is not thinkable or\nconceivable.\n\nOne important point to emphasize about Wolff’s exposition of\nontology is that existence (or the actual reality of being) is\nregarded exclusively as a determination or “complement” of\na possible thing (Ont. §174). Although existing things are\nincluded in his overall description of reality, they are not as a\nclass of objects his primary focus. More accurately, existing objects\nfigure into Wolff’s metaphysical account only insofar as\nexisting objects are a subset of possible things.\n\nWith the notions of “possible thing”,\n“something”, and “nothing” firmly in hand, we\ncan now explain the notion of reason (Grund or\nratio) that Wolff includes in his definition of philosophy.\nInsofar as the subject matter of philosophy concerns the realm of all\npossible things, Wolff believes that the task of the philosopher is to\nprovide “the manner and reason” of their possibility.\nWarrant for this claim is grounded in the idea that everything,\nwhether possible or actual, has a “sufficient reason” for\nwhy it is rather than not. In §56 of his Ontologia, he\nwrites: “By sufficient reason we understand that from which it\nis understood why something is [or can be]”. Unlike Leibniz who\nessentially restricts the notion of sufficient reason to\n“contingent truths of fact”, Wolff considers the notion to\nhave a much broader scope of application to include the set of all\npossible objects and what Leibniz calls “necessary truths of\nreason”. The idea that everything has a sufficient reason is\npresented formally by Wolff as the principle of sufficient reason.\n\nWolff’s most extensive treatment of the PSR appears in\n§§56–78 of his Ontologia. In this discussion,\nWolff appears to give two separate accounts of the theoretical origin\nof the principle. On the one hand, in §70, Wolff provides a proof\n(or derivation) of PSR from PC and the notions of\n“something” and “nothing”. And, on the other\nhand, in §74, Wolff claims PSR is a principle of the\nhuman mind and a self-evident logical axiom. Although prima\nfacie, it is unclear why Wolff attempts to advance both views, it\nis perhaps worth pointing out the difference between (1) being able to\nbe demonstrate the truth of a proposition and (2) knowing the truth of\na proposition because it is self-evident. While demonstrating the\ntruth of a proposition yields knowledge of it, to know a proposition\nbecause it is self-evident may or may not mean the proposition is also\ndemonstrable. There is no inconsistency, for example, in holding that\none and same proposition is both self-evident and demonstrable. A\nproposition could be known immediately one way and yet, in another\nway, follow as a conclusion of a sound deductive argument.\n\nWolff believes that the fact that PSR obtains becomes\napparent when we consider three specific aspects of our\nrational/conscious experience. The first is that PSR is never\ncontradicted by experience; the second is that we can recognize\nsingular instances, or examples, of it in our experience of the world,\nand the third is that we have an inquisitive attitude toward our\nsurroundings and future life (Ont. §§72–4). For Wolff,\nthese characteristics are not regarded as empirical evidence for\nPSR, but rather that PSR is a necessary\npresupposition for these characteristics to be a part of our conscious\nexperience. Thus by simply reflecting on the nature of our\nunderstanding of the world, Wolff believes that we arrive at the\nmanifest truth of PSR.\n\nNow according to Wolff there are at least four self-evident\n(axiomatic) principles of human thought: PC, the principle of\nexcluded middle, the principle of certitude (or principle of\nidentity), and PSR (Ont. §§52–55). Of these,\nonly PC is indemonstrable in the sense that the truth of the\nprinciple cannot be proved to follow from a formal deductive\ninference. As we have seen, Wolff believes that we gain assurance of\nthe truth of this principle by attending to the psychological\nexperience of not being able to both affirm and deny our own existence\nin introspection. Thus only in a weak (and non-Wolffian) sense of\n“demonstration” can Wolff be said to demonstrate the truth\nof PC. The remaining principles, however, are demonstrable in\nthe strict sense and each, he believes, can be derived from\nPC. His demonstration of PSR in §70 of the\nOntologia is as follows:\n\n\nNothing exists without a sufficient reason for why it exists rather\nthan does not exist. That is, if something is posited to exist,\nsomething must also be posited that explains why the first thing\nexists rather than does not exist. For either (i) nothing exists\nwithout a sufficient reason for why it exists rather than does not\nexist, or else (ii) something can exist without a sufficient reason\nfor why it exists rather than does not exist (§53). Let us assume\nthat some A exists without a sufficient reason for why it\nexists rather than does not exist. (§56) Therefore nothing is\nto be posited that explains why A exists. What is more, A is admitted\nto exist because nothing is assumed to exist: since this is\nabsurd (§69), nothing exists without a sufficient reason; and if\nsomething is posited to exist, something else must be assumed that\nexplains why that thing exists.\n\n\nThe crucial premise (italicized above) purports to reveal a\ncontradiction that follows from the assumption that something exists\nwithout a sufficient reason. Since “nothing” cannot both\nbe something and nothing at the same time (according to PC),\nthe conclusion (or PSR) is claimed to follow. This proof was\nthe subject of an incisive critique by Wolff’s contemporary and\ncritic, Christian August Crusius (1715–75), who (among other\nthings) accuses Wolff of an equivocation with the term\n“nothing”, and once the two different meanings of this\nterm are identified (viz. nothing as the opposite of\nsomething, on one hand, and nothing as a non-being, on the other), the\nsupposed contradiction, purported to follow from the assumption,\ncannot be established (Crusius 1741).\n\nIn any case, for Wolff, the expression “to provide the reason of\nsomething” can be taken in two different ways. On the one hand,\nif the something for which a reason is provided is regarded solely as\na possible thing, then “reason” stands to account for why\nthat thing (as a possible thing) is the possible thing that it is.\nAccording to Wolff, every being is endowed with an essential nature.\nPossible things have natures insofar as they as are comprised of a\nnumber of non-contradictory determinations or predicates. Different\nsets of determinations, and the relationships among these\ndeterminations, serve as the principle of individualization within the\nrealm of possible things. Hence, to provide the reason for a possible\nthing is simply to enumerate the determinations that make that thing\nthe kind of possible thing that it is. A reason, in this sense, is\nregarded by Wolff as ratio essendi or the “reason of\nbeing”.\n\nIf, on the other hand, the something to which a reason is provided is\nan actual (i.e., existing) thing, then “reason” stands to\nexplain why that thing as an actual thing comes into existence.\nReason, in this sense, is regarded as ratio fiendi or the\n“reason of becoming”. Recall that for Wolff existence is\nsimply a predicate or determination of possible things. A familiar\nexpression appearing in Wolff’s writings is that existence is\n“the complement of possibility” (Ont. §174). The\nbasic idea here is that existence, as a predicate, perfects a possible\nthing by making it actual and a “real individual”. Real\nindividuals differ from nominal beings insofar as the former are\n“complete and determinate”. To be “complete and\ndeterminate”, in Wolff’s sense of the expression, means\nthat every aspect or determination of a thing can be specified and\nthat its determinations are sufficient to individuate it from all\nother things. Nominal beings, although “complete”, are\nindeterminate (cf. GL: c. 1, §15). That is to say, although there\nis a certain set of specifiable determinations that is sufficient to\npick out a given possible thing among all possible things, the total\nset of its determinations is not specifiable. A being, in the most\ngeneral sense, is comprised of three different types of\ndeterminations: essentialia, attributes, and modes. Essential\ndeterminations define the essential nature of a being and a\nbeing’s attributes follow from, or are determined by, its\nessentialia. Whereas essentialia and attributes are\nboth necessary properties of a thing, modes are contingent or\naccidental properties. Thus to say a nominal being is indeterminate is\nto say that there are modes of it that may or may not be present. In\nthe weakest sense, since existence is a mode, and nominal beings do\nnot exist (as such) but are able to come into existence under certain\nconditions, all nominal beings are indeterminate.\n\nDiscerning the difference between the “reason of being”\nand the “reason of becoming” is important for\nunderstanding the different ways Wolff employs PSR in his\nexposition of metaphysics. Depending on how exactly\n“reason” is interpreted, the principle, “nothing is\nwithout a sufficient reason for why it is rather than not” may\napply either to the realm of possibility or to the realm of actual\nreality. Toward the end of his Ontologia, Wolff makes an\nattempt to recognize formally two different versions of PSR\nas “the Principle of Being” and “the Principle of\nBecoming” respectively (Ont. §866). As a Principle of\nBeing, PSR stands as a definition of a thing’s\nessential nature. Yet as a Principle of Becoming, PSR serves\nto furnish the causes, or grounds, for why a real individual comes\ninto actuality.\n\nIt is on the basis of PC and PSR that Wolff proceeds\nto explicate the fundamental concepts of his ontology. Recall that for\nWolff a being in the most general sense is any possible thing.\nPossible things have essential natures insofar as they are composed of\na number of non-contradictory determinations or predicates. The\nessence of any given possible thing is its principle of being, or\nprinciple of individualization. Whereas the essence of a simple being\nis defined by its essential properties, the essence of a composite\nbeing is defined by the manner in which its parts are combined\ntogether. In §532 of his Ontologia, Wolff explains:\n\n\nA being is called composed which is made up of many parts distinct\nfrom each other. The parts of which a composite being is composed\nconstitute a composite through the link which makes the many parts\ntaken together a unit of a definite kind.\n\n\nIn one respect, simple beings and composite beings are not simply two\ndifferent species of beings. It is not the case, for example, that\nwithin the realm of all possible things simple beings exist separate\nfrom, and in addition to, composite beings. More accurately, at the\nnominal level of reality simples and composites result from an\nepistemological distinction imposed by a perceiving mind in its\nanalysis of what “exists” (i.e., exists in a nominal\nsense). Strictly speaking, the only substantial things to exist at any\nlevel of reality are simple substances. Simples are defined by their\nessentialia, and to borrow an expression from Gilson,\nessentialia are both “compatible and prime”\n(Gilson 1952: 114). That is to say, the essential properties that\ndefine a given simple substance do not contradict one another, or\ncancel each other out, and they are (themselves) not determined by any\nother thing and/or property. In this light, Wolff’s notion of\nsubstance is perhaps best regarded as a notion of essence, where each\nsimple substance is a different set of compatible and prime essential\nproperties (see Burns 1966: 26 and Gilson, 1952: 115). Furthermore,\nessential properties should not be viewed as the accidents of\nsubstance because, according to Wolff, they are the substance itself.\nIn Wolff’s system, the accidents of substance are the properties\nthat exist by virtue of a thing’s essentialia. And\naccording to Wolff, there are three basic classes of accidents: proper\nattributes, common attributes, and modes (Ont. §148).\n\nProper and common attributes of substance follow from and are\ndetermined by a thing’s essentialia. Proper attributes\nare the properties of a thing that are determined by all the\nessentialia taken together, and common attributes are the\nproperties of a thing that are determined by only some, but not all,\nits essentialia. Attributes (as such) are perhaps best\nunderstood as necessary accidents, since they are determined by and\nnecessarily follow from a thing’s essentialia. Modes,\nin contrast, are only contingent accidents of substance. They are the\nproperties of a thing that may or may not be present, and if actually\npresent, they are causally the result of some contingent state of\naffairs. More precisely, the possible presence of any given mode\nfollows from a substance’s essentialia, but the actual\npresence of a given mode is the result of something outside the\nsubstance’s essence that is causally responsible for its\npresence in a being. At the nominal level of reality, composite beings\nexist insofar as the accidents of a certain simple substance, or set\nof simple substances, are linked and/or arranged together in a certain\nsort of way. In §789 of his Ontologia, Wolff writes:\n\n\n\n[t]he essence of a composite being consists only in mere accidents for\nthe essence of a composite consists in the manner in which its parts\nare combined with one another.\n\n5.2 Cosmology\n\nThe notion of “extended-composite” lies at the heart of\nWolff’s doctrine of the world-whole. Cosmology, as a special\nmetaphysical science, is the study of the world-whole in general. The\nworld, as such, is an extended composite of extended composites. In\n§544 of his German Metaphysics, Wolff explains:\n\n\nThe world is a collection of mutable things that are next to each\nother, follow upon one another, but which are overall connected with\none another.\n\n\nIn precise terms, Wolff believes the world is an extended whole that\nis composed of a finite number of interacting physical bodies. To\nbetter understand the types of cosmological claims that Wolff defends\nabout the universe, it is perhaps helpful to consider first his\nconception of physical bodies. Ultimately, the conclusions that Wolff\ndraws at the macroscopic level about the world-whole are simply\nextrapolated from his analysis of physical bodies. After considering\nWolff’s analysis of body, this section will conclude with an\noverview of Wolff’s view of space, time and material\nextension.\n\nWolff’s analysis of physical bodies is given from two different\nperspectives. First is the “bottom-up” metaphysical\naccount of bodies, where bodies are defined as aggregates of simple\nsubstances, and second is the “top-down” mechanistic\ndescription, where the reality of bodies, given by the testimony of\nthe senses, is explained in terms of interacting primitive\ncorpusula (or corpuscles). To facilitate our discussion, we\nshould identify the three levels of description that Wolff employs\nwhen giving his two perspective account. Identifying these three\ndifferent levels is helpful in understanding at what respective point\nthe mechanical and metaphysical accounts each terminate or bottom\nout.\n\nThe ground floor (so to speak) is the atomic level that is occupied by\na “multitude” of simple substances. Unlike simple\nsubstances at the nominal level of reality that lack the “mode\nof existence”, simples at the atomic level are real individuals\n(i.e., complete and determinate, actually existing beings). In\naddition to the term “simples”, Wolff also refers to these\noccupants of the atomic level as “elements” and\n“atoms of nature” (atomi naturae). Atomic\nelements (as such) are conceived by Wolff to be “unextended\npoints of force” that lack internal motion (motus\nintestinus) but yet remain in a constant state of change. Each\natomic element is defined, or individuated, by its own distinctive\ninternal state and each is considered to be indivisible in-itself.\nAlthough later Wolffians, such as Baumeister, would eventually refer\nto Wolff’s atomic elements as “monads”, there is at\nleast one important respect in which Wolff’s atomic elements are\ndifferent from Leibniz’s monads (Baumeister 1747: 226). Leibniz\nconceives monads as simple unextended substances, and hence Leibnizian\nmonads are “windowless” substances that do not interact or\ninfluence one another. Wolff’s atomic elements, in contrast, do\ninteract and have real dynamic influence over each\n other.[4]\n\n\nThe second level of description that Wolff employs when giving his\naccount of bodies is the microphysical level. The occupants of this\nlevel are the primitive parts of bodies which Wolff calls corpuscles\nor material atoms. In §186 of his Cosmologia, Wolff\nprovides a helpful contrast between atoms of nature, on one hand, and\nmaterial atoms, on the other:\n\n\nThat is called an atom of nature which is indivisible in itself\nbecause it is devoid of parts into which it can be divided. That is\ncalled a material atom which in itself is able to be divided, but for\nactually dividing it, existing causes in rerum natura are not\n adequate.[5]\n\n\nMaterial atoms or corpuscles are indivisible in the sense that there\nis nothing within the world that is capable of reducing them into\nfurther parts. Corpuscles represent the lowest level of explanation\nthat is possible within a mechanical account of bodies. Similar to the\natomic level, the microphysical level lies beyond the boundaries of\nhuman perception. Wolff believes that although corpuscles are\nextended, fill space, and are endowed with the “force of\ninertia”, a precise statement of their size, magnitude, and\nshape cannot be empirically determined. It is unclear, for example,\nwhether all corpuscles retain homogeneity with respect to their\nmagnitude and shape. Yet because corpuscles are a species of composite\nbeings, Wolff is confident that the essence of a corpuscle consists in\nthe manner in which its parts are joined together. A corpuscle is an\naggregate of atomic elements. Its component parts are simply the\nunextended points of force that occupy the atomic level.\n\nThe third level of description that Wolff employs when giving his\naccount of bodies is the level of appearance or sensible reality. It\nis at this level that bodies and their phenomenal properties, such as\nextension, the force of inertia, and motor force (vis\nmotrix), are described in mechanistic terms. In §793 of his\nOntologia, Wolff writes:\n\n\nI prefer that aggregates of simple substances, namely, those compound\nbeings of which the material world is composed, be called bodies\nrather than simple substances…\n\n\nIn a strict sense, a body is considered by Wolff to be a composite of\ncomposites. The interacting atomic elements (conceived as unextended\npoints of force) give rise to primitive corpuscles and from the\ncohesion of corpuscles, a body is thereby constituted at the level of\nappearance. Wolff writes, “ … each body has its origin in\nthat which is not extended, although it is itself extended”\n(Cosmologia, §223). At the level of appearance, bodies\ndisplay a number of determinate properties. Each body has a\nspecifiable size or magnitude (i.e., it can be measured), it occupies\na fixed space or place (insofar as it is extended), it displays a\ncertain shape, and it is divisible to the primitive corpuscles from\nwhich it is composed. Yet, according to Wolff, the properties of\nbodies should not be considered as the accidents of anything\nsubstantial because bodies are merely phenomenal manifestations of\nreal, interacting, atomic elements. Even the principal properties of\nbodies used in the analysis of bodily change and motion (i.e., the\nproperties used in mechanics), such as extension, the force of\ninertia, and motor force, are deemed by Wolff to be phenomenal\nproperties.\n\nNow according to Wolff all sensible properties of bodies should be\nconsidered as secondary (or mind-dependent) qualities. In §144 of\nhis Cosmologia, Wolff writes: “…extension is a\nphenomenon in the same sense in which color is accustomed to be called\na phenomenon…”. And somewhat later in this same work, he\nstates in §298: “[t]he force of inertia is called a\nphenomenon in the same sense in which all sensible qualities are\ncalled phenomena”. Perhaps the best way to understand\nWolff’s view of sensible properties is to consider a quick\ncomparison with Locke’s corpuscularian view of bodies. For\nLocke, the primary qualities of bodies, such as extension, solidity,\nshape, size and texture give rise to the secondary qualities that we\nperceive in bodies, such as color, sound, taste, smell and\ntemperature. According to Locke, secondary qualities are nothing in\nthe objects themselves but are the result of certain\n“powers” inherent in the primary qualities of things which\neffect various sensations in us, such as the sensation of a certain\ncolor or temperature. Thus it is by virtue of a body’s\nmicro-structure that we are able to perceive its secondary qualities.\nWolff, for the most part, accepts this causal-corpuscularian theory of\nsecondary qualities. However, unlike Locke, Wolff believes that all\nsensible properties are secondary qualities that result from a\nbody’s atomic structure. In very simplistic terms, sensible\nproperties are for Wolff what color, sound, taste, smell and\ntemperature are for Locke. For both philosophers, secondary qualities\nare phenomenal and mind-dependent properties having their causal\norigin in some objective (i.e., mind-independent) reality. For Locke,\nthis reality is the independently existing corpuscles that comprise\nthe material world; and for Wolff, this reality is the unextended\npoints of force, or simple substances, that occupy his atomic level\ncf. Cosm. §191).\n\nBefore explaining Wolff’s view of how extended composites come\ninto being (i.e., the causal process that allows us to form our ideas\nof extended objects), it is necessary to say a few prefatory words\nabout his view of space and time. The notions of “place”\nand “space”, on one hand, and the notion of\n“time”, on the other, figure in at different stages of\nWolff’s exposition of extended reality.\n\nFirst and foremost, there is an important distinction in Wolff’s\ncosmology between “general space” and “particular\nspace”. Particular space (or a given place) is what an extended\nbody “fills” or “occupies” by virtue of its\ncorpuscular parts (Cosm. §§122–4). Its reality is\nderivative of the interacting atomic elements that give rise to\nindividual corpuscles. For Wolff, a corpuscle’s place simply\nresults from a corpuscle’s extension. A given place is conceived\nas an imaginary immobile container that has the same dimensions as the\nextended thing that occupies it (Ont. §§676–9).\nGeneral space, in contrast, is conceived as the perceived order of\ncoexisting bodies. As explained above, the existence of bodies is\nestablished by Wolff experientially and amounts to an instance of\nhistorical cognition. In §45 and §46 of his German\nMetaphysics, Wolff explains:\n\n\nIf we pay attention to ourselves [as thinking things], we will find\nthat we are conscious of many things outside ourselves. However, we\nset them apart from us in that we recognize that they are\ndistinguishable from us, just in the same way as they are set beside\neach other, we recognize they are distinguishable from each\nother…. In that there are many things now which exist at the\nsame time and which are presented apart (and yet at the same time\ndifferent) from each other, such things come into being under a\ncertain order. And as soon as we perceive this order we perceive\nspace. Therefore, if we do not want to examine the matter differently\nthan we recognize it, we must assume space is the order of such things\nwhich are simultaneous.\n\n\nWolff’s derivation of general space essentially involves three\nsteps. First, knowledge of the self, as a thinking thing, affords a\ndistinction between consciousness, on one hand, and consciousness of\nexternal things, on the other. Second, since that which is conscious\n(viz. the self) is different from that of which it is\nconscious (viz. the world), the self can recognize the\nhistorical and mathematical fact that it is conscious of many external\nthings at one time (i.e., the world as a plurality). And third, since\nthis empirical fact affords knowledge of real existences, the order or\nway the self represents these things is what becomes known as space.\nTo borrow Kant’s terminology, Wolffian space lacks\n“objective reality” because it is simply abstracted from\nthe coexistence of things in the world, and therefore takes on purely\na subjective character (cf. Beck 1969: 270).\n\nIn contrast to his theories of place and general space, Wolff holds a\nmuch more realistic theory of time. In a strict sense, place and space\nserve an explanatory role for Wolff at two distinct levels of\ndescription (viz. the micro-physical level and the level of\nappearance). Since atomic elements are unextended, the concepts of\nplace and space are considered by Wolff to be extraneous at the atomic\nlevel. Time, however, is not. Atomic elements are in time insofar as\neach element is in a constant state of change. In his most general\ndescription of time, Wolff writes: “[t]ime is the order of\nsuccessive things in a continuous series” (Ont. §572).\nSince each atomic element produces in-itself a constant and continuous\nseries of changes, time is regarded by Wolff as the objective measure\nof such changes. One clear statement of the Wolffian view of the\nrelationship between time and change can be found in a letter to Kant\n(dated 13 October 1770) from Johann Heinrich Lambert. Lambert\n(1728–77) writes:\n\n\nAll changes are bound to time and are inconceivable without time. If\nchanges are real, then time is real, whatever it may be. If time is\nunreal, then no change can be real. I think, though, that even an\nidealist must grant at least that changes really exist and occur in\nhis representations, for example, their beginning and ending. Thus\ntime cannot be regarded as something unreal. It is not a substance,\nand so on, but a finite determination of duration, and like duration,\nit is somehow real in whatever this reality may consists (AA\n10:107***AA?*).\n\n\nFor Wolff, Lambert, and Moses Mendelssohn, time is real insofar as it\nis an objective measure of change (cf. Falkenstein 1991 for\ndiscussion). Change is a constant feature of existing reality in that\nreal individuals are finite and created beings with a determinate\nduration. Real individuals come into and go out of existence. Time,\ntherefore, is applicable to the series of changes that occur within a\ngiven individual and, in the same respect, it is applicable to the\ntotality of all the individuals that compose the world-whole. Thus for\nWolff there is a meaningful sense in which real individuals and the\nworld-whole (itself) are “in time”. This is not to say,\nhowever, that time is granted its own ontological existence. In\nLambert’s words, time is not a substance (i.e., something real\nin-and-of itself). More precisely, time is the measure of the\nobjective order of change that real things undergo.\n\nUnderstanding the sense in which atomic elements are “in\ntime” is important for grasping the manner in which\nWolff’s atomic elements interact. Since atomic elements lack\nextension, the nature of atomic interaction is not spatial. It is not\nthe case, for example, that Wolff’s simple substances influence\none another by physical contact and repulsion. Instead, atomic\nelements as unextended points of force affect, and are responsive to,\ndegrees of change by communicating with each other in time. The series\nof changes internal to a given atomic element are the result of its\nown power (or motor force) as well as the motor forces of other\nelements to which it is connected. Ultimately Wolff believes that it\nis the interacting forces of a multitude of simple substances that\ngives rise to our idea of an extended object. In particular, we\nperceive extended objects at the level of appearance insofar as there\nare unextended points of force interacting in time at the atomic\nlevel. Our confused perception of this temporal interaction results in\nthe idea of an extended object. Similarly to Locke, Wolff believes\nthat it is the primitive qualities of a composite that produce, or\neffect in us, the various ideas we have of its secondary qualities.\nSince all sensible properties are considered by Wolff to be secondary\nqualities, extension, or a composite’s extendedness, results\nfrom the primitive forces of a composite at the atomic level. The\nanalogy that Wolff presents to help explain the phenomenal\nmanifestation of extension involves a rapidly ringing bell (Cosm.\n§789; cf. Burns 1966: 52). According to Wolff, just as the\nimpression we gain from a rapidly ringing bell is the sound of one\nprolonged peal, where the successive strikes of a bell’s clacker\nare perceived as one monomial sound, our impression of extension is\nlikewise the result of many successively acting atomic forces that\ngive rise to our confused perception of one continuous extended\nobject.\n\nThe notion of “extended-composite”, as already mentioned,\nis what ultimately stands at the heart of Wolff’s doctrine of\nthe world-whole. Insofar as the world is a composite being, it follows\nfrom the principles of Wolff’s ontology that the world’s\nessence consists in the manner in which its parts are linked together.\nThe world’s parts, as described from the standpoint of\nappearance, are simply the multitude of interacting physical bodies\nthat are perceived in everyday life. And, if described from a\nmetaphysical standpoint, the world’s parts are conceived by\nWolff to be the interacting unextended points of force that occupy his\natomic level. Yet regardless of what standpoint or level of\ndescription is employed, it is clear that a necessary condition of the\nworld’s existence is that its parts need to be interconnected.\nAccording to Wolff, the world is conceived as a substantial whole\n(totum substantiale) by virtue of the fact that all of its\nparts form real reciprocal connections with one another. On the basis\nof this “interconnection-thesis” the world is defined\nformally by Wolff as “a whole which is not also a\npart”.\n5.3 Psychology (Empirical and Rational)\n\nWhile the soul, as a simple substance, is understood to be a part of\nthe world, and so is implicated in the treatment of cosmology, this\ndoes not exhaust what can be known of it, a fact that leads Wolff to\ntreat it as a separate topic of metaphysics. Indeed, Wolff’s\npsychology constitutes one of his signal and most historically\ninfluential innovations. Most generally, insofar as Wolff seeks to\noffer a scientific account of the human soul specifically,\nand indeed with a focus on its cognitive and conative functions, his\npsychology represents a significant, and distinctly modern, departure\nfrom both the treatment of the soul in the context of a generic\nscience of living things, still prevalent among Aristotelian natural\nphilosophers in seventeenth century Germany, and from the metaphysical\ntreatment of the soul in the context of a pneumatology, or doctrine of\nfinite and infinite spirit (Stiening 2003, Vidal 2011). More\nnarrowly, Wolff’s principal, and best-known innovation in\npsychology consists in his clear separation between two distinct\ninvestigations of the soul, the first based on the observation of\none’s own mind, identified as empirical psychology, and\nthe second which seeks to use reasoning to uncover truths about the\nsoul that are not readily disclosed by experience, identified as\nrational psychology.\n\nWolff’s distinction between empirical and rational psychology\nproved to be enormously consequential, but no less important (if less\nwell attended to) is the fact that these disciplines remain\nintrinsically connected. For Wolff, the observations catalogued in the\ncourse of empirical psychology serve as principles for the inferences\nof rational psychology, and the resulting findings on the part of\nrational psychology serve to guide our empirical observation in search\nof confirmation. Thus, Wolff writes, that which everyone can\nexperience of themselves will serve “as a principle for deriving\nsomething else that not everyone can immediately see for\nthemselves” (GM: §191), and that which is known of the soul\nfrom experience “is the touchstone [Probier-Stein] of\nthat which is taught [in rational psychology] of its nature and\nessence” (GM: §727). Rather than constituting distinct\ndisciplines, empirical and rational psychology amount to complementary\nparts of a single science, working together in the same way\nin which observation and theory co-operate in astronomy (EP: §5).\nConsequently, Wolff’s rational psychology is not to be\nidentified as a narrowly rationalistic psychology, insofar as\nthe latter is taken to intend a science of the soul that proceeds\ncompletely independently of experience. Nor is this\ninterdependence of the two parts of psychology an aberration as Wolff\ntakes their union as exemplifying his ideal for science of a\nconnubium rationis et experientiae (EP: §497; cf., Dyck\n2014, Rumore 2018).\n\nTurning first to empirical psychology, Wolff’s treatment can be\ndivided into four parts: (1) the initial consideration of the human\nsoul in an attempt to arrive at an initial definition; the\nconsideration of the soul’s (2) cognitive faculty and (3)\nappetitive faculty; and (4) a consideration of what can be known of\nthe soul’s relation to the body through experience. In the first\npart, Wolff begins, in Cartesian fashion, by first considering the\ngrounds for our certainty in the existence of the soul (EP:\n§11–14). Wolff begins by asserting that we are conscious of\nourselves and other things, which he takes to be confirmed by our own\nindubitable experience (for to doubt it would presuppose such\nconsciousness), and inasmuch as anything that is so conscious must\nexist, a claim Wolff identifies as an identical proposition or axiom\n(cf. GL: c. 3, §13), it follows that we can be certain that we\nexist. Wolff conveniently reconstructs this as a syllogism:\n\n\nWhatever being is conscious of its self and of other things\noutside of it, exists.\nWe are actually conscious of ourselves and of things outside of\nus.\nTherefore, we exist. (EP: §16)\n\n\n\nIn addition to assuring ourselves of the indubitability of the\nknowledge of our own existence (cf. Euler 2003), this initial\nconsideration supplies a touchstone for what will count as\ndemonstratively certain, but also provides the elements for a nominal\ndefinition of the soul. Thus, the soul is identified just as\n“that being in us which is conscious of itself and other things\noutside of it” (EP: §20) which, as an existing thing, can\nserve as the object of empirical psychology.\n\nThe next task for empirical psychology consists in cataloguing the\nvarious capacities that the soul has, which Wolff brings under two\ngeneral headings: the cognitive faculty (facultas\ncognoscendi) and the appetitive faculty (facultas\nappetendi). Relevant to the distinction between (sub-)faculties\nin both cases is the distinction, borrowed from Leibniz, between\nobscure and clear perception (where the latter but not the former\nsuffices for recognition of the perceived thing), and (clear but)\nconfused and (clear and) distinct perception (where the latter but not\nthe former involves the ability to explicate what serves to\ndistinguish the perceived thing from others). Accordingly, both the\ncognitive and appetitive faculty are distinguished into lower and\nhigher parts, where the lower includes capacities relating to ideas\nand notions that are obscure or clear but confused, and the higher\nthose relating to ideas and notions that are distinct (EP:\n§§54–5, 584). (It bears noting that Wolff also\ndistinguishes between obscure and clear perceptions inasmuch as the\nformer are not apperceived but the latter are; cf. EP:\n§§25, 35; RP: §20, and for discussion see Wunderlich\n2005 and Thiel 2011).\n\nAmong the faculties Wolff considers within the lower cognitive faculty\nare the faculty of sense, imagination, the fictive faculty, and\nmemory. Sense, which includes the five sensory modalities, is\nunderstood as the capacity for sensations, where these are perceptions\nthe reason for which is contained in the organs of our bodies, given\nthe presence of an external thing (EP: §§67, 65).\nImagination, by contrast, is the faculty for producing perceptions in\nthe absence of sensible things. Wolff further claims that the\nimagination’s activity is guided by a general (associative) law\nthat, when we have perceived things together (as parts of a whole, for\ninstance, or as contiguous in space), if the perception of one is\nproduced, then the imagination supplies the perception of the other\n(EP: §117). It is the imagination that is likewise responsible\nfor the order of ideas in dreams. The fictive faculty (facultas\nfingendi) is our capacity to combine or divide the products of\nthe imagination to create new representations (§144), and memory\nis defined as the faculty through which we recognize\nreproduced ideas as previously had (§175).\n\nWhere the lower cognitive faculty handles the generation and\n(re)production of obscure and confused ideas, the higher cognitive\nfaculty encompasses the capacities and operations through which we\nintroduce clarity and distinctness into those ideas. Accordingly,\nWolff first considers the faculties of attention, whereby we introduce\nmore clarity into a part of a composite perception (EP: §237),\nand reflection, through which we successively direct attention to what\nwe perceive (as well as, in a Lockian vein, to the soul and its\noperations—§261) and thereby make distinct perception\npossible (§266). The capacity for distinct representation in\ngeneral is identified as the understanding, which can be pure or\nnon-pure depending on whether it admits confused representations,\nthough since these are unavoidable in the case of the human being, our\nunderstanding is never pure (EP: §§313–4; for general\ndiscussion see Chance 2018). With an eye to his discussion of logic, Wolff further\ndistinguishes three operations of the intellect with respect to its\ncognitions: simple apprehension (through which notions or\nrepresentations of what is common to multiple things are formed),\njudgment (through which agreement or disagreement between\nrepresentations is asserted), and discursion or reasoning (where\njudgments are formed on the basis of previous judgments) (EP:\n§§325, 366–7; cf. Dyck 2016, Rumore 2018). This latter\noperation informs Wolff’s definition of the faculty of\nreason as the capacity to perceive the interconnection among universal\ntruths (§483), though Wolff again emphasizes that our reason is\nnever pure but is always to some extent reliant upon\nexperience (§§495–7).\n\nWhere the discussion of the cognitive faculty is relevant to\nWolff’s aims in logic and metaphysics, the treatment of the\nappetitive faculty in empirical psychology is significant for\nWolff’s practical philosophy. Wolff likewise distinguishes the\nappetitive faculty into lower and higher parts, where the distinction\nturns on whether there is an obscure or confused cognition of the good\nor evil (grounding a sensory desire or aversion), or a distinct\ncognition of the good or evil (grounding our act of willing or not\nwilling). In connection with the latter, Wolff takes up the issue of\nfreedom. He rejects the conception of freedom in terms of a capacity\nto act contrary to determining motives as counter to our experience\nand to the principle of sufficient reason (EP: §944), and instead\ndefends a (Leibnizian) compatibilist conception, in accordance with\nwhich a freely willed act involves a distinct cognition of the\nperfection of some thing (which generates a motive to act in its\nfavor); is spontaneous, or has its reason within the agent (insofar as\nthe agent chooses it because it is pleasing); and is contingent, or\nthe agent is not determined to choose it through its essence (EP:\n§§933–41; cf. Kawamura 1996; Dyck forthcoming[a]).\n\nLastly, but importantly, empirical psychology takes up the\ndistinctively early modern problem of what can be experienced of the\nsoul’s relation to the body. Here Wolff notes that we experience\nthat some states of the soul depend upon the body (such as\nsensations), and some states of the body depend upon the soul (such as\nvoluntary actions), such that the body and soul stand in a union or\ncommercium. Nonetheless, Wolff contends (following\nMalebranche and in anticipation of Hume) that we have no experience of\nthe causal power through which the soul influences the body and vice\nversa, but rather that our experience only confirms the general\nagreement between the states of each without penetrating to its ground\n(EP: §§961–2).\n\nIn turning to the rational consideration of the soul, Wolff’s\naim is not to determine what can be known completely independently of\nexperience but rather to employ what has been discerned in empirical\npsychology as principles from which its demonstrations proceed and as\ncognitions for which reasons are to be given (RP:\n§§3–4; Richards 1980). Conforming to this, the topics\nof rational psychology proceed from those which are closest to and\ndraw most heavily from empirical psychology, such as the account of\nour soul’s nature and essence, to the increasingly more\nspeculative topics, such as the defense of the pre-established harmony\nto the demonstration of the soul’s immortality and consideration\nof its state after death.\n\nThe determination of the soul’s nature and essence sets out from\nthe definition of the soul given in empirical psychology as that in us\nwhich is conscious of itself and other things. Wolff argues that this\nconsciousness is the result of a complex activity that involves\nreflection on and comparison of parts of a given perception as well as\nattention and memory (RP: §§22–3, 25). Given this,\nWolff contends, the soul must be distinct from body since such an act\ncannot be explained in terms of a change in figure, magnitude, or the\nlocation of parts, through which alone changes in body are possible.\nSimilar considerations serve to show that no composite can think, and\nthus that the soul, as conscious, must not be composite and is\ntherefore simple, and indeed, a simple substance, since it perdures\nthrough changes in its thoughts (RP: §§44, 47–8). That\nthe soul is a substance further implies for Wolff (as it did for\nLeibniz) that it is endowed with a power, understood as a sufficient\nreason for the actuality of the states that are possible for it\nthrough its faculties (RP: §§54–5; cf. Blackwell 1961,\nHeßbrüggen-Walter 2004). Wolff proceeds to determine the\ncharacter of this power (which must be a single one given the\nsoul’s simplicity), and he concludes that, because sensations\nare representations of the world in accordance with the position of\nthe organic body, and because all of the representations the soul is\ncapable of are derived from sensations, it follows that the\nsoul’s power is just a power of representing the world in\naccordance with the position of the body, which power Wolff finally\nidentifies as the essence and nature of the soul (RP:\n§§64–9).\n\nRational psychology also takes up the question of what best explains\nthe agreement between the states of the soul and the body. Wolff\nconsiders three possible systems that purport to explain this\nagreement: (i) the system of physical influx, according to which one\nsubstance produces a state in another directly through its own\nactivity (RP: §§558–60), (ii) the (Cartesian) system\nof occasional causes, according to which God modifies one substance on\nthe occasion of some state arising in another\n(§§589–91); and (iii) the (Leibnizian) system of\npre-established harmony, where the agreement between states of\nsubstances is the result of God’s initial activity in\nactualizing this world of substances (§§612–13). Wolff\nprovides a number of familiar objections to the first two systems,\nclaiming for instance, that physical influx conflicts with the laws of\nphysics (cf. §§578–9), and that occasionalism relies\non what amounts to a perpetual miracle (cf. §603), while\ndefending the pre-established harmony from similar criticisms (cf.\nWatkins 2005: 45–51). Even so, given that any possible\nexplanation cannot be confirmed or rejected by experience (as was\ndisclosed at the conclusion of empirical psychology), each of these\nsystems amounts to a mere hypothesis, and Wolff’s\nconclusion is only that the pre-established harmony is a more\nprobable hypothesis than the other two (RP: §§503,\n685; cf. Dyck 2014: 34–6), though he thinks that nothing\nsignificant turns on settling this contentious issue.\n\nThe last major topic Wolff turns to is the most speculative, namely,\nthe demonstration of the soul’s immortality of the soul and its\nstate after death. Immortality is taken to presuppose the\nincorruptibility of the soul, that is, that the soul does not\nnaturally pass away after the death of the body, but (contrary to the\nCartesians) Wolff does not think that this is all that is involved as\nany immortality worth having (and that would be consistent with\nScripture) must also extend to the preservation of the soul’s\ncapacity for distinct perception (that is, its spirituality) and its\nconsciousness that it is the same being in the afterlife as it was\nbefore the body’s death (or its personality). The\nsoul’s incorruptibility follows straightforwardly from the fact\nthat it is simple (and so incapable of decomposition); inductive\ngrounds are offered in favor of the soul’s preservation of its\nspirituality (namely, that the clarity of the soul’s perceptions\nis enhanced in all “great changes”—RP: §745);\nand the soul’s maintenance of its personality is shown by\nreference to the law of imagination in accordance with which its\nsubsequent perceptions will lead it to recall previous ones. The\nrelative merits of these arguments were hotly debated, with especially\nnotable contributions by Wolff’s colleague in Halle, G. F.\nMeier, and later by Mendelssohn (in his famous Phaedo), and\nultimately Kant (for discussion, see Sassen 2008; Dyck 2014:\n141–72).\n5.4 Natural Theology\n\nWolff’s treatment of metaphysics concludes with a consideration\nof natural theology defined as “the science of those things that\nare possible through God” (NT: I, §1, see Corr 1973). Yet, at the same\ntime, natural theology also provides a bottom-up justification for\nmetaphysics insofar as metaphysics is concerned with actual existing\nbeings of a contingent, and so created, reality. Wolff indicates that\nnatural theology has two principle aims: (1) to prove the existence of\nGod and (2) to determine what pertains to the essence and attributes\nof God, and what follows from these.\n\nConcerning the demonstration of God’s existence, Wolff had\noffered criticisms (much to the chagrin of his Pietist opponents) of a\nvariety of traditional proofs early in his career (cf. Theis 2018:\n221–3). In his Natural Theology, however, Wolff\npresents and defends two proofs: an a posteriori proof\npresented at the outset of the first volume, and an a priori\nproof provided at the beginning of the second. Wolff’s a\nposteriori proof sets out from the fact (elaborated at the outset\nof empirical psychology) that we exist, and proceeds to argue that the\nreason for our existence must be found in a necessary being:\n\n\nThe human soul exists or we exist. Since nothing is without a\nsufficient reason why it is rather than is not, a sufficient reason\nmust be given why our soul exists, or why we exist. Now this reason is\ncontained in ourselves or in some other being diverse from us. But if\nyou maintain that we have the reason of our existence in a being\nwhich, in turn, has the reason of its existence in another, you will\nnot arrive at the sufficient reason unless you come to a halt at some\nbeing which does have the sufficient reason of its own existence in\nitself. Therefore, either we ourselves are the necessary being, or\nthere is given a necessary being other and diverse from us.\nConsequently, a necessary being exists (NT: I, §24).\n\n\nFrom there, Wolff argues that the necessary being must also be\nindependent, or have its sufficient reason in itself, and cannot have\na beginning or end in time or is eternal. As such, the necessary being\ncannot be identified with the world (which is composite) or anything\nwithin it (since these have a beginning and end); moreover, it cannot\nbe identified with the soul since unlike the soul it does not depend\non the world. Therefore, the necessary being is identified as God,\nunderstood as an independent being in which the reason for the\nactuality of the world and the soul is found (NT: I, §67, see Corr 1973).\n\nBy contrast, Wolff’s a priori proof for God’s\nexistence proceeds from the identification of God as the most perfect\nbeing (ens perfectissimum):\n\n\nGod contains all compossible realities in the absolutely highest\ndegree. But He is possible. Wherefore, since the possible can exist,\nexistence can belong to it. Consequently, since existence is a\nreality, and since realities are compossible which can belong to a\nbeing, existence is in the class of compossible realities. Moreover,\nnecessary existence is the absolutely highest degree. Therefore,\nnecessary existence belongs to God or, what is the same, God\nnecessarily exists (NT: II, §21, see Corr 1973).\n\n\nFrom the notion of a most perfect being, Wolff purports to prove God\nis an ens realissimum (or most real existing being). However,\nlike Leibniz before him commenting on the Cartesian ontological proof,\nWolff believes God must first be shown to be possible in order to be\nshown to exist. According to Wolff, arriving at the knowledge of God\nas an ens perfectissimum involves first contemplating the\nattributes that are present in the human soul, to a limited degree,\nand then extrapolating those attributes as unlimited qualities to God.\nThings are compossible insofar as they can coexist in the same\nsubject. Since existence is a mode or reality for Wolff, existence is\nconsidered to fall within the class of compossible realities. And just\nas it is better to exist than not to exist, it is better to exist\nnecessarily than just to exist contingently, therefore Wolff concludes\nthat God’s existence is necessary.\n\nWith God’s existence assured, Wolff considers what can be known\nof Him. God is taken to have an understanding, consisting in His\ndistinct representation of all possible worlds and which\nrepresentation itself originates from the divine essence (NT: II,\n§§81, 84). God is also shown to have a will, through which\nHe chooses one possible world to make actual, and since God’s\nchoice in doing so finds its sufficient reason in his distinct\ncognition of the supreme perfection of that world, Wolff identifies\nGod’s will as free (in the same sense of freedom\npresented in the empirical psychology, albeit in the highest possible\ndegree—NT: II, §277). Wolff additionally considers\nGod’s wisdom, which consists in His choice of the\nappropriate means to realize His end in creation, namely, the\nmanifestation of His own glory and perfection (NT: I, §629), and\ngoodness, which consists in His conferring of as much\ngoodness on creatures as is consistent with His wisdom (NT: I,\n§§697–9).\n\nWhile these discussions conclude the proper subject matter of natural\ntheology, in the second half of the second volume Wolff additionally\nturns to critically examining various systems of atheism and radical\nthought. Significantly, among the views discussed is\nSpinozism, and indeed his treatment is considerably detailed\n(spanning §§671–716 of the second volume), likely\nreflecting the fact that Wolff had himself faced a persistent\naccusation of supporting Spinoza on the part of his Pietist critics.\nIn contrast, however, with other discussions of Spinoza by\nphilosophers of this period, Wolff’s does not trade in\nconvenient caricatures or speculation concerning the real (immoral)\nmotives behind Spinoza’s thought but hews closely, if\ncritically, to the text of the Ethics. Wolff scrutinizes\nSpinoza’s definitions, particularly of God, substance,\nattribute, mode, and finite thing (which he contrasts with their\nproper definitions in the Leibnizian-Wolffian philosophy), and\nproceeds to show how these figure into Spinoza’s account of\nextension (NT: II, §§688–93), doctrine of bodies\n(§§694–6), claims of the uniqueness and necessary\nexistence of substance (§§697–706), and his faulty\naccount of infinite thought as composed of an infinite number of\nfinite thinking things (§§707–8). Wolff’s\ndiscussion proved rather influential, with Mendelssohn echoing and\ndeveloping it, and the accuracy of Wolff’s characterization of\nSpinoza was also a point of discussion in the famous\nPantheismusstreit (cf. Beiser 1987: 103).\n6. Practical Philosophy\n\nThe subject matter of Wolff’s practical philosophy is restricted\nto those things that have to do with human action. In Wolff’s\nLatin texts, practical philosophy is divided into four main\ndisciplines: universal practical philosophy, natural law, politics,\nand moral philosophy. And just as ontology purportedly provides the\nfoundational underpinnings for the disciplines of “special\nmetaphysics” in the theoretical realm, universal practical\nphilosophy plays an analogous role for the disciplines of natural law,\npolitics, and moral philosophy in the practical realm.\n\nA central and perhaps unifying concept in Wolff’s practical\nwritings is the concept of “perfection”. In an early\nletter to Leibniz, dated 4 May 1715, Wolff explains the importance\nthat the concept serves in his ethics:\n\n\nI need the notion of perfection for dealing with morals. For, when I\nsee that some actions tend toward our perfection and that of others,\nwhile others tend toward our imperfection and that of others, the\nsensation of perfection excites a certain pleasure [voluptas]\nand the sensation of imperfection a certain displeasure\n[nausea]. And the emotions [affectus], by virtue of\nwhich the mind is, in the end, inclined or disinclined, are\nmodifications of this pleasure and displeasure; I explain the origin\nof natural obligation in this way… From this also comes the\ngeneral rule or law of nature that our actions ought to be directed\ntoward the highest perfection of ourselves and others. (Leibniz 1989a:\n231–232)\n\n\nAccording to Wolff, the ultimate goal of human action is to attain, or\nat least approximate, the highest degree of perfection that is\npossible. Humans, as individuals or groups, should strive for\nperfection insofar as moral worth and goodness reside in the objective\nessence of humankind. In a strict sense, each person is obligated by\nthe law of nature to instantiate perfection in his/her own life.\nActions that tend toward perfection produce pleasure and actions that\ntend toward imperfection produce displeasure (or pain). In many\nrespects, this consequentialist feature of Wolff’s ethical\ntheory resembles various forms of utilitarianism that were emerging in\nEngland during the mid-to-late eighteenth century.\n\nAlso central to Wolff’s practical philosophy is its autonomy\nfrom theological doctrine. Although maintaining that a universal\nethics is certainly compatible with the teachings of Sacred Scripture,\nWolff is adamant that morality does not depend on revelation or\nGod’s divine commands. Advocating the separation of philosophy\nand religion is a theme that Wolff developed and defended throughout\nhis entire career and it is a feature of his thought that secures him\na place among other philosophers of Europe’s Enlightenment.\n7. Other Philosophical Contributions\n\nWolff’s prominence in eighteenth-century Germany, and his\nwide-ranging interests, have meant that he is an important figure in\nthe history of a number of established fields in the eighteenth\ncentury, including mathematics, physics, political theory, and even\neconomics. Wolff also made notable, even pioneering contributions to\ndisciplines that were not as yet recognized as distinct areas of\nphilosophical inquiry. Wolff had, for instance, an early interest in\nthe philosophy of language, having devoted a dissertation to the topic\nin 1703 (Disquisitio philosophica de loquela), an interest he\ncontinued to pursue in subsequent discussions in his logical writings,\nrelating to semiotics and hermeneutics, and in his psychological\ntexts, concerning the relation between mental and linguistic entities\n(see Favaretti Camposampiero 2018 for details). Wolff is also widely\nrecognized as a founding figure in the discipline of\naesthetics—while his only text devoted to the topic is a\ntreatise on civil architecture (a volume in a mathematical textbook),\nWolff’s account of aesthetic pleasure in terms of the intuitive\ncognition of perfection (EP: §511), and identification of that\nperfection as consisting in a unity in multiplicity, were taken up and\ndiscussed by later aesthetic theorists, including A. G. Baumgarten\n(the father of modern aesthetics), J. C. Gottsched, J. G. Sulzer\n(1720–79), and Mendelssohn (see Beiser 2009; Buchenau 2013).\n",
    "bibliography": {
        "categories": [
            "Wolff’s Principal Works",
            "Other Primary Sources",
            "Selected Secondary Literature"
        ],
        "cat_ref_text": {
            "Wolff’s Principal Works": [
                "</h3>\n<p>\nFor a complete listing of Wolff’s works, see Theis &amp; Aichele\n(2018: 20–27). Editions of all of Wolff’s works have been\nreprinted in the series:</p>\n<ul class=\"hanging\">",
                "<em>Christian Wolff: Gesammelte Werke</em>, 1962–, edited\nby Jean École, Hans Werner Arndt, Charles Anthony Corr, Joseph\nEhrenfried Hofmann, M. Thoman, Hildesheim: Olms. \n</ul>\n<p>\nIn the case of the <em>German Logic</em> and <em>German\nMetaphysics</em>, both of which saw numerous editions and significant\nchanges throughout Wolff’s lifetime, references in this entry\nare to the later, reprinted editions.</p>\n<p>\nIn the above entry, all translations are by the authors unless otherwise indicated.</p>\n<h4 id=\"WolfGermText\">Wolff’s German Texts</h4>\n<ul class=\"hanging\">",
                "1710, <em>Der Anfangs-Gründe aller mathematischen\nWissenschafften</em> (Elements of All the Mathematical Sciences),\nHalle.",
                "[GL] 1713, <em>Vernünftige Gedanken von den Kräften des\nmenschlichen Verstandes und ihrem richtigen Gebrauch in der Erkenntnis\nder Wahrheit</em> (Rational Thoughts on the Powers of the Human\nUnderstanding and its Proper Use in the Cognition of Truth), Halle.\n14<sup>th</sup> edition [1754] reprinted with an introduction by Hans\nWerner Arndt in <em>Christian Wolff, Gesammelte Werke</em>, 1.Abt.,\nDeutsche Schriften, Bd.1. Hildesheim: Olms, 1965.",
                "[GM] 1720a, <em>Vernünftige Gedanken von Gott, der Welt und\nder Seele des Menschen, auch allen Dingen überhaupt</em>\n(Rational Thoughts on God, the World and the Soul of Man, and on All\nThings in General), Halle. 7th edition [1751] reprinted with\nintroduction by Charles A. Corr in <em>Christian Wolff, Gesammelte\nWerke</em>, 1.Abt., Deutsche Schriften, Bd.3. Hildesheim: Olms,\n1983.",
                "1720b, <em>Vernünftige Gedanken von der Menschen Thun und\nLassen zur Beförderung ihrer Glückseligkeit</em> (Rational\nThoughts on Human Action and Omission with a View to Promoting his Happiness),\nHalle.",
                "1721, <em>Vernünftige Gedanken von dem gesellschaftlichen\nLeben der Menschen, und insonderheit dem gemeinen Wesen</em> (Rational\nThoughts on the Social Life of the Human Being, and in particular on the Commonwealth),\nHalle.",
                "1723, <em>Vernünftige Gedanken von den Wirkungen der\nNatur</em> (Rational Thoughts on the Operations of Nature, Halle.",
                "1724, <em>Vernünftige Gedanken von den Absichten der\nnatürlichen Dingen</em> (Rational Thoughts on the Purposes of Natural Things),\nFrankfurt and Leipzig.",
                "1725, <em>Vernünftige Gedanken von dem Gebrauche der Theile\ndes menschlichen Leibes, der Thiere und Pflanzen</em> (Rational\nThoughts on the Employment of the Parts of the Human Body, Animals, and Plants),\nFrankfurt.\n</ul>\n<h4 id=\"WolfLatiText\">Wolff’s Latin Texts</h4>\n<ul class=\"hanging\">",
                "1703a, <em>Philosophia practica universalis, methodo mathematica\nconscripta</em> (On Universal Practical Philosophy, composed according\nto the Mathematical Method).",
                "1703b, <em>Disquisitio philosophica de loquela</em>, Leipzig.",
                "1709, <em>Aërometriæ elementa</em>, Leipzig.",
                "1713–15, <em>Elementa matheseos universae</em> (Elements of\nAll the Mathematical Sciences), 2 vols. Halle.",
                "1716, <em>Mathematisches Lexicon</em> (Mathematical Lexicon),\nLeipzig.",
                "1718, <em>Ratio prælectionum Wolfianarum</em>, Halle.",
                "[LL] 1728, <em>Philosophia rationalis sive Logica, methodo\nscientifica pertractata, et ad usum scientiarum. atque vitae aptata.\nPraemittitur discursus praeliminaris de philosophia in genere</em>\n(Rational Philosophy, or Logic), Frankfurt. Includes\n\n<ul class=\"hanging\">",
                "[DP] <em>Discursus praeliminaris de philosophia in genere</em>\n(Preliminary Discourse on Philosophy in General)\n</ul>",
                "[Ont.] 1730, <em>Philosophia prima sive ontologia methodo\nscientifica pertractata qua omnis cognitionis humanae principia\ncontinentur</em> (First Philosophy, or Ontology), Frankfurt.",
                "[Cosm.] 1731, <em>Cosmologia generalis methodo scientifica\npertractata, qua ad solidam imprimis Dei atque naturae cognitionem via\nsternitur</em> (General Cosmology), Frankfurt and Leipzig.",
                "[EP] 1732, <em>Psychologia empirica methodo scientifica\npertractata, qua ea quae de anima humana indubia experientiae fide\nconstant, continentur</em> (Empirical Psychology), Frankfurt and\nLeipzig.",
                "[RP] 1734, <em>Psychologia rationalis methodo scientifica\npertractata, qua ea, quae de anima humana indubia experientiae fide\ninnotescunt</em> (Rational Psychology), Frankfurt.",
                "[NT] 1736–7, <em>Theologia naturalis scientifica\npertractata</em> (Natural Theology), 2 vols., Frankfurt.",
                "1738–9, <em>Philosophia practica universalis methodo\nscientifica pertractata</em>, 2 vols. Frankfurt.",
                "1740–1748, <em>Jus naturae methodo scientifica\npertractatum</em>, 8 vols., Frankfurt &amp; Leipzig, and Halle.",
                "1749, <em>Jus gentium methodo scientifica pertractatum</em> (The\nLaw of Nations Treated According to a Scientific Method), Halle.",
                "1750–3, <em>Philosophia moralis sive ethica</em>, 5 vols.,\nHalle.",
                "1963, <em>Briefwechsel zwischen Leibniz und Christian Wolff</em>,\nC. I. Gerhardt (ed.). Hildesheim: Georg Olms Verlagsbuchhandlung.\n</ul>\n<h4 id=\"PrimLiteEnglTran\">Primary Literature in English Translation</h4>\n<ul class=\"hanging\">",
                "1770, <em>Logic, or Rational Thoughts on the Powers of the Human\nUnderstanding with their Use and Application in the Knowledge and\nSearch of Truth</em>, London: Printed for L. Hawes, W. Clarke, and R.\nCollins. Translation of <em>Vernünftige Gedanken von den\nKräften des menschlichen Verstandes und ihrem richtigen Gebrauch\nin der Erkenntnis der Wahrheit</em> (1713/GL).",
                "1963, <em>Preliminary Discourse on Philosophy in General</em>,\nTranslated by Richard J. Blackwell, Indianapolis: The Bobbs-Merrill\nCompany, Inc. Translation of <em>Discursus praeliminaris de\nphilosophia in genere</em> (1729/DP).",
                "2003, <em>Moral Philosophy from Montaigne to Kant</em>, translated\nby J. B. Schneewind, Cambridge: Cambridge University Press. Contains a\ntranslation of excerpts from Wolff’s <em>Vernünftige\nGedanken von der Menschen Thun und Lassen zur Beförderung ihrer\nGlückseligkeit</em> (1720b).",
                "2009, <em>Kant’s Critique of Pure Reason: Background Source\nMaterials</em>, edited and translated by Eric Watkins, Cambridge:\nCambridge University Press. Contains a translation of excerpts from\nWolff’s <em>Vernünftige Gedanken von Gott, der Welt und der\nSeele des Menschen, auch allen Dingen überhaupt</em>\n(1720a/GM).",
                "2017, <em>The Law of Nations Treated according to a Scientific\nMethod</em>, translated by Joseph H. Drake, revised and edited by\nThomas Ahnert, Carmel, IN: Liberty Fund. Translation of <em>Jus\ngentium methodo scientifica pertractatum</em> (1749).",
                "[EMGP] 2019, <em>Early Modern German Philosophy</em>,\nedited and translated by Corey W. Dyck, Oxford: Oxford University\nPress. Contains a translation of selections from Wolff’s\n<em>Vernünftige Gedanken von Gott, der Welt und der Seele des\nMenschen, auch allen Dingen überhaupt</em> (1729a/GM) and of\nWolff’s “Refutation of Spinoza” from the\n<em>Theologia naturalis</em> (1736–7/NT).\n</ul>\n<h3 id=\"OthePrimSour\">"
            ],
            "Other Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Baumeister, Friedrich Christian, 1747, <em>Elementa Philosophiae\nRecentioris</em>, Leipzig: Gleditschii.",
                "Crusius, Christian August, 1743, <em>Dissertatio philosophica de usu\net limitibus principii rationis determinantis, vulgo\nsufficientis¸</em>; translated in EMGP.",
                "Kant, Immanuel, 1900–, <em>Kants gesammelte Schriften</em>,\nedited by Königlichen Preußischen (later Deutschen) Akademie der Wissenschaften\n(ed.), Berlin: Georg Reimer (later Walter De Gruyter).",
                "–––, 1998, <em>Critique of Pure Reason</em>,\nP. Guyer and A. Wood (eds. and trans.), Cambridge: Cambridge\nUniversity Press.\n</ul>\n<h3 id=\"SeleSecoLite\">"
            ],
            "Selected Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Anderson, R. Lanier, 2005, “The Wolffian Paradigm and Its\nDiscontent: Kant’s Containment Definition of Analyticity in\nHistorical Context”, <em>Archiv für Geschichte der\nPhilosophie</em>, 87(1): 22–74.\ndoi:10.1515/agph.2005.87.1.22",
                "–––, 2015, <em>The Poverty of Conceptual Truth:\nKant’s Analytic/Synthetic Distinction and the Limits of\nMetaphysics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198724575.001.0001",
                "Arndt, Hans Werner, 1983, “Rationalismus und Empirismus in\nder Erkenntnislehre Christian Wolffs”, in Schneiders 1983:\n31–47.",
                "Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and His\nPredecessors</em>, Cambridge MA: Harvard University Press.",
                "Beiser, Frederick C., 1987, <em>The Fate of Reason: German\nPhilosophy from Kant to Fichte</em>, Cambridge MA: Harvard University\nPress.",
                "–––, 2009, <em>Diotima’s Children: German\nAesthetic Rationalism from Leibniz to Lessing</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199573011.001.0001",
                "Beutel, Albrecht, 2001, “Causa Wolffiana. Die Vertreibung\nChristian Wolffs aus Preußen 1723 als Kulminationspunkt des\nthelogisch-politischen Konflikts zwischen halleschem Pietismus und\nAufklärungsphilosophie”, in <em>Wissenschaftliche Theologie\nund Kirchenleitung. Beiträge zur Geschichte einer\nspannungsreichen Beziehung</em>, Ulrich Köpf (ed.),\nTübingen: Mohr Siebeck, 159–202.",
                "Bianco, Bruno, 1989, “Freiheit gegen Fatalismus. Zu Joachim\nLanges Kritik an Wolff”, in <em>Zentren der Aufklärung.\nHalle: Aufklärung und Pietismus</em>, vol. I, Norbert Hinske,\nBerlin: DeGruyter, 111–155.",
                "Bissinger, Anton, 1970, <em>Die Struktur der Gotteserkenntnis.\nStudien zur Philosophie Christian Wolffs</em>, Bonn: Bouvier.",
                "Blackall, Eric A., 1978, <em>The Emergence of German as a Literary\nLanguage: 1700–1775</em>, Ithaca, NY: Cornell University\nPress.",
                "Blackwell, Richard J., 1961, “Christian Wolff’s\nDoctrine of the Soul”, <em>Journal of the History of Ideas</em>,\n22(3): 339–354. doi:10.2307/2708129",
                "–––, 1961, “The Structure of Wolffian\nPhilosophy”:, <em>The Modern Schoolman</em>, 38(3):\n203–218. doi:10.5840/schoolman196138325",
                "Buchenau, Stefanie, 2013, <em>The Founding of Aesthetics in the\nGerman Enlightenment: The Art of Invention and the Invention of\nArt</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139225281",
                "Burns, John V., 1966, <em>Dynamism in the Cosmology of Christian\nWolff: A Study in Pre-Critical Rationalism</em>, New York: Exposition\nPress.",
                "Calinger, Ronald S., 1969, “The Newtonian-Wolffian\nControversy: 1740–1759”, <em>Journal of the History of\nIdeas</em>, 30(3): 319–330. doi:10.2307/2708560",
                "Campo, Mariano, 1939, <em>Cristiano Wolff e il razionalismo\nprecritico</em>, Milan.",
                "Carboncini, Sonia, 1991, <em>Transzendental Wahrheit und Traum:\nChristian Wolffs Antwort auf die Herausforderung durch den\nCartesianischen Zweifel</em>, Stuttgart-Bad Cannstatt:\nFromann-Holzboog.",
                "Cataldi Madonna, Luigi, 2001, <em>Christian Wolff und das System\ndes klassischen Rationalismus</em>, Hildesheim: Olms.",
                "–––, 2011, “The Eighteenth-Century\nRehabilitation of Sensitive Knowledge and the Birth of Aesthetics:\nWolff, Baumgarten and Mendelssohn”, in <em>Moses\nMendelssohn’s Metaphysics and Aesthetics</em>, Reinier Munk\n(ed.) (Studies in German Idealism 13), Dordrecht: Springer\nNetherlands, 279–297. doi:10.1007/978-94-007-2451-8_15",
                "–––, 2007, “Erfahrung und Intuition in der\nPhilosophie von Christian Wolff”, in Stolzenberg and Rudolph\n2007: vol. 2, 173–194.",
                "Chance, Brian A., 2018, “Wolff’s Empirical Psychology\nand the Structure of the Transcendental Logic”, in Dyck and Wunderlich 2018: 17–34.\ndoi:10.1017/9781316493229.002",
                "Corr, Charles Anthony, 1966, <em>Order and Method in Christian\nWolff’s Philosophy</em>, Phd Dissertation, Saint Louis, MO:\nSaint Louis University.",
                "–––, 1970, “Certitude and Utility in the\nPhilosophy of Christian Wolff”:, <em>Southwestern Journal of\nPhilosophy</em>, 1(1): 133–142.\ndoi:10.5840/swjphil197011/216",
                "–––, 1972, “Christian Wolff’s\nTreatment of Scientific Discovery”, <em>Journal of the History\nof Philosophy</em>, 10(3): 323–334.\ndoi:10.1353/hph.2008.1585",
                "–––, 1973, “The Existence of God, Natural\nTheology and Christian Wolff”, <em>International Journal for\nPhilosophy of Religion</em>, 4(2): 105–118.\ndoi:10.1007/BF00138698",
                "–––, 1975, “Christian Wolff and\nLeibniz”, <em>Journal of the History of Ideas</em>, 36(2):\n241–262. doi:10.2307/2708926",
                "–––, 1983,\n“Cartesian Themes in\nWolff’s German Metaphysics”, in Schneiders 1983:\n113–120.",
                "Dunlop, Katherine Laura, 2013, “Mathematical Method and\nNewtonian Science in the Philosophy of Christian Wolff”,\n<em>Studies in History and Philosophy of Science Part A</em>, 44(3):\n457–469. doi:10.1016/j.shpsa.2012.10.008",
                "–––, 2019, “Definitions and Empirical\nJustification in Christian Wolff’s Theory of Science”, in\nFrom Leibniz to Kant, Katherine Laura Dunlop and Samuel Levey (eds.),\n(Logical Analysis and History of Philosophy 21), Paderborn: mentis\nVerlag, 149–176.",
                "Dyck, Corey W., 2011, “A Wolff in Kant’s Clothing:\nChristian Wolff’s Influence on Kant’s Accounts of\nConsciousness, Self-Consciousness, and Psychology: A Wolff in\nKant’s Clothing”, <em>Philosophy Compass</em>, 6(1):\n44–53. doi:10.1111/j.1747-9991.2010.00370.x",
                "–––, 2014, <em>Kant and Rational\nPsychology</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199688296.001.0001",
                "–––, 2016, “The Priority of Judging: Kant\non Wolff’s General Logic”, <em>Estudos Kantianos</em>,\n4(2): 99–118.\n [<a href=\"http://revistas.marilia.unesp.br/index.php/ek/article/view/6659\" target=\"other\">Dyck 2016 available online</a>]",
                "–––, forthcoming[a], “Power, Harmony, and\nFreedom: Debating Causation in 18<sup>th</sup> Century Germany”,\nin <em>Oxford Handbook of German Philosophy in the Eighteenth\nCentury</em>, Brandon C. Look and Frederick C. Beiser (eds), Oxford:\nOxford University Press.",
                "–––, forthcoming[b], “Before and Beyond\nLeibniz: Tschirnhaus and Wolff on Experience and Method”, in\n<em>The Experiential Turn in 18th Century German Philosophy</em>,\nKarin DeBoer and Tinca Prunea-Bretonnet (eds), London: Routledge.",
                "Dyck, Corey W. and Falk Wunderlich (eds.), 2018, <em>Kant and\nHis German Contemporaries, Volume 1: Logic, Mind, Epistemology,\nScience and Ethics</em>, Cambridge: Cambridge University Press. doi:10.1017/9781316493229",
                "École, Jean, 1979, “En quel sens peut-on dire que\nWolff est rationaliste?”, <em>Studia Leibnitiana</em>, 11(1):\n45–61.",
                "–––, 1990, <em>La métaphysique de\nChristian Wolff</em>, Hildesheim: Olms.",
                "–––, 2001, “Des rapports de la\nmétaphysique de Christian Wolff avec celle des\nScolastiques”, in <em>Autour de la philosophie Wolffienne</em>,\nJean École (ed.), Hildesheim: Olms, 55–69.",
                "Engfer, Hans-Jürgen, 1992, “Von der leibnizischen\nMonadologie zur empirischen Psychologie Wolffs”, in <em>Nuovi\nstudi sul pensiero di Christian Wolff</em>, Sonia Carboncini and Luigi\nCataldi Madonna (eds.). Hildesheim: Olms, 193–215.",
                "Erdmann, Johann Eduard, 1866 [1890],\n<em>Grundriss der Geschichte der\nPhilosophie</em>, volume 2. Translated, from the third edition of\n1877, as <em>The History of Philosophy</em>, volume 2, Williston S.\nHough (trans.), New York: Macmillan &amp; Co.",
                "Euler, Werner, 2003,\n“Bewußtsein—Seele—Geist: Untersuchungen zur\nTransformation des Cartesischen ‘Cogito’ in der\nPsychologie Christian Wolffs”, in Rudolph and Goubet 2003:\n11–50. doi:10.1515/9783110932317.11",
                "Fabian, Gerd, 1925, <em>Beitrag zur Geschichte des\nLeib-Seele-Problems: Lehre von der prästabilierten Harmonie und\npsychophysischen Parallelismus in der Leibniz-Wolffschen Schule</em>,\nLangensalza: Hermann Beyer und Söhne.",
                "Falkenstein, Lorne, 1991, “Kant, Mendelssohn, Lambert, and\nthe Subjectivity of Time”, <em>Journal of the History of\nPhilosophy</em>, 29(2): 227–251. doi:10.1353/hph.1991.0046",
                "Favaretti Camposampiero, Matteo, 2009, <em>Conoscenza simbolica.\nPensiero e linguaggio in Christian Wolff e nella prima età\nmoderna</em>, Hildesheim: Olms.",
                "–––, 2018, “Philosophy of Language”,\nin Theis and Aichele 2018: 115–135.\ndoi:10.1007/978-3-658-14737-2_6",
                "–––, forthcoming, “Mereology and\nMathematics: Christian Wolff’s Foundational Programme”,\n<em>British Journal for the History of Philosophy</em>, early online:\n11 March 2019. doi:10.1080/09608788.2019.1568228",
                "Fischer, Klaus P., 1975, “John Locke in the German\nEnlightenment: An Interpretation”, <em>Journal of the History of\nIdeas</em>, 36(3): 431–446. doi:10.2307/2708655",
                "Frangsmyr, Tore, 1975, “Christian Wolff’s Mathematical\nMethod and Its Impact on the Eighteenth Century”, <em>Journal of\nthe History of Ideas</em>, 36(4): 653–668.\ndoi:10.2307/2708994",
                "Gava, Gabriele, 2018, “Kant, Wolff, and the Method of\nPhilosophy”, <em>Oxford Studies in Early Modern Philosophy,\nVolume VIII</em>, Daniel Garber and Donald Rutherford (eds.), Oxford:\nOxford University Press, 271–304.",
                "Gilson, Etienne, 1952, <em>Being and Some Philosophers</em>,\nsecond edition, Toronto: Pontifical Institute of Mediaeval\nStudies.",
                "Gomez Tutor, Juan Ignacio, 2004, <em>Die wissenschaftliche Methode\nbei Christian Wolff</em>, Hildesheim: Olms.",
                "Gracia, Jorge J. E., 1993, “Christian Wolff on\nIndividuation”, <em>The History of Philosophy Quarterly</em>,\n10: 147–164.",
                "Heßbrüggen-Walter, Stefan, 2004, <em>Die Seele und ihre\nVermögen: Kants Metaphysik des Mentalen in der Kritik der reinen\nVernunft</em>, Paderborn: Mentis.",
                "Hettche, Matt, 2008, “On the Cusp of Europe’s\nEnlightenment: Christian Wolff and the Argument for Academic\nFreedom”, <em>Florida Philosophical Review: The Journal of the\nFlorida Philosophical Association</em>, 8(1): 91–107.\n [<a href=\"https://philosophy.cah.ucf.edu/fpr/issues-8_1.php\" target=\"other\">Hettche 2008 available online (download full issue)</a>]",
                "Kanamori, Shigenari, 1997, “Christian Wolff’s Speech\non Confucianism: Confucius Compared with Wolff”, <em>European\nJournal of Law and Economics</em>, 4(2–3): 299–304.\ndoi:10.1023/A:1008635611833",
                "Kawamura, Katsuoshi, 1996, <em>Spontaneität und Willkür:\nDer Freiheitsbegriff in Kants Antinomienlehre und seine historischen\nWurzeln</em>, Stuttgart: Frommann-Holzboog.",
                "Kertscher, Hans-Joachim, 2018, <em>“Er brachte Licht und\nOrdnung in die Welt”. Christian Wolff—eine\nBiographie</em>, Halle: Mitteldeutscher Verlag.",
                "Kreimendahl, Lothar, 2007, “Empiristische Elemente im Denken\nWolffs”, in Stolzenberg and Rudolph 2007: vol. 1,\n95–112.",
                "Kuehn, Manfred, 1987, <em>Scottish Common Sense in Germany,\n1768–1800: A Contribution to the History of Critical\nPhilosophy</em>, Kingston: McGill-Queen’s University Press.",
                "–––, 1997, “The Wolffian Background of\nKant’s Transcendental Deduction”, in <em>Logic and the\nWorkings of the Mind: The Logic of Ideas and Faculty Psychology in\nEarly Modern Philosophy</em>, Patricia A. Easton and Lorne Falkenstein\n(eds), Atascadero, CA: Ridgeview Publishing Company,\n229–250.",
                "Lach, Donald F., 1953, “The Sinophilism of Christian Wolff\n(1679–1754)”, <em>Journal of the History of Ideas</em>,\n14(4): 561–574. doi:10.2307/2707702",
                "Leduc, Christian, 2018, “Sources of Wolff’s\nPhilosophy: Scholastics/Leibniz”, in Theis and Aichele 2018:\n35–53. doi:10.1007/978-3-658-14737-2_2",
                "Leibniz, Gottfried Wilhelm, 1989a, <em>Philosophical Essays</em>,\nRoger Ariew and Daniel Garber (trans.), Indianapolis: Hackett Pub.\nCo.",
                "Leibniz, Gottfried Wilhelm, 1989b, <em>Philosophical Papers and\nLetters</em>, Leroy E. Loemker (ed.), second edition, Dordrecht:\nSpringer Netherlands. doi:10.1007/978-94-010-1426-7",
                "Lenders, Winfried, 1971, “The Analytic Logic of G. W.\nLeibniz and Chr. Wolff: A Problem in Kant Research”,\n<em>Synthese</em>, 23(1): 147–153. doi:10.1007/BF00414150",
                "Louden, Robert, 2002, “‘What Does Heaven Say?’\nChristian Wolff and Western Interpretations of Confucian\nEthics”, in <em>Confucius and the Analects: New Essays</em>,\nBryan W. Van Norden (ed.), New York: Oxford University Press,\n73–93.",
                "Morrison, James C, 1993, “Christian Wolff’s Criticisms\nof Spinoza”, <em>Journal of the History of Philosophy</em>,\n31(3): 405–420. doi:10.1353/hph.1993.0057",
                "Paulsen, Friedrich, 1902 [1906], <em>Die deutschen\nUniversitäten und das Universitätsstudium</em>, Berlin: A.\nAsher. Translated as <em>The German Universities and University\nStudy</em>, Frank Thilly and William W. Elwang, New York: Charles\nScribner’s Sons, 1906.",
                "Richards, Robert J., 1980, “Christian Wolff’s\nProlegomena to Empirical and Rational Psychology: Translation and\nCommentary”, <em>Proceedings of the American Philosophical\nSociety</em>, 124(3): 227–239.",
                "Rudolph, Oliver-Pierre and Jean-François Goubet, 2003,\n<em>Die Psychologie Christian Wolffs: Systematische und historische\nUntersuchungen</em>, (Hallesche Beiträge Zur Europäischen\nAufklärung), Tübingen: Niemeyer.\ndoi:10.1515/9783110932317",
                "Rumore, Paola, 2018, “Empirical Psychology”, in Theis\nand Aichele 2018: 175–196. doi:10.1007/978-3-658-14737-2_9",
                "Rutherford, Donald, 2004,\n“Idealism Declined: Leibniz and Christian Wolff”, in\n<em>Leibniz and His Correspondents</em>, Paul Lodge (ed.), Cambridge:\nCambridge University Press, 214–237.\ndoi:10.1017/CBO9780511498237.010",
                "Sassen, Brigitte, 2008, “Kant and Mendelssohn on the\nImplications of the ‘I Think’”, in <em>The Achilles\nof Rationalist Psychology</em>, Thomas M. Lennon and Robert J.\nStainton (eds.), (Studies in the History of Philosophy of Mind 7),\nDordrecht: Springer Netherlands, 215–233.\ndoi:10.1007/978-1-4020-6893-5_12",
                "Schneiders, Werner (ed.), 1983, <em>Christian Wolff,\n1679–1754: Interpretationen zu seiner Philosophie und deren\nWirkung mit einer Bibliographie der Wolff-Literatur</em>, (Studien zum\nachtzehnten Jahrhundert 4), Hamburg: F. Meiner.",
                "Schönfeld, Martin, 2000, <em>The Philosophy of the Young\nKant: The Precritical Project</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195132181.001.0001",
                "–––, 2002, “Christian Wolff and Leibnizian\nMonads”, <em>Leibniz Society Review</em>, 12: 131–135.\ndoi:10.5840/leibniz20021214",
                "Stan, Marius, 2012, “Newton and Wolff: The Leibnizian\nReaction to the <em>Principia</em>, 1716–1763”, <em>The Southern\nJournal of Philosophy</em>, 50(3): 459–481.\ndoi:10.1111/j.2041-6962.2012.00133.x",
                "Stiening, Gideon, 2003, “‘Partes Metaphysicae sunt\nduae: Deus &amp; Mentes.’ Anmerkungen zur Entstehung und\nEntwicklung der Psychologie als Metaphysica specialis zwischen Rudolph\nGoclenius und Christian Wolff”, in Rudolph and Goubet 2003:\n207–226. doi:10.1515/9783110932317.207",
                "Stolzenberg, Jürgen and Oliver-Pierre Rudolph (eds), 2007,\n<em>Christian Wolff und die europäische Aufklärung: Akten\ndes 1. Internationalen Christian-Wolff-Kongresses, Halle (Saale)</em>,\nHildesheim: Olms.",
                "Sturm, Thomas, 2009, <em>Kant und die Wissenschaften vom\nMenschen</em>, Paderborn: Mentis.",
                "Sutherland, Daniel, 2010, “Philosophy, Geometry, and Logic\nin Leibniz, Wolff, and the Early Kant”, in <em>Discourse on a\nNew Method: Reinvigorating the Marriage of History and Philosophy of\nScience</em>, Mary Domski &amp; Michael Dickson (eds), Chicago: Open\nCourt, 155–192.",
                "Theis, Robert, 2018, “Theologie”, in Theis and Aichele\n2018: 219–250. doi:10.1007/978-3-658-14737-2_11",
                "Theis, Robert and Alexander Aichele (eds.), 2018, <em>Handbuch\nChristian Wolff</em>, Wiesbaden: Springer Fachmedien Wiesbaden.\ndoi:10.1007/978-3-658-14737-2",
                "Thiel, Udo, 1996, “Between Wolff and Kant: Merian’s\nTheory of Apperception”, <em>Journal of the History of\nPhilosophy</em>, 34(2): 213–232. doi:10.1353/hph.1996.0038",
                "–––, 2011, <em>The Early Modern Subject:\nSelf-Consciousness and Personal Identity from Descartes to Hume</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199542499.001.0001",
                "van Peursen, Cornelis Anthonie, 1987, “Christian\nWolff’s Philosophy of Contingent Reality”, <em>Journal of\nthe History of Philosophy</em>, 25(1): 69–82.\ndoi:10.1353/hph.1987.0005",
                "van den Berg, Hein, 2013a, “The Wolffian Roots of\nKant’s Teleology”, <em>Studies in History and Philosophy\nof Science Part C: Studies in History and Philosophy of Biological and\nBiomedical Sciences</em>, 44(4): 724–734.\ndoi:10.1016/j.shpsc.2013.07.003",
                "–––, 2013b, “Wolff and Kant on Scientific\nDemonstration and Mechanical Explanation”, <em>Archiv für\nGeschichte der Philosophie</em>, 95(2): 178–205.\ndoi:10.1515/agph-2013-0008",
                "Vanzo, Alberto, 2015, “Christian Wolff and Experimental\nPhilosophy”, <em>Oxford Studies in Early Modern Philosophy,\nVolume VII</em>, Daniel Garber and Donald Rutherford (eds.),\n225–55 .",
                "Vidal, Fernando, 2011, <em>The Sciences of the Soul: The Early\nModern Origins of Psychology</em>, Chicago: Chicago University\nPress.",
                "Watkins, Eric;, 1998, “From Pre-Established Harmony to\nPhysical Influx: Leibniz’s Reception in Eighteenth Century\nGermany”, <em>Perspectives on Science</em>, 6(1):\n136–203.",
                "–––, 2005, <em>Kant and the Metaphysics of\nCausality</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511614217",
                "Wilson, Catherine, 1994, “The Reception of Leibniz in the\nEighteenth Century”, in <em>The Cambridge Companion to\nLeibniz</em>, Nicholas Jolley (ed.), Cambridge: Cambridge University\nPress, 442–474. doi:10.1017/CCOL0521365880.013",
                "Wunderlich, Falk, 2005, <em>Kant und die Bewusstseinstheorien des\n18. Jahrhunderts</em>, Berlin: De Gruyter.",
                "Wuttke, Heinrich (ed.), 1841, <em>Christian Wolffs eigene\nLebensbeschreibung</em>, Leipzig: Weidemann.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"WolfPrinWork\">Wolff’s Principal Works</h3>\n<p>\nFor a complete listing of Wolff’s works, see Theis &amp; Aichele\n(2018: 20–27). Editions of all of Wolff’s works have been\nreprinted in the series:</p>\n<ul class=\"hanging\">\n<li> <em>Christian Wolff: Gesammelte Werke</em>, 1962–, edited\nby Jean École, Hans Werner Arndt, Charles Anthony Corr, Joseph\nEhrenfried Hofmann, M. Thoman, Hildesheim: Olms. </li>\n</ul>\n<p>\nIn the case of the <em>German Logic</em> and <em>German\nMetaphysics</em>, both of which saw numerous editions and significant\nchanges throughout Wolff’s lifetime, references in this entry\nare to the later, reprinted editions.</p>\n<p>\nIn the above entry, all translations are by the authors unless otherwise indicated.</p>\n<h4 id=\"WolfGermText\">Wolff’s German Texts</h4>\n<ul class=\"hanging\">\n<li>1710, <em>Der Anfangs-Gründe aller mathematischen\nWissenschafften</em> (Elements of All the Mathematical Sciences),\nHalle.</li>\n<li>[GL] 1713, <em>Vernünftige Gedanken von den Kräften des\nmenschlichen Verstandes und ihrem richtigen Gebrauch in der Erkenntnis\nder Wahrheit</em> (Rational Thoughts on the Powers of the Human\nUnderstanding and its Proper Use in the Cognition of Truth), Halle.\n14<sup>th</sup> edition [1754] reprinted with an introduction by Hans\nWerner Arndt in <em>Christian Wolff, Gesammelte Werke</em>, 1.Abt.,\nDeutsche Schriften, Bd.1. Hildesheim: Olms, 1965.</li>\n<li>[GM] 1720a, <em>Vernünftige Gedanken von Gott, der Welt und\nder Seele des Menschen, auch allen Dingen überhaupt</em>\n(Rational Thoughts on God, the World and the Soul of Man, and on All\nThings in General), Halle. 7th edition [1751] reprinted with\nintroduction by Charles A. Corr in <em>Christian Wolff, Gesammelte\nWerke</em>, 1.Abt., Deutsche Schriften, Bd.3. Hildesheim: Olms,\n1983.</li>\n<li>1720b, <em>Vernünftige Gedanken von der Menschen Thun und\nLassen zur Beförderung ihrer Glückseligkeit</em> (Rational\nThoughts on Human Action and Omission with a View to Promoting his Happiness),\nHalle.</li>\n<li>1721, <em>Vernünftige Gedanken von dem gesellschaftlichen\nLeben der Menschen, und insonderheit dem gemeinen Wesen</em> (Rational\nThoughts on the Social Life of the Human Being, and in particular on the Commonwealth),\nHalle.</li>\n<li>1723, <em>Vernünftige Gedanken von den Wirkungen der\nNatur</em> (Rational Thoughts on the Operations of Nature, Halle.</li>\n<li>1724, <em>Vernünftige Gedanken von den Absichten der\nnatürlichen Dingen</em> (Rational Thoughts on the Purposes of Natural Things),\nFrankfurt and Leipzig.</li>\n<li>1725, <em>Vernünftige Gedanken von dem Gebrauche der Theile\ndes menschlichen Leibes, der Thiere und Pflanzen</em> (Rational\nThoughts on the Employment of the Parts of the Human Body, Animals, and Plants),\nFrankfurt.</li>\n</ul>\n<h4 id=\"WolfLatiText\">Wolff’s Latin Texts</h4>\n<ul class=\"hanging\">\n<li>1703a, <em>Philosophia practica universalis, methodo mathematica\nconscripta</em> (On Universal Practical Philosophy, composed according\nto the Mathematical Method).</li>\n<li>1703b, <em>Disquisitio philosophica de loquela</em>, Leipzig.</li>\n<li>1709, <em>Aërometriæ elementa</em>, Leipzig.</li>\n<li>1713–15, <em>Elementa matheseos universae</em> (Elements of\nAll the Mathematical Sciences), 2 vols. Halle.</li>\n<li>1716, <em>Mathematisches Lexicon</em> (Mathematical Lexicon),\nLeipzig.</li>\n<li>1718, <em>Ratio prælectionum Wolfianarum</em>, Halle.</li>\n<li>[LL] 1728, <em>Philosophia rationalis sive Logica, methodo\nscientifica pertractata, et ad usum scientiarum. atque vitae aptata.\nPraemittitur discursus praeliminaris de philosophia in genere</em>\n(Rational Philosophy, or Logic), Frankfurt. Includes\n\n<ul class=\"hanging\">\n<li>[DP] <em>Discursus praeliminaris de philosophia in genere</em>\n(Preliminary Discourse on Philosophy in General)</li>\n</ul> </li>\n<li>[Ont.] 1730, <em>Philosophia prima sive ontologia methodo\nscientifica pertractata qua omnis cognitionis humanae principia\ncontinentur</em> (First Philosophy, or Ontology), Frankfurt.</li>\n<li>[Cosm.] 1731, <em>Cosmologia generalis methodo scientifica\npertractata, qua ad solidam imprimis Dei atque naturae cognitionem via\nsternitur</em> (General Cosmology), Frankfurt and Leipzig.</li>\n<li>[EP] 1732, <em>Psychologia empirica methodo scientifica\npertractata, qua ea quae de anima humana indubia experientiae fide\nconstant, continentur</em> (Empirical Psychology), Frankfurt and\nLeipzig.</li>\n<li>[RP] 1734, <em>Psychologia rationalis methodo scientifica\npertractata, qua ea, quae de anima humana indubia experientiae fide\ninnotescunt</em> (Rational Psychology), Frankfurt.</li>\n<li>[NT] 1736–7, <em>Theologia naturalis scientifica\npertractata</em> (Natural Theology), 2 vols., Frankfurt.</li>\n<li>1738–9, <em>Philosophia practica universalis methodo\nscientifica pertractata</em>, 2 vols. Frankfurt.</li>\n<li> 1740–1748, <em>Jus naturae methodo scientifica\npertractatum</em>, 8 vols., Frankfurt &amp; Leipzig, and Halle.</li>\n<li>1749, <em>Jus gentium methodo scientifica pertractatum</em> (The\nLaw of Nations Treated According to a Scientific Method), Halle.</li>\n<li> 1750–3, <em>Philosophia moralis sive ethica</em>, 5 vols.,\nHalle.</li>\n<li>1963, <em>Briefwechsel zwischen Leibniz und Christian Wolff</em>,\nC. I. Gerhardt (ed.). Hildesheim: Georg Olms Verlagsbuchhandlung.</li>\n</ul>\n<h4 id=\"PrimLiteEnglTran\">Primary Literature in English Translation</h4>\n<ul class=\"hanging\">\n<li>1770, <em>Logic, or Rational Thoughts on the Powers of the Human\nUnderstanding with their Use and Application in the Knowledge and\nSearch of Truth</em>, London: Printed for L. Hawes, W. Clarke, and R.\nCollins. Translation of <em>Vernünftige Gedanken von den\nKräften des menschlichen Verstandes und ihrem richtigen Gebrauch\nin der Erkenntnis der Wahrheit</em> (1713/GL).</li>\n<li>1963, <em>Preliminary Discourse on Philosophy in General</em>,\nTranslated by Richard J. Blackwell, Indianapolis: The Bobbs-Merrill\nCompany, Inc. Translation of <em>Discursus praeliminaris de\nphilosophia in genere</em> (1729/DP).</li>\n<li>2003, <em>Moral Philosophy from Montaigne to Kant</em>, translated\nby J. B. Schneewind, Cambridge: Cambridge University Press. Contains a\ntranslation of excerpts from Wolff’s <em>Vernünftige\nGedanken von der Menschen Thun und Lassen zur Beförderung ihrer\nGlückseligkeit</em> (1720b).</li>\n<li>2009, <em>Kant’s Critique of Pure Reason: Background Source\nMaterials</em>, edited and translated by Eric Watkins, Cambridge:\nCambridge University Press. Contains a translation of excerpts from\nWolff’s <em>Vernünftige Gedanken von Gott, der Welt und der\nSeele des Menschen, auch allen Dingen überhaupt</em>\n(1720a/GM).</li>\n<li>2017, <em>The Law of Nations Treated according to a Scientific\nMethod</em>, translated by Joseph H. Drake, revised and edited by\nThomas Ahnert, Carmel, IN: Liberty Fund. Translation of <em>Jus\ngentium methodo scientifica pertractatum</em> (1749). </li>\n<li>[EMGP] 2019, <em>Early Modern German Philosophy</em>,\nedited and translated by Corey W. Dyck, Oxford: Oxford University\nPress. Contains a translation of selections from Wolff’s\n<em>Vernünftige Gedanken von Gott, der Welt und der Seele des\nMenschen, auch allen Dingen überhaupt</em> (1729a/GM) and of\nWolff’s “Refutation of Spinoza” from the\n<em>Theologia naturalis</em> (1736–7/NT).</li>\n</ul>\n<h3 id=\"OthePrimSour\">Other Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Baumeister, Friedrich Christian, 1747, <em>Elementa Philosophiae\nRecentioris</em>, Leipzig: Gleditschii.</li>\n<li>Crusius, Christian August, 1743, <em>Dissertatio philosophica de usu\net limitibus principii rationis determinantis, vulgo\nsufficientis¸</em>; translated in EMGP.</li>\n<li>Kant, Immanuel, 1900–, <em>Kants gesammelte Schriften</em>,\nedited by Königlichen Preußischen (later Deutschen) Akademie der Wissenschaften\n(ed.), Berlin: Georg Reimer (later Walter De Gruyter).</li>\n<li>–––, 1998, <em>Critique of Pure Reason</em>,\nP. Guyer and A. Wood (eds. and trans.), Cambridge: Cambridge\nUniversity Press.</li>\n</ul>\n<h3 id=\"SeleSecoLite\">Selected Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Anderson, R. Lanier, 2005, “The Wolffian Paradigm and Its\nDiscontent: Kant’s Containment Definition of Analyticity in\nHistorical Context”, <em>Archiv für Geschichte der\nPhilosophie</em>, 87(1): 22–74.\ndoi:10.1515/agph.2005.87.1.22</li>\n<li>–––, 2015, <em>The Poverty of Conceptual Truth:\nKant’s Analytic/Synthetic Distinction and the Limits of\nMetaphysics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198724575.001.0001</li>\n<li>Arndt, Hans Werner, 1983, “Rationalismus und Empirismus in\nder Erkenntnislehre Christian Wolffs”, in Schneiders 1983:\n31–47.</li>\n<li>Beck, Lewis White, 1969, <em>Early German Philosophy: Kant and His\nPredecessors</em>, Cambridge MA: Harvard University Press.</li>\n<li>Beiser, Frederick C., 1987, <em>The Fate of Reason: German\nPhilosophy from Kant to Fichte</em>, Cambridge MA: Harvard University\nPress.</li>\n<li>–––, 2009, <em>Diotima’s Children: German\nAesthetic Rationalism from Leibniz to Lessing</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199573011.001.0001</li>\n<li>Beutel, Albrecht, 2001, “Causa Wolffiana. Die Vertreibung\nChristian Wolffs aus Preußen 1723 als Kulminationspunkt des\nthelogisch-politischen Konflikts zwischen halleschem Pietismus und\nAufklärungsphilosophie”, in <em>Wissenschaftliche Theologie\nund Kirchenleitung. Beiträge zur Geschichte einer\nspannungsreichen Beziehung</em>, Ulrich Köpf (ed.),\nTübingen: Mohr Siebeck, 159–202.</li>\n<li>Bianco, Bruno, 1989, “Freiheit gegen Fatalismus. Zu Joachim\nLanges Kritik an Wolff”, in <em>Zentren der Aufklärung.\nHalle: Aufklärung und Pietismus</em>, vol. I, Norbert Hinske,\nBerlin: DeGruyter, 111–155.</li>\n<li>Bissinger, Anton, 1970, <em>Die Struktur der Gotteserkenntnis.\nStudien zur Philosophie Christian Wolffs</em>, Bonn: Bouvier.</li>\n<li>Blackall, Eric A., 1978, <em>The Emergence of German as a Literary\nLanguage: 1700–1775</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Blackwell, Richard J., 1961, “Christian Wolff’s\nDoctrine of the Soul”, <em>Journal of the History of Ideas</em>,\n22(3): 339–354. doi:10.2307/2708129</li>\n<li>–––, 1961, “The Structure of Wolffian\nPhilosophy”:, <em>The Modern Schoolman</em>, 38(3):\n203–218. doi:10.5840/schoolman196138325</li>\n<li>Buchenau, Stefanie, 2013, <em>The Founding of Aesthetics in the\nGerman Enlightenment: The Art of Invention and the Invention of\nArt</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139225281</li>\n<li>Burns, John V., 1966, <em>Dynamism in the Cosmology of Christian\nWolff: A Study in Pre-Critical Rationalism</em>, New York: Exposition\nPress.</li>\n<li>Calinger, Ronald S., 1969, “The Newtonian-Wolffian\nControversy: 1740–1759”, <em>Journal of the History of\nIdeas</em>, 30(3): 319–330. doi:10.2307/2708560</li>\n<li>Campo, Mariano, 1939, <em>Cristiano Wolff e il razionalismo\nprecritico</em>, Milan.</li>\n<li>Carboncini, Sonia, 1991, <em>Transzendental Wahrheit und Traum:\nChristian Wolffs Antwort auf die Herausforderung durch den\nCartesianischen Zweifel</em>, Stuttgart-Bad Cannstatt:\nFromann-Holzboog.</li>\n<li>Cataldi Madonna, Luigi, 2001, <em>Christian Wolff und das System\ndes klassischen Rationalismus</em>, Hildesheim: Olms.</li>\n<li>–––, 2011, “The Eighteenth-Century\nRehabilitation of Sensitive Knowledge and the Birth of Aesthetics:\nWolff, Baumgarten and Mendelssohn”, in <em>Moses\nMendelssohn’s Metaphysics and Aesthetics</em>, Reinier Munk\n(ed.) (Studies in German Idealism 13), Dordrecht: Springer\nNetherlands, 279–297. doi:10.1007/978-94-007-2451-8_15</li>\n<li>–––, 2007, “Erfahrung und Intuition in der\nPhilosophie von Christian Wolff”, in Stolzenberg and Rudolph\n2007: vol. 2, 173–194.</li>\n<li>Chance, Brian A., 2018, “Wolff’s Empirical Psychology\nand the Structure of the Transcendental Logic”, in Dyck and Wunderlich 2018: 17–34.\ndoi:10.1017/9781316493229.002</li>\n<li>Corr, Charles Anthony, 1966, <em>Order and Method in Christian\nWolff’s Philosophy</em>, Phd Dissertation, Saint Louis, MO:\nSaint Louis University.</li>\n<li>–––, 1970, “Certitude and Utility in the\nPhilosophy of Christian Wolff”:, <em>Southwestern Journal of\nPhilosophy</em>, 1(1): 133–142.\ndoi:10.5840/swjphil197011/216</li>\n<li>–––, 1972, “Christian Wolff’s\nTreatment of Scientific Discovery”, <em>Journal of the History\nof Philosophy</em>, 10(3): 323–334.\ndoi:10.1353/hph.2008.1585</li>\n<li>–––, 1973, “The Existence of God, Natural\nTheology and Christian Wolff”, <em>International Journal for\nPhilosophy of Religion</em>, 4(2): 105–118.\ndoi:10.1007/BF00138698</li>\n<li>–––, 1975, “Christian Wolff and\nLeibniz”, <em>Journal of the History of Ideas</em>, 36(2):\n241–262. doi:10.2307/2708926</li>\n<li>–––, 1983,\n“Cartesian Themes in\nWolff’s German Metaphysics”, in Schneiders 1983:\n113–120.</li>\n<li>Dunlop, Katherine Laura, 2013, “Mathematical Method and\nNewtonian Science in the Philosophy of Christian Wolff”,\n<em>Studies in History and Philosophy of Science Part A</em>, 44(3):\n457–469. doi:10.1016/j.shpsa.2012.10.008</li>\n<li>–––, 2019, “Definitions and Empirical\nJustification in Christian Wolff’s Theory of Science”, in\nFrom Leibniz to Kant, Katherine Laura Dunlop and Samuel Levey (eds.),\n(Logical Analysis and History of Philosophy 21), Paderborn: mentis\nVerlag, 149–176.</li>\n<li>Dyck, Corey W., 2011, “A Wolff in Kant’s Clothing:\nChristian Wolff’s Influence on Kant’s Accounts of\nConsciousness, Self-Consciousness, and Psychology: A Wolff in\nKant’s Clothing”, <em>Philosophy Compass</em>, 6(1):\n44–53. doi:10.1111/j.1747-9991.2010.00370.x</li>\n<li>–––, 2014, <em>Kant and Rational\nPsychology</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199688296.001.0001</li>\n<li>–––, 2016, “The Priority of Judging: Kant\non Wolff’s General Logic”, <em>Estudos Kantianos</em>,\n4(2): 99–118.\n [<a href=\"http://revistas.marilia.unesp.br/index.php/ek/article/view/6659\" target=\"other\">Dyck 2016 available online</a>]</li>\n<li>–––, forthcoming[a], “Power, Harmony, and\nFreedom: Debating Causation in 18<sup>th</sup> Century Germany”,\nin <em>Oxford Handbook of German Philosophy in the Eighteenth\nCentury</em>, Brandon C. Look and Frederick C. Beiser (eds), Oxford:\nOxford University Press.</li>\n<li>–––, forthcoming[b], “Before and Beyond\nLeibniz: Tschirnhaus and Wolff on Experience and Method”, in\n<em>The Experiential Turn in 18th Century German Philosophy</em>,\nKarin DeBoer and Tinca Prunea-Bretonnet (eds), London: Routledge.</li>\n<li>Dyck, Corey W. and Falk Wunderlich (eds.), 2018, <em>Kant and\nHis German Contemporaries, Volume 1: Logic, Mind, Epistemology,\nScience and Ethics</em>, Cambridge: Cambridge University Press. doi:10.1017/9781316493229</li>\n<li>École, Jean, 1979, “En quel sens peut-on dire que\nWolff est rationaliste?”, <em>Studia Leibnitiana</em>, 11(1):\n45–61.</li>\n<li>–––, 1990, <em>La métaphysique de\nChristian Wolff</em>, Hildesheim: Olms.</li>\n<li>–––, 2001, “Des rapports de la\nmétaphysique de Christian Wolff avec celle des\nScolastiques”, in <em>Autour de la philosophie Wolffienne</em>,\nJean École (ed.), Hildesheim: Olms, 55–69.</li>\n<li>Engfer, Hans-Jürgen, 1992, “Von der leibnizischen\nMonadologie zur empirischen Psychologie Wolffs”, in <em>Nuovi\nstudi sul pensiero di Christian Wolff</em>, Sonia Carboncini and Luigi\nCataldi Madonna (eds.). Hildesheim: Olms, 193–215.</li>\n<li>Erdmann, Johann Eduard, 1866 [1890],\n<em>Grundriss der Geschichte der\nPhilosophie</em>, volume 2. Translated, from the third edition of\n1877, as <em>The History of Philosophy</em>, volume 2, Williston S.\nHough (trans.), New York: Macmillan &amp; Co.</li>\n<li>Euler, Werner, 2003,\n“Bewußtsein—Seele—Geist: Untersuchungen zur\nTransformation des Cartesischen ‘Cogito’ in der\nPsychologie Christian Wolffs”, in Rudolph and Goubet 2003:\n11–50. doi:10.1515/9783110932317.11</li>\n<li>Fabian, Gerd, 1925, <em>Beitrag zur Geschichte des\nLeib-Seele-Problems: Lehre von der prästabilierten Harmonie und\npsychophysischen Parallelismus in der Leibniz-Wolffschen Schule</em>,\nLangensalza: Hermann Beyer und Söhne.</li>\n<li>Falkenstein, Lorne, 1991, “Kant, Mendelssohn, Lambert, and\nthe Subjectivity of Time”, <em>Journal of the History of\nPhilosophy</em>, 29(2): 227–251. doi:10.1353/hph.1991.0046</li>\n<li>Favaretti Camposampiero, Matteo, 2009, <em>Conoscenza simbolica.\nPensiero e linguaggio in Christian Wolff e nella prima età\nmoderna</em>, Hildesheim: Olms.</li>\n<li>–––, 2018, “Philosophy of Language”,\nin Theis and Aichele 2018: 115–135.\ndoi:10.1007/978-3-658-14737-2_6</li>\n<li>–––, forthcoming, “Mereology and\nMathematics: Christian Wolff’s Foundational Programme”,\n<em>British Journal for the History of Philosophy</em>, early online:\n11 March 2019. doi:10.1080/09608788.2019.1568228</li>\n<li>Fischer, Klaus P., 1975, “John Locke in the German\nEnlightenment: An Interpretation”, <em>Journal of the History of\nIdeas</em>, 36(3): 431–446. doi:10.2307/2708655</li>\n<li>Frangsmyr, Tore, 1975, “Christian Wolff’s Mathematical\nMethod and Its Impact on the Eighteenth Century”, <em>Journal of\nthe History of Ideas</em>, 36(4): 653–668.\ndoi:10.2307/2708994</li>\n<li>Gava, Gabriele, 2018, “Kant, Wolff, and the Method of\nPhilosophy”, <em>Oxford Studies in Early Modern Philosophy,\nVolume VIII</em>, Daniel Garber and Donald Rutherford (eds.), Oxford:\nOxford University Press, 271–304.</li>\n<li>Gilson, Etienne, 1952, <em>Being and Some Philosophers</em>,\nsecond edition, Toronto: Pontifical Institute of Mediaeval\nStudies.</li>\n<li>Gomez Tutor, Juan Ignacio, 2004, <em>Die wissenschaftliche Methode\nbei Christian Wolff</em>, Hildesheim: Olms.</li>\n<li>Gracia, Jorge J. E., 1993, “Christian Wolff on\nIndividuation”, <em>The History of Philosophy Quarterly</em>,\n10: 147–164.</li>\n<li>Heßbrüggen-Walter, Stefan, 2004, <em>Die Seele und ihre\nVermögen: Kants Metaphysik des Mentalen in der Kritik der reinen\nVernunft</em>, Paderborn: Mentis.</li>\n<li>Hettche, Matt, 2008, “On the Cusp of Europe’s\nEnlightenment: Christian Wolff and the Argument for Academic\nFreedom”, <em>Florida Philosophical Review: The Journal of the\nFlorida Philosophical Association</em>, 8(1): 91–107.\n [<a href=\"https://philosophy.cah.ucf.edu/fpr/issues-8_1.php\" target=\"other\">Hettche 2008 available online (download full issue)</a>]</li>\n<li>Kanamori, Shigenari, 1997, “Christian Wolff’s Speech\non Confucianism: Confucius Compared with Wolff”, <em>European\nJournal of Law and Economics</em>, 4(2–3): 299–304.\ndoi:10.1023/A:1008635611833</li>\n<li>Kawamura, Katsuoshi, 1996, <em>Spontaneität und Willkür:\nDer Freiheitsbegriff in Kants Antinomienlehre und seine historischen\nWurzeln</em>, Stuttgart: Frommann-Holzboog.</li>\n<li>Kertscher, Hans-Joachim, 2018, <em>“Er brachte Licht und\nOrdnung in die Welt”. Christian Wolff—eine\nBiographie</em>, Halle: Mitteldeutscher Verlag.</li>\n<li>Kreimendahl, Lothar, 2007, “Empiristische Elemente im Denken\nWolffs”, in Stolzenberg and Rudolph 2007: vol. 1,\n95–112.</li>\n<li>Kuehn, Manfred, 1987, <em>Scottish Common Sense in Germany,\n1768–1800: A Contribution to the History of Critical\nPhilosophy</em>, Kingston: McGill-Queen’s University Press.</li>\n<li>–––, 1997, “The Wolffian Background of\nKant’s Transcendental Deduction”, in <em>Logic and the\nWorkings of the Mind: The Logic of Ideas and Faculty Psychology in\nEarly Modern Philosophy</em>, Patricia A. Easton and Lorne Falkenstein\n(eds), Atascadero, CA: Ridgeview Publishing Company,\n229–250.</li>\n<li>Lach, Donald F., 1953, “The Sinophilism of Christian Wolff\n(1679–1754)”, <em>Journal of the History of Ideas</em>,\n14(4): 561–574. doi:10.2307/2707702</li>\n<li>Leduc, Christian, 2018, “Sources of Wolff’s\nPhilosophy: Scholastics/Leibniz”, in Theis and Aichele 2018:\n35–53. doi:10.1007/978-3-658-14737-2_2</li>\n<li>Leibniz, Gottfried Wilhelm, 1989a, <em>Philosophical Essays</em>,\nRoger Ariew and Daniel Garber (trans.), Indianapolis: Hackett Pub.\nCo.</li>\n<li>Leibniz, Gottfried Wilhelm, 1989b, <em>Philosophical Papers and\nLetters</em>, Leroy E. Loemker (ed.), second edition, Dordrecht:\nSpringer Netherlands. doi:10.1007/978-94-010-1426-7</li>\n<li>Lenders, Winfried, 1971, “The Analytic Logic of G. W.\nLeibniz and Chr. Wolff: A Problem in Kant Research”,\n<em>Synthese</em>, 23(1): 147–153. doi:10.1007/BF00414150</li>\n<li>Louden, Robert, 2002, “‘What Does Heaven Say?’\nChristian Wolff and Western Interpretations of Confucian\nEthics”, in <em>Confucius and the Analects: New Essays</em>,\nBryan W. Van Norden (ed.), New York: Oxford University Press,\n73–93.</li>\n<li>Morrison, James C, 1993, “Christian Wolff’s Criticisms\nof Spinoza”, <em>Journal of the History of Philosophy</em>,\n31(3): 405–420. doi:10.1353/hph.1993.0057</li>\n<li>Paulsen, Friedrich, 1902 [1906], <em>Die deutschen\nUniversitäten und das Universitätsstudium</em>, Berlin: A.\nAsher. Translated as <em>The German Universities and University\nStudy</em>, Frank Thilly and William W. Elwang, New York: Charles\nScribner’s Sons, 1906.</li>\n<li>Richards, Robert J., 1980, “Christian Wolff’s\nProlegomena to Empirical and Rational Psychology: Translation and\nCommentary”, <em>Proceedings of the American Philosophical\nSociety</em>, 124(3): 227–239.</li>\n<li>Rudolph, Oliver-Pierre and Jean-François Goubet, 2003,\n<em>Die Psychologie Christian Wolffs: Systematische und historische\nUntersuchungen</em>, (Hallesche Beiträge Zur Europäischen\nAufklärung), Tübingen: Niemeyer.\ndoi:10.1515/9783110932317</li>\n<li>Rumore, Paola, 2018, “Empirical Psychology”, in Theis\nand Aichele 2018: 175–196. doi:10.1007/978-3-658-14737-2_9</li>\n<li>Rutherford, Donald, 2004,\n“Idealism Declined: Leibniz and Christian Wolff”, in\n<em>Leibniz and His Correspondents</em>, Paul Lodge (ed.), Cambridge:\nCambridge University Press, 214–237.\ndoi:10.1017/CBO9780511498237.010</li>\n<li>Sassen, Brigitte, 2008, “Kant and Mendelssohn on the\nImplications of the ‘I Think’”, in <em>The Achilles\nof Rationalist Psychology</em>, Thomas M. Lennon and Robert J.\nStainton (eds.), (Studies in the History of Philosophy of Mind 7),\nDordrecht: Springer Netherlands, 215–233.\ndoi:10.1007/978-1-4020-6893-5_12</li>\n<li>Schneiders, Werner (ed.), 1983, <em>Christian Wolff,\n1679–1754: Interpretationen zu seiner Philosophie und deren\nWirkung mit einer Bibliographie der Wolff-Literatur</em>, (Studien zum\nachtzehnten Jahrhundert 4), Hamburg: F. Meiner.</li>\n<li>Schönfeld, Martin, 2000, <em>The Philosophy of the Young\nKant: The Precritical Project</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195132181.001.0001</li>\n<li>–––, 2002, “Christian Wolff and Leibnizian\nMonads”, <em>Leibniz Society Review</em>, 12: 131–135.\ndoi:10.5840/leibniz20021214</li>\n<li>Stan, Marius, 2012, “Newton and Wolff: The Leibnizian\nReaction to the <em>Principia</em>, 1716–1763”, <em>The Southern\nJournal of Philosophy</em>, 50(3): 459–481.\ndoi:10.1111/j.2041-6962.2012.00133.x</li>\n<li>Stiening, Gideon, 2003, “‘Partes Metaphysicae sunt\nduae: Deus &amp; Mentes.’ Anmerkungen zur Entstehung und\nEntwicklung der Psychologie als Metaphysica specialis zwischen Rudolph\nGoclenius und Christian Wolff”, in Rudolph and Goubet 2003:\n207–226. doi:10.1515/9783110932317.207</li>\n<li>Stolzenberg, Jürgen and Oliver-Pierre Rudolph (eds), 2007,\n<em>Christian Wolff und die europäische Aufklärung: Akten\ndes 1. Internationalen Christian-Wolff-Kongresses, Halle (Saale)</em>,\nHildesheim: Olms.</li>\n<li>Sturm, Thomas, 2009, <em>Kant und die Wissenschaften vom\nMenschen</em>, Paderborn: Mentis.</li>\n<li>Sutherland, Daniel, 2010, “Philosophy, Geometry, and Logic\nin Leibniz, Wolff, and the Early Kant”, in <em>Discourse on a\nNew Method: Reinvigorating the Marriage of History and Philosophy of\nScience</em>, Mary Domski &amp; Michael Dickson (eds), Chicago: Open\nCourt, 155–192.</li>\n<li>Theis, Robert, 2018, “Theologie”, in Theis and Aichele\n2018: 219–250. doi:10.1007/978-3-658-14737-2_11</li>\n<li>Theis, Robert and Alexander Aichele (eds.), 2018, <em>Handbuch\nChristian Wolff</em>, Wiesbaden: Springer Fachmedien Wiesbaden.\ndoi:10.1007/978-3-658-14737-2</li>\n<li>Thiel, Udo, 1996, “Between Wolff and Kant: Merian’s\nTheory of Apperception”, <em>Journal of the History of\nPhilosophy</em>, 34(2): 213–232. doi:10.1353/hph.1996.0038</li>\n<li>–––, 2011, <em>The Early Modern Subject:\nSelf-Consciousness and Personal Identity from Descartes to Hume</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199542499.001.0001</li>\n<li>van Peursen, Cornelis Anthonie, 1987, “Christian\nWolff’s Philosophy of Contingent Reality”, <em>Journal of\nthe History of Philosophy</em>, 25(1): 69–82.\ndoi:10.1353/hph.1987.0005</li>\n<li>van den Berg, Hein, 2013a, “The Wolffian Roots of\nKant’s Teleology”, <em>Studies in History and Philosophy\nof Science Part C: Studies in History and Philosophy of Biological and\nBiomedical Sciences</em>, 44(4): 724–734.\ndoi:10.1016/j.shpsc.2013.07.003</li>\n<li>–––, 2013b, “Wolff and Kant on Scientific\nDemonstration and Mechanical Explanation”, <em>Archiv für\nGeschichte der Philosophie</em>, 95(2): 178–205.\ndoi:10.1515/agph-2013-0008</li>\n<li>Vanzo, Alberto, 2015, “Christian Wolff and Experimental\nPhilosophy”, <em>Oxford Studies in Early Modern Philosophy,\nVolume VII</em>, Daniel Garber and Donald Rutherford (eds.),\n225–55 .</li>\n<li>Vidal, Fernando, 2011, <em>The Sciences of the Soul: The Early\nModern Origins of Psychology</em>, Chicago: Chicago University\nPress.</li>\n<li>Watkins, Eric;, 1998, “From Pre-Established Harmony to\nPhysical Influx: Leibniz’s Reception in Eighteenth Century\nGermany”, <em>Perspectives on Science</em>, 6(1):\n136–203.</li>\n<li>–––, 2005, <em>Kant and the Metaphysics of\nCausality</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511614217</li>\n<li>Wilson, Catherine, 1994, “The Reception of Leibniz in the\nEighteenth Century”, in <em>The Cambridge Companion to\nLeibniz</em>, Nicholas Jolley (ed.), Cambridge: Cambridge University\nPress, 442–474. doi:10.1017/CCOL0521365880.013</li>\n<li>Wunderlich, Falk, 2005, <em>Kant und die Bewusstseinstheorien des\n18. Jahrhunderts</em>, Berlin: De Gruyter.</li>\n<li>Wuttke, Heinrich (ed.), 1841, <em>Christian Wolffs eigene\nLebensbeschreibung</em>, Leipzig: Weidemann.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "aesthetics: German, in the 18th century",
            "Continental Rationalism",
            "German Philosophy: in the 18th century, prior to Kant",
            "intrinsic vs. extrinsic properties",
            "Kant, Immanuel: and Leibniz",
            "Kant, Immanuel: critique of metaphysics",
            "Kant, Immanuel: philosophy of science",
            "Leibniz, Gottfried Wilhelm",
            "Leibniz, Gottfried Wilhelm: ethics",
            "Leibniz, Gottfried Wilhelm: on causation",
            "Leibniz, Gottfried Wilhelm: on the problem of evil",
            "Leibniz, Gottfried Wilhelm: philosophy of mind",
            "mathematics: inconsistent",
            "Mendelssohn, Moses",
            "rationalism vs. empiricism"
        ],
        "entry_link": [
            {
                "../aesthetics-18th-german/": "aesthetics: German, in the 18th century"
            },
            {
                "../continental-rationalism/": "Continental Rationalism"
            },
            {
                "../18thGerman-preKant/": "German Philosophy: in the 18th century, prior to Kant"
            },
            {
                "../intrinsic-extrinsic/": "intrinsic vs. extrinsic properties"
            },
            {
                "../kant-leibniz/": "Kant, Immanuel: and Leibniz"
            },
            {
                "../kant-metaphysics/": "Kant, Immanuel: critique of metaphysics"
            },
            {
                "../kant-science/": "Kant, Immanuel: philosophy of science"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../leibniz-ethics/": "Leibniz, Gottfried Wilhelm: ethics"
            },
            {
                "../leibniz-causation/": "Leibniz, Gottfried Wilhelm: on causation"
            },
            {
                "../leibniz-evil/": "Leibniz, Gottfried Wilhelm: on the problem of evil"
            },
            {
                "../leibniz-mind/": "Leibniz, Gottfried Wilhelm: philosophy of mind"
            },
            {
                "../mathematics-inconsistent/": "mathematics: inconsistent"
            },
            {
                "../mendelssohn/": "Mendelssohn, Moses"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=wolff-christian\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/wolff-christian/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=wolff-christian&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/wolff-christian/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=wolff-christian": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/wolff-christian/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=wolff-christian&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/wolff-christian/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://jacklynch.net/18th/\" target=\"other\">Eighteenth-Century Resources</a>, Jack Lynch, Rutgers University.",
            "<a href=\"http://galileo.rice.edu/Catalog/NewFiles/wolff.html\" target=\"other\">Christian Wolff</a>,\n at the Galileo Project, Rice University.",
            "<a href=\"https://www.christian-wolff-gesellschaft.de/\" target=\"other\">Christian Wolff-Gesellschaft für die Philosophie der Aufklärung</a>"
        ],
        "listed_links": [
            {
                "http://jacklynch.net/18th/": "Eighteenth-Century Resources"
            },
            {
                "http://galileo.rice.edu/Catalog/NewFiles/wolff.html": "Christian Wolff"
            },
            {
                "https://www.christian-wolff-gesellschaft.de/": "Christian Wolff-Gesellschaft für die Philosophie der Aufklärung"
            }
        ]
    }
}