{
    "url": "abduction",
    "title": "Abduction",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Igor Douven\n<igor.douven@paris-sorbonne.fr>",
        "author_links": [
            {
                "mailto:igor%2edouven%40paris-sorbonne%2efr": "igor.douven@paris-sorbonne.fr"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nIgor Douven\n&lt;<a href=\"mailto:igor%2edouven%40paris-sorbonne%2efr\"><em>igor<abbr title=\" dot \">.</abbr>douven<abbr title=\" at \">@</abbr>paris-sorbonne<abbr title=\" dot \">.</abbr>fr</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Mar 9, 2011",
        "substantive revision Tue May 18, 2021"
    ],
    "preamble": "\n\nIn the philosophical literature, the term “abduction” is\nused in two related but different senses. In both senses, the term\nrefers to some form of explanatory reasoning. However, in the\nhistorically first sense, it refers to the place of explanatory\nreasoning in generating hypotheses, while in the sense in\nwhich it is used most frequently in the modern literature it refers to\nthe place of explanatory reasoning in justifying hypotheses.\nIn the latter sense, abduction is also often called “Inference\nto the Best Explanation.”\n\nThis entry is exclusively concerned with abduction in the modern\nsense, although there is a supplement on abduction in the historical\nsense, which had its origin in the work of Charles Sanders\nPeirce—see the\n\nSupplement: Peirce on Abduction.\n \n\nSee also the entry on\n scientific discovery,\n in particular the section on discovery as abduction.\n\nMost philosophers agree that abduction (in the sense of Inference to\nthe Best Explanation) is a type of inference that is frequently\nemployed, in some form or other, both in everyday and in scientific\nreasoning. However, the exact form as well as the normative status of\nabduction are still matters of controversy. This entry contrasts\nabduction with other types of inference; points at prominent uses of\nit, both in and outside philosophy; considers various more or less\nprecise statements of it; discusses its normative status; and\nhighlights possible connections between abduction and Bayesian\nconfirmation theory.\n",
    "toc": [
        {
            "#AbdGenIde": "1. Abduction: The General Idea"
        },
        {
            "#DedIndAbd": "1.1 Deduction, induction, abduction"
        },
        {
            "#UbiAbd": "1.2 The ubiquity of abduction"
        },
        {
            "#ExpAbd": "2. Explicating Abduction"
        },
        {
            "#StaAbd": "3. The Status of Abduction"
        },
        {
            "#Cri": "3.1 Criticisms"
        },
        {
            "#Def": "3.2 Defenses"
        },
        {
            "#AbdVerBayConThe": "4. Abduction versus Bayesian Confirmation Theory"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Abduction: The General Idea\n\nYou happen to know that Tim and Harry have recently had a terrible row\nthat ended their friendship. Now someone tells you that she just saw\nTim and Harry jogging together. The best explanation for this that you\ncan think of is that they made up. You conclude that they are friends\nagain.\n\nOne morning you enter the kitchen to find a plate and cup on the\ntable, with breadcrumbs and a pat of butter on it, and surrounded by a\njar of jam, a pack of sugar, and an empty carton of milk. You conclude\nthat one of your house-mates got up at night to make him- or herself a\nmidnight snack and was too tired to clear the table. This, you think,\nbest explains the scene you are facing. To be sure, it might be that\nsomeone burgled the house and took the time to have a bite while on\nthe job, or a house-mate might have arranged the things on the table\nwithout having a midnight snack but just to make you believe that\nsomeone had a midnight snack. But these hypotheses strike you as\nproviding much more contrived explanations of the data than the one\nyou infer to.\n\nWalking along the beach, you see what looks like a picture of Winston\nChurchill in the sand. It could be that, as in the opening pages of\nHilary Putnam’s book Reason, Truth, and History,\n(1981), what you see is actually the trace of an ant crawling on the\nbeach. The much simpler, and therefore (you think) much better,\nexplanation is that someone intentionally drew a picture of Churchill\nin the sand. That, in any case, is what you come away believing.\n\nIn these examples, the conclusions do not follow logically from the\npremises. For instance, it does not follow logically that Tim and\nHarry are friends again from the premises that they had a terrible row\nwhich ended their friendship and that they have just been seen jogging\ntogether; it does not even follow, we may suppose, from all the\ninformation you have about Tim and Harry. Nor do you have any useful\nstatistical data about friendships, terrible rows, and joggers that\nmight warrant an inference from the information that you have about\nTim and Harry to the conclusion that they are friends again, or even\nto the conclusion that, probably (or with a certain probability), they\nare friends again. What leads you to the conclusion, and what\naccording to a considerable number of philosophers may also warrant\nthis conclusion, is precisely the fact that Tim and Harry’s\nbeing friends again would, if true, best explain the\nfact that they have just been seen jogging together. (The proviso that\na hypothesis be true if it is to explain anything is taken as read\nfrom here on.) Similar remarks apply to the other two examples. The\ntype of inference exhibited here is called abduction or,\nsomewhat more commonly nowadays, Inference to the Best\nExplanation.\n1.1 Deduction, induction, abduction\n\nAbduction is normally thought of as being one of three major types of\ninference, the other two being deduction and induction. The\ndistinction between deduction, on the one hand, and induction and\nabduction, on the other hand, corresponds to the distinction between\nnecessary and non-necessary inferences. In deductive inferences, what\nis inferred is necessarily true if the premises from which it\nis inferred are true; that is, the truth of the premises\nguarantees the truth of the conclusion. A familiar type of\nexample is inferences instantiating the schema\n\nAll As are Bs.\n\na is an A.\n\nHence, a is a B.\n\n\nBut not all inferences are of this variety. Consider, for instance,\nthe inference of “John is rich” from “John lives in\nChelsea” and “Most people living in Chelsea are\nrich.” Here, the truth of the first sentence is not guaranteed\n(but only made likely) by the joint truth of the second and third\nsentences. Differently put, it is not necessarily the case that if the\npremises are true, then so is the conclusion: it is logically\ncompatible with the truth of the premises that John is a member of the\nminority of non-rich inhabitants of Chelsea. The case is similar\nregarding your inference to the conclusion that Tim and Harry are\nfriends again on the basis of the information that they have been seen\njogging together. Perhaps Tim and Harry are former business partners\nwho still had some financial matters to discuss, however much they\nwould have liked to avoid this, and decided to combine this with their\ndaily exercise; this is compatible with their being firmly decided\nnever to make up.\n\nIt is standard practice to group non-necessary inferences into\ninductive and abductive ones. Inductive inferences\nform a somewhat heterogeneous class, but for present purposes they may\nbe characterized as those inferences that are based purely on\nstatistical data, such as observed frequencies of occurrences of a\nparticular feature in a given population. An example of such an\ninference would be this:\n\n96 per cent of the Flemish college students speak both Dutch and\nFrench.\n\nLouise is a Flemish college student.\n\nHence, Louise speaks both Dutch and French.\n\n\nHowever, the relevant statistical information may also be more vaguely\ngiven, as in the premise, “Most people living in Chelsea are\nrich.” (There is much discussion about whether the conclusion of\nan inductive argument can be stated in purely qualitative terms or\nwhether it should be a quantitative one—for instance, that it\nholds with a probability of .96 that Louise speaks both Dutch and\nFrench—or whether it can sometimes be stated in\nqualitative terms—for instance, if the probability that it is\ntrue is high enough—and sometimes not. On these and other issues\nrelated to induction, see Kyburg 1990 (Ch. 4). It should also be\nmentioned that Harman (1965) conceives induction as a special type of\nabduction. See also Weintraub 2013 for discussion.)\n\nThe mere fact that an inference is based on statistical data is not\nenough to classify it as an inductive one. You may have observed many\ngray elephants and no non-gray ones, and infer from this that all\nelephants are gray, because that would provide the best\nexplanation for why you have observed so many gray elephants\nand no non-gray ones. This would be an instance of an\nabductive inference. It suggests that the best way to distinguish\nbetween induction and abduction is this: both are ampliative,\nmeaning that the conclusion goes beyond what is (logically) contained\nin the premises (which is why they are non-necessary inferences), but\nin abduction there is an implicit or explicit appeal to explanatory\nconsiderations, whereas in induction there is not; in induction, there\nis only an appeal to observed frequencies or statistics. (I\nemphasize “only,” because in abduction there may also be\nan appeal to frequencies or statistics, as the example about the\nelephants exhibits.)\n\nA noteworthy feature of abduction, which it shares with induction but\nnot with deduction, is that it violates monotonicity, meaning\nthat it may be possible to infer abductively certain conclusions from\na subset of a set S of premises which cannot be\ninferred abductively from S as a whole. For instance, adding\nthe premise that Tim and Harry are former business partners who still\nhave some financial matters to discuss, to the premises that they had\na terrible row some time ago and that they were just seen jogging\ntogether may no longer warrant you to infer that they are friends\nagain, even if—let us suppose—the last two premises alone\ndo warrant that inference. The reason is that what counts as the best\nexplanation of Tim and Harry’s jogging together in light of the\noriginal premises may no longer do so once the information has been\nadded that they are former business partners with financial matters to\ndiscuss.\n1.2 The ubiquity of abduction\n\nThe type of inference exemplified in the cases described at the\nbeginning of this entry will strike most as entirely familiar.\nPhilosophers as well as psychologists tend to agree that abduction is\nfrequently employed in everyday reasoning. Sometimes our reliance on\nabductive reasoning is quite obvious and explicit. But in some daily\npractices, it may be so routine and automatic that it easily goes\nunnoticed. A case in point may be our trust in other people’s\ntestimony, which has been said to rest on abductive reasoning; see\nHarman 1965, Adler 1994, Fricker 1994, and Lipton 1998 for defenses of\nthis claim. For instance, according to Jonathan Adler (1994, 274f),\n“[t]he best explanation for why the informant asserts that\nP is normally that … he believes it for duly responsible\nreasons and … he intends that I shall believe it too,”\nwhich is why we are normally justified in trusting the\ninformant’s testimony. This may well be correct, even though in\ncoming to trust a person’s testimony one does not normally seem\nto be aware of any abductive reasoning going on in one’s mind.\nSimilar remarks may apply to what some hold to be a further, possibly\neven more fundamental, role of abduction in linguistic practice, to\nwit, its role in determining what a speaker means by an utterance.\nSpecifically, it has been argued that decoding utterances is a matter\nof inferring the best explanation of why someone said what he or she\nsaid in the context in which the utterance was made. Even more\nspecifically, authors working in the field of pragmatics have\nsuggested that hearers invoke the Gricean maxims of conversation to\nhelp them work out the best explanation of a speaker’s utterance\nwhenever the semantic content of the utterance is insufficiently\ninformative for the purposes of the conversation, or is too\ninformative, or off-topic, or implausible, or otherwise odd or\ninappropriate; see, for instance, Bach and Harnish 1979 (92f), Dascal\n1979 (167), and Hobbs 2004. As in cases of reliance on speaker\ntestimony, the requisite abductive reasoning would normally seem to\ntake place at a subconscious level.\n\nAbductive reasoning is not limited to everyday contexts. Quite the\ncontrary: philosophers of science have argued that abduction is a\ncornerstone of scientific methodology; see, for instance, Boyd 1981,\n1984, Harré 1986, 1988, Lipton 1991, 2004, and Psillos 1999.\nAccording to Timothy Williamson (2007), “[t]he abductive\nmethodology is the best science provides” and Ernan McMullin\n(1992) even goes so far to call abduction “the inference that\nmakes science.” To illustrate the use of abduction in science,\nwe consider two examples.\n\nAt the beginning of the nineteenth century, it was discovered that the\norbit of Uranus, one of the seven planets known at the time, departed\nfrom the orbit as predicted on the basis of Isaac Newton’s\ntheory of universal gravitation and the auxiliary assumption that\nthere were no further planets in the solar system. One possible\nexplanation was, of course, that Newton’s theory is false. Given\nits great empirical successes for (then) more than two centuries, that\ndid not appear to be a very good explanation. Two astronomers, John\nCouch Adams and Urbain Leverrier, instead suggested (independently of\neach other but almost simultaneously) that there was an eighth, as yet\nundiscovered planet in the solar system; that, they thought, provided\nthe best explanation of Uranus’ deviating orbit. Not much later,\nthis planet, which is now known as “Neptune,” was\ndiscovered.\n\nThe second example concerns what is now commonly regarded to have been\nthe discovery of the electron by the English physicist Joseph John\nThomson. Thomson had conducted experiments on cathode rays in order to\ndetermine whether they are streams of charged particles. He concluded\nthat they are indeed, reasoning as follows:\n\n\nAs the cathode rays carry a charge of negative electricity, are\ndeflected by an electrostatic force as if they were negatively\nelectrified, and are acted on by a magnetic force in just the way in\nwhich this force would act on a negatively electrified body moving\nalong the path of these rays, I can see no escape from the conclusion\nthat they are charges of negative electricity carried by particles of\nmatter. (Thomson, cited in Achinstein 2001, 17)\n\n\nThe conclusion that cathode rays consist of negatively charged\nparticles does not follow logically from the reported experimental\nresults, nor could Thomson draw on any relevant statistical data. That\nnevertheless he could “see no escape from the conclusion”\nis, we may safely assume, because the conclusion is the best—in\nthis case presumably even the only plausible—explanation of his\nresults that he could think of.\n\nMany other examples of scientific uses of abduction have been\ndiscussed in the literature; see, for instance, Harré 1986,\n1988 and Lipton 1991, 2004. Abduction is also said to be the\npredominant mode of reasoning in medical diagnosis: physicians tend to\ngo for the hypothesis that best explains the patient’s symptoms\n(see Josephson and Josephson (eds.) 1994, 9–12; see also\nDragulinescu 2016 on abductive reasoning in the context of\nmedicine).\n\nLast but not least, abduction plays a central role in some important\nphilosophical debates. See Shalkowski 2010 on the place of abduction\nin metaphysics (also Bigelow 2010), Krzyżanowska, Wenmackers, and\nDouven 2014 and Douven 2016a for a possible role of\nabduction in the semantics of conditionals, and Williamson\n2017 for an application of abduction in the philosophy of logic.\nArguably, however, abduction plays its most notable philosophical role\nin epistemology and in the philosophy of science, where it is\nfrequently invoked in objections to so-called underdetermination\narguments. Underdetermination arguments generally start from the\npremise that a number of given hypotheses are empirically equivalent,\nwhich their authors take to mean that the evidence—indeed, any\nevidence we might ever come to possess—is unable to favor one of\nthem over the others. From this, we are supposed to conclude that one\ncan never be warranted in believing any particular one of the\nhypotheses. (This is rough, but it will do for present purposes; see\nDouven 2008 and Stanford 2009, for more detailed accounts of\nunderdetermination arguments.) A famous instance of this type of\nargument is the Cartesian argument for global skepticism, according to\nwhich the hypothesis that reality is more or less the way we\ncustomarily deem it to be is empirically equivalent to a variety of\nso-called skeptical hypotheses (such as that we are beguiled by an\nevil demon, or that we are brains in a vat, connected to a\nsupercomputer; see, e.g., Folina 2016). Similar arguments have been\ngiven in support of scientific antirealism, according to which it will\nnever be warranted for us to choose between empirically equivalent\nrivals concerning what underlies the observable part of reality (van\nFraassen 1980).\n\nResponses to these arguments typically point to the fact that the\nnotion of empirical equivalence at play unduly neglects explanatory\nconsiderations, for instance, by defining the notion strictly in terms\nof hypotheses’ making the same predictions. Those responding\nthen argue that even if some hypotheses make exactly the same\npredictions, one of them may still be a better explanation of the\nphenomena predicted. Thus, if explanatory considerations have a role\nin determining which inferences we are licensed to make—as\naccording to defenders of abduction they have—then we might\nstill be warranted in believing in the truth (or probable truth, or\nsome such, depending—as will be seen below—on the version\nof abduction one assumes) of one of a number of hypotheses that all\nmake the same predictions. Following Bertrand Russell (1912, Ch. 2),\nmany epistemologists have invoked abduction in arguing against\nCartesian skepticism, their key claim being that even though, by\nconstruction, the skeptical hypotheses make the same predictions as\nthe hypothesis that reality is more or less the way we ordinarily take\nit to be, they are not equally good explanations of what they predict;\nin particular, the skeptical hypotheses have been said to be\nconsiderably less simple than the “ordinary world”\nhypothesis. See, among many others, Harman 1973 (Chs. 8 and 11),\nGoldman 1988 (205), Moser 1989 (161), and Vogel 1990, 2005; see\nPargetter 1984 for an abductive response specifically to skepticism\nregarding other minds. Similarly, philosophers of science have argued\nthat we are warranted to believe in Special Relativity Theory as\nopposed to Lorentz’s version of the æther theory. For even\nthough these theories make the same predictions, the former is\nexplanatorily superior to the latter. (Most arguments that have been\ngiven for this claim come down to the contention that Special\nRelativity Theory is ontologically more parsimonious than its\ncompetitor, which postulates the existence of an æther. See\nJanssen 2002 for an excellent discussion of the various reasons\nphilosophers of science have adduced for preferring Einstein’s\ntheory to Lorentz’s.)\n2. Explicating Abduction\n\nPrecise statements of what abduction amounts to are rare in the\nliterature on abduction. (Peirce did propose an at least fairly\nprecise statement; but, as explained in the supplement to this entry,\nit does not capture what most nowadays understand by abduction.) Its\ncore idea is often said to be that explanatory considerations have\nconfirmation-theoretic import, or that explanatory success is a (not\nnecessarily unfailing) mark of truth. Clearly, however, these\nformulations are slogans at best, and it takes little effort to see\nthat they can be cashed out in a great variety of prima facie\nplausible ways. Here we will consider a number of such possible\nexplications, starting with what one might term the “textbook\nversion of abduction,” which, as will be seen, is manifestly\ndefective, and then going on to consider various possible refinements\nof it. What those versions have in\ncommon—unsurprisingly—is that they are all inference\nrules, requiring premises encompassing explanatory considerations and\nyielding a conclusion that makes some statement about the truth of a\nhypothesis. The differences concern the premises that are required, or\nwhat exactly we are allowed to infer from them (or both).\n\nIn textbooks on epistemology or the philosophy of science, one often\nencounters something like the following as a formulation of\nabduction:\n\nABD1\nGiven evidence E and candidate explanations\nH1,…, Hn of\nE, infer the truth of that Hi\nwhich best explains E.\n\n\nAn observation that is frequently made about this rule, and that\npoints to a potential problem for it, is that it presupposes the\nnotions of candidate explanation and best explanation, neither of\nwhich has a straightforward interpretation. While some still hope that\nthe former can be spelled out in purely logical, or at least purely\nformal, terms, it is often said that the latter must appeal to the\nso-called theoretical virtues, like simplicity, generality, and\ncoherence with well-established theories; the best explanation would\nthen be the hypothesis which, on balance, does best with respect to\nthese virtues. (See, for instance, Thagard 1978 and McMullin 1996.)\nThe problem is that none of the said virtues is presently particularly\nwell understood. (Giere, in Callebaut (ed.) 1993 (232), even makes the\nradical claim that the theoretical virtues lack real content and play\nno more than a rhetorical role in science. In view of recent formal\nwork both on simplicity and on coherence—for instance, Forster\nand Sober 1994, Li and Vitanyi 1997, and Sober 2015, on simplicity and\nBovens and Hartmann 2003 and Olsson 2005, on coherence—the first\npart of this claim has become hard to maintain; also, Schupbach and\nSprenger (2011) present an account of explanatory goodness directly in\nprobabilistic terms. Psychological evidence casts doubt on the second\npart of the claim; see, for instance, Lombrozo 2007, on the role of\nsimplicity in people’s assessments of explanatory goodness and\nKoslowski et al. 2008, on the role of coherence with\nbackground knowledge in those assessments.)\n\nFurthermore, many of those who think ABD1 is headed along the right\nlines believe that it is too strong. Some think that abduction\nwarrants an inference only to the probable truth of the best\nexplanation, others that it warrants an inference only to the\napproximate truth of the best explanation, and still others\nthat it warrants an inference only to the probable\napproximate truth.\n\nThe real problem with ABD1 runs deeper than this, however. Because\nabduction is ampliative—as explained earlier—it will not\nbe a sound rule of inference in the strict logical sense, however\nabduction is explicated exactly. It can still be reliable in\nthat it mostly leads to a true conclusion whenever the premises are\ntrue. An obvious necessary condition for ABD1 to be reliable in this\nsense is that, mostly, when it is true that H best\nexplains E, and E is true, then H is true as well\n(or H is approximately true, or probably true, or probably\napproximately true). But this would not be enough for ABD1 to\nbe reliable. For ABD1 takes as its premise only that some hypothesis\nis the best explanation of the evidence as compared to other\nhypotheses in a given set. Thus, if the rule is to be\nreliable, it must hold that, at least typically, the best explanation\nrelative to the set of hypotheses that we consider would also come out\nas being best in comparison with any other hypotheses that we might\nhave conceived (but for lack of time or ingenuity, or for some other\nreason, did not conceive). In other words, it must hold that at least\ntypically the absolutely best explanation of the evidence is\nto be found among the candidate explanations we have come up with, for\nelse ABD1 may well lead us to believe “the best of a bad\nlot” (van Fraassen 1989, 143).\n\nHow reasonable is it to suppose that this extra requirement is usually\nfulfilled? Not at all, presumably. To believe otherwise, we must\nassume some sort of privilege on our part to the effect that when we\nconsider possible explanations of the data, we are somehow predisposed\nto hit, inter alia, upon the absolutely best explanation of those\ndata. After all, hardly ever will we have considered, or will it even\nbe possible to consider, all potential explanations. As van\nFraassen (1989, 144) points out, it is a priori rather\nimplausible to hold that we are thus privileged.\n\nIn response to this, one might argue that the challenge to show that\nthe best explanation is always or mostly among the hypotheses\nconsidered can be met without having to assume some form of privilege\n(see Schupbach 2014 for a different response, and see Dellsén\n2017 for discussion). For given the hypotheses we have managed to come\nup with, we can always generate a set of hypotheses which jointly\nexhaust logical space. Suppose\nH1,…,Hn are the\ncandidate explanations we have so far been able to conceive. Then\nsimply define Hn+1 := ¬H1\n∧ … ∧ ¬Hn and add this new\nhypothesis as a further candidate explanation to the ones we already\nhave. Obviously, the set\n{H1,…,Hn+1} is exhaustive,\nin that one of its elements must be true. Following this in itself\nsimple procedure would seem enough to make sure that we never miss out\non the absolutely best explanation. (See Lipton 1993, for a proposal\nalong these lines.)\n\nAlas, there is a catch. For even though there may be many hypotheses\nHj that imply Hn+1 and, had\nthey been formulated, would have been evaluated as being a better\nexplanation for the data than the best explanation among the candidate\nexplanations we started out with, Hn+1 itself will\nin general be hardly informative; in fact, in general it will not even\nbe clear what its empirical consequences are. Suppose, for instance,\nwe have as competing explanations Special Relativity Theory and\nLorentz’s version of the æther theory. Then, following the\nabove proposal, we may add to our candidate explanations that neither\nof these two theories is true. But surely this further hypothesis will\nbe ranked quite low qua explanation—if it will be\nranked at all, which seems doubtful, given that it is wholly unclear\nwhat its empirical consequences are. This is not to say that the\nsuggested procedure may never work. The point is that in general it\nwill give little assurance that the best explanation is among the\ncandidate explanations we consider.\n\nA more promising response to the above “argument of the bad\nlot” begins with the observation that the argument capitalizes\non a peculiar asymmetry or incongruence in ABD1. The rule gives\nlicense to an absolute conclusion—that a given hypothesis is\ntrue—on the basis of a comparative premise, namely, that that\nparticular hypothesis is the best explanation of the evidence relative\nto the other hypotheses available (see Kuipers 2000, 171). This\nincongruence is not avoided by replacing “truth” with\n“probable truth” or “approximate truth.” In\norder to avoid it, one has two general options.\n\nThe first option is to modify the rule so as to have it require an\nabsolute premise. For instance, following Alan Musgrave (1988) or\nPeter Lipton (1993), one may require the hypothesis whose truth is\ninferred to be not only the best of the available potential\nexplanations, but also to be satisfactory (Musgrave) or\ngood enough (Lipton), yielding the following variant of\nABD1:\n\nABD2\nGiven evidence E and candidate explanations\nH1,…, Hn of\nE, infer the truth of that Hi\nwhich explains E best, provided Hi is\nsatisfactory/good enough qua explanation.\n\n\nNeedless to say, ABD2 needs supplementing by a criterion for the\nsatisfactoriness of explanations, or their being good enough, which,\nhowever, we are still lacking.\n\nSecondly, one can formulate a symmetric or congruous version of\nabduction by having it sanction, given a comparative premise, only a\ncomparative conclusion; this option, too, can in turn be realized in\nmore than one way. Here is one way to do it, which has been proposed\nand defended in the work of Theo Kuipers (e.g., Kuipers 1984, 1992,\n2000).\n\nABD3\nGiven evidence E and candidate explanations\nH1,…, Hn of\nE, if Hi explains E better than\nany of the other hypotheses, infer that Hi is\ncloser to the truth than any of the other hypotheses.\n\n\nClearly, ABD3 requires an account of closeness to the truth, but many\nsuch accounts are on offer today (see, e.g., Niiniluoto 1998).\n\nOne noteworthy feature of the congruous versions of abduction\nconsidered here is that they do not rely on the assumption of an\nimplausible privilege on the reasoner’s part that, we saw, ABD1\nimplicitly relies on. Another is that if one can be certain that,\nhowever many candidate explanations for the data one may have missed,\nnone equals the best of those one has thought of, then the\ncongruous versions license exactly the same inference as ABD1 does\n(supposing that one would not be certain that no potential explanation\nis as good as the best explanation one has thought of if the latter is\nnot even satisfactory or sufficiently good).\n\nAs mentioned, there is widespread agreement that people frequently\nrely on abductive reasoning. Which of the above rules exactly\nis it that people rely on? Or might it be still some further rule that\nthey rely on? Or might they in some contexts rely on one version, and\nin others on another (Douven 2017, forthcoming)? Philosophical\nargumentation is unable to answer these questions. In recent years,\nexperimental psychologists have started paying attention to the role\nhumans give to explanatory considerations in reasoning. For instance,\nTania Lombrozo and Nicholas Gwynne (2014) report experiments showing\nthat how a property of a given class of things is explained\nto us—whether mechanistically, by reference to parts and\nprocesses, or functionally, by reference to functions and\npurposes—matters to how likely we are to generalise that\nproperty to other classes of things (see also Sloman 1994 and Williams\nand Lombrozo 2010). And Igor Douven and Jonah Schupbach (2015a),\n(2015b) present experimental evidence to the effect that\npeople’s probability updates tend to be influenced by\nexplanatory considerations in ways that makes them deviate from\nstrictly Bayesian updates (see below). Douven (2016b) shows that, in\nthe aforementioned experiments, participants who gave more weight to\nexplanatory considerations tended to be more accurate, as determined\nin terms of a standard scoring rule. (See Lombrozo 2012 and 2016 for\nuseful overviews of recent experimental work relevant to explanation\nand inference.) Douven and Patricia Mirabile (2018) found some\nevidence indicating that people rely on something like ABD2, at least\nin some contexts, but for the most part, empirical work on the\nabove-mentioned questions is lacking.\n\nWith respect to the normative question of which of the previously\nstated rules we ought to rely on (if we ought to rely on any\nform of abduction), where philosophical argumentation should be able\nto help, the situation is hardly any better. In view of the argument\nof the bad lot, ABD1 does not look very good. Other arguments against\nabduction are claimed to be independent of the exact explication of\nthe rule; below, these arguments will be found wanting. On the other\nhand, arguments that have been given in favor of abduction—some\nof which will also be discussed below—do not discern between\nspecific versions. So, supposing people do indeed commonly rely on\nabduction, it must be considered an open question as to which\nversion(s) of abduction they rely on. Equally, supposing it is\nrational for people to rely on abduction, it must be considered an\nopen question as to which version, or perhaps versions, of abduction\nthey ought to, or are at least permitted to, rely on.\n3. The Status of Abduction\n\nEven if it is true that we routinely rely on abductive reasoning, it\nmay still be asked whether this practice is rational. For instance,\nexperimental studies have shown that when people are able to think of\nan explanation for some possible event, they tend to overestimate the\nlikelihood that this event will actually occur. (See Koehler 1991, for\na survey of some of these studies; see also Brem and Rips 2000.) More\ntelling still, Lombrozo (2007) shows that, in some situations, people\ntend to grossly overrate the probability of simpler explanations\ncompared to more complicated ones. Although these studies are not\ndirectly concerned with abduction in any of the forms discussed so\nfar, they nevertheless suggest that taking into account explanatory\nconsiderations in one’s reasoning may not always be for the\nbetter. (It is to be noted that Lombrozo’s experiments\nare directly concerned with some proposals that have been\nmade for explicating abduction in a Bayesian framework; see Section\n4.) However, the most pertinent remarks about the normative status of\nabduction are so far to be found in the philosophical literature. This\nsection discusses the main criticisms that have been levelled against\nabduction, as well as the strongest arguments that have been given in\nits defense.\n3.1 Criticisms\n\nWe have already encountered the so-called argument of the bad lot,\nwhich, we saw, is valid as a criticism of ABD1 but powerless against\nvarious (what we called) congruous rules of abduction. We here\nconsider two objections that are meant to be more general. The first\neven purports to challenge the core idea underlying abduction; the\nsecond is not quite as general, but it is still meant to undermine a\nbroad class of candidate explications of abduction. Both objections\nare due to Bas van Fraassen.\n\nThe first objection has as a premise that it is part of the meaning of\n“explanation” that if one theory is more explanatory than\nanother, the former must be more informative than the latter (see,\ne.g., van Fraassen 1983, Sect. 2). The alleged problem then is that it\nis “an elementary logical point that a more informative theory\ncannot be more likely to be true [and thus] attempts to describe\ninductive or evidential support through features that require\ninformation (such as ‘Inference to the Best Explanation’)\nmust either contradict themselves or equivocate” (van Fraassen\n1989, 192). The elementary logical point is supposed to be “most\n[obvious] … in the paradigm case in which one theory is an\nextension of another: clearly the extension has more ways of being\nfalse” (van Fraassen 1985, 280).\n\nIt is important to note, however, that in any other kind of case than\nthe “paradigm” one, the putative elementary point is not\nobvious at all. For instance, it is entirely unclear in what sense\nSpecial Relativity Theory “has more ways of being false”\nthan Lorentz’s version of the æther theory, given that\nthey make the same predictions. And yet the former is generally\nregarded as being superior, qua explanation, to the latter.\n(If van Fraassen were to object that the former is not really more\ninformative than the latter, or at any rate not more informative in\nthe appropriate sense—whatever that is—then we should\ncertainly refuse to grant the premise that in order to be more\nexplanatory a theory must be more informative.)\n\nThe second objection, proffered in van Fraassen 1989 (Ch. 6), is\nlevelled at probabilistic versions of abduction. The objection is that\nsuch rules must either amount to Bayes’ rule, and thus be\nredundant, or be at variance with it but then, on the grounds of\nLewis’ dynamic Dutch book argument (as reported in Teller 1973),\nbe probabilistically incoherent, meaning that they may lead one to\nassess as fair a number of bets which together ensure a financial\nloss, come what may; and, van Fraassen argues, it would be irrational\nto follow a rule that has this feature.\n\nHowever, this objection fares no better than the first. For one thing,\nas Patrick Maher (1992) and Brian Skyrms (1993) have pointed out, a\nloss in one respect may be outweighed by a benefit in another. It\nmight be, for instance, that some probabilistic version of abduction\ndoes much better, at least in our world, than Bayes’ rule, in\nthat, on average, it approaches the truth faster in the sense that it\nis faster in assigning a high probability (understood as probability\nabove a certain threshold value) to the true hypothesis (see Douven\n2013, 2020, and Douven and Wenmackers 2017; see Climenhaga\n2017 for discussion). If it does, then following that rule\ninstead of Bayes’ rule may have advantages which perhaps are not\nso readily expressed in terms of money yet which should arguably be\ntaken into account when deciding which rule to go by. It is, in short,\nnot so clear whether following a probabilistically incoherent rule\nmust be irrational.\n\nFor another thing, Douven (1999) argues that the question of whether a\nprobabilistic rule is coherent is not one that can be settled\nindependently of considering which other epistemic and\ndecision-theoretic rules are deployed along with it; coherence should\nbe understood as a property of packages of both epistemic and\ndecision-theoretic rules, not of epistemic rules (such as\nprobabilistic rules for belief change) in isolation. In the same\npaper, a coherent package of rules is described which includes a\nprobabilistic version of abduction. (See Kvanvig 1994, Harman 1997,\nLeplin 1997, Niiniluoto 1999, and Okasha 2000, for different responses\nto van Fraassen’s critique of probabilistic versions of\nabduction.)\n3.2 Defenses\n\nHardly anyone nowadays would want to subscribe to a conception of\ntruth that posits a necessary connection between explanatory force and\ntruth—for instance, because it stipulates explanatory\nsuperiority to be necessary for truth. As a result, a priori defenses\nof abduction seem out of the question. Indeed, all defenses that have\nbeen given so far are of an empirical nature in that they appeal to\ndata that supposedly support the claim that (in some form) abduction\nis a reliable rule of inference.\n\nThe best-known argument of this sort was developed by Richard Boyd in\nthe 1980s (see Boyd 1981, 1984, 1985). It starts by underlining the\ntheory-dependency of scientific methodology, which comprises methods\nfor designing experiments, for assessing data, for choosing between\nrival hypotheses, and so on. For instance, in considering possible\nconfounding factors from which an experimental setup has to be\nshielded, scientists draw heavily on already accepted theories. The\nargument next calls attention to the apparent reliability of this\nmethodology, which, after all, has yielded, and continues to yield,\nimpressively accurate theories. In particular, by relying on this\nmethodology, scientists have for some time now been able to find ever\nmore instrumentally adequate theories. Boyd then argues that the\nreliability of scientific methodology is best explained by assuming\nthat the theories on which it relies are at least approximately true.\nFrom this and from the fact that these theories were mostly arrived at\nby abductive reasoning, he concludes that abduction must be a reliable\nrule of inference.\n\nCritics have accused this argument of being circular. Specifically, it\nhas been said that the argument rests on a premise—that\nscientific methodology is informed by approximately true background\ntheories—which in turn rests on an inference to the best\nexplanation for its plausibility. And the reliability of this type of\ninference is precisely what is at stake. (See, for instance, Laudan\n1981 and Fine 1984.)\n\nTo this, Stathis Psillos (1999, Ch. 4) has responded by invoking a\ndistinction credited to Richard Braithwaite, to wit, the distinction\nbetween premise-circularity and rule-circularity. An argument is\npremise-circular if its conclusion is amongst its premises. A\nrule-circular argument, by contrast, is an argument of which the\nconclusion asserts something about an inferential rule that is used in\nthe very same argument. As Psillos urges, Boyd’s argument is\nrule-circular, but not premise-circular, and rule-circular arguments,\nPsillos contends, need not be viciously circular (even though\na premise-circular argument is always viciously circular). To be more\nprecise, in his view, an argument for the reliability of a given rule\nR that essentially relies on R as an inferential\nprinciple is not vicious, provided that the use of R does not\nguarantee a positive conclusion about R’s reliability.\nPsillos claims that in Boyd’s argument, this proviso is met. For\nwhile Boyd concludes that the background theories on which scientific\nmethodology relies are approximately true on the basis of an abductive\nstep, the use of abduction itself does not guarantee the truth of his\nconclusion. After all, granting the use of abduction does nothing to\nensure that the best explanation of the success of scientific\nmethodology is the approximate truth of the relevant background\ntheories. Thus, Psillos concludes, Boyd’s argument still\nstands.\n\nEven if the use of abduction in Boyd’s argument might have led\nto the conclusion that abduction is not reliable, one may\nstill have worries about the argument’s being rule-circular. For\nsuppose that some scientific community relied not on abduction but on\na rule that we may dub “Inference to the Worst\nExplanation” (IWE), a rule that sanctions inferring to the\nworst explanation of the available data. We may safely assume\nthat the use of this rule mostly would lead to the adoption of very\nunsuccessful theories. Nevertheless, the said community might justify\nits use of IWE by dint of the following reasoning: “Scientific\ntheories tend to be hugely unsuccessful. These theories were arrived\nat by application of IWE. That IWE is a reliable rule of\ninference—that is, a rule of inference mostly leading from true\npremises to true conclusions—is surely the worst explanation of\nthe fact that our theories are so unsuccessful. Hence, by application\nof IWE, we may conclude that IWE is a reliable rule of\ninference.” While this would be an utterly absurd conclusion,\nthe argument leading up to it cannot be convicted of being viciously\ncircular anymore than Boyd’s argument for the reliability of\nabduction can (if Psillos is right). It would appear, then, that there\nmust be something else amiss with rule-circularity.\n\nIt is fair to note that for Psillos, the fact that a rule-circular\nargument does not guarantee a positive conclusion about the rule at\nissue is not sufficient for such an argument to be valid. A further\nnecessary condition is “that one should not have reason to doubt\nthe reliability of the rule—that there is nothing currently\navailable which can make one distrust the rule” (Psillos 1999,\n85). And there is plenty of reason to doubt the reliability of IWE; in\nfact, the above argument supposes that it is unreliable. Two\nquestions arise, however. First, why should we accept the additional\ncondition? Second, do we really have no reason to doubt the\nreliability of abduction? Certainly some of the abductive\ninferences we make lead us to accept falsehoods. How many\nfalsehoods may we accept on the basis of abduction before we can\nlegitimately begin to distrust this rule? No clear answers have been\ngiven to these questions.\n\nBe this as it may, even if rule-circularity is neither vicious nor\notherwise problematic, one may still wonder how Boyd’s argument\nis to convert a critic of abduction, given that it relies on\nabduction. But Psillos makes it clear that the point of philosophical\nargumentation is not always, and in any case need not be, to convince\nan opponent of one’s position. Sometimes the point is, more\nmodestly, to assure or reassure oneself that the position one\nendorses, or is tempted to endorse, is correct. In the case at hand,\nwe need not think of Boyd’s argument as an attempt to convince\nthe opponent of abduction of its reliability. Rather, it may be\nthought of as justifying the rule from within the perspective of\nsomeone who is already sympathetic towards abduction; see Psillos 1999\n(89).\n\nThere have also been attempts to argue for abduction in a more\nstraightforward fashion, to wit, via enumerative induction. The common\nidea of these attempts is that every newly recorded successful\napplication of abduction—like the discovery of Neptune, whose\nexistence had been postulated on explanatory grounds (see Section\n1.2)—adds further support to the hypothesis that abduction is a\nreliable rule of inference, in the way in which every newly observed\nblack raven adds some support to the hypothesis that all ravens are\nblack. Because it does not involve abductive reasoning, this type of\nargument is more likely to also appeal to disbelievers in abduction.\nSee Harré 1986, 1988, Bird 1998 (160), Kitcher 2001, and Douven\n2002 for suggestions along these lines.\n4. Abduction versus Bayesian Confirmation Theory\n\nIn the past decade, Bayesian confirmation theory has firmly\nestablished itself as the dominant view on confirmation; currently one\ncannot very well discuss a confirmation-theoretic issue without making\nclear whether, and if so why, one’s position on that issue\ndeviates from standard Bayesian thinking. Abduction, in whichever\nversion, assigns a confirmation-theoretic role to explanation:\nexplanatory considerations contribute to making some hypotheses more\ncredible, and others less so. By contrast, Bayesian confirmation\ntheory makes no reference at all to the concept of explanation. Does\nthis imply that abduction is at loggerheads with the prevailing\ndoctrine in confirmation theory? Several authors have recently argued\nthat not only is abduction compatible with Bayesianism, it is a\nmuch-needed supplement to it. The so far fullest defense of this view\nhas been given by Lipton (2004, Ch. 7); as he puts it, Bayesians\nshould also be “explanationists” (his name for the\nadvocates of abduction). (For other defenses, see Okasha 2000, McGrew\n2003, Weisberg 2009, and Poston 2014, Ch. 7; for discussion, see Roche\nand Sober 2013, 2014, and McCain and Poston 2014.)\n\nThis requires some clarification. For what could it mean for a\nBayesian to be an explanationist? In order to apply Bayes’ rule\nand determine the probability for H after learning E,\nthe Bayesian agent will have to determine the probability of H\nconditional on E. For that, he needs to assign unconditional\nprobabilities to H and E as well as a probability to\nE given H; the former two are mostly called “prior\nprobabilities” (or just “priors”) of, respectively,\nH and E, the latter the “likelihood” of\nH on E. (This is the official Bayesian story. Not all of\nthose who sympathize with Bayesianism adhere to that story. For\ninstance, according to some it is more reasonable to think that\nconditional probabilities are basic and that we derive unconditional\nprobabilities from them; see Hájek 2003, and references\ntherein.) How is the Bayesian to determine these values? As is well\nknown, probability theory gives us more probabilities once we have\nsome; it does not give us probabilities from scratch. Of course, when\nH implies E or the negation of E, or when\nH is a statistical hypothesis that bestows a certain chance on\nE, then the likelihood follows “analytically.”\n(This claim assumes some version of Lewis’ (1980) Principal\nPrinciple, and it is controversial whether or not this principle is\nanalytic; hence the scare quotes.) But this is not always the case,\nand even if it were, there would still be the question of how to\ndetermine the priors. This is where, according to Lipton, abduction\ncomes in. In his proposal, Bayesians ought to determine their prior\nprobabilities and, if applicable, likelihoods on the basis of\nexplanatory considerations.\n\nExactly how are explanatory considerations to guide one’s choice\nof priors? The answer to this question is not as simple as one might\nat first think. Suppose you are considering what priors to assign to a\ncollection of rival hypotheses and you wish to follow Lipton’s\nsuggestion. How are you to do this? An obvious—though still\nsomewhat vague—answer may seem to go like this: Whatever exact\npriors you are going to assign, you should assign a higher one to the\nhypothesis that explains the available data best than to any of its\nrivals (provided there is a best explanation). Note, though, that your\nneighbor, who is a Bayesian but thinks confirmation has nothing to do\nwith explanation, may well assign a prior to the best explanation that\nis even higher than the one you assign to that hypothesis. In fact,\nhis priors for best explanations may even be consistently higher than\nyours, not because in his view explanation is somehow related to\nconfirmation—it is not, he thinks—but, well, just because.\nIn this context, “just because” is a perfectly legitimate\nreason, because any reason for fixing one’s priors counts as\nlegitimate by Bayesian standards. According to mainstream Bayesian\nepistemology, priors (and sometimes likelihoods) are up for grabs,\nmeaning that one assignment of priors is as good as another, provided\nboth are coherent (that is, they obey the axioms of probability\ntheory). Lipton’s recommendation to the Bayesian to be an\nexplanationist is meant to be entirely general. But what should your\nneighbor do differently if he wants to follow the recommendation?\nShould he give the same prior to any best explanation that you, his\nexplanationist neighbor, give to it, that is, lower his\npriors for best explanations? Or rather should he give even\nhigher priors to best explanations than those he already\ngives?\n\nPerhaps Lipton’s proposal is not intended to address those who\nalready assign highest priors to best explanations, even if they do so\non grounds that have nothing to do with explanation. The idea might be\nthat, as long as one does assign highest priors to those hypotheses,\neverything is fine, or at least finer than if one does not do so,\nregardless of one’s reasons for assigning those priors. The\nanswer to the question of how explanatory considerations are to guide\none’s choice of priors would then presumably be that one ought\nto assign a higher prior to the best explanation than to its rivals,\nif this is not what one already does. If it is, one should just keep\ndoing what one is doing.\n\n(As an aside, it should be noticed that, according to standard\nBayesian usage, the term “priors” does not necessarily\nrefer to the degrees of belief a person assigns before the receipt of\nany data. If there are already data in, then, clearly, one\nmay assign higher priors to hypotheses that best explain the\nthen-available data. However, one can sensibly speak of “best\nexplanations” even before any data are known. For example, one\nhypothesis may be judged to be a better explanation than any of its\nrivals because the former requires less complicated mathematics, or\nbecause it is stated in terms of familiar concepts only, which is not\ntrue of the others. More generally, such judgments may be based on\nwhat Kosso (1992, 30) calls internal features of hypotheses\nor theories, that is, features that “can be evaluated without\nhaving to observe the world.”)\n\nA more interesting answer to the above question of how explanation is\nto guide one’s choice of priors has been given by Jonathan\nWeisberg (2009). We said that mainstream Bayesians regard one\nassignment of prior probabilities as being as good as any other.\nSo-called objective Bayesians do not do so, however. These Bayesians\nthink priors must obey principles beyond the probability axioms in\norder to be admissible. Objective Bayesians are divided among\nthemselves over exactly which further principles are to be obeyed, but\nat least for a while they agreed that the Principle of Indifference is\namong them. Roughly stated, this principle counsels that, absent a\nreason to the contrary, we give equal priors to competing hypotheses.\nAs is well known, however, in its original form the Principle of\nIndifference may lead to inconsistent assignments of probabilities and\nso can hardly be advertised as a principle of rationality. The problem\nis that there are typically various ways to partition logical space\nthat appear plausible given the problem at hand, and that not all of\nthem lead to the same prior probability assignment, even assuming the\nPrinciple of Indifference. Weisberg’s proposal amounts to the\nclaim that explanatory considerations may favor some of those\npartitions over others. Perhaps we will not always end up with a\nunique partition to which the Principle of Indifference is to be\napplied, but it would already be progress if we ended up with only a\nhandful of partitions. For we could then still arrive in a motivated\nway at our prior probabilities, by proceeding in two steps, namely, by\nfirst applying the Principle of Indifference to the partitions\nseparately, thereby possibly obtaining different assignments of\npriors, and by then taking a weighted average of the thus obtained\npriors, where the weights, too, are to depend on explanatory\nconsiderations. The result would again be a probability\nfunction—the uniquely correct prior probability function,\naccording to Weisberg.\n\nThe proposal is intriguing as far as it goes but, as Weisberg admits,\nin its current form, it does not go very far. For one thing, it is\nunclear how exactly explanatory considerations are to determine the\nweights required for the second step of the proposal. For another, it\nmay be idle to hope that taking explanatory considerations into\naccount will in general leave us with a manageable set of partitions,\nor that, even if it does, this will not be due merely to the fact that\nwe are overlooking a great many prima facie plausible ways of\npartitioning logical space to begin with. (The latter point echoes the\nargument of the bad lot, of course.)\n\nAnother suggestion about the connection between abduction and Bayesian\nreasoning—to be found in Okasha 2000, McGrew 2003, Lipton 2004\n(Ch. 7), and Dellsén 2018—is that the explanatory\nconsiderations may serve as a heuristic to determine, even if only\nroughly, priors and likelihoods in cases in which we would otherwise\nbe clueless and could do no better than guessing. This suggestion is\nsensitive to the well-recognized fact that we are not always able to\nassign a prior to every hypothesis of interest, or to say how probable\na given piece of evidence is conditional on a given hypothesis.\nConsideration of that hypothesis’ explanatory power might then\nhelp us to figure out, if perhaps only within certain bounds, what\nprior to assign to it, or what likelihood to assign to it on the given\nevidence.\n\nBayesians, especially the more modest ones, might want to retort that\nthe Bayesian procedure is to be followed if, and only if, either (a)\npriors and likelihoods can be determined with some precision and\nobjectivity, or (b) likelihoods can be determined with some precision\nand priors can be expected to “wash out” as more and more\nevidence accumulates, or (c) priors and likelihoods can both be\nexpected to wash out. In the remaining cases—they might\nsay—we should simply refrain from applying Bayesian reasoning. A\nfortiori, then, there is no need for an abduction-enhanced Bayesianism\nin these cases. And some incontrovertible mathematical results\nindicate that, in the cases that fall under (a), (b), or (c), our\nprobabilities will converge to the truth anyhow. Consequently, in\nthose cases there is no need for the kind of abductive heuristics that\nthe above-mentioned authors suggest, either. (Weisberg 2009, Sect.\n3.2, raises similar concerns.)\n\nPsillos (2000) proposes yet another way in which abduction might\nsupplement Bayesian confirmation theory, one that is very much in the\nspirit of Peirce’s conception of abduction. The idea is that\nabduction may assist us in selecting plausible candidates for testing,\nwhere the actual testing then is to follow Bayesian lines. However,\nPsillos concedes (2004) that this proposal assigns a role to abduction\nthat will strike committed explanationists as being too limited.\n\nFinally, a possibility that has so far not been considered in the\nliterature is that abduction and Bayesianism do not so much work in\ntandem—as they do on the above proposals—as operate in\ndifferent modes of reasoning; the Bayesian and the explanationist are\ncharacters that feature in different plays, so to speak. It is widely\naccepted that sometimes we speak and think about our beliefs in a\ncategorical manner, while at other times we speak and think about them\nin a graded way. It is far from clear how these different ways of\nspeaking and thinking about beliefs—the epistemology of belief\nand the epistemology of degrees of belief, to use Richard\nFoley’s (1992) terminology—are related to one another. In\nfact, it is an open question whether there is any straightforward\nconnection between the two, or even whether there is a connection at\nall. Be that as it may, given that the distinction is undeniable, it\nis a plausible suggestion that, just as there are different ways of\ntalking and thinking about beliefs, there are different ways of\ntalking and thinking about the revision of beliefs. In\nparticular, abduction could well have its home in the epistemology of\nbelief, and be called upon whenever we reason about our beliefs in a\ncategorical mode, while at the same time Bayes’ rule could have\nits home in the epistemology of degrees of belief. Hard-nosed\nBayesians may insist that whatever reasoning goes on in the\ncategorical mode must eventually be justifiable in Bayesian terms, but\nthis presupposes the existence of bridge principles connecting the\nepistemology of belief with the epistemology of degrees of\nbelief—and, as mentioned, whether such principles exist is\npresently unclear.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Achinstein, P., 2001. <em>The Book of Evidence</em>, Oxford:\nOxford University Press.",
                "Adler, J., 1994. “Testimony, Trust, Knowing,”\n<em>Journal of Philosophy</em>, 91: 264–275.",
                "Bach, K. and Harnish, R., 1979. <em>Linguistic Communication and\nSpeech Acts</em>, Cambridge MA: MIT Press.",
                "Bird, A., 1998. <em>Philosophy of Science</em>, London: UCL\nPress.",
                "Bigelow, J., 2010. “Quine, Mereology, and Inference to the\nBest Explanation,” <em>Logique et Analyse</em>, 212:\n465–482.",
                "Bovens, L. and Hartmann, S., 2003. “Solving the Riddle of\nCoherence,” <em>Mind</em>, 112: 601–633.",
                "Boyd, R., 1981. “Scientific Realism and Naturalistic\nEpistemology,” in P. Asquith and R. Giere (eds.), <em>PSA\n1980</em>, (vol. II), East Lansing MI: Philosophy of Science\nAssociation, pp. 613–662.",
                "–––, 1984. “The Current Status of\nScientific Realism,” in J. Leplin (ed.), <em>Scientific\nRealism</em>, Berkeley CA: University of California Press, pp.\n41–82.",
                "–––, 1985. “Lex Orandi est Lex\nCredendi,” in P. Churchland and C. Hooker (eds.), <em>Images of\nScience</em>, Chicago IL: University of Chicago Press, pp.\n3–34.",
                "Brem, S. and Rips, L. J., 2000. “Explanation and Evidence in\nInformal Argument,” <em>Cognitive Science</em>, 24:\n573–604.",
                "Callebaut, W. (ed.), 1993. <em>Taking the Naturalistic Turn</em>,\nChicago IL: University of Chicago Press.",
                "Campos, D., 2011. “On the Distinction Between Peirce’s\nAbduction and Lipton’s Inference to the Best Explanation,”\n<em>Synthese</em>, 180: 419–442.",
                "Climenhaga, N., forthcoming. “Inference to the Best\nExplanation Made Incoherent,” <em>Journal of Philosophy</em>,\n <a href=\"http://philsci-archive.pitt.edu/12756/1/IBE%20Made%20Incoherent.pdf\" target=\"other\">preprint available online</a>.",
                "Dascal, M., 1979. “Conversational Relevance,” in A.\nMargalit (ed.), <em>Meaning and Use</em>, Dordrecht: Reidel, pp.\n153–174.",
                "Dellsén, F., 2017. “Reactionary Responses to the Bad\nLot Objection,” <em>Studies in History and Philosophy of\nScience</em>, 61: 32–40.",
                "–––, 2018. “The Heuristic Conception of\nInference to the Best Explanation,”\n<em>Philosophical Studies</em>, 175: 1745–1766. ",
                "Douven, I., 1999. “Inference to the Best Explanation Made\nCoherent,” <em>Philosophy</em>, <em>of Science</em>, 66:\nS424–S435.",
                "–––, 2002. “Testing Inference to the Best\nExplanation,” <em>Synthese</em>, 130: 355–377.",
                "–––, 2008. “Underdetermination,” in\nS. Psillos and M. Curd (eds.), <em>The Routledge Companion to the\nPhilosophy of Science</em>, London: Routledge, pp. 292–301.",
                "–––, 2013. “Inference to the Best\nExplanation, Dutch Books, and Inaccuracy Minimisation,”\n<em>Philosophical Quarterly</em>, 63: 428–444.",
                "–––, 2016a. <em>The Epistemology of Indicative\nConditionals</em>, Cambridge: Cambridge University Press.",
                "–––, 2016b. “Explanation, Updating, and\nAccuracy,” <em>Journal of Cognitive Psychology</em>, 28:\n1004–1012.",
                "–––, 2017. “What Is Inference to the Best\nExplanation? And Why Should We Care?” in T. Poston and K. McCain\n(eds.), <em>Best Explanations: New Essays on Inference to the Best\nExplanation</em>, Oxford: Oxford University Press, pp.\n4–22.",
                "–––, 2020. “The Ecological Rationality of\nExplanatory Reasoning,” <em>Studies in History and Philosophy of\nScience</em>, 79: 1–14.",
                "–––, forthcoming. <em>The Art of\nAbduction</em>, Cambridge MA: MIT Press.",
                "Douven, I. and Mirabile, P., 2018. “Best, Second-best, and\nGood-enough Explanations: How They Matter to Reasoning,”\n<em>Journal of Experimental Psychology: Language, Memory, and\nCognition</em>, 44: 1792–1813.",
                "Douven, I. and Schupbach, J., 2015a. “The Role of\nExplanatory Considerations in Updating,” <em>Cognition</em>,\n142: 299–311.",
                "–––, 2015b. “Probabilistic Alternatives to\nBayesianism: The Case of Explanationism,” <em>Frontiers in\nPsychology</em>, 6: 459. doi:10.3389/fpsyg.2015.00459",
                "Douven, I. and Wenmackers, S., 2017. “Inference to the Best\nExplanation versus Bayes’s Rule in a Social Setting,”\n<em>British Journal for the Philosophy of Science</em>, 68:\n535–570.",
                "Dragulinescu, S., 2016. “Inference to the Best Explanation\nand Mechanisms in Medicine,” <em>Theoretical Medicine and\nBioethics</em>, 37(3): 211–232.",
                "Fann, K. T., 1970. <em>Peirce’s Theory of Abduction</em>,\nThe Hague: Martinus Nijhoff.",
                "Fine, A., 1984. “The Natural Ontological Attitude,” in\nJ. Leplin (ed.), <em>Scientific Realism</em>, Berkeley CA: University\nof California Press, pp. 83–107.",
                "Foley, R., 1992. “The Epistemology of Belief and the\nEpistemology of Degrees of Belief,” <em>American Philosophical\nQuarterly</em>, 29: 111–124.",
                "Folina, J., 2016. “Realism, Skepticism, and the Brain in a\nVat,” in S. Goldberg (ed.), <em>The Brain in a Vat</em>,\nCambridge: Cambridge University Press, pp. 155–173.",
                "Forster, M. and Sober, E., 1994. “How to Tell when Simpler,\nMore Unified, or Less <em>Ad Hoc</em>, Theories will Provide More\nAccurate Predictions,” <em>British Journal for the Philosophy of\nScience</em>, 45: 1–36.",
                "Frankfurt, H., 1958. “Peirce’s Notion of\nAbduction,” <em>Journal of Philosophy</em>, 55:\n593–596.",
                "Fricker, E., 1994. “Against Gullibility,” in B. K.\nMatilal and A. Chakrabarti (eds.), <em>Knowing from Words</em>,\nDordrecht: Kluwer, pp. 125–161.",
                "Goldman, A., 1988. <em>Empirical Knowledge</em>, Berkeley CA:\nUniversity of California Press.",
                "Hájek, A., 2003. “What Conditional Probability Could\nNot Be,” <em>Synthese</em>, 137: 273–323.",
                "Harman, G., 1965. “The Inference to the Best\nExplanation,” <em>Philosophical Review</em>, 74:\n88–95.",
                "–––, 1973. <em>Thought</em>, Princeton NJ:\nPrinceton University Press.",
                "–––, 1997. “Pragmatism and Reasons for\nBelief,” in C. Kulp (ed.), <em>Realism/Antirealism and\nEpistemology</em>, Totowa NJ: Rowman and Littlefield, pp.\n123–147.",
                "Harré, R., 1986. <em>Varieties of Realism</em>, Oxford:\nBlackwell.",
                "–––, 1988. “Realism and Ontology,”\n<em>Philosophia Naturalis</em>, 25: 386–398.",
                "Hobbs, J. R., 2004. “Abduction in Natural Language\nUnderstanding,” in L. Horn and G. Ward (eds.), <em>The Handbook\nof Pragmatics</em>, Oxford: Blackwell, pp. 724–741.",
                "Janssen, M., 2002. “Reconsidering a Scientific Revolution:\nThe Case of Einstein <em>versus</em>, Lorentz,” <em>Physics in\nPerspective</em>, 4: 421–446.",
                "Josephson, J. R. and Josephson, S. G. (eds.), 1994. <em>Abductive\nInference</em>, Cambridge: Cambridge University Press.",
                "Kitcher, P., 2001. “Real Realism: The Galilean\nStrategy,” <em>Philosophical Review</em>, 110:\n151–197.",
                "Koehler, D. J., 1991. “Explanation, Imagination, and\nConfidence in Judgment,” <em>Psychological Bulletin</em>, 110:\n499–519.",
                "Koslowski, B., Marasia, J., Chelenza, M., and Dublin, R., 2008.\n“Information Becomes Evidence when an Explanation Can\nIncorporate it into a Causal Framework,” <em>Cognitive\nDevelopment</em>, 23: 472–487.",
                "Kosso, P., 1992. <em>Reading the Book of Nature</em>, Cambridge:\nCambridge University Press.",
                "Krzyżanowska, K, Wenmackers, S., and Douven, I., 2014.\n“Rethinking Gibbard’s Riverboat Argument,”\n<em>Studia Logica</em>, 102: 771–792.",
                "Kuipers, T., 1984. “Approaching the Truth with the Rule of\nSuccess,” <em>Philosophia</em>, <em>Naturalis</em>, 21:\n244–253.",
                "–––, 1992. “Naive and Refined Truth\nApproximation,” <em>Synthese</em>, 93: 299–341.",
                "–––, 2000. <em>From Instrumentalism to\nConstructive Realism</em>, Dordrecht: Kluwer.",
                "Kvanvig, J., 1994. “A Critique of van Fraassen’s\nVoluntaristic Epistemology,” <em>Synthese</em>, 98:\n325–348.",
                "Kyburg Jr., H., 1990. <em>Science and Reason</em>, Oxford: Oxford\nUniversity Press.",
                "Laudan, L., 1981. “A Confutation of Convergent\nRealism,” <em>Philosophy of Science</em>, 48: 19–49.",
                "Lewis, D., 1980. “A Subjectivist’s Guide to Objective\nChance,” in R. Jeffrey (ed.), <em>Studies in Inductive Logic and\nProbability</em>, Berkeley CA: University of California Press, pp.\n263–293.",
                "Li, M. and Vitanyi, P., 1997. <em>An Introduction to Kolmogorov\nComplexity and its Applications</em>, New York: Springer.",
                "Lipton, P., 1991. <em>Inference to the Best Explanation</em>,\nLondon: Routledge.",
                "–––, 1993. “Is the Best Good\nEnough?” <em>Proceedings of the Aristotelian Society</em>, 93:\n89–104.",
                "–––, 1998. “The Epistemology of\nTestimony,” <em>Studies in History and Philosophy of\nScience</em>, 29: 1–31.",
                "–––, 2004. <em>Inference to the Best\nExplanation</em>, (2nd ed.), London: Routledge.",
                "Lombrozo, T., 2007. “Simplicity and Probability in Causal\nExplanation,” <em>Cognitive Psychology</em>, 55:\n232–257.",
                "–––, 2012. “Explanation and Abductive\nInference,” in K. Holyoak and R. Morrison (eds.), <em>Oxford\nHandbook of Thinking and Reasoning</em>, Oxford: Oxford University\nPress, pp. 260–276.",
                "–––, 2016. “Explanatory Preferences Shape\nLearning and Inference,” <em>Trends in Cognitive Sciences</em>,\n20: 748–759.",
                "Lombrozo, T. and Gwynne, N. Z., 2014. “Explanation and\nInference: Mechanistic and Functional Explanations Guide Property\nGeneralization,” <em>Frontiers in Human Neuroscience</em>, 8.\ndoi:10.3389/fnhum.2014.00700",
                "Maher, P., 1992. “Diachronic Rationality,”\n<em>Philosophy of Science</em>, 59: 120–141.",
                "McAuliffe, W., 2015. “How Did Abduction Get Confused with\nInference to the Best Explanation?” <em>Transactions of the\nCharles S. Peirce Society</em>, 51: 300–319.",
                "McCain, K. and Poston, T., 2014. “Why Explanatoriness is\nEvidentially Relevant,” <em>Thought</em>, 3: 145–153.",
                "McGrew, T., 2003. “Confirmation, Heuristics, and Explanatory\nReasoning,” <em>British Journal for the Philosophy of\nScience</em>, 54: 553–567.",
                "McMullin, E., 1992. <em>The Inference that Makes Science</em>,\nMilwaukee WI: Marquette University Press.",
                "–––, 1996. “Epistemic Virtue and Theory\nAppraisal,” in I. Douven and L. Horsten (eds.), <em>Realism in\nthe Sciences</em>, Leuven: Leuven University Press, pp.\n13–34.",
                "Moore, G. E., 1962. “Proof of an External World,” in\nhis <em>Philosophical Papers</em>, New York: Collier Books, pp.\n126–149.",
                "Moser, P., 1989. <em>Knowledge and Evidence</em>, Cambridge:\nCambridge University Press.",
                "Musgrave, A., 1988. “The Ultimate Argument for Scientific\nRealism,” in R. Nola (ed.), <em>Relativism and Realism in\nScience</em>, Dordrecht: Kluwer, pp. 229–252.",
                "Niiniluoto, I., 1998. “Verisimilitude: The Third\nPeriod,” <em>British Journal for the Philosophy of Science</em>,\n49: 1–29.",
                "–––, 1999. “Defending Abduction,”\n<em>Philosophy of Science</em>, 66: S436–S451.",
                "Okasha, S., 2000. “Van Fraassen’s Critique of\nInference to the Best Explanation,” <em>Studies in History and\nPhilosophy of Science</em>, 31: 691–710.",
                "Olsson, E., 2005. <em>Against Coherence</em>, Oxford: Oxford\nUniversity Press.",
                "Pargetter, R., 1984. “The Scientific Inference to Other\nMinds,” <em>Australasian Journal of Philosophy</em>, 62:\n158–163.",
                "Peirce, C. S. [<b>CP</b>]. <em>Collected Papers of Charles Sanders\nPeirce</em>, edited by C. Hartshorne, P. Weiss, and A. Burks,\n1931–1958, Cambridge MA: Harvard University Press.",
                "Poston, T., 2014. <em>Reason and Explanation</em>, Basingstoke:\nPalgrave Macmillan.",
                "Psillos, S., 1999. <em>Scientific Realism: How Science Tracks\nTruth</em>, London: Routledge.",
                "–––, 2000. “Abduction: Between Conceptual\nRichness and Computational Complexity,” in A. K. Kakas and P.\nFlach (eds.), <em>Abduction and Induction: Essays on their Relation\nand Integration</em>, Dordrecht: Kluwer, pp. 59–74.",
                "–––, 2004. “Inference to the Best\nExplanation and Bayesianism,” in F. Stadler (ed.), <em>Induction\nand Deduction in the Sciences</em>, Dordrecht: Kluwer, pp.\n83–91.",
                "Putnam, H., 1981. <em>Reason, Truth and History</em>, Cambridge:\nCambridge University Press.",
                "Roche, W. and Sober, E., 2013. “Explanatoriness is\nEvidentially Irrelevant, or Inference to the Best Explanation Meets\nBayesian Confirmation Theory,” <em>Analysis</em>, 73:\n659–668",
                "–––, 2014. “Explanatoriness and Evidence:\nA Reply to McCain and Poston,” <em>Thought</em>, 3:\n193–199.",
                "Russell, B., 1912. <em>The Problems of Philosophy</em>, Oxford:\nOxford University Press.",
                "Schupbach, J., 2014. “Is the Bad Lot Objection Just\nMisguided?” <em>Erkenntnis</em>, 79: 55–64.",
                "Schupbach, J. and Sprenger, J., 2011. “The Logic of\nExplanatory Power,” <em>Philosophy of Science</em>, 78:\n105–127.",
                "Schurz, G., 2008. “Patterns of Abduction,”\n<em>Synthese</em>, 164: 201–234.",
                "Shalkowski, S., 2010. “IBE, GMR, and Metaphysical\nProjects,” in B. Hale and A. Hoffmann (eds.), <em>Modality:\nMetaphysics, Logic, and Epistemology</em>, Oxford: Oxford University\nPress, pp. 169–187.",
                "Skyrms, B., 1993. “A Mistake in Dynamic Coherence\nArguments?” <em>Philosophy of Science</em>, 60:\n320–328.",
                "Sloman, S., 1994. “When Explanations Compete: The Role of\nExplanatory Coherence on Judgments of Likelihood,”\n<em>Cognition</em>, 52: 1–21.",
                "Sober, E., 2015. <em>Ockham’s Razor: A User’s\nManual</em>, Cambridge: Cambridge University Press.",
                "Stanford, K., 2009. “Underdetermination of Scientific\nTheory,” in <em>Stanford Encyclopedia of Philosophy</em> (Winter\n2009 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2009/entries/scientific-underdetermination/\">https://plato.stanford.edu/archives/win2009/entries/scientific-underdetermination/</a>&gt;.",
                "Teller, P., 1973. “Conditionalization and\nObservation,” <em>Synthese</em>, 26: 218–258.",
                "Thagard, P., 1978. “The Best Explanation: Criteria for\nTheory Choice,” <em>Journal of Philosophy</em>, 75:\n76–92.",
                "van Fraassen, B., 1980. <em>The Scientific Image</em>, Oxford:\nOxford University Press.",
                "–––, 1983. “Glymour on Evidence and\nExplanation,” in J. Earman (ed.), <em>Testing Scientific\nTheories</em>, Minneapolis: University of Minnesota Press, pp.\n165–176.",
                "–––, 1985. “Empiricism in the Philosophy\nof Science,” in P. Churchland and C. Hooker (eds.), <em>Images\nof Science</em>, Chicago IL: University of Chicago Press, pp.\n245–308.",
                "–––, 1989. <em>Laws and Symmetry</em>, Oxford:\nOxford University Press.",
                "Vogel, J., 1990. “Cartesian Skepticism and Inference to the\nBest Explanation,” <em>Journal of Philosophy</em>, 87:\n658–666.",
                "–––, 2005. “The Refutation of\nSkepticism,” in M. Steup and E. Sosa (eds.), <em>Contemporary\nDebates in Epistemology</em>, Oxford: Blackwell Publishing, pp.\n72–84.",
                "Weintraub, R., 2013. “Induction and Inference to the Best\nExplanation,” <em>Philosophical Studies</em>, 166:\n203–216.",
                "Weisberg, J., 2009. “Locating IBE in the Bayesian\nFramework,” <em>Synthese</em>, 167: 125–143.",
                "Williams, J. and Lombrozo, T., 2010. “The Role of\nExplanation in Discovery and Generalization: Evidence from Category\nLearning,” <em>Cognitive Science</em>, 34: 776–806.",
                "Williamson, T., 2017. “Semantic Paradoxes and Abductive\nMethodology,” in B. Armour-Garb (ed.),\n<em>Reflections on the Liar</em>, Oxford: Oxford University\nPress, pp. 325–346."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Achinstein, P., 2001. <em>The Book of Evidence</em>, Oxford:\nOxford University Press.</li>\n<li>Adler, J., 1994. “Testimony, Trust, Knowing,”\n<em>Journal of Philosophy</em>, 91: 264–275.</li>\n<li>Bach, K. and Harnish, R., 1979. <em>Linguistic Communication and\nSpeech Acts</em>, Cambridge MA: MIT Press.</li>\n<li>Bird, A., 1998. <em>Philosophy of Science</em>, London: UCL\nPress.</li>\n<li>Bigelow, J., 2010. “Quine, Mereology, and Inference to the\nBest Explanation,” <em>Logique et Analyse</em>, 212:\n465–482.</li>\n<li>Bovens, L. and Hartmann, S., 2003. “Solving the Riddle of\nCoherence,” <em>Mind</em>, 112: 601–633.</li>\n<li>Boyd, R., 1981. “Scientific Realism and Naturalistic\nEpistemology,” in P. Asquith and R. Giere (eds.), <em>PSA\n1980</em>, (vol. II), East Lansing MI: Philosophy of Science\nAssociation, pp. 613–662.</li>\n<li>–––, 1984. “The Current Status of\nScientific Realism,” in J. Leplin (ed.), <em>Scientific\nRealism</em>, Berkeley CA: University of California Press, pp.\n41–82.</li>\n<li>–––, 1985. “Lex Orandi est Lex\nCredendi,” in P. Churchland and C. Hooker (eds.), <em>Images of\nScience</em>, Chicago IL: University of Chicago Press, pp.\n3–34.</li>\n<li>Brem, S. and Rips, L. J., 2000. “Explanation and Evidence in\nInformal Argument,” <em>Cognitive Science</em>, 24:\n573–604.</li>\n<li>Callebaut, W. (ed.), 1993. <em>Taking the Naturalistic Turn</em>,\nChicago IL: University of Chicago Press.</li>\n<li>Campos, D., 2011. “On the Distinction Between Peirce’s\nAbduction and Lipton’s Inference to the Best Explanation,”\n<em>Synthese</em>, 180: 419–442.</li>\n<li>Climenhaga, N., forthcoming. “Inference to the Best\nExplanation Made Incoherent,” <em>Journal of Philosophy</em>,\n <a href=\"http://philsci-archive.pitt.edu/12756/1/IBE%20Made%20Incoherent.pdf\" target=\"other\">preprint available online</a>.</li>\n<li>Dascal, M., 1979. “Conversational Relevance,” in A.\nMargalit (ed.), <em>Meaning and Use</em>, Dordrecht: Reidel, pp.\n153–174.</li>\n<li>Dellsén, F., 2017. “Reactionary Responses to the Bad\nLot Objection,” <em>Studies in History and Philosophy of\nScience</em>, 61: 32–40.</li>\n<li>–––, 2018. “The Heuristic Conception of\nInference to the Best Explanation,”\n<em>Philosophical Studies</em>, 175: 1745–1766. </li>\n<li>Douven, I., 1999. “Inference to the Best Explanation Made\nCoherent,” <em>Philosophy</em>, <em>of Science</em>, 66:\nS424–S435.</li>\n<li>–––, 2002. “Testing Inference to the Best\nExplanation,” <em>Synthese</em>, 130: 355–377.</li>\n<li>–––, 2008. “Underdetermination,” in\nS. Psillos and M. Curd (eds.), <em>The Routledge Companion to the\nPhilosophy of Science</em>, London: Routledge, pp. 292–301.</li>\n<li>–––, 2013. “Inference to the Best\nExplanation, Dutch Books, and Inaccuracy Minimisation,”\n<em>Philosophical Quarterly</em>, 63: 428–444.</li>\n<li>–––, 2016a. <em>The Epistemology of Indicative\nConditionals</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2016b. “Explanation, Updating, and\nAccuracy,” <em>Journal of Cognitive Psychology</em>, 28:\n1004–1012.</li>\n<li>–––, 2017. “What Is Inference to the Best\nExplanation? And Why Should We Care?” in T. Poston and K. McCain\n(eds.), <em>Best Explanations: New Essays on Inference to the Best\nExplanation</em>, Oxford: Oxford University Press, pp.\n4–22.</li>\n<li>–––, 2020. “The Ecological Rationality of\nExplanatory Reasoning,” <em>Studies in History and Philosophy of\nScience</em>, 79: 1–14.</li>\n<li>–––, forthcoming. <em>The Art of\nAbduction</em>, Cambridge MA: MIT Press.</li>\n<li>Douven, I. and Mirabile, P., 2018. “Best, Second-best, and\nGood-enough Explanations: How They Matter to Reasoning,”\n<em>Journal of Experimental Psychology: Language, Memory, and\nCognition</em>, 44: 1792–1813.</li>\n<li>Douven, I. and Schupbach, J., 2015a. “The Role of\nExplanatory Considerations in Updating,” <em>Cognition</em>,\n142: 299–311.</li>\n<li>–––, 2015b. “Probabilistic Alternatives to\nBayesianism: The Case of Explanationism,” <em>Frontiers in\nPsychology</em>, 6: 459. doi:10.3389/fpsyg.2015.00459</li>\n<li>Douven, I. and Wenmackers, S., 2017. “Inference to the Best\nExplanation versus Bayes’s Rule in a Social Setting,”\n<em>British Journal for the Philosophy of Science</em>, 68:\n535–570.</li>\n<li>Dragulinescu, S., 2016. “Inference to the Best Explanation\nand Mechanisms in Medicine,” <em>Theoretical Medicine and\nBioethics</em>, 37(3): 211–232.</li>\n<li>Fann, K. T., 1970. <em>Peirce’s Theory of Abduction</em>,\nThe Hague: Martinus Nijhoff.</li>\n<li>Fine, A., 1984. “The Natural Ontological Attitude,” in\nJ. Leplin (ed.), <em>Scientific Realism</em>, Berkeley CA: University\nof California Press, pp. 83–107.</li>\n<li>Foley, R., 1992. “The Epistemology of Belief and the\nEpistemology of Degrees of Belief,” <em>American Philosophical\nQuarterly</em>, 29: 111–124.</li>\n<li>Folina, J., 2016. “Realism, Skepticism, and the Brain in a\nVat,” in S. Goldberg (ed.), <em>The Brain in a Vat</em>,\nCambridge: Cambridge University Press, pp. 155–173.</li>\n<li>Forster, M. and Sober, E., 1994. “How to Tell when Simpler,\nMore Unified, or Less <em>Ad Hoc</em>, Theories will Provide More\nAccurate Predictions,” <em>British Journal for the Philosophy of\nScience</em>, 45: 1–36.</li>\n<li>Frankfurt, H., 1958. “Peirce’s Notion of\nAbduction,” <em>Journal of Philosophy</em>, 55:\n593–596.</li>\n<li>Fricker, E., 1994. “Against Gullibility,” in B. K.\nMatilal and A. Chakrabarti (eds.), <em>Knowing from Words</em>,\nDordrecht: Kluwer, pp. 125–161.</li>\n<li>Goldman, A., 1988. <em>Empirical Knowledge</em>, Berkeley CA:\nUniversity of California Press.</li>\n<li>Hájek, A., 2003. “What Conditional Probability Could\nNot Be,” <em>Synthese</em>, 137: 273–323.</li>\n<li>Harman, G., 1965. “The Inference to the Best\nExplanation,” <em>Philosophical Review</em>, 74:\n88–95.</li>\n<li>–––, 1973. <em>Thought</em>, Princeton NJ:\nPrinceton University Press.</li>\n<li>–––, 1997. “Pragmatism and Reasons for\nBelief,” in C. Kulp (ed.), <em>Realism/Antirealism and\nEpistemology</em>, Totowa NJ: Rowman and Littlefield, pp.\n123–147.</li>\n<li>Harré, R., 1986. <em>Varieties of Realism</em>, Oxford:\nBlackwell.</li>\n<li>–––, 1988. “Realism and Ontology,”\n<em>Philosophia Naturalis</em>, 25: 386–398.</li>\n<li>Hobbs, J. R., 2004. “Abduction in Natural Language\nUnderstanding,” in L. Horn and G. Ward (eds.), <em>The Handbook\nof Pragmatics</em>, Oxford: Blackwell, pp. 724–741.</li>\n<li>Janssen, M., 2002. “Reconsidering a Scientific Revolution:\nThe Case of Einstein <em>versus</em>, Lorentz,” <em>Physics in\nPerspective</em>, 4: 421–446.</li>\n<li>Josephson, J. R. and Josephson, S. G. (eds.), 1994. <em>Abductive\nInference</em>, Cambridge: Cambridge University Press.</li>\n<li>Kitcher, P., 2001. “Real Realism: The Galilean\nStrategy,” <em>Philosophical Review</em>, 110:\n151–197.</li>\n<li>Koehler, D. J., 1991. “Explanation, Imagination, and\nConfidence in Judgment,” <em>Psychological Bulletin</em>, 110:\n499–519.</li>\n<li>Koslowski, B., Marasia, J., Chelenza, M., and Dublin, R., 2008.\n“Information Becomes Evidence when an Explanation Can\nIncorporate it into a Causal Framework,” <em>Cognitive\nDevelopment</em>, 23: 472–487.</li>\n<li>Kosso, P., 1992. <em>Reading the Book of Nature</em>, Cambridge:\nCambridge University Press.</li>\n<li>Krzyżanowska, K, Wenmackers, S., and Douven, I., 2014.\n“Rethinking Gibbard’s Riverboat Argument,”\n<em>Studia Logica</em>, 102: 771–792.</li>\n<li>Kuipers, T., 1984. “Approaching the Truth with the Rule of\nSuccess,” <em>Philosophia</em>, <em>Naturalis</em>, 21:\n244–253.</li>\n<li>–––, 1992. “Naive and Refined Truth\nApproximation,” <em>Synthese</em>, 93: 299–341.</li>\n<li>–––, 2000. <em>From Instrumentalism to\nConstructive Realism</em>, Dordrecht: Kluwer.</li>\n<li>Kvanvig, J., 1994. “A Critique of van Fraassen’s\nVoluntaristic Epistemology,” <em>Synthese</em>, 98:\n325–348.</li>\n<li>Kyburg Jr., H., 1990. <em>Science and Reason</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Laudan, L., 1981. “A Confutation of Convergent\nRealism,” <em>Philosophy of Science</em>, 48: 19–49.</li>\n<li>Lewis, D., 1980. “A Subjectivist’s Guide to Objective\nChance,” in R. Jeffrey (ed.), <em>Studies in Inductive Logic and\nProbability</em>, Berkeley CA: University of California Press, pp.\n263–293.</li>\n<li>Li, M. and Vitanyi, P., 1997. <em>An Introduction to Kolmogorov\nComplexity and its Applications</em>, New York: Springer.</li>\n<li>Lipton, P., 1991. <em>Inference to the Best Explanation</em>,\nLondon: Routledge.</li>\n<li>–––, 1993. “Is the Best Good\nEnough?” <em>Proceedings of the Aristotelian Society</em>, 93:\n89–104.</li>\n<li>–––, 1998. “The Epistemology of\nTestimony,” <em>Studies in History and Philosophy of\nScience</em>, 29: 1–31.</li>\n<li>–––, 2004. <em>Inference to the Best\nExplanation</em>, (2nd ed.), London: Routledge.</li>\n<li>Lombrozo, T., 2007. “Simplicity and Probability in Causal\nExplanation,” <em>Cognitive Psychology</em>, 55:\n232–257.</li>\n<li>–––, 2012. “Explanation and Abductive\nInference,” in K. Holyoak and R. Morrison (eds.), <em>Oxford\nHandbook of Thinking and Reasoning</em>, Oxford: Oxford University\nPress, pp. 260–276.</li>\n<li>–––, 2016. “Explanatory Preferences Shape\nLearning and Inference,” <em>Trends in Cognitive Sciences</em>,\n20: 748–759.</li>\n<li>Lombrozo, T. and Gwynne, N. Z., 2014. “Explanation and\nInference: Mechanistic and Functional Explanations Guide Property\nGeneralization,” <em>Frontiers in Human Neuroscience</em>, 8.\ndoi:10.3389/fnhum.2014.00700</li>\n<li>Maher, P., 1992. “Diachronic Rationality,”\n<em>Philosophy of Science</em>, 59: 120–141.</li>\n<li>McAuliffe, W., 2015. “How Did Abduction Get Confused with\nInference to the Best Explanation?” <em>Transactions of the\nCharles S. Peirce Society</em>, 51: 300–319.</li>\n<li>McCain, K. and Poston, T., 2014. “Why Explanatoriness is\nEvidentially Relevant,” <em>Thought</em>, 3: 145–153.</li>\n<li>McGrew, T., 2003. “Confirmation, Heuristics, and Explanatory\nReasoning,” <em>British Journal for the Philosophy of\nScience</em>, 54: 553–567.</li>\n<li>McMullin, E., 1992. <em>The Inference that Makes Science</em>,\nMilwaukee WI: Marquette University Press.</li>\n<li>–––, 1996. “Epistemic Virtue and Theory\nAppraisal,” in I. Douven and L. Horsten (eds.), <em>Realism in\nthe Sciences</em>, Leuven: Leuven University Press, pp.\n13–34.</li>\n<li>Moore, G. E., 1962. “Proof of an External World,” in\nhis <em>Philosophical Papers</em>, New York: Collier Books, pp.\n126–149.</li>\n<li>Moser, P., 1989. <em>Knowledge and Evidence</em>, Cambridge:\nCambridge University Press.</li>\n<li>Musgrave, A., 1988. “The Ultimate Argument for Scientific\nRealism,” in R. Nola (ed.), <em>Relativism and Realism in\nScience</em>, Dordrecht: Kluwer, pp. 229–252.</li>\n<li>Niiniluoto, I., 1998. “Verisimilitude: The Third\nPeriod,” <em>British Journal for the Philosophy of Science</em>,\n49: 1–29.</li>\n<li>–––, 1999. “Defending Abduction,”\n<em>Philosophy of Science</em>, 66: S436–S451.</li>\n<li>Okasha, S., 2000. “Van Fraassen’s Critique of\nInference to the Best Explanation,” <em>Studies in History and\nPhilosophy of Science</em>, 31: 691–710.</li>\n<li>Olsson, E., 2005. <em>Against Coherence</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Pargetter, R., 1984. “The Scientific Inference to Other\nMinds,” <em>Australasian Journal of Philosophy</em>, 62:\n158–163.</li>\n<li>Peirce, C. S. [<b>CP</b>]. <em>Collected Papers of Charles Sanders\nPeirce</em>, edited by C. Hartshorne, P. Weiss, and A. Burks,\n1931–1958, Cambridge MA: Harvard University Press.</li>\n<li>Poston, T., 2014. <em>Reason and Explanation</em>, Basingstoke:\nPalgrave Macmillan.</li>\n<li>Psillos, S., 1999. <em>Scientific Realism: How Science Tracks\nTruth</em>, London: Routledge.</li>\n<li>–––, 2000. “Abduction: Between Conceptual\nRichness and Computational Complexity,” in A. K. Kakas and P.\nFlach (eds.), <em>Abduction and Induction: Essays on their Relation\nand Integration</em>, Dordrecht: Kluwer, pp. 59–74.</li>\n<li>–––, 2004. “Inference to the Best\nExplanation and Bayesianism,” in F. Stadler (ed.), <em>Induction\nand Deduction in the Sciences</em>, Dordrecht: Kluwer, pp.\n83–91.</li>\n<li>Putnam, H., 1981. <em>Reason, Truth and History</em>, Cambridge:\nCambridge University Press.</li>\n<li>Roche, W. and Sober, E., 2013. “Explanatoriness is\nEvidentially Irrelevant, or Inference to the Best Explanation Meets\nBayesian Confirmation Theory,” <em>Analysis</em>, 73:\n659–668</li>\n<li>–––, 2014. “Explanatoriness and Evidence:\nA Reply to McCain and Poston,” <em>Thought</em>, 3:\n193–199.</li>\n<li>Russell, B., 1912. <em>The Problems of Philosophy</em>, Oxford:\nOxford University Press.</li>\n<li>Schupbach, J., 2014. “Is the Bad Lot Objection Just\nMisguided?” <em>Erkenntnis</em>, 79: 55–64.</li>\n<li>Schupbach, J. and Sprenger, J., 2011. “The Logic of\nExplanatory Power,” <em>Philosophy of Science</em>, 78:\n105–127.</li>\n<li>Schurz, G., 2008. “Patterns of Abduction,”\n<em>Synthese</em>, 164: 201–234.</li>\n<li>Shalkowski, S., 2010. “IBE, GMR, and Metaphysical\nProjects,” in B. Hale and A. Hoffmann (eds.), <em>Modality:\nMetaphysics, Logic, and Epistemology</em>, Oxford: Oxford University\nPress, pp. 169–187.</li>\n<li>Skyrms, B., 1993. “A Mistake in Dynamic Coherence\nArguments?” <em>Philosophy of Science</em>, 60:\n320–328.</li>\n<li>Sloman, S., 1994. “When Explanations Compete: The Role of\nExplanatory Coherence on Judgments of Likelihood,”\n<em>Cognition</em>, 52: 1–21.</li>\n<li>Sober, E., 2015. <em>Ockham’s Razor: A User’s\nManual</em>, Cambridge: Cambridge University Press.</li>\n<li>Stanford, K., 2009. “Underdetermination of Scientific\nTheory,” in <em>Stanford Encyclopedia of Philosophy</em> (Winter\n2009 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2009/entries/scientific-underdetermination/\">https://plato.stanford.edu/archives/win2009/entries/scientific-underdetermination/</a>&gt;.</li>\n<li>Teller, P., 1973. “Conditionalization and\nObservation,” <em>Synthese</em>, 26: 218–258.</li>\n<li>Thagard, P., 1978. “The Best Explanation: Criteria for\nTheory Choice,” <em>Journal of Philosophy</em>, 75:\n76–92.</li>\n<li>van Fraassen, B., 1980. <em>The Scientific Image</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 1983. “Glymour on Evidence and\nExplanation,” in J. Earman (ed.), <em>Testing Scientific\nTheories</em>, Minneapolis: University of Minnesota Press, pp.\n165–176.</li>\n<li>–––, 1985. “Empiricism in the Philosophy\nof Science,” in P. Churchland and C. Hooker (eds.), <em>Images\nof Science</em>, Chicago IL: University of Chicago Press, pp.\n245–308.</li>\n<li>–––, 1989. <em>Laws and Symmetry</em>, Oxford:\nOxford University Press.</li>\n<li>Vogel, J., 1990. “Cartesian Skepticism and Inference to the\nBest Explanation,” <em>Journal of Philosophy</em>, 87:\n658–666.</li>\n<li>–––, 2005. “The Refutation of\nSkepticism,” in M. Steup and E. Sosa (eds.), <em>Contemporary\nDebates in Epistemology</em>, Oxford: Blackwell Publishing, pp.\n72–84.</li>\n<li>Weintraub, R., 2013. “Induction and Inference to the Best\nExplanation,” <em>Philosophical Studies</em>, 166:\n203–216.</li>\n<li>Weisberg, J., 2009. “Locating IBE in the Bayesian\nFramework,” <em>Synthese</em>, 167: 125–143.</li>\n<li>Williams, J. and Lombrozo, T., 2010. “The Role of\nExplanation in Discovery and Generalization: Evidence from Category\nLearning,” <em>Cognitive Science</em>, 34: 776–806.</li>\n<li>Williamson, T., 2017. “Semantic Paradoxes and Abductive\nMethodology,” in B. Armour-Garb (ed.),\n<em>Reflections on the Liar</em>, Oxford: Oxford University\nPress, pp. 325–346.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "epistemology: Bayesian",
            "induction: problem of",
            "Peirce, Charles Sanders",
            "scientific explanation",
            "scientific realism",
            "simplicity",
            "skepticism",
            "underdetermination, of scientific theories"
        ],
        "entry_link": [
            {
                "../epistemology-bayesian/": "epistemology: Bayesian"
            },
            {
                "../induction-problem/": "induction: problem of"
            },
            {
                "../peirce/": "Peirce, Charles Sanders"
            },
            {
                "../scientific-explanation/": "scientific explanation"
            },
            {
                "../scientific-realism/": "scientific realism"
            },
            {
                "../simplicity/": "simplicity"
            },
            {
                "../skepticism/": "skepticism"
            },
            {
                "../scientific-underdetermination/": "underdetermination, of scientific theories"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abduction\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/abduction/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=abduction&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/abduction/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abduction": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/abduction/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=abduction&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/abduction/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}