{
    "url": "abstract-objects",
    "title": "Abstract Objects",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "José L. Falguera\n<joseluis.falguera@usc.es>\nConcha Martínez-Vidal\n<mconcepcion.martinez@usc.es>\nGideon Rosen",
        "author_links": [
            {
                "https://doctoradologifici.usal.es/?q=profesor/falguera-lopez-jose-luis": "José L. Falguera"
            },
            {
                "mailto:joseluis%2efalguera%40usc%2ees": "joseluis.falguera@usc.es"
            },
            {
                "https://epimenides.usal.es/?q=profesor/martinez-vidal-concepcion": "Concha Martínez-Vidal"
            },
            {
                "mailto:mconcepcion%2emartinez%40usc%2ees": "mconcepcion.martinez@usc.es"
            },
            {
                "http://philosophy.princeton.edu/index.php?option=com_faculty&Itemid=78&func=fullview&facultyid=36": "Gideon Rosen"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://doctoradologifici.usal.es/?q=profesor/falguera-lopez-jose-luis\" target=\"other\">José L. Falguera</a>\n&lt;<a href=\"mailto:joseluis%2efalguera%40usc%2ees\"><em>joseluis<abbr title=\" dot \">.</abbr>falguera<abbr title=\" at \">@</abbr>usc<abbr title=\" dot \">.</abbr>es</em></a>&gt;<br/>\n<a href=\"https://epimenides.usal.es/?q=profesor/martinez-vidal-concepcion\" target=\"other\">Concha Martínez-Vidal</a>\n&lt;<a href=\"mailto:mconcepcion%2emartinez%40usc%2ees\"><em>mconcepcion<abbr title=\" dot \">.</abbr>martinez<abbr title=\" at \">@</abbr>usc<abbr title=\" dot \">.</abbr>es</em></a>&gt;<br/>\n<a href=\"http://philosophy.princeton.edu/index.php?option=com_faculty&amp;Itemid=78&amp;func=fullview&amp;facultyid=36\" target=\"other\">Gideon Rosen</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jul 19, 2001",
        "substantive revision Mon Aug 9, 2021"
    ],
    "preamble": "\n\nOne doesn’t go far in the study of what there is without\nencountering the view that every entity falls into one of two\ncategories: concrete or abstract. The distinction is\nsupposed to be of fundamental significance for metaphysics (especially\nfor ontology), epistemology, and the philosophy of the formal sciences\n(especially for the philosophy of mathematics); it is also relevant\nfor analysis in the philosophy of language, the philosophy of mind,\nand the philosophy of the empirical sciences. This entry surveys (a)\nattempts to say how the distinction should be drawn and (b) some of\nmain theories of, and about, abstract objects.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#AbouExprObje": "1.1 About the Expression ‘Object’"
        },
        {
            "#AbouAbstDist": "1.2 About the Abstract/Concrete Distinction"
        },
        {
            "#HistRema": "2. Historical Remarks"
        },
        {
            "#ProvDist": "2.1 The Provenance of the Distinction"
        },
        {
            "#InitOverContDeba": "2.2 An Initial Overview of the Contemporary Debate"
        },
        {
            "#WhatAbstObje": "3. What is an Abstract Object?"
        },
        {
            "#WayExamWayPrim": "3.1 The Way of Example and the Way of Primitivism"
        },
        {
            "#WayConf": "3.2 The Way of Conflation"
        },
        {
            "#WayAbst": "3.3 The Way of Abstraction"
        },
        {
            "#WayAbstPrin": "3.4 The Way of Abstraction Principles"
        },
        {
            "#WaysNega": "3.5 The Ways of Negation"
        },
        {
            "#WayEnco": "3.6 The Way of Encoding"
        },
        {
            "#WaysWeakExis": "3.7 The Ways of Weakening Existence"
        },
        {
            "#Elim": "3.8 Eliminativism"
        },
        {
            "#FurtRead": "4. Further Reading"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nThe abstract/concrete distinction has a curious status in contemporary\nphilosophy. It is widely agreed that the ontological distinction is of\nfundamental importance, but as yet, there is no standard account of\nhow it should be drawn. There is a consensus about how to classify\ncertain paradigm cases. For example, it is usually acknowledged that\nnumbers and the other objects of pure mathematics, like pure sets, are\nabstract (if they exist), whereas rocks, trees, and human beings are\nconcrete. In everyday language, it is common to use expressions that\nrefer to concrete entities as well as those that apparently refer to\nabstractions such as democracy, happiness, motherhood, etc. Moreover,\nformulations of mathematical theories seem to appeal directly to\nabstract entities, and the use of mathematical expressions in the\nempirical sciences seems indispensable to the formulation of our best\nempirical theories (see Quine 1948; Putnam 1971; and the entry on\n indispensability arguments in the philosophy of mathematics).\n Finally, apparent reference to abstract entities such as sets,\nproperties, concepts, propositions, types, and possible worlds, among\nothers, is ubiquitous in different areas of philosophy.\n\nThough there is a pervasive appeal to abstract objects, philosophers\nhave nevertheless wondered whether they exist. The alternatives are:\nplatonism, which endorses their existence, and\nnominalism, which denies the existence of abstract objects\nacross the board. (See the entries on\n nominalism in metaphysics\n and\n platonism in metaphysics.)\n But the question of how to draw the distinction between abstract and\nconcrete objects is an open one: it is not clear how one should\ncharacterize these two categories nor is there a definite list of\nitems that fall under one or the other category (assuming neither is\nempty).\n\nThe first challenge, then, is to articulate the distinction, either by\ndefining the terms explicitly or by embedding them in a theory that\nmakes their connections to other important categories more explicit.\nIn the absence of such an account, the philosophical significance of\nthe contrast remains uncertain, for the attempt to classify things as\nabstract or concrete by appeal to intuition is often problematic. Is\nit clear that scientific theories (e.g., the general theory of\nrelativity), works of fiction (e.g., Dante’s Inferno),\nfictional characters (e.g., Bilbo Baggins) or conventional entities\n(e.g., the International Monetary Fund or the Spanish Constitution of\n1978) are abstract?\n\nIt should be stressed that there may not be one single\n“correct” way of explaining the abstract/concrete\ndistinction. Any plausible account will classify the paradigm cases in\nthe standard way or give reasons for proceeding otherwise, and any\ninteresting account will draw a clear and philosophically significant\nline in the domain of objects. Yet there may be many equally\ninteresting ways of accomplishing these two goals, and if we find\nourselves with two or more accounts that do the job rather well, there\nmay be no point in asking which corresponds to the real\nabstract/concrete distinction. This illustrates a general point: when\ntechnical terminology is introduced in philosophy by means of\nexamples, but without explicit definition or theoretical elaboration,\nthe resulting vocabulary is often vague or indeterminate in reference.\nIn such cases, it usually is pointless to seek a single correct\naccount. A philosopher may find herself asking questions like,\n‘What is idealism?’ or ‘What is a substance?’\nand treating these questions as difficult questions about the\nunderlying nature of a certain determinate philosophical category. A\nbetter approach may be to recognize that in many cases of this sort,\nwe simply have not made up our minds about how the term is to be\nunderstood, and that what we seek is not a precise account of what\nthis term already means, but rather a proposal for how it\nmight fruitfully be used for philosophical analysis. Anyone who\nbelieves that something in the vicinity of the abstract/concrete\ndistinction matters for philosophy would be well advised to approach\nthe project of explaining the distinction with this in mind.\n\nSo before we turn to the discussion of abstract objects in earnest, it\nwill help if we clarify how some of the key terms will be used in what\nfollows.\n1.1 About the Expression ‘Object’\n\nFrege famously distinguished two mutually exclusive ontological\ndomains, functions and objects. According to his\nview, a function is an ‘incomplete’ entity that maps\narguments to values, and is denoted by an incomplete expression,\nwhereas an object is a ‘complete’ entity and can be\ndenoted by a singular term. Frege reduced properties and relations to\nfunctions and so these entities are not included among the objects.\nSome authors make use of Frege’s notion of ‘object’\nwhen discussing abstract objects (e.g., Hale 1987). But though\nFrege’s sense of ‘object’ is important, it is not\nthe only way to use the term. Other philosophers include properties\nand relations among the abstract objects. And when the background\ncontext for discussing objects is type theory, properties and\nrelations of higher type (e.g., properties of properties, and\nproperties of relations) may be all be considered\n‘objects’. This latter use of ‘object’ is\ninterchangeable with\n ‘entity.’[1]\n Throughout this entry, we will follow this last usage and treat the\nexpressions ‘object’ and ‘entity’ as having\nthe same meaning. (For further discussion, see the entry on\n objects.)\n1.2 About the Abstract/Concrete Distinction\n\nThough we’ve spoken as if the abstract/concrete distinction must\nbe an exhaustive dichotomy, we should be open to the possibility that\nthe best sharpening of it will entail that some objects are neither\nabstract nor concrete. Holes and shadows, if they exist, do not\nclearly belong in either category; nor do ghosts, Cartesian minds,\nfictional\n characters,[2]\n immanent universals, or tropes. The main constraint on an account of\nthe distinction is that it draws a philosophically significant line\nthat classifies at least many of the standard examples in the standard\nways. It is not a constraint that everything be shoehorned into one\ncategory or the other.\n\nFinally, some philosophers see the main distinction not as between\nabstract and concrete objects but as between abstract objects and\nordinary objects, where the distinction is a modal one\n– ordinary objects are possibly concrete while abstract objects\n(like the number 1) couldn’t be concrete (Zalta 1983,\n1988). In any case, in the following discussion, we shall assume that\nthe abstract/concrete distinction is a division among existing\nobjects, and that any plausible explanation of the distinction should\naim to characterize a distinction among such objects.\n2. Historical Remarks\n2.1 The Provenance of the Distinction\n\nThe contemporary distinction between abstract and concrete is not an\nancient one. Indeed, there is a strong case for the view that, despite\noccasional exceptions, it played no significant role in philosophy\nbefore the 20th century. The modern distinction bears some resemblance\nto Plato’s distinction between Forms and Sensibles. But\nPlato’s Forms were supposed to be causes par\nexcellence, whereas abstract objects are generally supposed to be\ncausally inert. The original\n‘abstract’/‘concrete’ distinction was a\ndistinction among words or terms. Traditional grammar distinguishes\nthe abstract noun ‘whiteness’ from the concrete noun\n‘white’ without implying that this linguistic contrast\ncorresponds to a metaphysical distinction in what these words stand\nfor. In the 17th century, this grammatical distinction was transposed\nto the domain of ideas. Locke speaks of the general idea of a triangle\nwhich is “neither Oblique nor Rectangle, neither Equilateral,\nEquicrural nor Scalenon [Scalene]; but all and none of these at\nonce,” remarking that even this idea is not among the most\n“abstract, comprehensive and difficult” (Essay,\nIV.vii.9). Locke’s conception of an abstract idea as one that is\nformed from concrete ideas by the omission of distinguishing detail\nwas immediately rejected by Berkeley and then by Hume. But even for\nLocke there was no suggestion that the distinction between abstract\nideas and concrete or particular ideas corresponds to a distinction\namong objects. “It is plain, …” Locke\nwrites, “that General and Universal, belong not to the real\nexistence of things; but are Inventions and Creatures of the\nUnderstanding, made by it for its own use, and concern only signs,\nwhether Words or Ideas” (III.iii.11).\n\nThe abstract/concrete distinction in its modern form is meant to mark\na line in the domain of objects or entities. So conceived, the\ndistinction becomes a central focus for philosophical discussion\nprimarily in the 20th century. The origins of this development are\nobscure, but one crucial factor appears to have been the breakdown of\nthe allegedly exhaustive distinction between mental and material\nobjects, which had formed the main division for ontologically-minded\nphilosophers since Descartes. One signal event in this development is\nFrege’s insistence that the objectivity and aprioricity of the\ntruths of mathematics entail that numbers are neither material beings\nnor ideas in the mind. If numbers were material things (or properties\nof material things), the laws of arithmetic would have the status of\nempirical generalizations. If numbers were ideas in the mind, then the\nsame difficulty would arise, as would countless others. (Whose mind\ncontains the number 17? Is there one 17 in your mind and another in\nmine? In that case, the appearance of a common mathematical subject\nmatter would be an illusion.) In The Foundations of\nArithmetic (1884), Frege concludes that numbers are neither\nexternal concrete things nor mental entities of any sort.\n\nLater, in his essay “The Thought” (1918), Frege claims the\nsame status for the items he calls thoughts—the senses\nof declarative sentences—and also, by implication, for their\nconstituents, the senses of subsentential expressions. Frege does not\nsay that senses are abstract. He says that they belong to a\nthird realm distinct both from the sensible external world\nand from the internal world of consciousness. Similar claims had been\nmade by Bolzano (1837), and later by Brentano (1874) and his pupils,\nincluding Meinong and Husserl. The common theme in these developments\nis the felt need in semantics and psychology, as well as in\nmathematics, for a class of objective (i.e., non-mental) non-physical\nentities. As this new realism was absorbed into\nEnglish-speaking philosophy, the traditional term\n‘abstract’ was enlisted to apply to the denizens of this\nthird realm. In this vein, Popper (1968) spoke of the\n‘third world’ of abstract, objective entities, in the\nbroader sense that includes cultural products such as arguments,\ntheories, and works of art.\n\nAs we turn to an overview of the current debate, it is therefore\nimportant to remember that the use of the terms platonist\n(for those who affirm the existence of abstract objects) and\nnominalist (for those who deny existence) is somewhat\nlamentable, since these words have established senses in the history\nof philosophy. These terms stood for positions that have little to do\nwith the modern notion of an abstract object. Modern platonists (with\na small ‘p’) need not accept any of the distinctive\nmetaphysical and epistemological doctrines of Plato, just as modern\nnominalists need not accept the distinctive doctrines of the medieval\nnominalists. Moreover, the literature also contains mention of\nanti-platonists, many of whom see themselves as\nfictionalists about abstracta, though this doesn’t help\nif it turns out that the best analysis of fictions is to regard them\nas abstract objects. So the reader should therefore be aware that\nterminology is not always well-chosen and that the terms so used\nsometimes stand for doctrines that are more restricted than the\ntraditional doctrines that go by the same name. Henceforth, we simply\nuse platonism for the thesis that there exists at least one\nabstract object, and nominalism for the thesis that the\nnumber of abstract objects is exactly zero (Field 1980).\n2.2 An Initial Overview of the Contemporary Debate\n\nBefore we survey the various proposals for drawing the\nabstract/concrete distinction, we should briefly say why the\ndistinction has been thought to matter. Among philosophers who take\nthe distinction seriously, it is generally supposed that while\nconcrete objects clearly exist, abstract entities are problematic in\ndistinctive ways and deny the existence of abstract entities\naltogether. In this section we briefly survey the arguments for\nnominalism and the responses that platonists have offered. If the\nabstract objects are unified as a class, it is because they have some\nfeature that generates what seems to be a distinctive problem—a\nproblem that nominalists deem unsolvable and which platonists aim to\nsolve. Before we ask what the unifying feature might be, it may\ntherefore help to characterize the various problems it has been\nthought to generate.\n\nThe contemporary debate about platonism developed in earnest when\nQuine argued (1948) that mathematical objects exist, having changed\nhis mind about the nominalist approach he had defended earlier\n(Goodman & Quine 1947). Quine’s 1948 argument involves\nthree key premises, all of which exerted significant influence on the\nsubsequent debate: (i) mathematics is indispensable for empirical\nscience; (ii) we should be ontologically committed to the entities\nrequired for the truth of our best empirical theories (all of which\nshould be expressible in a first-order language); and (iii) the\nentities required for the truth on an empirical theory are those in\nthe range of the variables bounded by its first-order quantifiers\n(i.e., the entities in the domain of the existential quantifier\n‘\\(\\exists x\\)’ and the universal quantifier\n‘\\(\\forall x\\)’). He concluded that in addition to the\nconcrete entities contemplated by our best empirical science, we must\naccept the existence of mathematical entities, even if they are\nabstract (see also Quine 1960, 1969, 1976).\n\nQuine’s argument initiated a debate that is still alive. Various\nnominalist responses questioned one or another of the premises in his\nargument. For instance, Field (1980) challenged the idea that\nmathematics is indispensable for our best scientific\ntheories—i.e., rejecting (i) above—and thus faced the task\nof rewriting classical and modern physics in nominalistic terms in\norder to sustain the challenge. Others have taken on the somewhat less\ndaunting task of accepting (i) but rejecting (ii) and (iii);\nthey’ve argued that even if our best scientific theories, in\nregimented form, quantify over mathematical entities, this\ndoesn’t entail a commitment to mathematical entities (see\nAzzouni 1997a, 1997b, 2004; Balaguer 1996, 1998; Maddy 1995, 1997;\nMelia 2000, 2002; Yablo 1998, 2002, 2005, 2009; Leng 2010.) Colyvan\n(2010) coined the expression ‘easy-roaders’ for this\nsecond group, since they avoided the ‘hard road’ of\nparaphrasing our best scientific theories in non-mathematical\nterms.\n\nBy contrast, some mathematical platonists (Colyvan 2001; Baker 2005,\n2009) have refined Quine’s view by advancing the so-called\n‘Enhanced Indispensability Argument’ (though see Saatsi\n2011 for a response). Some participants describe the debate in terms\nof a stalemate they hope to resolve (see Baker 2017, Baron 2016, 2020,\nKnowles & Saatsi 2019, and Martínez-Vidal\n& Rivas-de-Castro 2020, for\n discussion).[3]\n\n\nAside from the debate over Quine’s argument, both platonism and\nnominalism give rise to hard questions. Platonists not only need to\nprovide a theory of what abstract objects exist, but also an account\nof how we cognitively access and come to know non-causal, abstract\nentities. This latter question has been the subject of a debate that\nbegan in earnest in Benacerraf (1973), which posed just such a dilemma\nfor mathematical objects. Benacerraf noted that the causal theory of\nreference doesn’t seem to make it possible to know the truth\nconditions of mathematical statements, and his argument applies to\nabstract entities more generally. On the other hand, nominalists need\nto explain the linguistic uses in which we seem to appeal to such\nentities, especially those uses in what appear to be good\nexplanations, such as those in scientific, mathematical, linguistic,\nand philosophical pursuits (see Wetzel 2009, 1–22, for a\ndiscussion of the many places where abstract types are used\nin scientific explanations). Even though nominalists argue that there\nare no abstracta, the very fact that there is disagreement about their\nexistence suggests that both platonists and nominalists acknowledge\nthe distinction between the abstract and concrete to be a meaningful\none.\n\nOn the platonist side, various proposals have been raised to address\nthe challenge of explaining epistemic access to abstract entities,\nmostly in connection with mathematical objects. Some, including\nGödel (1964), allege that we access abstract objects in virtue of\na unique kind of perception (intuition). Maddy (1990, 1997) developed\ntwo rather different ways of understanding our knowledge of\nmathematics in naturalistic ways. Other platonists have argued that\nabstract objects are connected to empirical entities, either via\nabstraction (Steiner 1975; Resnik 1982; Shapiro 1997) or via\nabstraction principles (Wright 1983; Hale 1987); we’ll discuss\nsome of these views below. There are also those who speak of existent\nand intersubjective abstract entities as a kind of mental\nrepresentation (Katz 1980).\n\nA rather different line of approach to the epistemological problem was\nproposed in Linsky & Zalta 1995, where it is suggested that\none shouldn’t attempt to explain knowledge of abstracta on the\nsame model that is used to explain knowledge of concrete objects. They\nargue that not only a certain plenitude principle for abstract objects\n(namely, the comprehension principle for abstract objects put forward\nin Zalta 1983, 1988—see below) yields unproblematic\n‘acquaintance by description’ to unique abstract objects\nbut also that their approach actually comports with naturalist\nbeliefs. Balaguer (1995, 1998) also suggests that a plenitude\nprinciple is the best way forward for the platonist, and that our\nknowledge of the consistency of mathematical theories suffices for\nknowledge of mathematical objects. And there are views that conceive\nof abstract objects as constituted by human—or, in general,\nintelligent—subjects, or as abstract artifacts (see Popper 1968;\nThomasson 1999).\n\nA number of nominalists have been persuaded by Benacerraf’s\n(1973) epistemological challenge about reference to abstract objects\nand concluded that sentences with terms making apparent reference to\nthem—such as mathematical statements—are either false or\nlack a truth value. They argue that those sentences must be\nparaphrasable without vocabulary that commits one to any sort of\nabstract entity. These proposals sometimes suggest that statements\nabout abstract objects are merely instrumental; they serve only to\nhelp us establish conclusions about concrete objects. Field’s\nfictionalism (1980, 1989) has been influential in this\nregard. Field reconstructed Newtonian physics using second-order logic\nand quantification over (concrete) regions of space-time. A completely\ndifferent tactic for avoiding the commitment to abstract, mathematical\nobjects is put forward in Putnam (1967) and Hellman (1989), who\nseparately reconstructed various mathematical theories in second-order\nmodal logic. On their view, abstract objects aren’t in\nthe range of the existential quantifier at the actual world (hence, we\ncan’t say that they exist), but they do occur in the range of\nthe quantifier at other possible worlds, where the axioms of the\nmathematical theory in question are true.\n\nThese nominalistic approaches must contend with various issues, of\ncourse. At the very least, they have to successfully argue that the\ntools they use to avoid commitments to abstract objects don’t\nthemselves involve such commitment. For example, Field must argue that\nspace-time regions are concrete entities, while Putnam and Hellman\nmust argue that by relying on logical possibility and modal logic,\nthere is no commitment to possible worlds considered as abstract\nobjects. In general, any nominalist account that makes essential use\nof set theory or model-theoretic structures must convincingly argue\nthat the very use of such analytic tools doesn’t commit them to\nabstract objects. (See Burgess & Rosen 1997 for a systematic\nsurvey of different proposals about the existence of abstract\nobjects.)\n\nAnother nominalistic thread in the literature concerns the suggestion\nthat sentences about (posited) abstract objects are quasi-assertions,\ni.e., not evaluable as to truth or falsehood (see Yablo 2001 and\nKalderon 2005). Still others argue that we should not believe\nsentences about abstracta since their function, much like the\ninstrumentalism discussed earlier, is to ensure empirical adequacy for\nobservational sentences (Yablo 1998). This may involve differentiating\nbetween apparent content, which involves posited abstract objects, and\nreal content, which only concerns concrete objects (Yablo 2001, 2002,\n2010, 2014). (For more on these fictionalist accounts, see Kalderon\n2005, Ch. 3, and the entry on\n fictionalism.)\n\nA final group of views in the literature represents a kind of\nagnosticism about what exists or about what it is to be an object, be\nit abstract or concrete. These views don’t reject an external\nmaterial world, but rather begin with some question as to whether we\ncan have experience, observation, and knowledge of objects directly,\ni.e., independent of our theoretical frameworks. Carnap (1950 [1956]),\nfor example, started with the idea that our scientific knowledge has\nto be expressed with respect to a linguistic framework and that when\nwe wish to put forward a theory about a new kind of entity, we must\nhave a linguistic framework for talking about those entities. He then\ndistinguished two kinds of existence questions: internal questions\nwithin the framework about the existence of the new entities\nand external questions about the reality of the framework itself. If\nthe framework deals with abstract entities such as numbers, sets,\npropositions, etc., then the internal question can be answered by\nlogical analysis of the rules of the language, such as whether it\nincludes terms for, or implies claims that quantify over, abstract\nobjects. But, for Carnap, the external question, about whether the\nabstract entities really exist, is a pseudo-question and should be\nregarded as nothing more than the pragmatic question of whether the\nframework is a useful one to adopt, for scientific or other forms of\nenquiry. We’ll discuss Carnap’s view in more detail in\n subsection 3.7.1.\n\nSome have thought that Carnap’s view offers a\ndeflationist view of objects, since it appears that the\nexistence of objects is not language independent. After Carnap’s\nseminal article, several other deflationist approaches were put\nforward (Putnam 1987, 1990; Hirsch 2002, 2011; Sider 2007, 2009;\nThomasson 2015), many of them claiming to be a vindication of\nCarnap’s view. However, there are deflationist proposals that\nrun counter to Carnap’s approach, among them, deflationary\nnominalism (Azzouni 2010) or agnosticism about abstract objects (Bueno\n2008a, 2008b, 2020). Additionally, philosophers inspired by\nFrege’s work have argued for a minimal notion of an object (Rayo\n2013, Rayo 2020 [Other Internet Resources]; and Linnebo\n2018). We’ll discuss some of these in greater detail below, in\nsubsection 3.7.2.  A final agnostic\nposition that has emerged is one that rejects a strict version of\nplatonism, but suggests that neither a careful analysis of\nmathematical practice (Maddy 2011), nor the enhanced version of the\nindispensability argument (Leng 2020) suffice to decide between\nnominalism and moderate versions of platonism. Along these lines,\nBalaguer (1998) concluded that the question doesn’t have an\nanswer, since the arguments for ‘full-blooded’ platonism\ncan be matched one-for-one by equally good arguments by the\nanti-platonist.\n\nFor additional discussion about the basic positions in the debate\nabout abstract and concrete objects, see Szabó 2003 and the\nentries on\n nominalism in metaphysics\n and\n platonism in metaphysics,\n nominalism in the philosophy of mathematics and\n platonism in the philosophy of mathematics.\n3. What is an Abstract Object?\n\nAs part of his attempt to understand the nature of possible worlds,\nLewis (1986a, 81–86) categorizes different ways by which one can\ndraw the abstract/concrete\n distinction.[4]\n These include: the way of example (which is simply to list\nthe paradigm cases of abstract and concrete objects in the hope that\nthe sense of the distinction will somehow emerge); the way of\nconflation (i.e., identifying abstract and concrete objects with\nsome already-known distinction); the way of negation (i.e.,\nsaying what abstract objects are by saying what they are not, e.g.,\nnon-spatiotemporal, non-causal, etc.); and the\nway of abstraction (i.e., saying that abstract objects are\nconceptualized by a process of considering some known objects and\nomitting certain distinguishing features). He gives a detailed\nexamination of the different proposals that typify these ways and then\nattempts to show that none of them quite succeeds in classifying the\nparadigms in accord with prevailing usage. Given the problems he\nencountered when analyzing the various ways, Lewis became pessimistic\nabout our ability to draw the distinction cleanly.\n\nDespite Lewis’s pessimism about clarifying the abstract/concrete\ndistinction, his approach for categorizing the various proposals, when\nextended, is a useful one. Indeed, in what follows, we’ll see\nthat there are a number of additional ways that categorize\nattempts to characterize the abstract/concrete distinction and\ntheorize about abstract objects. Even if there is no single,\nacceptable account, these various ways of drawing the distinction and\ntheorizing about abstract objects do often cast light on the questions\nwe’ve been discussing, especially when the specific proposals\nare integrated into a supplementary (meta-)ontological project. For\neach method of drawing the distinction and specific proposal adopting\nthat method acquires a certain amount of explanatory power, and this\nwill help us to compare and contrast the various ideas that are now\nfound in the literature.\n3.1 The Way of Example and the Way of Primitivism\n\nAccording to the way of example, it suffices to list paradigm\ncases of abstract and concrete entities in the hope that the sense of\nthe distinction will somehow emerge. Clearly, a list of examples for\neach category would be a heuristically promising start in the search\nfor some criterion (or list of criteria) that would be fruitful for\ndrawing the distinction. However, a simple list would be of limited\nsignificance since there are too many ways of extrapolating from the\nparadigm cases to a distinction that would cover the unclear cases,\nwith the result that no clear notion has been explained.\n\nFor example, pure sets are paradigm examples of abstract entities. But\nthe case of impure sets is far from clear. Consider the unit set whose\nsole member is Joe Biden (i.e., {Joe Biden}), the Undergraduate Class\nof 2020 or The Ethics Committee, etc. They are sets, but it is not\nclear that they are abstract given that Joe Biden, the members of the\nclass and committee are concrete. Similarly, if one offers the\ncharacters of Sherlock Holmes stories as examples to help motivate the\nprimitive concept abstract object, then one has to wonder about the\nobject London that appears in the novels.\n\nThe refusal to characterize the abstract/concrete distinction while\nmaintaining that both categories have instances might be called the\nway of primitivism, whenever the following condition obtains:\na few predicates are distinguished as primitive and unanalyzable, and\nthe explanatory power rests on the fact that other interesting\npredicates can be defined in terms of the primitives and that\ninteresting claims can be judged true on the basis of our intuitive\nunderstanding of the primitive and defined notions. Thus, one might\ntake abstract and concrete as primitive notions. It wouldn’t be\nan insignificant result if one could use this strategy to explain why\nabstract objects are necessarily existent, causally ineffiacious,\nnon-spatiotemporal, intersubjective, etc. (see Cowling 2017:\n92–97).\n\nBut closer inspection of this method reveals some significant\nconcerns. To start with, when a distinction is taken as basic and\nunanalyzable, one typically has to offer some intuitive instances of\nthe primitive predicates. But it is not always so easy to do this. For\nexample, when mathematicians take set and membership\nas primitives and then assert some principles of set theory, they\noften illustrate their primitives by offering some examples of sets,\nsuch as The Undergraduate Class of 2020 or The Ethics Committee, etc.\nBut these, of course, aren’t quite right, since the members of\nthe class and committee may change while the class and committee\nremain the same, whereas if the members of a set change, one has a\ndifferent set. A similar concern affects the present proposal. If one\noffers sets or the characters of the Sherlock Holmes novels as\nexamples to help motivate the primitive concept abstract\nobject, then one has to wonder about impure sets such as the unit\nset whose sole member is Aristotle (i.e., \\(\\{\\textrm{Aristotle}\\}\\))\nand the object London that appears in the novels.\n3.2 The Way of Conflation\n\nAccording to the way of conflation, the abstract/concrete\ndistinction is to be identified with one or another metaphysical\ndistinction already familiar under another name: as it might be, the\ndistinction between sets and individuals, or the distinction between\nuniversals and particulars. There is no doubt that some authors have\nused the terms in this way. (Thus Quine 1948 uses ‘abstract\nentity’ and ‘universal’ interchangeably.) This sort\nof conflation is however rare in recent philosophy.\n3.3 The Way of Abstraction\n\nAnother methodology is what Lewis calls the way of\nabstraction. According to a longstanding tradition in\nphilosophical psychology, abstraction is a distinctive mental process\nin which new ideas or conceptions are formed by considering the common\nfeatures of several objects or ideas and ignoring the irrelevant\nfeatures that distinguish those objects. For example, if one is given\na range of white things of varying shapes and sizes; one ignores or\nabstracts from the respects in which they differ, and thereby\nattains the abstract idea of whiteness. Nothing in this tradition\nrequires that ideas formed in this way represent or correspond to a\ndistinctive kind of object. But it might be maintained that the\ndistinction between abstract and concrete objects should be explained\nby reference to the psychological process of abstraction or something\nlike it. The simplest version of this strategy would be to say that an\nobject is abstract if it is (or might be) the referent of an abstract\nidea; i.e., an idea formed by abstraction. So conceived, the way\nof abstraction is wedded to an outmoded philosophy of mind.\n\nIt should be mentioned, though, that the key idea behind the way\nof abstraction has resurfaced (though transformed) in the\nstructuralist views about mathematics that trace back to Dedekind.\nDedekind thought of numbers by the way of abstraction.\nDedekind suggested that when defining a number-theoretic structure,\n“we entirely neglect the special character of the elements,\nmerely retaining their distinguishability and taking into account only\nthe relations to one another” (Dedekind 1888 [1963, 68]). This\nview has led some structuralists to deny that numbers are abstract\nobjects. For example, Benacerraf concluded that “numbers are not\nobjects at all, because in giving the properties (that is, necessary\nand sufficient) of numbers you merely characterize an abstract\nstructure—and the distinction lies in the fact that the\n‘elements’ of the structure have no properties other than\nthose relating them to other ‘elements’ of the same\nstructure” (1965, 70). We shall therefore turn our attention to\na variant of the way of abstraction, one that has led a\nnumber of philosophers to conclude that numbers are indeed abstract\nobjects.\n3.4 The Way of Abstraction Principles\n\nIn the contemporary philosophical literature, a number of books and\npapers have investigated a form of abstraction that doesn’t\ndepend on mental processes. We may call this the way of\nabstraction principles. Wright (1983) and Hale (1987) have\ndeveloped an account of abstract objects on the basis of an idea they\ntrace back to certain suggestive remarks in Frege (1884). Frege notes\n(in effect) that many of the singular terms that appear to refer to\nabstract entities are formed by means of functional expressions. We\nspeak of the shape of a building, the direction of a\nline, the number of books on the shelf. Of course, many\nsingular terms formed by means of functional expressions denote\nordinary concrete objects: ‘the father of Plato’,\n‘the capital of France’. But the functional terms that\npick out abstract entities are distinctive in the following respect:\nwhere \\(f(a)\\) is such an expression, there is typically an equation\nof the form:\n\n\\[\nf(a)\\! =\\! f(b) \\text{ if and only if } Rab\n\\]\n\n\nwhere \\(R\\) is an equivalence relation, i.e., a relation that is\nreflexive, symmetric and transitive, relative to some domain. For\nexample:\n\nThe direction of \\(a\\) = the direction of \\(b\\) if and only if \\(a\\)\nis parallel to \\(b\\)\n\nThe number of \\(F\\text{s}\\) = the number of \\(G\\text{s}\\) if and only\nif there are just as many \\(F\\text{s}\\) as \\(G\\text{s}\\)\n\nThese biconditionals (or abstraction principles) appear to\nhave a special semantic status. While they are not strictly speaking\ndefinitions of the functional expression that occurs on the\nleft hand side, they would appear to hold in virtue of the meaning of\nthat expression. To understand the term ‘direction’ is (in\npart) to know that the direction of \\(a\\) and the direction of \\(b\\)\nare the same entity if and only if the lines \\(a\\) and \\(b\\) are\nparallel. Moreover, the equivalence relation that appears on the right\nhand side of the biconditional would appear to be semantically and\nperhaps epistemologically prior to the functional expressions on the\nleft (Noonan 1978). Mastery of the concept of a direction presupposes\nmastery of the concept of parallelism, but not vice versa.\n\nThe availability of abstraction principles meeting these conditions\nmay be exploited to yield an account of the distinction between\nabstract and concrete objects. When ‘\\(f\\)’ is a\nfunctional expression governed by an abstraction principle, there will\nbe a corresponding kind \\(K_{f}\\) such that:\n\n\\(x\\) is a \\(K_{f}\\) if and only if, for some \\(y\\), \\(x\\! =\\!\nf(y)\\).\n\nFor example,\n\n\\(x\\) is a cardinal number if and only if for some concept \\(F\\),\n\\(x\\) = the number of \\(F\\text{s}\\).\n\nThe simplest version of the way of abstraction principles is\nthen to say that:\n\n\\(x\\) is an abstract object if (and only if) \\(x\\) is an instance of\nsome kind \\(K_{f}\\) whose associated functional expression\n‘\\(f\\)’ is governed by a suitable abstraction\nprinciple.\n\nThe strong version of this account—which purports to identify a\nnecessary condition for abstractness—is seriously at odds with\nstandard usage. Pure sets are usually considered paradigmatic abstract\nobjects. But it is not clear that they satisfy the proposed criterion.\nAccording to a version of naïve set theory, the functional\nexpression ‘set of’ is indeed characterized by a\nputative abstraction principle.\n\nThe set of \\(F\\text{s}\\) = the set of \\(G\\text{s}\\) if and only if,\nfor all \\(x\\), \\(x\\) is \\(F\\) if and only if \\(x\\) is \\(G\\).\n\nBut this principle, which is a version of Frege’s Basic Law V,\nis inconsistent and so fails to characterize an interesting concept.\nIn contemporary mathematics, the concept of a set is not introduced by\nan abstraction principle, but rather axiomatically. Though attempts\nhave been made to investigate abstraction principles for sets (Cook\n2003), it remains an open question whether something like the\nmathematical concept of a set can be characterized by a suitably\nrestricted abstraction principle. (See Burgess 2005 for a survey of\nrecent efforts in this direction.) Even if such a principle is\navailable, however, it is unlikely that the epistemological priority\ncondition will be satisfied. That is, it is unlikely that mastery of\nthe concept of set will presuppose mastery of the equivalence relation\nthat figures on the right hand side. It is therefore uncertain whether\nthe way of abstraction principles will classify the objects\nof pure set theory as abstract entities (as it presumably must).\n\nOn the other hand, as Dummett (1973) has noted, in many cases the\nstandard names for paradigmatically abstract objects do not assume the\nfunctional form to which the definition adverts. Chess is an abstract\nentity, but we do not understand the word ‘chess’ as\nsynonymous with an expression of the form ‘\\(f(x)\\)’,\nwhere ‘\\(f\\)’ is governed by an abstraction principle.\nSimilar remarks would seem to apply to such things as the English\nlanguage, social justice, architecture, and Charlie Parker’s\nmusical style. If so, the abstractionist approach does not provide a\nnecessary condition for abstractness as that notion is standardly\nunderstood.\n\nMore importantly, there is some reason to believe that it fails to\nsupply a sufficient condition. A mereological fusion of\nconcrete objects is itself a concrete object. But the concept of a\nmereological fusion is governed by what appears to be an abstraction\nprinciple:\n\nThe fusion of the \\(F\\text{s}\\) = the fusion of the \\(G\\text{s}\\) if\nand only if the \\(F\\text{s}\\) and \\(G\\text{s}\\) cover one\nanother,\n\nwhere the \\(F\\text{s}\\) cover the \\(G\\text{s}\\) if and only\nif every part of every \\(G\\) has a part in common with an \\(F\\).\nSimilarly, suppose a train is a maximal string of railroad carriages,\nall of which are connected to one another. We may define a functional\nexpression, ‘the train of \\(x\\)’, by means of an\n‘abstraction’ principle: The train of \\(x\\) = the train of\n\\(y\\) if and only if \\(x\\) and \\(y\\) are connected carriages. We may\nthen say that \\(x\\) is a train if and only if for some carriage \\(y\\),\n\\(x\\) is the train of \\(y\\). The simple account thus yields the\nconsequence that trains are to be reckoned abstract entities.\n\nIt is unclear whether these objections apply to the more sophisticated\nabstractionist proposals of Wright and Hale, but one feature of the\nsimple account sketched above clearly does apply to these proposals\nand may serve as the basis for an objection to this version of the\nway of abstraction principles. The neo-Fregean approach seeks\nto explain the abstract/concrete distinction in semantic\nterms: We said that an abstract object is an object that falls in the\nrange of a functional expression governed by an abstraction principle,\nwhere ‘\\(f\\)’ is governed by an abstraction\nprinciple when that principle holds in virtue of the meaning\nof ‘\\(f\\)’. This notion of a statement’s holding in\nvirtue of the meaning of a word is notoriously problematic (see the\nentry\n the analytic/synthetic distinction).\n But even if this notion makes sense, one may still complain: The\nabstract/concrete distinction is supposed to be a metaphysical\ndistinction; abstract objects are supposed to differ from concrete\nobjects in some important ontological respect. It should be possible,\nthen, to draw the distinction directly in metaphysical terms: to say\nwhat it is in the objects themselves that makes some things\nabstract and others concrete. As Lewis writes, in response to a\nrelated proposal by Dummett:\n\n\nEven if this … way succeeds in drawing a border, as for all I know\nit may, it tells us nothing about how the entities on opposite sides\nof that border differ in their nature. It is like saying that snakes\nare the animals that we instinctively most fear—maybe so, but it\ntells us nothing about the nature of snakes. (Lewis 1986a: 82)\n\n\nThe challenge is to produce a non-semantic version of the\nabstractionist criterion that specifies directly, in metaphysical\nterms, what the objects whose canonical names are governed by\nabstraction principles all have in common.\n\nOne response to this difficulty is to transpose the abstractionist\nproposal into a more metaphysical key (see Rosen & Yablo\n2020). The idea is that each Fregean number is, by its very\nnature, the number of some Fregean concept, just as each Fregean\ndirection is, by its very nature, at least potentially the\ndirection of some concrete line. In each case, the abstract object is\nessentially the value of an abstraction function for a\ncertain class of arguments. This is not a claim about the meanings of\nlinguistic expressions. It is a claim about the essences or natures of\nthe objects themselves. (For the relevant notion of essence, see Fine\n1994.) So for example, the Fregean number two (if there is such a\nthing) is, essentially, by its very nature, the number that belongs to\na concept \\(F\\) if and only if there are exactly two \\(F\\text{s}\\).\nMore generally, for each Fregean abstract object \\(x\\), there is an\nabstraction function \\(f\\), such that \\(x\\) is essentially the value\nof \\(f\\) for every argument of a certain kind.\n\nAbstraction functions have two key features. First, for each\nabstraction function \\(f\\) there is an equivalence relation \\(R\\) such\nthat it lies in the nature of \\(f\\) that \\(f(x)\\! =\\! f(y)\\) iff\n\\(Rxy\\). Intuitively, we are to think that \\(R\\) is metaphysically\nprior to \\(f\\), and that the abstraction function \\(f\\) is\ndefined (in whole or in part) by this biconditional. Second,\neach abstraction function is a generating function: its\nvalues are essentially values of that function. Many functions are not\ngenerating functions. Paris is the capital of France, but it is not\nessentially a capital. The number of solar planets, by contrast, is\nessentially a number. The notion of an abstraction function may be\ndefined in terms of these two features:\n\n\\(f\\) is an abstraction function if and only if\n\n\n\nfor some equivalence relation \\(R\\), it lies in the nature of \\(f\\)\nthat \\(f(x)\\! =\\! f(y)\\) if and only if \\(Rxy\\); and\n\nfor all \\(x\\), if \\(x\\) is a value of \\(f\\), then it lies in the\nnature of \\(x\\) that there is (or could be) some object \\(y\\) such\nthat \\(x\\! =\\! f(y)\\).\n\n\n\nWe may then say that:\n\n\\(x\\) is an abstraction if and only if, for some abstraction\nfunction \\(f\\), there is or could be an object \\(y\\) such that \\(x\\!\n=\\! f(y)\\),\n\nand that:\n\n\\(x\\) is an abstract object if (and only if) \\(x\\) is an\nabstraction.\n\nThis account tells us a great deal about the distinctive natures of\nthese broadly Fregean abstract objects. It tells us that each is, by\nits very nature, the value of a special sort of function, one whose\nnature is specified in a simple way in terms of an associated\nequivalence relation. It is worth stressing, however, that it does not\nsupply much metaphysical information about these items. It\ndoesn’t tell us whether they are located in space, whether they\ncan stand in causal relations, and so on. It is an open question\nwhether this somewhat unfamiliar version of the abstract/concrete\ndistinction lines up with any of the more conventional ways of drawing\nthe distinction outlined above. An account along these lines would be\nat odds with standard usage, but may be philosophically interesting\nall the same. In any case, the problem remains that this metaphysical\nversion of the way of abstraction principles leaves out\nparadigmatic cases of abstract objects such as the aforementioned game\nof chess.\n3.5 The Ways of Negation\n\nAccording to the way of negation, abstract objects are\ndefined as those which lack certain features possessed by\nparadigmatic concrete objects. Many explicit characterizations in the\nliterature follow this model. Let us review some of the options.\n3.5.1 The Combined Criterion of Non-Mental and Non-Sensible\n\nAccording to the account implicit in Frege’s writings:\n\nAn object is abstract if and only if it is both non-mental and\nnon-sensible.\n\nHere the first challenge is to say what it means for a thing to be\n‘non-mental’, or as we more commonly say,\n‘mind-independent’. The simplest approach is to say that a\nthing depends on the mind when it would not (or could not) have\nexisted if minds had not existed. But this entails that tables and\nchairs are mind-dependent, and that is not what philosophers who\nemploy this notion have in mind. To call an object\n‘mind-dependent’ in a metaphysical context is to suggest\nthat it somehow owes its existence to mental activity, but not in the\nboring ‘causal’ sense in which ordinary artifacts owe\ntheir existence to the mind. What can this mean? One promising\napproach is to say that an object should be reckoned mind-dependent\nwhen, by its very nature, it exists at a time if and only if\nit is the object or content of some mental state or process at\nthat time. This counts tables and chairs as mind-independent,\nsince they might survive the annihilation of thinking things. But it\ncounts paradigmatically mental items, like a purple afterimage of\nwhich a person \\(X\\) may become aware, as mind-dependent, since it\npresumably lies in the nature of such items to be objects of conscious\nawareness whenever they exist. However, it is not clear that this\naccount captures the full force of the intended notion. Consider, for\nexample, the mereological fusion of \\(X\\)’s afterimage and\n\\(Y\\)’s headache. This is surely a mental entity if anything is.\nBut it is not necessarily the object of a mental state. (The fusion\ncan exist even if no one is thinking about it.) A more\ngenerous conception would allow for mind-dependent objects that exist\nat a time in virtue of mental activity at that time, even if the\nobject is not the object of any single mental state or act. The fusion\nof \\(X\\)’s afterimage and \\(Y\\)’s headache is\nmind-dependent in the second sense but not the first. That is a reason\nto prefer the second account of mind-dependence.\n\nIf we understand the notion of mind-dependence in this way, it is a\nmistake to insist that abstract objects be mind-independent. To strike\na theme that will recur, it is widely supposed that sets and classes\nare abstract entities—even the impure sets whose\nurelements are concrete objects. Any account of the abstract/concrete\ndistinction that places set-theoretic constructions like\n\\(\\{\\textrm{Alfred}, \\{\\textrm{Betty}, \\{\\textrm{Charlie},\n\\textrm{Deborah}\\}\\}\\}\\) on the concrete side of the line will be\nseriously at odds with standard usage. With this in mind, consider the\nset whose sole members are X’s afterimage and Y’s\nheadache, or some more complex set-theoretic object based on these\nitems. If we suppose, as is plausible, that an impure set exists at a\ntime only when its members exist at that time, this will be a\nmind-dependent entity in the generous sense. But it is also presumably\nan abstract entity.\n\nA similar problem arises for so-called abstract artifacts,\nlike Jane Austen’s novels and the characters that inhabit them.\nSome philosophers regard such items as eternally existing abstract\nentities that worldly authors merely describe but do not create. But\nof course the commonsensical view is that Austen created Pride and\nPrejudice and Elizabeth Bennett, and there is no good reason to\ndeny this (Thomasson 1999; cf. Sainsbury 2009). If we take this\ncommonsensical approach, there will be a clear sense in which these\nitems depend for their existence on Austen’s mental activity,\nand perhaps on the mental activity of subsequent \nreaders.[5] \nThese items\nmay not count as mind-dependent in either of the senses canvassed\nabove, since Pride and Prejudice can presumably exist at a\ntime even if no one happens to be thinking at that time. (If the world\ntook a brief collective nap, Pride and Prejudice would not\npop out of existence.) But they are obviously mind-dependent in some\nnot-merely-causal sense. And yet they are still presumably abstract\nobjects. For these reasons, it is probably a mistake to insist that\nabstract objects be mind-independent. (For more on mind-dependence,\nsee Rosen 1994, and the entry\n platonism in the philosophy of mathematics.)\n\nFrege’s proposal in its original form also fails for other\nreasons. Quarks and electrons are usually considered neither sensible\nnor mind-dependent. And yet they are not abstract objects. A better\nversion of Frege’s proposal would hold that:\n\nAn object is abstract if and only if it is both non-physical and\nnon-mental.\n\nTwo remarks on this last version are in order. First, it opens the\ndoor to thinking that besides abstract and concrete entities (assuming\nthat physical objects, in a broad sense, are concrete), there are\nmental entities that are neither concrete nor abstract. As mentioned\nabove (section 1.2), there is no need to insist that the distinction\nis an exhaustive one. Second, while the approach may well draw an\nimportant line, it inherits one familiar problem, namely, that of\nsaying what it is for a thing to be a physical object (Crane\nand Mellor 1990; for discussion, see the entry on\n physicalism).\n In one sense, a physical entity is an entity in which physics might\ntake an interest. But physics is saturated with mathematics, so in\nthis sense a great many paradigmatically abstract objects—e.g.\n\\(\\pi\\)—will count as physical. The intended point is that\nabstract objects are to be distinguished, not from all of the\nobjects posited by physics, but from the concrete objects\nposited by the physics. But if that is the point, it is unilluminating\nin the present context to say that abstract objects are\nnon-physical.\n3.5.2 The Non-Spatiality Criterion\n\nContemporary purveyors of the way of negation typically amend\nFrege’s criterion by requiring that abstract objects be\nnon-spatial, causally inefficacious, or both. Indeed, if any\ncharacterization of the abstract deserves to be regarded as the\nstandard one, is this:\n\nAn object is abstract if and only if it is non-spatial and causally\ninefficacious.\n\nThis standard account nonetheless presents a number of\nperplexities.\n\nFirst of all, one must consider whether there are abstract objects\nthat have one of the two features but not the other. For example,\nconsider an impure set, such as the unit set of Plato (i.e.,\n\\(\\{\\textrm{Plato}\\}\\)). It has some claim to being abstract because\nit is causally inefficacious, but some might suggest that it has a\nlocation in space (namely, wherever Plato is located). Or consider a\nwork of fiction such as Kafka’s The Metamorphosis. It,\ntoo, has some claim to being abstract because it (or at least its\ncontent) is non-spatial. But one might suggest that works of fiction\nas paradigmatic abstract objects seem to have causal powers, e.g.,\npowers to affect us.\n\nIn the remainder of this subsection, we focus on the first criterion\nin the above proposal, namely, the non-spatial condition. But it gives\nrise to a subtlety. It seems plausible to suggest that, necessarily,\nif something \\(x\\) is causally efficacious, then (since \\(x\\) is a\ncause or has causal powers) \\(x\\), or some part of \\(x\\), has a\nlocation in time. So if something has no location in time, it is\ncausally inefficacious. The theory of relativity implies that space\nand time are nonseparable, i.e., combined into a single\nspacetime manifold. So the above proposal might be restated\nin terms of a single condition: an object is abstract if and only if\nit is non-spatiotemporal. Sometimes this revised proposal is the\ncorrect one for thinking about abstract objects, but our discussion in\nthe previous section showed that abstract artifacts and mental events\nmay be temporal but non-spatial. Given the complexities here, in what\nfollows we use spatiotemporality, spatiality, or temporality, as\nneeded.\n\nSome of the archetypes of abstractness are non-spatiotemporal in a\nstraightforward sense. It makes no sense to ask where the cosine\nfunction was last Tuesday. Or if it makes sense to ask, the sensible\nanswer is that it was nowhere. Similarly, for many people, it makes no\ngood sense to ask when the Pythagorean Theorem came to be. Or if it\ndoes make sense to ask, the only sensible answer for them is that it\nhas always existed, or perhaps that it does not exist ‘in\ntime’ at all. It is generally assumed that these paradigmatic\n‘pure abstracta’ have no non-trivial spatial or temporal\nproperties; that they have no spatial location, and they exist nowhere\nin particular in time.\n\nOther abstract objects appear to stand in a more interesting relation\nto spacetime. Consider the game of chess. Some philosophers will say\nthat chess is like a mathematical object, existing nowhere and\n‘no when’—either eternally or outside of time\naltogether. But the most natural view is that chess was invented at a\ncertain time and place (though it may be hard to say exactly where or\nwhen); that before it was invented it did not exist at all; that it\nwas imported from India into Persia in the 7th century; that it has\nchanged over the years, and so on. The only reason to resist this\nnatural account is the thought that since chess is clearly an abstract\nobject—it’s not a physical object, after all!—and\nsince abstract objects do not exist in space and time—by\ndefinition!—chess must resemble the cosine function in its\nrelation to space and time. And yet one might with equal justice\nregard the case of chess and other abstract artifacts as\ncounterexamples to the hasty view that abstract objects possess only\ntrivial spatial and temporal properties.\n\nShould we then abandon the non-spatiotemporality criterion? Not\nnecessarily. Even if there is a sense in which some abstract entities\npossess non-trivial spatiotemporal properties, it might still be said\nthat concrete entities exist in spacetime in a distinctive\nway. If we had an account of this distinctive manner of\nspatiotemporal existence characteristic of concrete objects, we could\nsay: An object is abstract (if and) only if it fails to exist in\nspacetime in that way.\n\nOne way to implement this approach is to note that paradigmatic\nconcrete objects tend to occupy a relatively determinate spatial\nvolume at each time at which they exist, or a determinate volume of\nspacetime over the course of their existence. It makes sense to ask of\nsuch an object, ‘Where is it now, and how much space does it\noccupy?’ even if the answer must sometimes be somewhat vague. By\ncontrast, even if the game of chess is somehow\n‘implicated’ in space and time, it makes no sense to ask\nhow much space it now occupies. (To the extent that this does make\nsense, the only sensible answer is that it occupies no space at all,\nwhich is not to say that it occupies a spatial point.) And so it might\nbe said:\n\nAn object is abstract (if and) only if it fails to occupy anything\nlike a determinate region of space (or spacetime).\n\nThis promising idea raises several questions. First, it is conceivable\nthat certain items that are standardly regarded as abstract might\nnonetheless occupy determinate volumes of space and time. Consider,\nfor example, the various sets composed from Peter and Paul:\n\\(\\{\\textrm{Peter}, \\textrm{Paul}\\},\\) \\(\\{\\textrm{Peter},\n\\{\\textrm{Peter}, \\{\\{\\textrm{Paul}\\}\\}\\}\\},\\) etc. We don’t\nnormally ask where such things are, or how much space they occupy. And\nindeed many philosophers will say that the question makes no sense, or\nthat the answer is a dismissive ‘nowhere, none’. But this\nanswer is not forced upon us by anything in set theory or metaphysics.\nEven if we grant that pure sets stand in only the most\ntrivial relations to space, it is open to us to hold, as some\nphilosophers have done, that impure sets exist where and when their\nmembers do (Lewis 1986a). It is not unnatural to say that a set of\nbooks is located on a certain shelf in the library, and indeed, there\nare some theoretical reasons for wanting to say this (Maddy 1990). On\na view of this sort, we face a choice: we can say that since impure\nsets exist in space, they are not abstract objects after all; or we\ncan say that since impure sets are abstract, it was a mistake to\nsuppose that abstract objects cannot occupy space.\n\nOne way to finesse this difficulty would be to note that even if\nimpure sets occupy space, they do so in a derivative manner. The set\n\\(\\{\\textrm{Peter}, \\textrm{Paul}\\}\\) occupies a location in virtue of\nthe fact that its concrete elements, Peter and Paul, together occupy\nthat location. The set does not occupy the location in its own\nright. With that in mind, it might be said that:\n\nAn object is abstract (if and) only if it either fails to occupy space\nat all, or does so only in virtue of the fact some other\nitems—in this case, its urelements—occupy that\nregion.\n\nBut of course Peter himself occupies a region in virtue of the fact\nthat his parts—his head, hands, etc.—together\noccupy that region. So a better version of the proposal would say:\n\nAn object is abstract (if and) only if it either fails to occupy space\nat all, or does so of the fact that some other items that are not\namong its parts occupy that region.\n\nThis approach appears to classify the cases fairly well, but it is\nsomewhat artificial. Moreover, it raises a number of questions. What\nare we to say about the statue that occupies a region of space, not\nbecause its parts are arrayed in space, but rather because\nits constituting matter occupies that region? And what about\nthe unobserved electron, which according to some interpretations of\nquantum mechanics does not really occupy a region of space at\nall, but rather stands in some more exotic relation to the spacetime\nit inhabits? Suffice it to say that a philosopher who regards\n‘non-spatiality’ as a mark of the abstract, but who allows\nthat some abstract objects may have non-trivial spatial properties,\nowes us an account of the distinctive relation to spacetime,\nspace, and time that sets paradigmatic concreta apart.\n\nPerhaps the crucial question about the ‘non-spatiality’\ncriterion concerns the classification of the parts of space itself. If\nthey are considered concrete, then one might ask where the\nspatiotemporal points or regions are located. And a similar question\narises for spatial points and regions, and for temporal instants or\nintervals. So, the ontological status of spatiotemporal locations, and\nof spatial and temporal locations, is problematic. Let us suppose that\nspace, or spacetime, exists, not just as an object of pure\nmathematics, but as the arena in which physical objects and events are\nsomehow arrayed. It is essential to understand that the problem is not\nabout the numerical coordinates that represent these points and\nregions (or instants and intervals) in a reference system; the issue\nis about the points and regions (or instants and intervals). Physical\nobjects are located ‘in’ or ‘at’ regions of\nspace; as a result, they count as concrete according to the\nnon-spatiality criterion. But what about the points and regions of\nspace itself? There has been some debate about whether a commitment to\nspacetime substantivalism is consistent with the nominalist’s\nrejection of abstract entities (Field 1980, 1989; Malament\n1982). If we define the abstract as the ‘non-spatial’,\nthis debate amounts to whether space itself is to be reckoned\n‘spatial’. To reject that these points, regions, instants,\nand intervals, are concrete because they are not located,\nentails featuring them as abstract. However, to think about them as\nabstract sounds a bit weird, given their role in causal processes.\nPerhaps, it is easier to treat them as concrete if we want to\nestablish that concrete entities are spatiotemporal—or spatial\nand temporal.\n\nThe philosopher who believes that there is a serious question about\nwhether the parts of space-time count as concrete would thus do well\nto characterize the abstract/concrete distinction in other terms.\nStill—as mentioned above—the philosopher who thinks that\nit is defensible that parts of space are concrete might use\nnon-spatiality to draw the distinction if she manages to provide a way\nof accounting for how impure sets relate to space differs from the way\nconcreta do.\n3.5.3 The Causal Inefficacy Criterion\n\nAccording to the most widely accepted versions of the way of\nnegation:\n\nAn object is abstract (if and) only if it is causally\ninefficacious.\n\nConcrete objects, whether mental or physical, have causal powers;\nnumbers and functions and the rest make nothing happen. There is no\nsuch thing as causal commerce with the game of chess itself (as\ndistinct from its concrete instances). And even if impure sets do in\nsome sense exist in space, it is easy enough to believe that they make\nno distinctive causal contribution to what transpires. Peter\nand Paul may have effects individually. They may even have effects\ntogether that neither has on his own. But these joint effects are\nnaturally construed as effects of two concrete objects acting jointly,\nor perhaps as effects of their mereological aggregate (itself usually\nregarded as concretum), rather than as effects of some set-theoretic\nconstruction. Suppose Peter and Paul together tip a balance. If we\nentertain the possibility that this event is caused by a set, we shall\nhave to ask which set caused it: the set containing just Peter and\nPaul? Some more elaborate construction based on them? Or is it perhaps\nthe set containing the molecules that compose Peter and Paul? This\nproliferation of possible answers suggests that it was a mistake to\ncredit sets with causal powers in the first place. This is good news\nfor those who wish to say that all sets are abstract.\n\n(Note, however, that some writers identify ordinary physical\nevents—causally efficacious items par excellence—with\nsets. For David Lewis, for example, an event like the fall of Rome is\nan ordered pair whose first member is a region of spacetime, and whose\nsecond member is a set of such regions (Lewis 1986b). On this account,\nit would be disastrous to say both that impure sets are abstract\nobjects, and that abstract objects are non-causal.)\n\nThe biggest challenge to characterizing abstracta as causally\ninefficacious entities is that causality itself is a\nnotoriously problematic and difficult to define idea. It is\nundoubtedly one of the most controversial notions in the history of\nthought, with all kinds of views having been put forward on the\nmatter. Thus, causally efficacious inherits any unclarity\nthat attaches to causality. So, if we are to move the\ndiscussion forward, we need to take the notion of\ncausation—understood as a relation among events—as\nsufficiently clear, even though in fact it is not. Having acknowledged\nthis no doubt naïve assumption, several difficulties arise for\nthe suggestion that abstract objects are precisely the causally\ninefficacious objects.\n\nThe idea that causal inefficacy constitutes a sufficient\ncondition for abstractness is somewhat at odds with standard usage.\nSome philosophers believe in ‘epiphenomenal qualia’:\nobjects of conscious awareness (sense data), or qualitative conscious\nstates that may be caused by physical processes in the brain, but\nwhich have no downstream causal consequences of their own (Jackson\n1982; Chalmers 1996). These items are causally inefficacious if they\nexist, but they are not normally regarded as abstract. The proponent\nof the causal inefficacy criterion might respond by insisting that\nabstract objects are distinctively neither causes nor\neffects. But this is perilous. Abstract artifacts like Jane\nAusten’s novels (as we normally conceive them) come into being\nas a result of human activity. The same goes for impure sets,\nwhich come into being when their concrete urelements are created.\nThese items are clearly effects in some good sense; yet they\nremain abstract if they exist at all. It is unclear how the proponent\nof the strong version of the causal inefficacy criterion (which views\ncausal inefficacy as both necessary and sufficient for abstractness)\nmight best respond to this problem.\n\nApart from this worry, there are no decisive intuitive counterexamples\nto this account of the abstract/concrete distinction. The chief\ndifficulty—and it is hardly decisive—is rather conceptual.\nIt is widely maintained that causation, strictly speaking, is a\nrelation among events or states of affairs. If we say that the\nrock—an object—caused the window to break, what we mean is\nthat some event or state (or fact or condition) involving the\nrock caused the break. If the rock itself is a cause, it is a cause in\nsome derivative sense. But this derivative sense has proved elusive.\nThe rock’s hitting the window is an event in which the rock\n‘participates’ in a certain way, and it is because the\nrock participates in events in this way that we credit the rock itself\nwith causal efficacy. But what is it for an object to\nparticipate in an event? Suppose John is thinking about the\nPythagorean Theorem and you ask him to say what’s on his mind.\nHis response is an event—the utterance of a sentence; and one of\nits causes is the event of John’s thinking about the theorem.\nDoes the Pythagorean Theorem ‘participate’ in this event?\nThere is surely some sense in which it does. The event\nconsists in John’s coming to stand in a certain relation to the\ntheorem, just as the rock’s hitting the window consists in the\nrock’s coming to stand in a certain relation to the glass. But\nwe do not credit the Pythagorean Theorem with causal efficacy simply\nbecause it participates in this sense in an event which is a\ncause.\n\nThe challenge is therefore to characterize the distinctive manner of\n‘participation in the causal order’ that distinguishes the\nconcrete entities. This problem has received relatively little\nattention. There is no reason to believe that it cannot be solved,\nthough the varieties of philosophical analysis for the notion of\ncausality make the task full of pitfalls. Anyway, in the\nabsence of a solution, this standard version of the way of\nnegation must be reckoned a work in progress.\n3.5.4 The Discernibility / Non-Duplication Criteria\n\nSome philosophers have supposed that, under certain conditions, there\nare numerically different but indiscernible concrete entities, i.e.,\nthat there are distinct concrete objects \\(x\\) and \\(y\\) that\nexemplify the same properties. If this can be sustained, then one\nmight suggest that distinct abstract objects are always discernible\nor, in a weaker formulation, that distinct abstract objects are never\nduplicates.\n\nCowling (2017, 86–89) analyzes whether the abstract/concrete\ndistinction thus rendered is fruitful, though criteria in this line\nare normally offered as glosses on the universal/particular\ndistinction. As part of his analysis, he deploys two pairs of (not\nuncontroversial) distinctions: (i) between qualitative and\nnon-qualitative properties, and (ii) between intrinsic and extrinsic\nproperties. Roughly, a non-qualitative property is one that involves\nspecific individuals (e.g., being the teacher of Alexander the\nGreat, being Albert Einstein, etc.), while qualitative\nproperties are not (e.g., having mass, having a\nshape, having a length, etc.). Intrinsic properties are\nthose an object has regardless of what other objects are like and\nregardless of its relationships with other objects (e.g., being\nmade of copper). By contrast, an object’s extrinsic\nproperties are those that depend on other entities (e.g., being\nthe fastest\n car).[6]\n\n\nWith these distinctions in mind, it seems impossible that there be\ndistinct abstract entities which are qualitatively indiscernible; each\nabstract entity is expected to have a unique, distinctive qualitative\nintrinsic nature (or property), which is giving reason for its\nmetaphysical being. This wouldn’t be the case for any concrete\nentity given the initial assumption in this section. Therefore, the\nfollowing criterion of discernability could be pondered:\n\n\\(x\\) is an abstract object iff it is impossible for there to be an\nobject which is qualitatively indiscernible from \\(x\\) but distinct\nfrom \\(x\\).\n\nHowever, one can develop a counterexample to the above proposal, by\nconsidering two concrete objects that are indiscernible with respect\nto their intrinsic qualitative properties. Cowling (2017) considers\nthe case of a possible world with only two perfectly spherical balls,\n\\(A\\) and \\(B\\), that share the same intrinsic qualitative properties\nand that are floating at a certain distance from each other. So \\(A\\)\nand \\(B\\) are distinct concrete objects but indiscernible in terms of\ntheir intrinsic qualitative\nproperties.[7]\nBut Lewis has pointed out that “if two individuals are\nindiscernible then so are their unit sets” (1986a, 84). If this\nis correct, \\(\\{A\\}\\) and \\(\\{B\\}\\) would be indiscernible, but (at\nleast for some philosophers) distinct abstract objects, contrary to\nthe discernibility criterion.[8] It is possible to counter-argue that we could\nhappily accept impure sets as concrete; after all, it was always a bit\nunclear how they should be classified. Obviously, this has the\nproblematic consequence of having some sets—pure sets—as\nabstract and other sets—impure sets—as concrete. But the\nidea that abstract objects have distinctive intrinsic natures allows\none to establish a criterion less strong than that of discernibility;\nif an entity has a distinctive intrinsic nature, it cannot have a\nduplicate. So, the next criterion of non-duplication can be put\nforward:\n\n\\(x\\) is an abstract object iff it is impossible for there to be an\nobject which is a duplicate of \\(x\\) but distinct from \\(x\\).\n\nBut there is a more serious counterexample to this criterion, namely,\nimmanent universals. These are purportedly concrete objects, for they\nare universals wholly present where their instances are. But this\ncriterion renders them abstract. Take the color scarlet; it is a\nuniversal wholly present in every scarlet thing. Each of the scarlets\nin those things is an immanent universal. These are non-duplicable,\nbut at least according to Armstrong (1978, I, 77, though see 1989,\n98–99), they are paradigmatically concrete: spatiotemporally\nlocated, causally efficacious, etc. Despite how promising they\ninitially seemed, the criteria of discernibility and non-duplicability\ndo not appear to capture the abstract/concrete distinction.\n3.6 The Way of Encoding\n\nOne of the most rigorous proposals about abstract objects has been\ndeveloped by Zalta (1983, 1988, and in a series of papers). It is a\nformal, axiomatic metaphysical theory of objects (both abstract and\nconcrete), and also includes a theory of properties, relations, and\npropositions. The theory explicitly defines the notion of an\nabstract object but also implicitly characterizes them using\n axioms.[9]\n There are three central aspects to the theory: (i) a predicate \\(E!\\)\nwhich applies to concrete entities and which is used to define a modal\ndistinction between abstract and ordinary objects;\n(ii) a distinction between exemplifying relations and\nencoding properties (i.e., encoding 1-place relations); and\n(iii) a comprehension schema that asserts the conditions under which\nabstract objects exist.\n\n(i) Since the theory has both a quantifier \\(\\exists\\) and a predicate\n\\(E!\\), Zalta offers two interpretations of his theory (1983,\n51–2; 1988, 103–4). On one interpretation, the quantifier\n\\(\\exists\\) simply asserts there is and the predicate \\(E!\\)\nasserts existence. On this interpretation, a formula such as\n\\(\\exists x \\neg E!x\\), which is implied by the axioms described\nbelow, asserts “there is an object that fails to exist”.\nSo, on this interpretation, the theory is Meinongian because it\nendorses non-existent objects. But there is a Quinean interpretation\nas well, on which the quantifier \\(\\exists\\) asserts\nexistence and the predicate \\(E!\\) asserts\nconcreteness. On this interpretation, the formula \\(\\exists x\n\\neg E!x\\) asserts “there exists an object that fails to be\nconcrete”. So, on this interpretation, the theory is Platonist,\nsince it doesn’t endorse non-existents but rather asserts the\nexistence of non-concrete objects. We’ll henceforth use the\nQuinean/Platonist interpretation.\n\nIn the more expressive, modal version of his theory, Zalta defines\nordinary objects \\((O!)\\) to be those that might be concrete.\nThe reason is that Zalta holds that possible objects (i.e., like\nmillion-carat diamonds, talking donkeys, etc.) are not concrete but\nrather possibly concrete. They exist, but they are not abstract, since\nabstract objects, like the number one, couldn’t be concrete.\nIndeed, Zalta’s theory implies that abstract objects \\((A!)\\)\naren’t possibly concrete, since he defines them to be objects\nthat aren’t ordinary (1993, 404):\n\n\\[\\begin{align}\nO!x &=_\\mathit{df} \\Diamond E!x \\\\\nA!x &=_\\mathit{df} \\neg O!x\n\\end{align}\\]\n\n\nThus, the ordinary objects include all the concrete objects (since\n\\(E!x\\) implies \\(\\Diamond E!x\\)), as well as possible objects that\naren’t in fact concrete but might have been. On this theory,\ntherefore, being abstract is not the negation of being\nconcrete. Instead, the definition validates an intuition that\nnumbers, sets, etc., aren’t the kind of thing that could be\nconcrete. Though Zalta’s definition of abstract seems\nto comport with the way of primitivism—take\nconcrete as primitive, and then define abstract as\nnot possibly concrete—it differs in that (a) axioms are\nstated that govern the conditions under which abstract objects exist\n(see below), and (b) the features commonly ascribed to abstract\nobjects are derived from principles that govern the property\nof being concrete. For example, Zalta accepts principles such as:\nnecessarily, anything with causal powers is concrete (i.e., \\(\\Box\n\\forall x(Cx \\to E!x)\\)). Then since abstract objects are, by\ndefinition, concrete at no possible world, they necessarily fail to\nhave causal powers.\n\n(ii) The distinction between exemplifying and\nencoding is a primitive one and is represented in the theory\nby two atomic formulas: \\(F^nx_1\\ldots x_n\\) \\((x_1,\\ldots ,x_n\\)\nexemplify \\(F^n\\)) and \\(xF^1\\) \\((x\\) encodes\n\\(F^1).\\) While both ordinary and abstract objects exemplify\nproperties, only abstract objects encode\n properties;[10]\n it is axiomatic that ordinary objects necessarily fail to encode\nproperties \\((O!x \\to \\Box \\neg \\exists FxF).\\) Zalta’s proposal\ncan be seen a positive metaphysical proposal distinct from all the\nothers we have considered; a positive proposal that uses encoding as a\nkey notion to characterize abstract objects. On this reading, the\ndefinitions and axioms of the theory convey what is meant by\nencoding and how it works. Intuitively, an abstract object\nencodes the properties by which we define or conceive of it,\nbut exemplifies some properties contingently and others necessarily.\nThus, the number 1 of Dedekind-Peano number theory encodes all and\nonly its number-theoretic properties, and whereas it contingently\nexemplifies the property being thought about by Peano, it\nnecessarily exemplifies properties such as being abstract,\nnot having a shape, not being a building, etc. The\ndistinction between exemplifying and encoding a property is also used\nto define identity: ordinary objects are identical whenever they\nnecessarily exemplify the same properties while abstract objects are\nidentical whenever they necessarily encode the same properties.\n\n(iii) The comprehension principle asserts that for each expressible\ncondition on properties, there is an abstract object that\nencodes exactly the properties that fulfill (satisfy) that\ncondition. Formally: \\(\\exists x(A!x \\:\\&\\: \\forall F(xF \\equiv\n\\phi))\\), where \\(\\phi\\) has no free \\(x\\)s. Each instance of this\nschema asserts the existence of an abstract object of a certain sort.\nSo, for example, where ‘\\(s\\)’ denotes Socrates, the\ninstance \\(\\exists x(A!x \\:\\&\\: \\forall F(xF \\equiv Fs))\\) asserts\nthat there is an abstract object that encodes exactly the properties\nthat Socrates exemplifies. Zalta uses this object to analyze the\ncomplete individual concept of Socrates. But any condition \\(\\phi\\) on\nconditions on properties with no free occurrences of \\(x\\) can be used\nto form an instance of comprehension. In fact, one can prove that the\nobject asserted to exist is unique, since there can’t be two\ndistinct abstract objects that encode exactly the properties\nsatisfying \\(\\phi\\).\n\nThe theory that emerges from (i)–(iii) is further developed\nwith additional axioms and definitions. One axiom asserts that if an\nobject encodes a property, it does so necessarily \\((xF \\to \\Box\nxF).\\) So the properties that an object encodes are not relative to\nany circumstance. Moreover, Zalta supplements his theory of abstract\nobjects with a theory of properties, relations, and propositions. Here\nwe describe only the theory of properties. It is governed by two\nprinciples: a comprehension principle for properties and a principle\nof identity. The comprehension principle asserts that for any\ncondition on objects expressible without encoding subformulas, there\nis a property \\(F\\) such that necessarily, an object \\(x\\) exemplifies\n\\(F\\) if and only if \\(x\\) is such that \\(\\phi\\), i.e., \\(\\exists\nF\\Box \\forall x(Fx \\equiv \\phi)\\), where \\(\\phi\\) has no encoding\nsubformulas and no free \\(F\\text{s}\\). The identity principle asserts\nthat properties \\(F\\) and \\(G\\) are identical just in case \\(F\\) and\n\\(G\\) are necessarily encoded by the same objects, i.e., \\(F\\! =\\! G\n=_\\mathit{df} \\Box \\forall x(xF \\equiv xG)\\). This principle allows\none to assert that there are properties that are necessarily\nequivalent in the classical sense, i.e., in the sense that \\(\\Box\n\\forall x(Fx \\equiv Gx)\\), but which are\n distinct.[11]\n\n\nSince \\(\\alpha\\! =\\! \\beta\\) is defined both when \\(\\alpha\\) and\n\\(\\beta\\) are both individual variables or both property variables,\nZalta employs the usual principle for the substitution of identicals.\nSince all of the terms in his system are rigid, substitution of\nidenticals preserves truth even in modal contexts.\n\nThe foregoing principles implicitly characterize both abstract and\nordinary objects. Zalta’s theory doesn’t postulate any\nconcrete objects, though, since that is a contingent matter. But his\nsystem does include the Barcan formula (i.e., \\(\\Diamond \\exists xFx\n\\to \\exists x\\Diamond Fx\\)), and so possiblity claims like\n“there might have been talking donkeys” imply that there\nare (non-concrete) objects at our world that are talking donkeys at\nsome possible world. Since Zalta adopts the view that ordinary\nproperties like being a donkey necessarily imply concreteness, such\ncontingently nonconcrete objects are ordinary.\n\nZalta uses his theory to analyze Plato’s Forms, concepts,\npossible worlds, Fregean numbers and Fregean senses, fictions, and\nmathematical objects and relations generally. However, some\nphilosophers see his comprehension principle as too inclusive, for in\naddition to these objects, it asserts that there are entities like\nthe round square or the set of all sets which are not\nmembers of themselves. The theory doesn’t assert that\nanything exemplifies being round and being square—the\ntheory preserves the classical form of predication without giving rise\nto contradictions. But it does assert that there is an abstract object\nthat encodes being round and being square, and that there is an\nabstract object that encodes the property of being a set that contains\nall and only non-self-membered sets. Zalta would respond by suggesting\nthat such objects are needed not only to state truth conditions, and\nexplain the logical consequences, of sentences involving expressions\nlike “the round square” and “the Russell set”,\nbut also to analyze the fictional characters of inconsistent stories\nand inconsistent theories (e.g., Fregean extensions).\n\nIt should be noted that Zalta’s comprehension principle for\nabstract objects is unrestricted and so constitutes a\nplenitude principle. This allows the theory to provide\nobjects for arbitrary mathematical theories. Where \\(\\tau\\) is a term\nof mathematical theory \\(T\\), the comprehension principle yields a\nunique object that encodes all and only the properties \\(F\\) that are\nattributed to \\(\\tau\\) in \\(T\\) (Linsky & Zalta 1995,\nNodelman & Zalta\n 2014).[12]\n Zalta’s theory therefore offers significant explanatory power,\nfor it has multiple applications and advances solutions to a wide\nrange of puzzles in different fields of\n philosophy.[13]\n\n3.7 The Ways of Weakening Existence\n\nMany philosophers have supposed that abstract objects exist in some\nthin, deflated sense. In this section we consider the idea that the\nabstract/concrete distinction might be defined by saying that\nabstract objects exist in some less robust sense than the sense in\nwhich concrete objects exist.\n\nThe traditional platonist conception is a realist one: abstract\nobjects exist in just the same full-blooded sense that objects in the\nnatural world exist—they are mind-independent, rather than\nartifacts of human endeavor or dependent on concrete objects in any\nway. But a number of deflationary, metatontological views, now\nestablished in the literature, are based on the idea that the problems\ntraditional platonists face have to do with “some very general\npreconceptions about what it takes to specify an object” rather than\nwith “the abstractness of the desired object” (Linnebo 2018,\n42). These views suggest that abstract objects exist in some weaker\nsense. Various approaches therefore articulate what may be called the\nways of weakening existence. One clear precedent is due to Carnap 1950\n[1956], whose deflationary approach may go the furthest; Carnap\nrejects the metaphysical pursuit of what “really exists”\n(even in the case of concrete objects) since he maintains that the\nquestion “Do \\(X\\text{s}\\) really exist?” are\npseudo-questions (if asked independently of some linguistic\nframework).\n\nBut there are other ways to suggest that abstract objects have\nexistence conditions that demand little of the world. For example,\nLinsky & Zalta (1995, 532) argued that the mind-independence\nand objectivity of abstract objects isn’t like that of physical\nobjects: abstract objects aren’t subject to an\nappearance/reality distinction, they don’t exist in a\n‘sparse’ way that requires discovery by empirical\ninvestigation, and they aren’t complete objects (e.g.,\nmathematical objects are defined only by their mathematical\nproperties). They use this conception to naturalize\nZalta’s comprehension principle for abstract objects.\n\nOther deflationary accounts develop some weaker sense in which\nabstract objects exist (e.g., as ‘thin’ objects). We\nfurther describe some of these proposals below and try to unpack the\nways in which they characterize the weakened, deflationary sense of\nexistence (even when such characterizations are not always\nexplicit).\n3.7.1 The Criterion of Linguistic Rules\n\nCarnap held that claims about the “real” existence of\nentities (concrete or abstract) do not have cognitive content. They\nare pseudo-statements. However, he admitted: (a) that there are\nsentences in science that use terms that designate mathematical\nentities (such as numbers); and (b) that semantic analysis seems to\nrequire entities like properties and propositions. Since mathematical\nentities, properties, and propositions are traditionally considered\nabstract, he wanted to clarify how it is possible to accept a language\nreferring to abstract entities without adopting what he considered\npseudo-sentences about such entities’ objective reality.\nCarnap’s famous paper (1950 [1956]) contained an attempt to show\nthat, without embracing Platonism, one can use a language referring to\nabstract entities.\n\nTo achieve these goals, Carnap begins by noting that before one can\nask existence questions about entities of a determinate kind, one\nfirst has to have a language, or a linguistic framework, that\nallows one to speak about the kinds of entity in question. He then\ndistinguishes ‘internal’ existence questions expressed\nwithin such a linguistic framework from ‘external’\nexistence questions about a framework. Only the latter ask whether the\nentities of that framework are objectively real. As we’ll see\nbelow, Carnap thought that internal existence questions within a\nframework can be answered, either by empirical investigation or by\nlogical analysis, depending on the kind of entity the framework is\nabout. By contrast, Carnap regards external questions (e.g., ‘Do\n\\(X\\text{s}\\) exist?’, expressed either about, or independent\nof, a linguistic framework) as pseudo-questions: though they appear to\nbe theoretical questions, in fact they are merely practical questions\nabout the utility of the linguistic framework for science.\n\nCarnap’s paper (1950 [1956]) considers a variety of linguistic\nframeworks, such as those for: observable things (i.e., the\nspatiotemporally ordered system of observable things and events),\nnatural numbers and integers, propositions, thing properties, rational\nand real numbers, and spatiotemporal coordinate systems. Each\nframework is established by developing a language that typically\nincludes expressions for one or more kinds of entities in question,\nexpressions for properties of the entities in question (including a\ngeneral category term for each kind of entity in question), and\nvariables ranging over those entities. Thus, a framework for the\nsystem of observable things has expressions that denote such things\n(‘the Earth’, ‘the Eiffel Tower’, etc.),\nexpressions for properties of such things (‘planet’,\n‘made of metal’, etc.), and variables ranging over\nobservables. The framework for natural numbers has expressions that\ndenote them (‘0’, ‘2+5’), expressions for\nproperties of the numbers (‘prime’, ‘odd’),\nincluding the general category term ‘number’), and\nvariables ranging over numbers.\n\nFor Carnap, each statement in a linguistic framework should have a\ntruth value that can be determined either by analytical or empirical\nmethods. A statement’s truth value is analytically determinable\nif it is logically true (or false), or if it’s truth is\ndeterminable exclusively from the rules of the language or on the\nbasis of semantic relationships among its component expressions. A\nstatement is empirically determinable when it is confirmable (or\ndisconfirmable) in the light of the perceived evidence. Note that the\nvery attempt to confirm an empirical statement about physical objects\non the basis of the evidence requires that one adopt the language of\nthe framework of things. Carnap warns us, however, that “this\nmust not be interpreted as if it meant … acceptance of a\nbelief in the reality of the thing world; there is no such\nbelief or assertion or assumption because it is not a theoretical\nquestion” (1950 [1956, 208]). For Carnap, to accept an ontology\n“means nothing more than to accept a certain form of language,\nin other words to accept rules for forming statements and for testing,\naccepting, or rejecting them” (1950 [1956, 208]).\n\nCarnap takes this approach to every linguistic framework, no matter\nwhether it is a framework about physical, concrete things, or a\nframework about abstract entities such as numbers, properties,\nconcepts, propositions, etc. For him, the pragmatic reasons for\naccepting a given linguistic framework are that it has explanatory\npower, unifies the explanation of disparate kinds of data and\nphenomena, expresses claims more efficiently, etc. And we often choose\na framework for a particular explanatory purpose. We might therefore\nchoose a framework with expressions about abstract entities to carry\nout an explication (i.e., an elucidation of concepts), or to\ndevelop a semantics for natural language. For Carnap, the choice\nbetween platonism or nominalism is not a legitimate one; both are\ninappropriate attempts to answer an external pseudo-question.\n\nAs sketched earlier, the truth of such existence claims as\n‘there are tables’ and ‘there are unicorns’,\nwhich are expressed within the framework for observable entities, is\nto be determined empirically, since empirical observations and\ninvestigations are needed. These statements are not true in virtue of\nthe rules of the language. By contrast, existence claims such as\n‘there are numbers’ (‘\\(\\exists xNx\\)’)\nexpressed within the framework of number theory, or ‘there is a\nproperty \\(F\\) such that both \\(x\\) and \\(y\\) are \\(F\\)’\n(‘\\(\\exists F(Fx \\:\\&\\:\nFy)\\)’) expressed within the framework of property\ntheory, can be determined analytically. For these statements either\nform part of the rules of the language (e.g., expressed as axioms that\ngovern the terms of the language) or are derivable from the rules of\nthe language. When these statements are part of the rules that make up\nthe linguistic framework, they are considered analytic, as\nare the existential statements that follow from those\nrules.[14]\n\n\nAll of the existence assertions just discussed are therefore\ninternal to their respective linguistic frameworks. Carnap\nthinks that the only sense that can be given to talk of\n“existence” is an internal sense. Internal questions about\nthe existence of things or abstract objects are not questions about\ntheir real metaphysical\n existence.[15]\n Hence, it seems more appropriate to describe his view as embodying a\ndeflationary notion of object. For Carnap concludes “the\nquestion of the admissibility of entities of a certain type or of\nabstract entities in general as designata is reduced to the question\nof the acceptability of the linguistic framework for those\nentities” (1950 [1956, 217]).\n\nThus, for each framework (no matter whether it describes empirical\nobjects, abstract objects, or a mix of both), one can formulate both\nsimple and complex existential statements. According to Carnap, each\nsimple existential statement is either empirical or analytic. If a\nsimple statement is empirical, its truth value can be determined by a\ncombination of empirical inquiry and consideration of the linguistic\nrules governing the framework; if the simple existential statement is\nanalytic, then its truth value can be determined simply by considering\nthe linguistic rules governing the framework. Whereas the simple\nexistential statements that require empirical investigation assert the\nexistence of possible concrete entities (like ‘tables’\nor ‘unicorns’), the simple existential statements that are\nanalytic assert the existence of abstract entities. Let us call this\ncriterion for asserting the existence of abstract objects the\ncriterion of linguistic rules.\n\nThe case of mixed frameworks poses some difficulties for the view.\nAccording to the Criterion of Linguistic Rules,\n\n\\(x\\) is abstract iff “\\(x\\) exists” is analytic in the\nrelevant language.\n\nBut this criterion suggests that impure sets,\nobject-dependent properties, abstract artifacts, and the rest are not\nabstract. For this criterion appears to draw a line between certain\npure abstract entities and everything else. The truth of simple\nexistence statements about \\(\\{\\textrm{Bob Dylan}\\}\\) or\nDickens’ A Christmas Carol, which usually are\nconsidered abstract entities, does not depend solely on linguistic\nrules. The same goes for simple and complex existential statements\nwith general terms such as ‘novel’, ‘legal\nstatute’, etc.\n\nIn the end, though, Carnap doesn’t seem to be either a realist\nor nominalist about objects (abstract or concrete). Carnap rejects the\nquestion whether these objects are real in a metaphysical sense. But,\ncontrary to the nominalist, he rejects the idea that we can truly deny\nthe real existence of abstract objects (i.e., a denial that is\nexternal to a linguistic framework). This attitude, which settles the\nquestion of which framework to adopt on pragmatic grounds (e.g., which\nframework best helps us to make sense of the data to be explained), is\nthe reason why we’ve labeled his view as a way of weakening\nexistence. See the entry on\n Carnap\n for further details.\n\nProposals by other philosophers are related to Carnap’s view.\nResnik (1997, Part Two) has put forward a postulational\nepistemology for the existence of mathematical objects. According\nto this view, all one has to do to ensure the existence of\nmathematical objects is to use a language to posit mathematical\nobjects and to establish a consistent mathematical theory for\n them.[16]\n Nevertheless, their existence does not result from their being\nposited. Instead, we recognize those objects as existent because a\nconsistent mathematical theory for them has been developed. Resnik\nrequires both a linguistic stipulation for considering mathematical\nobjects and a coherency condition for recognizing them as existent.\nThomasson (2015, 30–34) advocates for an approach which she\ntakes to be inherited from Carnap. She calls it easy\nontology. Since she is not trying to find ultimate categories or\na definitive list of basic (abstract or concrete) objects, she prefers\na simpler kind of realism (see Thomasson 2015, 145–158). She\nargues that everyday uses of existential statements provide acceptable\nontological commitments when those assertions are supported either by\nempirical evidence or merely by the rules of use that govern general\nterms (e.g., sortal terms); in both cases she says that\n“application conditions” for a general term are fulfilled\n(see Thomasson 2015, 86, 89–95). She, too, therefore offers a\ncriterion of linguistic rules for accepting abstract objects.\nGiven her defense of simple realism, it appears that she takes both\nobservable objects and theoretical entities in science as\nconcrete.\n3.7.2 The Criterion of Minimalism\n\nIn what follows, two ways of formulating criteria for the\nabstract/concrete distinction are considered. The views start with the\nidea that our concept of an object allows for objects whose existence\nplaces very few demands on reality over and above the demands imposed\nby claims that do not mention abstract objects. Those philosophers who\nmaintain this philosophical thesis are what Linnebo (2012) calls\nmetaontological minimalists. Their proposals are typically\nput forward in connection with issues in the philosophy of\nmathematics, but then applied to other domains.\n\nParsons (1990), Resnik (1997), and Shapiro (1997) contend that, in the\ncase of mathematical theories, coherence suffices for the existence of\nthe objects mentioned in those\n theories.[17]\n They do not offer an explicit criterion for distinguishing abstract\nand concrete objects. Nevertheless, their proposals implicitly draw\nthe distinction; abstract objects are those objects that exist in\nvirtue of the truth of certain modal claims. In particular, the\nexistence of mathematical objects is “grounded in” pure\nmodal truths. For example, numbers exist “in virtue of”\nthe fact that there could have been an \\(\\omega\\)-sequence of objects;\nsets exist because there might be entities that satisfy the axioms of\none or another set theory, etc. Since these pure modal truths are\nnecessary, this explains why pure abstract objects exist necessarily.\nIt also explains a sense in which they are insubstantial: their\nexistence is grounded in truths that do not (on the face of it)\nrequire the actual existence of anything at\n all.[18]\n\n\nLinnebo (2018) advances a proposal about how to conceive abstract\nobjects by revising our understanding of Fregean biconditional\nprinciples of abstraction (see\n subsection 3.4).\n Some philosophers take these Fregean abstraction principles to be\nanalytic sentences. For example, Hale & Wright (2001; 2009)\nconsider the two sides of an abstraction principle as equivalent as a\nmatter of meaning; they ‘carve up content’ in different\nways (to use Frege’s metaphor). But Linnebo (2018, 13–14)\nrejects this view and the view that such biconditional principles are\nanalytic.\n\nHe suggests instead that we achieve reference to abstract (and other\nobjects) by means of a sufficiency operator, \\(\\Rightarrow\\),\nwhich he takes to be a strengthening of the material conditional. He\nstarts with conditional principles of the form “if\n\\(Rab\\), then \\(f(a) \\! =\\! f(b)\\)” (e.g., “if \\(a\\) and\n\\(b\\) are parallel, then the direction of \\(a\\) = the direction of\n\\(b\\)”) and takes the right-hand side to be reconceptualization\nof the left-hand side. He represents these claims as \\(\\phi\n\\Rightarrow \\psi\\), where the new operator\n‘\\(\\Rightarrow\\)’ is meant to capture the intuitive idea\nthat \\(\\phi\\) is (conceptually) sufficient\nfor \\(\\psi\\), or all that is required for\n\\(\\psi\\) is \\(\\phi\\). For \\(\\phi\\) to be sufficient for\n\\(\\psi\\), sufficiency must be stronger than\nmetaphysically implies but weaker than analytically\nimplies (see Linnebo 2018, 15). The notion Linnebo considers is a\n‘species of metaphysical grounding’. Hence, sufficiency\nstatements allow us to conceptualize statements mentioning abstract\nobjects (or other problematic objects) in terms of metaphysically less\nproblematic or non-problematic objects.\n\nIt is important for Linnebo that sufficiency be asymmetric. He\nwouldn’t accept mutual sufficiency, i.e., principles of the form\n\\(Rab \\Leftrightarrow f(a) \\! =\\! f(b)\\), since these would imply that\nboth sides are equivalent as a matter of meaning. Instead, the point\nis that the seemingly unproblematic claim \\(Rab\\) renders the claim\n\\(f(a) \\! =\\! f(b)\\) unproblematic, and this is best expressed by\nsufficiency statements of the form \\(Rab \\Rightarrow f(a) \\! =\\!\nf(b)\\), on which the left side grounds the right side. So\nLinnebo’s notion of reconceptualization is not the Fregean\nnotion of recarving of content.\n\nMoreover, in a sufficiency statement, Linnebo doesn’t require\nthat the relation \\(R\\) be an equivalence relation; he requires only\nthat \\(R\\) be symmetric and transitive. It need not be reflexive, for\nthe domain might contain entities \\(x\\) such that \\(\\neg Rxx\\) (e.g.,\nin the case of the sufficiency statement for directions, not every\nobject \\(x\\) in the domain is such that \\(x\\) is parallel with\n\\(x\\)—being parallel is restricted to lines). Linnebo calls such\nsymmetric and transitive relations unity relations. When a\nsufficiency statement—\\(Rab \\Rightarrow f(a) \\! =\\!\nf(b)\\)—holds, then new objects are identified. The new objects\nare specified in terms of the less problematic entities related by\n\\(R\\); for example, directions become specified by lines that are\nparallel. According to Linnebo, the parallel lines become\nspecifications of the new objects. A unity relation \\(R\\) is\ntherefore the starting point for developing a sufficient (but not\nnecessary and sufficient) condition for reference.\n\nSometimes the new objects introduced by conditional principles do not\nmake demands on reality; when that happens, they are said to be\nthin (for example, directions only require that there be\nparallel lines). However, when the new objects introduced by\nsufficiency statements make more substantial demands on reality, the\nobjects are considered thick. Suppose \\(Rab\\) asserts \\(a\\)\nand \\(b\\) are spatiotemporal parts of the same cohesive and naturally\nbounded whole. Then \\(a\\) and \\(b\\) become specifications for physical\nbodies via the following principle: \\(Rab \\Rightarrow \\mathrm{Body}(a)\n\\! =\\! \\mathrm{Body}(b)\\). In this case, the principle “makes a\nsubstantial demand on the world” because it requires checking\nthat there are spatiotemporal parts constituting a continuous\nstretch of solid stuff (just looking at the spatiotemporal parts\ndoes not suffice to determine whether they constitute to a body; see\nLinnebo 2018, 45).\n\nHowever, Linnebo does not identify being abstract with being thin\n(2012, 147), for there are thin objects in a relative sense that are\nnot abstract, namely those that make no substantial demands on the\nworld beyond those introduced in terms of some antecedently given\nobjects. The mereological sum of your left hand and your laptop makes\nno demand on the world beyond the demands of its\n parts.[19]\n Instead, he suggests that abstract objects are those that are thin\nand that have a shallow nature. The notion of shallow\nnature is meant to capture “the intuitive idea that any\nquestion that is solely about \\(F\\text{s}\\) has an answer that can be\ndetermined on the basis of any given specifications of these\n\\(F\\text{s}\\)” (2018, 192–195). For example, directions\nhave a shallow nature because any question about directions (e.g., are\nthey orthogonal, etc.?) can be determined solely on the basis of the\nlines that specify them. Shapes have a shallow nature because any\nquestion about them (e.g., are they triangular, circular, etc.?) can\nbe determined solely on the basis of their underlying concrete\nfigures. By contrast, mereological sums of concrete objects are\nnot shallow because there are questions about them that\ncannot be answered solely on the basis of their specifications; for\ninstance, the weight of the mereological sum of your laptop and your\nleft hand depends not only on their combination but also on the\ngravitational field in which they are\n located.[20]\n\n\nLinnebo thus contrasts abstract objects, which are thin and have a\nshallow nature, with concrete objects, which do not have a shallow\nnature. Linnebo extends this view in several ways. He constructs an\naccount of mathematical objects that goes beyond the way of\nabstraction principles by providing a reconstruction of set\ntheory in terms of ‘dynamic abstraction’ (2018,\nch. 3). This form of minimalism also allows for abstract objects\nof a mixed nature; namely, those that are thin relative to\nother objects. For example, the type of the letter ‘A’ is\nabstract because it is thin and has a shallow nature, but it is thin\nwith respect the tokens of the letter ‘A’.\n\nThis view, as Linnebo himself admits, faces some problems. One of them\nis that the methodologies used by working mathematicians, such as\nclassical logic, impredicative definitions, and taking arbitrary\nsubcollections of infinite domains, seem to presuppose objects that\nare more independent, i.e., objects that don’t have a shallow\nnature (2018, 197; for a discussion of independence, see \nSection 4.1 of the entry on\n platonism in mathematics). \nAnother problem (2018, 195) is that\nin order for an object to count as having a shallow nature,\nan intrinsic unity relation has to be available. An\ninvestigation is required to establish that there is such an intrinsic\nunity relation in each case. It is far from clear that a conditional\nprinciple with an intrinsic unity relation is available for\neach of problematic cases mentioned in this entry, such as chess,\nlegal institutions or the English language. Finally, Linnebo\ndoesn’t discuss the question of whether sets of concrete\nurelements are themselves abstract or concrete. At present, there may\nbe an important question left open by his theory that other theories\nof abstract objects answer.\n3.8 Eliminativism\n\nWe come finally to proposals that reject the abstract/concrete\ndistinction. We can consider three cases. First, there are the\nnominalists who both reject abstract entities and reject the\ndistinction as illegitimate. They focus on arguing against the\nformulations of the distinction proposed in the literature. A second\ngroup of eliminativists reject real objects of any kind, thereby\ndismissing the distinction as irrelevant; these are the ontological\nnihilists. A final group of eliminativists agree that there are\nprototypical cases of concrete objects and abstract objects, but\nconclude that a rigorous philosophical distinction can’t be made\nclearly enough to have any explanatory power (see Sider 2013, 287).\nThis recalls Lewis’ pessimism (1986a, 81–86) about the\npossibility of establishing a distinction that is sufficiently clear\nto be theoretically interesting.\n4. Further Reading\n\nBerto & Plebani (2015) provide an useful introduction to ontology\nand metaontology. Putnam (1971) makes the case for abstract objects on\nscientific grounds. Bealer (1993) and Tennant (1997) present a\npriori arguments for the necessary existence of abstract\nentities. Fine (2002) systematically studies of abstraction principles\nin the foundations of mathematics. Wetzel (2009) examines the\ntype-token distinction, argues that types are abstract objects while\nthe tokens of those types are their concrete instances, and shows how\ndifficult it is to paraphrase away the many references to types that\noccur in the sciences and natural language. Zalta (2020) develops a\ntype-theoretic framework for higher-order abstract objects (which\nincludes abstract properties and abstract relations in addition to\nordinary properties and relations) and offers both comparisons to\nother type theories and applications in philosophy and linguistics.\nMoltmann (2013) investigates the extent to which abstract objects are\nneeded when developing a semantics of natural language; in this book,\nand also in her article (2020), she defends a\n‘core-periphery’ distinction and suggests that natural\nlanguage ontology contains references to abstract objects only in its\nperiphery. Falguera and Martínez-Vidal (2020) have edited a\nvolume in which contributors present positions and debates about\nabstract objects of different kinds and categories, in different\nfields in philosophy.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Armstrong, David, 1978, <em>Universals and Scientific Realism\n(Volume I: Nominalism and Realism; Volume II: A Theory of\nUniversals)</em>, New York: Cambridge University Press.",
                "–––, 1989, <em>Universals: An Opinionated\nIntroduction</em>, Boulder: Westview Press.",
                "Azzouni, Jody, 1997a, “Applied Mathematics, Existential\nCommitment and the Quine-Putnam Indispensability Thesis,”\n<em>Philosophia Mathematica</em>, 3(5): 193–209.",
                "–––, 1997b, “Thick Epistemic Access:\nDistinguishing the Mathematical from the Empirical,” <em>The\nJournal of Philosophy</em>, 94(9):\n472–484. doi:10.2307/2564619",
                "–––, 2004, <em>Deflating Existential\nConsequence: A Case for Nominalism</em>, New York: Oxford University\nPress. doi:10.1093/0195159888.001.0001",
                "–––, 2010, <em>Talking About Nothing: Numbers,\nHallucinations and Fictions</em>, Oxford: Oxford University\nPress.",
                "Baker, Alan, 2005, “Are There Genuine Mathematical\nExplanations of Physical Phenomena?” <em>Mind</em>, 114(454):\n223–238.",
                "–––, 2009, “Mathematical Explanation in\nScience,” <em>British Journal for the Philosophy of\nScience</em>, 60(3): 611–633.",
                "–––, 2017, “Mathematics and Explanatory\nGenerality,” <em>Philosophia Mathematica</em>, 25(2):\n194–209. doi:10.1093/philmat/nkw021",
                "Balaguer, Mark, 1995, “A Platonist Epistemology,”\n<em>Synthese</em>, 103(3): 303–325.",
                "–––, 1996, “A Fictionalist Account of the\nIndispensable Applications of Mathematics,” <em>Philosophical\nStudies: An International Journal for Philosophy in the Analytic\nTradition</em>, 83(3): 291–314.",
                "–––, 1998, <em>Platonism and Anti-Platonism in\nMathematics</em> p. 240, New York: Oxford University Press.",
                "–––, 2020, “Moral Folkism and the\nDeflation of (Lots of) Normative and Metaethics,” in José\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 297–318.",
                "Baron, Samuel, 2016, “Explaining Mathematical\nExplanation,” <em>The Philosophical Quarterly</em>, 66(264):\n458–480. doi:10.1093/pq/pqv123",
                "–––, 2020, “Purely Physical Explananda:\nBistability in Perception,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 17–34.",
                "Bealer, George, 1993, “Universals,” <em>The Journal of\nPhilosophy</em>, 90(1): 5–32. doi:10.2307/2940824",
                "Benacerraf, Paul, 1965, “What Numbers Could Not Be,”\n<em>Philosophical Review</em>, 74(1): 47–73.",
                "–––, 1973, “Mathematical Truth,”\n<em>Journal of Philosophy</em>, 70(19): 661–679.",
                "Berto, Francesco, and Plebani, Matteo, 2015, <em>Ontology and\nMetaontology: A Contemporary Guide</em>, London; New York: Bloomsbury\nAcademic.",
                "Bolzano, Bernard, 1837, <em>Wissenschaftslehre</em>, Sulzbach:\nJ. E.  v. Seidel.",
                "Brentano, Franz, 1874, <em>Psychologie Vom Empirischen\nStandpunkt</em>, Leipzig: Duncker &amp; Humblot.",
                "Bueno, Otávio, 2008a, “Nominalism and Mathematical\nIntuition,” <em>Protosociology</em>, 25: 89–107.",
                "–––, 2008b, “Truth and Proof,”\n<em>Manuscrito</em>, 31(1): 419–440.",
                "–––, 2020, “Contingent Abstract\nObjects,” in Falguera &amp; Martínez-Vidal (eds.) 2020,\npp. 91–109.",
                "Burgess, John P., 2005, <em>Fixing Frege</em>, Princeton:\nPrinceton University Press.",
                "Burgess, John P., and Rosen, Gideon, 1997, <em>A Subject with No\nObject: Strategies for Nominalistic Interpretation of\nMathematics</em>, Oxford: Oxford University Press.",
                "Carnap, Rudolf, 1950 [1956], “Empiricism, Semantics, and\nOntology,” <em>Revue Internationale de Philosophie</em>, 4(11):\n20–40; reprinted with revisions in Rudolf Carnap, <em>Meaning and\nNecessity</em>, expanded edition, Chicago: Chicago University Press, 1956,\npp. 205–221.",
                "Chalmers, David, 1996, <em>The Conscious Mind</em>, Oxford: Oxford\nUniversity Press.",
                "Colyvan, Mark, 2001, <em>The Indispensability of Mathematics</em>,\nOxford: Oxford University Press.",
                "–––, 2010, “There Is No Easy Road to\nNominalism,” <em>Mind</em>, 119(474):\n285–306. doi:10.1093/mind/fzq014",
                "Colyvan, Mark, and Zalta, Edward N., 1999, “Mathematics:\nTruth and Fiction?” <em>Philosophia Mathematica</em>, 7(3):\n336–349. doi:10.1093/philmat/7.3.336",
                "Cook, Roy, 2003, “Iteration One More Time,” <em>Notre\nDame Journal of Formal Logic</em>, 44(2): 63–92.",
                "Cowling, Sam, 2017, <em>Abstract Entities</em>, London:\nRoutledge.",
                "Crane, Tim, and Mellor, D. H., 1990, “There Is No Question\nof Physicalism,” <em>Mind</em>, 99(394): 185–206.",
                "Dedekind, Richard, 1888 [1963], <em>Was Sind Und Was Sollen Die\nZahlen</em>, Braunschweig: Vieweg und Sohn; English translation,\n“The Nature and Meaning of Numbers”, in R. Dedekind,\n<em>Essays on the Theory of Numbers</em>, Wooster Woodruff Beman (trans.),\nNew York: Dover, 1963, pp. 29–115.",
                "Donato-Rodríguez, Xavier, and Falguera, José L.,\n2020, “The Nature of Scientific Models: Abstract Artifacts That\nDetermine Fictional Systems,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 151–171.",
                "Dummett, Michael, 1973, <em>Frege: Philosophy of Language,</em>\nLondon: Duckworth.",
                "Enoch, David, 2011, <em>Taking Morality Seriously: A Defense of\nRobust Realism</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780199579969.001.0001",
                "–––, 2016, “Indispensability Arguments in\nMetaethics: Even Better Than in Mathematics?” in Uri D.\nLeibowitz &amp; Neil Sinclair (eds.), <em>Explanation in Ethics and\nMathematics</em>, Oxford: Oxford University Press.",
                "Falguera, José L., and Martínez-Vidal, Concha\n(eds.), 2020, <em>Abstract Objects: For and Against</em> (Synthese\nLibrary: Volume 422), Cham, Switzerland: Springer.",
                "Field, Hartry, 1980, <em>Science Without Numbers</em>, Princeton:\nPrinceton University Press.",
                "–––, 1989, <em>Realism, Mathematics and\nModality</em>, Oxford: Basil Blackwell.",
                "Fine, Kit, 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8:\n1–16. doi:10.2307/2214160",
                "–––, 2002, <em>The Limits of Abstraction</em>,\nOxford; New York: Clarendon Press.",
                "–––, 2005, “Our Knowledge of Mathematical\nObjects,” in <em>Oxford Studies in Epistemology: Volume 1</em>,\npp. 89–110, Oxford: Oxford University Press.",
                "Frege, Gottlob, 1884, <em>Grundlagen Der Arithmetik</em>, Breslau:\nW. Koebner.",
                "–––, 1918, “Der Gedanke: Eine Logische\nUntersuchung,” <em>Beiträge Zur Philosophie Des Deutschen\nIdealismus</em>, I: 58–77.",
                "Goodman, Nelson, and Quine, W. V. O., 1947, “Steps Toward a\nConstructive Nominalism,” <em>The Journal of Symbolic\nLogic</em>, 12(4): 105–122.",
                "Gödel, Kurt, 1964, “What Is Cantor’s Continuum\nProblem?” in P. Benacerraf &amp; H. Putnam (eds.),\n<em>Philosophy of Mathematics: Selected Readings</em>, 2nd edition,\npp. 254–270, Cambridge: Cambridge University Press.",
                "Hale, Bob, 1987, <em>Abstract Objects</em>, Oxford:\nBlackwell.",
                "Hale, Bob, and Wright, Crispin, 2001, <em>The Reason’s\nProper Study: Essays Towards a Neo-Fregean Philosophy of\nMathematics</em>, Oxford: Oxford University Press.",
                "–––, 2009, “The Metaontology of\nAbstraction,” in D. Chalmers, D. Manley, &amp; R. Wasserman\n(eds.), <em>Metametaphysics</em>, pp. 178–212, New York: Oxford\nUniversity Press.",
                "Hellman, Geoffrey, 1989, <em>Mathematics Without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Clarendon Press.",
                "Hirsch, Eli, 2002, “Quantifier Variance and Realism,”\n<em>Philosophical Issues</em>, 12(1): 51–73.\ndoi:10.1111/j.1758-2237.2002.tb00061.x",
                "–––, 2011, <em>Quantifier Variance and Realism:\nEssays in Metaontology</em>, New York: Oxford University Press.",
                "Inwagen, Peter van, 1977, “Creatures of Fiction,”\n<em>American Philosophical Quarterly</em>, 14(4): 299–308.",
                "–––, 1983, “Fiction and\nMetaphysics,” <em>Philosophy and Literature</em>, 7(1):\n67–77.  doi:10.1353/phl.1983.0059",
                "Jackson, Frank, 1982, “Epiphenomenal Qualia,” <em>The\nPhilosophical Quarterly</em>, 32(127): 127–136.\ndoi:10.2307/2960077 ",
                "Kalderon, Mark Eli, 2005, <em>Fictionalism in Metaphysics</em>,\nOxford: Oxford University Press.",
                "Katz, Jerrold, 1980, <em>Language and Other Abstract Objects</em>,\nLanham, MD: Rowman &amp; Littlefield.",
                "Knowles, Robert, and Saatsi, Juha, 2019, “Mathematics and\nExplanatory Generality: Nothing but Cognitive Salience,”\n<em>Erkenntnis</em>.  doi:10.1007/s10670-019-00146-x",
                "Kripke, Saul, 1973 [2013], <em>Reference and Existence: The John\nLocke Lectures</em>, Oxford: Oxford University Press, 2013. [These\nlectures were given in 1973 but remained unpublished until 2013.]",
                "Leibowitz, Uri D., and Sinclair, Neil (eds.), 2016,\n<em>Explanation in Ethics and Mathematics: Debunking and\nDispensability</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198778592.001.0001",
                "Leng, Mary, 2010, <em>Mathematics and Reality</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2020, “Is There a Fact of the Matter\nAbout the Existence of Abstract Objects?” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 111–130.",
                "Lewis, David, 1986a, <em>On the Plurality of Worlds</em>, Oxford:\nBlackwell.",
                "–––, 1986b, “Events”, in\nD. Lewis, <em>Philosophical Papers</em> (Volume II), Oxford:\nOxford University Press, pp. 241–269. ",
                "–––, 2007, “Events,” in\n<em>Philosophical Papers: Volume Ii</em>, pp. 241–269, Oxford:\nOxford University Press.",
                "Linnebo, 2012, “Metaontological Minimalism,”\n<em>Philosophy Compass</em>, 7(2):\n139–151. doi:10.1111/j.1747-9991.2011.00471.x",
                "–––, 2018, <em>Thin Objects: An Abstractionist\nAccount</em>, Oxford: Oxford University\nPress. doi:10.1093/oso/9780199641314.001.0001",
                "Linsky, Bernard, and Zalta, Edward N., 1995, “Naturalized\nPlatonism Versus Platonized Naturalism,” <em>The Journal of\nPhilosophy</em>, 92(10): 525–555. doi:10.2307/2940786",
                "Locke, John, 1689, <em>An Essay Concerning Human\nUnderstanding</em>, Oxford: Clarendon Press.",
                "Maddy, Penelope, 1990, <em>Realism in Mathematics</em>, New York;\nLondon: Clarendon Press.",
                "–––, 1995, “Naturalism and\nOntology,” <em>Philosophia Mathematica</em>, 3(3):\n248–270. doi:10.1093/philmat/3.3.248",
                "–––, 1997, <em>Naturalism in Mathematics</em>,\nOxford: Oxford University Press.",
                "–––, 2011, <em>Defending the Axioms: On the\nPhilosophical Foundations of Set Theory</em>, Oxford: Oxford University\nPress.",
                "Malament, David, 1982, “Review of Field (1980),”\n<em>The Journal of Philosophy</em>, 79: 523–34.",
                "Mally, Ernst, 1912, <em>Gegenstandstheoretische Grundlagen Der\nLogik Und Logistik</em>, Leipzig: Barth.",
                "Martínez-Vidal, Concha, and Rivas-de-Castro, Navia, 2020,\n“Description, Explanation and Ontological Commitment,” in\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 35–57.",
                "Meinong, Alexius, 1904, “Über\nGegenstandstheorie,” in A. Meinong (ed.), <em>Untersuchungen Zur\nGegenstandstheorie Und Psychologie [Investigations in Theory of\nObjects and Psychology]</em>, pp. 1–51, Leipzig: Barth.",
                "–––, 1915, <em>Über Möglichkeit Und\nWahrscheinlichkeit. Beiträge Zur Gegenstandstheorie Und\nErkenntnistheorie [on Possibility and Probability. Contributions to\nObject Theory and Epistemology]</em>, Leipzig: Barth.",
                "Melia, Joseph, 2000, “Weaseling Away the Indispensability\nArgument,” <em>Mind</em>, 109(435): 455–479.",
                "–––, 2002, “Response to Colyvan,”\n<em>Mind</em>, 111(441): 75–79.",
                "Moltmann, Friederike, 2013, <em>Abstract Objects and the Semantics\nof Natural Language</em>, Oxford: Oxford University Press.",
                "–––, 2020, “Abstract Objects and the\nCore-Periphery Distinction in the Ontological and the Conceptual\nDomain of Natural Language,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 255–276.",
                "Nodelman, Uri, and Zalta, Edward N., 2014, “Foundations for\nMathematical Structuralism,” <em>Mind</em>, 123(489):\n39–78. doi:10.1093/mind/fzu003",
                "Parsons, Charles, 1990, “The Structuralist View of\nMathematical Objects,” <em>Synthese</em>, 84(3):\n303–346.",
                "Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven:\nYale University Press.",
                "Popper, Karl, 1968, “Epistemology Without a Knowing\nSubject,” in <em>Logic, Methodology, and Philosophy of Science\nIii</em>, pp. 333–373, Amsterdam: North Holland.",
                "Putnam, Hilary, 1967, “Mathematics Without\nFoundations,” <em>The Journal of Philosophy</em>, 64(1):\n5–22.",
                "–––, 1971, <em>Philosophy of Logic</em>, London:\nHarper; Row.",
                "–––, 1987, <em>The Many Faces of Realism</em>,\nLa Salle: Open Court.",
                "–––, 1990, <em>Realism with a Human Face</em>,\nCambridge, MA: Harvard University Press.",
                "Quine, W. V. O., 1948, “On What There Is,” <em>The\nReview of Metaphysics</em>, 2(5): 21–38.",
                "–––, 1960, <em>Word and Object</em>, Cambridge,\nMA: The MIT Press.",
                "–––, 1969, <em>Ontological Relativity and Other\nEssays</em>, New York: Columbia University Press.",
                "–––, 1976, <em>The Ways of Paradox and Other\nEssays</em>, Cambridge, MA: Harvard University Press.",
                "Rayo, Agustín, 2013, <em>The Construction of Logical\nSpace</em>, Oxford: Oxford University Press.",
                "Resnik, Michael D., 1982, “Mathematics as a Science of\nPatterns: Epistemology,” <em>Noûs</em>, 16(1):\n95–105.  doi:10.2307/2215419",
                "–––, 1997, <em>Mathematics as a Science of\nPatterns</em> p. 290, Oxford: Oxford University\nPress. doi:10.1093/0198250142.001.0001",
                "Rosen, Gideon, 1994, “Objectivity and Modern Idealism: What\nIs the Question?” in M. Michael &amp; J. O’Leary-Hawthorne\n(eds.), <em>Philosophy in Mind</em>, pp. 277–319, Dordrecht:\nSpringer.",
                "–––, 2011, “The Reality of Mathematical\nObjects,” in J. Polkinghorne (ed.), <em>Meaning in\nMathematics</em>, pp. 113–131, Oxford: Oxford University\nPress.",
                "Rosen, Gideon, and Yablo, Stephen, 2020, “Solving the Caesar\nProblem – with Metaphysics,” in A. Miller (ed.),\n<em>Logic, Language and Mathematics: Themes from the Philosophy of\nCrispin Wright</em>, pp. 116–131, Oxford: Oxford University\nPress.",
                "Saatsi, Juha, 2011, “The Enhanced Indispensability Argument:\nRepresentational Versus Explanatory Role of Mathematics in\nScience,” <em>The British Journal for the Philosophy of\nScience</em>, 62(1): 143–154.",
                "Sainsbury, Mark, 2009, <em>Fiction and Fictionalism</em>, London:\nRoutledge.",
                "Shapiro, Stewart, 1997, <em>Philosophy of Mathematics: Structure\nand Ontology</em>, New York: Oxford University\nPress. doi:10.1093/0195139305.001.0001",
                "Sider, Theodore, 2007, “Parthood,” <em>The\nPhilosophical Review</em>, 116(1):\n51–91. doi:10.1215/00318108-2006-022",
                "–––, 2009, “Ontological Realism,” in\nD.  Chalmers, D. Manley, &amp; R. Wasserman (eds.),\n<em>Metametaphysics</em>, pp. 384–423, Oxford: Oxford University\nPress.",
                "–––, 2013, “Against Parthood,” in\nKaren Bennett and Dean W. Zimmerman (eds.), <em>Oxford Studies in\nMetaphysics</em>, vol. 8, Oxford: Oxford University Press,\npp. 237–93.",
                "Steiner, Mark, 1975, <em>Mathematical Knowledge</em>, Ithaca:\nCornell University Press.",
                "Swoyer, Chris, 2007, “Abstract Entities,” in T. Sider,\nJ.  Hawthorne, &amp; D. W. Zimmerman (eds.), <em>Contemporary Debates\nin Metaphysics</em>, pp. 11–31, Malden, MA:\nWiley-Blackwell.",
                "Szabó, Zoltan Gendler, 2003, “Nominalism,” in\n<em>Oxford Handbook of Metaphysics</em>, pp. 11–45, Oxford:\nOxford University Press.",
                "Tennant, Neil, 1997, “On the Necessary Existence of\nNumbers,” <em>Noûs</em>, 31(3):\n307–336. doi:10.1111/0029-4624.00048",
                "Thomasson, Amie L., 1999, <em>Fiction and Metaphysics</em>,\nCambridge: Cambridge University Press.",
                "–––, 2015, <em>Ontology Made Easy</em>, Oxford:\nOxford University Press.",
                "Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: The MIT Press.",
                "Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.",
                "Yablo, Stephen, 1998, “Does Ontology Rest on a\nMistake?” <em>Proceedings of the Aristotelian Society\n(Supplementary Volume)</em>, 72(1):\n229–262. doi:10.1111/1467-8349.00044",
                "–––, 2001, “Go Figure: A Path Through\nFictionalism,” <em>Midwest Studies in Philosophy</em>, 25:\n72–102. doi:10.1111/1475-4975.00040",
                "–––, 2002, “Abstract Objects: A Case\nStudy,” <em>Philosophical Issues</em>, 12(1):\n220–240.",
                "–––, 2009, <em>Thoughts: Papers on Mind,\nMeaning, and Modality</em>, New York: Oxford University Press.",
                "–––, 2010, “The Myth of the Seven,”\nin <em>Things: Papers on Objects, Events, and Properties</em>, pp.\n233–245, Oxford: Oxford University Press.",
                "–––, 2014, <em>Aboutness</em>, Princeton:\nPrinceton University Press.",
                "Zalta, Edward N., 1983, <em>Abstract Objects: An Introduction to\nAxiomatic Metaphysics</em>, Dordrecht: D. Reidel.",
                "–––, 1988, <em>Intensional Logic and Metaphysics\nof Intentionality</em>, Cambridge, MA: The MIT Press.",
                "–––, 1993, “Twenty-Five Basic Theorems in\nSituation and World Theory,” <em>Journal of Philosophical\nLogic</em>, 22: 385–428.",
                "–––, 2006, “Essence and Modality,”\n<em>Mind</em>, 115(459): 659–693.",
                "–––, 2020, “Typed Object Theory,” in\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 59–88."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Armstrong, David, 1978, <em>Universals and Scientific Realism\n(Volume I: Nominalism and Realism; Volume II: A Theory of\nUniversals)</em>, New York: Cambridge University Press.</li>\n<li>–––, 1989, <em>Universals: An Opinionated\nIntroduction</em>, Boulder: Westview Press.</li>\n<li>Azzouni, Jody, 1997a, “Applied Mathematics, Existential\nCommitment and the Quine-Putnam Indispensability Thesis,”\n<em>Philosophia Mathematica</em>, 3(5): 193–209.</li>\n<li>–––, 1997b, “Thick Epistemic Access:\nDistinguishing the Mathematical from the Empirical,” <em>The\nJournal of Philosophy</em>, 94(9):\n472–484. doi:10.2307/2564619</li>\n<li>–––, 2004, <em>Deflating Existential\nConsequence: A Case for Nominalism</em>, New York: Oxford University\nPress. doi:10.1093/0195159888.001.0001</li>\n<li>–––, 2010, <em>Talking About Nothing: Numbers,\nHallucinations and Fictions</em>, Oxford: Oxford University\nPress.</li>\n<li>Baker, Alan, 2005, “Are There Genuine Mathematical\nExplanations of Physical Phenomena?” <em>Mind</em>, 114(454):\n223–238.</li>\n<li>–––, 2009, “Mathematical Explanation in\nScience,” <em>British Journal for the Philosophy of\nScience</em>, 60(3): 611–633.</li>\n<li>–––, 2017, “Mathematics and Explanatory\nGenerality,” <em>Philosophia Mathematica</em>, 25(2):\n194–209. doi:10.1093/philmat/nkw021</li>\n<li>Balaguer, Mark, 1995, “A Platonist Epistemology,”\n<em>Synthese</em>, 103(3): 303–325.</li>\n<li>–––, 1996, “A Fictionalist Account of the\nIndispensable Applications of Mathematics,” <em>Philosophical\nStudies: An International Journal for Philosophy in the Analytic\nTradition</em>, 83(3): 291–314.</li>\n<li>–––, 1998, <em>Platonism and Anti-Platonism in\nMathematics</em> p. 240, New York: Oxford University Press.</li>\n<li>–––, 2020, “Moral Folkism and the\nDeflation of (Lots of) Normative and Metaethics,” in José\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 297–318.</li>\n<li>Baron, Samuel, 2016, “Explaining Mathematical\nExplanation,” <em>The Philosophical Quarterly</em>, 66(264):\n458–480. doi:10.1093/pq/pqv123</li>\n<li>–––, 2020, “Purely Physical Explananda:\nBistability in Perception,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 17–34.</li>\n<li>Bealer, George, 1993, “Universals,” <em>The Journal of\nPhilosophy</em>, 90(1): 5–32. doi:10.2307/2940824</li>\n<li>Benacerraf, Paul, 1965, “What Numbers Could Not Be,”\n<em>Philosophical Review</em>, 74(1): 47–73.</li>\n<li>–––, 1973, “Mathematical Truth,”\n<em>Journal of Philosophy</em>, 70(19): 661–679.</li>\n<li>Berto, Francesco, and Plebani, Matteo, 2015, <em>Ontology and\nMetaontology: A Contemporary Guide</em>, London; New York: Bloomsbury\nAcademic.</li>\n<li>Bolzano, Bernard, 1837, <em>Wissenschaftslehre</em>, Sulzbach:\nJ. E.  v. Seidel.</li>\n<li>Brentano, Franz, 1874, <em>Psychologie Vom Empirischen\nStandpunkt</em>, Leipzig: Duncker &amp; Humblot.</li>\n<li>Bueno, Otávio, 2008a, “Nominalism and Mathematical\nIntuition,” <em>Protosociology</em>, 25: 89–107.</li>\n<li>–––, 2008b, “Truth and Proof,”\n<em>Manuscrito</em>, 31(1): 419–440.</li>\n<li>–––, 2020, “Contingent Abstract\nObjects,” in Falguera &amp; Martínez-Vidal (eds.) 2020,\npp. 91–109.</li>\n<li>Burgess, John P., 2005, <em>Fixing Frege</em>, Princeton:\nPrinceton University Press.</li>\n<li>Burgess, John P., and Rosen, Gideon, 1997, <em>A Subject with No\nObject: Strategies for Nominalistic Interpretation of\nMathematics</em>, Oxford: Oxford University Press.</li>\n<li>Carnap, Rudolf, 1950 [1956], “Empiricism, Semantics, and\nOntology,” <em>Revue Internationale de Philosophie</em>, 4(11):\n20–40; reprinted with revisions in Rudolf Carnap, <em>Meaning and\nNecessity</em>, expanded edition, Chicago: Chicago University Press, 1956,\npp. 205–221.</li>\n<li>Chalmers, David, 1996, <em>The Conscious Mind</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Colyvan, Mark, 2001, <em>The Indispensability of Mathematics</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2010, “There Is No Easy Road to\nNominalism,” <em>Mind</em>, 119(474):\n285–306. doi:10.1093/mind/fzq014</li>\n<li>Colyvan, Mark, and Zalta, Edward N., 1999, “Mathematics:\nTruth and Fiction?” <em>Philosophia Mathematica</em>, 7(3):\n336–349. doi:10.1093/philmat/7.3.336</li>\n<li>Cook, Roy, 2003, “Iteration One More Time,” <em>Notre\nDame Journal of Formal Logic</em>, 44(2): 63–92.</li>\n<li>Cowling, Sam, 2017, <em>Abstract Entities</em>, London:\nRoutledge.</li>\n<li>Crane, Tim, and Mellor, D. H., 1990, “There Is No Question\nof Physicalism,” <em>Mind</em>, 99(394): 185–206.</li>\n<li>Dedekind, Richard, 1888 [1963], <em>Was Sind Und Was Sollen Die\nZahlen</em>, Braunschweig: Vieweg und Sohn; English translation,\n“The Nature and Meaning of Numbers”, in R. Dedekind,\n<em>Essays on the Theory of Numbers</em>, Wooster Woodruff Beman (trans.),\nNew York: Dover, 1963, pp. 29–115.</li>\n<li>Donato-Rodríguez, Xavier, and Falguera, José L.,\n2020, “The Nature of Scientific Models: Abstract Artifacts That\nDetermine Fictional Systems,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 151–171.</li>\n<li>Dummett, Michael, 1973, <em>Frege: Philosophy of Language,</em>\nLondon: Duckworth.</li>\n<li>Enoch, David, 2011, <em>Taking Morality Seriously: A Defense of\nRobust Realism</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780199579969.001.0001</li>\n<li>–––, 2016, “Indispensability Arguments in\nMetaethics: Even Better Than in Mathematics?” in Uri D.\nLeibowitz &amp; Neil Sinclair (eds.), <em>Explanation in Ethics and\nMathematics</em>, Oxford: Oxford University Press.</li>\n<li>Falguera, José L., and Martínez-Vidal, Concha\n(eds.), 2020, <em>Abstract Objects: For and Against</em> (Synthese\nLibrary: Volume 422), Cham, Switzerland: Springer.</li>\n<li>Field, Hartry, 1980, <em>Science Without Numbers</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 1989, <em>Realism, Mathematics and\nModality</em>, Oxford: Basil Blackwell.</li>\n<li>Fine, Kit, 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8:\n1–16. doi:10.2307/2214160</li>\n<li>–––, 2002, <em>The Limits of Abstraction</em>,\nOxford; New York: Clarendon Press.</li>\n<li>–––, 2005, “Our Knowledge of Mathematical\nObjects,” in <em>Oxford Studies in Epistemology: Volume 1</em>,\npp. 89–110, Oxford: Oxford University Press.</li>\n<li>Frege, Gottlob, 1884, <em>Grundlagen Der Arithmetik</em>, Breslau:\nW. Koebner.</li>\n<li>–––, 1918, “Der Gedanke: Eine Logische\nUntersuchung,” <em>Beiträge Zur Philosophie Des Deutschen\nIdealismus</em>, I: 58–77.</li>\n<li>Goodman, Nelson, and Quine, W. V. O., 1947, “Steps Toward a\nConstructive Nominalism,” <em>The Journal of Symbolic\nLogic</em>, 12(4): 105–122.</li>\n<li>Gödel, Kurt, 1964, “What Is Cantor’s Continuum\nProblem?” in P. Benacerraf &amp; H. Putnam (eds.),\n<em>Philosophy of Mathematics: Selected Readings</em>, 2nd edition,\npp. 254–270, Cambridge: Cambridge University Press.</li>\n<li>Hale, Bob, 1987, <em>Abstract Objects</em>, Oxford:\nBlackwell.</li>\n<li>Hale, Bob, and Wright, Crispin, 2001, <em>The Reason’s\nProper Study: Essays Towards a Neo-Fregean Philosophy of\nMathematics</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2009, “The Metaontology of\nAbstraction,” in D. Chalmers, D. Manley, &amp; R. Wasserman\n(eds.), <em>Metametaphysics</em>, pp. 178–212, New York: Oxford\nUniversity Press.</li>\n<li>Hellman, Geoffrey, 1989, <em>Mathematics Without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Clarendon Press.</li>\n<li>Hirsch, Eli, 2002, “Quantifier Variance and Realism,”\n<em>Philosophical Issues</em>, 12(1): 51–73.\ndoi:10.1111/j.1758-2237.2002.tb00061.x</li>\n<li>–––, 2011, <em>Quantifier Variance and Realism:\nEssays in Metaontology</em>, New York: Oxford University Press.</li>\n<li>Inwagen, Peter van, 1977, “Creatures of Fiction,”\n<em>American Philosophical Quarterly</em>, 14(4): 299–308.</li>\n<li>–––, 1983, “Fiction and\nMetaphysics,” <em>Philosophy and Literature</em>, 7(1):\n67–77.  doi:10.1353/phl.1983.0059</li>\n<li>Jackson, Frank, 1982, “Epiphenomenal Qualia,” <em>The\nPhilosophical Quarterly</em>, 32(127): 127–136.\ndoi:10.2307/2960077 </li>\n<li>Kalderon, Mark Eli, 2005, <em>Fictionalism in Metaphysics</em>,\nOxford: Oxford University Press.</li>\n<li>Katz, Jerrold, 1980, <em>Language and Other Abstract Objects</em>,\nLanham, MD: Rowman &amp; Littlefield.</li>\n<li>Knowles, Robert, and Saatsi, Juha, 2019, “Mathematics and\nExplanatory Generality: Nothing but Cognitive Salience,”\n<em>Erkenntnis</em>.  doi:10.1007/s10670-019-00146-x</li>\n<li>Kripke, Saul, 1973 [2013], <em>Reference and Existence: The John\nLocke Lectures</em>, Oxford: Oxford University Press, 2013. [These\nlectures were given in 1973 but remained unpublished until 2013.]</li>\n<li>Leibowitz, Uri D., and Sinclair, Neil (eds.), 2016,\n<em>Explanation in Ethics and Mathematics: Debunking and\nDispensability</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198778592.001.0001</li>\n<li>Leng, Mary, 2010, <em>Mathematics and Reality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2020, “Is There a Fact of the Matter\nAbout the Existence of Abstract Objects?” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 111–130.</li>\n<li>Lewis, David, 1986a, <em>On the Plurality of Worlds</em>, Oxford:\nBlackwell.</li>\n<li>–––, 1986b, “Events”, in\nD. Lewis, <em>Philosophical Papers</em> (Volume II), Oxford:\nOxford University Press, pp. 241–269. </li>\n<li>–––, 2007, “Events,” in\n<em>Philosophical Papers: Volume Ii</em>, pp. 241–269, Oxford:\nOxford University Press.</li>\n<li>Linnebo, 2012, “Metaontological Minimalism,”\n<em>Philosophy Compass</em>, 7(2):\n139–151. doi:10.1111/j.1747-9991.2011.00471.x</li>\n<li>–––, 2018, <em>Thin Objects: An Abstractionist\nAccount</em>, Oxford: Oxford University\nPress. doi:10.1093/oso/9780199641314.001.0001</li>\n<li>Linsky, Bernard, and Zalta, Edward N., 1995, “Naturalized\nPlatonism Versus Platonized Naturalism,” <em>The Journal of\nPhilosophy</em>, 92(10): 525–555. doi:10.2307/2940786</li>\n<li>Locke, John, 1689, <em>An Essay Concerning Human\nUnderstanding</em>, Oxford: Clarendon Press.</li>\n<li>Maddy, Penelope, 1990, <em>Realism in Mathematics</em>, New York;\nLondon: Clarendon Press.</li>\n<li>–––, 1995, “Naturalism and\nOntology,” <em>Philosophia Mathematica</em>, 3(3):\n248–270. doi:10.1093/philmat/3.3.248</li>\n<li>–––, 1997, <em>Naturalism in Mathematics</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2011, <em>Defending the Axioms: On the\nPhilosophical Foundations of Set Theory</em>, Oxford: Oxford University\nPress.</li>\n<li>Malament, David, 1982, “Review of Field (1980),”\n<em>The Journal of Philosophy</em>, 79: 523–34.</li>\n<li>Mally, Ernst, 1912, <em>Gegenstandstheoretische Grundlagen Der\nLogik Und Logistik</em>, Leipzig: Barth.</li>\n<li>Martínez-Vidal, Concha, and Rivas-de-Castro, Navia, 2020,\n“Description, Explanation and Ontological Commitment,” in\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 35–57.</li>\n<li>Meinong, Alexius, 1904, “Über\nGegenstandstheorie,” in A. Meinong (ed.), <em>Untersuchungen Zur\nGegenstandstheorie Und Psychologie [Investigations in Theory of\nObjects and Psychology]</em>, pp. 1–51, Leipzig: Barth.</li>\n<li>–––, 1915, <em>Über Möglichkeit Und\nWahrscheinlichkeit. Beiträge Zur Gegenstandstheorie Und\nErkenntnistheorie [on Possibility and Probability. Contributions to\nObject Theory and Epistemology]</em>, Leipzig: Barth.</li>\n<li>Melia, Joseph, 2000, “Weaseling Away the Indispensability\nArgument,” <em>Mind</em>, 109(435): 455–479.</li>\n<li>–––, 2002, “Response to Colyvan,”\n<em>Mind</em>, 111(441): 75–79.</li>\n<li>Moltmann, Friederike, 2013, <em>Abstract Objects and the Semantics\nof Natural Language</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2020, “Abstract Objects and the\nCore-Periphery Distinction in the Ontological and the Conceptual\nDomain of Natural Language,” in Falguera &amp;\nMartínez-Vidal (eds.) 2020, pp. 255–276.</li>\n<li>Nodelman, Uri, and Zalta, Edward N., 2014, “Foundations for\nMathematical Structuralism,” <em>Mind</em>, 123(489):\n39–78. doi:10.1093/mind/fzu003</li>\n<li>Parsons, Charles, 1990, “The Structuralist View of\nMathematical Objects,” <em>Synthese</em>, 84(3):\n303–346.</li>\n<li>Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven:\nYale University Press.</li>\n<li>Popper, Karl, 1968, “Epistemology Without a Knowing\nSubject,” in <em>Logic, Methodology, and Philosophy of Science\nIii</em>, pp. 333–373, Amsterdam: North Holland.</li>\n<li>Putnam, Hilary, 1967, “Mathematics Without\nFoundations,” <em>The Journal of Philosophy</em>, 64(1):\n5–22.</li>\n<li>–––, 1971, <em>Philosophy of Logic</em>, London:\nHarper; Row.</li>\n<li>–––, 1987, <em>The Many Faces of Realism</em>,\nLa Salle: Open Court.</li>\n<li>–––, 1990, <em>Realism with a Human Face</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Quine, W. V. O., 1948, “On What There Is,” <em>The\nReview of Metaphysics</em>, 2(5): 21–38.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge,\nMA: The MIT Press.</li>\n<li>–––, 1969, <em>Ontological Relativity and Other\nEssays</em>, New York: Columbia University Press.</li>\n<li>–––, 1976, <em>The Ways of Paradox and Other\nEssays</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Rayo, Agustín, 2013, <em>The Construction of Logical\nSpace</em>, Oxford: Oxford University Press.</li>\n<li>Resnik, Michael D., 1982, “Mathematics as a Science of\nPatterns: Epistemology,” <em>Noûs</em>, 16(1):\n95–105.  doi:10.2307/2215419</li>\n<li>–––, 1997, <em>Mathematics as a Science of\nPatterns</em> p. 290, Oxford: Oxford University\nPress. doi:10.1093/0198250142.001.0001</li>\n<li>Rosen, Gideon, 1994, “Objectivity and Modern Idealism: What\nIs the Question?” in M. Michael &amp; J. O’Leary-Hawthorne\n(eds.), <em>Philosophy in Mind</em>, pp. 277–319, Dordrecht:\nSpringer.</li>\n<li>–––, 2011, “The Reality of Mathematical\nObjects,” in J. Polkinghorne (ed.), <em>Meaning in\nMathematics</em>, pp. 113–131, Oxford: Oxford University\nPress.</li>\n<li>Rosen, Gideon, and Yablo, Stephen, 2020, “Solving the Caesar\nProblem – with Metaphysics,” in A. Miller (ed.),\n<em>Logic, Language and Mathematics: Themes from the Philosophy of\nCrispin Wright</em>, pp. 116–131, Oxford: Oxford University\nPress.</li>\n<li>Saatsi, Juha, 2011, “The Enhanced Indispensability Argument:\nRepresentational Versus Explanatory Role of Mathematics in\nScience,” <em>The British Journal for the Philosophy of\nScience</em>, 62(1): 143–154.</li>\n<li>Sainsbury, Mark, 2009, <em>Fiction and Fictionalism</em>, London:\nRoutledge.</li>\n<li>Shapiro, Stewart, 1997, <em>Philosophy of Mathematics: Structure\nand Ontology</em>, New York: Oxford University\nPress. doi:10.1093/0195139305.001.0001</li>\n<li>Sider, Theodore, 2007, “Parthood,” <em>The\nPhilosophical Review</em>, 116(1):\n51–91. doi:10.1215/00318108-2006-022</li>\n<li>–––, 2009, “Ontological Realism,” in\nD.  Chalmers, D. Manley, &amp; R. Wasserman (eds.),\n<em>Metametaphysics</em>, pp. 384–423, Oxford: Oxford University\nPress.</li>\n<li>–––, 2013, “Against Parthood,” in\nKaren Bennett and Dean W. Zimmerman (eds.), <em>Oxford Studies in\nMetaphysics</em>, vol. 8, Oxford: Oxford University Press,\npp. 237–93.</li>\n<li>Steiner, Mark, 1975, <em>Mathematical Knowledge</em>, Ithaca:\nCornell University Press.</li>\n<li>Swoyer, Chris, 2007, “Abstract Entities,” in T. Sider,\nJ.  Hawthorne, &amp; D. W. Zimmerman (eds.), <em>Contemporary Debates\nin Metaphysics</em>, pp. 11–31, Malden, MA:\nWiley-Blackwell.</li>\n<li>Szabó, Zoltan Gendler, 2003, “Nominalism,” in\n<em>Oxford Handbook of Metaphysics</em>, pp. 11–45, Oxford:\nOxford University Press.</li>\n<li>Tennant, Neil, 1997, “On the Necessary Existence of\nNumbers,” <em>Noûs</em>, 31(3):\n307–336. doi:10.1111/0029-4624.00048</li>\n<li>Thomasson, Amie L., 1999, <em>Fiction and Metaphysics</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2015, <em>Ontology Made Easy</em>, Oxford:\nOxford University Press.</li>\n<li>Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: The MIT Press.</li>\n<li>Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.</li>\n<li>Yablo, Stephen, 1998, “Does Ontology Rest on a\nMistake?” <em>Proceedings of the Aristotelian Society\n(Supplementary Volume)</em>, 72(1):\n229–262. doi:10.1111/1467-8349.00044</li>\n<li>–––, 2001, “Go Figure: A Path Through\nFictionalism,” <em>Midwest Studies in Philosophy</em>, 25:\n72–102. doi:10.1111/1475-4975.00040</li>\n<li>–––, 2002, “Abstract Objects: A Case\nStudy,” <em>Philosophical Issues</em>, 12(1):\n220–240.</li>\n<li>–––, 2009, <em>Thoughts: Papers on Mind,\nMeaning, and Modality</em>, New York: Oxford University Press.</li>\n<li>–––, 2010, “The Myth of the Seven,”\nin <em>Things: Papers on Objects, Events, and Properties</em>, pp.\n233–245, Oxford: Oxford University Press.</li>\n<li>–––, 2014, <em>Aboutness</em>, Princeton:\nPrinceton University Press.</li>\n<li>Zalta, Edward N., 1983, <em>Abstract Objects: An Introduction to\nAxiomatic Metaphysics</em>, Dordrecht: D. Reidel.</li>\n<li>–––, 1988, <em>Intensional Logic and Metaphysics\nof Intentionality</em>, Cambridge, MA: The MIT Press.</li>\n<li>–––, 1993, “Twenty-Five Basic Theorems in\nSituation and World Theory,” <em>Journal of Philosophical\nLogic</em>, 22: 385–428.</li>\n<li>–––, 2006, “Essence and Modality,”\n<em>Mind</em>, 115(459): 659–693.</li>\n<li>–––, 2020, “Typed Object Theory,” in\nFalguera &amp; Martínez-Vidal (eds.) 2020,\npp. 59–88.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "analytic/synthetic distinction",
            "Carnap, Rudolf",
            "fictionalism",
            "Frege, Gottlob",
            "mathematics, philosophy of: indispensability arguments in the",
            "mathematics, philosophy of: nominalism",
            "mathematics, philosophy of: Platonism",
            "nominalism: in metaphysics",
            "object",
            "physicalism",
            "Platonism: in metaphysics",
            "states of affairs",
            "types and tokens"
        ],
        "entry_link": [
            {
                "../analytic-synthetic/": "analytic/synthetic distinction"
            },
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../fictionalism/": "fictionalism"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../mathphil-indis/": "mathematics, philosophy of: indispensability arguments in the"
            },
            {
                "../nominalism-mathematics/": "mathematics, philosophy of: nominalism"
            },
            {
                "../platonism-mathematics/": "mathematics, philosophy of: Platonism"
            },
            {
                "../nominalism-metaphysics/": "nominalism: in metaphysics"
            },
            {
                "../object/": "object"
            },
            {
                "../physicalism/": "physicalism"
            },
            {
                "../platonism/": "Platonism: in metaphysics"
            },
            {
                "../states-of-affairs/": "states of affairs"
            },
            {
                "../types-tokens/": "types and tokens"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abstract-objects\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/abstract-objects/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=abstract-objects&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/abstract-objects/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=abstract-objects": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/abstract-objects/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=abstract-objects&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/abstract-objects/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Rayo, A., 2020, “<a href=\"http://web.mit.edu/arayo/www/ut.pdf\" target=\"other\">The Ultra-Thin Conception of Objecthood</a>,” \nunpublished manuscript."
        ],
        "listed_links": [
            {
                "http://web.mit.edu/arayo/www/ut.pdf": "The Ultra-Thin Conception of Objecthood"
            }
        ]
    }
}