{
    "url": "action",
    "title": "Action",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Juan S. Piñeros Glasscock\n<juan.pineros@utoronto.ca>\nSergio Tenenbaum\n<sergio.tenenbaum@gmail.com>",
        "author_links": [
            {
                "mailto:juan%2epineros%40utoronto%2eca": "juan.pineros@utoronto.ca"
            },
            {
                "mailto:sergio%2etenenbaum%40gmail%2ecom": "sergio.tenenbaum@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nJuan S. Piñeros Glasscock\n&lt;<a href=\"mailto:juan%2epineros%40utoronto%2eca\"><em>juan<abbr title=\" dot \">.</abbr>pineros<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;<br/>\nSergio Tenenbaum\n&lt;<a href=\"mailto:sergio%2etenenbaum%40gmail%2ecom\"><em>sergio<abbr title=\" dot \">.</abbr>tenenbaum<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jan 11, 2023"
    ],
    "preamble": "\n\n\n[Editor’s Note: The following new entry by\nJuan Piñeros Glasscock and Sergio Tenenbaum\nreplaces the\n former entry on this topic by the previous author.]\n\n\n\nThere is an important difference between activity and passivity: the\nfire is active with respect to the log when it burns it (and the log\npassive with respect to the fire). Within activity, there is also an\nimportant difference between the acts of certain organisms and the\nactivities of non-living things like fire: when ants build a nest,\nor a cat stalks a bird, they act in a sense in which the fire\ndoes not. Finally, there is a long-standing tradition in philosophy\ngoing back at least as far as Plato and Aristotle that recognizes an\nimportant distinction between the acts that (non-human) animals in\ngeneral are capable of, and the special sorts of actions that human\nbeings do intentionally, such as going to the store, making phone\ncalls, protesting an injustice, or knitting a sweater. This tradition\nviews the latter group as practical manifestations of our rational\ncapacities.\n\nAlthough this entry largely follows suit in focusing on intentional\nhuman action as a manifestation of reason, we flag from the start that\nthere are other philosophical traditions that call this assumption\ninto question. For example, Japanese (as well as Buddhist)\nphilosophers have discussed the possibility of action without the need\nof a self (Kasulis 2019, section 5.3). And on one reading of the\nDaode Jing, the highest forms of human agency are, in some\nsense, beyond reason. This is one way to understand the notion of\nwuwei, or “nonaction,” which describes an ideal way of\nacting that is neither unconscious or involuntary, nor purposeful or\ngoal-oriented (cf. Hansen 2020, section 9.4 and Wong 2021, section\n4.1). Similarly, the Inner Chapters of the Zhuangzi may\npresent a view of human action as going beyond thought and reason. By\nceasing to think about his action, Butcher Ding, appears to achieve\nsuch a sublime level of harmony with his activity as to obviate the\nneed for effort (3.2). On one reading, Zhuangzi is presenting a\nnon-intellectualist account of skill, not unlike that defended by\nDreyfus and Dreyfus (2004) as the highest form of expertise (Ivanhoe\n1993). On a more radical reading, the Inner Chapters do not present a\nhigher form of skill, but rather a more radical notion, Dao\n(way), opposing skill (Schwitzgebel\n 2019).[1]\n\nThe entry is divided in eight sections. Section 1 discusses the\nquestion “What is an action?”. Section 2 examines a\nclassic account of intentional action in terms of causation,\nassociated with Donald Davidson’s work. Section 3 considers the\nchallenge that extended actions—actions that take more than an\ninstant to accomplish—pose for such a theory, as explored\nespecially in Michael Bratman’s work, and different reactions to\nthis challenge. Section 4 considers the notion of practical knowledge,\nas presented by Elizabeth Anscombe, which has served as the basis for\nthe most important rival account to causal theories. Section 5\nexplores foundational questions about the ontology of action. Section\n6 considers the question: does action have a constitutive\naim–something it aims at just by being an intentional action?\nSection 7 considers whether omissions are actions, and, if so, how\nvarious accounts might accommodate this. Finally, Section 8 explores\nwhether animals can act intentionally.\n",
    "toc": [
        {
            "#AbouQuesWhatActi": "1. About the Question: What is an Action?"
        },
        {
            "#CausCausTheoActi": "2. Causalism and Causal Theories of Action"
        },
        {
            "#DaviPredCentArguDeba": "2.1 Davidson’s Predecessors and the Central Arguments in the Debate"
        },
        {
            "#DaviNatuInteActi": "2.2 Davidson on the Nature of Intentional Actions"
        },
        {
            "#MentStatCausExplActi": "2.3 Mental states as the causal explanans of actions"
        },
        {
            "#ProbCausDevi": "2.4 The Problem of Causal Deviance"
        },
        {
            "#ExteActi": "3. Extended Action"
        },
        {
            "#PracKnow": "4. Practical Knowledge"
        },
        {
            "#NatuPracKnow": "4.1 The Nature of Practical Knowledge"
        },
        {
            "#ArguForKnowCond": "4.2 Arguments for a knowledge condition"
        },
        {
            "#ObjeKnowCond": "4.3 Objections to the knowledge condition"
        },
        {
            "#WeakKnowCond": "4.4 Weakening the knowledge condition"
        },
        {
            "#PossPracKnow": "4.5 The possibility of practical knowledge"
        },
        {
            "#OntoActi": "5. The Ontology of Actions"
        },
        {
            "#EvenProc": "5.1 Events, processes, and more"
        },
        {
            "#IndiActi": "5.2 The Individuation of Action"
        },
        {
            "#DebaOverBasiActi": "5.3 The Debate Over Basic Action"
        },
        {
            "#MakiActiVariAgen": "5.4 Making, Acting, and the Varieties of Agency"
        },
        {
            "#ConsAim": "6. Constitutive Aim"
        },
        {
            "#MotiDiffVersView": "6.1 Motivations and Different Versions of the View"
        },
        {
            "#Obje": "6.2 Objections"
        },
        {
            "#Omis": "7. Omission"
        },
        {
            "#DiffWaysNotActi": "7.1 Different Ways of Not Acting"
        },
        {
            "#AgenOmisRefr": "7.2 Agency, Omissions, and Refrainings"
        },
        {
            "#InteOmisCausTheoActi": "7.3 Intentional Omissions and the Causal Theory of Action"
        },
        {
            "#AnimActi": "8. Animal Action"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. About the Question: What is an Action?\n\nThe central question in philosophy of action is standardly taken to\nbe: “What makes something an action?” However, we obtain\ndifferent versions of the question depending on what we take as the\ncontrast class from which actions are to be differentiated. The\ndifferent questions in turn encode important presuppositions. First,\nwe may understand the question as asking us to differentiate between\nintentional action and the notions of acting and activity considered\nabove (cf. Hyman 2015). Most commonly, however, the question is taken\nin terms of Wittgenstein’s classic formulation: “What is\nleft over if I subtract the fact that my arm goes up from the fact\nthat I raise my arm?” (1953 [2010], §621). A common, though\ncontested, reading of this passage is this: there are certain events\nof an arm’s going up that are actions, and some that are not\n(e.g. if someone tickles me in my sleep). What further factor does the\naction have that the event resulting from tickling lacks?\n\nMany historical as well as contemporary thinkers hope to answer just\nthis question. A simple answer, common in the early modern period\n(e.g. Descartes 1641 AT VII 57; Hobbes 1651/1668, i.6; Hume 1739–1740\nT II.3.iii; SB 413–18), is that what distinguishes actions from other\nevents is that they are the causal outcomes of desires, volitions, or\nacts of will. A modern version of this view, considered below, appeals\ninstead to intentions, regarded as distinctive mental states. Despite\nthe intuitiveness of these “standard” answers, there have\nbeen increasing worries that they are based on disputable assumptions.\nFirst, there is an assumption about the metaphysical category to which\nactions belong. Although it is natural to take them as events, some\nphilosophers have argued that there are good reasons to group them\nunder a different category. Second, the common reading of\nWittgenstein’s question presupposes what has been called\n“additive” or “decompositional” conceptions of\naction (Ford 2011; Lavin 2015, 2013; cf. Boyle 2016): it is assumed\nthat an account of action can be given in terms of distinct, and\nsimpler components. However, a number of authors have argued that this\nreductive project is bound to fail (Anscombe 1995; Vogler 2001;\nO’Brien 2012; Levy 2013; Horst 2015; Valaris 2015; Della Rocca\n2020, ch.4).\n\nIt has also been contended that philosophers who offer the standard\nanswers make important methodological assumptions. These philosophers\napproach questions about agency as though they were on par with\nscientific questions to this extent: they seek mechanistic, or causal\nexplanations of agency, explanations that can be grasped from an\nobjective perspective. However, drawing inspiration from Kant, some\nphilosophers contend that philosophy of action should be done from the\nagential perspective (Nagel 1989; Korsgaard 2009; Bilgrami 2012;\nSchapiro 2021); and other philosophers drawing from Aristotle and\nFrege have argued for similar views (Thompson 2008; Lavin 2013; Ford\n2017). From a different standpoint, the standard methodology has been\ncriticized as not being scientific enough. It has been argued that\ncertain empirical results disprove some of the basic assumptions\nbehind these answers. For example, Libet’s experiments have been\ntaken to suggest that intentions are causally ineffective, and that to\nunderstand the true causes of action we would have to focus on neural\nprocesses (‘action potentials’) about which we could only\nlearn through standard scientific methods (Libet 1985; Libet et al.\n1993). Although these radical views are now widely held to be based on\nfaulty conceptual and empirical grounds (e.g. Mele. 2010; Levy 2005;\nBrass, Furstenberg, and Mele 2019), surprising scientific results\ncontinue to challenge commonly held views in philosophy of action (see\ne.g. Wegner 2002 and Nahmias 2014 for critical discussion of recent\nfindings).\n\nIn this entry we draw from the work of philosophers working through\ndifferent methodological paradigms. We will not bring up these\ndifferences again, but they may be worth keeping in mind as we\nconsider the various debates below.\n2. Causalism and Causal Theories of Action\n\nPossibly the most widespread and accepted theory of intentional action\n(though by no means without its challengers) is the causal theory of\naction, a theory according to which something counts as an intentional\naction in virtue of its causal connection to certain mental states. In\nfact, this view is often dubbed (following Velleman 1992) the\n‘standard story of action’. Although other philosophers\nproposed similar views before, the contemporary causal theory of\naction, or “causalism,” was pioneered by Donald Davidson,\nespecially the essays collected in Davidson (2001a). Davidson has\ncontributed to many topics in the philosophy of action, such as action\nindividuation, the logical form of action sentences, the relation\nbetween intention and evaluative judgments, among others, but here we\nwill focus mostly on his arguments for, and his formulation of, the\ncausal theory of action. In Action, Reasons, and Causes\n(ARC), Davidson provides an account of the nature of rationalizing\nexplanations of actions, or what is often called ‘intentional\nexplanations’. Such explanations explain the action by providing\nthe reason why the agent acted. ARC tries to understand how a reason\ncan explain an action. The two central theses of ARC, or modified\nversions of them, became subsequently widely, though certainly not\nuniversally, accepted. The first thesis is that the explanation of an\naction involves a “primary reason”: a belief and a desire\npair that rationalizes the action by expressing the end pursued in the\naction (desire) and how the agent thought the action would accomplish\nthis end (instrumental belief). So, for instance, in “Larry went\nto Gus the Barber because he wanted a haircut”, Larry’s\naction is explained by a desire (his wanting a haircut) and a belief,\nleft implicit in this case (his believing that he could get a haircut\nby going to Gus the Barber). The second central thesis is that the\nprimary reason is also the cause of the action.\n2.1 Davidson’s Predecessors and the Central Arguments in the Debate\n\nDavidson’s view in ARC is presented against a number of\nphilosophers (mostly influenced by Wittgenstein), who, on his view,\ntake action explanations to provide a different kind of understanding\nthan causal explanations (for a sympathetic overview of this\nWittgenstein-inspired work, see Sandis 2015). Some of the identified\ntargets of the paper (such as Melden 1961) are clearly arguing for the\nviews Davidson rejects. Others (such as Anscombe 1957 and Ryle 1949)\ndo not clearly embrace the theses Davidson objects to, or at least not\nall of them. These philosophers took intentional explanations to\ndisplay how an action is made intelligible or justified. So Melden\nsays that “citing a motive [gives] a fuller characterization of\nthe action; it [provides] a better understanding of what the [agent]\nis doing” (Melden 1961, 88). Similarly, Anscombe’s special\nsense of the question “Why?’, discussed below (section\n4.1), is supposed to pick out the particular way in which actions are\nexplained. This claim is not one that Davidson denies; according to\nDavidson, in intentional explanations, or\n‘rationalizations’, ”the agent is shown in his Role\nof Rational Animal … There is an irreducible … sense in\nwhich every rationalization justifies: from the agent’s point of\nview there was, when he acted, something to be said for the\naction.“ (Davidson 1963, 690–1). But Melden, and other\nWittgensteineans, argue that this kind of explanation cannot be a\ncausal explanation. Melden’s central argument is the\n”logical connection“ argument. According to Melden, since\nthe supposedly causal antecedents of an action (mental items such as\ndesires and intentions) are logically related to the intentional\naction (I would not count as intentionally signalling a turn if I did\nnot desire/intend to signal a turn), the explanation of the action in\nterms of such mental items cannot be an explanation in terms of\n”Humean causes“. After all, Humean causation connects\nevents that are logically independent.\n\nDavidson’s ARC exposes a crucial fallacy with Melden’s\nargument (similar problems had been pointed out by Annette Baier (then\nAnnette Stoop) in Stoop 1962). Accepting Hume’s account of\ncausal relations does not commit us to the view that any description\nof a cause is logically independent of any description of its effect.\nAn event can only be described as ”sunburning“ if it is\ncaused by exposure to the sun, but this does not mean that the cause\nof a sunburn is not a ”separate entity“ from the sunburn.\nWe can describe an event as ”The event that caused X“\nwithout thereby refuting Humeanism about causation. Davidson argues\nthat, on the contrary, the mental items cited in an action explanation\ncan only explain the action if they are also the cause of the action\n(the second central thesis of ARC). In our example above, Larry might\nhave had other belief-desire pairs that rationalized his action of\ngoing to the barber. For instance, Larry might also have wanted a\nbottle of cream soda and believed that he could procure such an item\nat Gus the Barber. However, he did not (we may stipulate) go there\nbecause he wanted cream soda but because he wanted a haircut (and\nbelieved he could get one at Gus the Barber). The only way we can\nexplain the difference between potentially rationalizing, but\nnon-explanatory belief-desire pairs, is that the belief-desire pair\nthat genuinely explains the action, the primary reason, also causes\nthe action. The question of how non-causal theories can distinguish\nbetween merely potentially explanatory reasons for an action from the\nreasons that actually explain it became known as\n”Davidson’s Challenge“ to non-causal theories of\naction (Mele 1992; Mele 2013).\n2.2 Davidson on the Nature of Intentional Actions\n\nAlthough initially presented as an account of the nature of action\nexplanation, Davidson’s account also contains the basic\nstructure of an understanding of human action: according to Davidson,\na true action statement (of the form ”x φ-ed“) denotes\nan event, and more specifically, a bodily movement. A bodily movement\nis an action if, and only if, the event is an intentional action\n(Davidson 1971). Davidson does not say this\n explicitly,[2]\n but clearly on his view, an event is an intentional action under a\ncertain description, if and only if, there is a true rationalizing\nexplanation of the event under this description. Davidson (1971)\n(following Anscombe) points out that ”x φ-ed\nintentionally“ creates an intensional context; that is whether\nan action is intentional depends on how the action is described. To\nuse Davidson’s example, if I flip a switch, I also turn on the\nlight, and alert the burglar. On Davidson’s view ”flipping\nthe switch“, ”turning on the light“, and\n”alerting the burglar“ are all descriptions of the same\naction. The ”accordion effect“ (so dubbed by Feinberg\n1965), characteristic of human action, makes it the case that the\ncausal consequences of an intentional action provide further\ndescriptions of human actions. If my flipping the switch caused the\nlight to go on and the burglar to be alerted, then I also turned the\nlight on and alerted the burglar. However, only the first two are\nintentional actions. On Davidson’s view, all these descriptions\nare descriptions of the same action; alerting the burglar is an action\nin virtue of the fact that these same bodily movements, under a\ndifferent description, are a case of intentional action (flipping the\nswitch). Thus Davidson concludes that, ”we never do more than\nmove our bodies: the rest is up to nature“ (Davidson 1971, 23).\nWe can see now how the claims developed in these papers provide us\nwith a theory of action: an action is a bodily movement such that,\nunder some description, the bodily movement is causally explained by a\nprimary reason.\n\nThis also gives us the barebones of a causal theory of action:\naccording to ”causalists“, intentional action is explained\nin terms of mental states that are the causal antecedents, or\nconcomitants, of the agent’s behaviour or bodily movement.\nSubsequent to Davidson, causalists have aimed to provide reductive\nexplanations: intentional action is identified with behaviour or\nbodily movement (or in less ”ambitious“ versions of the\nview, a more general form of action, see Setiya 2011) whose causal\nantecedents (or concomitants) are certain specified mental states.\nAlthough Davidson himself is often portrayed as proposing a reductive\nanalysis, he never presents any of his views as fulfilling such\nambition and expresses skepticism that such analysis is possible given\nthe problem of deviance (see below).\n2.3 Mental states as the causal explanans of actions\n\nThe idea that an action is rationalized by its mental states is still\nvery popular; much less so is the view that the only relevant states\nare beliefs and desires (though see Sinhababu 2017 for a modern\ndefense of this simple ”Humean“ account). As Bratman\n(1987) argues, desires do not have the conduct-controlling and\nsettling functions characteristic of intentions, and thus intentions\nseem to be better placed to be at the center of an account in which\nintentional actions are constituted by their causal genesis. My desire\nto have my teeth cleaned, when conjoined with my belief that in order\nto get my teeth cleaned I need to go to a dentist, will not result in\nmy moving towards the dentist until I actually intend to go\nto the dentist. In fact, when Velleman comes to dub this kind of\ncausal theory of action ”the standard story of action“, he\nexplicitly describes the view as one in which intention plays a\ncentral role between the ”primary reason“ and the action.\nIn the standard story, the agent’s ”desire for the end,\nand his belief in the action as a means … jointly cause an\nintention to take it, which in turn causes the corresponding\nmovements of the agent’s body.“ (Velleman 1992, 461).\nDavidson (1970b) himself came to accept that intentions play an\nimportant role in the causation and constitution of action and that\nintentions could not be reduced to beliefs or desires. But common to\nall these views is the idea that human actions are events that bear\nthe right kind of causal relation to certain mental states or events\nof the agent that also explain the action.\n\nOne alternative to the causal view understands agency as a form of\nirreducible agent-causation. Chisholm (1964) presents a classic\nversion of the view; Alvarez and Hyman (1998) presents a radically\ndifferent version which denies that agents cause the actions\nthemselves; Mayr (2011) develops a version of the view that, unlike\nChisholm’s version, tries to show that human agency is not\nessentially different from other forms of substance causation that we\nfind in the natural world. A second alternative sees intentional\nexplanations as teleological rather than causal explanations (Wilson\n1980; Cleveland 1997; Schueler 2003; Sehon 2005); that is, an\nintentional explanation cites the goal, the purpose, or the reason for\nwhich the agent acted rather than the antecedent causes of\nthe action. Defenders of this view also try to provide an\nunderstanding of the teleological structure of intentional action that\ndenies that teleological explanations reduce to causal explanations;\nthey are instead a sui generis form of explanation. One way\nthis view can meet Davidson’s Challenge is to argue that the\ntruth of certain counterfactuals distinguishes potential reasons from\nthe actual reasons. For instance, it could be true that even though\nthe fact that the asparagus was delicious was a potential reason for\nMary to eat asparagus, she would not have eaten them if they were not\nhealthy and she would have eaten them even if they were not delicious\n(Löhrer and Sehon 2016); such counterfactuals, on this view, are\nnot grounded on causal relations between mental states and the bodily\nmovements, but on the teleological structures that constitute\nintentional action. Finally, the causal account also contrasts with\nthe neo-Aristotelian view in which human action is constituted,\nroughly, by a special form of practical knowledge (Anscombe 1957); on\nthis view, in intentional action, ”knowledge is the [formal]\ncause of what it understands“ (see section 4 of this entry).\n2.4 The Problem of Causal Deviance\n\nLet us take the following as the general form of a (reductive) causal\ntheory of action:\n\nAn event (bodily movement) B is an intentional action if and\nonly if it is an event caused by mental states [S1,\n… Sn].\n\n\nWe can immediately see how to generate counterexamples to any such\nformula: find cases in which there is a causal path from\n[S1, …, Sn] to B, but not\nthrough the ”normal“ causal path that would presumably\ngive rise to the bodily movement in a genuine case of action. This is\nthe problem of deviance for the causal theory of action; Davidson\nhimself was among the first who provided classical examples of such\ncausal deviance for his own account of action (but Frankfurt\n1978’s presentation of the problem was particularly\ninfluential):\n\nA climber might want to rid himself of the weight and danger of\nholding another man on a rope, and he might know that by loosening his\nhold on the rope he could rid himself of the weight and danger. This\nbelief and want might so unnerve him as to cause him to loosen his\nhold, and yet it might be the case that he never chose to loosen his\nhold, nor did he do it intentionally. (Davidson 1973, 153–4)\n\n\nThis is a case of what is often called ”primary deviance“\n(Mele and Moser 1994), in which the bodily movements in question are\nnot even actions, but the causal theory seems to imply they are. In\ncontrast, in cases of ”secondary deviance’’, the\ntheory misdescribes one of the consequences of the action as\nintentional when it clearly is not. The same Davidson paper provides\nan example of the latter:\n\nA man may try to kill someone by shooting at him. Suppose the killer\nmisses his victim by a mile, but the shot stampedes a herd of wild\npigs that trample the intended victim to death. Do we want to say the\nman killed his victim intentionally? (Davidson 1973, 152–3)\n\n\nThere are very many attempts to solve the problem of causal deviance\nfor a causal theory of action and we cannot cover in detail any of\nthem or mention all of them; here we’ll just list a few\ninfluential strategies (and, of course, some solutions incorporate\nmore than one of these strategies). The first appeals to the notion of\na “proximate cause” (Mele 1992) such that an action is\nintentional only if, for instance, the formation of an intention to\nφ is the proximate cause of your φ-ing. Another family of\nsolutions appeal to sensitivity and feedback conditions (Peacocke\n1979; Bishop 1989; Smith 2012): the climber’s bodily movements\nwould not count as an intentional action because they would not be\nsensitive to variations in conditions and information on what needs to\nbe done (the climber would not release their hands differently if the\nrope turned out to be stickier or would not change their behaviour if\nthey were to realize that the rope had a safety latch fastened to\ntheir hips). A different type of approach (though with some relevant\nsimilarities to the latter) takes the central problem for the\nDavidsonian approach, the reason why the problem of deviance is\nendemic to Davidson’s causalism, to be the attempt to understand\naction in terms of its causal antecedents, rather than its\nsustaining causes. For Frankfurt (1978) the relevant causal\nmechanisms involved must be guiding the action. Given that action is a\nform of purposive behaviour, we cannot hope to understand what\ndistinguishes action from mere bodily movements by focusing on what\nprecedes the action, rather than by what happens while\nthe agent is acting. As Setiya puts it:\n\nIn the case of basic action, the crucial concept is that of\nguidance: when an agent intentionally φs, he\nwants to φ, and this desire not only causes but continues\nto guide behaviour towards its object. (It is this condition that\nfails in Davidson’s example). (Setiya 2007, 32)\n\n\nIn the case of secondary deviance, a seemingly promising approach is\nto require that a “non-basic” action counts as intentional\nonly if (roughly) it follows the agent’s plan (Mele and Moser\n1994). Davidson’s killer’s plan to kill his enemy did not\ninvolve a stampede, and thus it should not count as intentional\naction.\n\nAnother strategy has been developed by “empirically\ninformed” philosophers, who hold that attention to the details\nof control mechanisms implemented at the cognitive level yields a\nresponse to the deviance problem. For example, it has been argued that\ncases of deviance involve lack of attention (Wu 2016), failures at the\nfine-grained level of motor (as opposed to distal and proximal)\nintentions (Mylopoulos and Pacherie 2019), or failures in the causal\npathways responsible for flexible agency (Shepherd 2021).\n\nNeedless to say, there is no agreed upon solution to the problem of\ndeviance (for general skepticism about the possibility of a solution\nsee Anscombe 1995; Vogler 2001; O’Brien 2012; Levy 2013; Horst\n2015; Valaris 2015); on the other hand, philosophers have also argued\nthat competing accounts suffer from problems that parallel the problem\nof deviant causation for theories of action (Paul 2011b).\n3. Extended Action\n\nDavidson’s work focuses mostly on “punctual\nactions”, actions that take place very quickly, and that have\nalready occurred. A typical example of an action for Davidson will be\ndescribed by a sentence like “α flicked the\nswitch” (see Davidson 1971). Flicking a switch happens almost\ninstantaneously; moreover, when I describe my action as “flicked\nthe switch”, the sentence picks up a completed event in which\nthe action is already done. And flicking a switch, buttering toast,\netc. are actions typically performed from beginning to end without\ninterruption. In sum, Davidson’s typical examples of actions are\nshort-lived, continuous, and completed actions. Davidson’s\nconception of an intention follows a similar pattern, focusing on\nintentions that are executed in actions that follow the aforementioned\npattern. At first, Davidson takes intentions in (short-lived) action\nto be primary, and later (Davidson 1970b) expands the model to\nprospective intention (intentions for a future action), but still\nfocusing mostly on intentions for a simply executed action that\nhappens to lie in the future. However our actions often extend through\nlong stretches of time, and seem to rely on future-directed intentions\nthat govern very complex plans and activities. Moreover, we only seem\nto have a completed action when we are no longer engaged in the\nrelevant activity (when it is true that I’ve crossed the street\nI am no longer engaged in the activities that constitute or are means\nto having crossed the street); agency arguably manifests itself only\nin action in progress (I am engaged in these activities while I am\ncrossing the street). By keeping our focus on completed action,\nwe risk losing sight of another seemingly essential feature of human\naction: that it extends through time under the guidance of the agent.\nOf course, this kind of initial focus on nearly momentary, completed\nactions does not necessarily mean that the theory cannot accommodate\nextended action that requires complex planning or action in progress\n(or any form of agency that necessarily stretches through time). But a\nnumber of philosophers have tried to either expand, modify, or reject\nDavidson’s theory to account for extended agency or action in\nprogress, or to argue that a proper theory of action should focus on\nthe nature and structure of action in progress (Thompson 2008; Ford\n2018). This section will focus on extended agency of the former kind,\nand the relevance of action in progress will be discussed in section\n4.\n\nMichael Bratman’s work (Bratman 1987; 1999a; 2007; 2018, among\nothers) was seminal in arguing for the importance of intentions,\npolicies, and plans (all of which he classifies as intentions or\nplanning states) in our understanding of how limited rational beings\ncoordinate their actions through time and can pursue ends and projects\nthrough extended periods of time. Bratman’s planning theory of\nagency starts from rejecting Davidson’s account of intention,\nand replacing it with a new understanding of the function (and nature)\nof intentions and planning states. Davidson had identified intention\nwith an “all-out” or unconditional judgment, “which,\nif we were to express it in words, would have a form like ”This\naction is desirable’“ (Davidson 1970b, 55); that is, an\nintention is a distinctive kind of evaluative judgment (”this\naction is good“ or ”this action is desirable“). On\nthis view, to intend to φ is to have φ-ing as the conclusion\nof one’s practical reasoning. Bratman finds this view\nproblematic in many ways, but arguably his most important objection to\nDavidson’s view is that Davidson’s theory of intention\nmisses out one of the ”two faces“ of intentions.\nIntentions, on Bratman’s views, are tied not only to intentional\naction but also to coordinating plans (Bratman 1987); Davidson’s\nidentification of intentions with certain evaluative judgments seems\nincapable of making room for the latter ”face“. However,\nthis role of future-directed intentions in planning and\ncoordinating action through time is essential to agency. Among our\nfuture-directed intentions, there are very specific intentions to,\nsay, make huevos rancheros for brunch later today, but also more\ncomplex plans and projects (my plan to write a book on tricycles is\nalso a specific, though not significantly filled out, intention for a\nspecific action or set of actions), and policies (my policy to\nexercise once a week is a ”repeatable“, general, intention\nto perform various futures\n actions).[3]\n\nFuture-directed intentions have for Bratman at least two important\nfunctions in our deliberation: they have a settling function and a\ncoordination function. Suppose I am deciding where I am spending my\nnext vacation, and let us assume that I narrow it down to two\npossibilities: Poughkeepsie and Daytona Beach. At some point,\ntypically much before my first vacation day, I will form an intention\nto go on one of these specific vacations (say to Daytona Beach), and\nthis intention is independent of forming an evaluative judgment in\nfavour of either option; I might be convinced that they are equally\ndesirable, but I can only take one vacation a year. Forming the\nintention to go to Daytona Beach settles the question for me\nand ends deliberation on the matter. Since there is intrinsically no\nlimit on how long I could spend deliberating, this settling function\nperforms an important role in managing the cognitive resources of\nlimited beings like us. But future-directed intentions also perform an\nimportant coordinating function in our extended agency. Going on\nvacation is a complex endeavour and we cannot successfully engage in\nthis action without prior planning. If I am going to Daytona Beach, I\nneed to plan how long I will stay, and what I will do when I am there,\nmake hotel reservations, etc. These plans will also require more\nconcrete plans as these actions unfold (if I plan to have snacks with\nme for the Indy-500, I need to plan which snacks, and then plan on\nwhere and when I will get them, and then plan on how I will get to the\nchosen grocery store, and so forth). Our capacity to form these\ndifferent types of future-directed intentions (plans, policies, and\nmore specific future-directed intentions) allows us to engage in these\ncomplex forms of extended agency (to be ”planning agents“\nin Bratman’s words). In order to perform these functions,\nfuture-directed intentions must resist reconsideration and be stable\nthrough time. If I keep changing my mind after I form the intention to\ntravel to Daytona Beach, my intention will not have settled the issue\nor foreclosed further deliberation. And it will also make both\nintrapersonal and interpersonal coordination impossible: if I expect I\nwill change my mind, there’ll be no point in making hotel\nreservations at Daytona Beach. Moreover, these functions impose\ncoherence constraints on my intentions: lack of means-ends coherence,\nfor instance, will similarly prevent future-directed intention from\nfunctioning properly.\n\nThus, Bratman, as well as a number of other philosophers afterwards\n(for instance, Holton 2004; Holton 2009; Yaffe 2010; Paul 2014),\nsuggest that an account of planning agency reshapes our understanding\nof agency and practical rationality. Bratman (1987) argues, for\ninstance, that certain dispositions for nonreconsideration are\nessential to understanding the rationality of limited agents like\nourselves. Holton (2004; 2009) extends Bratman’s account to\nanother function of a future-directed intention: resisting temptation\nwhen we expect preferences and judgment shifts. We achieve this,\naccording to Holton, by forming resolutions: intentions to\nremain firm in our intentions, which are harder to reconsider than\nsimple desires or (first-order) intentions. (See Paul 2011a for some\nskepticism about this extension.)\n\nBratman also tries to expand his planning theory to explain the\nrationality of acting on a future-directed intention even in cases in\nwhich judgment or preference shifts might seem to justify acting\notherwise. In earlier work, Bratman (1999b) appeals to a\n”no-regret“ condition; roughly, a requirement that we\nshould not reconsider or revise an intention if we’ll regret\nhaving done so at the conclusion of our planned actions. In later\nwork, Bratman (2018) appeals to the end of self-governance, an end\nthat is typically shared by human agents, to explain the rationality\nof sticking to one’s intentions in face of temptation (for\nsomewhat similar ideas in the context of cooperation, see Velleman\n1997). According to Bratman, self-governance is a form of agency in\nwhich the agent acts from a standpoint that is truly his own; a\nself-governing agent is guided ”by attitudes that constitute\nwhere he stands“ (Bratman 2018,\n 159).[4]\n On this view, self-governance has both a synchronic and diachronic\nform. Synchronic self-governance requires a coherent practical\nstandpoint at a time that can constitute where the agent stands in a\ncoherent manner, while diachronic self-governance requires a coherent\nstandpoint across different times when the agent’s plans stretch\nthrough an extended period. Since typically planning agents also have\nself-governance as one of their ends, the need for such a coherent\nstandpoint generates reasons to conform to a requirement not to revise\nintentions not only in cases of temptation, but also in cases in which\nan agent forms a future-directed intention to choose one of a number\nof alternatives that are either indifferent or incommensurable. Even\nthough in such cases an agent has sufficient reasons to act\ndifferently than she intends (since other options are just as good or\nat least on a par), self-governance requires that she preserves a\ncoherent standpoint over time (for a different way to justify\nnormative reasons against ”brute shuffling“ in terms of\nself-governance, see Paul 2014; for skepticism about some of these\nrequirements against brute shuffling, see Ferrero 2010; Nefsky and\nTenenbaum 2022).\n\nAlthough these challenges to Davidson’s original theory of\naction are different from the challenges that focus on the nature of\naction in progress, some philosophers argue that they are not\nunrelated. Tenenbaum (2018; 2020) argues that understanding better the\nnature of intentional action as actions that are always\nextended through time, and the nature of the instrumental reasoning\ninvolved in intentional action in progress, makes Bratman’s\nappeal to a sui generis state of future-directed intention\nsuperfluous in our understanding of practical rationality. On this\nview, there is no difference between the rational requirements\ngoverning the various phases of an action in progress and the\nrequirements governing the execution of a plan that contains various\nsteps, or of a general intention that contains various instances (and\nthus purported requirements that are specific to future-directed\nintentions turn out to be redundant or spurious).\n\nOn a somewhat different vein, some philosophers have challenged the\nview that there is a significant metaphysical ”break“\nbetween a prior intention and an action in progress. From the time I\ndecide to make an omelet, to the time the finished product is on my\nplate, my agency unfolds in various stages and phases in pursuit of\nthis end: I plan to make an omelet, I check which ingredients I need,\nI make sure that I leave myself enough time to go to the store while\nengaged in other activities in the morning, I buy the milk, go back\nhome, melt the butter, break the eggs, drop them on the pan, and so\nforth. These are all parts, or phases, of the unfolding of the\nactivity that, if nothing untoward happens, will result in my having\nmade an omelet. Although we can impose various breaks and divide the\nprocess into ”intending“, ”preparing“,\n”making the omelet“, these breaks are largely arbitrary\nfrom the point of view of the activity itself (Thompson 2008; Moran\nand Stone 2009; Ferrero 2017; Russell 2018); a metaphysics of\nintention that emphasizes differences risks losing sight of the\ncontinuity of the phenomena (for criticisms of these deflationary\nideas about the differences between the various phases of the\nactivity from intending to doing, see Yaffe 2010; Paul 2014).\n4. Practical Knowledge\n\nWhereas the central notion in Davidson’s theory of intentional\naction was that of causation, the central one in\nAnscombe’s is that of practical knowledge. In a famous\npassage, she appears to define intentional action as an event that\nmanifests practical knowledge:\n\n[W]here (a) the description of an event is of a type to be formally\nthe description of an executed intention (b) the event is actually the\nexecution of an intention (by our criteria) then the account given by\nAquinas of the nature of practical knowledge holds: Practical\nknowledge is ‘the cause of what it understands’, unlike\n‘speculative’ knowledge, which ‘is derived from the\nobjects known’. (Anscombe 1957, §48)\n\n\nOnly recently practical knowledge has received sustained interest in\nphilosophy of action. Much of the resulting work aims to clarify and\ndefend Anscombe’s view (Moran 2004; Thompson 2008, 2011; Haddock\n2011; Rödl 2011; Small 2012; Wolfson 2012; Marcus 2012;\nStathopoulos 2016; Campbell 2018; Marcus 2018; Frey 2019; Valaris\n2021); but several critics question her arguments, as well as\napplication of the notion to the definition of intentional action\n(e.g., Houlgate 1966; Grice 1971; Paul 2009b; 2011b). In response, a\nnumber of scholars who still find inspiration in Anscombe have sought\nto accommodate the criticisms by giving up on some of her most\nambitious claims. This section concentrates on contemporary debates\nabout practical knowledge stemming from Anscombe’s discussion,\nbut we start by briefly examining its origins in ancient Greek and\nmediaeval philosophy.\n4.1 The Nature of Practical Knowledge\n\nThe idea that there is a distinctively practical form of knowledge\ntraces back to Aristotle, who distinguished different ways ”by\nvirtue of which the soul possesses truth“ (EE\n5.3/NE 6.3). There are three theoretical forms by which a\nscientist grasps the truth: knowledge (epistêmê),\nwisdom (sophia), and comprehension (nous). Practical\nknowledge comes in two varieties: the knowledge of the skilled person\nabout what she makes—skill (technê), and the\nknowledge of the virtuous person about her actions—practical\nwisdom (phronêsis).\n\nAristotle’s account of practical knowledge is complex, and our\nfocus shall lie on three points of particular significance. First,\nAristotle claimed that skill is the ”cause“\n(aitia) of the things produced by it. For instance, he\nclaimed that the craft of building is the cause of the house\n(Phys. 2.5, 196b26). Second, Aristotle imposed epistemic\nconditions on voluntary and, a fortiori, intentional action: according\nto him, to act voluntarily one must know, among other things, what one\nis doing, to whom, and why (NE 3.1 1111a3–6; EE 2.9\n1225a36–b10). Third, Aristotle identified a distinctive kind of\nreasoning associated with practical knowledge, a form of reasoning\ntraditionally rendered ”practical syllogism“ (though see\nSegvic 2011). Such reasoning begins from a certain good and its\nconclusion is an action. For instance, on the basis of thinking that\nwalks are good after lunch, and that he has eaten lunch, a man might\ntake a walk (DMA 7, 701a13–14). (For more on ancient\nviews on action, see Parry 2021.)\n\nSeveral mediaeval philosophers built on these Aristotelian ideas,\nespecially to understand God’s knowledge of creation (see\nSchwenkler 2015). Anscombe (1957)’s account of practical\nknowledge draws on this tradition. She first characterizes intentional\naction as that to which a special sense of the question\n”Why?“ applies, the sense that requests a reason for\naction (§5). Later, Anscombe appeals to Aristotle’s notion\nof practical reasoning to connect the notion of reason for action and\nthe deliberative structure by which an agent determines how to attain\na goal by acting (§33ff.). What the question ”Why?“\nreveals, then, is the rational ”order“ of means-to-ends\nthat define practical reasoning, and the answers reveal the\ndescriptions under which the action is intentional.\n\nTo illustrate with her famous example of a man pumping water\n(§23): A man is moving his arms up and down. Why? Because he is\noperating a pump. Why? Because he is pumping water. Why? Because he is\npoisoning the inhabitants of the house (you see, the water is\npoisoned). Why? Because he wants to kill them to bring world peace.\nThe question ”Why?“ has application only inasmuch as the\nagent recognizes himself as acting under the corresponding\ndescriptions expressed by his answers. As Anscombe notes, if the man\nwere asked ”Why are you pumping water?“ and he replied,\n”I was not aware I was doing that“, then he would not be\nacting intentionally under that description (§6; §42). The\ndescriptions that manifest the agent’s understanding of what she\nis doing are therefore intrinsic to the action: an action does not\ncount as intentional under a description unless the agent grasps the\naction as such (under that description). Such grasp, therefore, cannot\nbe a separate occurrence (§42).\n\nThis reveals at least one important sense in which practical knowledge\nis the ”cause of what it understands“. It is the formal\ncause because the agent’s grasp determines what the action is\n(an intentional action with a determinate content). In turn, this\nshows why, in the phrase Anscombe borrows from Aristotle’s\nMagna Moralia, ”the mistake is in the\nperformance“ when it doesn’t conform to the judgment\n(§32): qua formal cause, the knowledge sets the standard for what\nis known. Whether, like Aristotle, Anscombe holds that practical\nknowledge is also an efficient cause is a complex, and disputed\nquestion (see Setiya 2016a for skepticism, and Piñeros\nGlasscock 2020a for endorsement).\n\nOne last important aspect of Anscombe’s conception of practical\nknowledge is the contention that an agent knows what she is doing\n”without observation“ (1957, §8). This is because,\nintuitively, whereas I need to look at what is being written on the\nboard to know what someone else is writing, I don’t need to look\nat what I am doing to know what I am writing. Beyond\nintuitive examples, however, it has proven difficult to explain what\nnon-observational knowledge\n is.[5]\n Nevertheless, there are three points on which there is wide\nagreement. First, the class of practical knowledge is a proper\nsubclass of the class of non-observational knowledge, one that also\nincludes, for instance, knowledge of our limbs’s position\n(§§9–10). Second, to say that knowledge is non-observational\nis minimally to say that it is non-inferential. Third, and finally,\nthe non-observational character of this knowledge is of the sort\ntraditionally associated with mental states. Hence, one of the most\nremarkable theses of Intention is that public\nhappenings—actions—could be known in the distinctive way\ntraditionally reserved for internal mental states, so that there would\nbe ”spontaneous knowledge of material reality“ (Rödl\n2007, 121).\n4.2 Arguments for a knowledge condition\n\nAnscombe presents several arguments for the claim that to act\nintentionally an agent must know what she is doing (call this the\n”knowledge condition’), and further arguments have been\npresented in the literature. This section surveys four influential\narguments.\n\nOne argument has already been mentioned: If a person is asked,\n“Why are you φ-ing?” and she (sincerely) replies,\n“I didn’t realize I was φ-ing” then she\nwasn’t φ-ing intentionally. It would seem to follow that a\nperson must know what she is doing if acting intentionally. However,\nthis argument is unsound. First, the expression “I didn’t\nrealize…” is colloquially used to express complete lack\nof awareness, rather than mere ignorance (Schwenkler 2019, 189). At\nmost, then, the argument would show that the action cannot be\ncompletely beyond the agent’s purview. Second, even if the\nperson’s state is in fact knowledge after the question\nis asked, this may be a conversational effect: By asking “Why\nare you φ-ing?”, the speaker intimates that the agent is\nφ-ing. This puts the agent in a position to know this, but not in\na way that is tied to her agency.\n\nA more promising argument, suggested by Anscombe and endorsed by some\nof her followers in some form (Setiya 2007; Marušić and\nSchwenkler 2018), appeals to the connection between action and\nassertion. It can be stated thus:\n\n\nPremise 1:\n\nIf S is φ-ing intentionally, then she is in a position to\ncorrectly assert that she is φ-ing.\n\nPremise 2:\n\nOne can correctly assert p only if one knows p.\n\nConclusion:\n\nTherefore, if S is φ-ing intentionally, she knows that\nshe is φ-ing.\n\n\nPremise 2 is the standard claim that knowledge is the norm of\nassertion (Unger 1975; Slote 1979; Williamson 2000; DeRose 2002;\nReynolds 2002; Hawthorne 2004). Premise 1 may also look innocuous;\nbut, as we shall see, there may be cases that speak against it.\n\nThere are two more influential arguments inspired by Anscombe that\nhave been used to defend the connection with knowledge. The first\nbegins with the observation that a process in progress bears a\nnon-accidental connection to its completion (Thompson 2011; Small\n2012; Wolfson 2012; Valaris 2021). If a house is burning, it would not\nbe an accident if it is burnt later; and if you are writing a letter,\nit won’t be an accident if it is written later. What\ndistinguishes intentional action is that the non-accidental connection\nobtains in virtue of the agent’s representation—her\nintention—to act in some way. That the agent is writing a\nletter—even while she takes a break, cooks a snack, and goes to\nthe bathroom—is true precisely because she represents herself as\nwriting a letter, and this representation guides her proceedings.\nIntentions, in other words ground what Falvey (2000) calls the\n“openness of the progressive”: the fact that “a\nperson may be doing something, in a suitably broad sense, when at the\nmoment she is not doing anything, in a more narrow sense, that is for\nthe sake of what she is doing in the broad sense” (p.22).\nSuppose, then, that an agent is intentionally φ-ing. Then it is\ntrue that she represents herself as doing so, the representation is\ntrue, and non-accidentally so. It is a short step to the conclusion\nthat she knows that she is φ-ing.\n\nThe final argument is based on the claim that intentional action is\naction for a reason (Thompson 2013). An agent must therefore be in a\nposition to give an answer fitting the schema:\n\n(1)\nI’m φ-ing because ψ.\n\n\nNow, Thompson (2008) has argued that the most basic way of filling\nthis schema is one where actions themselves occupy the ψ-position\n(i.e. where actions are given as reasons). For instance:\n\n(2)\nI am moving my hands because I am pumping water.\n\n\nSo, in what sort of relation must an agent stand to the fact that she\nis pumping water for a sentence like (2) to be true? Hyman (1999;\n2015) has argued that the relation must be knowledge (though see Dancy\n2000, ch.6). If, then, every intentional action description is one\nthat the agent could substitute for ψ in (1), it follows that\nagents must know what they are doing when acting intentionally.\n4.3 Objections to the knowledge condition\n\nDavidson argued that the knowledge condition, and even a weaker belief\ncondition, is vulnerable to counterexamples:\n\n[I]n writing heavily on this page I may be intending to produce ten\nlegible carbon copies. I do not know, or believe with any confidence,\nthat I am succeeding. But if I am producing ten legible carbon copies,\nI am certainly doing it intentionally. (Davidson 1970b, 92)\n\n\nIn this case, Davidson argued that the agent is making 10 carbon\ncopies intentionally despite not believing that he is (never mind\nknowing); and some recent empirical results appear to support this\nverdict (Vekony 2021). Hence, it seems that agents can φ intentionally without\neven believing that they are φ-ing.\n\nFor a long time, this and similar examples (e.g. Bratman 1987, 37,\nMele 1992, ch.8) were taken as decisive refutations in the literature,\nbut their force has been contested recently (Thompson 2011; Small\n2012; Wolfson 2012; Stathopoulos 2016; Beddor and Pavese 2021; Pavese\nforthcoming). The impetus for many of these responses stems from\nThompson’s work on the importance of aspect for action-theory.\nIn particular, actions in progress display what Falvey (2000) has\ncalled “openness”, which corresponds to the inaptly-named\n“imperfective paradox” in the linguistic literature (more\nbelow): Someone can be doing something and never get around to have\ndone it (e.g. I can be crossing the street, but never cross it). It is\nthus possible for someone to know that they are φ-ing even if they\ndon’t, in fact, get to have φ-ed. To apply these\nconsiderations to Davidson’s argument, we need to distinguish\nbetween two cases. First, the normal case where the agent intends to\nmake 10 carbon copies, but has the opportunity to correct and continue\non if things go wrong (e.g. if he initially only makes 5, but then\nmakes 5 more). Second, the one-shot case where the agent must make 10\ncarbon copies in one go (say, because he is competing in a copy-making\ntournament). In the normal case, it appears like the agent may know\nthat he is making 10 carbon copies (even if he doesn’t know that\nhe will complete the 10 in one go). So it raises no problems for the\nknowledge condition. What, then, of the one-shot case? Although here\nit may be granted that the agent doesn’t know that he is making\n10 carbon copies, it is questionable whether he is making 10 carbon\ncopies intentionally. The reason is that if he were to make\n10 carbon copies as a result of pressing as hard as he can, this would\nbe too much an accidental result of his performance. But, as we saw\n(see section 2.4), accidentality is incompatible with intentional\naction. Hence, in the normal case the agent acts intentionally while\nknowing, while in the one-shot case he doesn’t even act\nintentionally.\n\nIt is contentious whether the foregoing response works (see Kirley\nforthcoming, for criticism), but it shows that Davidson’s\nexample is far from decisive. However, other examples appear to be\nimmune from this type of response. For instance, Schwenkler (2019)\npresents a case of an agent who is trying to fill a cistern in the\nkind of environment where doubts that he is doing so are appropriate\n(e.g. where he is filling up one of many cisterns, but he knows\nseveral of them are broken, but not which). Suppose, however, that he\nis in fact filling up the cistern (it is not broken). If he does so to\npoison the inhabitants of the house, Anscombe’s question\n“Why?” appears to have application, which means that he is\nfilling up the cistern intentionally, even though the best he could\nsay is that “he thinks” he is doing so (Schwenkler 2019,\n188–9; cf. Vekony, Mele, and Rose 2021; Shepherd & Carter\nforthcoming).\n\nThe key difference between this case and the carbon copier is that the\nagent remains fully in control of her action: the fact that he is\nfilling up the cistern by moving his arms so and so is no accident.\nSo, there is no reason to dispute the action’s status as\nintentional. Still, whatever belief the person might have is unsafe,\nas nearby beliefs (such as those relating to the other faucets) are\nfalse. Hence, it isn’t knowledge.\n\nBuilding on similar considerations, Piñeros Glasscock (2020b)\npresents a version of Williamson (2000)’s anti-luminosity\nargument, aiming to show that the knowledge condition is incompatible\nwith a safety principle, to the effect that to constitute knowledge, a\nrepresentation could not easily be wrong. He argues that since agents\ncan slowly transition from φ-ing to not-φ-ing through changes\nso small as to outstrip the agent’s discriminating capacities,\nagents must sometimes find themselves in situations where they are\nacting intentionally but either lack the confidence to possess\nknowledge, or, if they have it, it is misplaced. Either way, they do\nnot know.\n\nTogether, these arguments force defenders of the knowledge condition\ninto an uncomfortable position: if they wish to uphold the knowledge\ncondition, they must reject safety for practical knowledge. However,\nthis threatens to undermine the point of counting this as knowledge,\ngiven how epistemically frail it can be. On the other hand, it has\nbeen argued that a suitable understanding of the knowledge condition\nmay evade these worries (Beddor and Pavese 2021; Valaris 2021).\n4.4 Weakening the knowledge condition\n\nThe knowledge condition remains a controversial thesis in philosophy\nof action; but even those who reject it tend to hold that the\nconnection between intentional action and knowledge is not accidental.\nThus, there is a growing literature that aims to capture an important\nconnection between knowledge and intentional action in weaker terms.\nThese views can be categorized according to the term for which they\nrecommend modification, whether (i) the practical state, (ii) the\nepistemic state, or (iii) the nature of the connection between them.\n(Naturally, since these are all compatible, some scholars recommend\nmore than one revision.)\n\nThough regarded as Anscombe’s central opponent, Davidson himself\nrecommended a version of (i). According to him, although agents need\nnot know what they are doing under every description under which they\nact intentionally, they must know what they are doing under at\nleast one description under which the action is intentional\n(Davidson 1971, 51). The carbon copier, for instance, may not know\nthat he is making 10 carbon copies, but he would have to know that he\nis making carbon copies, or that he is moving his hands, etc.\nArguably, the idea that practical knowledge is restricted to knowledge\nof actions in progress is also a weakening of the thesis,\nsince Anscombe appears to include also knowledge of future actions\n(§§51–2) and of completed actions such as the knowledge that\nI wrote my name on the board (§48) or even of what is\nwritten (§19). Indeed, it has been argued that\nimperfective and perfective knowledge are interdependent (Haase 2018).\nFinally, other weakenings include the view that agents must know what\nthey intend (Fleming 1964), what they are trying to do/that they are\ntrying (Searle 1985; cf. Grice 1971), or what basic actions they are\nperforming (Setiya 2008; 2009; 2012). Since Anscombe’s thesis is\nstrictly stronger than these, it follows that they will avoid certain\nproblems that hers faces. However, it is not clear that such retreats\nhelp avoid the general problem, and restricting the thesis to more\nimmediate occurrences—basic actions, intentions, or\nattempts—risks losing on the aforementioned feature that makes\nAnscombe’s view so interesting: the idea that we might bear the\nsame intimate epistemic connection to something external as we bear to\nparts of our mental lives (Piñeros Glasscock 2020b).\n\nViews that fall under (ii) have been influentially defended by several\nauthors (Grice 1971; Harman 198;1997; Setiya 2007; 2008; 2009; 2012;\nVelleman 2001; Tenenbaum 2007; Ross 2009; Clark 2020). A popular\nversion of this view rejects a knowledge condition in favor of a\nbelief condition (Setiya 2007; Velleman 2001; Ross 2009; Clark 2020):\nif the agent φs intentionally [intends to φ], she believes\nthat she is φ-ing [believes that she will φ]. Such a view is\narguably better supported by some of Anscombe’s own arguments\n(such as the argument in terms of conversation dynamics above); and it\nseems to preserve a special place for actions as occurrences that are\npublic but to which our minds bear a special epistemic relation.\nHowever, it has been argued that such views also suffer from problems,\nand fail to avoid counterexamples with the same structure as\nDavidson’s carbon copier, even though they are explanatorily\nweaker (Bratman 1991; Paul 2009a; 2009b; Levy 2018). Since authors\nlike Setiya see the avoidance of counterexamples as a central payoff\nof the weakenings, it is unclear whether they are worth the costs in\nexplanatory value.\n\nFinally, views that fall under (iii) aim to show that even if there\nisn’t a relation of entailment between action and\npractical knowledge, there might yet be an interesting connection\nbetween them. For instance, some authors have argued that agents\nnormally or generally know what they are doing\n(Peacocke 2003; O’Brien 2007; Gibbons 2010; Schwenkler 2015;\n2019; Piñeros Glasscock 2020b); or that the kind of knowledge\nthat agents have of their intentional action has special properties,\nsuch as being first-personal knowledge (Dunn 1998; Moran 2001; 2004;\nO’Brien 2007; Marcus 2012; Schwenkler 2019).\n4.5 The possibility of practical knowledge\n\nRegardless of whether one adheres to the knowledge condition (or some\nweakened version of the view), it is generally agreed that agents\ncan have a special kind of knowledge by exercising their\npractical capacities in intentional action. However, what makes our\npractical capacities suitable source of knowledge? Anscombe devoted\nlittle attention to this question, but an answer to it could be the\nkey to working out a version of (iii) in the previous section.\n\nHere is a simple answer: A person can know that p (e.g. that\nshe (herself) is walking), on the basis of exercising her will,\nbecause when she does so successfully p is true. Two related\nproblems immediately arise for this simple account. First, truth is\ninsufficient for knowledge. Minimally, epistemic warrant is also\nneeded, but the simple account does not give even a hint as to how\nsuch warrant could be acquired through agency (Newstead 2006). Second,\nthere are notorious cases that seem to meet the conditions provided by\nthe simple answer, but where there isn’t knowledge. One case is\nlucky wishful thinking (Langton 2004), e.g., if partly on the basis of\noptimistic thinking I luckily pull off a jump I would not normally\nmake. Another is pessimistic thinking (Harman 1986; 1997), e.g., if I\ntrip partly on the basis of thinking that I will trip. In neither case\ndo I possess knowledge on the basis of my thoughts, despite the\nthoughts bringing about the truth of their contents. At best,\ntherefore, the simple answer is incomplete, and must be supplemented\nwith a story that explains how it is that the characteristic thoughts\nof the agent differ from wishful and pessimistic thoughts, such as to\nprovide epistemic warrant.\n\nAn influential account of this sort was provided in foundational work\nby Velleman (1989). Simplifying somewhat, Velleman argues that human\nbeings have a core desire to know themselves. Like any desire, this\none will motivate agents to satisfy it. In addition, they have the\ncapacities to (a) have thoughts about what they are doing and will do,\nand (b) have thoughts that are self-referential, e.g. <this very\nthought won’t make me famous>. Suppose, then, that someone\nhas the thought <I will go to the store in virtue of this\nthought>. Then, given the desire to know herself, the agent will be\nmotivated to make this thought true. Hence, thought structures of this\nsort (‘intentions’) will give the agent reasons to believe\nthat what she intends will be true.\n\nSeveral worries have been raised against Velleman’s view. One is\nthat it makes dubious empirical claims, theorizing about the mind from\nthe armchair. In response, Velleman (2000a) has provided empirical\nsupport for his more contentious psychological claim, that humans have\na deep desire for self-knowledge. Another worry is that this epistemic\nmechanism still looks too much like wishful thinking, believing that\nsomething is the case just because one wants it to be so (Langton\n2004; see Setiya 2008; Velleman 2014 for replies). Finally, it is\nunclear why, if an agent realizes that the content of her intention is\nnot realized, she must make it true that it is, rather than simply\ngive up the belief (that she will act in a certain way). After all, we\ncan pursue the aim of knowing ourselves both by ensuring that beliefs\nabout ourselves are true and by giving up beliefs about\nourselves that are false.\n\nWorries of this sort led Velleman to distinguish\n“directive” from “receptive” cognition\n(Velleman 2000, ch.7); but it has led others to consider the\nalternative view that practical knowledge is a standard form of\ninferential knowledge (Grice 1971; O’Shaughnessy 1980, 2003;\nPaul 2009a). On the most sophisticated inferentialist account, due to\nPaul (2009a), agents take advantage of the special knowledge they have\nof their intentions to make inferences about what is happening and\nwill happen. Given that intentions are reliably executed, such\ninferences reliably yield knowledge. A more radical inferentialist\nalternative, suggested by authors like Carruthers (2011) on the basis\nof empirical evidence, is that we know our actions on the basis of the\nsame processes by which we know others’ minds: we essentially\npredict what actions are most likely to happen, given what else we\nknow about others’ motives and beliefs—it’s just\nthat we know a lot more about our own minds. (Similar views about\nself-knowledge in general are defended by Gopnik 1993, and have their\norigin in Ryle 1949. For criticisms, see Boyle 2022; Levy 2022.)\n\nInferentialist accounts give up on a feature that was central to\nAnscombe’s understanding of practical knowledge, its immediate\ncharacter (see e.g. O’Brien 2007). However, Paul (2009a) argues\nthat the appearance of immediacy can be explained by the fact that\ninferences “can take place rapidly and automatically at a\nnon-conscious level, without the mindful entertaining of premises or\nfeeling of drawing a conclusion” (p.10). Yet, several challenges\nhave been raised against inferentialist accounts, including: (i) that\nthey can’t explain the tight nexus between intentional action\nand practical knowledge (Setiya 2007, 2008, 2009); (ii) that they\ncan’t explain the first-personal character of practical\nknowledge (Wilson 2000; Schwenkler 2012); and (iii) that they at best\ngive us alienated, observational knowledge (Piñeros Glasscock\n2021).\n\nThere are, finally, several non-inferentialist stories about how\npractical knowledge is possible. Some accounts appeal to knowledge-how\nor skill as the state by which an intention ensures that its content\nis not only true but also justified, so as to amount to knowledge\n(Setiya 2012; Small 2012; Valaris 2021). Another view, due to\nO’Brien (2007), explains practical knowledge in terms of the\nexercise of deliberative capacities. The agent knows what she is doing\nbecause the selection of an action is done via the exercise of\ncapacities that narrow options in terms of the practical possibilities\nof the agent. Others take practical knowledge to be inferential, but\nthe inference in question is practical inference. On this view,\npractical knowledge is warranted by the practical considerations that\nconstitute the agent’s practical reasoning (Harman 1997;\nTenenbaum 2007; Ross 2009; Marušić and Schwenkler 2018;\nCampbell 2018; Frey 2019). Finally, some have tried to show that\naccounts of epistemic warrant or entitlement designed to explain how\nwe can directly believe on the basis of perception might explain how\nwe can directly believe on the basis of our wills (Peacocke 2003;\nNewstead 2006; Piñeros Glasscock 2020a). As this brief and\nincomplete summary indicates, there is not yet anything close to a\nconsensus about how best to explain the epistemic standing for\npractical knowledge.\n5. The Ontology of Actions\n\nWhat are actions? The traditional answer is: they are events\nof a certain sort (e.g. events with a distinctive causal history).\nThat, at any rate, is the letter of the views found in Anscombe\n(1957), Davidson (1963; 1967a; 1967b; 1985), and much subsequent\nliterature. However, some scholars have recently argued that\nAnscombe’s position is better captured by the claim that actions\nare processes, and that there are philosophical advantages to\nthis view. Yet, others take actions to be something else altogether.\nThis section explains what this dispute is about, and explores some of\nits implications for other ontological debates such as the\nindividuation of action. It then considers further important questions\nabout the metaphysics of action, such as whether there must be basic\nactions, and whether Action constitutes a unified\ncategory.\n5.1 Events, processes, and more\n\nThere are several reasons to categorize actions as events. A central\none concerns their connection to causation (Davidson 1967a; Goldman\n1970). Actions are directly implicated in causal relations: modifying\nDavidson’s example (pp.4–5), the burglar’s entering my\nhouse might cause me to turn on the light, which in turn might cause\nhim to be startled. On the widespread assumption that events are the\nprimary causal relata, it would follow that actions, such as my\nturning on of the light, are events.\n\nAnother argument for the event view is that it explains common\ninference patterns. As Davidson (1967b) noted, sentences attributing\nactions to agents admit of adjectival drop. Thus, a sentence like (3)\nentails (4), which in turn entails (5):\n\n(3)\nDonald buttered the toast in the bathroom at 12am.\n(4)\nDonald buttered the toast in the bathroom.\n(5)\nDonald buttered the toast.\n\n\nDavidson suggested that the best way to account for these inferential\nrelations is to assume that at the level of logical form these\nsentences quantify over events. So understood, the logical form of\n(3)–(5) would be as\n follows:[6]\n\n(3*)\n\\(\\exists x(\\textrm{Buttering}(x) \\amp \\textrm{By}(x,\n\\textrm{Donald}) \\amp \\textrm{Object}(x, \\textrm{toast})\\ \\amp \\)\n\\(\\textrm{Location}(x, \\textrm{bathroom}) \\amp \\textrm{Time}(x,\n\\textrm{12am}))\\)\n(4*)\n\\(\\exists x(\\textrm{Buttering}(x) \\amp \\textrm{By}(x,\n\\textrm{Donald}) \\amp \\textrm{Object}(x, \\textrm{toast})\\ \\amp\\)\n\\(\\textrm{Location}(x, \\textrm{bathroom}))\\)\n(5*)\n\\(\\exists x(\\textrm{Buttering}(x) \\amp \\textrm{By}(x,\n\\textrm{Donald}) \\amp \\textrm{Object}(x, \\textrm{toast}))\\)\n\n\nThe entailment relations are then easily explained through the\nclassical rules for conjunction and existential quantification. This\nanalysis, which has been highly influential in formal semantics,\nappears to entail that actions are events, entities with a\nspatiotemporal location (since they admit of spatiotemporal\nmodifiers), that possess the properties denoted by adverbial modifiers\n(such as who was engaged in them, or what the object of the action\nwas).\n\nFinally, perhaps the most straightforward reason to hold that actions\nare events, is that this fits naturally with the way we speak about\nthem. For instance, we say, “The event we observed last night\nturned out to be a theft”, or “The murder of that woman\nwas a sad event”.\n\nAgainst this view, a number of scholars have recently argued that\nactions (in the sense of concern for philosophy of action) are instead\nprocesses (Mourelatos 1978; Stout 1997; Hornsby 2012; Steward\n2012; Charles 2018). To understand this claim, we first need to\nexplain what the distinction amounts to. We can introduce it at an\nintuitive level in terms of the aspectual distinction between the\nfollowing two sentences:\n\n(6)\nDonald is buttering the toast.\n(7)\nDonald has buttered the toast.\n\n\n(6) refers to an ongoing occurrence in the midst of development. As\nsuch, many of its properties are still indeterminate and may change\nover time. It may be happening in the bathroom in a matter of seconds\nif Donald stays there; but he could take a break, forget about it, and\ncontinue on with it several minutes later in the kitchen. Moreover,\nthe manner in which it takes place can change as it occurs: it may\nspeed up (if Donald is suddenly in a hurry) or slow down (if Donald is\ndistracted by a noise), and he may start doing it more mindfully, or\ndistractedly. Indeed, however Donald is doing the buttering,\nit may happen that he never ends up having buttered the toast\n(a nearby scream might cause him to drop it in the toilet halfway\nthrough). This is sometimes called the “imperfective\nparadox”: in general, ⌜x is φ-ing⌝ does\nnot entail ⌜x has φ’d⌝. By contrast, the event\nitself, denoted by (7), cannot speed up or slow down, nor change the\nmanner in which it is done, since it is already complete. This is why\nit has a determinate temporal-spatial location in terms of which some\nhave sought to individuate it (Lemmon 1967; Quine 1985; Davidson\n1985). By contrast, processes do not have an essential\ntemporal-spatial location: the same process of buttering that is now\ntaking place at 12:01 could culminate in a minute or in an hour.\n\nThe most straightforward reason to think that actions are processes is\nthat actions appear to have these properties, as is indicated by the\nexamples used in the previous paragraph (Stout 1997; Steward 2012;\nCharles 2015; 2018). Thus, one’s action can speed up or slow\ndown, be done in one way or another at different times in its history,\nand may culminate at different times. Indeed, an ongoing action may\nnever be completed.\n\nThe connection between imperfective aspect and processes provides\nfurther impetus for the view that actions are processes (the argument\nto follow is based on Michael Thompson’s ideas (2008,\n122–30), though he rejects the view that actions are processes,\nunderstood as particulars (pp.134–7)). After all, it seems essential\nto actions that they can enter into rationalizing explanations\n(Anscombe 1957; Thompson 2008; Wiland 2013; Ford 2015; 2017), and such\nexplanations can easily be given in imperfective language. To see\nthis, consider again Anscombe’s case of a man who operates a\nlever to pump poisoned water to a house, with the plan of killing the\ninhabitants (Anscombe 1957, §23). We could represent his thoughts\nas follows: “I am moving the lever up and down because\nI am pumping water to the house because I am poisoning its\ninhabitants.” Indeed, such formulations seem to express\ncanonical answers to Anscombe’s special question\n“Why?” (Thompson 2008; Wiland 2013; Ford 2015). However,\nwe cannot capture the same thoughts without imperfective expressions\n(Thompson 2008). The train of thought that goes, “I have moved\nthe lever up and down because I have pumped the water\nbecause I have poisoned the inhabitants of the house”\nmakes it sound like the man is acting on a conditional promise to move\nthe lever if the men are killed by his hand. This suggests that\nwhereas processes can directly enter into the kinds of rationalizing\nexplanations definitive of intentional action, events cannot (except,\nperhaps, derivatively), which in turn suggests that actions are\nprocesses.\n\nFinally, it has been suggested that the process view can better\naccommodate the type of direct guidance that Frankfurt identified as\nessential to intentional action (see above, section 2.4). It seems\nattractive to explain the nature of this direct guidance in terms of\nhow substances in general cause changes by engaging in certain\nprocesses (Hornsby 2012), or in terms of the different ways in which\nan agent can manifest her agency in a process (slower, faster, more or\nless skillfully) (Charles 2018). And, as Steward (2012) suggests, this\nmight give a substantial role to the agent in the explanation of\naction. By contrast, since events have settled natures and\nspatial-temporal properties, it seems that the agent can at best\ninteract with them in the indirect way in which she interacts with\nother objects, such as a car.\n\nIt is only recently that an alternative to the event view has been\nclearly formulated and defended. As such, much work remains to be done\nin this area, and even among defenders of the process view there are\nimportant disagreements. One important disagreement is over whether\nprocesses are particulars (Galton 2006; Steward 2012; Charles 2018) or\nnot (Stout 1997; Crowther 2011; Hornsby 2012; Crowther 2018; cf.\nThompson 2008). Another disagreement is about whether a unique thing\nis a process and an event (at different times) (Steward 2012; Charles\n2018), or whether the process and the event are distinct things (Stout\n1997; Crowther 2011; Hornsby 2012; Charles 2015; Crowther 2018).\n\nRegardless of how these questions are answered, a remaining challenge\nis to explain the unity between processes and events, the\nfact that there is a non-accidental connection between the process of\nbuttering, and the event of one’s having buttered the toast that\nresults if the action is successful (Haase 2022). Moreover, it is\nworth noting that although the process-view is the most important\nalternative available to the events-view, other proposals have been\nadvanced recently, including the view that actions are thoughts\n(Rödl 2007; 2011; Marcus 2012; Valaris 2020). For example, Marcus\nholds that to act intentionally just is to judge that the action is to\nbe done.\n5.2 The Individuation of Action\n\nThe example of the pumper displays another important Anscombean thesis\n(endorsed by Davidson, see section 2.2 above): that a single event can\ninstantiate different properties in terms of which it can be\ndescribed. Thus, the same action is at once a moving of the\nhands, a pumping of water, and a poisoning.\nThis was important for Anscombe because she held that actions are\nintentional only under some descriptions: for instance, even if the\npumper’s energetic moves scare a nearby squirrel, the action\nwould not be intentional under the description scaring of a\nsquirrel.\n\nThe most influential alternative to this “coarse-grained”\naccount is a “fine-grained” account that individuates\nactions (and events, more generally) in terms of their properties (Kim\n1966; 1969; 1973; 1976; Goldman 1970). On this view, A and\nB are the same action just in case A has all and\nonly the properties that B has; and for each set of such\nproperties, there is an event. Since moving one’s hands, pumping\nwater, and poisoning are distinct properties, this view entails that\nthe pumper’s moving of his hands, his pumping of the water, and\nhis poisoning of the inhabitants are distinct actions.\n\nAnscombe complained that treating these as different actions would be\nlike treating the author of David Copperfield and the author\nof Bleak House as different men, rather than a single author,\nDickens (Anscombe 1979, 222). Indeed, the fine-grained view has\nsimilar counterintuitive implications. Consider: the properties of\npumping water, pumping water while smiling, and pumping water at noon,\nare all different properties. So, the man who pumped water at noon\nwhile smiling would have engaged in three different pumpings according\nto the fine-grained view.\n\nMoreover, the view threatens to undermine some basic inferences we are\ninclined to make about actions (Katz 1978). For instance, it seems\nobvious that from:\n\n(8)\nThe table in the room is brown.\n\n\nWe can infer:\n\n(9)\nThe table in the room = the brown table.\n\n\nBut, similarly, it seems that from:\n\n(10)\nThe man’s pumping occurred at noon.\n\n\nWe can infer:\n\n(11)\nThe man’s pumping = The man’s pumping at noon.\n\n\nHowever, on the fine-grained view the inference to (11) is invalid\nsince the two descriptions in (11) must refer to distinct events.\nHence the defender of the fine-grained view is forced to reject a\nseemingly innocuous inference pattern.\n\nThese are serious problems, and it is not clear that defenders of the\nfine-grained view can do more than bite the bullets. However, it has\nbeen argued that the coarse-grained account has similarly\ncounterintuitive implications (Goldman 1970; Thomson 1971). To see\nwhy, consider the following two sentences (true of the imagined\npumper):\n\n(12)\nThe man moved his hands before he poisoned the inhabitants.\n(13)\nThe man caused the poisoning of the inhabitants by moving his\nhands.\n\n\nWe can paraphrase them using gerundival expressions as follows:\n\n(12*)\nThe man’s moving of his hands happened before the poisoning\nof the inhabitants.\n(13*)\nThe man’s moving of his hands caused the poisoning of the\ninhabitants.\n\n\nNow, suppose we assume the claim that:\n\n(14)\nThe man’s moving of his hands = the man’s poisoning of\nthe inhabitants.\n\n\nThen, by substitution, we arrive at the absurd:\n\n(15)\nThe man’s moving of his hands happened before the\nman’s moving of his hands.\n(16)\nThe man’s moving of his hands caused his moving of his\nhands.\n\n\nIt is natural to think that (14) is the culprit; but to hold that\nclaims such as (14) are false seems to amount to rejecting the\ncoarse-grained view of action individuation.\n\nOne possible response would be to hold that the contexts ⌜φ\nhappens* before ψ⌝ and ⌜φ causes* ψ⌝\n(the * marks tenselessness) are intensional in the φ and ψ\npositions (Anscombe 1969). If so, substitution of co-referents may\nchange truth value in these contexts. Alternatively, one could attempt\nto explain these results pragmatically: the sentences sound odd in the\nsame way as it sounds odd to say that “a man married his\nwidow’, even though it is true (the man married her\nbefore she was a widow, of course!) (cf. Anscombe 1979).\nHowever, these are controversial semantic theses (for further\nintensionalist treatments, see Achinstein 1975; McDermott 1995;\nWasserman 2004; for extensionalist treatments, see e.g., Davidson\n1967a; Strawson 1985; Rosenberg and Martin 1979; Schaffer 2005; for an\nexcellent review of research on causal contexts more generally,\nincluding pragmatic effects, see Swanson 2012).\n\nA different response is suggested by the view that actions are\nprocesses. That view enables us to treat action descriptions as\nsometimes characterizing the different stages of the action (cf.\nRussell 2018). Then, appealing to Anscombe’s insight that we\nshould treat claims about actions in parallel with claims about\npersons, we could say that the moving of one’s hands precedes\nand causes the poisoning in an analogous way as the acorn precedes and\ncauses the oak. But just as there is a single organism in the latter\ncase, there is a single action in the former, even though it seems at\nbest paradoxical to say that I caused myself to exist, or that the oak\ncaused the acorn.\n\nFinally, the coarse- and fine-grained views obviously do not exhaust\nthe conceptual landscape. A number of philosophers have offered\nindividuation principles stricter than those advanced by\ncoarse-grained theorists, but laxer than those advanced by\nfine-grained theorists (e.g. Ginet 1990). Charles (1984), for example,\nargues that Aristotle would individuate actions in terms of\ncapacities. This allows us to say that the moving of one’s hands\nis the same action as the moving of one’s hands quickly (since a\nsingle capacity is thereby actualized), even though it is a different\naction from the poisoning, which actualizes a different set of\ncapacities. The challenge for this view is to provide an account of\nthe individuation of capacities independent of the account of the\nindividuation of actions.\n5.3 The Debate Over Basic Action\n\nConsideration of cases like that of the pumper naturally raises a\nquestion about their structure: what kind of shape could such\na rationalizing explanation take? Could it go on forever? To answer\nthis, consider the pumper once more, and suppose he poisons the\ninhabitants of the house. It is true, then, that he poisoned the\ninhabitants of the house by pumping water, and he did this by moving\nhis hands. Because the poisoning and the pumping are done by doing\nsomething else, they are called ”non-basic“ actions.\nHowever, it has been argued that there must be at least some actions\nthat are ”basic’“, done not by doing anything else.\nOtherwise, we appear to be caught in various forms of a vicious\nregress.\n\nFor example, if to do A one must do B, and to do\nB one must do C, and so on ad infinitum,\ndoing anything would seem to require doing an infinite number of\nthings. More worrying, the beginning of action seems to be\n”logically out of reach“ for the agent, since there is\nalways something else that she would have to do before she begins to\ndo anything (Danto 1979, 471). Again, it seems that for an agent to\nknow what she is currently doing, she needs to know how to do the\nthings by which she does it; but unless there is something that she\ncan know how to do just by doing it, it will be impossible for her to\nknow what she is doing at all (Hornsby 2013).\n\nArguments of this sort convinced most scholars that there must be\nbasic actions (though see Baier 1971 and Sneddon 2001 for early\ndissent). The debate then centered on which actions are\nbasic. Many scholars held that simple bodily movements, like moving a\nfinger or raising an eyebrow, were basic, while others held that they\ncould be more complex (tying one’s shoes), or that they must be\nsimpler: perhaps only mental actions, or tryings were basic. After\nall, I move my finger by attempting to move it; and we need to\ndistinguish between the attempt and the movement, since sometimes the\nattempt occurs without the movement (e.g. if my fingers are suddenly\nparalized) (Prichard 1945: Hornsby 1980; O’Shaughnessy 1980; see\nCleveland 1997, ch.5 for criticism).\n\nAs several scholars have noted, part of what is at issue in this\ndebate are different notions of basicness, corresponding to different\nunderstandings of the clause ”by doing something else“\n(Baier 1971; Annas 1978; Hornsby 1980). It is common to draw a\nthree-fold distinction: (i) know-how basicness; (ii) causal basicness;\nand (iii) teleological basicness. An action is know-how basic iff\nthere is no other (type of) action by which the agent knows how to do\nthe one in question. An action is causally basic iff there is no other\n(token) action that causes it. An action is teleologically basic iff\nthere is no other (token) action by means of which the agent does it.\nTo illustrate in a way that highlights the differences, consider\npitching a baseball. Arguably, this action is know-how basic, since\nthe pitcher may not know a more basic action by which to do it: of\ncourse, the agent may know how to move her hands independently, but\nshe may be unable to move her hands in the particular way in which she\ndoes when she throws the baseball unless she were actually throwing\nthe baseball. Whether the action is causally basic depends on whether\nwe think there is another action that causes it, such as the\npitcher’s moving of his hands. Finally, and independently of the\nquestion of causation, the action appears to be teleologically\nnon-basic, since the moving of his hands is certainly both a means and\nan action by which the pitcher pitches. The consensus for many years\nwas that there must be basic actions in all three senses.\n\nHowever, this widespread consensus about teleological basicness has\nrecently been called into question by Michael Thompson and other\ndefenders of ”naive“ action theory (Thompson 2008,\n107–119). Thompson considers the case of a person, P,\nwho has pushed a stone from point α to ω. Let β be\nthe halfway point between α and ω. It seems that if\nP pushed the stone from α to ω intentionally,\nthen he pushed the stone from α to β intentionally. Now,\nlet γ be the halfway point between α and β. Once\nagain, it seems that P pushed the stone from α to\nγ intentionally. And so on. It seems, then, that there will\nalways be a further action by which P pushed the stone. In\nother words, there is no basic action. Moreover, as a number of\nauthors have noted (Small 2012; Lavin 2013), the argument can be\ngeneralized for virtually every action, since it can be presented in\nterms of a series of time-segments (instead of place-segments), and\nvirtually every action takes place over time. (For critical\ndiscussion, see Ford 2018.)\n\nBuilding on this argument, Lavin (2013) presents a further challenge\nto the view that there must be (teleological) basic action.\nLavin’s argument centers on the relation of the agent to her\nactions. Consider first a non-basic action, like poisoning the\ninhabitants of the house. The agent’s relation to this action is\nitself an agential matter, since the agent poisons the inhabitants by\ndoing something else intentionally (operating the pump). Now consider\nan arbitrary basic action, A. By definition, the agent\ndoesn’t do A by doing anything else. However, this is\nan action that occurs through time, so, presumably there are\nhappenings h1, h2, …,\nhn by which A takes place. But since\nh1, h2, …, hn are\nmere happenings, this means that the agent relates to A\nnon-agentially. Now, Lavin grants that it may be possible sometimes\nfor us to relate to our actions non-agentially; but it would be\nalarming if this was necessarily the case, as defenders of basic\naction are committed to hold. It would mean that agents are\nnecessarily alienated from their actions, in the way labourers are\nalienated from their labour in Marx’s critique of capitalism. In\nturn, Lavin argues that this would make it impossible for agents to\nhave self-knowledge of their own actions, since self-knowledge is\ngrounded on our agential relation.\n\nThere is a growing literature responding to Thompson’s and\nLavin’s challenges, both refining the arguments, or presenting\nobjections to it (Setiya 2012; Hornsby 2013; Lynch 2017; Frost 2019;\nSmall 2019). This is not surprising, since the debate about basic\nactions has important repercussions for other questions about the\nnature of intentional action. For example, Lavin (2013) holds that\ndefenders of (teleologically) basic action are committed to a\n”decompositional account“ of agency (see section 1). After\nall, if there are basic actions, we may be able to give an account of\nwhat makes something an action in terms of the non-agential relation\nan agent bears to her basic actions. Moreover, Ford (2017; 2018) notes\nthat Thompson’s argument suggests a novel way to pursue action\ntheory, one that defines action not in terms of reasons for\naction but, in the first instance, in terms of the means by which\nan action is pursued.The latter, Ford holds, better captures the\nagential perspective: in the context of deliberation, what the agent\nasks is How to pursue a particular course of action, rather\nthan Why she is doing something. Finally, the debate may have\nrepercussions for our understanding of the relation between skill and\nintentional action. For example, both Frost and Small suggest that at\nthe most fundamental level, our agency depends on our exercise of\npractical skills by which we enter an instrumental order\nwithout consciously representing that order at the level of\npropositional thought (Small 2012; 2019; Frost 2019).\n5.4 Making, Acting, and the Varieties of Agency\n\nNearly all contemporary philosophers treat intentional action\nas a unified category. Despite the many differences between moving a\nfinger, running, hammering a nail, fixing a fridge, eating a sandwich,\nacting justly, keeping a promise, and marrying someone, all of these\nare treated as equally belonging to a single type: acting. The\nassumption is supported by natural language. After all, these are all\nlegitimate answers to the question ”What are you\ndoing?’.\n\nAristotle provides us with an alternative view that has had immense\ninfluence in philosophy. Throughout his writings, Aristotle\ndistinguishes between “making” or “producing”\n(poíêsis) on the one hand, and\n“acting proper” (praxis) on the other (an early\nversion of the distinction appears in Plato’s Charmides\n163a–c). The two are distinguished by their success conditions\n(EE 5.2/NE 6.2 1139b1–4; EE 5.5/NE\n6.5 1140b6–7). The success conditions for makings are external\nto them: one succeeds at making insofar as something external to the\nmaking obtains (the product). By contrast, the success conditions for\nproper actions are the actions themselves. This is why we pursue them\nfor their own sake (ib.). By this standard, the activities of\nhammering a nail, or fixing a fridge count as makings, because the\nhammering is successful insofar as something external takes place: a\nnail is hammered in a wall, or a fridge is fixed. Precisely because\nthe success conditions are external, it is possible to succeed at\nmaking something by luck (EE 5.4/NE 6.4\n1140a17–20). By contrast, Aristotle would regard acting justly,\nkeeping a promise, or marrying someone as proper actions. To succeed\nat these actions consists in doing the actions well. A coerced\nmarriage is not a successful marriage. Hence, these actions cannot be\ndone by luck. This distinction underlies the aforementioned\ndistinction between two forms of human excellence in the practical\nsphere: skill (technê) is excellence at making\n(EE 5.4; NE 6.4 1140a6–23), and practical\nwisdom (phronêsis) is excellence at acting proper\n(EE 5.5/ NE 6.5 1140a25–30 et passim).\n\nAlthough the distinction is barely mentioned in analytical philosophy,\nit has influenced other traditions, such as the Marxist one. From his\nearliest writings, Marx accepts an Aristotelian threefold analysis of\nlabour in terms of the labourer, the process of labouring, and its\nproduct. Marx implicitly rejects the distinction between action proper\nand production, in favour of a dichotomy of his own between different\nforms of productions. This is because for Marx the characteristic\nactivity of the human species is conscious free labouring: an activity\nthat has no end beyond itself (it does not seek anything beyond the\nliving activity that such labouring consists in) (Marx 1844a; 1844b;\n1867). This is what Aristotle took as the distinguishing feature of\nproper actions, done for their own sake. One of Marx’s central\ncriticisms of capitalist societies is that it prevents humans from\nengaging in such an activity. In capitalist societies, the labourer,\nthe labour process, and the product all become commodities that serve\nas mere means for the enjoyment of the owner of labour and product\n(“the capitalist”). Members of capitalist societies are,\nin this sense, alienated (Marx 1844b; 1867). As such, capitalist\nsocieties make it impossible for humans to engage in their most\nfundamental life activity of free production, an activity that the\nMarxist tradition came to designate as “praxis” (Petrovic\n1983), reappropriating the quite different Aristotelian notion.\n\nPerhaps the most influential modern version of a distinction among\ntypes of practical activity is drawn by Arendt (1998). Arendt\ndistinguishes between three kinds of practical activities: labour,\nwork, and action. The most basic of these is labour, which\nArendt conceives as simply an extension of our animal lives: a\n“metabolism” (Marx’s phrase) between the human\nanimal and the world, characterized by a cycle of consumption and the\nproduction of goods to be consumed, and aiming at meeting our basic\nbiological needs (p.69). Since this is a cycle, Arendt suggests that\nthere is no sense of speaking here of means and ends: there is no fact\nof the matter as to whether the production of goods is for the sake of\nconsumption, or the consumption for the sake of production (p.145;\n155). Means and ends enter at the next level of practical activity,\nwork (the Aristotelian poíêsis). Like\nAristotle, Arendt takes the aim of working to be the finished work,\nthe product, whether it be a work of art, like a painting, a tool,\nlike a knife, or a way to safeguard living, like a house. The central\nimportance of work lies in its ability to produce lasting products\nthat lie beyond the activity of the producer (p.136; 144). Arendt\ncontends that these products can begin to shape an objective\nworld of objects that stands against the humans who produce\nthem. However, the world does not emerge in its fullness except by way\nof the third level of practical activity, action (the\nAristotelian praxis). Action is the means by which humans\nreveal themselves in the public sphere, a revelation needed to give\nreality to a personality that otherwise remains entirely unactualized\nin subjectivity. It is thus essentially communicative, and depends on\nother humans to whom one might make herself known (pp.38–49; 95;\n202–7); and it depends, given its essential ephemeral nature,\nfor its permanence in the continued existence of a polity that may\npreserve words and deeds in more enduring forms, like sculptures and\ntales. Ungoverned by either the natural laws of labor, or by the norms\narising from a particular aim, action is for Arendt unproductive,\nfree, and unpredictable. It is the distinguishing activity of human\nbeings as such (p.177; 204–6).\n\nThe three-fold distinction serves as the basis for Arendt’s\ncriticisms of both ancient writers, including Aristotle, and modern\nwriters, including Marx. She criticizes Aristotle both for\ninconsistently assimilating action too much to work/production in his\nanalysis of benefaction as producing a work (ergon) (p.196),\nand for subordinating it to theory (22–23). She criticizes\nMarx’s subsumption of practical activity in general under labour\nfor its failure to provide meaning. She notes that Marx ends in the\nparadoxical position of concluding that that the aim of labour is\nfreedom from labour, even though this is the activity he takes as\ndefinitive of humanity. In other words, Marx ends up concluding that\nthe aim of human life is to do away with human life (p.89; 103; 105).\nFor Arendt, however, this is not merely a theoretical deficiency, but\na manifestation of a broader social tendency that goes back to Plato:\nthe tendency to try to make action proper into that which is\nnot—whether work or labour—to control what is essentially\nunpredictable and free.\n\nThe problems of subsuming practical activity in general to making find\nechoes in some contemporary thinkers. For example, Thompson (2008),\nfollowing Baier (1970) and Mueller (1979), criticizes attempts like\nCastañeda’s (1970) and Chisholm’s (1970) of\nconstruing actions in terms of a schemas such as ‘bringing it\nabout that p’; such propositional complexes, according\nto critics, threaten to undermine the practical form of the thought\nthey mean to capture (cf. Hornsby 2016, Wilson 1980, pp.111–117 for\nfurther discussion). Arendt herself thought that this tendency\nunderlay the attraction of utilitarianism, but she argued that, like\nMarxism, that view was incapable of ever giving further meaning to our\npractical endeavours (p.105). Korsgaard concludes with equal severity\nthat given a distinction between praxis and poíêsis,\n“utilitarianism is not a moral theory, for utility is a property\nof [productions], not actions” (2009, p.18n26).\n\nRegardless of what one thinks of these arguments, it is evident that\nthe question whether practical activity comes in varieties, as\nAristotle and Arendt thought, is potentially of enormous\nsignificance.\n6. Constitutive Aim\n\nThe question of what, if anything, is the constitutive (or formal) aim\n(or end) of intentional actions is a question about whether there is\nanything that all actions necessarily pursue, irrespective of their\nparticular ends. Some philosophers (Setiya 2016b) deny that there is a\nconstitutive aim of acting or that there is something that every\naction as such aims at. On this view, there is no such thing as an aim\ncontained in acting as such; each action just aims at its particular\nend. On the other hand, many philosophers try to derive important\nconsequences for ethics from the idea that action or agency has a\nconstitutive aim. However, we will leave aside the examinations of\nthese claims and focus only on the question as it pertains to the\ncharacterization of agency. (Cf. Bagnoli 2017; 2022.)\n6.1 Motivations and Different Versions of the View\n\nWhat could motivate the idea that actions have a constitutive aim\nabove and beyond the particular ends they pursue? An important\nconsideration is that, arguably, only by appealing to a constitutive\naim, can we evaluate actions and have a proper standard of practical\nreason. Much in the same way that the aim of belief (generally thought\nto be “truth” or “knowledge”) might provide a\nstandard for theoretical reasoning and correct belief, a constitutive\naim of action would provide a standard for practical reasoning and\nsuccessful action. More specifically, it seems that some actions are\nsuccessful in achieving their particular ends and yet are cases of\npractical failures in some deeper way, exhibiting what appears like\npractical irrationality or at least some form of practical ignorance.\nSuppose I have dreamt all my life to move to Seattle, and I finally\nsecured a position in the city. However, as I arrive in Seattle and\ntry to arrange my life, my life in Seattle is a great disappointment;\neven though there is nothing important that I found out about Seattle\nthat I didn’t know already, I completely regret having pursued\nthis end. Although I achieved my aim of moving to Seattle, my actions\nseem to have failed in an important way; arguably, I manifested my\nagency in a defective way.\n\nOf course, one can explain my disappointment in many ways that do not\nseem to presuppose a constitutive aim of action: there were other ends\nthat I had that conflict with moving to Seattle and I hadn’t\nfully appreciated this beforehand. Perhaps I no longer care about the\nthings that made me want to move to Seattle; moving to Seattle was a\nmeans to ends I had abandoned and didn’t realize that it made no\nlonger sense to pursue this end. But it is unclear that these\nobservations will suffice; it seems that none of this might have\nhappened and yet my move to Seattle was still a practical failure.\n\nLet us take a concrete example: suppose the constitutive aim of action\nis happiness (see Frey 2019 for an argument that this is a view held\nby Aquinas). On this view, then, every action (directly or indirectly)\naims at happiness, and the realization of an end that does not result\nin happiness is a shortcoming of my agency. Therefore, if my going to\nSeattle did not contribute to my happiness, or if, worse, it\ncontributed to undermining it, then it was a defective case of agency.\nThis failure is often thought to parallel the kind of internal failure\ninvolved in false beliefs: such beliefs supposedly fail to meet a\nstandard internal to theoretical cognition.\n\nAnother, related, way to motivate the idea that action has a\nconstitutive aim focuses on the standpoint of deliberation. When\ndeliberating about what to do, it seems that I need to find an answer\nto the question “what to do” or “whether to\nφ” (Hieronymi 2005; 2006; Shah 2008); in the good case, my\naction expresses an adequate answer to this question. But how could I\ngo about answering these questions if action did not have a\nconstitutive aim; if there’s nothing that could count as the\ncorrect way of answering this question? Similarly, from the point of\nview of action explanation, some answers seem to provide an\nintelligible explanation of action while others seem to invite the\nquestion “but why would you aim at (want) that?”\nIf you ask me “Why are we eating the jello?”,\n“Because it is blue” seems to invite further questions,\nwhile “Because I find the taste pleasant” brings the\ninquiry to an end. Anscombe argues that the search for further\nexplanations ends when we hit a “desirability\ncharacterization”, something that is not just conceived as good\nbut “really … one of the many forms of the\ngood” (Anscombe 1957, §40).\n\nThere seems to be a parallel structure in the case of belief: in\ndeliberating about what to believe, it seems that I must be similarly\nguided by an ideal of correct belief (Shah and Velleman 2006). In\nfact, philosophers who accept that there is a constitutive aim of\naction often compare action and belief (Velleman 1992; 1996; Tenenbaum\n2007; 2012; 2018b; Schafer 2013). Belief is supposed to have truth as\nits constitutive aim, and just as belief is held, at least in the good\ncase, in accordance with this constitutive aim (as Hume 1748 said,\n“a wise man … proportions his belief to the\nevidence”), intentional agency is guided by its constitutive\naim.\n\nThere are various proposals of what the constitutive aim of an action\nmight be. Perhaps the most traditional version of this view is the\nidea that the good is the constitutive aim of agency, possibly going\nback to Socrates (Protagoras 351a–8e; Gorgias\n467c–8d). The notion of “good” involved here can be\nvery thin, meaning no more than “considering matters\naright” (Williams 1981) in the realm of practical reason; such\nviews are versions of the thesis often called “the guise of the\ngood” (Tenenbaum 2007; Clark 2010; Schafer 2013). According to\nthe guise of the good, if I φ intentionally, then I must take\nφ-ing to be good. Arguably some other versions of the constitutive\naim of agency are specifications of the thin notion of\n“good” or “human good” (see Boyle and Lavin\n2010). Other constitutive aims that have been defended in literature\nare self-understanding or autonomy (Velleman 1989; 1992; 1996; 2009),\nself-constitution (Korsgaard 1996; 2008; 2009), and the will to power\n(Katsafanas 2013).\n6.2 Objections\n\nA number of challenges have been raised in the literature to the claim\nthat there must be a constitutive aim of action. First, suppose we\naccept the causal theory of action: an intentional action just is the\neffect of a “primary reason”. On such a view, it seems\nthat an intentional action is constituted by its causal antecedents,\nrather than by a necessary aim that one has in acting. However, causal\ntheories are not incompatible with constitutivism. Since on these\nviews, some of the causal antecedents of the action will be conative\nstates (like an intention), the question of whether intentional action\nhas a constitutive aim will depend on whether the conative state has a\nconstitutive aim or whether a specific conative state must always\nfigure on the genesis of intentional action. For instance, in\nVelleman’s early work (for instance, Velleman 1989), intentional\naction was an action that was caused by a desire for self-knowledge,\nand the content of such a desire was thus the constitutive aim of\nagency. Smith (2013; 2015; 2019) also develops a form of\nconstitutivism that endorses the standard story of action.\n\nSetiya raises a couple of important challenges to the idea that action\nhas a constitutive aim. According to Setiya (2007), any theory of\naction needs to account for the fact that practical knowledge (or a\nbelief condition in his version; see section 4 of this entry) is\nessential to intentional action. However, the belief condition seems\nto be conceptually independent of any constitutive aim of action, and\nthus accepting that both are constitutive of intentional action\namounts to postulating an unexplained necessary connection.\n\nSecondly, Setiya (2010) relies on the distinction between an\nexplanatory reason and a normative reason to argue against the\n“guise of the good” (see Alvarez 2017 for a detailed\naccount of the distinction); his argument there could be extended to\nother proposals for the constitutive aim of action. An intentional\naction is an action done for an explanatory reason, namely, a\nreason that explains why the agent acted as she did, in\nAnscombe’s special sense of the question ‘Why’.\nHowever, Setiya points out that an explanatory reason need not be a\nnormative reason; in fact, any reason that the agent believes\nto be her reason to act can be an explanatory reason, even if the\nobject of such a reason is not good in any way. But since the reasons\nthat explain intentional action need not be good in any way, it seems\nfalse that the agent must act only on reasons that she regards to be\ngood in some way, and thus that she aims at the good in acting.\n\nPhilosophers have tried to answer these challenges. One can argue that\na knowledge or belief condition, to the extent that it is valid, is\nexplained by the constitutive aim of action. Moreover, perhaps the\npossibility of a third-person explanation of an action in terms of\nexplanatory reasons whose objects are not good in any way is\ncompatible with the fact that from the first-person point of view,\nthese objects must have been regarded to be good in some way. So even\nif the fact that Rugen kills his father explains why Inigo Montoya\nkilled Rugen without providing a normative reason for it, it still\nmight be the case that avenging his father must have appeared good\nto Inigo Montoya in some way if he killed Rugen intentionally\n(see Tenenbaum 2012).\n\nAnother well-known challenge to the idea that actions have a\nconstitutive aim is David Enoch’s “schmagency”\nobjection (Enoch 2006; 2011); in this context, the objection raises\nthe possibility that for any purported constitutive aim, one could\nspurn such an aim and merely “schmact” or be a mere\n“schmagent”—someone who behaves just like an agent\nexcept for having the constitutive aim of agency. Enoch’s\nobjection, however, is specifically concerned with attempts to derive\nnormative consequences from the constitutive aim of action (for\nfurther discussion, see Bagnoli 2017; 2022).\n7. Omission\n7.1 Different Ways of Not Acting\n\nThe scope of our inactivity is vast; at each moment, there are many\nthings I don’t do. Right now, I am not competing in the\nOlympics, not writing poetry, not swimming in the English Channel, not\nflying over the moon, or taking a journey to the center of the earth.\nHowever, none of the things could be plausibly described as cases of\nomissions or refrainings; it would be odd if I were told that I was\nrefraining from competing in the Olympics or omitting to fly over the\nmoon. Philosophers often describe cases of omissions as cases of my\nfailing to do something that I was somehow “supposed to\ndo” (Bach 2010). Only some of my omissions are intentional or\neven voluntary: if my alarm does not go off and I miss my class\nbecause I overslept, I omitted to teach but not intentionally. On the\nother hand, if I fail to show up because I am protesting my\nuniversity’s salary cuts, my omission was intentional.\nIntentional omissions and (intentional) refrainings are generally\ntaken to be the only possible candidates for being instances of agency\namong not-doings (see Vermazen 1985 for an expression of this idea).\nThus, we will focus on these cases. The categories of intentional\nomissions and refraining are not necessarily identical. If I refrain\nfrom striking my opponent in a fit of anger, it seems wrong to say\nthat I omitted to strike her as there is no sense in which I was\n“supposed to” strike my opponent.\n7.2 Agency, Omissions, and Refrainings\n\nSuppose all the Faculty at State University are upset about the\nrecently announced cuts, and each of them express their\ndissatisfaction but in different ways: Mary wears a T-shirt that says\n“No More Cuts”, Terry writes a letter to the local paper,\nand Larry simply decides not to go to the department’s holiday\nparty. It seems that in all these cases, the Faculty members are\nmanifesting their agency—they are all equally expressing their\ndissatisfaction with the cuts—even if Larry does so by\n(intentionally) not doing something. Such cases of\nrefrainings and intentional omissions seem paradigmatic instances of\nagency and yet they do not seem to be cases of action: after all, the\nagent did nothing. But how could the absence of an action be a\nmanifestation of agency? One might be tempted to avoid any puzzling\nconclusions by simply denying that omissions are absences; by, for\ninstance, proposing that Larry’s intentional omission consists\nin doing whatever acting he did instead of engaging in the\nomitted action. So if he goes to the bar instead of going to the\nholiday party, Larry omits to go to the party by going to the\nbar and so his going to the bar and his omitting to go to the party\nare the same event. However, this view immediately encounters\ndifficulties as it seems that I can intentionally omit to do things\nwithout engaging in any positive act. I can refrain from laughing at\nmy enemy’s jokes just by staying still and I can intentionally\nomit things even while asleep (Clarke 2014): indeed, instead of going\nto the bar, Larry could have omitted to go to the party by simply\nsleeping through it.\n\nEarly attempts to explain how an agent might intentionally\nnot do something, without claiming that intentional omissions\nand refraining are actions, go back at least to Ryle (1973); Ryle\nargues that negative “actions” are not actions, but what\nhe calls “lines of actions’, a category that also includes\ngeneral policies such as ”Take only cold baths“. More\nrecently, Alvarez (2013) argues that the fact that omissions and\nrefrainings can also manifest agency is a consequence of the fact that\nthe power to act (intentionally) is a two-way power: a power to either\ndo or not do something. Thus, when I refrain from driving my\ncar, I manifest my agency not by engaging in an action, but rather by\nsettling on not driving it (See Steward 2012; 2020 for\nfurther defense of the idea of agency as a two-way power).\n7.3 Intentional Omissions and the Causal Theory of Action\n\nIf we accept that omissions are absences, or at least that they are\nnot events, the possibility of intentional omissions seem to present a\nchallenge to the causal theory of action. After all, if agency can be\nmanifested without any events being present, it is difficult to see\nhow agency can be explained in the terms of the standard story of\naction (that is, in terms of the causal history of the bodily\nmovements that manifest our agency). Hornsby (2004) argues that the\nfailure of the standard causal theory to account for omissions is\nsymptomatic of its more general failure to locate the agent in an\naccount of intentional action that reduces agency to causal\nconnections between non-agential happenings.\n\nThere are at least two ways in which causal theorists try to answer\nthese charges. One possibility is to argue that even though\nintentional omissions are absences, what makes them intentional is\nthat facts about their causal history are analogous to the facts about\ncausal history that make ”positive actions“ instances of\nagency (Clarke 2010; 2014). On this view, just as positive actions are\ncaused by an intention, intentional omissions are cases in which the\nnon-obtaining of a certain event is similarly explained by an\nintention. However, Sartorio (2009) argues that intentional omissions\npose a serious challenge even to this broader understanding of the\nstandard causal theory of action. Sartorio argues that intentional\nomissions are often not best explained by other events (such as the\nformation of an intention), but by the non-occurrence of\ncertain events (the best explanation of why I omitted to help my\nfriend move might be that I omitted to form the intention to\nhelp them, rather than that I did form the intention not to help\nthem). Another strategy to make omissions compatible with the standard\ncausal theory is to try to show that omissions are events, while\navoiding the questionable view that the omission must be identified\nwith what the agent intentionally did at the time of the omission\n(Payton 2021).\n8. Animal Action\n\nFrom the start, our focus has been on the intentional actions of fully\ndeveloped rational agents. However, this raises the question: what\nabout other beings, such as (non-human) animals? Can they act? If so,\ndo they act in the same way as fully developed humans do? (Similar\nquestions arise for children and robots, but our focus shall be on the\ngrowing literature on animal agency.)\n\nAt first sight, the question may seem uninteresting: Of course,\nanimals can act! This seems to be a core commitment of our linguistic\npractices regarding animals, as we can truthfully assert claims like\nthe following:\n\n(17)\nThe cat is stealthily approaching the tree in order to hunt the\nbird.\n(18)\nCanela (a dog) wants you to give her a cookie—that’s\nwhy she is following you around.\n(19)\nThe squirrel is digging in the yard because it thinks there are\nnuts there.\n\n\nThese sentences seem to attribute to animals the capacity to take\nmeans for remote ends, the capacity to desire objects and act in\npursuit of these desires, and the capacity to employ their thoughts\nabout their surroundings in the service of such pursuits. Unless we\nare skeptics about the folk-psychological concepts involved in these\nascriptions, then, we should hold that animals are agents (but see\nGodfrey-Smith 2003, who holds that these folk concepts may be\nparticularly problematic when applied to animals). It is not\nsurprising, then, that Aristotle defined animal life in terms of the\ncapacity for a type of action, movement in place (DA 432a),\nor that Kant attributes a faculty of desire to all animals, through\nwhich they actualize their representations (KpV9).\n\nDespite all this, even Aristotle hedges on the ascription of action to\nanimals: although he grants that they are capable of voluntary\n(hekusion) action (DMA 11, 703b2 et passim;\nNE 3.1, 1111a), he also says that only mature human beings\nare capable of action proper (praxis) (NE 3.1,\n1111b). This is because action proper requires the capacity for\ndeliberation, which animals lack. A modern version of this view is\ndefended by Stoecker (2009), who argues that agency presupposes the\ncapacity to act on the basis of ”arguments“ understood as\ngrounds on which one might (reasonably) act. Similar reasons for\nskepticism about animal agency were influentially advanced by Davidson\n(1982; 2003). For, as we saw, Davidson takes it that intentional\naction is action for a reason; but acting for a reason requires\npossession of beliefs. Yet, Davidson held that ascription of belief\nmakes sense only to beings who possess the concept of belief, which in\nturn requires the capacity for higher-order thought. Since Davidson\nassumed that animals possess neither concepts nor the capacity for\nhigher-order thought, he concluded that animals are not capable of\nintentional action. (Davidson, to our knowledge, does not address the\nquestion whether animals are capable of acting simpliciter. However,\nhe seems committed to saying that animals cannot act at all, given\nthat he defines actions in terms of intentional actions: for him an\naction is an event that is intentional under a certain description,\nsee Davidson 1971).\n\nWe can abstract from these considerations a more general form of\nargument for skepticism about animal agency, captured by the following\nschema:\n\nIf A acts, A must possess features \\(F_1, F_2,\n\\ldots , F_n\\). [Presuppositions for Agency Requirement]\nAnimals don’t possess \\(F_1, F_2, \\ldots ,\nF_n\\). [Presuppositions Animals Lack]\nTherefore, animals do not act.\n\n\nThis schema is useful as a way to categorize sources of skepticism\nabout animal agency, and different responses offered in the\nliterature, depending on which premises are called into question.\n\nA prominent way of criticizing the argument is to call premise 1 into\nquestion. For example, Steward (2009) criticizes Davidson’s view\nthat agency requires the capacity to act for reasons (Premise 1 in\nDavidson’s argument). Her objection is based on empirical\nresearch suggesting that agency ascriptions are developmentally prior\nto propositional attitude ascriptions. She argues that implicit in\nthese earlier ascriptions is a less demanding account of agency that\npresupposes more basic object-directed attitudes (as well as other\ncapacities, such as subjectivity and agential control). Since animals\npossess these features, there is an important sense in which they act.\nOther arguments in a similar vein include Dretske’s (1999)\nargument to the effect that agency presupposes only the capacity for\nrepresenting the world (understood, roughly, as a learned response\nwhose operations are shaped by the environment through experience),\nand the idea defended by Korsgaard (2018), Sebo (2017), and Schapiro\n(2021) that animals act on the basis of simpler, perceptual-like,\nrepresentations.\n\nOther scholars grant the basic links between agency and reasons or\nmeans-ends reasoning but question further presuppositions of the\nargument. For example, some scholars grant that actions must be done\nfor a reason, but hold that (some) animals meet this condition, since\nthey are capable of having non-conceptual thoughts (Hurley 2003); they\ncan engage in certain forms of inference in virtue of a non-linguistic\nsensitivity to inferential relations; and at least some of them (like\nchimpanzees) manifest a distinctive kind of sensitivity to reasons\nthat doesn’t presuppose higher-order thought (Glock 2009; Arruda\nand Povinelli 2016). Using a similar strategy, Camp and Shupe (2017)\ngrant that action presupposes the capacity to distinctively represent\nmeans and ends but argue that the features presupposed by such a\ncapacity are more minimal than skeptics about animal agency assume:\nfor example, they may include metacognitive resources that keep track\nof a state without representing it as such.\n\nFinally, there are scholars who argue—largely based on empirical\nfindings—against premise 2 on the grounds that animals possess\nthe very capacities denied by skeptics of animal agency. For example,\nKaufmann (2015) argues that chimpanzees are capable of a fairly\nsophisticated form of planning that meets the constraints of\nBratman’s account of planning agency. They are thus capable of\nacting, even though they lack conceptual representations. The question\nwhether some animals (and, if so, which) have beliefs has also been\nthe subject of debate on the basis of empirical research. While both\nearly and recent studies appeared to support the Davidsonian view that\nanimals lack beliefs (Heyes and Dickinson 1990; Marticorena et al.\n2011, Horschler, MacLean, and Santos 2020;), later research\ncomplicates the question (de Waal 2016; Krupenye et al. 2016).\n\nThus far, we have examined ways in which defenders of animal agency\ncan play defense, by criticizing different parts of the argument for\nanimal skepticism. When playing offense, defenders of animal agency\ncommonly appeal to our common ways of speaking and thinking about\nanimals, which, as noted, provide prima facie good grounds to ascribe\nthem agency. In addition, it has been noted that the heightened\nconditions on agency commonly used to exclude animals would have\ncounterintuitive effects for human actions. After all, many\nof our human intentional actions (such as habitual actions) do not\nseem to involve higher-order thought, or previous deliberation (a key\ninsight that leads Hyman 2015 to distinguish different senses of\n”acting’).\n\nMoreover, several authors grant that full-fledged intentional human\naction is special, but argue that we must recognize a more basic form\nof agency for animals. (This appears to be the view favoured by\nAnscombe (1957), who held that animals could act intentionally,\nalthough not in the language-dependent way that humans could, where we\ncan draw a significant distinction between the action itself and an\nexpression of intention. See Gustafsson 2016; Marcus 2021). The need\nto recognize a more basic form of agency can be motivated by noting\nthat otherwise the development of full-fledged human agency becomes\ndevelopmentally mysterious, both at the inter- and intra-species\nlevel. Thus, unless we can ascribe agency to non-rational animals, it\nwill be hard to explain how rational capacities might emerge in humans\nat the evolutionary level; and unless we ascribe agency to human\ninfants, it will be hard to explain how conceptual capacities emerge\n(Cussins 1992; MacIntyre 1999; Lovibond 2006; Steward 2009; Fridland\n2013).\n\nIn light of all these considerations, animal agency skepticism is\nnowadays a moribund view, with few defenders. However, even granting\nthat animals are agents, important questions remain about the nature\nof this agency, and its connection to intentional or rational agency.\nIndeed, as scholars continue to investigate the topic in an\nempirically informed way, we may need to draw further distinctions to\ncapture the richness of the forms of agency that are manifested across\ndifferent species and stages of development in the animal kingdom.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Achinstein, Peter, 1975, “Causation, Transparency, and\nEmphasis”, <em>Canadian Journal of Philosophy</em>, 5 (1):\n1–23. ",
                "Alvarez, Maria, 2013, “Agency and Two-Way Powers”,\n<em>Proceedings of the Aristotelian Society</em>, 113: 101–121. ",
                "–––, 2017, “Reasons for Action:\nJustification, Motivation, Explanation”, <em>The Stanford Encyclopedia of Philosophy</em> (Winter 2017 Edition), Edward\nN. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/reasons-just-vs-expl/\">https://plato.stanford.edu/archives/win2017/entries/reasons-just-vs-expl/</a>&gt;.",
                "Alvarez, Maria, and John Hyman, 1998, “Agents and their\nActions”, <em>Philosophy</em>, 73 (2): 219–245. ",
                "Annas, Julia, 1978, “How Basic Are Basic Actions?”,\n<em>Proceedings of the Aristotelian Society</em>, 78: 195–213.",
                "Anscombe, G. E. M., 1957, <em>Intention</em>, Oxford: Basil\nBlackwell, 1957; 2nd edition, 1963; reprinted, Cambridge, MA: Harvard\nUniversity Press, 2000..",
                "–––, 1969, “Causality and\nExtensionality”, <em>The Journal of Philosophy</em>, 66 (6):\n152–159.",
                "–––, 1979, “Under a\nDescription”, <em>Noûs</em>, 13 (2): 219–233.",
                "–––, 1995, “Practical\nInference”, in Rosalind Hursthouse, Gavin Lawrence and Warren\nQuinn (eds.), <em>Virtues and Reasons: Philippa Foot and Moral\nTheory</em>, Oxford: Clarendon Press, pp. 1–34. ",
                "Aquinas, T., <em>Summa Theologica</em>, 1272, literally translated\nby Fathers of the English Dominican Province, London: Burn, Oates\n&amp; Washbourne, 1920.\n[<a href=\"https://www.ccel.org/a/aquinas/summa/home.html\" target=\"other\">Aquinas 1272 available online</a>.]",
                "Arendt, Hannah, 1998, <em>The Human Condition</em>, 2nd\nEdition, Chicago and London: University of Chicago Press. ",
                "Aristotle, <em>De Anima</em> [<em>DA</em>], in <em>The Complete\nWorks of Aristotle</em>, Jonathan Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995.",
                "–––, <em>De Motu Animalium</em> [<em>DMA</em>],\nin <em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.",
                "–––, <em>Eudemian Ethics</em> [<em>EE</em>], in\n<em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.",
                "–––, <em>Nicomachean Ethics</em> [<em>NE</em>],\nin <em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.",
                "–––, <em>Physics</em> [<em>Phys.</em>], in <em>The\nComplete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995. ",
                "Arruda, Caroline T., and Daniel J. Povinelli, 2016, “Chimps\nas Secret Agents”, <em>Synthese</em>, 193 (7): 2129–2158.",
                "Bach, Kent, 2010, “Refraining, Omitting, and Negative\nActs”, in Timothy O’Connor and Constantine Sandis (eds.),\n<em>A Companion to the Philosophy of Action</em>, Chichester, West\nSussex: Wiley-Blackwell, pp. 50–57. ",
                "Bagnoli, Carla, 2017, “Constructivism in Metaethics”,\n<em>Stanford Encyclopedia of Philosophy</em> (Winter 2017 Edition),\nEdward N. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/constructivism-metaethics/\">https://plato.stanford.edu/archives/win2017/entries/constructivism-metaethics/</a>&gt;.",
                "–––, 2022, <em>Ethical Constructivism</em>,\nCambridge: Cambridge University Press.",
                "Baier, Annette, 1970, “Act and Intent,” <em>Journal of\nPhilosophy</em>, 67: 648–658. ",
                "–––, 1971, “The Search for Basic\nActions”, <em>American Philosophical Quarterly</em>, 8 (2):\n161–170. ",
                "Beddor, Bob, and Carlotta Pavese, 2021, “Practical Knowledge\nwithout Luminosity”, <em>Mind</em>, 131 (523): 917–934.\ndoi:10.1093/mind/fzab041",
                "Bilgrami, Akeel, 2012, <em>Self-Knowledge and Resentment</em>,\nCambridge, MA: Harvard University Press. ",
                "Bishop, John, 1989, <em>Natural Agency: An Essay on the Causal\nTheory of Action</em>, New York: Cambridge University Press. ",
                "Boyle, Matthew, 2016, “Additive Theories of Rationality: A\ncritique”, <em>European Journal for Philosophy of Science</em>,\n24 (3): 527–555. ",
                "–––, 2022, “Skepticism about\nSelf-Understanding”, in Lisa Miracchi and Michael Brent (eds.),\n<em>Mental Action and the Conscious Mind</em>, New York: Routledge,\npp. 182–204. ",
                "Boyle, Matthew, and Douglas Lavin, 2010, “Goodness and\nDesire”, in Sergio Tenenbaum (ed.), <em>Desire, Practical\nReason, and the Good</em>, New York: Oxford University Press, pp.\n158–199. ",
                "Brand, Myles, 1984, “Intending and Acting”,\n<em>Mind</em>, 96 (381): 121–124. ",
                "Brass, Marcel, Ariel Furstenberg and Alfred R. Mele, 2019,\n“Why Neuroscience Does Not Disprove Free Will”,\n<em>Neuroscience and Biobehavioral Reviews</em>, 102:\n251–263.",
                "Bratman, Michael, 1987, <em>Intention, Plans, and Practical\nreason</em>, Cambridge, MA: Harvard University Press.",
                "–––, 1991, “Cognitivism About Practical\nReason”, <em>Ethics</em>, 102 (1): 117–128.",
                "–––, 1999a, <em>Faces of Intention: Selected\nEssays on Intention and Agency</em>, Cambridge: Cambridge University\nPress. ",
                "–––, 1999b, “Toxin, Temptation, and the\nStability of Intention”, in Michael Bratman (ed.), <em>Faces of\nIntention</em>, Cambridge: Cambridge University Press, pp.\n58–91.",
                "–––, 2007, <em>Structures of Agency</em>, Oxford\nand New York: Oxford University Press.",
                "–––, 2018, <em>Planning, Time, and\nSelf-Governance: Essays in Practical Rationality</em>, New York:\nOxford University Press. ",
                "Camp, Elisabeth, and Eli Shupe, 2017, “Instrumental\nReasoning in Nonhuman Animals”, in Kristin Andrews and Jake Beck\n(eds.), <em>The Routledge Handbook of Philosophy of Animal Minds</em>,\nLondon: Routledge, pp. 100–118.",
                "Campbell, Lucy, 2018, “An Epistemology for Practical\nKnowledge”, <em>Canadian Journal of Philosophy</em>, 48 (2):\n159–177. ",
                "Carruthers, Peter, 2011, <em>The Opacity of Mind: An Integrative\nTheory of Self-Knowledge</em>, Oxford: Oxford University Press.",
                "Castañeda, Hector-Neri, 1975, <em>Thinking and Doing: The\nPhilosophical Foundations of Institutions</em>, Dordrecht: D. Reidel.",
                "Charles, David, 1984, <em>Aristotle’s Philosophy of\nAction</em>, Ithaca: Cornell University Press. ",
                "–––, 2015, “Aristotle’s\nProcesses”, in Mariska Leunissen (ed.), <em>Aristotle’s\nPhysics: A Critical Guide</em>, Cambridge: Cambridge University Press,\npp. 186–205. ",
                "–––, 2018, “Processes, Activities and\nActions”, in Rowland Stout (ed.), <em>Process, Action, and\nExperience</em>, Oxford: Oxford University Press, pp.\n185–209.",
                "Chisholm, Roderick, 1964, “Human Freedom and the\nSelf”, <em>The Lindley Lecture</em>, Lawrence, KS: University of\nKansas.",
                "–––, 1970, “The Structure of\nIntention”, <em>Journal of Philosophy</em>, 67 (19):\n633–647.",
                "Clark, Philip, 2010, “Aspects, Guises, Species, and Knowing\nSomething to Be Good”, in Sergio Tenenbaum (ed.), <em>Desire,\nPractical Reason, and the Good</em>, New York: Oxford University\nPress, pp. 234–244. ",
                "–––, 2020, “Intentions, Intending, and\nBelief: Noninferential Weak Cognitivism”, <em>Pacific\nPhilosophical Quarterly</em>, 101 (2): 308–327. ",
                "Clarke, Randolph, 2010, “Intentional Omissions”,\n<em>Noûs</em>, 44 (1): 158–177.",
                "–––, 2014, <em>Omissions: Agency, Metaphysics,\nand Responsibility</em>, New York: Oxford University Press.",
                "Cleveland, Timothy, 1997, <em>Trying Without Willing</em>,\nAldershot: Ashgate Publishing. ",
                "Crowther, Thomas, 2018, “Processes as Continuants and\nProcesses as Stuff”, in Rowland Stout (ed.), <em>Process,\nAction, and Experience</em>, Oxford: Oxford University Press, pp.\n58–81. ",
                "Crowther, Thomas, 2011, “The Matter of Events”,\n<em>The Review of Metaphysics</em>, 65 (1): 3–39. ",
                "Cussins, Adrian, 1992, “Content, Embodiment and Objectivity:\nThe Theory of Cognitive Trails”, <em>Mind</em>, 101 (404):\n651–688.",
                "Dancy, Jonathan, 2000, <em>Practical Reality</em>, Oxford: Oxford\nUniversity Press.",
                "Danto, Arthur C., 1979, “Basic Actions and Basic\nConcepts”, <em>The Review of Metaphysics</em>, 32 (3):\n471–485.",
                "Davidson, Donald, 1963, “Actions, Reasons and Causes”,\n<em>Journal of Philosophy</em>, 60: 685–700; reprinted in\nDavidson 2001a.",
                "–––, 1967a, ‘Causal Relations’,\n<em>Journal of Philosophy</em>, 64: 691–703; reprinted in\nDavidson 2001a.",
                "–––, 1967b, ‘The Logical Form of Action\nSentences’, in Nicholas Rescher (ed.), <em>The Logic of Decision\nand Action</em>, Pittsburgh: University of Pittsburgh Press, reprinted\nin Davidson, 2001a.",
                "–––, 1970a, ‘How is Weakness of the Will\nPossible?’, in Joel Feinberg (ed.), <em>Moral Concepts</em>,\nOxford: Oxford University Press; reprinted in Davidson 2001a.",
                "Davidson, Donald, 1970b, “Intending”, in Yirmiahu\nYovel (ed.), P<em>hilosophy of History and Action</em>, Dordrecht: D.\nReidel; reprinted in Davidson 2001a.",
                "–––, 1971, “Agency”, in Robert\nBinkley, Richard Bronaugh, and Ausonia Marras (eds.), <em>Agent,\nAction, and Reason</em>, Toronto: University of Toronto Press;\nreprinted in Davidson 2001a.",
                "–––, 1973, “ Freedom to Act”, in Ted\nHonderich (ed.), <em>Essays on Freedom of Action</em>. New York:\nRoutledge &amp; Kegan Paul.",
                "–––, 1975, “Thought and Talk”, in S.\nGuttenplan (ed.), <em>Mind and Language</em>, Oxford: Oxford\nUniversity Press; reprinted in Davidson 2001b.",
                "–––, 1982, “Rational Animals”,\n<em>Dialectica</em>, 36 (4): 317–328. ",
                "–––, 1985, “Reply to Quine on\nEvents”, in Ernest LePore and Brian McLaughlin (eds.),\n<em>Actions and Events: Perspectives on the Philosophy of Donald\nDavidson</em>, Oxford: Basil Blackwell, reprinted in Davidson 2001a.",
                "–––, 2001a, <em>Essays on Actions and Events:\nPhilosophical Essays Volume 1</em>, Oxford: Clarendon Press, 2nd\nedition.",
                "–––, 2001b, <em>Inquiries into Truth and\nInterpretation</em> (Philosophical Essays: Volume 2), Oxford:\nClarendon Press. ",
                "Della Rocca, Michael, 2020, <em>The Parmenidean Ascent</em>.\nOxford: Oxford University Press.",
                "DeRose, Keith, 2002, “Assertion, Knowledge, and\nContext”, <em>The Philosophical Review</em>, 111 (2):\n167–203. ",
                "Descartes, René, 1641, <em>Meditations on First\nPhilosophy</em>, Leiden; translated in <em>Philosophical Works of\nDescartes</em> (Volume 1), Elizabeth S. Haldane and G.R.T. Ross\n(eds./trans.), New York: Dover Publications, 1931. ",
                "Dretske, Fred I., 1999, “Machines, Plants and Animals: The\nOrigins of Agency”, <em>Erkenntnis. An International Journal of\nAnalytic Philosophy</em>, 51 (1): 19–31.",
                "Dreyfus, S.E. and Dreyfus, H.L., 1980, “A five-stage model\nof the mental activities involved in directed skill\nacquisition.” University of California/Berkeley Operations\nResearch Center.\n [<a href=\"https://apps.dtic.mil/sti/pdfs/ADA084551.pdf\" target=\"other\">Dreyfus &amp; Dreyfus 1980 available online</a>]",
                "Ducasse, C. J., 1925, “Explanation, Mechanism, and\nTeleology”, <em>The Journal of Philosophy</em>, 22 (6):\n150–155.",
                "Dunn, Robert, 1998, “Knowing What I’m About to Do\nWithout Evidence”, <em>International Journal of Philosophical\nStudies</em>, 6 (2): 231–252. ",
                "Enoch, David, 2006, “Agency, Shmagency: Why Normativity\nWon’t Come From What Is Constitutive of Action”, <em>The\nPhilosophical Review</em>, 115 (2): 169–198. ",
                "–––, 2011, “Shmagency Revisited”, in\nMichael S. Brady (ed.), <em>New Waves in Metaethics</em>, Hampshire:\nPalgrave Macmillan, pp. 208–234. ",
                "Falvey, Kevin, 2000, “Knowledge in Intention”,\n<em>Philosophical Studies</em>, 99 (1): 21–44. ",
                "Feinberg, Joel, 1964, “Action and Responsibility”, in\nMax Black (ed.), <em>Philosophy in America</em>, New York: George\nAllen &amp; Unwin Ltd, pp. 134–160. ",
                "Ferrero, Luca, 2010, “Decisions, Diachronic Autonomy, and\nthe Division of Deliberative Labor”, <em>Philosophers’\nImprint</em>, 10 (2): 1–23. ",
                "–––, 2017, “Intending, Acting, and\nDoing”, <em>Philosophical Explorations: An International Journal\nfor the Philosophy of Mind and Action</em>, 20 (sup2): 13–39.",
                "Fleming, Brice Noel, 1964, “On Intention”, <em>The\nPhilosophical Review</em>, 73 (3): 301–320. ",
                "Ford, Anton, 2011, “Action and Generality”, in Anton\nFord, Jennifer Hornsby and Frederick Stoutland (eds.), <em>Essays on\nAnscombe’s Intention</em>, Cambridge, MA: Harvard University\nPress, pp. 76–104. ",
                "–––, 2015, “The Arithmetic of\nIntention”, <em>American Philosophical Quarterly</em>, 52 (2):\n129–143.",
                "–––, 2017, “The Representation of\nAction”, <em>Royal Institute of Philosophy Supplement</em>, 80:\n217–233.",
                "–––, 2018, “The Progress of the\nDeed”, in Rowland Stout (ed.), <em>Process, Action, and\nExperience</em>, Oxford: Oxford University Press.",
                "Frankfurt, Harry, 1971, “Freedom of the Will and the Concept\nof a Person”, <em>The Journal of Philosophy</em>, 68 (1):\n5–20. ",
                "–––, 1978, “The Problem of Action”,\n<em>American Philosophical Quarterly</em>, 15 (2): 157–162.",
                "–––, 1987, “Identification and\nWholeheartedness”, in Ferdinand Schoeman (ed.),\n<em>Responsibility, Character, and the Emotions: New Essays in Moral\nPsychology</em>, New York: Cambridge University Press, pp.\n27–45.",
                "–––, 1992, “The Faintest Passion”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 66 (3): 5–16. ",
                "Frey, Jennifer A., 2019a, “Anscombe on Practical Knowledge\nand the Good”, <em>Ergo: An Open Access Journal of\nPhilosophy</em>, 6 (39): 1121–1151.",
                "–––, 2019b, “Happiness as the Constitutive\nPrinciple of Action in Thomas Aquinas”, <em>Philosophical\nExplorations: An International Journal for the Philosophy of Mind and\nAction</em>, 22 (2): 208–221.",
                "Fridland, Ellen, 2013, “Skill Learning and Conceptual\nThought”, in Bana Bashour Hans Muller (ed.), <em>Contemporary\nPhilosophical Naturalism and Its Implications</em>, New York:\nRoutledge, pp. 13–77.",
                "Fritts, Megan, 2021, “Reasons Explanations (of Actions) as\nStructural Explanations.” <em>Synthese</em>, 199 (5):\n12683–12704.",
                "Frost, Kim, 2019, “The Antinomy of Basic Action”, in\nRoman Altshuler and Michael J. Sigrist (eds.), <em>Time and the\nPhilosophy of Action</em>, New York: Routledge, pp. 37–51.",
                "Galton, Antony, 2006, “The Ontology of Processes and\nEvents”, in Brandon Bennett and Christiane Fellbaum (eds.),\n<em>Formal Ontology in Information Systems: Proceedings of the Fourth\nInternational Conference</em>, Amsterdam: IOS Press, pp.\n4–11.",
                "Gibbons, John, 2010, “Seeing What You ‘re\nDoing’”, in T. Szabo Gendler and J. Hawthorne (eds.),\n<em>Oxford Studies in Epistemology</em>, Oxford: Oxford University\nPress.",
                "Ginet, Carl, 1990, <em>On Action</em>, Cambridge: Cambridge\nUniversity Press.",
                "Glock, Hans-Johann, 2009, “Can Animals Act For\nReasons?”, <em>Inquiry: A Journal of Medical Care Organization,\nProvision and Financing</em>, 52 (3): 232–254.",
                "Godfrey-Smith, Peter, 2003, “Folk Psychology Under Stress:\nComments on Susan Hurley’s ‘Animal Action in the Space of\nReasons”, <em>Mind &amp; Language</em>, 18 (3): 266–72.",
                "Goldman, A. I., 1970, <em>A Theory of Human Action</em>,\nPrinceton: Princeton University Press.",
                "Gopnik, Alison, 1993, “How We Know Our Own Minds: The\nillusion of first-person knowledge of intentionality”,\n<em>Behavioral and Brain Sciences</em>, 16: 1–14. ",
                "Grice, H. P., 1971, “Intention and Uncertainty”,\n<em>Proceedings of the British Academy</em>, 57: 263–279.",
                "Grünbaum, Thor, 2008, “The Body in Action”,\n<em>Phenomenology and the Cognitive Sciences</em>, 7: 243–61.",
                "–––, 2011, “Perception and Non-Inferential\nKnowledge of Action”, <em>Philosophical Explorations</em>, 14\n(2): 153–67.",
                "–––, 2013, “Seeing What I am Doing”,\n<em>Philosophy and Phenomenological Research</em>, 86 (2): 295–318.",
                "Gustafsson, Martin, 2016, “Anscombe’s Bird,\nWittgenstein’s Cat: Intention, Expression, and\nConvention”, <em>Philosophical Topics</em>, 44 (1):\n207–237.",
                "Haase, Matthias, 2018, “Knowing What I Have Done”,\n<em>Manuscrito</em>, 41 (4): 195–253. ",
                "–––, 2022, “Agency, events, and\nprocesses”, in Luca Ferrero (ed.), <em>The Routledge Handbook of\nPhilosophy of Agency</em>, London: Routledge, pp. 47–58.",
                "Haddock, Adrian, 2011, “The Knowledge That a Man Has of His\nIntentional Actions”, in Anton Ford, Jennifer Hornsby and\nFrederick Stoutland (eds.), <em>Essays on Anscombe’s\nIntention</em>, Cambridge, MA: Harvard University Press, pp.\n147–169.",
                "Hansen, Chad, 2020, “Daoism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2020 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/spr2020/entries/daoism/\">https://plato.stanford.edu/archives/spr2020/entries/daoism/</a>&gt;.",
                "Harman, Gilbert, 1986, “Willing and Intending”, in R.\nE. Grandy and Warner (ed.), <em>Philosophical Grounds of\nRationality</em>, Oxford: Oxford University Press, pp. 363–380.",
                "–––, 1997, “Practical reasoning”,\n<em>The Review of Metaphysics</em>, 29 (3): 431–463. ",
                "Hawthorne, John, 2004, <em>Knowledge and Lotteries</em>, Oxford:\nClarendon Press. ",
                "Heyes, Cecilia, and Anthony Dickinson, 1990, “The\nIntentionality of Animal Action”, <em>Mind &amp; Language</em>,\n5 (1): 87–103. ",
                "Hieronymi, Pamela, 2006, “Controlling Attitudes”,\n<em>Pacific Philosophical Quarterly</em>, 87 (1): 45–74. ",
                "–––, 2005, “The Wrong Kind of\nReason”, <em>The Journal of Philosophy</em>, 102 (9):\n437–457. ",
                "Higginbotham, James, 1983, “The Logic of Perceptual Reports:\nAn Extensional Alternative to Situation Semantics”, <em>The\nJournal of Philosophy</em>, 80 (2): 100–127. ",
                "Hobbes, Thomas, 1651/1668, <em>Leviathan: With Selected Variants\nfrom the Latin Edition of 1668</em>, Edwin Curley (ed.), Indianapolis:\nHackett Publishing, 1994. ",
                "Holton, Richard, 1999, “Intention and Weakness of\nWill”, <em>The Journal of Philosophy</em>, 96 (5):\n241–262. ",
                "–––, 2004, “Rational Resolve”,\n<em>The Philosophical Review</em>, 113 (4): 507–535. ",
                "–––, 2009, <em>Willing, Wanting, Waiting</em>,\nOxford and New York: Clarendon Press. ",
                "Hornsby, Jennifer, 1980, <em>Actions</em>, London: Routledge and\nKegan Paul.",
                "–––, 2004, “Agency and Actions”,\n<em>Royal Institute of Philosophy Supplements</em>, 55: 1–23.",
                "–––, 2012, “Actions and Activity”,\n<em>Philosophical Issues</em> (<em>Noûs</em> Supplement), 22:\n233–245. ",
                "–––, 2013, “Basic Activity”,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 87 (1): 1–18.",
                "–––, 2016, “Intending, knowing how,\ninfinitives”, <em>Canadian Journal of Philosophy</em> 46 (1):\n1–17. ",
                "Horschler, Daniel J., Evan L. MacLean and Laurie R. Santos, 2020,\n“Do Non-Human Primates Really Represent Others’\nBeliefs?”, <em>Trends in Cognitive Sciences</em>, 24 (8):\n594–605. ",
                "Horst, David, 2015, “Actions and Accidents”,\n<em>Canadian Journal of Philosophy</em>, 45 (3): 300–325.",
                "Houlgate, Laurence D., 1966, “Mistake in performance”,\n<em>Mind</em>, 75 (298): 257–261. ",
                "Hume, David, 1739–40, <em>A Treatise of Human Nature</em>, David\nFate Norton and Mary J. Norton (eds.), Oxford: Oxford University\nPress, 2000. ",
                "–––, 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London; included in <em>Enquiries concerning Human\nUnderstanding and Concerning the Principles of Morals</em>, L. A.\nSelby-Bigge and P. H. Niddith (eds.), third edition, Oxford: Clarendon\nPress, 1975.",
                "Hurley, Susan, 2003, “Animal Action in the Space of\nReasons”, <em>Mind and Language</em>, 18 (3):\n231–256.",
                "Hyman, John, 1999, “How Knowledge Works”, <em>The\nPhilosophical Quarterly</em>, 49 (197): 433–451. ",
                "–––, 2015, <em>Action, Knowledge, and Will</em>,\nOxford: Oxford University Press.",
                "Ivanhoe, P.J., 1993, “Zhuangzi on skepticism, skill, and the\nineffable Dao”, <em>Journal of the American Academy of\nReligion</em>, 61 (4): 639–654.",
                "Kasulis, Thomas, 2019, “Japanese Philosophy”, <em>The\nStanford Encyclopedia of Philosophy</em> (Summer 2019 Edition), Edward\nN. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2019/entries/japanese-philosophy/\">https://plato.stanford.edu/archives/sum2019/entries/japanese-philosophy/</a>&gt;.",
                "Katsafanas, Paul, 2013, <em>Agency and the Foundation of Ethics:\nNietzschean Constitutivism</em>, Oxford: Oxford University Press.",
                "Katz, Bernard D., 1978, “Kim on Events”, <em>The\nPhilosophical Review</em>, 87 (3): 427–441. ",
                "Kaufmann, Angelica, 2015, “Animal Mental Action: Planning\nAmong Chimpanzees”, <em>Review of Philosophy and\nPsychology</em>, 6 (4): 745–760. ",
                "Kim, Jaegwon, 1966, “On the Psycho-Physical Identity\nTheory”, <em>American Philosophical Quarterly</em>, 3 (3):\n227–235.",
                "–––, 1969, “Events and Their Descriptions:\nSome Considerations”, in Nicholas Rescher (ed.), <em>Essays in\nHonor of Carl G. Hempel</em>, Dordrecht: D. Reidel, pp.\n198–215.",
                "–––, 1973, “Causation, Nomic Subsumption,\nand the Concept of Event”, <em>The Journal of Philosophy</em>,\n70 (8): 217–236.",
                "–––, “Events as Property\nExemplifications”, in M. Brand and D. Walton (eds.), <em>Action\nTheory</em>, Dordrecht: D. Reidel, pp. 310–326.",
                "Kirley, Michael (forthcoming), “Intentional Action,\nKnow-how, and Lucky Success”, <em>Ergo: An Open Access Journal\nof Philosophy</em>.",
                "Korsgaard, Christine M., 1996, <em>Sources of Normativity</em>,\nCambridge: Cambridge University Press.",
                "–––, 2008, <em>The Constitution of Agency:\nEssays on Practical Reason and Moral Psychology</em>, Oxford and New\nYork: Oxford University Press.",
                "–––, 2009, <em>Self-Constitution: Agency,\nIdentity, and Integrity</em>, Oxford: Oxford University Press.",
                "–––, 2018, <em>Fellow Creatures: Our Obligations\nto the Other Animals</em>, Oxford: Oxford University Press.",
                "Kratzer, Angelika, 2021, “Situations in Natural Language\nSemantics”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2021 Edition),\nEdward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2021/entries/situations-semantics/\">https://plato.stanford.edu/archives/win2021/entries/situations-semantics/</a>&gt;.",
                "Krupenye, Christopher, Fumihiro Kano, Satoshi Hirata, Josep Call\nand Michael Tomasello, 2016, “Great Apes Anticipate That Other\nIndividuals Will Act According to False Beliefs”,\n<em>Science</em>, 354 (6308): 110–114.",
                "Langton, Rae, 2004, “Intention as Faith”, <em>Royal\nInstitute of Philosophy Supplement</em>, 55: 243–258.",
                "Lavin, Douglas, 2013a, “Must There Be Basic Action?”,\n<em>Noûs</em>, 47 (2): 273–301. ",
                "–––, 2013b, “Über das Problem des\nHandelns”, <em>Deutsche Zeitschrift Fur Philosophie</em>, 61\n(3): 357–372.",
                "–––, 2015, “Action as a Form of Temporal\nUnity: On Anscombe’s Intention”, <em>Canadian Journal of\nPhilosophy</em>, 45 (5–6): 609–629.",
                "Lemmon, E. J., 1967, “Comments on D Davison ”The\nLogical Form of Action Sentences“”, in Nicholas Rescher\n(ed.), <em>The Logic of Decision and Action</em>, Pittsburgh:\nUniversity of Pittsburgh Press. ",
                "Levy, Neil, 2005, “Libet’s Impossible Demand”,\n<em>Journal of Consciousness Studies</em>, 12 (12): 67–76. ",
                "Levy, Yair, 2013, “Intentional Action First”,\n<em>Australasian Journal of Philosophy</em>, 91 (4):\n705–718.",
                "–––, 2018, “Why Cognitivism?”,\n<em>Canadian Journal of Philosophy</em>, 48 (2): 223–244.",
                "–––, 2022, “Neo-Ryleanism about\nSelf-understanding”, <em>Inquiry</em>, first online 08 February 2022.\ndoi:10.1080/0020174X.2022.2036230",
                "Libet, Benjamin, 1985, “Unconscious Cerebral Initiative and\nthe Role of Conscious Will in Voluntary Action”, <em>The\nBehavioral and Brain Sciences</em>, 8 (4): 529–539. ",
                "Libet, Benjamin, Curtis A. Gleason, Elwood W. Wright and Dennis K.\nPearl, 1993, “Time of Conscious Intention to Act in Relation to\nOnset of Cerebral Activity (Readiness-Potential)”, in Benjamin\nLibet (ed.), <em>Neurophysiology of Consciousness</em>, Boston, MA:\nBirkhäuser Boston, pp. 249–268.",
                "Löhrer, Guido &amp; Sehon, Scott, 2016, “The\nDavidsonian Challenge to the Non-Causalist”, <em>American\nPhilosophical Quarterly</em>, 53 (1): 85–96.",
                "Lovibond, Sabina, 2006, “Practical Reason and its Animal\nPrecursors”, <em>European Journal for Philosophy of\nScience</em>, 14 (2): 262–273.",
                "Lynch, Kevin, 2017, “The Divisibility of Basic\nActions”, <em>Analysis</em>, 77 (2): 312–318.",
                "MacIntyre, Alasdair C., 1999, <em>Dependent Rational Animals: Why\nHuman Beings Need the Virtues</em>, LaSalle, Il: Open Court\nPublishing.",
                "Marcus, Eric, 2012, <em>Rational Causation</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 2019 “Reconciling practical knowledge\nwith self-deception”, <em>Mind</em>, 128(512): 1205–1225. ",
                "–––, 2021, “Anscombe and the Difference\nRationality Makes”, in Adrian Haddock and Rachel Wiseman (eds.),\n<em>The Anscombean Mind</em>, London: Routledge, pp. 241–252.",
                "Marticorena, Drew C. W., April M. Ruiz, Cora Mukerji, Anna Goddu\nand Laurie R. Santos, 2011, “Monkeys Represent Others’\nKnowledge But Not Their Beliefs”, <em>Developmental\nScience</em>, 14 (6): 1406–1416.",
                "Marušić, Berislav, and John Schwenkler, 2018,\n“Intending Is Believing: A Defense of Strong Cognitivism”,\n<em>Analytic Philosophy</em>, 59 (3): 309–340.",
                "Marx, Karl, 1844a, “Critique of Hegel’s Philosophy in\nGeneral” in <em>Economic and Philosophical Manuscripts of\n1844</em>, Karl Marx and Friedrich Engels Collected Works: Volume 3,\nLondon: Lawrence &amp; Wishart, 1975.",
                "–––, 1844b, “Stranged Labour” in\n<em>Economic and Philosophical Manuscripts of 1844</em>, Karl Marx\nand Friedrich Engels Collected Works: Volume 3, London: Lawrence\n&amp; Wishart, 1975.",
                "–––, 1867, Capital (Volume One), in <em>Karl\nMarx and Friedrich Engels Collected Works</em>: Volume 35, London:\nLawrence &amp; Wishart, 1996. ",
                "Mayr, Erasmus, 2011, <em>Understanding Human Agency</em>, Oxford\nand New York: Oxford University Press. ",
                "McDermott, Michael, 1995, “Redundant Causation”,\n<em>The British Journal for the Philosophy of Science</em>, 46 (4):\n523–544. ",
                "–––, 2011. “Anscombe on Bodily\nSelf-Knowledge” in Anton Ford, Jennifer Hornsby and Frederick\nStoutland (eds.), <em>Essays on Anscombe’s Intention</em>,\nCambridge, MA: Harvard University Press, pp. 128–46. ",
                "Mele, Alfred R., 1992, <em>Springs of Action: Understanding\nIntentional Behavior</em>, New York and Oxford: Oxford University\nPress. ",
                "–––, 2009, <em>Effective Intentions: The Power\nof Conscious Will</em>, New York: Oxford University Press. ",
                "–––, 2010, “Libet on free will: Readiness\nPotentials, Decisions, and Awareness”, in Walter\nSinnott-Armstrong and Lynn Nadel (eds.), <em>Conscious Will and\nResponsibility: A Tribute to Benjamin Libet</em>, New York: Oxford\nUniversity Press, pp. 23–33.",
                "–––, 2013, “Actions, Explanations, and\nCauses”, in G. D’Oro (ed.), <em>Reasons and Causes:\nCausalism and Non-causalism in the Philosophy of Action</em>.\nLondon: Palgrave-Macmillan. ",
                "Mele, Alfred R., and Paul K. Moser, 1994, “Intentional\nAction”, <em>Noûs</em>, 28 (1): 39–68. ",
                "Moran, Richard, 2004, “Anscombe on ‘Practical\nKnowledge’”, in J. Hyman and H. Steward (eds.), <em>Royal\nInstitute of Philosophy Supplement</em>, Cambridge: Cambridge\nUniversity Press, pp. 43–68. ",
                "–––, 2012, <em>Authority and Estrangement: An\nessay on self-knowledge</em>, Princeton: Princeton University\nPress.",
                "Moran, Richard, and Martin J. Stone, 2009, “Anscombe on\nExpression of Intention”, in Constantine Sandis (ed.), <em>New\nEssays on the Explanation of Action</em>, London: Palgrave Macmillan,\npp. 132–168.",
                "Mourelatos, Alexander P. D., 1978, “Events, Processes, and\nStates”, <em>Linguistics and Philosophy</em>, 2 (3):\n415–434.",
                "Mueller, Anselm, 1979, “Radical Subjectivity”,\n<em>Ratio</em>, 19: 115–32. ",
                "Mylopoulos, Myrto, and Elisabeth Pacherie, 2019,\n“Intentions: The Dynamic Hierarchical Model Revisited”,\n<em>Wiley Interdisciplinary Reviews. Cognitive Science</em>, 10 (2):\ne1481. ",
                "Nagel, Thomas, 1989, <em>The View From Nowhere</em>, New York:\nOxford University Press. ",
                "Nahmias, Eddy, 2014, “Is Free Will an Illusion? Confronting\nChallenges From the Modern Mind Sciences”, in Walter\nSinnott-Armstrong (ed.), <em>Moral Psychology</em> (Volume\n4: <em>Freedom and Responsibility</em>), Cambridge, MA: MIT Press,\npp. 1–25. ",
                "Nefsky, Julia, and Sergio Tenenbaum, 2022, “Extended Agency\nand the Problem of Diachronic Autonomy”, in Carla Bagnoli (ed.),\n<em>Time in Action</em>, New York: Routledge, pp. 173–195.",
                "Newstead, Anne, 2006, “Knowledge by Intention? On the\nPossibility of Agent’s Knowledge”, in Stephen Hetherington\n(ed.), <em>Aspects of Knowing</em>, Amsterdam: Elsevier Science. ",
                "O’Brien, Lilian, 2012, “Deviance and Causalism”,\n<em>Pacific Philosophical Quarterly</em>, 93 (2): 175–196. ",
                "O’Brien, Lucy, 2007, <em>Self-knowing agents</em>, Oxford:\nOxford University Press.",
                "O’Connor, Timothy and Christopher Franklin, 2022,\n“Free Will”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2022 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2022/entries/freewill/\">https://plato.stanford.edu/archives/sum2022/entries/freewill/</a>&gt;.",
                "O’Shaughnessy, Brian, 1980, <em>The Will</em>, Cambridge:\nCambridge University Press.",
                "–––, “The Epistemology of Physical\nAction”, in Johannes Roessler and Naomi Eilan (eds.), <em>Agency\nand Self-Awareness: Issues in Philosophy and Psychology</em>, Oxford:\nClarendon Press, pp. 345–357.",
                "Oddie, Graham, 2005, <em>Value, Reality, and Desire</em>, New\nYork: Oxford University Press. ",
                "Parsons, Terence, 1990, <em>Events in the Semantics of English: A\nStudy in Subatomic Semantics</em>, Cambridge, MA: MIT Press.",
                "Parry, Richard, 2021, “<em>Episteme</em> and\n<em>Techne</em>”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Winter 2021 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2021/entries/episteme-techne/\">https://plato.stanford.edu/archives/win2021/entries/episteme-techne/</a>&gt;.",
                "Paul, Sarah, 2009a, “How We Know What We’re\nDoing”, <em>Philosophers’ Imprint</em>, 9 (11):\n1–24. ",
                "–––, 2009b, “Intention, Belief, and\nWishful Thinking: Setiya on ”Practical Knowledge“”,\n<em>Ethics</em>, 119 (3): 546–557.",
                "–––, 2011a, “Review of ”Willing,\nWanting, and Waiting“ by Richard Holton”, <em>Mind</em>,\n120: 889–892.",
                "–––, 2011b, “Deviant Formal\nCausation”, <em>Journal of Ethics and Social Philosophy</em>, 5\n(3): 1–24.",
                "–––, 2014a, “Diachronic Incontinence is a\nProblem in Moral Philosophy”, <em>Inquiry: A Journal of Medical\nCare Organization, Provision and Financing</em>, 57 (3):\n337–355.",
                "–––, 2014b, “Embarking on a Crime”,\nin Enrique Villanueva (ed.), <em>Law and the Philosophy of\nAction</em>, Leiden: Brill, pp. 101–124. ",
                "Payton, Jonathan D., 2021, <em>Negative Actions: Events, Absences,\nand the Metaphysics of Agency</em>, Cambridge: Cambridge University\nPress.",
                "Pavese, Carlotta, forthcoming, “Practical Knowledge\nFirst”, <em>Synthese</em>. ",
                "Peacocke, Christopher, 1979, “Deviant Causal Chains”,\n<em>Midwest Studies in Philosophy</em>, 4: 123–155. ",
                "–––, 2003, <em>The Realm of Reason</em>, Oxford:\nOxford University Press. ",
                "Petrovic, Gajo, 1983, “‘Praxis’”, Tom\nBottomore (ed.), <em>A Dictionary of Marxist Thought</em>, 2nd\nedition, pp. 435–440.",
                "Pickard, H., 2004, “Knowledge of Action without\nObservation”, <em>Proceedings of the Aristotelian Society</em>,\n104(1): 205–230. ",
                "Piñeros Glasscock, Juan S., 2020a, “Authoritative\nKnowledge”, <em>Erkenntnis. An International Journal of Analytic\nPhilosophy</em>, 87 (5): 2475–2502. ",
                "–––, 2020b, “Practical Knowledge and\nLuminosity”, <em>Mind</em>, 129: 1237–1267.",
                "–––, 2021, “Alienation or Regress: On the\nNon-inferential Character of Agential Knowledge”,\n<em>Philosophical Studies</em>, 178 (6): 1757–1768. ",
                "Plato, <em>Charmides</em>, in <em>Plato: Complete Works</em>, John\nCooper and Douglas Hutchinson (eds.), Indianapolis: Hackett,\n1997.",
                "–––, <em>Gorgias</em>, in <em>Plato: Complete\nWorks</em>, John Cooper and Douglas Hutchinson (eds.), Indianapolis:\nHackett, 1997.",
                "–––, <em>Parmenides</em>, in <em>Plato: Complete\nWorks</em>, John Cooper and Douglas Hutchinson (eds.), Indianapolis:\nHackett, 1997.",
                "Prichard, H.A., 1945, “Acting, Willing, Desiring”, in\n<em>Moral Obligation</em>, Oxford: Oxford University Press, pp.\n59–69.",
                "Quine, W. V., 1985, “Events and Reification”, in\nErnest LePore and Brian McLaughlin (eds.), <em>Actions and Events:\nPerspectives on the Philosophy of Donald Davidson</em>, Oxford: Basil\nBlackwell, pp. 162–171.",
                "Reynolds, Steven L., 2002, “Testimony, knowledge, and\nepistemic goals”, <em>Philosophical Studies</em>, 110 (2):\n139–161.",
                "Rödl, Sebastian, 2007, <em>Self-consciousness</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2011, “Forms of Practical Knowledge\nand Their Unity”, in Anton Ford, Jennifer Hornsby and Frederick\nStoutland (eds.), <em>Essays on Anscombe’s Intention</em>,\nCambridge, MA: Harvard University Press, pp. 211–241.",
                "Rosenberg, Alexander, and Robert M. Martin, 1979, “The\nExtensionality of Causal Contexts”, <em>Midwest Studies in\nPhilosophy</em>, 4 (1): 401–408.",
                "Ross, Jacob, 2009, “How to be a Cognitivist about Practical\nReason”, <em>Oxford Studies in Metaethics</em>, 4:\n243–281.",
                "Roth, A.S., 2017, “Shared Agency”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Summer 2017 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2017/entries/shared-agency/\">https://plato.stanford.edu/archives/sum2017/entries/shared-agency/</a>&gt;.",
                "Russell, Devlin, 2018, “Intention as Action Under\nDevelopment: Why Intention is Not a Mental State”, <em>Canadian\nJournal of Philosophy</em>, 48 (5): 742–761.",
                "Ryle, Gilbert, 1949, <em>The Concept of Mind</em>, Chicago:\nUniversity of Chicago Press. ",
                "–––, 1973, “Negative\n‘Actions’”, <em>Hermathena</em>, 115: 81–93.",
                "Sandis, Constantine, 2015, “One Fell Swoop: Small Red Book\nHistoricism Before and After Davidson”, <em>Journal of the\nPhilosophy of History</em>, 9 (3): 372–392. ",
                "Sartorio, Carolina, 2009, “Omissions and Causalism”,\n<em>Noûs</em>, 43 (3): 513–530. ",
                "Schafer, Karl, 2013, “Perception and the Rational Force of\nDesire”, <em>The Journal of Philosophy</em>, 110 (5):\n258–281. ",
                "Schaffer, Jonathan, 2005, “Contrastive Causation”,\n<em>The Philosophical Review</em>, 114 (3): 327–358. ",
                "Schapiro, Tamar, 2021, <em>Feeling Like It: A Theory of\nInclination and Will</em>, New York: Oxford University Press. ",
                "Schueler, G. F., 2003, <em>Reasons and Purposes: Human Rationality\nand the Teleological Explanation of Action</em>, Oxford and New York:\nOxford University Press.",
                "Schweikard, D.P., and Schmid, H.B., 2021, “Collective\nIntentionality”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2021 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2021/entries/collective-intentionality/\">https://plato.stanford.edu/archives/sum2017/entries/shared-agency/</a>&gt;.",
                "Schwenkler, John, 2012, “Non-Observational Knowledge of\nAction”, <em>Philosophy Compass</em>, 7 (10): 731–740.",
                "–––, 2015, “Understanding ‘Practical\nKnowledge’”, <em>Philosophers’ Imprint</em>, 15\n(15): 1­–32.",
                "–––, 2019, <em>Anscombe’s Intention: A\nGuide</em>, New York: Oxford University Press.",
                "Schwitzgebel, E., 2019, “The Unskilled Zhuangzi: Big and\nUseless and Not So Good at Catching Rats”, in Karyn Lai and Wai\nWai Chiu (eds.), <em>Skill and Mastery: Philosophical Stories from the\nZhuangzi</em>, London: Roman and Littlefield (2019).",
                "Searle, John R., 1983, <em>Intentionality: An Essay in the\nPhilosophy of Mind</em>, Cambridge: Cambridge University Press..",
                "Sebo, Jeff, 2017, “Agency and Moral Status”,\n<em>Journal of Moral Philosophy</em>, 14 (1): 1–22.",
                "Segvic, Heda, 2011, “Deliberation and Choice in\nAristotle” in M. Pakaluk and G. Pearsons (eds.), <em>Moral\nPsychology and Human Action in Aristotle</em>, Oxford: Oxford\nUniversity Press, pp.144–71. ",
                "Sehon, Scott, 2005, <em>Teleological Realism: Mind, Agency, and\nExplanation</em>, Cambridge, MA: Bradford Books/MIT Press.",
                "Setiya, Kieran, 2007, <em>Reasons Without Rationalism</em>,\nPrinceton: Princeton University Press. ",
                "–––, 2008, “Practical Knowledge”,\n<em>Ethics</em>, 118 (3): 388–409. ",
                "–––, 2009, “Practical Knowledge\nRevisited”, <em>Ethics</em>, 120 (1): 128–137. ",
                "–––, 2010, “Sympathy for the Devil”,\nin Sergio Tenenbaum (ed.), <em>Desire, Practical Reason, and the\nGood</em>, New York: Oxford University Press, pp. 82–111.",
                "–––, 2011, “Reasons and Causes”,\n<em>European Journal for Philosophy of Science</em>, 19 (1):\n129–157.",
                "–––, 2012, “Knowing How”,\n<em>Proceedings of the Aristotelian Society</em>, 112 (3):\n285–307.",
                "–––, 2016a, ‘Anscombe on Practical\nKnowledge,’ in <em>Practical Knowledge: Selected Essays</em>,\nOxford: Oxford University Press, pp. 156–168.",
                "–––, 2016b, “Akrasia and the Constitution\nof Agency”, in <em>Practical Knowledge: Selected Essays</em>,\nNew York: Oxford University Press, pp. 253–271.",
                "–––, 2022, “Intention”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2022 Edition), Edward\nN. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2022/entries/intention/\">https://plato.stanford.edu/archives/fall2022/entries/intention/</a>&gt;.",
                "Shah, Nishi, 2008, “How Action Governs Intention”,\n<em>Philosophers’ Imprint</em>, 8 (5): 1–19.",
                "Shah, Nishi, and Velleman, J. David, 2006, “Doxastic\nDeliberation”, <em>Philosophical Review</em>, 114 (4):\n497–534.",
                "Shepherd, Joshua, 2021, <em>The Shape of Agency: Control, Action,\nSkill, Knowledge</em>, Oxford: Oxford University Press.",
                "Shepherd, Joshua, and J. Adam Carter, forthcoming,\n“Knowledge, Practical Knowledge, and Intentional Action”,\n<em>Ergo: An Open Access Journal of Philosophy</em>.",
                "Sinhababu, Neil, 2017, <em>Humean Nature</em>, Oxford: Oxford\nUniversity Press. ",
                "Slote, Michael, 1979, “Assertion and Belief”, in\nJ. Dancy (ed.), <em>Papers on Language and Logic</em>, Keele: Keele\nUniversity Library, pp. 177–190. ",
                "Small, Will, 2012, “Practical Knowledge and the Structure of\nAction”, in Günter Abel and James Conant\n(eds.), <em>Rethinking Epistemology</em>, Boston: De Gruyter,\npp. 133–228. ",
                "–––, 2019, “Basic Action and Practical\nKnowledge”, <em>Philosophers’ Imprint</em>, 19 (19). \n[<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.019\" target=\"other\">Small 2019 available online</a>]",
                "Smith, Michael, 2012, “Four Objections to the Standard Story\nof Action (and Four Replies)”, <em>Philosophical Issues</em>\n(<em>Noûs</em> Supplement), 22: 387–401.",
                "–––, 2013, “A Constitutivist Theory of\nReasons: Its Promise and Parts”, <em>Law Ethics Philosophy</em>,\n1: 9–30.",
                "–––, 2015, “The Magic of\nConstitutivism”, <em>American Philosophical Quarterly</em>, 52\n(2): 187–200. ",
                "–––, 2019, “Constitutivism”, in\nTristram McPherson and David Plunkett (eds.), <em>The Routledge\nHandbook of Metaethics</em>, London: Routledge,\npp. 371–384. ",
                "Sneddon, Andrew, 2001, “Does Philosophy of Action Rest on a\nMistake?”, <em>Metaphilosophy</em>, 32 (5): 502–522. ",
                "Stathopoulos, Alexander, 2016, “Knowing Achievements”,\n<em>Philosophy</em> , 91 (03): 361–374.",
                "Steward, Helen, 2009, “Animal Agency”, <em>Inquiry: An\nInterdisciplinary Journal of Philosophy</em>, 52 (3):\n217–231.",
                "–––, 2012a, <em>A Metaphysics for Freedom</em>,\nOxford: Oxford University Press. ",
                "–––, 2012b, “Actions as Processes”,\n<em>Philosophical Perspectives</em> (<em>Noûs</em> Supplement),\n26 (1): 373–388. ",
                "–––, 2020, “Agency as a Two-Way Power: A\nDefence”, <em>The Monist</em>, 103 (3): 342–355. ",
                "Stoecker, Ralf, 2009, “Why Animals Can’t Act”,\n<em>Inquiry: An Interdisciplinary Journal of Philosophy</em>, 52 (3):\n255–271. ",
                "Stoop, Annette, 1962, “Review: <em>Free Action</em>, by A. I.\nMelden”, <em>Australasian Journal of Philososphy</em>, 40 (2):\n247–249. ",
                "Stout, Rowland, 1997, “Processes”,\n<em>Philosophy</em>, 72 (279): 19–27. ",
                "Strawson, Peter F., 1985, “Causation and Explanation”,\nin Bruce Vermazen and Merrill B. Hintikka (eds.), <em>Essays on\nDavidson: Actions and Events</em>, Oxford: Oxford University Press,\npp. 115–135. ",
                "Swanson, Eric, 2012, “The Language of Causation”, in\nGillian Russell and Delia Graff Fara (eds.), <em>The Routledge\nCompanion to Philosophy of Language</em>, New York and London:\nRoutledge, pp. 716–728. ",
                "Tenenbaum, Sergio, 2007, <em>Appearances of the Good: An Essay on\nthe Nature of Practical Reason</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2011, “Review: Self-Constitution:\nAgency, Identity, and Integrity by Korsgaard, Christine M”,\n<em>Ethics</em>, 121 (2): 449–455. ",
                "–––, 2012, “Knowing the Good and Knowing\nWhat One is Doing”, <em>Canadian Journal of Philosophy</em>\n(Supplementary Volume) 39: 91–117.",
                "–––, 2018a, “Reconsidering\nIntentions”, <em>Noûs</em>, 52 (2): 443–472.",
                "–––, 2018b, “The Guise of the Guise of the\nBad”, <em>Ethical Theory and Moral Practice</em>, 21 (1):\n5–20.",
                "–––, 2020, <em>Rational Powers in Action:\nInstrumental Rationality and Extended Agency</em>, Oxford: Oxford\nUniversity Press.",
                "Thompson, Michael, 2008, <em>Life and action</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 2011, “Anscombe’s Intention and\nPractical Knowledge”, in Anton Ford, Jennifer Hornsby and\nFrederick Stoutland (eds.), <em>Essays on Anscombe’s\nIntention</em>, Cambridge, MA: Harvard University Press, pp.\n198–210.",
                "–––, 2013, “Forms of nature”, in G.\nHindrichs and Axel H. (eds.), <em>Freiheit. Stuttgarter\nHegel-Kongres</em>, Frankfurt am Main: Vittorio Klostermann:\n701–735. ",
                "Thomson, Judith Jarvis, 1971, “The Time of a Killing”,\n<em>The Journal of Philosophy</em>, 68 (5): 115–132. ",
                "Unger, Peter, 1975, <em>Ignorance: A Case for Scepticism</em>, New\nYork: Oxford University Press.",
                "Valaris, Markos, 2015, “The Instrumental Structure of\nActions”, <em>Philosophical Quarterly</em>, 65 (258):\n64–83.",
                "–––, 2020, “Thinking by doing: Rylean\nRegress and the Metaphysics of Action”, <em>Inquiry</em>, 197:\n3395–3412 ",
                "–––, 2021, “Knowledge Out of\nControl”, <em>The Philosophical Quarterly</em>, 72 (3):\n733–753. ",
                "Vekony, Romy, Alfred Mele and David Rose, 2021, “Intentional\nAction Without Knowledge”, <em>Synthese</em>, 199 (1):\n1231–1243. ",
                "Velleman, J. David, 1989, <em>Practical Reflection</em>,\nPrinceton: Princeton University Press. ",
                "–––, 1992a, “The Guise of the Good”,\n<em>Noûs</em>, 26 (1): 3–26. ",
                "–––, 1992b, “What Happens when Someone\nActs”, <em>Mind</em>, 101 (403): 461–481.",
                "–––, 1996, “The Possibility of Practical\nReason”, <em>Ethics</em>, 106 (4): 694–726.",
                "–––, 1997, “Deciding How to Decide”,\nin Garrett Cullity and Berys Gaut (eds.), <em>Ethics and Practical\nReason</em>, Oxford: Clarendon Press, pp. 29–52.",
                "–––, 2000a, “From Self Psychology to Moral\nPhilosophy”, <em>Philosophical Perspectives</em>\n(<em>Noûs</em> Supplement), 14: 349–377.",
                "–––, 2000b, <em>The Possibility of Practical\nReason</em>, Oxford: Oxford University Press.",
                "–––, 2009, <em>How We Get Along</em>, New York:\nCambridge University Press. ",
                "–––, 2014, “A Note on Practical\nKnowledge”, in J. David Velleman, <em>The Possibility of\nPractical Reason</em>, second edition, Ann Arbor: Michigan Publishing,\nUniversity of Michigan Library. doi:10.3998/maize.13240734.0001.001",
                "Vermazen, Bruce, 1985, “Negative Acts”, in Bruce\nVermazen and Merrill B. Hintikka (eds.), <em>Essays on Davidson:\nActions and Events</em>, Oxford: Oxford University Press, pp.\n93–104.",
                "Vogler, Candace A., 2001, “Anscombe on Practical\nInference”, in Elijah Millgram (ed.), <em>Varieties of Practical\nReasoning</em>, Cambridge, MA: MIT Press, pp. 437–464.",
                "de Waal, Frans B. M., 2016, “Apes Know What Others\nBelieve”, <em>Science</em>, 354 (6308): 39–40.",
                "Wegner, Daniel M., 2002, <em>The Illusion of Conscious Will</em>,\nCambridge, MA: MIT Press.",
                "Wiland, Eric, 2013, “In the beginning was the doing: the\npremises of the practical syllogism”, <em>Canadian Journal of\nPhilosophy</em>, 43 (3): 303–321",
                "Williams, Bernard (ed.), 1981, “Moral Luck”, in\n<em>Moral Luck: Philosophical Papers 1973–1980</em>, Cambridge:\nCambridge University Press, pp. 20–39.",
                "Williamson, Timothy, 2000, <em>Knowledge and its Limits</em>,\nOxford and New York: Oxford University Press. ",
                "Wilson, George M., 1980, <em>The Intentionality of Human\nAction</em>, Stanford, CA: Stanford University Press.",
                "–––, 2000, “Proximal Practical\nForesight”, <em>Philosophical Studies</em>, 99: 3–19.",
                "Wittgenstein, Ludwig, 1953 [2010], <em>Philosophical\nInvestigations</em>, P. M. S. Hacker and Joachim Schulte (eds.),\nG.E.M. Anscombe, P.M.S.  Hacker and Joachim Schulte (trans.),\nChichester, West Sussex: Wiley-Blackwell.",
                "Wolfson, Ben, 2012, “Agential Knowledge, Action and\nProcess”, <em>Theoria</em>, 78 (4): 326–357.",
                "Wu, Wayne, 2016, “Experts and Deviants: The Story of\nAgentive Control”, <em>Philosophy and Phenomenological\nResearch</em>, 93 (1): 101–126.",
                "Yaffe, Gideon, 2010, <em>Attempts: In the Philosophy of Action and\nthe Criminal Law</em>, Oxford and New York: Oxford University\nPress.",
                "Wong, David, 2020, “Comparative Philosophy: Chinese and\nWestern”, <em>The Stanford Encyclopedia of Philosophy</em> (Fall\n2020 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2020/entries/comparphil-chiwes/\">https://plato.stanford.edu/archives/fall2020/entries/comparphil-chiwes/</a>&gt;.",
                "Wong, H.Y., 2018, “Embodied agency”, <em>Philosophy\nand Phenomenological Research</em>, 97(3): 584–612."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Achinstein, Peter, 1975, “Causation, Transparency, and\nEmphasis”, <em>Canadian Journal of Philosophy</em>, 5 (1):\n1–23. </li>\n<li>Alvarez, Maria, 2013, “Agency and Two-Way Powers”,\n<em>Proceedings of the Aristotelian Society</em>, 113: 101–121. </li>\n<li>–––, 2017, “Reasons for Action:\nJustification, Motivation, Explanation”, <em>The Stanford Encyclopedia of Philosophy</em> (Winter 2017 Edition), Edward\nN. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/reasons-just-vs-expl/\">https://plato.stanford.edu/archives/win2017/entries/reasons-just-vs-expl/</a>&gt;.</li>\n<li>Alvarez, Maria, and John Hyman, 1998, “Agents and their\nActions”, <em>Philosophy</em>, 73 (2): 219–245. </li>\n<li>Annas, Julia, 1978, “How Basic Are Basic Actions?”,\n<em>Proceedings of the Aristotelian Society</em>, 78: 195–213.</li>\n<li>Anscombe, G. E. M., 1957, <em>Intention</em>, Oxford: Basil\nBlackwell, 1957; 2nd edition, 1963; reprinted, Cambridge, MA: Harvard\nUniversity Press, 2000..</li>\n<li>–––, 1969, “Causality and\nExtensionality”, <em>The Journal of Philosophy</em>, 66 (6):\n152–159.</li>\n<li>–––, 1979, “Under a\nDescription”, <em>Noûs</em>, 13 (2): 219–233.</li>\n<li>–––, 1995, “Practical\nInference”, in Rosalind Hursthouse, Gavin Lawrence and Warren\nQuinn (eds.), <em>Virtues and Reasons: Philippa Foot and Moral\nTheory</em>, Oxford: Clarendon Press, pp. 1–34. </li>\n<li>Aquinas, T., <em>Summa Theologica</em>, 1272, literally translated\nby Fathers of the English Dominican Province, London: Burn, Oates\n&amp; Washbourne, 1920.\n[<a href=\"https://www.ccel.org/a/aquinas/summa/home.html\" target=\"other\">Aquinas 1272 available online</a>.]</li>\n<li>Arendt, Hannah, 1998, <em>The Human Condition</em>, 2nd\nEdition, Chicago and London: University of Chicago Press. </li>\n<li>Aristotle, <em>De Anima</em> [<em>DA</em>], in <em>The Complete\nWorks of Aristotle</em>, Jonathan Barnes (ed.), Princeton: Princeton\nUniversity Press, 1995.</li>\n<li>–––, <em>De Motu Animalium</em> [<em>DMA</em>],\nin <em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.</li>\n<li>–––, <em>Eudemian Ethics</em> [<em>EE</em>], in\n<em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.</li>\n<li>–––, <em>Nicomachean Ethics</em> [<em>NE</em>],\nin <em>The Complete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995.</li>\n<li>–––, <em>Physics</em> [<em>Phys.</em>], in <em>The\nComplete Works of Aristotle</em>, Jonathan Barnes (ed.), Princeton:\nPrinceton University Press, 1995. </li>\n<li>Arruda, Caroline T., and Daniel J. Povinelli, 2016, “Chimps\nas Secret Agents”, <em>Synthese</em>, 193 (7): 2129–2158.</li>\n<li>Bach, Kent, 2010, “Refraining, Omitting, and Negative\nActs”, in Timothy O’Connor and Constantine Sandis (eds.),\n<em>A Companion to the Philosophy of Action</em>, Chichester, West\nSussex: Wiley-Blackwell, pp. 50–57. </li>\n<li>Bagnoli, Carla, 2017, “Constructivism in Metaethics”,\n<em>Stanford Encyclopedia of Philosophy</em> (Winter 2017 Edition),\nEdward N. Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/constructivism-metaethics/\">https://plato.stanford.edu/archives/win2017/entries/constructivism-metaethics/</a>&gt;.</li>\n<li>–––, 2022, <em>Ethical Constructivism</em>,\nCambridge: Cambridge University Press.</li>\n<li>Baier, Annette, 1970, “Act and Intent,” <em>Journal of\nPhilosophy</em>, 67: 648–658. </li>\n<li>–––, 1971, “The Search for Basic\nActions”, <em>American Philosophical Quarterly</em>, 8 (2):\n161–170. </li>\n<li>Beddor, Bob, and Carlotta Pavese, 2021, “Practical Knowledge\nwithout Luminosity”, <em>Mind</em>, 131 (523): 917–934.\ndoi:10.1093/mind/fzab041</li>\n<li>Bilgrami, Akeel, 2012, <em>Self-Knowledge and Resentment</em>,\nCambridge, MA: Harvard University Press. </li>\n<li>Bishop, John, 1989, <em>Natural Agency: An Essay on the Causal\nTheory of Action</em>, New York: Cambridge University Press. </li>\n<li>Boyle, Matthew, 2016, “Additive Theories of Rationality: A\ncritique”, <em>European Journal for Philosophy of Science</em>,\n24 (3): 527–555. </li>\n<li>–––, 2022, “Skepticism about\nSelf-Understanding”, in Lisa Miracchi and Michael Brent (eds.),\n<em>Mental Action and the Conscious Mind</em>, New York: Routledge,\npp. 182–204. </li>\n<li>Boyle, Matthew, and Douglas Lavin, 2010, “Goodness and\nDesire”, in Sergio Tenenbaum (ed.), <em>Desire, Practical\nReason, and the Good</em>, New York: Oxford University Press, pp.\n158–199. </li>\n<li>Brand, Myles, 1984, “Intending and Acting”,\n<em>Mind</em>, 96 (381): 121–124. </li>\n<li>Brass, Marcel, Ariel Furstenberg and Alfred R. Mele, 2019,\n“Why Neuroscience Does Not Disprove Free Will”,\n<em>Neuroscience and Biobehavioral Reviews</em>, 102:\n251–263.</li>\n<li>Bratman, Michael, 1987, <em>Intention, Plans, and Practical\nreason</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 1991, “Cognitivism About Practical\nReason”, <em>Ethics</em>, 102 (1): 117–128.</li>\n<li>–––, 1999a, <em>Faces of Intention: Selected\nEssays on Intention and Agency</em>, Cambridge: Cambridge University\nPress. </li>\n<li>–––, 1999b, “Toxin, Temptation, and the\nStability of Intention”, in Michael Bratman (ed.), <em>Faces of\nIntention</em>, Cambridge: Cambridge University Press, pp.\n58–91.</li>\n<li>–––, 2007, <em>Structures of Agency</em>, Oxford\nand New York: Oxford University Press.</li>\n<li>–––, 2018, <em>Planning, Time, and\nSelf-Governance: Essays in Practical Rationality</em>, New York:\nOxford University Press. </li>\n<li>Camp, Elisabeth, and Eli Shupe, 2017, “Instrumental\nReasoning in Nonhuman Animals”, in Kristin Andrews and Jake Beck\n(eds.), <em>The Routledge Handbook of Philosophy of Animal Minds</em>,\nLondon: Routledge, pp. 100–118.</li>\n<li>Campbell, Lucy, 2018, “An Epistemology for Practical\nKnowledge”, <em>Canadian Journal of Philosophy</em>, 48 (2):\n159–177. </li>\n<li>Carruthers, Peter, 2011, <em>The Opacity of Mind: An Integrative\nTheory of Self-Knowledge</em>, Oxford: Oxford University Press.</li>\n<li>Castañeda, Hector-Neri, 1975, <em>Thinking and Doing: The\nPhilosophical Foundations of Institutions</em>, Dordrecht: D. Reidel.</li>\n<li>Charles, David, 1984, <em>Aristotle’s Philosophy of\nAction</em>, Ithaca: Cornell University Press. </li>\n<li>–––, 2015, “Aristotle’s\nProcesses”, in Mariska Leunissen (ed.), <em>Aristotle’s\nPhysics: A Critical Guide</em>, Cambridge: Cambridge University Press,\npp. 186–205. </li>\n<li>–––, 2018, “Processes, Activities and\nActions”, in Rowland Stout (ed.), <em>Process, Action, and\nExperience</em>, Oxford: Oxford University Press, pp.\n185–209.</li>\n<li>Chisholm, Roderick, 1964, “Human Freedom and the\nSelf”, <em>The Lindley Lecture</em>, Lawrence, KS: University of\nKansas.</li>\n<li>–––, 1970, “The Structure of\nIntention”, <em>Journal of Philosophy</em>, 67 (19):\n633–647.</li>\n<li>Clark, Philip, 2010, “Aspects, Guises, Species, and Knowing\nSomething to Be Good”, in Sergio Tenenbaum (ed.), <em>Desire,\nPractical Reason, and the Good</em>, New York: Oxford University\nPress, pp. 234–244. </li>\n<li>–––, 2020, “Intentions, Intending, and\nBelief: Noninferential Weak Cognitivism”, <em>Pacific\nPhilosophical Quarterly</em>, 101 (2): 308–327. </li>\n<li>Clarke, Randolph, 2010, “Intentional Omissions”,\n<em>Noûs</em>, 44 (1): 158–177.</li>\n<li>–––, 2014, <em>Omissions: Agency, Metaphysics,\nand Responsibility</em>, New York: Oxford University Press.</li>\n<li>Cleveland, Timothy, 1997, <em>Trying Without Willing</em>,\nAldershot: Ashgate Publishing. </li>\n<li>Crowther, Thomas, 2018, “Processes as Continuants and\nProcesses as Stuff”, in Rowland Stout (ed.), <em>Process,\nAction, and Experience</em>, Oxford: Oxford University Press, pp.\n58–81. </li>\n<li>Crowther, Thomas, 2011, “The Matter of Events”,\n<em>The Review of Metaphysics</em>, 65 (1): 3–39. </li>\n<li>Cussins, Adrian, 1992, “Content, Embodiment and Objectivity:\nThe Theory of Cognitive Trails”, <em>Mind</em>, 101 (404):\n651–688.</li>\n<li>Dancy, Jonathan, 2000, <em>Practical Reality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Danto, Arthur C., 1979, “Basic Actions and Basic\nConcepts”, <em>The Review of Metaphysics</em>, 32 (3):\n471–485.</li>\n<li>Davidson, Donald, 1963, “Actions, Reasons and Causes”,\n<em>Journal of Philosophy</em>, 60: 685–700; reprinted in\nDavidson 2001a.</li>\n<li>–––, 1967a, ‘Causal Relations’,\n<em>Journal of Philosophy</em>, 64: 691–703; reprinted in\nDavidson 2001a.</li>\n<li>–––, 1967b, ‘The Logical Form of Action\nSentences’, in Nicholas Rescher (ed.), <em>The Logic of Decision\nand Action</em>, Pittsburgh: University of Pittsburgh Press, reprinted\nin Davidson, 2001a.</li>\n<li>–––, 1970a, ‘How is Weakness of the Will\nPossible?’, in Joel Feinberg (ed.), <em>Moral Concepts</em>,\nOxford: Oxford University Press; reprinted in Davidson 2001a.</li>\n<li>Davidson, Donald, 1970b, “Intending”, in Yirmiahu\nYovel (ed.), P<em>hilosophy of History and Action</em>, Dordrecht: D.\nReidel; reprinted in Davidson 2001a.</li>\n<li>–––, 1971, “Agency”, in Robert\nBinkley, Richard Bronaugh, and Ausonia Marras (eds.), <em>Agent,\nAction, and Reason</em>, Toronto: University of Toronto Press;\nreprinted in Davidson 2001a.</li>\n<li>–––, 1973, “ Freedom to Act”, in Ted\nHonderich (ed.), <em>Essays on Freedom of Action</em>. New York:\nRoutledge &amp; Kegan Paul.</li>\n<li>–––, 1975, “Thought and Talk”, in S.\nGuttenplan (ed.), <em>Mind and Language</em>, Oxford: Oxford\nUniversity Press; reprinted in Davidson 2001b.</li>\n<li>–––, 1982, “Rational Animals”,\n<em>Dialectica</em>, 36 (4): 317–328. </li>\n<li>–––, 1985, “Reply to Quine on\nEvents”, in Ernest LePore and Brian McLaughlin (eds.),\n<em>Actions and Events: Perspectives on the Philosophy of Donald\nDavidson</em>, Oxford: Basil Blackwell, reprinted in Davidson 2001a.</li>\n<li>–––, 2001a, <em>Essays on Actions and Events:\nPhilosophical Essays Volume 1</em>, Oxford: Clarendon Press, 2nd\nedition.</li>\n<li>–––, 2001b, <em>Inquiries into Truth and\nInterpretation</em> (Philosophical Essays: Volume 2), Oxford:\nClarendon Press. </li>\n<li>Della Rocca, Michael, 2020, <em>The Parmenidean Ascent</em>.\nOxford: Oxford University Press.</li>\n<li>DeRose, Keith, 2002, “Assertion, Knowledge, and\nContext”, <em>The Philosophical Review</em>, 111 (2):\n167–203. </li>\n<li>Descartes, René, 1641, <em>Meditations on First\nPhilosophy</em>, Leiden; translated in <em>Philosophical Works of\nDescartes</em> (Volume 1), Elizabeth S. Haldane and G.R.T. Ross\n(eds./trans.), New York: Dover Publications, 1931. </li>\n<li>Dretske, Fred I., 1999, “Machines, Plants and Animals: The\nOrigins of Agency”, <em>Erkenntnis. An International Journal of\nAnalytic Philosophy</em>, 51 (1): 19–31.</li>\n<li>Dreyfus, S.E. and Dreyfus, H.L., 1980, “A five-stage model\nof the mental activities involved in directed skill\nacquisition.” University of California/Berkeley Operations\nResearch Center.\n [<a href=\"https://apps.dtic.mil/sti/pdfs/ADA084551.pdf\" target=\"other\">Dreyfus &amp; Dreyfus 1980 available online</a>]</li>\n<li>Ducasse, C. J., 1925, “Explanation, Mechanism, and\nTeleology”, <em>The Journal of Philosophy</em>, 22 (6):\n150–155.</li>\n<li>Dunn, Robert, 1998, “Knowing What I’m About to Do\nWithout Evidence”, <em>International Journal of Philosophical\nStudies</em>, 6 (2): 231–252. </li>\n<li>Enoch, David, 2006, “Agency, Shmagency: Why Normativity\nWon’t Come From What Is Constitutive of Action”, <em>The\nPhilosophical Review</em>, 115 (2): 169–198. </li>\n<li>–––, 2011, “Shmagency Revisited”, in\nMichael S. Brady (ed.), <em>New Waves in Metaethics</em>, Hampshire:\nPalgrave Macmillan, pp. 208–234. </li>\n<li>Falvey, Kevin, 2000, “Knowledge in Intention”,\n<em>Philosophical Studies</em>, 99 (1): 21–44. </li>\n<li>Feinberg, Joel, 1964, “Action and Responsibility”, in\nMax Black (ed.), <em>Philosophy in America</em>, New York: George\nAllen &amp; Unwin Ltd, pp. 134–160. </li>\n<li>Ferrero, Luca, 2010, “Decisions, Diachronic Autonomy, and\nthe Division of Deliberative Labor”, <em>Philosophers’\nImprint</em>, 10 (2): 1–23. </li>\n<li>–––, 2017, “Intending, Acting, and\nDoing”, <em>Philosophical Explorations: An International Journal\nfor the Philosophy of Mind and Action</em>, 20 (sup2): 13–39.</li>\n<li>Fleming, Brice Noel, 1964, “On Intention”, <em>The\nPhilosophical Review</em>, 73 (3): 301–320. </li>\n<li>Ford, Anton, 2011, “Action and Generality”, in Anton\nFord, Jennifer Hornsby and Frederick Stoutland (eds.), <em>Essays on\nAnscombe’s Intention</em>, Cambridge, MA: Harvard University\nPress, pp. 76–104. </li>\n<li>–––, 2015, “The Arithmetic of\nIntention”, <em>American Philosophical Quarterly</em>, 52 (2):\n129–143.</li>\n<li>–––, 2017, “The Representation of\nAction”, <em>Royal Institute of Philosophy Supplement</em>, 80:\n217–233.</li>\n<li>–––, 2018, “The Progress of the\nDeed”, in Rowland Stout (ed.), <em>Process, Action, and\nExperience</em>, Oxford: Oxford University Press.</li>\n<li>Frankfurt, Harry, 1971, “Freedom of the Will and the Concept\nof a Person”, <em>The Journal of Philosophy</em>, 68 (1):\n5–20. </li>\n<li>–––, 1978, “The Problem of Action”,\n<em>American Philosophical Quarterly</em>, 15 (2): 157–162.</li>\n<li>–––, 1987, “Identification and\nWholeheartedness”, in Ferdinand Schoeman (ed.),\n<em>Responsibility, Character, and the Emotions: New Essays in Moral\nPsychology</em>, New York: Cambridge University Press, pp.\n27–45.</li>\n<li>–––, 1992, “The Faintest Passion”,\n<em>Proceedings and Addresses of the American Philosophical\nAssociation</em>, 66 (3): 5–16. </li>\n<li>Frey, Jennifer A., 2019a, “Anscombe on Practical Knowledge\nand the Good”, <em>Ergo: An Open Access Journal of\nPhilosophy</em>, 6 (39): 1121–1151.</li>\n<li>–––, 2019b, “Happiness as the Constitutive\nPrinciple of Action in Thomas Aquinas”, <em>Philosophical\nExplorations: An International Journal for the Philosophy of Mind and\nAction</em>, 22 (2): 208–221.</li>\n<li>Fridland, Ellen, 2013, “Skill Learning and Conceptual\nThought”, in Bana Bashour Hans Muller (ed.), <em>Contemporary\nPhilosophical Naturalism and Its Implications</em>, New York:\nRoutledge, pp. 13–77.</li>\n<li>Fritts, Megan, 2021, “Reasons Explanations (of Actions) as\nStructural Explanations.” <em>Synthese</em>, 199 (5):\n12683–12704.</li>\n<li>Frost, Kim, 2019, “The Antinomy of Basic Action”, in\nRoman Altshuler and Michael J. Sigrist (eds.), <em>Time and the\nPhilosophy of Action</em>, New York: Routledge, pp. 37–51.</li>\n<li>Galton, Antony, 2006, “The Ontology of Processes and\nEvents”, in Brandon Bennett and Christiane Fellbaum (eds.),\n<em>Formal Ontology in Information Systems: Proceedings of the Fourth\nInternational Conference</em>, Amsterdam: IOS Press, pp.\n4–11.</li>\n<li>Gibbons, John, 2010, “Seeing What You ‘re\nDoing’”, in T. Szabo Gendler and J. Hawthorne (eds.),\n<em>Oxford Studies in Epistemology</em>, Oxford: Oxford University\nPress.</li>\n<li>Ginet, Carl, 1990, <em>On Action</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Glock, Hans-Johann, 2009, “Can Animals Act For\nReasons?”, <em>Inquiry: A Journal of Medical Care Organization,\nProvision and Financing</em>, 52 (3): 232–254.</li>\n<li>Godfrey-Smith, Peter, 2003, “Folk Psychology Under Stress:\nComments on Susan Hurley’s ‘Animal Action in the Space of\nReasons”, <em>Mind &amp; Language</em>, 18 (3): 266–72.</li>\n<li>Goldman, A. I., 1970, <em>A Theory of Human Action</em>,\nPrinceton: Princeton University Press.</li>\n<li>Gopnik, Alison, 1993, “How We Know Our Own Minds: The\nillusion of first-person knowledge of intentionality”,\n<em>Behavioral and Brain Sciences</em>, 16: 1–14. </li>\n<li>Grice, H. P., 1971, “Intention and Uncertainty”,\n<em>Proceedings of the British Academy</em>, 57: 263–279.</li>\n<li>Grünbaum, Thor, 2008, “The Body in Action”,\n<em>Phenomenology and the Cognitive Sciences</em>, 7: 243–61.</li>\n<li>–––, 2011, “Perception and Non-Inferential\nKnowledge of Action”, <em>Philosophical Explorations</em>, 14\n(2): 153–67.</li>\n<li>–––, 2013, “Seeing What I am Doing”,\n<em>Philosophy and Phenomenological Research</em>, 86 (2): 295–318.</li>\n<li>Gustafsson, Martin, 2016, “Anscombe’s Bird,\nWittgenstein’s Cat: Intention, Expression, and\nConvention”, <em>Philosophical Topics</em>, 44 (1):\n207–237.</li>\n<li>Haase, Matthias, 2018, “Knowing What I Have Done”,\n<em>Manuscrito</em>, 41 (4): 195–253. </li>\n<li>–––, 2022, “Agency, events, and\nprocesses”, in Luca Ferrero (ed.), <em>The Routledge Handbook of\nPhilosophy of Agency</em>, London: Routledge, pp. 47–58.</li>\n<li>Haddock, Adrian, 2011, “The Knowledge That a Man Has of His\nIntentional Actions”, in Anton Ford, Jennifer Hornsby and\nFrederick Stoutland (eds.), <em>Essays on Anscombe’s\nIntention</em>, Cambridge, MA: Harvard University Press, pp.\n147–169.</li>\n<li>Hansen, Chad, 2020, “Daoism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2020 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/spr2020/entries/daoism/\">https://plato.stanford.edu/archives/spr2020/entries/daoism/</a>&gt;.</li>\n<li>Harman, Gilbert, 1986, “Willing and Intending”, in R.\nE. Grandy and Warner (ed.), <em>Philosophical Grounds of\nRationality</em>, Oxford: Oxford University Press, pp. 363–380.</li>\n<li>–––, 1997, “Practical reasoning”,\n<em>The Review of Metaphysics</em>, 29 (3): 431–463. </li>\n<li>Hawthorne, John, 2004, <em>Knowledge and Lotteries</em>, Oxford:\nClarendon Press. </li>\n<li>Heyes, Cecilia, and Anthony Dickinson, 1990, “The\nIntentionality of Animal Action”, <em>Mind &amp; Language</em>,\n5 (1): 87–103. </li>\n<li>Hieronymi, Pamela, 2006, “Controlling Attitudes”,\n<em>Pacific Philosophical Quarterly</em>, 87 (1): 45–74. </li>\n<li>–––, 2005, “The Wrong Kind of\nReason”, <em>The Journal of Philosophy</em>, 102 (9):\n437–457. </li>\n<li>Higginbotham, James, 1983, “The Logic of Perceptual Reports:\nAn Extensional Alternative to Situation Semantics”, <em>The\nJournal of Philosophy</em>, 80 (2): 100–127. </li>\n<li>Hobbes, Thomas, 1651/1668, <em>Leviathan: With Selected Variants\nfrom the Latin Edition of 1668</em>, Edwin Curley (ed.), Indianapolis:\nHackett Publishing, 1994. </li>\n<li>Holton, Richard, 1999, “Intention and Weakness of\nWill”, <em>The Journal of Philosophy</em>, 96 (5):\n241–262. </li>\n<li>–––, 2004, “Rational Resolve”,\n<em>The Philosophical Review</em>, 113 (4): 507–535. </li>\n<li>–––, 2009, <em>Willing, Wanting, Waiting</em>,\nOxford and New York: Clarendon Press. </li>\n<li>Hornsby, Jennifer, 1980, <em>Actions</em>, London: Routledge and\nKegan Paul.</li>\n<li>–––, 2004, “Agency and Actions”,\n<em>Royal Institute of Philosophy Supplements</em>, 55: 1–23.</li>\n<li>–––, 2012, “Actions and Activity”,\n<em>Philosophical Issues</em> (<em>Noûs</em> Supplement), 22:\n233–245. </li>\n<li>–––, 2013, “Basic Activity”,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 87 (1): 1–18.</li>\n<li>–––, 2016, “Intending, knowing how,\ninfinitives”, <em>Canadian Journal of Philosophy</em> 46 (1):\n1–17. </li>\n<li>Horschler, Daniel J., Evan L. MacLean and Laurie R. Santos, 2020,\n“Do Non-Human Primates Really Represent Others’\nBeliefs?”, <em>Trends in Cognitive Sciences</em>, 24 (8):\n594–605. </li>\n<li>Horst, David, 2015, “Actions and Accidents”,\n<em>Canadian Journal of Philosophy</em>, 45 (3): 300–325.</li>\n<li>Houlgate, Laurence D., 1966, “Mistake in performance”,\n<em>Mind</em>, 75 (298): 257–261. </li>\n<li>Hume, David, 1739–40, <em>A Treatise of Human Nature</em>, David\nFate Norton and Mary J. Norton (eds.), Oxford: Oxford University\nPress, 2000. </li>\n<li>–––, 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London; included in <em>Enquiries concerning Human\nUnderstanding and Concerning the Principles of Morals</em>, L. A.\nSelby-Bigge and P. H. Niddith (eds.), third edition, Oxford: Clarendon\nPress, 1975.</li>\n<li>Hurley, Susan, 2003, “Animal Action in the Space of\nReasons”, <em>Mind and Language</em>, 18 (3):\n231–256.</li>\n<li>Hyman, John, 1999, “How Knowledge Works”, <em>The\nPhilosophical Quarterly</em>, 49 (197): 433–451. </li>\n<li>–––, 2015, <em>Action, Knowledge, and Will</em>,\nOxford: Oxford University Press.</li>\n<li>Ivanhoe, P.J., 1993, “Zhuangzi on skepticism, skill, and the\nineffable Dao”, <em>Journal of the American Academy of\nReligion</em>, 61 (4): 639–654.</li>\n<li>Kasulis, Thomas, 2019, “Japanese Philosophy”, <em>The\nStanford Encyclopedia of Philosophy</em> (Summer 2019 Edition), Edward\nN. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2019/entries/japanese-philosophy/\">https://plato.stanford.edu/archives/sum2019/entries/japanese-philosophy/</a>&gt;.</li>\n<li>Katsafanas, Paul, 2013, <em>Agency and the Foundation of Ethics:\nNietzschean Constitutivism</em>, Oxford: Oxford University Press.</li>\n<li>Katz, Bernard D., 1978, “Kim on Events”, <em>The\nPhilosophical Review</em>, 87 (3): 427–441. </li>\n<li>Kaufmann, Angelica, 2015, “Animal Mental Action: Planning\nAmong Chimpanzees”, <em>Review of Philosophy and\nPsychology</em>, 6 (4): 745–760. </li>\n<li>Kim, Jaegwon, 1966, “On the Psycho-Physical Identity\nTheory”, <em>American Philosophical Quarterly</em>, 3 (3):\n227–235.</li>\n<li>–––, 1969, “Events and Their Descriptions:\nSome Considerations”, in Nicholas Rescher (ed.), <em>Essays in\nHonor of Carl G. Hempel</em>, Dordrecht: D. Reidel, pp.\n198–215.</li>\n<li>–––, 1973, “Causation, Nomic Subsumption,\nand the Concept of Event”, <em>The Journal of Philosophy</em>,\n70 (8): 217–236.</li>\n<li>–––, “Events as Property\nExemplifications”, in M. Brand and D. Walton (eds.), <em>Action\nTheory</em>, Dordrecht: D. Reidel, pp. 310–326.</li>\n<li>Kirley, Michael (forthcoming), “Intentional Action,\nKnow-how, and Lucky Success”, <em>Ergo: An Open Access Journal\nof Philosophy</em>.</li>\n<li>Korsgaard, Christine M., 1996, <em>Sources of Normativity</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2008, <em>The Constitution of Agency:\nEssays on Practical Reason and Moral Psychology</em>, Oxford and New\nYork: Oxford University Press.</li>\n<li>–––, 2009, <em>Self-Constitution: Agency,\nIdentity, and Integrity</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2018, <em>Fellow Creatures: Our Obligations\nto the Other Animals</em>, Oxford: Oxford University Press.</li>\n<li>Kratzer, Angelika, 2021, “Situations in Natural Language\nSemantics”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2021 Edition),\nEdward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2021/entries/situations-semantics/\">https://plato.stanford.edu/archives/win2021/entries/situations-semantics/</a>&gt;.</li>\n<li>Krupenye, Christopher, Fumihiro Kano, Satoshi Hirata, Josep Call\nand Michael Tomasello, 2016, “Great Apes Anticipate That Other\nIndividuals Will Act According to False Beliefs”,\n<em>Science</em>, 354 (6308): 110–114.</li>\n<li>Langton, Rae, 2004, “Intention as Faith”, <em>Royal\nInstitute of Philosophy Supplement</em>, 55: 243–258.</li>\n<li>Lavin, Douglas, 2013a, “Must There Be Basic Action?”,\n<em>Noûs</em>, 47 (2): 273–301. </li>\n<li>–––, 2013b, “Über das Problem des\nHandelns”, <em>Deutsche Zeitschrift Fur Philosophie</em>, 61\n(3): 357–372.</li>\n<li>–––, 2015, “Action as a Form of Temporal\nUnity: On Anscombe’s Intention”, <em>Canadian Journal of\nPhilosophy</em>, 45 (5–6): 609–629.</li>\n<li>Lemmon, E. J., 1967, “Comments on D Davison ”The\nLogical Form of Action Sentences“”, in Nicholas Rescher\n(ed.), <em>The Logic of Decision and Action</em>, Pittsburgh:\nUniversity of Pittsburgh Press. </li>\n<li>Levy, Neil, 2005, “Libet’s Impossible Demand”,\n<em>Journal of Consciousness Studies</em>, 12 (12): 67–76. </li>\n<li>Levy, Yair, 2013, “Intentional Action First”,\n<em>Australasian Journal of Philosophy</em>, 91 (4):\n705–718.</li>\n<li>–––, 2018, “Why Cognitivism?”,\n<em>Canadian Journal of Philosophy</em>, 48 (2): 223–244.</li>\n<li>–––, 2022, “Neo-Ryleanism about\nSelf-understanding”, <em>Inquiry</em>, first online 08 February 2022.\ndoi:10.1080/0020174X.2022.2036230</li>\n<li>Libet, Benjamin, 1985, “Unconscious Cerebral Initiative and\nthe Role of Conscious Will in Voluntary Action”, <em>The\nBehavioral and Brain Sciences</em>, 8 (4): 529–539. </li>\n<li>Libet, Benjamin, Curtis A. Gleason, Elwood W. Wright and Dennis K.\nPearl, 1993, “Time of Conscious Intention to Act in Relation to\nOnset of Cerebral Activity (Readiness-Potential)”, in Benjamin\nLibet (ed.), <em>Neurophysiology of Consciousness</em>, Boston, MA:\nBirkhäuser Boston, pp. 249–268.</li>\n<li>Löhrer, Guido &amp; Sehon, Scott, 2016, “The\nDavidsonian Challenge to the Non-Causalist”, <em>American\nPhilosophical Quarterly</em>, 53 (1): 85–96.</li>\n<li>Lovibond, Sabina, 2006, “Practical Reason and its Animal\nPrecursors”, <em>European Journal for Philosophy of\nScience</em>, 14 (2): 262–273.</li>\n<li>Lynch, Kevin, 2017, “The Divisibility of Basic\nActions”, <em>Analysis</em>, 77 (2): 312–318.</li>\n<li>MacIntyre, Alasdair C., 1999, <em>Dependent Rational Animals: Why\nHuman Beings Need the Virtues</em>, LaSalle, Il: Open Court\nPublishing.</li>\n<li>Marcus, Eric, 2012, <em>Rational Causation</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 2019 “Reconciling practical knowledge\nwith self-deception”, <em>Mind</em>, 128(512): 1205–1225. </li>\n<li>–––, 2021, “Anscombe and the Difference\nRationality Makes”, in Adrian Haddock and Rachel Wiseman (eds.),\n<em>The Anscombean Mind</em>, London: Routledge, pp. 241–252.</li>\n<li>Marticorena, Drew C. W., April M. Ruiz, Cora Mukerji, Anna Goddu\nand Laurie R. Santos, 2011, “Monkeys Represent Others’\nKnowledge But Not Their Beliefs”, <em>Developmental\nScience</em>, 14 (6): 1406–1416.</li>\n<li>Marušić, Berislav, and John Schwenkler, 2018,\n“Intending Is Believing: A Defense of Strong Cognitivism”,\n<em>Analytic Philosophy</em>, 59 (3): 309–340.</li>\n<li>Marx, Karl, 1844a, “Critique of Hegel’s Philosophy in\nGeneral” in <em>Economic and Philosophical Manuscripts of\n1844</em>, Karl Marx and Friedrich Engels Collected Works: Volume 3,\nLondon: Lawrence &amp; Wishart, 1975.</li>\n<li>–––, 1844b, “Stranged Labour” in\n<em>Economic and Philosophical Manuscripts of 1844</em>, Karl Marx\nand Friedrich Engels Collected Works: Volume 3, London: Lawrence\n&amp; Wishart, 1975.</li>\n<li>–––, 1867, Capital (Volume One), in <em>Karl\nMarx and Friedrich Engels Collected Works</em>: Volume 35, London:\nLawrence &amp; Wishart, 1996. </li>\n<li>Mayr, Erasmus, 2011, <em>Understanding Human Agency</em>, Oxford\nand New York: Oxford University Press. </li>\n<li>McDermott, Michael, 1995, “Redundant Causation”,\n<em>The British Journal for the Philosophy of Science</em>, 46 (4):\n523–544. </li>\n<li>–––, 2011. “Anscombe on Bodily\nSelf-Knowledge” in Anton Ford, Jennifer Hornsby and Frederick\nStoutland (eds.), <em>Essays on Anscombe’s Intention</em>,\nCambridge, MA: Harvard University Press, pp. 128–46. </li>\n<li>Mele, Alfred R., 1992, <em>Springs of Action: Understanding\nIntentional Behavior</em>, New York and Oxford: Oxford University\nPress. </li>\n<li>–––, 2009, <em>Effective Intentions: The Power\nof Conscious Will</em>, New York: Oxford University Press. </li>\n<li>–––, 2010, “Libet on free will: Readiness\nPotentials, Decisions, and Awareness”, in Walter\nSinnott-Armstrong and Lynn Nadel (eds.), <em>Conscious Will and\nResponsibility: A Tribute to Benjamin Libet</em>, New York: Oxford\nUniversity Press, pp. 23–33.</li>\n<li>–––, 2013, “Actions, Explanations, and\nCauses”, in G. D’Oro (ed.), <em>Reasons and Causes:\nCausalism and Non-causalism in the Philosophy of Action</em>.\nLondon: Palgrave-Macmillan. </li>\n<li>Mele, Alfred R., and Paul K. Moser, 1994, “Intentional\nAction”, <em>Noûs</em>, 28 (1): 39–68. </li>\n<li>Moran, Richard, 2004, “Anscombe on ‘Practical\nKnowledge’”, in J. Hyman and H. Steward (eds.), <em>Royal\nInstitute of Philosophy Supplement</em>, Cambridge: Cambridge\nUniversity Press, pp. 43–68. </li>\n<li>–––, 2012, <em>Authority and Estrangement: An\nessay on self-knowledge</em>, Princeton: Princeton University\nPress.</li>\n<li>Moran, Richard, and Martin J. Stone, 2009, “Anscombe on\nExpression of Intention”, in Constantine Sandis (ed.), <em>New\nEssays on the Explanation of Action</em>, London: Palgrave Macmillan,\npp. 132–168.</li>\n<li>Mourelatos, Alexander P. D., 1978, “Events, Processes, and\nStates”, <em>Linguistics and Philosophy</em>, 2 (3):\n415–434.</li>\n<li>Mueller, Anselm, 1979, “Radical Subjectivity”,\n<em>Ratio</em>, 19: 115–32. </li>\n<li>Mylopoulos, Myrto, and Elisabeth Pacherie, 2019,\n“Intentions: The Dynamic Hierarchical Model Revisited”,\n<em>Wiley Interdisciplinary Reviews. Cognitive Science</em>, 10 (2):\ne1481. </li>\n<li>Nagel, Thomas, 1989, <em>The View From Nowhere</em>, New York:\nOxford University Press. </li>\n<li>Nahmias, Eddy, 2014, “Is Free Will an Illusion? Confronting\nChallenges From the Modern Mind Sciences”, in Walter\nSinnott-Armstrong (ed.), <em>Moral Psychology</em> (Volume\n4: <em>Freedom and Responsibility</em>), Cambridge, MA: MIT Press,\npp. 1–25. </li>\n<li>Nefsky, Julia, and Sergio Tenenbaum, 2022, “Extended Agency\nand the Problem of Diachronic Autonomy”, in Carla Bagnoli (ed.),\n<em>Time in Action</em>, New York: Routledge, pp. 173–195.</li>\n<li>Newstead, Anne, 2006, “Knowledge by Intention? On the\nPossibility of Agent’s Knowledge”, in Stephen Hetherington\n(ed.), <em>Aspects of Knowing</em>, Amsterdam: Elsevier Science. </li>\n<li>O’Brien, Lilian, 2012, “Deviance and Causalism”,\n<em>Pacific Philosophical Quarterly</em>, 93 (2): 175–196. </li>\n<li>O’Brien, Lucy, 2007, <em>Self-knowing agents</em>, Oxford:\nOxford University Press.</li>\n<li>O’Connor, Timothy and Christopher Franklin, 2022,\n“Free Will”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Summer 2022 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2022/entries/freewill/\">https://plato.stanford.edu/archives/sum2022/entries/freewill/</a>&gt;.</li>\n<li>O’Shaughnessy, Brian, 1980, <em>The Will</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, “The Epistemology of Physical\nAction”, in Johannes Roessler and Naomi Eilan (eds.), <em>Agency\nand Self-Awareness: Issues in Philosophy and Psychology</em>, Oxford:\nClarendon Press, pp. 345–357.</li>\n<li>Oddie, Graham, 2005, <em>Value, Reality, and Desire</em>, New\nYork: Oxford University Press. </li>\n<li>Parsons, Terence, 1990, <em>Events in the Semantics of English: A\nStudy in Subatomic Semantics</em>, Cambridge, MA: MIT Press.</li>\n<li>Parry, Richard, 2021, “<em>Episteme</em> and\n<em>Techne</em>”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Winter 2021 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/win2021/entries/episteme-techne/\">https://plato.stanford.edu/archives/win2021/entries/episteme-techne/</a>&gt;.</li>\n<li>Paul, Sarah, 2009a, “How We Know What We’re\nDoing”, <em>Philosophers’ Imprint</em>, 9 (11):\n1–24. </li>\n<li>–––, 2009b, “Intention, Belief, and\nWishful Thinking: Setiya on ”Practical Knowledge“”,\n<em>Ethics</em>, 119 (3): 546–557.</li>\n<li>–––, 2011a, “Review of ”Willing,\nWanting, and Waiting“ by Richard Holton”, <em>Mind</em>,\n120: 889–892.</li>\n<li>–––, 2011b, “Deviant Formal\nCausation”, <em>Journal of Ethics and Social Philosophy</em>, 5\n(3): 1–24.</li>\n<li>–––, 2014a, “Diachronic Incontinence is a\nProblem in Moral Philosophy”, <em>Inquiry: A Journal of Medical\nCare Organization, Provision and Financing</em>, 57 (3):\n337–355.</li>\n<li>–––, 2014b, “Embarking on a Crime”,\nin Enrique Villanueva (ed.), <em>Law and the Philosophy of\nAction</em>, Leiden: Brill, pp. 101–124. </li>\n<li>Payton, Jonathan D., 2021, <em>Negative Actions: Events, Absences,\nand the Metaphysics of Agency</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Pavese, Carlotta, forthcoming, “Practical Knowledge\nFirst”, <em>Synthese</em>. </li>\n<li>Peacocke, Christopher, 1979, “Deviant Causal Chains”,\n<em>Midwest Studies in Philosophy</em>, 4: 123–155. </li>\n<li>–––, 2003, <em>The Realm of Reason</em>, Oxford:\nOxford University Press. </li>\n<li>Petrovic, Gajo, 1983, “‘Praxis’”, Tom\nBottomore (ed.), <em>A Dictionary of Marxist Thought</em>, 2nd\nedition, pp. 435–440.</li>\n<li>Pickard, H., 2004, “Knowledge of Action without\nObservation”, <em>Proceedings of the Aristotelian Society</em>,\n104(1): 205–230. </li>\n<li>Piñeros Glasscock, Juan S., 2020a, “Authoritative\nKnowledge”, <em>Erkenntnis. An International Journal of Analytic\nPhilosophy</em>, 87 (5): 2475–2502. </li>\n<li>–––, 2020b, “Practical Knowledge and\nLuminosity”, <em>Mind</em>, 129: 1237–1267.</li>\n<li>–––, 2021, “Alienation or Regress: On the\nNon-inferential Character of Agential Knowledge”,\n<em>Philosophical Studies</em>, 178 (6): 1757–1768. </li>\n<li>Plato, <em>Charmides</em>, in <em>Plato: Complete Works</em>, John\nCooper and Douglas Hutchinson (eds.), Indianapolis: Hackett,\n1997.</li>\n<li>–––, <em>Gorgias</em>, in <em>Plato: Complete\nWorks</em>, John Cooper and Douglas Hutchinson (eds.), Indianapolis:\nHackett, 1997.</li>\n<li>–––, <em>Parmenides</em>, in <em>Plato: Complete\nWorks</em>, John Cooper and Douglas Hutchinson (eds.), Indianapolis:\nHackett, 1997.</li>\n<li>Prichard, H.A., 1945, “Acting, Willing, Desiring”, in\n<em>Moral Obligation</em>, Oxford: Oxford University Press, pp.\n59–69.</li>\n<li>Quine, W. V., 1985, “Events and Reification”, in\nErnest LePore and Brian McLaughlin (eds.), <em>Actions and Events:\nPerspectives on the Philosophy of Donald Davidson</em>, Oxford: Basil\nBlackwell, pp. 162–171.</li>\n<li>Reynolds, Steven L., 2002, “Testimony, knowledge, and\nepistemic goals”, <em>Philosophical Studies</em>, 110 (2):\n139–161.</li>\n<li>Rödl, Sebastian, 2007, <em>Self-consciousness</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2011, “Forms of Practical Knowledge\nand Their Unity”, in Anton Ford, Jennifer Hornsby and Frederick\nStoutland (eds.), <em>Essays on Anscombe’s Intention</em>,\nCambridge, MA: Harvard University Press, pp. 211–241.</li>\n<li>Rosenberg, Alexander, and Robert M. Martin, 1979, “The\nExtensionality of Causal Contexts”, <em>Midwest Studies in\nPhilosophy</em>, 4 (1): 401–408.</li>\n<li>Ross, Jacob, 2009, “How to be a Cognitivist about Practical\nReason”, <em>Oxford Studies in Metaethics</em>, 4:\n243–281.</li>\n<li>Roth, A.S., 2017, “Shared Agency”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Summer 2017 Edition), Edward N. Zalta\n(ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/sum2017/entries/shared-agency/\">https://plato.stanford.edu/archives/sum2017/entries/shared-agency/</a>&gt;.</li>\n<li>Russell, Devlin, 2018, “Intention as Action Under\nDevelopment: Why Intention is Not a Mental State”, <em>Canadian\nJournal of Philosophy</em>, 48 (5): 742–761.</li>\n<li>Ryle, Gilbert, 1949, <em>The Concept of Mind</em>, Chicago:\nUniversity of Chicago Press. </li>\n<li>–––, 1973, “Negative\n‘Actions’”, <em>Hermathena</em>, 115: 81–93.</li>\n<li>Sandis, Constantine, 2015, “One Fell Swoop: Small Red Book\nHistoricism Before and After Davidson”, <em>Journal of the\nPhilosophy of History</em>, 9 (3): 372–392. </li>\n<li>Sartorio, Carolina, 2009, “Omissions and Causalism”,\n<em>Noûs</em>, 43 (3): 513–530. </li>\n<li>Schafer, Karl, 2013, “Perception and the Rational Force of\nDesire”, <em>The Journal of Philosophy</em>, 110 (5):\n258–281. </li>\n<li>Schaffer, Jonathan, 2005, “Contrastive Causation”,\n<em>The Philosophical Review</em>, 114 (3): 327–358. </li>\n<li>Schapiro, Tamar, 2021, <em>Feeling Like It: A Theory of\nInclination and Will</em>, New York: Oxford University Press. </li>\n<li>Schueler, G. F., 2003, <em>Reasons and Purposes: Human Rationality\nand the Teleological Explanation of Action</em>, Oxford and New York:\nOxford University Press.</li>\n<li>Schweikard, D.P., and Schmid, H.B., 2021, “Collective\nIntentionality”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2021 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2021/entries/collective-intentionality/\">https://plato.stanford.edu/archives/sum2017/entries/shared-agency/</a>&gt;.</li>\n<li>Schwenkler, John, 2012, “Non-Observational Knowledge of\nAction”, <em>Philosophy Compass</em>, 7 (10): 731–740.</li>\n<li>–––, 2015, “Understanding ‘Practical\nKnowledge’”, <em>Philosophers’ Imprint</em>, 15\n(15): 1­–32.</li>\n<li>–––, 2019, <em>Anscombe’s Intention: A\nGuide</em>, New York: Oxford University Press.</li>\n<li>Schwitzgebel, E., 2019, “The Unskilled Zhuangzi: Big and\nUseless and Not So Good at Catching Rats”, in Karyn Lai and Wai\nWai Chiu (eds.), <em>Skill and Mastery: Philosophical Stories from the\nZhuangzi</em>, London: Roman and Littlefield (2019).</li>\n<li>Searle, John R., 1983, <em>Intentionality: An Essay in the\nPhilosophy of Mind</em>, Cambridge: Cambridge University Press..</li>\n<li>Sebo, Jeff, 2017, “Agency and Moral Status”,\n<em>Journal of Moral Philosophy</em>, 14 (1): 1–22.</li>\n<li>Segvic, Heda, 2011, “Deliberation and Choice in\nAristotle” in M. Pakaluk and G. Pearsons (eds.), <em>Moral\nPsychology and Human Action in Aristotle</em>, Oxford: Oxford\nUniversity Press, pp.144–71. </li>\n<li>Sehon, Scott, 2005, <em>Teleological Realism: Mind, Agency, and\nExplanation</em>, Cambridge, MA: Bradford Books/MIT Press.</li>\n<li>Setiya, Kieran, 2007, <em>Reasons Without Rationalism</em>,\nPrinceton: Princeton University Press. </li>\n<li>–––, 2008, “Practical Knowledge”,\n<em>Ethics</em>, 118 (3): 388–409. </li>\n<li>–––, 2009, “Practical Knowledge\nRevisited”, <em>Ethics</em>, 120 (1): 128–137. </li>\n<li>–––, 2010, “Sympathy for the Devil”,\nin Sergio Tenenbaum (ed.), <em>Desire, Practical Reason, and the\nGood</em>, New York: Oxford University Press, pp. 82–111.</li>\n<li>–––, 2011, “Reasons and Causes”,\n<em>European Journal for Philosophy of Science</em>, 19 (1):\n129–157.</li>\n<li>–––, 2012, “Knowing How”,\n<em>Proceedings of the Aristotelian Society</em>, 112 (3):\n285–307.</li>\n<li>–––, 2016a, ‘Anscombe on Practical\nKnowledge,’ in <em>Practical Knowledge: Selected Essays</em>,\nOxford: Oxford University Press, pp. 156–168.</li>\n<li>–––, 2016b, “Akrasia and the Constitution\nof Agency”, in <em>Practical Knowledge: Selected Essays</em>,\nNew York: Oxford University Press, pp. 253–271.</li>\n<li>–––, 2022, “Intention”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2022 Edition), Edward\nN. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2022/entries/intention/\">https://plato.stanford.edu/archives/fall2022/entries/intention/</a>&gt;.</li>\n<li>Shah, Nishi, 2008, “How Action Governs Intention”,\n<em>Philosophers’ Imprint</em>, 8 (5): 1–19.</li>\n<li>Shah, Nishi, and Velleman, J. David, 2006, “Doxastic\nDeliberation”, <em>Philosophical Review</em>, 114 (4):\n497–534.</li>\n<li>Shepherd, Joshua, 2021, <em>The Shape of Agency: Control, Action,\nSkill, Knowledge</em>, Oxford: Oxford University Press.</li>\n<li>Shepherd, Joshua, and J. Adam Carter, forthcoming,\n“Knowledge, Practical Knowledge, and Intentional Action”,\n<em>Ergo: An Open Access Journal of Philosophy</em>.</li>\n<li>Sinhababu, Neil, 2017, <em>Humean Nature</em>, Oxford: Oxford\nUniversity Press. </li>\n<li>Slote, Michael, 1979, “Assertion and Belief”, in\nJ. Dancy (ed.), <em>Papers on Language and Logic</em>, Keele: Keele\nUniversity Library, pp. 177–190. </li>\n<li>Small, Will, 2012, “Practical Knowledge and the Structure of\nAction”, in Günter Abel and James Conant\n(eds.), <em>Rethinking Epistemology</em>, Boston: De Gruyter,\npp. 133–228. </li>\n<li>–––, 2019, “Basic Action and Practical\nKnowledge”, <em>Philosophers’ Imprint</em>, 19 (19). \n[<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.019\" target=\"other\">Small 2019 available online</a>]</li>\n<li>Smith, Michael, 2012, “Four Objections to the Standard Story\nof Action (and Four Replies)”, <em>Philosophical Issues</em>\n(<em>Noûs</em> Supplement), 22: 387–401.</li>\n<li>–––, 2013, “A Constitutivist Theory of\nReasons: Its Promise and Parts”, <em>Law Ethics Philosophy</em>,\n1: 9–30.</li>\n<li>–––, 2015, “The Magic of\nConstitutivism”, <em>American Philosophical Quarterly</em>, 52\n(2): 187–200. </li>\n<li>–––, 2019, “Constitutivism”, in\nTristram McPherson and David Plunkett (eds.), <em>The Routledge\nHandbook of Metaethics</em>, London: Routledge,\npp. 371–384. </li>\n<li>Sneddon, Andrew, 2001, “Does Philosophy of Action Rest on a\nMistake?”, <em>Metaphilosophy</em>, 32 (5): 502–522. </li>\n<li>Stathopoulos, Alexander, 2016, “Knowing Achievements”,\n<em>Philosophy</em> , 91 (03): 361–374.</li>\n<li>Steward, Helen, 2009, “Animal Agency”, <em>Inquiry: An\nInterdisciplinary Journal of Philosophy</em>, 52 (3):\n217–231.</li>\n<li>–––, 2012a, <em>A Metaphysics for Freedom</em>,\nOxford: Oxford University Press. </li>\n<li>–––, 2012b, “Actions as Processes”,\n<em>Philosophical Perspectives</em> (<em>Noûs</em> Supplement),\n26 (1): 373–388. </li>\n<li>–––, 2020, “Agency as a Two-Way Power: A\nDefence”, <em>The Monist</em>, 103 (3): 342–355. </li>\n<li>Stoecker, Ralf, 2009, “Why Animals Can’t Act”,\n<em>Inquiry: An Interdisciplinary Journal of Philosophy</em>, 52 (3):\n255–271. </li>\n<li>Stoop, Annette, 1962, “Review: <em>Free Action</em>, by A. I.\nMelden”, <em>Australasian Journal of Philososphy</em>, 40 (2):\n247–249. </li>\n<li>Stout, Rowland, 1997, “Processes”,\n<em>Philosophy</em>, 72 (279): 19–27. </li>\n<li>Strawson, Peter F., 1985, “Causation and Explanation”,\nin Bruce Vermazen and Merrill B. Hintikka (eds.), <em>Essays on\nDavidson: Actions and Events</em>, Oxford: Oxford University Press,\npp. 115–135. </li>\n<li>Swanson, Eric, 2012, “The Language of Causation”, in\nGillian Russell and Delia Graff Fara (eds.), <em>The Routledge\nCompanion to Philosophy of Language</em>, New York and London:\nRoutledge, pp. 716–728. </li>\n<li>Tenenbaum, Sergio, 2007, <em>Appearances of the Good: An Essay on\nthe Nature of Practical Reason</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2011, “Review: Self-Constitution:\nAgency, Identity, and Integrity by Korsgaard, Christine M”,\n<em>Ethics</em>, 121 (2): 449–455. </li>\n<li>–––, 2012, “Knowing the Good and Knowing\nWhat One is Doing”, <em>Canadian Journal of Philosophy</em>\n(Supplementary Volume) 39: 91–117.</li>\n<li>–––, 2018a, “Reconsidering\nIntentions”, <em>Noûs</em>, 52 (2): 443–472.</li>\n<li>–––, 2018b, “The Guise of the Guise of the\nBad”, <em>Ethical Theory and Moral Practice</em>, 21 (1):\n5–20.</li>\n<li>–––, 2020, <em>Rational Powers in Action:\nInstrumental Rationality and Extended Agency</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Thompson, Michael, 2008, <em>Life and action</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 2011, “Anscombe’s Intention and\nPractical Knowledge”, in Anton Ford, Jennifer Hornsby and\nFrederick Stoutland (eds.), <em>Essays on Anscombe’s\nIntention</em>, Cambridge, MA: Harvard University Press, pp.\n198–210.</li>\n<li>–––, 2013, “Forms of nature”, in G.\nHindrichs and Axel H. (eds.), <em>Freiheit. Stuttgarter\nHegel-Kongres</em>, Frankfurt am Main: Vittorio Klostermann:\n701–735. </li>\n<li>Thomson, Judith Jarvis, 1971, “The Time of a Killing”,\n<em>The Journal of Philosophy</em>, 68 (5): 115–132. </li>\n<li>Unger, Peter, 1975, <em>Ignorance: A Case for Scepticism</em>, New\nYork: Oxford University Press.</li>\n<li>Valaris, Markos, 2015, “The Instrumental Structure of\nActions”, <em>Philosophical Quarterly</em>, 65 (258):\n64–83.</li>\n<li>–––, 2020, “Thinking by doing: Rylean\nRegress and the Metaphysics of Action”, <em>Inquiry</em>, 197:\n3395–3412 </li>\n<li>–––, 2021, “Knowledge Out of\nControl”, <em>The Philosophical Quarterly</em>, 72 (3):\n733–753. </li>\n<li>Vekony, Romy, Alfred Mele and David Rose, 2021, “Intentional\nAction Without Knowledge”, <em>Synthese</em>, 199 (1):\n1231–1243. </li>\n<li>Velleman, J. David, 1989, <em>Practical Reflection</em>,\nPrinceton: Princeton University Press. </li>\n<li>–––, 1992a, “The Guise of the Good”,\n<em>Noûs</em>, 26 (1): 3–26. </li>\n<li>–––, 1992b, “What Happens when Someone\nActs”, <em>Mind</em>, 101 (403): 461–481.</li>\n<li>–––, 1996, “The Possibility of Practical\nReason”, <em>Ethics</em>, 106 (4): 694–726.</li>\n<li>–––, 1997, “Deciding How to Decide”,\nin Garrett Cullity and Berys Gaut (eds.), <em>Ethics and Practical\nReason</em>, Oxford: Clarendon Press, pp. 29–52.</li>\n<li>–––, 2000a, “From Self Psychology to Moral\nPhilosophy”, <em>Philosophical Perspectives</em>\n(<em>Noûs</em> Supplement), 14: 349–377.</li>\n<li>–––, 2000b, <em>The Possibility of Practical\nReason</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2009, <em>How We Get Along</em>, New York:\nCambridge University Press. </li>\n<li>–––, 2014, “A Note on Practical\nKnowledge”, in J. David Velleman, <em>The Possibility of\nPractical Reason</em>, second edition, Ann Arbor: Michigan Publishing,\nUniversity of Michigan Library. doi:10.3998/maize.13240734.0001.001</li>\n<li>Vermazen, Bruce, 1985, “Negative Acts”, in Bruce\nVermazen and Merrill B. Hintikka (eds.), <em>Essays on Davidson:\nActions and Events</em>, Oxford: Oxford University Press, pp.\n93–104.</li>\n<li>Vogler, Candace A., 2001, “Anscombe on Practical\nInference”, in Elijah Millgram (ed.), <em>Varieties of Practical\nReasoning</em>, Cambridge, MA: MIT Press, pp. 437–464.</li>\n<li>de Waal, Frans B. M., 2016, “Apes Know What Others\nBelieve”, <em>Science</em>, 354 (6308): 39–40.</li>\n<li>Wegner, Daniel M., 2002, <em>The Illusion of Conscious Will</em>,\nCambridge, MA: MIT Press.</li>\n<li>Wiland, Eric, 2013, “In the beginning was the doing: the\npremises of the practical syllogism”, <em>Canadian Journal of\nPhilosophy</em>, 43 (3): 303–321</li>\n<li>Williams, Bernard (ed.), 1981, “Moral Luck”, in\n<em>Moral Luck: Philosophical Papers 1973–1980</em>, Cambridge:\nCambridge University Press, pp. 20–39.</li>\n<li>Williamson, Timothy, 2000, <em>Knowledge and its Limits</em>,\nOxford and New York: Oxford University Press. </li>\n<li>Wilson, George M., 1980, <em>The Intentionality of Human\nAction</em>, Stanford, CA: Stanford University Press.</li>\n<li>–––, 2000, “Proximal Practical\nForesight”, <em>Philosophical Studies</em>, 99: 3–19.</li>\n<li>Wittgenstein, Ludwig, 1953 [2010], <em>Philosophical\nInvestigations</em>, P. M. S. Hacker and Joachim Schulte (eds.),\nG.E.M. Anscombe, P.M.S.  Hacker and Joachim Schulte (trans.),\nChichester, West Sussex: Wiley-Blackwell.</li>\n<li>Wolfson, Ben, 2012, “Agential Knowledge, Action and\nProcess”, <em>Theoria</em>, 78 (4): 326–357.</li>\n<li>Wu, Wayne, 2016, “Experts and Deviants: The Story of\nAgentive Control”, <em>Philosophy and Phenomenological\nResearch</em>, 93 (1): 101–126.</li>\n<li>Yaffe, Gideon, 2010, <em>Attempts: In the Philosophy of Action and\nthe Criminal Law</em>, Oxford and New York: Oxford University\nPress.</li>\n<li>Wong, David, 2020, “Comparative Philosophy: Chinese and\nWestern”, <em>The Stanford Encyclopedia of Philosophy</em> (Fall\n2020 Edition), Edward N. Zalta (ed.), URL =\n&lt;<a href=\"https://plato.stanford.edu/archives/fall2020/entries/comparphil-chiwes/\">https://plato.stanford.edu/archives/fall2020/entries/comparphil-chiwes/</a>&gt;.</li>\n<li>Wong, H.Y., 2018, “Embodied agency”, <em>Philosophy\nand Phenomenological Research</em>, 97(3): 584–612.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "agency: shared",
            "Anscombe, Gertrude Elizabeth Margaret",
            "Daoism",
            "Davidson, Donald",
            "episteme and techne [= scientific knowledge and expertise]",
            "events",
            "free will",
            "incompatibilism: (nondeterministic) theories of free will",
            "intention",
            "intentionality: collective",
            "knowledge how",
            "practical reason",
            "practical reason: and the structure of actions",
            "reasons for action: internal vs. external",
            "self-knowledge"
        ],
        "entry_link": [
            {
                "../shared-agency/": "agency: shared"
            },
            {
                "../anscombe/": "Anscombe, Gertrude Elizabeth Margaret"
            },
            {
                "../daoism/": "Daoism"
            },
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../episteme-techne/": "episteme and techne [= scientific knowledge and expertise]"
            },
            {
                "../events/": "events"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../incompatibilism-theories/": "incompatibilism: (nondeterministic) theories of free will"
            },
            {
                "../intention/": "intention"
            },
            {
                "../collective-intentionality/": "intentionality: collective"
            },
            {
                "../knowledge-how/": "knowledge how"
            },
            {
                "../practical-reason/": "practical reason"
            },
            {
                "../practical-reason-action/": "practical reason: and the structure of actions"
            },
            {
                "../reasons-internal-external/": "reasons for action: internal vs. external"
            },
            {
                "../self-knowledge/": "self-knowledge"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/action/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=action&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/action/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/action/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=action&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/action/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Wilson, George, and Samuel Shpall, “Action”,\n <em>Stanford Encyclopedia of Philosophy</em> (Winter 2022 Edition),\nEdward N. Zalta &amp; Uri Nodelman (eds.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2022/entries/action/\">https://plato.stanford.edu/archives/win2022/entries/action/</a>&gt;.\n [This was the previous entry on this topic in the <em>Stanford\nEncyclopedia of Philosophy</em> – see the\n<a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action\" target=\"other\">version history</a>.]",
            "Wasserman, Ryan, 2004,\n “<a href=\"https://www.academia.edu/27802061/Is_Causation_Extensional\" target=\"other\">Is Causation Extensional?</a>”,\n unpublished paper.",
            "<a href=\"http://www.angelfire.com/ab3/freewill/ActionTheory.html\" target=\"other\">Action Theory</a>,\n Andrei Buckareff, University of Rochester",
            "<a href=\"http://actiontheory.free.fr/\" target=\"other\">Action Theory</a>,\n Élisabeth Pacherie, Institut Jean-Nicod, CNRS"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/win2022/entries/action/": "https://plato.stanford.edu/archives/win2022/entries/action/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=action": "version history"
            },
            {
                "https://www.academia.edu/27802061/Is_Causation_Extensional": "Is Causation Extensional?"
            },
            {
                "http://www.angelfire.com/ab3/freewill/ActionTheory.html": "Action Theory"
            },
            {
                "http://actiontheory.free.fr/": "Action Theory"
            }
        ]
    }
}