{
    "url": "al-farabi-metaphysics",
    "title": "al-Farabi’s Metaphysics",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Stephen Menn\n<stephen.menn@mcgill.ca>",
        "author_links": [
            {
                "mailto:stephen%2emenn%40mcgill%2eca": "stephen.menn@mcgill.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nStephen Menn\n&lt;<a href=\"mailto:stephen%2emenn%40mcgill%2eca\"><em>stephen<abbr title=\" dot \">.</abbr>menn<abbr title=\" at \">@</abbr>mcgill<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 22, 2021"
    ],
    "preamble": "\n\n“Al-Fârâbî’s metaphysics”, as\nunderstood here, means not just his views, and arguments for those\nviews, on a series of metaphysical topics, but his project of\nreconstructing and reviving metaphysics as a science. This is part of\nhis larger project of reconstructing and reviving “the sciences\nof the ancients”: his scientific project in metaphysics is\ninseparable from his interpretation and assimilation of\nAristotle’s Metaphysics. We start with some motivation\nfor Fârâbî’s larger project of reconstructing\n“the sciences of the ancients”, then turn to what he says\nabout metaphysics as one such science and about Aristotle’s\nMetaphysics, and then to details of his reconstruction of\nmetaphysics as a science, both in his account of maximally universal\nconcepts such as being and unity, and in his account of God as the\nfirst cause of existence.\n",
    "toc": [
        {
            "#FaraProjReviScieAnci": "1. Fârâbî’s project of reviving the sciences of the ancients"
        },
        {
            "#FaraMetaScieArisMeta": "2. Fârâbî on metaphysics as a science and Aristotle’s Metaphysics"
        },
        {
            "#FaraOntoBookLettOneUnit": "3. Fârâbî’s ontology: the Book of Letters and On the One and Unity"
        },
        {
            "#FaraProjBookLett": "3.1 Fârâbî’s project in the Book of Letters"
        },
        {
            "#LogiGramFormRolePart": "3.2 Logical and grammatical form, and the role of particles"
        },
        {
            "#FaraWordForBeinGreeArab": "3.3 Fârâbî on the word for being, in Greek and Arabic"
        },
        {
            "#FaraSensBeinMawjCorrSensExisWuju": "3.4 Fârâbî on the senses of being [mawjûd] and the corresponding senses of existence [wujûd]"
        },
        {
            "#FaraScieQuesAbouBein": "3.5 Fârâbî on the scientific questions about being"
        },
        {
            "#OneUnitSensUnitDiffRelaBetwOneManyCircThinQuid": "3.6 On the One and Unity: senses of unity, different relations between one and many, and the circumscription of a thing by its quiddity"
        },
        {
            "#FaraPhilTheoPerfCityPoliRegi": "4. Fârâbî’s philosophical theology: the Perfect City and Political Regime"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "A. Primary sources"
        },
        {
            "#EditTextFara": "A.1 Editions of texts by Fârâbî"
        },
        {
            "#EditEarlArabPhilText": "A.2 Editions of earlier Arabic philosophical texts"
        },
        {
            "#TranTextFara": "A.3 Translations of texts by Fârâbî"
        },
        {
            "#TranEarlArabPhilTextGreeTextSurvArab": "A.4 Translations of earlier Arabic philosophical texts, and a Greek text surviving in Arabic/Hebrew"
        },
        {
            "#BSecoSour": "B. Secondary sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        },
        {
            "reviving-sciences.html": "Supplement: Fârâbî’s project of reviving the sciences of the ancients"
        },
        {
            "word-being.html": "Supplement: Fârâbî on the word for being, in Greek and Arabic"
        }
    ],
    "main_text": "\n1. Fârâbî’s project of reviving the sciences of the ancients\n\nFârâbî does metaphysics, not by writing a commentary\non Aristotle’s Metaphysics, but by trying to\nreconstruct Aristotle’s aims and demonstrative method and to\nwrite the book that Aristotle would have written had he been writing\nin Arabic for a largely Muslim readership. This is a part of\nFârâbî’s approach to the “sciences of\nthe ancients”, i.e., to Greek philosophy, mathematics, and\nmedicine, with all their sub-disciplines. A brief summary follows but,\nfor a fuller account, see\n Supplement: Fârâbî’s project of reviving the sciences of the ancients.\n\nFârâbî, more than any other medieval philosopher,\ndistrusts the surface appearance of Greek philosophy as presented to\nhim in the Arabic translations. He tries to go beyond this surface to\nreconstruct the ancient authors’ aims and methods, and even to\nreconstruct the structure of their Greek expressions, which he\nsuspects have been badly served by the Arabic translations. In some\ncases the Greek texts he is interested in were not available to him\neven in Arabic translation, but only in translations of later ancient\nsummaries or descriptions, but this does not stop him from trying to\nreconstruct their underlying thought. (He has access to translations\nof almost all of the texts of Aristotle that we have now, but\napparently to none of the texts of Plato.) He thinks this is worth the\neffort because he thinks that the Greeks, especially Plato and\nAristotle, developed sciences which have since decayed or have been\ntransmitted only imperfectly to the Arabic-writing Muslim-ruled lands,\nbut which it is still possible to reconstruct and to apply to the\nurgent questions of his own time.\n\nFârâbî is particularly interested in applying the\n“sciences of the ancients”, and particularly metaphysics,\nto resolve the issues addressed and disputed by the “religious\nsciences” within Islam, especially kalâm or\n“dialectical theology”. These issues include whether the\nworld was created in time or has existed from eternity, proofs of\nGod’s existence and of his having no partner or contrary,\nGod’s attributes (knowledge, power, will …) and his\naction in creating the world, and how his causality relates to the\ncausality of creatures. (Fârâbî systematically\naddresses these issues, as well as kalâm issues about\nprophecy, the religious community, and the “return” or\nafterlife, in his Principles of the Opinions of the Perfect\nCity: see\n Section 4\n below.) Fârâbî thinks that the arguments about\nthese issues within the Muslim community (and other religious\ncommunities within the Muslim world) have been merely dialectical, so\nthat it is equally possible to argue on both sides of each issue. He\nthinks that if the sciences of the ancients, especially metaphysics,\ncan be reconstructed and practiced according to a demonstrative\nmethod, they will be able to resolve these disputes. He thinks,\nhowever, that earlier philosophers in the Muslim world, in practicing\nwhat they saw as Platonic or Aristotelian philosophy, have argued\nsub-demonstratively, and so have been unable to resolve the disputes.\nFârâbî claims to be the first person in the Muslim\nworld to have mastered Aristotle’s Posterior Analytics\nand so recaptured Aristotle’s demonstrative method. And he\nclaims to be the first to have understood Aristotle’s\nMetaphysics, and to have mastered the science of being and\nits universal attributes which gives the only scientific foundation\nfor making judgments about God and his causality.\n\nFârâbî and his contemporaries use the word\n“philosophy” (in Arabic “falsafa”),\nborrowed from the Greek, only for those schools and disciplines that\npresent themselves as continuing ancient Greek philosophy. Before\nFârâbî’s time this kind of philosophy was\nmainly practiced, in the Muslim world, by Christians, often\nSyriac-Arabic bilinguals (and almost all the translators of Greek\ntexts were Christian); although Christian philosophers also had Muslim\nand Jewish students, and although some Ismaʿili Shiʿites had\nintegrated a version of Greek philosophy into their ideal of what the\nimam must know. Fârâbî wants to break the\nassociation of philosophy with particular (and often marginalized)\nlinguistic and religious communities. The Arabic grammarian\nSîrâfî had accused Fârâbî’s\nChristian teacher Abû Bishr Mattâ of presenting as\nuniversal rules of logic, normative for any rational being, what were\nsimply rules of Greek grammar, as translated from Greek through Syriac\ninto Arabic and probably damaged in translation. Against this charge,\nFârâbî wants to show that logic, and philosophy is\ngeneral, is not community-bound like Arabic grammar or Muslim\nkalâm. Logic is to thought as the grammar of a\nparticular language is to that language: its rules apply to all\nthought insofar as it is correct, whatever language it may be\nexpressed in, and they give the common core shared by all languages,\nabstracted from the merely conventional and community-relative aspects\nof particular languages. And philosophy is to religion as logic is to\ngrammar, giving rules for how to think about God and the physical\nworld and human beings, and therefore for how to act to achieve the\naim of human life, which apply to all humans insofar as they reason\nand act correctly; and these rules give the common core of doctrines\nand practical prescriptions shared by all religions, or at least by a\nplurality of correct religions, abstracted from the merely\nconventional and community-relative aspects of particular\nreligions.\n2. Fârâbî on metaphysics as a science and Aristotle’s Metaphysics\n\nFârâbî aims to revive the sciences of the ancients,\nespecially the philosophical disciplines practiced by Plato and\nAristotle, to replace the (as he thinks) non-demonstrative disciplines\nof his contemporaries, and to resolve their otherwise interminable\ndisputes. This centrally includes a project of reviving scientific\nmetaphysics, because metaphysics (rather than physics or other\nsciences) offers the hope of a scientific demonstration that God\nexists and has no partner or contrary, and a scientific resolution of\nthe kalâm issues about God’s attributes and acts,\nand the relation of God’s acts to creatures and their\n acts.[1]\n Perhaps metaphysics can also determine whether the human soul, or\nsome part of it, survives death, and thus can resolve the\nkalâm issue about our “return” to God. But\nalso, apart from whatever metaphysics may say about immortality,\nFârâbî thinks, following Aristotle, that the highest\nhuman happiness consists in the contemplation of God, so that\nmetaphysics will describe the content of our possible\nhappiness after death, and will come as close as we can come to\nanticipating it in this life.\n\nFârâbî did not write any one systematic work on\nmetaphysics, corresponding to Aristotle’s Metaphysics,\nalthough his Book of Letters and On the One and\nUnity, taken together, stand in a close relation to some parts\nand aspects of Aristotle’s Metaphysics, and parts of\nhis Principles of the Opinions of the People of the Perfect\nCity and On the Political Constitution stand in close\nrelations to other parts and aspects of the Metaphysics\n(other parts of these treatises are closer to other Greek models).\nFârâbî’s starting-point in trying to revive\nthe science of metaphysics and to reconstruct and imitate its\nclassical texts (above all Aristotle’s Metaphysics) is\nhis discussion of the “aim” or “object”\n[Arabic gharaḍ = Greek skopos] of metaphysics.\nFârâbî takes over late ancient philosophers’\nassumptions that each of Aristotle’s treatises is devoted to\nteaching some one science, and that each science (and the treatise\nteaching it) has some one “aim”, such that everything the\nscience treats is somehow related to that aim. Thus the\n“aim” of medicine is health: the science of medicine also\ndiscusses, for instance, anatomy and pathology and pharmacology, but\nonly because they are somehow related to health. Much of\nFârâbî’s discussion of Aristotle’s texts\npicks up late ancient discussions of what science each text transmits,\nthe “aim” of the science and the text, how those sciences\nfunction together to attain the human good and what role each text can\nplay in that larger undertaking. In order to reconstruct what\nAristotle would say now, instead of what he said in Greek in the\nMetaphysics, if he were addressing a different linguistic and\nreligious community in a different historical situation,\nFârâbî must start by understanding the aim of\nmetaphysics as a science and how each book of the Metaphysics\nis directed toward attaining that aim. He gives surveys of the Greek\nsciences in his Enumeration of the Sciences and\nAttainment of Happiness, and of Aristotle’s works in\nthe Philosophy of Aristotle, all of which include brief\ndiscussions of metaphysics; he also has a brief discussion of\nmetaphysics and its relation to some other sciences in his Book of\nLetters, and he writes an entire short treatise On the aims\nof the Sage in each book of the treatise which is called the Book of\nLetters, that is, the determination of Aristotle’s aim in his\ntreatise the Metaphysics (for short, On the Aims of the\nMetaphysics). In the bulk of the Book of Letters and\nOn the One and Unity he is not talking about\nmetaphysics as a science or about Aristotle’s text, but rather\nimitating Aristotle in practicing this science. Some of On the\nAims of the Metaphysics is also imitating Aristotle, since, in\ndescribing the distinction between the different theoretical sciences\n(physics, mathematics, metaphysics) and the different things that\nmetaphysics considers, he is imitating Aristotle’s discussion in\nMetaphysics VI,1.\n\nFârâbî starts On the Aims of the\nMetaphysics by saying:\n\n\nOur intention in this book is to indicate the aim that is contained in\nthe treatise of Aristotle called Metaphysics, and [to\nindicate] its primary divisions. For many people have followed their\nfancy that the meaning and content of this treatise is the account of\nthe Creator (glory be to Him and be He exalted!) and the intelligence\nand the soul and the other things that are related to these, and that\nthe science of metaphysics and the science of\n theology[2]\n are one and the same. And thus we find that most of those who\ninvestigate [this treatise] are confused and go astray, since we find\nthat most of the account in it lacks this aim, indeed we do not find\nin it any special discussion of this aim except what is in the\neleventh book, which bears the sign lam [L or\n Λ].[3]\n\n\nHere Fârâbî is referring to the discussion, which\nArabic writers had inherited from late ancient Greek commentators,\nabout the aim of the Metaphysics, or equivalently about what\nthe science of metaphysics is about: Aristotle himself does not use\nthe word or phrase\n “metaphysics”,[4]\n but he speaks both of “wisdom\n [sophia]”[5]\n and of “first philosophy”, and Greek and Arabic\ncommentators assume that “wisdom” and “first\nphilosophy” are different names for the same science, and that\nthe Metaphysics as a whole is dedicated to this science,\nwhich can therefore also be called “metaphysics”. For two\nreasons, there is an inherited problem about what this science is\nabout. The first reason is that Aristotle in different places says\ndifferent, not obviously compatible, things about what this science is\nabout: notably, in the Metaphysics I,1–2 he says that\nwisdom is the science of first causes and principles; in\nMetaphysics VI,1 and in several texts outside the\nMetaphysics he says that first philosophy is the science of\ndivine things (which he calls “theology”) or the science\nof eternally unchangeable separately existing\n things;[6]\n in Metaphysics IV,1–2 he says that there is a science\nof being as such and its attributes, and in Metaphysics VI,1\nhe apparently identifies that science with first philosophy or\ntheology; and in Metaphysics IV,2 he also identifies the\nscience of being as such with the science of substance. So the\ncommentators try in different ways to reconcile these different things\nthat Aristotle says about wisdom or first philosophy. The second\nreason that there is a problem is that what Aristotle actually\ndoes in the different books of the Metaphysics does\nnot obviously fit with what he says that wisdom or first\nphilosophy will do. If, as Fârâbî says here,\n“most people” have concluded that “the meaning and\ncontent of this treatise is the account of the Creator … and\nthe intelligence and the soul and the other things that are related to\nthese”—i.e., an account of things that can be argued to be\neternal and separable from matter—this is not because (as\nFârâbî puts it here) they have simply\n“followed their fancy”, or because they have confused\nGreek metaphysics with Islamic kalâm. Rather, it is\nbecause Aristotle repeatedly says that first philosophy is a\nscience of separate eternally unchanging things. The problem is that,\nas Fârâbî says, most of the Metaphysics\noutside of Book XII (indeed, outside of roughly the second half of\nBook XII) does not seem to be talking about such things, except\ninasmuch as Metaphysics XIII–XIV try to refute other\nphilosophers’ candidates for separate eternally unchanging\nthings, namely Platonic Forms and mathematical objects. So\nFârâbî’s problem in On the Aims of the\nMetaphysics will not be simply to find a way of reconciling the\ndifferent things Aristotle says about wisdom or first\nphilosophy and show how these can all be referring to the same\nscience, but also to say what Aristotle actually does in each\nbook of the Metaphysics and to show how it contributes to\nthis science.\n\nIn his Enumeration of the Sciences Fârâbî\ngives a description of “the divine science” (corresponding\nto Aristotle’s word “theology” in\nMetaphysics VI,1, and his description of wisdom as\n“divine science” in Metaphysics I,2), crowning\nhis previous descriptions of mathematics and physics. Here\nFârâbî says the divine science is divided into three\nparts. The first part investigates “beings and the things that\nbelong to them inasmuch as they are beings”: this reflects\nAristotle’s programmatic declaration in Metaphysics\nIV,1. The second part, says Fârâbî, investigates\n(i.e., establishes) the principles of the particular sciences, and\nalso investigates (i.e., refutes) false opinions of earlier\nphilosophers about the principles of these sciences, among which\nFârâbî mentions the opinion that mathematical\nobjects are separately existing substances: the latter would reflect\nMetaphysics\n XIII–XIV,[7]\n but Fârâbî is probably also thinking of the\nrefutation in Metaphysics IV,3–8 of people who deny the\nprinciple of noncontradiction. (There is little support in Aristotle\nfor the idea that metaphysics establishes principles of other\nsciences, except for universal axioms like noncontradiction and\nexcluded middle, but this idea can be found in late ancient\ncommentators. Aristotle does accept cases where one science can\nestablish principles that are assumed in another science—for\ninstance, number theory establishes principles that are assumed in\nmathematical music theory, and geometry establishes principles that\nare used in astronomy and optics—and Porphyry says that\nmetaphysics is related to physics in this\n way.)[8]\n The third part of the “divine science”—and here\nFârâbî has much more to say—shows that there\nare beings which neither are bodies nor exist in bodies, that these\nbeings are not one but many, and not infinitely but finitely many, and\nthat they do not all share the same degree of perfection, but rather\nsome are superior and others inferior. This then leads to the\nconclusion that these beings separate from bodies culminate in some\nfirst being which has nothing prior to it and thus has no further\ncause of its existence. And, Fârâbî says, this\nscience shows that this being also has no partner (nothing sharing its\ndegree of perfection) and no contrary; that there is no multiplicity\nin it in any way, and that it is one, being, and true in a stronger\nsense than everything else; and that it is the first cause which\nbestows being, unity and truth on everything else. Then,\nFârâbî says, this science shows that this being\ndeserves the name “God”, and satisfies the rest of the\ndivine attributes; and then it shows how other beings arise from God\nand how they form an ordered hierarchy (some beings arise from God\ndirectly, others indirectly through these), explains how God acts on\nother things, and refutes the false opinion that God is responsible\nfor evils. The description of this third part of the “divine\nscience” reads like an analytical table of contents for much of\nwhat Fârâbî does in his Principles of the\nOpinions of the People of the Perfect City and Political\nRegime, but it is not closely related to anything in Aristotle.\nAt best, it is an enormously expanded version of some things that\nAristotle covers very quickly in Metaphysics XII,6–10:\nXII,6 shows that there are separate incorporeal substances, XII,7\njustifies the name “god”, XII,8 argues that there is a\nfinite multiplicity of such substances but only one first among them,\nand then XII,10 identifies this first principle with the good itself\nand argues (very sketchily) that it is the cause of good order in the\ncosmos and that there is no evil principle contrary to it. Aristotle\ndoes not seem to say in Metaphysics XII that the first\nprinciple is one, being, and true in a stronger sense than everything\nelse, or that it bestows being, unity and truth on everything else\n(the best support for this view might be Metaphysics II,1\n993b23–31). But the more serious problem is that\nFârâbî here just gives a list of the things that the\nscience will investigate or prove, without explaining why these tasks\nall belong to the same science, and without explaining what principles\nthe science can draw on to demonstrate all these conclusions. His\naccount here looks like a wish-list of what he would like the science\nto do, especially as a Greek scientific alternative to Islamic\nkalâm, but it does not explain how a science can do all\nthis. Rather than solving the inherited problem of how a single\nscience can meet the different descriptions that Aristotle gives of\nwisdom or first philosophy, he aggravates the problem by adding more\nthings that the science must\n do.[9]\n\nIn On the Aims of the Metaphysics, Fârâbî\ntries to resolve the tension between “ontological” and\n“theological” descriptions of metaphysics (science of\nbeings universally, vs. science of God or of separate immaterial\nsubstances), and the tension between Aristotle’s mostly\n“theological” descriptions of his task and his\nmostly “ontological” practice in the\nMetaphysics, in two fundamental ways.\n\nFirst, Fârâbî takes up Aristotle’s contrast,\nin Metaphysics IV,1 and VI,1, between metaphysics and the\n“particular sciences” such as physics and the mathematical\ndisciplines, each of which takes some one genus of beings and\ninvestigates what can be said of the things in that genus. By\ncontrast, says Fârâbî,\n\n\nuniversal science is that which investigates what is common to all the\nthings that are, such as being and unity, and its kinds and its\nattributes, and things which are not accidents [proper to] any of the\nsubjects of the particular sciences, [i.e., things] like priority and\nposteriority and potency and act and the perfect and the deficient and\nwhat is like these, and the common principle of all the things that\nare: this is the thing that must be called by the name of\n God.[10]\n\n\nFârâbî says that there can be only one such\nuniversal science, because sciences are individuated by their\nsubject-domains: if there are two sciences, such that the\nsubject-domain of one includes something that is not within the\nsubject-domain of the other, then at least the second science is not a\nuniversal science; so any two universal sciences would have the same\nsubject-domain, and would therefore be the same science. So a\nuniversal science, if there is one, would be a science of being as\nsuch, and also of unity if (as Fârâbî says,\nfollowing Aristotle in Metaphysics IV,2) unity is coextensive\nwith being, and also of any attributes (more literally\n“consequences”) of being or unity, i.e., predicates that\ncan be shown to apply to every existing thing just because it exists\nor because it is one. (Since Fârâbî cites pairs like\n“the perfect and the deficient”, he apparently means to\ninclude, not just attributes that apply to all beings, but also pairs\nof attributes that apply disjunctively to all beings, in something\nlike the way that even and odd apply disjunctively to all numbers.)\nFârâbî does not argue here that there is a universal\nscience, beyond saying that “it does not belong to any of [the\nparticular sciences] to investigate what is common to all the things\nthat are”. Perhaps his view is that there is at least something\nto investigate here, namely “what, if anything, is common to all\nthe things that are?”. If that investigation yields no answer,\nor a negative answer, then there is no universal science; if we\ndiscover, for some value of P, that P belongs\nuniversally to all the things that are, then that proposition and the\narguments for it belong to the universal science, so there is a\nuniversal science. Fârâbî is not assuming that being\nis univocal and so constitutes a single genus. He says in On the\nAims that Aristotle in Metaphysics V investigates\nwhether the terms for being and its attributes are univocal or not,\nand in his Book of Letters (see \n  Section 3 below) he says that\nbeing is not univocal, but is said of substances primarily and of\nother things derivatively. So if all beings have some attribute\nP, it will be because substances are P primarily,\nand other beings are P because substances are; but this is\nstill enough for “all beings are P” to be a\ntheorem of the universal science.\n\nWe have seen that Fârâbî lists God as one of the\nthings investigated by the universal science. God is investigated by\nthe science that “investigates what is common to all the things\nthat are” because God is “the common principle of all the\nthings that are”: he belongs to all beings in common, not\nbecause he is an attribute predicated of all beings, but because he is\na cause of all beings. More precisely, he is a cause of all beings\nquâ being: that is, he is a cause, to the things that\nare, of the fact that they are, rather than of other facts\nabout them. As Fârâbî says a bit further down,\n\n\nthe divine science must enter into this science, since God is the\nprinciple of being simpliciter, not of one being as\ndistinguished from another being. And the division which gives the\nprinciple of being must be the divine science, since these concepts\nare not proper to physics but are higher than physics in generality.\nSo this science is higher than the science of nature, and\nafter the science of nature, and for this reason it should be\ncalled the science of metaphysics [lit. the science of what is after\nnature].\n\n\nHere Fârâbî is taking a stand on an issue that was\ncontroversial among Aristotelians, by saying that we do not come to\nknow God through the science of physics, even though Aristotle argues\nin his Physics 8 that the eternal circular motions are caused\nby eternally unmoved movers. Fârâbî is saying that\nthe right way to come to know God is as a cause of existence rather\nthan as a cause of motion. On the face of it, this could be taken in\ntwo ways. (a) Perhaps Fârâbî means that God is both\na cause of existence (to everything) and a cause of motion (to the\nthings that move, i.e., to bodies rather than to incorporeal\nsubstances), but that the right way to gain scientific knowledge of\nGod is to know him as the cause of existence.\nFârâbî’s reason might be that, when we know\nabout God that he is a first cause of motion (an unmoved mover), we do\nnot thereby know what God is, since what God is must\napply only to God, and there are many unmoved movers, of the many\ncircular motions in the heavens. Fârâbî’s\npoint may be that there is only one first cause of existence (although\nmany first causes of motion), and knowing about God that he is a first\ncause of existence gives us knowledge of what God is. (b) In\nfact, however, Fârâbî thinks that the first cause of\nexistence is prior to the first cause of motion in a stronger sense:\nknowing the first cause of motion does not give us knowledge of God,\nbecause God is not a cause of motion at all. On\nFârâbî’s account in the Perfect City\nand Political Regime, God is not the first of the unmoved\nmovers, but is rather a cause of existence to the unmoved movers and\nthus indirectly to everything else. So an ascent to the first cause of\nmotion does not get us to God at all, but only to some lower being:\nonly a study of the causes of being will get us to God.\n\nSo far, Fârâbî’s description of metaphysics is\nontological: theology is part of metaphysics, because theology is part\nof the study of being, namely the study of the first cause of\nexistence. This allows Fârâbî to reconcile\nAristotle’s saying in Metaphysics VI,1 that first\nphilosophy is a science of being quâ being with his saying in\nthe same chapter that first philosophy is theology. Unfortunately,\nthis solution seems to conflict with something else Aristotle says in\nthe same chapter, namely that\n\n\nphysics is about things that are inseparate but not unmoved, some of\nmathematics about things that are unmoved, but probably not separate\nbut rather existing in matter, whereas first philosophy is about\nthings that are both separate and unmoved.\n (1026a13–16)[11]\n\n\nThis seems to mean, not just that the study of things that are\nseparate and unmoved belongs to first philosophy, but that first\nphilosophy is defined as the science of things that are\nseparate and unmoved. How then is first philosophy the science of\nbeing and its universal attributes? One possible answer would be that\nfirst philosophy is by definition the science of God (or perhaps the\nscience of separate unmoved things including God), and that it studies\nbeing and its universal attributes instrumentally, because starting\nwith them and investigating their causes is the only way we have to\ncome to knowledge of God. (This might imply that those aspects of the\nstudy of being and its universal attributes which are not useful for\ndrawing conclusions about God would not belong to first\nphilosophy.) But Fârâbî gives a different answer, by\nreinterpreting what Aristotle means by “separate”. This is\nthe second way that Fârâbî tries to resolve\nthe tension between ontological and theological descriptions of\nmetaphysics.\n\nFârâbî infers from the universality of the science\nhe has described, including its investigation of God as the cause of\nexistence universally, that\n\n\nthis science is higher than the science of nature, and after\nthe science of nature, and for this reason it should be called the\nscience of metaphysics [i.e., literally, the science of what is after\nnature].\n\n\nBut, as he admits, mathematics too “is higher than the science\nof nature since its subjects are abstracted from matters”: so\nwhy doesn’t it count as metaphysics? Aristotle in\nMetaphysics VI,1 says that mathematics falls short of being\nfirst philosophy because its objects, although unchanging, do not\nexist separately but rather are thought in abstraction from the things\nthey really exist in, whereas the objects of first philosophy are not\nmerely thought in abstraction but really exist\nseparately. Fârâbî takes this up, and, like all\nancient and medieval interpreters, takes “abstraction” and\n“separation” to mean abstraction and separation from\nmatter. It makes sense to say that God exists really separated\nfrom matter and triangles don’t. But Fârâbî\nthinks that the objects of metaphysics include not only God but also\nbeing and unity. Why should being and unity be any more\n“separate” than triangles are? Here\nFârâbî reinterprets the notion of separation.\nSome of the objects of metaphysics, like God, “are\nthings that have no existence at all in natural things”. But\nothers, like being and its universal attributes, “are things\nthat exist in natural things but are imagined as abstracted from\nthem”, and are to that extent like mathematical objects; but,\nunlike mathematical objects, they\n\n\ndo not exist per se in these [natural] things in such a way\nthat their existence could not be divested from them: these are the\nthings whose subsistence is in natural things but which exist both in\nnatural things and in non-natural things.\n\n\nSo because being and its universal attributes are attributes of\nnatural things but are also attributes of separately existing\nimmaterial things, they too can be said to be “separate”\nfrom natural things and from matter.\n\nRecall that in the Enumeration of the Sciences\nFârâbî describes metaphysics as investigating three\nthings—being and its attributes, the principles of the\nparticular sciences, and separate incorporeal beings (especially\nGod)—but he does not explain why the three investigations fall\nunder a single science or what premisses the science can draw on to\nresolve the questions. In On the Aims of the Metaphysics he\ntries to explain how these investigations fit together. The science\nstarts by studying its primary subject, namely being and unity; then,\n“since the science of opposites is the same”, their\nopposites, non-being and multiplicity; then it divides being and unity\nand their opposites into their main species, or rather\nquasi-species—“quasi” because substances, qualities,\nand the other categories are each called “being” in a\ndifferent sense, whereas if being were a genus and they were its\nspecies it would be said of them all in the same\n sense.[12]\n Then the science investigates the attributes and principles of being\nand unity and their opposites,\n\n\nand these things are divided and subdivided until the subjects of the\nparticular sciences are reached, and this science terminates and there\nare manifested in it the principles of all the particular sciences and\nthe definitions of their subjects.\n\n\nBecause being and unity are not univocal, we cannot just\nstraightforwardly investigate their attributes and causes, but once\nthey have been analyzed into their different senses, we can\ninvestigate the attributes and causes of each sense of being or unity\nin the same way that any other science investigates the attributes and\ncauses of some given genus. A given effect, say substantial being, may\nhave different kinds of causes (for instance, both a formal cause and\na material cause), and these different kinds of causes may not all\nconverge on a first principle which is a cause in all these ways at\nonce (there will not be a single first principle that is both a formal\nand a material cause). Some chains of causes may proceed upwards\nad infinitum without reaching a first principle (like the\nchain of my ancestors, if the world and species within it are\neternal); and chains of causes of some kind may lead to many first\ncauses which have no further causes of that kind, rather than to a\nsingle first cause (each animal has a soul as a first formal cause\nwhich has no higher formal cause, but there will be as many such\nsouls, not a single soul which is a first formal cause of all\nanimals). Nonetheless, Fârâbî claims that there is a\nsingle first cause of all beings, which does not itself have a cause\nof any kind; if so, such a thing would deserve the name\n “God”.[13]\n If the science can show that there is such a single first principle,\nthe science would then try to deduce what this principle must be like\nin order to be a cause of all beings, and in order not to have any\nfurther cause itself, and would then try to deduce how it must acts in\norder to cause the existence of other things, some directly and others\nindirectly. Here in On the Aims Fârâbî says\nthat Aristotle does all these things in Metaphysics XII:\n\n\nThe eleventh book [i.e., Book XII, Lambda] is about the principle of\nsubstance and [thereby] of all existence, the existence [of this\nprinciple] and the confirmation that it is knowing by its essence and\ntrue by its essence, and about the separate beings which are after it,\nand about how the existence of beings depends on it.\n\n\nBut that is all that Fârâbî says here, and he never\ngives any more detailed discussion of how he thinks Aristotle does\nthis in Metaphysics XII. But Fârâbî himself\ntries to deliver on this promise in his Perfect City and\nPolitical Regime, which we will turn to after discussing his\nanalysis of being and unity and other equally universal concepts in\nhis Book of Letters and On the One and Unity.\n3. Fârâbî’s ontology: the Book of Letters and On the One and Unity\n\nFârâbî’s most widely-known and perhaps\nbest-understood work, the Principles of the Opinions of the People\nof the Perfect City, and his often similar Political\nRegime, presuppose analyses of being and unity in arguing for\nconclusions about God and his attributes and his causality; but\nFârâbî makes these analyses fully explicit only in\ntwo much less widely known and less well-understood texts, the\nKitâb al-ḥurûf = Book of Letters\nand On the One and Unity, which are intended to be read\ntogether. Both of these texts were edited for the first time by Muhsin\nMahdi, the Book of Letters in 1969 and On the One and\nUnity in 1989; only partial translations of the Book of\nLetters, and no translations at all of On the One and\nUnity, have been published in English or any western European\n language.[14]\n Both texts are difficult, and at least the Book of Letters\npresents serious textual problems; there have been few studies of\nOn the One and Unity, and most studies of the Book of\nLetters have focussed on its socio-political rather than\nmetaphysical\n sections.[15]\n So what is said here must remain tentative.\n3.1 Fârâbî’s project in the Book of Letters\n\nThe most basic questions about the Book of Letters are what,\nif anything, the treatise is about overall, and how the different\nparts of the treatise contribute to knowledge of that aim. Mahdi 1969a\ndivides the text into three “Parts”\n[abwâb]; in the manuscripts that have been studied so\nfar, the three Parts are probably not transmitted in the right order,\nsome parts of the text and perhaps in particular an introduction are\nmissing, and it is not obvious what the subject-matters of the three\nParts have to do with each other. The title Kitâb\nal-ḥurûf = Book of Letters is the same title\nby which Fârâbî in On the Aims cites\nAristotle’s Metaphysics (which presumably gets called\nBook of Letters because Arabic authors cite its individual\nbooks by the names of letters of the alphabet, just as we do now), so\nthe title suggests that Fârâbî intends this treatise\nto correspond to the Metaphysics; and there are heavy\noverlaps of content between the Book of Letters and\nAristotle’s Metaphysics, especially but not exclusively\nBook V, which make it very unlikely that the correspondence of titles\nis a coincidence. But the title Kitâb\nal-Ḥurûf can also mean something else, since\n“ḥurûf” (sg. ḥarf),\nbesides meaning “letters”, can also mean grammatical\n“particles”, i.e., any words that can neither be declined\nlike a noun nor conjugated like a verb, so pronouns and articles and\nprepositions and adverbs and\n conjunctions.[16]\n Parts I and III of the Book of Letters are organized\n“lexically” (like Fârâbî’s On\nIntelligence), around the many meanings of each of a series of\nterms, and the majority of the terms here are grammatically particles\nrather than nouns or verbs: once again, it seems very unlikely that\nthis is a coincidence. But how can the same book be Kitâb\nal-Ḥurûf both in the sense of filling the role of\nAristotle’s Metaphysics, and in the sense of being\nabout grammatical particles? And how would a study of the meanings of\nparticles (and of some selected nouns) contribute to metaphysics as\nFârâbî has described it in On the Aims? To\nsee how this could work, we have to see something about the projects\nof the three Parts of the Book of Letters and how they fit\ntogether; and we have to start with Part II, which\nFârâbî probably intended to come first, and which\ncan be taken as programmatic for the whole treatise. After discussing\nthe project of the treatise, we will focus on its most remarkable\nclaims about the different senses of being [mawjûd] and\nthe corresponding senses of existence [wujûd], and\nabout how they should be investigated, and the implications for\nmetaphysics. Finally, we will look more briefly at the corresponding\nclaims about one and unity in On the One and Unity.\n\nPart II of the Book of Letters gives an account of the\ndevelopment of the “syllogistic arts” (arts of reasoning\nsuch as rhetoric, dialectic and sophistic), culminating in\ndemonstrative science, within a given linguistic and religious\ncommunity, and their transmission from one community to another.\nFârâbî is especially interested in the\nlanguage of these arts, especially of demonstrative science.\nHe talks about the origin of language as such; but language as it\nnaturally arises is not well suited to being the vehicle of\ndemonstrative science, because it is chiefly devoted to naming and\ndescribing the objects of immediate practical interest to human\nbeings, which are not the main objects of theoretical interest. But\nnatural language can be extended in two main ways to provide the\nterminology of the syllogistic arts. First, terms of ordinary language\ncan be extended metaphorically to new meanings, and can then be frozen\nfor use as technical terms; and this process of metaphorical extension\nand freezing can be repeated indefinitely many times. Second, new\nterms can be formed from old ones by regular grammatical processes of\nmorphological derivation, and this type of extension too can be\nrepeated and combined with the first type. Special problems, however,\narise when the arts, especially demonstrative science, are transmitted\nfrom one community to another, and the translators must create a new\ntechnical vocabulary in the target-language. If the technical terms of\nthe source-text were derived by freezing metaphorically extended words\nin the source-language, the translator may try to create new technical\nterms either by imitating the metaphors of the source-language in the\ntarget-language, where they may be much less natural, or else by\nforming new terms from metaphors more natural to the target language:\neither way, there is a risk of misunderstanding.\nFârâbî talks about these problems in general, but he\ndevotes special attention to the transmission of demonstrative\nphilosophy and its vocabulary from Greek into (Syriac and thus)\nArabic.\n\nAlthough Fârâbî does not make explicit connections\nbetween the different Parts of the Book of Letters, Part II\ncan be seen as giving an implicit program for Parts I and III, each of\nwhich is organized lexically around a list of terms: in each case\nFârâbî lists the different meanings of the term,\nstarting with an ordinary-language meaning and then explaining how it\nis metaphorically extended to a series of further meanings, including\ntechnical meanings in the different arts and especially in philosophy.\nPart I treats in this way terms including the names of many of the ten\nAristotelian categories, or the interrogative particles from which\nnames of categories are derived (“kamiyya” =\nquantity is derived from “kam?” = “how\nmuch?”, and so on); it also discusses particles such as\n“from” and “because” and nouns such as\n“being”, “essence”, and\n“accident”, with a heavy overlap with the list of terms\ninvestigated in Aristotle’s Metaphysics V. Part Three\napplies the same lexical method to the four kinds of scientific\nquestion or investigation described in Posterior Analytics\nII, the questions “whether X is”, “what\nX is”, “that S is P”, and\n“why S is P”. In each of these cases\nFârâbî distinguishes the ways of investigating these\nquestions in different disciplines—for instance, how they are\ninvestigated in dialectic vs. how they are investigated in\ndemonstrative science—as if they turned on different meanings\nthat the particles, “whether” or “what” or\n“that” or “why”, have in different syllogistic\narts. There are clear connections between Parts I and III, notably\nbetween Part I on the senses of “being”\n[mawjûd] and Part III on the senses of “whether\nit is” [hal mawjûd]. Fârâbî\nevidently thinks that people have gone wrong in the sciences through\nconfusing different meanings of the terms he discusses, in particular\nthrough confusing ordinary-language meanings of these terms with\ntechnical meanings in the syllogistic arts, or confusing meanings in\none syllogistic art with meanings in another. And he thinks these\nproblems are made worse when the technical terms of these arts are\nfirst developed in one language (Greek) and then translated into\nanother (Arabic) in the ways he has described in Part II: if a word\nwhich has a meaning in ordinary Arabic (or in the technical vocabulary\nof some native Arabic art), or a word morphologically derived from\nsuch an Arabic word, has its meaning extended to serve as the\nartificial Arabic equivalent of some Greek technical term, then there\nis a serious risk that it will be misunderstood by Arabic readers.\nThis explains why Fârâbî thinks that the sort of\nwork Aristotle does in Metaphysics V, distinguishing\ndifferent meanings of a series of technical terms, would be even more\nnecessary in Arabic than it was in Greek.\n3.2 Logical and grammatical form, and the role of particles\n\nSomething more, however, is needed to explain why\nFârâbî concentrates so heavily on the meanings of\nparticles, and why he thinks (as he does) that this study\nwill lead to a scientific investigation of being and its causes.\n\nA crucial point is that Fârâbî is worried not just\nabout lexical confusions (confusions between two meanings of a term or\nbetween two similar terms), but about confusions arising from the\nmisleading grammatical form of a term: he thinks that these confusions\nhave given rise to serious philosophical errors, and he thinks that\nthe translation process has made such confusions more likely. Part I\nof the Book of Letters distinguishes between the primitive\nterms of a language and the terms derived or “paronymous”\n[mushtaqq] from them. Fârâbî takes the\nnotion of paronymy ultimately from Aristotle’s\nCategories 1 (1a12–15). A proper noun like\n“Socrates”, a common noun like “horse”, and an\nabstract accidental term like “whiteness” are all\nprimitive terms, but the concrete accidental term “white”\nis paronymous or derived from “whiteness”, not necessarily\nin the sense that it arises later in the history of the language than\n“whiteness”, but in the sense that something is called\n“white” (rather than “whiteness”)\nbecause there is a whiteness in it. Fârâbî,\nunlike Aristotle, also treats (finite) verbs as being paronymous from\ntheir infinitives, where the infinitive [maṣdar] in\nArabic is a noun expressing the action of the verb. The grammatical\nform of a paronymous term suggests that something is X by\nhaving an X-ness present in it, or V’s by\nhaving an action of V-ing in it. But sometimes the\ngrammatical form of a term misleadingly fails to track its logical\nform, and in these cases there is a risk of being deceived by what\nAristotle in On Sophistical Refutations calls sophisms of\nskhêma tês lexeôs: this is usually\ntranslated into English as “sophisms of figure of speech”,\nbut they would more accurately be called “sophisms of\ngrammatical form”, i.e., sophisms which arise because the\ngrammatical form of an expression fails to correspond to its logical\nform, and which can be solved only by diagnosing this\n discrepancy.[17]\n The Arabic translators of Greek philosophical texts, in trying to\nfind Arabic equivalents for the Greek source-terms, often use such\nawkward and potentially misleading expressions, and so do Arabic\nphilosophical texts written in imitation of the language of the\ntranslations. In particular, Fârâbî says that the\nGreek word for “being” was non-paronymous, but that some\ntranslators, not finding a good non-paronymous Arabic equivalent,\ninstead used the paronymous word, “mawjûd”,\nliterally “found”, and that this gave rise to the\ngrammatical appearance that something is existent or\n“found” [mawjûd] through an existence or\n“finding” [wujûd] present in it, as\nsomething is white through a whiteness present in it.\nFârâbî, applying a methodological principle of\ncharity, seems to assume that in each case the Greek original was free\nof such infelicities: this means that, in practice, his reconstructed\nGreek serves as an ideal logical language, i.e., a language in which\ngrammatical form always tracks logical form.\n\nWhere grammatical form tracks logical form, a non-paronymous noun will\nsignify either a substance or a being in one of the nine Aristotelian\ncategories of accidents, and a paronymous noun or a verb will signify\nthat such a being is present in or attributed to some underlying\nsubject. But metaphysics, as Fârâbî understands it,\nis not about things in the categories (Book of Letters\nI,11–17), but rather about the categories themselves (especially\nsubstance) and about trans-categorial concepts such as being, unity,\nessence, cause, and also God (who also, for Fârâbî,\ndoes not fall under any category). And where grammatical form tracks\nlogical form, these concepts will be signified neither by\nnon-paronymous nouns, nor by paronymous nouns or verbs, but by\nparticles. Particles in an ideal logical language thus correspond\nroughly to what a modern philosopher would call logical constants. And\nit is clear that Fârâbî thinks that at least some\nimportant metaphysical notions were expressed in Greek by particles,\nor by terms morphologically derived from\n particles.[18]\n As noted above, the names of many of the Aristotelian categories in\nArabic (and of some of them in Greek) either are particles or are\nmorphologically derived from particles, and the scientific questions\nfrom Posterior Analytics II, which Fârâbî\ntreats in Book of Letters Part III, are distinguished by\ntheir different interrogative words (“if/whether”,\n“what”, “why”), which in Arabic are all\nparticles. And Fârâbî may well have thought that the\nGreek original of Metaphysics V was devoted to distinguishing\nthe many meanings of particles (not just of words in\ngeneral), not in the sense that the lexical items that head each\nchapter of Metaphysics V are in all cases themselves\nparticles or even nouns morphologically derived from particles\n(although some of them\n are),[19]\n but in the sense that the many meanings of these nouns would track\nthe many meanings of some particle, as the meanings of the noun\n“cause” (Metaphysics V,2) track the meanings of\nthe particle “because”. There is in fact good reason to\nthink this is true for a reasonable number of the chapters of\nMetaphysics\n V.[20]\nMetaphysics V also discusses the categories of quantity and\nquality (V,13–14), where, as noted, the name of the category is\nderived from an interrogative word which is a particle in Arabic and\nwhich Fârâbî might well expect to be a particle in\nGreek (although in fact it is not), and the category of substance\n(V,8), where it is reasonable to say that the many meanings of\n“substance” track the many meanings of the question\n“what it is” from Posterior Analytics II and\nBook of Letters Part III, where again the interrogative word\n“what” (ti in Greek, mâ in Arabic)\nis a particle in Arabic. We can also reasonably say that the many\nmeanings of “being” (V,7, on in Greek,\nmawjûd in Arabic) track the many meanings of the\nquestion “whether it is” from Posterior Analytics\nII and Book of Letters Part III (ei esti in Greek,\nhal mawjûd in Arabic), where the interrogative word\n“whether” is a particle in both languages. More\nsurprisingly, although Fârâbî cites the Greek word\nfor “being” as astîn = estin,\nwhich is in fact the third-person singular present-tense verb\n“is”, he says explicitly that this word is not a verb and\nthat it is not a paronymous noun: his description of its functions\nimplies that it also cannot be a non-paronymous noun, and so for\nFârâbî this word must be a\n particle.[21]\n3.3 Fârâbî on the word for being, in Greek and Arabic\n\nFârâbî’s analysis of the Greek word for being\nas a particle is important in his reconstruction of the syntax of\nGreek as something close to a logically ideal language, in his\nreconstruction of the underlying logical syntax of any language, and\nin his diagnosis of the misunderstandings that can arise when the\ngrammatical form of an expression in some natural language fails to\ntrack its underlying logical form, as when the paronymous Arabic word\nmawjûd = “being” suggests that being is an\naccident. While Fârâbî gives what we can think of as\nan Arabic analogue to Aristotle’s discussion in\nMetaphysics V,7 of the many meanings of “being”,\nthe Arabic analogue focusses on several features that the Greek\noriginal does not: the paronymous form of the word\nmawjûd, the difficulties that led the translators to\ndraft the word mawjûd, literally “found”,\ninto service as an equivalent to the Greek word for being, and the\nrelation between mawjûd = “being” in the\nsense of “that which is”, and wujûd =\n“existence” or “being” in the sense of\n“the being of that which is”. Furthermore, while the use\nof mawjûd in the syllogistic arts to mean\n“being” is always a metaphorical extension from the\noriginal meaning “found”, and its use,\nFârâbî also thinks that mawjûd =\n“being” has different meanings in different\nsyllogistic arts, and in particular that it has a distinctive meaning\nin demonstrative science, contrasting with its meaning in dialectic,\nand that the paronymous form of the word, while it has some\njustification in dialectic, is more seriously misleading in\ndemonstrative science. Fârâbî thinks that bringing\nout the distinctive scientific meaning of “being”, and the\ndistinctive logical form of the word “being” as used in\ndemonstrative science, will show the path to a scientific treatment of\nbeing, based on distinctively scientific ways of investigating (for a\ngiven X) both the question whether X is and\nthe question what X is.\n\nFârâbî says:\n\n\nin all other languages [i.e., other than Arabic], such as Persian and\nSyriac and Sogdian, there is an expression which they use to signify\nall things without specifying one thing as opposed to another thing\n[i.e., it is a predicate which is true of any subject whatever], and\nthey also use it to signify the connection\n[ribâṭ, elsewhere translated\n“copula”] between the predicate and what it is predicated\nof: this is what connects the predicate with the subject when the\npredicate is a noun or when they want the predicate to be connected\nwith the subject absolutely, without any mention of time. (Book of\nLetters I,82, p.111,4–8)\n\n\nA brief summary is given below of Fârâbî’s\nview on how being is expressed in Greek and Arabic, and of the\ndifficulties faced by the Arabic translators, but for a fuller\ndiscussion see\n Supplement: Fârâbî on the word for being, in Greek and Arabic\n\n\nFârâbî assumes that Greek (like Arabic)\ndistinguishes syntactically between tensed and tenseless sentences,\nand that (unlike Arabic) it expresses the copula in both kinds of\nsentences. Because, according to Aristotle’s definition of\n“verb” in On Interpretation 3, a verb must\n“consignify a time”, the tenseless copula cannot be a\nverb. Nor can it be a noun: if to predicate one noun of another we\nmust insert a third noun between them, there will be an infinite\nregress of copulas. So the tenseless copula estin (or\nastîn), in Greek as Fârâbî\nreconstructs it, must be a particle, although there will also be\ntensed copulas which are verbs paronymously derived from this\nparticle. He also thinks that the same particle can function, not only\nin 2-place contexts, i.e., in tenseless predicative statements\n“X is Y”, but also in 1-place contexts,\ni.e., in tenseless statements of existence “X\nis”: and he assumes that this is the word that Aristotle is\ndiscussing in the chapter on the meanings of being,\nMetaphysics V,7.\n\nWe have seen that Fârâbî thinks that all languages\nother than Arabic have a word with these functions. Since\nArabic has no word that does all these things, he thinks that the\nArabic translators of Greek philosophical texts have had trouble with\nthis word, and he discusses different strategies that they have\nadopted. The most common strategy is to use the Arabic passive\nparticiple “mawjûd”, literally\n“found”, as a tenseless “is” in both 1-place\nor 2-place contexts, and to use passive forms of the verb\n“wajada”, “find”, for the tensed\n“is” and “was” and “will be”. The\ndisadvantage of “mawjûd” is that then the\nArabic word for “is” or “being”, unlike the\nGreek word it translates, is grammatically paronymous, so that its\ngrammatical form does not correspond to its logical form:\n\nthe expression “mawjûd” is, in its first\nimposition in Arabic, paronymous, and every paronymous term by its\nconstruction gives the impression that there is in what it signifies\nan implicit subject and, in this subject, the meaning\n[ma‛nâ] of the maṣdar [the\ninfinitive, functioning in Arabic as an abstract noun] from which [the\nterm] was derived [i.e., as “white” implies, without\nexplicitly mentioning, a subject in which whiteness is present]. For\nthis reason the expression “mawjûd” has\ngiven the impression that there is in every thing a meaning/entity\n[ma‛nâ] in an implicit subject, and that this\nmeaning/entity is what is signified by the expression\n“wujûd” [“finding” or\n“being found”]: so it gave the impression that\nwujûd is in an implicit subject, and\nwujûd was understood as being like an accident in a\nsubject. (Book of Letters I,84, p.113,9–14)\n\nThere is thus a grammatical appearance that X exists or is a\nbeing (“X mawjûd”) through an\naccident of existence or beingness which inheres in X, or an\nact of finding X; and Fârâbî thinks that\nthis appearance gives rise to serious metaphysical errors. His account\nof the logical syntax of being in the Book of Letters is\ndesigned to expose and root out these errors. In particular, it will\nfunction as a critique of anyone who wants to understand God as\nsomething like a Platonic form of being, so that other things would\nexist by participating in this form. (Averroes, later, will adapt\nFârâbî’s account of the logical syntax of\nbeing to give a criticism of Avicenna’s distinction between\nessence and existence, see Menn 2011.) But Fârâbî\nalso wants to give the ontological foundations for a positive\nmetaphysical account of God, which he thinks Aristotle was aiming at\nin Metaphysics XII and which he will try to reconstruct in\nhis Principles of the Opinions of the People of the Perfect\nCity and his Political Regime (see\n Section 4\n below).\n3.4 Fârâbî on the senses of being [mawjûd] and the corresponding senses of existence [wujûd]\n\nWe might expect Fârâbî to say that the paronymous\nform of the Arabic word for being or “exists”\n[mawjûd] is a mere grammatical accident and that there\nis no such thing as the existence [wujûd] through which\nthings exist. Instead he distinguishes (at least) two senses of being\n[mawjûd], each applicable in both 1- and 2-place\ncontexts, and says that in each case there is a corresponding sense of\nexistence [wujûd]. But he thinks that only a conflation\nbetween these two senses of being would lead us to believe that a\nbeing X exists through an existence which is both independent\nof the mind and extrinsic to the essence of X.\nFârâbî tries to connect these two main senses of\nbeing with differences in how the term “being” is\nunderstood in different disciplines, specifically in dialectic and\ndemonstrative science, and with differences in how dialectic and\ndemonstrative science investigate the questions whether X is\nand what X is, which Fârâbî discusses in\nBook of Letters III in connection with the particles\n“whether” and “what”. His discussion is\ncomplicated and difficult, but some of his main points seem to be as\nfollows.\n\nFârâbî in Book of Letters I,88–94\ndescribes the different senses of being [mawjûd] and\nthe corresponding senses of existence [wujûd],\nconcentrating on 1-place\n contexts.[22]\n Aristotle in Metaphysics V,7 distinguishes four main senses\nof being (giving mostly 2-place examples), in some cases with\nsub-senses: being per accidens, being per se (with\nsubsenses corresponding to the different categories), being as the\ntrue, and being in actuality or potentiality. Fârâbî\nhas nothing in I,88–94 corresponding to being per\n accidens,[23]\n and his treatment of the other main senses of being corresponds only\nroughly to Aristotle’s—of course, his treatment is longer\nand more detailed, and includes the discussion of existence\n[wujûd], which does not correspond to anything in\nMetaphysics V,7. Fârâbî starts in I,88 by\ndistinguishing three main senses of being, namely the sense of being\nwhich is divided into different senses for the different categories\n(pp.115,15–116,3), being as the true, i.e., what “is\noutside the soul and is in itself [bi-‛aynihi] as it is\nin the soul” (p.116,3–6), and being as what is\n“circumscribed [munḥâz] by some quiddity\noutside the soul, whether it has been represented in the soul or has\nnot been represented” (p.116,6–7). But in I,90 he says\nthat these three senses of being can be reduced to two, “that it\nis true and that it has some quiddity outside the soul”\n(p.117,18–19). In this discussion Fârâbî is\ngiving his interpretation of two of Aristotle’s four senses of\nbeing, being per se and being as the true. (Later, in\nI,93–94, he discusses being in actuality and potentiality, but\nonly as a subdivision within being as what has a quiddity outside the\nsoul, and it does not seem to play a large role in the Book of\nLetters.) In I,89, starting from the I,88 enumeration of three\nmain senses of being, he discusses what kind of existence\n[wujûd] corresponds to each of these senses of being\n[mawjûd]; and in I,92 he tries to show that being as\nwhat has a quiddity outside the soul (unlike being as the true) is\nsaid not univocally, but of some things in more primary senses and of\nother things in derivative senses, across different categories and\neven within the category of substance.\n\nClearly the foundation of Fârâbî’s account of\nbeing is his distinction between being as the true and being as what\nis circumscribed by a quiddity outside the soul. It is not immediately\nobvious what he means by this distinction, and there is no obvious\nprecedent, either in Greek or in Arabic, for his notion of\n“circumscription”. At first blush, “being outside\nthe soul and in itself as it is in the soul” and “being\ncircumscribed by some quiddity outside the soul” (or\n“having some quiddity outside the soul”) sound similar,\nalthough it is clear that Fârâbî wants them to be\nvery different. We might guess that the main difference is something\ncan have a quiddity outside the soul even if it is not represented in\nthe soul (as Fârâbî notes p.116,7); and in this\nsense Fârâbî says that “whatever is true is\nalso circumscribed by some quiddity outside the soul” (I,91\np.117,20). But the deeper difference is that while “being\ncircumscribed by some quiddity outside the soul” is predicated\nof an external object, being in the sense of “true”, i.e.,\n“being outside the soul as it is in the soul”, is\npredicated of something in the soul, and asserts that what is in the\nsoul has something outside the soul corresponding to it. So in I,89,\nin discussing the kinds of existence [wujûd]\ncorresponding to each sense of “being”\n[mawjûd], Fârâbî says that “the\nexistence [wujûd] of what is true is a certain relation\nwhich\n thoughts[24]\n have to something outside the soul” (p.117,4–5).\nFârâbî is explicit that being in the sense of\n“true” applies not only to the soul’s judgments but\nalso to its concepts (I,88 p.116,3–5): to say of a concept that\nit “is” in the sense of “is true” is to say\nthat it is instantiated. Fârâbî is apparently the\nfirst person to have said that existence, in one sense of existence,\nis a second-order predicate or second-order concept, a concept that is\npredicated only of concepts; but, unlike Frege, he understands\nconcepts psychologistically, as mental\n states.[25]\n\nDespite Fârâbî’s saying in I,91 (cited just\nabove) that being-as-having-a-quiddity-outside-the-soul is more widely\nextended than being-as-true, it emerges from his later discussions\nthat, taking “quiddity outside the soul” in a strict\nsense, having a quiddity outside the soul is more demanding,\nand that we must first ask whether something is in the sense\nof true, i.e., whether a given concept is instantiated outside the\nsoul, and only then, if the answer is yes, ask whether what\ninstantiates it is also circumscribed by a quiddity outside the soul.\nIf a concept is not instantiated outside the soul, such as (for\nAristotle and Fârâbî) the concept of vacuum, then,\nwhile there vacuum has a quiddity-in-an-extended sense, since we can\nask “what is vacuum?” and answer the question by giving an\nexplanation of the name “vacuum”, a so-called\n“nominal definition” which identifies what concept the\nword “vacuum” stands for, nonetheless vacuum has no\nquiddity in the proper sense, and certainly no quiddity outside the\nsoul (I,91 p.118,4–9). Even after we have determined “that\nwhat is understood by the expression is the same outside the\nsoul”, we can still ask “does it exist [hal\nmawjûd] or not?”, meaning now not “is it\ntrue?” but rather “does it have some thing by which its\nconstitution [qiwâm] [is] and which is present in\nit” (III,229\n p.214,4–9).[26]\n This will be “one of the causes of its existence”, so\nthat “our saying ‘does the thing exist?’ in the\nsecond way” is equivalent to “does it have a cause by\nwhich its constitution [is] in its essence?” (III,229\np.214,11–13). For\n\n\nnot everything which is understood by some expression, such that what\nis understood by it is also outside the soul, is such that it also has\nan essence: like the meaning of “privation”, for it is a\nmeaning which is understood, and it is outside the soul as it is\nunderstood, but it is not an essence and does not have an essence.\n(III,240 p.218,12–15)\n\n\nExamples of concepts which are instantiated, but whose instantiations\nare not circumscribed by a quiddity, might include on the one hand\nnegations like not-a-horse or privations like blindness, and on the\nother hand beings per accidens, i.e., accidental combinations\nlike white horse. Each of these will have a nominal definition which\nidentifies what concept the name stands for, but it will not have a\nreal definition expressing a real quiddity, “the thing by which\nits constitution [is] and which is in it”: things can be\nnot-horses or blind through many different positive causes, and a\nwhite horse will have a cause of being white and a cause of being a\nhorse, but no one cause that constitutes it as a white horse.\n\nIn Book of Letters I,88–90 Fârâbî\ndescribes not only the different senses of “being\n[mawjûd]”, but also the corresponding senses of\n“existence [wujûd]”, i.e., that through\nwhich a mawjûd in each sense is mawjûd.\nAs we have already seen, “the existence [wujûd]\nof what is true is a certain relation which thoughts have to something\noutside the soul” (p.117,4–5). The existence\n[wujûd] of something which is a being\n[mawjûd] in the sense in which being is divided into\nthe categories will just be the category under which that thing falls,\nwhich licenses calling it a being. Fârâbî’s\ntreatment of the existence [wujûd] of something which\nis a being [mawjûd] in the sense of being circumscribed\nby some quiddity outside the soul depends on whether it is a complex\n(divisible) or a simple (indivisible) quiddity.\n\n\nAs for that whose quiddity is divisible, three [kinds of] things are\nsaid to be its quiddity: (i) its unarticulated whole, (ii) [its whole]\narticulated by the parts by which its constitution [is], (iii) each of\nthe parts of the whole, each of them through [?] the whole in turn.\nIts whole is what its name signifies, and what is articulated by its\nparts is what its definition signifies, and each of its parts is genus\nand differentia, each in turn, or matter and form, each in turn. (I,88\np.116,8–13)\n\n\nThe existence [wujûd] of a being\n[mawjûd] circumscribed by a complex quiddity, but not\nof a being circumscribed by a simple quiddity, can therefore be\ndistinguished from the being itself:\n\n\nin the case of what is divided so that it has a whole and the\narticulated [result] of this whole, the being [mawjûd]\nand the existence [wujûd] are different: the being is\n[the thing] as a whole (this is the possessor of the quiddity) and the\nexistence is the quiddity of this thing, either articulated or each of\nthe parts of the whole, either its genus or its differentia, and since\nits differentia is more proper to it, [the differentia] is more\nappropriately called the existence which is proper to it. (I,89\np.117,1–4)\n\n\n(Fârâbî adds that since the existence\n[wujûd] of something which is a being in the sense of\nfalling under a category is the category or highest genus under which\nit falls, this will also be its existence as a part of its quiddity,\nso that being in the sense of falling under a category reduces to\nbeing in the sense of having a quiddity, and the initial three senses\nof being reduce to two, I,89 p.117,5–8 and I,90\np.117,14–19.) By contrast, “everything whose quiddity is\nindivisible either is a being which does not exist [yakûna\nmawjûdan lâ yûjadu]”—because the\nfinite verb “exists” is paronymous and would imply that\nexistence belongs to it as an accident—“or else the\nmeaning of its existence and that it exists [maʿna\nwujûdihi wa-annahu mawjûdun] are one and the same,\nand that it is an existence [wujûd] and that it is a\nbeing [mawjûd] are one and the same meaning”,\nsince its existence [wujûd] is not a further entity\nexplaining the fact that it is a being [mawjûd], but is\njust that being, which is simple and not explained by any further\ncause to explain it (I,89 p.117,8–10). This will be true both of\neach of the categories or highest genera (each category is an\nundefinable highest genus, and not a composite of being as a genus and\nsome differentia added to being), and of “whatever is not in a\nsubject and is not a subject of anything at all, for it is forever\nsimple in its quiddity” (I,89\n p.117,10–13).[27]\n\nIn all of this Fârâbî is broadly following the\nAristotelian idea that, for any composite object X, we can\nask “what is X?” and answer the question either\nby giving a definition of X spelling X out into many\nin-some-sense-constituents of X, or by giving some one such\nconstituent of X, which is a partial answer to\n“what is\n X?”.[28]\n Fârâbî is also following Aristotle in insisting\nthat all of the things which should be mentioned in the definition of\nX are causes of X’s being (“the thing by\nwhich [X’s] constitution [is]”), and,\nfurthermore, essential causes, in the sense that it is not simply that\nsome instance of X happens for this reason, but that a thing\nwouldn’t be X if it weren’t caused in this way:\naccording to Aristotle in Metaphysics VIII,4, a scientific\ndefinition of X should mention all and only such causes of\nX. He is also following Aristotle in saying that this process\nmust come to a stop with simples, where there will be no further\ndefinition and no distinction between the thing and any further answer\nto “what is it?”. He also follows Aristotle further down,\nin Book of Letters III,244, in saying that in asking for the\ncause of X’s being, we cannot look for a middle term\nbetween the subject and predicate of “X is [X\nmawjûd]”, or between the subject and predicate of\n“X is X”. Rather, we must unpack this\njudgment so that its subject and predicate are different, so that we\ncan seek a middle term connecting them (“why are there\neclipses?” might be unpacked as “why is the moon\neclipsed?” or “why is the moon darkened at\nopposition?”): if X is simple, so that\n“X is” cannot be unpacked into a judgment with\ndistinct subject and predicate, then there is no further investigation\ninto why X is, and therefore also not into what X\n is.[29]\n But Fârâbî is putting all of this in the service of\nan argument which has no direct parallel in Aristotle, that, contrary\nto the linguistic appearance of the paronymous term\nmawjûd (being or existent), a thing does not exist\nthrough an accident of existence [wujûd] as it is white\nthrough an accident of whiteness (so I,84, p.113,9–14, cited\nabove). If we say that X exists [mawjûd] in\nthe sense that X is true, then the existence\n[wujûd] of X is not an attribute of the real\nthing X outside the mind, but only an attribute of the mental\nconcept of X, namely, that that concept is instantiated\noutside the mind. If we say that X exists\n[mawjûd] in the sense that X is circumscribed\nby a real quiddity, then the existence [wujûd] of\nX is that quiddity: either it is the whole essence of\nX as spelled out by its definition, or it is some part of the\nessence of X, or if X is simple it is just\nX itself, but in no case is it an accident of X.\n(Fârâbî also says similar things about two-places\nuses of mawjûd as a tenseless copula “X\nis Y”: particularly in I,101 he argues that\n“X is Y” has a sense which does not\nassert, e.g., that the quiddity of X is to be Y, or\nthat either X or Y have real quiddities outside the\nmind. What it asserts is something like two-place being-as-truth, but\nFârâbî says that such a sentence need not assert\nthat something is outside the mind as it is in the mind,\nsince in some “X is Y” is true although\nneither X nor Y exists outside the mind.)\n\nFârâbî’s distinction between being-as-true and\nbeing-as-having-a-quiddity-outside-the-mind also allows him to resolve\nthe issue about whether being is univocal or whether it is said of one\nthing (or of one kind of thing) primarily and of other things in a\ndependent and derivative sense. Looking only at one-place cases,\nbeing-as-true must be univocal to beings in all categories, and also\nto beings in no category such as negations or privations and beings\nper accidens like white horse. For I must be able to ask\n“is the concept of X instantiated?” before I know\nwhat category the instances of X will fall under, or even\nwhether X will turn out to be merely a privation, or an\naccidental combination of two positive entities. (If X is\neclipse, we might reasonably start by keeping many of these options\nopen: only the investigation of actual eclipses, if it turns out that\nthere are some, will determine which option is right.) By contrast,\n“what has a quiddity outside the soul, although [being in this\nsense] is general, is said by priority and posteriority in\norder” (I,92 p.118,14–16), since if the quiddity of\nX involves a reference to Y as the cause of\nexistence to X, then Y has a prior and stronger\nclaim than X to have a quiddity outside the soul, rendering\nit capable of independent existence. First, substances will be prior\nin this way to accidents, since for an accident to be is for it to\nbelong to a substance, and the scientific definition of any kind of\naccident will mention the kind of substance that it can be predicated\nof. But then, within the category of substance, “what requires a\ndifferentia or genus in this category in order for its quiddity to be\nrealized is more deficient with respect to quiddity than the thing in\nthis category which is a cause of the realization of its\nquiddity”, and by pursuing causes of quiddities in this way we\ncan come to some first substance, “whether this is one or more\nthan one”, which has a stronger claim to the title of\n“being” than all other substances, and a fortiori\nthan accidents (I,92 pp.118,18–119,4).\n\n\nAnd if something is discovered outside all these categories which is\nthe\n cause[30]\n of the realization of the quiddity of the most\n fundamental[31]\n thing in this category [i.e., the category of substance], then this\n*is more deserving to be called “being”\n[mawjûd] than the most perfect thing in this category,\nand this is the first cause of existence [wujûd] to the\nmost perfect thing in this category, and this most perfect thing [sc.\nwithin the category of substance] is the cause in the quiddity\n of*[32]\n the other things in this category, and what is in this category is\nthe cause in the quiddity of the other categories: thus the beings,\nwhere what is meant by “being” is what has a quiddity\noutside the soul, are ordered by this order. (I,92\np.119,4–8)\n\n\nIt was traditional enough to say that God (and only God) is being in\nthe strictest sense, and is the cause of existence to all other\nbeings. But Fârâbî’s version is importantly\ndifferent. Fârâbî is taking up Aristotle’s\nprogram of defining each thing through its essential cause, and\narguing that this kind of cause of X’s existing (such\nthat something would not be an X if it were caused in some\nother way) is the existence [wujûd] of\nX and has a stronger claim to the title of being\n[mawjûd] than X: if this causal chain leads\nultimately to God, so that God is ultimately involved in the quiddity\nof each other thing, then Fârâbî will have a\nscientific Aristotelian way of filling in the program of the Aims\nof the Metaphysics, of showing how an analysis of being and of\nits causes (once we grasp the relevant senses of being and of cause)\nwill lead to God as the first cause of being and universal first\nprinciple. As this is presented in the Book of Letters, it is\njust a program for research, which might or might not lead up to a\nsingle first cause of existence from which all other beings can be\nderived carried out. But in the Perfect City and the\nPolitical Regime Fârâbî gives at least a\nsketch of the upward causal argument to God as a single first cause of\nexistence, and of the downward path from God to all other beings.\nFârâbî sees a charter for this causal investigation\nof the existence of thing especially in Aristotle’s\nPosterior Analytics II.\n3.5 Fârâbî on the scientific questions about being\n\nFârâbî further develops the discussion of the\nrelation between a being and its existence, in different senses of\n“existence”, in Book of Letters III. Here he is\nofficially continuing the discussion of particles by explaining the\nmeanings of various interrogative particles in different\n“syllogistic arts”: the main interest is to explain the\ndistinctive meanings these particles have in demonstrative science,\nand to warn against confusing them with the meanings they have in\nother disciplines. This resembles the discussion in Book of\nLetters I, but the particles (and “logical” particles\nwhich are grammatically nouns in Arabic) discussed in Book of\nLetters I correspond roughly to those discussed in\nAristotle’s Metaphysics V; Book of Letters\nIII, by contrast, picks up issues from Posterior Analytics\nII. There Aristotle discusses the different kinds of scientific\n“question” or “investigation”\n[zêtêsis], and he specifies each one by an\ninterrogative particle (“whether”, “what”,\n“why”). But Aristotle is interested mainly in the methods\nthe scientist uses to answer these questions; nobody before\nFârâbî had thought there was a distinctive\nscientific meaning of the particles themselves. But Aristotle does\ntalk about how the scientist should investigate whether something is,\nwhat something is, and why something is, and Fârâbî\ntakes this discussion as giving not just a methodology but a\nscientific account of existence and quiddity, i.e., of the scientific\nmeanings of the particles “whether” and\n“what”.\n\nAristotle discusses there four types of scientific question or\ninvestigation, “whether X is”, “what\nX is”, “whether X is Y”,\nand “why X is Y”. His main claim is that\nthe investigation what X is stands to the\ninvestigation whether X is, as the investigation\nwhy X is Y stands to the investigation\nwhether X is Y. So in order to determine\nwhat X is, we must first investigate\nwhether X is, and then, if the answer is yes,\ninvestigate why X is. An answer to why\nX is can be converted into a scientific answer to\nwhat X is; where to discover why X\nis, we must reformulate the judgment “X is” as a\ntwo-place judgment with distinct subject and predicate terms, and then\nlook for a middle term connecting them. In the standard example, if\nX is (lunar) eclipse, before we can scientifically\ninvestigate what eclipses are, we must first investigate whether there\nare eclipses; if there are, and if the nominal definition of (lunar)\neclipse is “darkening of the moon at opposition”, then we\ninvestigate why the moon is sometimes darkened at opposition; and if\nwe conclude that this is due to the interposition of the earth between\nthe moon and the sun, we can convert this into a scientific definition\nof eclipse as “darkening of the moon at opposition due to the\ninterposition of the earth between the sun and the moon”.\nFârâbî takes all this up in Book of Letters\nIII,226 and following, under the headings of the scientific meanings\nof the particles “whether”, “what”, and\n“why”: or rather, when he says “whether X\nexists” (or “does X exist?”, hal\nX mawjûdun), both the word\n“whether” and the word “exists” are logically,\nif not grammatically, particles. Fârâbî follows\nAristotle in saying that there is an ordered series of questions or\ninvestigations: first we must ask whether X exists,\nand only then, if the answer is yes, can we ask what\nX is, by asking why X exists. But\nFârâbî’s story is more complicated than\nAristotle’s, because he distinguishes different senses both of\n“whether X exists” and of “what X\nis”. Fundamentally, Fârâbî thinks that there\nis a series of four questions: first “what X is”\nseeking the nominal definition of X, which spells out the\nconcept of X in the soul; then “whether X\nis” in the sense of being-as-the-true, asking whether X\nexists outside the soul as it does in the soul; then “whether\nX is” in the sense of being as having a quiddity\noutside the soul, asking rather “does it have some thing by\nwhich its constitution [qiwâm] [is] and which is\npresent in it” (III,229 p.214,6–7, cited above); then\n“what X is” seeking the quiddity of X\noutside the soul, namely this thing present in X which is the\ncause of X’s constitution. The Posterior\nAnalytics has nothing corresponding to the distinction between\nthe two “whether X is” questions, but\nPosterior Analytics II,2 does say that when we\nask/investigate whether X is Y, or whether\nX is, we are asking “whether there is a middle\nterm for it”, and that when we then ask/investigate why\nX is Y, or what X is, we are\nasking “what that middle term is” (89b37–90a1). And\nFârâbî argues that this requires a distinctive\nmeaning of “is” in the question “whether X\nis”, since X could exist in the sense that it is\noutside the soul as it is in the soul, without there being a middle\nterm between some subject and some predicate which would cause\nX’s existence. There are at least two ways this could\nhappen. First, if X is a privation or even\n“privation” in general (see III,240 p.218,12–15,\nquoted above), or presumably also if X is an ens per\naccidens like white horse, there simply is nothing outside the\nmind by which X is constituted. Second, if X has/is\na simple quiddity, then “X is” cannot be\nexpanded into a sentence “Y is Z” where\nthere might be a middle term between the subject and the predicate. So\nonce we have established that X exists outside the soul, we\nmust still investigate whether X is constituted by some cause\noutside the soul, and then what that cause is.\n\nFârâbî takes this result as indicating that\ndialectic and demonstrative science give different meanings, not only\nto the “what is X?” question and thus to quiddity\n(dialectic seeking a nominal definition, science a causal definition),\nbut also to the “whether X is” question and thus\nto existence. So he says that, as in dialectic the two-place\ninvestigation “whether X is Y” is only\nconcerned with the copula (not with whether it is essential\npredication), so in dialectic the one-place investigation\n“whether X is” is asking only about being as the\ntrue, i.e., about whether the concept of X is instantiated\n(III,246–7). He connects this with an inherited problem in\nAristotle’s dialectic: in the Topics Aristotle\nclassifies dialectical problems as asking whether Y is an\naccident of X, whether Y is the genus of X,\nwhether Y is proper to X, or whether Y is\nthe definition of X—so how should we treat the question\nwhether X exists? As Fârâbî says, Alexander\nof Aphrodisias in his commentary on the Topics classifies\nquestions of existence as questions of accident, treating the\nexistence of X as an accident of X. And\nFârâbî says that he is right to do so, since\ndialectic is asking whether the concept of X in the mind is\ninstantiated outside the mind, and this belongs as an accident to the\nconcept of X. However, if we mean whether the real thing\nX outside the mind is constituted by some quiddity, or\nwhether X falls under one of the categories, then we would be\nasking whether something belongs to X as its genus or\ndefinition. Fârâbî also says that different\nparticular sciences give different meanings to these questions.\nNotably, in physics the questions “whether X is”\nand “what X is” are asking for any kind\nof cause of X’s existing, whether that cause is\ninternal to X or not (III,237)—it could be an extrinsic\nefficient or final cause, like the earth blocking sunlight from\nreaching the moon, which would be incorporated into a physical\ndefinition, as in this case of eclipse. Most importantly, in\n“the divine science”, if we ask whether God is,\nand if we mean by this whether there is some cause through which God\nis\n constituted,[33]\n then while this is a legitimate question the answer can only be no\n(III,238–9 and III,243). Nonetheless, we can still ask of God\n“whether he is some circumscribed essence” (III,240,\np.218,11), and we can discover that he is, not because we can give a\ndefinition analyzing that essence into simpler terms, but because in\nanalyzing other beings and seeking their causal definitions, tracing\nthem back step by step to their causes, we discover that they all lead\nultimately to a single first cause of their existence, so that God\nenters into the fully spelled out quiddities of everything else\n(III,251). Because we learn in this way that God is simple and\ndependent on no cause, we can ask “whether his existence is an\nexistence which, in order for him to exist through it, needs nothing\nother than itself in any way” (III,242 p.220,1–2), neither\na substratum nor an efficient cause, and the answer is yes. So too in\nthe divine science, if we ask “whether God is X”\nfor some predicate X (whether God is an intelligence, is\nknowing, is one, is a maker or cause of something else’s\nexisting, III,242 p.220,2–5), and if we mean by that\n“whether there is a middle term for it” as Posterior\nAnalytics II,2 suggests, i.e., a cause to God of his being\nX, such as an accident inhering in God, or a part of\nGod’s essence distinct from the whole essence, then again the\nanswer can only be no. But we can also mean\n\n\nwhether the existence by which his constitution is not by anything\nother than he, is that he is intelligence and knowing, and whether his\nessence is that he is intelligence,\n\n\nand in asking whether he is the cause or agent of something\nelse’s existing we can mean\n\n\nwhether his existence by which he is existent, or his quiddity which\nspecifies him, or which belongs to him, necessitates that he is a\ncause of the existence of something other than he, or the maker of\nsomething other than he. (III,242 p.220,3–6)\n\n\nAnd again we discover, by tracing back the causes of things to a first\ncause which needs nothing beyond itself to know and to produce, that\nthe answer is yes. This text is a charter for the theological parts of\nthe Perfect City and Political Regime, discussed in\n Section 4\n below.\n3.6 On the One and Unity: senses of unity, different relations between one and many, and the circumscription of a thing by its quiddity\n\nTo Fârâbî’s “general\nmetaphysics”—his study of being and its universal\nattributes, rather than of God as the first cause of\nbeing—belongs not only the Book of Letters but also\nOn the One and Unity. Fârâbî in On the\nAims of the Metaphysics had included unity alongside being in the\nobject of metaphysics; and when Book of Letters I follows the\nagenda and many of the subject-headings of Aristotle’s\n“lexicon” in Metaphysics V, it is strange that it\nleaves out unity, which Aristotle treats in Metaphysics V,6.\nBut the treatment of unity, missing from the Book of Letters,\nis supplied by On the One and Unity [henceforth On the\nOne]. Since the Book of Letters as is incompletely\ntransmitted, it is not entirely out of the question that On the\nOne is a missing part of the Book of Letters. Perhaps\nmore likely, On the One was originally intended as a part of\nthe Book of Letters, but got too long and complicated, and\nwas spun off as a separate treatise. The treatise is too complicated\nand too little-studied (with major editorial problems) to treat here\nin full detail, but we can describe some major themes. The treatise is\nhelpful in understanding the notion of circumscription by a quiddity,\nwhich is thematized both in the Book of Letters and On\nthe One and used without explanation in the Perfect City\nand Political Regime, and also in understanding\nFârâbî’s explanation of Aristotle’s\nclaim in Metaphysics IV,2 that being and unity are\ncoextensive and mutually entailing, and his account in the Perfect\nCity and Political Regime of how unity is predicated of\nGod.\n\nMain themes of the treatise include distinguishing a whole family of\nsenses of “one” (in a few cases Fârâbî\nalso gives the corresponding senses of the abstract\n“unity”), but also and especially distinguishing different\nways that senses of “one” are related to senses of\n“many”. The treatise can read like a dry catalogue, and\nFârâbî rarely gives arguments or admits that his\nclaims might be controversial, but it is often clear that he has an\nopponent in mind. That opponent might be a type rather than a\nparticular earlier philosopher, but it seems likely that it is\nspecifically al-Kindî. Kindî had argued in On First\nPhilosophy that any thing other than God that is called\n“one” is many as well as one, and therefore that it is one\nnot essentially but only accidentally, indeed that it is one only\nimproperly or “metaphorically”; and he argues that such a\nthing can be one only through participation in some unity extrinsic to\nit, which (to avoid infinite regress) must be purely one and not also\nmany. Kindî also argues that any many is a collection of ones:\nand since everything is either one or many, and any many depends on\nones, and any one depends on a pure one, and God is the only\npure one, everything owes its existence directly or indirectly to God.\nWhile Kindî, like Fârâbî, gives a long list of\ndifferent kinds of things that can be said to be one, and while he has\ndifferent reasons for disqualifying each of them from being a pure\none, i.e., a one that is not also many, typically he seems to think\nthat each of these senses of “one” is predicated of some\nsubject which is many, so that if the unity were removed, that\nunderlying multiplicity would remain. Kindî infers that each of\nthese ones is a many-that-is-one, and therefore that it has contrary\nattributes, and therefore that it is not essentially one, and even\nthat it is only metaphorically one, since (as he argues in a tradition\ngoing back to Zeno of Elea and to the first Hypothesis of\nPlato’s Parmenides) for something to be truly one is\nfor it not to be many in any way, e.g., by having many\n constituents.[34]\n\nFârâbî by contrast maintains, following Aristotle in\nMetaphysics IV,2, that unity is coextensive with being, and\nthat both “one” and “being” are truly and\nproperly said of many things. Indeed, Fârâbî claims,\nnot just that these many things are each truly being and truly one,\nbut that they are essentially so, i.e., that they are not\nbeing and one [mawjûd, wâḥid]\nthrough an existence or unity [wujûd,\nwaḥda] which is accidental to them or extrinsic to\ntheir quiddity, as something is white through an accident of\nwhiteness. There are senses of being, notably being as the true, in\nwhich existence is accidental, but in the primary sense of being, and\nthe sense of primary interest to the metaphysician, the things’s\nexistence is its quiddity or part of its quiddity; and so too,\nFârâbî claims, for the unity corresponding to the\nsense of “one” of primary interest to the metaphysician,\nwhich is convertible with this sense of “being”. In order\nfor Fârâbî to deflect Kindî’s arguments\nagainst the claim that there are many things that are each truly and\nessentially one, it is crucial for him not only to distinguish\ndifferent senses of “one”, but also to distinguish\ndifferent ways that senses of “one” can be related to\nsenses of “many”. Fârâbî distinguishes\nbetween a many that is the subject of a one, a many that is\nopposite to a one, and a many that arises from a\none. When Fârâbî says that some sense of\n“many” is the opposite of some sense of\n“one”, he apparently means that these kinds of unity and\nmultiplicity are contraries or that one of them is the privation of\nthe other. When he talks about a many that arises from a one,\nhe seems to mean what Aristotle calls a many that is “measured\nby” a one, i.e., a many composed out of ones of this type, so\nthat the one or unit can be used to count the many. (Aristotle says in\nMetaphysics X that in this kind of one-many\nrelationship the unity and the multiplicity are correlatives,\nas the measure and the measured, whereas when one and many are related\nas indivisible and divisible, unity as indivisibility is a\nprivation of multiplicity as divisibility. Or perhaps he\nreally means that, although from the point of view of our language and\nour concepts divisibility is the more basic and indivisibility is its\nprivation, in reality indivisibility is basic and divisibility is its\nprivation. In Aristotle’s terminology, possession and privation\nare one kind of opposites, contraries are another, contradictories are\nanother, and correlatives are yet another. But\nFârâbî apparently does not count correlatives here\nas opposites.)\n\nFârâbî grants to his implicit opponent that some\nsenses of “one” do presuppose a many as their subject, so\nthat if the one were removed the many would remain. There are\ntwo-place senses of “one”, as there are two-place senses\nof “being”: for instance, we can say “X and\nY are one in species”. Or perhaps it is better to say,\nnot that these are two-place senses of “one”, but that\nthey are plural-subject senses, since we can equally well say\n“X and Y and Z are one in\nspecies”. In any case Fârâbî grants that there\nare several senses of “one” which presuppose a many as\ntheir subject. Perhaps surprisingly, Fârâbî includes\nhere not only “one in species” and the like but also\n“one in number”: he thinks that the appropriate expression\nis not, e.g., “Aristotle is one in number” but\n“Plato’s best student and Alexander’s teacher are\none in number”. Also perhaps surprisingly, he tries to trace\nback the other plural-subject senses of “one” to\n“one in number”, saying for instance that if X\nand Y are one in species, then the species of X and\nthe species of Y are one in number (#1–#8).\nFârâbî also grants that there are some senses even\nof the one-place predication “X is one” which\npresuppose, not a plural subject, but still a subject consisting of\nmany parts, so that for X to be one is for X’s\nparts to be related in an appropriate way. For instance, for\nX to be one as continuous is for X to have parts\nwhose limits are the same; for X to be one as contiguous is\nfor X to have parts whose limits, while not the same, are\nkept in contact by some bond; for X to be one as whole as for\nX to have all the parts it needs in order to perform its\nactivity well (#9–#15). But Fârâbî says that\nwhere many things are said to be one, or where something is said to be\none in a way presupposing that it has many parts, this sense of\n“many” and this sense of “one” are not\nopposite: nothing is predicated of its opposite. Thus the opposite of\none-in-number is many-in-number, but the subject of one-in-number is\nmany names or descriptions of the same thing; the opposite of\none-as-continuous is discretely many things disconnected from each\nother, but the subject of one-as-continuous is magnitude.\nFârâbî insists equally emphatically that there are\nsenses of “one” that are not plural-subject senses and do\nnot presuppose a subject with many parts, and indeed in some cases\ncontradict having a subject with many parts. One sense of\n“one” is as “undivided” or\n“indivisible” (the Arabic phrase, like the Greek word, is\nambiguous between these two construals). Or perhaps rather, as\nFârâbî suggests at the end of the treatise, all\nsenses of “one” can be traced back in one way or another\nto being undivided (#95). Certainly there are many ways that something\ncould be divided, and filling them out leads to different senses of\none-as-undivided or one-as-indivisible. For instance, as\nFârâbî notes, “one” is said of something\nextended that is divisible but not actually divided; of something that\nis spatially located but quantitatively indivisible, i.e., a point; of\nwhat is not spatially located and is therefore quantitatively\nindivisible; of what has (or is) a simple quiddity not divisible into\nparts of a definition such as genus and differentia; and of what is\nnot “divided” between a paronymously named subject\nX and an X-ness through which it is X\n(#20–24). Some of these senses of “one”, such as one\nin the sense of an indivisible point, are never predicated of\na many. Something can also be called one because it does not have a\npartner, i.e., because is the only F, for some predicate F,\nor if nothing else is F in the same way that it is F; and especially\nif F is its quiddity, as, e.g., the moon can be called\n“one” in the sense that there is nothing else of the same\nspecies as it (#25, pp.55–6). This sense of “one”,\ntoo, does not presuppose any plurality in its subject.\nFârâbî also talks about different senses of\n“one” as “circumscribed” in some way (see\nbelow): at least some of these senses do not presuppose any plurality\nin their subject, and apparently in all these senses, if the subject\nthat is one were stripped of its unity, it would not become many\ninstead. Fârâbî apparently does not say that\n“one” in such a sense does not have an opposite, but it\ndoes not have an opposite that is a sense of “many”: the\nopposite of “one” in such a sense would be the\ncontradictory, “not one”, but not a contrary or\nprivative “many”.\n\nFârâbî also insists that the many arising\nfrom some sense of “one”, i.e., a many composed out\nof things that are each one in this sense, is not the many\nopposite to this sense of “one”, although he\nadmits that in some cases the many arising from the one and the many\nopposite to the one are the same per accidens\n(#37–#49). As before, there are senses of “one” that\ndo not have an opposite sense of “many”. There are also\nsenses of “one” that do have an opposite sense of\n“many”, but where the many that arises from the one is not\nthe same as the many that is opposite to the one. Thus the many\narising from the one as a point (the one as what is indivisible\nalthough spatially located) is many points, while the opposite of the\none as a point is a continuous extension. The many arising from the\none as having-no-partner-in-its-species might be a plurality like a\nunique moon and a unique sun (or a unique phoenix), each without a\npartner in its distinct species, whereas the opposite of\nhaving-no-partner-in-its-species is having-a-partner-in-its-species.\nThe opposite of the one as indivisible quiddity is a divisible\nquiddity; the many arising from the one as indivisible quiddity is\nseveral indivisible quiddities, which could be a divisible\nquiddity if, say, one of them is an unanalyzable genus and the others\nare successive unanalyzable differentiae of that genus, but the\nseveral indivisible quiddities need not be a single quiddity\nat all. But, beyond these examples, Fârâbî’s\nbasic point is that, in the many arising from a one, the one\nis an essential constituent of the many, “a part by which its\nconstitution [is]” (#62, p.75): and so it can no more be\nopposite to this one than a species can be opposite to its constituent\ngenera and differentiae. And likewise, if a one, in some sense of\n“one”, is what it is by being a unit, a constituent of a\nmany, then it cannot be opposite to that many, even if there is some\nother sense of “many” which is its opposite.\n\nWhen Fârâbî says that there are senses of\n“one” which do not presuppose any plurality and which have\nno opposite except a bare contradictory—so that there is no\nsense of “many” opposite to these senses of\n“one”, although there is a sense of “many”\narising from each such sense of “one”—he is\ninterested above all in the sense of “one” as\n“circumscribed by a quiddity” (first introduced #17).\nFârâbî does not assume that the reader will already\nbe familiar with this analysis of a special sense of\n“one”: he tries to build up to it from other senses of\n“one” as “circumscribed” in some other way. He\nstarts by talking about a “body circumscribed by a limit that\nspecifies [takhuṣṣu] it” (#16, p.50).\n“Circumscribed” here has a straightforward literal sense:\nthe body is surrounded on all sides by its limit or boundary.\n“Specifies” adds that everything inside that limit is the\nbody, and everything outside that limit is not the body. This may\nconnect with “one” as having no partner in some property,\nsince the body is the only thing inside its limit.\nFârâbî passes from “one” as a body to a\ncircumscribed by a limit to “one” as a body circumscribed\nby a place, where a body’s place is, on the Aristotelian\nanalysis, not the limit of the body itself but the limits of the\nbodies that surround it. Here again, everything that is in the place\nis the body, and everything that is not in the place is not the body.\nThus the limit, or the place, contributes in two ways to making the\nbody one: it makes the parts of the body one with each other, and it\nmakes the body one body distinguished from other bodies, with which it\nyields the many that “arises from” this sense of one. The\nunity [waḥda] corresponding to these senses of\n“one” [wâḥid] is presumably the\ncircumscription [inḥiyâz] by the limit or the\nplace, which is an accident of an underlying\n subject.[35]\n But Fârâbî denies that if this unity were removed,\nits subject would thereby become a many: rather, it would fuse with\nother things into a larger one when the circumscription separating\nthem from each other is removed (#28). Still, these kinds of unity do\nalso unify a divisible subject, as do the unity of what is\none as continuous or contiguous or whole. But Fârâbî\nis building up to a less familiar but more fundamental, non-spatial\nkind of circumscription which has only the function of distinguishing\na one from other ones and not the function of uniting a plurality.\nFârâbî talks about the circumscription of a thing by\nany attribute, which would include limits and places and other\naccidents such as qualities (some examples at #78), but he\nconcentrates overwhelmingly on the circumscription of a thing by its\nquiddity. This can happen at different levels of generality—it\ncan be a specific or a generic quiddity (#27). What is circumscribed\nby a quiddity, unlike what is circumscribed by a limit or a place,\nneed not be a body and need not be divisible, but can be as general as\n“being” or “thing” (#64). In some cases, if a\nthing’s circumscription by its quiddity were removed, it would\nfuse into a one with other ones when it the attributes distinguishing\nit from these others are removed, as a body circumscribed by a limit\nor place would fuse into a one with other bodies when its\ncircumscription by its limit or place is removed. If a thing’s\ncircumscription by its specific quiddity were removed, it would still\nbe circumscribed by its generic quiddity, and would fuse into a one\nwith the other things in its genus, but if all\ncircumscription by a quiddity were removed from it, there would no\nlonger be anything left at all (#27). So there is no opposite to this\nsense of “one” except sheer non-being (#27): there is a\nsense of “many” arising from this sense of\n“one”, but it is not opposite to this sense of\n“one” (#49). The cases of circumscription by a limit or a\nplace might wrongly lead us to think that whenever something is called\n“one” its unity is an accident attaching to some\nunderlying subject, but in the present case if the unity were removed\nthe quiddity would be destroyed. Fârâbî does seem to\ndistinguish a thing’s unity in this sense from its quiddity when\nhe says that the unity of a species, as circumscribed by its specific\nquiddity, is the differentia by which it is circumscribed from other\nspecies of its genus (#78): but this is still essential to the thing,\nand we know from the Book of Letters that the differentia can\nbe called the existence of the thing, as here it is called the unity\nof the thing.\n\nFârâbî says that what is one in the strongest\n[aḥrâ] sense is what is circumscribed by a\nquiddity (#78). He says equally that what is circumscribed by a\nquiddity is “circumscribed by its portion [or allotment] of\nexistence [qisṭ al-wujûd]” (#17), i.e., by\nits being what it is: this being-what-it-is is described in the\nBook of Letters as the existence [wujûd] of\nthe thing, and On the One and Unity argues that it is also\nthe thing’s unity [waḥda].\nFârâbî uses this analysis to try to make good on\nAristotle’s programmatic claim in Metaphysics IV,2 that\nbeing and one are mutually entailing and in a way equivalent, or that\nthere is a sense of “being” and a sense of\n“one”, or a family of senses of “being” and a\ncorresponding family of senses of “one” which are mutually\nentailing and in a way equivalent. Thus here in On the One\n#17 he says that “one” in this meaning, i.e., the\nmeaning “circumscribed by a quiddity”, is mutually\nentailing or equivalent [musâwiq] with being. So\n“one” in this sense needs to apply to things in all\ncategories, not just substances, and indeed Fârâbî\nsays that in #17, and he adds that it also applies to “other\nthings, if there are any outside the categories” (#17, p.51,\ncompare the Book of Letters on a possible ascent to a first\ncause of being to substances which would itself be outside all\ncategories including substance). Again, if “one” in this\nsense is necessarily coextensive with being, Fârâbi needs\nto say that not only species and genera but also individual substances\n(and individual qualities and so on) are each circumscribed by their\nown quiddity—not merely by a shared quiddity and an individual\nplace or other accidental attributes—so that there are\nmany things in each species, in the sense of\n“many” arising from this sense of “one”.\n\n\nThe meaning [maʿnâ] of human [i.e., the species\nhuman] is circumscribed and isolated from what is not human, i.e.,\nhorse and so on, and this human is circumscribed from\nthat human by a circumscription more perfect [or complete]\nthan the circumscription of human from horse. (#64, p.78)\n\n\nFârâbî is thus committed to individual quiddities,\neven though our language does not allow us to formulate a\ndefinition of any individual. “Every being and every\nthing must have no partner in something which is attributed to\nit” (#26, p.56), and “having no partner” in turn is\nmutually entailing or equivalent [musâwiq] with\n“circumscribed by a quiddity” (#26, p.57).\n\n\n“One” is said of everything that is circumscribed by a\nquiddity which specifies it [takhuṣṣuhu] and an\nexistence which specifies it, by which it is circumscribed from\neverything other than it, and it is one by a unity which is that by\nwhich it is circumscribed from other things. And if the quiddity of\neach thing is circumscribed from other things only by some category,\nit [i.e., this sense of “one”] is equivalent to the\n“being” that signifies the categories, and to whatever\nelse is equivalent to “thing”. (#94,\n pp.101–102)[36]\n\n\nThus Fârâbî’s analyses of the senses of\n“being” in the Book of Letters, and of the senses\nof “one” in On the One, give the basis for his\naccount of a “transcendental” sense of “one”\nin which it is mutually entailing with “being”, and also\nfor his account of how unity and existence are predicated of God (see\nthe next section): once we distinguish the different senses, and\nunderstand how they are related, we will see that circumscription by a\nquiddity is both the strongest sense of existence and the strongest\nsense of unity. And since every being in every category, individual or\nuniversal, is circumscribed by a quiddity,\nFârâbî’s analysis allows him to vindicate his\nclaim against Kindî that each of these things is truly one, and\nindeed essentially one.\n4. Fârâbî’s philosophical theology: the Perfect City and Political Regime\n\nFinally, we turn to metaphysical texts where Fârâbî\ntries to do what in the Enumeration of the Sciences he says\nthat the “third part of the divine science” does: namely,\nto show that there are beings separate from bodies, culminating in a\nfirst uncaused being which has no partner and no contrary, contains no\nmultiplicity, is one, being, and true in a stronger sense than\neverything else, is the first cause of existence, unity and truth to\neverything else, and satisfies (some interpretation of) the other\ntraditional divine attributes; and then to show how this first being\nacts to produce other beings directly or indirectly, and how its\naction relates to\n theirs.[37]\n This is also what Fârâbî more briefly says in the\nAims of the Metaphysics that Aristotle does in\nMetaphysics XII:\n\n\nThe eleventh book [i.e., Book XII on our numbering] is about the\nprinciple of substance and of all existence, its existence and the\nconfirmation that it is knowing by its essence and true by its\nessence, and about the separate beings which are after it, and about\nhow the existence of beings depends on it.\n\n\nPresumably Fârâbî thinks that Aristotle drew these\nconclusions on the basis of his analyses of the senses of being and\nunity, of the ways in which one kind of being [mawjûd]\ncould be prior to another being, of what a being’s existence\n[wujûd] is, of how one being can cause existence to\nanother being, and so on. Fârâbî himself undertakes\nsuch analyses in his Book of Letters and On the One,\nand in one section of the Book of Letters he sketches in a\npurely hypothetical way how they might lead to a first being that is\nbeing in the strongest sense.\n\nHowever, the two extant books where Fârâbî tries to\ncarry out this part of metaphysics, the Perfect City and the\nPolitical Regime, are of a rather different character from\nthe texts that he wrote for an audience within the Baghdad\nphilosophical school, engaging with Aristotle’s texts and trying\nto rewrite them for a modern audience. Neither of these books is\ndevoted exclusively to metaphysics: each first gives a long account of\nGod as first cause, and then an account of the heavenly and sublunar\nthings that proceed from God, before focussing on the human soul,\nhuman societies and their governance, prophecy, and the conditions for\nthe soul’s successful “return” to God or for more or\nless satisfactory approximations. Especially in the Perfect\nCity it is clear that Fârâbî is adopting an\noverall sequence of topics from kalâm treatises, and is\ntrying to show that the methods of falsafa allow him to give\na scientific content to the knowledge of God, and a demonstrative\nresolution of the issues in dispute, which in his view the methods of\nkalâm cannot. The full titles of the two texts, the\nPrinciples of the Opinions of the People of the Perfect City\nand the Political Regime known as “Principles of\nBeings” suggest that he is trying to reconstruct and\nrewrite Plato’s Republic (about which he has only\nindirect information), or perhaps a sequence of several Platonic texts\nincluding the\n Republic.[38]\n In Plato, the thesis that the best society will be ruled by\nphilosophers leads to a discussion of the objects the philosophers\nneed to know, Platonic Forms and especially the Good-itself, and this\nmay give Fârâbî a model for including in these\ntreatises a metaphysical account of the first cause and how other\nthings proceed from it: the rulers of the best society will know these\ntruths, and other members of the society will either believe them\nwithout demonstration, or accept some imitation of\n them.[39]\n But while Plato starts with a discussion of the city and uses it to\nmotivate digressions into metaphysics, Fârâbî starts\nat the top, with metaphysics (in the Political Regime with a\nclassification of “principles” or non-bodily causes, in\nthe Perfect City with the first cause), with no prior context\nor motivation. He does not frame the metaphysics by saying\nthat this is what the people of the perfect city know or believe.\nRather, he starts from the first cause, explains how the various types\nof being in the cosmos, including human souls, depend on it, and draws\nconclusions about what sort of city would further human perfection and\nwhat its rulers or other inhabitants would have to know or believe:\nthis conforms to the structure of kalâm treatises,\nwhich typically start with God’s existence and unity and\nattributes and acts, then talk about God’s creation including\nhuman beings, and then about prophecy and the religious community and\nthe afterlife (âkhira) or “return”\n(maʿâd) to\n God.[40]\n\nFârâbî does not seem to know about the metaphysics\nof the Republic, and in any case it would not give him what\nhe needs. He fills in the content of the metaphysics from elsewhere,\nfrom Metaphysics XII as he would like it to be, guided by\nlater Greek interpreters—Themistius’ commentary, and texts\nof Plotinus and Proclus in their Arabic adaptations. This goes beyond\nthe actual Metaphysics XII both in that it infers to God as a\nfirst cause of existence rather than of motion, and in that it\nincludes a downward way from God to the beings that derive their\nexistence from\n him.[41]\n Fârâbî is also much more systematic than Aristotle,\nin the manner of a kalâm treatise, in showing that God\nis simple, i.e., free from all the different modes of composition, and\nis unique and has no contrary (all things that Metaphysics\nXII does briefly say), and in going through a whole series of\nattributes of God. It is plausible that both treatises are directed to\npotential princely patrons, perhaps after Fârâbi’s\ndeparture from Baghdad for Aleppo and Damascus late in his life.\nFârâbî would be trying to break falsafa out\nof its Christian (or Ismâʿîlî) ghetto and to\npresent it as a “religious science” superior to\nkalâm, not exclusively Muslim but suited for Muslim\nneeds: Fârâbî presents falsafa as giving\nthe content of the ruler’s or his adviser’s religious\nknowledge, and implicitly presents himself as an adviser to\n princes.[42]\n Thus both the Perfect City and the Political Regime\nare supposed to be intelligible to a non-specialist audience. In\nneither case does Fârâbi show himself struggling with a\ndifficult Greek model, and while he draws on his technical analyses of\nbeing and unity from the Book of Letters and On the\nOne, this technical substructure is tastefully concealed. The\nPolitical Regime seems to stay closer to\nFârâbî’s Greek\n models,[43]\n and may thus be the earlier of the two texts, while in the\nPerfect City he seems to have more fully digested those\nmodels and to be presenting the results in a simpler and more\nindependent form, concentrating on the elements more central to\npresenting falsafa as a “religious science” to a\ncontemporary Muslim audience. But some passages remain verbally\nidentical or almost identical in the two\n treatises.[44]\n\nBoth treatises put human beings and their societies in an Aristotelian\ncosmological context, which Fârâbî describes in some\ndetail. Humans and other kinds of animals, and also plants, are\ncomposites of some kind of soul (including, for humans, a rational\nsoul) with a body composed out of the four sublunar elements, earth\nand water and air and fire; the whole sublunar world is governed,\nultimately by God, but proximately by a series of nested heavenly\nspheres (each moved by an incorporeal intelligence) and by the\n“active intelligence” which is a source both of\nintellectual cognition to the human rational soul and of intelligible\norder to the sublunar world. But in what follows I will discuss only\nthe strictly metaphysical parts of these texts, not the cosmology or\nthe theories of the human soul, prophecy, or society. I will mainly\nfollow the Perfect City, while noting some interesting\ndifferences in the Political Regime. The Political\nRegime in general seems more interested in classification and\ncomparison. The human soul is introduced by being compared to various\nhigher and lower things, and the way it achieves its intended\nperfection is compared to the ways they do. Likewise, God is\nintroduced, in the prologue to the Political Regime, on a\nlist of six kinds of incorporeal “principles” of physical\nthings, and his causality is compared with the modes of causality of\nthese other\n principles.[45]\n\nThe Perfect City sweeps away this introductory framework, and\nstarts directly with the thesis-statement, “The first being\n[mawjûd] is the first cause of existence\n[wujûd] to all other beings\n[mawjûdât]”.\nFârâbî’s strategy is to argue that there is a\nunique “first being”, and then to derive its attributes,\nincluding that it produces other things, and indeed produces\neverything else either directly or indirectly; in the process he hopes\nto have shown that this first being has enough of the traditional\nattributes of God, suitably reinterpreted, that the readers will\nacknowledge it as God. The Perfect City never once uses the\nword “God”, and this is surely a deliberate strategy. We\ncannot validly deduce “God exists”, or “God is\nF” for any value of F, unless we have at least one premise\ncontaining the term “God”, and no such premises are\navailable. Especially in Islam it is very common to refer to God, not\nby the name “God”, but by one of his attributes, and\nFârâbî in the Perfect City consistently\nuses “the First”, one of the standard Qurʾânic\nattributes (Q\n 57:3).[46]\n\nFârâbî does not accompany the initial thesis of the\nPerfect City, “The first being [mawjûd]\nis the first cause of existence [wujûd] to all other\nbeings [mawjûdât]”, by any explicit proof.\nWhat is his strategy for convincing the reader to accept it? On the\nface of it, there are several ways in which this thesis could be\nfalsified. There might be no first being, because every being has\nanother being prior to it, ad infinitum. Or there might be\nmany beings each of which is “first” in the weak sense\nthat it has nothing prior to it; in which case no being will be\n“first” in the strong sense that it is prior to everything\nother than itself. (We might also want clarification of what\npriority-relation Fârâbî is talking about. He does\nnot explicitly say, but he seems to mean roughly what Aristotle calls\npriority in being by contrast with priority in time and priority in\ndefinition. X is prior to Y in being if X\ncan exist without Y existing but not vice versa, or\nif neither can exist without the other existing but X is the\ncause of Y’s existing.) If there is some X\nwhich is “first” in the strong sense that it is prior to\neverything other than itself, Fârâbî seems to think\nit will be clear that X is the first cause of existence,\neither immediately or by a chain of intermediate causes, to any other\nbeing Y, because every being other than the first will have\nsome cause (distinct from itself) of its existence, and because, if\n(as Fârâbî assumes) there can be no circles or\ninfinite regresses of such causes, the chain of its causes can only\nterminate in the first being X. Fârâbî says\nnothing here about the infinite regress problem (although he is\ncertainly aware of the issue, and we can make plausible guesses about\nwhy he thinks the objectionable infinite regresses do not\n arise).[47]\n But he has a clear (although not obviously successful) strategy for\nshowing that there cannot be many things each of which is\n“first” in the weak sense that it has nothing prior to it,\nand therefore nothing which is prior to everything other than itself.\nFârâbî does not immediately draw this\nconclusion: rather, it is supposed to follow from a series of\ninferences he makes about what anything that is “first”\nmust be like.\n\nFârâbî’s general strategy is (1) to argue that\nanything that is “first” must not have any kind of cause,\nsince any such cause would be prior to it and it would not be first,\nand that it has no privation or potentiality (either of which would\nimply dependence on something prior); then (2) to infer that since it\nhas no cause it must be simple, i.e., that it is\n“one” in the sense of not having any of the different\nkinds of internal composition (e.g., out of matter and form, genus and\ndifferentia, or physically extended parts); then (3) to infer from its\nsimplicity and non-dependence that it has no partner and no contrary,\ni.e., that it is “one” in the sense of being unique; (4)\nthen to infer from its negative attributes (especially its\nimmateriality) to its being\n intelligence[48]\n and to the kind of intelligence it is, and then to derive its other\npositive attributes from its being this kind of intelligence (or\nsimply to reduce the other attributes to its being this kind of\nintelligence); and finally (5) to infer from its simplicity to the\nonly possible way that it can generate something outside itself. Since\nwe know that there are things other than the First, and since anything\nother than the First must derive its being directly or indirectly from\nthe First, it will follow that the First does immediately generate at\nleast one thing, a “Second”; and Fârâbî\nwill try to sketch how the First either directly or indirectly causes\nall the main types of constituents of the world.\nFârâbî’s transitions from the First’s\nsimplicity to its uniqueness, from its negative attributes to its\nbeing intelligence, and from its intrinsic attributes to its producing\nsomething outside it, are all high-risk moments, and will all be\nchallenged by other Arabic thinkers.\n\nWe will concentrate here on the stages of argument up through the\nuniqueness of the First, with a few comments at the end on how\nFârâbî hopes to get to its being intelligence (and\nto what kind of intelligence it is) and to its generating a Second.\nSometimes Fârâbî just states his conclusions without\nexplicit argument, and sometimes he suggests what premisses the\nconclusion is supposed to follow from, while leaving it to the reader\nto figure out how it is supposed to follow. It is usually not\ntoo hard to fill in a broadly plausible argument. But the obvious ways\nof doing this, not drawing on any technical Farabian metaphysical\nnotions, are often disappointingly vague. We may be able to get more\nprecise, using notions from the Book of Letters and On\nthe One which Fârâbî’s terminology here\npoints back to.\n\nAt a first stab: Fârâbî argues that, if something is\n“first” in the sense that nothing is prior to it, it\ncannot be dependent on anything for its existence or for its\ncontinuation in existence. Therefore it has existed without beginning\nand will exist without end, and has no potentiality for not existing.\nIt has no efficient cause, but also no material cause: if it had a\nmaterial cause, its matter would be prior to it, and presumably it\nwould also depend on an efficient cause to turn its matter into it. It\nis less obvious how Fârâbî wants to infer that it is\nperfect, with no deficiency or privation, but perhaps the thought is\nthat if it were deprived of F, it would have to be of such a kind that\nit could be F, and therefore it (or its matter) would be\npotentially F. And Fârâbî apparently thinks he can\nconclude, not just that a first being has no potentiality for not\nexisting, but that it has no potentiality for any predicate that it\ndoes not have by its\n essence:[49]\n perhaps his reason is that if it were potentially F, it would depend\non something else which is actually F to make it actually F, and this\nother thing would be prior to it. Fârâbî also says\nthat a first being has no final cause, and while he\nofficially says here only that there is no final cause for its\nexistence, he also thinks that there is no final cause that\nit aims to achieve through its activities, again because it\nwould be in potentiality to some perfection that it does not have by\nits essence. It also has no form, because nothing can have a form\nunless it also has an underlying matter, which has already been\nexcluded. And Fârâbî adds another argument, that\n\n\nif it had a form, its essence [dhât] would be composed\nout of matter and form, and if it were so then its constitution\n[qiwâm] would be through its two parts out of which it\nis composed, and its existence [wujûd] would have a\ncause. (Walzer 1985, 58,2–5\n\n\nThis allows him to generalize from the case of matter and form to\nother kinds of constituents: as he says when he comes back to this\nissue after the uniqueness arguments,\n\n\nit is not divisible in account [Arabic qawl = Greek\nlogos] into things by which it is\n substantified,[50]\n since it is impossible that each part of the account which explicates\nits meaning should signify a part of what it is substantified by. For\nif it were so, the parts by which it is substantified would be causes\nof its existence [wujûd] in the way that the meanings\nwhich the parts of a thing’s definition signify are causes of\nthe existence of the thing defined, and in the way that the matter and\nthe form are causes of the existence of what is composed out of them;\nand this is impossible for it, since it is first and its existence has\nno cause at all. And if it is not divisible by these divisions, it is\neven further from being divisible by divisions of quantity or the\nother ways of being divided. (Walzer 1985, 66,8–68,1)\n\n\nSo any kind of composition is incompatible with its being first, since\neach of its components would be prior to it and would be a (partial)\ncause of its existence; we could also argue that the components would\nneed a cause to unify them, and that this cause would cause the\nexistence of the composite.\n\nFârâbî gives a series of arguments for the\nconclusions (central from a Muslim point of view) that a First can\nhave no partner and no contrary. He does not actually use the word\n“partner” here, but uses phrases like “nothing other\nthan it can have the existence [wujûd] that it\nhas”. While Fârâbî gives a number of arguments\nfor these conclusions, we can reconstruct perhaps the central\narguments as follows. To conclude that, if X is first, no\nother being Y can have the same existence that X\nhas, Fârâbî says that, if this were so, X\nand Y would not differ, and so would be the same thing, not\ntwo things. But what justifies the claim that X and\nY would not differ? Fârâbî says,\n\n\nif there were a difference between them, then that by which they\ndiffer would be other than what they share, and the thing by which\neach of them differs from the other would be a part of that by which\ntheir existence is constituted, and what they share would be the other\npart: so each of them would be divided in account, and each of its\nparts would be a cause of the constitution of its essence, and so it\nwould not be first. (Walzer 1985, 58,13–60,3)\n\n\nAn obvious objection is that although X, being first, must be\nsimple, Y might not be: perhaps X is wholly\nconstituted by what X and Y share, but Y is\nonly partially constituted by this common element and is partially\nconstituted by something else. Fârâbî considers this\nobjection and replies that in that case\n\n\nthe existence of the latter is not the existence of the former, rather\nthe essence of the former is simple and indivisible and the essence of\nthe latter is divisible, and therefore the latter has two parts by\nwhich it is constituted, and therefore its existence has a cause, and\ntherefore its existence is inferior to the existence of the former and\ndeficient in comparison with it, and therefore it is not existence in\nthe first rank, (Walzer 1985, 60,9–13)\n\n\ncontrary to the hypothesis that Y has the same existence that\nX has.\n\nFârâbî gives two arguments that, if X is\nfirst, it cannot have a contrary Y. Both arguments turn on a\ndefinition of “contrary”: X and Y are\ncontrary if they cannot be together in the same place or substratum,\nso that X is present in some place or substratum through\nY’s being absent from it, and X is absent from\na place or substratum through Y’s being present in it.\nOn the basis of this definition, Farâbî argues, first,\nthat if the First, X, were contrary to Y, then\nX’s being (in some place or substratum, or being at\nall) would be conditioned on Y’s absence, and therefore\nX’s substance would not be sufficient to explain\nX’s continuing to exist, or X’s existing\nat all: so, Fârâbî says, X’s\nconstitution [qiwâm] would not be in X’s\nsubstance (alone), but would be through something else, and so\nX would not be first. Second, X and Y would\nhave to have something common that is receptive of both of them, so\nthat this common thing would persist in being and X and\nY would succeed each other in it, and so this common thing\nwould be prior to them and neither of them would be first. These\narguments are recognizably developments of Aristotle’s arguments\nin Metaphysics XII against there being a pair of contrary\nfirst principles like Empedocles’ Love and Strife, although\nAristotle relies on the premiss that the first principle is pure\nactuality, while Fârâbî makes relatively little use\nof the notion of actuality and relies on the premisses that the first\nprinciple is simple and that it does not depend on anything else for\nits\n existence.[51]\n Fârâbî’s conclusion that the First has no\ncontrary is not simply a special case of his conclusion that the First\nhas no partner, or as he says that “nothing other than it can\nhave the existence [wujûd] that it has”, since he\ndoes not assume that contraries would have the same existence or would\nbe members of the same species or genus.\n\nBut it would be unfair to summarize Fârâbî’s\narguments by saying\n\n\nthe First must have nothing to be prior to it, therefore it must be\nsimple; so there cannot be two Firsts, since if there were they would\nhave something in common and something that distinguishes them, and so\nthey (or at least one of them) would not be simple.\n\n\nThis argument seems open to an immediate objection: why would they\nhave to have anything in common, except that they are both first, in\nthe sense that neither of them has anything prior to it? And being\n“first” in this sense is a mere negation—indeed\nmerely the negation of a relation to something else—and so\nfirstness would not be a constituent of the thing that is\nfirst, and so would not threaten its simplicity. And, while it is not\nclear that Fârâbî has an adequate reply to this\nobjection, his argument is more sophisticated than this quick summary\nwould suggest, and its extra sophistication may give him more\nresources to deal with objections, including the objection that\nFârâbî has not ruled out the possibility of infinite\nregresses and that there may be no First, or that there could be a\nFirst and also other things independent of the First if the chains of\ntheir causes go back ad infinitum without leading to a\nFirst.\n\nIt should be clear already that Fârâbî’s\nargument in the Perfect City uses the word\n“existence” [wujûd] a great deal, in\ncontexts where it is not obviously necessary. Why say that “the\nfirst being is the first cause of existence to all other beings”\nand not just “the first being is the cause of all other\nbeings”? Why say “nothing other than it can have the\nexistence that it has” rather than “nothing other than it\nis first” or “nothing other than it is in the same species\nor genus as it”? Why say that if X and Y are\nsimilar in one respect and different in another respect,\n\n\nthe thing by which each of them differs from the other would be a part\nof that by which their existence is constituted, and what they share\nwould be the other part: so each of them would be divided in account,\nand each of its parts would be a cause of the constitution of its\nessence, and so it would not be first\n\n\nrather than “the thing by which each of them differs from the\nother would be a part of it, and what they share would be the other\npart, and then its parts would be prior to it, and so it would not be\nfirst”?\n\nWhat does it mean, for Fârâbî, to say that\nX is the cause of existence to Y, or that X\nis the existence of Y, or that X enters into the\nconstitution [qiwâm] of Y or is part of that\nby which the existence of Y is constituted? At first blush,\nthe first sentence of the Perfect City, “the first\nbeing [mawjûd] is the first cause of existence\n[wujûd] to all other beings\n[mawjûdât]”, seems to be taking the\nposition of al-Kindî that Fârâbî had\ncriticized in the Book of Letters, according to which the\nfirst being, God, would be a separately existing existence-itself,\nsuch that everything else would come to exist by participating in it:\nthings would exist [would be mawjûd] through an\nexistence [wujûd] as they are white though a whiteness,\nand God would be that existence. Is he here, in the Perfect\nCity, slipping into the kind of popularizing philosophy that he\nhad criticized through a logical syntax of language in the Book of\nLetters? An immediate response is that\nFârâbî’s position in the Perfect City\nis not the same as Kindî’s, since Fârâbî\ndoes not say that God is the existence of anything else. But we would\nstill want to know how God is the cause of the existence of other\nthings, and more generally what it means to say that X is the\ncause of the existence of Y, and what role this plays in\nFârâbî’s argument in the Perfect\nCity. And Fârâbî’s positive theory in the\nBook of Letters gives us resources for understanding\nthis.\n\nAs we saw in\n Section 3.4,\n on Fârâbî’s analysis in the Book of\nLetters there are two main senses of being\n[mawjûd], with corresponding senses of existence\n[wujûd]. If “being” [mawjûd]\nmeans “being outside the mind as it is inside the mind”,\nthen the subject of which is predicated is a thought in the mind (a\nconcept or judgment), and its existence [wujûd] is its\nrelation to something extramental, and this existence holds univocally\nof all true thoughts. Clearly this cannot be what\nFârâbî means in the Perfect City—it\nwould be pointless to ask, in this sense, whether something else has\nthe same existence [wujûd] that the First has. On the\nother hand, if “mawjûd” means “being\ncircumscribed by a quiddity outside the mind”, then the subject\nof which it is predicated is a thing really existing outside the mind,\nand, according to Book of Letters I,89, its corresponding\nwujûd is either its quiddity or part of its quiddity.\nInterpreting wujûd as quiddity does not make sense of\nthe Perfect City’s question whether anything else has\nthe same wujûd as the First: it would be trivially true\nthat no two distinct things could have the same quiddity, or, if we\nsay that the quiddity of a thing is just its form without its matter,\nit would still be trivially true that no two distinct\nimmaterial things could have the same quiddity. But\n“part of a quiddity” works, particularly if we reflect on\nwhat kind of part of the quiddity of X could be called the\nwujûd of X, and why. As we saw in\n Section 3.4,\n Fârâbî in the Book of Letters, following\nAristotle’s Metaphysics VII,17, analyzes\nX’s existence [wujûd = ousia in\nAristotle’s Greek] as the cause of the fact that X\nexists, and, in order to search for this cause as a middle term, tries\nto reanalyze the existential judgment “X exists”\nas a predicative judgment, something like “Y is\nX” where Y is the per se subject of\nX. If X is entirely simple, then “X\nexists” cannot be reanalyzed in this way, but in this case there\nis no cause of the fact that X exists, and X’s\nexistence [wujûd] is identical to X without\nremainder. In cases where X can be analyzed into a subject\nand a predicate, one meaning of “X exists” is\nthat there is a middle term explaining why the predicate belongs to\nthe subject: and this middle term (not the linguistic expression but\nthe reality it signifies) is one of the things that can be called\n“the existence [wujûd] of X by which it\nis constituted” or “the cause of existence to\nX” or “a part by which its existence [is\nconstituted]”. In this sense the interposition of the earth\nbetween the sun and the moon is a partial existence\n[wujûd] of eclipse, or a part of the quiddity of\neclipse which is a cause of existence to eclipse, or a cause of the\nconstitution of\n eclipse.[52]\n Since the First is entirely simple, its quiddity cannot be spelled\nout into a definition, and so the First’s existence is identical\nto the First without remainder, and there is no way that two simple\nthings can share the same existence. But the First is a “cause\nof existence” to a Second, or is “part of that by which\nthe existence of the Second is constituted”, and similar\nexpressions, if the First enters as a cause into the real causal\ndefinition of the Second, which it does, since (as we will see) the\nSecond is constituted by its act of cognizing the First. This makes\nsense of the different things Fârâbî says in the\nPerfect City about X being the cause of existence to\nY, or X being a part of the constitution\n[qiwâm] of Y, of X and Y\nsharing the same existence. It also helps to show what the extra\ncontent is to saying “X is the cause of existence to\nY” rather than just “X is the cause of\nY”, and helps to explain\nFârâbî’s ground for his assumption that there\nis a First, i.e., that there is not an infinite regress of causes of\nexistence: if X is the cause of Y, X counts\nas the cause of existence to Y only if X would be\nmentioned in a causal definition of Y, i.e., if it is\nessential to Y to be caused by X, so that a\nY not caused by X would not really be a Y.\nIf there were an infinite regress of causes of existence to\nX, it would follow that the causal definition of X\nwould be infinitely long, which Fârâbî presumably\nregards as absurd, as does Aristotle in Metaphysics II,2.\nThere may well be an infinite regress of causes of\ncoming-to-be, e.g., the infinite chain of my ancestors, but\nbecause these are not causes of existence, which would enter\ninto the quiddity of the effect and so would be mentioned in its\nscientific definition, they do not lead to the absurdity of an\ninfinitely long definition.\n\nAs we saw in\n Section 3.4,\n Book of Letters I,92 sketches out a program for finding a\nchain of causes of existence, where each cause enters into the\nquiddity of its effect and has a stronger claim to the title of\n“being” [mawjûd]. A substance is a cause of\nexistence to the accidents proper to it, and enters into their\nquiddity, but then there will be a hierarchy of causes of existence\nwithin the category of substance itself, until we reach some first\nsubstance, “whether this is one or more than one”, which\nhas a stronger claim to the title of “being” than all\nother substances, and a fortiori than accidents.\n\n\nAnd if something is discovered outside all these categories which is\nthe cause of the realization of the quiddity of the most fundamental\nthing in this category [i.e., the category of substance], then this is\nmore deserving to be called “being”\n[mawjûd] than the most perfect thing in this category,\nand this is the first cause of existence [wujûd] to the\nmost perfect thing in this category, and this most perfect thing [sc.\nwithin the category of substance] is the cause in the quiddity of the\nother things in this category, and what is in this category is the\ncause in the quiddity of the other categories: thus the beings, where\nwhat is meant by “being” is what has a quiddity outside\nthe soul, are ordered by this order. (Book of Letters\n I,92)[53]\n\n\nFârâbî in the Perfect City and\nPolitical Regime claims to have shown that there is indeed\nexactly one such first being, which enters as an essential cause into\nthe quiddities of other things. The claim is not that the First acts\non each quiddity, from “outside” the quiddity, to give\nthat quiddity actual existence, but rather that whatever\nimmediately depends on the First is essentially constituted\nby its act of cognizing the First, so that a full account of what the\nSecond is necessarily involves the First; and lower things are\nessentially constituted by their relations to these higher things, and\nso are essentially dependent on the First.\n\nThe Perfect City and Political Regime make\nparticularly striking use of Fârâbî’s\n“general” metaphysical treatises, the Book of\nLetters and On the One, in their accounts of the senses\nin which the First is one. The Perfect City and\nPolitical Regime go through a list of attributes of God, and\ntry to show that (and in what sense) each of them belongs to the\nFirst, and from a Muslim point of view one of God’s most\nimportant attributes is that he is one—first in the\nsense that there is no other god, and then also in the sense that he\ncontains no internal multiplicity. The Perfect City marks\nseveral senses in which the First is “one”. It is one in\nthat no other being shares its species of existence (66,5–7),\nand it is one in that it is “undivided” or\n“indivisible”, into quantitative parts or any other kind\nof parts (68,2–6); but then, finally,\n\n\nif the First is indivisible in its substance then the existence by\nwhich it is circumscribed [yanḥâzu] from\nexistences other than it cannot be other than [the existence] by which\nit exists [is mawjûd] in itself, and therefore it is\ncircumscribed from what is other than it through a unity which is its\nessence [i.e., through a unity which it is, not through a\nunity distinct from itself]. For one of the meanings of unity is the\nspecific existence [wujûd\n khâṣṣ][54]\n by which each being is circumscribed from what is other than it: this\nis that by which every being is called one inasmuch as it exists [is\nmawjûd] in respect of the existence which specifies it,\nand this is the meaning of “one” which is coextensive with\nexistence. So the First is one in this way too, and is more deserving\nof the name and meaning of “one” than any one other than\nit.\n\n\nHere the Perfect City is relying on the conclusion of the\nBook of Letters that “circumscribed by its\nquiddity” is one of the meanings of “being” and the\nconclusion of the On the One that “circumscribed by its\nquiddity” is one of the meanings of “one”, and using\nthese conclusions to interpret Aristotle’s claim in\nMetaphysics IV,2 that “being” and\n“one” are mutually entailing. Any being X has a\n“specific existence” which “circumscribes it”,\ni.e., distinguishes it from all other things, and it is one\nin the sense that it is uniquely specified by this existence. If\nX is a member of a species, then X’s\n“specific existence” might include the matter or the place\nor other accidental attributes which distinguish X from other\nmembers of the same species. But, Fârâbî is saying,\nif X is the First and therefore indivisible in its substance,\nit cannot have both a quiddity which it shares with other things and\nthen a distinct “specific existence” which distinguishes\nit from those other things. So because it is one both as\n“unique” and as “indivisible”, its unity, that\nby which it is one, is completely identical with the quiddity by which\nit exists [is a being]. Here, as with the other attributes which he\ndemonstrates of the First, Fârâbî is paralleling the\nMuʿtazilite pattern of asserting that, for any attribute F such\nthat we can say that God is F, the F-ness through which God is F is\nidentical with the divine essence. But Fârâbî claims\nto have based his account of the First and its attributes on\ndemonstrations grounded in analyses of the meanings of being, unity,\nintelligence and the other fundamental philosophical concepts;\nwhereas, Fârâbî would say, when the\nMuʿtazilites say that God is F through an F-ness which is\nidentical with his essence, and therefore is F in a different way from\ncreatures, this is bare assertion to save their theses that God is\nsimple and that he is nonetheless F, and does not rest on an analysis\nof a special sense of F that applies to God and how it relates to more\nordinary senses of F. In the cases of being and unity, the special\nmetaphysics of the Perfect City and Political Regime\nis supposed to rest on the general metaphysics of the Book of\nLetters and On the One, and is supposed to vindicate\nFârâbî’s claim that Aristotelian general\nmetaphysics, when properly understood, will give the path to a\nscientific special metaphysics.\n\nWe conclude by briefly sketching two further, and problematic, key\nsteps in the metaphysical section of the Perfect City and\nPolitical Regime, namely Fârâbî’s\nargument that the First is both intelligence [ʿaql =\nGreek nous] and intelligible [maʿqûl =\nnoêton], and his argument that the First is a cause of\nexistence to other things, and immediately to a single Second, the\nimmaterial intelligence which moves the outermost sphere (in the\nPerfect City), or to a small finite number of Seconds, the\nimmaterial intelligences which move the different heavenly spheres (in\nthe Political Regime). By arguing that the First is\nintelligence and intelligible, Fârâbî tries to\nderive versions of the attributes of knowledge and truth standardly\nascribed to God, and by arguing that it produces a Second he tries to\nderive a version of the act of creation standardly ascribed to God.\nBut he is deriving radically stripped-down versions of these\nattributes and acts, since the First directly knows only itself, and\ndirectly creates only the Second (or a few Seconds), even if it may be\nsaid as a consequence to indirectly know and create other things\ntoo.\n\nFârâbî’s basic steps in arguing that the First\nis intelligence and intelligible are the premisses that\n\n\nwhat prevents the form from being intelligence and from actually\nintellectually cognizing is the matter in which the thing exists\n\n\nand that\n\n\nwhat prevents the thing from being intelligible in actuality [or\n“from being intellectually cognized in actuality”] and\nfrom being by its substance intelligible [or “intellectually\ncognized”] is also matter. (Walzer 1985, 70)\n\n\nSince the First has no matter, it would follow that it is actually\nintelligence and actually intellectually cognized.\nFârâbî’s first premiss, that anything would be\nintellectually cognizing if it did not have a matter blocking it,\ninitially seems strange and ill-motivated. But\nFârâbî would see the second premiss, that matter is\nthe obstacle to something’s being intellectually cognized, as\ngrounded in an Aristotelian analysis of intellectual cognition: the\nmind intellectually cognizes the form of a material thing precisely by\nabstracting it from its matter, and if the object had no matter to\nbegin with, then there is nothing further to do to it and it is\nalready intellectually\n cognized.[55]\n And Fârâbî apparently sees the first premiss as\nfollowing from the second: if X is intrinsically without\nmatter, it is actually intellectually cognized intrinsically,\nand not through a relation to something else which would cognize it:\nand this can only because it actually intellectually cognizes\nitself, and does so intrinsically or essentially, not in\ndependence on some other\n cause.[56]\n Following this Aristotelian analysis, the First’s act of\nintellectually cognizing its object would not be an accident\nof the First, but would be its essence; put the other way around, the\nFirst would be an intelligence, not by being a power for\nintellectually cognizing various objects, but by being an act\nof cognizing its object, namely the First itself. So, as\nFârâbî says,\n\n\nthat it is intelligence [or “intellectual cognition”] and\nthat it is intellectually cognized and that it is intellectually\ncognizing are all a single essence and a single undivided substance.\n(Walzer 1985,\n 70)[57]\n\n\nOr, as Fârâbî says in switching from the\nAristotelian language of “intelligence” to the\nQurʾânic and kalâm language of God’s\nattribute of knowledge, the First’s knowledge does not require\nanything other than itself for it to know, and its knowledge is\nidentical with its essence (Walzer 1985, 72). This sounds like the\nMuʿtazilites in claiming to reconcile God’s knowledge with\nhis simplicity. But while the Muʿtazilites try to show how\nGod’s knowledge can be simple and eternal despite God’s\nknowing a vast plurality of things, some of which change,\nFârâbî short-circuits the problem by saying that\nGod’s knowledge is just knowledge of himself. Perhaps\nFârâbî would say that the problem just cannot be\nsolved if we assume that God is omniscient. Or perhaps he would say,\nwith Themistius (followed by many medieval philosophers), that God in\nknowing himself also implicitly knows other things because he is a\ncause of those other things.\n\nFârâbî also applies his groundwork from the Book\nof Letters to save the Qurʾânic attribute that God is\n“true” or “truth” [al-ḥaqq].\nThe First is “truth” [ḥaqîqa] in the\nsense in which the ḥaqîqa of X is the\nquiddity of X, i.e., the existence [wujûd]\nwhich specifies X as distinct from all other things, which\nmight be expressed by the definition or the ultimate differentia of\nX; and, as Fârâbî has already argued, there\nis no distinction between the First itself and the existence by which\nthe First is distinguished from other things. Also, if S\nthinks X in a way that corresponds to the way X is\nin itself, S’s thought of X can be called\n“true” [ḥaqq], and X can also be\ncalled true insofar as it corresponds to S’s thought of\nX. Since the First knows itself, it can be called\n“true” in this sense through itself, apart from any\nrelation to anything outside itself; and because this is essential to\nit, the “truth” [ḥaqîqa] through\nwhich it is “true” in this sense is not anything other\nthan itself (Walzer 1985, 74). For the First to be “truth”\nin this second sense seems to be equivalent to its being essentially\nintellectually cognized.\n\nIn passing from the First as intelligence to the First as causing\nbeing, Fârâbi is passing, in kalâm terms,\nfrom God’s attributes to God’s acts. His account of the\nFirst as intelligence was perhaps less concerned to show that God has\nknowledge, more concerned to show that God’s knowledge is\nidentical with his essence, and to show in consequence the differences\nbetween the way that God knows and the ways that other things know.\nHis account of the First as causing being to other things, or (in\nkalâm terms) of God’s act of creation, does not\nattempt to deduce, starting from what we have shown about the First,\nthat it must create other things rather than remaining in isolation.\nHe does say that\n\n\nwhen the First exists with the existence which it has, it necessarily\nfollows that there exist from it all the other beings whose existence\nis not by human will and choice, with the existences which they have,\n(Walzer 1985, 88,11–14)\n\n\nbut he gives no argument that the First’s existence entails the\nexistence of other things. Rather, he seems to rely on the argument\nthat since other things in fact exist, their existence must ultimately\nbe caused by the First; his main concern is not to show that\nthe First causes the existence of other things, but to show\nhow it causes the existence of other things, and in\nparticular to show that that by which the First causes the existence\nof other things is identical with its essence, just as that by which\nthe First knows is identical with its\n essence.[58]\n As Fârâbî says, “it is not divided into two\nthings, such that the substantiation of its essence is by one of them\nand something else’s arising from it is by the other”\n(Walzer 1985, 92,3–5): as he says a bit further down, the First\ndoes not require an accident or a motion in itself in order for\nsomething else to arise from it. (Nor is it affected or moved\nby something else’s arising from it, since it cannot be\naffected or moved at all.) Nor, more generally, does the First require\nanything other than its essence—whether an accident or\nmotion that would inhere in the First itself, or an external\ninstrument or material substrate that the First would cooperate with\nin producing some effect—in order for something other than\nitself to arise from it. The First does cooperate with external\ninstruments and material substrata in producing some of its\neffects, and this is important for Fârâbî in\nexplaining how it can produce a plurality of effects, and how it can\nproduce more and less perfect effects, and how it can produce effects\nwhich are connected or “ordered” rather than independent\nof each other. But the First must be able to produce at least some\nfirst effect without an instrument or substratum, or it would not be\nable to produce anything at all, and in that first case the existence\nof the First must be a sufficient cause of the existence of its\neffect.\n\nFârâbî gives no further explanation of how or why\nthe existence of X can be a sufficient cause of the existence\nof Y. (He says that the existence of Y\n“emanates” [using the root f-y-ḍ] from the\nexistence of X, but this is just a technical term meaning\nthat X’s existence, rather than some further act of\nX, causes Y to exist; the term\n“emanation” does not explain how this happens,\nand Fârâbî does not pretend that it does.) He just\ninfers that this must happen in some cases, since more than one thing\nexists. Fârâbî’s situation is analogous to\nAristotle’s in Metaphysics XII. After Aristotle has\nargued that the existence of motion presupposes a first cause which is\nessentially pure actuality, and which therefore cannot be changed or\nmoved, he faces the problem of explaining how such a cause can move\nsomething else. Aristotle answers that while an eternally unchanging\ncause cannot, by itself, cause changing motions, it can cause an\neternally constant motion (such as the eternal rotation of a heavenly\nsphere around its axis) if it causes it as a final cause, as\nan object desired by the object in motion. This leaves many\npuzzles—why should this desire lead a heavenly sphere to move in\ncircles, how will that help it attain the desired object—but\nAristotle can say that since every other kind of causality is\nimpossible, this is what must be happening even if we don’t\nunderstand the details. Fârâbî faces a similar\ndifficulty in explanation, but he finds Aristotle’s solution\nunsatisfying, not so much because these details are missing, as\nbecause it does not explain why the heavenly spheres, or their\nincorporeal movers other than the First exist—at best, Aristotle\nassumes that the incorporeal substances and the spheres exist, and\nexplains why the spheres move. Fârâbî, by contrast,\nhas undertaken to understand the First as a cause of\nexistence; and final causality, even if it is sufficient to\nexplain the motion of an already existent substance, does not seem\nsufficient to explain the existence of substances other than the\nFirst, either the heavenly spheres or their incorporeal movers. The\nFirst must cause existence before it can cause motion, and in fact\nFârâbî does not make it a mover at all, but rather\nsays that it is responsible for the existence of something which is in\nturn the first cause of motion. And if the First causes existence at\nall, it must first cause the existence of at least one thing simply by\nits own existence, not cooperating with any further attribute or\nmotion or instrument or matter. Fârâbî does not and\ncannot say anything about what the First does to cause the\nexistence of something else (he does not say that it causes the\nexistence of something else by thinking that thing, or even that it\ncauses the existence of something else as a byproduct of thinking\nitself); rather, he tries to describe how, and in what order, other\nthings are essentially dependent on the First.\n\nIn the Perfect City Fârâbî says that the\nFirst causes existence, immediately and without cooperation with an\ninstrument or matter, only to a single thing, the Second; in the\nPolitical Regime, apparently, the First causes existence\nimmediately to several things, the Seconds. But in both treatises,\nwhen he introduces his discussion of the First as the cause of\nexistence to other things, he does not start by singling out a Second\nor Seconds. Rather, he starts by saying that “the substance of\n[the First] is a substance from which every existence emanates,\nwhatever this existence may be like, whether it is perfect or\ndeficient”; (Walzer 1985,\n 94),[59]\n but he then immediately adds that “when all the beings arise\nfrom it, they are ordered in their ranks, and each being receives from\nit the portion of existence which is due to it and the rank which is\ndue to it”\n (ibid.).[60]\n But then there is a problem why the First’s single simple\nexistence, assuming that it causes the existence of something else,\nshould cause a plurality of beings receiving greater or lesser\n“portions” of existence from it.\nFârâbî’s answer to this problem seems to be\nless developed in the Political Regime than in the\nPerfect City. In the Political Regime, he says that\nthe Seconds (the intelligences that move the heavenly bodies), and\napparently also the “active intelligence” that governs the\nsublunar world, “have all received existence from the\nFirst” (Butterworth 2015, 46, #34, translation modified); other\nthings depend on the Seconds or the active intelligence for their\nexistence, and for this reason receive lesser portions of existence.\nFârâbî says here that the Seconds, like the First,\nare such that their specific existence is sufficient for the existence\nof something else to emanate from them (ibid.): each Second produces a\nheavenly sphere composed of body and soul (it produces not merely the\nmotion but the existence of the sphere), and\nsublunar substances depend for their existence both on the heavenly\nspheres and on the active\n intelligence.[61]\n The Political Regime says that the Seconds have different\nranks (Butterworth 2015, 46, #34) but it does not say anything to\nexplain why there should be many of them or why they should differ in\nrank. In particular, it does not say that lower Seconds depend on\nhigher Seconds for their existence: each Second is described only as\nproducing a heavenly sphere, not as producing another Second, and as\nfar as we can tell each Second is produced immediately by the First\nwithout cooperation with any other cause. However, in the Perfect\nCity, Fârâbî says that the First, immediately\nand by itself alone, produces only a single Second (Walzer 1985, 100),\nand that all other beings are produced by the First in conjunction\nwith instruments or material substrata, where these must be either the\nSecond or things which are produced by the First in conjunction with\nthe Second. This allows Fârâbî to explain why there\nshould be a plurality of separate immaterial substances, and why they\nshould differ in rank: the Second which is immediately produced by the\nFirst has a greater “portion of existence” than the Third\nwhich depends essentially on the Second, and so on, and all of these\nseparate intelligences (the movers of the heavenly spheres and then\nthe active intelligence that governs the sublunar world) have greater\nportions of existence than sublunar substances which essentially\ndepend on the heavenly spheres and on the active intelligence. Here\nFârâbi is following out the program of Book of\nLetters I,92, discussed above, of finding a single first\nsubstance (here the Second, i.e., the mover of the outermost heavenly\nsphere) on which all other substances are essentially dependent, and\nthen tracing it back in turn to a single simple First: the causal\ndefinition of any other substance, if made fully explicit, would have\nto refer to the motion of the outermost sphere and to the Second as\nits cause, and thus ultimately to the First. But\nFârâbî has the problem of explaining how a single\nSecond can be responsible for causing all this multiplicity of\nessentially differing beings. The Perfect City, like the\nPolitical Regime, stresses that the Seconds (or Second,\nThird, and so on), like the First, are each an intelligence which is\nessentially actually cognizing and is itself the object it cognizes,\nand whose specific existence is sufficient for the existence of\nsomething else to emanate from it; both treatises also stress that\nthese intelligences are also inferior to the First, notably in that\nthey do not have their full perfection purely in themselves, but only\nthrough a relation to the First, namely through intellectually\ncognizing the First. But if each of these intelligences, like the\nFirst, immediately produces only a single being like itself, they will\nnot be able to explain the multiplicity and complexity of the beings\nthat arise indirectly from the First. In the Political Regime\napparently each of the Seconds produces just a single being, namely\nthe heavenly sphere it governs (although this sphere has some\ncomplexity as a compound of body and soul, and although the active\nintelligence that governs the sublunar world has more complex\neffects), but in the Perfect City each of these intelligences\nhas to produce two beings, namely the heavenly sphere it\ngoverns and the next\n intelligence.[62]\n Thus\n\n\nfrom the First emanates the existence of the Second, and this Second\ntoo is a substance which is not embodied at all and is not in matter,\nand it intellectually cognizes itself [or “its essence”]\nand it intellectually cognizes the First, and its intellectual\ncognition of itself is not something other than its essence; and by\nits intellectually cognizing the First there follows necessarily from\nit the existence of a Third, and by its being substantified by the\nessence which is specific to it there follows necessarily from it the\nexistence of the first heaven. (Walzer 1985, 100)\n\n\nSo for the Perfect City, as in the Political Regime,\nthe Second, like the First, essentially cognizes itself, and there is\nno distinction between its act of cognizing itself, the existence by\nwhich it is substantially constituted, and that through which it gives\nrise to the existence of the heavenly sphere it governs. But the\nPerfect City can say that there is a distinction between this\nintelligence’s cognition of itself, which is essential\nto it, and its cognition of the First, through which it\nattains a perfection, by relation to something else, exceeding what it\nhas just by itself. Or perhaps it would be better to say that its\nessence includes a relation to the First, and that its essence is\ntherefore compound, in something like the way that a species-essence\ncomposed of genus and differentia is compound.\nFârâbî does not want to say that an immaterial\nintelligence is composed of two beings\n[mawjûdât], such as substance and accident or\nmatter and form, but he wants to say that it has two\nexistences [wujûdât], that it\nis in two ways or in a compound way. His wager in the\nPerfect City is that he can explain this plurality of\nexistences in immaterial substances by the way in which they are\ncaused by the First, and that this plurality of existences will in\nturn explain how these immaterial substances can give rise to the many\ncomplex beings ultimately arise from the First.\n",
    "bibliography": {
        "categories": [
            "A. Primary sources",
            "B. Secondary sources"
        ],
        "cat_ref_text": {
            "A. Primary sources": [
                "</h3>\n<h4 id=\"EditTextFara\">A.1 Editions of texts by Fârâbî</h4>\n<ul class=\"hanging\">",
                "<em>Falsafat Aflaṭûn</em>, in Franz Rosenthal and\nRichard Walzer (eds. and trs.), [Latin], <em>Alfarabius de Platonis\nphilosophia</em>, London: Warburg, 1943.",
                "<em>Iḥṣâʾ al-ʿulûm</em>, in\nÁngel González Palencia (ed. and tr. [Spanish]),\n<em>Al-Farabi: Catálogo de las ciencias</em>, second edition,\nMadrid: Consejo Superior de Investigaciones Científicas,\n1953.",
                "[Kutsch &amp; Marrow 1960] <em>Sharḥ\nal-Fârâbî li-Kitâb\nArisṭûṭâlîs fî\nl-ʿIbâra</em> = <em>Alfarabi’s Commentary on\nAristotle’s PERI ERMHNEIAΣ (De Interpretatione)</em>,\nWilhelm Kutsch and Stanley Marrow (eds.), Beirut: Imprimerie\nCatholique, 1960.",
                "<em>Kitâb al-siyâsa al-madanîya</em> =\n<em>Alfarabi’s The Political Regime</em>, Fauzi M. Najjar (ed.),\nBeirut: Imprimerie Catholique, 1964.",
                "[Mahdi 1968] <em>Kitâb al-alfâẓ\nal-mustaʿmala fî l-manṭiq</em>, Muhsin Mahdi (ed.),\nBeirut: Dar el-Mashreq, 1968.",
                "[Mahdi 1969a] <em>Kitâb al-ḥurûf</em> =\n<em>Alfarabi’s Book of Letters</em>, Muhsin Mahdi (ed.), Beirut:\nDar el-Mashreq, 1969a. [Note that <em>Boook of Letters</em> is cited\nby part and paragraph number followed, possibly, by page number and\nline number.]",
                "[Mahdi 1976] <em>Kitâb iḥṣâʾ\nal-îqâʿât</em>, selections edited by Muhsin\nMahdi in ʿUthmân Amîn (ed.),\n<em>Nuṣûṣ falsafîya muhdât ilâ\nl-Duktûr Ibrâhîm Madkûr</em>, Cairo: 1976, pp.\n75–8.",
                "<em>Kitâb al-wâḥid wa-l-waḥda</em> =\n<em>Alfarabi’s On One and Unity</em>, Muhsin Mahdi (ed.),\nCasablanca: Toubkal, 1989.",
                "<em>Kitâb al-jamʿ bayna raʾay\nal-ḥakîmayn</em>, in Cecilia Martini Bonadeo, (ed. and tr.\n[Italian]), <em>al-Fârâbî: L’armonia delle\nopinioni dei due sapienti: il divino Platone e Aristotele</em>, Pisa:\nPlus, 2008.\n</ul>\n<h4 id=\"EditEarlArabPhilText\">A.2 Editions of earlier Arabic philosophical texts</h4>\n<ul class=\"hanging\">",
                "<em>Oeuvres philosophiques et scientifiques\nd’al-Kindî</em>, Jean Jolivet and Roshdi Rashed, (ed. and\ntr. [French]), 2 vols., Leiden: Brill, 1997.\n</ul>\n<h4 id=\"TranTextFara\">A.3 Translations of texts by Fârâbî</h4>\n<ul class=\"hanging\">",
                "Bertolacci, Amos (tr.), 2006a, “On the Aims of the\nMetaphysics”, in Bertolacci 2006b, 66–72.",
                "Bučan, Daniel (tr.), 1999, <em>Abu Nasr Al-Farabi: Knjiga o\nslovima</em>, Zagreb: Demetra. Croatian translation of the <em>Book of\nLetters</em>.",
                "Butterworth, Charles E. (tr.), 2001, <em>Alfarabi: The Political\nWritings: “Selected Aphorisms” and Other Texts</em>,\nIthaca, NY: Cornell University Press. Contains the <em>Selected\nAphorisms</em>, <em>Book of Religion</em>, <em>The Harmonization of\nthe Two Opinions of the Two Sages: Plato the Divine and\nAristotle</em>, and selections from the <em>Enumeration of the\nSciences</em>.",
                "––– (tr.), 2015, <em>Alfarabi: The Political\nWritings, Volume II: “Political regime” and “Summary\nof Plato’s laws”</em>, Ithaca, NY: Cornell University\nPress",
                "González Palencia, Ángel (ed. and tr. [Spanish]),\n1953, <em>Al-Farabi: Catálogo de las ciencias</em>, second\nedition, Madrid: Consejo Superior de Investigaciones\nCientíficas.",
                "Khalidi, Muhammad Ali, 2005, <em>Medieval Islamic Philosophical\nWritings</em>, Cambridge: Cambridge University Press. Contains a\npartial English translation of the <em>Book of Letters</em>, pp.\n1–26.",
                "McGinnis, Jon and David C. Reisman, 2007, <em>Classical Arabic\nPhilosophy: An Anthology of Sources</em>, Indianapolis, IN: Hackett.\nContains translations of <em>On the Aims of the Metaphysics</em>,\n<em>On Intelligence</em>, and part of the <em>Political\nRegime</em>.",
                "Mahdi, Muhsin (tr.), 1969b, <em>Alfarabi’s philosophy of\nPlato and Aristotle</em>, revised edition, Ithaca, NY: Cornell\nUniversity Press. Contains the <em>Attainment of Happiness</em>,\n<em>Philosophy of Plato</em>, and <em>Philosophy of\nAristotle</em>.",
                "Martini Bonadeo, Cecilia (ed. and tr. [Italian]), 2008,\n<em>al-Fârâbî: L’armonia delle opinioni dei\ndue sapienti: il divino Platone e Aristotele</em>, Pisa: Plus.",
                "Rosenthal, Franz, 1975, <em>The Classical Heritage in Islam</em>,\nLondon: Routledge. Contains a translation of <em>On the Appearance of\nPhilosophy</em>, pp. 50–51",
                "Rosenthal, Franz and Richard Walzer (ed. and tr. [Latin]), 1943,\n<em>Alfarabius de Platonis philosophia</em>, London: Warburg",
                "Türker, Ömer (tr.), 2008, <em>Harfler Kitabı:\nKitâbu’l-Hurûf</em>, Istanbul: Litera\nYayıncılık. Turkish translation of the <em>Book of\nLetters</em>.",
                "Walzer, Richard (ed. and tr.), 1985, <em>Al-Farabi on the Perfect\nState: Abû Naṣr al-Fârâbî’s\nMabâdiʾ Ârâʾ Ahl al-Madîna\nal-Fâdila</em>, Oxford: Clarendon Press.",
                "Zimmermann, F.W. (tr. [with book-length introduction]), 1981,\n<em>Al-Farabi’s Commentary and Short Treatise on\nAristotle’s De interpretatione</em>, London: Published for the\nBritish Academy by Oxford University Press\n</ul>\n<h4 id=\"TranEarlArabPhilTextGreeTextSurvArab\">A.4 Translations of earlier Arabic philosophical texts, and a Greek text surviving in Arabic/Hebrew</h4>\n<ul class=\"hanging\">",
                "Adamson, Peter and Peter E. Pormann (trs), 2012, <em>The\nPhilosophical Works of Al-Kindî</em>, Oxford: Oxford University\nPress.",
                "Elamrani-Jamal, Abdelali, 1983, <em>Logique\naristotélicienne et grammaire arabe</em>, Paris: Vrin. Contains\na French translation of the debate between Abû Bishr Mattâ\nand al-Sîrâfî, pp. 149–63.",
                "Jolivet, Jean and Roshdi Rashed (ed. and tr. [French]), 1997,\n<em>Oeuvres philosophiques et scientifiques\nd’al-Kindî</em>, Leiden: Brill",
                "Madelung, Wilferd and Paul Walker, 1999, <em>The Advent of the\nFatimids: A Contemporary Shiʿi Witness</em>, London: Tauris",
                "Margoliouth, D.S., 1905, “The Discussion between Abu Bishr\nMatta and Abu Saʿid al-Sirafi on the Merits of Logic and\nGrammar”, <em>Journal of the Royal Asiatic Society</em>, 37(1):\n79–129. doi:10.1017/S0035869X00032706",
                "Meyrav, Yoav (tr.), 2020, <em>Themistius: On Aristotle Metaphysics\n12</em>, London: Bloomsbury.\n</ul>\n<h3 id=\"BSecoSour\">"
            ],
            "B. Secondary sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Abed, Shukri B., 1991, <em>Aristotelian Logic and the Arabic\nLanguage in Alfârâbî</em>, Albany, NY: SUNY\nPress.",
                "Adamson, Peter, 2002, <em>The Arabic Plotinus: A Philosophical\nStudy of the Theology of Aristotle</em>, London: Duckworth.",
                "Bertolacci, Amos, 2005, “On the Arabic Translations of\nAristotle’s <em>Metaphysics</em>”, <em>Arabic Sciences and\nPhilosophy</em>, 15(2): 241–275.\ndoi:10.1017/S0957423905000196",
                "–––, 2006b, <em>The Reception of\nAristotle’s Metaphysics in Avicenna’s Kitâb\nal-Šifâʾ: A Milestone of Western Metaphysics</em>,\nLeiden: Brill.",
                "Décarie, Vianney, 1961, <em>L’objet de la\nmétaphysique selon Aristote</em>, Paris: Vrin.",
                "Diebler, Stéphane, 2005, “Catégories,\nconversation et philosophie chez al-Fârâbî”,\nin <em>Les catégories et leur histoire</em>, Otto Bruun and\nLorenzo Corti (eds.), Paris: Vrin, pp. 275–305.",
                "Druart, Thérèse-Anne, 2007,\n“Al-Fârâbî, the Categories, Metaphysics, and\nthe <em>Book of Letters</em>”, <em>Medioevo: Rivista di storia\ndella filosofia medievale</em>, 32: 15–37.",
                "Galston, Miriam, 2015, “The Puzzle of Alfarabi’s\nParallel Works”, <em>The Review of Politics</em>, 77(4):\n519–543. doi:10.1017/S003467051500056X",
                "Gutas, Dimitri, 1999a, “The ‘Alexandria to\nBaghdad’ Complex of Narratives: a Contribution to the Study of\nPhilosophical and Medical Historiography Among the Arabs”,\n<em>Documenti e Studi sulla Tradizione Filosofica Medievale</em>, 10:\n155–93.",
                "–––, 1999b, “Fârâbî i.\nBiography”, <em>Encyclopedia Iranica</em>, Vol. IX, Fasc. 2, pp.\n208–213; current version\n [<a href=\"https://www.iranicaonline.org/articles/farabi-i\" target=\"other\">Gutas 1999b available online</a>]",
                "Janos, Damien, 2012, <em>Method, Structure, and Development in\nal-Farabi’s Cosmology</em> (Islamic Philosophy, Theology and\nScience. Texts and Studies, 85), Leiden: Brill.\ndoi:10.1163/9789004217324",
                "–––, 2016,\n“Al-Fārābī’s (d. 950) On the One and\nOneness: Some Preliminary Remarks on Its Structure, Contents, and\nTheological Implications”, in <em>The Oxford Handbook of Islamic\nPhilosophy</em>, Khaled El-Rouayheb and Sabine Schmidtke (eds),\nOxford: Oxford University Press, pp. 101–28.",
                "Menn, Stephen, 2008, “Al-Fārābī’s\n<em>Kitāb al-Ḥurūf</em> and His Analysis of the Senses\nof Being”, <em>Arabic Sciences and Philosophy</em>, 18(1):\n59–97. doi:10.1017/S0957423908000477",
                "–––, 2011, “Fârâbî in\nthe Reception of Avicenna’s Metaphysics: Averroes against\nAvicenna on Being and Unity”, in <em>The Arabic, Hebrew and\nLatin Reception of Avicenna’s Metaphysics</em>, Dag Hasse and\nAmos Bertolacci (eds), Berlin: De Gruyter, pp. 51–96.\ndoi:10.1515/9783110215762.51",
                "Rashed, Marwan, 2009, “On the Authorship of the Treatise\n<em>On the Harmonization of the Opinions of the Two Sages</em>\nAttributed to al-Fārābī”, <em>Arabic Sciences and\nPhilosophy</em>, 19(1): 43–82.\ndoi:10.1017/S0957423909000587",
                "Rudolph, Ulrich, 2008, “Reflections on\nal-Fârâbî’s <em>Mabâdiʾ\nârâʾ ahl al-maḍîna\nal-fâdila</em>”, in <em>In the Age of\nal-Fârâbî: Arabic Philosophy in the Fourth/Tenth\nCentury</em>, Peter Adamson (ed.), London: Warburg Institute, pp.\n1–14.",
                "–––, 2017, “Abû Naṣr\nal-Fârâbî”, in <em>Philosophy in the Islamic\nWorld, Volume 1: 8th–10th Centuries</em>, Ulrich Rudolph,\nRotraud Hansberger, and Peter Adamson (eds), Rotraud Hansberger (tr),\nLeiden: Brill, pp. 526–654.",
                "Shiloah, Amnon, 1971, “Traités de musique dans le Ms.\n1705 de Manisa”, <em>Israel Oriental Studies</em>, 1:\n305–7.",
                "Vallat, Philippe, 2004, <em>Farabi et l’école\nd’Alexandrie</em>, Paris: Vrin.",
                "Watt, John W., 2008, “Al-Fârâbî and the\nHistory of the Syriac Organon”, in <em>Malphono w-Rabo\nd-Malphone: Studies in Honor of Sebastian P. Brock</em>, George A.\nKiraz (ed.), Piscataway, NJ: Gorgias Press, pp. 703–731.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">A. Primary sources</h3>\n<h4 id=\"EditTextFara\">A.1 Editions of texts by Fârâbî</h4>\n<ul class=\"hanging\">\n<li><em>Falsafat Aflaṭûn</em>, in Franz Rosenthal and\nRichard Walzer (eds. and trs.), [Latin], <em>Alfarabius de Platonis\nphilosophia</em>, London: Warburg, 1943.</li>\n<li><em>Iḥṣâʾ al-ʿulûm</em>, in\nÁngel González Palencia (ed. and tr. [Spanish]),\n<em>Al-Farabi: Catálogo de las ciencias</em>, second edition,\nMadrid: Consejo Superior de Investigaciones Científicas,\n1953.</li>\n<li>[Kutsch &amp; Marrow 1960] <em>Sharḥ\nal-Fârâbî li-Kitâb\nArisṭûṭâlîs fî\nl-ʿIbâra</em> = <em>Alfarabi’s Commentary on\nAristotle’s PERI ERMHNEIAΣ (De Interpretatione)</em>,\nWilhelm Kutsch and Stanley Marrow (eds.), Beirut: Imprimerie\nCatholique, 1960.</li>\n<li><em>Kitâb al-siyâsa al-madanîya</em> =\n<em>Alfarabi’s The Political Regime</em>, Fauzi M. Najjar (ed.),\nBeirut: Imprimerie Catholique, 1964.</li>\n<li>[Mahdi 1968] <em>Kitâb al-alfâẓ\nal-mustaʿmala fî l-manṭiq</em>, Muhsin Mahdi (ed.),\nBeirut: Dar el-Mashreq, 1968.</li>\n<li>[Mahdi 1969a] <em>Kitâb al-ḥurûf</em> =\n<em>Alfarabi’s Book of Letters</em>, Muhsin Mahdi (ed.), Beirut:\nDar el-Mashreq, 1969a. [Note that <em>Boook of Letters</em> is cited\nby part and paragraph number followed, possibly, by page number and\nline number.]</li>\n<li>[Mahdi 1976] <em>Kitâb iḥṣâʾ\nal-îqâʿât</em>, selections edited by Muhsin\nMahdi in ʿUthmân Amîn (ed.),\n<em>Nuṣûṣ falsafîya muhdât ilâ\nl-Duktûr Ibrâhîm Madkûr</em>, Cairo: 1976, pp.\n75–8.</li>\n<li><em>Kitâb al-wâḥid wa-l-waḥda</em> =\n<em>Alfarabi’s On One and Unity</em>, Muhsin Mahdi (ed.),\nCasablanca: Toubkal, 1989.</li>\n<li><em>Kitâb al-jamʿ bayna raʾay\nal-ḥakîmayn</em>, in Cecilia Martini Bonadeo, (ed. and tr.\n[Italian]), <em>al-Fârâbî: L’armonia delle\nopinioni dei due sapienti: il divino Platone e Aristotele</em>, Pisa:\nPlus, 2008.</li>\n</ul>\n<h4 id=\"EditEarlArabPhilText\">A.2 Editions of earlier Arabic philosophical texts</h4>\n<ul class=\"hanging\">\n<li><em>Oeuvres philosophiques et scientifiques\nd’al-Kindî</em>, Jean Jolivet and Roshdi Rashed, (ed. and\ntr. [French]), 2 vols., Leiden: Brill, 1997.</li>\n</ul>\n<h4 id=\"TranTextFara\">A.3 Translations of texts by Fârâbî</h4>\n<ul class=\"hanging\">\n<li>Bertolacci, Amos (tr.), 2006a, “On the Aims of the\nMetaphysics”, in Bertolacci 2006b, 66–72.</li>\n<li>Bučan, Daniel (tr.), 1999, <em>Abu Nasr Al-Farabi: Knjiga o\nslovima</em>, Zagreb: Demetra. Croatian translation of the <em>Book of\nLetters</em>.</li>\n<li>Butterworth, Charles E. (tr.), 2001, <em>Alfarabi: The Political\nWritings: “Selected Aphorisms” and Other Texts</em>,\nIthaca, NY: Cornell University Press. Contains the <em>Selected\nAphorisms</em>, <em>Book of Religion</em>, <em>The Harmonization of\nthe Two Opinions of the Two Sages: Plato the Divine and\nAristotle</em>, and selections from the <em>Enumeration of the\nSciences</em>.</li>\n<li>––– (tr.), 2015, <em>Alfarabi: The Political\nWritings, Volume II: “Political regime” and “Summary\nof Plato’s laws”</em>, Ithaca, NY: Cornell University\nPress</li>\n<li>González Palencia, Ángel (ed. and tr. [Spanish]),\n1953, <em>Al-Farabi: Catálogo de las ciencias</em>, second\nedition, Madrid: Consejo Superior de Investigaciones\nCientíficas.</li>\n<li>Khalidi, Muhammad Ali, 2005, <em>Medieval Islamic Philosophical\nWritings</em>, Cambridge: Cambridge University Press. Contains a\npartial English translation of the <em>Book of Letters</em>, pp.\n1–26.</li>\n<li>McGinnis, Jon and David C. Reisman, 2007, <em>Classical Arabic\nPhilosophy: An Anthology of Sources</em>, Indianapolis, IN: Hackett.\nContains translations of <em>On the Aims of the Metaphysics</em>,\n<em>On Intelligence</em>, and part of the <em>Political\nRegime</em>.</li>\n<li>Mahdi, Muhsin (tr.), 1969b, <em>Alfarabi’s philosophy of\nPlato and Aristotle</em>, revised edition, Ithaca, NY: Cornell\nUniversity Press. Contains the <em>Attainment of Happiness</em>,\n<em>Philosophy of Plato</em>, and <em>Philosophy of\nAristotle</em>.</li>\n<li>Martini Bonadeo, Cecilia (ed. and tr. [Italian]), 2008,\n<em>al-Fârâbî: L’armonia delle opinioni dei\ndue sapienti: il divino Platone e Aristotele</em>, Pisa: Plus.</li>\n<li>Rosenthal, Franz, 1975, <em>The Classical Heritage in Islam</em>,\nLondon: Routledge. Contains a translation of <em>On the Appearance of\nPhilosophy</em>, pp. 50–51</li>\n<li>Rosenthal, Franz and Richard Walzer (ed. and tr. [Latin]), 1943,\n<em>Alfarabius de Platonis philosophia</em>, London: Warburg</li>\n<li>Türker, Ömer (tr.), 2008, <em>Harfler Kitabı:\nKitâbu’l-Hurûf</em>, Istanbul: Litera\nYayıncılık. Turkish translation of the <em>Book of\nLetters</em>.</li>\n<li>Walzer, Richard (ed. and tr.), 1985, <em>Al-Farabi on the Perfect\nState: Abû Naṣr al-Fârâbî’s\nMabâdiʾ Ârâʾ Ahl al-Madîna\nal-Fâdila</em>, Oxford: Clarendon Press.</li>\n<li>Zimmermann, F.W. (tr. [with book-length introduction]), 1981,\n<em>Al-Farabi’s Commentary and Short Treatise on\nAristotle’s De interpretatione</em>, London: Published for the\nBritish Academy by Oxford University Press</li>\n</ul>\n<h4 id=\"TranEarlArabPhilTextGreeTextSurvArab\">A.4 Translations of earlier Arabic philosophical texts, and a Greek text surviving in Arabic/Hebrew</h4>\n<ul class=\"hanging\">\n<li>Adamson, Peter and Peter E. Pormann (trs), 2012, <em>The\nPhilosophical Works of Al-Kindî</em>, Oxford: Oxford University\nPress.</li>\n<li>Elamrani-Jamal, Abdelali, 1983, <em>Logique\naristotélicienne et grammaire arabe</em>, Paris: Vrin. Contains\na French translation of the debate between Abû Bishr Mattâ\nand al-Sîrâfî, pp. 149–63.</li>\n<li>Jolivet, Jean and Roshdi Rashed (ed. and tr. [French]), 1997,\n<em>Oeuvres philosophiques et scientifiques\nd’al-Kindî</em>, Leiden: Brill</li>\n<li>Madelung, Wilferd and Paul Walker, 1999, <em>The Advent of the\nFatimids: A Contemporary Shiʿi Witness</em>, London: Tauris</li>\n<li>Margoliouth, D.S., 1905, “The Discussion between Abu Bishr\nMatta and Abu Saʿid al-Sirafi on the Merits of Logic and\nGrammar”, <em>Journal of the Royal Asiatic Society</em>, 37(1):\n79–129. doi:10.1017/S0035869X00032706</li>\n<li>Meyrav, Yoav (tr.), 2020, <em>Themistius: On Aristotle Metaphysics\n12</em>, London: Bloomsbury.</li>\n</ul>\n<h3 id=\"BSecoSour\">B. Secondary sources</h3>\n<ul class=\"hanging\">\n<li>Abed, Shukri B., 1991, <em>Aristotelian Logic and the Arabic\nLanguage in Alfârâbî</em>, Albany, NY: SUNY\nPress.</li>\n<li>Adamson, Peter, 2002, <em>The Arabic Plotinus: A Philosophical\nStudy of the Theology of Aristotle</em>, London: Duckworth.</li>\n<li>Bertolacci, Amos, 2005, “On the Arabic Translations of\nAristotle’s <em>Metaphysics</em>”, <em>Arabic Sciences and\nPhilosophy</em>, 15(2): 241–275.\ndoi:10.1017/S0957423905000196</li>\n<li>–––, 2006b, <em>The Reception of\nAristotle’s Metaphysics in Avicenna’s Kitâb\nal-Šifâʾ: A Milestone of Western Metaphysics</em>,\nLeiden: Brill.</li>\n<li>Décarie, Vianney, 1961, <em>L’objet de la\nmétaphysique selon Aristote</em>, Paris: Vrin.</li>\n<li>Diebler, Stéphane, 2005, “Catégories,\nconversation et philosophie chez al-Fârâbî”,\nin <em>Les catégories et leur histoire</em>, Otto Bruun and\nLorenzo Corti (eds.), Paris: Vrin, pp. 275–305.</li>\n<li>Druart, Thérèse-Anne, 2007,\n“Al-Fârâbî, the Categories, Metaphysics, and\nthe <em>Book of Letters</em>”, <em>Medioevo: Rivista di storia\ndella filosofia medievale</em>, 32: 15–37.</li>\n<li>Galston, Miriam, 2015, “The Puzzle of Alfarabi’s\nParallel Works”, <em>The Review of Politics</em>, 77(4):\n519–543. doi:10.1017/S003467051500056X</li>\n<li>Gutas, Dimitri, 1999a, “The ‘Alexandria to\nBaghdad’ Complex of Narratives: a Contribution to the Study of\nPhilosophical and Medical Historiography Among the Arabs”,\n<em>Documenti e Studi sulla Tradizione Filosofica Medievale</em>, 10:\n155–93.</li>\n<li>–––, 1999b, “Fârâbî i.\nBiography”, <em>Encyclopedia Iranica</em>, Vol. IX, Fasc. 2, pp.\n208–213; current version\n [<a href=\"https://www.iranicaonline.org/articles/farabi-i\" target=\"other\">Gutas 1999b available online</a>]</li>\n<li>Janos, Damien, 2012, <em>Method, Structure, and Development in\nal-Farabi’s Cosmology</em> (Islamic Philosophy, Theology and\nScience. Texts and Studies, 85), Leiden: Brill.\ndoi:10.1163/9789004217324</li>\n<li>–––, 2016,\n“Al-Fārābī’s (d. 950) On the One and\nOneness: Some Preliminary Remarks on Its Structure, Contents, and\nTheological Implications”, in <em>The Oxford Handbook of Islamic\nPhilosophy</em>, Khaled El-Rouayheb and Sabine Schmidtke (eds),\nOxford: Oxford University Press, pp. 101–28.</li>\n<li>Menn, Stephen, 2008, “Al-Fārābī’s\n<em>Kitāb al-Ḥurūf</em> and His Analysis of the Senses\nof Being”, <em>Arabic Sciences and Philosophy</em>, 18(1):\n59–97. doi:10.1017/S0957423908000477</li>\n<li>–––, 2011, “Fârâbî in\nthe Reception of Avicenna’s Metaphysics: Averroes against\nAvicenna on Being and Unity”, in <em>The Arabic, Hebrew and\nLatin Reception of Avicenna’s Metaphysics</em>, Dag Hasse and\nAmos Bertolacci (eds), Berlin: De Gruyter, pp. 51–96.\ndoi:10.1515/9783110215762.51</li>\n<li>Rashed, Marwan, 2009, “On the Authorship of the Treatise\n<em>On the Harmonization of the Opinions of the Two Sages</em>\nAttributed to al-Fārābī”, <em>Arabic Sciences and\nPhilosophy</em>, 19(1): 43–82.\ndoi:10.1017/S0957423909000587</li>\n<li>Rudolph, Ulrich, 2008, “Reflections on\nal-Fârâbî’s <em>Mabâdiʾ\nârâʾ ahl al-maḍîna\nal-fâdila</em>”, in <em>In the Age of\nal-Fârâbî: Arabic Philosophy in the Fourth/Tenth\nCentury</em>, Peter Adamson (ed.), London: Warburg Institute, pp.\n1–14.</li>\n<li>–––, 2017, “Abû Naṣr\nal-Fârâbî”, in <em>Philosophy in the Islamic\nWorld, Volume 1: 8th–10th Centuries</em>, Ulrich Rudolph,\nRotraud Hansberger, and Peter Adamson (eds), Rotraud Hansberger (tr),\nLeiden: Brill, pp. 526–654.</li>\n<li>Shiloah, Amnon, 1971, “Traités de musique dans le Ms.\n1705 de Manisa”, <em>Israel Oriental Studies</em>, 1:\n305–7.</li>\n<li>Vallat, Philippe, 2004, <em>Farabi et l’école\nd’Alexandrie</em>, Paris: Vrin.</li>\n<li>Watt, John W., 2008, “Al-Fârâbî and the\nHistory of the Syriac Organon”, in <em>Malphono w-Rabo\nd-Malphone: Studies in Honor of Sebastian P. Brock</em>, George A.\nKiraz (ed.), Piscataway, NJ: Gorgias Press, pp. 703–731.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Farabi",
            "al-Farabi: philosophy of logic and language",
            "al-Farabi: philosophy of society and religion",
            "al-Farabi: psychology and epistemology",
            "Arabic and Islamic Philosophy, disciplines in: metaphysics",
            "Aristotle, General Topics: metaphysics"
        ],
        "entry_link": [
            {
                "../al-farabi/": "al-Farabi"
            },
            {
                "../al-farabi-logic/": "al-Farabi: philosophy of logic and language"
            },
            {
                "../al-farabi-soc-rel/": "al-Farabi: philosophy of society and religion"
            },
            {
                "../al-farabi-psych/": "al-Farabi: psychology and epistemology"
            },
            {
                "../arabic-islamic-metaphysics/": "Arabic and Islamic Philosophy, disciplines in: metaphysics"
            },
            {
                "../aristotle-metaphysics/": "Aristotle, General Topics: metaphysics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-farabi-metaphysics\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/al-farabi-metaphysics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=al-farabi-metaphysics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/al-farabi-metaphysics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-farabi-metaphysics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/al-farabi-metaphysics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=al-farabi-metaphysics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/al-farabi-metaphysics/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}