{
    "url": "albalag",
    "title": "Isaac Albalag",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Bakinaz Abdalla\n<bakinaz.khalifa@gmail.com>",
        "author_links": [
            {
                "mailto:bakinaz%2ekhalifa%40gmail%2ecom": "bakinaz.khalifa@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nBakinaz Abdalla\n&lt;<a href=\"mailto:bakinaz%2ekhalifa%40gmail%2ecom\"><em>bakinaz<abbr title=\" dot \">.</abbr>khalifa<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Aug 20, 2020"
    ],
    "preamble": "\n\nIsaac Albalag stands out as one of the most rigorous representatives\nof the school of Jewish Averroism which flourished in Western Europe\nin the thirteenth century and lasted until the Renaissance. The\nmembers of this school, such as Ibn Kaspi, Shem Tov Ibn Falaquera,\nMoses Narboni, Isaac Polqar, Gersonides, and Elijah Delmedigo,\nregarded Averroes’ philosophical writings, particularly his\ncommentaries on Aristotle, as the main source for the study of\nscience and philosophy. The impact of Averroes on these philosophers,\nvaried as it was, extended to the question of the relationship between\nreligion and philosophy. Many Jewish philosophers, drawing upon\nAverroes’ religious epistemology, which established a\ntheoretical basis for reading Scripture and demonstrative sciences as\ndifferent representations of the truth rather than conflicting truths,\nundertook to interpret Judaism as a philosophical religion, a\nphilosophical-religious approach that was arguably championed by the\nprominent Jewish philosopher Maimonides (d.1204). Like most Jewish\nAverroists, Albalag occupied himself with purely philosophical\nquestions of physics, metaphysics, and epistemology, addressing them\nthrough the lens of Averroes. Characteristically, Albalag holds\nunreserved admiration for and faithfulness to Aristotle whose\nteachings he deems synonymous with the truth and which he\ndiscovers in the writings of Averroes. Restoring Aristotelianism and\nestablishing it among Jewish students of philosophy emerge as key\ngoals of Albalag’s philosophical enterprise. Within the\nframework of that enterprise, Albalag also engages with the crucial\nquestion of the relationship between Judaism and philosophy, uniquely\nanswering it by advocating the double truth doctrine.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Works"
        },
        {
            "#Logi": "2. Logic"
        },
        {
            "#Epis": "3. Epistemology"
        },
        {
            "#KnowBeliIntePerf": "3.1 Knowledge, Belief and Intellectual Perfection"
        },
        {
            "#HumaKnowMeanLimi": "3.2 Human Knowledge: Means and Limits"
        },
        {
            "#ConcBeinGodsExis": "4. Conception of Being and God’s Existence"
        },
        {
            "#GodWorlRela": "5. God-world Relationship"
        },
        {
            "#OrigWorl": "5.1 The Origin of the World"
        },
        {
            "#DiviWill": "5.2 Divine Will"
        },
        {
            "#DiviKnow": "5.3 Divine Knowledge"
        },
        {
            "#ProbDete": "5.4 The Problem of Determinism"
        },
        {
            "#Cosm": "6. Cosmology"
        },
        {
            "#CeleMoti": "7. Celestial Motion"
        },
        {
            "#RelaBetwReliPhil": "8. The Relationship Between Religion and Philosophy"
        },
        {
            "#TheoProp": "9. Theory of Prophecy"
        },
        {
            "#PoliThou": "10. Political Thought"
        },
        {
            "#Conc": "11. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nLittle is known about Isaac Albalag. All that we know about him is\nthat he lived in the second half of the thirteenth century either in\nCatalonia or Provence (Sirat 1985: 238). References to Albalag in the\nmedieval Jewish literature indicate that he was not a figure of\nfavorable reputation. His name appears in a number of Jewish writings\nusually in association with humiliating accusations of heresy. The\nKabbalist Shem Tov Ibn Shem Tov (d.1440), for instance,\naccuses Albalag of heresy for advocating a heretical view regarding\nthe fate of the human soul (Sefer ha ʾemunot [the Book\nof Beliefs], I:1). In Sefer Neveh Shalom (Indwelling of\nPeace), the fifteenth-century Spanish thinker Abraham Shalom\nattacks Albalag for eliminating the doctrine of creation by radically\nnaturalizing the account for celestial motion (Vajda 1960: 271).\nAlbalag’s worth as a philosopher did not go unnoticed,\nnotwithstanding. Isaac Polqar (14th century), the author of\nʿEzer ha-dat (The Support of Faith) holds Albalag in\ngreat esteem and cites him approvingly in dealing with the\ncontroversial issue of the origin of the world (ʿEzer\nha-dat: part II: p.46).\n\nAlbalag wrote only one treatise, Sefer Tiqqun ha deʿot\n(The Emendation of the Opinions)—I here employ Manekin’s\ntranslation of the title (Manekin 2007: 140)—which is a\ntranslation with commentarial notes on the first two sections of Abu\nHamid al-Ghazali’s encyclopedic treatise kitāb\nMaqāṣid al-Falāsifah (The Opinions of the\nPhilosophers), Logic and Metaphysics. The third section, Natural\nPhilosophy, was completed by Isaac Polqar (Vajda 1960: 268).\n\nTwo goals stand behind the composition of the Tiqqun. The\nprimary one, as the title reveals (Emendation of the Opinions), is\ncorrective. Motivated by confidence in Aristotelianism, Albalag adopts\na critical stance towards any doctrine that deviates from Aristotelian\nteachings and rules. For him, most errors in the philosophical\ndiscourse are instances of deviation from Aristotle or\nmisunderstandings of his teachings. The cumulative literature of\ncommentaries on Aristotle, excluding Averroes’ commentaries, is\nreplete with such instances. Avicenna is particularly regarded by\nAlbalag as a major source of error and thus the process of\n“emendation” (Tiqqun) largely consists in\nsystematic critiques of Avicennian philosophy. But Avicenna is not the\nsole target of criticism, though he is the central one. Albalag also\ncriticizes other philosophers such as al-Farabi, Maimonides, and\nal-Ghazali—it is not unlikely that Albalag thought, like\nMedieval Latin philosophers, that Maqāṣid\nal-Falāsifah was a genuine representation of\nal-Ghazali’s philosophical view (for al-Ghazali’s\nphilosophical image in Latin literature see Salman 1999; Shihadeh\n2011).[1]\nMaqāṣid al-Falāsifah encompasses a concise\npresentation of the opinions of the philosophers, and as a result it\nfurnishes Albalag with an ideal framework for pursuing the announced\nprocess of “emendation” (Tiqqun). In most of his\ndiscussions, critiques, and corrections Albalag derives what he\nregards as the correct understanding of Aristotle from Averroes’\nwritings. \n\nThe second goal of the Tiqqun is pedagogical. Here, again,\nal-Ghazali’s Maqāṣid al-Falāsifah\nserves as an adequate vehicle. Thanks to al-Ghazali’s style\nwhich is free of complexities and accords with “popular\nbeliefs”, the Maqāṣid provides a suitable\nmedium for instructing students who have little training in philosophy\n(Tiqqun preface: 4). By translating and commenting on\nal-Ghazali’s Maqāṣid, Albalag hopes to offer\na piecemeal instruction in philosophy, starting with a presentation of\nGhazali’s summary of the doctrines of the philosophers and\nculminating in the establishment of Aristotelian demonstrative\ndoctrines. Overall, the Tiqqun follows the structure of the\nMaqāṣid except on some occasions where Albalag\nengages in large digressions.\n2. Logic\n\nThe first part of the Tiqqun (Logic) is, more or less, a\nfaithful translation of the Maqāṣid. Although this\npart is generally unoriginal, it may still be credited with a specific\ncontribution. Manuscripts of the Tiqqun include a sympathetic\ndiscussion of the fourth figure of syllogism. This figure was\nattributed by most Medieval logicians to Galen, though this\nattribution remains disputed in modern scholarship (Rescher 1965;\nSabra 1965), and was dismissed as lacking utility and\n“naturalness” (see Gersonides Sefer ha-heqqesh\nha-Yashar  [The Book of the Correct Syllogism]: 147). It is not\nclear, however, whether Albalag himself wrote this discussion or\nwhether it was written by Abner of Burgos, a thirteenth-century\nJewish-convert-to-Christianity philosopher, as suggested by some\ntextual evidence (Vajda 1960: 275–276).  In any case, the\ninclusion of this discussion in the Tiqqun independently of\nany explicit criticism indicates that Albalag agrees with its positive\nattitude towards the fourth figure of syllogism.\n\nThe Aristotelian syllogism does not determine a specific order for the\nmajor and minor premises. Hence, the terms comprising the premises,\nthe “unique major” and “minor” terms and the\nshared middle term, may be arranged in three possible figures as\nfollows: \n\n in the first figure, the middle term is subject in one premise\nand predicate in the other, \n in the second, it is subject in both premises, and \n in the third, it is predicate in both (Manekin 1996: 50).\n\n\nSome later logicians distinguished the order of the major and minor\npremises with the result that the first figure was divided into two\nfigures: \n\nin the first, the middle term is the subject in the minor and\npredicate in the major premises, and \n in the second, it is the subject in the major and the predicate\nin the minor premises (ibid, 1996: 50). \n\n\nThe additional fourth figure “is sometimes placed after the\nfirst figure, rather than the third” (ibid, 1996: 50).\n\nThe Tiqqun provides a quasi-defense of the fourth figure as a\n“valuable” form of reasoning (Tiqqun n.5:12).\nThis interrupts Albalag’s overall adherence to Averroes who,\nlike the majority of Medieval logicians, rejects the fourth figure due\nto considerations that have to do with “naturalness.”\nAccording to Averroes, “the form of reasoning embodied in the\nfourth figure of syllogism does not exist in us by nature” and\ninvolves “absurd self-predication” (Manekin 1996: 56). In\nHebrew logical writings, limited attempts were advanced to establish\nthe validity of that figure, most famously by Gersonides. The\ndiscussion in the Tiqqun is another attempt to this effect\nwhere the author, interestingly, subjects even Aristotle to criticism\nfor omitting this form of reasoning (Tiqqun n.5: 12).\n3. Epistemology\n3.1 Knowledge, Belief and Intellectual Perfection\n\nLike most Medieval Aristotelians, Albalag understands the ultimate\ngoal of man in terms of intellectual perfection (Tiqqun\npreface: 2–3, n.30: 42; cf. Maimonides,\nGuide III:54; Farabi, Selected Aphorisms: 61;\nAverroes, Epistle on the Possibility of Conjunction: 103). To\nfulfill this goal one has to attain knowledge of existents in a manner\n“that dispels doubt” (Tiqqun preface: 3). The\nformula of “dispelling doubt” points to the conception\nof certainty (yaqīn), which is defined in the Arab\nAristotelian tradition as a cognitive state in which the cognizer\nacquiesces that what she perceived is necessarily true and cannot be\notherwise (see Black 2006: 15–25). In line with this tradition,\nAlbalag specifies the logical tool of demonstration as the\nmeans for fulfilling the criterion of dispelling doubt (i.e.,\nattaining certainty).\n\nThis, however, raises a difficulty, for the ultimate goal of man would\nseem to be exclusively tied to philosophy, while the role of religion\nwould be meager. Although this difficulty is not peculiar to Albalag,\nit is particularly strong in the Tiqqun where a notable\ndichotomy between ʾemunah (belief) and\nyediʿah (scientific knowledge) serves to confine\nreligion/Scripture to a domain of knowledge that is quantitatively and\nqualitatively different from demonstrative knowledge (i.e., prophetic\nknowledge). Whether this knowledge qualifies as an alternative or a\nparallel means to philosophy in fulfilling the epistemic requirement\nof intellectual perfection is a complex question. Insofar as the\nTiqqun is concerned, ʾemunah can rightly be\nequated with fideism (see Tiqqun n.30: 38, 51), unlike the\nphilosophical conception of belief (for which\nʾiʿtiqād and taṣdīq were\nthe basic technical terms in Arabic) advocated by many Jewish and\nMuslim philosophers and theologians (see, for instance, al-Farabi \nBook of Demonstration: 63–4; Saʿadia Gaʾon \nBook of Beliefs: 14; Maimonides Guide\nI:50). In view of the latter, belief consists in judgment or\naffirmation, following from cognitive processes and syllogistic\nreasoning, that a given perceived object is true. In this way, belief\nis said to be associated with certainty or approximation of certainty\ndepending on the form of reasoning.\n\nThe Tiqqun, by contrast, points to a traditional conception\nof belief; one that amounts to simple acceptance of a given Scriptural\ndoctrine or a set of doctrines as true without prior rational\njustification (Tiqqun n.30: 51). Simple belief can always be\nregarded as a source of certainty on account of prophetic authority\nand this appears to be the basic standpoint of the Tiqqun\n(for background on the conception of belief in Jewish thought see\nWolfson 1942: 213–261; Kellner 1986; Rosenberg 1984:\n273–307). Yet it is important to consider the implications that\nthe Tiqqun’s extreme skeptical stance in regard to\nprophetic knowledge raises for this standpoint. The Tiqqun\nencompasses a number of significant remarks stressing the\ninaccessibility of the Torah's prophetic secrets to non-prophets\n—we will see below that the Torah has two layers of esoteric\nknowledge, prophetic and philosophical.  What remains is the layer of\nphilosophical knowledge to which philosophers, as Albalag points out,\ncould have access. Accessing this layer of knowledge essentially\ndepends on allegorical interpretation of Scripture in terms of what\nwas learned from demonstrative sciences (see below). This means that\nwhatever assent Scripture evokes in a person who is well-trained in\ndemonstrative sciences (i.e., a philosopher) will be of the type of\nreason-based, namely demonstrative, assent (cf. Averroes Decisive\nTreatise: 17–18). It would, thus, be beside the point to\nspeak of “simple belief” (ʾemunah pashoṭah),\nunless we grant that simple faith attaches to the surface layer of\nScripture. But this, again, would be implausible, since Albalag admits\nthat this layer is addressed to the multitude of people who,\n“like animals”, lack rationality, rather than philosophers\n(Tiqqun n.30: 45; for further discussion see Guttmann\n1945).\n3.2 Human Knowledge: Means and Limits \n\nAlthough Albalag does not devote a specific discussion to the theory\nof knowledge, many questions pertaining to the limit, means, and\nfeatures of human knowledge recur throughout the Tiqqun. His\ntreatment of these questions show indebtedness to Aristotelian\nepistemological theories as expounded by Arab Aristotelians, in\nparticular Averroes. Following the framework of the theory of\nrepresentational knowledge, standard among Arab Aristotelians, Albalag\ndivides knowledge into representation and assent. The former, which is\na prerequisite for the latter, is acquired by definition, while assent\nis acquired by a proof (Tiqqun [Logic]: 98; cf.\nMaqāṣid: 12). As noted previously, Albalag adopts\nthe Aristotelian theory of syllogism, assigning a primary significance\nto demonstrative syllogisms in evoking certain assent. Moreover,\nlike Averroes, Albalag places conspicuous emphasis on the empirical\nfoundation of human knowledge (for Averroes’ epistemology see\nBlack 2019). Intelligible thoughts arise in the soul through the\ncognitive process of abstraction and syllogistic reasoning. Without\nexternal images, Albalag affirms, it would be impossible for the soul\nto apprehend the intelligible forms, just as it is impossible for a\nperson who is deprived of visual data to apprehend the quiddity of\ncolors (Tiqqun, n.11: 16, n.44: 71; cf. Aristotle \nDe Anima III, 7, 431a, 14–17).\n\nAlthough the Tiqqun is generally characterized by confident\nrationalism, it involves skeptical elements that echo\nMaimonides’ critiques of the limitation of the human intellect\nin regard to metaphysical knowledge (for these critiques in Maimonides\nsee Pines 1979; Stern 2013). Albalag admits, like Maimonides,\nthat attaining complete knowledge of immaterial beings lies\nbeyond the capacity of the human intellect. The reason for this\nlimitation is, first and foremost, the material component of human\nbeings (ḥomer) which acts as both a constant impediment\nto the pursuit of knowledge and a cause of intellectual deficiency\n(Tiqqun n.11: 16, n.38: 58; cf. Guide\nIII:9).\n4. Conception of Being and God’s Existence\n\nAvicenna’s proof of God’s existence, famously known as\n“Burhān al-ṣidiqin”, Demonstration of\nthe Truthful (Mayer 2001), occupies a good deal of Albalag’s critical\ndiscussion. The proof is meant to be a metaphysical proof, one that\ntakes place in the science of Metaphysics and proceeds from analyses\nof the conception of existence qua existence.\n\nAvicenna divides “actual” beings, as opposed to impossible\nthings, into necessary in itself and possible in itself but necessary\nthrough another (Davidson 1987: 292–3; McGinnis 2010:\n159–164). The necessary in itself is that which has existence in\nits essence and an impossibility arises whenever it is assumed not to\nexist. By contrast, the possible in itself but necessary through\nanother is that which “has no existence in essence” and\n“no impossibility” arises whether it is assumed to exist\nor not (Avicenna al-Najāt: 546; cf.\nal-ʾisharāt: 122; cf. al-Ghazali\nMaqāṣid: 100–101). In other words, both\nexistence and non-existence are equal states with respect to it. This\nlatter point is crucial to Avicenna’s proof, for it stipulates\nthat there must be an external cause that ultimately preponderates\nexistence over non-existence in things that are possible. This cause\nmust be necessary in itself. Considering all possible things as an\n“aggregate” (jumlah), two alternatives arise in\nregard to the cause of that aggregate (Avicenna,\nal-Najāt: 567–8): either the aggregate of possible\nthings is self-caused or caused by something external. Avicenna\ndismisses the former alternative as impossible because the nature of\nwhat is possible in itself does not change independently of a cause;\npossible things become necessary only through other causes. Hence, an\naggregate of possible things is also possible in itself and cannot be\nself-caused. Furthermore, “a chain” (silsilah) of\npossible things cannot continue ad infinitum and it must end\nto a being that is necessary in itself. The trait of “necessary\nexistence” further entails a number of divine attributes such as\noneness, simplicity and goodness, which permits identifying the\nNecessary Existent with the deity (Adamson 2013: 172).\n\nTo Albalag, Avicenna’s proof of God as Necessary Existent\nappeared to involve flagrant deviations from Aristotle. Firstly,\nAvicenna’s procedure for establishing the existence of the First\nPrinciple in the science of metaphysics is methodologically incorrect.\n(Tiqqun n.8: 13–14). Appealing to Averroes, Albalag\nargues that the existence of the prime mover must be accepted from\nnatural philosophy—not insofar as it is the deity—while\nmetaphysicians proceed therefrom in examining its states and\nattributes. Obviously, the theoretical basis for this argument is\nAristotle’s rule that “no master of any art can\ndemonstrate the proper principles of his art”\n(Metaphysics IV 1003a21–22), which, according to\nAverroes, means that a given science does not demonstrate the\nexistence of its subject, but must concede to their existence either\nas something which is “self-evident” or as\n“something that has been demonstrated in another science”\n(Wolfson 1950–1 : 691). Since the First\nPrinciple is the subject matter of metaphysics, its existence cannot\nbe established in that specific science.\n\nSecondly, Avicenna breaks away from Aristotle in that he proceeds in\nestablishing the existence of the First Principle from analyses of the\nconception of being rather than motion and moved objects (for\nAristotle’s argument see Physics 7 & 8). In order\nto establish the Necessary Existent, Avicenna proceeds from a\nconception of being that Albalag, following Averroes, dismisses as\nspurious (for Averroes see al-kashf: 14). His discomfort with\nthis conception has to do primarily with the fact that it is alien to\nAristotle. But Albalag additionally speaks of errors and absurd implications,\nespecially in the science of metaphysics, that follow from\nAvicenna’s method of distinguishing two types of necessary\nexistents, i.e., that which is necessary in itself and that which is\nnecessary by another. One implication pertains to the nature of\nseparate intellects. Assuming that anything which is not\nnecessary in itself involves two modes, necessity and possibility, as\nAvicenna holds, then separate intellects would also involve both\nnecessity and possibility. This, however, absurdly clashes with the\nessential nature of separate intellects as immaterial beings, since\npossibility must reside in a substratum (Tiqqun n.8: 14, \nn.29: 27).\n\nThese deviations from Aristotle provided Albalag with sufficient\nreason to reject the metaphysical proof of God. Moreover,\nAvicenna’s supplementary arguments, as reproduced by al-Ghazali\nin the Maqāṣid, to the effect that the Necessary\nExistent is one, simple and incorporeal fall short of satisfying the\nepistemic criterion of dispelling doubt (i.e., certainty), unlike\nAristotle’s argument from motion which, as Albalag asserts,\n“dispels doubt” (Tiqqun n.33: 53). But although\nAlbalag only trusts Aristotle’s argument, he points to a subtle\nproblem whose origin goes back to ancient commentaries on Aristotle:\nthe problem of the relation of the Prime Mover to the deity (for this\nproblem see Avicenna Shifāʾ\n[Metaphysics]: 13). Aristotle’s argument from motion\narrives at the existence of a mover that is not a body or a force in a\nbody. But whether that mover is the First Principle/Cause, i.e., the\ndeity, or a first effect remains an open question (Tiqqun\nn.8: 14, n.38: 61). Philosophers hold no unanimous answer to this\nquestion. While Avicenna concludes that the deity is ontologically\nsuperior to the Prime Mover known from Aristotle’s analyses of\nmotion (Tiqqun n.38: 61), Averroes identifies the Prime Mover\nwith the deity in all his writings (see for instance the\nCommentary on Metaphysics: 172)—the exclusion being, as\nAlbalag correctly notes, the Epitome of Metaphysics (see\nTalẖīṣ mā baʿd\nal-ṭabiʿah: 149) where Averroes follows\nAvicenna’s standpoint (Tiqqun n.69: 96).\n\nCuriously, Albalag does not immediately side with either camp.\nHowever, his discussions of the relation of the Prime Mover to the\ncelestial and sublunary realms confirm Averroes’ standpoint by\nestablishing the primacy of the Prime Mover as a cause of all\nsublunary and celestial entities, and Its absolute unity and\nsimplicity, two essential specifications of the deity (see below).\n5. God-world Relationship\n\nTo reconstruct a rough picture of Albalag’s understanding of the\nGod-world relationship, we consider three interrelated themes: the\norigin of the world, divine will, and divine wisdom.\n5.1 The Origin of the World\n\nOn scientific grounds, Albalag dismisses the doctrine of temporal\norigination as “defective” and accepts the eternal\nexistence of the universe as an indisputable truth (we will see below\nthat he accepts the former on the authority of Scripture). Albalag,\nhowever, attempts to present the Aristotelian theory of eternity and\nits fundamental premises in a theologically appealing fashion. Thus,\nhe introduces the theory of “eternal origination”\n(ḥidūsh neṣaḥi) which maintains that\n“there was no moment at which the universe was not\noriginated” (Tiqqun n.30: 30; cf. Tahāfut\nal-Tahāfut, Third Discussion). That the universe has no\ntemporal beginning is a premise that Albalag accepts based on\nAristotle’s demonstration of the eternal existence of spheres\nand celestial motion (see for instance Tiqqun, n.30: 30,\n60:84–97; cf. De Caelo I: 2–3). What remains is\nto show that the universe is not self-sufficient. This procedure is\nnecessary in order to avoid confusing the philosophical doctrine of\neternity with that of Epicurus which maintains that “the\nuniverse has no cause” (Tiqqun n.30: 45).  More\nspecifically, it shows that the philosophical conception of eternal\ncausation is not heretical and does by no means eliminate the idea of\norigination.\n\nFor this purpose, Albalag engages in a philosophical discussion in\nwhich he sets out to demonstrate the consistency of the theory of\neternal origination—in addition, he offers interpretive notes to\nshow that the doctrine of eternal origination is not offensive to\nScripture (for the interpretive notes see Feldman 2000: 19–30).\nHis discussion indirectly links to some elements of al-Ghazali’s\nrefutation of philosophers in Tahāfut al-Falāsifah\nconcerning their conceptions of God and the universe.\nAl-Ghazali’s central point of contention is that the\nphilosophers’ exposition of the relation of God to the universe\ndwells on two premises that form an oxymoron, namely that the universe\nis eternal and that it has an Agent and Maker (see Tahāfut\nal-Falāsifah third and tenth discussions). Contrary to\nal-Ghazali, Albalag holds these premises to be absolutely consistent.\nWhat is more, he introduces the theory of eternal origination as a\nmore adequate way for articulating the universe and divine causation\nthan the doctrine of temporal origination, the “defective”\ndoctrine of the multitude which confines divine causation to\ntemporality. If perfection indicates absoluteness, then the term\n“perfect” (shalem) applies to both “the\nabsolute” (muḥlaṭ) universe, which\neternally and immutably exists, and “the absolute” Creator\nwhose act of creation is free from temporal or circumstantial\nlimitations.\n\nThe doctrine of eternal origination rests on a conception of the\nuniverse as a moving entity in which the cause-effect relationship is\na relation between a mover and a moved object (see Tiqqun\nn.30: 29; cf. Tahāfut al-Tahāfut:  third discussion,\n101). In the natural realm, all processes of generation and corruption\nconsist in motion—for instance the movement from potential to\nactual existence—and occurs through motion. All natural changes\ndepend on the movements of the celestial spheres, which in turn depend\non the Mover of the outermost sphere, the Prime Mover (Tiqqun\nn.30: 29,  n.39: 62).\n\nBeyond this well-known Aristotelian conception of the Prime Mover as\nthe ultimate cause of motion in the universe, Albalag seeks to prove\nthat the very act of producing motion is sufficient to make the Prime\nMover a cause/creator of the universe. To this end, he differentiates\nbetween two classes of existents in terms of their dependence on\nmotion: \n\nexistents whose subsistence requires motion, and \n existents whose subsistence do not require motion; only\ntheir coming-to-be requires motion. \n\n\nThings belonging to the latter class continue to exist after their\ncauses perish—for instance, a house continues to exist after the\ndeath of its builder. By contrast, things belonging to the former\nclass perish as soon as motion ceases—for instance wind does not\ncontinue to exist as soon as the motion of air ceases (Tiqqun\n30: 30; cf. Averroes Tahāfut al-Tahāfut, fourth\ndiscussion: 156–8). These things are said to be more in need of\na cause than things belonging to the former class are, for should the\ncause disappear from existence “for a twinkling of an\neye”, they would necessarily perish (Tiqqun n.30: 30).\nThe universe as a whole belongs to this class. Both the natural and\ncelestial realms subsist because their constituent “parts are\neternally originated” through the motion produced by the Prime\nMover; the parts of the natural and celestial realms referring to\nsublunary existents and the “successive” stages of\ncelestial motion respectively (Tiqqun, n.30: 30). \n5.2 Divine Will\n\nWithin the framework of the theory of eternal creation, Albalag deals\nwith another problematic issue, which also links to al-Ghazali’s\nrefutations of philosophers in Tahāfut\nal-Falāsifah: the nature of divine causation, whether it is\nvoluntary or involuntary. In this treatise, Al-Ghazali maintains that\nvolition is a fundamental characteristic of acting causes; “the\nagent must be willing, choosing and knowing what he wills ”\n(Tahāfut al-Falāsifah, third discussion:\n135). Causes that act by necessity, that is, without willing or\nchoosing, fall in the category of natural involuntary\ncauses. Proceeding from this conception of agency, Al-Ghazali asserts\nthat the conception of divine causation that philosophers espouse\ndeprives the deity of volition. Again, the theory of eternity is\nbrought into focus. Necessity is a key postulation of the scheme of\neternity. Philosophers, according to al-Ghazali, hold the perpetual\nprocession of the universe from God to be necessary in the same manner\nthat the connection between “the sun and light” is\nnecessary (Tahāfut, third discussion: 135;\ncf. Tiqqun n.23: 24). In opposition to al-Ghazali, Albalag\nbroadens the conception of agency to include both involuntary natural\nand voluntary causes. However, he emphasizes that a natural cause is\ninsufficient to produce an effect. It must primarily be moved by a\nvoluntary agent. In the empirical world, natural causes bring forth\neffects inasmuch as they are being moved by close or remote voluntary\nagents. In this connection, Albalag states that “in this way all\nmaterial effects are related to God and it is said of Him that He is\ntheir Maker”, vaguely indicating that God is the ultimate\nvoluntary cause in the universe. Other than articulating the God-world\ncausal relationship in terms of motion, Albalag barely explains the\nnature of divine will or the manner in which it causes the perpetual\nproduction of the universe.\n\nIn other contexts, Albalag argues, in opposition to al-Ghazali, that\ndivine agency is neither natural nor voluntary, but an intermediary\ntype that lies beyond human understanding. This, however, does not\nmean that God has no will. The truth is that God has a capacity that\nconstitutes for Him what will constitutes for human beings. The exact\nnature of this capacity, which human beings call will, is obscure,\neven though demonstration establishes that it exists. Nonetheless,\nconsidering the defining criteria of the conception of divine\nperfection, it is inferred that this capacity shares no features with\nempirical will. Unlike empirical will which follows from a stimulus\nand seeks to fulfill a desire, divine will is self-sufficient. While\nempirical will is temporal, originates with a stimulus and perishes as\nsoon as the desire is fulfilled, divine will, consistently with the\neternal and immutable nature of God, is eternal and immutable, being\ncharacterized as a benevolent and immutable capacity to eternally\n“choose” the best of two opposite things: \n\n\nEven though He possesses power over everything, the manner of His will\nis such that it constantly attaches itself to a single object, the\nbest among two opposites. Certainly, if He willed evil He would be\ncapable of doing it, but His will desires nothing but what is good\nonly. (Tiqqun n.23: 24 [my translation]; cf. Guide\nIII:25 where Maimonides states that God acts in the best way) \n\n\nOn this basis, the universe maintains a fixed natural order such that\n“nothing can be added to or reduced from it”\n(Tiqqun n.30: 39), since God’s will continuously and\nimmutably chooses this order.\n5.3 Divine Knowledge\n\nIf God possesses will, then He must also possess wisdom, since\ndeliberation and choosing assume knowledge of the thing that is\nwilled. That is to say, the God-world relationship is based on will\nand wisdom. In discussing the nature of divine knowledge, Albalag\ndisplays an obsession with divine perfection. Thus, he differentiates\nbetween divine and human knowledge on the basis of type rather than\nrank, removing any ground for comparing them or inferring premises\nabout God’s mode of apprehension and knowledge from the\ncharacteristics of human knowledge and cognition. This idea of the\ndistinctiveness of divine knowledge, and, indeed all divine\nattributes, is best expressed in terms of Maimonides’ theory of\nequivocation. According to Maimonides, terms such as wisdom, power and\nwill are predicated of God and creatures only equivocally. When\npredicated of God and other creatures, these terms are semantically\ndissimilar, sharing only the names rather than meaning (Guide\nI:56; cf. Tiqqun n.23: 24). Epistemologically speaking,\nmoreover, they are not informative; constituting an artificial\nlanguage, which we predicate of God owing to our inability to fathom\nand signify the corresponding characteristics in Him (Benor 1995;\nStern 2013: 198–204).\n\nOn this conception of divine attributes, Albalag examines\nAvicenna’s theory of divine knowledge, as reproduced by\nal-Ghazali in the Maqāṣid, according to which\n“God knows particulars in a universal fashion”\n(Maqāṣid: 118). Avicenna’s theory of divine\nknowledge has been subject to different interpretations (Marmura 1962:\n299–312; Adamson 2005: 257–278; Belo 2006: 177–199).\nFor Albalag, it simply means that God’s knowledge is universal.\nSince this way of articulating divine knowledge implies a\ncorrespondence between divine and human knowledge, Albalag naturally\nrejects it and scolds al-Ghazali for diffusing improper doctrines\nabout God. In opposition, he insists that God’s knowledge is\nopposite in characteristics, not merely superior in rank, to human\nknowledge: it is neither particular nor universal, it is atemporal,\nindivisible, absolutely actual and self-sufficient, being exclusively\ndependent on the mode of self-intellection which is peculiar to God\nand separate intellects (Tiqqun n.42:  76).\n\nGiven this radical notion of transcendency, it would seem that the\ncelestial realm and sublunary species and individuals lie beyond the\ndomain of God’s knowledge. But Albalag insists that God’s\nknowledge is all-encompassing. To establish this, he appropriates\nAverroes’ conception of the divine essence as a unified Form of\nthe forms of all existents (Averroes Commentary on\nMetaphysics: 197). Through the very act of self-intellection,\nGod, as Albalag concludes, apprehends all existents, including\nsublunary existents (Tiqqun n.42: 66). This conclusion is\naccompanied by an important clarification for the sake of maintaining\ndivine perfection and transcendence unimpaired: forms contained in the\nessence of God do not exactly correspond to the forms of sublunary\nthings insofar as they are material objects, but exist in the divine\nessence in the noblest possible manner, being absolutely simple,\nindivisible and independent of accidents.\n5.4 The Problem of Determinism\n\nIn the Maqāṣid, al-Ghazali restates the basic\nelements of Avicenna’s deterministic metaphysics and its\nimplication for the nature and domain of divine knowledge. He\nexplains, in light of Avicenna’s conception of being, the manner\nin which God knows future events. Possible things are necessitated by\ntheir causes; when a cause exists, the effect must necessarily follow.\nAs such, knowledge of a cause allows one to predict, beyond doubt, the\noccurrence of the associated effect or event. Inasmuch as God has\ncomplete knowledge of the hierarchy of the causes, He has knowledge of\nall future events (Maqāṣid: 118; cf. Avicenna \nal-Najāt: 587–599)\n\nFor Albalag, this deterministic worldview on which al-Ghazali’s\naccount of God’s knowledge of future events dwells follows from\na narrow understanding of the cause-effect relationship. Possible\nthings, according to Albalag, are realized by either material or\nefficient causes, or both. Some of these causes are either volitional\nor natural. Volitional causes, “hinge solely on the power of the\nchooser”, which means that effects are not necessary and cannot\nbe predicted. Effects arising from natural causes are necessary, only\nwhen the natural causes are necessary, that is, when they maintain a\nfixed order and cannot be hindered by other accidental or voluntary\ncauses. An example of this is a solar eclipse. Foreknowledge of this\nevent and ones like it are correspondingly necessary with respect to\nthe knower. By contrast, some natural causes, despite having an\norder, can be impeded by voluntary or accidental causes. In such\ncases, the effects are not necessary, and hence it is not possible to\nmake certain predictions about their occurrence. \n\n\nI maintain that for any possible thing, if all its proximate an remote\ncauses succeed each other essentially and maintain order in their\nactions, and no hindrance can prevent any of them, then it is to be\njudged the same as a necessary thing with respect to knower. However,\nregarding other possible things one cannot know with certain knowledge\nthe fact or the time of their occurrence before their occurrence.\n(quotation from Manekin 2007: 141)\n\n\nAlbalag is aware that this note entails a denial of God’s\nknowledge of every future event. For this reason, he clarifies that\nhis intention is not to propose that God is ignorant of future events,\nfor, indeed, he thinks that God knows them, but in a manner that is\ndifferent from human knowledge.\n\nAlthough Albalag is critical, overall, of al-Ghazali’s account\nof God’s foreknowledge, he recommends teaching it to the\nmultitude because it is easy for them to comprehend. Albalag still\npoints to the theological implication associated with it. \n\n\nWhen you examine al-Ghazali’s statements carefully you will find\nthat they entail the annulment of man’s choice and the\nconclusion that his actions are compelled, as well as the annulment of\nthe nature of the possible altogether. These opinions not only\nconstitute repudiation of philosophy but also heresy with respect the\nTorah. (Quotation from Manekin 2007: 142)\n\n6. Cosmology\n\nIn discussing the fundamental traits of the Necessary Existent,\nal-Ghazali considers the implications of the divine attribute of\nabsolute simplicity to the scope of divine causation and conception of\nthe universe. Al-Ghazali explains, following Avicenna, that from what\nis one and simple (i.e., the Necessary Existent) only one thing may\nproceed (Maqāṣid: 157;\ncf. al-Shifāʾ [Metaphysics]:\n326–334; al-Najāt: 649–657). Underlying this\nunderstanding of the scope of divine causation is a conception of the\nrelationship between cause and effect as one of correspondence;\n“the action must be consistent with the essential nature of its\ncause” (Kogan 1984: 249). Thus, a single cause has one act and\nproduces only a single effect. In keeping with this conception, and\nconsidering the absolute simplicity of the First Principle,\nal-Ghazali, describes an emanationist cosmology in which the First\nPrinciple causes multiplicity not directly, but through a\nchain of emanative intermediaries that successively proceed from one\nanother. The First Principle produces only one entity, the first\nintellect, by thinking Itself. In turn, the first intellect produces,\nby thinking its Cause and itself, the second intellect and the first\ncelestial sphere (Maqāṣid: 157). The reason for\nthis multiplicity is that the first intellect is not absolutely simple\nlike the First Principle, but complex: in addition to thinking its\nPrinciple, it thinks itself insofar as it is possible and insofar as\nit is necessary by virtue of the First Principle. The process of\nemanation continues in a descending manner, terminating with the\nActive Intellect, the intellect of the sphere of the moon which is the\nimmediate source of the forms of sublunary entities.\n\nConvinced that the scheme of emanation constitutes an unsatisfactory\ndeviation from Aristotle, Albalag devotes extensive discussions to\nelucidating its inconsistency and fallacies, and alternatively\nestablishing what he regards as the correct Aristotelian scheme.\nUnlike the scheme of emanation, this scheme ascribes the\nuniverse’s manifold existents to God’s direct causation:\n“from what is one and simple many things can come to be”\n(Tiqqun n.96:\n 69).[2]\n Albalag describes a hierarchical cosmological scheme of separate\nintellects and celestial spheres in which each separate intellect\nrelates to the corresponding sphere as a cause of motion while the\nFirst Principle/Intellect relates to all separate intellects as a\ndirect formal\n cause.[3]\n Two theories account for this cosmological scheme: \n\nthe theory of divine knowledge, which, as illustrated formerly,\nmaintains that the First Intellect apprehends the forms of all\nexistents by thinking Its essence, and \n the Aristotelian theory of “cognitive identification”\naccording to which the knowing subject, the known object and thinking\nare identical in actual thinking (for further details about this\ntheory see Black 1999). \n\n\nBy definition, separate intellects are intellects in actu\nwhose substantiation is the very act of thinking. Without\nknowledge, the essence of the separate intellect would be nullified.\nThus, separate intellects, just like the First Intellect, have actual\nknowledge of the forms of all existents. In actual thinking, the\nknower, the known object, and the act of thinking are identical\n(Tiqqun n.42: 65), the relationship of identity being\nparticularly formal as Aristotle’s dictum of cognitive\nidentification establishes (De Anima 3.8 431b21). This means\nthat in separate intellects “essence/form”, the known\nobject and the act of thinking are the same. In this way, the First\nIntellect is said to be “the formal cause” of the separate\nintellects on the grounds that It provides them with “their\nforms”, i.e., the intelligible forms which they apprehend and by\nmeans of which they are what they are, intellects in actu\n(Tiqqun n.69:\n 98).[4]\n\nThis cosmological account, however, calls for explaining how separate\nintellects are differentiated. After all, separate intellects share\nthe feature of immateriality, hence they cannot be numbered.\nFurthermore, considering the fact that separate intellects share the\nsame epistemological content (i.e., the forms of all existents derived\nfrom the First Intellect) and that the knower is identical with the\nobject known, according to the Aristotelian dictum of “cognitive\nidentity”, separate intellects should all be identical. In the\nAvicennian-emanative scheme, intellects are numbered on account of the\ncausal relation between them, each intellect being the cause of an\nintellect emanating from it and “only God, who is at the top of\nthe series is an uncaused caused” (Wolfson 1958 : 244). By\nrejecting the conception of an emanative causal relationship between\nintellects, Albalag, however, could not speak of a distinction in\nterms of causal relation. Alternatively, he follows Averroes in\npositing ontological hierarchy as the differentiating factor between\nintellects (Tahāfut al-Tahāfut: fifth discussion:\n173). While each separate intellect derives its knowledge directly\nfrom the First Intellect, each stands in a specific hierarchical\nrelation to the First Intellect, the ranking of each intellect being\nin accordance with the extent of purity of its mode of apprehension;\nthe purer and simpler the mode of apprehension the closer the\nintellect in rank to the First Intellect. Overlap between these modes\nis not possible, which ensures that separate intellects remain\ndifferentiated.\n\nBeyond this cosmological account, Albalag indicates that multiplicity\nin the sublunary realm also comes forth from the deity; the First is\nsaid to be the cause of multiplicity inasmuch as It is the ultimate\ncause of the cosmic unity. Were it not for the unifying force that\nholds the parts together, the universe as a totality and its\nparts—each of which comes to be by virtue of a unifying force\nthat conjoins its constituent parts like matter and form and the\nelements—would not exist (Tiqqun n.69: 97; cf.\nAverroes Tahāfut al-Tahāfut, third discussion:\n108).\n7. Celestial Motion\n\nIn the Avicennian-emanative scheme celestial motion is ascribed to two\nprinciples: \n\n proximate movers (internal souls), and \n the separate unmoved intellects corresponding to the concentric\nspheres. \n\n\nWhereas the soul functions as the efficient cause of motion, the\nseparate unmoved movers function as the final cause of motion insofar\nas they represent an object of love and desire. The point is that\nsince celestial souls are corporeal and finite, they are insufficient\nto account for the spheres’ perpetual activities. The\nperpetuation of motion, accordingly, must be the function of\nimmaterial and incorruptible principles. These are the unmoved\nseparate intellects of which the mover of the outermost spheres is the\nhighest in rank (Avicenna Shifāʾ\n[Metaphysics]: 308; cf. Maqāṣid:\n149).\n\nAs with many of Avicenna’s theories, Albalag raises a number of\nobjections to this account of celestial motion. Firstly, Albalag\ndismisses the conception of complementary efficient-final causation as\nunwarranted, since, in his understanding, a final cause could hardly\ncontinue the activity of a terminated efficient cause. Secondly,\nAlbalag rejects the theory of the spheres’ animation by souls\n(For background on this theory see Wolfson 1962: 65– 93;\nFreudenthal 2002: 111–137).  His argument against that theory\nproceeds from the eternity premise as follows. Forces inhering in\nbodies (including celestial bodies) are finite. As such, they could\nhardly move the body in which they inhere infinitely. But we know that\nthe nature of spheres is such that they move eternally and this means\nthat celestial souls are superfluous in this regard. That Nature\n(ha tevaʿ) “does nothing in vain”\n(cf. Aristotle Politics 1252b30–1253a1;\nAverroes Commentary on Metaphysics: 178) prompts the\nconclusion that spheres do not have souls (Tiqqun n.61: 87).\nAlthough the basic lines of this argument are derived from Averroes,\nAlbalag seems to adopt a firmer position than Averroes in denying the\nanimation of spheres by souls. While Averroes rejects Avicenna’s\ntwofold account of celestial motion and argues in some of his works\n(especially De Substantia Orbis: 71; cf. Commentary on\nMetaphysics: 164) that celestial motion could hardly be dependent\non a finite force inhering in the celestial body, he uses the term\nsoul interchangeably with form in reference to the principles of\nmotion in celestial spheres: the immaterial separate intellects. In\nother works, we still find indications that spheres are ensouled\n(e.g., Tahāfut al-Tahāfut, fourth discussion).\nThese variations in Averroes’ standpoint in regard to the theory\nof the spheres’ animation by souls have invited different\ninterpretations (see Donati 2015; Kogan 1984: 190–201).\n\nAs for Albalag, his account of celestial motion consistently\nattributes celestial motion to the efficient, formal and final\ncausation of separate intellects. Relaying on Averroes, while giving\nthe credit to Aristotle, Albalag argues that the three modes of\ncausation are one in the divine realm (cf. Averroes Commentary on\nMetaphysics: 149). While separate intellects are themselves\ninvariable, they produce motion in the spheres in three different\nmanners (Tiqqun n.64: 92).\n8. The Relationship Between Religion and Philosophy\n\nAlbalag is most famous in modern scholarship for his view of the\nrelationship between religion and philosophy. In the context of\nmedieval Jewish and Islamic philosophy, he stands out as perhaps the only\nphilosopher to straightforwardly stress, accept and account for the\ntension between philosophy and prophetic knowledge. His name is\nusually connected with the doctrine of the “double truth”,\nwhich maintains that the truth of prophecy and the truth of philosophy\nmay contradict each other while at the same time remaining\nsimultaneously true (Sirat 1985: 238; Zinberg 1973:\n107]; Vajda 1960: 264–265). The origin of this doctrine had long\nbeen attributed to Averroes and Latin Averroists until recent studies\nchallenged this attribution. Some scholars have argued that the double\ntruth doctrine never existed as an actual dogma (Dales 1984).\nSimilarly, some scholars question the attribution of the double truth\ndoctrine to Albalag (Guttmann 1966: 227–229) and Elijah\nDelmedigo, another Jewish Averroist whose treatment of the question in\ndiscussion involves some elements alluding to the double truth\ndoctrine (for Delmedigo, see Fraenkel 2013).\n\nThe discussion of the question of the relationship between religion\nand philosophy in the Tiqqun is complex and spans a number of\ncontexts. On the one hand, Albalag states in the preface to the\nTiqqun that there is no essential distinction between\nphilosophy and the Torah except that the former, addressing the select\nfew, conveys the truth in a demonstrative manner, while the latter,\naddressing the multitude, conveys the truth in a figurative language\nin accordance with their limited comprehension. By this means, Albalag\nseems to align with the understanding of religion as an imitation of\nphilosophy which was founded by al-Farabi and adopted by many Muslim\nand Jewish philosophers, most significantly Averroes and arguably\nMaimonides (see al-Farabi The Book of Letters: 19–26;\nMaimonides Guide: preface; Averroes Decisive\nTreatise: 1–3, 7–10). Both philosophers not only\nmaintain that religion and philosophy are compatible, but also accord\nphilosophy a crucial role in arriving at the true meaning of Scripture\n(Maimonides Guide: preface; Averroes Decisive\nTreatise: 1–3, 7–10). Furthermore, Averroes sets\nforth a religious epistemology based on the principle that\n“truth does not oppose truth; rather, it agrees with and bears\nwitness to it” (Decisive: 9). On this principle,\ncontradictions between al-Shariʿah (Religious Law) and\nphilosophy are viewed as mere apparent, rather than essential,\ncontradictions that result from the literary form of\nScripture—consisting in similes, metaphors and\nstories—which is directed to the multitude. Since\nal-Shariʿah cares for all people, “the red and\nblack”, it conveys the truth in different methods in accordance\nwith the diverse intellectual capacities of people and types of assent\nthey are fit for (ibid, 8). Only those who are adept in science\n(al-rasiẖuna fi-lʿilm) can have access to the\ninternal meaning of Scripture, which is designed according to the\ntruth as it is, thereby attaining certain, demonstrative, assent to\nScripture. Drawing on Averroes’ religious epistemology,\npost-Maimonidean philosophers, continuing Maimonides’\nphilosophical-religious \nenterprise,[5] \nundertook to interpret Judaism as “a philosophical\nreligion” by giving principles of Judaism that appeared to be in\nconflict with philosophy naturalistic interpretations (for the concept\nof philosophical religion see Fraenkel 2012: 5). In a similar vein,\nAlbalag engages in allegorical interpretations of some elements of the\nAccount of the Beginning, stating, in an obviously apologetic tone,\nthat “it is possible to extract the philosophical doctrine of\neternal creation from the Torah” (Tiqqun n.30,\n33). \n\nOn the other hand, Albalag reveals ambivalence about the feasibility\nof the philosophical approach to religion. His main stated concern is\nthat the true meaning of Scripture is not readily accessible. The\nreason is that prophetic knowledge, as Albalag repeatedly affirms, is\nexclusive to prophets and even the ablest philosopher has no access to\nthe “intention” of the prophet. Thus, when philosophers\nassign philosophical meanings to verses of the Torah they may just be\nswerving away from their actual tenor. Albalag finds Maimonides to be\nparticularly at fault in this regard and therefore he labels him as\none of the “hasty” people (nemharim) of our time\nwho did harm not only to “faith”, but also to\n“wisdom” (Tiqqun n.1: 5; Tiqqun n.30:\n44). In their attempts to rationally support religious doctrines they\nacted “with ignorance” as they \n\n denied demonstrative philosophical doctrines, advocating,\ninstead, weak speculative arguments, and \n unhesitatingly ascribed meanings to Scripture in terms of these\narguments and based on their understanding of Scripture. \n\n\nTwo points of contention seem to underlie this critique. The first is\nthat those “hasty” people tend to compromise philosophy in\norder to satisfy theological considerations. The second is sceptical.\nWhile many philosophers confidently interpret Scripture allegorically\non the assumption that the internal meaning of Scripture accords with\nphilosophy, Albalag merges his interpretive notes on the Account of\nthe Beginning—the sole context where he offers interpretations\nof that sort—with remarks emphasizing the inaccessibility of\nprophetic knowledge to non-prophets.\n\nIn response, Albalag offers what may be characterized as a restrictive\nscheme for interpreting the Jewish Scripture in terms of philosophy.\nThis scheme regards demonstration as the means for attaining\nthe truth and Scripture as a divine source for the truth. Scripture\ncontains two layers of secrets: philosophical and prophetic. A\nphilosopher arrives at the former layer by engaging in allegorical\ninterpretation after he has obtained knowledge through demonstrative\nreasoning: \n\n\nfor one who seeks the truth, it is not proper [for him] to seek its\npremises from what he apprehends from Scripture by his own effort\nwithout primarily [engaging in] demonstrative reasoning. Rather, he\nhas to learn the truth first through demonstration and thereafter seek\nsupport from Scripture. (Tiqqun n.30: 37; cf. Averroes \nDecisive Treatise: 7) \n\n\nWhen Scripture does not agree with demonstrative knowledge, this\npoints to the presence of a deeper layer of secrets, prophetic secrets\nto which only a prophet has access. On this occasion, the disharmony\nbetween demonstrative and prophetic knowledge is treated with fideism,\nby accepting the Scriptural doctrine on the basis of simple faith. One\nshould not, however, abandon the demonstrative doctrine. Both\ndoctrines remain “true” (ʾemet) to the\nphilosopher-believer.\n\nThese claims lie behind the attribution of the double truth doctrine\nto Albalag in modern scholarship. It should be noted, however, that\nthe scope of application of the double truth doctrine in the\nTiqqun is meagre, being limited to the tension between\nreligion and philosophy in regard to the issue of the origin of the\nworld. Towards the end of his discussion of this issue Albalag\ndeclares that he accepts as “true” both the philosophical\ndoctrine of eternal creation and the biblical doctrine of temporal\ncreation, the former based on analysis of “nature” and by\nmeans of “demonstration” and the latter based on\n“the authority of the prophet by way of miracle”\n(Tiqqun n.30: 52). This peculiar way of treating the question\nof the relationship between religion and philosophy draws a parting\nline between Albalag and the tradition of Arab Aristotelians and\nJewish Averroists in which religion and philosophy are held to be\nseemingly different representations of the same truth. \n9. Theory of Prophecy\n\nUnderlying the double truth doctrine is a unique theory of prophecy\nthat credits Albalag with novelty. Deviating from the widely accepted\nconception of prophecy in medieval Jewish and Islamic philosophy,\nwhich views prophets as accomplished philosophers and qualitatively\nequates prophetic knowledge with philosophy, this theory links\nprophets and prophetic knowledge to the divine realm (i.e., the realm\nof separate intellects) while at the same time stressing the absolute\ntranscendence and unknowability of that realm. It correspondingly\nstresses essential distinctions between philosophical reasoning and\nknowledge, on the one hand, and prophecy and prophetic knowledge, on\nthe other. Prophets, according to Albalag, are extraordinary human\nbeings endowed with a special mode of apprehension. Thanks to this\nmode of apprehension prophets have access to knowledge that differs\nfrom philosophical knowledge in both content and type. Not only do\nprophets arrive at answers to questions that lie beyond the capacity\nof human reason, but they also grasp the truth in a transcendent\nmanner, independently of physical tools and the cognitive processes\nnecessary for rational knowledge (Guttmann 1945: 86).\n\n\nTheir [the philosopher’s and prophet’s] modes of\napprehension are distinct. Not only that, but they are [like two]\nopposites, since this [the philosopher] perceives intelligible [forms]\nthrough sensory objects, whereas the latter [the prophet] perceives\nsensory objects through intelligible [forms]. (Tiqqun n.30:\n44 [my translation])\n\n\nThis note suggests that the prophetic mode of apprehension is similar\nto that of separate intellects which is described in the\nTiqqun in similar terms: “if there exists a separate\nintellect in the universe whose knowledge is not obtained through\nphysical tools”, its “grasp of things would be completely\nopposite to that of the human [intellect]”\n(Tiqqun n.11: 16; cf. n.42: 67). The distinction in the mode\nof apprehension entails fundamental distinctions in the\ncharacteristics of the perceived knowledge. Human knowledge passes\nfrom potentiality to actuality. It is either universal or particular.\nIt is temporal and involves features of multiplicity, compositeness\nand materiality. By contrast, divine knowledge is transcendent; it is\n“neither particular nor universal.” It is constantly\nactual and absolutely indivisible, simple and atemporal\n(Tiqqun n.42: 67). In this way, prophetic knowledge, like\nknowledge of the separate intellects, is said to be qualitatively\ndistinct from philosophical knowledge. Radically maximizing the\ndistinction between prophecy and philosophy, Albalag emphasizes the\npossibility of contradiction. \n\n\nJust as the ways through which they [the philosopher and the prophet]\napprehend things are so distinct, their respective grasps of things\nare so distinct that it is possible for the former [the philosopher]\nto perceive from below [based on nature and reasoning] the opposite\n(hefekh) of what the latter [the prophet] perceives from\nabove. (Tiqqun n.30: 45 [my translation])\n\n\nThis theory of prophecy parts ways with the standard contemporary\ntheory of prophecy according to which prophets are accomplished\nphilosophers endowed with a strong imaginative faculty. By virtue of\nthis faculty, prophets, unlike philosophers, are able to carry out the\nnecessary political role of establishing laws conducive to the welfare\nof society, and reformulate theoretical knowledge in a language easy\nfor the multitude to understand. Whatever theoretical knowledge a\nprophet attains through emanation from the Active Intellect—the\nintellect of the sphere of the moon to which philosophers variably\nascribed epistemological and ontological roles in the sublunary\nrealm—accords with philosophical knowledge; the difference being\nparticularly quantitative (Macy 1986; Rahman 1958). Even the\nAvicennian theory of prophecy, which links the prophetic mind to the\ndivine realm, does not ascribe to prophetic knowledge a specific\nqualitative merit above philosophical knowledge; prophets apprehend\nthe principles of all existents, the middle term of every syllogism\nand intelligible forms instantaneously and effortlessly through divine\nintuition (ḥads). (Rahman, 1958: 32; Marmura 1963:\n49–51; Morris 1992: 84). That is, there are no grounds for\ncontradiction, as Albalag’s theory of prophecy suggests.\n10. Political Thought\n\nIn the context of medieval Jewish and Islamic philosophy, political\nthought was largely concerned with investigating the connection\nbetween social good and human happiness, on the one hand, and\nphilosophy and religion on the other. In the last section of the\nMetaphysics of the Maqāṣid, al-Ghazali\nrecapitulates Avicenna’s view of the relationship between social\nwelfare and religion. Proceeding from the Aristotelian dictum that\n“man is political by nature” (Aristotle  Politics\n1252b30–1253a1), al-Ghazali stresses that human beings cannot\ndispense with social interaction and cooperation for fulfilling their\nbasic needs and for the sake of attaining the highest good of man.\nThis, however, is not possible unless society is stable and justly\ngoverned. The realization of these conditions is tied to the existence\nof a lawgiver that enacts laws and promotes doctrines that are\nconducive to the social and spiritual well-being.\n\nRemarkably, Albalag starts the Tiqqun with the political\ntheme with which al-Ghazali concludes the Maqāṣid.\nThe preface to the Tiqqun offers a gloss on the political\nnature of human beings, emphasizing the essentiality of society to the\nindividual’s well-being and human survival in general. But,\nagain, society can be conducive to well-being only under specific\ncircumstances. From the point of view of a Medievalist like Albalag,\npluralism stands as a major enemy to social stability. The more\ndiversified the society the less stable and more conflict-fraught it\nis. Pluralism may result in constant warring among people to such an\nextent as to threaten human existence. Thus comes the need for a\nlawgiver who promotes social harmony by unifying people in creed and\npraxis.\n\nAlbalag accommodates the Torah into this political theme, assigning it\na crucial role in establishing social and political order and\nmaintaining the divinely ordained perpetual existence of the human\nspecies. Nothing in this outlook deviates from the view of Medieval\nAristotelians regarding the socio-political benefit of Divine Law.\nMaimonides, for instances, deems the Torah a key factor in the\nestablishment and preservation of social well-being. Still Albalag\ndeparts from Maimonides, as well as prominent Muslim philosophers such\nas al-Farabi and Averroes, in that he confines the Torah to this\nspecific socio-political purpose. These philosophers define divine Law\nin terms of its goal: unlike man-made laws which care only for the\nwelfare of society, divine Law cares for both the welfare of society\nand welfare of the soul (Fraenkel 2012: 175; Z. Harvey 1980:\n199–200). Maimonides particularly emphasizes that the\nTorah’s goal does not exclusively focus on the practical domain\nand that it concerns itself with theoretical virtues. Even practical\nactions prescribed in the Torah are conducive to the fulfillment of\nthe commandment to “love the Lord” (Deuteronomy\n6:4–5), which in Maimonides’ interpretation is an\ninjunction for the true worship of God: intellectual worship. The\nTorah, accordingly, calls upon people to seek knowledge of all\nexistents by virtue of which man attains intellectual perfection,\ntruly worshiping God (Eight Chapters: 78; cf. Guide\nIII:53).\n\nUnlike Maimonides, Albalag scarcely associates the Torah with any\nexplicit role in promoting theoretical virtues. Indeed, he\ndifferentiates between philosophy and the Torah in terms of their\nrespective final goals. While philosophy aims for the happiness of the\nselect few, the Torah aims for the happiness of the multitude, the\nformer type of happiness is intellectual whereas the latter is\nexclusively civic. In this connection, Albalag defines four basic\nprinciples of the Torah, which, as he states, are also foundational to\nphilosophy and religious systems. These principles are: \n\n reward and punishment, \n the survival of the soul after death, \n the existence of a deity that rewards and punishes, and \n the existence of a divine providence that watches over human\nbeings, each according to his deeds.\n\n\nAs many scholars noted, these four principles belong to the category\nof principles that are necessary for social well-being (Touati 1962:\n44–47; Schweid 2008: 320–321; Guttmann 1945:\n90–91). Furthermore, Albalag explains that the Torah adopts a\nstrategy of concealment. Revealing or concealing doctrines is\ndetermined on the basis of their respective benefits to society and\nsocial well-being. All in all, the preface to the Tiqqun\nstresses the value of the Torah as a political treatise that is\nnecessary for the establishment of justice and social well-being.\n11. Conclusion\n\nSefer Tiqqun ha deʿot represents a significant\ndevelopment in the domain of Jewish thought in particular and\nphilosophy in general. In a time when post-Maimonidean philosophers\nexerted efforts to enhance the philosophical-religious\nenterprise of Maimonides (as they understood Maimonides’\nenterprise to be), Albalag highlights the shortcomings of that\nenterprise, advocating as an alternative the double truth doctrine. In\napplication, however, this doctrine is strikingly restricted to a very\nnarrow scope, while the superiority of philosophy as a source of true\nknowledge and certainty is made noticeable throughout the\nTiqqun. Unlike the religious domain in which truth is\nqualified by degrees, the ultimate of which being exclusively\naccessible to prophets, and subject to human interpretations, truth in\nthe philosophical domain is absolute. It can be obtained through\ndemonstrative reasoning and learned from Aristotelian sciences. It is\nthis understanding of philosophical truth that motivated Albalag to\nundertake scrutiny of the philosophical discourse in order to purge it\nfrom errors and reinstate correct Aristotelianism, as he understands\nit through the writings of Averroes, the Commentator. On the whole,\nAlbalag’s enterprise marks an attempt to break away from\nsome of the major Neo-Platonic trends that had characterized the\nAvicennian-Farabian interpretation of Aristotle.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Albalag, Isaac, <em>Sefer Tiqqun ha-Deʿot</em>, Georges\nVajda, Jerusalem: The Israel Academy of Sciences and Humanities, 1973.\n[Hebrew]",
                "–––, <em>Sefer Tiqqun ha-Deʿot</em> [Logic]\nprinted in Heiman Auerbach, “Albalaq und seine Übersetzung\ndes Maḳâṣid al-Gazzalis,” <em>Abū\nḤāmid Muḥammad al-ghazzālī (d.505/1111):\nTexts and Studies</em> (Volume 5), collected and reprinted by Faut\nSezgin in collaboration with Mazen Amawi, Carl Ehrig-Eggert, Eckhard\nNeubauer, Frankfurt am Main: Institute for the History of\nArabic-Islamic Science at the Johann Wolfgang Goethe University, 1999,\npp. 63–109.",
                "Al-Ghazali, Abu Hamid, <em>Maqāṣid\nal-Falāsifa</em>, Mahmud Bigu (ed.), Damascus, 2000.",
                "–––, <em>Tahāfut al-Falāsifah</em>,\nSulayman Dunya (ed.), Dar el-Maarif, 1996.",
                "Al-Farabi, Abu Nasr, <em>Kitāb al-ḥurūf</em> [The\nBook of Letters], English translation in <em>Medieval Islamic\nPhilosophical Writings</em>, Muhammad Khalidi (ed.), Cambridge:\nCambridge University Press, 2005, 1–22.",
                "–––, <em>The Political Writings: Selected\nAphorisms and Other Texts</em>, Charles E. Butterworth (trans.),\nIthaca, NY and London: Cornell University Press, 2004.",
                "–––, <em>Kitāb al-Burhān</em>\n[<em>Book of Demonstration</em>] in <em>Classical Arabic Philosophy:\nAn Anthology of Sources</em>, Jon McGinnis and David C. Reisman (eds\n&amp; trans), Indianapolis, IN: Hackett Publishing, 2007.",
                "Aristotle, <em>The Basic Works of Aristotle</em>, Riachard McKeon\n(ed.), New York: The Modern Library, 2001.",
                "Averroes, <em>Tahāfut al-Tahāfut</em> [The Incoherence\nof The Incoherence], Simon Van den Burgh (trans.), London: Oxford\nUniversity Press, 1954.",
                "–––, <em>The Epistle on the Possibility of\nConjunction with the Active Intellect</em>, with commentary by Moses\nNarboni and Kelman Bland (ed. &amp; trans.), New York: Jewish\nTheological Seminary of America: Distributed by Ktav, Pub. House,\n1982.",
                "–––, <em>Talkīhṣ mā baʿad\nal-ṭabiah</em>, Uthman Amin (ed.), Cairo: Mostafah al-Babi\nal-Halabi, 1958.",
                "–––, <em>Faṣl al-maqāl</em> [The\nDecisive Treatise], Charles Butterworth (trans.), Provo: Brigham Young\nUniversity Press, 2001.",
                "–––, <em>Ibn Rushd’s Metaphysics: a\nTranslation with Introduction of Ibn Rushd’s Commentary on\nAristotle’s Metaphysics: Book Lām</em>, Charles Genequad\n(ed. &amp; trans.), Leiden: E.J. Brill, 1984.",
                "–––, <em>Du Substantia Orbis: Critical edition\nof Hebrew Text with English Translation and Commentary by Arthur\nHyman</em>, Cambridge, MA: Medieval Academy of America; Jerusalem:\nIsrael Academy of Sciences and Humanities, 1986.",
                "–––, <em>al-kashf ʿan manāhij\nal-ʾadilah fi-ʿaqāʾid al-millah</em>, Mohamed\nal-Gabiri (ed.), al-Ṭabʿah al-ʾulah, 1998.",
                "Avicenna, <em>The Metaphysics of The Healing</em>, Michael E.\nMarmura (trans.), Brigham Young University Press, Provo Utah,\n2005.",
                "–––, <em>Kitab al-Najāt</em>\n(Ilahiyyāt), Dānišpažūh (ed.), Tehran,\nentisharat-e Danishgah, 1985.",
                "Gersonides, <em>The Logic of Gersonides: A Translation of Sefer\nha-heqqesh ha-Yashar [The Book of the Correct Syllogism] of Rabbi Levi\nben Gershom with Introduction, Commentary, and Analytical\nGlossary</em>, Charles Manekin (trans.), Dordrecht; Boston: Kluwer\nAcademic Publishers, 1992.",
                "El-Fayyumi, Saʾadia, <em>kitāb al-ʾAmanāt\nwa-l-ʾiʿtiqadāt</em> [<em>Book of Beliefs and\nOpinions</em>], S Rosenblatt (trans.), New Haven, CT and London: Yale\nUniversity Press, 1984.",
                "Maimonides, <em>Dalalat al-haʿirin [The Guide of the\nPerplexed</em>], translated with an introduction and notes by Shlomo\nPines and with introductory essay by Leo Strauss, Chicago: University\nof Chicago Press, 1963.",
                "–––, <em>Ethical Writings of Maimonides</em>, C.\nButterworth and R. Weiss (eds.), New York: Dover, 1975.",
                "Polqar, Isaac, <em>ʿEzer ha-Dat</em>, George. S Belasco\n(ed.), London: J. Jacobs Publisher, 1906.",
                "Ibn Shem Tov, Shem Tov, <em>Sefer ha Emunot</em>, Firarah: A.\nUsḳe, 317 [1556]\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Adamson, Peter, 2005, “On Knowledge of Particulars”,\n<em>Proceedings of the Aristotelian Society</em>, new series 105:\n257–278. doi:10.1111/j.0066-7373.2004.00114.x",
                "–––, 2013, “From the Necessary Existent to\nGod”, in <em>Interpreting Avicenna: Critical Essays</em>, Peter\nAdamson (ed.), Cambridge: Cambridge University Press, 170–189.\ndoi:10.1017/CBO9781139047890.010",
                "Belo, Catarina, 2006, “Averroes on God’s Knowledge of\nParticulars”, <em>Journal of Islamic Studies</em>, 17(2):\n177–199. doi:10.1093/jis/etl022",
                "Benor, Ehud Z., 1995, “Meaning and Reference in\nMaimonides’ Negative Theology”, <em>Harvard Theological\nReview</em>, 88(3): 339–360. doi:10.1017/S0017816000030844",
                "Black, Deborah L., 1999, “Conjunction and the Identity of\nKnower and Known in Averroes”:, <em>American Catholic\nPhilosophical Quarterly</em>, 73(1): 159–184.\ndoi:10.5840/acpq19997317",
                "–––, 2006, “Knowledge\n(<em>‘Ilm</em>) and Certitude (<em>yaqīn</em>) in\nal-Fārābī’s Epistemology”, <em>Arabic\nSciences and Philosophy</em>, 16(1): 11–45.\ndoi:10.1017/S0957423906000221",
                "–––, 2019, “Constructing Averroes’\nEpistemology”, in <em>Interpreting Averroes: Critical\nEssays</em>, Peter Adamson (ed.), Cambridge: Cambridge University\nPress, 96–115.",
                "Cohen-Sherbok, Dan, 1996, <em>Medieval Jewish Philosophy: an\nIntroduction</em>, Richmond, Surrey: Curzon.",
                "Dales, Richard C., 1984, “The Origin of the Doctrine of the\nDouble Truth”, <em>Viator</em>, 15: 169–179.\ndoi:10.1484/J.VIATOR.2.301439",
                "Davidson, Herbert A., 1987, <em>Proofs for Eternity, Creation and\nthe Existence of God in Medieval Islamic and Jewish Philosophy</em>,\nNew York: Oxford University Press.",
                "Donati, Silvia, 2015, “Is Celestial Motion a Natural Motion?\nAverroes’ Position and Its Reception in the Thirteenth and Early\nFourteenth-Century Commentary Tradition of Physics”, in\n<em>Averroes’ Natural Philosophy and Its Reception in The Latin\nWest</em>, Paul J.J.M. Bakker (ed.), Leuven: Leuven University\nPress, pp. 89–126.",
                "Feldman, Seymour, 2000, “An Averroist Solution to a\nMaimonidean Perplexity”, in <em>Maimonidean Studies</em>, volume\n4, New York: Yeshiva University, 15–31.",
                "Fraenkel, Carlos, 2010, “Theocracy and Autonomy in Medieval\nIslamic and Jewish Philosophy”, <em>Political Theory</em>,\n38(3): 340–366. doi:10.1177/0090591709359593",
                "–––, 2012, <em>Philosophical Religions from\nPlato to Spinoza: Reason, Religion, and Autonomy</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9781139043052",
                "–––, 2013, “Reconsidering the Case of\nElijah Delmedigo’s Averroism and Its Impact on Spinoza”,\nin <em>Renaissance Averroism and Its Aftermath: Arabic Philosophy in\nEarly Modern Europe</em>, Anna Akasoy and Guido Giglioni (eds.),\nDordrecht: Springer Netherlands, 213–236.\ndoi:10.1007/978-94-007-5240-5_11",
                "Freudenthal, Gad, 2002, “The Medieval Astrologization of\nAristotle’s Biology: Averroes on the Role of the Celestial\nBodies in the Generation of Animate Beings”, <em>Arabic Sciences\nand Philosophy</em>, 12(1): 111–137.\ndoi:10.1017/S0957423902002059",
                "Griffel, Frank, 2006, “MS London, British Library Or. 3126:\nAn Unknown Work by al-Ghazālī on Metaphysics and\nPhilosophical Theology”, <em>Journal of Islamic Studies</em>,\n17(1): 1–42. doi:10.1093/jis/eti175",
                "Guttmann, Julius, 1966, <em>Philosophies of Judaism: The History\nof Jewish Philosophy from Biblical Times to Franz Rosenzweig</em>,\ntranslated, by David W. Silverman and with an introduction by\nR. J. Zwi Werblowsky, from the German original, <em>Die Philosophie\ndes Judentums</em> (München: E. Reinhardt, 1933), Garden City,\nNY: Anchor Books.",
                "–––, 1945, “Mishnato Shel Isaac\nAlbalag”, in <em>Louis Ginzberg: Jubilee Volume On the Occasion\nof his Seventieth Birthday </em>, New York, American Academy for\nJewish Research, 75–92 [Hebrew]",
                "Haliva, Racheli, 2018, “The Origin of the World – An\nAnti-Sceptical Approach in Medieval Jewish Averroism”, in\n<em>Scepticism and Anti-Scepticism in Medieval Jewish Philosophy and\nThought</em>, Racheli Haliva (ed.), Berlin, Boston: De Gruyter,\n130–145. doi:10.1515/9783110553321-008",
                "Harvey, Steven, 2009, “Author’s Introduction as a\nGauge For Monitoring Philosophic Influence: The Case of\nAl-Gazali”, in <em>Tribute to Michael: Studies in Jewish &amp;\nMuslim Thought Presented to Prof. Michael Schwarz</em>,\nSaraKlein-Braslavy, Binyamin Abrahamov and Joseph Sadan (eds.), Tel\nAviv: Tel Aviv University Press, 53–66.",
                "Harvey, Zev, 1980, “Between Political Philosophy and Halakha\nin Maimonides’ Thought”, <em>Iyyun</em>, 29: 198–212\n[Hebrew].",
                "–––, 2001, “How Leo Strauss Paralyzed the\nScholarship on the Guide of the Perplexed in the 20th Century”,\n<em>Iyyun</em> 50: 387–396 [Hebrew].",
                "Hyman, Arthur, 1992, “From what is One and Simple Only What\nis One and Simple Can Come to Be”, in <em>Neoplatonism and\nJewish Thought</em>, Lenn Goodman (ed.), International Society for\nNeoplatonic Studies, State University of New York Press, 111–135.",
                "Kellner, Menachim, 1986, <em>Dogma in Medieval Jewish Thought:\nFrom Maimonides to Abravanel</em>, Oxford University Presse.",
                "Kogan, Barry, 1984, <em>Averroes And The Metaphysics of\nCausation</em>, Albany, NY: State University of New York Press",
                "Macy, Jeffery, 1986, “Prophecy in al-Farabi and\nMaimonides”, in Pines and Yovel 1986: 185–201.",
                "Manekin, Charles, 1992, <em>The Logic of Gersonides: A\nTranslation of Sefer ha-heqqesh ha-Yashar</em> [The Book of the\nCorrect Syllogism] of Rabbi Levi ben Gershom with Introduction,\nCommentary, and Analytical Glossary, Dordrecht; Boston: Kluwer\nAcademic Publishers.",
                "–––, 1996, “Some Aspects of the Assertoric\nSyllogism in Medieval Hebrew Logic”, <em>History and Philosophy\nof Logic</em>, 17(1–2): 49–71.\ndoi:10.1080/01445349608837257",
                "–––, 1997, “Hebrew Philosophy in the\nFourteenth and Fifteenth Centuries: An Overview”, in <em>History\nof Jewish Philosophy</em>, Daniel H. Frank and Oliver Leaman (eds.).\nLondon &amp; New York: Routledge, 292–318.",
                "––– (ed.), 2007, <em>Medieval Jewish\nPhilosophical Writings</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511811067",
                "Marmura, Michael E., 1962, “Some Aspects of Avicenna’s\nTheory of God’s Knowledge of Particulars”, <em>Journal of\nthe American Oriental Society</em>, 82(3): 299–312.\ndoi:10.2307/597641",
                "–––, 1963, “Avicenna’s Psychological\nProof of Prophecy”, <em>Journal of Near Eastern Studies</em>,\n22(1): 49–56. doi:10.1086/371710",
                "Mayer, Toby, 2001, “Ibn Sina’s ‘Burhan\nAl-Siddiqin’,” <em>Journal of Islamic Studies</em>, 12(1):\n18–39.",
                "McGinnis, Jon, 2010, <em>Avicenna</em>, Oxford: Oxford University\nPress.",
                "Morris, James Winston, 1992, “The Philosopher Prophet in\nAvicenna’s Political Philosophy”, in <em>Political Aspects\nof Islamic Philosophy</em>, Charles Butterworth (ed.), Cambridge, MA;\nHarvard University Press, 152–198.",
                "Pines, Shlomo, 1979, “The Limitation of Human Knowledge\nAccording to Al-Farabi, Ibn Bajja, and Maimonides”, in\n<em>Studies in Medieval Jewish History and Literature</em>, volume 1,\nIsadore Twersky (ed.), Cambridge, MA: Harvard University Press,\n82–109.",
                "–––, 1986, “The Philosophical Purport of\nMaimonides' Halachic Works and the Purport of the Guide of the\nPerplexed”, in Pines and Yovel 1986: 1–14.",
                "Pines, Shlomo and Yirmiyahu Yovel (eds.), 1986, <em>Maimonides and\nPhilosophy: Papers Presented at the Sixth Jerusalem Philosophical\nEncounter, May 1985</em>, Dordrecht; Boston: M. Nijhoff Publishers ;\nNorwell, MA, USA: Distributors for the U.S. and Canada, Kluwer\nAcademic Publishers.",
                "Rahman, Fazl, 1958, <em>Prophecy in Islam: Philosophy and\nOrthodoxy</em>, London: Allen &amp; Unwin.",
                "Rescher, Nicholas, 1965, “New Light from Arabic Sources on\nGalen and the Fourth Figure of the Syllogism”, <em>Journal of\nthe History of Philosophy</em>, 3(1): 27–41.\ndoi:10.1353/hph.2008.1365",
                "Rosenberg, Shalom, 1984, “The Concept of Emunah in\nPost-Maimonidean Jewish Philosophy”, in <em>Studies in Medieval\nJewish History and Literature</em>, volume 2, Isadore Twersky (ed.),\nCambridge, MA: Harvard University Press, 273–309.",
                "Sabra, A. I, 1965, “ A Twelfth-Century Defense of the Fourth\nFigure of Syllogism”, <em>Journal of the Warburg and Courtauld\nInstitute</em>, 28: 14–28.",
                "Sadiq, Shalom, 2015, “La Doctrine de la Double\nVérité dans la Pensée Philosophique de Rabbi\nIsaac Albalag”, <em>Revue des études Juives</em>, 174:\n145–174.",
                "Salman, P. O., 1999, “Algazel et Les Latins”, in\n<em>Abū Ḥāmid Muḥammad al-ghazzālī\n(d.505/1111): Texts and Studies</em> (Volume 5), collected and\nreprinted by Faut Sezgin in collaboration with Mazen Amawi, Carl\nEhrig-Eggert, Eckhard Neubauer, Frankfurt am Main: Institute for the\nHistory of Arabic-Islamic Science at the Johann Wolfgang Goethe\nUniversity, 119–134.",
                "Schweid, Eliezer, [1999] 2008, <em>Filosofim ha-gedolim\nshelanu</em>, Miskal/Yediot Aharonot Books. Translated as <em>The\nClassic Jewish Philosophers: From Saadia through the Renaissance</em>,\nLeonard Levin (trans.), Leiden; Boston: Brill, 2008.",
                "Shihadeh, Ayman, 2011, “New Lights on the Reception of\nal-Ghazali’s Doctrines of the Philosophers\n(<em>Maqāṣid al-Falasifa</em>)”, in <em>In The Age of\nAverroes</em>, Peter Adamson (ed.), London: Warburg Institute, School\nof Advanced Study, 77–92.",
                "Sirat, Collette, 1985, <em>A History of Jewish Philosophy in the\nMiddle Ages</em>, Cambridge: Cambridge University Press. Based on\n<em>La philosophie juive au Moyen Age</em>, Paris: Editions du Centre\nnational de la recherche scientifique, 1983.",
                "Stern, Joseph, 2013, <em>The Matter and Form of Maimonides\nGuide</em>, Cambridge, MA: Harvard University Press.",
                "Strauss, Leo, 1983, “Jerusalem and Athens: Some Introductory\nReflections”, in <em>Studies on Platonic Political\nPhilosophy</em>, with an introduction by Thomas Pangle (Chicago:\nChicago University Press, 147–173.",
                "Touati, Charles, 1962, “Vérité prophétique et vérité\nphilosophique Chez Isaac Albalag”, <em>Des études juives</em>,\n35–47.",
                "Vajda, George, 1960, <em>Averroïste juif, traducteur et\nannotateur da̕̕-Ghazâlî</em>, Paris : J. Vrin.",
                "Wolfson, Harry A., 1942, “The Double Faith Theory in\nClement, Saadia, Averroes and St. Thomas, and its Origin in Aristotle\nand the Stoics”, <em>Jewish Quarterly Review</em>, 33:\n213–261; reprinted in H. Wolfson, <em>Studies in The History of\nPhilosophy and Religion</em> (Volume 1), Isadore Twersky and George\nH. Williams (eds.), Cambridge, MA: Harvard University Press, 1973,\n538–619.",
                "–––, 1950–51,“Averroes’ Lost\nTreatise on The Prime Mover”,\n<em>Hebrew Union College Annual</em>, 23(1): 683–710; reprinted\nin H. Wolfson, <em>Studies in the History of Philosophy and\nReligion</em> (Volume 1), Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973,\n402–429.",
                "–––, 1958, “The Plurality of Immovable\nMovers in Aristotle, Averroes, And St. Thomas”,\n<em>Harvard Studies in Classical Philology</em>, 63: 233–253;\nreprinted in H. Wolfson, <em>Studies in The History of Philosophy and\nReligion</em> (Volume 1), Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973, 1–22.",
                "–––, 1962 “The Problem of the Souls of the\nSpheres from Byzantine Commentaries on Aristotle Through the Arabs And\nSt. Thomas to Kepler”, <em>Dumbarton Oaks Papers</em>, 16:\n65–93; reprinted in H. Wolfson, <em>Studies in The History of\nPhilosophy and Religion</em>, Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973, 22–60.",
                "Zinberg, Israel, [1972–1978] 1973, “Isaac Albalag and the\nDoctrine of the ‘Double Truth’”, in <em>A History of\nJewish Literature</em> (<em>Die Geshichte fun der Literatur bei\nYidn</em>), Volume 3, Bernard Martin (trans.), Cleveland, OH: Press of\nCase Western Reserve University, 99–108.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Albalag, Isaac, <em>Sefer Tiqqun ha-Deʿot</em>, Georges\nVajda, Jerusalem: The Israel Academy of Sciences and Humanities, 1973.\n[Hebrew]</li>\n<li>–––, <em>Sefer Tiqqun ha-Deʿot</em> [Logic]\nprinted in Heiman Auerbach, “Albalaq und seine Übersetzung\ndes Maḳâṣid al-Gazzalis,” <em>Abū\nḤāmid Muḥammad al-ghazzālī (d.505/1111):\nTexts and Studies</em> (Volume 5), collected and reprinted by Faut\nSezgin in collaboration with Mazen Amawi, Carl Ehrig-Eggert, Eckhard\nNeubauer, Frankfurt am Main: Institute for the History of\nArabic-Islamic Science at the Johann Wolfgang Goethe University, 1999,\npp. 63–109.</li>\n<li>Al-Ghazali, Abu Hamid, <em>Maqāṣid\nal-Falāsifa</em>, Mahmud Bigu (ed.), Damascus, 2000.</li>\n<li>–––, <em>Tahāfut al-Falāsifah</em>,\nSulayman Dunya (ed.), Dar el-Maarif, 1996.</li>\n<li>Al-Farabi, Abu Nasr, <em>Kitāb al-ḥurūf</em> [The\nBook of Letters], English translation in <em>Medieval Islamic\nPhilosophical Writings</em>, Muhammad Khalidi (ed.), Cambridge:\nCambridge University Press, 2005, 1–22.</li>\n<li>–––, <em>The Political Writings: Selected\nAphorisms and Other Texts</em>, Charles E. Butterworth (trans.),\nIthaca, NY and London: Cornell University Press, 2004.</li>\n<li>–––, <em>Kitāb al-Burhān</em>\n[<em>Book of Demonstration</em>] in <em>Classical Arabic Philosophy:\nAn Anthology of Sources</em>, Jon McGinnis and David C. Reisman (eds\n&amp; trans), Indianapolis, IN: Hackett Publishing, 2007.</li>\n<li>Aristotle, <em>The Basic Works of Aristotle</em>, Riachard McKeon\n(ed.), New York: The Modern Library, 2001.</li>\n<li>Averroes, <em>Tahāfut al-Tahāfut</em> [The Incoherence\nof The Incoherence], Simon Van den Burgh (trans.), London: Oxford\nUniversity Press, 1954.</li>\n<li>–––, <em>The Epistle on the Possibility of\nConjunction with the Active Intellect</em>, with commentary by Moses\nNarboni and Kelman Bland (ed. &amp; trans.), New York: Jewish\nTheological Seminary of America: Distributed by Ktav, Pub. House,\n1982.</li>\n<li>–––, <em>Talkīhṣ mā baʿad\nal-ṭabiah</em>, Uthman Amin (ed.), Cairo: Mostafah al-Babi\nal-Halabi, 1958.</li>\n<li>–––, <em>Faṣl al-maqāl</em> [The\nDecisive Treatise], Charles Butterworth (trans.), Provo: Brigham Young\nUniversity Press, 2001.</li>\n<li>–––, <em>Ibn Rushd’s Metaphysics: a\nTranslation with Introduction of Ibn Rushd’s Commentary on\nAristotle’s Metaphysics: Book Lām</em>, Charles Genequad\n(ed. &amp; trans.), Leiden: E.J. Brill, 1984.</li>\n<li>–––, <em>Du Substantia Orbis: Critical edition\nof Hebrew Text with English Translation and Commentary by Arthur\nHyman</em>, Cambridge, MA: Medieval Academy of America; Jerusalem:\nIsrael Academy of Sciences and Humanities, 1986.</li>\n<li>–––, <em>al-kashf ʿan manāhij\nal-ʾadilah fi-ʿaqāʾid al-millah</em>, Mohamed\nal-Gabiri (ed.), al-Ṭabʿah al-ʾulah, 1998.</li>\n<li>Avicenna, <em>The Metaphysics of The Healing</em>, Michael E.\nMarmura (trans.), Brigham Young University Press, Provo Utah,\n2005.</li>\n<li>–––, <em>Kitab al-Najāt</em>\n(Ilahiyyāt), Dānišpažūh (ed.), Tehran,\nentisharat-e Danishgah, 1985. </li>\n<li>Gersonides, <em>The Logic of Gersonides: A Translation of Sefer\nha-heqqesh ha-Yashar [The Book of the Correct Syllogism] of Rabbi Levi\nben Gershom with Introduction, Commentary, and Analytical\nGlossary</em>, Charles Manekin (trans.), Dordrecht; Boston: Kluwer\nAcademic Publishers, 1992.</li>\n<li>El-Fayyumi, Saʾadia, <em>kitāb al-ʾAmanāt\nwa-l-ʾiʿtiqadāt</em> [<em>Book of Beliefs and\nOpinions</em>], S Rosenblatt (trans.), New Haven, CT and London: Yale\nUniversity Press, 1984.</li>\n<li>Maimonides, <em>Dalalat al-haʿirin [The Guide of the\nPerplexed</em>], translated with an introduction and notes by Shlomo\nPines and with introductory essay by Leo Strauss, Chicago: University\nof Chicago Press, 1963.</li>\n<li>–––, <em>Ethical Writings of Maimonides</em>, C.\nButterworth and R. Weiss (eds.), New York: Dover, 1975.</li>\n<li>Polqar, Isaac, <em>ʿEzer ha-Dat</em>, George. S Belasco\n(ed.), London: J. Jacobs Publisher, 1906.</li>\n<li>Ibn Shem Tov, Shem Tov, <em>Sefer ha Emunot</em>, Firarah: A.\nUsḳe, 317 [1556]</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Adamson, Peter, 2005, “On Knowledge of Particulars”,\n<em>Proceedings of the Aristotelian Society</em>, new series 105:\n257–278. doi:10.1111/j.0066-7373.2004.00114.x</li>\n<li>–––, 2013, “From the Necessary Existent to\nGod”, in <em>Interpreting Avicenna: Critical Essays</em>, Peter\nAdamson (ed.), Cambridge: Cambridge University Press, 170–189.\ndoi:10.1017/CBO9781139047890.010</li>\n<li>Belo, Catarina, 2006, “Averroes on God’s Knowledge of\nParticulars”, <em>Journal of Islamic Studies</em>, 17(2):\n177–199. doi:10.1093/jis/etl022</li>\n<li>Benor, Ehud Z., 1995, “Meaning and Reference in\nMaimonides’ Negative Theology”, <em>Harvard Theological\nReview</em>, 88(3): 339–360. doi:10.1017/S0017816000030844</li>\n<li>Black, Deborah L., 1999, “Conjunction and the Identity of\nKnower and Known in Averroes”:, <em>American Catholic\nPhilosophical Quarterly</em>, 73(1): 159–184.\ndoi:10.5840/acpq19997317</li>\n<li>–––, 2006, “Knowledge\n(<em>‘Ilm</em>) and Certitude (<em>yaqīn</em>) in\nal-Fārābī’s Epistemology”, <em>Arabic\nSciences and Philosophy</em>, 16(1): 11–45.\ndoi:10.1017/S0957423906000221</li>\n<li>–––, 2019, “Constructing Averroes’\nEpistemology”, in <em>Interpreting Averroes: Critical\nEssays</em>, Peter Adamson (ed.), Cambridge: Cambridge University\nPress, 96–115.</li>\n<li>Cohen-Sherbok, Dan, 1996, <em>Medieval Jewish Philosophy: an\nIntroduction</em>, Richmond, Surrey: Curzon.</li>\n<li>Dales, Richard C., 1984, “The Origin of the Doctrine of the\nDouble Truth”, <em>Viator</em>, 15: 169–179.\ndoi:10.1484/J.VIATOR.2.301439</li>\n<li>Davidson, Herbert A., 1987, <em>Proofs for Eternity, Creation and\nthe Existence of God in Medieval Islamic and Jewish Philosophy</em>,\nNew York: Oxford University Press.</li>\n<li>Donati, Silvia, 2015, “Is Celestial Motion a Natural Motion?\nAverroes’ Position and Its Reception in the Thirteenth and Early\nFourteenth-Century Commentary Tradition of Physics”, in\n<em>Averroes’ Natural Philosophy and Its Reception in The Latin\nWest</em>, Paul J.J.M. Bakker (ed.), Leuven: Leuven University\nPress, pp. 89–126.</li>\n<li>Feldman, Seymour, 2000, “An Averroist Solution to a\nMaimonidean Perplexity”, in <em>Maimonidean Studies</em>, volume\n4, New York: Yeshiva University, 15–31.</li>\n<li>Fraenkel, Carlos, 2010, “Theocracy and Autonomy in Medieval\nIslamic and Jewish Philosophy”, <em>Political Theory</em>,\n38(3): 340–366. doi:10.1177/0090591709359593</li>\n<li>–––, 2012, <em>Philosophical Religions from\nPlato to Spinoza: Reason, Religion, and Autonomy</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9781139043052</li>\n<li>–––, 2013, “Reconsidering the Case of\nElijah Delmedigo’s Averroism and Its Impact on Spinoza”,\nin <em>Renaissance Averroism and Its Aftermath: Arabic Philosophy in\nEarly Modern Europe</em>, Anna Akasoy and Guido Giglioni (eds.),\nDordrecht: Springer Netherlands, 213–236.\ndoi:10.1007/978-94-007-5240-5_11</li>\n<li>Freudenthal, Gad, 2002, “The Medieval Astrologization of\nAristotle’s Biology: Averroes on the Role of the Celestial\nBodies in the Generation of Animate Beings”, <em>Arabic Sciences\nand Philosophy</em>, 12(1): 111–137.\ndoi:10.1017/S0957423902002059</li>\n<li>Griffel, Frank, 2006, “MS London, British Library Or. 3126:\nAn Unknown Work by al-Ghazālī on Metaphysics and\nPhilosophical Theology”, <em>Journal of Islamic Studies</em>,\n17(1): 1–42. doi:10.1093/jis/eti175</li>\n<li>Guttmann, Julius, 1966, <em>Philosophies of Judaism: The History\nof Jewish Philosophy from Biblical Times to Franz Rosenzweig</em>,\ntranslated, by David W. Silverman and with an introduction by\nR. J. Zwi Werblowsky, from the German original, <em>Die Philosophie\ndes Judentums</em> (München: E. Reinhardt, 1933), Garden City,\nNY: Anchor Books.</li>\n<li>–––, 1945, “Mishnato Shel Isaac\nAlbalag”, in <em>Louis Ginzberg: Jubilee Volume On the Occasion\nof his Seventieth Birthday </em>, New York, American Academy for\nJewish Research, 75–92 [Hebrew]</li>\n<li>Haliva, Racheli, 2018, “The Origin of the World – An\nAnti-Sceptical Approach in Medieval Jewish Averroism”, in\n<em>Scepticism and Anti-Scepticism in Medieval Jewish Philosophy and\nThought</em>, Racheli Haliva (ed.), Berlin, Boston: De Gruyter,\n130–145. doi:10.1515/9783110553321-008</li>\n<li>Harvey, Steven, 2009, “Author’s Introduction as a\nGauge For Monitoring Philosophic Influence: The Case of\nAl-Gazali”, in <em>Tribute to Michael: Studies in Jewish &amp;\nMuslim Thought Presented to Prof. Michael Schwarz</em>,\nSaraKlein-Braslavy, Binyamin Abrahamov and Joseph Sadan (eds.), Tel\nAviv: Tel Aviv University Press, 53–66.</li>\n<li>Harvey, Zev, 1980, “Between Political Philosophy and Halakha\nin Maimonides’ Thought”, <em>Iyyun</em>, 29: 198–212\n[Hebrew].</li>\n<li>–––, 2001, “How Leo Strauss Paralyzed the\nScholarship on the Guide of the Perplexed in the 20th Century”,\n<em>Iyyun</em> 50: 387–396 [Hebrew].</li>\n<li>Hyman, Arthur, 1992, “From what is One and Simple Only What\nis One and Simple Can Come to Be”, in <em>Neoplatonism and\nJewish Thought</em>, Lenn Goodman (ed.), International Society for\nNeoplatonic Studies, State University of New York Press, 111–135.</li>\n<li>Kellner, Menachim, 1986, <em>Dogma in Medieval Jewish Thought:\nFrom Maimonides to Abravanel</em>, Oxford University Presse.</li>\n<li>Kogan, Barry, 1984, <em>Averroes And The Metaphysics of\nCausation</em>, Albany, NY: State University of New York Press</li>\n<li>Macy, Jeffery, 1986, “Prophecy in al-Farabi and\nMaimonides”, in Pines and Yovel 1986: 185–201.</li>\n<li> Manekin, Charles, 1992, <em>The Logic of Gersonides: A\nTranslation of Sefer ha-heqqesh ha-Yashar</em> [The Book of the\nCorrect Syllogism] of Rabbi Levi ben Gershom with Introduction,\nCommentary, and Analytical Glossary,  Dordrecht; Boston: Kluwer\nAcademic Publishers.</li>\n<li>–––, 1996, “Some Aspects of the Assertoric\nSyllogism in Medieval Hebrew Logic”, <em>History and Philosophy\nof Logic</em>, 17(1–2): 49–71.\ndoi:10.1080/01445349608837257</li>\n<li>–––, 1997, “Hebrew Philosophy in the\nFourteenth and Fifteenth Centuries: An Overview”, in <em>History\nof Jewish Philosophy</em>, Daniel H. Frank and Oliver Leaman (eds.).\nLondon &amp; New York: Routledge, 292–318.</li>\n<li>––– (ed.), 2007, <em>Medieval Jewish\nPhilosophical Writings</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511811067</li>\n<li>Marmura, Michael E., 1962, “Some Aspects of Avicenna’s\nTheory of God’s Knowledge of Particulars”, <em>Journal of\nthe American Oriental Society</em>, 82(3): 299–312.\ndoi:10.2307/597641</li>\n<li>–––, 1963, “Avicenna’s Psychological\nProof of Prophecy”, <em>Journal of Near Eastern Studies</em>,\n22(1): 49–56. doi:10.1086/371710</li>\n<li>Mayer, Toby, 2001, “Ibn Sina’s ‘Burhan\nAl-Siddiqin’,” <em>Journal of Islamic Studies</em>, 12(1):\n18–39.</li>\n<li>McGinnis, Jon, 2010, <em>Avicenna</em>, Oxford: Oxford University\nPress.</li>\n<li>Morris, James Winston, 1992, “The Philosopher Prophet in\nAvicenna’s Political Philosophy”, in <em>Political Aspects\nof Islamic Philosophy</em>, Charles Butterworth (ed.), Cambridge, MA;\nHarvard University Press, 152–198. </li>\n<li>Pines, Shlomo, 1979, “The Limitation of Human Knowledge\nAccording to Al-Farabi, Ibn Bajja, and Maimonides”, in\n<em>Studies in Medieval Jewish History and Literature</em>, volume 1,\nIsadore Twersky (ed.), Cambridge, MA: Harvard University Press,\n82–109.</li>\n<li>–––, 1986, “The Philosophical Purport of\nMaimonides' Halachic Works and the Purport of the Guide of the\nPerplexed”, in Pines and Yovel 1986: 1–14.</li>\n<li>Pines, Shlomo and Yirmiyahu Yovel (eds.), 1986, <em>Maimonides and\nPhilosophy: Papers Presented at the Sixth Jerusalem Philosophical\nEncounter, May 1985</em>, Dordrecht; Boston: M. Nijhoff Publishers ;\nNorwell, MA, USA: Distributors for the U.S. and Canada, Kluwer\nAcademic Publishers.</li>\n<li>Rahman, Fazl, 1958, <em>Prophecy in Islam: Philosophy and\nOrthodoxy</em>, London: Allen &amp; Unwin.</li>\n<li>Rescher, Nicholas, 1965, “New Light from Arabic Sources on\nGalen and the Fourth Figure of the Syllogism”, <em>Journal of\nthe History of Philosophy</em>, 3(1): 27–41.\ndoi:10.1353/hph.2008.1365</li>\n<li>Rosenberg, Shalom, 1984, “The Concept of Emunah in\nPost-Maimonidean Jewish Philosophy”, in <em>Studies in Medieval\nJewish History and Literature</em>, volume 2, Isadore Twersky (ed.),\nCambridge, MA: Harvard University Press, 273–309.</li>\n<li>Sabra, A. I, 1965, “ A Twelfth-Century Defense of the Fourth\nFigure of Syllogism”, <em>Journal of the Warburg and Courtauld\nInstitute</em>, 28: 14–28.</li>\n<li>Sadiq, Shalom, 2015, “La Doctrine de la Double\nVérité dans la Pensée Philosophique de Rabbi\nIsaac Albalag”, <em>Revue des études Juives</em>, 174:\n145–174.</li>\n<li>Salman, P. O., 1999, “Algazel et Les Latins”, in\n<em>Abū Ḥāmid Muḥammad al-ghazzālī\n(d.505/1111): Texts and Studies</em> (Volume 5), collected and\nreprinted by Faut Sezgin in collaboration with Mazen Amawi, Carl\nEhrig-Eggert, Eckhard Neubauer, Frankfurt am Main: Institute for the\nHistory of Arabic-Islamic Science at the Johann Wolfgang Goethe\nUniversity, 119–134. </li>\n<li>Schweid, Eliezer, [1999] 2008, <em>Filosofim ha-gedolim\nshelanu</em>, Miskal/Yediot Aharonot Books. Translated as <em>The\nClassic Jewish Philosophers: From Saadia through the Renaissance</em>,\nLeonard Levin (trans.), Leiden; Boston: Brill, 2008.</li>\n<li>Shihadeh, Ayman, 2011, “New Lights on the Reception of\nal-Ghazali’s Doctrines of the Philosophers\n(<em>Maqāṣid al-Falasifa</em>)”, in <em>In The Age of\nAverroes</em>, Peter Adamson (ed.), London: Warburg Institute, School\nof Advanced Study, 77–92. </li>\n<li>Sirat, Collette, 1985, <em>A History of Jewish Philosophy in the\nMiddle Ages</em>, Cambridge: Cambridge University Press. Based on\n<em>La philosophie juive au Moyen Age</em>, Paris: Editions du Centre\nnational de la recherche scientifique, 1983.</li>\n<li>Stern, Joseph, 2013, <em>The Matter and Form of Maimonides\nGuide</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Strauss, Leo, 1983, “Jerusalem and Athens: Some Introductory\nReflections”, in <em>Studies on Platonic Political\nPhilosophy</em>, with an introduction by Thomas Pangle (Chicago:\nChicago University Press, 147–173.</li>\n<li>Touati, Charles, 1962, “Vérité prophétique et vérité\nphilosophique Chez Isaac Albalag”, <em>Des études juives</em>,\n35–47.</li>\n<li>Vajda, George, 1960, <em>Averroïste juif, traducteur et\nannotateur da̕̕-Ghazâlî</em>, Paris : J. Vrin.</li>\n<li>Wolfson, Harry A., 1942, “The Double Faith Theory in\nClement, Saadia, Averroes and St. Thomas, and its Origin in Aristotle\nand the Stoics”, <em>Jewish Quarterly Review</em>, 33:\n213–261; reprinted in H. Wolfson, <em>Studies in The History of\nPhilosophy and Religion</em> (Volume 1), Isadore Twersky and George\nH. Williams (eds.), Cambridge, MA: Harvard University Press, 1973,\n538–619. </li>\n<li>–––, 1950–51,“Averroes’ Lost\nTreatise on The Prime Mover”,\n<em>Hebrew Union College Annual</em>, 23(1): 683–710; reprinted\nin H. Wolfson, <em>Studies in the History of Philosophy and\nReligion</em> (Volume 1), Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973,\n402–429.</li>\n<li>–––, 1958, “The Plurality of Immovable\nMovers in Aristotle, Averroes, And St. Thomas”,\n<em>Harvard Studies in Classical Philology</em>, 63: 233–253;\nreprinted in H. Wolfson, <em>Studies in The History of Philosophy and\nReligion</em> (Volume 1), Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973, 1–22.</li>\n<li>–––, 1962 “The Problem of the Souls of the\nSpheres from Byzantine Commentaries on Aristotle Through the Arabs And\nSt. Thomas to Kepler”, <em>Dumbarton Oaks Papers</em>, 16:\n65–93; reprinted in H. Wolfson, <em>Studies in The History of\nPhilosophy and Religion</em>, Isadore Twersky and George H. Williams\n(eds.), Cambridge, MA: Harvard University Press, 1973, 22–60.</li>\n<li>Zinberg, Israel, [1972–1978] 1973, “Isaac Albalag and the\nDoctrine of the ‘Double Truth’”, in <em>A History of\nJewish Literature</em> (<em>Die Geshichte fun der Literatur bei\nYidn</em>), Volume 3, Bernard Martin (trans.), Cleveland, OH: Press of\nCase Western Reserve University, 99–108.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Ghazali",
            "Arabic and Islamic Philosophy, historical and methodological topics in: influence of Arabic and Islamic Philosophy on Judaic thought",
            "causation: in Arabic and Islamic thought",
            "Delmedigo, Elijah",
            "Ibn Sina [Avicenna]",
            "Maimonides",
            "Polqar, Isaac"
        ],
        "entry_link": [
            {
                "../al-ghazali/": "al-Ghazali"
            },
            {
                "../arabic-islamic-judaic/": "Arabic and Islamic Philosophy, historical and methodological topics in: influence of Arabic and Islamic Philosophy on Judaic thought"
            },
            {
                "../arabic-islamic-causation/": "causation: in Arabic and Islamic thought"
            },
            {
                "../delmedigo/": "Delmedigo, Elijah"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            },
            {
                "../maimonides/": "Maimonides"
            },
            {
                "../polqar/": "Polqar, Isaac"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=albalag\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/albalag/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=albalag&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/albalag/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=albalag": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/albalag/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=albalag&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/albalag/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Adamson, Peter, 2016,\n “<a href=\"https://historyofphilosophy.net/latin-averroism\" target=\"other\">Masters of the University: ‘Latin Averroism’</a>”,\n in <em>History of Philosophy without any gaps</em>, episode 251,\nKing’s College London.",
            "Hillier, H. Chad,\n “<a href=\"https://www.iep.utm.edu/ibnrushd/\" target=\"other\">Ibn Rushd (Averroes) (1126–1198)</a>”,\n in <em>Internet Encyclopedia of Philosophy</em>"
        ],
        "listed_links": [
            {
                "https://historyofphilosophy.net/latin-averroism": "Masters of the University: ‘Latin Averroism’"
            },
            {
                "https://www.iep.utm.edu/ibnrushd/": "Ibn Rushd (Averroes) (1126–1198)"
            }
        ]
    }
}