{
    "url": "ancient-political",
    "title": "Ancient Political Philosophy",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Melissa Lane\n<mslane@princeton.edu>",
        "author_links": [
            {
                "https://melissalane.princeton.edu/": "Melissa Lane"
            },
            {
                "mailto:mslane%40princeton%2eedu": "mslane@princeton.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://melissalane.princeton.edu/\" target=\"other\">Melissa Lane</a>\n&lt;<a href=\"mailto:mslane%40princeton%2eedu\"><em>mslane<abbr title=\" at \">@</abbr>princeton<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Sep 6, 2010",
        "substantive revision Wed Mar 22, 2023"
    ],
    "preamble": "\n\nAncient political philosophy is understood here to mean ancient Greek\nand Roman thought from the classical period of Greek thought in the\nfifth century BCE to the end of the Roman empire in the West in the\nfifth century CE, excluding the development of Jewish and Christian\nideas about politics during that period. Political philosophy as a\ngenre was developed in this period by Plato and, in effect, reinvented\nby Aristotle: it encompasses reflections on the origin of political\ninstitutions, the concepts used to interpret and organize political\nlife such as justice and equality, the relation between the aims of\nethics and the nature of politics, and the relative merits of\ndifferent constitutional arrangements or regimes. Platonic models\nremained especially important for later authors throughout this\nperiod, even as the development of later “Hellenistic”\nschools of Greek philosophy, and distinctively Roman forms of\nphilosophical adaptation, offered new frameworks for construing\npolitics from a philosophical point of view. Engagement in these Greek\nand Roman traditions of political philosophy among late antique\nscholars continued through and beyond the eventual abdication of the\nlast pretenders to the Roman imperial throne in the Western part of\nthe empire in 476 CE, and further still among medieval scholars and\ntheir successors writing in Greek, Latin, Hebrew, and (later on)\nArabic.\n",
    "toc": [
        {
            "#ScoAncPol": "1. The Scope of Ancient Political Philosophy"
        },
        {
            "#PolAncGre": "2. Politics and Philosophy in Ancient Greece"
        },
        {
            "#PolJus": "2.1 Politics and Justice"
        },
        {
            "#PolJusEqu": "2.2 Politics, Justice, and Equality"
        },
        {
            "#Pol": "2.3 Politics and Philosophy"
        },
        {
            "#SocPla": "3. Socrates and Plato"
        },
        {
            "#SocEthRelPol": "3.1 Socratic Ethics and Politics"
        },
        {
            "#SocTriPolCit": "3.2 Socrates’ Trial: The Political Philosophy of Citizenship"
        },
        {
            "#DefJusRep": "3.3 The Defense of Justice in the Republic"
        },
        {
            "#DefPolKnoSta": "3.4 The Definition of Political Knowledge in the Statesman"
        },
        {
            "#SecBesRegLaw": "3.5 The “Second-Best” Regime of the Laws"
        },
        {
            "#Ari": "4. Aristotle"
        },
        {
            "#AriPhiMetEth": "4.1 Aristotle’s Philosophical Method and Ethics"
        },
        {
            "#EthPolWayLaw": "4.2 Ethics and Politics by Way of Law"
        },
        {
            "#ProPol": "4.3 Claims to Rule"
        },
        {
            "#AriPol": "4.4 Aristotle in Political Philosophy"
        },
        {
            "#HelPhiPol": "5. Hellenistic Philosophies and Politics"
        },
        {
            "#PerNewSch": "5.1 Persisting and New Schools"
        },
        {
            "#Epi": "5.2 Epicureanism"
        },
        {
            "#Sto": "5.3 Stoicism"
        },
        {
            "#HelPhiRomRepPol": "5.4 Hellenistic Philosophies and Roman Republican Politics"
        },
        {
            "#CicRomRep": "6. The Roman Republic and Cicero"
        },
        {
            "#CicLif": "6.1 Cicero: Life"
        },
        {
            "#DeRePub": "6.2 De re publica"
        },
        {
            "#DeLeg": "6.3 De legibus"
        },
        {
            "#DeOff": "6.4 De officiis"
        },
        {
            "#PolRomEmp": "7. Political Philosophy in the Roman Empire"
        },
        {
            "#LatSto": "7.1 Later Stoicism"
        },
        {
            "#PlaOthPhiEmp": "7.2 Platonisms and Other Philosophies in the Empire"
        },
        {
            "#Con": "8. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriLit": "Primary Literature"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Scope of Ancient Political Philosophy\n\nWe find the etymological origins of two key terms in the title of this\narticle, “political” and “philosophy”, in\nancient Greek: the former originally pertaining to the polis\nor city-state; the latter being the practice of a particular kind of\ninquiry conceived literally as the “love of wisdom”\n(philosophia). These ideas were transmitted beyond the\nconfines of the classical polis as the Greek city-states came\nunder the suzerainty of larger kingdoms after an initial Macedonian\nconquest at the end of the fourth century B.C; those kingdoms in turn\nwere eventually conquered and significantly assimilated by the Roman\nrepublic, later transmuted into an empire. Philosophers writing in\nLatin engaged self-consciously with the earlier and continuing\ntraditions of writing about philosophy in Greek. Already from its\norigins, Greek political philosophy put the question of the forms of\nregimes or “constitutions” (politeia, singular)\nat the center of its concerns. The classification of types of\nconstitutions already found in Herodotus, fleshed out by Plato, and\nfurther adapted by Aristotle—in Aristotle’s version,\nthere were three “good” regimes, namely, monarchy,\naristocracy, and a moderate form of democracy, as well as their three\n“perversions,” namely tyranny, oligarchy, and a bad form of\ndemocracy—would continue to inform the discussion of politics\ninto the context of the “mixed regime” of the Roman\nrepublic, held to combine elements of all three of the good regimes.\nThese discussions were indexed to the particular historical setting\nunder consideration while also offering general principles that remain\nrelevant in many ways, even as the questions and contexts for\npolitical philosophy have changed.\n\nBecause the field of political philosophy so delineated has had a long\nhistory since then, long past the time when the ancient models were\naccepted as defining the field and determining the\n“problems” to be considered, it is a mistake to approach\ntheir thought with a modern menu of expectations of what the subject\nwill contain. At the same time, because the Greeks also developed\nother genres widely recognized today—among them, history,\ntragedy, comedy, and rhetoric—no understanding of their thought\nabout politics can restrict itself to the genre of political\nphilosophy alone. Some argue, for example, that Thucydides’\nelaboration of the nature of the political through his\nHistory of the fifth-century Peloponnesian War between\nleagues led by Athens and Sparta is more important and instructive\nthan that issuing from Plato’s philosophical dialogues (Geuss\n2005). While that argument is contentious, it rests on an important\nbroader point. “Politics” and what is\n“political” emerged as part of a widespread set of\nsociolinguistic practices, most notably and best documented in Athens,\nwhile “philosophy” was invented by a relatively small\nnumber of self-professed “philosophical” thinkers. Thus\nthe invention of “political philosophy” as a genre can be\nunderstood as a deliberate challenge to existing practices, and\nconceptions, of “the political.” The challenge was\ndirected in particular, though not exclusively, to democratic\npractices in mid to late fifth century Athens, which was the\npolis both intellectually dominant and in many ways\npolitically exemplary at the time, as well as bequeathing the\nlion’s share of our surviving evidence from ancient Greece\n(Meier 1990, Ober 2008; on the surviving evidence for ancient Greek\nphilosophy in general, see the entry on\n doxography for ancient philosophy).\n\nThis article therefore begins by surveying political practices and the\nreflective accounts to which they gave rise in the classical Greek\nperiod of the independent polis. It then turns to the\nthinkers who invented “political philosophy” par\nexcellence: Socrates, Plato and Aristotle. It continues to Hellenistic\nGreek thinkers before considering the main currents and roles of\npolitical philosophy in the Roman republic. While offering a survey of\ncertain developments in the Roman empire, it leaves aside the\ndistinctive contributions made by Jewish and Christian thinkers in\nthat period, and in particular the great upheaval of thought effected\nby Augustine, who was deeply engaged with classical authors such as\nPlato and Cicero, who became in turn a crucial starting point for\n medieval political philosophy.\n The article concludes with some reflections on how the nature of\n“ancient political philosophy” should, and should not, be\nunderstood.\n2. Politics and Philosophy in Ancient Greece\n2.1 Politics and Justice\n\nThe distinctive understanding of “politics” forged in\nGreece was marked by the historical emergence of the independent\n city-state[1]\n and the variety of regimes which it could harbor. Notwithstanding\nfantasies of a pre-political “Age of Kronos”, the\npolis was widely understood as the acme of human civilization\nand the principal domain in which human fulfillment could be sought.\nThe city was the domain of potential collaboration in leading the good\nlife, though it was by the same token the domain of potential\ncontestation should that pursuit come to be understood as pitting some\nagainst others. Political theorizing began in arguments about what\npolitics was good for, who could participate in politics, and why,\narguments which were tools in civic battles for ideological and\nmaterial control as well as attempts to provide logical or\narchitectonic frameworks for those battles.\n\nSuch conflicts were addressed by the idea of justice, which was\nfundamental to the city as it emerged from the archaic age into the\nclassical period. Justice was conceived by poets, lawgivers, and\nphilosophers alike as the structure of civic bonds which were\nbeneficial to all (rich and poor, powerful and weak alike) rather than\nan exploitation of some by others. Hesiod’s late eighth-century\nepic poem Works and Days, for example, contrasts the brute\nstrength with which a hawk can dominate a nightingale (“You are\nbeing held by one who is much stronger… I will make a meal of\nyou, if I want, or let you go,” lines 206–208), with the\npeace and plenty which flourishes wherever justice, such as rendering\nfair verdicts to foreigners, is preserved (lines 225–230).\n\nSo understood, justice defined the basis of equal citizenship and was\nsaid to be the requirement for human regimes to be acceptable to the\ngods. The ideal was that, with justice as a foundation, political life\nwould enable its participants to flourish and to achieve the\noverarching human end of happiness (eudaimonia), expressing a\ncivic form of virtue and pursuing happiness and success through the\ncompetitive forums of the city. Whether justice applied to the\ncity’s relation with other cities was a further and highly\ncontested point, memorably explored in Thucydides’ recounting of\nthe “Melian Dialogue” in 416 BCE, in which emissaries of\nthe Athenians debated the meaning of justice with the leaders of the\nisland-city of Melos, a city they were threatening with death and\ndisaster should they fail to submit to Athenian imperial demands\n(Thuc. V. 84–114).\n2.2 Politics, Justice, and Equality\n\nJustice, then, depended on treating equals equally, and distributing\ncitizenship and the privileges of officeholding accordingly. Yet how\nshould “the equal” be understood? This became the major\npolitical faultline of the Greek fifth century BCE. Oligarchical\nregimes might consider only the\n kalokagathoi[2]—the \n elite and well-born, usually also wealthy landowners\n—to be full equals; democratic regimes, by contrast, tended to\ntreat the “many” (or some large proportion of them) as\npolitical equals of the elite “few,” in the fullest\ndemocracies enfranchising all free- and native-born\n men.[3]\n Sparta, a unique political entity, still exemplified the same broad\npattern in naming its citizens “the equals” or (more\nliterally) “the peers” (hoi\n homoioi).[4]\n The absence of slave status made one free but not necessarily a\ncitizen. Slavery for its part was little discussed as an explicit\npolitical question, though Aristotle recognized that the question of\nits justice or injustice had indeed been raised at least in\ntheoretical debate and needed to be addressed, which he did himself by\nsketching out a kind of slavery that could in principle (so he\nclaimed) be just by nature (see 4.3 below; Garnsey 1996 on slavery in\nGreek thought from Aristotle to Augustine). The exclusion of women\nfrom active citizenship in Athens was more consciously felt, giving\nrise to fantasies of female-dominated politics in Aristophanic comedy\n(Lysistrata, Assemblywomen) and to tortured\nreflection in many tragedies (consider the titles of Medea\nand Trojan Women, both Athenian works setting explorations of\nwomen’s roles in the dramatic contexts of archaic foreign\npolities).\n\nAmong equals, however defined, the space of the political was the\nspace of participation in decision-making concerning public affairs\nand actions. That invention of the political (what Meier 1990 calls\nThe Greek Discovery of Politics) was the hallmark of the\nclassical Greek world. Citizens, whether the few (usually the rich) or\nthe many (including the poorer and perhaps the poorest free adult\nmen), gathered together to conduct public affairs, sharing either by\ncustom, by election, or by lot—the latter seen in Athens as the\nmost democratic, though it was never the sole mechanism used in any\nGreek democracy—in holding, or holding accountable, the offices\nfor carrying them out. Rhetoric played an important role in shaping\nthose decisions, especially, though not only, in democracies, where\ndiscursive norms shaped by the poor majority were hegemonic in public\neven over the rich (Ober 1989).\n\nAt the same time, politics was shaped by the legacy of archaic poetry\nand its heroic ethos and by the religious cults which included,\nalongside pan-Hellenic and familial rites, important practices\ndistinct to each city-state. This was a polytheistic, rather than\nmonotheistic, setting, in which religion was at least in large part a\nfunction of civic identity. It was a world innocent of modern\nbureaucracy and of the modern move to intellectual abstraction in\ndefining the state: the entity we would call “Athens” in\nthe abstract was called in its own day by the collective noun for its\nliving and breathing citizens, “the Athenians.” So if\nancient political philosophy left out much that modern political\nphilosophy would include (e.g., for the most part, the question of the\njustness of slavery), it also included much that the latter would tend\nto exclude. Not only the civic religious cult, but also the patterns\nof child-rearing, cultural stories expressed in music, epic, and\ndrama, gender roles and sexual practices, military participation, and\nso on, were features of the “way of life” which\nconstituted the politeia or “constitution” in its\nbroadest sense (Lane 2014a, 59–62). This broadest sense was\ninitially most evident to the Athenians when they looked at the\npeculiar customs of Sparta, but Plato taught them to recognize that\ndemocratic Athens was as distinctive a regime (Schofield 2006:\n31–43), one embodying a particular set of ethical goals and\npractices in its political arrangements.\n\nMost of those generally recognized as “wise men”\n(sophoi) and “students of nature”\n(physikoi) who appeared in this milieu, thought within the\nsame broad terms as the poets and orators. Justice was widely, if not\nuniversally, treated as a fundamental constituent of cosmic order.\nSome of the physikoi influenced political life, notably a\nnumber of the Pythagoreans in southern Italy. Others held themselves\naloof from political action while still identifying commonalities or\nconsonances between nature and politics, for example, Democritus of\nAbdera, whose atomist philosophy comported with a defense of political\nlife, and so of the justice that it required individuals to enact, as\nbeing necessary for individual flourishing (see e.g. Democritus’\nfragment DK B252 = Taylor D116). However, these portraits of broad\nconsonance between nature and politics were challenged in the mid to\nlate fifth century BCE by some among a new breed of thinker and actor,\nthe professional teachers (“sophists”), who began to ask\nwhether the laws and customs (nomos, singular;\nnomoi, plural) embodying political justice were truly a\nreflection of justice in nature (phusis), or merely an\nimposition of arbitrary human norms. Most of the sophists argued the\nlatter, though they did so along a spectrum of interpretation (for\nwhich our evidence rests heavily on Plato, who portrays Socrates\narguing with a considerable number of sophists): for example, for\nProtagoras (an itinerant teacher from Abdera who is depicted in\nPlato’s Protagoras and Theaetetus), the human\ncreation of political life was a cause of celebrating human virtues\nand practical abilities; whereas for Thrasymachus (an ambassador to\nAthens from Chalcedon, a city in Asia Minor near modern Istanbul, who\nis depicted in Plato’s Republic), it was a cause of\ncondemnation, the powerful in any city imposing laws to serve their\nown advantage. In addition to the question of how laws fit into the\nnatural order, many sophists raised the question of whom the laws\nbenefited: were laws a socially and individually useful set of\nrestrictions on bad behavior, as some including Antiphon and an author\nknown today as the Anonymous Iamblichi seemed to think? Were\nthey the exploitative impositions of the strong on the week, as Plato\nhad his character Thrasymachus argue? Or were they the means by which\nthe many tamed and controlled the naturally powerful, preventing the\nlatter from using their strength for their own profit, as Plato had\nhis character Callicles argue? (See the entry on Callicles and\nThrasymachus.) These varied dimensions of the\nnomos-phusis debate raised challenges for the\ngoverning intellectual assumptions of the polis, even though\nthe sophists advertised themselves as teaching skills for success\nwithin it, a number of them being employed as diplomats by cities\neager to exploit their rhetorical abilities. Socrates and Plato would\nrespond to this challenge in shaping a new genre of\n“philosophy” which broke the mould of their predecessors\n(on the genre of philosophy, see Nightingale 1993a). While it is\nbroadly true to say that Greek political thinkers generally\npresupposed the importance of justice, in the fifth and fourth\ncenturies BCE many of them also increasingly problematized it.\n2.3 Politics and Philosophy\n\nIn giving birth to philosophy, the polis also gave birth to a\ntension between what Aristotle would describe as two lives: the life\nof politics and the life of philosophy. A faultline between ethics and\npolitics, so closely connected in an ancient culture preoccupied with\nflourishing (eudaimonia) and virtue (aretê),\nopened here. Should philosophers act politically (and if so,\nshould they engage in ordinary politics in existing regimes, or work\nto establish new ones), or should they abstain from politics in order\nto live a life of pure contemplation? There was likewise a question as\nto whether philosophers should think politically: were human\naffairs worth thinking about in the broadest perspective opened by the\nstudy of nature and of the gods? In engaging with questions of\nrhetoric, virtue, knowledge, and justice, Socrates’\nphilosophical life was engaged with the political even before his\ndeath (his trial and execution at the hands of the Athenian democratic\nregime) embattled him with it. But for his student Plato and\nPlato’s student Aristotle, the practice and even the study of\nhuman affairs such as politics were less divine, and so less\nadmirable, than the broader study of truth about the natural and the\ndivine realms. Philosophy might have to address the political but its\nhighest calling soared above it. If Socrates’ political fate was\npart of the stimulus for Plato to invent a new metaphysics and\nepistemology in order to articulate an alternative realm of political\npossibility, Plato’s dialogues show Socrates simultaneously\nasserting an independence for those disciplines from the bonds of the\npolitical\n alone.[5]\n\nThis distinctive Greek—and particularly Platonic – outlook\nmust condition any historical understanding of the development of\nancient political philosophy. While one influential approach to the\nhistory of political thought takes its bearings from what a thinker\nwas trying to do in and by what he or she said or wrote, it is\nimportant to recognize that the founders of ancient political\nphilosophy were in part trying to define a new space of doing as\nphilosophizing, independent of ordinary political action. This is not\nto say that they did not also have ordinary political intentions, but\nrather to stress that the invention of political philosophy was also\nintended as a mode of reflection upon the value of ordinary political\nlife.\n3. Socrates and Plato\n\nAccording to Cicero, Socrates (469–399 BCE) was the first to\nbring philosophy down from heaven, locating it in cities and even in\npeople’s kitchens (Tusc.V.10). A humbly born man who\nrefused the lucrative mantle of the sophistic professional teacher,\nyet attracted many of the most ambitious and aristocratic youth of\nAthens to accompany him in his questioning of them and their elders as\nto the nature of the virtues they claimed to possess or understand, he\nleft no philosophical writings. We know him only through the surviving\ntestimony of others, first the lampoons in Aristophanes’ comic\nplays, and above all the “Socratic” dialogues written by\nhis student Plato and his associate Xenophon (dialogues by others are\nknown only by titles or fragments), and the remarks of Plato’s\nstudent Aristotle, as well as other sources from after or even long\nafter his death (for a collection, see Giannantoni 1990, and see the\nentry on\n Socrates).\n3.1 Socratic Ethics and Politics\n\nSocrates seems to have been the first philosopher to treat\nethics—as opposed to cosmology and physics—as a distinct\narea of inquiry. Asserting in Plato’s Apology (38a)\nthat “the unexamined life is not worth living,” he pressed\nfor definitions of the virtues or excellences which were widely\nrecognized and claimed by his fellows, but which they found difficult\nto explain. As depicted by Plato, the search for such definitions led\ninvariably to a concern with knowledge of how best to live, as not\nonly one of the conventional virtues (in the form of wisdom) but also\nas underpinning, even constituting, them all. That elevation of\nknowledge in turn led Socrates to militate against the practices of\nrhetoric and judgment which animated political institutions of Athens\nsuch as the law-courts, Assembly and Council. Instead he posited the\nexistence, or at least the possibility, of political expertise,\nclaiming (in Plato’s Gorgias) to be the one person in\nAthens who at least tried to pursue such a true politikê\ntechnê, a complex notion that can be understood as meaning\npolitics as a kind of professional expertise (Grg. 521d). The\nnotion of political knowledge limited to one or a few experts, as\nopposed to the embedded and networked knowledge produced and exercised\nby the whole dêmos of Athens in their judgments and\npolitical roles (Ober 2008), struck at the central premises of\nAthenian democracy and those of Greek politics more generally (in\noligarchies, wealth rather than knowledge was the relevant criterion\nfor rule; in tyrannies, sheer power). Thus the nature of\nSocrates’ concern with ethics led him directly into a form of\npolitical philosophizing. The relation between politics and knowledge,\nthe meaning of justice as a virtue, the value of the military courage\nwhich all Greek cities prized in their citizens, all seem to have been\ncentral topics of Socratic conversation.\n3.2 Socrates’ Trial: The Political Philosophy of Citizenship\n\nThat engagement with political philosophy was dramatically intensified\nwhen Socrates was, at the age of seventy, arraigned, tried, and\nsentenced to death by an Athenian popular jury. In a prosecution\nbrought by a group of his fellow citizens who claimed to be\nshouldering that burden for the sake of the city (the usual way in\nwhich prosecutions were brought in Athens), the charges laid were\nagainst him were three-fold: not acknowledging the city’s gods;\nintroducing new gods; and corrupting the young (Apol. 24b).\nEach of these had a political dimension, given the civic control of\ncentral religious cults mentioned earlier, and the broad political\nimportance of educating the young to take their place in the civic\norder. Timed a few years after the overthrow of a short-lived\noligarchic regime (known as that of “The Thirty”) which\nhad been led by several of Socrates’ sometime associates Critias\nand Charmides (their oligarchic regime having been imposed after the\nignominious Athenian defeat in the war with Sparta which had earlier\nseen another associate of Socrates (Alcibiades) turn traitor to\nAthens), the trial must be suspected of having served as a substitute\nfor the prohibited political trials of the oligarchic partisans (such\ntrials having been generally barred by an amnesty passed in 403 BCE by\nthe restored democracy; see Cartledge 2009, Ch.7, Carawan 2013, Shear\n2011).\n\nSocrates’ speeches in the court trial—literary versions of\nwhich were produced by Plato, Xenophon, and a number of other\nfollowers—forced him to confront directly the question of his\nrole in an Athens defined by its democratic institutions and norms.\nSocrates had played his part as an ordinary citizen, allowing his name\nto go forward for selection by lot to serve on the Council, and\nserving in the army when required. But he had not engaged actively in\n“public affairs” (ta pragmata, Apol.\n32e): he had not spoken in the Assembly (31c), nor, so far as we know,\nbrought any prosecutions in the law-courts. In Plato’s account,\nafter countering the religious accusations, Socrates acknowledged this\nabstention from public affairs but claimed to have had a more\nsignificant mission laid on him by the god Apollo when his oracle at\nDelphi declared that no man was wiser than Socrates: his mission was\nto stir up the city like a gadfly (30e), discussing virtue and related\nmatters (38a), and benefiting each person by “trying to persuade\nhim” to care for virtue rather than wealth for himself and for\nthe city (36c–d). He went so far as to claim that as a civic\nbenefactor, he deserved not death but the lifelong publicly provided\nmeals commonly awarded to an Olympic champion (36e–37a).\nSocrates here depicts himself as a new kind of citizen,\nconceptualizing the public good in a new way and so serving it best\nthrough unprecedented actions, in contrast to the conventionally\ndefined paths of political contest and success (Villa 2001).\n\nWhile depicting himself in his defense speeches in Plato’s\nApology as a new kind of virtuous citizen, Socrates makes\nthree remarks which have in modern times been seized upon as\nindications of the principled limits which he might have put on the\nrequirement to obey the law. The first two recalled political\nincidents: while serving on the Council, he had voted against an\nillegal proposal (32b–c); and under the brief oligarchical\ndomination of “The Thirty”, he had disobeyed an order of\nthe ruling body to arrest a democratic partisan for execution\n(32c–d). The third is a hypothetical remark. If, he imagines,\nthe jurors were to say to him, “we acquit you, but only on\ncondition that you spend no more time on this investigation and do not\npractice philosophy, and if you are caught doing so you will\ndie,” his reply would be: “I will obey the god rather than\nyou, and as long as I draw breath and am able, I shall not cease to\npractice philosophy” (both quotations excerpted from longer\nsentences, 29c–d). Particularly in twentieth-century Anglophone\nscholarship, these remarks have engendered a view of Socrates as\nendorsing civil disobedience in certain circumstances, and so have\nframed the question of civil disobedience and the grounds for\npolitical obligation as arising in Plato. A significant debate on\nthese matters took shape in the United States in the 1960s and 1970s\nat the time of widespread civil disobedience relating to civil rights\nand the Vietnam War: see for example Konvitz 1964, Woozley 1972.\n\nThat debate has had to confront the fact that Socrates did not\nactually disobey his own death sentence with which his trial\nconcluded: when the time came, he drank the poisonous hemlock as\nprescribed by the jury. Before that moment, Plato imagines Socrates\nbeing visited in prison by his friend Crito (in a dialogue which bears\nthe latter’s name), and urged to escape for the sake of his\nfriends and family, a practice which was frequently tolerated in\nAthens so long as the escapee fled into exile. Socrates is not\npersuaded by Crito’s arguments. He begins his examination of\nthem by recalling principles to which he and Crito had in the past\nagreed, including the principle that it is better to suffer injustice\nthan to commit it (Cri. 47a–50a). He then goes on to\nventriloquize a series of speeches against escape, which he ascribes\nto the “Laws of\n Athens”.[6]\n These speeches articulate a set of special connections between\nSocrates and the Laws of Athens which, depending on one’s\nreading, either flesh out the principle that it is better to suffer\ninjustice than to do it (by dramatizing reasons for which it would\nunjust for Socrates to escape), or else stand in tension with it by\ninvoking absolutist grounds with implications more extensive than such\na principle would authorize (Harte 1999). On any reading, it is\nimportant to bear in mind that Socrates is choosing to obey a jury\nverdict that has commanded him to suffer what is arguably an\ninjustice, but not to commit one, so that one of his fundamental\nethical principles here as elsewhere in Plato (that it is better to\nsuffer an injustice than to commit one) is at least compatible with\nhis acceptance of the jury’s sentence.\n\nThe “Laws of Athens” appeal to a kind of social contract\nmade between themselves and Socrates. The contract is unequal: the\n“Laws” compare themselves to parents and slaveowners, and\nSocrates to child and slave. Obedience to them is owed, they claim,\nbecause the “Laws” have provided the whole basis for\nSocrates’ education and life in the city, a city in which he has\nnotably chosen to remain, never traveling abroad except on military\nservice. But the “Laws” also speak of the opportunity they\nafford to Socrates to “persuade or obey” them (51b;\n51e–52a). The meaning of this clause and its relevance to civil\ndisobedience is again much debated (Kraut 1984 remains a landmark).\nNevertheless, the image of Socrates tried, convicted, and made to die\n(by his own hand) at the city’s command has come to be a vivid\nand powerful symbol of tension in the relationship between political\nphilosophy and political authority.\n3.3 The Defense of Justice in the Republic\n\nThe Crito depends upon a notion of justice and injustice\nwhich it never defines. In the Republic, by contrast, a\ndialogue in which Socrates is also the main character (and\nfirst-person narrator) but in which the views he advances go beyond\nthe tight-knit pattern of debates in the dialogues discussed in\nsection 3.1, Plato (424/3–348/7\n BCE)[7]\n offers an account of justice linking the political to the\npsychological and justice to a higher understanding of true goodness.\n(See the entry on\n Plato.)\n The Republic is, with the Laws, an order of\nmagnitude longer than any other Platonic dialogue. Readers today are\nlikely to think of the Republic as the home par excellence of\npolitical philosophy. But that view has also been challenged by\nscholars who see it as primarily an ethical dialogue, driven by the\nquestion of why the individual should be just (Annas 1999). This\nsection argues that the ethical and political concerns, and purposes,\nof the dialogue are inextricably intertwined.\n\nNear the beginning of the dialogue, a challenge is launched by the\ncharacter Thrasymachus, mentioned above, asserting that all actual\ncities define justice so as to serve the advantage of the rulers. He\ntakes this to mean that the laws which their subjects are bound to\nobey and the associated ethical virtue of justice which they are\nenjoined to cultivate (traditionally seen as the necessary bond among\ncitizens and the justification for political rule), in fact amount to\na distorted sham. (See the entry on\n Callicles and Thrasymachus.)\n The question which Thrasymachus poses and which Plato’s\nbrothers Glaucon and Adeimantus reformulate—why should the\nindividual be just if he or she can get away with not being just, when\nelevated above the demands of ordinary justice either by special power\nor good fortune?—thus already has a political valence from the\noutset.\n\nSocrates then launches a speculation as to the origins of cities: the\ncity is held to have an existence independently of ethical concerns,\ncoming into being for economic reasons and immediately needing to\ndefend itself in war (and also to be able to make offensive war for\neconomic gain). However, this origin already gives rise to a\nproto-ethical dimension, first insofar as the members of the primitive\ncity each do their own work (the structure of what will emerge as the\nvirtue of justice), which is fleshed out when political rulers are\nestablished who are able to use their wisdom to help their subjects\nmaintain a psychological balance in their souls that approximates, if\nit does not fully embody, the virtues of moderation and justice and so\nenables them to enjoy a unified rather than a divided soul. The\nquestion of why the individual should be just, figured at the outset\nby the contrast with the putatively happy tyrant, is resolved\neventually by demonstrating that the tyrant will necessarily, in\nvirtue of the disorder of his soul, be at once maximally unjust and\nmaximally unhappy.\n\nThat resolution rests on the division of the soul into three parts by\nwhich the Republic places moral psychology at the heart of\npolitical philosophy. Both soul and city are posited by Socrates in\narguments in Books II–IV and VIII–IX, in particular, to\nhave a tripartite structure when the soul is embodied in a living\nperson. In the soul and city respectively, the rational part or class\nshould rule; the spirited part or class should act to support the rule\nof that rational part; and the appetitive part of the soul and\nproducing class in the city should accept being governed by it. Both\nsoul and city are therefore in need of, and capable of exhibiting,\nfour virtues (427e–444a). Two of these pertain to individual\nparts: the rational part being capable of wisdom, the spirited part of\ncourage. Two however are defined by relations between the parts:\nmoderation as the agreement of all three parts that reason should\nrule, justice as each part doing its own (this echoes, in a radically\nnew context, a conservative Athenian suspicion of excessive democratic\npolupragmosunê or busybody interference).\n\nThe result is that justice is defined as primarily a condition of\none’s soul or city as a whole, not as any specific just action;\nyet if the soul or city is so ordered, the individual will have no\ncause to engage in the paradigmatically unjust action of\npleonexia or grasping for more than one’s fair share. A\njust soul will indeed reliably issue in traditionally just actions,\nsuch as refraining from theft, murder, and sacrilege (contra Sachs\n1963, who argues that Plato has simply abandoned the usual domain of\njustice). But what makes its ‘justice’ count as such goes\nbeyond these particular actions and omissions, lying in the health and\norderliness of such a soul contrasted with the chaotic or even\ntyrannical character of an unjust soul (Burnyeat 2013). To be a truly\neffective, because wholly unified, agent, one must be just, moderate,\ncourageous and wise. The just person enjoys psychic health, which is\nadvantageous no matter how he is treated (fairly or unfairly) by gods\nand men; correspondingly, the just society enjoys civic unity, which\nis advantageous in being the fundamental way to avoid the assumed\nsupreme evil of civil war. In contrast, all other cities are\ncharacterized as riven by civil war between the rich and the poor;\nnone of them counts as a single, unified city at all (see Rep.\n422e–423a, and more generally, Book VIII of that dialogue).\n\nBy treating these ethical and political questions as interrelated, and\nthen going on to depict both an ideal political regime (“a\nkallipolis”, the fine or beautiful city) in which they could be\nsolved, and the imperfect regimes into which such an ideal regime will\ndecay, the Republic lays out a novel and ambitious template\nfor political philosophy: not only to interrogate the meaning of\nvirtue and citizenship, but also to develop an ideal regime and an\naccount of how and why such regimes may fail. That template will be\nfollowed by Aristotle’s Politics, by Cicero’s\nDe re publica, and by Thomas More’s Utopia,\namong other successors. In Plato’s hands, however, this template\nincluded some specific political prescriptions to maintain the unity\nof the ideal city which most of his successors abhorred. In\nparticular, Book V of the Republic suggests that a\nsufficiently unified regime can be achieved only by depriving its\nguardian-rulers of private property and of private families, instead\nmaking them live in austere communal conditions in which they are\nfinancially supported by their money-making subjects and allowed to\nprocreate only when and with whom will best serve the city. In Book II\nof his Politics, Aristotle would read this prescription as\napplying to all the citizens in the city envisaged in the\nRepublic, and both he and, later on, Cicero would deplore\nwhat they construed as this abolition of private property. Even those\nfollowing and radicalizing Plato precisely by advocating the abolition\nof property for all the citizens, rather than only deprivation of it\nfor the rulers, as would the sixteenth-century Sir Thomas More, were\ngenerally opposed to if not also scandalized by the suggestion of\nprocreative communism.\n\nThe Republic initiates a further tradition in political\nphilosophy by laying out a template for the integration of ethics and\npolitical philosophy into a comprehensive account of epistemology and\nmetaphysics. By making the claim of the philosophers to rule depend on\ntheir knowledge of the good and of the other Platonic Forms (in\nconjunction with their moral character and tested practical\nexperience), the dialogue vindicates the Socratic and Platonic thought\nthat ruling well—what we might call “rule” proper\n– requires a rare form of expertise rather than lay judgment,\nrhetorical advice, or common knowledge. In the Republic, the\nknowledge required for rule is not specialized, but comprehensive: the\nknowledge of the good and the Forms is somehow to translate into an\nability to make laws as well as the everyday decisions of rule. The\nrulers are philosophers who take turns over their lifetime in\nexercising political authority. They define their vocation as that of\nphilosophizing, engaging in rule out of some sort of compulsion or\nnecessity (see the entry on\n Plato’s ethics and politics in the Republic).\n To that extent the Republic presents a paradox: if it is\nwidely considered the first major work of political\n philosophy,[8]\n it envisages a constitution in which philosophers rule but do so\nseparately from their role of philosophizing. \n3.4 The Definition of Political Knowledge in the Statesman\n\nIn the Statesman, Plato turns his attention to precisely the\ntopics identified at the end of the last section above. In a\ndiscussion led by an unnamed person, a philosopher visiting Athens\nfrom Elea, political expertise (harking back to the politikê\ntechnê met above with Socrates, sect. 3.1) is identified by\nseparating it progressively by a set of distinctions from other forms\nof expertise. The discussion is interrupted but ultimately enriched by\na story or myth in which politics is shown to be a matter of humans\nruling other humans in place of living under divine guidance\n(O’Meara 2020). That human expertise of statecraft is ultimately\ndistinguished by its knowledge of the correct timing (kairos)\nas to when its closest rivals should be exercised: these are three\nforms of expertise that in fact corresponded to key political roles,\nsome of them formal offices, in Greek cities at the time, namely,\nrhetoric, generalship, and judging (Lane 1998, Lane 2013c). The\nstatesman is wholly defined by the possession of that knowledge of\nwhen it is best to exercise these and the other subordinate forms of\nexpertise, and by the role of exercising that knowledge in binding or\nweaving the different groups of citizens together, a knowledge which\ndepends on a broader philosophical grasp but which is peculiarly\npolitical (El Murr 2014). Here, political philosophy operates not just\nto assimilate politics to a broader metaphysical horizon but also to\nidentify its specificity.\n\nThe Statesman also raises an important question about the\nnature and value of rule by law, as opposed to rule by such expert\nknowledge as embodied in a rare and likely singular individual. For\nits part, the Republic had taken law in its stride as the\nstandard formulation to be utilized in the construction of the city in\nspeech by the dialogue’s principal interlocutors from Book II\nonward, who constitute themselves as the ideal constitution’s\n‘founders’ (Annas 2017, Lane 2013a). By contrast, the\nStatesman analyzes law as in principle a stubborn and\nimperfect substitute for the flexible deployment of expertise\n(293e–303c). However, the principal interlocutors of the latter\ndialogue go on to agree that if the choice is between an ignorant\nimitator of the true political expert who changes the laws on the\nbasis of whim, and a law-bound polity, the latter would be preferable,\nso bringing law back into the picture as an alternative to the ideal\nafter all.\n3.5 The “Second-Best” Regime of the Laws\n\nThe Laws, a work reported to have been still on wax tablets,\nand so possibly left unfinished when Plato died (Diogenes Laertius\nIII. 37), treats the specificity of politics as a matter not of\ndistinct vocational expertise but of the requirements of a\n“second-best” (739a) city, one in which private property\nis allowed, as opposed to an ideal or implicitly first-best regime in\nwhich private property would be prohibited to all (thus going beyond\neven the ideal regime of the Republic). In this section, as\nin most scholarly discussions, I will assume that the second-best city\nfor which laws are laid out in the later books is the projected Cretan\ncolony of Magnesia, of which the Cretan (Cleinias) among the\ndialogue’s three interlocutors has announced himself to be one\nof the intended founders. (For an alternative argument, that the\nsecond-best city is not meant to be Magnesia, see Bartels 2017.) In\nthis second-best city, the legislation for which is sketched out in\nspeech by the three interlocutors of the dialogue, politics still aims\nat virtue, and at the virtue of all the citizens, but those citizens\nall play a part in holding civic offices; the ordinary activities of\npolitics are shared, in what is described as a mixture of monarchy and\ndemocracy. That description gives rise to an idea of the “mixed\nregime” or “mixed constitution” which later became\ninfluential in its own right, as we shall see below (section 6).\n\nAnother influential aspect of the Laws is its positive\nevaluation of the nature of law itself as a topic proper to political\nphilosophy. While the Laws shares with the Statesman\nthe notion of law in an isolated and singular sense as being brutish\nand stubborn compared to expert knowledge, it recommends a\n“double” notion of law, in which each such command is\nprefaced with a persuasive account of its rationale, addressed to the\ncitizens, who are expected to read and understand it (719b–723d,\nand passim). Some scholars have found that to be a\ndistinctively democratic and liberal account of law (Bobonich 2002;\nsee also the entry on\n Plato on utopia).\n That arguably goes too far in a proceduralist direction, given that\nthe value of law remains its embodiment of reason or understanding\n(nous), so that while adding persuasive preludes is a better\nway to exercise the coercive force of law, no agreement on the basis\nof persuasion could justify laws which departed from the standard of\nnous (Laks 2005). Nevertheless, the emphasis on law as an\nembodiment of reason, and as articulating the political ideals of the\ncity in a form that its citizens are to study and internalize\n(Nightingale 1993b, 1999), is distinctive to this dialogue.\n\nAlso notable is that the Laws’ emphasis on all citizens\nas eligible, and so presumptively capable, to hold offices, differs\nsignificantly from the rule reserved for philosophers in the\n Republic.[9]\n The outlook in the Laws may have somewhat more affinity with\nthe closing passages of the Statesman, which refer to the\noffices or quasi-offices of rhetor, general and judge which at least\ncertain citizens will hold, those with the relevant expertise to play\neach role. The Statesman however reserves a special\nextraordinary role (presented as falling outside the structure of\nordinary civic offices) for the statesman whenever he is present in\nthe city (Lane 2013b). The role of the Statesman’s\neponymous figure must therefore be distinguished from that of the\n“Nocturnal Council” in the Laws (which is\nactually to meet just before dawn), a body of citizens who are\nselected for wisdom and judiciousness and whose role is to review the\nlaws and suggest potential changes to a body empowered to change them,\nrather than (as in the Statesman, at least theoretically) to\noverride them when it is better to do so (Reid 2021).\n\nMuch literature on Plato’s political philosophy has debated\nwhether the turn in the Laws to the “second-best”\nreflects a new form of realism on Plato’s part about politics\nmore generally, invoking other remarks by the Visitor from Athens, one\nof the three interlocutors, along with Cleinias and the Spartan\nMegillus, which suggest that no one could ever be uniformly and\nreliably virtuous and immune to corruption, though this is not\nunequivocally stated (e.g. 874e–875d). Has Plato in the\nLaws given up on his earlier idealism which rested on the\npossibility of the philosopher-king, or on the idea of the perfectly\nknowledgeable statesman? If so, should that be interpreted as\ndisillusionment or pessimism on his part, or as a more democratic or\nliberal turn? Or are there more fundamental continuities that connect\nand underlie even these seeming shifts? These questions structure the\nbroad debate about the meaning and trajectory of Platonic political\nphilosophy (for an overview, compare Klosko 2006 to Schofield\n2006).\n4. Aristotle\n\nThe two Platonic themes of superior political knowledge and, expressed\nparticularly in his Laws, political participation, also\nstructure the political thought of Aristotle (384–322 BCE), who\nstudied in Plato’s Academy as a youth and researched there for\nmany years thereafter. Living much of his life as a resident alien in\nAthens, with close familial ties to the extra-polis\nMacedonian court which would, near the end of his life, bring Athens\nunder its sway, Aristotle at once thematized the fundamental\nperspective of the Greek citizenship of equals and at the same time\nacknowledged the claim to rule of anyone of truly superior political\nknowledge. While building on Plato’s project of demarcating\npolitical expertise and depicting ideal as well as imperfect cities,\nthe advances and new directions that Aristotle pioneered in political\nphilosophy reflect certain disagreements with Plato in their wider\nphilosophies, though also with some deep commonalities.\n4.1 Aristotle’s Philosophical Method and Ethics\n\nWhereas Plato’s philosophy continually sought a single or small\nset of unifying truths behind the veil of appearance,\nAristotle’s wide-ranging researches into what would now be\nconsidered the natural sciences, as well as in logic and other areas\nof inquiry, manifested respect for the opinions of “the many and\nthe wise” as a starting-point for philosophical understanding.\nHis approach likewise manifested appreciation of the multiplicity of\nforms of knowledge, in particular the cleavage between theoretical\nunderstanding of the world as it necessarily is, and practical\nknowledge of how to deliberate about acting in relation to whatever\n“could be otherwise.” Uniting his accounts of phenomena as\ndifferent as plants, animals, ethics and politics, was a teleological\nstructure of explanation. Biological creatures work to fulfill the\nrealization of their end or telos, a specific way of living a\ncomplete life characteristic of the plants or animals of their own\nkind, which is the distinctive purpose that defines their fundamental\nnature—just as human artifacts are designed and used for\nspecific ends. While every human being, in acting, posits a particular\ntelos as the purpose making that action intelligible, this\nshould ideally reflect the overall natural telos of humans as\nsuch.\n\nHere, however, arises a problem unique to humans. Whereas other\nanimals have a single telos defining their nature (living the\nfull life of a frog, including reproduction, being the sole\ntelos of each frog, in the example used by Lear 1998), humans\nboth have a distinctive human nature—arising from the unique\ncapacity to use language to deliberate about how to act—and\nalso share in the divine nature in their ability to use reason to\nunderstand the eternal and intelligible order of the world. Practical\nreason is the domain of ethics and politics, the uniquely human\ndomain. Yet the political life is not necessarily the best life,\ncompared with that devoted to the divinely shared human capacity for\ntheoretical reason and philosophical thinking (compare Nicomachean\nEthics I with X.7–9). Whether it is the life of\ncontemplative reason or the life of practical reason that is best for\nhumans, the good life will require the development of the various\nhuman moral and intellectual virtues, which include (without being\nlimited to) courage, moderation, justice, prudence, understanding, and\nwisdom. \n4.2 Ethics and Politics by Way of Law\n\nIn considering practical reason to be the domain of both ethics and\npolitics, Aristotle follows Plato in drawing no sharp line between\nthose two domains (see on this point for ancient testimonies and\nmodern arguments respectively, Bodéüs 1993: 22–24\nand 59–63, and Vander Waerdt 1991, though for a contrary\nargument, see Duvall and Dotson 1998). In fact he closes his\nNicomachean Ethics by remarking that for most people, the\npractice of ethics can only be ensured by their being governed by law,\nwhich combines necessity (compulsion) with reason and habituates\npeople toward virtuous action (Nicomachean Ethics\n1179b32–1180a5) (Duke 2020). Because, for most people, the ethical\nlife presupposes government by law, the student of ethics must become\na student of political science, studying the science of legislation in\nlight of the collection of constitutions assembled by Aristotle and\nhis school in the Lyceum. All but part of one of the over one hundred\nitems in this collection reported in antiquity have been lost: a\nconsiderable part of the analysis of the “Constitution of\nAthens” was recovered from a papyrus discovered in the\nnineteenth century. Aristotle’s theoretical claims about the\nnature of politics in the Politics must be understood against\nthis backdrop. The legislator (whose standpoint is adopted in the\nPolitics, see the entry on\n Aristotle’s political theory)\n needs to have a grasp of the nature of politics as such (pursued\nespecially in Books I and III); an understanding of the major\nfaultlines in the interpretation and practice of politics (pursued\nespecially in Books II and IV–VI); and a grip on the structure\nand characteristics of the specific city for which he aims to\nlegislate (pursued also in Book II for existing constitutions and\nconstitutional models; Books IV–VI for types of flawed\nconstitutions; and Books VII–VIII for the “best\nconstitution” (1323a14).\n\nAt the beginning of Book IV (1288b1–39), Aristotle offers a\nfourfold account of what the expertise regarding constitutions must\nencompass. As glossed by Eugene Garver (2011: 107), and drawing on\nstandard Aristotelian terminology distinguishing formal from material\ncauses, these include: “The first, ‘that which is best in\nthe abstract’...orients politics around the end of politics, the\nbest life. The second, the best relative to circumstances, starts with\nthe material cause and organizes political inquiry around the best\nthat can be made out of given material. The third, the best on a\nhypothesis, starts not from the true end of politics, but any posited\nend, and so looks for means and devices that will preserve any given\nconstitution. The final inquiry, the search for ‘the form of\nconstitution which is best suited to states in general,’\narticulates a formal cause that can organize almost any material, any\nkind of people.” These four elements of expertise regarding\nconstitution are not tidily segregated in different parts of the text;\nthey are pursued variously, sometimes in combination, and draw on\nwider discussions of the nature of politics and the human good that\nare threaded throughout.\n4.3 Claims to Rule\n\nThe Politics begins by setting the stage for the first kind\nof understanding of constitutions identified above, by offering an\nanalysis of the teleological ends of life and the human capacity for\nspeech which together support its two most famous contentions: that\n“it is evident that the state is a creation of nature, and that\nman is by nature a political animal” (I.2, 1253a2–3). (Hu\n2020 discusses the naturalness of the polis.) While for some\nmodern readers this sentence asserts that political participation is\nnecessary for virtuous human flourishing (as for Irwin 1990), others\ncontend that “the argument that man is a political animal does\nnot imply that man must participate in politics to become virtuous,\nonly that he must literally be a part of a polis and live\nunder its laws.” (Mulgan 1990:\n 205)[10]\n In either case, as Hannah Arendt (1958) emphasizes, Aristotle’s\nunderstanding of civic unity insists on respect for human plurality as\nthe condition of political action; in Book II, he criticizes\nPlato’s kallipolis (the beautiful city for which a\nconstitution is sketched in the Republic) for interpreting\nthe requirement of civic unity in so extreme a fashion as to have\nobliterated the properly political domain altogether (Nussbaum 1980).\nNevertheless, civic unity is still an aim of Aristotle’s ideal\nvirtuous regime, and a limited Platonic spirit survives in the common\nmeals that this regime would offer to all citizens: VII.10. \n\nIf “man is by nature a political animal,” how can it be\njust to exclude some human beings from a full share, and in some cases\nfrom any share, in political life? Aristotle recognizes that this\nquestion must be confronted, and he acknowledges some unnamed thinkers\nwho had answered that it is indeed unjust. For these unnamed figures,\nslavery is not merely a conventional arrangement (rather than a\nnatural one); it is a conventional arrangement which is contrary to\nwhat is natural, and this is why it should be counted as unjust. As\nAristotle describes their view: “Others affirm that the rule of\na master over slaves is contrary to nature [literally: ‘against\nnature’ (para phusin)], and that the distinction\nbetween slave and freeman exists by convention [nomō,\ndative] only, and not by nature [phusei]; and being an\ninterference with nature is therefore unjust [not dikaion]:\nfor it is force [biaion]” (I.4,\n1253b20–23). Aristotle blocks the inference that any\nrelationship of slavery is contrary to nature and therefore unjust, by\narguing that there are or could be grounds for a kind of slavery that\nis indeed consonant with nature: namely, he claims, enslavement of\nthose whose practical reason is incapable of fully ruling their own\nactions. He contends that the person who is by nature a slave\n“has no deliberative faculty at all; the woman has, but it is\nwithout authority, and the child has, but it is immature” (I.13,\n1260a12–14) (on interpretation of this passage in light of\nAristotle’s biological works, Karbowski 2012; for an argument\nthat Aristotelian natures are made through habituation, Frank 2005).\nThis does not imply that any or all actually enslaved persons are\nnatural slaves, though Aristotle in the same chapter and elsewhere\nremarks on “barbarians,” especially peoples who live in\ncertain climates, as fitted for slavery (Kraut 2002:\n290–95). Some of the pernicious afterlives of this view and of\nthe Aristotelian account of natural slavery more generally in later\ndefenses of slavery are recounted in Huxley 1980 and Monoson 2011. On\nmany interpretations, the view also leads to some tension in\nspecifying the function of slavery as an institution, since that\ninstitution presupposes that the slave can understand and follow the\nmaster’s commands, which would seem to require some degree of\ndeliberative capacity even on Aristotle’s own terms. The\nexclusion of some human beings from a share in political life and\ntheir subjection to the domination and exploitation of a relationship\nof enslavement shadows Aristotle’s exploration of the value of\nthe life of politics for realizing human nature.\n\nElsewhere in the Politics, the Greek dictum of citizenship\namong equals—that “a citizen is one who shares in\ngoverning and being governed” (III.13, 1283b42–1284a1,\nalso translatable as “ruling and being ruled in\nturn”)—is presented as an analytical truth, leaving open\nhow such equality is to be conceived in practice (and again,\nconsistent in the logic of the argument with the potential exclusion\nof some from the domain of equality altogether). The citizen\n“shares in the administration of justice, and in offices”\n(III.1, 1275a23–24). In defective regimes, the good citizen and\nthe good man may come apart.  The good citizen of a defective regime\nis one whose character suits the particular regime in question\n(whether oligarchic, or democratic, say) and equips him to support it\nloyally; hence he may be deformed or stunted by a role of holding (or\na role of holding accountable) offices defined on incorrect terms. In\n“the best state,” however, the citizen is “one who\nis able and chooses to be governed and to govern with a view to the\nlife of excellence” (III.13, 1284a1–3). In such a state,\n“the citizens must not lead the life of artisans or tradesmen,\nfor such a life is ignoble and inimical to excellence” (VII.9,\n1328b39–41), nor that of farmers, as political participation\nrequires leisure. Here the limitations and exclusions among actual\nhumans licensed by the principled formulation of the\npossibility—requiring actual realization—of human virtue\nbecome apparent.\n\nAristotle recognizes that there are other possible claims, or as it\nwere titles, to political rule: “There is also a doubt as to\nwhat is to be the supreme power in the state:—Is it the\nmultitude? Or the wealthy? Or the good? Or the one best man? Or a\ntyrant?” (III.10, 1281a11–13). He develops in particular\ndetail the arguments that might be made on behalf of the many and the\nknowledgeable one respectively. The many can judge, as they did in\nAthenian dramatic audiences, juries, and the Assembly (where they\n“judged”, by voting on, the merits of something advanced\nfor their consideration, whether a play, an indictment, or a\nspeaker’s proposed resolution). Aristotle uses the image of a\ncollectively provided feast to illustrate the potential superiority of\nsuch collective judgement; how to interpret this image (whether as a\npotluck, Waldron 1995, Wilson 2011, Ober 2013, or in a more\naggregative way, Bouchard 2011, Cammack 2013, Lane 2013a, Hatzistavrou\n2021) and other images that he uses is a matter of some renewed\ncontroversy (for a review, see Bobonich 2015). But the lesson\nAristotle draws from the various images is clearly limited to\nvindicating a role of the many in electing and holding accountable\nincumbents of the highest offices rather than in holding such offices\nthemselves (III.11, 1281b31; Lane 2013a). The many can contribute to\nvirtuous decision-making in their collective capacity of\njudgment—presumably in assemblies and juries—but not as\nindividual high officials (Lane 2013a, 2014b, Poddighe 2014).\n\nIn the contrasting case of the one supremely excellent person,\nAristotle argues that such a person has, strictly speaking, no equals,\nand so cannot be made justly to take a turn in rule, holding office\nfor a time, as one citizen among others. Instead it is right that such\na person should rule without the term limits that political office\nwould ordinarily require:\n\nIf, however, there be some one person, or more than one, although not\nenough to make up the full complement of a state, whose excellence is\nso pre-eminent that the excellence or the political capacity of all\nthe rest admit of no comparison with his or theirs, he or they can be\nno longer regarded as part of a state; for justice will not be done to\nthe superior, if he is reckoned only as the equal of those who are so\nfar inferior to him in excellence and in political capacity. Such a\nman may truly be deemed a god among men ….men like him should\nbe kings in their state for life. (III.13,\n1284a3–11…1284b32–34; cf. III.17, 1288a24–29)\n\n\nOn one reading, this implies that virtuous monarchy does indeed count\nas a political regime, albeit one in which only one or a few of the\ncitizens are eligible to hold the highest offices (Riesbeck 2014). Yet\nthis argument is left at the hypothetical level. In the absence of\nsuch a superlatively virtuous, even godlike individual, the\nformulation of political rule as involving some kind of turn-taking by\na large body of sufficiently virtuous citizens remains preeminent\n(though even this should not be read to imply that all should in fact\nalternate in office, or even that all should necessarily be eligible\nfor all offices).\n\nAs Aristotle turn to consideration of the best constitutions relative\nto particular (and imperfect) circumstances, the major issue is\nconflict between rival factions over the basis for defining equality\nand so justice. In the Nicomachean Ethics, Book V, Aristotle\nhad identified two types of equality: geometrical, or proportional to\nmerit; and arithmetical, or proportional to mere numerical counting.\nIn Politics III.9 he picks up this distinction and aligns it\nwith the conflict between oligarchical and democratic justice. As he\nlater puts it, “Democrats say that justice is that to which the\nmajority agree, oligarchs that to which the wealthier class\nagree…” (VI.3, 1318a18–20), while truly\naristocratic justice would enfranchise only those equal in virtue.\nThis attention to the actual political contentions of rival Greek\ngroups leads into a discussion of the relative goodness and badness of\nimperfect regimes, modeled in part on Plato’s\nStatesman. Whereas that Platonic text had distinguished\nmonarchy from tyranny, aristocracy from oligarchy, and good from bad\ndemocracy on the basis of obedience to law (all these regimes being\nconceived as lacking the genuine political knowledge of the true\nstatesman), Aristotle instead makes the dividing line the question of\nruling for the common advantage as opposed to ruling for the advantage\nof a single faction. The “bad” democracy, for example,\nrules for the faction of the many as opposed to the faction of the\nfew, whereas the “good” democracy—which Aristotle\nbaptizes “polity”, using the general word for\n“constitution” (politeia)—rules for the\nadvantage of all citizens. Aristotle augments this analysis with\nappeals to historical narrative, overlapping with the narrative of\nAthenian political history offered in the Constitution of\nAthens compiled by him or, more likely, by members of his school.\nOn his telling in the Politics, Athenian democracy had\ndegenerated from an aboriginal democracy of non-meddling farmers\n(VI.4), through various intermediate forms, to a democracy (seemingly\nthat of contemporary fourth-century Athens) in which men rule, not\nlaws. Yet this trajectory does not prevent him from asserting that in\ngeneral democracy is “most tolerable” of the three\nperversions (IV.2, 1289b4–5) and noting that it at least\ninvolves the characteristic political liberty of ruling and being\nruled in turn (VI.2).\n\nA further major turn in the analysis comes when the question of some\nsingle “best” regime is replaced by a question about not\nwhat is “best” in the “ideal” sense, but the\ngood constitution “that is easily attainable by all”\n(IV.1, 1288a37–39) and in practice best for most cities (IV.11).\nThis Aristotle calls the middling regime: a political, because\nsociological, mean between oligarchy and democracy, in which the\nmiddle classes hold the preponderance of both wealth distribution and\npolitical power. Thus it is attainable through reform of either an\noligarchy or a democracy, the most prevalent constitutions among the\nGreeks. Strikingly, his example of such a regime is Sparta: presented\nas a case of a characteristically democratic distribution of education\n(among citizens only, of course) coupled with the characteristically\naristocratic principle of election to offices rather than selection by\nlot (IV.9) (though to be sure, democracies such as Athens made use of\nelection for certain of the highest offices as well).\n4.4 Aristotle in Political Philosophy\n\n“All modern discussions of citizenship as a noninstrumental\ngood-in-itself are indebted, if only indirectly, to him [sc.\nAristotle]” (Ober 1998: 290). The Politics emphasizes\nthat “a state is not a mere society, having a common place,\nestablished for the prevention of mutual crime and for the sake of\nexchange” but is rather “a community of families and\naggregations of families [sc. united] in well-being, for the sake of a\nperfect and self-sufficing life” (III.9, 1280b30–34, with\nsquare brackets added). It has been suggested in this article that the\nfinal clause of that sentence is important: Aristotelian citizenship\ncounts as a noninstrumental good-in-itself only so long as it does\nindeed aim at the telos of a perfect life. That is, while\nAristotle indeed valued the possibility of political participation in\nofficeholding and the control of officeholding as part of the best\nconstitution, he saw its value as most fully realized only insofar as\nit was an expression of virtue, as it would be in that best\nconstitution (whether governed by a collectivity of virtuous citizens\nas in the regime described in Books VII and VIII, or in the rare and\nperhaps purely hypothetical case of a superlatively virtuous\nmonarch).\n\nNevertheless, Ober’s observation rings true more broadly for the\nhistorical significance of Aristotle’s political thought. The\nmedieval rediscovery in the West of the full Greek texts of\nAristotle’s Ethics and Politics and their\ntranslation into Latin in the thirteenth century served as a basis for\nreconceiving civic life as valuable on the basis of reason independent\nof revelation. Thus 1260 – the date of William of\nMoerbeke’s complete Latin translation of the\nPolitics—symbolizes a fundamental turning point in\npolitical philosophy, one in which Aristotelian philosophy would be\nwidely deployed within certain strands of thought of the Catholic\nChurch, while also inspiring a wide range of philosophical movements\nand later becoming the target of others. Indeed, modern debates over\nthe meaning of Aristotle find him a precursor of or inspiration for a\nrange of intellectual and political positions: Aristotle as a\ncommunitarian (MacIntyre 1984) vs. Aristotle as an exponent of class\nconflict (Yack 1993); Aristotle as a democrat, or at least as\nproviding the basis for democracy (Frank 2005), vs. Aristotle in\nopposition to Athenian democracy in his day (Ober 1998). One\ninteresting development has been the use of Aristotle to articulate an\nethics of capability (Nussbaum 1993). In evaluating Aristotle’s\npolitical thought, it is important to distinguish between modern\ndemocratic assumptions and his own starting points, many of which were\nin tension with the democracies of his own time.\n5. Hellenistic Philosophies and Politics\n\nImportant developments in political thinking and practice took place\nunder the Hellenistic kingdoms that supplanted Macedon in its\nsuzerainty over the formerly independent Greek city-states. These\nincluded, for example, a genre of rhetorical letters addressed to\nrulers, and the important analysis of Greek and Roman constitutional\nchange by the second-century Greek historian Polybius (Hahm 2000). As\nkingships flourished among the Hellenistic kingdoms until they in turn\ncame under Roman rule, not only the value of political participation,\nbut also the proper domains of politics, were widely debated.\nDifferent authors would orient themselves respectively to\nstill-surviving polis communities and the various leagues which united\nmany of them in the Hellenistic period; to the kingdoms mentioned\nabove; to the Roman constitution, and eventually to the special forms\nof imperial power which eventually arose therein; and in more\nphilosophical terms, to the cosmos as a whole and all rational beings\nwithin it.\n5.1 Persisting and New Schools\n\nIn addition to the major movements of Epicureanism and Stoicism\ntreated separately below, other schools also persisted and arose in\nthis period. Those persisting included the Platonic Academy\n(transformed in a skeptical direction) and the Aristotelian Lyceum\n(the Peripatetic School). Newcomers, albeit tracing themselves to\ntheir own understanding of the figure of Socrates, included the Cynics\nand the Pyrrhonist skeptics, and we focus on these latter two\nhere.\n\nThe Cynics took their name from the Greek for “dog,”\nreferring to the animal-like life indifferent to social conventions\nwhich they pursued, carrying out all their bodily functions in full\npublic view. While this generally led them to advocate what might be\nconsidered more an anti-politics than a politics, a provocative\nstatement by their founder Diogenes of Sinope (c.404–323 BCE)\n– answering a query about his birthplace by asserting himself to\nbe a “citizen of the world” (Diogenes Laertius, VI. 63)\n– would resonate with later Stoics and others developing a\npolitical philosophy that has become known as cosmopolitanism (see the\nentry on\n cosmopolitanism).\n Diogenes’ indifference to political power was also reflected in\nhis reported reply to the visiting world-conqueror Alexander the\nGreat, asking him to request a boon: all the Cynic wanted was for the\nemperor to step out of his light (Diogenes Laertius, VI. 38). In a\nlineage stretching from Diogenes to his follower Crates, who became\nthe teacher of Zeno, the founder of Stoicism, we can see the\nCynic-Stoic kinship especially in the early Stoics’ rejection of\nmany conventional political and moral opinions. Yet the Cynics also\nmanifested some parallels with the Epicureans and even with the\nskeptics.\n\nOne branch of ancient skepticism had its roots in Plato’s\nAcademy, which from the time of Arcesilaus’ headship in the\nmid-260s BCE turned in a skeptical direction, arguing that there was\nno clear criterion of truth and so philosophers can only suspend\njudgment. While that was an “Academic” position within\nphilosophical debate, a possible forebear (Pyrrho) had in the fourth\ncentury BCE putatively demonstrated the tranquility of mind which such\na position could bring, by living a life seemingly without any\ninvestment in the truth of his beliefs (though the question of how,\nand how far, Pyrrho was guided by appearances would perplex later\nfollowers). (See the entry on\n Pyrrho.)\n From the first century BCE, a radical movement of\n“Pyrrhonist” skepticism was developed outside the Academy\nby Aenesidemus, followed about a century later by Agrippa, in a\nmovement summed up for posterity in the second-century CE work of\nSextus Empiricius (Outlines of Pyrrhonism) which would have a\nconsiderable influence on early modern philosophy. Meanwhile the\nmilder “Academic” skepticism, allowing the inquirer to\nincline to one side or another though not to invest in full belief,\nhad significant influence on first-century BCE figures such as Cicero.\n(See the entry on\n ancient skepticism.)\n5.2 Epicureanism\n\nFounded by Epicurus in his “Garden” in Athens in the early\nthird century BCE, and elaborated by, among others, the remarkable\nLatin poet Lucretius in the mid first century BCE, the various members\nof the Epicurean school did not see politics as a straightforward part\nof the good life or a fulfillment of the flourishing of human nature,\nthough their views of its origins, nature, and largely instrumental\nvalue were complex (for an overview, see Robitzsch 2017). For his\npart, Epicurus himself (see the entry on\n Epicurus)\n is reported in his “Key Doctrines” to have held a\ncontractarian view of justice for mutual protection from harm\n(reminiscent of Glaucon’s initial proposal about justice in\nRepublic Book II, which itself seems to echo the\nnomos-phusis debate among the 5th c. BCE sophists). Justice\nserves utility (Alberti 1995): as Epicurus wrote, “If someone\nmakes a law and it does not happen to accord with the utility of\nsocial relationships, it no longer has the nature of justice”\n(KD 36, LS 22B) (on Epicurean justice, Aoiz and Boeri 2022).\nThe greatest utility is that of tranquility or security, which is the\nnaturally desired end or goal. While, as Annas 1993: 298 argues, the\nindividual Epicurean agent will be disposed to justice as part of the\npath to tranquility properly understood (“The just <life>\nis most free from disturbance…”, KD 36, LS 22B),\nnevertheless laws will be necessary to enforce obedience to the\ncontract by most people, and indeed one should obey the laws in order\nto attain peace of mind (KD 34–35, LS\n22A4–5).\n\nFor Epicureans, the city serves a legitimate and necessary function in\nensuring security. But this does not mean that an active public life\nis also normally the most rational path to security. On the contrary,\nwhile many people will be attracted to the possible fortune and glory\nof such a life, and while cities need such people, the Epicurean sage\nwill on the whole refrain from active political participation (for\ndiscussion of texts, including some exceptions, both in Lucretius and\nother evidence, see Fowler 2007). Instead the insecurities of life are\nbest met by the formation of a community of friends living together\nand sharing their lives. Friendships both secure us against risks and\nanxieties (more reliably than the hazards of a political career) and\nalso provide pleasures and indeed joy: to quote Epicurus once again,\n“The man of noble character is chiefly concerned with wisdom and\nfriendship. Of these the former is a mortal good, but the latter is\nimmortal” (Vatican Sayings 78, LS 22F (7)).\n\nA potential sticking point for Epicurean ethics and politics is the\njustification for a still further dimension of communal life: the\nwillingness to sacrifice oneself for a friend, or to risk breaking the\nlaw for the greater good of one’s fellow citizens (Sharples\n1996: 122). It would seem difficult to construct a compelling\ntheoretical justification for such actions from Epicurean premises,\nwhich privilege obedience to law in order to avoid civic strife (as\nseen for example in key moments in Lucretius’ poem De Rerum\nNatura, V.925–1157; see Campbell 2003, especially on lines\n1011–1027), though Cicero has Torquatus report in De\nFinibus (I.69) that at least some Epicureans believed that\nfriendly relationships could mature into love of a friend for their\nown sake. Whatever the theoretical conundrum, it did not prevent a\nnumber of Epicureans from undertaking such risky public service, among\nthem more than one of the assassins of Julius Caesar (Sedley 1997;\nFowler 1989 discusses a wide range of Roman Epicurean attitudes). A\nmore modest but still striking example of Epicurean public service is\nthe huge portico inscribed with Epicurean sayings and exegesis in\nsecond-century Oenoanda (in modern-day Turkey) by one Diogenes of that\ncity (Smith 1992, 2003). Whether or not his fellow citizens\nappreciated the instruction, modern archaeologists and philosophers\nare grateful for this unparalleled source of knowledge of Epicurean\nphilosophy.\n5.3 Stoicism\n\nWhile Epicurus held that the sage would not engage in politics except\nin “some special circumstance,” Zeno, the founder of the\nStoic school (see the entry on\n Stoicism),\n held rather that a true sage “will engage in politics unless\nsomething prevents it” (Seneca, De Otio 3.2, as\ntranslated and quoted in Sharples 1996: 124; SVF 1.271). As\nwe shall see, a Stoic commitment to politics generally took it to be\npart of nature’s rational plan for human happiness, though this\nwas not incompatible with a Cynic tincture of questioning whether\nexisting laws are truly in accordance with the natural law (Vogt\n2008). The question however of the nature of the polity in which\npolitics was to be exercised remains contested as a matter of the\ninterpretation of various Stoic figures, who across the lifetime of\nthe school encompassed both the early generation of the school’s\nleaders (Zeno and his successor Chrysippus) and later figures thriving\nin the Roman period who wrote variously in Greek and in Latin (for an\noverview, see Laurand 2005). To be sure, the polity in question was\ninvariably figured as a city, according to the account given in Dio\nChrysostom (36.20: “ They [the Stoics] say that a city is a\ngroup of people living in the same place and administered by\nlaw” (SVF 3.329, as translated in LS 67J). But which\npeople? Whether the members of this city were to be all humans\ntogether with the gods, or only human sages and the gods, and whether\nthe city is to be envisaged as a distinct foundation or as identical\nwith the cosmos, has much exercised both Stoic thinkers and subsequent\ninterpreters. And which law? How does or should the law of a\nparticular city relate to the natural law? These questions are\ncanvassed further as this section unfolds.\n\nBoth Zeno and Chrysippus wrote works in the Platonic genre entitled\nRepublic, neither of which survives in full. (So too,\nreportedly, had Diogenes the Cynic.) Zeno’s was written as a\nyoung man, allegedly under Cynic influence, rejecting the use of money\nin the characteristic Cynic vein. His portrait of the republic\ncombines the Stoic idea of a natural law by which human conduct is\nharmonized with cosmic order, with a classical vision of politics in\nwhich a Platonic ideal of friendship through communist and sexual\nbonding (more erotic than familial for Zeno) persists (following\nSchofield 1991: 22–56). He seems to have adopted Plato’s\nprescription for the community of women and children, and at least\nsome aspects of his insistence on the potential civic equality of men\nand women and political irrelevance of their anatomical differences.\nHumans share many characteristics and tendencies with other animals,\nand their initial impulse to form into society is a social rather than\nstrictly political one: they are animated by a tendency to associate\nwith those akin to themselves (the Stoic notion of\noikeiôsis).\n\nSuch a social tendency is, according to what is reported of the\nopening of Chrysippus’ lost treatise On Law,\ntransformed into a political relationship by means of law: “Law\nis king of all things human and divine. Law must preside over what is\nhonourable and base, as ruler and as guide, and thus be the standard\nof right and wrong, prescribing to animals whose nature is political\nwhat they should do, and prohibiting them from what they should not\ndo” (SVF 3.314, as translated in LS 67R). Yet, in\nkeeping with some tendencies in Platonism and Cynicism, such law might\nhave to be radically different from existing laws if it is to be in\nfull conformity with nature and reason. For Chrysippus, even certain\nforms of incest are said to have been “discredited without\nreason” (SVF 3.753, as translated in LS 67F): a\ncomparison with animals would license them.\n\nPlutarch’s characterization of Zeno’s Republic as\nprescribing that “we should regard all men as our\nfellow-citizens and local residents” (SVF 1.262, as\ntranslated in LS 67A), composed around the end of the first century of\nthe Common Era, has often been read as prescribing a kind of\ncosmopolitanism that builds on Diogenes’ paradoxical Cynic\nversion of that stance. However, the reliability of this text as an\naccount of Zeno has been questioned, and just how this fellowship of\nall humans relates to the fellowship of rationally perfect sages and\nto the sharing of humans and gods in the cosmos has been debated (for\na defense and interpretation of Plutarch’s claim as applying to\nall humans, see Vogt 2008: 86–90, contra the views of Schofield\n1991 and Vander Waerdt\n 1991).[11]\n Arguably, as in the case of Aristotle, the underlying kinship by\nnature establishes a potential for a full civic membership which is to\nbe based solely on virtue, itself potentially available to all\nrational beings but realized in practice by few or perhaps even none.\nThis is one interpretation of the report that Zeno presented\n“only virtuous people in the Republic as citizens,\nfriends, relations and free” (as translated in LS 67B; this is\npreserved in Diogenes Laertius 7.32–7.33, found in SVF\n1.226 and 1.222 respectively).\n\nEspecially for the early Stoics, existing cities remained an accepted\narena both for political action in practice—Stoic sages and\nscholars advising kings and serving in offices (SVF 3.686;\ntranslated in LS 67W)—insofar as the notion of a distinctive\nindividual city remained the principal framework for defining the\nnature of politics in terms of justice. Yet the role of natural law\nalready in the early Stoics, and certainly in later ones, came to\nsupport an alternative horizon for politics on the scale of the cosmos\nas a whole (Laurand 2005). Malcolm Schofield (1991: 103) has argued\nthat this development “mediates the transition from\nrepublicanism to natural law theory,” so bequeathing a crucial\nresource to early modern thinkers who sought to construct new versions\nof the latter. Meanwhile, in the years of the Roman republic, certain\naffinities between Stoic and republican ideas proved significant, as\nwe shall now see.\n5.4 Hellenistic Philosophies and Roman Republican Politics\n\nRoman fascination with Greek philosophy was catalyzed by the Athenian\nembassy of three leading philosophers sent to Rome to plead the legal\ncase of their city in 156/155\n BCE;[12]\n it continued as late as the early sixth century CE, as seen\nespecially in the life of the eminent philosophical polymath and Roman\nsenator under barbarian rule, Boethius. Roman aristocrats were\nespecially attracted to the Stoic willingness to countenance the\nkingly and political lives alongside the scholarly one as equally\npreferable (SVF 3.686, translated in LS 67W). They began to\nstudy the Stoa seriously from the late second century BCE. The\naffinity between Stoicism and Roman republicanism was enhanced by the\nsecond-century Stoic teacher Panaetius, who seems to have argued that\nthe Roman mos maiorum or ancient ways and customs were the\nbest form of government, so burnishing philosophical principle with\nthe ancestral piety dear to the Romans. To be sure, in the later\nthroes of civil war, many Stoics would have difficulty in justifying\nassassination of tyrants, insofar as civil war would be worse than\neven a monarchy flouting the law, as one Roman adherent to the school\nwould say in rebuffing Junius Brutus’ attempt to recruit him to\nthe conspiracy to murder Caesar (Plut. Brut. 12. 3–4).\nOther Romans were strongly attracted to Epicureanism or to Cynicism,\nand some of these, however paradoxically, likewise played significant\nroles in political life. Thus the distinctive lineaments of the Roman\nrepublic, now to be described, were debated and interpreted by the\nphilosophically minded in terms of Greek political theory; conversely,\nit has been argued that Hellenistic philosophies were significant in\nshaping the ways in which Roman jurists conceived of law (Brouwer\n2021).\n6. The Roman Republic and Cicero\n\nWhile the founders of the city of Rome were said to be the legendary\ntwins Romulus and Remus, Romans would come to identify the origins of\ntheir distinctive liberty in the killing of a tyrannical king,\ngenerally dated in 509 BCE, by the ancestor of the Junius Brutus who\nwould eventually kill Julius Caesar. The position of king was replaced\nby two annually elected consuls, the royal council became the Senate,\nand popular assemblies were established to elect magistrates and pass\nthe laws they proposed. By Cicero’s time, this\nregime—self-identified as the S.P.Q.R., the “Senatus\npopulusque Romanus” or “Senate and people of\n Rome”[13]–\n had become interpreted as a version of the “mixed\nconstitution” which had had a long if complicated and until then\nrelatively minor history as an idea in the works of Thucydides, Plato,\nand Aristotle (Hahm 2009). An influential account of Rome as such a\nmixed constitution, in this case combining the three classical regime\nforms of monarchy, aristocracy, and democracy, had already been given\nby the Greek historian Polybius, who referred to the distinction\nbetween the characteristic powers in each kind of regime and their\nmutual checking and balancing (Histories 6.11–18; see\nvon Fritz 1954). Whereas in Polybius the achievement of balance\nbetween the different powers was portrayed as resulting from mutual\nrivalrous self-assertion, Cicero would refer to it in more harmonious\nlanguage, a form of balancing (compensatio, De rep.\nII. 57) with the ideas of mixing and tempering paramount, as observed\nby E.M. Atkins (2000: 491). (For a useful overview of Roman political\nthought, see J.W. Atkins 2018.)\n\nAccording to Polybius, each element of the constitution exercised a\ndistinctive form of power. The elected consuls wielded\nimperium, a form of executive command; the Senate enjoyed the\npower to deliberate and consent to specific policies; and the popular\nassemblies served as the source of authoritative law, also electing\nthe magistrates, including the popular tribunes who in turn exercised\nveto powers over the Senate. An originally republican formula relating\nthe consuls to the people as the source of authoritative law survives\nin a complete prescript of the Augustan period: “Titus Quinctius\nCrispinus [consul] lawfully asked the people, and the people lawfully\nresolved,” as translated in Lintott 1999: 3. Moreover, the\ntumultuous personal quest for office and influence led many\naristocrats and politically ambitious men to seek support among the\npeople, sometimes with radical measures of land reform which Cicero,\namong others, would resolutely oppose. The theorizing of the proper\nrole of aristocratic leadership and Senatorial independence, together\nwith Platonic analogies for the requisite concord and harmony in the\ncity, would become central themes of Cicero’s political\nphilosophy, as he wrote: “What the musicians call harmony with\nrespect to song is concord in the state, the tightest and best bond of\nsafety in every republic; and that concord can never exist without\njustice” (De rep. II.69.)\n6.1 Cicero: Life\n\nMarcus Tullius Cicero (106–43 BCE) was the most famous\n“homo novus” or new man of Roman politics, hailing from a\nminor provincial landowning family rather than the great clans of\nhereditary nobility. He rose to the office of consul and the lifetime\nSenatorial membership it subsequently conferred by his audacious wit\nas a lawyer and orator in public prosecutions. His greatest moment as\nconsul in 63 BCE came in exposing a conspiracy by Catiline; the brutal\nsuppression of the conspiracy by executing Roman citizens without\ntrial, however, would tar his political legacy. He became an enemy of\nJulius Caesar (though accepting a pardon from him at the end of a\nstretch of civil wars in 47 BCE), seeing the assertion of power first\nby Caesar and then Marc Antony as fatal to the republic. Having\ndefended in his De officiis the kind of tyrannicide that he\ntook the killing of Caesar in 44 BCE to have constituted, and attacked\nAntony mercilessly in his series of fourteen Philippics the\nfollowing year, Cicero was murdered in response by partisans of the\nthen-ruling Triumvirate to which Antony belonged.\n\nThe writings of Cicero were virtually canonized subsequent to his\ndeath as classic models of rhetoric and philosophy; as Richard Tuck\n(1990: 43) has remarked, “For fifteen hundred years, from the\nfourth century to the nineteenth, schoolchildren in Europe were\nexposed daily to two books. One was the Bible, and the other was the\nworks of Cicero.” His many speeches and letters are themselves\nof considerable political and often philosophical interest, reworking\nthe evaluative vocabulary of Roman law and politics in ways which\nsuited his overarching (and changing) political purposes (for a\ncritical assessment, see Gildenhard 2011, which concludes that\n“In his rhetoric Cicero...consistently refused to recognize the\npositions of his adversaries as genuine political positions and\nchallenged their identities as senatorial peers, Roman citizens, or\neven human beings ”(Gildenhard 2011: 390). While his\nphilosophical writings—composed for the most part as a student\nof philosophy in Rome and Athens, and then in a brief period\n(46–44 BCE) when political developments led him to retreat from\nactive public life—cover a wide range of topics, including for\nexample, among those especially relevant to politics are two works on\nthe political role of the orator and the nature of oratory or\nrhetoric, celebrating the moral purposes of the orator as essential to\nthe success of republican government.\n\nWhile Cicero adhered to a moderate skepticism in general philosophical\nmatters, he would draw on a number of Stoic ideas in formulating his\nown ethical and political teachings: these were shaped by the lectures\nhe had attended by the Stoic Posidonius in Rhodes, the writings of\nPosidonius’ teacher Panaetius and other earlier and contemporary\nStoic texts, as well as (we may speculate) conversation with the Stoic\nDiodotus whom he accommodated in his household in Rome for many years.\nIn particular, Cicero emphasized the Stoic themes of the natural\naffinity for society and the existence of natural law. At the same\ntime, Platonic themes and models were also important in his political\nwritings (for overall interpretations, Atkins 2020, Schofield 2021).\nThe discussion below is limited to the two dialogues which are\nexplicitly modeled on Plato’s Republic and\nLaws, titled by Cicero in Latin De re publica and\nDe legibus ( On the Commonwealth and On the\nLaws), together with his most important work on political ethics,\nthe De officiis (On Duties), which exercised\nparticular influence on subsequent Western moral and political\nthought.\n6.2 De re publica\n\nDe re publica was composed by Cicero between 54 and 51 BCE, a\nturbulent period of strife in Roman politics. Its dramatic setting is\nin 129 BCE during the crisis caused by Tiberius Gracchus, a consul who\nhad championed a property redistribution law for the people and whom\nmembers of the Senate had violently suppressed as a putative threat to\nRoman civil order. All of it except the “Dream of Scipio”\n(Book VI) was lost from the Middle Ages onward; it has been\nreconstructed from references and excerpts in later authors,\nsupplemented by a palimpsest of much of Books I–III discovered\nin 1819. Framed as a dialogue between Scipio Aemilianus, a hero of the\nresistance against Tiberius Gracchus and his like-minded brother, and\nseveral others of his actual contemporaries, the dialogue has a\ndiscernible structure identified by E.M. Atkins (2000: 490): Books\nI–II treat “the best condition of the res\npublica”; Books III–IV treat “justice and human\nnature”, topics common to the best city and the best citizen;\nand Books V–VI treat the “best citizen’ in\ndiscussing the statesman and in the Dream of Scipio.\n\nWhile justice was for Cicero, as for the Greeks, the fundamental bond\nof the commonwealth, he offered distinctive and influential linked\ndefinitions of the res publica (”commonwealth“,\nor more literally the ”public thing“) as the res\npopuli, the ”property/thing of the people“, and of a\npopulus or ”people“ in turn as ”an\nassemblage associated with one another by agreement on\n“law” [iuris consensu] and community of interest\n[utilitatis communione]“ (both, I.39). This could be\ninterpreted either as a strong normative claim—the people agree\non ”law“ [ius], also translatable as right or\njustice, and share a common interest—or alternatively in a\nweaker deflationary manner, the people nominally accepting a common\nlaw and sharing a common conception of their self-interest which may\nor may not be in accord with\n justice.[14]\n Such ambiguity would be famously exploited by Augustine, who used\nCicero’s definition to argue that lacking justice, conflicted\nand divided republican Rome had been no commonwealth, before offering\nhis own even weaker definition of a ”people“ as those\nunited in (any) common love (City of God, II.21). In\nCicero’s own hands, the definitions were used to stress that the\ncommonwealth was the property of the people, who entrusted it to the\nmagistrates to be used for the common good (I.51–2), and that\nthe ”welfare of the people is the supreme law“\n(”salus populi suprema lex“, De leg. III.8; this\nwas a reference to a maxim in the ancient ”Twelve Tables“\ncompendium of Roman law). It followed too that just as Plato denied\nthe title of a (single unified) regime to the imperfect regimes torn\nby civil discord, so Cicero inferred that a corrupt regime was not\nstrictly speaking a res publica at all (III.43–48). The\nrole of the statesman (rector rei publicae) is to aim at the\nhappiness of the citizens, defined in a laxer way than most Greek\nphilosophers would allow, as wealth, true glory, and virtue all\ncombined.\n\nThe character Scipio adheres to Greek philosophical principles in\ndeclaring that ”the commonwealth cannot possibly function\nwithout justice“ (II.70), adhering to the standard abstract\ndefinition in an Aristotelian vein of justice as ”giving each\ntheir due“ (ius suum cuique tribuere). In Book III, two\nother dialogue participants present respectively the famous arguments\ngiven on one day for justice, and on the next day against justice, by\nthe skeptical Greek philosopher and ambassador to Rome Carneades\nduring the embassy in 156/155 BCE mentioned above. Cicero’s\npresentation reverses the order, no doubt to give justice the last\nword.\n\nIn Cicero’s hands, Carneades’ case against justice avails\nitself of the nomos/phusis contrast and of the kind of\nambition for power expressed by Plato’s character Callicles in\nthe Gorgias. Justice is not natural, as it differs radically\namong different peoples; it conflicts with wisdom, which tells us\n”to rule over as many people as possible, to enjoy pleasures, to\nbe powerful, to rule, to be a lord“ (III.24b), and it is fatal\nfor states and empires, which can’t survive without injustice.\nIn reply, the speech for justice avails itself of Stoic themes:\n”true law is right reason, consonant with nature“; there\nis ”one eternal and unchangeable law“ [i.e. what has come\nto be known as ”natural law“] (III.33). This includes rule\nof the best over the weakest for the benefit of the latter (III.36):\nas in Plato’s Republic, the justice of rulership is not\nexploitation but paternalistic benefit. And as in Plato’s\nRepublic Book X, where the myth of Er supplies a revisionary\nreligious justification for justice (it will help you to choose your\nnext reincarnation well), so Cicero’s Republic\nconcludes with a dream recounted by Scipio Aemilianus about his even\nmore eminent Roman ancestor, Scipio Africanus. The dream describes the\ndivine order which not only rewards humans for just service to their\ncity (VI.13), but also puts human affairs in a cosmic perspective\ndesigned to embolden them to care more for justice than for petty\nhuman advantage:\n\nyou must always look at these heavenly bodies and scorn what is human.\nWhat fame can you achieve in what men say, or what glory can you\nachieve that is worth seeking?” (VI.20)\n\nIn a dramatic rejection even of the traditional Roman motives of honor\nand glory as conventional motivations to virtue, the imagined elder\nstatesman asks: “…and even the people who talk about\nus—how long will they do that?” (VI.21). As Jed W. Atkins\nhas observed (2013:76), glory is in the Dream “first devalued,\nand then revalued”, in a Platonically inspired image of\n“the glory of the heavenly realm to which good statesmen will\nreturn” (2013: 77–78).\n6.3 De legibus\n\nDe legibus, or On the Laws, is also written as a\ndialogue, but one set in Cicero’s own day with himself, his\nbrother, and closest friend as the interlocutors, gathered at his\ncountry estate of Arpinum. Probably begun after De re\npublica, it was likewise written in the years immediately before\n51 BCE, and similarly survives only in piecemeal and fragmentary form.\nBooks I–II treat natural law or ius naturae, with\n“Marcus” (Cicero himself) declaring that “law is the\nhighest reason, rooted in nature” (I.18), and that men, bound to\nthe gods by reason, are “born for justice”\n(I.28–32). However, “the corruption of bad\nhabits…extinguishes…the sparks given by nature”\n(I.33) and can result in the formation of bad laws. Such iniquitous\nlaws as those passed by tyrants are not just (I.42); nor is the title\nof law to be conferred upon “what bandits have agreed among\nthemselves” (II.13).\n\nIn Books II–III, the speakers prescribe an ideal law code, based\non but modifying Roman law; notably, for example, the institution of\nthe tribunate is defended (III.16–17). As these prescriptions,\nand the circumstances of their writing (a temporary retreat from\nactive politics), suggest, Cicero had a complex attitude to the Greek\ndilemma posing the lives of philosophy and of politics as opposed\nalternatives. He saw philosophy as a source of insight and perspective\nrelevant to politics, but after his early studies, devoted himself to\nit primarily when temporarily debarred from more active pursuits. One\nmight say that philosophy became, beyond its intrinsic value, a form\nof alternative public service when the forum was too dangerous for him\nto enter (here following the reflection along these lines offered by\nBaraz 2012).\n6.4 De Officiis\n\n“The De officiis, not the De re publica, is\nCicero’s Republic” (Long 1995: 240). This dictum\nof A. A. Long holds true not only in the sense that for Cicero, as for\nPlato and Aristotle, ethics was inseparable from politics. It is true\nalso and more profoundly insofar as the De officiis takes up\nthe same subject as Plato’s Republic, namely the\napparent conflict between justice and individual advantage, and\nproposes broadly the same resolution, namely that the conflict is only\never apparent: violating one’s officia or duties can\nnever serve one’s advantage so long as both are properly\nunderstood. Book I treats what is virtuous, or honestas; Book\nII treats what is advantageous, or utilitas; and Book III\nconsiders cases to show that any apparent conflict is illusory.\n\nThe most difficult case to resolve according to the overall argument\nof the book is that of advantage when understood as political\nambition, driven by greatness of spirit. As Cicero acknowledges, and\nas was especially true in the highest echelons of Roman society,\n“Men are led most of all to being overwhelmed by forgetfulness\nof justice when they slip into desiring positions of command or honour\nor glory” (I.26). The solution is to aim only at true glory,\nsuch as can be gained only through the fulfillment of one’s\nofficia. Similar casuistry enables Cicero to resolve in\naccordance with his thesis a range of common cases where advantage\nmight be sought at the expense of justice (in administering the estate\nof an orphan, for example, a common duty of eminent Romans). Yet such\ncasuistry is always advanced within a context of celebration of\njustice and natural law: it is not simply that in fact justice never\nconflicts with advantage, but that justice properly understood is\nalways to one’s advantage as a human being.\n\nAs in Plato, a redefinition of the virtues plays a crucial role in the\noverall argument for the benefits of justice. For Cicero, the virtues\nare Romanized as officia, understood not only as duties in\nthe abstract but rather as obligations of role or relationship, each\nattaching to someone in virtue of a distinct persona (whether\nas father, consul, neighbor, and so on, or simply as a human being).\nSome virtues are rooted in one’s persona as a human\nbeing subject to natural law, others in the specific roles and customs\nof one’s city. Four principal virtues are identified: wisdom;\njustice, resting on fides (good faith and credit) and respect\nfor property; greatness of spirit; and decorum. Respect for property\nis a keystone of Cicero’s political thought, here very far from\nthe current in Platonism which subordinated property to civic\nharmony.\n\nStrikingly, whereas tyrannicide might appear to be a difficult case\nfor such an ethical code to confront, Cicero presents it—writing \nlater in the year that Caesar was assassinated—as the\nstraightforwardly ethically correct choice. Cicero couches his case in\nStoic terms of naturalness and fellowship (Dyck 1996, ad loc.\nto Off.III.29–32). His pivotal move is to deny that\ntyrants are party to the otherwise universal nature of human\nfellowship. Thus he asserts that “there can be no fellowship\nbetween us and tyrants…just as some limbs are amputated if they\nare…harming other parts of the body, similarly if the wildness\nand monstrousness of a beast appears in human form, it must be removed\nfrom the common humanity…of the body”\n(Off.III.32: ostensibly about the tyrant Phalaris).\n7. Political Philosophy in the Roman Empire\n\nAlthough Rome ruled over an empire long before Cicero died, and the\nrepublican constitution that he had served would remain formally\nintact in many respects long after that date as well, the imperial era\nof Roman government is standardly associated with the elevation of\nOctavian by the Senate in 27 BCE by according him the title of\n“Augustus” (among other novel titles and combinations of\noffices that he was then and later accorded). Octavian and a number of\nhis successors were also referred to as the princeps,\nliterally the first man, implicitly the first among nominal equals,\nsometimes translated by the English derivation ‘prince’,\nand so giving rise to the description of the period from 27\nBCE–284 CE as the Principate (to be followed in turn by the\nDominate). In this period, Stoicism continued to exercise an important\nhold, drawing in part on the Hellenistic genre of advice to kings;\nPlatonism too, and forms of Pythagoreanism, regained much sway.\nMoreover, a number of Stoic-minded writers and orators played their\nparts in Roman political life, some fashioning the life of a\nphilosopher itself into a distinctive form of what might be called\nnon-political politics (Trapp 2007). In this article, I cannot explore\nthe full ramifications of these philosophical developments under the\nEmpire, in writers in Greek as well as in Latin, and influencing not\nonly pagan but also Jewish and Christian thinkers. The article also\nleaves aside the many and varied important contributions to political\nthought in Rome and its possessions made not by philosophers but by\nhistorians, including Livy, Sallust, Diodorus Siculus, Tacitus, and\nSuetonius. (Again, for an overview that seeks to integrate political\nand historical developments with political theorizing, see J.W. Atkins\n2018.)\n7.1 Later Stoicism\n\nIf Cicero as a new man made senator had to contend with the\ncompetitive pressures of republican politics, Seneca (c. 3\nBCE–65 CE), as a new man (from Spain) made senator a century\nlater, had to contend with the problem of advising, and surviving, the\npoisonous politics of intimacy with the princeps. For Seneca,\nStoic philosophy (of which he was an avowed exponent, though other\nphilosophical influences can also be found in his ideas), can be best\nsquared with politics if the ruler is supremely virtuous: in that\ncase, the Stoic wise man is the king or prince.\n\nLike Cicero, Seneca wrote essays in natural as well as political\nphilosophy, including for example a significant analysis of the give\nand take of benefits or reciprocal gifts and favors in political life\n(De beneficiis, recently translated afresh by Griffin and\nInwood, 2011), and even a De officiis (which is lost). Like\nCicero, he wrote important collections of letters (and where Cicero\nwrote poetry, Seneca also wrote plays). The letters include his\ndistinctive “consolations” which would inaugurate a new\nphilosophical and literary genre (see the entry on\n Seneca).\n\nIn this large corpus, arguably his most important surviving work for\npolitical philosophy is his De clementia (“On\nMercy”), addressed to the emperor Nero whom he served as tutor\n(in rhetoric, not in philosophy) and later in the capacity of\nofficially designated amicus or friend (Veyne 2003, vii, 19).\nPresented as a “mirror” in which Nero could see himself\nand the consequences of his virtue (1.1.1), this text would become a\nfountainhead of the “mirror for princes” genre in\nsubsequent centuries. The challenge was how to reconcile the virtue of\njustice with that of clementia, clemency or mercy, a\ndistinctively Roman virtue (not corresponding exactly to any Greek\nword: Braund 2009, 33) that had been incorporated into public life as\na virtue of the Roman people (clementia populi Romani) and\nattributed specifically in cultic form to Caesar Augustus (previously\nOctavian) as clementia Caesaris (included as one of\n“the four virtues attributed to Augustus on an honorific\nshield,” as observed by Griffin 2000: 540; see more generally\nFlamerie de Lachapelle 2011). Appealing to the related Stoic virtue of\nphilanthrôpia in Greek, humanitas in Latin, or\nlove of humankind, Seneca claimed that, by taking into account all the\ncircumstances of the affair, clemency can claim to embody, as it were,\na more perfect justice (iustissimum), than would the\nobservance of the strict letter of the law (2.7.3, as discussed by\nBraund 2009, 66–70).\n\nSeneca manages to defend clemency’s claim to the rank of virtue\nby distinguishing it both from its opposite, crudelitas or\ncruelty, and from a related disposition, misericordia, pity\nor compassion, which for the Stoics counted as a vice (2.4.4). The\nStoic sage will exercise clemency by attending to the circumstances\nand causes of the criminal’s act, but also by seeking in various\nways to improve the latter’s character (1.14.1–3,\n1.16.1–3), an approach that goes back at least to Plato\n(Prt. 324a–c, Grg.469a–b), doing so with\nparsimony and discernment between those who are curable and those who\nare not (again with Plato, Grg.525a–526b). Indeed,\nSeneca asserts that those who are curable will generally strive\nsubsequently to become worthy of the clemency shown to them by the\nprince (2.2.1), a principle illustrated by the story of\nAugustus’ clemency toward the conspirator Cnaeus Cornelius\nCinna, who would become his lifelong friend (1.9). In good Stoic\nfashion, Seneca finally shows that the virtue of clemency is both\nvaluable in itself and also beneficial. It sustains the rule of a\nprince by inspiring love in his subjects (1.19.6), whereas cruelty\naugments the number of his enemies (1.8.7). And conversely, whereas\nmisericordia wallows in a wrongful and inefficient emotional\npity for the treatment that justice would prescribe of the criminal\n(2.6.1), clemency improves the criminal more efficiently than cruelty\nwould do (1.22.1), and for this and other reasons better aims at the\ngood of mankind. It is worth noting finally that, while Seneca\nspecifies that clemency should also extend to slaves, his\ncosmopolitanism stopped short of advocating their manumission or the\nabolition of slavery (Griffin 1992:\n 256–85).[15]\n\nSeneca did not limit himself to the political function of advising\nrulers. Instead, he conceived the role of philosophy as benefiting\npeople generally, in the widest sense of a cosmopolitan ethics and\neven politics. His De otio (“On Leisure”)\ncontrasts the single commonwealth embracing gods and men in a cosmic\ncitizenship, with the ordinary multiple commonwealths to which the\naccidents of birth assign us (though these also rightly command\nallegiance) (4.1). Should such an ordinary regime turn lethal, the\nphilosopher remains a citizen of the cosmic commonwealth, and so his\nserenity can and should remain intact. That fate befell Seneca himself\nin 65 CE, when Nero accused him of conspiring in a planned\nassassination of the emperor and ordered him to commit suicide. To be\nsure, however, Seneca’s suicide reflected not only political\nobedience, but also, and perhaps more fundamentally, the belief,\npreviously expressed in his writings (in particular De\nprovidentia and De ira, as well as his letters) that\nsuicide is a supreme mark of freedom. No tyranny can so enslave us as\nto take away this freedom: a freedom to act based on the inner\nliberation of realizing that death and other worldly losses are in\nfact indifferent and irrelevant to happiness (Inwood 2005:\n307–9).\n\nSeneca was far from the only Stoic politically active in his day or in\nsuccessive generations. Others like Thrasea Paetus and Barea Soranus\nunder Nero, Helvidius Priscus under Vespasian, and Paconius Agrippinus\nunder Tiberius, chose to defy those whom they saw as tyrannical\nrulers, becoming known as the so-called ‘Stoic martyrs’.\n(On the varieties of Stoicism under the principate, see the classic\nstudy of Brunt 2013, originally published in 1975.) Some Stoics spoke\nout against a wider range of customs that they took to be cruel or\nunfounded or otherwise irrational, most notably Musonius Rufus against\nsuch practices as the Athenians’ holding of gladiatorial games\nin the same theatre of Dionysus where they celebrated religious\nfestivals (assuming that it is indeed he who is described in Dio\nChrysostom’s Orationes XXXI, 122), and against the\nsocial convention of excluding women from philosophizing (for his\nfragments, see King 2011). Yet these later Stoics made rather few\ndetailed contributions to political philosophy, even if their\nfundamental analysis of living according to nature and reason, as\nfurther developed by figures ranging from the once-enslaved Epictetus\nto the emperor Marcus Aurelius, remained an important touchstone for\nthinking about politics.\n7.2 Platonisms and Other Philosophies in the Empire\n\nWhile the men of affairs in the Roman Senate and imperial court turned\noften (though not exclusively) to Stoicism, in the Greek centers of\nphilosophy and among provincial Greek men of affairs Platonism\nremained an important framework for thinking about both ethics and\npolitics, as did a related if somewhat shadowy form of\n Pythagoreanism\n which can be seen as a continuation of the genre of Hellenistic\nkingship treatises (Centrone 2000). The most important contributions\nmade to political thought by the Platonist philosopher of the\nsecond-century AD, Plutarch (c.46–c.120 CE), are his paired\nbiographical lives of Greek and Roman statesmen, each with a\ncomparison drawing political morals. Together with the histories of\nThucydides, Livy and Sallust, these Lives instructed\ngenerations of students in the principles and perils of political\nethics, and instituted the distinction between statesman and demagogue\nas we have come to know it today: with figures like the fifth-century\nBCE Athenian “Aristides the Just” embodying the ideal\nstatesmen, in contrast to the Platonic view of all past and present\nstatesmen as fatally flawed. Plutarch also made important\ncontributions to political philosophy in the many essays collected in\nhis volumes of Moralia.\n\nPlutarch was a committed but in some ways revisionist Platonist. His\nattitude to public life was more Roman than Platonic (befitting the\nrole in public affairs that he played in his own city): the political\nlife was for him unproblematically noble, not inferior to the life of\nphilosophy. Similarly, he revised the strict Platonic dictum that\nphilosophers must rule by allowing that philosophers might rule merely\nin the sense of advising rulers, not of being rulers themselves. (In\nfact, this move had some Platonic pedigree in the\nStatesman’s insistence that the science of statecraft\nis the same whether known and exercised by an advisor or by an actual\nruler (259a).) And he considered philosophy to be more of a\ncharacter-building study than a source of knowledge of exact or\npolitically relevant knowledge. Where statesmen were educated in\nphilosophy, as for example in the Lives of Pericles, Cicero,\nBrutus, and Cato Minor, he treats this as valuable mainly because of\nthe virtue—in particular, moderation and\nself-restraint—which it imparts to them (Van Raalte 2005). The\nstudy of philosophy serves as a sort of inoculation against greed and\nimmoderate ambition. But it need not impart any particular substantive\nknowledge to the statesman (so competing philosophies could all be\nuseful in shaping virtue: Anaxagaorean influence on Pericles, an\neclectic mixture of Stoicism, Academic skepticism, and Platonism on\nCicero; Stoicism on the younger Cato). Indeed, excessively rigid\nadherence to a philosophy could be deleterious, making a statesman\nrigid and inflexible. The younger Cato was defeated when he stood for\nthe consulship because, Plutarch says, he experienced the same thing\nthat happens to fruits that appear “out of season”\n(Phoc. 3.1). Like such fruits, he was admired, but “the\nweight and grandeur” of his virtue was “out of all\nproportion to the immediate times” (asummetron tois\nkathestōsi kairois, Phoc. 3.2–3).\n\nPlutarch’s political sympathies lay with monarchy. He treated\nthe exemplary Greek or Roman statesman as inherently and ideally a\nkind of monarchical figure, even when functioning within a democratic\nor republican environment. “Aristocratic and kingly” was\nhis praise for Pericles’ type of true statesmanship (literally,\nhis “politics” or “policy”,\npoliteia), once he has given up his initial recourse to\ndemagogic methods (Per.14.2). Thus for all his admiration for\nGreek statesmen of the classical age, and his profound later influence\non republican sentiments in Europe, Plutarch preferred monarchy as the\nbest constitution and believed that he was following his master Plato\nin so doing. As John Dillon puts it, he held “that the\naccomplished statesman, like a first-rate musician, will be able to\nmake the best of any of the three basic constitutions [monarchy,\naristocracy, or democracy] that he is given to work on” (Dillon\n1997). To quote Plutarch himself on this point from his fragmentary\nwriting “On Monarchy, Democracy, and Oligarchy”:\n\n…if he [the statesman] is given the choice among governments,\nlike so many tools, he would follow Plato’s advice and choose no\nother than monarchy, the only one which is able to sustain that top\nnote of virtue, high in the highest sense, and never let it be tuned\ndown under compulsion or expediency. For the other forms of government\nin a certain sense, although controlled by the statesman, control him,\nand although carried along by him, carry him along, since he has no\nfirmly established strength to oppose those from whom his strength is\nderived…. (Peri mon. 827bc)\n\n\nPlato’s collective virtuous aristocracy in the Republic\n(his philosopher-kings and -queens, in the plural), was transmuted by\nPlutarch, perhaps under the influence of the singular kingly political\nexpert in the Statesman, into a monarchical\n ideal.[16]\n\nLater Platonic philosophers, known as Neoplatonists (see the entry on\n Plotinus),\n also focused primarily on ethics in the context of cosmology and\ntheology, stressing the ascent of the soul to a disembodied pure\nunderstanding of the One. Yet they made room for the political virtues\nof the embodied soul as a first step in this process of divinization\nor “becoming like God” (O’Meara 2003). In working\nout the political implications of such views, Plato’s\nLaws became an important model for theocratic political\nreform, especially as Neoplatonism became influential for a certain\nstrand of Christian thinkers, in particular those able to absorb the\ntranslation of Greek texts into Arabic.\n8. Conclusion\n\nOn a continuum of political rule stretching from the sheer domination\nof some over others on one extreme, to a vision of collaborative\ndeliberation among equals for the sake of the good life on the other,\nmany ancient Greek and Roman political philosophers clearly staked out\nthe latter ground. The very idea of the city and the civic bond as\nrooted in justice was common ground across much of the spectrum of\nancient political philosophy. Even the Epicureans saw society as\nrooted in justice, although understanding justice in turn as rooted in\n utility.[17]\n Philosophers adhering to this approach were not however ignorant of\npossible objections to it. The diagnosis of politics as domination has\nnever been more powerfully advanced than by Plato’s character\nThrasymachus, nor has the attack on justice as a good life for the\nindividual ever been as powerfully made as by Plato’s character\nCallicles or the skeptic Carneades. The nostalgic view of ancient\npolitical philosophy as predicated on widely shared conceptions of\nhuman nature and the human good, before the splintering and fracturing\nof modernity, is an oversimplification.\n\nIt is true that those ancient visions of politics which rooted\nthemselves in a commitment to ethical cultivation and the common good\ndid not have to contend with the absolutist claims of rival versions\nof monotheistic religions. But the ancients did have to answer various\nforms of relativism, immoralism, and skepticism, contending with rival\nphilosophical schools which disagreed profoundly with one another. If\nsome of them chose to see politics as a domain of common benefit and a\nspace for the cultivation of virtue, this was not because it had not\noccurred to them that it could be thought of otherwise, but in part\nbecause they had developed powerful philosophical systems to support\nthis view. The experience and practices of the Greek poleis\n(the plural of polis) and the Roman res publica\nplayed important roles in shaping these approaches.\n\nPlato and Aristotle can in many ways be seen as defending some\nfundamental tenets of Greek ethics (such as the value of justice), but\ndoing so by means of advancing revisionist philosophical doctrines and\ndistancing themselves from the ways in which those tenets were\ninterpreted by the democratic institutions of their day. The range of\nethical and political views which they, along with their Hellenistic\nsuccessors, laid out, continue to define many of the fundamental\nchoices for modern philosophy, despite the many important innovations\nin institutional form and intellectual approach which have been made\nsince. Many of those innovations, indeed, came in response to a\nrevival of the ancient skeptical and relativist challenges: challenges\nalready known from their evolution within ancient political philosophy\nitself.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriLit\">Primary Literature</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriLit\">Primary Literature</a>": [
                "</h3>\n<p>\nThe Oxford Classical Text series has been used for citation of most\nclassical texts. Other editions of reference for many texts include\nthe series published respectively by Teubner in Germany and by\nBudé in France. Abbreviations are used for the following texts\nand translations: DK (for the Presocratics): Diels, H., and W. Kranz\n(eds.), 1951–2, <em>Die Fragmente der Vorsokratiker, griechisch\nund deutsch</em>, 6th edn, 3 vols., Berlin: Weidmann. SVF (for the\nStoics): von Arnim, Hans von, 1903–21, <em>Stoicorum Veterum\nFragmenta</em>, 4 vols., Leipzig: B.G. Teubner. LS (for translations\nof the Stoics): Long, A. A., and D. N. Sedley (eds.), 1987, <em>The\nHellenistic Philosophers</em>, 2 vols. Cambridge: Cambridge University\nPress [Greek and Latin texts in vol.2], which is abbreviated LS in the\nbody of this entry. Quotations from Plato are from the translations\nincluded in Cooper, John (ed.), <em>Plato. Complete Works</em>\n(Indianapolis: Hackett, 1993) (occasionally modified); quotations from\nAristotle are from Barnes, Jonathan (ed.) <em>The Complete Works of\nAristotle</em>, vol. 2 (Princeton: Princeton University Press, 1984)\n[this is known as the Revised Oxford Translation, consisting of\nBarnes’ revision of a complete series of translations published\noriginally by the Oxford University Press between 1912 and 1954]\n(occasionally modified). </p>\n<h4>Translations used</h4>\n<p>\nThe list below is arranged roughly chronologically in relation to the\nGreek or Latin texts that are translated in each case. In addition to\nthose listed below, the Loeb Classical Library has been used herein\nfor the English translations of Plutarch’s <em>Lives</em> (in\neleven volumes, all translated by Bernadotte Perrin) and\n<em>Moralia</em> (in sixteen volumes, by various translators).</p>\n<ul class=\"hanging\">",
                "Gagarin, M. and P. Woodruff, (eds.), 1995, <em>Early Greek\nPolitical Thought from Homer to the Sophists</em>, Cambridge:\nCambridge University Press.",
                "Taylor, C.C.W. (ed.), 1999, <em>The Atomists: Leucippus and\nDemocritus, Fragments</em>, Toronto: University of Toronto Press.",
                "Cooper, J. M., (ed.), 1997, with D.S. Hutchinson (assoc.ed.),\n<em>Plato: Complete Works</em>, Indianapolis: Hackett.",
                "Reeve, C.D.C. (tr.), 1998, <em>Aristotle Politics</em>,\nIndianapolis and Cambridge: Hackett.",
                "Barnes, J., (ed.), 1984, <em>The Complete Works of Aristotle</em>,\n2 vols., Princeton: Princeton University Press.",
                "Everson, S., (ed.), 1996, <em>Aristotle</em>, <em>The Politics and\nThe Constitution of Athens</em>, Cambridge: Cambridge University Press\n[uses translations from Barnes (ed.) 1984].",
                "Long, A. A., and D. N. Sedley, (eds.), 1987, <em>The Hellenistic\nPhilosophers</em>, 2 vols., Cambridge: Cambridge University Press\n[translations and commentary, volume 1].",
                "Griffin, M.T., and E.M. Atkins, (eds.), 1991, Cicero, <em>On\nDuties</em>, Cambridge: Cambridge University Press.",
                "Zetzel, J.E.G., (ed.), 1999, <em>Cicero</em>, <em>On the\nCommonwealth and On the Laws</em>, Cambridge: Cambridge University\nPress.",
                "Inwood, B., (ed.), 2007, <em>Seneca: Selected Philosophical\nLetters translated with introduction and commentary</em>, Oxford:\nOxford University Press.",
                "Cooper, J. M., and J.F. Procopé, 1995, <em>Seneca: Moral\nand Political Essays</em>, Cambridge: Cambridge University Press.",
                "Braund, S.M. (ed.), 2009, <em>Seneca: De Clementia</em>, Oxford:\nOxford University Press.",
                "Griffin, M., and B. Inwood (eds.), 2011, <em>Seneca: On\nBenefits</em>, Chicago and London: University of Chicago Press.",
                "King, C. (trans.), with W.B. Irvine (ed. and intro.), 2011,\n<em>Musonius Rufus: Lectures and Sayings</em>, revised edition,\nCreateSpace Publishing.",
                "Dobbin, R.F., (ed.) 2008, <em>Epictetus: Discourses and Selected\nWritings</em>, London: Penguin.",
                "Farqharson, A.S.L., (ed.), 2008, <em>The Meditations of Marcus\nAurelius</em> <em>Antoninus</em>, Oxford: Oxford University\nPress.\n</ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Alberti, A., 1995, “The Epicurean theory of law and\njustice,” in Laks and Schofield 1995 (eds.),\npp.191–212.",
                "Annas, J., 1993, <em>The Morality of Happiness</em>, New York and\nOxford: Oxford University Press.",
                "–––, 1999, <em>Platonic Ethics Old and New</em>,\nIthaca, NY: Cornell University Press.",
                "–––, 2017, <em>Virtue and Law in Plato and\nBeyond</em>, Oxford: Oxford University Press.",
                "Aoiz, J. and M. D. Boeri, 2022, “The Genealogy of Justice\nand Law in Epicureanism,” <em>Ancient Philosophy</em>, 42:\n251–71.",
                "Arendt, H., 1958, <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.",
                "Atkins, E.M., 1990, “‘Domina et regina\nvirtutum’: justice and <em>societas</em> in <em>De\nOfficiis</em>,” <em>Phronesis</em>, 35: 258–89.",
                "–––, 2000, “Cicero,” in Rowe and\nSchofield 2000, pp. 477–516.",
                "Atkins, J.W., 2013, <em>Cicero on Politics and the Limits of\nReason</em>, Cambridge: Cambridge University Press.",
                "–––, 2018, <em>Roman Political Thought</em>,\nCambridge: Cambridge University Press.",
                "–––, 2020, <em>Cicero on Politics and the Limits\nof Reason: The</em> Republic <em>and</em> Laws, Cambridge: Cambridge\nUniversity Press.",
                "Baraz, Y., 2012, <em>A Written Republic: Cicero’s\nPhilosophical Politics</em>, Princeton: Princeton University\nPress.",
                "Bartels, M.L., 2017, <em>Plato’s Pragmatic Project: a\nreading of Plato’s Laws</em>, Stuttgart: Franz Steiner\nVerlag.",
                "Bobonich, C., 2002, <em>Plato’s Utopia Recast: his later\nethics and politics</em>, Oxford: Oxford University Press.",
                "–––, 2015, “Aristotle, political decision\nmaking, and the many,” in <em>Aristotle’s Politics: a\ncritical guide</em>, T. Lockwood and T. Samaras (eds.), Cambridge:\nCambridge University Press, pp. 142–62.",
                "Bodéüs, R., 1993, <em>The Political Dimensions of\nAristotle’s</em> Ethics, trans. J.E. Garrett, Albany: State\nUniversity of New York Press.",
                "Bouchard, E., 2011, “Analogies du pouvoir partagé:\nremarques sur Aristote <em>Politique</em> III.11,”\n<em>Phronesis</em>, 56: 162–179.",
                "Brouwer, R., 2021, <em>Law and Philosophy in the Late Roman\nRepublic</em>, Cambridge: Cambridge University Press.",
                "Brunt, P.A., 2013 [1975], “Stoicism and the\nPrincipate,” in P. Brunt, <em>Studies in Stoicism</em>, eds.\nM.T. Griffin and A. Samuels, Oxford: Oxford University Press, pp.\n275–309.",
                "Burnyeat, M., 2013, “Justice writ large and small in\n<em>Republic</em> 4,” in <em>Politeia in Greek and Roman\nPhilosophy</em>, V. Harte and M. Lane (eds.), Cambridge: Cambridge\nUniversity Press, pp. 212–230.",
                "Cammack, D., 2013, “Aristotle on the Virtue of the\nMultitude” <em>Political Theory</em>, 41: 175–202.",
                "Campbell, G., 2003, <em>Lucretius on Creation and Evolution: a\ncommentary on De Rerum Natura 5.772–1104</em>, Oxford: Oxford\nUniversity Press.",
                "Cartledge, P., 2009, <em>Ancient Greek Political Thought in\nPractice</em>, Cambridge: Cambridge University Press.",
                "Carawan, E., 2013, <em>The Athenian Amnesty and Reconstructing the\nLaw</em>, Oxford: Oxford University Press.",
                "Centrone, B., 2000, “Platonism and Pythagoreanism in the\nearly empire,” in Rowe and Schofield (eds.), pp.\n559–584.",
                "De Blois, L., J. Bons, T. Kessels and D.M. Schenkeveld (eds.),\n2005, <em>The Statesman in Plutarch’s Greek and Roman Lives</em>\n(vol.2 of <em>The Statesman in Plutarch’s Works</em>), Leiden\nand Boston: Brill.",
                "Dillon, J., 1997, “Plutarch and the end of history,”\nin Mossman 1997, pp. 233–240.",
                "Duke, G., 2020, “Law as Rational Constraint: <em>Nicomachean\nEthics</em> x 9,” <em>Ancient Philosophy</em>, 40, 369–387.",
                "Duvall, T., and P. Dotson, 1998, “Political Participation\nand <em>Eudaimonia</em> in Aristotle’s <em>Politics</em>”\n<em>History of Political Thought</em>, 29: 21–34.",
                "Dyck, A.R., 1996, <em>A Commentary on Cicero, De Officiis</em>,\nAnn Arbor: University of Michigan Press.",
                "El Murr, D., 2014, <em>Savoir et gouverner: essai sur la science\npolitique platonicienne</em>, Paris: J. Vrin.",
                "Frank, J., 2005, <em>A Democracy of Distinction: Aristotle and the\nwork of politics</em>, Chicago: University of Chicago Press.",
                "von Fritz, K., 1954, <em>The Theory of the Mixed Constitution in\nAntiquity: a critical analysis of Polybius’ political\nideas</em>, New York: Columbia University Press.",
                "Fowler, D., 1989, “Lucretius and Politics,” in\n<em>Philosophia Togata</em>, J. Barnes and M. Griffin (eds.), Oxford:\nOxford University Press, pp. 120–150.",
                "–––, 2007, “Lucretius and Politics,”\nin <em>Lucretius</em>, M.R. Gale (ed.), Oxford: Oxford University\nPress, pp. 397–431.",
                "Garnsey, P., 1996, <em>Ideas of Slavery from Aristotle to\nAugustine</em>, Cambridge: Cambridge University Press.",
                "Garver, E., 2011, <em>Aristotle’s Politics: living well and\nliving together</em>, Chicago: University of Chicago Press.",
                "Geuss, R., 2005, “Thucydides, Nietzsche, and\nWilliams,” in his <em>Outside Ethics</em>, Princeton: Princeton\nUniversity Press, pp. 219–233.",
                "Giannantoni, G., (ed.), 1990, <em>Socratis et Socraticorum\nReliquiae</em>, 4 volumes, Naples: Bibliopolis.",
                "Gildenhard, I., 2011<em>Creative Eloquence: the construction of\nreality in Cicero’s speeches</em>, Oxford: Oxford University\nPress.",
                "Griffin, M.T., 1992, <em>Seneca: a philosopher in politics</em>,\n2<sup>nd</sup> edn, Oxford: Clarendon.",
                "–––, 2000, “Seneca and Pliny,” in\nRowe and Schofield 2000, pp. 532–558.",
                "Hahm, D.E., 2000, “Kings and constitutions: Hellenistic\ntheories,” in Rowe and Schofield 2000, pp. 457–76.",
                "–––, 2009, “The Mixed Constitution in\nGreek Thought,” in <em>A Companion to Greek and Roman Political\nThought</em>, R.K. Balot (ed.), Chichester: Wiley-Blackwell, pp.\n178–98.",
                "Harte, V., 1999, “Conflicting Values in Plato’s\n<em>Crito</em>,” <em>Archiv für Geschichte der\nPhilosophie</em> 81: 117–147; reprinted in Kamtekar 2005, pp.\n229–59.",
                "Hatzistavrou, A., 2021, “Aristotle on the Authority of the\nMany: <em>Politics</em> III.11 1281a40-b21,” <em>Apeiron</em>,\n54: 203–232.",
                "Höffe, O. (ed.), 1997, <em>Platon: Politeia</em>, Berlin:\nAkademie Verlag.",
                "Hu, X., 2020, “The City as a Living Organism,”\n<em>History of Political Thought</em>, 41: 517–537.",
                "Huxley, G.L., 1980, “Aristotle, Las Casas, and the American\nIndians,” <em>Proceedings of the Royal Irish Academy: Archaeology,\nCulture, History, Literature</em>, 80C: 57–68.",
                "Inwood, B., 2005, <em>Reading Seneca: Stoic philosophy at\nRome</em>, Oxford: Clarendon Press.",
                "Irwin, T., 1990, “The Good of Political Activity” in\n<em>Aristoteles’ Politik: Akten des IX Symposium Aristotelicum,\nFriedrichshafen/Bodensee, 25.8–3.9.1987</em>, G. Patzig (ed.),\nGöttingen: Vandenhoeck &amp; Ruprecht, pp. 73–98.",
                "Karbowski, J., 2012, “Slaves, Women, and Aristotle’s Natural\nTeleology,” <em>Ancient Philosophy</em>, 32: 323–350.",
                "Kamtekar, R., (ed.), 2005, <em>Plato’s Euthyphro, Apology\nand Crito: Critical Essays</em>, Lanham, MD: Rowman &amp;\nLittlefield.",
                "Kempshall, M.S., 2001, “<em>De Re Publica</em> I.39 in\nMedieval and Renaissance Political Thought,” in Powell and North\n(eds.), pp. 99–135.",
                "Klosko, G., 2006, <em>The Development of Plato’s Political\nTheory</em>, revised edition, Oxford: Oxford University Press.",
                "Konvitz, M., 1964, “Civil Disobedience and the Duty of Fair\nPlay,” in <em>Law and Philosophy: A Symposium</em>, S. Hook\n(ed.), New York: New York University Press, pp. 19–28.",
                "Kraut, R., 1984, <em>Socrates and the State</em>, Princeton:\nPrinceton University Press.",
                "–––, 2002, <em>Aristotle: Political\nPhilosophy</em>, Oxford: Oxford University Press.",
                "Laks, A., 1990, “Legislation and demiurgy: on the\nrelationship between Plato’s <em>Republic</em> and\n<em>Laws</em>,” <em>Classical Antiquity</em>, 9:\n209–29.",
                "–––, 1991, “L’utopie\nlégislative de Platon,” <em>Revue philosophique</em>, 4:\n417–28.",
                "–––, 2000, “The <em>Laws</em>,” in\nRowe and Schofield 2000, pp. 258–292.",
                "–––, 2005, <em>Médiation et coercition:\npour une lecture des Lois de Platon</em>, Villeneuve d’Ascq:\nPresses universitaires du septentrion.",
                "Laks, A., and M. Schofield, (eds.), 1995, <em>Justice and\nGenerosity: studies in Hellenistic social and political philosophy:\nProceedings of the Sixth Symposium Hellenisticum</em>, Cambridge:\nCambridge University Press.",
                "Lane, M.S, 1998, <em>Method and Politics in Plato’s\nStatesman</em>, Cambridge: Cambridge University Press.",
                "––– [as Lane, M.], 2012, “The Origins of\nthe Statesman–Demagogue Distinction in and after Ancient\nAthens,” <em>Journal of the History of Ideas</em>, 73:\n179–200.",
                "–––, 2013a, “Claims to Rule: the case of\nthe multitude,” in <em>The Cambridge Companion to\nAristotle’s Politics</em>, M. Deslauriers and P. Destrée\n(eds.), Cambridge: Cambridge University Press, pp. 247–274.",
                "–––, 2013b, “Founding as Legislating: the\nfigure of the lawgiver in Plato’s <em>Republic</em>,” in\n<em>Dialogues on Plato’s Politeia. Proceedings of the IX\nSymposium Platonicum</em>, L. Brisson and N. Notomi (eds.), Sankt\nAugustin: Akademia Verlag, pp. 104–114.",
                "–––, 2013c, “Political Expertise and\nPolitical Office in Plato’s <em>Statesman</em>: the\nstatesman’s rule (<em>archein</em>) and the subordinate\nmagistracies (<em>archai</em>),” in <em>Plato’s Statesman:\nproceedings of the eighth Symposium Platonicum Pragense</em>, A.\nHavliček and K. Thein (eds.), Prague, OIKOYMENH, pp.\n49–77.",
                "–––, 2014a, <em>Greek and Roman Political\nIdeas</em>, Harmondsworth: Penguin.",
                "–––, 2014b, “Popular Sovereignty as\nControl of Officeholders: Aristotle on Greek democracy,” in\n<em>Popular Sovereignty in Historical Perspective</em>, R. Bourke and\nQ. Skinner (eds.), Cambridge: Cambridge University Press, pp.\n52–72.",
                "Laurand, V., 2005, <em>La politique stoïcienne</em>, Paris:\nPresses Universitaires de France.",
                "Lear, J., 1988, <em>Aristotle: The Desire to Understand</em>,\nCambridge: Cambridge University Press.",
                "Lintott, A., 1999, <em>The Constitution of the Roman\nRepublic</em>, Oxford: Oxford University Press.",
                "Long, A.A., 1995, “Cicero’s Politics in <em>De\nofficiis</em>,” in Laks and Schofield 1995, pp.\n213–40.",
                "Meier, C., 1990, trans. David McLintock, <em>The Greek Discovery\nof Politics</em>, Cambridge, MA: Harvard University Press.",
                "Monoson, S. S., 2011, “Recollecting Aristotle: Pro-Slavery Thought\nin Antebellum America and the Argument of <em>Politics</em> Book I,”\nin <em>Ancient Slavery and Abolition: from Hobbes to Hollywood</em>,\nR. Alston, E. Hall, and J. McConnell (eds.), Oxford: Oxford University\nPress, pp. 247–78.",
                "Mossman, J., (ed.), 1997, <em>Plutarch and His Intellectual\nWorld</em>, London: Duckworth.",
                "Nails, D., 2002, <em>The People of Plato: a prosopography of Plato\nand other Socratics</em>, Indianapolis: Hackett.",
                "Nightingale, A., 1993a, <em>Genres in Dialogue: Plato and the\nconstruction of philosophy</em>, Cambridge: Cambridge University\nPress.",
                "–––, 1993b, “Writing/Reading a Sacred\nText: a literary interpretation of Plato’s <em>Laws</em>,”\n<em>Classical Philology</em>, 88: 279–300.",
                "–––, 1999, “Plato’s Lawcode in\nContext: rule by written law in Athens and Magnesia,” <em>The\nClassical Quarterly</em> (New Series), 49: 100–122.",
                "Nussbaum, M.C., 1980, “Shame, Separateness, and Political\nUnity: Aristotle’s criticism of Plato,” in <em>Essays on\nAristotle’s Ethics</em>, A.O. Rorty (ed.), Berkeley and Los\nAngeles: University of California Press, pp. 395–436.",
                "–––, 1993, “Non-relative Virtues: an\nAristotelian approach,” in <em>The Quality of Life</em>, M.C.\nNussbaum and A. Sen (eds.), Oxford: Clarendon Press, pp.\n242–69.",
                "Ober, J., 1989, <em>Mass and Elite in Democratic Athens: rhetoric,\nideology, and the power of the people</em>, Princeton: Princeton\nUniversity Press.",
                "–––, 1998a, “The Polis as a Society:\nAristotle, John Rawls, and the Athenian Social Contract,” as\nreprinted in his <em>The Athenian Revolution</em>, Princeton:\nPrinceton University Press, pp. 161–187.",
                "–––, 1998b, <em>Political Dissent in Democratic\nAthens: intellectual critics of popular rule</em>, Princeton:\nPrinceton University Press.",
                "–––, 2008, <em>Democracy and Knowledge:\ninnovation and learning in classical Athens</em>, Princeton: Princeton\nUniversity Press.",
                "–––, 2013, “Democracy’s Wisdom: An\nAristotelian Middle Way for Collective Judgment,” <em>American\nPolitical Science Review</em>, 107: 104–122.",
                "O’Meara, D.J., 2003, <em>Platonopolis: Platonic political\nphilosophy in late antiquity</em>, Oxford: Oxford University\nPress.",
                "–––, 2020, <em>Cosmology and Politics in\nPlato’s Later Works</em>, Cambridge: Cambridge University\nPress.",
                "Poddighe, E., 2014, <em>Aristotele, Atene e le metamorfosi\ndell’idea democratica: da Solone a Pericle (594–451\na.C.)</em>, Rome: Carocci editore.",
                "Powell, J.G.F., and J.A. North, (eds.), 2001, <em>Cicero’s\nRepublic</em>, London: Institute of Classical Studies.",
                "Reid, J., 2021, “Changing the Laws of the\n<em>Laws</em>,” <em>Ancient Philosophy</em>, 41: 413–441.",
                "Riesbeck, D.J., 2016, <em>Aristotle on Political Community</em>,\nCambridge: Cambridge University Press.",
                "Robitzsch, J.M., 2017, “The Epicureans on Human Nature and\nits Social and Political Consequences,” <em>Polis</em>, 34:\n1–19.",
                "Sachs, D., “A Fallacy in Plato’s\n<em>Republic</em>,” <em>The Philosophical Review</em>, 72\n(1963): 141–158; reprinted in G. Vlastos (ed.) <em>Plato: a\ncollection of critical essays, II: Ethics, Politics, and Philosophy of\nArt and Religion</em> (New York: Doubleday and Company, 1971), pp.\n35–51.",
                "Schofield, M., 1991, <em>The Stoic Idea of the City</em>,\nCambridge: Cambridge University Press; reprinted 1999, Chicago:\nUniversity of Chicago Press.",
                "–––, 1999, ‘Equality and hierarchy in\nAristotle’s thought’, in his <em>Saving the City:\nPhilosopher-Kings and other classical paradigms</em>, London and New\nYork: Routledge, ch.6 (pp. 88–100).",
                "–––, 2006, <em>Plato. Political Philosophy</em>,\nOxford: Clarendon Press.",
                "–––, 2021, <em>Cicero: political\nphilosophy</em>, Oxford: Oxford University Press.",
                "Sedley, D.N., 1997, “The Ethics of Brutus and\nCassius,” <em>Journal of Roman Studies</em>, 87:\n41–53.",
                "Shear, J.L., 2011, <em>Polis and Revolution: responding to\noligarchy in classical Athens</em>, Cambridge: Cambridge University\nPress.",
                "Sharples, R., 1996, <em>Stoics, Epicureans and Sceptics: an\nintroduction to Hellenistic philosophy</em>, London: Routledge.",
                "Smith, M. F. (ed.), 1992, <em>The Epicurean Inscription / Diogenes\nof Oenoanda</em>, Naples: Bibliopolis.",
                "–––, (ed.), 2003, <em>Supplement to The\nEpicurean Inscription / Diogenes of Oenoanda</em>, Naples:\nBibliopolis.",
                "Trapp, M.B., 2007, <em>Philosophy in the Roman Empire: Ethics,\nPolitics and Society</em>, Aldershot: Ashgate.",
                "Tuck, R., 1990, “Humanism and Political Thought,” in\nA. Goodman and A. MacKay (eds.), <em>The Impact of Humanism on Western\nEurope</em>, New York: Longman, pp. 43–65.",
                "Van Raalte, M., 2005, “<em>More philosophico</em>: Political\nVirtue and Philosophy in Plutarch’s <em>Lives</em>,” in De\nBlois et. al. (eds.) 2005, pp. 75–112.",
                "Vander Waerdt, P.A., 1991, “The Plan and Intention of\nAristotle’s Ethical and Political Writings,” <em>Illinois\nClassical Studies</em>, 16: 231–253.",
                "Veyne, P., 2003, <em>Seneca: The Life of a Stoic</em>, trans. D.\nSullivan, New York: Routledge.",
                "Villa, D., 2001, <em>Socratic Citizenship</em>, Princeton:\nPrinceton University Press.",
                "Vogt, K.M., 2008, <em>Law, Reason, and the Cosmic City: Political\nPhilosophy in the Early Stoa</em>, New York: Oxford University\nPress.",
                "Waldron, J., 1995, “The Wisdom of the Multitude: Some\nReflections on Book 3, Chapter 11 of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 23:\n563–584.",
                "Weiss, R., 1998, <em>Socrates Dissatisfied: an analysis of\nPlato’s Crito</em>, New York and Oxford: Oxford University\nPress.",
                "Wilson, J.L., 2011, “Deliberation, Democracy, and the Rule\nof Reason in Aristotle’s <em>Politics</em>,” <em>American\nPolitical Science Review</em>, 105: 259–274.",
                "Woozley, A.D., 1972, “Socrates on Disobeying the Law,”\nin <em>The Philosophy of Socrates: a collection of critical\nessays</em>, G. Vlastos (ed.), Garden City, NY: Anchor Books, pp.\n299–318.",
                "Yack, B., 1993, <em>The Problems of a Political Animal: community,\njustice, and conflict in Aristotelian political thought</em>,\nBerkeley: University of California Press.\n</ul>\n<h4>Reference Works</h4>\n<p>\nThis is a partial selection of useful reference works. </p>\n<ul class=\"hanging\">",
                "Aalders, G.J.D., 1975, <em>Political Thought in Hellenistic\nTimes</em>, Amsterdam: H.M. Hakkert.",
                "Algra, K., and J. Barnes, J. Mansfeld and M. Schofield, (eds.),\n1999, <em>The Cambridge History of Hellenistic Philosophy</em>,\nCambridge: Cambridge University Press.",
                "Armstrong, A.H., (ed.), 1967, <em>The Cambridge History of Later\nGreek and Early Medieval Philosophy</em>, Cambridge: Cambridge\nUniversity Press.",
                "Atkins, J. and T. Bénatouïl (eds.), 2022, <em>The\nCambridge Companion to Cicero’s Philosophy</em>, Cambridge:\nCambridge University Press.",
                "Balot, Ryan K., (ed.), <em>A Companion to Greek and Roman\nPolitical Thought</em>, Chichester: Wiley-Blackwell.",
                "Coleman, J., 2000, <em>A History of Political Thought</em>, vol.1:\n<em>From Ancient Greece to Early Christianity</em>, Oxford:\nBlackwell.",
                "Keyt, D., and F.D. Miller, Jr., (eds.), 1991, <em>A Companion to\nAristotle’s Politics</em><em>, New York and Oxford: Oxford\nUniversity Press</em>, 1991.",
                "Keyt, D., and F.D. Miller, Jr., (eds.), 2007, <em>Freedom, Reason,\nand the Polis: Essays in Ancient Greek Political Philosophy</em>,\nCambridge: Cambridge University Press.",
                "Rowe, C., &amp; M. Schofield, (eds.), 2000, <em>The Cambridge\nHistory of <em>Greek and Roman Political Thought</em></em>, Cambridge:\nCambridge University Press.",
                "Sharples, R. W., 1996, <em>Stoics, Epicureans and Skeptics</em>,\nLondon: Routledge.\n</ul>\n<p>\nThere are useful series of <em>Cambridge Companions</em>,\n<em>Cambridge Histories</em>, and <em>Blackwell Companions</em>, among\nother such series, to various authors, texts, and schools, some of\nwhich are cited above. An authoritative source of important articles\nis H. Temporini (ed.), 1972–, <em>Aufstieg und Niedergang der\nrömischen Welt</em>, Berlin and New York: De Gruyter.</p>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<p>\nThis bibliography focuses on political philosophy rather than the\nentire corpus of an author’s work, and gives only an overview of\nsome important sources for this vast field. Fuller bibliographies for\nmost of the works and authors discussed can be found in the related\narticles listed below.</p>\n<h3><a name=\"PriLit\">Primary Literature</a></h3>\n<p>\nThe Oxford Classical Text series has been used for citation of most\nclassical texts. Other editions of reference for many texts include\nthe series published respectively by Teubner in Germany and by\nBudé in France. Abbreviations are used for the following texts\nand translations: DK (for the Presocratics): Diels, H., and W. Kranz\n(eds.), 1951–2, <em>Die Fragmente der Vorsokratiker, griechisch\nund deutsch</em>, 6th edn, 3 vols., Berlin: Weidmann. SVF (for the\nStoics): von Arnim, Hans von, 1903–21, <em>Stoicorum Veterum\nFragmenta</em>, 4 vols., Leipzig: B.G. Teubner. LS (for translations\nof the Stoics): Long, A. A., and D. N. Sedley (eds.), 1987, <em>The\nHellenistic Philosophers</em>, 2 vols. Cambridge: Cambridge University\nPress [Greek and Latin texts in vol.2], which is abbreviated LS in the\nbody of this entry. Quotations from Plato are from the translations\nincluded in Cooper, John (ed.), <em>Plato. Complete Works</em>\n(Indianapolis: Hackett, 1993) (occasionally modified); quotations from\nAristotle are from Barnes, Jonathan (ed.) <em>The Complete Works of\nAristotle</em>, vol. 2 (Princeton: Princeton University Press, 1984)\n[this is known as the Revised Oxford Translation, consisting of\nBarnes’ revision of a complete series of translations published\noriginally by the Oxford University Press between 1912 and 1954]\n(occasionally modified). </p>\n<h4>Translations used</h4>\n<p>\nThe list below is arranged roughly chronologically in relation to the\nGreek or Latin texts that are translated in each case. In addition to\nthose listed below, the Loeb Classical Library has been used herein\nfor the English translations of Plutarch’s <em>Lives</em> (in\neleven volumes, all translated by Bernadotte Perrin) and\n<em>Moralia</em> (in sixteen volumes, by various translators).</p>\n<ul class=\"hanging\">\n<li>Gagarin, M. and P. Woodruff, (eds.), 1995, <em>Early Greek\nPolitical Thought from Homer to the Sophists</em>, Cambridge:\nCambridge University Press.</li>\n<li>Taylor, C.C.W. (ed.), 1999, <em>The Atomists: Leucippus and\nDemocritus, Fragments</em>, Toronto: University of Toronto Press.</li>\n<li>Cooper, J. M., (ed.), 1997, with D.S. Hutchinson (assoc.ed.),\n<em>Plato: Complete Works</em>, Indianapolis: Hackett.</li>\n<li>Reeve, C.D.C. (tr.), 1998, <em>Aristotle Politics</em>,\nIndianapolis and Cambridge: Hackett.</li>\n<li>Barnes, J., (ed.), 1984, <em>The Complete Works of Aristotle</em>,\n2 vols., Princeton: Princeton University Press.</li>\n<li>Everson, S., (ed.), 1996, <em>Aristotle</em>, <em>The Politics and\nThe Constitution of Athens</em>, Cambridge: Cambridge University Press\n[uses translations from Barnes (ed.) 1984].</li>\n<li>Long, A. A., and D. N. Sedley, (eds.), 1987, <em>The Hellenistic\nPhilosophers</em>, 2 vols., Cambridge: Cambridge University Press\n[translations and commentary, volume 1].</li>\n<li>Griffin, M.T., and E.M. Atkins, (eds.), 1991, Cicero, <em>On\nDuties</em>, Cambridge: Cambridge University Press.</li>\n<li>Zetzel, J.E.G., (ed.), 1999, <em>Cicero</em>, <em>On the\nCommonwealth and On the Laws</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Inwood, B., (ed.), 2007, <em>Seneca: Selected Philosophical\nLetters translated with introduction and commentary</em>, Oxford:\nOxford University Press.</li>\n<li>Cooper, J. M., and J.F. Procopé, 1995, <em>Seneca: Moral\nand Political Essays</em>, Cambridge: Cambridge University Press.</li>\n<li>Braund, S.M. (ed.), 2009, <em>Seneca: De Clementia</em>, Oxford:\nOxford University Press.</li>\n<li>Griffin, M., and B. Inwood (eds.), 2011, <em>Seneca: On\nBenefits</em>, Chicago and London: University of Chicago Press.</li>\n<li>King, C. (trans.), with W.B. Irvine (ed. and intro.), 2011,\n<em>Musonius Rufus: Lectures and Sayings</em>, revised edition,\nCreateSpace Publishing.</li>\n<li>Dobbin, R.F., (ed.) 2008, <em>Epictetus: Discourses and Selected\nWritings</em>, London: Penguin.</li>\n<li>Farqharson, A.S.L., (ed.), 2008, <em>The Meditations of Marcus\nAurelius</em> <em>Antoninus</em>, Oxford: Oxford University\nPress.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Alberti, A., 1995, “The Epicurean theory of law and\njustice,” in Laks and Schofield 1995 (eds.),\npp.191–212.</li>\n<li>Annas, J., 1993, <em>The Morality of Happiness</em>, New York and\nOxford: Oxford University Press.</li>\n<li>–––, 1999, <em>Platonic Ethics Old and New</em>,\nIthaca, NY: Cornell University Press.</li>\n<li>–––, 2017, <em>Virtue and Law in Plato and\nBeyond</em>, Oxford: Oxford University Press.</li>\n<li>Aoiz, J. and M. D. Boeri, 2022, “The Genealogy of Justice\nand Law in Epicureanism,” <em>Ancient Philosophy</em>, 42:\n251–71.</li>\n<li>Arendt, H., 1958, <em>The Human Condition</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Atkins, E.M., 1990, “‘Domina et regina\nvirtutum’: justice and <em>societas</em> in <em>De\nOfficiis</em>,” <em>Phronesis</em>, 35: 258–89.</li>\n<li>–––, 2000, “Cicero,” in Rowe and\nSchofield 2000, pp. 477–516.</li>\n<li>Atkins, J.W., 2013, <em>Cicero on Politics and the Limits of\nReason</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2018, <em>Roman Political Thought</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2020, <em>Cicero on Politics and the Limits\nof Reason: The</em> Republic <em>and</em> Laws, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Baraz, Y., 2012, <em>A Written Republic: Cicero’s\nPhilosophical Politics</em>, Princeton: Princeton University\nPress.</li>\n<li>Bartels, M.L., 2017, <em>Plato’s Pragmatic Project: a\nreading of Plato’s Laws</em>, Stuttgart: Franz Steiner\nVerlag.</li>\n<li>Bobonich, C., 2002, <em>Plato’s Utopia Recast: his later\nethics and politics</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2015, “Aristotle, political decision\nmaking, and the many,” in <em>Aristotle’s Politics: a\ncritical guide</em>, T. Lockwood and T. Samaras (eds.), Cambridge:\nCambridge University Press, pp. 142–62.</li>\n<li>Bodéüs, R., 1993, <em>The Political Dimensions of\nAristotle’s</em> Ethics, trans. J.E. Garrett, Albany: State\nUniversity of New York Press.</li>\n<li>Bouchard, E., 2011, “Analogies du pouvoir partagé:\nremarques sur Aristote <em>Politique</em> III.11,”\n<em>Phronesis</em>, 56: 162–179.</li>\n<li>Brouwer, R., 2021, <em>Law and Philosophy in the Late Roman\nRepublic</em>, Cambridge: Cambridge University Press. </li>\n<li>Brunt, P.A., 2013 [1975], “Stoicism and the\nPrincipate,” in P. Brunt, <em>Studies in Stoicism</em>, eds.\nM.T. Griffin and A. Samuels, Oxford: Oxford University Press, pp.\n275–309.</li>\n<li>Burnyeat, M., 2013, “Justice writ large and small in\n<em>Republic</em> 4,” in <em>Politeia in Greek and Roman\nPhilosophy</em>, V. Harte and M. Lane (eds.), Cambridge: Cambridge\nUniversity Press, pp. 212–230.</li>\n<li>Cammack, D., 2013, “Aristotle on the Virtue of the\nMultitude” <em>Political Theory</em>, 41: 175–202.</li>\n<li>Campbell, G., 2003, <em>Lucretius on Creation and Evolution: a\ncommentary on De Rerum Natura 5.772–1104</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Cartledge, P., 2009, <em>Ancient Greek Political Thought in\nPractice</em>, Cambridge: Cambridge University Press.</li>\n<li>Carawan, E., 2013, <em>The Athenian Amnesty and Reconstructing the\nLaw</em>, Oxford: Oxford University Press.</li>\n<li>Centrone, B., 2000, “Platonism and Pythagoreanism in the\nearly empire,” in Rowe and Schofield (eds.), pp.\n559–584.</li>\n<li>De Blois, L., J. Bons, T. Kessels and D.M. Schenkeveld (eds.),\n2005, <em>The Statesman in Plutarch’s Greek and Roman Lives</em>\n(vol.2 of <em>The Statesman in Plutarch’s Works</em>), Leiden\nand Boston: Brill.</li>\n<li>Dillon, J., 1997, “Plutarch and the end of history,”\nin Mossman 1997, pp. 233–240.</li>\n<li>Duke, G., 2020, “Law as Rational Constraint: <em>Nicomachean\nEthics</em> x 9,” <em>Ancient Philosophy</em>, 40, 369–387.</li>\n<li>Duvall, T., and P. Dotson, 1998, “Political Participation\nand <em>Eudaimonia</em> in Aristotle’s <em>Politics</em>”\n<em>History of Political Thought</em>, 29: 21–34.</li>\n<li>Dyck, A.R., 1996, <em>A Commentary on Cicero, De Officiis</em>,\nAnn Arbor: University of Michigan Press.</li>\n<li>El Murr, D., 2014, <em>Savoir et gouverner: essai sur la science\npolitique platonicienne</em>, Paris: J. Vrin.</li>\n<li>Frank, J., 2005, <em>A Democracy of Distinction: Aristotle and the\nwork of politics</em>, Chicago: University of Chicago Press.</li>\n<li>von Fritz, K., 1954, <em>The Theory of the Mixed Constitution in\nAntiquity: a critical analysis of Polybius’ political\nideas</em>, New York: Columbia University Press.</li>\n<li>Fowler, D., 1989, “Lucretius and Politics,” in\n<em>Philosophia Togata</em>, J. Barnes and M. Griffin (eds.), Oxford:\nOxford University Press, pp. 120–150.</li>\n<li>–––, 2007, “Lucretius and Politics,”\nin <em>Lucretius</em>, M.R. Gale (ed.), Oxford: Oxford University\nPress, pp. 397–431.</li>\n<li>Garnsey, P., 1996, <em>Ideas of Slavery from Aristotle to\nAugustine</em>, Cambridge: Cambridge University Press.</li>\n<li>Garver, E., 2011, <em>Aristotle’s Politics: living well and\nliving together</em>, Chicago: University of Chicago Press.</li>\n<li>Geuss, R., 2005, “Thucydides, Nietzsche, and\nWilliams,” in his <em>Outside Ethics</em>, Princeton: Princeton\nUniversity Press, pp. 219–233.</li>\n<li>Giannantoni, G., (ed.), 1990, <em>Socratis et Socraticorum\nReliquiae</em>, 4 volumes, Naples: Bibliopolis.</li>\n<li>Gildenhard, I., 2011<em>Creative Eloquence: the construction of\nreality in Cicero’s speeches</em>, Oxford: Oxford University\nPress.</li>\n<li>Griffin, M.T., 1992, <em>Seneca: a philosopher in politics</em>,\n2<sup>nd</sup> edn, Oxford: Clarendon.</li>\n<li>–––, 2000, “Seneca and Pliny,” in\nRowe and Schofield 2000, pp. 532–558.</li>\n<li>Hahm, D.E., 2000, “Kings and constitutions: Hellenistic\ntheories,” in Rowe and Schofield 2000, pp. 457–76.</li>\n<li>–––, 2009, “The Mixed Constitution in\nGreek Thought,” in <em>A Companion to Greek and Roman Political\nThought</em>, R.K. Balot (ed.), Chichester: Wiley-Blackwell, pp.\n178–98.</li>\n<li>Harte, V., 1999, “Conflicting Values in Plato’s\n<em>Crito</em>,” <em>Archiv für Geschichte der\nPhilosophie</em> 81: 117–147; reprinted in Kamtekar 2005, pp.\n229–59.</li>\n<li>Hatzistavrou, A., 2021, “Aristotle on the Authority of the\nMany: <em>Politics</em> III.11 1281a40-b21,” <em>Apeiron</em>,\n54: 203–232.</li>\n<li>Höffe, O. (ed.), 1997, <em>Platon: Politeia</em>, Berlin:\nAkademie Verlag.</li>\n<li>Hu, X., 2020, “The City as a Living Organism,”\n<em>History of Political Thought</em>, 41: 517–537.</li>\n<li>Huxley, G.L., 1980, “Aristotle, Las Casas, and the American\nIndians,” <em>Proceedings of the Royal Irish Academy: Archaeology,\nCulture, History, Literature</em>, 80C: 57–68.</li>\n<li>Inwood, B., 2005, <em>Reading Seneca: Stoic philosophy at\nRome</em>, Oxford: Clarendon Press.</li>\n<li>Irwin, T., 1990, “The Good of Political Activity” in\n<em>Aristoteles’ Politik: Akten des IX Symposium Aristotelicum,\nFriedrichshafen/Bodensee, 25.8–3.9.1987</em>, G. Patzig (ed.),\nGöttingen: Vandenhoeck &amp; Ruprecht, pp. 73–98.</li>\n<li>Karbowski, J., 2012, “Slaves, Women, and Aristotle’s Natural\nTeleology,” <em>Ancient Philosophy</em>, 32: 323–350.</li>\n<li>Kamtekar, R., (ed.), 2005, <em>Plato’s Euthyphro, Apology\nand Crito: Critical Essays</em>, Lanham, MD: Rowman &amp;\nLittlefield.</li>\n<li>Kempshall, M.S., 2001, “<em>De Re Publica</em> I.39 in\nMedieval and Renaissance Political Thought,” in Powell and North\n(eds.), pp. 99–135.</li>\n<li>Klosko, G., 2006, <em>The Development of Plato’s Political\nTheory</em>, revised edition, Oxford: Oxford University Press.</li>\n<li>Konvitz, M., 1964, “Civil Disobedience and the Duty of Fair\nPlay,” in <em>Law and Philosophy: A Symposium</em>, S. Hook\n(ed.), New York: New York University Press, pp. 19–28.</li>\n<li>Kraut, R., 1984, <em>Socrates and the State</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 2002, <em>Aristotle: Political\nPhilosophy</em>, Oxford: Oxford University Press.</li>\n<li>Laks, A., 1990, “Legislation and demiurgy: on the\nrelationship between Plato’s <em>Republic</em> and\n<em>Laws</em>,” <em>Classical Antiquity</em>, 9:\n209–29.</li>\n<li>–––, 1991, “L’utopie\nlégislative de Platon,” <em>Revue philosophique</em>, 4:\n417–28.</li>\n<li>–––, 2000, “The <em>Laws</em>,” in\nRowe and Schofield 2000, pp. 258–292.</li>\n<li>–––, 2005, <em>Médiation et coercition:\npour une lecture des Lois de Platon</em>, Villeneuve d’Ascq:\nPresses universitaires du septentrion.</li>\n<li>Laks, A., and M. Schofield, (eds.), 1995, <em>Justice and\nGenerosity: studies in Hellenistic social and political philosophy:\nProceedings of the Sixth Symposium Hellenisticum</em>, Cambridge:\nCambridge University Press.</li>\n<li>Lane, M.S, 1998, <em>Method and Politics in Plato’s\nStatesman</em>, Cambridge: Cambridge University Press.</li>\n<li>––– [as Lane, M.], 2012, “The Origins of\nthe Statesman–Demagogue Distinction in and after Ancient\nAthens,” <em>Journal of the History of Ideas</em>, 73:\n179–200.</li>\n<li>–––, 2013a, “Claims to Rule: the case of\nthe multitude,” in <em>The Cambridge Companion to\nAristotle’s Politics</em>, M. Deslauriers and P. Destrée\n(eds.), Cambridge: Cambridge University Press, pp. 247–274.</li>\n<li>–––, 2013b, “Founding as Legislating: the\nfigure of the lawgiver in Plato’s <em>Republic</em>,” in\n<em>Dialogues on Plato’s Politeia. Proceedings of the IX\nSymposium Platonicum</em>, L. Brisson and N. Notomi (eds.), Sankt\nAugustin: Akademia Verlag, pp. 104–114.</li>\n<li>–––, 2013c, “Political Expertise and\nPolitical Office in Plato’s <em>Statesman</em>: the\nstatesman’s rule (<em>archein</em>) and the subordinate\nmagistracies (<em>archai</em>),” in <em>Plato’s Statesman:\nproceedings of the eighth Symposium Platonicum Pragense</em>, A.\nHavliček and K. Thein (eds.), Prague, OIKOYMENH, pp.\n49–77.</li>\n<li>–––, 2014a, <em>Greek and Roman Political\nIdeas</em>, Harmondsworth: Penguin.</li>\n<li>–––, 2014b, “Popular Sovereignty as\nControl of Officeholders: Aristotle on Greek democracy,” in\n<em>Popular Sovereignty in Historical Perspective</em>, R. Bourke and\nQ. Skinner (eds.), Cambridge: Cambridge University Press, pp.\n52–72.</li>\n<li>Laurand, V., 2005, <em>La politique stoïcienne</em>, Paris:\nPresses Universitaires de France.</li>\n<li>Lear, J., 1988, <em>Aristotle: The Desire to Understand</em>,\nCambridge: Cambridge University Press.</li>\n<li>Lintott, A., 1999, <em>The Constitution of the Roman\nRepublic</em>, Oxford: Oxford University Press.</li>\n<li>Long, A.A., 1995, “Cicero’s Politics in <em>De\nofficiis</em>,” in Laks and Schofield 1995, pp.\n213–40.</li>\n<li>Meier, C., 1990, trans. David McLintock, <em>The Greek Discovery\nof Politics</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Monoson, S. S., 2011, “Recollecting Aristotle: Pro-Slavery Thought\nin Antebellum America and the Argument of <em>Politics</em> Book I,”\nin <em>Ancient Slavery and Abolition: from Hobbes to Hollywood</em>,\nR. Alston, E. Hall, and J. McConnell (eds.), Oxford: Oxford University\nPress, pp. 247–78.</li>\n<li>Mossman, J., (ed.), 1997, <em>Plutarch and His Intellectual\nWorld</em>, London: Duckworth.</li>\n<li>Nails, D., 2002, <em>The People of Plato: a prosopography of Plato\nand other Socratics</em>, Indianapolis: Hackett.</li>\n<li>Nightingale, A., 1993a, <em>Genres in Dialogue: Plato and the\nconstruction of philosophy</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1993b, “Writing/Reading a Sacred\nText: a literary interpretation of Plato’s <em>Laws</em>,”\n<em>Classical Philology</em>, 88: 279–300.</li>\n<li>–––, 1999, “Plato’s Lawcode in\nContext: rule by written law in Athens and Magnesia,” <em>The\nClassical Quarterly</em> (New Series), 49: 100–122.</li>\n<li>Nussbaum, M.C., 1980, “Shame, Separateness, and Political\nUnity: Aristotle’s criticism of Plato,” in <em>Essays on\nAristotle’s Ethics</em>, A.O. Rorty (ed.), Berkeley and Los\nAngeles: University of California Press, pp. 395–436.</li>\n<li>–––, 1993, “Non-relative Virtues: an\nAristotelian approach,” in <em>The Quality of Life</em>, M.C.\nNussbaum and A. Sen (eds.), Oxford: Clarendon Press, pp.\n242–69.</li>\n<li>Ober, J., 1989, <em>Mass and Elite in Democratic Athens: rhetoric,\nideology, and the power of the people</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>–––, 1998a, “The Polis as a Society:\nAristotle, John Rawls, and the Athenian Social Contract,” as\nreprinted in his <em>The Athenian Revolution</em>, Princeton:\nPrinceton University Press, pp. 161–187.</li>\n<li>–––, 1998b, <em>Political Dissent in Democratic\nAthens: intellectual critics of popular rule</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 2008, <em>Democracy and Knowledge:\ninnovation and learning in classical Athens</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>–––, 2013, “Democracy’s Wisdom: An\nAristotelian Middle Way for Collective Judgment,” <em>American\nPolitical Science Review</em>, 107: 104–122.</li>\n<li>O’Meara, D.J., 2003, <em>Platonopolis: Platonic political\nphilosophy in late antiquity</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2020, <em>Cosmology and Politics in\nPlato’s Later Works</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Poddighe, E., 2014, <em>Aristotele, Atene e le metamorfosi\ndell’idea democratica: da Solone a Pericle (594–451\na.C.)</em>, Rome: Carocci editore.</li>\n<li>Powell, J.G.F., and J.A. North, (eds.), 2001, <em>Cicero’s\nRepublic</em>, London: Institute of Classical Studies. </li>\n<li>Reid, J., 2021, “Changing the Laws of the\n<em>Laws</em>,” <em>Ancient Philosophy</em>, 41: 413–441. </li>\n<li>Riesbeck, D.J., 2016, <em>Aristotle on Political Community</em>,\nCambridge: Cambridge University Press.</li>\n<li>Robitzsch, J.M., 2017, “The Epicureans on Human Nature and\nits Social and Political Consequences,” <em>Polis</em>, 34:\n1–19.</li>\n<li>Sachs, D., “A Fallacy in Plato’s\n<em>Republic</em>,” <em>The Philosophical Review</em>, 72\n(1963): 141–158; reprinted in G. Vlastos (ed.) <em>Plato: a\ncollection of critical essays, II: Ethics, Politics, and Philosophy of\nArt and Religion</em> (New York: Doubleday and Company, 1971), pp.\n35–51.</li>\n<li>Schofield, M., 1991, <em>The Stoic Idea of the City</em>,\nCambridge: Cambridge University Press; reprinted 1999, Chicago:\nUniversity of Chicago Press.</li>\n<li>–––, 1999, ‘Equality and hierarchy in\nAristotle’s thought’, in his <em>Saving the City:\nPhilosopher-Kings and other classical paradigms</em>, London and New\nYork: Routledge, ch.6 (pp. 88–100).</li>\n<li>–––, 2006, <em>Plato. Political Philosophy</em>,\nOxford: Clarendon Press.</li>\n<li>–––, 2021, <em>Cicero: political\nphilosophy</em>, Oxford: Oxford University Press.</li>\n<li>Sedley, D.N., 1997, “The Ethics of Brutus and\nCassius,” <em>Journal of Roman Studies</em>, 87:\n41–53.</li>\n<li>Shear, J.L., 2011, <em>Polis and Revolution: responding to\noligarchy in classical Athens</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Sharples, R., 1996, <em>Stoics, Epicureans and Sceptics: an\nintroduction to Hellenistic philosophy</em>, London: Routledge.</li>\n<li>Smith, M. F. (ed.), 1992, <em>The Epicurean Inscription / Diogenes\nof Oenoanda</em>, Naples: Bibliopolis.</li>\n<li>–––, (ed.), 2003, <em>Supplement to The\nEpicurean Inscription / Diogenes of Oenoanda</em>, Naples:\nBibliopolis.</li>\n<li>Trapp, M.B., 2007, <em>Philosophy in the Roman Empire: Ethics,\nPolitics and Society</em>, Aldershot: Ashgate.</li>\n<li>Tuck, R., 1990, “Humanism and Political Thought,” in\nA. Goodman and A. MacKay (eds.), <em>The Impact of Humanism on Western\nEurope</em>, New York: Longman, pp. 43–65.</li>\n<li>Van Raalte, M., 2005, “<em>More philosophico</em>: Political\nVirtue and Philosophy in Plutarch’s <em>Lives</em>,” in De\nBlois et. al. (eds.) 2005, pp. 75–112.</li>\n<li>Vander Waerdt, P.A., 1991, “The Plan and Intention of\nAristotle’s Ethical and Political Writings,” <em>Illinois\nClassical Studies</em>, 16: 231–253.</li>\n<li>Veyne, P., 2003, <em>Seneca: The Life of a Stoic</em>, trans. D.\nSullivan, New York: Routledge.</li>\n<li>Villa, D., 2001, <em>Socratic Citizenship</em>, Princeton:\nPrinceton University Press.</li>\n<li>Vogt, K.M., 2008, <em>Law, Reason, and the Cosmic City: Political\nPhilosophy in the Early Stoa</em>, New York: Oxford University\nPress.</li>\n<li>Waldron, J., 1995, “The Wisdom of the Multitude: Some\nReflections on Book 3, Chapter 11 of Aristotle’s\n<em>Politics</em>,” <em>Political Theory</em>, 23:\n563–584.</li>\n<li>Weiss, R., 1998, <em>Socrates Dissatisfied: an analysis of\nPlato’s Crito</em>, New York and Oxford: Oxford University\nPress.</li>\n<li>Wilson, J.L., 2011, “Deliberation, Democracy, and the Rule\nof Reason in Aristotle’s <em>Politics</em>,” <em>American\nPolitical Science Review</em>, 105: 259–274.</li>\n<li>Woozley, A.D., 1972, “Socrates on Disobeying the Law,”\nin <em>The Philosophy of Socrates: a collection of critical\nessays</em>, G. Vlastos (ed.), Garden City, NY: Anchor Books, pp.\n299–318.</li>\n<li>Yack, B., 1993, <em>The Problems of a Political Animal: community,\njustice, and conflict in Aristotelian political thought</em>,\nBerkeley: University of California Press.</li>\n</ul>\n<h4>Reference Works</h4>\n<p>\nThis is a partial selection of useful reference works. </p>\n<ul class=\"hanging\">\n<li>Aalders, G.J.D., 1975, <em>Political Thought in Hellenistic\nTimes</em>, Amsterdam: H.M. Hakkert.</li>\n<li>Algra, K., and J. Barnes, J. Mansfeld and M. Schofield, (eds.),\n1999, <em>The Cambridge History of Hellenistic Philosophy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Armstrong, A.H., (ed.), 1967, <em>The Cambridge History of Later\nGreek and Early Medieval Philosophy</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Atkins, J. and T. Bénatouïl (eds.), 2022, <em>The\nCambridge Companion to Cicero’s Philosophy</em>, Cambridge:\nCambridge University Press. </li>\n<li>Balot, Ryan K., (ed.), <em>A Companion to Greek and Roman\nPolitical Thought</em>, Chichester: Wiley-Blackwell.</li>\n<li>Coleman, J., 2000, <em>A History of Political Thought</em>, vol.1:\n<em>From Ancient Greece to Early Christianity</em>, Oxford:\nBlackwell.</li>\n<li>Keyt, D., and F.D. Miller, Jr., (eds.), 1991, <em>A Companion to\nAristotle’s Politics</em><em>, New York and Oxford: Oxford\nUniversity Press</em>, 1991.</li>\n<li>Keyt, D., and F.D. Miller, Jr., (eds.), 2007, <em>Freedom, Reason,\nand the Polis: Essays in Ancient Greek Political Philosophy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Rowe, C., &amp; M. Schofield, (eds.), 2000, <em>The Cambridge\nHistory of <em>Greek and Roman Political Thought</em></em>, Cambridge:\nCambridge University Press.</li>\n<li>Sharples, R. W., 1996, <em>Stoics, Epicureans and Skeptics</em>,\nLondon: Routledge.</li>\n</ul>\n<p>\nThere are useful series of <em>Cambridge Companions</em>,\n<em>Cambridge Histories</em>, and <em>Blackwell Companions</em>, among\nother such series, to various authors, texts, and schools, some of\nwhich are cited above. An authoritative source of important articles\nis H. Temporini (ed.), 1972–, <em>Aufstieg und Niedergang der\nrömischen Welt</em>, Berlin and New York: De Gruyter.</p>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle",
            "Aristotle, General Topics: ethics",
            "Aristotle, General Topics: political theory",
            "Carneades",
            "cosmopolitanism",
            "doxography of ancient philosophy",
            "Epicurus",
            "ethics: ancient",
            "Plato",
            "Plato: Callicles and Thrasymachus",
            "Plato: ethics and politics in The Republic",
            "Plato: on utopia",
            "Plotinus",
            "political philosophy: medieval",
            "Pyrrho",
            "Pythagoreanism",
            "Seneca",
            "skepticism: ancient",
            "Socrates",
            "Stoicism"
        ],
        "entry_link": [
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../aristotle-politics/": "Aristotle, General Topics: political theory"
            },
            {
                "../carneades/": "Carneades"
            },
            {
                "../cosmopolitanism/": "cosmopolitanism"
            },
            {
                "../doxography-ancient/": "doxography of ancient philosophy"
            },
            {
                "../epicurus/": "Epicurus"
            },
            {
                "../ethics-ancient/": "ethics: ancient"
            },
            {
                "../plato/": "Plato"
            },
            {
                "../callicles-thrasymachus/": "Plato: Callicles and Thrasymachus"
            },
            {
                "../plato-ethics-politics/": "Plato: ethics and politics in The Republic"
            },
            {
                "../plato-utopia/": "Plato: on utopia"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../medieval-political/": "political philosophy: medieval"
            },
            {
                "../pyrrho/": "Pyrrho"
            },
            {
                "../pythagoreanism/": "Pythagoreanism"
            },
            {
                "../seneca/": "Seneca"
            },
            {
                "../skepticism-ancient/": "skepticism: ancient"
            },
            {
                "../socrates/": "Socrates"
            },
            {
                "../stoicism/": "Stoicism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ancient-political\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ancient-political/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ancient-political&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/ancient-political/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ancient-political": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ancient-political/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ancient-political&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/ancient-political/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://platosociety.org/plato-bibliography/\" target=\"other\">Plato Bibliography</a>,\n maintained by the International Plato Society",
            "<a href=\"http://www.perseus.tufts.edu/\" target=\"other\">Perseus Project</a>\n of Greek and Roman texts with translations",
            "<a href=\"http://www.thelatinlibrary.com/sen.html\" target=\"other\">Seneca’s works in Latin</a>,\n from The Latin Library at Ad Fontes Academy"
        ],
        "listed_links": [
            {
                "http://platosociety.org/plato-bibliography/": "Plato Bibliography"
            },
            {
                "http://www.perseus.tufts.edu/": "Perseus Project"
            },
            {
                "http://www.thelatinlibrary.com/sen.html": "Seneca’s works in Latin"
            }
        ]
    }
}