{
    "url": "anselm",
    "title": "Anselm of Canterbury",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Thomas Williams\n<thomas.williams@georgetown.edu>",
        "author_links": [
            {
                "https://www.profthomaswilliams.com": "Thomas Williams"
            },
            {
                "mailto:thomas%2ewilliams%40georgetown%2eedu": "thomas.williams@georgetown.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://www.profthomaswilliams.com\" target=\"other\">Thomas Williams</a>\n&lt;<a href=\"mailto:thomas%2ewilliams%40georgetown%2eedu\"><em>thomas<abbr title=\" dot \">.</abbr>williams<abbr title=\" at \">@</abbr>georgetown<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 18, 2000",
        "substantive revision Sun Jul 16, 2023"
    ],
    "preamble": "\n\nSaint Anselm of Canterbury (1033–1109) was the outstanding\nChristian philosopher and theologian of the eleventh century. He is\nbest known for the celebrated “ontological argument” for\nthe existence of God in the Proslogion, but his contributions\nto philosophical theology (and indeed to philosophy more generally) go\nwell beyond the ontological argument. In what follows I examine\nAnselm’s theistic proofs, his conception of the divine nature,\nand his account of human freedom, sin, and redemption.\n",
    "toc": [
        {
            "#LifWor": "1. Life and Works"
        },
        {
            "#ThePro": "2. The Theistic Proofs"
        },
        {
            "#FaiSeeUndChaPurAnsThePro": "2.1 “Faith Seeking Understanding”: The character and purpose of Anselm’s theistic proofs"
        },
        {
            "#ArgMon": "2.2 The arguments of the Monologion"
        },
        {
            "#ArgPro": "2.3 The argument of the Proslogion"
        },
        {
            "#DivNat": "3. The Divine Nature"
        },
        {
            "#ProDivAtt": "3.1 Proving the divine attributes"
        },
        {
            "#ConDivAtt": "3.2 The consistency of the divine attributes"
        },
        {
            "#FreSinRed": "4. Freedom, Sin, and Redemption"
        },
        {
            "#TruStaWil": "4.1 Truth in statements and in the will"
        },
        {
            "#FreSin": "4.2 Freedom and sin"
        },
        {
            "#GraRed": "4.3 Grace and redemption"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#CriEdi": "Critical Edition"
        },
        {
            "#Tra": "Translations"
        },
        {
            "#SecWor": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nAnselm was born in 1033 near Aosta, in those days a Burgundian town on\nthe frontier with Lombardy. Little is known of his early life. He left\nhome at twenty-three, and after three years of apparently aimless\ntravelling through Burgundy and France, he came to Normandy in 1059.\nOnce he was in Normandy, Anselm’s interest was captured by the\nBenedictine abbey at Bec, whose famous school was under the direction\nof Lanfranc, the abbey’s prior. Lanfranc was a scholar and\nteacher of wide reputation, and under his leadership the school at Bec\nhad become an important center of learning, especially in dialectic.\nIn 1060 Anselm entered the abbey as a novice. His intellectual and\nspiritual gifts brought him rapid advancement, and when Lanfranc was\nappointed abbot of Caen in 1063, Anselm was elected to succeed him as\nprior. He was elected abbot in 1078 upon the death of Herluin, the\nfounder and first abbot of Bec. Under Anselm’s leadership the\nreputation of Bec as an intellectual center grew, and Anselm managed\nto write a good deal of philosophy and theology in addition to his\nteaching, administrative duties, and extensive correspondence as an\nadviser and counselor to rulers and nobles all over Europe and beyond.\nHis works while at Bec include the Monologion\n(1075–76), the Proslogion (1077–78), and his four\nphilosophical dialogues: De grammatico (probably\n1059–60, though the dating of this work is much disputed), and\nDe veritate, De libertate arbitrii, and De casu\ndiaboli (1080–86).\n\nIn 1093 Anselm was enthroned as Archbishop of Canterbury. The previous\nArchbishop, Anselm’s old master Lanfranc, had died four years\nearlier, but the King, William Rufus, had left the see vacant in order\nto plunder the archiepiscopal revenues. Anselm was understandably\nreluctant to undertake the primacy of the Church of England under a\nruler as ruthless and venal as William, and his tenure as Archbishop\nproved to be as turbulent and vexatious as he must have feared.\nWilliam was intent on maintaining royal authority over ecclesiastical\naffairs and would not be dictated to by Archbishop or Pope or anyone\nelse. So, for example, when Anselm went to Rome in 1097 without the\nKing’s permission, William would not allow him to return. When\nWilliam was killed in 1100, his successor, Henry I, invited Anselm to\nreturn to his see. But Henry was as intent as William had been on\nmaintaining royal jurisdiction over the Church, and Anselm found\nhimself in exile again from 1103 to 1107. Despite these distractions\nand troubles, Anselm continued to write. His works as Archbishop of\nCanterbury include the Epistola de Incarnatione Verbi (1094),\nCur Deus Homo (1095–98), De conceptu virginali\n(1099), De processione Spiritus Sancti (1102), the\nEpistola de sacrificio azymi et fermentati (1106–7),\nDe sacramentis ecclesiae (1106–7), and De\nconcordia (1107–8). Anselm died on 21 April 1109. He was\ncanonized in 1494 and named a Doctor of the Church in 1720.\n2. The Theistic Proofs\n2.1 “Faith Seeking Understanding”: The character and purpose of Anselm’s theistic proofs\n\nAnselm’s motto is “faith seeking understanding”\n(fides quaerens intellectum). This motto lends itself to at\nleast two misunderstandings. First, many philosophers have taken it to\nmean that Anselm hopes to replace faith with understanding.\nIf one takes ‘faith’ to mean roughly ‘belief on the\nbasis of testimony’ and ‘understanding’ to mean\n‘belief on the basis of philosophical insight’, one is\nlikely to regard faith as an epistemically substandard position; any\nself-respecting philosopher would surely want to leave faith behind as\nquickly as possible. The theistic proofs are then interpreted as the\nmeans by which we come to have philosophical insight into things we\npreviously believed solely on testimony. But Anselm is not hoping to\nreplace faith with understanding. Faith for Anselm is more a\nvolitional state than an epistemic state: it is love for God and a\ndrive to act as God wills. In fact, Anselm describes the sort of faith\nthat “merely believes what it ought to believe” as\n“dead” (M 78). (For the abbreviations used in\nreferences, see the Bibliography below.) So “faith seeking\nunderstanding” means something like “an active love of God\nseeking a deeper knowledge of God.”\n\nOther philosophers have noted that “faith seeking\nunderstanding” begins with “faith,” not with doubt\nor suspension of belief.  Hence, they argue, the theistic\narguments proposed by faith seeking understanding are not really meant\nto convince unbelievers; they are intended solely for the edification\nof those who already believe.  This too is a misreading of\nAnselm’s motto. For although the theistic proofs are borne of an\nactive love of God seeking a deeper knowledge of the beloved, the\nproofs themselves are intended to be convincing even to unbelievers.\nThus Anselm opens the Monologion with these words:\n\nIf anyone does not know, either because he has not heard or because he\ndoes not believe, that there is one nature, supreme among all existing\nthings, who alone is self-sufficient in his eternal happiness, who\nthrough his omnipotent goodness grants and brings it about that all\nother things exist or have any sort of well-being, and a great many\nother things that we must believe about God or his creation, I think\nhe could at least convince himself of most of these things by reason\nalone, if he is even moderately intelligent. (M 1)\n\n\nAnd in the Proslogion Anselm sets out to convince “the\nfool,” that is, the person who “has said in his heart,\n‘There is no God’ ” (Psalm 14:1; 53:1).\n2.2 The arguments of the Monologion\n\nHaving clarified what Anselm takes himself to be doing in his theistic\nproofs, we can now examine the proofs themselves. In the first chapter\nof the Monologion Anselm argues that there must be some one\nthing that is supremely good, through which all good things have their\ngoodness. For whenever we say that different things are F in\ndifferent degrees, we must understand them as being F through\nF-ness; F-ness itself is the same in each of them.\nThus, for example, all more or less just things “must be more or\nless just through justice, which is not different in diverse\nthings” (M 1). Now we speak of things as being\ngood in different degrees. So by the principle just stated,\nthese things must be good through some one thing. Clearly that thing\nis itself a great good, since it is the source of the goodness of all\nother things. Moreover, that thing is good through itself;\nafter all, if all good things are good through that thing, it follows\ntrivially that that thing, being good, is good through itself. Things\nthat are good through another (i.e., things whose goodness derives\nfrom something other than themselves) cannot be equal to or greater\nthan the good thing that is good through itself, and so that which is\ngood through itself is supremely good. Anselm concludes,\n“Now that which is supremely good is also supremely great. There\nis, therefore, some one thing that is supremely good and supremely\ngreat – in other words, supreme among all existing things”\n(M 1). In chapter 2 he applies the principle of chapter 1 in\norder to derive (again) the conclusion that there is something\nsupremely great.\n\nIn chapter 3 Anselm argues that all existing things exist through some\none thing. Every existing thing, he begins, exists either through\nsomething or through nothing. But of course nothing exists through\nnothing, so every existing thing exists through something. There is,\nthen, either some one thing through which all existing things exist,\nor there is more than one such thing. If there is more than one,\neither (i) they all exist through some one thing, or (ii) each of them\nexists through itself, or (iii) they exist through each other. (iii)\nmakes no sense. If (ii) is true, then “there is surely some one\npower or nature of self-existing that they have in order to exist\nthrough themselves” (M 3); in that case, “all\nthings exist more truly through that one thing than through the\nseveral things that cannot exist without that one thing”\n(M 3). So (ii) collapses into (i), and there is some one\nthing through which all things exist. That one thing, of course,\nexists through itself, and so it is greater than all the other things.\nIt is therefore “best and greatest and supreme among all\nexisting things” (M 3).\n\nIn chapter 4 Anselm begins with the premise that things “are not\nall of equal dignity; rather, some of them are on different and\nunequal levels” (M 4). For example, a horse is better\nthan wood, and a human being is more excellent than a horse. Now it is\nabsurd to think that there is no limit to how high these levels can\ngo, “so that there is no level so high that an even higher level\ncannot be found” (M 4). The only question is how many\nbeings occupy that highest level of all. Is there just one, or are\nthere more than one? Suppose there are more than one. By hypothesis,\nthey must all be equals. If they are equals, they are equals through\nthe same thing. That thing is either identical with them or distinct\nfrom them. If it is identical with them, then they are not in fact\nmany, but one, since they are all identical with some one thing. On\nthe other hand, if that thing is distinct from them, then they do not\noccupy the highest level after all. Instead, that thing is greater\nthan they are. Either way, there can be only one being occupying the\nhighest level of all.\n\nAnselm concludes the first four chapters by summarizing his\nresults:\n\nTherefore, there is a certain nature or substance or essence who\nthrough himself is good and great and through himself is what he is;\nthrough whom exists whatever truly is good or great or anything at\nall; and who is the supreme good, the supreme great thing, the supreme\nbeing or subsistent, that is, supreme among all existing things.\n(M 4)\n\n\nHe then goes on (in chapters 5–65) to derive the attributes that\nmust belong to the being who fits this description. But before we look\nat Anselm’s understanding of the divine attributes, we should\nturn to the famous proof in the Proslogion.\n2.3 The argument of the Proslogion\n\nLooking back on the sixty-five chapters of complicated argument in the\nMonologion, Anselm found himself wishing for a simpler way to\nestablish all the conclusions he wanted to prove. As he tells us in\nthe preface to the Proslogion, he wanted to find\n\na single argument that needed nothing but itself alone for proof, that\nwould by itself be enough to show that God really exists; that he is\nthe supreme good, who depends on nothing else, but on whom all things\ndepend for their being and for their well-being; and whatever we\nbelieve about the divine nature. (P, preface)\n\n\nThat “single argument” is the one that appears in chapter\n2 of the Proslogion. (Or so it is commonly said: but some\ninterpreters understand the “one argument” as extending\ninto chapter 3, and Holopainen 1996 argues that it is the\nformula “that than which a greater cannot be\nthought.”)\n\nThe proper way to state Anselm’s argument is a matter of\ndispute, and any detailed statement of the argument will beg\ninterpretative questions. But on a fairly neutral or consensus reading\nof the argument (which I shall go on to reject), Anselm’s\nargument goes like this. God is “that than which a greater\ncannot be thought”; in other words, he is a being so great, so\nfull of metaphysical oomph, that one cannot so much as conceive of a\nbeing who would be greater than God. The Psalmist, however, tells us\nthat “The fool has said in his heart, ‘There is no\nGod’ ” (Psalm 14:1; 53:1). Is it possible to convince the\nfool that he is wrong? It is. All we need is the characterization of\nGod as “that than which a greater cannot be thought.” The\nfool does at least understand that definition. But whatever is\nunderstood exists in the understanding, just as the plan of a painting\nhe has yet to execute already exists in the understanding of the\npainter. So that than which a greater cannot be thought exists in the\nunderstanding. But if it exists in the understanding, it must also\nexist in reality. For it is greater to exist in reality than to exist\nmerely in the understanding. Therefore, if that than which a greater\ncan be thought existed only in the understanding, it would be possible\nto think of something greater than it (namely, that same being\nexisting in reality as well). It follows, then, that if that than\nwhich a greater cannot be thought existed only in the understanding,\nit would not be that than which a greater cannot be thought; and that,\nobviously, is a contradiction. So that than which a greater cannot be\nthought must exist in reality, not merely in the understanding.\n\nVersions of this argument have been defended and criticized by a\nsuccession of philosophers from Anselm’s time through the\npresent day (see\n ontological arguments).\n Our concern here is with Anselm’s own version, the criticism he\nencountered, and his response to that criticism. A monk named Gaunilo\nwrote a “Reply on Behalf of the Fool,” contending that\nAnselm’s argument gave the Psalmist’s fool no good reason\nat all to believe that that than which a greater cannot be thought\nexists in reality. Gaunilo’s most famous objection is an\nargument intended to be exactly parallel to Anselm’s that\ngenerates an obviously absurd conclusion. Gaunilo proposes that\ninstead of “that than which a greater cannot be thought”\nwe consider “that island than which a greater cannot be\nthought.” We understand what that expression means, so\n(following Anselm’s reasoning) the greatest conceivable island\nexists in our understanding. But (again following Anselm’s\nreasoning) that island must exist in reality as well; for if it did\nnot, we could imagine a greater island – namely, one that\nexisted in reality – and the greatest conceivable island would\nnot be the greatest conceivable island after all. Surely, though, it\nis absurd to suppose that the greatest conceivable island actually\nexists in reality. Gaunilo concludes that Anselm’s reasoning is\nfallacious.\n\nGaunilo’s counterargument is so ingenious that it stands out as\nby far the most devastating criticism in his catalogue of\nAnselm’s errors. Not surprisingly, then, interpreters have read\nAnselm’s reply to Gaunilo primarily in order to find his\nrejoinder to the Lost Island argument. Sympathetic interpreters (such\nas Klima 2000 and Ward 2018) have offered ways for Anselm to respond,\nbut at least one commentator (Wolterstorff 1993) argues that Anselm\noffers no such rejoinder, precisely because he knew Gaunilo’s\ncriticism was unanswerable but could not bring himself to admit that\nfact.\n\nA more careful look at Anselm’s reply to Gaunilo, however, shows\nthat Anselm offered no rejoinder to the Lost Island argument because\nhe rejected Gaunilo’s interpretation of the original argument of\nthe Proslogion. Gaunilo had understood the argument in the\nway I stated it above. Anselm understood it quite differently. In\nparticular, Anselm insists that the original argument did not rely on\nany general principle to the effect that a thing is greater when it\nexists in reality than when it exists only in the\n understanding.[1]\n And since that is the principle that does the mischief in\nGaunilo’s counterargument, Anselm sees no need to respond to the\nLost Island argument in particular.\n\nCorrectly understood, Anselm says, the argument of the\nProslogion can be summarized as follows:\n\nThat than which a greater cannot be thought can be thought.\nIf that than which a greater cannot be thought can be thought, it\nexists in reality.\n\n\nTherefore,\n\nThat than which a greater cannot be thought exists in\nreality.\n\n\nAnselm defends (1) by showing how we can form a conception of that\nthan which a greater cannot be thought on the basis of our experience\nand understanding of those things than which a greater can be\nthought. For example,\n\nit is clear to every reasonable mind that by raising our thoughts from\nlesser goods to greater goods, we are quite capable of forming an idea\nof that than which a greater cannot be thought on the basis of that\nthan which a greater can be thought. Who, for example, is unable to\nthink … that if something that has a beginning and end is good,\nthen something that has a beginning but never ceases to exist is much\nbetter? And that just as the latter is better than the former, so\nsomething that has neither beginning nor end is better still, even if\nit is always moving from the past through the present into the future?\nAnd that something that in no way needs or is compelled to change or\nmove is far better even than that, whether any such thing exists in\nreality or not? Can such a thing not be thought? Can anything greater\nthan this be thought? Or rather, is not this an example of forming an\nidea of that than which a greater cannot be thought on the basis of\nthose things than which a greater can be thought? So there is in fact\na way to form an idea of that than which a greater cannot be thought.\n(Anselm’s Reply to Gaunilo 8)\n\n\nOnce we have formed this idea of that than which a greater cannot be\nthought, Anselm says, we can see that such a being has features that\ncannot belong to a possible but non-existent object – or, in\nother words, that (2) is true. For example, a being that is capable of\nnon-existence is less great than a being that exists necessarily. If\nthat than which a greater cannot be thought does not exist, it is\nobviously capable of non-existence; and if it is capable of\nnon-existence, then even if it were to exist, it would not be that\nthan which a greater cannot be thought after all. So if that than\nwhich a greater cannot be thought can be thought – that is, if\nit is a possible being – it actually exists. (This reading of\nthe argument of the Proslogion is developed at length in\nVisser and Williams 2008, chapter 5.)\n3. The Divine Nature\n3.1 Proving the divine attributes\n\nRecall that Anselm’s intention in the Proslogion was to\noffer a single argument that would establish not only the existence of\nGod but also the various attributes that Christians believe God\npossesses. If the argument of chapter 2 proved only the existence of\nGod, leaving the divine attributes to be established piecemeal as in\nthe Monologion, Anselm would consider the Proslogion\na failure. But in fact the concept of that than which nothing greater\ncan be thought turns out to be marvelously fertile. God must, for\nexample, be omnipotent. For if he were not, we could conceive of a\nbeing greater than he. But God is that than which no greater can be\nthought, so he must be omnipotent. Similarly, God must be just,\nself-existent, invulnerable to suffering, merciful, timelessly\neternal, non-physical, non-composite, and so forth. For if he lacked\nany of these qualities, he would be less than the greatest conceivable\nbeing, which is impossible.\n\nThe ontological argument thus works as a sort of\ndivine-attribute-generating machine. Admittedly, though, the\nappearance of theoretical simplicity is somewhat misleading. The\n“single argument” produces conclusions about the divine\nattributes only when conjoined with certain beliefs about what is\ngreater or better. That is, the ontological argument tells us that God\nhas whatever characteristics it is better or greater to have than to\nlack, but it does not tell us which characteristics those are. We must\nhave some independent way of identifying them before we can plug them\ninto the ontological argument and generate a full-blown conception of\nthe divine nature. Anselm identifies these characteristics in part by\nappeal to intuitions about value, in part by independent argument. To\nillustrate Anselm’s method, I shall examine his discussions of\nGod’s impassibility, timelessness, and simplicity.\n\nAccording to the doctrine of divine impassibility, God is invulnerable\nto suffering. Nothing can act upon him; he is in no way passive. He\ntherefore does not feel emotions, since emotions are states that one\nundergoes rather than actions one performs. Anselm does not find it\nnecessary to argue that impassibility is a perfection; he\nthinks it is perfectly obvious that “it is better to be …\nimpassible than not” (P 6), just as it is perfectly\nobvious that it is better to be just than not-just. His intuitions\nabout value are shaped by the Platonic-Augustinian tradition of which\nhe was a part. Augustine took from the Platonists the idea that the\nreally real things, the greatest and best of beings, are stable,\nuniform, and unchanging. He says in On Free Choice of the\nWill 2.10, “And you surely could not deny that the\nuncorrupted is better than the corrupt, the eternal than the temporal,\nand the invulnerable than the vulnerable”; his interlocutor\nreplies simply, “Could anyone?” Through Augustine (and\nothers) these ideas, and the conception of God to which they naturally\nlead, became the common view of Christian theologians for well over a\nmillennium. For Anselm, then, it is obvious that a being who is in no\nway passive, who cannot experience anything of which he is not himself\nthe origin, is better and greater than any being who can be acted upon\nby something outside himself. So God, being that than which nothing\ngreater can be thought, is wholly active; he is impassible.\n\nNotice that Augustine also found it obvious that the eternal is better\nthan the temporal. According to Plato’s Timaeus, time\nis a “moving image of eternity” (37d). It is a shifting\nand shadowy reflection of the really real. As later Platonists,\nincluding Augustine, develop this idea, temporal beings have their\nexistence piecemeal; they exist only in this tiny sliver of a now,\nwhich is constantly flowing away from them and passing into\nnothingness. An eternal being, by contrast, is (to use my earlier\ndescription) stable, uniform, and unchanging. What it has, it always\nhas; what it is, it always is; what it does, it always does. So it\nseems intuitively obvious to Anselm that if God is to be that than\nwhich nothing greater can be thought, he must be eternal. That is, he\nmust be not merely everlasting, but outside time\n altogether.[2]\n\nIn addition to this strong intuitive consideration, Anselm at least\nhints at a further argument for the claim that it is better to be\neternal than temporal. He opens chapter 13 of the Proslogion\nby observing, “Everything that is at all enclosed in a place or\ntime is less than that which is subject to no law of place or\ntime” (P 13). His idea seems to be that if God were in\ntime (or in a place), he would be bound by certain constraints\ninherent in the nature of time (or place). His discussion in\nMonologion 22 makes the problem clear:\n\nThis, then, is the condition of place and time: whatever is enclosed\nwithin their boundaries does not escape being characterized by parts,\nwhether the sort of parts its place receives with respect to size, or\nthe sort its time suffers with respect to duration; nor can it in any\nway be contained as a whole all at once by different places or times.\nBy contrast, if something is in no way constrained by confinement in a\nplace or time, no law of places or times forces it into a multiplicity\nof parts or prevents it from being present as a whole all at once in\nseveral places or times. (M 22)\n\n\nSo at least part of the reason for holding that God is timeless is\nthat the nature of time would impose constraints upon God, and of\ncourse it is better to be subject to no external constraints.\n\nThe other part of the reason, though, is that if God were in place or\ntime he would have parts. But what is so bad about having\nparts? This question brings us naturally to the doctrine of divine\nsimplicity, which is simply the doctrine that God has no parts of any\nkind. Even for an Augustinian like Anselm, the claim that it is better\nto lack parts than to have them is less than intuitively compelling,\nso Anselm offers further arguments for that claim. In the\nProslogion he argues that “whatever is composed of\nparts is not completely one. It is in some sense a plurality and not\nidentical with itself, and it can be broken up either in fact or at\nleast in the understanding” (P 18). The argument in the\nMonologion goes somewhat differently. “Every\ncomposite,” Anselm argues, “needs the things of which it\nis composed if it is to subsist, and it owes its existence to them,\nsince whatever it is, it is through them, whereas those things are not\nthrough it what they are” (M 17). The argument in the\nProslogion, then, seeks to relate simplicity to the intuitive\nconsiderations that identify what is greatest and best with what is\nstable, uniform, and unchanging; the argument in the\nMonologion, by contrast, seeks to show that simplicity is\nnecessary if God is to be – as the theistic proofs have already\nestablished – the ultimate source of his own goodness and\nexistence.\n3.2 The consistency of the divine attributes\n\nAnselm’s success in generating a whole host of divine attributes\nthrough the ontological argument does present him with a\nproblem.  He must show that the attributes are consistent with\neach other – in other words, that it is possible for one and the\nsame being to have all of them. For example, there seems at first\nglance to be a conflict between justice and omnipotence. If God is\nperfectly just, he cannot lie. But if God is omnipotent, how can there\nbe something he cannot do? Anselm’s solution is to explain that\nomnipotence does not mean the ability to do everything; instead, it\nmeans the possession of unlimited power. Now the so-called\n“ability” or “power” to lie is not really a\npower at all; it is a kind of weakness. Being omnipotent, God has no\nweakness. So it turns out that omnipotence actually entails\nthe inability to lie.\n\nAnother apparent contradiction is between God’s mercy and his\njustice. If God is just, he will surely punish the wicked as they\ndeserve. But because he is merciful, he spares the wicked. Anselm\ntries to resolve this apparent contradiction by appeal to God’s\ngoodness. It is better, he says, for God “to be good both to the\ngood and to the wicked than to be good only to the good, and it is\nbetter to be good to the wicked both in punishing and in sparing them\nthan to be good only in punishing them” (P 9). So\nGod’s supreme goodness requires that he be both just and\nmerciful. But Anselm is not content to resolve the apparent tension\nbetween justice and mercy by appealing to some other attribute,\ngoodness, that entails both justice and mercy; he goes on to argue\nthat justice itself requires mercy. Justice to sinners obviously\nrequires that God punish them; but God’s justice to\nhimself requires that he exercise his supreme goodness in sparing\nthe wicked. “Thus,” Anselm says to God, “in saving\nus whom you might justly destroy … you are just, not because\nyou give us our due, but because you do what is fitting for you who\nare supremely good” (P 10). In spite of these\narguments, Anselm acknowledges that there is a residue of mystery\nhere:\n\nThus your mercy is born of your justice, since it is just for you to\nbe so good that you are good even in sparing the wicked. And perhaps\nthis is why the one who is supremely just can will good things for the\nwicked. But even if one can somehow grasp why you can will to save the\nwicked, certainly no reasoning can comprehend why, from those who are\nalike in wickedness, you save some rather than others through your\nsupreme goodness and condemn some rather than others through your\nsupreme justice. (P 11)\n\n\nIn other words, the philosopher can trace the conceptual relations\namong goodness, justice, and mercy, and show that God not only can but\nmust have all three; but no human reasoning can hope to show why God\ndisplays his justice and mercy in precisely the ways in which he does.\n(For a detailed and sympathetic reconstruction of Anselm’s\narguments concerning justice and mercy, see Mann 2019.)\n4. Freedom, Sin, and Redemption\n4.1 Truth in statements and in the will\n\nIn On Freedom of Choice (De libertate arbitrii)\nAnselm defines freedom of choice as “the power to preserve\nrectitude of will for its own sake” (DLA 3). He\nexplores the notion of rectitude of will most thoroughly in On\nTruth (De veritate), so in order to understand the\ndefinition of freedom of choice, we must look first at Anselm’s\ndiscussion of truth. Truth is a much broader notion for Anselm than\nfor us; he speaks of truth not only in statements and opinions but\nalso in the will, actions, the senses, and even the essences of\nthings. In every case, he argues, truth consists in correctness or\n“rectitude.” Rectitude, in turn, is understood\nteleologically; a thing is correct whenever it is or does whatever it\nought, or was designed, to be or do. For example, statements are made\nfor the purpose of “signifying that what-is is”\n(DV 2). A statement therefore is correct (has rectitude)\nwhen, and only when, it signifies that what-is is. So Anselm holds a\ncorrespondence theory of truth, but it is a somewhat unusual\ncorrespondence theory. Statements are true when they correspond to\nreality, but only because corresponding to reality is what statements\nare for. That is, statements (like anything else) are true\nwhen they do what they were designed to do; and what they were\ndesigned to do, as it happens, is to correspond to reality.\n\nTruth in the will also turns out to be rectitude, again understood\nteleologically. Rectitude of will means willing what one ought to will\nor (in other words) willing that for the sake of which one was given a\nwill. So, just as the truth or rectitude of a statement is the\nstatement’s doing what statements were made to do, the truth or\nrectitude of a will is the will’s doing what wills were made to\ndo. In DV 12 Anselm connects rectitude of will to both\njustice and moral evaluation. In a broad sense of ‘just’,\nwhatever is as it ought to be is just. Thus, an animal is just when it\nblindly follows its appetites, because that is what animals were meant\nto do. But in the narrower sense of ‘just’, in which\njustice is what deserves moral approval and injustice is what deserves\nreproach, justice is best defined as “rectitude of will\npreserved for its own sake” (DV 12). Such rectitude\nrequires that agents perceive the rectitude of their actions and will\nthem for the sake of that rectitude. Anselm takes the second\nrequirement to exclude both coercion and “being bribed by an\nextraneous reward” (DV 12). For an agent who is coerced\ninto doing what is right is not willing rectitude for its own sake;\nand similarly, an agent who must be bribed to do what is right is\nwilling rectitude for the sake of the bribe, not for the sake of\nrectitude.\n\nSince, as we have already seen, Anselm will define freedom as\n“the power to preserve rectitude of will for its own\nsake,” the arguments of On Truth imply that freedom is\nalso the capacity for justice and the capacity for moral\npraiseworthiness. Now it is both necessary and sufficient for justice,\nand thus for praiseworthiness, that an agent wills what is right,\nknowing it to be right, because it is right. That an agent wills what\nis right because it is right entails that he is neither compelled nor\nbribed to perform the act. Freedom, then, must be neither more nor\nless than the power to perform acts of that sort.\n4.2 Freedom and sin\n\nThus Anselm takes it to be obvious that freedom is a power\nfor something: its purpose is to preserve rectitude of will\nfor its own sake. God and the good angels cannot sin, but they are\nstill free, because they can (and do) preserve rectitude of will for\nits own sake. In fact, they are freer than those who can sin:\n“someone who has what is fitting and expedient in such a way\nthat he cannot lose it is freer than someone who has it in such a way\nthat he can lose it and be seduced into what is unfitting and\ninexpedient” (DLA 1). It obviously follows, as Anselm\npoints out, that freedom of choice neither is nor entails the power to\nsin; God and the good angels have freedom of choice, but they are\nincapable of sinning.\n\nBut if free choice is the power to hold on to what is fitting and\nexpedient, and it is not the power to sin, does it make any sense to\nsay that the first human beings and the rebel angels sinned through\nfree choice? Anselm’s reply to this question is both subtle and\nplausible. In order to be able to preserve rectitude of will for its\nown sake, an agent must be able to perform an action that has its\nultimate origin in the agent him- or herself rather than in some\nexternal source. (For convenience I will refer to that power as\n“the power for self-initiated action.”) Any being that has\nfreedom of choice, therefore, will thereby have the power for\nself-initiated action. The first human beings and the rebel angels\nsinned through an exercise of their power for self-initiated action,\nand so it is appropriate to say that they sinned through free\nchoice.  Nonetheless, free choice does not entail the power to\nsin. For free choice can be perfected by something else, as yet\nunspecified, that renders it incapable of sinning.\n\nIn On the Fall of the Devil (De casu diaboli) Anselm\nextends his account of freedom and sin by discussing the first sin of\nthe angels. In order for the angels to have the power to preserve\nrectitude of will for its own sake, they had to have both a will for\njustice and a will for happiness. If God had given them only a will\nfor happiness, they would have been necessitated to will whatever they\nthought would make them happy. Their willing of happiness would have\nhad its ultimate origin in God and not in the angels themselves. So\nthey would not have had the power for self-initiated action, which\nmeans that they would not have had free choice. The same thing would\nhave been true, mutatis mutandis, if God had given them only\nthe will for justice.\n\nSince God gave them both the will for happiness and the will for\njustice, however, they had the power for self-initiated action.\nWhether they chose to subject their wills for happiness to the demands\nof justice or to ignore the demands of justice in the interest of\nhappiness, that choice had its ultimate origin in the angels; it was\nnot received from God. The rebel angels chose to abandon justice in an\nattempt to gain happiness for themselves, whereas the good angels\nchose to persevere in justice even if it meant less happiness. God\npunished the rebel angels by taking away their happiness; he rewarded\nthe good angels by granting them all the happiness they could possibly\nwant. For this reason, the good angels are no longer able to sin.\nSince there is no further happiness left for them to will, their will\nfor happiness can no longer entice them to overstep the bounds of\njustice. Thus Anselm finally explains what it is that perfects free\nchoice so that it becomes unable to sin.\n4.3 Grace and redemption\n\nLike the fallen angels, the first human beings willed happiness in\npreference to justice. By doing so they abandoned the will for justice\nand became unable to will justice for its own sake. Apart from divine\ngrace, then, fallen human beings cannot help but sin. Anselm claims\nthat we are still free, because we continue to be such that if we had\nrectitude of will, we could preserve it for its own sake; but we\ncannot exercise our freedom, since we no longer have the\nrectitude of will to preserve. (Whether fallen human beings also\nretain the power for self-initiated action apart from divine grace is\na tricky question, and one I do not propose to answer here.)\n\nSo the restoration of human beings to the justice they were intended\nto enjoy requires divine grace. But even more is needed than\nGod’s restoration of the will for justice. In Cur Deus\nHomo (Why God Became A Human Being, or Why the\nGod-Man?) Anselm famously attempts to show on purely rational\ngrounds that the debt incurred by human sin could be suitably\ndischarged, and the affront to God’s infinite dignity could be\nsuitably rectified, only if one who was both fully divine and fully\nhuman took it upon himself to offer his own life on our behalf.\n",
    "bibliography": {
        "categories": [
            "<a name=\"CriEdi\">Critical Edition</a>",
            "<a name=\"Tra\">Translations</a>",
            "<a name=\"SecWor\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"CriEdi\">Critical Edition</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Niskanen, Samu, 2019. <em>Letters of Anselm of Canterbury, Vol. I:\nThe Bec Letters</em>, Oxford: Oxford University Press.",
                "Schmitt, Franciscus Salesius, 1936. “Ein neues unvollendetes\nWerk des hl. Anselm von Canterbury,” <em>Beiträge zur\nGeschichte der Philosophie und Theologie des Mittelalters</em> Band\n33, Heft 3 (1936): 22–43.",
                "Schmitt, Franciscus Salesius, 1968. <em>S. Anselmi Cantuariensis\nArchiepiscopi Opera Omnia</em>. Stuttgart-Bad Cannstatt: Friedrich\nFromann Verlag.\n</ul>\n<h3>"
            ],
            "<a name=\"Tra\">Translations</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Davies, Brian, and G. R. Evans (ed.), 1998. <em>Anselm of\nCanterbury: The Major Works</em>, Oxford: Oxford University\nPress.",
                "Williams, Thomas, 2007. <em>Anselm: Basic Writings</em>,\nIndianapolis: Hackett Publishing Company. As supplemented by the\n <a href=\"http://profthomaswilliams.com/anselm.html\" target=\"other\">Translations of Anselm</a>,\n this is the only English translation by a single hand of all of\nAnselm’s treatises; it also includes selected prayers and\nletters and the <em>Meditation on Human Redemption</em>.\n</ul>\n<h3>"
            ],
            "<a name=\"SecWor\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Baker, Lynne Rudder, 2013. “Updating Anselm Again,”\n<em>Res Philosophica</em>, 90: 23–32.",
                "Burgess-Jackson, Keith, 2014. “Does Anselm Beg the\nQuestion?,” <em>International Journal for Philosophy of\nReligion</em>, 76: 5–18.",
                "Campbell, Richard, 2018. <em>Rethinking Anselm’s Arguments:\nA Vindication of His Proof for the Existence of God</em>, Leiden:\nBrill.",
                "Davies, Brian, and Brian Leftow (eds.), 2004. <em>The Cambridge\nCompanion to Anselm</em>, Cambridge: Cambridge University Press.",
                "Ekenberg, Tomas, 2016. “Voluntary Action and Rational Sin in\nAnselm of Canterbury,” <em>International Journal for Philosophy\nof Religion</em>, 24: 215–230.",
                "Evans, G. R., 1978. <em>Anselm and Talking about God</em>, Oxford:\nClarendon Press.",
                "–––, 1984. <em>A Concordance to the Works of\nSaint Anselm</em>, Millwood, NY: Kraus International\nPublications.",
                "–––, 1989. <em>Anselm</em>, London: G. Chapman;\nreprinted 2001, London and New York: Continuum.",
                "Gasper, G. E. M., and I. Logan (eds.), 2012. <em>Saint Anselm of\nCanterbury and His Legacy</em>, Toronto: Pontifical Institute of\nMedieval Studies.",
                "Heathwood, Chris, 2011. “The Relevance of Kant’s\nObjection to Anselm’s Ontological Argument,” <em>Religious\nStudies</em>, 47: 345–357.",
                "Henry, Desmond Paul, 1967. <em>The Logic of Saint Anselm</em>,\nOxford: Clarendon Press.",
                "Holopainen, Toivo, 1996. <em>Dialectic and Theology in the\nEleventh Century</em>, Leiden: E. J. Brill.",
                "–––,2020. <em>A Historical Study of\nAnselm’s </em>Proslogion<em> Argument: Argument, Devotion\nand Rhetoric</em>, Leiden: E. J. Brill.",
                "Hopkins, Jasper, 1972. <em>A Companion to the Study of St.\nAnselm</em>, Minneapolis: University of Minnesota Press.",
                "Klima, Gyula, 2000. “Saint Anselm’s Proof: A Problem\nof Reference, Intentional Identity and Mutual Understanding”, in\nG. Hintikka (ed.), <em>Medieval Philosophy and Modern Times</em>\n(Proceedings of “Medieval and Modern Philosophy of\nReligion”, Boston University, August 25–27, 1992),\nDordrecht: Kluwer, pp. 69–88.\n [<a href=\"http://www.fordham.edu/gsas/phil/klima/anselm.htm\" target=\"other\">Preprint of Klima 2000 available online</a>]",
                "Leftow, Brian, 1997. “Anselm on the Cost of\nSalvation,” <em>Medieval Philosophy and Theology</em>, 6:\n73–92.",
                "–––, 2009. “Anselmian Presentism,”\n<em>Faith and Philosophy</em>, 26: 297–319.\n [<a href=\"https://place.asburyseminary.edu/cgi/viewcontent.cgi?article=2308&amp;context=faithandphilosophy\" target=\"other\">Leftow 2009 available online</a>.]",
                "Logan, Ian, 2009. <em>Reading Anselm’s Proslogion: The\nHistory of Anselm’s Argument and its Significance Today</em>,\nAldershot: Ashgate.",
                "Mann, William E., 2019. “Anselm on Divine Justice and\nMercy,” <em>Religious Studies</em>, 55: 469–485.",
                "Nash-Marshall, Siobhan, 2012. “Saint Anselm and the Problem\nof Evil, or On Freeing Evil from the Problem of Evil,”\n<em>International Philosophical Quarterly</em>, 52:\n455–470.",
                "Oppenheimer, P., and Zalta, E., 1991. “On the Logic of the\nOntological Argument,” <em>Philosophical Perspectives</em> 5:\n509–529; reprinted in <em>The Philosopher’s Annual:\n1991</em>, XIV (1993): 255–275.",
                "–––, 2007. “Reflections on the Logic of\nthe Ontological Argument,” <em>Studia Neoaristotelica</em>,\n4(1): 28–34.",
                "–––, 2011. “A Computationally-Discovered\nSimplification of the Ontological Argument,” <em>Australasian\nJournal of Philosophy</em>, 89(2): 333–349.",
                "Plantinga, Alvin (ed.), 1965. <em>The Ontological Argument</em>,\nGarden City, NY: Anchor Books.",
                "–––, 1974. <em>God, Freedom, and Evil</em>,\nGrand Rapids, MI: William B. Eerdmans.",
                "Rogers, Katherin A., 2007. “Anselmian Eternalism: The\nPresence of a Timeless God,” <em>Faith and Philosophy</em>, 24:\n3–27.\n [<a href=\"https://place.asburyseminary.edu/cgi/viewcontent.cgi?article=2060&amp;context=faithandphilosophy\" target=\"other\">Rogers 2007 available online</a>.]",
                "–––, 2009. <em>Anselm on Freedom</em>, Oxford:\nOxford University Press.",
                "–––, 2012. “Anselm on the Ontological\nStatus of Choice,” <em>International Philosophical\nQuarterly</em>, 52: 183–198.",
                "Smith, A.D., 2014. <em>Anselm’s Other Argument</em>,\nCambridge, MA: Harvard University Press.",
                "Southern, R. W., 1990. <em>Saint Anselm: A Portrait in\nLandscape</em>, Cambridge: Cambridge University Press.",
                "Stone, Jim, 1989. “Anselm’s Proof,” <em>Philosophical\nStudies</em>, 57: 79–94.",
                "Special Issue, 2011. <em>International Journal for Philosophy of\nReligion</em>, Volume 69.",
                "Sweeney, Eileen, 2012. <em>Anselm of Canterbury and the Desire for\nthe Word</em>, Washington, D.C.: Catholic University of America\nPress.",
                "Uckelman, Sara L., 2010. “The Ontological Argument and\nRussell’s Antinomy,” <em>Logic and Logical\nPhilosophy</em>, 18: 309–312.",
                "Visser, Sandra, and Thomas Williams, 2008. <em>Anselm</em> (Great\nMedieval Thinkers), New York: Oxford University Press.",
                "Ward, Thomas M., 2018. “Losing the Lost Island,”\n<em>International Journal for Philosophy of Religion</em>, 83:\n127–134.",
                "Williams, Thomas, 2016. “Anselm’s Quiet\nRadicalism,” <em>British Journal for the History of\nPhilosophy</em>, doi:10.1080/09608788.2015.1047734,\n [<a href=\"http://shell.cas.usf.edu/~thomasw/Anselm's%20Quiet%20Radicalism.pdf\" target=\"other\">Preprint of Williams 2016 available online</a>]",
                "–––, 2023. <em>Anselm: A Very Short\nIntroduction</em>, Oxford: Oxford University Press.",
                "Wolterstorff, Nicholas, 1993. “In Defense of Gaunilo’s\nDefense of the Fool,” in C. Stephen Evans and Merold Westphal\n(eds.), <em>Christian Perspectives on Religious Knowledge</em>, Grand\nRapids, MI: William B. Eerdmans Publishing Company, pp.\n87–111.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<p>\nReferences in this article to Anselm’s works use the following\nabbreviations:</p>\n<table class=\"cell-rl cellpad-small-dense indent\">\n<tbody>\n<tr>\n<td><em>DLA</em></td>\n<td>=</td>\n<td><em>De libertate arbitrii</em></td> </tr>\n<tr>\n<td><em>DV</em></td>\n<td>=</td>\n<td><em>De veritate</em></td> </tr>\n<tr>\n<td><em>M</em></td>\n<td>=</td>\n<td><em>Monologion</em></td> </tr>\n<tr>\n<td><em>P</em></td>\n<td>=</td>\n<td><em>Proslogion</em></td> </tr> </tbody>\n</table>\n<p>\nAll translations are my own.</p>\n<h3><a name=\"CriEdi\">Critical Edition</a></h3>\n<ul class=\"hanging\">\n<li>Niskanen, Samu, 2019. <em>Letters of Anselm of Canterbury, Vol. I:\nThe Bec Letters</em>, Oxford: Oxford University Press.</li>\n<li>Schmitt, Franciscus Salesius, 1936. “Ein neues unvollendetes\nWerk des hl. Anselm von Canterbury,” <em>Beiträge zur\nGeschichte der Philosophie und Theologie des Mittelalters</em> Band\n33, Heft 3 (1936): 22–43.</li>\n<li>Schmitt, Franciscus Salesius, 1968. <em>S. Anselmi Cantuariensis\nArchiepiscopi Opera Omnia</em>. Stuttgart-Bad Cannstatt: Friedrich\nFromann Verlag.</li>\n</ul>\n<h3><a name=\"Tra\">Translations</a></h3>\n<ul class=\"hanging\">\n<li>Davies, Brian, and G. R. Evans (ed.), 1998. <em>Anselm of\nCanterbury: The Major Works</em>, Oxford: Oxford University\nPress.</li>\n<li>Williams, Thomas, 2007. <em>Anselm: Basic Writings</em>,\nIndianapolis: Hackett Publishing Company. As supplemented by the\n <a href=\"http://profthomaswilliams.com/anselm.html\" target=\"other\">Translations of Anselm</a>,\n this is the only English translation by a single hand of all of\nAnselm’s treatises; it also includes selected prayers and\nletters and the <em>Meditation on Human Redemption</em>.</li>\n</ul>\n<h3><a name=\"SecWor\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Baker, Lynne Rudder, 2013. “Updating Anselm Again,”\n<em>Res Philosophica</em>, 90: 23–32.</li>\n<li>Burgess-Jackson, Keith, 2014. “Does Anselm Beg the\nQuestion?,” <em>International Journal for Philosophy of\nReligion</em>, 76: 5–18.</li>\n<li>Campbell, Richard, 2018. <em>Rethinking Anselm’s Arguments:\nA Vindication of His Proof for the Existence of God</em>, Leiden:\nBrill.</li>\n<li>Davies, Brian, and Brian Leftow (eds.), 2004. <em>The Cambridge\nCompanion to Anselm</em>, Cambridge: Cambridge University Press.</li>\n<li>Ekenberg, Tomas, 2016. “Voluntary Action and Rational Sin in\nAnselm of Canterbury,” <em>International Journal for Philosophy\nof Religion</em>, 24: 215–230.</li>\n<li>Evans, G. R., 1978. <em>Anselm and Talking about God</em>, Oxford:\nClarendon Press.</li>\n<li>–––, 1984. <em>A Concordance to the Works of\nSaint Anselm</em>, Millwood, NY: Kraus International\nPublications.</li>\n<li>–––, 1989. <em>Anselm</em>, London: G. Chapman;\nreprinted 2001, London and New York: Continuum.</li>\n<li>Gasper, G. E. M., and I. Logan (eds.), 2012. <em>Saint Anselm of\nCanterbury and His Legacy</em>, Toronto: Pontifical Institute of\nMedieval Studies.</li>\n<li>Heathwood, Chris, 2011. “The Relevance of Kant’s\nObjection to Anselm’s Ontological Argument,” <em>Religious\nStudies</em>, 47: 345–357.</li>\n<li>Henry, Desmond Paul, 1967. <em>The Logic of Saint Anselm</em>,\nOxford: Clarendon Press.</li>\n<li>Holopainen, Toivo, 1996. <em>Dialectic and Theology in the\nEleventh Century</em>, Leiden: E. J. Brill.</li>\n<li>–––,2020. <em>A Historical Study of\nAnselm’s </em>Proslogion<em> Argument: Argument, Devotion\nand Rhetoric</em>, Leiden: E. J. Brill.</li>\n<li>Hopkins, Jasper, 1972. <em>A Companion to the Study of St.\nAnselm</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Klima, Gyula, 2000. “Saint Anselm’s Proof: A Problem\nof Reference, Intentional Identity and Mutual Understanding”, in\nG. Hintikka (ed.), <em>Medieval Philosophy and Modern Times</em>\n(Proceedings of “Medieval and Modern Philosophy of\nReligion”, Boston University, August 25–27, 1992),\nDordrecht: Kluwer, pp. 69–88.\n [<a href=\"http://www.fordham.edu/gsas/phil/klima/anselm.htm\" target=\"other\">Preprint of Klima 2000 available online</a>]</li>\n<li>Leftow, Brian, 1997. “Anselm on the Cost of\nSalvation,” <em>Medieval Philosophy and Theology</em>, 6:\n73–92.</li>\n<li>–––, 2009. “Anselmian Presentism,”\n<em>Faith and Philosophy</em>, 26: 297–319.\n [<a href=\"https://place.asburyseminary.edu/cgi/viewcontent.cgi?article=2308&amp;context=faithandphilosophy\" target=\"other\">Leftow 2009 available online</a>.]</li>\n<li>Logan, Ian, 2009. <em>Reading Anselm’s Proslogion: The\nHistory of Anselm’s Argument and its Significance Today</em>,\nAldershot: Ashgate.</li>\n<li>Mann, William E., 2019. “Anselm on Divine Justice and\nMercy,” <em>Religious Studies</em>, 55: 469–485.</li>\n<li>Nash-Marshall, Siobhan, 2012. “Saint Anselm and the Problem\nof Evil, or On Freeing Evil from the Problem of Evil,”\n<em>International Philosophical Quarterly</em>, 52:\n455–470.</li>\n<li>Oppenheimer, P., and Zalta, E., 1991. “On the Logic of the\nOntological Argument,” <em>Philosophical Perspectives</em> 5:\n509–529; reprinted in <em>The Philosopher’s Annual:\n1991</em>, XIV (1993): 255–275.</li>\n<li>–––, 2007. “Reflections on the Logic of\nthe Ontological Argument,” <em>Studia Neoaristotelica</em>,\n4(1): 28–34.</li>\n<li>–––, 2011. “A Computationally-Discovered\nSimplification of the Ontological Argument,” <em>Australasian\nJournal of Philosophy</em>, 89(2): 333–349.</li>\n<li>Plantinga, Alvin (ed.), 1965. <em>The Ontological Argument</em>,\nGarden City, NY: Anchor Books.</li>\n<li>–––, 1974. <em>God, Freedom, and Evil</em>,\nGrand Rapids, MI: William B. Eerdmans.</li>\n<li>Rogers, Katherin A., 2007. “Anselmian Eternalism: The\nPresence of a Timeless God,” <em>Faith and Philosophy</em>, 24:\n3–27.\n [<a href=\"https://place.asburyseminary.edu/cgi/viewcontent.cgi?article=2060&amp;context=faithandphilosophy\" target=\"other\">Rogers 2007 available online</a>.]</li>\n<li>–––, 2009. <em>Anselm on Freedom</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2012. “Anselm on the Ontological\nStatus of Choice,” <em>International Philosophical\nQuarterly</em>, 52: 183–198.</li>\n<li>Smith, A.D., 2014. <em>Anselm’s Other Argument</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Southern, R. W., 1990. <em>Saint Anselm: A Portrait in\nLandscape</em>, Cambridge: Cambridge University Press.</li>\n<li>Stone, Jim, 1989. “Anselm’s Proof,” <em>Philosophical\nStudies</em>, 57: 79–94.</li>\n<li>Special Issue, 2011. <em>International Journal for Philosophy of\nReligion</em>, Volume 69.</li>\n<li>Sweeney, Eileen, 2012. <em>Anselm of Canterbury and the Desire for\nthe Word</em>, Washington, D.C.: Catholic University of America\nPress.</li>\n<li>Uckelman, Sara L., 2010. “The Ontological Argument and\nRussell’s Antinomy,” <em>Logic and Logical\nPhilosophy</em>, 18: 309–312.</li>\n<li>Visser, Sandra, and Thomas Williams, 2008. <em>Anselm</em> (Great\nMedieval Thinkers), New York: Oxford University Press.</li>\n<li>Ward, Thomas M., 2018. “Losing the Lost Island,”\n<em>International Journal for Philosophy of Religion</em>, 83:\n127–134.</li>\n<li>Williams, Thomas, 2016. “Anselm’s Quiet\nRadicalism,” <em>British Journal for the History of\nPhilosophy</em>, doi:10.1080/09608788.2015.1047734,\n [<a href=\"http://shell.cas.usf.edu/~thomasw/Anselm's%20Quiet%20Radicalism.pdf\" target=\"other\">Preprint of Williams 2016 available online</a>]</li>\n<li>–––, 2023. <em>Anselm: A Very Short\nIntroduction</em>, Oxford: Oxford University Press.</li>\n<li>Wolterstorff, Nicholas, 1993. “In Defense of Gaunilo’s\nDefense of the Fool,” in C. Stephen Evans and Merold Westphal\n(eds.), <em>Christian Perspectives on Religious Knowledge</em>, Grand\nRapids, MI: William B. Eerdmans Publishing Company, pp.\n87–111.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Augustine, Saint",
            "Duns Scotus, John",
            "free will",
            "medieval philosophy",
            "ontological arguments"
        ],
        "entry_link": [
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../duns-scotus/": "Duns Scotus, John"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../medieval-philosophy/": "medieval philosophy"
            },
            {
                "../ontological-arguments/": "ontological arguments"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=anselm\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/anselm/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=anselm&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/anselm/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=anselm": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/anselm/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=anselm&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/anselm/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.newadvent.org/cathen/01546a.htm\" target=\"other\"><em>Catholic Encyclopedia</em> article on Anselm</a>",
            "<a href=\"http://www.jasper-hopkins.info/\" target=\"other\">Prof. Jasper Hopkins’s homepage</a>,\n including links to the Hopkins-Richardson translations of\nAnselm’s complete theological and philosophical treatises, as\nwell as some essays on Anselm."
        ],
        "listed_links": [
            {
                "http://www.newadvent.org/cathen/01546a.htm": "Catholic Encyclopedia article on Anselm"
            },
            {
                "http://www.jasper-hopkins.info/": "Prof. Jasper Hopkins’s homepage"
            }
        ]
    }
}