{
    "url": "arabic-islamic-mind",
    "title": "Arabic and Islamic Psychology and Philosophy of Mind",
    "authorship": {
        "year": "Copyright © 2012",
        "author_text": "Alfred Ivry",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2012</a> by\n\n<br/>\nAlfred Ivry\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Apr 18, 2008",
        "substantive revision Tue May 29, 2012"
    ],
    "preamble": "\n\n\n Muslim philosophers considered the quest\nfor knowledge as a divine command, and knowledge of the soul, and\nparticularly of the intellect, as a critical component of this quest.\nMastery of this subject provided a framework within which the mechanics\nand nature of our sensations and thoughts could be explained and\nintegrated, and offered the epistemological foundation for every other\nfield of inquiry. As opposed to the Occasionalist views of the\nMutakallimûn, the Muslim theologians, philosophers wished\nto anchor their knowledge of the world in a stable and predictable\nphysical reality. This entailed naturalizing the soul (nafs in\nArabic) itself, charting the relation between its external and internal\nsenses and between its imaginative and rational faculties. However, the\nultimate goal of this subject, conjunction of the intellect with\nuniversal truth, had a decidedly metaphysical and spiritual aspect.\n\n\n The psychological views delineated by\nAristotle were the dominant paradigm for Muslim philosophers, as\nmodified by Hellenistic variations expressing Platonic perspectives.\nThe ninth to the twelfth centuries is the period of rigorous\nphilosophizing that characterizes classical Islamic philosophy, and it\nis the period and subject with which this article is concerned. It is\ndivided as follows:\n",
    "toc": [
        {
            "#SouFirExpAlKinRaz": "1. Sources and First Expressions: Al-Kindî and Razi"
        },
        {
            "#AlFar": "2. Al-Fârâbî"
        },
        {
            "#Avi": "3. Avicenna"
        },
        {
            "#Ave": "4. Averroes"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Sources and First Expressions: Al-Kindî and Razi\n\n\n Aristotle's philosophy of mind in\nIslamic philosophy is a combination of what we would today call\npsychology and physiology, and is not limited to investigations of our\nrational faculty. However important, the “mind” or\nintellect, with its practical and theoretical aspects, is only part of\nthe falâsifa's “science of the\nsoul.” Their main sources are found in three Aristotelian\ntreatises: On the Soul (De anima), On Sense and Sensibilia\n(De Sensu et Sensibili), and On Memory and Recollection\n(De Memoria et Reminiscentia). The last two belong to a series\nof nine short physical treatises, called accordingly Parva\nNaturalia, and include two that deal with the related topic of\ndreams and prophesying by means of dreams.\n\n\n The De anima was fully translated\ninto Arabic in the ninth century C.E., the Parva Naturalia\npartially translated, including those treatises relevant to our topic.\nMuslim authors had access to Arabic translations of Hellenistic\ncommentaries on these works, particularly those done by Alexander of\nAphrodisias (third century c.e.) and Themistius (fourth\n century).[1]\nThe views of the\nMuslim philosophers reflect these various sources, and are\nthus “Aristotelian” in an attenuated sense, particularly as\nconcerns the role and entailments of the rational faculty.\n\n\n The scientifically rich Hellenistic\nculture to which Islam was heir is evident in the work of Abû\nYûsuf Ya‘qûb ibn Ishâq al-Kindî (d. c.870) and Abû\nBakr Muhammad ibn Zakariyya ibn Yahya al-Râzî (865-925 or 932).\nAl-Kindî, known as “the philosopher of the Arabs” for\nhis Arabian genealogy, was active, with others of his circle, in\nediting Arabic translations and paraphrases of both Aristotelian and\nNeoplatonic texts. He also was familiar with other branches of Greek\nscience, and wrote treatises on many diverse topics. His views on\npsychology were formed mainly by acquaintance with paraphrases made of\nDe anima, the Theology of Aristotle (An abridgement of\nPlotinus' Enneads) and the Book on the Pure Good (an\nabridgement of Proclus' Elements of Theology, known in Latin as\nLiber De Causis). An Arabic version of Euclid's Optics\nalso helped al-Kindî develop his theory of vision, expressed in his\nDe Aspectibus and two smaller treatises (extant in Arabic\nonly). Unfortunately, al-Kindî does not integrate his understanding\nof vision with other aspects of his psychology, the parts never\namounting to a whole, complete system. We have instead a fragmentary\nreport indicating directions in which al-Kindî was headed, and\nprobable sources with which he had some acquaintance.\n\n\n Thus, the De Aspectibus shows that\nal-Kindî favored an extramission view of vision, in which rays\nextend from the eyes to make contact with an object, enabling a person\nto see\n it.[2]\nFollowing Euclid's Optics ultimately, al-Kindî offers\ngeometrical demonstrations against both the alternative\n“intromission” view, and the view that fuses extramission\nwith intromission; views identified mostly with Aristotle's\nDe anima and Plato's Timaeus, respectively. In\nother treatises, however, al-Kindî may be more sympathetic to\nAristotle's understanding of vision, mixed with possible\nfamiliarity with relevant treatises of Ptolemy and John Philoponus.\n\n\n Al-Kindî's exposure to Plato and\nAristotle was through doxographies and paraphrases that attempted to\nharmonize their views, and that often grafted Gnostic and hermetic\nthemes onto a Platonic—more exactly \n Neoplatonic—trunk.[3]\nThus, his Statement\non the\n Soul,[4]\nwhich purports to give a summary of the views on the subject of\n“Aristotle, Plato, and other Philosophers,” emphasizes the\nimmortal nature of the soul; its origins as a tripartite unified\nsubstance created by God, which returns through various heavenly stages\nto be in proximity to its Creator, upon having lived a life controlled\nby its rational faculty. Indeed, the superior person\n(fâdil) who abjures physical desires and pursues wisdom\n(hikmah), justice, goodness and truth (these following from\nknowledge) resembles the\n Creator.[5]\nThis resemblance is elsewhere qualified to\npertain to God's activities, not to His\n essence.[6]\nAristotle is seen as in agreement\nwith this essential separation of soul and body, and the ability of the\nsoul to know things not given to empirical investigation.\n\n\n Al-Kindî is more conventional\nphilosophically in his magnum opus, On First Philosophy, when\nhe highlights the mechanics of perception as proceeding from the\nsensible object (via the sense organs) to the common sense, imagination\nand\n memory.[7]\nElsewhere, he mentions the role of the imagination in both abstracting\nand presenting images apart from their matter (Ivry, 135). The\nintellect deals with universals, as mentioned in On First Philosophy,\nwhereas particular, material objects are treated by the senses (and,\npresumably, the imagination and memory).\n\n\n The divergent sources present in\nAl-Kindî make their appearance again in his short treatise\nOn\n Intellect.[8]\nAristotle's Hellenistic commentators had long since elaborated on\nBook Three of his De anima, and discerned stages of cognition that the\nmaster had left too vague for their liking. In al-Kindî's\ncase, John Philoponus appears to have provided a model for\nal-Kindî's scheme of four kinds of intellect (Jolivet, pp.\n50–73; Endress, 197). The first intellect is that which is in act\nalways, a separate principle of intelligibility that contains the\nspecies and genera, i.e., the universals, of our world. This first\nintellect, like that of Alexander of\n Aphrodisias,[9]\nendows our potential intellects\n(the second intellect) with the abstract ideas they are capable of\nreceiving; which ideas become part of a (third) acquired but passive\nintellect. When active, however, the (fourth) intellect emerges as just\nthat, an intellect in act, in which its subject is united with its\nobject. As such, the first and fourth intellects are alike\nphenomenologically, though different quantitatively.\n\n\n The first and fourth intellects do not\nconjoin, though al-Kindî would have the perfect soul ascend to its\ncreator. Similarly, he is not explicit as to the relationship of the\nimagination and intellect; the imaginative forms, recognized as\npartially abstracted from matter, should provide the raw material for\nthe intellect, but it is not at all clear they do. The Platonic\ndisparagement of sensibilia may have affected al-Kindî here,\nleaving his psychology ultimately dualistic.\n\n\n Al-Razî, known to the Latin West as Rhazes\nand hence referred to usually as Razi, was similarly drawn to a\nPlatonically inspired view of the soul, colored by theosophic accounts\nof creation and salvation. While he agreed with Plato's notion of\na tripartite soul, Razi often spoke of three souls, the rational or\ndivine one enlisting the higher passions of the animal soul to control\nthe base appetites of the vegetative\n soul.[10]\nFollowing Hellenistic\ntradition, he locates the vegetative soul in the liver, the animal soul\nin the heart and the rational soul in the brain. While the physical\norgans of the two subordinate souls are sufficient to account for their\nactivities, the brain—seat of sensation, voluntary movement,\nimagination, thought and memory—is regarded merely as an\ninstrument of the rational soul, which is non-physical and\nimmortal.\n\n\n In an introductory medical treatise, Razi\ngoes into further physiological detail concerning the responsibilities\nof the various psychic organs. The special faculties required for the\nbrain to exercise its soul's dominion are identified as the\nimagination (here called wahm, a term that Avicenna was to\nadopt and expand upon); a cogitative power (al-fikr); and\nmemory (al-hifz).\n\n\n While Razi constructed his psychology with\neclectic borrowings from Plato, Galen and Aristotle, he is reported to\nhave gone further afield in metaphysics. He believed there were five\neternal cosmic principles, one of which was a world soul that needed\ndivine intervention to liberate it from the seductive and defiling\nmatter of the\n world.[11]\nThis is similar to the message he presents in\nAl-Tibb al-Ruhânî, that the immortal rational soul of\nan individual must strive to free itself from corporeal entanglements,\nlest it be reincarnated in another, not necessarily human, body.\n\n\n Razi's mythically based metaphysics,\ncoupled with his belief in the transmigration of the soul and a bold\nindifference to identifiably Islamic tenets, led to his marginalization\namong the faithful and philosophers alike. Nevertheless, Razi as well\nas al-Kindî sketched the components of cognition that later\nphilosophers were to develop.\n2. Al-Fârâbî\n\n\n This development owes a great deal to the work of Abu Nasr Muhammad\nibn Muhammad ibn Tarkhan al-Fârâbî (c. 870-950). A\nprolific author, Farabi, as he is often referred to in English,\nadopted and commented upon much of Aristotle's logical corpus,\nwhile turning to Plato for his political philosophy. His metaphysics\nand psychology were a blend of both traditions, establishing a\nmodified or Neoplatonised form of Aristotelianism which later\ngenerations adopted and adapted.\n\n\n Farabi's familiarity with Aristotle\nis evident in the summary sketch of his writings that he presents in\nThe Philosophy of Aristotle. The soul is defined as “that by\nwhich the animate substance—I mean that which admits of \n life—is realized as\n substance,”[12]\nserving the triple function of\nbeing a formal, efficient and final cause. For human beings, the\nintellect assumes the mantle of substance (Mahdi, 125), it being\n“a principle underlying the essence of man,” both an agent\nand final cause (Mahdi, 122). Specifically, it is the theoretical\nintellect that has this status, the practical intellect being\nsubsidiary to it. The final perfection of a person is found in the\nactualization of this theoretical intellect, its substance being\nidentical with its act.\n\n\n Beyond the individual intellect there lies a universal (though Farabi\ndoes not call it such) Active (or Agent) Intellect (al-‘aql\nal-fa‘âl). This is conceived as the formal principle\nof the soul, engendering in the potential intellect both the basic\naxioms of thought and the ability to receive all other intelligible\nnotions (Mahdi, 127). This external intellect is also the ultimate\nagent and final cause of the individual intellect. It both facilitates\nthe individual intellect's operations and, serving as an example\nof perfect being, draws it back towards itself through acts of\nintellection. The more the individual intellect in act is absorbed in\ntheoretical activity, the greater its accumulation of scientific\nknowledge; each step bringing it closer to that totality of knowledge\nand essential being encapsulated in the Agent Intellect.\n\n\n For Farabi, the individual intellect, even\nwhen perfected, can only come close to joining with the substance of\nthe Agent Intellect. This reprises a theme sounded in Aristotle's\nmetaphysics, in which the intellects of the heavenly spheres, desiring\nto be like the Intellect that is the Prime Mover, imitate it as best\nthey can. For Farabi, a person's ultimate happiness is found in\nthis approximation to the ideal.\n\n\n Farabi expounds upon this and other issues\npertaining to the soul in his wide-ranging masterpiece,\n“Principles of the Views of the Citizens of the\nPerfect\n State.”[13]\nHe recounts the various faculties of the soul, following the model of\nAristotle's De anima, emphasizing the presence of an\ninclination or propensity (nizâ‘) concomitant with\neach\n one.[14]\nThus,\nthe senses immediately like or dislike what they perceive, depending on\nwhether it is attractive or repulsive to them. This affective reaction\naccompanies the imaginative faculty as well as the practical intellect,\nwhich chooses its course of action accordingly.\n\n\n For Farabi, it is the faculty of will that\nis responsible for these desires and dislikes that occur in sensation\nand imagination, ultimately motivating the social and political\nbehavior of the individual (Walzer, 171–173). Farabi distinguishes\nbetween what must be the automatic response of animals to the affects\ncreated in their senses and imagination, and the conscious and\nconsidered response of human beings, assisted by their rational\nfaculty. The former response is attributed to “will” in\ngeneral (irâdah), the latter to “choice”\n(ikhtiyâr) (Walzer, 205).\n\n\n The intellect, considered as purely\nimmaterial, has no physical organ to sustain it, unlike the other\nfaculties of the soul. As Alexander of Aphrodisias, Farabi identifies\nthe heart as the “ruling organ” of the\n body.[15]\nAssisted by the\nbrain, liver, spleen and other organs, the heart provides the innate\nheat that is required by the nutritive faculty, senses and imagination\n(Walzer, 175–187).\n\n\n It is this innate heat that\npresumably is also responsible for the differences between the sexes,\nFarabi asserts. The greater warmth (as well as strength) in their\norgans and limbs make men generally more irascible and aggressively\nforceful than women, who in turn generally excel in the\n“weaker” qualities of mercy and\n compassion.[16]\nThe sexes are\nequal, however, as regards sensation, imagination and intellection.\n\n\n It would appear from this that Farabi has\nno problem in seeing both sexes as equal in terms of their cognitive\nfaculties and capabilities. This would seem to be part of his Platonic\nlegacy, a view shared by Averroes in his paraphrase of the Republic\n(Walzer, 401, note 421). In theory, therefore, Farabi would consider\nwomen capable of being philosophers (as well as prophets), able to\nattain the happiness and perfection this brings.\n\n\n Possible as this is, and necessary\neven in theory, Farabi does not elaborate on this view, in deference\nundoubtedly to Islamic conventions. He is more explicit as regards the\nprocess of intellection, a topic that he covers here and in greater\ndetail in a separate treatise, On the Intellect.\n\n\n In the Perfect State, Farabi already\ncharacterizes the potential or “material” intellect, as\nAlexander called it, as a disposition in matter to receive intelligible\n“imprints” (rusûm al-ma‘qûlât)\n(Walzer, 199). These imprints originate as sensible forms that are\nconveyed to the imagination and modified by it before being presented\nto the intellect. The potential intellect is considered unable to\nrespond to these imaginative constructs on its own, it needs an agent\nto activate it, to move it from potentiality to actuality. This is\nAristotle's active intellect, as removed by Alexander of\nAphrodisias from the individual soul to a universal separate sphere of\nbeing. It is now associated with the tenth heavenly sphere (Walzer,\n203), being a separate substance that serves both as an emanating\nsource of forms in prophecy (Walzer, 221), and as a force in all people\nthat actualizes both potential intellects and potential intelligibles.\nFarabi compares its force to the light of the sun that facilitates\nvision by illuminating both the subject and object of sight (Walzer,\n201).\n\n\n With the assistance of this Agent\nIntellect, the potential intellect is able to receive all intelligible\nforms, beginning with “the first intelligibles which are common\nto all men,” in the areas of logic, ethics and science (Walzer,\n205). These first intelligibles represent the first perfection in a\nperson, the final perfection being possession of as many intelligible\nnotions as it is possible to acquire. This creates the felicity,\nal-sa‘âdah, human beings strive to attain, for it brings\nthem close to the divine status of the Agent Intellect, having\nconjoined with it as much as is possible.\n\n\n Farabi portrays the imaginative\n faculty[17]\nas having a\nmimetic capability, “imitating” the sensible forms\npreviously received yet not present until recalled to mind. This\nimitative ability extends over all the other faculties of the soul,\nincluding the intelligible notions of the rational faculty. Farabi\nadapts this originally Aristotelian\n idea[18]\nto prophecy as well as to\nlesser forms of divination, asserting that an individual imagination\ncan receive intelligible ideas directly from the Agent Intellect,\nconverting them to imaginative representations. Farabi believes the\nAgent Intellect emanates particular as well as universal intelligibles\nupon a given individual, expressing present as well as future events,\nand, for the prophet, particularized knowledge of eternal truths,\n“things divine” (ashyâ’u\nilâhîyah) (Walzer, 221–23).\n\n\n Farabi naturalizes prophecy by having the\nemanated forms received by the imagination pass on to the senses and\nthen out to the air. There they assume a sensible though immaterial\nform that then embarks on a conventional return trip to the internal\nsenses (Walzer, 223).\n\n\n Farabi's most detailed study of the\nintellect is to be found in the aptly titled “Epistle on the\n Intellect,” Risâla fi’l-‘Aql.[19]\nHe begins by showing the\ndiverse contexts in which nominal and verbal forms of\n“intellect” and “intelligence” are employed.\nAristotle, he points out, uses the term in his logical, ethical,\npsychological and metaphysical treatises. In each area, it is the\nintellect that is responsible for comprehending the first principles or\npremises of the subject, and for enabling a person to perfect his (or\nher) knowledge of it. For Farabi, this apparently innocuous statement\nmust serve to commend the epistemic methodologies of Aristotle over the\ndenaturalized, logically confined analyses of the\nmutakallimûn, the Muslim theologians. Yet, as emerges\nlater in the treatise, these first principles, seemingly innate to the\nintellect, are engendered there by the Agent Intellect (Bouyges, 29;\nHyman, 219). That universal intellect, for all its ontic priority, is\nthe last of the four intellects that Farabi formally discusses in the\ntreatise. It is a separate intellect, totally immaterial and external\nto the human intellect. Revising al-Kindi's schematization,\nand showing the influence of Alexander of Aphrodisias'\nunderstanding of Aristotle, Farabi posits a cognitive process in which\nthe human intellect moves from a state of potentiality to one of\nactuality, acquiring in the process a discrete sum of intelligibles\nthat it can access when desired.\n\n\n Ignoring here the role of sensation and\nimagination prior to the activity of the rational faculty, Farabi\ndescribes the potential intellect as prepared and disposed to abstract\nthe intelligible “essences” and forms of things from\ntheir\n matters.[20]\nThe\ndynamic readiness of the potential intellect to act is due, however, to\nthe Agent Intellect. It invests the sub-lunar world with the forms that\ncomprise all species, rendering them potentially intelligible; and\nenergizes our potential intellect to receive them (Bouyges, 24, 29;\nHyman, 218, 219).\n\n\n This reception of the intelligible\ntransforms the potential intellect from being a mere disposition to\nthink to the active thinking of the intelligible; a process in which\nthe “intellect in act” (al-‘aql bi’l-fi‘l)\nbecomes its intelligible (Bouyges, 15; Hyman, 216). The potential\nintellect itself remains unaffected by this metamorphosis, however, and\nremains purely potential, able to receive additional intelligible ideas\nobjectively. The greater the number of intelligibles deposited by the\nintellect in act in the “acquired intellect” (al-‘aql\nal-mustafâd), the more that intellect thinks itself in\nthinking them. In doing so, the acquired intellect imitates the Agent\nIntellect, which it increasingly resembles.\n\n\n Echoing a Neoplatonic hierarchy of being,\nFarabi ranks the intelligible order of our sub-lunar world, the Agent\nIntellect being at the top and prime matter at the bottom. Intellection\nof the separate, immaterial substances of the heavens, particularly\nintellection of the Agent Intellect, is the highest cognition\ndesirable, except that Farabi does not think it possible. Not even\nacquiring total or near-total knowledge of everything in our world will\nsuffice for Farabi; the formation of our intelligibles differs from\ntheir order in the Agent Intellect, and there is a qualitative\ndifference between their presence in it and as known to us; we must\nmake do with imitations or likenesses (ashbâh) of the pure\nintelligibles (Bouyges, 29; Hyman, 219).\n\n\n Nevertheless, the formation of a\nsubstantial amount of knowledge, or in Farabian terms, a strong\nacquired intellect, is that which forms and enriches us, creating a\nsubstance that in its immateriality resembles the Agent Intellect. This\nrepresents “ultimate happiness” (al-sa‘âdah\nal-quswâ), and even an afterlife (al-hayâh\nal-âkhîrah) of sorts (Bouyges, 31; Hyman, 220).\n\n\n Farabi holds diverse views on immortality,\nnow identifying it with a perfected intellect, now with the entire\nsoul, though his justification for positing an eternal individual soul\nor intellect is weak (Davidson 1992, 56–57). As with his more detailed\ntreatment of prophecy, Farabi may prudently be appropriating the\nreligious belief in an afterlife, a tenet held fervently—and\nvery differently—by his community.\n3. Avicenna\n\n\nAvicenna (Abû ‘Alî al-Husayn b.‘Abd Allah Ibn Sînâ,\nd. 1037), the multi-talented and prodigiously productive\nfaylasûf whose work had the greatest impact among later\nMuslim thinkers, unequivocally posited an independent, self-conscious, substantial\nand immortal soul, and with it asserted its\nimmortality. Avicenna could do this, following Plato rather than\nAristotle in positing an essential separation of body and soul.\nAvicenna opens his chapter on the soul in the encyclopedic work\nAl-Shifâ’ (known in English both as “The\nHealing” and “The Cure”) asserting this\nseparate\n existence.[21]\nLater, in both The Healing itself and in its abridged form of the\nNajât (called both “The Deliverance,” and\n“The\n Salvation”),[22]\nAvicenna presents arguments to support this\nclaim.\n\n\n He views the physical, corruptible body in\nall its parts, including the formal components, as irreconcilably other\nthan the purely immaterial soul, such that the latter cannot be an\nessential form of the former. Rather, the soul is in an accidental\nrelation to a particular body, occasioned by the generation of that\nbody and its need for a central organizing and sustaining principle.\nThe soul itself is generated by the separate intelligences of the\nheavens and emanated by them upon the body, having a natural\ninclination, or proclivity, nizâ‘, for the body that has\ncome into\n being.[23]\n\n\n The soul is individuated by the particular\nnature of its designated body, which it strives to bring to moral and\nintellectual perfection. Being essentially immaterial, the soul does\nnot perish with the body, and even retains its individuality, i.e., the\nimages and intelligible ideas it amassed during its sojourn on\n earth.[24]\nAvicenna\nattributes self-consciousness to the soul, an ego that has\nself-awareness and is not to be identified unilaterally with the\nrational faculty (Rahman 1952, 66). Depending primarily on the amount\nof knowledge it accumulated, but also on the life the person lived,\nwith its virtues or vices, the immortal soul experiences continuous\npleasure or\n pain.[25]\n\n\n In this manner, both philosophically and\ntheologically, Avicenna goes beyond his Aristotelian and Muslim\npredecessors. He does this by combining Aristotelian and Neoplatonic\nmotifs in his\n epistemology.[26]\n\n\n The deviation from the hylomorphic ontology\nof Aristotle is apparent in the famous thought experiment that Avicenna\ndevises, conceiving of a person suspended in air in total isolation\nfrom any physical or sensory\n experience.[27]\nThe purport of this experiment\nis to show the ability of a person to deduce the soul's existence\nintellectually, without assistance from the sensory or imaginative,\nmaterial faculties of the soul. For Avicenna this proves that the soul\nis an independent intelligent substance, both prior to involvement with\nthe world, and afterwards, when the corporeal organs that service the\nsoul perish.\n\n\n Avicenna's depiction of the five\nexternal faculties of the soul follows Aristotle's De\nanima, the senses receiving the impressions of their designated\nsensible objects by intromission. In his discussion of the internal\nsenses, however, Avicenna significantly modifies the Aristotelian\ntradition that he received. The more he considered the matter, the more\nhe deviated from Aristotle, in a Platonic direction.\n\n\n Avicenna located the internal senses\nin three ventricles of the brain, placing two in each ventricle, with\nreceptive and retentive capacities\n respectively.[28]\nThe common sense and (one\naspect of) the imaginative faculty comprise the first pair, located in\nthe front ventricle of the brain. The common sense coordinates the\nimpressions received by the individual senses, in order to produce a\nunified picture of a sensible object. This includes, as Aristotle said,\nimpressions that are related incidentally (kata\nsymbebekê) to the\n object,[29]\na phenomenon that links memory of past\nsensible impressions to a current sensation. This indicates a certain\ncapacity to make judgments present already in the common sense.\n\n\n The sensible forms that the common sense\nreceives and unifies are then transmitted to the imaginative faculty,\nas Aristotle had said; except that Avicenna divides this faculty,\ncalling the first appearance a quwwah musawwirah, or\nkhayâl. It retains these forms fully, and is thus called\nin English, after the Arabic, the “retentive” as well as\n“informing,” or “formative,”\n imagination.[30]\n\n\n The middle ventricle is the location of the\nnext pair of internal senses, as Avicenna first conceived them. They\ncomprise a novel faculty of “estimation” (following the\nLatin aestimatio), wahm in Arabic; and a second,\nchameleon type faculty. It functions both imaginatively (in animals and\nhumans), and rationally (in humans alone). As another aspect of the\nimaginative faculty, Avicenna calls it simply\nal-mutakhayyîlah, “the imagination,” but due to its\nfunction it is known as the “compositive imagination.”\nHowever, when this faculty deals with specific, materially based\nconcepts, Avicenna calls it qûwah mufakkirah, a thinking\nor “cogitative” faculty.\n\n\n Avicenna posits the existence of an\nestimative faculty in order to explain the innate ability in all\nanimals (humans included) to sense a non-sensible intention\n(ma‘nan) that is intrinsic to the object as perceived by the\nsubject. Intentions are thus the extra-sensible properties that\nan object presents to an animal or person at the moment of perception.\nThese intentions affect the perceiver powerfully, such as the negative\nfeelings a sheep senses in perceiving a wolf, or the positive feelings\nsensed in perceiving a friend or\n child.[31]\n\n\n Avicenna does not limit wahm to\nanimals, as Averroes later\n assumed,[32]\nbut rather conceived it broadly, affecting\nlogical as well as physical subjects. He believed estimation grasps the\ncore characteristic of every discrete physical object, the intention\nthat distinguishes it from every other object.\n\n\n In addition to the faculty of estimation,\nand akin to it in being innate and spontaneous, Avicenna recognized,\nwith Aristotle, a faculty of intuition (hads) that is the key\nstep in obtaining certain knowledge. This is the ability a person has\nto discern suddenly the middle term of a putative syllogism, the\nproposition that anchors a particular\n argument.[33]\nAvicenna recognizes that\noccasionally brilliant individuals exist whose intuitive sense is so\ninnately strong that they can do without much prior experience,\nempirically or rationally. In extreme and rare cases, there are\nindividuals, like the prophets, with a developed intuitive acumen,\ndhakâ’ (Aristotle's anchinoia), that\nenables them to know instantly the entire subject matter of a given\nscience. While not part of his normative epistemology, Avicenna\nattempts to accommodate this phenomenon scientifically, seeing it not\nas an innate power of an internal sense, but as an expression, however\nrare, of the emanative powers of the Agent Intellect.\n\n\n Avicenna believes that the intentions that\nthe estimative faculty obtains are received in the third and rear\nventricle of the brain, in memory, hafizah . Memory shares the\nthird ventricle with a faculty of recollection (dhikr), which\nretains the estimative intentions ready for recall.\n\n\n Remembering for Avicenna thus consists in\nthe collation by the imaginative/cogitative faculty of estimative\nintentions on the one hand, and the appropriate sensible forms retained\nby the formative imagination, on the other. For that reason, this\n“second” aspect of the imaginative faculty is referred to as the\n“compositive imagination;” both it and the cogitative\nfaculty deal with specific sensible forms and concepts, respectively,\npresenting them exactly and completely. They do this by combining the\nimpressions received by the common sense and estimation, and separating\nout what is not relevant to the object.\n\n\n The cogitative faculty is primarily\nconcerned with practical issues rooted in material being, forming\njudgments based on empirical data with the help of innate powers of\nabstraction and logical acumen. In what may well be a nod to tradition,\nAvicenna counts the “reports (al-akhbâr) to which\nthe soul gives assent on account of unbroken and overwhelming tradition\n(shiddah al-tawâtur)” as a further credible source\nfor forming practical\n judgments.[34]\n\n\n For Avicenna, animals have this developed imaginative\nfaculty only. It allows them to represent to themselves that which they\nremember, and also affords them the ability, like human beings, to\ndream. The cogitative faculty in human beings, on the other hand,\nallows them to go beyond instinctive remembering, and introduces an\nelement of rational deliberation that is limited primarily to purely\nindividual, discrete objects and\n actions.[35]\n\n\n Avicenna considers estimation to be\ninvolved with the cogitative faculty in reconstructing a specific,\nphysically based concept. As such, it can influence that faculty, and\nwhen excessive, be responsible for the fantasies and fictions in our\ndreams and thoughts (Black 2000, 227–28). Similarly, the estimative\nfaculty can over-reach itself in logical matters by using the\nsyllogisms that it helped create to pass judgments on immaterial\nbeings, thus leading to false judgments in\n metaphysics.[36]\n\n\n As described, many of the internal senses,\nparticularly the extended activities of estimation and the cogitative\nfaculty, perform in ways that encroach upon the preserve of the\nrational faculty and threaten to compromise its objectivity and\nseparate, immaterial nature, damaging the soul in its quest for\nimmortal bliss. Consequently, in his later writings Avicenna distanced\nintuition from any physical base within estimation and the brain,\nlocating it amorphously in the soul as a divine emanation; and he\nlimited the internal faculty of cogitation to thinking of particular\nconceptual concepts\n only.[37]\n\n\n This attempt to separate the rational\nfaculty from the internal senses is echoed in Avicenna's\ntreatment of the stages in the development of the intellect. He views\nthe entire cognitive process in which the internal senses were\npreoccupied as a necessary (for most people) but insufficient condition\nfor possessing true knowledge. The efforts of the internal senses are\nseen in some of his major compositions as having but a propadeutic\neffect on the soul, preparing it to receive the universal intelligible\nnotions that are its ultimate goal and, ultimately, its sole concern.\nThese intelligible ideas are not abstracted from the imagination, as\nAristotle would have it, but come from the universal Agent Intellect,\ntransforming the purely potential and passive intellect into an\n acquired intellect (‘aql mustafâd).[38]\nThis is an active state of\ncognition, when the intellect is actively conjoined to its intelligible\nobject. Ultimately, this conjunction is with the Agent Intellect, the\nsource of all forms on earth.\n\n\n Avicenna also posits, as had\nAristotle originally, the existence of an intermediate stage of\npotentiality, calling it an “intellect in habitu”\n(al-‘aql bi’l-malakah). At this stage, the\nintellect's acquired intelligibles are not being used, and are\ntherefore\n potential.[39]\nHowever, treating the active acquired\nintellligibles as potential seemed contradictory to Avicenna, so he\nreturns them to the Agent Intellect, where they are deposited and await\nrecollection by the intellect in habitu. This intellect does\nnot therefore store the acquired intelligibles, but merely serves to\nfacilitate their reacquisition from the Agent\n Intellect.[40]\n\n\n The Agent intellect is, then, the source of\nintelligible forms on earth, and the source of our being able to\nconceive of them. It functions much as does the sun, illuminating both\nsubject and object of intellection, and is present at every stage of\nthe individual person's intellectual development (Davidson 1992,\n86, 87, 92).\n\n\n While most people require preliminary\ntraining of the senses to prepare their souls for intellectual\ncognition, which the Agent Intellect automatically\n grants,[41]\nsome few\nindividuals with prodigious intuitions can, as we saw, grasp\nintelligible concepts and propositions immediately. Avicenna labels the\nintellects of such intuitively endowed persons “holy”\n(‘aql qudsî), and calls the Agent Intellect the\n “Holy Spirit” (al-rûh al-qudsî).[42]\nProphets have\nthis sense to an extreme degree, receiving emanations of all, or nearly\nall, of the intelligible forms in the Agent Intellect. It is “not\nfar-fetched” (wa lâ yab‘ud), Avicenna says, that the\nimaginative faculties of such persons are able to depict the emanated\nuniversal intelligible forms in particular, sensory,\n terms.[43]\n\n\n Prophecy is thus a natural, if exceptional,\noccurrence for Avicenna, who equivocates on the issue of personal\nprovidence. However much God is the final cause of intellection, He is\nnot directly involved in the entire process, a sanctified Agent\nIntellect being His intermediary to man. Here as elsewhere, we see\nAvicenna attempt to accommodate his philosophy to traditional religious\nconceptions.\n\n\n Avicenna has severed the natural link\nbetween imagination and intellection, in order to preserve the\nimmaterial and immortal nature of the soul. It is dependent on the\nAgent Intellect entirely, with only the soul's independent\nsubstantiality separating it from being totally absorbed in it.\n4. Averroes\n\n\n Averroes (Abu’l-Walîd Muhammad b.\nAhmad ben Rushd, 1126–98) hews closer to the Peripatetic tradition than\nhis predecessors, and it is as The Commentator on Aristotle that he was\nknown in Europe. He commented on De anima three times, and\nwrote an epitome of the Parva Naturalia. His Short Commentary\non De anima is also, and more correctly, an epitome, being a\nsummary of Aristotle's work rather than a precise and more\nliteral commentary, as are his Middle and Long, or\nGrand,\n commentaries.[44]\nIn the Short Commentary, Averroes sets the stage for Aristotle's\ndescription of the soul by offering a capsule summary of his main\nteachings in physics, meteorology, and physiology. These mainly concern\nthe hylomorphic composition of all bodies; the nature of the four\nelements; and the generative role in an organism caused by the heavenly\nbodies and by the innate heat, or pneuma, of a\n body.[45]\nThe soul,\nAverroes thus indicates, is the product of natural causes, both\nproximate and remote, terrestial and celestial. Among the latter is the\nAgent Intellect, whose relation to bodies, like that of the other\nheavenly intelligences, is “incidental” (or\n“accidental,” bi’l-‘araḍ), since it is\nessentially “separate” from them, being immaterial.\n\n\n Averroes stresses the hierarchical\nstructure of the soul, beginning with the nutritive faculty. It serves\nas a substrate for the sensory faculties, their matter\n“disposed” to receive sensory perceptions. This disposition\nis the first perfection or actuality of the sensory faculty, rendering\nthat faculty's potentiality an actual, if still unrealized, state\nof being. The higher faculty is thus present, albeit potentially, in\nthe lower.\n\n\n Each faculty is similarly sustained by one\nmore material, or less “spiritual,” than it: the senses\nserve as substrate for the common sense, it the substrate for the\nimagination, and that faculty the substrate for the rational\n faculty.[46]\nAs such, the\nimagination follows the senses in providing the intellect with images\nthat have intelligible dimensions, or “intentions”\n(ma‘ânî), which term Averroes uses more broadly than\nheretofore. These intentions are present in the form presented to the\nsenses, but must wait upon an intellect to appreciate them, being\nrepresented first as sensible and then imaginative intentions to the\nsenses and imagination, respectively. Averroes thus employs\n“intentions” to convey not the form of the perceptible\nobject as it is, but as it is sensed, imagined, remembered or\nintellected by the respective faculties of the soul.\n\n\n Averroes' contribution to the\nphilosophy of mind lies primarily in his attempt to refine and redefine\nthe activities of the internal senses, and to determine the nature of\nthe hylic, or material, intellect. He discusses the role of the\ninternal senses primarily in his De anima commentaries as well\nas in his epitomes on the senses and memory. His work builds on\nAristotle and the psychological writings of his Andalusian predecessor\nIbn Bâjjah (d. 1138), known to the West as\n Avempace.[47]\nAverroes'\nwork also incorporates a response and rebuke to Avicenna, rejecting,\namong other things, his elevation of wahm, estimation, to the\nstatus of an additional internal sense. For Averroes, imagination and\nmemory can do the work of Avicenna's estimative faculty.\n\n\n Aristotle had begun his\ntreatise On Memory by distinguishing between the acts of remembering\nand recollecting. He saw both as related to, though distinct from, the\ninternal senses (common sense and imagination) and the\nrational\n faculty.[48]\n\n\n In Aristotle's view, the\nimagination internalizes and copies an object originally presented to\nthe senses and assembled into a single sensation by the common sense;\nand the memorative faculty receives “some such thing as a\npicture” (zôgraphêma ti), “a sort of\nimpression” (tupon tina) of that percept (transmitted\nthrough the\n imagination).[49]\nRecollection is a deliberative act that joins\nthe impression retained in memory with the percept as originally\nimagined.\n\n\n Elaborating on Aristotle's text,\nAverroes regards memory as created by a process of continuous\nabstraction, or “spiritualization.” The form of an\nexternal object is sensed at first with its many “rinds” or\nhusks of corporeality (qushûr), for which read\nparticularity. The common sense and then the imaginative\n faculty[50]\nreceive\n(intentional adaptations of) this form in an increasingly immaterial\nmanner, followed by a “discriminating faculty,” i.e., the\ncogitative faculty, treated as another internal\n sense.[51]\nThis faculty actually serves\nas a bridge between imagination and intellect, dealing with particular\nimages as it does, but selecting out the most distinctive aspect of\neach percept. It brings the purification process to a close, memory\n(dhikr) receiving an essentialized notion or intention of a\nparticular\n percept.[52]\n\n\n Memory stores these dismembered\nessentialized images and is able to remember them at will, that is,\nwith an act of will. Recollection (tadhakkur) rejoins them in\nthe cogitative faculty with full images that flesh out the corporeal\nfeatures of the sought object. As described, there is a parallel\nbetween the activity of memory and that of the intellect in\nhabitu as developed by Alexander of Aphrodisias, for both retain\nthe essential notions that form respectively the previously apprehended\ncontents of a given particular percept (the role of memory) or of a\nuniversal concept (the intellect in habitu).\n\n\n While generally restricting the memorative\nfaculty to the intentions of a given imagined form, Averroes\nacknowledges that it also relates to universals. This is done through\nthe cogitative faculty, associating the universal with some particular\nimage, recollected with the assistance of the intention stored in the\nmemorative faculty; an “intention” that is the distinctive\ncharacter or nature of that\n image.[53]\nThat is to say, one remembers a universal\nidea by remembering an image that connotes it. As Aristotle says,\n“without an image, thinking is\n impossible.”[54]\n\n\n Averroes thus understands\nrecollection as a three-fold operation: the cogitative faculty employs\nthe intentions of an imagined form retained in memory, and combines\nthem with the original sensory image to elicit a full recollection of\nthe percept\n desired.[55]\nThe similarity of this scheme to that\ndeveloped by Avicenna is striking, though Averroes' scheme is\nmore parsimonious.\n\n\n Averroes recognizes with Avicenna\nthat animals have an acute intentional sense, and are able to identify\nnon-sensible qualities in the nature of others immediately, thereby\nenhancing their survival. Averroes considers this a function of the\nimagination, abetted by memory, and doesn’t grant it the status\nof an independent “estimative” faculty (wahm), not\nwanting to multiply the soul's faculties more than Aristotle\nhad\n done.[56]\n\n\n Averroes follows Galen and “the\nconsensus of opinion” rather than Aristotle in locating the\ninternal senses and memory in various parts of the brain: the common\nsense and imaginative faculty in the forward lobe, the cogitative\nfaculty in the middle, and memory in the\n rear.[57]\nGood memory is said to depend\non dryness in the front and back of the brain, poor memory due to\nmoisture that prevents images and ideas from retaining their hold. The\nbest disposition, manifest mostly in youth, is of a middle kind,\nenabling both quickness of understanding (the positive benefit of\nmoisture) and a long\n memory.[58]\n\n\n While the internal senses, as of course the\nexternal senses, have physical locations in the organs of the body, the\nrational faculty has not. That does not prevent Averroes from\nconceiving it as being structured in the hylomorphic pattern that is\ncharacteristic of Aristotle's physics. As expressed in the\nEpitome to De anima, it is the cogitative faculty, there\ncalled simply the practical intellect, which first processes sensory\nand imaginative intentions, exercising choice and deliberation along\nrational lines both inductive and deductive. This practical intellect\nthen serves as matter or substrate for its theoretical counterpart,\nwhich abstracts the universal idea or proposition from the particular\nsubject formerly\n addressed.[59]\n\n\n The theoretical intellect's striving\nfor universal truth is the acme of the soul's perfection, which\nAverroes calls a “very divine”\n pursuit,[60]\nthough he believes relatively\nfew individuals succeed at it. The ultimate knowledge sought is of the\nAgent Intellect itself. Mankind as a whole has not reached this level,\nbut it will one day, since “nature refuses” to allow all\ntrue (and finite) possibilities not to be eventually realized (given an\neternal\n universe).[61]\n\n\n While this statement is not repeated in his\nother two commentaries on De anima, Averroes' belief in the attainment\nof personal perfection through knowledge of the Agent Intellect\nremained constant. Every cognition of an intelligible is an act of\nidentification of subject and object, no material barrier existing\nbetween\n them.[62]\nKnowledge of the Agent Intellect,\nhowever, is thought to surpass everything else, its content uniquely\nand totally comprehensive. The species of all forms on earth are found\nunified in it in a way that renders it a single intelligible being.\n\n\n Averroes held to the view of the Agent\nIntellect as a form of (earthly) forms throughout his life, though his\nunderstanding of the relationship between it and the forms on earth\nunderwent change. While first thinking the Agent Intellect an emanative\nsubstance that bestowed forms on all sub-lunar substances, he later\nregarded it in Aristotelian terms simply as an efficient cause of\nintellection, “illuminating” or actualizing both the\npotentially intelligent subject and intelligible\n object.[63]\nHowever, as the\nultimate object of humanity's quest for knowledge, the Agent\nIntellect served as a final cause of intellection, conjunction with it\noffering a person the greatest felicity (sa‘âdah) one's\nsoul could have.\n\n\n For Averroes, as for his predecessors, the\nintellectual potentiality of a person, represented by the hylic or\nmaterial intellect, is brought into actuality by the Agent Intellect.\nThis creates a latent store of ideas, the intellect in habitu\n(al-‘aql bi’l malakah), which become operationally the\nacquired intellect (al-‘aql al-mustafâd). It is in this\nlast stage of the intellect's development that conjunction,\nittisâl, with the Agent Intellect, is experienced, it\nbeing a unification (ittihâd) of subject and\n object.[64]\n\n\n Averroes struggled more than his\npredecessors with the notion of the potential or “material”\nintellect. In the Epitome of De anima, he presents two positions, at\nfirst following an Alexandrian-Ibn Bâjjahian view that saw the\nmaterial intellect as a disposition in the body or imaginative faculty;\nand then, to guarantee its immaterial objectivity, as a substance\nessentially outside the\n soul.[65]\nThis latter view, reflecting that held by\nThemistius, is the one offered in the Long Commentary, to which he\nrefers the reader in what is an obvious recommendation of the position\nhe there\n holds.[66]\n\n\n Averroes, however, has a third position on\nthe nature of the material intellect. That is the view presented in his\nMiddle Commentary, which he may well have written after the Long\nCommentary, or, as more likely, after a first draft of\n it.[67]\nThe Latin West\nhad only the Long Commentary in translation, and was ignorant of the\nphilosophical alternative view of the material intellect presented in\nthe Middle commentary. Though of importance only to Averroistically\ninclined Jewish philosophers, who read it in Hebrew translation and\nlacked a Hebrew translation of the Long Commentary, the Middle\nCommentary's position has a certain coherence worth noting.\n\n\n As in his initial presentation in the Short\nCommentary, Averroes considers the material intellect, in the Middle\nCommentary, as relating directly to the imaginative faculty, or rather\nto the intelligible intentions to which that corporeal faculty is\ndisposed. Now, however, Averroes emphasizes that this relation to the\nimaginative faculty is “incidental” to the nature of the\nmaterial intellect, its essential relation being with the Agent\nIntellect. The material intellect is a temporary, discrete appearance\nin human beings of the eternal and always actual Agent intellect. It is\nour “first perfection,” while the Agent Intellect\nrepresents an ultimate perfection, or “final form”\nfor\n us.[68]\n\n\n The Middle Commentary fashions the material\nintellect from a fusion of the views of Alexander of Aphrodisias and\nThemistius. With Alexander, Averroes believes the material or potential\nintellect is a disposition or ability that the soul possesses to\nrepresent imaginative forms as abstract\n intelligibles;[69]\nwhile with Themistius,\nAverroes views the material intellect as a separate immaterial\nsubstance. It is, however, for Averroes in the Middle Commentary, but\nthe substrate of this separate substance, the Agent Intellect being its\nfull and eternally actual expression.\n\n\n In the Long Commentary, Averroes retains\nthe separate, i.e., immaterial yet substantial nature of the material\nand Agent intellects, and their relation of potential to actual\nintelligibility. However, he treats them as two separate substances,\nnot two aspects of the same intelligence. The material intellect is\nthus hypostatized, treated as a “fourth kind of being,” the\ncelestial principle of matter qua potentiality that, together\nwith the formal principle represented by the Agent Intellect, explains\nthe nature and activity of intelligible forms; even as sensible objects\nare constituted by similar hylomorphic\n principles.[70]\n\n\n The Long Commentary thus sees the material\nintellect as “the last of the separate intellects in the\n(celestial) hierarchy,” following the Agent\n Intellect.[71]\nThis physical\nrelocation of the material intellect may guarantee its incorruptibility\nand objectivity, for Averroes, but it does not explain the presence in\nhuman beings of a rational faculty, a presence that Averroes\nrecognizes. To that purpose, he enlarges the role of cogitation\n(fikr) in the cognitive process. As mentioned above, he sees\nit as a corporeal faculty located in the brain that is able to receive\nand process both the imaginative intentions found in sensation, and the\nintelligible intentions of the imagination, thereby initiating the\nprocess of abstraction and universalization that the material and Agent\nintellects\n complete.[72]\nAverroes also introduces in the Long\nCommentary a “passible intellect” that has a similar\ncorporeal nature and function, that of bridging the particular and\nuniversal domains of images and\n intelligibles.[73]\n\n\n Yet, for all his attempts in\nthe Long Commentary to distance the material intellect from an\nindividual corruptible body through what may be seen as surrogate\nintellectual powers, Averroes involves the material intellect, and even\nthe Agent Intellect, with a person's intellectual development.\nTheir presence is essential to the individual striving for rational\nperfection, however non-essential from the standpoint of the universal\nsubstances themselves. The location of these immaterial faculties in\nthe soul is nowhere explicit, neither in the Middle or Long\ncommentaries, but their function and internal dynamic is similarly\npresented. The individual perfects his/her intellect, and the more it\nis perfected, i.e., the more abstract truths accumulate, the less\nparticular and individual it is, the less it “belongs” to\nthat person. Ultimately, a person's fully realized intellect is\nable theoretically to conjoin with the Agent Intellect, all traces of\nindividuality excised.\n\n\n Averroes was aware that very few if any\nindividuals reach intellectual perfection, i.e., mastery of all there\nis to know, and even that person cannot maintain the state of\nconjunction indefinitely, being human and requiring food, drink, and\nnon-intellectual pursuits. So it is that Averroes, in all his\ncommentaries and other writings on the subject, does not deprecate the\nexistence in living beings of intellectual individuation. This was\nthought by many to be denied by Averroes' theory of monopsychism,\nin which there is but one material as well as agent intellect.\n\n\n In one of his minor essays on the topic,\nAverroes portrays the fully realized acquired intellect of a person as\nlosing its identity upon attaining conjunction with the\nAgent\n Intellect,[74]\nbeing totally absorbed in it. This can happen to the rare individual\nwhile alive, though it is a temporary state of being then. Upon the\ndemise of a body, however, the immaterial intellect of every one,\nhowever much or little developed, is enveloped within the one Agent\nIntellect. The contingent and material circumstances that brought the\nindividual to recognize universal truths and which affected the\nparticular composition of that person's soul do not endure, and\nthe universal intelligibles acquired have no substance with which to\nremain other than the Agent Intellect, where they are always\nrepresented.\n\n\n In conclusion, one may say that the\npsychology of the classical Muslim philosophers was torn between\nAristotelian and Neoplatonic perspectives, with attempted syntheses\nthat favored one perspective or another. The naturalism of Aristotle\nwas frequently subverted in the quest for a knowledge of universal\ntruths that promised eternal bliss, however philosophically difficult\nthat concept proved to be.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriSou\">Primary Sources</a>",
            "<a name=\"SecSou\">Secondary Sources</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Aristotle, 1995 Barnes, Jonathan, trans., <em>The Complete Works\nof Aristotle</em>. Princeton, Bollingen.",
                "Alfarabi, 1938 Bouyges Maurice, ed., <em>Risâlah fî\nl-‘Aql</em>. Beyrouth, Imprimerie Catholique.",
                "–––, 1962 Mahdi, Muhsin, trans<em>., Alfarabi's Philosophy of\nPlato and Aristotle</em>. Ithaca, Cornell University Press.",
                "–––, 1985 Walzer, Richard, <em>Farabi on the Perfect State</em>.\nOxford, Clarendon Press.",
                "Al-Kindî, 1950-53 Abû Rîdah, M.‘A.H., ed.,\n<em>Rasâ’il al-Kindî al-Falsafîya</em>. Cairo,\nDâr al-Fikr al-‘Arabî. 2 volumes.",
                "–––, 1974 Ivry, Alfred L., trans., <em>Al-Kindî's\nMetaphysics</em>. Albany, State University of New York Press.",
                "Avicenna, 1956 Bakos, Jân, ed. and trans.,<em>Psychologie\nD'Ibn Sînâ (Avicenne) d'après son\noeuvre ash-Shifâ</em><em>’</em>. Prague, Editions de\nl'Académie Tchécoslovaque des Sciences.",
                "–––, 1985 Fakhry, Majid, ed., <em>Avicenna: Kitâb\nal-Najât</em>. Beirut, Dâr al-ACIRCfâq al-Jadîdah.",
                "–––, 2005 Marmura, Michael, trans., <em>Avicenna: The Metaphysics of\nthe Healing</em>. Provo (Utah), Brigham Young University Press.",
                "–––, 1960 Moussa, Mohammad Youssef, Dunya, Solayman, Zayed, Sa’id,\nedd., <em>Avicenna's Metaphysics: Al-Shifâ’,\nAl-Ilâhiyyât</em>. Cairo, Organisme Général des\nImprimeries Gouvernementales.",
                "–––, 1952 Rahman, Fazlur, trans., <em>Avicenna's Psychology</em>:\nBook 2, Chapter 6 of Kitâb al-Najât. London, Oxford University\nPress. Reprint Westport, CT., Hyperion.",
                "–––, 1959 Rahman, Fazlur, ed., <em>Avicenna's De Anima: Being the\nPsychological Part of Kitâb Al-Shifâ’</em>. London,\nOxford University Press.",
                "Averroes, 1982 Bland, Kalman P., ed. and trans., <em>The Epistle\non the Possibility of Conjunction with the Active intellect by Ibn\nRushd with the Commentary of Moses Narboni</em>. New York, The Jewish\nTheological Seminary of America.",
                "–––, 1961 Blumberg, Harry, trans., <em>Epitome of Parva Naturalia</em>.\nCambridge, MA, The Mediaevel Academy of America; Arabic edition,\n1972.",
                "–––, 1930 Bouyges, Maurice, ed., <em>Averroes' Tahafot\nat-Tahafot</em>. Beyrouth, Imprimerie Catholique.",
                "–––, 1953 Crawford, F. Stuart, ed., <em>Averrois Cordubensis:\nCommentarium Magnum in Aristoteles De Anima Libros</em>. Cambridge,\nMA., The Mediaeval Academy of America.",
                "–––, 1954 Van Den Bergh, Simon, trans., <em>Averroes: Tahafut\nal-Tahafut</em>. London, Luzac.",
                "–––, 2002 Ivry, Alfred L., ed. and trans., <em>Averroës: Middle\nCommentary on Aristotle's De anima</em>. Provo (Utah), Brigham\nYoung University Press.",
                "–––, 1985 Nogales, Salvador Gómez, ed., <em>Epitome De\nAnima</em>. Madrid, Consejo Superior de Investigaciones Cientificas\nInstituto“Miguel Asín” Instituto Hispano-Arabe de\nCultura.",
                "–––, 1987 Nogales, Salvador Gómez, trans<em>., La\nPsicología de Averroes: Commentario al libro sobre el alma de\nAristóteles</em>. Madrid, Universidad Nacional de\nEducación a Distancia.",
                "–––, 2009 Taylor, Richard C., trans. Averroes\n(Ibn Rushd) of Cordova: Long Commentary on The De Anima of\nAristotle. New Haven, Yale University Press.",
                "Ibn Bâjjah, 1942 Palacios, Miguel Asin, ed. and trans.,\n“<em>Tratado de Avempace sobre la union del intellecto con el\nhombre</em>,” <em>Al Andalus</em> 7, 1–47.",
                "–––, 1960 al-Ma‘sûmî, Muhammad Saghîr Hasan,\ned., <em>Kitâb al-Nafs</em>. Damascus, al-Majma‘\nal-‘Ilmî al-‘Arabî.",
                "–––, 1961 al-Ma‘sûmî, Muhammad Saghîr Hasan, trans.,\n<em>‘Ilm al-nafs</em>, (Science of the Soul). Karachi: Pakistan\nHistorical Society. Reprinted by F. Sezgin, Publications of the\nInstitute for the History of Arabic and Islamic Science: Islamic\nPhilosophy 75, Franfkurt am Main, 1999.",
                "–––, 1968 Fakhry, Mâjid, ed., <em>Rasâ’il Ibn Bajja\nal-ilâhîya</em> (Opera Metaphysica). Beirut, Dâr\nal-Nahâr li-l-Nashr. Reprint 1990.",
                "–––, 1983 al-‘Alawî, Jamâl al-Dîn, ed.,\n<em>Rasâ’il falsafîya li-Abî Bakr Ibn Bâjja</em>.\nBeirut-Casablanca: Dâr al-Thaqâfa—Dâr al-Nashr\nal-Maghribîya.",
                "Razi, 1939 Kraus, Paul, ed., <em>Opera Philosophica</em>. Cairo,\nn.p.",
                "–––, 1950 Arberry, Arthur J. <em>The Spiritual Physick of Rhazes</em>.\nLondon, John Murray. Reprinted as <em>Razi's Traditional\nPsychology</em>, Damascus (n.p., n.d).\n</ul>\n<h3>"
            ],
            "<a name=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Adamson, Peter, 2006, “Vision, Light and Color in Al-Kindi,\nPtolemy and the Ancient Commentators,” <em>Arabic Sciences and\nPhilosophy</em>, 16: 207–36.",
                "Altmann, Alexander, 1965, “Ibn Bâjjah on Man's\nUltimate Felicity,” H.A. Wolfson Jubilee Volume (n.e.),\nJerusalem, The American Academy of Jewish Research, I:47–87.",
                "Arberry, Arthur J., 1964, <em>Aspects of Islamic Civilization</em>.\nLondon, George Allen &amp; Unwin.",
                "Black, Deborah L., 1993, “Estimation (<em>Wahm</em>) in\nAvicenna: The Logical and Psychological Dimensions.”\n<em>Dialogue</em> XXXII, 219–58.",
                "–––, 1996, “Memory, Individuals and the Past in\nAverroes's Psychology,” <em>Medieval Philosophy and\nTheology</em> 5, 161–87.",
                "–––, 2000, “Imagination and Estimation: Arabic\nParadigms and Western Transformations.” <em>Topoi</em> 19,\n59–75.",
                "D'Ancona Costa, Cristina, “Aristotelian and Neoplatonic\nelements in Kindî's Doctrine of Knowledge.” <em>American\nCatholic Philosophical Quarterly</em> LXXIII, 9–35.",
                "Davidson, Herbert A. 1992, <em>Alfarabi, Avicenna, &amp; Averroes,\non Intellect</em>. New York, Oxford University Press.",
                "Druart, Thérêse-Anne, 1988, “The soul and Body\nProblem: Avicenna and Descartes,” <em>Arabic Philosophy and the\nWest</em>, ed. Thérêse-Anne Druart. Washington, D.C.,\nCenter for Contemporary Arab Studies, Georgetown University,\n27–49.",
                "Endress, Gerhard, 1994, “Al-Kindî Über die\nWiedererinnerung der Seele.” <em>Oriens</em> 34, 174–219.",
                "Fakhry, Majid, 1970, <em>A History of Islamic Philosophy</em>. New\nYork, Columbia University Press.",
                "Gutas, Dimitri, 1988, <em>Avicenna and the Aristotelian\nTradition</em>. Leiden, Brill.",
                "–––, 2001, “Intuition and Thinking: The Evolving\nStructure of Avicenna's Epistemology,” <em>Aspects of\nAvicenna</em>, ed. Robert Wisnovsky. Princeton, Markus Wiener\nPublishers, 1–38.",
                "Hasse, Dag, 2000, <em>Avicenna's De anima in the Latin\nWest</em>. London, Warburg Institute.",
                "Hyman, Arthur and Walsh, James 1973. <em>Philosophy in the Middle\nAges</em>. Indianapolis, Hackett Publishing.",
                "Ivry, Alfred L., 1997, “Averroes' Short Commentary on\nAristotle's De anima,” <em>Documenti e Studi Sulla Tradizione\nFilosofica Medievale</em> VIII, 511–49.",
                "–––, 1999, “Averroes' Three Commentaries\non De anima,” in G. Endress and J.A. Aertsen, eds., <em>Averroes\nand the Aristotelian Tradition</em>. Leiden, Brill, 199–216.",
                "Janssens, Jules, 1987, “Ibn Sînâ's Ideas of\nultimate Realities, Neoplatonism and the Qur’ân as\nProblem-Solving paradigms in the Avicennian System.”\n<em>Ultimate Reality and Meaning</em> 10, 252–71.",
                "Jolivet, Jean, 1971, <em>L'Intellect selon Kindî</em>.\nLeiden, Brill.",
                "Michot, Jean R. 1986, <em>La destinée de l'homme\nselon Avicenne</em>. Louvain, Peeters.",
                "Peters, Francis, 1968, <em>Aristoteles Arabus</em>. Leiden, E.J.\nBrill.",
                "Rahman, Fazlur, 1958, <em>Prophecy in Islam</em>. London, George\nAllen &amp; Unwin.",
                "Sebti, Meryem, 2000, <em>Avicenne: L'ame humaine</em>.\nParis, Broché.",
                "Taylor, Richard, 1999, “Remarks on Cogitatio in Averroes'\nCommentarium Magnum in Aristotelis De anima Libros,” in\nG. Endress and J.A. Aertsen, eds., <em>Averroes and the Aristotelian\nTradition</em>. Leiden, Brill, 217–55.",
                "Taylor, Richard, 2005, “The Agent intellect as ‘form\nfor us’ and Averroes's Critique of\nal-Fârâbî,” <em>Proceedings of the society for\nMedieval Logic and Metaphysics</em>, 5, 18–32.",
                "Wolfson, Harry A. 1935, “The Internal Senses in Latin, Arabic and\nHebrew Philosophic Texts.” <em>Harvard Theological Review</em>, vol.\n28, 70–133; reprinted in Wolfson, <em>Studies in the History of\nPhilosophy and Religion</em>. Cambridge, MA, 1973, I: 250–314.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriSou\">Primary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Aristotle, 1995 Barnes, Jonathan, trans., <em>The Complete Works\nof Aristotle</em>. Princeton, Bollingen.</li>\n<li>Alfarabi, 1938 Bouyges Maurice, ed., <em>Risâlah fî\nl-‘Aql</em>.  Beyrouth, Imprimerie Catholique.</li>\n<li>–––, 1962 Mahdi, Muhsin, trans<em>., Alfarabi's Philosophy of\nPlato and Aristotle</em>. Ithaca, Cornell University Press.</li>\n<li>–––, 1985 Walzer, Richard, <em>Farabi on the Perfect State</em>.\nOxford, Clarendon Press.</li>\n<li>Al-Kindî, 1950-53 Abû Rîdah, M.‘A.H., ed.,\n<em>Rasâ’il al-Kindî al-Falsafîya</em>. Cairo,\nDâr al-Fikr al-‘Arabî. 2 volumes.</li>\n<li>–––, 1974 Ivry, Alfred L., trans., <em>Al-Kindî's\nMetaphysics</em>. Albany, State University of New York Press.</li>\n<li>Avicenna, 1956 Bakos, Jân, ed. and trans.,<em>Psychologie\nD'Ibn Sînâ (Avicenne) d'après son\noeuvre ash-Shifâ</em><em>’</em>. Prague, Editions de\nl'Académie Tchécoslovaque des Sciences.</li>\n<li>–––, 1985 Fakhry, Majid, ed., <em>Avicenna: Kitâb\nal-Najât</em>. Beirut, Dâr al-ACIRCfâq al-Jadîdah.</li>\n<li>–––, 2005 Marmura, Michael, trans., <em>Avicenna: The Metaphysics of\nthe Healing</em>. Provo (Utah), Brigham Young University Press.</li>\n<li>–––, 1960 Moussa, Mohammad Youssef, Dunya, Solayman, Zayed, Sa’id,\nedd., <em>Avicenna's Metaphysics: Al-Shifâ’,\nAl-Ilâhiyyât</em>. Cairo, Organisme Général des\nImprimeries Gouvernementales.</li>\n<li>–––, 1952 Rahman, Fazlur, trans., <em>Avicenna's Psychology</em>:\nBook 2, Chapter 6 of Kitâb al-Najât. London, Oxford University\nPress. Reprint Westport, CT., Hyperion.</li>\n<li>–––, 1959 Rahman, Fazlur, ed., <em>Avicenna's De Anima: Being the\nPsychological Part of Kitâb Al-Shifâ’</em>. London,\nOxford University Press.</li>\n<li>Averroes, 1982 Bland, Kalman P., ed. and trans., <em>The Epistle\non the Possibility of Conjunction with the Active intellect by Ibn\nRushd with the Commentary of Moses Narboni</em>. New York, The Jewish\nTheological Seminary of America.</li>\n<li>–––, 1961 Blumberg, Harry, trans., <em>Epitome of Parva Naturalia</em>.\nCambridge, MA, The Mediaevel Academy of America; Arabic edition,\n1972.</li>\n<li>–––, 1930 Bouyges, Maurice, ed., <em>Averroes' Tahafot\nat-Tahafot</em>. Beyrouth, Imprimerie Catholique.</li>\n<li>–––, 1953 Crawford, F. Stuart, ed., <em>Averrois Cordubensis:\nCommentarium Magnum in Aristoteles De Anima Libros</em>. Cambridge,\nMA., The Mediaeval Academy of America.</li>\n<li>–––, 1954 Van Den Bergh, Simon, trans., <em>Averroes: Tahafut\nal-Tahafut</em>. London, Luzac.</li>\n<li>–––, 2002 Ivry, Alfred L., ed. and trans., <em>Averroës: Middle\nCommentary on Aristotle's De anima</em>. Provo (Utah), Brigham\nYoung University Press.</li>\n<li>–––, 1985 Nogales, Salvador Gómez, ed., <em>Epitome De\nAnima</em>. Madrid, Consejo Superior de Investigaciones Cientificas\nInstituto“Miguel Asín” Instituto Hispano-Arabe de\nCultura.</li>\n<li>–––, 1987 Nogales, Salvador Gómez, trans<em>., La\nPsicología de Averroes: Commentario al libro sobre el alma de\nAristóteles</em>. Madrid, Universidad Nacional de\nEducación a Distancia.</li>\n<li>–––, 2009 Taylor, Richard C., trans. Averroes\n(Ibn Rushd) of Cordova: Long Commentary on The De Anima of\nAristotle. New Haven, Yale University Press.</li>\n<li>Ibn Bâjjah, 1942 Palacios, Miguel Asin, ed. and trans.,\n“<em>Tratado de Avempace sobre la union del intellecto con el\nhombre</em>,” <em>Al Andalus</em> 7, 1–47.</li>\n<li>–––, 1960 al-Ma‘sûmî, Muhammad Saghîr Hasan,\ned., <em>Kitâb al-Nafs</em>. Damascus, al-Majma‘\nal-‘Ilmî al-‘Arabî.</li>\n<li>–––, 1961 al-Ma‘sûmî, Muhammad Saghîr Hasan, trans.,\n<em>‘Ilm al-nafs</em>, (Science of the Soul). Karachi: Pakistan\nHistorical Society. Reprinted by F. Sezgin, Publications of the\nInstitute for the History of Arabic and Islamic Science: Islamic\nPhilosophy 75, Franfkurt am Main, 1999.</li>\n<li>–––, 1968 Fakhry, Mâjid, ed., <em>Rasâ’il Ibn Bajja\nal-ilâhîya</em> (Opera Metaphysica). Beirut, Dâr\nal-Nahâr li-l-Nashr. Reprint 1990.</li>\n<li>–––, 1983 al-‘Alawî, Jamâl al-Dîn, ed.,\n<em>Rasâ’il falsafîya li-Abî Bakr Ibn Bâjja</em>.\nBeirut-Casablanca: Dâr al-Thaqâfa—Dâr al-Nashr\nal-Maghribîya.</li>\n<li>Razi, 1939 Kraus, Paul, ed., <em>Opera Philosophica</em>. Cairo,\nn.p.</li>\n<li>–––, 1950 Arberry, Arthur J. <em>The Spiritual Physick of Rhazes</em>.\nLondon, John Murray. Reprinted as <em>Razi's Traditional\nPsychology</em>, Damascus (n.p., n.d).</li>\n</ul>\n<h3><a name=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Adamson, Peter, 2006, “Vision, Light and Color in Al-Kindi,\nPtolemy and the Ancient Commentators,” <em>Arabic Sciences and\nPhilosophy</em>, 16: 207–36.</li>\n<li>Altmann, Alexander, 1965, “Ibn Bâjjah on Man's\nUltimate Felicity,” H.A. Wolfson Jubilee Volume (n.e.),\nJerusalem, The American Academy of Jewish Research, I:47–87.</li>\n<li>Arberry, Arthur J., 1964, <em>Aspects of Islamic Civilization</em>.\nLondon, George Allen &amp; Unwin.</li>\n<li>Black, Deborah L., 1993, “Estimation (<em>Wahm</em>) in\nAvicenna: The Logical and Psychological Dimensions.”\n<em>Dialogue</em> XXXII, 219–58.</li>\n<li>–––, 1996, “Memory, Individuals and the Past in\nAverroes's Psychology,” <em>Medieval Philosophy and\nTheology</em> 5, 161–87.</li>\n<li>–––, 2000, “Imagination and Estimation: Arabic\nParadigms and Western Transformations.” <em>Topoi</em> 19,\n59–75.</li>\n<li>D'Ancona Costa, Cristina, “Aristotelian and Neoplatonic\nelements in Kindî's Doctrine of Knowledge.” <em>American\nCatholic Philosophical Quarterly</em> LXXIII, 9–35.</li>\n<li>Davidson, Herbert A. 1992, <em>Alfarabi, Avicenna, &amp; Averroes,\non Intellect</em>. New York, Oxford University Press.</li>\n<li>Druart, Thérêse-Anne, 1988, “The soul and Body\nProblem: Avicenna and Descartes,” <em>Arabic Philosophy and the\nWest</em>, ed. Thérêse-Anne Druart. Washington, D.C.,\nCenter for Contemporary Arab Studies, Georgetown University,\n27–49.</li>\n<li>Endress, Gerhard, 1994, “Al-Kindî Über die\nWiedererinnerung der Seele.” <em>Oriens</em> 34, 174–219.</li>\n<li>Fakhry, Majid, 1970, <em>A History of Islamic Philosophy</em>. New\nYork, Columbia University Press.</li>\n<li>Gutas, Dimitri, 1988, <em>Avicenna and the Aristotelian\nTradition</em>. Leiden, Brill.</li>\n<li>–––, 2001, “Intuition and Thinking: The Evolving\nStructure of Avicenna's Epistemology,” <em>Aspects of\nAvicenna</em>, ed. Robert Wisnovsky. Princeton, Markus Wiener\nPublishers, 1–38.</li>\n<li>Hasse, Dag, 2000, <em>Avicenna's De anima in the Latin\nWest</em>. London, Warburg Institute.</li>\n<li>Hyman, Arthur and Walsh, James 1973. <em>Philosophy in the Middle\nAges</em>. Indianapolis, Hackett Publishing.</li>\n<li>Ivry, Alfred L., 1997, “Averroes' Short Commentary on\nAristotle's De anima,” <em>Documenti e Studi Sulla Tradizione\nFilosofica Medievale</em> VIII, 511–49.</li>\n<li>–––, 1999, “Averroes' Three Commentaries\non De anima,” in G. Endress and J.A. Aertsen, eds., <em>Averroes\nand the Aristotelian Tradition</em>. Leiden, Brill, 199–216.</li>\n<li>Janssens, Jules, 1987, “Ibn Sînâ's Ideas of\nultimate Realities, Neoplatonism and the Qur’ân as\nProblem-Solving paradigms in the Avicennian System.”\n<em>Ultimate Reality and Meaning</em> 10, 252–71.</li>\n<li>Jolivet, Jean, 1971, <em>L'Intellect selon Kindî</em>.\nLeiden, Brill.</li>\n<li>Michot, Jean R. 1986, <em>La destinée de l'homme\nselon Avicenne</em>. Louvain, Peeters.</li>\n<li>Peters, Francis, 1968, <em>Aristoteles Arabus</em>. Leiden, E.J.\nBrill.</li>\n<li>Rahman, Fazlur, 1958, <em>Prophecy in Islam</em>. London, George\nAllen &amp; Unwin.</li>\n<li>Sebti, Meryem, 2000, <em>Avicenne: L'ame humaine</em>.\nParis, Broché.</li>\n<li>Taylor, Richard, 1999, “Remarks on Cogitatio in Averroes'\nCommentarium Magnum in Aristotelis De anima Libros,” in\nG. Endress and J.A. Aertsen, eds., <em>Averroes and the Aristotelian\nTradition</em>. Leiden, Brill, 217–55.</li>\n<li>Taylor, Richard, 2005, “The Agent intellect as ‘form\nfor us’ and Averroes's Critique of\nal-Fârâbî,” <em>Proceedings of the society for\nMedieval Logic and Metaphysics</em>, 5, 18–32.</li>\n<li>Wolfson, Harry A. 1935, “The Internal Senses in Latin, Arabic and\nHebrew Philosophic Texts.” <em>Harvard Theological Review</em>, vol.\n28, 70–133; reprinted in Wolfson, <em>Studies in the History of\nPhilosophy and Religion</em>. Cambridge, MA, 1973, I: 250–314.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Farabi",
            "al-Kindi",
            "al-razi",
            "Alexander of Aphrodisias",
            "Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science",
            "Aristotle",
            "Aristotle, General Topics: psychology",
            "Galen",
            "Ibn Bâjja [Avempace]",
            "Ibn Rushd [Averroes]",
            "Ibn Sina [Avicenna]",
            "imagination",
            "intentionality: in ancient philosophy",
            "intentionality: medieval theories of",
            "memory",
            "mental representation: in medieval philosophy",
            "Plato",
            "Plotinus",
            "soul, ancient theories of"
        ],
        "entry_link": [
            {
                "../al-farabi/": "al-Farabi"
            },
            {
                "../al-kindi/": "al-Kindi"
            },
            {
                "../alexander-aphrodisias/": "Alexander of Aphrodisias"
            },
            {
                "../arabic-islamic-natural/": "Arabic and Islamic Philosophy, disciplines in: natural philosophy and natural science"
            },
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-psychology/": "Aristotle, General Topics: psychology"
            },
            {
                "../galen/": "Galen"
            },
            {
                "../ibn-bajja/": "Ibn Bâjja [Avempace]"
            },
            {
                "../ibn-rushd/": "Ibn Rushd [Averroes]"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            },
            {
                "../imagination/": "imagination"
            },
            {
                "../intentionality-ancient/": "intentionality: in ancient philosophy"
            },
            {
                "../memory/": "memory"
            },
            {
                "../representation-medieval/": "mental representation: in medieval philosophy"
            },
            {
                "../plato/": "Plato"
            },
            {
                "../plotinus/": "Plotinus"
            },
            {
                "../ancient-soul/": "soul, ancient theories of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arabic-islamic-mind\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/arabic-islamic-mind/\" target=\"other\">Preview the PDF version of this entry</a> at the <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=arabic-islamic-mind&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/arabic-islamic-mind/\" target=\"other\">Enhanced bibliography for this entry</a> at <a href=\"http://philpapers.org\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=arabic-islamic-mind": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/arabic-islamic-mind/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=arabic-islamic-mind&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/arabic-islamic-mind/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.muslimphilosophy.com/ei2/list.htm\" target=\"other\">Selected articles from the <em>Encyclopedia of Islam</em></a>\n (eds. Bearman, Bianquis, Bosworth, van Donzel, and Heinrichs),\n hosted by\n <a href=\"http://www.muslimphilosophy.com/\" target=\"other\">Islamic Philosophy Online</a>"
        ],
        "listed_links": [
            {
                "http://www.muslimphilosophy.com/ei2/list.htm": "Selected articles from the Encyclopedia of Islam"
            },
            {
                "http://www.muslimphilosophy.com/": "Islamic Philosophy Online"
            }
        ]
    }
}