{
    "url": "bauer",
    "title": "Bruno Bauer",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Douglas Moggach\n<dmoggach@uottawa.ca>",
        "author_links": [
            {
                "mailto:dmoggach%40uottawa%2eca": "dmoggach@uottawa.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nDouglas Moggach\n&lt;<a href=\"mailto:dmoggach%40uottawa%2eca\"><em>dmoggach<abbr title=\" at \">@</abbr>uottawa<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Mar 7, 2002",
        "substantive revision Mon Feb 7, 2022"
    ],
    "preamble": "\n\nBruno Bauer (6 September 1809–13 April 1882), philosopher,\nhistorian, and theologian. His career falls into two main phases,\ndivided by the Revolutions of 1848. In the 1840s, the period known as\nthe Vormärz or the prelude to the German revolutions of March\n1848, Bauer was a leader of the Left-Hegelian movement, developing a\nrepublican interpretation of Hegel, which combined ethical and\naesthetic motifs. His theory of infinite self-consciousness, derived\nfrom Hegel’s account of subjective spirit, stressed rational\nautonomy and historical progress. Investigating the textual sources of\nChristianity, Bauer described religion as a form of alienation, which,\nbecause of the deficiencies of earthly life, projected irrational,\ntranscendent powers over the self, while sanctioning particularistic\nsectarian and material interests. He criticized the Restoration state,\nits social and juridical base, and its orthodox religious ideology.\nAnalyzing the emergence of modern mass society, he rejected liberalism\nfor its inconsequent opposition to the existing order, and for its\nequation of freedom with property, but he accused socialism of an\ninadequate appreciation of individual autonomy. After the defeats of\n1848, Bauer repudiated Hegel. He predicted a general crisis of\nEuropean civilization, caused by the exhaustion of philosophy and the\nfailure of liberal and revolutionary politics. New prospects of\nliberation would, he believed, issue from the crisis. His late\nwritings examined the emergence of Russia as a world power, opening an\nera of global imperialism and war. These writings influenced\nNietzsche’s thinking on cultural renewal. Friedrich Engels and\nKarl Kautsky claimed Bauer’s religious criticism for the\nsocialist movement, while the anti-traditionalist conservatism of his\nlate work influenced the thought of Carl Schmitt in the twentieth\ncentury.\n",
    "toc": [
        {
            "#Car": "1. Career"
        },
        {
            "#BauWri182": "2. Bauer’s Writings, 1829–50"
        },
        {
            "#BauLatWor185": "3. Bauer’s Late Work, 1850–1882"
        },
        {
            "#RecDev": "4. Recent Developments"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#MajWorBruBau182": "Major Works by Bruno Bauer, 1829–1882"
        },
        {
            "#JouEdiBruBau": "Journals edited by Bruno Bauer"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Career\n\nBruno Bauer was born on 6 September, 1809 in the town of Eisenberg in\nThuringia, south-eastern Germany. In 1815, Bauer’s family moved\nto Berlin, where his father was employed in the royal porcelain\nfactory in Charlottenburg. At the University of Berlin\n(1828–1834),he studied under Hegel, Schleiermacher, and the\nHegelians Hotho and Marheineke. On Hegel’s recommendation,\nBauer’s 1829 essay on Kant’s aesthetics won the Prussian\nroyal prize in philosophy. From 1834 to 1839, he lectured on theology\nand biblical texts in Berlin. He was transferred to the theology\nfaculty at Bonn after publishing an attack on his colleague and former\nteacher Hengstenberg. He taught in Bonn from 1839 till spring 1842,\nwhen he was dismissed for the unorthodoxy of his writings on the New\nTestament. The dismissal followed a consultation by the ministry of\neducation with the theology faculties of the six Prussian\nuniversities, but no consensus emerged from the academic inquest. The\norder for Bauer’s dismissal came directly from the King of\nPrussia, Friedrich Wilhelm IV, who had decreed the suspension from\nstate employment of participants in a banquet to honour the South\nGerman liberal Karl Welcker, held in Berlin in 1841. On that occasion,\nBauer had proposed a toast to Hegel’s conception of the\nstate.\n\nFrom 1842 to 1849, Bauer was active in political journalism and\nhistorical research on the Enlightenment and the French Revolution. He\nargued against the emancipation of Prussian Jews in 1842–43,\nseeing this proposal as a political legitimation of particular\nreligious interests. He was the object of polemical attacks by Marx\nand Engels in The Holy Family (1844) and The German\nIdeology (written in 1845–46). With his brother Edgar,\nBauer founded the Charlottenburg Democratic Society in 1848, and stood\nunsuccessfully for election to the Prussian National Assembly on a\nplatform of popular sovereignty.\n\nRemaining in Prussia after the defeats of 1848–49, Bauer\ncontinued to produce work of biblical criticism and political\nanalysis. He wrote in the mid 1850s for Die Zeit, a\ngovernment-sponsored newspaper, in which his anti-liberalism took a\nconservative turn. He contributed articles on European affairs to\nother newspapers, such as Die Post, the Kleines\nJournal, and the New York Daily Tribune. From\n1859–66 he collaborated with F.W.H. Wagener on his conservative\nStaats- und Gesellschafts-Lexikon, editing almost all 23\nvolumes, and writing numerous articles, several with anti-Semitic\nthemes. In 1865 he acquired a small farm in Rixdorf, on the outskirts\nof Berlin. He died there on 13 April 1882.\n2. Bauer’s Writings, 1829–50\n\nBauer was a prolific writer, publishing a dozen substantial books and\nover 60 articles between 1838 and 1848 alone, but no critical edition\nof these works exists. They included analyses of Hegel, the Bible,\nmodern theologies, the Enlightenment, and the French Revolution and\nits aftermath. The interpretation of Bauer’s work is problematic\nfor several reasons. Because of anonymous, pseudonymous, and\ncollaborative publication, some attributions are disputed; and\ndivergences exist between Bauer’s published texts and private\ncorrespondence. In the anonymous Trumpet of the Last\nJudgement (1841) and Hegel’s Doctrine of Religion and\nArt (1842), Bauer spoke not in his own voice, but in the ironic\nguise of a conservative critic of Hegel, attributing to Hegel his own\nrevolutionary views.\n\nThree lines of interpretation of Bauer can be distinguished. These\nfocus on his early work; his later writings have attracted little\ncritical attention. The first sees Bauer as a radical subjectivist,\nwhose social and religious criticism was closer to Enlightenment\nrationalism than to Hegel (Sass, 1978; Brudney, 1998). The second,\nlargely influenced by Marx, insists on Bauer’s abandonment of\nthe Hegelian left after 1843 (Rossi, 1974; Pepperle, 1978). The third\nemphasizes the continuity throughout the Vormärz of Bauer’s\nthought and of his republicanism, based on the Hegelian idea of the\nunity of thought and being (Moggach, 2003, 2006, 2011).\n\nBauer’s prize manuscript of 1829, De pulchri\nprincipiis, presented the unity of concept and objectivity as the\ncentral idea of Hegel’s idealism. It examined this unity as\nexpressed in art, comparing Hegel’s aesthetic theory to\nKant’s Third Critique. The manuscript supplemented the\ncriticisms of Kant from Hegel’s Berlin Aesthetics lectures with\nthe logical analysis of categories provided by the 1827\nEncyclopaedia of the Philosophical Sciences. Bauer argued\nthat while the Critique of Judgement attempted to bridge the\ngap between thought and being, and thus opened the way to Hegel, it\nreproduced the antinomies characteristic of the first two critiques.\nKant’s synthesis failed, since he continued to define the\nconcept as merely subjective, and the object as the unknowable\nthing-in-itself, transcending the cognitive power. Self-consciousness,\nor the subject of the transcendental unity of apperception, was\nlikewise impervious to cognition from the Kantian standpoint. In\nHegel’s syllogisms of the idea, objectivity attained rational\nform, while the concept acquired an explicit, material existence.\nBeauty, life, and idea were moments in the process which constituted\nthe actuality of reason. As the immediate unity of thought and\nobjectivity, art illustrated the inexhaustible fecundity of the\nphilosophical Idea. The manuscript underlined the opposition of faith\nand reason in its critique of the religious conceptions of the unity\nof thought and being. Faith was taken to be inimical to free inquiry,\nwhich is the element of reason.\n\nThroughout the 1830s, however, Bauer sought to reconcile thought and\nbeing through the idea of rational faith. In Zeitschrift für\nspekulative Theologie, which he edited between 1836 and 1838, and\nin Jahrbücher für wissenschaftliche Kritik, he\noffered a speculative account of Christian doctrines as\nexemplifications of logical categories. In the 1838 Religion of\nthe Old Testament, Bauer depicted religious experience as a\nproduct of self-consciousness. He proposed both a transcendental\naccount, stressing the conditions of possibility of religious\nexperiences, and a phenomenological sequence of their forms: a\nlegalistic subordination to an authoritarian deity in the early books\nof the Old Testament expressed a merely external relation between God\nand man, while the messianic consciousness of later books heralded a\nhigher form, the immanence of the universal in the community; but this\nconsciousness could only point up the inadequacy of the law, not yet\npropose the effective overcoming of estrangement. The texts of the\n1830s located the logical structure which, for Bauer, defined the\nreligious consciousness: the immediate identity between particularity,\nwhether of a subject or a community, and the abstract universal, a\nunity achieved without self-transformation. By 1839, Bauer deduced the\npolitical implications of this view: the religious consciousness\nasserted this immediate identity as a monopolistic, sectarian claim,\nexcluding other particulars from equivalent status. The essence of\nreligion for Bauer was now a hubristic particularism, which also\nconferred a transcendent status on the universal, as a realm divorced\nfrom concrete social relationships. This position received its fullest\nexposition in Bauer’s Christianity Revealed (1843). He\nalready sketched this argument in Herr Dr. Hengstenberg, of\n1839, publicly breaking with orthodox and conservative versions of\nChristianity, and stressing the discontinuity between Christianity and\nJudaism. By 1840–41, Bauer would present the emancipated\nphilosophical self-consciousness as opposed to all forms of religious\nrepresentation. His political radicalism and republicanism were\ncemented by his recognition of the structural identity between the\nprivate interests fostered by the Restoration order, and the\nmonopolistic religious consciousness.\n\nBauer’s political and theoretical radicalization is evidenced in\nhis biblical studies. The series is comprised of Critique of the\nGospel of John (1840), and the three-volume Critique of the\nSynoptic Gospels (1840– 42). Together with his 1838 study\nof the Old Testament, these volumes criticized the stages of revealed\nreligion, and forms of self-alienated spirit in history. Bauer’s\ncritique of John’s gospel demonstrated the opposition between\nthe free self-consciousness and the religious spirit. His stated\npurpose was to restore the Christian principle to its source in\ncreative self-consciousness; he did not yet openly oppose the\nprinciple itself, but sought to differentiate it, as a rational idea,\nfrom ecclesiastical dogmatism. The positivity of Christianity derived\nfrom the abstract understanding, rather than from speculative reason,\nwhich led religious experience back to its subjective roots. The\nrational core of Christianity was the identity of God and man, but\ntheology had built an untenable doctrinal system on this foundation.\nSpeculation now undermined dogma; it was not confirmed by it, as\nBauer’s mid-1830s articles had maintained. In his\ncorrespondence, though not in this text itself, Bauer indicated that\nthis restoration of the Christian principle was also its overthrow, as\nthe unity of universal and particular could now be grasped in more\ntangible and earthly forms. Christianity was a necessary but now\ntranscended stage in the development of the human spirit, to be\nsupplanted by new expressions of autonomous self-consciousness.\n\nIn his critique of the Synoptics, Bauer’s object was more openly\nto negate dogmatic Christianity, mobilized in defence of the\nabsolutist order. The incidents described in the gospels were products\nof the religious consciousness, rather than factual reports.\nBauer’s critique of John convinced him that the gospel narrative\nwas a purely literary product, and he now argued that the Synoptics\ntoo contained no historically authentic material. Bauer attempted to\nestablish the historical priority of Mark, and the specific\nelaborations undertaken sequentially by Luke and Matthew. He depicted\nmiracles as fallaciously displaying the immediate causality of the\nuniversal in nature, and criticized the naturalistic explanations\nfavoured by theological rationalism. The third volume of the series\ndenied the historicity of Christ. The Christian idea that God and\nmankind share the same essence appeared as the religious\nrepresentation of a single empirical individual who assumed the\nuniversal power of spirit. Like his contemporaries D.F. Strauss and\nLudwig Feuerbach, Bauer understood this synthesis instead as a project\nimmanent in human history. As Bauer’s political writings from\nthis period show, he proposed that the assumption of universality, and\nthe transcendence of particular interest, were historical tasks,\nundertaken by the state and the republican citizenry. In the Synoptics\ntexts, Bauer explicitly equated Christianity and feudalism, and\ndefended the freedom and equality of self-consciousness. Religion and\nthe absolutist state were mutually sustaining, sharing the essential\nfeatures of alienation and repression. Christianity represented the\ncompletion of the religious consciousness in pure abstraction, and the\ndissolution of all genuine ethical bonds. Bauer contended that Judaism\npresupposed the subordination of nature to religious interests, but\nstill maintained the natural links of kinship and ethnicity.\nChristianity eliminated this limited Sittlichkeit in favour\nof the purely abstract self, thus perfecting alienation and requiring\nits definitive resolution.\n\nThe political application of the doctrine of self-consciousness can be\ntraced through two texts on the state, also dating from 1840–41.\nIn The Evangelical State Church of Prussia and Science, Bauer\ndescribed the essence of the state as free development. The state was\nthe dialectical agency of historical progress and of the universality\nof the will, manifesting the capacity to abstract from any given\ncontent and express itself in ever new forms. While signalling\nempirical tendencies which might limit the state’s progressive\nfunction (the prominence of religious interests, and hesitancy before\nthe social question, the emergence of new forms of urban poverty and\nexclusion), Bauer contended that the genuine state, as the expression\nof freedom, was in constant transformation. His surface claim was that\nthe Prussian state is such an institution, though his contemporary\ncorrespondence belied this view. He defended the 1817 union of the\nLutheran and Reformed churches in Prussia as the political overcoming\nof religious oppositions, whose basis had been eroded by the\nEnlightenment. Through its (still abstract) grasp of the universal\nconcept of man, against religious particularity, the Enlightenment had\ntransformed religious consciousness into self-consciousness. (This\nprocess formed one of the major themes of Bauer’s\nChristianity Revealed, along with a critique of French\nmaterialism for its inadequate grasp of freedom). The churches were\nnow impotent to perpetuate their own existence without the support of\nthe state. Countering conservative historians like F.J. Stahl, who\nchampioned the independence of the churches, Bauer’s “The\nChristian State and Our Times,” of 1841, again identified the\nstate as the focus of ethical life. Stahl’s position implied a\nderogation of the spirituality of the state, presenting it as an\nagency of external constraint, to uphold the orthodox ecclesiastical\nand political order against the flow of history, and to defend a\nsocial order governed by irrational privileges and immunities. Bauer\ndenounced not only the Christian state of Friedrich Wilhelm IV, but\nalso the formal Rechtsstaat, or liberal constitutionalism.\nFor Bauer, both these positions defined freedom as private interest,\nreligious or economic; but as particularity, these attitudes had to be\npurged away in the name of a new political order. Bauer maintained\nthat Hegel’s view of freedom as universality was far in advance\nof liberal views, even if the Philosophy of Right was\ninconsistent or incomplete. This was Bauer’s provocative claim\nat the Welcker banquet of 1841, which occasioned his dismissal from\nthe university. The elimination of egoistic atomism by moral\nself-consciousness was the pre-requisite for the republic, or the free\nstate. Bauer contended that the existing social order could not be\ndeemed to be thoroughly rational, nor the state to be the institution\nof freedom that it ought to be, as long as the social question of\nurban destitution remained unresolved. \n\nThe anonymous Trumpet of the Last Judgement, or\nPosaune (November, 1841), and its sequel, Hegel’s\nDoctrine of Religion and Art (1842), interpreted Hegel as\nsounding a call for revolution, to bring this state into being. Bauer\nclaimed that the consequences of Hegel’s system were the\noverthrow of church and state; and that Hegel’s conservative\ncritics were right to see him as the most dangerous adversary of the\nRestoration. Written ironically as pietistic denunciations,\nBauer’s two texts attributed to Hegel a theory of infinite\nself-consciousness, in which the concept of substance and a\ntranscendent absolute were necessary but self-annulling illusions.\nRecapitulating the issue in his own voice in 1845, Bauer identified a\ntension in Hegel’s thought between Spinoza and Fichte, between\ninert, undifferentiated substance and creative form. The\nPosaune, however, argued that the Spinozist moment, though\nnecessary to Hegel’s dialectic, was fully assimilated to\ninfinite self-consciousness. In absolute spirit, properly understood,\nall religious pretensions dissipated, while the absolute itself\ndissolved into the critical activities of conscious individual\nsubjects. Nothing transcendent remained. Yet, the Posaune\nrecognized, Hegel also stressed the concept of substance. Its role had\nto be accounted for. In its apparent transcendence, substance\ndisciplined the immediate, particular self. This was necessary\nbecause, as Hegel argued, particularity cannot be the criterion of\ntheoretical or practical reason; rather, individuals must first\ninternalize substance, as a principle of universality, as a stage in\nreaching infinite self-consciousness. The undifferentiated, pure\nuniversal of substance subsumed all particularity, including the self.\nThis initial, Spinozist moment created an appearance of pantheism in\nHegel, which misled interpreters like D. F. Strauss. In Bauer’s\ndepiction, however, Hegel proceeded to dissolve substantiality as a\npower independent of consciousness. This dialectical resolution was\nnot equivalent to renouncing objectivity, but meant that substance,\nonce it had demonstrated to the particular consciousness the need to\ntranscend itself, might not claim an immediate validity either.\nDisciplining their own immediate interests, individuals could then\nbecome the organs through which the universal attained conscious form.\nThe dialectical illusion of substance was a necessary stage, because\nin it the unity of concept and objectivity could first be glimpsed;\nbut this illusion had to be overcome in further historical and\ntheoretical development. The subject must appear as potentially\nuniversal, and the objective must show itself as a purposive order,\nresponding to the subject’s striving for rational freedom. This\ndevelopment entailed transforming substance into the record of the\nacts of conscious spirit, an inner relation of self-consciousness to\nitself. Subjectivity thus assimilated the principle of universality,\nwhich it now contained as its own character, not as something alien to\nit. But this relation was not confined to an inward experience, since,\nas Hegel maintained, reason must realize itself in the world. The\nexternalization of reason produced a historical sequence, including\nthe forms of alienated life. The stages in this sequence could be\ngrasped as moments in the unfolding unity of thought and being. Bauer\ndescribed self-consciousness, conceived as an immanent and subjective\nuniversality, as the motive force of history, generating historical\ncontent by taking up and transforming the given. As Bauer’s 1829\nmanuscript had also declared, at stake was not only the subjective\nrealisation of the concept, but the fate of the idea, the unity of\nthought and being; and this required that the objectivity of the\nhistorical process be equally emphasized. This historical and critical\nidealism, which the Posaune attributes to Hegel, was politically\nrevolutionary: it affirmed the rights of free self-consciousness\nagainst any positive institution which could not justify its existence\nbefore rational thinking, against state, religion, and social\nhierarchy.\n\nBauer used his central concept of infinite self-consciousness, a term\ntaken from Hegel’s theory of subjective spirit, to reconfigure\nthe Hegelian absolute, bringing art and philosophy into close\nproximity, and excluding religion as a form of alienated reason, while\nrecognising its past historical necessity. Bauer insisted on the\nimmanence of the universal in history, as the record of struggles for\nliberation, and of alienation, which was necessary to discover the\nmeaning of rational autonomy. Bauer’s ethical idealism resembles\na doctrine that Kant calls perfectionism, or Vollkommenheit,\na form of rational heteronomy, one of whose meanings is that action is\nvalidated by its contribution to historical progress. Bauer equated\nperfectionism and autonomy, as an uncompromising commitment to remodel\npolitical and social relations and institutions. Subjects acquired\nautonomy by freeing themselves from particular interests, and by\nrepudiating transcendent universals, religious and political\ninstitutions which claimed to be underivable from self-consciousness,\nand exempt from history. Bauer denounced the ancien\nrégime and its Restoration surrogates as a feudal system\nof tutelage and irrational privileges. Arrogating universality to\nitself, the authoritarian state which arose over these exclusive\nparticulars thwarted the self-activity of its people, and concealed\nthe source of its authority behind a veil of religious sanctification.\nBauer maintained that the state, and not religion, was the principal\nadversary. Against this order of alienated spirit, he insisted that\nthe decisive political question was the source of the state’s\nauthority, whether in tradition and religious sanction, or in the\npopular will. This question was to be resolved without compromise.\nBauer asserted that his objective was not merely political, but social\nemancipation. The social question, the polarizations and crises of\ncivil society to which Hegel had been alert, could be resolved not by\ndirect appeals to the particular interests of one class, but by a\ncommon republican struggle against multiform privilege. The result of\nthis combat would be the attainment of justice in all spheres of\nsocial life.\n\nTwo texts, dating from late 1842 and early 1843, The Jewish\nQuestion, and “The Capacity of Present-Day Jews and\nChristians to Become Free,” elaborate Bauer’s critique of\nthe religious consciousness and of political reformism. The\nconsequence of their publication, however, was that Bauer forfeited\nhis leading position in the opposition movement, as he challenged one\nof its central demands. The question was whether the explicitly\nChristian state of Prussia could eliminate restrictions on Jewish\nparticipation in civil institutions. While liberals and republicans\nadvocated emancipation, conservative opponents defended the\nstate’s exclusive confessional allegiance. Bauer’s\ninterventions attacked the state for defending privilege, and claimed\nthat it used religion as a mask for its interests in maintaining\nrelations of subordination; but he also criticized Jews and their\nsupporters for claiming freedom on the basis of a particular religious\nidentity. Political and social freedom required the renunciation of\nall particularistic ties with the past; thus, as a precondition of\njuridical equality, Jews must renounce their religious allegiance, as\nmust Christians. Christianity demonstrated a historically higher\ndegree of consciousness, since it cancelled the externality of the\ndeity. But this was not a unilateral progress upon Judaism, because\nChristianity, and especially Protestantism, generalized alienation to\nencompass all aspects of life. The superiority of Christianity\nconsisted in its radical negativity, making requisite a transition to\na new and higher form of ethical life. By exacerbating the\ncontradiction between self-determination and self-abasement, the way\nwas cleared for an epochal resolution. These interventions were\ncensured by Marx, and by leading liberal spokesmen. Bauer remained\nadamant that his position was the correct progressive stance.\n\nIn his studies of the French Revolution and its impact on Germany,\nBauer traced the emergence of mass society, based on conformity and\ninchoate particularism. The dissolution of the feudal estates by the\nRevolution produced a purely atomistic society, characterized by the\nassertion of individual property right. The attachment to private\neconomic interest made impossible a concerted opposition to privilege\nand to the existing order, and had caused the ultimate defeat of the\nrevolutions that had spawned it. The Jacobinism of the French\nRevolution, which Bauer in many ways endorsed, had been directed\nagainst this attitude, but had failed to overcome it; and this\nproprietary particularism now threatened the republican movement of\nthe Vormärz. The masses, encompassing both the proletariat and\nthe bourgeoisie, represented inertia and stagnation, and formed the\nbulwark of the existing order. Their opposition to this order was\nmerely apparent. Liberalism unconsciously expressed this development\nof mass society, defining freedom as acquisition. Bauer criticized\nliberal constitutionalism as a vacillating, compromising attitude\ntoward the feudal regime. Even in its most advanced form, that\nendorsed by Hegel, constitutionalism juxtaposed two diametrically\nopposed principles of sovereignty, popular and princely, and was\nunable to resolve the contention between them. Incipient socialism\nshared the same terrain as liberalism, the defence of private\ninterest, but proposed inconsequent and unacceptable solutions to the\nconditions which liberalism simply affirmed. For Bauer, socialism was\nirredeemably heteronomous. The socialist movement, he claimed, sought\nto organize the workers in their immediate, particular existence, and\nnot to transform them. He saw in the proletariat pure particularity,\nand, unlike Marx, denied that this particularity could transform\nitself into a genuine universal unless it first renounced its own\nsectional interests. Bauer also anticipated the negative effects of a\nsocialist organization of labour. While criticizing capitalism for its\nirrational competitive forms, he defended the principle of competition\nitself as a necessary condition for progress, the independence of\npersons, and the possibility of conscious, free self-determination.\nBauer’s pre-1848 work revived the classical republican themes of\nthe opposition of commerce and virtue, but gave them a new shape,\nconsistent with his Hegelianism. In 1842–43, Bauer confidently\npredicted the triumph of republican principles and institutions,\nthough this confidence waned as the political crisis deepened. In his\ntwo electoral addresses of 1848–49, he defended popular\nsovereignty and the right of revolution, demanding that the new\nconstitution be promulgated as an act of revolutionary will, and not\nreceived as a concession from the king. He also intensified his\ncritique of socialism for promoting heteronomy and dependency rather\nthan personal initiative and self-determination, and for appealing to\nthe existing, discredited absolutist state for the redress of social\ngrievances, rather than opposing this state with unbending resolution.\n\n3. Bauer’s Late Work, 1850–1882\n\nWhile he continued to proclaim the continuity of his thought,\nBauer’s late work was characterized by the definitive\nabandonment of his Vormärz republicanism. The failure of 1848, he\nargued, demonstrated the bankruptcy of the European philosophical\ntradition. Instead of the triumph of republics, Bauer now foresaw an\nage of global imperialism. The decisive political question after 1848\nwas the rise of Russia. Bauer predicted that Russian pressure would\npromote a pan-European union, as a stage in a movement toward a global\nabsolutism. The revolutionaries of 1848 still presupposed,\nuncritically, that states were independent units. The next historical\nperiod would initiate a genuine continental crisis. Anticipating\nNietzsche, Bauer contended that the impending collapse of European\ncivilisation would make possible a new beginning, a liberation from\ntraditional forms and values, together with their metaphysical and\nreligious sanctions. Bauer’s abiding opposition to liberalism\nnow induced him to collaborate in conservative causes; but his\nconservatism was unconventional. Like Nietzsche, he continued to\nrepudiate tradition and religion. Because of his anti-Semitism, Bauer\nwas claimed as a precursor by some National-Socialist authors, though\nErnst Barnikol, for example, disputes a direct connection (Barnikol\n1972, pp. 350–53).\n\nFor Bauer, the revolutions of 1848 were so closely connected with the\nEnlightenment, Kantian, and Hegelian projects that their failure\nsounded the death-knell of philosophy and its claims to rational\nindividual autonomy. Bauer’s late critique assimilated Hegel\nwith Spinoza and the metaphysics of substance, understood as the\nnegation of form and subjectivity. Unlike his Vormärz position,\nhe asserted in texts of 1852 and 1853 that Hegel had yielded to the\ninfluence of Spinoza, effacing individuality, and submerging concrete\nparticulars under illusory, abstract logical categories. Bauer now\ndescribed the Hegelian idea as being itself a transcendent illusion.\nIts inability to admit concrete particulars derived from the\nsubstantiality of the system itself. The result was that Hegel had\ndiscounted individuality in favour of conformity. While prior to 1848\nBauer proclaimed that Hegel had taught “the republic and the\nrevolution,” he now decried the absolutist tendencies of the\nHegelian system, whose oppressive unity paralleled the historical\ntrend toward an all-encompassing political despotism. Bauer accused\nphilosophy of contributing to an inexorable process of levelling and\nuniformity in the post-revolutionary state (Bauer, Russland und\ndas Germanenthum, I, pp. 40–54). These criticisms\nanticipated Rudolph Haym’s polemic in Hegel und seine\nZeit (1857).\n\nIn common with many post-1848 intellectuals, Bauer’s abandonment\nof metaphysics led him to a new conception of critique as a positive\nscience or empirical investigation. Bauer no longer contended that\nhistory represents an unfolding dialectic of self-consciousness.\nCritique was to permit the observer to examine historical phenomena\nwithout distortion or partiality, and without an a priori systemic\nconcern. Bauer maintained that scientific research must remain\nindependent of ecclesiastical and political tutelage. Its objective\nwas to determine the relation of nature to rights and freedom of the\nwill (concepts which the late Bauer retained, while rejecting their\nmetaphysical foundations); but critique did not enjoin practical\nintervention in political affairs. The correct stance was now\ndisinterested contemplation of the inevitable processes of cultural\ndecay and regeneration, and an attempt to salvage one’s own\nindependence from the general wreckage of philosophical systems and\npolitical life.\n\nThe conclusion of this new critique was that the future belonged not\nto the republican people, or to separate national states, but to a\ntransnational imperialism, involving the confrontation of two\nabsolutist programmes. In one of these, the Western European,\npolitical absolutism arose over modern mass society as its necessary\ncomplement. Bauer had earlier criticized this configuration as an\noutmoded form of state, to be supplanted by the republic; he now\ndescribed it as the result of an incomplete political development,\nwhich would issue in a contention for world domination. Within the\nWestern European form, Bauer distinguished two variants:\nBismarck’s state socialism, imitating eighteenth-century\nPrussian militarism, attempted to subject economic production to\npolitical control, suppressing innovation and personal independence;\nwhile Disraeli’s romantic imperialism sought to level and\nsubordinate English society before a paternalistic monarchy. In\nopposition to the west, the second major absolutist form was that of\nRussia, a substantial power with limited internal distinctions. Its\ncohesiveness derived from the fusion of political and ecclesiastical\npower, and the absence of the modern idea of subjectivity. Bauer noted\nthat Hegel had mistakenly discounted this zone from world history.\nLike the anarchist Michael Bakunin, Bauer claimed that Russia owed its\noriginal state formation to Germany; but Russia had otherwise been\nimpervious to western philosophical influence, adopting only what\nserved its immediate, concrete ends. Animated by hatred and shame of\nits past insignificance, Russia too was ambivalent. It did not\ndirectly provide the solution to the contemporary political crisis,\nbut elicited a decisive struggle with the west. The vigour of an alien\nadversary would force Europe to transform itself, and offered the only\nremaining prospects of a cultural renewal. Preceding any such renewal\nwould be the extension of imperialism across the continent and the\nglobe, and the clash of rivals for dominance within the new empire.\nBauer concluded that world war was inevitable.\n\nBauer’s prognosis anticipated aspects of Karl Kautsky’s\n1915 theory of ultraimperialism, though without the latter’s\noptimism that this trend heralded a reduction in conflicts among\ncontenders for hegemony. Imperialism, moreover, did not stimulate, but\nhampered economic growth, since insecurity and permanent military\nmobilization undermined productive activity. The historic function of\nthe globalizing process was to eliminate national identities, laying\nthe basis for an eventual cosmopolitan rebirth. Bauer saw nationalism\nas a dissipated force. The emerging world order was framed not by the\ndefence of national interests, but by a struggle for transnational\nsupremacy among elites with no local loyalties. The growing\ncentralization of political power was abetted by the levelling forces\nof the socialist movement, with its own internationalist pretensions.\nThis trend also underlay what Bauer called political pauperism, a\ngeneralised disqualification of individuals from participation in\npolitical activity. The conclusion of this process would be to perfect\nmass society, which Bauer had analyzed since the 1840s. The principle\nof substance, non-differentiation, and conformity would reach its\nultimate extension, and could then be overthrown. World imperialism\nwould issue in an all-embracing catastrophe, the apocalyptic end of\nthe old, Christian-Germanic order. Only then would new cultural\npossibilities emerge. Though these could not be predicted in detail,\nthey would involve the emergence of an unprecedented creative\nindividuality, freed from religious and metaphysical illusions.\n\nBauer likened the present crisis to the end of the classical world in\nRoman imperialism. His studies in the 1850s located the origins of\nChristianity in the second century CE, concluding that the first\ngospel was written under Hadrian (117–138 CE), though slightly\npredated by some of the Pauline epistles. Bauer traced the evolution\nof Christian ideas from Hellenism and Stoicism, deriving the logos\ndoctrine of John’s gospel from Philo and neo-Platonic sources.\nAs in Herr Dr. Hengstenberg, he denied that Christianity had\nemerged directly from Judaism. More than in his early work, though, he\nnow stressed the revolutionary power of the early Christian religion,\nas a source of liberation for the excluded and impoverished elements\nof the Roman Empire. His final book described Christianity as the\nsocialist culmination of Greek and Roman history. Responding to this\nargument in his very positive obituary of Bauer, Friedrich Engels\nacknowledged the importance of Bauer’s late work for the\nsocialist critique of religion (Sozialdemokrat, 1882). In\n1908, Karl Kautsky’s book, The Origins of Christianity,\napplied Bauer’s thesis.\n\nBauer’s late writings identified sentiment and pietistic\nfeeling-certainty, rather than autonomous reason, as the principal\nforce in shaping modern subjectivity. His studies of the Quakers and\nof pietism described passive inwardness and sentiment as the dominant\ncharacteristics of the German Enlightenment. The practical reason of\nKant and Fichte merely translated the inner voice of pietist\nconscience into a rationalist idiom. Bauer also described pietism as\nthe end of Christianity, since it destroyed dogma in favour of inner\nillumination and personal moral rectitude. Consistent with his\nChristianity Revealed, Bauer continued to define positive or\nstatutory religions by their exclusive dogmas and symbols; and he\nstill saw the general course of history as dissipating these dogmas,\nas mere illusions. He discounted the mobilizing potential of religion\nin the modern imperial order. In the Posaune, he had denounced\nSchleiermacher’s efforts to restore dogmatic Christianity\nthrough an appeal to feelings of dependency. Now he claimed that the\nforce of sentiment, contrary to Schleiermacher’s supposition,\nwas to dissolve dogmatic religion into personal conviction. The new\nworld empire would end with the inner erosion of religious belief. Not\nrational speculation, but sentiment, would effect this\ntransformation.\n\nA stringent anti-nationalism and a marked anti-Semitism characterized\nBauer’s later thought. He defended German culture against its\npolitical appropriation by the Prussian and Austrian regimes, but\ncriticized its insufficiencies, in Goethe, for example, who remained\nenthralled to the metaphysical tradition. Bauer stressed that Germany\nwas not a racial unit, but a historical and cultural artefact,\nreinforced by racial mixing, and not by racial purity (Barnikol 1972,\np. 393). It is clear, however, that some elements were excluded from\nthe mix: unlike his earlier treatment of the Jewish question as\nhistorical, cultural, and religious, he now asserted that a natural\ndistinction of race created an impassable divide between Jews and\nEuropeans (Bauer, “Present Position of the Jews,” 1852).\nHis claim that the political significance of the Jews throughout the\npolitical spectrum was a testimony to the debility of European culture\nand to the approaching crisis was greeted by National-Socialist\nauthors.\n\nBauer’s late work contains prescient observations on\nglobalization and world war, and has affinities with a variety of\ntwentieth-century ideological forms, from socialism to imperialism and\nanti-Semitism. In contrast, his early work bespeaks an original,\nHegelian republicanism, and offers cogent analyses of Restoration\npolitical thought and the rise of mass society. His intellectual\nlegacy is complex and contentious.\n4. Recent Developments\n\nBauer’s bicentennary in September 2009 was the occasion for a\nthree-day international conference, held at the\nFriedrich-Schiller-Universität, Jena, and in Bauer’s nearby\nbirthplace of Eisenberg, to examine his problematic legacy for\nphilosophy, theology, and social thought. The conference sought to\nretrieve the complex theoretical debates underlying the collapse of\nthe Hegelian system. Bauer’s reformulation and radicalisation of\nHegel were contrasted with the criticisms of Ludwig Feuerbach, Max\nStirner, and Karl Marx; and the specific character of his Vormärz\nradicalism was underlined, whether in his republicanism or in his\ntheological insights and critique. Disputed issues involved the\ncontent, continuity, and political bearing of Bauer’s pre-1848\nworks, his relations with his contemporaries in the Hegelian School,\nthe question of his anti-Semitism, and his attitudes toward\nimperialism and history after 1848. Also highlighted was the later\nBauer’s reception by twentieth-century conservatives such as\nCarl Schmitt. The Proceedings of the conference were published in 2010\n(Kodalle and Reitz, eds., 2010)\n\nAn important dimension of recent\nwork is a closer specification of Bauer’s early interpretation of\nHegel, especially through the recently-published 1828 Lectures on\nAesthetics (Schimmenti 2020), and an investigation of Bauer’s\nrelations to Karl Marx in 1839 to 1842 (Kangal 2020). The question of\nthe politicization of art by conservative forces in Prussia after\n1840, and the Left-Hegelian responses to this tendency, including\nBauer’s, are examined in Schimmenti 2021.\n\nAnother aspect of recent Bauer research is a more thorough elaboration\nof his 1840’s perfectionist ethic, through the application to\nhis thought of the concept of ‘post-Kantian perfectionism’\n(Moggach 2011; Sorensen and Moggach 2020). In Leibniz or Christian\nWolff, pre-Kantian perfectionist doctrines, of Aristotelian\ninspiration, stressed the ethical objective of happiness (broadly\nunderstood as material, intellectual, and spiritual wellbeing) and the\ncomplementarity of properly understood individual interests.\nPost-Kantian perfectionism acknowledges Kant’s critique of these\nearlier eudaemonist forms (described by him as ‘rational\nheteronomy’), with their implications of political tutelage and\npaternalistic ‘enlightened despotism’. Unwilling to\nrelinquish the terrain of self-fashioning and self-realisation,\nhowever, which Kant depoliticises but retains in his doctrine of\nvirtue, post-Kantian perfectionists like Schiller, Fichte, or Bauer\nseek a reformulation rather than a complete repudiation of\nperfectionist ethics, one that would be compatible with modern\nrepublican forms of life. Instead of happiness, these new versions\nstress the central value of freedom as a process or a conquest. The\nend in light of which actions, relations, and legal forms and\ninstitutions can be assessed is rational self-determination and the\npromotion of the necessary political and social conditions of its\nexercise. Whereas the older perfectionism had in general envisaged the\nthriving of a relatively fixed human nature, the post-Kantian versions\nstress the historical variability of cultural experiences and the\ndeterminability rather than the fixity of the self, its openness to\ncritique and self-conscious fashioning. In contrast to older views,\nthe harmony and complementarity of interests is a problematic task, an\naspect of rational self-shaping, rather than a preconceived given. The\ndiversity and conflictual character of modern life, the culture of\ndiremption as Schiller and Hegel had described it, must be taken into\naccount as the material element of a post-Kantian perfectionist ethic.\nBruno Bauer’s conceptions of history and emancipation in the\n1840s, it has been argued, are consistent with this approach.\n\nA contrasting tendency in recent research is to revive older views of\nthe Hegelian School as a whole, or in particular of Bauer, as\nphilosophically vacuous and politically disengaged, or else\npolitically counterproductive. Such a view originated in Marx’s\ndevastating depictions in the Holy Family, in Arnold Ruge’s\npolemics with the Berlin Hegelians known as Die Freien (“The\nFree”) in late 1842–43, and in other contemporary sources\nsuch as Rudolf Haym (1857), who attributed the failures of the\nRevolution of 1848 to the excessive radicalism of Hegel’s\nyouthful followers. An analogous judgement has recently been made on\nthe Hegelian movement (de Vos, 2012), with the New Hegelians being\ndistanced from Hegel as promoters of mere ideology rather than serious\nengagement with philosophical and political issues. While rejecting\nsuch negative judgements on the Hegelian School as a whole, the editor\nof a recent important documentary collection from the period is highly\ncritical of Bruno Bauer, arguing that both his philosophical\nimportance and his personal prominence in the Hegelian movement have\nbeen inflated in recent research (Hundt 2010, Apparat, pp.\n43–44). In his otherwise very positive review, Michael Quante\noffers a rejoinder to Hundt’s conclusions on Bauer (Quante,\n2010, 201–02). In other recent work, Sorensen (2011) validates\nBauer’s republican credentials before 1848, and examines his\nsubsequent disillusionment, along with that of his fellow\nLeft-Hegelian radicals after the defeat of the revolutions. Greiert\n(2020) examines Bauer’s anti-Semitism as an adaptation of\nEnlightenment rationality, and argues that Bauer’s final works, in\ndepicting early Christianity as a popular revolutionary movement\nagainst the power structures of the ancient world, foreshadow some\nforms of contemporary populism.\n\nA recent French edition of La trompette du jugement dernier\n(trans. Henri-Alexis Baatsch, with a commentary by Nicolas Dessaux\ntitled “De Marx comme trompettiste”) contains a\ntranslation of Bauer’s anonymous 1841 text, Die Posaune des\njüngsten Gerichts. This new translation slightly revises\nBaatsch’s earlier translation of La Trompette du jugement\ndernier contre Hegel, l’athée et\nl’antéchrist. Un ultimatum (1841). Dessaux’s\ncommentary revives the authorship debate surrounding Die\nPosaune and its continuation, Hegel’s Lehre der\nReligion und Kunst (1842), by attributing much of the earlier\ntext to Karl Marx, though previous literature has challenged similar\nclaims. The grounds offered by Dessaux are that Marx possessed the\nrequisite philosophical and biblical competence to compose the text\nhimself, and that it contains typically Marxian turns of phrase. The\nissue of Marx’s potential collaboration on these texts had been\nraised previously; for example, the 1967 reissue of Hegels\nLehre by Scientia Verlag, Aalen, had identified Marx as the\npossible author of the section of that text entitled “Hegels\nHaß gegen die heilige Geschichte und die göttliche Kunst\nder heiligen Geschichtsschreibung” (pp. 67–227). For\nearlier literature that questions the attribution to Marx, see Moggach\n2003 (p. 222, note 59). The question of possible collaboration is also\ndiscussed in Marx-Engels Gesamtausgabe (MEGA1), David\nRyazanov (ed.), 1929, I/2, p XLIV.  The relevant literature on a\npossible Marx collaboration is detailed in Kangal 2020, n. 9 and 16.\n",
    "bibliography": {
        "categories": [
            "<a name=\"MajWorBruBau182\">Major Works by Bruno Bauer, 1829–1882</a>",
            "<a name=\"JouEdiBruBau\">Journals edited by Bruno Bauer</a>",
            "<a name=\"SecSou\">Secondary Sources</a>"
        ],
        "cat_ref_text": {
            "<a name=\"MajWorBruBau182\">Major Works by Bruno Bauer, 1829–1882</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>De pulchri principiis</em>. Prussian royal prize manuscript,\nfirst published as <em>Prinzipien des Schönen. De pulchri\nprincipiis. Eine Preisschrift</em>, hrsg. Douglas Moggach und Winfried\nSchultze, mit einem Vorwort von Volker Gerhardt, Berlin: Akademie\nVerlag, 1996. Italian-Latin edition: Douglas Moggach and Gabriele\nSchimmenti, eds., <em>Sui principi del bello</em>, Palermo University\nPress, Palermo, 2019",
                "“Rezension: <em>Das Leben Jesu, kritisch bearbeitet</em> von\nDavid Friedrich Strauss,” <em>Jahrbücher für\nwissenschaftliche Kritik</em>, Dec. 1835, no. 109, 879–880; no.\n111, 891; no. 113, 905–912. May 1836, no. 86, 681–688; no.\n88, 697–704.",
                "<em>Kritik der Geschichte der Offenbarung. Die Religion des alten\nTestaments in der geschichtlichen Entwicklung ihrer Prinzipien\ndargestellt</em>, 2 vol., Berlin, 1838.",
                "<em>Herr Dr. Hengstenberg</em>, Berlin, 1839.",
                "(anon., 1st ed.) <em>Die evangelische Landeskirche Preußens\nund die Wissenschaft</em>, Leipzig, 1840; second edition, with author\nindicated, 1840.",
                "<em>Kritik der evangelischen Geschichte des Johannes</em>, Bremen,\n1840.",
                "“Der christliche Staat und unsere Zeit,” <em>Hallische\nJahrbücher für deutsche Wissenschaft und Kunst</em>,\n7–12 June 1841, no 135–140, pp. 537–558.",
                "<em>Kritik der evangelischen Geschichte der Synoptiker</em>, 2\nvol. (Leipzig, 1841); <em>Kritik der evangelischen Geschichte der\nSynoptiker und des Johannes, Dritter und letzter Band</em>,\nBraunschweig, 1842.",
                "(anon.) <em>Die Posaune des jüngsten Gerichts über Hegel\nden Atheisten und Antichristen. Ein Ultimatum</em>, Leipzig, 1841;\n<em>The Trumpet of the Last Judgement against Hegel the Atheist and\nAntichrist. An Ultimatum</em>, trans. L. Stepelevich, Lewiston, NY: E.\nMellen Press, 1989.",
                "<em>La Trompette du jugement dernier contre Hegel,\nl’athée et l’antéchrist. Un ultimatum</em>,\n1841, trans. Henri-Alexis Baatsch, Paris: Aubier-Montaigne, 1972.",
                "<em>La Trompette du jugement dernier</em>, trans. Henri-Alexis\nBaatsch, with a commentary by Nicolas Dessaux (“ De Marx comme\ntrompettiste”), Paris: l’Échappée,\n2016.",
                "(anon.) <em>Hegels Lehre von der Religion und Kunst von dem\nStandpuncte des Glaubens aus beurtheilt</em>, Leipzig, 1842; new\nedition Aalen: Scientia Verlag, 1967.",
                "<em>Die gute Sache der Freiheit und meine eigene\nAngelegenheit</em>, Zürich und Winterthur, 1842.",
                "<em>Die Judenfrage</em>, Braunschweig, 1843.",
                "articles in Arnold Ruge (ed.), <em>Anekdota zur neuesten deutschen\nPhilosophie und Publizistik</em>, vol. 2, Zürich und Winterthur,\n1843: “Leiden und Freuden des theologischen\nBewußtseins”, 89–112; “Rezension:\n‘Bremisches Magazin für evangelische Wahrheit\ngegenüber dem modernen Pietismus. Erstes Heft’”,\n113–134; “Rezension: <em>Einleitung in die\nDogmengeschichte</em> von Theodor Kliefoth.”135–159;\n“Rezension: <em>Die Geschichte des Lebens Jesu mit steter\nRücksicht auf die vorhandenen Quellen</em> dargestellt von Dr.\nvon Ammon. Leipzig, 1842” 160–185.",
                "<em>Das entdeckte Christenthum. Eine Erinnerung an das 18.\nJahrhundert und ein Beitrag zur Krisis des 19</em>, Zürich und\nWinterthur, 1843.",
                "“Die Fähigkeit der heutigen Juden und Christen, frei zu\nwerden,” in Georg Herwegh (ed.), <em>Einundzwanzig Bogen aus der\nSchweiz</em>, Zürich und Winterthur, 1843, 56–71.",
                "<em>Geschichte der Politik, Kultur und AufklÄrung des\nachtzehnten Jahrhunderts</em>, 4 vols., Charlottenburg:\n1843–45.",
                "<em>Denkwürdigkeiten zur Geschichte der neueren Zeit seit der\nfranzösischen Revolution</em>, Charlottenburg,\n1843–1844.",
                "<em>Briefwechsel zwischen Bruno Bauer und Edgar Bauer während\nder Jahre 1839–1842 aus Bonn und Berlin</em>, Charlottenburg,\n1844.",
                "“Was ist jetzt der Gegenstand der Kritik?” <em>Allg.\nLit-Ztg</em>. VIII, July 1844, 18–26.",
                "“Die Gattung und die Masse”, <em>Allg. Lit.-Ztg.</em>\nX, September 1844, 42–48.",
                "<em>Acktenstücke zu den Verhandlungen über die\nBeschlagnahme der “Geschichte der Politik, Kultur und\nAufklärung des achtzehnten Jahrhunderts”</em>, von Bruno\nBauer. Teil I herausgegeben von Bruno Bauer, Christiania: Verlag von\nC.C. Werner, 1844.",
                "(anon.)“Charakteristik Ludwig Feuerbachs,” <em>Wigands\nVierteljahrschrift</em> III, 1845, 86–146.",
                "<em>Geschichte Deutschlands und der französischen Revolution\nunter der Herrschaft Napoleons</em>, 2 vols., Charlottenburg,\n1846.",
                "<em>Vollständige Geschichte der Parteikämpfe in\nDeutschland während der Jahre 1842–1846</em>,\nCharlottenburg, 1847.",
                "“Erste Wahlrede von 1848,” and\n“Verteidigungsrede Bruno Bauers vor den Wahlmännern des\nVierten Wahlbezirkes am 22.2. 1849,” in E. Barnikol, <em>Bruno\nBauer: Studien und Materialien</em>, 518–531.",
                "<em>Die bürgerliche Revolution in Deutschland seit dem\nAnfange der deutschkatholischen Bewegung</em>, Charlottenburg,\n1849.",
                "<em>Untergang des Frankfurter Parlaments</em>, Charlottenburg,\n1849.",
                "<em>Kritik der paulinischen Briefe</em>, Berlin,\n1850–1851.",
                "<em>Kritik der Evangelien und Geschichte ihres Ursprungs</em>, 3\nvol., Berlin, 1850–1851; 4th vol. under the title <em>Die\ntheologische Erklärung der Evangelien</em>, Berlin, 1852.",
                "“The Present Position of the Jews,” <em>New York Daily\nTribune</em>, June 7, 1852.",
                "<em>Russland und das Germanenthum</em>, 2 vol., Charlottenburg,\n1853.",
                "<em>De la dictature occidentale</em>, Charlottenburg, 1854.",
                "<em>Deutschland und das Russenthum</em>, Charlottenburg,\n1854.",
                "<em>Die russische Kirche. Schlussheft</em>, Charlottenburg,\n1855.",
                "<em>Das Judenthum in der Fremde. Separat-Abdruck aus dem\nWagener’schen Staats- und Gesellschaftslexikon</em>, Berlin,\n1863.",
                "<em>Freimaurer, Jesuiten und Illuminaten in ihrem geschichtlichen\nZusammenhange</em>, Berlin, 1863.",
                "<em>Philo, Strauss und Renan und das Urchristenthum</em>, Berlin,\n1874.",
                "<em>Einfluss des englischen Quäkerthums auf die deutsche\nCultur und auf das englisch-russische Project einer Weltkirche</em>,\nBerlin, 1878.",
                "<em>Christus und die Cäsaren. Der Ursprung des Christenthums\naus dem römischen Griechenthum</em>, Berlin, 1879.",
                "<em>Zur Orientierung über die Bismarck’sche\nÄra</em>, Chemnitz, 1880.",
                "<em>Disraelis romantischer und Bismarcks socialistischer\nImperialismus</em>, Chemnitz, 1882.\n</ul>\n<h3>"
            ],
            "<a name=\"JouEdiBruBau\">Journals edited by Bruno Bauer</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Zeitschrift für spekulative Theologie</em>, Berlin, three\nvolumes, 1836–1838.",
                "<em>Allgemeine Literatur-Zeitung</em>, Charlottenburg, 12 issues\nDecember 1843–October 1844. Second edition under the title:\n<em>Streit der Kritik mit den modernen Gegensätzen</em>,\nCharlottenburg, 1847.",
                "<em>Norddeutsche Blätter. Eine Monatschrift für Kritik,\nLiteratur und Unterhaltung</em>, Charlottenburg. 10 issues July\n1844–April 1845. Second edition under the title:\n<em>Beiträge zum Feldzuge der Kritik. Norddeutsche Blätter\nfür 1844 und 1845</em>, Berlin, 1846.",
                "collaboration in Friedrich Wilhelm Hermann Wagener, ed., <em>Neues\nConversations-Lexikon. Staats- und Gesellschafts-Lexikon</em>, 23\nvol., Berlin, 1859–1867.",
                "collaboration in <em>Schmeitzner’s Internationale\nMonatsschrift. Zeitschrift für allgemeine nationale Kultur und\nderen Literatur</em>, Chemnitz, 1882.\n</ul>\n<h3>"
            ],
            "<a name=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<h4>Books and Articles</h4>\n<ul class=\"hanging\">",
                "Barnikol, Ernst, 1972, <em>Bruno Bauer, Studien und\nMaterialien</em>, aus dem Nachlass ausgewählt und\nzusammengestellt von P. Riemer und H.-M. Sass, Assen: van Gorcum.",
                "Brazill, W.J., 1970, <em>The Young Hegelians</em>, New Haven: Yale\nUniversity Press.",
                "Brudney, Daniel, 1998, <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.",
                "Cesa, Claudio, 1972, <em>Studi sulla Sinistra hegeliana</em>,\nUrbino: Argalia.",
                "de Vos, Lu, 2012, “Rezension: <em>The New Hegelians</em>,\ned. Douglas Moggach” <em>Hegel-Studien</em>, 46: 283–285",
                "Engels, Friedrich, 1882, “Bruno Bauer und das\nUrchristentum,” <em>Sozialdemokrat</em>, May 4 and 11.",
                "Eßbach, Wolfgang, 1988, <em>Die Junghegelianer. Soziologie\neiner Intellektuellengruppe</em>, München: Wilhelm Fink\nVerlag.",
                "Gargano, Antonio, 2003, <em>Bruno Bauer</em>, Naples: Città\ndel Sole.",
                "Greiert, Andreas, 2020, “‘Kritische Kritik’ und\n‘pathische Projektion’. Elemente des modernen\nAntisemitismus bei Bruno Bauer,” <em>Zeitschrift für \nkritische Theorie</em>, 50/51: 109–29.",
                "Haym, Rudolf, 1857, <em>Hegel und seine Zeit</em>, Berlin:\nGaertner.",
                "Hertz-Eichenrode, Dieter, 1959, <em>Der Junghegelianer Bruno Bauer\nim Vormärz</em>. Inauguraldissertation, Berlin: Freie\nUniversität.",
                "Hundt, Martin, ed., 2010, <em>Der Redaktionsbriefwechsel der\nHallischen, Deutschen und Deutsch-Französischen Jahrbücher\n(1837–1844)</em>, 3 volumes, Berlin: Akademie Verlag.",
                "Kangal, Kaan, 2020, “Marx’s ‘Bonn\nNotebooks’ in Context: Reconsidering the Relationship between\nBruno Bauer and Karl Marx Between 1839 and 1842,” <em>Historical\nMaterialism</em>, 28 (4): 102–38.",
                "Kautsky, Karl, 1908, <em>Der Ursprung des Christentums</em>,\nStuttgart: Dietz.",
                "Kautsky, Karl, 1915, <em>Nationalstaat, imperialistischer Staat\nund Staatenbund</em>, Nürnberg: Fränkische\nVerlagsanstalt.",
                "Kodalle, Klaus-M. and Tilman Reitz, eds., 2010, <em>Bruno Bauer\n(1809–1882): Ein “Partisan des Weltgeistes”?</em>,\nWürzburg: Königshausen &amp; Neumann.",
                "Leopold, David, 1999, “The Hegelian Antisemitism of Bruno\nBauer,” <em>History of European Ideas</em>, 25:\n179–206.",
                "Leopold, David, 2007, <em>The Young Karl Marx: German Philosophy,\nModern Politics, and Human Flourishing</em>, Cambridge: Cambridge\nUniversity Press.",
                "Löwith, Karl, 1967, <em>From Hegel to Nietzsche</em>, Garden\nCity: Doubleday.",
                "Mah, Harold, 1987, <em>The End of Philosophy and the Origin of\nIdeology. Karl Marx and the Crisis of the Young Hegelians</em>,\nBerkeley: University of California Press.",
                "Marx, Karl, 1975, “On the Jewish Question,”\n<em>Collected Works</em>, vol. 3, New York: International Publishers,\n146–74.",
                "Marx, Karl, Frederick Engels, 1975, “The Holy Family, or\nCritique of Critical Criticism,” <em>Collected Works</em>, vol.\n4, New York: International Publishers, 5–211; “The German\nIdeology,” <em>Collected Works</em>, vol. 5, New York:\nInternational Publishers, 1976, 19–539.",
                "Mayer, Gustav, 1913, “Die Anfänge des politischen\nRadikalismus im vormärzlichen Preußen,”\n<em>Zeitschrift für Politik</em>, Heft 1, Sonderdruck,\n1–113.",
                "McLellan, David, 1969, <em>The Young Hegelians and Karl Marx</em>,\nToronto: Macmillan.",
                "Moggach, Douglas, 2003, <em>The Philosophy and Politics of Bruno\nBauer</em>, Cambridge: Cambridge University Press; German translation,\n2009 <em>Philosophie und Politik bei Bruno Bauer</em>, trans. Brita\nIsabel Oeding, <em>Forschungen zum Junghegelianismus</em>, Frankfurt:\nLang.",
                "Moggach, Douglas (ed.), 2006, <em>The New Hegelians: Politics and\nPhilosophy in the Hegelian School</em>, Cambridge: Cambridge\nUniversity Press.",
                "Moggach, Douglas, 2011, “Post-Kantian Perfectionism,”\nin Douglas Moggach, ed., <em>Politics, Religion, and Art: Hegelian\nDebates</em>, Evanston, IL: Northwestern University Press, pp.\n179–200.",
                "Peled, Yoav, 1992, “From Theology to Sociology: Bruno Bauer\nand Karl Marx on the Question of Jewish Emancipation,”\n<em>History of Political Thought</em>, 13(3): 463–85.",
                "Pepperle, Ingrid, 1978, <em>Junghegelianische\nGeschichtsphilosophie und Kunsttheorie</em>, Berlin: Akademie\nVerlag.",
                "Quante, Michael, 2010, “Rezension: <em>Der\nRedaktionsbriefwechsel der Hallischen, Deutschen und\nDeutsch-Französischen Jahrbücher (1837–1844)</em>,\nHrsg. Martin Hundt”, <em>Hegel-Studien</em>, 45:\n197–202.",
                "Rambaldi, Enrico, 1966, <em>Le origini della sinistra\nhegeliana</em>, Florence: Nuova Italia.",
                "Rosen, Zvi, 1978, <em>Bruno Bauer and Karl Marx</em>, The Hague:\nNijhoff.",
                "Rossi, Mario, 1974, <em>Da Hegel a Marx III: La Scuola Hegeliana.\nIl giovane Marx</em>, 2nd edition, Milan: Feltrinelli.",
                "Sass, Hans-Martin, 1967, “Bruno Bauers Idee der Rheinischen\nZeitung”, <em>Zeitschrift für Religions- und\nGeistesgeschichte</em>, 19: 221–276.",
                "Sass, Hans-Martin, 1978, “Bruno Bauer’s Critical\nTheory,” <em>Philosophical Forum</em>, 8: 93–103.",
                "Schimmenti, Gabriele, 2020, “Bruno Bauer’s Critical\nTheory of Art and Hegel’s Lectures on Aesthetics in 1828–29,”\n<em>Studi di Estetica</em>, 16: 147–64.",
                "–––, 2021, <em>L’arte\ncontesa. L’estetica, la sinistra hegeliana e il giovane\nMarx</em>, Naples, Salerno: Orthotes.",
                "Schweitzer, Albert, 1998, <em>The Quest of the Historical Jesus. A\nCritical Study of its Progress from Reimarus to Wrede</em>, Baltimore:\nJohns Hopkins University Press.",
                "Schläger, Eduard, 1882, “Bruno Bauer und seine\nWerke,” <em>Schmeitzner’s Internationale\nMonatsschrift</em>, vol. 1, Chemnitz, 377–400.",
                "Sorensen, Michael Kuur, 2011, <em>Young Hegelians Before and After\n1848. When Theory Meets Reality</em>, Frankfurt am Main: Lang.",
                "Sorensen, Michael Kuur, and Douglas Moggach, 2020, “‘The\nRepublic of Self-Consciousness’. Bruno Bauer’s Post-Kantian\nPerfectionism,” in Douglas Moggach, Nadine Mooren, and Michael Quante\n(eds.), <em>Perfektionismus der Autonomie</em>, Paderborn: Fink/Brill,\npp. 203–26.",
                "Stepelevich, L.S., ed., 1983, <em>The Young Hegelians, An\nAnthology</em>, Cambridge: Cambridge University Press.",
                "Stuke, Horst, 1963, <em>Philosophie der Tat, Studien zur\n‘Verwirklichung der Philosophie’ bei den Junghegelianern\nund den Wahren Sozialisten</em>, Stuttgart: Ernst Klett Verlag.",
                "Toews, J.E., 1980, <em>Hegelianism. The Path toward Dialectical\nHumanism</em>, Cambridge: Cambridge University Press.",
                "Tomba, Massimiliano, 2002, <em>Crisi e critica in Bruno Bauer. Il\nprincipio di esclusione come fondamento del politico</em>, Naples:\nBibliopolis; translated as <em>Krise und Kritik bei Bruno Bauer.\nKategorien des Politischen im nachhegelschen Denken</em>, Frankfurt am\nMain: Peter Lang, 2005.",
                "van den Bergh van Eysinga, G.A., 1963, “Aus einer\nunveröffentlichten Biographie von Bruno Bauer. Bruno Bauer in\nBonn 1839–1842,” <em>Annali Feltrinelli</em>,\n329–386.",
                "Waser, Ruedi, 1994, <em>Autonomie des Selbstbewußtseins.\nEine Untersuchung zum Verhältnis von Bruno Bauer und Karl Marx\n(1835–1843)</em>, Tübingen: Francke Verlag.",
                "Zanardo, Aldo, 1966, “Bruno Bauer hegeliano e giovane\nhegeliano,” <em>Rivista critica di storia della filosofia</em>,\n189–210, 293–327.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"MajWorBruBau182\">Major Works by Bruno Bauer, 1829–1882</a></h3>\n<ul class=\"hanging\">\n<li><em>De pulchri principiis</em>. Prussian royal prize manuscript,\nfirst published as <em>Prinzipien des Schönen. De pulchri\nprincipiis. Eine Preisschrift</em>, hrsg. Douglas Moggach und Winfried\nSchultze, mit einem Vorwort von Volker Gerhardt, Berlin: Akademie\nVerlag, 1996. Italian-Latin edition: Douglas Moggach and Gabriele\nSchimmenti, eds., <em>Sui principi del bello</em>, Palermo University\nPress, Palermo, 2019 </li>\n<li>“Rezension: <em>Das Leben Jesu, kritisch bearbeitet</em> von\nDavid Friedrich Strauss,” <em>Jahrbücher für\nwissenschaftliche Kritik</em>, Dec. 1835, no. 109, 879–880; no.\n111, 891; no. 113, 905–912. May 1836, no. 86, 681–688; no.\n88, 697–704.</li>\n<li><em>Kritik der Geschichte der Offenbarung. Die Religion des alten\nTestaments in der geschichtlichen Entwicklung ihrer Prinzipien\ndargestellt</em>, 2 vol., Berlin, 1838.</li>\n<li><em>Herr Dr. Hengstenberg</em>, Berlin, 1839.</li>\n<li>(anon., 1st ed.) <em>Die evangelische Landeskirche Preußens\nund die Wissenschaft</em>, Leipzig, 1840; second edition, with author\nindicated, 1840.</li>\n<li><em>Kritik der evangelischen Geschichte des Johannes</em>, Bremen,\n1840.</li>\n<li>“Der christliche Staat und unsere Zeit,” <em>Hallische\nJahrbücher für deutsche Wissenschaft und Kunst</em>,\n7–12 June 1841, no 135–140, pp. 537–558.</li>\n<li><em>Kritik der evangelischen Geschichte der Synoptiker</em>, 2\nvol. (Leipzig, 1841); <em>Kritik der evangelischen Geschichte der\nSynoptiker und des Johannes, Dritter und letzter Band</em>,\nBraunschweig, 1842.</li>\n<li>(anon.) <em>Die Posaune des jüngsten Gerichts über Hegel\nden Atheisten und Antichristen. Ein Ultimatum</em>, Leipzig, 1841;\n<em>The Trumpet of the Last Judgement against Hegel the Atheist and\nAntichrist. An Ultimatum</em>, trans. L. Stepelevich, Lewiston, NY: E.\nMellen Press, 1989.</li>\n<li><em>La Trompette du jugement dernier contre Hegel,\nl’athée et l’antéchrist. Un ultimatum</em>,\n1841, trans. Henri-Alexis Baatsch, Paris: Aubier-Montaigne, 1972.</li>\n<li><em>La Trompette du jugement dernier</em>, trans. Henri-Alexis\nBaatsch, with a commentary by Nicolas Dessaux (“ De Marx comme\ntrompettiste”), Paris: l’Échappée,\n2016.</li>\n<li>(anon.) <em>Hegels Lehre von der Religion und Kunst von dem\nStandpuncte des Glaubens aus beurtheilt</em>, Leipzig, 1842; new\nedition Aalen: Scientia Verlag, 1967.</li>\n<li><em>Die gute Sache der Freiheit und meine eigene\nAngelegenheit</em>, Zürich und Winterthur, 1842.</li>\n<li><em>Die Judenfrage</em>, Braunschweig, 1843.</li>\n<li>articles in Arnold Ruge (ed.), <em>Anekdota zur neuesten deutschen\nPhilosophie und Publizistik</em>, vol. 2, Zürich und Winterthur,\n1843: “Leiden und Freuden des theologischen\nBewußtseins”, 89–112; “Rezension:\n‘Bremisches Magazin für evangelische Wahrheit\ngegenüber dem modernen Pietismus. Erstes Heft’”,\n113–134; “Rezension: <em>Einleitung in die\nDogmengeschichte</em> von Theodor Kliefoth.”135–159;\n“Rezension: <em>Die Geschichte des Lebens Jesu mit steter\nRücksicht auf die vorhandenen Quellen</em> dargestellt von Dr.\nvon Ammon. Leipzig, 1842” 160–185.</li>\n<li><em>Das entdeckte Christenthum. Eine Erinnerung an das 18.\nJahrhundert und ein Beitrag zur Krisis des 19</em>, Zürich und\nWinterthur, 1843.</li>\n<li>“Die Fähigkeit der heutigen Juden und Christen, frei zu\nwerden,” in Georg Herwegh (ed.), <em>Einundzwanzig Bogen aus der\nSchweiz</em>, Zürich und Winterthur, 1843, 56–71.</li>\n<li><em>Geschichte der Politik, Kultur und AufklÄrung des\nachtzehnten Jahrhunderts</em>, 4 vols., Charlottenburg:\n1843–45.</li>\n<li><em>Denkwürdigkeiten zur Geschichte der neueren Zeit seit der\nfranzösischen Revolution</em>, Charlottenburg,\n1843–1844.</li>\n<li><em>Briefwechsel zwischen Bruno Bauer und Edgar Bauer während\nder Jahre 1839–1842 aus Bonn und Berlin</em>, Charlottenburg,\n1844.</li>\n<li>“Was ist jetzt der Gegenstand der Kritik?” <em>Allg.\nLit-Ztg</em>. VIII, July 1844, 18–26.</li>\n<li>“Die Gattung und die Masse”, <em>Allg. Lit.-Ztg.</em>\nX, September 1844, 42–48.</li>\n<li><em>Acktenstücke zu den Verhandlungen über die\nBeschlagnahme der “Geschichte der Politik, Kultur und\nAufklärung des achtzehnten Jahrhunderts”</em>, von Bruno\nBauer. Teil I herausgegeben von Bruno Bauer, Christiania: Verlag von\nC.C. Werner, 1844.</li>\n<li>(anon.)“Charakteristik Ludwig Feuerbachs,” <em>Wigands\nVierteljahrschrift</em> III, 1845, 86–146.</li>\n<li><em>Geschichte Deutschlands und der französischen Revolution\nunter der Herrschaft Napoleons</em>, 2 vols., Charlottenburg,\n1846.</li>\n<li><em>Vollständige Geschichte der Parteikämpfe in\nDeutschland während der Jahre 1842–1846</em>,\nCharlottenburg, 1847.</li>\n<li>“Erste Wahlrede von 1848,” and\n“Verteidigungsrede Bruno Bauers vor den Wahlmännern des\nVierten Wahlbezirkes am 22.2. 1849,” in E. Barnikol, <em>Bruno\nBauer: Studien und Materialien</em>, 518–531.</li>\n<li><em>Die bürgerliche Revolution in Deutschland seit dem\nAnfange der deutschkatholischen Bewegung</em>, Charlottenburg,\n1849.</li>\n<li><em>Untergang des Frankfurter Parlaments</em>, Charlottenburg,\n1849.</li>\n<li><em>Kritik der paulinischen Briefe</em>, Berlin,\n1850–1851.</li>\n<li><em>Kritik der Evangelien und Geschichte ihres Ursprungs</em>, 3\nvol., Berlin, 1850–1851; 4th vol. under the title <em>Die\ntheologische Erklärung der Evangelien</em>, Berlin, 1852.</li>\n<li>“The Present Position of the Jews,” <em>New York Daily\nTribune</em>, June 7, 1852.</li>\n<li><em>Russland und das Germanenthum</em>, 2 vol., Charlottenburg,\n1853.</li>\n<li><em>De la dictature occidentale</em>, Charlottenburg, 1854.</li>\n<li><em>Deutschland und das Russenthum</em>, Charlottenburg,\n1854.</li>\n<li><em>Die russische Kirche. Schlussheft</em>, Charlottenburg,\n1855.</li>\n<li><em>Das Judenthum in der Fremde. Separat-Abdruck aus dem\nWagener’schen Staats- und Gesellschaftslexikon</em>, Berlin,\n1863.</li>\n<li><em>Freimaurer, Jesuiten und Illuminaten in ihrem geschichtlichen\nZusammenhange</em>, Berlin, 1863.</li>\n<li><em>Philo, Strauss und Renan und das Urchristenthum</em>, Berlin,\n1874.</li>\n<li><em>Einfluss des englischen Quäkerthums auf die deutsche\nCultur und auf das englisch-russische Project einer Weltkirche</em>,\nBerlin, 1878.</li>\n<li><em>Christus und die Cäsaren. Der Ursprung des Christenthums\naus dem römischen Griechenthum</em>, Berlin, 1879.</li>\n<li><em>Zur Orientierung über die Bismarck’sche\nÄra</em>, Chemnitz, 1880.</li>\n<li><em>Disraelis romantischer und Bismarcks socialistischer\nImperialismus</em>, Chemnitz, 1882.</li>\n</ul>\n<h3><a name=\"JouEdiBruBau\">Journals edited by Bruno Bauer</a></h3>\n<ul class=\"hanging\">\n<li><em>Zeitschrift für spekulative Theologie</em>, Berlin, three\nvolumes, 1836–1838.</li>\n<li><em>Allgemeine Literatur-Zeitung</em>, Charlottenburg, 12 issues\nDecember 1843–October 1844. Second edition under the title:\n<em>Streit der Kritik mit den modernen Gegensätzen</em>,\nCharlottenburg, 1847.</li>\n<li><em>Norddeutsche Blätter. Eine Monatschrift für Kritik,\nLiteratur und Unterhaltung</em>, Charlottenburg. 10 issues July\n1844–April 1845. Second edition under the title:\n<em>Beiträge zum Feldzuge der Kritik. Norddeutsche Blätter\nfür 1844 und 1845</em>, Berlin, 1846.</li>\n<li>collaboration in Friedrich Wilhelm Hermann Wagener, ed., <em>Neues\nConversations-Lexikon. Staats- und Gesellschafts-Lexikon</em>, 23\nvol., Berlin, 1859–1867.</li>\n<li>collaboration in <em>Schmeitzner’s Internationale\nMonatsschrift. Zeitschrift für allgemeine nationale Kultur und\nderen Literatur</em>, Chemnitz, 1882.</li>\n</ul>\n<h3><a name=\"SecSou\">Secondary Sources</a></h3>\n<h4>Books and Articles</h4>\n<ul class=\"hanging\">\n<li>Barnikol, Ernst, 1972, <em>Bruno Bauer, Studien und\nMaterialien</em>, aus dem Nachlass ausgewählt und\nzusammengestellt von P. Riemer und H.-M. Sass, Assen: van Gorcum.</li>\n<li>Brazill, W.J., 1970, <em>The Young Hegelians</em>, New Haven: Yale\nUniversity Press.</li>\n<li>Brudney, Daniel, 1998, <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Cesa, Claudio, 1972, <em>Studi sulla Sinistra hegeliana</em>,\nUrbino: Argalia.</li>\n<li>de Vos, Lu, 2012, “Rezension: <em>The New Hegelians</em>,\ned. Douglas Moggach” <em>Hegel-Studien</em>, 46: 283–285\n</li>\n<li>Engels, Friedrich, 1882, “Bruno Bauer und das\nUrchristentum,” <em>Sozialdemokrat</em>, May 4 and 11.</li>\n<li>Eßbach, Wolfgang, 1988, <em>Die Junghegelianer. Soziologie\neiner Intellektuellengruppe</em>, München: Wilhelm Fink\nVerlag.</li>\n<li>Gargano, Antonio, 2003, <em>Bruno Bauer</em>, Naples: Città\ndel Sole.</li>\n<li>Greiert, Andreas, 2020, “‘Kritische Kritik’ und\n‘pathische Projektion’. Elemente des modernen\nAntisemitismus bei Bruno Bauer,” <em>Zeitschrift für \nkritische Theorie</em>, 50/51: 109–29.</li>\n<li>Haym, Rudolf, 1857, <em>Hegel und seine Zeit</em>, Berlin:\nGaertner.</li>\n<li>Hertz-Eichenrode, Dieter, 1959, <em>Der Junghegelianer Bruno Bauer\nim Vormärz</em>. Inauguraldissertation, Berlin: Freie\nUniversität.</li>\n<li>Hundt, Martin, ed., 2010, <em>Der Redaktionsbriefwechsel der\nHallischen, Deutschen und Deutsch-Französischen Jahrbücher\n(1837–1844)</em>, 3 volumes, Berlin: Akademie Verlag.</li>\n<li>Kangal, Kaan, 2020, “Marx’s ‘Bonn\nNotebooks’ in Context: Reconsidering the Relationship between\nBruno Bauer and Karl Marx Between 1839 and 1842,” <em>Historical\nMaterialism</em>, 28 (4): 102–38.</li>\n<li>Kautsky, Karl, 1908, <em>Der Ursprung des Christentums</em>,\nStuttgart: Dietz.</li>\n<li>Kautsky, Karl, 1915, <em>Nationalstaat, imperialistischer Staat\nund Staatenbund</em>, Nürnberg: Fränkische\nVerlagsanstalt.</li>\n<li>Kodalle, Klaus-M. and Tilman Reitz, eds., 2010, <em>Bruno Bauer\n(1809–1882): Ein “Partisan des Weltgeistes”?</em>,\nWürzburg: Königshausen &amp; Neumann.</li>\n<li>Leopold, David, 1999, “The Hegelian Antisemitism of Bruno\nBauer,” <em>History of European Ideas</em>, 25:\n179–206.</li>\n<li>Leopold, David, 2007, <em>The Young Karl Marx: German Philosophy,\nModern Politics, and Human Flourishing</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Löwith, Karl, 1967, <em>From Hegel to Nietzsche</em>, Garden\nCity: Doubleday.</li>\n<li>Mah, Harold, 1987, <em>The End of Philosophy and the Origin of\nIdeology. Karl Marx and the Crisis of the Young Hegelians</em>,\nBerkeley: University of California Press.</li>\n<li>Marx, Karl, 1975, “On the Jewish Question,”\n<em>Collected Works</em>, vol. 3, New York: International Publishers,\n146–74.</li>\n<li>Marx, Karl, Frederick Engels, 1975, “The Holy Family, or\nCritique of Critical Criticism,” <em>Collected Works</em>, vol.\n4, New York: International Publishers, 5–211; “The German\nIdeology,” <em>Collected Works</em>, vol. 5, New York:\nInternational Publishers, 1976, 19–539.</li>\n<li>Mayer, Gustav, 1913, “Die Anfänge des politischen\nRadikalismus im vormärzlichen Preußen,”\n<em>Zeitschrift für Politik</em>, Heft 1, Sonderdruck,\n1–113.</li>\n<li>McLellan, David, 1969, <em>The Young Hegelians and Karl Marx</em>,\nToronto: Macmillan.</li>\n<li>Moggach, Douglas, 2003, <em>The Philosophy and Politics of Bruno\nBauer</em>, Cambridge: Cambridge University Press; German translation,\n2009 <em>Philosophie und Politik bei Bruno Bauer</em>, trans. Brita\nIsabel Oeding, <em>Forschungen zum Junghegelianismus</em>, Frankfurt:\nLang.</li>\n<li>Moggach, Douglas (ed.), 2006, <em>The New Hegelians: Politics and\nPhilosophy in the Hegelian School</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Moggach, Douglas, 2011, “Post-Kantian Perfectionism,”\nin Douglas Moggach, ed., <em>Politics, Religion, and Art: Hegelian\nDebates</em>, Evanston, IL: Northwestern University Press, pp.\n179–200.</li>\n<li>Peled, Yoav, 1992, “From Theology to Sociology: Bruno Bauer\nand Karl Marx on the Question of Jewish Emancipation,”\n<em>History of Political Thought</em>, 13(3): 463–85.</li>\n<li>Pepperle, Ingrid, 1978, <em>Junghegelianische\nGeschichtsphilosophie und Kunsttheorie</em>, Berlin: Akademie\nVerlag.</li>\n<li>Quante, Michael, 2010, “Rezension: <em>Der\nRedaktionsbriefwechsel der Hallischen, Deutschen und\nDeutsch-Französischen Jahrbücher (1837–1844)</em>,\nHrsg. Martin Hundt”, <em>Hegel-Studien</em>, 45:\n197–202.</li>\n<li>Rambaldi, Enrico, 1966, <em>Le origini della sinistra\nhegeliana</em>, Florence: Nuova Italia.</li>\n<li>Rosen, Zvi, 1978, <em>Bruno Bauer and Karl Marx</em>, The Hague:\nNijhoff.</li>\n<li>Rossi, Mario, 1974, <em>Da Hegel a Marx III: La Scuola Hegeliana.\nIl giovane Marx</em>, 2nd edition, Milan: Feltrinelli.</li>\n<li>Sass, Hans-Martin, 1967, “Bruno Bauers Idee der Rheinischen\nZeitung”, <em>Zeitschrift für Religions- und\nGeistesgeschichte</em>, 19: 221–276.</li>\n<li>Sass, Hans-Martin, 1978, “Bruno Bauer’s Critical\nTheory,” <em>Philosophical Forum</em>, 8: 93–103.</li>\n<li>Schimmenti, Gabriele, 2020, “Bruno Bauer’s Critical\nTheory of Art and Hegel’s Lectures on Aesthetics in 1828–29,”\n<em>Studi di Estetica</em>, 16: 147–64.</li>\n<li>–––, 2021, <em>L’arte\ncontesa. L’estetica, la sinistra hegeliana e il giovane\nMarx</em>, Naples, Salerno: Orthotes.</li>\n<li>Schweitzer, Albert, 1998, <em>The Quest of the Historical Jesus. A\nCritical Study of its Progress from Reimarus to Wrede</em>, Baltimore:\nJohns Hopkins University Press.</li>\n<li>Schläger, Eduard, 1882, “Bruno Bauer und seine\nWerke,” <em>Schmeitzner’s Internationale\nMonatsschrift</em>, vol. 1, Chemnitz, 377–400.</li>\n<li>Sorensen, Michael Kuur, 2011, <em>Young Hegelians Before and After\n1848. When Theory Meets Reality</em>, Frankfurt am Main: Lang.</li>\n<li>Sorensen, Michael Kuur, and Douglas Moggach, 2020, “‘The\nRepublic of Self-Consciousness’. Bruno Bauer’s Post-Kantian\nPerfectionism,” in Douglas Moggach, Nadine Mooren, and Michael Quante\n(eds.), <em>Perfektionismus der Autonomie</em>, Paderborn: Fink/Brill,\npp.  203–26.</li>\n<li>Stepelevich, L.S., ed., 1983, <em>The Young Hegelians, An\nAnthology</em>, Cambridge: Cambridge University Press.</li>\n<li>Stuke, Horst, 1963, <em>Philosophie der Tat, Studien zur\n‘Verwirklichung der Philosophie’ bei den Junghegelianern\nund den Wahren Sozialisten</em>, Stuttgart: Ernst Klett Verlag.</li>\n<li>Toews, J.E., 1980, <em>Hegelianism. The Path toward Dialectical\nHumanism</em>, Cambridge: Cambridge University Press.</li>\n<li>Tomba, Massimiliano, 2002, <em>Crisi e critica in Bruno Bauer. Il\nprincipio di esclusione come fondamento del politico</em>, Naples:\nBibliopolis; translated as <em>Krise und Kritik bei Bruno Bauer.\nKategorien des Politischen im nachhegelschen Denken</em>, Frankfurt am\nMain: Peter Lang, 2005.</li>\n<li>van den Bergh van Eysinga, G.A., 1963, “Aus einer\nunveröffentlichten Biographie von Bruno Bauer. Bruno Bauer in\nBonn 1839–1842,” <em>Annali Feltrinelli</em>,\n329–386.</li>\n<li>Waser, Ruedi, 1994, <em>Autonomie des Selbstbewußtseins.\nEine Untersuchung zum Verhältnis von Bruno Bauer und Karl Marx\n(1835–1843)</em>, Tübingen: Francke Verlag.</li>\n<li>Zanardo, Aldo, 1966, “Bruno Bauer hegeliano e giovane\nhegeliano,” <em>Rivista critica di storia della filosofia</em>,\n189–210, 293–327.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Feuerbach, Ludwig Andreas",
            "Hegel, Georg Wilhelm Friedrich",
            "idealism",
            "Kant, Immanuel",
            "Kant, Immanuel: social and political philosophy",
            "Marx, Karl",
            "Stirner, Max"
        ],
        "entry_link": [
            {
                "../ludwig-feuerbach/": "Feuerbach, Ludwig Andreas"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../idealism/": "idealism"
            },
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../kant-social-political/": "Kant, Immanuel: social and political philosophy"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../max-stirner/": "Stirner, Max"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bauer\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/bauer/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=bauer&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/bauer/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bauer": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/bauer/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=bauer&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/bauer/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.hegel.org/\" target=\"other\">Hegel Society of America</a>"
        ],
        "listed_links": [
            {
                "http://www.hegel.org/": "Hegel Society of America"
            }
        ]
    }
}