{
    "url": "bentham",
    "title": "Jeremy Bentham",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "James E. Crimmins\n<jcrimmin@uwo.ca>",
        "author_links": [
            {
                "mailto:jcrimmin%40uwo%2eca": "jcrimmin@uwo.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nJames E. Crimmins\n&lt;<a href=\"mailto:jcrimmin%40uwo%2eca\"><em>jcrimmin<abbr title=\" at \">@</abbr>uwo<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Mar 17, 2015",
        "substantive revision Wed Dec 8, 2021"
    ],
    "preamble": "\n\nJeremy Bentham, jurist and political reformer, is the philosopher\nwhose name is most closely associated with the foundational era of the\nmodern utilitarian tradition. Earlier moralists had enunciated several\nof the core ideas and characteristic terminology of utilitarian\nphilosophy, most notably John Gay, Francis Hutcheson, David Hume,\nClaude-Adrien Helvétius and Cesare Beccaria, but it was Bentham\nwho rendered the theory in its recognisably secular and systematic\nform and made it a critical tool of moral and legal philosophy and\npolitical and social improvement. In 1776, he first announced himself\nto the world as a proponent of utility as the guiding principle of\nconduct and law in A Fragment on Government. In An\nIntroduction to the Principles of Morals and Legislation (printed\n1780, published 1789), as a preliminary to developing a theory of\npenal law he detailed the basic elements of classical utilitarian\ntheory. The penal code was to be the first in a collection of codes\nthat would constitute the utilitarian pannomion, a complete\nbody of law based on the utility principle, the development of which\nwas to engage Bentham in a lifetime’s work and was to include\ncivil, procedural, and constitutional law. As a by-product, and in the\ninterstices between the sub-codes of this vast legislative edifice,\nBentham’s writings ranged across ethics, ontology, logic,\npolitical economy, judicial administration, poor law reform, prison\nreform, punishment, policing, international law, education, religious\nbeliefs and institutions, democratic theory, government, and\nadministration. In all these areas he made major contributions that\ncontinue to feature in discussions of utilitarianism, notably its\nmoral, legal, economic and political forms. Upon this rests\nBentham’s reputation as one of the great thinkers in modern\nphilosophy.\n",
    "toc": [
        {
            "#LifWri": "1. Life and Writings"
        },
        {
            "#PhiFou": "2. Philosophical Foundations"
        },
        {
            "#PaiPle": "3. Pains and Pleasures"
        },
        {
            "#Int": "3.1 Interests"
        },
        {
            "#FelCal": "3.2 Felicific Calculus"
        },
        {
            "#DimMarUti": "3.3 Diminishing Marginal Utility"
        },
        {
            "#LatImp": "4. Later Improvements"
        },
        {
            "#DisPrePri": "4.1 Disappointment-prevention Principle"
        },
        {
            "#GreHapPri": "4.2 Greatest Happiness Principle"
        },
        {
            "#UniInt": "4.3 Universal Interest"
        },
        {
            "#SubEndPriMax": "5. Subordinate Ends, Principles and Maxims"
        },
        {
            "#CivLawPolEco": "6. Civil Law and Political Economy"
        },
        {
            "#PenLawPun": "7. Penal Law and Punishment"
        },
        {
            "#Pan": "8. Panopticon"
        },
        {
            "#AdmGovConLaw": "9. Administration, Government, Constitutional Law"
        },
        {
            "#SecAgaMis": "9.1 Securities Against Misrule"
        },
        {
            "#Sov": "9.2 Sovereignty"
        },
        {
            "#PubOpiTri": "9.3 Public Opinion Tribunal"
        },
        {
            "#Inf": "10. Influence"
        },
        {
            "#CriCom": "11. Critics and Commentators"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Writings\n\nJeremy Bentham was born on 15 February 1748 and died on 6 June 1832 in\nLondon. He was the elder son of an attorney, Jeremiah Bentham\n(1712–92) and his first wife, Alicia Whitehorn (d. 1759), and\nbrother to Samuel (1757–1831), a naval architect and diplomat.\nBentham’s later interest in educational reform was rooted in his\nunhappy experiences at Westminster School (1755–60) and\nQueen’s College, Oxford (BA 1763, MA 1766). He described\nWestminster as “a wretched place for instruction”\n(1838–43, X, 30), while his three years at Queen’s, which\nhe entered at the age of twelve, were no more stimulating. He viewed\nthe Oxbridge colleges as seats of privilege, prejudice and idleness.\nHis Oxford experience left him with a deep distrust of oaths and\nsparked a general antipathy toward the Anglican establishment (2011,\n35–40). In the early 1770s, he jotted down notes for a critical\nwork on “Subscriptions [to articles of faith]” (UC v,\n1–32; xcvi, 263–341), and returned to the same theme in\nthe controversial tract Swear Not at All (1817).\n\nFollowing Oxford Bentham attended the Court of King’s Bench,\nWestminster Hall as part of his preparation for a law career. There he\nheard cases argued before Lord Mansfield, including the proceedings\nagainst the radical journalist and politician John Wilkes. He returned\nbriefly to Oxford in 1763–64 to attend lectures given by William\nBlackstone, the first Vinerian Professor of English Law, which were\npublished in four celebrated volumes as Commentaries on the Laws\nof England (1765–69). Bentham was not impressed, detecting\nglaring fallacies in Blackstone’s natural law reasoning. In the\nyears following other aspects of Blackstone’s theory received\nhis critical attention, notably his defence of England’s\n“mixed and balanced” government and English common law.\nThereafter Blackstone was associated in Bentham’s mind with the\n“every-thing-as-it-should-be” school of legal and\npolitical apologetics.\n\nBentham was called to the Bar in 1769, but his legal career lasted\nonly one brief. In that year he discovered the utility principle and\nrelated ideas in the writings of Hume, Helvétius and Beccaria\nand chose instead a career dedicated to analytic jurisprudence, law\nreform, and social and political improvement. Unaware of\nHutcheson’s version of the utilitarian formula in An Inquiry\ninto the Original of our Ideas of Beauty and Virtue (1729),\nBentham was occasionally deceived by faulty memory into thinking he\nhad discovered it in Priestley’s Essay on the First\nPrinciples of Government (1768). More plausible, however, are his\nclaims to have found it in Beccaria’s Dei Delitti e delle\nPene (1764), where the Italian law reformer announced that the\nonly valid criterion for evaluating the merits of a law is “la\nmessima felicità divisa nel maggior numero”—the\ngreatest happiness of the greatest number. In reading Hume’s\nTreatise of Human Nature (1739–40)—which declared\nthat all social inquiry should be based on the “experimental\nMethod of Reasoning”—Bentham found virtue equated with\nutility, at which he “felt as if scales had fallen from my\neyes” (1776 [1977, 440n]). Having borrowed the nomenclature of\nutility from Hume, Bentham then turned to De\nl’esprit (1758), in which Helvétius\ndelineated the potential for utility to act as a guide to human\nconduct by making a connection “between the idea attached to the\nword … ‘happiness’ … and the ideas attached\nto the words ‘pleasure’ and ‘pain’”.\nThis meant, as he recalled in the “Article on\nUtilitarianism” (1829), that “attached to the words\n‘utility’ and ‘principle of utility’ were now\nideas in abundance”, from which “a commencement was made\nof the application of the principle of utility to practical\nuses” (1983a, 290).\n\nBentham’s writings present distinct challenges for the historian\nof ideas: the dates of publication are not always consistent with the\ntime of composition, in some instances with many intervening years; a\ngood number were published posthumously, and some have still to appear\nin authoritative editions; many were produced, edited or translated by\nother hands from original manuscripts with little authorial\ncontrol.\n\nBentham launched his career as a legal theorist in 1776 with the\nanonymously published A Fragment on Government. This slim\nvolume is an offshoot of a larger critique of Blackstone that was not\npublished until the twentieth century, and is now known as A\nComment on the Commentaries. In the Fragment Bentham\nstated the “fundamental axiom” that “it is the\ngreatest happiness of the greatest number that is the measure of right\nand wrong”, and “the obligation to minister to general\nhappiness, was an obligation paramount to and inclusive of every\nother” (1776 [1977, 393, 440n]). In An Introduction to the\nPrinciples of Morals and Legislation (IPML), his major\nwork of this early period, he described utility as “that\nproperty in any object” which “tends to produce benefit,\nadvantage, good or happiness” (all commensurate terms in\nBentham’s moral vocabulary), and the utility principle as\n“that principle which approves or disapproves of every action\nwhatsoever, according to the tendency which it appears to have to\naugment or diminish the happiness of the party whose interest is in\nquestion” (1789 [1970, 12]). Bentham would give these basic\npostulates exposition, argumentative support, and further refinement\nin the decades following, but it was the operationalization of the\nutility principle that absorbed most of his energy and time during a\nlong and highly productive working life.\n\nIn 1781, Bentham—who delighted in inventing new terminology to\ndescribe philosophical concepts—coined the name\n“utilitarian” in recording a dream he had while a guest at\nthe country estate of his patron, the Whig politician William Petty,\n2nd Earl of Shelburne (1737–1805). In this dream he\nimagined himself “a founder of a sect; of course a personage of\ngreat sanctity and importance. It was called the sect of the\nutilitarians” (text of the dream in Crimmins 1990,\n314). It was through Shelburne that he became acquainted with the\nGenevan exile Étienne Dumont (1759–1829), who was to play\na critical role in making Bentham’s name and philosophy known in\ncontinental Europe and elsewhere through the publication of a number\nof translations and redactions of his early writings (1829–30;\nsee Blamires 2008). The most important of these were the three volumes\nof Traités de législation civil et\npénale (1802) assembled from early manuscript drafts,\nparts of IPML and other works. The first two volumes on civil\nand penal law were later re-translated into English by the American\nutilitarian Richard Hildreth and published as The Theory of\nLegislation (1840 [1864]), a text that remained at the centre of\nutilitarian studies in the English-speaking world through to the\nmiddle of the twentieth century.\n\nIn 1786–87 Bentham visited Russia, where his brother Samuel was\nin the pay of Prince Potemkin, the favourite of Empress Catherine.\nThere he wrote A Defence of Usury (1787), his first\ncontribution to economic affairs, in which he rejected Adam\nSmith’s defence of a legal maximum for interest rates. Bentham\nargued that Smith’s position was inconsistent with his general\nadvocacy of freedom of trade and would restrict economic growth and\nnational prosperity by deterring investment and innovation. The volume\nlater received high praise from J.S. Mill, who thought it “the\nbest extant writing on the subject” (1963–91, II, 923). It\nreceived its widest audience in America, where it was reprinted on\nmany occasions and frequently cited in the debates over the usury laws\n(Crimmins 2022, 53–54, 75, 209–11). It was in Russia, too,\nthat Bentham took an idea of Samuel’s and developed it into the\n“panopticon”, the full dimensions of which he explained in\nPanopticon; Or, The Inspection House (1791). The panopticon\nis a building of circular design intended for any institutional\narrangement where the “inmates” required constant\nsupervision—such as hospitals, schools, workhouses and poor\nhouses—but the panopticon became most well-known as a prison for\n“grinding rogues honest and idle men industrious”\n(1838–43, IV, 342). Appalled by the inefficiency and inhumane\nconditions in Britain’s penal regime, Bentham developed the idea\nof the panopticon penitentiary as a substitute penal system, in which\nconvicted criminals would be subject to a disciplinary regime based on\nthe maxim (penned in relation to his poor law writings of 1797, but\nnot then published) that “the more strictly we are watched, the\nbetter we behave” (2001, 277). In achieving the ends of\npunishment it represented a significant advance on the dilapidated\ncondition of England’s gaols, the rat-infested hulks anchored in\nthe Thames and the practice of transporting convicts into penal\nservitude in the colonies. In the years following, Bentham used this\ncritique as a platform to expand upon his general disdain for\ncolonies, first enunciated in Emancipate Your Colonies! in\n1793 (2002, 289–313), to argue for a free, self-governing\ncommunity of settlers in southern Australia in “Colonization\nCompany Proposal” (1831 [2022]; see also Causer, Finn and\nSchofield 2022).\n\nUpon his return from Russia, Bentham was encouraged by Shelburne to\nturn his attentions to foreign policy and international law. The term\n“international” was coined by Bentham. He drafted short\npapers on several topics that were later published under the general\ntitle Principles of International Law. This work included, as\nwas then the philosophical vogue, “A Plan for Perpetual\nPeace” and, uniquely, a proposal for an international court of\narbitration (1838–43, II, 535–71). Sympathetic to both\nRussia and France at this time, in 1789 he issued a critique of Prime\nMinister William Pitt’s war-like stance towards these countries\nin a series of letters in the Public Advertiser under the\nnom-de-plume “Anti-Machiavel” (1838–43, X,\n201–11).\n\nThe political upheaval in France provided Bentham with an opportunity\nto put certain of his ideas into practice and also the context in\nwhich he first developed the utilitarian logic of democracy based on\nthe identification of interests between the ruler and the ruled. He\nnevertheless stopped short of publicly advocating parliamentary reform\nin Britain and at this stage was very far from the republicanism he\nadopted in later life (Dinwiddy 1975; Crimmins 1994; Schofield 2006).\nWith Dumont’s assistance, in 1788 Bentham began sending\npamphlets of suggestions to the Comte de Mirabeau. In 1790 he wrote a\nDraught of a New Plan for the Organisation of a Judicial\nEstablishment in France which, together with Dumont’s\ntranslation of parts of Panopticon and parts of An Essay\non Political Tactics dealing with the organisation of\nlegislative proceedings, was also placed before the French National\nAssembly. The bloody excesses of the Terror reinforced his criticism\nof the abstract and slippery nature of natural and imprescriptible\nrights, which he famously dismissed as “nonsense on\nstilts” (1795 [2002, 330])—a disposition formed while\nlistening to Blackstone’s lectures and which shaped his\ncontribution to John Lind’s An Answer to the Declaration [of\nIndependence] of the American Congress (1776). Nevertheless,\nBentham’s efforts to stimulate reform in France were recognised\nin the granting of honorary citizenship in September 1792.\n\nWhen war broke out between England and revolutionary France,\nPitt’s security measures made it precarious to engage in reform\nactivities at home, but Bentham’s caution also stemmed from the\nneed to curry favour in official circles for the panopticon\npenitentiary (Semple 1993, 187–90). The building of a new prison\nin London had been authorised by the Penitentiary Act 1794 and\nBentham’s plan initially received the support of the Pitt\nadministration. Over the years he devoted considerable sums of his own\nmoney to the project, and published further material comparing the\nmerits of the panopticon with the disadvantages of the transportation\nsystem (2022). In 1802, however, he admitted defeat, and in 1812 the\ngovernment officially closed the books on the whole sorry affair,\npaying Bentham £23,000 in compensation.\n\nIn the intervening years Bentham turned his attentions to poor law\nreform, the reform of policing, economic and financial questions,\njudicial administration and the rules of evidence—the last of\nthese being a product of his critique of the archaisms and confusions\nof common law and the arbitrary character of “judge-made\nlaw” (Postema 1989).\n\nThe essays on poor law reform from 1796–98 (2001, 2010a) were\npartly stimulated by rising food prices and the resultant debate about\nthe treatment of the poor. The essays contained a plan for a system of\n“industry houses” run by a joint-stock company (named the\nNational Charity Company) to house the indigent, provide them with\nemployment, and provide welfare services for the working poor, the\nshort-term unemployed and disabled or unwell (Bahmueller 1981). On\npolice reform, Bentham was in advance of the age in advocating\npreventive policing and evidence-based crime analysis (see the essays\nin Jacques and Schofield 2021). Bentham’s writings on political\neconomy include A Manual of Political Economy\n(1790–95), A Protest Against Law Taxes (1795),\nSupply without Burthen; or Escheat Vice Taxation (1795),\n“Circulating Annuities” (1799–1800), “Paper\nMischief” (1800–1), The True Alarm\n(1801), Institute of Political Economy (1800–4), and\nDefence of a Maximum (1801). Few of these were published\nduring Bentham’s lifetime, and some only became known in the\nmid-twentieth century (Stark 1952–54), which explains their\nrelative neglect compared to the attention given the writings of other\npolitical economists of the period. New editions are now in progress\n(two volumes so far, 2016a, 2019, with more to come) which will\nprovide abundant material for a reassessment of Bentham’s\ncontributions to this field. The writings on monetary matters, in\nparticular, contain original and innovative solutions to practical\nfinancial and currency difficulties. While many of the economic\npolicies recommended and defended in these writings derive from\nBentham’s reading of Adam Smith—with the notable exception\nof the prescriptions contained in Defence of a\nMaximum—they are also expressly based on the subordinate\nends of his theory of civil law (Kelly 1989), as were his ideas for\npoor law reform (Quinn 2008).\n\nAfter ruminating on the subject for several years, Bentham took up the\nreform of judicial administration in Scotch Reform (1808),\nwhile the voluminous manuscripts on evidence from this time were later\nedited and published by J.S. Mill as Rationale of Judicial\nEvidence (1827). In the latter, Bentham laid down practical\nguidelines on the forms and admissibility of evidence, favouring\n“natural” over “technical” procedures as most\napt to produce truth in court proceedings and to rid the system of\nvexation, expense, and delay, which he attributed to the vested\ninterest of lawyers in maintaining an arrangement designed to maximize\nlegal fees. In courts open to the public, judges were to be charged\nwith following basic principles that would allow for the most complete\nand accurate testimony available (Twining 1985, 42, 70; Schofield\n2006, 119–31; Resnick 2011). Adjudication in Bentham’s\nreformed courts would require the strict application of the\nutilitarian codes of law. The overriding consideration was the\nsubordination of the judge to the lawmaker, though the judge may (if\nempowered) suspend the execution of the law where utility demanded,\npending a final decision by the legislature (Dinwiddy 1989a).\n\nDespite these wide and varied interests, the government’s\nbetrayal over the panopticon continued to anger Bentham for many\nyears, generating a deep-seated scepticism of the motives of those in\npositions of power and influence. Added to his own first-hand\nexperience of the maneuvers of aristocratic landowners determined to\nprevent the erection of a panopticon in the vicinity of their London\nestates, there was also a suggestion that the King himself, outraged\nby Bentham’s “Anti-Machiavel” letters and disturbed\nby rumours of his Jacobinism, may have directly intervened to thwart\nthe project (1830–31 [1838–43, XI, 96–105]). In\nBentham’s mind such actions were representative of the\n“sinister interests” typically ranged against beneficial\nschemes of reform. This insight served to draw Bentham into an open\nengagement with parliamentary reform. A further catalyst came from his\nassociation with James Mill, whom he met in late 1808, and who for\nmany years thereafter acted as his philosophical and political\naide-de-camp.\n\nWith Mill’s encouragement, Bentham returned to his earlier\nmanuscripts on political reform and refined and significantly expanded\nhis critique to encompass the forms of “influence” at work\nin British political institutions. The drafts he wrote in\n1809–10 provided the outlines for his first public statement in\nsupport of representative democracy in Plan of Parliamentary\nReform in the Form of a Catechism with Reasons for Each Article\n(1817). Based on the arithmetic of interests, aimed at limiting the\nsinister interests of those in positions of power while promoting the\ninterests of those without power, Bentham advocated a comprehensive\nset of reforms. These included: the elimination of royal patronage, a\nsubstantial extension of the franchise, annual elections by secret\nballot, the election of intellectually qualified and independent\nmembers of parliament with a system of fines to ensure regular\nattendance, and the accurate and regular publication of parliamentary\ndebates. Without these reforms Bentham believed Britain risked\nrevolution. From this point on, he became widely recognised as the\nforemost philosophical voice of political radicalism.\n\nOther political writings from this time include Defence of Economy\nagainst the Right Honourable Edmund Burke and Defence of\nEconomy against the Right Honourable George Rose, both written in\n1810 but not published until 1817 (1993, 39–155). These essays\nattacked waste and corruption in government and were later reissued,\nwith other previously published essays, in Official Aptitude\nMaximized, Expense Minimized (1830), the overall aim of which was\nto optimize the competence of public servants while reducing\ngovernment expenditure. In 1824, Bentham’s Book of\nFallacies appeared, in which he employed a humorous vein of barbs\nto lay bare the fallacious reasoning frequently used to bolster\nsinister interests and stymie proposals for reform (2015).\n\nBentham’s position on female suffrage at this time was nuanced\n(Boralevi 1984, Ch.2): he objected to the exclusion of women from the\nvote in James Mill’s 1820 essay “On Government” (UC\nxxxiv, 303), an exclusion he had long ago condemned as founded on\nnothing but prejudice (2002, 247; 1838–43, III, 463),\nNevertheless, in public he argued that women were to be excluded until\nsuch time as universal male suffrage had been achieved (1838–43,\nIX, 108).\n\nClosely related to Bentham’s critique of the political\nestablishment were his substantial criticisms of religious\ninstitutions, practices and beliefs in\nChurch–of–Englandism and its Catechism Examined\n(1818), An Analysis of the Influence of Natural Religion on the\nTemporal Happiness of Mankind (1822), and Not Paul, but\nJesus (1823). In these works he brought to bear with telling\nscepticism his reasoning on logic, language and ontology from the same\nperiod (1838–43, VIII, 193–338; Crimmins 1990). At about\nthe same time, he also wrote at length on private ethics in\nDeontology, published posthumously in two volumes in 1834.\nEducation was another topic that occupied Bentham in these years. In\nChurch–of–Englandism he was highly critical of\nthe education offered in the schools run by the National Society for\nPromoting the Education of the Poor in the Principles of the\nEstablished Church. When Mill, Francis Place and others became\ninvolved in a scheme to establish a non-sectarian school in London,\nBentham busied himself with ideas for its curriculum, stressing\nscience and vocational subjects over the classics, the first part of\nwhich (printed in 1815) appeared in 1816 in Chrestomathia\n(meaning “conducive to useful learning”) and a second part\nin 1817 (Itzkin 1978). While the Chrestomathic school was never built,\nin 1826 the same reformers, with support from a number of Evangelicals\nand Nonconformists, formed the nucleus of a group that succeeded in\nfounding University College London, England’s first secular\nuniversity. An important supplement to Bentham’s educational\ntheorizing is contained in a long appendix to the\nChrestomathia on logic and classification, later translated\nand edited by his nephew George Bentham and published as Essai sur\nla nomenclature et la classification des principles branches\nd’art-et-science (1823).\n\nIn his final years Bentham revisited aspects of his utilitarian\nphilosophy and sought to define his place in the utilitarian tradition\nin the “Article on Utilitarianism”. However, more often\nthan not his thoughts were focused on constitutional questions,\nincluding the administrative structures and the formal and informal\narrangements of a viable representative democracy—in short, the\nways and means of limiting and controlling political authority or, as\nBentham termed them, “securities against misrule”.\nCodification Proposal, Addressed … to all Nations\nProfessing Liberal Opinions (1822) was intended to advertise his\ncredentials as a codifier of law to politicians and statesmen around\nthe world, first by setting down the utilitarian principles of an\n“all-comprehensive” code, and second by providing\ntestimonials to his aptitude for the task of codification (1998,\n241–384; see also Lieberman 2011). The testimonials came from\nfar and wide in the years 1814–22, in the form of extracts from\nspeeches, requests for information, and letters of support, from the\nlikes of Francis Burdett and Henry Brougham in England, government\nministers and representatives of the Cortes in Spain and Portugal,\nItalian and French liberals, state governors and other political\nrepresentatives in the “Anglo-American States”, the\nRussian Emperor Alexander, and the influential Polish statesman Prince\nCzartoriski. In the years following, Bentham produced draft upon draft\nof elements of the Constitutional Code, only the first of\nthree volumes of which was published during his lifetime. In these\nwritings he unequivocally pinned his colours to the republican cause,\nbut also demonstrated an acute sense of the growing importance of the\nadministrative functions of the modern state (Rosenblum 1978; Hume\n1981; Rosen 1983).\n\nIn old age Bentham liked to style himself “the hermit of\nQueen’s Square Place” (the location of his home in\nLondon), but he was anything but a hermit. In December 1823 he\nprovided funds to start the Westminster Review, a periodical\ndedicated to radical views. He also assumed a leadership role in the\nmovement for law reform and political reform, maintained regular\ncontact with similarly inclined reformers, publishers and\nintellectuals at home and abroad, and was surrounded by disciples who\nacted as secretaries, collaborators, and editorial assistants. The\nMills, Place, George Grote, Richard Smith, Peregrine Bingham, Thomas\nSouthwood Smith, Edwin Chadwick, and John Bowring all worked with\nBentham in this way. Together with others, such as Thomas Perronet\nThompson, Charles Buller, John Roebuck and Joseph Hume, these later\ncame to be known as the “philosophic radicals” (a coinage\nof J.S. Mill’s), though in reality the group was far less\ncohesive than is sometimes thought (Thomas 1979). Bentham had a\ntelling influence on the Irish socialist utilitarian William Thompson\nand for a time he maintained close ties with the Irish\n“Liberator” Daniel O’Connell, whom he sought to\nbind, with limited success, to the radical cause in parliament\n(Crimmins 2013, Ch.7). Burdett and Brougham were also treasured\nacquaintances, though this did not prevent Bentham from expressing\nscepticism about the dedication to radical reform of the former, or\nfrom criticising the latter’s proposals to reform the Chancery\nCourt in Lord Brougham Displayed (1832 [1838–43, V,\n549–612).\n\nBentham never married, and died in the company of friends on the eve\nof the signing of the Great Reform Act. Convinced that even the dead\nshould serve a utilitarian purpose, in his last will he directed that\nhis body be publicly “anatomised” in order to publicize\nthe benefits of donating bodies for medical research (Richardson\n1986). The sanitary reformer and physician Thomas Southwood Smith\n(1832) delivered the eulogy over Bentham’s dissected remains. In\npreparation for this final act, in an unpublished pamphlet written in\nthe year before his death, Auto-Icon; or Farther Uses of the Dead\nto the Living (printed 1842, but not then published), he proposed\nthe display of auto-iconized bodies and heads as a means to public\ninstruction. He requested that his own mummified head and skeleton,\ndressed in his habitual garments, be displayed, and it can still be\nviewed today at University College London. Bentham’s (admittedly\neccentric and somewhat humorous) ideas about\n“auto-iconism” can also be understood as an attempt to\nfind a secular substitute for the rituals and practices of\nconventional religion.\n2. Philosophical Foundations\n\nPreliminary to the analysis of existing legal systems and the\nconstruction of the utilitarian pannomion, in 1776 Bentham\nbegan drafting “Preparatory Principles” (of censorial\njurisprudence or what the law ought to be). In these over 600 pages of\nmanuscript, now published in authoritative form in the Collected\nWorks (2016b), he offered a series of disquisitions on the\ndefinitions, distinctions, axioms, and aphorisms intended as tools for\ndemystifying the “fictions” of English law and legal\npractice, fictions which he found uncritically reiterated in\nBlackstone’s Commentaries. In these and other early\nwritings we see Bentham striving to emulate in the moral world the\ngreat advances made in physical science. In the process he consciously\nallied himself with the more progressive elements of the Enlightenment\nand made plain the intellectual influences that shaped his thought,\nnotably Bacon, Locke, Hume, and the French philosophes.\n\nInfluenced by the empiricism of Bacon and Locke, Bentham held that all\nknowledge is derived from sensation: the intellect has no material to\nwork with apart from that obtained by the senses. In the second half\nof the 17th century, the Royal Society had emphasized the\nrole of experiment and empiricist epistemology in the development of\nthe natural sciences. Suitably impressed by the progress made in this\ndepartment of knowledge, Bentham carried over into moral science the\nbasic principle that people can only know, in any certain or\nscientific sense of that term, that which can be observed and\nverified. He argued that legal science ought to be built on the same\nimmovable basis of sensation and experience as that of medicine,\ndeclaring “what the physician is to the natural body, the\nlegislator is to the political: legislation is the art of medicine\nexercised upon a grand scale” (UC xxxii, 168).\n\nThis was the core of the “experimental method” for\nBentham; it was an approach implicitly associated in his mind with a\nmaterialist ontology and a representational theory of meaning. He\nrejected all forms of idealism in philosophy and insisted that in\nprinciple all matter is quantifiable in mathematical terms, and this\nextends to the pains and pleasures that we experience—the\nultimate phenomena to which all human activity (and social concepts,\nsuch as rights and duty) could be reduced and explained.\n\nIn Bentham’s theory of language general terms have no\ncorresponding reality: words, ideas and propositions must represent or\ndescribe “real entities”, which may be either\n“perceptions” or “substances” (UC lxix,\n62–63), otherwise they are “fictitious entities”.\nThis was a distinction Bentham learnt from d’Alembert\n(1838–43, III, 286), though he turned it to a more radical\nontological purpose. He defined a fictitious entity as “a mere\nnothing” and “no proposition by which any property is\nascribed to it can therefore be in itself and of itself a true one,\nnor therefore an instructive one”. If there is any truth\nassociated with a fictitious entity it “can not belong to it in\nany other character than that of the intended and supposed equivalent\nof … some proposition having for its subject some real\nentity” (1838–43, VIII, 246). The technique of\n“paraphrasis” was the key instrument Bentham employed to\ndemystify fictitious entities. Some fictitious entities are necessary\nfor human discourse, but their meaning can only be revealed through\ntheir connection to real entities (1977, 495n; 2010b, 287–88,\n317–18); if a fictitious entity proves impervious to this\nparaphrastic technique it is shown to be a meaningless abstraction\nunrelated to demonstrable reality. Concepts such as\n“obligation” and “ interests”, for example,\ncan be rendered meaningful in terms of the perceptible pains and\npleasures experienced and anticipated by specific individuals.\nConcepts like “community” derive their meaning from the\nsum of individuals that compose an actual community, and the happiness\nof a community is nothing but the aggregate happiness of the\nindividuals that constitute the community in question. On the other\nhand, theological propositions, having no correlation with material\nreality, deal not with the facts of ordinary experience but with a\nsupposed “reality” that transcends the physical world, and\njust as the language of opinion ought to have no place in the\ndiscourse of physical science, so the untestable and unverifiable\npropositions of theology have no place in moral science.\n\nIn IPML, Bentham directed this analysis against a host of\nethical propositions he sought to eliminate as competing alternatives\nto the utility principle, such as “moral sense”,\n“common sense”, “law of reason”,\n“natural justice”, and “natural equity”. All\nare dismissed on the grounds that they are merely empty phrases that\nexpress nothing beyond the sentiment of the person who advocates them.\nNot representing verifiable reality, such phrases could not be\nconsidered useful. Indeed, they were surely pernicious, serving as a\n“pretense, and aliment, to despotism; if not … in\npractice, a despotism however in disposition” (1970, 28n). By\ncomparison, “utility” was a principle rooted in the\nempirical and verifiable facts of the felt experience of pains and\npleasures.\n3. Pains and Pleasures\n\nAt the beginning of IPML Bentham offered the famous\ndeclamation that underscores the primacy of pains and pleasures in\nutilitarian theory:\n\nNature has placed mankind under the governance of two sovereign\nmasters, pain and pleasure. It is for them alone to\npoint out what we ought to do, as well as to determine what we shall\ndo. On the one hand the standard of right and wrong, on the other the\nchain of causes and effects, are fastened to their throne. They govern\nus in all we do, in all we say, in all we think: every effort we can\nmake to throw off our subjection, will serve but to demonstrate and\nconfirm it. In words a man may pretend to abjure their empire: but in\nreality he will remain subject to it all the while. The principle\nof utility recognises this subjection, and assumes it for the\nfoundation of that system, the object of which is to rear the fabric\nof felicity by the hands of reason and of law. (1970, 11)\n\n\nThere are two forms of hedonism expressed in this seminal passage: (1)\npsychological hedonism, which states that all motives of action are\ngrounded in the apprehension of pain or the desire for pleasure; and\n(2) ethical hedonism, which holds that pleasure is the only good and\nactions are right in so far as they tend to produce pleasure or avoid\npain. As Bentham went on to explain, allowing for “immunity from\npain”, pleasure is “the only good”, and pain\n“without exception, the only evil” (1970, 100). As such,\npain and pleasure are the final cause of individual action\nand the efficient cause and means to individual\nhappiness.\n\nNor were these observations restricted to humankind in Bentham’s\nview—the proposed penal code was to include a section on cruelty\nto animals. As he explained, “the question is not, Can they\nreason? Nor, can they talk? But, can they\nsuffer?” (1970, 283n)—a proposition that lies at the\nbeginnings of utilitarian arguments for the ethical treatment of\nanimals (see Singer 1975).\n\nSince each person’s happiness is constituted of the aggregate\nbalance of pleasures over pains, this is “the sole end which the\nlegislator ought to have in view: the sole standard in conformity to\nwhich each individual ought, as far as depends upon the legislator, to\nbe made to fashion his behaviour” (1970, 34). But how is the\nlegislator to influence individual actions and gain conformity to his\ndecisions? Bentham delineated four “sanctions” or sources\nof pain and pleasure, which he may have learnt from Gay’s essay\nConcerning the Fundamental Principle of Virtue or Morality\n(1731): physical, political, moral, and religious. These sanctions (he\nlater added sympathy to the list) are available to the moralist and to\nthe legislator in guiding and determining an individual’s moral\nconduct, and they explain how an essentially self-interested\nindividual may be encouraged and, where necessary, directed to perform\nactions that promote the greatest happiness of both himself and\nothers. It is incumbent on the utilitarian legislator, therefore, to\nunderstand the “value” of the pains and pleasures he must\nemploy to achieve this objective.\n\nWhile the consequences of an act often depend on the motives which\ngive rise to the act (and partly on the agent’s intentions and\nthe circumstances in which the act is performed), in Bentham’s\ntheory the utility of an act is independent of its originating\nmotive(s). In effect, there is no such thing as a good or bad motive.\nThe utility of an act—its goodness or badness—is\ndetermined solely by its consequences: the benefits and/or costs that\nresult. When deciding whether to act or which act to undertake, a\nperson must calculate as best as he can the pains and pleasures that\nmay reasonably be expected to accrue to the persons (including\nhimself) affected by the acts under consideration. A similar\ncalculation should guide the legislator in formulating laws. However,\nBentham recognised that it was not normally feasible for an individual\nto engage in such a calculation as a preliminary to undertaking every\nact. For this reason he spoke of the general tendencies of actions to\nenhance happiness (suggested by past experience) as a sufficient guide\nin most situations. On the other hand, the implicit consequentialism\nof utilitarian theory is central to Bentham’s theory of\npunishment, in which the objective was to ensure that a punishment is\nin proportion to the mischief produced by a crime and sufficient to\ndeter others from committing the same offence. To this end he\ndeveloped rules to guide the lawmaker in the construction of a penal\ncode, including the elements involved in the calculation of the\nmischief caused by offences and the appropriate punishments.\n3.1 Interests\n\nIn Helvétius’ account “interest” lies at the\nepicentre of moral science, but Bentham recognised that the concept\nonly had meaning, like other fictitious entities in ethics such as\n“desire” and “motive”, when redefined in terms\nof the avoidance of pains and acquisition of pleasures (1970, 12;\n1838–43, VIII, 290). In general he followed Adam Smith in\nbelieving the individual to be the best judge of his or her own\ninterests, but the simplicity of this proposition is deceptive (see\nEngelmann 2001).\n\nFirst, a person’s consideration of her interest involves\nexpectations or mental projections of the future, not\nactually existing material interests. This involves the individual in\nimagining what will occur if she were to act in a certain\nmanner. The specific expectations that attend the consideration of an\naction may be shaped by a myriad of external considerations, as well\nas the agent’s own predilections and preferences. For Bentham,\nthe most important elements of the external environment in which a\nperson imagines outcomes are the penalties and rewards laid down by\nlaw and those deriving from other educative and moral institutional\narrangements and practices, including the sanction exercised by public\nopinion. In this sense, law and other agencies may be used to\nconstruct interests by providing individuals with the motives to\npursue courses of action beneficial to the community. It is the\nindividual who then must correctly perceive where her interests lie;\nshe must imagine the expected outcomes the legislator has determined.\nThe result is that Bentham’s material view of pains and\npleasures as the factors which define “interest” tends to\nevaporate in favour of interests composed of imagined (though not\nimaginary) apprehensions and expectations about the future.\n\nSecond, Bentham recognised that explaining action in terms of interest\nis potentially circular. If we mean by acting according to interest,\nacting selfishly, then the statement “Agents act in accordance\nwith their self-interest”, is false. If we mean, acting to\npursue our interest in the widest sense, then the statement is\ntautological (2010b, 93n). In this respect, the validity of the\n“self-preference principle”—the assumption that\nself-interest is the motivation of all human action—is\nquestionable. Bentham recognised the possibility of altruistic\nactions, and frequently alluded to his own philanthropy when\nrecommending schemes to further the public good. Moreover, in\nIPML he held that sympathy was a “primeval and constant\nsource” of pleasure and action (1970, 61), and later, in\nDeontology, elevated it to his list of sanctions as a source\nof pain and pleasure (1983a, 84, 183, 201, 203–4). However, if\nnot all action is motivated by self-interest in the narrow or strict\nmeaning of the term, then how far can the self-preference principle be\nconsidered a reliable guide for the legislator in constructing\nmotives? Bentham’s answer, probably influenced by Hume’s\nview of the matter, is that the self-preference principle is a sound\ngeneralisation. While it is not true that everyone always acts in his\nor her self-interest, it is best that the legislator design\ninstitutions and law as if this were in fact true. Self-interested\nacts are the norm; altruism is the exception. As he explained it in\nthe Constitutional Code (1830), even if the self-preference\nprinciple “held good in no more than a bare majority, of the\nwhole number of instances, it would suffice for every practical\npurpose, in the character of a ground for all political\narrangements” (1838–43, IX, 6).\n\nThird, although individuals may in general be the best judges of their\nown interests, they may not always judge wisely. This creates a\ndisjunction between the perception of their interest and their\n“real” interest. Since the “public interest”\nis a fictitious entity which represents nothing more than the\naggregate of individual interests (1970, 12), an effective legislator\nmust have a fairly accurate understanding of the interests of those\nindividuals that constitute the community, of what will motivate them\nto act in the desired ways (especially in criminal law). But if people\nincorrectly perceive their interests, then the legislator may be\nmisled in constructing the appropriate motivation. Clearly, the\nknowledge needed by the legislator (in order to be effective in\nconstructing adequate motives to direct individual actions) is of\npeople’s apparent interests, while the legislator’s\nobjective is to further their “real” interests, that is,\nwhat they would choose if they were fully rational and informed. This\nmeans that assessing the value of the constituent elements of interest\n(pains and pleasures) is a tricky business for the legislator; he must\naccurately observe the ways people behave, deduce the motives behind\ntheir actions, and encompass this knowledge in the sanctions of law.\nYet these same observations of human behaviour may not also be\nreliable guides to the “real” interests of individuals,\nwhich must be determined on other grounds. This is why some modern day\nutilitarians focus on “preferences”, that is on the\nsubjectively expressed opinion of the individual as to what she\nthinks will be pleasurable or painful (see Bykvist 2013).\n\nBentham addressed the potential disjunction between an agent’s\nperception of her interest and her real interest in his writings on\nindirect law, which he described as “a secret plan of connected\nand long-concerted operations to be executed in the way of a stratagem\nor petite guerre” (2010b, 233). The aim is to tell\nindividuals what they should not do, but also to provide them with\nmotives (pains and pleasures in prospect) sufficient to divert their\ndesires into channels best designed to serve the public interest.\nCodes of behaviour and other “implements of moral\ninstruction”, such as texts of “history, biography, novels\nand dramatic compositions” (UC lxxxvii, 18–19), could be\nutilised to divert people from inclinations damaging to themselves and\nothers and to teach them to derive pleasure from benevolence. In this\nway government could educate its citizens to make more effective\nchoices, or at least guide them into more appropriate paths to achieve\ntheir real interests (1838–43, I, 161).\n3.2 Felicific Calculus\n\nThough Bentham did not use this terminology, the calculus he\ndevised—commonly known as the “felicific\ncalculus”—describes the elements or dimensions of the\nvalue of a pain or pleasure. To an individual the value of a pain or\npleasure will be more or less according to its\n“intensity”, “duration”, “certainty or\nuncertainty”, and its “propinquity or remoteness”.\nWhere the object is to measure the value of a pleasure or pain in\nterms of the tendency of an act, there are two additional\ncircumstances to be taken into account: “fecundity” or\n“the chance it has of being followed by sensations of the\nsame kind”, and “purity” or “the\nchance it has of not being followed by sensations of the\nopposite kind”. Where there are a number of persons,\nwith reference to whom the value of a pleasure or a pain is\nconsidered, a further circumstance must be factored into the calculus,\nthat is the “extent” or the number of persons who are\naffected by the pleasure or pain (1970, 38–39). Although Bentham\nbelieved there was nothing in what he had proposed “but what the\npractice of mankind, wheresoever they have a clear view of their own\ninterest, is perfectly conformable to”, it has often been said\nthat applying the felicific calculus is impractical. Bentham\nrecognised that neither the individual nor the legislator could\nstrictly follow the process he described. Rather, he presented it as a\nmodel of the ideal calculation, and “as near as the process\nactually pursued on these occasions approaches to it, so near will\nsuch process approach to the character of an exact one” (1970,\n40).\n\nAs is well known, while adhering to the basic Benthamic analysis of\nmotives, in Utilitarianism (1861) J. S. Mill introduced the\nconcept of“higher pleasures”, by which he meant aesthetic\nand spiritual gratification and the pleasures of the intellect, and\nclaimed these were intrinsically more desirable than other pleasures.\nThis tended to undermine the aggregative dimension of the theory laid\ndown by Bentham, since the depth of feeling associated with such\npleasures resist quantification. Recent commentators, however, have\nquestioned whether the distance between Bentham and Mill is as large\nas commonly supposed, arguing for example that “intensity”\nand “purity” are qualities of pains and pleasures that, in\nprinciple, are still subject to measurement, at least when comparing\nalternative actions on the same index (Warke 2000; Rosen 2003, Ch.\n10).\n3.3 Diminishing Marginal Utility\n\nBentham occasionally suggested that pains and pleasures might be\nevaluated in relation to income or wealth, but he was aware of the\nlimitations of this approach. While we might plausibly assume that, of\ntwo individuals with unequal fortunes, the richer of the two would be\nthe happier, it does not follow that adding increments to that\nperson’s wealth will continue to make him happier in the same\nproportion. It is in the nature of the case that the amount of\nincrease in happiness will not be as great as the increase in wealth;\nthe addition of equal increments of money will eventually bring\nsuccessively less of an increase in happiness. Modern economists know\nthis analysis as the law of “diminishing marginal\nutility”. One of its practical consequences for a utilitarian\nsuch as Bentham is that, where choices present themselves between\ngiving an additional increment to a rich man or to a poor man, more\nhappiness will result from giving it to the poorer of the two. Also,\nthe analysis underscores why money cannot be a direct measure of\nutility, since the utility represented by a particular sum of money\nwill vary depending on the relative wealth of the person who receives\nit. Moreover, it is evident that diminishing marginal utility is also\na feature of the additional increments of pleasure a person may\nexperience beyond a certain point; equal increments of pleasure will\nnot necessarily add to the stockpile of happiness if a person has\nreached a saturation point.\n4. Later Improvements\n\nIn the 1829 “Article on Utilitarianism” Bentham pointed to\ntwo later “improvements” to his understanding of the\nutility principle—the “disappointment-prevention\nprinciple” and the “greatest happiness principle” (a\nsubstitute for the “greatest happiness of the greatest\nnumber” formula).\n4.1 Disappointment-prevention Principle\n\nFor Bentham, the unhappiness created by the loss of something will\nusually have a greater impact on a person than the happiness brought\nabout by its gain to someone else (1838–43, I, 304–7). All\nother things being equal, the reduction of utility to one person\ncaused by theft will have a greater bearing on that person’s\nhappiness than the gain in utility to another person from a lottery\nwin of the same monetary value. Of course, if the loser is a wealthy\nperson and the gainer a poor man, this will not hold. But in the\nnormal run of things, this is why Bentham gave a higher priority to\nthe protection of property by law and why he held that the alleviation\nof suffering demands more immediate attention than plans to produce\nwealth (1952–54, III, 324, 342). It is also the rationale for\nwhat Bentham later called the “disappointment-prevention\nprinciple” (1838–43, V, 416), which requires that the\nsecurity of legitimate expectations take precedence over other ends,\nsave where the public interest manifestly justifies government\nintervention, such as raising funds through taxation for vital\nservices and the emergency expropriation of property in times of war\nor famine, usually with compensation paid to the property owner.\n\nFor Bentham, the significance of this principle as a practical guide\ncould hardly be overstated. It is, he says, the “one\nall-comprehensive rule” upon which all property arrangements\nought to be based (1983a, 308), and by this, “the first\napplication, or say emanation, of the greatest happiness\nprinciple”, all the arrangements of the law of property\n“in its most extensive sense”, meaning “all objects\nof general desire”, ought to be ordered (295–96; see also\n1838–43, III, 312).\n4.2 Greatest Happiness Principle\n\nBentham detected a serious and potentially debilitating defect in\nrendering the utility principle as the “greatest happiness of\nthe greatest number”. He came to see that such a principle could\njustify inordinate sacrifices by a minority, however that minority\nmight be composed, in the interest of enhancing the happiness of a\nmajority. He considered this a false conclusion, but one that needed\nto be addressed. “Be the community in question what it\nmay”, he writes, “divide it into two unequal parts, call\none of them the majority, the other the minority, lay out of the\naccount the feelings of the minority, include in the account no\nfeelings but those of the majority, the result you will find is that\nto the aggregate stock of the happiness of the community, loss, not\nprofit, is the result of the operation”. The less the numerical\ndifference between the minority and majority, the more obvious the\ndeficiency in aggregate happiness will be (1983a, 309). Logically,\nthen, the closer we approximate the happiness of all the\nmembers of the community, the greater the aggregate of happiness.\n4.3 Universal Interest\n\nAs an additional improvement in the manner in which Bentham conceived\nthe utility principle, he might have included the “universal\ninterest”, an idea initially stated in Plan of Parliamentary\nReform where it appears as a more particular conception of the\ngreatest happiness principle aimed at the “maximum\n… of comfort and security” for all (1838–43, III,\n452). The universal interest relates to interests that are shared by\neveryone, and only when it is impossible for government to contrive\npolicies to achieve this end is a distribution of happiness less than\nuniversal or less than equal justified (1983b, 136). However, the\nnumber of decisions made by governments that are genuinely of\nuniversal reach are relatively few and may be limited to national\ndefence and the framework of individual rights (securities). Beyond\nthat, redistributive policies invariably involve unequal sacrifices\nand benefits. This means that the legislator must employ a utilitarian\ncalculation in which the pain experienced by the few is reduced to the\nminimum necessary to produce benefits for the many; only on this basis\nmay pleasures be summed and pains subtracted in order to produce the\nrationale to justify the best policy.\n\nRelated to this conception of the universal interest is the\negalitarian commitment that in arriving at the appropriate law or\npolicy the interests of each and all must count, and count equally\n(1840 [1864], I, 144). This does not mean that optimal utility is not\nthe goal, but simply stresses that optimal utility is more likely\nachieved where there is an approximate equality in the distribution of\nthe basic requirements of happiness (Postema 1998). \n\nThis aspect of Bentham’s theory has often been ignored or\ndismissed as irrelevant by critics who, from T. H. Green forward,\nargue that calculations of total utility fail to respect the\ndistinctiveness of persons and thereby place their interests at\nperpetual risk (Rawls 1971, 22–27; Nozick 1974, 28–35; see\nthe discussions in Ten 1987, 13–37; Rosen 2003, Chs.\n12–13; and Bykvist 2010, Ch. 5). If deterrence can be achieved\nby punishing an innocent bystander when the real culprit cannot be\ncaught or brought to justice, then why should the bystander not be\npunished? Because public utility would be maximised by making an\nexample of an innocent bystander just as much as by punishing the\nperson who was actually guilty of the offence but who has not been\napprehended, it seems the utilitarian ought to support the punishment.\nBut this is not only intuitively wrong, it is also wrong because there\nis a real danger that violations of security would lead to other such\nviolations, with no principled basis to cease inflicting them. Bentham\nwas emphatic on this score: “If it is a good thing to sacrifice\nthe fortune of one individual to augment that of others, it will be\nyet better to sacrifice a second, a third, a hundred, a thousand,\n…; for whatever may be the number of those you have sacrificed,\nyou will always have the same reason to add one more. In one word, the\ninterest of everybody is sacred, or the interest of nobody”\n(1840 [1864], I, 144). Basic securities must be afforded to each and\nevery member of the community, and violations of these vital interests\nare not justified, whether they be perpetrated by other individuals or\ngovernment, since they contravene the distributive elements of\nutilitarian theory. To this extent, at the very least, each\nperson’s happiness must count.\n5. Subordinate Ends, Principles and Maxims\n\nFrom early on in his utilitarian theorizing, Bentham understood that\nthe achievement of utilitarian objectives in practice required the\ntranslation of the utility principle into elements amenable to\nimplementation in ways that the philosophically abstract principle\nitself could not be. Concrete manifestations of happiness, for\nexample, could be found in personal security and reduced crime rates,\nenhanced health and declining death rates, broader opportunities for\neducation, the reduction of diseases caused by sewage pollution, and\nso on. The statistical measurement of these and other issues would\nprovide a solid basis for the dissection of existing law and the\ndevelopment of new law, but Bentham’s thirst for such\ninformation was always well in advance of the available data. This\ndeficiency did not, however, prevent him from developing the\ntheoretical apparatus to direct the formulation of such laws.\n\nIn founding a system of law upon the principle of utility, Bentham\nannounced near the beginning of his career, “I do no more than\nfound it upon a set of rules” (UC lxix, 38). This was more than\nthe Humean observation that utility is embedded in customary rules\nthat have evolved over time. The maximization of utility required that\nthe jurist cast a “censorial” eye on existing practices to\ntest their capacity to enhance the greatest happiness. Where the\njurist detects deficiencies, new rules and precepts must be developed\nthat demonstrably accord with the utility principle. In\nBentham’s hands this took the form of a multitude of subordinate\nor secondary ends, principles and maxims designed to give practical\ndirection to the utility principle in each and every aspect of the\nlaw. The greatest happiness principle sets the over-arching objective\nand is the critical standard against which existing practices are to\nbe judged. As such, it stands ever ready to be summoned forth whenever\nnew guidelines are needed, subordinate ends conflict, or existing laws\nrequire amendment, refinement, or further elaboration. However, in\npractice it is the secondary elements of the theory that do the work\nof producing beneficial outcomes. In this way, they give practical\nconcreteness to the philosophically abstract end of the greatest\nhappiness.\n6. Civil Law and Political Economy\n\nThe subordinate ends of civil law are security, subsistence,\nabundance, and equality, in this order of priority. “The more\nperfect enjoyment is in all these respects”, Bentham wrote,\n“the greater is the sum of social happiness: and especially of\nthat happiness which depends upon the laws” (1840 [1864], I,\n96). As we have seen, security is maintained by laws that protect\nproperty and the expectations derived from ownership, and uphold the\ncontracts that facilitate the trade in goods and services. Subsistence\nand abundance are also derived from this source. When an overall\nabundance exists but not all enjoy the necessary means of subsistence,\nthen legislative intervention may be conducted in accordance with the\n“disappointment-prevention principle”, such as when the\nstate takes ownership of an estate for which there is no legitimate\nheir (122–23), or when a tax on income or property can be\nintroduced without materially detracting from a person’s\nexpectations, and the funds accrued used to provide food and basic\nservices to those in need. Based on this redistribution of wealth, a\ndegree of equalization is also achieved (Kelly 1990, 191–97), an\nobjective entirely consistent with the view that, properly understood,\nthe utility principle entails a presumption in favour of an equal\ndistribution, unless there is compelling empirical evidence that\nutility would not be served by such a policy. As Bentham put it in\nLeading Principles of a Constitutional Code,\n“the more remote from equality are the shares … the less\nis the sum of felicity produced by the sum of those shares”\n(1838–43, II, 276).\n\nThe theory of “diminishing marginal utility” also lends\nsupport to equalization policies, dictating that decreases to the\nwealth of a rich man cause less pain than similar decreases to a poor\nman, while additions to the wealth of the poor man bring happiness in\na greater amount than they would to a rich man (1840 [1864], I,\n103–9). In First Principles Preparatory to Constitutional\nCode, written 1822 but not then published, Bentham went further,\nto postulate that the greatest happiness of the people “requires\nthat the external instruments of felicity, whatsoever they may be, be\nshared by the whole number in a proportion so near to equality as is\nconsistent with universal security” (1989, 16; see also 1840\n[1864], I, 104). However, he refused to countenance the idea that\npolicies to redistribute wealth at the cost of security would\nbe beneficial either to social prosperity or individual wellbeing.\nProposals to alter the distribution of wealth in line with diminishing\nmarginal utility must, therefore, be conducted in accordance with the\n“disappointment-prevention principle”.\n\nOn the other hand, Bentham believed that a system of laws based on the\nutility principle would gradually and “indirectly” evolve\ntowards greater equality in the distribution of goods, and pointed to\nthe historical evidence of post-feudal Europe in support of his\nposition. In the long run the key to achieving a more equal\ndistribution of property lay in abundance: “in a nation\nprosperous in its agriculture, its manufactures and its commerce,\nthere is a continual progress towards equality” (1840 [1864], I,\n123). The important caveat Bentham introduced to justify this optimism\nis the proviso that government must not impede this tendency by\nallowing monopolies, putting “shackles” on trade and\nindustry, or placing obstacles in the path of the division of property\non inheritance.\n\nBentham believed that facilitating individuals in the pursuit of their\ninterests in a free market is what government should do, because this\nis the proven best way to maximise the public good. Where\nlaissez-faire does not produce the best result, however, the\nlegislator must act in other direct and indirect ways to produce the\noptimal outcome. The question, as Bentham explained in Manual of\nPolitical Economy, “is to know what ought and what ought\nnot to be done by government. It is in this view, and in this view\nonly that the knowledge of what is done and takes place without the\ninterference of government can be of any practical use”\n(1952–54, I, 224). In the Institute of Political\nEconomy, he argued that past experience provided sufficient\nevidence to convince us that governments should not act in the\neconomic realm as much as they often do, hence the motto “Be\nquiet” and the lists of “Non-agenda” items. Where\ndepartures from this general rule are required—such as when\nvital subsistence goods would be priced beyond the reach of\nmany—they become “Agenda” items for government\n(1952–54, III, 333; see also 247–302). But radical schemes\nfor property re-distribution are ruled out; the axiomatic requirement\nthat each be treated equally, that the happiness of each be counted,\njustified policies to equalize the distribution of goods only where\nthis could be achieved without disappointing legitimate\nexpectations.\n7. Penal Law and Punishment\n\nCivil and penal law are inextricably connected in Bentham’s\nlegal theory. Just as the primary purpose of civil law is economic\nsecurity and national prosperity, so it draws powerful support from\nthe protection afforded persons, property and expectations by the\nthreat of punishment (1838–43, III, 203). To this end,\nutilitarian penal law is framed in terms of the principal objective of\ndeterrence, but it also embraces the secondary ends of disablement,\nmoral reformation, and compensation (see Crimmins 2011). The\neffectiveness of the theory in practice depends on two additional\nfeatures: offences must be classified solely on the basis of the harm\nperpetrated, and there must be an appropriate proportion between\ncrimes and punishments. It is because of its failure to satisfy the\nfirst feature that Bentham (2014) rejected the prevailing\ncriminalization of consensual sexual acts, and developed the first\nsystematic defence of sexual liberty in the English language.\n\nIn settling the required proportions of punishment, Bentham recognised\nhe had burdened the legislator with a vastly complex task—the\ncalculation of the correct quantity and type of pain needed to achieve\nthe desired ends, in particular the objective of deterrence. To guide\nthe legislator in proportioning punishments to offences he stipulated\nthirteen rules or “canons”, such as that the punishment\nmust outweigh the profit of the offence, venture more against a great\noffence than a small one, punish for each particle of the mischief,\nand the like (1970, 167–71; see also Bedau, 2004; Draper, 2009).\nThe delineation of such guidelines to protect against\n“unfrugal” or excessive punishments is indicative of his\nattempt to be as comprehensive and as exact as possible while\nattending to practicalities. This is nowhere more apparent than in\nBentham’s critical analysis of the death penalty.\n\nBentham first examined the utility of the death penalty in the 1770s\nwhen he delineated the principles of penal law (1838–43, I,\n441–50; see also 1970, Ch. XV), and followed this with an\nunpublished essay in 1809 in which he presented a critique of William\nPaley’s defence of the death penalty in his Principles of\nMoral and Political Philosophy (1785), and in particular the use\nof discretionary pardons (UC cvii, 193–277; Crimmins 1987). A\nfurther short essay “On Death-Punishment”, published in\n1830, repeats many of the arguments from the first essay\n(1838–43, I, 525–32). Arguably, Bentham’s\nutilitarian analysis of the issues raised by the death penalty in the\nfirst of these essays stands as the most thoroughgoing examination of\nthe question up to this time (Bedau 1983). In sum, it is a special\napplication of his utilitarian theory of punishment. The framework of\nanalysis is presented as an objective, neutral exercise, by which the\nbenefits and costs of the death penalty in cases of murder are\nassessed in comparison with life imprisonment with hard labour. All\nthings considered, Bentham believed the weight of the calculation\nworked against the death penalty on the grounds of deterrence, the\nfact that it is inequable in its application, falling mainly on the\nshoulders of the poor, and because it is a form of punishment that is\nirremissible in the face of judicial error. Nevertheless, at that time\nhe thought the death penalty might reasonably be maintained for murder\nwith aggravating circumstances and for cases of treason “in\nwhich the name of the offender, so long as he lives, may be sufficient\nto keep a whole nation in a flame” (1970 183). By 1809, however,\nhe abandoned the exceptions and argued that no offence warranted\ncapital punishment (UC cvii. 201).\n8. Panopticon\n\nSubordinate ends are also evident in the design and management of the\npanopticon prison: security and economy are foremost, but tempered by\nhumanity and accountability. Impressed by the dynamic of its circular\narchitecture which allowed the warden, obscured from view in the\nshuttered watchtower, to observe the activities of prisoners day and\nnight, Michel Foucault took the perspective that\n“panopticism” defined a “new physics of\npower”, an experimental “laboratory of power” in\nwhich behaviour could be modified, and he viewed the\npanopticon—that “cruel, ingenious cage”—as a\nsymbol of the repressive, disciplinary society, the modern\n“society of surveillance” (Foucault 208). This view of the\npanopticon has opened up some interesting lines of discourse on the\nencroaching methods of control and surveillance in contemporary\nliberal societies (Brunon-Ernst 2012). However, as a critique of\nBentham’s proposals it hardly does justice to the intricacies of\nthe project, as Semple (1993) has shown.\n\nThe end of economy determined that the panopticon prison should be a\nprivate self-sustaining operation not requiring financial assistance\nfrom the public purse. Security determined that the community be\nprotected from convicted criminals, and severity in punishment was to\nserve the ends of deterrence and reformation. But security also\nrequired that the inmate be protected from cruel treatment, and\nhumanity determined that prisoners should be deprived only of liberty\nnot health or life. Prisoners were to be kept clean and their labour\nmade productive and profitable, including the development of skills\nthat might be useful to them when released. In support of these\nobjectives, Bentham invoked several devices to effect transparency and\naccountability in prison government. The chief mechanism intended to\nbring the interest of the prison owner/administrator in line with his\nduty to be humane is publicity, described as “the most effectual\nmeans of applying the force of moral motives, in a direction tending\nto strengthen the union between his interest and the humane\nbranch of his duty; by bringing to light, and thus exposing to the\ncensure of the law and of public opinion … every instance of\ncontravention” (1838–43, VIII, 380). To the seemingly\n“constant” but unseen surveillance of the inmates by the\nwarden, Bentham added the observation of the warden and his\nsubordinates by the public. Interested members of the public and\nmembers of parliament were to be guaranteed free access to the prison,\nmaking the panopticon subject to “the great open\ncommittee of the tribunal of the world” (1838–43, IV,\n46). This was the prototype for Bentham’s later ruminations on\nthe benefits of the Public Opinion Tribunal in a system of\nrepresentative democracy.\n9. Administration, Government, Constitutional Law\n\nAs with the panopticon, economy, transparency and accountability were\nequally important in Bentham’s innovative account of\nadministration, as were devices to ensure the maximization of\n“intellectual”, “moral”, and\n“active” aptitude in public officials. In government\nutilitarian outcomes required various democratic procedures that\nfunction as “securities against misrule”. These procedures\ninclude: “virtual” universal suffrage, annual parliaments,\nthe secret ballot, and provisions for transparency, publicity and\nunconstrained public debate.\n\nMuch of what Bentham recommended in relation to administrative and\npolitical institutions is governed by “the\ninterest-junction-prescribing principle”, designed to\nensure that the interests of those with power would be reconciled with\nthe public interest, the interests of the governed. This idea was\nprominent in A Fragment on Government, where he argued that\neffective government was not to be had on the foundation of abstract\nformulas such as “mixed and balanced” institutions, but\nrequired “the frequent and easy changes of condition\nbetween governors and governed; whereby the\ninterests of one class are more or less indistinguishably blended with\nthose of the other” (1977, 485). In the later constitutional\nwritings Bentham added many more administrative devices to ensure\naptitude, transparency and accountability, none more important than\nthe “Public Opinion Tribunal”, or the open court of public\nopinion founded on the freedom of the press, by which government\nactions could be held up to public scrutiny (1983b, 36). And, just as\nthe panopticon was to be monitored by the publication of regular\nreports, so reports of government activity were required to keep the\ndemocratic polity informed and facilitate the accountability of public\nofficials.\n\nWhen Bentham turned his thoughts to constitutional law in earnest in\nthe 1820s, partly inspired by constitution-making in parts of southern\nEurope, it was with the conviction that all states in which the\ninstitutions of representative democracy already existed or in which\nthey could be introduced were fertile soil for the utilitarian\npannomion. “Of this constitution”, he announced\nnear the beginning of the Constitutional Code, “the\nall-comprehensive object, or end in view, is, from first to last, the\ngreatest happiness of the greatest number; namely, of the individuals,\nof whom, the political community, or state, of which it is the\nconstitution, is composed” (1983b, 18). The administrative,\nelectoral and legislative details of this project occupied much of the\nlast decade of his life, with its core ideas discussed in the pages of\na variety of works in addition to the Code, such as\nSecurities Against Misrule, First Principles Preparatory\nto Constitutional Code, and Official Aptitude Maximized;\nExpense Minimized. The subsidiary principles of accountability,\nefficiency, and economy underpinned the institutional design and\nprocedural operations elaborated in these writings. In essence, these\nprinciples provided the grounding for the “securities against\nmisrule” that Bentham thought essential to ensure that the\ngreatest happiness would be the sole objective of government in a\nrepublican representative democracy.\n9.1 Securities Against Misrule\n\nBentham held that those who hold the “operative power” in\ngovernment, administration, and judiciary are, like everyone else,\nmotivated by personal interest. It is imperative, therefore, to devise\nmechanisms that will ensure that only by acting in the public interest\ncould they promote their own interests. So, for example, under\nrepresentative democracy the members of the legislature, as the\nrepresentatives of the “constitutive power” of the people,\ncould be counted on to promote the greatest happiness and hold other\nfunctionaries to account, since elected legislators only serve at the\nwill of their constituents and risk not being re-elected if they fail\nto do their duty (Schofield 1996, 226–28; see also Lieberman\n2008). Given the extensive powers Bentham envisaged the thirteen\nministries of the reformed government would possess—far more\npower in the areas of public health, education, and relief of the poor\nand indigent than existed at the time—further safeguards would\nbe required. Refining and expanding the suggestions contained in his\nPlan of Parliamentary Reform, he stipulated that public\nofficials must possess the required “moral aptitude” (the\ndisposition to promote the greatest happiness), “intellectual\naptitude” (divided into scientific aptitude or knowledge, and\njudicial aptitude or judgement), and “active aptitude”\n(the conscientious performance of assigned responsibilities) (1990,\n272). Intellectual and active aptitude were to be tested through an\nexamination process, though this would come to naught if the appointed\nofficial did not possess the appropriate moral aptitude\n(1838–43, IX, 128). Other devices designed to ensure, encourage,\nand test the required aptitude of public officials include: (1) the\nprecise definition of responsibilities attached to each office,\nagainst which the actions of officials could be judged by either a\nsuperordinate official or the public; (2) the principle of\nsubordination, according to which every official was subordinate to\nanother who could punish him for inefficiency in the performance of\nhis tasks; (3) complete exposure to legal prosecution of all officials\nfor wrong-doing; (4) the elimination of the practice of handing out\nunwarranted titles of honour to party supporters and other favourites;\n(5) complete publicity of government business and the elimination of\nsecrecy; and (6) freedom of the press, speech and association (see\nRosen 1983, Ch. 8).\n9.2 Sovereignty\n\nThe popular dimensions of the constitutional code appear to run\ncontrary to the legal positivism commonly associated with\nBentham’s utilitarianism, which implies a theory of sovereignty\nthat requires that power be located in the hands of the legislator,\nhowever constituted, and stipulates that all laws are imperative and\ndepend for their enforcement on coercive sanctions. Rosen has argued\nthat as early as A Fragment on Government, Bentham rejected\nthe Hobbesian idea of sovereignty based on simple command and\nobedience, in which the sovereign is necessarily a single, unified\nsupreme power, in favour of “the notions of the legal limitation\nand division of sovereign power” (Rosen 1983, 41, 44).\n\nGenerally, by the term “sovereignty” Bentham meant the\npower to legislate (legal sovereignty), but he also employed it in\nrelation to the power of the people to limit or control government and\npublic officials (political or popular sovereignty). In the first\nsense of the term it is seemingly impossible for there to be a law\nthat deliberately functions contrary to the will of the legislature.\nAll law emanates from the will of the sovereign and the will of the\nsovereign “cannot be illegal” (2010b, 38). However,\nBentham also held that all political authority, no matter what form it\ntakes, is necessarily limited by its capacity to compel obedience from\nthe people. As he put it in A Fragment on Government,\n“By a sovereign I mean any person or assemblage of persons to\nwhose will a whole political community are (no matter on what account)\nsupposed to be in a disposition to pay obedience” (1977, 18).\nAnd in Of the Limits of the Penal Branch of Jurisprudence he\nexplained that this implies two volitions, both of which are necessary\ncomponents of a complete theory of sovereignty: on the one hand, the\nenactments of a legislature and, on the other, the will of the people\nto obey those enactments. In effect, the will of the people to disobey\namounts to a permanent constitutional check on the authority of the\nsovereign, and in this sense “the submission and obedience of\nthe people” acts as the “constituent cause” of\nsovereignty (2010b 150n). The legislature may be “supreme”\nbut it “can never of itself be absolute and unlimited” or\n“amount to the entire power of imperation” (113). The\nresult is a “split concept” of sovereignty defined by a\ndynamic interaction between the legislature and the people, subject to\nchanging times and the reflection of this in the public’s\nattitude to law, to what is admissible and inadmissible (see Ben-Dor\n2000, Ch. 2). The process of public deliberation and accountability\nthis requires is greatly facilitated by the communicative freedoms of\nthe “liberty of the press” and the “liberty of\npublic association” (1977, 485)—crystalized in\nBentham’s conception of the “Public Opinion\nTribunal” (POT).\n9.3 Public Opinion Tribunal\n\nBased on his earlier enunciation of “the motto of the good\ncitizen”in A Fragment on\nGovernment—“To obey punctually, to\ncensure freely” (1776 [1977, 399])—in the\nConstitutional Code Bentham conceived the POT as a\n“fictitious tribunal” or public court of opinion,\nargument, and debate. “Able rulers lead it”, he advised,\n“prudent rulers use or follow it; foolish rulers disregard\nit”. The POT would scrutinize the actions of elected\nrepresentatives, public and judicial officials, prosecuting charges\nwhere they are found remiss in their responsibilities, censoring\nmisrule and imposing penalties when applicable. Penalties would\ngenerally take the form of the “moral sanction”—the\nbroadcasting of the shame and disgrace of bad conduct and the\nimputation of the reputation of the person responsible (1830 [1983b,\n35–39]; 1989, 283). In these terms, the POT would be the leading\nsecurity against the misuse and abuse of power (1989, 125). Operating\non a continuing basis, and therefore not constrained as a check in the\nsame limited way as periodic elections, it would act as “the\nonly force … [by] which … government when operating in a\nsinister direction can experience any the least impediment to its\ncourse” (1990, 121).\n\nVital to the functioning of the POT is the dissemination of\ninformation. In the first instance this would require the\nestablishment of a public archive of government actions and activities\ncontaining records of law, policy, legislative debate, and statistics,\nwhich the government would be constitutionally required to make\navailable to the public by a freedom of information provision in the\nconstitutional code to ensure transparency. Secondly, it would require\nan unshackled press to ensure widespread publicity and the freedom to\ncriticize unimpeded by censorship or gagging orders. Here Bentham drew\nupon his essay On the Liberty of the Press, and Public\nDiscussion (1821) to point out the dangers of laws designed to\nlimit these liberties. The liberty of the press is an indispensable\ncheck on arbitrary government, and therefore “necessary to the\nmaintenance of good government” (1838–43, II, 277, 279).\nPublicity is vital in this process, since “the greater the\nnumber of the members of the whole community to whom the existence of\nan act of oppression has been made known, the greater is the number of\nthose by whom … not only may obedience be withholden, but\nresistance opposed” (1990, 30).\n\nBentham did not consider that the effectiveness of the POT as a check\non misrule could be undermined by secret government methods to limit\nthe flow of information, nor did it occur to him that a press\ndominated by the views of one class or by special interests could\nsubvert the veracity of the information it disseminated. He pinned his\nfaith on transparency and publicity (Postema 2014, 49). Ideally, the\npublic would be adequately informed, and the POT would be constituted\nby those among the public who were both knowledgeable and concerned\nabout the issues before it. Its judgements could change as new\nevidence came to light or as new arguments were enunciated, and it\ncould be fragmented or unified in its view in proportion to the\nvariety of individual opinions expressed.\n10. Influence\n\nBefore the publication of Dumont’s edition of the\nTraités de législation in 1802, Bentham’s\nwritings had a very limited distribution. During the revolutionary\nyears in France, Dumont fed his ideas into the debates over judicial,\nlegal, penal and legislative reform, and if his proposals had little\nimpact on the social and political improvements undertaken they yet\ncontributed to the direction of French liberalism (Champs 2015). With\nthe publication of the Traités de législation\nBentham’s stock as a legal philosopher increased dramatically.\n3000 copies of the Traités were sold almost\nimmediately (1838–43, I, 388), the Emperor Alexander ordered a\nRussian translation, and this was followed by translations (or partial\ntranslations) into Spanish, German, Polish, Portuguese and Hungarian,\nwith particularly impressive sales in Spain, Portugal, and Latin\nAmerica (1838–43, XI, 33, 88; see Avila-Martel 1981; McKennon\n1981; Luño 1981). The 1820 edition of the\nTraités lists nineteen booksellers in eleven European\ncountries from whom the book could be purchased. It was from this\nplatform that Bentham was able to promote himself as a potential\ncodifier of the laws in countries near and far. Despite the herculean\nefforts of Dumont, however, his ideas received a mixed reception in\nFrance (see Champs 2015, Ch.15). The aging André Morellet was\nkeen to see the principles of utilitarian legal philosophy implemented\nin French law and administration, and Marc-Antoine Jullien and\nJean-Baptiste Say among others appealed to Bentham in their attempt to\nground political economy on scientific principles. On the other hand,\nself-interest and the utility principle was rejected by Germaine de\nStael as an impoverished grounding for moral duty, and rejected by\nother reformers such as Benjamin Constant who grounded their\nliberalism on natural rights.\n\nBentham’s ideas began circulating in Spain in 1810 through the\nLondon-based El Español (Dinwiddy 1984, 20), but\ninterest increased during the liberal triennium of 1820–23. In\n1820, Toribio Núñez published a two-volume account of\nutilitarian legal philosophy based on the\nTraités—titled Espiritu de Bentham\nó sistéma de la ciencia social, ideado por\nJeremías Bentham—and his own writings on moral and\npolitical philosophy were greatly influenced by Bentham’s ideas.\nIn 1821–22, Ramón de Salas produced the first Spanish\ntranslation of the Traités in five volumes, which\nreceived a scathing critique by José Vidal, a Dominican\ntheologian at the University of Valencia, who condemned the work as an\nencouragement to revolution (Orígen de los errores\nrevolucionarios de Europe, y su remedio 1827). Earlier, in 1793,\nBentham had counselled the French National Convention to divest itself\nof its colonies on the grounds of their disutility (though the text\nEmancipate Your Colonies! was only published in 1830; Bentham\n2002, 289–315). In the 1820s he directed his arguments towards\nSpain in “Rid Yourselves of Ultramaria” and\n“Emancipation Spanish” (1995, 3–276), and was\ngratified to see his ideas gaining traction in its former colonies in\nLatin America.\n\nAndrés Bello used Salas’ translation as the basic text\nfor his law lectures at the Colegio de Santiago in Chile, as did Pedro\nAlcántra de Somellera, Professor of Civil Law at the University\nof Buenos Aires. In 1825 Francisco de Paula Santander, the\nVice-President of Gran Colombia, decreed that the work be required\nreading for all law students in the vast territories of the new\nrepublic, but in 1828 its President Simón Bolívar, the\nlegendary “Liberator”, after previously embracing the\nprinciples and purpose of Bentham’s legal philosophy, bowed to\nclerical pressure and banned its teaching as detrimental to religion,\nmorality, and social order (1838–43, X, 552–54).\nSantander, who was more inclined to resist the influence of the\nCatholic Church, restored it to the curriculum of the universities\nwhen he became President of the newly constituted state of Colombia in\n1832.\n\nFollowing the Greek revolution against Ottoman rule, the historian and\nlegal scholar Anastasios Polyzoides, who had a hand in drafting its\nnew constitution in 1822, translated an extract on\n“publicity” from Dumont’s Tactiques des\nassemblée legislatives for a Missolonghi newspaper in\n1824, promoting transparency in legislative proceedings and in\ngovernment more broadly. A year later he published in Greek A\nGeneral Theory of Administrative Systems and especially of the\nParliamentary One, Accompanied by a Short Treatise on Justices of the\nPeace and Juries in England (1825), containing a defense of\nrepresentative government and advocating a judicial system based on\nutilitarian principles, replete with references to Bentham (Peonidis\n2009).\n\nIn the United States, the dissemination of utilitarianism was\ninitially hampered by the absence of an English translation of the\nTraités, but there too Bentham’s influence was\nnot long in being felt. David Hoffman first introduced utilitarian\nideas into legal education in America at the University of Maryland in\nthe early 1820s. John Neal, who studied law under Hoffman’s\nguidance, described Hoffman as one of Bentham’s “most\nenthusiastic admirers” (Neal 1830, 300). In his bibliographic\nA Course of Legal Study (1817), Hoffman recommended students\nread parts of Dumont’s redaction of Bentham, Théorie\ndes peines et des récompenses (2 vols., 1811), and it was\nHoffman who encouraged Neal to translate the Traités\ninto English, a task he began during the eighteen months he stayed\nwith Bentham in London in 1825–26. In the event, only the\nintroductory sections of the Traités appeared in\nNeal’s Principles of Legislation (1830), parts of which\nhad first appeared in a series of articles in The Yankee, a\njournal he edited under the banner heading “the greatest\nhappiness of the greatest number”.\n\nIt was Richard Smith, a government tax officer and one of\nBentham’s young London disciples, who eventually translated the\ncivil and penal law parts of the Traités into English\nfor the The Works of Jeremy Bentham in 1838 (1838–43,\nI, 297–580). While Smith was at work in England, the historian\nand anti-slave propagandist Richard Hildreth, Bentham’s foremost\nAmerican disciple, was busy translating the same material on the other\nside of the Atlantic, convinced that the widespread interest in legal\nreform in the United States would benefit greatly from utilitarian\nideas. The reviews of Hildreth’s translation praised\nBentham’s legal philosophy while objecting to its underlying\nmoral assumptions and disdain for religion, a position frequently\nadopted by early critics—even Hildreth took this less than\nconsistent view (1840 [1864], I, iii). The reviews paid particular\nattention to the systematic presentation of the theory of civil law,\nwhich also impressed itself on the teaching of law in the newly\nindependent states of South America, where property rights were a\nmatter of considerable importance in the aftermath of the collapse of\nthe Spanish and Portuguese empires.\n\nHildreth, whose own Theory of Morals (1844) drew\nsubstantially on the Traités, was correct in thinking\nthat law reformers in the United States would find sustenance in\nBentham’s critical jurisprudence. Thomas Cooper, who left\nEngland for the United States in 1794 with Joseph Priestley, from whom\nhe initially derived his utilitarianism, was a confirmed Benthamite by\nthe 1820s and the intended recipient of writings Bentham entrusted to\nJohn Quincy Adams. Thereafter Cooper employed utilitarian principles\nin his writings on law and political economy, most notably in the\nLectures on the Elements of Political Economy (1826), based\non the lectures he gave at South Carolina College in Columbia, the\nfirst course of lectures on the subject in America. Edward Livingston,\nthe famous author of codes of law for Louisiana, corresponded with\nBentham, who sent him books for his research. Livingston acknowledged\nit was his reading of the Traités which\n“fortified me in a design to prosecute the subject” of a\ncode of penal law (1838–43, XI, 51). In its final comprehensive\nand systematic version, Livingston’s System of Penal\nLaw (1833) was celebrated by many continental jurists and became\nthe centrepiece of the codification campaign in the United\nStates—a campaign Bentham had attempted to launch himself some\nyears earlier by directing copies of his Papers Relative to\nCodification and Public Instruction (1817) to a number of\nwell-placed American politicians. The freethinker Gilbert Vale used\nhis position as editor of the radical periodical The Diamond\n(1840–42)—like The Yankee, published with the\nbanner heading “the greatest happiness of the greatest\nnumber”—to disseminate Bentham’s criticisms of the\nvagaries, chicanery, and technicalities of the law. Inspired by\nBentham, Vale was in favour of humane penal laws that proportioned\npenalties to the objective of deterrence and an advocate of state\nintervention to alter the social circumstances that fostered crime.\nJohn O’Sullivan, the quixotic editor of the United States\nMagazine and Democratic Review, wrote sympathetic reviews of\nBentham, Livingston, and Hildreth, and followed them in advocating\nutilitarian law reform, particularly the abolition of the death\npenalty. Bentham’s influence on these figures is discussed in\ndetail in Crimmins (2022).\n\nBentham’s influence continued throughout the century in America,\nwhere the Traités paved the way for the reception of\nother editions and versions of his writings, which in turn led to\nsympathetic responses to the more amenable forms of utilitarian moral\nand legal theory offered by John Austin, J. S. Mill, and Henry\nSidgwick. On the other hand, Bentham’s\npolitical prescriptions made little impact in the United\nStates, which was, by comparison to aristocratic England, already an\nadvanced democracy. If the utilitarian Constitutional Code\nwas directed “for the use of all nations and all governments\nprofessing liberal opinions”, as its title page declared, the\npolitical positions it embraced were recommended, in the first\ninstance, for adoption at home.\n\nFor all Bentham’s success abroad, in the early years of the\nnineteenth century he was little known in his own country. The April\n1804 issue of the Edinburgh Review announced his arrival on\nthe British stage in a substantial critical review of Dumont’s\nTraités, though his main appeal was initially confined\nto a small band of law reformers determined to tackle the antiquated\nand notoriously harsh punishments meted out by English penal law. In\nthe years following the defeat of Napoleon in 1815, however, when\ncalls for legal, social, and political reform were becoming\ncommonplace, Bentham’s reputation in Britain was transformed\nfrom that of an eccentric and often misunderstood oracle on the\nperiphery of the intellectual and political world to that of a\nvenerable sage situated at the center of a broad reform movement.\nThroughout the following century his influence continued to be felt,\nparticularly in discussions of moral and legal philosophy and economic\ntheory and practice.\n\nJohn Austin became acquainted with Bentham’s utilitarian legal\nphilosophy during his undergraduate years at Cambridge. In 1821 he was\nhired to tutor J.S. Mill in Roman law, began attending meetings of the\nUtilitarian Society established by the younger Mill in 1823, and in\n1826 was appointed to the Chair of Jurisprudence at the newly founded\nUniversity of London, where he was the first in England to introduce\nutilitarian ideas into legal education. Building on Bentham’s\nscience of legislation, Austin imported its leading ideas into his own\njurisprudence, none more so than Bentham’s distinction between\nthe law as it is and the law as it ought to be, an\nidea that stands at the foundation of the doctrine of legal positivism\n(1977, 397). With the posthumous publication of Lectures on\nJurisprudence or The Philosophy of Positive Law (1863),\nAustin’s legal philosophy was to have a major impact on English\nand American jurisprudence—in the latter context his\nconceptualization of the nature of sovereignty proved especially\ninfluential.\n\nBentham’s most important influence was on John Stuart Mill. In\nhis Autobiography (1873) Mill relates that when he first\nencountered Bentham’s ideas in the Traités\n“I now had opinions, a creed, a doctrine, a philosophy; in one\namong the best senses of the word, a religion; the inculcation and\ndiffusion of which could be made the principal outward purpose of a\nlife” (1963–91, I, 67–68). It was in the flush of\nhis early commitment to utilitarianism that Mill edited the five\nvolumes of Bentham’s writings on evidence, Rationale of\nJudicial Evidence (1838–43, VI, 189–585, VII\n1–644). Around this time, however, partly in response to the\nchallenge of T. B. Macaulay’s criticism of his father’s\n“On Government” and partly the result of his own\nreflections on his intellectual inheritance, Mill developed a revised\nversion of utilitarian theory. This revisionism was first announced to\nthe world in the essay “Bentham” (1838) and received\ndefinitive expression in Utilitarianism (1861), in which he\nintroduced the notion of higher pleasures. Though, like Bentham, an\nadvocate of representative democracy based on universal suffrage, Mill\nalso made several proposals to temper the potential excesses of\nunconstrained majoritarian institutions. In other respects, including\nhis defence of individual freedom and individuality in On\nLiberty (1859), Mill’s utilitarianism remained within the\nBenthamic framework.\n\nBentham’s influence has been felt to a considerable extent in\nthe field of economics, in which the felicific calculus provided the\ngroundwork for the development of policy based on cost-benefit\nanalysis. As we have seen, he shared Adam Smith’s view that the\nroute to a nation’s prosperity is by individuals pursuing their\ninterests in ways of their own choosing, with government intervention\nlimited accordingly. However, he also developed the theory of\ndiminishing marginal utility, furnishing the legislator with a\nconceptual tool by which to address the uneven distribution of social\nhappiness. The collectivist conclusions Bentham drew from this\nprinciple were modest in scope, but later reformist economists like W.\nS. Jevons (1871), impressed by the idea that social utility could be\ncalculated based on the aggregate of individual interests, developed\nthe theory in the direction of modern welfare economics. F. Y.\nEdgeworth (1881) thought Bentham’s formula of the\n“greatest happiness of the greatest number” a mathematical\nabsurdity, and reformulated the goal in terms of the greatest total\nhappiness (or greatest average happiness for a fixed number of\npeople). The Fabian socialist Sidney Webb also applied utilitarian\nideas to maximize and better distribute “total\nutility”—Webb’s wife Beatrice once described Bentham\nas her husband’s “intellectual godfather” (Mack\n1955). Graham Wallas, another of the Fabians, was deeply impressed by\nBentham’s legal, political and administrative innovations and\nhailed him as “Britain’s greatest political\ninventor” (Wallas 1926).\n\nOn the other side of the ledger we find the libertarian Herbert\nSpencer who deployed the utility principle in Man versus the\nState (1884) and other writings to underwrite the liberty of the\nindividual, defend the existing social order, and attack the drift\ntowards socialism and “slavery”. James Fitzjames Stephen,\nHenry Sidgwick, and A.V. Dicey all advocated versions of utilitarian\nindividualism, although Sidgwick occasionally gave voice to\n“socialist” sentiments in developing his\nintuitional utilitarian theory in The Methods of\nEthics (1874). Reform-minded liberals such as J.A. Hobson and\nL.T. Hobhouse viewed themselves as “new” utilitarians,\nfinding in the protean nature of utilitarianism a justification for\ndistinctly non-individualist policies. Thus Hobhouse in\nLiberalism (1911) incorporated utilitarianism into a new\nliberal discourse that, in addition to laissez-faire\neconomics (and notwithstanding Herbert Samuel’s quasi-Benthamic\nmotto “the greatest liberty of the greatest number”) also\nincluded elements of socialism, social Darwinianism, and the reformist\nidealism of T. H. Green.\n11. Critics and Commentators\n\nOnce Bentham’s ideas began to take hold in the early nineteenth\ncentury, critics were not hard to find. In his Principles of\nPolitics Applicable to All Governments (1810), Benjamin Constant,\nwho admired Bentham’s originality and praised his contributions\nto political economy and penal law, questioned the vagueness of the\nconcept of utility, which he thought susceptible to many different\ndefinitions and pregnant with danger as a principle of policy.\nConstant preferred the prescriptions of natural law as the\nphilosophical basis for government. William Hazlitt, who was for a\ntime Bentham’s tenant, satirised him as a venerable anchorite in\nthe quiet of his cell reducing law to a system and the mind of man to\na machine, divorced from the life of spirit, imagination, passion and\nsentiments of love, a philosophy “fit neither for man nor\nbeast” (1826, 184). Thomas Carlyle summed up the general\nperception of the crassness of “Benthamee utility” as the\n“pig-philosophy”, nothing more than “virtue by\nProfit and Loss” (1840, 65). Other critics, like the Whig\nreformers James Mackintosh and T.B. Macaulay, ready to follow\nBentham’s lead in law reform, were also dismayed by the\ndiminished view of human nature that underpinned his philosophy and\nattacked the radical proposals for political reform that emanated from\nthe utilitarian camp (Lively and Rees 1978). The Anglican divine John\nColls, for a time Bentham’s secretary before he took holy\norders, published an intemperate exposé of his former employer\nas a selfish and bigoted subversive in Utilitarianism\nUnmasked (1844), a work which proved popular among his fellow\nclergymen.\n\nAs the nineteenth century wore on assailants came forth from all\npoints across the philosophical spectrum. Marx considered Bentham an\n“arch-philistine” and utilitarianism a superficial and\nephemeral bourgeois ideology (Capital I, Ch. XXIV, sect. 5).\nSundry religionists, including those of a philosophical bent like the\nclassicist J.B. Mayor, intuitionists like William Whewell, and\nidealists like Green, F.H. Bradley, Bernard Bosanquet and D.G. Ritchie\ncombined to attack its atomism, crude materialism, narrowly construed\ntheory of motivation, and lack of appreciation of the spiritual\ndimension of the human condition. The legal scholar Henry Maine could\nadmire the bravado and ambition of Bentham’s science of\njurisprudence, but also deplored his failure to appreciate the\nhistorical and evolutionary nature of law; he further objected to\nBentham’s faith that the ignorant masses could truly know what\nis in their best interest. As we have seen, on the other side of the\nAtlantic, Bentham’s legal philosophy made some headway but the\nunderlying moral ideas met stiff resistance, and his supposed atheism\nadded fuel to the fire of outrage bellowing from evangelical critics.\nIn a different vein, the Pragmatists, notably William James and John\nDewey, may have shared Bentham’s ontological misgivings about\nthe meaning and misrepresentation of fictions and fictitious entities\n(Quinn 2012) and recognised the critical value of the utility\nprinciple to the development of Liberalism as a philosophy of action\n(Dewey 1935, 13–17), but they rejected the claim that all\nmotivation may be reduced to a drive to seek pleasure and avoid pain,\nwhich they viewed as a self-defeating commitment to materialist\nindividualism (Dewey and Tufts 1908, 271–74; see also Crimmins\n2022, Epilogue). Like J. S. Mill, the Pragmatists also dismissed the\nidea that any single form of the summum bonum could account\nfor the many goods that people seek (James 1891, 186–200). There\nhave been many critics of Bentham since.\n\nNumerous commentaries on Bentham’s philosophy have also\nappeared, from the early general accounts of Leslie Stephen (1900) and\nElie Halévy (1901–4), to more recent introductions to his\nideas (Harrison 1983; Dinwiddy 1989b; Crimmins 2004, 2013; Schofield\n2009; Quinn 2022) and a wide range of revisionist disquisitions on\ndiscrete aspects of his thought. In addition to the themes and issues\nalready addressed in this article, Hart (1982) and Postema (1989) have\npenned important studies of Bentham’s jurisprudence, while\ntopics that have engaged contemporary commentators include his\ncritical views on race and slavery (Jones 2005; Rosen 2005),\ncolonialism and empire (Pitts 2005; Cain 2011; Causer, Finn and\nSchofield 2022), marriage, divorce, adultery, desertion and\nwife-beating (Sokol 2011), and sexual liberty (Dabhoiwala 2010,\n168–74; Schofield 2014). Schofield (2013) provides an overview\nof some new directions in Bentham studies, to which may be added\nessays on the global Bentham (Armitage 2011; Zhai and Palmer 2021),\nBentham and the arts (Julius, Quinn and Schofield 2020), and policing\n(Jacques and Schofield 2021). Many of these commentaries have been\ninspired by the publication of the authoritative volumes in The\nCollected Works of Jeremy Bentham that began appearing in 1968 to\nreplace the poorly edited and incomplete Bowring edition\n(1838–43). The Collected Works continues to bring to\nlight new and more complete versions of Bentham’s writings and\npreviously unpublished material. At the time of writing, 35 of the\nprojected 80 volumes have been published. As new volumes appear the\ntopics of discussion and debate will continue to increase, burnishing\nthe reputation of a philosopher whose ideas remain relevant in a great\nnumber of areas of interest to moralists, psychologists, economists,\nhistorians, legal and political philosophers.\n",
    "bibliography": {
        "categories": [
            "<a id=\"PriSou\">Primary sources</a>",
            "<a id=\"SecSou\">Secondary Sources</a>"
        ],
        "cat_ref_text": {
            "<a id=\"PriSou\">Primary sources</a>": [
                "</h3>\n<h4>Manuscripts</h4>\n<ul class=\"hanging\">",
                "Bentham Manuscripts at University College London (UC followed by\nbox and page/folio no.).\n</ul>\n<h4>Collected Editions of Bentham’s Works</h4>\n<ul class=\"hanging\">",
                "1829–30, <em>Œuvres de</em>\n<em>Jérémie</em> <em>Bentham</em>, 3 volumes, E. Dumont\n(ed.), Bruxelles: Hauman.",
                "1838–43, <em>The Works of Jeremy Bentham, Published under\nthe Superintendence of his Executor, John Bowring</em>, 11 vols.,\nEdinburgh: William Tait.",
                "1952–54, <em>Jeremy Bentham’s Economic Writings</em>,\n3 volumes, W. Stark (ed.), London: George Allen &amp; Unwin.",
                "1968–, <em>The Collected Works of Jeremy Bentham</em>,\nGeneral Editors: J. H. Burns, J. R. Dinwiddy, F. Rosen, T. P.\nSchofield, London: Athlone Press; Oxford: Clarendon Press; and London:\nUCL Press, in progress:\n\n<ul class=\"subhang\">",
                "1970, <em>An Introduction to the Principles of Morals and\nLegislation</em>, J. H. Burns and H. L. A. Hart (eds.).",
                "1977, <em>A Comment on the Commentaries and A Fragment on\nGovernment</em>, J. H. Burns and H. L. A. Hart (eds.).",
                "1983, <em>Chrestomathia</em>, M. J. Smith and W. H. Burston\n(eds.).",
                "1983a, <em>Deontology together with A Table of the Springs of\nAction and the Article on Utilitarianism</em>, A. Goldworth\n(ed.).",
                "1983b, <em>Constitutional Code</em>, volume 1, F. Rosen and J. H.\nBurns (eds.).",
                "1989, <em>First Principles Preparatory to Constitutional\nCode</em>, T. P. Schofield (ed.).",
                "1990, <em>Securities Against Misrule and other Constitutional\nWritings for Tripoli and Greece</em>, T. P. Schofield (ed.).",
                "1993, <em>Official Aptitude Maximized; Expense Minimized</em>, P.\nSchofield (ed.).",
                "1995, <em>Colonies, Commerce, and Constitutional Law: Rid\nYourselves of Ultramaria and other writings on Spain and Spanish\nAmerica</em>, P. Schofield (ed.)",
                "1998,<em>“Legislator of the World”: Writings on\nCodification, Law, and Education</em>, P. Schofield and J. Harris\n(ed.).",
                "1999, <em>Political Tactics</em>, M. James, C. Blamires and C.\nPease-Watkin (eds.).",
                "2001, 2010a, <em>Writings on the Poor Laws</em>, 2 volumes, M.\nQuinn (ed.).",
                "2002, <em>Rights, Representation, and Reform: Nonsense upon Stilts\nand other Writings on the French Revolution</em>, P. Schofield, C.\nPease-Watkin and C. Blamires (eds.).",
                "2010b, <em>Of the Limits of the Penal Branch of\nJurisprudence</em>, ed. P. Schofield.",
                "2011, <em>Church-of-Englandism and its Catechism Examined</em>, J.\nE. Crimmins and C. Fuller (eds.).",
                "2012, <em>On the Liberty of the Press, and Public Discussion, and\nother Legal and Political Writings for Spain and Portugal</em>, C.\nPease-Watkin and P. Schofield (eds.).",
                "2013,\n “<a href=\"http://discovery.ucl.ac.uk/1392179/3/npbj.pdf\" target=\"other\">Not Paul, But Jesus Part III. Doctrine</a>”,\n Bentham Project.",
                "2014, <em>Of Sexual Irregularities, and other writings on Sexual\nMorality</em>, P. Schofield, C. Pease-Watkin, and M. Quinn\n(eds.).",
                "2015, <em>The Book of Fallacies</em>, P. Schofield (ed.).",
                "2016a, 2019, <em>Writings on Political Economy</em>, Volume 1:\nincluding “Defence of Usury”; “Manual of Political\nEconomy”; and “Protest against Law Taxes”), and\nVolumes 2: including “Supply without Burthen” and\n“Proposals Relative to Divers Modes of Supply”, M. Quinn\n(ed.), Oxford: Oxford University Press.",
                "2016b, <em>Preparatory Principles</em>, D. G. Long and P.\nSchofield (eds.).",
                "2022, <em>Panopticon versus New South Wales and Other Writings on\nAustralia</em>, T. Causer and P. Schofield (eds.).\n</ul>\n</ul>\n<h4>Other Cited Works by Bentham</h4>\n<ul class=\"hanging\">",
                "1795, “Nonsense upon Stilts, Or Pandora’s Box Opened,\nOr The French Declaration of Rights prefixed to the Constitution of\n1791 laid open and exposed–with a Comparative Sketch of what has\nbeen done on the same subject in the Constitution of 1795”, in\n<em>Collected Works</em>, 2002, 317–401.",
                "1830–31, “History of the War between Jeremy Bentham\nand George the Third. By one of the Belligerents”, in <em>The\nWorks of Jeremy Bentham</em>, 1838–43, XI, 96–105.",
                "1831, “Colonization Company Proposal: Being a proposal for\nthe formation of a joint-stock company by the name of the Colonization\nCompany on the entirely new principle intituled the\nvicinity-maximizing or dispersion-preventing principle”, in\n<em>Collected Works</em>, 2022, forthcoming.",
                "1840 [2nd edn 1864], <em>Theory of Legislation; by Jeremy Bentham.\nTranslated from the French of Etienne Dumont, by Richard\nHildreth</em>, 2 vols., rept. with an introduction, appendix and index\nby James E. Crimmins, Bristol: Thoemmes Continuum, 2004.",
                "1842, <em>Auto-Icon; or Farther Uses of the Dead to the\nLiving</em>; in James E. Crimmins (ed.), <em>Jeremy Bentham’s\nAuto-Icon and Related Writings</em>, Bristol: Thoemmes, 2002.\n</ul>\n<h4>Other Primary Sources</h4>\n<ul class=\"hanging\">",
                "Carlyle, T., 1840, <em>On Heroes, Hero-Worship, and the Heroic in\nHistory</em>, M.K. Goldberg, J.J. Brattin, and M. Engel (eds.),\nBerkeley, CA: University of California Press, 1993.",
                "Edgeworth, F. Y., 1881, <em>Mathematical Psychics: An Essay on the\nApplication of Mathematics to the Moral Sciences</em>, London: C.\nKegan Paul &amp; Co.",
                "Hazlitt, W., 1826, “The New School of Reform: A Dialogue\nbetween a Rationalist and a Sentimentalist”, in <em>The Complete\nWorks of William Hazlitt</em>, 21 vols., P. P. Howe (ed.), London:\nJ.M. Dent and Sons, 1930–4, vol. 12, pp. 179–95.",
                "Jevons, W. S., 1871, <em>The Theory of Political Economy</em>,\nLondon: Macmillan and Co.",
                "Mill, J. S., 1963–91, <em>Collected Works of John Stuart\nMill</em>, J. M. Robson (general editor), Toronto: University of\nToronto Press.",
                "Neal, J., 1830, <em>Principles of Legislation: From the Ms. of\nJeremy Bentham</em>; … <em>By M. Dumont</em> …; <em>With\nNotes and a Biographical Notice of Jeremy Bentham and of M.\nDumont</em>, Boston, MA: Wells and Lilly.",
                "Smith, T. S., 1832, <em>Lecture Delivered over the Remains of\nJeremy Bentham, Esq., in the Webb-Street School of Anatomy &amp;\nMedicine, on the 9<sup>th</sup> June, 1832</em>, London: Effingham\nWilson.\n</ul>\n<h3>"
            ],
            "<a id=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Armitage, D., 2011, “Globalizing Jeremy Bentham”,\n<em>History of Political Thought</em>, 32 (1): 63–82.",
                "Avila-Martel, A. de, 1981, “The Influence of Bentham on the\nTeaching of Penal Law in Chile”, <em>The Bentham\nNewsletter</em>, 5: 22–8.",
                "Bahmueller, C. F., 1981, <em>The National Charity Company: Jeremy\nBentham’s Silent Revolution</em>, Berkeley, CA: University of\nCalifornia Press.",
                "Bedau, H. A., 1983, “Bentham’s Utilitarian Critique of\nthe Death Penalty”, <em>Journal of Criminal Law and\nCriminology</em>, 74 (3): 1033–65.",
                "–––, 2004, “Bentham’s Theory of\nPunishment: Origin and Content”, <em>Journal of Bentham\nStudies</em>, 7: n.p.\n [<a href=\"http://discovery.ucl.ac.uk/1323719/\" target=\"other\">Bedau 2004 available online</a>].",
                "Ben-Dor, O., 2000, <em>Constitutional Limits and the Public\nSphere</em>, Oxford &amp; Portland, OR: Hart Publishing.",
                "Blamires, C., 2008, <em>The French Revolution and the Creation of\nBenthamism</em>, London: Palgrave.",
                "Boralevi, L. C., 1984, <em>Bentham and the Oppressed</em>, Berlin:\nW. de Gruyter.",
                "Brunon-Ernst, A. (ed.), 2012, <em>Beyond Foucault: New\nPerspectives on Bentham’s Panopticon</em>, Farnham:\nAshgate.",
                "Bykvist, K., 2010, <em>Utilitarianism: A Guide for the\nPerplexed</em>, London: Continuum.",
                "–––, 2013, “Preferences\n(Preferentialism),” in J.E. Crimmins (ed.), <em>Bloomsbury\nEncyclopedia of Utilitarianism</em>, London &amp; New York:\nBloomsbury; reprinted 2017, pp. 440–45.",
                "Cain, P. J., 2011, “Bentham and the Development of the\nBritish Critique of Colonialism”, <em>Utilitas</em>, 23 (1):\n1–24.",
                "Causer, T., M. Finn and P. Schofield (eds.), 2022, <em>Bentham and\nAustralia: Convicts, Utility and Empire</em>, London: University\nCollege London Press.",
                "Champs, E. de., 2015, <em>Enlightenment and Utility: Bentham in\nFrench, Bentham in France</em>, Cambridge: Cambridge University\nPress.",
                "Crimmins, J. E., 1987, “‘Strictures on Paley’s\nNet’: Capital Punishment and the Power to Pardon”, <em>The\nBentham Newsletter</em>, 11: 23–34.",
                "–––, 1990, <em>Secular Utilitarianism: Social\nscience and the critique of religion in the thought of Jeremy\nBentham</em>, Oxford: Clarendon.",
                "–––, 1994, “Bentham’s Political\nRadicalism Reexamined”, <em>Journal of the History of\nIdeas</em>, 55 (2): 259–81.",
                "–––, 2004, <em>On Bentham</em>, Belmont, CA:\nWadsworth.",
                "–––, 2011, “Principles of Utilitarian\nPenal Law in Beccaria, Bentham and Mill”, in P. K. Koritansky\n(ed.), <em>The Philosophy of Punishment and the History of Political\nThought</em>, Columbia: The University of Missouri Press, pp.\n136–71.",
                "–––, 2013, <em>Utilitarian Philosophy and\nPolitics: Bentham’s Later Years</em>, London &amp; New York:\nBloomsbury.",
                "–––, 2022, <em>Utilitarianism in the Early\nAmerican Republic</em>, New York: Routledge.",
                "Dabhoiwala, F., 2010, “Lust and Liberty”, <em>Past\n&amp; Present</em>, 207 (1): 89–179.",
                "Dewey, J. and J. H. Tufts, 1908, <em>Ethics</em>, in <em>John\nDewey: The Middle Works, 1899–1924</em> (Volume 5), Jo Ann\nBoydson (ed.), Carbondale and Edwardsville, IL: Southern Illinois\nUniversity Press, 1978.",
                "Dewey, J., 1935, <em>Liberalism and Social Action</em>, in\n<em>John Dewey: The Later Works, 1925–1953</em> (Volume 11:\n1935–1937), Jo Ann Boydston (ed.), Carbondale and Edwardsville,\nIL: Southern Illinois University Press, 1991.",
                "Dinwiddy, J. R., 1975, “Bentham’s Transition to\nPolitical Radicalism, 1809–10”, <em>Journal of the History\nof Ideas</em>, 36 (4): 683–700.",
                "–––, 1984, “Bentham and the Early\nNineteenth Century”, <em>The Bentham Newsletter</em>, 8:\n15–33.",
                "–––, 1989a, “Adjudication under\nBentham’s Pannomion”, <em>Utilitas</em>, 1 (2):\n283–9.",
                "–––, 1989b, <em>Bentham</em>. Oxford: Oxford\nUniversity Press.",
                "Draper, T., 2002, “An Introduction to Jeremy Bentham’s\nTheory of Punishment”, <em>Journal of Bentham Studies</em>, 5:\nn.p.\n [<a href=\"http://discovery.ucl.ac.uk/1323717/\" target=\"other\">Draper 2002 available online</a>]",
                "Engelmann, S., 2001, “Imagining Interest,”\n<em>Utilitas</em>, 13 (3): 289–322",
                "Foucault, M., 1985, <em>Discipline and Punish: The Birth of the\nPrison</em>, A. Sheridan (trans.), Harmondsworth: Penguin.",
                "Halévy, E., 1901–4, <em>The Growth of Philosophic\nRadicalism</em> [<em>La Formation du radicalisme philosophique</em>,\nnew edition, M. Morris (trans.), 1928; Clifton, NJ: Augustus M. Kelley\n1972.",
                "Harrison, R., 1983, <em>Bentham</em>, London: Routledge and Kegan\nPaul.",
                "Hart, H. L. A., 1982, <em>Essays on Bentham: Studies on\nJurisprudence and Political Theory</em>, Oxford: Clarendon.",
                "Hume, L. J., 1981, <em>Bentham and Bureaucracy</em>, Cambridge:\nCambridge University Press.",
                "Itzkin, E. S., 1978, “Bentham’s\n<em>Chrestomathia</em>: Utilitarian Legacy to English\nEducation”, <em>Journal of the History of Ideas</em>, 39 (2):\n303–16.",
                "Jacques, S., and P. Schofield (eds.), 2021, <em>Jeremy Bentham on\nPolice: The Unknown Story and What it Means for Criminology</em>,\nLondon: University College London Press.",
                "James, W., 1891, “The Moral Philosopher and the Moral\nLife”, in <em>The Will to Believe and other Essays in Popular\nPhilosophy</em>, New York: Dover Publications, 1956.",
                "Jones, H. S., 2005, “The Early Utilitarians, Race, and\nEmpire: The State of the Argument”, in B. Schultz and G.\nVarouxakis, eds., <em>Utilitarianism and Empire</em>, Lanham, MD:\nLexington Books, pp. 179–88.",
                "Julius, A., Quinn, M., and P. Schofield (eds.), 2020, <em>Bentham\nand the Arts</em>, London: UCL Press.",
                "Kelly, P. J., 1989, “Utilitarianism and Distributive\nJustice: The Civil Law and the Foundations of Bentham’s Economic\nThought”, <em>Utilitas</em>, 1 (1): 62–81.",
                "–––, 1990, <em>Utilitarianism and Distributive\nJustice: Jeremy Bentham and the Civil Law</em>, Oxford:\nClarendon.",
                "Lieberman, D., 2008, “Bentham’s Democracy”,\n<em>Oxford Journal of Legal Studies</em>, 28 (3): 605–26.",
                "–––, 2011, “Bentham on\nCodification”, in S. G. Engelmann (ed.), <em>Selected Writings:\nJeremy Bentham</em>, New Haven, CT: Yale University Press, pp.\n460–77.",
                "Lively, J., and J. C. Rees, eds., 1978, <em>Utilitarian Logic and\nPolitics: James Mill’s “Essay on Government”,\nMacaulay’s critique and the ensuing debate</em>. Oxford:\nClarendon Press.",
                "Long, D. G., 1977, <em>Bentham on Liberty: Jeremy Bentham’s\nIdea of Liberty in Relation to his Utilitarianism</em>, Toronto:\nUniversity of Toronto Press.",
                "Luño, A-E P., 1981, “Jeremy Bentham and Legal\nEducation in the University of Salamanca during the Nineteenth\nCentury”, <em>The Bentham Newsletter</em>, 5: 44–54.",
                "Mack, M. P., 1955, “The Fabians and Utilitarianism”,\n<em>Journal of the History of Ideas</em>, 16 (1): 76–88.",
                "MacKennan, T. L., 1981, “Benthamism in Santander’s\nColombia”, <em>The Bentham Newsletter</em>, 5: 29–43.",
                "Nozick, R., 1974, <em>Anarchy, State, and Utopia</em>, New York:\nBasic Books.",
                "Peonidis, F., 2009, “Bentham and the Greek Revolution: New\nevidence”, <em>Journal of Bentham Studies</em>, 11: n.p.\n [<a href=\"https://uclpress.scienceopen.com/hosted-document?doi=10.14324/111.2045-757X.036\" target=\"other\">Peonidis 2009 available online</a>]",
                "Pitts, J., 2005, “Jeremy Bentham: Legislator to the\nWorld?” in B. Schultz and G. Varouxakis, eds., <em>\nUtilitarianism and Empire</em>, Lanham, MD: Lexington Books, pp.\n57–92.",
                "Postema, G. J., 1989, <em>Bentham and the Common Law\nTradition</em>, Oxford: Clarendon.",
                "–––, 1998, “Bentham’s\nEquality-Sensitive Utilitarianism”, <em>Utilitas</em>, 10 (2):\n144–58.",
                "–––, 2014, “The Soul of Justice: Bentham\non Publicity, Law, and the Rule of Law”, in Z. Xiabo and M.\nQuinn, eds., <em>Bentham’s Theory of Law and Public\nOpinion</em>, Cambridge: Cambridge University Press, pp.\n40–62.",
                "Quinn, M., 2008, “A Failure to Reconcile the Irreconcilable?\nSecurity, Subsistence and Equality in Bentham’s Writings on the\nCivil Code and on the Poor Laws”, <em>History of Political\nThought</em>, 29 (2): 320–43.",
                "–––, 2012, “Which comes first,\nBentham’s chicken of utility, or his egg of truth?”\n<em>Journal of Bentham Studies</em>, 14:\n <a href=\"http://discovery.ucl.ac.uk/1353163/\" target=\"other\">Quinn 2008 published online</a>.",
                "–––, 2022, <em>Bentham</em>, Cambridge: Polity\nPress.",
                "Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.",
                "Resnik, J., 2011, “Bring back Bentham: ‘open\ncourts,’ ‘terror trials,’ and public\nsphere(s)”, <em>Law, Ethics, Human Rights</em>, 5 (1):\n1–69.",
                "Richardson, R., 1986, “Bentham and Bodies for\nDissection”, <em>The Bentham Newsletter</em>, 10:\n22–33.",
                "Rosen, F., 1983, <em>Jeremy Bentham and Representative Democracy:\nA Study of “The Constitutional Code</em>”, Oxford:\nClarendon Press.",
                "–––, 2003, <em>Classical Utilitarianism from\nHume to Mill</em>, London &amp; New York: Routledge.",
                "–––, 2005, “Jeremy Bentham on Slavery and\nthe Slave Trade”, in B. Schultz and G. Varouxakis (eds.),\n<em>Utilitarianism and Empire</em>, Lanham, MD: Lexington Books, pp.\n31–56.",
                "Rosenblum, N., 1978, <em>Bentham’s Theory of the Modern\nState</em>, Cambridge, MA: Harvard University Press.",
                "Schofield, P., 1996, “Bentham on the Identification of\nInterests”, <em>Utilitas</em>, 8 (2): 223–34.",
                "–––, 2006, <em>Utility &amp; Democracy: The\nPolitical Thought of Jeremy Bentham</em>, Oxford: Oxford University\nPress.",
                "–––, 2009, <em>Bentham: A Guide for the\nPerplexed</em>, London: Continuum.",
                "–––, 2013, “The Legal and Political Legacy\nof Jeremy Bentham”, <em>Annual Review of Law and Social\nScience</em>, 9: 51–70.",
                "–––, 2014, “Jeremy Bentham on Taste, Sex\nand Religion”, in Z. Xiabo and M. Quinn, eds.,\n<em>Bentham’s Theory of Law and Public Opinion</em>, Cambridge:\nCambridge University Press, pp. 90–118.",
                "Semple, J., 1993, <em>Bentham’s Prison: A Study of the\nPanopticon Penitentiary</em>, Oxford: Clarendon Press.",
                "Sokol, M., 2011, <em>Bentham on Sex and Marriage: Law and Utility\nin Historical Context</em>, London: Continuum.",
                "Stephen, L., 1902, <em>The English Utilitarians</em>, 3 vols., New\nYork: G. P. Putnam’s Sons.",
                "Ten, C. L., 1987, <em>Crime, Guilt, and Punishment: A\nPhilosophical Introduction</em>, New York: Oxford University\nPress.",
                "Twining, W. L., 1985, <em>Theories of Evidence: Bentham and\nWigmore</em>, London: Weidenfeld and Nicolson.",
                "Thomas, W., 1979, <em>The Philosophic Radicals: Nine Studies in\nTheory and Practice, 1817–1841</em>, Oxford: Clarendon\nPress.",
                "Wallas, G., 1926, “Bentham as Political Inventor”,\n<em>Contemporary Review</em>, 129: 308–19.",
                "Warke, T., 2000, “Multi-Dimensional Utility and the Index\nNumber Problem: Jeremy Bentham, J. S. Mill, and Qualitative\nHedonism”, <em>Utilitas</em>, 12 (2): 176–203.",
                "Zhai, X., and S. Palmer (eds.), 2021, <em>Bentham Around the\nWorld</em>, Clark, NJ: Talbot Publishing.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"PriSou\">Primary sources</a></h3>\n<h4>Manuscripts</h4>\n<ul class=\"hanging\">\n<li>Bentham Manuscripts at University College London (UC followed by\nbox and page/folio no.).</li>\n</ul>\n<h4>Collected Editions of Bentham’s Works</h4>\n<ul class=\"hanging\">\n<li>1829–30, <em>Œuvres de</em>\n<em>Jérémie</em> <em>Bentham</em>, 3 volumes, E. Dumont\n(ed.), Bruxelles: Hauman.</li>\n<li>1838–43, <em>The Works of Jeremy Bentham, Published under\nthe Superintendence of his Executor, John Bowring</em>, 11 vols.,\nEdinburgh: William Tait.</li>\n<li>1952–54, <em>Jeremy Bentham’s Economic Writings</em>,\n3 volumes, W. Stark (ed.), London: George Allen &amp; Unwin.</li>\n<li>1968–, <em>The Collected Works of Jeremy Bentham</em>,\nGeneral Editors: J. H. Burns, J. R. Dinwiddy, F. Rosen, T. P.\nSchofield, London: Athlone Press; Oxford: Clarendon Press; and London:\nUCL Press, in progress:\n\n<ul class=\"subhang\">\n<li>1970, <em>An Introduction to the Principles of Morals and\nLegislation</em>, J. H. Burns and H. L. A. Hart (eds.).</li>\n<li>1977, <em>A Comment on the Commentaries and A Fragment on\nGovernment</em>, J. H. Burns and H. L. A. Hart (eds.).</li>\n<li>1983, <em>Chrestomathia</em>, M. J. Smith and W. H. Burston\n(eds.).</li>\n<li>1983a, <em>Deontology together with A Table of the Springs of\nAction and the Article on Utilitarianism</em>, A. Goldworth\n(ed.).</li>\n<li>1983b, <em>Constitutional Code</em>, volume 1, F. Rosen and J. H.\nBurns (eds.).</li>\n<li>1989, <em>First Principles Preparatory to Constitutional\nCode</em>, T. P. Schofield (ed.).</li>\n<li>1990, <em>Securities Against Misrule and other Constitutional\nWritings for Tripoli and Greece</em>, T. P. Schofield (ed.).</li>\n<li>1993, <em>Official Aptitude Maximized; Expense Minimized</em>, P.\nSchofield (ed.).</li>\n<li>1995, <em>Colonies, Commerce, and Constitutional Law: Rid\nYourselves of Ultramaria and other writings on Spain and Spanish\nAmerica</em>, P. Schofield (ed.)</li>\n<li>1998,<em>“Legislator of the World”: Writings on\nCodification, Law, and Education</em>, P. Schofield and J. Harris\n(ed.).</li>\n<li>1999, <em>Political Tactics</em>, M. James, C. Blamires and C.\nPease-Watkin (eds.).</li>\n<li>2001, 2010a, <em>Writings on the Poor Laws</em>, 2 volumes, M.\nQuinn (ed.).</li>\n<li>2002, <em>Rights, Representation, and Reform: Nonsense upon Stilts\nand other Writings on the French Revolution</em>, P. Schofield, C.\nPease-Watkin and C. Blamires (eds.).</li>\n<li>2010b, <em>Of the Limits of the Penal Branch of\nJurisprudence</em>, ed. P. Schofield.</li>\n<li>2011, <em>Church-of-Englandism and its Catechism Examined</em>, J.\nE. Crimmins and C. Fuller (eds.).</li>\n<li>2012, <em>On the Liberty of the Press, and Public Discussion, and\nother Legal and Political Writings for Spain and Portugal</em>, C.\nPease-Watkin and P. Schofield (eds.).</li>\n<li>2013,\n “<a href=\"http://discovery.ucl.ac.uk/1392179/3/npbj.pdf\" target=\"other\">Not Paul, But Jesus Part III. Doctrine</a>”,\n Bentham Project.</li>\n<li>2014, <em>Of Sexual Irregularities, and other writings on Sexual\nMorality</em>, P. Schofield, C. Pease-Watkin, and M. Quinn\n(eds.).</li>\n<li>2015, <em>The Book of Fallacies</em>, P. Schofield (ed.).</li>\n<li>2016a, 2019, <em>Writings on Political Economy</em>, Volume 1:\nincluding “Defence of Usury”; “Manual of Political\nEconomy”; and “Protest against Law Taxes”), and\nVolumes 2: including “Supply without Burthen” and\n“Proposals Relative to Divers Modes of Supply”, M. Quinn\n(ed.), Oxford: Oxford University Press.</li>\n<li>2016b, <em>Preparatory Principles</em>, D. G. Long and P.\nSchofield (eds.).</li>\n<li>2022, <em>Panopticon versus New South Wales and Other Writings on\nAustralia</em>, T. Causer and P. Schofield (eds.).</li>\n</ul></li>\n</ul>\n<h4>Other Cited Works by Bentham</h4>\n<ul class=\"hanging\">\n<li>1795, “Nonsense upon Stilts, Or Pandora’s Box Opened,\nOr The French Declaration of Rights prefixed to the Constitution of\n1791 laid open and exposed–with a Comparative Sketch of what has\nbeen done on the same subject in the Constitution of 1795”, in\n<em>Collected Works</em>, 2002, 317–401.</li>\n<li>1830–31, “History of the War between Jeremy Bentham\nand George the Third. By one of the Belligerents”, in <em>The\nWorks of Jeremy Bentham</em>, 1838–43, XI, 96–105.</li>\n<li>1831, “Colonization Company Proposal: Being a proposal for\nthe formation of a joint-stock company by the name of the Colonization\nCompany on the entirely new principle intituled the\nvicinity-maximizing or dispersion-preventing principle”, in\n<em>Collected Works</em>, 2022, forthcoming.</li>\n<li>1840 [2nd edn 1864], <em>Theory of Legislation; by Jeremy Bentham.\nTranslated from the French of Etienne Dumont, by Richard\nHildreth</em>, 2 vols., rept. with an introduction, appendix and index\nby James E. Crimmins, Bristol: Thoemmes Continuum, 2004.</li>\n<li>1842, <em>Auto-Icon; or Farther Uses of the Dead to the\nLiving</em>; in James E. Crimmins (ed.), <em>Jeremy Bentham’s\nAuto-Icon and Related Writings</em>, Bristol: Thoemmes, 2002.</li>\n</ul>\n<h4>Other Primary Sources</h4>\n<ul class=\"hanging\">\n<li>Carlyle, T., 1840, <em>On Heroes, Hero-Worship, and the Heroic in\nHistory</em>, M.K. Goldberg, J.J. Brattin, and M. Engel (eds.),\nBerkeley, CA: University of California Press, 1993.</li>\n<li>Edgeworth, F. Y., 1881, <em>Mathematical Psychics: An Essay on the\nApplication of Mathematics to the Moral Sciences</em>, London: C.\nKegan Paul &amp; Co.</li>\n<li>Hazlitt, W., 1826, “The New School of Reform: A Dialogue\nbetween a Rationalist and a Sentimentalist”, in <em>The Complete\nWorks of William Hazlitt</em>, 21 vols., P. P. Howe (ed.), London:\nJ.M. Dent and Sons, 1930–4, vol. 12, pp. 179–95.</li>\n<li>Jevons, W. S., 1871, <em>The Theory of Political Economy</em>,\nLondon: Macmillan and Co.</li>\n<li>Mill, J. S., 1963–91, <em>Collected Works of John Stuart\nMill</em>, J. M. Robson (general editor), Toronto: University of\nToronto Press.</li>\n<li>Neal, J., 1830, <em>Principles of Legislation: From the Ms. of\nJeremy Bentham</em>; … <em>By M. Dumont</em> …; <em>With\nNotes and a Biographical Notice of Jeremy Bentham and of M.\nDumont</em>, Boston, MA: Wells and Lilly.</li>\n<li>Smith, T. S., 1832, <em>Lecture Delivered over the Remains of\nJeremy Bentham, Esq., in the Webb-Street School of Anatomy &amp;\nMedicine, on the 9<sup>th</sup> June, 1832</em>, London: Effingham\nWilson.</li>\n</ul>\n<h3><a id=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Armitage, D., 2011, “Globalizing Jeremy Bentham”,\n<em>History of Political Thought</em>, 32 (1): 63–82.</li>\n<li>Avila-Martel, A. de, 1981, “The Influence of Bentham on the\nTeaching of Penal Law in Chile”, <em>The Bentham\nNewsletter</em>, 5: 22–8.</li>\n<li>Bahmueller, C. F., 1981, <em>The National Charity Company: Jeremy\nBentham’s Silent Revolution</em>, Berkeley, CA: University of\nCalifornia Press.</li>\n<li>Bedau, H. A., 1983, “Bentham’s Utilitarian Critique of\nthe Death Penalty”, <em>Journal of Criminal Law and\nCriminology</em>, 74 (3): 1033–65.</li>\n<li>–––, 2004, “Bentham’s Theory of\nPunishment: Origin and Content”, <em>Journal of Bentham\nStudies</em>, 7: n.p.\n [<a href=\"http://discovery.ucl.ac.uk/1323719/\" target=\"other\">Bedau 2004 available online</a>].</li>\n<li>Ben-Dor, O., 2000, <em>Constitutional Limits and the Public\nSphere</em>, Oxford &amp; Portland, OR: Hart Publishing.</li>\n<li>Blamires, C., 2008, <em>The French Revolution and the Creation of\nBenthamism</em>, London: Palgrave.</li>\n<li>Boralevi, L. C., 1984, <em>Bentham and the Oppressed</em>, Berlin:\nW. de Gruyter.</li>\n<li>Brunon-Ernst, A. (ed.), 2012, <em>Beyond Foucault: New\nPerspectives on Bentham’s Panopticon</em>, Farnham:\nAshgate.</li>\n<li>Bykvist, K., 2010, <em>Utilitarianism: A Guide for the\nPerplexed</em>, London: Continuum.</li>\n<li>–––, 2013, “Preferences\n(Preferentialism),” in J.E. Crimmins (ed.), <em>Bloomsbury\nEncyclopedia of Utilitarianism</em>, London &amp; New York:\nBloomsbury; reprinted 2017, pp. 440–45.</li>\n<li>Cain, P. J., 2011, “Bentham and the Development of the\nBritish Critique of Colonialism”, <em>Utilitas</em>, 23 (1):\n1–24.</li>\n<li>Causer, T., M. Finn and P. Schofield (eds.), 2022, <em>Bentham and\nAustralia: Convicts, Utility and Empire</em>, London: University\nCollege London Press.</li>\n<li>Champs, E. de., 2015, <em>Enlightenment and Utility: Bentham in\nFrench, Bentham in France</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Crimmins, J. E., 1987, “‘Strictures on Paley’s\nNet’: Capital Punishment and the Power to Pardon”, <em>The\nBentham Newsletter</em>, 11: 23–34.</li>\n<li>–––, 1990, <em>Secular Utilitarianism: Social\nscience and the critique of religion in the thought of Jeremy\nBentham</em>, Oxford: Clarendon.</li>\n<li>–––, 1994, “Bentham’s Political\nRadicalism Reexamined”, <em>Journal of the History of\nIdeas</em>, 55 (2): 259–81.</li>\n<li>–––, 2004, <em>On Bentham</em>, Belmont, CA:\nWadsworth.</li>\n<li>–––, 2011, “Principles of Utilitarian\nPenal Law in Beccaria, Bentham and Mill”, in P. K. Koritansky\n(ed.), <em>The Philosophy of Punishment and the History of Political\nThought</em>, Columbia: The University of Missouri Press, pp.\n136–71.</li>\n<li>–––, 2013, <em>Utilitarian Philosophy and\nPolitics: Bentham’s Later Years</em>, London &amp; New York:\nBloomsbury.</li>\n<li>–––, 2022, <em>Utilitarianism in the Early\nAmerican Republic</em>, New York: Routledge.</li>\n<li>Dabhoiwala, F., 2010, “Lust and Liberty”, <em>Past\n&amp; Present</em>, 207 (1): 89–179.</li>\n<li>Dewey, J. and J. H. Tufts, 1908, <em>Ethics</em>, in <em>John\nDewey: The Middle Works, 1899–1924</em> (Volume 5), Jo Ann\nBoydson (ed.), Carbondale and Edwardsville, IL: Southern Illinois\nUniversity Press, 1978.</li>\n<li>Dewey, J., 1935, <em>Liberalism and Social Action</em>, in\n<em>John Dewey: The Later Works, 1925–1953</em> (Volume 11:\n1935–1937), Jo Ann Boydston (ed.), Carbondale and Edwardsville,\nIL: Southern Illinois University Press, 1991.</li>\n<li>Dinwiddy, J. R., 1975, “Bentham’s Transition to\nPolitical Radicalism, 1809–10”, <em>Journal of the History\nof Ideas</em>, 36 (4): 683–700.</li>\n<li>–––, 1984, “Bentham and the Early\nNineteenth Century”, <em>The Bentham Newsletter</em>, 8:\n15–33.</li>\n<li>–––, 1989a, “Adjudication under\nBentham’s Pannomion”, <em>Utilitas</em>, 1 (2):\n283–9.</li>\n<li>–––, 1989b, <em>Bentham</em>. Oxford: Oxford\nUniversity Press.</li>\n<li>Draper, T., 2002, “An Introduction to Jeremy Bentham’s\nTheory of Punishment”, <em>Journal of Bentham Studies</em>, 5:\nn.p.\n [<a href=\"http://discovery.ucl.ac.uk/1323717/\" target=\"other\">Draper 2002 available online</a>]\n </li>\n<li>Engelmann, S., 2001, “Imagining Interest,”\n<em>Utilitas</em>, 13 (3): 289–322</li>\n<li>Foucault, M., 1985, <em>Discipline and Punish: The Birth of the\nPrison</em>, A. Sheridan (trans.), Harmondsworth: Penguin.</li>\n<li>Halévy, E., 1901–4, <em>The Growth of Philosophic\nRadicalism</em> [<em>La Formation du radicalisme philosophique</em>,\nnew edition, M. Morris (trans.), 1928; Clifton, NJ: Augustus M. Kelley\n1972.</li>\n<li>Harrison, R., 1983, <em>Bentham</em>, London: Routledge and Kegan\nPaul.</li>\n<li>Hart, H. L. A., 1982, <em>Essays on Bentham: Studies on\nJurisprudence and Political Theory</em>, Oxford: Clarendon.</li>\n<li>Hume, L. J., 1981, <em>Bentham and Bureaucracy</em>, Cambridge:\nCambridge University Press.</li>\n<li>Itzkin, E. S., 1978, “Bentham’s\n<em>Chrestomathia</em>: Utilitarian Legacy to English\nEducation”, <em>Journal of the History of Ideas</em>, 39 (2):\n303–16.</li>\n<li>Jacques, S., and P. Schofield (eds.), 2021, <em>Jeremy Bentham on\nPolice: The Unknown Story and What it Means for Criminology</em>,\nLondon: University College London Press.</li>\n<li>James, W., 1891, “The Moral Philosopher and the Moral\nLife”, in <em>The Will to Believe and other Essays in Popular\nPhilosophy</em>, New York: Dover Publications, 1956.</li>\n<li>Jones, H. S., 2005, “The Early Utilitarians, Race, and\nEmpire: The State of the Argument”, in B. Schultz and G.\nVarouxakis, eds., <em>Utilitarianism and Empire</em>, Lanham, MD:\nLexington Books, pp. 179–88.</li>\n<li>Julius, A., Quinn, M., and P. Schofield (eds.), 2020, <em>Bentham\nand the Arts</em>, London: UCL Press.</li>\n<li>Kelly, P. J., 1989, “Utilitarianism and Distributive\nJustice: The Civil Law and the Foundations of Bentham’s Economic\nThought”, <em>Utilitas</em>, 1 (1): 62–81.</li>\n<li>–––, 1990, <em>Utilitarianism and Distributive\nJustice: Jeremy Bentham and the Civil Law</em>, Oxford:\nClarendon.</li>\n<li>Lieberman, D., 2008, “Bentham’s Democracy”,\n<em>Oxford Journal of Legal Studies</em>, 28 (3): 605–26.</li>\n<li>–––, 2011, “Bentham on\nCodification”, in S. G. Engelmann (ed.), <em>Selected Writings:\nJeremy Bentham</em>, New Haven, CT: Yale University Press, pp.\n460–77.</li>\n<li>Lively, J., and J. C. Rees, eds., 1978, <em>Utilitarian Logic and\nPolitics: James Mill’s “Essay on Government”,\nMacaulay’s critique and the ensuing debate</em>. Oxford:\nClarendon Press.</li>\n<li>Long, D. G., 1977, <em>Bentham on Liberty: Jeremy Bentham’s\nIdea of Liberty in Relation to his Utilitarianism</em>, Toronto:\nUniversity of Toronto Press.</li>\n<li>Luño, A-E P., 1981, “Jeremy Bentham and Legal\nEducation in the University of Salamanca during the Nineteenth\nCentury”, <em>The Bentham Newsletter</em>, 5: 44–54.</li>\n<li>Mack, M. P., 1955, “The Fabians and Utilitarianism”,\n<em>Journal of the History of Ideas</em>, 16 (1): 76–88.</li>\n<li>MacKennan, T. L., 1981, “Benthamism in Santander’s\nColombia”, <em>The Bentham Newsletter</em>, 5: 29–43.</li>\n<li>Nozick, R., 1974, <em>Anarchy, State, and Utopia</em>, New York:\nBasic Books.</li>\n<li>Peonidis, F., 2009, “Bentham and the Greek Revolution: New\nevidence”, <em>Journal of Bentham Studies</em>, 11: n.p.\n [<a href=\"https://uclpress.scienceopen.com/hosted-document?doi=10.14324/111.2045-757X.036\" target=\"other\">Peonidis 2009 available online</a>]\n </li>\n<li>Pitts, J., 2005, “Jeremy Bentham: Legislator to the\nWorld?” in B. Schultz and G. Varouxakis, eds., <em>\nUtilitarianism and Empire</em>, Lanham, MD: Lexington Books, pp.\n57–92.</li>\n<li>Postema, G. J., 1989, <em>Bentham and the Common Law\nTradition</em>, Oxford: Clarendon.</li>\n<li>–––, 1998, “Bentham’s\nEquality-Sensitive Utilitarianism”, <em>Utilitas</em>, 10 (2):\n144–58.</li>\n<li>–––, 2014, “The Soul of Justice: Bentham\non Publicity, Law, and the Rule of Law”, in Z. Xiabo and M.\nQuinn, eds., <em>Bentham’s Theory of Law and Public\nOpinion</em>, Cambridge: Cambridge University Press, pp.\n40–62.</li>\n<li>Quinn, M., 2008, “A Failure to Reconcile the Irreconcilable?\nSecurity, Subsistence and Equality in Bentham’s Writings on the\nCivil Code and on the Poor Laws”, <em>History of Political\nThought</em>, 29 (2): 320–43.</li>\n<li>–––, 2012, “Which comes first,\nBentham’s chicken of utility, or his egg of truth?”\n<em>Journal of Bentham Studies</em>, 14:\n <a href=\"http://discovery.ucl.ac.uk/1353163/\" target=\"other\">Quinn 2008 published online</a>.</li>\n<li>–––, 2022, <em>Bentham</em>, Cambridge: Polity\nPress.</li>\n<li>Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Resnik, J., 2011, “Bring back Bentham: ‘open\ncourts,’ ‘terror trials,’ and public\nsphere(s)”, <em>Law, Ethics, Human Rights</em>, 5 (1):\n1–69.</li>\n<li>Richardson, R., 1986, “Bentham and Bodies for\nDissection”, <em>The Bentham Newsletter</em>, 10:\n22–33.</li>\n<li>Rosen, F., 1983, <em>Jeremy Bentham and Representative Democracy:\nA Study of “The Constitutional Code</em>”, Oxford:\nClarendon Press.</li>\n<li>–––, 2003, <em>Classical Utilitarianism from\nHume to Mill</em>, London &amp; New York: Routledge.</li>\n<li>–––, 2005, “Jeremy Bentham on Slavery and\nthe Slave Trade”, in B. Schultz and G. Varouxakis (eds.),\n<em>Utilitarianism and Empire</em>, Lanham, MD: Lexington Books, pp.\n31–56.</li>\n<li>Rosenblum, N., 1978, <em>Bentham’s Theory of the Modern\nState</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Schofield, P., 1996, “Bentham on the Identification of\nInterests”, <em>Utilitas</em>, 8 (2): 223–34.</li>\n<li>–––, 2006, <em>Utility &amp; Democracy: The\nPolitical Thought of Jeremy Bentham</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2009, <em>Bentham: A Guide for the\nPerplexed</em>, London: Continuum.</li>\n<li>–––, 2013, “The Legal and Political Legacy\nof Jeremy Bentham”, <em>Annual Review of Law and Social\nScience</em>, 9: 51–70.</li>\n<li>–––, 2014, “Jeremy Bentham on Taste, Sex\nand Religion”, in Z. Xiabo and M. Quinn, eds.,\n<em>Bentham’s Theory of Law and Public Opinion</em>, Cambridge:\nCambridge University Press, pp. 90–118.</li>\n<li>Semple, J., 1993, <em>Bentham’s Prison: A Study of the\nPanopticon Penitentiary</em>, Oxford: Clarendon Press.</li>\n<li>Sokol, M., 2011, <em>Bentham on Sex and Marriage: Law and Utility\nin Historical Context</em>, London: Continuum.</li>\n<li>Stephen, L., 1902, <em>The English Utilitarians</em>, 3 vols., New\nYork: G. P. Putnam’s Sons.</li>\n<li>Ten, C. L., 1987, <em>Crime, Guilt, and Punishment: A\nPhilosophical Introduction</em>, New York: Oxford University\nPress.</li>\n<li>Twining, W. L., 1985, <em>Theories of Evidence: Bentham and\nWigmore</em>, London: Weidenfeld and Nicolson.</li>\n<li>Thomas, W., 1979, <em>The Philosophic Radicals: Nine Studies in\nTheory and Practice, 1817–1841</em>, Oxford: Clarendon\nPress.</li>\n<li>Wallas, G., 1926, “Bentham as Political Inventor”,\n<em>Contemporary Review</em>, 129: 308–19.</li>\n<li>Warke, T., 2000, “Multi-Dimensional Utility and the Index\nNumber Problem: Jeremy Bentham, J. S. Mill, and Qualitative\nHedonism”, <em>Utilitas</em>, 12 (2): 176–203.</li>\n<li>Zhai, X., and S. Palmer (eds.), 2021, <em>Bentham Around the\nWorld</em>, Clark, NJ: Talbot Publishing.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "consequentialism",
            "economics: philosophy of",
            "Foucault, Michel",
            "hedonism",
            "Mill, James",
            "Mill, John Stuart",
            "Mill, John Stuart: moral and political philosophy",
            "pleasure",
            "punishment, legal",
            "sovereignty",
            "utilitarianism: history of"
        ],
        "entry_link": [
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../economics/": "economics: philosophy of"
            },
            {
                "../foucault/": "Foucault, Michel"
            },
            {
                "../hedonism/": "hedonism"
            },
            {
                "../james-mill/": "Mill, James"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../mill-moral-political/": "Mill, John Stuart: moral and political philosophy"
            },
            {
                "../pleasure/": "pleasure"
            },
            {
                "../legal-punishment/": "punishment, legal"
            },
            {
                "../sovereignty/": "sovereignty"
            },
            {
                "../utilitarianism-history/": "utilitarianism: history of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bentham\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/bentham/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=bentham&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/bentham/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=bentham": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/bentham/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=bentham&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/bentham/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.ucl.ac.uk/bentham-project\" target=\"other\">Bentham Project</a>,\n University College London.",
            "<a href=\"https://uclpress.scienceopen.com/collection/d9fd23f6-7bde-4c1d-bfb4-052943bdf955\" target=\"other\"><em>Journal of Bentham Studies</em></a>",
            "<a href=\"http://www.centrebentham.fr\" target=\"other\">Centre Bentham</a>",
            "<a href=\"http://www.utilitarianism.net\" target=\"other\">Utilitarianism,\n website written by William MacAskill, Richard Yetter Chappell, and\nDarius Meissner.</a>"
        ],
        "listed_links": [
            {
                "https://www.ucl.ac.uk/bentham-project": "Bentham Project"
            },
            {
                "https://uclpress.scienceopen.com/collection/d9fd23f6-7bde-4c1d-bfb4-052943bdf955": "Journal of Bentham Studies"
            },
            {
                "http://www.centrebentham.fr": "Centre Bentham"
            },
            {
                "http://www.utilitarianism.net": "Utilitarianism,\n website written by William MacAskill, Richard Yetter Chappell, and\nDarius Meissner."
            }
        ]
    }
}