{
    "url": "biodiversity",
    "title": "Biodiversity",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Daniel P. Faith\n<danfaith9@yahoo.com.au>",
        "author_links": [
            {
                "mailto:danfaith9%40yahoo%2ecom%2eau": "danfaith9@yahoo.com.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nDaniel P. Faith\n&lt;<a href=\"mailto:danfaith9%40yahoo%2ecom%2eau\"><em>danfaith9<abbr title=\" at \">@</abbr>yahoo<abbr title=\" dot \">.</abbr>com<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jun 11, 2003",
        "substantive revision Thu Feb 4, 2021"
    ],
    "preamble": "\n\nThe term “biodiversity” is a contraction of\n“biological diversity” or “biotic diversity”.\nThese terms all refer to the idea of living variation, from genes and\ntraits, to species, and to ecosystems. The popular contraction\n“biodiversity” came about in the mid-1980s, heralded by a\nsymposium in 1986 and an influential follow-up book,\nBiodiversity (Wilson 1988). These events often are\ninterpreted as the beginning of the biodiversity story, but this\nmid-1980s activity actually was both a nod to important past work, and\na launching of something quite new, in ways not fully anticipated.\n\nThe new term “biodiversity” energised some fundamental\nideas developed over the previous decade (or longer). Precursor terms\nlike “biotic diversity” had helped to communicate why we\nshould be concerned about the loss of variety, arising from the\nspecies extinction crisis (later, the “biodiversity\ncrisis”). This recognised the idea that living variation itself\nhas current value, because it provides the opportunity for future\nbenefits for humanity. The International Union for the Conservation of\nNature (IUCN 1980) summarised these early ideas about variety as\nproviding both “insurance” and “investment”\nbenefits. The focus on the variety of life was echoed later in the\nConvention on Biological Diversity’s (CBD) definition of\n“biodiversity”, and in the Intergovernmental Platform on\nBiodiversity and Ecosystem Services (IPBES). The IPBES conceptual\nframework, describing “nature’s contributions to\npeople” (Díaz et al. 2018), includes the maintenance of\noptions for future generations that is provided by biodiversity as\nvariety (see Faith forthcoming). This value of living variation\ncomplements recognised values of individual species, and it accords\nwith the idea that “biodiversity” may refer both to the\ncollection of individual species (or other units), and to\namount-of-variation as a property of that collection.\n\nThe new term “biodiversity” also catalysed fresh new\nperspectives, with an explosion of academic and philosophical\ndiscussions, evidenced by the many post-1985 published papers having\nthe key term “biodiversity”. Over this period, the term\n“biodiversity” often has reflected a range of different\ndisciplinary perspectives (ecology, systematics, economics, social\nsciences, etc.). The range of conceptual issues addressed are\nreflected in recent books on the philosophy of biodiversity, including\nWhat is Biodiversity? (Maclaurin & Sterelny 2008),\nBiodiversity and Environmental Philosophy (Sarkar 2005),\nRoutledge Handbook of Philosophy of Biodiversity (Garson,\nPlutynski, & Sarkar eds. 2017), Philosophy and\nBiodiversity (Oksanen & Pietarinen eds. 2004), and From\nAssessing to Conserving Biodiversity (Casetta, da Silva, &\nVecchie eds. 2019) (see also the\n Related Entries\n section).\n\nWhile the policy context for conservation of biodiversity has\nmaintained a core focus on variety (as reflected in the CBD and IPBES\ndefinitions), the more academic discussions are harder to pin down.\nPhilosophical discussions about “biodiversity” illustrate\nthe current lack of academic consensus on fundamental issues,\nincluding biodiversity’s definition, its value, and even its\nhistory. Increased popularity of the term among academics has amounted\nto decreased clarity of the term. If we look under “Definition\nof biodiversity” in the Encyclopedia of Biodiversity,\nwe find that “An unequivocal, precise, and generally accepted\ndefinition of biodiversity does not exist” (Swingland 2013). The\nrecent book, Defending Biodiversity (Newman, Varner, &\nLinquist 2017) has the premise that it will be impossible to ever\nsettle on a definition. This entry therefore will focus on these\nfundamental issues concerning biodiversity’s definitions and\nvalues. The particular focus is on the concept of variety (rather than\nthe definition and value of individual elements such as species).\nOther biodiversity-related philosophical issues are covered in other\nSEP entries (see the supplementary document on\n biodiversity preservation\n in the entry on\n environmental ethics,\n and the entries on\n conservation biology\n and on\n ecology).\n",
    "toc": [
        {
            "#PreHistBiodVariValu": "1. Pre-History of “Biodiversity”: Variety and Its Values"
        },
        {
            "#MultBeneBiotDiveInsuInve": "1.1 Multiple benefits of biotic diversity: insurance and investment"
        },
        {
            "#LateWorkVariValuQuesNorm": "2. Later Work on Variety, Its Value, and the Question of Normativity"
        },
        {
            "#FurtExplBiodOptiValu": "2.1 Further exploration of biodiversity option value"
        },
        {
            "#VariValuNorm": "2.2 Variety, value and normativity"
        },
        {
            "#WhatDoWeMeanVariDiveHowDoWeMeasIt": "2.3 What do we mean by “variety” or “diversity” and how do we measure it?"
        },
        {
            "#HowUndeVariHelpUsBuilWorkCalcBiod": "2.4 How understanding variety helps us build a working calculus of biodiversity"
        },
        {
            "#BeyoVari1985NewBiodFram": "3. Beyond Variety—Post 1985 New “Biodiversity” Framings"
        },
        {
            "#EcolServFram": "4. The Ecology/Ecosystem Services Framings"
        },
        {
            "#FurtExplBiodInsuValu": "4.1 Further exploration of biodiversity insurance value"
        },
        {
            "#RatiForEcosFram": "4.2 The rationale for the ecosystems framing"
        },
        {
            "#DefiValu": "4.3 Definitions and values"
        },
        {
            "#Hist": "4.4 History"
        },
        {
            "#ConcObse": "4.5 Concluding observations"
        },
        {
            "#ConsBiolFram": "5. The Conservation Biology Framing"
        },
        {
            "#Intr": "5.1 Introduction"
        },
        {
            "#BiodDefl": "5.2 Biodiversity deflationism"
        },
        {
            "#BiodElim": "5.3 Biodiversity eliminativism"
        },
        {
            "#ConcObse_1": "5.4 Concluding observations"
        },
        {
            "#SociEcolFram": "6. Socio-Ecological Framing"
        },
        {
            "#ConcObse_2": "7. Concluding Observations"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Pre-History of “Biodiversity”: Variety and Its Values\n\nThe term “biodiversity” was coined around 1985, but the\nconceptual, and political, foundations for the new term were developed\nover at least the previous decade. The link between biotic diversity\nand human well-being is clear in the “pre-history” of the\nterm “biodiversity” (roughly, the history of the term\nbefore it was invented). Much of the early work recognising a species\nextinction crisis naturally focussed on the values of individual\nspecies to humanity, in addition to their intrinsic value (for\nreviews, see Farnham 2007; Mazur & Lee 1993). Discussions by Myers\n(1976) and others broadened this focus to include a concern about the\nconsequent overall loss of variety, and why such a loss of variety\nitself matters to humanity. Haskins (1974: 646) summarised an\nimportant discussion meeting where participants called for\n\n\nan Ethic of Biotic Diversity in which such diversity is viewed as a\nvalue in itself and is tied in with the survival and fitness of the\nhuman race.\n\n\nHaskins (1974: 646) argued, “Plants and animals that may now be\nregarded as dispensable may one day emerge as valuable\nresources” and that extinction “threatens to narrow down\nfuture choices for mankind” (see also Anonymous 1974).\nSimilarly, Roush (1977: 9) argued that “diversity increases the\npossibility of future benefits” (for review, see Farnham\n2007).\n\nMyers (1976) arguments for a greater focus on the overall loss of\nvariety appeared in his paper, “An Expanded Approach to the\nProblem of Disappearing Species”. He argued that\n\n\n…the spectrum of species can be reckoned a repository of some\nof society’s most valuable raw materials. Moreover, loss of\nspecies will affect generations into the indefinite future, whose\noptions to utilize species in ways yet undetermined should be kept\nopen. (see also Josephson 1982)\n\n\nMyers and Ayensu (1983) similarly argued that the possible discovery\nof benefits for humans is a primary justification for conservation of\nbiological diversity (see also Myers’ 1979 book, The Sinking\nArk).\n\nThis pre-history considered variety at more than the species level.\nFarnham (2017) provides a useful historical perspective, describing\nhow the standard three levels of variation later recognised by the\nConvention on Biological Diversity (CBD)—genes, species, and\necosystems—became established early as parts of our broader\nconcern about the loss of living variation. He describes this as a\nconvergence of separate concerns about species loss, loss of genetic\nvariety, and the disappearance of ecosystem types. Other support for\nthis convergence is found in early work referring to the variety of\nbiomes or ecosystems as capturing variety at the species level. For\nexample, Ehrenfeld (1970) referred to the potential but unknown uses\nof species and suggested conserving the full variety of ecosystems to\ncapture these future options (arguing that every ecosystem is likely\nto have some useful species). Back in 1972, the botanist, H. H. Iltis,\nargued that we must “preserve sufficient diversity of species\nand of ecosystems” because “we will never reach a point\nwhere we shall know which organisms are going to be of value to man\nand which are not” (Iltis 1972: 204). Ehrenfeld referred to the\nneed globally to conserve a representative set of the different\necosystems (see also Roush 1977). Echoing these concerns, Wilson\n(1984) later lamented the lack of representativeness of the variety of\necosystems in the current protected areas system.\n\nThus, while important early discussion (Lovejoy 1980) linked\n“biological diversity” to species richness, the full\nspectrum of the early work reveals precedents for considering multiple\nlevels—all with conceptual links to the species extinction\ncrisis.\n1.1 Multiple benefits of biotic diversity: insurance and investment\n\nThose bits of pre-history clearly articulate the idea that variety\nitself is important because it maintains future options for humanity.\nHowever, this early work did not establish any consistent terminology\nto describe this. Later work (see below) uses terms like biodiversity\n“option value” (a term used in other ways in economics)\nand “maintenance of options” (a term that includes other\ncontributions from nature, not just those from\nvariety/biodiversity).\n\nBack in 1980, the IUCN (International Union for Conservation of\nNature) reflected on this earlier work, and offered some distinctions\nthat are still useful in philosophical discussions about biodiversity\ndefinitions and values. IUCN’s (1980: section 3) arguments for\nthe conservation of diversity (referring to “the range of\ngenetic material found in the world’s organisms”) echoed\nearlier statements about variety and future options:\n\n\nwe may learn that many species that seem dispensable are capable of\nproviding important products, such as pharmaceuticals….\n\n\nImportantly, IUCN also echoed other early work, in adding a critical\nsecond part to that sentence: “…or are vital parts of\nlife-support systems on which we depend” (IUCN 1980: section 3).\nIUCN provided terms for these two ways in which variety itself\nbenefits humanity:\n\n\npreservation of genetic diversity (their stand-in for the\nnot-yet-defined “biodiversity”) is both a matter of\ninsurance and investment to keep open future options. (IUCN 1980:\nsection 3)\n\n\nIt is informative to trace this insurance and investment duality in\nthe pre-history of “biodiversity”. Roush (1977) listed\nfour reasons for preserving “natural diversity”. In\naddition to the relational values concerning “human\ndelight” and ethics, his reasons included not only the idea that\n“diversity increases the possibility of future benefits”\nbut also that diversity supports stability of the “life support\nsystem”.\n\nHoldren and Ehrlich (1974) argued that loss of a species or loss of\ngenetic diversity can mean loss of potential uses (medicines, foods\netc.), but also referred to the maintenance of the “public\nservice” functions of natural ecosystems. Ehrenfeld (1970)\nsimilarly distinguished between the within ecosystem\nfunctioning/stability argument and the potential uses or option value\nargument. Ehrlich and Ehrlich (1981), in their book\nExtinction discussed the insurance value of the Earth’s\n“biological diversity” through the analogy of popping\nrivets off an airplane wing—we strive to keep all the rivets,\nbecause we do not know how many could be lost before the wing no\nlonger functions.\n\nThis pre-history of “biodiversity” thus considered\nmultiple values for humanity from living variation itself, building on\nthe even-longer history of basic awareness that there lots of kinds of\nthings (e.g., species; for review, see Oksanen 2004). This\nargumentation also added to discussions that had considered\nattribution of “intrinsic value” to variety of life (see\nthe supplement on\n biodiversity preservation\n in the entry on environmental ethics, for discussion of intrinsic\nvalue.\n2. Later Work on Variety, Its Value, and the Question of Normativity\n\nThe new term “biodiversity”, post-1985, marked fresh\nperspectives about what variety or “diversity” might mean,\nand what the benefits and values of biodiversity might be. There also\nwas a continuation and further development of the core perspectives on\nvalue established during the pre-history. Wilson (1985) made the case\nfor a “biological diversity crisis” by arguing that this\nmeans the loss of potential uses, yet to be discovered. Wilson also\nechoed Myers and Ayensu (1983) and others arguing for the importance\nof systematics and the need for discovery of species to address\nknowledge gaps. Later, Wilson (1988) brought these arguments together,\narguing that the new term “biodiversity” reflects our lack\nof knowledge about the components of life’s variation and their\nimportance to humankind.\n\nThe pre-history perspectives, in the writings of Myers and others,\ninfluenced the Brundtland Report, a landmark United Nations report on\nsustainable development (WCED 1987). This report contains the\nmuch-quoted definition:\n\n\nSustainable development is development that meets the needs of the\npresent without compromising the ability of future generations to meet\ntheir own needs.\n\n\nThis is followed by a key requirement:\n\n\nThe loss of plant and animal species can greatly limit the options of\nfuture generations; so sustainable development requires the\nconservation of plant and animal species.\n\n\nThe report’s call for governments to form a “species\nconvention” helped catalyse the creation of the Convention on\nBiological Diversity (CBD; see below).\n\nThese perspectives foreshadow later discussion themes, including:\nfurther exploration of biodiversity option value (including the\nquestion of normativity); analysis of what we mean by\n“variety” and how we measure it; and further exploration\nof the “insurance” aspect of biodiversity value (setting\nthe stage for a multitude of ecological interpretations of\n“biodiversity”).\n2.1 Further exploration of biodiversity option value\n\nPost 1985, the new term “biodiversity” was central to\nperspectives on the value of living variation. McNeely (1988) and Reid\nand Miller (1989) highlighted option values of biodiversity (see also\nNorton 1986). Later, a landmark global report, the Millennium\nEcosystem Assessment (2005: 32), summarised twenty-plus years of\n“biodiversity” conservation, concluding that\n\n\nthe value individuals place on keeping biodiversity for future\ngenerations—the option value—can be significant.\n\n\nAnother decade later, Gascon et al. (2015) reviewed the many, often\nsurprising, benefits of species to argue for the importance of\nbiodiversity option value. Gascon et al. also echoed the earlier\nproposals that “phylogenetic diversity”, a measure of\nbiodiversity based on the tree of life, is a natural way to measure\nthis option value (see section below).\n\nAround that time, the Papal Encyclical Letter “On Care for Our\nCommon Home” (Francis 2015) addressed the loss of biodiversity,\narguing for the importance of not only intrinsic values of species but\nalso the option values of biodiversity:\n\n\nThe loss of forests and woodlands entails the loss of species which\nmay constitute extremely important resources in the future, not only\nfor food but also for curing disease and other uses. Different species\ncontain genes which could be key resources in years ahead for meeting\nhuman needs and regulating environmental problems. (2015: 32)\n\n\nThese arguments referring to surprising benefits from individual\nspecies sometimes have not make it clear whether such values are being\nconsidered for individual species (only), or for variety itself. The\nIPBES Conceptual Framework (Díaz et al. 2015: 14) refers to\n\n\nthe “option values of biodiversity”, that is, the value of\nmaintaining living variation in order to provide possible future uses\nand benefits.\n\n\nHowever, later IPBES discussions of “nature’s\ncontributions to people” use related terms in a more general\nway. Here, Díaz et al. (2018: Table S1) describe\n“maintenance of options” as the “Capacity of\necosystems, habitats, species or genotypes to keep options open in\norder to support a good quality of life”. This broad statement\nseems to cover both individual elements and variety itself.\n\nBartkowski (2019) in his “Valuation of Biodiversity”\nreview, notes that perspectives about economic values of\n“biodiversity” typically have focussed on individual\nelements, with the less-attention to the values of variety, including\nboth option and insurance values. This concern echoes earlier debates\nthat have examined whether option value applies to\nbiodiversity-as-variety, and not just to specific elements.\nConsideration of the potential future benefits from individual species\ncan be interpreted as implying a value for variety (Maclaurin &\nSterelny 2008: 154):\n\n\nThe crucial point about option value is that it makes diversity\nvaluable. As we do not know in advance which species will prove to be\nimportant, we should try to conserve as rich and representative a\nsample as possible.\n\n\nMaier (2012), in his book, What’s So Good About\nBiodiversity?, criticised Maclaurin and Sterelny’s\narguments for biodiversity’s option value. However, this\ncritique may reflect simply a focus on individual elements rather than\nvariety itself. Maier interpreted “option value” as\napplying, in accord with economics usage, to a given element,\nresource, or ecosystem service. Any quantification of value, Maier\nargued, would require estimates of reliability of stock, risk\naversion, and willingness to pay—all missing in Maclaurin and\nSterelny’s arguments. These views are partly reconciled by\nrecognising that reference to “option value of\nbiodiversity” is a current value of variety itself, and does not\nhave to be interpreted to mean that the actual value of the future\nbenefits is determined. This difference in perspectives also has\nplayed a role in debates about whether biodiversity option value has\nnormative standing.\n2.2 Variety, value and normativity\n\nBiodiversity as variety provides option/investment and insurance\nbenefits to humanity, but this leaves open the question as to the\nnature of the value of such benefits. Haskins (1974) had called for\n“an Ethic of Biotic Diversity”, in which variety’s\nbenefit has ethical import because we care about the well-being of\nfuture generations. Similarly, when IUCN (1980: Section 3) reviewed\nthe arguments for the conservation of biotic diversity, they linked\nthis to moral principles:\n\n\nThe issue of moral principle relates particularly to species\nextinction, and may be stated as follows. Human beings have become a\nmajor evolutionary force. While lacking the knowledge to control the\nbiosphere, we have the power to change it radically. We are morally\nobliged-to our descendants and to other creatures-to act\nprudently… We cannot predict what species may become useful to\nus. Indeed we may learn that many species that seem dispensable are\ncapable of providing important products, such as pharmaceuticals, or\nare vital parts of life-support systems on which we depend. For\nreasons of ethics and self-interest, therefore, we should not\nknowingly cause the extinction of a species.\n\n\nThis early discussion, linking biodiversity’s option value to\nethical/moral obligations to future generations, anticipated the\nrationale for the Convention on Biological Diversity (CBD). Schroeder\nand Pisupati (2010: 9) in “Ethics, Justice, and the Convention\non Biological Diversity”, note that the CBD statements on\nconservation of biodiversity include consideration of\nintergenerational justice:\n\n\nThe first CBD objective, the conservation of biodiversity, is an\nurgent act of attaining intergenerational justice; an act that\nrequires sustained, engaged international collaboration. To deplete\nthe planet of essential resources and leave to future generations a\nworld which severely limits their options, is unjust.\n\n\nIn this context, biodiversity is valued (now) because we care about\nthe welfare of future generations; thus, we see a current benefit, and\na link to justice, in biodiversity’s maintenance of options for\nfuture generations. This is seen as a kind of relational value,\nrelating the present generation to future generations (Faith 2017:\n76):\n\n\nthe best argument for what we call the option value of biodiversity is\nthat we see many currently beneficial units, and maintaining a large\nnumber of units (biodiversity) for the future will help maintain a\nsteady flow of such beneficial units… Biodiversity option value\ntherefore links “variation” and “value”:\nproviding a fundamental relational value of biodiversity reflecting\nour degree of concern about benefits for future generations\n\n\nIntergenerational justice or equity is linked to both\ninvestment/options and insurance (Bartkowski 2017: 53):\n\n\n…the two perspectives—insurance and options—are\ninherently interlinked; however, they depend on different types of\nuncertainty (supply vs. demand), which makes the differentiation\nsensible. The view of biodiversity as carrier of option value stems\nfrom the recognition that a biodiverse ecosystem, which contains many\ndifferent species and genomes, can best accommodate unanticipated\nfuture desires (preferences). As in the case of insurance value, this\ncan be coupled with considerations of intergenerational equity. In\nfact, in the case of option value, this notion is arguably more\ncentral: high levels of biodiversity now mean many different options\nfor our descendants.\n\n\nAn important consideration in recognising an ethical/moral/justice\nimperative to conserve biodiversity is the recognition that\nbiodiversity, as variety, has a current benefit/value because of that\nrelational link between generations. However, other framings omit this\nidea of a current benefit from variety itself. For example, Binder and\nPolasky (2013), in the Encyclopedia of Biodiversity, list\nways that biodiversity links to human well-being.\n\n\nBiodiversity contributes to human well-being directly through\nprovision of foods, fuels, and fibers, and indirectly through its role\nin enhancing ecosystem functions that lead to the provision of\necosystem services.\n\n\nThis might seem to capture biodiversity option value in referring to\nfoods and other goods, but in fact leaves out the idea that society\nsees biodiversity and the prospect for discoveries for future\ngenerations as a current contribution to well-being. The well-being is\nnot just that realised when the new product is discovered.\n\nSuch a restricted interpretation can mean that the maintenance of\noptions provided by biodiversity fails to enter into assessments. For\nexample, Brauman et al. (2020) set out to assess the current global\nstatus of nature’s contributions to people, but explicitly chose\nnot to assess maintenance of options—arguing that this is a\ncontribution to well-being only through its support of the well-being\nobtained from other contributions of nature. In contrast, the IPBES\nglobal assessment (IPBES 2019) did assess global status of maintenance\nof options, noting that, even when considering other specific nature\ncontributions, such as medicinal resources, biodiversity’s\nmaintenance of options is a current benefit in promising possible\nfuture medicinal benefits (see also “Phylogenetic diversity and\nIPBES” in Other Internet Resources).\n\nAbsence of recognition of the current benefit of biodiversity’s\nmaintenance of options has other implications. Maier’s (2018)\narguments that biodiversity option value has no normative standing are\nbased on an assessment of variety as a future, not current, benefit.\nAn alternative argument, supporting normative standing, focuses on\nbiodiversity-as-variety as a current benefit, because this variety is\nrecognised as maintaining options for future generations. This current\nvalue links to normativity—we ought to act to conserve\nbiodiversity and its maintenance of options because it is the right\nthing to do, given that we care about, and have some relational moral\nobligation to future generations (Faith 2018a). These discussions\nhighlight the idea that both “current benefit” and\n“future benefit” are relevant to biodiversity option\nvalue. Biodiversity is a benefit currently because it offers\nunanticipated future benefits, and given the relational sense of\nobligation to future generations is a basis for normativity.\n\nAnother entry in the Encyclopedia of Biodiversity, Chan and\nSatterfield’s (2013) “Justice, Equity and\nBiodiversity”, supports this idea, in linking biodiversity\nconservation to justice for future generations. However,\n“biodiversity” is left undefined, and seen as something\nthat exists within ecosystems that maintains ecosystems services for\nfuture generations. The focus on ecosystem services (where\n“biodiversity” often has ecological interpretations; see\nsection below) means that the value of variety itself is left unstated\nby the authors.\n\nSome perspectives give less emphasis to the idea of variety and its\nbenefit/value, and in these, the arguments for a normative status for\n“biodiversity” appear to be weaker. For example, Koricheva\nand Siipi (2004: 46) see only intrinsic value as a pathway for moral\nobligation to (overall) biodiversity:\n\n\nIf biodiversity is found to be intrinsically valuable, we have strong\nmoral reasons to conserve all aspects of biodiversity, regardless of\ntheir potential utilitarian and instrumental values. If, conversely,\nbiodiversity is found to be only instrumentally valuable, then on\nmoral grounds we can demand conservation only of those parts which\n(directly or indirectly) enhance (or will in the future enhance) the\nwell-being or quality of some other valuable entity or state of\naffairs.\n\n\nGiven this perspective, they conclude that: “conservationists\nare burdened with the need to find or create instrumental values for\neach biodiversity element”. Similarly, in “The Moral Value\nof Biodiversity”, Oksanen (1997) concludes that “It is not\nthe thing ‘biodiversity’ that is of ultimate moral value,\nbut its various constituents”. Thus, this argumentation seems to\nbe disconnected from the idea that, collectively, all of the\n“elements” or “constituents”—the\nvariety—delivers biodiversity option value and justice for\nfuture generations.\n\nSignificantly, the popular instrumental-versus-intrinsic argumentation\nhas sometimes meant a neglect of biodiversity option\n value.[1]\n Commonly, the instrumental value of biodiversity is characterised as\nall about supporting of functions/resilience within ecosystems, not\nglobal option values. Some literature suggests that relational values\nimportantly move beyond the standard instrumental-versus-intrinsic\nframework (e.g., Himes & Muraca 2018). In the context of\nbiodiversity option value, greater appreciation of relational values\nin fact restores a link to biodiversity value that has been obscured\nby the popular instrumental-versus-intrinsic argumentation.\n\nThe link to variety, as compared to individual elements and/or other\necosystem/ecological aspects, is an issue in other discussions. Eser\net al. (2014) acknowledge a normative content for biodiversity, and\nconsider it as arising from the politics at that time (“the\nmaking of the term ‘biodiversity’ indicates that the\nconcept is morally impregnated”, 2014: 38). They argue that\n\n\nthe Convention on Biological Diversity, not only addresses issues of\nconservation, but also sustainable use and fair sharing of benefits.\nThis triad of objectives reflects the three dimensions of sustainable\ndevelopment: ecology, economy and society. (2014: 38)\n\n\nThis equation may imply that the justice/normativity link is to be\ninterpreted as depending on the “fair sharing of\nbenefits”. This fair sharing of benefits often is played out\nlocally, while the conservation of biodiversity is more a global CBD\nissue. Thus, there does not seem to be a tight fit between Eser et\nal.’s historical perspective, tied to the origins of the term\n“biodiversity”, and the deeper historical perspective of\nethical arguments for the conservation of biotic diversity. Indeed,\nEser et al. do not provide any explicit analysis of the benefits and\nvalue of biodiversity-as-variety. Instead, they see the wide range of\nnotions of “biodiversity” as quite useful in providing a\n“boundary” object that can embrace lots of meanings and\nperspectives about value. A similar perspective is found in a proposed\n“weak deflationism” for biodiversity (see below), where\nwhat is regarded as “biodiversity” is the outcome of\n“normative discussion of what merits conservation”.\n\nEser et al.’s arguments nevertheless are compatible with the\nearly ideas, going back to Haskins and others, of a normative reason\nto protect biodiversity-as-variety for future generations.\nSignificantly, Eser et al. (2014: 94) argue that:\n\n\nconsideration of the needs of future generations does not count as\n“nice to have” but is considered a “must”.\nFinding the appropriate balance between obligations to current and\nfuture generations is one of the main challenges of global change\nethics.\n\n\nEser et al. conclude (2014: 95)\n\n\nthe moral belief that our dealing with the needs of future generations\nis a matter of Justice is so widespread that it can almost count as a\ntruism. To substantiate biodiversity strategies with the rights of\nfuture generations therefore is a promising strategy because it meets\nthe intuitions of so many people.\n\n2.3 What do we mean by “variety” or “diversity” and how do we measure it?\n\nDuring the pre-history of “biodiversity”, the species\nextinction crisis provided motivation to consider the value of living\nvariation, covering not only species richness but also genetic\nvariation and the variety of ecosystems. The new term\n“biodiversity” introduced fresh considerations,\nparticularly reflecting ecology and ecosystems perspectives. The CBD\ndefinition of “biodiversity” used two terms,\n“variability” and “diversity”, that have\ninvited multiple interpretations:\n\n\n… the variability among living organisms from all sources\nincluding, inter alia, terrestrial, marine and other aquatic\necosystems and the ecological complexes of which they are part; this\nincludes diversity within species, between species and of\necosystems.\n\n\nThe definition of “biodiversity” in the IPBES Glossary\n(see the link in\n Other Internet Resources)\n partly follows that of the CBD:\n\n\nThe variability among living organisms from all sources including\nterrestrial, marine and other aquatic ecosystems and the ecological\ncomplexes of which they are a part. This includes variation in\ngenetic, phenotypic, phylogenetic, and functional attributes, as well\nas changes in abundance and distribution over time and space within\nand among species, biological communities and ecosystems.\n\n\nThe vague open-ended term “diversity”, in the CBD\ndefinition, can be interpreted as any of a number of ecological\ndiversity indices (see below). In contrast, IPBES reflects pre-history\nin shifting to the word, “variation”. Naturally, this word\nhas provided its own interpretation challenges, including how to\ncharacterise it consistently across different levels of variation.\nWeitzman (1992) presented an influential general framework for\nbiodiversity as variation, based on the idea of objects, and measures\nof difference between objects. Biodiversity (amount of variation) then\ndepends not only on the number of objects, but also the degree of\ndifferences among them. In the book Philosophy and\nBiodiversity, the link between “biodiversity” and\ninvestment and insurance value is described as depending on:\n“The higher the number and the degree of difference between\nbiological elements” (Koricheva & Siipi 2004: 39). Weikard\n(2002) argued that any operational concept of biodiversity must have\nsome measure of difference between objects (see also Maclaurin &\nSterelny 2008; Morgan 2009).\n\nThis strategy assumes that we can define meaningful differences among\nthe initial objects, and also sort out the trade-off between having\nmore objects versus bigger differences. One difficulty is that there\nare many ways to define “differences”. Morgan (2009)\nconcluded that, even if one has some agreed natural measure of\ndifferences, we do not know how to trade off more objects for less\ndifferences (or vice versa) to assess biodiversity.\n\nAn alternative general framework, proposed by Faith (1994), avoids\nweaknesses of the objects-differences strategy. The framework\nside-steps the idea of differences and instead uses the inferred\nrelative number of biodiversity “units” among any given\nset of “objects”. If “biodiversity” is\nvariation or variety in the sense of units (such as species) that we\nideally count-up, then what are those units or elements that make-up\nbiodiversity? The units of interest logically cover more than just the\nspecies level (and even the core idea of “species” may\nconsider alternative classifications, such as those in folk cultures;\nOksanen 2004). Maclaurin and Sterelny’s argument (2008:\n154) that option value “links variation and value”\nconsidered option value for units across all levels of\nbiodiversity.\n\nA common assessment of biodiversity-as-variety evaluates a set of\nprotected areas and asks “how many different species are\nrepresented by that set of areas?” In the general framework,\nthis converts to a more general biodiversity question: “how many\ndifferent units are represented by that set of objects?” Thus,\n“species” corresponds to just one kind of\n“unit” of variation (with different species as different\n“units”), and areas are just one kind of\n“objects”. Biodiversity assessment considers a wide range\nof these possible objects for decision-making—not just areas,\nbut also species, populations, and other entities. Biodiversity\ntherefore can be quantified in general as a count of the number of\ndifferent units represented by a given set of objects. Examples of\nother objects/units combinations include species/traits (or features)\nand species’ populations/genetic variants.\n\nA strength of the framework is that it addresses the fact that many of\nthe “units” are unknown, and so, cannot simply be\ncounted-up. Many species are still unknown to science; many features\nof species are undescribed. We may directly observe some objects (say,\nspecies) and want to quantify the relative number of un-observed units\n(say, features) that are represented by those objects. The relative\nnumber of units for any object or set of objects therefore has to be\nestimated through the use of an inferential model or a surrogate of\nsome kind.\n\nA model that successfully reflects the underlying processes that\ndetermine the distribution of units among objects (a\npattern—process model) may tell us enough about the\nrelationships among the objects to enable inference of relative\nnumbers of units represented by any set of those objects. This is the\nrationale for a general framework for using pattern to quantify\ndiversity at a level below that of the original objects.\n\nThus, relationships among different objects ) informs us about what is\nof interest: the amount of biodiversity, expressed as the number of\nunits represented by those objects. This “counting-up” of\nthe lower-level units means that we can compare different sets of\nobjects by the count of the number of different units represented, and\nlook at useful information such as gains and losses as the set\nchanges.\n\nSuppose, for example, that the units of interest are features of\nspecies (a feature might be some morphological characteristic). These\nfeatures in general have unknown future benefits; feature diversity\nprovides another example of biodiversity option value. If we apply the\nrationale that all these features should be treated as units of equal\nvalue, then some species (those that are phylogenetically distinctive;\nsee below) will make larger contributions to the overall feature\ndiversity represented by a set of species. Thus, equal value at the\nfine scale among features leads to differential values at the coarse\nscale among species.\n\nFeature diversity raises measurement challenges. Not only do we not\nknow, in general, the future value of different features, but also we\ncannot even list the features for most species. Phylogenetic pattern\nprovides one way to estimate and quantify variation at the feature\nlevel. The predicted total feature diversity of a set of species is\nreferred to as its “phylogenetic diversity” (PD). The\namount of PD, and the estimated relative feature diversity, of a set\nof species is calculated as the minimum total length of all the\nphylogenetic branches required to connect all the species in that set\non the phylogenetic tree (Faith 1992). This definition follows from an\nevolutionary model in which branch lengths reflect evolutionary\nchanges (new features), and shared ancestry accounts for shared\nfeatures among species. Note that a set of three species may have\nlower PD (lower feature diversity) than a set of two species (see\nfigure below).\n\nThe phylogenetic diversity measure illustrates how the\npattern—process framework differs from the objects and\ndifferences approach. For PD, the objects are species (or other taxa)\nand the units that we would like to count-up are features (or\ncharacters). The use of phylogeny (the “tree of life”) to\nmake inferences about the relative feature diversity of different sets\nof species is a way to overcome our lack of knowledge about all the\nfeatures of different species. Maclaurin and Sterelny (2008: 20)\nincorrectly interpreted PD as an application of the objects and\ndifferences approach, with species as objects and differences given by\n“genealogical depth”. Instead, a pattern (phylogeny) among\nthe species is used. This pattern allows inferences about the\nbiodiversity units of interest—here, features or characters of\nspecies.\n\n\n\n\n\n(a)\n\n\n\n\n(b)\n\n\n\nFigure. A general biodiversity model\nlinking relationships among objects to measures of biodiversity based\non the indirect counting-up of units. In each case, relationships\namong the three objects represented by solid dots provides information\nabout their representation, as a set, of underlying units. The ovals\nhighlight the idea that their degree of similarity within the pattern\nindicates degree of shared units.\n\n\n\nfor phylogenetic diversity, the objects are species, the units are\nevolutionary features and the phylogenetic/feature diversity of the 3\n(solid dots) species is indicated by the summed lengths of the blue\nbranches on the phylogenetic tree. Note that this set of 3 species has\ngreater phylogenetic diversity / feature diversity than the set of two\nhollow-dot species (red branches). [An\n extended description of figure (a)\n is in the supplement.] \n\n\nanother kind of pattern for species-as-objects is a Euclidean space\nrepresenting key environmental gradients. The inferred biodiversity\nmay be functional trait diversity. [An\n extended description of figure (b)\n is in the supplement.] \n\n\n\nSarkar’s (2014: 3) consideration of “units” other\nthan species appears compatible with the general pattern–process\nframework. However, Sarkar’s proposal differs in integrating\nother additional calculations into the quantification of biodiversity.\nFor example, Sarkar proposed that biodiversity must include a number\nof aspects beyond richness. At the species-level, Sarkar (2014: 3)\nargued that a measure of biodiversity should reflect complementarity,\nrarity, endemism and also “equitability” (reflecting\nrelative abundances). Another aspect to be included was\n“disparity” reflecting taxonomic distance between species.\nSarkar’s consideration of a taxonomic measure of difference\nbetween species as part of “biodiversity” echoes the\npopular objects and differences strategy.\n\nPossible proposals to include aspects beyond richness (counting units)\nseem limitless. This problem highlights the advantages of a simpler\nframework where “biodiversity” focuses on the number of\nunits, while recognising that the same units can be part of numerous\nother calculations that include standard ecological indices. Thus,\ncomplementarity, endemism, and dissimilarities and many traditional\necological “diversity” measures all can be calculated, but\nthey are not measures of “biodiversity”.\n2.4 How understanding variety helps us build a working calculus of biodiversity\n\nThe framework based on counting-up units contrasts with other\nproposals for general frameworks for biodiversity, including those\nproposals that have attempted to include a variety of\ncalculations—endemism, dissimilarity, rarity, etc.—within\nthe definition of biodiversity (see below). The framework based on\ncounting-up units implies not only that biodiversity as variety is\nthat total count, but also that we can carry out lots of other\nimportant, associated, calculations that will be useful for\ndecision-making and policy—notably looking at gains and losses.\nThis idea of a biodiversity “calculus” contrasts with the\necologically oriented perspective that there are many different\nindices called “biodiversity”.\n\nOne important companion calculation is called\n“complementarity” (Kirkpatrick 1983)—the gains and\nlosses in biodiversity as objects are gained or lost. While\nbiodiversity is quantified by an inferred count of number of different\nunits, decision-making about biodiversity uses various calculations\nbased on those units. Complementarity usefully indicates marginal\nchanges—the number of units lost, or the increase in the number\nrepresented by an added protected area. Faith (1994) focussed on\ncomplementarity as an example of useful calculations (referred to as\n“components of biodiversity”) based on inferred counts of\nunits:\n\n\nThe problem of prioritising areas illustrates how pattern\n(specifically environmental pattern) can be used as a surrogate for\nbiodiversity, in predicting the same components of biodiversity that\nwould be used at the species level directly, notably\ncomplementarity.\n\n\nThe approach using environmental pattern for such calculations can be\ngeneralised to cover other patterns to make inferences about\nunderlying units. For PD, the pattern is phylogeny and a\nspecies’ complementarity reflects the relative number of\nadditional features contributed by that species. PD decision-making\nsometimes uses calculations that are integrated with species’\nestimated extinction probabilities—extending the idea of\ncomplementarity to “expected” loss. Priorities for\nconservation efforts for endangered species then can respond both to\ndegree of threat and to amount of potential loss of PD. One such\nconservation program is the EDGE of Existence program\n(“evolutionarily distinct and globally endangered”; see\nthe link in\n Other Internet Resources).\n\nBy recognising other calculations as useful, but not equated with\n“biodiversity”, and by side-stepping the weaknesses of the\nobjects-differences framework, we can focus on counting-up different\nunits, and focus on the value of having many different units. Thus,\nthe idea of a useful calculus further reinforces the role of\nbiodiversity-as-variety in providing option and insurance values.\n\nThis perspective is relevant to the second part of the IPBES\ndefinition of biodiversity (above), where “biodiversity”\nis to include various measures of “change” in\ndistribution, abundance etc. This perhaps reflects the ecology\nperspectives in which “biodiversity” is equated with\nvarious ecological indices and calculations, such as dissimilarity or\nrelative abundance. Sometimes it is not at all clear how the key idea\nof “biodiversity loss”—complementarity—applies\nin such cases. This issue is addressed further in the section below on\necology and ecosystems framings.\n3. Beyond Variety—Post 1985 New “Biodiversity” Framings\n\nThe IPBES definition illustrates the trend to include many other\nbiotic/ecological aspects in the definition. Popular encyclopedia\nentries on “biodiversity” and major reviews illustrate how\nthis trend has contributed to definitional chaos. In the\nEncyclopedia of Biodiversity, Swingland argues “An\nunequivocal, precise, and generally accepted definition of\nbiodiversity does not exist”. in the Routledge Handbook of\nthe Philosophy of Biodiversity, nearly every chapter discusses\nthe “biodiversity” definition problem. The SEP entry\nsupplement\n biodiversity preservation under environmental ethics\n laments “A persistent complication is that there continues to\nbe no single agreed measure of biodiversity”.\n\nKoricheva and Siipi (2004) observe that\n\n\nbiodiversity still lacks a universally agreed upon definition and is\noften redefined depending on the context and the author’s\npurpose.\n\n\nThey suggest that:\n\n\nSuch great terminological variation is understandable, since concerns\nfor biodiversity relate to several realms of human practice, including\nconservation, management, economics, and ethics, and thus give rise to\ndifferent “discourses”. (2004: 28)\n\n\nThe common measure, species richness, illustrates the different\nperspectives. The pre-history of biodiversity, reflecting the species\nextinction crisis and the values of variety, provides a core rationale\nfor a definition that includes counting-up species. In contrast,\nKoricheva and Siipi (2004) argue that popularity of species richness\n(as a measure) continues simply because it is understandable,\nmeasurable, and it uses available information (see also Sarkar 2019).\nA section below (“the Conservation Biology framing”)\nreturns to this issue, in considering a perspective that assumes that\nthe “biodiversity” concept arose as part of the new\ndiscipline of conservation biology in the mid-1980s.\n\nThe pre-history of “biodiversity” also highlighted the\nidea that the value of variety itself should be considered along-side\nthe recognised benefits (and dis-benefits) of individual species\n(“biospecifics”), and all these benefits/values can enter\ninto trade-offs and synergies that support decision-making. Some\ncurrent perspectives or framings about biodiversity and its value can\nbe understood as again blurring that distinction between biodiversity\nand “biospecifics”. One such framing equates\n“biodiversity” with all of nature. A focus on\n“biodiversity” as the collection of individual\nunits/elements suggests that “biodiversity” covers so many\nindividual elements that it more or less can be equated with biotic\n“nature”. An ecological/ecosystem framing of biodiversity\nexpands this further—“biodiversity” may be\ninterpreted as including not only the many individual elements but\nalso all their ecological interactions, and associated processes.\nThese expanded perspectives, focused on elements and their\ninteractions, create a risk that we may miss the opportunity to\nproperly consider both values of nature/ecology and the values\nassociated with biodiversity-as-variety.\n\nSeveral factors may help to explain the current wide range of\nperspectives about biodiversity’s definition and values. One is\nthe idea that the term “biodiversity” was intended to\ncapture everything we wish to conserve within the discipline of\nconservation biology. Another is the idea that\n“biodiversity” only gains meaning and importance to\nhumanity in supporting ecosystem functions and services. Both of these\nframings are supported by particular interpretations of the history of\nthe concept. More recently, another emerging perspective is a call for\na re-casting of the term “biodiversity” to make it more\nholistic in reflecting socio-ecological thinking. The themes outlined\nabove roughly correspond to three kinds of re-framings of\n“biodiversity”, defining the next three sections below:\n §4 the ecology/ecosystem services framings,\n §5 the conservation biology framing, and\n §6 socio-ecological framings.\n4. The Ecology/Ecosystem Services Framings\n\n“Ecosystem services” are all the benefits that humanity\nderives from ecosystems (Daily 1997). While that term is probably\nyounger than the term, “biodiversity”, it not only has its\nown pre-history (as “natural services” from nature; see,\ne.g., Holdren & Ehrlich 1974), but also shares a pre-history with\n“biodiversity”. This history reveals early ideas about how\naspects of biotic diversity are important to maintaining the\necological functions that support ecosystem services. These\ndiscussions drew upon the long tradition in ecology to use various\necological indices—broadly referred to as\n“diversity” indices—and so inviting equation with\nthe new term “biodiversity”. Exploring this connection\nbetween biotic diversity, ecological functions, and services has\nbecome a massive research venture over the past 25 years (for review,\nsee, e.g., Gómez Baggethun et al. 2010). The name of the\ninternational platform for biodiversity, “Intergovernmental\nPlatform on Biodiversity and Ecosystem Services” (IPBES),\nreflects this active, high-profile, connection.\n\nThe ecosystem services framing of “biodiversity”\ninterprets the many aspects of “diversity” that link to\nfunctions and services as part of a “biodiversity”\nnarrative. This narrative is interpreted as the basis for a rationale\nfor conserving biodiversity, because it is claimed to link\nbiodiversity, for the first time, to benefits for humanity.\n4.1 Further exploration of biodiversity insurance value\n\nThe insurance and options benefits from living variation recognised in\nthe pre-history, also appear in later work, using the new term\n“biodiversity” (e.g., Bartkowski 2017). Post 1985, such\ndiscussions continued to follow the pre-history in considering the\nvalue of variety itself for insurance. However, alternative\nperspectives focussed more on the early discussions pointing to a\nbroader ecological/ecosystem interpretation of insurance and related\nideas such as “ecological integrity”.\n\nIUCN (1980) described “ecological integrity” as:\n\n\nMaintaining the diversity and quality of ecosystems and enhancing\ntheir capacity to adapt to change and provide for the needs of future\ngenerations.\n\n\nSometimes this more ecological rationale has been discussed as part of\na new “biodiversity” framing, so setting the stage for\necological definitions of “biodiversity”.\n\nFor example, Ehrlich and Wilson (1991) listed three basic reasons why\nwe should care about biodiversity. The first was most closely linked\nto intrinsic value: a “moral responsibility to protect what are\nour only known living companions in the universe”. Their second\nreason reflected the option value of biodiversity—the idea\nthat\n\n\nhumanity has already obtained foods, medicines, and industrial\nproducts and other benefits from biodiversity, and has the potential\nfor many more.\n\n\nTheir third reason was an insurance type argument, based on the\nrecognised ecosystem services provided by natural ecosystems. Here,\nthey made a link to biodiversity in arguing that “diverse\nspecies are the key working parts” within such ecosystems.\n\n“Working parts” could mean variety, or it could refer to\nthe ecology of lots of parts in an ecosystem. In earlier work (Ehrlich\n& Ehrlich 1981) “insurance” was linked to the loss of\nbiological diversity and so linked to variety. Ehrlich and\nEhrlich’s (1992: 219) later arguments for biodiversity\nconservation referred both to option value (from variety expressed as\nnature’s “genetic library”), and to insurance\nvalue—expressed less as variety and more as a consideration of\necological aspects. Thus, “insurance” sometimes joins\n“ecological integrity”, and similar terms as part of a\nstoryline about many relevant aspects of ecosystems.\n\nSimilarly, the Millennium Ecosystem Assessment (2005) described the\nmultiple values of biodiversity in a way that reinforced the duality\nof insurance and option values from variety, but also linked\n“biodiversity” to ecological aspects, including resilience\nand integrity.\n4.2 The rationale for the ecosystems framing\n\nThe ecosystem services framing builds on the important idea that\necosystems provide many, often under-appreciated, benefits to people\n(clean water, useful resources, etc). It is natural to consider that\nthese benefits provide a case for conservation of\n“biodiversity”. The ecosystems framing adopts the\nperspective that it is “biodiversity”—typically,\ninterpreted broadly as ecological “diversity”—that\nis the basis for these important functions and services. This framing\nreduces the focus on variety of species or other elements (in the\nsense of counting-up). Perhaps because of the natural\nwithin-ecosystems focus, this also has amounted to lesser emphasis on\nglobal scale option value from such variety. The ecosystems framing\nreflects this perspective in the range of “biodiversity”\ndefinitions considered. The idea that “biodiversity” is\nimportant for ecosystem services is given support by defining\n“biodiversity” in terms of those ecological factors that\nare important for ecosystem services.\n4.3 Definitions and values\n\nNoss (1990) regarded biodiversity as including composition, structure,\nand function, reflecting the range of “diversity” measures\nin ecology (ecological diversity indices are reviewed in Koricheva\n& Siipi 2004). The CBD’s use of the general term,\n“diversity” (see above) has provided a broad canvas for\ninterpretation of “biodiversity” in a framing focussed on\necosystems. The now popular ecological definitions of\n“biodiversity” are exemplified in the Routledge\nHandbook of Ecosystem Services:\n\n\nBiodiversity broadly encompasses the number, abundances, functional\nvariety, spatial distribution, and interactions of genotypes, species,\npopulations, communities, and ecosystems. (Balvanera et al. 2016:\n46)\n\n\nDíaz et al. (2009: 55) describe “biodiversity”\nas\n\n\nthe number, abundance, composition, spatial distribution, and\ninteractions of genotypes, populations, species, functional types and\ntraits, and landscape units in a given system.\n\n\nMace, Norris, and Fitter (2012) argued that the definition of\n“biodiversity” “embraces many alternative diversity\nmeasures” (see also Hillebrand et al. 2018), and highlighted\n“biodiversity” as species composition: “the\ncomposition of biological communities in the soil” is an example\nof how “biodiversity is a factor controlling the ecosystem\nprocesses that underpin ecosystem services” (2012: 22).\n\nThis broad use of diversity measures recalls early work linking\nvarious ecological diversity indices to “stability” and\nother desirable aspects of ecosystems (for review, see the SEP\n ecology\n entry). In the ecosystems framing, “biodiversity\nservices” are defined in terms of ecological processes:\n\n\nBiodiversity is structured by a range of ecological processes\n….These processes—which can be termed “biodiversity\nservices”—underpin and determine the stability,\nresilience, magnitude and efficiency of the functions and properties\nof ecosystems. (Seddon et al. 2016: 7)\n\n\nThis characterisation neglects the previous use of this same term to\nrefer to global biodiversity option value (see Faith 2018b).\nSimilarly, Norton (2001) pointed to increased emphasis on processes\nthat under-pin ecological “health” or\n“integrity”, and de-emphasis of a conventional\nelements-oriented perspective for biodiversity.\n\nThese ecological definitions of “biodiversity” have\ninfluenced some perspectives about biodiversity values. The\nEncyclopedia of Biodiversity chapter on “The Value of\nBiodiversity” (Dasgupta, Kinzig, & Perrings 2013: 168),\nreflects the ecosystems framing in claiming that:\n\n\nThe value of biodiversity derives from the value of the final goods\nand services it produces. To estimate this value, one needs to\nunderstand the “production functions” that link\nbiodiversity, ecosystem functions, ecosystem services, and the goods\nand services that enter into final demand.\n\n\n“Option value” is mentioned in the chapter, but is linked\nto a “resource”, not to variety itself.\n\nThis framing is reflected also in the 2019 review, “The Economic\nValue of Biodiversity”, by Hanley and Perrings. It focuses on\necosystem services, and does not mention the investment value of\nbiodiversity-as-variety. Similarly, in the Encyclopedia of\nBiodiversity chapter on “Sustainability and\nBiodiversity” (Cavender-Bares et al. 2013: 73), the value of\nbiodiversity is based on its relationship to ecosystem functions, and\ntheir value of in terms of human well-being. Thus, the ecosystems\nframing tends to focus on within-ecosystem values and tends to ignore\nglobal values including option value.\n\nA core perspective in this framing is that “biodiversity”\nis about critical ecological elements:\n\n\nA major criticism of the valuation approach to conserving biodiversity\nis that current understanding of the mechanistic links between species\nand the functioning and resilience of ecosystems is far from\ncomplete…. Without this, we may fail to protect those elements\nof diversity crucial for ecosystem integrity. (Seddon et al. 2016)\n\n4.4 History\n\nA within-ecosystems focus, and typical neglect of global biodiversity\noption value, sometimes has been supported by an accounting in which\n“biodiversity” historically had been recognised as all\nabout intrinsic value, until the ecosystem services framing forged\nlinks for the first time to anthropocentric values (for discussion,\nsee Faith 2018b).\n\nThe rationale for the ecosystem services framing presents two\nprincipal approaches to conservation:\n\n\nCaricaturing slightly, the first is focused on biodiversity\nconservation for its own sake, independent of human needs or desires.\nThe second is focused on safeguarding ecosystem services for\nhumanity’s sake: for the provision of goods, basic life-support\nservices, and human enjoyment of nature. (Balvanera et al. 2001:\n2047)\n\n\nThe ecosystems framing sees the ongoing loss of biodiversity as a\nvalues failure that calls for a shift to ecosystem services\nvalues:\n\n\nDespite appeals about the intrinsic value of nature and important\ngains in some areas, the dominant flow of human activity has continued\nmoving in directions detrimental to biodiversity conservation …\nIn response, some within the conservation community have attempted to\nbroaden the base of support for biodiversity conservation by adopting\nthe concept of ecosystem services and by arguing that the conservation\nof biodiversity matters not only because of its intrinsic value but\nbecause it is essential for human well-being. (Reyers et al. 2012:\n503)\n\n\nThus, in this historical accounting the ecosystems framing forged the\nfirst links from “biodiversity” to anthropocentric\nvalues.\n\nA popular history of ecosystem services (Gómez Baggethun et al.\n2010) similarly presents the original motivation for considering\necosystem services as helping biodiversity conservation:\n\n\nIt starts with the utilitarian framing of beneficial ecosystem\nfunctions as services in order to increase public interest in\nbiodiversity conservation (Westman 1977…).\n(Gómez-Baggethun et al. 2010: 1209)\n\n\nIn reality, Westman did not refer to biodiversity (nor “biotic\ndiversity”). Instead, Westman linked functions to various\naspects of ecology, including “how components of the system\ninteract” (1977: 961) and “the flow of materials and\nenergy” (1977: 963).\n\nCustomised narratives in the ecosystem framing are apparent also in\nPeterson et al.’s (2018: 1) reference to:\n\n\nthe notion of the “maintenance of options” type of\nnature’s contributions to people (NCP 18; Díaz et al.\n2018), enhancing “the capacity of ecosystems to keep options\nopen in order to support a good quality of life” (Díaz et\nal. 2018: SM).\n\n\nThis would seem to make a strong case for a focus on ecosystems, but\nPeterson et al. misquote this foundational paper on NCP.\n“Maintenance of options” in fact is described (Díaz\net al. 2018: Table S1) as the “Capacity of ecosystems, habitats,\nspecies or genotypes to keep options open in order to support a good\nquality of life”. The misrepresentation gives the impression\nthat the maintenance of options is only about how ecosystems support\nhuman-well-being.\n4.5 Concluding observations\n\nThe shift by IPBES away from an ecosystem services framing in favour\nof a broader “nature’s contributions to people”\n(NCP; for discussion, see Díaz et al. 2018, 2019; Faith 2018b)\nreflected, in part, the need to better address global/regional\nbiodiversity values:\n\nIt has to be recognized that the concept of “nature’s\ncontributions to people” has evolved in a context where\nchallenges related to the loss of biodiversity are addressed and\nassessed on global and regional levels. The implications of this\nwidening from the ecosystem service framework … is largely an\nissue that remains to be explored. (IPBES 2018a)\n\nThe IPBES regional and global assessments (IPBES 2018b,c, 2019)\nadvanced this wider conceptual framework through the use of a measure\nof biodiversity-as-variety, phylogenetic diversity, as an indicator of\nthe global status of the maintenance of options (see link to\n“Phylogenetic diversity and IPBES” in Other Internet\nResources).\n5. The Conservation Biology Framing\n5.1 Introduction\n\nSarkar (2017: 43) summarises the basis for what might be called the\nconservation biology framing of “biodiversity”:\n\n\nthe term “biodiversity” and the associated concept(s) were\nintroduced in the context of the institutional establishment of\nconservation biology as an academic discipline….\n\n\nThe SEP\n conservation biology\n entry describes the motivation for a biodiversity framing tied to\nthis historical link: “in the 1980s, conservation biologists\nunited and argued that biodiversity should be the focus of the\ndiscipline” which “rests on the value assumption that\nbiodiversity is good and ought to be conserved”. This rationale,\nhowever, was not linked to any clear idea of what\n“biodiversity” means:\n\n\nconservation biology as a discipline has expended a great deal of\nintellectual effort in articulating exactly what is its object of\nstudy and has settled on biodiversity as the answer. However, there is\na debate concerning what biodiversity is….\n\n\nHere, the stated rationale is that “biodiversity” is\nnormative and is the focus of the discipline, but there is no\nreference to the pre-history discussions of a normatively relevant\ndefinition of biodiversity as variety.\n\nThe review of the development of the conservation biology, by Meine,\nSoule, and Noss. (2006), does trace some historical foundations. It\ndocuments the idea of a shift in thinking from individual species\nlosses to loss of the diversity of life. This shift is described\nnicely in comparing two editions (1959 and 1987) of the same book\n(Matthiessen 1987)—where the 1987 version introduces new\nemphasis on the loss of “the diversity of\n life”.[2]\n\nSarkar (2017) notes that ecological diversity indices were largely\nignored in the early history of conservation biology. In contrast,\nMeine, Soule, and Noss. (2006) frequently used the term\n“diversity”, This perhaps reflected co-author Noss’s\n(1990) much-cited paper characterising biodiversity as including\ncomposition, structure, and function, which echoes the range of\n“diversity” measures in ecology. The unlimited\npossibilities of such diversity measures may have contributed to the\ndifficulty in finding agreement on a single definition of\n“biodiversity”. The conservation biology framing thus\ngains justification in embracing the prospect of\n“working-backwards”, with the challenge to define\n“biodiversity” to capture those aspects of\nbiological/conservation normative value.\n\nHow then is “biodiversity” to be defined under these\nassumptions? The next two sections review the important discussions\nabout the definition of biodiversity, and the later arguments that the\ndefinitional problems mean that the term “biodiversity” is\ncounter-productive and should be abandoned.\n5.2 Biodiversity deflationism\n\n“Biodiversity deflationism” emphasises the role of the\nbiodiversity concept in conservation practice. Deflationists consider\nbiodiversity as “what is conserved by the practice of\nconservation biology” (Sarkar 2002: 132). Unlike other framings\nof biodiversity, biodiversity is operationally defined, there is no\nsemantic definition, just an output from the practice of\nconservation.\n\nThe practice of conservation biology should, within this view, be\nsystematic conservation planning (Sarkar & Margules 2002). What is\nbeing conceptualised as biodiversity is revealed by this activity.\nThis decision procedure involves using algorithms to identify a\nconservation area network; a conservation area that best optimises the\ninterests of local stakeholders. Local stakeholders, people with an\ninterest in that land, decide what features they want to prioritise.\nWhile stakeholder can have a wide range of interests in this land,\nthey must include “biodiversity constituents” or\n“true surrogates” (Sarkar 2005, 2012). These describe the\nbiotic features that the procedure maximises. “Biodiversity\nconstituents” might appear to largely overlap with\n“biodiversity” in the sense of variety: a list of items,\nor measures of variety that describe biological items, which we aim to\npreserve. However, these items are not necessarily measuring biotic\nvariety, as Sarkar includes sacred groves or the Monarch Butterfly\nMigration route as constituents of biodiversity. Sarkar stipulates\nthat biodiversity constituents must satisfy the following conditions:\nthey must be biological, variability of biotic features must be\nrepresented, taxonomic spread should be represented, these biotic\nfeatures should not just be those of material use (Sarkar 2005; 2012).\nAs such, there are adequacy conditions which guide what the procedure\noptimises and, as a result, conserves.\n\nFor proponents of biodiversity deflationism, there is no fact of the\nmatter about what biodiversity is. Biodiversity is irrevocable local\nand tied to local values and interests in the natural environment. We\ncan only infer backwards from what is preserved in the act of\nconservation to what convention tends to be described as biodiversity\n(Sarkar 2019). Therefore, biodiversity cannot play any role as a\nconcept outside of the context of local conservation practice. This\nhas an odd implication. Across biology biodiversity is used as concept\nwithin the science, both for conservation but for other sciences.\nDeflationists tend to dismiss biodiversity eliminativists, who want to\nban the use of “biodiversity”, as too impractical as it is\na common term in conservation (Sarkar 2019: 378). They, however, limit\n“biodiversity” to only conservation practice, claiming\nthat scientific concepts of biodiversity are irrelevant (Sarkar 2019:\n381). Biodiversity does not exist for the use of scientists in\nresearch. Thus, biodiversity conventionalists eliminate biodiversity\nfrom the context of scientific research and claim such research does\nnot indicate what features we should preserve (see also the section on\n operationalizing biodiversity in the entry on conservation biology).\n5.3 Biodiversity eliminativism\n\nWhile biodiversity has been accepted as a core goal of modern\nconservation science, there is some scepticism in the philosophical\nliterature toward the utility of this concept. A series of\nphilosophers have argued that the biodiversity concept is detrimental\nto environmental efforts (Maier 2012; Santana 2014, 2018; Morar,\nToadvine, & Bohannan 2015). These arguments tend to coalesce\naround several points: that the biodiversity concept not\noperationalizable, biodiversity is not desirable, and that the concept\nobscures many of the values people have towards nature. The argument\nis that, either the concept cannot be used, or it may be used, but\nwith recognition that it does not represent our ethical interest in\nthe environment.\n\nThe belief that biodiversity cannot be adequately operationalized has\nappeared numerous times through the literature. Some argue that\noperationalizing biodiversity requires a “diversity”\nmeasure, or set of measures, both represent the concept of\nbiodiversity and not be contradictory in its recommendations about\nwhat to conserve. Bryan Norton early on suggested that\n\n\nstrong arguments show that an index that captures all that is\nlegitimately included as biodiversity is not possible. Biodiversity\ncannot be made a measurable quantity. (Norton 2008: 373)\n\n\nThis is because many of the different scientific measures for\nbiodiversity are incommensurable, clashing with each other. For\nexample: an area of possessing populations that are highly\nfunctionally distinct may be quite species poor. Some take the\napparent incommensurability of biodiversity measures to show that\nmeasures should be used in context sensitive instances either relative\nto the development of conservation science or to the local interests\nof stakeholders (Koricheva & Siipi 2004; Sarkar 2005; Maclaurin\n& Sterelny 2008). An alternative considered is that we should\nnarrow down the list of measures to that are most important according\nto some desiderata (Maclaurin & Sterelny 2008; Lean 2017; Meinard,\nCoq, & Schmid 2019).\n\nEven if “biodiversity” was made to be tractable (in the\nsense used above), eliminativists are suspicious of biological\ndiversity being regarded as valuable. Diversity across different\nbiological arrangements is even argued to be undesirable. Maier points\nto diversity of parasites and diseases being undesirable (Maier 2012).\nDiversity sometimes reduces the value of taxa as the rarity of a\nspecies tends to increase its value (Santana 2014). Morar, Toadvine,\nand Bohannan (2015) explain this is because it is “not\nlife’s variety but rather life itself” (2015: 24) that is\nvaluable (without making reference to insurance and options values of\nvariety). The perception of a mismatch between ethical interests in\nthe environment and diversity is emphasised by all eliminativists.\n\nEliminativists believe “biodiversity” has mislead\nconservation, as the concept and term was designed to be exhaustive of\nhuman interests in the environment—and it cannot succeed in this\ntask. The idea that biodiversity was designed to represent all human\nvalues of the environment appears in Maier’s work as “the\nbiodiversity project”, Santana argues that biodiversity is just\nan intermediary for “ecological value”, and Morar,\nToadvine, and Bohannan argue that biodiversity “does not exhaust\nwhat we value in the natural world” (2015: 24). Santana (2014)\nprovides a clear presentation of this belief and uses it to argue that\nbiodiversity is a misleading and unnecessary step in conservation\nplanning. Biodiversity acts in conservation as an intermediary between\nall the ways we value the environment and the implementation of\nsurrogate measures for these values, which are then used in\nconservation planning. Santana suggests we should remove the step of\nconsidering biodiversity and directly represent our values in the\nenvironment without considering diversity (see also SEP\n conservation biology\n entry)\n\nThis perspective differs from other frameworks for understanding\nbiodiversity (including the focus on variety, originating in the\npre-history of the term), which consider biodiversity as just one of\nseveral different conservation values which may trade off against each\nother (Faith 1995; Norton 2015; Lean 2017). One may choose to\nprioritise wilderness, or ecosystem services, over biodiversity and\ndecision theoretic measures will be used to weight such\nconsiderations.\n\nIt is argued by some that biodiversity not only doesn’t\nrepresent all the ways the public values nature, it may also hinder\nthe public’s engagement in nature. As a scientific\n“proxy” for natures value it is viewed as a dangerous case\nof scientism (Morar, Toadvine, & Bohannan 2015; Sarkar 2019). By\nhaving the “veneer of objectivity” it masks the normative\ndimension of conservation. The argument is that this can lead to an\nattitude of leave it to the scientists and shift the responsibility\naway from the policymakers and the public (Morar, Toadvine, &\nBohannan 2015). This is interpreted as representing a dangerous\nimpediment to the democratic dimension of conservation. This is\nregarded as an interesting question for the interface between\nconservation theory and public policy.\n\nEliminativism proposes that there are tensions in the use of the\n“biodiversity” concept, posing the idea that there is a\nmismatch between the scientific measures of biodiversity and the\nnormative role it plays in conservation science. This perspective\ntherefore contrasts strongly with the historical “variety”\nframing (above), where the scientific measure of biodiversity as\nvariety, and its recognised value to humanity, is the source of\nnormativity\n claims.[3]\n Eliminativists argue that, while it would be hard to remove\n“biodiversity” from use in conservation, this is necessary\nto allow for a clearer connection between humanities interests in the\nenvironment and conservation practice (also see the section on\n eliminating biodiversity in the entry on conservation biology).\n5.4 Concluding observations\n\nSarkar (2019: 375) claims that “the term\n”biodiversity“ and the associated concept(s)” arose\nalong with the discipline of conservation biology. This accords with\nthe deflationist and eliminativist perspectives that the\n“biodiversity story” began around 1985, with conservation\nbiology guiding the conceptual development of\n“biodiversity”, including its definition and values. This\nnarrative does not address the earlier conceptual history that had\narticulated normative value of living variation, and so it raises the\nneed for comparisons with that “variationist” framing.\n\nThe SEP entry\n conservation biology\n provides some basis for comparisons, in exploring the idea that\nconservation biology is all about a still-undefined concept of\n“biodiversity”. In the entry’s section\n what is biodiversity?\n there are no citations of the early discussions from the 1970s, and\nso there is perhaps an under-appreciation of the early ideas of\nvariety as a possible guide to resolving questions of definition. This\nrelates to the interesting issues raised in this section about how the\nconcept/definition of “biodiversity” is supposed to cope\nwith the dis-benefits of some individual species. The challenge\nremains to recognise the possible useful distinction between\nbiodiversity/variety and biospecifics (individual elements).\n\nConsideration of the pre-history of “biodiversity”\nsuggests that the conservation biology framing has adopted a\nstory-line that is a disservice to systematics/taxonomy. As noted\nabove, Sarkar (2017, 2019) follows his claim that the\n“biodiversity” term (and concept) were introduced in the\ncontext of the establishment of conservation biology, with the claim\nthat\n\n\nSubsequently, the term and the concept were embraced by other\ndisciplines particularly by taxonomists…. as a conduit for\nfunding that taxonomists wanted to exploit….\n\n\nThe pre-history, in contrast, reveals how the concept in fact arose\nthrough the work of systematists (e.g., Iltis 1972; Anonymous 1974),\nand was followed by calls by Wilson (1985) and others (see above) for\nmore systematic efforts, in order to fill knowledge gaps (see also\nLean, 2017).\n\nThe conservation biology framing highlights individual elements that\nare valuable, with less emphasis on variety. For example, Sarkar\nargues that conservation logically will focus on “those aspects\nof biotic variety that should be conserved. That does not necessarily\ninclude all of natural variety” (Sarkar 2019: 17).\nSarkar’s example is revealing:\n\n\nThe human skin hosts thousands of microbial species though\ninterpersonal variability is not as high as in the gut which hosts\nmillions… Should we feel an imperative to conserve all the\nmicrobial diversity on the human skin or gut?\n\n\nThis sounds like a powerful example—who likes germs? The\nquestion in reality reveals an absence of consideration of the\nestablished benefits and values of variety itself. The gut microbial\ncontext is particularly revealing—over the past decade or so,\nreductions in an individuals’ variety of gut microbes (e.g., as\nmeasured using the PD biodiversity measure) is now associated with\nmore than a dozen different human diseases. This biodiversity possibly\nprovides a kind of insurance benefit in healthy individuals (see the\nlink to “Phylogenetic Diversity and Human Health”, in\n Other Internet Resources;\n for other philosophical issues related to microbial biodiversity, see\nMalaterre 2017).\n\nA related conceptual disconnect is apparent also in Sarkar’s\n(2017) claim,\n\n\nfor a concept of biodiversity that can be used in practice for\ninstance in the selection of conservation areas, richness was shown to\nbe inadequate in the 1980s.\n\n\nIn contrast, variety or “richness” clearly is the\ndesirable property of the set of conservation areas, and we use parts\nof the biodiversity “calculus” (see above), such as the\ncomplementarity of individual areas, in order to maximise this\nproperty of a nominated set. According to “variationists”,\nthe concept of biodiversity as variety/richness is exactly what is\nneeded to address the biodiversity crisis (Faith 2017).\n\nAbsence of recognition of the historical link between variety and\nnormativity also suggests contrasts. The idea that\n“biodiversity” is the business of conservation biology,\nand that biodiversity is good, implies that,\n\n\nif there is no adequate normative basis for biodiversity conservation,\nconservation biology becomes a dubious enterprise because its explicit\npurpose is the conservation of biodiversity.\n\n\nThe storyline is that conservation biology is normatively oriented,\nand so we have to find a definition of “biodiversity” that\nmatches that normativity. In contrast, variationists would suggest the\nopposite: that “biodiversity” is normatively oriented, and\nthen we have to find a “conservation biology” that\naddresses that normativity. Sarkar concludes that\n\n\nhow “biodiversity” is defined, that is, what the\n“constituents” of biodiversity are, depends on cultural\nchoices about which natural values to endorse for conservation.\n\n\nAs noted above, the constituents of interest can include things like\nsacred groves, and processes like annual migration of Monarch\nbutterflies (Sarkar 2019). Thus, this framing does not recognise\nbiodiversity-as-variety, and its current benefit and normativity;\ninstead, it looks for the elements that may be conserved with some\nnormativity, and calls that “biodiversity”.\n\nThere seems to have been a logical development of arguments in the\nconservation framing—conservation biology was regarded as\nnormatively all about “biodiversity”—a term\ninterpreted as having no clear definition, and so to be defined by\nwhatever conservation might normatively focus on—then arguments\nasserted that conservation focuses in practice on lots of things, and\nthat this was a burden too great for the term. Not yet considered, in\nthe development of philosophical arguments for the conservation\nbiology framing, is the possibility that a miss-step was made right at\nthe beginning—ignoring the preceding long history of\n“biodiversity” interpreted as variety, with current\nbenefit to humanity, and normative import.\n\nEliminativists want to get rid of the term “biodiversity”,\nwith the claim that this would allow for a clearer connection between\nhumanity’s interests in the environment and conservation\npractice. But this is just one of at least three proposed fates for\nthe problematic term “biodiversity”. Those advocating core\nbiodiversity definitions and values based on variety (call them\n“variationists”, see also Burch-Brown and Archer 2017),\nmight advocate adoption of this basic definition, with the claim that\nit not only accords best with the extinction crisis and core\nanthropocentric values (including insurance and investment), but also\neffectively allows trade-offs and synergies with humanity’s\nother interests.\n\nA third pathway is discussed in the next section—where the fate\nof the problematic term “biodiversity” is not to be\neliminativism, nor back-to-basics variationism, but is to be a kind of\n“holism”—“biodiversity” expanded in\nmeaning to cover the whole range of “socio-ecological” or\nhuman-nature links.\n6. Socio-Ecological Framing\n\nThe conservation biology framing interprets “biodiversity”\nas a term that is to capture everything we want to conserve. An\nemerging socio-ecological framing of biodiversity requires that the\nterm take on a broader scope—it is to be made operational, not\njust for conservation, but more broadly for sustainability,\nencompassing the many ways that society and nature are inter-linked.\nWhile conservation biology has interpreted “biodiversity”\nas, from the start, all about society’s conservation values, the\nsocio-ecological framing of biodiversity adopts a different narrative.\nHere, the claim is that, the term “biodiversity” started\nout with a too-narrow, strictly biological, interpretation, and now\nshould be re-cast to better reflect, in different contexts, what\nsociety values about nature. The term “biodiversity” in\nfact appears to wear two different hats in the rationale for a\nsocio-ecological framing: one of expectation and the other of\ndisappointment. The expectation is that “biodiversity” is\nobliged to capture society’s various values and relationships\nwith nature; the disappointment is based on the claim that in reality\n“biodiversity” has been too biotic and creates a\nhuman-nature dichotomy.\n\nThe roots of this framing are found in the idea that biodiversity must\nreflect society’s various environmental concerns. For example,\nthe book, Defending Biodiversity (Newman, Varner, &\nLinquist 2017) focusses on philosophical issues about the value of\n“biodiversity”, because this is seen as the way to\n“throw a sufficiently large net over these many different\nflavours of environmentalism” (2017: 15). Similarly, Lele et al.\n(2018b) take as a starting point the idea that\n\n\nThe concept of biodiversity currently captures the core of\nnaturalists’ concerns for the environment, subsuming earlier\nformulations such as wilderness or wildlife. (2018b: 7)\n\n\nTwo recent books summarise these perspectives (Seeds of Change:\nProvocations for a New Research Agenda, Wyborn, Kalas, & Rust\n2019 and Rethinking Environmentalism: Linking Justice,\nSustainability, and Diversity, Lele et al. 2018a). In the first,\nDíaz (2019: 62) outlines an historical argument that\n“biodiversity” has been purely biological in focus, and\ntherefore needs to be broadened to reflect human links:\n\n\nThe notion of biological diversity existed as a purely biological\nconcept well before the word “biodiversity” emerged“\nand ”Faced with the new challenge and desire to be useful to\nsociety,…. It is now clear that whilst\n“biodiversity” is about the biological realm, its crisis\nand potential solutions pertain to the social, cultural, economic and\npolitical realm….Broadening the concept of\nbiodiversity—from a property of measurable biological systems to\na socio-ecological boundary object.\n\n\nHere, “biodiversity” history is presented as involving a\npost-1985 new-found desire to be useful to society, where, in\nresponse,\n\n\nbiological diversity scientists mustered the best tools they had:\nmathematical and statistical models and indices, which required a\nsingle and simple “currency”—the number of\nspecies…. (Díaz 2019; see also Sarkar 2019)\n\n\nThis claimed new awareness then sets up the call for a re-casting of\n“biodiversity”:\n\n\nIt is now clear that whilst “biodiversity” is about the\nbiological realm, its crisis and potential solutions pertain to the\nsocial, cultural, economic and political realms. Therefore, diverse\nperspectives are needed in reframing biodiversity more broadly. Very\nfew would contest this general statement…. (Díaz 2019:\n62)\n\n\nThis claimed incontestability of the need for a biodiversity reframing\nis given support by an historical accounting that omits the rich\nhistory that had forged links to all those “realms” (see\nprevious sections); anthropocentric insurance and investment values of\nbiotic diversity (typically the number of species) were recognised in\nthe context of the extinction crisis, and integrated in policy along\nwith other needs of society. In contrast, the socio-ecological framing\nadopts a new historical accounting, where counting the number of\nspecies was simply a matter of mathematical and statistical models and\nindices, which then are found inadequate.\n\nThis new historical accounting omits the earlier history that\njustifies why biodiversity’s definition logically focusses on\nvariety (or counting units). This omission props up the claim that\neven while “biodiversity” is largely biological, it is, at\nthe same time, ill-defined and confusing. Redford and Mace (2018: 37)\nargue\n\n\nThe lack of clarity over the term simply adds another layer of\nconfusion to what is already a complicated and interacting set of\nissues.\n\n\nMace (2019: 105) concludes\n\n\nLooking back over the past 25 years—roughly the period that the\nConvention on Biological Diversity (CBD) has been in place and the\nterm “biodiversity” has been in use—I conclude that\nit has become a confusing\n term…[4]\n\n\nIn the book, Rethinking Environmentalism: Linking Justice,\nSustainability, and Diversity, Redford and Mace (2018) reinforce\nthis interpretation of “biodiversity” as having only a\nrecent history, with confusing definitions, and with little link to\nhuman concerns. This is seen as calling for the alternative\nsocio-ecological framing, in which biodiversity conservation is seen\nas “inextricably linked to a living political discourse”\nso that a re-cast “biodiversity” can be defined “as\nincluding human beings” (2018: 33). Similar arguments are found\nin Koricheva and Siipi’s (2004) discussion of biodiversity as\n“a social and political construct”, compared to a purely\nscientific concept (see also the advocacy, by Meinard, Coq, &\nSchmid 2019, of “biodiversity practices” rather than\n“biodiversity”).\n\nPascual (2019) describes this framing as an “integrated\nsocio-ecological” perspective where “biodiversity”\nis variously socially constructed. In this framing,\n\n\nThe ways we perceive and relate to biodiversity and make sense of it\nare influenced by collectively constructed and socially shared\ncognitive frameworks. (2019: 129)\n\n\nArguments for such a biodiversity re-casting have used the\n“people and nature” narrative (Díaz 2019). Mace\n(2014: 1559) describes the “people and nature” perspective\nas requiring\n\n\nmetrics that link nature to human well-being, explicitly identifying\nbenefits needed and received by people … the science has moved\nfully away from a focus on species and protected areas and into a\nshared human nature environment, where the form, function,\nadaptability, and resilience provided by nature are valued most\nhighly.\n\n\nThe rationale for rejecting the idea of “biodiversity” as\na counting up of species (or other units) employs an argument that\n\n\nbiodiversity science can become quite reductionist and focussed on\ndescribing, defining, measuring and counting certain units of life.\n(Mace 2019: 105)\n\n\nMace concludes that\n\n\nThis aspect of biodiversity science to do with metrics has been\nimportant and influential, but curiously often somewhat disconnected\nfrom the global change and sustainability agenda. Important as it is\nthis is, surely it is too narrow a focus for a biodiversity science\nthat will support sustainability. (2019: 106)\n\n\nThis claim again highlights how the narrative in this socio-ecological\nframing sees “biodiversity” not only as obliged to capture\nsustainability, but also, in its present biological form, a\ndisappointment in not being connected to humans.\n\nMartin, McGuire, and Sullivan (2013: 125) similarly characterises\n“biodiversity” as problematical in being “distinct\nfrom other environmental phenomena, as well as from human\nactivity”. They argue that such separation\n\n\nmay engender profoundly “unecological” thinking, by\ndisassembling life’s entities both from each other and from the\ncomplex environmental contexts necessary for sustenance at all\nscales.\n\n\nThis dissatisfaction with counting-up units or items is echoed also in\nphilosopher Elliot’s (2019) argument that\n“biodiversity” has failed to convince people to address\nenvironmental problems. He argues that that we need to “develop\nnew conceptual schemes that link humans with their\nenvironments”, by\n\n\nfocusing less on specific items in the natural world that we want to\nmaintain and more on developing resilient and sustainable systems that\nfacilitate the myriad relationships between humans and nature. (2019:\n68)\n\n\nThese perspectives within the socio-ecological framing suggest\noverlaps with the ideas of the conservation biology framing (though\nthere appears to be little cross-citation). Significantly, both\nportray “biodiversity” as in need of some kind of\nre-casting, and both see the different ways in which society values\nnature as providing guidance about how we should interpret\n“biodiversity” in any given context. At the same time,\ncore differences in the two framings remain: in one,\n“biodiversity” has a working biological definition, but is\nnot connected to society’s values; in the other,\n“biodiversity” is connected to society’s\n(conservation) values, but we have no working definition.\n7. Concluding Observations\n\nA survey of the different perspectives about biodiversity’s\ndefinition and its values suggests new challenges for a coherent\nphilosophy of biodiversity. For example, there has been little work\nrecognising and reconciling two contrasting perspectives. In the\n“variationist” perspective, biodiversity-as-variety, is\njustifiably “biological”, and is normatively relevant; it\nenters broader sustainability practice through trade-offs and\nsynergies with other needs of society. In the\n“socio-ecological” perspective, “biodiversity”\nis too “biological”, with no normativity, and it fails us\nif it is not re-cast to capture as a term all of the things that\nconcern society within the global change and sustainability\nagenda.\n\nThere has been little cross-fertilisation among the three framings\n(variationist, conservation biology, and socio-ecological). The\nchallenge ahead is to reconcile some strikingly different\nperspectives:\n\n“biodiversity” as biological (variation), and the\nbenefit of variety as having normative importance,\nwhat is conserved as having normative importance, and the meaning\nof “biodiversity” obliged to capture all that,\n“biodiversity” as purely biological, and so needing a\nre-casting to gain normative status.\n\n\nChallenges along the way will relate to the need to clarify\ndistinctions between “biodiversity” as a property of a\nset, and “biodiversity” as a reference to that collection\nof units, where values of “biodiversity” then might refer\nto values of individual units or elements. For example, Pascual (2019:\n129) used “nature” and “biodiversity”\ninterchangeably, and this seems to have reflected a core interest in\nsociety’s values for “aspects” of biodiversity (not\nvariety itself):\n\n\nValuation should therefore be about recognising and learning how to\nbridge distinct values of different people for different aspects of\nbiodiversity.\n\n\nWhen we start listing valued “aspects”, it is not\nsurprising that this can be considered to be all-of-nature. However,\nwe must ask: does this miss the opportunity to consider both the\n(often global) value of variety itself, and the (often local) value of\nfavourite “aspects”?\n\nA sense of history (and pre-history) may provide an important lens for\nsynthesis across different perspectives. The IPBES (2019) Global\nAssessment reported that one million species may be at risk of\nextinction. Compare that to a report 40 years earlier, headlined,\n“The Threat to One Million Species” (Norman 1981).\nSignificantly, both reports highlighted how the threat of extinctions\nis a potential loss of variety and future options for humanity.\nHowever, in the more recent reporting, this message is just one of\nmany storylines in a complex, overwhelming, “biodiversity”\nnarrative. This tangle of different storylines suggests that we now\nalso face a “second biodiversity crisis” (Faith 2019), in\nwhich “biodiversity” has become a malleable term that is\nshaped and re-shaped to serve various scientific and policy agendas.\nThe fate of “biodiversity” (the term) may have a lot to\nsay about the fate of “biodiversity” (the variety of\nlife).\n\nA philosophy of “biodiversity” therefore still faces\nchallenges at the most basic levels of definitions, values, and\nhistory. This calls out for synthesis of ideas, with equal attention\nto the fashionable new ideas and the (sometimes) unfashionable older\nideas.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Anonymous, 1974, “Trends, Priorities, and Needs in\nSystematic and Evolutionary Biology”, <em>Systematic\nBiology</em>, 23(3): 416–39. doi:10.1093/sysbio/23.3.416",
                "Balvanera, Patricia, Gretchen C. Daily, Paul R. Ehrlich, Taylor H.\nRicketts, Sallie-Anne Bailey, Salit Kark, Claire Kremen, and Henrique\nPereira, 2001, “Conserving Biodiversity and Ecosystem\nServices”, <em>Science</em>, 291(5511): 2047.\ndoi:10.1126/science.291.5511.2047",
                "Balvanera, Patricia, Sandra Quijas, Berta\nMartín-López, Edmundo Barrios, Laura Dee, Forest Isbell,\nIsabelle Durance, Piran White, Ryan Blanchard, and Rudolf de Groot,\n2016, “The Links Between Biodiversity and Ecosystem\nServices”, in <em>Routledge Handbook of Ecosystem Services</em>,\nMarion Potschin, Roy Haines-Young, Robert Fish, and R. Kerry Turner\n(eds.), New York: Routledge, pp. 45–61.\ndoi:10.4324/9781315775302-5",
                "Bartkowski, Bartosz, 2017, “Are Diverse Ecosystems More\nValuable? Economic Value of Biodiversity as Result of Uncertainty and\nSpatial Interactions in Ecosystem Service Provision”,\n<em>Ecosystem Services</em>, 24: 50–57.\ndoi:10.1016/j.ecoser.2017.02.023",
                "–––, 2019, “Valuation of\nBiodiversity”, in his <em>Oxford Research Encyclopedia of\nEnvironmental Science</em>, Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199389414.013.459",
                "Binder, Seth and Stephen Polasky, 2013, “Biodiversity, Human\nWell-Being, and Markets”, in Levin 2013, 1: 435–439.\ndoi:10.1016/B978-0-12-384719-5.00360-9",
                "Brauman, Kate A., Lucas A. Garibaldi, Stephen Polasky, Yildiz\nAumeeruddy-Thomas, Pedro H. S. Brancalion, Fabrice DeClerck, Ute\nJacob, Matias Enrique Mastrangelo, Nsalambi V. Nkongolo, Hannes\nPalang, Néstor Pérez-Méndez, Lynne J. Shannon,\nUttam Babu Shrestha, Evelyn Strombome, and Madhu Vermar, 2020,\n“Global Trends in Nature’s Contributions to People”,\n<em>Proceedings of the National Academy of Sciences</em>, 117(51):\n32799–32805. doi:10.1073/pnas.2010473117",
                "Brennan, Andrew and Yeuk-Sze Lo, 2002 [2016], “Environmental\nEthics”, <em>The Stanford Encyclopedia of Philosophy</em>,\nEdward N. Zalta (ed.),\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/ethics-environmental/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/ethics-environmental/</a>&gt;.",
                "Burch-Brown, Joanna and Alfred Archer, 2017, “In Defence of\nBiodiversity”, <em>Biology &amp; Philosophy</em>, 32(6):\n969–997. doi:10.1007/s10539-017-9587-x",
                "Casetta, Elena, Jorge Marques da Silva, and Davide Vecchi (eds.),\n2019, <em>From Assessing to Conserving Biodiversity: Conceptual and\nPractical Challenges</em>, (History, Philosophy and Theory of the Life\nSciences 24), Cham: Springer International Publishing.\ndoi:10.1007/978-3-030-10991-2",
                "Cavender-Bares, Jeannine, James Heffernan, Elizabeth King, Stephen\nPolasky, Patricia Balvanera, and William C. Clark, 2013,\n“Sustainability and Biodiversity”, in Levin 2013: vol. 7,\npp. 71–84. doi:10.1016/B978-0-12-384719-5.00390-7",
                "Chan, Kai M.A. and Terre Satterfield, 2013, “Justice, Equity\nand Biodiversity”, in Levin 2013: vol. 4, pp. 434–441.\ndoi:10.1016/B978-0-12-384719-5.00252-5",
                "CBD, 1992, <em>Convention on biological diversity</em>, United\nNations.\n [<a href=\"https://www.cbd.int/convention/text/\" target=\"other\">CBD 1992 available available online</a>]",
                "Daily, Gretchen C. (ed.), 1997, <em>Nature’s Services:\nSocietal Dependence on Natural Ecosystems</em>, Washington, DC: Island\nPress.",
                "Dasgupta, Partha, Ann P. Kinzig, and Charles Perrings, 2013,\n“The Value of Biodiversity”, in Levin 2013: vol. 7, pp.\n167–179. doi:10.1016/B978-0-12-384719-5.00372-5",
                "Díaz, Sandra, 2019, “Why Care About Nature? a\nPluralistic Agenda for Biodiversity”, in Wyborn, Kalas, and Rust\n2019: 62–65.",
                "Díaz, Sandra, Andy Hector, and David A Wardle, 2009,\n“Biodiversity in Forest Carbon Sequestration Initiatives: Not\nJust a Side Benefit”, <em>Current Opinion in Environmental\nSustainability</em>, 1(1): 55–60.\ndoi:10.1016/j.cosust.2009.08.001",
                "Díaz, Sandra, Sebsebe Demissew, Julia Carabias, Carlos\nJoly, Mark Lonsdale, Neville Ash, Anne Larigauderie, Jay Ram Adhikari,\nSalvatore Arico, András Báldi, et al., 2015, “The\nIPBES Conceptual Framework: Connecting Nature and People”,\n<em>Current Opinion in Environmental Sustainability</em>, 14:\n1–16. doi:10.1016/j.cosust.2014.11.002",
                "Díaz, Sandra, Unai Pascual, Marie Stenseke, Berta\nMartín-López, Robert T. Watson, Zsolt Molnár,\nRosemary Hill, Kai M. A. Chan, Ivar A. Baste, Kate A. Brauman, et al.,\n2018, “Assessing Nature’s Contributions to People”,\n<em>Science</em>, 359(6373): 270–272.\ndoi:10.1126/science.aap8826",
                "Ehrenfeld, David W., 1970, <em>Biological Conservation</em>, New\nYork: Holt, Rinehart and Winston.",
                "–––, 1988, “Why Put a Value on\nBiodiversity?”, in Wilson 1988: 212–216.\n [<a href=\"https://nap.nationalacademies.org/read/989/chapter/7#212\" target=\"other\">Ehrenfeld 1988 available online</a>]",
                "Ehrlich, Paul R. and Anne E. Ehrlich, 1981, <em>Extinction: The\nCauses and Consequences of the Disappearance of Species</em>, New\nYork: Random House.",
                "–––, 1992, “The Value of\nBiodiversity”, <em>Ambio</em>, 21(3): 219–226.",
                "Ehrlich, Paul R. and Edward O. Wilson, 1991, “Biodiversity\nStudies: Science and Policy”, <em>Science</em>, 253(5021):\n758–762. doi:10.1126/science.253.5021.758",
                "Elliot, Kevin C., 2019, “The Values Embedded Within\nScientific Language: How ‘Biodiversity’ Separates Humans\nand Nature”, in Wyborn, Kalas, and Rust 2019: 66–68",
                "Eser, Uta, Albrecht Müller, Ann-Kathrin Neureuther, and\nHannah Seyfang 2014, <em>Prudence, Justice and the Good Life: A\nTypology of Ethical Reasoning in Selected European National\nBiodiversity Strategies</em>, Bonn: IUCN Publications.",
                "Faith, Daniel P., 1992, “Conservation Evaluation and\nPhylogenetic Diversity”, <em>Biological Conservation</em>,\n61(1): 1–10. doi:10.1016/0006-3207(92)91201-3",
                "–––, 1994, “Phylogenetic Pattern and the\nQuantification of Organismal Biodiversity”, <em>Philosophical\nTransactions of the Royal Society of London. Series B: Biological\nSciences</em>, 345(1311): 45–58. doi:10.1098/rstb.1994.0085",
                "–––, 1995, <em>Biodiversity and Regional\nSustainability Analysis</em>, Canberra, Australia: CSIRO (Commonwealth\nScientific and Industrial Research Organization) Division of Wildlife\nand Ecology.",
                "–––, 2017, “A General Model for\nBiodiversity and Its Value”, in Garson, Plutynski, and Sarkar\n2017: 69–85.",
                "–––, 2018a, “Biodiversity’s Option\nValue: A Comment on Maier (2018)”, <em>Ambio</em>, 47(6):\n735–736. doi:10.1007/s13280-018-1069-0",
                "–––, 2018b, “Avoiding Paradigm Drifts in\nIPBES: Reconciling ‘Nature’s Contributions to\nPeople,’ Biodiversity, and Ecosystem Services”,\n<em>Ecology and Society</em>, 23(2): art40.\ndoi:10.5751/ES-10195-230240",
                "–––, 2019, “Defending Biodiversity:\nEnvironmental Science and Ethics Jonathan A.Newman, Gary Varner and\nStefan Linquist, 2017 Cambridge and New York: Cambridge University\nPress, Xiv + 441 p.; £36.99 (Pb)”, <em>Journal of Applied\nPhilosophy</em>, 36(4): 688–690. doi:10.1111/japp.12350",
                "–––, forthcoming, “Valuation and\nAppreciation of Biodiversity: The ‘Maintenance of Options’\nProvided by the Variety of Life”, <em>Frontiers in Ecology and\nEvolution</em>.",
                "Farnham, Timothy J., 2007, <em>Saving Nature’s Legacy:\nOrigins of the Idea of Biological Diversity</em>, New Haven: Yale\nUniversity Press.",
                "–––, 2017, “A Confluence of Values:\nHistorical Roots of Concern for Biological Diversity”, in\nGarson, Plutynski, and Sarkar 2017: ch. 1",
                "Francis, 2015, “Encyclical Letter <em>Laudato Si’</em>\nof the Holy Father Francis: On Care for Our Common Home”, 24 May\n2015, The Vatican.\n [<a href=\"http://www.vatican.va/content/francesco/en/encyclicals/documents/papa-francesco_20150524_enciclica-laudato-si.html\" target=\"other\">Francis 2015 available online</a>]",
                "Gascon, Claude, Thomas M. Brooks, Topiltzin Contreras-MacBeath,\nNicolas Heard, William Konstant, John Lamoreux, Frederic Launay,\nMichael Maunder, Russell A. Mittermeier, Sanjay Molur, et al., 2015,\n“The Importance and Benefits of Species”, <em>Current\nBiology</em>, 25(10): R431–R438.\ndoi:10.1016/j.cub.2015.03.041",
                "Garson, Justin, Anya Plutynski, and Sahotra Sarkar (eds.), 2017,\n<em>The Routledge Handbook of Philosophy of Biodiversity</em>, London:\nRoutledge. doi:10.4324/9781315530215",
                "Gómez-Baggethun, Erik, Rudolf de Groot, Pedro L. Lomas, and\nCarlos Montes, 2010, “The History of Ecosystem Services in\nEconomic Theory and Practice: From Early Notions to Markets and\nPayment Schemes”, <em>Ecological Economics</em>, 69(6):\n1209–1218. doi:10.1016/j.ecolecon.2009.11.007",
                "Hanley, Nick and Charles Perrings, 2019, “The Economic Value\nof Biodiversity”, <em>Annual Review of Resource Economics</em>,\n11: 355–375. doi:10.1146/annurev-resource-100518-093946",
                "Haskins, C., 1974, “Scientists Talk of the Need for\nConservation and an Ethic of Biotic Diversity to Slow Species\nExtinction”, <em>Science</em>, 184(4137): 646–647.\ndoi:10.1126/science.184.4137.646",
                "Hillebrand, Helmut, Bernd Blasius, Elizabeth T. Borer, Jonathan M.\nChase, John A. Downing, Britas Klemens Eriksson, Christopher T.\nFilstrup, W. Stanley Harpole, Dorothee Hodapp, Stefano Larsen, et al.,\n2018, “Biodiversity Change Is Uncoupled from Species Richness\nTrends: Consequences for Conservation and Monitoring”,\n<em>Journal of Applied Ecology</em>, 55(1): 169–184.\ndoi:10.1111/1365-2664.12959",
                "Himes, Austin and Barbara Muraca, 2018, “Relational Values:\nThe Key to Pluralistic Valuation of Ecosystem Services”,\n<em>Current Opinion in Environmental Sustainability</em>, 35:\n1–7. doi:10.1016/j.cosust.2018.09.005",
                "Holdren, John P. and Paul R. Ehrlich, 1974, “Human\nPopulation and the Global Environment”, <em>American\nScientist</em>, 62(3): 282–292.",
                "IPBES, 2018a. <em>Background document: nature’s\ncontributions to people</em>, IPBES consultation and capacity building\nworkshop, 4–6 June 2018. Objective 2: Nature’s\ncontribution to people, Bonn, Germany, 15 pages.",
                "–––, 2018b, <em>The IPBES Regional Assessment\nReport on Biodiversity and Ecosystem Services for Asia and the\nPacific</em>, Madhav Karki, Sonali Senaratna Sellamuttu, Sana Okayasu,\nWataru Suzuki (eds.), Bonn, Germany: Secretariat of the\nIntergovernmental Science-Policy Platform on Biodiversity and\nEcosystem Services, 612 pages.\n [<a href=\"https://ipbes.net/assessment-reports/asia-pacific\" target=\"other\">IPBES 2018b available online</a>]",
                "–––, 2018c, <em>The IPBES Regional Assessment\nReport on Biodiversity and Ecosystem Services for Europe and Central\nAsia</em>, Mark Rounsevell, Markus Fischer, Amor Torre-Marin Rando,\nand André Mader (eds.), Bonn, Germany: Secretariat of the\nIntergovernmental Science-Policy Platform on Biodiversity and\nEcosystem Services, 892 pages.\n [<a href=\"https://ipbes.net/assessment-reports/eca\" target=\"other\">IPBES 2018c available online</a>]",
                "–––, 2019, <em>Summary for Policymakers of the\nGlobal Assessment Report on Biodiversity and Ecosystem Services</em>,\nS. Díaz, J. Settele, E. S. Brondízio, H. T. Ngo, M.\nGuèze, J. Agard, A. Arneth, P. Balvanera, K. A. Brauman, S. H.\nM. Butchart, K. M. A. Chan, L. A. Garibaldi, K. Ichii J. Liu, S. M.\nSubramanian, G. F. Midgley, P. Miloslavich, Z. Molnár, D.\nObura, A. Pfaff, S. Polasky, A. Purvis, J. Razzaque, B. Reyers, R. Roy\nChowdhury, Y. J. Shin, I. J. Visseren-Hamakers, K. J. Willis, and C.\nN. Zayas (eds.), Bonn, Germany: IPBES Secretariat.\ndoi:10.5281/zenodo.3553579",
                "Iltis, Hugh H., 1972, “Shepherds Leading Sheep to Slaughter:\nThe Extinction of Species and the Destruction of Ecosystems”,\n<em>The American Biology Teacher</em>, 34(4): 201–221.\ndoi:10.2307/4443886",
                "IUCN, 1980, <em>World Conservation Strategy: living resource\nconservation for sustainable development</em>, International Union for\nConservation of Nature and Natural Resources (IUCN).\n [<a href=\"https://portals.iucn.org/library/efiles/documents/wcs-004.pdf\" target=\"other\">IUCN 1980 available online (pdf)</a>]",
                "Jetzkowitz, Jens, C.S.A. (Kris) van Koppen, Rolf Lidskog, Konrad\nOtt, Lieske Voget-Kleschin, and Catherine Mei Ling Wong, 2018,\n“The Significance of Meaning. Why IPBES Needs the Social\nSciences and Humanities”, <em>Innovation: The European Journal\nof Social Science Research</em>, 31(sup1): S38–S60.\ndoi:10.1080/13511610.2017.1348933",
                "Josephson, Julian, 1982, “Why Maintain Biological\nDiversity?”, <em>Environmental Science &amp; Technology</em>,\n16(2): 94A-97A. doi:10.1021/es00096a717",
                "Justus, James, Mark Colyvan, Helen Regan, and Lynn Maguire, 2009,\n“Buying into Conservation: Intrinsic versus Instrumental\nValue”, <em>Trends in Ecology &amp; Evolution</em>, 24(4):\n187–191. doi:10.1016/j.tree.2008.11.011",
                "Kirkpatrick, J.B., 1983, “An Iterative Method for\nEstablishing Priorities for the Selection of Nature Reserves: An\nExample from Tasmania”, <em>Biological Conservation</em>, 25(2):\n127–134. doi:10.1016/0006-3207(83)90056-3",
                "Koricheva, Julia and Helena Siipi, 2004, “The Phenomenon of\nBiodiversity”, in Oksanen and Pietarinen 2004: 27–53.\ndoi:10.1017/CBO9780511498527.002",
                "Lean, Christopher Hunter, 2017, “Biodiversity Realism:\nPreserving the Tree of Life”, <em>Biology &amp; Philosophy</em>,\n32(6): 1083–1103. doi:10.1007/s10539-017-9592-0",
                "Lele, Sharachchandra, Eduardo S. Brondizio, John Byrne, Georgina\nM. Mace, and Joan Martinez-Alier (eds.), 2018a, <em>Rethinking\nEnvironmentalism: Linking Justice, Sustainability, and Diversity</em>\n(Strüngmann Forum Reports, 23), Cambridge, MA: MIT Press.",
                "–––, 2018b, “Framing the\nEnvironment”, in Lele et al. 2018a: 1–19.",
                "Levin, Simon A., 2013, <em>Encyclopedia of Biodiversity</em>,\nsecond edition, 7 volumes, Cambridge, MA: Academic Press.",
                "Lovejoy, T. E., 1980, “Changes in Biological\nDiversity”, in <em>The Global 2000 Report to The President</em>\n(Volume 2: The Technical Report), Gerald O. Barney (ed.),\nHarmondsworth: Penguin Books, pp. 327–332.",
                "MacArthur, Roberrt H., 1972, “Coexistence of Species”,\nin <em>Challenging Biological Problems: Directions Toward Their\nSolution</em>, John A. Behnke (ed.), New York: Oxford University\nPress, pp. 253–259.",
                "Mace, Georgina M., 2014, “Whose Conservation?”,\n<em>Science</em>, 345(6204): 1558–1560.\ndoi:10.1126/science.1254704",
                "–––, 2019, “Where to Next for Biodiversity\nScience?”, in Wyborn, Kalas, and Rust 2019: 105–108.",
                "Mace, Georgina M., Ken Norris, and Alastair H. Fitter, 2012,\n“Biodiversity and Ecosystem Services: A Multilayered\nRelationship”, <em>Trends in Ecology &amp; Evolution</em>,\n27(1): 19–26. doi:10.1016/j.tree.2011.08.006",
                "Mace, Georgina M., Mike Barrett, Neil D. Burgess, Sarah E.\nCornell, Robin Freeman, Monique Grooten, and Andy Purvis, 2018,\n“Aiming Higher to Bend the Curve of Biodiversity Loss”,\n<em>Nature Sustainability</em>, 1(9): 448–451.\ndoi:10.1038/s41893-018-0130-0",
                "Maclaurin, James and Kim Sterelny, 2008, <em>What is\nBiodiversity?</em>, Chicago: University of Chicago Press.",
                "Maier, Donald S., 2012, <em>What’s So Good About\nBiodiversity?</em>, (The International Library of Environmental,\nAgricultural and Food Ethics, 19), Dordrecht: Springer Netherlands.\ndoi:10.1007/978-94-007-3991-8",
                "–––, 2018, “Should Biodiversity and Nature\nHave to Earn Their Keep? What It Really Means to Bring Environmental\nGoods into the Marketplace”, <em>Ambio</em>, 47(4):\n477–492. doi:10.1007/s13280-017-0996-5",
                "Malaterre, Christophe, 2017, “Going Small: The Challenges of\nMicrobial Biodiversity”, in Garson, Plutynski, and Sarkar 2017:\nch. 10.",
                "Martin, Adrian, Shawn McGuire, and Sian Sullivan, 2013,\n“Global Environmental Justice and Biodiversity Conservation:\nGlobal Environmental Justice and Biodiversity Conservation”,\n<em>The Geographical Journal</em>, 179(2): 122–131.\ndoi:10.1111/geoj.12018",
                "Matthiessen, Peter, 1959 [1987], <em>Wildlife in America</em>. New\nYork: Viking. Updated edition, New York: Viking, 1987.",
                "Mazur, Allan and Jinling Lee, 1993, “Sounding the Global\nAlarm: Environmental Issues in the US National News”, <em>Social\nStudies of Science</em>, 23(4): 681–720.\ndoi:10.1177/030631293023004003",
                "McNeely, Jeffrey A., 1988, <em>Economics and Biological Diversity:\nDeveloping and Using Economic Incentives to Conserve Biological\nResources</em>, Gland, Switzerland: IUCN.",
                "McShane, Katie, 2017, “Is Biodiversity Intrinsically\nValuable? (And What Might that Mean?)”, in Garson, Plutynski,\nand Sarkar 2017: 410–443.",
                "Millennium Ecosystem Assessment, 2005, <em>Ecosystems and Human\nWell-Being: Biodiversity Synthesis</em>, Washington, DC: World\nResources Institute. Ecosystem Assessment, 2005.\n [<a href=\"https://www.millenniumassessment.org/documents/document.354.aspx.pdf\" target=\"other\"> (PDF)</a>]",
                "Meinard, Yves, Sylvain Coq, and Bernhard Schmid, 2019, “The\nVagueness of ‘Biodiversity’ and Its Implications in\nConservation Practice”, in Casetta, da Silva, and Vecchi 2019:\n353–374. doi:10.1007/978-3-030-10991-2_17",
                "Meine, Curt, Michael Soule, and Reed F. Noss, 2006,\n“‘A Mission-Driven Discipline’: The Growth of\nConservation Biology”, <em>Conservation Biology</em>, 20(3):\n631–651. doi:10.1111/j.1523-1739.2006.00449.x",
                "Morar, Nicolae, Ted Toadvine, and Brendan J. M. Bohannan, 2015,\n“Biodiversity at Twenty-Five Years: Revolution Or Red\nHerring?”, <em>Ethics, Policy &amp; Environment</em>, 18(1):\n16–29. doi:10.1080/21550085.2015.1018380",
                "Morgan, Gregory J., 2009, “The Many Dimensions of\nBiodiversity”, <em>Studies in History and Philosophy of Science\nPart C: Studies in History and Philosophy of Biological and Biomedical\nSciences</em>, 40(3): 235–238.\ndoi:10.1016/j.shpsc.2009.06.001",
                "Myers, Norman, 1976, “An Expanded Approach to the Problem of\nDisappearing Species”, <em>Science</em>, 193(4249):\n198–202. doi:10.1126/science.193.4249.198",
                "–––, 1979, <em>The Sinking Ark: A New Look at\nthe Problem of Disappearing Species</em>, New York: Pergamon\nPress.",
                "Myers, Norman and Edward S. Ayensu, 1983, “Reduction of\nBiological Diversity and Species Loss”, <em>Ambio</em>, 12(2):\n72–74.",
                "Newman, Jonathan A., Gary Varner, and Stefan Linquist, 2017,\n<em>Defending Biodiversity: Environmental Science and Ethics</em>,\nCambridge: Cambridge University Press. doi:10.1017/9781139024105",
                "Norman, Colin, 1981, “The Threat to One Million\nSpecies”, <em>Science</em>, 214(4525): 1105–1107.\ndoi:10.1126/science.214.4525.1105",
                "Norton, Bryan G. (ed), 1986, <em>The Preservation of Species: The\nValue of Biological Diversity</em>, Princeton: Princeton University\nPress.",
                "–––, 2001, “Conservation Biology and\nEnvironmental Values: Can There be a Universal Earth Ethic?” in\n<em>Protecting Biological Diversity: Roles and Responsibilities</em>,\nCatherine Potvin, Margaret Kraenzel, and Gilles Seutin (eds.),\nMontreal: McGill-Queen’s University Press, pp.\n71–102.",
                "–––, 2008, “Toward a Policy-Relevant\nDefinition of Biodiversity”, in <em>Saving Biological Diversity:\nBalancing Protection of Endangered Species and Ecosystems</em>, Robert\nA. Askins, Glenn D. Dreyer, Gerald R. Visgilio, and Diana M. Whitelaw\n(eds.), Boston, MA: Springer, pp. 11–20.\ndoi:10.1007/978-0-387-09565-3_2",
                "–––, 2015, <em>Sustainable Values, Sustainable\nChange: a Guide to Environmental Decision Making</em>, Chicago:\nUniversity of Chicago Press.",
                "Noss, Reed F., 1990, “Indicators for Monitoring\nBiodiversity: A Hierarchical Approach”, <em>Conservation\nBiology</em>, 4(4): 355–364.\ndoi:10.1111/j.1523-1739.1990.tb00309.x",
                "Odenbaugh, Jay, 2016 [2019], “Conservation Biology”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Fall 2019 Edition),\nEdward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/conservation-biology/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/conservation-biology/</a>&gt;.",
                "Oksanen, Markku, 1997, “The Moral Value of\nBiodiversity”, <em>Ambio</em>, 26(8): 541–545.",
                "–––, 2004, “Biodiversity Considered\nPhilosophically: An Introduction”, in Oksanen and Pietarinen\n2004: 1–24. doi:10.1017/CBO9780511498527.001",
                "Oksanen, Markku and Juhani Pietarinen (eds.), 2004, <em>Philosophy\nand Biodiversity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498527",
                "Pascual, Unai, 2019, “Why Do We Need a More Pluralistic\nApproach to Valuing Biodiversity?” in Wyborn, Kalas, and Rust\n2019: 126–130",
                "Peterson, Garry D., Zuzana V. Harmáčková, Megan\nMeacham, Cibele Queiroz, Amanda Jiménez-Aceituno, Jan J.\nKuiper, Katja Malmborg, Nadia Sitas, and Elena M. Bennett, 2018,\n“Welcoming Different Perspectives in IPBES:\n‘Nature’s Contributions to People’ and\n‘Ecosystem Services’”, <em>Ecology and Society</em>,\n23(1): art39. doi:10.5751/ES-10134-230139",
                "Reid, Walter V. and Kenton R. Miller, 1989, <em>Keeping Options\nAlive: The Scientific Basis for Conserving Biological Diversity</em>,\nWashington, DC: World Resources Institute.\n [<a href=\"https://www.wri.org/publication/keeping-options-alive\" target=\"other\">Reid and Miller 1989 available online</a>]",
                "Redford, Kent H. and Georgina M. Mace, 2018, “Conserving and\nContesting Biodiversity in the Homogocene”, in Lele et al.\n2018a: 23–40.",
                "Reyers, Belinda, Stephen Polasky, Heather Tallis, Harold A.\nMooney, and Anne Larigauderie, 2012, “Finding Common Ground for\nBiodiversity and Ecosystem Services”, <em>BioScience</em>,\n62(5): 503–507. doi:10.1525/bio.2012.62.5.12",
                "Roush, G. Jon, 1977, “Why Save Diversity?” <em>Nature\nConservancy News</em>, 21(1): 9–12.",
                "Santana, Carlos, 2014, “Save the Planet: Eliminate\nBiodiversity”, <em>Biology &amp; Philosophy</em>, 29(6):\n761–780. doi:10.1007/s10539-014-9426-2",
                "–––, 2018, “Biodiversity Is a Chimera, and\nChimeras Aren’t Real”, <em>Biology &amp; Philosophy</em>,\n33(1–2): art. 15. doi:10.1007/s10539-018-9626-2",
                "Sarkar, Sahotra, 2002, “Defining ‘Biodiversity’;\nAssessing Biodiversity”, <em>Monist</em>, 85(1): 131–155.\ndoi:10.5840/monist20028515",
                "–––, 2005, <em>Biodiversity and Environmental\nPhilosophy: An Introduction</em>, (Cambridge Studies in Philosophy and\nBiology), Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498558",
                "–––, 2012, <em>Environmental Philosophy: from\nTheory to Practice</em>, Chichester, England: John Wiley &amp;\nSons.",
                "–––, 2014, “Biodiversity and Systematic\nConservation Planning for the Twenty-First Century: A Philosophical\nPerspective”, <em>Conservation Science</em>, 2(1): 1–11.\ndoi:10.3126/cs.v2i1.13765",
                "–––, 2006 [2016], “Ecology”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2016 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/ecology/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/ecology/</a>&gt;.",
                "–––, 2017, <em>Approaches to Biodiversity</em>,\nin Garson, Plutynski, and Sarkar 2017: ch. 3.",
                "–––, 2019, “What Should\n‘Biodiversity’ Be?”, in Casetta, da Silva, and\nVecchi 2019: 375–399. doi:10.1007/978-3-030-10991-2_18",
                "Sarkar, Sahotra and Chris Margules, 2002, “Operationalizing\nBiodiversity for Conservation Planning”, <em>Journal of\nBiosciences</em>, 27(4): 299–308. doi:10.1007/BF02704961",
                "Schroeder Doris and Balakrishna Pisupati, 2010, “Ethics,\nJustice and the Convention on Biological Diversity”, United\nNations Environmental Program (UNEP).\n [<a href=\"https://www.unep.org/resources/report/ethics-justice-and-convention-biological-diversity\" target=\"other\">Schroeder and Pisupati 2010 available online</a>]",
                "Seddon, Nathalie, Georgina M. Mace, Shahid Naeem, Joseph A.\nTobias, Alex L. Pigot, Rachel Cavanagh, David Mouillot, James Vause,\nand Matt Walpole, 2016, “Biodiversity in the Anthropocene:\nProspects and Policy”, <em>Proceedings of the Royal Society B:\nBiological Sciences</em>, 283(1844): 20162094.\ndoi:10.1098/rspb.2016.2094",
                "Swingland, Ian R., 2013, “Biodiversity, Definition\nOf”, in Levin 2013: vol. 1, pp. 399–410.\ndoi:10.1016/B978-0-12-384719-5.00009-5",
                "WCED (World Commission on Environment and Development), 1987,\n<em>Our Common Future</em>, Oxford: Oxford University Press.",
                "Weikard, Hans-Peter, 2002, “Diversity Functions and the\nValue of Biodiversity”, <em>Land Economics</em>, 78(1):\n20–27. doi:10.2307/3146920",
                "Weitzman, Martin L., 1992, “On Diversity”, <em>The\nQuarterly Journal of Economics</em>, 107(2): 363–405.\ndoi:10.2307/2118476",
                "Westman, Walter E., 1977, “How Much Are Nature’s\nServices Worth?”, <em>Science</em>, 197(4307): 960–964.\ndoi:10.1126/science.197.4307.960",
                "Wilson, Edward O., 1984, “Million-Year Histories: Species\nDiversity as an Ethical Goal”, <em>Wilderness</em>, 47 (Summer):\n12–17.",
                "–––, 1985, “The Biological Diversity\nCrisis”, <em>BioScience</em>, 35(11): 700–706.\ndoi:10.2307/1310051",
                "––– (ed.), 1988, <em>Biodiversity</em>,\nWashington, DC: National Academies Press. doi:10.17226/989",
                "Wyborn, Carina, Nicole Kalas, and Niki A. Rust, 2019, <em>Seeds of\nChange: Provocations for a New Research Agenda</em>, Biodiversity\nRevisited Symposium Conference Proceedings, 11–13 September\n2019, Vienna, Austria. doi:10.13140/RG.2.2.22170.59848/3"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Anonymous, 1974, “Trends, Priorities, and Needs in\nSystematic and Evolutionary Biology”, <em>Systematic\nBiology</em>, 23(3): 416–39. doi:10.1093/sysbio/23.3.416</li>\n<li>Balvanera, Patricia, Gretchen C. Daily, Paul R. Ehrlich, Taylor H.\nRicketts, Sallie-Anne Bailey, Salit Kark, Claire Kremen, and Henrique\nPereira, 2001, “Conserving Biodiversity and Ecosystem\nServices”, <em>Science</em>, 291(5511): 2047.\ndoi:10.1126/science.291.5511.2047</li>\n<li>Balvanera, Patricia, Sandra Quijas, Berta\nMartín-López, Edmundo Barrios, Laura Dee, Forest Isbell,\nIsabelle Durance, Piran White, Ryan Blanchard, and Rudolf de Groot,\n2016, “The Links Between Biodiversity and Ecosystem\nServices”, in <em>Routledge Handbook of Ecosystem Services</em>,\nMarion Potschin, Roy Haines-Young, Robert Fish, and R. Kerry Turner\n(eds.), New York: Routledge, pp. 45–61.\ndoi:10.4324/9781315775302-5</li>\n<li>Bartkowski, Bartosz, 2017, “Are Diverse Ecosystems More\nValuable? Economic Value of Biodiversity as Result of Uncertainty and\nSpatial Interactions in Ecosystem Service Provision”,\n<em>Ecosystem Services</em>, 24: 50–57.\ndoi:10.1016/j.ecoser.2017.02.023</li>\n<li>–––, 2019, “Valuation of\nBiodiversity”, in his <em>Oxford Research Encyclopedia of\nEnvironmental Science</em>, Oxford: Oxford University Press.\ndoi:10.1093/acrefore/9780199389414.013.459</li>\n<li>Binder, Seth and Stephen Polasky, 2013, “Biodiversity, Human\nWell-Being, and Markets”, in Levin 2013, 1: 435–439.\ndoi:10.1016/B978-0-12-384719-5.00360-9</li>\n<li>Brauman, Kate A., Lucas A. Garibaldi, Stephen Polasky, Yildiz\nAumeeruddy-Thomas, Pedro H. S. Brancalion, Fabrice DeClerck, Ute\nJacob, Matias Enrique Mastrangelo, Nsalambi V. Nkongolo, Hannes\nPalang, Néstor Pérez-Méndez, Lynne J. Shannon,\nUttam Babu Shrestha, Evelyn Strombome, and Madhu Vermar, 2020,\n“Global Trends in Nature’s Contributions to People”,\n<em>Proceedings of the National Academy of Sciences</em>, 117(51):\n32799–32805. doi:10.1073/pnas.2010473117</li>\n<li>Brennan, Andrew and Yeuk-Sze Lo, 2002 [2016], “Environmental\nEthics”, <em>The Stanford Encyclopedia of Philosophy</em>,\nEdward N. Zalta (ed.),\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/ethics-environmental/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/ethics-environmental/</a>&gt;.</li>\n<li>Burch-Brown, Joanna and Alfred Archer, 2017, “In Defence of\nBiodiversity”, <em>Biology &amp; Philosophy</em>, 32(6):\n969–997. doi:10.1007/s10539-017-9587-x</li>\n<li>Casetta, Elena, Jorge Marques da Silva, and Davide Vecchi (eds.),\n2019, <em>From Assessing to Conserving Biodiversity: Conceptual and\nPractical Challenges</em>, (History, Philosophy and Theory of the Life\nSciences 24), Cham: Springer International Publishing.\ndoi:10.1007/978-3-030-10991-2</li>\n<li>Cavender-Bares, Jeannine, James Heffernan, Elizabeth King, Stephen\nPolasky, Patricia Balvanera, and William C. Clark, 2013,\n“Sustainability and Biodiversity”, in Levin 2013: vol. 7,\npp. 71–84. doi:10.1016/B978-0-12-384719-5.00390-7</li>\n<li>Chan, Kai M.A. and Terre Satterfield, 2013, “Justice, Equity\nand Biodiversity”, in Levin 2013: vol. 4, pp. 434–441.\ndoi:10.1016/B978-0-12-384719-5.00252-5</li>\n<li>CBD, 1992, <em>Convention on biological diversity</em>, United\nNations.\n [<a href=\"https://www.cbd.int/convention/text/\" target=\"other\">CBD 1992 available available online</a>]</li>\n<li>Daily, Gretchen C. (ed.), 1997, <em>Nature’s Services:\nSocietal Dependence on Natural Ecosystems</em>, Washington, DC: Island\nPress.</li>\n<li>Dasgupta, Partha, Ann P. Kinzig, and Charles Perrings, 2013,\n“The Value of Biodiversity”, in Levin 2013: vol. 7, pp.\n167–179. doi:10.1016/B978-0-12-384719-5.00372-5</li>\n<li>Díaz, Sandra, 2019, “Why Care About Nature? a\nPluralistic Agenda for Biodiversity”, in Wyborn, Kalas, and Rust\n2019: 62–65.</li>\n<li>Díaz, Sandra, Andy Hector, and David A Wardle, 2009,\n“Biodiversity in Forest Carbon Sequestration Initiatives: Not\nJust a Side Benefit”, <em>Current Opinion in Environmental\nSustainability</em>, 1(1): 55–60.\ndoi:10.1016/j.cosust.2009.08.001</li>\n<li>Díaz, Sandra, Sebsebe Demissew, Julia Carabias, Carlos\nJoly, Mark Lonsdale, Neville Ash, Anne Larigauderie, Jay Ram Adhikari,\nSalvatore Arico, András Báldi, et al., 2015, “The\nIPBES Conceptual Framework: Connecting Nature and People”,\n<em>Current Opinion in Environmental Sustainability</em>, 14:\n1–16. doi:10.1016/j.cosust.2014.11.002</li>\n<li>Díaz, Sandra, Unai Pascual, Marie Stenseke, Berta\nMartín-López, Robert T. Watson, Zsolt Molnár,\nRosemary Hill, Kai M. A. Chan, Ivar A. Baste, Kate A. Brauman, et al.,\n2018, “Assessing Nature’s Contributions to People”,\n<em>Science</em>, 359(6373): 270–272.\ndoi:10.1126/science.aap8826</li>\n<li>Ehrenfeld, David W., 1970, <em>Biological Conservation</em>, New\nYork: Holt, Rinehart and Winston.</li>\n<li>–––, 1988, “Why Put a Value on\nBiodiversity?”, in Wilson 1988: 212–216.\n [<a href=\"https://nap.nationalacademies.org/read/989/chapter/7#212\" target=\"other\">Ehrenfeld 1988 available online</a>]</li>\n<li>Ehrlich, Paul R. and Anne E. Ehrlich, 1981, <em>Extinction: The\nCauses and Consequences of the Disappearance of Species</em>, New\nYork: Random House.</li>\n<li>–––, 1992, “The Value of\nBiodiversity”, <em>Ambio</em>, 21(3): 219–226.</li>\n<li>Ehrlich, Paul R. and Edward O. Wilson, 1991, “Biodiversity\nStudies: Science and Policy”, <em>Science</em>, 253(5021):\n758–762. doi:10.1126/science.253.5021.758</li>\n<li>Elliot, Kevin C., 2019, “The Values Embedded Within\nScientific Language: How ‘Biodiversity’ Separates Humans\nand Nature”, in Wyborn, Kalas, and Rust 2019: 66–68</li>\n<li>Eser, Uta, Albrecht Müller, Ann-Kathrin Neureuther, and\nHannah Seyfang 2014, <em>Prudence, Justice and the Good Life: A\nTypology of Ethical Reasoning in Selected European National\nBiodiversity Strategies</em>, Bonn: IUCN Publications.</li>\n<li>Faith, Daniel P., 1992, “Conservation Evaluation and\nPhylogenetic Diversity”, <em>Biological Conservation</em>,\n61(1): 1–10. doi:10.1016/0006-3207(92)91201-3</li>\n<li>–––, 1994, “Phylogenetic Pattern and the\nQuantification of Organismal Biodiversity”, <em>Philosophical\nTransactions of the Royal Society of London. Series B: Biological\nSciences</em>, 345(1311): 45–58. doi:10.1098/rstb.1994.0085</li>\n<li>–––, 1995, <em>Biodiversity and Regional\nSustainability Analysis</em>, Canberra, Australia: CSIRO (Commonwealth\nScientific and Industrial Research Organization) Division of Wildlife\nand Ecology.</li>\n<li>–––, 2017, “A General Model for\nBiodiversity and Its Value”, in Garson, Plutynski, and Sarkar\n2017: 69–85.</li>\n<li>–––, 2018a, “Biodiversity’s Option\nValue: A Comment on Maier (2018)”, <em>Ambio</em>, 47(6):\n735–736. doi:10.1007/s13280-018-1069-0</li>\n<li>–––, 2018b, “Avoiding Paradigm Drifts in\nIPBES: Reconciling ‘Nature’s Contributions to\nPeople,’ Biodiversity, and Ecosystem Services”,\n<em>Ecology and Society</em>, 23(2): art40.\ndoi:10.5751/ES-10195-230240</li>\n<li>–––, 2019, “Defending Biodiversity:\nEnvironmental Science and Ethics Jonathan A.Newman, Gary Varner and\nStefan Linquist, 2017 Cambridge and New York: Cambridge University\nPress, Xiv + 441 p.; £36.99 (Pb)”, <em>Journal of Applied\nPhilosophy</em>, 36(4): 688–690. doi:10.1111/japp.12350</li>\n<li>–––, forthcoming, “Valuation and\nAppreciation of Biodiversity: The ‘Maintenance of Options’\nProvided by the Variety of Life”, <em>Frontiers in Ecology and\nEvolution</em>.</li>\n<li>Farnham, Timothy J., 2007, <em>Saving Nature’s Legacy:\nOrigins of the Idea of Biological Diversity</em>, New Haven: Yale\nUniversity Press.</li>\n<li>–––, 2017, “A Confluence of Values:\nHistorical Roots of Concern for Biological Diversity”, in\nGarson, Plutynski, and Sarkar 2017: ch. 1</li>\n<li>Francis, 2015, “Encyclical Letter <em>Laudato Si’</em>\nof the Holy Father Francis: On Care for Our Common Home”, 24 May\n2015, The Vatican.\n [<a href=\"http://www.vatican.va/content/francesco/en/encyclicals/documents/papa-francesco_20150524_enciclica-laudato-si.html\" target=\"other\">Francis 2015 available online</a>]</li>\n<li>Gascon, Claude, Thomas M. Brooks, Topiltzin Contreras-MacBeath,\nNicolas Heard, William Konstant, John Lamoreux, Frederic Launay,\nMichael Maunder, Russell A. Mittermeier, Sanjay Molur, et al., 2015,\n“The Importance and Benefits of Species”, <em>Current\nBiology</em>, 25(10): R431–R438.\ndoi:10.1016/j.cub.2015.03.041</li>\n<li>Garson, Justin, Anya Plutynski, and Sahotra Sarkar (eds.), 2017,\n<em>The Routledge Handbook of Philosophy of Biodiversity</em>, London:\nRoutledge. doi:10.4324/9781315530215</li>\n<li>Gómez-Baggethun, Erik, Rudolf de Groot, Pedro L. Lomas, and\nCarlos Montes, 2010, “The History of Ecosystem Services in\nEconomic Theory and Practice: From Early Notions to Markets and\nPayment Schemes”, <em>Ecological Economics</em>, 69(6):\n1209–1218. doi:10.1016/j.ecolecon.2009.11.007</li>\n<li>Hanley, Nick and Charles Perrings, 2019, “The Economic Value\nof Biodiversity”, <em>Annual Review of Resource Economics</em>,\n11: 355–375. doi:10.1146/annurev-resource-100518-093946</li>\n<li>Haskins, C., 1974, “Scientists Talk of the Need for\nConservation and an Ethic of Biotic Diversity to Slow Species\nExtinction”, <em>Science</em>, 184(4137): 646–647.\ndoi:10.1126/science.184.4137.646</li>\n<li>Hillebrand, Helmut, Bernd Blasius, Elizabeth T. Borer, Jonathan M.\nChase, John A. Downing, Britas Klemens Eriksson, Christopher T.\nFilstrup, W. Stanley Harpole, Dorothee Hodapp, Stefano Larsen, et al.,\n2018, “Biodiversity Change Is Uncoupled from Species Richness\nTrends: Consequences for Conservation and Monitoring”,\n<em>Journal of Applied Ecology</em>, 55(1): 169–184.\ndoi:10.1111/1365-2664.12959</li>\n<li>Himes, Austin and Barbara Muraca, 2018, “Relational Values:\nThe Key to Pluralistic Valuation of Ecosystem Services”,\n<em>Current Opinion in Environmental Sustainability</em>, 35:\n1–7. doi:10.1016/j.cosust.2018.09.005</li>\n<li>Holdren, John P. and Paul R. Ehrlich, 1974, “Human\nPopulation and the Global Environment”, <em>American\nScientist</em>, 62(3): 282–292.</li>\n<li>IPBES, 2018a. <em>Background document: nature’s\ncontributions to people</em>, IPBES consultation and capacity building\nworkshop, 4–6 June 2018. Objective 2: Nature’s\ncontribution to people, Bonn, Germany, 15 pages.</li>\n<li>–––, 2018b, <em>The IPBES Regional Assessment\nReport on Biodiversity and Ecosystem Services for Asia and the\nPacific</em>, Madhav Karki, Sonali Senaratna Sellamuttu, Sana Okayasu,\nWataru Suzuki (eds.), Bonn, Germany: Secretariat of the\nIntergovernmental Science-Policy Platform on Biodiversity and\nEcosystem Services, 612 pages.\n [<a href=\"https://ipbes.net/assessment-reports/asia-pacific\" target=\"other\">IPBES 2018b available online</a>]</li>\n<li>–––, 2018c, <em>The IPBES Regional Assessment\nReport on Biodiversity and Ecosystem Services for Europe and Central\nAsia</em>, Mark Rounsevell, Markus Fischer, Amor Torre-Marin Rando,\nand André Mader (eds.), Bonn, Germany: Secretariat of the\nIntergovernmental Science-Policy Platform on Biodiversity and\nEcosystem Services, 892 pages.\n [<a href=\"https://ipbes.net/assessment-reports/eca\" target=\"other\">IPBES 2018c available online</a>]</li>\n<li>–––, 2019, <em>Summary for Policymakers of the\nGlobal Assessment Report on Biodiversity and Ecosystem Services</em>,\nS. Díaz, J. Settele, E. S. Brondízio, H. T. Ngo, M.\nGuèze, J. Agard, A. Arneth, P. Balvanera, K. A. Brauman, S. H.\nM. Butchart, K. M. A. Chan, L. A. Garibaldi, K. Ichii J. Liu, S. M.\nSubramanian, G. F. Midgley, P. Miloslavich, Z. Molnár, D.\nObura, A. Pfaff, S. Polasky, A. Purvis, J. Razzaque, B. Reyers, R. Roy\nChowdhury, Y. J. Shin, I. J. Visseren-Hamakers, K. J. Willis, and C.\nN. Zayas (eds.), Bonn, Germany: IPBES Secretariat.\ndoi:10.5281/zenodo.3553579</li>\n<li>Iltis, Hugh H., 1972, “Shepherds Leading Sheep to Slaughter:\nThe Extinction of Species and the Destruction of Ecosystems”,\n<em>The American Biology Teacher</em>, 34(4): 201–221.\ndoi:10.2307/4443886</li>\n<li>IUCN, 1980, <em>World Conservation Strategy: living resource\nconservation for sustainable development</em>, International Union for\nConservation of Nature and Natural Resources (IUCN).\n [<a href=\"https://portals.iucn.org/library/efiles/documents/wcs-004.pdf\" target=\"other\">IUCN 1980 available online (pdf)</a>]</li>\n<li>Jetzkowitz, Jens, C.S.A. (Kris) van Koppen, Rolf Lidskog, Konrad\nOtt, Lieske Voget-Kleschin, and Catherine Mei Ling Wong, 2018,\n“The Significance of Meaning. Why IPBES Needs the Social\nSciences and Humanities”, <em>Innovation: The European Journal\nof Social Science Research</em>, 31(sup1): S38–S60.\ndoi:10.1080/13511610.2017.1348933</li>\n<li>Josephson, Julian, 1982, “Why Maintain Biological\nDiversity?”, <em>Environmental Science &amp; Technology</em>,\n16(2): 94A-97A. doi:10.1021/es00096a717</li>\n<li>Justus, James, Mark Colyvan, Helen Regan, and Lynn Maguire, 2009,\n“Buying into Conservation: Intrinsic versus Instrumental\nValue”, <em>Trends in Ecology &amp; Evolution</em>, 24(4):\n187–191. doi:10.1016/j.tree.2008.11.011</li>\n<li>Kirkpatrick, J.B., 1983, “An Iterative Method for\nEstablishing Priorities for the Selection of Nature Reserves: An\nExample from Tasmania”, <em>Biological Conservation</em>, 25(2):\n127–134. doi:10.1016/0006-3207(83)90056-3</li>\n<li>Koricheva, Julia and Helena Siipi, 2004, “The Phenomenon of\nBiodiversity”, in Oksanen and Pietarinen 2004: 27–53.\ndoi:10.1017/CBO9780511498527.002</li>\n<li>Lean, Christopher Hunter, 2017, “Biodiversity Realism:\nPreserving the Tree of Life”, <em>Biology &amp; Philosophy</em>,\n32(6): 1083–1103. doi:10.1007/s10539-017-9592-0</li>\n<li>Lele, Sharachchandra, Eduardo S. Brondizio, John Byrne, Georgina\nM. Mace, and Joan Martinez-Alier (eds.), 2018a, <em>Rethinking\nEnvironmentalism: Linking Justice, Sustainability, and Diversity</em>\n(Strüngmann Forum Reports, 23), Cambridge, MA: MIT Press.</li>\n<li>–––, 2018b, “Framing the\nEnvironment”, in Lele et al. 2018a: 1–19.</li>\n<li>Levin, Simon A., 2013, <em>Encyclopedia of Biodiversity</em>,\nsecond edition, 7 volumes, Cambridge, MA: Academic Press.</li>\n<li>Lovejoy, T. E., 1980, “Changes in Biological\nDiversity”, in <em>The Global 2000 Report to The President</em>\n(Volume 2: The Technical Report), Gerald O. Barney (ed.),\nHarmondsworth: Penguin Books, pp. 327–332.</li>\n<li>MacArthur, Roberrt H., 1972, “Coexistence of Species”,\nin <em>Challenging Biological Problems: Directions Toward Their\nSolution</em>, John A. Behnke (ed.), New York: Oxford University\nPress, pp. 253–259.</li>\n<li>Mace, Georgina M., 2014, “Whose Conservation?”,\n<em>Science</em>, 345(6204): 1558–1560.\ndoi:10.1126/science.1254704</li>\n<li>–––, 2019, “Where to Next for Biodiversity\nScience?”, in Wyborn, Kalas, and Rust 2019: 105–108.</li>\n<li>Mace, Georgina M., Ken Norris, and Alastair H. Fitter, 2012,\n“Biodiversity and Ecosystem Services: A Multilayered\nRelationship”, <em>Trends in Ecology &amp; Evolution</em>,\n27(1): 19–26. doi:10.1016/j.tree.2011.08.006</li>\n<li>Mace, Georgina M., Mike Barrett, Neil D. Burgess, Sarah E.\nCornell, Robin Freeman, Monique Grooten, and Andy Purvis, 2018,\n“Aiming Higher to Bend the Curve of Biodiversity Loss”,\n<em>Nature Sustainability</em>, 1(9): 448–451.\ndoi:10.1038/s41893-018-0130-0</li>\n<li>Maclaurin, James and Kim Sterelny, 2008, <em>What is\nBiodiversity?</em>, Chicago: University of Chicago Press.</li>\n<li>Maier, Donald S., 2012, <em>What’s So Good About\nBiodiversity?</em>, (The International Library of Environmental,\nAgricultural and Food Ethics, 19), Dordrecht: Springer Netherlands.\ndoi:10.1007/978-94-007-3991-8</li>\n<li>–––, 2018, “Should Biodiversity and Nature\nHave to Earn Their Keep? What It Really Means to Bring Environmental\nGoods into the Marketplace”, <em>Ambio</em>, 47(4):\n477–492. doi:10.1007/s13280-017-0996-5</li>\n<li>Malaterre, Christophe, 2017, “Going Small: The Challenges of\nMicrobial Biodiversity”, in Garson, Plutynski, and Sarkar 2017:\nch. 10.</li>\n<li>Martin, Adrian, Shawn McGuire, and Sian Sullivan, 2013,\n“Global Environmental Justice and Biodiversity Conservation:\nGlobal Environmental Justice and Biodiversity Conservation”,\n<em>The Geographical Journal</em>, 179(2): 122–131.\ndoi:10.1111/geoj.12018</li>\n<li>Matthiessen, Peter, 1959 [1987], <em>Wildlife in America</em>. New\nYork: Viking. Updated edition, New York: Viking, 1987.</li>\n<li>Mazur, Allan and Jinling Lee, 1993, “Sounding the Global\nAlarm: Environmental Issues in the US National News”, <em>Social\nStudies of Science</em>, 23(4): 681–720.\ndoi:10.1177/030631293023004003</li>\n<li>McNeely, Jeffrey A., 1988, <em>Economics and Biological Diversity:\nDeveloping and Using Economic Incentives to Conserve Biological\nResources</em>, Gland, Switzerland: IUCN.</li>\n<li>McShane, Katie, 2017, “Is Biodiversity Intrinsically\nValuable? (And What Might that Mean?)”, in Garson, Plutynski,\nand Sarkar 2017: 410–443.</li>\n<li>Millennium Ecosystem Assessment, 2005, <em>Ecosystems and Human\nWell-Being: Biodiversity Synthesis</em>, Washington, DC: World\nResources Institute. Ecosystem Assessment, 2005.\n [<a href=\"https://www.millenniumassessment.org/documents/document.354.aspx.pdf\" target=\"other\"> (PDF)</a>]</li>\n<li>Meinard, Yves, Sylvain Coq, and Bernhard Schmid, 2019, “The\nVagueness of ‘Biodiversity’ and Its Implications in\nConservation Practice”, in Casetta, da Silva, and Vecchi 2019:\n353–374. doi:10.1007/978-3-030-10991-2_17</li>\n<li>Meine, Curt, Michael Soule, and Reed F. Noss, 2006,\n“‘A Mission-Driven Discipline’: The Growth of\nConservation Biology”, <em>Conservation Biology</em>, 20(3):\n631–651. doi:10.1111/j.1523-1739.2006.00449.x</li>\n<li>Morar, Nicolae, Ted Toadvine, and Brendan J. M. Bohannan, 2015,\n“Biodiversity at Twenty-Five Years: Revolution Or Red\nHerring?”, <em>Ethics, Policy &amp; Environment</em>, 18(1):\n16–29. doi:10.1080/21550085.2015.1018380</li>\n<li>Morgan, Gregory J., 2009, “The Many Dimensions of\nBiodiversity”, <em>Studies in History and Philosophy of Science\nPart C: Studies in History and Philosophy of Biological and Biomedical\nSciences</em>, 40(3): 235–238.\ndoi:10.1016/j.shpsc.2009.06.001</li>\n<li>Myers, Norman, 1976, “An Expanded Approach to the Problem of\nDisappearing Species”, <em>Science</em>, 193(4249):\n198–202. doi:10.1126/science.193.4249.198</li>\n<li>–––, 1979, <em>The Sinking Ark: A New Look at\nthe Problem of Disappearing Species</em>, New York: Pergamon\nPress.</li>\n<li>Myers, Norman and Edward S. Ayensu, 1983, “Reduction of\nBiological Diversity and Species Loss”, <em>Ambio</em>, 12(2):\n72–74.</li>\n<li>Newman, Jonathan A., Gary Varner, and Stefan Linquist, 2017,\n<em>Defending Biodiversity: Environmental Science and Ethics</em>,\nCambridge: Cambridge University Press. doi:10.1017/9781139024105</li>\n<li>Norman, Colin, 1981, “The Threat to One Million\nSpecies”, <em>Science</em>, 214(4525): 1105–1107.\ndoi:10.1126/science.214.4525.1105</li>\n<li>Norton, Bryan G. (ed), 1986, <em>The Preservation of Species: The\nValue of Biological Diversity</em>, Princeton: Princeton University\nPress.</li>\n<li>–––, 2001, “Conservation Biology and\nEnvironmental Values: Can There be a Universal Earth Ethic?” in\n<em>Protecting Biological Diversity: Roles and Responsibilities</em>,\nCatherine Potvin, Margaret Kraenzel, and Gilles Seutin (eds.),\nMontreal: McGill-Queen’s University Press, pp.\n71–102.</li>\n<li>–––, 2008, “Toward a Policy-Relevant\nDefinition of Biodiversity”, in <em>Saving Biological Diversity:\nBalancing Protection of Endangered Species and Ecosystems</em>, Robert\nA. Askins, Glenn D. Dreyer, Gerald R. Visgilio, and Diana M. Whitelaw\n(eds.), Boston, MA: Springer, pp. 11–20.\ndoi:10.1007/978-0-387-09565-3_2</li>\n<li>–––, 2015, <em>Sustainable Values, Sustainable\nChange: a Guide to Environmental Decision Making</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Noss, Reed F., 1990, “Indicators for Monitoring\nBiodiversity: A Hierarchical Approach”, <em>Conservation\nBiology</em>, 4(4): 355–364.\ndoi:10.1111/j.1523-1739.1990.tb00309.x</li>\n<li>Odenbaugh, Jay, 2016 [2019], “Conservation Biology”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Fall 2019 Edition),\nEdward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/conservation-biology/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/conservation-biology/</a>&gt;.</li>\n<li>Oksanen, Markku, 1997, “The Moral Value of\nBiodiversity”, <em>Ambio</em>, 26(8): 541–545.</li>\n<li>–––, 2004, “Biodiversity Considered\nPhilosophically: An Introduction”, in Oksanen and Pietarinen\n2004: 1–24. doi:10.1017/CBO9780511498527.001</li>\n<li>Oksanen, Markku and Juhani Pietarinen (eds.), 2004, <em>Philosophy\nand Biodiversity</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498527</li>\n<li>Pascual, Unai, 2019, “Why Do We Need a More Pluralistic\nApproach to Valuing Biodiversity?” in Wyborn, Kalas, and Rust\n2019: 126–130</li>\n<li>Peterson, Garry D., Zuzana V. Harmáčková, Megan\nMeacham, Cibele Queiroz, Amanda Jiménez-Aceituno, Jan J.\nKuiper, Katja Malmborg, Nadia Sitas, and Elena M. Bennett, 2018,\n“Welcoming Different Perspectives in IPBES:\n‘Nature’s Contributions to People’ and\n‘Ecosystem Services’”, <em>Ecology and Society</em>,\n23(1): art39. doi:10.5751/ES-10134-230139</li>\n<li>Reid, Walter V. and Kenton R. Miller, 1989, <em>Keeping Options\nAlive: The Scientific Basis for Conserving Biological Diversity</em>,\nWashington, DC: World Resources Institute.\n [<a href=\"https://www.wri.org/publication/keeping-options-alive\" target=\"other\">Reid and Miller 1989 available online</a>]</li>\n<li>Redford, Kent H. and Georgina M. Mace, 2018, “Conserving and\nContesting Biodiversity in the Homogocene”, in Lele et al.\n2018a: 23–40.</li>\n<li>Reyers, Belinda, Stephen Polasky, Heather Tallis, Harold A.\nMooney, and Anne Larigauderie, 2012, “Finding Common Ground for\nBiodiversity and Ecosystem Services”, <em>BioScience</em>,\n62(5): 503–507. doi:10.1525/bio.2012.62.5.12</li>\n<li>Roush, G. Jon, 1977, “Why Save Diversity?” <em>Nature\nConservancy News</em>, 21(1): 9–12.</li>\n<li>Santana, Carlos, 2014, “Save the Planet: Eliminate\nBiodiversity”, <em>Biology &amp; Philosophy</em>, 29(6):\n761–780. doi:10.1007/s10539-014-9426-2</li>\n<li>–––, 2018, “Biodiversity Is a Chimera, and\nChimeras Aren’t Real”, <em>Biology &amp; Philosophy</em>,\n33(1–2): art. 15. doi:10.1007/s10539-018-9626-2</li>\n<li>Sarkar, Sahotra, 2002, “Defining ‘Biodiversity’;\nAssessing Biodiversity”, <em>Monist</em>, 85(1): 131–155.\ndoi:10.5840/monist20028515</li>\n<li>–––, 2005, <em>Biodiversity and Environmental\nPhilosophy: An Introduction</em>, (Cambridge Studies in Philosophy and\nBiology), Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498558</li>\n<li>–––, 2012, <em>Environmental Philosophy: from\nTheory to Practice</em>, Chichester, England: John Wiley &amp;\nSons.</li>\n<li>–––, 2014, “Biodiversity and Systematic\nConservation Planning for the Twenty-First Century: A Philosophical\nPerspective”, <em>Conservation Science</em>, 2(1): 1–11.\ndoi:10.3126/cs.v2i1.13765</li>\n<li>–––, 2006 [2016], “Ecology”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2016 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/ecology/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/ecology/</a>&gt;.</li>\n<li>–––, 2017, <em>Approaches to Biodiversity</em>,\nin Garson, Plutynski, and Sarkar 2017: ch. 3.</li>\n<li>–––, 2019, “What Should\n‘Biodiversity’ Be?”, in Casetta, da Silva, and\nVecchi 2019: 375–399. doi:10.1007/978-3-030-10991-2_18</li>\n<li>Sarkar, Sahotra and Chris Margules, 2002, “Operationalizing\nBiodiversity for Conservation Planning”, <em>Journal of\nBiosciences</em>, 27(4): 299–308. doi:10.1007/BF02704961</li>\n<li>Schroeder Doris and Balakrishna Pisupati, 2010, “Ethics,\nJustice and the Convention on Biological Diversity”, United\nNations Environmental Program (UNEP).\n [<a href=\"https://www.unep.org/resources/report/ethics-justice-and-convention-biological-diversity\" target=\"other\">Schroeder and Pisupati 2010 available online</a>]</li>\n<li>Seddon, Nathalie, Georgina M. Mace, Shahid Naeem, Joseph A.\nTobias, Alex L. Pigot, Rachel Cavanagh, David Mouillot, James Vause,\nand Matt Walpole, 2016, “Biodiversity in the Anthropocene:\nProspects and Policy”, <em>Proceedings of the Royal Society B:\nBiological Sciences</em>, 283(1844): 20162094.\ndoi:10.1098/rspb.2016.2094</li>\n<li>Swingland, Ian R., 2013, “Biodiversity, Definition\nOf”, in Levin 2013: vol. 1, pp. 399–410.\ndoi:10.1016/B978-0-12-384719-5.00009-5</li>\n<li>WCED (World Commission on Environment and Development), 1987,\n<em>Our Common Future</em>, Oxford: Oxford University Press.</li>\n<li>Weikard, Hans-Peter, 2002, “Diversity Functions and the\nValue of Biodiversity”, <em>Land Economics</em>, 78(1):\n20–27. doi:10.2307/3146920</li>\n<li>Weitzman, Martin L., 1992, “On Diversity”, <em>The\nQuarterly Journal of Economics</em>, 107(2): 363–405.\ndoi:10.2307/2118476</li>\n<li>Westman, Walter E., 1977, “How Much Are Nature’s\nServices Worth?”, <em>Science</em>, 197(4307): 960–964.\ndoi:10.1126/science.197.4307.960</li>\n<li>Wilson, Edward O., 1984, “Million-Year Histories: Species\nDiversity as an Ethical Goal”, <em>Wilderness</em>, 47 (Summer):\n12–17.</li>\n<li>–––, 1985, “The Biological Diversity\nCrisis”, <em>BioScience</em>, 35(11): 700–706.\ndoi:10.2307/1310051</li>\n<li>––– (ed.), 1988, <em>Biodiversity</em>,\nWashington, DC: National Academies Press. doi:10.17226/989</li>\n<li>Wyborn, Carina, Nicole Kalas, and Niki A. Rust, 2019, <em>Seeds of\nChange: Provocations for a New Research Agenda</em>, Biodiversity\nRevisited Symposium Conference Proceedings, 11–13 September\n2019, Vienna, Austria. doi:10.13140/RG.2.2.22170.59848/3</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "conservation biology",
            "ecology",
            "ethics: environmental"
        ],
        "entry_link": [
            {
                "../conservation-biology/": "conservation biology"
            },
            {
                "../ecology/": "ecology"
            },
            {
                "../ethics-environmental/": "ethics: environmental"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=biodiversity\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/biodiversity/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=biodiversity&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/biodiversity/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=biodiversity": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/biodiversity/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=biodiversity&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/biodiversity/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://ipbes.net/glossary/biodiversity\" target=\"other\">Biodiversity</a>,\n definition in the Glossary at the U.N./IPBES (Intergovernmental\nScience-Policy Platform on Biodiversity and Ecosystem Services).",
            "<a href=\"https://www.edgeofexistence.org/\" target=\"other\">EDGE of Existence</a>,\n program at the Zoological Society of London.",
            "<a href=\"https://danielpfaith.wordpress.com/phylogenetic-diversity/phylogenetic-diversity-and-ipbes/\" target=\"other\">Phylogenetic diversity and IPBES</a>\n by Dan Faith.",
            "<a href=\"https://danielpfaith.wordpress.com/phylogenetic-diversity-and-human-health/\" target=\"other\">Phylogenetic Diversity and Human Health</a>,\n by Dan Faith."
        ],
        "listed_links": [
            {
                "https://ipbes.net/glossary/biodiversity": "Biodiversity"
            },
            {
                "https://www.edgeofexistence.org/": "EDGE of Existence"
            },
            {
                "https://danielpfaith.wordpress.com/phylogenetic-diversity/phylogenetic-diversity-and-ipbes/": "Phylogenetic diversity and IPBES"
            },
            {
                "https://danielpfaith.wordpress.com/phylogenetic-diversity-and-human-health/": "Phylogenetic Diversity and Human Health"
            }
        ]
    }
}