{
    "url": "biology-philosophy",
    "title": "Philosophy of Biology",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Jay Odenbaugh\n<jay@lclark.edu>\nPaul Griffiths",
        "author_links": [
            {
                "http://jay-odenbaugh.squarespace.com/": "Jay Odenbaugh"
            },
            {
                "mailto:jay%40lclark%2eedu": "jay@lclark.edu"
            },
            {
                "http://griffithslab.org/": "Paul Griffiths"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://jay-odenbaugh.squarespace.com/\" target=\"other\">Jay Odenbaugh</a>\n&lt;<a href=\"mailto:jay%40lclark%2eedu\"><em>jay<abbr title=\" at \">@</abbr>lclark<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"http://griffithslab.org/\" target=\"other\">Paul Griffiths</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Jul 4, 2008",
        "substantive revision Mon Jun 1, 2020"
    ],
    "preamble": "\n\nThe growth of philosophical interest in biology over the past forty\nyears reflects the increasing prominence of the biological sciences in\nthe same period. There is now an extensive literature on many\ndifferent biological topics, and it would be impossible to summarise\nthis body of work in this single entry. Instead, this entry sets out\nto explain what philosophy of biology is. Why does biology\nmatter to philosophy and vice versa? A list of the entries in the\nencyclopedia which address specific topics in the philosophy of\nbiology is provided at the end of the entry.\n\nThree different kinds of philosophical inquiry fall under the general\nheading of philosophy of biology. First, general theses in the\nphilosophy of science are addressed in the context of biology. Second,\nconceptual problems within biology itself are subjected to\nphilosophical analysis. Third, appeals to biology are made in\ndiscussions of traditional philosophical questions. \n\nPhilosophy of biology can also be subdivided by the particular areas\nof the life sciences with which it is concerned. Biology is an\nextremely diverse set of disciplines, ranging from historical sciences\nsuch as paleontology to engineering sciences such as biotechnology.\nDifferent philosophical issues occur in each field. The latter part of\nthe entry discusses how philosophers have approached some of the main\ndisciplines within biology.\n",
    "toc": [
        {
            "#PreHistPhilBiol": "1. Pre-history of Philosophy of Biology"
        },
        {
            "#ThreTypePhilBiol": "2. Three Types of Philosophy of Biology"
        },
        {
            "#PhilEvolBiol": "3. Philosophy of Evolutionary Biology"
        },
        {
            "#PhilSystBiol": "4. Philosophy of Systematic Biology"
        },
        {
            "#PhilMoleBiol": "5. Philosophy of Molecular Biology"
        },
        {
            "#PhilDeveBiol": "6. Philosophy of Developmental Biology"
        },
        {
            "#PhilEcolConsBiol": "7. Philosophy of Ecology and Conservation Biology"
        },
        {
            "#MethPhilBiolFutuDire": "8. Methodology in Philosophy of Biology and Future Directions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Pre-history of Philosophy of Biology\n\nAs is the case for most apparent novelties, closer inspection reveals\na pre-history for the philosophy of biology (Grene & Depew 2004).\nIn the 1950s the biologist J. H. Woodger and the philosopher Morton\nBeckner both published major works on the philosophy of biology\n(Woodger 1952; Beckner 1959), but these did not give rise to a\nsubsequent philosophical literature (though see Ruse 1988). Some\nphilosophers of science also made claims about biology based on\ngeneral epistemological and metaphysical considerations. One of the\nmost famous examples is J. J. C. Smart’s claim that the biology\nis not an autonomous science, but a technological application of more\nbasic sciences, like “radio-engineering” (Smart 1959,\n366). Like engineering, biology cannot make any addition to the laws\nof nature. It can only reveal how the laws of physics and chemistry\nplay out in the context of particular sorts of initial and boundary\nconditions (for more recent discussions of biological laws, see Beatty\n1995; Brandon 1997; Mitchell 1997; Sober 1997; Waters 1998). Even in\n1969 the zoologist Ernst Mayr could complain that books with\n‘philosophy of science’ in the title were all misleading\nand should be re-titled ‘philosophy of physics’ (Mayr\n1969). It is worth noting however that philosophers of science such as\nCarl G. Hempel (1965) and Ernest Nagel (1961) offered accounts of\nfunctional explanation as found in the biological sciences. The\nencouragement of prominent biologists such as Mayr and F. J. Ayala\n(Ayala 1976; Mayr 1982) was one factor in the emergence of the new\nfield. Another factor was that several philosophers of science\nincluding Robert Brandon, Phillip Kitcher, Elisabeth Lloyd, Sahotra\nSarkar, Elliott Sober, and William C. Wimsatt did research at Harvard\nUniversity with the likes of Stephen Jay Gould, Richard Lewontin, and\nRichard Levins (Callebaut 1993). The first sign of philosophy of\nbiology becoming a mainstream part of philosophy of science was the\npublication of David Hull’s Philosophy of Biological\nScience in the prominent Prentice-Hall Foundations of Philosophy\nseries (Hull 1974). From then on the field developed rapidly. Robert\nBrandon could say of the late 1970’s that “I knew five\nphilosophers of biology: Marjorie Grene, David Hull, Michael Ruse,\nMary Williams and William Wimsatt.” (Brandon 1996,\nxii–xiii) By 1986, however, there were more than enough to fill\nthe pages of Michael Ruse’s new journal Biology and\nPhilosophy. This trend has only increased with the introduction\nof additional journals such as Biological Theory,\nPhilosophy and Practice of Biology, History and\nPhilosophy of the Life Sciences, and Studies in History and\nPhilosophy of Biological and Biomedical Sciences. \n2. Three Types of Philosophy of Biology\n\nThree different kinds of philosophical inquiry fall under the general\nheading of philosophy of biology. First, general theses in the\nphilosophy of science are addressed in the context of biology. Second,\nconceptual (or theoretical) problems within biology itself are\nsubjected to philosophical analysis. Third, appeals to biology are\nmade in discussions of traditional philosophical questions. The first\nmajor debate in the philosophy of biology exemplified the first of\nthese, the use of genetics to explore reductionism and\nanti-reductionism in the philosophy of science. Kenneth F. Schaffner\napplied the logical empiricist model of theory reduction to the\nrelationship between classical, Mendelian genetics and molecular\ngenetics (Schaffner 1967a; Schaffner 1967b; Schaffner 1969). David\nHull argued that the lesson of this attempt was that Mendelian\ngenetics is irreducible to molecular genetics (Hull 1974; Hull 1975).\nThis debate reinforced the near-consensus in the 1970s and 1980s that\nthe special sciences are autonomous from the more fundamental sciences\n(Fodor 1974; Kitcher 1984). However, the apparent absurdity of the\nclaim that the molecular revolution in biology was not a successful\ninstance of scientific reduction also led the formulation of\nincreasingly more adequate models of theory reduction (Wimsatt 1976;\nWimsatt 1980; Schaffner 1993; Waters 1994; Rosenberg 1997; Sarkar\n1998). \n\nIn another important early debate philosophers set out to solve a\nconceptual problem within biology itself. The concept of reproductive\nfitness is at the heart of evolutionary theory, but its status has\nalways been problematic. It has proved surprisingly hard for\nbiologists to avoid the criticism that, “[i]f we try to make\nlaws of evolution in the strict sense we seem to reduce to\ntautologies. Thus suppose we say that even in Andromeda ‘the\nfittest will survive’ we say nothing, for ‘fittest’\nhas to be defined in terms of ‘survival’” (Smart\n1959, 366). This came to be know as the “tautology\nproblem”. Alexander Rosenberg and Mary B. Williams argued that\nfitness is an irreducible primitive which derives its meaning from its\nplace in an axiomatic formulation of evolutionary theory (Rosenberg\n1983; Sober 1984a; Williams and Rosenberg 1985). If correct, this\nwould solve the tautology problem since axioms are often thought of as\ntautologous. In the 1970’s the new generation of philosophers of\nbiology offered a different solution to the tautology problem in two\nsteps. First, they began by arguing that fitness is a supervenient\nproperty of organisms: the fitness of each particular organism is\nnecessarily dependent on some specific set of physical characteristics\nof the organism and its particular environment, but two organisms that\nhave the same fitness may do so in virtue very different sets of\nphysical characteristics (Rosenberg 1978). Second, they argued that\nthis supervenient property is a propensity – which is a\nprobabilistic disposition represented by a probability distribution\nover possible numbers of offspring (Mills and Beatty 1979). Although\nfitness is defined in terms of reproductive success, it is not a\ntautology that the fittest organisms have the most offspring, any more\nthan it is a tautology that dice produce even numbers more often than\nthey produce sixes. The propensities of fit organisms to survive and\nof dice to fall equally often on each side both allow us to make\nfallible predictions about what will happen, predictions that become\nmore reliable as the size of the sample increases. It remains unclear,\nhowever, whether it is possible to specify a probability distribution\nor set of distributions that can play all the roles actually played by\nfitness in population biology (Beatty & Finsen 1989, Sober 2001;\nPence & Ramsey 2013).\n\nThe phrase ‘conceptual problems’ should be understood very\nbroadly. The conceptual work done by philosophers of biology in many\ncases merges smoothly into theoretical biology. It also sometimes\nleads philosophers to examine and criticize the chains of argument\nconstructed by biologists, and thus to enter directly into ongoing\nbiological debates. In the same way, the first kind of philosophy of\nbiology we have described – the use of biological examples to work\nthrough general issues in the philosophy of science – sometimes\nfeeds back into biology itself through specific recommendations for\nimproving biological methodology. It is a striking feature of the\nphilosophy of biology literature that philosophers often publish in\nbiology journals and that biologists often contribute to philosophy of\nbiology journals. The philosophy of biology also has a potentially\nimportant role as a mediator between biology and society. Popular\nrepresentations of biology derive broad lessons from large swathes of\nexperimental findings and theoretical work. Philosophers of science\nhave an obvious role in evaluating these interpretations of the\nsignificance of specific biological findings (Stotz and Griffiths\n2008). As two important examples, philosophers of biology have\nprovided a great deal of clarity regarding creationism/intelligent\ndesign (Kitcher 1982; Ruse 1982; Pennock 2000; Sarkar 2007) and\nsociobiology/evolutionary psychology (Kitcher 1985; Buller 2006;\nRichardson 2010; Barker 2015). \n\nA third form of philosophy of biology occurs when philosophers appeal\nto biology to support positions on traditional philosophical topics,\nsuch as ethics or epistemology. The extensive literature on biological\nteleology is a case in point. After a brief flurry of interest in the\nwake of the “modern synthesis”, during which the term\n‘teleonomy’ was introduced to denote the specifically\nevolutionary interpretation of teleological language (Pittendrigh\n1958), the ideas of function and goal directedness came to be regarded\nas relatively unproblematic by evolutionary biologists. In the 1970s,\nhowever, philosophers started to look to biology to provide a solid,\nscientific basis for normative concepts, such as illness, disorder, or\nmalfunction (Wimsatt 1972; Wright 1973; Boorse 1976). Eventually, the\nphilosophical debate produced an analysis of teleological language\nfundamentally similar to the view associated with modern synthesis\n(Millikan 1984; Neander 1991; Godfrey-Smith 1994). According to the\n“selected effects” theory of function, the functions of a\ntrait are those activities in virtue of which the trait was selected.\nThe idea of proper function has become part of the conceptual\ntoolkit of philosophy in general and of the philosophy of language and\nthe philosophy of mind in particular (Dretske 1991, 1997; Millikan\n1995, 2004, 2005; Papineau 1987, 1993; Neander 2017; Garson 2019).\n3. Philosophy of Evolutionary Biology\n\nPhilosophy of biology can also be subdivided by the particular areas\nof biology with which it is concerned. Until recently, evolutionary\nbiology has attracted the lion’s share of philosophical attention.\nThis work has sometimes been designed to support a general thesis in\nthe philosophy of science, such as the “semantic view” or\nmodel-based view of theories (Beatty 1980; Lloyd 1988; Thompson 1988).\nBut most of this work is concerned with conceptual problems that arise\ninside the theory itself, and the work often resembles theoretical\nbiology as much as pure philosophy of science. For example, Elliott\nSober’s classic study The Nature of Selection: Evolutionary Theory\nin Philosophical Focus (Sober 1984b) marks the point at which\nmany philosophers became aware of the philosophy of biology. Sober\nanalyzed the structure of population genetics via an analogy with\nNewtonian mechanics and the composition of forces, treating the actual\nchange in gene frequencies over time as the result of several\ndifferent “forces”, such as selection, random genetic\ndrift, mutation, and migration. Several philosophers of biology have\nchallenged this interpretation of evolutionary theory in favor of a\n“statistical” approach (Sterelny & Kitcher 1988;\nMatthen and Ariew 2002; Walsh, Lewens, and Ariew 2002), and this\ndebate continues. Another instance of a conceptual problem in\nevolutionary theory concerns the nature of random genetic drift. How\nare selection and drift distinct (Beatty 1987)? We typically think of\ndrift occurring when there is random fluctuation of gene frequencies,\nbut selection in a changing environment can produce the very same\npattern. Thus, some philosophers of biology have argued we must\ndistinguish selection and drift as processes rather than just as\npatterns. One way to do this is through a distinction between\nindiscriminate and discriminate sampling processes (Millstein 2002;\nBrandon 2005; Millstein 2005). The question becomes whether the trait\nof interest is causally irrelevant or relevant to changes in gene\nfrequencies. These examples of careful, methodological analysis of\npopulation genetics, the mathematical core of traditional evolutionary\ntheory, continue to give rise to interesting results (Pigliucci and\nKaplan 2006; Plutynski 2006; Okasha 2007; Sarkar 2011).\n\nThe intense philosophical interest in evolutionary theory in the\n1980’s can partly be explained by two controversies\n(Segerstråle 2000). First, there was a controversy over\n“sociobiology” that was provoked by the publications of\nE.O. Wilson’s eponymous textbook (Wilson 1975) and his Pulitzer\nprize winning popular book (Wilson 1978). One extremely important\ncritique of this application of evolutionary biology to human social\nbehavior came from Stephen Jay Gould and Richard Lewontin (Gould and\nLewontin 1979). The debates over adaptationism turned out to involve a\ndiffuse set of worries about whether evolution produces adaptations,\nthe role of optimality models, and the methodology of evolutionary\ntheory (Amundson 1994; Orzack and Sober 1994; Brandon and Rausher\n1996; Godfrey-Smith 2001; Millstein 2007; Forber 2009; Potochnik 2009;\nLloyd 2015). Philosophical work has helped to distinguish these\nstrands in the debate and reduce the confusion seen in the heated and\npolemical biological literature for and against adaptationism (Orzack\nand Sober 2001). Second, there was the appearance of George\nWilliams’ Adaptation and Natural Selection (Williams\n1966) and Richard Dawkins’ The Selfish Gene (Dawkins\n1976). They claim that the unit of selection is the individual\nMendelian allele rather than the organism, group of organisms, or\nspecies. This created an explosion of early philosophical work on the\n“units of selection” question (Brandon and Burian 1984).\nThe early debates concerned whether there was a determinate unit of\nselection and what criteria should be used for determining what it is\nin a given case (Hull 1980; Wimsatt 1980a, 1980b; Brandon 1982; Sober\n& Lewontin 1984; Lloyd 1988; Sterelny & Kitcher 1988). As\nmulti-level selection models and the Price equation appeared, close\nattention turned to how those models should be interpreted\n(Godfrey-Smith & Lewontin 1993; Godfrey-Smith & Kerr 2002;\nLloyd 2005; Waters 2005; Okasha 2006; Birch 2017). For example, for\nany group selection model, is there an empirically equivalent\nindividual selection model (similarly for genotypic and genic models)?\nIf so, do they represent the very same causal structure? Is kin\nselection a form of group selection? Arguably, philosophers made a\nsignificant contribution to the rehabilitation of some forms of\n“group selection” within evolutionary biology in the\n1990s, following two decades of neglect or contempt (Sober and Wilson\n1998).\n4. Philosophy of Systematic Biology\n\nPhilosophical discussion of systematics was a response to a\n“scientific revolution” in that discipline in the 1960s\nand 1970s. This revolution saw the discipline transformed from\nphenetics and evolutionary taxonomy alongside the application of\nquantitative methods. The successor was the “cladistic”\napproach due to Willi Hennig (1966), which argues that the sole aim of\nsystematics should be to represent “natural” groups of\norganisms. Cladists took natural groups to be monophyletic groups\n(where a monophyletic group includes an ancestor species and all of\nits descendant species). Thus, a cladistic approach only represents\nphylogeny, which is the pattern of common descent. Philosopher David L.\nHull was an active participant in scientific debates throughout these\ntwo revolutions; in fact, he was president of the Society of\nSystematic Zoology in 1984–1985 and of the Philosophy of Science\nAssociation in 1985–1986 (Hull 1965; Hull 1970; Hull 1988; Sober\n1988). Additionally, a great deal of conceptual work appeared on the\nnature of phylogenetic inference. Phylogenies are commonly represented\nwith phylogenetic trees. Discovering phylogenies presents the familiar\nproblem of underdetermination of theory by evidence. For example, if\nwe have four taxa, there are fifteen possible rooted trees. However,\nonly one of those trees corresponds to the actual historical lineage.\nAdditionally, the phylogeny of given taxa cannot be directly observed,\nand so must be inferred. Thus, the problem of phylogenetic inference\nis how to justify such historical hypotheses. The original\nphylogenetic method of choice was parsimony, which says to choose the\ntree which proposes the fewest evolutionary events. Some phylogenetic\nsystematists argued for this approach using Sir Karl Popper’s\nfalsificationism (Wiley 1975, Farris 1983). In the 1970’s,\nJoseph Felsenstein demonstrated that lineages with a certain topology\nwere subject to a systematic error in parsimony analysis (Felsenstein\n1978, 2004). This is the problem of “long-branch\nattraction” in which taxa at the end of long branches are\nmistakenly grouped together by parsimony analysis, instead of with\ntaxa with which they share a more recent common ancestor (Haber 2008).\nFelsenstein proposed using statistical techniques (in particular\nmaximum likelihood methods) to avoid this problem. Debates between the\ncamps continue (Sober 2004). \n\nThe biologist Michael Ghiselin piqued the interest of philosophers\nwhen he suggested that systematics was fundamentally mistaken about\nthe ontological status of biological species (Ghiselin 1974). Species\nwere not natural kinds in the way that chemical elements are. Instead,\nthey are historical particulars like nations or galaxies. They have a\nbeginning through speciation, they have parts that are integrated over\ntime by biological relations, and they cease to exist by going extinct\n(Mishler & Brandon 1987). Additionally, individual organisms are\nnot instances of species, as a wedding ring is an instance of gold.\nInstead, they are parts of species, as one is a part of a family. As\nSmart had earlier noticed, this has the implication that there can be\nno “laws of nature” about biological species per se, at\nleast in the traditional sense of ‘laws of nature’ (Smart\n1959). David Hull further developed and argued for the “species\nas individuals” thesis. He explored its implications for a\nvariety of topics including species names, laws of nature, and human\nnature (Hull 1976, 1978, 1986). \n\nHowever, the view that species are individuals leaves other important\nquestions about species unsolved and raises new problems of its own\n(Kitcher 1984, 1989). For example, suppose you are a population\nbiologist and you need to census the individuals in a population of\nspecies. How do you decide what entities to count? Philosophers and\nbiologists have provided a variety of criteria for answering questions\nlike this including reproduction, life-cycles, genetics, sex,\ndevelopmental bottlenecks, germ-soma separation, policing mechanisms,\nspatial boundaries or contiguity, immune response, fitness\nmaximization, cooperation and/or conflict, codispersal, adaptations,\nmetabolic autonomy, and functional integration (Clarke 2013). So, the\nquestion of what a biological individual is indeed a pressing one\n(Wilson 2005; Okasha 2006; Clarke 2011; Pradeu 2012; Bouchard and\nHuneman 2013; Clarke 2013; Godfrey-Smith 2013; Wilson and Barker\n2013).\n\nBiologists have been, and are still, deeply divided over the species\ncategory (Ereshefsky 1992b; Wheeler and Meier 2000; Coyne and Orr\n2004; Wilkins 2009). Consider Ernst Mayr’s famous biological\nspecies concept (BSC). He writes, “Species are groups of\ninterbreeding natural populations that are reproductively isolated\nfrom other such groups” (Mayr 1963, 89). There are lots of\nconcerns regarding the BSC (Ehrlich and Raven 1969; Sokal and Crovello\n1970; Van Valen 1976; Wiley 1978). Asexual organisms do not\ninterbreed. Thus, on the BSC, there are no species of asexual\norganisms. Many species exhibit some introgression, and thus cannot be\ndistinct species. Last, the BSC is extremely difficult to apply to\nspecies in the fossil record since sex organs do not normally\nfossilize, and reproductive behavior is difficult to corroborate. In\nlight of the problems with the BSC (and for other reasons), biologists\nhave put forward other species concepts. Species pluralism is the\nclaim that there is no single correct species concept that classifies\norganisms exactly the same (Ereshefsky 1992a); rather, there are\nseveral correct species concepts. That is, for some organisms,\ndifferent species concepts will correctly place them in distinct\nspecies. Species monism is the claim that there is a single correct\nspecies concept. Some allege species pluralism is temporary because we\nwill eventually find the single best concept (Hull 1999). The debate\nbetween pluralists and monists rages on (Wilson 1999). \n\nBiological species are often given as one of the classic examples of a\n“natural kind”. The philosophy of systematics has had a\nmajor influence on recent work on classification and natural kinds\n(Dupré 1993, 2002; Wilson et. al. 1997; Boyd 1999; Griffiths\n1999; Wilson 1999; Okasha 2001; Walsh 2006). For example, can there be\na notion of natural kind or essentialism consistent with the\n“population thinking” found in biology (Mayr 1975, Sober\n1980; Ariew 2008)? \n5. Philosophy of Molecular Biology\n\nWe mentioned above that the reduction of Mendelian genetics to\nmolecular genetics was one of the first topics to be discussed in the\nphilosophy of biology. The initial debate between Schaffner and Hull\nwas followed by the so-called “anti-reductionist\nconsensus” (Kitcher 1984). The reductionist position was revived\nin a series of important papers by Kenneth Waters (1990, 1994) and\ndebate over the cognitive relationship between the two disciplines\ncontinues today. However, the question is not now framed as a simple\nchoice between reduction and irreducibility (Griffiths 1999; Kitcher\n1999; Sober 1999). Rather, a variety of concepts have been introduced\nand discussed including multiple realizability, realization, and\nmechanism (Wilson 2005, Craver 2007; Polger & Shapiro 2016). These\nhave been important in thinking about genetics but also neuroscience and\ncell biology more generally. For example, Lindley Darden, Schaffner\nand others have argued that explanations in molecular biology are not\nneatly confined to one ontological level, and hence that ideas of\n‘reduction’ derived from classical examples like the\nreduction of the phenomenological gas laws to molecular kinematics in\nnineteenth century physics are simply inapplicable (Darden and Maull\n1977; Schaffner 1993). Moreover, molecular biology does not have the\nkind of grand theory based around a set of laws or a set of\nmathematical models that is familiar from the physical sciences.\nInstead, highly specific mechanisms that have been uncovered in detail\nin one model organism seem to act as “exemplars” allowing\nthe investigation of similar, although not necessarily identical,\nmechanisms in other organisms that employ the same, or related,\nmolecular interactants. Darden and others have argued that these\n“mechanisms” – specific collections of entities and\ntheir distinctive activities – are the fundamental unit of\nscientific discovery and scientific explanation, not only in molecular\nbiology, but in a wide range of special sciences (Machamer, Darden\net al. 2000; Craver & Darden 2013; see also Bechtel and\nRichardson 1993). There is an interesting question about whether the\nnotion of mechanism aptly applies in other areas of biology (Skipper\n& Millstein 2005; Havstad 2011). \n\nAnother important topic in the philosophy of molecular biology has\nbeen the concept of the gene (Beurton, Falk and Rheinberger 2000;\nWaters 2000, 2004; Griffiths and Stotz 2007). Philosophers have also\nwritten extensively on the concept of genetic information, the general\ntenor of the literature being that it is difficult to reconstruct this\nidea precisely in a way that does justice to the apparent weight\nplaced on it by molecular biologists (Sarkar 1996; Maynard Smith 2000;\nGodfrey-Smith 2001; Griffiths 2001; Jablonka 2002; Rosenberg 2006).\nFor example, does DNA actually carry semantic information (Shea\n2007)? If it does not, is this a useful fiction, or is it hindering\nmolecular biology (Levy 2001)? \n6. Philosophy of Developmental Biology\n\nThe debates over adaptationism in the 1980’s made philosophers\nfamiliar with the complex interactions between explanations of traits\nin evolutionary biology and explanations of the same traits in\ndevelopmental biology. Developmental biology throws light on the kinds\nof variation that are likely to be available for selection, posing the\nquestion of how far the results of evolution can be understood in\nterms of the options that were available (“developmental\nconstraints”) rather than the natural selection of those options\n(Maynard Smith, Burian et al. 1985). The debate over\ndevelopmental constraints looked at developmental biology solely from\nthe perspective of whether it could provide answers to evolutionary\nquestions. However, as Ron Amundson pointed out, developmental\nbiologists are addressing questions of their own, and, he argued, a\ndifferent concept of constraint is needed to address those questions\n(Amundson 1994). The emergence in the 1990’s of a new field\npromising to unite both kinds of explanation, evolutionary\ndevelopmental biology, has given rise to a substantial philosophical\nliterature aimed at characterizing this field from a methodological\nviewpoint (Gray 1992; Griffiths and Gray 1994; Oyama 2000a, 2000b;\nOyama, Griffiths, and Gray 2001; Maienschein and Laubichler 2004;\nRobert 2004; Amundson 2005; Brandon and Sansom 2007). For example,\ndevelopmental systems theorists (Gray 1992; Griffiths and Gray 1994;\nOyama 2000a, 2000b; Oyama, Griffiths, and Gray 2001) argue for\n“parity” between genes and non-genetic factors. First,\norganisms inherit a “developmental matrix” and not just\ngenes (e.g. “epigenetic inheritance”). Second, the role of\ngenes is in the development of traits is not causally unique –\ninsofar as genes “carry information” or are\n“copied” the same can be said of other factors. That is,\ngenes and developmental factors causally covary with phenotypic\ntraits. However, defenders of “extended replicators” argue\nthat genes uniquely carry information in a teleosemantic sense\n(Sterelny et. al. 1996). Another source of philosophical controversy\nin developmental biology concerns whether any traits are innate and\nwhat innateness might be (Ariew 1999; Griffiths 2002; Mameli and\nBateson 2006). Philosophers have contributed to clarifying the\ndifference concepts at issue. \n7. Philosophy of Ecology and Conservation Biology\n\nUntil recently this was an extremely underdeveloped field in the\nphilosophy of biology. This is surprising, because there is obvious\npotential for all three of the approaches to philosophy of biology\ndiscussed above. There is also a substantial body of philosophical\nwork in environmental ethics, and answering the questions that arise\nthere would require a critical examination of ecology and conservation\nbiology (Brennan 2014). Over the last twenty years, this field has\ndeveloped rapidly (Colyvan et. al. 2009).\n\nPhilosophers have started to remedy the neglect of ecology and a\nnumber of major books have appeared (Cooper 2003, Ginzburg and Colyvan\n2004, Sarkar 2005, MacLaurin and Sterelny 2008). The discussions have\nfocused on several topics including the complicated and sometimes\ntroubled relationship between mathematical models and empirical data\nin ecology (Shrader-Frechette & McCoy 1993; Ginzburg and Colyvan\n2004; Odenbaugh 2005; Weisberg 2012), whether there are distinctive\necological laws (Cooper 2003; Mikkelson 2003; Lange 2005; Eliot 2011b,\nLinquist et. al. 2016), the nature and reality of ecological\ncommunities and ecosystems (Sterelny 2006; Odenbaugh 2007; Eliot\n2011), the “robustness“ of ecological principles\n(Odenbaugh 2003; Weisberg & Reisman 2008; Justus 2012), the idea\nof ecological stability and the “balance of nature”\n(Odenbaugh 2001; Cooper 2003; Mikkelson 2001; Justus 2008), the\ndefinition of biodiversity (Sarkar 2005; MacLaurin and Sterelny 2008;\nSantana 2014), and the relationship between ecology and conservation\nbiology (Linquist 2008). Recently, there has been interesting work\ndone on functions in ecology as well (Jax, 2005; Odenbaugh 2010;\nNunes-Neto et. al. 2014; Dussault & Bouchard 2017). Most\necologists and evolutionary biologists do not think communities or\necosystems are units of selection, and thus the selected-effects\naccount of functions does not readily apply. So, philosophers of\necology have been exploring alternatives. \n8. Methodology in Philosophy of Biology and Future Directions\n\nMost work in the philosophy of biology is self-consciously\nnaturalistic, recognizing no profound discontinuity in either method\nor content between philosophy and science. Ideally, philosophy of\nbiology differs from biology itself not in its knowledge base, but\nonly in the questions it asks. The philosopher aims to engage with the\ncontent of biology at a professional level, although typically with\ngreater knowledge of its history than biologists themselves, and fewer\nhands-on skills. It is common for philosophers of biology to have\nacademic credentials in the fields that are the focus of their\nresearch, and to be closely involved with scientific collaborators.\nPhilosophy of biology’s naturalism and the continuity of its concerns\nwith science itself is shared with much other recent work in the\nphilosophy of science, perhaps most notably in the philosophy of\nneuroscience (Bechtel, Mandik et al. 2001).\n\nEven the distinction between the questions of biology and\nthose of philosophy of biology is not absolutely clear. As noted\nabove, philosophers of biology address three types of questions:\ngeneral questions about the nature of science, conceptual problems\nwithin biology, and traditional philosophical questions that seem open\nto illumination from the biosciences. When addressing the second sort\nof question, there is no clear distinction between philosophy of\nbiology and theoretical biology. But while this can lead to the\naccusation that philosophers of biology have abandoned their calling\nfor ‘science reporting’ it can equally well be said that a\nbook like The Selfish Gene (Dawkins 1976) is primarily a\ncontribution to philosophical discussion of biology. Certainly, the\nprofessional skills of the philosopher are as relevant to these\ninternal conceptual puzzles as they are to the other two types of\nquestion. All three types of question can be related to the specific\nfindings of the biological sciences only by complex chains of\nargument.\n\nThere is a great deal of new work being in done in the philosophy of\nbiology. As examples, there is a rich philosophical literature\nemerging around cancer (Plutynski 2018), cultural evolution (Sterelny\n2012; Lewens 2015; O’Connor 2019), human nature (Machery 2008;\nRamsey 2013; Kronfeldner 2018), microbiology (O’Malley 2014),\nand paleobiology (Turner 2011; Currie 2018). Philosophy of biology\nstill remains one of the most dynamic and interesting areas of the\nphilosophy of science and philosophy more generally. \n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Amundson, R., 1994. “Two concepts of constraint:\nadaptationism and the challenge from developmental biology,”\n<i>Philosophy of Science</i>, 61(4): 556–578.",
                "–––, 2005. <i>The changing rule of the embryo\nin evolutionary biology: Structure and synthesis</i>, New York:\nCambridge University Press.",
                "Ariew, A., 1999. “Innateness is Canalization”, in V.\nHardcastle (ed.) <i>Where Biology Meets Psychology</i>, Cambridge, MA:\nMIT Press.",
                "Ayala, F. J., 1976. “Biology as an autonomous\nscience,” in M. Grene, and E. Mendelsohn (eds.): <i>Boston\nStudies in Philosophy of Science XXVII</i> (Topics in Philosophy of\nBiology), 313–329.",
                "Barker, G., 2015. <i>Beyond Biofatalism: Human Nature for an\nEvolving World</i>, New York: Columbia University Press.",
                "Beatty, J., 1980. “Optimality-design and the strategy of\nmodel-building in evolutionary biology,” <i>Philosophy of\nScience</i>, 47: 532–61.",
                "Beatty, J., &amp; Finsen, S., 1989. “Rethinking the\npropensity interpretation: A peek inside Pandora’s box,”\n<i>In What the Philosophy of Biology is</i>,\nDordrecht: Springer,  17–30.",
                "Beatty, J., 1995. “The Evolutionary Contingency\nThesis,” in G. Wolters and J. Lennox (eds.), <i>Concepts,\nTheories, and Rationality in the Biological Sciences</i>, University\nof Pittsburgh Press.",
                "Bechtel, W., Mandik, P. <i>et al</i>. (eds.), 2001. <i>Philosophy\nand the Neurosciences: A Reader</i>, Oxford: Blackwell.",
                "Bechtel, W., and Richardson, R., 1993. <i>Discovering\nComplexity</i>, Princeton: Princeton University Press.",
                "Beckner, M., 1959. <i>The biological way of thought</i>, New\nYork: Columbia University Press.",
                "Beurton, P., Falk, R., and Rheinberger, H.-J. (eds.), 2000.\n<i>The Concept of the Gene in Development and Evolution</i>,\nCambridge: Cambridge University Press.",
                "Birch, J., 2017. <i>The Philosophy of Social Evolution</i>, Oxford\nUniversity Press.",
                "Boorse, C., 1976. “Wright on functions,”\n<i>Philosophical Review</i>, 85(1): 70–86.",
                "Boyd, R., 1999. “Homeostasis, species, and higher\ntaxa,” in <i>Species: New interdisciplinary essays</i>, edited\nby R. Wilson, Cambridge, MA: Bradford/MIT Press.",
                "Brandon, R. N. (ed.), 1996. <i>Concepts and Methods in\nEvolutionary Biology</i>, Cambridge: Cambridge University Press.",
                "–––, 1997. “Does biology have laws? The\nexperimental evidence”, <i>PSA</i> 1996 (Volume 2),\n444–457.",
                "–––, 2005. “The Difference between\nSelection and Drift: A Reply to Millstein,” <i>Biology &amp;\nPhilosophy</i>, 20(1): 153–170.",
                "Brandon, R. N. and Burian, R. M. (eds.), 1984. <i>Genes,\nOrganisms, and Populations</i>, Cambridge, MA: MIT Press.",
                "Brandon, R., and M. D. Rausher, 1996. “Testing\nadaptationism: A comment on Orzack and Sober,” <i>The American\nNaturalist</i>, 148: 189–201.",
                "Brandon, R. N. and Sansom, R. (eds.), 2007. <i>Integrating\nEvolution and Development</i>, Cambridge: Cambridge University\nPress.",
                "Brennan, A., 2014. <i>Thinking about Nature (Routledge\nRevivals): An Investigation of Nature, Value and Ecology</i>, London:\nRoutledge.",
                "Buller, D. J., 2006. <i>Adapting Minds: Evolutionary Psychology\nand the Persistent Quest for Human Nature</i>, Cambridge, MA: MIT\npress.",
                "Callebaut, W., 1993. <i>Taking the Naturalistic Turn, or How Real\nPhilosophy of Science is Done</i>, Chicago: University of Chicago\nPress.",
                "Colyvan, M., Linquist, S., Grey, W., Griffiths, P. E., Odenbaugh,\nJ., &amp; Possingham, H. P., 2009. “Philosophical Issues in\nEcology: Recent Trends and Future Directions,” <i>Ecology and\nSociety</i>, 14(2): 22; \n <a href=\"https://www.ecologyandsociety.org/vol14/iss2/art22/\" target=\"other\">online\npublication</a>.",
                "Cooper, G., 2003. <i>The Science of the Struggle for Existence:\nOn the foundations of ecology</i>, Cambridge: Cambridge University\nPress.",
                "Coyne, J. A. and Orr, H. A., 2004. <i>Speciation</i>, Sunderland,\nMA: Sinauer Associates, Inc.",
                "Craver, C. F., 2007. <i>Explaining the Brain: Mechanisms and the\nMosaic Unity of Neuroscience</i>, Oxford: Oxford University\nPress.",
                "Craver, C. F., &amp; Darden, L., 2013. <i>In Search of\nMechanisms: Discoveries Across the Life Sciences</i>, Chicago: University of\nChicago Press.",
                "Currie, A., 2018. <i>Rock, bone, and ruin: An optimist’s\nguide to the historical sciences</i>, Cambridge, MA: MIT Press.",
                "Darden, L. and Maull, N., 1977. “Interfield\ntheories,” <i>Philosophy of Science</i>, 44(1):\n43–64.",
                "Dawkins, R., 1976. <i>The Selfish Gene</i>, Oxford: Oxford\nUniversity Press.",
                "Dretske, F., 1991. <i>Explaining Behavior: Reasons in a World of\nCauses</i>, Cambridge, MA: MIT Press.",
                "–––, 1997. <i>Naturalizing the Mind</i>,\nCambridge, MA: MIT Press.",
                "Dupré, J. (ed.), 1987. <i>The Latest on the Best: Essays\non Optimality and Evolution</i>, Cambridge, MA: MIT Press.",
                "–––, 1993. <i>The Disorder of Things:\nMetaphysical Foundations of the Disunity of Science</i>, Cambridge,\nMA: Harvard University Press.",
                "–––, 2002. “Is ‘Natural Kind’\na Natural Kind Term?“ <i>Monist</i>, 85(1): 29–49.",
                "Dussault, A. C. and F. Bouchard, 2017.\n{special-character:ldquo]A persistence enhancing propensity account of\necological function to explain ecosystem evolution,”\n<i>Synthese</i>, 194(4): 1115–1145. ",
                "Ehrlich, P. and Raven, P., 1969. “Differentiation of\nPopulations,” <i>Science</i>, 165(3899):\n1228–1232.",
                "Eliot, C., 2011a. “The Legend of Order and Chaos:\nCommunities and Early Community Ecology,” in <i>Handbook of the\nPhilosophy of Ecology</i>, K. de Laplante, B. Brown, and K.\nPeacocke (eds.), Haarlem: Elsevier, 49–108.",
                "Eliot, C., 2011b. “Competition Theory and Channeling\nExplanation,” <i>Philosophy and Theory in Biology</i>, 3:\n1–16.",
                "Ereshefsky, M., 1992a. “Eliminative pluralism,”\n<i>Philosophy of Science</i>, 59(4): 671–690.",
                "–––, 1992b. <i>The Units of Evolution: Essays\non the Nature of Species</i>, Cambridge, MA: MIT Press.",
                "Fodor, J. A., 1974. “Special sciences. ”\n<i>Synthese</i>, 28: 77–115.",
                "Forber, P., 2009. “Spandrels and a Pervasive Problem of\nEvidence,” <i>Biology and Philosophy</i>, 24:\n247–266.",
                "Garson, J., 2019. <i>What Biological Functions Are and Why They\nMatter</i>, Cambridge: Cambridge University Press.",
                "Garvey, B., 2007. <i>Philosophy of Biology</i>, Stocksfield:\nAcumen.",
                "Ghiselin, M. T., 1974. “A radical solution to the species\nproblem,” <i>Systematic Zoology</i>, 23: 536–44.",
                "Ginzburg, L., and Colyvan, M., 2004. <i>Ecological Orbits: How\nplanets Move and Populations Grow</i>, Oxford and New York: Oxford\nUniversity Press.",
                "Godfrey-Smith, P., 2001a. “Three kinds of\nadaptationism,” in <i>Adaptationism and Optimality</i>, S. H.\nOrzack, and E. Sober (eds.), New York: Cambridge University Press, pp.\n335–357.",
                "–––, 2001b. “On the Theoretical Role of\n‘Genetic Coding’” <i>Philosophy of Science</i>, 67:\n26–44.",
                "Godfrey-Smith, Peter &amp; R.C. Lewontin, 1993. “The\nDimensions of Selection,” <i>Philosophy of Science</i>, 60(3):\n373–395.",
                "Godfrey-Smith, Peter &amp; Benjamin Kerr, 2002. “Group\nFitness and Multi-Level Selection: Replies to Commentaries,”\n<i>Biology and Philosophy</i>, 17(4): 539–549. ",
                "Gould, S. J., and R. C. Lewontin, 1979. “The spandrels of\nSan Marco and the Panglossian paradigm: a critique of the\nadaptationist programme“, <i>Proceedings of the Royal Society\nLondon, Series B</i>, 205: 581–598.",
                "Gray, R., 1992. “Death of the Gene: Developmental Systems\nStrike Back” in P. Griffiths (ed.), <i>Trees of Life: Essays in\nthe Philosophy of Biology</i>, Dordrecht: Kluwer.",
                "Grene, Marjorie G., and David Depew, 2004. <i>The Philosophy of\nBiology: An Episodic History</i>, Cambridge: Cambridge University\nPress.",
                "Griffiths, Paul E., 1999. “Squaring the circle: Natural\nkinds with historical essences,” in <i>Species, New\ninterdisciplinary essays</i>, edited by R. A. Wilson, Cambridge, MA:\nBradford/MIT Press:209–228.",
                "Griffiths, P. E., 2001. “Genetic Information: A Metaphor in\nSearch of a Theory,” <i>Philosophy of Science</i>, 68(3):\n394–412.",
                "Griffiths, P., 2002. “What is Innateness?,”\n<i>Monist</i>, 85: 70–85.",
                "Griffiths, P. and R. Gray, 1994. “Developmental Systems and\nEvolutionary Explanation” <i>Journal of Philosophy</i>, 91:\n277–304. ",
                "Griffiths, P. E. and Stotz, K., 2007. “Gene,” in M.\nRuse and D. Hull, (eds.): <i>Cambridge Companion to Philosophy of\nBiology</i>, Cambridge: Cambridge University Press, 85–102.",
                "Haber, M.H., 2008. “Phylogenetic Inference,” in A.\nTucker (ed.), <i>A Companion to Philosophy of History and\nHistoriography</i>, Malden, MA: Blackwell Publishing. ",
                "Havstad, J. C., 2011. “Problems for natural selection as a\nmechanism,” <i>Philosophy of Science</i>, 78(3):\n512–523.",
                "Hempel, Carl, 1965. <i>Aspects of Scientific Explanation and Other\nEssays in the Philosophy of Science</i>, New York: The Free\nPress.",
                "Hennig, W., 1966. <i>Phylogenetic Systematics</i>, Urbana, IL:\nUniversity of Illinois Press.",
                "Hull, D. L., 1965. “The Effects of Essentialism on\nTaxonomy: 2,000 Years of Stasis,” <i>British Journal for the\nPhilosophy of Science</i>, 15: 314–326 and 16: 1–18.",
                "–––, 1970. “Contemporary systematic\nphilosophies,” <i>Annual Review of Ecology and Systematics</i>,\n1: 19–54.",
                "–––, 1974. <i>Philosophy of Biological\nScience</i>, Englewood Cliffs: Prentice-Hall.",
                "–––, 1975. “Informal Aspects of Theory\nReduction,” in Cohen, R. S. and Michalos, A. (eds.):\n<i>Proceedings of the Biennial Meeting of the Philosopy of Science\nAssociation, 1974</i>, Dordrecht: D. Reidel, 653–670. ",
                "–––, 1976. “Are species really\nindividuals?” <i>Systematic zoology</i>, 25(2):\n174–191.",
                "–––, 1978. “A matter of\nindividuality.“ <i>Philosophy of science</i>, 45(3):\n335–360.",
                "–––, 1980. “Individuality and\nSelection,” <i>Annual Review of Ecology and Systematics</i>, 11:\n311–332.",
                "–––, 1986. “On human nature,” In\n<i>PSA 1986</i> (Volume 2), <i>Proceedings of the biennial meeting of the\nphilosophy of science association</i>, Philosophy of Science\nAssociation, pp. 3–13.",
                "–––, 1988. <i>Science as a Process: An\nEvolutionary Account of the Social and Conceptual Development of\nScience</i>, Chicago: University of Chicago Press.",
                "–––, 1999. “On the plurality of species:\nquestioning the party line,” in <i>Species: New\nInterdisciplinary Essays</i>, Cambridge, MA: MIT Press,\npp. 307–315.",
                "Hull, D. L. and Ruse, M. (eds.), 1998. <i>The Philosophy of\nBiology</i>, Oxford: Oxford University Press.",
                "Hull, D. L. and Ruse, M., 2007. <i>The Cambridge Companion to the\nPhilosophy of Biology</i>, New York, Cambridge University Press.",
                "Jablonka, E., 2002. “Information Interpretation,\nInheritance, and Sharing,” <i>Philosophy of Science</i>, 69(4):\n578–605.",
                "Jax, K., 2005. “Function and ‘functioning’ in\necology: what does it mean?” <i>Oikos</i>, 111(3): 641–648.",
                "Justus, J., 2008. “Ecological and Lyapunov\nstability,” <i>Philosophy of Science</i>, 75: 421–436.",
                "–––, 2012. “The elusive basis of\ninferential robustness.“ <i>Philosophy of Science</i>, 79(5):\n795–807.",
                "Kitcher, P., 1982. <i>Abusing science: The case against\ncreationism</i>, Cambridge, MA: MIT Press.",
                "–––, 1984. “1953 and all that: a tale of\ntwo sciences,” <i>Philosophical Review</i>, 93:\n335–373.",
                "–––, 1984. “Species,” <i>Philosophy\nof Science</i>, 51(2): 308–333.",
                "–––, 1985. <i>Vaulting Ambition: Sociobiology\nand the Question for Human Nature</i>, Cambridge, MA:  MIT Press.",
                "–––, 1989. “Some puzzles about\nspecies,” in Michael Ruse (ed.), <i>What the Philosophy of\nBiology Is: Essays Dedicated to David Hull</i>, Dordrecht: Kluwer Academic\nPublishers, pp. 183–208.",
                "–––, 1999. “The hegemony of molecular\nbiology,” <i>Biology and Philosophy</i>, 14(2):\n195–210.",
                "Kronfeldner, M., 2018. <i>What’s left of human nature?: A\npost-essentialist, pluralist, and interactive account of a contested\nconcept</i>, Cambridge, MA: MIT Press.",
                "Levy, A., 2011. “Information in biology: A fictionalist\naccount,” <i>Noûs</i>, 45(4): 640–657.",
                "Lewens, T., 2015. <i>Cultural evolution: conceptual\nchallenges</i>, Oxford: Oxford University Press.",
                "Linquist, S., 2008. “But is it progress? On the alleged\nadvances of conservation biology over ecology,” <i>Biology and\nPhilosophy</i>, 23: 529–544.",
                "Linquist, S., Gregory, T. R., Elliott, T. A., Saylor, B., Kremer,\nS. C., &amp; Cottenie, K., 2016. “Yes! There are resilient\ngeneralizations (or ‘laws’) in ecology,” <em>The\nQuarterly Review of Biology</em>, 91(2): 119–131.",
                "Lloyd, E. A., 1988. <i>The Structure and Confirmation of\nEvolutionary Theory</i>, Westport: Greenwood Press.",
                "–––, 2005. “Why the Gene Will Not\nReturn,” <i>Philosophy of Science</i>, 72(2):\n287–310.",
                "–––, 2015. “Adaptationism and the logic\nof research questions: how to think clearly about evolutionary\ncauses.“ <i>Biological Theory</i>, 10(4): 343–362.",
                "Machamer, P., Darden, L. <i>et al</i>., 2000. “Thinking\nabout Mechanisms,” <i>Philosophy of Science</i>, 67(1):\n1–25.",
                "Machery, E., 2008. “A plea for human nature,”\n<i>Philosophical Psychology</i>, 21(3): 321–329.",
                "MacLaurin, J. and Sterelny, K., 2008. <i>What is\nBiodiversity?</i> Chicago: University of Chicago Press.",
                "Maienschein, J. and Laubichler, M. L., 2004. <i>From Embryology\nto Evo-Devo</i>, Cambridge: Cambridge University Press.",
                "Mameli, M. and Bateson, P., 2006. “Innateness and the\nSciences,” <i>Biology and Philosophy</i>, 21:\n155–188.",
                "Matthen, M., &amp; Ariew, A., 2002. “Two ways of thinking\nabout fitness and natural selection,” <i>The Journal of\nPhilosophy</i>, 99(2): 55–83.",
                "Maynard Smith, J., 2000. “The concept of information in\nbiology,” <i>Philosophy of Science</i>, 67(2):\n177–194.",
                "Maynard Smith, J., Burian, R. <i>et al</i>., 1985.\n“Developmental Constraints and Evolution,” <i>Quarterly\nReview of Biology</i>, 60(3): 265–287.",
                "Mayr, E., 1963. <i>Animal species and evolution</i>, Cambridge,\nMA: Harvard University Press.",
                "–––, 1969. “Footnotes on the Philosophy\nof Biology,” <i>Philosophy of Science</i>, 36(2):\n197–202.",
                "–––, 1982. <i>The Growth of Biological\nThought</i>, Cambridge, MA: Harvard University Press.",
                "Millikan, R. G., 1984. <i>Language, Thought and Other Biological\nCategories</i>, Cambridge, MA: MIT Press.",
                "–––, 1995. <i>White queen psychology and other\nessays for Alice</i>, Cambridge, MA: MIT Press.",
                "–––, 2004. <i>Varieties of meaning: the 2002\nJean Nicod lectures</i>, Cambridge, MA: MIT Press.",
                "–––, 2005. <i>Language: A biological model</i>,\nOxford: Oxford University Press.",
                "Mills, S. and Beatty, J., 1979. “The propensity\ninterpretation of fitness,” <i>Philosophy of Science</i>, 46:\n263–286.",
                "Millstein, Roberta L., 2002. “Are Random Drift and Natural\nSelection Conceptually Distinct?” <i>Biology &amp;\nPhilosophy</i>, 17(1): 33–53.",
                "–––, 2005. “Selection Vs. Drift: A\nResponse to Brandon’s Reply,” <i>Biology &amp;\nPhilosophy</i>, 20(1): 171–175. ",
                "–––, 2007. “Distinguishing drift and\nselection empirically: ‘The Great Snail Debate’ of the\n1950s,” <i>Journal of the History of Biology</i>, 41:\n339–367.",
                "Mishler, B. D., &amp; Brandon, R. N., 1987. “Individuality,\npluralism, and the phylogenetic species concept,” <i>Biology and\nPhilosophy</i>, 2(4): 397–414.",
                "Mitchell, S. D., 1997. “Pragmatic laws,”\n<i>Philosophy of Science</i>, 64: S468–S479.",
                "–––, 2000. “Dimensions of scientific\nlaws,” <i>Philosophy of Science</i>, 67: 242–265.",
                "Nagel, Ernest, 1961. <i>The Structure of Science: Problems in the\nLogic of Scientific Explanation</i>, New York: Harcourt, Brace &amp;\nWorld.",
                "Neander, K., 1991. “Functions as selected effects: the\nconceptual analyst’s defense,” <i>Philosophy of Science</i>, 58:\n168–184.",
                "–––, 2017. <i>A mark of the mental: In defense\nof informational teleosemantics</i>, Cambridge, MA: MIT Press.",
                "Nunes-Neto, N., A. Moreno, and C. N. El-Hani, 2014.\n“Function in ecology: an organizational approach,”\n<i>Biology &amp; Philosophy</i>, 29(1): 123–141.",
                "O’Connor, C., 2019. <i>The Origins of Unfairness: Social\nCategories and Cultural Evolution</i>, Oxford: Oxford University Press.",
                "O’Malley, M., 2014. <i>Philosophy of microbiology</i>,\nCambridge: Cambridge University Press.",
                "Odenbaugh, J., 2001. “Ecology, stability, model building and\nenvironmental policy: a reply to some of the pessimism,”\n<i>Philosophy of Science</i>, 68: S493–S505.",
                "–––, 2003. “Complex systems, trade-offs,\nand theoretical population biology: Richard Levin’s ‘strategy of\nmodel building in population biology’ revisited,”\n<em>Philosophy of Science</em>, 70(5): 1496–1507.",
                "–––, 2005. “Idealized, inaccurate but\nsuccessful: A pragmatic approach to evaluating models in theoretical\necology,” <i>Biology and Philosophy</i>, 20(2-3):\n231–255.",
                "–––, 2007. “Seeing the forest and the\ntrees,” <i>Philosophy of Science</i>, 74: 628–641.",
                "–––, 2010. “On the very idea of an\necosystem,” in <i>New waves in metaphysics</i>, A. Hazlett\n(ed.), London: Palgrave, pp.  240–258.",
                "Okasha, S., 2002. “Darwinian metaphysics: Species and the\nquestion of essentialism,” <i>Synthese</i>, 131(2):\n191–213.",
                "–––, 2007. <i>Evolution and the Levels of\nSelection</i>, New York and Oxford: Oxford University Press.",
                "Orzack, S. H., and E. Sober, 1994. “Optimality models and\nthe test of adaptationism,” <i>The American Naturalist</i>, 143:\n361–380.",
                "–––, 2001. <i>Optimality and Adaptation</i>,\nCambridge: Cambridge University Press.",
                "Oyama, S., 2000. <i>The Ontogeny of Information, 2nd Edition</i>,\nDuke University Press.",
                "–––, 2000. <i>Evolution’s Eye</i>, Duke\nUniversity Press.",
                "Oyama, S., P. Griffiths and R. Gray (eds.), 2001. <i>Cycles of\nContingency</i>, Cambridge, MA: MIT Press.",
                "Papineau, David, 1987. <i>Reality and Representation</i>,\nBlackwell.",
                "–––, 1993. <i>Philosophical naturalism</i>,\nBlackwell.",
                "Pence, C. H., &amp; Ramsey, G., 2013. “A new foundation for\nthe propensity interpretation of fitness,” <i>The British\nJournal for the Philosophy of Science</i>, 64(4): 851–881.",
                "Pigliucci, M. and Kaplan, J. M., 2006. <i>Making Sense of\nEvolution: The Conceptual Foundations of Evolutionary Theory</i>,\nChicago: University of Chicago Press.",
                "Pittendrigh, C. S., 1958. “Adaptation, natural selection\nand behavior,” <i>Behavior and Evolution</i>, in A. Roe and G.\nG. Simpson (eds.), New Haven: Yale University\nPress, 390–416.",
                "Plutynski, A., 2018. <i>Explaining cancer: Finding order in\ndisorder</i>, Oxford: Oxford  University Press.",
                "Polger, T. W., &amp; Shapiro, L. A., 2016. <i>The multiple\nrealization book</i>, Oxford: Oxford University Press.",
                "Potochnik, A., 2009. “Optimality modeling in a suboptimal\nworld,” <i>Biology and Philosophy</i>, 24: 183–197.",
                "Ramsey, G., 2013. “Human nature in a post-essentialist\nworld,” <i>Philosophy of Science</i>, 80(5): 983–993.\nChicago",
                "Richardson, R. C., 2010. <i>Evolutionary psychology as\nmaladapted psychology</i>, Cambridge, MA: MIT Press.",
                "Robert, J. S., 2004. <i>Embryology, Epigenesis and Evolution:\nTaking Development Seriously</i>, Cambridge and New York: Cambridge\nUniversity Press.",
                "Rosenberg, A., 1978. “The supervenience of biological\nconcepts,” <i>Philosophy of Science</i>, 45: 368–386.",
                "–––, 1983. “Fitness,” <i>Journal of\nPhilosophy</i>, 80: 457–473.",
                "–––, 1997. “Reductionism redux: computing\nthe embryo,” <i>Biology and Philosophy</i>, 12(4):\n445”470.",
                "–––, 2008. <i>Darwinian reductionism: Or, how\nto stop worrying and love molecular biology</i>, Chicago: University\nof Chicago Press.",
                "Rosenberg, A. and McShea, D. W., 2008. <i>Philosophy of Biology:\nA contemporary introduction</i>, New York and London: Routledge.",
                "Ruse, M., 1982. <i>Darwinism Defended</i>, Addison-Wesley.",
                "–––, 1988. <i>Philosophy of biology today</i>,\nSUNY Press.",
                "Santana, C.,, 2014. “Save the planet: Eliminate\nbiodiversity,” <i>Biology &amp; Philosophy</i>, 29(6):\n761–780.",
                "Sarkar, S., 1992. “Models of reduction and categories of\nreductionism,” <i>Synthese</i>, 91: 167–94.",
                "–––, 1996. “Biological information: A\nsceptical look at some central dogmas of molecular biology,” in\nSarkar, S. (ed.),  <i>The Philosophy and History of Molecular Biology:\nNew Perspectives</i> (Boston Studies in the Philosophy of Science\n183), Dordrecht and Boston: Kluwer Academic, 187–232.",
                "–––, 1998. <i>Genetics and Reductionism</i>,\nCambridge: Cambridge University Press.",
                "–––, 2005. <i>Biodiversity and Environmental\nPhilosophy: An Introduction</i>, Cambridge: Cambridge University\nPress.",
                "–––, 2007. <i>Doubting Darwin?: Creationist\ndesigns on evolution</i>, Malden, MA: Blackwell Publishing.",
                "–––, 2011. “Drift and the Causes of\nEvolution,” in P. McKay Illari, F. Russo and J. Williamson\n(eds.) <i>Causality in the Sciences</i>, Oxford: Oxford University\nPress, 445–469.",
                "Sarkar, S. and Plutynski, A., 2008. <i>A Companion to the\nPhilosophy of Biology</i>, Oxford: Blackwell.",
                "Schaffner, K. F., 1967a. <i>Antireductionism and Molecular\nBiology</i>, in Munson, R. (ed.) <i>Man and Nature: Philosophical\nIssues in Biology</i>, New York: Dell, 44–54.",
                "–––, 1967b. “Approaches to\nReduction,” <i>Philosophy of Science</i>, 34: 137–47.",
                "–––, 1969. “The Watson-Crick model and\nreductionism,” <i>British Journal for the Philosophy of\nScience</i>, 20: 325–48.",
                "–––, 1993. <i>Discovery and Explanation in\nBiology and Medicine</i>, Chicago and London: University of Chicago\nPress.",
                "Segerstråle, U. C. O., 2000. <i>Defenders of the truth: The\nbattle for science in the sociology debate and beyond</i>, Oxford:\nOxford University Press.",
                "Shea, N., 2007. “Representation in the genome and in other\ninheritance systems”, <i>Biology and Philosophy</i>, 22(3):\n313–331.",
                "Shrader-Frechette, K. S. and McCoy, E. D., 1993. <i>Method in\nEcology: Strategies for Conservation</i>, Cambridge and New York:\nCambridge University Press.",
                "Skipper Jr, R. A., &amp; Millstein, R. L., 2005. “Thinking\nabout evolutionary mechanisms: Natural selection,” <i>Studies in\nHistory and Philosophy of Science Part C: Studies in History and\nPhilosophy of Biological and Biomedical Sciences</i>, 36(2):\n327–347.",
                "Smart, J. J. C., 1959. “Can biology be an exact\nscience?” <i>Synthese</i>, 11(4): 359–368.",
                "Sober, E., 1984a. “Fact, fiction and fitness: a reply to\nRosenberg,” <i>Journal of Philosophy</i>, 81:\n372–383.",
                "–––, 1984b. <i>The Nature of Selection:\nEvolutionary Theory in Philosophical Focus</i>, Cambridge,\nMA: MIT Press.",
                "–––, 1988. <i>Reconstructing the Past:\nParsimony, Evolution and Inference</i>, Cambridge, MA: MIT\nPress.",
                "–––, 1997. “Two Outbreaks of Lawlessness\nin Recent Philosophy of Science,” <i>Philosophy of Science</i>\n2: 458–467.",
                "–––, 1999. <i>Philosophy of Biology</i>,\nBoulder and Oxford: Westview Press.",
                "–––, 2001. “The Two Faces of\nFitness,” in R. Singh, D. Paul, C. Krimbas, and J. Beatty\n(eds.), <i>Thinking about Evolution: Historical, Philosophical, and\nPolitical Perspectives</i> (Volume 2), Cambridge: Cambridge University Press,\npp. 309–321.",
                "–––, 2004. “The Contest between Parsimony\nand Likelihood,” <i>Systematic Biology</i>, 53:\n644–53.",
                "Sober, E., (ed.), 2006. <i>Conceptual Issues in Evolutionary\nBiology</i>, Cambridge, MA: MIT Press.",
                "Sober, E. and Wilson, D. S., 1998. <i>Unto Others: The Evolution\nand Psychology of Unselfish Behavior</i>, Cambridge, MA:\nHarvard University Press.",
                "Sokal, R. R. and T. J. Crovello, 1970. “The biological\nspecies concept: a critical evaluation,” <i>The American\nNaturalist</i>, 104 (936): 127–153.",
                "Sterelny, K., 2006. “Local ecological communities,”\n<i>Philosophy of Science</i>, 73: 215–231.",
                "–––, 2012. <i>The evolved apprentice</i>, MIT\nPress.",
                "Sterelny, K. and Griffiths, P. E., 1999. <i>Sex and Death: An\nIntroduction to the Philosophy of Biology</i>, Chicago: University of\nChicago Press.",
                "Sterelny, K., K. Smith, and M. Dickison, 1996. “The\nextended replicator,” <i>Biology and Philosophy</i>, 11:\n377–403.",
                "Sterelny, K., &amp; Kitcher, P., 1988. “The return of the\ngene,” <i>The Journal of Philosophy</i>, 85(7):\n339–361.",
                "Stotz, K. and Griffiths, P. E., 2008. “Biohumanities:\nRethinking the relationship between biosciences, philosophy and\nhistory of science, and society,” <i>Quarterly Review of\nBiology</i>, 83(1): 37–45.",
                "Thompson, P., 1988. <i>The structure of biological theories</i>,\nAlbany, NY: SUNY Press.",
                "Turner, D., 2011. <i>Paleontology: a philosophical\nintroduction</i>, Cambridge: Cambridge University Press.",
                "Van Valen, L., 1976. “Ecological species, multispecies, and\noaks,” <i>Taxon</i>, 25(2–3): 233–239.",
                "Walsh, Denis, 2006. “Evolutionary\nEssentialism,” <i>British Journal for the Philosophy of\nScience</i>, 57(2): 425–448.",
                "Walsh, D. M., Lewens, T., &amp; Ariew, A., 2002. “The\ntrials of life: Natural selection and random drift,”\n<i>Philosophy of Science</i>, 69(3): 429–446.",
                "Waters, C. K., 1990. <i>Why the Antireductionist Consensus Won’t\nSurvive the Case of Classical Mendelian Genetics</i>, in A. Fine, M.\nForbes and L. Wessells (eds.), <i>Proceedings of the Biennial Meeting\nof the Philosophy of Science Association</i> (Volume 1: Contributed\nPapers), Chicago: University of Chicago Press, 125–139.",
                "–––, 1994. “Genes made molecular,”\n<i>Philosophy of Science</i>, 61: 163–185.",
                "–––, 1998. “Causal Regularities in the\nBiological World of Contingent Distributions,” <i>Biology and\nPhilosophy</i>, 13: 5–36. ",
                "–––, 2000. “Molecules made\nbiological,” <i>Revue internationale de philosophie</i>,\n54(214/4): 539–564.",
                "–––, 2004. “What was classical\ngenetics?,” <i>Studies in History and Philosophy of Science</i>\n(Part A), 35(4): 783–809.",
                "–––, 2005. “Why Genic and Multilevel\nSelection Theories Are Here to Stay,” <i>Philosophy of\nScience</i>, 72(2): 311–333.",
                "Weisberg, M., 2012. <i>Simulation and similarity: Using models to\nunderstand the world</i>, Oxford: Oxford University Press.",
                "Weisberg, M., &amp; Reisman, K., 2008. “The robust Volterra\nprinciple,” <i>Philosophy of science</i>, 75(1):\n106–131.",
                "Wiley, E. O., 1978. “The evolutionary species concept\nreconsidered,” <i>Systematic Biology</i>, 27(1):\n17–26.",
                "Wilkins, J. S., 2009. <i>Species: a history of the idea, Volume\n1</i>, Berkeley: University of California Press.",
                "Williams, George C., 1966. <i>Adaptation and Natural Selection: A\nCritique of Some Current Evolutionary Thought</i>, Princeton, NJ:\nPrinceton University Press.",
                "Williams, M. B. and Rosenberg, A., 1985.\n“‘Fitness’ in fact and fiction: a rejoinder to\nSober,” <i>Journal of Philosophy</i>, 82: 738–749.",
                "Wilson, E. O., 1975. <i>Sociobiology: The New Synthesis</i>,\nCambridge, MA: Harvard University Press.",
                "–––, 1978. <i>On Human Nature</i>, Cambridge,\nMA: Harvard University Press.",
                "Wilson, R. A., 2005. <i>Genes and the agents of life: the\nindividual in the fragile sciences biology</i>, Cambridge: Cambridge University\nPress.",
                "Wilson, R. A. (ed.), 1999. <i>Species: New Interdisciplinary\nEssays</i>, Cambridge, MA: MIT Press.",
                "Wilson, R. A., Barker, M. J., &amp; Brigandt, I., 2007.\n‘When traditional essentialism fails: biological natural\nkinds.’ <i>Philosophical Topics</i>, 35(1/2):\n189–215.",
                "Wimsatt, W. C., 1972. “Teleology and the Logical Structure\nof Function Statements,” <i>Studies in History and Philosophy of\nScience</i>, 3: 1–80.",
                "–––, 1976. “Reductive Explanation: A\nFunctional Account,” in R.S. Cohen, C.A. Hooker, A.C. Michalos,\nJ.W. Van Evra (eds.), <em>PSA 1974</em> (Boston Studies in the\nPhilosophy of Science: Volume 32), Dordrecht: Springer,\n617–710. ",
                "–––, 1980a. <i>Reductionistic Research\nStrategies and Their Biases in the Units of Selection Controversy</i>,\nin T. Nickles (ed.), <i>Scientific Discovery: Case Studies</i>,\nDordrecht: D. Reidel, 213–259.",
                "–––, 1980b. “Units of Selection and the\nStructure of the Multi-Level Genome,” <i>PSA 1980</i> (Volume\n2), Chicago: University of Chicago Press, 122–183.",
                "Woodger, J. H., 1952. <i>Biology and Language: An Introduction to\nthe Methodology of the Biological Sciences including Medicine</i>,\nCambridge: Cambridge University Press.",
                "Wright, L., 1973. “Functions,” <i>Philosophical\nReview</i>, 82: 139–168."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\nRecent textbooks include Elliott Sober’s <em>Philosophy of\nBiology</em> (Sober 1999), Kim Sterelny and Paul Griffiths’s <em>Sex\nand Death: An Introduction to Philosophy of Biology</em> (1999),\nMarjorie Greene and David Depew’s <em>The Philosophy of Biology: An\nEpisodic History</em> (2004), Brian Gavey’s <em>Philosophy of\nBiology</em> (2007), Alexander Rosenberg and Daniel McShea’s\n<em>Philosophy of Biology: A contemporary introduction</em> (2008),\nand Peter Godfrey-Smith’s <em>Philosophy of Biology</em>\n(2014).Valuable edited collections designed to supplement such a text\nare Elliott Sober’s <em>Conceptual Issues in Evolutionary Biology</em>\n(Sober 2006) which collects the classic papers on core debates, David\nHull and Michael Ruse’s <em>The Philosophy of Biology</em> which aims\nat a comprehensive survey using recent papers (1998), and the\n<em>Cambridge Companion to the Philosophy of Biology</em> (Hull and\nRuse 2007), <em>The Handbook of Philosophy of Biology</em> (Matthen\nand Stephens 2007), and <em>Blackwell Companion to the Philosophy of\nBiology</em> (Sarkar and Plutynski 2008) which all consist of essays\non key topics by leading authors. </p>\n<ul class=\"hanging\">\n<li>Amundson, R., 1994. “Two concepts of constraint:\nadaptationism and the challenge from developmental biology,”\n<i>Philosophy of Science</i>, 61(4): 556–578.</li>\n<li>–––, 2005. <i>The changing rule of the embryo\nin evolutionary biology: Structure and synthesis</i>, New York:\nCambridge University Press.</li>\n<li>Ariew, A., 1999. “Innateness is Canalization”, in V.\nHardcastle (ed.) <i>Where Biology Meets Psychology</i>, Cambridge, MA:\nMIT Press.</li>\n<li>Ayala, F. J., 1976. “Biology as an autonomous\nscience,” in M. Grene, and E. Mendelsohn (eds.): <i>Boston\nStudies in Philosophy of Science XXVII</i> (Topics in Philosophy of\nBiology), 313–329.</li>\n<li>Barker, G., 2015. <i>Beyond Biofatalism: Human Nature for an\nEvolving World</i>, New York: Columbia University Press.</li>\n<li>Beatty, J., 1980. “Optimality-design and the strategy of\nmodel-building in evolutionary biology,” <i>Philosophy of\nScience</i>, 47: 532–61.</li>\n<li>Beatty, J., &amp; Finsen, S., 1989. “Rethinking the\npropensity interpretation: A peek inside Pandora’s box,”\n<i>In What the Philosophy of Biology is</i>,\nDordrecht: Springer,  17–30.</li>\n<li>Beatty, J., 1995. “The Evolutionary Contingency\nThesis,” in G. Wolters and J. Lennox (eds.), <i>Concepts,\nTheories, and Rationality in the Biological Sciences</i>, University\nof Pittsburgh Press.</li>\n<li>Bechtel, W., Mandik, P. <i>et al</i>. (eds.), 2001. <i>Philosophy\nand the Neurosciences: A Reader</i>, Oxford: Blackwell.</li>\n<li>Bechtel, W., and Richardson, R., 1993. <i>Discovering\nComplexity</i>, Princeton: Princeton University Press.</li>\n<li>Beckner, M., 1959. <i>The biological way of thought</i>, New\nYork: Columbia University Press.</li>\n<li>Beurton, P., Falk, R., and Rheinberger, H.-J. (eds.), 2000.\n<i>The Concept of the Gene in Development and Evolution</i>,\nCambridge: Cambridge University Press.</li>\n<li>Birch, J., 2017. <i>The Philosophy of Social Evolution</i>, Oxford\nUniversity Press.</li>\n<li>Boorse, C., 1976. “Wright on functions,”\n<i>Philosophical Review</i>, 85(1): 70–86.</li>\n<li>Boyd, R., 1999. “Homeostasis, species, and higher\ntaxa,” in <i>Species: New interdisciplinary essays</i>, edited\nby R. Wilson, Cambridge, MA: Bradford/MIT Press.</li>\n<li>Brandon, R. N. (ed.), 1996. <i>Concepts and Methods in\nEvolutionary Biology</i>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1997. “Does biology have laws? The\nexperimental evidence”, <i>PSA</i> 1996 (Volume 2),\n444–457.</li>\n<li>–––, 2005. “The Difference between\nSelection and Drift: A Reply to Millstein,” <i>Biology &amp;\nPhilosophy</i>, 20(1): 153–170.</li>\n<li>Brandon, R. N. and Burian, R. M. (eds.), 1984. <i>Genes,\nOrganisms, and Populations</i>, Cambridge, MA: MIT Press.</li>\n<li>Brandon, R., and M. D. Rausher, 1996. “Testing\nadaptationism: A comment on Orzack and Sober,” <i>The American\nNaturalist</i>, 148: 189–201.</li>\n<li>Brandon, R. N. and Sansom, R. (eds.), 2007. <i>Integrating\nEvolution and Development</i>, Cambridge: Cambridge University\nPress.</li>\n<li>Brennan, A., 2014. <i>Thinking about Nature (Routledge\nRevivals): An Investigation of Nature, Value and Ecology</i>, London:\nRoutledge.</li>\n<li>Buller, D. J., 2006. <i>Adapting Minds: Evolutionary Psychology\nand the Persistent Quest for Human Nature</i>, Cambridge, MA: MIT\npress.</li>\n<li>Callebaut, W., 1993. <i>Taking the Naturalistic Turn, or How Real\nPhilosophy of Science is Done</i>, Chicago: University of Chicago\nPress.</li>\n<li>Colyvan, M., Linquist, S., Grey, W., Griffiths, P. E., Odenbaugh,\nJ., &amp; Possingham, H. P., 2009. “Philosophical Issues in\nEcology: Recent Trends and Future Directions,” <i>Ecology and\nSociety</i>, 14(2): 22; \n <a href=\"https://www.ecologyandsociety.org/vol14/iss2/art22/\" target=\"other\">online\npublication</a>.</li>\n<li>Cooper, G., 2003. <i>The Science of the Struggle for Existence:\nOn the foundations of ecology</i>, Cambridge: Cambridge University\nPress.</li>\n<li>Coyne, J. A. and Orr, H. A., 2004. <i>Speciation</i>, Sunderland,\nMA: Sinauer Associates, Inc.</li>\n<li>Craver, C. F., 2007. <i>Explaining the Brain: Mechanisms and the\nMosaic Unity of Neuroscience</i>, Oxford: Oxford University\nPress.</li>\n<li>Craver, C. F., &amp; Darden, L., 2013. <i>In Search of\nMechanisms: Discoveries Across the Life Sciences</i>, Chicago: University of\nChicago Press.</li>\n<li>Currie, A., 2018. <i>Rock, bone, and ruin: An optimist’s\nguide to the historical sciences</i>, Cambridge, MA: MIT Press.</li>\n<li>Darden, L. and Maull, N., 1977. “Interfield\ntheories,” <i>Philosophy of Science</i>, 44(1):\n43–64.</li>\n<li>Dawkins, R., 1976. <i>The Selfish Gene</i>, Oxford: Oxford\nUniversity Press.</li>\n<li>Dretske, F., 1991. <i>Explaining Behavior: Reasons in a World of\nCauses</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1997. <i>Naturalizing the Mind</i>,\nCambridge, MA: MIT Press.</li>\n<li>Dupré, J. (ed.), 1987. <i>The Latest on the Best: Essays\non Optimality and Evolution</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1993. <i>The Disorder of Things:\nMetaphysical Foundations of the Disunity of Science</i>, Cambridge,\nMA: Harvard University Press.</li>\n<li>–––, 2002. “Is ‘Natural Kind’\na Natural Kind Term?“ <i>Monist</i>, 85(1): 29–49.</li>\n<li>Dussault, A. C. and F. Bouchard, 2017.\n{special-character:ldquo]A persistence enhancing propensity account of\necological function to explain ecosystem evolution,”\n<i>Synthese</i>, 194(4): 1115–1145. </li>\n<li>Ehrlich, P. and Raven, P., 1969. “Differentiation of\nPopulations,” <i>Science</i>, 165(3899):\n1228–1232.</li>\n<li>Eliot, C., 2011a. “The Legend of Order and Chaos:\nCommunities and Early Community Ecology,” in <i>Handbook of the\nPhilosophy of Ecology</i>, K. de Laplante, B. Brown, and K.\nPeacocke (eds.), Haarlem: Elsevier, 49–108.</li>\n<li>Eliot, C., 2011b. “Competition Theory and Channeling\nExplanation,” <i>Philosophy and Theory in Biology</i>, 3:\n1–16.</li>\n<li>Ereshefsky, M., 1992a. “Eliminative pluralism,”\n<i>Philosophy of Science</i>, 59(4): 671–690.</li>\n<li>–––, 1992b. <i>The Units of Evolution: Essays\non the Nature of Species</i>, Cambridge, MA: MIT Press.</li>\n<li>Fodor, J. A., 1974. “Special sciences. ”\n<i>Synthese</i>, 28: 77–115.</li>\n<li>Forber, P., 2009. “Spandrels and a Pervasive Problem of\nEvidence,” <i>Biology and Philosophy</i>, 24:\n247–266.</li>\n<li>Garson, J., 2019. <i>What Biological Functions Are and Why They\nMatter</i>, Cambridge: Cambridge University Press.</li>\n<li>Garvey, B., 2007. <i>Philosophy of Biology</i>, Stocksfield:\nAcumen.</li>\n<li>Ghiselin, M. T., 1974. “A radical solution to the species\nproblem,” <i>Systematic Zoology</i>, 23: 536–44.</li>\n<li>Ginzburg, L., and Colyvan, M., 2004. <i>Ecological Orbits: How\nplanets Move and Populations Grow</i>, Oxford and New York: Oxford\nUniversity Press.</li>\n<li>Godfrey-Smith, P., 2001a. “Three kinds of\nadaptationism,” in <i>Adaptationism and Optimality</i>, S. H.\nOrzack, and E. Sober (eds.), New York: Cambridge University Press, pp.\n335–357.</li>\n<li>–––, 2001b. “On the Theoretical Role of\n‘Genetic Coding’” <i>Philosophy of Science</i>, 67:\n26–44.</li>\n<li>Godfrey-Smith, Peter &amp; R.C. Lewontin, 1993. “The\nDimensions of Selection,” <i>Philosophy of Science</i>, 60(3):\n373–395.</li>\n<li>Godfrey-Smith, Peter &amp; Benjamin Kerr, 2002. “Group\nFitness and Multi-Level Selection: Replies to Commentaries,”\n<i>Biology and Philosophy</i>, 17(4): 539–549. </li>\n<li>Gould, S. J., and R. C. Lewontin, 1979. “The spandrels of\nSan Marco and the Panglossian paradigm: a critique of the\nadaptationist programme“, <i>Proceedings of the Royal Society\nLondon, Series B</i>, 205: 581–598.</li>\n<li>Gray, R., 1992. “Death of the Gene: Developmental Systems\nStrike Back” in P. Griffiths (ed.), <i>Trees of Life: Essays in\nthe Philosophy of Biology</i>, Dordrecht: Kluwer.</li>\n<li>Grene, Marjorie G., and David Depew, 2004. <i>The Philosophy of\nBiology: An Episodic History</i>, Cambridge: Cambridge University\nPress.</li>\n<li>Griffiths, Paul E., 1999. “Squaring the circle: Natural\nkinds with historical essences,” in <i>Species, New\ninterdisciplinary essays</i>, edited by R. A. Wilson, Cambridge, MA:\nBradford/MIT Press:209–228.</li>\n<li>Griffiths, P. E., 2001. “Genetic Information: A Metaphor in\nSearch of a Theory,” <i>Philosophy of Science</i>, 68(3):\n394–412.</li>\n<li>Griffiths, P., 2002. “What is Innateness?,”\n<i>Monist</i>, 85: 70–85.</li>\n<li>Griffiths, P. and R. Gray, 1994. “Developmental Systems and\nEvolutionary Explanation” <i>Journal of Philosophy</i>, 91:\n277–304. </li>\n<li>Griffiths, P. E. and Stotz, K., 2007. “Gene,” in M.\nRuse and D. Hull, (eds.): <i>Cambridge Companion to Philosophy of\nBiology</i>, Cambridge: Cambridge University Press, 85–102.</li>\n<li>Haber, M.H., 2008. “Phylogenetic Inference,” in A.\nTucker (ed.), <i>A Companion to Philosophy of History and\nHistoriography</i>, Malden, MA: Blackwell Publishing. </li>\n<li>Havstad, J. C., 2011. “Problems for natural selection as a\nmechanism,” <i>Philosophy of Science</i>, 78(3):\n512–523.</li>\n<li>Hempel, Carl, 1965. <i>Aspects of Scientific Explanation and Other\nEssays in the Philosophy of Science</i>, New York: The Free\nPress.</li>\n<li>Hennig, W., 1966. <i>Phylogenetic Systematics</i>, Urbana, IL:\nUniversity of Illinois Press.</li>\n<li>Hull, D. L., 1965. “The Effects of Essentialism on\nTaxonomy: 2,000 Years of Stasis,” <i>British Journal for the\nPhilosophy of Science</i>, 15: 314–326 and 16: 1–18.</li>\n<li>–––, 1970. “Contemporary systematic\nphilosophies,” <i>Annual Review of Ecology and Systematics</i>,\n1: 19–54.</li>\n<li>–––, 1974. <i>Philosophy of Biological\nScience</i>, Englewood Cliffs: Prentice-Hall.</li>\n<li>–––, 1975. “Informal Aspects of Theory\nReduction,” in Cohen, R. S. and Michalos, A. (eds.):\n<i>Proceedings of the Biennial Meeting of the Philosopy of Science\nAssociation, 1974</i>, Dordrecht: D. Reidel, 653–670. </li>\n<li>–––, 1976. “Are species really\nindividuals?” <i>Systematic zoology</i>, 25(2):\n174–191.</li>\n<li>–––, 1978. “A matter of\nindividuality.“ <i>Philosophy of science</i>, 45(3):\n335–360.</li>\n<li>–––, 1980. “Individuality and\nSelection,” <i>Annual Review of Ecology and Systematics</i>, 11:\n311–332.</li>\n<li>–––, 1986. “On human nature,” In\n<i>PSA 1986</i> (Volume 2), <i>Proceedings of the biennial meeting of the\nphilosophy of science association</i>, Philosophy of Science\nAssociation, pp. 3–13.</li>\n<li>–––, 1988. <i>Science as a Process: An\nEvolutionary Account of the Social and Conceptual Development of\nScience</i>, Chicago: University of Chicago Press.</li>\n<li>–––, 1999. “On the plurality of species:\nquestioning the party line,” in <i>Species: New\nInterdisciplinary Essays</i>, Cambridge, MA: MIT Press,\npp. 307–315.</li>\n<li>Hull, D. L. and Ruse, M. (eds.), 1998. <i>The Philosophy of\nBiology</i>, Oxford: Oxford University Press.</li>\n<li>Hull, D. L. and Ruse, M., 2007. <i>The Cambridge Companion to the\nPhilosophy of Biology</i>, New York, Cambridge University Press.</li>\n<li>Jablonka, E., 2002. “Information Interpretation,\nInheritance, and Sharing,” <i>Philosophy of Science</i>, 69(4):\n578–605.</li>\n<li>Jax, K., 2005. “Function and ‘functioning’ in\necology: what does it mean?” <i>Oikos</i>, 111(3): 641–648.</li>\n<li>Justus, J., 2008. “Ecological and Lyapunov\nstability,” <i>Philosophy of Science</i>, 75: 421–436.</li>\n<li>–––, 2012. “The elusive basis of\ninferential robustness.“ <i>Philosophy of Science</i>, 79(5):\n795–807.</li>\n<li>Kitcher, P., 1982. <i>Abusing science: The case against\ncreationism</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1984. “1953 and all that: a tale of\ntwo sciences,” <i>Philosophical Review</i>, 93:\n335–373.</li>\n<li>–––, 1984. “Species,” <i>Philosophy\nof Science</i>, 51(2): 308–333.</li>\n<li>–––, 1985. <i>Vaulting Ambition: Sociobiology\nand the Question for Human Nature</i>, Cambridge, MA:  MIT Press.</li>\n<li>–––, 1989. “Some puzzles about\nspecies,” in Michael Ruse (ed.), <i>What the Philosophy of\nBiology Is: Essays Dedicated to David Hull</i>, Dordrecht: Kluwer Academic\nPublishers, pp. 183–208.</li>\n<li>–––, 1999. “The hegemony of molecular\nbiology,” <i>Biology and Philosophy</i>, 14(2):\n195–210.</li>\n<li>Kronfeldner, M., 2018. <i>What’s left of human nature?: A\npost-essentialist, pluralist, and interactive account of a contested\nconcept</i>, Cambridge, MA: MIT Press.</li>\n<li>Levy, A., 2011. “Information in biology: A fictionalist\naccount,” <i>Noûs</i>, 45(4): 640–657.</li>\n<li>Lewens, T., 2015. <i>Cultural evolution: conceptual\nchallenges</i>, Oxford: Oxford University Press.</li>\n<li>Linquist, S., 2008. “But is it progress? On the alleged\nadvances of conservation biology over ecology,” <i>Biology and\nPhilosophy</i>, 23: 529–544.</li>\n<li>Linquist, S., Gregory, T. R., Elliott, T. A., Saylor, B., Kremer,\nS. C., &amp; Cottenie, K., 2016. “Yes! There are resilient\ngeneralizations (or ‘laws’) in ecology,” <em>The\nQuarterly Review of Biology</em>, 91(2): 119–131.</li>\n<li>Lloyd, E. A., 1988. <i>The Structure and Confirmation of\nEvolutionary Theory</i>, Westport: Greenwood Press.</li>\n<li>–––, 2005. “Why the Gene Will Not\nReturn,” <i>Philosophy of Science</i>, 72(2):\n287–310.</li>\n<li>–––, 2015. “Adaptationism and the logic\nof research questions: how to think clearly about evolutionary\ncauses.“ <i>Biological Theory</i>, 10(4): 343–362.</li>\n<li>Machamer, P., Darden, L. <i>et al</i>., 2000. “Thinking\nabout Mechanisms,” <i>Philosophy of Science</i>, 67(1):\n1–25.</li>\n<li>Machery, E., 2008. “A plea for human nature,”\n<i>Philosophical Psychology</i>, 21(3): 321–329.</li>\n<li>MacLaurin, J. and Sterelny, K., 2008. <i>What is\nBiodiversity?</i> Chicago: University of Chicago Press.</li>\n<li>Maienschein, J. and Laubichler, M. L., 2004. <i>From Embryology\nto Evo-Devo</i>, Cambridge: Cambridge University Press.</li>\n<li>Mameli, M. and Bateson, P., 2006. “Innateness and the\nSciences,” <i>Biology and Philosophy</i>, 21:\n155–188.</li>\n<li>Matthen, M., &amp; Ariew, A., 2002. “Two ways of thinking\nabout fitness and natural selection,” <i>The Journal of\nPhilosophy</i>, 99(2): 55–83.</li>\n<li>Maynard Smith, J., 2000. “The concept of information in\nbiology,” <i>Philosophy of Science</i>, 67(2):\n177–194.</li>\n<li>Maynard Smith, J., Burian, R. <i>et al</i>., 1985.\n“Developmental Constraints and Evolution,” <i>Quarterly\nReview of Biology</i>, 60(3): 265–287.</li>\n<li>Mayr, E., 1963. <i>Animal species and evolution</i>, Cambridge,\nMA: Harvard University Press.</li>\n<li>–––, 1969. “Footnotes on the Philosophy\nof Biology,” <i>Philosophy of Science</i>, 36(2):\n197–202.</li>\n<li>–––, 1982. <i>The Growth of Biological\nThought</i>, Cambridge, MA: Harvard University Press.</li>\n<li>Millikan, R. G., 1984. <i>Language, Thought and Other Biological\nCategories</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1995. <i>White queen psychology and other\nessays for Alice</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2004. <i>Varieties of meaning: the 2002\nJean Nicod lectures</i>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2005. <i>Language: A biological model</i>,\nOxford: Oxford University Press.</li>\n<li>Mills, S. and Beatty, J., 1979. “The propensity\ninterpretation of fitness,” <i>Philosophy of Science</i>, 46:\n263–286.</li>\n<li>Millstein, Roberta L., 2002. “Are Random Drift and Natural\nSelection Conceptually Distinct?” <i>Biology &amp;\nPhilosophy</i>, 17(1): 33–53.</li>\n<li>–––, 2005. “Selection Vs. Drift: A\nResponse to Brandon’s Reply,” <i>Biology &amp;\nPhilosophy</i>, 20(1): 171–175. </li>\n<li>–––, 2007. “Distinguishing drift and\nselection empirically: ‘The Great Snail Debate’ of the\n1950s,” <i>Journal of the History of Biology</i>, 41:\n339–367.</li>\n<li>Mishler, B. D., &amp; Brandon, R. N., 1987. “Individuality,\npluralism, and the phylogenetic species concept,” <i>Biology and\nPhilosophy</i>, 2(4): 397–414.</li>\n<li>Mitchell, S. D., 1997. “Pragmatic laws,”\n<i>Philosophy of Science</i>, 64: S468–S479.</li>\n<li>–––, 2000. “Dimensions of scientific\nlaws,” <i>Philosophy of Science</i>, 67: 242–265.</li>\n<li>Nagel, Ernest, 1961. <i>The Structure of Science: Problems in the\nLogic of Scientific Explanation</i>, New York: Harcourt, Brace &amp;\nWorld.</li>\n<li>Neander, K., 1991. “Functions as selected effects: the\nconceptual analyst’s defense,” <i>Philosophy of Science</i>, 58:\n168–184.</li>\n<li>–––, 2017. <i>A mark of the mental: In defense\nof informational teleosemantics</i>, Cambridge, MA: MIT Press.</li>\n<li>Nunes-Neto, N., A. Moreno, and C. N. El-Hani, 2014.\n“Function in ecology: an organizational approach,”\n<i>Biology &amp; Philosophy</i>, 29(1): 123–141.</li>\n<li>O’Connor, C., 2019. <i>The Origins of Unfairness: Social\nCategories and Cultural Evolution</i>, Oxford: Oxford University Press.</li>\n<li>O’Malley, M., 2014. <i>Philosophy of microbiology</i>,\nCambridge: Cambridge University Press.</li>\n<li>Odenbaugh, J., 2001. “Ecology, stability, model building and\nenvironmental policy: a reply to some of the pessimism,”\n<i>Philosophy of Science</i>, 68: S493–S505.</li>\n<li>–––, 2003. “Complex systems, trade-offs,\nand theoretical population biology: Richard Levin’s ‘strategy of\nmodel building in population biology’ revisited,”\n<em>Philosophy of Science</em>, 70(5): 1496–1507.</li>\n<li>–––, 2005. “Idealized, inaccurate but\nsuccessful: A pragmatic approach to evaluating models in theoretical\necology,” <i>Biology and Philosophy</i>, 20(2-3):\n231–255.</li>\n<li>–––, 2007. “Seeing the forest and the\ntrees,” <i>Philosophy of Science</i>, 74: 628–641.</li>\n<li>–––, 2010. “On the very idea of an\necosystem,” in <i>New waves in metaphysics</i>, A. Hazlett\n(ed.), London: Palgrave, pp.  240–258.</li>\n<li>Okasha, S., 2002. “Darwinian metaphysics: Species and the\nquestion of essentialism,” <i>Synthese</i>, 131(2):\n191–213.</li>\n<li>–––, 2007. <i>Evolution and the Levels of\nSelection</i>, New York and Oxford: Oxford University Press.</li>\n<li>Orzack, S. H., and E. Sober, 1994. “Optimality models and\nthe test of adaptationism,” <i>The American Naturalist</i>, 143:\n361–380.</li>\n<li>–––, 2001. <i>Optimality and Adaptation</i>,\nCambridge: Cambridge University Press.</li>\n<li>Oyama, S., 2000. <i>The Ontogeny of Information, 2nd Edition</i>,\nDuke University Press.</li>\n<li>–––, 2000. <i>Evolution’s Eye</i>, Duke\nUniversity Press.</li>\n<li>Oyama, S., P. Griffiths and R. Gray (eds.), 2001. <i>Cycles of\nContingency</i>, Cambridge, MA: MIT Press.</li>\n<li>Papineau, David, 1987. <i>Reality and Representation</i>,\nBlackwell.</li>\n<li>–––, 1993. <i>Philosophical naturalism</i>,\nBlackwell.</li>\n<li>Pence, C. H., &amp; Ramsey, G., 2013. “A new foundation for\nthe propensity interpretation of fitness,” <i>The British\nJournal for the Philosophy of Science</i>, 64(4): 851–881.</li>\n<li>Pigliucci, M. and Kaplan, J. M., 2006. <i>Making Sense of\nEvolution: The Conceptual Foundations of Evolutionary Theory</i>,\nChicago: University of Chicago Press.</li>\n<li>Pittendrigh, C. S., 1958. “Adaptation, natural selection\nand behavior,” <i>Behavior and Evolution</i>, in A. Roe and G.\nG. Simpson (eds.), New Haven: Yale University\nPress, 390–416.</li>\n<li>Plutynski, A., 2018. <i>Explaining cancer: Finding order in\ndisorder</i>, Oxford: Oxford  University Press.</li>\n<li>Polger, T. W., &amp; Shapiro, L. A., 2016. <i>The multiple\nrealization book</i>, Oxford: Oxford University Press.</li>\n<li>Potochnik, A., 2009. “Optimality modeling in a suboptimal\nworld,” <i>Biology and Philosophy</i>, 24: 183–197.</li>\n<li>Ramsey, G., 2013. “Human nature in a post-essentialist\nworld,” <i>Philosophy of Science</i>, 80(5): 983–993.\nChicago</li>\n<li>Richardson, R. C., 2010. <i>Evolutionary psychology as\nmaladapted psychology</i>, Cambridge, MA: MIT Press.</li>\n<li>Robert, J. S., 2004. <i>Embryology, Epigenesis and Evolution:\nTaking Development Seriously</i>, Cambridge and New York: Cambridge\nUniversity Press.</li>\n<li>Rosenberg, A., 1978. “The supervenience of biological\nconcepts,” <i>Philosophy of Science</i>, 45: 368–386.</li>\n<li>–––, 1983. “Fitness,” <i>Journal of\nPhilosophy</i>, 80: 457–473.</li>\n<li>–––, 1997. “Reductionism redux: computing\nthe embryo,” <i>Biology and Philosophy</i>, 12(4):\n445”470.</li>\n<li>–––, 2008. <i>Darwinian reductionism: Or, how\nto stop worrying and love molecular biology</i>, Chicago: University\nof Chicago Press.</li>\n<li>Rosenberg, A. and McShea, D. W., 2008. <i>Philosophy of Biology:\nA contemporary introduction</i>, New York and London: Routledge.</li>\n<li>Ruse, M., 1982. <i>Darwinism Defended</i>, Addison-Wesley.</li>\n<li>–––, 1988. <i>Philosophy of biology today</i>,\nSUNY Press.</li>\n<li>Santana, C.,, 2014. “Save the planet: Eliminate\nbiodiversity,” <i>Biology &amp; Philosophy</i>, 29(6):\n761–780.</li>\n<li>Sarkar, S., 1992. “Models of reduction and categories of\nreductionism,” <i>Synthese</i>, 91: 167–94.</li>\n<li>–––, 1996. “Biological information: A\nsceptical look at some central dogmas of molecular biology,” in\nSarkar, S. (ed.),  <i>The Philosophy and History of Molecular Biology:\nNew Perspectives</i> (Boston Studies in the Philosophy of Science\n183), Dordrecht and Boston: Kluwer Academic, 187–232.</li>\n<li>–––, 1998. <i>Genetics and Reductionism</i>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2005. <i>Biodiversity and Environmental\nPhilosophy: An Introduction</i>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2007. <i>Doubting Darwin?: Creationist\ndesigns on evolution</i>, Malden, MA: Blackwell Publishing.</li>\n<li>–––, 2011. “Drift and the Causes of\nEvolution,” in P. McKay Illari, F. Russo and J. Williamson\n(eds.) <i>Causality in the Sciences</i>, Oxford: Oxford University\nPress, 445–469.</li>\n<li>Sarkar, S. and Plutynski, A., 2008. <i>A Companion to the\nPhilosophy of Biology</i>, Oxford: Blackwell.</li>\n<li>Schaffner, K. F., 1967a. <i>Antireductionism and Molecular\nBiology</i>, in Munson, R. (ed.) <i>Man and Nature: Philosophical\nIssues in Biology</i>, New York: Dell, 44–54.</li>\n<li>–––, 1967b. “Approaches to\nReduction,” <i>Philosophy of Science</i>, 34: 137–47.</li>\n<li>–––, 1969. “The Watson-Crick model and\nreductionism,” <i>British Journal for the Philosophy of\nScience</i>, 20: 325–48.</li>\n<li>–––, 1993. <i>Discovery and Explanation in\nBiology and Medicine</i>, Chicago and London: University of Chicago\nPress.</li>\n<li>Segerstråle, U. C. O., 2000. <i>Defenders of the truth: The\nbattle for science in the sociology debate and beyond</i>, Oxford:\nOxford University Press.</li>\n<li>Shea, N., 2007. “Representation in the genome and in other\ninheritance systems”, <i>Biology and Philosophy</i>, 22(3):\n313–331.</li>\n<li>Shrader-Frechette, K. S. and McCoy, E. D., 1993. <i>Method in\nEcology: Strategies for Conservation</i>, Cambridge and New York:\nCambridge University Press.</li>\n<li>Skipper Jr, R. A., &amp; Millstein, R. L., 2005. “Thinking\nabout evolutionary mechanisms: Natural selection,” <i>Studies in\nHistory and Philosophy of Science Part C: Studies in History and\nPhilosophy of Biological and Biomedical Sciences</i>, 36(2):\n327–347.</li>\n<li>Smart, J. J. C., 1959. “Can biology be an exact\nscience?” <i>Synthese</i>, 11(4): 359–368.</li>\n<li>Sober, E., 1984a. “Fact, fiction and fitness: a reply to\nRosenberg,” <i>Journal of Philosophy</i>, 81:\n372–383.</li>\n<li>–––, 1984b. <i>The Nature of Selection:\nEvolutionary Theory in Philosophical Focus</i>, Cambridge,\nMA: MIT Press.</li>\n<li>–––, 1988. <i>Reconstructing the Past:\nParsimony, Evolution and Inference</i>, Cambridge, MA: MIT\nPress.</li>\n<li>–––, 1997. “Two Outbreaks of Lawlessness\nin Recent Philosophy of Science,” <i>Philosophy of Science</i>\n2: 458–467.</li>\n<li>–––, 1999. <i>Philosophy of Biology</i>,\nBoulder and Oxford: Westview Press.</li>\n<li>–––, 2001. “The Two Faces of\nFitness,” in R. Singh, D. Paul, C. Krimbas, and J. Beatty\n(eds.), <i>Thinking about Evolution: Historical, Philosophical, and\nPolitical Perspectives</i> (Volume 2), Cambridge: Cambridge University Press,\npp. 309–321.</li>\n<li>–––, 2004. “The Contest between Parsimony\nand Likelihood,” <i>Systematic Biology</i>, 53:\n644–53.</li>\n<li>Sober, E., (ed.), 2006. <i>Conceptual Issues in Evolutionary\nBiology</i>, Cambridge, MA: MIT Press.</li>\n<li>Sober, E. and Wilson, D. S., 1998. <i>Unto Others: The Evolution\nand Psychology of Unselfish Behavior</i>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Sokal, R. R. and T. J. Crovello, 1970. “The biological\nspecies concept: a critical evaluation,” <i>The American\nNaturalist</i>, 104 (936): 127–153.</li>\n<li>Sterelny, K., 2006. “Local ecological communities,”\n<i>Philosophy of Science</i>, 73: 215–231.</li>\n<li>–––, 2012. <i>The evolved apprentice</i>, MIT\nPress.</li>\n<li>Sterelny, K. and Griffiths, P. E., 1999. <i>Sex and Death: An\nIntroduction to the Philosophy of Biology</i>, Chicago: University of\nChicago Press.</li>\n<li>Sterelny, K., K. Smith, and M. Dickison, 1996. “The\nextended replicator,” <i>Biology and Philosophy</i>, 11:\n377–403.</li>\n<li>Sterelny, K., &amp; Kitcher, P., 1988. “The return of the\ngene,” <i>The Journal of Philosophy</i>, 85(7):\n339–361.</li>\n<li>Stotz, K. and Griffiths, P. E., 2008. “Biohumanities:\nRethinking the relationship between biosciences, philosophy and\nhistory of science, and society,” <i>Quarterly Review of\nBiology</i>, 83(1): 37–45.</li>\n<li>Thompson, P., 1988. <i>The structure of biological theories</i>,\nAlbany, NY: SUNY Press.</li>\n<li>Turner, D., 2011. <i>Paleontology: a philosophical\nintroduction</i>, Cambridge: Cambridge University Press.</li>\n<li>Van Valen, L., 1976. “Ecological species, multispecies, and\noaks,” <i>Taxon</i>, 25(2–3): 233–239.</li>\n<li>Walsh, Denis, 2006. “Evolutionary\nEssentialism,” <i>British Journal for the Philosophy of\nScience</i>, 57(2): 425–448.</li>\n<li>Walsh, D. M., Lewens, T., &amp; Ariew, A., 2002. “The\ntrials of life: Natural selection and random drift,”\n<i>Philosophy of Science</i>, 69(3): 429–446.</li>\n<li>Waters, C. K., 1990. <i>Why the Antireductionist Consensus Won’t\nSurvive the Case of Classical Mendelian Genetics</i>, in A. Fine, M.\nForbes and L. Wessells (eds.), <i>Proceedings of the Biennial Meeting\nof the Philosophy of Science Association</i> (Volume 1: Contributed\nPapers), Chicago: University of Chicago Press, 125–139.</li>\n<li>–––, 1994. “Genes made molecular,”\n<i>Philosophy of Science</i>, 61: 163–185.</li>\n<li>–––, 1998. “Causal Regularities in the\nBiological World of Contingent Distributions,” <i>Biology and\nPhilosophy</i>, 13: 5–36. </li>\n<li>–––, 2000. “Molecules made\nbiological,” <i>Revue internationale de philosophie</i>,\n54(214/4): 539–564.</li>\n<li>–––, 2004. “What was classical\ngenetics?,” <i>Studies in History and Philosophy of Science</i>\n(Part A), 35(4): 783–809.</li>\n<li>–––, 2005. “Why Genic and Multilevel\nSelection Theories Are Here to Stay,” <i>Philosophy of\nScience</i>, 72(2): 311–333.</li>\n<li>Weisberg, M., 2012. <i>Simulation and similarity: Using models to\nunderstand the world</i>, Oxford: Oxford University Press.</li>\n<li>Weisberg, M., &amp; Reisman, K., 2008. “The robust Volterra\nprinciple,” <i>Philosophy of science</i>, 75(1):\n106–131.</li>\n<li>Wiley, E. O., 1978. “The evolutionary species concept\nreconsidered,” <i>Systematic Biology</i>, 27(1):\n17–26.</li>\n<li>Wilkins, J. S., 2009. <i>Species: a history of the idea, Volume\n1</i>, Berkeley: University of California Press.</li>\n<li>Williams, George C., 1966. <i>Adaptation and Natural Selection: A\nCritique of Some Current Evolutionary Thought</i>, Princeton, NJ:\nPrinceton University Press.</li>\n<li>Williams, M. B. and Rosenberg, A., 1985.\n“‘Fitness’ in fact and fiction: a rejoinder to\nSober,” <i>Journal of Philosophy</i>, 82: 738–749.</li>\n<li>Wilson, E. O., 1975. <i>Sociobiology: The New Synthesis</i>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1978. <i>On Human Nature</i>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Wilson, R. A., 2005. <i>Genes and the agents of life: the\nindividual in the fragile sciences biology</i>, Cambridge: Cambridge University\nPress.</li>\n<li>Wilson, R. A. (ed.), 1999. <i>Species: New Interdisciplinary\nEssays</i>, Cambridge, MA: MIT Press.</li>\n<li>Wilson, R. A., Barker, M. J., &amp; Brigandt, I., 2007.\n‘When traditional essentialism fails: biological natural\nkinds.’ <i>Philosophical Topics</i>, 35(1/2):\n189–215.</li>\n<li>Wimsatt, W. C., 1972. “Teleology and the Logical Structure\nof Function Statements,” <i>Studies in History and Philosophy of\nScience</i>, 3: 1–80.</li>\n<li>–––, 1976. “Reductive Explanation: A\nFunctional Account,” in R.S. Cohen, C.A. Hooker, A.C. Michalos,\nJ.W. Van Evra (eds.), <em>PSA 1974</em> (Boston Studies in the\nPhilosophy of Science: Volume 32), Dordrecht: Springer,\n617–710. </li>\n<li>–––, 1980a. <i>Reductionistic Research\nStrategies and Their Biases in the Units of Selection Controversy</i>,\nin T. Nickles (ed.), <i>Scientific Discovery: Case Studies</i>,\nDordrecht: D. Reidel, 213–259.</li>\n<li>–––, 1980b. “Units of Selection and the\nStructure of the Multi-Level Genome,” <i>PSA 1980</i> (Volume\n2), Chicago: University of Chicago Press, 122–183.</li>\n<li>Woodger, J. H., 1952. <i>Biology and Language: An Introduction to\nthe Methodology of the Biological Sciences including Medicine</i>,\nCambridge: Cambridge University Press.</li>\n<li>Wright, L., 1973. “Functions,” <i>Philosophical\nReview</i>, 82: 139–168.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "adaptationism",
            "altruism: biological",
            "biocomplexity",
            "biological development: theories of",
            "biological individuals",
            "biology: philosophy of",
            "character-trait",
            "conservation biology",
            "creationism",
            "Darwinism",
            "developmental biology",
            "developmental biology: evolution and development",
            "ecology",
            "ecology: biodiversity",
            "evolution",
            "evolution: concept before Darwin",
            "evolution: cultural",
            "evolution: from the Origin of Species to the Descent of Man",
            "fitness",
            "gene",
            "genetics",
            "genetics: ecological",
            "genetics: genotype/phenotype distinction",
            "genetics: molecular",
            "genetics: population",
            "heritability",
            "human genome project",
            "immunology, philosophy of",
            "information: biological",
            "innate/acquired distinction",
            "life",
            "molecular biology",
            "natural selection",
            "natural selection: units and levels of",
            "neuroscience, philosophy of",
            "psychology: evolutionary",
            "reduction, scientific: in biology",
            "replication and reproduction",
            "sociobiology",
            "species",
            "teleology: teleological notions in biology"
        ],
        "entry_link": [
            {
                "../adaptationism/": "adaptationism"
            },
            {
                "../altruism-biological/": "altruism: biological"
            },
            {
                "../theories-biological-development/": "biological development: theories of"
            },
            {
                "../biology-individual/": "biological individuals"
            },
            {
                "../biology-philosophy/": "biology: philosophy of"
            },
            {
                "../conservation-biology/": "conservation biology"
            },
            {
                "../creationism/": "creationism"
            },
            {
                "../darwinism/": "Darwinism"
            },
            {
                "../biology-developmental/": "developmental biology"
            },
            {
                "../evolution-development/": "developmental biology: evolution and development"
            },
            {
                "../ecology/": "ecology"
            },
            {
                "../biodiversity/": "ecology: biodiversity"
            },
            {
                "../evolution/": "evolution"
            },
            {
                "../evolution-before-darwin/": "evolution: concept before Darwin"
            },
            {
                "../evolution-cultural/": "evolution: cultural"
            },
            {
                "../origin-descent/": "evolution: from the Origin of Species to the Descent of Man"
            },
            {
                "../fitness/": "fitness"
            },
            {
                "../gene/": "gene"
            },
            {
                "../genetics/": "genetics"
            },
            {
                "../ecological-genetics/": "genetics: ecological"
            },
            {
                "../genotype-phenotype/": "genetics: genotype/phenotype distinction"
            },
            {
                "../molecular-genetics/": "genetics: molecular"
            },
            {
                "../population-genetics/": "genetics: population"
            },
            {
                "../heredity/": "heritability"
            },
            {
                "../human-genome/": "human genome project"
            },
            {
                "../immunology/": "immunology, philosophy of"
            },
            {
                "../information-biological/": "information: biological"
            },
            {
                "../innate-acquired/": "innate/acquired distinction"
            },
            {
                "../life/": "life"
            },
            {
                "../molecular-biology/": "molecular biology"
            },
            {
                "../natural-selection/": "natural selection"
            },
            {
                "../selection-units/": "natural selection: units and levels of"
            },
            {
                "../neuroscience/": "neuroscience, philosophy of"
            },
            {
                "../evolutionary-psychology/": "psychology: evolutionary"
            },
            {
                "../reduction-biology/": "reduction, scientific: in biology"
            },
            {
                "../replication/": "replication and reproduction"
            },
            {
                "../sociobiology/": "sociobiology"
            },
            {
                "../species/": "species"
            },
            {
                "../teleology-biology/": "teleology: teleological notions in biology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=biology-philosophy\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/biology-philosophy/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=biology-philosophy&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/biology-philosophy/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=biology-philosophy": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/biology-philosophy/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=biology-philosophy&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/biology-philosophy/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.ishpssb.org/\" target=\"other\">International Society for the History, Philosophy and Social Studies of Biology</a>",
            "<a href=\"http://www.representinggenes.org/biohumanities/podcasts/\" target=\"other\">Biohumanities Podcasts</a>",
            "<a href=\"http://darwin-online.org.uk/\" target=\"other\">The Complete Works of Charles Darwin Online</a>",
            "<a href=\"http://8e.devbio.com/\" target=\"other\">Online resources for Scott Gilbert’s <em>Developmental Biology</em></a>,\n contains fascinating essays on the history and philosophy of biology\nand bioethics."
        ],
        "listed_links": [
            {
                "http://www.ishpssb.org/": "International Society for the History, Philosophy and Social Studies of Biology"
            },
            {
                "http://www.representinggenes.org/biohumanities/podcasts/": "Biohumanities Podcasts"
            },
            {
                "http://darwin-online.org.uk/": "The Complete Works of Charles Darwin Online"
            },
            {
                "http://8e.devbio.com/": "Online resources for Scott Gilbert’s Developmental Biology"
            }
        ]
    }
}