{
    "url": "buddhism-chan",
    "title": "Chan Buddhism",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Peter Hershock\n<HershocP@EastWestCenter.org>",
        "author_links": [
            {
                "mailto:HershocP%40EastWestCenter%2eorg": "HershocP@EastWestCenter.org"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nPeter Hershock\n&lt;<a href=\"mailto:HershocP%40EastWestCenter%2eorg\"><em>HershocP<abbr title=\" at \">@</abbr>EastWestCenter<abbr title=\" dot \">.</abbr>org</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Apr 1, 2015",
        "substantive revision Sat Mar 2, 2019"
    ],
    "preamble": "\n\nThe Chan School (Chan zong, 禪宗) is an\nindigenous form of Chinese Buddhism that developed beginning in the\nsixth century CE and subsequently spread to the rest of East Asia\n(Japanese: Zen; Korean: Sôn; Vietnamese; Thiền). Although\nthe Sinograph “chan” (禪) transliterates the\nSanskrit dhyāna or “meditation”, and\nChan zong can thus be translated as the “Meditation\nSchool”, Chan was not distinctive within Chinese Buddhism in its\nuse of meditative techniques. What distinguished Chan were its novel\nuse of language, its development of new narrative forms, and its\nvalorization of the direct and embodied realization of Buddhist\nawakening. In contrast with the epistemic, hermeneutical and\nmetaphysical concerns that shaped other schools of Chinese Buddhism,\nChan’s defining concerns were experiential and\nrelational—concerns that fit most comfortably, perhaps, within\nthe horizons of philosophical anthropology. Appreciating the\nphilosophical dimensions of Chan thus requires some familiarity with\nBuddhist thought and practice, and the dynamics of their infusion into\nChinese culture.\n",
    "toc": [
        {
            "#Int": "1. Introduction"
        },
        {
            "#His": "2. History"
        },
        {
            "#ChaNatRea": "3. Chan and the Nature of Reality"
        },
        {
            "#TruNatKnoLanCha": "4. Truth and the Nature of Knowledge and Language in Chan"
        },
        {
            "#EthDimCha": "5. Ethical Dimensions of Chan"
        },
        {
            "#Con": "6. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nBuddhist thought and practice are said to have emerged out of\nsustained practical commitment to discovering and nullifying the roots\nof human suffering. Canonical accounts of the liberation of\nBuddhism’s founding figure, Siddhartha Gautama, make it clear\nthat becoming one awakened (buddha) to the origins and ending\nof suffering was not a process of rational distillation, but rather of\none of embodied conduct (see, e.g., Majjhima Nikāya 26).\nThe pivotal insights afforded by such conduct are, first, that all\nthings arise and pass away in dynamic interdependence\n(paticca-samuppāda), and, secondly, that conflict and\nsuffering (dukkha) are relational distortions marking the\ntroubling inflection of interdependence as a function of ignorance\n(avijjā); corporeal, perceptual, cognitive, and\nemotional habits (sankhāra); and craving forms of desire\n(tanhā).\n\nChan Buddhism developed in China as a radical reaffirmation of the\nprimacy of embodied practice, the signal achievement of which came to\nbe envisioned as unwavering attentiveness and responsive virtuosity.\nIn the words of the founder of the Hongzhou lineage of Chan, Mazu\nDaoyi (709–788), the fruition of Chan practice is a fluid\n\n\nharmony of body and mind that reaches out through all four\nlimbs…benefiting what cannot be benefited and doing what\ncan’t be done. (Xu zangjing, Vol. 119, 408b)\n\n\nBuilding on the prevalent Chinese Buddhist conviction that all beings\nhave/are Buddha-nature (fo-xing, 佛性), however,\npractice was not advocated in Chan as a means to\nenlightenment, but rather as the meaning of demonstrating it.\nIt is only in denial or ignorance of our own true nature that\nenlightenment can be regarded as something to seek, a destination at\nwhich we might one day arrive.\n\nIn sharp contrast with more scholastically-inclined schools of\nBuddhism, Chan did not see dispelling ignorance of our own true nature\nas something to be accomplished by studying canonical texts and\ncommentaries. On the contrary, in keeping with the Buddha’s\nclaim that the wise “do not hang onto anything, anywhere”\nand “do not enter into the mud of conceptual thinking”\n(Sabhiya Sutta, Sutta Nipāta III.6), Chan came\nto insist that we cannot read or reason our way out of conflict,\ntrouble and suffering. And, in contrast with more ritually-defined\nschools of Buddhism, Chan also came to deny the merit of seeking help\nfrom supramundane sources. Dispelling ignorance of our own\nBuddha-nature does not involve cultivating or acquiring anything; we\nneed only end the relational paralysis that prevents us from\nconducting ourselves as enlightening beings. This does not\nrequire special conditions or implements. It does not require\nextensive study or training. It can be accomplished here and now, in\nthe midst of our own day-to-day lives.\n\nThis description might suggest that Chan originated in and actively\npropagated what could easily be viewed as anti-philosophical\nsentiments—a view arguably supported by the apparent illogic of\nmany of the “encounter dialogues” that purported to record\nthe interactions of Chan masters and their students, and by the\nfour-fold phrasing that came to be used in Song dynasty China to\ncharacterize Chan distinctiveness:\n\n\na special transmission outside the scriptures (jiaowai\nbiechuan, 教外別傳); not established upon\nwords and letters (buli wenzi,\n不立文字); directly pointing to the human\nheartmind (zhizhi renxin, 直指人心);\nseeing nature and becoming a Buddha (jianxing chengfo,\n見性成佛).\n\n\nIn both, there are appeals to the importance of immediacy, rather than\nreflection, and assertions about the limits of language and the\nultimate irrelevance of thinking to the realization of truth. Indeed,\nthe Sixth Chan Patriarch, Huineng (638–713), famously proclaimed\nthat throughout Buddhist history, those transmitting the true Dharma\nestablished “without-thinking” (wunian,\n無念) as the core doctrine. For many of those involved in\nthe first generation of “globalizing” Chan and Zen in the\nfirst half of the twentieth century, Chan’s apparent\nanti-rationality was central to its promotion as a distinctively East\nAsian humanism and an antidote to heartless and humorless\nscientism.\n\nIt is, however, possible to view Chan differently. The body of Chan\nliterature is ironically perhaps the most voluminous of any in Chinese\nBuddhism. And while one would be hard-pressed to find therein\narguments of the kind that are now widely regarded as essential tools\nof the (especially analytic) philosophical trade, it is a body of\nliterature that I think can be very productively be engaged as\nenacting insights and inferences of considerable\nphilosophical significance—a body of philosophical evidence\nrather than exposition and explanation.\n\nA major difficulty in attempting to engage philosophical perspectives\noriginating from beyond the horizons of European and American\ntraditions is the tendency to assume default status for Western\nphilosophical categories and questions. This leads, for example, to\nexpending considerable energy considering whether Confucian or\nBuddhist ethics are best seen as species of consequentialism,\ndeontology or virtue ethics, rather than trying to understand them as\nmuch as possible in their own terms. Doing so risks overwriting the\nphilosophical distinctiveness of so-called “non-Western”\ntraditions and tacitly justifying the continued definition of academic\nphilosophy in terms of exclusively Western defaults. Being aware of\nthese risks, however, I think it is nevertheless possible to make\nprovisional use of Western categories to initiate exploration of\nphilosophical terrains shaped by very different forces than those with\nwhich we are most familiar. That, at least, is the approach taken here\nwith the aim of making it easier for students and teachers of\nphilosophy to find some places from which they might enter into\nproductive dialogue with Chan.\n2. History\n\nChan coalesced over the course of several centuries of sustained and\nreflexive engagement with the meaning of being both Chinese and\nBuddhist. That is, it took shape over the period from roughly 500 to\n1000 CE in the context of negotiations taking place within what the\nanthropologist James Clifford (1988) has referred to as the\n“predicament of culture”—the feeling of pervasive\noff-centeredness that occurs when we are confronted with an\nunavoidable and unprecedented overlay of distinct meaning systems and\ncompelled to choose among or reconcile different and often contrary\nsources of personal and cultural identity.\n\nBuddhism first entered China in the latter part of the Han dynasty\n(206 BCE to 220 CE) along with growing trans-Eurasian trade. Early\nrecords of Buddhist presence in China depict the arrival of this\nforeign religion as at once intriguing and unsettling—a\nconfrontation with cultural difference, not as an objectively\nobservable fact, but as a subjectively troubling experience of failing\ncommon sense (Sakai 1997). Monastic Buddhist missionaries were visibly\nalien with their monochrome robes, their shaved heads and eyebrows,\nand their restricted diets. Along with strikingly novel votive statues\nand paintings—the first term for Buddhism was, in fact, the\n“teaching of the images” (xiangjiao)—they\nbrought with them new meditative techniques, new ritual technologies,\nand, most importantly, new forms of writing.\n\nSince very early times in China, writing had been understood as\nintimately tied to spiritual, political and cultural authority (Lewis\n1999)—an association manifest in the Chinese term for culture\n(wenhua, 文化), which combines characters for\nliterature (文) and transformation (化). The arrival of\nBuddhist texts were evidence that there were peoples in “the\nWest” who, unlike any other peoples the Chinese had encountered,\nnot only had their own customs, but also their own literary culture\nand thus their own claims to authority. Buddhist texts held out the\npromise of alternative ways of understanding the world and the place\nof humanity in it, but also new forms of subjectivity and imagination,\nnew personal ideals, and new visions of the interrelatedness of the\nspiritual and the political.\n\nBuddhist practices of meditative discipline, image worship and ritual\ndevotion spread rapidly through Chinese society in the period of\ndisunity after the fall of the Han dynasty. By the early fourth\ncentury, for example, regular, multi-week Buddhist retreats of up to\n5,000 people were being held, and by the sixth century over two\nmillion people—roughly one out of every twenty-five people in\nChina—were ordained as monks and nuns. Buddhism played crucial\nroles in the unification of nomadic peoples under the Northern Wei\n(386–534) and in the eventual restoration of the Chinese empire\nwith the founding of the Sui dynasty (581–618). A sense of the\nimportance of Buddhism in shaping the political and cultural\nimaginaire of medieval China can be gleaned by considering\nthe investment needed to build the monumental cave complexes at\nYungang Grottoes and Longmen Grottoes—each with tens of\nthousands of Buddhist images carved out of live rock, some as large as\nsixty feet in height with faces originally clad in gold.\n\nBut it was through collaborative projects of translation and textual\nexegesis that Buddhism came to be woven so thoroughly into the fabric\nof Chinese culture that the emperor of Song China, Song Xiaozong (r.\n1162–89), would compare the three teachings of Confucianism,\nDaoism and Buddhism to the legs of a bronze ding: a\nceremonial vessel associated with political unity and power and\ncultural authority that would be useless if any one of the three were\nto be removed. Indian and Central Asian Buddhist texts offered new\nvisions of the cosmos, new narrative structures, and new concepts that\nmade obvious the boundaries and biases of Chinese literary and\nphilosophical thought and practice. Engaging these texts required\nimprovising linguistic and conceptual bridges, but ultimately also\nbuilding new kinds of cultural consciousness and identity.\n\nAt the time that the great Central Asian translator,\nKumārajīva (334–413), was working with a multi-ethnic\ntranslation team in the Chinese capital of Chang’an (a city of\nbetween 300,000 and 500,000 people at the time), Buddhism had\nundergone nearly a thousand years of adaptive evolution and several\nhundred texts were catalogued as part of the Buddhist canon. By the\nseventh century, that number had grown to over a thousand. These texts\nall purported to be authentic renderings of Buddhist teaching. But in\nactuality they often had quite disparate historical and cultural\norigins, and this presented Chinese Buddhist scholars with immense\nhermeneutical challenges. Drawing on evidence internal to key Buddhist\nscriptures, different systems were devised for classifying and ranking\nBuddhist teachings and texts, and these became the basis of competing,\ntextually-defined schools of Buddhism, the foremost being the\nConsciousness-Only (Weishizong, 唯識宗),\nTiantai or Heavenly Terrace (Tiantai zong,\n天台宗 ), Pure Land (Jingtu zong,\n淨土宗) and Huayan or Flower Ornament (Huayan\nzong, 華嚴宗) schools.\n\nChan traces its origins to a radical break from this scholastic\napproach—an explicit rejection of the ultimate authority of\nwriting combined with an insistence that authentic Buddhist teachings\nare not to be found in books or memorized liturgies but only in the\nimmediate, face-to-face encounters of Buddhist masters and their\nstudents. The iconic precedent for this break is the moment of\ntransmission said to have occurred when, in the middle of preaching to\na gathering of some 10,000 people on Vulture Peak, the Buddha held up\na single flower and elicited a smile of shared realization from his\ndisciple, Mahākāśyapa. Nearly a thousand years later,\nthe purported 28th lineage holder in this line of direct\ntransmission—an Indian monk named Bodhidharma—is said to\nhave arrived in southeast China by sea, made his way to north China,\nand eventually offered the “skin”, “flesh”,\n“bone” and “marrow” of his teaching to his\nfour closest disciples, one of whom, Huike (487–593), came to be\nregarded as the second Chan Patriarch in China.\n\nThis account of Chan origins was well-established by the tenth\ncentury, and its rudiments were already circulating by the late\n6th and early 7th centuries. Contemporary\nscholars now regard this account and much of what Chan eventually came\nto regard as the particulars of its own history as inventions of\ntradition (see, e.g., McRae 2003 and Faure 1991). But for present\npurposes, the traditional story of Chan’s origins affords a\nuseful way of introducing the philosophical concerns that shaped the\nconsolidation of Chan identity.\n\nIn the earliest strata of texts reliably attributed to Bodhidharma and\nother early Chan teachers (see Broughton 1999), we find Bodhidharma\nclaiming that there are two points of entry to Buddhism: via\nli (理), an “informing impetus” or\n“principle”; and via xing (行),\n“practice”. Entry by li consists in realizing\nthat all sentient beings have the same true nature; entry by\nxing consists in making good on wrongs done; corresponding\nwith conditions; seeking nothing; and acting in accordance with the\nrealization that all beings have the same true nature. Buddhist truth,\nin other words, is not something attained through practice,\nbut rather an aspect and achievement of it. Moreover,\nBodhidharma affirms that this is possible anywhere, whether one is\nwalking, lying down, sitting or standing. Successful Buddhist practice\nis not based on being in some specific place or posture. Neither is it\ndependent on textual study. In fact, it is claimed that whoever\nobtains understanding through reading will have weak vital energy\n(qi, 氣) and that to have the energy needed to truly\nenact the Buddhist path one must obtain understanding in the medium of\ncircumstances and events by never losing mindfulness anywhere.\n\nThese claims eventually become conventional elements of Chan identity.\nBut they were profoundly iconoclastic given Chinese associations of\nwriting with authority and the institutional ramifications of Buddhist\nscholasticism. They were also philosophically pregnant claims when\nseen in the light of the hermeneutical challenges with which Chinese\nBuddhists were grappling in the seventh and eighth centuries.\n\nOne of the signal debates of the seventh century centered on whether\nor not there were people who had committed such heinous\ncrimes—for example, killing their own parents or an enlightened\nbeing—that they had absolutely no prospect of ever realizing\nenlightenment. One could find textual evidence, in the highly\ninfluential Lotus Sutra, for example, that even beings like Devadatta,\nthe cousin of the Buddha who had tried to murder him out of jealousy,\nare already doing the work of bodhisattvas and will eventually reach\nBuddhahood. Other texts forwarded the controversial but supportive\nthesis that what guaranteed this was the fact that all sentient beings\nalready have/are Buddha-nature. Since we are all originally\nenlightened (benjue, 本覺) practice is not a\nprocess of acquisition, but one of restoration. Not everyone agreed.\nThe Chinese monk, Xuanzang (602–664) was not convinced by such\ntexts and went on a sixteen-year sojourn through Central Asia to India\nto put an end to the debate. He returned laden with more than six\nhundred new Buddhist texts and confirmation of the heterodox nature of\nthe idea that all beings have Buddha-nature. In spite of being treated\nto an imperial welcome and granted lavish support for his translation\nwork, his report on the state of Buddhist teaching in the birthplace\nof the Buddha ironically seems to have buoyed the confidence of\nChinese Buddhists committed to the Buddha-nature thesis and the\nteachings about nonduality and the bodhisattva ideal that were\npresented in such key texts as the Nirvāṇa,\nVimalakīrti and Huayan sutras. Interest in Indian Buddhism waned\nand Chinese Buddhists, including early proponents of Chan, began\nseeing themselves as the true inheritors of the Buddha Dharma with a\nmandate to demonstrate the skillful means (upāya) needed\nto present Buddhism in ways suited to Chinese audiences.\n\nA striking, symbolic turning point in the confidence of Chinese\nBuddhists occurs less than fifty years after Xuanzang’s return\nfrom India when Huineng, an illiterate manual laborer, is made the\nsixth Chinese Chan lineage holder and given the unprecedented\ntreatment of having his transcribed teachings titled the Platform\nSutra (Tanjing). Since “sutra” is traditionally\nreserved solely for the recorded teachings of the historical Buddha,\nthis effectively proclaimed that Huineng was China’s first\n“homegrown” Buddha. It is hard to imagine a more dramatic\naffirmation of the Buddha-nature teachings in China, or a more pointed\nrejection of the identification of Buddhist authority with Buddhist\nliteracy.\n\nOver the next two centuries, Chan identity crystalized around the\nteachings of nonduality and Buddha-nature. In the aftermath of a\ndevastating purge of Buddhism during the Huichang era (841–846),\nduring which more than a quarter million monks and nuns were forcibly\nreturned to lay life and over 5,000 temples, monasteries and Buddhist\nlibraries were destroyed, Linji Yixuan (d. 866), one of the most\ninfluential teachers in Chan history, took these teachings to their\niconoclastic extreme, dismissing the great Buddhist scriptures as\n“hitching posts for donkeys” and encouraging anyone who\nhappened to see “the Buddha” on the road to kill him.\n\nWhereas the metropolitan, text-based schools of Chinese Buddhism were\ndevastated by the mid-ninth century purge, rural Chan communities\nflourished, resulting in the so-called “five houses” or\nLinji, Caodong, Fayan, Yunmen and Guiyang lineages. Collections of\n“encounter dialogues” between Chan masters and their\nstudents began circulating and resonated well with Chinese literati.\nWith the collapse of the Tang dynasty (618–907) and the founding\nof the Song (960–1279), Chan fortunes continued to swell as a\n“homegrown” form of Chinese Buddhism that fit well into\nthe literati mission of using ancestral cultural traditions\n(guwen) to craft a new imperial identity for China. By the\ntwelfth century, Chan had both religious and political prestige and\nthe vast majority of public monasteries supported by the Song court\nwere devoted to the practice of Chan (see Welter 2006).\n3. Chan and the Nature of Reality\n\nChan iconoclasm seems to have been largely rhetorical insofar as the\ntargets of Chan invective shifted from teacher to teacher and from\ngeneration to generation, and insofar as Chan teachings and practices\ndid not generally evidence anything like the radical breaks from\nBuddhist tradition that famous Chan texts like the thirteenth-century\nGateless Barrier (Wumenguan, 無門關) might\nsuggest. On the contrary, daily life in Chan communities followed\nstandard Chinese monastic precedents and even in the writings\nassociated with the Hongzhou lineage of Mazu, renowned for his use of\nphysical “shock tactics” like kicking and punching,\nreferences to works in the Buddhist canon are quite common. Among the\nkey texts frequently invoked by Chan teachers were the\nVimalakīrti Sutra, the Nirvāṇa Sutra, the Flower\nOrnament Sutra, the Lotus Sutra, the Lankāvatarā Sutra, and\nvarious Prajñāpāramitā texts like the Diamond\nSutra.\n\nThe nature of reality as depicted in these texts, and for the most\npart assumed as valid in Chan circles, does not fit comfortably into\nsuch customary Western philosophical categories as idealism,\nmaterialism and dualism. Common to all Buddhist traditions are the\nteachings of interdependence and karma. Strongly interpreted, to claim\nthat all things arise and abide interdependently is to claim that\nrelationality is ontologically more basic than\n“things-being-related”. That is, interdependence is not a\ncontingent, external relation among essentially separate entities; it\nis internal or constitutive. As it came to be understood in China,\ninterdependence entails interpenetration and individual existents are\nthus abstractions from already ongoing relational dynamics. Existence\nis relationality.\n\nThis strong reading was reinforced in China by indigenous Confucian\nand Daoist conceptions of a thing’s nature (xing,\n性) as dispositional and of the world as an auto-poetic or\nself-creating (ziran, 自然) system of\ncontinually-evolving relational patterns (dao,\n道)—not a divine creation, an objective determinant of\nuniversal physical laws, or a material expression of transcendent\nprinciples. These indigenous Chinese conceptions of reality resonated\nwell with Buddhist notions of interdependence and impermanence. But\nBuddhism added to them the teaching of karma, directing attention to\nthe dramatic character of phenomenal reality.\n\nStated as a conditional, the Buddhist teaching of karma is that if we\npay close and sustained enough attention to the dynamics of our\nexperience, a meticulous consonance becomes manifest between the\ncomplexion of our own values, intentions and actions, and the patterns\nof outcomes and opportunities we are experiencing. In short, all\nexperienced realities imply responsibility. But because our values,\nintentions and actions are always open to revision, all experienced\nrealities also express opportunities for responsively altering the\ncharacter and disposition of the relational dynamics that constitute\nus as persons and as communities.\n\nOne objection to this view of reality is that, if the world is\nself-generating and without any specific point or moment of origin, if\nwe are truly relational and thus ultimately intergenerational beings,\nand if experience is karmically-conditioned, how is enlightenment or\nliberation from conflict, trouble and suffering possible? If we have\nhad an infinite amount of time to act with ill intent or in accord\nwith misguided and perhaps conflicting values, do we not have an\ninfinite amount of troubling experiential consequences to work\nthrough—an infinite burden of “bad” karma to bear\nand eventually suffer and make good on?\n\nFor the historical Buddha, the answer was quite simple: it is karma\nitself that makes the realization of liberation possible. We may not\nbe able to change what we have done in the past, but at this\nvery moment we can change the meaning of what we have done,\nestablishing a new dramatic trajectory that carries us beyond the\nreach of much of what we otherwise would have been\n“destined” to experience. Thus, although the serial killer\nAngulimāla did experience some violence from villagers affected\nby his prior rampages after having met the Buddha, become a monk, and\npracticed well enough to realize liberation, being pummeled with small\nstones and rotten fruit was minor suffering in comparison to what\notherwise was due him based on his ruthless and proud slaughter of\ndozens of people (Majjhima Nikāya, no. 86).\n\nAs Xuanzang’s arduous journey to India and the controversy\nmotivating it make clear, however, not all Buddhists were satisfied by\nthis explanation. After all, the Buddha was the greatest of all\nteachers and this was clearly a factor in his disciples’\nabilities to realize liberation under his guidance. Indeed, the body\nof literature detailing the Buddha’s prior lives (the Jataka\nTales) portrays the Buddha’s closest disciples as having\ntraveled with him over time as members of an ensemble of\n“characters” in a drama of liberation playing out over\ndozens of lifetimes. What of less karmically fortunate people living a\nhundred or a thousand years after the Buddha had died? If all beings\nhave “no-self” or abiding essence, if all things are\ncharacterized by emptiness (śūnyatā) or the\nabsence of any intrinsic nature—basic teachings of both early\nand later Buddhist traditions—and if we have been living the\nignorance-biased lives of “sinners” rather than\n“saints”, how is liberation ever possible? Without the\nlive guidance of a teacher like the Buddha, the possibility of\nenlightenment would seem to be purely theoretical.\n\nOne response to this—variously expressed in a range of\nMahāyāna texts and variously understood by those\ninterpreting them as Buddhism spread from India through Central Asia\nand into China—was that all sentient beings have\n“within” them a “seed” or “embryo”\n(garbha) of enlightenment: the innate capacity to be like the\nBuddha himself, a “thus come one”\n(tāthagatha). Texts espousing some version of this\ntāthagatha-garbha thesis—the\nNirvāṇa, Śrimālādevimhanāda and\nLankāvatarā sutras, for example, and the apocryphal\ncommentary, the Awakening of Mahayana Faith—became some of the\nmost influential Buddhist texts in China, and especially in the\ndevelopment of Chan. Many of these texts also drew connections between\ntāthagatha-garbha teachings and the notion of\nbuddhadhātu, literally “buddha-element”,\n“buddha-substance” or “buddha-realm”. This\nconcept seems to have developed through a merger of justifications for\nrelic veneration practices and assertions about the originally\nluminous nature of the mind that are found in both very early\nPali-language and Mahayana Buddhist texts. These texts maintain that\nmind is originally pure and that it only appears impure because of\nexperiential pollutants (kleśas) caused by actions\nundertaken in ignorance or out of anger, hatred and greed. This idea\nof the original luminosity of mind was seemingly grafted onto the idea\nof an ineradicable “element” or “substance”\n(dhātu) of enlightened being, eventually resulting in\nclaims that all sentient beings have already within them a seed of\nenlightenment—a luminous capacity for awakening\n(budh).\n\nFor some Buddhists, the “substantial” character of this\ncapacity seemed to imply the presence in each of us of a “true\nself”—not the egoistic self that appears as a function of\nignorance, habit formations and craving forms of desire, and that is\ndissolved through Buddhist training and the realization of no-self\n(anatman), but rather an unassailably aware core of\nbeing-present. In China, however, the term that was used to translate\nbuddhadhātu—佛性 or\nfo-xing—opened other interpretative possibilities. In\ncontrast with the connotations of the Sanskrit dhātu,\nwhich has connotations ranging from an individual component of\nexistence to a realm of existents, fo-xing literally means\n“Buddha-nature” and carries with it dispositional or\nrelational accents deriving from the indigenous Chinese notion of\n“nature” (xing, 性). Thus, Buddha-nature\ncould be seen as a propensity for entering into enlightening forms of\nconduct and relationship, rather than as a substantial essence.\nBuddha-nature is not something hidden “in” each of us, but\nrather something that manifests as a distinctive pattern and quality\nof interactive conduct. Chan strenuously endorsed this interpretation,\nand illustrating it became the distinctive feature of the\ngong’an (公案) or “public case”\nliterature of master-student encounters expressing the\n“bone” and “marrow” of Chan: communicating the\nmeaning of enlightenment is not a matter of saying, but of\nshowing.\n\nJust as significantly, the Buddha-nature thesis also came to be allied\nwith teachings about nonduality that were found both in key\ntāthagatha-garbha texts and in the profoundly\ninfluential Vimalakīrti Sutra. The key figure of this sutra is a\nlayman, Vimalakīrti, who feigns illness as a pretext for being\nvisited by the Buddha’s key disciples and other eminent Buddhist\nfigures—each of whom he engages and surpasses in sophisticated\ndebate about core Mahayana concepts and practices. The sutra climaxes\nboth dramatically and philosophically when the bodhisattva of wisdom,\nMañjuśrī, asks Vimalakīrti to explain the\nmeaning of nonduality and Vimalakīrti responds by simply\nremaining silently and unwaveringly present.\n\nIn the history of Western and certain branches of Indian philosophy,\nclaims about nonduality have often taken the form of monistic\nchallenges to metaphysical dualisms asserting the incommensurability\nof, for example, mind and body or spirit and matter. Nondualism denies\nthe presence of the implied ontological gap separating these\nconstituents of reality, asserting instead that everything is\n(ultimately) one or the same. Buddhist nondualism, as it came to be\nunderstood in China, does not involve an erasure of difference or a\ndenial of its reality, but rather a restoration of the otherwise\n“excluded ground” between “being” and\n“nonbeing”.\n\nThe great Indian Buddhist thinker, Nāgārjuna (c.\n150–250 CE), set the stage for this conception of nonduality by\nfamously pointing out the logical inconsistencies of reality claims\nabout being; nonbeing; both being and nonbeing; and neither being nor\nnonbeing. Blending early Buddhist insights into interdependence and\nthe Mahayana conception of emptiness\n(śūnyatā), Nāgārjuna’s\nMadhyamaka philosophy stressed the unreality of svabhāva\nor “own being” to advance what he described as a\n“middle path” between existence and non-existence that\noffered an alternative to both dualism and monism, but also to any\npluralisms affirming the ultimate reality of some (perhaps indefinite)\nnumber of independent existents. This logical approach to the Middle\nWay had powerful impacts on the development of Chinese Buddhism. But\nit was seen by some as offering an apophatic or negative nonduality\nthat, while successful in undermining metaphysical foundationalism,\ndid little to address ethical and more broadly karmic concerns or to\nsupport the bodhisattva ideal of resolutely compassionate wisdom.\nConceptually linking emptiness and Buddha-nature opened possibilities\nfor a relationally positive nondualism consistent with the\nvalorization of meaning-generating mutual responsiveness.\n\nWith great impact on the development of Chan, this was the approach\ntaken by the Chinese Huayan thinker, Fazang (643–712). Although\nproponents of Chan often stressed its distinctiveness, Chan monastics\nlived in community with monks and nuns who had allegiances to other\nBuddhist traditions. Indeed, rather than being a source of doctrinal\nschisms, the scriptural commentaries and philosophical essays being\nproduced by thinkers from the full range of Buddhist traditions can be\nthought of as constituting a shared scaffolding for engagement in\n“Buddhist studies”. Fazang was among the most respected\nBuddhist intellectuals of his time. In contrast with those who\nunderstood the Mahāyāna assertion of the emptiness\n(śūnyatā) of all things as an assertion about\nthe absence or negation of identity—an assertion that denied\nultimate actuality to things as individual existents—Fazang\nlinked realizing the emptiness of all things to realizing that\ninterdependence is an internal or constitutive relationship. That is,\ninterdependence consists in dynamic interpenetration. In a move that\nparalleled the description in the Awakening of Faith of the “one\nmind” (yixin, 一心) of ultimate reality as\nhaving two aspects—ti (體), “embodied\nstructure” and yong (用)\n“function”—Fazang held that the\ndharmadhātu or realm of truth/ultimate reality should be\nseen nondualistically in terms of both informing principles\n(li, 理) and phenomenal experiences (shi,\n事). That is the dharmadhātu or realm of\ntruth/ultimate reality is at once a realm of shi or\nexperiential matters (事法界, shi fajie); a\nrealm of li or informing patterns/principles\n(理法界, li fajie); a realm of the mutual\nnon-obstruction of li and shi\n(理事無礙法界, li-shi wuai\nfajie); and a realm of the mutual non-obstruction of shi\nand shi (事事無礙法界,\nshi-shi wuai fajie). Thus, very much in keeping with the fact\nthat the Sanskrit term, “dharma”, can mean a specific\nexistent, a phenomenal unit or a teaching, the nonduality of the\ndharmadhātu implies a relationship of mutual\ndetermination between the domains of metaphysics and epistemology.\n\nTo help clarify the significance of this, Fazang made metaphorical use\nof a traditional, timber-framed building that is held together without\nany fasteners by the compressing force of gravity on all of its parts\n(Huayan wujiao zhang, in Taishō shinshō\ndaizūkyu, Vol. 45, no. 1866). Removing the clay roofing tiles and\ntheir immense weight would destabilize such a building, eventually\ncausing it to collapse. But the roofing tiles are placed on top of\npurlins that are placed perpendicularly on rafters resting on a\ncentral ridge beam and on rim joists that are themselves resting on\ncolumns placed atop individual foundation stones. Since removing the\nroofing tiles of such a structure would cause the entire building to\ncollapse, the tiles can be said to be the cause of the totality of the\nbuilding. But the same is true for all of the other parts of the\nbuilding. Similarly, each particular in the world (shi)\nconsists at once in causing and being caused by the dynamic patterning\n(li) of the totality of all things. Each thing ultimately\nis what it means for all others.\n\nIt can be said, then, that all things are the same, but this is true\nonly insofar as each thing differs meaningfully from and for one\nanother. Nonduality does not mean that all things are reducible to\nsome common essence or substance, but rather that each thing or being\nis part of an emergent ecological matrix through which the\nfunctioning of each thing or being serves as a distinctive\ncause of the totality of the real. Reality ultimately\nconsists in dynamically evolving mutual contribution. The\ndharmadhātu is not something we have in common,\na foundational essence; it is something in which we each have a\ndistinct and indispensable contributory share. Thus,\nBuddha-nature is not an adamantine and ineradicable element of who we\nare; it consists in the uninterrupted expression of enlightened and\nenlightening relationality.\n\nChan embraced this account of nonduality and Buddha-nature, but\ndistinctively used it to qualify the meaning of Buddhist practice and\nthe personal ideal of the bodhisattva. In the Platform Sutra\nattributed to Huineng, he insists that\n\n\nmeditation is the embodiment (ti) of wisdom, and wisdom is\nthe functioning (yong) of meditation.\n\n\nThe point of Chan is to see one’s own “original\nnature” (benxing, 本性) and realize\n“authentic heartmind” (zhenxin,\n眞心), and in doing so the dualities of thought and\nreality, of passion and enlightenment, and of the impure and pure all\ndissolve. Then,\n\n\ntrue suchness (zhenru, 真如) is the embodied\nstructure (ti) of thinking, while thinking is the functioning\n(yong) of true suchness. (Platform Sutra, 13–17)\n\n\nTo see our own original nature is to see that true suchness and\nthinking are as intimately related as the bodily structure of a horse\nand its customary activities. Just as the bodily structure of the\nhorse establishes the conditions of possibility for grazing and\ngalloping, it is only the proven evolutionary advantage of grazing and\ngalloping in horse-like ways that have made this bodily structure\npossible. True suchness or ultimate reality is not a preexistent\nsomething “out there” that can be grasped intellectually\nor accessed through some mystical vision; it can only be enacted.\n\nHuangbo Xiyun (d. 850) describes this as demonstrating\nno-“mind” (wuxin, 無心) or freedom\nfrom conceptual impositions that would define or limit reality. But\nthis is not a lapse into mental blankness or indiscriminate presence.\nRealizing no-“mind” restores our originally whole mind\n(yixin, 一心) that Huangbo qualifies as the\n“silent bond” (moqi, 默契) of\n“conducting oneself as all Buddhas have” (in Taishō\nshinshō daizūkyu, Vol.48, 2012.380b to 383c). Significantly,\nthe term “qi” originally referred to notches or\ntally marks on a strip of bamboo that record the terms of a trade\nagreement and the bonding that Huangbo invokes is thus one of mutually\nentrusted obligation and responsibility. True suchness consists in the\npersonification of the bodhisattva ideal of realizing liberating forms\nof relationality. Ultimate reality consists in enacting the\nmorally-inflected nonduality of wisdom and compassion.\n\nRegarding reality as a dynamically-manifested relational quality\nrather than as something to be “known” or\n“attained” disposed Chan to valorize responsiveness as an\nindex of liberating presence. Thus, while Mazu iconoclastically\nproclaimed that “ordinary, everyday mind is Buddha”\n(Xu zangjing, 119.406), he also identified this with\n“responding to situational dynamics and dealing with people as\nthey come”, no matter where one is or with whom one is\ninteracting (Xu zangjing, 119.406). And Linji, founder of one\nof the two Chan lineages that have remained continuous to the present\nday, urged his students to become “true persons of no\nrank” (zhenren wuwei, 真人無位)\nwho refrain from taking any fixed position, improvising as needed in\nany situation to contribute to the emergence of enlightening\nrelational dynamics.\n4. Truth and the Nature of Knowledge and Language in Chan\n\nChan’s identification of ultimate reality or true suchness (Ch.\nzhenru; Skt. bhūtatathatā) with\nliberation-enacting responsive virtuosity implies that reality is both\npersonal and communicative. Given this, it is not surprising that\n“public cases” (Ch. gong’an; J.\nkōan) purportedly recording the encounters of Chan\nmasters and their students came to be the premier Chan literary form\nand by the mid-Song dynasty constituted a kind of core curriculum for\nChan training. But, as noted earlier, Chan also came to represent\nitself as\n\n\na special transmission outside the teachings (jiaowai\nbiechuan); not established upon words and letters (buli\nwenzi); directly pointing to the human heartmind (zhizhi\nrenxin); seeing nature and becoming a Buddha (jianxing\nchengfo).\n\n\nAnd this suggests that the relationship among truth, language and\ncommunication in Chan may confound some common Western philosophical\nexpectations.\n\nAs is suggested by the abundant references to canonical texts found in\nChan master discourse records, announcing that Chan involves a special\ntransmission (biechuan) beyond the scope of scriptural\nteachings (jiaowai) does not necessarily call the value of\ntextual transmission into question. But it does point to the\npossibility of a form of communication that directly indexes or\nindicates (zhi) the human heartmind without either standing\nupon or erecting (li) words and letters as conveyances for\nknowledge.\n\nThe term chuan, translated here as\n“transmission”, has the connotation of publishing or\nputting into circulation and is thus compatible with imagining\nBuddhist understanding as being transferred from person-to-person,\nfrom place-to-place and from generation-to-generation by means of\ntextually-manifested teachings. But chuan also has the\nconnotation of spreading through a process of conduction. Heat can be\ntransferred from one place to another by convection as high energy\nparticles or objects move into a space of lower energy ones. But heat\ncan also spread without any particles or objects changing location.\nConduction is energy flowing as a function of vibrational resonances\namong adjacent particles or objects and is measured not in terms of\namounts of energy transferred, but rather rates of\ntransfer. Something analogous seems to be at the heart of Chan claims\nof a “special transmission” and of the repeated denials by\nTang and Song dynasty Chan masters that they have anything—like\na robe or bowl— to give or that there is ultimately anything for\ntheir students to seek and attain.\n\nThe textual transmission of Buddhism signals a process of\n“knowledge convection” that can easily result in energy\ndissipation—a possibility that seems to have informed\nspeculations about the eventual demise of the effectiveness of the\nDharma that were widely prevalent during the period of Chan’s\nemergence and maturation. It is in keeping with this insight that\nBodhidharma warned that Buddhist realization attained through the\nmedium of words results in weak qi (氣) or energy, and\nthat Huineng broke with Chinese scholastic tradition to deny the value\nof classifying teachings and texts having “sudden” or\n“gradual” content and directed attention instead to seeing\n“sudden enlightenment” (dunwu, 頓 悟)\nas a function of personal readiness (a root meaning of the term,\ndun) to engage in enlightened/enlightening conduct—a\nfunction of the keenness or dullness with which one enters into\nliberating resonance with others.\n\nConsistent with seeing knowledge transfer as a process of conduction,\nthe paradigmatic Chan term for records of intergenerational\ntransmission is denglu (燈錄) or “lamp\nrecords”—a term that invites imagining a series of lamps\nbeing restored to their natural luminosity as teachers and students\nenter into effective resonance with one another. In Chan, knowledge is\nnot something that can be bequeathed. Truth is not a function of\npropositional coherence or of a correspondence between propositions\nand reality. Truth is the enactment of liberating\nrelationality—a truing of relational dynamics.\n\nThis understanding of truth is crucial to the evolution of Chan\nteachings, and to the apparent embrace of such contradictory\nclaims—sometimes made by the same teacher—as that Chan\ninvolves the realization of “one mind” or “ordinary\nmind” or “no-mind”. Chan teachings are—at\nleast ideally—improvised in effective and always situated\nresponse to actual needs and concerns. That is, they are\nexemplifications of the bodhisattva exercise of upāya or\nresponsive virtuosity, not final expressions of eternally or\nuniversally valid insights.\n\nMazu, for example, was once asked by a monk, “Why do you say\nthat ‘mind is Buddha’?” Mazu replied, “To end\nthe crying of small children”. The monk then asked, “So\nwhat do you say when the tears have dried up?” Mazu answered,\n“It is neither mind nor Buddha”. The monk continued\nprobing. “Then what if people come along who don’t fit\ninto either of these categories? How do you teach them?” Mazu\nsaid, “Then I tell them that it’s not a thing”.\nStill not giving up, the monk finally asked, “But what about if\nyou come across someone who is truly present?” To this Mazu\nreplied, “I teach such a person to realize the great Way”\n(Xu zangjing, Vol. 119.408b).\n\nThe provisional nature of Chan declarations exemplified in this\nencounter and even more apparent in some Chan teachers’ use of\nphysical gestures like raising a finger, wiggling eyebrows or killing\na cat in response to students’ questions was a lightning rod for\ncriticism. If Chan teachings can include contradictory statements and\nsuch gruesome acts as killing a cat, what is to prevent the truth of\nnondualism from spurring an antinomian erasure of the boundaries not\nonly between sense and nonsense, but also between the moral and\nimmoral? This was a concern for even such eminent Buddhist thinkers as\nGuifeng Zongmi (780–841), a lineage holder in both the Huayan\nSchool and the Heze Chan lineage, who argued that if any kind of\nspeech or action can be the functioning of Buddha-nature, then what is\nto stop hatred and gratuitous violence from being seen as\n“liberating” (Xu zangjing, Vol. 110.435d)?\n\nHere it is useful to place Zongmi’s concerns in the context of\nChinese appropriations of the distinction between conventional truth\n(saṃvṛti-satya) and ultimate truth\n(paramārtha-satya)—a distinction that had roots in\nboth Nikāya and Mahāyāna Buddhism, and that was given\nperhaps its most developed expression in the work of the Indian\nthinker, Candrakīrti (570–650). In China, while the\n“two truths” distinction became a philosophical mainstay,\nit was also seen as being in tension with the teachings of nonduality\nsince it implies two separate levels of reality or at the very least a\ncontrast of reality and illusion. One of the most influential\nresponses to this seeming inconsistency was put forward by Zhiyi\n(538–597), one of the founding figures of Chinese Tiantai\nBuddhism, who forwarded a “three truths” approach that\nembraced such apparent opposites as existence and nonexistence,\nenlightenment and delusion, and the sacred and the profane as equal\npartners of the “Middle Way”. According to Zhiyi,\nconventional realities/truths (based on day-to-day experience) and\nultimate realities/truths (based on the realization of emptiness) are\nequally involved in bringing about the end of suffering (the Middle\nPath). And this implies that, in fact, all things and statements can\nbe true as mutually inclusive aspects of a single reality/truth.\n\nThe more radical streams of Chan teaching—for example,\nHuineng’s claim that passions are not an obstruction to\nenlightenment, or Linji’s use of hitting and shouting—are\nconsistent with this approach. But both in Zhiyi’s Tiantai and\nin Chan it arguably was not held that all things are doing\nthe Buddha work of enlightenment, but rather that they can\nfunction in this way. Whether or not raising a finger actually brings\nabout a liberating turn in a teacher-student encounter is not a\nfunction of the action or the intention behind it, but of what it\nmeans relationally. Case 19 of the Blue Cliff Record (see,\nCleary 1977) recounts how Chan master Juzhi was fond of\nresponding to students’ queries simply by raising his index\nfinger. One day, Juzhi was away and his teenaged attendant\ngreeted some visitors inquiring as to the master’s whereabouts\nby mimicking his master’s trademark gesture. When Juzhi\nreturned, the boy informed him how things had gone while he was away\nand Juzhi asked him to demonstrate how he had responded to the\nvisitors. The boy raised his finger, which Juzhi promptly severed with\na knife. As his attendant fled in pain, Juzhi called out his name.\nWhen the boy stopped and turned, Juzhi raised his finger. The\nboy’s mind opened and realization blossomed. Chan teaching is\nnot something conveyed by words or gestures; it consists in direct\nrelational transformation.\n\nIt still can be asked, of course, how one knows what direction of\nrelational transformation is truly liberating or what interventions\nare appropriate in any given situation. This epistemological concern\nis not one, however, that Chan endorsed. On the contrary, the general\nChan view has been that asking the epistemological question is perhaps\nthe single most pernicious form of distraction from embarking wholly\nupon the path of Chan practice. Huineng insisted that from the\nancients down to his day, without-thinking (wunian\n無念) had always been the core teaching (Platform Sutra,\n17). But he also noted that being without-thinking can be sustained\neven as thoughts are arising and passing away so long as one refrains\nfrom forming attachments, calculating outcomes and taking up fixed\npositions. In short, being without-thinking is being single-mindedly\npresent in unwavering attentiveness. Deliberating about whether an\naction is right or wrong is already to have departed from such\npresence and to have fallen into doubt or being of “two\nminds”.\n\nIn an iconic encounter between Mazu and his teacher, Nanyue Huairang\n(677–744), Mazu has an awakening after pointing out to Huairang\nthat he cannot make a mirror by rubbing together a stone and a clay\nroofing tile, only to be asked why he then thinks it is possible to\nmake himself into a Buddha by sitting on a meditation cushion. To\nbecome a Buddha, Huairang avers, simply act as a Buddha. This opens\nMazu’s mind, but then it swiftly closes as he wonders how he\nwill know when he is acting like a Buddha. Huairang’s reply to\nthis question triggers a still deeper awakening: “You cannot see\nthe Path, you can only see from it”. Epistemological\nworries are potentially endless detours of often fervently justified\ndisengagement—detours predicated on the separating out of a\nquestioning subject and a questioned object or environment. Seeing\nfrom the Chan path is seeing completely.\n5. Ethical Dimensions of Chan\n\nFrom the perspective of Chan practice, the merits of cutting off\nconceptual craving and calculation are immediately evident. But\nclaiming no-thought and unquestioning participation as norms can be\nseen as promoting unreflective and potentially uncaring and unjust\nactions, as well as generating liabilities for authoritarian abuse.\nGiven that ethics seemingly requires reasoned reflection on how to\nrealize the good life as persons and as communities, is Chan finally\nun-ethical or anti-ethical? If there is really nothing to seek or\nattain, as so many Chan masters have averred, and if enlightenment is\nnot so much a substantive change as it is a gestalt shift, is this not\nto simply leave untreated and likely worsening all of the ills and\ninjustices plaguing us?\n\nThere is little in Chan literature that could plausibly warrant\npositioning Chan wholly within any one of the standard Western\ncategories of consequentialist, deontological and virtue ethics, or,\nfor that matter, within such alternatives as communitarian or care\nethics. Chan literature is notoriously silent about the kinds of\nquestions to which ethics typically offers answers. Indeed, the\nrecurrent valorizations of non-thinking (wunian), non-abiding\n(wuzhu, 無住) and non-reliance (wuyi,\n無依) in the context of Chan’s nondualistic\nmetaphysics and its idealization of responsive virtuosity suggest that\nif there is such a thing as Chan ethics it is an ethics of relational\nimprovisation.\n\nThe mainstream of Western ethics takes the individual, decision-making\nagent as the basic unit of concern, and a primary concern is to\ndevelop a universally applicable method of arbitrating among the often\ndisparate interests of individual agents, establishing\nrationally-guided means to determining and practically realizing the\nmeaning of the good life. Chan nonduality shifts concern from\nindividual agents to relationality, and in particular to the kind of\nrelationality that fully manifests our original Buddha-nature. In this\nsense, the basic method of Chan ethics might be thought to be\nemulation—a method of deliberately acting as the Buddha did. But\nthis would imply a goal orientation that is entirely at odds with\nChan’s cautions against objectifying enlightened/enlightening\nconduct or making Buddha-hood a goal or destination. As the example of\nJuzhi and his attendant makes strikingly evident, the method of\nChan is not to imitate or mimic the behavior of either past or present\nexemplars. Rather, it is to exemplify ourselves the dramatic clarity\nand relational virtuosity of bodhisattvas who are able, in any\nsituation whatsoever to bring about a liberating inflection of ongoing\nrelational dynamics. If Chan ethics involves emulation, it is\nemulation of something like an improvisational style rather than\nmastery of a specific deliberative or behavioral repertoire.\n\nIt can be said, then, that freedom is a primary ethical value in Chan.\nBut Chan freedom is not identified with the exercise of control or\nchoice; neither is it rooted in rational determinations of whether a\ngiven course of action is good or will have good results. That is,\nfreedom is not associated with independence (which is imaginable only\nin ignorance of the interdependence and interpenetration of all\nthings), nor is it conceived essentially as a property of individual\nagency. In keeping with the bodhisattva ideal, freedom consists in\nembodying superlative capacities-for and\ncommitments-to realizing the conditions for relating\nfreely: the improvisational expression of relational\nvirtuosity oriented toward the resolution of conflict, trouble\nand suffering. Chan ethics is not a function of living in accord with\npredetermined means-to and meanings-of the good, but rather of\nimprovisational genius—a creative marriage of fluid vigilance\nand unwavering care: an ethics of ever-intensifying appreciative and\ncontributory virtuosity.\n\nThis, of course, is a distillation of Chan ideals. Extant evidence is\nthat life within Chan monastic communities was conducted in adherence\nwith the disciplining precepts of Buddhist ordination, and that\ninteractions with the lay community were for the most part consistent\nwith prevailing moral and social norms. Chan rhetoric notwithstanding,\nChan practice seems to have been more norm-respecting rather than\nnorm-eliding. In keeping with this, when the famous Tang poet,\nBai Juyi (772–846) asked Chan master\nNiaoke (741–824) about the true meaning of Chan,\nNiaoke responded, “As for doing evil, avoid it; as for the\ngood, practice sharing it”. When Bai Juyi derisively\ndismissed this as the kind of advice given to three-year-old children,\nNiaoke didn’t disagree, but simply added that although it\nwas advice that rolled easily off the tongue, it was also advice that\nmost eighty-year-olds failed to put into practice.\n\nYet, when Niaoke extols sharing the good, he is not referring to\nsome fixed or predetermined ideal or attribute. Like the Sanskrit\nkuśala for which it served as a translation, the Chinese\nword he uses, shan (善), connotes the superlative:\n“good” in the sense of being expert or virtuosic.\nMoreover, he does not advocate “being” good or even\n“doing” good, but rather sharing it. Chan ethics is thus\nnot a knowing-that something is or will be good, but rather\nknowing-how to extend the horizons of virtuosity in ways\ndeemed valuable by others (on this distinction, see Varela 1999). And\nthis knowing-how is not an intellectually-attained method, but rather\nthe result of embodied, relationship-attuning practice.\n\nWith this in mind, it is interesting to note that among its signal\nachievements Chan came to include the Chan Rules of Purity (Chan\njinggui), attributed to Baizhang (749–814), which\nestablished a comprehensive code of conduct for Chan monastics. Even\nin the radical Hongzhou lineage, living in accordance with these rules\nwas seen as essential to holding open the circuit of mutual\ncontribution that made the privilege of monastic life possible.\nWeishan Lingyou (771–853), for example, explicitly urges monks\nin his community gratefully and with a lofty and peaceful spirit to\nrepay the kindnesses of their parents, their donors, the emperor and\nthe Buddha, without whose offerings they would not have the\nopportunity to realize Chan awakening (Weishan jingce, T.\n48:1042b-43c), primarily by adhering to established rules of\ncomportment for those embracing the bodhisattva ideal. The emphasis on\nbodily comportment is crucial.\n\nAs the Pali and Sanskrit texts of the Vinaya division of the Buddhist\ncanon make clear, the norms of Buddhist monastic life were not arrived\nat in an a priori or purely rational fashion, but rather in\nsituated response to tensions arising within the early monastic\ncommunity and in its interactions with the rest of society. This\nsituational approach to the development of norms for conduct and\ndemeanor resonated well with indigenous Chinese approaches to ethics.\nThe moral and ethical norms of the Confucian tradition around which\nsocial relations have been structured throughout much of China’s\nhistory do not consist in rationally-derived principles and virtues,\nbut rather in standards of ritual performance (li, 禮)\nwithin the roles—as fathers, mothers, sons, daughters, friends\nand societal participants—that are the constitutive means-to and\nmeanings-of being authentic and valued persons-in-community (see Ames\n2011). These standards are, of course, behavioral. They provide a\nsocial grammar to which recourse is made in shaping one’s\nrelationships in meaningful and situationally appropriate ways. But\nmore importantly, these standards are also qualitative—standards\nof intention, attitude and energy as they pertain to relational\nenhancement. Although any grammar is by nature restrictive, the\npurpose of Confucian norms is to provide a structure for the\nprogressive personification of consummate conduct (ren,\n仁). Ethics is ultimately inseparable from aesthetics.\n\nUnderstood in this context, monastic discipline provides a basic\ngrammar for living as persons-in-Buddhist-community. Abiding by\nmonastic rules of behavior and comportment are a kind of “basic\ntraining” on the way of developing relational virtuosity. That\nsaid, Chan virtuosity involves much more than\n“grammatical” proficiency. An intimation of what this\nmeans is presented in this beautifully crafted passage in the\ndiscourse records of Mazu.\n\n\nBuddhas are capable of authoritative personhood (ren). Having\nrealized kind wisdom and the excellent nature of opportunities and\ndangers, you can break through the net of doubts snaring all sentient\nbeings. Departing from “is” and “is-not” and\nother such bondages….leaping over quantity and calculation, you\nwill be without obstruction in whatever you do. When your situation\nand its pattern are penetrated, [your actions] are like the sky giving\nrise to clouds; suddenly they exist, and then they don’t. Not\nleaving behind any obstructing traces, they are like phrases written\non water. (Xu zangjing, Vol. 119.406b)\n\n\nThe Chan ethical ideal is liberating intimacy and efficacy without\nagency.\n6. Conclusion\n\nChan’s iconoclastic rhetoric and its fondness for using such\napparently negative terms as no-thought, no-mind and no-cultivation as\ncardinal points of liberating practice might suggest seeing Chan as a\npremodern form of deconstructivism. But given its affirmation of\nBuddhist teachings about karma and the role of values and\nintentionality in shaping experience, Chan might just as well be seen\nas constructivist. The humor and apparent absurdity of Chan’s\npremier literary form—vernacular encounter dialogues—might\nalternatively suggest existentialist leanings, while its celebrations\nof everyday life, embodied action and doing what works now rather than\nfollowing past precedents can be seen as pragmatic. Philosophically,\nChan presents itself as an enigma.\n\nAt the same time, Chan had profound impacts culturally. In China, Chan\nideals of personal vitality and responsive virtuosity found ongoing\nvisual expression in calligraphy and painting, and literary expression\nin poetry. And as Chan spread to other parts of East Asia, these\nideals came also to be infused into the performance arts of music, tea\nceremony and drama. The distinctive ways in which Chan wedded\nnonduality or metaphysical ambiguity with a moral aesthetics of\nimprovisation opened real possibilities for imagining presence as\nalready liberating.\n\nThe nature of the relationship between the enigmas that Chan presents\nphilosophically and the cultural productivity of its personal and\naesthetic ideals remains open. In East Asia, exploring that openness\nhistorically proved to be a powerful means of addressing the\npredicament of culture and the discomforts of cultural difference.\nSimilar explorations are now ongoing elsewhere as Chan, Zen, Sôn\nand Thiền traditions of thought and practice have begun taking\nroot in other parts of the world. In this new global context, engaging\nin philosophical conversation with Chan signals distinctive\nopportunities for exploring the means-to and meanings-of truly\nintercultural philosophy.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Majjhima Nikāya</em> (The Middle Length Discourses of the\nBuddha), Bhikkhu Nanamoli and Bhikkhu Bodhi (trans), 1995, Boston:\nWisdom Publications.",
                "<em>The Platform Sutra of the Sixth Patriarch</em>, Philip\nYampolsky (trans. and ed.), 1969, New York: Columbia University\nPress.",
                "<em>Sutta-Nipāta</em>, H. Saddhatissa (trans.), 1985, London:\nCurzon Press.",
                "<em>Taishō shinshū daizōkyō</em>, The Buddhist\nCanon. Reprint, Taibei: Xinwenfeng chuban gongsi,\n1983–1984.",
                "<em>Xu zangjing</em>, Supplement to the Buddhist Canon. Reprint of\n<em>Dai Nihon Zokuzōkyō</em>, Taibei: Xinwenfeng,\n1968–1970.\n</ul>\n<h3>"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Adamek, Wendi L., 2011, <em>The Teachings of Master Wuzhu: Zen and\nReligion of No-Religion</em>, New York: Columbia University\nPress.",
                "Ames, Roger T., 2011, <em>Confucian Role Ethics: A\nVocabulary</em>, Honolulu: University of Hawai‘i Press.",
                "Broughton, Jeffrey L., 1999, <em>The Bodhidharma Anthology: The\nEarliest Records of Zen</em>, Berkeley: University of California\nPress.",
                "–––, 2009, <em>Zongmi on Chan</em>, New York:\nColumbia University Press.",
                "Broughton, Jeffrey L., and Elise Yoko Watanabe (trans.), 2017,\n<em>The Letters of Chan Master Dahui Pujue: Smashing the Mind of\nSamsara</em>, New York: Oxford University Press.",
                "Cleary, Thomas and J.C. Cleary, 1977, <em>The Blue Cliff\nRecord</em> (Volume One), Boulder, CO: Shambhala Publications.",
                "Clifford, James, 1988, <em>The Predicament of Culture: Twentieth\nCentury Ethnography, Literature, and Art</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Dumoulin, Heinrich, 1994, <em>Zen Buddhism: A History, Volume 1,\nIndia and China</em>, 2nd edition, translated James W. Heisig and Paul\nKnitter, New York: Simon &amp; Schuster Macmillan.",
                "Faure, Bernard, 1991, <em>The Rhetoric of Immediacy: A Cultural\nCritique of Chan/Zen Buddhism</em>, Princeton: Princeton University\nPress.",
                "–––, 1993, <em>Ch’an Insights and\nOversights: An Epistemological Critique of the Ch’an\nTradition</em>, Princeton: Princeton University Press.",
                "Heine, Steven and Dale S. Wright, 2000, <em>The Kōan: Texts\nand Contexts in Zen Buddhism</em>, New York: Oxford University\nPress.",
                "Hershock, Peter D., 1996, <em>Liberating Intimacy: Enlightenment\nand Social Virtuosity in Ch’an Buddhism</em>, Albany: State\nUniversity of New York Press.",
                "–––, 2004, <em>Chan Buddhism</em> Honolulu:\nUniversity of Hawai‘i Press",
                "Jia, Jinhua, 2006, <em>The Hongzhou School of Chan Buddhism: In\nEighth- through Tenth-Century China</em>, Albany: State University of\nNew York Press.",
                "Lewis, Mark Edward, 1999, <em>Writing and Authority in Early\nChina</em>, Albany: State University of New York Press.",
                "McRae, John R., 2003, <em>Seeing through Zen: Encounter,\nGenealogy, and Transformation in Chinese Chan Buddhism</em>, New York:\nCambridge University Press.",
                "Poceski, Mario, 2007, <em>Ordinary Mind as the Way: The Hongzhou\nSchool and the Growth of Chan Buddhism</em>, London: Oxford University\nPress.",
                "Sakai, Naoki, 1997, <em>Translation and Subjectivity: On Japan and\nCultural Nationalism</em>, Minneapolis: University of Minnesota\nPress.",
                "Sasaki, Ruth Fuller and Thomas Yuho Kirchner (trans. and eds),\n2011, <em>The Record of Linji</em>, Honolulu: University of\nHawai‘i Press.",
                "Schlütter, Morten, 2008, <em>How Zen Became Zen: The Dispute\nover Enlightenment and the Formation of Chan Buddhism in Song Dynasty\nChina</em>, Honolulu: University of Hawai‘i Press.",
                "Schlütter, Morten and Teiser, Stephen F. (eds.), 2012,\n<em>Readings of the Platform Sutra</em> , New York: Columbia\nUniversity Press.",
                "Varela, Francisco J., 1999, <em>Ethical Know-How: Action, Wisdom\nand Cognition</em>, Stanford: Stanford University Press.",
                "Wawrytko, Sandra and Wang, Youru (eds.), 2018, <em>Dao Companion\nto Chinese Buddhist Philosophy</em>, Dordrecht: Springer.",
                "Welter, Albert, 2006, <em>Monks, Rulers, and Literati: The\nPolitical Ascendancy of Chan Buddhism</em>, New York: Oxford\nUniversity Press.",
                "Wu, Jiang, 2008, <em>Enlightenment in Dispute: The Reinvention of\nChan Buddhism in Seventeenth-Century China</em>, Oxford: Oxford\nUniversity Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3>Primary Sources</h3>\n<ul class=\"hanging\">\n<li><em>Majjhima Nikāya</em> (The Middle Length Discourses of the\nBuddha), Bhikkhu Nanamoli and Bhikkhu Bodhi (trans), 1995, Boston:\nWisdom Publications.</li>\n<li><em>The Platform Sutra of the Sixth Patriarch</em>, Philip\nYampolsky (trans. and ed.), 1969, New York: Columbia University\nPress.</li>\n<li><em>Sutta-Nipāta</em>, H. Saddhatissa (trans.), 1985, London:\nCurzon Press.</li>\n<li><em>Taishō shinshū daizōkyō</em>, The Buddhist\nCanon. Reprint, Taibei: Xinwenfeng chuban gongsi,\n1983–1984.</li>\n<li><em>Xu zangjing</em>, Supplement to the Buddhist Canon. Reprint of\n<em>Dai Nihon Zokuzōkyō</em>, Taibei: Xinwenfeng,\n1968–1970.</li>\n</ul>\n<h3>Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Adamek, Wendi L., 2011, <em>The Teachings of Master Wuzhu: Zen and\nReligion of No-Religion</em>, New York: Columbia University\nPress.</li>\n<li>Ames, Roger T., 2011, <em>Confucian Role Ethics: A\nVocabulary</em>, Honolulu: University of Hawai‘i Press.</li>\n<li>Broughton, Jeffrey L., 1999, <em>The Bodhidharma Anthology: The\nEarliest Records of Zen</em>, Berkeley: University of California\nPress.</li>\n<li>–––, 2009, <em>Zongmi on Chan</em>, New York:\nColumbia University Press.</li>\n<li>Broughton, Jeffrey L., and Elise Yoko Watanabe (trans.), 2017,\n<em>The Letters of Chan Master Dahui Pujue: Smashing the Mind of\nSamsara</em>, New York: Oxford University Press.</li>\n<li>Cleary, Thomas and J.C. Cleary, 1977, <em>The Blue Cliff\nRecord</em> (Volume One), Boulder, CO: Shambhala Publications.</li>\n<li>Clifford, James, 1988, <em>The Predicament of Culture: Twentieth\nCentury Ethnography, Literature, and Art</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Dumoulin, Heinrich, 1994, <em>Zen Buddhism: A History, Volume 1,\nIndia and China</em>, 2nd edition, translated James W. Heisig and Paul\nKnitter, New York: Simon &amp; Schuster Macmillan.</li>\n<li>Faure, Bernard, 1991, <em>The Rhetoric of Immediacy: A Cultural\nCritique of Chan/Zen Buddhism</em>, Princeton: Princeton University\nPress.</li>\n<li>–––, 1993, <em>Ch’an Insights and\nOversights: An Epistemological Critique of the Ch’an\nTradition</em>, Princeton: Princeton University Press.</li>\n<li>Heine, Steven and Dale S. Wright, 2000, <em>The Kōan: Texts\nand Contexts in Zen Buddhism</em>, New York: Oxford University\nPress.</li>\n<li>Hershock, Peter D., 1996, <em>Liberating Intimacy: Enlightenment\nand Social Virtuosity in Ch’an Buddhism</em>, Albany: State\nUniversity of New York Press.</li>\n<li>–––, 2004, <em>Chan Buddhism</em> Honolulu:\nUniversity of Hawai‘i Press</li>\n<li>Jia, Jinhua, 2006, <em>The Hongzhou School of Chan Buddhism: In\nEighth- through Tenth-Century China</em>, Albany: State University of\nNew York Press.</li>\n<li>Lewis, Mark Edward, 1999, <em>Writing and Authority in Early\nChina</em>, Albany: State University of New York Press.</li>\n<li>McRae, John R., 2003, <em>Seeing through Zen: Encounter,\nGenealogy, and Transformation in Chinese Chan Buddhism</em>, New York:\nCambridge University Press.</li>\n<li>Poceski, Mario, 2007, <em>Ordinary Mind as the Way: The Hongzhou\nSchool and the Growth of Chan Buddhism</em>, London: Oxford University\nPress.</li>\n<li>Sakai, Naoki, 1997, <em>Translation and Subjectivity: On Japan and\nCultural Nationalism</em>, Minneapolis: University of Minnesota\nPress.</li>\n<li>Sasaki, Ruth Fuller and Thomas Yuho Kirchner (trans. and eds),\n2011, <em>The Record of Linji</em>, Honolulu: University of\nHawai‘i Press.</li>\n<li>Schlütter, Morten, 2008, <em>How Zen Became Zen: The Dispute\nover Enlightenment and the Formation of Chan Buddhism in Song Dynasty\nChina</em>, Honolulu: University of Hawai‘i Press.</li>\n<li>Schlütter, Morten and Teiser, Stephen F. (eds.), 2012,\n<em>Readings of the Platform Sutra</em> , New York: Columbia\nUniversity Press.</li>\n<li>Varela, Francisco J., 1999, <em>Ethical Know-How: Action, Wisdom\nand Cognition</em>, Stanford: Stanford University Press.</li>\n<li>Wawrytko, Sandra and Wang, Youru (eds.), 2018, <em>Dao Companion\nto Chinese Buddhist Philosophy</em>, Dordrecht: Springer.</li>\n<li>Welter, Albert, 2006, <em>Monks, Rulers, and Literati: The\nPolitical Ascendancy of Chan Buddhism</em>, New York: Oxford\nUniversity Press.</li>\n<li>Wu, Jiang, 2008, <em>Enlightenment in Dispute: The Reinvention of\nChan Buddhism in Seventeenth-Century China</em>, Oxford: Oxford\nUniversity Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Buddha",
            "Chinese Philosophy: Huayan Buddhism",
            "Chinese Philosophy: Tiantai Buddhism",
            "Japanese Philosophy: Zen Buddhism"
        ],
        "entry_link": [
            {
                "../buddha/": "Buddha"
            },
            {
                "../buddhism-huayan/": "Chinese Philosophy: Huayan Buddhism"
            },
            {
                "../buddhism-tiantai/": "Chinese Philosophy: Tiantai Buddhism"
            },
            {
                "../japanese-zen/": "Japanese Philosophy: Zen Buddhism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=buddhism-chan\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/buddhism-chan/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=buddhism-chan&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/buddhism-chan/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=buddhism-chan": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/buddhism-chan/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=buddhism-chan&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/buddhism-chan/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}