{
    "url": "catharine-macaulay",
    "title": "Catharine Macaulay",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Karen Green\n<greenk1@unimelb.edu.au>",
        "author_links": [
            {
                "mailto:greenk1%40unimelb%2eedu%2eau": "greenk1@unimelb.edu.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nKaren Green\n&lt;<a href=\"mailto:greenk1%40unimelb%2eedu%2eau\"><em>greenk1<abbr title=\" at \">@</abbr>unimelb<abbr title=\" dot \">.</abbr>edu<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jul 5, 2012",
        "substantive revision Mon Jun 1, 2020"
    ],
    "preamble": "\n\nCatharine Macaulay’s most substantial work was the eight-volume A\nHistory of England from the Accession of James I. to that of the\nBrunswick Line, the first volume of which was published in 1763,\nbut the last not until twenty years later. This history, which began\nwith the accession of James 1, and told the history of the English\nCivil War as the outcome of the struggle of the Commons to retain\ntheir liberties against the absolutist tendencies of the Stuarts,\naffirmed the right of the people to depose their monarch. She wrote a\nfurther history, in letters, covering the period after 1688, as well\nas political pamphlets, refuting the monarchism of Hobbes, and the\npolitical conservatism of Burke. She criticized the policy of the\nBritish Government in the lead up to the American War of Independence,\nand was welcomed by the Americans, after Independence, as an important\nadvocate of the principles on which the United States was founded. In\nher pamphlets she defended the right to petition and argued for\ncopyright. Her most philosophical work, A Treatise on the\nImmutability of Moral Truth (1783), developed the doctrine of the\nwill that she called “moral necessity”; this work was\npartly reproduced in her Letters on Education (1790), which\nwas, in turn, reviewed by, and profoundly influenced, Mary\nWollstonecraft.\n",
    "toc": [
        {
            "#LifWor": "1. Life and works"
        },
        {
            "#RepLibHisEng": "2. Republican Liberty and The History of England"
        },
        {
            "#MacRep": "2.1 Macaulay’s republicanism"
        },
        {
            "#MacHisHerResHob": "2.2 Macaulay’s History and her response to Hobbes"
        },
        {
            "#MacHisResHum": "2.3 Macaulay’s History as a response to Hume"
        },
        {
            "#HisLetMacCriBur": "3. The History in Letters and Macaulay as a critic of Burke"
        },
        {
            "#ResThoCauPreDis": "3.1 Response to Thoughts on the Cause of the Present Discontents"
        },
        {
            "#ResRefRevFra": "3.2 Response to Reflections on the Revolution in France"
        },
        {
            "#MacAme": "4. Macaulay and America"
        },
        {
            "#ThoProLibEdu": "5. Thoughts on progress, liberty and education"
        },
        {
            "#FreWil": "5.1 Freedom of the will"
        },
        {
            "#ThoEdu": "5.2 Thoughts on Education"
        },
        {
            "#Fem": "5.3 Feminism"
        },
        {
            "#Con": "6. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriTex": "Primary texts"
        },
        {
            "#SecTex": "Secondary texts"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and works\n\nSources for Catharine Macaulay’s early life are scarce, and modern\nhistorians have relied on the account published by Mary Hays in her\nFemale Biography (Hays 1803, 5.287–307; Hill 1992,\n1–24). Hays represents Macaulay’s childhood as a romance of\nmiraculous self-education. She was born Catharine Sawbridge on April\n2, 1731 (March 23, 1730, old style) the second child of John Sawbridge\nand Dorothy Wanley, at Olantigh in Kent, a property that had been a\ngift from her grandfather, who had made a fortune, and then lost much\nof it as well as his reputation, as a result of his position as one of\nthe directors of the South Sea Company. Having given birth to two\ndaughters and two sons, John and Wanley, Catharine’s mother died\nleaving her and her siblings to the care of their father, who was often absent, while their uncle Jacob, who was married to Anne Brodnax from the neighboring Godmersham, remained at Olantigh. Though Macaulays cousins by this marriage appear to have had a greater claim, Godmersham was later inherited by Jane Austen’s brother, Edward (Green 2017). According to Hays, Macaulay was educated by “an\nantiquated, well-recommended, but ignorant governess,” who could\nnot satisfy her intellectual curiosity, and “having\nfound her way into her father’s well-furnished library, she became her\nown purveyor, and rioted in intellectual luxury” (Hays 1803,\n5.288–9). It is here, according to Hays, that she first became\ninterested in the history of the Greeks and Romans, “their laws\nand manners interested her understanding, the spirit of patriotism\nseized her, and she became an enthusiast in the cause of\nfreedom.” (Hays 1803, 5.289–90) While perhaps exaggerated,\nthis rather romantic account can be accepted as in essence accurate,\nsince Hay’s informant, “Mrs Arnold of Leicester” was the\nsister of Macaulay’s second husband. It echoes Macaulay’s own\nassertion, in the introduction to the first volume of her History\nof England that,\n\n\nFrom my early youth I have read with delight those histories which\nexhibit Liberty in its most exalted state, the annals of the Roman and\nthe Greek republics. Studies like these excite that natural love of\nFreedom which lies latent in the breast of every rational being.\n(Macaulay 1763–83, 1.7)\n\n\nAt the age of twenty-six, she spent an afternoon conversing with\nElizabeth Carter, who was then soliciting subscriptions for her\ntranslation of Epictetus, and subscribed to her translation. This\nfriend and correspondent of the Bluestocking, Elizabeth Montagu,\ninitially represented Macaulay quite favourably as “more deeply\nlearned than becomes a fine lady” who “between the Spartan\nlaws, the Roman politics, the philosophy of Epicurus, and the wit of\nSt Evremond” had formed “a most extraordinary\nsystem.” (Carter 1808, 2. 260; Hill 1992, 11)\n\n\nAlthough Macaulay has been associated with the Bluestockings, and\nalong with Montagu and Carter, was included in Richard Samuel’s,\n1779, painting, “The Nine Living Muses of Great Britain”,\nshe was too radical for their taste (Guest 2002; Eger and Peltz 2008;\nO’Brien 2009). This, despite the fact that Montagu and her\nsister, Sarah Scott, were acquainted with the Sawbridges, who were\nneighbours in Kent. On hearing of the publication of the first volume\nof Macaulay’s history, Montagu commented dismissively, “If\nshe took her sentiments from her Father, & her language from Mrs\nFuzzard it must be an extraordinary performance” (Elizabeth\nMontagu to Matthew Robinson-Morris, 2nd Baron Rokeby, 4 December 1763,\nNewcastle. Huntington Library MSS MO 4763). After her second marriage\nto the twenty-one year old William Graham, even Carter was shocked,\ndubbing her “a genius of [a] very eccentric a kind” while\nSarah Scott wrote to her sister that they, being “pure virgins\nand virtuous matrons”, should “drown her in the Avon, and\ntry if she can be purified by water” (Carter 1817,\n3. 88–9; Sarah Scott to Elizabeth Montagu, 27 November 1778,\nBath. Huntington Library, MSS MO 5391).\n\n\nMacaulay was almost thirty when she married her first husband, a\nScottish physician, George Macaulay, on 18 June 1760. Their marriage\nlasted only six years; he died in 1766. But during these years,\nMacaulay began to write her histories with his encouragement and with that of their neighbor Thomas Hollis.  The first volume of A History of England from\nthe Accession of James I. to that of the Brunswick Line appeared\nin 1763, the following three volumes were published at regular\nintervals in 1765, 1767 and 1768; these were printed for the author\nand sold by various booksellers. There was then a gap in production.\nVolume five was published by Edward and Charles Dilly in 1771.Volume\nsix and seven did not appear until ten years later, in 1781, and they\nwere published with a slightly different title, A History of\nEngland from the Accession of James I. to the Revolution, as was\nthe last volume, which came out in 1783. In 1767 she\npublished her Loose remarks on certain positions to be found in\nMr. Hobbes’s Philosophical Rudiments of Government and Society,\nand in 1770 her first attack on Edmund Burke, Observations on a\nPamphlet entitled “Thoughts on the Cause of the Present\nDiscontents”.\n\nMacaulay’s brother John Sawbridge, a member of parliament, who was\nelected a London Alderman in 1769, became in the same year a founding\nmember of the Society of the Gentleman Supporters of the Bill of\nRights. This society was established with John Horne Tooke and others\nto support John Wilkes, who had been denied the parliamentary seat he\nhad won for Middlesex, as a result of being outlawed for having\npublished articles criticizing the ministry and the King (Hill 1992,\n55–62). However, by 1771, Sawbridge and Tooke had left this\nsociety because of its too narrow focus on Wilkes’s interests.\nMacaulay’s early volumes of history constitute a thinly veiled\ncritique of contemporary political events, and set out the broader\nprinciples of the Society of the Bill of Rights, by rehearsing the\narguments for the rights of the parliament and the liberties of the\npeople that fuelled the English Revolution.\n\nDuring the decade in which she let her major history lapse, she lived\nfor about two years at Bath in the house of a Reverend Wilson, who\nadopted her daughter, and had a statue made of the historian as Clio,\nwhich was controversially placed in the nave of the church of St\nStephen’s Walbrook. During this period her health was not good, and in\n1777 she travelled to France with Elizabeth Arnold. While their aim\nwas the South of France, they did not get further than Paris, where\nMacaulay enjoyed the vibrant cultural life, though she was shocked by\nthe extent of French social inequality (Hays 1803, 5.295–96).\nShe wrote A History of England, from the Revolution to the present\ntime, in a series of letters to the Reverend Doctor Wilson during\nthis period, but the friendship came to an abrupt, bitter end with her\nsecond marriage to twenty-one year old William Graham in 1778. Graham\nwas the younger brother of Elizabeth Arnold and Dr James Graham, whose\nunconventional remedies Macaulay had followed as a cure for her\ncontinual ill health. This act brought a storm of gossip and\nrecrimination; she was accused by Wilson and Wilkes of having had an\naffair with the older Graham, and generally ridiculed for marrying a\nman who was her inferior in status and twenty-six years her\njunior.\n\nThe years of her second marriage appear to have been happy and\nfruitful; during this period she completed her History of\nEngland and wrote the Treatise on the Immutability of\nTruth, which was published in 1783. With her husband she toured\nthe United States, made a particular friend of Mercy Otis Warren, and\nvisited George Washington at Mount Vernon. Her last works were The\nLetters on Education and her response to Burke’s Reflections\non the Revolution in France both of which appeared in 1790. She\ndied on 22 June 1791.\n2. Republican Liberty and The History of England\n\nAlthough Macaulay did not write explicitly about the nature of freedom\nuntil quite late in life, her histories should be read as a\ncontribution to the theory of republican liberty, though not quite as\nthat idea has been outlined by Quentin Skinner and Philip Pettit\n(Skinner 1998, 2008; Pettit 1997). Skinner argues that, as a result of\nhis intention of refuting the political doctrines which lay behind the\nEnglish Civil War, Thomas Hobbes made innovations in the concept of\nfreedom of the will, and introduced the idea that one acts freely\nwhenever one’s act is caused by one’s own deliberations, and is not\nimpeded by some external constraint. Thus Hobbes simultaneously\nsupported the metaphysical view, according to which freedom and causal\ndeterminism are compatible, and introduced the political concept of\nnegative liberty, thought of as freedom from external constraint. He\noverthrew the then dominant metaphysical concept of human\nfreedom—which had descended from Plato via the later Stoics,\nSeneca, Epictetus and Marcus Aurelius—according to which we are\nunfree when our acts are caused by the passions, and free only when we\nact according to reason, as well as the view that political freedom\ninvolves freedom from arbitrary domination.\n\nHowever, the concept of freedom as rational self-government did not disappear, John Locke, in his Two Treatises\nConcerning Government, accepted that we are\npolitically free only when governed by a rational law. He argued that\nthe reason why a man only attains to the status of a freeman at the\nage of maturity is that to be free is to be guided by reason (Locke\n1689[1967]). Thus political freedom corresponds to being governed by a\nrational law, which is the law of nature. However, Locke undermined\nthe epistemological basis of his political principles, which require\nthat there is a moral “law of nature” discoverable by\nreason, when he insisted, as part of his empiricism, that there is no\ninnate knowledge of principles. While Locke himself thought that\nreason could discover the rational validity of the law of nature, by\nreflecting on ideas that we have acquired through sensation and\nreflection, only a few subsequent writers were convinced by his\nreasoning. Some, such as Shaftesbury and Hutcheson reintroduced a form\nof innate knowledge, which nevertheless seemed respectably empirical,\nby developing the idea of a moral sense. Another anonymous “Remarker”, whose identity is unclear,\nargued that the closest that an empiricist such as Locke could get to\na moral doctrine was a form of Epicureanism, which would reduce\nmorality to enlightened self-interest (Burnet 1989; Walmsley 2016). Hume, following\nthe logic of empiricism, would come to essentially the same\nconclusion, without seeing this as problematic. The Remarker’s critique of\nLocke was answered by Catharine Trotter Cockburn, whose attempt to\ndefend Locke was praised by him, but not ultimately fully worked out.\nNevertheless, the position that Cockburn developed in later works has\nsome similarities with that which Macaulay defends (Cockburn 1702;\nGreen 2014, 34–39, 172–79). According to Macaulay, there\nis an immutable moral truth that can be discovered by reason, and as\nCockburn will come to do, she uses the concept of\n“fitness” to explain this process of discovery. Macaulay’s\nlanguage is also very close to Samuel Clarke’s. But, while Cockburn\nwas directly influenced by Clarke (Bolton 1996; Sheridan 2007),\nMacaulay claims that she did not read his works until after she had\ncompleted her Treatise (Macaulay 1783, viii). She proposes\nthat there is a rule of eternal right grounded in,\n\n\n… a necessary and essential difference of things, a fitness and\nunfitness, a proportion and disproportion, a moral beauty and a moral\ndeformity, an immutable right and wrong, necessary independent of the\nwill of every being created or uncreated, explained by the philosopher\nPlato under the form of everlasting intellectual ideas, or moral\nentities, coeval with eternity, and residing in the divine mind; from\nwhence, by irradiating rays, like the emitting of the sun-beams, they\nenlighten the understanding of all those intellectual beings, who,\ndisregarding the objects of sense, give themselves up to the\ncontemplation of the Deity; whilst modern philosophers, in a lower\nstrain of reasoning, assert an abstract fitness of things perceived by\nthe mind of God, and so interwoven in the nature of contemplative\nobjects, as to be traced like other abstract truths, by those\nfaculties of the mind which enable us to compare and perceive the\nagreement and disagreement of our sensitive and reflex ideas.\n(Macaulay 1783, 30–2)\n\n\nThus, a free people will be governed by a law that is not arbitrary,\nbut rather corresponds to what is fit, and is able to be apprehended\nby reason. Her history is an account of the struggle of the English\npeople to maintain their freedom in this sense, against the\npretensions of Stuart absolutism and the imposition of arbitrary\nsway.\n2.1 Macaulay’s republicanism\n\nWhile it is clear that Macaulay was a supporter of some form of\n“republican” liberty, it is less clear whether she was an\nout and out supporter of republicanism, in the constitutional sense,\naccording to which republicans are opposed to monarchy. In the context\nof James Boswell’s visit to Corsica, and his subsequent support of the\nleader of the Corsican independence movement, General Paoli, Macaulay\noutlined a republican constitution for Corsica, in a letter to Paoli,\nwhich she published with her reflections on Hobbes (Macaulay 1767).\nShe does not seem to have thought that, in general, monarchical\ngovernments are incompatible with republican liberty, so long as the\nmonarch is constrained by a constitution, governed by law, and the\nliberty of the people is protected by parliament. She was not opposed\nto the mixed English constitution, but her design for a republic is\ninteresting for the principles on which she thought government should\nbe founded.\n\nMacaulay begins her letter to Paoli with a strong statement in favour\nof democracy,\n\n\nOf all the various models of republics, which have been exhibited for\nthe instruction of mankind, it is only the democratical system,\nrightly balanced, which can secure the virtue, liberty and happiness\nof society. (Macaulay 1767, 42)\n\n\nHer use of the phrase “the democratical system, rightly\nbalanced” suggests the influence of James Harrington’s The\nCommonwealth of Oceana on her thinking, and the Hills have\nsuggested that one might consider her an “aristocratic\nrepublican” with similar views to Harrington (Hill and Hill\n1967, 398; Hill 1992, 177). This does not, however, sit well with her\ngeneral opposition to the inequalities of wealth and power consequent\non aristocracy, which we will see are at the heart of her opposition\nto Burke. She is serious when she claims that,\n\n\nThe very nature of slavish dependence and proud superiority are\nequally baneful to the virtues inherent in mankind: the first, by\nsedulous attention and mean adulation to please its master,\nundermines, and at last subdues the innate generous principles of the\nsoul; and the fond delights of superiority extinguish all the virtues\nwhich ennoble human nature, such as self-denial, general benevolence,\nand the exalted passion of sacrificing private views to public\nhappiness.\n\n\nAccording to Macaulay, inequality is one of the factors which\nmilitates against a populace being motivated to act in accordance with\nthe immutable moral truths. And, she will later call monarchy\nsupported by aristocracy “the very worst species of\ngovernment” (Macaulay 1778, 311). A democratical system requires\nnot simply constitutional arrangements, but also mechanisms to ensure\nthat the populace are sufficiently virtuous so as not to be motivated\nto undermine those arrangements. This will lead to her later interest\nin education. But in the letter to Paoli she suggests only economic\nand procedural mechanisms in order to protect the democratic\nconstitution from dissolution.\n\nHer model for a democratic constitution is a bicameral government made\nup of a senate and a house of representatives. The relatively small\nsenate, of about fifty members, debates and proposes laws. The larger\nhouse of representatives, elected by the people, from the people, also\ndebates but does not propose, but rather rejects or accepts the\nproposals of the senate. The members of the senate are elected, by the\nrepresentatives, from among their number, for three-year terms, with\nno re-election within a three-year lapse of time. One third of the\nsenate is replaced yearly. Generals, admirals, magistrates and other\ncivil officers are to sit in the Senate and vote, but are elected by\nthe representatives to one-year terms from among those who have\nachieved senatorial rank. The two houses of Parliament are also to act\nas courts of appeal for the administration of justice. Two mechanisms\nare proposed to prevent the corruption of the constitution by the\naccumulation of power in individual hands: the strict rotation of\nfunctions, and the “right balancing” of wealth.\n\nMacaulay argues that it was the failure to guard against the growth of\ninequalities in wealth that led to the downfall of the Roman\nrepublics.\n\n\nHad the Agrarian been ever fixed on a proper balance, it must have\nprevented that extreme disproportion in the circumstances of her\ncitizens, which gave such weight of power to the aristocratical party,\nthat it enabled them to subvert the fundamental principles of the\ngovernment, and introduce those innovations which ended in anarchy.\nAnarchy produced its natural effect, viz. absolute monarchy (Macaulay\n1767, 35).\n\n\nThe right balancing of wealth is to be ensured by estates being\nequally divided among sons, and if there are none living, between the\nclosest male relatives. She suggests no female inheritance, and the\nabolition of dowries, though unmarried women are to be supported by\nannuities provided by their brothers (Macaulay 1767, 37). Since this\nappears to deprive women of any economic power, and presumably\nexcludes them from parliamentary representation, this feature of her\nproposals has been disappointing to feminists, and it has been claimed\nthat she was no defender of women’s rights (Staves 1989). Her later\nworks show that she was nevertheless sympathetic to women’s plight,\nand she might be excused, in a context in which women’s power was\nclosely associated with luxury and aristocratic privilege, for\nsacrificing women’s apparent interests for the sake of equality.\n2.2 Macaulay’s History and her response to Hobbes\n\nMacaulay has been called a “patriot historian” and her\nhistory is certainly intended to praise the English\n“patriots” who stood up for their fundamental rights\nagainst the absolutist tendencies of James I and Charles I (Pocock\n1998). Her account of the years leading up to the Civil War\nconstitutes a litany of acts of illegal taxation, abuses of power,\narbitrary arrest and inhumane punishments. She praises in particular\nSir John Elliot, “as the first martyr to the pre-eminent cause\nof liberty,” mentioning in particular a manuscript by him in\nwhich he argues that kings are subject to laws (Macaulay\n1763–83, 2.81). But she is not simply a blind defender of the\nancient constitution, or committed to English liberty for its own\nsake. She believes in the possibility of moral progress, and, as is\nalready clear from her letter to Paoli, she sees the maintenance of a\njust political constitution, and the development of individual virtue,\nas inseparably intertwined. Thus she asserts in her response to\nBurke’s Reflections on the Revolution in France that English\nliberties are not simply grounded in customs associated with the\nEnglish monarchy.\n\n\nI have myself always considered the boasted birthright of an\nEnglishman, as an arrogant pretension, built on a\nbeggarly foundation. It is an arrogant pretension, because it\nintimates a kind of exclusion to the rest of mankind from the same\nprivileges; and it is beggarly, because it rests our legitimate\nfreedom on the alms of our princes. (Macaulay 1790,\n31–2)\n\n\nIn her Loose remarks on certain positions to be found in Mr.\nHobbes’s Philosophical Rudiments of Government and Society she\nrebuts Hobbes’s purely political conception of the state, countering\nit with her own more moralised conception of the nature of political\nauthority, which also informs her account of the Civil War\n(Gunther-Canada 2006).\n\nShe begins with Hobbes’s claim that humans are not sociable by nature,\nwhich she renders as his denial of the proposition that “man is\na creature born fit for society.” According to Hobbes, as she\nrepresents his doctrine,\n\n\n… man cannot desire society from love, but through hope of\ngain: therefore, says he, the original of all great and lasting\nsocieties consisted, not in the mutual good will men had toward each\nother, but of the mutual fear they had of each other. (Macaulay 1767,\n1)\n\n\nBut she accuses Hobbes of contradicting himself, because, according to\nwhat he also accepts, man is a creature fit for society.\nHobbes allows that there is a law of nature, which is the law of right\nreason. This is the same law of nature that Locke recognises, and is\nfundamentally the Golden Rule, “do unto others as you would have\nthem do unto you.” Humans need only to acquire reason in order\nto be able to recognise this rule. And while they may not be born with\nthe capacity to reason, just as they are not born with the capacity to\nwalk, they are born with the means to acquire that capacity. Macaulay\nconcludes:\n\n\nTherefore man, by being born with the necessary means, is born a\ncreature apt for reason; and a creature apt for reason is a creature\nfit for society. (Macaulay 1767, 3)\n\n\nSince moral principles are immutable truths grounded in the nature of\nthings, and discoverable by reason, humans as rational creatures are\nborn capable of discovering these truths, and while their natural\nrationality may need to be developed by education, this potential for\nrationality is all that is needed for humans to be deemed naturally\nsociable.\n\nMacaulay moves on to criticize Hobbes’s strange doctrine in relation\nto contracts, according to which the people contract with each other\nto be governed by the sword of an absolute monarch. Implicitly relying\non the moral conception of a just contract, Macaulay argues that a\ncontract requires at least two parties. If one of those parties were\nto dissolve after the contract, as Hobbes suggests the sovereign\npeople do, then the contract would be null and void (Macaulay 1767,\n6–7). While this response may not satisfy defenders of Hobbes,\nit allows us to understand Macaulay’s conception of the social\ncontract as an implicit or explicit contract between the people and\nsome individual or assembly, according to which the people transfer a\nlimited power for the sake of the common good, and retain the right to\ndeclare the contract null, in case the other party fails to keep up\ntheir end of the bargain. It is in this light that she represents the\nexecution of Charles I.\n\n\nThat the government is the ordinance of man; that, being the mere\ncreature of human invention, it may be changed or altered according to\nthe dictates of experience, and the better judgment of men; that it\nwas instituted for the protection of the people, for the end of\nsecuring, not overthrowing the rights of nature; that it is a trust\neither formally admitted or supposed; and that the magistracy is\nconsequently accountable; will meet with little contradiction in a\ncountry enlightened with the unobstructed ray of rational learning.\n(Macaulay 1763–83, 430–1)\n\n\nHer text at this point is liberally sprinkled with references to\nLocke, one of her major sources for the doctrine of republican\nliberty, which underpins the people’s right to overthrow a monarch who\nhas made himself a tyrant, and in effect reinstituted a state of\nnature.\n\nShe objects also to Hobbes’s claim that there are no natural moral\nrights and obligations which connect parents and children. Parents\nhave an obligation to care for their children which derives from the\nnature of the relationship between them,\n\n\n…reason and morality strongly urges the care and preservation\nof an existence by themselves occasioned as a duty never to be\nomitted; by the law of justice, therefore, they, being thus bound to\nthis act, cannot have it in their option whether they will do it or\nnot: but Mr. Hobbes will rather advance any absurdity, than own that\npower has its rights from reasonable causes. (Macaulay 1767, 10)\n\n\nChildren’s obligations to parents, by contrast, are grounded in\ngratitude, which is appropriate in relation to the benefits conferred,\nand so are not binding if parents have not fulfilled their duties to\ntheir children.\n\nThe bulk of the rest of Macaulay’s response to Hobbes consists in\narguments against his defence of monarchy. In general these do not add\nmuch to the principles that she has already laid down, but they do add\nsome practical reasons for thinking that monarchical governments will\nnearly always be defective, which are echoed in Macaulay’s histories.\nShe points out that it is almost impossible to give advice to absolute\nmonarchs, and they are likely to be surrounded by favourites, placemen\nand flatterers. In her histories she provides many examples of the\ninconveniences that accompany monarchical power. Commenting on the\ndeath of Buckingham she points to him as\n\n\n… an everlasting monument of the contemptible government that\nmagnanimous nations must submit to, who groan under the mean, though\noppressive yoke of an arbitrary sway.\n\n\nFor, as a result of the power of individual monarchs, he\n\n\n… with no other eminent qualities than what were proper to\ncaptivate the hearts of the weakest parts of the female sex, had been\nraised by these qualities to be the scourge of three kingdoms; and, by\nhis pestilent intrigues, the chief cause of that distress which the\nFrench protestants at this time languished under. (Macaulay\n1763–83, 2.7–8)\n\n\nElsewhere she sums up the reign of Queen Anne with the comment that\nshe\n\n\n… was a glaring example to shew the ticklish state in which\nsociety is involved, whose welfare depends on the conduct of an\nindividual; since a high share of virtue and understanding, those\nchoicest gifts of heaven, are dispensed by the Creator with so sparing\na hand, that we find a very few individuals in any age whom we can in\nthis respect mark as the favourites of heaven. (Macaulay 1778,\n271)\n\n2.3 Macaulay’s History as a response to Hume\n\nIt has often been noticed that Macaulay’s history was read as a\nresponse to the popular history of the period published by David Hume,\nand certainly, Macaulay’s understanding of the significance of the\nEnglish Civil War, the virtues of the republicans, and the grounds of\nmorality, challenge Hume. Their ideas belong to two diametrically\nopposed strands of Enlightenment thought. Her religious and ethical\nviews belong to the “moderate enlightenment”, as\ncharacterised by Jonathan Israel, while her politics are radical. By\ncontrast, Hume is a naturalist and sceptic whose religious views are\nin line with those that Israel associates with the “radical\nenlightenment”, yet he is a political conservative (Israel 2010,\n2011; Green 2011; Green 2020). As mentioned above, a tension exists in Locke’s\nphilosophy between his political ideals, which propose the existence\nof a natural law, which can be known by reason, and his general\ncommitment to an empiricist epistemology. Hume develops Locke’s\nempiricism in the direction of its sceptical implications, resulting\nin rejection of the existence of God, immutable moral truth and causal\nnecessity. By contrast, Macaulay follows Locke the political\nphilosopher, and accepts the existence of God, and immutable moral\ntruth, without concerning herself too deeply with regard to the\nquestion of how it is that an “abstract fitness of things”\ncan “enable us to compare and perceive the agreement and\ndisagreement of our sensitive and reflex ideas”.\n\nFamously, Hume had criticised those moral theorists whose doctrines\nMacaulay continued to assert,\n\n\n… who affirm that virtue is nothing but a conformity to reason;\nthat there are eternal fitnesses and unfitnesses of things, which are\nthe same to every rational being that considers them; that the\nimmutable measure of right and wrong impose an obligation, not only on\nhuman creatures, but also on the Deity himself: (Hume 1964,\n2.234–5)\n\n\nHe goes on to argue that moral injunctions motivate, and that since\nonly the passions can motivate, moral injunctions must be grounded in\nthe passions. Ultimately, for Hume, what is good is what is useful, a\nmodern version of the Epicureanism, which Burnet had argued, follows\nfrom empiricism. For Hume, political constitutions are not grounded in\nimmutable truths, but are based in convention. Since the functioning\nof a set of conventions depends on people agreeing to abide by certain\nrules, which are in themselves arbitrary, it is important that people\nrevere authority. For him, the execution of Charles I was a tragedy,\nbrought about by deluded enthusiasts. And he comments in relation to\nthis act:\n\n\nGovernment is instituted, in order to restrain the fury and injustice\nof the people; and being always founded on opinion, not on force, it\nis dangerous, by these speculations, to weaken the reverence, which\nthe multitude owe to authority, and to instruct them before-hand, that\nthe case can ever happen, when they may be free’d from their duty of\nallegiance. (Hume 1754, 1.470)\n\n\nMacaulay’s fundamental attitude to Hume’s history is evident in a\nshort correspondence, which took place in 1764, after a copy of the\nfirst volume of her history had been sent to him. Here Macaulay\nsuccinctly argues that Hume’s conventionalism implies an obligation to\nconservatism. Hume suggests that he and Macaulay do not differ as to\nthe facts, but rather on the interpretation that they place on them\nand he continues: \n\n\nI look upon all kinds of subdivision of power, from the monarchy of\nFrance to the freest democracy of some Swiss cantons, to be equally\nlegal, if established by custom and authority. (“Account of the\nLife” 1783, 331; Macaulay 2019, 38)\n\n\nMacaulay’s response is: \n\n\nYour position, that all governments established by custom and\nauthority carry with them obligations to submission and allegiance,\ndoes, I am afraid, involve all reformers in unavoidable guilt, since\nopposition to established error must needs be opposition to authority.\n\n\n\nAs a serious reformer, she believed in objective universal standards\nof justice, which were not being upheld in the Great Britain of her\nday, just as they had not been during the period that led up to the\nCivil War.\n3. The History in Letters and Macaulay as a critic of Burke\n\nHer criticism of contemporary politics is the subject of A History\nof England, from the Revolution to the present time, in a series of\nletters to the Reverend Doctor Wilson in which she argues that,\nfar from having been an advance in English constitutional\narrangements, the Revolution of 1688 was a missed opportunity.\nAlthough\n\n\n… the power of the Crown was acknowledged to flow from no other\nfountain than of a contract with the people … the new monarch\nretained the old regal power over parliaments in its full extent; he\nwas left at liberty to convoke, adjourn, or dissolve them at his\npleasure; he was able to influence elections, and oppress\ncorporations; he possessed the right of chusing his own council, of\nnominating all the great officers of the state, the household, the\narmy, the navy, and the church; the absolute command over the militia\nwas reserved to the crown; and so totally void of improvement was the\nRevolution system, that the reliques of the star chamber was retained\nin the office of the Attorney-General, who in the case of libels has\nthe power of lodging a vexatious, and even false information, without\nbeing subjected to the penalty of cost or damage. (Macaulay 1778,\n4–5)\n\n\nThe argument developed in this history is that without appropriate\nconstraints on the power of the crown, parliament had inevitably\nbecome a tool of court policy. In the second volume of her\neight-volume history, she had given an extended account of Wentworth’s\nmanipulation of the Irish parliament, during Charles I’s reign,\ncommenting that it showed “that parliaments are noxious things\nwhen they become the dupes of ministers” (Macaulay\n1763–83, 2.184–5). The relevance of this reflection for\ncontemporary politics would not have been lost on her readers, and she\nhad anticipated the argument developed in A History of England,\nfrom the Revolution to the present time in her first response to\nBurke.\n3.1 Response to Thoughts on the Cause of the Present Discontents\n\nBurke’s pamphlet was prompted by two proposed pieces of legislation,\nwhich he argued would, if passed, have undermined the independence of\nParliament. One, a consequence of the controversy concerning Wilkes,\nwould have allowed Parliament to expel any of its members at its\npleasure. The other committed the Parliament to paying the debts\naccumulated in the Civil List. These bills, he suggested “must\nestablish such a fund of rewards and terrors as will make Parliament\nthe best appendage and support of arbitrary power that ever was\ninvented by the wit of man” (Burke 1770, 94). He looks back with\nsome nostalgia to the time of Queen Anne, when the Whig party had\ncontrol of the parliament, and argues that it is only through the\npower of parties, grounded in aristocratic influence, that the\nparliament can exercise an effective control over the executive (Burke\n1770, 109). Macaulay does not disagree with Burkes’ analysis of the\ncontemporary situation, nor that the increasing dominance of the court\nwas in effect making parliament a tool of court policy, but she rounds\non Burke for his inadequate analysis of the causes of the contemporary\nstate of affairs. It was in fact the aristocratic factions, jostling\nfor power, which had enabled the court to deprive the parliament of\neffective means of controlling the monarch. The Whigs had played a\nmore destructive role in this process than the Tories, because they\nhad concealed their desire for power under the rhetoric of\nliberty.\n\n\nA system of corruption began at the very period of the Revolution, and\ngrowing from its nature with increasing vigor, was the policy of every\nsucceeding administration. To share the plunder of a credulous people,\ncabals were formed between the representatives and the ministers.\nParliament, the great barrier of our much boasted constitution, while\nit preserved its forms, annihilated its spirit; and, from a\ncontrouling power over the executive parts of government, became a\nmere instrument of regal administration. (Macaulay 1770, 13)\n\n\nWhat is required, according to Macaulay, in order to restore some\nindependence and authority to parliament, is triennial elections, in\nplace of the septennial ones, which had been brought in during\nWilliam’s reign, and which placed parliamentarians in a position to\naccumulate too much power of patronage, as well as “a more\nextended and equal power of election” (Macaulay 1770, 28).\n3.2 Response to Reflections on the Revolution in France\n\nMacaulay’s last published work goes to the heart of her disagreement\nwith Burke over the source of political legitimacy. Although Burke did\nnot share Hume’s religious scepticism, like Hume he claimed government\nto be grounded in opinion, tradition, and respectful awe of\nsuperiority, and he wrote his Reflections to lament the way\nin which the French revolutionaries had debased the monarchy, in terms\nreminiscent of Hume’s accusation that the Civil War levelers had,\n“weakened the reverence, which the multitude owe to\nauthority”. Burke’s immediate target was a sermon preached by\nRichard Price at the Old Jewry, on the anniversary of the Glorious\nRevolution of 1688, in which Price declared that the king of Great\nBritain owes his crown to the choice of the people (Burke 2004,\n96–7). Against this, Burke argues that the intention of the\nDeclaration of Right, which established William II on the\nthrone, was to declare the rights and liberties of the subjects of\nGreat Britain, and to settle the succession of the crown. So, despite\na small deviation in the line of succession, British kings continued\nto owe their crowns to inheritance in the royal line (Burke 2004,\n100). He quotes the earlier Petition of Right to show that it\nis inherited custom that grounds and legitimizes the government.\n\n\nIn the famous law of the 3d of Charles I. called the Petition of\nRight, the parliament says to the king, “your subjects have\ninherited this freedom,” claiming their franchises not\non abstract principles “as the rights of men,” but as the\nrights of Englishmen, and as a patrimony derived from their\nforefathers.\n\n\nMacaulay responds that, if the rights of Englishmen are not ultimately\ngrounded in abstract right, they are no rights at all. For if they\nultimately rest on the weakness or generosity of previous kings, then\nthey can with equal right be overturned by subsequent powerful or less\nkindly monarchs (Macaulay 1790, 30–1). So, if there are rights\nthey must be grounded in universal rights.\n\nJust as she had done in her earlier response to Burke, Macaulay\nattacks his claim that an aristocracy is necessary for civilized\nsociety, and necessary in order to defend the state. There is no need\nto have an opulent class for there to be elements in the population\nwho care about the nation, for “every citizen who possesses ever\nso small a share of property, is equally as\ntenacious of it as the most opulent member of society” (Macaulay\n1790, 40–1). Inequality, she argues, in fact leads to envy, and\nultimately civil disturbance. And while she agrees that different\nclasses have different interests she asserts:\n\n\n… I know of no rational objection; nor can I think of\nany expedient to remove the well-grounded apprehensions of the\ndifferent interests which compose a commonwealth, than a fair\nand equal representation of the whole people;\n(Macaulay 1790, 48)\n\n\nThe French have moved far closer to this ideal, with a broad\nfranchise, than the English, with their pocket boroughs, which can be\nbought and sold, and their very limited representation.\n\nMacaulay concludes her pamphlet with a dilemma for all those who claim\nthat authority resides in conventions, which cannot be questioned or\noverthrown.\n\n\nFor if we say that lawful governments are formed on the\nauthority of conventions, it will be asked, who gave these\nconventions their authority? If we grant that they derived their\nauthority from the assent of the people, how came the people,\nit will be said, to exert such an authority at one period of\nsociety, and not at another? If we say it was necessity that\nrecovered to the social man the full rights of his nature, it will be\nasked, who is to be the judge of this necessity? why\ncertainly the people.\n\nThus, in every light in which we can place the argument, in\nevery possible mode of reasoning, we shall be driven back to elect\neither the first or the second of these propositions; either that an\nindividual, or some privileged persons, have an inherent and\nindefeasible right to make laws for the community, or that this\nauthority rests in the unalienable and indefeasible rights of man.\n(Macaulay 1790, 94–5)\n\n\nSince she takes it as accepted that the doctrine of the indefeasible\nright of kings is dead, she is able to conclude that, government,\n“can have no legitimate force, but in the\nwill of the people” (Macaulay 1790, 95).\n4. Macaulay and America\n\nApplying the principle that rights, if they exist at all, are\nuniversal, it is not surprising that Macaulay attempted to get her\nfellow country-men to see that injustice of taxing the colonies, while\nthey were not given any representation in the British Parliament. In\nher Address to the people of England, Scotland and Ireland on the\npresent important crisis of affairs, she called on the British\npeople to support the rights of the Americans, and to join with them\nin order to protect themselves from the encroachment of their own\nliberties. She held out to Britons what a loss it would be if, as a\nresult of a war of Independence they were to be deprived of all the\ncommercial advantages that flowed from the Empire, and were left\npossessing only their own “foggy islands” (Macaulay 1775,\n27). But her fundamental appeal is not to the self-interest of her\ncountry-men, who she suspects may think that their own burden of\ntaxation is lightened by that placed on the Americans, but to the\nprinciple that it is only by supporting the rights of others that one\ncan in the long run support one’s own rights. For her pains she was\nrepresented in the Westminster Magazine as a dagger-wielding\nhybrid of Roman matron and Indian chief, about to plunge her weapon\ninto Britannia’s breast (Davies 2005, 152).\n\nDuring this period she corresponded with John and Abigail Adams, James\nOtis and Mercy Otis Warren, Benjamin Franklin and Sarah Prince-Gill,\namong numerous other colonists (Davies 2005, 127–9; Letzring\n1976; Macaulay 2019). In the second edition of her Loose Remarks she printed\nan exchange of letters with Benjamin Rush, in which he praised her\npolitical principles as well as offering some minor criticisms.\nMacaulay concludes her response to him by promoting to the Americans\n“the general principles of the rights of mankind inculcated in\nmy great work” (Macaulay 1769, 35). Indeed, it is clear that the\nfirst five volumes of her eight volume history very clearly spell out\nthe principles that justified the War of Independence, and she was\nfeted when she travelled through nine of the thirteen states with her\nsecond husband. Despite her support for the Americans, as the actual\nConstitution was developed, she was not convinced that it would not be\ncorrupted, and in a correspondence with Mary Otis Warren the two women\nexpressed, with some prescience, their concerns that the arrangements\ndid not sufficiently protect against tendencies which would allow\naristocratic wealth, and the consequent corruption of the principles\nof liberty, to re-emerge (Hay 1994, 314).\n5. Thoughts on progress, liberty and education\n\nMacaulay believed in the existence of moral truths, which are\n“interwoven in the nature of contemplative objects” and\nwhich exist independently of God or human will. Like other abstract\ntruths, they can be discovered through the use of reason. She defends\nthis intellectualism in her Treatise on the immutability of moral\ntruth, and also sets out to refute the libertarian account of\nfreedom of the will developed by Dr William King in his Concerning\nthe Origin of Evil, as well as the philosophy set out in\nBolingbroke’s Philosophical Works.\n\nIn The Treatise she also puts forward her objections to all\nthose theories of the source of moral injunctions, which, like\nBolingbroke’s account, attempt to reduce them to rules which are in\nour rational self-interest, arguing that “… those who\nonly regard virtue as a principle, convenient for general use, will\ndiscard it whenever that general interest comes in opposition to\nself” (Macaulay 1783, 77). Against such views she argues that\nthe genuine rational interest of a rational being is to act in\naccordance with the dictates of reason. Had God intended us simply to\nmaximise our own selfish pleasures in this life, he would have given\nus appropriate instincts, for\n\n\n… that power of combining and generalizing his ideas, in such a\nmanner as to apprehend truths of the most abstract nature, with the\npower of memory in the large extent in which it is found in human\nexistence, are superfluous and mischievous gifts on the principle of\nhuman mortallity. (Macaulay 1783, 98)\n\n\nBut the fact that we have reason, and can appreciate the abstract\nprinciples of right, implies that our true self-interest is to act in\naccordance with the principles of reason, which are the principles of\nmoral obligation.\n\n\nIndependent of those pleasurable sensations which attend the refined\naffections, and the elevated sentiments and passions, there is a\nprinciple of rational agency, which corresponds with the precise\nadmeasurement of every action, with a rule of right; although the\nconduct it directs, militates against natural inclination, against the\ninterest of natural affection, and where every pleasurable sensation\nis sacrificed to the conviction of judgement, and to the rigid\ndictates of a well informed understanding. (Macaulay 1783, 129)\n\n\nShe concludes that, by considering what a rational moral being would\ndesire, “we gain an idea of rational interest which must ever\nattend on rational nature …” (Macaulay 1783, 130).\n\nRather than solving the problem of evil by allowing that there are\nuncaused choices, Macaulay attempts two alternative solutions. One\ninvolves the thought, which she also attributes to Addison, that since\nwe cannot be assured that virtue is rewarded in this world, we should\ndeduce the existence of a future state of happiness in which the\napparent injustices in this world are made good (Macaulay 1783,\n94–6). The other rests on her understanding of the circumstances\nnecessary for the perfectibility of humanity. Man, she claims\n\n\n… is placed on this terrestrial globe, as in a nursery, or soil\naptly fitted to give strength and vigour, and a more advanced maturity\nto his young and infirm reason; that he is placed on this terrestrial\nglobe as in a school adapted to the advantages of a practical\nexperience; and that he is surrounded with difficulties and hostile\npowers, for the purpose of enlarging his experience, and inducing a\nstate of trial of that virtue which his reason and his experience\nenables him to acquire. (Macaulay 1783, 234)\n\n\nHowever, she is forced ultimately to admit that neither of these\ndoctrines entirely relieves God of the responsibility for evil, and\nconsoles herself with the observation that the believers in arbitrary\nfree will are in no better position than those who accept the doctrine\nof the will which she calls, “moral necessity” (Macaulay\n1783, 232).\n5.1 Freedom of the will\n\nThose who have published commentaries on Macaulay’s views on freedom\nof the will are divided over exactly how the doctrine she develops\nfits into standard categories. Martina Reuter has argued that what\nMacaulay offers is a version of rationalist compatibilism, while\nothers have presumed that she is a hard determinist or modern\nCalvinist (Reuter 2007; Hilton 2007, 67–72; O’Brien 2009, 168;\nGreen and Weekes,2013). Part of the difficulty of understanding\nMacaulay’s position stems from the fact that she writes in opposition\nto those who make free choice arbitrary, and so concentrates on\nestablishing that choices are caused by motives, thus seeming to be\ncommitted to compatibilism, as is Hobbes, and yet she also wants to\naccept, with Plato and the Stoics, that we are only truly free when\nour acts are caused by reason, rather than by ill-conceived passion.\nShe understands individual moral progress as involving the\nstrengthening of reason, so that it can guide the passions, and lead\nthe individual to virtue. Political progress is intertwined with this\nindividual progress. Political structures compatible with the\nrationally perceptible moral law would be upheld were people virtuous,\nso education for virtue becomes a necessary means for effecting\npolitical progress, yet at the same time, the effects of faulty\nconstitutions militate against the capacity of people to attain\nvirtue, since in circumstances of excessive inequality, or where\ncorruption is endemic, both the poor and the rich are subject to\noverwhelming temptations to vice.\n\nAccording to Macaulay the necessitarian takes freedom to reside\nin,\n\n\n… those distinctions which the mind frames on the essential\ndifference which lies in those objects which present themselves to her\nperception, and which form the objects of her volition: else why have\nschools to train our youth in knowledge and in habits of virtue?\n(Macaulay 1783, 194)\n\n\nSo education is necessary in order to help people distinguish the\nessential differences between things, but she argues that it is also\nnecessary in order to counter the development of unhelpful\nassociations, and to train the mind to curb its passions, for Macaulay\nis heavily influenced by the associationist psychology of Edward\nHartley, Joseph Priestley and Jonathan Edwards. These metaphysical and\npsychological views inform her Letters on Education.\n5.2 Thoughts on Education\n\nThe Letters on Education is a rather loosely structured work\nthat contains, as well as letters on the appropriate form of\neducation, discussion of vegetarianism, and our duties to animals, a\nsignificant portion of the Treatise on the Immutability of Moral\nTruth, which takes up all of the third part of the later work. In\nthe Letters Macaulay sets out her rather sensible\nprescriptions for raising robust children, who are neither rendered\ntoo timid nor too bold, and she argues that given the differences in\nindividual character, educators may have to take different approaches\ndepending on the temperament of the child. She suggests that, although\nshe has dreamed of schemes of public education, she has come to the\nconclusion that the government of her time could not be trusted to\nprovide appropriate care, and so she advises a private education in\nwhich boys and girls are educated together and taught exactly the same\ncurriculum, with some concessions to sexual difference in the choice\nof exercise and sports.\n\nThe educational advice that Macaulay offers is remarkably practical.\nShe recommends that those who can afford it should have their children\ntaught dancing from a young age, as a means of acquiring grace, but\nshe also observes that in order for the lessons to be effective they\nshould be a pastime, not a task. Similarly, if children are given the\nimpression that being allowed to read is a privilege and\nentertainment, they will be happy to acquire the skill. While dancing\nand music are excellent sources of amusement, they should not take up\ntoo much time, and there are other amusements that Macaulay considers\nbeneficial, such as needlework for girls and handicrafts for boys. She\ndisapproves of punishments and practices that are intended to\nterrorize children, such as “shutting up in dark closets”,\nor being told tales of ghosts and ghouls who are coming to get them.\nChildren should be encouraged to be as independent as possible, since\nself-sufficiency is a great source of confidence and peace of mind.\nHer prescriptions for the early education of children concentrate on\nmaking them physically and emotionally robust, and on avoiding both\nthe extremes of timidity and cruel insensitivity. Up to the age of\ntwelve formal learning should be made pleasant and involve writing,\narithmetic, Latin grammar, geography, French learnt by the simple\nmethod of hiring some French domestic servants, and as much physics as\ncan be easily understood by children.\n\nAs children mature, Macaulay recommends a more formidable curriculum.\nAmong her recommended reading there is Plutarch’s Lives,\nRollin’s Ancient History in French, and Livy, works which\nwere surely early influences on her own thought. She puts off learning\nGreek until fifteen, and moral philosophy in the form of works by\nCicero, Plutarch, Seneca and Epictetus until sixteen, but expects her\npupils, by the age of eighteen to be reading Plato, Demosthenes,\nSophocles, Euripides and Homer in Greek, as well as Caesar and Cicero\nin Latin. Among modern philosophical texts she recommends two by James\nHarris, his Philosophical Arrangements and Hermes an\ninquiry into universal grammar, Lord Monboddo on language and\nEpea pteroenta by John Horne Tooke, her and her brother’s\nfriend. Political philosophy in the form of the works of James\nHarrington, Algernon Sidney, Locke, and Hobbes is left until the age of\nnineteen. There are two striking omissions from her curriculum; novels\nand the Scripture. The second she leaves until the student has reached\nthe age of twenty-one and after she or he has been introduced to\nmetaphysics through reading Ralph Cudworth, Plato and more Monboddo.\nShe argues that early reading of the Scripture is likely to lead to\nscepticism, and it is only after one has appreciated the morality of\nthe ancients that one can truly understand the moral advances of\nChristianity. To cap off this education she particularly recommends\nThe Light of Nature Pursued by Abraham Tucker.\n\nMacaulay does not approve of the popularity of novels, because of\ntheir concentration on the passion of love, and her suspicion that by\nreading them, young people, who are susceptible to this passion in any\ncase, will be encouraged to pursue it too early. Few novelists, she\nthinks, really accurately portray human sentiments, and she is\nparticularly critical of Samuel Richardson. But she by no means\nintends to deny the reading of novels for entertainment. Her position\nis simply that they do not in general provide a solid moral\nfoundation.\n\nThe whole of this educational program is grounded on her understanding\nof the foundations of morality and moral psychology. Education can\nteach the moral truths, but it also has to take account of unhelpful\nassociations, and those emotional characteristics which result in\nweakness of will, in order to form individuals who can act in\naccordance with the dictates of reason. Macaulay also comments on the\nneed for public education and the abolition of spectacles such as\npublic executions and animal slaughter, which brutalize and corrupt\npeople’s emotional responses.\n5.3 Feminism\n\nOne reason why Catharine Macaulay’s work has not received as much\nattention as it arguably deserves, is that contemporary interest in\nthe writings of historical women has tended to be motivated by\nfeminism, and some earlier commentators suggested that Macaulay was\nuninterested in the rights of women (Staves 1989). More recently, her\neducational views, commitment to acknowledging the influence of\nhistorical women, and recognition of her influence on Wollstonecraft\nis resulting in a fairer assessment of her importance to the history\nof English feminism (Gunther-Canada 1998, 2003; Hicks 2002; Hill 1995;\nTitone 2004; Berges 2013).\n\nIn speaking of the education of girls, Macaulay asserts, “my\npride and my prejudices lead me to regard my sex in a higher light\nthan as the mere objects of sense” (Macaulay 1790, 62). Indeed,\nshe believes that both sexes ought to aspire to virtue, which, since\nit involves understanding and acting on moral principles discernible\nby reason, is the same for both sexes. In order to justify the\negalitarian educational program that she proposes, she argues against\nRousseau that there are no characteristic differences between the\nsexes, that most of what is observed is the result of education, and,\nturning Pope’s words around, that “A perfect man is a woman\nformed after a courser mold” (Macaulay 1790, 204). Against\nRousseau’s attempt to make a single moral person out of the union of\nthe two sexes, she asserts that it outdoes, for contradiction and\nabsurdity, “every metaphysical riddle that was ever formed in\nthe schools” (Macaulay 1790, 206).\n\nMary Wollstonecraft favourably reviewed Macaulay’s Letters on\nEducation in November 1790, commenting on Macaulay’s chapter\ntitled, “No characteristic difference in sex” that\n“the observations on this subject might have been carried much\nfarther” (Wollstonecraft 1989, 7.31; Hill 1995; Coffee 2019). Her\nVindication of the Rights of Women does exactly that,\nextending Macaulay’s critique of Rousseau, and adding a great deal of\nfurther material criticising other authors who had contributed to\nrendering women objects of contempt. She echoes in her formulations\nthe arguments which Macaulay had given for providing an equal\neducation, according to which “there is but one rule of right\nfor the conduct of all rational beings … that true wisdom\n… is as useful to women as men” and that, as in the next\nworld “our state of happiness may possibly depend on the degree\nof perfection we have attained in this, we cannot justly lessen, in\none sex or the other, the means by which perfection … is\nacquired” (Macaulay 1790, 201–2).\n\nMacaulay’s belief that moral truth is not a matter of mere custom or\nconvention is central to her rejection of the contemporary situation\nof women. For despite the near universal custom of the subjection of\nwomen to the arbitrary power of men, she argues that\n\n\n… justice, in its more abstract or general sense, should be\nlittle considered, or little understood, by those who can believe that\nit is agreeable to the wisdom and goodness of an all-perfect Being to\nform two species of creatures of equal intelligence and similar\nfeelings, and consequently capable of an equal degree of suffering\nunder injuries, and should consign one of these species as a kind of\nproperty to a different species of their fellow-creatures, not endowed\nwith any qualities of mind sufficient to prevent the enormous abuse of\nsuch a power. (Macaulay 1783, 158)\n\n\nThus, although feminist rhetoric was not central to her histories and\nearlier pamphlets, she was fully convinced that the subjection of\nwomen to men was not compatible with rational principles of justice.\nIndeed, her assertion, in her response to Burke, that there should be\n“a fair and equal representation of the\nwhole people” could be interpreted as implying that she\nbelieved in the representation of women, for her choice in this\ninstance of sex-neutral language is surely intentional.\n6. Conclusion\n\nCatharine Macaulay was a significant contributor to eighteenth century\ndebates over human rights and republican liberty, who was celebrated\nand influential during her lifetime, but her histories and political\nworks had fallen into obscurity by the first half of the twentieth\ncentury. Interest in her was stimulated by Lucy Donnelly’s pioneering\narticle and research by Florence and William Boos, Christopher and\nBridget Hill, and Lynne Withey (Donnelly 1949; Boos 1976; Boos and\nBoos 1980; Hill and Hill 1967; Hill 1992; Withey 1976). Recognition of\nthe influence of her educational and political ideas has since grown\nconsiderably (Hay 1995; Waithe 1987–95, 3.217–22; Looser 2000, 2003;\nWiseman 2001; Schnorrenberg 1979, 1990; Hutton 2005, 2007, 2009;\nGunther-Canada 1998, 2003; Gardner 1998; Gardner 2000; Hicks 2002;\nTitone 2004; Hammersley 2010). Nevertheless, although beginning to be\nbetter known, she is usually only mentioned in passing in standard\naccounts of the development of democratic theory and feminism. Her\nmoralised understanding of the grounds of human rights and\njustification for democracy provide an important counter-balance to\nHobbesian versions of the social contract and deserve a far more\ncentral place in the history of liberal political theory than is\ncurrently the case (Green 2018; Green 2020).\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriTex\">Primary texts</a>",
            "<a name=\"SecTex\">Secondary texts</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriTex\">Primary texts</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "“Account of the Life and Writings of Mrs. Catharine Macaulay\nGraham,” 1783, <em>The European Magazine</em>, 4:\n330–4.",
                "Burke, Edmund, 1770, <em>Thoughts on the Cause of the Present\nDiscontents</em>, 4th edition, London: J. Dodsley.",
                "–––, 2004, <em>Reflections on the Revolution in\nFrance</em>, London: Penguin.",
                "Burnet, Thomas, 1989, <em>Remarks on John Locke by Thomas Burnet\nwith Locke’s Replies</em>, G. Watson and S. Doncaster (eds.), Yorkshire:\nBrynmill.",
                "Carter, Elizabeth, 1808, <em>A Series of Letters between Mrs.\nElizabeth Carter and Miss Catherine Talbot from the year 1741 to 1770.\nTo Which are Added Letters from Mrs. Carter to Mrs. [Elizabeth] Vesey\nbetween the years 1767 and 1787</em>, Volume 2, London: F.C &amp; J.\nRivington.",
                "Carter, Elizabeth, 1817, <em>Letters from Mrs. Elizabeth Carter,\nto Mrs. Montagu, between the Years 1755 and 1800. Chiefly upon\nLiterary and Moral Subjects</em>, Montagu Pennington (ed.),\nLondon: F. C. &amp; J. Rivington.",
                "Cockburn, Catharine Trotter, 1702, <em>A Defence of the Essay of\nHuman Understanding Written by Mr Locke. Wherein its Principles with\nreference to Morality, Reveal’d Religion, and the Immortality of the\nSould, are Consider’d and Justify’d: In Answer to Some Remarks on that\nEssay</em>, London: Printer for Will Turner at Lincolns-Inn Back-Gate,\nand John Nutt near Stationers-Hall.",
                "Harrington, James, 1656, <em>The Commonwealth of Oceana</em>,\nLondon: D. Pakeman.",
                "Harris, James, 1751, <em>Hermes: or, a Philosophical Inquiry\nConcerning Language and Universal Grammar</em>, London: H. Woodfall\nfor J. Nourse and P. Vaillant.",
                "–––, 1775, <em>Philosophical Arrangements</em>,\nLondon: J. Nourse.",
                "Hays, Mary, 1803, <em>Female biography; or Memoirs of Illustrious\nand celebrated women, of all ages and countries. Alphabetically\narranged</em>, 6 volumes, London: Richard Phillips.",
                "Hume, David, 1754, <em>The History of Great Britain</em> (Volume\n1), Edinburgh: Hamilton, Balfour and Neill.",
                "–––, 1964, <em>The Philosophical Works</em>,\nT. H. Green and T. H. Grose (eds.), 4 volumes, Aalen: Scientia\nVerlag.",
                "Locke, John, 1689, <em>Two Treatises of Government</em>, 2nd\nedition, Cambridge: Cambridge University Press, 1967.",
                "Macaulay, Catharine, 1763–83, <em>The history of England\nfrom the accession of James 1. to that of the Brunswick line</em>, 8\nvolumes, London: Printed for the author and sold by J. Nourse,\nJ. Dodsley and W. Johnston. (Volumes 5–8 are titled <em>The\nhistory of England from the accession of James 1. to the\nRevolution</em>, London: C Dilly.)",
                "–––, 1767, <em>Loose Remarks on certain\npositions to be found in Mr Hobbes’s “Philosophical rudiments of\ngovernment and society,” with a short sketch of a democratical\nform of government, In a letter to Signor Paoli</em>, London: T.\nDavies, in Russell-street, Covent Garden; Robinson and Roberts, in\nPater-noster Row; and T. Cadell, in the Strand.",
                "–––, 1769, <em>Loose Remarks on certain\npositions to be found in Mr Hobbes’ Philosophical Rudiments of\nGovernment and society with a short sketch of a democratical form of\ngovernment in a letter to Signor Paoli by Catharine Macaulay. The\nSecond edition with two letters one from an American Gentleman to the\nauthor which contains some comments on her sketch of the democratical\nform of government and the author’s answer</em>, London: W. Johnson,\nT. Davies, E. and C. Dilly, J. Almon, Robinson and Roberts, T.\nCadell.",
                "–––, 1770, <em>Observations on a Pamphlet\nentitled “Thoughts on the Cause of the Present\nDiscontents”</em>, 4th edition, London: Printed for Edward and\nCharles Dilly.",
                "–––, 1774, <em>A Modest Plea for the Property of\nCopy Right</em>, Bath: R. Cruttwell.",
                "–––, 1775, <em>Address to the People of England,\nScotland, and Ireland on the Present Important Crisis of Affairs</em>,\nLondon: Dilly.",
                "–––, 1778, <em>History of England from the\nRevolution to the Present Time in a Series of Letters to a\nFriend</em>, Bath: R. Cruttwell.",
                "–––, 1783, <em>A Treatise on the Immutability of\nMoral Truth</em>, London: A. Hamilton.",
                "–––, 1790, <em>Letters on Education. With\nobservations on religious and metaphysical subjects</em>, London: C.\nDilly.",
                "–––, 1790, <em>Observations on the Reflections\nof the Right Hon. Edmund Burke, on the Revolution in France, in a\nLetter for the Right Hon. The Earl of Stanhope</em>, London: C.\nDilly.",
                "–––, 2019, <em>The Correspondence of Catharine Macaulay</em>, K. Green (ed.), New York: Oxford University Press.",
                "Tooke, John Horne, 1786, <em>Epea pteroenta. Or, the diversions of\nPurley</em> (Part I), London: J. Johnson.",
                "Tucker, Abraham, 1768, <em>The light of nature pursued. By Edward\nSearch, Esq.</em>, 5 volumes, London: T. Jones.",
                "Wollstonecraft, Mary, 1989, <em>The Works of Mary\nWollstonecraft</em>, J. Todd and M. Butler (eds.), 7 volumes, London:\nPickering.\n</ul>\n<h3>"
            ],
            "<a name=\"SecTex\">Secondary texts</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Bergès, Sandrine, 2013, <em>The Routledge Guidebook to\nWollstonecraft’s A Vindication of the Rights of Woman</em>, London:\nRoutledge.",
                "Bolton, Martha Brandt, 1996, “Some aspects of the\nphilosophical work of Catharine Trotter Cockburn,” in <em>\nHypatia’s Daughters: Fifteen hundred years of women\nphilosophers</em>, Linda Lopez McAlister (ed.), Bloomington: Indiana\nUniversity Press, pp.139–164.",
                "Boos, Florence, 1976, “Catharine Macaulay’s <em>Letters on\nEducation</em> (1790): An early feminist polemic,”\n<em>University of Michigan Papers in Women’s Studies</em>, 2 (2):\n64–78.",
                "Boos, Florence, and William Boos, 1980, “Catharine Macaulay:\nHistorian and political reformer,” <em>International Journal of\nWomen’s Studies</em>, 3 (6): 49–65.",
                "Coffee, Alan, 2019 “Catharine Macaulay,” in <em>The\nWollstonecraftian Mind</em>, Sandrine Bergès, Eileen Hunt Botting, and\nAlan Coffee (eds.) London: Routledge, pp.198–210.",
                "Davies, Kate, 2005, <em>Catharine Macaulay and Mercy Otis\nWarren</em>, Oxford: Oxford University Press.",
                "Donnelly, Lucy Martin, 1949, “The Celebrated Mrs\nMacaulay,” <em>William and Mary Quarterly</em>, 6 (2):\n172–207.",
                "Eger, Elizabeth, and Lucy Peltz, 2008, <em>Brilliant Women:\n18th-Century Bluestockings</em>, London: National Portrait\nGallery.",
                "Gardner, Catherine, 1998, “Catharine Macaulay’s <em>Letters\non Education</em>: Odd but Equal,” <em>Hypatia</em>, 13 (1):\n118–137.",
                "–––, 2000, “Catherine Macaulay’s\n<em>Letters on Education</em>: What Constitutes a Philosophical\nSystem,” in <em>Rediscovering Women Philosophers: Philosophical\nGenre and the Boundaries of Philosophy</em>, Boulder, Colorado:\nWestview Press, pp.17–46.",
                "Geiger, Marianne B., 1986, <em>Mercy Otis Warren and Catharine\nMacaulay: Historians in the Transatlantic Republican Tradition</em>,\nPh.D. Dissertation, New York University.",
                "Green, Karen, 2011, “Will the Real Enlightenment Historian\nPlease Stand Up? Catharine Macaulay versus David Hume,” In\n<em>Hume and the Enlightenment</em>, C. Taylor and S. Buckle (eds.),\nLondon: Pickering and Chatto, pp.39–51.",
                "–––, 2012a, “Catharine Macaulay:\nPhilosopher of the Enlightenment,” <em>Intellectual History\nReview</em>, 22 (3): 411–426.",
                "–––, 2012b, “When is a Contract Theorist\nnot a Contract Theorist? Mary Astell and Catharine Macaulay as Critics\nof Thomas Hobbes,” in <em>Feminist Interpretations of Thomas\nHobbes</em>, N.J. Hirschmann and J.H. Wright (eds.), University Park,\nPennsylvania: The Pennsylvania University Press,\npp.169–189.",
                "–––, 2014, <em>A History of Women’s Political\nThought in Europe, 1700–1800</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2017, “Jane Austen and Catharine Macaulay,” <em>Persuasions</em>, 40: 177–83.",
                "–––, 2018, “Catharine Macaulay’s Enlightenment Faith and Radical Politics,” <em>History of European Ideas</em>, 44 (1):38–44.",
                "–––, 2020, <em>Catharine Macaulay’s Republican Enlightenment</em>, New York: Routledge.",
                "Green, Karen and Shannon Weekes, 2013, “Catharine Macaulay\non the Will,” <em>History of European Ideas</em>, 39 (3):\n409–425.",
                "Guest, Harriet, 2002, “Bluestocking Feminism,” <em>The\nHuntington Library Quarterly</em>, 65 (1/2): 59–80.",
                "Gunther-Canada, Wendy, 1998, “The Politics of Sense and\nSensibility: Mary Wollstonecraft and Catherine Macaulay Graham on\nEdmund Burke’s <em>Reflections on the Revolution in\nFrance</em>,” in <em>Women Writers and the Early Modern\nPolitical Tradition</em>, H. Smith (ed.), Cambridge: Cambridge\nUniversity Press, pp.126–147.",
                "–––, 2003, “Cultivating Virtue: Catharine\nMacaulay and Mary Wollstonecraft on Civic Education,” <em>Women\nand Politics</em>, 25(3): 47–70.",
                "–––, 2006, “Catharine Macaulay on the\nParadox of Paternal Authority in Hobbesian Politics,”\n<em>Hypatia</em>, 21(2): 150–173.",
                "Hammersley, Rachel, 2010, <em>The English Republican Tradition and\neighteenth-century France: between the ancients and the moderns</em>,\nManchester: Manchester University Press.",
                "Hay, Carla H., 1994, “Catharine Macaulay and the American\nRevolution,” <em>The Historian</em>, 56 (2): 301–16.",
                "Hicks, Philip, 2002, “Catharine Macaulay’s Civil War:\nGender, history, and Republicanism in Georgian Britain,”\n<em>Journal of British Studies</em>, 41 (2): 170–99.",
                "Hill, Bridget, 1992, <em>The Republican Virago: The Life and Times\nof Catharine Macaulay, Historian</em>, Oxford: Clarendon Press.",
                "–––, 1995, “The Links between Mary\nWollstonecraft and Catharine Macaulay: new evidence,”\n<em>Women’s History Review</em>, 4 (2): 177–92.",
                "Hill, Bridget, and Christopher Hill, 1967, “Catharine\nMacaulay and the Seventeenth Century,” <em>The Welsh History\nReview</em>, 3: 381–402.",
                "Hilton, Mary, 2007, <em>Women and the Shaping of the Nation’s\nYoung: Education and Public Doctrine in Britain 1750–1850</em>.\nAldershot: Ashgate.",
                "Hutton, Sarah, 2005, “Liberty, Equality and God: The\nReligious Roots of Catharine Macaulay’s Feminism,” in\n<em>Women, Gender and Enlightenment</em>, S. Knott and B. Taylor\n(eds.), Basingstoke: Palgrave Macmillan, pp.538–550.",
                "–––, 2007, “Virtue, God and Stoicism in\nthe thought of Elizabeth Carter and Catharine Macaulay,” in\n<em>Virtue, Liberty and Toleration: Political Ideas of European Women\n1400–1800</em>, J. Broad and K. Green (eds.), Dordrecht:\nSpringer, pp.137–148.",
                "–––, 2009, “The Persona of the Woman\nPhilosopher in Eighteenth-Century England: Catharine Macaulay, Mary\nHays, and Elizabeth Hamilton,” <em>Intellectual History\nReview</em>, 18 (3): 403–12.",
                "Israel, Jonathan, 2010, <em>A Revolution of the Mind: Radical\nEnlightenment and the Intellectual Origins of Modern Democracy</em>,\nPrinceton: Princeton University Press.",
                "–––, 2011, <em>Democratic Enlightenment.\nPhilosophy, Revolution, and Human Rights</em>, Oxford: Oxford\nUniversity Press.",
                "Letzring, Monica, 1976, “Sarah Prince Gill and the John\nAdams-Catharine Macaulay Correspondence,” <em>Proceedings of the\nMassachusetts Historical Society</em>, 88: 107–111.",
                "Looser, Devoney, 2000, <em>British Women Writers and the Writing\nof History</em>, Baltimore: The Johns Hopkins University Press.",
                "–––, 2003, “‘Those historical\nlaurels which once graced my brow are now in their wane’:\nCatherine Macaulay’s last years and legacy,” <em>Studies in\nRomanticism</em>, 42 (2): 203–25.",
                "O’Brien, Karen, 2009, <em>Women and Enlightenment in\nEighteenth-Century Britain</em>, Cambridge: Cambridge University\nPress.",
                "Pettit, Philip, 1997, <em>Republicanism: A Theory of Freedom and\nGovernment</em>, Oxford: Clarendon Press.",
                "Pocock, J. G. A., 1998, “Catherine Macaulay: patriot\nhistorian,” in <em>Women writers and the early modern British\npolitical tradition</em>, H. Smith (ed.), Cambridge: Cambridge\nUniversity Press, pp.243–258.",
                "Reuter, Martina, 2007, “Catharine Macaulay and Mary\nWollstonecraft on the Will,” in <em>Virtue, Liberty and\nToleration. Political Ideas of European Women 1400–1800</em>,\nJ. Broad and K. Green (eds.), Dordrecht: Springer, pp.149–169.",
                "Schnorrenberg, Barbara B., 1979, “The Brood-hen of Faction:\nMrs. Macaulay and Radical Politics, 1765–75,”\n<em>Albion</em>, 11: 33–45.",
                "–––, 1990, “An Opportunity Missed:\nCatherine Macaulay on the Revolution of 1688,” <em>Studies in\nEighteenth-Century Culture</em>, 20: 231–40.",
                "Sheridan, Patricia, 2007, “Reflection, Nature, and Moral\nLaw: The Extent of Catharine Cockburn’s Lockeanism in her <em>Defence\nof Mr. Locke’s Essay</em>,” <em>Hypatia</em>, 22 (3):\n133–51.",
                "Skinner, Quentin, 1998, <em>Liberty before Liberalism</em>,\nCambridge: Cambridge University Press.",
                "–––, 2008, <em>Hobbes and Republican\nLiberty</em>, Cambridge: Cambridge University Press.",
                "Staves, Susan, 1989, “‘The Liberty of a She-Subject of\nEngland’: Rights Rhetoric and the Female Thucydides,”\n<em>Cardozo Studies in Law and Literature</em>, 1(2):\n161–83.",
                "Titone, Connie, 2004, <em>Gender Equality in the Philosophy of\nEducation: Catherine Macaulay’s Forgotten Contribution</em>, New York:\nPeter Lang.",
                "Walmsley, J. C., Hugh Craig and John Burrows, 2016, “Authorship of Remarks Upon Locke’s Essay Concerning Human Understanding”, <em>Eighteenth-century Thought</em> 6:205–43.",
                "Wiseman, Susan, 2001, “Catharine Macaulay: history,\nrepublicanism and the public sphere,” in <em>Women, Writing and\nthe Public Sphere, 1700–1830</em>, E. Eger, C. Grant,\nC. Ó Gallchoir and P. Warburton (eds.), Cambridge: Cambridge\nUniversity Press,pp/181–199.",
                "Withey, Lynne E., 1976, ”Catherine Macaulay and the Uses of\nHistory: Ancient Rights, Perfectionism, and Propaganda,“\n<em>Journal of British Studies</em>, 16 (1): 59–83.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriTex\">Primary texts</a></h3>\n<ul class=\"hanging\">\n<li>“Account of the Life and Writings of Mrs. Catharine Macaulay\nGraham,” 1783, <em>The European Magazine</em>, 4:\n330–4.</li>\n<li>Burke, Edmund, 1770, <em>Thoughts on the Cause of the Present\nDiscontents</em>, 4th edition, London: J. Dodsley.</li>\n<li>–––, 2004, <em>Reflections on the Revolution in\nFrance</em>, London: Penguin.</li>\n<li>Burnet, Thomas, 1989, <em>Remarks on John Locke by Thomas Burnet\nwith Locke’s Replies</em>, G. Watson and S. Doncaster (eds.),  Yorkshire:\nBrynmill.</li>\n<li> Carter, Elizabeth, 1808, <em>A Series of Letters between Mrs.\nElizabeth Carter and Miss Catherine Talbot from the year 1741 to 1770.\nTo Which are Added Letters from Mrs. Carter to Mrs. [Elizabeth] Vesey\nbetween the years 1767 and 1787</em>, Volume 2, London: F.C &amp; J.\nRivington.</li>\n<li> Carter, Elizabeth, 1817, <em>Letters from Mrs. Elizabeth Carter,\nto Mrs. Montagu, between the Years 1755 and 1800. Chiefly upon\nLiterary and Moral Subjects</em>, Montagu Pennington (ed.),\nLondon: F. C. &amp; J. Rivington.</li>\n<li>Cockburn, Catharine Trotter, 1702, <em>A Defence of the Essay of\nHuman Understanding Written by Mr Locke. Wherein its Principles with\nreference to Morality, Reveal’d Religion, and the Immortality of the\nSould, are Consider’d and Justify’d: In Answer to Some Remarks on that\nEssay</em>, London: Printer for Will Turner at Lincolns-Inn Back-Gate,\nand John Nutt near Stationers-Hall.</li>\n<li>Harrington, James, 1656, <em>The Commonwealth of Oceana</em>,\nLondon: D. Pakeman.</li>\n<li>Harris, James, 1751, <em>Hermes: or, a Philosophical Inquiry\nConcerning Language and Universal Grammar</em>, London: H. Woodfall\nfor J. Nourse and P. Vaillant.</li>\n<li>–––, 1775, <em>Philosophical Arrangements</em>,\nLondon: J. Nourse.</li>\n<li>Hays, Mary, 1803, <em>Female biography; or Memoirs of Illustrious\nand celebrated women, of all ages and countries. Alphabetically\narranged</em>, 6 volumes, London: Richard Phillips.</li>\n<li>Hume, David, 1754, <em>The History of Great Britain</em> (Volume\n1), Edinburgh: Hamilton, Balfour and Neill.</li>\n<li>–––, 1964, <em>The Philosophical Works</em>,\nT. H. Green and T. H. Grose (eds.), 4 volumes, Aalen: Scientia\nVerlag.</li>\n<li>Locke, John, 1689, <em>Two Treatises of Government</em>, 2nd\nedition, Cambridge: Cambridge University Press, 1967.</li>\n<li>Macaulay, Catharine, 1763–83, <em>The history of England\nfrom the accession of James 1. to that of the Brunswick line</em>, 8\nvolumes, London: Printed for the author and sold by J. Nourse,\nJ. Dodsley and W. Johnston. (Volumes 5–8 are titled <em>The\nhistory of England from the accession of James 1. to the\nRevolution</em>, London: C Dilly.)</li>\n<li>–––, 1767, <em>Loose Remarks on certain\npositions to be found in Mr Hobbes’s “Philosophical rudiments of\ngovernment and society,” with a short sketch of a democratical\nform of government, In a letter to Signor Paoli</em>, London: T.\nDavies, in Russell-street, Covent Garden; Robinson and Roberts, in\nPater-noster Row; and T. Cadell, in the Strand.</li>\n<li>–––, 1769, <em>Loose Remarks on certain\npositions to be found in Mr Hobbes’ Philosophical Rudiments of\nGovernment and society with a short sketch of a democratical form of\ngovernment in a letter to Signor Paoli by Catharine Macaulay. The\nSecond edition with two letters one from an American Gentleman to the\nauthor which contains some comments on her sketch of the democratical\nform of government and the author’s answer</em>, London: W. Johnson,\nT. Davies, E. and C. Dilly, J. Almon, Robinson and Roberts, T.\nCadell.</li>\n<li>–––, 1770, <em>Observations on a Pamphlet\nentitled “Thoughts on the Cause of the Present\nDiscontents”</em>, 4th edition, London: Printed for Edward and\nCharles Dilly.</li>\n<li>–––, 1774, <em>A Modest Plea for the Property of\nCopy Right</em>, Bath: R. Cruttwell.</li>\n<li>–––, 1775, <em>Address to the People of England,\nScotland, and Ireland on the Present Important Crisis of Affairs</em>,\nLondon: Dilly.</li>\n<li>–––, 1778, <em>History of England from the\nRevolution to the Present Time in a Series of Letters to a\nFriend</em>, Bath: R. Cruttwell.</li>\n<li>–––, 1783, <em>A Treatise on the Immutability of\nMoral Truth</em>, London: A. Hamilton.</li>\n<li>–––, 1790, <em>Letters on Education. With\nobservations on religious and metaphysical subjects</em>, London: C.\nDilly.</li>\n<li>–––, 1790, <em>Observations on the Reflections\nof the Right Hon. Edmund Burke, on the Revolution in France, in a\nLetter for the Right Hon. The Earl of Stanhope</em>, London: C.\nDilly.</li>\n<li>–––, 2019, <em>The Correspondence of Catharine Macaulay</em>, K. Green (ed.), New York: Oxford University Press.</li>\n<li>Tooke, John Horne, 1786, <em>Epea pteroenta. Or, the diversions of\nPurley</em> (Part I), London: J. Johnson.</li>\n<li>Tucker, Abraham, 1768, <em>The light of nature pursued. By Edward\nSearch, Esq.</em>, 5 volumes, London: T. Jones.</li>\n<li>Wollstonecraft, Mary, 1989, <em>The Works of Mary\nWollstonecraft</em>, J. Todd and M. Butler (eds.), 7 volumes, London:\nPickering.</li>\n</ul>\n<h3><a name=\"SecTex\">Secondary texts</a></h3>\n<ul class=\"hanging\">\n<li>Bergès, Sandrine, 2013, <em>The Routledge Guidebook to\nWollstonecraft’s A Vindication of the Rights of Woman</em>, London:\nRoutledge.</li>\n<li>Bolton, Martha Brandt, 1996, “Some aspects of the\nphilosophical work of Catharine Trotter Cockburn,” in <em>\nHypatia’s Daughters: Fifteen hundred years of women\nphilosophers</em>, Linda Lopez McAlister (ed.), Bloomington: Indiana\nUniversity Press, pp.139–164.</li>\n<li>Boos, Florence, 1976, “Catharine Macaulay’s <em>Letters on\nEducation</em> (1790): An early feminist polemic,”\n<em>University of Michigan Papers in Women’s Studies</em>, 2 (2):\n64–78.</li>\n<li>Boos, Florence, and William Boos, 1980, “Catharine Macaulay:\nHistorian and political reformer,” <em>International Journal of\nWomen’s Studies</em>, 3 (6): 49–65.</li>\n<li>Coffee, Alan, 2019 “Catharine Macaulay,” in <em>The\nWollstonecraftian Mind</em>, Sandrine Bergès, Eileen Hunt Botting, and\nAlan Coffee (eds.) London: Routledge, pp.198–210.</li>\n<li>Davies, Kate, 2005, <em>Catharine Macaulay and Mercy Otis\nWarren</em>, Oxford: Oxford University Press.</li>\n<li>Donnelly, Lucy Martin, 1949, “The Celebrated Mrs\nMacaulay,” <em>William and Mary Quarterly</em>, 6 (2):\n172–207.</li>\n<li>Eger, Elizabeth, and Lucy Peltz, 2008, <em>Brilliant Women:\n18th-Century Bluestockings</em>, London: National Portrait\nGallery.</li>\n<li>Gardner, Catherine, 1998, “Catharine Macaulay’s <em>Letters\non Education</em>: Odd but Equal,” <em>Hypatia</em>, 13 (1):\n118–137.</li>\n<li>–––, 2000, “Catherine Macaulay’s\n<em>Letters on Education</em>: What Constitutes a Philosophical\nSystem,” in <em>Rediscovering Women Philosophers: Philosophical\nGenre and the Boundaries of Philosophy</em>, Boulder, Colorado:\nWestview Press, pp.17–46.</li>\n<li>Geiger, Marianne B., 1986, <em>Mercy Otis Warren and Catharine\nMacaulay: Historians in the Transatlantic Republican Tradition</em>,\nPh.D. Dissertation, New York University.</li>\n<li>Green, Karen, 2011, “Will the Real Enlightenment Historian\nPlease Stand Up? Catharine Macaulay versus David Hume,” In\n<em>Hume and the Enlightenment</em>, C. Taylor and S.  Buckle (eds.),\nLondon: Pickering and Chatto, pp.39–51.</li>\n<li>–––, 2012a, “Catharine Macaulay:\nPhilosopher of the Enlightenment,” <em>Intellectual History\nReview</em>, 22 (3): 411–426.</li>\n<li>–––, 2012b, “When is a Contract Theorist\nnot a Contract Theorist? Mary Astell and Catharine Macaulay as Critics\nof Thomas Hobbes,” in <em>Feminist Interpretations of Thomas\nHobbes</em>, N.J. Hirschmann and J.H. Wright (eds.), University Park,\nPennsylvania: The Pennsylvania University Press,\npp.169–189.</li>\n<li>–––, 2014, <em>A History of Women’s Political\nThought in Europe, 1700–1800</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2017, “Jane Austen and Catharine Macaulay,”  <em>Persuasions</em>, 40: 177–83.</li>\n<li>–––, 2018, “Catharine Macaulay’s Enlightenment Faith and Radical Politics,” <em>History of European Ideas</em>, 44 (1):38–44.</li>\n<li>–––, 2020, <em>Catharine Macaulay’s Republican Enlightenment</em>, New York: Routledge.</li>\n<li>Green, Karen and Shannon Weekes, 2013, “Catharine Macaulay\non the Will,” <em>History of European Ideas</em>, 39 (3):\n409–425.</li>\n<li>Guest, Harriet, 2002, “Bluestocking Feminism,” <em>The\nHuntington Library Quarterly</em>, 65 (1/2): 59–80.</li>\n<li>Gunther-Canada, Wendy, 1998, “The Politics of Sense and\nSensibility: Mary Wollstonecraft and Catherine Macaulay Graham on\nEdmund Burke’s <em>Reflections on the Revolution in\nFrance</em>,” in <em>Women Writers and the Early Modern\nPolitical Tradition</em>, H. Smith (ed.), Cambridge: Cambridge\nUniversity Press, pp.126–147.</li>\n<li>–––, 2003, “Cultivating Virtue: Catharine\nMacaulay and Mary Wollstonecraft on Civic Education,” <em>Women\nand Politics</em>, 25(3): 47–70.</li>\n<li>–––, 2006, “Catharine Macaulay on the\nParadox of Paternal Authority in Hobbesian Politics,”\n<em>Hypatia</em>, 21(2): 150–173.</li>\n<li>Hammersley, Rachel, 2010, <em>The English Republican Tradition and\neighteenth-century France: between the ancients and the moderns</em>,\nManchester: Manchester University Press.</li>\n<li>Hay, Carla H., 1994, “Catharine Macaulay and the American\nRevolution,” <em>The Historian</em>, 56 (2): 301–16.</li>\n<li>Hicks, Philip, 2002, “Catharine Macaulay’s Civil War:\nGender, history, and Republicanism in Georgian Britain,”\n<em>Journal of British Studies</em>, 41 (2): 170–99.</li>\n<li>Hill, Bridget, 1992, <em>The Republican Virago: The Life and Times\nof Catharine Macaulay, Historian</em>, Oxford: Clarendon Press.</li>\n<li>–––, 1995, “The Links between Mary\nWollstonecraft and Catharine Macaulay: new evidence,”\n<em>Women’s History Review</em>, 4 (2): 177–92.</li>\n<li>Hill, Bridget, and Christopher Hill, 1967, “Catharine\nMacaulay and the Seventeenth Century,” <em>The Welsh History\nReview</em>, 3: 381–402.</li>\n<li>Hilton, Mary, 2007, <em>Women and the Shaping of the Nation’s\nYoung: Education and Public Doctrine in Britain 1750–1850</em>.\nAldershot: Ashgate.</li>\n<li>Hutton, Sarah, 2005, “Liberty, Equality and God: The\nReligious Roots of Catharine Macaulay’s Feminism,” in\n<em>Women, Gender and Enlightenment</em>, S. Knott and B. Taylor\n(eds.), Basingstoke: Palgrave Macmillan, pp.538–550.</li>\n<li>–––, 2007, “Virtue, God and Stoicism in\nthe thought of Elizabeth Carter and Catharine Macaulay,” in\n<em>Virtue, Liberty and Toleration: Political Ideas of European Women\n1400–1800</em>, J. Broad and K. Green (eds.), Dordrecht:\nSpringer, pp.137–148.</li>\n<li>–––, 2009, “The Persona of the Woman\nPhilosopher in Eighteenth-Century England: Catharine Macaulay, Mary\nHays, and Elizabeth Hamilton,” <em>Intellectual History\nReview</em>, 18 (3): 403–12.</li>\n<li>Israel, Jonathan, 2010, <em>A Revolution of the Mind: Radical\nEnlightenment and the Intellectual Origins of Modern Democracy</em>,\nPrinceton: Princeton University Press.</li>\n<li>–––, 2011, <em>Democratic Enlightenment.\nPhilosophy, Revolution, and Human Rights</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Letzring, Monica, 1976, “Sarah Prince Gill and the John\nAdams-Catharine Macaulay Correspondence,” <em>Proceedings of the\nMassachusetts Historical Society</em>, 88: 107–111.</li>\n<li>Looser, Devoney, 2000, <em>British Women Writers and the Writing\nof History</em>, Baltimore: The Johns Hopkins University Press.</li>\n<li>–––, 2003, “‘Those historical\nlaurels which once graced my brow are now in their wane’:\nCatherine Macaulay’s last years and legacy,” <em>Studies in\nRomanticism</em>, 42 (2): 203–25.</li>\n<li>O’Brien, Karen, 2009, <em>Women and Enlightenment in\nEighteenth-Century Britain</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Pettit, Philip, 1997, <em>Republicanism: A Theory of Freedom and\nGovernment</em>, Oxford: Clarendon Press.</li>\n<li>Pocock, J. G. A., 1998, “Catherine Macaulay: patriot\nhistorian,” in <em>Women writers and the early modern British\npolitical tradition</em>, H. Smith (ed.), Cambridge: Cambridge\nUniversity Press, pp.243–258.</li>\n<li>Reuter, Martina, 2007, “Catharine Macaulay and Mary\nWollstonecraft on the Will,” in <em>Virtue, Liberty and\nToleration. Political Ideas of European Women 1400–1800</em>,\nJ. Broad and K. Green (eds.), Dordrecht: Springer, pp.149–169.</li>\n<li>Schnorrenberg, Barbara B., 1979, “The Brood-hen of Faction:\nMrs. Macaulay and Radical Politics, 1765–75,”\n<em>Albion</em>, 11: 33–45.</li>\n<li>–––, 1990, “An Opportunity Missed:\nCatherine Macaulay on the Revolution of 1688,” <em>Studies in\nEighteenth-Century Culture</em>, 20: 231–40.</li>\n<li>Sheridan, Patricia, 2007, “Reflection, Nature, and Moral\nLaw: The Extent of Catharine Cockburn’s Lockeanism in her <em>Defence\nof Mr. Locke’s Essay</em>,” <em>Hypatia</em>, 22 (3):\n133–51.</li>\n<li>Skinner, Quentin, 1998, <em>Liberty before Liberalism</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2008, <em>Hobbes and Republican\nLiberty</em>, Cambridge: Cambridge University Press.</li>\n<li>Staves, Susan, 1989, “‘The Liberty of a She-Subject of\nEngland’: Rights Rhetoric and the Female Thucydides,”\n<em>Cardozo Studies in Law and Literature</em>, 1(2):\n161–83.</li>\n<li>Titone, Connie, 2004, <em>Gender Equality in the Philosophy of\nEducation: Catherine Macaulay’s Forgotten Contribution</em>, New York:\nPeter Lang.</li>\n<li>Walmsley, J. C., Hugh Craig and John Burrows, 2016, “Authorship of Remarks Upon Locke’s Essay Concerning Human Understanding”, <em>Eighteenth-century Thought</em> 6:205–43.</li>\n<li>Wiseman, Susan, 2001, “Catharine Macaulay: history,\nrepublicanism and the public sphere,” in <em>Women, Writing and\nthe Public Sphere, 1700–1830</em>, E. Eger, C. Grant,\nC. Ó Gallchoir and P. Warburton (eds.), Cambridge: Cambridge\nUniversity Press,pp/181–199.</li>\n<li>Withey, Lynne E., 1976, ”Catherine Macaulay and the Uses of\nHistory: Ancient Rights, Perfectionism, and Propaganda,“\n<em>Journal of British Studies</em>, 16 (1): 59–83.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Burke, Edmund",
            "Cockburn, Catharine Trotter",
            "feminist philosophy",
            "free will",
            "Hobbes, Thomas",
            "Hume, David",
            "Locke, John",
            "republicanism",
            "Wollstonecraft, Mary"
        ],
        "entry_link": [
            {
                "../burke/": "Burke, Edmund"
            },
            {
                "../cockburn/": "Cockburn, Catharine Trotter"
            },
            {
                "../feminist-philosophy/": "feminist philosophy"
            },
            {
                "../freewill/": "free will"
            },
            {
                "../hobbes/": "Hobbes, Thomas"
            },
            {
                "../hume/": "Hume, David"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../republicanism/": "republicanism"
            },
            {
                "../wollstonecraft/": "Wollstonecraft, Mary"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=catharine-macaulay\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/catharine-macaulay/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=catharine-macaulay&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/catharine-macaulay/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=catharine-macaulay": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/catharine-macaulay/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=catharine-macaulay&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/catharine-macaulay/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.gilderlehrman.org/\" target=\"other\">Gilder Lehrman Institute of American History</a>"
        ],
        "listed_links": [
            {
                "http://www.gilderlehrman.org/": "Gilder Lehrman Institute of American History"
            }
        ]
    }
}