{
    "url": "cloning",
    "title": "Cloning",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Katrien Devolder\n<katrien.devolder@philosophy.ox.ac.uk>",
        "author_links": [
            {
                "http://www.philosophy.ox.ac.uk/people/katrien-devolder": "Katrien Devolder"
            },
            {
                "mailto:katrien%2edevolder%40philosophy%2eox%2eac%2euk": "katrien.devolder@philosophy.ox.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.philosophy.ox.ac.uk/people/katrien-devolder\" target=\"other\">Katrien Devolder</a>\n&lt;<a href=\"mailto:katrien%2edevolder%40philosophy%2eox%2eac%2euk\"><em>katrien<abbr title=\" dot \">.</abbr>devolder<abbr title=\" at \">@</abbr>philosophy<abbr title=\" dot \">.</abbr>ox<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Sep 17, 2008",
        "substantive revision Fri Dec 10, 2021"
    ],
    "preamble": "\n\nDolly the sheep, the first mammal cloned from a somatic (body) cell,\ncame into the world innocent as a lamb. However, soon after the\nannouncement of her birth in February 1997 (Wilmut et al., 1997) she\ncaused panic and controversy. An important, and for many people\ntroubling question arose: if the cloning of sheep is possible, will\nscientists soon start cloning humans as well; and if they did, would\nthis be wrong or unwise?\n\nFor most people, Dolly was really a wolf in sheep’s clothing.\nShe represented a first undesirable and dangerous step to applying\nreproductive cloning in humans, something that many agreed should\nnever be done. Only a small minority thought it was permissible, or\neven morally obligatory to conduct further research into human\nreproductive cloning. Some had no strong objections to it, but did not\nsee any reason to promote it either.\n\nDolly is now stuffed and set up for display in the National Museum of\nScotland. Many countries or jurisdictions have legally banned human\ncloning or are in the process of doing so. In some countries,\nincluding France and Singapore, reproductive cloning of humans is a\ncriminal offence. In 2005, UNESCO adopted a ‘Declaration on\nHuman Cloning’, which calls for a universal ban on human cloning\n(for an examination of the human cloning debate at UNESCO since 2008,\nsee Langlois, 2017). The debate on human reproductive cloning seems to\nhave drawn to a close. However, since reproductive cloning of mammals\nhas become routine in several countries, there is reason to believe\nthat at some point in the future, humans will be cloned too. Moreover,\neven if reproductive cloning will not be possible in the near\nfuture, cloning for research and therapeutic purposes is likely to\nbe.\n\nThis entry describes the most important areas of disagreement\nregarding the ethics of cloning. I will focus on human cloning (as\nopposed to animal cloning), since human cloning has been the focus of\nthe cloning debate.\n",
    "toc": [
        {
            "#WhaClo": "1. What is Cloning?"
        },
        {
            "#CloForResThe": "2. Cloning for Research and Therapy"
        },
        {
            "#CreKilEmbForSteCel": "2.1 Creating and Killing Embryos for Stem Cells"
        },
        {
            "#NeeForOoc": "2.2 The Need for Oocytes"
        },
        {
            "#SocJusCon": "2.3 Social Justice Considerations"
        },
        {
            "#SliSloRepClo": "2.4 A Slippery Slope to Reproductive Cloning"
        },
        {
            "#HumRepClo": "3. Human Reproductive Cloning"
        },
        {
            "#SafEff": "3.1 Safety and Efficiency"
        },
        {
            "#HarIndConThrClo": "3.2 Harm to the Individual Conceived through Cloning"
        },
        {
            "#HarOth": "3.3 Harm to Others"
        },
        {
            "#HumDig": "3.4 Human Dignity"
        },
        {
            "#RelPer": "4. Religious perspectives"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Cloning?\n\nStrictly speaking, cloning is the creation of a genetic copy of a\nsequence of DNA or of the entire genome of an organism. In the latter\nsense, cloning occurs naturally in the birth of identical twins and\nother multiples. But cloning can also be done artificially in the\nlaboratory via embryo twinning or splitting: an early embryo is split\nin vitro so that both parts, when transferred to a uterus,\ncan develop into individual organisms genetically identical to each\nother. In the cloning debate, however, the term ‘cloning’\ntypically refers to a technique called somatic cell nuclear transfer\n(SCNT). SCNT involves transferring the nucleus of a somatic cell into\nan oocyte from which the nucleus and thus most of the DNA has been\nremoved. (The mitochondrial DNA in the cytoplasm is still present).\nThe manipulated oocyte is then treated with an electric current in\norder to stimulate cell division, resulting in the formation of an\nembryo. The embryo is (virtually) genetically identical to, and thus a\nclone of the somatic cell donor.\n\nDolly was the first mammal to be brought into the world using SCNT.\nIan Wilmut and his team at the Roslin Institute in Scotland replaced\nthe nucleus from an oocyte taken from a Blackface ewe with the nucleus\nof a cell from the mammary gland of a six-year old Finn Dorset sheep\n(these sheep have a white face). They transferred the resulting embryo\ninto the uterus of a surrogate ewe and approximately five months later\nDolly was born. Dolly had a white face: she was genetically identical\nto the Finn Dorset ewe from which the somatic cell had been\nobtained.\n\nDolly, however, was not 100% genetically identical to the donor\nanimal. Genetic material comes from two sources: the nucleus and the\nmitochondria of a cell. Mitochondria are organelles that serve as\npower sources to the cell. They contain short segments of DNA. In\nDolly’s case, her nuclear DNA was the same as the donor\nanimal; other of her genetic materials came from the mitochondria in\nthe cytoplasm of the enucleated oocyte. For the clone and the donor\nanimal to be exact genetic copies, the oocyte too would have to come\nfrom the donor animal (or from the same maternal line –\nmitochondria are passed on by oocytes).\n\nDolly’s birth was a real breakthrough, for it proved that\nsomething that had been considered biologically impossible could\nindeed be done. Before Dolly, scientists thought that cell\ndifferentiation was irreversible: they believed that, once a cell has\ndifferentiated into a specialized body cell, such as a skin or liver\ncell, the process cannot be reversed. What Dolly demonstrated was that\nit is possible to take a differentiated cell, turn back its biological\nclock, and make the cell behave as though it was a recently fertilized\negg.\n\nNuclear transfer can also be done using a donor cell from an embryo\ninstead of from an organism after birth. Cloning mammals using\nembryonic cells has been successful since the mid-1980s (for a history\nof cloning, see Wilmut et al. 2001). Another technique to produce\ngenetically identical offspring or clones is embryo twinning or embryo\nsplitting, in which an early embryo is split in vitro so that\nboth parts, when implanted in the uterus, can develop into individual\norganisms genetically identical to each other. This process occurs\nnaturally with identical twins.\n\nHowever, what many people find disturbing is the idea of creating a\ngenetic duplicate of an existing person, or a person who has existed.\nThat is why the potential application of SCNT in humans set off a\nstorm of controversy. Another way to produce a genetic duplicate from\nan existing person is by cryopreserving one of two genetically\nidentical embryos created in vitro for several years or\ndecades before using it to generate a pregnancy. Lastly, reproductive\ncloning of humans could, in theory, also be achieved by combining the\ninduced pluripotent stem cell technique with tetraploid\ncomplementation. Several research teams have succeeded in cloning mice\nthis way (see, for example, Boland et al. 2009). The technique\ninvolves injecting mouse iPS cells in tetraploid embryos, i.e. embryos\nwith twice the normal number of chromosomes that cannot result in live\noffspring. The resulting mouse pups are derived solely from the iPS\ncells, which means that the tetraploid embryos only acted as a\nsubstitute trophectoderm, which forms the placenta and other\nnourishing membranes but which does not contribute to the\n‘embryo proper’.\n\nDolly is a case of reproductive cloning, the aim of which is to create\noffspring. Reproductive cloning is to be distinguished from cloning\nfor therapy and research, sometimes also referred to as\n‘therapeutic cloning’. Both reproductive cloning and\ncloning for research and therapy involve SCNT, but their aims, as well\nas most of the ethical concerns they raise, differ. I will first\ndiscuss cloning for research and therapy and will then proceed to\noutline the ethical debate surrounding reproductive cloning.\n2. Cloning for Research and Therapy\n\nCloning for research and therapy involves the creation of an embryo\nvia SCNT, but instead of transferring the cloned embryo to the uterus\nin order to generate a pregnancy, it is used to obtain pluripotent\nstem cells. It is thus not the intention to use the embryo for\nreproductive purposes. Embryonic stem cells offer powerful tools for\ndeveloping therapies for currently incurable diseases and conditions,\nfor important biomedical research, and for drug discovery and toxicity\ntesting (Cervera & Stojkovic 2007). For example, one therapeutic\napproach is to induce embryonic stem cells to differentiate into\ncardiomyocytes (heart muscle cells) to repair or replace damaged heart\ntissue, into insulin-producing cells to treat diabetes, or into\nneurons and their supporting tissues to repair spinal cord\ninjuries.\n\nA potential problem with embryonic stem cells is that they will\nnormally not be genetically identical to the patient.\nEmbryonic stem cells are typically derived from embryos donated for\nresearch after in vitro fertilization (IVF) treatment.\nBecause these stem cells would have a genetic identity different from\nthat of the recipient – the patient – they may, when used\nin therapy, be rejected by her immune system. Immunorejection can\noccur when the recipient’s body does not recognize the\ntransplanted cells, tissues or organs as its own and as a defense\nmechanism attempts to destroy the graft. Another type of\nimmunorejection involves a condition called graft-versus-host disease,\nin which immune cells contaminating the graft recognize the new host\n– the patient – as foreign and attack the host’s\ntissues and organs. Both types of immunorejection can result in loss\nof the graft or death of the patient. It is one of the most serious\nproblems faced in transplant surgery.\n\nCloning for research and therapy could potentially offer a solution to\nthis problem. An embryo produced via SNCT using the patient’s\nsomatic cell as a donor cell would be virtually genetically identical\nto the patient. Stem cells obtained from that embryo would thus also\nbe genetically identical to the patient, as would be their\nderivatives, and would be less likely to be rejected after\ntransplantation. Though therapies using embryonic stem cells from SCNT\nembryos are not yet on the horizon for humans, scientists have\nprovided proof of concept for these therapies in the mouse.\n\nEmbryonic stem cells from cloned embryos would also have significant\nadvantages for biomedical research, and for drug discovery and\ntoxicity testing. Embryonic stem cells genetically identical to the\npatient could provide valuable in vitro models to study\ndisease, especially where animal models are not available, where the\nresearch cannot be done in patients themselves because it would be too\ninvasive, or where there are too few patients to work with (as in the\ncase of rare genetic diseases). Researchers could, for example, create\nlarge numbers of embryonic stem cells genetically identical to the\npatient and then experiment on these in order to understand the\nparticular features of the disease in that person. The embryonic stem\ncells and their derivatives could also be used to test potential\ntreatments. They could, for example, be used to test candidate drug\ntherapies to predict their likely toxicity. This would avoid dangerous\nexposure of patients to sometimes highly experimental drugs.\n\nCloning for research and therapy is, however, still in its infancy\nstages. In 2011, a team of scientists from the New York Stem Cell\nFoundation Laboratory was the first to have succeeded in creating two\nembryonic stem cell lines from human embryos produced through SCNT\n(Noggle et al. 2011). Three years earlier, a small San Diego\nbiotechnological company created human embryos (at the blastocyst\nstage) via SCNT but did not succeed in deriving embryonic stem cells\nfrom these cells (French et al. 2008). Cloning for research and\ntherapy is thus not likely to bear fruit in the short term though\nprogress is made (Tachibana et al. 2013; Zhang et al. 2020). Apart\nfrom unsolved technical difficulties, much more basic research in\nembryonic stem cell research is needed. The term ‘therapeutic\ncloning’ has been criticized precisely for this reason. It\nsuggests that therapy using embryonic stem cells from cloned embryos\nis already reality. In the phase before clinical trials, critics say,\nit is only reasonable to refer to research on nuclear transfer as\n‘research cloning’ or ‘cloning for biomedical\nresearch’ (PCBE, 2002).\n\nCloning for research and therapy holds great potential for future\nresearch and therapeutic applications, but it also raises various\nethical concerns.\n2.1 Creating and Killing Embryos for Stem Cells\n\nMuch of the debate about the ethics of cloning for research and\ntherapy turns on a basic disagreement about how we should treat early\nhuman embryos. As it is currently done, the isolation of embryonic\nstem cells involves the destruction of embryos at the blastocyst stage\n(day five after fertilization, when the embryo consists of\n125–225 cells). But cloning for research and therapy not only\ninvolves the destruction of embryos, it also involves the creation of\nembryos solely for the purpose of stem cell derivation. Views\non whether and when it is permissible to create embryos solely to\nobtain stem cells differ profoundly.\n\nSome believe that an embryo, from the moment of conception, has the\nsame moral status, that is, the same set of basic moral rights, claims\nor interests as an ordinary adult human being. This view is sometimes\nexpressed by saying that the early embryo is a person. On this view,\ncreating and killing embryos for stem cells is a serious moral wrong.\nIt is impermissible, even if it could save many lives (Deckers 2007).\nOthers believe that the early embryo is merely a cluster of cells or\nhuman tissue lacking any moral status. A common view among those who\nhold this position is that, given its promising potential, embryonic\nstem cell and cloning research is a moral imperative (Devolder &\nSavulescu 2006). Many defend a view somewhere in between these\nopposing positions. They believe, for example, that the early embryo\nshould be treated with respect because it has an intermediate moral\nstatus: a moral status lower than that of a person but higher than\nthat of an ordinary body cell. A popular view amongst those who hold\nthis position is that using embryos for research might sometimes be\njustified. Respect can be demonstrated, it is typically argued, by\nusing embryos only for very important research that cannot be done\nusing less controversial means, and by acknowledging the use of\nembryos for research with a sense of regret or loss (Robertson 1995;\nSteinbock 2001). One common view among those who hold the intermediate\nmoral status view is that the use of discarded IVF embryos to obtain\nstem cells is compatible with the respect we owe to the embryo,\nwhereas the creation and use of cloned embryos is not. An argument\nunderlying this view is that, unlike IVF embryos, cloned embryos are\ncreated for instrumental use only; they are created and treated as a\nmere means, which some regard as incompatible with respectful\ntreatment of the embryo (NBAC 1999). Others (both proponents and\nopponents of embryo research) have denied that there is a significant\nmoral difference between using discarded IVF embryos and cloned\nembryos as a source of stem cells. They have argued that if\nkilling embryos for research is wrong, it is wrong regardless of the\nembryo’s origin (Doerflinger 1999; Fitzpatrick 2003; Devolder\n2005, 2015). Douglas and Savulescu (2009) have argued that it is\npermissible to destroy ‘unwanted’ embryos in research,\nthat is, embryos that no one wishes to use for reproductive purposes.\nSince both discarded IVF embryos and cloned embryos created for the\npurpose of stem cell derivation are unwanted embryos in that sense, it\nis, on their view, permissible to use both types of embryos for\nresearch.\n\nA less common view holds that obtaining stem cells from cloned embryos\nposes fewer ethical problems than obtaining stem cells from\ndiscarded IVF embryos. Hansen (2002) has advanced this view, arguing\nthat embryos resulting from SCNT do not have the same moral status we\nnormally accord to other embryos: he calls the combination of a\nsomatic nucleus and an enucleated egg a “transnuclear\negg”, which, he says, is a mere “artifact” with no\n“natural purpose” or potential “to evolve into an\nembryo and eventually a human being,” and therefore falls\noutside the category of human beings. McHugh (2004) and Kiessling\n(2001) advance a similar argument. On their view, obtaining stem cells\nfrom cloned embryos is less morally problematic because embryos\nresulting from SCNT cannot (yet) develop further, and are thus better\nthought of as tissue culture, whereas IVF represents instrumental\nsupport for human reproduction. Since creating offspring is not the\ngoal, they argue, it is misleading to use the term\n‘embryo’ or ‘zygote’ to refer to the product\nof SCNT. They suggest to instead use the terms ‘clonote’\n(Mc Hugh) and ‘ovasome’ (Kiessling).\n2.2 The Need for Oocytes\n\nCloning for research and therapy requires a large number of\nhigh-quality donor oocytes. Ethical issues arise regarding how these\noocytes could be obtained. Oocyte donation involves various risks and\ndiscomforts (for a review of the risks, see Committee on Assessing the\nMedical Risks of Human Oocyte Donation for Stem Cell\nResearch, 2007). Among the most pressing ethical issues\nraised by participating in such donation is what model of informed\nconsent should be applied. Unlike women who are considering IVF,\nnon-medical oocyte donors are not clinical patients. They do not stand\nto derive any reproductive or medical benefit themselves from the\ndonation (though Kalfoglou & Gittelsohn, 2000, argue that they may\nderive a psychological benefit). Magnus and Cho (2005) have argued\nthat donating women should not be classified as research subjects\nsince, unlike in other research, the risks to the donor do not lie in\nthe research itself but in the procurement of the materials required\nfor the research. They suggest that a new category named\n‘research donors’ be created for those who expose\nthemselves to substantial risk only for the benefit of others (in this\ncase unidentifiable people in the future) and where the risk is\nincurred not in the actual research but in the procurement of the\nmaterials for the research. Informed consent for altruistic organ\ndonation by living donors to strangers has also been suggested as a\nmodel, since, in both cases, the benefits will be for strangers and\nnot for the donor. Critics of this latter suggestion have pointed out,\nhowever, that there is a disanalogy between these two types of\ndonation. The general ethical rule reflected in regulations concerning\naltruistic donation, namely that there must be a high chance of a good\noutcome for the patient, is violated in the case of oocyte donation\nfor cloning research (George 2007).\n\nGiven the risks to the donor, the absence of direct medical benefit\nfor the donor, and the uncertain potential of cloning research, it is\nnot surprising that the number of altruistic oocyte donations for such\nresearch is very low. Financial incentives might be needed to increase\nthe supply of oocytes for cloning research. In some countries,\nincluding the US, selling and buying oocytes is legal. Some object to\nthese practices because they consider oocytes as integral to the body\nand think they should be kept out of the market: on their view, the\nvalue of the human body and its parts should not be expressed in terms\nof money or other fungible goods. Some also worry that, through\ncommercialization of oocytes, women themselves may become objects of\ninstrumental use (Alpers &Lo 1995). Many agree, however, that a\nconcern for commodification does not justify a complete ban on payment\nof oocyte donors and that justice requires that they be financially\ncompensated for the inconvenience, burden, and medical risk they\nendure, as is standard for other research subjects (Steinbock 2004;\nMertes &Pennings 2007). A related concern is the effect of\nfinancial or other offers of compensation on the voluntariness of\noocyte donation. Women, especially economically disadvantaged women\nfrom developing countries, might be unduly induced or even coerced\ninto selling their oocytes (Dickinson 2002). Baylis and McLeod (2007)\nhave highlighted how difficult it is concomitantly to avoid both undue\ninducement and exploitation: a price that is too low risks\nexploitation; a price that avoids exploitation risks undue\ninducement.\n\nConcerns about exploitation are not limited to concerns about payment,\nas became clear in the ‘Hwang scandal’ (for a review, see\nSaunders & Savulescu 2008). In 2004, Woo-Suk-Hwang, a leading\nKorean stem cell scientist, claimed to be the first to clone human\nembryos using SCNT and to extract stem cells from these embryos. In\naddition to finding that Hwang had fabricated many of his research\nresults, Korea’s National Bioethics Committee also found that\nHwang had pressured junior members of his lab to donate oocytes for\nhis cloning experiments.\n\nSome authors have argued that a regulated market in oocytes\ncould minimize ethical concerns raised by the commercialization of\noocytes and could be consistent with respect for women (Resnik 2001;\nGruen 2007). Researchers are also investigating the use of alternative\nsources of oocytes, including animal oocytes, fetal oocytes, oocytes\nfrom adult ovaries obtained post mortem or during operation, and stem\ncell-derived oocytes. Scientists have already succeeded in creating\nhuman oocytes from embryonic stem cells (Ma et al. 2017; Saitou &\nMiyauchi 2016). Finally, another option is ‘egg-sharing’\nwhere couples who are undergoing IVF for reproductive purposes have\nthe option to donate one or two of their oocytes in return for a\nreduced fee for their fertility treatment. The advantage of this\nsystem is that it avoids exposing women to extra risks – these\nwomen were undergoing IVF in any case (Roberts & Throsby\n2008).\n2.3 Social Justice Considerations\n\nPersonalized cloning therapies are likely to be labor intensive and\nexpensive. This has raised social justice concerns. Perhaps cloning\ntherapies will only be a realistic option for the very rich? Some have\nreplied to this concern by pointing out that Cloning therapies may\nbecome cheaper, less labor intensive and more widely accessible after\ntime. Moreover, cloning may cure diseases and not only treat\nsymptoms. Regardless of the economic cost, it remains true of course\nthat the cloning procedure is time consuming, rendering it\ninappropriate for certain clinical applications where urgent\nintervention is required (e.g., myocardial infarction, acute liver\nfailure or traumatic or infectious spinal cord damage). If cloning for\ntherapy became available, its application would thus likely be\nrestricted to chronic conditions. Wilmut (1997), who cloned Dolly, has\nsuggested that cloning treatments could be targeted to maximize\nbenefit: an older person with heart disease could be treated with stem\ncells that are not a genetic match, take drugs to suppress her immune\nsystem for the rest of her life, and live with the side-effects; a\nyounger person might benefit from stem cells from cloned embryos that\nmatch exactly. Devolder and Savulescu (2006) have argued that\nobjections about economic cost are most forceful against\n‘cloning for self-transplantation’ than, for example,\nagainst cloning for developing cellular models of human disease. The\nlatter will enable research into human diseases and may result in\naffordable therapies and cures for a variety of common diseases, such\nas cancer and heart disease, which afflict people all over the world.\nFinally, some have pointed out that it is not clear whether cloning\nresearch is necessarily more labor intensive than experiments on cells\nand tissues now done in animals.\n\nSome are skeptical about the claimed benefits of cloning for research\nand therapy. They stress that for many diseases in which cloned\nembryonic stem cells might offer a therapy, there are alternative\ntreatments and/or preventive measures in development, including gene\ntherapy, pharmacogenomical solutions and treatments based on\nnanotechnology. It is often claimed that other types of stem cells\nsuch as adult stem cells and stem cells from the umbilical cord blood\nmight enable us to achieve the same aims as cloning. Especially\ninduced pluripotent stem cells (iPSCs) have raised the hope that\ncloning research is superfluous (Rao & Condic 2008). iPSCs are\ncreated through genetic manipulation of a body cell. iPSCs are similar\nto embryonic stem cells, and in particular to embryonic stem cells\nfrom cloned embryos. However, iPSC research could provide tissue- and\npatient-specific cells without relying on the need for human oocytes\nor the creation and destruction of embryos. iPSC research could thus\navoid the ethical issues raised by cloning. This promise\nnotwithstanding, scientists have warned that it would be premature to\nstop cloning research as iPSCs are not identical to embryonic stem\ncells (Pera & Trounson 2013). Cloning research may teach us things\nthat iPSC research cannot teach us. Moreover, iPSC research has been\nsaid to fail to completely avoid the issue of embryo destruction\n(Brown 2009, Devolder 2015).\n2.4 A Slippery Slope to Reproductive Cloning\n\nSlippery slope arguments express the worry that permitting a certain\npractice may place us on a slippery slope to a dangerous or otherwise\nunacceptable outcome. Several commentators have argued that accepting\nor allowing cloning research is the first step that would place us on\na slippery slope to reproductive cloning. As Leon Kass (1998, 702) has\nput it: “once the genies put the cloned embryos into the\nbottles, who can strictly control where they go?”\n\nOthers are more skeptical about slippery slope arguments against\ncloning and think that effective legislation can prevent us from\nsliding down the slope (Savulescu 1999; Devolder & Savulescu\n2006). If reproductive cloning is unacceptable, these critics say, it\nis reasonable to prohibit this specific technology rather than to ban\nnon-reproductive applications of cloning. The UK and Belgium, for\nexample, allow cloning research but prohibit the transfer of cloned\nembryos to the uterus.\n\nApart from the question of how slippery the slope might be, another\nquestion raised by such arguments concerns the feared development\n–reproductive cloning– and whether it is really ethically\nobjectionable. Profound disagreement exists about the answer to this\nquestion.\n3. Human Reproductive Cloning\n\nThe central argument in favor of reproductive cloning is expansion of\nopportunities for reproduction. Reproductive cloning could offer a new\nmeans for prospective parents to satisfy their reproductive goals or\ndesires. Infertile individuals or couples could have a child that is\ngenetically related to them. In addition, individuals, same sex\ncouples, or couples who cannot together produce an embryo would no\nlonger need donor gametes to reproduce if cloning were available (some\nmight still need donor eggs for the cloning procedure, but these would\nbe enucleated so that only the mitochondrial DNA remains). It would\nthen be possible to avoid that one’s child shares half of her\nnuclear DNA with a gamete donor.\n\nUsing cloning to help infertile people to have a genetically related\nchild, or a child that is only genetically related to them, has been\ndefended on the grounds of human wellbeing, personal autonomy, and the\nsatisfaction of the natural inclination to produce offspring\n(Häyry 2003; Strong 2008). Offering individuals or couples the\npossibility to reproduce using cloning technology has been said to be\nconsistent with the right to reproductive freedom, which, according to\nsome, implies the right to choose what kind of children we will have\n(Brock 1998, 145).\n\nAccording to some, the main benefit of reproductive cloning is that it\nwould enable prospective parents to control what genome their children\nwill be endowed with (Fletcher 1988, Harris 1997, 2004; Pence 1998,\n101–6; Tooley 1998). Cloning would enable parents to have a\nchild with a genome identical to that of a person with good health\nand/or other desirable characteristics.\n\nAnother possible use of reproductive cloning is to create a child that\nis a tissue match for a sick sibling. The stem cells from the\numbilical cord blood or from the bone marrow of the cloned child could\nbe used to treat the diseased sibling. Such ‘saviour\nsiblings’, have already been created through sexual reproduction\nor, more efficiently, through a combination of IVF, preimplantation\ngenetic diagnosis and HLA testing.\n\nMany people, however, have expressed concerns about human reproductive\ncloning. For some, these concerns are sufficient to reject human\ncloning. For others, these concerns should be weighed against reasons\nfor reproductive cloning.\n\nWhat follows is an outline of some of the main areas of concern and\ndisagreement about human reproductive cloning.\n3.1 Safety and Efficiency\n\nDespite the successful creation of viable offspring via SCNT in\nvarious mammalian species, researchers still have limited\nunderstanding of how the technique works on the subcellular and\nmolecular level. Although the overall efficiency and safety of\nreproductive cloning in mammals has significantly increased over the\npast fifteen years, it is not yet a safe process (Whitworth &\nPrather 2010). For example, the rate of abortions, stillbirths and\ndevelopmental abnormalities remains high. Another source of concern is\nthe risk of premature ageing because of shortened telomeres. Telomeres\nare repetitive DNA sequences at the tip of chromosomes that get\nshorter as an animal gets older. When the telomeres of a cell get so\nshort that they disappear, the cell dies. The concern is that cloned\nanimals may inherit the shortened telomeres from their older\nprogenitor, with possibly premature aging and a shortened lifespan as\na result.\n\nFor many, the fact that reproductive cloning is unsafe provides a\nsufficient reason not to pursue it. It has been argued that it would\nsimply be wrong to impose such significant health risks on humans. The\nstrongest version of this argument states that it would be wrong now\nto produce a child using SCNT because it would constitute a case of\nwrongful procreation. Some adopt a consent-based objection and condemn\ncloning because the person conceived cannot consent to being exposed\nto significant risks involved in the procedure (Kass 1998; PCBE 2002).\nAgainst this, it has been argued that even if reproductive cloning is\nunsafe, it may still be permissible if there are no safer means to\nbring that very same child into existence so long as the child is\nexpected to have a life worth living (Strong 2005).\n\nWith the actual rate of advancement in cloning, one cannot exclude a\nfuture in which the safety and efficiency of SCNT will be comparable\nor superior to that of IVF or even sexual reproduction. A remaining\nquestion is, then, whether those who condemn cloning because of its\nexperimental nature should continue to condemn it morally and legally.\nSome authors have reasoned that if, in the future, cloning becomes\nsafer than sexual reproduction, we should even make it our\nreproductive method of choice (Fletcher 1988; Harris 2004, Ch. 4).\n\n3.2 Harm to the Individual Conceived through Cloning\n3.2.1 A Threat to Autonomy\n\nSome fear that cloning threatens the identity and individuality of the\nclone, thus reducing her autonomy (Ramsey 1966; Kitcher 1997; Annas\n1998; Kass 1998). This may be bad in itself, or bad because it might\nreduce the clone’s wellbeing. It may also be bad because it will\nseverely restrict the array of life plans open to the clone, thus\nviolating her ‘right to an open future’ (a concept\ndeveloped in Feinberg 1980). In its report ‘Human Cloning and\nHuman Dignity: An Ethical Inquiry’, the US President’s\nCouncil on Bioethics (2002) wrote that being genetically unique is\n“an emblem of independence and individuality” and allows\nus to go forward “with a relatively indeterminate future in\nfront of us” (Ch. 5, Section c). Such concerns have formed the\nbasis of strong opposition to cloning.\n\nThe concern that cloning threatens the clone’s identity and\nindividuality has been criticized for relying on the mistaken belief\nthat who and what we become is entirely determined by our genes. Such\ngenetic determinism is clearly false. Though genes influence our\npersonal development, so does the complex and irreproducible context\nin which our lives take place. We know this, among others, from\nstudying monozygotic twins. Notwithstanding the fact that such twins\nare genetically identical to each other and, therefore, sometimes look\nvery similar and often share many character traits, habits and\npreferences, they are different individuals, with different\nidentities (Segal 2000). Thus, it is argued, having a genetic\nduplicate does not threaten one’s individuality, or one’s\ndistinct identity.\n\nBrock (2002) has pointed out that one could nevertheless argue that\neven though individuals created through cloning would be unique\nindividuals with a distinct identity, they might not experience it\nthat way. What is threatened by cloning then is not the\nindividual’s identity or individuality, but her sense\nof identity and individuality, and this may reduce her autonomy. So\neven if a clone has a unique identity, she may experience more\ndifficulties in establishing her identity than if she had not been a\nclone.\n\nBut here too critics have relied on the comparison with monozygotic\ntwins. Harris (1997, 2004) and Tooley (1998), for example, have\npointed out that each twin not only has a distinct identity, but\ngenerally also views him or herself as having a distinct identity, as\ndo their relatives and friends. Moreover, so they argue, an individual\ncreated through cloning would likely be of a different age than her\nprogenitor. There may even be several generations between them. A\nclone would thus in essence be a ‘delayed’ twin.\nPresumably this would make it even easier for the clone to view\nherself as distinct from the progenitor than if she had been\ngenetically identical to someone her same age.\n\nHowever, the reference to twins as a model to think about reproductive\ncloning has been criticized, for example, because it fails to reflect\nimportant aspects of the parent-child relationship that would incur if\nthe child were a clone of one of the rearing parents (Jonas 1974;\nLevick 2004). Because of the dominance of the progenitor, the risk of\nreduced autonomy and confused identity may be greater in such a\nsituation than in the case of ordinary twins. Moreover, just\nbecause the clone would be a delayed twin, she may have the\nfeeling that her life has already been lived or that she is\npredetermined to do the same things as her progenitor (Levy & Lotz\n2005). This problem may be exacerbated by others constantly comparing\nher life with that of the progenitor, and having problematic\nexpectations based on these comparisons. The clone may feel under\nconstant pressure to live up to these expectations (Kass 1998; Levick\n2004, 101; Sandel 2007, 57–62), or may have the feeling she\nleads ‘a life in the shadow’ of the progenitor (Holm 1998;\nPCBE 2002, Ch.5). This may especially be the case if the clone was\ncreated as a ‘replacement’ for a deceased child. (Some\nprivate companies already offer to clone dead pets to create\nreplacements pets.) The fear is that the ‘ghost of the dead\nchild’ will get more attention and devotion than the replacement\nchild. Parents may expect the clone to be like the lost child, or some\nidealized image of it, which could hamper the development of her\nidentity and adversely affect her self-esteem (Levick 2004,\n111–132). Finally, another reason why the clone’s autonomy\nmay be reduced is because she would be involuntarily informed about\nher genetic predispositions. A clone who knows that her genetic parent\ndeveloped a severe single gene disease at the age of forty will\nrealise it is very likely that she will undergo the same fate. Unlike\nindividuals who choose to have themselves genetically tested,\nclones who know their genetic parent’s medical history will be\ninvoluntarily informed.\n\nThese concerns have been challenged on several grounds. Some believe\nthat it is plausible that, through adequate information, we could\nlargely correct mistaken beliefs about the link between genetic and\npersonal identity, and thus reduce the risk of problematic\nexpectations toward the clone (Harris 1997, 2004; Tooley 1998,\n84–5; Brock 1998, Pence 1998). Brock (1998) and Buchanan et al.\n(2000, 198) have argued that even if people persist in these mistaken\nbeliefs and their attitudes or actions lead to cloned individuals\nbelieving they do not have an open future, this does not\nimply that the clone’s right to ignorance about one’s\npersonal future or to an open future has actually been\nviolated. Pence (1998, 138) has argued that having high expectations,\neven if based on false beliefs, is not necessarily a bad thing.\nParents with high expectations often give their children the best\nchances to lead a happy and successful life. Brock (2002, 316) has\nargued that parents now also constantly restrict the array of\navailable life plans open to their children, for example, by selecting\ntheir school or by raising them according to certain values. Though\nthis may somewhat restrict the child’s autonomy, there will\nalways be enough decisions to take for the child to be autonomous, and\nto realize this. According to Brock, it is not clear why this should\nbe different in the case of cloning. He also points out that there may\nbe advantages to being a ‘delayed twin’ (154). For\nexample, one may acquire knowledge about the progenitor’s\nmedical history and use this knowledge to live longer, or to increase\none’s autonomy. One could, for example, use the information to\nreduce the risk of getting the disease or condition, or to at least\npostpone its onset, by behavioral changes, an appropriate diet and/or\npreventive medication. This would not be possible, however, if the\ndisease is untreatable (for example, Huntington’s Disease).\nHarris (2004, Ch.1) has stressed that information about one’s\ngenetic predispositions for certain diseases would also allow one to\ntake better informed reproductive decisions. Cloning would allow us to\ngive our child a ‘tried and tested’ genome, not one\ncreated by the genetic lottery of sexual reproduction and the random\ncombination of chromosomes.\n3.2.2 The clone will be treated as a means\n\nCloning arouses people’s imagination about the clone, but also\nabout those who will choose to have a child through cloning. Often\ndubious motives are ascribed to them: they would want a child that is\n‘just like so-and-so’ causing people to view children as\nobjects or as commodities like a new car or a new house (Putnam 1997,\n7–8). They would want an attractive child (a clone of Scarlett\nJohansson) or a child with tennis talent (a clone of Victoria\nAzarenka) purely to show off. Dictators would want armies of clones to\nachieve their political goals. People would clone themselves out of\nvanity. Parents would clone their existing child so that the clone can\nserve as an organ bank for that child, or would clone their deceased\nchild to have a replacement child. The conclusion is then that cloning\nis wrong because the clone will be used as a mere means to\nothers’ ends. These critiques have also been expressed with\nregard to other forms of assisted reproduction; but some worry that\nindividuals created through cloning may be more likely to be viewed as\ncommodities because their total genetic blueprint would be chosen\n– they would be “fully made and not begotten”\n(Ramsey 1966; Kass 1998; PCBE 2002, 107).\n\nStrong (2008) has argued that these concerns are based on a fallacious\ninference. It is one thing to desire genetically related children, and\nsomething else to believe that one owns one’s children or that\none considers one’s children as objects, he writes. Other\ncommentators, however, have pointed out that even if parents\nthemselves do not commodify their children, cloning might still have\nan impact on society as a whole, thereby increasing the tendency of\nothers to do so (Levy & Lotz 2005; Sandel 2007). A related concern\nexpressed by Levick (2004, 184–5) is that allowing cloning might\nresult in a society where ‘production on demand’ clones\nare sold for adoption to people who are seeking to have children with\nspecial abilities – a clearer case of treating children as\nobjects.\n\nBut suppose some people create a clone for instrumental reasons, for\nexample, as a stem cell donor for a sick sibling. Does this imply that\nthe clone will be treated merely as a means? Critics of this argument\nhave pointed out that parents have children for all kinds of\ninstrumental reasons, including the benefit for the husband-wife\nrelationship, continuity of the family name, and the economic and\npsychological benefits children provide when their parents become old\n(Harris 2004, 41–2, Pence 1998). This is generally not\nconsidered problematic as long as the child is also valued in its own\nright. What is most important in a parent-child relationship is the\nlove and care inherent in that relationship. They stress the fact that\nwe judge people on their attitudes toward children, rather than on\ntheir motives for having them. They also deny that there is a strong\nlink between one’s intention or motive to have a child, and the\nway one will treat the child.\n3.2.3 Societal Prejudice and Respect for Clones\n\nAnother concern is that clones may be the victims of unjustified\ndiscrimination and will not be respected as persons (Deech 1999;\nLevick 2004, 185–187). Savulescu (2005, Other Internet\nResources) has referred to such negative attitudes towards clones as\n‘clonism’: a new form of discrimination against a group of\nhumans who are different in a non-morally significant way. But does a\nfear for ‘clonism’ constitute a good reason for rejecting\ncloning? Savulescu and others have argued that, if it is, then we must\nconclude that racist attitudes and discriminatory behavior towards\npeople with a certain ethnicity provides a good reason for people with\nthat ethnicity not to procreate. This, according to these critics, is\na morally objectionable way to solve the problem of racism. Instead of\nlimiting people’s procreative liberty we should combat existing\nprejudices and discrimination. Likewise, it is argued, instead of\nprohibiting cloning out of concern for clonism, we should combat\npossible prejudices and discrimination against clones (see also Pence\n1998, 46; Harris 2004, 92–93). Macintosh (2005, 119–21)\nhas warned that by expressing certain concerns about cloning one may\nactually reinforce certain prejudices and misguided stereotypes about\nclones. For example, saying that a clone would not have a personal\nidentity prejudges the clone as inferior or fraudulent (the idea that\noriginals are more valuable than their copies) or even less than human\n(as individuality is seen as an essential characteristic of human\nnature).\n3.2.4 Complex Family Relationships\n\nSome worry that cloning will threaten traditional family structures; a\nfear that has come up in debates about gay people adopting children,\nIVF and other assisted reproduction techniques. But in cloning the\nsituation would be more complex as it may blur generational boundaries\n(McGee 2000) and the clone would likely be confused about her kinship\nties (Kass 1998; O’Neil 2002, 67–68). For example, a woman\nwho has a child conceived through cloning would actually be the twin\nof her child and the woman’s mother would, genetically, be its\nmother, not grandmother. Some have argued against these concerns,\nreplying that a cloned child would not necessarily be more confused\nabout her family ties than other children. Many have four nurturing\nparents because of a divorce, never knew their genetic parents, have\nnurturing parents that are not their genetic parents, or think that\ntheir nurturing father is also their genetic father when in fact he is\nnot. While these complex family relationships can be troubling for\nsome children, they are not insurmountable, critics say. Harris (2004,\n77–78) argues that there are many aspects about the situation\none is born and raised in that may be troublesome. As with all\nchildren, the most important thing is the relation with people who\nnurture and educate them, and children usually know very well who\nthese people are. There is no reason to believe that with cloning,\nthis will be any different. Onora O’Neil (2002, 67–8)\nargues that such responses are misplaced. While she acknowledges that\nthere are already children now with confused family relationships, she\nargues that it is very different when prospective parents seek such\npotentially confused relationships for their children from the\nstart.\n3.3 Harm to Others\n\nOther concerns related to cloning focus on the potential harmful\neffects of cloning for others. Sometimes these concerns are related to\nthose about the wellbeing of the clone. For example, McGee’s\nconcern about confused family relationships not only bears on the\nclone but also on society as a whole. However, since I have already\nmentioned this concern, I will, in the remainder of this entry, focus\non other arguments\n3.3.1 Adoption and the Importance of Genetic Links\n\nIt is often claimed that the strongest reason for why reproductive\ncloning should be permissible, if safe, is that it will allow\ninfertile people to have a genetically related child. This position\nrelies on the view that having genetically related children is morally\nsignificant and valuable. This is a controversial view. For example,\nLevy and Lotz (2005) and Rulli (2016) have denied the importance of a\ngenetic link between parents and their children. Moreover, they have\nargued that claiming that this link is important will give rise to bad\nconsequences, such as reduced adoption rates (and, in Rulli’s\ncase, a failure to fulfil one’s duty to adopt) and diminished\nresources for improving the life prospects of the disadvantaged,\nincluding those waiting to be adopted. Levick (2004, 185) and Ahlberg\nand Brighouse (2011) have also advanced this view. Since, according to\nthese authors, these undesirable consequences would be magnified if we\nallowed human cloning, we have good reason to prohibit it. In\nresponse, Strong (2008) has argued that this effect is uncertain, and\nthat there are other, probably more effective, ways to help such\nchildren or to prevent them from ending up in such a situation.\nMoreover, if cloning is banned, infertile couples may make use of\ndonor embryos or gametes rather than adoption. Rob Sparrow (2006) has\npointed out another potential problem for those who defend\nreproductive cloning for the reason that it will overcome infertility\nby providing a genetically related child. According to Sparrow,\ncloning just doesn’t provide the right sort of genetic relation to\nmake those who use the technology the parents of the child.So, in\norder to justify reproductive cloning one then has to emphasise the\nimportance of the intention with which the parents bring the cloned\nchild into the world, rather than the genetic relationship with the\nchild. And this emphasis works to undermine the justification for\nreproductive cloning in the first place.\n3.3.2 Genetic Diversity\n\nAnother concern is that because cloning is an asexual way of\nreproducing it would decrease genetic variation among offspring and,\nin the long run, might even constitute a threat to the human race. The\ngene pool may narrow sufficiently to threaten humanity’s\nresistance to disease (AMA 1999, 6). In response, it has been argued\nthat if cloning becomes possible, the number of people who will choose\nit as their mode of reproduction will very likely be too low to\nconstitute a threat to genetic diversity. It would be unlikely to be\nhigher than the rate of natural twinning, which, occurring at a rate\nof 3.5/1000 children, does not seriously impact on genetic diversity.\nFurther, even if millions of people would create children through\ncloning, the same genomes will not be cloned over and over: each\nperson would have a genetic copy of his or her genome, which means the\nresult will still be a high diversity of genomes. Others argue that,\neven if genetic diversity were not diminished by cloning, a society\nthat supports reproductive cloning might be taken to express the view\nthat variety is not important. Conveying such a message, these authors\nsay, could have harmful consequences for society.\n3.3.3 Eugenics\n\nSome see the increase in control of what kind of genome we want to\npass on to our children as a positive development. A major concern,\nhowever, is that this shift ‘from chance to choice’ will\nlead to problematic eugenic practices.\n\nOne version of this concern states that cloning would, from the\noutset, constitute a problematic form of eugenics. However, critics\nhave argued that this is implausible: the best explanations of what\nwas wrong with immoral cases of eugenics, such as the Nazi eugenic\nprograms, are that they involved coercion and were motivated by\nobjectionable moral beliefs or false non-moral beliefs. This would not\nnecessarily be the case were cloning to be implemented now (Agar 2004;\nBuchanan 2007). Unlike the coercive and state-directed eugenics of the\npast, new ‘liberal eugenics’ defends values such as\nautonomy, reproductive freedom, beneficence, empathy and the avoidance\nof harm (Agar, 2004). Enthusiasts of so-called ‘liberal\neugenics’ are interested in helping individuals to prevent or\ndiminish the suffering and increase the well-being of their children\nby endowing them with certain genes. \n\nAnother version of the eugenics concern points out the risk of a\nslippery slope: the claim is that cloning will lead to objectionable\nforms of eugenics—for example, coercive eugenics—in the\nfuture. After all, historical cases of immoral eugenics often\ndeveloped from earlier well intentioned and less problematic practices\n(for a history of eugenics as well as an analysis of philosophical and\npolitical issues raised by eugenics, see Kevles 1985 and Paul 1995).\nAccording to Sandel (2007, Ch.5), for example, ‘liberal\neugenics’ might imply more state compulsion than first appears:\njust as governments can force children to go to school, they could\nrequire people to use genetics to have ‘better’\nchildren.\n\nA related concern expressed by Sandel (2007, 52–7) is that\ncloning, and enhancement technologies in general, may result in a\nsociety in which parents will not accept their child for what it is,\nreinforcing an already existing trend of heavily managed,\nhigh-pressure child-rearing or ‘hyper-parenting’. Asch and\nWasserman (2005, 202) have expressed a similar concern; arguing that\nhaving more control over what features a child has can pose an\n“affront to an ideal of unconditioned devotion”. Another\nconcern, most often expressed by disability rights advocates, is that\nif cloning is used to have ‘better’ children, it may\ncreate a more intolerant climate towards those with a disability or a\nserious disease, and that such practices can express negative\njudgments about people with disabilities. This argument has also been\nadvanced in the debate about selective abortion, prenatal testing, and\npreimplantation genetic diagnosis. Disagreement exists about whether\nthese effects are likely. For example, Buchanan et al. (2002, 278)\nhave argued that one can devalue disability while valuing existing\ndisabled people and that trying to help parents who want to avoid\nhaving a disabled child does not imply that society should make no\nefforts to increase accessibility for existing people with\ndisabilities.\n3.4 Human Dignity\n\nUNESCO’s Universal Declaration on the Human Genome and Human\nRights (1997) was the first international instrument to condemn human\nreproductive cloning as a practice against human dignity. Article 11\nof this Declaration states: “Practices which are contrary to\nhuman dignity, such as reproductive cloning of human beings, shall not\nbe permitted…” This position is shared by the World\nHealth Organization, the European Parliament and several other\ninternational instruments. Critics have pointed out that the reference\nto human dignity is problematic as it is rarely specified how human\ndignity is to be understood, whose dignity is at stake, and how\ndignity is relevant to the ethics of cloning (Harris 2004, Ch.2,\nBirnbacher 2005, McDougall 2008,). Some commentators state that it is\nthe copying of a genome which violates human dignity (Kass 1998);\nothers have pointed out that this interpretation could be experienced\nas an offence to genetically identical twins, and that we typically do\nnot regard twins as a threat to human dignity (although some societies\nin the past did), nor do we prevent twins from coming into existence.\nOn the contrary, IVF, which involves an increased ‘risk’\nof having twins, is a widely accepted fertility treatment.\n\nHuman dignity is most often related to Kant’s second formulation\nof the Categorical Imperative, namely the idea that we should never\nuse a person merely as a means to an end. I have, however, already\ndiscussed this concern in section 4.2.2.\n4. Religious perspectives\n\nNo unified religious perspective on human cloning exists; indeed,\nthere are a diversity of opinions within each individual religious\ntradition. For an overview of the evaluation of cloning by the main\nreligious groups see, for example, Cole-Turner (1997) and Walters\n(2004). For a specifically Jewish perspective on cloning, see, for\nexample, Lipschutz (1999), for an Islamic perspective, Sadeghi (2007)\nand for a Catholic perspective, Doerflinger (1999).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Agar, N., 2004, <em>Liberal Eugenics: In Defense of Human\nEnhancement</em>, Oxford: Blackwell Publishing.",
                "Ahlberg, J. and Brighouse, H., 2011, “An argument against\ncloning,” <em>Canadian Journal of Philosophy</em>, 40(4):\n539–566.",
                "Alpers, A. and Lo, B., 1995, “Commodification and\ncommercialization in human embryo research,” <em>Stanford Law\n&amp; Policy Review</em>, 6(2): 39–46.",
                "American Medical Association, AMA, (1999), <em>Report of the\nCouncil on Ethical and Judicial Affairs</em>, American Medical\nAssociation.",
                "Annas, G., 1998, “The prospect of human cloning: an\nopportunity for national and international cooperation,” in\n<em>Human Cloning: Biomedical Ethical Reviews </em>, J. Humber and R.\nAlmeder (eds.), New Jersey: Humana Press.",
                "Asch, A. and Wasserman, D., 2005, “Where is the sin in\nsynecdoche,” in <em>Quality of life and human difference:\ngenetic testing, health care</em>, <em>and disability</em>, D.\nWasserman, R.S. Wachbroit, and J.E. Bickenbach (eds.), New York:\nCambridge University Press.",
                "Baylis, F., and C. McLeod, 2007, “The stem cell debate\ncontinues: the buying and selling of eggs for research,”\n<em>Journal of Medical Ethics</em>, 33(12): 726–731.",
                "Birnbacher, D., 2005, “Human cloning and human\ndignity,” <em>Reproductive Biomedicine Online</em> (Supplement),\n10: 50–55.",
                "Boland, M.J., Hazen, J.L., Nazor, K.L., Rodriguez, A.R., Gifford,\nW., Martin, G., Kupriyanov, S., and Baldwin, K.K., 2009, “Adult\nmice generated from induced pluripotent stem cells,”\n<em>Nature</em>, 461(7260): 91–94.",
                "Brock, D.W., 1998, “Cloning human beings: an assessment of\nthe ethical issues pro and con,” in <em>Facts and Fantasies\nabout Human Cloning</em>, M.C. Nussbaum and C.R. Sunstein (eds.), New\nYork: Norton: 141–164.",
                "–––, 2002, “Human Cloning and Our Sense of\nSelf, ” <em>Science</em>, 269: 314–316.",
                "Brown, M.T., 2009, “Moral complicity in induced pluripotent\nstem cell research,” <em>Kennedy Institute of Ethics\nJournal</em>, 19(1): 1–22.",
                "Buchanan, A., Brock, D.W., Daniels, N., Wikler, D., 2000, <em>From\nChance to Choice: Genetics &amp; Justice</em>, New York: Cambridge\nUniv. Press.",
                "Buchanan, A., 2007, “Institutions, beliefs and ethics:\neugenics as a case study,” <em>Journal of Political\nPhilosophy</em>, 15(1): 22–45.",
                "Cervera, R.P. and Stojkovic, M., 2007, “Human embryonic stem\ncell derivation and nuclear transfer: impact on regenerative\ntherapeutics and drug discovery,” <em>Clinical Pharmacology\n&amp; Therapeutics</em>, 82(3): 310–315.",
                "Cole-Turner, R. (ed.), 1997, <em>Human Cloning: Religious\nResponses</em>, Louisville, KY: Westminster John Knox Press.",
                "Committee on Assessing the Medical Risks of Human Oocyte Donation\nfor Stem Cell Research, 2007, <em>Assessing the Medical Risks of Human\nOocyte Donation for Stem Cell Research: Workshop Report</em>,\nWashington D.C.: The National Academies Press.",
                "Deckers, J., 2007, “Are those who subscribe to the view that\nearly embryos are persons irrational and inconsistent? A reply to\nBrock,” <em>Journal of Medical Ethics</em>, 33(2):\n102–6.",
                "Deech, R., 1999, “Human Cloning and public policy,” In\n<em>The Genetic Revolution and Human Rights</em>, J. Burley (ed.),\nOxford: Oxford University Press: Chapter 4.",
                "Devolder, K., 2005, “Creating and sacrificing embryos for\nstem cells,” <em>Journal of Medical Ethics</em>, 31(6):\n366–370.",
                "–––, 2015, <em>The Ethics of Embryonic Stem Cell\nResearch</em>, Oxford: Oxford University Press.",
                "Devolder, K. and Savulescu, J., 2006, “The moral imperative\nto conduct cloning and stem cell research,” <em>Cambridge\nQuarterly of Healthcare Ethics</em>, 15(1): 7–21.",
                "Dickinson, D., 2002, “Commodification of human tissue:\nimplications for feminist and development ethics,”\n<em>Developing World Bioethics</em>, 2(1): 55–63.",
                "Doerflinger, R.M., 1999, “The ethics of funding embryonic\nstem cell research: A Catholic viewpoint,” <em>Kennedy Institute\nof Ethics Journal</em>, 9(2): 137–150.",
                "Douglas, T. and Savulescu, J., 2009, “Destroying unwanted\nembryos in research,” <em>EMBO Reports</em>, 10(4):\n307–312.",
                "Feinberg, J., 1980, “A Child’s Right to an open\nfuture,” in <em>Whose Child? Parental Rights, Parental Authority\nand State Power</em>, W. Aiken (ed.), Totowa, NJ: Rowman &amp;\nLittlefield: 124–153.",
                "FitzPatrick, W., 2003, “Surplus embryos, nonreproductive\ncloning, and the intend/foresee distinction,” <em>Hastings\nCenter Report</em>, 33(3): 29–36.",
                "Fletcher, J.F., 1988, <em>The Ethics of Genetic Control: Ending\nReproductive Roulette</em>, New York: Prometheus.",
                "French, A.J. <em>et al</em>., 2008, “Development of human\ncloned blastocysts following somatic cell nuclear transfer with adult\nfibroblasts,” <em>Stem Cells</em>, 26(2): 485–93.",
                "George, K., 2007, “What about the women? Ethical and policy\naspects of egg supply for cloning research,” <em>Reproductive\nBioMedicine Online</em>, 15(2): 127–133.",
                "Gruen, L., 2007, “Oocytes for sale?,”\n<em>Metaphilosophy</em>, 38(2–3): 285–308.",
                "Hansen, J.E., 2002, “Embryonic stem cell production through\ntherapeutic cloning has fewer ethical problems than stem cell harvest\nfrom surplus IVF embryos,” <em>Journal of Medical Ethics</em>,\n28(2): 86–8.",
                "Harris, J., 1997, “Goodbye Dolly: The ethics of human\ncloning,” <em>Journal of Medical Ethics</em>, 23(6):\n353–360.",
                "–––, 2004, <em>On Cloning</em>, London:\nRoutledge.",
                "Häyry, M., 2003, “Philosophical arguments for and\nagainst human reproductive cloning,” <em>Bioethics</em>,\n17(5–6): 447–459.",
                "Holm, S., 1998, “A life in the shadow: one reason why we\nshould not clone humans,” <em>Cambridge Quarterly of Healthcare\nEthics</em>, 7: 160–162.",
                "Jonas, H., 1974, <em>Philosophical Essays: From Ancient Creed to\nTechnological Man</em>, Englewood Cliffs, NJ: Prentice-Hall.",
                "Kalfoglou, A.L., Gittelsohn, J.A., 2000, “A qualitative\nfollow-up study of women’s experiences with oocyte\ndonation,” <em>Human Reproduction</em>, 15(4):\n798–805.",
                "Kass, L.R., 1998, “The wisdom of repugnance: why we should\nban the cloning of humans,” <em>Valparaiso University Law\nRev</em>iew 32(2): 679–705.",
                "Kevles, D.J., 1995, [1985], <em>In the Name of Eugenics: Genetics\nand the Uses of Human Heredity</em>, Cambridge, MA: Harvard University\nPress; first edition, 1985.",
                "Kiessling, A.A., 2001, “In the stem-cell debate, new\nconcepts need new words,” <em>Nature</em>, 413(6855): 453.",
                "Kitcher, P., 1997, “Whose self is it, anyway?,”\n<em>Sciences (New York)</em>, 37(5): 58–62.",
                "Langlois, A., 2017. “The global governance of human cloning:\nthe case of UNESCO,” <em>Palgrave Communications</em>, 3: 17019.\ndoi:10.1057/palcomms.2017.19",
                "Levick, S.E., 2004, <em>Clone Being: Exploring the Psychological\nand Social Dimensions</em>, Lanham: Rowman &amp; Littlefield\nPublishers, Inc.",
                "Levy, N. and Lotz, M., 2005, “Reproductive cloning and a\n(kind of) genetic fallacy,” <em>Bioethics</em>, 19:\n232–250.",
                "Lipschutz, J.H., 1999, “To clone or not to clone–a Jewish\nperspective,” <em>Journal of Medical Ethics</em>, 25(2):\n105–7.",
                "Ma, H., O’Neil, R.C., Gutierrez, N.M., Hariharan, M., Zhang,\nZ.Z., He, Y., Cinnioglu, C., Kayali, R., Kang, E., Lee, Y., et al.,\n2017, “Functional Human Oocytes Generated by Transfer of Polar\nBody Genomes,” <em>Cell Stem Cell</em>, 20: 112–119.",
                "Macintosh, K.L., 2005, <em>Illegal Beings. Human Clones and the\nLaw</em>, New York: Cambridge University Press.",
                "Magnus, D. and Cho, M.K., 2005, “Issues in oocyte donation\nfor stem cell research,” <em>Science</em>, 308:\n1747–8.",
                "McDougall, R., 2008, “A resource-based version of the\nargument that cloning is an affront to human dignity,”\n<em>Journal of Medical Ethics</em>, 34(4): 259–261.",
                "McHugh, P.R., 2004, “Zygote and ’clonote‘\n– the ethical use of embryonic stem cells,” <em>New\nEngland Journal of Medicine</em>, 351(3): 209–11.",
                "McGee G. (ed.), 2000, <em>The Human Cloning Debate</em>, 2nd\nedition, Berkeley, CA: Berkeley Hills Books.",
                "Mertes, H. and Pennings, G., 2007, “Oocyte donation in stem\ncell research,” <em>Human Reproduction</em>, 22(3):\n629–634.",
                "National Bioethics Advisory Commission, NBAC, (1999), <em>Ethical\nIssues in Human Stem Cell Research</em>, Rockville, MD: NBAC.",
                "Noggle, S., Fung, H.L., Gore, A., Martinez, H., Satriani, K.C., et\nal., 2011, “Human oocytes reprogram somatic cells to a\npluripotent state,” <em>Nature</em>, 478(7367): 70–5.",
                "O’Neil, O., 2002, <em>Autonomy and Trust in Bioethics\n(Gifford Lectures 2001)</em>, Cambridge: Cambridge University\nPress.",
                "Paul, D., 1995, <em>Controlling Human Heredity: 1865 to\nPresent</em>, Atlantic Highlands, NJ: Humanities Press.",
                "Pence, G., 1998, <em>Who’s Afraid of Human Cloning?</em>,\nLanham, MD: Rowman &amp; Littlefield.",
                "Pera, M. and Trounson, A., 2013, “Cloning debate: Stem-cell\nresearchers must stay engaged,” <em>Nature</em>, 498:\n159–161.",
                "President’s Council on Bioethics [PCBE], 2002, <em>Human\nCloning and Human Dignity: An Ethical Inquiry</em>, Washington D.C.:\nPCBE.",
                "Putnam, H., 1997, “Cloning people,” in <em>The Genetic\nRevolution and Human Rights</em>, J. Burley (ed.), Oxford: Oxford\nUniv. Press: 1–13.",
                "Ramsey, P., 1966, “Moral and religious implications of\ngenetic control,” in <em>Genetics and the Future Man</em>, J.D.\nRoslansky (ed.), New York: Appleton-Century Crofts, 107–69.",
                "Rao, M. and Condic M.L., 2008, “Alternative sources of\npluripotent stem cells: scientific solutions to an ethical\ndilemma,” <em>Stem Cells and Development</em>, 17(1):\n1–10.",
                "Resnik, D.B., 2001, “Regulating the market for human\neggs,” <em>Bioethics</em>, 15(1): 1–25.",
                "Roberts, C., Throsby, K., 2008, “Paid to share: IVF\npatients, eggs and stem cell research,” <em>Social Science &amp;\nMedicine</em>, 66(1): 159–169.",
                "Robertson, J.A, 1995, “Symbolic issues in embryo\nresearch,” <em>Hastings Center Report</em>, 25(1):\n37–38.",
                "Rulli, T., 2016, “Preferring a Genetically-Related\nChild,” <em>Journal of Moral Philosophy</em>, 13:\n669–698.",
                "Sadeghi, M., 2007, “Islamic perspectives on human\ncloning,” <em>Human Reproduction and Genetic Ethics</em>, 13(2):\n32–40.",
                "Saitou, M. and Miyauchi, H., 2016, “Gametogenesis from\nPluripotent Stem Cells,” <em>Cell Stem Cell</em>, 18:\n721–735.",
                "Sandel, M.J., 2007, <em>The Case Against Perfection. Ethics in the\nAge of Genetic Engineering</em>, Cambridge, MA: Belknap Press.",
                "Saunders, R. and Savulescu, J., 2008, “Research ethics and\nlessons from Hwanggate: what can we learn from the Korean cloning\nfraud?,” <em>Journal of Medical Ethics</em>, 34(3):\n214–221.",
                "Savulescu, J., 1999, “Should we clone human beings? Cloning\nas a source of tissue transplantation,” <em>Journal of Medical\nEthics</em>, 25: 87–95.",
                "Segal, N.L., 2000, <em>Entwined Lives: Twins and What They Tell Us\nAbout Human Behavior</em>, New York: Plume.",
                "Sparrow, R. 2006. “Cloning, Parenthood, and Genetic\nRelatedness,” <em>Bioethics</em>, 20(6): 308–318.",
                "Steinbock, B., 2001, “Respect for human embryos,” in\n<em>Cloning and the Future of Human Embryo Research</em>, P. Lauritzen\n(ed.), Oxford: Oxford University Press: 21–33.",
                "–––, 2004, “Payment for egg donation and\nsurrogacy,” <em>Mount Sinai Journal of Medicine</em>, 71(4):\n255–265.",
                "Strong, C., 2005, “Harming by conceiving: a review of\nmisconceptions and a new analysis,” <em>The Journal of Medicine\nand Philosophy</em>, 30: 491–516.",
                "–––, 2008, “Cloning and adoption: a reply\nto Levy and Lotz,” <em>Bioethics</em>, 22(2):\n130–136.",
                "Tachibana, M., Amato, P., Sparman, M., Gutierrez, N.M.,\nTippner-Hedges, R., Ma, H., Kang, E., Fulati, A., Lee, H.S.,\nSritanaudomchai, H., et al., 2013, “Human Embryonic Stem Cells\nDerived by Somatic Cell Nuclear Transfer,” <em>Cell</em>, 153:\n1228–1238.",
                "Tooley, M., 1998, “The moral status of the cloning of\nhumans,” in <em>Human Cloning: Biomedical Ethical Reviews</em>,\nJ. Humber and R. Almeder (eds.), Totowa, NJ: Humana Press:\n65–102.",
                "Walters, L., 2004, “Human embryonic stem cell research: an\nintercultural perspective,” <em>Kennedy Institute of Ethics\nJournal</em>, 14(1): 3–38.",
                "Wilmut, I., Schnieke, A.E., McWhir J., et al., 1997,\n<sup>“</sup>Viable offspring derived from fetal and adult\nmammalian cells,” <em>Nature</em>, 385:810–3.",
                "Wilmut, I., Campbell, K.H., Tudge, C., 2001, <em>The Second\nCreation: The Age of Biological Control</em>, London: Headline Book\nPublishing.",
                "Whitworth, K.M. and Prather, R.S., 2010, “Somatic cell\nnuclear transfer efficiency: How can it be improved through nuclear\nremodeling and reprogramming?,” <em>Molecular Reproduction and\nDevelopment</em>, 77(12): 1001–1015."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Agar, N., 2004, <em>Liberal Eugenics: In Defense of Human\nEnhancement</em>, Oxford: Blackwell Publishing.</li>\n<li>Ahlberg, J. and Brighouse, H., 2011, “An argument against\ncloning,” <em>Canadian Journal of Philosophy</em>, 40(4):\n539–566.</li>\n<li>Alpers, A. and Lo, B., 1995, “Commodification and\ncommercialization in human embryo research,” <em>Stanford Law\n&amp; Policy Review</em>, 6(2): 39–46.</li>\n<li>American Medical Association, AMA, (1999), <em>Report of the\nCouncil on Ethical and Judicial Affairs</em>, American Medical\nAssociation.</li>\n<li>Annas, G., 1998, “The prospect of human cloning: an\nopportunity for national and international cooperation,” in\n<em>Human Cloning: Biomedical Ethical Reviews </em>, J. Humber and R.\nAlmeder (eds.), New Jersey: Humana Press.</li>\n<li>Asch, A. and Wasserman, D., 2005, “Where is the sin in\nsynecdoche,” in <em>Quality of life and human difference:\ngenetic testing, health care</em>, <em>and disability</em>, D.\nWasserman, R.S. Wachbroit, and J.E. Bickenbach (eds.), New York:\nCambridge University Press.</li>\n<li>Baylis, F., and C. McLeod, 2007, “The stem cell debate\ncontinues: the buying and selling of eggs for research,”\n<em>Journal of Medical Ethics</em>, 33(12): 726–731.</li>\n<li>Birnbacher, D., 2005, “Human cloning and human\ndignity,” <em>Reproductive Biomedicine Online</em> (Supplement),\n10: 50–55.</li>\n<li>Boland, M.J., Hazen, J.L., Nazor, K.L., Rodriguez, A.R., Gifford,\nW., Martin, G., Kupriyanov, S., and Baldwin, K.K., 2009, “Adult\nmice generated from induced pluripotent stem cells,”\n<em>Nature</em>, 461(7260): 91–94.</li>\n<li>Brock, D.W., 1998, “Cloning human beings: an assessment of\nthe ethical issues pro and con,” in <em>Facts and Fantasies\nabout Human Cloning</em>, M.C. Nussbaum and C.R. Sunstein (eds.), New\nYork: Norton: 141–164.</li>\n<li>–––, 2002, “Human Cloning and Our Sense of\nSelf, ” <em>Science</em>, 269: 314–316.</li>\n<li>Brown, M.T., 2009, “Moral complicity in induced pluripotent\nstem cell research,” <em>Kennedy Institute of Ethics\nJournal</em>, 19(1): 1–22.</li>\n<li>Buchanan, A., Brock, D.W., Daniels, N., Wikler, D., 2000, <em>From\nChance to Choice: Genetics &amp; Justice</em>, New York: Cambridge\nUniv. Press.</li>\n<li>Buchanan, A., 2007, “Institutions, beliefs and ethics:\neugenics as a case study,” <em>Journal of Political\nPhilosophy</em>, 15(1): 22–45.</li>\n<li>Cervera, R.P. and Stojkovic, M., 2007, “Human embryonic stem\ncell derivation and nuclear transfer: impact on regenerative\ntherapeutics and drug discovery,” <em>Clinical Pharmacology\n&amp; Therapeutics</em>, 82(3): 310–315.</li>\n<li>Cole-Turner, R. (ed.), 1997, <em>Human Cloning: Religious\nResponses</em>, Louisville, KY: Westminster John Knox Press.</li>\n<li>Committee on Assessing the Medical Risks of Human Oocyte Donation\nfor Stem Cell Research, 2007, <em>Assessing the Medical Risks of Human\nOocyte Donation for Stem Cell Research: Workshop Report</em>,\nWashington D.C.: The National Academies Press.</li>\n<li>Deckers, J., 2007, “Are those who subscribe to the view that\nearly embryos are persons irrational and inconsistent? A reply to\nBrock,” <em>Journal of Medical Ethics</em>, 33(2):\n102–6.</li>\n<li>Deech, R., 1999, “Human Cloning and public policy,” In\n<em>The Genetic Revolution and Human Rights</em>, J. Burley (ed.),\nOxford: Oxford University Press: Chapter 4.</li>\n<li>Devolder, K., 2005, “Creating and sacrificing embryos for\nstem cells,” <em>Journal of Medical Ethics</em>, 31(6):\n366–370.</li>\n<li>–––, 2015, <em>The Ethics of Embryonic Stem Cell\nResearch</em>, Oxford: Oxford University Press.</li>\n<li>Devolder, K. and Savulescu, J., 2006, “The moral imperative\nto conduct cloning and stem cell research,” <em>Cambridge\nQuarterly of Healthcare Ethics</em>, 15(1): 7–21.</li>\n<li>Dickinson, D., 2002, “Commodification of human tissue:\nimplications for feminist and development ethics,”\n<em>Developing World Bioethics</em>, 2(1): 55–63.</li>\n<li>Doerflinger, R.M., 1999, “The ethics of funding embryonic\nstem cell research: A Catholic viewpoint,” <em>Kennedy Institute\nof Ethics Journal</em>, 9(2): 137–150.</li>\n<li>Douglas, T. and Savulescu, J., 2009, “Destroying unwanted\nembryos in research,” <em>EMBO Reports</em>, 10(4):\n307–312.</li>\n<li>Feinberg, J., 1980, “A Child’s Right to an open\nfuture,” in <em>Whose Child? Parental Rights, Parental Authority\nand State Power</em>, W. Aiken (ed.), Totowa, NJ: Rowman &amp;\nLittlefield: 124–153.</li>\n<li>FitzPatrick, W., 2003, “Surplus embryos, nonreproductive\ncloning, and the intend/foresee distinction,” <em>Hastings\nCenter Report</em>, 33(3): 29–36.</li>\n<li>Fletcher, J.F., 1988, <em>The Ethics of Genetic Control: Ending\nReproductive Roulette</em>, New York: Prometheus.</li>\n<li>French, A.J. <em>et al</em>., 2008, “Development of human\ncloned blastocysts following somatic cell nuclear transfer with adult\nfibroblasts,” <em>Stem Cells</em>, 26(2): 485–93.</li>\n<li>George, K., 2007, “What about the women? Ethical and policy\naspects of egg supply for cloning research,” <em>Reproductive\nBioMedicine Online</em>, 15(2): 127–133.</li>\n<li>Gruen, L., 2007, “Oocytes for sale?,”\n<em>Metaphilosophy</em>, 38(2–3): 285–308.</li>\n<li>Hansen, J.E., 2002, “Embryonic stem cell production through\ntherapeutic cloning has fewer ethical problems than stem cell harvest\nfrom surplus IVF embryos,” <em>Journal of Medical Ethics</em>,\n28(2): 86–8.</li>\n<li>Harris, J., 1997, “Goodbye Dolly: The ethics of human\ncloning,” <em>Journal of Medical Ethics</em>, 23(6):\n353–360.</li>\n<li>–––, 2004, <em>On Cloning</em>, London:\nRoutledge.</li>\n<li>Häyry, M., 2003, “Philosophical arguments for and\nagainst human reproductive cloning,” <em>Bioethics</em>,\n17(5–6): 447–459.</li>\n<li>Holm, S., 1998, “A life in the shadow: one reason why we\nshould not clone humans,” <em>Cambridge Quarterly of Healthcare\nEthics</em>, 7: 160–162.</li>\n<li>Jonas, H., 1974, <em>Philosophical Essays: From Ancient Creed to\nTechnological Man</em>, Englewood Cliffs, NJ: Prentice-Hall.</li>\n<li>Kalfoglou, A.L., Gittelsohn, J.A., 2000, “A qualitative\nfollow-up study of women’s experiences with oocyte\ndonation,” <em>Human Reproduction</em>, 15(4):\n798–805.</li>\n<li>Kass, L.R., 1998, “The wisdom of repugnance: why we should\nban the cloning of humans,” <em>Valparaiso University Law\nRev</em>iew 32(2): 679–705.</li>\n<li>Kevles, D.J., 1995, [1985], <em>In the Name of Eugenics: Genetics\nand the Uses of Human Heredity</em>, Cambridge, MA: Harvard University\nPress; first edition, 1985.</li>\n<li>Kiessling, A.A., 2001, “In the stem-cell debate, new\nconcepts need new words,” <em>Nature</em>, 413(6855): 453.</li>\n<li>Kitcher, P., 1997, “Whose self is it, anyway?,”\n<em>Sciences (New York)</em>, 37(5): 58–62.</li>\n<li>Langlois, A., 2017. “The global governance of human cloning:\nthe case of UNESCO,” <em>Palgrave Communications</em>, 3: 17019.\ndoi:10.1057/palcomms.2017.19</li>\n<li>Levick, S.E., 2004, <em>Clone Being: Exploring the Psychological\nand Social Dimensions</em>, Lanham: Rowman &amp; Littlefield\nPublishers, Inc.</li>\n<li>Levy, N. and Lotz, M., 2005, “Reproductive cloning and a\n(kind of) genetic fallacy,” <em>Bioethics</em>, 19:\n232–250.</li>\n<li>Lipschutz, J.H., 1999, “To clone or not to clone–a Jewish\nperspective,” <em>Journal of Medical Ethics</em>, 25(2):\n105–7.</li>\n<li>Ma, H., O’Neil, R.C., Gutierrez, N.M., Hariharan, M., Zhang,\nZ.Z., He, Y., Cinnioglu, C., Kayali, R., Kang, E., Lee, Y., et al.,\n2017, “Functional Human Oocytes Generated by Transfer of Polar\nBody Genomes,” <em>Cell Stem Cell</em>, 20: 112–119.</li>\n<li>Macintosh, K.L., 2005, <em>Illegal Beings. Human Clones and the\nLaw</em>, New York: Cambridge University Press.</li>\n<li>Magnus, D. and Cho, M.K., 2005, “Issues in oocyte donation\nfor stem cell research,” <em>Science</em>, 308:\n1747–8.</li>\n<li>McDougall, R., 2008, “A resource-based version of the\nargument that cloning is an affront to human dignity,”\n<em>Journal of Medical Ethics</em>, 34(4): 259–261.</li>\n<li>McHugh, P.R., 2004, “Zygote and ’clonote‘\n– the ethical use of embryonic stem cells,” <em>New\nEngland Journal of Medicine</em>, 351(3): 209–11.</li>\n<li>McGee G. (ed.), 2000, <em>The Human Cloning Debate</em>, 2nd\nedition, Berkeley, CA: Berkeley Hills Books.</li>\n<li>Mertes, H. and Pennings, G., 2007, “Oocyte donation in stem\ncell research,” <em>Human Reproduction</em>, 22(3):\n629–634.</li>\n<li>National Bioethics Advisory Commission, NBAC, (1999), <em>Ethical\nIssues in Human Stem Cell Research</em>, Rockville, MD: NBAC.</li>\n<li>Noggle, S., Fung, H.L., Gore, A., Martinez, H., Satriani, K.C., et\nal., 2011, “Human oocytes reprogram somatic cells to a\npluripotent state,” <em>Nature</em>, 478(7367): 70–5.</li>\n<li>O’Neil, O., 2002, <em>Autonomy and Trust in Bioethics\n(Gifford Lectures 2001)</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Paul, D., 1995, <em>Controlling Human Heredity: 1865 to\nPresent</em>, Atlantic Highlands, NJ: Humanities Press.</li>\n<li>Pence, G., 1998, <em>Who’s Afraid of Human Cloning?</em>,\nLanham, MD: Rowman &amp; Littlefield.</li>\n<li>Pera, M. and Trounson, A., 2013, “Cloning debate: Stem-cell\nresearchers must stay engaged,” <em>Nature</em>, 498:\n159–161.</li>\n<li>President’s Council on Bioethics [PCBE], 2002, <em>Human\nCloning and Human Dignity: An Ethical Inquiry</em>, Washington D.C.:\nPCBE.</li>\n<li>Putnam, H., 1997, “Cloning people,” in <em>The Genetic\nRevolution and Human Rights</em>, J. Burley (ed.), Oxford: Oxford\nUniv. Press: 1–13.</li>\n<li>Ramsey, P., 1966, “Moral and religious implications of\ngenetic control,” in <em>Genetics and the Future Man</em>, J.D.\nRoslansky (ed.), New York: Appleton-Century Crofts, 107–69.</li>\n<li>Rao, M. and Condic M.L., 2008, “Alternative sources of\npluripotent stem cells: scientific solutions to an ethical\ndilemma,” <em>Stem Cells and Development</em>, 17(1):\n1–10.</li>\n<li>Resnik, D.B., 2001, “Regulating the market for human\neggs,” <em>Bioethics</em>, 15(1): 1–25.</li>\n<li>Roberts, C., Throsby, K., 2008, “Paid to share: IVF\npatients, eggs and stem cell research,” <em>Social Science &amp;\nMedicine</em>, 66(1): 159–169.</li>\n<li>Robertson, J.A, 1995, “Symbolic issues in embryo\nresearch,” <em>Hastings Center Report</em>, 25(1):\n37–38.</li>\n<li>Rulli, T., 2016, “Preferring a Genetically-Related\nChild,” <em>Journal of Moral Philosophy</em>, 13:\n669–698.</li>\n<li>Sadeghi, M., 2007, “Islamic perspectives on human\ncloning,” <em>Human Reproduction and Genetic Ethics</em>, 13(2):\n32–40.</li>\n<li>Saitou, M. and Miyauchi, H., 2016, “Gametogenesis from\nPluripotent Stem Cells,” <em>Cell Stem Cell</em>, 18:\n721–735.</li>\n<li>Sandel, M.J., 2007, <em>The Case Against Perfection. Ethics in the\nAge of Genetic Engineering</em>, Cambridge, MA: Belknap Press.</li>\n<li>Saunders, R. and Savulescu, J., 2008, “Research ethics and\nlessons from Hwanggate: what can we learn from the Korean cloning\nfraud?,” <em>Journal of Medical Ethics</em>, 34(3):\n214–221.</li>\n<li>Savulescu, J., 1999, “Should we clone human beings? Cloning\nas a source of tissue transplantation,” <em>Journal of Medical\nEthics</em>, 25: 87–95.</li>\n<li>Segal, N.L., 2000, <em>Entwined Lives: Twins and What They Tell Us\nAbout Human Behavior</em>, New York: Plume.</li>\n<li>Sparrow, R. 2006. “Cloning, Parenthood, and Genetic\nRelatedness,” <em>Bioethics</em>, 20(6): 308–318.</li>\n<li>Steinbock, B., 2001, “Respect for human embryos,” in\n<em>Cloning and the Future of Human Embryo Research</em>, P. Lauritzen\n(ed.), Oxford: Oxford University Press: 21–33.</li>\n<li>–––, 2004, “Payment for egg donation and\nsurrogacy,” <em>Mount Sinai Journal of Medicine</em>, 71(4):\n255–265.</li>\n<li>Strong, C., 2005, “Harming by conceiving: a review of\nmisconceptions and a new analysis,” <em>The Journal of Medicine\nand Philosophy</em>, 30: 491–516.</li>\n<li>–––, 2008, “Cloning and adoption: a reply\nto Levy and Lotz,” <em>Bioethics</em>, 22(2):\n130–136.</li>\n<li>Tachibana, M., Amato, P., Sparman, M., Gutierrez, N.M.,\nTippner-Hedges, R., Ma, H., Kang, E., Fulati, A., Lee, H.S.,\nSritanaudomchai, H., et al., 2013, “Human Embryonic Stem Cells\nDerived by Somatic Cell Nuclear Transfer,” <em>Cell</em>, 153:\n1228–1238.</li>\n<li>Tooley, M., 1998, “The moral status of the cloning of\nhumans,” in <em>Human Cloning: Biomedical Ethical Reviews</em>,\nJ. Humber and R. Almeder (eds.), Totowa, NJ: Humana Press:\n65–102.</li>\n<li>Walters, L., 2004, “Human embryonic stem cell research: an\nintercultural perspective,” <em>Kennedy Institute of Ethics\nJournal</em>, 14(1): 3–38.</li>\n<li>Wilmut, I., Schnieke, A.E., McWhir J., et al., 1997,\n<sup>“</sup>Viable offspring derived from fetal and adult\nmammalian cells,” <em>Nature</em>, 385:810–3.</li>\n<li>Wilmut, I., Campbell, K.H., Tudge, C., 2001, <em>The Second\nCreation: The Age of Biological Control</em>, London: Headline Book\nPublishing.</li>\n<li>Whitworth, K.M. and Prather, R.S., 2010, “Somatic cell\nnuclear transfer efficiency: How can it be improved through nuclear\nremodeling and reprogramming?,” <em>Molecular Reproduction and\nDevelopment</em>, 77(12): 1001–1015.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "donation of human organs",
            "ethics, biomedical: stem cell research",
            "eugenics",
            "feminist philosophy, topics: perspectives on reproduction and the family",
            "informed consent",
            "moral status, grounds of",
            "personal identity",
            "respect"
        ],
        "entry_link": [
            {
                "../organ-donation/": "donation of human organs"
            },
            {
                "../stem-cells/": "ethics, biomedical: stem cell research"
            },
            {
                "../eugenics/": "eugenics"
            },
            {
                "../feminism-family/": "feminist philosophy, topics: perspectives on reproduction and the family"
            },
            {
                "../informed-consent/": "informed consent"
            },
            {
                "../grounds-moral-status/": "moral status, grounds of"
            },
            {
                "../identity-personal/": "personal identity"
            },
            {
                "../respect/": "respect"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=cloning\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/cloning/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=cloning&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/cloning/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=cloning": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/cloning/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=cloning&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/cloning/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "UNESCO,\n “<a href=\"http://portal.unesco.org/en/ev.php-URL_ID=13177&amp;URL_DO=DO_TOPIC&amp;URL_SECTION=201.html\" target=\"other\">Universal Declaration on the Human Genome and Human Rights</a>”,\n adopted 11 November 1997."
        ],
        "listed_links": [
            {
                "http://portal.unesco.org/en/ev.php-URL_ID=13177&URL_DO=DO_TOPIC&URL_SECTION=201.html": "Universal Declaration on the Human Genome and Human Rights"
            }
        ]
    }
}