{
    "url": "conservatism",
    "title": "Conservatism",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Andy Hamilton\n<a.j.hamilton@durham.ac.uk>",
        "author_links": [
            {
                "mailto:a%2ej%2ehamilton%40durham%2eac%2euk": "a.j.hamilton@durham.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nAndy Hamilton\n&lt;<a href=\"mailto:a%2ej%2ehamilton%40durham%2eac%2euk\"><em>a<abbr title=\" dot \">.</abbr>j<abbr title=\" dot \">.</abbr>hamilton<abbr title=\" at \">@</abbr>durham<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Aug 1, 2015",
        "substantive revision Tue Oct 29, 2019"
    ],
    "preamble": "\n\nConservatism and its modernising, anti-traditionalist rivals,\nliberalism and socialism, are the most influential political\nphilosophies and ideologies of the post-Enlightenment era.\nConservatives criticise their rivals for making a utopian exaggeration\nof the power of theoretical reason, and of human perfectibility.\nConservative prescriptions are based on what they regard as experience\nrather than reason; for them, the ideal and the practical are\ninseparable. Most commentators regard conservatism as a modern\npolitical philosophy, even though it exhibits the standpoint of\npaternalism or authority, rather than freedom. As John Gray writes,\nwhile liberalism is the dominant political theory of the modern age,\nconservatism, despite appealing to tradition, is also a response to\nthe challenges of modernity. The roots of all three standpoints\n“may be traced back to the crises of seventeenth-century\nEngland, but [they] crystallised into definite traditions of thought\nand practice only [after] the French Revolution” (Gray 1995:\n78).\n\nIt is contested both what conservatism is, and what it could or ought\nto be—both among the public and politicians, and among the\nphilosophers and political theorists that this article focuses on.\nPopularly, “conservative” is a generic term for\n“right-wing viewpoint occupying the political spectrum between\nliberalism and fascism”. Philosophical commentators offer a more\ndistinctive characterisation. Many treat it as a standpoint that is\nsceptical of abstract reasoning in politics, and that appeals instead\nto living tradition, allowing for the possibility of limited political\nreform. On this view, conservatism is neither dogmatic reaction, nor\nthe right-wing radicalism of Margaret Thatcher or contemporary\nAmerican “neo-conservatives”. Other commentators, however,\ncontrast this “pragmatic conservatism” with a universalist\n“rational conservatism” that is not sceptical of reason,\nand that regards a community with a hierarchy of authority as most\nconducive to human well-being (Skorupski 2015).\n\nCompared to liberalism and socialism, conservatism has suffered\nphilosophical neglect (Broad 1913: 396–7). Many deny that it is\nan ideology, or even a political philosophy, regarding it instead as a\ndisposition that resists theoretical expression—a\n“non-ideology” that attempts to avoid the errors of\nideologies (Graham 1986: 172; in contrast, Nisbet 1986). Is it an\nancient attitude, or one that developed only in response to\nEnlightenment rationality and its political products, liberalism and\nsocialism? How is it related to contemporary\n“neo-conservatism”? Is it a coherent position, or does it,\nas many have argued, fail to distinguish what is worth conserving from\nwhat is not? These are some of the questions commonly raised about\nconservatism, and explored here.\n",
    "toc": [
        {
            "#NatCon": "1. The Nature of Conservatism"
        },
        {
            "#BroVerNarSenCon": "1.1 Broad versus narrow sense conservatism"
        },
        {
            "#NarSenBurConSceAboRea": "1.2 Narrow sense or Burkean conservatism as scepticism about reason"
        },
        {
            "#TraGraRefConVsRea": "1.3 Tradition and gradual reform: conservatism vs. reaction"
        },
        {
            "#ForProVsSubSenConConNeoConLib": "1.4 Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism"
        },
        {
            "#ConLibStaFreVsStaPat": "1.5 Conservatism and liberalism: the standpoint of freedom vs. standpoint of paternalism"
        },
        {
            "#DevConTho": "2. The Development of Conservative Thought"
        },
        {
            "#UseTerCon": "2.1 Use of the term “conservative”"
        },
        {
            "#PreBurCon": "2.2 Precursors of Burkean conservatism"
        },
        {
            "#BurCon": "2.3 Burkean conservatism"
        },
        {
            "#RatIdeCon": "2.4 “Rational” or Idealist conservatism"
        },
        {
            "#NorAmeTra": "2.5 North American traditions"
        },
        {
            "#ModConSidOakScr": "2.6 Modern conservatism: Sidgwick, Oakeshott, Scruton"
        },
        {
            "#CriCon": "3. Critiques of conservatism"
        },
        {
            "#WhaTraComCri": "3.1 What tradition? Communitarian critique"
        },
        {
            "#LibCri": "3.2 Liberal critique"
        },
        {
            "#LefCri": "3.3 Left critiques"
        },
        {
            "#CohParSce": "3.4 The coherence of particularist scepticism"
        },
        {
            "#CulConCon": "4. Cultural conservatism and conservation"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Nature of Conservatism\n1.1 Broad versus narrow sense conservatism\n\nConservatism in a broad sense, as a social attitude, has always\nexisted. It expresses the instinctive human fear of sudden change, and\ntendency to habitual action. Cecil, for instance, contrasts\n“modern Conservatism” with the “natural\nconservatism” from which it arises and depends on, found\n“in almost every human mind” (Cecil, 1912: 8). The\narch-royalist and anti-populist Earl of Clarendon, writing the history\nof the 17th century English Civil War soon after it\nhappened, was instinctively conservative in this broader,\nun-self-conscious sense. Thus Beiser contrasts the “conservatism\n[that] had always existed in Germany as a social attitude”, with\na self-conscious conservatism that developed as a social force in the\n1790s, opposed to the Aufklärung or Enlightenment, and\nin reaction to the French Revolution (Beiser 1992: 281).\n“Self-conscious” here means not merely implicit in\nbehaviour, but consciously avowed, and ascribed to others. The most\ndistinctive and historically important version of this narrower,\nself-conscious conservatism rests on scepticism concerning reason in\npolitics.\n\nVarious precursors of this self-conscious conservatism have been\nclaimed. Aristotle is often cited, for holding that morality and\npolitics—unlike natural science—lack special experts, and\nthat in these areas, human experience over generations is the main\nsource of knowledge. Confucius is another possible precursor. His\nconcern with the breakdown of contemporary political institutions led\nto a cautious, conservative political outlook; his stress on authority\nand hierarchy prefigures central conservative themes. From a later but\nstill pre-Enlightenment era, the English common law notion of\nprecedent, developed by such as Edward Coke (1552–1634), is a\nclear influence on self-conscious conservatism (Pocock 1989). For\nHoppit,\n\n\nTory, or what would now be called ‘conservative’,\npolitical thought remained alive and well [in England] in the 1690s\nand 1700s….Thomas Sherlock [wrote] in 1704, ‘To maintain\nthe Establish’d Form of Government, is the First and Highest\nDuty of Men Acting in Society’. (Hoppit 2000: 196)\n\n\nDavid Hume (1711–1776) is sometimes regarded as a conservative.\nHe was a sceptic about reasoning concerning ends as opposed to means,\nbut did not live to see the French Revolution and the arguments\nunderlying it; Dr. Johnson, a true Tory, remarked that he was “a\nTory by chance” (reported by Boswell, in Fieser ed. 2005:\n290).\n\nThe preceding thinkers are proto-conservatives; it is commonly\naccepted that as a self-conscious standpoint, conservatism came into\nexistence with or after Burke’s critique of the French\nRevolution (Kirk 1954: 5; Honderich 2005: 6; Nisbet 1986; Claeys 2007:\n11–34). The 18th century European Enlightenment aimed\nto improve the human condition through reform of political\ninstitutions. Its thinkers aimed to establish ethical and political\nprinciples that appealed to reason rather than established authority\nor tradition, a “universal ethics independent of historically\ncontingent tradition” (Beveridge and Turnbull 1997: 124). The\nFrench Revolution gave powerful expression to this belief, rapidly\nreinforced by the Industrial Revolution and growth of capitalism. The\ndevelopment of capitalism, followed and revolutionised by\nindustrialisation, led to a process of cultural globalisation (see\nBayly 2004: Part I). Everyday experience, conditioned by the diffusion\nof commodities and ideas, reflected an increasing global\nstandardisation of cultural expression. In the 19th century, the\ndevelopment of communications by the invention of the telegraph, and\nthe growth of news media, popular culture and international travel,\nled to increasing cultural homogeneity and the appearance of more\ncosmopolitan ethical outlooks.\n\nAs far as the evolution of conservatism is concerned, the French\nRevolution was key. For many contemporary writers, that Revolution was\na liberation of the human spirit, an assertion of reason against\nirrational feudal authority. The Revolution reflected an Enlightenment\nattitude towards history, which it regarded not as the inevitable\nrealisation of a divine plan, but as open to direction by enlightened\nreason, expressed in social and educational reform. Although\nconservative thinkers opposed the French Revolution, their attitude\ntowards the Enlightenment is debated. Burke, as we will see the\nleading conservative thinker, is often associated with what Isaiah\nBerlin called the “Counter-Enlightenment”, but he has also\nbeen seen as “an Enlightened figure, who saw himself defending\nEnlightened Europe against the gens de lettres and their\nrevolutionary successors”—it was “one Enlightenment\nin conflict with another” (Pocock 1999: 7); “Burke was a\nlifelong student of the Enlightenment who saw in the French Revolution\nthe ultimate threat to…modern, rational, libertarian,\nenlightened Whig values” (Clark 2001: 108). Bourke comments that\nhistorians have\n\n\nmistaken Burke’s enlightened opposition to doctrinaire attacks\non organised religion for a…counter-enlightenment\ncrusade… encouraged by a secular teleology [that reduces]\nenlightenment to the criticism of religion…Burke’s\nespousal of sceptical Whiggism and Protestant toleration is curiously\nreinterpreted as hostile to the very principles of enlightenment he\nwas in fact defending. (Bourke 2014: 28) \n\n\nThus the common assumption that conservatism rejects modernity is\nquestioned by Scruton, for whom it “is itself a\nmodernism… [that desires] to live fully in the present, to\nunderstand it in all its imperfections” (2007: 194). John Gray\ncomments that Oakeshott’s conservative thought is paradoxical in\nthat he “is in no sense an anti-modernist: If anything, he is an\nuncompromising modernist, perhaps even a postmodernist” (Gray\n2007, Other Internet Resources).\n\nIt is important to recognise that the precise appearance of\nconservatism after 1789 is disputed. For some writers argue, the\nideology of conservatism was not articulated until the 1880s and 90s;\nonly then was Burke established as conservatism’s ‘master\nintellectual’ (Jones 2017). Jones cites MacCunn’s The\nPolitical Philosophy of Burke (1913), which converted the Whig\nstatesman into the originator of a political philosophy of\nconservatism. Cecil’s Conservatism (1912) firmly established\nthe connection, devoting a chapter to Burke as the founder of\nconservatism. In contrast, Clark places the appropriation earlier,\narguing that “That new creation of the 1830s,\n‘conservatism’, adopted Burke as its patron\nsaint…If it was difficult after 1832 to build any systematic\npolitical theory around the historical Burke’s principles, the social\nand political order having changed out of recognition, a Burkean style\nnevertheless passed into English discourse” (Clark, 2001:\n109-10).\n1.2 Narrow sense or Burkean conservatism as scepticism about reason\n\nIn its narrow, self-conscious sense, conservatism can be characterised\nas an\n\n\napproach to human affairs which mistrusts both a priori\nreasoning and revolution, preferring to put its trust in experience\nand in the gradual improvement of tried and tested arrangements.\n(O’Hear 1998)\n\n\nKekes argues similarly that conservatism, with its defining scepticism\nand opposition to “rationalism” in politics, contrasts\nwith liberalism and socialism in rejecting a priori\nvalue-commitments (Kekes 1997: 368). This position was enunciated most\ntrenchantly by Burke, conservatism’s “master\nintellectual”, acknowledged by almost all subsequent\nconservatives. He rejected a priori reasoning in politics,\nnotably claims to abstract natural rights, manifested most\ndramatically in the French Jacobin dream of destroying and rebuilding\nsociety. Burke holds that there is a practical wisdom in institutions\nthat is mostly not articulable theoretically, certainly not in\nadvance, but is passed down in culture and tradition. \n\nRevolutionary Jacobinism is conservatism’s polar opposite and\nhistoric contender. The name comes from the Jacobin Club whose central\nfigure, Robespierre, launched the French Revolutionary Terror. (On\nrevolution and Jacobinism, see Graham 1986: 178–81.)\nConservatives such as Burke contrast the French Revolution with\nEngland’s more peaceful Glorious Revolution of 1688, which for\nthem was a revolution in the original sense—a return to an\nalleged status quo prior to monarchical absolutism, as\nopposed to an overturning of traditional institutions in accord with a\nrational plan. Conservatism and revolutionary Jacobinism are\ninter-dependent concepts that arose together, in conjunction with\nliberalism and socialism. One could argue that there is a conceptual\nholism between them, in that they cannot be understood independently\nof each other, and must be inter-defined (Hamilton 2013 ch 1.2). In\nits modern concept, political revolution is a rejection of the past;\nbefore the 18th century, according to most historians,\n“revolution” had only its literal sense of “return\nto an original state”. (Cressy (2006) suggests that in the\nEnglish Civil War of the 1640s, a metaphorical use emerged, meaning\nsudden, dramatic change in politics or religion.) With the\nEnlightenment, the natural order or social hierarchy, previously\nlargely accepted, was questioned. (The earliest stirrings of this\nquestioning were found in the English Civil War and even the\nPeasant’s Revolt.) Implicit in Jacobinism is what may be termed\nrevolutionary utopianism, which allows the sacrifice of present\ngenerations for alleged future benefit. A classic statement of\nrevolutionary utopianism is found in these frank remarks by\nTrotsky:\n\n\nthe White Terror…is the weapon of classes which consider\nthemselves “Christian”, patronize idealist philosophy, and\nare firmly convinced that the individuality (their own) is an\nend-in-itself. As for us, we were never concerned with the\nKantian-priestly and vegetarian-Quaker prattle about the\n“sacredness of human life”. We were revolutionaries in\nopposition, and have remained revolutionaries in power. To make the\nindividual sacred we must destroy the social order which crucifies\nhim. And this problem can only be solved by blood and iron. (Trotsky\n1920, ch. 4)\n\n\nAccording to critics of utopianism such as Schiller, indeed, one\nshould not even sacrifice oneself for a utopian vision, as do members\nof revolutionary organisations, such as Nelson Mandela and Joe Slovo\nof the ANC. Schiller, and Goethe, also provided conservative critiques\nof French Revolutionary ideals and practices.\n\nConservatives reject revolutionary Jacobinism’s espousal of\npolitical rationalism, which attempts to reconstruct society from\nabstract principles or general blueprint, without reference to\ntradition. Conservatives view society not as a machine but as a highly\ncomplex organism, and hold therefore that “without the aid of\nexperience, reason cannot prescribe political ideals that can be\nrealised in practice” (Beiser 1992: 283). Present generations\npossess duties and responsibilities whose original reasons, if they\nwere ever apparent, are now lost. Tradition represents for\nconservatives a continuum enmeshing the individual and social, and is\nimmune to reasoned critique; the radical intellectual is therefore\narrogant and dangerous (Kekes 1997: 365). For liberals and socialists,\nin contrast, tradition has value only insofar as it survives rational\ncriticism.\n\nConservatism therefore rests on what may be termed particularist\nscepticism concerning abstract rational principles. Conservatives\nregard the radical’s rationalism as “metaphysical”\nin ignoring particular social, economic and historical conditions:\n\n\nI cannot [praise or blame] human actions…on a simple view of\nthe object, as it stands stripped of every relation, in all the\nnakedness and solitude of metaphysical abstraction; (Burke, WS III:\n58)\n\ncircumstances give every political principle its colour. (Cobban 1960:\n75)\n\n\nFor conservatives, abstract propositions cannot simply be applied to\nspecific circumstances. Unlike liberals and socialists, therefore,\nconservatives are particularist in rejecting universal prescriptions\nand panaceas; they reject the Enlightenment-modernist requirement that\npractical rationality is liberated from all particularism (Beveridge\nand Turnbull 1997). This is not “particularism” in its\ndictionary definition of “exclusive adherence to one’s own\ngroup, party, sect, or nation”; rather, it is a philosophical\nsense that has an affinity with moral particularism as advocated by\nDancy (2004). The parallel is incomplete, however; political\nconservatives do not deny that there are general principles, as Dancy\ndoes, they just deny that one should apply them. Their position is an\nessentially epistemic one—that one cannot know the general\nprinciples whose implementation would benefit the operation of\nsociety. According to Gray, conservatism’s fundamental insight\nis that\n\n\npersons’ identities cannot be matters of choice, but are\nconferred on them by their unchosen histories, so that what is most\nessential about them is…what is most accidental. The\nconservative vision is that people will come to value the privileges\nof choice…when they see how much in their lives must always\nremain unchosen. (2010: 159)\n\n\nConservative scepticism is quite distinct from Cartesian or external\nworld scepticism, therefore, since the latter scepticism is based on\nreason; rather, it is sceptical about the claims of theoretical\nreason, in politics and ethics. Nor does its scepticism constitute a\ncritique of society in the Marxist sense. For conservatives, society\nrests on prejudice, not reason; prejudice is not irrational, but\nsimply unreasoning. Burke advocated educated prejudice as an antidote\nto its bigoted forms—arguably, not a rejection of reason, but a\nscepticism about its inordinate pretensions. Philosophers might\nspeculate about why we have the duties that we do, but prejudice makes\nus act, without having to calculate all the consequences—or\nindeed to reason about ends. This is not the irrationalism of\nNietzsche or Freud, for whom much of human behaviour is irrationally\ndriven, but rather, a non-rationalist standpoint. It is sceptical\nabout proposals of reform based on a priori commitment to a\nvalue such as freedom or equality. (See\n 2.3 on Burke\n below) In elucidating conservatism, one should distinguish between\nthe metaethical claim that abstract values do not exist or are not\nworth pursuing, and the epistemic challenge “how are these\nvalues be accessed in practice?” Conservatism is primarily an\nepistemic standpoint. Conservatives believe that values of justice,\nfreedom, and truth are important and should be pursued by the state,\nbut they interpret those values in a concrete fashion.\n1.3 Tradition and gradual reform: conservatism vs. reaction\n\nAs we have seen, it is generally recognised that conservatism is not\ndogmatic reaction. It advocates piecemeal, moderate reform, which\nfollows from its scepticism concerning reason, and its valuing of\nexperience concerning human affairs. Burke argued that “a state\nwithout the means of some change is without the means of its\nconservation”. But change must be cautious, because knowledge is\nimperfect and consequences can be unintended. According to\nconservatives, institutions and morals evolve, their weaknesses become\napparent and obvious political abuses are corrected; but ancient\ninstitutions embody a tacit wisdom that deserves respect.\nConservatives are sceptical of large-scale constitutional, economic or\ncultural planning, because behaviour and institutions have evolved\nthrough the wisdom of generations, which cannot easily be\narticulated.\n\nCentral to conservatism is the notion of tradition, whose\nself-conscious, contrastive use arises only in modernity. In the later\n18th century, the mobilisation of “the past” as\nan explicit political resource became especially important, and a\ncontrast between “traditional” and\n“modern”—as opposed to “ancient” and\n“modern”—was stressed. Burke’s political\nphilosophy was an early instance of this process. This mobilisation\nhas been associated with “the invention of tradition”\n(Hobsbawm and Ranger 1983), in which mass-produced\n“traditional” artefacts established a fictional organic\nrelation between past and present, as in Sir Walter Scott’s\nre-invention of the kilt and other “traditional” artefacts\nfor King George IV’s visit to Edinburgh in 1822.\n\nFor conservatives, vital political relations are organic. Unlike\nreactionary thinkers, they regard traditions not as static, but as in\na gentle and gradual flux, encouraged by the astute reformer. For\nBurke, the English revolutionaries of 1688 achieved restoration as\nopposed to “innovation”. Reform corrects the inadequacies\nof ancient institutions in light of contemporary\nneeds—conservatives such as Disraeli might want to create a\nbroader suffrage, for instance—but one must disdain “the\nblind and furious spirit of innovation”. Reform must be\npractically and not theoretically-based:\n\n\nI must see with my own eyes…touch with my own hands not only\nthe fixed but the momentary circumstances, before I could venture to\nsuggest any political project whatsoever…I must see the means\nof correcting the plan…I must see the things; I must see the\nmen. (Burke, WS III: 326)\n\n\nFor Kekes, conservatism adopts a stance of scepticism between extremes\nof rationalism and fideism (belief based on faith), and steers a\nmiddle course of pessimism between claims of perfectibility and\ncorruptibility (1998: 54, 89, 60). Conservatives aim to\n\n\nconserve the political arrangements that have historically shown\nthemselves to be conducive to good lives thus understood (1998:\n27);\n\n\nthey regard\n\n\nhistory [as] the best guide to understanding the present and planning\nfor the future. (Kekes 1997: 352)\n\n\nConservatism’s “organic” social vision is inherently\nsceptical of the state, and puts faith instead in the family, private\nproperty and religion; it does not involve the rich organicism of the\nBritish Idealists Bradley and Bosanquet, that yields “a mystical\nunion with the superior unity of the state”—a German\nphilosophical rather than British conservative conception (Sweet\n1999). As Cobban writes, Locke’s influence ensured that the\n“historic idea in Burke’s mind [did not] pass into the\nfull organic theory of society” (Cobban 1960: 89). It is\nreaction and not conservatism that is inherently authoritarian. For\nconservatives, individuals and local communities are better assessors\nof their own needs and problems than distant bureaucrats. Free from\nutopian planning, conservatives hold, society finds its own, largely\nbeneficial, shape.\n\nConservatism proceeds via the tried and tested, relying not on pure\nreason, but on what Burke called the “latent wisdom” of\nprejudice, instinct and custom, which accumulates across generations.\nFor Kirk, “prejudice is not bigotry or superstition”,\nthough it may degenerate into these; it is\n\n\npre-judgment, the answer…which intuition and ancestral\nconsensus of opinion supply…when [one] lacks either time or\nknowledge to arrive at a decision predicated upon pure reason. (1954:\n34)\n\n\nFor conservatives, custom is immemorial but not thereby static; it is\n“constantly being subjected to the test of experience”\n(Pocock 1989: 213). But to change the state in response to\n“floating fancies or fashions” is to break the\n“whole chain and continuity of the commonwealth” (Burke,\nWS III: 145). \n1.4 Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism\n\nConservatism has been equated with pragmatism or political realism;\nGamble (2012) argues that conservative political “thought”\nis all practice—self-interested practice. But conservatism is\ngenerally regarded as a philosophy, if not a systematic one. Two\ncontrasting interpretations of conservatism distinguish it from mere\npragmatism. Both reject a priori reasoning, revolution and\nsocial experiments; both trust experience, look for gradual\nimprovement of tried and tested arrangements, and sympathise with the\npragmatist’s motto “if it ain’t broke, don’t\nfix it”; both are sceptical of reason, and are\nparticularist:\n\n(1) relativistic conservatism suggests that if socialism, feudalism or\nfascism works well in some country, one should try to make it run\nbetter through minor improvements based on experience and accumulated\nwisdom. The judgement of whether something is broken or runs\nreasonably well appeals to values accepted in the relevant society.\nThus conservatives in reasonably functioning socialist, feudal and\nfascist countries advocate different modes of social organisation and\ngradual improvement, according to prevailing values. On this view,\nconservative particularism is relativistic.\n\n(2) non-relativistic conservatism rejects views such as socialism,\nlibertarianism and fascism that aim to structure society around a\nsingle rationally-articulated organising principle. On this\ninterpretation of conservatism, particularism does not imply\nrelativism. Revolutionary systems, and autocratic systems with no\npossibility of incremental change—societies that do not exhibit\nliving traditions—are not amenable to a conservative outlook. On\nthis view, conservatism is situational, but some situations do not\npermit conservative responses.\n\nThe sarcastic dismissal of Burke by a liberal defender of the\nRevolution, J.S. Mill’s father James, is effective only against\nposition (1), relativistic conservatism:\n\n\nIn the case of public institutions, Mr. Burke had…worked\nhimself into an artificial admiration of the bare fact of existence;\nespecially ancient existence. Everything was to be protected, not\nbecause it was good, but, because it existed. Evil, to render itself\nan object of reverence in his eye, required only to be realised.\n(James Mill 1858: Vol. V, 200–1)\n\n\nYet only position (2), non-relativistic conservatism, can express the\nconservative criterion of a well-functioning society, in terms of\norganic tradition; there is no such thing, in these terms, as a\n“reasonably functioning totalitarian society”. This\nnon-relativist position is minimally rational and universal, while\nremaining particularist. (This terminology is elucidated further at\n 2.3).\n (Lock (2006) regards (1) and (2) as an unBurkean choice between\nconstructed opposites, arguing that Burke is not strongly relativist,\nbut recognises temporal and geographical differences that amount to a\nkind of relativism.)\n\nConservatives seek to “preserve the political\narrangements…shown to be conducive to good lives”, writes\nKekes (1997: 351–2). Perhaps he overlooks the contestability of\nconceptions of the good life, and of arrangements that preserve it;\nliberals, for instance, stress the value of individual freedom,\nindependent of what they may see as burdensome constraints of\ntradition. According to (2), there is a conservative conception of the\ngood life, and of the arrangements that preserve it—one that\nrejects the over-valuation of Enlightenment rationalism and\nrevolution. But as we will see, conservatives must steer a course\nbetween an unconservative pragmatism, and an unconservative\nsubstantive policy. (The issue recurs throughout this entry,\nespecially in sections\n 2.3\n and\n 3.1.)\n\nFor Graham, conservative scepticism is\n\n\nnot so much a scepticism about the moral perfection of mankind, as a\nscepticism about the knowledge necessary in politics. (1986: 176)\n\n\nBut these are hard to separate. Liberals and socialists stress the\nmalleability of human nature under the influence of changeable\nhistorical conditions. The anti-conservative Rousseau had an\noptimistic conception of human nature, blaming government and society\nfor failings that—according to conservatives—belong to\nindividuals. Conservatives, in contrast, regard human nature as weak\nand fallible, unalterably selfish rather than altruistic (Kekes 1997:\n368). Scruton is typically conservative in regarding human beings as\nfrail creatures of limited sympathy, which they do not easily extend\nto those remote in space or time (Scruton 2012). (Rawls’s\n“limited altruism” in the “circumstances of\njustice” seems derived from Hume, and so might be characterised\nas a conservative feature of Rawls’ thought.) Conservatism is\nimperfectionist, anti-utopian and pragmatic, “unable to appeal\nto any future that is not already present and past” (Scruton\n1980: 27). \n\nConservatism is popularly conflated with neo-conservatism and with\nlibertarianism. But right libertarians and neo-conservatives, unlike\nBurkean conservatives, reject state planning for doctrinaire reasons.\nMaking anti-planning into a principle, or economic liberalism into an\nideology, offends the conservative’s pragmatic, sceptical\ntemper, which could admit a role for state planning and economic\nintervention were such things shown to be effective. Conservatives\nreject ideologies, of which neo-liberalism is one. As Oakeshott\nargues\n\n\nA plan to resist all planning may be better than its opposite, but it\nbelongs to the same style of politics. And only in a society already\ndeeply infected with Rationalism will the conversion of the\ntraditional resources of resistance to the tyranny of Rationalism into\na self-conscious ideology be considered a strengthening of those\nresources. It seems that now, in order to participate in politics [one\nmust have] a doctrine…. (Oakeshott 1991 [1962]: 212)\n\n\nThe conservative’s rejection of rationalism therefore cuts two\nways; it undermines both socialism, and the doctrinaire, free-market\nrejection of socialism. Conservatives oppose rational planning, but do\nnot dogmatically oppose planning that works. Scruton, for instance,\nbelieves that a market economy is most conducive to prosperity, but\nlike Adam Smith, insists that markets should work within, and not\nerode, customs and moral and legal traditions. Burke’s and\nScruton’s conservatism is not an economic view, but one that\nregards society as formed over a long period in relation with place\nand land; it treats rights and duties on the model of the common law,\ndepending on tradition and practice, rather than on abstract notions\nof human rights (see entry on\n rights).\n\nConservatism differs from neo-conservatism and libertarianism in\nmotivation or formal features, therefore. In both the modern U.S.\nRepublican Party (GOP) and British Conservative Party, Burkean\nconservatism has been submerged. The GOP’s anti-governmentalism\nis closer to libertarian traditions; its patriotic and deeply\nreligious standpoints—and what critics regard as its militarism\nand opposition to immigration—coincide only partially with\nBurkean conservatism. (It has been argued (Harvey 2005; Ha Joon Chang\n2003) that neo-conservatives do not reduce state intervention, but\nsimply shift its priorities, while maintaining its massive scale.)\n\nDespite some claims to the contrary, therefore, Nozick’s\nAnarchy State and Utopia is not a conservative rival to\nRawls’ liberal theory (Nozick 1977). Nozick and conservatism\nseem to share a commitment to the invisible hand of the free market,\nand rejection of an extensive state. But Nozick is more plausibly\nregarded as a right libertarian, an extreme classical or neo-liberal.\nIt is wrong to say that he is “rare among conservatives”\nin presenting it with a “general principle or rationale”,\nviz. “from each as they choose, to each as they are\nchosen”, in contrast to the socialist or communist “from\neach according to his ability, to each according to their need”\n(Honderich 2005: 60; see Nozick 1977: 160). Conservatives avoid such\nprinciples. Rejecting Nozick as a model, Scruton stresses that\n“political understanding, as a form of practical judgement, does\nnot readily translate itself into universal principles” (Scruton\n1980: 36).\n\nLibertarianism influences neo-conservatism, but—as an extreme\nform of liberalism—is at best neutral towards\nconservatism’s emphasis on tradition. Perhaps neo-liberalism is\nlibertarianism plus related economic doctrines, while neo-conservatism\nis libertarianism plus elements of traditional conservatism.\nNeo-liberals like Milton Friedman question drug-prohibition and\nconscription, which conservatives and neo-conservatives would not.\n\nConservatism’s popular association with laissez-faire\ncapitalism is also debatable, since it has been associated with feudal\nromanticism. Feudalism is a (contested) label for the economic system\nprevalent in Europe from after the decline of the Roman Empire until\nthe 16th century, and which rested on the holding of land\nin return for labour; in France, it persisted as the ancien\nregime up till the French Revolution. A sympathiser with the\nancien regime such as Burke could therefore be regarded as a\nfeudal romantic. (On feudalism, see Dyer 2002, and Pocock 1987.) Like\nsocialists such as William Morris and Ruskin, many 19th\ncentury conservatives reacted against industrialism and\nlaissez-faire capitalism with a feudal nostalgia. Marx\ncontrasted the warmth and security of feudalism with the inhumanity of\ncapitalism, but rejected “feudal idyllics”, dismissing\nDisraeli and “feudal socialists” for failing to comprehend\n“the march of modern history” (Duncan 1973:\n19–22).\n\nConservatism may seem to share the laissez-faire doctrine,\nimputed to Adam Smith, of the invisible hand—according to which,\nin a free market, unintended consequences of actions tend to promote\nthe general good. The capitalist free market is held to be\nself-regulating; producers and consumers, acting selfishly, benefit\neach other, and rational economic planning disrupts the innate, benign\n“intelligence” of markets. The evolutionary nature and\nanti-statism of laissez-faire theory appeal to conservatives,\nbut to reiterate, they would not offer doctrinaire reasons for\nrejecting planning. In fact, the “invisible hand” was\nunimportant and indeed alien to Smith (Rothschild 2001: 116–56).\nThe allegedly neo-conservative Hayek, with his esteem for “the\nunconscious, the blind, the untheoretical, the imperfectly\nunderstood”, is more Burkean here (Rothschild 2001: 149; see\nalso Scruton 2007); according to Gray, he synthesises “the\ndeepest insights of conservatism with the best elements of classical\nliberalism” (2010: 124). Hayek valued local, transient,\nuntheoretical knowledge, and advocated unfettered markets on the\nconservative sceptical grounds that they best realise organic social\ninstitutions. \n\nSubstantive definitions of conservatism such as Aughey’s should\nbe questioned, therefore. For him it is\n\n\nthe intellectual justification of inequality and privilege, and the\npolitical justification of the authoritative relationships such\ninequalities and privileges demand. (Aughey 1992: 23; also Honderich\n2005: 45)\n\n\nIt is true that no revolution has proclaimed inequality, while for\nBurke, the social order is rooted in it; and conservatives may defend\nan established ruling class, regarding ruling as a skill likely to be\nmost highly developed there. But in Quinton’s influential\naccount, conservatism is more neutral:\n\n\npolitical wisdom…is not to be found in the theoretical\nspeculations of isolated thinkers but in the historically accumulated\nsocial experience of the [whole] community…[in] traditional\ncustoms and institutions [and people with] extensive practical\nexperience of politics. (1978: 16–17)\n\n\nTo reiterate, conservatism is not essentially associated with\naristocracy and hereditary forms of government, or opposed to\ndemocracy. For conservatives, as for Millian liberals, the viability\nof democracy depends on the period and conditions. For Burke, writing\nmuch earlier than Mill, a majority should be drawn only from a body\nqualified by tradition, station, education, property and moral nature;\nhe questioned the “principle that a majority of men told\n[i.e., counted] by the head are to be considered as the\npeople, and that as such their will is to be a law” (Burke 1791,\n‘Thoughts on French Affairs’ [1991]: 344).\n\nWhile conservatism should not be assimilated with neo-conservatism or\nneo-liberalism, many conservatives have converted to the latter:\n\n\nA political outlook that in Burke, Disraeli and Salisbury was\nsceptical of the project of the Enlightenment and suspicious of the\npromise of progress has mortgaged its future on a wager on indefinite\neconomic growth and unfettered market forces. [This] scarcely exhibits\nthe political prudence…once revered as a conservative virtue.\n(Gray 1997: 88)\n\n\nScruton also laments this development, while John Harris comments on\nthe enduring tensions that Margaret Thatcher exposed in\nConservatism:\n\n\nIf you profess to believe in both the unrestrained market and such old\nTory touchstones as family, nation and community, you\nwill…discover that the former eats away at the foundations of\nthe latter (Harris, 2013; Harvey (2005) offers a trenchant critique of\nneo-liberalism and neo-conservatism.) \n\n1.5 Conservatism and liberalism: the standpoint of freedom vs. standpoint of paternalism\n\nConservatism can be further elucidated by contrasting it with\nliberalism. Both liberalism and socialism are more theoretically\ncomplex than conservatism, for two reasons: conservatism\nself-consciously rejects philosophical theorising; and, since\nacademics tend towards the left, conservatism as a political\nphilosophy continues to be neglected. (For instance, Scruton describes\nhis book The Meaning of Conservatism (1980) as\n“dogmatics” rather than philosophy.) There could be no\nconservative theory of distributive justice to rival Rawls’,\nsince, for conservatives, the problems that Rawls addresses do not\nexist. For them, politics does not concern the theoretically complex\njustification of ends, but rather facilitates the enjoyment of\n“non-political” ends such as “country”,\n“family” and “religion” (Ashford 1990:\n40–1).\n\nIt is often argued that modern political philosophy is animated by the\nidea of freedom, while ancient political philosophy rests on a natural\norder discernible by reason to which humans must conform (Franco 1999:\n2). But conservatism is a modern standpoint whose commitment to\nfreedom is contested; it can be argued that the liberal standpoint of\nfreedom is opposed by the conservative standpoint of paternalism or\nauthority. The dividing line between ancient and modern may be\nRousseau, for whom the purpose of the state is not merely security of\nlife and property, as Hobbes, Locke and conservatives maintain;\nrather, it is freedom itself (Franco 1999: 9). Rousseau’s works\nwere held to influence the French revolutionaries, and late 18th and\nearly 19th century thinkers were convinced that the Revolution was\ncaused by philosophers’ ideas of equality, democracy, freedom\n(Israel, 2002). (In fact, Rousseau regarded the revolutionary cure as\nworse than the disease, and was pessimistic about political progress.)\nIn expressing the standpoint of freedom, philosophical liberalism\nembraces ethical individualism—that all value and right reduces\nto value of or for individuals, and the rights of\nindividuals—respect for persons, and freedom of thought and\ndiscussion, based on individual autonomy (Skorupski 2015). For\nclassical liberals, liberty thrives only when traditional sources of\nauthority—monarchical, aristocratic, religious—are\nrejected. \n\nIt is often said that liberals prioritise rights over duties, while\nconservatives prioritise duties over rights. Conservative thinking\nexpresses the standpoint of paternalism:\n\n\n…the value of individual liberty is not absolute, but stands\nsubject to…the authority of established government…the\nconservative will seek to uphold all those practices and institutions\nthrough which habits of allegiance are acquired. (Scruton 1980: 19,\n30)\n\n\nObedience, for Scruton, is the principal virtue of political subjects,\nwithout which societies atomise and crumble; real freedom is not in\nconflict with obedience, but is its other side (Scruton, 1980). For\nOakeshott, there is no freedom without authority. For Beiser,\npaternalism holds that\n\n\nthe purpose of the state is to promote the welfare, religion and\nmorality of its subjects, and not only to protect their rights.\n(Beiser 1992: 282)\n\n\nBurke was “less concerned with protecting the individual from\nthe potential tyranny of the State, and more to protect the property\nof the few from the folly and rapacity of the many” (Lock 2006:\n321–2). \n\nThe contrast with liberalism and its standpoint of freedom should be\nqualified, however – the contrast is not an absolute one, but a\nmatter of balance and tone. For instance, the visceral opposition of\nWestern conservatives to the Soviet Union was motivated by a\ncommitment to freedom. Burke himself wanted to enhance freedom, but\nheld that it is realised imperfectly in our institutions; pursuit of\nan abstract ideal may lose us what freedom we have. Both conservatives\nand classical liberals advocate limited government; it is\nparticularist scepticism and an associated pessimism that define\nconservatism. Liberals concurred with Burke’s limits on\ngovernment, concern for private property, and judicious reform (Kirk\n1954: 162). However, although Burke agreed that government originates\nfrom the need to protect property, he disavowed many of Locke’s\nprinciples (Kirk 1954: 14). \n\nConservatives reject the liberal’s concept of abstract,\nahistorical and universal rights, derived from the nature of human\nagency and autonomy, and possessed even when unrecognised, for\ninstance by slaves in Ancient Greece (on abstract rights, see for\ninstance Gewirth 1983). For conservatives, a priori claims\nsuch as L.T. Hobhouse’s “The proper end of government is\nthe uncovering of civil liberties”, are doubly mistaken\n(Hobhouse 1964 [1911]: 19); government does not have such ends, and\n“uncovering civil liberties” is particularly disruptive.\nHowever, while Hobhouse, Rawls and Dworkin defend abstract and\nuniversal rights, liberals such as Mill are more\nhistorically-sensitive—through the influence of Coleridge, he\ndrew on aspects of conservative thought. Mill’s abstract utility\nprinciple becomes conservative in operation, through his emphasis on\nthe malleability and educability of character; our preferences,\ndesires, and tastes arise from existing institutions, and so any\nabstract institutional blueprint fails to maximise utility. For Mill,\na nation’s history and society decide the best apparatus of\ngovernment, and he locates Coleridgean “Ideas” in\n“organic” historical institutions—their original\npurpose and meaning. However, Mill’s perfectionism contrasts\nwith conservative pessimism about human nature, and he rejected what\nhe called “intuitionism”, which fosters conservatism by\nassuring people that anything they believe deeply enough must be true;\nrather, he holds that inveterate beliefs must be justified by reason\n(Mill, Autobiography, CW, I: 233; Skorupski 2010: 24). Despite\nthe influence of Coleridge, therefore, Mill remained a liberal and not\na conservative, who valued reason above Burkean prejudice.\n\nConservatives are not legal positivists, and allow some idealisation\nof rights; indeed, even legal positivists Bentham, Austen and Hart, in\nconceding that there are moral constraints, allow that there are bad\nlaws. Burke held that the Stuart monarchs abrogated the rights of\nfree-born Englishmen; under the Stuarts, therefore, the latter had\nrights that were not simply those that prevailed. Indeed, Burke does\nnot entirely reject the concept of natural rights. Though sceptical of\nappealing to rights that are beyond positive law, in his writings on\nIndia, he acknowledged that when deprived of positive legal resources,\none can appeal to natural law though not natural right (Bourke 2014;\nthough see Stanlis 1953, and Canavan 1960). \n\nThis section has focused mainly on Burkean conservatism, treated as\nscepticism about the role of reason in politics. The next section\nanalyses the historical development of Burkean conservatism,\ncontrasting it with more rationalist traditions of conservatism, and\nalso looking at North American traditions, and modern conservatism.\n\n2. The Development of Conservative Thought\n2.1 Use of the term “conservative”\n\nBurke’s French disciples first coined the word\n“conservative” (French, “conservateur”); Burke\nhimself used “conserve”. To reiterate\n 1.2\n above, conservatism and revolutionary Jacobinism are inter-dependent\nconcepts that arose together; the concept predates its label. The\nEnglish Revolution of the 17th century adumbrates the polarity, in the\nconflict between Cavaliers and Roundheads. The Cavaliers were,\ncrudely, the precursors of the Tories who later became known as\nConservatives. The term “Tory” dates from the Exclusion\nCrisis 1679-81, during the reign of Charles II. The parliamentary\nfaction that wanted to exclude Charles’ Catholic brother James from\nthe succession were known as Whigs, and those who supported his right\nto the throne were Tories. “Tory” is derived from the\nIrish Gaelic word tóraidhe, meaning a dispossessed Irish outlaw.\n“Tory” was also used during the American War of\nIndependence, referring to colonists loyal to the British monarchy; in\nCanada, the term is still use to describe centre-right\nConservatives.\n\nIn 1830 the Quarterly Review commented that “what is\ncalled the Tory might with more propriety be called the Conservative\nparty”, and Canning and Peel adopted the label. (The Oxford\nEnglish Dictionary entry suggests that “Conservative”\noriginally designated an opponent of reactionary “Tory”\nviews.) “Liberal” began to be used for the Whigs, and by\n1840 Thomas Carlyle used “conservatism” to describe what\nhe regarded as opposition to progress. (“Tory” survives,\nas a label for the British party; “Whig” does not.)\nMill’s “Essay on Bentham” (1838) described Bentham\nas a “Progressive”, and Coleridge as a\n“Conservative”. Other European languages borrowed\n“conservative” and “conservatism” from\nEnglish. Mostly it is the British, and their former Empire, that have\nparties labelled Conservative; countries with a strong republican\ntradition (France, U.S.A., Argentina) have never had mass-based,\nself-styled “conservative” parties. European parties of\nthe right are Christian Democrat, and in the U.S.A., Republican. However,\none should not conclude that conservatism is essentially a British\nview; all cultures have political sceptics who value experience. \n2.2 Precursors of Burkean conservatism\n\nDavid Hume (1711–76) is sometimes regarded as a precursor of\nBurke’s conservatism. For Neiman,\n\n\nBurke used [Hume’s] claims about the impotence of reason and the\nmind’s subsequent dependence on custom and habit to argue\nagainst radical attempts to change the established order. (Neiman\n2001: 294)\n\n\nCobban contrasts Burke’s residual contractualism with\nHume’s\n\n\ntheory of the origins of society and government which placed political\nconservatism on a much sounder and more realistic basis. (1960:\n51)\n\n\nOthers claim Hume as a proto-liberal. John Stewart rejects the picture\nof Hume clinging to a raft of custom and artifice, because as a\nsceptic, he has no alternative: “[He] was confident that by\nexperience and reflection philosophers can achieve true\nprinciples”, and did not deny that reason determines right and\nwrong in morals and politics (Stewart 2014: 8).\n2.3 Burkean conservatism\n\nLiberalism was defined by J.S. Mill, who as Skorupski comments\n“[drove] so many windows onto its innermost commitments”,\ninterrogating its values and policies (Skorupski 1989: 338); socialism\nwas defined by Marx. For most conservatives, Burke largely defines\nmodern conservatism—even if his “windows”, unlike\nMill’s, seem more like panes of frosted glass. We now examine\nhis ideas and how they arose. \n\nIn his Reflections on the Revolution in France, the Irish\nWhig and parliamentarian Edmund Burke (1729–1797) warned against\nrevolutions and their utopian schemes for human perfectibility.\nWriting in 1790, he predicted the French Revolutionary Terror of three\nyears later:\n\n\nIn the groves of [the] academy [of this new conquering empire of light\nand reason], at the end of every vista, you see nothing but the\ngallows; (Burke, WS III: 128)\n\n\nhe also foresaw Napoleon’s coup. His prediction is based on his\nview that when compliance no longer flows from customary allegiances,\nthe result is naked force (WS VIII: 128). As Steiner comments,\n\n\nWhen Burke reflected and published, the French Revolution was in its\nArcadian phase [and] his bloodstained previsions seemed nearly\nhysterical…Retroactively… his sombre clairvoyance took\non formidable weight. (Steiner 1988: 3; see Lock 2006: Vol. 2)\n\n\nHe provided “the first serious argument that revolutions devour\ntheir own children and turn into their own opposites” (Hitchens\n2011: 161)—that the violent seizure of power invites its violent\ncounter-seizure. Its British friends compared the French Revolution\nwith the Glorious Revolution of 1688; for Burke, it reprised 1649,\nwhen Parliament was purged and the king executed. The 1688 Revolution\ndid not affirm, like the French Revolution, that power can revert to\nthe people, who have a right to “erect a new form…as they\nthink good” (to quote Locke’s Second Treatise) (Pocock\n1989: 207).\n\nBurke argued that revolutionaries impose theory on political practice,\nwhen they should rather derive theory from it. In a speech of 1782, he\nheld it preposterous\n\n\nto take the theories which learned and speculative men have made from\nthat government, and then, supposing it made on those theories which\nwere made from it, to accuse that government as not corresponding with\nthem. (1782 House of Commons motion, in SW IV: 148)\n\n\nHe thus\n\n\nregarded as folly the Enlightenment programme of willed, abstractly\nunderwritten social reform, which violated the organic mystery of\nhistoricism, the [Aristotelian]… unfolding\nof…institutional modes of social being. (Steiner 1988: 3)\n\n\nHe opposed radical rationalist philosophes, Rousseau’s Romantic\nsentimentalism, and Bentham’s utilitarianism, lamenting that\n“the age of chivalry is gone. That of the sophists, economists\nand calculators has succeeded” (Burke, WS III: 127). He held\nagainst these calculators and rationalists that “no great human\ninstitution results from deliberation”, but rather, evolves in\nways not envisaged by its founders; “human works are fragile in\nproportion to…the degree to which science and reasoning”\nhave helped construct them (Kirk 1954: 24; Burke, WS III: 128). As\nPocock writes,\n\n\nthe reason of the living, though it might clearly enough discern the\ndisadvantages, might not fully perceive the advantages of existing and\nancient institutions; \n\n\nthere is always\n\n\nmore in laws and institutions than [meets] the eye of critical reason.\n(Pocock 1989: 203)\n\n\nBurke required close and constant attention to circumstance, for\nsociety is “a dense medium”, never easy to penetrate.\n(1987 [1790]: 54) \n\nIsaiah Berlin and Stuart Hampshire link Burke with reactionaries such\nas de Maistre. But to reiterate, Burke advocated organic and\nrestorative reform, not reaction:\n\n\na nation without the means of its own reform is without the means of\nits own preservation. (Burke, WS III: 327; Lock 2006: 305)\n\n\nThe Reflections argue that the ancien regime could\nhave been restored to its pre-corrupt state; summoning the Estates\nGeneral for May 1789 was an opportunity for enlightened reform of the\nmonarchy, hijacked by enthusiastic atheists and deists (WS VIII:\n175–6). Burke advocated “slow politics”, an inching\nforward on the secure foundation of inherited settlements and\nloyalties (Mount 2014).\n\nBurke had a Whig belief in limited government. He identified liberties\nand rights with landed property, hence King George III’s praise\nof Reflections for supporting “the cause of the\nGentleman”. Burke differs from liberal tradition not in\nrejecting rights as such, but in his conception of them (Lock 2006:\n313–26). He rejected a constitution or bill of rights that does\nnot simply express existing practice. For him, the only reliable\nliberty comes through descent, justified\n\n\n…not on abstract principles “as the rights of men”,\nbut as the rights of Englishmen, and as a patrimony derived from their\nforefathers… The idea of inheritance furnishes a sure principle\nof conservation, and…of transmission; without at all excluding\na principle of improvement. By a constitutional policy, working after\nthe pattern of nature, we receive, we hold, we transmit our government\nand our privileges, [just as] we enjoy and transmit our property and\nour lives. (Burke, WS III: 83) \n\n\nBurke mistrusted appeals beyond positive law, but his writings on\nIndia allow, in its absence, an appeal to natural law though not\nnatural right. The Hobbesian conception of Reflections treats\nnatural rights as pre-social, and incompatible with society. For\nBurke, liberty is precarious; to say that it is assured by\nprovidential order, and has an inevitable progress, is the kind of\nmetaphysical principle he abhorred (Himmelfarb 1987: 146–7).\n\nBurke misrepresents the social contract of Hobbes, Locke and Rousseau\nas a rather temporary expedient,\n\n\nnothing better than a partnership agreement in a trade of pepper and\ncoffee, calico, or tobacco, or some other such low concern, to be\ntaken up for a little temporary interest, and to be dissolved by the\nfancy of the parties. (Burke, WS III: 147)\n\n\nBut his position is genuinely distinct from theirs in crossing the\ngenerations:\n\n\n[The state] is a partnership in all science; a partnership in all art;\na partnership in every virtue…As [its] ends…cannot be\nobtained in many generations, it becomes a partnership…between\nthose who are living, those who are dead, and those who are to be\nborn. Each contract of each particular state is but a clause in the\ngreat primeval contract of eternal society, linking the lower with the\nhigher natures, connecting the visible and invisible world…\n(Burke, WS III: 147)\n\n\nThis is a powerful statement, but hard to interpret. It is reflected\nin Chesterton’s remarks that\n\n\nTradition means giving a vote to most obscure of all classes, our\nancestors. It is the democracy of the dead. Tradition refuses to\nsubmit to the small and arrogant oligarchy of those who merely happen\nto be walking about. All democrats object to men being disqualified by\nthe accident of birth; tradition objects to their being disqualified\nby the accident of death. Democracy tells us not to neglect a good\nman’s opinion, even if he is our groom; tradition asks us not to\nneglect a good man’s opinion, even if he is our father (Chesterton\n2012: 29; see also section 4 of this entry) \n\n\nHampsher-Monk comments that Burke\n\n\nsublimates the contract’s ideological power whilst draining it\nof radical potential: a contract involving the dead and unborn could\nhardly be renegotiated. [This rhetorical figure] expresses his deepest\nbeliefs about the status of political establishments. Our social\ninstitutions cannot (like ordinary contracts) be the product of any\nindividual’s calculation or insight (Hampsher-Monk 2012:\n202–3)\n\n\nFor Scruton (1980), liberals tend to make present members of society\ndominant over those who went before, and those who come after; some\nconservative commentators fear that the cross-generational contract is\nnow being broken by\n\n\nenormous inter-generational transfers [from future to present\ngenerations] implied by current fiscal policies. (Ferguson 2012)\n\n\nBurke was a Christian thinker whose conservatism has been traced to\nhis theological presuppositions (Harris 1993; Cobban 1960: 94); he saw\natheistic Jacobinism as a threat to Western cultural tradition. Many\nconservative writers share his religious interpretation of the\ncontract across the generations; for Kirk (1954: 7), established\nreligion is among the traditions that conservatives value. But\nreligious belief is not essential to conservatism, and Oakeshott was a\nsecular conservative (Cowling, 2004: xv).\n\nBurke’s writings appealed to Continental as well as\nAnglo-American audiences; both Tocqueville and Macaulay were\nfollowers. But they caused a stormy reaction from radicals. Thomas\nPaine, a friend with whom Burke quarrelled, defended a cosmopolitan\nconception of rights; liberty is each person’s natural right,\nwhich only the living possess, and Burke’s idea of descent was a\n“usurpation” and diminution of it:\n\n\n[No] generation [has] a property in the generations which are to\nfollow. The parliament or the people of 1688…had no more right\nto dispose of the people of the present day…. (Paine 1791:\n92)\n\n\nPaine wanted the American Revolution to abolish slavery, and to\nrestrain the French Revolution from violent fanaticism; Burke,\nsympathising with Marie Antoinette, “pities the plumage and\nforgets the dying bird”—the people (Paine 1791: 102). Mary\nWollstonecraft, in her pamphlet A Vindication of the Rights of\nMen (1790), said that\n\n\nhad you been a Frenchman, you would have been, in spite of your\nrespect for rank and antiquity, a violent revolutionist. Your\nimagination would have taken fire. (Wollstonecraft 1790: 44)\n\n\nIn his later career, liberals believed, Burke showed himself a\nprisoner of the feudal and landed conception of society.\n\nBurke’s apparent change of affiliation from Whig to Tory is\nmuch-debated. For most of his career, he was regarded as a moderate\nreforming Whig, campaigning against the corruption and brutality of\nthe East India Company. Only at the end did he become the Tory scourge\nof Revolution. Indeed, Reflections is liberal compared to\nLetters on a Regicide Peace five years later, which demanded\na war abroad and repression at home to extirpate revolutionary\ninfection. The 19th century regarded him as a liberal,\ntreating his later writings as an aberration—an interpretation\nreversed in the 20th century. Marx scathingly dismissed\nBurke as an opportunist:\n\n\nThe sycophant—who in the pay of the English oligarchy played the\nromantic…against the French Revolution just as, in the pay of\nthe North American colonies…he had played the liberal against\nthe English oligarchy—was an out-and-out vulgar bourgeois.\n“The laws of commerce are the laws of Nature, and therefore the\nlaws of God.” (E. Burke, l.c.: 31, 32)…true to the laws\nof God and Nature, he always sold himself in the best market (Das\nKapital, Vol. 1, Ch. 31)\n\n\nColeridge, slightly more charitably, wrote:\n\n\nIf his Opponents are Theorists, then every thing is to be founded on\nPRUDENCE, on mere calculation of EXPEDIENCY… Are his Opponents\nCalculators? Then…God has given us FEELINGS, and we are to obey\nthem! (Coleridge CW, The Friend, II (first published 1809):\n123–6)\n\n\nFor Locke, Burke’s statements are context-specific rhetorical\nacts, never intended to form a consistent system; the traditional view\nof Burke as a “liberal” who ended up as a\n“conservative” is simplistic, though his views did develop\nover time (see Lock 2006 Vol II: 306).\n\nOthers have variously attempted to reconcile the earlier and later\nBurke. Churchill argued that\n\n\nthe Burke of Liberty and the Burke of Authority [sought] the same\nideals of society and Government…defining them from assaults,\nnow from one extreme, now from the other. (Churchill 1932:\n40—like Burke, he changed party and so may have identified with\nhim)\n\n\nMacpherson argued that by Burke’s time, the traditional order\nwas a capitalist one, and so his conservatism was consistent with\nfree-market liberalism; Burke advocated the Whig principles underlying\nthe Glorious Revolution of 1688 and the American Revolution of 1776,\nbut not the French Revolution (Macpherson 1980; see Burke 1987 [1790]:\n15, on how his opponents are “constantly confounding” the\nrevolution of 1688, and those of 1649 and 1789). In contrast,\nO’Brien in The Great Melody—the title, a\nquotation from W.B. Yeats, is Burke’s consistent opposition to\nabuse of power in Ireland, America, India and France—argues that\nhis understanding of the American Revolution was not a radical,\nliberal one. He was always a Christian and monarchist, and his great\nspeech was entitled “On Conciliation with the Colonies”;\nuntil independence was inevitable, conciliation was his aim. Cobban,\nseeing Burke as “the greatest of the followers of Locke”,\ndenies that he changed his opinion fundamentally at the time of the\nFrench Revolution; rather, “an inconsistency runs right through\nhis thought” (Cobban 1960: 40). (Pocock 1994 outlines\nBurke’s conflicting commitments to English Whiggery and Irish\nCatholicism.)\n\nA fundamental question is how far the “prejudice” that\nBurke advocates is non-rational. Was he against reason, or just\nagainst abstract reason? Did he supplant individual with collective\nreason? For Cobban, Burke was “a philosopher of unreason in the\ngreat age of Reason” (Cobban 1960: 75). A subtler view is that\nfor him, individual reason cannot discern fully how social and\npolitical institutions work; it cannot see the entire process of\ncommunal adaptation, or understand by itself the principles on which\nit is based. As Hampsher-Monk puts it, institutions result from trial\nand error, embodying accumulated historical experience in\ninstitutional reason—like precedent within Common Law, which\nBurke had studied. (Pocock 1989: 211ff. discusses Burke’s debt\nto this tradition; he rejected legalism, and especially—since he\nwas a kind of relativist—the idea of the Common Law as timeless\nand immemorial.) Burke contrasted the wisdom of the law, with the\nlimited reflective reason of individuals—no one person can\nreproduce in thought the complex train of experiences and decisions\nthat led the law to be what it is—and he relies on the tradition\nof sceptical and conservative empiricism in English social thought,\nincluding Coke’s critique of the Stuart monarchs (Pocock 1989).\nThe British and American common law system is evolutionary, not\nabstract like Roman and Napoleonic coded law. Judgment according to\nprecedent, unlike a priori codified law, is better able to\nanticipate new circumstances.\n\n\nBurke [credited] educated prejudice as an antidote to its bigoted\nforms. This did not entail a renunciation of reason, but a suspicion\nof its inordinate pretensions. (Bourke, in Dwan and Insole 2012:\n29)\n\n\nScruton echoes Burke when he argues that beliefs that appear to be\nexamples of prejudice may be useful and important; the attempt to\njustify them will merely lead to their loss. One might show prejudice\nas irrational, but there will be a loss if it is discarded (Scruton\n1980).\n\nBurke is opposed not to reason, but to the arrogance of individual\nreason, therefore:\n\n\nWe are afraid to put men to live and trade each on his own private\nstock of reason…the stock in each man is small,\nand…individuals would do better to avail themselves of the\ngeneral bank and capital of nations and of ages…. Prejudice is\nof ready application in the emergency; it previously engages the mind\nin a steady course of wisdom and virtue and does not leave the man\nhesitating in the moment of decision sceptical, puzzled, and\nunresolved. (Burke, WS III: 138)\n\n\nRejecting the dominant individualist cognitive tradition in Western\nepistemology, Burke regards political reason as historically\naccumulated in developed social institutions—including an\nunwritten constitution, practices of representation, and dispositions\nnotably of compromise. According to Himmelfarb, there is for Burke\ngood reason—reason itself—to praise prejudice, which\nexists on a continuum with theoretical reason (Himmelfarb 2008b).\nHowever, Hampsher-Monk argues that\n\n\nBurke’s fear of the inadequacies of individual reason has only\nan obscure counterpart in his belief in collective wisdom. (1992: 304)\n\n\n\nDoes Burke follows Hume’s notion of custom, which may be\nregarded as irrationalist or even nihilist? For Burkean conservatives,\n“reason” operates only relative to or within a prior\n“non-rational stabilisation of belief” in habit or\nprejudice—a stabilisation necessary to avoid scepticism in the\ntraditional philosophical sense. For Hume and Burke this is a\ncustomary framework; for religious thinkers such as Cardinal Newman it\nis fideistic, appealing to the extra-rational authority of religious\ndoctrine. Prejudice is normative; the inability to subsume particular\nactions under a universal law does not imply radical relativism\n(Vannatta 2014). For the classical liberal, in contrast, reason\nprecisely does not operate within customary frameworks.\n2.4 “Rational” or Idealist conservatism\n\nBurkean conservatism influenced Continental European traditions, but\nthese also had a separate development. Indeed, as Clark argues, his\ncontinental admirers were normally ignorant of Burke’s background as a\nWhig constitutionalist, and saw him as merely the most eloquent critic\nof Jacobinism: “In Germany, constitutionalism became a liberal\nrather than a conservative ideology, standing for revolution rather\nthan for the anti-libertarian, holistic views of order and authority\nwith which German admirers wrongly associated Burke” (Clark,\n2001: 106).\n\nDe Tocqueville (1805–59) was probably the most Burkean among\n19th century Continental conservatives in his condemnation\nof the French Revolution:\n\n\nOur revolutionaries had the same fondness for broad generalisations,\ncut-and-dried legislative systems, and a pedantic symmetry; the same\ncontempt for hard facts; the same taste for reshaping institutions on\nnovel, ingenious, original lines…[for reconstructing] the\nentire system instead of trying to rectify its faulty parts. (1955\n[1856]: 147)\n\n\nTocqueville rejected Burke’s view that the French monarchy was\nreformable; for him, “monarchical absolutism had wiped clean the\nslate of French society and thereby provided the basis for the new\nabsolutism of the Revolution” (Clark, 2001: 78). His\nL’Ancien Régime et al Révolution was partly written to\nrefute Burke.\n\nIn Germany, Burke’s Reflections were translated three\ntimes before 1793, implying an influence on such conservatives as\nGentz, Rehberg and Brandes. (Though Beiser (1992) argues that they\narrived at their position independently.) August Wilhelm Rehberg\n(1757–1836) was a founder of German reformist conservatism,\nwhose penetrating critique of the French Revolution bears striking\nsimilarities to Burke’s (see the entry on\n August Rehberg,\n sections 3 and 4). The historians von Savigny (1779–1861) and\nvon Ranke (1795–1886) assumed a Burkean organic development of\nsocieties. German conservatives adopted positions from reformism to\nreaction, aiming to contain democratic forces—though not all of\nthem were opposed to the Aufklärung or Enlightenment. To\nreiterate, reaction is not Burkean conservatism, however. De Maistre\n(1753–1821) was a reactionary critic of reason, intellectuals\nand universal rights. Burke attacked the revolutionaries of 1789\n“for the sake of traditional liberties, [Maistre] for the sake\nof traditional authority” (Viereck 2009: 191). De Maistre\npraised Russian political culture as a spontaneous growth; in\ncontrast, that of Western Europe had been “scribbled over”\nby Enlightenment philosophers (see Gray 1998: 122).\n\nIn an alternative tradition to Burkean conservatism, Continental\nconservatives have subscribed to Thomist or Hegelian traditions,\nproducing a rational or systematic conservatism—which might\ninclude reactionary forms. Commentators differ on the extent to which\n“rational conservatism” challenges the centrality of\nBurkean conservatism to conservative tradition. John Gray argues\nthat\n\n\nConservatives have sometimes disdained theoretical reflection on\npolitical life, implying that political knowledge is…best left\ninarticulate, uncorrupted by rationalist systematising. The\n[19th and 20th] centuries are nevertheless\nreplete with conservative thought…as systematic and reflective\nas any found in the liberal tradition. (Gray 1995: 78–9) \n\n\nAs well as Burke, Gray cites Hegel, de Maistre, Savigny, Santayana and\nOakeshott, conservatives in that they share a “spirit of\nreaction against the excesses of liberal rationalism” (Gray\n1995: Ch. 10). Skorupski (2015) contrasts anti-universalist pragmatic\nconservatism with universalist rational conservatism; “rational\nconservatism” does not exhibit particularist scepticism.\nRational conservatives maintain that a community with a hierarchy of\nauthority is most conducive to human well-being—though they also\nregard agent-relative virtues such as loyalty and patriotism as\nfundamental, holding that it is universally true that patriotism is a\nvirtue. This is clearly the standpoint of authority rather than the\nstandpoint of freedom\n (see 1.5).\n\nHegel (1770–1831) is a key figure in the understanding of\nrational conservatism. Surprisingly for a standpoint that stresses the\nvalue of experience, conservatism—Hume excepted—has been\nassociated more with Idealism than with empiricism; philosophical\nempiricists have commonly been radicals. Hegel has been claimed by\nconservatives, but his political affiliation has been disputed since\nhis earliest disciples. For Left Hegelians including Marx,\nHegel’s concept of free thought was a defence of Enlightenment\nrationality, and a critique of traditional political authority. For\nthem, Geist did not invoke a transcendent power, as some Right\nHegelians maintained, but was an anthropological and historical\nprocess of emancipation, propelled by contradiction and struggle. In\nthe 20th century, Hegel was regarded alternatively as a\nproto-totalitarian reactionary, a conservative, or a liberal. But the\n“old orthodoxy” that he is a conservative or\nreactionary—in Anglophone philosophy largely derived from\nPopper—has disappeared, and he is often seen as synthesising\nconservatism and liberalism (Fine 2001: 5). \n\nHegel was ambivalent towards the French Revolution, the\nworld-historical event against which his generation thought out their\npolitical philosophy and stance towards the Enlightenment (Taylor\n1977: 403). The German Constitution was critical, lamenting\nwith Burke the “blind clamour for freedom” and radical\negalitarianism (Hegel PW: 93); the abstract, Rousseauean notion of\nfreedom, attempting to construct society on the basis of\n“subjective reason”, caused a “fury of\ndestruction”. The “Preface” of Elements of the\nPhilosophy of Right (1821) is a Burkean attack on those who\nsuppose\n\n\nthat no state or constitution had ever previously existed…that\nwe had now…to start right from the beginning. (Hegel 1821: 12)\n\n\n\nThe Revolution\n\n\n…afforded the tremendous spectacle, for the first time we know\nof in human history, of the overthrow of all\nexisting…conditions within an actual major state and the\nrevision of its constitution from first principles…[on] what\nwas supposed to be a purely rational basis…the most terrible\nand drastic event (Hegel 1821: §258R)\n\n\nAccording to Hegel, Rousseau’s contractual account destroys the\n“divine” element of the state (ibid.).\n\nHowever, Hegel also has a Rousseauean side, that is clear in the\nPhilosophy of History, where the Revolution signals the dawn\nof freedom:\n\n\nA constitution…was established in harmony with the thought of\nright…Never since the sun had stood in the firmament and the\nplanets revolved around it had it been perceived that man’s\nexistence centres in his head, i.e., in thought, inspired by which he\nbuilds up the world of reality. (Hegel 1822–1830: 447)\n\n\nRousseau\n\n\nput forward the will as the principle of the state, a principle which\nhas thought not only as its form [but also] its content, and which is\nin fact thinking itself. (Hegel 1821, §258R)\n\n\nSome writers thus claim Hegel for liberalism rather than conservatism,\nregarding his philosophy as\n\n\nthe most profound and compelling application of the [positive] idea of\nfreedom as…autonomy to the realm of politics. (Franco 1999: 3)\n\n\n\nThe contemporary consensus sees Hegel as attempting to synthesise\nliberalism and conservatism. For Cristi, his rapprochement is not an\neclectic blend of liberal and conservative strands of thought, but a\nsystematic synthesis:\n\n\nThe dialectical method brings about [their] reconciliation…by\nallowing an institutional embodiment for Hegel’s commitment to\nfree subjectivity. (Cristi 1989: 719–20, 725)\n\n\nWhile Hegel does not appeal to non-human natural law or providential\norder, he attempts to reconcile human reason with historical laws and\ninstitutions:\n\n\nFor Hegel, unlike Burke, the political order must ultimately be\njustified to human reason, although not in the individualistic manner\nthat typifies Enlightenment rationalism. (Franco 1999: 127)\n\n\n(Though to reiterate, Burke’s position here is contested.) The\nIdea of the state unites its divine character with the Rousseauean\nview that it is the product of human will and rationality (Franco\n1999: 288). \n\nHegel thus synthesises the universal and the particular:\n\n\nThe essence of the modern state is that the universal should be linked\nwith the complete freedom of particularity and the well-being of\nindividuals…the personal knowledge and volition of the\nparticular individuals who must retain their rights…Only when\nboth moments are present in full measure can the state be regarded\nas…truly organised. (Hegel 1821: §260)\n\n\nHegel (1821) argues that in morality and politics, we judge for\nourselves, but not by ourselves. We come to recognise rational norms\nhistorically, as actualised; we always reason in terms of the norms of\nour society, which we must nonetheless endorse only reflectively.\n\nContemporary Left Hegelians treat Hegel’s doctrine that reason\nis active in history as the claim that free thought, through the\nthinking of individuals, is history’s internal cause.\nConservatives, in contrast, attacked Hegel’s conception of\nevolving reason, for undermining the political order (Moggach 2013).\nBut for Skorupski, Hegel holds that free thought or natural reason\nmust be mediated by entrenched institutions of intellectual and\nspiritual authority: for Aquinas, the Church, for Hegel, a tradition\nof communal ethical life. Hegel affirms that “the right of the\nsubjective will”, the freedom of the moral subject, is inherent\nin modern ethical life, thus grounding reason in free thought, but\nonly in the context of a conservative holism (Skorupski 2015). The key\nconcept here is Sittlichkeit (“the ethical” or\n“ethical life”). \n\nSittlichkeit is the third element in Hegel’s philosophy\nof right, after abstract right and morality, and mediates its liberal\nand conservative polarities:\n\n\nThe right and the moral must have the ethical as their support and\nfoundation, for the right lacks…subjectivity, while morality in\nturn possesses this [alone]. (PR §141A)\n\n\nWhile “morality” is subjective self-determination,\nSittlichkeit or “ethical life” is both an\nattitude of individuals and a collective way of life, a set of values\nand practices or institutions. Its content is not derivable from a\nhigher principle; it is externally a culture’s values and\ninstitutions, and internally an aspect of one’s identity. Hegel\naccepts that an ethical life is historically contingent, even\narbitrary, in content, yet insists on its essential role in every\nsociety, and its need to develop organically. For him, some kinds of\nSittlichkeit are more advanced than others; at any one time,\na more advanced society drives world history forward by realising it\nin its institutions, customs, culture new ideas. This position goes\nbeyond the minimal rationality and universality of conservatism, which\nmakes no reference to historical advance.\n\nSamuel Taylor Coleridge is the thinker chiefly responsible for\nintroducing German Idealism to English-speaking readers, though in the\nperson of Kant rather than Hegel. As Townshend comments, “it is\nquite normal [to] write the history of English\nconservatism…without reference to Coleridge” (1993: 32),\nperhaps because the conservative appeal to experience is wrongly taken\nto be empiricist. Coleridge was an ardent enthusiast for the French\nRevolution who, disillusioned with its excesses, came to share\nBurke’s “conservative constitutionalism”. He\ndeclared that\n\n\nthe consequences of the heroic medicines recommended by the\nRevolutionists [are] far more dreadful than the disease. (Coleridge\n1812: 154)\n\n\nHowever, revolutionary ideals often appeal to “noble and\nimaginative spirits”; one must offer superior ideals, and\nsubstantial reforms. Coleridge criticised Burke’s “absurd\nopposition of Theory to Practice”, since “the meanest of\nmen has his Theory: and to think at all is to theorise”.\nColeridge warned against unchecked industrialisation, and criticised\nthe unfettered free-market, influencing Disraeli’s\nsocial-welfare conservatism.\n\nColeridge argued for a national Church exercising spiritual, moral and\ncultural leadership, maintaining schools in conjunction with the\nstate. In a Burkean image, he writes that a “clerisy” of\ninstructors—a disinterested class restraining against the\nself-interest of the others—would\n\n\nguard the treasures, of past civilisation, and…bind the present\nwith the past; to…add to the same, and thus to connect the\npresent with the future. (CW [1809]: 189)\n\n\nOn the Constitution of the Church and State (1830) traced the\nunderlying idea of the English state back to King Alfred. Coleridge\nasked whether institutions were “founded either in the nature of\nthings or in the necessities of our nature”; ideals “can\nbe profitably studied only as they are reflected in the particular\ninstitutions of a living political organism” (Coleridge 1829:\n276). J.S. Mill ranked Coleridge’s influence on political\nthought as equal to Bentham’s, calling them “the two great\nseminal minds of England in their age”. Bentham wished to reform\nor replace venerable institutions which lacked utility, while\nColeridge’s work was a necessary counterweight to Benthamite\nutilitarian liberalism, as\n\n\na Tory philosopher [rescues] truths which Tories have forgotten, and\nwhich the prevailing schools of Liberalism never knew. (Mill, CW X:\n163, “Coleridge”—note the early use of\n“Liberalism” (1840))\n\n\nTo reiterate, it was to Burke, with his scepticism about reason, that\nconstructors of an ideology of English conservatism appealed in the\nlate nineteenth century; Coleridge’s philosophical prestige was\nwaning, and his radical associations did not appeal to conservatives.\nTories did not appreciate the larger role for progression in\nColeridge’s thought, which is more rationalist than sceptically\npragmatic; his affinities with German Idealism, whose incursions into\nEnglish-speaking philosophy have been intermittent, were too\nstrong.\n\nThe work of major Victorian thinker and writer Thomas Carlyle\n(1795–1881) bears a complex relationship with conservatism; in\nhis later career he was a reactionary. Carlyle was a prophet of his\ntime who rejected industrialisation, and questioned progress; in these\nrespects he was a precursor of the equally influential Victorian\nthinker, John Ruskin. But Carlyle was an authoritarian radical, closer\nto Nietzsche’s aristocratic radicalism or elitism; his position was\ntherefore removed both from Burkean conservatism, and rationalist\nconservatism. He insisted on the importance of leadership, and is\nperhaps best known for his “great man” theory of history.\nHe supported the South in the American Civil War, and objected to\neconomics as “the dismal science” because of its failure\nto justify slavery.\n\nBenjamin Disraeli (1804–81), founder of the essentially Burkean\n“One Nation” conservatism, was a politician first, writer\nand thinker second. Disraeli never actually used the phrase “One\nNation”, but it was implied. The term comes from his 1845\nnovel Sybil; or the two nations, where Walter Gerard, a\nworking-class radical, describes “Two nations; between whom\nthere is no intercourse and no sympathy; who are as ignorant of each\nother’s habits, thoughts and feelings, as if they were dwellers in\ndifferent zones, or inhabitants of different planets…The RICH\nand the POOR”. His aim was to unite these two nations through\nthe benevolent leadership of the Conservative Party; he thus offered a\nmilder version of Bismarckian conservatism. As Chancellor of the\nExchequer and conservative leader in the House of Commons, he guided\nthe 1867 Reform Act, and as Prime Minister (1874-80), enacted social\nreform, passing laws on public health, factory acts, and laws on trade\nunion recognition. In these respects, he helped establish “One\nNation” conservatism.\n\nJames Fitzjames Stephen (1829–94) author of Liberty,\nEquality, Fraternity (1873), is best-known as Mill’s most\nscathing critic. Despite Carlyle’s influence on him, he was not a\nradical, but rather a classical liberal; Julia Stapleton describes his\nideas as having an affinity with Burke’s, in their defence of\ntraditional institutions against Radical attack (Stapleton, 1998).\nHowever, his Liberty, Equality, Fraternity (1873) is\nindebted to Hobbes’ Leviathan, whose authoritarianism\nhas little true conservative content (Townshend 1993). He had more\nveneration for established institutions than did Mill and his\nfollowers, and regarded moral life as relatively static. His\nobjections to Mill were paternalist, and like conservatives, he was a\npessimist concerning human nature.\n2.5 North American traditions\n\nConservatism does not rest on a defence of a landed nobility, monarchy\nand established church, so even though the United States lacks these,\nan American conservatism is possible. However, it is argued that owing\nto its foundation as a constitutional republic, its essentially\nliberal political culture has determined American conservatism’s\ncore commitments (Hartz 1955). Thus Gray argues that right-wing\nthought in the U.S.A. is almost exclusively neo-conservative and\nlibertarian, with a\n\n\nvirtual absence…of anything comparable to European\nconservatism…United States conservative thought is merely an\nindigenous variation on classical liberal themes of limited\ngovernment, individualism and economic progress [reflecting the]\nnear-ubiquity in American intellectual culture of individualist,\nuniversalist and Enlightenment themes. (Gray 2010: 166)\n\n\nJames Madison, one of the authors of The Federalist papers\n(1788), is claimed as an early American conservative; others are\nAlexander Hamilton, John Adams and John Calhoun. But it is probably\ntrue that Burkean conservatism has not produced thinkers in North\nAmerica of the depth of its leading British representatives, Burke\nhimself, Coleridge and Oakeshott. The original thinkers have instead\nbeen those of the maverick or “heroic” right—a\ntradition including Carl Schmitt, Leo Strauss and Hayek, whose patron\nis Nietzsche—or those who belong to the libertarian right, such\nas Nozick. These thinkers are not sceptical conservatives in the\nBurkean tradition (Skorupski 2015; on Burke’s influence in North\nAmerica, see Deane 2012). Vannatta describes as “pragmatic\nconservatives” Holmes and Dewey, whose political starting-point\nis present experience, customs and tradition (Vannatta 2014).\n2.6 Modern conservatism: Sidgwick, Oakeshott, Scruton\n\nHenry Sidgwick (1838–1900) arguably belongs in the ranks of\nmodern conservatives. He rejected his utilitarian precursors’\nreforming radicalism:\n\n\nWhen all relevant facts are taken into consideration [he holds] it\nwill scarcely ever be right on Utilitarian grounds for a Utilitarian\nopenly to break or to recommend others to break the rules of morality\ncommonly accepted in his society. (Broad 1930: 157; see also Collini\n1992)\n\n\nSidgwick’s position has been described as a utilitarianism\n“grown sleek and tame”, as it uses Bentham’s\nprinciples to justify those of Burke (Boucher and Vincent 2012: 30).\nSidgwick’s The Elements of Politics (1891) exhibits an\nintellectual and political conservatism, notably its rejection of\nthen-popular social evolutionary approaches; as Collini argues, though\nsympathetic to socialism, he was drawn to an idiosyncratic variety of\nconservatism—somewhat perhaps as Ruskin and William Morris were\n(Collini 1992; see also Kloppenberg 1992). F.H. Hayward notes, with\nexasperation, that rather than insisting\n\n\nthat Sidgwick should be classified as this or that…it is\nextremely difficult to classify him at all. (Hayward in Schultz ed.\n1992: 5)\n\n\nAn important issue that connects the conservatism of Hume, Burke,\nSidgwick is what people have reason to expect over time. Suppose one\nholds that justice requires X, but that people have long been\ndoing Y, which is incompatible with X, and have entered\ninto life-plans that assume that Y is how things are. If one\ntries to make society more just by preventing people doing Y,\nthat in itself is an unjust action. Hence what Feinberg called\nSidgwick’s paradox of conservative justice (Sidgwick 2011:\nIII.5). As Feinberg writes, insofar as our institutions depart from\nRawls’s basic principles of justice, we have a duty, he says, to\nwork toward their reform. But in our actual imperfect world\n\n\nEvery reform of an imperfect practice or institution is likely to be\nunfair to someone …To change the rules in the middle of the\ngame, even when those rules were not altogether fair, will disappoint\nthe honest expectations of those whose prior commitments and life\nplans were made in genuine reliance on the…old rules. The\npropriety of changing the rules in a given case depends upon\n(inter alia) the degree of unfairness of the old rules and\nthe extent and degree of the reliance placed upon them…we must\nweigh quite legitimate incompatible claims against each other in\ncircumstances such that whichever judgment is reached it will be\nunfair to someone or other (Feinberg 1973: 268). \n\n\nRawls admits that intuitive balancing is unavoidable in dealing with\nproblems of non-ideal theory, but Feinberg finds in his work little\nacknowledgment of the implications of Sidgwick’s paradox.\n\nMichael Oakeshott (1901–90) was the last major exponent of the\nIdealist tradition, which enjoyed a period of eminence in Anglophone\nphilosophy in the later 19th and early 20th\ncentury. He has been regarded as a liberal (Franco 2004), while others\nclaim him for the afore-mentioned maverick right (Anderson 1992: 7).\nBut Oakeshott is generally regarded as the most important modern\nconservative. His principal target is what he calls\n“Rationalism”, a position shared by liberals and\nsocialists, which aims to achieve ends laid down by blueprint:\n\n\nthe conservative will have nothing to do with innovations designed to\nmeet merely hypothetical situations; he will…delay a\nmodification of the rules until it is clear that the change of\ncircumstances it is designed to reflect has come to stay…he\nwill be suspicious of…rulers who demand extra-ordinary powers\nin order to make great changes and whose utterances are tied to\ngeneralities like “the public good” or “social\njustice”. (Oakeshott 1991: 127)\n\n\nIn opposing rationalist planning, Oakeshott argues that the\nconservative disposition is not “connected with any particular\nbeliefs…about the world in general or about the human\ncondition”, nor “with moral right and wrong, it is not\ndesigned to make men good or even better…” (Ashford 1990:\n43). He follows the logic of conservative pessimism, preferring\n“familiarity over perfection, the tried over the untried, and\nthe actual over the possible”; “stability is more\nprofitable than improvement…agreed error is superior to\ncontroversial truth” (Oakeshott 1991: 169–170). He\ncontrasted a state that has an economy, with a state effectively\nreduced to an economy, and bemoaned the domination of politics by the\npursuit of economic growth as opposed to the good life.\n\nThese are very Burkean themes. As Gray puts it,\n\n\nFor Oakeshott, human knowledge is not the mother of practice, but only\nits stepchild…an exfoliation from [practices] that we have\ninherited…When we theorise our practices, we are discerning\ncoherences within them, not imposing from without any set of abstract\nprinciples. (Gray 2007, Other Internet Resources)\n\n\nIn his book of essays Rationalism in Politics (1991),\nOakeshott is concerned with how the rationalist conception of\nknowledge has operated to the detriment of practice. This conception\nof knowledge holds that all genuine knowledge can be expressed\nentirely in propositional terms, in a theoretical system, or a set of\nrules or maxims. Oakeshott holds that in the modern world, the\nresulting instrumental rationality has penetrated inappropriate areas\nsuch as law, education and the arts—his thought thus\ninterestingly parallels that of Critical Theorists such as Adorno, and\nalso Heidegger. Means-end thinking concerning the state is\nparticularly inappropriate, as we have no choice but to belong to it,\nOakeshott maintains. In an important statement, Oakeshott regards\npolitics as an “art” not a “science”:\n\n\nPolitics is not the science of setting up a permanently impregnable\nsociety, it is the art of knowing where to go next in the exploration\nof an already existing traditional kind of society. (“The\nPolitical Economy of Freedom”, in Oakeshott 1991: 406)\n\n\n“Idealism” and “rationalism” tend to be\n“utopian”, and thus require uniformity and conformity, and\ndeny individuality and originality, he believes; they do not recognise\nthat members of society desire different ends. Oakeshott attacks\n“the ideological style of politics”, which pursues an\n“abstract idea” blind to the society’s actual\narrangements and their moral and emotional\n“intimations”—“men in a hurry” who wish\nto plan and mobilise. Ideologists make everything political, but\npolitics is only a part of human life, he holds.\n\nFor Oakeshott, civil associations are fundamental to modern, free\ndemocracies, and opposed to the modern interventionist state.\nEnterprise associations, in contrast, are defined by a common purpose;\nsociety is not one of them. This distinction reflects another between\n“intellectual”—expressing “rationalism”\nin politics—and “practical”. Politics, for\nOakeshott, belongs to the mode of practice, along with religion and\nmorality; the two other modes are science and history. As well as\nattacking “rationalists”, who have a rational plan and\nbelieve in abstract rights, Oakeshott also criticised\n“empiricists”, who claim to be pragmatic, rejecting\ntradition in favour of mere reaction to events. We again see that\nconservatism, although a practical standpoint that appeals to\nexperience, does not rest on philosophical empiricism.\n\nOakeshott is a Burkean particularist sceptic, for whom politics\nconcerns people developing ways of living together in light of their\nhistory and traditions, not driven by universal extrinsic goals such\nas equality or elimination of poverty:\n\n\nIn political activity…men sail a boundless and bottomless sea:\nthere is neither harbour for shelter nor floor for anchorage, neither\nstarting-place nor appointed destination. The enterprise is to keep\nafloat on an even keel… (1991: 127)\n\n\nThe nautical image had been popularised by Neurath, but is found in\nconservative thought at least as early as Schiller, whose Letters\non Aesthetic Education Of Man (1990 [1794]) referred to the\n“clock” of society that cannot be stopped for repairs:\n\n\nWhen the mechanic has to mend a watch, he lets the wheels run out, but\nthe living watchworks of the state have to be repaired while they act,\nand a wheel has to be exchanged for another during its revolutions.\n(Aesthetic Education, Letter 3)\n\n\nConservatives do not believe any general purpose for government can be\ngiven, beyond “keeping the enterprise afloat”. This is not\nthe substantive purpose of an enterprise association; rather,\n“keeping afloat” is the thin commonality of purpose that\ncharacterises a civil association. As Graham writes, “the only\npurpose [conservatives] are prepared to accept is too vague to\ndetermine any actual activity” (1986: 185); historical context\ndetermines the criteria of successful government.\n\nOakeshott argues that “conservatism is not a creed or a\ndoctrine, but a disposition” to enjoy the present (“On\nBeing a Conservative”)—part of human nature, not an\nabstract political idea or ideal, let alone an ideology. Though he was\na philosopher not a political theorist, Oakeshott denies that he is a\n“conservative philosopher”; philosophy is theoretical, a\n“theory of theories”, while conservatism is practical\n(Minogue 2009). However, Gamble adds, that disposition gains substance\nfrom its connection with national ways of life and traditions:\n\n\nFor Oakeshott, the past conceived in this way is intensely liberating\nbecause it is a repository of a wealth of practical knowledge, which\nis needed to live the good life. (Gamble 2012: 163)\n\n\nBut Oakeshott stresses that one must, through education in its\nhistory, be “released” from slavish commitment to\none’s tradition, and then return to it newly enriched and\ninformed. For him, conversation is the model of education.\n\nIt has been argued that in his later work, Oakeshott’s\njustifications for the conservative disposition developed in a liberal\ndirection (Franco 2004). While the scepticism of Rationalism in\nPolitics aims to protect tradition, “On Being\nConservative” cites the human disposition to individuality. In a\nposition reminiscent of J.S. Mill, Oakeshott argued empirically that\npeople want to pursue their own life plans, and it is for this reason\nthat governing ought to provide “general rules of conduct”\nand not “plans for imposing substantive activity” (1991:\n424). Unlike many (non-Millian) liberals, however, Oakeshott does not\nbase his requirement of limited government in an abstract theory of\nhuman nature, and abstract rights.\n\nOther notable 20th century conservative thinkers include\nhistorian Maurice Cowling and philosopher Anthony Quinton. Probably\nthe leading living conservative thinker is Roger Scruton, who bases\nconservatism on three concepts: authority, allegiance and tradition\n(Scruton 1980: 27). He rejects post-Hobbesian contractualism, which\npresupposes\n\n\nshared institutions and a conception of human freedom which could not\nhave their origin in a social contract which they serve to make\npossible. (1980: 30)\n\n\nScruton compares the bond of society to\n\n\nthe behaviour of children towards their parents…a bond that is\n‘transcendent’ [and] outside the sphere of individual\nchoice. (1980: 32)\n\n\nHence conservatism’s structuring concept of tradition, and its\ndeference to historical, non-state institutions, Burke’s\n“little platoons” in civil society, including family,\ncommunity and church. Scruton called his The Meaning of\nConservatism “a somewhat Hegelian defence of Tory values in\nthe face of their betrayal by the free marketeers”. It is only\nsomewhat Hegelian, because for Burkean conservatives, history lacks\nthe moral or spiritual direction that Hegel discerned; there is no\nmoral or spiritual progress, and people think collectively toward a\ncommon goal only during a crisis such as war.\n3. Critiques of conservatism\n3.1 What tradition? Communitarian critique\n\nAs we saw, conservatives have conflicting responses towards\nestablished power that arises from revolution. Non-relativistic\nconservatives\n (1.4 above)\n always rejected the Soviet system, no matter how long it endured, and\ncontinue to reject Chinese communism. They do not regard these as\n“traditions” in the manner of long-standing,\norganically-evolving institutions such as English Common Law.\nRelativistic conservatives, in contrast, might accept these systems,\nif they endure for long enough. Thus Oakeshott in Rationalism in\nPolitics refers to the Russian tradition of autocracy,\nperpetuated by the Bolshevik revolution; it is not “good”\nor “bad” tradition, but the only one that Russia knows. On\nhis view, it seems, tradition is inescapable, and societies rather\nrigid. \n\nGordon Graham argues that conservatives cannot consistently\n“reject” revolutionary regimes. Their ideology\n“[cannot] avoid connivance with evil”, and is recommended\n“only when conditions are reasonably, and perhaps unusually,\ngood”:\n\n\nTrue conservatism is a decidedly English doctrine with little\nappeal…in other countries [because] only English and hence\nBritish institutions have ever been decent enough to allow a decent\n[person] to be conservative. (Graham 1986: 188–9)\n\n\nGraham’s conclusion, that the state is not an “instrument\nof salvation”, and we should have “no very high\nexpectations of politics”, is—despite what he\nsuggests—itself a conservative view (1986: 189). However, a\nconservative response to totalitarianism is quietist\npessimism—not “connivance with evil”, but realism in\nthe face of it. As conservatives such as Burke supported the 1688\nRevolution, so they should support the non-violent uprisings of\n1989.\n\nModern communitarians such as MacIntyre and Sandel misinterpret\nconservatives when they condemn liberal individualism for abandoning\nthe notion of tradition to the Burkeans, whose concept of it is\n“static” when it should be\n\n\nliving tradition [as] a historically extended, socially embodied\nargument…in part about the goods which constitute a tradition.\n(MacIntyre, 2007: 222)\n\n\nFor MacIntyre, we find meaning for our lives through what he calls\ntraditional “narratives”; modes of thought that help us to\nreason and make moral judgements, and so we are not as free to reason\nor act as liberal cosmopolitans believe (2007: 205). Communitarians\nsuch as MacIntyre criticise modern thinkers “except for Newman\nin theology, and perhaps Coleridge who influenced him” for\nfailing to develop a theory of the rationality of traditions. (We saw\nthat Burke regarded tradition and individual reason as contradictory\nprinciples, but may have endorsed a notion of collective reason\n(Beveridge and Turnbull 1997).) \n\nTo reiterate, this is a misinterpretation of conservatism.\nConservatives would respond that Burke’s concept of tradition is not\nstatic, and does stress the importance of incremental change; while\nOakeshott, like MacIntyre, has an interrogative attitude to tradition.\nMoreover, the communitarian opposition to liberal values is limited,\nand does not extend to advocacy of religious intolerance and\nhomogeneity or patriarchal authority (see Taylor 1977; Waldron\n1992)—though neither does the anti-liberalism of Burkean\nconservatives. It could be argued that since the conservative\ntradition is older, and more substantial, than communitarianism, the\nliberal-conservative debate is more fundamental than the\nliberal-communitarian one; “communitarianism” is a mixture\nof liberalism and conservatism. (But see Skorupski 2015, on\n“liberal communitarianism”). (A further consideration is\nthat traditional methods may not always yield the most practical\nresponses (Scott 1998: 331).)\n3.2 Liberal critique\n\nWhile acknowledging his prescience about the Terror, liberals found\nBurke’s fears concerning the French Revolution excessive.They\ntook a different view when confronted with the Bolshevik Revolution of\nOctober 1917, which Marxists regard as completing its\n“bourgeois” predecessor. Thus conservative historian\nRichard Pipes holds that the French Terror was a “brief…\ncountercurrent”, while the Red Terror was an “essential\nelement of the regime” (Pipes 1990: 789; see Trotsky quotation\nin discussion of revolutionary utopianism earlier in this entry).\n\nConservatives criticise “atomistic” liberalism for\ntreating society as a mere collection of self-regarding individuals,\nheld together by rational norms and abstract laws rather than gaining\ntheir identity through an organic community; like communitarians,\nconservatives object to the primacy of abstract rights. Liberals reply\nthat “atomism” refers simply to the conviction that\nalthough people live in society, individuals are, as Rawls writes,\n“self-authenticating sources of valid claims”, claims that\ndo not require validation by larger social structures. (Millian\nliberalism is less subject to the conservative charge of rationalism.)\nAs Gamble puts it,\n\n\nOakeshott rejects the universal claims of liberalism, because he is\ninterested only in claims grounded in English political\nexperience.\n\n\nThe great American charters of the late 18th century are,\nfor him,\n\n\nabridgements of British political experience, solidified into an\neternal document. (Gamble 2012: 161)\n\n\nBentham and—on some views—Burke seem to conceive only of\nlegal rights; but if one can make sense of moral obligation, one can\nmake sense of abstract rights.\n3.3 Left critiques\n\nFor many left critics, conservatism is “organised\nselfishness” (Honderich 2005: 302). When Minogue argues that\n\n\nthe conservative enjoys the resources of his culture and is not\nforever fidgeting about big changes promising a better life\n(2009);\n\n\nsocialist critics respond that those in poverty cannot be said to\n“enjoy” many resources at all, and so any aspiration they\nhave for big changes cannot be “fidgeting”. The socialist\ncritic points out that when Oakeshott describes conservatism as a\n“disposition” to enjoy the present, Manchester factory\nworkers of the 1840s, or slum dwellers in contemporary Mumbai or\nMexico City, would find little to enjoy. As O’Hear (1998)\ncomments, those who see society riddled with defects are impatient\nwith conservative resistance to change; for them, the conservative\nemphasis on human ignorance and traditional wisdom is an evasion at\nbest.\n\nSocialists point out that the status quo is itself a construction.\nThis indeed is Kant’s view, when he writes that \n\n\nOne must take people as they are, our politicians tell us, and not as\nthe world’s uninformed pedants or good-natured dreamers fancy\nthat they ought to be. But as they are ought to read as we have made\nthem by unjust coercion, by treacherous designs which the government\nis in a good position to carry out. (Kant 1792)\n\n\nFor Neiman,\n\n\nmuch of our experience is…often deliberately\nconstructed… in order to perpetuate a social system that\nbenefits the very people who say it’s inevitable. (Neiman 2011:\n148–9)\n Neiman also comments that, “the rights of man have\ncome to guide us far more than [Burke] could ever have imagined”\n(Neiman 2011:148).\n\n\nMarxists reject Burke’s inference that since all social\nprocesses and institutions are interconnected, change must be\ncautious; they conclude instead that to change anything, one must\nchange everything. For Marx in The Eighteenth Brumaire of Louis\nBonaparte, tradition is a dead weight:\n\n\nMen make their own history, but [not] under circumstances chosen by\nthemselves…The tradition of all dead generations weighs like a\nnightmare on the brains of the living. (Marx 1852: 15)\n\n\nBut writers on the left have found value in some conservative ideas.\nRaymond Williams’ Culture and Society (1971) begins by\nshowing the lessons that Burke offers. And while rejecting its\nconclusion that change can only be piecemeal, many on the left share\nconservatism’s distrust of rational planning. While Lenin aimed\nto impose a socialist blueprint through a vanguard party of\nspecialists, his Marxist critics Luxemburg and Kollontai held that\nrevolutionary tasks are unknowable in advance:\n\n\nGiven the uncertainty of the endeavour, a plurality of experiments and\ninitiatives will best reveal which lines of attack are\nfruitful…[and produce] a creative, conscious…and\nempowered working class. (Scott 1998: 187–9)\n\n\nOn this view, radical change need not involve a fixed blueprint. (G.A.\nCohen is another Marxist writer who finds value in conservative ideas,\nas we see in section 4. below.)\n3.4 The coherence of particularist scepticism\n\nLord Hugh Cecil postulates within modern conservatism what he calls\ninnate conservatism: a psychological characteristic found in all\npeople to some degree (Cecil 1912). For C.D Broad, it has two\nsides:\n\n\nThe more worthy side [rational scepticism] [says] that social problems\nare so very complex that there is always a strong probability that\nsome factor has been overlooked in any scheme of change…The\nless respectable side [mental inertia] is the dislike of novelty as\nsuch.\n\n\nHe continues:\n\n\nRational scepticism, as a motive for rejecting a scheme that offers to\nremove admitted evils, involves two applications of probability. The\nfirst is…that social affairs are so complex that it is very\nimprobable that all the effects of a given social change have been\nforeseen. But…we must have some ground for judging further that\nthe unforeseen effects are more likely to be bad than good…this\njudgment cannot rest on the known nature of the effects of this\nparticular measure [but only] on some general proposition, such as: It\nis more probable that the unforeseen effects of any social change will\nbe bad than that they will be good. [There is] no reason to think\n[this]. (Broad 1913: 397)\n\n\nBroad is alluding to the fact that every philosophical standpoint must\nconfront the problem of how to treat its own defining claims, by its\nown lights. Examples would include whether Marxism is itself\nhistoricaly conditioned, and whether logical positivism’s verification\nprinciple is itself verifiable. Conservatives declare that there are\nno general prescriptions, but must address the status of its own\ngeneral prescription, “There are no general prescriptions”\n\n\nConservatism seems unduly pessimistic about the possibility of\nindividual, explicit knowledge of society, therefore. There are some\nthings about society that we can come to know—and government\neconomic policy, for instance, seems justifiably dedicated to finding\nthem out. Conservatives must concede that radical change is sometimes\nacceptable; some major changes, for instance votes for women, are\ngood. These must be prepared for—as they were in Britain in\n1918, compared with, say, 1832—and preparing for change makes it\nless radical. What conservatives will insist is that revolutionary\nchange is unacceptable.\n4. Cultural conservatism and conservation\n\nEspecially since the advent of green politics, there have been\nconservatives who have advocated ecological conservation. Scruton\nargues that “conservatism and conservation” are two\naspects of a single policy of husbanding resources, including social\ncapital embodied in laws, customs, and institutions, and material\ncapital of the environment (Scruton 2007). A less noticed parallel is\nthat between two oppositions: cultural conservation v. modernism, and\nconservatism v. revolutionary Jacobinism (Cohen 2007, Other Internet\nResources). In Britain after World War II, for instance, restorable\nbomb-damaged buildings were demolished to make way for modernist\nschemes later revealed as shoddy and cheap. Analogously, in\nContinental Europe, classical composers treated 1945 as “year\nzero”, rejecting all tradition. Conservatives would criticise\nboth developments.\n\nLeading modernist poet T.S. Eliot (1888–1965) was also an\nimportant conservative thinker, and so occupies an ambivalent\nposition. His essay “Tradition and the Individual Talent”\n(1919) argued that true originality is possible only within a\ntradition, which is a living presence in the modern world, not a\nmuseum relic (Eliot 1919; see Hamilton 2009). Eliot’s notion of\nan artistic tradition, and the related notion of a living classic,\nhelps to elucidate the conservative notion of a living\ntradition—a classic is something that has stood the test of\ntime, and is the subject of continuing reference and allusion. There\nare “dead classics” or “dead\ntraditions”—performing arts with rigid repertoires such as\nthat of Gregorian chant, which became closed by the time of the\nRenaissance. In contrast, the classical repertoire of Western art\nmusic, as it had evolved from the 18th century to the present, is open\nand flexible. It operates—when circumstances are\npropitious—as a living presence in contemporary culture. On a\nless exalted aesthetic level, in the same sense the tuxedo is a living\nsartorial classic.\n\nThese cultural issues are central to G.A. Cohen’s work on\nconservatism in political and cultural spheres. Cohen argues for a\ntruth in Burkean conservatism that is compatible with liberalism and\nsocialism, viz. that we should accept some things as given:\n\n\n[the rationalist claim that] everything can, or should, be shaped to\nour aims and requirements…violates intrinsic value and\ncontradicts our own spiritual requirements. (2007: 9)\n\n\nIn this sense, everyone is conservative to some degree—for\ninstance, if they prefer to have cash in their pocket rather than\nconverting to cashless payment. Thus a William Morris-based socialism\nis conservative in rejecting what planners and developers do to the\nenvironment that one loves; Robert Conquest allegedly commented that\n“everyone is conservative about what they know best”\n(quoted in Kates 2014). Conservation originated in the Victorian era.\nThe Camden Society, in early Victorian Cambridge, was concerned with\nthe “proper” and edifying construction and restoration of\nGothic churches and other public buildings. Later in the\n19th century, William Morris’s\n“anti-scrape” campaign introduced the idea that good\nbuildings of different periods complement each other and should be\ncherished. Morris argued that we should take delight in the history of\nold public buildings, and not seek to restore them to some pristine\nstate of perfection. \n\nMorris’s position is conservative in Cohen’s sense. For Cohen,\nconservatives aim to conserve particular valuable things, rather than\nmaximising value. This is “conservation of value”, but not\non the model of “conservation of energy”:\n\n\nvalue itself is conserved, when you destroy something valuable and\nreplace it by a thing of the same value. The conservative policy is\nnot to keep the value rating high but to keep the things that now\ncontribute to that rating. (2007: 10, Other Internet Resources)\n\n\nConservatism in this sense rules out utility-maximising\nconsequentialism:\n\n\nUnlike the conservative, the utilitarian is indifferent between adding\nto what we’ve now got, at no cost, something that has five units\nof value, and adding something worth ten units of value at the expense\nof destroying something worth five. (Cohen 2007: 15, Other Internet\nResources)\n\n\nConservatism in this sense might be regarded as a relatively expensive\ntaste, because it sacrifices value, in order not to sacrifice things\nthat have value.\n\nIt does not follow that conservatives welcome good new things any less\nthan non-conservatives do, Cohen argues. One can admire Byzantine\nicons partly because of their antiquity, and admire Frank\nGehry’s architecture partly because of its newness. However,\nCohen continues, conservatives can regard modernisation as beneficial\noverall, while lamenting what has been lost—admiring a splendid\nnew building, yet grieving over what it replaced. Both the economic\nmarket, and state planning, are inimical to “sentimental”\nor personal value, Cohen argues. \n\nSome planners might accept that a building’s existing is a\nreason to keep it, Cohen allows, but usually they require a more\ngeneral consideration—something that it does well, or a\nmajority’s desire that it remain. This is not the\nmajority’s reason for keeping it, however:\n\n\nMarket and planning logics tend against the truth that people want\nparticular valuable things, not just satisfaction of general\ndesiderata…market mania is deeply anti-conservative…If\nyou want everything to be optimal, nothing will be good. Some things\nhave to just be…there, if anything is to be good. (2012:\n27)\n\n\nCohen echoes Burke in his explanation of our desire to conserve\nparticular things:\n\n\nWe are attached to particular things because we need to belong to\nsomething… We do not keep the cathedrals just because\nthey’re beautiful, but also because they are part of our\npast…[We] value our particular past in the respectful way that\nwe value any past culture, but [also] in a more personal way. We want\nto be part of [Burke’s] “partnership…between those\nwho are living, those who are dead, and those who are to be\nborn”. (Cohen 2007: 28, Other Internet Resources)\n\n\nCohen here assumes that all parties agree on how “value”\nis to be measured and what therefore contributes to the value rating.\nBut although relativistic conservatives accept socially prevalent\nvaluations, revising them piecemeal on the basis of internal\ninconsistency or impracticality, non-relativistic conservatives might\ndeny that value can be quantified at all.\n\nCohen’s conservative model would look favorably on the organic\ndevelopment exhibited by medieval English towns and\nbuildings—perhaps especially by churches—and which\nparallels the organic model of political development. This model\nrejects the concept of a blueprint involving an individual creator.\nRather, the town or building evolves—apparently without a plan,\nover generations—, and often without stylistic consistency. The\nchurch as a building—or on the conservative model, a\nsociety—are like organisms, seemingly not the product of\nindividual intentional action, but evolving naturally. Most English\nparish churches of medieval foundation were not built according to a\nsingle design, but developed by addition and subtraction; in the\nMiddle Ages there was no profession of architect. Plans were produced\nby the master builder but it is contested how much there was an\nintentional, uniform schema generated prior to construction:\n\n\nA church building is inherently conservative, and except for the\nextraordinary intervention, changed very slowly. A large proportion of\nchurches had been founded by at least the late 12th\ncentury, many appearing in the Doomsday census of 1089. Elements from\nthese early buildings often survive in the doorways or the base of\ntowers, showing typical rounded arches and massive walls of the Norman\nstyle. Additions over time could include a reconstructed window, a new\nbaptismal font, a tomb sculpture, or a series of carved wooden choir\nstalls for the clergy, attesting to differing eras of piety and style.\n(Stanbury and Raguin 2009, Other Internet Resources)\n\n\nThe parallel with conservative political thought is suggested by\nScruton in his discussion of public space (Scruton 1994).\n\nScruton advocates architecture as a vernacular, public art form on an\nurban scale, in the manner of treatises on urban decorum from the\nRenaissance onwards, which subordinate the style of the individual\nbuilding to the whole. Unlike models that achieve this subordination\nby conscious planning, Scruton envisages a process akin to the\nself-ordering of an ideal competitive market. He applies Adam\nSmith’s metaphor of the invisible hand to the emergence of urban\norder, rejecting the utopian, social revolutionary visions of Gropius,\nLe Corbusier and other modernists. These writers sharply separate\narchitecture and “mere” building in a way opposed to\nScruton’s vernacularism.  A district of London such\nas North Kensington, where planning was at best rudimentary, and which\nhas few “public spaces” in the planner’s sense, is\n“eminently public”, Scruton argues (1994).\n\nThe debate in architecture and aesthetics parallels that in the\npolitical sphere. Does cultural or artistic conservatism in\nCohen’s sense conserve everything in the past, or only what is\ngood? For the non-relativistic conservative, which I have argued is\nthe profounder form of conservatism, there has to be some criterion of\nvalue in past things, involving in part their participation in a\nliving tradition. To develop and defend such a criterion is one of the\nmajor challenges facing conservative thinkers, in both political and\ncultural spheres. \n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abel, C. (ed.), 2010, <em>The Meanings of Michael\nOakeshott’s Conservatism</em>, Imprint Academic.",
                "Alexander, J., 2013, “The Contradictions of\nConservatism”, <em>Government and Opposition</em>, 48(4):\n594–615.",
                "Anderson, P., 1992, “The Intransigent Right at the End of\nthe Century” in <em>London Review of Books</em>, 14(18):\n7–11, also in <em>Spectrum</em>, London: Verso, 2005.",
                "Appiah, K., 2001, “Liberalism, Individuality and\nIdentity”, <em>Critical Inquiry</em>, 27(2): 305–332.",
                "Arnold, M., 1993, <em>Culture and Anarchy</em>, Cambridge:\nCambridge University Press.",
                "Archer, J.R., 1979, “Oakeshott on politics”, <em>The\nJournal of Politics</em>, 41(1): 150–168.",
                "Ashford, N., 1990, “Michael Oakeshott and the Conservative\nDisposition”, <em>The Intercollegiate Review</em>, 25:\n39–50.",
                "Aughey, A., G. Jones, and W.T.M. Riches, 1992, <em>The\nconservative tradition in Britain and the United States</em>, London:\nPinter.",
                "Bayly, C., 2004, <em>The Birth of the Modern World,\n1780–1914: Global Connections and Comparisons</em>, Oxford:\nBlackwell. ",
                "Beiser, F., 1992, <em>Enlightenment, Revolution and Romanticism:\nThe Genesis of Modern German Political Thought 1790–1800</em>,\nHarvard: Harvard University Press.",
                "Beveridge, C. and R. Turnbull, 1997, <em>Scotland After\nEnlightenment</em>, Edinburgh: Polygon.",
                "Botwinick, A., 2011, <em>Michael Oakeshott’s\nSkepticism</em>, Princeton: Princeton University Press.",
                "Boucher, D. and J. Vincent, 2012, <em>British Idealism: A Guide\nfor the Perplexed</em>, London: Continuum.",
                "Bourke, R., 2014, “Burke, Enlightenment and\nRomanticism”, in Dwan and Insole 2012: 27–40.",
                "–––, 2018, “What is conservatism? History,\nideology, party”, European Journal of Political Theory,\n17:449–75.",
                "Broad, C.D., 1913, “Lord Hugh Cecil’s\n‘Conservatism’”, <em>International Journal of\nEthics</em>, 23(4): 396–418.",
                "–––, 1930, <em>Five Types of Ethical\nTheory</em>, London and Henley: Routledge &amp; Kegan Paul.",
                "Burke, E., 1987 [1790], <em>Reflections on the Revolution in\nFrance</em>, J. G. A. Pocock (ed.) Cambridge, MA: Hackett.",
                "–––, [<b>SW IV</b>], <em>Select Works of Edmund\nBurke</em> (Volume IV: Miscellaneous Writings), Indianapolis: Liberty\nFund, 1999.",
                "–––, [<b>WS III</b>], <em>The Writings and\nSpeeches of Edmund Burke</em> (Volume III: Party, Parliament and the\nAmerican War–1794), Oxford: Clarendon, 1996.",
                "–––, [<b>WS VIII</b>], <em>The Writings and\nSpeeches of Edmund Burke</em> (Volume VIII: The French Revolution\n1790–1794), Oxford: Clarendon, 1990.",
                "–––, 1791, “Letter From The New To The Old\nWhigs”, in <em>Selected Prose of Edmund Burke</em>, edited and\nintroduced by Philip Magnus, 1948.\n [<a href=\"http://www.ourcivilisation.com/smartboard/shop/burkee/extracts/\" target=\"other\">Burke 1791 available online</a>,\n accessed 2012]",
                "Cain, J., 2003, “An Experiment in Honesty: Samuel Taylor\nColeridge’s <em>The Friend</em>”, <em>Modern Age</em>,\n45(4): 295–304;\n [<a href=\"https://isi.org/wp-content/uploads/2014/10/cain.pdf?x65644\" target=\"other\">Cain 2003 available online</a>]",
                "Calleo, D., 1966, <em>Coleridge and the Idea of the Modern\nState</em>, New Haven and London: Yale University Press.",
                "Canavan, F., 1960, <em>The Political Reason of Edmund Burke</em>,\nDurham N.C.: Duke University Press,",
                "Cecil, Lord H., 1912, <em>Conservatism</em>, London: Williams and\nNorgate.",
                "Chang, Ha Joon, 2003, <em>Globalisation, Economic Development and\nthe Role of the State</em>, London: Zed.",
                "Chesterton, G.K., 2012, <em>Orthodoxy</em>, London: Simon and\nBrown.",
                "Cheyne, P., (ed.), 2017, <em>Coleridge and Contemplation: Poetics,\nPhilosophy, Religion</em>, Oxford:Oxford University Press.",
                "Churchill, W., 1932, “Consistency in Politics”, in\n<em>Thoughts and Adventures</em>, London: Norton, 1992.",
                "Claeys, G., 2007, <em>The French Revolution Debate in Britain: The\nOrigins of Modern Politics</em>, London: Palgrave Macmillan.",
                "Clark, J.C.D., 2001, “Introduction” to <em>Edmund\nBurke: Reflections on the Revolution in France: A Critical\nEdition</em>, Stanford: Stanford University Press.",
                "–––, 2007, “The Enlightenment, Religion\nand Edmund Burke”, <em>Studies in Burke and the Eighteenth\nCentury</em>, 21: 9–38.",
                "Cobban, A., 1960, <em>Edmund Burke and the Revolt Against the\nEighteenth Century: A study of the political and social thinking of\nBurke, Wordsworth, Coleridge and Southey</em>, London: George Allen\n&amp; Unwin, 2nd edition",
                "Cohen, G.A., 2011, “Rescuing Conservatism”, in R. Jay\nWallace, Rahul Kumar, and Samuel Freeman (eds.), <em>Reasons and\nRecognition: Essays on the Philosophy of T.M. Scanlon</em>, Oxford: Oxford\nUniversity Press, 203–230. ",
                "Coleridge, S.T., 1812, <em>The Friend: Series of Essays</em>,\nLondon: Gale and Curtis.",
                "–––, 1817, <em>A Lay Sermon</em>, R. White\n(ed.), London: Routledge and Kegan Paul, 1972.",
                "–––, 1829, <em>Aids To Reflection in the\nFormation of a Manly Character</em>, Bedford MA: Applewood Books,\nreprint of 1829 edition.",
                "–––, 1830, <em>On the Constitution of Church and\nState</em>, London: Bradbury and Dent.",
                "–––, [<b>CW</b>], <em>Collected Works, Vol.\nIV</em>, London, 1969.",
                "Collini, S., 1992, “The ordinary experience of civilized\nlife: Sidgwick’s politics and the method of reflective\nanalysis”, in B. Schultz (ed.), <em>Essays on Henry\nSidgwick</em>, Cambridge: Cambridge University Press, 1992:\n333–368.",
                "Cowling, M., 1963, <em>Mill and Liberalism</em>, Cambridge:\nCambridge University Press.",
                "–––, 2004, <em>Religion and Public Doctrine in\nModern England: Volume 3, Accommodations</em>, Cambridge: Cambridge\nUniversity Press.",
                "Craig, D., 2012, “Burke and the Constitution”, in Dwan\nand Insole 2012: 104–116. ",
                "Cressy, D., 2006, <em>England On Edge: Crisis and Revolution:\n1640–42</em>, Oxford: Oxford University Press.",
                "Cristi, F., 1989, “Hegel’s Conservative\nLiberalism”, <em>Canadian Journal of Political Science</em>,\n22(4) 617–38.",
                "Cruise O’Brien, C., 1992, <em>The Great Melody: A Thematic\nBiography and Commented Anthology of Edmund Burke</em>, London:\nSinclair-Stevenson.",
                "Dancy, J., 2004, <em>Ethics Without Principles</em>, Oxford:\nOxford University Press. ",
                "Deane, S., 2012, “Burke in the United States”, in Dwan\nand Insole 2012: 221–234. ",
                "De Tocqueville, A., 1856, <em>The Old Regime and the French\nRevolution</em>, New York: Doubleday, 1955.",
                "–––, 1835/1840, <em>Democracy in America</em>,\nHarmondsworth, Middlesex: Penguin, 2003.",
                "Disraeli, B., 1845, <em>Sybil</em>, London: Henry Colburn.",
                "Duncan, G., 1973, <em>Marx and Mill: Two Views of Social Conflict\nand Social Harmony</em>, Cambridge: Cambridge University Press.",
                "Dwan, D. and C. Insole (ed.), 2012, <em>Cambridge Companion to\nEdmund Burke</em>, Cambridge: Cambridge University Press.",
                "Dyer, C., 2002, <em>Making A Living in the Middle Ages: the people\nof Britain, 850–1520</em>, Yale: Yale University Press.",
                "Eccleshall, R., 1992, “Michael Oakeshott and Sceptical\nConservatism”, in L. Tivey &amp; A. Wright (eds.), <em>Political\nThought since 1945</em>, Cheltenham: Elgar Publishing, 1992.",
                "––– (ed.), 1990, <em>English Conservatism since\nthe Restoration: An Introduction and Anthology</em>, London: Unwin\nHyman.",
                "Edwards, P., 2009, “Coleridge on Politics and\nReligion”, in F. Burwick (ed.), 2009, <em>The Oxford Handbook of\nSamuel Taylor Coleridge</em>, Oxford: Oxford University Press.",
                "Eliot, T.S., 1919, “Tradition and the Individual\nTalent”, in <em>Selected Essays</em>, London: Faber, 1999.",
                "Feinberg, J., 1973, “Duty and Obligation in the Non-Ideal\nWorld: Review of Rawls’s <em>Theory of Justice</em>”,\n<em>Journal of Philosophy</em>, 70(9): 263–275.",
                "Ferguson, N., 2012, “Why the young should welcome\nausterity”, BBC Reith Lecture #1, 17 June 2012.\n [<a href=\"http://www.bbc.co.uk/news/world-18456131\" target=\"other\">Ferguson 2012 available online</a>]",
                "Fieser, J. (ed.), 2005, <em>Early Responses to Hume’s Life\nAnd Reputation: Vols. 9 and, 10</em>, London: Continuum.",
                "Fine, R., 2001, <em>Political Investigations: Hegel, Marx,\nArendt</em>, London: Routledge.",
                "Floyd, J. and S. Shieh (eds.), 2001, <em>Future Pasts: The\nAnalytic Tradition in Twentieth Century Philosophy</em>, Oxford:\nOxford University Press.",
                "Franco, P., 1990, <em>The Political Philosophy of Michael\nOakeshott</em>, Yale: Yale University Press.",
                "–––, 1999, <em>Hegel’s Philosophy of\nFreedom</em>, New Haven and London: Yale University Press.",
                "Franco, P., 2004, <em>Michael Oakeshott: An Introduction</em>,\nYale: Yale University Press.",
                "Franco, P. and L. Marsh (eds.), 2012, <em>A Companion to Michael\nOakeshott</em>, University Park, PA: Penn State University Press.",
                "Freeden, M., 1998, Ideologies and Political Theory: A Conceptual\nApproach, Oxford: Oxford University Press.",
                "Gamble, A., 2012, “Oakeshott’s Ideological Politics:\nconservative or liberal”, in E. Podoksik 2012:\n153–176.",
                "Gewirth, A., 1983, <em>Human Rights: Essays on Justification and\nApplications</em>, Chicago: Chicago University Press.",
                "Gilmour, I., 1978, <em>Inside Right: A Study of Conservatism</em>,\nLondon: Quartet Books.",
                "Graham, G., 1986, <em>Politics In Its Place</em>, Oxford: Oxford\nUniversity Press.",
                "Gray, G., 1998, <em>Hayek on Liberty</em>, 3rd ed., London:\nRoutledge.",
                "Gray, J., 1995, <em>Liberalism</em>, Milton Keynes: Open\nUniversity Press.",
                "–––, 1997, “The Undoing of\nConservatism” in his <em>Enlightenment’s Wake: Politics\nand Culture at the Close of the Modern Age</em>, London:\nRoutledge.",
                "–––, 2010, <em>Gray’s Anatomy: Selected\nWritings</em>, Harmondsworth, Middlesex: Penguin.",
                "Gregory, A., 2002, <em>Coleridge and the Conservative\nImagination</em>, Macon, Georgia: Mercer University Press, especially\nCh. 1.",
                "Hamilton, A., 2007, “J.S. Mill and Democracy: Classical\nLiberalism’s Elitist Response”, in E. Kofmel (ed.),\n<em>Anti-Democratic Thought</em>, London: Imprint Academic.",
                "–––, 2009, “Scruton’s Philosophy of\nCulture: Elitism, Populism, and Classic Art”, <em>British\nJournal of Aesthetics</em> 49(4): 389–404.",
                "–––, 2013, <em>The Self In Question</em>,\nLondon: Palgrave Macmillan.",
                "–––, 2017, “Coleridge and Conservatism:\nThe Contemplation Of An Idea”, in Cheyne 2017:\n143–68.",
                "–––, forthcoming, “Conservatism As\nIlliberalism”, in Andras Sajo, Stephen Holmes and Renata Uitz\n(eds.), <em>Routledge Companion to Illiberalism</em>, London:\nRoutledge.",
                "Hampsher-Monk, I., 1992, <em>A History of Modern Political\nThought</em>, Oxford: Blackwell, Ch. VI.",
                "–––, 1998, “Burke” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.",
                "–––, 2012, “Reflections on the Revolution\nin France”, in Dwan and Insole 2012: 195–208.",
                "Harris, I., 1993, “Paine and Burke: God, nature and\npolitics”, in M. Bentley (ed.), <em>Public and Private Doctrine:\nEssays in British History Presented to Maurice Cowling</em>,\nCambridge: Cambridge University Press, 1993: 34–62.",
                "Harris, J., 2013, “Spare a thought for the late unlamented\none-nation Tory”, <em>The Guardian</em>, 14 April 2013.\n <a href=\"http://www.guardian.co.uk/commentisfree/2013/apr/14/thatcher-legacy-one-nation-conservatism\" target=\"other\">Harris 2013 available online</a>",
                "Hartz, L., 1955, <em>The Liberal Tradition in America</em>, New\nYork: Harcourt Brace.",
                "Haraszti, Z., 1952, <em>John Adams and the Prophets of\nProgress</em>, Cambridge: Cambridge University Press.",
                "Harvey, D., 2005, <em>A Brief History of Neo-liberalism</em>,\nOxford: Oxford University Press.",
                "Havers, G., 2005, “Leo Strauss, Willmoore Kendall and the\nMeaning of Conservatism”, <em>Humanitas</em>, 18(1–2):\n5–25.",
                "Hayek, F., 1960, “Why I Am Not A Conservative”,\nAppendix to <em>The Constitution of Liberty</em>, Chicago: University\nof Chicago Press.",
                "–––, 1946, <em>Individualism: True and False,\nThe Twelfth Finlay Lecture</em>, Oxford: B. H. Blackwell.",
                "Hegel, G., 1822–1830, <em>Lectures on the Philosophy of\nWorld History</em>, Cambridge: Cambridge University Press, 1980.",
                "–––, 1821, <em>Elements of the Philosophy of\nRight</em>, Allen Wood (ed.), Cambridge: Cambridge University Press,\n1991.",
                "–––, [<b>PW</b>], <em>Political Writings</em>,\nCambridge: Cambridge University Press, 1999.",
                "Herzog, D., 1991, “Puzzling through Burke”,\n<em>Political Theory</em>, 19(3): 336–63.",
                "Himmelfarb, G., 1987, “Who Now Reads Macaulay?” in her\n<em>The New History and the Old</em>, Cambridge, Massachusetts:\nHarvard University Press, 2004: 166–177",
                "–––, 2006, “Michael Oakeshott: The\nConservative Disposition”, in Himmelfarb 2006c:\n227–246",
                "–––, 2006a, “Benjamin Disraeli: The Tory\nImagination”, in Himmelfarb 2006c: 87–111",
                "–––, 2006b, “John Stuart Mill: The Other\nMill”, in Himmelfarb 2006c: 112–138.",
                "–––, 2006c, <em>The Moral Imagination: From\nEdmund Burke to Lionel Trilling</em>, Chicago: Ivan R. Dee.",
                "–––, 2008a, “Edmund Burke’s\nEnlightenment”, in her <em>The Roads to Modernity: The British,\nFrench and American Enlightenments</em>, London: Vintage, 2008:\n71–92",
                "–––, 2008b, “Edmund Burke’s\n<em>Reflections on the Revolution in France</em>”, C-Span taped\nspeech, Program ID: 281723-1, first aired Nov. 1, 2008.\n [<a href=\"http://www.c-spanvideo.org/program/281723-1\" target=\"other\">Himmelfarb 1987 available online</a>\n (accessed 2012)]",
                "Hitchens, C., 2011, “Edmund Burke: Reactionary\nProphet”, in his <em>Arguably</em>, London: Atlantic Books:\n152–164",
                "Hobhouse, L., 1964 [1911], <em>Liberalism</em>, New York: Oxford\nUniversity Press U.S.A. (first published, 1911).",
                "Hobsbawm, E. and T. Ranger (eds.), 1983, <em>The Invention of\nTradition</em>, Cambridge: Cambridge University Press. ",
                "Holmes, S., 1993, <em>The Anatomy of Illiberalism</em>, Harvard:\nHarvard University Press",
                "Honderich, T., 2005, <em>Conservatism: Burke, Nozick, Bush,\nBlair?</em>, London: Pluto Press.",
                "Hoppit, J., 2000, <em>A Land of Liberty: England\n1689–1727</em>, Oxford: Oxford University Press.",
                "Insole, C., 2012a, “Burke and the Natural Law”, in\nDwan and Insole 2012: 117–130.",
                "Israel, J., 2002, <em>Radical Enlightenment: Philosophy and the\nMaking of Modernity 1650–1750</em>, Oxford: Oxford University\nPress.",
                "Kant, I., 1792, <em>On the Old Saw: That May Be Right in Theory,\nBut It Won’t Work in Practice</em>, E. B. Ashton (trans.),\nPhiladelphia: University of Pennsylvania Press, 1974.",
                "Kates, S., 2014, “America, the Big Dumb Ox”,\n<em>Quadrant</em> online, Jan 14, 2014.\n [<a href=\"https://quadrant.org.au/magazine/2014/01-02/america-big-dumb-ox/\" target=\"other\">Kates 2014 available online</a>]",
                "Jones, E., 2017, <em>Edmund Burke and the Invention of Modern\nConservatism: An Intellectual History</em>, Oxford: Oxford University\nPress.",
                "Kekes, J., 1997, “What is Conservatism?”\n<em>Philosophy</em>, 72(281): 351–374.",
                "–––, 1998, <em>A Case for Conservatism</em>,\nLondon: Cornell University Press.",
                "Kendal, W. and G. Carey, 1964, “Towards a definition of\n‘Conservatism’”, <em>The Journal of Politics</em>,\n26(2): 406–22.",
                "Kirk, R., 1954, <em>The Conservative Mind</em>, London: BN\nPublishing, 2008.",
                "Kloppenberg, J., 1992, “Rethinking tradition: Sidgwick and\nthe philosophy of the via media”, in Schultz 1992:\n369–395.",
                "Kramnick, I., 1977, <em>The Rage of Edmund Burke: Portrait of an\nAmbivalent Conservative</em>, New York: Basic Books.",
                "Lebrun, R., 1988, <em>Joseph de Maistre: An Intellectual\nMilitant</em> by McGill-Queen’s University Press.",
                "Livingston, D., 1995, “On Hume’s Conservatism”, Hume\nStudies, XXI(2):151-164.",
                "Lock, F.P., 2006, <em>Edmund Burke, Volume II: 1784–97</em>,\nOxford: Oxford University Press.",
                "Maciag, D., 2013, <em>Edmund Burke in America: The Contested\nCareer of the Father of Modern Conservatism</em>, London: Cornell\nUniversity Press.",
                "MacIntyre, A., 2007, <em>After Virtue</em>, Notre Dame, Indiana:\nUniversity of Notre Dame Press, 3rd edition.",
                "Macpherson, C.B., 1980, <em>Burke</em>, Oxford: Oxford University\nPress.",
                "Marx, K., 1852, <em>The Eighteenth Brumaire of Louis\nNapoleon</em>, New York: International, 1972.",
                "–––, 1867, <em>Das Kapital</em>: <em>Kritik der\npolitischen Ökonomie</em>, Hamburg: Meissner.",
                "Mill, James, 1817, <em>The History of British India</em>, H.\nWilson (ed.), London: Routledge/Thoemmes, 1997.",
                "–––, 1858, <em>History of India</em>, London:\nJames Madden.",
                "Mill, J.S., [<b>CW</b>], <em>Collected Works: Vol. I</em>, London:\nRoutledge, 2009.",
                "Minogue, Kenneth, 1998, “Oakeshott,” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.",
                "–––, 2009, “The Elusive Oakeshott”,\n<em>The American Conservative</em>, October 1,\n <a href=\"http://amconmag.com/article/2009/oct/01/00024/\" target=\"other\">available online</a>.",
                "Minor, H., and M. Blain (eds.), forthcoming, <em>Collaborative\nArts Practices: Documenting Performance</em>, London: Macmillan.",
                "Moggach, D., 2013, “German Idealism and Marx”, in N.\nBoyle (ed.), <em>The Impact of Idealism Volume 2</em>, Cambridge:\nCambridge University Press: 82–107.",
                "Mount, F., 2014, “No Theatricks”: review of <em>The\nIntellectual Life of Edmund Burke from the Sublime and Beautiful to\nAmerican Independence</em> by D. Bromwich, <em>London Review of\nBooks</em>, 36(16): 14–17.",
                "Muller, Z., 1997, <em>Conservatism: An Anthology of Social and\nPolitical Thought from Hume to the Present</em>, Princeton: Princeton\nUniversity Press.",
                "Neiman, S., 2001, “Sure Path of a Science: Kant in the\nAnalytic Tradition”, in Floyd and Shieh 2001:\n291–313.",
                "–––, 2011, <em>Moral Clarity: A Guide for\nGrown-Up Idealists</em>, London: Vintage",
                "Nisbet, R., 1986, <em>Conservatism</em>, Milton Keynes: Open\nUniversity Press.",
                "Norman, J., 2013, <em>Edmund Burke: The First Conservative</em>,\nLondon: Collins.",
                "North, M., 1991, <em>The Political Aesthetic of Yeats, Eliot, and\nPound</em>, Cambridge: Cambridge University Press.",
                "Nozick, R., 1977, <em>Anarchy, State and Utopia</em>, New York:\nBasic Books.",
                "Oakeshott, M., 1991, <em>Rationalism in Politics and Other\nEssays</em>, Indianapolis: Liberty Press. Expanded edition of the 1962\nwork.",
                "O’Hear, Anthony, 1998, “Conservatism,”\n<em>Routledge Encyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge. ",
                "O’Sullivan, N., 2003, “Conservatism”, in <em>The\nCambridge History of 20<sup>th</sup> century Political Thought</em>,\nT. Ball and R. Bellamy (ed.): 151–65.",
                "–––, 1976, <em>Conservatism</em>, London: J.M.\nDent &amp; Sons.",
                "Paine, T., [1791], <em>Rights of Man</em>, in <em>Rights of Man,\nCommon Sense, and other political writings</em>, Mark Philp (ed.),\nOxford: Oxford Paperbacks, 2008.",
                "Parkin, C., 1956, <em>The Moral Basis of Burke’s Political\nThought</em>, Cambridge: Cambridge University Press.",
                "Perkins, Mary Anne, 1998, “Coleridge” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.",
                "Pipes, R., 1990, <em>The Russian Revolution, 1899–1919</em>,\nLondon: Harvill Press.",
                "Pocock, J., 1987, <em>The Ancient Constitution and the Feudal Law:\nA Study of English Historical Thought in the Seventeenth Century</em>,\nCambridge: Cambridge University Press.",
                "–––, 1989, “Burke and the Ancient\nConstitution”, in his <em>Politics, Language and Time: Essays on\nPolitical Thought and History</em>, Chicago: University of Chicago\nPress, 1971: 202–232.",
                "–––, 1994, “The devil has two\nhorns”, review of <em>The Great Melody: A Thematic Biography and\nCommented Anthology of Edmund Burke</em> by Conor Cruise\nO’Brien, 1992, <em>London Review of Books</em>, 16(4):\n9–11.\n [<a href=\"http://www.lrb.co.uk.ezphost.dur.ac.uk/v16/n04/jga-pocock/the-devil-has-two-horns\" target=\"other\">Pocock 1994 available online</a>]",
                "–––, 1999, <em>Barbarism and Religion</em> Vol.\n1, Cambridge: Cambridge University Press.",
                "Podoksik, E. (ed.), 2012, <em>The Cambridge Companion to\nOakeshott</em>, Cambridge: Cambridge University Press.",
                "Quinton, A., 1978, <em>The Politics of Imperfection : the\nReligious and Secular Traditions of Conservative Thought in England\nfrom Hooker to Oakeshott</em>, London: Faber.",
                "Ripley, R., 1965, “Adams, Burke and Eighteenth Century\nConservatism”, Political Science Quarterly,\n80(2):216–235.",
                "Robin, C., 2010, “Conservatism and Counterrevolution”,\n<em>Raritan</em>, 30(1): 1–17.",
                "Rothschild, E., 2001, <em>Economic Sentiments: Adam Smith,\nCondorcet and the Enlightenment</em>, Harvard: Harvard University\nPress.",
                "Schiller, F., 1990 [1794], <em>Letters Upon the Aesthetic\nEducation Of Man</em>, Hayes Barton Press.",
                "Schultz, B. (ed.), 1992, <em>Essays on Sidgwick</em>, Cambridge:\nCambridge University Press.",
                "Scott, J., 1998, <em>Seeing Like a State: How Certain Schemes to\nImprove the Human Condition Have Failed</em>, New Haven and Yale: Yale\nUniversity Press.",
                "Scruton, R., 1980, <em>The Meaning of Conservatism</em>,\nHarmondsworth, Middlesex: Penguin",
                "–––, 1994, <em>The Classical Vernacular:\nArchitectural Principles in an Age of Nihilism</em> London: St.\nMartin’s Press.",
                "–––, 2006, “Hayek and Conservatism”,\nin E. Feser (ed.), 2006, <em>Cambridge Companion to Hayek</em>,\nCambridge: Cambridge University Press.",
                "–––, 2007, <em>A Political Philosophy: Arguments\nfor Conservatism</em>, London: Continuum.",
                "–––, 2012, <em>The Uses of Pessimism &amp; the\nDanger of False Hope</em>, London: Atlantic Books.",
                "–––, 2013, <em>The Aesthetics of\nArchitecture</em>, Princeton: Princeton University Press.",
                "Sidgwick, H., 1874, <em>Methods of Ethics</em>, Cambridge:\nCambridge University Press.\n [<a href=\"http://www.laits.utexas.edu/poltheory/sidgwick/me/\" target=\"other\">Sidgwick 1907 [1874] available online</a>\n 7<sup>th</sup> edition]",
                "Skorupski, J., 1989, <em>John Stuart Mill</em>, London:\nRoutledge.",
                "–––, 2010, <em>Mill</em>, London:\nRoutledge.",
                "–––, 2015, “The Conservative Critique of\nLiberalism”, in Steven Wall (ed.), <em>The Cambridge Companion\nto Liberalism</em>, pp. 401–422, Cambridge: Cambridge University\nPress.",
                "Stanlis, P., 1953, <em>Edmund Burke and the Natural Law</em>,\nLondon: Routledge &amp; Kegan Paul.",
                "Stapleton, J., 1998, “Liberalism, Patriotism, and English\nLiberty”, <em>Victorian Studies</em>, 41(2): 243–263.",
                "Steiner, G., 1988, “Darkness Visible” (review of\nLebrun 1988), <em>London Review of Books</em>, 10(21): 3–4.",
                "Stewart, J., 2014, <em>Opinion and Reform in Hume’s\nPolitical Philosophy</em>, Princeton: Princeton University Press.",
                "Sweet, W., 1999, “Bosanquet and British Political\nThought”, <em>Laval Théologique et Philosophique</em>,\n55(1): 99–114.\n [<a href=\"http://www.erudit.org/revue/ltp/1999/v55/n1/401218ar.pdf\" target=\"other\">Sweet 1999 available online</a>]",
                "Taylor, C., 1977, <em>Hegel</em>, Cambridge: Cambridge University\nPress.",
                "Townshend, C., 1993, <em>Making the Peace: Public Order and Public\nSecurity in Modern Britain</em>, Oxford: Oxford University Press.",
                "Trotsky, L., 1920, <em>Terrorism and Communism: A Reply to Karl\nKautsky</em>, London: Verso, published 2007.",
                "Turner, F.M., 2003, “Introduction Edmund Burke: The\nPolitical Actor Thinking”, <em>Reflections on the Revolution in\nFrance</em>, Yale: Yale University Press.\n [<a href=\"http://www.yalebooks.com/yupbooks/excerpts/burke_reflections.pdf\" target=\"other\">Turner 2003 available online</a>]",
                "Vannatta, S., 2014, <em>Conservatism and Pragmatism in Law,\nPolitics and Ethics</em>, London: Palgrave Macmillan.",
                "Viereck, P., 2009, <em>Conservatism Revisited: The Revolt Against\nIdeology</em>, New Jersey: Transaction, 3<sup>rd</sup> edition.",
                "Vila, D., 2012, “Oakeshott and the Cold War critique of\npolitical rationalism”, in Podoksik 2012: 319–344.",
                "Vincent, A., 2004, <em>The Nature of Political Theory</em>,\nOxford: Oxford University Press.",
                "Waldron, J., 1987, <em>Nonsense Upon Stilts: Bentham, Burke and\nMarx on the Rights of Man</em>, London: Routledge.",
                "–––, 1992, “By The Roots”,\n<em>London Review of Books</em>, 17(3): 26–27.",
                "–––, 1993, <em>Liberal Rights: Collected Papers\n1981–1991</em>, Cambridge: Cambridge University Press.",
                "–––, 1998, “Liberalism,”\n<em>Routledge Encyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge. ",
                "Williams, R., 1971, <em>Culture and Society, 1780–1950</em>,\nHarmondsworth, Middlesex: Penguin.",
                "Wollstonecraft, M., 1790, <em>A Vindication of the Rights of\nMen</em>, in <em>A Vindication of the Rights of Men; A Vindication of\nthe Rights of Women; An Historical and Moral View of the French\nRevolution</em>, Oxford: Oxford Paperbacks, 2008.",
                "Wood, E. Meiskins, 2012, <em>Liberty and Property: A Social\nHistory of Western Political Thought from the Renaissance to\nEnlightenment</em>, London: Verso, pp. 236–7."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Abel, C. (ed.), 2010, <em>The Meanings of Michael\nOakeshott’s Conservatism</em>, Imprint Academic.</li>\n<li>Alexander, J., 2013, “The Contradictions of\nConservatism”, <em>Government and Opposition</em>, 48(4):\n594–615.</li>\n<li>Anderson, P., 1992, “The Intransigent Right at the End of\nthe Century” in <em>London Review of Books</em>, 14(18):\n7–11, also in <em>Spectrum</em>, London: Verso, 2005.</li>\n<li>Appiah, K., 2001, “Liberalism, Individuality and\nIdentity”, <em>Critical Inquiry</em>, 27(2): 305–332.</li>\n<li>Arnold, M., 1993, <em>Culture and Anarchy</em>, Cambridge:\nCambridge University Press.</li>\n<li>Archer, J.R., 1979, “Oakeshott on politics”, <em>The\nJournal of Politics</em>, 41(1): 150–168.</li>\n<li>Ashford, N., 1990, “Michael Oakeshott and the Conservative\nDisposition”, <em>The Intercollegiate Review</em>, 25:\n39–50.</li>\n<li>Aughey, A., G. Jones, and W.T.M. Riches, 1992, <em>The\nconservative tradition in Britain and the United States</em>, London:\nPinter.</li>\n<li>Bayly, C., 2004, <em>The Birth of the Modern World,\n1780–1914: Global Connections and Comparisons</em>, Oxford:\nBlackwell. </li>\n<li>Beiser, F., 1992, <em>Enlightenment, Revolution and Romanticism:\nThe Genesis of Modern German Political Thought 1790–1800</em>,\nHarvard: Harvard University Press.</li>\n<li>Beveridge, C. and R. Turnbull, 1997, <em>Scotland After\nEnlightenment</em>, Edinburgh: Polygon.</li>\n<li>Botwinick, A., 2011, <em>Michael Oakeshott’s\nSkepticism</em>, Princeton: Princeton University Press.</li>\n<li>Boucher, D. and J. Vincent, 2012, <em>British Idealism: A Guide\nfor the Perplexed</em>, London: Continuum.</li>\n<li>Bourke, R., 2014, “Burke, Enlightenment and\nRomanticism”, in Dwan and Insole 2012: 27–40.</li>\n<li>–––, 2018, “What is conservatism? History,\nideology, party”, European Journal of Political Theory,\n17:449–75.</li>\n<li>Broad, C.D., 1913, “Lord Hugh Cecil’s\n‘Conservatism’”, <em>International Journal of\nEthics</em>, 23(4): 396–418.</li>\n<li>–––, 1930, <em>Five Types of Ethical\nTheory</em>, London and Henley: Routledge &amp; Kegan Paul.</li>\n<li>Burke, E., 1987 [1790], <em>Reflections on the Revolution in\nFrance</em>, J. G. A. Pocock (ed.) Cambridge, MA: Hackett.</li>\n<li>–––, [<b>SW IV</b>], <em>Select Works of Edmund\nBurke</em> (Volume IV: Miscellaneous Writings), Indianapolis: Liberty\nFund, 1999.</li>\n<li>–––, [<b>WS III</b>], <em>The Writings and\nSpeeches of Edmund Burke</em> (Volume III: Party, Parliament and the\nAmerican War–1794), Oxford: Clarendon, 1996.</li>\n<li>–––, [<b>WS VIII</b>], <em>The Writings and\nSpeeches of Edmund Burke</em> (Volume VIII: The French Revolution\n1790–1794), Oxford: Clarendon, 1990.</li>\n<li>–––, 1791, “Letter From The New To The Old\nWhigs”, in <em>Selected Prose of Edmund Burke</em>, edited and\nintroduced by Philip Magnus, 1948.\n [<a href=\"http://www.ourcivilisation.com/smartboard/shop/burkee/extracts/\" target=\"other\">Burke 1791 available online</a>,\n accessed 2012]</li>\n<li>Cain, J., 2003, “An Experiment in Honesty: Samuel Taylor\nColeridge’s <em>The Friend</em>”, <em>Modern Age</em>,\n45(4): 295–304;\n [<a href=\"https://isi.org/wp-content/uploads/2014/10/cain.pdf?x65644\" target=\"other\">Cain 2003 available online</a>]</li>\n<li>Calleo, D., 1966, <em>Coleridge and the Idea of the Modern\nState</em>, New Haven and London: Yale University Press.</li>\n<li>Canavan, F., 1960, <em>The Political Reason of Edmund Burke</em>,\nDurham N.C.: Duke University Press,</li>\n<li>Cecil, Lord H., 1912, <em>Conservatism</em>, London: Williams and\nNorgate.</li>\n<li>Chang, Ha Joon, 2003, <em>Globalisation, Economic Development and\nthe Role of the State</em>, London: Zed.</li>\n<li>Chesterton, G.K., 2012, <em>Orthodoxy</em>, London: Simon and\nBrown.</li>\n<li>Cheyne, P., (ed.), 2017, <em>Coleridge and Contemplation: Poetics,\nPhilosophy, Religion</em>, Oxford:Oxford University Press.</li>\n<li>Churchill, W., 1932, “Consistency in Politics”, in\n<em>Thoughts and Adventures</em>, London: Norton, 1992.</li>\n<li>Claeys, G., 2007, <em>The French Revolution Debate in Britain: The\nOrigins of Modern Politics</em>, London: Palgrave Macmillan.</li>\n<li>Clark, J.C.D., 2001, “Introduction” to <em>Edmund\nBurke: Reflections on the Revolution in France: A Critical\nEdition</em>, Stanford: Stanford University Press.</li>\n<li>–––, 2007, “The Enlightenment, Religion\nand Edmund Burke”, <em>Studies in Burke and the Eighteenth\nCentury</em>, 21: 9–38.</li>\n<li>Cobban, A., 1960, <em>Edmund Burke and the Revolt Against the\nEighteenth Century: A study of the political and social thinking of\nBurke, Wordsworth, Coleridge and Southey</em>, London: George Allen\n&amp; Unwin, 2nd edition</li>\n<li>Cohen, G.A., 2011, “Rescuing Conservatism”, in R. Jay\nWallace, Rahul Kumar, and Samuel Freeman (eds.), <em>Reasons and\nRecognition: Essays on the Philosophy of T.M. Scanlon</em>, Oxford: Oxford\nUniversity Press, 203–230. </li>\n<li>Coleridge, S.T., 1812, <em>The Friend: Series of Essays</em>,\nLondon: Gale and Curtis.</li>\n<li>–––, 1817, <em>A Lay Sermon</em>, R. White\n(ed.), London: Routledge and Kegan Paul, 1972.</li>\n<li>–––, 1829, <em>Aids To Reflection in the\nFormation of a Manly Character</em>, Bedford MA: Applewood Books,\nreprint of 1829 edition.</li>\n<li>–––, 1830, <em>On the Constitution of Church and\nState</em>, London: Bradbury and Dent.</li>\n<li>–––, [<b>CW</b>], <em>Collected Works, Vol.\nIV</em>, London, 1969.</li>\n<li>Collini, S., 1992, “The ordinary experience of civilized\nlife: Sidgwick’s politics and the method of reflective\nanalysis”, in B. Schultz (ed.), <em>Essays on Henry\nSidgwick</em>, Cambridge: Cambridge University Press, 1992:\n333–368.</li>\n<li>Cowling, M., 1963, <em>Mill and Liberalism</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2004, <em>Religion and Public Doctrine in\nModern England: Volume 3, Accommodations</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Craig, D., 2012, “Burke and the Constitution”, in Dwan\nand Insole 2012: 104–116. </li>\n<li>Cressy, D., 2006, <em>England On Edge: Crisis and Revolution:\n1640–42</em>, Oxford: Oxford University Press.</li>\n<li>Cristi, F., 1989, “Hegel’s Conservative\nLiberalism”, <em>Canadian Journal of Political Science</em>,\n22(4) 617–38.</li>\n<li>Cruise O’Brien, C., 1992, <em>The Great Melody: A Thematic\nBiography and Commented Anthology of Edmund Burke</em>, London:\nSinclair-Stevenson.</li>\n<li>Dancy, J., 2004, <em>Ethics Without Principles</em>, Oxford:\nOxford University Press. </li>\n<li>Deane, S., 2012, “Burke in the United States”, in Dwan\nand Insole 2012: 221–234. </li>\n<li>De Tocqueville, A., 1856, <em>The Old Regime and the French\nRevolution</em>, New York: Doubleday, 1955.</li>\n<li>–––, 1835/1840, <em>Democracy in America</em>,\nHarmondsworth, Middlesex: Penguin, 2003.</li>\n<li>Disraeli, B., 1845, <em>Sybil</em>, London: Henry Colburn.</li>\n<li>Duncan, G., 1973, <em>Marx and Mill: Two Views of Social Conflict\nand Social Harmony</em>, Cambridge: Cambridge University Press.</li>\n<li>Dwan, D. and C. Insole (ed.), 2012, <em>Cambridge Companion to\nEdmund Burke</em>, Cambridge: Cambridge University Press.</li>\n<li>Dyer, C., 2002, <em>Making A Living in the Middle Ages: the people\nof Britain, 850–1520</em>, Yale: Yale University Press.</li>\n<li>Eccleshall, R., 1992, “Michael Oakeshott and Sceptical\nConservatism”, in L. Tivey &amp; A. Wright (eds.), <em>Political\nThought since 1945</em>, Cheltenham: Elgar Publishing, 1992.</li>\n<li>––– (ed.), 1990, <em>English Conservatism since\nthe Restoration: An Introduction and Anthology</em>, London: Unwin\nHyman.</li>\n<li>Edwards, P., 2009, “Coleridge on Politics and\nReligion”, in F. Burwick (ed.), 2009, <em>The Oxford Handbook of\nSamuel Taylor Coleridge</em>, Oxford: Oxford University Press.</li>\n<li>Eliot, T.S., 1919, “Tradition and the Individual\nTalent”, in <em>Selected Essays</em>, London: Faber, 1999.</li>\n<li>Feinberg, J., 1973, “Duty and Obligation in the Non-Ideal\nWorld: Review of Rawls’s <em>Theory of Justice</em>”,\n<em>Journal of Philosophy</em>, 70(9): 263–275.</li>\n<li>Ferguson, N., 2012, “Why the young should welcome\nausterity”, BBC Reith Lecture #1, 17 June 2012.\n [<a href=\"http://www.bbc.co.uk/news/world-18456131\" target=\"other\">Ferguson 2012 available online</a>]</li>\n<li>Fieser, J. (ed.), 2005, <em>Early Responses to Hume’s Life\nAnd Reputation: Vols. 9 and, 10</em>, London: Continuum.</li>\n<li>Fine, R., 2001, <em>Political Investigations: Hegel, Marx,\nArendt</em>, London: Routledge.</li>\n<li>Floyd, J. and S. Shieh (eds.), 2001, <em>Future Pasts: The\nAnalytic Tradition in Twentieth Century Philosophy</em>, Oxford:\nOxford University Press.</li>\n<li>Franco, P., 1990, <em>The Political Philosophy of Michael\nOakeshott</em>, Yale: Yale University Press.</li>\n<li>–––, 1999, <em>Hegel’s Philosophy of\nFreedom</em>, New Haven and London: Yale University Press.</li>\n<li>Franco, P., 2004, <em>Michael Oakeshott: An Introduction</em>,\nYale: Yale University Press.</li>\n<li>Franco, P. and L. Marsh (eds.), 2012, <em>A Companion to Michael\nOakeshott</em>, University Park, PA: Penn State University Press.</li>\n<li>Freeden, M., 1998, Ideologies and Political Theory: A Conceptual\nApproach, Oxford: Oxford University Press.</li>\n<li>Gamble, A., 2012, “Oakeshott’s Ideological Politics:\nconservative or liberal”, in E. Podoksik 2012:\n153–176.</li>\n<li>Gewirth, A., 1983, <em>Human Rights: Essays on Justification and\nApplications</em>, Chicago: Chicago University Press.</li>\n<li>Gilmour, I., 1978, <em>Inside Right: A Study of Conservatism</em>,\nLondon: Quartet Books.</li>\n<li>Graham, G., 1986, <em>Politics In Its Place</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Gray, G., 1998, <em>Hayek on Liberty</em>, 3rd ed., London:\nRoutledge.</li>\n<li>Gray, J., 1995, <em>Liberalism</em>, Milton Keynes: Open\nUniversity Press.</li>\n<li>–––, 1997, “The Undoing of\nConservatism” in his <em>Enlightenment’s Wake: Politics\nand Culture at the Close of the Modern Age</em>, London:\nRoutledge.</li>\n<li>–––, 2010, <em>Gray’s Anatomy: Selected\nWritings</em>, Harmondsworth, Middlesex: Penguin.</li>\n<li>Gregory, A., 2002, <em>Coleridge and the Conservative\nImagination</em>, Macon, Georgia: Mercer University Press, especially\nCh. 1.</li>\n<li>Hamilton, A., 2007, “J.S. Mill and Democracy: Classical\nLiberalism’s Elitist Response”, in E. Kofmel (ed.),\n<em>Anti-Democratic Thought</em>, London: Imprint Academic.</li>\n<li>–––, 2009, “Scruton’s Philosophy of\nCulture: Elitism, Populism, and Classic Art”, <em>British\nJournal of Aesthetics</em> 49(4): 389–404.</li>\n<li>–––, 2013, <em>The Self In Question</em>,\nLondon: Palgrave Macmillan.</li>\n<li>–––, 2017, “Coleridge and Conservatism:\nThe Contemplation Of An Idea”, in Cheyne 2017:\n143–68.</li>\n<li>–––, forthcoming, “Conservatism As\nIlliberalism”, in Andras Sajo, Stephen Holmes and Renata Uitz\n(eds.), <em>Routledge Companion to Illiberalism</em>, London:\nRoutledge.</li>\n<li>Hampsher-Monk, I., 1992, <em>A History of Modern Political\nThought</em>, Oxford: Blackwell, Ch. VI.</li>\n<li>–––, 1998, “Burke” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.</li>\n<li>–––, 2012, “Reflections on the Revolution\nin France”, in Dwan and Insole 2012: 195–208.</li>\n<li>Harris, I., 1993, “Paine and Burke: God, nature and\npolitics”, in M. Bentley (ed.), <em>Public and Private Doctrine:\nEssays in British History Presented to Maurice Cowling</em>,\nCambridge: Cambridge University Press, 1993: 34–62.</li>\n<li>Harris, J., 2013, “Spare a thought for the late unlamented\none-nation Tory”, <em>The Guardian</em>, 14 April 2013.\n <a href=\"http://www.guardian.co.uk/commentisfree/2013/apr/14/thatcher-legacy-one-nation-conservatism\" target=\"other\">Harris 2013 available online</a></li>\n<li>Hartz, L., 1955, <em>The Liberal Tradition in America</em>, New\nYork: Harcourt Brace.</li>\n<li>Haraszti, Z., 1952, <em>John Adams and the Prophets of\nProgress</em>, Cambridge: Cambridge University Press.</li>\n<li>Harvey, D., 2005, <em>A Brief History of Neo-liberalism</em>,\nOxford: Oxford University Press.</li>\n<li>Havers, G., 2005, “Leo Strauss, Willmoore Kendall and the\nMeaning of Conservatism”, <em>Humanitas</em>, 18(1–2):\n5–25.</li>\n<li>Hayek, F., 1960, “Why I Am Not A Conservative”,\nAppendix to <em>The Constitution of Liberty</em>, Chicago: University\nof Chicago Press.</li>\n<li>–––, 1946, <em>Individualism: True and False,\nThe Twelfth Finlay Lecture</em>, Oxford: B. H. Blackwell.</li>\n<li>Hegel, G., 1822–1830, <em>Lectures on the Philosophy of\nWorld History</em>, Cambridge: Cambridge University Press, 1980.</li>\n<li>–––, 1821, <em>Elements of the Philosophy of\nRight</em>, Allen Wood (ed.), Cambridge: Cambridge University Press,\n1991.</li>\n<li>–––, [<b>PW</b>], <em>Political Writings</em>,\nCambridge: Cambridge University Press, 1999.</li>\n<li>Herzog, D., 1991, “Puzzling through Burke”,\n<em>Political Theory</em>, 19(3): 336–63.</li>\n<li>Himmelfarb, G., 1987, “Who Now Reads Macaulay?” in her\n<em>The New History and the Old</em>, Cambridge, Massachusetts:\nHarvard University Press, 2004: 166–177</li>\n<li>–––, 2006, “Michael Oakeshott: The\nConservative Disposition”, in Himmelfarb 2006c:\n227–246</li>\n<li>–––, 2006a, “Benjamin Disraeli: The Tory\nImagination”, in Himmelfarb 2006c: 87–111</li>\n<li>–––, 2006b, “John Stuart Mill: The Other\nMill”, in Himmelfarb 2006c: 112–138.</li>\n<li>–––, 2006c, <em>The Moral Imagination: From\nEdmund Burke to Lionel Trilling</em>, Chicago: Ivan R. Dee.</li>\n<li>–––, 2008a, “Edmund Burke’s\nEnlightenment”, in her <em>The Roads to Modernity: The British,\nFrench and American Enlightenments</em>, London: Vintage, 2008:\n71–92</li>\n<li>–––, 2008b, “Edmund Burke’s\n<em>Reflections on the Revolution in France</em>”, C-Span taped\nspeech, Program ID: 281723-1, first aired Nov. 1, 2008.\n [<a href=\"http://www.c-spanvideo.org/program/281723-1\" target=\"other\">Himmelfarb 1987 available online</a>\n (accessed 2012)]</li>\n<li>Hitchens, C., 2011, “Edmund Burke: Reactionary\nProphet”, in his <em>Arguably</em>, London: Atlantic Books:\n152–164</li>\n<li>Hobhouse, L., 1964 [1911], <em>Liberalism</em>, New York: Oxford\nUniversity Press U.S.A. (first published, 1911).</li>\n<li>Hobsbawm, E. and T. Ranger (eds.), 1983, <em>The Invention of\nTradition</em>, Cambridge: Cambridge University Press. </li>\n<li>Holmes, S., 1993, <em>The Anatomy of Illiberalism</em>, Harvard:\nHarvard University Press</li>\n<li>Honderich, T., 2005, <em>Conservatism: Burke, Nozick, Bush,\nBlair?</em>, London: Pluto Press.</li>\n<li>Hoppit, J., 2000, <em>A Land of Liberty: England\n1689–1727</em>, Oxford: Oxford University Press.</li>\n<li>Insole, C., 2012a, “Burke and the Natural Law”, in\nDwan and Insole 2012: 117–130.</li>\n<li>Israel, J., 2002, <em>Radical Enlightenment: Philosophy and the\nMaking of Modernity 1650–1750</em>, Oxford: Oxford University\nPress.</li>\n<li>Kant, I., 1792, <em>On the Old Saw: That May Be Right in Theory,\nBut It Won’t Work in Practice</em>, E. B. Ashton (trans.),\nPhiladelphia: University of Pennsylvania Press, 1974.</li>\n<li>Kates, S., 2014, “America, the Big Dumb Ox”,\n<em>Quadrant</em> online, Jan 14, 2014.\n [<a href=\"https://quadrant.org.au/magazine/2014/01-02/america-big-dumb-ox/\" target=\"other\">Kates 2014 available online</a>]</li>\n<li>Jones, E., 2017, <em>Edmund Burke and the Invention of Modern\nConservatism: An Intellectual History</em>, Oxford: Oxford University\nPress.</li>\n<li>Kekes, J., 1997, “What is Conservatism?”\n<em>Philosophy</em>, 72(281): 351–374.</li>\n<li>–––, 1998, <em>A Case for Conservatism</em>,\nLondon: Cornell University Press.</li>\n<li>Kendal, W. and G. Carey, 1964, “Towards a definition of\n‘Conservatism’”, <em>The Journal of Politics</em>,\n26(2): 406–22.</li>\n<li>Kirk, R., 1954, <em>The Conservative Mind</em>, London: BN\nPublishing, 2008.</li>\n<li>Kloppenberg, J., 1992, “Rethinking tradition: Sidgwick and\nthe philosophy of the via media”, in Schultz 1992:\n369–395.</li>\n<li>Kramnick, I., 1977, <em>The Rage of Edmund Burke: Portrait of an\nAmbivalent Conservative</em>, New York: Basic Books.</li>\n<li>Lebrun, R., 1988, <em>Joseph de Maistre: An Intellectual\nMilitant</em> by McGill-Queen’s University Press.</li>\n<li>Livingston, D., 1995, “On Hume’s Conservatism”, Hume\nStudies, XXI(2):151-164.</li>\n<li>Lock, F.P., 2006, <em>Edmund Burke, Volume II: 1784–97</em>,\nOxford: Oxford University Press.</li>\n<li>Maciag, D., 2013, <em>Edmund Burke in America: The Contested\nCareer of the Father of Modern Conservatism</em>, London: Cornell\nUniversity Press.</li>\n<li>MacIntyre, A., 2007, <em>After Virtue</em>, Notre Dame, Indiana:\nUniversity of Notre Dame Press, 3rd edition.</li>\n<li>Macpherson, C.B., 1980, <em>Burke</em>, Oxford: Oxford University\nPress.</li>\n<li>Marx, K., 1852, <em>The Eighteenth Brumaire of Louis\nNapoleon</em>, New York: International, 1972.</li>\n<li>–––, 1867, <em>Das Kapital</em>: <em>Kritik der\npolitischen Ökonomie</em>, Hamburg: Meissner.</li>\n<li>Mill, James, 1817, <em>The History of British India</em>, H.\nWilson (ed.), London: Routledge/Thoemmes, 1997.</li>\n<li>–––, 1858, <em>History of India</em>, London:\nJames Madden.</li>\n<li>Mill, J.S., [<b>CW</b>], <em>Collected Works: Vol. I</em>, London:\nRoutledge, 2009.</li>\n<li>Minogue, Kenneth, 1998, “Oakeshott,” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.</li>\n<li>–––, 2009, “The Elusive Oakeshott”,\n<em>The American Conservative</em>, October 1,\n <a href=\"http://amconmag.com/article/2009/oct/01/00024/\" target=\"other\">available online</a>.</li>\n<li>Minor, H., and M. Blain (eds.), forthcoming, <em>Collaborative\nArts Practices: Documenting Performance</em>, London: Macmillan.</li>\n<li>Moggach, D., 2013, “German Idealism and Marx”, in N.\nBoyle (ed.), <em>The Impact of Idealism Volume 2</em>, Cambridge:\nCambridge University Press: 82–107.</li>\n<li>Mount, F., 2014, “No Theatricks”: review of <em>The\nIntellectual Life of Edmund Burke from the Sublime and Beautiful to\nAmerican Independence</em> by D. Bromwich, <em>London Review of\nBooks</em>, 36(16): 14–17.</li>\n<li>Muller, Z., 1997, <em>Conservatism: An Anthology of Social and\nPolitical Thought from Hume to the Present</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Neiman, S., 2001, “Sure Path of a Science: Kant in the\nAnalytic Tradition”, in Floyd and Shieh 2001:\n291–313.</li>\n<li>–––, 2011, <em>Moral Clarity: A Guide for\nGrown-Up Idealists</em>, London: Vintage</li>\n<li>Nisbet, R., 1986, <em>Conservatism</em>, Milton Keynes: Open\nUniversity Press.</li>\n<li>Norman, J., 2013, <em>Edmund Burke: The First Conservative</em>,\nLondon: Collins.</li>\n<li>North, M., 1991, <em>The Political Aesthetic of Yeats, Eliot, and\nPound</em>, Cambridge: Cambridge University Press.</li>\n<li>Nozick, R., 1977, <em>Anarchy, State and Utopia</em>, New York:\nBasic Books.</li>\n<li>Oakeshott, M., 1991, <em>Rationalism in Politics and Other\nEssays</em>, Indianapolis: Liberty Press. Expanded edition of the 1962\nwork.</li>\n<li>O’Hear, Anthony, 1998, “Conservatism,”\n<em>Routledge Encyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge. </li>\n<li>O’Sullivan, N., 2003, “Conservatism”, in <em>The\nCambridge History of 20<sup>th</sup> century Political Thought</em>,\nT. Ball and R. Bellamy (ed.): 151–65.</li>\n<li>–––, 1976, <em>Conservatism</em>, London: J.M.\nDent &amp; Sons.</li>\n<li>Paine, T., [1791], <em>Rights of Man</em>, in <em>Rights of Man,\nCommon Sense, and other political writings</em>, Mark Philp (ed.),\nOxford: Oxford Paperbacks, 2008.</li>\n<li>Parkin, C., 1956, <em>The Moral Basis of Burke’s Political\nThought</em>, Cambridge: Cambridge University Press.</li>\n<li>Perkins, Mary Anne, 1998, “Coleridge” in <em>Routledge\nEncyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge.</li>\n<li>Pipes, R., 1990, <em>The Russian Revolution, 1899–1919</em>,\nLondon: Harvill Press.</li>\n<li>Pocock, J., 1987, <em>The Ancient Constitution and the Feudal Law:\nA Study of English Historical Thought in the Seventeenth Century</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1989, “Burke and the Ancient\nConstitution”, in his <em>Politics, Language and Time: Essays on\nPolitical Thought and History</em>, Chicago: University of Chicago\nPress, 1971: 202–232.</li>\n<li>–––, 1994, “The devil has two\nhorns”, review of <em>The Great Melody: A Thematic Biography and\nCommented Anthology of Edmund Burke</em> by Conor Cruise\nO’Brien, 1992, <em>London Review of Books</em>, 16(4):\n9–11.\n [<a href=\"http://www.lrb.co.uk.ezphost.dur.ac.uk/v16/n04/jga-pocock/the-devil-has-two-horns\" target=\"other\">Pocock 1994 available online</a>]</li>\n<li>–––, 1999, <em>Barbarism and Religion</em> Vol.\n1, Cambridge: Cambridge University Press.</li>\n<li>Podoksik, E. (ed.), 2012, <em>The Cambridge Companion to\nOakeshott</em>, Cambridge: Cambridge University Press.</li>\n<li>Quinton, A., 1978, <em>The Politics of Imperfection : the\nReligious and Secular Traditions of Conservative Thought in England\nfrom Hooker to Oakeshott</em>, London: Faber.</li>\n<li>Ripley, R., 1965, “Adams, Burke and Eighteenth Century\nConservatism”, Political Science Quarterly,\n80(2):216–235.</li>\n<li>Robin, C., 2010, “Conservatism and Counterrevolution”,\n<em>Raritan</em>, 30(1): 1–17.</li>\n<li>Rothschild, E., 2001, <em>Economic Sentiments: Adam Smith,\nCondorcet and the Enlightenment</em>, Harvard: Harvard University\nPress.</li>\n<li>Schiller, F., 1990 [1794], <em>Letters Upon the Aesthetic\nEducation Of Man</em>, Hayes Barton Press.</li>\n<li>Schultz, B. (ed.), 1992, <em>Essays on Sidgwick</em>, Cambridge:\nCambridge University Press.</li>\n<li>Scott, J., 1998, <em>Seeing Like a State: How Certain Schemes to\nImprove the Human Condition Have Failed</em>, New Haven and Yale: Yale\nUniversity Press.</li>\n<li>Scruton, R., 1980, <em>The Meaning of Conservatism</em>,\nHarmondsworth, Middlesex: Penguin</li>\n<li>–––, 1994, <em>The Classical Vernacular:\nArchitectural Principles in an Age of Nihilism</em> London: St.\nMartin’s Press.</li>\n<li>–––, 2006, “Hayek and Conservatism”,\nin E. Feser (ed.), 2006, <em>Cambridge Companion to Hayek</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2007, <em>A Political Philosophy: Arguments\nfor Conservatism</em>, London: Continuum.</li>\n<li>–––, 2012, <em>The Uses of Pessimism &amp; the\nDanger of False Hope</em>, London: Atlantic Books.</li>\n<li>–––, 2013, <em>The Aesthetics of\nArchitecture</em>, Princeton: Princeton University Press.</li>\n<li>Sidgwick, H., 1874, <em>Methods of Ethics</em>, Cambridge:\nCambridge University Press.\n [<a href=\"http://www.laits.utexas.edu/poltheory/sidgwick/me/\" target=\"other\">Sidgwick 1907 [1874] available online</a>\n 7<sup>th</sup> edition]</li>\n<li>Skorupski, J., 1989, <em>John Stuart Mill</em>, London:\nRoutledge.</li>\n<li>–––, 2010, <em>Mill</em>, London:\nRoutledge.</li>\n<li>–––, 2015, “The Conservative Critique of\nLiberalism”, in Steven Wall (ed.), <em>The Cambridge Companion\nto Liberalism</em>, pp. 401–422, Cambridge: Cambridge University\nPress.</li>\n<li>Stanlis, P., 1953, <em>Edmund Burke and the Natural Law</em>,\nLondon: Routledge &amp; Kegan Paul.</li>\n<li>Stapleton, J., 1998, “Liberalism, Patriotism, and English\nLiberty”, <em>Victorian Studies</em>, 41(2): 243–263.</li>\n<li>Steiner, G., 1988, “Darkness Visible” (review of\nLebrun 1988), <em>London Review of Books</em>, 10(21): 3–4.</li>\n<li>Stewart, J., 2014, <em>Opinion and Reform in Hume’s\nPolitical Philosophy</em>, Princeton: Princeton University Press.</li>\n<li>Sweet, W., 1999, “Bosanquet and British Political\nThought”, <em>Laval Théologique et Philosophique</em>,\n55(1): 99–114.\n [<a href=\"http://www.erudit.org/revue/ltp/1999/v55/n1/401218ar.pdf\" target=\"other\">Sweet 1999 available online</a>]</li>\n<li>Taylor, C., 1977, <em>Hegel</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Townshend, C., 1993, <em>Making the Peace: Public Order and Public\nSecurity in Modern Britain</em>, Oxford: Oxford University Press.</li>\n<li>Trotsky, L., 1920, <em>Terrorism and Communism: A Reply to Karl\nKautsky</em>, London: Verso, published 2007.</li>\n<li>Turner, F.M., 2003, “Introduction Edmund Burke: The\nPolitical Actor Thinking”, <em>Reflections on the Revolution in\nFrance</em>, Yale: Yale University Press.\n [<a href=\"http://www.yalebooks.com/yupbooks/excerpts/burke_reflections.pdf\" target=\"other\">Turner 2003 available online</a>]</li>\n<li>Vannatta, S., 2014, <em>Conservatism and Pragmatism in Law,\nPolitics and Ethics</em>, London: Palgrave Macmillan.</li>\n<li>Viereck, P., 2009, <em>Conservatism Revisited: The Revolt Against\nIdeology</em>, New Jersey: Transaction, 3<sup>rd</sup> edition.</li>\n<li>Vila, D., 2012, “Oakeshott and the Cold War critique of\npolitical rationalism”, in Podoksik 2012: 319–344.</li>\n<li>Vincent, A., 2004, <em>The Nature of Political Theory</em>,\nOxford: Oxford University Press.</li>\n<li>Waldron, J., 1987, <em>Nonsense Upon Stilts: Bentham, Burke and\nMarx on the Rights of Man</em>, London: Routledge.</li>\n<li>–––, 1992, “By The Roots”,\n<em>London Review of Books</em>, 17(3): 26–27.</li>\n<li>–––, 1993, <em>Liberal Rights: Collected Papers\n1981–1991</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1998, “Liberalism,”\n<em>Routledge Encyclopedia of Philosophy</em>, E. Craig (ed.), London:\nRoutledge. </li>\n<li>Williams, R., 1971, <em>Culture and Society, 1780–1950</em>,\nHarmondsworth, Middlesex: Penguin.</li>\n<li>Wollstonecraft, M., 1790, <em>A Vindication of the Rights of\nMen</em>, in <em>A Vindication of the Rights of Men; A Vindication of\nthe Rights of Women; An Historical and Moral View of the French\nRevolution</em>, Oxford: Oxford Paperbacks, 2008.</li>\n<li>Wood, E. Meiskins, 2012, <em>Liberty and Property: A Social\nHistory of Western Political Thought from the Renaissance to\nEnlightenment</em>, London: Verso, pp. 236–7.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Burke, Edmund",
            "communitarianism",
            "Confucius",
            "Hegel, Georg Wilhelm Friedrich",
            "liberalism",
            "Mill, John Stuart",
            "Mill, John Stuart: moral and political philosophy",
            "Nozick, Robert: political philosophy",
            "property and ownership",
            "Rawls, John",
            "Rehberg, August Wilhelm",
            "rights"
        ],
        "entry_link": [
            {
                "../burke/": "Burke, Edmund"
            },
            {
                "../communitarianism/": "communitarianism"
            },
            {
                "../confucius/": "Confucius"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../liberalism/": "liberalism"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../mill-moral-political/": "Mill, John Stuart: moral and political philosophy"
            },
            {
                "../nozick-political/": "Nozick, Robert: political philosophy"
            },
            {
                "../property/": "property and ownership"
            },
            {
                "../rawls/": "Rawls, John"
            },
            {
                "../august-rehberg/": "Rehberg, August Wilhelm"
            },
            {
                "../rights/": "rights"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conservatism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/conservatism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=conservatism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/conservatism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conservatism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/conservatism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=conservatism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/conservatism/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Cohen, G., 2007,  “<a href=\"https://sites.google.com/site/politicaltheoryworkshop/GACohenConservatism.pdf?attredirects=0\" target=\"other\">A Truth in conservatism: Rescuing conservatism from the Conservatives</a>,”\n manuscript of a lecture. ",
            "Gray, J., 2007,\n “<a href=\"http://devilred.pixnet.net/blog/post/6661753-michael-oakeshott-and-the-political-economy-of-freedom-1\" target=\"other\">Michael Oakeshott and the Political Economy of Freedom</a>,”\n blog post, May 29, 2007.",
            "Stanbury, S. and V. Raguin, 2009,\n “<a href=\"http://college.holycross.edu/projects/kempe/model/1.html\" target=\"other\">Model Parish Church, Parish Church Architecture</a>,\n page on the website Mapping Margery Kempe: A Guide to Late Medieval\nMaterial and Spiritual Life, Holycross College."
        ],
        "listed_links": [
            {
                "https://sites.google.com/site/politicaltheoryworkshop/GACohenConservatism.pdf?attredirects=0": "A Truth in conservatism: Rescuing conservatism from the Conservatives"
            },
            {
                "http://devilred.pixnet.net/blog/post/6661753-michael-oakeshott-and-the-political-economy-of-freedom-1": "Michael Oakeshott and the Political Economy of Freedom"
            },
            {
                "http://college.holycross.edu/projects/kempe/model/1.html": "Model Parish Church, Parish Church Architecture"
            }
        ]
    }
}