{
    "url": "consequentialism-rule",
    "title": "Rule Consequentialism",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Brad Hooker\n<b.w.hooker@reading.ac.uk>",
        "author_links": [
            {
                "mailto:b%2ew%2ehooker%40reading%2eac%2euk": "b.w.hooker@reading.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nBrad Hooker\n&lt;<a href=\"mailto:b%2ew%2ehooker%40reading%2eac%2euk\"><em>b<abbr title=\" dot \">.</abbr>w<abbr title=\" dot \">.</abbr>hooker<abbr title=\" at \">@</abbr>reading<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 31, 2003",
        "substantive revision Sun Jan 15, 2023"
    ],
    "preamble": "\n\nThe theory of morality we can call full rule-consequentialism selects\nrules solely in terms of the goodness of their consequences and then\nclaims that these rules determine which kinds of acts are morally\nwrong. George Berkeley was arguably the first rule-consequentialist.\nHe wrote, “In framing the general laws of nature, it is granted\nwe must be entirely guided by the public good of mankind, but not in\nthe ordinary moral actions of our lives. … The rule is framed\nwith respect to the good of mankind; but our practice must be always\nshaped immediately by the rule” (Berkeley 1712: section 31).\n",
    "toc": [
        {
            "#Uti": "1. Utilitarianism"
        },
        {
            "#Wel": "2. Welfare"
        },
        {
            "#OthGooPro": "3. Other Goods To Be Promoted"
        },
        {
            "#FulVerParRulCon": "4. Full Rule-consequentialism"
        },
        {
            "#GloCon": "5. Global Consequentialism"
        },
        {
            "#ForFulRulCon": "6. Formulating Full Rule-consequentialism"
        },
        {
            "#ActVerExpGoo": "6.1 Actual versus Expected Good"
        },
        {
            "#ComAcc": "6.2 Compliance and Acceptance"
        },
        {
            "#ComAccVerIncAcc": "6.3 Complete Acceptance versus Incomplete Acceptance"
        },
        {
            "#TwoWayArgForRulCon": "7. Three Ways of Arguing for Rule-consequentialism"
        },
        {
            "#OldObjRulCon": "8. Must Rule-consequentialism Be Guilty of Collapse, Incoherence, or Rule-worship?"
        },
        {
            "#NewObjRulCon": "9. Other Objections to Rule-consequentialism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Utilitarianism\n\nA moral theory is a form of consequentialism if and only if it\nassesses acts and/or character traits, practices, and institutions\nsolely in terms of the goodness of the consequences. Historically,\nutilitarianism has been the best-known form of consequentialism.\nUtilitarianism assesses acts and/or character traits, practices, and\ninstitutions solely in terms of overall net benefit. Overall net\nbenefit is often referred to as aggregate well-being or welfare.\nAggregate welfare is calculated by counting a benefit or harm to any\none individual the same as the same size benefit or harm to any other\nindividual, and then adding all the benefits and harms together to\nreach an aggregate sum. There is considerable dispute among\nconsequentialists about what the best account of welfare is.\n2. Welfare\n\nClassical utitilitarians (i.e., Jeremy Bentham, J.S. Mill, and Henry\nSidgwick) took benefit and harm to be purely a matter of pleasure and\npain. The view that welfare is a matter of pleasure minus pain has\ngenerally been called hedonism. It has grown in sophistication (Parfit\n1984: Appendix I; Sumner 1996; Crisp 2006; de Lazari-Radek and Singer\n2014: ch. 9) but remains committed to the thesis that how well\nsomeone’s life goes depends entirely on his or her\npleasure minus pain, albeit with pleasure and pain being construed\nvery broadly.\n\nEven if pleasures and pains are construed very broadly, hedonism\nencounters difficulties. The main one is that many (if not all) people\ncare very strongly about things other than their own pleasures and\npains. Of course these other things can be important as means to\npleasures and to the avoidance of pain. But many people care very\nstrongly about things over and beyond their hedonistic instrumental\nvalue. For example, many people want to know the truth about various\nmatters even if this won’t increase their (or anyone\nelse’s) pleasure. Another example is that many people care about\nachieving things over and beyond the pleasure such achievements might\nproduce. Again, many people care about the welfare of their family and\nfriends in a non-instrumental way. A rival account of these points,\nespecially the last, is that people care about many things other than\ntheir own welfare.\n\nOn any plausible view of welfare, the satisfaction people can feel\nwhen their desires are fulfilled constitutes an addition to their\nwelfare. Likewise, on any plausible view, frustration felt as a result\nof unfulfilled desires constitutes a reduction in welfare. What is\ncontroversial is whether the fulfilment of someone’s desire\nconstitutes a benefit to that person apart from any effect that the\nfulfilment of the desire has on that person’s felt satisfaction\nor frustration. Hedonism answers No, claiming that only effects on\nfelt satisfaction or felt frustration matter.\n\nA different theory of welfare answers Yes. This theory holds that the\nfulfilment of any desire of the agent’s constitutes a benefit to\nthe agent, even if the agent never knows that desire has been\nfulfilled and even if the agent derives no pleasure from its\nfulfilment. This theory of human welfare is often referred to as the\ndesire-fulfillment theory of welfare.\n\nClearly, the desire-fulfillment theory of welfare is broader than\nhedonism, in that the desire-fulfillment theory accepts that what can\nconstitute a benefit is wider than merely pleasure. But there are\nreasons for thinking that this broader theory is too broad. For one\nthing, people can have sensible desires that are simply too\ndisconnected from their own lives to be relevant to their own welfare\n(Williams 1973a: 262; Overvold 1980, 1982; Parfit 1984: 494). I desire\nthat the starving in far-away countries get food. But the fulfilment\nof this desire of mine does not benefit me.\n\nFor another thing, people can have desires for absurd things for\nthemselves. Suppose I desire to count all the blades of grass in the\nlawns on this road. If I get satisfaction out of doing this, the felt\nsatisfaction constitutes a benefit to me. But the bare fulfilment of\nmy desire to count all the blades of grass in the lawns on this road\ndoes not (Rawls 1971: 432; Parfit 1984: 500; Crisp 1997: 56).\n\nOn careful reflection, we might think that the fulfilment of\nsomeone’s desire constitutes an addition to that person’s\nwelfare if and only if that desire has one of a certain set\nof contents. We might think, for example, that the fulfilment of\nsomeone’s desire for pleasure, friendship, knowledge,\nachievement, or autonomy for herself does constitute an\naddition to her welfare, and that the fulfilment of any desires she\nmight have for things that do not fall into these categories do not\ndirectly benefit her (though, again, the pleasure she derives from\ntheir satisfaction does). If we think this, it seems we think there is\na list of things that constitute anyone’s welfare (Parfit 1984:\nAppendix I; Brink 1989: 221–36; Griffin 1996: ch. 2; Crisp 1997:\nch. 3; Gert 1998: 92–4; Arneson 1999a).\n\nInsofar as the goods to be promoted are parts of welfare, the theory\nremains utilitarian. There is a lot to be said for utilitarianism.\nObviously, how lives go is important. And there is something deeply\nattractive (if not downright irresistible) in the idea that morality\nis fundamentally impartial, i.e., the idea that, at the most\nfundamental level of morality, everyone is equally important —\nwomen and men, strong and weak, rich and poor, Blacks, Whites,\nHispanics, Asians, etc. And utilitarianism plausibly interprets this\nequal importance as dictating that in the calculation of overall\nwelfare a benefit or harm to any one individual counts neither more\nnor less that the same size benefit or harm to any other\nindividual.\n3. Other Goods To Be Promoted\n\nThe nonutilitarian members of the consequentialist family are theories\nthat assess acts and/or character traits, practices, and institutions\nsolely in terms of resulting good, where good is not restricted to\nwelfare. “Nonutilitarian” here means “not\npurely utilitarian”, rather than “completely\nunutilitarian”. When writers describe themselves as\nconsequentialists rather than as utilitarians, they are normally\nsignalling that their fundamental evaluations will be in terms of not\nonly welfare but also some other goods.\n\nWhat are these other goods? The most common answers have been justice,\nfairness, and equality.\n\nJustice, according to Plato, is “rendering to each his\ndue” (Republic, Bk. 1). We might suppose that what\npeople are due is a matter of what people are owed, either because\nthey deserve it or because they have a moral right to it. Suppose we\nplug these ideas into consequentialism. Then we get the theory that\nthings should be assessed in terms of not only how much welfare\nresults but also the extent to which people get what they deserve and\nthe extent to which moral rights are respected.\n\nFor consequentialism to take this line, however, is for it to restrict\nits explanatory ambitions. What a theory simply presupposes, it does\nnot explain. A consequentialist theory that presupposes both that\njustice is constituted by such-and-such and that justice is one of the\nthings to be promoted does not explain why the components of justice\nare important. It does not explain what desert is. It does not explain\nthe importance of moral rights, much less try to determine what the\ncontents of these moral rights are. These are matters too important\nand contentious for a consequentialist theory to leave unexplained or\nopen. If consequentialism is going to refer to justice, desert, and\nmoral rights, it needs to analyze these concepts and justify the role\nit gives them.\n\nSimilar things can be said about fairness. If a consequentialist\ntheory presupposes an account of fairness, and simply stipulates that\nfairness is to be promoted, then this consequentialist theory is not\nexplaining fairness. But fairness (like justice, desert, and moral\nrights) is a concept too important for consequentialism not to try to\nexplain.\n\nOne way for consequentialists to deal with justice and fairness is to\ncontend that justice and fairness are constituted by conformity with a\ncertain set of justified social practices, and that what justifies\nthese practices is that they generally promote overall welfare and\nequality. Indeed, the contention might be that what people are due,\nwhat people have a moral right to, what justice and fairness require,\nis conformity to whatever practices promote overall welfare and\nequality.\n\nWhether equality needs to be included in the formula, however, is very\ncontroversial. Many think that a purely utilitarian formula has\nsufficiently egalitarian implications. They think that, even if the\ngoal is promotion of welfare, not the promotion of\nwelfare-plus-equality, there are some contingent but pervasive facts\nabout human beings that push in the direction of equal distribution of\nmaterial resources. According to the “law of diminishing\nmarginal utility of material resources”, the amount of benefit a\nperson gets out of a certain unit of material resources is less the\nmore units of that material good the person already has. Suppose I go\nfrom having no way of getting around except by foot to having a\nbicycle, or, though I live in a place where one can get very cold, I\ngo from having no warm coat to having one. I will benefit more from\ngetting that first bicycle or coat than I would if I go from having\nnine bicycles or coats to having ten.\n\nThere are exceptions to the law of diminishing marginal utility. In\nmost of these exceptions, an additional unit of material resource\npushes someone over some important threshold. For example, consider\nthe meal or pill or gulp of air that saves someone’s life, or\nthe car whose acquisition pushes the competitive collector into first\nplace. In such cases, the unit that puts the person over the threshold\nmight well be as beneficial to that person as any prior unit was.\nStill, as a general rule, material resources do have diminishing\nmarginal utility.\n\nTo the assumption that material resources have diminishing marginal\nutility, let us add the assumption that different people generally get\nroughly the same benefits from the same material resources.\nAgain, there are exceptions. If you live in a freezing climate and I\nlive in a hot climate, then you would benefit much more from a warm\ncoat than I would.\n\nBut suppose we live in the same place, which has freezing winters,\ngood paths for riding bicycles, and no public transportation. And\nsuppose you have ten bicycles and ten coats (though you are not vying\nfor some bicycle- or coat-collector prize). Meanwhile, I am so poor\nthat I have none. Then, redistributing one of your bicycles and one of\nyour coats to me will probably harm you less than it will benefit me.\nThis sort of phenomenon pervades societies where resources are\nunequally distributed. Wherever the phenomenon occurs, a fundamentally\nimpartial morality is under pressure to redistribute resources from\nthe richer to the poorer.\n\nHowever, there are also contingent but pervasive facts about human\nbeings that pull in favor of practices that have the foreseen\nconsequence of material inequality. First of all, higher levels of\noverall welfare can require higher levels of productivity (think of\nthe welfare gains resulting from improvements in agricultural\nproductivity). In many areas of the economy, the provision of material\nrewards for greater productivity seems the most efficient acceptable\nway of eliciting higher productivity. Some individuals and groups will\nbe more productive than others (especially if there are incentive\nschemes). So the practice of providing material rewards for greater\nproductivity will result in material inequality.\n\nThus, on the one hand, the diminishing marginal utility of material\nresources exerts pressure in favor of more equal distributions of\nresources. On the other hand, the need to promote productivity exerts\npressure in favor of incentive schemes that have the foreseen\nconsequence of material inequality. Utilitarians and most other\nconsequentialists find themselves balancing these opposed\npressures.\n\nNote that those pressures concern the distribution of resources. There\nis a further question about how equally welfare itself should be\ndistributed. Many recent writers have taken utilitarianism to be\nindifferent about the distribution of welfare. Imagine a choice\nbetween an outcome where overall welfare is large but distributed\nunequally and an outcome where overall welfare is smaller but\ndistributed equally. Utilitarians are taken to favor outcomes with\ngreater overall welfare even if it is also less equally\ndistributed.\n\nTo illustrate this, let us take an artificially simple population,\ndivided into just two groups.\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 1\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n10\n1,000,000\n  \n\n \n \n \nImpartially calculated: 1,010,000  \n\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 2\nPer person\nPer group\n  \n\n10,000 people in group A\n8\n80,000\n  \n\n100,000 people in group B\n9\n900,000\n  \n\n \n \n \nImpartially calculated: 980,000  \n\n\n\nMany people would think Alternative 2 above better than Alternative 1,\nand might think that the comparison between these alternatives shows\nthat there is always pressure in favor of greater equality of\nwelfare.\n\nAs Derek Parfit (1997) in particular has argued, however, we must not\nbe too hasty. Consider the following choice:\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 1\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n10\n1,000,000\n  \n\n \n \n \nImpartially calculated: 1,010,000  \n\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 3\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n1\n100,000\n  \n\n \n \n \nImpartially calculated: 110,000  \n\n\n\nIs equality of welfare so important that Alternative 3 is superior to\nAlternative 1? To take an example of Parfit’s, suppose the only\nway to make everyone equal with respect to sight is to make everyone\ntotally blind. Is such “levelling down” required by\nmorality? Indeed, is it in any way at all morally desirable?\n\nIf we think the answer is No, then we might think that equality of\nwelfare as such is not really an ideal (cf. Temkin 1993). Losses to\nthe better off are justified only where this benefits the worse off.\nWhat we had thought of as pressure in favor of equality of welfare was\ninstead pressure in favor of levelling up. We might say that additions\nto welfare matter more the worse off the person is whose welfare is\naffected. This view has come to be called prioritarianism\n(Parfit 1997; Arneson 1999b). It has tremendous intuitive appeal.\n\nFor a simplistic example of how prioritarianism might work, suppose\nthe welfare of the worst off counts five times as much as the welfare\nof the better off. Then Alternative 1 from the tables above comes out\nat:\n\n \\((1 \\times 5 \\times 10,000) + (10 \\times 100,000)\\),\n\n\nwhich comes to 1,050,000 total units of welfare. Again with the\nwelfare of the worst off counting five times as much, Alternative 2\ncomes out at:\n \n\\((8 \\times 5 \\times 10,000) + (9 \\times 100,000)\\),\n\n\nwhich comes to 1,300,000 total units of welfare. This accords with the\ncommon reaction that Alternative 2 is morally superior to Alternative\n1.\n\nOf course in real examples there is never only one division in\nsociety. Rather there is a scale from the worst off, to the not quite\nso badly off, and so on up to the best off. Prioritarianism is\ncommitted to variable levels of importance of benefitting people at\ndifferent places on this scale: the worse off a person is, the greater\nthe importance attached to that person’s gain.\n\nThis raises two serious worries about prioritarianism. The first\nconcerns prioritarianism’s difficulty in nonarbitrarily\ndetermining how much more importance to give to the welfare of the\nworse off. For example, should a unit of benefit to the worst off\ncount 10 times more than the same size benefit to the best off and 5\ntimes more than the same size benefit to the averagely well off? Or\nshould the multipliers be 20 and 10, or 4 and 2, or other amounts? The\nsecond worry about prioritarianism is whether attaching greater\nimportance to increases in welfare for some than to the same size\nincreases in welfare for others contradicts fundamental impartiality\n(Hooker 2000: 60–2).\n\nThis is not the place to go further into debates between\nprioritarianism and its critics. So the rest of this article sets\naside those debates.\n4. Full Rule-consequentialism\n\nConsequentialists have distinguished three components of their theory:\n(1) their thesis about what makes acts morally wrong, (2) their thesis\nabout the procedure agents should use to make their moral decisions,\nand (3) their thesis about the conditions under which moral sanctions\nsuch as blame, guilt, and praise are appropriate.\n\nWhat we might call full rule-consequentialism consists of\nrule-consequentialist criteria for all three. Thus, full\nrule-consequentialism claims that an act is morally wrong if and only\nif it is forbidden by rules justified by their consequences. It also\nclaims that agents should do their moral decision-making in terms of\nrules justified by their consequences. And it claims that the\nconditions under which moral sanctions should be applied are\ndetermined by rules justified by their consequences.\n\nFull rule-consequentialists may think that there is really only one\nset of rules about these three different subject matters. Or they may\nthink that there are different sets that in some sense correspond to\nor complement one another.\n\nMuch more important than the distinction between different kinds of\nfull rule-consequentialism is the distinction between full\nrule-consequentialism and partial rule-consequentialism.\nPartial rule-consequentialism might take many forms. Let us focus on\nthe most common form. The most common form of partial\nrule-consequentialism claims that agents should make their moral\ndecisions about what to do by reference to rules justified by their\nconsequences, but does not claim that moral wrongness is determined by\nrules justified by their consequences. Partial rule-consequentialists\ntypically subscribe to the theory that moral wrongness is determined\ndirectly in terms of the consequences of the act compared to the\nconsequences of alternative possible acts. This theory of wrongness is\ncalled act-consequentialism.\n\nDistinguishing between full and partial rule-consequentialism\nclarifies the contrast between act-consequentialism and\nrule-consequentialism. Act-consequentialism is best conceived of as\nmaintaining merely the following:\n\nAct-consequentialist criterion of wrongness: An act is wrong if and\nonly if it results in less good than would have resulted from some\navailable alternative act.\n\n\nWhen confronted with that criterion of moral wrongness, many people\nnaturally assume that the way to decide what to do is to apply the\ncriterion, i.e.,\n\nAct-consequentialist moral decision procedure: On each occasion, an\nagent should decide what to do by calculating which act would produce\nthe most good.\n\n\nHowever, consequentialists nearly never defend this\nact-consequentialist decision procedure as a general and typical way\nof making moral decisions (Mill 1861: ch 2; Sidgwick 1907:\n405–6, 413, 489–90; Moore 1903: 162–4; Smart 1956:\n346; 1973: 43, 71; Bales 1971: 257–65; Hare 1981; Parfit 1984:\n24–9, 31–43; Railton 1984: 140–6, 152–3; Brink\n1989: 216–7, 256–62, 274–6; Pettit and Brennan 1986;\nPettit 1991, 1994, 1997: 156–61, 2017; de Lazari-Radek and\nSinger 2014: ch. 10). There are a number of compelling\nconsequentialist reasons why the act-consequentialist decision\nprocedure would be counter-productive.\n\nFirst, very often the agent does not have detailed information about\nwhat the consequences would be of various acts.\n\nSecond, obtaining such information would often involve greater costs\nthan are at stake in the decision to be made.\n\nThird, even if the agent had the information needed to make\ncalculations, the agent might make mistakes in the calculations. (This\nis especially likely when the agent’s natural biases intrude, or\nwhen the calculations are complex, or when they have to be made in a\nhurry.)\n\nFourth, there are what we might call expectation effects. Imagine a\nsociety in which people know that others are naturally biased towards\nthemselves and towards their loved ones but are trying to make their\nevery moral decision by calculating overall good. In such a society,\neach person might well fear that others will go around breaking\npromises, stealing, lying, and even assaulting whenever they convinced\nthemselves that such acts would produce the greatest overall good\n(Woodard 2019: 149). In such a society, people would not feel they\ncould trust one another.\n\nThis fourth consideration is more controversial than the first three.\nFor example, Hodgson 1967, Hospers 1972, and Harsanyi 1982 argue that\ntrust would break down. Singer 1972 and Lewis 1972 argue that it would\nnot.\n\nNevertheless, most philosophers accept that, for all four of the\nreasons above, using an act-consequentialist decision procedure would\nnot maximize the good. Hence even philosophers who espouse the\nact-consequentialist criterion of moral wrongness reject the\nact-consequentialist moral decision procedure. In its place, they\ntypically advocate the following:\n\nRule-consequentialist decision procedure: At least normally, agents\nshould decide what to do by applying rules whose acceptance will\nproduce the best consequences, rules such as “Don’t harm\ninnocent others”, “Don’t steal or vandalize\nothers’ property”, “Don’t break your\npromises”, “Don’t lie”, “Pay special\nattention to the needs of your family and friends”, “Do\ngood for others generally”.\n\n\nSince act-consequentialists about the criterion of wrongness typically\naccept this decision procedure, act-consequentialists are in fact\npartial rule-consequentialists. Often, what writers refer to as\nindirect consequentialism is this combination of act-consequentialism\nabout wrongness and rule-consequentialism about the appropriate\ndecision procedure.\n\nStandardly, the decision procedure that full rule-consequentialism\nendorses is the one that it would be best for society to\naccept. The qualification “standardly” is needed because\nthere are versions of rule-consequentialism that let the rules be\nrelativised to small groups or even individuals (D. Miller 2010; Kahn\n2012). And act-consequentialism insists upon the decision procedure it\nwould be best for the individual to accept. So, according to\nact-consequentialism, since Jack’s and Jill’s capacities\nand situations may be very different, the best decision procedure for\nJack to accept may be different from the best decision procedure for\nJill to accept. However, in practice act-consequentialists typically\nignore for the most part such differences and endorse the above\nrule-consequentialist decision procedure (Hare 1981, chs. 2, 3, 8, 9,\n11; Levy 2000).\n\nWhen act-consequentialists endorse the above rule-consequentialist\ndecision procedure, they acknowledge that following this decision\nprocedure does not guarantee that we will do the act with the best\nconsequences. Sometimes, for example, our following a decision\nprocedure that rules out harming an innocent person will prevent us\nfrom doing that act that would produce the best consequences.\nSimilarly, there will be some circumstances in which stealing,\nbreaking our promises, etc., would produce the best consequences.\nStill, our following a decision procedure that generally rules out\nsuch acts will in the long run and on the whole probably produce far\nbetter consequences than our trying to run consequentialist\ncalculations on an act-by-act basis.\n\nBecause act-consequentialists typically agree with a\nrule-consequentialist decision procedure, whether to classify some\nphilosopher as an act-consequentialist or as a rule-consequentialist\ncan be problematic. For example, G.E. Moore (1903, 1912) is sometimes\nclassified as an act-consequentialist and sometimes as a\nrule-consequentialist. Like so many others, including his teacher\nHenry Sidgwick, Moore combined an act-consequentialist criterion of\nmoral wrongness with a rule-consequentialist procedure for deciding\nwhat to do. Moore simply went further than most in stressing the\ndanger of departing from the rule-consequentialist decision procedure\n(see Shaw 2000). Hare (1981) and Pettit (1991, 1994, 1997) have also\nbeen especially influential act-consequentialists about what makes\nacts right or wrong while holding that everyday decision-making should\nbe conducted in terms of familiar rules focused on things other than\nconsequences.\n5. Global Consequentialism\n\nSome writers propose that the purest and most consistent form of\nconsequentialism is the view that absolutely everything should be\nassessed by its consequences, including not only acts but also rules,\nmotives, the imposition of sanctions, etc. Let us follow Pettit and\nSmith (2000) in referring to this view as global\nconsequentialism. Kagan (2000) pictures it as multi-dimensional direct\nconsequentialism, in that each thing is assessed directly in terms of\nwhether its own consequences are as good as the consequences of\nalternatives.\n\nHow does this global consequentialism differ from what we have been\ncalling partial rule-consequentialism? What we have been calling\npartial rule-consequentialism is nothing but the combination of the\nact-consequentialist criterion of moral wrongness with the\nrule-consequentialist decision procedure. So defined, partial\nrule-consequentialism leaves open the question of when moral sanctions\nare appropriate.\n\nSome partial rule-consequentialists say that agents should be blamed\nand feel guilty whenever they fail to choose an act that would result\nin the best consequences. A much more reasonable position for a\npartial rule-consequentialist to take is that agents should be blamed\nand feel guilty whenever they choose an act that is forbidden by the\nrule-consequentialist decision procedure, whether or not that\nindividual act fails to result in the best consequences. Finally,\npartial rule-consequentialism, as we have defined it, is compatible\nwith the claim that whether agents should be blamed or feel guilty\ndepends not on the wrongness of what they did, nor on whether the\nrecommended procedure for making moral decisions would have led them\nto choose the act they choose, but instead solely on whether this\nblame or guilt will do any good. This is precisely the view of\nsanctions that global consequentialism takes.\n\nOne objection to global consequentialism is that simultaneously\napplying a consequentialist criterion to acts, decision procedures,\nand the imposition of sanctions leads to apparent paradoxes (Crisp\n1992; Streumer 2003; Lang 2004).\n\nSuppose, on the whole and in the long run, the best decision procedure\nfor you to accept is one that leads you to do act x now. But\nsuppose also that in fact the act with the best consequences in this\nsituation is not x but y. So global consequentialism\ntells you (a) to use the best possible decision procedure but also (b)\nnot to do the act picked out by this decision procedure. That seems\nparadoxical.\n\nThings get worse when we consider blame and guilt. Suppose you follow\nthe best possible decision procedure but fail to do the act with the\nbest consequences. Are you to be blamed? Should you feel guilty?\nGlobal consequentialism claims that you should be blamed if and only\nif blaming you will produce the best consequences, and that you should\nfeel guilty if and only if this will produce the best consequences.\nSuppose that for some reason the best consequences would result from\nblaming you for following the prescribed decision procedure (and thus\ndoing x). But surely it is paradoxical for a moral theory to\ncall for you to be blamed although you followed the moral decision\nprocedure mandated by the theory. Or suppose that for some reason the\nbest consequences would result from blaming you for intentionally\nchoosing the act with the best consequences (y). Again,\nsurely it is paradoxical for a moral theory to call for you to be\nblamed although you intentionally chose the very act required by the\ntheory.\n\nSo one problem with global consequentialism is that it creates\npotential gaps between what acts it claims to be required and what\ndecision procedures it tells agents to use, and between each of these\nand blamelessness. (For explicit replies to this line of attack, see\nDriver 2014: 175 and de Lazari-Radek and Singer 2014:\n315–16.)\n\nThat is not the most familiar problem with global consequentialism.\nThe most familiar problem with it is instead its maximising\nact-consequentialist criterion of wrongness. According to this\nmaximising criterion, an act is wrong if and only if it fails to\nresult in the greatest good. This criterion judges some acts to be not\nwrong which certainly seem to be wrong. It also judges some acts that\nseem not wrong to be wrong.\n\nFor example, consider an act of murder that results in slightly more\ngood than any other act would have produced. According to the most\nfamiliar, maximising act-consequentialist criterion of wrongness, this\nact of murder is not wrong. Many other kinds of act such as\nassaulting, stealing, promise breaking, and lying can be wrong even\nwhen doing them would produce slightly more good than not doing them\nwould. Again, the familiar, maximising form of act-consequentialism\ndenies this.\n\nOr consider someone who gives to her child, or keeps for herself, some\nresource of her own instead of contributing it to help some stranger\nwho would have gained slightly more from that resource. Such an action\nhardly seems wrong. Yet the maximising act-consequentialist criterion\njudges it to be wrong. Indeed, imagine how much self-sacrifice an\naveragely well-off person would have to make before her further\nactions satisfied the maximising act-consequentialist criterion of\nwrongness. She would have to give to the point where further\nsacrifices from her in order to benefit others would harm her more\nthan they would benefit the others. Thus, the maximising\nact-consequentialist criterion of wrongness is often accused of being\nunreasonably demanding.\n\nThe objections just directed at maximising act-consequentialism could\nbe side-stepped by a version of act-consequentialism that did not\nrequire maximising the good. This sort of act-consequentialism is now\ncalled satisficing consequentialism. See the entry on\n consequentialism/\n for more on such a theory.\n6. Formulating Full Rule-consequentialism\n\nThere are a number of different ways of formulating\nrule-consequentialism. For example, it can be formulated in terms of\nthe good that actually results from rules or in terms of the\nrationally expected good of the consequences of rules. It can be\nformulated in terms of the consequences of compliance with rules or in\nterms of the wider consequences of acceptance of rules. It can be\nformulated in terms of the consequences of absolutely everyone’s\naccepting the rules or in terms of the rules’ acceptance by\nsomething less than everyone. Rule-consequentialism can also be\nformulated in terms of the teaching of a code to everyone in the next\ngeneration, in the full realization that the degrees of resulting\nacceptance will vary (Mulgan 2006, 2017, 2020; D. Miller 2014, 2021;\nT. Miller 2016, 2021). Rule-consequentialism is more plausible if\nformulated in some ways than it is if formulated in other ways. This\nis explained in the following three subsections. Questions of\nformulation are also relevant in later sections on objections to\nrule-consequentialism.\n6.1 Actual versus Expected Good\n\nAs indicated, full rule-consequentialism consists in\nrule-consequentialist answers to three questions. The first is, what\nmakes acts morally wrong? The second is, what procedure should agents\nuse to make their moral decisions? The third is, what are the\nconditions under which moral sanctions such as blame, guilt, and\npraise are appropriate?\n\nAs we have seen, the answer that full rule-consequentialists give to\nthe question about decision procedure is much like the answer that\nother kinds of consequentialist give to that question. So let us focus\non the points of contrast, i.e., the other two questions. These two\nquestions — about what makes acts wrong and about when sanctions\nare appropriate — are more tightly connected than sometimes\nrealized.\n\nIndeed, J.S. Mill, one of the fathers of consequentialism, affirmed\ntheir tight connection:\n\nWe do not call anything wrong, unless we mean to imply that a person\nought to be punished in some way or other for doing it; if not by law,\nby the opinion of his fellow creatures; if not by opinion, by the\nreproaches of his own conscience. (1861: ch. 5, para. 14)\n\n\nLet us assume that Mill took “ought to be punished, at least by\none’s own conscience if not by others” to be roughly the\nsame as “blameworthy”. With this assumption in hand, we\ncan interpret Mill as tying wrongness tightly to blameworthiness. In a\nmoment, we can consider what follows if Mill is mistaken that\nwrongness is tied tightly to blameworthiness. First, let us consider\nwhat follows if Mill is correct that wrongness is tied tightly to\nblameworthiness.\n\nConsider the following argument, whose first premise comes from\nMill:\n\nIf an act is wrong, it is blameworthy.\n\n\nSurely, an agent cannot rightly be blamed for accepting and following\nrules that the agent could not foresee would have sub-optimal\nconsequences. From this, we get our second premise:\n\nIf an act is blameworthy, the sub-optimal consequences of rules\nallowing that act must have been foreseeable.\n\n\nFrom these two premises we get the conclusion:\n\nSo if an act is wrong, the sub-optimal consequences of rules allowing\nthat act must have been foreseeable.\n\n\nOf course, the actual consequences of accepting a set of rules may not\nbe the same as the foreseeable consequences of accepting that set.\nHence, if full rule-consequentialism claims that an act is wrong if\nand only if the foreseeable consequences of rules allowing\nthat act are sub-optimal, rule-consequentialism cannot also hold that\nan act is wrong if and only if the actual consequences of\nrules allowing that act will be sub-optimal.\n\nNow suppose instead the relation between wrongness and blameworthiness\nis far looser than Mill suggested (cf. Sorensen 1996). That is,\nsuppose that our criterion of wrongness can be quite different from\nour criterion of blameworthiness. In that case, we could hold:\n\nActualist rule-consequentialist criterion of\nwrongness: An act is wrong if and only if it is forbidden by\nrules that would actually result in the greatest good.\n\n\nand\n\nExpectablist rule-consequentialist criterion of\nblameworthiness: An act is blameworthy if and only if it is\nforbidden by the rules that would foreseeably result in the\ngreatest good.\n\n\nLet us replace “foreseeably result in the greatest good”\nwith “result in the greatest expected good”. Here is how\nexpected good of a set of rules is calculated. Suppose we can identify\nthe value or disvalue of each possible outcome a set of rules might\nhave. Multiply the value of each possible outcome by the probability\nof that outcome’s occurring. Take all the products of these\nmultiplications and add them together. The resulting number quantifies\nthe expected good of that set of rules.\n\nExpected good is not to be calculated by employing whatever crazy\nestimates of probabilities people might assign to possible outcomes.\nRather, expected good is calculated by multiplying the value or\ndisvalue of possible outcomes by rational or\njustified probability estimates.\n\nDifferent agents have different evidence and thus have different\nrational and justified probability estimates. Such differences are\nsometimes exactly what explains disagreements about what changes to an\nextant moral code would be improvements. In some cases of\ndisagreements, the cause of such disagreement is that at least one of\nthe parties is not aware of, or has not fully assimilated, evidence\nthat is available. Expectablist rule-consequentialist would likely\nwant to tie rational or justified probability estimates to the\nevidence that is available at the time, even if some people are not\naware of it or have not fully appreciated its implications.\n\nThere might be considerable scepticism about how calculations of\nexpected good are even possible (Lenman 2000). Even where such\ncalculations are possible, they will often be quite impressionistic\nand imprecise. Nevertheless, we can reasonably hope to make at least\nsome informed judgements about the likely\nconsequences of alternative possible rules (Burch-Brown 2014). And we\ncould be guided by such judgements, as legislators often say they are.\nIn contrast, which rules would actually have the very\nbest consequences will normally be inaccessible. Hence, the\nexpectablist rule-consequentialist criterion of blameworthiness is\nappealing.\n\nNow return to the proposal that, while the criterion of\nblameworthiness is the expectablist rule-consequentialist one, the\ncorrect criterion of moral wrongness is the actualist\nrule-consequentialist one. This proposal rejects Mill’s move of\ntying moral wrongness to blameworthiness. There is, however, a very\nstrong objection to this proposal. What is the role and importance of\nmoral wrongness if it is disassociated from blameworthiness?\n\nIn order to retain an obvious role and importance for moral wrongness,\nthose committed to the expectablist rule-consequentialist criterion\nof blameworthiness are likely to endorse:\n\nSimple expectablist rule-consequentialist criterion of moral\nwrongness: An act is morally wrong if and only if it is forbidden by\nthe rules that would result in the greatest expected good.\n\n\nIndeed, once we have before us the distinction between (a) the amount\nof value that actually results and (b) the rationally\nexpected good, the full rule-consequentialist is likely to go\nfor expectablist criteria of moral wrongness, blameworthiness, and\ndecision procedures.\n\nWhat if, as far as we can tell, no one code has greater expected value\nthan its rivals? We will need to amend our expectablist criteria in\norder to accommodate this possibility:\n\nSophisticated expectablist rule-consequentialist criterion of\nmoral wrongness: An act is morally wrong if and only if it is\nforbidden either by the rules that would result in the greatest\nexpected good, or, if two or more alternative codes of rules\nare equally best in terms of expected good, by the one of these codes\nclosest to conventional morality.\n\n\nThe argument for using closeness to conventional morality to break\nties between otherwise equally promising codes begins with the\nobservation that social change regularly has unexpected consequences.\nAnd these unexpected consequences usually seem to be negative.\nFurthermore, the greater the difference between a new code and the one\nalready conventionally accepted, the greater the scope for unexpected\nconsequences. So, as between two codes we judge to have equally high\nexpected value, we should choose the one closest to the one we already\nknow. (For discussion of the situation where two codes have equally\nhigh expected value and seem equally close to conventional morality,\nsee Hooker 2008: 83–4.)\n\nAn implication is that people should make changes to the status quo\nwhere but only where these changes have greater expected value than\nsticking with the status quo. Rule-consequentialism manifestly has the\ncapacity to recommend change. But it does not favor change for the\nsake of change.\n\nRule-consequentialism most definitely does need to be formulated so as\nto deal with ties in expected value. However, for most of the rest of\nthis article, I will ignore this complication.\n6.2 Compliance and Acceptance\n\nThere are other important issues of formulation that\nrule-consequentialists face. One is the issue of whether\nrule-consequentialism should be formulated in terms of compliance with\nrules, in terms of acceptance of rules, or in terms of the teaching of\nrules. Admittedly, the most important consequence of teaching and\naccepting rules is compliance with them. And early formulations of\nrule-consequentialism did indeed explicitly mention compliance. For\nexample, they said an act is morally wrong if and only if it is\nforbidden by rules the compliance with which will maximize\nthe good (or the expected good). (See Austin 1832; Brandt 1959; M.\nSinger 1955, 1961.)\n\nHowever, acceptance of a rule can have consequences other than\ncompliance with the rule. As Kagan (2000: 139) writes, “once\nembedded, rules can have an impact on results that is independent of\ntheir impact on acts: it might be, say, that merely thinking about a\nset of rules reassures people, and so contributes to happiness.”\n(For more on what we might call these ‘beyond-compliance\nconsequences’ of rules, see Sidgwick 1907: 405–6, 413;\nLyons 1965: 140; Williams 1973: 119–20, 122, 129–30; Adams\n1976: 470; Scanlon 1998: 203–4; Kagan 1998: 227–34.)\n\nThese consequences of acceptance of rules should most definitely be\npart of a cost-benefit analysis of rules. Formulating\nrule-consequentialism in terms of the consequences of acceptance\nallows them to be part of this analysis. Important consequences of\ncommunal acceptance of a set of rules include assurance, incentive,\nand deterrent effects. And consideration of assurance and incentive\neffects has played a large role in the development of\nrule-consequentialism (Harsanyi 1977, 1982: 56–61; 1993:\n116–18; Brandt 1979: 271–77; 1988: 346ff [1992: 142ff.];\n1996: 126, 144; Johnson 1991, especially chs. 3, 4, 9). Hence, we\nshould not be surprised that rule-consequentialism has gone from being\nformulated in terms of compliance with rules to being formulated in\nterms of acceptance of rules.\n\nHowever, just as we need to move from thinking about the consequences\nof compliance to thinking about the wider consequences of acceptance,\nwe need to go further. Focusing purely on the consequences of\nacceptance of rules ignores the “transition” costs for the\nteachers of teaching those rules, and the costs to the\nteaching’s recipients of internalizing these rules. And yet\nthese costs can certainly be significant (Brandt 1963: section 4; 1967\n[1992: 126]; 1983: 98; 1988: 346–47, 349–50 [1992:\n140–143, 144–47]; 1996: 126–28, 145, 148, 152,\n223).\n\nSuppose, for example, that, once a fairly simple and relatively\nundemanding code of rules Code A has been accepted, the\nexpected value of Code A would be n. Suppose a more\ncomplicated and demanding alternative Code B would have an\nexpected value of \\(n + 5\\) once Code B has been accepted. So\nif we just consider the expected values of acceptance of the two\nalternative codes, Code B wins.\n\nBut now let us factor into our cost/benefit analysis of rival codes\nthe relative costs of teaching the two codes and of getting them\ninternalized by new generations. Since Code A is fairly\nsimple and relatively undemanding, the cost of getting it internalized\nis −1. Since Code B is more complicated and demanding,\nthe cost of getting it internalized is −7. So if our comparison\nof the two codes considers the respective costs of getting them\ninternalized, Code A’s expected value is \\(n-1\\), and\nCode B’s is \\(n+5-7\\). Once we include the respective\ncosts of getting the codes internalized, Code A wins.\n\nAs indicated, the costs of teaching a code successfully, so that the\ncode is very widely internalized, are “transition costs”.\nBut of course such transitions are always to one arrangement from\nanother. The arrangement we are imagining the transition being\nto is the acceptance of a certain proposed code. The\narrangement we are imagining the transition being from is\n… well, what?\n\nOne answer is that the arrangement from which the transition is\nsupposed to be starting is whatever moral code the society happens to\naccept already. That might seem like the natural answer. However,\nthere is a strong objection to this answer, namely that\nrule-consequentialism should not let the cost/benefit analysis of a\nproposed code be influenced by the costs of getting people to give up\nwhatever rules they may have already internalised. This is for two\nreasons.\n\nMost importantly, rule-consequentialist assessment of codes needs to\navoid giving weight directly or indirectly to moral ideas that have\ntheir source in other moral theories but not in rule-consequentialism\nitself. Suppose people in a given society were brought up to believe\nthat women should be subservient to men. Should rule-consequentialist\nevaluation of a proposed non-sexist code have to count the costs of\ngetting people to give up the sexist rules they have already\ninternalised so as to accept the new, non-sexist ones? Since the\nsexist rules are unjustifiable, that they were accepted should not be\nallowed to infect rule-consequentialist assessment.\n\nAnother reason for rejecting the answer we are considering is that it\nthreatens to underwrite an unattractive relativism. Different\nsocieties may differ considerably in their extant moral beliefs. Thus,\na way of assessing proposed codes that considers the costs of getting\npeople already committed to some other code will end up having to\ncountenance different transition costs to get to the same code. For\nexample, the transition costs to a non-racist code are much higher\nfrom an already accepted racist code than from an already accepted\nnon-racist one. Formulating rule-consequentialism so that it endorses\nthe same code for 1960s Michigan as for 1960s Mississippi is\ndesirable. (For opposing arguments that rule-consequentialism should\nbe formulated so as to coutenance social relativism, see Kahn 2012; D.\nMiller 2014, 2021; T. Miller 2021.)\n\nA way to avoid ending up with the social relativism just identified is\nto formulate rule-consequentialism in terms of acceptance by new\ngenerations of humans. The proposal might be that we compare the\nrespective “teaching costs” of alternative codes, on the\nassumption that these codes will be taught to new generations of\nchildren, i.e., children who have not already been educated to accept\na moral code. We are to imagine the children start off with natural\n(non-moral) inclinations to be very partial towards themselves and a\nfew others. We should also assume that there is a cognitive cost\nassociated with the learning of each rule.\n\nThese are realistic assumptions, with big implications. One is that a\ncost/benefit analysis of alternative codes of rules would have reason\nto favor simpler codes over more complex ones. Of course there can\nalso be benefits from having more, or more complicated, rules. Yet\nthere is probably a limit on how complicated or complex a code can be\nand still have greater expected value than simpler codes, once\nteaching costs are included.\n\nAnother implication concerns prospective rules about making sacrifices\nto help others. Since children start off focused on their own\ngratifications, getting them to internalize a kind of impartiality\nthat requires them to make large sacrifices repeatedly for the sake of\nothers would have extremely high costs. There would also, of course,\nbe enormous benefits from the internalization of such a rule —\npredominately, benefits to others. Would the benefits be greater than\nthe costs? At least since Sidgwick (1907: 434), many utilitarians have\ntaken for granted that human nature is such that the real\npossibilities are (1) that human beings care passionately about some\nand less about each of the rest of humanity or (2) that human beings\ncare weakly but impartially about everyone. In other words, what is\nnot a realistic possibility, according to this view of human nature,\nis human beings’ caring strongly and impartially about everyone\nin the world. If this view of human nature is correct, then one\nenormous cost of successfully making people completely impartial is\nthat doing so would leave them with only weak concerns.\n\nEven if that picture of human nature is not correct, that is, even if\nmaking people completely impartial could be achieved without draining\nthem of enthusiasm and passion, the cost of successfully making people\ncare as much about every other individual as they do about themselves\nwould be prohibitive. At some point on the spectrum running from\ncomplete partiality to complete impartiality, the costs of pushing and\ninducing everyone further along the spectrum outweigh the\nbenefits.\n\nA complication worth mentioning comes from the obvious point that\nmoral education is developmental. How many rules are to be taught to\nchildren, how complicated these rules are, how demanding the rules\nare, and how to resolve conflicts among the rules depend on the\ndevelopmental stage of the children. Hence, there can be conflict\nbetween the simpler and less demanding rules taught to the very young\nand the more elaborate, nuanced, and demanding rules taught at higher\ndevelopmental stages. Of course, rule-consequentialism is best\nformulated in terms of the rules featured in the end of the\ndevelopment rather than the ones figuring in earlier stages.\n6.3 Complete Acceptance versus Incomplete Acceptance\n\nWhile rule-consequentialist cost/benefit analyses of codes should\ncount the cost of getting those codes internalised by new generations,\nsuch analyses should acknowledge that the internalisation will not be\nachieved in every last person (D. Miller 2021: 130). No matter how\ngood the teaching is, the results will be imperfect. Some people will\nlearn rules that differ to some degree from the ones that were taught,\nand some of these people will end up with very mistaken views about\nwhat is morally required, morally optional, or morally wrong. Other\npeople will end up with insufficient moral motivation. Other people\nwill end up with no moral motivation at all (psychopaths).\nRule-consequentialism needs to have rules for coping with the\ninevitably imperfect results of moral teaching.\n\nSuch rules will crucially include rules about punishment. From a\nrule-consequentialist point of view, one point of punishment is to\ndeter certain kinds of act. Another point of punishment is to get\nundeterred, dangerous people off the streets. Perhaps\nrule-consequentialism can admit that another point of punishment is to\nappease the primitive lust for revenge on the part of victims of such\nacts and their family and friends. Finally, there is the expressive\nand reinforcing power of rules about punishment.\n\nSome ways of formulating rule-consequentialism make having rules about\npunishment difficult to explain. One such way of formulating\nrule-consequentialism is:\n\nAn act is morally wrong if and only if it is prohibited by the code of\nrules the full acceptance of which by absolutely everyone would\nproduce the greatest expected good.\n\n\nImagine a world in which absolutely every adult human fully accepts\nrules forbidding (for example) physical attacks on the innocent,\nstealing, promise breaking, and lying. Suppose these rules have been\ninternalized so deeply by everyone in this world that in this world\nthere is complete compliance with these rules. Also assume that, if\neveryone in this world always complies with these rules, this perfect\ncompliance becomes common knowledge. In this world, there would be\nlittle or no need for rules about punishment and thus little or no\nbenefit from having such rules. But there are teaching and\ninternalization costs associated with each rule taught and\ninternalized. So there are teaching and internalization costs\nassociated with the inclusion of any rule about punishment. The\ncombination of costs without benefits is repellant. Therefore, for a\nworld of complete compliance, the version of rule-consequentialism\nimmediately above would not endorse rules about punishment.\n\nWe need a form of rule-consequentialism that includes rules for\ndealing with people who are not committed to the right rules, indeed\neven for people who are irredeemable. In other words,\nrule-consequentialism needs to be formulated so as to conceptualize\nsociety as containing some people insufficiently committed to the\nright rules, and even some people not committed to any moral rules.\nHere is a way of doing so:\n\nAn act is wrong if and only if it is prohibited by a code of rules the\nacceptance of which by the overwhelming majority of people in each new\ngeneration would have the greatest expected value.\n\n\nNote that rule-consequentialism neither endorses nor condones the\nnon-acceptance of the code by those outside the overwhelming majority.\nOn the contrary, rule-consequentialism claims those people are morally\nmistaken. Indeed, the whole point of formulating rule-consequentialism\nthis way is to make room for rules about how to respond negatively to\nsuch people.\n\nOf course, the term “overwhelming majority” is very\nimprecise. Suppose we remove the imprecision by picking a precise\npercentage of society, say 90%. Picking any precise percentage as an\nobvious element of arbitrariness to it. For example, if we pick 90%,\nwhy not 89% or 91%?\n\nPerhaps, we can argue for a number in the range of 90% as a reasonable\ncompromise between two pressures. On the one hand, the percentage we\npick should be close enough to 100% to retain the idea that, ideally,\nmoral rules would be accepted by everyone. On the other hand, the\npercentage needs to be far enough short of 100% to leave considerable\nscope for rules about punishment. It seems that 90% is in a defensible\nrange, given the need to balance those considerations. (For dissent\nfrom this, see Ridge 2006; for a reply to Ridge, see Hooker and\nFletcher 2008. The matter receives further discussion in H. Smith\n2010; Tobia 2013, 2018; T. Miller 2014, 2021; Toppinen 2016; Portmore\n2017; Yeo 2017; Podgorski 2018; Perl 2021.)\n\nHolly Smith (2010) pointed out that a cost/benefit analysis of the\nacceptance of any particular code by a positive percentage of the\npopulation less than 100% depends on what the rest of the population\naccepts and is disposed to do. Consider the following contrast. One\nimagined scenario is that 90% of the population accept one code, and\nthe other 10% accept a very similar code, such that the two codes\nrarely diverge in practice. A second imagined scenario is that 90% of\nthe population accept one code, and the other 10% accept various codes\nthat frequently and dramatically conflict in practice with code\naccepted by 90%. Conflict resolution and enforcement are less\nimportant in the first imagined scenario than in the second. Hence, if\nrule-consequentialism is formulated in terms of the acceptance of a\ncode by less than 100% of people, it matters what assumptions are made\nabout whatever percentage of the population do not accept this\ncode.\n\nSome theorists propose that formulating rule-consequentialism in terms\nof the code the teaching of which has the greatest expected value is\nsuperior to formulating the theory in terms of either a fixed or\nvariable acceptance rate for codes (Mulgan 2006, 141, 147; 2017, 291;\n2020, 12–21; T. Miller 2016; 2021; D. Miller 2021). A\n“teaching formulation” of rule-consequentialism holds:\n\nAn act is morally prohibited, obligatory, or optional if and only if\nand because it is prohibited, obligatory, or permitted by the code of\nrules the teaching of which to everyone has at least as much expected\nvalue as the teaching of any other code.\n\nTwo clarifications are needed immediately. First,\n“everyone” here needs to be qualified so as not to include\npeople “with significant, cognitive, or conative deficits”\n(D. Miller 2021: 10). Second, teaching a code to everyone is not\nassumed to lead to everyone’s internalization of this code.\nHence, even if everyone is taught a certain code, foreseeably there\nwill be some who internalize rules that are more or less different\nfrom the rules that were taught. There will also be some whose moral\nmotivation is unreliable or even indiscernible. And there will be some\nwho take themselves to be sceptics about moral rules and even about\nthe rest of morality.\n\nThere are some definite advantages of teaching formulations of\nrule-consequentialism. To be sure, we have to build into our\ncost/benefit analysis that enough costs are incurred to make the\nteaching at least partly successful. In other words, we must insist\nthat the teaching be successful enough to get enough people to\ninternalize rules such that a good degree of cooperation and security\nresults. But we do not need to be precise about what percentage of\npeople taught this code remain amoralists, what percentage of people\ntaught this code end up internalizing codes somewhat different from\nthe one being taught, or what percentage end up insufficiently\nmotivated to comply with the moral code they have internalized unless\neffective enforcement is in place (D. Miller 2021; T. Miller\n2021).\n\nAnother advantage of teaching formulations is that the idea of\nteaching a code to everyone connects tightly to the idea that this\ncode should be public knowledge. The idea that a moral code must be\nsuitable for being public knowledge is very appealing (Baier 1958:\n195–196; Rawls 1971: 133; Gert 1998: 10–13, 225,\n239–240; Hill 2005; Cureton 2015; Pettit 2017: 39, 65, 102). And\nrule-consequentialists have championed the idea that moral rules are\nsubject to this “publicity condition” (Brandt 1992: 136,\n144; Hooker 2010; 2016, forthcoming; Parfit 2011, 2017a; D. Miller\n2021: 131–32).\n7. Three Ways of Arguing for Rule-consequentialism\n\nWhat rules will rule-consequentialism endorse? It will endorse rules\nprohibiting physically attacking innocent people, taking or harming\nthe property of others, breaking one’s promises, and lying. It\nwill also endorse rules requiring one to pay special attention to the\nneeds of one’s family and friends, but more generally to be\nwilling to help others with their (morally permissible) projects. A\nsociety where such rules are prominent in a public code would be\nlikely to have more good in it than one lacking such rules.\n\nThe fact that these rules are endorsed by rule-consequentialism makes\nrule-consequentialism attractive. For, intuitively, these rules seem\nright. However, other moral theories endorse these rules as well. Most\nobviously, a familiar kind of moral pluralism contends that these\nintuitively attractive rules constitute the most basic level of\nmorality, i.e., that there is no deeper moral principle underlying and\nunifying these rules. Call this view Rossian pluralism (in honor of\nits champion W.D. Ross (1930, 1939)).\n\nRule-consequentialism may agree with Rossian pluralism in endorsing\nrules against physically attacking the innocent, stealing, promise\nbreaking, and rules requiring various kinds of loyalty and more\ngenerally doing good for others. But rule-consequentialism goes beyond\nRossian pluralism by specifying an underlying unifying principle that\nprovides impartial justification for such rules. Other moral theories\ntry to do this too. Such theories include some forms of Kantianism\n(Audi 2001, 2004) and some forms of contractualism (Scanlon 1998;\nParfit 2011; Levy 2013). In any case, the first way of arguing for\nrule-consequentialism is to argue that it specifies an underlying\nprinciple that provides impartial justification for intuitively\nplausible moral rules, and that no rival theory does this as well\n(Urmson 1953; Brandt 1967; Hospers 1972; Hooker 2000). (Attacks on\nthis line of argument for rule-consequentialism include Stratton-Lake\n1997; Thomas 2000; D. Miller 2000; Montague 2000; Arneson 2005; Moore\n2007; Hills 2010; Levy 2014.)\n\nThis first way of arguing for rule-consequentialism might be seen as\ndrawing on the idea that a theory is better justified to us to the\nextent that it increases coherence within our beliefs (Rawls 1951,\n1971: 19–21, 46–51; DePaul 1987; Ebertz 1993; Sayre-McCord\n1986, 1996). [See the entry on\n coherentist theories of epistemic justification.]\n But the approach might also be seen as moderately foundationalist in\nthat it begins with a set of beliefs (in various moral rules) to which\nit assigns independent credibility though not infallibility (Audi\n1996, 2004; Crisp 2000). [See the entry on\n foundationalist theories of epistemic justification.]\n Admittedly, coherence with our moral beliefs does not make a moral\ntheory true, since our moral beliefs might be mistaken.\nNevertheless, if a moral theory fails significantly to cohere with our\nmoral beliefs, this undermines the theory’s ability to be\njustified to us.\n\nWolf (2016) and Copp (2020) argue that the meta-ethical view that\nmorality is a social practice with a particular function might lead us\nto rule-consequentialism. However, Hooker (forthcoming) contends that\nthe meta-ethical view that morality is a social practice with a\nparticular function stands in need of justification in terms of\nwhether it coheres with our considered moral principles and more\nspecific considered moral judgements. In other words, that\nmeta-ethical view about the function of morality needs to be judged in\nterms of whether it helps us achieve a reflective equilibrium among\nour beliefs or not.\n\nThe second way of arguing for rule-consequentialism is very different.\nIt begins with a commitment to consequentialist assessment. With that\ncommitment as a first premise, the point is then made that assessing\nacts indirectly, e.g., by focusing on the consequences of\ncommunal acceptance of rules, will in fact produce better consequences\nthan assessing acts directly in terms of their own consequences\n(Austin 1832; Brandt 1963, 1979; Harsanyi 1982: 58–60; 1993;\nRiley 2000). After all, making decisions about what to do is the main\npoint of moral assessment of acts. So if a way of morally assessing\nacts is likely to lead to bad decisions, or more generally lead to bad\nconsequences, then, according to a consequentialist point of view, so\nmuch the worse for that way of assessing acts.\n\nEarlier we saw that all consequentialists now accept that assessing\neach act individually by its expected value is in general a terrible\nprocedure for making moral decisions. Agents should decide how to act\nby instead appealing to certain rules such as “don’t\nphysically attack others”, “don’t steal”,\n“don’t break your promises”, “pay special\nattention to the needs of your family and friends”, and\n“be generally helpful to others”. And these are the rules\nthat rule-consequentialism endorses. Many consequentialists, however,\nthink this hardly shows that full rule-consequentialism is the best\nform of consequentialism. Once a distinction is made between, on the\none hand, the best procedure for making moral decisions about what to\ndo and, on the other hand, the criteria of moral rightness and\nwrongness, all consequentialists can admit that we need\nrule-consequentialism’s rules for our decision procedure. But\nconsequentialists who are not rule-consequentialists contend that such\nrules play no role in the criterion of moral rightness. Hence these\nconsequentialists reject what this article has called full\nrule-consequentialism.\n\nHowever, whether the objection we have just been considering to the\nsecond way of arguing for rule-consequentialism is a good objection\ndepends on whether it is legitimate to distinguish between procedures\nappropriate for making moral decisions and the criteria of moral\nrightness or wrongness. That matter remains contentious (Hooker 2010;\nde Lazari-Radek and Singer 2014: ch. 10).\n\nYet the second way of arguing for rule-consequentialism runs into\nanother and quite different objection. This objection is that the\nfirst step in this argument for rule-consequentialism is a commitment\nto consequentialist assessment. This first step itself needs\njustification. Why assume that assessing things in a consequentialist\nway is uniquely justified?\n\nIt might be said that consequentialist assessment is justified because\npromoting the impartial good has an obvious intuitive appeal. But that\nwon’t do, since there are alternatives to consequentialist\nassessment that also have obvious intuitive appeal, for example,\n“act on the code that no one could reasonably reject”.\nWhat we need is a way of arguing for a moral theory that does not\nstart by begging the question which kind of theory is most\nplausible.\n\nA third way of arguing for rule-consequentialism is contractualist\n(Harsanyi 1953, 1955, 1982, 1993; Brandt 1979, 1988, 1996; Scanlon\n1982, 1998; Parfit 2011; Levy 2013). Suppose we can specify reasonable\nconditions under which everyone would choose, or at least would have\nsufficient reason to choose, the same code of rules. Intuitively, such\nan idealized agreement would legitimate that code of rules. Now if\nthose rules are the ones whose internalisation would maximise the\nexpected good, contractualism is leading us to\nrule-consequentialism’s rules.\n\nThere are different views about what would be reasonable conditions\nfor choosing among alternative possible moral rules. One view is that\neveryone’s impartiality would have to be insured by the\nimposition of a hypothetical “veil of ignorance” behind\nwhich no one knew any specific facts about himself or herself\n(Harsanyi 1953, 1955). Another view is that we should imagine that\npeople would be choosing a moral code on the basis of (a) full\nempirical information about the different effects on everyone, (b)\nnormal concerns (self-interested as well as altruistic), and (c)\nroughly equal bargaining power (Brandt 1979; cf. Gert 1998). Parfit\n(2011) proposes seeking rules that everyone has (personal or\nimpartial) reason to choose or will that everyone accept. If impartial\nreasons are always sufficient even when opposed by personal ones, then\neveryone has sufficient reason to will that everyone accept the rules\nwhose universal acceptance will have the best consequences impartially\nconsidered. Similarly, Levy (2013) supposes that no one could\nreasonably reject a code of rules that would impose on her burdens\nthat add up to less than the aggregate of burdens that every other\ncode would impose on others. Such arguments suggest the extensional\nequivalence of contractualism and rule-consequentialism. (For\nassessment of whether Parfit’s contractualist arguments for\nrule-consequentialism succeed, see J. Ross 2009; Nebel 2012; Hooker\n2014. For similarities between rule-consequentialism and\nScanlon’s contractualism, and the difficulty of deciding between\nthese two theories, see Suikkanen 2022.)\n8. Must Rule-consequentialism Be Guilty of Collapse, Incoherence, or Rule-worship?\n\nAn oft-repeated line of objection to rule-consequentialism from the\nmid 1960s to the mid 1990s was that this theory is fatally impaled on\none or the other horn of the following dilemma: Either\nrule-consequentialism collapses into practical equivalence with the\nsimpler act-consequentialism, or rule-consequentialism is\nincoherent.\n\nHere is why some have thought rule-consequentialism collapses into\npractical equivalence with act-consequentialism. Consider a rule that\nrule-consequentialism purports to favor — e.g.,\n“don’t steal”. Now suppose an agent is in some\nsituation where stealing would produce more good than not stealing. If\nrule-consequentialism selects rules on the basis of their expected\ngood, rule-consequentialism seems driven to admit that compliance with\nthe rule “don’t steal except when … or … or\n…” is better than compliance with the simpler rule\n“don’t steal”. This point generalizes. In other\nwords, for every situation where compliance with some rule would not\nproduce the greatest expected good, rule-consequentialism seems driven\nto favor instead compliance with some amended rule that does not miss\nout on producing the greatest expected good in the case at hand. But\nif rule-consequentialism operates this way, then in practice it will\nend up requiring the very same acts that act-consequentialism\nrequires.\n\nIf rule-consequentialism ends up requiring the very same acts that\nact-consequentialism requires, then rule-consequentialism is indeed in\nterrible trouble. Rule-consequentialism is the more complicated of the\ntwo theories. This leads to the following objection. What is the point\nof rule-consequentialism with its infinitely amended rules if we can\nget the same practical result much more efficiently with the simpler\nact-consequentialism?\n\nRule-consequentialists in fact have an excellent reply to the\nobjection that their theory collapses into practical equivalence with\nact-consequentialism. This reply relies on the point that the best\nkind of rule-consequentialism ranks systems of rules not in\nterms of the expected good of complying with them, but in\nterms of the expected good of their teaching and\nacceptance. Now if a rule forbidding stealing, for example,\nhas exception clause after exception clause after exception clause\ntacked on to it, the rule with all these exception clauses will\nprovide too much opportunity for temptation to convince agents that\none of the exception clauses applies, when in fact stealing would be\nadvantageous to the agent. And this point about temptation will also\nundermine other people’s confidence that their property\nwon’t be stolen. The same is true of most other moral rules:\nincorporating too many exception clauses could undermine\npeople’s assurance that others will behave in certain ways (such\nas keeping promises and avoiding stealing).\n\nFurthermore, when comparing alternative rules, we must also consider\nthe relative costs of getting them internalised by new generations.\nClearly, the costs of getting new generations to learn either an\nenormous number of rules or hugely complicated rules would be\nprohibitive. So rule-consequentialism will favor a code of rules\nwithout too many rules, and without too much complication within the\nrules.\n\nThere are also costs associated with getting new generations to\ninternalise rules that require one to make enormous sacrifices for\nothers with whom one has no particular connection. Of course,\nfollowing such demanding rules will produce many benefits, mainly to\nothers. But the costs associated with internalising such rules should\nbe weighed against the benefits of following them. At some level of\ndemandingness, the costs of getting such demanding rules internalised\nwill outweigh the benefits that following them will produce. Hence,\ndoing a careful cost/benefit analysis of internalising demanding rules\nwill come out opposing rules’ being too demanding.\n\nThe code of rules that rule-consequentialism favours a code comprised\nof rules that are not too numerous, too complicated, or too demanding\ncan sometimes lead people to do acts that do not have the greatest\nexpected value. For example, following the simpler rule\n“Don’t steal” will sometimes produce less good\nconsequences than following a more complicated rule “Don’t\nsteal except when … or … or … or … or\n…”. Another example might be following a rule that allows\npeople to give some degree of priority to their own projects, even\nwhen they could produce more good by sacrificing their own projects in\norder to help others. Still, rule-consequentialism’s contention\nis that bringing about widespread acceptance of a simpler and less\ndemanding code, even if acceptance of that code does sometimes lead\npeople to do acts with sub-optimal consequences, has higher expected\nvalue in the long run than bringing about widespread acceptance of a\nmaximally complicated and demanding code. Since rule-consequentialism\ncan tell people to follow this simpler and less demanding code, even\nwhen following it will not to maximise expected good,\nrule-consequentialism escapes collapse into practical equivalence to\nact-consequentialism.\n\nTo the extent that rule-consequentialism circumvents collapse, this\ntheory is accused of incoherence. Rule-consequentialism is accused of\nincoherence for maintaining that an act can be morally permissible or\neven required though the act fails to maximise expected good. Behind\nthis accusation must be the assumption that rule-consequentialism\ncontains an overriding commitment to maximise the good. It is\nincoherent to have this overriding commitment and then to oppose an\nact required by the commitment. (For developments of this line of\nthought, see Arneson 2005; Card 2007; Wall 2009.)\n\nIn order to evaluate the incoherence objection to\nrule-consequentialism, we need to be clearer about the supposed\nlocation of an overriding commitment to maximize the good. Is this\ncommitment supposed to be part of the rule-consequentialist\nagent’s moral psychology? Or is it supposed to be part of the\ntheory rule-consequentialism?\n\nWell, rule-consequentialists need not have maximizing the good as\ntheir ultimate and overriding moral goal. Instead, they could have a\nmoral psychology as follows:\n\n\nTheir fundamental moral motivation is to do what is impartially\ndefensible.\n\nThey believe acting on impartially justified rules is impartially\ndefensible.\n\nThey also believe that rule-consequentialism is on balance the best\naccount of impartially justified rules.\n\n\nAgents with this moral psychology — i.e., this combination of\nmoral motivation and beliefs — would be morally motivated to do\nas rule-consequentialism prescribes. This moral psychology is\ncertainly possible. And, for agents who have it, there is nothing\nincoherent about following rules when doing so will not maximize the\nexpected good.\n\nSo, even if rule-consequentialist agents need not have an\noverriding commitment to maximize expected good, does their\ntheory contain such a commitment? No, rule-consequentialism\nis essentially the conjunction of two claims: (1) that rules are to be\nselected solely in terms of their consequences and (2) that these\nrules determine which kinds of acts are morally wrong. This is really\nall there is to the theory — in particular, there is not some\nthird component consisting in or entailing an overriding commitment to\nmaximize expected good.\n\nWithout an overriding commitment to maximize the expected good, there\nis nothing incoherent in rule-consequentialism’s forbidding some\nkinds of act, even when they maximize the expected good. Likewise,\nthere is nothing incoherent about rule-consequentialism’s\nrequiring other kinds of act, even when they conflict with maximizing\nthe expected good. The best known objection to rule-consequentialism\ndies once we realize that neither the rule-consequentialist agent nor\nthe theory itself contains an overriding commitment to maximize the\ngood.\n\nThe viability of this defense of rule-consequentialism against the\nincoherence objection may depend in part on what the argument for\nrule-consequentialism is supposed to be. The defense seems less viable\nif the argument for rule-consequentialism starts from a commitment to\nconsequentialist assessment. For starting with such a commitment seems\nvery close to starting from an overriding commitment to maximize the\nexpected good. The defence against the incoherence objection seems far\nmore secure, however, if the argument for rule-consequentialism is\nthat this theory does better than any other moral theory at specifying\nan impartial justification for intuitively plausible moral rules. (For\nmore on this, see Hooker 2005, 2007; Rajczi 2016; Wolf 2016; Copp\n2020.)\n\nAnother old objection to rule-consequentialism is that\nrule-consequentialists must be “rule-worshipers” —\ni.e., people who will stick to the rules even when doing so will\nobviously be disastrous.\n\nThe answer to this objection is that rule-consequentialism endorses a\nrule requiring one to prevent disaster, even if doing so requires\nbreaking other rules (Brandt 1992: 87–8, 150–1,\n156–7). To be sure, there are many complexities about what\ncounts as a disaster. Think about what counts as a disaster when the\n“prevent disaster” rule is in competition with a rule\nagainst lying. Now think about what counts as a disaster when the\n“prevent disaster” rule is in competition with a rule\nagainst stealing, or even more when in competition with a rule against\nphysically harming the innocent. Rule-consequentialism may need to be\nclearer about such matters. But at least it cannot rightly be accused\nof potentially leading to disaster.\n\nAn important confusion to avoid is to think that\nrule-consequentialism’s including a “prevent\ndisaster” rule means that rule-consequentialism collapses into\npractical equivalence with maximising act-consequentialism. Maximising\nact-consequentialism holds that we should lie, or steal, or harm the\ninnocent whenever doing so would produce even a little more\nexpected good than not doing so would. A rule requiring one to prevent\ndisaster does not have this implication. Rather, the “prevent\ndisaster” rule comes into play only when there is a very much\nlarger difference in the amounts of expected value at stake.\n\nWoodard (2022) contends that the “prevent disaster” rule\nneeds reconceptualizing. Many rules identify kinds of reasons.\nExamples are the reason to prevent harm, the reason not to steal, and\nthe reason to keep your promises. But, Woodard holds, we should not\nthink of the “prevent disaster” rule as being a rule\nidentifying a kind of reason, which then is claimed to have overriding\nforce. We should rather think that the “prevent disaster”\nrule distinguishes between cases in which the reason to prevent harm\noverrides opposing moral reasons and cases in which the reason to\nprevent harm is weaker than opposing reasons.\n\nEven if Woodard is correct about this, a “prevent\ndisaster” rule can be accused of vagueness and indeterminacy.\nIndeed, the line between cases in which the moral reason to prevent\nharm overrides opposing moral reasons and cases in which the\nmoral reason to prevent harm is weaker than opposing moral\nreasons might well be indeterminant. Woollard (2022) argues that\nadmitting such vagueness and indeterminacy does not weaken\nrule-consequentialism. And she draws on her earlier work (2015) to\nexplain how rule-consequentialism’s “prevent\ndisaster” rule need not impale the theory on the dilemma of\neither being overly demanding or placing a counterintuitive limit on a\nrequirement to come to the aid of others.\n9. Other Objections to Rule-consequentialism\n\nFrom the mid 1960s until the mid 1990s, most philosophers thought\nrule-consequentialism couldn’t survive the objections discussed\nin the previous section. So, during those three decades, most\nphilosophers didn’t bother with other objections to the theory.\nHowever, if rule-consequentialism has convincing replies to all three\nof the objections just discussed, then a good question is whether or\nnot there are other fatal objections to the theory.\n\nSome other objections try to show that, given the theory’s\ncriterion for selecting rules, there are conditions under which it\nselects intuitively unacceptable rules. For example, Tom Carson (1991)\nargued that rule-consequentialism turns out to be extremely demanding\nin the real world. Mulgan (2001, esp. ch. 3) agreed with Carson about\nthat, and went on to argue that, even if rule-consequentialism’s\nimplications in the actual world are fine, the theory has\ncounterintuitive implications in possible worlds. If Mulgan were right\nabout that, this would cast doubt on rule-consequentialism’s\nclaim to explain why certain demands are appropriate in the actual\nworld. Debate about such matters continues (Hooker 2003; Lawlor 2004;\nParfit 2011, 2017a, 2017b; Woollard 2015: 181–205; Rajczi 2016;\nPortmore 2017; Podgorski 2018; D. Miller 2021; Perl 2021, 2022). And\nMulgan has become a developer of rule-consequentialism rather than a\ncritic (Mulgan 2006, 2009, 2015, 2017, 2020).\n\nA related objection to rule-consequentialism is that\nrule-consequentialism makes the justification of familiar rules\ncontingent on various empirical facts, such as what human nature is\nlike, and how many people there are in need or in positions to help.\nThe objection to rule-consequentialism is that some familiar moral\nrules are necessarily, not merely contingently, justified (McNaughton\nand Rawling 1998; Gaut 1999, 2002; Montague 2000; Suikkanen 2008). A\nsibling of this objection is that rule-consequentialism makes the\njustification of rules depend on the wrong facts (Arneson 2005;\nPortmore 2009; cf. Woollard 2015: esp. pp. 185–86,\n203–205; 2022).\n\nThe mechanics of teaching new codes throws up serious questions for\nforms of rule-consequentialism that count the costs of getting rules\ninternalised by new generations. As explained earlier, limiting the\ntargets of the teaching to new generations is meant to avoid having to\ncount the costs of getting rules internalised by existing generations\nof people who have already internalised some other moral rules and\nideas. But can we come up with a coherent description of those who are\nsupposed to do the teaching of these new generations? If the teachers\nare imagined to have already internalised the ideal code themselves,\nthen how is that supposed to have happened? If these teachers are\nimagined not to have already internalised the ideal code, then there\nwill be costs associated with the conflict between the ideal code and\nwhatever they have already internalised. (This objection was\nformulated by John Andrews, Robert Ehman, and Andrew Moore. Cf. Levy\n2000; D. Miller, 2021.) A related objection is that\nrule-consequentialism has not yet been formulated in a way that\nenables it to deal plausibly with conflicts among rules (Eggleston\n2007). But see Copp 2020; D. Miller 2021; Woodard 2022.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adams, R. M, 1976, “Motive Utilitarianism”,\n<em>Journal of Philosophy</em>, 73: 467–81.",
                "Arneson, R., 1999a, “Human Flourishing versus Desire\nSatisfaction”, <em>Social Philosophy &amp; Policy</em>, 16:\n113–42.",
                "–––, 1999b, “Egalitarianism and\nResponsibility”, <em>Journal of Ethics</em>, 3:\n225–47.",
                "–––, 2005, “Sophisticated Rule\nConsequentialism: Some Simple Objections”, <em>Philosophical\nIssues</em>, 15: 235–251.",
                "Attfield, R., 1987, <em>A Theory of Value and Obligation</em>,\nLondon: Croom Helm.",
                "Attfield, R., 1995, <em>Value, Obligation and Meta-ethics</em>,\nAmsterdam: Rodopi BV Editions.",
                "Austin, J., 1832, <em>The Province of Jurisprudence\nDetermined</em>. ed. H. L. A. Hart, London: Weidenfeld, 1954.",
                "Audi, R., 1996, “Intuitionism, Pluralism, and the\nFoundations of Ethics”, W. Sinnott-Armstrong and M. Timmons\n(eds), <em>Moral Knowledge?</em>, New York: Oxford University Press,\npp. 101–36.",
                "–––, 2001, “A Kantian Intuitionism”,\n<em>Mind</em>, 110: 601–35.",
                "–––, 2004, <em>The Good in the Right: A Theory\nof Intuition and Intrinsic Value</em>, Princeton, NJ: Princeton\nUniversity Press.",
                "Baier, Kurt, 1958, <em>The Moral Point of View</em>. Ithaca, NY:\nCornell University Press.",
                "Bales, R. E., 1971, “Act-Utilitarianism: Account of\nRight-making Characteristics or Decision-making Procedure?”\n<em>American Philosophical Quarterly</em>, 8: 257–65.",
                "Barrow, R., 1991, <em>Utilitarianism: A Contemporary\nStatement</em>, Aldershot: Edward Elgar.",
                "Berkeley, G., 1712, <em>Passive Obedience, or the Christian\nDoctrine of Not Resisting the Supreme Power, Proved and Vindicated\nupon the Principles of the Law of Nature</em>, London: H. Clements;\nreprinted in D.H. Monro (ed.), <em>A Guide to the British\nMoralists</em>, London: Fontana, 1972, pp. 217–27.",
                "Brand-Ballard, J., 2007, “Why One Principle?”\n<em>Utilitas</em>, 19: 220–42.",
                "Brandt, R.B., 1959, <em>Ethical Theory</em>, Englewood Cliffs, NJ:\nPrentice-Hall.",
                "–––, 1963, “Toward a Credible Form of\nUtilitarianism”, in H.-N. Castañeda and G. Nakhnikian\n(eds.), <em>Morality and the Language of Conduct</em>, Detroit: Wayne\nState University Press, pp. 107–43.",
                "–––, 1967, “Some Merits of One Form of\nRule-Utilitarianism”, <em>University of Colorado Studies in\nPhilosophy</em>, pp. 39–65; reprinted in Brandt 1992:\n111–36.",
                "–––, 1979, <em>A Theory of the Good and the\nRight</em>, Oxford: Oxford University Press.",
                "–––, 1983, “Problems of Contemporary\nUtilitarianism: Real and Alleged”, in N. Bowie (ed.),\n<em>Ethical Theory in the Last Quarter of the Twentieth Century</em>,\nIndianapolis: Hackett, pp. 81–105.",
                "–––, 1988, “Fairness to Indirect Optimific\nTheories in Ethics”, <em>Ethics</em>, 98: 341–60;\nreprinted in Brandt 1992: 137–57.",
                "–––, 1989, “Morality and its\nCritics”, <em>American Philosophical Quarterly</em>, 26:\n89–100; reprinted in Brandt 1992: 73–92.",
                "–––, 1992, <em>Morality, Utilitarianism, and\nRights</em>, New York: Cambridge University Press.",
                "–––, 1996, <em>Facts, Values, and Morality</em>,\nNew York: Cambridge University Press.",
                "Brink, D., 1989, <em>Moral Realism and the Foundations of\nEthics</em>, New York: Cambridge University Press.",
                "Burch-Brown, J., 2014, “Clues for Consequentialists”,\n<em>Utilitas</em>, 26: 105–19.",
                "Card, R., 2007, “Inconsistency and the Theoretical\nCommitments of Hooker’s Rule-consequentialism”,\n<em>Utilitas</em>, 19: 243–58.",
                "Carson, T., 1991, “A Note on Hooker’s Rule\nConsequentialism”, <em>Mind</em>, 100: 117–21.",
                "Copp, D., 2020, “The Rule Worship and Idealization\nObjections Revisited and Resisted”, <em>Oxford Studies in\nNormative Ethics</em> 10: 131–155.",
                "Cowen, T., 2011, “Rule Consequentialism Makes Sense After\nAll”, <em>Social Philosophy and Policy</em>, 28:\n212–231.",
                "Crisp, R., 1992, “Utilitarianism and the Life of\nVirtue”, <em>Philosophical Quarterly</em>, 42:\n139–60.",
                "–––, 1997, <em>Mill on Utilitarianism</em>,\nLondon: Routledge.",
                "–––, 2000, “Griffin’s\nPessimism”, in R. Crisp and B. Hooker (eds.), <em>Well-Being and\nMorality: Essays in Honour of James Griffin</em>, Oxford: Oxford\nUniversity Press: 115–28.",
                "–––, 2006, “Hedonism Reconsidered”,\n<em>Philosophy and Phenomenlogical Research</em>, 73:\n619–645.",
                "Cureton, A., 2015, “Making Room for Rules”,\n<em>Philosophical Studies</em>, 172: 737–59.",
                "Driver, J., 2014, “Global Utilitarianism”, in B.\nEggleston and D. Miller (eds), <em>The Cambridge Companion to\nUtilitarianism</em>, Cambridge: Cambridge University Press, pp.\n166–76.",
                "Ebertz, R., 1993, “Is Reflective Equilibrium a Coherentist\nModel?”, <em>Canadian Journal of Philosophy</em>, 23:\n193–214.",
                "Eggleston, B., 2007, “Conflicts of Rules in Hooker’s\nRule-consequentialism”, <em>Canadian Journal of Philosophy</em>,\n37: 329–49.",
                "Ezorsky, G., 1968 “A Defense of Rule Utilitarianism Against\nDavid Lyons Who Insists on Tieing It to Act Utilitarianism, Plus a\nBrand New Way of Checking Out General Utilitarian Properties”,\n<em>Journal of Philosophy</em>, 65: 533–44.",
                "Foot, P., 2000, <em>Natural Goodness</em>, Oxford: Oxford\nUniversity Press.",
                "Gaut, B., 1993, “Moral Pluralism”, <em>Philosophical\nPapers</em>, 22: 17–40.",
                "–––, 1999, “Ragbags, Hard Cases, and Moral\nPluralism”, <em>Utilitas</em>, 11: 37–48.",
                "–––, 2002, “Justifying Moral\nPluralism”, in P. Stratton-Lake (ed.), <em>Ethical\nIntuitionism</em>, Oxford: Oxford University Press, pp.\n137–60.",
                "Gert, B., 1998, <em>Morality</em>, New York: Oxford University\nPress.",
                "Greaves, H., 2020, “Global Consequentialism”, in\nDouglas Portmore (ed.), <em>Oxford Handbook of Consequentialism</em>,\nNew York: Oxford University Press, pp. 423–440.",
                "Griffin, J., 1986, <em>Well-Being: Its Meaning, Measurement and\nMoral Importance</em>, Oxford: Oxford University Press.",
                "–––, 1996, <em>Value Judgement</em>, Oxford:\nOxford University Press.",
                "Hare, R.M., 1981, <em>Moral Thinking</em>, Oxford: Oxford\nUniversity Press.",
                "Harrison, J, 1953, “Utilitarianism, Universalisation, and\nOur Duty To Be Just”, <em>Proceedings of the Aristotelian\nSociety</em>, 53: 105–34.",
                "Harrod, R., 1936, “Utilitarianism Revised”,\n<em>Mind</em>, 45: 137–56.",
                "Harsanyi, J., 1953, “Cardinal Utility in Welfare Economics\nand in the Theory of Risk-Taking”, <em>Journal of Political\nEconomy</em>, 61: 434–5.",
                "–––, 1955, “Cardinal Welfare,\nIndividualistic Ethics, and Interpersonal Comparisons of\nUtility”, <em>Journal of Political Economy</em>, 63:\n309–21.",
                "–––, 1977, “Rule Utilitarianism and\nDecision Theory”, <em>Erkenntnis</em>, 11: 25–53.",
                "–––, 1982, “Morality and the Theory of\nRational Behaviour”, in Sen and Williams 1982: 39–62.",
                "–––, 1993, “Expectation Effects,\nIndividual Utilities, and Rational Desires”, in B. Hooker (ed.),\n<em>Rationality, Rules, and Utility: New Essays on the Moral\nPhilosophy of Richard Brandt</em>, Boulder, CO: Westview Press:\n115–26.",
                "Haslett, D.W., 1987, <em>Equal Consideration: A Theory of Moral\nJustification</em>, Newark, Del.: University of Delaware Press.",
                "–––, 1994, <em>Capitalism With Morality</em>,\nOxford: Oxford University Press.",
                "–––, 2000, “Values, Obligations, and\nSaving Lives”, in Hooker, Mason, and Miller 2000, pp.\n71–104.",
                "Hill, T.E., Jr., 2005, “Assessing Moral Rules: Utilitarian\nand Kantian Perspectives”, <em>Philosophical Issues</em>, 15:\n158–178.",
                "Hills, A., 2010, “Utilitarianism, Contractualism and\nDemandingness”, <em>Philosophical Quarterly</em>, 60:\n225–42.",
                "Hodgson, D.H., 1967, <em>Consequences of Utilitarianism</em>,\nLondon: Oxford University Press.",
                "Hooker, B., 2000, <em>Ideal Code, Real World: A\nRule-consequentialist Theory of Morality</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2003, “Review of Mulgan’s\n<em>Demands of Consequentialism</em>”, <em>Philosophy</em>, 78:\n289–96.",
                "–––, 2005, “Reply to Arneson and\nMcIntyre”, <em>Philosophical Issues</em>, 15: 264–81.",
                "–––, 2007, “Rule-consequentialism and\nInternal Consistency: A Reply to Card”, <em>Utilitas</em>, 19:\n514–19.",
                "–––, 2008, “Rule-consequentialism versus\nAct-consequentialism”, <em>Politea</em>, 24: 75–85.",
                "–––, 2010, “Publicity in Morality: A Reply\nto Katarzyna de Lazari-Radek and Peter Singer”, <em>Ratio</em>,\n23: 111–117.",
                "–––, 2014, “Must Kantian Contractualism\nand Rule-consequentialism Converge?’”, <em>Oxford Studies\nin Normative Ethics</em>, 4: 34–52.",
                "–––, 2016, “Wrongness, Evolutionary\nDebunking, Public Rules”, <em>Etica &amp; Politica</em>, 18:\n133–149.",
                "–––, forthcoming,\n“Rule-consequentialism’s Essence and Rationale”, in\nDavid Copp, Connie Rosati, and Tina Rulli (eds.), <em>Oxford Handbook\nof Normative Ethics</em>, New York: Oxford University Press.",
                "Hooker, B. and G. Fletcher, 2008, “Variable versus\nFixed-rate Rule-utilitarianism”, <em>Philosophical\nQuarterly</em>, 58: 344–352.",
                "Hooker, B., E. Mason, and D. Miller (eds.), 2000, <em>Morality,\nRules, and Consequences</em>, Edinburgh: Edinburgh University\nPress.",
                "Hospers, J., 1972, <em>Human Conduct, Problems of Ethics</em>, New\nYork: Harcourt Brace Jovanovich, Inc.",
                "Hursthouse, R., 1999, <em>On Virtue Ethics</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2002, “Virtue Ethics vs\nRule-Consequentialism”, <em>Utilitas</em>, 14: 41–53.",
                "Ihara, C., 1981, “Toward a Rule-Utilitarian Theory of\nSupererogation”, <em>Philosophy Research Archives</em>, 7:\n582–98",
                "Johnson, C., 1991, <em>Moral Legislation</em>, New York: Cambridge\nUniversity Press.",
                "Kagan, S., 1989, <em>The Limits of Morality</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1998, <em>Normative Ethics</em>, Boulder,\nCO: Westview Press.",
                "–––, 1999, “Equality and Desert”, in\nPojman and McLeod (eds.) <em>What Do We Deserve?</em>, New York:\nOxford University Press, pp. 298–314.",
                "–––, 2000, “Evaluative Focal\nPoints”, in Hooker, Mason, and Miller 2000, pp.\n134–55.",
                "Kahn, L., 2012, “Rule Consequentialism and Scope”,\n<em>Ethical Theory and Moral Practice</em>, 15: 631–46.",
                "–––, 2013, “Rule Consequentialism and\nDisasters”, <em>Philosophical Studies</em>, 162:\n219–36.",
                "Kamm, F., 2002, “Owing, Justifying, Rejecting: Thomas\nScanlon’s <em>What We Owe to Each Other</em>”,\n<em>Mind</em>, 111: 323–54.",
                "Lang, G., 2004, “A Dilemma for Objective\nAct-Utilitarianism”, <em>Politics, Philosophy and\nEconomics</em>, 3(2): 131–262.",
                "Law, I., 1999, “Rule-consequentialism’s\nDilemma”, <em>Ethical Theory and Moral Practice</em>, 2:\n263–76.",
                "Lawlor, R., 2004, “Hooker’s Ideal Code and the\nSacrifice Problem”, <em>Social Theory and Practice</em>, 30(4):\n583–587.",
                "Lazari-Radek, K. de and P. Singer, 2014, <em>The Point of View of\nthe Universe: Sidgwick and Contemporary Ethics</em>, Oxford, Oxford\nUniversity Press.",
                "Lenman, J., 2000, “Consequentialism and Cluelessness”,\n<em>Philosophy and Public Affairs</em>, 29: 342–70.",
                "Levy, S., 2000, “The Educational Equivalence of Act and Rule\nUtilitarianism”, in Hooker, Mason, and Miller 2000:\n27–39.",
                "–––, 2013, “A Contractualist Defense of\nRule Consequentialism”, <em>Journal of Philosophical\nResearch</em>, 38: 189–201.",
                "–––, 2014, “The Failure of Hooker’s\nArgument for Rule Consequentialism”, <em>Journal of Moral\nPhilosophy</em>, 11: 598–614.",
                "Lewis, D., 1972, “Utilitarianism and Truthfulness”,\n<em>Australasian Journal of Philosophy</em>, 50: 17–19.",
                "Lyons, D., 1965, <em>Forms and Limits of Utilitarianism</em>,\nOxford: Oxford University Press.",
                "–––, 1994, <em>Rights, Welfare, and Mill’s\nMoral Theory</em>, Oxford: Oxford University Press.",
                "–––, 2000, “The Moral Opacity of\nUtilitarianism”, in Hooker, Mason, and Miller 2000, pp.\n105–120.",
                "Mabbott, J. D., 1953, “Moral Rules”, <em>Proceedings\nof the British Academy</em>, 37: 97–117, esp.\n107–117.",
                "Martin, R., 2010, “Mill’s Rule Utilitarianism in\nContext”, in B. Eggleston, D. Miller, &amp; D. Weinstein (eds.),\n<em>John Stuart Mill and the Art of Life</em>, Oxford: Oxford\nUniversity Press.",
                "McIntyre, A., 2005, “The Perils of Holism: Brad\nHooker’s Ideal Code, Real World”, <em>Philosophical\nIssues</em>, 15: 252–263.",
                "McNaughton, P. and P. Rawling, 1998, “On Defending\nDeontology”, <em>Ratio</em>, 11: 37–54.",
                "Mill, J. S., 1861, <em>Utilitarianism</em>, numerous\neditions.",
                "Miller, D., 2000, “Hooker’s Use and Abuse of\nReflective Equilibrium”, in Hooker, Mason and Miller 2000, pp.\n156–78.",
                "–––, 2010, <em>John Stuart Mill</em>, Cambridge:\nPolity Press.",
                "–––, 2014, “Rule Consequentialism”,\nin B. Eggleston and D. Miller (eds.), <em>Cambridge Companion to\nUtilitarianism</em>.",
                "–––, 2021, “Moral Education and Rule\nConsequentialism”, <em>Philosophical Quarterly</em>, 71:\n120–140.",
                "Miller, T., 2016, “Solving Rule Consequentialism’s\nAcceptance Rate Problem”, <em>Utilitas</em>, 28:\n41–53.",
                "–––, 2021, “From Compliance, to\nAcceptance, to Teaching: On Relocating Rule Consequentialism’s\nStipulations”, <em>Utilitas</em>, 33: 204–220.",
                "Miller, R. B., 2009, “Actual Rule Utilitarianism”,\n<em>Journal of Philosophy</em>, 106: 5–28.",
                "Montague, P., 2000, “Why Rule Consequentialism Is Not\nSuperior to Ross-Style Pluralism”, in Hooker, Mason, and Miller\n2000, pp. 203–11.",
                "Moore, A., 2007, “Ethical Theory, Completeness &amp;\nConsistency”, <em>Ethical Theory and Moral Practice</em>, 10:\n297–308.",
                "Moore, G. E., 1903, <em>Principia Ethica</em>, Cambridge:\nCambridge University Press.",
                "–––, 1912, <em>Ethics</em>, London: Oxford\nUniversity Press.",
                "Mulgan, T., 2001, <em>The Demands of Consequentialism</em>,\nOxford: Oxford University Press.",
                "–––, 2006, <em>Future People</em>, Oxford:\nOxford University Press, chs. 2, 6.",
                "–––, 2009, “Rule Consequentialism and\nNon-Identity”, in D. Wasserman &amp; M. Roberts (eds.),\n<em>Harming Future Persons</em>, Dordrecht: Springer, pp.\n115–34.",
                "–––, 2015, “Utilitarianism for a Broken\nWorld”, <em>Utilitas</em>, 27: 92–114.",
                "–––, 2017, “How Should Utilitarians Think\nAbout the Future?”, <em>Canadian Journal of Philosophy</em>, 47:\n290–312.",
                "–––, 2020, <em>Utilitarianism</em>, Cambridge:\nCambridge University Press.",
                "Nebel, J., 2012, “A Counterexample to Parfit’s Rule\nConsequentialism” (Discussion Note), <em>Journal of Ethics and\nSocial Philosophy</em>, July,\n &lt;<a href=\"http://www.jesp.org/articles/download/counterexample_to_parfits_rule_consequentialism.pdf\" target=\"other\">available online</a>&gt;.",
                "Norcross, A., 2002, “Contractualism and Aggregation”,\n<em>Social Theory and Practice</em>, 28: 303–14.",
                "Overvold, M., 1980, “Self-interest and the Concept of\nSelf-sacrifice”, <em>Canadian Journal of Philosophy</em>, 10:\n105–18.",
                "–––, 1982, “Self-interest and Getting What\nYou Want”, <em>The Limits of Utilitarianism</em>, H.B. Miller\nand W.H. Williams (eds.), Minneapolis: University of Minnesota Press,\npp. 186–94.",
                "Parfit, D., 1984, <em>Reasons and Persons</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1997, “Equality and Priority”,\n<em>Ratio</em>, 10: 202–21.",
                "–––, 2003, “Justifiablity to Each\nPerson”, <em>Ratio</em>, 16: 368–90.",
                "–––, 2011, <em>On What Matters</em>, Oxford:\nOxford University Press.",
                "–––, 2017a, <em>On What Matters</em> (Volume 3),\nOxford: Oxford University Press.",
                "–––, 2017b, “Responses”, in S.\nKirchin (ed.), <em>Reading Parfit</em>, Abingdon: Routledge, pp.\n189–236.",
                "Perl, C., 2021, “Solving the Ideal Worlds Problem”,\n<em>Ethics</em>, 132: 89–126.",
                "–––, 2022, “Some Question-Begging\nObjections to Rule consequentialism”, <em>Australasian Journal\nof Philosophy</em>, first online 29 August 2022.\ndoi:10.1080/00048402.2022.2056213",
                "Pettit, P., 1991, “Consequentialism”, in <em>Companion\nto Ethics</em>, edited by Peter Singer, Oxford: Blackwell Publishers\npp. 230–40.",
                "–––, 1994, “Consequentialism and Moral\nPsychology”, <em>International Journal of Philosophical\nStudies</em>, 2: 1–17.",
                "–––, 1997, “The Consequentialist\nPerspective”, in M. Baron, P. Pettit, and M. Slote, <em>Three\nMethods of Ethics</em>, Malden, MA: Blackwell Publishers, pp.\n92–174.",
                "–––, 2017, <em>The Robust Demands of the\nGood</em>, Oxford: Oxford University Press.",
                "Pettit, P. and G. Brennan, 1986, “Restrictive\nConsequentialism”, <em>Australasian Journal of Philosophy</em>,\n64: 438–55.",
                "Pettit, P. and M. Smith, 2000, “Global\nConsequentialism”, in Hooker, Mason, and Miller 2000, pp.\n221–33.",
                "Plato, <em>c</em> 380BC, <em>The Republic</em>.",
                "Podgorski, A., 2018, “Wouldn’t It Be Nice? Moral Rules\nand Distant Worlds”, <em>Noûs</em>, 52:\n279–294.",
                "Portmore, D., 2009, “Rule-Consequentialism and Irrelevant\nOthers”, <em>Utilitas</em> 21: 368–76.",
                "–––, 2017, “Parfit on Reasons and Rule\nConsequentialism”, in S. Kirchin (ed.), <em>Reading Parfit: On\nOn What Matters</em>, Abingdon: Routledge.",
                "Rajczi, A., 2016, “On the Incoherence Objection to\nRule-Utilitarianism”, <em>Ethical Theory and Moral\nPractice</em>, 19: 857–876.",
                "Railton, P., 1984, “Alienation, Consequentialism, and the\nDemands of Morality”, <em>Philosophy and Public Affairs</em>,\n13: 174–31.",
                "Raz, J., 2003, “Numbers, With and Without\nContractualism”, <em>Ratio</em>, 16: 346–367.",
                "Rawls, J., 1951, “Outline for a Decision Procedure in\nEthics”, <em>Philosophical Review</em>, 60: 177–97.",
                "–––, 1955, “Two Concepts of Rules”,\n<em>Philosophical Review</em>, 64: 3–32.",
                "–––, 1971, <em>A Theory of Justice</em>,\nCambridge, MA: Harvard University Press.",
                "Ridge, M., 2006, “Introducing Variable-Rate\nRule-Utilitariansim”, <em>Philosophical Quarterly</em>, 56:\n242–53.",
                "Riley, J., 2000, “Defending Rule Utilitarianism”, in\nHooker, Mason, and Miller 2000, pp. 40–69.",
                "Ross, J., 2009, “Should Kantians Be\nConsequentialists?”, <em>Ratio</em>, 22: 126–35.",
                "Ross, W.D., 1930, <em>The Right and the Good</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1939, <em>Foundations of Ethics</em>,\nOxford: Oxford University Press.",
                "Sayre-McCord, G., 1986, “Coherence and Models for Moral\nTheorizing”, <em>Pacific Philosophical Quarterly</em>, 18:\n170–90.",
                "–––, 1996, “Coherentist Epistemology and\nMoral Theory”, in W. Sinnott-Armstrong and M. Timmons (eds.),\n<em>Moral Knowledge?</em>, New York: Oxford University Press, pp.\n137–59.",
                "Scanlon, T.M., 1982, “Contractualism and\nUtilitarianism”, in Sen and Williams 1982: 103–28.",
                "–––, 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.",
                "Sen, A. and B. Williams (eds.), 1982, <em>Utilitarianism and\nBeyond</em>, Cambridge: Cambridge University Press.",
                "Shaw, W., 1993, “Welfare, Equality, and Distribution: Brandt\nfrom the Left”, in B. Hooker (ed.), <em>Rationality, Rules, and\nUtility: New Essays on the Moral Philosophy of Richard Brandt</em>,\nBoulder, CO: Westview Press: 165–87.",
                "–––, 1999, <em>Contemporary Ethics: Taking\nAccount of Utilitarianism</em>, Cambridge, MA: Blackwell\nPublishers.",
                "–––, 2000, “Between Act and Rule: The\nConsequentialism of G.E. Moore”, in Hooker, Mason, and Miller\n2000: 6–26.",
                "Sidgwick, H., 1907, <em>Methods of Ethics</em>, seventh edition,\nLondon: Macmillan; first edition, 1874.",
                "Singer, M., 1955, “Generalization in Ethics”,\n<em>Mind</em>, 64: 361–75.",
                "–––, 1961, <em>Generalization in Ethics</em>,\nNew York: Knopf.",
                "Singer, P., 1972, “Is Act-utilitarianism\nSelf-defeating?” <em>Philosophical Review</em>, 81:\n94–104.",
                "Smart, J.J.C., 1956, “Extreme and Restricted\nUtilitarianism”, <em>Philosophical Quarterly</em>, 6:\n344–54.",
                "–––, 1973, “Outline of a System of\nUtilitarian Ethics”, in J.J.C. Smart and Bernard Williams,\n<em>Utilitarianism: For and Against</em>, Cambridge: Cambridge\nUniversity Press, pp. 3–74.",
                "Smith, H., 2010, “Measuring the Consequences of\nRules”, <em>Utilitas</em>, 22: 413–33.",
                "Sorensen, R., 1996, “Unknowable Obligations”,\n<em>Utilitas</em>, 7: 247–71.",
                "Stratton-Lake, P., 1997, “Can Hooker’s\nRule-Consequentialist Principle Justify Ross’s Prima Facie\nDuties?”, <em>Mind</em>, 106: 151–58.",
                "Streumer, B., 2003, “Can Consequentialism Cover\nEverything?”, <em>Utilitas</em>, 15: 237–47.",
                "Suikkanen, J., 2008, “A Dilemma for\nRule-consequentialism”, <em>Philosophia</em>, 36:\n141–150.",
                "–––, 2014, “Contractualism and the\nConditional Fallacy”, <em>Oxford Studies in Normative\nEthics</em>, 4: 113–137.",
                "–––, 2022, “Hooker’s\nRule-consequentialism and Scanlon’s Contractualism—A\nRe-evaluation”, <em>Ratio</em>, 35: 261–74.",
                "Sumner, L. W., 1996, <em>Welfare, Happiness, and Ethics</em>,\nOxford: Oxford University Press.",
                "Temkin, L., 1993, <em>Inequality</em>, Oxford: Oxford University\nPress.",
                "Thomas, A., 2000, “Consequentialism and the Subversion of\nPluralism”, in Hooker, Mason, and Miller 2000, pp.\n179–202.",
                "Tobia, K., 2013, “Rule Consequentialism and the Problem of\nPartial Acceptance”, <em>Ethical Theory and Moral Practice</em>,\n16: 643–52.",
                "–––, 2018, “Rule-consequentialism’s\nAssumptions”, <em>Utilitas</em>, 30: 458–471.",
                "Toppinen, T., 2016, “Rule Consequentialism (and Kantian\nContractualism) at Top Rates”, <em>Philosophical Quarterly</em>,\n66: 122–135.",
                "Toulmin, S., 1950, <em>The Place of Reason in Ethics</em>,\nCambridge: Cambridge University Press.",
                "Urmson, J.O., 1953, “The Interpretation of the Moral\nPhilosophy of J.S. Mill”. <em>Philosophical Quarterly</em>, 10:\n33–9.",
                "–––, 1975, “A Defence of\nIntuitionism”, <em>Proceedings of the Aristotelian Society</em>,\n75: 144–52.",
                "Wall, E., 2009, “Hooker’s Consequentialism and the\nDepth of Moral Experience”, <em>Dialogue</em>, 48:\n337–51",
                "Williams, B., 1973a, “Egoism and Altruism”, in B.\nWilliams, <em>Problems of the Self</em>, Cambridge: Cambridge\nUniversity Press, pp. 250–65.",
                "–––, 1973b, “A Critique of\nUtilitarianism”, in J. J. C. Smart and B. Williams,\n<em>Utilitarianism: For &amp; Against</em>, Cambridge: Cambridge\nUniversity Press, pp. 77–150.",
                "–––, 1982, “The Point of View of the\nUniverse: Sidgwick and the Ambitions of Ethics”, <em>The\nCambridge Review</em>, (7 May); reprinted in Williams 1995:\n153–71.",
                "–––, 1995, <em>Making Sense of Humanity and\nOther Essays</em>, Cambridge: Cambridge University Press.",
                "Wolf, S., 2016, “Two Concepts of Rule Utilitarianism”,\n<em>Oxford Studies in Normative Ethics</em>, 6: 123–144.",
                "Woollard, F., 2015, <em>Doing and Allowing Harm</em>. Oxford:\nOxford University Press.",
                "–––, 2022, “Hooker’s\nRule-consequentialism, Disasters, Demandingness, and Arbitrary\nDistinctions”, <em>Ratio</em>, 35: 289–300.",
                "Woodard, C., 2019, <em>Taking Utilitarianism Seriously</em>,\nOxford: Oxford University Press.",
                "–––, 2022, “Reasons for\nRule-consequentialists”, <em>Ratio</em>, 35: 251–60.",
                "Yeo, S., 2017, “Measuring the Consequences of Rules: A Reply\nto Smith”, <em>Utilitas</em>, 29: 125–31."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Adams, R. M, 1976, “Motive Utilitarianism”,\n<em>Journal of Philosophy</em>, 73: 467–81.</li>\n<li>Arneson, R., 1999a, “Human Flourishing versus Desire\nSatisfaction”, <em>Social Philosophy &amp; Policy</em>, 16:\n113–42.</li>\n<li>–––, 1999b, “Egalitarianism and\nResponsibility”, <em>Journal of Ethics</em>, 3:\n225–47.</li>\n<li>–––, 2005, “Sophisticated Rule\nConsequentialism: Some Simple Objections”, <em>Philosophical\nIssues</em>, 15: 235–251.</li>\n<li>Attfield, R., 1987, <em>A Theory of Value and Obligation</em>,\nLondon: Croom Helm.</li>\n<li>Attfield, R., 1995, <em>Value, Obligation and Meta-ethics</em>,\nAmsterdam: Rodopi BV Editions.</li>\n<li>Austin, J., 1832, <em>The Province of Jurisprudence\nDetermined</em>. ed. H. L. A. Hart, London: Weidenfeld, 1954.</li>\n<li>Audi, R., 1996, “Intuitionism, Pluralism, and the\nFoundations of Ethics”, W. Sinnott-Armstrong and M. Timmons\n(eds), <em>Moral Knowledge?</em>, New York: Oxford University Press,\npp. 101–36.</li>\n<li>–––, 2001, “A Kantian Intuitionism”,\n<em>Mind</em>, 110: 601–35.</li>\n<li>–––, 2004, <em>The Good in the Right: A Theory\nof Intuition and Intrinsic Value</em>, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Baier, Kurt, 1958, <em>The Moral Point of View</em>. Ithaca, NY:\nCornell University Press.</li>\n<li>Bales, R. E., 1971, “Act-Utilitarianism: Account of\nRight-making Characteristics or Decision-making Procedure?”\n<em>American Philosophical Quarterly</em>, 8: 257–65.</li>\n<li>Barrow, R., 1991, <em>Utilitarianism: A Contemporary\nStatement</em>, Aldershot: Edward Elgar.</li>\n<li>Berkeley, G., 1712, <em>Passive Obedience, or the Christian\nDoctrine of Not Resisting the Supreme Power, Proved and Vindicated\nupon the Principles of the Law of Nature</em>, London: H. Clements;\nreprinted in D.H. Monro (ed.), <em>A Guide to the British\nMoralists</em>, London: Fontana, 1972, pp. 217–27.</li>\n<li>Brand-Ballard, J., 2007, “Why One Principle?”\n<em>Utilitas</em>, 19: 220–42.</li>\n<li>Brandt, R.B., 1959, <em>Ethical Theory</em>, Englewood Cliffs, NJ:\nPrentice-Hall.</li>\n<li>–––, 1963, “Toward a Credible Form of\nUtilitarianism”, in H.-N. Castañeda and G. Nakhnikian\n(eds.), <em>Morality and the Language of Conduct</em>, Detroit: Wayne\nState University Press, pp. 107–43.</li>\n<li>–––, 1967, “Some Merits of One Form of\nRule-Utilitarianism”, <em>University of Colorado Studies in\nPhilosophy</em>, pp. 39–65; reprinted in Brandt 1992:\n111–36.</li>\n<li>–––, 1979, <em>A Theory of the Good and the\nRight</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1983, “Problems of Contemporary\nUtilitarianism: Real and Alleged”, in N. Bowie (ed.),\n<em>Ethical Theory in the Last Quarter of the Twentieth Century</em>,\nIndianapolis: Hackett, pp. 81–105.</li>\n<li>–––, 1988, “Fairness to Indirect Optimific\nTheories in Ethics”, <em>Ethics</em>, 98: 341–60;\nreprinted in Brandt 1992: 137–57.</li>\n<li>–––, 1989, “Morality and its\nCritics”, <em>American Philosophical Quarterly</em>, 26:\n89–100; reprinted in Brandt 1992: 73–92.</li>\n<li>–––, 1992, <em>Morality, Utilitarianism, and\nRights</em>, New York: Cambridge University Press.</li>\n<li>–––, 1996, <em>Facts, Values, and Morality</em>,\nNew York: Cambridge University Press.</li>\n<li>Brink, D., 1989, <em>Moral Realism and the Foundations of\nEthics</em>, New York: Cambridge University Press.</li>\n<li>Burch-Brown, J., 2014, “Clues for Consequentialists”,\n<em>Utilitas</em>, 26: 105–19.</li>\n<li>Card, R., 2007, “Inconsistency and the Theoretical\nCommitments of Hooker’s Rule-consequentialism”,\n<em>Utilitas</em>, 19: 243–58.</li>\n<li>Carson, T., 1991, “A Note on Hooker’s Rule\nConsequentialism”, <em>Mind</em>, 100: 117–21.</li>\n<li>Copp, D., 2020, “The Rule Worship and Idealization\nObjections Revisited and Resisted”, <em>Oxford Studies in\nNormative Ethics</em> 10: 131–155.</li>\n<li>Cowen, T., 2011, “Rule Consequentialism Makes Sense After\nAll”, <em>Social Philosophy and Policy</em>, 28:\n212–231.</li>\n<li>Crisp, R., 1992, “Utilitarianism and the Life of\nVirtue”, <em>Philosophical Quarterly</em>, 42:\n139–60.</li>\n<li>–––, 1997, <em>Mill on Utilitarianism</em>,\nLondon: Routledge.</li>\n<li>–––, 2000, “Griffin’s\nPessimism”, in R. Crisp and B. Hooker (eds.), <em>Well-Being and\nMorality: Essays in Honour of James Griffin</em>, Oxford: Oxford\nUniversity Press: 115–28.</li>\n<li>–––, 2006, “Hedonism Reconsidered”,\n<em>Philosophy and Phenomenlogical Research</em>, 73:\n619–645.</li>\n<li>Cureton, A., 2015, “Making Room for Rules”,\n<em>Philosophical Studies</em>, 172: 737–59.</li>\n<li>Driver, J., 2014, “Global Utilitarianism”, in B.\nEggleston and D. Miller (eds), <em>The Cambridge Companion to\nUtilitarianism</em>, Cambridge: Cambridge University Press, pp.\n166–76.</li>\n<li>Ebertz, R., 1993, “Is Reflective Equilibrium a Coherentist\nModel?”, <em>Canadian Journal of Philosophy</em>, 23:\n193–214.</li>\n<li>Eggleston, B., 2007, “Conflicts of Rules in Hooker’s\nRule-consequentialism”, <em>Canadian Journal of Philosophy</em>,\n37: 329–49.</li>\n<li>Ezorsky, G., 1968 “A Defense of Rule Utilitarianism Against\nDavid Lyons Who Insists on Tieing It to Act Utilitarianism, Plus a\nBrand New Way of Checking Out General Utilitarian Properties”,\n<em>Journal of Philosophy</em>, 65: 533–44.</li>\n<li>Foot, P., 2000, <em>Natural Goodness</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Gaut, B., 1993, “Moral Pluralism”, <em>Philosophical\nPapers</em>, 22: 17–40.</li>\n<li>–––, 1999, “Ragbags, Hard Cases, and Moral\nPluralism”, <em>Utilitas</em>, 11: 37–48.</li>\n<li>–––, 2002, “Justifying Moral\nPluralism”, in P. Stratton-Lake (ed.), <em>Ethical\nIntuitionism</em>, Oxford: Oxford University Press, pp.\n137–60.</li>\n<li>Gert, B., 1998, <em>Morality</em>, New York: Oxford University\nPress.</li>\n<li>Greaves, H., 2020, “Global Consequentialism”, in\nDouglas Portmore (ed.), <em>Oxford Handbook of Consequentialism</em>,\nNew York: Oxford University Press, pp. 423–440.</li>\n<li>Griffin, J., 1986, <em>Well-Being: Its Meaning, Measurement and\nMoral Importance</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1996, <em>Value Judgement</em>, Oxford:\nOxford University Press.</li>\n<li>Hare, R.M., 1981, <em>Moral Thinking</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Harrison, J, 1953, “Utilitarianism, Universalisation, and\nOur Duty To Be Just”, <em>Proceedings of the Aristotelian\nSociety</em>, 53: 105–34.</li>\n<li>Harrod, R., 1936, “Utilitarianism Revised”,\n<em>Mind</em>, 45: 137–56.</li>\n<li>Harsanyi, J., 1953, “Cardinal Utility in Welfare Economics\nand in the Theory of Risk-Taking”, <em>Journal of Political\nEconomy</em>, 61: 434–5.</li>\n<li>–––, 1955, “Cardinal Welfare,\nIndividualistic Ethics, and Interpersonal Comparisons of\nUtility”, <em>Journal of Political Economy</em>, 63:\n309–21.</li>\n<li>–––, 1977, “Rule Utilitarianism and\nDecision Theory”, <em>Erkenntnis</em>, 11: 25–53.</li>\n<li>–––, 1982, “Morality and the Theory of\nRational Behaviour”, in Sen and Williams 1982: 39–62.</li>\n<li>–––, 1993, “Expectation Effects,\nIndividual Utilities, and Rational Desires”, in B. Hooker (ed.),\n<em>Rationality, Rules, and Utility: New Essays on the Moral\nPhilosophy of Richard Brandt</em>, Boulder, CO: Westview Press:\n115–26.</li>\n<li>Haslett, D.W., 1987, <em>Equal Consideration: A Theory of Moral\nJustification</em>, Newark, Del.: University of Delaware Press.</li>\n<li>–––, 1994, <em>Capitalism With Morality</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2000, “Values, Obligations, and\nSaving Lives”, in Hooker, Mason, and Miller 2000, pp.\n71–104.</li>\n<li>Hill, T.E., Jr., 2005, “Assessing Moral Rules: Utilitarian\nand Kantian Perspectives”, <em>Philosophical Issues</em>, 15:\n158–178.</li>\n<li>Hills, A., 2010, “Utilitarianism, Contractualism and\nDemandingness”, <em>Philosophical Quarterly</em>, 60:\n225–42.</li>\n<li>Hodgson, D.H., 1967, <em>Consequences of Utilitarianism</em>,\nLondon: Oxford University Press.</li>\n<li>Hooker, B., 2000, <em>Ideal Code, Real World: A\nRule-consequentialist Theory of Morality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2003, “Review of Mulgan’s\n<em>Demands of Consequentialism</em>”, <em>Philosophy</em>, 78:\n289–96.</li>\n<li>–––, 2005, “Reply to Arneson and\nMcIntyre”, <em>Philosophical Issues</em>, 15: 264–81.</li>\n<li>–––, 2007, “Rule-consequentialism and\nInternal Consistency: A Reply to Card”, <em>Utilitas</em>, 19:\n514–19.</li>\n<li>–––, 2008, “Rule-consequentialism versus\nAct-consequentialism”, <em>Politea</em>, 24: 75–85.</li>\n<li>–––, 2010, “Publicity in Morality: A Reply\nto Katarzyna de Lazari-Radek and Peter Singer”, <em>Ratio</em>,\n23: 111–117.</li>\n<li>–––, 2014, “Must Kantian Contractualism\nand Rule-consequentialism Converge?’”, <em>Oxford Studies\nin Normative Ethics</em>, 4: 34–52.</li>\n<li>–––, 2016, “Wrongness, Evolutionary\nDebunking, Public Rules”, <em>Etica &amp; Politica</em>, 18:\n133–149.</li>\n<li>–––, forthcoming,\n“Rule-consequentialism’s Essence and Rationale”, in\nDavid Copp, Connie Rosati, and Tina Rulli (eds.), <em>Oxford Handbook\nof Normative Ethics</em>, New York: Oxford University Press.</li>\n<li>Hooker, B. and G. Fletcher, 2008, “Variable versus\nFixed-rate Rule-utilitarianism”, <em>Philosophical\nQuarterly</em>, 58: 344–352.</li>\n<li>Hooker, B., E. Mason, and D. Miller (eds.), 2000, <em>Morality,\nRules, and Consequences</em>, Edinburgh: Edinburgh University\nPress.</li>\n<li>Hospers, J., 1972, <em>Human Conduct, Problems of Ethics</em>, New\nYork: Harcourt Brace Jovanovich, Inc.</li>\n<li>Hursthouse, R., 1999, <em>On Virtue Ethics</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2002, “Virtue Ethics vs\nRule-Consequentialism”, <em>Utilitas</em>, 14: 41–53.</li>\n<li>Ihara, C., 1981, “Toward a Rule-Utilitarian Theory of\nSupererogation”, <em>Philosophy Research Archives</em>, 7:\n582–98</li>\n<li>Johnson, C., 1991, <em>Moral Legislation</em>, New York: Cambridge\nUniversity Press.</li>\n<li>Kagan, S., 1989, <em>The Limits of Morality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1998, <em>Normative Ethics</em>, Boulder,\nCO: Westview Press.</li>\n<li>–––, 1999, “Equality and Desert”, in\nPojman and McLeod (eds.) <em>What Do We Deserve?</em>, New York:\nOxford University Press, pp. 298–314.</li>\n<li>–––, 2000, “Evaluative Focal\nPoints”, in Hooker, Mason, and Miller 2000, pp.\n134–55.</li>\n<li>Kahn, L., 2012, “Rule Consequentialism and Scope”,\n<em>Ethical Theory and Moral Practice</em>, 15: 631–46.</li>\n<li>–––, 2013, “Rule Consequentialism and\nDisasters”, <em>Philosophical Studies</em>, 162:\n219–36.</li>\n<li>Kamm, F., 2002, “Owing, Justifying, Rejecting: Thomas\nScanlon’s <em>What We Owe to Each Other</em>”,\n<em>Mind</em>, 111: 323–54.</li>\n<li>Lang, G., 2004, “A Dilemma for Objective\nAct-Utilitarianism”, <em>Politics, Philosophy and\nEconomics</em>, 3(2): 131–262.</li>\n<li>Law, I., 1999, “Rule-consequentialism’s\nDilemma”, <em>Ethical Theory and Moral Practice</em>, 2:\n263–76.</li>\n<li>Lawlor, R., 2004, “Hooker’s Ideal Code and the\nSacrifice Problem”, <em>Social Theory and Practice</em>, 30(4):\n583–587.</li>\n<li>Lazari-Radek, K. de and P. Singer, 2014, <em>The Point of View of\nthe Universe: Sidgwick and Contemporary Ethics</em>, Oxford, Oxford\nUniversity Press.</li>\n<li>Lenman, J., 2000, “Consequentialism and Cluelessness”,\n<em>Philosophy and Public Affairs</em>, 29: 342–70.</li>\n<li>Levy, S., 2000, “The Educational Equivalence of Act and Rule\nUtilitarianism”, in Hooker, Mason, and Miller 2000:\n27–39.</li>\n<li>–––, 2013, “A Contractualist Defense of\nRule Consequentialism”, <em>Journal of Philosophical\nResearch</em>, 38: 189–201.</li>\n<li>–––, 2014, “The Failure of Hooker’s\nArgument for Rule Consequentialism”, <em>Journal of Moral\nPhilosophy</em>, 11: 598–614.</li>\n<li>Lewis, D., 1972, “Utilitarianism and Truthfulness”,\n<em>Australasian Journal of Philosophy</em>, 50: 17–19.</li>\n<li>Lyons, D., 1965, <em>Forms and Limits of Utilitarianism</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 1994, <em>Rights, Welfare, and Mill’s\nMoral Theory</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2000, “The Moral Opacity of\nUtilitarianism”, in Hooker, Mason, and Miller 2000, pp.\n105–120.</li>\n<li>Mabbott, J. D., 1953, “Moral Rules”, <em>Proceedings\nof the British Academy</em>, 37: 97–117, esp.\n107–117.</li>\n<li>Martin, R., 2010, “Mill’s Rule Utilitarianism in\nContext”, in B. Eggleston, D. Miller, &amp; D. Weinstein (eds.),\n<em>John Stuart Mill and the Art of Life</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>McIntyre, A., 2005, “The Perils of Holism: Brad\nHooker’s Ideal Code, Real World”, <em>Philosophical\nIssues</em>, 15: 252–263.</li>\n<li>McNaughton, P. and P. Rawling, 1998, “On Defending\nDeontology”, <em>Ratio</em>, 11: 37–54.</li>\n<li>Mill, J. S., 1861, <em>Utilitarianism</em>, numerous\neditions.</li>\n<li>Miller, D., 2000, “Hooker’s Use and Abuse of\nReflective Equilibrium”, in Hooker, Mason and Miller 2000, pp.\n156–78.</li>\n<li>–––, 2010, <em>John Stuart Mill</em>, Cambridge:\nPolity Press.</li>\n<li>–––, 2014, “Rule Consequentialism”,\nin B. Eggleston and D. Miller (eds.), <em>Cambridge Companion to\nUtilitarianism</em>.</li>\n<li>–––, 2021, “Moral Education and Rule\nConsequentialism”, <em>Philosophical Quarterly</em>, 71:\n120–140.</li>\n<li>Miller, T., 2016, “Solving Rule Consequentialism’s\nAcceptance Rate Problem”, <em>Utilitas</em>, 28:\n41–53.</li>\n<li>–––, 2021, “From Compliance, to\nAcceptance, to Teaching: On Relocating Rule Consequentialism’s\nStipulations”, <em>Utilitas</em>, 33: 204–220.</li>\n<li>Miller, R. B., 2009, “Actual Rule Utilitarianism”,\n<em>Journal of Philosophy</em>, 106: 5–28.</li>\n<li>Montague, P., 2000, “Why Rule Consequentialism Is Not\nSuperior to Ross-Style Pluralism”, in Hooker, Mason, and Miller\n2000, pp. 203–11.</li>\n<li>Moore, A., 2007, “Ethical Theory, Completeness &amp;\nConsistency”, <em>Ethical Theory and Moral Practice</em>, 10:\n297–308.</li>\n<li>Moore, G. E., 1903, <em>Principia Ethica</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1912, <em>Ethics</em>, London: Oxford\nUniversity Press.</li>\n<li>Mulgan, T., 2001, <em>The Demands of Consequentialism</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2006, <em>Future People</em>, Oxford:\nOxford University Press, chs. 2, 6.</li>\n<li>–––, 2009, “Rule Consequentialism and\nNon-Identity”, in D. Wasserman &amp; M. Roberts (eds.),\n<em>Harming Future Persons</em>, Dordrecht: Springer, pp.\n115–34.</li>\n<li>–––, 2015, “Utilitarianism for a Broken\nWorld”, <em>Utilitas</em>, 27: 92–114.</li>\n<li>–––, 2017, “How Should Utilitarians Think\nAbout the Future?”, <em>Canadian Journal of Philosophy</em>, 47:\n290–312.</li>\n<li>–––, 2020, <em>Utilitarianism</em>, Cambridge:\nCambridge University Press.</li>\n<li>Nebel, J., 2012, “A Counterexample to Parfit’s Rule\nConsequentialism” (Discussion Note), <em>Journal of Ethics and\nSocial Philosophy</em>, July,\n &lt;<a href=\"http://www.jesp.org/articles/download/counterexample_to_parfits_rule_consequentialism.pdf\" target=\"other\">available online</a>&gt;.</li>\n<li>Norcross, A., 2002, “Contractualism and Aggregation”,\n<em>Social Theory and Practice</em>, 28: 303–14.</li>\n<li>Overvold, M., 1980, “Self-interest and the Concept of\nSelf-sacrifice”, <em>Canadian Journal of Philosophy</em>, 10:\n105–18.</li>\n<li>–––, 1982, “Self-interest and Getting What\nYou Want”, <em>The Limits of Utilitarianism</em>, H.B. Miller\nand W.H. Williams (eds.), Minneapolis: University of Minnesota Press,\npp. 186–94.</li>\n<li>Parfit, D., 1984, <em>Reasons and Persons</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1997, “Equality and Priority”,\n<em>Ratio</em>, 10: 202–21.</li>\n<li>–––, 2003, “Justifiablity to Each\nPerson”, <em>Ratio</em>, 16: 368–90.</li>\n<li>–––, 2011, <em>On What Matters</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2017a, <em>On What Matters</em> (Volume 3),\nOxford: Oxford University Press.</li>\n<li>–––, 2017b, “Responses”, in S.\nKirchin (ed.), <em>Reading Parfit</em>, Abingdon: Routledge, pp.\n189–236.</li>\n<li>Perl, C., 2021, “Solving the Ideal Worlds Problem”,\n<em>Ethics</em>, 132: 89–126.</li>\n<li>–––, 2022, “Some Question-Begging\nObjections to Rule consequentialism”, <em>Australasian Journal\nof Philosophy</em>, first online 29 August 2022.\ndoi:10.1080/00048402.2022.2056213</li>\n<li>Pettit, P., 1991, “Consequentialism”, in <em>Companion\nto Ethics</em>, edited by Peter Singer, Oxford: Blackwell Publishers\npp. 230–40.</li>\n<li>–––, 1994, “Consequentialism and Moral\nPsychology”, <em>International Journal of Philosophical\nStudies</em>, 2: 1–17.</li>\n<li>–––, 1997, “The Consequentialist\nPerspective”, in M. Baron, P. Pettit, and M. Slote, <em>Three\nMethods of Ethics</em>, Malden, MA: Blackwell Publishers, pp.\n92–174.</li>\n<li>–––, 2017, <em>The Robust Demands of the\nGood</em>, Oxford: Oxford University Press.</li>\n<li>Pettit, P. and G. Brennan, 1986, “Restrictive\nConsequentialism”, <em>Australasian Journal of Philosophy</em>,\n64: 438–55.</li>\n<li>Pettit, P. and M. Smith, 2000, “Global\nConsequentialism”, in Hooker, Mason, and Miller 2000, pp.\n221–33.</li>\n<li>Plato, <em>c</em> 380BC, <em>The Republic</em>.</li>\n<li>Podgorski, A., 2018, “Wouldn’t It Be Nice? Moral Rules\nand Distant Worlds”, <em>Noûs</em>, 52:\n279–294.</li>\n<li>Portmore, D., 2009, “Rule-Consequentialism and Irrelevant\nOthers”, <em>Utilitas</em> 21: 368–76.</li>\n<li>–––, 2017, “Parfit on Reasons and Rule\nConsequentialism”, in S. Kirchin (ed.), <em>Reading Parfit: On\nOn What Matters</em>, Abingdon: Routledge.</li>\n<li>Rajczi, A., 2016, “On the Incoherence Objection to\nRule-Utilitarianism”, <em>Ethical Theory and Moral\nPractice</em>, 19: 857–876.</li>\n<li>Railton, P., 1984, “Alienation, Consequentialism, and the\nDemands of Morality”, <em>Philosophy and Public Affairs</em>,\n13: 174–31.</li>\n<li>Raz, J., 2003, “Numbers, With and Without\nContractualism”, <em>Ratio</em>, 16: 346–367.</li>\n<li>Rawls, J., 1951, “Outline for a Decision Procedure in\nEthics”, <em>Philosophical Review</em>, 60: 177–97.</li>\n<li>–––, 1955, “Two Concepts of Rules”,\n<em>Philosophical Review</em>, 64: 3–32.</li>\n<li>–––, 1971, <em>A Theory of Justice</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Ridge, M., 2006, “Introducing Variable-Rate\nRule-Utilitariansim”, <em>Philosophical Quarterly</em>, 56:\n242–53.</li>\n<li>Riley, J., 2000, “Defending Rule Utilitarianism”, in\nHooker, Mason, and Miller 2000, pp. 40–69.</li>\n<li>Ross, J., 2009, “Should Kantians Be\nConsequentialists?”, <em>Ratio</em>, 22: 126–35.</li>\n<li>Ross, W.D., 1930, <em>The Right and the Good</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1939, <em>Foundations of Ethics</em>,\nOxford: Oxford University Press.</li>\n<li>Sayre-McCord, G., 1986, “Coherence and Models for Moral\nTheorizing”, <em>Pacific Philosophical Quarterly</em>, 18:\n170–90.</li>\n<li>–––, 1996, “Coherentist Epistemology and\nMoral Theory”, in W. Sinnott-Armstrong and M. Timmons (eds.),\n<em>Moral Knowledge?</em>, New York: Oxford University Press, pp.\n137–59.</li>\n<li>Scanlon, T.M., 1982, “Contractualism and\nUtilitarianism”, in Sen and Williams 1982: 103–28.</li>\n<li>–––, 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Sen, A. and B. Williams (eds.), 1982, <em>Utilitarianism and\nBeyond</em>, Cambridge: Cambridge University Press.</li>\n<li>Shaw, W., 1993, “Welfare, Equality, and Distribution: Brandt\nfrom the Left”, in B. Hooker (ed.), <em>Rationality, Rules, and\nUtility: New Essays on the Moral Philosophy of Richard Brandt</em>,\nBoulder, CO: Westview Press: 165–87.</li>\n<li>–––, 1999, <em>Contemporary Ethics: Taking\nAccount of Utilitarianism</em>, Cambridge, MA: Blackwell\nPublishers.</li>\n<li>–––, 2000, “Between Act and Rule: The\nConsequentialism of G.E. Moore”, in Hooker, Mason, and Miller\n2000: 6–26.</li>\n<li>Sidgwick, H., 1907, <em>Methods of Ethics</em>, seventh edition,\nLondon: Macmillan; first edition, 1874.</li>\n<li>Singer, M., 1955, “Generalization in Ethics”,\n<em>Mind</em>, 64: 361–75.</li>\n<li>–––, 1961, <em>Generalization in Ethics</em>,\nNew York: Knopf.</li>\n<li>Singer, P., 1972, “Is Act-utilitarianism\nSelf-defeating?” <em>Philosophical Review</em>, 81:\n94–104.</li>\n<li>Smart, J.J.C., 1956, “Extreme and Restricted\nUtilitarianism”, <em>Philosophical Quarterly</em>, 6:\n344–54.</li>\n<li>–––, 1973, “Outline of a System of\nUtilitarian Ethics”, in J.J.C. Smart and Bernard Williams,\n<em>Utilitarianism: For and Against</em>, Cambridge: Cambridge\nUniversity Press, pp. 3–74.</li>\n<li>Smith, H., 2010, “Measuring the Consequences of\nRules”, <em>Utilitas</em>, 22: 413–33.</li>\n<li>Sorensen, R., 1996, “Unknowable Obligations”,\n<em>Utilitas</em>, 7: 247–71.</li>\n<li>Stratton-Lake, P., 1997, “Can Hooker’s\nRule-Consequentialist Principle Justify Ross’s Prima Facie\nDuties?”, <em>Mind</em>, 106: 151–58.</li>\n<li>Streumer, B., 2003, “Can Consequentialism Cover\nEverything?”, <em>Utilitas</em>, 15: 237–47.</li>\n<li>Suikkanen, J., 2008, “A Dilemma for\nRule-consequentialism”, <em>Philosophia</em>, 36:\n141–150.</li>\n<li>–––, 2014, “Contractualism and the\nConditional Fallacy”, <em>Oxford Studies in Normative\nEthics</em>, 4: 113–137.</li>\n<li>–––, 2022, “Hooker’s\nRule-consequentialism and Scanlon’s Contractualism—A\nRe-evaluation”, <em>Ratio</em>, 35: 261–74.</li>\n<li>Sumner, L. W., 1996, <em>Welfare, Happiness, and Ethics</em>,\nOxford: Oxford University Press.</li>\n<li>Temkin, L., 1993, <em>Inequality</em>, Oxford: Oxford University\nPress.</li>\n<li>Thomas, A., 2000, “Consequentialism and the Subversion of\nPluralism”, in Hooker, Mason, and Miller 2000, pp.\n179–202.</li>\n<li>Tobia, K., 2013, “Rule Consequentialism and the Problem of\nPartial Acceptance”, <em>Ethical Theory and Moral Practice</em>,\n16: 643–52.</li>\n<li>–––, 2018, “Rule-consequentialism’s\nAssumptions”, <em>Utilitas</em>, 30: 458–471.</li>\n<li>Toppinen, T., 2016, “Rule Consequentialism (and Kantian\nContractualism) at Top Rates”, <em>Philosophical Quarterly</em>,\n66: 122–135.</li>\n<li>Toulmin, S., 1950, <em>The Place of Reason in Ethics</em>,\nCambridge: Cambridge University Press.</li>\n<li>Urmson, J.O., 1953, “The Interpretation of the Moral\nPhilosophy of J.S. Mill”. <em>Philosophical Quarterly</em>, 10:\n33–9.</li>\n<li>–––, 1975, “A Defence of\nIntuitionism”, <em>Proceedings of the Aristotelian Society</em>,\n75: 144–52.</li>\n<li>Wall, E., 2009, “Hooker’s Consequentialism and the\nDepth of Moral Experience”, <em>Dialogue</em>, 48:\n337–51</li>\n<li>Williams, B., 1973a, “Egoism and Altruism”, in B.\nWilliams, <em>Problems of the Self</em>, Cambridge: Cambridge\nUniversity Press, pp. 250–65.</li>\n<li>–––, 1973b, “A Critique of\nUtilitarianism”, in J. J. C. Smart and B. Williams,\n<em>Utilitarianism: For &amp; Against</em>, Cambridge: Cambridge\nUniversity Press, pp. 77–150.</li>\n<li>–––, 1982, “The Point of View of the\nUniverse: Sidgwick and the Ambitions of Ethics”, <em>The\nCambridge Review</em>, (7 May); reprinted in Williams 1995:\n153–71.</li>\n<li>–––, 1995, <em>Making Sense of Humanity and\nOther Essays</em>, Cambridge: Cambridge University Press.</li>\n<li>Wolf, S., 2016, “Two Concepts of Rule Utilitarianism”,\n<em>Oxford Studies in Normative Ethics</em>, 6: 123–144.</li>\n<li>Woollard, F., 2015, <em>Doing and Allowing Harm</em>. Oxford:\nOxford University Press.</li>\n<li>–––, 2022, “Hooker’s\nRule-consequentialism, Disasters, Demandingness, and Arbitrary\nDistinctions”, <em>Ratio</em>, 35: 289–300.</li>\n<li>Woodard, C., 2019, <em>Taking Utilitarianism Seriously</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2022, “Reasons for\nRule-consequentialists”, <em>Ratio</em>, 35: 251–60.</li>\n<li>Yeo, S., 2017, “Measuring the Consequences of Rules: A Reply\nto Smith”, <em>Utilitas</em>, 29: 125–31.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "consequentialism",
            "equality"
        ],
        "entry_link": [
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../equality/": "equality"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=consequentialism-rule\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/consequentialism-rule/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=consequentialism-rule&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/consequentialism-rule/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=consequentialism-rule": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/consequentialism-rule/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=consequentialism-rule&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/consequentialism-rule/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.iep.utm.edu/util-a-r/#H2\" target=\"other\">Utilitarianism: Act and Rule</a>,\n entry in the <em>Internet Encyclopedia of Philosophy</em>."
        ],
        "listed_links": [
            {
                "https://www.iep.utm.edu/util-a-r/#H2": "Utilitarianism: Act and Rule"
            }
        ]
    }
}