{
    "url": "conway",
    "title": "Lady Anne Conway",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Sarah Hutton\n<sarah.hutton@york.ac.uk>",
        "author_links": [
            {
                "mailto:sarah%2ehutton%40york%2eac%2euk": "sarah.hutton@york.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nSarah Hutton\n&lt;<a href=\"mailto:sarah%2ehutton%40york%2eac%2euk\"><em>sarah<abbr title=\" dot \">.</abbr>hutton<abbr title=\" at \">@</abbr>york<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Feb 13, 2003",
        "substantive revision Fri Feb 21, 2020"
    ],
    "preamble": "\n\nLady Anne Conway (nee Anne Finch) was one of a tiny minority of\nseventeenth-century women who was able to pursue an interest in\nphilosophy. She was associated with the Cambridge Platonists,\nparticularly Henry More (1614–1687). Her only surviving\ntreatise, Principles of the Most Ancient and Modern\nPhilosophy, was published posthumously and anonymously in 1690.\nThis propounds a vitalist ontology of spirit, derived from the\nattributes of God, which she sets out in opposition to More,\nDescartes, Hobbes and Spinoza. Her philosophy was received favorably\nby Leibniz.\n",
    "toc": [
        {
            "#Life": "1. Life"
        },
        {
            "#ConwPhilOutl": "2. Conway’s Philosophy in Outline"
        },
        {
            "#Subs": "3. Substance"
        },
        {
            "#Crea": "4. Creatures"
        },
        {
            "#Perf": "4. Perfectibility"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\nLady Anne Conway (née Finch) (1631–1679) was the\nposthumous daughter of Sir Heneage Finch and his second wife Elizabeth\nCradock, widow of Sir John Bennet. She was born in London in 1631, and\nraised in the house now known as Kensington Palace, which then\nbelonged to the Finch family. The youngest child in a large family,\nshe was especially close to her half-brother, John Finch. Nothing is\nknown of her education, though she was clearly well-read by the time\nshe made the acquaintance of one of the\n Cambridge Platonists (see entry),\n Henry More (1614–1687). Of Anne Conway’s remarkable\nphilosophical education, much more is known. Thanks to her brother,\nwho was his pupil at Christ’s College, University of Cambridge, More\nagreed to give her instruction in philosophy. Since, as a woman, she\nwas debarred from attending the university, he instructed her by\nletter. The few letters that survive from this early correspondence\nindicate that Cartesianism formed the basis of the course of\ninstruction she followed. Thereafter, Anne Conway and More remained\nfriends for the rest of her life. By this means she had a permanent\nlink to intellectual life beyond the confines of her domestic\nsituation.\n\nIn 1651 Anne Conway married Edward, third Viscount Conway, who was\nheir to estates in Warwickshire and County Antrim in Ireland. Their\none child, Heneage, died in infancy. The Conway family possessed one\nof the finest private libraries of the period, and her husband appears\nto have encouraged his wife’s intellectual interests. However, from\nher teens she suffered from periodic bouts of illness, which became\nmore acute and more frequent as she got older. It was as a result of a\nsearch for relief from this that she came into contact with the\nFlemish physician and philosopher, Francis Mercury van Helmont, son of\nthe iatrochemist, Jan Baptiste van Helmont. During the last decade of\nher life, the younger Van Helmont lived in her household. It was\nthrough Van Helmont that Anne Conway was introduced to kabbalistic\nthought and to Quakerism. These encounters resulted in radical new\ndepartures for her: on the one hand, her study of the Jewish kabbalah\ncontributed to her decisive break with the Cartesianism of her\nphilosophical upbringing; on the other hand, her encounter with Van\nHelmont’s Quaker friends led to her conversion to Quakerism, shortly\nbefore she died in 1679.\n2. Conway’s Philosophy in Outline\n\nAnne Conway is known to be the author of a single treatise of\nphilosophy. This was written at the end of her life and published\nanonymously in Amsterdam in 1690 in a Latin translation with the\ntitle, Principia philosophiae antiquissimae et recentissimae.\nIt was translated back into English and printed in London in 1692 as\nThe Principles of the Most Ancient and Modern Philosophy. The\nother source for her philosophical activities is her correspondence\nwith Henry More.\n\nAnne Conway’s treatise is a work of Platonist metaphysics in which she\nderives her system of philosophy from the existence and attributes of\nGod. The framework of Conway’s system is a tripartite ontological\nhierarchy of “species”, the highest of which is God, the\nsource of all being. Christ, or “middle nature”, links God\nand the third species, called “Creature”. God as the most\nperfect being is infinitely good, wise, and just. A principle of\nlikeness links God and creation. Since God is good and just, his\ncreation too is good and just. Created substance, like God, consists\nof spirit, but, unlike God, is constituted of infinite multiples of\nspirit particles, which, as unities in multiplicity, may be described\nas monadic (though not in a Leibnizian sense). All created substance\nis living, capable of motion and perception. Anne Conway denies the\nexistence of material body as such, arguing that inert corporeal\nsubstance would contradict the nature of God, who is life itself.\nIncorporeal created substance is, however, differentiated from the\ndivine, principally on account of its mutability and multiplicity even\nso, the infinite number and constant mutability of created things\nconstitutes an obverse reflection of the unity, infinity, eternity and\nunchangeableness of God. The continuum between God and creatures is\nmade possible through “middle nature”, an intermediary\nbeing, through which God communicates life, action, goodness and\njustice. “Middle nature”, partakes of the nature of both\nGod and creation, and is therefore both a bridge and a buffer between\nGod and created things. Thus, although she conceives of created\nsubstance as a continuum, and understands mutability as capacity for\nincreased perfection, she sought to avoid the charge of pantheism. The\nspiritual perfectionism of Anne Conway’s system has a dual aspect:\nmetaphysical and moral. On the one hand all things are capable of\nbecoming more spirit-like, that is, more refined qua spiritual\nsubstance. At the same time, all things are capable of increased\ngoodness. She explains evil as a falling away from the perfection of\nGod, and understands suffering as part of a longer term process of\nspiritual recovery. She denies the eternity of hell, since for God to\npunish finite wrong-doing with infinite and eternal hell punishment\nwould be manifestly unjust and therefore a contradiction of the divine\nnature. Instead she explains pain and suffering as purgative, with the\nultimate aim of restoring creatures to moral and metaphysical\nperfection. Anne Conway’s system is thus not just an ontology and but\na theodicy.\n3. Substance\n\nStrictly speaking, Conway’s metaphysics is an ontology of three\nkinds of being, which she calls “species”. Each of these\nis a single substance distinguished by a particular set of properties\nwhich determine its essence, and set its ontological boundaries.\nConway holds that there can only be three species, and one species\ncannot transform into another. The species are nevertheless\ninter-connected through their shared properties (principally the\n“communicable” attributes of God), and differentiated by\nothers (principally mutability which is a property of the second and\nthird species). The second species (Christ or Middle nature) is\ndifferentiated from both God and other created things because it also\nretains God’s immutability. As a causal intermediary between God\nand Created Nature, Middle nature is analogous to Cudworth’s\nPlastic Nature and More’s Spirit of Nature, but a divinized\nversion.\n\nThe question of substance dualism within one of the three species only\narises in relation to the third species or created being. This species\nis itself a unity in multiplicity, since it is a single substance\ncomprising innumerable spirit particles, which Conway also calls\nspecies (a term indicative of their being parts that constitute the\nwhole). The third species as a whole is thus a unity of multiplicities\n(“the whole creation is just but one substance or entity”,\nexhibiting “a general unity of creatures with one\nanother”; Principles VII.4). Each of these spirit\nparticles consists of infinite spirit particles, every one of which\ncontains infinite numbers of others. These entities may be considered\nmonadic in the sense that each is a unity. But, like created nature as\na whole, they are unities in multiplicity, there being “a\nspecial and peculiar unity among the parts of one [individual] species\nin particular” (Principles, VII.4). It is from\naggregates of these that creatures are formed. The mutability of all\ncreated beings means that there is considerable—nay\ninfinite—variety within created nature.\n\nConway’s case for substance monism rests on fundamental\nprinciples of her metaphysics: it is grounded first in her vitalist\nconception of all being. On the principle of similitude whereby all\nthings bear some resemblance to God, everything in existence must be\nin some sense alive—from God down through angels, to human\nbeings, animals, plants and mere dust. There are of course other\nattributes of created things not shared by God (mutability, shape or\n“figure” and solidity or density). Also, creatures, unlike\nGod, are multiple and subject to time. Since all substance created by\nGod must be living, it follows there can be no non-living substance.\nFurthermore, matter being nothing but inert extension\n(“dead” is Conway’s adjective) is devoid of likeness\nto God, so cannot exist. It follows that body and soul (or spirit) are\nnot distinct substances, but different gradations or modes of the same\nsubstance. Secondly, all created things are subject to change, and\nchange is only possible between things that are alike. This holds both\nfor divine causality and change within created nature. The main limit\nto change is ontological: creatures may change radically, but not to\nthe extent that they might lose any of their essential properties, or\nacquire others, for that would entail change of substance. It follows,\ntherefore, that within the ontological parameters of the third\nspecies, all changes are changes of degree or mode, not substance.\n\nFor Conway body is, therefore, not a substance distinct from spirit,\nbut both are modes of the same created substance differentiated only\nby relative density. Conway uses the metaphor of light and dark to\nexpress the difference between them, light being associated with\nspirit (soul) and darkness with body. In the scale of being, the\nhigher creatures are more active, spiritual and bright, while the\nlower creatures are on the scale, the less active and more corporeal\nand darker they become, though they never become completely dark. \n4. Creatures\n\nAll creatures, humans, animals, plants and minerals, consist of\ncomposites of spirit and body (in Conway’s sense), each of which\ncontains infinite numbers of other creatures, compounded, in their\nturn of infinite creatures. All creatures interact and\ninter-communicate by means of the emanation of spirits (even the most\ndense bodies, produce and emit other, finer, or more subtle spirits).\nCreatures are, furthermore subject to change. These changes can be\nradical—body can become spirit and vice versa, while creatures\ncan metamorphose into other creatures, up or down the scale of nature.\nCreaturely change takes the form of reconfigurations or as it were\nre-balancing of the constituent corporeal and spiritual elements that\nmake-up a particular creature. This reflects the relative goodness of\nthe creature, such that the more good, and therefore more godlike a\ncreature becomes, the more spiritual its make-up. This is manifest in\nterms of its increase or loss of capacity for action—the more\nspiritual a creature, the more volatile and more able to act\n(“active and operative”) and vice versa.\n\nThe mutable state of creatures raises the question of how far a\ncreature can change and still be the same individual thing?\nConway’s answer is that outwardly every creature may change\nradically, though not to such an extent that it exceeds the\nontological boundaries of the third species/created nature (e.g., by\nacquiring the attributes of a higher species, God or Christ, or losing\nthe attribute of life). Creaturely change occurs across successive\nlife-times, rather than in the course of a single life span. The\nidentity of a creature is not co-terminous with its natural life span,\nbut persists throughout its existence in time. Thus a horse (to use\nthe example she gives) may transform into a human being through\nincremental changes across in successive life spans. But its identity\nas a living being persists through these changes. Conway explains\nexplains the continuous identity of an individual creature from one\nstate to another and across time, partly through her conception of the\ncomposition of living creatures, which are structured as organized\norderly composites, the unity of which is sustained by a dominant\nspirit: \n\n\nthe unity of the spirits composing this spirit is…so great that\nnothing can dissolve it…thus it happens that the soul of every\nhuman being will remain a whole soul for eternity.\n(Principles, VII.4; see Thomas 2017, Hutton 2004). \n\n\nThis “captain spirit”, determines the moral constitution\nof the creature, and its continuous identity across time, throughout\nthe metamorphoses which the creature undergoes. Another limit on\ncreaturely change is that an individual creature cannot transform into\nanother individual (Peter cannot become Paul, or Judas). The reason\nfor this rests with divine justice: it would be unjust for Peter to be\nrewarded for Paul’s righteousness, or for Peter to be punished\nfor the sins of Judas.\n4. Perfectibility\n\nA key feature of Conway’s system is perfectibility. All created\nbeings have the potential to increase in perfection. Perfectibility is\ngrounded in divine goodness, and made possible by the mutability of\ncreated things. Holding to the Platonic conception of goodness as\ngodlikeness, Conway argues that since all creatures have some\nresemblance to God, all creatures are endowed with a capacity for\ngood, and an impulse to strive for greater good (“continual\nmotion or operation, which most certainly strives for their further\ngood”; Principles VI.6). Everything is thus\nperfectible, with the potential to increase in goodness, even beyond\nits original state in its first creation, ad infinitum. But\nnothing can become infinitely good, because then it would become\nGod.\n\nHowever, the mutability of the creatures’ condition means that\nthey may change for the worse. There is no inevitability about this,\nsince moral corruption in creatures results from either a deliberate\nact of will or indifference of will (a failure to pursue the good)\n(Lascano 2018). The moral degeneration of the creature is mitigated by\nthe fact that no creature can become so corrupt as to lose its\nGod-given goodness entirely. (A creature utterly lacking in goodness\nwould be so unlike God that it could not exist). The residual goodness\nof the creature holds out the possibility of recovery from its\ndegenerate state. To understand how this comes about, let us recall,\nfirst, that the change in creatures is physical as well as moral, such\nthat as a creature degenerates, it becomes more corporeal\n(“hardened”). Furthermore, just as a creature can never\nbecome utterly evil, so it can never be reduced to mere corporeality,\nbecause that would be a lifeless condition, so unlike to God as not to\nexist.\n\nThe second factor in the regenerative process is punishment for sin:\nhere pain has a crucial role. Conway holds that the disequilibrium\nbetween corporeality and spirit, whereby it becomes more corporeal, is\na painful condition. The pain so experienced is punishment for the sin\nwhich brought about it to this condition (in that respect sin is its\nown punishment). But Conway holds, further, that the purpose of\npunishment is not merely retributive; pain has a purgative effect on\nthe degenerate creature, leading to its release from its overly\ncorporeal, inactive condition, and enabling it to reset itself on a\ntrajectory of recovery of its original godlikeness. In this process\nits constitutional composition becomes increasingly refined\n(spirit-like) in tandem with its increase in goodness. The\ntrajectories of degeneration, on the one hand, and amelioration echo\nPlato’s account of immortality of the soul in the Phaedo\n80d–84b. In Conway’s version, pain and suffering are\nbeneficial because they have a restorative function, thereby playing a\ncrucial role in sustaining the over-all dynamic towards perfectibility\nin her metaphysical system. In this way Conway vindicates the justice\nof God.  Conway’s system is thus a theodicy, which explains pain\nand suffering as a transient conditions, contributory to the\namelioration and recovery of creatures. The consequences in terms of\nreligious belief are that Conway denies the eternity of hell\npunishment and upholds the doctrine the universal salvation or\napocotastasis.\n5. Conclusion\n\nAnne Conway presents her system as an answer to the dominant\nphilosophies of her time. Several chapters of her treatise are devoted\nto a refutation of the dualism of Henry More and Descartes. (She does,\nhowever, express her admiration for Descartes’ physics). She also\ntakes issue with Hobbes and Spinoza, whom she charges with material\npantheism, which confounds God and created substance. Anne Conway’s\nconcept of substance probably owes much to Platonism and Kabbalism\n(which, in the version she encountered was heavily Platonised). Her\nthinking also shows the impact of the teachings of the heterodox\nChristian theologian, Origen, who was much admired by her teacher,\nHenry More. In many respects, her system anticipates the philosophy of\nGottfried Wilhelm Leibniz, who recognized affinities with his own\nphilosophy. (Leibniz in fact owned a copy of her\ntreatise—probably a gift to him by their mutual friend, Van\nHelmont). However, although she was unusual as a female philosopher of\nthe seventeenth century, by virtue of the fact that her philosophy\nachieved publication, the anonymity of Conway’s work has ensured\nthat she has suffered the same neglect that has been the lot of most\npre-modern female philosophers.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Conway, Anne, <em>Principia philosophiae antiquissimae et recentissimae de Deo,\nChristo et Creatura id est de materia et spiritu in genere</em>.\nAmsterdam, 1690.",
                "Conway, Anne, <em>The Principles of the Most Ancient and Modern Philosophy</em>.\nLondon, 1692.\n [<a href=\"https://digital.library.upenn.edu/women/conway/principles/principles.html\" target=\"other\"><em>Principles</em> 1692 available online</a>]",
                "Conway, Anne, <em>The Principles of the Most Ancient and Modern\nPhilosophy</em>, Allison P. Coudert and Taylor Corse (trans/eds),\nCambridge: Cambridge University Press, 1996.\ndoi:10.1017/CBO9780511597978",
                "<em>The Conway Letters: The Correspondence of Anne, Viscountess\nConway, Henry More, and Their Friends 1642–1684</em>, Marjorie\nHope Nicolson and Sarah Hutton (eds.), Oxford: Clarendon Press, 1992.\ndoi:10.1093/actrade/9780198248767.book.1",
                "Plato, <em> The Collected Dialogues of Plato</em>, edited by Edith Hamilton and Huntington Cairns, Princeton: Princeton University Press, 1978 (first published 1961).\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Borcherding, Julia, 2019, “Nothing is Simply One Thing:\nConway on Multiplicity in Causation and Cognition”, in\n<em>Causation and Cognition in Early Modern Philosophy</em>, Dominik\nPerler and Sebastian Bender (eds), (Routledge Studies in\nSeventeenth-Century Philosophy), London: Routledge,\n123–144.",
                "–––, forthcoming, “Loving the Body, Loving\nthe Soul. Anne Conway’s Critique of Cartesian and Morean\nDualism”, <em>Oxford Studies in Early Modern Philosophy</em>,\n9.",
                "Boyle, Deborah, 2006, “Spontaneous and Sexual Generation in\nConway’s <em>Principles</em>”, in <em>The Problem of Animal\nGeneration in Early Modern Philosophy</em>, Justin E. H. Smith (ed.),\nCambridge: Cambridge University Press, 175–193.\ndoi:10.1017/CBO9780511498572.009",
                "Broad, Jacqueline, 2003, <em>Women Philosophers of the Seventeenth\nCentury</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511487125",
                "Brown, Stuart, 1990, “Leibniz and More’s Cabbalistic\nCircle”, in Hutton 1990: 77–95.\ndoi:10.1007/978-94-009-2267-9_5",
                "Coudert, Allison, 1998, <em>The Impact of the Kabbalah in the\nSeventeenth Century. The Life and Thought of Francis Mercury van\nHelmont, 1614–1698</em>, Leiden: Brill.",
                "Detlefsen, Karen, 2018, “Cavendish and Conway on the\nIndividual Human Mind”, in <em>Philosophy of Mind in the Early\nModern and Modern Ages</em>, Rebecca Copenhaver (ed.), New York:\nRoutledge, 134–56.",
                "Duran, Jane, 2006, <em>Eight Women Philosophers. Theory, Politics\nand Feminism</em>, Champaign, IL: University of Illinois Press.",
                "Gabbey, Alan, 1977, “Anne Conway et Henry More: Lettres sur\nDescartes”, <em>Archives de Philosophie</em>, 40(3):\n379–404.",
                "Gordon-Roth, Jessica, 2018, “What Kind of Monist Is Anne\nFinch Conway?”, <em>Journal of the American Philosophical\nAssociation</em>, 4(3): 280–297. doi:10.1017/apa.2018.24",
                "Grey, John, 2017, “Conway’s Ontological Objection to\nCartesian Dualism”, <em>Philosophers’ Imprint</em> 17.13:\n1–9.",
                "Hutton, Sarah (ed.), 1990, <em>Henry More (1614–1687)\nTercentenary Studies</em>, Dordrecht: Springer Netherlands.\ndoi:10.1007/978-94-009-2267-9",
                "–––, 1995, “Anne Conway critique\nd’Henry More: l’esprit et la matière”, <em>Archives\nde Philosophie</em>, 58(3): 371–384.",
                "–––, 2004, <em>Anne Conway: A Woman\nPhilosopher</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511487217",
                "–––, 2011, “Sir John Finch and Religious\nToleration: An Unpublished Letter to Anne Conway”, in <em>La\nCentralita del Dubbio. Un Progetto di Antonio Rotondo</em>, Luisa\nSimonutti and Camilla Hernanin (eds.), 2 vols., Florence: Olschki, pp.\n287–304.",
                "–––, 2018, “Goodness in Anne Conway’s\nMetaphysics”, in <em>Early Modern Women on Metaphysics</em>,\nEmily Thomas (ed.), Cambridge: Cambridge University Press,\n229–246. doi:10.1017/9781316827192.013",
                "–––, 2019, “‘As we observe by\ncontinued experience’. Experience and the Senses in the\nPhilosophy of Anne Conway”, <em>Bruniana e Campanelliana</em>,\nsupplement on <em>Filosofe e scienzate nel eta moderna</em>, \nSandra Plastina and Emilio Tommaso (eds), 51–64.",
                "Lascano, Marcy P., 2013, “Anne Conway: Bodies in the\nSpiritual World”, <em>Philosophy Compass</em>, 8(4):\n327–336. doi:10.1111/phc3.12025",
                "–––, 2018, “Anne Conway on Liberty”,\nin <em>Women and Liberty, 1600–1800: Philosophical Essays</em>,\nJacqueline Broad and Karen Detlefsen (eds), Oxford: Oxford University\nPress, 163–77.",
                "Mercer, Christia, 2012a, “ Knowledge and Suffering in Early\nModern Philosophy: G.W. Leibniz and Anne Conway”, in\n<em>Emotional Minds. The Passions and the Limits of Enquiry in Early\nModern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Göttingen: de\nGruyter, 179–206.\n [<a href=\"http://www.oapen.org/record/626358\" target=\"other\">Mercer 2012 available online</a>]",
                "–––, 2012b, “Platonism in Early Modern\nNatural Philosophy: The Case of Leibniz and Anne Conway”, in\n<em>Neoplatonism and the Philosophy of Nature</em>, James Wilberding\nand Christoph Horn (eds.), Oxford: Oxford University Press,\n103–126. doi:10.1093/acprof:oso/9780199693719.003.0006",
                "Merchant, Carolyn, 1979, “The Vitalism of Anne Conway: Its\nImpact on Leibniz’s Concept of the Monad”, <em>Journal of the\nHistory of Philosophy</em>, 17(3): 255–269.\ndoi:10.1353/hph.2008.0331",
                "O’Neill, Eileen, 1998, “History of Philosophy:\nDisappearing Ink: Early Modern Women Philosophers and Their Fate in\nHistory”, in <em>Philosophy in a Feminist Voice: Critiques and\nReconstructions</em>, Janet A. Kourany (ed.), Princeton: Princeton\nUniversity Press, 17–62. doi:10.1515/9781400822324.17",
                "Platas Benitez, Viridiana, forthcoming, “Percepcion sensible\ne imaginacion en la filosofia di Anne Conway”, <em>Annales del\nseminario de Historia de Filosofia</em>, Universidad Complutense de\nMadrid.",
                "Popkin, Richard H., 1990, “The Spiritualistic Cosmologies of\nHenry More and Anne Conway”, in Hutton 1990: 97–114.\ndoi:10.1007/978-94-009-2267-9_6",
                "Pugliese, Nastassja, 2019, “Monism and Individuation in Anne\nConway as a Critique of Spinoza”, <em>British Journal for the\nHistory of Philosophy</em>, 27(4): 771–785.\ndoi:10.1080/09608788.2018.1563764",
                "Thomas, Emily, 2017, “Time, Space, and Process in Anne\nConway”, <em>British Journal for the History of Philosophy</em>,\n25(5): 990–1010. doi:10.1080/09608788.2017.1302408",
                "–––, 2018a, “Anne Conway on the Identity\nof Creatures over Time”, in Thomas 2018b: 131–149.\ndoi:10.1017/9781316827192.008",
                "––– (ed.), 2018b, <em>Early Modern Women on\nMetaphysics</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781316827192",
                "–––, forthcoming, “Anne Conway as a\nPriority Monist: A Reply to Gordon-Roth”, <em>Journal of the\nAmerican Philosophical Association</em>.\n [<a href=\"http://dro.dur.ac.uk/27123/\" target=\"other\">Thomas forthcoming available online</a>]\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Conway, Anne, <em>Principia philosophiae antiquissimae et recentissimae de Deo,\nChristo et Creatura id est de materia et spiritu in genere</em>.\nAmsterdam, 1690.</li>\n<li>Conway, Anne, <em>The Principles of the Most Ancient and Modern Philosophy</em>.\nLondon, 1692.\n [<a href=\"https://digital.library.upenn.edu/women/conway/principles/principles.html\" target=\"other\"><em>Principles</em> 1692 available online</a>]</li>\n<li>Conway, Anne, <em>The Principles of the Most Ancient and Modern\nPhilosophy</em>, Allison P. Coudert and Taylor Corse (trans/eds),\nCambridge: Cambridge University Press, 1996.\ndoi:10.1017/CBO9780511597978</li>\n<li><em>The Conway Letters: The Correspondence of Anne, Viscountess\nConway, Henry More, and Their Friends 1642–1684</em>, Marjorie\nHope Nicolson and Sarah Hutton (eds.), Oxford: Clarendon Press, 1992.\ndoi:10.1093/actrade/9780198248767.book.1</li>\n<li>Plato, <em> The Collected Dialogues of Plato</em>, edited by Edith Hamilton and Huntington Cairns, Princeton: Princeton University Press, 1978 (first published 1961).</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Borcherding, Julia, 2019, “Nothing is Simply One Thing:\nConway on Multiplicity in Causation and Cognition”, in\n<em>Causation and Cognition in Early Modern Philosophy</em>, Dominik\nPerler and Sebastian Bender (eds), (Routledge Studies in\nSeventeenth-Century Philosophy), London: Routledge,\n123–144.</li>\n<li>–––, forthcoming, “Loving the Body, Loving\nthe Soul. Anne Conway’s Critique of Cartesian and Morean\nDualism”, <em>Oxford Studies in Early Modern Philosophy</em>,\n9.</li>\n<li>Boyle, Deborah, 2006, “Spontaneous and Sexual Generation in\nConway’s <em>Principles</em>”, in <em>The Problem of Animal\nGeneration in Early Modern Philosophy</em>, Justin E. H. Smith (ed.),\nCambridge: Cambridge University Press, 175–193.\ndoi:10.1017/CBO9780511498572.009</li>\n<li>Broad, Jacqueline, 2003, <em>Women Philosophers of the Seventeenth\nCentury</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511487125</li>\n<li>Brown, Stuart, 1990, “Leibniz and More’s Cabbalistic\nCircle”, in Hutton 1990: 77–95.\ndoi:10.1007/978-94-009-2267-9_5</li>\n<li>Coudert, Allison, 1998, <em>The Impact of the Kabbalah in the\nSeventeenth Century. The Life and Thought of Francis Mercury van\nHelmont, 1614–1698</em>, Leiden: Brill.</li>\n<li>Detlefsen, Karen, 2018, “Cavendish and Conway on the\nIndividual Human Mind”, in <em>Philosophy of Mind in the Early\nModern and Modern Ages</em>, Rebecca Copenhaver (ed.), New York:\nRoutledge, 134–56.</li>\n<li>Duran, Jane, 2006, <em>Eight Women Philosophers. Theory, Politics\nand Feminism</em>, Champaign, IL: University of Illinois Press.</li>\n<li>Gabbey, Alan, 1977, “Anne Conway et Henry More: Lettres sur\nDescartes”, <em>Archives de Philosophie</em>, 40(3):\n379–404.</li>\n<li>Gordon-Roth, Jessica, 2018, “What Kind of Monist Is Anne\nFinch Conway?”, <em>Journal of the American Philosophical\nAssociation</em>, 4(3): 280–297. doi:10.1017/apa.2018.24</li>\n<li>Grey, John, 2017, “Conway’s Ontological Objection to\nCartesian Dualism”, <em>Philosophers’ Imprint</em> 17.13:\n1–9.</li>\n<li>Hutton, Sarah (ed.), 1990, <em>Henry More (1614–1687)\nTercentenary Studies</em>, Dordrecht: Springer Netherlands.\ndoi:10.1007/978-94-009-2267-9</li>\n<li>–––, 1995, “Anne Conway critique\nd’Henry More: l’esprit et la matière”, <em>Archives\nde Philosophie</em>, 58(3): 371–384.</li>\n<li>–––, 2004, <em>Anne Conway: A Woman\nPhilosopher</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511487217</li>\n<li>–––, 2011, “Sir John Finch and Religious\nToleration: An Unpublished Letter to Anne Conway”, in <em>La\nCentralita del Dubbio. Un Progetto di Antonio Rotondo</em>, Luisa\nSimonutti and Camilla Hernanin (eds.), 2 vols., Florence: Olschki, pp.\n287–304.</li>\n<li>–––, 2018, “Goodness in Anne Conway’s\nMetaphysics”, in <em>Early Modern Women on Metaphysics</em>,\nEmily Thomas (ed.), Cambridge: Cambridge University Press,\n229–246. doi:10.1017/9781316827192.013</li>\n<li>–––, 2019, “‘As we observe by\ncontinued experience’. Experience and the Senses in the\nPhilosophy of Anne Conway”, <em>Bruniana e Campanelliana</em>,\nsupplement on <em>Filosofe e scienzate nel eta moderna</em>, \nSandra Plastina and Emilio Tommaso (eds), 51–64.</li>\n<li>Lascano, Marcy P., 2013, “Anne Conway: Bodies in the\nSpiritual World”, <em>Philosophy Compass</em>, 8(4):\n327–336. doi:10.1111/phc3.12025</li>\n<li>–––, 2018, “Anne Conway on Liberty”,\nin <em>Women and Liberty, 1600–1800: Philosophical Essays</em>,\nJacqueline Broad and Karen Detlefsen (eds), Oxford: Oxford University\nPress, 163–77.</li>\n<li>Mercer, Christia, 2012a, “ Knowledge and Suffering in Early\nModern Philosophy: G.W. Leibniz and Anne Conway”, in\n<em>Emotional Minds. The Passions and the Limits of Enquiry in Early\nModern Philosophy</em>, Sabrina Ebbersmeyer (ed.), Göttingen: de\nGruyter, 179–206.\n [<a href=\"http://www.oapen.org/record/626358\" target=\"other\">Mercer 2012 available online</a>]</li>\n<li>–––, 2012b, “Platonism in Early Modern\nNatural Philosophy: The Case of Leibniz and Anne Conway”, in\n<em>Neoplatonism and the Philosophy of Nature</em>, James Wilberding\nand Christoph Horn (eds.), Oxford: Oxford University Press,\n103–126. doi:10.1093/acprof:oso/9780199693719.003.0006</li>\n<li>Merchant, Carolyn, 1979, “The Vitalism of Anne Conway: Its\nImpact on Leibniz’s Concept of the Monad”, <em>Journal of the\nHistory of Philosophy</em>, 17(3): 255–269.\ndoi:10.1353/hph.2008.0331</li>\n<li>O’Neill, Eileen, 1998, “History of Philosophy:\nDisappearing Ink: Early Modern Women Philosophers and Their Fate in\nHistory”, in <em>Philosophy in a Feminist Voice: Critiques and\nReconstructions</em>, Janet A. Kourany (ed.), Princeton: Princeton\nUniversity Press, 17–62. doi:10.1515/9781400822324.17</li>\n<li>Platas Benitez, Viridiana, forthcoming, “Percepcion sensible\ne imaginacion en la filosofia di Anne Conway”, <em>Annales del\nseminario de Historia de Filosofia</em>, Universidad Complutense de\nMadrid.</li>\n<li>Popkin, Richard H., 1990, “The Spiritualistic Cosmologies of\nHenry More and Anne Conway”, in Hutton 1990: 97–114.\ndoi:10.1007/978-94-009-2267-9_6</li>\n<li>Pugliese, Nastassja, 2019, “Monism and Individuation in Anne\nConway as a Critique of Spinoza”, <em>British Journal for the\nHistory of Philosophy</em>, 27(4): 771–785.\ndoi:10.1080/09608788.2018.1563764</li>\n<li>Thomas, Emily, 2017, “Time, Space, and Process in Anne\nConway”, <em>British Journal for the History of Philosophy</em>,\n25(5): 990–1010. doi:10.1080/09608788.2017.1302408</li>\n<li>–––, 2018a, “Anne Conway on the Identity\nof Creatures over Time”, in Thomas 2018b: 131–149.\ndoi:10.1017/9781316827192.008</li>\n<li>––– (ed.), 2018b, <em>Early Modern Women on\nMetaphysics</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/9781316827192</li>\n<li>–––, forthcoming, “Anne Conway as a\nPriority Monist: A Reply to Gordon-Roth”, <em>Journal of the\nAmerican Philosophical Association</em>.\n [<a href=\"http://dro.dur.ac.uk/27123/\" target=\"other\">Thomas forthcoming available online</a>]</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Cambridge Platonists",
            "Descartes, René",
            "Hobbes, Thomas",
            "Leibniz, Gottfried Wilhelm",
            "More, Henry",
            "Spinoza, Baruch"
        ],
        "entry_link": [
            {
                "../cambridge-platonists/": "Cambridge Platonists"
            },
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../hobbes/": "Hobbes, Thomas"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../henry-more/": "More, Henry"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conway\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/conway/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=conway&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/conway/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=conway": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/conway/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=conway&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/conway/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://projectvox.org/conway-1631-1679/\" target=\"other\">Project Vox: Conway (1631–1679)</a>\n (web site with profiles of modern women philosophers, plus teaching\nmaterials) "
        ],
        "listed_links": [
            {
                "http://projectvox.org/conway-1631-1679/": "Project Vox: Conway (1631–1679)"
            }
        ]
    }
}