{
    "url": "definitions",
    "title": "Definitions",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Anil Gupta\n<agupta@pitt.edu>\nStephen Mackereth\n<sgmackereth@gmail.com>",
        "author_links": [
            {
                "mailto:agupta%40pitt%2eedu": "agupta@pitt.edu"
            },
            {
                "mailto:sgmackereth%40gmail%2ecom": "sgmackereth@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nAnil Gupta\n&lt;<a href=\"mailto:agupta%40pitt%2eedu\"><em>agupta<abbr title=\" at \">@</abbr>pitt<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nStephen Mackereth\n&lt;<a href=\"mailto:sgmackereth%40gmail%2ecom\"><em>sgmackereth<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Apr 10, 2008",
        "substantive revision Wed Sep 13, 2023"
    ],
    "preamble": "\n\nDefinitions have interested philosophers since ancient times.\nPlato’s early dialogues portray Socrates raising questions about\ndefinitions (e.g., in the Euthyphro, “What is\npiety?”)—questions that seem at once profound and elusive.\nThe key step in Anselm’s “Ontological Proof” for the\nexistence of God is the definition of “God,” and the same\nholds of Descartes’s version of the argument in his\nMeditation V. More recently, the Frege-Russell definition of\nnumber and Tarski’s definition of truth have exercised a\nformative influence on a wide range of contemporary philosophical\ndebates. In all these cases—and many others can be\ncited—not only have particular definitions been debated; the\nnature of, and demands on, definitions have also been debated. Some of\nthese debates can be settled by making requisite distinctions, for\ndefinitions are not all of one kind: definitions serve a variety of\nfunctions, and their general character varies with function. Some\nother debates, however, are not so easily settled, as they involve\ncontentious philosophical ideas such as essence, concept, and\nmeaning.\n",
    "toc": [
        {
            "#SomVarDef": "1. Some varieties of definition"
        },
        {
            "#ReaNomDef": "1.1 Real and nominal definitions"
        },
        {
            "#DicDef": "1.2 Dictionary definitions"
        },
        {
            "#StiDef": "1.3 Stipulative definitions"
        },
        {
            "#DesDef": "1.4 Descriptive definitions"
        },
        {
            "#ExpDef": "1.5 Explicative definitions"
        },
        {
            "#OstDef": "1.6 Ostensive definitions"
        },
        {
            "#Rem": "1.7 A remark"
        },
        {
            "#LogDef": "2. The logic of definitions"
        },
        {
            "#TwoCri": "2.1 Two criteria"
        },
        {
            "#FouTraAcc": "2.2 Foundations of the traditional account"
        },
        {
            "#ConEli": "2.3 Conservativeness and eliminability"
        },
        {
            "#DefNorFor": "2.4 Definitions in normal form"
        },
        {
            "#CondDef": "2.5 Conditional definitions"
        },
        {
            "#ImpDef": "2.6 Implicit definitions"
        },
        {
            "#VicCirPri": "2.7 Vicious-Circle Principle"
        },
        {
            "#CirDef": "2.8 Circular definitions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Some varieties of definition\n\nOrdinary discourse recognizes several different kinds of things as\npossible objects of definition, and it recognizes several kinds of\nactivity as defining a thing. To give a few examples, we speak of a\ncommission as defining the boundary between two nations; of the\nSupreme Court as defining, through its rulings, “person”\nand “citizen”; of a chemist as discovering the definition\nof gold, and the lexicographer, that of ‘cool’; of a\nparticipant in a debate as defining the point at issue; and of a\nmathematician as laying down the definition of “group.”\nDifferent kinds of things are objects of definition here: boundary,\nlegal status, substance, word, thesis, and abstract kind. Moreover,\nthe different definitions do not all have the same goal: the boundary\ncommission may aim to achieve precision; the Supreme Court, fairness;\nthe chemist and the lexicographer, accuracy; the debater, clarity; and\nthe mathematician, fecundity. The standards by which definitions are\njudged are thus liable to vary from case to case. The different\ndefinitions can perhaps be subsumed under the Aristotelian formula\nthat a definition gives the essence of a thing. But this only\nhighlights the fact that “to give the essence of a thing”\nis not a unitary kind of activity.\n\nIn philosophy, too, several different kinds of definitions are often\nin play, and definitions can serve a variety of different functions\n(e.g., to enhance precision and clarity). But, in philosophy,\ndefinitions have also been called in to serve a highly distinctive\nrole: that of solving epistemological problems. For example, the\nepistemological status of mathematical truths raises a problem.\nImmanuel Kant thought that these truths are synthetic a\npriori, and to account for their status, he offered a theory of\nspace and time—namely, of space and time as forms of,\nrespectively, outer and inner sense. Gottlob Frege and Bertrand\nRussell sought to undermine Kant’s theory by arguing that\narithmetical truths are analytic. More precisely, they attempted to\nconstruct a derivation of arithmetical principles from definitions of\narithmetical concepts, using only logical laws. For the Frege-Russell\nproject to succeed, the definitions used must have a special\ncharacter. They must be conceptual or explicative of meaning; they\ncannot be synthetic. It is this kind of definition that has aroused,\nover the past century or so, the most interest and the most\ncontroversy. And it is this kind of definition that will be our\nprimary concern. Let us begin by marking some preliminary but\nimportant distinctions.\n1.1 Real and nominal definitions\n\nJohn Locke distinguished, in his Essay, “real\nessence” from “nominal essence.” Nominal essence,\naccording to Locke, is the “abstract Idea to which\nthe Name is annexed (III.vi.2).” Thus, the nominal essence\nof the name ‘gold’, Locke said, “is that complex\nIdea the word Gold stands for, let it be, for\ninstance, a Body yellow, of a certain weight, malleable, fusible, and\nfixed.” In contrast, the real essence of gold is “the\nconstitution of the insensible parts of that Body, on which those\nQualities [mentioned in the nominal essence] and all other Properties\nof Gold depend (III.vi.2).” A rough way of marking the\ndistinction between real and nominal definitions is to say, following\nLocke, that the former states real essence, while the latter states\nnominal essence. The chemist aims at real definition, whereas the\nlexicographer aims at nominal definition.\n\nThis characterization of the distinction is rough because a\nzoologist’s definition of “tiger” should count as a\nreal definition, even though it may fail to provide “the\nconstitution of the insensible parts” of the tiger. Moreover, an\naccount of the meaning of a word should count as a nominal definition,\neven though it may not take the Lockean form of setting out “the\nabstract idea to which the name is annexed.” Perhaps it is\nhelpful to indicate the distinction between real and nominal\ndefinitions thus: to discover the real definition of a term \\(X\\) one\nneeds to investigate the thing or things denoted by \\(X\\); to discover\nthe nominal definition, one needs to investigate the meaning and use\nof \\(X\\). Whether the search for an answer to the Socratic question\n“What is virtue?” is a search for real definition or one\nfor nominal definition depends upon one’s conception of this\nparticular philosophical activity. When we pursue the Socratic\nquestion, are we trying to gain a clearer view of our uses of the word\n‘virtue’, or are we trying to give an account of an ideal\nthat is to some extent independent of these uses? Under the former\nconception, we are aiming at a nominal definition; under the latter,\nat a real definition.\n\nSee Robinson 1950 for a critical discussion of the different\nactivities that have been subsumed under “real\ndefinition,” and see Charles 2010 for ancient views on the\ntopic. Fine 1994 defends the conception that a real definition defines\nan object by specifying what the object is; in other words, a real\ndefinition spells out the essence of the object defined. Rosen 2015\noffers an explanation of real definition in terms of grounding: the\ndefinition provides the ground of the essence of the object. The\nmeaning of ‘essence’ and of ‘ground’ remain\nunder active debate, however.\n1.2 Dictionary definitions\n\nNominal definitions—definitions that explain the meaning of a\nterm—are not all of one kind. A dictionary explains the meaning\nof a term, in one sense of this phrase. Dictionaries aim to provide\ndefinitions that contain sufficient information to impart an\nunderstanding of the term. It is a fact about us language users that\nwe somehow come to understand and use a potential infinity of\nsentences containing a term once we are given a certain small amount\nof information about the term. Exactly how this happens is a large\nmystery. But it does happen, and dictionaries exploit the fact. Note\nthat dictionary entries are not unique. Different dictionaries can\ngive different bits of information and yet be equally effective in\nexplaining the meanings of terms.\n\nDefinitions sought by philosophers are not of the sort found in a\ndictionary. Frege’s definition of number (1884) and Alfred\nTarski’s definition of truth (1983, ch. 8) are not offered as\ncandidates for dictionary entries. When an epistemologist seeks a\ndefinition of “knowledge,” she is not seeking a good\ndictionary entry for the word ‘know’. The philosophical\nquest for definition can sometimes fruitfully be characterized as a\nsearch for an explanation of meaning. But the sense of\n‘explanation of meaning’ here is very different from the\nsense in which a dictionary explains the meaning of a word.\n1.3 Stipulative definitions\n\nA stipulative definition imparts a meaning to the defined term, and\ninvolves no commitment that the assigned meaning agrees with prior\nuses (if any) of the term. Stipulative definitions are\nepistemologically special. They yield judgments with epistemological\ncharacteristics that are puzzling elsewhere. If one stipulatively\ndefines a “raimex” as, say, a rational, imaginative,\nexperiencing being then the judgment “raimexes are\nrational” is assured of being necessary, certain, and a\npriori. Philosophers have found it tempting to explain the\npuzzling cases of, e.g., a priori judgments, by an\nappeal to stipulative definitions.\n\nSaul Kripke (1980) has drawn attention to a special kind of\nstipulative definition. We can stipulatively introduce a new name\n(e.g., ‘Jack the Ripper’) through a description (e.g.,\n“the man who murdered \\(X, Y\\), and \\(Z\\)”). In such a\nstipulation, Kripke pointed out, the description serves only to fix\nthe reference of the new name; the name is not synonymous with the\ndescription. For, the judgment\n\n(1)\nJack the Ripper is the man who murdered \\(X, Y\\), and \\(Z\\), if a\nunique man committed the murders\n\n\nis contingent, even though the judgment\n\nJack the Ripper is Jack the Ripper, if a unique man committed the\nmurders\n\nis necessary. A name such as ‘Jack the Ripper’, Kripke\nargued, is rigid: it picks out the same individual across possible\nworlds; the description, on the other hand, is non-rigid. Kripke used\nsuch reference-fixing stipulations to argue for the existence of\ncontingent a priori truths—(1) being an example.\nReference-fixing stipulative definitions can be given not only for\nnames but also for terms in other categories, e.g., common nouns.\n\nSee Frege 1914 for a defense of the austere view that, in mathematics\nat least, only stipulative definitions should be\n countenanced.[1]\n1.4 Descriptive definitions\n\nDescriptive definitions, like stipulative ones, spell out meaning, but\nthey also aim to be adequate to existing usage. When philosophers\noffer definitions of, e.g., ‘know’ and ‘free’,\nthey are not being stipulative: a lack of fit with existing usage is\nan objection to them.\n\nIt is useful to distinguish three grades of descriptive adequacy of a\ndefinition: extensional, intensional, and sense. A definition is\nextensionally adequate iff there are no actual\ncounterexamples to it; it is intensionally adequate iff there\nare no possible counterexamples to it; and it is sense\nadequate (or analytic) iff it endows the defined term\nwith the right sense. (The last grade of adequacy itself subdivides\ninto different notions, for “sense” can be spelled out in\nseveral different ways.) The definition “Water is\nH2O,” for example, is intensionally adequate because\nthe identity of water and H2O is necessary (assuming the\nKripke-Putnam view about the rigidity of natural-kind terms); the\ndefinition is therefore extensionally adequate also. But it is not\nsense-adequate, for the sense of ‘water’ is not at all the\nsame as that of ‘H2O’. The definition\n‘George Washington is the first President of the United\nStates’ is adequate only extensionally but not in the other two\ngrades, while ‘man is a laughing animal’ fails to be\nadequate in all three grades. When definitions are put to an\nepistemological use, intensional adequacy is generally insufficient.\nFor such definitions cannot underwrite the rationality or the\napriority of a problematic subject matter.\n\nSee Quine 1951 & 1960 for skepticism about analytic definitions;\nsee also the entry on the\n analytic/synthetic distinction.\n Horty 2007 offers some ways of thinking about senses of defined\nexpressions, especially within a Fregean semantic theory.\n1.5 Explicative definitions\n\nSometimes a definition is offered neither descriptively nor\nstipulatively but as, what Rudolf Carnap (1956, §2) called, an\nexplication. An explication aims to respect some central uses\nof a term but is stipulative on others. The explication may be offered\nas an absolute improvement of an existing, imperfect concept. Or, it\nmay be offered as a “good thing to mean” by the term in a\nspecific context for a particular purpose. (The quoted phrase is due\nto Alan Ross Anderson; see Belnap 1993, 117.)\n\nA simple illustration of explication is provided by the definition of\nordered pair in set theory. Here, the pair \\(\\langle x,y\\rangle\\) is\ndefined as the set \\(\\{\\{x\\}, \\{x,y\\}\\}\\). Viewed as an explication,\nthis definition does not purport to capture all aspects of the\nantecedent uses of ‘ordered pair’ in mathematics (and in\nordinary life); instead, it aims to capture the essential uses. The\nessential fact about our use of ‘ordered pair’ is that it\nis governed by the principle that pairs are identical iff their\nrespective components are identical: \n\\[ \\langle x, y\\rangle = \\langle u, v\\rangle \\text{ iff } x = u \\amp y = v. \\]\n\n\nAnd it can be verified that the above definition satisfies the\nprinciple. The definition does have some consequences that do not\naccord with the ordinary notion. For example, the definition implies\nthat an object \\(x\\) is a member of a member of the pair \\(\\langle x,\ny\\rangle\\), and this implication is no part of the ordinary notion.\nBut the mismatch is not an objection to the explication. What is\nimportant for explication is not antecedent meaning but function. So\nlong as the latter is preserved, the former can be let go. It is this\nfeature of explication that led W. V. O. Quine (1960, §53) to\nextol its virtues and to uphold the definition of “ordered\npair” as a philosophical paradigm.\n\nThe truth-functional conditional provides another illustration of\nexplication. This conditional differs from the ordinary conditional in\nsome essential respects. Nevertheless, the truth-functional\nconditional can be put forward as an explication of the ordinary\nconditional for certain purposes in certain contexts. Whether\nthe proposal is adequate depends crucially on the purposes and\ncontexts in question. That the two conditionals differ in important,\neven essential, respects does not automatically disqualify the\nproposal.\n1.6 Ostensive definitions\n\nOstensive definitions typically depend on context and on experience.\nSuppose the conversational context renders one dog salient among\nseveral that are visible. Then one can introduce the name\n‘Freddie’ through the stipulation “let this dog be\ncalled ‘Freddie’.” For another example, suppose you\nare looking at a branch of a bush and you stipulatively introduce the\nname ‘Charlie’ thus: “let the insect on that branch\nbe called ‘Charlie’.” This definition can pin a\nreferent on ‘Charlie’ even if there are many insects on\nthe branch. If your visual experience presents you with only one of\nthese insects (say, because the others are too small to be visible),\nthen that insect is the denotation of your use of the description\n‘the insect on that branch’. We can think of experience as\npresenting the subject with a restricted portion of the world. This\nportion can serve as a point of evaluation for the expressions in an\nostensive\n definition.[2]\n Consequently, the definition can with the aid of experience pin a\nreferent on the defined term when without this aid it would fail to do\nso. In the present example, the description ‘the insect on that\nbranch’ fails to be denoting when it is evaluated at the world\nas a whole, but it is denoting when it is evaluated at that portion of\nit that is presented in your visual experience. See Gupta 2019 for an\naccount of the contribution of experience to the meaning of an\nostensively defined term.\n\nAn ostensive definition can bring about an essential enrichment of a\nlanguage. The ostensive definition of ‘Charlie’ enriches\nthe language with a name of a particular insect, and it could well be\nthat before the enrichment the language lacked resources to denote\nthat particular insect. Unlike other familiar definitions, ostensive\ndefinitions can introduce terms that are ineliminable. (So, ostensive\ndefinitions can fail to meet the Eliminability criterion explained\nbelow; they can fail to meet also the Conservativeness criterion, also\nexplained below.)\n\nThe capacity of ostensive definitions to introduce essentially new\nvocabulary has led some thinkers to view them as the source of all\nprimitive concepts. Thus, Russell maintains in Human\nKnowledge that\n\nall nominal definitions, if pushed back far enough, must lead\nultimately to terms having only ostensive definitions, and in the case\nof an empirical science the empirical terms must depend upon terms of\nwhich the ostensive definition is given in perception. (p. 242)\n\n\nIn “Meaning and Ostensive Definition”, C. H. Whiteley\ntakes it as a premiss that ostensive definitions are “the means\nwhereby men learn the meanings of most, if not all, of those\nelementary expressions in their language in terms of which other\nexpressions are defined.” (332) It should be noted, however,\nthat nothing in the logic and semantics of ostensive definitions\nwarrants a foundationalist picture of concepts or of\nlanguage-learning. Such foundationalist pictures were decisively\ncriticized by Ludwig Wittgenstein in his Philosophical\nInvestigations. Wittgenstein’s positive views on ostensive\ndefinition remain elusive, however; for an interpretation, see Hacker\n1975.\n\nOstensive definitions are important, but our understanding of them\nremains at a rudimentary level. They deserve greater attention from\nlogicians and philosophers.\n1.7 A remark\n\nThe kinds into which we have sorted definitions are not mutually\nexclusive, nor exhaustive. A stipulative definition of a term may, as\nit happens, be extensionally adequate to the antecedent uses of the\nterm. A dictionary may offer ostensive definitions of some words\n(e.g., of color words). An ostensive definition can also be\nexplicative. For example, one can offer an improvement of a\npreexisting concept “one foot” thus: “let one foot\nbe the present length of that rod.” In its preexisting use, the\nconcept “one foot” may be quite vague; the ostensively\nintroduced explication may, in contrast, be relatively precise.\nMoreover, as we shall see below, there are other kinds of definition\nthan those considered so far.\n2. The logic of definitions\n\nMany definitions—stipulative, descriptive, and\nexplicative—can be analyzed into three elements: the term that\nis defined \\((X)\\), an expression containing the defined term\n\\((\\ldots X\\ldots)\\), and another expression \\((- - - - - - -)\\) that\nis equated by the definition with this expression. Such definitions\ncan be represented thus: \n\\[\\tag{2} X: \\ldots X \\ldots \\eqdf - - - - - - - . \\]\n\n\n(We are setting aside ostensive definitions, which plainly require a\nricher representation.) When the defined term is clear from the\ncontext, the representation may be simplified to \n\\[ \\ldots X \\ldots \\eqdf - - - - - - - . \\]\n\n\nThe expression on the left-hand side of ‘\\(\\eqdf\\)’ (i.e.,\n\\(\\ldots X\\ldots)\\) is the definiendum of the definition, and\nthe expression on the right-hand side is its\ndefiniens—it being assumed that the definiendum and the\ndefiniens belong to the same logical category. Note the distinction\nbetween defined term and definiendum: the defined term in the present\nexample is \\(X\\); the definiendum is the unspecified expression on the\nleft-hand side of ‘\\(\\eqdf\\)’, which may or may not be\nidentical to \\(X\\). (Some authors call the defined term ‘the\ndefiniendum’; some others use the expression confusedly,\nsometimes to refer to the defined term and sometimes to the\ndefiniendum proper.) Not all definitions found in the logical and\nphilosophical literature fit under scheme (2). Partial definitions,\nfor example, fall outside the scheme; another example is provided by\ndefinitions of logical constants in terms of introduction and\nelimination rules governing them. Nonetheless, definitions that\nconform to (2) are the most important, and they will be our primary\nconcern.\n\nLet us focus on stipulative definitions and reflect on their logic.\nSome of the important lessons here carry over, as we shall see, to\ndescriptive and explicative definitions. For simplicity, let us\nconsider the case where a single definition stipulatively introduces a\nterm. (Multiple definitions bring notational complexity but raise no\nnew conceptual issues.) Suppose, then, that a language \\(L\\), the\nground language, is expanded through the addition of a new\nterm \\(X\\) to an expanded language \\(L^{+}\\), where \\(X\\) is\nstipulatively defined by a definition \\(\\mathcal{D}\\) of form (2).\nWhat logical rules govern \\(\\mathcal{D}\\)? What requirements must the\ndefinition fulfill?\n\nBefore we address these questions, let us take note of a distinction\nthat is not marked in logic books but which is useful in thinking\nabout definitions. In one kind of definition—call it\nhomogeneous definition—the defined term and the\ndefiniendum belong to the same logical category. So, a singular term\nis defined via a singular term; a general term via a general term; a\nsentence via a sentence; and so on. Let us say that a homogeneous\ndefinition is regular iff its definiendum is identical to the\ndefined term. Here are some examples of regular homogeneous\ndefinitions: \n\\[\\tag{3} \\begin{align*}\n1: 1 &\\eqdf \\text{the successor of } 0, \\\\\n \\text{man}: \\text{man} &\\eqdf \\text{rational animal}, \\\\\n \\text{The True}: \\text{The True} &\\eqdf \\text{everything is identical to itself}. \n\\end{align*}\\]\n\n\nNote that ‘The True’, as defined above, belongs to the\ncategory of sentence, not that of singular term.\n\nIt is sometimes said that definitions are mere recipes for\nabbreviations. Thus, Alfred North Whitehead and Bertrand Russell say\nof definitions—in particular, those used in Principia\nMathematica—that they are “strictly speaking,\ntypographical conveniences (1925, 11).” This viewpoint has\nplausibility only for regular homogeneous definitions—though it\nis not really tenable even here. (Whitehead and Russell’s own\nobservations make it plain that their definitions are more than mere\n“typographical\n conveniences.”[3])\n The idea that definitions are mere abbreviations is not at all\nplausible for the second kind of definition, to which we now turn.\n\nIn the second kind of definition—call it a\nheterogeneous definition—the defined term and the\ndefiniendum belong to different logical categories. So, for example, a\ngeneral term (e.g., ‘man’) may be defined using a\nsentential definiendum (e.g., ‘\\(x\\) is a man’). For\nanother example, a singular term (e.g., ‘1’) may be\ndefined using a predicate (e.g., ‘is identical to 1’).\nHeterogeneous definitions are far more common than homogeneous ones.\nIn familiar first-order languages, for instance, it is pointless to\ndefine, say, a one-place predicate \\(G\\) by a homogeneous definition.\nThese languages have no resources for forming compound predicates;\nhence, the definiens of a homogeneous definition of \\(G\\) is bound to\nbe atomic. In a heterogeneous definition, however, the definiens can\neasily be complex; for example, \n\\[\\tag{4} Gx \\eqdf x \\gt 3 \\amp x \\lt 10. \\]\n\n\nIf the language has a device for nominalization of\npredicates—e.g., a class abstraction operator—we could\ngive a different sort of heterogeneous definition for G:\n\n\\[\\tag{5} \\text{the class of } G \\text{s} \\eqdf \\text{the class of numbers between 3 and 10.}\\]\n\n\nObserve that a heterogeneous definition such as (4) is not a mere\nabbreviation. For one thing, we regard the expression \\(x\\) in it as a\ngenuine variable which admits of substitution and binding. So, the\ndefiniendum Gx is not a mere abbreviation\nfor the definiens. Moreover, if such definitions were abbreviations,\nthey would be subject to the requirement that the definiendum must be\nshorter than the definiens, but no such requirement exists.\nOn the other hand, genuine requirements on definitions would make\nlittle sense. The following stipulation is not a legitimate\ndefinition: \n\\[\\tag{6} Gx \\eqdf x \\gt y \\amp x \\lt 10. \\]\n\n\nBut if it is viewed as a mere abbreviation, there is nothing\nillegitimate about it. (Indeed, mathematicians routinely make use of\nabbreviations of this kind, suppressing variables that are temporarily\nuninteresting.)\n\nSome stipulative definitions are nothing but mere devices of\nabbreviation (e.g., the definitions governing the omission of\nparentheses in formulas; see Church 1956, §11). However, many\nstipulative definitions are not of this kind; they introduce\nmeaningful items into our discourse. Thus, definition (4) renders\n\\(G\\) a meaningful unary predicate: \\(G\\) expresses, in virtue of (4),\na particular concept. In contrast, under stipulation (6), \\(G\\) is not\na meaningful predicate and expresses no concept of any kind. But what\nis the source of the difference? Why is (4) legitimate, but not (6)?\nMore generally, when is a definition legitimate? What requirements\nmust the definiens fulfill? And, for that matter, the definiendum?\nMust the definiendum be, for instance, atomic, as in (3) and (4)? If\nnot, what restrictions (if any) are there on the definiendum?\n2.1 Two criteria\n\nIt is a plausible requirement on any answer to these questions that\ntwo criteria be\n respected.[4]\n First, a stipulative definition should not enable us to establish\nessentially new claims—call this the Conservativeness\ncriterion. We should not be able to establish, by means of a mere\nstipulation, new things about, for example, the moon. It is true that\nunless this criterion is made precise, it is subject to trivial\ncounterexamples, for the introduction of a definition materially\naffects some facts. Nonetheless, the criterion can be made precise and\ndefensible, and we shall soon see some ways of doing this.\n\nSecond, the definition should fix the use of the defined expression\n\\(X\\)—call this the Use criterion. This criterion is\nplausible, since only the definition—and nothing else—is\navailable to guide us in the use of \\(X\\). There are complications\nhere, however. What counts as a use of \\(X\\)? Are occurrences within\nthe scope of ‘say’ and ‘know’ included? What\nabout the occurrence of \\(X\\) within quotation contexts, and those\nwithin words, for instance, ‘Xenophanes’? The\nlast question should receive, it is clear, the answer,\n“No.” But the answers to the previous questions are not so\nclear. There is another complication: even if we can somehow separate\nout genuine occurrences of \\(X\\), it may be that some of these\noccurrences are rightfully ignored by the definition. For example, a\ndefinition of quotient may leave some occurrences of the term\nundefined (e.g., where there is division by 0). The orthodox view is\nto rule such definitions as illegitimate, but the orthodoxy deserves\nto be challenged here. Let us leave the challenge to another occasion,\nhowever, and proceed to bypass the complications through idealization.\nLet us confine ourselves to ground languages that possess a clearly\ndetermined logical structure (e.g., a first-order language) and that\ncontain no occurrences of the defined term \\(X\\). And let us confine\nourselves to definitions that place no restrictions on legitimate\noccurrences of \\(X\\). The Use criterion now dictates then that the\ndefinition should fix the use of all expressions in the expanded\nlanguage in which \\(X\\) occurs.\n\nA variant formulation of the Use criterion is this: the definition\nmust fix the meaning of the definiendum. The new formulation is less\ndeterminate and more contentious, for it relies on\n“meaning,” an ambiguous and theoretically contentious\nnotion.\n\nNote that the two criteria govern all stipulative definitions,\nirrespective of whether they are single or multiple, or of whether\nthey are of form (2) or not.\n2.2 Foundations of the traditional account\n\nThe traditional account of definitions is founded on three ideas. The\nfirst idea is that definitions are generalized identities; the second,\nthat the sentential is primary; and the third, that of reduction. The\nfirst idea—that definitions are generalized\nidentities—motivates the traditional account’s inferential\nrules for definitions. These are, put crudely, that (i) any occurrence\nof the definiendum can be replaced by an occurrence of the definiens\n(Generalized Definiendum Elimination); and, conversely, (ii) any\noccurrence of the definiens can be replaced by an occurrence of the\ndefiniendum (Generalized Definiendum Introduction).\n\nThe second idea—the primacy of the sentential—has its\nroots in the thought that the fundamental uses of a term are in\nassertion and argument: if we understand the use of a defined term in\nassertion and argument then we fully grasp the term. The sentential\nis, however, primary in argument and assertion. Hence, to explain the\nuse of a defined term \\(X\\), the second idea maintains, it is\nnecessary and sufficient to explain the use of sentential items that\ncontain \\(X\\). (Sentential items are here understood to include\nsentences and sentence-like things with free variables, e.g., the\ndefiniens of (4); henceforth, these items will be called\nformulas.) The issues the second idea raises are, of course,\nlarge and important, but they cannot be addressed in a brief survey.\nLet us accept the idea simply as a given.\n\nThe third idea—reduction—is that the use of a formula\n\\(Z\\) containing the defined term is explained by reducing \\(Z\\) to a\nformula in the ground language. This idea, when conjoined with the\nprimacy of the sentential, leads to a strong version of the Use\ncriterion, called the Eliminability criterion: the definition\nmust reduce each formula containing the defined term to a formula in\nthe ground language, i.e., one free of the defined term. Eliminability\nis the distinctive thesis of the traditional account and, as we shall\nsee below, it can be challenged.\n\nNote that the traditional account does not require the reduction of\nall expressions of the extended language; it requires the\nreduction only of formulas. The definition of a predicate \\(G\\), for\nexample, need provide no way of reducing \\(G\\), taken in isolation, to\na predicate of the ground language. The traditional account is thus\nconsistent with the thought that a stipulative definition can add a\nnew conceptual resource to the language, for nothing in the ground\nlanguage expresses the predicative concept that \\(G\\) expresses in the\nexpanded language. This is not to deny that no new\nproposition—at least in the sense of truth-condition—is\nexpressed in the expanded language.\n2.3 Conservativeness and eliminability\n\nLet us now see how Conservativeness and Eliminability can be made\nprecise. First consider languages that have a precise proof system of\nthe familiar sort. Let the ground language \\(L\\) be one such. The\nproof system of \\(L\\) may be classical, or three-valued, or modal, or\nrelevant, or some other; and it may or may not contain some\nnon-logical axioms. All we assume is that we have available the\nnotions “provable in \\(L\\)” and “provably equivalent\nin \\(L\\),” and also the notions “provable in\n\\(L^{+}\\)” and “provably equivalent in \\(L^{+}\\)”\nthat result when the proof system of \\(L\\) is supplemented with a\ndefinition \\(\\mathcal{D}\\) and the logical rules governing\ndefinitions. Now, the Conservativeness criterion can be made precise\nas follows.\n\nConservativeness criterion (syntactic formulation):\nAny formula of \\(L\\) that is provable in \\(L^{+}\\) is provable in\n\\(L\\).\n\nThat is, any formula of \\(L\\) that is provable using definition\n\\(\\mathcal{D}\\) is also provable without using \\(\\mathcal{D}\\): the\ndefinition does not enable us to prove anything new in \\(L\\). The\nEliminability criterion can be made precise thus:\n\nEliminability criterion (syntactic formulation): For\nany formula \\(A\\) of \\(L^{+}\\), there is a formula of \\(L\\) that is\nprovably equivalent in \\(L^{+}\\) to \\(A\\).\n\n(Folklore credits the Polish logician S. Leśniewski for\nformulating the criteria of Conservativeness and Eliminability, but\nthis is a mistake; see Dudman 1973, Hodges 2008, Urbaniak and\nHämäri 2012 for discussion and further\n references.)[5]\n\nNow let us equip \\(L\\) with a model-theoretic semantics. That is, we\nassociate with \\(L\\) a class of interpretations, and we make available\nthe notions “valid in \\(L\\) in the interpretation \\(M\\)”\n(a.k.a.: “true in \\(L\\) in \\(M\\)”) and “semantically\nequivalent in \\(L\\) relative to \\(M\\).” Let the notions\n“valid in \\(L^{+}\\) in \\(M^{+}\\)” and “semantically\nequivalent in \\(L^{+}\\) relative to \\(M^{+}\\)” result when the\nsemantics of \\(L\\) is supplemented with that of definition\n\\(\\mathcal{D}\\). The criteria of Conservativeness and Eliminability\ncan now be made precise thus:\n\nConservativeness criterion (semantic formulation):\nFor all formulas \\(A\\) of \\(L\\), if \\(A\\) is valid in \\(L^{+}\\) in all\ninterpretations \\(M^{+}\\), then \\(A\\) is valid in \\(L\\) in all\ninterpretations \\(M\\).\n\nEliminability criterion (semantic formulation): For\nany formula \\(A\\) of \\(L^{+}\\), there is a formula \\(B\\) of \\(L\\) such\nthat, relative to all interpretations \\(M^{+}\\), \\(B\\) is\nsemantically equivalent in \\(L^{+}\\) to \\(A\\).\n\nThe syntactic and semantic formulations of the two criteria are\nplainly parallel. However, even if we suppose that strong completeness\ntheorems hold for \\(L\\) and \\(L^{+}\\), the two formulations need not\nbe equivalent: it depends on our semantics for definition\n\\(\\mathcal{D}\\). Indeed, several different, non-equivalent\nformulations of the two criteria are possible within each framework,\nthe syntactic and the semantic.\n\nThere is another, more stringent notion of semantic conservativeness\nthat has been prominent in the literature on truth (Halbach 2014, p.\n69). Say that an interpretation \\(M^{+}\\) of \\(L^{+}\\) is an\nexpansion of an interpretation \\(M\\) of \\(L\\) iff \\(M\\) and\n\\(M^{+}\\) assign the same domain(s) to the quantifier(s) in L,\nand assign the same semantic values to the\nnon-logical constants in \\(L\\). Then we have:\n\nConservativeness criterion (strong semantic\nformulation): Every interpretation \\(M\\) of \\(L\\) can be\nexpanded to an interpretation \\(M^{+}\\) of \\(L^{+}\\).\n\nIn other words, a definition is strongly semantically conservative if\nit does not rule out any previously available interpretations of the\noriginal language.\n\nObserve that the satisfaction of Conservativeness and Eliminability\ncriteria, whether in their semantic or their syntactic formulation, is\nnot an absolute property of a definition; the satisfaction is relative\nto the ground language. Different ground languages can have associated\nwith them different systems of proof and different classes of\ninterpretations. Hence, a definition may satisfy the two criteria when\nadded to one language, but may fail to do so when added to a different\nlanguage. For further discussion of the criteria, see Suppes 1957 and\nBelnap 1993.\n2.4 Definitions in normal form\n\nFor concreteness, let us fix the ground language \\(L\\) to be a\nclassical first-order language with identity. The proof system of\n\\(L\\) may contain some non-logical axioms \\(T\\); the interpretations\nof \\(L\\) are then the classical models of \\(T\\). As before, \\(L^{+}\\)\nis the expanded language that results when a definition\n\\(\\mathcal{D}\\) of a non-logical constant \\(X\\) is added to \\(L\\);\nhence, \\(X\\) may be a name, a predicate, or a function-symbol. Call\ntwo definitions equivalent iff they yield the same theorems\nin the expanded language. Then, it can be shown that if\n\\(\\mathcal{D}\\) meets the criteria of Conservativeness and\nEliminability then \\(\\mathcal{D}\\) is equivalent to a definition in\nnormal form as specified\n below.[6]\n Since definitions in normal form meet the demands of Conservativeness\nand Eliminability, the traditional account implies that we lose\nnothing essential if we require definitions to be in normal form.\n\nThe normal form of definitions can be specified as follows. The\ndefinitions of names \\(a, n\\)-ary predicates \\(H\\), and \\(n\\)-ary\nfunction symbols \\(f\\) must be, respectively, of the following\nforms: \n\\[\\begin{align}\n\\tag{7} a = x &\\eqdf \\psi(x), \\\\\n \\tag{8} H(x_{1},\\ldots , x_{n}) &\\eqdf \\phi\\,(x_{1},\\ldots, x_{n}), \\\\\n \\tag{9} f(x_{1},\\ldots,x_{n})= y &\\eqdf \\chi(x_{1},\\ldots, x_{n}, y), \n\\end{align}\\]\n\n\nwhere the variables \\(x_{1}\\), …, \\(x_{n}\\), \\(y\\) are all\ndistinct, and the definiens in each case satisfies conditions that can\nbe separated into a general and a specific\n part.[7]\n The general condition on the definiens is the same in each case: it\nmust not contain the defined term or any free variables other than\nthose in the definiendum. The general conditions remain the same when\nthe traditional account of definition is applied to non-classical\nlogics (e.g., to many-valued and modal logics). The specific\nconditions are more variable. In classical logic, the specific\ncondition on the definiens \\(\\psi(x)\\) of (7) is that it satisfy an\nexistence and uniqueness condition: that it be provable that something\nsatisfies \\(\\psi(x)\\) and that at most one thing satisfies\n \\(\\psi(x)\\).[8]\n There are no specific conditions on (8), but the condition on (9)\nparallels that on (7). An existence and uniqueness claim must hold:\nthe universal closure of the formula \n\n\\[\\begin{align}\n\\exists y\\,\\chi(x_{1},\\ldots, x_{n}, y) \\amp \\forall u\\forall v[&\\chi(x_{1},\\ldots, x_{n}, u) \\\\\n &\\amp\\ \\chi(x_{1},\\ldots, x_{n}, v) \\rightarrow u = v] \n\\end{align}\\]\n\n\nmust be\n provable.[9]\n\nIn a logic that allows for vacuous names, the specific condition on\nthe definiens of (7) would be weaker: the existence condition would be\ndropped. In contrast, in a modal logic that requires names to be\nnon-vacuous and rigid, the specific condition would be strengthened:\nnot only must existence and uniqueness be shown to hold necessarily,\nit must be shown that the definiens is satisfied by one and the same\nobject across possible worlds.\n\nDefinitions that conform to (7)–(9) are heterogeneous; the\ndefiniendum is sentential, but the defined term is not. One source of\nthe specific conditions on (7) and (9) is their heterogeneity. The\nspecific conditions are needed to ensure that the definiens, though\nnot of the logical category of the defined term, imparts the proper\nlogical behavior to it. The conditions thus ensure that the logic of\nthe expanded language is the same as that of the ground language. This\nis the reason why the specific conditions on normal forms can vary\nwith the logic of the ground language. Observe that, whatever this\nlogic, no specific conditions are needed for regular homogeneous\ndefinitions.\n\nThe traditional account makes possible simple logical rules for\ndefinitions and also a simple semantics for the expanded language.\nSuppose definition \\(\\mathcal{D}\\) has a sentential definiendum. (In\nclassical logic, all definitions can easily be transformed to meet\nthis condition.) Let \\(\\mathcal{D}\\) be \n\\[\\tag{10} \\phi(x_{1},\\ldots,x_{n}) \\eqdf \\psi(x_{1},\\ldots, x_{n}), \\]\n\n\nwhere \\(x_{1}\\), …, \\(x_{n}\\) are all the variables free in\neither \\(\\phi\\) or \\(\\psi\\). And let \\(\\phi(t_{1},\\ldots,t_{n})\\) and\n\\(\\psi(t_{1},\\ldots,t_{n})\\) result by the simultaneous substitution\nof terms \\(t_{1}\\), …, \\(t_{n}\\) for \\(x_{1}\\), …,\n\\(x_{n}\\) in, respectively, \\(\\phi(x_{1},\\ldots, x_{n})\\) and\n\\(\\psi(x_{1},\\ldots, x_{n})\\); changing bound variables as necessary.\nThen the rules of inference governing \\(\\mathcal{D}\\) are simply\nthese: \n\\[\\begin{align*}\n\\frac{\\phi(t_1,\\ldots,t_n)}{\\psi(t_1,\\ldots,t_n)}\\,\\,&\\textbf{Definiendum Elimination} \\\\\n & \\\\\n \\frac{\\psi(t_1,\\ldots,t_n)}{\\phi(t_1,\\ldots,t_n)}\\,\\,&\\textbf{Definiendum Introduction} \n\\end{align*}\\]\n\n\nThe semantics for the extended language is also straightforward.\nSuppose, for instance, \\(\\mathcal{D}\\) is a definition of a name \\(a\\)\nand suppose that, when put in normal form, it is equivalent to (7).\nThen, each classical interpretation \\(M\\) of \\(L\\) expands to a unique\nclassical interpretation \\(M^{+}\\) of the extended language \\(L^{+}\\).\nThe denotation of \\(a\\) in \\(M^{+}\\) is the unique object that\nsatisfies \\(\\psi(x)\\) in \\(M\\); the conditions on \\(\\psi(x)\\) ensure\nthat such an object exists. The semantics of defined predicates and\nfunction-symbols is similar. The logic and semantics of definitions in\nnon-classical logics receive, under the traditional account, a\nparallel treatment.\n\nNote that the inferential force of adding definition (10) to the\nlanguage is the same as that of adding as an axiom, the universal\nclosure of \n\\[\\tag{11} \\phi(x_{1},\\ldots, x_{n}) \\leftrightarrow \\psi(x_{1},\\ldots,x_{n}). \\]\n\n\nHowever, this similarity in the logical behavior of (10) and (11)\nshould not obscure the great differences between the biconditional\n(‘\\(\\leftrightarrow\\)’) and definitional equivalence\n(‘\\(\\eqdf\\)’). The former is a sentential connective, but\nthe latter is trans-categorical: not only formulas, but also\npredicates, names, and items of other logical categories can occur on\nthe two sides of ‘\\(\\eqdf\\)’. Moreover, the biconditional\ncan be iterated—e.g., \\(((\\phi \\leftrightarrow \\psi)\n\\leftrightarrow \\chi)\\)—but not definitional equivalence.\nFinally, a term can be introduced by a stipulative definition into a\nground language whose logical resources are confined, say, to\nclassical conjunction and disjunction. This is perfectly feasible,\neven though the biconditional is not expressible in the language. In\nsuch cases, the inferential role of the stipulative definition is not\nmirrored by any formula of the extended language.\n\nThe traditional account of definitions should not be viewed as\nrequiring definitions to be in normal form. The only\nrequirements that it imposes are (i) that the definiendum contain the\ndefined term; (ii) that the definiendum and the definiens belong to\nthe same logical category; and (iii) the definition satisfies\nConservativeness and Eliminability. So long as these requirements are\nmet, there are no further restrictions. The definiendum, like the\ndefiniens, can be complex; and the definiens, like the definiendum,\ncan contain the defined term. So, for example, there is nothing\nformally wrong if the definition of the functional expression\n‘the number of’ has as its definiendum the formula\n‘the number of \\(F\\)s is the number of \\(G\\)s’. The role\nof normal forms is only to provide an easy way of ensuring that\ndefinitions satisfy Conservativeness and Eliminability; they do not\nprovide the only legitimate format for stipulatively introducing a\nterm. Thus, the reason why (4) is, but (6) is not, a legitimate\ndefinition is not that (4) is in normal form and (6) is not.\n\n\\[\\begin{align*}\n\\tag{4} Gx &\\eqdf x \\gt 3 \\amp x \\lt 10. \\\\\n \\tag{6} Gx &\\eqdf x \\gt y \\amp x \\lt 10. \n\\end{align*}\\]\n\n\nThe reason is that (4) respects, but (6) does not, the two criteria.\n(The ground language is assumed here to contain ordinary arithmetic;\nunder this assumption, the second definition implies a contradiction.)\nThe following two definitions are also not in normal form:\n\n\\[\\begin{align*}\n\\tag{12} Gx &\\eqdf (x \\gt 3 \\amp x \\lt 10) \\amp y = y. \\\\\n \\tag{13} Gx &\\eqdf [x = 0 \\amp(G0 \\vee G1)] \\vee [x = 1 \\amp ({\\sim}G0 \\amp {\\sim}G1)]. \n\\end{align*}\\]\n\n\nBut both should count as legitimate under the traditional account,\nsince they meet the Conservativeness and Eliminability criteria. It\nfollows that the two definitions can be put in normal form. Definition\n(12) is plainly equivalent to (4), and definition (13) is equivalent\nto (14): \n\\[\\tag{14} Gx \\eqdf x = 0. \\]\n\n\nObserve that the definiens of (13) is not logically equivalent to any\n\\(G\\)-free formula. Nevertheless, the definition has a normal\nform.\n\nSimilarly, the traditional account is perfectly compatible with\nrecursive (a.k.a.: inductive) definitions such as\nthose found in logic and mathematics. In Peano Arithmetic, for\nexample, exponentiation can be defined by means of the following\nequations: \n\\[\\tag{15} \\begin{align*}\nm^{0} &= 1, \\\\\n m^{n + 1} &= m^{n} \\cdot m. \n\\end{align*}\\]\n\n\nHere the first equation—called the base\nclause—defines the value of the function when the exponent is 0.\nAnd the second clause—called the recursive\nclause—uses the value of the function when the exponent is \\(n\\)\nto define the value when the exponent is \\(n + 1\\). This is perfectly\nlegitimate, according to the traditional account, because a theorem of\nPeano Arithmetic establishes that the above definition is equivalent\nto one in normal\n form.[10]\n Recursive definitions are circular in their format, and indeed it is\nthis circularity that renders them perspicuous. But the circularity is\nentirely on the surface, as the existence of normal forms shows. See\nthe discussion of circular definitions below.\n2.5 Conditional definitions\n\nIt is a part of our ordinary practice that we sometimes define terms\nnot absolutely but conditionally. We sometimes affirm a definition not\noutright but within the scope of a condition, which may either be left\ntacit or may be set down explicitly. So, for example, we may define\nF(x, y) to express the notion “first\ncousin once removed” by stipulating that \n\n\\[\\tag{16} \n\\begin{align} F(x, y) \\eqdf \\exists u\\exists v (&u \\text{ is a parent of } x \\\\\n &\\amp\\ v \\text{ is a grand parent of } y \\\\\n &\\amp\\ u \\text{ is a sibling of } v), \n\\end{align}\\]\n\n\nwhere it is understood that the variables range over humans. For\nanother example, when defining division, we may explicitly set down as\na condition on the definition that the divisor not be 0. We may\nstipulate that \n\\[\\tag{17} (y/x = z) \\eqdf (y = x . z), \\]\n\n\nbut with the proviso that \\( x \\neq 0 \\). This practice may appear to\nviolate the Eliminability criterion, for it appears that conditional\ndefinitions do not ensure the eliminability of the defined terms in\nall sentences. Thus (16) does not enable us to prove the equivalence\nof \n\\[\\tag{18} \\exists x F(x, 2) \\]\n\n\nwith any F-free sentence because of the tacit restriction on\nthe range of variables in (16). Similarly (17) does not enable us to\neliminate the defined symbol from \n\\[\\tag{19} 0/0 = 2. \\]\n\n\nHowever, if there is a violation of Eliminability here, it is a\nsuperficial one, and it is easily corrected in one of two ways. The\nfirst way—the way that conforms best to our ordinary\npractices—is to understand the enriched languages that result\nfrom adding the definitions to exclude sentences such as (18) and\n(19). For when we stipulate a definition such as (16), it is not our\nintention to speak about the first cousins once removed of numbers; on\nthe contrary, we wish to exclude all such talk as improper. Similarly,\nin setting down (17), we wish to exclude talk of division by 0 as\nlegitimate. So, the first way is to recognize that a conditional\ndefinition such as (16) and (17) brings with it restrictions on the\nenriched language and, consequently, respects the Eliminability\ncriterion once the enriched language is properly demarcated. This idea\ncan be implemented formally by seeing conditional definitions as\nformulated within languages with sortal quantification.\n\nThe second way—the way that conforms best to our actual formal\npractices—is to understand the applications of the defined term\nin cases where the antecedent condition fails as “don’t\ncare cases” and to make a suitable stipulation concerning such\napplications. So, we may stipulate that nothing other than a human has\nfirst cousins once removed, and we may stipulate that the result of\ndividing any number by 0 is 0. Thus we may replace (17) by\n\n\\[\\tag{20} (y/x = z) \\eqdf [x \\neq 0 \\amp y = x.z] \\vee [x = 0 \\amp z = 0]. \\]\n\n\nThe resulting definitions satisfy the Eliminability criterion. The\nsecond way forces us to exercise care in reading sentences with\ndefined terms. So, for example, the sentence \n\\[\\tag{21} \\exists x \\exists y \\exists z(x \\gt y \\amp x/z = y/z), \\]\n\n\nthough true when division in defined as in (20), does not express an\ninteresting mathematical truth but one that is merely a byproduct of\nour treatment of the “don’t care cases.” Despite\nthis cost, the gain in simplicity in the notion of proof may well\nwarrant, in some contexts, the move to a definition such as (20).\n\nSee Suppes 1957 for a different perspective on conditional\ndefinitions.\n2.6 Implicit definitions\n\nThe above viewpoint allows the traditional account to bring within its\nfold ideas that might at first sight seem contrary to it. It is\nsometimes suggested that a term \\(X\\) can be introduced axiomatically,\nthat is, by laying down as axioms certain sentences of the expanded\nlanguage \\(L^{+}\\). The axioms are then said to implicitly\ndefine \\(X\\). This idea is easily accommodated within the traditional\naccount. Let a theory be a set of sentences of the expanded\nlanguage \\(L^{+}\\). Then, to say that a theory \\(T^*\\) is an\nimplicit (stipulative) definition of X is\nto say that \\(X\\) is governed by the definition \n\\[ \\phi \\eqdf \\text{The True}, \\]\n\n\nwhere \\(\\phi\\) is the conjunction of the members of \\(T^*\\). (If\n\\(T^*\\) is infinite then a stipulation of the above form will be\nneeded for each sentence \\(\\psi\\) in\n \\(T^*\\).)[11]\n The definition is legitimate, according to the traditional account,\nso long as it meets the Conservativeness and Eliminability criteria.\nIf it does meet these criteria, let us call \\(T^*\\)\nadmissible (for a definition of X). So, the\ntraditional account accommodates the idea that theories can\nstipulatively introduce new terms, but it imposes a strong demand: the\ntheories must be\n admissible.[12]\n\nConsider, for concreteness, the special case of classical first-order\nlanguages. Let the ground language \\(L\\) be one such, and let its\ninterpretations be models of some sentences \\(T\\). Let us say that\n\n\\(T^*\\) is an implicit semantic definition of X iff, for each\ninterpretation \\(M\\) of \\(L\\), there is a unique model \\(M^{+}\\) of\n\\(T^*\\) such that \\(M^{+}\\) is an expansion of \\(M\\).\n\nThen, from the normal form theorem, the following claim is\nimmediate:\n\nIf \\(T^*\\) is admissible then \\(T^*\\) is an implicit semantic\ndefinition of \\(X\\).\n\nThat is, an admissible theory fixes the semantic value of the defined\nterm in each interpretation of the ground language. This observation\nprovides one natural method of showing that a theory is not\nadmissible:\n\nPadoa’s method. To show that \\(T^*\\) is not\nadmissible, it suffices to construct two models of \\(T^*\\) that are\nexpansions of one and the same interpretation of the ground language\n\\(L\\). (Padoa 1900)\n\nHere is a simple and philosophically useful application of\nPadoa’s method. Suppose the proof system of \\(L\\) is Peano\nArithmetic and that \\(L\\) is expanded by the addition of a unary\npredicate \\(Tr\\) (for “Gödel number of a true sentence of\n\\(L\\)”). Let \\(\\mathbf{H}\\) be the theory consisting of all the\nsentences (the “Tarski biconditionals”) of the following\nform: \n\\[ Tr(s) \\leftrightarrow \\psi, \\]\n\n\nwhere \\(\\psi\\) is a sentence of \\(L\\) and \\(s\\) is the canonical name\nfor the Gödel number of \\(\\psi\\). Padoa’s method implies\nthat \\(\\mathbf{H}\\) is not admissible for defining \\(Tr\\). For\n\\(\\mathbf{H}\\) does not fix the interpretation of \\(Tr\\) in all\ninterpretations of \\(L\\). In particular, it does not do so in the\nstandard model, for \\(\\mathbf{H}\\) places no constraints on the\nbehavior of \\(Tr\\) on those numbers that are not Gödel numbers of\nsentences. (If the coding renders each natural number a Gödel\nnumber of a sentence, then a non-standard model of Peano Arithmetic\nprovides the requisite counterexample: it has infinitely many\nexpansions that are models of \\(\\mathbf{H}\\).) A variant of this\nargument shows that Tarski’s theory of truth, as formulated in\n\\(L^{+}\\), is not admissible for defining \\(Tr\\).\n\nWhat about the converse of Padoa’s method? Suppose we can show\nthat in each interpretation of the ground language, a theory \\(T^*\\)\nfixes a unique semantic value for the defined term. Can we conclude\nthat \\(T^*\\) is admissible? This question receives a negative answer\nfor some semantical systems, and a positive answer for others. (In\ncontrast, Padoa’s method works so long as the semantic system is\nnot highly contrived.) The converse fails for, e.g., classical\nsecond-order languages, but it holds for first-order ones:\n\nBeth’s Definability Theorem. If \\(T^*\\) is an\nimplicit semantic definition of \\(X\\) in a classical first-order\nlanguage then \\(T^*\\) is admissible.\n\nNote that the theorem holds even if \\(T^*\\) is an infinite set. For a\nproof of the theorem, see Boolos, Burgess, and Jeffrey 2002; see also\nBeth 1953.\n\nThe idea of implicit definition is not in conflict, then, with the\ntraditional account. Where conflict arises is in the philosophical\napplications of the idea. The failure of strict reductionist programs\nof the late-nineteenth and early-twentieth century prompted\nphilosophers to explore looser kinds of reductionism. For instance,\nFrege’s definition of number proved to be inconsistent, and thus\nincapable of sustaining the logicist thesis that the principles of\narithmetic are analytic. It turns out, however, that the principles of\narithmetic can be derived without Frege’s definition. All that\nis needed is one consequence of it, namely, Hume’s\nPrinciple:\n\nHume’s Principle. The number of \\(F\\)s = the\nnumber of \\(G\\)s iff there is a one-to-one correspondence between the\n\\(F\\)s and \\(G\\)s.\n\nIf we add Hume’s Principle to axiomatic second-order logic, then\nwe obtain a consistent theory from which we can analytically derive\nsecond-order Peano Arithmetic. (The essentials of the argument are\nfound already in Frege 1884.) It is a central thesis of\nNeo-Fregeanism that Hume’s Principle is an implicit\ndefinition of the functional expression ‘the number of’\n(see Hale and Wright 2001). If this thesis can be defended, then\nlogicism about arithmetic can be sustained. However, the neo-Fregean\nthesis is in conflict with the traditional account of definitions, for\nHume’s Principle violates both Conservativeness and\nEliminability. The principle allows one to prove, for arbitrary \\(n\\),\nthat there are at least \\(n\\) objects.\n\nAnother example: The reductionist program for theoretical concepts\n(e.g., those of physics) aimed to solve epistemological problems that\nthese concepts pose. The program aimed to reduce theoretical sentences\nto (classes of) observational sentences. However, the reductions\nproved difficult, if not impossible, to sustain. Thus arose the\nsuggestion that perhaps the non-observational component of a theory\ncan, without any claim of reduction, be regarded as an implicit\ndefinition of theoretical terms. The precise characterization of the\nnon-observational component can vary with the specific epistemological\nproblem at hand. But there is bound to be a violation of one or both\nof the two criteria, Conservativeness and\n Eliminability.[13]\n\nA final example: We know by a theorem of Tarski that no theory can be\nan admissible definition of the truth predicate, \\(Tr\\), for the\nlanguage of Peano Arithmetic considered above. Nonetheless, perhaps we\ncan still regard theory \\(\\mathbf{H}\\) as an implicit definition of\n\\(Tr\\). (Paul Horwich has made a closely related proposal for the\nordinary notion of truth.) Here, again, pressure is put on the bounds\nimposed by the traditional account. \\(\\mathbf{H}\\) meets the\nConservativeness criterion, but not that of Eliminability.\n\nIn order to assess the challenge these philosophical applications pose\nfor the traditional account, we need to resolve issues that are under\ncurrent philosophical debate. Some of the issues are the following.\n(i) It is plain that some violations of Conservativeness are\nillegitimate: one cannot make it true by a stipulation that,\ne.g., Mercury is larger than Venus. Now, if a philosophical\napplication requires some violations of Conservativeness to be\nlegitimate, we need an account of the distinction between the two\nsorts of cases: the legitimate violations of Conservativeness and the\nnon-legitimate ones. And we need to understand what it is that renders\nthe one legitimate, but not the other. (ii) A similar issue arises for\nEliminability. It would appear that not any old theory can be an\nimplicit definition of a term \\(X\\). (The theory might contain only\ntautologies.) If so, then again we need a demarcation of theories that\ncan serve to implicitly define a term from those that cannot. And we\nneed a rationale for the distinction. (iii) The philosophical\napplications rest crucially on the idea that an implicit definition\nfixes the meaning of the defined term. We need therefore an account of\nwhat this meaning is, and how the implicit definition fixes it. Under\nthe traditional account, formulas containing the defined term can be\nseen as acquiring their meaning from the formulas of the ground\nlanguage. (In view of the primacy of the sentential, this fixes the\nmeaning of the defined term.) But this move is not available under a\nliberalized conception of implicit definition. How, then, should we\nthink of the meaning of a formula under the envisioned departure from\nthe traditional account? (iv) Even if the previous three issues are\naddressed satisfactorily, an important concern remains. Suppose we\nallow that a theory \\(T\\), say, of physics can stipulatively define\nits theoretical terms, and that it endows the terms with particular\nmeanings. The question remains whether the meanings thus endowed are\nidentical to (or similar enough to) the meanings the theoretical terms\nhave in their actual uses in physics. This question must be answered\npositively if implicit definitions are to serve their philosophical\nfunction. The aim of invoking implicit definitions is to account for\nthe rationality, or the apriority, or the analyticity of our ordinary\njudgments, not of some extraordinary judgments that are somehow\nassigned to ordinary signs.\n\nThe literature on neo-Fregeanism presents an interesting case study in\nrespect of these issues. Much of the debate concerning the neo-Fregean\nthesis can fruitfully be viewed as a debate over the extent and\nprecise formulation of the criteria of Conservativeness and Use. For\nexample, the so-called Julius Caesar objection (due to Frege\n1884) urges that Hume’s Principle cannot be a legitimate\ndefinition of ‘the number of’ because it does not\ndetermine the use of this expression in mixed identity contexts, such\nas ‘\\(\\text{the number of }F\\text{s} = \\text{Julius\nCaesar}\\)’. Other classic objections (Field 1984, Boolos 1997)\nfocus on the non-conservativeness of Hume’s Principle. Boolos\n1990 raises a particularly sharp point, known as the Bad Company\nproblem. Definitions of the same kind as Hume’s Principle\nare known as abstraction principles. Boolos exhibits an\nabstraction principle that is consistent by itself, but inconsistent\nin conjunction with Hume’s Principle. This pathological\nsituation never arises with conservative definitions. So, the Bad\nCompany problem illustrates what can go wrong when the\nConservativeness requirement is violated.\n\nFriends of neo-Fregeanism have responded to these objections in\nvarious ways. Wright 1997 argues that abstraction principles need only\nsatisfy a restricted version of Conservativeness, and needn’t\nsatisfy Eliminability at all. (However, Wright’s proposal\nsuffered the revenge of the Bad Company problem: see Weir 2003.) By\ncontrast, Linnebo 2018 argues for much more stringent requirements on\nabstraction principles. He countenances only predicative\nabstraction principles, which satisfy both Conservativeness and\nEliminability in suitable contexts. Mackereth and Avigad (forthcoming)\ndefend an intermediate position. They hold that abstraction principles\nmust satisfy Conservativeness in an unrestricted sense, but\nneedn’t satisfy Eliminability. Furthermore, Mackereth and Avigad\nshow that in the absence of Eliminability, the precise formulation of\nConservativeness (syntactic vs. semantic, etc.) makes a big\ndifference. In particular, it is possible to get impredicative\nversions of Hume’s Principle that are semantically\nconservative, but the same does not appear to be true for\nsyntactic conservativeness.\n\nFor further discussion of these issues, see Horwich 1998, especially\nchapter 6; Hale and Wright 2001, especially chapter 5; and the works\ncited there.\n2.7 Vicious-Circle Principle\n\nAnother departure from the traditional theory begins with the idea not\nthat the theory is too strict, but that it is too liberal, that it\npermits definitions that are illegitimate. Thus, the traditional\ntheory allows the following definitions of, respectively,\n“liar” and the class of natural numbers\n\\(\\mathbf{N}\\):\n\n(22)\n\\(z\\) is a liar \\(\\eqdf\\) all propositions asserted by \\(z\\) are\nfalse;\n(23)\n\\(z\\) belongs to \\(\\mathbf{N}\\) \\(\\eqdf\\) \\(z\\) belongs to every\ninductive class, where a class is inductive when it contains 0 and is\nclosed under the successor operation.\n\n\nRussell argued that such definitions involve a subtle kind of vicious\ncircle. The definiens of the first definition invokes, Russell\nthought, the totality of all propositions, but the definition, if\nlegitimate, would result in propositions that can only be defined by\nreference to this totality. Similarly, the second definition attempts\nto define the class \\(\\mathbf{N}\\) by reference to all classes, which\nincludes the class \\(\\mathbf{N}\\) that is being defined. Russell\nmaintained that such definitions are illegitimate. And he imposed the\nfollowing requirement—called, the “Vicious-Circle\nPrinciple”—on definitions and concepts. (Henri\nPoincaré had also proposed a similar idea.)\n\nVicious-Circle Principle. “Whatever involves\nall of a collection must not be one of the collection\n(Russell 1908, 63).”\n\nAnother formulation Russell gave of the Principle is this:\n\nVicious-Circle Principle (variant formulation).\n“If, provided a certain collection had a total, it would have\nmembers only definable in terms of that total, then the said\ncollection has no total (Russell, 1908, 63).”\n\nIn an appended footnote, Russell explained, “When I say that a\ncollection has no total, I mean that statements about all its\nmembers are nonsense.”\n\nRussell’s primary motivation for the Vicious-Circle Principle\nwere the logical and semantic paradoxes. Notions such as\n“truth,” “proposition,” and\n“class” generate, under certain unfavorable conditions,\nparadoxical conclusions. Thus, the claim “Cheney is a\nliar,” where “liar” is understood as in (16), yields\nparadoxical conclusions, if Cheney has asserted that he is a liar, and\nall other propositions asserted by him are, in fact, false. Russell\ntook the Vicious-Circle Principle to imply that if “Cheney is a\nliar” expresses a proposition, it cannot be in the scope of the\nquantifier in the definiens of (16). More generally, Russell held that\nquantification over all propositions, and over all classes, violates\nthe Vicious-Circle Principle and is thus illegitimate. Furthermore, he\nmaintained that expressions such as ‘true’ and\n‘false’ do not express a unique concept—in\nRussell’s terminology, a unique “propositional\nfunction”—but one of a hierarchy of propositional\nfunctions of different orders. Thus the lesson Russell drew from the\nparadoxes is that the domain of the meaningful is more restricted than\nit might ordinarily appear, that the traditional account of concepts\nand definitions needed to be made more restrictive in order to rule\nout the likes of (16) and (17).\n\nIn application to ordinary, informal definitions, the Vicious-Circle\nPrinciple does not provide, it must be said, a clear method of\ndemarcating the meaningful from the meaningless. Definition (16) is\nsupposed to be illegitimate because, in its definiens, the quantifier\nranges over the totality of all propositions. And we are told that\nthis is prohibited because, were it allowed, the totality of\npropositions “would have members only definable in terms of the\ntotal.” However, unless we know more about the nature of\npropositions and of the means available for defining them, it is\nimpossible to determine whether (16) violates the Principle. It may be\nthat a proposition such as “Cheney is a liar”—or, to\ntake a less contentious example, “Either Cheney is a liar or he\nis not”— can be given a definition that does not appeal to\nthe totality of all propositions. If propositions are sets of possible\nworlds, for example, then such a definition would appear to be\nfeasible.\n\nThe Vicious-Circle Principle serves, nevertheless, as an effective\nmotivation for a particular account of legitimate concepts and\ndefinitions, namely that embodied in Russell’s Ramified Type\nTheory. The idea here is that one begins with some unproblematic\nresources that involve no quantification over propositions, concepts,\nand such. These resources enable one to define, for example, various\nunary concepts, which are thereby assured of satisfying the\nVicious-Circle Principle. Quantification over these concepts is thus\nbound to be legitimate, and can be added to the language. The same\nholds for propositions and for concepts falling under other types: for\neach type, a quantifier can be added that ranges over items (of that\ntype) that are definable using the initial unproblematic resources.\nThe new quantificational resources enable the definition of further\nitems of each type; these, too, respect the Principle, and again,\nquantifiers ranging over the expanded totalities can legitimately be\nadded to the language. The new resources permit the definition of yet\nfurther items. And the process repeats. The result is that we have a\nhierarchy of propositions and of concepts of various orders. Each type\nin the type hierarchy ramifies into a multiplicity of orders. This\nramification ensures that definitions formulated in the resulting\nlanguage are bound to respect the Vicious-Circle Principle. Concepts\nand classes that can be defined within the confines of this scheme are\nsaid to be predicative (in one sense of this word); the\nothers, impredicative.\n\nFor further discussion of the Vicious-Circle Principle, see Russell\n1908, Whitehead and Russell 1925, Gödel 1944, and Chihara 1973.\nFor a formal presentation of Ramified Type Theory, see Church 1976;\nfor a more informal presentation, see Hazen 1983. See also the entries\non\n type theory\n and\n Principia Mathematica,\n which contain further references.\n2.8 Circular definitions\n\nThe paradoxes can also be used to motivate a conclusion that is the\nvery opposite to Russell’s. Consider the following definition of\na one-place predicate \\(G\\): \n\\[\\tag{24} \\begin{align*}\nGx \\eqdf x = \\text{Socrates} &\\vee (x = \\text{Plato} \\amp Gx) \\\\\n &\\vee (x = \\text{Aristotle} \\amp {\\sim}Gx). \n\\end{align*}\\]\n\n\nThis definition is essentially circular; it is not reducible to one in\nnormal form. Still, intuitively, it provides substantial guidance on\nthe use of \\(G\\). The definition dictates, for instance, that Socrates\nfalls under \\(G\\), and that nothing apart from the three ancient\nphilosophers mentioned does so. The definition leaves unsettled the\nstatus of only two objects, namely, Plato and Aristotle. If we suppose\nthat Plato falls under \\(G\\), the definition yields that Plato does\nfall under \\(G\\) (since Plato satisfies the definiens), thus\nconfirming our supposition. The same thing happens if we suppose the\nopposite, namely, that Plato does not fall under \\(G\\); again our\nsupposition is confirmed. With Aristotle, any attempt to decide\nwhether he falls under \\(G\\) lands us in an even more precarious\nsituation: if we suppose that Aristotle falls under \\(G\\), we are led\nto conclude by the definition that he does not fall under \\(G\\) (since\nhe does not satisfy the definiens); and, conversely, if we suppose\nthat he does not fall under \\(G\\), we are led to conclude that he\ndoes. But even on Plato and Aristotle, the behavior of \\(G\\) is not\nunfamiliar: \\(G\\) is behaving here in the way the concept of truth\nbehaves on the Truth Teller (“What I am now saying is\ntrue”) and the Liar (“What I am now saying is not\ntrue”). More generally, there is a strong parallel between the\nbehavior of the concept of truth and that of concepts defined by\ncircular definitions. Both are typically well defined on a range of\ncases, and both display a variety of unusual logical behavior on the\nother cases. Indeed, all the different kinds of perplexing logical\nbehavior found with the concept of truth are found also in concepts\ndefined by circular definitions. This strong parallelism suggests that\nsince truth is manifestly a legitimate concept, so also are concepts\ndefined by circular definitions such as (18). The paradoxes, according\nto this viewpoint, cast no doubt on the legitimacy of the concept of\ntruth. They show only that the logic and semantics of circular\nconcepts is different from that of non-circular ones. This viewpoint\nis developed in the revision theory of definitions.\n\nIn this theory, a circular definition imparts to the defined term a\nmeaning that is hypothetical in character; the semantic value\nof the defined term is a rule of revision, not as with\nnon-circular definitions, a rule of application. Consider\n(18) again. Like any definition, (18) fixes the interpretation of the\ndefiniendum if the interpretations of the non-logical\nconstants in the definiens are given. The problem with (18) is that\nthe defined term \\(G\\) occurs in the definiens. But suppose that we\narbitrarily assign to \\(G\\) an interpretation—say we let it be\nthe set \\(U\\) of all objects in the universe of discourse (i.e., we\nsuppose that \\(U\\) is the set of objects that satisfy \\(G)\\). Then it\nis easy to see that the definiens is true precisely of Socrates and\nPlato. The definition thus dictates that, under our hypothesis, the\ninterpretation of \\(G\\) should be the set \\(\\{ \\text{Socrates},\n\\text{Plato}\\}\\). A similar calculation can be carried out for any\nhypothesis about the interpretation of \\(G\\). For example, if the\nhypothesis is \\(\\{\\text{Xenocrates}\\}\\), the definition yields the\nresult \\(\\{\\text{Socrates}, \\text{Aristotle}\\}\\). In short, even\nthough (18) does not fix sharply what objects fall under \\(G\\), it\ndoes yield a rule or function that, when given a hypothetical\ninterpretation as an input, yields another one as an output. The\nfundamental idea of the revision theory is to view this rule as a\nrevision rule: the output interpretation is better than the\ninput one (or it is at least as good; this qualification will be taken\nas read). The semantic value that the definition confers on the\ndefined term is not an extension—a demarcation of the universe\nof discourse into objects that fall under the defined term, and those\nthat do not. The semantic value is a revision rule.\n\nThe revision rule explains the behavior, both ordinary and\nextraordinary, of a circular concept. Let \\(\\delta\\) be the revision\nrule yielded by a definition, and let \\(V\\) be an arbitrary\nhypothetical interpretation of the defined term. We can attempt to\nimprove our hypothesis \\(V\\) by repeated applications of the rule\n\\(\\delta\\). The resulting sequence, \n\\[ V, \\delta(V), \\delta(\\delta(V)), \\delta(\\delta(\\delta(V))),\\ldots, \\]\n\n\nis a revision sequence for \\(\\delta\\). The totality\nof revision sequences for \\(\\delta\\), for all possible initial\nhypotheses, is the revision process generated by \\(\\delta\\).\nFor example, the revision rule for (18) generates a revision process\nthat consists of the following revision sequences, among others:\n\n\\[ U, \\{\\text{Socrates}, \\text{Plato}\\}, \\{\\text{Socrates}, \\text{Plato}, \\text{Aristotle}\\}, \\{\\text{Socrates}, \\text{Plato}\\},\\ldots \\]\n \n\\[ \\{\\text{Xenocrates}\\}, \\{\\text{Socrates}, \\text{Aristotle}\\}, \\{\\text{Socrates}\\}, \\{\\text{Socrates}, \\text{Aristotle}\\},\\ldots \\]\n\n\nObserve the behavior of our four ancient philosophers in this process.\nAfter some initial stages of revision, Socrates always falls in the\nrevised interpretations, and Xenocrates always falls outside. (In this\nparticular example, the behavior of the two is fixed after the initial\nstage; in other cases, it may take many stages of revision before the\nstatus of an object becomes settled.) The revision process yields a\ncategorical verdict on the two philosophers: Socrates\ncategorically falls under \\(G\\), and Xenocrates categorically falls\noutside \\(G\\). Objects on which the process does not yield a\ncategorical verdict are said to be pathological (relative\nto the revision rule, the definition, or the defined concept). In\nour example, Plato and Aristotle are pathological relative to (18).\nThe status of Aristotle is not stable in any revision sequence. It is\nas if the revision process cannot make up its mind about him.\nSometimes Aristotle is ruled as falling under \\(G\\), and then the\nprocess reverses itself and declares that he does not fall under\n\\(G\\), and then the process reverses itself again. When an object\nbehaves in this way in all revision sequences, it is said to be\nparadoxical. Plato is also pathological relative to \\(G\\),\nbut his behavior in the revision process is different. Plato acquires\na stable status in each revision sequence, but the status he acquires\ndepends upon the initial hypothesis.\n\nRevision processes help provide a semantics for circular\n definitions.[14]\n They can be used to define semantic notions such as\n“categorical truth” and logical notions such as\n“validity.” The characteristics of the logical notions we\nobtain depend crucially on one aspect of revision: the number of\nstages before objects settle down to their regular behavior in the\nrevision process. A definition is said to be finite iff,\nroughly, its revision process necessarily requires only finitely many\nsuch\n stages.[15]\n For finite definitions, there is a simple logical calculus,\n\\(\\mathbf{C}_{0}\\), that is sound and complete for the revision\n semantics.[16]\n With non-finite definitions, the revision process extends into the\n transfinite.[17]\n And these definitions can add considerable expressive power to the\nlanguage. (When added to first-order arithmetic, these definitions\nrender all \\(\\Pi^{1}_{2}\\) sets of natural numbers definable.) Because\nof the expressive power, the general notion of validity for non-finite\ncircular definitions is not axiomatizable (Kremer 1993). We can give\nat best a sound logical calculus, but not a complete one. The\nsituation is analogous to that with second-order logic.\n\nLet us observe some general features of the revision theory of\ndefinitions. (i) Under this theory, the logic and semantics of\nnon-circular definitions—i.e., definitions in normal\nform—remain the same as in the traditional account. The\nintroduction and elimination rules hold unrestrictedly, and revision\nstages are dispensable. The deviations from the traditional account\noccur only over circular definitions. (ii) Under the theory, circular\ndefinitions do not disturb the logic of the ground language. Sentences\ncontaining defined terms are subject to the same logical laws as\nsentences of the ground language. (iii) Conservativeness holds. No\ndefinition, no matter how vicious the circularity in it, entails\nanything new in the ground language. Even the utterly paradoxical\ndefinition \n\\[ Gx \\eqdf {\\sim}Gx \\]\n\n\nrespects the Conservativeness requirement. (iv) Eliminability fails to\nhold. Sentences of the expanded language are not, in general,\nreducible to those of the ground language. This failure has two\nsources. First, revision theory fixes the use, in assertion and\nargument, of sentences of the expanded language but without reducing\nthe sentences to those of the ground language. The theory thus meets\nthe Use criterion, but not the stronger one of Eliminability. Second,\nin this theory, a definition can add logical and expressive power to a\nground language. The addition of a circular definition can result in\nthe definability of new sets. This is another reason why Eliminability\nfails.\n\nIt may be objected that every concept must have an extension, that\nthere must be a definite totality of objects that fall under the\nconcept. If this is right then a predicate is meaningful—it\nexpresses a concept—only if the predicate necessarily demarcates\nthe world sharply into those objects to which it applies and those to\nwhich it does not apply. Hence, the objection concludes, no predicate\nwith an essentially circular definition can be meaningful. The\nobjection is plainly not decisive, for it rests on a premiss that\nrules out many ordinary and apparently meaningful predicates (e.g.,\n‘bald’). Nonetheless, it is noteworthy because it\nillustrates how general issues about meaning and concepts enter the\ndebate on the requirements on legitimate definitions.\n\nThe principal motivation for revision theory is descriptive. It has\nbeen argued that the theory helps us to understand better our ordinary\nconcepts such as truth, necessity, and rational choice. The ordinary\nas well as the perplexing behavior of these concepts, it is argued,\nhas its roots in the circularity of the concepts. If this is correct,\nthen there is no logical requirement on descriptive and explicative\ndefinitions that they be non-circular.\n\nFor more detailed treatments of these topics, see Gupta 1988/89, Gupta\nand Belnap 1993, and Chapuis and Gupta 1999. See also the entry on the\n revision theory of truth.\n For critical discussions of the revision theory, see the papers by\nVann McGee and Donald A. Martin, and the reply by Gupta, in Villanueva\n1997. See also Shapiro 2006.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Belnap, N., 1993, “On Rigorous Definitions,”\n<em>Philosophical Studies</em>, 72: 115–146.",
                "Beth, E. W., 1953, “On Padoa’s Method in the Theory of\nDefinitions,” <em>Indagationes Mathematicae</em>, 15:\n330–339.",
                "Boolos, G. S., 1997, “Is Hume’s Principle\nAnalytic?” in <em>Language, Thought, and Logic: Essays in Honour\nof Michael Dummett</em>, edited by R. K. Heck, Oxford: Oxford\nUniversity Press. Reprinted in his <em>Logic, Logic, and Logic</em>,\nedited by R. Jeffrey and J. P. Burgess, Cambridge MA: Harvard\nUniversity Press (1998), pp. 301–314.",
                "Boolos, G. S., Burgess, J. P., and Jeffrey, R. C., 2002,\n<em>Computability and Logic</em>, fourth edition, Cambridge: Cambridge\nUniversity Press.",
                "Carnap, R., 1956, <em>Meaning and Necessity: A Study in Semantics\nand Modal Logic</em>, enlarged edition, Chicago: University of Chicago\nPress.",
                "Carnap, R. 1963, “Replies and Systematic Expositions,”\nin <em>The Philosophy of Rudolph Carnap</em>, edited by P. A. Schilpp,\nLa Salle IL: Open Court, pp. 859–1013.",
                "Chapuis, A., and Gupta, A. (eds.), 1999, <em>Circularity,\nDefinition, and Truth</em>, New Delhi: Indian Council of Philosophical\nResearch.",
                "Charles, D. (ed.), 2010, <em>Definition in Greek Philosophy</em>,\nOxford: Oxford University Press.",
                "Chihara, C. S., 1973, <em>Ontology and the Vicious-Circle\nPrinciple</em>, Ithaca: Cornell University Press.",
                "Church, A., 1956, <em>Introduction to Mathematical Logic</em>,\nPrinceton: Princeton University Press.",
                "–––, 1976, “Comparison of Russell’s\nResolution of the Semantical Antinomies with that of Tarski,”\n<em>Journal of Symbolic Logic</em>, 41: 747–760.",
                "Demopoulos, W., 2003, “On the Rational Reconstruction of our\nTheoretical Knowledge,” <em>British Journal for the Philosophy\nof Science</em>, 54: 371–403.",
                "Dudman, V. H., 1973, “Frege on Definitions,”\n<em>Mind</em>, 83: 609–610.",
                "Field, H., 1984, “Crispin Wright: Frege’s Conception\nof Numbers as Objects (Aberdeen University Press 1983),”\n<em>Canadian Journal of Philosophy,</em> 14(4): 637–662.",
                "Fine, K., 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8: 1–15.",
                "Frege, G., 1879, <em>Begriffsschrift</em>, in <em>From Frege to\nGödel: A Source Book in Mathematical Logic, 1879–1931</em>,\nedited by J. van Heijenoort, Cambridge MA: Harvard University Press\n(1967), pp. 1–82.",
                "–––, 1884, <em>The Foundations of Arithmetic: A\nLogico-Mathematical Inquiry into the Concept of Number</em>, second\nrevised edition (1980), Evanston: Northwestern University Press.",
                "–––, 1914, “Logic in Mathematics,”\nin <em>Gottlob Frege: Posthumous Writings</em>, edited by H. Hermes,\nF. Kambartel, and F. Kaulbach, Chicago: University of Chicago Press\n(1979), pp. 203–250.",
                "Gödel, K., 1944, “Russell’s Mathematical\nLogic,” reprinted in his <em>Collected Works: Volume II:\nPublications 1938–1974</em>, New York: Oxford University Press\n(1990), pp. 119–141",
                "Gupta, A., 1988/89, “Remarks on Definitions and the Concept\nof Truth,” <em>Proceedings of the Aristotelian Society</em>, 89:\n227–246.",
                "–––, 2006, “Finite Circular\nDefinitions,” in <em>Self-Reference</em>, edited by T. Bolander,\nV. F. Hendricks, and S. A. Andersen, Stanford: CSLI Publications, pp.\n79–93.",
                "–––, 2019, <em>Conscious Experience: A Logical\nInquiry</em>, Cambridge, MA: Harvard University Press.",
                "Gupta, A. and Belnap, N., 1993, <em>The Revision Theory of\nTruth</em>, Cambridge MA: MIT Press.",
                "Hacker, P.M.S., 1993, “Wittgenstein on Ostensive\nDefinitions,” <em>Inquiry</em>, 18: 267–287.",
                "Halbach, V., 2014, <em>Axiomatic Theories of Truth</em>, revised\nedition, New York: Cambridge University Press.",
                "Hale B., and Wright C., 2001, <em>The Reason’s Proper Study:\nEssays towards a Neo-Fregean Philosophy of Mathematics</em>, Oxford:\nClarendon Press.",
                "Hazen, A., 1983, “Predicative Logics,” in <em>Handbook\nof Philosophical Logics: Volume I: Elements of Classical Logic</em>,\nedited by D. Gabbay and F. Guenthner, Dordrecht: Reidel, pp.\n331–407.",
                "Hodges, W., 1993, “Tarski’s Theory of\nDefinition,” in <em>New Essays on Tarski and Philosophy</em>,\nedited by D. Patterson, Oxford: Oxford University Press, pp.\n94–132.",
                "Horty, J., 2007, <em>Frege on Definitions: A Case Study of\nSemantic Content</em>, New York: Oxford University Press.",
                "Horwich, P., 1998, <em>Meaning</em>, Oxford: Clarendon Press.",
                "Kremer, P., 1993, “The Gupta-Belnap systems\n\\(\\mathbf{S}^{\\#}\\) and \\(\\mathbf{S}^{*}\\) are not\naxiomatisable,” <em>Notre Dame Journal of Formal Logic</em>, 34:\n583–596.",
                "Kripke, S. A., 1980, <em>Naming and Necessity</em>, Cambridge MA:\nHarvard University Press.",
                "Lewis, D., 1970, “How to Define Theoretical Terms,”\n<em>Journal of Philosophy</em>, 67: 427–446.",
                "Linnebo, Ø., 2018, <em>Thin Objects: An Abstractionist\nAccount</em>, New York: Oxford University Press.",
                "Locke, J., 1689, <em>An Essay concerning Human Understanding</em>,\nedited by P. H. Nidditch, Oxford: Oxford University Press (1975).",
                "Mackereth, S., and Avigad, J., forthcoming, “Two-sorted\nFrege Arithmetic is not Conservative,” <em>Review of Symbolic\nLogic</em>, first online 18 April 2022. doi:10.1017/S1755020322000156",
                "Martinez, M., 2001, “Some Closure Properties of Finite\nDefinitions,” <em>Studia Logica</em>, 68: 43–68.",
                "Moschovakis, Y., 1974, <em>Elementary Induction on Abstract\nStructures</em>, Amsterdam: North-Holland.",
                "Padoa, A., 1900, “Logical Introduction to Any Deductive\nTheory,” in <em>From Frege to Gödel: A Source Book in\nMathematical Logic, 1879–1931</em>, edited by J. van Heijenoort,\nCambridge MA: Harvard University Press (1967), pp. 118–123.",
                "Quine, W. V. O., 1951, “Two Dogmas of Empiricism,”\nreprinted in his <em>From a Logical Point of View</em>, Cambridge MA:\nHarvard University Press (1953), pp. 20–46.",
                "–––, 1960, <em>Word and Object</em>, Cambridge\nMA: MIT Press.",
                "Ramsey, F. P., 1931, “Theories,” reprinted in\n<em>Foundations: Essays in Philosophy, Logic, Mathematics and\nEconomics</em>, edited by D. H. Mellor, Atlantic Highlands, NJ:\nHumanities Press, 1978, pp. 101–125.",
                "Robinson, R., 1950, <em>Definition</em>, Oxford: Clarendon\nPress.",
                "Rosen, G., 2015, “Real Definition,” <em>Analytic\nPhilosophy</em>, 56: 189–209.",
                "Russell, B., 1908, “Mathematical Logic as Based on the\nTheory of Types,” reprinted in his <em>Logic and Knowledge:\nEssays 1901–1950</em>, London: George Allen &amp; Unwin, 1956,\npp. 59–102.",
                "–––, 1948, <em>Human Knowledge: Its Scope and\nLimits</em>, New York: Simon and Schuster.",
                "Shapiro, L., 2006, “The Rationale Behind Revision-Rule\nSemantics,” <em>Philosophical Studies</em>, 129:\n477–515.",
                "Suppes, P., 1957, <em>Introduction to Logic</em>, New York: Van\nNostrand Reinhold.",
                "Tarski, A., 1983, <em>Logic, Semantics, Metamathematics: Papers\nfrom 1923 to 1938</em>, second edition, edited by J. Corcoran,\nIndianapolis: Hackett Publishing Company.",
                "Urbaniak, R., and Hämäri, K. S., 2012, “Busting a\nMyth about Leśniewski and Definitions,” <em>History and\nPhilosophy of Logic</em>, 33: 159–189.",
                "Villanueva, E., (ed.), 1997, <em>Truth</em> (<em>Philosophical\nIssues</em> 8), Atascadero: Ridgeview Publishing Company.",
                "Weir, A., 2003, “Neo-Fregeanism: An Embarrassment of\nRiches,” <em>Notre Dame Journal of Formal Logic</em>, 44(1):\n13–48.",
                "Whitehead, A. N., and Russell, B., 1925, <em>Principia\nMathematica</em>, vol. 1, second edition, Cambridge: Cambridge\nUniversity Press.",
                "Whiteley, C. H., 1956, “Meaning and Ostensive\nDefinition,” <em>Mind</em>, 65: 332–335.",
                "Wittgenstein, L., 1953, <em>Philosophical Investigations</em>, New\nYork: Macmillan.",
                "Wright, C., 1997, “On the Philosophical Significance of\nFrege’s Theorem,” in <em>Language, Thought, and Logic:\nEssays in Honour of Michael Dummett</em>, edited by R. K. Heck,\nOxford: Oxford University Press. Reprinted in Hale and Wright 2001,\npp. 272–306."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Belnap, N., 1993, “On Rigorous Definitions,”\n<em>Philosophical Studies</em>, 72: 115–146.</li>\n<li>Beth, E. W., 1953, “On Padoa’s Method in the Theory of\nDefinitions,” <em>Indagationes Mathematicae</em>, 15:\n330–339.</li>\n<li>Boolos, G. S., 1997, “Is Hume’s Principle\nAnalytic?” in <em>Language, Thought, and Logic: Essays in Honour\nof Michael Dummett</em>, edited by R. K. Heck, Oxford: Oxford\nUniversity Press. Reprinted in his <em>Logic, Logic, and Logic</em>,\nedited by R. Jeffrey and J. P. Burgess, Cambridge MA: Harvard\nUniversity Press (1998), pp. 301–314.</li>\n<li>Boolos, G. S., Burgess, J. P., and Jeffrey, R. C., 2002,\n<em>Computability and Logic</em>, fourth edition, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Carnap, R., 1956, <em>Meaning and Necessity: A Study in Semantics\nand Modal Logic</em>, enlarged edition, Chicago: University of Chicago\nPress.</li>\n<li>Carnap, R. 1963, “Replies and Systematic Expositions,”\nin <em>The Philosophy of Rudolph Carnap</em>, edited by P. A. Schilpp,\nLa Salle IL: Open Court, pp. 859–1013.</li>\n<li>Chapuis, A., and Gupta, A. (eds.), 1999, <em>Circularity,\nDefinition, and Truth</em>, New Delhi: Indian Council of Philosophical\nResearch.</li>\n<li>Charles, D. (ed.), 2010, <em>Definition in Greek Philosophy</em>,\nOxford: Oxford University Press.</li>\n<li>Chihara, C. S., 1973, <em>Ontology and the Vicious-Circle\nPrinciple</em>, Ithaca: Cornell University Press.</li>\n<li>Church, A., 1956, <em>Introduction to Mathematical Logic</em>,\nPrinceton: Princeton University Press.</li>\n<li>–––, 1976, “Comparison of Russell’s\nResolution of the Semantical Antinomies with that of Tarski,”\n<em>Journal of Symbolic Logic</em>, 41: 747–760.</li>\n<li>Demopoulos, W., 2003, “On the Rational Reconstruction of our\nTheoretical Knowledge,” <em>British Journal for the Philosophy\nof Science</em>, 54: 371–403.</li>\n<li>Dudman, V. H., 1973, “Frege on Definitions,”\n<em>Mind</em>, 83: 609–610.</li>\n<li>Field, H., 1984, “Crispin Wright: Frege’s Conception\nof Numbers as Objects (Aberdeen University Press 1983),”\n<em>Canadian Journal of Philosophy,</em> 14(4): 637–662.</li>\n<li>Fine, K., 1994, “Essence and Modality,”\n<em>Philosophical Perspectives</em>, 8: 1–15.</li>\n<li>Frege, G., 1879, <em>Begriffsschrift</em>, in <em>From Frege to\nGödel: A Source Book in Mathematical Logic, 1879–1931</em>,\nedited by J. van Heijenoort, Cambridge MA: Harvard University Press\n(1967), pp. 1–82.</li>\n<li>–––, 1884, <em>The Foundations of Arithmetic: A\nLogico-Mathematical Inquiry into the Concept of Number</em>, second\nrevised edition (1980), Evanston: Northwestern University Press.</li>\n<li>–––, 1914, “Logic in Mathematics,”\nin <em>Gottlob Frege: Posthumous Writings</em>, edited by H. Hermes,\nF. Kambartel, and F. Kaulbach, Chicago: University of Chicago Press\n(1979), pp. 203–250.</li>\n<li>Gödel, K., 1944, “Russell’s Mathematical\nLogic,” reprinted in his <em>Collected Works: Volume II:\nPublications 1938–1974</em>, New York: Oxford University Press\n(1990), pp. 119–141</li>\n<li>Gupta, A., 1988/89, “Remarks on Definitions and the Concept\nof Truth,” <em>Proceedings of the Aristotelian Society</em>, 89:\n227–246.</li>\n<li>–––, 2006, “Finite Circular\nDefinitions,” in <em>Self-Reference</em>, edited by T. Bolander,\nV. F. Hendricks, and S. A. Andersen, Stanford: CSLI Publications, pp.\n79–93.</li>\n<li>–––, 2019, <em>Conscious Experience: A Logical\nInquiry</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Gupta, A. and Belnap, N., 1993, <em>The Revision Theory of\nTruth</em>, Cambridge MA: MIT Press.</li>\n<li>Hacker, P.M.S., 1993, “Wittgenstein on Ostensive\nDefinitions,” <em>Inquiry</em>, 18: 267–287.</li>\n<li>Halbach, V., 2014, <em>Axiomatic Theories of Truth</em>, revised\nedition, New York: Cambridge University Press.</li>\n<li>Hale B., and Wright C., 2001, <em>The Reason’s Proper Study:\nEssays towards a Neo-Fregean Philosophy of Mathematics</em>, Oxford:\nClarendon Press.</li>\n<li>Hazen, A., 1983, “Predicative Logics,” in <em>Handbook\nof Philosophical Logics: Volume I: Elements of Classical Logic</em>,\nedited by D. Gabbay and F. Guenthner, Dordrecht: Reidel, pp.\n331–407.</li>\n<li>Hodges, W., 1993, “Tarski’s Theory of\nDefinition,” in <em>New Essays on Tarski and Philosophy</em>,\nedited by D. Patterson, Oxford: Oxford University Press, pp.\n94–132.</li>\n<li>Horty, J., 2007, <em>Frege on Definitions: A Case Study of\nSemantic Content</em>, New York: Oxford University Press.</li>\n<li>Horwich, P., 1998, <em>Meaning</em>, Oxford: Clarendon Press.</li>\n<li>Kremer, P., 1993, “The Gupta-Belnap systems\n\\(\\mathbf{S}^{\\#}\\) and \\(\\mathbf{S}^{*}\\) are not\naxiomatisable,” <em>Notre Dame Journal of Formal Logic</em>, 34:\n583–596.</li>\n<li>Kripke, S. A., 1980, <em>Naming and Necessity</em>, Cambridge MA:\nHarvard University Press.</li>\n<li>Lewis, D., 1970, “How to Define Theoretical Terms,”\n<em>Journal of Philosophy</em>, 67: 427–446.</li>\n<li>Linnebo, Ø., 2018, <em>Thin Objects: An Abstractionist\nAccount</em>, New York: Oxford University Press.</li>\n<li>Locke, J., 1689, <em>An Essay concerning Human Understanding</em>,\nedited by P. H. Nidditch, Oxford: Oxford University Press (1975).</li>\n<li>Mackereth, S., and Avigad, J., forthcoming, “Two-sorted\nFrege Arithmetic is not Conservative,” <em>Review of Symbolic\nLogic</em>, first online 18 April 2022. doi:10.1017/S1755020322000156</li>\n<li>Martinez, M., 2001, “Some Closure Properties of Finite\nDefinitions,” <em>Studia Logica</em>, 68: 43–68.</li>\n<li>Moschovakis, Y., 1974, <em>Elementary Induction on Abstract\nStructures</em>, Amsterdam: North-Holland.</li>\n<li>Padoa, A., 1900, “Logical Introduction to Any Deductive\nTheory,” in <em>From Frege to Gödel: A Source Book in\nMathematical Logic, 1879–1931</em>, edited by J. van Heijenoort,\nCambridge MA: Harvard University Press (1967), pp. 118–123.</li>\n<li>Quine, W. V. O., 1951, “Two Dogmas of Empiricism,”\nreprinted in his <em>From a Logical Point of View</em>, Cambridge MA:\nHarvard University Press (1953), pp. 20–46.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge\nMA: MIT Press.</li>\n<li>Ramsey, F. P., 1931, “Theories,” reprinted in\n<em>Foundations: Essays in Philosophy, Logic, Mathematics and\nEconomics</em>, edited by D. H. Mellor, Atlantic Highlands, NJ:\nHumanities Press, 1978, pp. 101–125.</li>\n<li>Robinson, R., 1950, <em>Definition</em>, Oxford: Clarendon\nPress.</li>\n<li>Rosen, G., 2015, “Real Definition,” <em>Analytic\nPhilosophy</em>, 56: 189–209.</li>\n<li>Russell, B., 1908, “Mathematical Logic as Based on the\nTheory of Types,” reprinted in his <em>Logic and Knowledge:\nEssays 1901–1950</em>, London: George Allen &amp; Unwin, 1956,\npp. 59–102.</li>\n<li>–––, 1948, <em>Human Knowledge: Its Scope and\nLimits</em>, New York: Simon and Schuster.</li>\n<li>Shapiro, L., 2006, “The Rationale Behind Revision-Rule\nSemantics,” <em>Philosophical Studies</em>, 129:\n477–515.</li>\n<li>Suppes, P., 1957, <em>Introduction to Logic</em>, New York: Van\nNostrand Reinhold.</li>\n<li>Tarski, A., 1983, <em>Logic, Semantics, Metamathematics: Papers\nfrom 1923 to 1938</em>, second edition, edited by J. Corcoran,\nIndianapolis: Hackett Publishing Company.</li>\n<li>Urbaniak, R., and Hämäri, K. S., 2012, “Busting a\nMyth about Leśniewski and Definitions,” <em>History and\nPhilosophy of Logic</em>, 33: 159–189.</li>\n<li>Villanueva, E., (ed.), 1997, <em>Truth</em> (<em>Philosophical\nIssues</em> 8), Atascadero: Ridgeview Publishing Company.</li>\n<li>Weir, A., 2003, “Neo-Fregeanism: An Embarrassment of\nRiches,” <em>Notre Dame Journal of Formal Logic</em>, 44(1):\n13–48.</li>\n<li>Whitehead, A. N., and Russell, B., 1925, <em>Principia\nMathematica</em>, vol. 1, second edition, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Whiteley, C. H., 1956, “Meaning and Ostensive\nDefinition,” <em>Mind</em>, 65: 332–335.</li>\n<li>Wittgenstein, L., 1953, <em>Philosophical Investigations</em>, New\nYork: Macmillan.</li>\n<li>Wright, C., 1997, “On the Philosophical Significance of\nFrege’s Theorem,” in <em>Language, Thought, and Logic:\nEssays in Honour of Michael Dummett</em>, edited by R. K. Heck,\nOxford: Oxford University Press. Reprinted in Hale and Wright 2001,\npp. 272–306.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "analytic/synthetic distinction",
            "Aristotle, General Topics: logic",
            "descriptions",
            "Frege, Gottlob: theorem and foundations for arithmetic",
            "logical constants",
            "Tarski, Alfred: truth definitions",
            "truth: revision theory of",
            "type theory"
        ],
        "entry_link": [
            {
                "../analytic-synthetic/": "analytic/synthetic distinction"
            },
            {
                "../aristotle-logic/": "Aristotle, General Topics: logic"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../frege-theorem/": "Frege, Gottlob: theorem and foundations for arithmetic"
            },
            {
                "../logical-constants/": "logical constants"
            },
            {
                "../tarski-truth/": "Tarski, Alfred: truth definitions"
            },
            {
                "../truth-revision/": "truth: revision theory of"
            },
            {
                "../type-theory/": "type theory"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=definitions\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/definitions/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=definitions&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/definitions/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=definitions": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/definitions/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=definitions&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/definitions/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.sfu.ca/~swartz/definitions.htm\" target=\"other\">Definitions, Dictionaries, and Meanings</a>,\n notes by Norman Swartz, Simon Fraser University"
        ],
        "listed_links": [
            {
                "https://www.sfu.ca/~swartz/definitions.htm": "Definitions, Dictionaries, and Meanings"
            }
        ]
    }
}