{
    "url": "descartes-method",
    "title": "Descartes’ Method",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Tarek R. Dika\n<tarek.dika@utoronto.ca>",
        "author_links": [
            {
                "https://philosophy.utoronto.ca/directory/tarek-r-dika/": "Tarek R. Dika"
            },
            {
                "mailto:tarek%2edika%40utoronto%2eca": "tarek.dika@utoronto.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"https://philosophy.utoronto.ca/directory/tarek-r-dika/\" target=\"other\">Tarek R. Dika</a>\n&lt;<a href=\"mailto:tarek%2edika%40utoronto%2eca\"><em>tarek<abbr title=\" dot \">.</abbr>dika<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jun 3, 2020"
    ],
    "preamble": "\n\nDescartes’ method is one of the most important pillars of his\nphilosophy and science. This entry introduces readers to\nDescartes’ method and its applications in optics, meteorology,\ngeometry, and metaphysics.\n",
    "toc": [
        {
            "#OrigDefiDescMeth": "1. The Origins and Definition of Descartes’ Method"
        },
        {
            "#MethRule": "2. The Method in the Rules"
        },
        {
            "#DescDefiScie": "2.1 Descartes’ Definition of “Science”"
        },
        {
            "#Intu": "2.2 Intuition"
        },
        {
            "#ObjeIntuSimpNatu": "2.2.1 The Objects of Intuition: The Simple Natures"
        },
        {
            "#Dedu": "2.3 Deduction"
        },
        {
            "#DeduEnum": "2.4 From Deduction to Enumeration"
        },
        {
            "#MethRuleExam": "3. The Method in the Rules: An Example"
        },
        {
            "#MethDiscII": "4. The Method in Discourse II"
        },
        {
            "#ExpeSuppDiscVIPrinIIII": "5. Experiment and Supposition in Discourse VI and Principles III–IV"
        },
        {
            "#MethOptiDeduLawRefr": "6. The Method in Optics: Deducing the Law of Refraction"
        },
        {
            "#MethMeteDeduCausRain": "7. The Method in Meteorology: Deducing the Cause of the Rainbow"
        },
        {
            "#MethMath": "8. The Method in Mathematics"
        },
        {
            "#MethMeta": "9. The Method in Metaphysics"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Origins and Definition of Descartes’ Method\n\nThe origins of Descartes’ method are coeval with his initiation\ninto a radical form of natural philosophy based on the combination of\nmechanics, physics, and mathematics, a combination Aristotle\nproscribed and that remained more or less absent in the history of\nscience before the seventeenth century (on the relation between\nmechanics, physics, and mathematics in medieval science, see Duhem\n1905–1906, 1906–1913, 1913–1959; Maier\n1949–1958; Clagett 1959; Crombie 1961; Sylla 1991; Laird and\nRoux 2008). Descartes first learned how to combine these arts and\nsciences from the Dutch scientist and polymath Isaac Beeckman\n(1588–1637), whom he met in 1619 while stationed in Breda as a\nsoldier in the army of Prince Maurice of Nassau (see Rodis-Lewis 1998:\n24–49 and Clarke 2006: 37–67). Beeckman described his form\nof natural philosophy as “physico-mathematics” (see AT 10:\n67–77 and Schuster 2013), and the two men discussed and\ncorresponded about problems in mathematics and natural philosophy,\nincluding problems in the theory of music, hydrostatics, and the\ndynamics of falling bodies (see AT 10: 46–47, 51–63,\n67–74, 75–78, 89–141, 331–348; Shea 1991:\n1–121; Damerow et al. 1992; Schuster 2013: 99–167).\n\nWhile it is difficult to determine when Descartes composed his\nprincipal methodological treatise, Rules for the Direction of the\nMind (Regulae ad directionem ingenii), it is widely believed that\nhe composed the Rules in the 1620s (see Weber 1964:\n194–207; Gaukroger 1995: 104–187; Schuster 2013:\n307–349). More recent evidence suggests that Descartes may have\ncontinued working on the Rules after 1628 (see Descartes ES). Rules contains the most detailed description of\nDescartes’ method anywhere in his corpus. However, he never\ncompleted it, and he never explicitly refers to it anywhere in his\npublished writings or correspondence. \n\nDescartes defines “method” in Rule 4 as a set of \n\n\nreliable rules which are easy to apply, and such that if one follows\nthem exactly, one will never take what is false to be true or\nfruitlessly expend one’s mental efforts, but will gradually and\nconstantly increase one’s knowledge till one arrives at a true\nunderstanding of everything within one’s capacity. (AT 10:\n371–372, CSM 1: 16) \n\n\nHe divides the Rules into three principal parts: Rules\n1–12 deal with the definition of science, the principal\noperations of the method (intuition, deduction, and enumeration), and what Descartes terms “simple propositions”, which “occur to us spontaneously” and which are objects of certain and evident cognition or intuition (e.g., “a triangle is bounded by just three lines”) (see AT 10: 428, CSM 1: 50; AT 10: 368, CSM 1: 14).\nRules 13–24 deal with what Descartes terms “perfectly\nunderstood problems”, or problems in which all of the conditions\nrelevant to the solution of the problem are known, and which arise principally in\narithmetic and geometry (see AT 10: 429–430, CSM 1: 51); Rules\n25–36 deal with “imperfectly understood problems”,\nor problems in which one or more conditions relevant to the solution of the problem are not\nknown, but must be found. These problems arise for the most part in\nnatural philosophy and metaphysics. The Rules end prematurely\nat Rule 21 (see AT 10: 428–430, CSM 1: 50–51).\n2. The Method in the Rules\n2.1 Descartes’ Definition of “Science”\n\nFor Descartes, the sciences are deeply interdependent and\ninterconnected, and they must be learned by means of one method (AT\n10: 360–361, CSM 1: 9–10). He defines\n“science” (scientia) in Rule 2 as “certain\nand evident cognition” (omnis scientia est cognitio certa et\nevidens, AT 10: 362, CSM 1: 10). Many scholastic Aristotelians\ndefine science in the same way. However, Aristotelians do not believe\nthat every science satisfies this definition equally; some sciences\n(like mathematics) may be more exact and, therefore, more certain than\nothers (like natural philosophy). Aristotelians consistently make room\nfor what Descartes terms “probable cognition”, especially\nin natural philosophy (Rule 2, AT 10: 362, CSM 1: 10). In Rule 2,\nDescartes boldly declares that “we reject all […] merely\nprobable cognition and resolve to believe only what is perfectly known\nand incapable of being doubted” (ibid.).\n2.2 Intuition\n\nIn Rule 3, Descartes introduces the first two operations of the\nmethod: intuition and deduction. He defines “intuition” as\nfollows:\n\n\nBy “intuition” I do not mean the fluctuating testimony of\nthe senses or the deceptive judgment of the imagination as it botches\nthings together, but the conception of a clear and attentive mind,\nwhich is so easy and distinct that there can be no room for doubt\nabout what we are understanding. […] Thus, everyone can\nmentally intuit that he exists, that he is thinking, that a triangle\nis bounded by just three lines, and a sphere by a single surface, and\nthe like. (AT 10: 368, CSM 1: 14)\n\n\nAs Descartes’ examples indicate, both contingent propositions\n(e.g., that I exist; that I am thinking) and necessary propositions\n(e.g., that a triangle is bounded by just three lines; that a sphere\nis bounded by a single surface) can be intuited (cf. Alanen and\nYrjönsuuri 1997 and Alanen 1999). Intuition is a type of\nintellectual seeing or perception in which the things themselves, not\ndefinitions, are directly present before the mind.\n(Descartes chooses the word “intuition” because in Latin\nintueor means “to look upon, look closely at, gaze\nat” and also “to regard, observe, consider, give attention\nto”.) The evidence of intuition is so direct that\nit cannot be doubted. Thus, intuition paradigmatically satisfies\nDescartes’ definition of science as “certain and evident\ncognition”. It is the most important operation of the\nmethod.\n2.2.1 The Objects of Intuition: The Simple Natures\n\nThe principal objects of intuition are “simple natures”.\nSimple natures are not propositions, but rather notions that are\n“so clearly and distinctly [known] that they cannot be divided\nby the mind into others which are more distinctly known” (AT 10:\n418, CSM 1: 44). The simple natures are, as it were, the atoms of\nhuman knowledge (Hamelin 1921: 86); all other notions and propositions\nare composed of simple natures. Descartes divides the simple\nnatures into three classes: intellectual (e.g., knowledge, doubt,\nignorance, volition, etc.), material (e.g., extension, shape, motion,\netc.), and common (e.g., existence, unity, duration, as well as common\nnotions “whose self-evidence is the basis for all the rational\ninferences we make”, such as “Things that are the same as\na third thing are the same as each other”, etc., AT 10: 419, CSM\n1: 45). The intellectual simple natures must be intuited by means of\nthe intellect alone. The material simple natures must be intuited by\nmeans of the intellect aided by the imagination. The common simple\nnatures may be intuited either by the intellect alone or the intellect\naided by the imagination (ibid.). The intellectual simple natures\ndefine the essence of mind (one of the objects of Descartes’\nmetaphysics) and the material simple natures define the essence of\nbody (the object of Descartes’ mathematics and natural\nphilosophy).\n\nDescartes’ theory of simple natures plays an enormously\nimportant role in his method (see Marion 1992). First, the simple natures\n“are self-evident and never contain any falsity” (AT 10:\n420, CSM 1: 45), and there is nothing in them “beyond what we\nintuit or reach in our thinking” (ibid.). Second, \n\n\nit is not possible for us ever to understand anything beyond those\nsimple natures and a certain mixture or compounding of one with\nanother. (AT 10: 422, CSM 1: 46) \n\n\nThird, \n\n\nthe whole of human knowledge consists uniquely in our achieving a\ndistinct perception of how all these simple natures contribute to the\ncomposition of other things. (AT 10: 427, CSM 1: 49) \n\n\nThe theory of simple natures effectively ensures the unrestricted\nscope of intuition (and, as I will show below, deduction) vis-à-vis any and all objects\nof science, from the simplest to the most complex.\n2.3 Deduction\n\nDescartes defines deduction as the \n\n\ninference of something as following necessarily from some other\npropositions which are known with certainty […] provided they\nare inferred from true and known principles through a continuous and\nuninterrupted movement of thought in which each individual proposition\nis clearly intuited. (AT 10: 369, CSM 1: 14–15) \n\n\nDescartes provides two useful examples of deduction in Rule 12, where\nhe writes that “when we deduce that nothing which lacks\nextension can have a shape”, \n\n\nwe intuit that the conjunction of the one with the other is wholly\nnecessary […] on the grounds that there is a necessary\nconnection between shape and extension. (AT 10: 424–425, CSM 1:\n48) \n\n\nThis “necessary conjunction” is one that I directly “see” whenever I intuit a shape in my\nimagination; any shape I imagine will necessarily be extended in\nlength, width, and breadth. Similarly, if \n\n\nSocrates […] says that he doubts everything, it necessarily\nfollows that he understands at least that he is doubting, and hence\nthat he knows that something can be true or false, etc.; for there is\na necessary connection between these facts and the nature of doubt. (AT\n10: 421, CSM 1: 46) \n\n\nIn both of these examples, intuition defines each step of the\ndeduction, as Descartes requires when he writes that “each\nindividual proposition” in a deduction must be “clearly\nintuited”. Deductions, then, are composed of a series or\nsequence of intuitions or intuited propositions: \n\n\nHence we are distinguishing mental intuition from certain deduction on\nthe grounds that we are aware of a movement or a sort of sequence in\nthe latter but not in the former. (AT 10: 370, CSM 1: 15) \n\n\nJust as Descartes rejects Aristotelian definitions as objects of\nintuition (Aristotelian definitions like “motion is the actuality of potential being, insofar as it is potential” render motion more, not less, obscure; see AT 10: 426, CSM 1: 49), so too does he reject Aristotelian syllogisms as forms of\ndeduction or inference (see Gaukroger 1989; Normore 1993; and Cassan\n2015). The validity of an Aristotelian syllogism depends exclusively on\nits form. For example, “All As are Bs; All Bs are Cs; all As\nare Cs”. Here, no matter what the content, the syllogism remains\nvalid. For Descartes, by contrast, deduction depends exclusively on\nits content. What is intuited in deduction are dependency relations between simple natures. I simply\nsee that shape depends on extension, or that doubt depends on\nknowledge of the difference between truth and falsity, etc. These\ndependencies are immediately revealed in intuition and deduction,\nwithout recourse to syllogistic forms.\n\nAnother important difference between Aristotelian and Cartesian\ndeduction is that Aristotelian deductions do not yield any new\nknowledge. In the syllogism, “All men are mortal; all Greeks are\nmen; all Greeks are mortal”, the conclusion is already known. We\n“learn nothing new from such forms of reasoning” (AT 10:\n406, CSM 1: 36). For Descartes, the method “should […]\nextend to the discovery of truths in any field\nwhatever” (AT 10: 374, CSM 1: 17; my emphasis). Descartes’\nmethod is a method of discovery; it does not “explain to others\narguments which are already known”.\n2.4 From Deduction to Enumeration\n\nWhen deductions are simple, they are wholly reducible to intuition:\n\n\n\nFor if we have deduced one fact from another immediately, then\nprovided the inference is evident, it already comes under the heading\nof true intuition. (AT 10: 389, CSM 1: 26) \n\n\nHowever, when deductions are “complex and involved” (AT\n10: 408, CSM 1: 37) and “we infer a proposition from many\ndisconnected propositions”, then “our intellectual\ncapacity is often insufficient to enable us to encompass them all in a\nsingle intuition” (AT 10: 389, CSM 1: 26). Fortunately, the\nscope of intuition can be expanded by means of an operation Descartes\nterms “enumeration”. Since some deductions require\n“such a long chain of inferences” that it is not\n“easy to recall the entire route which led us to” the\nconclusion, “a continuous movement of thought is needed to make\ngood on any weakness of memory” (AT 10: 387, CSM 1: 25). This\ninvolves \n\n\nsimultaneously intuiting one relation and passing on to the next,\nuntil I have learnt to pass from the first to the last so swiftly that\nmemory is left with practically no role to play, and I seem to intuit\nthe whole thing at once. (AT 10: 287–388, CSM 1: 25) \n\n\nNevertheless, there is a limit to how many relations I can encompass\nin a single act of intuition. Were I to continue the series\nindefinitely, I would eventually lose track of some of the inferences\nin the deductive chain, no matter how many times I traverse the\nseries. Enumeration is a normative ideal that cannot always be\nrealized in practice.\n\nEnumeration plays many roles in Descartes’ method, and most of\nthem are not related to the reduction of the role played by memory in\nlong or complex deductions (see Beck 1952: 111–134; Weber 1964:\n48–57; Marion 1975: 103–113; Smith 2010: 67–113).\nOne can distinguish between five senses of enumeration in the\nRules. Enumeration1 is “a verification of\nthe logical steps already traversed in a deductive process”\n(Beck 1952: 143; based on Rule 7, AT 10: 387–388, 14–25,\n1–17, CSM 1: 25). Enumeration1 has already been\ndiscussed above.\n\nEnumeration2 is “a preliminary\nsurvey or setting out of the grounds of a demonstration” (Beck\n1952: 143; based on Rule 7, AT 10: 388–392, CSM 1: 25–28).\nHere, enumeration precedes both intuition and deduction.\nEnumeration2 determines (a) whatever simpler problems are\ncontained in a complex problem, and (b) the order in which each of\nthese problems must be solved, beginning with the simplest problem of\nall (for an example, see\n Section 3).\n\nEnumeration3 is “a form of deduction based on the\nenumeration of all possible alternatives or analogous instances”\n(Beck 1952: 143; based on Rule 7, AT 10: 388–389, 29–30,\n1–7, CSM 1: 26 and Rule 8, AT 10: 394–395, CSM 1: 29). For\nexample, \n\n\nif I wish to show […] that the rational soul is not corporeal\n[…] it will be sufficient if I group all bodies together into\nseveral classes so as to demonstrate that the rational soul cannot be\nassigned to any of these. (AT 10: 390, CSM 1: 26–27) \n\n\nHere, enumeration is itself a form of deduction: I construct classes\nin order to deduce a conclusion. Other examples of\nenumeration3 include Descartes’ enumeration of his\ndubitable opinions in Meditations I, which leads to his\ndiscovery in Meditations II that he cannot place the\nproposition “I am, I exist” in any of these classes (see\n Section 9).\n\nEnumeration4 is “[a]kin to the actual deduction\nitself when the implicatory sequence is grounded on a complex and\ndisjointed set of data” (Beck 1952: 143; based on Rule 7, AT 10:\n389, 17–20, CSM 1: 26) (see Beck 1952: 143).\nEnumeration4 is a deduction of a conclusion, not from a\nseries of interconnected inferences, but rather from a variety of\ndifferent inferential chains that. For example, Descartes’ demonstration that the mind\nand body are two really distinct substances in Meditations VI\ndepends on a wide variety of considerations drawn from\nMeditations I–V (see AT 7: 13, CSM 2: 9; letter to\nMersenne, 24 December 1640, AT 3: 266, CSM 3: 163. For an\ninterpretation along these lines, see Dubouclez 2013. For a contrary\ninterpretation, see Gueroult 1984).\n\nFinally, enumeration5 is an operation Descartes also calls\n“induction”, and consists in an inference from a series of\nparticular cases satisfying a definite condition to all cases\nsatisfying the same condition, as when one infers that “the area\nof a circle is greater than the area of any other geometrical figure\nwhose perimeter is the same length as the circle’s” from\nthe fact “this […] holds for some particular\nfigures” (AT 10: 390, CSM 1: 27).\n3. The Method in the Rules: An Example\n\nLet’s see how intuition, deduction, and enumeration work in\npractice. Descartes describes how the method should be applied in Rule\n5:\n\n\nWe shall be following this method exactly if we first reduce\ncomplicated and obscure propositions step by step to simpler ones, and\nthen, starting with the intuition of the simplest ones of all, try to\nascend through the same steps to a knowledge of all the rest. (AT 10:\n379, CSM 1: 20)\n\n\nA clear example of the application of the method can be found in Rule\n8, where Descartes discusses how to deduce the shape of the anaclastic\nline, i.e., the shape of the lens from which parallel rays of light\nare refracted towards a common point, as they are in eyeglasses or\ntelescopes (see\n Fig. 1).\n\n\n\nFigure 1: Anaclastic Lens.\n\n\nThe problem of the anaclastic is a complex, imperfectly understood problem. It needs to be\nreduced to a ordered series of simpler problems by means of\nenumeration2. Once the problem has been reduced to its simplest component parts, the\nsimplest problem in the series must be solved by means of intuition,\nand the more complex problems in the series must be solved by means of\ndeduction.\n\nDescartes reduces the problem of the anaclastic into a series of five\nsimpler problems (see Table 1):\n\n\n\n What is the shape of a line (lens) that focuses parallel rays of\nlight to the same point?\n What is the relation between angle of incidence and angle of\nrefraction (i.e., the law of refraction)?\n How is refraction caused by light passing from one medium to\nanother?\n How does a ray of light penetrate a transparent body?\n What is the nature of the action of light?\n What is a natural power?\n\n\nProblem (6) must be solved first by means of intuition, and the\nremaining problems must be answered in order:\n\n A natural power is…\n The nature of the action of light is…\n A ray of light penetrates a transparent body by…\n Refraction is caused by light passing from one medium to another\nwhen…\n The relation between the angle of incidence and the angle of\nrefraction is…\n The shape of the line (lens) that focuses parallel rays of light\nto the same point is…\n\n\n\nTable 1: Descartes’ proposed\ndeduction of the anaclastic line (Garber 2001: 37)\n\n\nThis example illustrates the procedures involved in Descartes’\nmethod. Intuition and deduction can only performed after\nenumeration2 has reduced the problem to an ordered series\nof simpler problems. The simplest problem is solved first by means of\nintuition, and the more complex problems are solved by means of\ndeduction. The order of the deduction is read directly off the\nenumeration by inversion. Note that identifying some of the\nproblems in the series (specifically Problems 3–4 in the second\nseries in\n Table 1)\n require experiment. One must observe how light actually passes\nthrough different types of transparent media in order to determine how\nthese media affect the angles of incidence and refraction. \n4. The Method in Discourse II\n\nIn Part II of Discourse on Method (1637), Descartes offers\nthe first and only published exposé of his method. By\ncomparison to the method described in the Rules, the method described\nin Discourse II consists of only four rules:\n\n\nThe first was never to accept anything as true if I did not have\nevident knowledge of its truth: that is, carefully to avoid\nprecipitate conclusions and preconceptions, and to include nothing\nmore in my judgments than what presented itself to my mind so clearly\nand so distinctly that I had no occasion to doubt it.\n\nThe second, to divide each of the difficulties I examined into as many\nparts as possible and as may be required in order to resolve them\nbetter.\n\nThe third, to direct my thoughts in an orderly manner, by beginning\nwith the simplest and most easily known objects in order to ascend\nlittle by little, step by step, to knowledge of the most complex, and\nby supposing some order even among objects that have no natural order\nof precedence.\n\nAnd the last, throughout to make enumerations so complete, and reviews\nso comprehensive, that I could be sure of leaving nothing out (AT 6:\n18, CSM 1: 120).\n\n\nThese four rules are best understood as a highly condensed summary of\nthe method described in the Rules (see Gilson 1987: 196–214; Beck 1952: 149; Clarke\n1982: 181; Garber 2001: 39; Newman 2019: 85). Descartes’\nabridgment of the method in Discourse II reflects a shift\nvis-à-vis the idea of a “theory” of method. As he\nfamously put it in a letter to Mersenne, the method consists more in\npractice than in theory (letter to Mersenne, 27 February 1637, AT 1:\n349, CSMK 3: 53), and to learn the method one should not only reflect\non the rules of the method, but also see how they function in\nsolutions to particular problems. No matter how detailed a theory of\nmethod may become, there is no way to prepare oneself for every\neventuality that may arise in the course of scientific inquiry, and\nthere is certainly no way to codify every rule necessary to the\nsolution of any and all problems. Every problem is different. By the\nlate 1630s, Descartes decided to reduce the number of rules and focus\non the application of the method rather than on the theory of the\nmethod. In\n Sections 6–9,\n I follow Descartes’ advice and examine how he applies the\nmethod in solutions to particular problems in optics, meteorology,\ngeometry, and metaphysics. First, though, the role played by\nexperiment in Descartes’ method needs to be discussed in more detail.\n5. Experiment and Supposition in Discourse VI and Principles III–IV\n\nWhat role does experiment play in Cartesian science? In The\nWorld and Principles II, Descartes deduces the\nprinciples of physics (the laws of nature) from the first principle of\nmetaphysics: God. The laws of nature can be deduced by reason alone\nfrom God’s immutability (see AT 11: 36–48, CSM 1:\n92–98; AT 8A: 61­67, CSM 1: 240–244). Experiment plays\nno role in Descartes’ deduction of the laws of nature. However,\nthis does not mean that experiment plays no role in Cartesian science.\nOn the contrary, in Discourse VI, Descartes clearly indicates when experiments become necessary in the course\nof scientific inquiry:\n\n\n[The] power of nature is so ample and so vast, and these principles\n[sc. the laws of nature] so simple and so general, that I notice\nhardly any particular effect which I do not know at once that it can\nbe deduced from the principles in many different ways; and my greatest\ndifficulty is usually to discover in which of these ways it depends on\nthem. I know no other means to discover this than by seeking further\nobservations whose outcomes vary according to which of these ways\nprovides the correct explanation (AT 6: 64–65, CSM 1: 144).\n\n\nThere are countless effects in nature that can be deduced from the\nlaws of nature “in many different ways”. How do we find\nthe right way? Experiment. We start with the effects we want\nto explain; we isolate and manipulate these effects in order to more\nprecisely determine the conditions under which they are produced;\nand then we make suppositions about what their underlying causes are\nbased on what we know about the nature of matter and the laws of\nnature. Traditional deductive order is reversed; underlying causes too\nsmall to be directly observed are deduced from given effects.\nDescartes describes his procedure for deducing causes from effects\ntoward the end of Discourse VI:\n\n\nFor I take my reasonings to be so closely interconnected that just as\nthe last are proved by the first, which are their causes, so the first\nare proved by the last, which are their effects. It must not be\nsupposed that I am here committing the fallacy that the logicians call\n“arguing in a circle”. For as experience makes most of\nthese effects quite certain, the causes from which I deduce them serve\nnot so much to prove them as to explain them; indeed, quite to the\ncontrary, it is the causes which are proved by the effects. And I have\ncalled them “suppositions” simply to make it known that I\nthink I can deduce them from the primary truths I have expounded\nabove. (Discourse VI, AT 6: 76, CSM 1: 150)\n\n\nThe suppositions Descartes refers to here are introduced in the course\nof experiment; they describe the shapes, sizes, and motions of the\nbodies that cause the effects observed in an experiment. Suppositions\nare needed because these particles are beyond the reach of\nobservation. Some scholars have argued that in Discourse VI\nDescartes introduces a method distinct from the method developed in\nthe Rules and even Discourse II. For these scholars, the method in the\nRules is a priori and proceeds from causes to\neffects, while the method in Discourse VI is a\nposteriori and proceeds from effects to causes (see Clarke 1982).\nThe latter method, they claim, is the so-called\n“hypothetico-deductive method” (see Larmore 1980: 6–22 and Clarke 1982:\n10). Others have argued that this interpretation of both the\nRules and Discourse VI suffers from a number of\nproblems. First, experiment is in no way excluded from the method\ndeveloped in the Rules. On the contrary, in both the Rules and the\nEssays, experiment neither interrupts nor replaces deduction;\nexperiment structures deduction because it helps one reduce problems to their simplest component parts (see Garber 2001: 85–110). A hint of this\ncan already be seen in the anaclastic example (see\n Section 3):\n the third problem in the reduction (“How is refraction caused by light passing from one medium to another?”) can only be discovered by observing that light behaves\ndifferently in a variety of transparent media.\nExperiment structures of the deduction. This is also the case\nin Descartes’ deduction of the cause of the rainbow (see\n Section 7\n below and Garber 2001: 91–104). Second, in Discourse VI,\nDescartes explicitly asserts that the suppositions introduced in the\nEssays can be deduced from first principles or “primary\ntruths”, and there is no room for such demonstrations in the\nhypothetico-deductive method, in which hypotheses are confirmed by\nexperience alone.\n6. The Method in Optics: Deducing the Law of Refraction\n\nDescartes’ discovery of the law of refraction is arguably one of\nhis most celebrated scientific achievements. We have already\nencountered the law of refraction in Descartes’ discussion of\nthe anaclastic line in Rule 8 (see\n Section 3).\n There, the law of refraction appears as the solution to the\npenultimate problem, “What is the relation (ratio) between the\nangle of incidence and the angle of refraction?” We also learned\nthat the law of refraction depends on two other problems, “What\nis a natural power?” and “What is the action of\nlight?” In Rules, Descartes proposes solving the problem of what a natural power is by means of intuition, and he recommends solving the problem of what the action of light consists in by means of deduction or by means of an analogy with other, more familiar natural powers. In Rule 9, analogizes the action of light to the motion of a stick. Similarly,\nin Optics II, Descartes deduces the law of refraction from\nanalogies (or comparisons) and suppositions about the reflection and\nrefraction of light. As in Rule 9, the first comparison analogizes the\naction of light to the transmission of motion from one end of a stick\nto another, and is meant to illustrate how light travels\ninstantaneously from one part of space to another:\n\n\nI would have you consider the light in bodies we call\n“luminous” to be nothing other than a certain movement, or\nvery rapid and lively action, which passes to our eyes through the\nmedium of the air and other transparent bodies, just as the movement\nor resistance of the bodies encountered by a blind man passes to his\nhand by means of a stick. (AT 7: 84, CSM 1: 153)\n\n\nWhen a blind person employs a stick in order to learn about their\nsurroundings, they do so via the pressure they receive in their hands\nwhen the stick encounters an object. This resistance or pressure is\ninstantaneously transmitted from the end of the stick in contact with\nthe object to the hand. Light, Descartes argues, is transmitted from\nthe luminous objects to the eye in the same way: it is an\ninstantaneous pressure exerted on the eye by the luminous object via\nthe medium (e.g., air). The length of the stick or of the distance\nbetween the sun (or any other luminous object) and our eyes does not\nmatter, so long as (1) the particles of matter between our hand and\nthe end of the stick or our eye and the sun are continuous, and (2) the\npressure coming from the end of the stick or the luminous object is\nsufficiently strong to affect our hand or eye, so that whatever\nhappens at one end is instantaneously communicated to the other end\n(AT 7: 84, CSM 1: 153).\n\nDescartes’ second comparison analogizes (1) the medium in which\nlight travels to a wine-vat (or barrel) completely filled with\nhalf-pressed grapes and wine, and (2) the action of light in this\nmedium to the tendency of the wine to move in a straight line towards\nholes located at the bottom of the vat:\n\n\nThe parts of the wine at one place tend to go down in a straight line\nthrough one hole at the very instant it is opened […]. In the\nsame way, all the parts of the subtle matter [of which light is\ncomposed] in contact with the side of the sun facing us tend in a\nstraight line towards our eyes at the very instant [our eyes] are\nopened […] (AT 7: 87–88, CSM 1: 154–155).\n\n\nThis comparison illustrates an important distinction between actual\nmotion from one part of space to another and the mere tendency to\nmotion. Just as all the parts of the wine in the vat tend to move in a\nstraight line toward the holes at the bottom of the vat, so too light\nis simply a tendency the smallest parts of matter between our eyes and\nthe sun (or any other luminous object) have to move in a straight line\ntoward our eye. The space between our eyes and any luminous object is\nso crammed that the smallest parts of matter cannot actually travel\nfrom the luminous object to our eye. Instead, their\n“action” consists in the tendency they have to move\ntowards our eyes. This tendency exerts pressure on our eye, and this pressure,\nwhen communicated to the brain via the nerves, produces the sensation\nof light in the mind.\n\nThe third comparison illustrates how light behaves when its\nrectilinear tendency to motion (its tendency to move in a straight\nline) is affected by other bodies in reflection and refraction:\n\n\nBut when [light rays] meet certain other bodies, they are liable to be\ndeflected by them, or weakened, in the same way that the movement of a\nball or stone thrown into the air is deflected by the bodies it\nencounters. For it is very easy to believe that the action or tendency\nto move (which, I have said, should be taken for light) must in this\nrespect obey the same laws as motion itself. (AT 7: 88–89,\nCSM 1: 155)\n\n\nJust as the motion of a ball can be affected by the bodies it\nencounters, so too can light be affected by the bodies it encounters.\nDepending on how these bodies are themselves physically constituted,\nthey either reflect or refract light. Soft bodies, such as a linen\nsheets, sand, or mud “completely stop the ball and check its\nmovement”, while hard bodies simply “send the ball in\nanother direction without stopping it” (AT 7: 89, CSM 1: 155).\nSince the tendency to motion obeys the same laws as motion itself,\nDescartes demonstrates the law of refraction by comparing refracted\nlight to the motion of a tennis ball before and after it punctures a\nlinen sheet \n\n\nso thin and finely woven that the ball has enough force to puncture it\nand pass right through, losing only some of its speed (say, a half) in\ndoing so. (AT 7: 97, CSM 1: 158; see\n Fig. 2)\n\n\n\n\nFigure 2: Descartes’ tennis-ball\nmodel of refraction (AT 6: 98, CSM 1: 159, D1637: 11 (view 95)). [An\n extended description and SVG diagram of figure 2\n is in the supplement.]\n\n\nNot every property of the tennis-ball model is relevant to the action\nof light, and those that are not relevant can be excluded from\nconsideration. We can leave aside \n\n\nentirely the question of the power which continues to move [the ball]\nwhen it is no longer in contact with the racquet, and without\nconsidering any effect of its weight, size, or shape […] since\nnone of these factors is involved in the action of light. (AT 7:\n93–94, CSM 1: 157) \n\n\nSecond, it is necessary to distinguish between the force “which\ncauses the ball to continue moving” on the one hand, and\n“that which determines it to move in one direction rather than\nthe other” on the other, since “this same force could have\nmade it move in any other direction” (AT 7: 94, CSM 1: 157).\nConversely, the ball could have been determined to move in the same\ndirection “even if a different force had moved it”\n(ibid.). Third, we can divide the direction of the ball into two\nprincipal components, which determine its direction: a perpendicular\ncomponent (line AC) and a parallel component (line AH) (see\n Fig. 2\n above). The ball must be imagined as moving down the perpendicular\nline at the same time as it moves across the parallel line (left to\nright), and these two components determine its actual\ndirection along the diagonal (line AB). Descartes terms these components parts of the “determination” of the ball because they specify its direction. Determinations are directed physical magnitudes. As we will see below, they specify the direction of the ball, and they can be independently affected in physical interactions.\n\nDescartes proceeds to deduce the law of refraction. The ball is struck\nby the racquet at A and moves along AB until it strikes the sheet at\nB. Where will the ball land after it strikes the sheet? Descartes\nstipulates that the sheet reduces the speed of the ball by half.\nConsequently, it will take the ball twice as long to reach the\ncircumference of the circle after impact than it did for the ball to\nreach the surface at B. We also know that the determination of the\nball in direction AB is composed of two parts, a perpendicular\ncomponent determination (AC) and a parallel component determination (AH). Descartes reasons that\n\n\n\nonly the one [component determination] which was making the ball tend in a downward\ndirection [AC] can be changed in any way through its colliding with\nthe sheet, while the one which was making the ball tend to the right\n[AH] must always remain the same as it was, because the sheet offers\nno opposition at all to the determination in this direction. (AT 7:\n97, CSM 1: 159) \n\n\nTo understand Descartes’ reasoning here, the parallel component\ndetermination AH must be regarded as simply continuing along its initial path\nbecause it does not come into contact with the surface of the sheet.\nTo where must AH be extended? Since the ball has lost half of its\ninitial speed and consequently will take twice as long to reach the\ncircumference of the circle after impact, we double the length of AH\nby extending it to F. The ball must, therefore, land somewhere on the\nline dropped from F, but since it cannot land above the surface, it\nmust land somewhere below CBE. It lands precisely where the line\ndropped from F intersects the circle at I (ibid.). Once we have I, we\nextend AB to I. Descartes observes that the degree of refraction\n“varies exactly in proportion to the varying degrees of\npenetrability of the respective bodies” (AT 7: 101, CSM 1: 161).\nHe insists, however, that the quantities that should be compared to\none another in this proportion are not the angles ABH and IBE\nthemselves (the angles of incidence and refraction, respectively),\n“for the ratio or proportion between these angles varies with\nall the different inclinations of the rays” (ibid.). In other\nwords, the angles of incidence and refraction do not vary according to\nany determinable proportion. Instead of comparing the angles to one\nanother, Descartes compares the lines AH and HF (the sines of the angles of incidence and refraction, respectively), and sees\nthat the proportion between these lines is that of 1/2, a ratio that\nall refractions between these two media, whatever the angles of\nincidence and refraction, must obey. Since the lines AH and HF are the\nsines of the angles, Descartes’ law of refraction is oftentimes\nreferred to as the “sine law”. \n\n\\[\\sin i = n \\sin r \\]\n\n\nThe sine of the angle of incidence i is equal to the sine of\nthe angle of refraction r multiplied by a constant n\ndefined by the nature of the refractive medium (in the example\ndiscussed above, the constant defined by the sheet is 1/2 , so AH =\n1/2 HF).\n\nMany commentators have raised questions about Descartes’\ndeduction of the sine law (see, e.g., Schuster 2013: 178–184).\nFor example, what physical meaning do the parallel and perpendicular\ncomponent determinations (lines AH and AC) have? Is it really the case that the\nspeed of the ball is reduced only at the surface of impact, and not\nafter (see Schuster 2013: 180–181)? In water, it would seem that the speed of the ball is reduced as it penetrates further into the medium. These and other questions\ncannot be examined in detail here. From a methodological point of\nview, Descartes insists that the law of refraction can be deduced from\nthe comparisons and suppositions he employs in Optics II (see letter to\nMersenne, 27 May 1638, AT 2: 142–143, CSM 1: 103), and as we have seen, in both Rule 8 and Discourse IV he claims that he can demonstrate these suppositions from the principles of physics.\n7. The Method in Meteorology: Deducing the Cause of the Rainbow\n\nDescartes’ deduction of the cause of the rainbow in\nMeteorology VIII has long been regarded as one of his\nclearest applications of the method (see Garber 2001: 85–110).\nDescartes himself seems to have believed so too (see AT 1: 559, CSM 1:\n85). In Meteorology VIII, Descartes explicitly points out\nthat he could not have chosen \n\n\na more appropriate subject for demonstrating how, with the method I am\nusing, we can arrive at knowledge not possessed at all by those whose\nwritings are available to us. (AT 6: 325, MOGM: 332)\n\n\nDescartes begins his inquiry into the cause of the rainbow by\nenumerating2 all of the conditions relevant to the solution of the problem, beginning with when and where rainbows appear in nature.\nRainbows appear \n\n\nnot only in the sky, but also in the air near us, whenever there are\nmany drops of water in the air illuminated by the sun, as experience\nshows us in certain fountains. (AT 6: 325, MOGM: 332) \n\n\nThis observation yields a first conclusion: \n\n\n[Thus] it was easy for me to judge that [the rainbow] came merely from\nthe way that the rays of light act against those drops, and from there\ntoward our eyes. (AT 6: 325, CSM 1: 332) \n\n\nDrawing on his earlier description of the shape of water droplets in\nMeteorology V (AT 6: 279–280, MOGM: 298–299),\nDescartes reasons that \n\n\nknowing that these drops are round, as has been proven above, and\nseeing that their being larger or smaller does not change the\nappearance of the arc, I then took it into my head to make a very\nlarge one, the better to examine it. (AT 6: 280, MOGM: 332) \n\n\nHe designs a model that will enable him to acquire more\nobservations about of the behavior of light when it acts on water.\nSince water is perfectly round, and since the size of the water does\nnot change the appearance of the arc, he fills “a perfectly\nround and transparent large flask with water” and examines the\nbehavior of light when it acts on the water in the flask. Already at\nthis early stage, delicate considerations of relevance and irrelevance\nare clearly on display, and these considerations allow Descartes to\nnarrow down and more clearly define the problem.\nOnce he filled the large flask with water, he \n\n\ndiscovered that, for example, when the sun came from the section of\nthe sky marked AFZ, and my eye was at point E, then when I put this\nball in the location BCD, its part D appeared to me completely red and\nincomparably more brilliant than the rest […]. (AT 6:\n325–326, MOGM: 332; see\n Fig. 3).\n\n\n\n\nFigure 3: Descartes’ flask model\nof sunlight acting on water droplets (MOGM: 333). [An\n extended description and SVG diagram of figure 3\n is in the supplement.]\n\n\nAs Descartes surely knew from experience, red is the last color of the\nprimary rainbow (located in the uppermost section of the bow) and the\nfirst color of the secondary rainbow (located in the lowermost section\nof the bow). As he also must have known from experience, the red in\nthe primary rainbow is much brighter than the red in the secondary\nrainbow. Consequently, Descartes’ observation that D appeared\ncompletely red and more brilliant than all other parts of the flask\nmust have immediately struck him as significant and promising. He\ntherefore proceeded to explore the relation between the rays of the\nsun, the position of his eyes, and the brightness of the red at D by\nvarying the conditions, observing what changes and what remains the\nsame in order to more precisely determine the relevant factors.\nThe brightness of the red at D is not affected by placing the flask to\nthe right or to the left of the observer, nor by the observer turning\nround the flask, so long as the angle DEM remains the same. When\nDescartes measures it, the angle DEM is 42º. Therefore, it is the\n42º angle the eye makes with D and M at DEM alone that plays a\nrole in the appearance of the brighter red at D. Having identified the\nmeasure of angle DEM, Descartes then varies the angle in order to\ndetermine what other changes, if any, occur. This enables him to\ncorrelate the decrease in the angle to the appearance of other colors\nin the flask: \n\n\nAnd if I made the angle slightly smaller, the color did not appear all\nat once, but rather it first divided into two less brilliant parts, in\nwhich one saw yellow, blue, and other colors \n\n\nof the primary rainbow (AT 6: 326–327, MOGM: 333).\n\nDescartes then turns his attention toward point K in the flask, and\nobserves that \n\n\nif I made the angle KEM around 52º, this part K would appear red\ntoo, but not as brilliant as at D; and that if I made it slightly\nlarger, other weaker colors would appear. But I found that if I made\nit ever so slightly smaller, or very much larger, no colors would\nappear. (ibid.) \n\n\nOnce more, Descartes identifies the angle at which the less brilliant\nred appears, this time at K, closer to the top of the flask, and\nobserves that, by slightly enlarging the angle, other, weaker colors\nappear, as they do in the secondary rainbow. He concludes, based on\nthese observations, that if the air were filled with drops of water,\nthese drops would produce the same colors, relative to the same\nangles, effectively producing all the colors of the primary and\nsecondary rainbows.\n\nSo far, considerable progress has been made. The angles at which the\ncolors of the primary and secondary rainbows appear have been\ndetermined. We have acquired more precise information about when and\nwhere rainbows appear. However, we do not yet have an explanation. The\nunderlying cause of the rainbow remains unknown. Thus, Descartes\ndecides to examine “in more detail what caused the part D of the\nball BCD to appear red”, and finds that \n\n\nit was the rays of the sun which, coming from A toward B, were curved\n[refracted] as the entered the water at point B, and went toward C,\nwhence they were reflected toward D; and there, being curved\n[refracted] again as they left the water, they tended toward E. \n\n\nHow did Descartes arrive at this particular finding? By\nintervening directly in the model in order to exclude factors\nirrelevant to the production of the effect (the bright red at D) and\ncleanly isolate the cause that alone produces it. Whenever he\n“put an opaque or dark body in some place on the lines AB, BC,\nCD, or DE, this red color would disappear”, but whenever he\n“covered the whole ball except for the points B and D, and put\ndark bodies everywhere else”, then the red color would appear at\nD. Similarly, in the case of K, he discovered that the ray that\nproduces the red color there comes from F toward G, where it is\nrefracted toward H, and thence reflected toward I, and at I once more\nreflected, this time toward K, where it is refracted toward E. He\nconcludes: \n\n\nTherefore the primary rainbow is caused by the rays which reach the\neye after two refractions and one reflection, and the secondary by\nother rays which reach it only after two refractions and two\nreflections; which is what prevents the second from appearing as\nclearly as the first. (AT 6: 328–329, MOGM: 334) \n\n\n(As we will see below, another experiment Descartes conducts reveals\nthat this conclusion is false, and that only one refraction is needed\nto produce the colors of the rainbow. It is interesting that Descartes\nwould choose to include a result he will later overturn.)\n\nDescartes next examines what he describes as the “principal\ndifficulty”. Suppose a ray strikes the flask somewhere between K\nand B, undergoes two refractions and one or two reflections, and upon\nleaving the flask tends toward the eye at E. Why this ray produces no\ncolor, and “only those of which I have spoken […] cause\ncertain colors to appear”, is not clear (AT 6: 329, MOGM: 334).\nThe difficulty here is twofold. First, why is it that only the rays\nDescartes has identified produce colors? Second, why do these rays\nproduce “certain colors”, i.e.., these colors in this\nparticular order (see Buchwald 2008: 10)? To resolve this difficulty,\nDescartes \n\n\nlooked to see if there were some other subject where they [the\ncolors] appeared in the same way, so that by comparing them with each\nother I could better judge their cause. (AT 6: 329, MOGM: 335) \n\n\nThe principal function of the comparison is to determine whether the factors\nthat produce the colors of the rainbow in water can be found in other\nmedia. Descartes decides to examine the production of these colors in\na prism (see\n Fig. 4).\n Prisms are differently shaped than water, produce the colors of the\nrainbow without any reflections, and with only one refraction. These\nconditions are rather different than the conditions in which the\ncolors of the rainbow are produced in a flask. Clearly, then, the true\ncause of the rainbow has not yet been fully determined.\n\n\n\nFigure 4: Descartes’ prism model\n(AT 6: 330, MOGM: 335, D1637: 255). [An\n extended description and SVG diagram of figure 4\n is in the supplement.]\n\n\nIn the prism model, the rays emanating from the sun at ABC “cross MN at\nright angles, or nearly so, so that they do not undergo any noticeable\nrefraction there”, but “suffer a fairly great refraction\nin coming out through NP” (AT 6: 329–330, MOGM: 335).\nFurthermore, it is only when the two sides of the bottom of the prism\nNP are covered by a dark body of some sort, so that the rays could\nonly exit through the narrow opening at DE, that the rays paint all\nthe colors of the rainbow on the cloth or white paper FGH, always\nproducing red at F, and blue or violet at H (ibid.). By comparing\ndifferences between the flask and the prism, Descartes learns\n“that the surfaces of the drops of water need not be curved in\norder to produce these colors, for those of this crystal are\ncompletely flat”. He also learns that “the angle under\nwhich they appear need not be any particular size, for it can be\nchanged here without their changing” (ibid.). Here, Descartes is\nreferring to the angle of refraction (e.g., HEP), which can vary\nbetween the flask and the prism and yet produce the same effect, and\nwhich can also be the same for rays ABC in the prism at DE and yet\nproduce different colors at FGH. He further learns that \n\n\nneither is reflection necessary, for there is none of it here; nor\nfinally do we need a plurality of refractions, for there is only one\nof them here. (ibid.) \n\n\nHe also “had no doubt that light was necessary, for without it\nwe would see nothing” (AT 6: 331, MOGM: 335). Finally, he \n\n\nobserved […] that shadow, or the limitation of this light, was\nnecessary; for if we remove the dark body on NP, the colors FGH cease\nto appear, and if we make the opening DE large enough, the red,\norange, and yellow at F extend no further because of that than do the\ngreen, blue, and violet at H—instead, all the extra space\nbetween the two at G remains white. (AT 6: 331, MOGM: 336) \n\n\nWhen the dark body covering two parts of the base of the prism is\ncompletely removed, no colors appear at all at FGH, and if it is\nopened too widely, all of the colors retreat to F and H, and no colors\nappear in between (see Buchwald 2008: 14).\n\nDescartes has so far compared the production of the rainbow in two\ndistinct models: the flask and the prism. In both cases, he enumerates\nvariations and invariances in the production of one and the same\neffect, excludes irrelevant causes, and pinpoints only those that are\nnecessary. Interestingly, the second experiment in particular also\nraises new problems, problems Descartes could not have been\nfamiliar with prior to the experiment, but which do enable him to more\nconcretely define the series of problems he needs to solve in order to\ndetermine the cause of the rainbow (see Garber 2001: 101–104 and\nBuchwald 2008). For example, the colors produced at F and H (see\n Fig. 6\n below) are different, “even though the refraction, shadow, and\nlight concur there in the same way” (AT 6: 331, MOGM: 336). What\ncauses these colors to differ?\n\nTo solve this problem, Descartes draws\non his previous research in Optics and reflects on the nature\nof the particles whose motions at the micro-mechanical level, beyond\nwhat can be observed by the senses, produce visible light. Descartes’ method\nrequires that every phenomenon in nature be reducible to the material\nsimple natures of extension, shape, and motion (see\n Section 2.2.1\n above). What remains to be determined in this case is “what\nsort of mixture of simple natures is necessary for producing all the\neffects” of the rainbow (AT 10: 427, CSM 1: 49), i.e., how the\nextension, shape, and motion of the particles of light produce the\nprecise order of the colors of the rainbow. The transition from the\nprism to the micro-mechanical level is naturally prompted by the fact\nthat neither the flask nor the prism can be of any assistance in\nfinding the cause of the order of the colors of the rainbow. The prism\nonly provides conditions in which “the refraction, shadow, and\nlight concur in the same way” and yet produce different colors\nin different places on FGH. The cause of the color order cannot be\ndisclosed by the mere examination of the models.\n\nIn Optics, Descartes described the nature of light as \n\n\nthe action or movement of a certain very fine material whose particles\nmust be pictured as small balls rolling in the pores of earthly bodies\n(AT 6: 331, MOGM: 336) \n\n\nThe manner in which these balls tend to rotate depends on the causes\nthat determine them to do so. When they are refracted by a common\nsurface, “all the refractions which occur on the same side [of\nthe balls] cause them to turn in the same direction” (ibid.),\nbut they do not necessarily have the same tendency to rotational\nspeed. Particles of light can acquire different tendencies to\nrotational speed after refraction, depending on the bodies that\nsurround them, \n\n\nso that those which have a much stronger tendency to rotate cause the\ncolor red, and those which have only a slightly stronger tendency\ncause yellow, \n\n\nwhile \n\n\nthe nature of those that are visible at H consists only in the fact\nthat these small particles do not rotate as quickly as they usually do\n[…] so that green appears when they turn just a little more\nslowly, and blue where they turn very much more slowly. (ibid.) \n\n\nThe balls that compose the ray EH have a weaker tendency to rotate,\nwhile those that compose the ray DF have a stronger one. Differences\nin color are therefore produced by differential tendencies to\nrotational speed after refraction. This is a characteristic example of\nhow mechanical explanation in Cartesian natural philosophy operates.\nThe description of the behavior of particles at the micro-mechanical\nlevel explain the observable effects of the relevant phenomenon.\n\nThe rays coming toward the eye at E are clustered at definite angles\nin the flask, and these angles determine which rays reach our eyes and\nwhich rays do not (see\n Fig. 5).\n\n\n\nFigure 5 (AT 6: 328, D1637: 251). [An\n extended description and SVG diagram of figure 5\n is in the supplement.]\n\n\nAt DEM, which has an angle of 42º, the red of the primary rainbow\nappears, and below it, at slightly smaller angles, appear the\nremaining colors of the primary rainbow (orange, yellow, green, blue,\nviolet). At KEM, which has an angle of about 52º, the fainter red\nof the secondary rainbow appears, and above it, at slightly larger\nangles, appear the remaining colors of the secondary rainbow (orange,\nyellow, green, blue, violet). The neighborhood of the two principal\nangles DEM and KEM alone receive a sufficient number of rays to\nproduce all the colors of the primary and secondary rainbows. Beyond\nthem, there lies only “shadow”, i.e., light rays that, due\nto their small number, produce no color. The conditions under which\ncolors are produced in the prism do indeed faithfully reproduce those\nin which the colors of the rainbow are naturally produced, and\ntogether the flask, the prism, and Descartes’ physics of light\ndeduce all of the effects of the rainbow.\n\nThe structure of the deduction is exhibited in\n Figure 6.\n\n\n\nFigure 6: Descartes’ deduction of\nthe rainbow (Garber 2001: 100). [An\n extended description of figure 6\n is in the supplement.]\n\n8. The Method in Mathematics\n\nIn a letter to Mersenne written toward the end of December 1637,\nDescartes intimates that \n\n\n[in] the Optics and the Meteorology I merely tried\nto show that my method is better than the usual one; in my\nGeometry, however, I claim to have demonstrated this. (AT 1:\n478, CSMK 3: 77–78) \n\n\nGeometrical problems are perfectly understood problems; all the\nconditions needed to solve the problem are provided in the statement\nof the problem (see\n Section 1). To solve any problem in geometry, one must find a\nline(s) that bears a definite relation to given lines. \n\n\nAll the problems of geometry can easily be reduced to such terms that\nthereafter we need to know only the length of certain straight lines\nin order to construct them. (AT 6: 369, MOGM: 177) \n\n\nThese lines can only be found by means of the addition, subtraction,\nmultiplication, division, and root extraction of given lines. While it\nis clear how these operations can be performed on numbers, it is less\nclear how they can be performed on lines. What, for example, does it\nmean to multiply one line by another?\n\nA very elementary example of how multiplication may be performed on\nlines can be seen in the problem of squaring a line. Let line a\nbe the given line, and let it be required to multiply a by itself\n\\((x=a^2).\\) To find the value of x, I simply construct the\nsquare \\(a^2\\) below (see\n Fig. 7):\n\n\n\n\n\n\\(a\\)\n\n\n\n\n\\(a^2\\)\n\n\n\n\n\\(a^3\\)\n\n\n\nFigure 7: Line, square, and cube. The\nproblem of dimensionality.\n\n\nThis example clearly illustrates how multiplication may be performed\non lines, but its simplicity conceals a problem. Descartes’\npredecessors regarded geometrical constructions of arithmetical\noperations in an extremely limited way: due to the fact that in\ngeometry there are only three spatial dimensions, multiplication\nbeyond the cube proved difficult. A number can be represented by a\nline, the square of a number by a surface (a square), and the cube of\na number by a solid (a cube), but beyond the solid, there are no more\ndimensions in which to represent the multiplication of \\(n > 3\\)\nlines (see Mancosu 2008: 112) (see\n Fig. 7).\n The “problem of dimensionality”, as it has since come to\nbe known, constituted a serious obstacle to the use of algebra in\ngeometry (ibid.). Suppose the problem is to raise a line to the fourth\npower \\((x=a^4).\\) For Descartes’ predecessors, this made\nabsolutely no geometrical sense.\n\nDescartes solved the problem of dimensionality by showing how\narithmetical operations performed on lines never transcend the line.\nFor example, if line AB is the unit (see\n Fig. 8),\n and I want to multiply line BD by BC, “I have only to join the\npoints A and C, then to draw DE parallel CA, and BE is the product of\nthis multiplication” (AT 6: 370, MOGM: 177–178).\nDescartes’ procedure is modeled on similar triangles (two or\nmore triangles whose sides may have different lengths but whose angles are equal). The sides of all similar\ntriangles are proportional to one another (e.g., triangle ACB is\nsimilar to triangle DEB, such that BC is proportional to BE and BA is\nproportional to BD, etc.) (see Euclid’s\n Elements VI.4–5\n [1908: [2] 200–204]). By exploiting the theory of proportions,\nDescartes could easily show that BA:BD=BC:BE, or \\(1:a=b:c\\) (e.g.,\n\\(1:2=2:4,\\) so that \\(2•2=4,\\) etc.), in which case\n\\(a•b=c\\) or \\(\\textrm{BD}•\\textrm{BC}=\\textrm{BE}.\\) The\nmultiplication of two or more lines never produces a square or a\nsolid, but only another line segment that bears a definite\n(proportional) relation to the other line segments. All magnitudes can\neasily be compared to one another as lines related to one another by\nsome measure or proportion, effectively opening the door to the\nunrestricted use of algebra in geometry.\n\n\n\nFigure 8 (AT 6: 370, MOGM: 178, D1637:\n298). [An\n extended description and SVG diagram of figure 8\n is in the supplement.]\n\n\nHaving explained how multiplication and other arithmetical operations\ncan be employed in geometry (AT 6: 369–370, MOGM:\n177–178), Descartes proceeds to describe how the method should\nbe applied to problems in geometry:\n\n\nThus, if we wish to solve some problem, we should first of all\nconsider it solved, and give names to all the lines—the unknown\nones as well as the others—which seem necessary in order to\nconstruct it. Then, without considering any difference between the\nknown and the unknown lines, we should go through the problem in the\norder which most naturally shows the mutual dependency between these\nlines, until we have found a means of expressing a single quantity in\ntwo ways. This will be called an equation, for the terms of one of the\ntwo ways [of expressing the quantity] are equal to those of the other.\n(AT 6: 372, MOGM: 179)\n\n\nThis is the method of analysis, which will also find some application\nin metaphysics (see\n Section 9).\n To apply the method to problems in geometry, one must first\n“consider [the problem] solved”, using letters to name\nboth known and unknown lines. One must then produce as many equations\nas there are unknown lines, and each equation must express the unknown\nline in terms of the known lines. (Equations define unknown magnitudes\nin terms of known magnitudes. For example, the equation \\(x^2=ax+b^2\\)\ndefines the unknown magnitude “x” in relation to\nthe known magnitudes “a” and\n“b”, thereby expressing one quantity in two ways.)\nFinally, one must employ these equations in order to geometrically\nconstruct the required line(s).\n\nDescartes provides an easy example in Geometry I. The line\nsegments a and b are given, and I must construct a line\nx such that \\(x^2 = ax+b^2.\\) The construction proceeds as\nfollows (see\n Fig. 9).\n\n\n\n\n\nFigure 9 (AT 6: 375, MOGM: 181, D1637:\n302). [An\n extended description and SVG diagram of figure 9\n is in the supplement.]\n\n\nFirst, I draw a right-angled triangle NLM, such that \\(\\textrm{LN} =\n1/2 a\\), \\(\\textrm{LM} = b\\) and the angle \\(\\textrm{NLM} =\n90º.\\)\n\nSecond, I draw a circle with center N and radius \\(1/2a\\).\n\nThird, I prolong NM so that it intersects the circle in O.\n\nMO = x, the required line segment.\n\nProof: By Elements III.36,\n\\(\\textrm{MO}•\\textrm{MP}=\\textrm{LM}^2.\\) Therefore,\n\\(x(x-a)=b^2\\) or \\(x^2=ax+b^2\\) (see Bos 2001: 305).\n\nThis procedure is relatively elementary (readers not familiar with the\nrelevant Euclidean constructions are encouraged to consult\nEuclid’s\n Elements III.36\n [1908: [2] 73–75]). The method employed is clear. The problem\nis algebraically expressed by means of letters for known and unknown\nmagnitudes, and an equation is produced in which the unknown magnitude\nis expressed exclusively in terms of known magnitudes. The unknown\nmagnitude is then constructed by the addition of a line that satisfies\nthe equation. The construction is such that the solution to the\nproblem can be intuited or directly seen in spatial\nintuition by the intellect aided by the imagination (or on paper,\nwhich embodies the operations of the intellect on line segments in the\nimagination). Geometrical construction is, therefore, the foundation\nof intuition in Cartesian geometry, and it constitutes the final step\nin the solution to any problem.\n\nDescartes employed his method in order to solve problems that had\nnever been solved in the history of mathematics. One such problem is\nthe “Pappus problem”, a locus problem, or problem in which\none must find the locus (location) of all points satisfying a definite\ncondition (equation), stated by the fourth-century Greek mathematician\nPappus of Alexandria (c. 300–350): \n\n\n[If] we have three, or four, or a greater number of straight lines\ngiven in position, we must first of all have a point from which we can\ndraw as many other straight lines, one on each of the given lines,\nwhich form given angles with them. (AT 6: 379, MOGM: 184) \n\n\nsuch that a definite ratio between these lines obtains. In the case of\nlocus problems involving more than six lines (in which three lines on\none side of the equation must be shown to have a proportional relation\nto four lines on the other side), Pappus believed that the problem of\ndimensionality prohibited solutions to these problems, “since\nthere is no figure of more than three dimensions”, so that\n“a figure contained by these lines is not understandable in any\nway” (ibid.). For Descartes, by contrast, geometrical sense can\nbe made of the multiplication of any number of lines. Descartes\nprovides a completely general solution to the Pappus problem: no\nmatter how many lines, he demonstrates how it is possible to find an\nequation and produce a construction satisfying the required conditions\n(see Bos 2001: 313–334). More broadly, he provides a complete\nenumeration of the types of problem one encounters in geometry\n(defined by degree of complexity); enumerates the geometrical\nconstructions required to solve problems in each class; and defines\nthe class of geometrically acceptable constructions by whether or not\nthey can be algebraically expressed.\n9. The Method in Metaphysics\n\nDescartes employs the method of analysis in Meditations\n(Second Replies, AT 7: 155–156, CSM 2: 110–111). In\nmetaphysics, the method of analysis “shows how the thing in\nquestion was discovered” (ibid.). Descartes opposes analysis to\nsynthesis, in which first principles are not discovered, but rather\ngiven in the form of definitions, postulates, axioms, theorems, and\nproblems (ibid.), as in a Euclidean demonstrations. Synthesis\n“cannot so conveniently be applied to […] metaphysical\nsubjects”, Descartes writes. Why? \n\n\nThe difference is that the primary notions which are presupposed for\nthe demonstration of geometrical truths are readily accepted by\nanyone, since they accord with the use of our senses. […] In\nmetaphysics by contrast there is nothing which causes so much effort\nas making our perception of the primary notions clear and distinct.\n(AT 7: 156–157, CSM 1: 111) \n\n\nIn metaphysics, the first principles are not provided in advance,\nbecause the mind must be habituated or learn how to perceive them\nclearly and distinctly, and habituation requires preparation (the\nrejection of preconceived opinions and the perfected employment of the\ncognitive faculties). Furthermore, the principles of metaphysics must\nbe indubitable, and since their indubitability cannot be assumed, it\nmust be shown. \n\nDescartes’ analytical procedure in Meditations I\nconsists in enumerating3 his opinions and subjecting them\nto doubt, so that any proposition that survives these doubts can be\nsecurely accepted as true. Descartes also describes this as the\n“method of universal doubt” (AT 7: 203, CSM 2: 207). \n\n\n[For] the purpose of rejecting all my opinions, it will be enough if I\nfind in each of them at least some reason for doubt. And to do this I\nwill not need to run through them all individually, which would be an\nendless task. […] I will go straight for the principles. (AT 7:\n18, CSM 2: 17) \n\n\nInstead of running through all of his opinions individually, he\ndecides to place them in definite classes and examine one or two\nmembers of each particular class, in order to see whether he has any\nreason to doubt them. He defines the class of his opinions as those\n“I have acquired either from the senses or through the\nsenses” (AT 7: 18, CSM 1: 12) and proceeds to further divide the\nclass into (a) opinions about things “which are very small or in\nthe distance”, about which he frequently errs; (b) opinions\nabout his body and things that are in his immediate environment, which\nmay be little more than a dream; (c) opinions about things, which even\nif they are imaginary, are at least fashioned out of things that are\nreal, a \n\n\nclass [which] appears to include corporeal nature in general, and its\nextension; the shape of extended things; the quantity, or size and\nnumber of these things; the place in which they may exist; the time\nthrough which they may endure, and so on. \n\n\nHe then doubts the existence of even these things, since there may be\na God who \n\n\nbrought it about that there is no earth, no sky, no extended thing, no\nshape, no size, no place, while at the same time ensuring that all\nthese things appear to me to exist just as they do now. (AT 7:\n18–21, CSM 2: 12–14) \n\n\nDescartes completes the enumeration of his opinions in\nMeditations I by concluding that \n\n\nI have no answer to these arguments, but am finally compelled to admit\nthat there is not one of my former beliefs about which a doubt may not\nproperly be raised. […] So in future I must withhold my assent\nfrom these former beliefs just as carefully as I would from obvious\nfalsehoods, if I want to discover any certainty. (AT 7: 21–22,\nCSM 2: 14–15) \n\n\nThe doubts entertained in Meditations I are entirely structured by\nenumeration3 (see Descartes’ remarks on enumeration\nin Rule 7, AT 10: 391, CSM 1: 27 and\n Section 2.4\n above).\n\nThe famous intuition of the proposition, “I am, I exist”\nin Meditations II is discovered by means of\nenumeration3: the proposition “I am, I exist”,\ncannot be placed into any of the classes of dubitable opinions\nenumerated in Meditations I because not even the most\nmalicious demon “can bring it about that I am nothing so long as\nI think that I am something” (AT 7: 25, CSM 2: 17). Here,\nintuition comes after enumeration3 has prepared the\nway.\n\nThese examples show that enumeration both orders and enables Descartes\nto solve a variety of problems in Meditations (see\n Section 2.4\n above and Dubouclez 2013: 307–331). Intuition and deduction are\nmobilized only after enumeration has prepared the way. Descartes\neffectively deals with a series of imperfectly understood problems in\nMeditations, and he solves these problems by means of three\noperations: enumeration (principally enumeration2–4),\nintuition, and deduction.\n\nNot everyone agrees that the method employed in Meditations\nis the method described in the Discourse and the\nRules. Some scholars have very plausibly argued that the\n“method of doubt” in Meditations constitutes a\ndistinct method. In Meditations, Descartes actively resolves\n“to doubt all previous beliefs by searching for grounds of\ndoubt” (Curley 1978: 43–44; cf. Broughton 2002: 2–7). Descartes does\nnot resolve to doubt all of his former opinions in the Rules.\nFurthermore, in the case of the anaclastic, the method of the\nRules requires reducing complex problems to a series of\nsimpler problems; solving the simplest problem by means of intuition;\nand solving the more complex problems by means of deduction (see\n Section 3).\n It is difficult to discern any such procedure in Meditations\n(Garber 1992: 49–50 and 2001: 44–47; Newman 2019). Other\nscholars have argued that Descartes’ method in the\nRules does play an important role in Meditations.\nDescartes’ metaphysical principles are discovered by combining\nsimple natures, such as the combination of thought and existence in\nthe performance of the cogito in Discourse IV and\nMeditations II (see Marion 1992 and the examples of intuition discussed in\n Section 2.2\n above). A recent line of interpretation maintains more broadly that\nDescartes’ method can be applied in different ways. Different\ntypes of problems must be solved differently (Dika and Kambouchner\nforthcoming). The method of doubt is not a distinct method, but rather\nan application of the same method to a different problem.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<p>\nAll references to Descartes are to </p>\n<ul class=\"hanging\">",
                "[AT] <em>Oeuvres de Descartes</em>, 11 volumes, Charles Adam and\nPaul Tannery (eds), Paris: Vrin, 1996.",
                "[CSM or CSMK] <em>The Philosophical Writings of Descartes</em>, 3\nvolumes, John Cottingham, et al. (eds), Cambridge: Cambridge\nUniversity Press, 1985–1991.",
                "[MOGM] <em>Discourse on Method, Optics, Geometry, and\nMeteorology</em>, Paul J. Olscamp (ed.), Indianapolis, IN: Hackett,\n2001.",
                "[ES] <em><span class=\"normal\">Regulae ad directionem\ningenii</span>: An Early Manuscript Version</em>, Michael Edwards and Richard Serjeanston\n(eds), Oxford: Oxford University Press,\nforthcoming.",
                "[D1637] <em>Discours de la méthode pour bien conduire sa raison\net chercher la vérité dans les sciences , plus La dioptrique, Les\nmétéores et La géométrie qui sont des essais de cette\nméthode</em>, Leyde: Jan Maire, 1637. Many of the images in this\nentry are pulled from the scanned version at the Bibliothèque\nnationale de France, département Réserve des livres rares,\nRESM-R-76,\n <a href=\"https://gallica.bnf.fr/ark:/12148/btv1b86069594/f5.image.double\" target=\"other\">ark:/12148/btv1b86069594</a>\n</ul>\n<p>\nOther primary sources include:</p>\n<ul class=\"hanging\">",
                "Aristotle, 1984. <em>The Complete Works of Aristotle</em>, 2\nvols., ed. Jonathan Barnes. Princeton: Princeton University\nPress.",
                "Arnauld, Antoine and Pierre Nicole, 1664 [1996], <em>Logic, or,\nthe Art of Thinking</em>, fifth edition, Jill Vance Buroker\n(trans/ed.), Cambridge: Cambridge University Press.",
                "Bacon, Francis, 1620 [2000], <em>The New Organon</em>, Lisa\nJardine and Michael Silverthorne (eds), Cambridge: Cambridge\nUniversity Press.",
                "Descartes, René, 1987, <em>Discours de la méthode. Texte et commentaire par Étienne Gilson</em>, Paris: Vrin.",
                "Descartes, René and Martin Schook, 1988, <em>La Querelle\nd’Utrecht</em>, Theo Verbeek (ed.), Paris: Les impressions\nNouvelles.",
                "Empiricus, Sextus, 2005, <em>Against the Logicians</em>, Richard\nBett (ed.), Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511815232",
                "[<em>Elements</em>] Euclid, 1908, <em>The Thirteen Books of\nEuclid’s Elements</em>, 3 volumes, Thomas L. Heath (trans.),\nCambridge: Cambridge University Press.\n [<a href=\"https://mathcs.clarku.edu/~djoyce/java/elements/toc.html\" target=\"other\">Euclid <em>Elements</em> available online</a>]",
                "Gassendi, Pierre, 1658, <em>Opera omnia</em>, vol. I, Lyon:\nLaurent Anisson and Jean-Baptiste Devenet.",
                "Lipstorp, Daniel, 1653, <em>Specimina philosophiæ\ncartesianæ. Quibus accedit ejusdem authoris Copernicus\nredivivus</em>, Amsterdam: Elsevier.",
                "Poisson, Nicolas-Joseph, 1670, <em>Commentaire ou Remarques sur la\nméthode de René Descartes où on établit\nplusiers Principes generaux, necessaires pour entendre toutes ses\nOeuvres</em>, Vandsome: Sebastian Hip.",
                "Pourchot, Edmond, 1695, <em>Institutio philosophica ad faciliorem\nveterum ac recentiorum philosophorum intelligentiam comparatae</em>,\nParis: J.-B. Coignard.",
                "Schook[ius], Martin[us], et al., 1643, <em>Admiranda methodus\nnovae philosophiae Renati des Cartes</em>, Utrecht: J. van\nWaesberge.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Alanen, Lilli, 1999, “Intuition, Assent and Necessity: The\nQuestion of Descartes’s Psychologism”, <em>Acta\nPhilosophica Fennica 64: Norms and Modes of Thinking in\nDescartes</em>, Tuomo Aho and Mikko Yrjönsuuri (eds), Helsinki:\nPhilosophical Society of Finland, 99–125.",
                "Alanen, Lilli and Yrjönsuuri, Mikko, 1997, “Intuition,\njugement et evidence chez Ockham et Descartes”, in <em>Descartes\net le moyen age</em>, Joël Biard and Roshdi Rashed (eds), Paris:\nVrin, 155–175.",
                "Alexandrescu, Vlad, 2013, “Descartes et le rêve\n(Baconien) de ‘le plus haute et plus parfaite\nscience’”, <em>Studia Universitatis Babes-Bolyai –\nPhilosophia</em>, 58(3): 11–35.",
                "Ariew, Roger, 2014, <em>Descartes and the First Cartesians</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199563517.001.0001",
                "Azouvi, François, 2002, <em>Descartes et la France.\nHistoire d’une passion nationale</em>, Paris: Fayard.",
                "Bachelard, Gaston, 1934 [1985], <em>Le Nouvel esprit\nscientifique</em>, Paris: Félix Alcan, PUF. Translated as\n<em>The New Scientific Spirit</em>, Arthur Goldhammer (trans.),\nBoston: Beacon Press, 1985.",
                "Baillet, Adrien, 1691, <em>La vie de Monsieur Descartes</em>, vol.\n1, Paris: Daniel Horthemels.\n [<a href=\"https://archive.org/details/bub_gb_RhNEAAAAcAAJ/page/n6/mode/2up\" target=\"other\">Baillet 1691 available online</a>]",
                "Beck, John Leslie, 1952, <em>The Method of Descartes: A Study of\nthe <span class=\"normal\">Regulae</span></em>, Oxford: Clarendon\nPress.",
                "Bos, Henk J., 2001, <em>Redefining Geometrical Exactness:\nDescartes’ Transformation of the Early Modern Concept of\nConstruction</em>, New York: Springer.\ndoi:10.1007/978-1-4613-0087-8",
                "Buchwald, Jed Z., 2008, “Descartes’ Experimental\nJourney Past the Prism and through the Invisible World to the\nRainbow”, <em>Annals of Science</em> 65(1): 1–46.\ndoi:10.1080/00033790701406982",
                "Brockliss, Lawrence, 1987, <em>French Higher Education in the\nSeventeenth and Eighteenth Centuries: A Cultural History</em>, Oxford:\nClarendon Press.",
                "Broughton, Janet, 2002, <em>Descartes’s Method of Doubt</em>, Princeton: Princeton University Press.",
                "Cassan, Elodie, 2015, <em>Les chemins cartésien du\njugement</em>, Paris: Honoré Champion.",
                "Clagett, Marshall, 1959, <em>The Science of Mechanics in the\nMiddle Ages</em>, Madison, WI: University of Wisconsin Press.",
                "Clarke, Desmond M., 1982. <em>Descartes’ Philosophy of\nScience</em>. University Park: The Pennsylvania State University\nPress.",
                "–––, 2003, <em>Descartes’ Theory of\nMind</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199261237.001.0001",
                "–––, 2006, <em>Descartes: A Biography</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498077",
                "Crombie, A.C., 1961, <em>Robert Grosseteste and the Origins of\nExperimental Science, 1100–1700</em>, Oxford: Clarendon\nPress.",
                "Curley, Edwin, 1978, <em>Descartes against the Skeptics</em>,\nCambridge, MA: Harvard University Press.",
                "Damerow, Peter, Gideon Freudenthal, Peter McLaughlin, and\nJürgen Renn, 1992, <em>Exploring the Limits of Preclassical\nMechanics: A Study of Conceptual Development in Early Modern Science:\nFree Fall and Compounded Motion in the Work of Descartes, Galileo and\nBeeckman</em>, (Sources and Studies in the History of Mathematics and\nPhysical Sciences), New York, NY: Springer New York.\ndoi:10.1007/978-1-4757-3994-7",
                "Dear, Peter, 2000, “Method and the Study of Nature”,\nin <em>The Cambridge History of Seventeenth-Century Philosophy</em>,\nvol. 1, Daniel Garber and Michael Ayers (eds), Cambridge: Cambridge\nUniversity Press, 147­177. doi:10.1017/CHOL9780521307635.009",
                "de Buzon, Frédéric, 2013, <em>La science\ncartésienne et son objet: <span class=\"normal\">mathesis</span>\net phénomène</em>, Paris: Honoré Champion.",
                "Des Chene, Denis, 1996, <em>Physiologia: Natural Philosophy in\nLate Aristotelian and Cartesian Thought</em>, Ithaca, NY: Cornell\nUniversity Press.",
                "–––, 2000, <em>Life’s Form: Late\nAristotelian Conceptions of Soul</em>, Ithaca, NY: Cornell University\nPress.",
                "Dika, Tarek R., 2015, “Method, Practice, and the Unity of\n<em>Scientia</em> in Descartes’s <em>Regulae</em>”,\n<em>Journal of Early Modern Studies</em>, 4(2): 93–110.\ndoi:10.5840/jems20154216",
                "–––, forthcoming, “The Origins of\nCartesian Dualism”, <em>Journal of the American Philosophical\nAssociation</em>.",
                "Dika, Tarek R. and Denis Kambouchner, forthcoming,\n“Descartes’ Method”, in <em>The Cartesian Mind</em>,\nCecilia Wee and Jorge Secada (ed.), New York: Routledge.",
                "Dubouclez, Olivier, 2013, <em>Descartes et la voie de\nl’analyse</em>, Paris: Vrin.",
                "Duhem, Pierre, 1905–1906, <em>Les origines de la\nstatique</em>, 2 volumes, Paris: Hermann. Translated as <em>The\nOrigins of Statics</em>, Grant F. Leneaux, Victor N. Vagliente, and\nGuy H. Wagener (trans), Dordrecht: Kluwer, 1991.",
                "–––, 1906–1913, <em>Études sur\nLéonard de Vinci</em>, 3 volumes, Paris: Hermann.",
                "–––, 1913–1959, <em>Le système du\nmonde, histoire des doctrines cosmologiques de Platon à\nCopernic</em>, 10 volumes, Paris: Hermann.",
                "Feyerabend, Paul, 1975, <em>Against Method</em>, London: New Left\nBooks.",
                "Flage, Daniel E. and Clarence A. Bonnen, 1999, <em>Descartes and\nMethod: A Search for Method in <span class=\"normal\">Meditations</span></em>,\nLondon: Routledge.",
                "Garber, Daniel, 1988, “Descartes, the Aristotelians, and the\nRevolution that did not Happen in 1637”, <em>Monist</em>, 71(4):\n471–486. doi:10.5840/monist198871441",
                "–––, 1992, <em>Descartes’ Metaphysical\nPhysics</em>, Chicago: Chicago University Press.",
                "–––, 2001, <em>Descartes Embodied: Reading\nCartesian Philosophy through Cartesian Science</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511605994",
                "Gaukroger, Stephen, 1989, <em>Cartesian Logic: An Essay on\nDescartes’s Conception of Inference</em>, Oxford: Clarendon\nPress.",
                "–––, 1995, <em>Descartes: An Intellectual\nBiography</em>, Oxford: Clarendon Press.\ndoi:10.1093/0198237243.001.0001",
                "–––, 2006, “Knowledge, Evidence, and\nMethod”, in <em>The Cambridge Companion to Early Modern\nPhilosophy</em>, Donald Rutherford (ed.), Cambridge: Cambridge\nUniversity Press, 39–66. doi:10.1017/CCOL0521822424.003",
                "Gewirth, Alan, 1991. “Clearness and Distinctness in\nDescartes”, in Moyal 1991: 185–204.",
                "Gibson, A. Boyce, 1932, <em>The Philosophy of Descartes</em>,\nLondon: Methuen &amp; Co.",
                "Gibson, W. R. Boyce, 1898, “The Regulae of Descartes”,\n<em>Mind</em>, 7(26): 145–158. doi:10.1093/mind/VII.26.145",
                "Gilbert, Neal Ward, 1960, <em>Renaissance Concepts of Method</em>,\nNew York: Columbia University Press.",
                "Gontier, Thierry, 2006, “Mathématiques et science\nuniverselle chez Bacon et chez Descartes”, <em>Revue\nd’histoire des sciences</em>, 59(2): 285–312.\ndoi:10.3917/rhs.592.0285",
                "Gueroult, Martial, 1984, <em>Descartes’ Philosophy\nInterpreted According to the Order of Reasons</em>, 2 volumes, Roger\nAriew (trans.), Minneapolis, MN: University of Minnesota Press.",
                "Hamou, Phillipe, 2014, “Sur les origines du concept de\nméthode à l’âge Classique: La Ramée,\nBacon et Descartes”, <em>Revue LISA</em>, 12(5).\ndoi:10.4000/lisa.6249",
                "Humber, James. M., 1991, “Recognizing Clear and Distinct\nPerceptions”, in Moyal 1991: 204–222.",
                "Kambouchner, Denis, 1995, <em>L’homme des passions.\nCommentaires sur Descartes I. Analytique</em>, Paris: Albin\nMichel.",
                "–––, 2005, <em>Les <span class=\"normal\">Méditations\nMétaphysiques</span> de\nDescartes: Introduction Générale. Première\nMéditation</em>, Paris: Vrin.",
                "Keeling, S.V., 1934, <em>Descartes</em>, London: E. Benn.",
                "Koyré, Alexandre, 1939 [1978], <em>Études\ngaliléennes</em>, Paris: Hermann. Translates as <em>Galileo\nStudies</em>, John Mepham (trans.), Hassocks: Harvester Press.",
                "Kuhn, Thomas, 1977, <em>The Essential Tension: Selected Studies in\nScientific Tradition and Change</em>, Chicago: University of Chicago\nPress.",
                "Lalande, André, 1911, “Sur quelques textes de Bacon\net de Descartes”, <em>Revue de métaphysique et de\nmorale</em>, 11(3): 296–311.",
                "Laird, Walter Roy and Sophie Roux, 2008, <em>Mechanics and Natural\nPhilosophy before the Scientific Revolution</em>, Dordrecht: Springer.\ndoi:10.1007/978-1-4020-5967-4",
                "Larmore, Charles, 1980, “Descartes’ Empirical Epistemology”, in <em>Descartes: Philosophy, Mathematics and Physics</em>, Stephen Gaukrgoer (ed.), Sussex: Harvester Press, 6–22.",
                "Maier, Analeise, 1949–1958, <em>Studien zur Naturphilosophie\nder Spätscholastik</em>, 5 volumes, Rome: Editione di storia e\nletteratura.",
                "Mancosu, Paolo, 2008, “Descartes’ Mathematics”,\nin <em>A Companion to Descartes</em>, Janet Broughton and John\nCarriero (eds), Oxford: Blackwell, 103–124.\ndoi:10.1002/9780470696439.ch7",
                "Marion, Jean-Luc, 1992, “Cartesian metaphysics and the role of the simple natures”, in <em>The Cambridge Companion to Descartes</em>, John Cottingham (ed.), Cambridge: Cambridge University Press, 115–140.",
                "–––, 1975, <em>Sur l’ontologie grise de\nDescartes: science cartésienne et savoir aristotelicien dans\nles <span class=\"normal\">Regulae</span></em>, Paris: Vrin.",
                "Markie, Peter, 1991, “Clear and Distinct Perception and\nMetaphysical Certainty”, in <em>RenRené Descartes: Critical Assessments</em>, J.D. Moyal (ed.), London: New York, 177–185.",
                "Martinet, M., 1975, “Science et hypothèses chez\nDescartes”, <em>Archives internationale d’histoire des\nsciences</em>, 24: 319–338.",
                "Mikkeli, Heikki, 2010, “The Structure and Method of\nScientific Knowledge”, in Paul Richard Blum (ed.),\n<em>Philosophers of the Renaissance</em>, Washington DC: The Catholic\nUniversity of America Press, pp. 181–191",
                "Moyal, George J. D. (ed.), 1991, <em>René Descartes:\nCritical Assessments</em>, volume 1, London: Routledge.",
                "Newman, Lex, 2019, “Descartes on the Method of\nAnalysis”, in <em>The Oxford Handbook of Descartes and\nCartesianism</em>, Steven Nadler, Tad M. Schmaltz, and Delphine\nAntoine-Mahut (eds), Oxford: Oxford University Press, 64–88.\ndoi:10.1093/oxfordhb/9780198796909.013.4",
                "Normore, Calvin, 1993. “The Necessity in Deduction:\nCartesian Inference and its Medieval Background”,\n<em>Synthese</em>, 96(3): 437–454. doi:10.1007/BF01064011",
                "Randall, J.H., 1961, <em>The School of Padua and the Emergence of\nModern Science</em>, Padova: Editrice Antenore.",
                "Reiss, Timothy J., 2000, “Neo-Aristotle and Method: between\nZabarella and Descartes”, in <em>Descartes’ Natural\nPhilosophy</em>, Stephen Gaukroger, John Schuster, and John Sutton\n(eds), New York: Routledge, 195–227.",
                "Robinet, André, 1996, <em>Aux sources de\nl’ésprit cartésien: l’axe La\nRamée-Descartes: de la <span class=\"normal\">Dialectique</span>\ndes 1555 aux <span class=\"normal\">Regulae</span></em>, Paris:\nVrin.",
                "Rodis-Lewis, Geneviève, 1998, <em>Descartes: His Life and\nThought</em>, Ithaca, NY: Cornell University Press.",
                "Schmaltz, Tad M., 2017, <em>Early Modern Cartesianisms: Dutch and\nFrench Constructions</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190495220.001.0001",
                "Schuster, John, 2013. <em>Descartes-Agonistes:\nPhysico-mathematics, Method &amp; Corpuscular Mechanism,\n1618–1633</em>, Dordrecht: Springer.\ndoi:10.1007/978-94-007-4746-3",
                "Schuster, John and Richard Yeo (eds), 1986, <em>The Politics and\nRhetoric of Scientific Method: Historical Studies</em>, Dordrecht: D.\nReidel. doi:10.1007/978-94-009-4560-9",
                "Schouls, Peter, 1980, <em>The Imposition of Method: A Study of\nDescartes and Locke</em>, Oxford: Clarendon Press.",
                "Shea, William R., 1991, <em>The Magic of Numbers and Motion: The\nScientific Career of René Descartes</em>, New York: Science\nHistory Publications.",
                "Slowik, Edward, 2002, <em>Cartesian Spacetime: Descartes’\nPhysics and the Relational Theory of Space and Motion</em>, Dordrecht:\nKluwer. doi:10.1007/978-94-017-0975-0",
                "Smith, Kurt, 2010, <em>Matter Matters: Metaphysics and Methodology\nin the Early Modern Period</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199583652.001.0001",
                "Sylla, Edith Dudley, 1991, <em>The Oxford Calculators and the\nMathematics of Motion, 1320–1350: Physics and Measurements by\nLatitudes</em>, New York: Garland.",
                "Verbeek, Theo, 1992, <em>Descartes and the Dutch: Early Reactions\nto Cartesian Philosophy 1637–1650</em>, Carbondale: Southern\nIllinois University Press.",
                "Weber, J.P., 1964, <em>La constitution du texte des\n“Regulae”</em>, Paris: Société\nd’édition d’enseignement supérieur.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<p>\nAll references to Descartes are to </p>\n<ul class=\"hanging\">\n<li>[AT] <em>Oeuvres de Descartes</em>, 11 volumes, Charles Adam and\nPaul Tannery (eds), Paris: Vrin, 1996.</li>\n<li>[CSM or CSMK] <em>The Philosophical Writings of Descartes</em>, 3\nvolumes, John Cottingham, et al. (eds), Cambridge: Cambridge\nUniversity Press, 1985–1991. </li>\n<li>[MOGM] <em>Discourse on Method, Optics, Geometry, and\nMeteorology</em>, Paul J. Olscamp (ed.), Indianapolis, IN: Hackett,\n2001.</li>\n<li>[ES] <em><span class=\"normal\">Regulae ad directionem\ningenii</span>: An Early Manuscript Version</em>, Michael Edwards and Richard Serjeanston\n(eds), Oxford: Oxford University Press,\nforthcoming.</li>\n<li>[D1637] <em>Discours de la méthode pour bien conduire sa raison\net chercher la vérité dans les sciences , plus La dioptrique, Les\nmétéores et La géométrie qui sont des essais de cette\nméthode</em>, Leyde: Jan Maire, 1637. Many of the images in this\nentry are pulled from the scanned version at the Bibliothèque\nnationale de France, département Réserve des livres rares,\nRESM-R-76,\n <a href=\"https://gallica.bnf.fr/ark:/12148/btv1b86069594/f5.image.double\" target=\"other\">ark:/12148/btv1b86069594</a></li>\n</ul>\n<p>\nOther primary sources include:</p>\n<ul class=\"hanging\">\n<li>Aristotle, 1984. <em>The Complete Works of Aristotle</em>, 2\nvols., ed. Jonathan Barnes. Princeton: Princeton University\nPress.</li>\n<li>Arnauld, Antoine and Pierre Nicole, 1664 [1996], <em>Logic, or,\nthe Art of Thinking</em>, fifth edition, Jill Vance Buroker\n(trans/ed.), Cambridge: Cambridge University Press.</li>\n<li>Bacon, Francis, 1620 [2000], <em>The New Organon</em>, Lisa\nJardine and Michael Silverthorne (eds), Cambridge: Cambridge\nUniversity Press.</li>\n<li>Descartes, René, 1987, <em>Discours de la méthode. Texte et commentaire par Étienne Gilson</em>, Paris: Vrin.</li>\n<li>Descartes, René and Martin Schook, 1988, <em>La Querelle\nd’Utrecht</em>, Theo Verbeek (ed.), Paris: Les impressions\nNouvelles.</li>\n<li>Empiricus, Sextus, 2005, <em>Against the Logicians</em>, Richard\nBett (ed.), Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511815232</li>\n<li>[<em>Elements</em>] Euclid, 1908, <em>The Thirteen Books of\nEuclid’s Elements</em>, 3 volumes, Thomas L. Heath (trans.),\nCambridge: Cambridge University Press.\n [<a href=\"https://mathcs.clarku.edu/~djoyce/java/elements/toc.html\" target=\"other\">Euclid <em>Elements</em> available online</a>]</li>\n<li>Gassendi, Pierre, 1658, <em>Opera omnia</em>, vol. I, Lyon:\nLaurent Anisson and Jean-Baptiste Devenet.</li>\n<li>Lipstorp, Daniel, 1653, <em>Specimina philosophiæ\ncartesianæ. Quibus accedit ejusdem authoris Copernicus\nredivivus</em>, Amsterdam: Elsevier.</li>\n<li>Poisson, Nicolas-Joseph, 1670, <em>Commentaire ou Remarques sur la\nméthode de René Descartes où on établit\nplusiers Principes generaux, necessaires pour entendre toutes ses\nOeuvres</em>, Vandsome: Sebastian Hip.</li>\n<li>Pourchot, Edmond, 1695, <em>Institutio philosophica ad faciliorem\nveterum ac recentiorum philosophorum intelligentiam comparatae</em>,\nParis: J.-B. Coignard.</li>\n<li>Schook[ius], Martin[us], et al., 1643, <em>Admiranda methodus\nnovae philosophiae Renati des Cartes</em>, Utrecht: J. van\nWaesberge.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Alanen, Lilli, 1999, “Intuition, Assent and Necessity: The\nQuestion of Descartes’s Psychologism”, <em>Acta\nPhilosophica Fennica 64: Norms and Modes of Thinking in\nDescartes</em>, Tuomo Aho and Mikko Yrjönsuuri (eds), Helsinki:\nPhilosophical Society of Finland, 99–125.</li>\n<li>Alanen, Lilli and Yrjönsuuri, Mikko, 1997, “Intuition,\njugement et evidence chez Ockham et Descartes”, in <em>Descartes\net le moyen age</em>, Joël Biard and Roshdi Rashed (eds), Paris:\nVrin, 155–175.</li>\n<li>Alexandrescu, Vlad, 2013, “Descartes et le rêve\n(Baconien) de ‘le plus haute et plus parfaite\nscience’”, <em>Studia Universitatis Babes-Bolyai –\nPhilosophia</em>, 58(3): 11–35.</li>\n<li>Ariew, Roger, 2014, <em>Descartes and the First Cartesians</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199563517.001.0001</li>\n<li>Azouvi, François, 2002, <em>Descartes et la France.\nHistoire d’une passion nationale</em>, Paris: Fayard.</li>\n<li>Bachelard, Gaston, 1934 [1985], <em>Le Nouvel esprit\nscientifique</em>, Paris: Félix Alcan, PUF. Translated as\n<em>The New Scientific Spirit</em>, Arthur Goldhammer (trans.),\nBoston: Beacon Press, 1985.</li>\n<li>Baillet, Adrien, 1691, <em>La vie de Monsieur Descartes</em>, vol.\n1, Paris: Daniel Horthemels.\n [<a href=\"https://archive.org/details/bub_gb_RhNEAAAAcAAJ/page/n6/mode/2up\" target=\"other\">Baillet 1691 available online</a>]</li>\n<li>Beck, John Leslie, 1952, <em>The Method of Descartes: A Study of\nthe <span class=\"normal\">Regulae</span></em>, Oxford: Clarendon\nPress.</li>\n<li>Bos, Henk J., 2001, <em>Redefining Geometrical Exactness:\nDescartes’ Transformation of the Early Modern Concept of\nConstruction</em>, New York: Springer.\ndoi:10.1007/978-1-4613-0087-8</li>\n<li>Buchwald, Jed Z., 2008, “Descartes’ Experimental\nJourney Past the Prism and through the Invisible World to the\nRainbow”, <em>Annals of Science</em> 65(1): 1–46.\ndoi:10.1080/00033790701406982</li>\n<li>Brockliss, Lawrence, 1987, <em>French Higher Education in the\nSeventeenth and Eighteenth Centuries: A Cultural History</em>, Oxford:\nClarendon Press.</li>\n<li>Broughton, Janet, 2002, <em>Descartes’s Method of Doubt</em>, Princeton: Princeton University Press.</li>\n<li>Cassan, Elodie, 2015, <em>Les chemins cartésien du\njugement</em>, Paris: Honoré Champion.</li>\n<li>Clagett, Marshall, 1959, <em>The Science of Mechanics in the\nMiddle Ages</em>, Madison, WI: University of Wisconsin Press.</li>\n<li>Clarke, Desmond M., 1982. <em>Descartes’ Philosophy of\nScience</em>. University Park: The Pennsylvania State University\nPress.</li>\n<li>–––, 2003, <em>Descartes’ Theory of\nMind</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199261237.001.0001</li>\n<li>–––, 2006, <em>Descartes: A Biography</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498077</li>\n<li>Crombie, A.C., 1961, <em>Robert Grosseteste and the Origins of\nExperimental Science, 1100–1700</em>, Oxford: Clarendon\nPress.</li>\n<li>Curley, Edwin, 1978, <em>Descartes against the Skeptics</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Damerow, Peter, Gideon Freudenthal, Peter McLaughlin, and\nJürgen Renn, 1992, <em>Exploring the Limits of Preclassical\nMechanics: A Study of Conceptual Development in Early Modern Science:\nFree Fall and Compounded Motion in the Work of Descartes, Galileo and\nBeeckman</em>, (Sources and Studies in the History of Mathematics and\nPhysical Sciences), New York, NY: Springer New York.\ndoi:10.1007/978-1-4757-3994-7</li>\n<li>Dear, Peter, 2000, “Method and the Study of Nature”,\nin <em>The Cambridge History of Seventeenth-Century Philosophy</em>,\nvol. 1, Daniel Garber and Michael Ayers (eds), Cambridge: Cambridge\nUniversity Press, 147­177. doi:10.1017/CHOL9780521307635.009</li>\n<li>de Buzon, Frédéric, 2013, <em>La science\ncartésienne et son objet: <span class=\"normal\">mathesis</span>\net phénomène</em>, Paris: Honoré Champion.</li>\n<li>Des Chene, Denis, 1996, <em>Physiologia: Natural Philosophy in\nLate Aristotelian and Cartesian Thought</em>, Ithaca, NY: Cornell\nUniversity Press.</li>\n<li>–––, 2000, <em>Life’s Form: Late\nAristotelian Conceptions of Soul</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Dika, Tarek R., 2015, “Method, Practice, and the Unity of\n<em>Scientia</em> in Descartes’s <em>Regulae</em>”,\n<em>Journal of Early Modern Studies</em>, 4(2): 93–110.\ndoi:10.5840/jems20154216</li>\n<li>–––, forthcoming, “The Origins of\nCartesian Dualism”, <em>Journal of the American Philosophical\nAssociation</em>.</li>\n<li>Dika, Tarek R. and Denis Kambouchner, forthcoming,\n“Descartes’ Method”, in <em>The Cartesian Mind</em>,\nCecilia Wee and Jorge Secada (ed.), New York: Routledge. </li>\n<li>Dubouclez, Olivier, 2013, <em>Descartes et la voie de\nl’analyse</em>, Paris: Vrin.</li>\n<li>Duhem, Pierre, 1905–1906, <em>Les origines de la\nstatique</em>, 2 volumes, Paris: Hermann. Translated as <em>The\nOrigins of Statics</em>, Grant F. Leneaux, Victor N. Vagliente, and\nGuy H. Wagener (trans), Dordrecht: Kluwer, 1991.</li>\n<li>–––, 1906–1913, <em>Études sur\nLéonard de Vinci</em>, 3 volumes, Paris: Hermann.</li>\n<li>–––, 1913–1959, <em>Le système du\nmonde, histoire des doctrines cosmologiques de Platon à\nCopernic</em>, 10 volumes, Paris: Hermann.</li>\n<li>Feyerabend, Paul, 1975, <em>Against Method</em>, London: New Left\nBooks.</li>\n<li>Flage, Daniel E. and Clarence A. Bonnen, 1999, <em>Descartes and\nMethod: A Search for Method in <span class=\"normal\">Meditations</span></em>,\nLondon: Routledge.</li>\n<li>Garber, Daniel, 1988, “Descartes, the Aristotelians, and the\nRevolution that did not Happen in 1637”, <em>Monist</em>, 71(4):\n471–486. doi:10.5840/monist198871441</li>\n<li>–––, 1992, <em>Descartes’ Metaphysical\nPhysics</em>, Chicago: Chicago University Press.</li>\n<li>–––, 2001, <em>Descartes Embodied: Reading\nCartesian Philosophy through Cartesian Science</em>, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511605994</li>\n<li>Gaukroger, Stephen, 1989, <em>Cartesian Logic: An Essay on\nDescartes’s Conception of Inference</em>, Oxford: Clarendon\nPress.</li>\n<li>–––, 1995, <em>Descartes: An Intellectual\nBiography</em>, Oxford: Clarendon Press.\ndoi:10.1093/0198237243.001.0001</li>\n<li>–––, 2006, “Knowledge, Evidence, and\nMethod”, in <em>The Cambridge Companion to Early Modern\nPhilosophy</em>, Donald Rutherford (ed.), Cambridge: Cambridge\nUniversity Press, 39–66. doi:10.1017/CCOL0521822424.003</li>\n<li>Gewirth, Alan, 1991. “Clearness and Distinctness in\nDescartes”, in Moyal 1991: 185–204.</li>\n<li>Gibson, A. Boyce, 1932, <em>The Philosophy of Descartes</em>,\nLondon: Methuen &amp; Co.</li>\n<li>Gibson, W. R. Boyce, 1898, “The Regulae of Descartes”,\n<em>Mind</em>, 7(26): 145–158. doi:10.1093/mind/VII.26.145</li>\n<li>Gilbert, Neal Ward, 1960, <em>Renaissance Concepts of Method</em>,\nNew York: Columbia University Press.</li>\n<li>Gontier, Thierry, 2006, “Mathématiques et science\nuniverselle chez Bacon et chez Descartes”, <em>Revue\nd’histoire des sciences</em>, 59(2): 285–312.\ndoi:10.3917/rhs.592.0285</li>\n<li>Gueroult, Martial, 1984, <em>Descartes’ Philosophy\nInterpreted According to the Order of Reasons</em>, 2 volumes, Roger\nAriew (trans.), Minneapolis, MN: University of Minnesota Press.</li>\n<li>Hamou, Phillipe, 2014, “Sur les origines du concept de\nméthode à l’âge Classique: La Ramée,\nBacon et Descartes”, <em>Revue LISA</em>, 12(5).\ndoi:10.4000/lisa.6249</li>\n<li>Humber, James. M., 1991, “Recognizing Clear and Distinct\nPerceptions”, in Moyal 1991: 204–222.</li>\n<li>Kambouchner, Denis, 1995, <em>L’homme des passions.\nCommentaires sur Descartes I. Analytique</em>, Paris: Albin\nMichel.</li>\n<li>–––, 2005, <em>Les <span class=\"normal\">Méditations\nMétaphysiques</span> de\nDescartes: Introduction Générale. Première\nMéditation</em>, Paris: Vrin.</li>\n<li>Keeling, S.V., 1934, <em>Descartes</em>, London: E. Benn.</li>\n<li>Koyré, Alexandre, 1939 [1978], <em>Études\ngaliléennes</em>, Paris: Hermann. Translates as <em>Galileo\nStudies</em>, John Mepham (trans.), Hassocks: Harvester Press.</li>\n<li>Kuhn, Thomas, 1977, <em>The Essential Tension: Selected Studies in\nScientific Tradition and Change</em>, Chicago: University of Chicago\nPress.</li>\n<li>Lalande, André, 1911, “Sur quelques textes de Bacon\net de Descartes”, <em>Revue de métaphysique et de\nmorale</em>, 11(3): 296–311.</li>\n<li>Laird, Walter Roy and Sophie Roux, 2008, <em>Mechanics and Natural\nPhilosophy before the Scientific Revolution</em>, Dordrecht: Springer.\ndoi:10.1007/978-1-4020-5967-4</li>\n<li>Larmore, Charles, 1980, “Descartes’ Empirical Epistemology”, in <em>Descartes: Philosophy, Mathematics and Physics</em>, Stephen Gaukrgoer (ed.), Sussex: Harvester Press, 6–22. </li>\n<li>Maier, Analeise, 1949–1958, <em>Studien zur Naturphilosophie\nder Spätscholastik</em>, 5 volumes, Rome: Editione di storia e\nletteratura.</li>\n<li>Mancosu, Paolo, 2008, “Descartes’ Mathematics”,\nin <em>A Companion to Descartes</em>, Janet Broughton and John\nCarriero (eds), Oxford: Blackwell, 103–124.\ndoi:10.1002/9780470696439.ch7</li>\n<li>Marion, Jean-Luc, 1992, “Cartesian metaphysics and the role of the simple natures”, in <em>The Cambridge Companion to Descartes</em>, John Cottingham (ed.), Cambridge: Cambridge University Press, 115–140.</li>\n<li>–––, 1975, <em>Sur l’ontologie grise de\nDescartes: science cartésienne et savoir aristotelicien dans\nles <span class=\"normal\">Regulae</span></em>, Paris: Vrin.</li>\n<li>Markie, Peter, 1991, “Clear and Distinct Perception and\nMetaphysical Certainty”, in <em>RenRené Descartes: Critical Assessments</em>, J.D. Moyal (ed.), London: New York, 177–185.</li>\n<li>Martinet, M., 1975, “Science et hypothèses chez\nDescartes”, <em>Archives internationale d’histoire des\nsciences</em>, 24: 319–338.</li>\n<li>Mikkeli, Heikki, 2010, “The Structure and Method of\nScientific Knowledge”, in Paul Richard Blum (ed.),\n<em>Philosophers of the Renaissance</em>, Washington DC: The Catholic\nUniversity of America Press, pp. 181–191</li>\n<li>Moyal, George J. D. (ed.), 1991, <em>René Descartes:\nCritical Assessments</em>, volume 1, London: Routledge.</li>\n<li>Newman, Lex, 2019, “Descartes on the Method of\nAnalysis”, in <em>The Oxford Handbook of Descartes and\nCartesianism</em>, Steven Nadler, Tad M. Schmaltz, and Delphine\nAntoine-Mahut (eds), Oxford: Oxford University Press, 64–88.\ndoi:10.1093/oxfordhb/9780198796909.013.4</li>\n<li>Normore, Calvin, 1993. “The Necessity in Deduction:\nCartesian Inference and its Medieval Background”,\n<em>Synthese</em>, 96(3): 437–454. doi:10.1007/BF01064011</li>\n<li>Randall, J.H., 1961, <em>The School of Padua and the Emergence of\nModern Science</em>, Padova: Editrice Antenore.</li>\n<li>Reiss, Timothy J., 2000, “Neo-Aristotle and Method: between\nZabarella and Descartes”, in <em>Descartes’ Natural\nPhilosophy</em>, Stephen Gaukroger, John Schuster, and John Sutton\n(eds), New York: Routledge, 195–227.</li>\n<li>Robinet, André, 1996, <em>Aux sources de\nl’ésprit cartésien: l’axe La\nRamée-Descartes: de la <span class=\"normal\">Dialectique</span>\ndes 1555 aux <span class=\"normal\">Regulae</span></em>, Paris:\nVrin.</li>\n<li>Rodis-Lewis, Geneviève, 1998, <em>Descartes: His Life and\nThought</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Schmaltz, Tad M., 2017, <em>Early Modern Cartesianisms: Dutch and\nFrench Constructions</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190495220.001.0001</li>\n<li>Schuster, John, 2013. <em>Descartes-Agonistes:\nPhysico-mathematics, Method &amp; Corpuscular Mechanism,\n1618–1633</em>, Dordrecht: Springer.\ndoi:10.1007/978-94-007-4746-3</li>\n<li>Schuster, John and Richard Yeo (eds), 1986, <em>The Politics and\nRhetoric of Scientific Method: Historical Studies</em>, Dordrecht: D.\nReidel. doi:10.1007/978-94-009-4560-9</li>\n<li>Schouls, Peter, 1980, <em>The Imposition of Method: A Study of\nDescartes and Locke</em>, Oxford: Clarendon Press.</li>\n<li>Shea, William R., 1991, <em>The Magic of Numbers and Motion: The\nScientific Career of René Descartes</em>, New York: Science\nHistory Publications.</li>\n<li>Slowik, Edward, 2002, <em>Cartesian Spacetime: Descartes’\nPhysics and the Relational Theory of Space and Motion</em>, Dordrecht:\nKluwer. doi:10.1007/978-94-017-0975-0</li>\n<li>Smith, Kurt, 2010, <em>Matter Matters: Metaphysics and Methodology\nin the Early Modern Period</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199583652.001.0001</li>\n<li>Sylla, Edith Dudley, 1991, <em>The Oxford Calculators and the\nMathematics of Motion, 1320–1350: Physics and Measurements by\nLatitudes</em>, New York: Garland.</li>\n<li>Verbeek, Theo, 1992, <em>Descartes and the Dutch: Early Reactions\nto Cartesian Philosophy 1637–1650</em>, Carbondale: Southern\nIllinois University Press.</li>\n<li>Weber, J.P., 1964, <em>La constitution du texte des\n“Regulae”</em>, Paris: Société\nd’édition d’enseignement supérieur.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "demonstration: medieval theories of",
            "Descartes, René",
            "Descartes, René: epistemology",
            "Descartes, René: life and works",
            "Descartes, René: mathematics",
            "Descartes, René: physics",
            "logic: ancient",
            "science: unity of",
            "scientific method"
        ],
        "entry_link": [
            {
                "../demonstration-medieval/": "demonstration: medieval theories of"
            },
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../descartes-epistemology/": "Descartes, René: epistemology"
            },
            {
                "../descartes-works/": "Descartes, René: life and works"
            },
            {
                "../descartes-mathematics/": "Descartes, René: mathematics"
            },
            {
                "../descartes-physics/": "Descartes, René: physics"
            },
            {
                "../logic-ancient/": "logic: ancient"
            },
            {
                "../scientific-unity/": "science: unity of"
            },
            {
                "../scientific-method/": "scientific method"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=descartes-method\" target=\"other\">How to cite this entry</a>.",
            "\n<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>\n",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/descartes-method/\" target=\"other\">Preview the PDF version of this entry</a>\n at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "\n<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>\n",
            "<a href=\"https://www.inphoproject.org/entity?sep=descartes-method&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "\n<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>\n",
            "<a href=\"https://philpapers.org/sep/descartes-method/\" target=\"other\">Enhanced bibliography for this entry</a>\n at\n <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>,\n with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=descartes-method": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/descartes-method/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=descartes-method&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/descartes-method/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://books.google.com/books?id=tw-vqFBPPpoC&amp;printsec=frontcover&amp;source=gbs_atb#v=onepage&amp;q&amp;f=false\" target=\"Oth\">French text of <em> Direction of the Mind</em>.</a>",
            "<a href=\"https://books.google.com/books?id=rLf9Px7lXcQC&amp;pg=PA3&amp;dq=Discours+de+la+méthode:+pour+bien+conduire+sa+raison,+et+chercher+la+vér%20ité&amp;hl=en&amp;newbks=1&amp;newbks_redir=0&amp;sa=X&amp;ved=2ahUKEwir6_SknsjpAhVEiOAKHWqGDz8Q6wEwAHoECAEQAQ#v=onepage&amp;q&amp;f=false\" target=\"Oth\">French text of <em> Discourse on the Method</em>.</a>"
        ],
        "listed_links": [
            {
                "https://books.google.com/books?id=tw-vqFBPPpoC&printsec=frontcover&source=gbs_atb#v=onepage&q&f=false": "French text of  Direction of the Mind."
            },
            {
                "https://books.google.com/books?id=rLf9Px7lXcQC&pg=PA3&dq=Discours+de+la+méthode:+pour+bien+conduire+sa+raison,+et+chercher+la+vér%20ité&hl=en&newbks=1&newbks_redir=0&sa=X&ved=2ahUKEwir6_SknsjpAhVEiOAKHWqGDz8Q6wEwAHoECAEQAQ#v=onepage&q&f=false": "French text of  Discourse on the Method."
            }
        ]
    }
}