{
    "url": "egoism",
    "title": "Egoism",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Robert Shaver\n<bshaver@cc.umanitoba.CA>",
        "author_links": [
            {
                "mailto:bshaver%40cc%2eumanitoba%2eCA": "bshaver@cc.umanitoba.CA"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nRobert Shaver\n&lt;<a href=\"mailto:bshaver%40cc%2eumanitoba%2eCA\"><em>bshaver<abbr title=\" at \">@</abbr>cc<abbr title=\" dot \">.</abbr>umanitoba<abbr title=\" dot \">.</abbr>CA</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 4, 2002",
        "substantive revision Mon Jan 9, 2023"
    ],
    "preamble": "\n\nEgoism can be a descriptive or a normative position. Psychological\negoism, the most famous descriptive position, claims that each person\nhas but one ultimate aim: her own welfare. Normative forms of egoism\nmake claims about what one ought to do, rather than describe what one\ndoes do. Ethical egoism claims I morally ought to perform some action\nif and only if, and because, performing that action maximizes my\nself-interest. Rational egoism claims that I ought to perform some\naction if and only if, and because, performing that action maximizes\nmy self-interest. (Here the “ought” is not restricted to\nthe moral “ought”.) \n",
    "toc": [
        {
            "#PsycEgoi": "1. Psychological Egoism"
        },
        {
            "#EthiEgoi": "2. Ethical Egoism"
        },
        {
            "#RatiEgoi": "3. Rational Egoism"
        },
        {
            "#Conc": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Psychological Egoism\n\nAll forms of egoism require explication of “self-interest”\n(or “welfare” or “well-being”). There are\nthree main theories. Preference or desire accounts identify\nself-interest with the satisfaction of one’s desires. Often, and\nmost plausibly, these desires are restricted to self-regarding\ndesires. What makes a desire self-regarding is controversial, but\nthere are clear cases and counter-cases: a desire for my own pleasure\nis self-regarding; a desire for the welfare of others is not.\nObjective accounts identify self-interest with the possession of\nstates (such as virtue or knowledge) that are valuable independently\nof whether they are desired. Hybrid accounts give a role to both\ndesires (or pleasure) and states that are valuable independently of\nwhether they are desired. For example, perhaps the increase to my\nwell-being brought about by a satisfied desire (or a pleasure) is even\ngreater if it is a desire for (or pleasure in) knowledge. Or perhaps\nthe increase to my well-being brought about by a piece of knowledge is\neven greater if I desire (or take pleasure in) it. Hedonism, which\nidentifies self-interest with pleasure, is either a preference or an\nobjective account, according to whether what counts as pleasure is\ndetermined by one’s desires. \n\nPsychological egoism claims that each person has but one ultimate aim:\nher own welfare. This allows for action that fails to maximize\nperceived self-interest, but rules out the sort of behavior\npsychological egoists like to target — such as altruistic\nbehavior or motivation by thoughts of duty alone. It allows for\nweakness of will, since in weakness of will cases I am still aiming at\nmy own welfare; I am weak in that I do not act as I aim. And it allows\nfor aiming at things other than one’s welfare, such as helping\nothers, where these things are a means to one’s welfare.\n\nPsychological egoism is supported by our frequent observation of\nself-interested behavior. Apparently altruistic action is often\nrevealed to be self-interested. And we typically motivate people by\nappealing to their self-interest (through, for example, punishments\nand rewards).\n\nA common objection to psychological egoism, made famously by Joseph\nButler, is that I must desire things other than my own welfare in\norder to get welfare. Say I derive welfare from playing hockey. Unless\nI desired, for its own sake, to play hockey, I would not derive\nwelfare from playing. Or say I derive welfare from helping others.\nUnless I desired, for its own sake, that others do well, I would not\nderive welfare from helping them. Welfare results from my action, but\ncannot be the only aim of my action.\n\nThe psychological egoist can concede that I must have desires for\nparticular things, such as playing hockey. But there is no need to\nconcede that the satisfaction of these desires is not part of my\nwelfare. My welfare might consist simply in the satisfaction of\nself-regarding desires. In the case of deriving welfare from helping\nothers, the psychological egoist can again concede that I would not\nderive welfare without desiring some particular thing, but need not\nagree that what I desire for its own sake is that others do well. That\nI am the one who helps them may, for example, satisfy my\nself-regarding desire for power.\n\nA bigger problem for psychological egoism is that some behavior does\nnot seem to be explained by self-regarding desires. Say a soldier\nthrows himself on a grenade to prevent others from being killed. It\ndoes not seem that the soldier is pursuing his perceived\nself-interest. It is plausible that, if asked, the soldier would have\nsaid that he threw himself on the grenade because he wanted to save\nthe lives of others or because it was his duty. He would deny as\nridiculous the claim that he acted in his self-interest.\n\nThe psychological egoist might reply that the soldier is lying or\nself-deceived. Perhaps he threw himself on the grenade because he\nbelieved that he could not bear to live with himself afterwards if he\ndid not do so. He has a better life, in terms of welfare, by avoiding\nyears of guilt. The main problem here is that while this is a possible\naccount of some cases, there is no reason to think it covers all\ncases. Another problem is that guilt may presuppose that the soldier\nhas a non-self-regarding desire for doing what he takes to be\nright.\n\nThe psychological egoist might reply that some such account must be\nright. After all, the soldier did what he most wanted to do, and so\nmust have been pursuing his perceived self-interest. In one sense,\nthis is true. If self-interest is identified with the satisfaction of\nall of one’s preferences, then all intentional action is\nself-interested (at least if intentional actions are always explained\nby citing preferences, as most believe). Psychological egoism turns\nout to be trivially true. This would not content defenders of\npsychological egoism, however. They intend an empirical theory that,\nlike other such theories, it is at least possible to refute by\nobservation.\n\nThere is another way to show that the trivial version of psychological\negoism is unsatisfactory. We ordinarily think there is a significant\ndifference in selfishness between the soldier’s action and that\nof another soldier who, say, pushes someone onto the grenade to avoid\nbeing blown up himself. We think the former is acting unselfishly\nwhile the latter is acting selfishly. According to the trivial version\nof psychological egoism, both soldiers are equally selfish, since both\nare doing what they most desire.\n\nThe psychological egoist might handle apparent cases of\nself-sacrifice, not by adopting the trivial version, but rather by\nclaiming that facts about the self-interest of the agent explain all\nbehavior. Perhaps as infants we have only self-regarding desires; we\ncome to desire other things, such as doing our duty, by learning that\nthese other things satisfy our self-regarding desires; in time, we\npursue the other things for their own sakes.\n\nEven if this picture of development is true, however, it does not\ndefend psychological egoism, since it admits that we sometimes\nultimately aim at things other than our welfare. An account of the\norigins of our non-self-regarding desires does not show that they are\nreally self-regarding. The soldier’s desire is to save others,\nnot increase his own welfare, even if he would not have desired to\nsave others unless saving others was, in the past, connected to\nincreasing his welfare.\n\nThe psychological egoist must argue that we do not come to pursue\nthings other than our welfare for their own sakes. In principle, it\nseems possible to show this by showing that non-self-regarding desires\ndo not continue for long once their connection to our welfare is\nbroken. However, evidence for this dependence claim has not been\nforthcoming.\n\nIndeed, when examining the empirical evidence, two sorts of approach\nhave been used to argue against psychological egoism.\n\nFirst, Daniel Batson and colleagues found that increased empathy leads\nto increased helping behaviour. One hypothesis is altruistic: empathy\ncauses a non-instrumental desire to help. There are many competing\negoistic hypotheses. Empathy might cause an unpleasant experience that\nsubjects believe they can stop by helping; or subjects might think\nfailing to help in cases of high empathy is more likely to lead to\npunishment by others, or that helping here is more likely to be\nrewarded by others; or subjects might think this about\nself-administered punishment (e.g., guilt) or reward. In an ingenious\nseries of experiments, Batson compared the egoistic hypotheses, one by\none, against the altruistic hypothesis. He found that the altruistic\nhypothesis always made superior predictions. Against the unpleasant\nexperience hypothesis, Batson found that giving high-empathy subjects\neasy ways of stopping the experience other than by helping did not\nreduce helping. Against the punishment by others hypothesis, Batson\nfound that letting high-empathy subjects believe that their behaviour\nwould be secret did not reduce helping. Against the self-administered\nreward hypothesis, Batson found that the mood of high-empathy subjects\ndepended on whether they believed that help was needed, whether or not\nthey could do the helping, rather than on whether they helped (and so\ncould self-reward). Against the self-administered punishment\nhypothesis, Batson found that making high-empathy subjects believe\nthey would feel less guilt from not helping (by letting them believe\nthat few others had volunteered to help) did not reduce helping.\n\nOne might quibble with some of the details. Perhaps subjects did not\nbelieve that the easy ways of stopping the painful experience Batson\nprovided, such as leaving the viewing room, would stop it. (For an\naccount of an experiment done in reply, favouring Batson, see Stich,\nDoris and Roedder 2010, as well as Batson 2011 135–145.) Perhaps\na Batson-proof egoistic hypothesis could be offered: say that subjects\nbelieve that the only way of stopping the pain (or avoiding\nself-punishment) is by helping (though whether subjects have this\nbelief might be tested for on its own). But on the whole,\nBatson’s experiments are very bad news for psychological egoism.\n(For further discussion of Batson, see May 2011a and Slote 2013.)\n\nSecond, Elliot Sober and David Wilson argue that evolutionary theory\nsupports altruism. Parental care might be explained on egoistic\ngrounds: a belief about the child’s distress causes the parent\npain that the parent believes she can alleviate by helping, or the\nparent believes that she will be caused pain if she does not help.\nParental care might also be explained on altruistic grounds: the\nparent has a non-instrumental desire that the child do well. Lastly,\nparental care might be explained by a combination of these mechanisms.\nSober and Wilson argue that more reliable care would be provided by\nthe altruistic or combination mechanisms. Given the importance of\nparental care, this is a reason for thinking that natural selection\nwould have favoured one of these mechanisms. The egoistic mechanism is\nless reliable for several reasons: beliefs about the child’s\ndistress may fail to cause the parent pain (even bodily injury does\nnot always cause pain, so pain is unlikely to be always caused by\nbeliefs about distress); the parent may fail to believe that helping\nwill best reduce her pain; there may not be enough pain produced; the\ncombination view has the advantage of an extra mechanism.\n\nThis argument has drawbacks. Natural selection does not always provide\nback-up mechanisms (I have but one liver). Natural selection sometimes\nhas my desires caused by feelings that are produced by a belief rather\nthan directly by the belief (my desire to run away from danger is\noften caused by my fear, rather than by the mere belief that there is\ndanger). And in these cases, as in the case of the imperfectly\ncorrelated pain and bodily injury, there seems usually to be\nenough feeling. The altruistic hypothesis also has some of the\nsame problems: for example, just as there might not be enough pain,\nthe non-instrumental desire that the child do well might not be strong\nenough to defeat other desires. Indeed, without an estimate of how\nstrong this desire is, there is no reason to think the egoistic\nhypothesis is less reliable. It may have more points at which it can\ngo wrong, but produce more care than a direct but weak altruistic\nmechanism. (For many of these worries, and others, see Stich, Doris\nand Roedder 2010.)\n\nEven if evolutionary arguments can be met, however, psychological\negoism faces the problems noted earlier. In response, the\npsychological egoist might move to what Gregory Kavka (1986,\n64–80) calls “predominant egoism:” we act\nunselfishly only rarely, and then typically where the sacrifice is\nsmall and the gain to others is large or where those benefiting are\nfriends, family, or favorite causes. Predominant egoism is not\ntroubled by the soldier counter-example, since it allows exceptions;\nit is not trivial; and it seems empirically plausible. (For other\nweakened positions, see LaFollette 1988 and Mercer 2001.)\n2. Ethical Egoism\n\nEthical egoism claims that I morally ought to perform some action if\nand only if, and because, performing that action maximizes my\nself-interest. (There are possibilities other than maximization. One\nmight, for example, claim that one ought to achieve a certain level of\nwelfare, but that there is no requirement to achieve more. Ethical\negoism might also apply to things other than acts, such as rules or\ncharacter traits. Since these variants are uncommon, and the arguments\nfor and against them are largely the same as those concerning the\nstandard version, I set them aside.)\n\nOne issue concerns how much ethical egoism differs in content from\nstandard moral theories. It might appear that it differs a great deal.\nAfter all, moral theories such as Kantianism, utilitarianism, and\ncommon-sense morality require that an agent give weight to the\ninterests of others. They sometimes require uncompensated sacrifices,\nparticularly when the loss to the agent is small and the gain to\nothers is large. (Say the cost to me of saving a drowning person is\ngetting my shirtsleeve wet.) Ethical egoists can reply, however, that\negoism generates many of the same duties to others. The argument runs\nas follows. Each person needs the cooperation of others to obtain\ngoods such as defense or friendship. If I act as if I give no weight\nto others, others will not cooperate with me. If, say, I break my\npromises whenever it is in my direct self-interest to do so, others\nwill not accept my promises, and may even attack me. I do best, then,\nby acting as if others have weight (provided they act as if I have\nweight in return).\n\nIt is unlikely that this argument proves that ethical egoism generates\nall of the standard duties to others. For the argument depends on the\nability of others to cooperate with me or attack me should I fail to\ncooperate. In dealings with others who lack these abilities, the\negoist has no reason to cooperate. The duties to others found in\nstandard moral theories are not conditional in this way. I do not, for\nexample, escape a duty to save a drowning person, when I can easily do\nso, just because the drowning person (or anyone watching) happens\nnever to be able to offer fruitful cooperation or retaliation.\n\nThe divergence between ethical egoism and standard moral theories\nappears in other ways.\n\nFirst, the ethical egoist will rank as most important duties that\nbring her the highest payoff. Standard moral theories determine\nimportance at least in part by considering the payoff to those helped.\nWhat brings the highest payoff to me is not necessarily what brings\nthe highest payoff to those helped. I might, for example, profit more\nfrom helping the local Opera society refurbish its hall than I would\nfrom giving to famine relief in Africa, but standard moral theories\nwould rank famine relief as more important than Opera hall\nimprovements.\n\nSecond, the cooperation argument cannot be extended to justify\nextremely large sacrifices, such as the soldier falling on the\ngrenade, that standard moral theories rank either as most important or\nsupererogatory. The cooperation argument depends on a short-term loss\n(such as keeping a promise that it is inconvenient to keep) being\nrecompensed by a long-term gain (such as being trusted in future\npromises). Where the immediate loss is one’s life (or\nirreplaceable features such as one’s sight), there is no\nlong-term gain, and so no egoist argument for the sacrifice.\n\nAn ethical egoist might reply by taking the cooperation argument\nfurther. Perhaps I cannot get the benefits of cooperation without\nconverting to some non-egoist moral theory. That is, it is not enough\nthat I act as if others have weight; I must really give them weight. I\ncould still count as an egoist, in the sense that I have adopted the\nnon-egoist theory on egoist grounds.\n\nOne problem is that it seems unlikely that I can get the benefits of\ncooperation only by conversion. Provided I act as if others have\nweight for long enough, others will take me as giving them weight, and\nso cooperate, whether I really give them weight or not. In many\nsituations, others will neither have the ability to see my true\nmotivation nor care about it.\n\nAnother problem is that conversion can be costly. I might be required\nby my non-egoist morality to make a sacrifice for which I cannot be\ncompensated (or pass up a gain so large that passing it up will not be\ncompensated for). Since I have converted from egoism, I can no longer\nreject making the sacrifice or passing up the gain on the ground that\nit will not pay. It is safer, and seemingly feasible, to remain an\negoist while cooperating in most cases. If so, ethical egoism and\nstandard moralities will diverge in some cases. (For discussion of the\ncooperation argument, see Frank 1988; Gauthier 1986 ch. 6; Kavka 1984\nand 1986 Part II; Sidgwick 1907 II.V.)\n\nThere is another way to try to show that ethical egoism and standard\nmoral theories do not differ much. One might hold one particular\nobjective theory of self-interest, according to which my welfare lies\nin possessing the virtues required by standard moral theories. This\nrequires an argument to show that this particular objective theory\ngives the right account of self-interest. It also faces a worry for\nany objective theory: objective theories seem implausible as accounts\nof welfare. If, say, all my preferences favor my ignoring the plight\nof others, and these preferences do not rest on false beliefs about\nissues such as the likelihood of receiving help, it seems implausible\n(and objectionably paternalistic) to claim that “really”\nmy welfare lies in helping others. I may have a duty to help others,\nand the world might be better if I helped others, but it does not\nfollow that I am better off by helping others. (For a more optimistic\nverdict on this strategy, noting its roots in Socrates, Plato,\nAristotle, the Stoics, and the British Idealists, see Brink 1997 and\n2003.)\n\nOf course the divergence between ethical egoism and standard moral\ntheories need not bother an ethical egoist. An ethical egoist sees\negoism as superior to other moral theories. Whether it is superior\ndepends on the strength of the arguments for it. Two arguments are\npopular.\n\nFirst, one might argue for a moral theory, as one argues for a\nscientific theory, by showing that it best fits the evidence. In the\ncase of moral theories, the evidence is usually taken to be our most\nconfident common-sense moral judgments. Egoism fits many of these,\nsuch as the requirements of cooperation in ordinary cases. It fits\nsome judgments better than utilitarianism does. For example, it allows\none to keep some good, such as a job, for oneself, even if giving the\ngood to someone else would help him slightly more, and it captures the\nintuition that I need not let others exploit me. The problem is that,\nas the discussion of the cooperation argument shows, it also fails to\nfit some of the confident moral judgments we make.\n\nSecond, one might argue for a moral theory by showing that it is\ndictated by non-moral considerations -- in particular, by facts about\nmotivation. It is commonly held that moral judgments must be\npractical, or capable of motivating those who make them. If\npsychological egoism were true, this would restrict moral judgments to\nthose made by egoism. Other moral judgments would be excluded since it\nwould be impossible to motivate anyone to follow them.\n\nOne problem with this argument is that psychological egoism seems\nfalse. Replacing psychological with predominant egoism loses the key\nclaim that it is impossible to motivate anyone to make an\nuncompensated sacrifice.\n\nThe ethical egoist might reply that, if predominant egoism is true,\nethical egoism may require less deviation from our ordinary actions\nthan any standard moral theory. But fit with motivation is hardly\ndecisive; any normative theory, including ethical egoism, is intended\nto guide and criticize our choices, rather than simply endorse\nwhatever we do. When I make an imprudent choice, this does not count\nagainst ethical egoism, and in favor of a theory recommending\nimprudence.\n\nThe argument has other problems. One could deny that morality must be\npractical in the required sense. Perhaps morality need not be\npractical at all: we do not always withdraw moral judgments when we\nlearn that the agent could not be motivated to follow them. Or perhaps\nmoral judgments must be capable of motivating not just anyone, but\nonly idealized versions of ourselves, free from (say) irrationality.\nIn this case, it is insufficient to describe how we are motivated;\nwhat is relevant is a description of how we would be motivated were we\nrational.\n\nFinally, if I do not believe that some action is ultimately in my\nself-interest, it follows from psychological egoism that I cannot aim\nto do it. But say I am wrong: the action is in my self-interest.\nEthical egoism then says that it is right for me to do something I\ncannot aim to do. It violates practicality just as any other moral\ntheory does.\n\nSo far a number of arguments for ethical egoism have been considered.\nThere are a number of standard arguments against it.\n\nG. E. Moore argued that ethical egoism is self-contradictory. If I am\nan egoist, I hold that I ought to maximize my good. I deny that others\nought to maximize my good (they should maximize their own goods). But\nto say that x is “my good” is just to say that my\npossessing x is good. (I cannot possess the goodness.) If my\npossession of x is good, then I must hold that others ought\nto maximize my possession of it. I both deny and am committed to\naffirming that others ought to maximize my good. (Sometimes Moore\nsuggests instead that “my good” be glossed as\n“x is good and x is mine.” This does not\nyield the contradiction above, since it does not claim that my\npossession of x is good. But it yields a different\ncontradiction: if x is good, everyone ought to maximize it\nwherever it appears; egoists hold that I ought to maximize x\nonly when it appears in me.)\n\nOne reply is that egoism can be stated without using “my\ngood.” The egoist can hold (as Sidgwick usually does) that she\nought to maximize her happiness or self-interest (Prichard 2002:\n176).\n\nAnother reply is that one might keep “my good” but deny\nthat if my possessing x is good, others ought to maximize my\npossession of it. C. D. Broad writes that the egoist can hold that\n“equally pleasant states of mind are equally good things, no\nmatter whose states of mind they may be. But...each of us is properly\nconcerned, not with all good things, but only with a certain\nrestricted class of good things, viz., those which are states of his\nown mind” (Broad 1930: 243; also Broad 1942: 44–6, 1971c:\n347–50, Prichard 2002: 217, Ewing 1965: 33). As Broad notes,\nthis sort of position is not unique to egoists; deontologists also\ndeny that one ought always maximize the good.\n\nThere is another way to deny that if my possessing x is good,\nothers ought to maximize my possession of it. One might hold that\n“my good” should not be analyzed in terms of what Moore\ncalls “good absolutely” but rather is a distinct concept,\ngood-for-me, linked only to agent-relative reasons (Mackie 1976, Smith\n2003). It does not follow from “my possession of x is\ngood-for-me” that others ought to maximize what is\ngood-for-me.\n\nMoore also suggests that the reason for me to pursue my good is the\ngoodness of the thing I obtain. If what I obtain is good, then there\nis reason for everyone to pursue it, not just in me, but anywhere.\nAgain, moving to good-for-me avoids this consequence. But something\nclose to this argument is plausible, especially for some bad things.\nOne might argue that it is the way my pain feels — its badness\n— and not any connection between me and the pain that gives me\nreason to alleviate it. If so, I have reason to alleviate the pain of\nothers (Nagel 1986, Rachels 2002). (This argument can be directed\nagainst rational egoism as well.)\n\nA second argument against ethical egoism was made by H. A. Prichard.\nHe argues that self-interest is the wrong sort of reason. I do not,\nfor example, think the reason I have a duty to help a drowning child\nis that helping benefits me (Prichard 2002 1, 9, 26, 29, 30, 122, 123,\n171, 188). Similarly, Prichard chastises Sidgwick for taking seriously\nthe view that there is “a duty...to do those acts which\nwe think will lead to our happiness” (Prichard 2002 135).\n\nThis may be convincing when “duty” means “moral\nduty.” It is less convincing when, as Prichard also thinks, the\nissue is simply what one ought to do. He takes there to be only one\nsense of “ought,” which he treats as “morally\nought.” Any other “ought” is treated as really\nmaking the non-normative claim that a certain means is efficient for\nattaining a certain end. But ethical egoism can be seen as making\ncategorical and normative ought-claims. And the historical popularity\nof ethical or rational egoism (see Crisp 2019), which Prichard so\noften notes, indicates that self-interest is not obviously irrelevant\nto what one ought to do.\n\nA third argument, like Moore’s, claims that ethical egoism is\ninconsistent in various ways. Say ethical egoism recommends that\nA and B both go to a certain hockey game, since\ngoing to the game is in the self-interest of each. Unfortunately, only\none seat remains. Ethical egoism, then, recommends an impossible state\nof affairs. Or say that I am A and an ethical egoist. I both\nclaim that B ought to go to the game, since that is in her\nself-interest, and I do not want B to go to the game, since\nB’s going to the game is against my self-interest.\n\nAgainst the first inconsistency charge, the ethical egoist can reply\nthat ethical egoism provides no neutral ranking of states of affairs.\nIt recommends to A that A go to the game, and to\nB that B go to the game, but is silent on the value\nof A and B both attending the game.\n\nAgainst the second inconsistency charge, the ethical egoist can claim\nthat she morally recommends that B go to the game, although\nshe desires that B not go. This is no more odd than claiming\nthat my opponent in a game would be wise to adopt a particular\nstrategy, while desiring that he not do so. True, the ethical egoist\nis unlikely to recommend ethical egoism to others, to blame others for\nviolations of what ethical egoism requires, to justify herself to\nothers on the basis of ethical egoism, or to express moral attitudes\nsuch as forgiveness and resentment. These publicity worries may\ndisqualify ethical egoism as a moral theory, but do not show\ninconsistency.\n\nA fourth argument against ethical egoism is just that: ethical egoism\ndoes not count as a moral theory. One might set various constraints on\na theory’s being a moral theory. Many of these constraints are\nmet by ethical egoism — the formal constraints, for example,\nthat moral claims must be prescriptive and universalizable. Ethical\negoism issues prescriptions — “do what maximizes your\nself-interest” — and it issues the same prescriptions for\npeople in relevantly similar situations. But other constraints are\nproblematic for ethical egoism: perhaps a moral theory must sometimes\nrequire uncompensated sacrifices; or perhaps it must supply a single,\nneutral ranking of actions that each agent must follow in cases where\ninterests conflict; or perhaps it must respect principles such as\n“that I ought to do x is a consideration in favor of\nothers not preventing me from doing x;” or perhaps it\nmust be able to be made public in the way, just noted, that ethical\negoism cannot. (For sample discussions of these two objections, see\nBaier 1958 189–191; Campbell 1972; Frankena 1973 18–20;\nKalin 1970.)\n\nThe issue of what makes for a moral theory is contentious. An ethical\negoist could challenge whatever constraint is deployed against her.\nBut a neater reply is to move to rational egoism, which makes claims\nabout what one has reason to do, ignoring the topic of what is morally\nright. This gets at what ethical egoists intend, while skirting the\nissue of constraints on moral theories. After all, few if any ethical\negoists think of egoism as giving the correct content of morality,\nwhile also thinking that what they have most reason to do is\ndetermined by some non-egoist consideration. One could then, if one\nwished, argue for ethical egoism from rational egoism and the\nplausible claim that the best moral theory must tell me what I have\nmost reason to do.\n3. Rational Egoism\n\nRational egoism claims that I ought to perform some action if and only\nif, and because, performing that action maximizes my self-interest.\n(As with ethical egoism, there are variants which drop maximization or\nevaluate rules or character traits rather than actions. There are also\nvariants which make the maximization of self-interest necessary but\nnot sufficient, or sufficient but not necessary, for an action to be\nthe action I ought to perform. Again, I set these issues aside.)\nRational egoism makes claims about what I ought, or have reason, to\ndo, without restricting the “ought” or\n“reason” to a moral “ought” or\n“reason.” \n\nLike ethical egoism, rational egoism needs arguments to support it.\nOne might cite our most confident judgments about rational action and\nclaim that rational egoism best fits these. The problem is that our\nmost confident judgments about rational action seem to be captured by\na different, extremely popular theory — the instrumental theory\nof rationality. According to the instrumental theory, I ought to\nperform some action if and only if, and because, performing that\naction maximizes the satisfaction of my preferences. Since\npsychological egoism seems false, it may be rational for me to make an\nuncompensated sacrifice for the sake of others, for this may be what,\non balance, best satisfies my (strong, non-self-interested)\npreferences. This conflict with the instrumental theory is a major\nproblem for rational egoism.\n\nThe rational egoist might reply that the instrumental theory is\nequally a problem for any standard moral theory that claims to give an\naccount of what one ought rationally, or all things considered, to do.\nIf, for example, a utilitarian claims that I have most reason to give\nto charity, since that maximizes the general happiness, I could object\nthat giving to charity cannot be rational given my particular\npreferences, which are for things other than the general\nhappiness.\n\nA different problem for rational egoism is that it appears arbitrary.\nSuppose I claim that I ought to maximize the welfare of blue-eyed\npeople, but not of other people. Unless I can explain why blue-eyed\npeople are to be preferred, my claim looks arbitrary, in the sense\nthat I have given no reason for the different treatments. As a\nrational egoist, I claim that I ought to maximize the welfare of one\nperson (myself). Unless I can explain why I should be preferred, my\nclaim looks equally arbitrary.\n\nOne reply is to argue that non-arbitrary distinctions can be made by\none’s preferences. Say I like anchovies and hate broccoli. This\nmakes my decision to buy anchovies rather than broccoli non-arbitrary.\nSimilarly, my preference for my own welfare makes my concentration on\nmy own welfare non-arbitrary.\n\nThere are two problems for this reply.\n\nFirst, we do not always take preferences to establish non-arbitrary\ndistinctions. If I defend favoring blue-eyed people simply by noting\nthat I like blue-eyed people, without any justification for my liking,\nthis seems unsatisfactory. The rational egoist must argue that hers is\na case where preferences are decisive.\n\nSecond, if psychological egoism is false, I might lack a preference\nfor my own welfare. It would follow that for me, a distinction between\nmy welfare and that of others would be arbitrary, and the rational\negoist claim that each ought to maximize his own welfare would be\nunjustified when applied to me. The proposal that preferences\nestablish non-arbitrary distinctions supports the instrumental theory\nbetter than rational egoism.\n\nAnother reply to the arbitrariness worry is to claim that certain\ndistinctions just are non-arbitrary. Which distinctions these are is\nrevealed by looking at whether we ask for justifications of the\nrelevance of the distinction. In the case of my maximizing of the\nwelfare of the blue-eyed, we do ask for a justification; we do not\ntake “because they’re blue-eyed” as an adequate\ndefense of a reason to give to the blue-eyed. In the case of my\nmaximizing my own welfare, however, “because it will make me\nbetter off” may seem a reasonable justification; we do not\nquickly ask “why does that matter?”\n\nIn a much-quoted passage, Sidgwick claimed that rational egoism is not\narbitrary: “It would be contrary to Common Sense to deny that\nthe distinction between any one individual and any other is real and\nfundamental, and that consequently ‘I’ am concerned with\nthe quality of my existence as an individual in a sense, fundamentally\nimportant, in which I am not concerned with the quality of the\nexistence of other individuals: and this being so, I do not see how it\ncan be proved that this distinction is not to be taken as fundamental\nin determining the ultimate end of rational action for an\nindividual” (Sidgwick 1907, 498). This can be interpreted in\nvarious ways (Shaver 1999, 82–98; Shaver 2020; Phillips 2011,\nch. 5).\n\nOn the most natural interpretation, Sidgwick is noting various\nnon-normative facts. I have a distinct history, memories, and perhaps\nspecial access to my mental contents. But it is not clear how these\nfacts support the normative conclusion Sidgwick draws. Utilitarians,\nfor example, agree about these facts. (Some of the facts may also not\ngive the sharp distinction Sidgwick wants. I may usually know more\nabout my pain than yours, but this difference seems a matter of\ndegree.)\n\nSidgwick might instead be claiming that attacks on rational egoism\nfrom certain views of personal identity fail because they rest on a\nfalse view of personal identity. He might have in mind Humean views\n(as in Parfit, discussed below). Perhaps more likely, he might have in\nmind Schopenhauer’s view — which Schopenhauer deploys\nagainst egoism — that there is a “real identity of any one\nego with all others” (Sidgwick 1896: 281; Schopenhauer 1965:\n204–7). (Schopenhauer thinks this follows from Kant’s view\nthat space and time belong only to appearances.) But this would only\ndefend a presupposition of rational egoism — that there are\nseparate individuals. It would not follow that the distinction between\nthem matters.\n\nFinally, Sidgwick might be claiming that my point of view, like an\nimpartial point of view, is non-arbitrary. But there are other points\nof view, such as that of my species, family or country. Sidgwick finds\nthem arbitrary. It is hard to see why my point of view, and an\nimpartial point of view, are non-arbitrary, while anything in between\nis arbitrary. For example, in favour of my point of view, Sidgwick\ncould note that I am an individual rather than a hive-member.\nBut I am a member of various groups as well. And if my being an\nindividual is important, this cuts against the importance of taking up\nan impartial point of view just as it cuts against the importance of\ntaking up the point of view of various groups. Similarly, if the\nimpartial point of view is defended as non-arbitrary because it makes\nno distinctions, both the point of view of various groups and my\nindividual point of view are suspect.\n\nDebate over rational egoism was revitalized by Parfit 1984 pts.\nII-III. Parfit gives two main arguments against rational egoism. Both\nfocus on the rational egoist’s attitude toward the future: the\nrational egoist holds that the time at which some good comes is by\nitself irrelevant, so that, for example, I ought to sacrifice a small\npresent gain for a larger future gain.\n\nFirst, one could challenge rational egoism, not only with the\ninstrumental theory, but also with the “present-aim”\ntheory of rationality. According to the present-aim theory, I have\nmost reason to do what maximizes the satisfaction of my present\ndesires. Even if all of these desires are self-regarding, the\npresent-aim theory need not coincide with rational egoism. Suppose I\nknow that in the future I will desire a good pension, but I do not now\ndesire a good pension for myself in the future; I have different\nself-regarding desires. Suppose also that, looking back from the end\nof my life, I will have maximized my welfare by contributing now to\nthe pension. Rational egoism requires that I contribute now. The\npresent-aim theory does not. It claims that my reasons are relative\nnot only to who has a desire — me rather than someone else\n— but also to when the desire is held — now rather than in\nthe past or future. The obvious justification an egoist could offer\nfor not caring about time — that one should care only about the\namount of good produced — is suicidal, since that should\nlead one not to care about who receives the good. One reason the\npresent-aim theory is important is that it shows there is a coherent,\nmore minimal alternative to rational egoism. The rational egoist\ncannot argue that egoism is the most minimal theory, and that standard\nmoral theories, by requiring more of people, require special,\nadditional justification. (For a very different argument to show again\nthat an alternative to morality is less minimal than expected —\ndirected more at the instrumental theory than rational egoism —\nsee Korsgaard 2005.)\n\nSecond, rational egoism might be challenged by some views of personal\nidentity. Say half of my brain will be transplanted to another body\nA. My old body will be destroyed. A will have my\nmemories, traits, and goals. It seems reasonable for me to care\nspecially about A, and indeed to say that A is\nidentical to me. Now say half of my brain will go in B and\nhalf in C. Again B and C will have my\nmemories, traits, and goals. It seems reasonable for me to care\nspecially about B and C. But B and\nC cannot be identical to me, since they are not identical to\none another (they go on to live different lives). So the ground of my\ncare is not identity, but rather the psychological connections through\nmemories, etc. Even in the case of A, what grounds my care\nare these connections, not identity: my relation to A is the\nsame as my relation to B (or C), so what grounds my\ncare about A grounds my care about B (or C)\n— and that cannot be identity. (To make the point in a different\nway — I would not take steps to ensure that only one of\nB and C come about.) If so, I need not care\nspecially about some of my future selves, since they will not have\nthese connections to me. And I do have reason to care specially about\nother people who bear these connections to me now.\n\nOne worry is that psychological continuity might substitute for\nidentity. Say F1 and F2 are\npsychologically connected because (for example)\nF2 has a memory of F1’s\nexperiences. Suppose that F3 has a memory of\nF2’s experiences but no memory of\nF1. F1 and\nF3 are psychologically continuous, though\nnot psychologically connected. (Parfit’s view is that\npsychological connection and continuity both ground special care, if\nspecial care is grounded at all.) In the cases above, A,\nB and C are continuous with me. An egoist might\nclaim that continuity alone matters for special care; that fits the\ncases. If so, I do have reason to care specially about all of the\nfuture selves I am continuous with, and do not have this reason to\ncare specially about others with whom I am not continuous. (For this\nand other worries about Parfit, see Brink 1992, Johnston 1997, Hills\n2010 111–116.)\n\nParfit could reply that continuity might not suffice for special care.\nIt is not clear that F1 has reason to care\nspecially about F3 — F3\nmight seem a stranger, perhaps even an unlikeable one. When young,\nsome worry about becoming someone they would not now like. They see no\nreason for special care for this future person. This worry makes\nsense, but if continuity were sufficient for special care, it would\nnot. If so, perhaps both continuity and connection, or perhaps\ncontinuity and admirability, are needed. This would let Parfit keep\nthe conclusion that I need not care specially for some of my future\nselves, but would not justify the conclusion that I have reason to\ncare specially about other people who are merely connected to me now\n(or are merely admirable).\n\nA worry is that some do care specially about merely continuous future\nselves. With opposed intuitions about when special care is due, the\ntactic of arguing from intuitions about special care to the grounds of\nthis care is indecisive.\n\nThere is a much simpler argument. Prichard argued that self-interest\ndoes not give a reason. This might be convincing if\n“reason” means “moral reason.” It is not\nconvincing against a rational egoist, whose reasons are\n“flavourless” (see previous section). But Prichard’s\nargument might be improved. Suppose, unlike Prichard, we admit reasons\nthat are not specifically moral (or think there are moral reasons to\nbenefit oneself). The egoist still holds a counter-intuitive position.\nAs A. C. Ewing notes, the egoist thinks there is only one sort of\nreason. The egoist denies, for example, that, by itself, the fact that\nthe child will otherwise drown gives me any reason to save her. The\negoist denies that, by itself, the fact that I have made a promise\ngives me any reason to keep it. Even if I have reason to do what\npromotes my self-interest, most think I have other reasons as well.\nThe egoist needs to explain why this is not so (Ewing 1965: 28; Shaver\n2022).\n\nOne might object to Prichard-style arguments that (a) they are\nquestion-begging, since egoists will hardly agree that my reason for\nhelping is something other than the benefit to me, and (b) given\ndisagreement over this claim about my reason, the appropriate response\nis to suspend judgment about it. Alison Hills, in 2010 parts II and\nIII, replies to (a) that moralists can assure themselves by giving\narguments that start from premises like [H] “I have a reason to\nhelp regardless of whether doing so contributes to my\nself-interest,” provided [H] is not inferred from the falsity of\nrational egoism — perhaps it is self-evident (see also Rachels\n1974). In reply to (b), she argues that disagreement over [H] does not\nrequire moralists to suspend judgment about it, although disagreement\nover an egoistic premiss like “I have reason to help only\nbecause doing so benefits me” does require egoists to suspend\njudgment. The difference, she argues, is that rational egoists (like\nothers making non-moral claims) aim at knowledge, and for putative\nknowledge, in cases of disagreement between epistemic peers,\nsuspension of belief is required. If we disagree, and both of us know\nthat one of us is no more likely to be right than the other, we should\neach suspend belief. Moralists, Hills argues, have a different aim:\nthey aim primarily not at knowledge but at the ability to draw, on\ntheir own, true moral conclusions from the evidence. She takes this to\nbe supported by the thought that moral worth requires this ability.\nSince aiming at this ability requires not giving weight to the\nconclusions of others, suspension of belief in cases of disagreement\nis not required of moralists.\n\nObviously, much here depends on the claim about the aim of moralists.\nOne might object that moralists care much more about getting true\nmoral conclusions than about arriving at them on their own. If I could\nguarantee that I do the right act by relying on a Moral Answers\nMachine (and not otherwise), I ought to do so. In addition, since\nmoralists do want true moral conclusions, and peer disagreement is\nrelevant to pursuing truth (see the entry on\n disagreement),\n Hills’ moralists both need and cannot (by one means) pursue\ntruth.\n\nThere is another recent argument against rational egoism (Rachels and\nAlter 2005, Tersman 2008, and especially de Lazari-Radek and Singer\n2014). (1) Believing that rational egoism is true increases my\nreproductive fitness, whether or not rational egoism is true. (2)\nTherefore my belief that rational egoism is true (or, better, that\nrational egoism appears to me true upon reflection) does not help to\njustify rational egoism, since I would have that belief whether or not\nrational egoism is true. (3) For some other normative beliefs (such as\nbelief in utilitarianism), having the belief does not increase\nreproductive fitness. (4) Therefore my belief that (say)\nutilitarianism is true can help justify utilitarianism. (Without (3)\nand (4), there is no argument against rational egoism in\nparticular.)\n\nHere I put aside general objections to evolutionary debunking\narguments (see, for example, Shafer-Landau 2012 or Schafer 2010). I\nalso put aside the possibility of debunking arguments that would\ntarget the impartiality of utilitarianism (Andes 2019).\n\nOne worry is that what best increases reproductive fitness is acting\nas a kin altruist rather than as a rational egoist (Crisp 2012, Other\nInternet Resources). Presumably, then, it is believing that I ought to\nact as a kin altruist, rather than as a rational egoist, that best\nincreases my reproductive fitness. (If there is a tie between what\nincreases reproductive fitness and belief, and believing that rational\negoism is true is best for reproductive fitness, one would expect many\nto believe that rational egoism is true. But very few do, while many\nendorse Broad’s “self-referential altruism” (Broad\n1971b).) De Lazari-Radek and Singer reply that the recommendations of\nrational egoism are very close to those of kin altruism, and much\ncloser to those of kin altruism than are the recommendations of\nutilitarianism (2014 194). But rational egoism and kin altruism do\nmake opposed recommendations. For example, kin altruism might\nrecommend that I sacrifice myself for my family, whether I care about\nthem or not, whereas rational egoism would recommend sacrifice only if\nmy welfare were to be higher were I to sacrifice and die rather than\nnot sacrifice and live. It is also hard to think of a plausible\nargument which has kin altruism as a premiss and rational egoism as\nthe conclusion, so doubts about kin altruism do not seem to undercut\narguments for rational egoism. Nor is it clear how noting a difference\nin the closeness of recommendations justifies concluding that rational\negoism is debunked and utilitarianism not debunked.\n\nAnother worry is that if my belief that I have reason to care about my\nown well-being is unjustified, an argument that starts with that\nreason as a premiss, and then adds that the focus on my own well-being\nis arbitrary and so should be broadened to include everyone, is\nundercut. One might reply (with de Lazari-Radek and Singer 2014 191)\nthat there are other ways of arriving at the conclusion that I have\nreason to care about the well-being of everyone. Perhaps something\nlike utilitarianism is justified as self-evident rather than inferred\nfrom some other reasons. The evolutionary argument targets conclusions\nthat can be reached only by appeal to a belief whose support\ncan be undercut by noting that we would have the belief whether or not\nit is true. It is then open to the rational egoist to say that there\nis some other way of arriving at rational egoism. Perhaps this is\nunpromising, since the obvious way to justify rational egoism, as\nself-evident, is to be undercut by (1) and (2). However, (i) if\nbelieving that one ought to act as a kin altruist rather than as a\nrational egoist is what best increases reproductive fitness, rational\negoism is, like utilitarianism, not undercut by (1) and (2). (ii) A\ncomponent of utilitarianism (and any plausible theory), the belief\nthat pain is bad, seems to be a belief that best increases\nreproductive fitness whether or not it is true (see Kahane 2011 and\n2014; for some replies, see Bramble 2017 and Jaquet 2018). Even if\nnothing is good or bad, believing that pain is bad might increase my\nmotivation to avoid pain and so lead me to survive longer.\n\nA further worry is that it is not clear that having the belief\nbest increases reproductive fitness. De Lazari-Radek and Singer argue,\nin reply to the objection that their argument takes away the\njustification for believing that pain is bad, that there is no\nadvantage to believing that pain is bad; I am sufficiently motivated\nto avoid pain without any such belief (de Lazari-Radek and Singer 2014\n268–269; for the general point, see Parfit 2011 v. 2\n527–30). The same seems to go for rational egoism: I am\nsufficiently motivated to act egoistically without any belief in the\ntruth of rational egoism.\n4. Conclusion\n\nProspects for psychological egoism are dim. Even if some version\nescapes recent empirical arguments, there seems little reason, once\nthe traditional philosophical confusions have been noted, for thinking\nit is true. At best it is a logical possibility, like some forms of\nscepticism.\n\nEthical egoists do best by defending rational egoism instead.\n\nRational egoism faces objections from arbitrariness, Nagel and\nRachels, Parfit, Ewing, and evolutionary debunking. These worries are\nnot decisive. Given this, and given the historical popularity of\nrational egoism, one might conclude that it must be taken seriously.\nBut there is at least reason to doubt the historical record. Some\nphilosophers stressed the connection between moral action and\nself-interest because they were concerned with motivation. It does not\nfollow that self-interest is for them a normative standard. And many\nphilosophers may have espoused rational egoism while thinking that God\nensured that acting morally maximized one’s self-interest. (Some\nwere keen to stress that virtue must pay in order to give God a\nrole.) Once this belief is dropped, it is not so clear what they would\nhave said (Shaver 1999 ch. 4; see also Crisp 2019).\n",
    "bibliography": {
        "categories": [
            "Psychological Egoism",
            "Ethical Egoism",
            "Rational Egoism"
        ],
        "cat_ref_text": {
            "Psychological Egoism": [
                "</h3>\n<ul class=\"hanging\">",
                "Batson, C. D., 1991, <em>The Altruism Question</em>, Hillsdale, N.\nJ.: Lawrence Erlbaum Associates, part III.",
                "–––, 2011, <em>Altruism in Humans</em>, Oxford: Oxford\nUniversity Press, part II.",
                "Broad, C. D., 1971a, “Egoism as a Theory of Human\nMotives,” in Broad, <em>Broad’s Critical Essays in Moral\nPhilosophy</em>, London: George Allen and Unwin.",
                "Brunero, J. S., 2002, “Evolution, Altruism and\n‘Internal Reward’ Explanations,”, <em>Philosophical\nForum</em>, 33: 413–24.",
                "Butler, J., 1900, <em>Fifteen Sermons Preached at the Rolls\nChapel</em>, in <em>The Works of Bishop Butler</em>, ed. J. H.\nBernard, London: Macmillan, Sermons I and XI.",
                "Feinberg, J., 1978 “"
            ],
            "Ethical Egoism": [
                ",” in\nFeinberg, <em>Reason and Responsibility</em>, fourth edition (and\nother editions), Belmont: Wadsworth.",
                "Hume, D., 1975, <em>An Enquiry Concerning the Principles of\nMorals</em>, in <em>Enquiries</em>, ed. L. A. Selby-Bigge and P. H.\nNidditch, Oxford: Oxford University Press, Appendix II.",
                "Kavka, G., 1986, <em>Hobbesian Moral and Political Theory</em>,\nPrinceton: Princeton University Press, 35–44, 51–64.",
                "LaFollette, H., 1988, “The Truth in Psychological\nEgoism,” in J. Feinberg, <em>Reason and Responsibility</em>,\nseventh edition, Belmont: Wadsworth.",
                "May, J., 2011a, “Relational Desires and Empirical Evidence\nagainst"
            ],
            "Rational Egoism": [
                ",” <em>European Journal of\nPhilosophy</em>, 19: 39–58.",
                "–––, 2011b, “Egoism, Empathy, and Self-Other\nMerging,” <em>Southern Journal of Philosophy</em> (Spindel\nSupplement), 49: 25–39.",
                "Mercer, M., 2001, “In Defense of Weak Psychological\nEgoism,” <em>Erkenntnis</em>, 55: 217–37.",
                "Rosas, A., 2002, “Psychological and Evolutionary Evidence\nfor Altruism,” <em>Biology and Philosophy</em>, 17:\n93–107.",
                "Schulz, A., 2011, “Sober and Wilson’s Evolutionary\nArguments for Psychological Altruism: A Reassessment,”\n<em>Biology and Philosophy</em>, 26: 251–60.",
                "Sidgwick, H., 1907, <em>The Methods of Ethics</em>, Indianapolis:\nHackett, seventh edition, 1981, I.IV.",
                "Slote, M. A., 1964, “An Empirical Basis for Psychological\nEgoism,” <em>Journal of Philosophy</em>, 61: 530–537.",
                "Slote, M. A., 2013, “Egoism and Emotion,”\n<em>Philosophia</em>, 41: 313–35.",
                "Sober, E., and D. S. Wilson, 1998, <em>Unto Others</em>,\nCambridge, MA: Harvard University Press, ch. 10.",
                "Stich, S., J. M. Doris, E. Roedder, 2010, “Altruism,”\nin <em>The Moral Psychology Handbook</em>, ed. Doris, New York:\nOxford, 147–205.\n</ul>\n<h3>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3>Psychological Egoism</h3>\n<ul class=\"hanging\">\n<li>Batson, C. D., 1991, <em>The Altruism Question</em>, Hillsdale, N.\nJ.: Lawrence Erlbaum Associates, part III.</li>\n<li>–––, 2011, <em>Altruism in Humans</em>, Oxford: Oxford\nUniversity Press, part II.</li>\n<li>Broad, C. D., 1971a, “Egoism as a Theory of Human\nMotives,” in Broad, <em>Broad’s Critical Essays in Moral\nPhilosophy</em>, London: George Allen and Unwin.</li>\n<li>Brunero, J. S., 2002, “Evolution, Altruism and\n‘Internal Reward’ Explanations,”, <em>Philosophical\nForum</em>, 33: 413–24.</li>\n<li>Butler, J., 1900, <em>Fifteen Sermons Preached at the Rolls\nChapel</em>, in <em>The Works of Bishop Butler</em>, ed. J. H.\nBernard, London: Macmillan, Sermons I and XI.</li>\n<li>Feinberg, J., 1978 “Psychological Egoism,” in\nFeinberg, <em>Reason and Responsibility</em>, fourth edition (and\nother editions), Belmont: Wadsworth.</li>\n<li>Hume, D., 1975, <em>An Enquiry Concerning the Principles of\nMorals</em>, in <em>Enquiries</em>, ed. L. A. Selby-Bigge and P. H.\nNidditch, Oxford: Oxford University Press, Appendix II.</li>\n<li>Kavka, G., 1986, <em>Hobbesian Moral and Political Theory</em>,\nPrinceton: Princeton University Press, 35–44, 51–64.</li>\n<li>LaFollette, H., 1988, “The Truth in Psychological\nEgoism,” in J. Feinberg, <em>Reason and Responsibility</em>,\nseventh edition, Belmont: Wadsworth.</li>\n<li>May, J., 2011a, “Relational Desires and Empirical Evidence\nagainst Psychological Egoism,” <em>European Journal of\nPhilosophy</em>, 19: 39–58.</li>\n<li>–––, 2011b, “Egoism, Empathy, and Self-Other\nMerging,” <em>Southern Journal of Philosophy</em> (Spindel\nSupplement), 49: 25–39.</li>\n<li>Mercer, M., 2001, “In Defense of Weak Psychological\nEgoism,” <em>Erkenntnis</em>, 55: 217–37.</li>\n<li>Rosas, A., 2002, “Psychological and Evolutionary Evidence\nfor Altruism,” <em>Biology and Philosophy</em>, 17:\n93–107.</li>\n<li>Schulz, A., 2011, “Sober and Wilson’s Evolutionary\nArguments for Psychological Altruism: A Reassessment,”\n<em>Biology and Philosophy</em>, 26: 251–60.</li>\n<li>Sidgwick, H., 1907, <em>The Methods of Ethics</em>, Indianapolis:\nHackett, seventh edition, 1981, I.IV.</li>\n<li>Slote, M. A., 1964, “An Empirical Basis for Psychological\nEgoism,” <em>Journal of Philosophy</em>, 61: 530–537.</li>\n<li>Slote, M. A., 2013, “Egoism and Emotion,”\n<em>Philosophia</em>, 41: 313–35. </li>\n<li>Sober, E., and D. S. Wilson, 1998, <em>Unto Others</em>,\nCambridge, MA: Harvard University Press, ch. 10.</li>\n<li>Stich, S., J. M. Doris, E. Roedder, 2010, “Altruism,”\nin <em>The Moral Psychology Handbook</em>, ed. Doris, New York:\nOxford, 147–205.</li>\n</ul>\n<h3>Ethical Egoism</h3>\n<ul class=\"hanging\">\n<li>Baier, K., 1958, <em>The Moral Point of View</em>, Ithaca:\nCornell.</li>\n<li>Brink, D., 1997, “Self-love and Altruism,” <em>Social\nPhilosophy and Policy</em>, 14: 122–157.</li>\n<li>Brink, D., 2003, <em>Perfectionism and the Common Good: Themes in\nthe Philosophy of T. H. Green</em>, Oxford: Oxford University\nPress.</li>\n<li>Broad, C. D., 1930, <em>Five Types of Ethical Theory</em>, London:\nRoutledge and Kegan Paul.</li>\n<li>Broad, C. D., 1942, “Certain Features of Moore’s\nEthical Doctrines,” in <em>The Philosophy of G. E. Moore</em>,\ned. P. Schilpp, New York: Tudor, 41–67.</li>\n<li>Broad, C. D., 1971c, “G. E. Moore’s Latest Published\nViews on Ethics,” in Broad, <em>Broad’s Critical Essays in\nMoral Philosophy</em>, London: George Allen and Unwin.</li>\n<li>Burgess-Jackson, K., 2013, “Taking Egoism Seriously,”\n<em>Ethical Theory and Moral Practice</em>, 16: 529–42.</li>\n<li>Campbell, R., 1972, “A Short Refutation of Ethical\nEgoism,” <em>Canadian Journal of Philosophy</em>, 2:\n249–54.</li>\n<li>Crisp, R., 2019, <em>Sacrifice Regained: Morality and\nSelf-Interest in British Moral Philosophy from Hobbes to Bentham</em>,\nOxford: Oxford University Press.</li>\n<li>Frank, R. H., 1988, <em>Passions Within Reason</em>, New York:\nNorton.</li>\n<li>Frankena, W. K., 1973, <em>Ethics</em>, Englewood Cliffs:\nPrentice-Hall.</li>\n<li>Gauthier, D., 1986, <em>Morals By Agreement</em>, Oxford:\nClarendon.</li>\n<li>Hobbes, T., 1968, <em>Leviathan</em>, ed. C. B. Macpherson,\nHarmondsworth: Penguin, chs. 14–15.</li>\n<li>Hurka, T., 2010, “Underivative Duty: Prichard on Moral\nObligation,” <em>Social Philosophy and Policy</em>, 27 (2):\n111–134.</li>\n<li>Kalin, J., 1970, “In Defense of Egoism,” in D.\nGauthier, <em>Morality and Rational Self-Interest</em>, Englewood\nCliffs: Prentice-Hall.</li>\n<li>Kavka, G., 1984, “The Reconciliation Project,” in\n<em>Morality, Reason, and Truth</em>, ed. D. Copp and D. Zimmerman,\nTotowa: Rowman and Allanheld.</li>\n<li>–––, 1986, <em>Hobbesian Moral and Political\nTheory</em> (Part II), Princeton: Princeton University Press.</li>\n<li>Mackie, J. L., 1976, “Sidgwick’s Pessimism,”\n<em>Philosophical Quarterly</em>, 26: 317–27.</li>\n<li>McConnell, T. C. 1978, “The Argument from Psychological\nEgoism to Ethical Egoism,” <em>Australasian Journal of\nPhilosophy</em>, 56: 41–47.</li>\n<li>Moore, G. E., 1903, <em>Principia Ethica</em>, Cambridge:\nCambridge University Press, sec. 59.</li>\n<li>Nagel, T., 1986, <em>The View From Nowhere</em>, New York: Oxford\nUniversity Press, Ch. 8.</li>\n<li>Prichard, H. A., 2002, <em>Moral Writings</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Rachels, S., 2002, “Nagelian Arguments against\nEgoism,” <em>Australasian Journal of Philosophy</em>, 80:\n191–208.</li>\n<li>Sidgwick, H., 1907, <em>The Methods of Ethics</em>, Indianapolis:\nHackett, seventh edition, 1981, II.V and concluding chapter.</li>\n<li>Smith, M., 2003, “Neutral and Relative Value after\nMoore,” <em>Ethics</em>, 113: 576–98.</li>\n</ul>\n<h3>Rational Egoism</h3>\n<ul class=\"hanging\">\n<li>Andes, P., 2019, “Sidgwick’s Dualism of Practical\nReason, Evolutionary Debunking, and Moral Psychology,”\n<em>Utilitas</em>, 31: 361–377. </li>\n<li>Bramble, B., 2017, “Evolutionary Debunking Arguments and Our\nShared History of Pain,” <em>Journal of Ethics and Social\nPhilosophy</em>, 12: 94–101.</li>\n<li>Brink, D., 1992, “Sidgwick and the Rationale for Rational\nEgoism,” in <em>Essays on Henry Sidgwick</em>, ed. B. Schultz,\nCambridge: Cambridge University Press.</li>\n<li>Broad, C. D., 1971b, “Self and Others,” in Broad,\n<em>Broad’s Critical Essays in Moral Philosophy</em>, London:\nGeorge Allen and Unwin.</li>\n<li>Crisp, R., 2019, <em>Sacrifice Regained: Morality and\nSelf-Interest in British Moral Philosophy from Hobbes to Bentham</em>,\nOxford: Oxford University Press.</li>\n<li>Ewing, A. C., 1965, <em>Ethics</em>, New York: Free Press.</li>\n<li>Jaquet, F., 2018, “Evolution and Utilitarianism,”\n<em>Ethical Theory and Moral Practice</em>, 21: 1151–61.</li>\n<li>Johnston, M., 1997, “Human Concerns Without Superlative\nSelves,” in <em>Reading Parfit</em>, ed. J. Dancy, Oxford:\nBlackwell, 149–179.</li>\n<li>Kagan, S., 1986, “The Present-Aim Theory of\nRationality,” <em>Ethics</em>, 96: 746–759.</li>\n<li>Hills, A., 2010, <em>The Beloved Self</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Kahane, G., 2011, “Evolutionary Debunking Arguments,”\n<em>Noûs</em>, 45: 103–25.</li>\n<li>–––, 2014, “Evolution and Impartiality,”\n<em>Ethics</em>, 124: 327–41.</li>\n<li>Korsgaard, C, 2005, “The Myth of Egoism,”, in\n<em>Practical Conflicts: New Philosophical Essays</em>, ed. P. Baumann\nand M. Betzler, Cambridge: Cambridge University Press,\n59–91.</li>\n<li>Lazari-Radek, K. de, and Singer, P., 2014, <em>The Point of View\nof the Universe: Sidgwick and Contemporary Ethics</em>, Oxford: Oxford\nUniversity Press, chapter 7.</li>\n<li>Parfit, D., 1984, <em>Reasons and Persons</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1986, Reply to Kagan, <em>Ethics</em>, 96:\n843–846, 868–869.</li>\n<li>–––, 2011, <em>On What Matters</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Phillips, D., 2011, <em>Sidgwickian Ethics</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Rachels, J., 1974, “Two Arguments Against Ethical\nEgoism,” <em>Philosophia</em>, 4: 297–314.</li>\n<li>Rachels, S. and Alter, T., 2005, “Nothing Matters in\nSurvival,” <em>Journal of Ethics</em>, 9: 311–330.</li>\n<li>Schafer, K., 2010, “Evolution and Normative\nScepticism,” <em>Australasian Journal of Philosophy</em>, 88:\n471–88.</li>\n<li>Schopenhauer, A., 1965, <em>On the Basis of Morality</em>, trans.\nE. F. Payne, Indianapolis: Bobbs-Merrill.</li>\n<li>Shafer-Landau, R., 2012, “Evolutionary Debunking, Moral\nRealism, and Moral Knowledge,” <em>Journal of Ethics and Social\nPhilosophy</em>, 7.1. doi:10.26556/jesp.v7i1.68</li>\n<li>Shaver, R., 1999, <em>Rational Egoism</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 2020, “Sidgwick’s Distinction\nPassage,” <em>Utilitas</em>, 32: 444–453.</li>\n<li> –––, 2022, “The Decline of Egoism,”\n<em>Utilitas</em>, 34: 300–316.</li>\n<li>Sidgwick, H., 1896, <em>Outlines of the History of Ethics,</em>\nLondon: Macmillan.</li>\n<li>–––, 1907, <em>The Methods of Ethics</em>, Indianapolis:\nHackett, seventh edition, 1981, II.I, IV.II, and concluding\nchapter.</li>\n<li>Sterba, J., 2013, <em>From Rationality to Equality</em>, Oxford:\nOxford University Press, ch. 3.</li>\n<li>Tersman, F., 2008, “The Reliability of Moral Intuitions: A\nChallenge from Neuroscience,” <em>Australasian Journal of\nPhilosophy</em>, 86: 389–405.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, General Topics: ethics",
            "Hobbes, Thomas",
            "Hume, David",
            "Moore, George Edward: moral philosophy",
            "moral psychology: empirical approaches",
            "personal identity: and ethics",
            "Plato: shorter ethical works",
            "Prichard, Harold Arthur",
            "prisoner’s dilemma",
            "Rand, Ayn",
            "Sidgwick, Henry",
            "Stoicism",
            "well-being"
        ],
        "entry_link": [
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../hobbes/": "Hobbes, Thomas"
            },
            {
                "../hume/": "Hume, David"
            },
            {
                "../moore-moral/": "Moore, George Edward: moral philosophy"
            },
            {
                "../moral-psych-emp/": "moral psychology: empirical approaches"
            },
            {
                "../identity-ethics/": "personal identity: and ethics"
            },
            {
                "../plato-ethics-shorter/": "Plato: shorter ethical works"
            },
            {
                "../prichard/": "Prichard, Harold Arthur"
            },
            {
                "../prisoner-dilemma/": "prisoner’s dilemma"
            },
            {
                "../ayn-rand/": "Rand, Ayn"
            },
            {
                "../sidgwick/": "Sidgwick, Henry"
            },
            {
                "../stoicism/": "Stoicism"
            },
            {
                "../well-being/": "well-being"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=egoism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/egoism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=egoism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/egoism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=egoism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/egoism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=egoism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/egoism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Crisp, R., 2012,\n <a href=\"http://peasoup.typepad.com/peasoup/2012/12/ethics-discussions-at-pea-soup-katarzyna-de-lazari-radek-and-peter-singer-the-objectivity-of-ethics-1.html\" target=\"other\">Summary of a Discussion at PEA Soup: Katarzyna de Lazari-Radek and Peter Singer, ‘The Objectivity of Ethics and the Unity of Practical Reason’</a>.",
            "<a href=\"http://www.philpapers.org/browse/altruism-and-psychological-egoism/\" target=\"other\">Papers on altruism and psychological egoism</a>,\n at PhilPapers.org."
        ],
        "listed_links": [
            {
                "http://peasoup.typepad.com/peasoup/2012/12/ethics-discussions-at-pea-soup-katarzyna-de-lazari-radek-and-peter-singer-the-objectivity-of-ethics-1.html": "Summary of a Discussion at PEA Soup: Katarzyna de Lazari-Radek and Peter Singer, ‘The Objectivity of Ethics and the Unity of Practical Reason’"
            },
            {
                "http://www.philpapers.org/browse/altruism-and-psychological-egoism/": "Papers on altruism and psychological egoism"
            }
        ]
    }
}