{
    "url": "ethics-it-phenomenology",
    "title": "Phenomenological Approaches to Ethics and Information Technology",
    "authorship": {
        "year": "Copyright © 2017",
        "author_text": "Lucas Introna\n<l.introna@lancaster.ac.uk>",
        "author_links": [
            {
                "mailto:l%2eintrona%40lancaster%2eac%2euk": "l.introna@lancaster.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2017</a> by\n\n<br/>\nLucas Introna\n&lt;<a href=\"mailto:l%2eintrona%40lancaster%2eac%2euk\"><em>l<abbr title=\" dot \">.</abbr>introna<abbr title=\" at \">@</abbr>lancaster<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Feb 19, 2005",
        "substantive revision Thu Jun 29, 2017"
    ],
    "preamble": "\n\nInformation and communication technology (simply referred to as\n‘information technology’ here) is changing many aspects of\nhuman endeavour and existence. This is beyond dispute for most. What\nare contested are the social and ethical implications of these\nchanges. Possible sources of these disputes are the multiple ways in\nwhich one can conceptualize and interpret the information\ntechnology/society interrelationship. Each of these ways of\nconceptualization and interpretation enables one to see the\ninformation technology/society relationship differently and therefore\nconstrue its social and ethical implications in a different manner. At\nthe center of this technology/society interrelationship we find many\ncomplex questions about the nature of the human, the technical,\nagency, autonomy, freedom and much more. This is indeed a vast\nintellectual landscape, which can obviously not be explored here in\nits fullness. This entry is about just one particular perspective on\nthis landscape. It is primarily concerned with the phenomenological\napproach to interpreting information technology and its social and\nethical implications. It should be noted from the start that there is\nnot a unified phenomenological tradition or approach to information\ntechnology in particular, or other phenomena more generally. The\nphenomenological tradition consists of many different approaches that\nshare certain characteristics (certain family resemblances, one might\nsay) but not all. We may however suggest, with Don Ihde (2003,133),\nthat they all accept that “phenomenology investigates the\nconditions of what makes things appear as such [as that which we take\nthem to be].” Differently stated, phenomenology suggests that\nthere is a co-constitutive relationship between us and the phenomena\nwe encounter in our engagement with the world. In this sense\nphenomenologists would suggest that to understand the\ntechnology/society relationship we need to reveal how they\nco-constitute each other—i.e. draw on each other for their\nongoing meaning and sense. We will elaborate more precisely what this\nmeans in\n section 2\n below. However, in order to understand the distinctiveness of the\nphenomenological approach other possible ways of interpreting this\ntechnology/society relationship will also be outlined briefly\nbelow.\n\nIt can be said that information technology has become in a very real\nsense ubiquitous. Most everyday technologies such as elevators,\nautomobiles, microwaves, watches, and so forth depend on\nmicroprocessors for their ongoing operation. Most organizations and\ninstitutions have become reliant on their information technology\ninfrastructure to a lesser or greater degree. Indeed information\ntechnology is seen by many as a cost-efficient way to solve a\nmultitude of problems facing our complex contemporary society. One can\nalmost say that information technology has become construed as the\ndefault technology for solving a whole raft of technical and social\nproblems such as health provision, security, governance, etc. One\ncould also argue that it has become synonymous with society’s\nview of modernization and progress. For most it seems obvious that\ninformation technology has made it possible for humans to continue to\nconstruct increasingly complex systems of coordination and social\nordering—systems without which contemporary society would not be\nable to exist in its present form. To say the least, we, as\ncontemporary human beings, have our manner of being made possible\nthrough a rather comprehensive entanglement with information and\ncommunication technology. Indeed, the economic, organizational and\nsocial benefit of information technology is not widely disputed. The\ndispute is more often about the way information technology is changing\nor transforming the social domain, and in particular, the ethical\ndomain. This dispute is largely centered around different ways of\nconceptualizing and interpreting the nature of our entanglement with\ninformation technology. This debate is not merely an academic debate\nabout different and competing theoretical ‘models.’\nRather, these different ways of conceptualizing it is central to our\nunderstanding of how we go about managing our increasingly entangled\nrelationship with information technology. \n",
    "toc": [
        {
            "#ViewNatuInfoTech": "1. Views on the Nature of Information Technology"
        },
        {
            "#InfoTechArtiTool": "1.1 Information Technology as an Artifact or Tool"
        },
        {
            "#InfoTechSociConsArtiActo": "1.2 Information Technology as Socially Constructed Artifacts and Actors"
        },
        {
            "#InfoTechOngoHoriMeanActi": "1.3 Information Technology as an Ongoing Horizon of Meaning and Action"
        },
        {
            "#PhenApprTech": "2. Phenomenological Approaches to Technology"
        },
        {
            "#FundCritTechAtti": "2.1 A Fundamental Critique of the Technological Attitude"
        },
        {
            "#OrigTechHumaBein": "2.2 Original Technicity and the Human Being"
        },
        {
            "#TechAttiContSociTech": "2.3 The Technological Attitude in Contemporary Society and Technologies"
        },
        {
            "#PostPhenHumaRela": "2.4 A (Post) Phenomenology of the Human/Technology Relationship"
        },
        {
            "#EthiInfoTech": "3. Ethics and Information Technology"
        },
        {
            "#ImpaInfoTechApplEthiTheo": "3.1 The Impact of Information Technology and the Application of Ethical Theory"
        },
        {
            "#PoliInfoTechDiscEthi": "3.2 The Politics of Information Technology and a Disclosive Ethics"
        },
        {
            "#InfoTechEthiOurHumaWayBein": "3.3 Information Technology, Ethics and our Human way of Being"
        },
        {
            "#PhenEthiInfoTechCaseVirt": "4. Phenomenology, Ethics and Information Technology: The Case of Virtuality"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Views on the Nature of Information Technology\n\nIt seems obvious that a world with information technology is somehow\ndifferent from a world without information technology. But what is the\ndifference? Is it a difference of degree (faster, closer, clearer,\netc.) or is it a difference of kind? Does technology shape society or\nsociety shape technology, or both shape each other? What is the nature\nof this shaping? Is it in practices, in ways of thinking, or is it\nmore fundamental? The answers to these questions will obviously\ninfluence the judgements we make about the social and ethical\nimplications of information technology when we consider the policy and\npractical concerns of using information technology in a particular\ndomain (such as commerce, education or government).\n\nThe answers to these questions are also grounded to a large extent in\none’s particular, implicit or explicit, ontology of information\ntechnology itself; what is the nature—way of being—of\ninformation technology as such? Obviously many different ontological\npositions are possible and have emerged. Nevertheless, it may be\nuseful for the purposes of this entry to discern at least two\ncontrasting and prevailing views against which the contribution of\nphenomenology can be rendered visible. The purpose of this section is\nsolely to make the distinctive contribution of phenomenology visible\nrather than being a complete presentation of all possible approaches.\nFor example, obvious omissions from the approaches suggested here are\nthe Marxist or Critical Theory perspective as reflected in the work of\nAndrew Feenberg (1991, 1999), and a poststructuralist perspective as\nreflected in the work of Jean Baudrillard (1983) and Paul Virilio\n(1994). This said, the approaches that are included here are\nreasonably widely held and would as such function as a helpful\ncontrast to the contribution of phenomenology.\n1.1 Information Technology as an Artifact or Tool\n\nThe most common view of information technology is that it is an\nartifact or tool simply available, to use of not to use, in order for\nhumans to achieve their objectives and outcomes. Some of these tools\nmight be very useful and others not. When users (and the term\n‘user’ here is important) take up a tool or artifact (word\nprocessor, mobile phone, etc) it will tend to have an impact on the\nway they do things. For example if I write with a word processor I\nwould tend to have different writing practices than I would with pen\nand paper—for example, with the ‘cutting and\npasting’function of a word processor I can simply type out my\nideas and then reorder them later without being preoccupied with the\ncomposition of the whole from the start. Thus, tools function as\nextensions of human capabilities, allowing us to achieve what we can\nnot achieve with the body alone—and one might add that some\ntools are more ‘extensive’ than others as our pen vs. word\nprocessor suggest. According to this view, we need to understand the\nimpact that the use of the tools (information technology in this case)\nhas on human society as they are taken up and used in everyday\npractices. For example, how will communication with mobile phones\nchange our social interaction and social relationships? In asking such\na question this view does not primarily concern itself with the\ndevelopment of the technology—why and how did it come about in\nthe first instance. It mostly assumes that the design of a particular\ntechnology is rational and objective; one might call it an engineering\nor scientific solution to a particular problem. It also mostly assumes\nthat the particular technology—mobile phones in this\ncase—operates in a more or less uniform manner in different\nsocial practices and settings. In other words, it assumes that a\nparticular technology has certain determinate effects on, or in, the\ncontext of its use. This way of conceptualizing information technology\nleads to questions such as “what is the impact of the mobile\nphone on communication patterns” or “what is the impact of\nmobile phones on privacy/privacy expectations”. This view of\ntechnology is often criticized for a greater or lesser degree of\ntechnological determinism. Technological determinism is the view that\ntechnology more or less causes certain ways of doing or ways of\norganizing to come about. For example, a technological determinist may\nargue that the Internet’s open and non-hierarchical architecture\ncan more or less cause a society that uses it to become more\nopen and less hierarchical. The work of Postman (1993) is an example\nof this type of critical evaluation of the impact of technology on\nsociety.\n1.2 Information Technology as Socially Constructed Artifacts and Actors\n\nMany scholars argue that the tool and impact view above of information\ntechnology does not give an adequate account of the relationship\nbetween information technology and society (Bijker, Pinch, and Hughes\n1987, Bijker 1995, Law 1991, Latour 1991). Firstly, it does not take\ninto account that the technology does not simply appear but is the\noutcome of complex and socially situated development and design\npractices. In this development and design process many alternative\noptions become excluded in favour of the technology that is now\navailable—obviously with important social and normative\nimplications. In other words there are many cultural, political and\neconomic forces that shape the particular options suggested as well as\nthe way the selected options become designed and implemented (Bijker,\nPinch, and Hughes 1987). It is not only technology that\n‘impacts’ on society; technology itself is already the\noutcome of complex and subtle social processes and practices—in\nother words it is socially constructed in a very direct and\nsignificant manner. In short: our current technologies were not\ninevitable, things could have been substantially otherwise. Moreover,\nthey argue that when we look at the actual uses of particular\ntechnologies we discover that users use them in many diverse and often\nunexpected ways—leading to many and diverse unintended\nconsequences. Both in its design and in its actual use there is an\nongoing reciprocal relationship in which society and technology\nco-construct each other; they act through and upon each other.\nTechnology is not simply passive tools, waiting for us to use them.\nThey circumscribe our possibilities and enact significant\n‘scripts’ (Latour, 1991) that shape us as much as we shape\nthem. As Latour (2005, 107) suggests, technologies (as actors) make us\ndo things but “not by transporting a force that would remain the\nsame throughout as some sort of faithful intermediary, but by\ngenerating transformations manifested in many unexpected events\ntriggered in the other mediators that follow them along the\nline.” The degree to which the technology/society distinction is\nuseful at all (ontologically or analytically) varies between the\ndifferent constructivist authors—for example, Brey (1997)\nidentifies three different strands of constructivist approaches. Those\nwho support this view claim that it is very difficult to make general\nstatements about the ‘impact’ of a technology in some\ngeneral terms. One can, at most, speak of some general trends for\nwhich many exceptions will invariably exist. For the proponents of the\nthis constructivist view it is important to understand, through\ndetailed descriptive accounts, the particular ways in which\ntechnologies emerge and become embedded in particular social\npractices. Examples of such studies can be found in the work of Bijker\n(1995), Law (1991) and Latour (1991). \n1.3 Information Technology as an Ongoing Horizon of Meaning and Action\n\nFor the phenomenologist the tool and impact view of technology as well\nas the constructivist view of the technology/society relationships are\nentirely valid in their own terms but not adequate (Heidegger 1977,\nBorgmann 1985, Winograd and Flores 1987, Ihde 1990, Dreyfus 1992,\n2001, Verbeek 2005). They argue that these accounts of technology, and\nthe technology/society relationship, posit technology and society as\nif speaking about the one does not immediately and already draw upon\nthe other for its ongoing sense or meaning. For the phenomenologist\nsociety and technology co-constitute each other from the very start;\nthey are each other’s ongoing condition or possibility for being\nwhat they are. For them technology is not just the artifact,\n‘out there’ as it were. Rather, for them the artifact\nalready emerges from a prior ‘technological’ attitude\ntowards the world (Heidegger 1977), or is indeed already the\nconstitutive possibility for the human to be human as such (Stiegler,\n1998, 2009). For example, as the already technologically oriented\nhuman beings that we are, we will tend to conceive communication as a\nproblem requiring a technological solution. Thus, technology is\nalready the outcome of a technological way of looking and relating\nourselves to the world. Once in place technology allows the world to\n‘show up’ in particular ways (Introna and Ilharco 2003).\nFor example you are a different person to me with a mobile phone than\nwithout one. With a mobile phone you become disclosed, or show up, as\n‘contactable’, ‘within reach’ as it were. It\nis this way of thinking about information technology, as co-original\nwith the human, and as a horizon of meaning and action, that we want\nto elaborate further before we can elaborate how these various ways of\nconceptualizing technology shape our views on the social and ethical\nimplications of such technologies. Before proceeding it should be\nnoted that the most recent work of Bruno Latour (2002, 2005) suggests\nthat he has taken up many of the insights of phenomenology in his\nongoing work. Thus, the later Latour (2002, 2005) can be seen as a\nbridging figure between the constructivist tradition and the\nphenomenological tradition (for more detailed arguments in this regard\nrefer to Graham Harman’s (2009) book on Latour’s\nmetaphysical ground). \n2. Phenomenological Approaches to Technology\n\nWe started this discussion by suggesting that phenomenology\ninvestigates the conditions of what makes things appear as such, or,\nthat phenomenology suggests that there is a co-constitutive\nrelationship between us and the phenomena we encounter in our\nengagement with the world. Before we move on it might be helpful to\nclarify this point with a simple everyday example. Let us take the\nhuman experience of listening to music and consider it\nphenomenologically. From the perspective of physics and physiology,\nmusic is constituted by a flux of waves of particular frequencies to\nwhich the inner ear may be sensitive. Indeed, once so analyzed, it is\npossible to create a technological device such as a tape recorder that\nis sensitive to these same sounds, and can even replay them on\ncommand. Human beings, however, when they hear sounds in everyday life\nnever take them simply as a stream of sounds, rather they find\nthemselves already listening to something particular—a cry for\nhelp, an automobile breaking, construction noise, or a piece of music.\nIndeed it would take a very strange sort of attitude to hear sounds\nand take them as a flux of waves of particular frequencies. Listening\nis different than registering or recording. To listen is to already\ntake sounds as this or that. In listening, the taking of sound as\nmusic implies an already existing sense of what music is, something\nthat makes it possible for us to take these sounds as music rather\nthan noise. Furthermore, in listening to music, this listening is\ninformed by an ongoing sense (or unity) of movement, rhythm, tone,\nscale, style, and so forth. This ongoing active unity provides an\nactive and ongoing framework (or necessary background) that enables\nme, in the experience of listening (right now), to simultaneously\n‘retain’ the sounds I no longer hear (the past), and in\nanticipation to ‘fill in’ the sounds I am not yet hearing,\nyet already anticipate (the future). As a phenomenological being I\nfind myself listening to music, not merely recording sounds after the\nmanner of a technological device. For phenomenologists the relevant\nquestion is: What are the transcendental conditions that make it\npossible for humans to listen to music, as music, rather than merely\nrecord sounds?\n\nWhat is it that enables us to encounter music in its fullness even\nthough we are always given, at any particular point in time, only some\nlimited aspect of such a phenomenon (the current note I am hearing)?\nThe answer of phenomenology is that it is the transcendental\nhorizon or conditions that make our encounter with the world\npossible. One could say that the transcendental is the background, or\nhorizon, that makes the meaningful experience of the foreground\npossible. Yet insofar as such a formulation suggests a background that\nis somehow separate and ‘behind’ that which appears in the\nforeground, it would be incorrect. The transcendental horizon is\nalways and immediately already present in the very appearing as\nsuch—this is exactly what makes a horizon\n‘disappear’ or withdraw from our focal awareness. It is so\nevident that it simply does not come up as an issue. It is this\nseemingly ‘forgotten’ constitutive horizon that is the\nfocus of phenomenology. All phenomenological approaches have as their\nfocus a ‘return’ to this vital co-constitutive interplay\nbetween the ‘foreground’ and the ‘background’.\nThus, all phenomenological studies share at least the underlying view\nthat technology and society co-constitute each other by being each\nother’s reciprocal and ongoing condition or possibility for\nbeing what they are. As such they continually draw on each other for\ntheir ongoing sense or meaning. For the purposes of this entry it\nmight be best to indicate some of the existing phenomenological\nstudies of technology in four different but intimately connected\nstrands (this is not a comprehensive list, it is rather indicative of\ncommon themes or approaches):\n\nPhenomenology as a fundamental critique of the technological\nattitude as such (Martin Heidegger 1977)\nOriginal technicity and the human being (Stiegler 1998,\n2009);\nThe technological attitude as manifested in our contemporary\nrelationship with particular technologies (Hubert Dreyfus 1992 and\nAlbert Borgmann 1984);\nA phenomenology of the human/technology relationship (Don Ihde\n1990).\n\n2.1 A Fundamental Critique of the Technological Attitude\n\nProbably the most famous phenomenological analysis of\ntechnology—or rather the technological attitude that gives rise\nto artifacts—is Martin Heidegger’s (1977) essay The\nQuestion Concerning Technology. This essay is important as a\nreference point because it illustrates forcefully the most important\nand distinctive claim of phenomenology vis-à-vis technology.\nTechnology is not merely an artifact or our relationship with this or\nthat artifact; rather, the artifact—and our relationship with\nit—is already an outcome of a particular\n‘technological’ way of seeing and conducting ourselves in\nand towards the world. Heidegger (1977) famously claimed that\n“the essence of technology is nothing technological”\n(p.4).\n\nFor Heidegger the essence of technology is the way of being of modern\nhumans—a way of conducting themselves towards the\nworld—that sees the world as something to be ordered and shaped\nin line with projects, intentions and desires—a ‘will to\npower’ that manifest itself as a ‘will to\ntechnology.’ It is in this technological mood that\nproblems show up as already requiring technical solutions. The term\n‘mood’ here is used to refer to a collectively held\n‘sense’ (or way of grasping) of an event or a situation;\nwe often use it when we refer to the ‘mood of the meeting’\nor the ‘mood of our times.’ He calls this technological\nmood enframing (Gestell in German). With this term\nhe wants to denote that the modern mood takes or approaches the world\nas always and already framed, i.e., enframed. Heidegger claims that\nfor us, living in the technological age, the world is already framed\nas a resource available for us, to be made, to be shaped for our\nongoing possibilities to express our particular projects, to be\nwhatever we are, as business people, engineers, consultants,\nacademics, teenagers, etc. In short: technology makes sense because we\nalready live in the technological age or mood where the world (and we\nas beings that are never ‘out’ of the world) are already\nframed in this way—as available resources for the ongoing\nchallenging and ordering of the world by us. For him the essence of\ntechnology is not the particular artifacts but the technological mood\nthat make this or that particular artifacts show up as meaningful and\nnecessary.\n\nHeidegger claims that there were other times in human history, a\npre-modern time, where humans did not orient themselves towards the\nworld in a technological way—simply as resources for our\npurposes. He suggests that in ancient Greek culture humans’\nrelationship with the world was one of ‘letting be’; a\nworld approached in an attitude or mood of reciprocal\n‘care.’ This must not be taken as some sort of romantic\nvision of the past in which everybody in ancient Greece\n‘cared’ for the world in contrast to the modern\ntechnological mood where everybody takes the world as something to be\nchallenged and ordered. It is rather saying that the mood, the\nhorizon, in which we conduct ourselves tends to dispose us in\nparticular ways. Obviously there were also artifacts in ancient times.\nHowever, according to Heidegger this ‘pre-technological’\nage (or mood) is one where humans’ relation with the world and\nartifacts, their way of being disposed, was poetic and aesthetic\nrather than technological (enframing). The act of making and shaping\nthe artifact was directed by a different attitude or mood. Since the\nworld was not taken as ‘available for ordering’ a certain\nreciprocal care and intimacy was possible (and cultivated) in which\nthe world was ‘let to be’—to let the world show\nitself in its own terms. He claims that the pre-modern craftsman makes\n“the old wooden bridge” that “lets the river run its\ncourse.” However, in the horizon of the technological mood this\nsame river is disclosed as a possibility for a “hydroelectric\nplant” that turns the river into a reservoir, a resource on\nstandby for our projects, challenged and framed as available.\n\nThere are many who disagree with Heidegger’s account of the\nmodern technological attitude as the ‘enframing’ of the\nworld (Feenberg 1999, Pitt 2000). For example Andrew Feenberg (1999)\nargues that Heidegger’s account of modern technology is not\nborne out in contemporary everyday encounters with technology. When we\nlook more carefully we see many individual situations in which the\ntechnological attitude does not hold sway, where people have intimate\nrelationships with artifacts that cannot merely be dismissed as\ninstances of enframing. Others, such as Hubert Dreyfus and Albert\nBorgmann, have extended Heidegger’s work into more specific\ncritiques of particular technologies and particular contemporary ways\nof being.\n2.2 Original Technicity and the Human Being\n\nBernard Stiegler is mostly known for his multi-volume work\nTechnics and Time (La technique et le temps). In this\nmulti-volume work he argues that the human and the technical are\nco-original—in other words that the technical did not emerge out\nof the (already constituted) human or the human out of the (already\nconstituted) technical but that these two ontological domains\nco-constituted each other from the very start. To make his argument he\ndraws on the work of Heidegger and Derrida but also very significantly\non the work of the paleoanthropologist Andre Leroi-Gourhan—in\nparticular his widely recognized Gesture and Speech\n(originally published in French in 1964). In this work Leroi-Gourhan\nargues that there is a fundamental continuity from the biological to\nthe sociological and that this continuity is realized through the\nmediation of technology. He sees the use of tools (made possible by\nthe freeing of the hands when in the upright position) as a process of\n‘exteriorization’ in which the process of evolution is\ntransferred from the zoological domain to the technical\ndomain—or as Stiegler suggests “the continuation of life\nby means other than life” (1998, 50). Thus, unlike other\nmammals, humans remain generalists who specialize—as and when\nrequired—by exteriorizing these specialized capabilities in the\ntechnical domain outside of the human body. This exteriorization is\nalso simultaneously reflected (or mirrored) back as a process of\ninteriorization where the technologies become embodied by the humans\nwho use them. Stiegler uses the notion of\n‘epiphylogenesis’ to describe this extra-genetic\nco-evolution of the human and the technical. Through epiphylogenesis\nculture becomes possible as the ‘the inorganic organization of\nmemory’ (1998, 174, my emphasis). Thus, for him\n“[t]he human invents himself in the technical by inventing the\ntool—by becoming exteriorized technologically” (1998,\n141). Moreover, Stiegler suggests that without these technically\ninscribed memory systems we would not be able to exist in\ntime. Without the material technicity we humans would be unable to\nexperience the past and would have nothing to ‘select’\nfrom in order to invent the future. Thus, without technicity (what he\ncalls “organized inorganic matter”) we will exist in a\nperpetual present without any hope of transcending it. This point is\nindeed also made by Latour (2005) in his discussion of technology as\nmediators. As such culture and society will not be possible. Thus, for\nStiegler the constitutive transcendental horizon of the human is\ntechnicity, from which emerges the conditions of possibility of time,\nsociety and culture.\n\nIf the claims made by Stiegler are correct then this fundamental unity\nbetween the human and the technical (as expressed through the idea of\nepiphylogenesis) have important implications for how we think about\nour relationship with technology. It is not just something ‘out\nthere’ it is also immediately something ‘in here’,\nat the very source of our humanity. This means that when we design new\ntechnological systems we are also designing the sort of humans that we\nare (or will become). We are adding to the archive that will afford\nfuture generations their possibilities for being and also\nsimultaneously framing the way our human past will be recalled and\nremembered. This co-evolution of the human and the technical also\nmeans that we cannot escape the technical--our being is always already\ntechnical. It is not something alien that we can get rid of, or choose\nto be without. Within this perspective technology becomes the central\nquestion in which many of the most fundamental questions of what it\nmeans to be human becomes opened up in new and unexpected ways (this\nis why Stiegler argues that technicity is the central philosophical\nquestion which has been forgotten ever since the Greeks). \n\nThe radical nature of Stiegler’s project means that there are\nmany who disagree with him. For example Vaccari (2009) argues that the\nfundamental genetic concepts of ‘inscription’ and\n‘transmission’ at the centre of Stiegler’s argument\nhave been severely criticized (especially in the biological sciences\nwhere it originates). He also suggests that there is a certain\ndeterminism at the heart of Stiegler’s programme, which has been\nseverely criticized by many constructivists such as Latour. \n2.3 The Technological Attitude in Contemporary Society and Technologies\n\nPhenomenology has not only been used to address questions of\nphilosophical anthropology, as one might suggest is the case with\nHeidegger and Stiegler. Hubert Dreyfus (1992) has used it very\neffectively to provided a devastating critique of the classical\nprogram in artificial intelligence (AI) research. In his critique\nDreyfus (1992) argues that the way skill development has become\nunderstood in the past has been wrong. He argues—using the\nearlier work of Heidegger in Being and Time—that the\nclassical conception of skill development, going back as far as Plato,\nassumes that we start with the particular cases and then abstract from\nthese to discover and internalize more and more sophisticated and\ngeneral rules. Indeed, he argues, this is the model that the early\nartificial intelligence community uncritically adopted. In opposition\nto this view he argues, with Heidegger, that what we observe when we\nlearn a new skill in everyday practice is in fact the opposite. We\nmost often start with explicit rules or preformulated approaches and\nthen move to a multiplicity of particular cases, as we become an\nexpert. His argument draws directly on Heidegger’s account in\nBeing and Time of humans as beings that are always already\nsituated in-the-world. As humans ‘in-the-world’ we are\nalready experts at going about everyday life, at dealing with the\nsubtleties of every particular situation—that is why everyday\nlife seems so obvious. Thus, the intricate expertise of everyday\nactivity is forgotten and taken for granted by AI as an assumed\nstarting point.\n\nDreyfus proceeds to give an account of five stages of becoming an\nexpert as a way to critique the programme of AI. In his account a\nnovice acts according to conscious and context-free rules and\ngenerally lacks a sense of the overall task and situational elements.\nThe advanced beginner adds, through experience, situational aspects to\nthe context-free rules to gain access to a more sophisticated\nunderstanding of the situation. The relationship between the\nsituational aspects and rules are learned through carefully chosen\nexamples, as it is difficult to formalize them. The competent person\nwill have learnt to recognize a multiplicity of context-free rules and\nsituational aspects. However, this may lead to being overwhelmed as it\nbecomes difficult to know what to include or exclude. The competent\nindividual learns to take a particular perspective on the situation,\nthereby reducing the complexity. However, such ‘taking of a\nstand’ means a certain level of risk taking is involved that\nrequires commitment and personal involvement. For the proficient most\ntasks are performed intuitively. As an involved and situated actor the\nrelevant situational aspects show up as part of the ongoing activity\nand need not be formalized. Nevertheless, a pause may still be\nrequired to think analytically about a relevant response. For the\nexpert relevant situational aspects as well as appropriate actions\nemerge as an implicit part of the ongoing activity within which the\nexpert is totally absorbed, involved, and committed. The task is\nperformed intuitively, almost all the time. In the ongoing activity of\nthe expert thousands of special cases are discriminated and dealt with\nappropriately.\n\nWith this phenomenological account of skill development in hand it is\neasy to see the problem for the development of AI programmes.\nComputing machines need some form of formal rules (a program) to\noperate. Any attempt to move from the formal to the particular, as\ndescribed by Dreyfus above, will be limited by the ability of the\nprogrammer to formulate rules for such a shift. Thus, what the\ncomputer lacks (and we as human beings have) is an already there\nfamiliarity with the world that it can draw upon as the transcendental\nhorizon of meaning to discern the relevant from the irrelevant in\nongoing activity—i.e., the computer is not already a\nskilled actor (a being-in-the-world in Heidegger’s terms). The\ncritique of Dreyfus was one of the major factors that pushed AI\nresearchers into new ways of thinking about AI—in particular the\ndevelopment of the embodied cognition programme of the Massachusetts\nInstitute of Technology (MIT) AI Lab.\n\nWhat Dreyfus highlighted in his critique of AI was the fact that\ntechnology (AI algorithms) does not make sense by itself. It is the\nassumed, and forgotten, horizon of everyday practice that make\ntechnological devices and solutions show up as meaningful. If we are\nto understand technology we need to ‘return’ to the\nhorizon of meaning that made it show up as the artifacts we need, want\nand desire. We also need to consider how these technologies reveal (or\ndisclose) us. For example the microscope can reveal us as\n‘inquisitive’, the gun as ‘aggressive’, or the\nmobile phone as ‘communicative’, and so forth. The ongoing\nco-constitution of society and technology, phenomenology’s\ninsight, can help us to understand and make sense of complex\ninformation technology, such as AI, but also more mundane technologies\nsuch as word processors (Heim 1999).\n\nIn thinking about our relationship with technology in modern\ncontemporary life Albert Borgmann (1984) takes up the question of the\npossibility of a ‘free’ relation with modern technology in\nwhich everything is not already ‘framed’ (in\nHeidegger’s sense) as resources for our projects. He agrees with\nHeidegger’s analysis that modern technology is a phenomenon that\ntends to ‘frame’ our relation with things, and ultimately\nourselves and others, in a one-dimensional manner—the world as\nsimply available resources for our projects. He argues that modern\ntechnology frames the world for us as ‘devices’. By this\nhe means that modern technology as devices hides the full\nreferentiality (or contextuality) of the world—the worldhood of\nthe world—upon which the devices depend for their ongoing\nfunctioning. Differently stated, they do not disclose the multiplicity\nof necessary conditions for them to be what they are. In fact, just\nthe opposite, they try to hide the necessary effort for them to be\navailable for use. A thermostat on the wall that we simply set at a\ncomfortable temperature now replaces the process of chopping wood,\nbuilding the fire and maintaining it. Our relationship with the\nenvironment is now reduced to, and disclosed to us as a control that\nwe simply set to our liking. In this way devices\n‘de-world’ our relationship with things by disconnecting\nus from the full actuality (or contextuality) of everyday life. By\nrelieving us of the burden—of making and maintaining fires in\nour example—our relationship with the world becomes disclosed in\na new way, as simply there, already available for us. Obviously, this\nis sometimes necessary otherwise the burden of everyday life might\njust be too much. Nevertheless, if the ‘device mood’\nbecomes the way in which we conduct ourselves towards the world then\nthis will obviously have important moral and ethical implications for\nothers who may then become disclosed as devices.\n\nAgainst such a disengaging relationship with things in the world\nBorgmann argues for the importance of focal practices based on focal\nthings. Focal things solicit our full and engaging presence. We can\nthink of the focal practice of preparing and enjoying a meal with\nfriends or family as opposed to a solitary consumption of a fast food\nmeal. If we take Borgmann’s analysis seriously we might conclude\nthat we, as contemporary humans surrounded by devices, are doomed\nincreasingly to relate to the world in a disengaged manner. Such a\ntotalizing conclusion would be inappropriate since the prevailing mood\ndoes not determine our relationship with those we encounter.\nNevertheless, Borgmann’s analysis does point to the possibility\nof the emergence of a device mood—as we increasingly depend on\ndevices—and our moral obligation not to settle mindlessly into\nthe convenience that devices may offer us. Otherwise we might, as\nHeidegger (1977) argued, become the devices of our devices.\n2.4 A (Post) Phenomenology of the Human/Technology Relationship\n\nPhenomenology does not only function as an approach to reveal and\ncritique our relationship with technology, as suggested by Heidegger,\nDreyfus and Borgmann. Don Ihde (1990, 1995, 2002, 2010) has used the\nresources of phenomenology to give a rich and subtle account of the\nvariety and complexity of our relationship with technology—what\nhe refers to as a postphenomenology of technology (Ihde 2009, 2010;\nSelinger 2006). With postphenomenology Ihde wants to move away from\n‘transcendental’ (and often dystopian) grand narratives of\nthe technological to a more grounded empirical analysis of the\nhuman/technology relationship. This move to the empirical is often\ndescribed as the ‘empirical turn’ in the philosophy of\ntechnology (Achterhuis 2001). Postphenomenology is a relational\nontology, which proposes that the subject/object (or human/technology)\nrelation is not just interactional but also co-constitutive\n(Rosenberger and Verbeek 2015). Moreover, this co-constitutive\nrelation is fundamentally mediated. There are no direct relations\nbetween subject and object—only ‘indirect’ ones in\nwhich technologies often function as mediators, not to connect but to\nco-constitute. As such, the human-world relation is typically a\nhuman-technology-world relation. In this relation, there are no\npre-given subjects or pre-given objects (which then connect through\nsome form of mediators). Rather mediation is the original source from\nwhich a specific subjectivity and objectivity emerges, or become\nenacted, as part of specific situated doings. Ihde defines this\noriginally mediated nature of existence as embodiment (Ihde 2011).\nPostphenomenology aims to describe the varieties of\nsubjectivities/objectivities that emerge through different\nembodiments. What sort of subjects do we become (and what does the\nworld become) through the embodiments of the microscope, the\ntelescope, self-driving cars, the computer screen, and so forth?\n\nIn thinking about these embodied human/technology relationships Ihde\ncharacterizes four different I-technology-world relationships. The\nfirst type of relationship he calls embodiment relations. In\nthis case technology is taken as the very medium of subjective\nperceptual experience of the world, thus transforming the\nsubject’s perceptual and bodily sense. In wearing my eyeglasses\nI do not only see through them; they also become ‘seen\nthrough.’ In functioning as that which they are, they already\nwithdraw into my own bodily sense as being a part of the ordinary way\nI experience my surrounding. He denotes this relationship as having\nthe form [I-glasses]-world. He further argues that this relationship\nhas a necessary ‘magnification/reduction structure’\nassociated with it. Embodiment relations simultaneously magnify and\namplify or reduce and place aside (screen out) what is (and is not)\nexperienced through them. The moon through the telescope is different\nfrom the moon in the night sky perceived by the naked eye. The person\nat the other end of the online chat is made present to me across a\ngreat distance at the expense of being reduced to text on the\nscreen.\n\nThe second type of human/technology relation is what he calls\nhermeneutic. In this type of relation the technology\nfunctions as an immediate referent to something beyond itself.\nAlthough I might fix my focus on the text or the map, what I actually\nsee (encounter) is not the map itself but rather immediately and\nsimultaneously the world it already refers to, the landscape already\nsuggested in the symbols. In this case the transparency of the\ntechnology is hermeneutic rather than perceptual. As I become skilled\nat reading maps they withdraw to become for me immediately and already\nthe world itself. He denotes this relationship as having the form\nI-[map-world].\n\nThe third type of human/technology relations Ihde calls\n‘alterity’ relations. In these relations\ntechnology is experienced as a being that is otherwise, different from\nme, technology-as-other. Examples include things such as religious\nicons and intelligent robots (the\n Sony Dog AIBO\n for example). In my interaction with these technologies they seem to\nexhibit a ‘world of their own.’ As I engage them they tend\nto disengage me from the world of everyday life and point to the\npossibility of other worlds, hence their pervasiveness in activities\nsuch as play, art and sport. He denotes these as having the form\nI-technology-[world], indicating that the world withdraws into the\nbackground and technology emerges as a focal entity with which I\nmomentarily engage—as I play with my robot dog for example.\n\nIhde also recognizes a fourth type of human/technology relation in\nwhich technology is not directly implicated in a conscious process of\nengagement on the part of the human actor. Ihde refers to these as\nbackground relations. Examples include automatic central\nheating systems, traffic control systems, and so forth. These systems\nare ‘black-boxed’ in such a way that we do not attend to\nthem yet we draw on them for our ongoing everyday existence. They\nwithdraw as ongoing background conditions. Although he does not\ndesignate it as such one might formalize these relations in the form:\nI-[technology]-world. These invisible background technologies can be\npowerful in configuring our world in particular ways yet escape our\nscrutiny.\n\nIhde’s phenomenological description of the human/technology\nrelation provides a meaningful taxonomy or framework to give an\naccount of many everyday technology relations in a manner that can\nfacilitate our considerations of the social and ethical implications\nof information technology. For example, the withdrawal of technology,\ninto my body, into my perception and into the background has important\npolitical and ethical implications for its design and implementation.\nEspecially if one considers that every disclosure of the world\n‘through’ technology is also immediately a concealment of\nother possible disclosive relations. The car discloses\npossibilities—for getting to places quickly—but also\nconceals, in its withdrawal, the resources (roads, fuel, clean air,\netc.) necessary for it to be what it is—they act as devices in\nBorgmann’s terminology. Indeed we often lose sight of the\nreduction/magnification structure as we simply use these technologies.\nAs these technologies become more and more pervasive—almost a\nnecessary condition of everyday life—it becomes more and more\ndifficult to see that which has become concealed in their withdrawal.\nWith Ihde’s typology of I-technology-world relations we might be\nable to bring what has become concealed back to the foreground for our\ncritical attention and ethical reflection. Let us now consider how\nthese different ways of approaching the information technology/society\nrelationship might circumscribe our thinking about the social and\nethical implications of information technology.\n3. Ethics and Information Technology\n3.1 The Impact of Information Technology and the Application of Ethical Theory\n\nMuch of the ethical debate about computers and information technology\nmore generally has been informed by the tool and impact view of\ninformation technology (discussed in\n section 1.1\n above). Within this tradition a number of issues have emerged as\nimportant. For example, whether computers (or information and\ncommunication technology more generally) generate new types of ethical\nproblems that require new or different ethical theories or whether it\nis just more of the same (Gorniak 1996). These debates are often\nexpressed in the language of the impact of information\ntechnology on particular values and rights (Johnson 1985, 1994). Thus,\nwithin this approach we have discussions about the impact of CCTV or\nweb cookies on the right to privacy, the impact of the digital divide\non the right to access information, the impact of the piracy of\nsoftware on property rights, and so forth. In these debates Jim Moor\n(1985) has argued that computers show up policy vacuums that require\nnew thinking and the establishment of new policies. Others have argued\nthat the resources provided by classical ethical theory such as\nutilitarianism, consequentialism and deontological ethics is more than\nenough to deal with all the ethical issues emerging from our design\nand use of information technology (Gert 1999). \n\nIrrespective of whether information technology creates new types of\nethical problems that require new ethical theory or whether\nestablished ethical theory is sufficient, one tends to find the debate\ncentered on questions of policy that is intended to regulate or\njustify conduct vis-à-vis the negative impact produced by\ncertain uses or implementations of IT. These policies are seen, and\npresented as ways to regulate or balance competing rights or competing\nvalues in the context of the impact of IT. For example, what sort of\npolicies do we need to protect our children when they go on the\nInternet? How would these policies affect the right to free speech?\nOr, what sort of policies do we need to secure the rights of producers\nof digital products? How would these policies affect the right of\nsociety to a reasonable access to these products? (Lipinski &\nBritz 200). Furthermore, these debates are most often directed at an\ninstitutional level of discourse—i.e., with the intention to\njustify the policies or conduct for governments, organizations and\nindividuals. In these debates on the impact of technology, ethicists\nare primarily conceived as presenting arguments for justifying a\nparticular balance, of values or rights, over and against other\npossibilities within the context of specific uses or implementations\nof IT. In presenting these arguments ethicists normally apply ethical\ntheories (such as consequentialism, utilitarianism, deontological\nethics, etc.) to new cases or problems presented by the use, or\nperceived impact, of the particular technology.\n3.2 The Politics of Information Technology and a Disclosive Ethics\n\nThe constructivist view of the information technology/society\nrelationship (discussed in\n section 1.2\n above) tends to lead to a different kind of reflection on the ethical\nsignificance of information technology. They suggest that the problem\nwith the tool and impact view of society/technology relations is that\nit assumes that the domain of society is where the ends (values,\nassumptions and politics) are located and that the domain of the\ntechnical is merely neutral means towards these ends. This view is\noften expressed in the slogan ‘guns do not kill people, people\ndo’, meaning guns are merely a means to an end (which could be\npeaceful or violent depending on the user of the gun). In contrast\nsocial constructivists tend to argue that technology, as socially\nconstructed, is already political as such and therefore already\nsuggests an ethical concern. By this they mean that technology, by its\nvery design, includes certain interests and excludes others. This does\nnot mean that designers are always aware that they are making\npolitical and ethical decisions. In fact they are mostly not. They are\nmostly trying to solve very mundane everyday ‘technical’\nproblems when they build technologies. Nevertheless, they always make\nassumptions or take for granted certain values and beliefs (mostly\ntheir own) when they construct artifacts. For example the ATM bank\nmachine assumes a particular person in front of it. It assumes a\nperson that is able to see the screen, read it, remember and enter a\npersonal identification (PIN) code, etc. It is not difficult to\nimagine a whole section of society that does not conform to this\nassumption. If you are blind, in a wheelchair, have problems\nremembering, or are unable to enter a PIN, because of a disability,\nthen your interest in getting access to your account will be excluded\nby the actual design of the ATM. In this way the ATM embodies a\nparticular understanding of the world (humans) in front of it. This is\nwhy Langdon Winner (1980) argued that artifacts (and technological\nsystems) always already embody interests, values, etc.—that is\nto say, they are always political from the start. This does not mean\nthat users cannot intentionally or unintentionally reinterpret the way\ntechnology suggests or ‘affords’ possibilities to suit\ntheir own needs. Users often ‘read’ and use technology in\nways unintended by the designers/implementers. However, as these\ntechnological affordances become embedded in larger infrastructures\n(practices, systems, spaces, organizations, etc.) it becomes\nincreasingly difficult to use the technology in ways other than in the\nway it was set up to afford possibilities (or not).\n\nIf information technology is political—i.e., it already\nincludes/excludes certain interests—then it is also immediately\nethical. For the constructivist it is the particular way in which\ninterests become built into the technology and practices within which\nit is embedded that is ethically significant (Brey 2000, 2004, 2006).\nMoreover, they often argue that ethical reflection should be an\ninherent part of the design process—referred to as value\nsensitive design (Friedman 1997). Of particular concern is the way\ninformation technology ‘hides’ these values and interests\nin the logic of software algorithms and hardware circuits (Introna\n& Nissenbaum, 2000). Everyday technologies such as utensils are\nmostly open to scrutiny by the reflexive user. Information technology,\non the other hand, is mostly not open to such scrutiny (Brey 2000).\nImportant assumptions and biases in information technology are mostly\nobscured and subsumed in ‘black-boxes’ in ways that make\nit difficult even for the experts to scrutinize them. It is not\npossible for the ordinary computer user to scrutinize the assumptions\nand biases embedded in the code of the Microsoft Windows operating\nsystem. Imbedded in the software and hardware code of information\ntechnology applications are complex rules of logic and categorization\nthat may have material consequences for those using them, and for the\nproduction of social order more generally (Introna & Wood 2004,\nIntrona & Nissenbaum 2000). In this view of information technology\nethics, the task of ethics is to open up the ‘black box’\nof information technology and reveal or disclose the values\nand interests it embodies for scrutiny and reflection—not only\nin its final design but also in the process of development (Introna\n2007). Such an approach to the ethics of information technology is\nmost often informed by technology studies within the science,\ntechnology and society (STS) tradition as proposed by Bijker\n(2003)\n3.3 Information Technology, Ethics and our Human way of Being\n\nFrom the preceding discussion, it should be clear that\nphenomenologists would tend not only to concern themselves with this\nor that artifact or technology as such. They would rather be concerned\nwith the world (or mood as already suggested) that made these\nartifacts or technologies seem necessary or obvious in the first\nplace. They would also be concerned with the ways in which particular\ntechnologies ‘frame’ and reveal us, or our world, as we\ndraw on them. They would claim that it is this ongoing co-constitution\nthat we should focus on if we are to understand the social and ethical\nimplications of ICT and new media (Verbeek 2008). This does not\npreclude the possibility that we could also consider the impact of\nparticular technologies as well as unpack particular technologies to\nunderstand the values and interests they imply. However, the\nphenomenologists would argue that the impact analysis\n (section 3.1)\n and the disclosive analysis\n (section 3.2)\n could be enhanced if these were situated in a broader\nphenomenological analysis. Such an additional analysis might add\nanother level of critical reflection that could be important in\nunderstanding and justifying different possible futures. One might\ndescribe the phenomenological approach as an iterative process of\nontological disclosure in which a world (relevant social\npractices or involvement whole) and technology (nexus of relevant\ntechnologies) are taken as mutually constitutive interpretive contexts\nin which the one renders the other intelligible—i.e., grounds it\nas a ‘seemingly’ meaningful way to be. In this iterative\nprocess there is a progressive uncovering of the constitutive\nconditions that are necessary for particular ways of seeing or doing\nin the world—or in particular social practices—to make\nsense and be meaningful in the way they are taken to be. For example,\nin Heidegger’s analysis of modern technology, as outlined above\nin\n section 2.2,\n he identifies the emergence of calculative thinking as a necessary\ncondition to see the world as resources available for our purposes.\nHowever, this calculative orientation is itself conditioned by a\nparticular way of approaching the world, which he traces back to Greek\nthought. Let us consider this approach in more detail through an\nexample of virtuality. \n4. Phenomenology, Ethics and Information Technology: The Case of Virtuality\n\nAs indicated above, it would be misleading to suggest that there is a\nvast literature on the phenomenological approach to the social and\nethical implications of information technology. Clearly, the work of\nStiegler, Heidegger, Dreyfus, Borgmann and Ihde discussed above could\nbe described as critical work that aims to open up a horizon for\nsocial and ethical reflection. Nevertheless, there seems to be at\nleast one information technology theme that has attracted some\nsustained attention from phenomenologists (especially with regard to\nits ethical implications)—the phenomenon of virtualization or\nvirtuality. The term ‘virtuality’ is used here to refer to\nthe mediation of interaction through an electronic medium between\nhumans as well as between humans and machines. The Internet (or\nCyberspace as it is known in cultural discourse) is the most evident\nexample of the virtualization of interaction.\n\nThe development of the Internet and the subsequent extension of\ncomputer networks into all domains of everyday life have prompted much\nspeculation about the way in which this information technology will\nchange human existence, especially our notion of sociality and\ncommunity. Much of this speculation suggests that the virtualization\nof human interaction has led to a multitude of new possibilities for\nhumans—such as cyber communities, virtual education, virtual\nfriendships, virtual organizations, virtual politics, and so forth.\nClearly, such claims about the transformation of the social domain\nhave important implications for our understanding of ethics. One might\nsuggest that most of our current thinking about ethics implies a\ncertain sense of community based on reciprocal moral obligations that\nare largely secured through situated, embodied practices and\ninstitutions that are often overlapping and mutually inclusive. If\nthese practices and institutions become virtualized then it would seem\nthat we need to reconsider some of our most fundamental human\ncategories.\n\nThe proponents of the virtualization of society (and its institutions)\nargue that virtuality extends the social in unprecedented ways\n(Fernback 1997, Rheingold 1993a, 1993b, Turkle 1995, 1996, Benedikt\n1991, Horn 1998). They argue that it opens up an entirely new domain\nof social being. For example Rheingold (1993a) argues that it offers\n“tools for facilitating all the various ways people have\ndiscovered to divide and communicate, group and subgroup and regroup,\ninclude and exclude, select and elect. When a group of people remain\nin communication with one another for extended periods of time, the\nquestion of whether it is a community arises. Virtual communities\nmight be real communities, they might be pseudocommunities, or they\nmight be something entirely new in the realm of social\ncontracts.” (p. 62). According to the proponents this new social\nspace is novel in that it offers completely new ways to be and relate.\nThey argue that through the plasticity of the medium it is possible to\nconceive, construct and present our identities in almost boundless\nways. Turkle (1996) suggests that cyberspace “make possible the\nconstruction of an identity that is so fluid and multiple that it\nstrains the very limits of the notion [of authenticity]. People become\nmasters of self-presentation and self-creation. There is an\nunparalleled opportunity to play with one’s identity and to\n‘try out’ new ones. The very notion of an inner,\n‘true self’ is called into question… the obese can\nbe slender, the beautiful can be plain. The ‘nerdy’ can be\nelegant. The anonymity of Multi-User Dungeons (MUDs), such as Second\nlife, (you are known only by the name you gave your characters)\nprovides ample room for individuals to express unexplored\n‘aspects of the self’” (p. 158). The claims by\nRheingold, Turkle and others are certainly bold. If they are right\nthen virtuality may indeed represent entirely new possibilities for\nhumans to relate, extend, and express themselves, which should be\nencouraged, especially for those that have become excluded from the\ntraditional domains of social relations, due to disability for\nexample.\n\nThose who treat the internet as an artifact may suggest that we look\nat the impact of mediation (or virtualization) on communication and\nrelations of power; for example, the fact that certain social\nprejudices are circumvented because the individual responding to my\nonline application for a particular service is not confronted with my\nphysical appearance. They may also suggest, as Turkle (1995, 1996) has\ndone, that we look at the way virtualization makes the presentation of\nself and identity more plastic and encourage us to think through the\nconsequences of this for ongoing social interaction. The social\nconstructivists may suggest that we need to look at the assumptions as\nvalues embedded in the artifacts as such (as was suggested above).\nThey may, for example, suggest that we consider the implicit\nassumptions about the nature of communication when considering e-mail\napplications— for instance, the fact that most e-mail\napplications assume and emulate the structure of a physical letter.\nThey would argue that we need to trace through how people interpret\nthis ‘letter’ structure to communicate and share objects\n(such as files and pictures) with others, as well as the sorts of\ncommunication such a structure excludes.\n\nPhenomenologists would suggest that these responses are all important\nbut they assume something more primary—i.e., the conditions that\nrender such acts as the presentation of the self, ongoing\ncommunication and sharing meaningful and significant in the first\ninstance. They might suggest that these social acts are all grounded\nin an already presumed sense of community. They might further argue\nthat social interaction, community and identity (as we know it) are\nphenomena that are local, situated and embodied, which is\ncharacterized by mutual involvement, concern and commitment (Dreyfus\n2001; Borgmann 1999, Ihde 2002, Introna 1997, Coyne 1995, Heim 1993).\nIn other words these phenomena draw on an implied sense of\ninvolvement, place, situation, and body for its ongoing meaning. For\nexample, Borgmann (1999) argues that the “unparalleled\nopportunity” of virtuality suggested by Turkle comes at a\n‘cost.’ To secure “the charm of virtual reality at\nits most glamorous, the veil of virtual ambiguity must be dense and\nthick. Inevitably, however, such an enclosure excludes the commanding\npresence of reality. Hence the price of sustaining virtual ambiguity\nis triviality” (p. 189). Indeed such ‘fluid and\nmultiple’ identity is only feasible as long as it is “kept\nbarren of real consequences”. Dreyfus (1999, 2001) argues, in a\nsimilar vein that without a situated and embodied engagement there can\nbe no commitment and no risk. They argue that in such an environment\nmoral engagement is limited and human relations become trivialized.\nIhde (2002) does not go as far as Borgmann and Dreyfus in discounting\nthe virtual as ‘trivial.’ Nevertheless, he does claim that\n“VR bodies are thin and never attain the thickness of flesh. The\nfantasy that says we can simultaneously have the powers and\ncapabilities of the technologizing medium without its ambiguous\nlimitations is a fantasy of desire” (p.15).\n\nCoyne (1995), drawing on the work of Heidegger, argues that the\nproximity of community has nothing to do with physical distance. He\nargues that proximity is rather a matter of shared\nconcerns—i.e., my family is ‘close’ to me even if\nthey are a thousand miles away and my neighbors may be\n‘distant’ to me even if they are next door. Levinas (1991,\n1996) takes this claim even further. He suggests that proximity has\nnothing to do with either social or geographic distance. For him\nproximity is an ethical urgency that unsettles our egocentric\nexistence. Proximity is the face—or our always already\nfacing—of the Other (all other human beings) that unsettles the\nongoing attempts by the ego to ‘domesticate’ the\ninfinitely singular Other (a proper name) into familiar categories\n(race, ethnicity, gender, etc). For the phenomenologist any electronic\ncommunication (or any other communication) will find its meaning in a\nprior horizon of proximity. If we do not already share certain\nconcerns then electronic mediation will not create proximity\neven if it does seem to break down the geographic distances between\nus—even if it is ‘shrinking’ the world as it were.\nThese authors suggest that our sense of community and the moral\nreciprocity it implies comes from a sustained and situated engagement\nwhere mutual commitments and obligations are secured in the proximity\nof an already shared horizon of ongoing meaning. In a similar vain\nSilverstone (2002, 2003) argues, drawing on the work of Levinas, for\nthe importance of maintaining a ‘proper distance’ in which\nproximity and responsibility are maintained. He argues that in the\nmodern world of the Internet and increased mobility the stranger\nbecomes ‘my neighbour’: ‘and we are all neighbours\nto one another now’. In the mediated world we become inundated\nwith the solicitations of the multitude of others that increasingly\nappear on our screens. How ought we to respond? We cannot allow the\nworld, reconstituted through the new media, to turn into mere images,\npixels on the screen. We must recognize: ‘that I have as much\nresponsibility for the stranger, that other who is either, physically\nor metaphysically, far from me, as I do for my neighbour’\n(Silverstone 2003: 480). Thus, according to Silverstone the ambiguity\nof a world of ‘closeness’ and simultaneous\n‘distance’ of the other that the new media constitute is\nan altogether different way of being with others that requires a new\nethic of ‘proper distance’ where the possibility of facing\nthe other, as Other, is not lost in the ethereality of our clicks. It\nis clear from these examples that the ethical question for\nphenomenology is mostly also an ontological question—that is,\nwhat sort of world or way of being are we becoming, as opposed to the\nsort of world we value and want? The phenomenologists would argue that\nthese fundamental choices may only become visible if we approach new\nmedia and ICT (and the ethics they imply) from a phenomenological\npoint of view.\n\nNot all agree with this phenomenological analysis that seems to\nprivilege the face-to-face. Feenberg (1999, and 2004 in Other Internet\nResources), although he is not a phenomenologist as such, nevertheless\nuses phenomenological insights to argue that the messages exchanged\nare not ‘thin’ but can also be ‘thick.’ The\nmessages exchanged through e-mail for example are also situated and\nalready imply a certain minimal level of reciprocity and\ncommitment—the mere fact of their exchange implies such a\nminimal horizon of meaning for the act of exchange itself to make\nsense. He argues: “the interpreted message stands in for the\nworld, is in effect a world. In the case of mediated communication, a\nperson and the social context of their presence are delivered in the\nmessage” (emphasis added). He argues that community is an\nintersubjectively constructed phenomenon that emerges from a mutual\nconnection that may imply a physical co-presence but is not restricted\nto it. He acknowledges that a mediated community may be different and\nhave its own particular problems. Nevertheless, he insists that\n“community needs to be interpreted from the inside out, not as a\ngeographical fact.” In a similar manner Powers (2004) argues,\nwith reference to the well known LambdaMOO ‘virtual rape’\ncase, that virtuality can lead to real moral wrongs, even if these\nvirtual worlds seem trivial and ‘shallow’. Introna and\nBrigham (2007) also argue that virtuality affords an opportunity to\nreconsider the meaning of the traditionally assumed community in a\nrather fundamental way. They suggest that the idea of virtual\ncommunities as being ‘thin’ and\n‘shallow’—lacking the depth that local proximity in\nface-to-face communities brings—privileges a certain view of\ncommunity premised upon shared values, or shared concerns, embedded in\nlocal situated face-to-face interaction and practices. They argue that\nin such communities ethics is often rooted in a notion of reciprocity\n(which my not be altruistic at all, may even be economic). In\ncontrast, they suggest, the virtual stranger (popping up on my screen\nas if out of nowhere) radically disturbs such an idea of reciprocity\n(and community). In responding to the virtual stranger the often\npresumed source of our ethics becomes visible. In the anonymity of the\ninterface I have to really decide (become truly responsible)\nbecause the stranger can be easily ignored. \n\nThe phenomenological analysis and critique of virtuality is important\nbecause it forces us to reconsider some of our most fundamental human\ncategories—especially our moral categories. From these debates,\nindicated above, it is apparent that a simple dichotomy that poses the\nvirtual as ‘thin and trivial’ and situated embodied\nco-presence (often referred to as the ‘real’) as\n‘thick and significant’ is too simple to be helpful. From\nthe phenomenological analysis presented it follows that one of the\nmost important aspects of community is the presumed density of its\nmutually referring concerns and involvements (irrespective of\nmediation). Traditional communities often develop this dense\nreferentiality, quite implicitly, by sharing involvement (and\ntherefore concern) in many overlapping practices and institutions. It\nis conceivable that there are individuals that already share certain\ninvolvements and concerns (such as individuals that share a\ndebilitating disease) that could become an online virtual community\nbecause they are in a very real sense already a community. It seems\nalso evident that individuals who share limited involvements and\nconcerns (such as playing games in MUDs) are unlikely to become a\ncommunity simply because they share a virtual space. Without a dense\nhorizon of mutual involvement and concern upon which we can base\nourselves all choices and actions become equally significant or\ninsignificant—i.e., trivial. Taylor (1991) in discussing the\nethics of authenticity provides a good summary of the importance of\nthis communal horizon of significance for the construction of a\n‘thick’ self and therefore a ‘thick’\ncommunity: “The agent seeking significance in life, trying to\ndefine him- or herself meaningfully, has to exist in a horizon of\nimportant questions [shared concerns]. That is what is self-defeating\nin modes of contemporary culture that concentrate on self-fulfillment\nin opposition to the demands of society, or nature, which shut out\nhistory and the bonds of solidarity. These self-centred\n‘narcissistic’ forms are indeed shallow and\ntrivialised” (p. 40). \n5. Conclusion\n\nThe purpose of this entry is to provide the reader with a sense of the\nphenomenological approach to information technology and its social and\nethical implications by contrasting it with two other approaches. It\nmight be useful to summarize our discussion in the Table below.\nObviously such a summary must be seen within the context of the whole\nentry and will be subject to the normal problems of such summative\nstatements, namely that they do not always do justice to the ideas so\nsummarized. Nevertheless, as a general guide it might help to further\nclarify some of the contrasts that the entry tried to suggest as\nuseful in understanding the distinctiveness of the phenomenological\napproach.\n\n\nArtifact / tool Approach \n\n\nView of technology / society relationship\nTechnologies are tools that society\ndraws upon to do certain things it would not otherwise be able to do.\nWhen tools become incorporated in practices it tends to have a more or\nless determinable impact on those practices. \n\nApproach to ethical implications of technology\nThe task of ethics is to analyze the\nimpact of technology on practices by applying existing or new moral\ntheories to construct guidelines or policies that will\n‘correct’ the injustices or infringements of rights caused\nby the implementation and use of the particular technology. \n\n\n\nSocial Constructivist Approach \n\nView of technology / society relationship\nTechnology and society co-construct\neach other from the start. There is an ongoing interplay between the\nsocial practices and the technological artifacts (both in its design\nand in its use). This ongoing interplay means that technological\nartifacts and human practices become embedded in a multiplicity of\nways that are mostly not determinable in any significant way.\n\n\nApproach to ethical implications of technology\nThe task of ethics if to be actively\ninvolved in disclosing the assumptions, values and interests being\n‘built into’ the design, implementation and use of the\ntechnology. The task of ethics is not to prescribe policies or\ncorrective action as such but to continue to open the ‘black\nbox’ for scrutiny and ethical consideration and\ndeliberation. \n\n\n\nPhenomenological Approach\n\n\nView of technology / society relationship\nTechnology and society co-constitute\neach other from the start. They are each other’s condition of\npossibility to be. Technology is not the artifact alone it is also the\ntechnological attitude or disposition that made the artifact appear as\nmeaningful and necessary in the first instance. However, once in\nexistence artifacts and the disposition that made them meaningful also\ndiscloses the world beyond the mere presence of the artifacts.\n\n\nApproach to ethical implications of technology\nThe task of ethics is ontological\ndisclosure. To open up and reveal the conditions of possibility that\nmake particular technologies show up as meaningful and necessary (and\nothers not). It seeks to interrogate these constitutive conditions\n(beliefs, assumptions, attitudes, moods, practices, discourses, etc.)\nso as to problematize and question the fundamental constitutive\nsources of our ongoing being-with technology. \n\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Achterhuis, H. (ed.), 2001, <em>American Philosophy of Technology:\nThe Empirical Turn </em>, Bloomington: Indiana University Press.",
                "Baudrillard, J., 1983, <em>Simulations</em>, New York:\nSemiotext(e).",
                "Bijker, W. E., 1995, <em>Of Bicycles, Bakelites and Bulbs. Toward\na Theory of Sociotechnical Change</em>, Cambridge, MA: MIT Press.",
                "–––, 2003. “The Need for Public\nIntellectuals: A Space for STS,” <em>Science Technology &amp;\nHuman Values</em>, 28(4): 443–50.",
                "–––, W., T. Pinch, and T. Hughes, 1987, <em>The\nSocial Construction of Technological Systems: New Directions in the\nSociology and History of Technology</em>, Cambridge, MA: MIT\nPress.",
                "Borgmann, A., 1984, <em>Technology and the Character of\nContemporary Life</em>, Chicago: University of Chicago Press.",
                "–––, 1999, <em>Holding On to Reality</em>,\nChicago/London: University of Chicago Press.",
                "Brey, P., 1997, “Philosophy of Technology meets Social\nConstructivism.” <em>Techne´: Journal of the Society for\nPhilosophy and Technology</em>, 2(3&amp;4): 56–79.",
                "–––, 2000, “Disclosive Computer\nEthics,”<em>Computers and Society</em>, 30(4): 10–16.",
                "–––, 2004, “Ethical Aspects of Face\nRecognition Systems in Public Places,” <i>Journal of\nInformation, Communication &amp; Ethics in Society</i>, 2(2):\n97–109.",
                "–––, 2006, “Freedom and Privacy in Ambient\nIntelligence,” <i>Ethics and Information Technology</i>, 7(3):\n157–166. ",
                "Coyne, R., 1995, <em>Designing information technology in the\npostmodern age: From method to metaphor</em>, Cambridge MA: MIT\nPress.",
                "Dreyfus, H.L., 1999, “Anonymity versus commitment: The\ndangers of education on the internet,” <em>Ethics and\nInformation Technology</em>, 1(1): 15–20, 1999",
                "–––, 2001, <em>On the Internet</em>, London:\nRoutledge.",
                "–––, 1992, <em>What Computers Still Can’t\nDo: A Critique of Artificial Reason</em>, Cambridge, MA: MIT\nPress.",
                "Feenberg, A., 1991, <em>Critical Theory of Technology</em>,\nOxford: Oxford University Press.",
                "–––, 1999, ‘Technology and Meaning’,\nin <em>Questioning Technology</em>, London and New York: Routledge,\n183–199.",
                "Fernback, J., 1997, “The Individual within the Collective:\nVirtual Ideology and the Realization of Collective Principles.”\nIn Steven G. Jones (Ed.), <em>Virtual Culture: Identity and\nCommunication in Cybersociety</em>, London: Sage, 36–54.",
                "Friedman, B. (ed.), 1997, <em>Human Values and the Design of\nComputer Technology</em>, New York: Cambridge University Press and\nCSLI, Stanford University.",
                "Gert, B., 1999, “Common Morality and Computing,”\n<em>Ethics and Information Technology</em>, 1(1): 57–64.",
                "Gorniak, K., 1996, “The Computer Revolution and the Problem\nof Global Ethics,” <em>Science and Engineering Ethics</em>,\n2(2): 177–190.",
                "Harman, G., 2009, <em>Prince of Networks</em>: <em>Bruno Latour\nand Metaphysics</em>, Melbourne: Re.press.",
                "Heidegger, M., 1977, <em>The Question Concerning Technology and\nOther Essays</em>, New York: Harper Torchbooks.",
                "Heim, M., 1993, <em>The Metaphysics of Virtual Reality</em>, New\nYork: Oxford University Press.",
                "–––, 1999, <em>Electric Language</em>, New York:\nYale University Press.",
                "Horn, S., 1998, <em>Cyberville. Clicks, Culture, and the Creation\nof an Online Town</em>, New York: Warner Books.",
                "Ihde, D., 1990, <em>Technology and the Lifeworld: From garden to\nearth</em>, Bloomington and Indianapolis: Indiana University\nPress.",
                "–––, 1995, <em>Postphenomenology: Essays in the\nPostmodern Context</em>, Evanston: Northwestern University Press.",
                "–––, 2002, <em>Bodies in Technology</em>,\nMinneapolis: University of Minnesota Press.",
                "–––, 2003, “If Phenomenology is an\nAlbatross, Is Post-phenomenology possible?” in Don Ihde and Evan\nSelinger (eds.), <em>Chasing Technoscience: Matrix for\nMateriality</em>, Indianapolis: Indiana University Press,\n15–26.",
                "–––, 2010, <em>Heidegger’s Technologies:\nPostphenomenological Perspectives</em>, New York: Fordham University\nPress.",
                "Introna, L.D., 1997, “On Cyberspace and Being: Identity,\nSelf and Hyperreality.” <em>Philosophy in the Contemporary\nWorld</em>, 4(1&amp;2): 16–25.",
                "–––, 2007, “Maintaining the Reversibility\nof Foldings: Making the ethics (politics) of information technology\nvisible,” <i>Ethics and Information Technology</i>, 9(1):\n11–25. ",
                "Introna, L.D., and Brigham, M., 2007, “Reconsidering\nCommunity and the Stranger in the Age of Virtuality,” <i>Society\nand Business Review</i>, 2(2): 166–178.",
                "Introna, L.D., and Ilharco, F.M., 2003, “The Ontological\nScreening of Contemporary Life: A Phenomenological Analysis of\nScreens,” <em>European Journal of Information Systems</em>,\n13(3): 221–234.",
                "Introna, L.D., and Nissenbaum, H., 2000, “The Internet as a\nDemocratic Medium: Why the politics of search engines matters,”\n<em>Information Society</em>, 16(3): 169–185.",
                "Introna, L.D., and Wood, D., 2004, “Picturing Algorithmic\nSurveillance: The Politics of Facial Recognition Systems,”\n<em>Surveillance and Society</em>, 2(2&amp;3): 177–198.",
                "Irwin, S., and Ihde, D., 2016, <em>Digital Media:\nHuman–Technology Connection</em>, Lanham; Boulder; New York;\nLondon: Lexington Books.",
                "Johnson D. G., 1985, <em>Computer Ethics</em>, Englewood Cliffs,\nNJ: Prentice-Hall.",
                "–––, 1994, <em>Computer Ethics</em>, 2nd\nedition, Englewood Cliffs, NJ, Prentice-Hall.",
                "Latour, B., 1991, “Technology is society made\ndurable.” in J. Law (ed) <em>A Sociology of Monsters: Essays on\nPower, Technology and Domination</em>, London: Routledge,\n103–131.",
                "–––, 2002, “Morality and Technology: The\nEnd of the Means,” <em>Theory, Culture &amp; Society</em>,\n19(5&amp;6): 247–60.",
                "–––, 2005, <em>Reassembling the Social: An\nIntroduction to Actor-Network-Theory</em>, Oxford: Oxford University\nPress.",
                "Law, J., 1991, <em>The Sociology of Monsters: Essays on Power,\nTechnology and Domination</em>, London: Routledge.",
                "Levinas, E., 1991, <em>Otherwise than Being or Beyond\nEssence</em>, Dordrecht: Kluwer Academic Publishers.",
                "–––, 1996, “Ethics as First\nPhilosophy,” in <em>The Levinas Reader</em>, S. Hand (ed.),\nLondon: Blackwell, 75–87.",
                "Lipinski, T. A. and Britz, J. J., 2000, “Rethinking the\nOwnership of Information in the 21<sup>st</sup> Century: Ethical\nImplications.” <i>Ethics and Information Technology</i>, 2(1):\n49–71.",
                "Moor, J. H., 1985, “What is computer ethics?”\n<em>Metaphilosophy</em>, 16(4): 266–279.",
                "Pitt, J.C., 2000, <em>Thinking about Technology: Foundations of\nthe Philosophy of Technology</em>, New York: Seven Bridges Press.",
                "Postman, N., 1993, <em>Technopoly: The Surrender of Culture to\nTechnology</em>, New York: Alfred A. Knopf.",
                "Powers, T.M., 2004, “Real wrongs in virtual\ncommunities,” <i>Ethics and Information Technology</i>, 5(4):\n191–198. ",
                "Rheingold, H., 1993a, “A Slice of Life in My Virtual\nCommunity.” In L. Harasim (ed.), <em>Global Networks. Computers\nand International Communication</em>, Cambridge, MA: The MIT Press,\n57–80.",
                "–––, 1993b, <em>The Virtual Community:\nHomesteading on the Electronic Frontier</em>, Reading, Mass:\nAddison-Wesley.\n [<a href=\"http://www.rheingold.com/vc/book/\" target=\"other\">Preprint available online</a>.]",
                "Rosenberger, R., 2012, “Embodied Technology and the Dangers\nof Using the Phone While Driving,” <em>Phenomenology and the\nCognitive Sciences</em>, 11(1): 79–94.",
                "Rosenberger, R., and Verbeek, Peter-Paul (eds.), 2015,\n<em>Postphenomenological Investigations: Essays on\nHuman–Technology Relations</em>, London: Lexington Books.",
                "Selinger, Evan (ed.), 2006, <em>Postphenomenology: A Critical\nCompanion to Ihde</em>, Albany: State University of New York\nPress.",
                "Silverstone, R., 2002, “Complicity and Collusion in the\nMediation of Everyday Life,” <em>New Literary History</em>,\n33(4): 761–80.",
                "–––, 2003, “Proper Distance: Towards an\nEthics for Cyberspace.” In G. Liestol, A.Morrison and T.\nRasmussen (eds), <em>Digital Media Revisited</em>, Cambridge MA: MIT\nPress, 469–91.",
                "Stiegler, B., 1998, <em>Technics and Time, 1: The Fault of\nEpimetheus</em>, Stanford: Stanford University Press.",
                "–––, 2009, <em>Technics and Time, 2:\nDisorientation</em>, Stanford: Stanford University Press.",
                "Taylor, C., 1991, <em>The Ethics of Authenticity</em>, Cambridge,\nMA: Harvard University Press.",
                "Turkle, S., 1996, “Parallel lives: Working on identity in\nvirtual space.” in D. Grodin &amp; T. R. Lindlof, (eds.),\n<em>Constructing the self in a mediated world</em>, London: Sage,\n156–175.",
                "–––, 1995, <em>Life on the Screen –\nIdentity in the Age of the Internet</em>, New York: Simon and\nSchuster.",
                "Vaccari, A., 2009 “Unweaving the Program: Stiegler and the\nHegemony of Technics” <em>Transformations</em>, 17,\n <a href=\"http://www.transformationsjournal.org/issues/17/article_08.shtml\" target=\"other\">available online</a>.",
                "Verbeek, P.P., 2005, <em>What Things Do – Philosophical\nReflections on Technology, Agency, and Design</em>, University Park:\nPennsylvania State University Press.",
                "–––, 2008, “Obstetric Ultrasound and the\nTechnological Mediation of Morality – A Postphenomenological\nAnalysis.” <i>Human Studies</i>, 31(1): 11–26.",
                "Virilio, P., 1994, <em>The Vision Machine</em>, Bloomington, IN:\nIndiana University Press.",
                "Winner, L., 1980, “Do Artefacts Have Politics.”\n<em>Daedalus</em>, 109: 121–36."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Achterhuis, H. (ed.), 2001, <em>American Philosophy of Technology:\nThe Empirical Turn </em>, Bloomington: Indiana University Press.</li>\n<li>Baudrillard, J., 1983, <em>Simulations</em>, New York:\nSemiotext(e).</li>\n<li>Bijker, W. E., 1995, <em>Of Bicycles, Bakelites and Bulbs. Toward\na Theory of Sociotechnical Change</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2003. “The Need for Public\nIntellectuals: A Space for STS,” <em>Science Technology &amp;\nHuman Values</em>, 28(4): 443–50.</li>\n<li>–––, W., T. Pinch, and T. Hughes, 1987, <em>The\nSocial Construction of Technological Systems: New Directions in the\nSociology and History of Technology</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Borgmann, A., 1984, <em>Technology and the Character of\nContemporary Life</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1999, <em>Holding On to Reality</em>,\nChicago/London: University of Chicago Press.</li>\n<li>Brey, P., 1997, “Philosophy of Technology meets Social\nConstructivism.” <em>Techne´: Journal of the Society for\nPhilosophy and Technology</em>, 2(3&amp;4): 56–79.</li>\n<li>–––, 2000, “Disclosive Computer\nEthics,”<em>Computers and Society</em>, 30(4): 10–16.</li>\n<li>–––, 2004, “Ethical Aspects of Face\nRecognition Systems in Public Places,” <i>Journal of\nInformation, Communication &amp; Ethics in Society</i>, 2(2):\n97–109.</li>\n<li>–––, 2006, “Freedom and Privacy in Ambient\nIntelligence,” <i>Ethics and Information Technology</i>, 7(3):\n157–166. </li>\n<li>Coyne, R., 1995, <em>Designing information technology in the\npostmodern age: From method to metaphor</em>, Cambridge MA: MIT\nPress.</li>\n<li>Dreyfus, H.L., 1999, “Anonymity versus commitment: The\ndangers of education on the internet,” <em>Ethics and\nInformation Technology</em>, 1(1): 15–20, 1999</li>\n<li>–––, 2001, <em>On the Internet</em>, London:\nRoutledge.</li>\n<li>–––, 1992, <em>What Computers Still Can’t\nDo: A Critique of Artificial Reason</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Feenberg, A., 1991, <em>Critical Theory of Technology</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 1999, ‘Technology and Meaning’,\nin <em>Questioning Technology</em>, London and New York: Routledge,\n183–199.</li>\n<li>Fernback, J., 1997, “The Individual within the Collective:\nVirtual Ideology and the Realization of Collective Principles.”\nIn Steven G. Jones (Ed.), <em>Virtual Culture: Identity and\nCommunication in Cybersociety</em>, London: Sage, 36–54.</li>\n<li>Friedman, B. (ed.), 1997, <em>Human Values and the Design of\nComputer Technology</em>, New York: Cambridge University Press and\nCSLI, Stanford University.</li>\n<li>Gert, B., 1999, “Common Morality and Computing,”\n<em>Ethics and Information Technology</em>, 1(1): 57–64.</li>\n<li>Gorniak, K., 1996, “The Computer Revolution and the Problem\nof Global Ethics,” <em>Science and Engineering Ethics</em>,\n2(2): 177–190.</li>\n<li>Harman, G., 2009, <em>Prince of Networks</em>: <em>Bruno Latour\nand Metaphysics</em>, Melbourne: Re.press.</li>\n<li>Heidegger, M., 1977, <em>The Question Concerning Technology and\nOther Essays</em>, New York: Harper Torchbooks.</li>\n<li>Heim, M., 1993, <em>The Metaphysics of Virtual Reality</em>, New\nYork: Oxford University Press.</li>\n<li>–––, 1999, <em>Electric Language</em>, New York:\nYale University Press.</li>\n<li>Horn, S., 1998, <em>Cyberville. Clicks, Culture, and the Creation\nof an Online Town</em>, New York: Warner Books.</li>\n<li>Ihde, D., 1990, <em>Technology and the Lifeworld: From garden to\nearth</em>, Bloomington and Indianapolis: Indiana University\nPress.</li>\n<li>–––, 1995, <em>Postphenomenology: Essays in the\nPostmodern Context</em>, Evanston: Northwestern University Press.</li>\n<li>–––, 2002, <em>Bodies in Technology</em>,\nMinneapolis: University of Minnesota Press.</li>\n<li>–––, 2003, “If Phenomenology is an\nAlbatross, Is Post-phenomenology possible?” in Don Ihde and Evan\nSelinger (eds.), <em>Chasing Technoscience: Matrix for\nMateriality</em>, Indianapolis: Indiana University Press,\n15–26.</li>\n<li>–––, 2010, <em>Heidegger’s Technologies:\nPostphenomenological Perspectives</em>, New York: Fordham University\nPress.</li>\n<li>Introna, L.D., 1997, “On Cyberspace and Being: Identity,\nSelf and Hyperreality.” <em>Philosophy in the Contemporary\nWorld</em>, 4(1&amp;2): 16–25.</li>\n<li>–––, 2007, “Maintaining the Reversibility\nof Foldings: Making the ethics (politics) of information technology\nvisible,” <i>Ethics and Information Technology</i>, 9(1):\n11–25. </li>\n<li>Introna, L.D., and Brigham, M., 2007, “Reconsidering\nCommunity and the Stranger in the Age of Virtuality,” <i>Society\nand Business Review</i>, 2(2): 166–178.</li>\n<li>Introna, L.D., and Ilharco, F.M., 2003, “The Ontological\nScreening of Contemporary Life: A Phenomenological Analysis of\nScreens,” <em>European Journal of Information Systems</em>,\n13(3): 221–234.</li>\n<li>Introna, L.D., and Nissenbaum, H., 2000, “The Internet as a\nDemocratic Medium: Why the politics of search engines matters,”\n<em>Information Society</em>, 16(3): 169–185.</li>\n<li>Introna, L.D., and Wood, D., 2004, “Picturing Algorithmic\nSurveillance: The Politics of Facial Recognition Systems,”\n<em>Surveillance and Society</em>, 2(2&amp;3): 177–198.</li>\n<li>Irwin, S., and Ihde, D., 2016, <em>Digital Media:\nHuman–Technology Connection</em>, Lanham; Boulder; New York;\nLondon: Lexington Books.</li>\n<li>Johnson D. G., 1985, <em>Computer Ethics</em>, Englewood Cliffs,\nNJ: Prentice-Hall.</li>\n<li>–––, 1994, <em>Computer Ethics</em>, 2nd\nedition, Englewood Cliffs, NJ, Prentice-Hall.</li>\n<li>Latour, B., 1991, “Technology is society made\ndurable.” in J. Law (ed) <em>A Sociology of Monsters: Essays on\nPower, Technology and Domination</em>, London: Routledge,\n103–131.</li>\n<li>–––, 2002, “Morality and Technology: The\nEnd of the Means,” <em>Theory, Culture &amp; Society</em>,\n19(5&amp;6): 247–60.</li>\n<li>–––, 2005, <em>Reassembling the Social: An\nIntroduction to Actor-Network-Theory</em>, Oxford: Oxford University\nPress.</li>\n<li>Law, J., 1991, <em>The Sociology of Monsters: Essays on Power,\nTechnology and Domination</em>, London: Routledge.</li>\n<li>Levinas, E., 1991, <em>Otherwise than Being or Beyond\nEssence</em>, Dordrecht: Kluwer Academic Publishers.</li>\n<li>–––, 1996, “Ethics as First\nPhilosophy,” in <em>The Levinas Reader</em>, S. Hand (ed.),\nLondon: Blackwell, 75–87.</li>\n<li>Lipinski, T. A. and Britz, J. J., 2000, “Rethinking the\nOwnership of Information in the 21<sup>st</sup> Century: Ethical\nImplications.” <i>Ethics and Information Technology</i>, 2(1):\n49–71.</li>\n<li>Moor, J. H., 1985, “What is computer ethics?”\n<em>Metaphilosophy</em>, 16(4): 266–279.</li>\n<li>Pitt, J.C., 2000, <em>Thinking about Technology: Foundations of\nthe Philosophy of Technology</em>, New York: Seven Bridges Press.</li>\n<li>Postman, N., 1993, <em>Technopoly: The Surrender of Culture to\nTechnology</em>, New York: Alfred A. Knopf.</li>\n<li>Powers, T.M., 2004, “Real wrongs in virtual\ncommunities,” <i>Ethics and Information Technology</i>, 5(4):\n191–198. </li>\n<li>Rheingold, H., 1993a, “A Slice of Life in My Virtual\nCommunity.” In L. Harasim (ed.), <em>Global Networks. Computers\nand International Communication</em>, Cambridge, MA: The MIT Press,\n57–80.</li>\n<li>–––, 1993b, <em>The Virtual Community:\nHomesteading on the Electronic Frontier</em>, Reading, Mass:\nAddison-Wesley.\n [<a href=\"http://www.rheingold.com/vc/book/\" target=\"other\">Preprint available online</a>.]</li>\n<li>Rosenberger, R., 2012, “Embodied Technology and the Dangers\nof Using the Phone While Driving,” <em>Phenomenology and the\nCognitive Sciences</em>, 11(1): 79–94.</li>\n<li>Rosenberger, R., and Verbeek, Peter-Paul (eds.), 2015,\n<em>Postphenomenological Investigations: Essays on\nHuman–Technology Relations</em>, London: Lexington Books.</li>\n<li>Selinger, Evan (ed.), 2006, <em>Postphenomenology: A Critical\nCompanion to Ihde</em>, Albany: State University of New York\nPress.</li>\n<li>Silverstone, R., 2002, “Complicity and Collusion in the\nMediation of Everyday Life,” <em>New Literary History</em>,\n33(4): 761–80.</li>\n<li>–––, 2003, “Proper Distance: Towards an\nEthics for Cyberspace.” In G. Liestol, A.Morrison and T.\nRasmussen (eds), <em>Digital Media Revisited</em>, Cambridge MA: MIT\nPress, 469–91.</li>\n<li>Stiegler, B., 1998, <em>Technics and Time, 1: The Fault of\nEpimetheus</em>, Stanford: Stanford University Press.</li>\n<li>–––, 2009, <em>Technics and Time, 2:\nDisorientation</em>, Stanford: Stanford University Press.</li>\n<li>Taylor, C., 1991, <em>The Ethics of Authenticity</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Turkle, S., 1996, “Parallel lives: Working on identity in\nvirtual space.” in D. Grodin &amp; T. R. Lindlof, (eds.),\n<em>Constructing the self in a mediated world</em>, London: Sage,\n156–175.</li>\n<li>–––, 1995, <em>Life on the Screen –\nIdentity in the Age of the Internet</em>, New York: Simon and\nSchuster.</li>\n<li>Vaccari, A., 2009 “Unweaving the Program: Stiegler and the\nHegemony of Technics” <em>Transformations</em>, 17,\n <a href=\"http://www.transformationsjournal.org/issues/17/article_08.shtml\" target=\"other\">available online</a>.</li>\n<li>Verbeek, P.P., 2005, <em>What Things Do – Philosophical\nReflections on Technology, Agency, and Design</em>, University Park:\nPennsylvania State University Press.</li>\n<li>–––, 2008, “Obstetric Ultrasound and the\nTechnological Mediation of Morality – A Postphenomenological\nAnalysis.” <i>Human Studies</i>, 31(1): 11–26.</li>\n<li>Virilio, P., 1994, <em>The Vision Machine</em>, Bloomington, IN:\nIndiana University Press.</li>\n<li>Winner, L., 1980, “Do Artefacts Have Politics.”\n<em>Daedalus</em>, 109: 121–36.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "computing: and moral responsibility",
            "information technology: and moral values",
            "phenomenology",
            "technology, philosophy of"
        ],
        "entry_link": [
            {
                "../computing-responsibility/": "computing: and moral responsibility"
            },
            {
                "../it-moral-values/": "information technology: and moral values"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../technology/": "technology, philosophy of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ethics-it-phenomenology\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ethics-it-phenomenology/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ethics-it-phenomenology&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/ethics-it-phenomenology/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ethics-it-phenomenology": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ethics-it-phenomenology/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ethics-it-phenomenology&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/ethics-it-phenomenology/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "“<a href=\"https://scholar.lib.vt.edu/ejournals/SPT/v7n2/feenberg.html\" target=\"other\">Active and Passive Bodies: Comments on Don Ihde’s <em>Bodies in Technology</em></a>,”\n online manuscript, 2004, Andrew Feenberg (Canada Research Chair in\nPhilosophy of Technology), Simon Fraser University.",
            "“<a href=\"https://www.sfu.ca/~andrewf/books/Essentialism_Constructivism_Philosophy_Technology_Crossroads.pdf\" target=\"other\">From Essentialism to Constructivism: Philosophy of Technology at the Crossroads</a>,”\n a critique of Heidegger’s view of technology, online manuscript by\nAndrew Feenberg.",
            "<a href=\"http://www.beyng.com/hlinks/techlinks.html\" target=\"other\">Heidegger and Technology Links</a>,\n links to papers on Heidegger’s view of technology."
        ],
        "listed_links": [
            {
                "https://scholar.lib.vt.edu/ejournals/SPT/v7n2/feenberg.html": "Active and Passive Bodies: Comments on Don Ihde’s Bodies in Technology"
            },
            {
                "https://www.sfu.ca/~andrewf/books/Essentialism_Constructivism_Philosophy_Technology_Crossroads.pdf": "From Essentialism to Constructivism: Philosophy of Technology at the Crossroads"
            },
            {
                "http://www.beyng.com/hlinks/techlinks.html": "Heidegger and Technology Links"
            }
        ]
    }
}