{
    "url": "evolution-cultural",
    "title": "Cultural Evolution",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Tim Lewens\n<tml1000@cam.ac.uk>\nAndrew Buskell\n<abuskell@gatech.edu>",
        "author_links": [
            {
                "mailto:tml1000%40cam%2eac%2euk": "tml1000@cam.ac.uk"
            },
            {
                "mailto:abuskell%40gatech%2eedu": "abuskell@gatech.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nTim Lewens\n&lt;<a href=\"mailto:tml1000%40cam%2eac%2euk\"><em>tml1000<abbr title=\" at \">@</abbr>cam<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;<br/>\nAndrew Buskell\n&lt;<a href=\"mailto:abuskell%40gatech%2eedu\"><em>abuskell<abbr title=\" at \">@</abbr>gatech<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sun Dec 23, 2007",
        "substantive revision Mon May 22, 2023"
    ],
    "preamble": "\n\nResearchers in the field of cultural evolutionary theory pursue an\neclectic program of investigation that lies at the intersection of\ncognitive science, anthropology, and evolutionary biology.\n“Cultural Evolutionary Theory”, as we understand it here,\nis most thoroughly exemplified in the ongoing research tradition\ninitiated in the 1970s and early 1980s by Cavalli-Sforza & Feldman\n(1981) on the one hand, and Boyd & Richerson (1985, 2005;\nRicherson & Boyd 2005) on the other.\n\nWhat makes this program cultural (in the eyes of its\nadherents) is its focus on the various ways in which humans—and\nother organisms—learn from other members of their species. These\ncapacities, usually described as forms of “social\nlearning”, or channels of “cultural inheritance”,\nare explored both as targets of explanation, and as drivers of change.\nIn other words, cultural evolutionary theorists ask questions about\nthe nature and origins of capacities for social learning, and also\nabout the effects of social learning on how populations change and\nadapt over time.\n\nWhat makes this program evolutionary resists any brief\nanswer, but some relevant factors include the following: researchers\nin this tradition often examine how cultural inheritance interacts\nwith the forms of inheritance (especially genetic inheritance) studied\nby mainstream evolutionary theorists; they seek to understand culture\nusing explanatory models and investigative tools adapted from those\nused in evolutionary and ecological theory; they reach back into human\npre-history when determining the origins of the capacity for culture;\nand they ask comparative questions concerning differences between\nspecies in terms of their abilities to create and maintain storehouses\nof valuable socially transmitted information.\n\nThe case in favor of some cultural evolutionary theory is\nirresistible. It is undeniable that members of our own species survive\nand reproduce in part because of habits, know-how and technologies\nthat are not only maintained by learning from others, but that are\nalso generated as part of a cumulative project that builds on\ndiscoveries made by others. Our species also contains sub-groups with\ndifferent habits, different norms, different forms of know-how, and\ndifferent artefactual supports for their ways of life, which are once\nagain generated and maintained through interaction with others. Social\nlearning is also an important agent of adaptation, and perhaps of\nspeciation, in animals. The interesting questions are not so much\nwhether cultural evolution is important, but precisely how theories of\ncultural evolution should be fashioned, and how they should be related\nto more traditional understandings of organic evolution.\n",
    "toc": [
        {
            "#NatuSeleCult": "1. Natural Selection and Culture"
        },
        {
            "#WhatEvol": "2. What Evolves?"
        },
        {
            "#CultConc": "2.1 The Culture Concept"
        },
        {
            "#TranInhe": "2.2 Transmission and Inheritance"
        },
        {
            "#ReprSele": "2.3 Reproduction and Selection"
        },
        {
            "#StroAnalMemeMeme": "3. A Strong Analogy: Memes and Memetics"
        },
        {
            "#ProbMemeMeme": "4. Problems with Memes and Memetics"
        },
        {
            "#CultUnitRepl": "4.1 Are Cultural Units Replicators?"
        },
        {
            "#DoCultUnitFormLine": "4.2 Do Cultural Units Form Lineages?"
        },
        {
            "#CultAtomDiscUnit": "4.3 Can culture be atomized into discrete units?"
        },
        {
            "#LoosAnal": "5. Looser Analogies"
        },
        {
            "#DualInheTheo": "5.1 Dual-Inheritance Theory"
        },
        {
            "#CultAttr": "5.2 Cultural Attraction"
        },
        {
            "#CultSyst": "5.3 Cultural Systems"
        },
        {
            "#PersProbExplPoweBiolAnal": "5.4 A Persisting Problem: The Explanatory Power of the Biology/Culture Analogy"
        },
        {
            "#ExteElab": "6. Extensions and Elaborations"
        },
        {
            "#CoevCultEvolCultEvol": "6.1 Coevolution and the Cultural Evolution of Cultural Evolution"
        },
        {
            "#CumuCult": "6.2 Cumulative Culture"
        },
        {
            "#CultGrouSele": "6.3 Cultural Group Selection"
        },
        {
            "#Evol": "6.4 Evolvability"
        },
        {
            "#Macr": "6.5 Macroevolution"
        },
        {
            "#Conc": "7. Conclusions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Natural Selection and Culture\n\nDarwin believed, as do biologists today, that natural selection can\nexplain the origin of many complex adaptive traits. In Darwin’s\noriginal presentation of natural selection, he requires that parent\norganisms differ in their abilities to survive and reproduce, and that\noffspring resemble their parents in terms of the traits that promote\nor inhibit these abilities (Darwin 1859).\n\nAs many have noted—including Darwin—this explanatory\nschema does not specify what mechanism accounts for parent-offspring\nresemblance. For example, offspring might learn skills from their\nparents, and thereby come to resemble them behaviorally. From the\nperspective of natural selection explanations, it does not matter why\noffspring resemble parents, only that they do resemble them. What is\nmore, the general schema associated with natural selection\nexplanations does not even require a population of reproducing\norganisms: it applies under any circumstances where entities in one\ngeneration give rise to resembling entities in a subsequent\ngeneration. In this sense, it is substrate-neutral.\n\nDarwin himself explicitly espouses the view that natural selection can\nact on entities other than organisms in the context of the cultural\nphenomenon of language change. This position is briefly explored in\nthe Origin of Species, and further expanded in the\nDescent of Man. In this latter work, he endorses the opinion\nof Max Müller:\n\n\n“A struggle for life is constantly going on amongst the words\nand grammatical forms in each language. The better, the shorter, the\neasier forms are constantly gaining the upper hand, and they owe their\nsuccess to their own inherent virtue”. (Darwin 1871: 60 [1877:\n91], paraphrasing Müller 1870: 257)\n\n\nDarwin asserts that this is no mere metaphor or loose analogy:\n“The survival or preservation of certain favoured words in the\nstruggle for existence is natural selection” (1870: 60–61\n[1877: 91]).\n\nThe pursuit of the cultural evolutionary project does not stand or\nfall with Müller’s thought that there are close affinities\nbetween processes of cultural change and the sorts of\nprocesses—of which natural selection is an example—that\nshape the organic world. Successful approaches can instead explore, in\nwhatever ways seem best for the task at hand, how learning makes a\ndifference to how species change and adapt over time. Nonetheless, as\na matter of fact, many cultural evolutionary theorists have made use\nof explanatory concepts and models adapted from mainstream\nevolutionary theory, and they have often justified this by arguing for\nimportant isomorphisms between the domain of biology and the domain of\nculture. Mesoudi (2011; Mesoudi, Whiten, & Laland 2006) is a\nuseful case-in-point, identifying not just “key Darwinian\nproperties” of variation, heritability, and selection, but also\npointing to disciplinary analogies between the study of cultural and\nbiological change.\n\nOf course, drawing analogies between cultural change and biological\nevolution far from settles philosophical questions about cultural\nevolution (see the discussion of analogical models in the entry\n models in science).\n Many cultural evolutionary terms evade rigorous and exhaustive\nexplication. “Culture”, “transmission”, even\n“evolution” merely gesture towards complex phenomena. This\nprovides latitude for researchers to fill in the analogical details\nbetween culture and biology in different ways (Sereno 1991; Stanley\n2021). What, for instance, is the “culture” that evolves?\nWhat does it mean to evolve? And what mechanisms are involved? We\naddress these questions in subsequent sections.\n2. What Evolves?\n2.1 The Culture Concept\n\nWhat evolves in cultural evolution? Philosophers and other researchers\nhave answered this question differently over the last hundred or so\nyears, with few signs of consensus (Sartori 2005; Descola 2005\n[2013]). The term “culture” now supports a range of uses\nin philosophy (See the entry on\n culture),\n the humanities (Kuper 1999; Risjord 2012) and empirical research\n(Driscoll 2017; Feinman & Neitzel 2020; Mohr et al. 2019; Buskell\nforthcoming). This widespread use facilitates different understandings\nof the extension of “culture” and the kinds of processes\nthat might change it.\n\nOne important contrast distinguishes distinct levels of\ncultural phenomena. Though it is quite common to refer to both\nindividual- and group-level phenomena as “culture”, it\nfrequently leads to confusion. For example, it can lead to conflation\nof talk about traits—things actually or\npossibly possessed by individuals, such as the ability to\nmake a Cornish pasty or to speak the Cornish language—and\n“the culture” of a group, as when one speaks of\n“Cornish culture”.\n\nCutting across the distinction in levels are distinct\npossible roles for “culture” (Risjord 2012).\n“Culture” might be a medium for carrying content; the\nbackground conditions needed for meaningful practices to be undertaken\n(Bourdieu 1972 [1977]; Ortner 1984; Rouse 2007); or the strategies\n(behaviours, technologies) adopted to deal with local ecological\nproblems (White 1949; Steward 1955). Positions might be cut finer\nstill: researchers differ on the character of the content carried, on\nthe nature of practices, and the set of strategies that matter\n(Risjord 2012).\n\nThere is, then, considerable variation in how the culture concept is\ndefined when one looks across disparate disciplines. If one focuses on\nthe community of researchers in cultural evolution, however, one finds\nthat Richerson and Boyd’s (2005) definition of culture is fairly\ntypical. Culture, they say, is\n\n\ninformation capable of affecting individuals’ behavior that they\nacquire from other members of their species through teaching,\nimitation, and other forms of social learning. (Richerson & Boyd\n2005: 5)\n\n\nThat is, “culture” is an individual-level phenomenon,\ncontent (“information”) is carried by a wide range of\nmaterial vehicles, and this content is communicated by a range of\ntransmission mechanisms. Though cultural evolutionary researchers\nmight talk about culture at the group-level, this tends to be an\naggregate measure or generic description of the\ncultural information held by individuals in group, where the group\nitself is delineated by other means (for instance, by ethnic identity,\ne.g., Richerson et al. 2016; Henrich 2020. See: Buskell forthcoming\nfor discussion).\n\nAdopting “information” as the underlying basis of culture\nbrings both risks and benefits (see related entries on\n information,\n and\n biological information).\n On the negative side, it is not clear how we are to understand the\nconcept of information. Boyd and Richerson, for example, give what\nmight look like a definition when they write that, by\n“information”, they mean\n\n\nany kind of mental state, conscious or not, that is acquired or\nmodified by social learning and affects behavior. (Richerson &\nBoyd 2005: 5)\n\n\nBut they later state that “some cultural information is stored\nin artefacts” (2005: 61), suggesting their comments are intended\nas a description of where most cultural information is to be found,\nand not as a definition of what cultural information is. When they do\noffer a definition, it invites obvious counterexamples. So, for\ninstance, in early work they write that information is\n“something which has the property that energetically minor\ncauses have energetically major effects” (Boyd & Richerson\n1985: 35). But the long training scientists undertake, and the large\namount of resources they might consume, to produce data and theories\n(often, in the form of written inscriptions) shows how highly\nenergetic causes can generate energetically minor effects. Nor is it\nclear what it means for some causal contributor to development to\ncount as an information-bearer, rather than some other kind of\ndevelopmental participant, such as an information-reader, or a\nbackground condition for information transfer (Oyama 1985 [2000];\nGriffiths 2001).\n\nSeen in a more positive light, the plasticity of the term supports a\nwide range of stipulative definitions of information (Lewens 2015).\nThese in turn facilitate an eclectic use of models and explanatory\ntools. Framing cultural evolution in informational terms might also\nsupport further borrowing from the theoretical study of biology. For\nexample, what are known are “major evolutionary\ntransitions” are sometimes characterized in terms of significant\nchanges to the way inherited information is stored, transmitted or\ninterpreted. In their pioneering discussion of these transitions,\nMaynard Smith and Szathmáry give examples including the initial\narrival of the genetic code, the advent of sexual reproduction, and\nepigenetic inheritance. They also cite the development of language as\na further example of an informational transition, illustrating the\npotential for an informational account of culture itself to integrate\nwith broader discussion in theoretical biology (Maynard Smith &\nSzathmáry 1995; Jablonka & Lamb 2006; Calcott &\nSterelny 2011)—a potential that is beginning to be actualized\n(e.g., Waring & Wood 2021).\n2.2 Transmission and Inheritance\n\nThere are two major approaches to marking out the distinctive nature\nof cultural transmission and inheritance. The first looks at important\naspects of the content of information; the second, the\nrelevant channel of transmission mechanisms.\n\nAs an example of the first approach, consider Jablonka and Lamb\n(2005). They claim that only some forms of social transmission make\nuse of a system of symbols. While it is true, for instance,\nthat some birds inherit their song by social transmission, this does\nnot imply that birdsong is a symbolic system. Humans, by contrast,\ntrade in publicly-accessible symbols.\n\nThis approach allows for further distinctions among types of symbol\nsystem that make them more or less amenable to change. In some cases,\nthe relationship between a symbol and what is represented is\narbitrary. This the case for a word like “airplane”, which\ndoes not look or sound like a plane. This arbitrariness can facilitate\nrapid change in the scripts or sounds used to denote a plane (Kelly et\nal. 2021). In cases of iconic symbolism, the relationship is\none of resemblance: signs for the airport do look like a plane. These\nmay be less likely to change (Miton & Morin 2021).\n\nJablonka and Lamb use the characteristic differences between typical\nmodes of social inheritance in animals and humans to illuminate the\nimpact symbolic transmission systems have on human cultural evolution\n(see also: Deacon 1997). Although they argue that there can be\nnon-linguistic symbolic systems (Jablonka & Lamb 2005: 224),\nlanguage exemplifies nicely the way in which systems of symbols\ncontain elements that can be recombined in countless ways to yield a\nvast array of different meaningful messages. Furthermore, repositories\nof symbolically stored information, such as books, computer databases,\nand libraries can also be searched, annotated, edited and so forth, in\nways that add to their power and versatility. Such repositories can be\npowerful means by which knowledge accumulates across generations.\n\nThis manner of thinking opens several challenging issues. One\nimportant issue is the degree to which symbolic systems resemble other\ninheritance systems. Consider, by way of example, Stegmann’s\n(2004) discussion of the sense in which the genetic code is\n“arbitrary”. One quickly realizes that attempts to specify\nwhat makes some inheritance system a symbolic system, and to\ndifferentiate between types of symbolic systems (linguistic,\nnon-linguistic and so forth) is philosophically demanding.\n\nA contrasting approach aims at distinguishing cultural inheritance and\ntransmission by focusing on a distinctive channel by which\ninformation moves. Typically, this identifies cultural inheritance\nwith information carried by mechanisms of social learning, as opposed\nto genetically transmitted information, or information transmitted via\nother “channels” (Boyd & Richerson 1985; Richerson\n& Boyd 2005). Yet what is social learning?\n\nIn an important overview of work on cultural evolution, Henrich\ndefines this key notion alongside the notion of “individual\nlearning” that it is regularly contrasted with:\n\n\n… social learning refers to any time an individual’s\nlearning is influenced by others, and it includes many different kinds\nof psychological processes. Individual learning refers to situations\nin which individuals learn by observing or interacting directly with\ntheir environment (Henrich 2016: 12)\n\n\nOne consequence of this definition (a consequence which Henrich\nexplicitly recognizes) is that “social learning” and\n“individual learning” are not exclusive. In our species it\nis rarely the case that what an individual learns is free from\ninfluence by others. Even in extreme cases, where we learn by probing\nour surroundings well away from social company, almost every aspect of\nthe environments we interact with—and hence what we end up\nlearning from those environments—has been affected by other\npeople’s past actions. The structures and contents of our\ndwellings and workplaces, the constitutions of the domesticated plants\nand animals we interact with, the cultivated and engineered\nenvironments we live in, all have been affected by the activities of\nour predecessors.\n\nYet as the distinction between social and individual learning blurs,\nthe question of whether there is a distinctive culture channel becomes\nless clear (Lewens 2017). For there are numerous ways in which\nactivities of one generation can, by altering or maintaining stable\nfeatures of biotic, social, and technical environments, have an\ninfluence over what individuals in the following generations end up\nlearning (Laland, Odling-Smee, & Feldman 2000).\n\nIn response to these concerns, researchers have been motivated to find\nfurther distinguishing characteristics of sub-varieties of social\nlearning. Henrich, for instance holds that\n\n\n…the least sophisticated forms of social learning occur simply\nas a by-product of being around others, and engaging in individual\nlearning.\n\n\nHe reserves the term “cultural learning” for the\n\n\nmore sophisticated subclass of social learning abilities in which\nindividuals seek to acquire information from others. (2016:\n12–13)\n\n\nCritics of these final comments (e.g., Clarke & Heyes 2017; Heyes\n2018) have urged further research concerning whether individual\nlearning—which, as we have seen, can take place in felicitously\nstructured environments—truly is less sophisticated than forms\nof learning directed to the behaviors of others. They encourage us to\nquestion whether there is an additional form of complexity in the\ncognitive mechanisms that underpin social (compared with individual)\nlearning, and whether social learning has greater functionality with\nrespect to the generation of increasingly refined behaviors,\ntechnologies, norms and institutions across populations.\n2.3 Reproduction and Selection\n\nWhile there may be a rough consensus among cultural evolutionists on\nthe informational character of culture—perhaps even the social\nnature of transmission—there is less consensus on the nature of\nselection or reproduction in the domain of culture.\n\nHere, skeptical arguments have set the stage. Fracchia and Lewontin\n(1999: 72–78), for instance, claim there are no analogs to\nbiological reproduction and natural selection in cultural evolution.\nThey take this to seriously undermine the predictive and explanatory\npower of the analogy. Worse, they say that attempts to fit culture\ninto an evolutionary scheme are procrustean, lopping off the social\npower relations and “sociocultural particularity” they\ntake to be at the core of explaining cultural change. Fracchia and\nLewontin argue instead for understanding cultural change as an\ninherently historical process, where explanations appeal to the\nparticular cultural histories of groups (an approach very similar to\nSahlins’s [1985]).\n\nIn response, cultural evolutionary researchers have offered a nested\ntaxonomy of explanatory frameworks that researchers might apply to\nunderstand culture, whose categories reflect increasingly close\napplications of the analogy between biology and culture. The hope is\nto confine concerns like Fracchia and Lewontin’s to the most stringent\nset of approaches, freeing up more liberal interpretations as the\nbasis for empirical work.\n\nClaidière, Scott-Phillips, and Sperber (2014) for instance,\ndistinguish between populational, evolutionary, selectional,\nand replicator frameworks for explaining cultural change.\nRoughly, populational frames provide explanations in terms of the\nfrequency of types that change over time. These could be token ideas,\nartifacts, or behaviors understood as instances of cultural\n“traits”. Evolutionary approaches are a sub-variety of\npopulational approaches: they assume that distributions of cultural\ntraits in a population can be explained by appeal to properties of\ndistributions at an immediately earlier time. Selectional approaches\nare a sub-variety of evolutionary approach, which appeal to a form of\ncultural natural selection to explain changes in frequencies of\ncultural traits. Finally, replicator approaches are a sub-variety of\nselectional approaches. They assume that cultural evolution acts on\ncultural “replicators”, where cultural replication is\nunderstood in a fairly demanding way. To illustrate the difference\nbetween some of these approaches, consider that a selectional\napproach to the technological evolution of tools, for example,\nrequires comparatively little. There must be variation and inherited\nresemblance over time, with some types of tool increasing their\nfrequency over others in virtue of better fittedness to local demands.\nA replicator approach adds the further requirement that these\ntools, or perhaps the ideas that give rise to them, make copies of\nthemselves in ways that closely parallel genetic replication.\n\nAside from memeticists (discussed in more detail below), few\ncultural evolutionary researchers are committed to the widespread\nexistence of cultural replicators. Instead, contemporary work in\ncultural evolution largely adopts a populational framework. But this\nframework encompasses many possible approaches. Perhaps the prevailing\napproach to “population thinking”, exemplified by many\nclassic studies in the literature (e.g., Cavalli-Sforza & Feldman\n1981; Boyd & Richerson 1985), denotes any effort that employs\nabstracted psychological profiles to explore the consequences of\nindividual-level learning dispositions for the population-level\nproperties of groups. We will see several examples of such thinking\nbelow in the section on “dual-inheritance”. The\nestablishment of population-level consequences are important, for they\nenable investigators to revise the constraints one might naively think\nmust bear on cultural inheritance if specific forms of cultural change\nare to occur.\n\nTo others, the lack—or sheer implausibility—of strict\nselectional or replicator frameworks have spurred exploration of\nmechanisms similar to, but not identical with, the natural\nselection schema. For instance, Strimling, Enquist, and Eriksson\n(2009) develop a model that appeals not just to differential\nrepresentation—that is, of traits in the minds of\nagents—but also to differential persistence in the face\nof new learning. Think of recipes. Home chefs will have learned how to\ncook many recipes over the years. Many will be too fussy, too complex,\nor too bland to warrant making more than once or twice. But some will\nbe winners. These will be recipes cooked time and time again. Though\nthe home chef will have learned how to cook all these recipes, both\nthe overwrought and the tried-and-true, only the latter\nstick, in the sense they are employed again and again. The\naddition of such “stickiness” to a mechanism of selection\nmakes it disanalogous to the natural selection schema, but perhaps not\nin a way that complicates the applicability of a more general\nevolutionary schema nor nearby notions like fitness (Ramsey & De\nBlock 2017).\n\nSimilarly, many have noted the disanalogies between social\ntransmission and biological reproduction. Only the former involves\nagents that recognize, reconstruct, and transmit traits if and when\nthey so choose (Cao 2020). To others, these disanalogies are just a\nproblem of locating the relevant spatiotemporal grain at which\nas-if reproductive relationships can be identified (e.g.,\nAcerbi & Mesoudi 2015).\n\nTo extract a general thread winding through this section, attempts to\n“save the phenomena” appear to limit the explanatory power\nof selective explanations. For if selection and reproduction rely on\nagential dispositions to recognize, reconstruct, retain, and express\ncultural traits—and if these dispositions strongly depend on\ncultural history and context—then selective explanations do not\nseem an advance on already operative social scientific methods (Sober\n1991). Consider that cultural selection should be able to explain the\nstriking fit between cultural traits, the technologies of particular\ngroups, and the local ecologies in which they operate. But the extent\nto which selective explanations are more illuminating than historical\nor agent-centered explanations is far from clear (Chellappoo 2022). We\nreturn to this point below.\n3. A Strong Analogy: Memes and Memetics\n\nConsider again the theory of memetics. This theory, originally put\nforward by Richard Dawkins (1976), is perhaps the best-known attempt\nto apply evolutionary thinking to culture. That said, while it has\nenjoyed considerable popular attention, it has not become\nwell-established in scientific circles (although see Shennan 2008,\n2011 for significant work that takes the meme’s-eye view).\n\nThe meme theory draws a strong analogy between evolution at the\ncultural level, and biological evolution. It begins with an abstract\ncharacterization of selection as a process requiring entities that\nreproduce, such that parents resemble offspring. It moves on to take\nthe more demanding view, popularized by Dawkins, that entities which\nhave the ability to make faithful copies of themselves—so-called\n“replicators”—are required to explain this\ntrans-generational resemblance. In standard biological models of\nevolution, it is assumed that genes are the relevant replicators.\nGenes make copies of themselves, and this ability explains why\noffspring organisms resemble their parents. If culture is to evolve,\nit therefore becomes necessary to find some cultural replicator that\nexplains cultural inheritance. Memes play this role. Dawkins gives a\nlist of some exemplary memes: “tunes, ideas, catch-phrases,\nclothes fashions, ways of making pots or of building arches”.\nNote that while it is sometimes assumed that all memes are ideas (and\nvice versa), Dawkins’s list includes other types of thing, such\nas ways of making pots, which are techniques (see the entry on\n replication and reproduction).\n\nDawkins’s claim is that ideas, for example, can be\nconceptualized as entities that hop from mind to mind, making copies\nof themselves as they go. On the face of things, this seems an\nattractive proposition. Just as genes make copies of themselves at\ndifferent rates according to their effects on the organisms that bear\nthem and on their local environments, so ideas make copies of\nthemselves at different rates according to their effects on the\norganisms that bear them and on their local environments. In a\ncommunity of scientists, for example, different hypotheses are\nentertained, and some come to be believed more widely than others. A\nhypothesis that begins in the mind of one or two scientists thereby\nspreads, until it is widely held in the research community. Another\nhypothesis quickly dies.\n\nWe can perhaps characterize the features that make some hypotheses\nlikely to spread, and others likely to perish. “Fit”\nhypotheses may have predictive power, or simplicity, or they may\nintegrate well with existing bodies of theory. Note that what this\nexample shows is that taking the meme’s-eye perspective does not\nliterally show that we are being manipulated by selfish cultural\nreplicators. One can describe scientific change as a struggle between\nselfish memes, but one can also describe just the same process in\nterms of scientists choosing to accept, or to reject, theories by\nreference to familiar criteria of explanatory power, theoretical\nelegance and so forth. It is only an incidental feature of the\nmetaphor of memetic selfishness that appears to deprive humans of\ncontrol over which ideas they do, and do not, accept.\n4. Problems with Memes and Memetics\n4.1 Are Cultural Units Replicators?\n\nReplicators are units that make high-fidelity copies of themselves.\nCritics of the meme concept, however, argue that there are no\nmechanisms that explain how memes are replicated in this fashion\n(Sperber 2000; Claidière & Sperber 2007). Though imitation\nhas often been suggested as a plausible mechanism, there are good\nreasons to think that imitation may be too error-prone to underpin\nreplication. If we make a Victoria sponge cake using a secret family\nrecipe, you eat the cake, and then attempt to make another one, then\nthe chances are that the recipe you hit upon will not, in fact, be\nexactly the same as the one we used, even if you are able to make a\nsimilar-tasting cake.\n\nAnother significant worry for memetics is that when the same ideas do\nspread through a population, it is rarely because they are literally\ncopied from each other. One alternative, for example, explains the\nrecurrence of traits via recognition and recall (Buskell & Tennie\nforthcoming). Returning to the cake example; perhaps you eat a slice\nof our Victoria sponge, you like it, and you decide to make one for\nyourself. Perhaps the recipe you use is very similar to ours. But you\nhave not figured out by tasting our cake which ingredients needed to\ngo in and in what order. Rather, you already knew how to make\na Victoria sponge. Eating our cake simply triggered the use of a\nrecipe that was already in your repertoire. In this case, the cake we\nproduced led to you to produce a similar one; but not because your\nrecipe is a copy of mine.\n\nA related form of explanation draws on Sperber’s (1996, 2000)\nclaim that cultural trait recurrence makes use of what he calls\n“attractors”. In paradigm cases, these are culturally\nshared patterns of thought, which enable representations to spread\nthrough a population without literal copying. How does this work? The\nidea is that much learning is in fact reconstructive, where agents\nmust infer and reconstruct the underlying form and content of a trait\nfrom observable instances or traces (Buskell 2017b). These\nreconstructions are biased due to shared patterns of thought, leading\nto systematic transformations of the form and content towards more\nattractive states. So, for example, if we have solid background\nexperience in cooking Indian dishes, we may be able to recreate a\nnewly encountered dal in such a way that my dal closely resembles the\none just tasted. But that might not be because we see the recipe and\ncopy it. It might not even be because we pay close attention to the\nspecific elements of the dal just tried and aim at re-creating its\ncomponent elements bit-by-bit. And it might not be because we already\nhave the specific recipe in our repertoire. Instead, the fact that we\nare familiar with the traditions of cooking this type of food—we\nalready know the sorts of ingredients used, the basic palette of\nmethods and so forth—mean that with just a brief taste we are\nalready primed to make something similar.\n\nError-prone imitation and non-replicative trait recurrence (like\nreconstructive learning) raise serious problems for the generality of\nmemetics: not all cultural traits are replicators, hence not all\ncultural traits are memes. Defenders of the meme concept have offered\ntwo different responses to this challenge.\n\nThe first is to make the conditions required for meme-hood less\ndemanding. Dennett (2017: 206), for example, seems to follow this path\nwhen he argues that memes constitute “ways: ways of doing\nsomething, or making something”, which are transmitted\nperceptually (rather than genetically). For Dennett, the meme concept\nhas pragmatic payoff because it draws attention to the existence of\nstable re-tokenings of these cultural “ways”, in a manner\nthat allows for cumulative forms of evolution via natural selection.\nAs we read him, this means that while Dennett does require a certain\nlevel of fidelity in terms of resemblance of cultural tokens through\ntransmission processes, he does not require a process of replication\nin the strict sense for an entity to count as a meme. Faithful\nresemblance is enough, even when underpinned by processes of\nSperberian “attraction”.\n\nThe second response, also suggested by Dennett (2017) as well as by\nCao (2020) among others, acknowledges that Sperberian arguments\nestablish that not all instances of cultural recurrence are instances\nof cultural replication. Hence not all cultural traits—even when\nreproduced faithfully—are memes. Even so, this leaves open the\npossibility that some—perhaps many—cultural traits are\nmemes. What is more, it invites the investigator to examine whether\nthere are distinctive differences in cultural evolutionary dynamics\nafforded by memetic and non-memetic cultural reproduction. Whether\nthis shows the meme concept to be useful depends on the sort of\ninsights to be had by distinguishing cultural inheritance that is\nmeme-like from cultural inheritance that is not (Sterelny 2006a).\n4.2. Do Cultural Units Form Lineages?\n\nA second important line of critique draws on the fact that while in\ngenetic replication one can trace a new copy of a gene back to a\nsingle parent, ideas are rarely copied from a single source in a way\nthat allows us to trace clear lineages (Boyd & Richerson 2000;\nGodfrey-Smith 2012).\n\nMemeticists are fond of analyzing religious belief in terms of the\nspread of memes. But while religious beliefs may well spread through\npopulations of humans, it seems unlikely that we will always be able\nto trace token instances of faith back to one source. Instead,\nindividuals often acquire belief in a God through exposure to several\nbelievers in their local community. In these circumstances, belief in\na God is not caused by one identifiable earlier token of the same\ntype.\n\nThis poses a problem for meme theories, because in biological\nevolution Mendel’s laws have been important for explaining some\naspects of evolutionary dynamics. Mendel’s laws rely on an\nunderstanding of genes as discrete, transmitted units. But if token\nideas can appear in an individual in virtue of that individual’s\nexposure to several sources, then this makes it unlikely that anything\nclose to Mendel’s laws will be discovered within cultural\nevolution. This suggests a practical limitation on inquiry that may\nresult from this difference between ideas and genes.\n\nCriticisms of this form have been forcefully put forward by William\nWimsatt (1999). He argues that the creative and inferential abilities\nof human users make it the case that any given idea, or item of\ntechnology, can have fluctuating numbers of cultural parents over\ntime. This is because the causal sources of its reproduction may vary.\nBelief in a God may sometimes be caused by exposure to a single\ncharismatic evangelist, sometimes by the joint inculcation of two\nbiological parents, and sometimes by immersion in a diffuse community\nof theists. There are no hard and fast rules of cultural\ninheritance.\n\nIdeas and items of technology also have no stable analogue to the\ngenome, or germline, because different elements within cycles of\ntechnological reproduction, including ideas, behaviours of artisans,\nand material elements of technologies themselves, can all temporarily\nacquire the status of replicators depending on the attention that\nhuman agents happen to be paying to them. Accidental variations in\none’s mental plan for constructing a pot, in actions producing\nthe pot, or in the finished pot itself, can all conceivably be\nreproduced when another artisan comes to make a resembling item.\nWimsatt uses these disanalogies to highlight the formidable problems\nfacing any effort to use population genetic models in the explanation\nof cultural change.\n4.3 Can culture be atomized into discrete units?\n\nIdeas stand in logical relations to each other. Whether an individual\ncan acquire some belief thus depends on conceptual competencies. It is\nimpossible to believe in the theory of relativity without\nunderstanding it, and one cannot understand it without holding many\nadditional beliefs relating to physics. The same is true for\nnon-technical beliefs. Depending on which religion one is talking\nabout, belief in God is likely to be related to various other beliefs\nconcerning forgiveness, retribution, love and so forth.\n\nThere are two problems here. The first is whether, and to what extent,\nculture can be decomposed into traits at all, and if so, how.\nCao (2020) argues that cultural traits should mostly be individuated\nrelative to the interests and capacities of the agents learning and\npassing them along. Though this does provide a route towards\nindividuating and distinguishing cultural traits, it should be cold\ncomfort to memeticists. Recall that for memeticists, memes are\nindividuated independently of the interest of agents, who are supposed\nto be mere hosts or scaffolds for the reproduction of further\nmemes.\n\nThe second problem concerns the extent to which replication\noperates over discrete traits, however individuated. The\nanthropologist Adam Kuper, for instance, complains that\n\n\nUnlike genes, cultural traits are not particulate. An idea about God\ncannot be separated from other ideas with which it is indissolubly\nlinked in a particular religion. (Kuper 2000: 180)\n\n\nMemeticists are likely to respond by saying that although ideas are\ninterlinked, this does not undermine the meme-gene analogy.\nO’Brien et al. (2010), for instance, have argued that a more\nmature view of the role of genes in evolution and development\nreinstates the meme-gene parallel. Genes, too, need to be studied in a\ncontext that takes other genes, and their broader developmental and\nenvironmental settings, into account. A DNA sequence can have\ndifferent effects in different organisms, depending on the network of\nrelations it enters into with other genetic and developmental\nresources. Just as the significance of belief in God can vary with\nsocial context, with the result that it can make little sense to think\nof “belief in God” in general as a single type of meme, so\nthe function of some DNA sequence can vary with organic context, with\nthe result that it makes little sense to identify some sequence type\nas a gene for the purposes of evolutionary analysis.\n\n5. Looser Analogies\n5.1 Dual-Inheritance Theory\n\nThe most sustained and respected approach to applying evolutionary\nthinking to culture begins from a different starting point than\nmemetics. This alternative view starts from the observation that\ncultural inheritance is important, and it seeks to integrate cultural\ninheritance into traditional evolutionary models. If the memetic\nframework tends to be driven by cultural analogies to genetic\nevolution, dual inheritance models are driven instead by a\ndesire to find ways of understanding how cultural inheritance affects\nevolutionary processes (Henrich & McElreath 2003). This approach\nneed not assume that cultural inheritance works in the same way as\ngenetic inheritance (see the entry on\n inheritance systems).\n\nResearchers working in this tradition model cultural inheritance in\nways that frequently depart from genetic inheritance: they may build\nin error-prone learning (e.g., Henrich 2001), acknowledge multiple\ncultural “parents” (e.g., Enquist et al. 2010), or\nemphasize the sequential (rather than all-at-once) acquisition of\ncultural traits (Buskell, Enquist, & Jansson 2019). Nonetheless,\nthese models remain recognizably evolutionary in style, primarily\nbecause they seek to explain changes in populational trait frequencies\nover time. They do this by using broad assumptions about how\nindividuals acquire cultural traits, and by assessing how these\nacquisition rules play out at the population-level. Moreover, these\nrules are not merely conjectured: they are given experimental backing.\nDual-inheritance theorists document the effects of various\nempirically-supported forms of bias, such as prestige bias. Just as\nDarwin’s own theory of evolution by natural selection remained\nlargely conjectural until supplemented by empirical work showing how\ninheritance worked—and by statistical work focusing on the\npopulation-level consequences of inheritance, selection, mutation and\nother forces—dual-inheritance theory has gained insights from a\nsimilar combination of empirical and mathematical approaches (e.g.,\nRicherson & Boyd 2005; Jordan 2015; Henrich 2016).\n\nModels in the dual-inheritance tradition sometimes aim at showing how\ncultural change of various sorts—and not necessarily adaptive\ncultural change—can affect genetic evolution, and vice versa.\nThese are models of gene-culture co-evolution. Other dual-inheritance\nmodels aim at assessing the cultural evolution of adaptations. In the\nlatter set of models, theorists are not merely seeking to explain\ndistributions of traits in populations, they are also seeking\nto explain the origin of valuable cultural novelties\n(Godfrey-Smith 2012).\n\nIn section 4 we argued that cultural change does not require cultural\nreplicators. Various strands of work indicate that this is true even\nwhen cultural change is adaptive. The general Darwinian scheme for\nexplaining adaptation demands reliable inheritance—that once a\nfitness-augmenting mutation arises, it can be retained in future\ngenerations. If cultural learning is error-prone, or if individuals\nacquire cultural traits by taking an average of many different models,\nthen one might think that even if some individual were able to\ndiscover a fitness-enhancing behavior, that trait will be lost to\nfuture generations either because it might be miscopied or because it\nmight be combined with less adaptive traits to produce an averaged\nmish-mash of a behavior. These considerations in favor of the\nimportance of replication have all been challenged by recent cultural\nevolutionary theory.\n\nCultural evolutionists agree that, at the level of the population,\ncumulative evolution requires that fitness-enhancing cultural traits\nare preserved in the offspring generation. However, they deny that\nthis requires faithful transmission between individuals. A formal\nmodel from Henrich and Boyd (1998) suggests that conformist\nbias—defined as the exaggerated tendency of individuals to adopt\nthe most common representation in a population—can overcome the\neffects of error-prone learning to produce reliable inheritance at the\npopulation level. Henrich and Boyd’s theoretical model assumes\nthat individuals are poor at inferring the representations of others.\nEven so, when one looks to the population level, conformist bias helps\nto correct the effects of such errors, by producing a population-wide\ndistribution of representations in the offspring generation that is\nclose to the population-wide distribution of representations in the\nparent generation. Henrich and Boyd explain the reason for this: in\ngeneral, error-prone transmission tends to produce a mixture of\ndifferent representations. In a population that already contains\nseveral different representations at significant frequencies, the\neffect of error on a population-wide distribution of representations\nis therefore low. In a population in which one representation is\ncommon, the effects of error are much more significant. But if we add\nconformist bias—and perhaps other biases, like prestige\nbias—we increase the chances of a commonly held representation\nremaining commonly held in future generations, even with error-prone\nimitation.\n\nBoyd and Henrich acknowledge that this mechanism does not ensure\npopulation-level distributions are perfectly reliably inherited. But\nthis does not mean that cumulative evolution acting on cultural\ninheritance is impossible. At the genetic level, highly faithful\ncopying processes allow even very small selective forces to preserve\nadaptive variation. Less faithful copying demands stronger selective\nforces if adaptive variation is not to be lost (Enquist et al. 2010).\nBoyd and Henrich are confident that selective forces in the cultural\nrealm are stronger than selective forces in the genetic realm. The\nmoral, once again, is that it is important not to focus too closely on\ngenetic evolution as a model for cultural evolution (Sterelny 2012;\n2021b).\n5.2. Cultural Attraction\n\nSperber, and other advocates of the approach to cultural evolution\nknown as “cultural epidemiology”, or “cultural\nattraction theory”, share with dual-inheritance theorists a\npopulational approach to cultural evolution:\n\n\nthe overall general framework for the study and modelling of cultural\nevolution should be that of “population thinking”\n…. (Claidière, Scott-Phillips, & Sperber 2014)\n\n\nTheir distinctive contribution lies in the claim that any successful\nexecution of this approach requires that explanations of the\ndistribution of cultural items pay close attention to what they call\ncultural “attractors” (Sperber 1996). Moreover, they argue\nthat this approach frequently (although not always) gives rise to\nexplanations that elude approaches grounded in forms of cultural\nselection.\n\nAs indicated earlier, Sperber argues that the simple notion of copying\nis only rarely appropriate to explain why broadly similar cultural\nitems propagate in a stable manner through a population. For example,\nwhen emotional states spread through communities—perhaps at\ntimes of national mourning—one individual’s expression of\ngrief can be causally initiated by another’s. But the second\nindividual does not closely imitate, or copy, the emotional state of\nthe first, even if the second emotional state resembles—and\nhence is a “reproduction” of—the first. Instead, a\nshared set of emotional dispositions, perhaps coupled to shared norms\nfor public behavior, conspire to reconstruct a similar emotional\nstate. Such recurrent states, which are the broadly stable outcomes of\nthese reconstructive processes, are examples of cultural\n“attractors”.\n\nWe gave a rough gloss on attractors above. It is worth underlining the\npoint, however, that an attractor should not be equated with the\npsychological attractiveness of some trait to individuals (Sperber\n1996; Buskell 2017a). Instead, an attractor is a more abstract notion\ncorresponding to the more-or-less stable outcome of processes of\ncultural reproduction. And very many different “factors of\nattraction” can potentially underpin such stable reproduction.\nFor example, if a widely encountered engineering problem has only a\nfew effective solutions, and these are also easy to figure out, then\none should expect those solutions to appear again and again, even if\nindividuals are not attempting to copy the innovations of others in\ndetail. Thus, factors of attraction need not be psychological at all;\nthey may be constellations of physical, ecological, and even\ninformational constraints (Falandays & Smaldino 2022). Shared\nbodies of information, shared preferences, and shared emotional or\ninferential biases might also explain why some cultural variants\nreappear with regularity.\n\nSome attractors may be grounded in evolved and universally held\ncognitive dispositions. Indeed, Sperber and like-minded colleagues\nhave often declared explicit debts to evolutionary psychology (Sperber\n1996). Yet cognitive attractors may also be local, corresponding to\nmore narrowly shared dispositions or biases held by communities. Such\ndispositions can explain reproduction that is only reliable across\nnarrowly specified cultural contexts. Work along these lines aims at\nanswering the charge that the cultural epidemiology approach is\nvacuous or not action-guiding for empirical work (e.g., Buskell 2019).\nIt does so by attempting to outline factors of attraction, and their\npopulational consequences, at various spatial and temporal scales\n(Morin 2011 [2016a]).\n5.3 Cultural Systems\n\nA more recent approach within the cultural evolutionary research\ncommunity—albeit one with a lengthy pedigree outside that\ndomain—examines cultural change through the lens of systems\nthinking (Buskell, Enquist, & Jansson 2019; Jansson et al. 2021).\nThis approach starts from an observation that there is a difference in\nhow cultural traits (in individuals and in groups) are acquired as\ncompared with biological traits: while the latter are largely\ninherited all at once (in a sexual species, at the moment of\nfertilization, say), cultural traits can be acquired over a protracted\nperiod of time. The sequential acquisition of cultural traits means\nthose acquired earlier in time can affect the acquisition of those\nencountered later.\n\nAcerbi, Enquist, and Ghirlanda (2009) illustrate the general idea of\nthe cultural systems approach with a model that explores the\ntransmission of traits that make individuals either “open”\nor “conservative”—that is, open to acquiring new\ntraits, or happy to sit tight. As they suggest, a trait making one\n“conservative” could spread to “open”\nindividuals—but the converse is not the case. Once an agent\nacquires the “conservative” trait, no new learning will\noccur. Expanding this line of thought, Jansson et al. (2021) argue for\nthe importance of cultural filters: collections of traits that\nregulate the attentiveness towards, evaluation of, and potential\nacceptance of novel traits. The general idea is that relations of\ncompatibility holding between already acquired traits will influence\nthe addition of new ones. Thus, idiosyncratic collections of traits\nand their respective compatibility profiles—themselves the\nresult of the sequential acquisition of traits—will modulate\ndownstream acquisition.\n\nThe systems approach is less overtly evolutionary than either\ndual-inheritance theory or cultural epidemiology. Proponents argue\nthat a systems approach provides a framework well-suited for\nformalizing and exploring the population level consequences of claims\nmade about culture in the humanities and social sciences. Yet given\nthe approach’s similarity to longstanding network approaches in\nquantitative sociology (e.g., Axelrod 1997; Centola 2015; Goldberg\n& Stein 2018), one might rightly wonder—at this point, what\nremains of the analogy between biology and culture?\n5.4 A Persisting Problem: The Explanatory Power of the Biology/Culture Analogy\n\nAt the beginning of this entry it was claimed that the case for\ncultural evolution was irresistible. No one can deny that cultural\ninheritance is an important factor in explaining how our species has\nchanged over time. In spite of all this, one might still worry that it\nis a mistake to understand the importance of culture using the tools\nof evolutionary theory. This is because one may be skeptical of the\nexistence of a theory that is both general enough to cover all forms\nof cultural change and informative enough to be enlightening.\n\nThere is no doubt that it is often important to remind\noverly-enthusiastic orthodox Darwinians of the importance of culture.\nFor example, it seems that the increased incidence of\nlactose-tolerance among human populations has arisen as a consequence\nof a cultural innovation—namely dairy farming. The relatively\nrecent appearance of this genetically-controlled adaptation\ndemonstrates that human physiological nature is something that\ncontinues to change, and it also demonstrates the causal impact of\nculture on genes (Richerson & Boyd 2005: 191–92). Such\nexamples by themselves show the rashness of any view that claims\neither that human nature has remained fixed since the Stone Age, or\nthat genes are somehow in the evolutionary driving seat. Yet none of\nthis shows that we can develop a general, informative theory of\ncultural evolution. One might fear that, in the end, the influence of\nculture on aspects of the human species is best understood through a\nseries of more idiosyncratic narratives.\n\nOur brief examination of memetics illustrated this concern. We gain no\nreal explanatory insight if we are told that ideas spread through\npopulations, some more successfully than others. We want to know what\nmakes some ideas fitter than others. And it is not clear that there\nwill be any general rules that can help us to answer this question. In\nthe biological realm, we need detailed accounts of local environmental\ncircumstances, species-specific physiology and anatomy, and so forth,\nto tell us what makes one organic variant fitter than another.\nSimilarly, in the cultural realm we need to look at local\npsychological dispositions to explain why some ideas are more likely\nto spread than others. Thus any explanatory value to be had from\ncultural evolution may be parasitic on conventional work done in\npsychology. And if individual preferences are subject to change over\ntime, then there may be no general and informative theory of cultural\nevolution to be had; rather, we will have to settle for local\nexplanations that look to shifting preferences. Rather than provide a\nnew scientific framework for an understanding of culture, cultural\nevolution will tend to degenerate into conventional narrative cultural\nhistory (Fracchia & Lewontin 1999).\n\nIn a useful article, Elliott Sober (1991) suggests that theories of\ncultural evolution may have limited value for the work of social\nscientists, on the grounds that social scientists are primarily\ninterested in explaining what makes individuals likely to adopt one\nidea, rather than another. Perhaps culture is composed of replicating\nentities struggling against various selection pressures, but what\ninsight does this offer us, if in the end it presents us with nothing\nmore than an alternative idiom in which to describe the various\nfactors that affect the evaluation of culture? Perhaps clothes\nfashions are memes, but even if that is the case, one still needs to\nexplain what makes one clothing meme fitter than another, and the fear\nis that once spelled out this will quickly boil down to a well-known\nappeal to consumer psychology.\n\nOnce again, Dennett (2017) has offered a response on behalf of the\nmemetic approach, but it serves as a potential response from cultural\nevolutionary theorists more broadly. He draws attention to the risks\nof assuming an overly rational perspective on the factors influencing\nthe uptake of cultural traits: one should not assume that ideas are\nwidely adopted because they are understood and explicitly endorsed by\nthose who adopt them; one should not assume that technological\ninnovation occurs because users or designers understand the nature of\nthe contribution made by some novel variant. If, as Darwin argued, the\nselection, preservation and augmentation of organic variation (in the\nearly stages of domestication, for example) can sometimes be\nunconscious, it follows that the selection, preservation and\naugmentation of cultural variation can sometimes be unconscious,\ntoo.\n\nRicherson and Boyd respond in a different, albeit complementary way.\nThey say that Sober’s argument assumes, erroneously, that\n“we are all good intuitive population thinkers” (Richerson\n& Boyd 2005: 97). In Sober’s original article he points out\nthat population thinking might save cultural evolutionary models from\nvacuity in just this way:\n\n\nSo the question about the usefulness of these models of cultural\nevolution to the day-to-day research of social scientists comes to\nthis: Are social scientists good at intuitive population thinking? If\nthey are, then their explanations will not be undermined by precise\nmodels of cultural evolution. If they are not, then social scientists\nshould correct their explanations (and the intuitions on which they\nrely) by studying these models. (Sober 1991: 492)\n\n6. Extensions and Elaborations\n6.1 Coevolution and the Cultural Evolution of Cultural Evolution\n\nPerhaps the core assumption of all approaches to cultural evolution is\nthe thought that rampant social learning is an important explanatory\nprocess. Yet one may reasonably ask why it should be the case that we\nhave the ability to learn from others at all, given the adaptive costs\nof such a disposition.\n\nBoyd and Richerson (1985) claim that the overall adaptive benefits of\nlearning from non-parents outweigh the costs (Richerson & Boyd\n2005: Ch. 4). They give several reasons for this view. Suppose an\ninventive (or lucky) individual discovers some behavior, or technique,\nwhich augments fitness. If other individuals in the population can\ncopy that behavior, then their fitness will probably be augmented,\ntoo. It will often be difficult for individuals to ascertain which\nbehaviors in fact augment fitness, hence which behaviors should be\ncopied. The problem, then, is how to tune a learning mechanism so that\nbeneficial behaviors are copied, while non-beneficial behaviors are\nnot.\n\nBoyd and Richerson suggest that prestige bias can overcome\nthis problem: if individuals copy techniques from those who are in\nprestigious positions, then this increases the chances that they will\ncopy techniques that are, in fact, beneficial. As they put it,\n“Determining who is a success is much easier than\ndetermining how to be a success” (Richerson & Boyd\n2005: 124). Moreover, evidence has been accumulating for the reality\nof prestige bias. Henrich and Broesch (2011) have argued, based on\nfieldwork in Fiji, that an individual’s perceived success in a\nsingle domain of activity (for example, yam cultivation) predicts\nwhether that individual will be asked for advice in other domains (for\nexample, fishing). In other words, they claim that individuals are\naccorded a broad form of prestige, which affects their likelihood of\nserving as a cultural model. The value of prestige bias relies on the\nsupposition that those individuals who are able to get themselves into\nprestigious positions have a better than average tendency to make use\nof fitness-enhancing techniques.\n\nRicherson and Boyd (2005: 120–22) suggest other learning\nheuristics may be adaptive too. One we mentioned above is\nconformist bias. To say that someone has conformist bias is\nto say that the person in question tends to imitate those behaviors,\nbeliefs or other dispositions that are present among a high frequency\nof individuals in the population. More precisely, this bias is usually\ndefined as a heightened, or exaggerated, tendency to imitate the most\ncommon behavior. They argue (along with many others in the field) that\nconformist learning provides an individual learner with behaviors that\nare appropriate to novel situations. More specifically, they argue\nthat it is more adaptive in this regard than not imitating others at\nall, and more adaptive than imitating randomly-chosen members of a\npopulation. Conformist learning, they say, can help with the\nacquisition of behaviors appropriate to a new biological environment:\nwhen moving into a new habitat, with unknown plants and animals, it is\nbest to eat the foods the locals eat, for one thereby avoids\npoisoning. But it can also lead to the generation of socially\nappropriate behaviors, which will obviate ostracism or attack.\nSupporting this idea, Harris and Corriveau’s (2011) empirical\nwork concludes that while young children are unselective with regard\nto what they learn, they are far more selective regarding whom they\nlearn from. Moreover, they argue that children tend to seek out\ncultural conformists as individuals whom they should trust. These\nfindings offer some support for the existence of a form of conformist\nbias, although Lewens (2015) has suggested that both the theoretical\nand empirical cases for conformist bias may not be as strong as first\nmeets the eye, and Chellappoo (2021) has offered a similarly skeptical\nevaluation of the case made for prestige bias.\n\nReturning to the question that initiated this section—Why can we\nlearn from others at all, when what we learn often seems\ndetrimental?—these examples illustrate the form of\nmethodological adaptationism shared between much cultural evolutionary\nthinking and the evolutionary psychological approach it is sometimes\ncontrasted with (Lewens 2015). Cultural evolutionists tend to argue\nthat while the overall adaptive benefits of social learning\ndispositions in past environments explain their origination through\nnatural selection, this means neither that each specific learned trait\nmust lead to a fitness benefit, nor that the overall payoffs of\nlearning must still be positive in the context of modern informational\nenvironments that differ radically compared with those that confronted\nour ancestors.\n6.2 Cumulative Culture\n\nOther work done by cultural evolutionary researchers begins from\nconsiderations of explanatory puzzles similar to those that led Darwin\nto formulate his principle of natural selection in the first place.\nDarwin was concerned to explain how structures could arise which fit\norganisms so remarkably well to their conditions of existence.\nCultural evolutionists frequently draw attention to a variety of\nadaptive cultural traits, whose origination seems inexplicable in\nterms of individual innovation alone.\n\nHenrich (2016: 97–100), for example, makes good use of the\nexample of manioc processing. Manioc (also called cassava) is a good\nsource of starch, but it needs to be processed to make it safe to eat.\nWithout this processing it can release poisonous hydrogen cyanide.\nAccording to Henrich, while unprocessed manioc tastes bitter, the\nbitter taste is not a good indicator of its safety: bitterness\ndisappears in the preparation process before manioc becomes safe to\neat. Worse, while unprocessed manioc is poisonous, it is hard to\ndiscover that this is the case, because the symptoms of poisoning only\nappear well after eating unsafe manioc. Henrich argues that it is hard\nto see how any single insightful individual could have invented this\nprocessing technology. Instead, he argues that a more gradual process\nof cumulative cultural adaptation, spread across the\npopulation—a form of “hidden hand explanation”\nmodeled on organic selection—must be invoked.\n\nThe prevailing metaphor used to describe this process of cumulative\ncultural adaptation is that of a ratchet. Cultural traditions must be\nbuilt-upon—and must not “slip-back” over\ntime—if such adaptive traits are to be generated, maintained and\nfurther elaborated (Tomasello, Kruger, & Ratner 1993; Tomasello\n1999). In fact, such “incremental improvement” is taken to\nbe a “core criterion” of what is simply called\n“cumulative culture” (Mesoudi & Thornton 2018).\n\nTwo features of this characterization of cumulative culture have\nexercised commentators. The first is the “lumped”\ncharacter of the cumulative culture concept: the concept encompasses a\nset of evolutionary patterns, processes, and products that might\nbetter be kept distinct. Buskell (2022) for instance, suggests that\nthe underlying process of accumulation—the ratchet-like\nretention of modifications made to traits over time—should be\ndistinguished from the cultural evolutionary patterns (or\n“trends”) typically associated with it; notably, the\ncomplexity, adaptiveness, or efficacy typically associated with\ncumulative culture. This preserves the “ratchet” of\nmodification and retention, but distinguishes it from\n“incremental improvement”, opening up the possibility of\ngenerating both maladaptive and neutral traits. Just\nas copying errors or mutation may lead to deleterious or neutral forms\nof traits being passed on over time—so too might cumulative\nculture.\n\nA second set of concerns considers which features of cumulative\nculture, if any, mark it out as a distinctive kind of cultural\nevolutionary process. It is usual to express the ratcheting\nrequirement in terms of the need for high-fidelity in social learning.\nThis, in turn, is most obviously spelled out as a requirement for a\ntoken of a trait in a learner to faithfully resemble the token of the\nsame trait in the model. But it is not clear what “grain”\nof analysis should be chosen when determining resemblance (Charbonneau\n2020; Charbonneau & Bourrat 2021). Suppose Andrew sings a line\nfrom a song, and Tim attempts to copy him: does “high\nfidelity” learning require Tim to reproduce the same melody,\nmust he sing in the same key, must he sing with the same words, and\nthe same emotional emphases? Note that this also raises the linked\nquestion of what it takes for two tokens to be of the same trait type.\nIf Tim sings with different words and in a different key, are we\ndealing with tokens of the same, or a different trait type? There is\nplausibly value to the investigator in distinguishing different types\nof modification, rather than using a single “hi-fi/lo-fi”\ndimension. For example, one may wish to distinguish rearranging or\nmultiplying the elements involved in some complex behavior, from\naltering the nature of those elements themselves (Charbonneau 2016;\nBuskell 2020).\n\nLast are concerns about identifying instances of cumulative culture.\nWork in comparative cognition shows that culture is widespread among\nnon-human animals. Yet evidence for cumulative culture is contentious.\nTennie, Call, and Tomasello (2009: 2413) have argued that\n\n\nthe cultural traditions of non-human primate species…do not\nseem to accumulate modifications over time with any kind of ratchet\neffect.\n\n\nTheir view is that behavioral solutions in chimpanzees, for example,\nare always drawn from a limited repertoire—what Tennie and\ncolleagues (2009) call a zone of latent solutions\n(ZLS)—which contains only solutions that an individual\nmight potentially discover by itself. This does not mean that there is\nno element of accumulation in primate culture: Tennie et al note that\nan individual primate may be assisted in acquiring some behavior by\nthe performances of others, and by the use of discarded tools. There\nis, then, scope for limited building on the achievements of earlier\nindividuals. Even so, they suggest the ZLS places strong limits on\ncultural accumulation in these contexts. Regardless of whether the ZLS\napproach is a good means of evaluating the cultural capacities of\nanimals, the prevalence of animal cultural traits and the evolutionary\nrole of cumulative culture have been hotly disputed (Schuppli &\nvan Schaik 2019; Haidle & Schaludt 2020; Sterelny 2021b). If\nnothing else, this work suggests that identifying instances of\ncumulative culture among non-human animals is a difficult empirical\nissue.\n6.3 Cultural Group Selection\n\nIntroductory textbook examples of natural selection typically use\ncases where individual organisms differ with respect to how many\noffspring they have, and adaptations that promote individual fitness\nare selected as a consequence. For example, it is well-confirmed that\ncamouflage puts individual peppered moths at a selective advantage\nover less-well camouflaged individuals in the face of predation by\nbirds. However, theorists have regularly suggested that groups of\norganisms might also differ in their fitness, and that adaptations\npromoting group fitness might be favored by the action of selection at\nthis higher level (see the entry on\n units and levels of selection).\n In mainstream evolutionary theory, progress has been made in\ndisambiguating what is meant by group fitness—it can mean either\nthe ability of a group to produce individual organisms, or the ability\nof a group to produce new groups—and also in assessing how\nrobust the effects of group selection might be (Okasha 2006).\n\nSeveral leading theorists of cultural evolution have placed\nconsiderable stress on the importance of what they have called\nCultural Group Selection (sometimes abbreviated to “CGS”).\nCGS is a form of group-level selection that occurs when differences\nbetween groups of individuals are maintained by cultural inheritance.\nDarwin’s own work on the emergence of human morality helps set\nthe scene for the sort of explanatory problem that a group selection\nprocess (whether cultural or otherwise) is apt to solve. He points out\nthat forms of morally admirable behavior that benefit others can be\nhard to explain using simple appeals to natural selection. In many\ncases it seems an individual’s ability to leave offspring will\nbe promoted by selfish, rather than other-regarding, actions. However,\nthe detrimental effects of selection at the level of individuals can\nbe overcome if selection is efficient at a higher level:\n\n\nWhen two tribes of primeval man, living in the same country, came into\ncompetition, if…the one tribe included a great number of\ncourageous, sympathetic and faithful members, who were always ready to\nwarn each other of danger, to aid and defend each other, this tribe\nwould succeed better and conquer the other. (Darwin 1871: 162 [1877:\n130], wording from the 1877 edition which is slightly different than\nthe 1871 edition)\n\n\nDarwin writes of selection acting at the level of the\n“tribe” or the “community”. What makes the\nappeal to higher-level selection salient is its potential ability to\noverride a countervailing force at the individual-level.\nIndividual-level selection promotes self-regard, says Darwin, but\ncompetition between tribes favors other-regard (at least with respect\nto other members of one’s own tribe).\n\nThis feature is not always present in the recent invocations of CGS.\nConsider how Heyes (2018) understands CGS. She notes that cultural\ninheritance can often be “diffuse”: a trait such as the\nability to ascertain what others are thinking and feeling\n(“mind-reading”) is acquired in part by close interaction\nwith one’s parents as a baby, also by interaction with other\nrelatives and siblings, by engagement with other children, and by\nreflective exposure to sources such as novels and films under the\ninstruction of unrelated adults. In other words, these traits are\ninherited via complex crisscrossing networks. Heyes conjectures that\nthis form of inheritance tends to reduce variation within groups,\nthereby accentuating variation between groups, and establishing the\npossibility of “an adaptive response at the level of the social\ngroup” (2018: 41). In a more detailed presentation of her\nunderstanding of cultural group selection, she envisages two groups\n(for simplicity she calls them Right and Left). Each group has a\ndifferent prevalent version of some important cognitive mechanism.\nMost people in Left have M, most people in Right have\nM*. M and M* are stable features of Left\nand Right respectively, because they are inherited via diffuse forms\nof learning within those groups. If M* better enables\nindividuals to carry out some significant function, then people in\nRight may end up having more biological offspring than people in Left.\nThis means the Right group does better overall than Left and\nM* increases its representation in the population as a\nwhole.\n\nWe do not take issue here with the potential efficacy of the mechanism\nHeyes proposes. We do, however, question whether it is a form of CGS.\nHeyes thinks of this as CGS because one group is more successful than\nthe other, and because the inheritance of the traits of interest\n(M and M*) is achieved through forms of learning.\nBut this need not indicate a distinctively group-level process of\nselection. This is the cultural analogue of an old-fashioned problem\nin mainstream evolutionary theory. A herd of fast-running deer will do\nbetter in terms of reproductive output than a herd of slow-running\ndeer, but it does not follow that this indicates selection at the\nlevel of the herd. Here, the herd as a whole does better because of\nthe individual-level selection processes going on within it (Williams\n1966).\n\nRicherson and Boyd’s “Tribal Social Instincts”\napproach to CGS is much more closely aligned with Darwin’s own\nexplanation of features of human moral psychology. Their favored\nexplanatory hypothesis is a complex one, involving interaction between\nCGS and natural selection acting on genetic variation:\n\n\nSelection on tribes can account for the innate foundation of our\nsocial psychology via the process of gene-culture coevolution.\n(Richerson & Boyd 2005. See also: Boyd & Richerson 1985: Ch.\n7)\n\n\nThey argue, based on a mixture of historical, ethnographic and\ntheoretical work, for a scenario that begins with what they also call\n“tribes”—they consider these to be ethnolinguistic\nunits of around 500 to 1500 people—competing against each other\nin ways that are aided by culturally transmissible differences in\ngroup properties. This competitive process eventually produces\n\n\nculturally transmitted cooperative, group-oriented norms, and systems\nof rewards and punishments to ensure that such norms are obeyed.\n(Richerson & Boyd 2005: 196)\n\n\nOnce cultural transmission has established this social environment,\nnatural selection acting on genetic variation then favors an innate\npsychology that is suited to this new, socially-inherited set of\nenvironmental problems.\n\nThe Tribal Social Instincts hypothesis can be challenged on empirical\ngrounds: one can question the claims made about the innateness of the\nsocial psychological dispositions in question, the characterization of\nPleistocene social groups and conditions, the inability of more\ntraditional evolutionary resources to explain our altruistic\ntendencies, and so forth (see Birch 2017; Sterelny 2016, 2021b, 2022;\nand Birch & Buskell 2022). Such challenges are inevitable when a\nhypothesis is as ambitious as this one, and when it draws on such a\nvariety of supporting sources of data. There are also conceptual\nconcerns. The very idea of group selection has been a contested one\nwithin mainstream evolutionary theory. Some commentators have taken a\nskeptical view of group selection when underpinned by genetic\ninheritance, because of worries that competition based on genetic\nvariation within groups will tend to undermine the effects of\ncompetition between groups.\n\nSeveral cultural evolutionists (e.g., Boyd & Richerson 2009;\nHenrich 2016) reply that cultural inheritance processes are better\nable than processes of genetic inheritance to sustain between-group\ndifferences, for they believe there is good empirical and theoretical\nevidence that cultural processes can maintain within-group homogeneity\nin the face of various countervailing factors (immigration, unreliable\nimitation and so forth). This leads to further questions concerning\nhow, in general, to characterize CGS. Richerson, Baldini, et al.\n(2016) lists three different forms, of which straightforward\ncompetition between groups is just one variant. The second, selective\nimitation, happens when traits move from one group to another, when\nindividuals see their benefits and adopt them. The third, selective\nmigration, happens when individuals move from one group to another,\nonce again when they see the benefits of the traits in question. These\nare indeed additional ways by which behavioral traits that are of\nbenefit to a group can increase in frequency in a larger population of\ngroups. However, in the second two cases, trait frequencies are\nincreased simply by individuals’ attraction to traits that they\nregard as bestowing collective benefits. Because two of these three\nprocesses are quite different to what one might think of as a central\ncase of CGS—whereby groups compete against each\nother—critics such as Morin (2016b) have argued that they are\nnot helpfully regarded as group selection processes at all.\n\nRicherson and colleagues shrug off these concerns about labeling:\n\n\nThe main thing all three have in common is that they are driven by\nvariation among groups. We are not wedded to any particular\nterminology in this matter. (Richerson, Baldini, et al. 2016: §\nR4)\n\n\nThese issues need not be merely terminological, for (as we suggested\nfor Heyes’s work) they also raise basic theoretical concerns\nabout distinguishing individual-level selection from group-level\nselection. These concerns become especially acute in the context of a\nspecies able to observe and learn from others. For suppose individuals\nin group G1 slowly develop a process P1—perhaps a form of\nprocessing food—that gives each individual using it an advantage\nover the older technique P0. Within the neighboring group G2, everyone\nstill uses P0. Group G1 grows, flourishes, and expands its territory\nthanks to P1. Soon individuals in G2 notice the conspicuous success of\nthe ever-expanding G1, they notice their neighbors in G1 are mainly\nusing P1, and they start to adopt P1 as a consequence. This is a\nprocess whereby a group-beneficial trait spreads because of variation\nbetween groups. It is also an instance of selective imitation. But at\nleast in this case—because of the payoffs of P1 compared with P0\nfor individuals—to call it an instance of group selection\nthreatens to introduce confusion in the context of more general\nevolutionary theorizing. So selective imitation may sometimes be a\nmechanism for a form of group selection proper, but it need not always\nbe.\n6.4 Evolvability\n\nDarwin’s theory is intended to explain adaptation (see the entry\non\n adaptationism).\n The previous two sections have already touched on the general\nconditions required for novel cultural adaptations to emerge over\ntime. In the organic realm, these conditions are sometimes understood\nunder the general heading of “evolvability”. The\nphilosophical analysis of cultural evolutionary evolvability has been\npioneered in recent years by Kim Sterelny (e.g., 2001, 2003, 2006a,\n2006b, 2007, 2012, 2021a). Once again, let us illustrate the general\nnature of these issues by beginning in the organic realm.\n\nThe basic conditions required for natural selection—offspring\nthat resemble their parents with respect to fitness enhancing\ntraits—do not suffice for the appearance of functional traits\neven if they may help explain it. The environment also needs to\ncooperate: if selective pressures change very quickly then there will\nbe no sustained environmental demands of the sort that might build\ncomplex adaptations over time (Boyd & Richerson 1985). Development\nalso matters. If ontogeny is set up in such a way that changes to any\none trait tend to be accompanied by changes to all other traits, then\ncumulative adaptation will be hard to come by. Even in those cases\nwhere a mutation contributes positively to the function of one trait,\nthe chances are that it will contribute negatively to fitness in\nvirtue of disrupting the functioning of other traits (though, see\nBrown 2021). Development also needs to make a wide range of variation\navailable. If it is highly constrained, so that only a small number of\nforms are possible, then selection is not presented with a broad\nenough range of raw materials from which to fashion complex\ntraits.\n\nIt also seems that cumulative adaptation relies on the suppression of\n“outlaws” (Sterelny 2001, 2006b, 2016, 2021b). Group\nselection is often held to be an ineffective agent of group-level\nadaptation, on the grounds that it is vulnerable to “subversion\nfrom within”. This occurs when individual organisms go it alone,\nsabotaging complex features of group organization in favor of their\nown fitness (Birch 2017). Individual-level selection, in contrast, can\nbuild individual-level adaptations. This is because, by and large,\ngenes in a given human organism share a “common\nfate”—they do not behave as though they were in direct\ncompetition, struggling for representation in future generations. When\ngenes genuinely “go it alone”, for example by sabotaging\nmeiosis so that some have greater chances of appearing in future\ngenerations than others, then the overall integrity of the organism\ncan be compromised, and individual-level adaptation is undermined.\n\nBy applying these sorts of considerations to the cultural realm we can\nunderstand the likely costs and benefits associated with different\nmodes and forms of cultural inheritance (vertical, oblique, meme-like\nand so forth). We can also understand the different evolutionary\nforces that might bring these different forms of cultural inheritance\ninto existence. In turn, these insights may facilitate comparative\nwork that documents the general conditions required for a species to\nmake use of cultural inheritance in order to build complex adaptations\nsuch as tools. This way of thinking offers the promise, for example,\nof explaining why few, if any, non-human species build progressively\nmore and more complex cultural features in a cumulative manner\n(Richerson & Boyd 2005: 107; see also Laland 2017).\n\nQuestions relating to evolvability are also tied up with difficult\nissues relating to the units-of-selection debate (Okasha 2006). As we\nhave seen, natural selection at a higher level of organization may be\nrequired to generate mechanisms that suppress the ability of\ndisruptive “outlaws” to go it alone at lower levels of\norganization. Does something like this occur in the cultural realm?\nDoes selection on human groups act so as to limit the ability of\nindividual humans to go it alone? In what ways might cultural\ninheritance be involved in these processes? These questions are\ncomplex, both in terms of how they should be posed and how they should\nbe answered. But some of the most interesting work in cultural\nevolutionary theory may come from efforts to answer them.\n6.5 Macroevolution\n\nMany evolutionists have argued that biological tools can have great\nvalue when developing a historical view of the pattern of cultural\nchange (see, for example, Gray, Greenhill, & Ross 2007; Mace &\nHolden 2005; Lewens 2012, and the entry on\n macroevolution).\n Consider phylogenetics. A variety of biological methods have been\ndeveloped that help us to uncover the structure of evolutionary trees:\nthey show which taxa split from which others and when. It seems clear\nthat cultural items of many kinds (most obviously languages, but also\ntools and techniques) also stand in recognizable genealogical\nrelationships, and this has led many biological anthropologists to use\nphylogenetic methods borrowed or adapted from the biological sciences\nto reconstruct history in the cultural realm.\n\nCritics have sometimes followed Gould (1988) in arguing that these\nbiological methods cannot be properly applied to culture, because\ncultural genealogies invariably take the form of reticulated networks\nrather than branching trees. Cultural change is indeed often highly\nreticulated: it is obvious that a complex object like a car is a\nconfluence of numerous technical lineages, which come together to form\nthe hi-fi system, the engine, the safety devices, and so forth.\nMoreover, as improvements are made to cars these new developments may\nbe borrowed by innovators of bicycles, furniture, toys, and other\nshifting constellations of artifacts.\n\nThese important observations need not undermine the project of\ncultural phylogeny. One response is to look to those aspects of\nculture most amenable to phylogenetic reconstruction, such as deeply\nconserved linguistic terms (Cabrera 2017)—a strategy adopted by\nmany early adopters of phylogenetic methods. Another is to recognize\nthat biological evolution is also reticulated. Bacteria, for example,\ndo not form genealogically isolated lineages, hybridization is rife\namong plants, and there is also considerable borrowing of elements of\nthe genome between apparently isolated mammalian species. Of course,\nthis might show simply that phylogenetic modes of inference are doubly\nimperiled: they don’t work for much of the biological world\neither. But cultural evolutionists (e.g., Gray, Greenhill, & Ross\n2007) are encouraged by inferential developments within biology\nitself, which aim to reconstruct partially reticulated trees by\nproposing so-called “reconciliations” of the conflicting\ntrees that traditional methods often propose for species and genes.\nThese have shown promise beyond the original home of cultural\nphylogenetics in reconstructing trees based on language families,\nextending to archaeology and technology (Jordan 2015; Gjesfjeld &\nJordan 2019).\n\nThis kind of work is important, in part because of the uses to which\nwell-confirmed cultural phylogenies can be put. It may be easiest to\nillustrate their value via a simple example. On the face of things,\nlooking for correlations is a reasonable (albeit fallible) way to\ndiscover causal relationships. If, for example, people who smoke often\nget lung cancer, and people with lung cancer are often smokers, then\nwe have good evidence that smoking causes lung cancer (or perhaps that\nlung cancer causes smoking). But there can be strong correlations that\ndo not indicate causation. If, for example, we find that there is a\nstrong correlation in animals between making a moo sound and producing\nlarge quantities of milk, we should not conclude that one causes the\nother. Mooing and milk production go together because the creatures in\nquestion share ancestors in common, who both mooed and gave lots of\nmilk. Of course, in the case of cows this fact of common ancestry is\nso obvious that we hardly notice how it informs our causal inference.\nBut cultural phylogenies are unobvious. Russell Gray, among others,\nhas long argued that when we understand them better, our knowledge of\nphylogenies can then confirm, or undermine, causal hypotheses that are\nclaimed on the basis of correlation.\n\nGray and Watts (2017), for example, have scrutinized what is sometimes\ncalled the Supernatural Punishment Hypothesis. This is the hypothesis\nthat belief in powerful gods, who inflict punishment on wrongdoers,\ntends to result in societies better able to harness the fruits of\ncooperation (see Norenzayan et al. 2016). Gray and Watts again caution\nthat mere correlation between societies that believe in\n“moralising high gods” and various measures of social\ncomplexity does not count strongly in favor of the Supernatural\nPunishment Hypothesis. One must also consider the potentially\nconfounding consequences of shared ancestry among the societies\nsurveyed. Gray and Watts draw on Austronesian data to argue that\nbelief in moralizing high gods tends to be gained after, not before,\nthe emergence of political complexity. These data, they suggest,\nundermine the thought that moralizing high gods drive this form of\ncomplexity. That said, they do find some support for a weaker\nsupernatural punishment hypothesis based on belief in punishment\ninterventions from natural spirits, ancestral spirits and mythical\nheroes, as well as from moralizing high gods. In their view this type\nof belief facilitated, “the rise of political complexity”\nwithout “helping sustain it” (Gray & Watts 2017:\n7848). Work such as this indicates the potential for cultural\nphylogenetics to inform broad-sweep hypotheses about not just the\npatterns, but also the causal processes, that have marked the cultural\nhistory of our species.\n\nOf course, phylogenetic methods are far from the only means of\nreconstructing cultural history. More recently, archaeologists have\nargued for new methods and theories based on analogies between\narchaeology and paleobiology. Just as paleobiologists identify\nevolutionary trends and patterns by looking at the fossil\nrecord—notably, periodic mass extinctions and rates of\nspeciation—suitably rich archaeological databases might allow\nresearchers to discern distinctive patterns, processes, and trends in\nthe cultural evolutionary record (Perreault 2019; Gjesfjeld et al.\n2016). Perreault (2012), for instance, compares evolutionary and\narchaeological datasets to quantify the oft-informally made claim that\nculture evolution proceeds more quickly than biological evolution. A\ndifferent set of arguments considers how archaeological databases and\nstatistical techniques may help revise archaeological systematics and\ncultural taxonomy (Riede et al. 2020; Lyman 2021). The two efforts are\nrelated. Classificatory work may feedback into so-called\n“macro-archaeological” work that includes discerning rates\nof cultural diversification and extinction (Perreault 2019).\n7. Conclusions\n\nSome of the early philosophical and methodological skirmishes over\ncultural evolution focused on grand visions for the promise of the\napproach. So, for example, Mesoudi, Whiten, and Laland (2006) argued\nthat the social sciences had stagnated, while the biological sciences\nhad shown significant progress. They suggested that this pointed\ntowards an evolutionary synthesis within the social sciences that\nwould parallel biology’s own, and which would have a form of\nnatural selection at its core. Perhaps unsurprisingly, such a bold set\nof claims attracted vigorous responses that were equally sweeping; Tim\nIngold (2007) aimed to diagnose fundamental flaws within the entire\nenterprise of cultural evolution; Fracchia and Lewontin (1999)\nsuggested a series of in-principle topics (associated, for example,\nwith phenomena of power, and with the failures of methodological\nindividualism) which, they argued, undermined the ability of cultural\nevolutionary approaches to provide informative explanation.\n\nThis entry has pointed towards a different vision for cultural\nevolutionary work. Instead of beginning with a broad diagnosis of the\nsupposed failures of social science, or of the presence within culture\nof the general conditions required for natural selection processes to\nact, the cultural evolution project can be understood in a more\neclectic manner. It seeks to explore the significance of various forms\nof learning not just in humans, but in many other species. Although\nthis article has focused primarily on humans, cultural evolutionary\nscience increasingly investigates how learning influences adaptation\nand diversification in primates, birds, and fish. This prompts a\nseries of live research questions: how widespread are these learning\nabilities, and why did they arise in the first place? What explains\nwhy some species possess them in apparently very different forms to\nothers? How does change brought about by learning interact with other\nforms of change studied by evolutionists? What sorts of conditions are\nrequired for learning to promote long-lasting diversification within\nspecies? What sorts of conditions are required for learning to promote\nincremental improvements with respect to functional behaviours, or\nartifacts? In what ways does learning facilitate or impede the\norigination of other-regarding behavior, or systems of communication?\nAn approach focusing on these sorts of questions is free to co-opt and\ncollaborate with successful research strands in the mainstream social\nsciences, just as it is free to co-opt and adapt explanatory models\nwhich sometimes have their origins in disciplines like population\ngenetics, but which can just as well have their origins in\nepidemiology or economics.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Acerbi, Alberto and Alex Mesoudi, 2015, “If We Are All\nCultural Darwinians What’s the Fuss about? Clarifying Recent\nDisagreements in the Field of Cultural Evolution”, <em>Biology\n&amp; Philosophy</em>, 30(4): 481–503.\ndoi:10.1007/s10539-015-9490-2",
                "Acerbi, Alberto, Magnus Enquist, and Stefano Ghirlanda, 2009,\n“Cultural Evolution and Individual Development of Openness and\nConservatism”, <em>Proceedings of the National Academy of\nSciences</em>, USA, 106(45): 18931–18935.\ndoi:10.1073/pnas.0908889106",
                "Aunger, Robert (ed.), 2000, <em>Darwinizing Culture: The Status of\nMemetics as a Science</em>, Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780192632449.001.0001",
                "Axelrod, Robert M., 1997, <em>The Complexity of Cooperation:\nAgent-Based Models of Competition and Collaboration</em>, (Princeton\nStudies in Complexity), Princeton, NJ: Princeton University\nPress.",
                "Birch, Jonathan, 2017, <em>The Philosophy of Social\nEvolution</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198733058.001.0001",
                "Birch, Jonathan and Andrew Buskell, 2022, “How We Got Stuck:\nThe Origins of Hierarchy and Inequality”, <em>Mind &amp;\nLanguage</em>, 37(4): 751–759. doi:10.1111/mila.12420",
                "Bourdieu, Pierre, 1972 [1977], <em>Esquisse d’une\nthéorie de la pratique, précédé de trois\nétudes d’ethnologie kabyle</em>, Switzerland: Libraire\nDroz. Translated with revisions as <em>Outline of a Theory of\nPractice</em>, Richard Nice (trans.), (Cambridge Studies in Social\nAnthropology 16), Cambridge: Cambridge University Press, 1977.",
                "Boyd, Robert and Richerson, Peter J., 1985, <em>Culture and the\nEvolutionary Process</em>, Chicago: University of Chicago Press.",
                "–––, 2000, “Memes: Universal Acid or a\nBetter Mousetrap?”, in Aunger 2000: 143–162 (ch. 7).",
                "–––, 2005, <em>The Origin and Evolution of\nCultures</em>, Oxford/New York: Oxford University Press",
                "–––, 2009, “Culture and the Evolution of\nHuman Cooperation”, <em>Philosophical Transactions of the Royal\nSociety B: Biological Sciences</em>, 364(1533): 3281–3288.\ndoi:10.1098/rstb.2009.0134",
                "Brown, Rachael L., 2021, “Is Cultural Evolution Always Fast?\nChallenging the Idea That Cognitive Gadgets Would Be Capable of Rapid\nand Adaptive Evolution”, <em>Synthese</em>, 199(3–4):\n8965–8989. doi:10.1007/s11229-021-03190-9",
                "Buskell, Andrew, 2017a, “What Are Cultural\nAttractors?”, <em>Biology &amp; Philosophy</em>, 32(3):\n377–394. doi:10.1007/s10539-017-9570-6",
                "–––, 2017b, “Cultural Attractor Theory and\nExplanation”, <em>Philosophy, Theory, and Practice in\nBiology</em>, 9: article 13. doi:10.3998/ptb.6959004.0009.013",
                "–––, 2019, “Looking for Middle Ground in\nCultural Attraction Theory”, <em>Evolutionary Anthropology:\nIssues, News, and Reviews</em>, 28(1): 14–17.\ndoi:10.1002/evan.21762",
                "–––, 2022, “Cumulative Culture and Complex\nCultural Traditions”, <em>Mind &amp; Language</em>, 37(3):\n284–303. doi:10.1111/mila.12335",
                "–––, forthcoming, “Demographic Cultures\nand Demographic Skepticism”, <em>Review of Philosophy and\nPsychology</em>, first online: 8 April 2022.\ndoi:10.1007/s13164-022-00626-0",
                "Buskell, Andrew, Magnus Enquist, and Fredrik Jansson, 2019,\n“A Systems Approach to Cultural Evolution”, <em>Palgrave\nCommunications</em>, 5: article 131.\ndoi:10.1057/s41599-019-0343-5",
                "Buskell, Andrew and Claudio Tennie, forthcoming, “Mere\nRecurrence and Cumulative Culture at the Margins”, <em>The\nBritish Journal for the Philosophy of Science</em>, first online: 25\nOctober 2021. doi:10.1086/717776",
                "Cabrera, Frank, 2017, “Cladistic Parsimony, Historical\nLinguistics and Cultural Phylogenetics”, <em>Mind &amp;\nLanguage</em>, 32(1): 65–100. doi:10.1111/mila.12133",
                "Calcott, Brett and Kim Sterelny, 2011, “Introduction: A\nDynamic View of Evolution”, in <em>The Major Transitions in\nEvolution Revisited</em>, Brett Calcott and Kim Sterelny (eds.),\n(Vienna Series in Theoretical Biology), Cambridge, MA: MIT Press,\n1–14.",
                "Cao, Rosa, 2020, “Crowding out Memetic Explanation”,\n<em>Philosophy of Science</em>, 87(5): 1160–1171.\ndoi:10.1086/710518",
                "Cavalli-Sforza, Luca Luigi and Marcus W. Feldman, 1981,\n<em>Cultural Transmission and Evolution: A Quantitative Approach</em>,\n(Monographs in Population Biology 16), Princeton, NJ: Princeton\nUniversity Press.",
                "Centola, Damon, 2015, “The Social Origins of Networks and\nDiffusion”, <em>American Journal of Sociology</em>, 120(5):\n1295–1338. doi:10.1086/681275",
                "Charbonneau, Mathieu, 2016, “Modularity and Recombination in\nTechnological Evolution”, <em>Philosophy &amp; Technology</em>,\n29(4): 373–392. doi:10.1007/s13347-016-0228-0",
                "–––, 2020, “Understanding Cultural\nFidelity”, <em>The British Journal for the Philosophy of\nScience</em>, 71(4): 1209–1233. doi:10.1093/bjps/axy052",
                "Charbonneau, Mathieu and Pierrick Bourrat, 2021, “Fidelity\nand the Grain Problem in Cultural Evolution”, <em>Synthese</em>,\n199(3–4): 5815–5836. doi:10.1007/s11229-021-03047-1",
                "Chellappoo, Azita, 2021, “Rethinking Prestige Bias”,\n<em>Synthese</em>, 198(9): 8191–8212.\ndoi:10.1007/s11229-020-02565-8",
                "–––, 2022, “When Can Cultural Selection\nExplain Adaptation?”, <em>Biology &amp; Philosophy</em>, 37(1):\narticle 2. doi:10.1007/s10539-021-09831-0",
                "Claidière, Nicolas, Thomas C. Scott-Phillips, and Dan\nSperber, 2014, “How Darwinian Is Cultural Evolution?”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 369(1642): 20130368. doi:10.1098/rstb.2013.0368",
                "Claidière, Nicolas and Dan Sperber, 2007, “The Role\nof Attraction in Cultural Evolution”, <em>Journal of Cognition\nand Culture</em>, 7(1–2): 89–111.\ndoi:10.1163/156853707X171829",
                "Clarke, Ellen and Cecilia Heyes, 2017, “The Swashbuckling\nAnthropologist: Henrich on The Secret of Our Success”,\n<em>Biology &amp; Philosophy</em>, 32(2): 289–305.\ndoi:10.1007/s10539-016-9554-y",
                "Darwin, Charles, 1859, <em>On the Origin of Species</em>, London:\nJohn Murray. First edition reprinted with an introduction by Ernst\nMayr, Harvard: Harvard University Press, 1964.",
                "–––, 1871/1877, <em>The Descent of Man</em>,\nLondon: John Murray. Second edition 1877. Reprint of second edition,\nwith an introduction by Adrian Desmond and James Moore, London:\nPenguin, 2004.",
                "Dawkins, Richard, 1976, <em>The Selfish Gene</em>, Oxford/New\nYork: Oxford University Press.",
                "Deacon, Terrence W., 1997, <em>The Symbolic Species</em>, London:\nAllen Lane.",
                "Dennett, Daniel C., 2017, <em>From Bacteria to Bach and Back: The\nEvolution of Minds</em>, New York: W.W. Norton &amp; Company.",
                "Descola, Philippe, 2005 [2013], <em>Par-delà nature et\nculture</em>, (Bibliothèque des sciences humaines), Paris:\nGallimard. Translated as <em>Beyond Nature and Culture</em>, Janet\nLloyd (trans.), Chicago/London: The University of Chicago Press,\n2013.",
                "Driscoll, Catherine, 2017, “The Evolutionary Culture\nConcepts”, <em>Philosophy of Science</em>, 84(1): 35–55.\ndoi:10.1086/688934",
                "Enquist, Magnus, Pontus Strimling, Kimmo Eriksson, Kevin Laland,\nand Jonas Sjostrand, 2010, “One Cultural Parent Makes No\nCulture”, <em>Animal Behaviour</em>, 79(6): 1353–1362.\ndoi:10.1016/j.anbehav.2010.03.009",
                "Falandays, J. Benjamin and Paul E. Smaldino, 2022, “The\nEmergence of Cultural Attractors: How Dynamic Populations of Learners\nAchieve Collective Cognitive Alignment”, <em>Cognitive\nScience</em>, 46(8): e13183. doi:10.1111/cogs.13183",
                "Feinman, Gary M. and Jill E. Neitzel, 2020, “Excising\nCulture History from Contemporary Archaeology”, <em>Journal of\nAnthropological Archaeology</em>, 60: article 101230.\ndoi:10.1016/j.jaa.2020.101230",
                "Fracchia, Joseph and Richard C. Lewontin, 1999, “Does\nCulture Evolve?”, <em>History and Theory</em>, 38(4):\n52–78. doi:10.1111/0018-2656.00104",
                "Gjesfjeld, Erik, Jonathan Chang, Daniele Silvestro, Christopher\nKelty, and Michael Alfaro, 2016, “Competition and Extinction\nExplain the Evolution of Diversity in American Automobiles”,\n<em>Palgrave Communications</em>, 2: article 16019.\ndoi:10.1057/palcomms.2016.19",
                "Gjesfjeld, Erik and Peter Jordan, 2019, “Contributions of\nBayesian Phylogenetics to Exploring Patterns of Macroevolution in\nArchaeological Data”, in <em>Handbook of Evolutionary Research\nin Archaeology</em>, Anna Marie Prentiss (ed.), Cham: Springer\nInternational Publishing, 161–182.\ndoi:10.1007/978-3-030-11117-5_9",
                "Godfrey-Smith, Peter, 2012, “Darwinism and Cultural\nChange”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 367(1599): 2160–2170.\ndoi:10.1098/rstb.2012.0118",
                "Goldberg, Amir and Sarah K. Stein, 2018, “Beyond Social\nContagion: Associative Diffusion and the Emergence of Cultural\nVariation”, <em>American Sociological Review</em>, 83(5):\n897–932. doi:10.1177/0003122418797576",
                "Gould, Stephen Jay, 1988, <em>An Urchin in the Storm: Essays about\nBooks and Ideas</em>, New York: W.W. Norton.",
                "Gray, Russell D., Simon J. Greenhill, and Robert M. Ross, 2007,\n“The Pleasures and Perils of Darwinizing Culture (with\nPhylogenies)”, <em>Biological Theory</em>, 2(4): 360–375.\ndoi:10.1162/biot.2007.2.4.360",
                "Gray, Russell D. and Joseph Watts, 2017, “Cultural\nMacroevolution Matters”, <em>Proceedings of the National Academy\nof Sciences</em>, USA, 114(30): 7846–7852.\ndoi:10.1073/pnas.1620746114",
                "Griffiths, Paul E., 2001, “Genetic Information: A Metaphor\nIn Search of a Theory”, <em>Philosophy of Science</em>, 68(3):\n394–412. doi:10.1086/392891",
                "Haidle, Miriam Noël and Oliver Schlaudt, 2020, “Where\nDoes Cumulative Culture Begin? A Plea for a Sociologically Informed\nPerspective”, <em>Biological Theory</em>, 15(3): 161–174.\ndoi:10.1007/s13752-020-00351-w",
                "Harris, Paul L. and Kathleen H. Corriveau, 2011, “Young\nChildren’s Selective Trust in Informants”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 366(1567): 1179–1187.\ndoi:10.1098/rstb.2010.0321",
                "Henrich, Joseph Patrick, 2001, “Cultural Transmission and\nthe Diffusion of Innovations: Adoption Dynamics Indicate That Biased\nCultural Transmission Is the Predominate Force in Behavioral\nChange”, <em>American Anthropologist</em>, 103(4):\n992–1013. doi:10.1525/aa.2001.103.4.992",
                "–––, 2016, <em>The Secret of Our Success: How\nCulture Is Driving Human Evolution, Domesticating Our Species, and\nMaking Us Smarter</em>, Princeton: Princeton University Press.\ndoi:10.1515/9781400873296",
                "–––, 2020, <em>The WEIRDest People in the World:\nHow the West Became Psychologically Peculiar and Particularly\nProsperous</em>, New York: Farrar, Strauss and Giroux.",
                "Henrich, Joe and Robert Boyd, 1998, “The Evolution of\nConformist Transmission and the Emergence of Between-Group\nDifferences”, <em>Evolution and Human Behavior</em>, 19(4):\n215–241. doi:10.1016/S1090-5138(98)00018-X",
                "Henrich, Joseph and James Broesch, 2011, “On the Nature of\nCultural Transmission Networks: Evidence from Fijian Villages for\nAdaptive Learning Biases”, <em>Philosophical Transactions of the\nRoyal Society B: Biological Sciences</em>, 366(1567): 1139–1148.\ndoi:10.1098/rstb.2010.0323",
                "Henrich, Joseph and Richard McElreath, 2003, “The Evolution\nof Cultural Evolution”, <em>Evolutionary Anthropology: Issues,\nNews, and Reviews</em>, 12(3): 123–135.\ndoi:10.1002/evan.10110",
                "Heyes, Cecilia, 2018, <em>Cognitive Gadgets: The Cultural\nEvolution of Thinking</em>, Cambridge, MA: Harvard University\nPress.",
                "Ingold, Tim, 2007, “The Trouble\nwith ‘Evolutionary Biology’”, <em>Anthropology\nToday</em>, 23(2): 13–17.\ndoi:10.1111/j.1467-8322.2007.00497.x",
                "Jablonka, Eva and Marion J. Lamb, 2005, <em>Evolution in Four\nDimensions: Genetic, Epigenetic, Behavioral, and Symbolic Variation in\nthe History of Life</em>, (Life and Mind), Cambridge, MA: MIT\nPress.",
                "–––, 2006, “The Evolution of Information\nin the Major Transitions”, <em>Journal of Theoretical\nBiology</em>, 239(2): 236–246.\ndoi:10.1016/j.jtbi.2005.08.038",
                "Jansson, Fredrik, Elliot Aguilar, Alberto Acerbi, and Magnus\nEnquist, 2021, “Modelling Cultural Systems and Selective\nFilters”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 376(1828): rstb.20200045.\ndoi:10.1098/rstb.2020.0045",
                "Jordan, Peter, 2015, <em>Technology as Human Social Tradition:\nCultural Transmission among Hunter-Gatherers</em>, (Origins of Human\nBehavior and Culture 7), Oakland, CA: University of California\nPress.",
                "Kelly, Piers, James Winters, Helena Miton, and Olivier Morin,\n2021, “The Predictable Evolution of Letter Shapes: An Emergent\nScript of West Africa Recapitulates Historical Change in Writing\nSystems”, <em>Current Anthropology</em>, 62(6): 669–691.\ndoi:10.1086/717779",
                "Kincaid, Harold (ed.), 2012, <em>The Oxford Handbook of Philosophy\nof Social Science</em>, (Oxford Handbooks), Oxford/New York: Oxford\nUniversity Press. doi:10.1093/oxfordhb/9780195392753.001.0001",
                "Kuper, Adam, 1999, <em>Culture: The Anthropologists’\nAccount</em>, Cambridge, MA: Harvard University Press.",
                "–––, 2000, “If Memes are the Answer, What\nis the Question?”, in Aunger 2000: 175–188 (ch. 9).",
                "Laland, Kevin N., 2017, <em>Darwin’s Unfinished Symphony:\nHow Culture Made the Human Mind</em>, Princeton, NJ: Princeton\nUniversity Press. doi:10.1515/9781400884872",
                "Laland, Kevin N., John Odling-Smee, and Marcus W. Feldman, 2000,\n“Niche Construction, Biological Evolution, and Cultural\nChange”, <em>Behavioral and Brain Sciences</em>, 23(1):\n131–146. doi:10.1017/S0140525X00002417",
                "Lewens, Tim, 2012, “Cultural Evolution: Integration and\nSkepticism”, in Kincaid 2012: 458–480 (ch. 19).",
                "–––, 2015, <em>Cultural Evolution: Conceptual\nChallenges</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199674183.001.0001",
                "–––, 2017, “Human Nature, Human Culture:\nThe Case of Cultural Evolution”, <em>Interface Focus</em>, 7(5):\narticle: 20170018. doi:10.1098/rsfs.2017.0018",
                "Lyman, R. Lee, 2021, “On the Importance of Systematics to\nArchaeological Research: The Covariation of Typological Diversity and\nMorphological Disparity”, <em>Journal of Paleolithic\nArchaeology</em>, 4(1): article 3. doi:10.1007/s41982-021-00077-6",
                "Mace, Ruth and Clare Holden, 2005, “A Phylogenetic Approach\nto Cultural Evolution”, <em>Trends in Ecology &amp;\nEvolution</em>, 20(3): 116–121.\ndoi:10.1016/j.tree.2004.12.002",
                "Maynard Smith, John and Eörs Szathmáry, 1995, <em>The\nMajor Transitions in Evolution</em>, Oxford/New York: W.H. Freeman\nSpektrum.",
                "Mesoudi, Alex, 2011, <em>Cultural Evolution: How Darwinian Theory\nCan Explain Human Culture and Synthesize the Social Sciences</em>,\nChicago: University of Chicago Press.",
                "Mesoudi, Alex and Alex Thornton, 2018, “What Is Cumulative\nCultural Evolution?”, <em>Proceedings of the Royal Society B:\nBiological Sciences</em>, 285(1880): 20180712.\ndoi:10.1098/rspb.2018.0712",
                "Mesoudi, Alex, Andrew Whiten, and Kevin N. Laland, 2006,\n“Towards a Unified Science of Cultural Evolution”,\n<em>Behavioral and Brain Sciences</em>, 29(4): 329–347.\ndoi:10.1017/S0140525X06009083",
                "Miton, Helena and Olivier Morin, 2021, “Graphic Complexity\nin Writing Systems”, <em>Cognition</em>, 214: article 104771.\ndoi:10.1016/j.cognition.2021.104771",
                "Mohr, John W., Christopher A. Bail, Margaret Frye, Jennifer C.\nLena, Omar Lizardo, Terence E. McDonnell, Ann Mische, Iddo Tavory, and\nFrederick F.VE Wherry, 2019, <em>Measuring Culture</em>, New York:\nColumbia University Press. doi:10.7312/mohr18028",
                "Morin, Olivier, 2011 [2016a], <em>Comment les traditions naissent\net meurent: la transmission culturelle</em>, Paris: Odile Jacob.\nTranslated and revised by the author as <em>How Traditions Live and\nDie</em>, (Foundations of Human Interaction), Oxford/New York: Oxford\nUniversity Press, 2016.",
                "–––, 2016b, “The Disunity of Cultural\nGroup Selection”, <em>Behavioral and Brain Sciences</em>, 39:\ne46. doi:10.1017/S0140525X15000199",
                "Müller, Max, 1870, “Darwinism Tested by the Science of\nLanguage”, August Schleicher (trans.), <em>Nature</em>, 1(10):\n256–259. doi:10.1038/001256a0",
                "Norenzayan, Ara, Azim F. Shariff, Will M. Gervais, Aiyana K.\nWillard, Rita A. McNamara, Edward Slingerland, and Joseph Henrich,\n2016, “The Cultural Evolution of Prosocial Religions”,\n<em>Behavioral and Brain Sciences</em>, 39: e1.\ndoi:10.1017/S0140525X14001356",
                "O’Brien, Michael J., R. Lee Lyman, Alex Mesoudi, and Todd L.\nVanPool, 2010, “Cultural Traits as Units of Analysis”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 365(1559): 3797–3806.\ndoi:10.1098/rstb.2010.0012",
                "Okasha, Samir, 2006, <em>Evolution and the Levels of\nSelection</em>, Oxford:: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199267972.001.0001",
                "Ortner, Sherry B., 1984, “Theory in Anthropology since the\nSixties”, <em>Comparative Studies in Society and History</em>,\n26(1): 126–126. doi:10.1017/S0010417500010811",
                "Oyama, Susan, 1985 [2000], <em>The Ontogeny of Information:\nDevelopmental Systems and Evolution</em>, Cambridge/New York:\nCambridge University Press. Second edition, revised and expanded,\nDurham, NC: Duke University Press, 2000.\ndoi:10.1215/9780822380665",
                "Perreault, Charles, 2012, “The Pace of Cultural\nEvolution”, Alex Mesoudi (ed.), <em>PLoS ONE</em>, 7(9): e45150.\ndoi:10.1371/journal.pone.0045150",
                "–––, 2019, <em>The Quality of the Archaeological\nRecord</em>, Chicago: The University of Chicago Press.",
                "Ramsey, Grant and Andreas De Block, 2017, “Is Cultural\nFitness Hopelessly Confused?”, <em>The British Journal for the\nPhilosophy of Science</em>, 68(2): 305–328.\ndoi:10.1093/bjps/axv047",
                "Richerson, Peter J. and Robert Boyd, 2005, <em>Not by Genes Alone:\nHow Culture Transformed Human Evolution</em>, Chicago: University of\nChicago Press.",
                "Richerson, Peter, Ryan Baldini, Adrian V. Bell, Kathryn Demps,\nKarl Frost, Vicken Hillis, Sarah Mathew, Emily K. Newton, Nicole Naar,\nLesley Newson, Cody Ross, Paul E. Smaldino, Timothy M. Waring, and\nMatthew Zefferman, 2016, “Cultural Group Selection Plays an\nEssential Role in Explaining Human Cooperation: A Sketch of the\nEvidence”, <em>Behavioral and Brain Sciences</em>, 39: e30.\ndoi:10.1017/S0140525X1400106X",
                "Riede, Felix, Astolfo G.M. Araujo, Michael C. Barton, Knut Andreas\nBergsvik, Huw S. Groucutt, Shumon T. Hussain, Javier\nFernandez‐Lopez de Pablo, Andreas Maier, Ben Marwick, Lydia\nPyne, Kathryn Ranhorn, Natasha Reynolds, Julien Riel‐Salvatore,\nFlorian Sauer, Kamil Serwatka, and Annabell Zander, 2020,\n“Cultural Taxonomies in the Paleolithic—Old Questions,\nNovel Perspectives”, <em>Evolutionary Anthropology: Issues,\nNews, and Reviews</em>, 29(2): 49–52.\ndoi:10.1002/evan.21819",
                "Risjord, Mark, 2012, “Models of Culture”, in Kincaid\n2012: 387–408.",
                "Rouse, Joseph, 2007, “Practice Theory”, in\n<em>Philosophy of Anthropology and Sociology</em>, Stephen P. Turner\nand Mark W. Risjord (eds.), Amsterdam/Boston: North-Holland,\n639–681. doi:10.1016/B978-044451542-1/50020-9",
                "Sahlins, Marshall, 1985, <em>Islands of History</em>, Chicago:\nUniversity of Chicago Press.",
                "Sartori, Andrew, 2005, “The Resonance of\n‘Culture’: Framing a Problem in Global\nConcept-History”, <em>Comparative Studies in Society and\nHistory</em>, 47(4): 676–699. doi:10.1017/S0010417505000319",
                "Schuppli, Caroline and Carel P. van Schaik, 2019, “Animal\nCultures: How We’ve Only Seen the Tip of the Iceberg”,\n<em>Evolutionary Human Sciences</em>, 1: e2.\ndoi:10.1017/ehs.2019.1",
                "Sereno, Martin I., 1991, “Four Analogies between Biological\nand Cultural/Linguistic Evolution”, <em>Journal of Theoretical\nBiology</em>, 151(4): 467–507.\ndoi:10.1016/S0022-5193(05)80366-2",
                "Shennan, Stephen, 2008, “Canoes and Cultural\nEvolution”, <em>Proceedings of the National Academy of\nSciences</em>, USA, 105(9): 3175–3176.\ndoi:10.1073/pnas.0800666105",
                "–––, 2011, “Descent with Modification and\nthe Archaeological Record”, <em>Philosophical Transactions of\nthe Royal Society B: Biological Sciences</em>, 366(1567):\n1070–1079. doi:10.1098/rstb.2010.0380",
                "Sober, Elliott, 1991, “Models of Cultural Evolution”,\nin <em>Trees of Life: Essays in Philosophy of Biology</em>, Paul\nGriffiths (ed.), Dordrecht/Boston: Kluwer, 477–492.",
                "Sperber, Dan, 1996, <em>Explaining Culture: A Naturalistic\nApproach</em>, London: Wiley.",
                "–––, 2000, “An Objection to the Memetic\nApproach to Culture”, in Aunger 2000: 163–173 (ch.\n8).",
                "Stanley, Shaun, 2021, “Cultural Evolutionary Theory and the\nSignificance of the Biology-Culture Analogy”, <em>Philosophy of\nthe Social Sciences</em>, 51(2): 193–214.\ndoi:10.1177/0048393120971554",
                "Stegmann, Ulrich E., 2004, “The Arbitrariness of the Genetic\nCode”, <em>Biology &amp; Philosophy</em>, 19(2): 205–222.\ndoi:10.1023/B:BIPH.0000024412.82219.a6",
                "Sterelny, Kim, 2001, “Niche Construction, Developmental\nSystems, and the Extended Replicator”, in <em>Cycles of\nContingency: Developmental Systems and Evolution</em>, Susan Oyama,\nPaul E. Griffiths, and Russell D. Gray (eds.), (Life and Mind),\nCambridge, MA: MIT Press, 333–349 (ch. 23).",
                "–––, 2003, <em>Thought in a Hostile World: The\nEvolution of Human Cognition</em>, Malden, MA: Blackwell.",
                "–––, 2006a, “Memes Revisited”,\n<em>The British Journal for the Philosophy of Science</em>, 57(1):\n145–165. doi:10.1093/bjps/axi157",
                "–––, 2006b, “The Evolution and\nEvolvability of Culture”, <em>Mind &amp; Language</em>, 21(2):\n137–165. doi:10.1111/j.0268-1064.2006.00309.x",
                "–––, 2007, “SNAFUS: An Evolutionary\nPerspective”, <em>Biological Theory</em>, 2(3): 317–328.\ndoi:10.1162/biot.2007.2.3.317",
                "–––, 2012, <em>The Evolved Apprentice: How\nEvolution Made Humans Unique</em>, (Jean Nicod Lectures), Cambridge,\nMA: The MIT Press. doi:10.7551/mitpress/9780262016797.001.0001",
                "–––, 2016, “Cooperation, Culture, and\nConflict”, <em>The British Journal for the Philosophy of\nScience</em>, 67(1): 31–58. doi:10.1093/bjps/axu024",
                "–––, 2021a, “Foragers and Their Tools:\nRisk, Technology and Complexity”, <em>Topics in Cognitive\nScience</em>, 13(4): 728–749. doi:10.1111/tops.12559",
                "–––, 2021b, <em>The Pleistocene Social Contract:\nCulture and Cooperation in Human Evolution</em>, New York: Oxford\nUniversity Press. doi:10.1093/oso/9780197531389.001.0001",
                "–––, 2022, “Further Thoughts on Hierarchy\nand Inequality”, <em>Mind &amp; Language</em>, 37(4):\n760–768. doi:10.1111/mila.12435",
                "Steward, Julian Haynes, 1955, <em>Theory of Culture Change: The\nMethodology of Multilinear Evolution</em>, Urbana, IL: University of\nIllinois Press.",
                "Strimling, Pontus, Magnus Enquist, and Kimmo Eriksson, 2009,\n“Repeated Learning Makes Cultural Evolution Unique”,\n<em>Proceedings of the National Academy of Sciences</em>, USA,\n106(33): 13870–13874. doi:10.1073/pnas.0903180106",
                "Tennie, Claudio, Josep Call, and Michael Tomasello, 2009,\n“Ratcheting up the Ratchet: On the Evolution of Cumulative\nCulture”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 364(1528): 2405–2415.\ndoi:10.1098/rstb.2009.0052",
                "Tomasello, Michael, 1999, <em>The Cultural Origins of Human\nCognition</em>, Cambridge, MA: Harvard University Press.",
                "Tomasello, Michael, Ann Cale Kruger, and Hilary Horn Ratner, 1993,\n“Cultural Learning”, <em>Behavioral and Brain\nSciences</em>, 16(3): 495–511.\ndoi:10.1017/S0140525X0003123X",
                "Waring, Timothy M. and Zachary T. Wood, 2021, “Long-Term\nGene–Culture Coevolution and the Human Evolutionary\nTransition”, <em>Proceedings of the Royal Society B: Biological\nSciences</em>, 288(1952): 20210538. doi:10.1098/rspb.2021.0538",
                "White, Leslie A., 1949, <em>The Science of Culture: A Study of Man\nand Civilization</em>, New York: Farrar, Straus.",
                "Williams, George C., 1966, <em>Adaptation and Natural Selection: A\nCritique of Some Current Evolutionary Thought</em>, Princeton, NJ:\nPrinceton University Press.",
                "Wimsatt, William C., 1999, “Genes, Memes, and Cultural\nHeredity”, <em>Biology &amp; Philosophy</em>, 14(2):\n279–310. doi:10.1023/A:1006646703557"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Acerbi, Alberto and Alex Mesoudi, 2015, “If We Are All\nCultural Darwinians What’s the Fuss about? Clarifying Recent\nDisagreements in the Field of Cultural Evolution”, <em>Biology\n&amp; Philosophy</em>, 30(4): 481–503.\ndoi:10.1007/s10539-015-9490-2</li>\n<li>Acerbi, Alberto, Magnus Enquist, and Stefano Ghirlanda, 2009,\n“Cultural Evolution and Individual Development of Openness and\nConservatism”, <em>Proceedings of the National Academy of\nSciences</em>, USA, 106(45): 18931–18935.\ndoi:10.1073/pnas.0908889106</li>\n<li>Aunger, Robert (ed.), 2000, <em>Darwinizing Culture: The Status of\nMemetics as a Science</em>, Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780192632449.001.0001</li>\n<li>Axelrod, Robert M., 1997, <em>The Complexity of Cooperation:\nAgent-Based Models of Competition and Collaboration</em>, (Princeton\nStudies in Complexity), Princeton, NJ: Princeton University\nPress.</li>\n<li>Birch, Jonathan, 2017, <em>The Philosophy of Social\nEvolution</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198733058.001.0001</li>\n<li>Birch, Jonathan and Andrew Buskell, 2022, “How We Got Stuck:\nThe Origins of Hierarchy and Inequality”, <em>Mind &amp;\nLanguage</em>, 37(4): 751–759. doi:10.1111/mila.12420</li>\n<li>Bourdieu, Pierre, 1972 [1977], <em>Esquisse d’une\nthéorie de la pratique, précédé de trois\nétudes d’ethnologie kabyle</em>, Switzerland: Libraire\nDroz. Translated with revisions as <em>Outline of a Theory of\nPractice</em>, Richard Nice (trans.), (Cambridge Studies in Social\nAnthropology 16), Cambridge: Cambridge University Press, 1977.</li>\n<li>Boyd, Robert and Richerson, Peter J., 1985, <em>Culture and the\nEvolutionary Process</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 2000, “Memes: Universal Acid or a\nBetter Mousetrap?”, in Aunger 2000: 143–162 (ch. 7).</li>\n<li>–––, 2005, <em>The Origin and Evolution of\nCultures</em>, Oxford/New York: Oxford University Press</li>\n<li>–––, 2009, “Culture and the Evolution of\nHuman Cooperation”, <em>Philosophical Transactions of the Royal\nSociety B: Biological Sciences</em>, 364(1533): 3281–3288.\ndoi:10.1098/rstb.2009.0134</li>\n<li>Brown, Rachael L., 2021, “Is Cultural Evolution Always Fast?\nChallenging the Idea That Cognitive Gadgets Would Be Capable of Rapid\nand Adaptive Evolution”, <em>Synthese</em>, 199(3–4):\n8965–8989. doi:10.1007/s11229-021-03190-9</li>\n<li>Buskell, Andrew, 2017a, “What Are Cultural\nAttractors?”, <em>Biology &amp; Philosophy</em>, 32(3):\n377–394. doi:10.1007/s10539-017-9570-6</li>\n<li>–––, 2017b, “Cultural Attractor Theory and\nExplanation”, <em>Philosophy, Theory, and Practice in\nBiology</em>, 9: article 13. doi:10.3998/ptb.6959004.0009.013</li>\n<li>–––, 2019, “Looking for Middle Ground in\nCultural Attraction Theory”, <em>Evolutionary Anthropology:\nIssues, News, and Reviews</em>, 28(1): 14–17.\ndoi:10.1002/evan.21762</li>\n<li>–––, 2022, “Cumulative Culture and Complex\nCultural Traditions”, <em>Mind &amp; Language</em>, 37(3):\n284–303. doi:10.1111/mila.12335</li>\n<li>–––, forthcoming, “Demographic Cultures\nand Demographic Skepticism”, <em>Review of Philosophy and\nPsychology</em>, first online: 8 April 2022.\ndoi:10.1007/s13164-022-00626-0</li>\n<li>Buskell, Andrew, Magnus Enquist, and Fredrik Jansson, 2019,\n“A Systems Approach to Cultural Evolution”, <em>Palgrave\nCommunications</em>, 5: article 131.\ndoi:10.1057/s41599-019-0343-5</li>\n<li>Buskell, Andrew and Claudio Tennie, forthcoming, “Mere\nRecurrence and Cumulative Culture at the Margins”, <em>The\nBritish Journal for the Philosophy of Science</em>, first online: 25\nOctober 2021. doi:10.1086/717776</li>\n<li>Cabrera, Frank, 2017, “Cladistic Parsimony, Historical\nLinguistics and Cultural Phylogenetics”, <em>Mind &amp;\nLanguage</em>, 32(1): 65–100. doi:10.1111/mila.12133</li>\n<li>Calcott, Brett and Kim Sterelny, 2011, “Introduction: A\nDynamic View of Evolution”, in <em>The Major Transitions in\nEvolution Revisited</em>, Brett Calcott and Kim Sterelny (eds.),\n(Vienna Series in Theoretical Biology), Cambridge, MA: MIT Press,\n1–14.</li>\n<li>Cao, Rosa, 2020, “Crowding out Memetic Explanation”,\n<em>Philosophy of Science</em>, 87(5): 1160–1171.\ndoi:10.1086/710518</li>\n<li>Cavalli-Sforza, Luca Luigi and Marcus W. Feldman, 1981,\n<em>Cultural Transmission and Evolution: A Quantitative Approach</em>,\n(Monographs in Population Biology 16), Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Centola, Damon, 2015, “The Social Origins of Networks and\nDiffusion”, <em>American Journal of Sociology</em>, 120(5):\n1295–1338. doi:10.1086/681275</li>\n<li>Charbonneau, Mathieu, 2016, “Modularity and Recombination in\nTechnological Evolution”, <em>Philosophy &amp; Technology</em>,\n29(4): 373–392. doi:10.1007/s13347-016-0228-0</li>\n<li>–––, 2020, “Understanding Cultural\nFidelity”, <em>The British Journal for the Philosophy of\nScience</em>, 71(4): 1209–1233. doi:10.1093/bjps/axy052</li>\n<li>Charbonneau, Mathieu and Pierrick Bourrat, 2021, “Fidelity\nand the Grain Problem in Cultural Evolution”, <em>Synthese</em>,\n199(3–4): 5815–5836. doi:10.1007/s11229-021-03047-1</li>\n<li>Chellappoo, Azita, 2021, “Rethinking Prestige Bias”,\n<em>Synthese</em>, 198(9): 8191–8212.\ndoi:10.1007/s11229-020-02565-8</li>\n<li>–––, 2022, “When Can Cultural Selection\nExplain Adaptation?”, <em>Biology &amp; Philosophy</em>, 37(1):\narticle 2. doi:10.1007/s10539-021-09831-0</li>\n<li>Claidière, Nicolas, Thomas C. Scott-Phillips, and Dan\nSperber, 2014, “How Darwinian Is Cultural Evolution?”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 369(1642): 20130368. doi:10.1098/rstb.2013.0368</li>\n<li>Claidière, Nicolas and Dan Sperber, 2007, “The Role\nof Attraction in Cultural Evolution”, <em>Journal of Cognition\nand Culture</em>, 7(1–2): 89–111.\ndoi:10.1163/156853707X171829</li>\n<li>Clarke, Ellen and Cecilia Heyes, 2017, “The Swashbuckling\nAnthropologist: Henrich on The Secret of Our Success”,\n<em>Biology &amp; Philosophy</em>, 32(2): 289–305.\ndoi:10.1007/s10539-016-9554-y</li>\n<li>Darwin, Charles, 1859, <em>On the Origin of Species</em>, London:\nJohn Murray. First edition reprinted with an introduction by Ernst\nMayr, Harvard: Harvard University Press, 1964.</li>\n<li>–––, 1871/1877, <em>The Descent of Man</em>,\nLondon: John Murray. Second edition 1877. Reprint of second edition,\nwith an introduction by Adrian Desmond and James Moore, London:\nPenguin, 2004.</li>\n<li>Dawkins, Richard, 1976, <em>The Selfish Gene</em>, Oxford/New\nYork: Oxford University Press.</li>\n<li>Deacon, Terrence W., 1997, <em>The Symbolic Species</em>, London:\nAllen Lane.</li>\n<li>Dennett, Daniel C., 2017, <em>From Bacteria to Bach and Back: The\nEvolution of Minds</em>, New York: W.W. Norton &amp; Company.</li>\n<li>Descola, Philippe, 2005 [2013], <em>Par-delà nature et\nculture</em>, (Bibliothèque des sciences humaines), Paris:\nGallimard. Translated as <em>Beyond Nature and Culture</em>, Janet\nLloyd (trans.), Chicago/London: The University of Chicago Press,\n2013.</li>\n<li>Driscoll, Catherine, 2017, “The Evolutionary Culture\nConcepts”, <em>Philosophy of Science</em>, 84(1): 35–55.\ndoi:10.1086/688934</li>\n<li>Enquist, Magnus, Pontus Strimling, Kimmo Eriksson, Kevin Laland,\nand Jonas Sjostrand, 2010, “One Cultural Parent Makes No\nCulture”, <em>Animal Behaviour</em>, 79(6): 1353–1362.\ndoi:10.1016/j.anbehav.2010.03.009</li>\n<li>Falandays, J. Benjamin and Paul E. Smaldino, 2022, “The\nEmergence of Cultural Attractors: How Dynamic Populations of Learners\nAchieve Collective Cognitive Alignment”, <em>Cognitive\nScience</em>, 46(8): e13183. doi:10.1111/cogs.13183</li>\n<li>Feinman, Gary M. and Jill E. Neitzel, 2020, “Excising\nCulture History from Contemporary Archaeology”, <em>Journal of\nAnthropological Archaeology</em>, 60: article 101230.\ndoi:10.1016/j.jaa.2020.101230</li>\n<li>Fracchia, Joseph and Richard C. Lewontin, 1999, “Does\nCulture Evolve?”, <em>History and Theory</em>, 38(4):\n52–78. doi:10.1111/0018-2656.00104</li>\n<li>Gjesfjeld, Erik, Jonathan Chang, Daniele Silvestro, Christopher\nKelty, and Michael Alfaro, 2016, “Competition and Extinction\nExplain the Evolution of Diversity in American Automobiles”,\n<em>Palgrave Communications</em>, 2: article 16019.\ndoi:10.1057/palcomms.2016.19</li>\n<li>Gjesfjeld, Erik and Peter Jordan, 2019, “Contributions of\nBayesian Phylogenetics to Exploring Patterns of Macroevolution in\nArchaeological Data”, in <em>Handbook of Evolutionary Research\nin Archaeology</em>, Anna Marie Prentiss (ed.), Cham: Springer\nInternational Publishing, 161–182.\ndoi:10.1007/978-3-030-11117-5_9</li>\n<li>Godfrey-Smith, Peter, 2012, “Darwinism and Cultural\nChange”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 367(1599): 2160–2170.\ndoi:10.1098/rstb.2012.0118</li>\n<li>Goldberg, Amir and Sarah K. Stein, 2018, “Beyond Social\nContagion: Associative Diffusion and the Emergence of Cultural\nVariation”, <em>American Sociological Review</em>, 83(5):\n897–932. doi:10.1177/0003122418797576</li>\n<li>Gould, Stephen Jay, 1988, <em>An Urchin in the Storm: Essays about\nBooks and Ideas</em>, New York: W.W. Norton.</li>\n<li>Gray, Russell D., Simon J. Greenhill, and Robert M. Ross, 2007,\n“The Pleasures and Perils of Darwinizing Culture (with\nPhylogenies)”, <em>Biological Theory</em>, 2(4): 360–375.\ndoi:10.1162/biot.2007.2.4.360</li>\n<li>Gray, Russell D. and Joseph Watts, 2017, “Cultural\nMacroevolution Matters”, <em>Proceedings of the National Academy\nof Sciences</em>, USA, 114(30): 7846–7852.\ndoi:10.1073/pnas.1620746114</li>\n<li>Griffiths, Paul E., 2001, “Genetic Information: A Metaphor\nIn Search of a Theory”, <em>Philosophy of Science</em>, 68(3):\n394–412. doi:10.1086/392891</li>\n<li>Haidle, Miriam Noël and Oliver Schlaudt, 2020, “Where\nDoes Cumulative Culture Begin? A Plea for a Sociologically Informed\nPerspective”, <em>Biological Theory</em>, 15(3): 161–174.\ndoi:10.1007/s13752-020-00351-w</li>\n<li>Harris, Paul L. and Kathleen H. Corriveau, 2011, “Young\nChildren’s Selective Trust in Informants”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 366(1567): 1179–1187.\ndoi:10.1098/rstb.2010.0321</li>\n<li>Henrich, Joseph Patrick, 2001, “Cultural Transmission and\nthe Diffusion of Innovations: Adoption Dynamics Indicate That Biased\nCultural Transmission Is the Predominate Force in Behavioral\nChange”, <em>American Anthropologist</em>, 103(4):\n992–1013. doi:10.1525/aa.2001.103.4.992</li>\n<li>–––, 2016, <em>The Secret of Our Success: How\nCulture Is Driving Human Evolution, Domesticating Our Species, and\nMaking Us Smarter</em>, Princeton: Princeton University Press.\ndoi:10.1515/9781400873296</li>\n<li>–––, 2020, <em>The WEIRDest People in the World:\nHow the West Became Psychologically Peculiar and Particularly\nProsperous</em>, New York: Farrar, Strauss and Giroux.</li>\n<li>Henrich, Joe and Robert Boyd, 1998, “The Evolution of\nConformist Transmission and the Emergence of Between-Group\nDifferences”, <em>Evolution and Human Behavior</em>, 19(4):\n215–241. doi:10.1016/S1090-5138(98)00018-X</li>\n<li>Henrich, Joseph and James Broesch, 2011, “On the Nature of\nCultural Transmission Networks: Evidence from Fijian Villages for\nAdaptive Learning Biases”, <em>Philosophical Transactions of the\nRoyal Society B: Biological Sciences</em>, 366(1567): 1139–1148.\ndoi:10.1098/rstb.2010.0323</li>\n<li>Henrich, Joseph and Richard McElreath, 2003, “The Evolution\nof Cultural Evolution”, <em>Evolutionary Anthropology: Issues,\nNews, and Reviews</em>, 12(3): 123–135.\ndoi:10.1002/evan.10110</li>\n<li>Heyes, Cecilia, 2018, <em>Cognitive Gadgets: The Cultural\nEvolution of Thinking</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Ingold, Tim, 2007, “The Trouble\nwith ‘Evolutionary Biology’”, <em>Anthropology\nToday</em>, 23(2): 13–17.\ndoi:10.1111/j.1467-8322.2007.00497.x</li>\n<li>Jablonka, Eva and Marion J. Lamb, 2005, <em>Evolution in Four\nDimensions: Genetic, Epigenetic, Behavioral, and Symbolic Variation in\nthe History of Life</em>, (Life and Mind), Cambridge, MA: MIT\nPress.</li>\n<li>–––, 2006, “The Evolution of Information\nin the Major Transitions”, <em>Journal of Theoretical\nBiology</em>, 239(2): 236–246.\ndoi:10.1016/j.jtbi.2005.08.038</li>\n<li>Jansson, Fredrik, Elliot Aguilar, Alberto Acerbi, and Magnus\nEnquist, 2021, “Modelling Cultural Systems and Selective\nFilters”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 376(1828): rstb.20200045.\ndoi:10.1098/rstb.2020.0045</li>\n<li>Jordan, Peter, 2015, <em>Technology as Human Social Tradition:\nCultural Transmission among Hunter-Gatherers</em>, (Origins of Human\nBehavior and Culture 7), Oakland, CA: University of California\nPress.</li>\n<li>Kelly, Piers, James Winters, Helena Miton, and Olivier Morin,\n2021, “The Predictable Evolution of Letter Shapes: An Emergent\nScript of West Africa Recapitulates Historical Change in Writing\nSystems”, <em>Current Anthropology</em>, 62(6): 669–691.\ndoi:10.1086/717779</li>\n<li>Kincaid, Harold (ed.), 2012, <em>The Oxford Handbook of Philosophy\nof Social Science</em>, (Oxford Handbooks), Oxford/New York: Oxford\nUniversity Press. doi:10.1093/oxfordhb/9780195392753.001.0001</li>\n<li>Kuper, Adam, 1999, <em>Culture: The Anthropologists’\nAccount</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2000, “If Memes are the Answer, What\nis the Question?”, in Aunger 2000: 175–188 (ch. 9).</li>\n<li>Laland, Kevin N., 2017, <em>Darwin’s Unfinished Symphony:\nHow Culture Made the Human Mind</em>, Princeton, NJ: Princeton\nUniversity Press. doi:10.1515/9781400884872</li>\n<li>Laland, Kevin N., John Odling-Smee, and Marcus W. Feldman, 2000,\n“Niche Construction, Biological Evolution, and Cultural\nChange”, <em>Behavioral and Brain Sciences</em>, 23(1):\n131–146. doi:10.1017/S0140525X00002417</li>\n<li>Lewens, Tim, 2012, “Cultural Evolution: Integration and\nSkepticism”, in Kincaid 2012: 458–480 (ch. 19).</li>\n<li>–––, 2015, <em>Cultural Evolution: Conceptual\nChallenges</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199674183.001.0001</li>\n<li>–––, 2017, “Human Nature, Human Culture:\nThe Case of Cultural Evolution”, <em>Interface Focus</em>, 7(5):\narticle: 20170018. doi:10.1098/rsfs.2017.0018</li>\n<li>Lyman, R. Lee, 2021, “On the Importance of Systematics to\nArchaeological Research: The Covariation of Typological Diversity and\nMorphological Disparity”, <em>Journal of Paleolithic\nArchaeology</em>, 4(1): article 3. doi:10.1007/s41982-021-00077-6</li>\n<li>Mace, Ruth and Clare Holden, 2005, “A Phylogenetic Approach\nto Cultural Evolution”, <em>Trends in Ecology &amp;\nEvolution</em>, 20(3): 116–121.\ndoi:10.1016/j.tree.2004.12.002</li>\n<li>Maynard Smith, John and Eörs Szathmáry, 1995, <em>The\nMajor Transitions in Evolution</em>, Oxford/New York: W.H. Freeman\nSpektrum.</li>\n<li>Mesoudi, Alex, 2011, <em>Cultural Evolution: How Darwinian Theory\nCan Explain Human Culture and Synthesize the Social Sciences</em>,\nChicago: University of Chicago Press.</li>\n<li>Mesoudi, Alex and Alex Thornton, 2018, “What Is Cumulative\nCultural Evolution?”, <em>Proceedings of the Royal Society B:\nBiological Sciences</em>, 285(1880): 20180712.\ndoi:10.1098/rspb.2018.0712</li>\n<li>Mesoudi, Alex, Andrew Whiten, and Kevin N. Laland, 2006,\n“Towards a Unified Science of Cultural Evolution”,\n<em>Behavioral and Brain Sciences</em>, 29(4): 329–347.\ndoi:10.1017/S0140525X06009083</li>\n<li>Miton, Helena and Olivier Morin, 2021, “Graphic Complexity\nin Writing Systems”, <em>Cognition</em>, 214: article 104771.\ndoi:10.1016/j.cognition.2021.104771</li>\n<li>Mohr, John W., Christopher A. Bail, Margaret Frye, Jennifer C.\nLena, Omar Lizardo, Terence E. McDonnell, Ann Mische, Iddo Tavory, and\nFrederick F.VE Wherry, 2019, <em>Measuring Culture</em>, New York:\nColumbia University Press. doi:10.7312/mohr18028</li>\n<li>Morin, Olivier, 2011 [2016a], <em>Comment les traditions naissent\net meurent: la transmission culturelle</em>, Paris: Odile Jacob.\nTranslated and revised by the author as <em>How Traditions Live and\nDie</em>, (Foundations of Human Interaction), Oxford/New York: Oxford\nUniversity Press, 2016.</li>\n<li>–––, 2016b, “The Disunity of Cultural\nGroup Selection”, <em>Behavioral and Brain Sciences</em>, 39:\ne46. doi:10.1017/S0140525X15000199</li>\n<li>Müller, Max, 1870, “Darwinism Tested by the Science of\nLanguage”, August Schleicher (trans.), <em>Nature</em>, 1(10):\n256–259. doi:10.1038/001256a0</li>\n<li>Norenzayan, Ara, Azim F. Shariff, Will M. Gervais, Aiyana K.\nWillard, Rita A. McNamara, Edward Slingerland, and Joseph Henrich,\n2016, “The Cultural Evolution of Prosocial Religions”,\n<em>Behavioral and Brain Sciences</em>, 39: e1.\ndoi:10.1017/S0140525X14001356</li>\n<li>O’Brien, Michael J., R. Lee Lyman, Alex Mesoudi, and Todd L.\nVanPool, 2010, “Cultural Traits as Units of Analysis”,\n<em>Philosophical Transactions of the Royal Society B: Biological\nSciences</em>, 365(1559): 3797–3806.\ndoi:10.1098/rstb.2010.0012</li>\n<li>Okasha, Samir, 2006, <em>Evolution and the Levels of\nSelection</em>, Oxford:: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199267972.001.0001</li>\n<li>Ortner, Sherry B., 1984, “Theory in Anthropology since the\nSixties”, <em>Comparative Studies in Society and History</em>,\n26(1): 126–126. doi:10.1017/S0010417500010811</li>\n<li>Oyama, Susan, 1985 [2000], <em>The Ontogeny of Information:\nDevelopmental Systems and Evolution</em>, Cambridge/New York:\nCambridge University Press. Second edition, revised and expanded,\nDurham, NC: Duke University Press, 2000.\ndoi:10.1215/9780822380665</li>\n<li>Perreault, Charles, 2012, “The Pace of Cultural\nEvolution”, Alex Mesoudi (ed.), <em>PLoS ONE</em>, 7(9): e45150.\ndoi:10.1371/journal.pone.0045150</li>\n<li>–––, 2019, <em>The Quality of the Archaeological\nRecord</em>, Chicago: The University of Chicago Press.</li>\n<li>Ramsey, Grant and Andreas De Block, 2017, “Is Cultural\nFitness Hopelessly Confused?”, <em>The British Journal for the\nPhilosophy of Science</em>, 68(2): 305–328.\ndoi:10.1093/bjps/axv047</li>\n<li>Richerson, Peter J. and Robert Boyd, 2005, <em>Not by Genes Alone:\nHow Culture Transformed Human Evolution</em>, Chicago: University of\nChicago Press.</li>\n<li>Richerson, Peter, Ryan Baldini, Adrian V. Bell, Kathryn Demps,\nKarl Frost, Vicken Hillis, Sarah Mathew, Emily K. Newton, Nicole Naar,\nLesley Newson, Cody Ross, Paul E. Smaldino, Timothy M. Waring, and\nMatthew Zefferman, 2016, “Cultural Group Selection Plays an\nEssential Role in Explaining Human Cooperation: A Sketch of the\nEvidence”, <em>Behavioral and Brain Sciences</em>, 39: e30.\ndoi:10.1017/S0140525X1400106X</li>\n<li>Riede, Felix, Astolfo G.M. Araujo, Michael C. Barton, Knut Andreas\nBergsvik, Huw S. Groucutt, Shumon T. Hussain, Javier\nFernandez‐Lopez de Pablo, Andreas Maier, Ben Marwick, Lydia\nPyne, Kathryn Ranhorn, Natasha Reynolds, Julien Riel‐Salvatore,\nFlorian Sauer, Kamil Serwatka, and Annabell Zander, 2020,\n“Cultural Taxonomies in the Paleolithic—Old Questions,\nNovel Perspectives”, <em>Evolutionary Anthropology: Issues,\nNews, and Reviews</em>, 29(2): 49–52.\ndoi:10.1002/evan.21819</li>\n<li>Risjord, Mark, 2012, “Models of Culture”, in Kincaid\n2012: 387–408.</li>\n<li>Rouse, Joseph, 2007, “Practice Theory”, in\n<em>Philosophy of Anthropology and Sociology</em>, Stephen P. Turner\nand Mark W. Risjord (eds.), Amsterdam/Boston: North-Holland,\n639–681. doi:10.1016/B978-044451542-1/50020-9</li>\n<li>Sahlins, Marshall, 1985, <em>Islands of History</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Sartori, Andrew, 2005, “The Resonance of\n‘Culture’: Framing a Problem in Global\nConcept-History”, <em>Comparative Studies in Society and\nHistory</em>, 47(4): 676–699. doi:10.1017/S0010417505000319</li>\n<li>Schuppli, Caroline and Carel P. van Schaik, 2019, “Animal\nCultures: How We’ve Only Seen the Tip of the Iceberg”,\n<em>Evolutionary Human Sciences</em>, 1: e2.\ndoi:10.1017/ehs.2019.1</li>\n<li>Sereno, Martin I., 1991, “Four Analogies between Biological\nand Cultural/Linguistic Evolution”, <em>Journal of Theoretical\nBiology</em>, 151(4): 467–507.\ndoi:10.1016/S0022-5193(05)80366-2</li>\n<li>Shennan, Stephen, 2008, “Canoes and Cultural\nEvolution”, <em>Proceedings of the National Academy of\nSciences</em>, USA, 105(9): 3175–3176.\ndoi:10.1073/pnas.0800666105</li>\n<li>–––, 2011, “Descent with Modification and\nthe Archaeological Record”, <em>Philosophical Transactions of\nthe Royal Society B: Biological Sciences</em>, 366(1567):\n1070–1079. doi:10.1098/rstb.2010.0380</li>\n<li>Sober, Elliott, 1991, “Models of Cultural Evolution”,\nin <em>Trees of Life: Essays in Philosophy of Biology</em>, Paul\nGriffiths (ed.), Dordrecht/Boston: Kluwer, 477–492.</li>\n<li>Sperber, Dan, 1996, <em>Explaining Culture: A Naturalistic\nApproach</em>, London: Wiley.</li>\n<li>–––, 2000, “An Objection to the Memetic\nApproach to Culture”, in Aunger 2000: 163–173 (ch.\n8).</li>\n<li>Stanley, Shaun, 2021, “Cultural Evolutionary Theory and the\nSignificance of the Biology-Culture Analogy”, <em>Philosophy of\nthe Social Sciences</em>, 51(2): 193–214.\ndoi:10.1177/0048393120971554</li>\n<li>Stegmann, Ulrich E., 2004, “The Arbitrariness of the Genetic\nCode”, <em>Biology &amp; Philosophy</em>, 19(2): 205–222.\ndoi:10.1023/B:BIPH.0000024412.82219.a6</li>\n<li>Sterelny, Kim, 2001, “Niche Construction, Developmental\nSystems, and the Extended Replicator”, in <em>Cycles of\nContingency: Developmental Systems and Evolution</em>, Susan Oyama,\nPaul E. Griffiths, and Russell D. Gray (eds.), (Life and Mind),\nCambridge, MA: MIT Press, 333–349 (ch. 23).</li>\n<li>–––, 2003, <em>Thought in a Hostile World: The\nEvolution of Human Cognition</em>, Malden, MA: Blackwell.</li>\n<li>–––, 2006a, “Memes Revisited”,\n<em>The British Journal for the Philosophy of Science</em>, 57(1):\n145–165. doi:10.1093/bjps/axi157</li>\n<li>–––, 2006b, “The Evolution and\nEvolvability of Culture”, <em>Mind &amp; Language</em>, 21(2):\n137–165. doi:10.1111/j.0268-1064.2006.00309.x</li>\n<li>–––, 2007, “SNAFUS: An Evolutionary\nPerspective”, <em>Biological Theory</em>, 2(3): 317–328.\ndoi:10.1162/biot.2007.2.3.317</li>\n<li>–––, 2012, <em>The Evolved Apprentice: How\nEvolution Made Humans Unique</em>, (Jean Nicod Lectures), Cambridge,\nMA: The MIT Press. doi:10.7551/mitpress/9780262016797.001.0001</li>\n<li>–––, 2016, “Cooperation, Culture, and\nConflict”, <em>The British Journal for the Philosophy of\nScience</em>, 67(1): 31–58. doi:10.1093/bjps/axu024</li>\n<li>–––, 2021a, “Foragers and Their Tools:\nRisk, Technology and Complexity”, <em>Topics in Cognitive\nScience</em>, 13(4): 728–749. doi:10.1111/tops.12559</li>\n<li>–––, 2021b, <em>The Pleistocene Social Contract:\nCulture and Cooperation in Human Evolution</em>, New York: Oxford\nUniversity Press. doi:10.1093/oso/9780197531389.001.0001</li>\n<li>–––, 2022, “Further Thoughts on Hierarchy\nand Inequality”, <em>Mind &amp; Language</em>, 37(4):\n760–768. doi:10.1111/mila.12435</li>\n<li>Steward, Julian Haynes, 1955, <em>Theory of Culture Change: The\nMethodology of Multilinear Evolution</em>, Urbana, IL: University of\nIllinois Press.</li>\n<li>Strimling, Pontus, Magnus Enquist, and Kimmo Eriksson, 2009,\n“Repeated Learning Makes Cultural Evolution Unique”,\n<em>Proceedings of the National Academy of Sciences</em>, USA,\n106(33): 13870–13874. doi:10.1073/pnas.0903180106</li>\n<li>Tennie, Claudio, Josep Call, and Michael Tomasello, 2009,\n“Ratcheting up the Ratchet: On the Evolution of Cumulative\nCulture”, <em>Philosophical Transactions of the Royal Society B:\nBiological Sciences</em>, 364(1528): 2405–2415.\ndoi:10.1098/rstb.2009.0052</li>\n<li>Tomasello, Michael, 1999, <em>The Cultural Origins of Human\nCognition</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Tomasello, Michael, Ann Cale Kruger, and Hilary Horn Ratner, 1993,\n“Cultural Learning”, <em>Behavioral and Brain\nSciences</em>, 16(3): 495–511.\ndoi:10.1017/S0140525X0003123X</li>\n<li>Waring, Timothy M. and Zachary T. Wood, 2021, “Long-Term\nGene–Culture Coevolution and the Human Evolutionary\nTransition”, <em>Proceedings of the Royal Society B: Biological\nSciences</em>, 288(1952): 20210538. doi:10.1098/rspb.2021.0538</li>\n<li>White, Leslie A., 1949, <em>The Science of Culture: A Study of Man\nand Civilization</em>, New York: Farrar, Straus.</li>\n<li>Williams, George C., 1966, <em>Adaptation and Natural Selection: A\nCritique of Some Current Evolutionary Thought</em>, Princeton, NJ:\nPrinceton University Press.</li>\n<li>Wimsatt, William C., 1999, “Genes, Memes, and Cultural\nHeredity”, <em>Biology &amp; Philosophy</em>, 14(2):\n279–310. doi:10.1023/A:1006646703557</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "adaptationism",
            "biology: philosophy of",
            "culture",
            "culture: and cognitive science",
            "Darwinism",
            "epistemology: evolutionary",
            "evolution",
            "information",
            "information: biological",
            "inheritance systems",
            "macroevolution, philosophy of",
            "models in science",
            "natural selection",
            "natural selection: units and levels of",
            "psychology: evolutionary",
            "replication and reproduction",
            "sociobiology"
        ],
        "entry_link": [
            {
                "../adaptationism/": "adaptationism"
            },
            {
                "../biology-philosophy/": "biology: philosophy of"
            },
            {
                "../culture/": "culture"
            },
            {
                "../culture-cogsci/": "culture: and cognitive science"
            },
            {
                "../darwinism/": "Darwinism"
            },
            {
                "../epistemology-evolutionary/": "epistemology: evolutionary"
            },
            {
                "../evolution/": "evolution"
            },
            {
                "../information/": "information"
            },
            {
                "../information-biological/": "information: biological"
            },
            {
                "../inheritance-systems/": "inheritance systems"
            },
            {
                "../macroevolution/": "macroevolution, philosophy of"
            },
            {
                "../models-science/": "models in science"
            },
            {
                "../natural-selection/": "natural selection"
            },
            {
                "../selection-units/": "natural selection: units and levels of"
            },
            {
                "../evolutionary-psychology/": "psychology: evolutionary"
            },
            {
                "../replication/": "replication and reproduction"
            },
            {
                "../sociobiology/": "sociobiology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=evolution-cultural\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/evolution-cultural/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=evolution-cultural&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/evolution-cultural/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=evolution-cultural": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/evolution-cultural/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=evolution-cultural&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/evolution-cultural/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}