{
    "url": "feminism-autonomy",
    "title": "Feminist Perspectives on Autonomy",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "Natalie Stoljar\n<natalie.stoljar@mcgill.ca>",
        "author_links": [
            {
                "http://www.mcgill.ca/philosophy": "Natalie Stoljar"
            },
            {
                "mailto:natalie%2estoljar%40mcgill%2eca": "natalie.stoljar@mcgill.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\n<a href=\"http://www.mcgill.ca/philosophy\" target=\"other\">Natalie Stoljar</a>\n&lt;<a href=\"mailto:natalie%2estoljar%40mcgill%2eca\"><em>natalie<abbr title=\" dot \">.</abbr>stoljar<abbr title=\" at \">@</abbr>mcgill<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 2, 2013",
        "substantive revision Tue Dec 11, 2018"
    ],
    "preamble": "\n\nAutonomy is usually understood by feminist writers in the same way\nthat it is understood within moral psychology generally, namely, as\nself-government or self-direction: being autonomous is acting on\nmotives, reasons, or values that are one’s own. Early\nfeminist literature regarded the notion of autonomy with suspicion\nbecause it was thought to promote unattractive\n“masculinist” ideals of personhood; that is, it was\nthought to presuppose a conception of the person as\n“atomistic”, as ideally self-sufficient, as operating in a\nvacuum unaffected by social relationships, or as an abstract reasoner\nstripped of distorting influences such as emotions. Recently feminists\nhave sought to rehabilitate the notion of autonomy. Some have argued\nthat articulating the conditions of autonomous choice is essential to\nunderstanding gender oppression and related concepts such as\nobjectification. The challenge facing feminist theorists therefore is\nto reconceptualize autonomy from a feminist perspective. The term\n“relational autonomy” is often used to refer to feminist\nreconceptualizations of autonomy to contrast them with notions of\nautonomy that are thought to presuppose atomistic conceptions of the\nself.\n",
    "toc": [
        {
            "#Int": "1. Introduction"
        },
        {
            "#FemHarCas": "2. Feminist “Hard Cases”"
        },
        {
            "#SelAbn": "2.1 Self-abnegation"
        },
        {
            "#AdaPreFor": "2.2 Adaptive preference formation"
        },
        {
            "#PraOpp": "2.3 Practices of oppression"
        },
        {
            "#RelAut": "3. Relational Autonomy"
        },
        {
            "#ProCon": "4. Procedural Conceptions"
        },
        {
            "#NorComCon": "5. Normative Competency Conceptions"
        },
        {
            "#EmoSelRegAtt": "6. Emotions and Self-regarding Attitudes"
        },
        {
            "#DiaCon": "7. Dialogical Conceptions"
        },
        {
            "#StrSubSocRelCon": "8. Strong Substantive and Socio-relational Conceptions"
        },
        {
            "#Con": "9. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nIn Kant’s famous dictum, “Autonomy of the will is the\nproperty the will has of being a law unto itself (independently of\nevery property belonging to the objects of volition)” (Kant\n1785, 108). Rational beings make the moral law for themselves and can\nregard themselves as authors of the law. Thus autonomy is manifested\nwhen rational agents “will” the moral law. For Kant the\nmoral law is a categorical, not a hypothetical, imperative. The act of\nformulating a categorical imperative, and hence the moral law, is an\nact of a pure autonomous will, because, unlike the formulation of a\nhypothetical imperative, it is untainted by the influence of the\ndesires and interests that an agent may have relative to a particular\nsituation. (For a more detailed account, see the entry on\n“Kant’s Account of Reason”.) A contemporary parallel\nof Kant’s conception of autonomy is John Rawls’s\ninfluential notion of free and rational agents formulating principles\nof justice in the “original position” (Rawls 1971). Rawls\nargues that rational agents formulate principles of justice from\nbehind a “veil of ignorance”, that is, from a position in\nwhich they are making decisions about how a society will function\nbefore they know who in this society they will turn out to be. For\nexample, in the original position, agents do not know their social\nstatus, natural abilities, or conceptions of the good (Rawls 1971,\n12). Such agents, like Kantian agents, are not influenced by the\nparticular desires and preferences that are contingent on being\nembedded in an actual situation. Because of this, their formulation of\nthe principles of justice is taken to be the product of a\n“pure” self, and hence genuinely\nself-originating. (For a more detailed account, see the entry\non “Original Position”.)\n\nFeminist philosophers typically reject the Kantian and Rawlsian\nconceptions of autonomy. Five categories of feminist critique have\nbeen identified (Mackenzie & Stoljar 2000b, 5–12). All of\nthe critiques reject both the nature of the self and the\nvalue of autonomy implicit in the Kantian/Rawlsian account.\nThe notion of self implicit in the Kantian and Rawlsian accounts is\nsaid to be “atomistic”; that is, it is abstracted from the\nsocial relations in which actual agents are embedded. Such a\nconception of the self is associated with the claim that autonomous\nagents are, and ought to be, self-sufficient, which in turn is\nassociated with the character ideal of the “self-made\nman”. Feminists challenge this character ideal and question\nwhether self-sufficiency, or “substantive independence”,\nis really a value that a theory of autonomy, and normative theories in\ngeneral, should promote (Jaggar 1985; Code 1991). If autonomy is\nsomehow conceived as inimical to being a woman—because, for\nexample, being a women involves valuing social relationships of care\nwhereas being autonomous devalues such relationships—one denies\nwomen, in particular, the social and political advantages associated\nwith the label “autonomous”.\n\nSince these initial critical reactions, feminist philosophers have\nattempted to rehabilitate autonomy (e.g., Meyers 1987 and 1989; Benson\n1990; Friedman 1997 and 2003; Mackenzie & Stoljar 2000a). Some\nfeminist philosophers have argued that articulating the conditions of\nautonomous choice is vital to attempts to understand gender\noppression. The challenge facing feminist theorists is to\nreconceptualize autonomy in ways that are compatible with the feminist\ncritiques (Mackenzie & Stoljar 2000b, 3–4).\n“Relational autonomy” is the name that has been given to\nfeminist reconceptualizations of the notion of autonomy. The term\n“relational” here may serve simply to deny that autonomy\nrequires self-sufficiency. If relationships of care and\ninterdependence are valuable and morally significant (cf. Mackenzie\n& Stoljar 2000b, 8–10), then any theory of autonomy must be\n“relational” in the sense that it must acknowledge that\nautonomy is compatible with the agent standing in and valuing\nsignificant family and other social relationships.\n“Relational” may also deny the metaphysical notion of\natomistic personhood, emphasizing instead that persons are socially\nand historically embedded, not metaphysically isolated, and shaped by\nfactors such as race and class. It is this latter sense of\n“relational” that will be employed in the following sketch\nof relational accounts.\n2. Feminist “Hard Cases”\n\nWhy is autonomy of interest to feminists? One way to answer this\nquestion is to examine what might be considered failures of\nautonomy that appear to be linked to practices of gender\noppression. This section describes three examples that have been\nwidely discussed in the feminist literature on autonomy. These\nare:\n\nself-abnegation or excessive deference to the wishes of\nothers;\n“adaptive preference formation” in which choices and\npreferences are unconsciously accommodated to oppressive social\nconditions; and\ndecisions of agents to adopt what may appear to be practices of\ngender oppression—e.g., veiling—including those that seem\nto produce significant physical and psychological harm to women, e.g.,\n“genital cutting” (Meyers 2000a).\n\n\nThe examples are “hard cases” because there is\ndisagreement among feminists over whether (and how) the cases\nillustrate diminished autonomy.\n2.1 Self-abnegation\n\nSeveral theorists (e.g., Westlund 2003, 483–4; Oshana 2006,\n57–58) invoke Virginia Woolf’s critique of Coventry\nPatmore’s poem “Angel in the House” to motivate\ndiscussions of autonomy:\n\nShe was intensely sympathetic. She was immensely charming. She\nexcelled in the difficult arts of family life. She sacrificed herself\ndaily. If there was chicken, she took the leg, if there was a draught,\nshe sat in it. (Woolf 1942, 59)\n\n\nAndrea Westlund observes that the Angel resembles Thomas Hill’s\nwell-known example of the Deferential Wife (Westlund 2003,\n485–6):\n\nShe buys the clothes he prefers, invites the guests\nhe wants to entertain, and makes love whenever he is\nin the mood. She willingly moves to a new city in order for him to\nhave a more attractive job, counting her own friendships and\ngeographical preferences insignificant by comparison... She does not\nsimply defer to her husband in certain spheres as a trade-off for his\ndeference in other spheres. On the contrary, she tends not to form her\nown interests, values, and ideals, and when she does, she counts them\nas less important than her husband’s. (Hill 1991, 5)\n\n\nOne would think that such excessive deference would be incompatible\nwith autonomy. Excessive deference implies that others, not the agent\nherself, are driving the agent’s choice and preference\nformation. However, Westlund points out that on some popular accounts\nof autonomy, because the woman is willing to subordinate\nherself or, because she prefers deference and values her own\nopinions and interests less than she values those of her husband, she\nmay be considered autonomous. For example, on one influential account,\nthat of Harry Frankfurt, a preference is autonomous if it is one with\nwhich the agent wholeheartedly identifies (Frankfurt 1988). As\nWestlund argues, the agent here seems to identify wholeheartedly with\nher preference for deference to her husband: “Hill’s\ncharacter is remarkable in part because she seems so\nunambivalent about her subservient role” (Westlund\n2003, 491).\n\nThe example is of interest to feminists in the first place because the\ndeference and apparent preference for subservience it describes is\ngendered. It is an outcome of systems of gender oppression\nthat women are expected to assume servile roles, and hence may come to\nendorse, prefer or willingly adopt them. Moreover, perhaps precisely\nbecause of the connection between these kinds of preferences and\nsystems of gender oppression, many feminists resist the conclusion\nthat the Angel and the Deferential Wife are autonomous. Thus Susan\nBabbitt argues that although the Deferential Wife appears to have made\na rational judgment about what she values, and appears therefore to be\nliving according to her own life-plans, in fact the preference for\nsubservience is incompatible with her autonomy: “habitual\nservility” defines her sense of self, and this is “not the\nkind of self to which a concept of autonomy can be applied”\n(Babbitt 1993, 250). If this is right, influential accounts of\nautonomy, and those feminist positions influenced by them, will have\nto be revised. (See the entry on “Feminist Moral\nPsychology” for more discussion of the example of the\nDeferential Wife.)\n2.2 Adaptive preference formation\n\nDiscussions of adaptive preference formation are often found in the\nliterature—both feminist and nonfeminist—on rational\nchoice theory (Elster 1983; Superson 2005; Cudd 2006). According to\nJon Elster’s classic description of adaptive preference\nformation, a fox, after finding that he can no longer reach some\ngrapes, decides that he does not want the grapes after all. The fox\nadapts his preferences to what he perceives to be the options\navailable to him. In order to distinguish adaptive preference\nformation from preference change due to learning and other processes,\nElster proposes that the former is an unconscious process in which an\nagent turns away from a preference to avoid unpleasant cognitive\ndissonance that is associated with holding on to it. According to\nElster, this is a “blind psychic process operating ‘behind\nthe back’ of the person” (Elster 1983, 16; see also\nColburn 2011). Others characterize adaptive preferences as those the\nagent finds herself with after “life-long habituation”\n(Nussbaum 2001, 80; Sen 1995; see also Khader 2009, 2011). For\nexample, Martha Nussbaum describes the case of poor working women in\nIndia who, though subjected to physical abuse by their husbands,\nchoose to remain in the marriage. Some women, like Vasanti, think that\nthe abuse “was painful and bad, but, still, a part of\nwomen’s lot in life, just something women have to put up with as\npart of being a woman dependent on men, and entailed by having left\nher own family to move into a husband’s home” (Nussbaum\n2001, 68–9).\n\nIt is increasingly noticed that adaptive preferences are formed in the\ncircumstances of oppression. Theorists of oppression have pointed to\nthe phenomenon of “deformed desire” in which “the\noppressed come to desire that which is oppressive to them…[and]\none’s desires turn away from goods and even needs that, absent\nthose conditions, they would want” (Cudd 2006, 181). Adaptive or\ndeformed desires may be the result of the internalization of an\noppressive ideology:\n\nConsider the eighteen year-old college student who excels in her\nstudies, is well-liked by her many friends and acquaintances, leads an\nactive, challenging life, yet who regularly feels bad about herself\nbecause she does not have ‘the right look’… So, on\ntop of everything else she does, she expends a great deal of time and\nmoney trying to straighten or curl her hair, to refine her cosmetic\ntechnique, to harden or soften her body, and so on…. (Benson\n1991, 389)\n\n\nOne plausible analysis of the student’s psychology is that she\nhas internalized the oppressive norms of the fashion industry,\naccording to which appearance is tied to self-worth. The student has\nunconsciously turned away from values that would afford her a\nhealthier sense of self-worth; her desire for an excessive number of\nbeauty treatments is deformed because it is the product of adopting\nvalues that are oppressive to her, and it is a desire that she would\nnot have had absent the oppressive conditions.\n\nAdaptive or deformed preferences have been taken to be\n“paradigmatically nonautonomous” (Taylor 2009, 71). For\ninstance, feminists working on rational choice theory tend to assume\nthat deformed desires are incompatible with rational choice and\nautonomous choice, or at least that they arise only in contexts in\nwhich autonomy is already damaged (e.g., Superson 2005, 109). However,\nreactions to adaptive preferences vary in the literature on autonomy\n(Stoljar 2014; Terlazzo 2016). Marilyn Friedman suggests that women\nwho choose to remain in abusive relationships may be autonomous. For\nFriedman, adapting to an abusive relationship is in principle\ncompatible with the critical reflection that is sufficient for\nautonomy; such women may have endorsed the preference to remain and\nmay have rejected competing options (Friedman 2003, 146).\n(Friedman’s “procedural” account of autonomy will be\ndiscussed in detail in §4.) Other autonomy theorists argue along\nsimilar lines, leaving open the possibility that adaptive preferences\ncould count as autonomous. Andrea Westlund argues that women could\n“freely and authentically” be committed to norms that\nsubordinate them, as long as they are answerable to others for their\ncommitment to these norms (e.g., Westlund 2009, 29; see §7 of the\ncurrent entry).\n2.3 Practices of oppression\n\nThe third set of cases that has attracted attention among feminist\nautonomy theorists are those in which agents appear to\nself-consciously adopt (what are alleged to be) practices of\noppression (such as the Islamic practice of veiling), participate in\npractices of oppression that severely curtail women’s options\n(such as arranged marriages) or subject women to physical harm (such\nas ‘female circumcision’ or clitoridectomy). Adopting such\npractices need not be the result of accommodation or adaptation; it\nneed not be the result of an attempt to resolve cognitive dissonance\nat an unconscious level, or of resigned habituation to oppressive\ncircumstances. Rather, the practices in question can be the explicit\nrequirements of a society or culture, and self-consciously promoted by\nwomen themselves. Uma Narayan describes a community of women in India,\nthe Sufi Pirzadi, who “live in relative purdah (seclusion)\nwithin the home and are expected to veil when they are in\npublic” (Narayan 2002, 420). These women acknowledge that purdah\nseverely limits their education and mobility, and has the effect of\nmaking them dependent on male members of the community. But they also\nexplicitly recognize benefits, for instance, that veiling signifies\n“womanly modesty and propriety” and their “superior\nstanding vis-à-vis other Muslim women” (Narayan 2002,\n420–1).\n\nSome theorists of autonomy (e.g., Oshana 2006) claim that severely\nconstraining external conditions are autonomy-undermining. Other\ntheorists are more circumspect, urging that women subject to\nconstraining practices should not be characterized as “compliant\ndupes of patriarchy” (Narayan 2002, 420) and that women living\nunder oppressive regimes could autonomously accept their\nconditions (Christman 2004, 152; Westlund 2009, 29). Diana Meyers\nwrites, for instance, that “there are women [participating in\nthe practice of female genital cutting] who conclude that cultural\ntradition or cohesion or getting married and bearing children are more\nimportant than bodily integrity” and that therefore “we\nwould need far more consensus than we presently have (or are likely to\nget)…before we could conclude that women who opt for compliance\nwith female genital cutting norms never do so autonomously”\n(Meyers 2000a, 479).\n\nWe see, then, that feminist philosophers have responded to the hard\ncases in different ways. The following sections provide a more\ndetailed elaboration of the theoretical positions behind these\ndifferent responses.\n3. Relational Autonomy\n\nThe cases above draw attention to the fact that there is disagreement\namong theorists of autonomy, and among feminist theorists, over\nwhether they are examples in which the agent’s autonomy is\ndiminished.\n\nOne way to resolve the disagreement might be to adopt what could be\ncalled a “thin” or “minimalist” conception of\nautonomy. On this conception, agents are autonomous just in case\ncertain minimal conditions for human flourishing obtain, because the\npreferences, choices, and so forth that one adopts in this state of\nwell-functioning should be considered to be “one’s\nown”. Sarah Buss, for example, advocates such a position:\n\nThe key to…self-governing agency is the distinction between a\nhealthy human being and a human being who suffers from some\npsychological or physiological ‘affliction’ (e.g., intense\npain, fear, anxiety, fatigue, depression, and obsession). (Buss 2005,\n215)\n\n\nAn agent’s autonomy is impaired, therefore, only if she\nsuffers an affliction that is severe enough to distort and pathologize\nher capacity for reasoning; the default position is that she is\nautonomous. Narayan also suggests a thin conception of autonomy:\n\nA person’s choice should be considered autonomous as long as the\nperson was a ‘normal adult’ with no serious cognitive or\nemotional impairments and was not subject to literal outright coercion\nby others. (Narayan 2002, 429)\n\n\nOn minimalist conceptions of autonomy, most of the agents described in\nthe hard cases would be autonomous because minimal conditions for\nflourishing obtain and there is no pathology, cognitive impairment, or\ndirect coercion present. This characterization has its theoretical\nadvantages. For example, Narayan is concerned to limit the\njustification for state interference in individual voluntary choice; a\nminimalist conception may indeed be acceptable for use in theories\nthat regulate relations between the citizen and the state or to\naddress issues of paternalism (Holroyd 2009).\n\nBut minimalism is not the norm within the feminist literature on\nautonomy. It is true that oppressive social conditions do not\ntypically produce pathologies or cognitive impairments; neither do the\nsocial conditions of oppression usually constitute direct coercion\nsufficient to erode autonomy. However, minimalism overlooks the\ncomplex effects of gender norms and oppressive social conditions on\nagency (e.g., Bierria 2014; Liebow 2016; Johnston 2017). The hard\ncases are hard because they suggest that gender norms and oppressive\nconditions, in addition to factors such as cognitive\nimpairment or direct coercion, potentially undermine or erode\nagents’ capacities for autonomy. Yet it is not clear precisely\nhow this happens.\n\nFeminist or “relational” theories of autonomy attempt to\nanswer the question of how internalized oppression and oppressive\nsocial conditions undermine or erode agents’ autonomy. These\ntheories will be sketched in §4–8. Before turning to these\ntheories, some preliminary classifications should be made. Relational\ntheories may be classified as either\n\nprocedural, strongly substantive, or\nweakly substantive, versus\ncausal or constitutive.\n\n\nThe procedural/substantive distinction within relational conceptions\nparallels a distinction within the literature on autonomy more\ngenerally (Mackenzie & Stoljar 2000b, 12–21). Procedural\ntheories have dominated the debate since the 1970s (Dworkin 1988;\nFrankfurt 1988). They claim that autonomy is achieved when the agent\nundergoes, or has the capacity to undergo, an internal intellectual\nprocess of reflecting on her motivations, beliefs, and values, and\nthen revising her preferences in the light of such reflection. This\nprocess is said to be “content-neutral” because the\noutcomes of the process of critical reflection, whatever their\ncontent, will be autonomous. Substantive theories claim that autonomy\nis a value-laden notion. According to “strong substantive”\napproaches, “the contents of the preferences or values that\nagents can form or act on autonomously are subject to direct normative\nconstraints” (Benson 2005a, 133). A preference to be enslaved or\nto be subservient cannot be autonomous on strong substantive accounts\n(e.g., Charles 2010). “Weak substantive” approaches build\nin normative content, and hence are substantive, yet they do not place\ndirect normative constraints on the contents of agents’\npreferences (Benson 2005a; Richardson 2001). For example, some\naccounts require that agents exhibit moral attitudes to themselves\nsuch as self-respect or a robust sense of their own self-worth to\ncount as autonomous (Govier 1993; McLeod 2002).\n\nIn addition to the procedural/substantive dimension, relational\nconceptions may be classified as either causal or\nconstitutive. Causal conceptions acknowledge the impact of\nboth social relationships and socio-historical circumstances on\nagents’ capacities. Annette Baier points out that agents are\n“second persons”, that is, “persons are essentially\nsuccessors, heirs to other persons who formed and cared for\nthem” (Baier 1985, 85). On this view, an agent’s social\nrelationships influence the development of autonomy: “if we ask\nourselves what actually enables people to be autonomous, the answer is\nnot isolation, but relationships—with parents, teachers,\nfriends, loved ones” (Nedelsky 1989, 12). If social\nrelationships cause autonomy to develop, a lack of\nappropriate social relationships can also stunt its development\n(Friedman 1997). Similarly, social and historical conditions (such as\noppressive gender socialization) may promote or impede the capacity\nfor autonomy (e.g., Meyers 1989).\n\nCausal accounts investigate the effects of external\n“relational” factors on agents’ autonomy; they do\nnot offer an analysis of autonomy using such external\nfactors. On constitutively relational accounts, however,\ninterpersonal or social conditions are part of the “defining\nconditions” of autonomy (Christman 2004, 147). Suppose, for\ninstance, that an agent is subject to severely constraining external\nconditions such as slavery. Marina Oshana argues that such external\nconditions are incompatible with autonomy because autonomy is a\ntemporally extended, “global” condition of agents in which\nthey have “de facto power and authority over choices\nand actions significant to the direction of [their lives]”\n(Oshana 2006, 2). Severely constraining external conditions remove the\nde facto power required for autonomy. Other theorists who adopt\nconstitutive accounts focus rather on local autonomy, namely,\nwhat is required for choices, preferences, or desires at\nparticular times to count as autonomous. Suppose, for instance,\nthat autonomous choice at a particular time requires that agents have\navailable to them a “wide enough range of…significant\noptions” at that time (Brison 2000, 285). This account of local\nautonomy is constitutively relational because no matter how robust an\nagents’ psychological capacities, if the relevant external\nconditions do not obtain at a time, it is not possible for the\nagent’s preference at that time to be autonomous.\n\nThe procedural/substantive distinction cuts across the\ncausal/constitutive distinction. Procedural theories are typically\ncausally relational (see §4). For instance, although the\nfeatures required for autonomy on procedural accounts—e.g.,\ncritical reflection—can be affected by oppressive socialization,\nit is in principle possible for the critical faculties of agents in\noppressive environments, even including those who endorse oppressive\nnorms, to be fully intact and hence for them to be fully autonomous.\nAn important feature of procedural theories, however, is their\ncontent-neutral or formal aspect. Andrea Westlund has recently\nendorsed what she calls a formal and constitutively relational\nposition in which interpersonal conditions are included in the\ndefinition of autonomy (see §7). Therefore, content-neutral\ntheories can be constitutively relational. Moreover, weak substantive\ntheories can be causally relational. Weak substantive theories build\nin moral self-regarding attitudes such as self-respect as necessary\nconditions of autonomy. Although these attitudes may be affected by\ninterpersonal and other external conditions, weak substantive theories\nneed not employ the external conditions as defining conditions of\nautonomy (see §6). However, strong substantive theories that\nplace direct constraints on the contents of the preferences permitted\nfor autonomous agents are constitutively relational because, on strong\nsubstantive theories, external conditions are necessary conditions of\nautonomy (see §8).\n4. Procedural Conceptions\n\nThis section outlines two versions of procedural and content-neutral\nconceptions that are well-known in the feminist literature: those of\nMarilyn Friedman and Diana Tietjens Meyers.\n\nProcedural conceptions have been prominent in the standard literature\non autonomy from the 1970s to the present day (e.g., Dworkin 1988;\nFrankfurt 1988; Christman 2009). These conceptions have been adopted\nin different forms by feminist theorists. The concept of\ncontent-neutrality has been an extremely important tool in the\nfeminist rehabilitation of autonomy and procedural conceptions are\nattractive to feminists in large part due to their content-neutrality.\nMany feminists hesitate to embrace autonomy because of its\nassociations with “masculinist” ideals such as those\nexemplified in the “self-made man”, namely, substantive\nindependence and self-reliance, social isolation and hyper-rationality\n(Jaggar 1985; Code 1991). However, on content-neutral conceptions,\nthere is no value or set of preferences that an autonomous person must\nendorse. Preferences for relationships of care and dependency such as\nthose within marriage or other family structures can be just as\nautonomous as preferences for self-reliance or relative social\nisolation; preferences for cultural and religious norms into which\nagents are born can be just as autonomous as preferences to repudiate\nthese norms, and so on. The device of content-neutrality also respects\nfeminist attempts to preserve the differences among and the\nmultiplicity of agents. Feminists noticed that agents’\nlife-plans and conceptions of the good will be influenced by a\ndiversity of social factors such as race, class, and gender (Friedman\n2003; Mackenzie & Stoljar 2000b; Meyers 1989, 2002). Hence they\nargue that theories of autonomy must be neutral with respect to\nlife-plans and conceptions of the good. According to some feminists, a\ntheory of autonomy should not “homogenize” agents (Meyers\n2000a, 480), nor should it impose feminist, liberal, or any other\nideals on agents in the name of autonomy. Content-neutrality allows\nthat the preferences of autonomous agents could be wrong from\nanother perspective, either morally or because they do not align with\nthe agent’s best interests. Many theorists consider that a\ncriterion of a correct theory of autonomy is that it distinguish\nbetween self-rule and right-rule (Benson 2005a).\nContent-neutrality ensures that self-rule does not collapse into\nright-rule, and further that agents are protected from the risk of\npaternalistic interference in their decisions.\n\nProcedural conceptions characterize autonomous agents—agents\nwhose preferences and desires are genuinely their\nown—as those who critically reflect in the appropriate\nway to evaluate their preferences, motives, and desires. Such\napproaches are often hierarchical (employing a hierarchy of\nmental states to explain autonomy) as well as structural\n(proposing conditions that an agent’s existing\nmotivational state must satisfy). One well-known example of a\nhierarchical and structural approach is that of Harry Frankfurt. On\nFrankfurt’s account, autonomy requires “wholehearted\nidentification” at a higher-order level with lower-order\nmotives, preferences, or desires (Frankfurt 1988). These structural\nand ahistorical approaches have been subject to many cogent objections\n(Mackenzie & Stoljar 2000b; Taylor 2005b). One important\ndifficulty is the “problem of manipulation” in which it is\nsupposed that a hypnotist inserts into an agent a mental state\nstructure that is sufficient for autonomy (see, e.g., Taylor 2005b).\nOn structural accounts, this agent counts as autonomous when she\nappears not to be.\n\nThe procedural conceptions defended by Friedman and Meyers exemplify\nan alternative approach in which autonomy is not tied to the\nstructural features of an occurrent mental state but rather is\nachieved when the agent undergoes a historical process of\ncritical reflection. John Christman is an important proponent in the\nstandard literature of the historical approach (Christman 1991;\nChristman 2009; see also Mele 1995). For Christman, as for many others\nwho adopt procedural conceptions, autonomous agents must be both\nreflectively competent and authentic. The test for authenticity on his\naccount is historical and counterfactual: an agent is authentic with\nrespect to a certain preference or desire if and only if she did not\nresist the development of the preference or desire when attending to\nthe process of its development, or would not have resisted\nhad she attended to the process (Christman 1990; Christman 1991, 346).\nIn recent work, Christman develops the notion of\nnonalienation as the test of authenticity: an agent is\nauthentic with respect to a desire if and only if, were she to\ncritically reflect on the historical processes leading to the desire,\nshe would not be alienated from the desire, where\n“alienation” is understood as either a negative judgment\nabout or a negative emotional reaction to the desire (Christman 2009,\n144, 155–6).\n\nFriedman employs the related idea of reflective endorsement:\na process of critical reflection can result in either endorsement and\nwholehearted commitment to one’s preferences and desires, to\nwholehearted repudiation of the preferences or desires, or to\nhalf-hearted commitment to the preferences or desires (Friedman 2003,\n4–5). Friedman says that “when an agent chooses or acts in\naccord with wants or desires that she has self-reflectively endorsed,\nthen she is autonomous” (Friedman 2003, 5). Agents acting on\ndesires that satisfy this condition are acting authentically and on\ntheir deepest commitments.\n\nOn Friedman’s conception, and on procedural accounts in general,\nthere is no reason in principle why choosing subservience, or adopting\noppressive norms, could not be autonomous. An example considered by\nFriedman is that of a preference to remain in an abusive domestic\nrelationship due to adherence to religious or moral norms of marriage.\nThe preference may be adaptive in the sense described in §2 if\nthe agent has unconsciously adjusted her preferences to accommodate\nthe circumstances, thinking she has no other feasible options.\nFriedman comments that if these religious or moral norms are the ones\nthe agent “really cares about”, her preference to remain\nis autonomous. She writes:\n\nSomeone’s self-reflections and choices under those conditions\nare less likely than otherwise to be reliable reflections of what she\nreally cares about. Yet it is not impossible to discern or act\naccording to one’s deeper concerns under coercive conditions.\n(Friedman 2003, 146)\n\n\nThe agent may even recognize that choosing to remain in an abusive\nrelationship is in effect to choose a situation in which her own\nfuture autonomy may be compromised. But, as Friedman points out,\nautonomy is not the only value, and, the case could be explained as\nthe agent ranking her own future autonomy against other values of\nimportance to her. In the agent’s calculations, future autonomy\nis ranked below other considerations; it is not overriding.\n\nFriedman nevertheless is reluctant to treat such agents as autonomous\nto the highest degree. She proposes a “threshold” account.\nThat is, when the preference for a traditional role of subservience,\nor to remain in an abusive relationship, reflects the agent’s\ndeepest commitments, it meets a threshold and hence is autonomous.\nHowever, although these agents are locally autonomous relative to\nthese preferences, they are less autonomous than agents who\naltogether repudiate what Friedman calls “autonomy-devaluing\nnorms” (Friedman 2003, 24).\n\nMeyers introduces the notion of “autonomy competency” to\nspell out her procedural conception. In an early paper, Meyers\ndescribes acting autonomously as “the difference between doing\nwhat one wants and doing what one really wants. The autonomous self is\nnot identical with the apparent self; it is an authentic or\n‘true’ self” (Meyers 1987, 619). For Meyers, the\nauthentic self emerges when a person exercises the “agentic\nskills” that characterize autonomous people:\n\nAutonomous people exercise a repertoire of skills to engage in\nself-discovery, self-definition and self-direction, and...the\nauthentic self is the evolving collocation of attributes that emerges\nin this ongoing process of reflection, deliberation and action.\n(Meyers 2005, 49)\n\n\nShe argues that the skills necessary for the authentic self to be\nrealized can be damaged by gender socialization. In the case of\nWestern women, the “emotional receptivity and\nperceptiveness” that is encouraged in women is likely to enhance\nthe skill of self-discovery and hinder those of self-definition and\ndirection; whereas for men in Western cultures the opposite is likely\nto be the case (Mackenzie & Stoljar 2000b, 18).\n\nMeyers endorses the content-neutrality of the procedural account\nbecause she considers that substantive or\n“value-saturated” accounts of autonomy limit the\nlife-plans and conceptions of the good available to autonomous agents,\nand undermine the possibility of diversity. However, in an analysis of\nthe practice of “genital cutting”, she acknowledges that\n“value-neutral” approaches to autonomy, such as her own,\nshould not “[neglect] the possibility that a well-integrated and\nsmoothly functioning self could be in need of rigorous scrutiny and\ndrastic overhaul” (2000a, 480). Meyers argues for the importance\nin such cases of education programs that “augment\nautonomy” because “[s]uccessful education programs\nmobilize women’s introspection, imagination and imagination\nskills”. For example:\n\nOne program invited women to explore their feelings about their\nsexuality…[and encouraged them] to acknowledge the complexity\nof their emotional lives and to take their own subjectivity seriously.\nAnother…invited women to empathize with [women who had become\ninfected] and the grief of the families of women and girls who had\ndied… [Another invited] women to imagine the lives of women\nwhose cultures are different but whose religion is the same as their\nown. (Meyers 2000a, 485)\n\n\nMeyers’s account implies, then, that certain specific elements\nof the critical reflection required for autonomy—namely,\nintrospection and imagination—can be damaged by oppressive\npractices. Moreover, if agents lack self-respect due to being\nsubjected to oppression, they may not achieve autonomy competency.\nMeyers proposes that self-respect is necessary to achieve the\nself-realization required for autonomy competency, although it\n“cannot be construed as a masculine or perfectionist\nvalue” (Meyers 1989, 208; compare Dillon’s feminist\nconception of self-respect in Dillon 1992). Due to the presence of a\nmoral notion of self-respect in Meyers’s account, it has been\nquestioned whether the account is really value-neutral. In one sense,\nher account is content-neutral: the life-plan that an\nautonomous agent can define for herself is not constrained by moral or\nother requirements; it does not have to be a moral life-plan or one\nthat is otherwise good for the agent to undertake. In another sense,\nbecause of the role of self-nurturing and self-respect without which\nthe exercise of autonomy competency would not be possible,\nMeyers’s account could be said to have “weak normative\nsubstance” and hence be weakly substantive (Benson 2005a).\n\nFriedman’s and Meyers’s conceptions of autonomy illustrate\nfour features of autonomy that have been influential in subsequent\nfeminist work. First, their conceptions of autonomy are (causally)\nrelational. Meyers considers the impact of oppressive\nsocialization on autonomy competency. Friedman considers the\nimpact of familial and community relationships (Friedman\n2003, 97). Restrictive or oppressive social relationships may hamper\nan agent’s ability to develop the capacity for critical\nreflection that is required for autonomy, or they may provide role\nmodels, self-trust, self-confidence, and so forth, which enhance the\ncapacity (Friedman 2003, 97).\n\nSecond, both Friedman and Meyers claim that autonomy is a matter of\ndegree. On Friedman’s conception, autonomy comes in degrees\nbecause an agent’s capacity for critical reflection may operate\nat different levels of sophistication depending on the agent’s\nsocialization and educational background. Meyers distinguishes\nepisodic or local autonomy—the capacity to\ndecide in particular situations—from programmatic\nautonomy, which is the capacity to decide major life issues (e.g.,\nwhether to be a mother, or whether to dedicate oneself to the pursuit\nof a career). Meyers thinks that oppressive socialization hampers\nprogrammatic autonomy but not necessarily local autonomy (Mackenzie\n& Stoljar 2000b, 18). For example, oppressive socialization\n(which, for instance, might value marriage or motherhood over a career\nor financial independence) may truncate the range of options that\ngirls consider to be viable, thus interfering with their programmatic\nautonomy. They may nevertheless have strongly developed critical\nreasoning faculties that allow them a high degree of competency to\nexercise local autonomy skills. If an agent is capable of local\nautonomy but not programmatic autonomy, she has autonomy only to a\ndegree.\n\nThird, Friedman and Meyers reject the association of autonomy with\nhyper-rationality or (overly) cognitive aspects of the self. Friedman\nnotes that the “self-reflections that make choices and actions\nautonomous need not be conscious” and that “autonomous\nchoice…does not need to be highly deliberate or\ndeliberated” (Friedman 2003, 8). Moreover, feelings may\nconstitute “reasons” on Friedman’s view:\n“emotions and desires, as well as imagination, can constitute a\nkind of reflection on or attention to objects or values of\nconcern” (Friedman 2003, 10). Meyers also repudiates the\n“hyper-rational” construal of the skills that are\nnecessary for autonomy on her theory. In recent work, she has focused\non the relational and embodied dimensions of the self to ask whether\nautonomy skills can be exercised by what she calls the\n“self-as-embodied” and the\n“self-as-relational” (Meyers 2005). There is little\ndiscussion in the literature on autonomy of the embodied dimensions of\nagency and autonomy, so here Meyers has identified a fruitful avenue\nof further research (see also Mackenzie 2001).\n\nFourth, Meyers addresses the question of whether the authentic or\n“true self” required for autonomy must be unified (Meyers\n2000b). Notions such as wholehearted endorsement seem to imply a\nfurther requirement of coherence among mental states. Indeed, Benson\nsuggests that coherence is a feature common to procedural conceptions\nthat are “identity-based”, namely, those claiming that\npreferences and actions are “genuinely my own because\nthey are appropriately related to my identity” (Benson 2005b,\n102–3). An important theme in contemporary feminist thought,\nhowever, is the rejection of the position that coherence is necessary\nfor an agent’s sense of identity. Rather, identity is said to be\n“intersectional”: an agent’s sense of self is\nsubject to multiple and intersecting modes of oppression, for\ninstance, those of class, gender, race, and sexuality (e.g., Crenshaw\n1991). Intersecting oppressions can lead to ambivalence or to a sense\nof self in which preferences pull in competing directions (e.g.,\nBenson 2005b, 105–6). Meyers argues for a conception of\nauthenticity that incorporates the lessons of intersectionality\n(Meyers 2000b).\n\nThe procedural theories defended by feminists have many strengths, the\nmost noteworthy of which is the commitment to content-neutrality.\nHowever, procedural theories have been found wanting by critics for\ntwo important reasons. First, they do not put enough weight on the\neffects of internalized oppression on agents’ motivational\nstates. And, second, procedural theories overlook the constitutive\nrole of external conditions in the definition of autonomy. Consider\nagents for whom certain norms are ingrained through oppressive\nsocialization, such as the eighteen-year-old student described in\n§2. She treats norms about beauty and fashion as important and\nperhaps overriding reasons for action because she has internalized the\nidea that appearance is a criterion of self-worth. Due to the effects\nof the oppressive ideology, the agent treats false stereotypes as\n“natural”, and formulates desires and plans based on the\nstereotype. On procedural accounts, false stereotypes that have been\ninternalized by the agent may well be the agent’s own\nbecause they may be the products of reflective endorsement or the\nexercise of autonomy competency. This conclusion seems inadequate to\nmany authors. For example, Benson has objected to Christman’s\nversion of a historical procedural account that, in cases like that of\nthe student, because the norms are so deeply ingrained, it is not\nplausible to think that she resisted or even would have\nresisted the process of development of the stereotype even had she\nbeen aware of the process (Benson 1991). Hence procedural accounts\noften cannot adequately explain why cases of internalized oppression\nappear to be nonautonomous. A second reason that procedural approaches\nhave been deemed unsatisfactory is that it has been argued that\nseverely constraining external circumstances, including the lack of a\nsufficient number of real options, compromise agents’ freedom\nand autonomy (Raz 1988; Brison 2000; Nussbaum 2001; Oshana 2006).\n5. Normative Competency Conceptions\n\nIn his early work, Paul Benson offered a normative competence\nconception of “free agency” that, he argued, was congenial\nto feminist interpretations of moral and political agency (Benson\n1987; 1990; 1991). For our purposes, Benson’s proposal can be\ntreated as an account of autonomy because the capacity for free agency\nis also thought of as a capacity for exercising agency that is\none’s own. As Benson points out, both Gary Watson and\nSusan Wolf adopt versions of normative competence views. Watson claims\nthat endorsement is insufficient for autonomy because doing\n“what one wants”—that is to say, doing what one has\nendorsed—is compatible with mere intentional agency and\ndoes not provide the further element required to guarantee\nautonomous agency (Watson 1975, 205; compare Buss 1994).\nWatson proposes that “if what I do flows from my values and\nends, there is a…sense in which my activities are inescapably\nmy own” (Watson 1996, 233; quoted in Benson 2005b, 103). This\nmodification of the endorsement view, although it introduces values\ninto the analysis of autonomy, suffers from the same objection as the\npurely procedural theories discussed in the last section. For if an\nagent such as the student mentioned above has so effectively\ninternalized oppressive norms that she values them and treats them as\nher ends, then it is questionable whether they are genuinely her\nown.\n\nSusan Wolf adopts a normative competence view in which the capacity\nthat is essential for autonomy is the capacity to track objective\nmoral reasons. Wolf considers agents who have experienced a morally\nimpoverished or distorting socialization. For instance, JoJo is the\nson of an evil and sadistic tyrant who has been raised to respect his\nfather’s values and emulate his desires, so that he thoroughly\ninternalizes his father’s evil and sadistic worldview. Suppose\nthat on procedural theories, JoJo counts as autonomous because he\nendorses his desires in the appropriate ways, has the desires he\nreally wants, and so forth. Wolf proposes that he is neither\nfree nor morally responsible because his upbringing has undermined his\ncapacity to distinguish right from wrong: “[i]t is unclear\nwhether anyone with a childhood such as his could have developed into\nanything but the twisted and perverse sort of person that he has\nbecome” (Wolf 1987, 54). On Wolf’s account, the failure of\nautonomy is a failure of a capacity to track an objective aspect of\nthe world, namely, “the moral” or “the right”.\nSince for Wolf the demands of morality are equivalent to the demands\nof objective “Reason”, in order to be autonomous, agents\nmust be capable of discerning the requirements of Reason.\n\nBenson employs a parallel notion of normative competence, though it\ndoes not does require a capacity to track objective morality, but\nrather an ability to identify and deploy norms that are appropriate to\na particular domain (1987, 486). He writes that:\n\n[F]ree agency requires normative competence, an array of abilities to\nbe aware of applicable normative standards, to appreciate those\nstandards, and to bring them competently to bear in one’s\nevaluations of open courses of action…At the heart of free\nagency is the power of our actions to reveal who we are, both to\nourselves and to others, in the context of potential normative\nassessments of what we do. (Benson 1990, 54)\n\n\nAutonomy based on normative competence is compatible with feminist\nreinterpretations of moral and political agency because it is\nrelational in three respects (Benson 1990, 55). First, normative\ncompetence is “other-directed” in that “it makes\ncertain normative characteristics of the agent present to\nothers”. Second, the content of normative competence\n“depends on the particular norms or standards in relation to\nwhich an agent’s freedom may be determined” (Benson 1990,\n55). Third, the normative standpoint relative to particular domains is\nthat of “persons and institutions with whom (or which) one is\nconcretely connected by friendship, family, work, neighborhood”\n(Benson 1990, 55).\n\nIt is plausible that the oppression experienced by marginalized groups\ninterferes with their normative competence. The psychological harms of\noppression include false consciousness (the agent adopts as true the\nfalse ideology that oppresses her) and deformed desires (the\nagent’s desires depend on the belief in the false ideology)\n(Cudd 2006, 176, 182). At worst, agents in the grip of false\nconsciousness in a particular domain do not have the capacity relative\nto that domain to latch on to alternative, applicable, or\n“correct” standards and apply them to evaluate their\npreferences and desires. At best, they are faced with a contradictory\nset of norms:\n\nIf many of the prevailing norms which enter into what normative\ncompetence practically means for most women in the society are norms\nthat function to suppress or trivialize women’s contributions\nand experience, to deny women dignity as full participants in the life\nof the community, then free agency would seem to confront women as a\nself-destructive goal. (Benson 1990, 57)\n\n\nIn other words, attempting to exercise normative competence (that is,\nto promote autonomy) relative to the prevailing norms entails adopting\na set of norms that is oppressive to oneself. Benson suggests that, in\norder to promote autonomy, members of marginal groups will need to\ndevelop alternative norms through grassroots activities such as\nconsciousness-raising. \n\nBenson is careful to point out that a requirement of normative\ncompetence should not be conflated with a strong substantive\nconception of autonomy in which the theory places direct normative\nconstraints on the contents of the preferences of autonomous agents.\nEven on Wolf’s position, in which normative competence is the\nability to track objective moral norms, normative competence is\nnevertheless a capacity. It does not require that the content\nof agents’ preferences correspond to the content of the\napplicable norms. As Benson puts it, “normatively competent\npersons can choose what is unreasonable or wrong or value what is bad,\nbecause competence lies some distance short of perfect evaluative\nperception or responsiveness” (Benson 2005a, 133–4).\nHowever, there are controversial issues raised by normative competence\naccounts. The first is that of the status of the moral and other norms\nthat are employed to explicate normative competence. Wolf’s\nclaim that there are objective moral reasons that rational agents have\nthe capacity to track is controversial despite being a well-known and\nwidely supported position. Benson’s normative standpoints are\nnot derived from objective moral reasons but rather are\nintersubjective standpoints—those derived from “persons or\ninstitutions to which the agent is concretely connected”. The\nproblem here, as we have seen, is that such standpoints may be\noppressive to the group in which the agent is a member. Indeed, as a\nresult of internalized oppression, the agent may competently deploy\nthese standards to evaluate her own actions. It seems, for example,\nthat the eighteen-year-old student is competent to evaluate her\nactions using oppressive norms such as “beauty is a component of\nself-worth”. She is normatively competent with respect to the\nprevailing set of intersubjective norms (those of the oppressive\nideology). If the student is to be characterized as lacking autonomy,\nshe must be judged lacking in normative competence from some other\nnormative standpoint—but where does this other standpoint come\nfrom on Benson’s account? A final difficulty for normative\ncompetence accounts is the charge that they conflate autonomy with\nmoral responsibility. In the case of JoJo, for example, although it is\nplausible that the comprehensiveness of his socialization absolves him\nfrom full moral responsibility for his acts, it may be too quick to\nconclude that his acts are not the product of his own (autonomous)\nagency. The wish to maintain a conceptual distinction between\nresponsibility and autonomy has led Benson to revise his early\nnormative competence approach (Benson 1994, 665).\n6. Emotions and Self-regarding Attitudes\n\nThe accounts of autonomy surveyed so far offer necessary and\nsufficient conditions of autonomy that are, broadly speaking,\nrationalistic. On Friedman’s procedural and content-neutral\napproach, an agent’s preference is autonomous if and only if\ncertain processes of critical reflection have been followed. On\nMeyers’s competency account, an agent is autonomous when the\nauthentic self emerges as a result of the exercise of the cognitive\nskills of self-discovery, self-definition, and self-direction. On\nBenson’s normative competence account, an agent must have the\nintellectual capacity to discern applicable norms in order to count as\nautonomous. Although these accounts are nuanced and recognize the role\nof emotion in critical reflection, none explicitly treat emotions as\nnecessary conditions of autonomy.\n\nThis section sketches a family of approaches that argue that the\nreasoning processes and the intellectual competencies described above\nare not sufficient for autonomy (even assuming that they are\nnecessary) (Govier 1993; Benson 1994). These approaches propose that\ncertain emotional states and attitudes to oneself are further\nnecessary conditions; autonomy is undermined when these emotional\nstates are damaged. There is a close connection between the\nundermining of such states and oppression. The indirect effects of\noppression include the harms of shame and loss of self-esteem (Cudd\n2006, 176–8; compare Benson 1994, 657–9), which in turn\ncan lead to self-doubt, and the loss of self-confidence and\nself-trust.\n\nBoth Trudy Govier (1993) and Carolyn McLeod (2002) argue that\nself-trust is a necessary condition of autonomy. Govier claims that\n“[p]rocedural autonomy has as its necessary condition a reliance\non one’s own critical reflection and judgment, and that reliance\nis possible only if one has, and can maintain against criticism, a\nsense of one’s own basic competence and worth” (1993,\n103–4). Govier proposes that other self-regarding attitudes,\nsuch as self-respect and self-esteem, are integral components of\nself-trust. She looks at the experiences of rape and incest victims to\nillustrate the ways in which self-trust can be eroded. Women who are\nthe victims of rape or incest “tended to blame themselves,\nde-value themselves, and to have a diminished sense of their own\ncompetence and judgment after the sexual assaults…”\n(Govier 1993, 101). Govier concludes that lack of self-trust and a\ndiminished sense of one’s own competence undermine the\nreflection required for autonomy.\n\nCarolyn McLeod focuses on medical contexts to elaborate how self-trust\nis necessary for autonomy. Consider Anna, who suffered a miscarriage\nat six weeks gestation and afterwards felt considerable emotional\nturmoil (McLeod 2002, 53). McLeod analyzes Anna’s sense of\nincompetence to articulate her emotions as in part a result of\nothers’ lack of sympathy for her grief and corresponding failure\nto reinforce her feelings: “[O]ften women and their partners are\npressured not to grieve after miscarriage because people tend not to\nview the fetus’s death as an event that warrants grief”\n(McLeod 2002, 53). Comments such as “it was a blessing in\ndisguise” or “it could have been worse; you could have\nlost a baby” fail to “give uptake to [women’s]\nfeelings” (McLeod 2002, 55). The attitudes of others affect\nagents’ sense of competence, self-worth, and self-trust. When\nthese self-regarding attitudes are diminished, so is an agent’s\nautonomy.\n\nFor McLeod, self-trust is an “attitude of optimism about our own\ncompetence and moral integrity” (McLeod 2002, 6). McLeod’s\naccount differs from Govier’s in that her conception of\nself-trust is explicitly moral: in “acting\nautonomously, we strive to meet moral responsibilities to the\nself” (McLeod 2002, 122). Being autonomous requires treating\noneself well in a moral sense (McLeod 2002, pp. 121–126). Thus\nalthough Govier’s notion of self-trust seems to be compatible\nwith value-neutral procedural accounts of autonomy, McLeod’s is\nnot. Rather, McLeod’s account is “‘weakly\nsubstantive” because she claims that certain moral attitudes to\noneself—for example, attitudes affirming one’s own moral\nworth—are necessary to acting autonomously. Moreover, on\nMcLeod’s account, the self-trust necessary for autonomy is\n(epistemically) “justified self-trust”: for instance,\nself-trust or self-distrust is not justified if agents overestimate or\nunderestimate their competence in certain contexts (McLeod 2002, 104).\nHence, for McLeod, there are epistemic as well as moral constraints on\nautonomy.\n\nMcLeod’s examples illustrate the ways in which interpersonal\nconditions affect agents’ abilities for self-trust and hence\ntheir autonomy. Benson (1994) develops a similar line of thought. He\ndescribes a case of a woman with a certain personality type (Benson\n1994, 555–7): she is excitable, imaginative, and passionate, and\nis “prone to emotional outbursts in public” (Benson 1994,\n556). The woman’s husband, whom the woman trusts, is a\nphysician, and his response is to “medicalize” his\nwife’s personality type as psychologically unstable and\n“hysterical”. The husband treats his wife as if she were\ncrazy. As Benson describes it, the woman’s response is\nhelplessness and disorientation leading to lost self-worth. The\nhusband’s and the establishment’s attitude to the woman\nradically affect her self-conception; it becomes destabilized and her\nself-confidence is eroded. Moreover, the woman does not resist the\nprocess through which she loses her self-worth because “she\narrives at her sense of incompetence and estrangement…on the\nbasis of reasons that are valued by a scientific establishment which\nis socially validated and which she trusts” (Benson 1994, 657).\nBenson argues that although the woman’s critical reasoning\nfaculties are intact, she nevertheless lacks autonomy because of a\ndiminished sense of self-worth.\n\nGovier, McLeod, and Benson introduce new tools for thinking about the\nhard cases described in §2. Agents in oppressive circumstances\nmay have excellent skills of critical reflection, yet in these\ncircumstances they are subject to others’ attitudes according to\nwhich they are suited only for subservient roles, that they are of\ninferior worth, that they are not capable of being full participants\nin society or in a decision-making process, and so forth. These\nattitudes have the effect of eroding their self-trust,\nself-confidence, and sense of self-worth. For example, although the\nreasoning skills of the Deferential Wife may be intact—she may\nhave reflected on her wish to always cater to her husband, and\nendorsed it—she may nevertheless have a diminished sense of\nself-worth as a result of the subtle effects of gender oppression. If\nshe does not treat herself as worthy of being the “author of her\nown conduct”, she will lack autonomy (Benson 1994, 659).\n\nGovier’s position is causally relational: interpersonal\nconditions affect the emotions, which in turn affect the capacities\nfor critical reflection required for autonomy. However, McLeod’s\nand Benson’s positions are constitutively relational because the\nself-regarding attitudes necessary for autonomy are themselves\nunderstood as constitutively relational. We saw that McLeod adopts a\nmoral notion of justified self-trust as necessary for\nautonomy, which makes hers a weak substantive position. Her position\nis also constitutively relational because agents can be wrong to trust\nthemselves, for example, when they overestimate their own competence.\nHence features of the world—facts about the agent’s\ncompetence—are necessary for justified self-trust that in turn\nis necessary for autonomy. Benson claims that although what is\nrequired for a sense of self-worth will be different in different\nagents, nevertheless there is a common feature: “the sense of\nworthiness to act that is necessary for free agency involves regarding\noneself as being competent to answer for one’s conduct in the\nlight of normative demands that, from one’s point of view,\nothers might appropriately apply to one’s actions” (Benson\n1994, 660). The definition of self-worth required for autonomy on\nBenson’s analysis employs interpersonal relations and hence his\naccount is constitutively relational.\n7. Dialogical Conceptions\n\nA discussion of self-regarding attitudes raises the question of the\ninterrelation between self-interpretation and interpretation of the\nself by others. Charles Taylor comments on the dialogical nature of\nthe social self. Taylor writes that “we define our identity\nalways in dialogue with, sometimes in struggle against, the things our\nsignificant others want to see in us” (Taylor 1994, 28; compare\nOshana 2005, 78). In the same vein, several authors pursue\n“dialogical” conceptions of autonomy in which an\nagent’s answerability to others is the key condition.\nAs we saw above, Benson explicates the notion of self-worth as in part\na requirement of “regarding oneself as being competent to answer\nfor one’s conduct” (Benson 1994, 660). He develops this\nidea in recent work to argue that autonomous agents are those who\ntreat themselves as answerable for their conduct, who claim the\nauthority to speak for themselves (Benson 2005b, 111 ff.) Catriona\nMackenzie also proposes an account based on agents’\nanswerability to others. For Mackenzie, being self-governing is to\nhave “normative authority” over one’s decisions,\nwhich means that an agent must “regard herself as the legitimate\nsource of the authority, as able, and authorized, to speak for\nherself…[S]uch attitudes towards oneself can only be sustained\nin relations of intersubjective recognition” (Mackenzie 2008,\n4).\n\nAndrea Westlund has developed a dialogical approach in some detail\n(Westlund 2003; 2009; 2012; 2018). For Westlund, autonomy is neither a\nstructural nor a historical capacity of critical reflection, but\nrather a disposition of an agent to “hold herself answerable,\nfor her action-guiding commitments, to external critical\nperspectives” (Westlund 2009, 35). Westlund notes that\n“Autonomous agents will, in one way or another, manifest\nresponsiveness to justificatory challenges and their disposition to do\nso is partly constitutive of their status as self-governing”\n(Westlund 2009, 40). Excessively deferential agents such as the\nDeferential Wife will almost certainly fail to have this disposition.\nThese agents will not treat themselves as authoritative and\nanswerable for their conduct; rather, the way in which they answer for\nthemselves (if they do so at all) will be governed by the reasons of\nthe agents to whom they defer. Westlund argues, however, that it\nshould not be assumed that the women described in the hard cases above\nare “psychologically similar to each other” (Westlund\n2009, 29). For example, Westlund wants to allow that agents who adopt\noppressive practices that significantly inhibit their equality may do\nso autonomously and believes that if a “fundamentalist woman\ndoes freely and authentically accept a condition of social and\npersonal subordination, it seems…problematic to assume that her\ncondition as subordinate, in and of itself, undermines her status as a\nself-governing agent” (Westlund 2009, 29). Westlund\ndistinguishes between two (hypothetical) fundamentalist women, both of\nwhom accept their condition of subordination but only one of whom\n“is prepared to take up and respond to the critical perspectives\nof others, even if she is unconvinced by their arguments”\n(Westlund 2009, 29). The latter exhibits dialogical autonomy whereas\nthe former does not. (For a critical discussion of Westlund’s\naccount, see Stoljar 2018.) \n\nLike accounts that employ self-regarding attitudes, dialogical\naccounts can be either content-neutral or substantive. Westlund\ncharacterizes her own view as “formal” (i.e.,\ncontent-neutral) because it does not require an agent to endorse or\nreject any specific justificatory practice. Benson’s position,\nhowever, is weakly substantive for the reason that a condition of\nanswerability on his view is that the agent treats herself as\n“properly…fit and worthy to possess such\nauthority” (Benson 2005b, 117). Indeed, he is skeptical that\nWestlund’s account can maintain its neutrality and contends that\n“[t]o hold oneself answerable, in any concrete situation, is\nto…to be disposed to apply in that situation some normative\nexpectation to oneself” (Benson 2011). However, the different\nproponents of dialogical accounts are in agreement that their position\nis constitutively relational. Westlund explains that the\nautonomy disposition requires “positioning oneself as always a\npotential member of a reflective or deliberative dyad” so that\nthe psychological perspective of the autonomous agent “[points]\nbeyond itself, to the position the agent occupies as one reflective,\nresponsible self among many” (Westlund 2009, 35). The idea of\nanswerability employs interpersonal relations in the definition of\nautonomy and hence is constitutively relational.\n\nDialogical accounts potentially suffer from the objection that they\nare too weak to capture agents whose autonomy appears to be\ncompromised by oppressive socialization or circumstances. Suppose an\nagent acquiesces in and endorses a set of circumstances or an ideology\nthat is oppressive to her. As Westlund’s account explicitly\nacknowledges, she may nevertheless have the capacity for\nanswerability. In Benson’s terms, she may “regard herself\nas being competent to answer for her conduct in the light of normative\ndemands that, from her point of view, others might appropriately apply\nto her actions”. Consider the eighteen-year-old student who is\nconcerned to uphold dominant beauty standards. In one sense, she may\nlack a sense of self-worth; but on Benson’s notion of the\nself-worth required for free agency, she may exhibit self-worth\nbecause, with respect to the norms she believes to be applicable to\nher, she may regard herself as competent to answer for her actions in\nterms of those norms. She may be engaged in an attempt to enhance her\nsense of self-worth through beauty treatments precisely because she\nbelieves that it is appropriate that the norms of the fashion industry\napply to her (Stoljar 2000, 108). Indeed, when an agent has acquiesced\nin and embraced a set of oppressive norms, she will often have the\nself-confidence required to articulate her commitment to these norms\nto others. Hence, agents who have adopted oppressive practices will\noften be autonomous on dialogical accounts.\n8. Strong Substantive and Social-relational Conceptions\n\nA strong substantive theory of autonomy was defined earlier as one in\nwhich “the contents of the preferences or values that agents can\nform or act on autonomously are subject to direct normative\nconstraints” (Benson 2005a, 133). On strong substantive\napproaches, certain preferences and values are deemed to be\nincompatible with autonomy, not because of how they are formed, but\nrather because of their content. For example, choosing slavery or\nsubservience would not be autonomous on a strong substantive approach\nbecause the contents of the choices would violate the normative\nconstraints introduced by the theory. The conceptions of autonomy that\nemploy normative competence (§5), self-regarding\nattitudes (§6) and dialogical features (§7)\nshould be distinguished from those in the strong substantive category.\nThese conceptions may “incorporate normative substance” in\ndifferent ways and hence may be weakly substantive (Benson 2005a,\n133). However, none of these approaches invoke direct normative\nconstraints on the content of agents’ preferences as necessary\nconditions of autonomy.\n\nStrong substantive accounts come in various forms. One account\ncharacterizes autonomy as a moral notion: choices with criticizable\nmoral contents are deemed nonautonomous. For example, Thomas\nHill characterizes the failure of autonomy in the case of the\nDeferential Wife as a moral failure of self-respect, a failure to\ntreat oneself as a moral equal (Hill 1991, 15). Agents who choose\nsubservience are nonautonomous because they make a special kind of\nmoral mistake (see also Superson 2005). An alternative proposal says\nthat agents cannot manifest autonomy in a “thick” sense\nunless their choices are consistent with what is objectively in their\ninterests. The Deferential Wife is making a mistake because it is in\nher interests to choose a life of autonomy, rather than a life of\nsubservience. Susan Babbitt notes that “the effects of\noppression may be such that people are psychologically damaged,\npossessing interests and desires that reflect their subservient\nstatus” (Babbitt 1993, 246). She argues that even if the\nDeferential Wife were a Rawlsian ideal reasoner, making choices under\nideal epistemic conditions—those of “adequate instrumental\nreasoning abilities, full and complete information and the capacity to\nvividly imagine the consequences of her actions” (Babbitt 1993,\n247)—she still would not choose autonomy over deference. Rather,\n“it is part of her social and historical identity to be inferior\nto men” (Babbitt 1993, 250), and hence she would have to undergo\na conversion in her sense of self, so that “habitual servility\nis not what defines it”, to be able to makes the choice that is\nin her objective interest.\n\nStrong substantive accounts are constitutively relational because they\nclaim that preferences are autonomous if and only if their contents\ncorrespond to morally permissible or correct features of the world. A\nrelated constitutively relational conception is exemplified in Marina\nOshana’s “social-relational” approach in which the\npresence of certain external conditions is necessary for autonomy\n(Oshana 2006). Up until now the theories of autonomy surveyed have\ntreated autonomy as a psychological feature of agents. Procedural\ntheories and Meyers’s competency approach employ psychological\nprocesses of critical reflection. Similarly, normative competence\ntheories rely on an agent’s psychological capacity to discern\nsubstantive norms. Dialogical approaches invoke agents’\npsychological states, such as the sense of one’s own\nanswerability, although they analyze these states as related to\nexternal interpersonal conditions. Strong substantive accounts require\nthat agents’ psychologies hook onto the world in the right ways.\nOn all these positions, in principle, autonomy “can be\nachieved” by the agent as long as her psychology changes in the\nright way or is aligned in the right way with features of the world.\n(Compare Meyers’s distinction between autonomy as\n“something a person accomplishes” and autonomy as\n“something that happens to a person”: Meyers 1987,\n626).\n\nOshana’s social-relational view proposes that autonomy can be\nundermined by conditions in the world that do not necessarily affect\nthe agent’s psychology. Autonomy (or lack of it) is\n“something that happens” to the agent. Other theorists\nalso invoke external conditions. For instance, Joseph Raz argues that\na woman living on a desert island who is hounded by a wild animal is\nnot capable of autonomy because her options in this situation are so\nseverely curtailed (Raz 1988, 374). And Susan Brison claims that\n“if one has an inadequate range of significant options to choose\nfrom, one’s autonomy is diminished and the extent to which\nsignificant options are available to someone depends on the kind of\nsociety she lives in” (Brison 2000, 285).\n\nOshana’s social-relational analysis is explicit that agents who\nare reflective and psychologically competent can have their autonomy\nundermined by finding themselves in—or deliberately\nadopting—a situation in which their “practical\ncontrol” is removed: “We correctly attribute autonomy to a\nperson when the person has de facto power and authority to direct\naffairs of elemental importance to her life within a framework of\nrules (or values, principles, beliefs, pro-attitudes) that she has set\nfor herself” (Oshana 2007, p. 411). For Oshana, no matter the\ndegree of subjective self-realization or subjective endorsement of\ntheir situation, agents living under conditions of severe social\nconstraint have limited autonomy. Consider, for example, serfs living\nunder the protection of the lord of the manor in feudal times. On the\nsocial-relational conception, serfs would be considered lacking in\nautonomy due to a social structure in which the “general and\nroutine” aspects of a serf’s life are not under his or her\nown control but rather under that of the lord of the manor. To the\nextent that agents today live under parallel social conditions, they\nlack or have significantly diminished autonomy. Oshana writes of the\nDeferential Wife that “she fails to be autonomous—not\nbecause she wants to be subservient, but because she is subservient.\nHer lack of autonomy is due to her personal relations with others and\nto the social institutions of her society” (Oshana 2006, 62).\nSimilarly, Oshana’s example “Taliban Woman” is not\nautonomous because external circumstances deny her practical\ncontrol:\n\nShe is not permitted to support herself financially. She does not have\nlegal custody of her children—that remains in the hands of their\nfather and in his male relatives should he die. She has no voice in\nthe manner and duration of any schooling that her children,\nparticularly her daughters, may receive. She must remain costumed in\ncumbersome garb—a burqa—when in public. She cannot travel\nunless accompanied by a male relative…and can travel only when\ngranted permission by a male relative or religious elder. She knows\nthat any transgression, any show of independence counts as heretical\ndefiance and invites punishment both swift and harsh. (Oshana 2006,\n60)\n\n\nAccording to Oshana, the external conditions to which this woman is\nsubjected render her passive and her “life-plan remains in force\n[only] because of the will of another” (Oshana 2006, 62). Even\nif the woman endorses the situation she is in, she lacks de\nfacto control over routine aspects of daily life and hence cannot\nbe autonomous.\n\nOshana’s conception of autonomy should be distinguished from the\nstrong substantive views identified above: on her approach, the\ncontents of preferences and conceptions of the good are irrelevant to\nautonomy. Agents may have autonomy-promoting conceptions of the good,\nyet may fail to be autonomous because constraining external conditions\nrule it out. Moreover, the converse case is also true. Consider a\nnewly liberated prisoner who we will suppose satisfies the rational\ncompetency conditions that are also necessary for autonomy on\nOshana’s account (Oshana 2007, p. 419). For Oshana, once the\nprisoner is released into autonomy-compatible external conditions, he\nis autonomous despite the content of his desires. The prisoner may\nprefer to return to prison, yet this preference will not nullify his\nautonomy. Although an agent may desire to be directed by the will of\nanother, it is only if she is actually in the external\nconditions in which she is so directed that her autonomy is impeded.\nThus, Oshana’s conception is in a sense content-neutral.\n\nThere is an additional sense in which the social-relational conception\ndiffers from other conceptions of autonomy: it is “global”\nnot “local”. Oshana’s theory provides an analysis of\nthe condition of the autonomous agent rather than the conditions under\nwhich an agent’s particular desires and preferences at\nparticular times count as autonomous. This means that agents\n—for example, those living under conditions of slavery—\ncould lack global autonomy but nevertheless have local autonomy with\nrespect to particular preferences and desires. A question arises then\nabout the relationship between local and global autonomy.\n\nStrong substantive and social-relational approaches are perhaps the\nmost controversial of those surveyed and have as a result attracted\ntrenchant critiques. The first is conceptual. It has been suggested\nthat strong substantive theories conflate autonomy (defined as\nself-rule) with morally right-rule (Benson 2005a,\n132). In other words, on these accounts, agents are autonomous\nonly if they make morally correct choices or choices that\ncoincide with their objective interests. But, it is argued, being\nautonomous is not conceptually identical to being moral, or to always\nacting in ways that promote an agent’s interests. Second, it has\nbeen suggested that social-relational views are objectionable because\nthey permit paternalism or are implicitly committed to perfectionism\n(Holroyd 2009; Christman 2004; cf. Mackenzie 2008; Stoljar 2017). For\nexample, Christman argues that Oshana’s position is implicitly\ncommitted to an egalitarian ideal; he claims that on her account, no\nother political arrangement is consistent with personal autonomy\n(Christman 2004; Christman 2009). Third, it has been alleged that\nthese accounts are too quick to treat oppression as always impeding\nautonomy. For instance, Meyers claims that certain agents are\n“firebrand, adventure-loving resisters”, who thrive and\nflourish when they have the opportunity to oppose social norms (Meyers\n2000a, 479). If this is so, autonomy would be possible even in the\ncircumstances of the extremely constraining regime described by\nOshana. Catriona Mackenzie has recently argued that autonomy is a\nmulti-dimensional concept, and that the different conceptions of\nautonomy surveyed here correspond to different dimensions of the\nconcept, namely self-determination, self-governance,\nand self-authorization (Mackenzie 2014; Mackenzie 2015).\nOshana’s social-relational approach provides an account of\nself-determination because it identifies the external\n“opportunities necessary to make and enact decisions of\npractical import to one’s life” (Mackenzie 2015, 55). The\nprocedural approaches of Meyers and Friedman fall under the dimension\nof self-governance because of their focus on the “skills and\ncapacities necessary to make and enact decisions and to live one’s\nlife” (Mackenzie 2015, 55). And dialogical theories of autonomy\nthat employ answerability correspond to the dimension of\nself-authorization, which “involves regarding oneself as having\nthe normative authority to be self-determining and\nself-governing” (Mackenzie 2015, 55). Mackenzie’s\nmulti-dimensional approach illuminates the different concerns of\nrelational autonomy theorists, but raises further questions. How do\nthe three dimensions of autonomy intersect? Are any or all of the\ndifferent dimensions necessary or sufficient conditions of autonomy?\nIs it possible for an agent to be fully autonomous is she satisfies\nonly one dimension of autonomy?\n\n9. Conclusion\n\nFeminist theories of autonomy analyze the effects of internalized\noppression and the circumstances of oppression on agents’ global\nand local autonomy. There is no consensus as to which theoretical\nposition is correct. To some extent, the answer depends on intuitions\nabout which view best captures the notion of agency that is\none’s own. There is considerable consensus, however,\nthat oppressive socialization and oppressive practices diminish\nautonomy and perhaps undermine it altogether. The relational\nconceptions of autonomy surveyed here are important contributions to\ntheoretical debates on the nature of autonomy as well as to our\nunderstanding of how oppression interferes with the psychological\nstates and social conditions required for autonomy.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Anderson, J. and J. Christman (eds.), 2005, <em>Autonomy and the\nChallenges of Liberalism: New Essays</em>, Cambridge: Cambridge\nUniversity Press.",
                "Babbitt, S. E., 1993, “Feminism and Objective Interests: The\nRole of Transformation Experiences in Rational Deliberation,” in\nL. Alcoff and E. Potter (eds.), <em>Feminist Epistemologies</em>, New\nYork: Routledge pp. 245–264.",
                "Baber, H. E., 2017, “Is Utilitarianism Bad for\nWomen?,” <em>Feminist Philosophy Quarterly</em>, 3 (4)\n [<a href=\"https://ojs.lib.uwo.ca/index.php/fpq/article/view/3113/2378\" target=\"other\">Available online</a>].",
                "Baier, A., 1985, <em>Postures of the Mind. Essays on Mind and\nMorals</em>, Minneapolis: University of Minnesota Press.",
                "Benson, P., 1987, “Freedom and Value,” <em>Journal of\nPhilosophy</em>, 84: 465–486.",
                "–––, 1990, “Feminist Second Thoughts About\nFree Agency,” <em>Hypatia</em>, 3: 47–64.",
                "–––, 1991, “Autonomy and Oppressive\nSocialization,” <em>Social Theory and Practice</em>, 17:\n385–408.",
                "–––, 1994, “Free Agency and\nSelf-Worth,” <em>Journal of Philosophy</em>, 91:\n650–668.",
                "–––, 2005a, “Feminist Intuitions and the\nNormative Substance of Autonomy,” in Taylor 2005a, pp.\n124–142.",
                "–––, 2005b, “Taking Ownership. Authority\nand Voice in Autonomous Agency,” in Anderson and Christman 2005,\npp. 101–126.",
                "–––, 2011, “Narrative Self-Understanding\nand Relational Autonomy. Comments on Catriona Mackenzie and Jacqui\nPoltera, ‘Narrative Integration, Fragmented Selves, and\nAutonomy’ and Andrea C. Westlund, ‘Rethinking Relational\nAutonomy,’” <em>Symposia on Gender, Race and\nPhilosophy</em>, 7 (1), pp. 1–5.",
                "Bierria, A., 2014, “Missing in Action: Violence, Power, and\nDiscerning Agency,” <em>Hypatia</em>, 29 (1):\n129–145.",
                "Brison, S. J., 2000, “Relational Autonomy and Freedom of\nExpression,” in Mackenzie and Stoljar 2000a, pp.\n280–300.",
                "Buss, S., 1994, “Autonomy Reconsidered,” in\n<em>Midwest Studies in Philosophy</em> XIX, P.A. French, T.A. Uehling\nand H.K. Wettstein (eds.), Minneapolis: University of Minnesota Press,\npp. 95–121.",
                "–––, 2005, “Valuing Autonomy and\nRespecting Persons: Manipulation, Seduction, and the Basis of Moral\nConstraints,” <em>Ethics</em> 11 (5): 195–135.",
                "Charles, S., 2010, “How Should Feminist Autonomy Theorists\nRespond to the Problem of Internalized Oppression?,” <em>Social\nTheory and Practice</em>, 36 (3): 409–428.",
                "Christman, J., 1990, “Autonomy and Personal History,”\n<em>Canadian Journal of Philosophy</em>, 20: 1–24.",
                "–––, 1991, “Liberalism and Individual\nPositive Freedom,” <em>Ethics</em>, 101: 343–359.",
                "–––, 2004, “Relational Autonomy, Liberal\nIndividualism, and the Social Constitution of Selves,”\n<em>Philosophical Studies</em>, 117: 143–164.",
                "–––, 2009, <em>The Politics of Persons.\nIndividual Autonomy and Socio-historical Selves</em>, Cambridge:\nCambridge University Press.",
                "Code, L., 1991, <em>What Can She Know?</em>, Ithaca, NY: Cornell\nUniversity Press.",
                "Colburn, B., 2011, “Autonomy and Adaptive\nPreferences,” <em>Utilitas</em>, 23: 52–71.",
                "Crenshaw, K. W., 1991, “Mapping the Margins.\nIntersectionality, Identity Politics and Violence Against Women of\nColor,” <em>Stanford Law Review</em>, 43: 1241–1299.",
                "Cudd, A., 2006, <em>Analyzing Oppression</em>, New York: Oxford\nUniversity Press.",
                "Dillon, R.S., 1992, “Toward a Feminist Conception of\nSelf-Respect,” <em>Hypatia</em>, 7: 52–69.",
                "Dworkin, G., 1988, <em>The Theory and Practice of Autonomy</em>,\nCambridge: Cambridge University Press.",
                "Elster, J., 1983, <em>Sour Grapes: Studies in the Subversion of\nRationality</em>, Cambridge: Cambridge: Cambridge University\nPress.",
                "Frankfurt, H., 1988, <em>The Importance of What We Care\nAbout</em>, New York: Cambridge University Press.",
                "Friedman, M., 1997, “Autonomy and Social Relationships:\nRethinking the Feminist Critique,” in D.T. Meyers (ed.),\n<em>Feminists Rethink the Self</em>, Boulder, CO: Westview, pp.\n40–61.",
                "–––, 2003, <em>Autonomy, Gender, Politics</em>,\nNew York: Oxford University Press.",
                "Govier, T., 1993, “Self-Trust, Autonomy, and\nSelf-Esteem,” <em>Hypatia</em>, 8: 99–120.",
                "Hill, T., 1991, <em>Autonomy and Self-Respect.</em> Cambridge:\nCambridge University Press.",
                "Holroyd, J., 2009, “Relational Autonomy and Paternalistic\nInterventions,” <em>Res Publica</em>, 15: 321–336.",
                "Jaggar, A., 1985, <em>Feminist Politics and Human Nature</em>,\nTotowa, NJ: Rowman and Allanheld.",
                "Johnston, R., 2017, “Personal Autonomy, Social Identity and\nOppressive Social Contexts,” <em>Hypatia</em>, 32 (2):\n312–328.",
                "Kant, I. 1785, <em>Groundwork of the Metaphysic of Morals</em>,\ntranslated and analyzed by H.J. Paton, New York: Harper &amp; Row,\n1948.",
                "Khader, S. J., 2009, “Adaptive Preferences and Procedural\nAutonomy,” <em>Journal of Human Development and\nCapabilities</em>, 10: 169–187.",
                "–––, 2011, <em>Adaptive Preferences and\nWomen’s Empowerment</em>, New York: Oxford University\nPress.",
                "Liebow, N., 2016, “Internalized Oppression and Its Varied\nMoral Harms: Self-Perceptions of Reduced Agency and\nCriminality,” <em>Hypatia</em>, 31 (4): 713–729.",
                "Mackenzie, C., 2000, “Imagining Oneself Otherwise,” in\nMackenzie and Stoljar 2000a, pp. 124–150.",
                "–––, 2001, “On Bodily Autonomy,” in\nS. K. Toombs (ed.), <em>Handbook of Phenomenology and Medicine</em>,\nDordrecht: Kluwer, pp. 417–440.",
                "–––, 2008, “Relational Autonomy, Normative\nAuthority and Perfectionism,” <em>Journal of Social\nPhilosophy</em>, 39: 512–533.",
                "–––, 2014, “Three Dimensions of Autonomy.\nA Relational Analysis,” in Veltman and Piper 2014, pp.\n15–42.",
                "–––, 2015, “Responding to the Agency\nDilemma: Autonomy, Adaptive Preferences, and Internalized\nOppression,” in Oshana 2015, pp. 48–67.",
                "Mackenzie, C. and N. Stoljar (eds.), 2000a, <em>Relational\nAutonomy Feminist Perspectives on Autonomy, Agency and the Social\nSelf</em>, New York: Oxford University Press.",
                "–––, 2000b, “Introduction: Refiguring\nAutonomy,” in Mackenzie and Stoljar 2000a, pp. 3–34.",
                "McLeod, C. and S. Sherwin, 2000, “Relational Autonomy,\nSelf-Trust and Health Care for Patients who are Oppressed,” in\nMackenzie and Stoljar 2000a, pp. 259–279.",
                "McLeod, C., 2002, <em>Self-Trust and Reproductive Autonomy</em>,\nCambridge, MA: MIT Press.",
                "Mele, A., 1995, <em>Autonomous Agents: From Self-Control to\nAutonomy</em>, New York: Oxford University Press.",
                "Meyers, D. T., 1987, “Personal Autonomy and the Paradox of\nFeminine Socialization,” <em>Journal of Philosophy</em>, 84:\n619–628.",
                "–––, 1989, <em>Self, Society and Personal\nChoice</em>, New York: Columbia University Press.",
                "–––, 2000a, “Feminism and Women’s\nAutonomy: The Challenge of Female Genital Cutting,”\n<em>Metaphilosophy</em>, 31: 469–491.",
                "–––, 2000b, “Intersectional Identity and\nthe Authentic Self. Opposites Attract!,” in Mackenzie and\nStoljar 2000a, pp. 151–180.",
                "–––, 2002, <em>Gender in the Mirror: Cultural\nImagery and Women’s Agency</em>, New York: Oxford University\nPress.",
                "–––, 2005, “Decentralizing Autonomy. Five\nFaces of Selfhood,” in Anderson and Christman, 2005, pp.\n27–55.",
                "Narayan, U., 2002, “Minds Of Their Own: Choices, Autonomy,\nCultural Practices and Other Women,” in L. Antony and C. Witt\n(eds.), <em>A Mind of One’s Own. Feminist Essays on Reason and\nObjectivity</em>, Boulder, CO: Westview, pp. 418–432.",
                "Nedelsky, J., 1989, “Reconceiving Autonomy: Sources,\nThoughts and Possibilities,” <em>Yale Journal of Law and\nFeminism</em>, 1: 7–36.",
                "Nussbaum, M., 2001, “Adaptive Preferences and Women’s\nOptions,” <em>Economics and Philosophy</em>, 17:\n67–88.",
                "Oshana, M., 2005, “Autonomy and Self-Identity,” in\nAnderson and Christman 2005, pp. 77–100.",
                "–––, 2006, <em>Personal Autonomy in\nSociety</em>, Aldershot: Ashgate Publishing.",
                "––– (ed.), 2015, <em>Personal Autonomy and\nSocial Oppression</em>, New York: Routledge.",
                "Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press; revised edition, 1999.",
                "Raz, J., 1988, <em>The Morality of Freedom</em>, Oxford: Oxford\nUniversity Press.",
                "Richardson, H., 2001, “Autonomy’s Many Normative\nPresuppositions,” <em>American Philosophical Quarterly</em>, 38:\n287–303.",
                "Sen, A., 1995, “Gender Inequality and Theories of\nJustice,” in M. Nussbaum and J. Glover (eds.), <em>Women,\nCulture, and Development: A Study of Human Capabilities</em>, Oxford:\nClarendon Press, pp. 259–273.",
                "Sperry, E., 2013, “Dupes of Patriarchy: Feminist Strong\nSubstantive Autonomy’s Epistemological Weaknesses,”\n<em>Hypatia</em>, 28 (4): 887–904.",
                "Stoljar, N., 2000, “Autonomy and the Feminist\nIntuition,” in Mackenzie and Stoljar 2000a, pp.\n94–111.",
                "–––, 2011, “Autonomy or Authenticity?\nCommentary on Andrea Westlund’s ‘Rethinking Relational\nAutonomy’ and Catriona Mackenzie and Jacqui Poltera’s\n‘Narrative Integration, Fragmented Selves and\nAutonomy,’” <em>Symposia on Gender, Race and\nPhilosophy</em>, 7 (1), 1–6.",
                "–––, 2014, “Autonomy and Adaptive\nPreference Formation,” in Veltman and Piper 2014, pp.\n227–252.",
                "–––, 2017, “Relational Autonomy and\nPerfectionism,” <em>Moral Philosophy and Politics</em>, 4 (1),\n27–41.",
                "–––, 2018, “Answerability. A Condition of\nAutonomy or Moral Responsibility (or Both)?,” in K. Hutchison,\nC. Mackenzie and M. Oshana (eds.), <em>Social Dimensions of Moral\nResponsibility</em>, Oxford: Oxford University Press, pp.\n231–252.",
                "Superson, A., 2005, “Deformed Desires and Informed Desire\nTests,” <em>Hypatia</em>, 20: 109–126.",
                "Taylor, J.S. (ed.), 2005a, <em>Personal Autonomy: New Essays on\nPersonal Autonomy and its Role in Contemporary Moral Philosophy</em>,\nCambridge: Cambridge University Press.",
                "–––, 2005b, “Introduction,” in\nTaylor 2005a, pp. 1–32.",
                "–––, 2009, <em>Practical Autonomy and\nBioethics</em>, New York: Routledge.",
                "Taylor, C., 1994, “The Politics of Recognition,” in A.\nGutmann (ed.), <em>Multiculturalism: Examining the Politics of\nRecognition</em>, Princeton: Princeton University Press, pp.\n25–74.",
                "Terlazzo, R., 2016, “Conceptualizing Adaptive Preferences\nRespectfully: An Indirectly Substantive Account,” <em>The\nJournal of Political Philosophy</em>, 24 (2): 206–226.",
                "Veltman, A. and M. Piper (eds.), 2014, <em>Autonomy, Oppression\nand Gender</em>, New York: Oxford University Press.",
                "Watson, G., 1996, “Two Faces of Responsibility,”\n<em>Philosophical Topics</em>, 24: 227–248.",
                "–––, 1975, “Free Agency,”\n<em>Journal of Philosophy</em>, 8: 205–220.",
                "Westlund, A., 2003, “Selflessness and Responsibility for\nSelf. Is Deference Compatible With Autonomy?,” <em>Philosophical\nReview</em>, 112: 37–77.",
                "–––, 2009, “Rethinking Relational\nAutonomy,” <em>Hypatia</em>, 24: 26–49.",
                "–––, 2012, “Autonomy in Relation,”\nin S. L. Crasnow and A. M. Superson (eds.), <em>Out from the Shadows.\nAnalytical Feminist Contributions to Traditional Philosophy</em>, New\nYork: Oxford University Press, pp. 59–81.",
                "–––, 2018, “Relational Autonomy and\nPractical Authority,” in P. Garavaso (ed.), <em>The Bloomsbury\nCompanion to Analytic Feminism</em>, London: Bloomsbury, pp.\n375–393.",
                "Wolf, S., 1987, “Sanity and the Metaphysics of\nResponsibility,” in F. Schoeman (ed.), <em>Responsibility,\nCharacter and the Emotions</em>, New York: Cambridge University Press,\npp. 46–62.",
                "–––, 1990, <em>Freedom Within Reason</em>, New\nYork: Oxford University Press.",
                "Woolf, V., 1942, “Professions for Women,” in <em>Women\nand Writing</em>, edited and with an introduction by M. Barrett, New\nYork: Harcourt Brace Jovanovich, 1979, pp. 57–63."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Anderson, J. and J. Christman (eds.), 2005, <em>Autonomy and the\nChallenges of Liberalism: New Essays</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Babbitt, S. E., 1993, “Feminism and Objective Interests: The\nRole of Transformation Experiences in Rational Deliberation,” in\nL. Alcoff and E. Potter (eds.), <em>Feminist Epistemologies</em>, New\nYork: Routledge pp. 245–264.</li>\n<li>Baber, H. E., 2017, “Is Utilitarianism Bad for\nWomen?,” <em>Feminist Philosophy Quarterly</em>, 3 (4)\n [<a href=\"https://ojs.lib.uwo.ca/index.php/fpq/article/view/3113/2378\" target=\"other\">Available online</a>].</li>\n<li>Baier, A., 1985, <em>Postures of the Mind. Essays on Mind and\nMorals</em>, Minneapolis: University of Minnesota Press.</li>\n<li>Benson, P., 1987, “Freedom and Value,” <em>Journal of\nPhilosophy</em>, 84: 465–486.</li>\n<li>–––, 1990, “Feminist Second Thoughts About\nFree Agency,” <em>Hypatia</em>, 3: 47–64.</li>\n<li>–––, 1991, “Autonomy and Oppressive\nSocialization,” <em>Social Theory and Practice</em>, 17:\n385–408.</li>\n<li>–––, 1994, “Free Agency and\nSelf-Worth,” <em>Journal of Philosophy</em>, 91:\n650–668.</li>\n<li>–––, 2005a, “Feminist Intuitions and the\nNormative Substance of Autonomy,” in Taylor 2005a, pp.\n124–142.</li>\n<li>–––, 2005b, “Taking Ownership. Authority\nand Voice in Autonomous Agency,” in Anderson and Christman 2005,\npp. 101–126.</li>\n<li>–––, 2011, “Narrative Self-Understanding\nand Relational Autonomy. Comments on Catriona Mackenzie and Jacqui\nPoltera, ‘Narrative Integration, Fragmented Selves, and\nAutonomy’ and Andrea C. Westlund, ‘Rethinking Relational\nAutonomy,’” <em>Symposia on Gender, Race and\nPhilosophy</em>, 7 (1), pp. 1–5.</li>\n<li>Bierria, A., 2014, “Missing in Action: Violence, Power, and\nDiscerning Agency,” <em>Hypatia</em>, 29 (1):\n129–145.</li>\n<li>Brison, S. J., 2000, “Relational Autonomy and Freedom of\nExpression,” in Mackenzie and Stoljar 2000a, pp.\n280–300.</li>\n<li>Buss, S., 1994, “Autonomy Reconsidered,” in\n<em>Midwest Studies in Philosophy</em> XIX, P.A. French, T.A. Uehling\nand H.K. Wettstein (eds.), Minneapolis: University of Minnesota Press,\npp. 95–121.</li>\n<li>–––, 2005, “Valuing Autonomy and\nRespecting Persons: Manipulation, Seduction, and the Basis of Moral\nConstraints,” <em>Ethics</em> 11 (5): 195–135.</li>\n<li>Charles, S., 2010, “How Should Feminist Autonomy Theorists\nRespond to the Problem of Internalized Oppression?,” <em>Social\nTheory and Practice</em>, 36 (3): 409–428.</li>\n<li>Christman, J., 1990, “Autonomy and Personal History,”\n<em>Canadian Journal of Philosophy</em>, 20: 1–24.</li>\n<li>–––, 1991, “Liberalism and Individual\nPositive Freedom,” <em>Ethics</em>, 101: 343–359.</li>\n<li>–––, 2004, “Relational Autonomy, Liberal\nIndividualism, and the Social Constitution of Selves,”\n<em>Philosophical Studies</em>, 117: 143–164.</li>\n<li>–––, 2009, <em>The Politics of Persons.\nIndividual Autonomy and Socio-historical Selves</em>, Cambridge:\nCambridge University Press.</li>\n<li>Code, L., 1991, <em>What Can She Know?</em>, Ithaca, NY: Cornell\nUniversity Press.</li>\n<li>Colburn, B., 2011, “Autonomy and Adaptive\nPreferences,” <em>Utilitas</em>, 23: 52–71.</li>\n<li>Crenshaw, K. W., 1991, “Mapping the Margins.\nIntersectionality, Identity Politics and Violence Against Women of\nColor,” <em>Stanford Law Review</em>, 43: 1241–1299.</li>\n<li>Cudd, A., 2006, <em>Analyzing Oppression</em>, New York: Oxford\nUniversity Press.</li>\n<li>Dillon, R.S., 1992, “Toward a Feminist Conception of\nSelf-Respect,” <em>Hypatia</em>, 7: 52–69.</li>\n<li>Dworkin, G., 1988, <em>The Theory and Practice of Autonomy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Elster, J., 1983, <em>Sour Grapes: Studies in the Subversion of\nRationality</em>, Cambridge: Cambridge: Cambridge University\nPress.</li>\n<li>Frankfurt, H., 1988, <em>The Importance of What We Care\nAbout</em>, New York: Cambridge University Press.</li>\n<li>Friedman, M., 1997, “Autonomy and Social Relationships:\nRethinking the Feminist Critique,” in D.T. Meyers (ed.),\n<em>Feminists Rethink the Self</em>, Boulder, CO: Westview, pp.\n40–61.</li>\n<li>–––, 2003, <em>Autonomy, Gender, Politics</em>,\nNew York: Oxford University Press.</li>\n<li>Govier, T., 1993, “Self-Trust, Autonomy, and\nSelf-Esteem,” <em>Hypatia</em>, 8: 99–120.</li>\n<li>Hill, T., 1991, <em>Autonomy and Self-Respect.</em> Cambridge:\nCambridge University Press.</li>\n<li>Holroyd, J., 2009, “Relational Autonomy and Paternalistic\nInterventions,” <em>Res Publica</em>, 15: 321–336.</li>\n<li>Jaggar, A., 1985, <em>Feminist Politics and Human Nature</em>,\nTotowa, NJ: Rowman and Allanheld.</li>\n<li>Johnston, R., 2017, “Personal Autonomy, Social Identity and\nOppressive Social Contexts,” <em>Hypatia</em>, 32 (2):\n312–328.</li>\n<li>Kant, I. 1785, <em>Groundwork of the Metaphysic of Morals</em>,\ntranslated and analyzed by H.J. Paton, New York: Harper &amp; Row,\n1948.</li>\n<li>Khader, S. J., 2009, “Adaptive Preferences and Procedural\nAutonomy,” <em>Journal of Human Development and\nCapabilities</em>, 10: 169–187.</li>\n<li>–––, 2011, <em>Adaptive Preferences and\nWomen’s Empowerment</em>, New York: Oxford University\nPress.</li>\n<li>Liebow, N., 2016, “Internalized Oppression and Its Varied\nMoral Harms: Self-Perceptions of Reduced Agency and\nCriminality,” <em>Hypatia</em>, 31 (4): 713–729.</li>\n<li>Mackenzie, C., 2000, “Imagining Oneself Otherwise,” in\nMackenzie and Stoljar 2000a, pp. 124–150.</li>\n<li>–––, 2001, “On Bodily Autonomy,” in\nS. K. Toombs (ed.), <em>Handbook of Phenomenology and Medicine</em>,\nDordrecht: Kluwer, pp. 417–440.</li>\n<li>–––, 2008, “Relational Autonomy, Normative\nAuthority and Perfectionism,” <em>Journal of Social\nPhilosophy</em>, 39: 512–533.</li>\n<li>–––, 2014, “Three Dimensions of Autonomy.\nA Relational Analysis,” in Veltman and Piper 2014, pp.\n15–42.</li>\n<li>–––, 2015, “Responding to the Agency\nDilemma: Autonomy, Adaptive Preferences, and Internalized\nOppression,” in Oshana 2015, pp. 48–67.</li>\n<li>Mackenzie, C. and N. Stoljar (eds.), 2000a, <em>Relational\nAutonomy Feminist Perspectives on Autonomy, Agency and the Social\nSelf</em>, New York: Oxford University Press.</li>\n<li>–––, 2000b, “Introduction: Refiguring\nAutonomy,” in Mackenzie and Stoljar 2000a, pp. 3–34.</li>\n<li>McLeod, C. and S. Sherwin, 2000, “Relational Autonomy,\nSelf-Trust and Health Care for Patients who are Oppressed,” in\nMackenzie and Stoljar 2000a, pp. 259–279.</li>\n<li>McLeod, C., 2002, <em>Self-Trust and Reproductive Autonomy</em>,\nCambridge, MA: MIT Press.</li>\n<li>Mele, A., 1995, <em>Autonomous Agents: From Self-Control to\nAutonomy</em>, New York: Oxford University Press.</li>\n<li>Meyers, D. T., 1987, “Personal Autonomy and the Paradox of\nFeminine Socialization,” <em>Journal of Philosophy</em>, 84:\n619–628.</li>\n<li>–––, 1989, <em>Self, Society and Personal\nChoice</em>, New York: Columbia University Press.</li>\n<li>–––, 2000a, “Feminism and Women’s\nAutonomy: The Challenge of Female Genital Cutting,”\n<em>Metaphilosophy</em>, 31: 469–491.</li>\n<li>–––, 2000b, “Intersectional Identity and\nthe Authentic Self. Opposites Attract!,” in Mackenzie and\nStoljar 2000a, pp. 151–180.</li>\n<li>–––, 2002, <em>Gender in the Mirror: Cultural\nImagery and Women’s Agency</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2005, “Decentralizing Autonomy. Five\nFaces of Selfhood,” in Anderson and Christman, 2005, pp.\n27–55.</li>\n<li>Narayan, U., 2002, “Minds Of Their Own: Choices, Autonomy,\nCultural Practices and Other Women,” in L. Antony and C. Witt\n(eds.), <em>A Mind of One’s Own. Feminist Essays on Reason and\nObjectivity</em>, Boulder, CO: Westview, pp. 418–432.</li>\n<li>Nedelsky, J., 1989, “Reconceiving Autonomy: Sources,\nThoughts and Possibilities,” <em>Yale Journal of Law and\nFeminism</em>, 1: 7–36.</li>\n<li>Nussbaum, M., 2001, “Adaptive Preferences and Women’s\nOptions,” <em>Economics and Philosophy</em>, 17:\n67–88.</li>\n<li>Oshana, M., 2005, “Autonomy and Self-Identity,” in\nAnderson and Christman 2005, pp. 77–100.</li>\n<li>–––, 2006, <em>Personal Autonomy in\nSociety</em>, Aldershot: Ashgate Publishing.</li>\n<li>––– (ed.), 2015, <em>Personal Autonomy and\nSocial Oppression</em>, New York: Routledge.</li>\n<li>Rawls, J., 1971, <em>A Theory of Justice</em>, Cambridge, MA:\nHarvard University Press; revised edition, 1999.</li>\n<li>Raz, J., 1988, <em>The Morality of Freedom</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Richardson, H., 2001, “Autonomy’s Many Normative\nPresuppositions,” <em>American Philosophical Quarterly</em>, 38:\n287–303.</li>\n<li>Sen, A., 1995, “Gender Inequality and Theories of\nJustice,” in M. Nussbaum and J. Glover (eds.), <em>Women,\nCulture, and Development: A Study of Human Capabilities</em>, Oxford:\nClarendon Press, pp. 259–273.</li>\n<li>Sperry, E., 2013, “Dupes of Patriarchy: Feminist Strong\nSubstantive Autonomy’s Epistemological Weaknesses,”\n<em>Hypatia</em>, 28 (4): 887–904.</li>\n<li>Stoljar, N., 2000, “Autonomy and the Feminist\nIntuition,” in Mackenzie and Stoljar 2000a, pp.\n94–111.</li>\n<li>–––, 2011, “Autonomy or Authenticity?\nCommentary on Andrea Westlund’s ‘Rethinking Relational\nAutonomy’ and Catriona Mackenzie and Jacqui Poltera’s\n‘Narrative Integration, Fragmented Selves and\nAutonomy,’” <em>Symposia on Gender, Race and\nPhilosophy</em>, 7 (1), 1–6.</li>\n<li>–––, 2014, “Autonomy and Adaptive\nPreference Formation,” in Veltman and Piper 2014, pp.\n227–252.</li>\n<li>–––, 2017, “Relational Autonomy and\nPerfectionism,” <em>Moral Philosophy and Politics</em>, 4 (1),\n27–41.</li>\n<li>–––, 2018, “Answerability. A Condition of\nAutonomy or Moral Responsibility (or Both)?,” in K. Hutchison,\nC. Mackenzie and M. Oshana (eds.), <em>Social Dimensions of Moral\nResponsibility</em>, Oxford: Oxford University Press, pp.\n231–252.</li>\n<li>Superson, A., 2005, “Deformed Desires and Informed Desire\nTests,” <em>Hypatia</em>, 20: 109–126.</li>\n<li>Taylor, J.S. (ed.), 2005a, <em>Personal Autonomy: New Essays on\nPersonal Autonomy and its Role in Contemporary Moral Philosophy</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2005b, “Introduction,” in\nTaylor 2005a, pp. 1–32.</li>\n<li>–––, 2009, <em>Practical Autonomy and\nBioethics</em>, New York: Routledge.</li>\n<li>Taylor, C., 1994, “The Politics of Recognition,” in A.\nGutmann (ed.), <em>Multiculturalism: Examining the Politics of\nRecognition</em>, Princeton: Princeton University Press, pp.\n25–74.</li>\n<li>Terlazzo, R., 2016, “Conceptualizing Adaptive Preferences\nRespectfully: An Indirectly Substantive Account,” <em>The\nJournal of Political Philosophy</em>, 24 (2): 206–226.</li>\n<li>Veltman, A. and M. Piper (eds.), 2014, <em>Autonomy, Oppression\nand Gender</em>, New York: Oxford University Press.</li>\n<li>Watson, G., 1996, “Two Faces of Responsibility,”\n<em>Philosophical Topics</em>, 24: 227–248.</li>\n<li>–––, 1975, “Free Agency,”\n<em>Journal of Philosophy</em>, 8: 205–220.</li>\n<li>Westlund, A., 2003, “Selflessness and Responsibility for\nSelf. Is Deference Compatible With Autonomy?,” <em>Philosophical\nReview</em>, 112: 37–77.</li>\n<li>–––, 2009, “Rethinking Relational\nAutonomy,” <em>Hypatia</em>, 24: 26–49.</li>\n<li>–––, 2012, “Autonomy in Relation,”\nin S. L. Crasnow and A. M. Superson (eds.), <em>Out from the Shadows.\nAnalytical Feminist Contributions to Traditional Philosophy</em>, New\nYork: Oxford University Press, pp. 59–81.</li>\n<li>–––, 2018, “Relational Autonomy and\nPractical Authority,” in P. Garavaso (ed.), <em>The Bloomsbury\nCompanion to Analytic Feminism</em>, London: Bloomsbury, pp.\n375–393.</li>\n<li>Wolf, S., 1987, “Sanity and the Metaphysics of\nResponsibility,” in F. Schoeman (ed.), <em>Responsibility,\nCharacter and the Emotions</em>, New York: Cambridge University Press,\npp. 46–62.</li>\n<li>–––, 1990, <em>Freedom Within Reason</em>, New\nYork: Oxford University Press.</li>\n<li>Woolf, V., 1942, “Professions for Women,” in <em>Women\nand Writing</em>, edited and with an introduction by M. Barrett, New\nYork: Harcourt Brace Jovanovich, 1979, pp. 57–63.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "agency",
            "autonomy: in moral and political philosophy",
            "autonomy: personal",
            "feminist philosophy, interventions: moral psychology",
            "feminist philosophy, topics: perspectives on the self",
            "Kant, Immanuel: account of reason",
            "original position",
            "Rawls, John"
        ],
        "entry_link": [
            {
                "../agency/": "agency"
            },
            {
                "../autonomy-moral/": "autonomy: in moral and political philosophy"
            },
            {
                "../personal-autonomy/": "autonomy: personal"
            },
            {
                "../feminism-moralpsych/": "feminist philosophy, interventions: moral psychology"
            },
            {
                "../feminism-self/": "feminist philosophy, topics: perspectives on the self"
            },
            {
                "../kant-reason/": "Kant, Immanuel: account of reason"
            },
            {
                "../original-position/": "original position"
            },
            {
                "../rawls/": "Rawls, John"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-autonomy\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-autonomy/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminism-autonomy&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/feminism-autonomy/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-autonomy": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminism-autonomy/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminism-autonomy&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/feminism-autonomy/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}