{
    "url": "feminism-disability",
    "title": "Feminist Perspectives on Disability",
    "authorship": {
        "year": "Copyright © 2013",
        "author_text": "Anita Silvers",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2013</a> by\n\n<br/>\nAnita Silvers\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon May 4, 2009",
        "substantive revision Thu Aug 29, 2013"
    ],
    "preamble": "\n\n\nTraditional philosophy paid almost no attention to the existence and\nexperiences of people who are physically or cognitively impaired.\nThat in the past philosophers only rarely took notice of disability is\nunderstandable, if not condonable. The general culture usually\nassociates disability with defectiveness, insufficiency, and\nimperfection, in other words, with states that philosophy throughout\nits history has mainly aimed to transcend or overcome. Traditionally,\nphilosophers rarely mentioned the kinds of impairments that are\nidentified with disabling conditions. And when they did mention\ndisability, their purpose almost always has been to invoke a limiting\ncase (Silvers et al. 1998, 3), for example, babies so deformed as to\nvitiate the value of human life (Kuhse and Singer 1986), or adults too\ndependent and noncontributing to be parties to the social\ncontract (Rawls 1985).\n\n\nOver the last half century, however, scholarship in many disciplines\nhas come to appreciate the broader significance of difference. In this\nspirit, philosophers began to question the preeminence assigned to\nnormalcy, and the concomitant devaluation of the physical and\ncognitive conditions considered to be disabilities (Canguilhem\n1989). Recently, feminist thinkers moved into the forefront of this\nturn of interest in disability, sometimes prompted by their\nphilosophical commitment to inclusiveness, and sometimes by\npersonal encounters with disability. Disability perspectives have\nbecome familiar in feminist approaches to some philosophical topics,\nfor instance, ethics and justice theory, and the metaphysics of\nembodiment. Feminist approaches to other topics, such as models and\nstandards of knowing, might also benefit by being enlarged to include\ndisability perspectives.\n",
    "toc": [
        {
            "#DisStuDis": "1. Disability Studies and the Philosophy of Disability"
        },
        {
            "#ImpRelFem": "2. The Importance and Relevance of Feminist Philosophy"
        },
        {
            "#FemEpiDisSta": "3. Feminist Epistemology and Disability Standpoints"
        },
        {
            "#Ide": "4. Identity"
        },
        {
            "#Emb": "5. Embodiment"
        },
        {
            "#DisEmb": "5.1 Disruptive Embodiment"
        },
        {
            "#EthInc": "6. Ethics and Inclusion"
        },
        {
            "#Applic": "7. Applications"
        },
        {
            "#Car": "7.1 Caregiving"
        },
        {
            "#Bio": "7.2 Bioethics"
        },
        {
            "#Con": "8. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Disability Studies and the Philosophy of Disability\n\n\nDisability studies has steadily gained prominence over the past half\ncentury, moving expeditiously (at least in the United States) into the mainstream in\nhistorical and literary scholarship, but not so quickly in philosophy. In\nthe former fields, the components of disability studies are (mainly)\ntwo. There are analyses of the real histories of individuals or\ngroups of individuals with disabilities, and there also are readings of\nrepresentations of disabled people as they appear in literature,\ncinema, and similar creative work. Integrated with the accounts of real\nor invented disabled people are interpretations of the social or\ncultural forces that shaped their lives (in the case of actual\nindividuals with disabilities), or else that shaped their\nrepresentations in texts, film, and similar symbolic media.\n\n\nConducting disability studies in these disciplines has to a large\ndegree been a matter of applying well-known interpretive techniques to\nsubjects whom historical and literary scholarship previously\nignored. Thus, for example, most historical scholarship about\ndisability has aimed at reporting about the marginalized lives of\nindividuals with physical, cognitive, or psychological impairments.\nHistorical accounts of how such individuals fared in a particular\nsociety and a particular era are informed by familiar theories about\nthe political function of social roles, applied to the status to which\ndisabled people in that historical period were assigned. (To sample a\ndisability studies approach to intellectual history, see Kudlick and\nLongmore 2006, on how disability shaped Habermas's philosophy.)\nSimilarly, studies of symbolic presentations of disability mostly\ninterpret representations (either fictional or biographical) of\nindividuals whose characterization is inflected by attribution of one\nor another impairment. Scholarship about what such representations mean\nin a particular creative work usually is propelled by one or another\nfamiliar theory about the aesthetic, psychological, political or other\nfunction of symbolic roles, applied to disabled characters and\ncharacterizations of their disabilities. (See Silvers 2000 for a\ndiscussion of literary theory in disability studies.)\n\n\nIn these disciplines and related ones, consequently, engaging with\ndisability has involved invoking mainstream theoretical\npresuppositions and principles to explore phenomena associated with\ncertain previously under-theorized or otherwise ignored groups. Not so\nin philosophy, however, where disability, deformity and illness have\nappeared to defy application of familiar theoretical presumptions and\npractices. Examples of the resistance of disability to being subsumed\nunder philosophical theories turn up throughout the discipline's\nhistory, from Plato's uncharacteristic emphasis on fleshly ideals in\nsettling the fate of infants with deformities (Garland 1995, 15) to\nHume's setting aside the testimony of individuals with illnesses as\npertinent to theories of perception (Hume 1757) to Rawls's declaration\nthat justice for disability is a detour that cannot be addressed when\nbasic principles of justice are formulated and therefore must wait for\nthe later, legislative stage.\n(See Sen 2004 for an analysis of how Rawls's theory fails to\nrespond to the facts of disability, but see also Becker 2005.)\n\n\nFeminist philosophy, with its methodological reluctance to adopt\nphilosophy's traditional presuppositions without scrutinizing\nthem, initially was the most prominent area within the discipline where\ndisability is taken to be a serious subject for philosophical\ninvestigation. According philosophical significance to the state\nof being disabled is one of the innovations feminist theory has\nintroduced into philosophy. This article therefore explores affinities\nbetween feminist philosophy, which is aimed at expanding philosophical\ninquiry so that it adequately addresses women and their perspectives,\nand philosophical work with similar aspirations in regard to people\nwith disabilities.\n\n\nIn some respects, disability presents the instances or issues that\nmost intensely and interestingly challenge those traditional\nphilosophical presuppositions and principles against which feminist\nthought has been inclined to protest. Nevertheless,\nfeminist interests do not always coincide with disability perspectives,\nand unresolved tensions between feminist philosophy and the philosophy\nof disability remain. Consequently, this article also explores\ndisability perspectives on feminist philosophy as much as it reports\nfeminist perspectives on disability.\n2. The Importance and Relevance of Feminist Philosophy\n\n\nThe attitudes and aims that have informed and propelled feminist\nphilosophy have been consequential for the study of disability in\nphilosophy. Asking why women have been excluded from the philosophical\ntradition, feminist thinkers explicitly have intended to remedy\nphilosophy's prevailing indifference to the way the world is\nexperienced by women, including women with disabilities. (But see\nWendell 1989 and 1996 for concerns about feminist theory's disregard\nof women with disabilities. Despite this criticism, Wendell's remedy\nfor such neglect is propelled by feminist precepts.) In doing so, they\nhave made interventions that have altered the course of\nphilosophy.\n\n\nSome have argued, for example, that the universality to which\nphilosophical theories traditionally have aspired cannot embrace women\nwithout erasing them. Some have questioned whether such a\nstandard discerns, or instead disregards, important dimensions and\ntextures of women's lives. Some also have affirmed differences\namong different kinds of women that they take to be, if not essential,\nat least as philosophically significant as the differences between\nwomen and men. (See, for example, Spelman 1988, Fuss 1989 and Crenshaw\n1991, among many others, for discussions of these matters.)\n\n\nSuch divergence from standard philosophical views invites expanding\nphilosophical theorizing on various topics, including ways of knowing,\nkinds of being (especially the ontological implications of embodiment and\nthe relationship between body and mind), principles of conduct,\nintrinsically valuable human properties and ways of life,\nconceptualization of personal and social identity, and other\ntraditional philosophical topics, by attending to differences\noccasioned by or associated with disability. Further, biased\npretextual and other unjust treatment of women has been traced by some\nfeminist philosophers to their being viewed as impaired and thereby\nsubjected to the usual social practice of devaluing disability and\npeople who are disabled. Some of the initial philosophically\ninfluential discussions of disability have to do with how women's\nphysical realities are judged to be inferior because they do not match\nperformances paradigmatic of healthy males. One example is Iris Marion\nYoung's 1980 essay “Throwing Like a Girl,” about the\nprevailing masculinized rendering of women's embodiment that\nstigmatizes feminine physicality, wrongly construing the female body as\nfragile and burdensome. As a result, women are inhibited from\nconfidently embracing their own experienced spatial orientation and are\ninduced instead to underestimate their physical capabilities and to\ndeform their gestures and their movements through space. Another\nis Susan Wendell's 1989 Hypatia article “Toward a\nfeminist theory of disability,” wherein feminist\nphilosophy's uncritical, unreflective conflation of healthiness\nwith happiness and productivity is criticized. \n\n\nIn a conceptual climate that affords men's modes of bodily\nperformance ascendancy, women are at heightened risk of being\nsegregated and disrespected in virtue of being deemed deficient in\nphysical or mental strength or health. Also consequential in the\ndevelopment of feminist philosophical treatments of disability has been\nthe high frequency of assignment of women (rather than men) to the\ncaretaking of individuals with disabilities, a social arrangement that\nusually burdens and frequently fails to recognize or materially reward\nthose who must occupy this role and therefore one that unfairly\ndisadvantages women. Considerations like these helped tie\nliberatory feminist philosophical work to the development of an\ninsightful philosophy of disability.\n\n\nPervading the practice of philosophy, feminists found, are traces of\nbias that disregards women's interests and oppressively occludes\ntheir opportunities. Illuminating the significance of women's\nexperiences of limitation is one of feminism's prominent contributions\nto philosophy. Early philosophical study of women by feminist\nscholars examined the limitations that hampered their own lives, and\nthe lives of women generally, asking whether these resulted from\nalterable social arrangement or immutable biological destiny.\n(See Section 2.2, “Normative and Descriptive Components,”\nof SEP entry on “Topics in Feminism” for references to\nscholars who advance variations of these positions on the source(s) of\nwomen's subordination.) On the whole (although not for\neverybody), feminist theory has moved past this issue and now seems to\nregard the debate about biology versus society as the source of\nwomen's limitation as either irresolvable or unimportant.\n\n\n\nNevertheless, the nature of the (in)justice of limitations associated\nwith physical or cognitive impairment remains a concern in the\nphilosophy of disability, including feminist disability\ntheory. Biological difference is a central and undeniable fact of\ndisability, but the impact of biology on the kinds of experiences\ncharacteristic of being disabled is much more controversial.  There is\ndebate as to whether the functional limitations associated with\ndisability result mainly from biology's going awry and whether, if\ndisability is disadvantageous, it is naturally and immutably so. Or\ninstead whether disabled people's functional limitation should be laid\nat the door of flawed social practice which rewards the\nspecies-typical functioning of so-called normal people and punishes\nthe anomalous functioning of disabled people (Wendell 1996). \n3. Feminist Epistemology and Disability Standpoints\n\n\nFeminist philosophical work has aimed at repairing the imbalance\nbetween men's and women's concerns and rectifying the negative\ndepictions of traits viewed as female that are found in traditional\nphilosophical positions, paradigms and methodologies.  Feminists have\ntried to remedy a pervasive narrowness in the usual ways of framing\nthose issues philosophers have considered important enough to command\nphilosophical attention and work—that is, in the benchmarks that\nsignal philosophical considerability. To induce change, feminist\nphilosophers have crafted approaches that draw upon the very\nlimitations they encounter when attempting to pursue women's interests\nwithin philosophy. This effort has supplied stimulating ideas to\nphilosophers seeking to import the singular insights and different\nperspectives of other subordinated groups, such as the disabled, into\ncontemporary philosophy to improve its inclusiveness and extend its\nscope. Specifically, disabled people's philosophical interests find\nready-made conveyances in several of feminist thinking's signature\nreforms.\n\n\nFor example, feminist epistemology is a philosophically innovative\nreform movement that can serve as a beacon for the philosophical\ninvestigation of disability, although as of this writing the\nsignificance of disability for an adequate epistemology has not been\nmuch explored in disability scholarship, neither in the philosophical\nstudy of disability or in disability studies generally. Some\nfeminist philosophers (and some feminist psychologists as well) have\nargued that women have ways of knowing that differ from men's.\n(For psychologists, see Belenky et al. 1986 and Tannen 1990; for\nphilosophers, see Code 1991 and Ruddick 1989) Tannen, for\nexample, adduces evidence from sociolinguistic research to argue that\nenvironments conducive to women's learning differ from those\nappropriate for men. More generally, some theorists influenced by\nsuch accounts have characterized women as being alienated, unsatisfied,\nand unconvinced when held to traditional epistemology's paradigm of the\nisolated knower, with its detached, universalizing, and controlling\napproach to knowledge. Dissatisfaction with this kind of view has\nprompted feminist epistemological insights about the possibilities for\nachieving objectivity without insisting that cognition works or should\nwork the same way for everyone, as well as about the importance of\nsituating, contextualizing, and nuancing truths, and about the benefits of\ncollaborative practices of achieving knowledge. (See section 2.\n“Social Models of Knowers” in SEP entry on Feminist Social\nEpistemology for references.)\n\n\nIn developing their insights, feminist epistemologists have addressed\nthe influence on knowledge of the social situations of\nknowers. Situatedness cannot be just a matter of the social\npositioning of knowers, however, or of their histories or\ncultures. What we know is modulated by how we acquire the elements of\nknowledge, and these processes are shaped by the condition of the body\nas well as by social conditions. Cognitive skills are expressions of\ndevelopment in various areas of the brain, which in turn is responsive\nto the rest of the body. We therefore may expect that people with\ndisabilities, whose bodies diverge from the species-typical kind, also\nsometimes will develop cognitive approaches and abilities that differ\nfrom most other people's. Parenthetically, in one of the exceedingly\nrare instances of a philosopher treating an impairment as something\nother than a deficit, the 18th century experimentalist philosopher\nDenis Diderot investigated blind people's ways of knowing (Diderot\n1999 [1749], Curran 2013). Taking a stance that resembles, if not\nprefigures, recent feminist criticisms of Descartes, Diderot, in his\n“Letter on the Blind for the Use of Those Who See,” describes how\nblind people know about the world to show the short-comings of\nCartesian over-reliance on metaphors that associate reason with light\nor sight and Cartesian reliance on visual rather than tactile ways of\nknowing.\n\n\nTraditionally, of course, philosophers have dismissed disabled people's\nclaims to knowledge about subjects touched by the limitations of their\nparticular impairments. A telling illustration is given in the\ncorrespondence between philosophers Bryan Magee and Martin Milligan, in\nwhich Magee simply dismisses, absent argument, Milligan's report\nand arguments that, although blind almost from birth and without visual\nmemories of experiencing specific colors, he fully understands the\nmeaning of “red” (Magee and Milligan 1996). Here\nMagee portrays Milligan as a defective knower because of his blindness,\na conclusion Magee advances with assertions that Milligan's\nexperiences with redness are not exactly like Magee's own. Yet it\nis tendentious to point out that blind-from-birth individuals do not\ndevelop visual processing skills, and then to intimate that they must\nbe epistemologically inferior to, or that their modes of knowing cannot\nrise to the epistemological significance of, sighted people. To\nthe contrary, in some born-blind people, for instance, the area of the\nbrain associated in most other people with visual processing appears\ninstead to be a site for aural processing, meaning that a much larger\npart of the brain is available for dealing with information obtained\nthrough hearing than is the case for sighted people. This\nbiological difference is thought to explain why in many cultures blind\nindividuals are taken to be endowed with legendary skills for\nremembering and transmitting the spoken word accurately and with\nheightened understanding of orally transmitted texts, Thus blind bards\nwho preserve and perform lengthy gospels or narratives from an\nauthoritative standpoint are familiar figures in the history of many\ncultures (O'Neil 2003).\n\n\nThere are other blind people who know objects in their physical\nenvironment by echolocation, having cultivated the skill of making\nclicking noises with their tongues and identifying the different\nqualities of sounds bounced back toward them (Tresniowski and Arias\n2006 [in Other Internet Resources]; see also “Shattering\nBarriers” at the World Access for the Blind website, in Other\nInternet Resources).  Belgium's police force includes blind detectives\nwho can listen to criminals' recorded conversations and by the\nreverberations of sound identify what kind of room they occupy,\nwhether they are using a landline or cell phone, and even what kind of\ncar they are traveling in or whether the suspect's Flemish carries an\nAlbanian rather than a Moroccan accent (Soares 2007). Sighted people's\ntypical lack of functional ability to navigate by reverberated sound,\nand thus their inferior way of knowing the absorption/reflection\nproperties of the physical objects that surround them, and their\ndeafness to nuances of spoken sound, surely should be recognized as a\ndisadvantage.  Yet this is almost never so, even where sighted people\nmust find their way in the dark or distinguish among interlocutors\nbeyond their vision.\n\n\nThe experiences of people diagnosed with cognitive impairments also\nusually are dismissed as epistemologically defective, judged against\nthe philosophical ideal of the rational thinker. Some people\ndescribed as cognitively impaired have anomalous patterns of cognitive\nskills, in some ways failing to attain, but in other ways exceeding,\nlevels typical for the species. For example, individuals with Down\nSyndrome, who think abstractly only with difficulty or not at all,\nsometimes have greater than usual skills in perceiving, and\nremembering, the concrete details of what they see or hear. And people\nwith Williams Syndrome quite often have greater social and emotional\nintelligence than is species-typical for humans, as well as unusual\nmusical facility. This is not even to mention the innovative\ninsightfulness and creativity achieved by individuals with diagnoses of\nvarious kinds of psychoses and similar so-called mental disabilities,\nconditions experienced by many famed artists, writers and\nmusicians.\n\n\nSuch individuals usually are exempted from philosophy's scope as, for\nexample, when epistemological theory discounts the judgments of blind\npeople as irrelevant or unimportant to philosophical accounts of\nempirical knowledge, as philosopher Magee dismisses philosopher\nMilligan.. And people who lack abstract thinking skills, thereby\ndiverging from the kind of human capability philosophers themselves\nexercise so well and enjoy so greatly, usually are dismissed as\nunimportant, that is, as not rising to philosophical considerability.\nPeople whose cognitive anomalies impede them from arriving at and\narticulating complex and rationalized accounts of their own good very\noften are not accorded full status, and sometimes even are denied\nconsiderability, by moral and political theories, including\npluralistic liberal theories committed to respecting citizens' diverse\nvalues. (See McMahan 2005 and Kittay 2005) Yet, as Francis and Silvers\n(Francis and Silvers 2007, Silvers and Francis 2009) have pointed out,\nnormally autonomous individuals do not arrive at, nor do they express,\nnotions of their own good in isolation from, or independent of, their\ninteractions with other people.  Conceptualizations of the good of\ncognitively impaired people, developed through structurally similar\ncollaborative interactions between them and others, deserve equal\nconsideration in moral and political philosophy. \n\n\nTo account for the misfit between philosophical paradigms and their\nrealities, the testimony or example of outliers such as blind people,\nand people with Down Syndrome or Williams Syndrome, typically is\ndisallowed on the ground that it must be inherently flawed where it\nchallenges or deviates from philosophical theory. Yet to disregard the\nstandpoints, and thereby the performances and reports of the\nexperienced world, of unusual people impoverishes philosophizing by\ndiminishing the epistemological adequacy of philosophical accounts.\nFurther, as an application of Miranda Fricker's analysis of epistemic\ninjustice shows, the practice of systematically discounting belief\nclaims made by people with disabilities should be condemned as\ntestimonial injustice: individuals are wronged based on their\ndisability status when they when they aspire to roles as knowers (see\nFricker 2009). Nor, to apply a lesson from feminist philosophy of\nscience, can objective knowledge about disability be produced unless\ndisabled people, including people with cognitive disabilities, are\nfully respected members of the community of inquirers (see Longino\n2001). Francis and Silvers have proposed an approach to constructing\nideas of the good with full respect for and inclusion of the\nviewpoints of severely disabled persons (Francis and Silvers 2006,\nSilvers and Francis 2009).\n\n\nLike disabled people as a group, women as a group have been dismissed\nand displaced, condemned for not complying with biological or social\nparadigms and therefore denied authorization for the ways of knowing\nthat inform their experiences. What they believe they know often has\nbeen rejected as merely epistemologically anomalous. Oppressive\npolicies traditionally were defended with the rationale that\n“nature” has made women physically, intellectually, and\nemotionally frail (Miles 1988). In response, feminist epistemology has\nwelcomed recognition of the legitimate influences of social location\nin arriving at knowledge claims, as well as the centrality of\ncollaborative practices in the pursuit of knowledge. \n\n\nWhat is not so clear is whether feminist epistemology is as\ncomfortable with the impact on knowing of other bodily differences.\nThis is a question of whether different biological properties\nlegitimately define different epistemological standpoints. Especially\nin the last part of the 19th and the first part of the\n20th centuries, biological determinism was a potent tool\nused to oppress women through false testimony that science found them\nto be less capable of survival than men.\n\n\nWary of promoting such determinism, feminist philosophy has been more\nengaged with the social rather than the biological phenomena\nidentified with women. Feminist standpoint theory has been inclined to\ntreat differences in cognitive styles as arising from socially induced\ngendered identities or roles rather than from biological traits or\nconditions that differentiate men from women. Some of its proponents\nargue for the superiority of the styles associated with women. In the\nmain, however, the operative notion for feminist theory is that\nepistemic authority is the product of a social award; there is no\nnatural order in which the cognition of biologically fit individuals\nis most attuned to the actualities of the external world and therefore\nis superior.\n\n\nTo a significant extent, however, standpoints defined in terms of\ndisability are associated with characteristic biological differences. This\nraises several questions for an epistemology of disability, especially\none modeled on feminist theory, to explore.\nFirst, is characterizing standpoints with reference to biological\ndifferences inherently and onerously deterministic, so that one's\nbody inescapably delineates one's cognitive destiny?\nSecond, does granting equal legitimacy to standpoints defined with\nreference to biological differences lead to irresolvable and\ndebilitating epistemological relativism? And, third, will\nacknowledging the range of atypical (for humans) ways of knowing reveal\na heretofore unimagined richness in what humans can know the world is\nlike?\n4. Identity\n\n\nThe interplay of biological and social identities—whether these be\ninnate, imposed, or embraced—has become a subject of first-order\nimportance in disability studies as well as in feminist theory, and\nespecially in philosophical ventures into disability scholarship.\nFeminists have been, by far, the most numerous of philosophical writers\non the topic of disability identity. They have offered a rich\nvariety of sophisticated approaches to the question of how the\nsensibilities and histories of people with very different kinds of\nlimitations can be collected into a cohesive philosophical\naccount. Some write from the perspective of a lifelong disability\nidentity, others describe their transition into the world of\ndisability, and still others write about disability without having\nexperienced being disabled themselves.\n\n\nIn view of the relevance of so many different standpoints, feminist\nphilosophy of disability must meet the challenge of constructing an\naccount of disability identity that does not invoke or appeal to\n“normal” examples of disabled people. Further, no one\nshould claim to be, or speak as or about, the typical disabled\nperson. The enormous diversity among disabled people, and the\nimportance of reflecting all their differences in formulating\ndisability theory, calls for sensitivity to nuance and context.\n(Re)formulations of feminist identity theory that can accommodate the\nmany ways in which disabled people differ from each other as well as\nfrom nondisabled people are of special importance because they may be\nextrapolated beyond disability theory to illuminate issues about\nidentities shaped by other kinds of differences.\n\n\nUnlike traditional ideas of race and sex, disability has always been\nunderstood to be a permeable classification. Some\npeople have lived at length or lifelong with disability, some are newly\nso, and others have lived through periods in which they were disabled\nbut now are not so. A large number of us should expect to become\ndisabled later in our lives. And many of us find ourselves\nintimately involved in the lives of family members or friends who now\nare disabled or who face a future of disability. Further, as Eva Kittay\nreminds us, social policies that pertain to disabled people also affect\ntheir family members, friends and professional caregivers (Kittay 1998;\nKittay 2001). So feminist disability theory should\nrecognize that disability affects the identities of many people beyond\nthe 600 million worldwide who are themselves disabled (Herr, Gostin,\nand Kuh 2003).\n\n\nDisability identity may be claimed for a variety of very different\nreasons. Sometimes the objective is to acquire eligibility for assuming\nthe “sick” role and thereby being relieved of various\nproductivity-related expectations and responsibilities . Sometimes\nbeing identified as disabled offers access to government benefits of various\nkinds. Sometimes being understood to be disabled triggers\nacceptance of or accommodation to atypical modes of functioning.\nAnd sometimes disability identity is claimed as an empowering element\nof a political process intended to consolidate a group of people\nsufficiently numerous and vigorous to challenge stigmatization,\nexploitation, and exclusion based on disability. As the reasons\nfor these disparate purposes for identifying as disabled diverge, so do\nthe criteria or conditions for judging individuals to be disabled, as\nwell as the inducements to individuals to understand themselves\nprimarily in terms relating to disability.\n\n\nThe inclusiveness of the various identity theories promoted in\nfeminist philosophy is of preeminent and persistent concern to women\nwith disabilities. Discussing whether women with disabilities can\ncomfortably be feminists, Anita Silvers has asked whether feminism\nprivileges the functional capabilities and social roles characteristic\nof “normal” women. She has found some feminist theories\nguilty of “magnifying these (functional capabilities of typical\nwomen) until they become standards of womanhood against which disabled\nwomen shrink into invisibility” (1998a).\n\n\nFeminist philosophy validates and valorizes activities women\ntypically execute and in which they excel, such as theories of maternal\nethics that center on mothering as preeminent moral conduct. But\nnot all women are admitted to women's roles. Even in the most\nprogressive contemporary societies, women with disabilities encounter\nopposition to their maintaining fertility, or accessing reproductive\nmedical technology in achieving fertility, or even retaining custody of\nthe children to which they have given birth. Karin Barron, who\nhas conducted extensive research on the lives of young women with\ndisabilities, observes that we place great value on the womanly art of\ncaring for dependents, but the traditional dependent position of young\nwomen with disabilities prevents them from occupying, and therefore\nfrom demonstrating any aptitude for, this role (1997). We should\nbe clear that what precluded the young women Barron studied from being\nhomemakers and mothers was not their lack of potential for serving in\nthese roles but, instead, their having been assigned to an\nalternative social position, one defined in terms of such\ndependence that their capacity to nurture others became virtually\ninconceivable.\n\n\nLicia Carlson has shown that a gendered process of conceptualizing\nsocial roles even affected the diagnostic classification of mental\nretardation. She has explored the complex interconnections that\ncharacterize the linked history of cognitive disability and gender\noppression. Carlson points out that while superintendents of\ninstitutions that warehoused intellectually disabled people were mostly\nmale, women were employed to go out and identify cases of\nfeeblemindedness on the theory that they were more intuitive by nature\nand therefore better qualified for the job. This was an era when\nnormal women were presumed to have a leading role in defending society\nagainst moral weakness of the sorts for which the feebleminded were\nfeared, based on a notion about women's commitment to maintain\ncommunity virtue for protection of the young. While there is value in\nacknowledging human vulnerability and dependence, Carlson observes,\nfeminists should be as concerned about placing persons with\nintellectual disabilities in such mirror roles as about making third\nworld feminism a mirror for Western feminism (Carlson 2009;\nalso see Narayan 1997). \n\n\nCarlson's analysis should compel feminist philosophers to reconsider\ntheir understanding of cognitive disability. Feminist philosophers are\nnot immunized by their philosophical persuasion against their having\nlimitations such as ignorance of the lived realities of people with\nintellectual disabilities, the nature of intellectual disability, and\nthe historical basis of this category (Carlson 2009,2010). As\nfeminists have questioned the privileged status of masculine ways of\nthinking, Carlson questions whether some feminists privilege their own\nmodes and levels of cognition (Carlson 2001). They should, further, ask\nwhether they have constructed feminist philosophizing in terms that\nmake intellectual endeavor too central an undertaking. Eva Kittay\nmakes this point penetrating, poignant, and personal when she\ndescribes the transformative insight occasioned by being told that her\nchild is congenitally mentally retarded:\n\n\nthe worst anticipation was that her handicap involved her intellectual\nfaculties. …. I was committed to a life of the mind.  …\nHow was I to raise a daughter that would have no part of this? If my\nlife took its meaning from thought, what kind of meaning would her\nlife have? …. [W]e already knew that we had learned\nsomething. That which we believed we valued, what\nwe—I—thought was at the center of humanity—the\ncapacity for thought for reason, was not it, not it at all. (Kittay\n1998, 150)\n\n\nA somewhat similar dilemma about the preeminent value of intellectual\nskills may confront people who acquire a cognitive disability later in\ntheir lives. Kate Lindemann (2001) and Ann Davis (2005) both write\nabout the effects that experiencing the sequelae of head injuries had\non their beliefs about cognition.  Lindemann's critique points to\nradical and profound ways in which feminist appreciation of the\ndiverse workings of mind can enlarge philosophical inquiry. Feminist\ntheory stands to gain by paying new attention to philosophical issues\nthat should be rethought to reflect the situation of adults with brain\ninjuries: personal identity, mind-body dualism, conceptions of the\nself, and philosophical psychology.\n\n\nRecognizing that some individuals have invisible disabilities should\nremind us, Davis observes, of the extent to which we always are\nepistemologically dependent on people's disclosures of their own\nidentities. Davis rejects the presumption that we can clearly separate\nvoluntary from inadvertent limitations. Many cognitive and\npsychological limitations cannot be documented by reference to physical\nanomalies. Yet, Davis rightly says, experiences of them are no less\nreal. She rejects the conviction that we can find physical\ncorrelates of anomalous cognitive or psychological functioning.\nPolicies demanding that these kinds of cognitive and\npsychological limitations be documented by public demonstration or\nthird-party confirmation should be abandoned, for they rely on mere faith in\ntheir having physical causes rather than on factual evidence that they\ndo.\n\n\nThese personalized experiences of limitation should not be\ndiscounted. The philosophy of disability suggests that we need to\nrecalibrate our sensibilities to honor the evidence of other people's\nsenses, especially of their own embodiment. People's testimony\nabout their own limitations and incapacities deserves respect even if\nuncorroborated by biological confirmation. Such experienced limitations\nmay place the individual at activity-impeding, pain-inducing or\nlife-threatening risk. As Davis argues eloquently, we improperly\nburden people whose limitations we cannot directly see, and aren't\nsufficiently knowledgeable to appreciate, by constantly challenging\nthem to prove their disabilities.\n5. Embodiment\n\n\nFeminist scholars have explored how corporeal or biological\ndistinctiveness mediates daily activities so that self-identification\nand social experience act on, and become attuned to, each other.\nFeminist research such as that of Susan Sherwin (1992) shows that\nmedicine has treated women as if they were disabled people, intervening\nin their bodies to eliminate or discipline (to use Foucault's term)\nthose parts that mark their identification with a purportedly inferior\ngroup. Medicine has, in particular, been dismissive of women's\nemotional lives. The history of how medicine has addressed disabled\npeople is similar. It is a history of the repression and\nrejection of bodies and minds that diverge from the supposed paradigm\nor norm provided by healthy young males.\n\n\nEnlightened by these parallels with their own history, some early\ndisability studies scholars rejected medical practices directed at\naltering themselves. They characterized the medical model of\ndisability, which takes disability to be a problem requiring medical\nrather than social intervention and as both the prerogative and the\nresponsibility of medical professionals to fix, as oppressive. They saw\nmedicine itself as a coercive instrument that subordinates disabled\npeople, not the least by inducing feelings of inadequacy and self-hate\nin them. (See UPIAS 1978; Finkelstein 1980; Oliver 1983.)\n\n\nJust as biological sex, and the division of humans into two sexes,\ninitially were taken as givens in feminist theory, so early disability\nstudies scholars proposed to treat impairments such as being unable to\nhear, see, walk, talk, or execute cognitive activities as biological\ngivens, and disabilities as social interpretations of\nimpairments. On such accounts, the properties of bodies\n(including brains) are supposed to be pre-social. According to\nthese accounts, it is socially constructed interpretations and\nvaluations of the powers of neutral corporeal properties that consign\npeople with various kinds of bodies to advantageous or detrimental\nsocial roles.\n\n\nJenny Morris, a leader of the disabled women's movement,\nproposes that the social model of disability enables disabled people to\ndefine their own bodies and their differences in terms of personal\nexperience and self-authorization, free of detached diagnoses imposed\nby medical authorities. The social model construes the limitations of\npeople with disabilities as a social problem rooted in the imposition\nof practices that are biased against the disabled. Once\nunderstood as products of bias rather than biology, disabled\npeople's disadvantages can be remedied through the pursuit of\njustice to reform the practices that oppress them. According to Morris,\nadopting the social model of disability makes it possible to talk about\naddressing the limitations of disabled people's functioning\nwithout condemning, or requiring improvements in, the state of their\nbodies (or, for that matter, their minds) (Morris 2001).\n\n\nBetter informed, more sophisticated recognition of and reflection on\nthe facts about sex and gender have complicated the picture for both\nfeminist and disability scholarship. There are, for example, intersexed\npeople, born with the biological markers of both female and male.\nA socially imposed allegiance to sexual dualism demands they be\nsubmitted to medical intervention that (usually through amputation)\npresses their bodies into one or the other sexual mold. Yet\nhaving a woman's body does not necessarily suit a person for feminine\nroles, nor do all those with men's bodies find themselves fitting\ncomfortably into masculine roles. The materiality of\nsexual characteristics does not make them unbreachable constants. There\nare individuals who adapt with facility to gendered roles that are not\ntraditional for their particular bodily configurations.\n\n\nOthers, however, find their sexual characteristics too\nrestricting for the roles they adopt and consequently seek to change\nthese elements of their bodies through surgical and chemical\nintervention. The way transgendered people see themselves in the world\nindicates that the body's limitations cannot always be\ndiscounted. While some people do not think their corporeal\nalteration is required to comfortably fit into opposite gendered roles,\nothers seek medical intervention to facilitate their transgendering.\nThus, the experiences of transgendered people suggest that there are\ncircumstances in which altering one's body to better execute preferred\nsocial roles can be an affirming, rather than a degrading,\nchoice.\n\n\nThese considerations show not only the error in supposing that the\nnatural and social dimensions of embodiment can be cleanly\ndichotomized, but also the superficiality of thinking that we always\nshould take bodies as they come. Extrapolating this insight to\ndisability helps us to see the over-simplification in condemning\nmedical transformations of the body as being expressions of\nself-hatred. There is no phenomenological firewall separating our\nawareness of our biological properties from our social experiences. How\nour own bodies feel to us is shaped by social discourse.\n\n\nIn a documentary film presenting conversations with leading philosophers, \nfeminist theorist Judith Butler learns about the social model of disability\nfrom artist and disability activist Sunaura Taylor (Taylor, 2009). The social\nmodel is compatible with Butler's own theory of embodiment. Butler observes \nthat everyone, whether or not disabled, requires support for bodily\nactivities from various kinds of things that are external to their bodies.\nEvery body is permeable in the sense of being vulnerable to being impinged\nupon by others. People who violently target and victimize the disabled are \nmanaging their own permeability by abusing individuals who appear to be\nmore dependent than most and thus more vulnerable. Violent acts against the\ndisabled foreground their permeability and thereby, according to Butler, give  \nthe perpetrators the illusion of being themselves exempt from permeability.\n\n\nApplying Butler's ideas about embodiment, which emphasize the\ninconstancy of conceptualizations of bodily kinds, feminist legal\nscholar Kathryn Abrams contends that one reason the Americans with\nDisabilities Act (ADA) has had trouble in the courts, with most\nplaintiffs losing their cases (at least under Title I - Employment),\nis because the social model disrupts a premise of mainstream\njurisprudence. The legal norm presumes that human bodies are\nbiological objects of fixed kinds, whereas on Butler's theory bodies\nare contingently constituted by transient social interactions (Abrams\n2011:76).  However, not all judicial thinking has been so narrow. For\nexample, in 2006 a pre-surgery transexual individual's denial of\nemployment suit was allowed to proceed, despite the defendant's claim\nthat Title VII did not apply because the plaintiff was not a woman; in\nsupporting the plaintiff, the court invoked the factual complexities\nthat underlie human sexual identity and explained that these\ncomplexities are occasioned by how biological sexuality interacts with\nsocial, physiological, and legal conceptions of gender\n(see Schroer v. Billington 2006, 2009).\n\n\nOur bodies' responses and responsiveness inflect in turn the social as\nwell as the solitary aspects of our experiences. Nor is social practice\nisolated from, or prior to, materiality. An individual's\nimpairments are no more neutral than her sexual characteristics are,\nfor they mediate much of the content of her consciousness of the world\nwith which she interacts. Performing major life functions such as\nmobilizing, hearing, seeing, communicating and understanding are such\nintimate elements of the fabric of our experience that what we view as\nwithin our reach in the world around us—and thereby what we take as\nthe objects of our ambition—arises out of the scope and facility of\nour biological functioning.\n\n\nConsidering whether the experiences of women are sufficiently\nacknowledged in disability studies, Susan Wendell points to masculinist\ninfluences on the field's standard model of disability (1996).\nWendell offers a refreshing look at the disability politics of\npromoting an image of the healthy disabled, which is similar to the\nfeminist politics of excluding disabled women altogether in an effort\nto advance more appealing and powerful icons. She argues that the\nsocial model of disability, which until recently has been the\npreeminent theoretical inspiration for disability studies, tends to\nobscure the frequency with which disability is tied to illness (Wendell\n2001).\n\n\nOpponents of the medical model of disability urged the\ndisentanglement of disability from illness, pointing out that many\nindividuals with disabilities are as strong and capable of productivity\nas nondisabled people, and therefore should not be consigned to\nthe limitations of the “sick” role (Amundson 1992). This strategy\nalso promotes self-reliance over dependence and replaces trust in the\nexpertise of medical and social service professionals with strategies\nto let disabled people take control of their own lives. The useful\npoint of such emphasis for disabled individuals, Wendell acknowledges,\nis that by getting their political position about subordination to\nmedicalization right, they affirm rather than devalue their own\nbodies.\n\n\nYet, Wendell adds, political correctness will not always make people\nfeel right about our bodies or make their bodies feel right.\nIllness is itself disabling, and chronically ill individuals constitute\na prominent part of the population considered to be disabled. Making\nhealthy rather than ill disabled people paradigmatic of the disability\ncategory may obscure some disabled people's important differences.\nWorse, doing so may perpetuate our culture's devaluing of dependency\nand inflating of the value of self-sufficiency. Wendell argues\nfor reforming disability studies through a more inclusive feminist\napproach to disablement, namely, one that does not exaggerate the value\nof strength and independence as she believes masculinist influenced\ntheorizing tends to do (Wendell 1996).\n\n\n\nWendell also proposes that feminist disability politics consider the\nimplications of chronic illnesses that mark the unhealthy disabled's\nexperience of embodiment (Wendell 2001). One such implication concerns\nthe appropriate reaction to suffering. Many chronically ill people feel\npain, fatigue, feebleness, and disorientation to a degree that\nforestalls productivity, saps self-sufficiency, and even may alienate\nthem from their own bodies or minds. The social response in both\nmainstream society and disability circles is to support cures for\nchronic illnesses, as though the suffering caused by illnesses renders\nthese conditions irrelevant to how disabled individuals form their\nidentities. Yet some disabled individuals, at least, reject medical\ninterventions aimed at a cure on the ground that they do not wish to\nbecome different from whom they are. To the contrary, Wendell\nthinks, an adequate philosophical account of embodiment will appreciate\nidentities inflected by suffering without glorifying or sugar-coating\nthe debilitating dimensions of perpetual exhaustion and discomfort.\n\n\nA related implication concerns the reaction to emotional or\npsychiatric suffering. Unlike feminist literary scholarship,\nwhere studies of madness are well represented, feminist philosophers\nhave shown comparatively little interest in addressing the phenomena of\nneurodiversity. Feminist and disability studies theorists who are\nundermining the domination of paradigms of youth and health should\nextend their efforts so as to liberate psychiatrically disabled people\nfrom the idealization of the neurotypical mind. Andrea Nicki argues\nthat feminists ordinarily do not think of anger and aggression as being\nvaluable because they are emotions of competition rather than\ncooperation. But, Nicki thinks, these feelings may serve as\nmorally valuable—because liberating—expressions for some\nneurodiverse people, especially for emotionally abused individuals\n(2001).\n5.1 Disruptive Embodiment\n\n\nThe powerfully negative meanings evoked by the prevailing\nconceptualization of disability may overwhelm both the equality of\nopportunity and the moral respect that disabled people's exercise\nof autonomy or independence should command. Thus, even healthy\npeople with disabilities often are stigmatized because their embodied\nmodes of functioning strike others as disruptive, however adeptly\nadaptive and independent these may be. And individuals with\ngenetic vulnerabilities that put them at more than species-typical risk\nfor illness are also at risk of such stigmatization. People who\ntest positive for alleles associated with disease may encounter\ndiscrimination in employment and other areas of civic and commercial\nlife, even though they never become symptomatic (Silvers and Stein\n2003). Feminist and gender studies already have shown that atypical,\nand thereby transgressive, modes of corporeal functioning offer a rich\nresource for developing more adequate concepts of the materiality of\nhuman experience and of our personhood (Clare 1999). Yet, whether\nin illness or in health, the lives of disabled people largely have been\nignored when these concepts are explored, to the detriment of moral and\npolitical philosophy generally.\n\n\nPeople who talk or read with their fingers, walk using their arms\nand hands, categorically recoil from other people's touches, or float\nthrough the day on analgesics that suppress waves of pain, often\ndevelop resilient and innovative approaches to fleshly function.\nFurther, disabled people often are the first to incorporate adaptive\ntechnology into their lives. From machines that write (typewriters were\ninvented to permit blind people to write) to machines that speak\n(computerized speech output was invented to permit blind people to\nread), disabled people have piloted the use of mechanical devices that\nnow are integral to so many lives. Adaptive technology combines with\nfleshly effort to secure their basic capabilities: they hear with\namplifiers, breath with respirators, mobilize in wheelchairs that they\nguard with more concern than the care they give their bodies.\n\n\nA supportive intimacy of machine with flesh thus is a feature of\nmany disabled people's lives, but one that can distance them from the\nnondisabled. Alison Kafer criticizes ecofeminism for assuming that\nauthentic engagements with nature are possible only through purely\nnatural immersion experiences from which use of manufactured\nproducts, including the assistive and prosthetic devices that\ndistinguish some disabled people's embodiment, are banned.\nEcofeminism remains bound by the traditional dualism of human artifice\nversus nature, Kafer argues, in part because of mistakenly equating\nspecies-typical bodies with naturalness. Species-typicality remains a\npresumption of feminism, she says (Kafer 2005). Such a standard\ndisregards or devalues people with disabilities whose functioning\nintegrates their fleshly parts with mechanical components or other\ntechnologies. (See Kafer 2013 for a more general theory that intersects  \nfeminist, disability, and queer theory approached to embodiment.)\n\n\nAlthough ordinarily considered unfit to participate in competitive\nschemes, when disabled people with prostheses function well, their\nsupposed cyborgian advantages create another reason for their\nbeing shunned. In a case that went to the United States Supreme\nCourt, the Professional Golf Association unsuccessfully attempted to\nban an otherwise qualified individual because a physical anomaly\nprevented him from walking for a full eighteen holes. The PGA invoked\nthe specter of a Frankensteinian slippery slope: if an anomalous golfer\ncould mobilize with a golf cart while normal golfers walked, what would\nprevent a future contender, an upper limb amputee, from strapping on a\nbionic arm that can drive a golf ball more than two miles (PGA Tour,\nInc. v. Martin (00-24) 532 U.S. 661 (2001) 204 F. 3d 994)?\n\n\nLower leg amputees used to be excluded from competitive running\nbecause their prostheses made them run too slowly. Now new materials\nand designs have created specially springy sports feet that permit\ntheir wearers, when very skilled and talented, to run as fast as can\nbe done with fleshly feet. A hit-and-run driver's victim, Dory\nSelinger now bicycles with a cleated peg replacing an amputated\nfoot. Because it does not flex, the peg is more efficient at pedaling\nthan a fleshly foot. Selinger's best time is only four seconds off the\nlongstanding world record for “normal” racers\n(Squatrighlia 2001).\n\n\nThe South African track star Oscar Pistorius, whose congenitally\nanomalous feet were amputated in childhood, uses modern alloy\nartificial feet that return almost as much energy as the runner's\nweight loads. Racing officials opposed Pistorius's competing against\nnondisabled athletes, invoking objections running from fears of his\nfalling on other athletes, through his violating the rules because he\nhas no fleshly foot to touch the starting block, to his very presence\ncorrupting the purity of the sport, and the extravagantly dire\nprediction that able-bodied athletes would amputate their own fleshly\nfeet to gain advantages derived from prosthetics. Pistorius appears to\nuse about one-fourth less lower leg energy when matched with runners\nwith fleshly feet because his prosthetic ankles are more efficient\nthan fleshly ankles, and initially he was banned from the Olympics due\nto the claim (subsequently overturned by the International Court of\nArbitration for Sport) that his artificial feet gave him an unfair\nadvantage. (See Silvers and Wasserman 2000 for a general discussion of\nfairness in regard to accommodating people with disabilities in\ncompetitive sport and Silvers 2008 in regard to enhanced\nembodiment.)\n\n\nArguably, it is unfair to exclude racers with disabilities on the\nground that crude prosthetics render unable to be competitive, and\nthen also to exclude them when better prosthetics make them highly\ncompetitive. Such a practice of limiting eligibility to typically\nembodied competitors narrows social opportunity for whoever does not\nconform to the conventional rules of embodiment. And it is precisely\nbecause of the ease with which such rules of competition can be rigged\nto favor some so-called normal modes of functioning over other\nseemingly anomalous ones that feminists rightly have been suspicious\nof invoking rules derived from models of competitive recreation as\nrelevant to and regulative of social justice.\n\n\nTraditional approaches to justice often take competition for resources\nor position to be fundamental to social and political relationships,\nwhich consequently puts an emphasis on fairly managing socially\nbestowed or artificially achieved advantage, somewhat as the rules of\ngames control the deployment of inside information, equipment,\npharmaceuticals and other such performance enhancers. On the other\nhand, feminist theories of justice achieved through inclusiveness,\nsuch as Iris Young's (1990) and Martha Nussbaum's (2006), cast\ninterdependence rather than rivalry as the social and political\nrelationship with which justice should be more concerned. In contrast\nto traditional justice theory's worries about disruptive embodiment's\nimpact on practice, policy and principle (for example, see Rawls's\nwell-known exclusion of disabled people on this ground, 1985 p. 234),\nsuch feminist theories condemn, and try to overcome, the omission or\ninterdiction from practice, policy and principles of justice of people\nwith anomalous bodies or minds.\n6. Ethics and Inclusion\n\n\nIn general, people with physical and mental disabilities have at\nleast their experiences of social exclusion in common. Exclusion looms\nlarge in many disabled people's lives and shapes their expectations and\naspirations. This is a familiar story in the life\nhistories of many individuals who are identified with non-dominant\ngroups.\n\n\nPresumptions about biological unfitness and burdensomeness often have\nbeen invoked to engineer enforced segregation of parts of the\npopulation. Courts have endorsed the separation of people identified\nas being of different races by advancing the rationale that\nsegregating social schemes merely acknowledge “natural”\naffinities among people of the same race and “natural”\nantipathies among people of different races. The supposed benefits of\nbiological separatism also have been cited to deny women employment\nthat would place them in the company of men. For example, when a state\nlaw denying women the opportunity to be employed as bartenders was\nappealed to the U.S. Supreme Court as a violation of the\nconstitutional guarantee of equal protection, the Court declared the\nexclusion to be constitutional because of the “real”\ndifferences between men and women. The majority opinion explicitly\naffirmed that women's presence “naturally” incites males\nto lust and violence, and that women do not have the physical ability\nto impose orderly behavior on the rowdy patrons of a bar (Silvers and\nStein 2002).\n\n\nSimilarly, people with disabilities have been characterized as being\nbiologically unfit to execute the responsibilities and thereby to\nenjoy the privileges of citizenship, to work and play with nondisabled\npeople, and to be permitted reproductive freedom. For example, people\nwith mental retardation, cerebral palsy, blindness, and deafness all\nhave suffered the state's sterilizing them, removing their\nchildren from their custody based only on their disability, denying\nthem access to public education on the ground that their presence\nharmed other children, and institutionalizing them to protect citizens\nwho function in species-typical ways from having to have contact with\nthem (Lombardo, 2008). Similar legally endorsed harm is a familiar\ntheme in the history of women, racial minorities, native people, and\ngays and lesbians.\n\n\nSearching for ethical grounds to condemn the kinds of exclusions to\nwhich women have been subjected, feminist thinkers have been\ndisappointed by traditional metaethical, moral and political\nanalyses. Feminists have found traditional moral philosophy\nsuspect for inflating typical male behaviors into paradigmatic moral\nactions and traditional political philosophy equally suspect for being\nbereft of remedies for the moral and political challenges posed by such\nbiased and pretextual exclusion. Although standard ethical and\npolitical theorizing claims as a matter of principle to embrace\neveryone alike, feminist critiques have shown that their presumptions\noften exclude devalued kinds of people from significant moral,\npolitical and social roles (for example, Putnam 1993 draws attention to\nRawls' exclusion of people with serious disabilities from the\nbasic level of formulation of principles of justice).\nConsequently, feminist philosophers such as Annette Baier (1986, 1987),\nEva Kittay (1998), Martha Nussbaum (2001, 2006), and Iris Marion Young\n(1990a; 1990b) have pioneered the exploration of more inclusive\nalternative theories (to mention just a few leading feminists whose\ntheories have been influenced by a concern to address the\nphenomena of disability adequately). They have relocated the search\nfor an adequate center for moral and political philosophy to, for\nexample, the ethics and politics of trust and care, the virtues of\ndependency, the sustenance of capabilities fundamental to human life, and\nthe establishment of moralized interconnectedness among people who do\nnot occupy similar positions in life. Albeit differing from one\nanother in their approaches to feminist ethical and political theory,\nall build in concern for achieving adequate philosophical treatment to\naddress problematic kinds of interactions between people with\ndisabilities and the nondisabled, or to illuminate ways of framing\ndistributive policies that are equal to the situations of both\nnondisabled and disabled individuals. (For another explicitly feminist\nexample of the former, see Mahowald in Silvers, Wasserman and Mahowald\n1998 and for a feminism compatible example of the latter, see Becker 2012.)\n\n\n\nTwo main approaches to addressing the social exclusion of disabled\npeople have surfaced in the philosophical literature that refers to\nthem. Some writers focus foremost on procedural justice to open\nup disabled people's opportunities for social participation (Young\n1992; Silvers 1998b; Anderson 1999; Silvers and Francis 2005).\nAnderson urges that everyone be guaranteed effective access to the\nsocial conditions of their freedom in virtue of their equality, not\ntheir inferiority. To illustrate, she notes that what Deaf people\nobject to is not their lack of hearing but that “everyone else\nhas rigged the means of communication in ways that leave them out of\nthe conversation. One can detect this injustice without investigating\nanyone's preferences or subjective states” (Anderson 1999, \n334). Silvers proposes a procedure called historical\ncounterfactualizing to identify practices catering to the nondisabled\nmajority that unjustly exclude people with disabilities (Silvers\n1998b; Hoffman 2003).\n\n\nOthers take the answer to lie first of all in distributive justice to\nincrease provision of resources to the disabled and to families caring\nfor the disabled (Kittay 1998; Kittay 2001; Nussbaum 2006). Nussbaum,\nfor example, begins with a comprehensive idea of the good to guide\njustice. She develops a list of capabilities necessary to live with\ndignity and holds that people with disabilities deserve support to\nachieve threshold levels of these capabilities, if they can do so,\neven if more resources must be deployed to assist them than other\npeople need to reach the same level. Kittay, another example, seeks\nsupportive conditions for those who interact in dependency relations,\nboth dependents and their caregivers, arguing that both must be\nassisted in order to achieve good care, and therefore justice, for the\ndependent. To effect such an outcome through justice, Kittay believes,\nrequires maintaining a social order that secures care for dependents\nas a main purpose of formulating fundamental principles of justice and\na theoretical basis that downgrades the value of independence, at\nleast for disabled people (Kittay 2011).  Although many commentators\nendorse the prominence Kittay assigns to (re)organizing society to\nprovide various kinds of care and to protect care workers, Kittay's\nunderstanding of how her view relates to liberal political has been\nquestioned. One problem has to do with Kittay's assumptions about how\nreciprocity functions in liberal theory, and another is about the role\nof reciprocating relationships on her view (Whitney 2011). Another is\nabut whether the vulnerability of utter dependents is sufficiently\nsimilar to other kinds of vulnerability, such as that of care workers,\nto warrant taking the support relationship needed by utter dependents\nas the basic model for social affiliation and obligation (Bhandary\n2010).\n\n\nNeither of these approaches to justice—one foregrounding\nprocedural reform and the other revising resource distribution –\ndenies the importance of the other's objectives. In great part, they\ndiverge on matters of practical priorities, but also on matters of\nwhether moral priority should be given to agreement about what is\nright, or instead about what is good. However, some feminist thinkers\nwho have questioned the ability of traditional moral theories to take\naccount of the needs and experiences of both care-receivers and\ncare-givers are inclined to portray caring conduct as inspired not by\nduty but by the compelling recognition of another's need and of one's\nown capacity to relieve that person's need.  Consequently, they have\ncriticized rights-based and obligation-catering procedural theories\nfor abstracting excessively from experienced encounters with\ndependents who need protection and support (Kittay, 1998, for\nexample). Other feminist philosophers, such as Baier and Nussbaum,\nhave raised a different question about the adequacy of traditional\nmoral theories to address the phenomena of interdependency. Their\nissue is about validation rather than motivation. They have queried\nwhether approaches centered on independent individuals contracting\nfreely and reciprocally with one another for mutual benefit can give\nplausible accounts of obligations to people who are, temporarily or\npermanently, greatly dependent on others for physical, cognitive or\nemotional support.\n\n\nNussbaum (2006) suggests that the source of political philosophy's\nignoring the disabled lies in a foundational assumption of social\ncontract theory. She criticizes Rawls for casting citizens in the role\nof rough equals who relate because they can benefit each other, saying\n“Instead of picturing one another as rough equals making a\nbargain, we may be better off thinking of one another as people with\nvarying degrees of capacity and disability, in a variety of different\nrelationships of interdependency with one another” (2001,\nB9). Construing reciprocal bargaining as the foundational and\ntherefore paradigmatic social connection among citizens “effaces\nthe more asymmetrical forms of dependency that human life contains:\nthe need for care in infancy, extreme age, and periods of severe\nillness or a lifetime of severe disability,” she objects (2001,\nB9).\n\n\nNussbaum thinks traditional social contract theory is misguided in\ntesting basic conceptions of justice against self-regarding reasons,\nthereby assigning self-regarding reasons preeminence over\nother-regarding ones. And surely it is hard to see how a\nconception that derives justice from decisions featuring self-regard\n(such as whether particular formulations of principle would benefit\none's self regardless of one's circumstances) can provide\nadequately protective principles for each individual in relation to\nothers, especially in view of the vulnerabilities individuals accept as\nthe price of being part of cooperative schemes.\n\n\nStimulated by Nussbaum's critique, Silvers and Francis (2005) return\nto Baier's insights about the centrality of trust in moral\ninteraction. They propose extrapolating principles of justice from\npractices that facilitate people's relying on, and thereby making\nthemselves vulnerable to, each other. Practices that nourish such\ntrust are crucial components of social cooperation.  Moreover, unlike\nbargaining, which requires strategizing and therefore complex\nhigh-order cognitive skills, trusting is conduct that people without\ndisabilities and people with almost every kind of disability equally\ncan engage in. People who cannot articulate their decisions, and who\nmay not even be able to arrive at decisions, nevertheless may express\nbestowal or withdrawal of their trust.  As a mode of relating to one\nanother, trust is par excellence suited to facilitating\ninteractions between individuals who in various respects are\nasymmetrically positioned in regard to one another.  Silvers and\nFrancis argue that building trust is a more inclusive process than\nbargaining about principles of justice. Building trust therefore\noffers a more adequate practice for achieving justice for both\ndisabled and nondisabled people than the reciprocating exchanges\ncalled for in strategic contracting.\n7. Applications\n\n\nBy clearing away some biased approaches to moral and political\ntheorizing, the work of feminist philosophers has greatly and\nbeneficially influenced the philosophy of disability. Nevertheless,\nbecause feminist philosophy is woman-centered, and most women do not\nidentify as being disabled themselves, the interests and emphases of\nfeminist thinkers are not always congruent with those of activists\naspiring to liberate the disabled from oppressive social arrangements\nor of scholars formulating liberatory theories that guide and justify\ndoing so. Two conversations where the alliance between feminist\nphilosophy and the philosophy of disability is strained relate to\nwomen's liberty to shape their own relationships, and their\nliberty to reproduce. Although disability activists and scholars\nnever deny that women should be thoroughly free, some have concerns\nabout women's exercising their freedom in ways that curtail or\ndismiss disabled people's freedom.\n7.1 Caregiving\n\n\nWomen are more likely to remain in relationships with ill or\ndisabled dependents—partners, children, or elders—than are men\n(Cohen 1996). Possibly, fewer men than women consider caregiving as a\nself-affirming role. Women therefore contribute a very large proportion\nof society's caregiving, but may be harmfully confined and\ndisadvantaged by this role unless their contributions as carers are\nadequately acknowledged, appreciated and compensated. Emphasized\nin feminist literature and by the women's movement, this issue is\na touchstone for many feminist philosophers in judging the adequacy of\nmoral and political theories.\n\n\nAnalyses and assessments of the moral dimensions of how caregivers\nrelate to dependent disabled individuals, as well as to disabled people\nwho do not need extraordinary levels of care, would benefit from\nnuanced collaboration attention by feminist and disability\nscholars. Even where helping relationships are voluntary, they\nrisk being asymmetrically so, with the dependent feeling coerced into\nreceiving assistance in the proffered rather than in a preferred form,\nor the dependency worker feeling imprisoned by the relationship.\nHelp-givers choose how they will help, but help-takers cannot choose\nhow they will be helped, for if one's connection to others is as the\nrecipient of help, rejecting others' choice of proffered help leaves\none solitary (Silvers 1995). Joan Tronto finds that the power\nimbalance between care givers and care receivers carries with it a\npotential for oppression (Tronto 1987; Tronto 1993).\n\n\n\nNussbaum rightly observes that we must preserve the self-respect of\ndependents without exploiting caregivers. Morris argues that the\nsolution lies in eliminating the presumptions about normate embodiment\nand normal functioning that now pervade the way caregivers and care\nreceivers usually are conceptualized by ethics of care.  Proponents of\nthe ethics of care could profit from recognizing that many disabled\npeople, men as well as women, are caregivers for themselves and\ntherefore are crucially positioned to understand how giving care best\nconnects to receiving it (Morris 2001). Working out better\nunderstanding of the moral, political, and social dimensions of\ncaregiving relationships is of crucial importance not only to disabled\npeople themselves, but also to families who are as dependent on\nsecuring care for their dependent members as their dependents are on\nthem.\n7.2 Bioethics\n\n\nBioethics is another area of applied philosophy where feminist\nthinking, while making its mark, at least initially occluded\ndisability perspectives. Feminist bioethicists most often have aligned\nwith the principle that women are owed control of their own bodies.\nWhile this idea may appear compatible with the value of\nself-determination promoted by much disability philosophy, some\nbioethicists, including some who are feminists, have adopted\nmedicalized views of disability and, in doing so, have argued that the\nprospect of bearing a disabled child justifies, or even obligates,\ntermination of the pregnancy (Purdy 1995; see also McMahan 1998 and\nMcMahan 2005). A related but not identical position challenges\n“Baby Doe” laws that prohibit hospitals from denying\nneonates with disabilities effective life-saving treatment, arguing\nthat parents should be free to decide whether their child's life will\nbe worth living (Paris et al. 2005). \n\n\nFeminist bioethicist Adrienne Asch has carefully distinguished between\na woman's right to terminate her pregnancy and the moral constraints\non her terminating the life of her new-born child.  Disability does\nnot diminish the claims of neonates, nor of other individuals with\ndisabilities, to the necessities of life (Asch 1990 2002; Asch and\nGeller 1996; Asch, Gostin and Johnson 2003; Kittay 2005). Disability\nscholars generally have objected to the unfounded presumption that\nbeing disabled makes life not worth living, or at least makes the\nlives of people with disabilities less gratifying and valuable than\nthose of nondisabled people. The social isolation to which disabled\nindividuals often are condemned results in nondisabled people being\nmisinformed about their potential for satisfying lives. Terminating a\npregnancy because the resulting child may have an impairment reduces\nthe individual to the disability, but people with disabilities are as\nmuch a sum of many different strengths and flaws as nondisabled people\nare (Parens and Asch 1999). Like Asch, Carlson urges feminists to be\nwary of women's being induced to accept social roles in which they\ndevalue individuals who are disabled. She notes that feminist programs\nfor the availability of birth control often invoked fears of\nperpetuating feeblemindedness to support their case. Carlson warns\nthat genetic counseling, which also is work done primarily by women,\nmay function in a similar gatekeeping role (Carlson 2010).\n\n\nThe objectionable presumptive devaluing of life with a disability is\nnot compatible with a full and equitable commitment to reproductive\nliberty. Philosophers as well as policy makers have invoked the\nsupposed inescapable suffering of disabled people as a reason for\nbarring deaf women and women with dwarfism from using reproductive\ntechnology (for example, pre-implantation genetic diagnosis) to bear\nchildren like themselves, narrowing these women's reproductive\nchoices. An additional consistency challenge emerges in regard to\nthe influence that the prospect of a sad or bad life should have on the\nreproductive liberty to bear children who may or will have\ndisabilities. Feminists condemn the practice of aborting female fetuses\nand of female infanticide, even where women lead inescapably miserable\nlives. It is difficult to see what, other than the influence of\nthe prevailing social biases against disability, would lead those who\nregard the termination of females this way from extending their\nobjection to the termination of other devalued kinds of people\n(Asch 1999; Asch and Geller 1996).\n8. Conclusion\n\n\nFor more than two decades, feminist philosophy has had a productive\nbut sometimes uneasy engagement with the facts and theory of\ndisability. Some feminists who view feminist theorizing from a\ndisability perspective, such as Morris and Wendell, are disturbed by\nevidence that feminism has not overcome a residual allegiance to\nnormalcy. And indeed some discussions of disability by feminists seem\nto proceed by laying aside feminism's own affiliations with\nliberation, self-affirmation, and inclusiveness. In general, however,\nphilosophy has benefited from applying feminism's theoretical lenses\nto better understand disability. Polishing those lenses with the cloth\nof which disabled people's lives are made promises to achieve more\nfinely nuanced and perspicacious philosophical accounts, and theories\nbroader in scope and farther seeing, than during the centuries when\nphilosophy overlooked disability.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abrams, K., 2011. “Performing Interdependence: Judith \nButler and Sunaura Taylor in the Examined Life”, <em>Columbia\nJournal of Gender &amp; Law</em>, 21(2): 72–89\n [<a href=\"http://scholarship.law.berkeley.edu/facpubs/464\" target=\"other\">available online</a>].",
                "Amundson, R., 1992, “Disability, Handicap, and the\nEnvironment”, <em>Journal of Social Philosophy</em>, 23(1):\n114–18.",
                "–––, 2000. “Against Normal Function”,\n<em>Studies in History and Philosophy of Biological and Biomedical\nSciences</em> 31C: 33–53.",
                "Amundson, R. and S. Tresky, 2007. “On a Bioethical\nChallenge to Disability Rights,” <em>Journal of Medicine and\nPhilosophy</em>, 32(6): 541–561.",
                "Anderson, E., 1999. “What Is the Point of Equality,”\n<em>Ethics</em>, 109(2): 287–337.",
                "Asch, A., 1990. “The meeting of disability and bioethics: A\nbeginning rapprochement”, in \n<em>Ethical issues in disability and rehabilitation: An international\nperspective</em>, B. S. Duncan and D. Woods (eds.), New York: World\nRehabilitation Fund, World Institute on Disability and Rehabilitation\nInternational, pp. 85–89.",
                "–––, 1999. “Prenatal diagnosis and selective\nabortion: A challenge to practice and policy”, <em>American Journal\nof Public Health</em>, 89(11): 1649–1657.",
                "–––, 2002. Disability and reproductive\nrights, in J.A. Baer (ed.), <em>Historical and multicultural\nencyclopedia of female reproductive rights in the United States</em>,\nWestport, CT: Greenwood Press, 64–66.",
                "Asch, A. &amp; Geller, G., 1996. “Feminism, bioethics and\ngenetics.” in S.M. Wolf (ed.), <em>Feminism and bioethics:\nBeyond reproduction</em>, New York: Oxford University\nPress, 318–350.",
                "Asch, A., Gostin, L. O., &amp; Johnson, D. M., 2003.\n“Respecting persons with disabilities and preventing disability:\nIs there a conflict?”, in S. Herr, L. O. Gostin, and H.\nH. Koh (ed.), <em>Different But Equal: The Rights of People with\nIntellectual Disabilities</em>, New York: Oxford\nUniversity Press, 319–346.",
                "Baier, A., 1986. “Trust and Antitrust”,\n<em>Ethics</em>, 96(2): 231–260.",
                "–––, 1987. “The Need for More Than\nJustice,” in M. Hanen, and K. Neilson (eds.), <em>Science,\nMorality, and Feminist Theory</em>, <em>Canadian Journal of\nPhilosophy</em>, supp. vol. 13: 41–56.",
                "Barron,K, 1997. “The Bumpy Road To Womanhood”,\n<em>Disability &amp; Society</em>, 12(2): 223–239.",
                "Barton, L., 1989. <em>Disability and Dependence</em>, Lewes:\nFaimer Press.",
                "Becker, L., 1996 “Trust As Noncognitive Security About\nMotives,” <em>Ethics</em>, 107(1): 43–61.",
                "–––, 2005. “Reciprocity, Justice, and\nDisability,” <em>Ethics</em>, 116(1): \n9–39.",
                "–––, 2012. <em>Habilitation, Health, and Agency:\nA Framework for Basic Justice</em>. New York: Oxford University\nPress.",
                "Belenky, M. F., Clinchy, N. Goldberger, L, &amp; Tarule, J. M.,\n1986. <em>Women's Ways of Knowing: The Development of Self, Voice,\nand Mind</em>, New York: Basic Books.",
                "Bhandary, A., 2010. “Dependency in Justice: Can Rawlsian\nLiberalism Accommodate Kittay's Dependency\nCritique?” <em>Hypatia</em>, 25(1): 140–156.",
                "Boorsay, A., 2005. <em>Disability and Social Policy in Britain\nSince 1750: A History of Exclusion</em>, Basingstoke, UK.:\nPalgrave.",
                "Bordo, S., 1993. <em>Unbearable Weight: Feminism, Western Culture,\nand the Body</em>, Berkeley, CA: University of California Press.",
                "Breslau, N., 1983. “Care of Disabled Children and Women's\nTime Use,” <em>Medical Care</em>, 216: 620–29.T.",
                "Butler, J. 2009. “Judith Butler with Sunaura Taylor:\nInterdepence.” ed. Astra Taylor, <em>The Examined Life:\nExcursions With Contemporary Thinkers</em>, New York: The New Press,\n185–214.",
                "Canguilhem, G., 1989. <em>The Normal and the Pathological</em>,\ntrans. Carolyn R. Fawcett &amp; Robert S. Cohen (trans.), New York:\nZone Books, originally published in France in 1968 as <em>Le Normal et\nle pathologique</em>.",
                "Carlson, L., 2001. “Cognitive Ableism and Disability\nStudies: Feminist Reflections on the History of Mental\nRetardation” <em>Hypatia</em>, 16(4): 124–146.",
                "–––, 2003. “Rethinking Normalcy,\nNormalization and Cognitive Disability,” in S. Harding and\nR. Figueroa (ed.)<em>, Science and Other Cultures: Issues in the\nPhilosophy of Science and Technology</em>, 154–171, New York:\nRoutledge.",
                "–––, 2009. <em>The Faces of\nIntellectual Disability</em>, Bloomington: Indiana University\nPress.",
                "–––, 2010. “Unmasking\nIntellectual Disability in Philosophical Discourse,”, in\nL. Carlson and E. Kittay (eds.), <em>Cognitive Disability: A Challenge\nto Moral Philosophy</em>, Boston: Blackwell Publishing.",
                "Clare, E., 1999. <em>Exile and Pride: Disability, Queerness, and\nLiberation</em>, Cambridge, MA: South End Press.",
                "Code, L., 1991. <em>What Can She Know? Feminist Theory and the\nConstruction of Knowledge</em>, Ithaca: Cornell University Press.",
                "Cohen, M. D., 1996. <em>Dirty Details: The Days and Nights of a\nWell Spouse</em>, Philadelphia, Temple University Press.",
                "Crenshaw, K. 1991. “Mapping the Margins: Intersectionality, Identity\nPolitics, and Violence Against Women of Color.” <em>Stanford Law\nReview</em>, 43(6): 1241–1299.",
                "Crow, L., 1996. “Including all of our lives: Renewing the\nsocial model of disability,” in J. Morris (ed.), <em>Encounters\nwith Strangers: Feminism and Disability</em>, 206–222, London:\nWomen's Press.",
                "Curran, A., 2013. “Diderot, an American Exemplar? Bien \nSûr!”, <em>The New York Times</em>, January 25: A27.",
                "Davis, A., 2005. “Invisible Disability”,\n<em>Ethics</em>, 116(1): 153–213.",
                "Deegan, M.J. &amp; Brooks, N., 1985. <em>Women and Disability: The\nDouble Handicap</em>, New Jersey: Transaction Press.",
                "Diderot, D., 1999 [1749]. “Letter on the Blind for the Use\nof Those Who See,” in D. Adams (ed.), <em>Thought on the\nInterpretation of Nature and Other Philosophical Works</em>,\n149–200, Manchester: Clinaman Press.",
                "Fine, M. and Asch, A., 1981. “Disabled women: Sexism without\nthe pedestal.” <em>Journal of Sociology</em> <em>and Social\nWelfare</em>, 8(2): 233–248.",
                "Fine, M. and A. Asch ed., 1988. <em>Women with Disabilities:</em>\n<em>Essays in Psychology, Culture, and\nPolitics</em>, Philadelphia: Temple University Press.",
                "Finkelstein, V., 1980. <em>Attitudes and Disabled People</em>,\nGeneva: World Health Organisation.",
                "Francis, L.P. and A. Silvers, 2007. “Liberalism and\nIndividually Scripted Ideas of the Good: Meeting the Challenge of\nDependent Agency,” <em>Social Theory and Practice</em>, 33(2):\n311–334.",
                "Fricker, M. 2009. <em>Epistemic Injustice: Power and the Ethics of\nKnowing</em>, Oxford: Oxford University Press",
                "Fuss, D., 1989. <em>Essentially Speaking: Feminism, Nature and\nDifference</em>, New York: Routledge.",
                "Gallagher, S., 2005.  <em>How the Body Shapes the Mind</em>,\nOxford: Oxford University Press.",
                "Garland, R., 1995. <em>The Eye of the Beholder: Deformity and\nDisability in the Graeco-Roman World</em>, Ithaca: Cornell University\nPress.",
                "Hanna, WJ, &amp; Rogovsky, E., 1991. “Women with\ndisabilities: two handicaps plus” <em>Disability</em>,\n<em>Handicap &amp; Society</em>, 6(1): 49–63.",
                "Herr, S., L. Gostin, and H.H. Koh., 2003. <em>The Human Rights of\nPersons with Intellectual Disabilities</em>, Oxford: Oxford University\nPress.",
                "Hoffman, S., 2003. “Corrective Justice and Title I of the\nADA,” <em>American University Law Review</em>, 52:\n1213–1289.",
                "Hume, D., 1757. “Of the Standard of Taste.”\n<em>English Essays: Sidney to Macaulay</em>, Vol. XXVII. The Harvard\nClassics. New York: P.F. Collier &amp; Son, 1909–14.  \n [<a href=\"http://www.bartleby.com/27/\" target=\"other\">Available online</a>]",
                "Kafer, A., 2005. “Hiking Boots and Wheelchairs: Ecofeminism,\nthe Body, and Physical Disability” in B. Andrew,  J. Keller and\nL. Schwartzman (eds.), <em>Feminist Interventions in Ethics and\nPolitics</em>, 131–150, Lanham, MD:Rowman and Littlefield.",
                "–––, 2013. <em>Feminist, Queer, Crip</em>,\nBloomington: Indiana University Press.",
                "Kallianes, V. &amp; Rubenfeld, P., 1997. “Disabled Women and\nReproductive Rights,” <em>Disability &amp; Society</em>, 12(2):\n203–221.",
                "Kittay, E., 1998. <em>Love's Labor: Essays on Women, Equality, and\nDependency</em>, New York: Routledge.",
                "–––, 2000. “At Home With My Daughter:\nReflections on Olmstead v. L.C.”, in L.P. Francis and A. Silvers\n(eds.), <em>Americans with Disabilities: Exploring Implications of the\nLaw for Individuals and Institutions</em>, 64–80, New\nYork: Routledge.",
                "–––, 2001. “When Care is Just and Justice\nis Caring: The Case of the Care for the Mentally Retarded”,\n<em>Public</em> <em>Culture</em>, 13(3): 557–579.",
                "–––, 2002. “Caring for the Vulnerable by\nCaring for the Caregiver: the Case of Mental Retardation”, in\nR. Rhodes, M. Battin and A. Silvers (eds.), <em>Health Care and\nDistributive Justice</em>, 290–300, Oxford: Oxford University\nPress.",
                "–––, 2005. “At the Margins of Moral\nPersonhood”, <em>Ethics</em>, 116: 100–131. \n [<a href=\"http://evafederkittay.com/wp-content/uploads/2014/11/At-the-Margins-of-Moral-Personhood.pdf\" target=\"other\">Preprint available from the author</a>]",
                "–––, 2006a. “The Idea of Care Ethics in\nBiomedicine: the Case of Disability”, in <em>Biomedicine and\nHuman Limits</em>, C. Rehman-Sutter (ed.), Amsterdam:\nSpringer-Verlag, pp. 319-339.",
                "–––, 2006b. “Beyond Autonomy and\nPaternalism: The Caring Transparent Self”, in <em>Autonomy and\nPaternalism: Between Independence and Good Intentions</em>, T. Nys,\nY. Denier, &amp; T. Vandevelde (eds.), Leuven: Peeters, pp. 23-70.",
                "–––, 2006c. “Thoughts on the Desire for\nNormality”, in <em>Surgically Shaping Children: Essays on\nTechnology, Ethics and the Pursuit of Normality</em>, E. Parens (ed.),\nBaltimore: Johns Hopins Press, pp. 90-112.",
                "–––, 2011. “The Ethics of Care,\nDependence, and Disability”,\n<em>Ratio Juris</em>, 24(1): 49–58.",
                "Kittay, E and L. Carlson, eds., 2010. <em>Cognitive Disability and\nIts Challenge to Moral Philosophy</em>, Boston: Blackwell\nPublishing.",
                "Kittay, E and E. Feder, eds., 2003. <em>The Subject of Care: Feminist\nPerspectives on Dependency</em>, Lanham, Md.: Rowan and\nLittlefield.",
                "Kittay, E., A. Silvers, and S. Wendell (eds.), 2001.\n<em>Hypatia: Special Issue on Feminism and Disability I</em>, \n16(4).",
                "–––, 2002.\n<em>Hypatia: Feminism and Disability II</em>, 17(1).",
                "Kuhse, H. and Singer, P., 1986. <em>Should the Baby Live?:\nThe Problem of Handicapped Infants</em>, New York: Oxford University\nPress.",
                "Kudlick, C. and P. Longmore, 2006. “Disability and\nthe Transformation of Historians' Public Sphere,” from the <em>Forum\non Disability</em> column, American Historical Association's\n<em>Perspectives Online</em>, 44(8): November.\n[<a href=\"http://www.historians.org/perspectives/issues/2006/0611/0611for2.cfm\" target=\"other\">Available online</a>]",
                "Lindemann, K., 2001. “Persons with Adult-Onset Head Injury:\nA Crucial Resource for Feminist Philosophers”,\n<em>Hypatia</em>, 16(4): 105–123.",
                "Lombardo, P., 2008. <em>Three Generations, No Imbeciles: Eugenics,\nthe Supreme Court, and Buck v. Bell</em>, Baltimore: The Johns Hopkins\nPress.",
                "Longino, H. 2001. <em>The Fate of Knowledge</em>, Princeton:\nPrinceton University Press.",
                "Magee, B. and M. Milligan., 1996. <em>On Blindness</em>:\n<em>Letters between Bryan Magee and Martin Milligan</em>, Oxford:\nOxford University Press.",
                "McMahan, J., 1996. “Cognitive Disability, Misfortune, and\nJustice,” <em>Philosophy and Public Affairs</em>, 25(1):\n3–34.",
                "–––, 1998. “Wrongful Life: Paradoxes in\nthe Morality of Causing People to Exist,” in J. Coleman and C.\nMorris (eds.), <em>Rational Commitment and Social Justice</em>,\nCambridge: Cambridge University Press, 208–247.",
                "–––, 2005. “Causing Disabled People to\nExist and Causing People to be Disabled,” <em>Ethics</em>,\n116(1): 77–99.",
                "Meekosha, H and Pettman, J, 1991. “Beyond Category Politics”\nin <em>Hecate</em>, 17(2): 75–92.",
                "Miles, R., 1988. <em>A Women's History of the World</em>,\nLondon: Michael Joseph.",
                "Morris, J, 1991. <em>Pride Against Prejudice</em>,\nPhiladelphia: New Society Publishers.",
                "–––, 1992. “Personal and political: a\nfeminist perspective on researching physical\ndisability”, <em>Disability, Handicap and Society</em>, 7(2):\n157–66.",
                "–––, 1993. <em>Independent Lives</em>, New York:\nMacmillan.",
                "–––, 2001. “Impairment and Disability:\nConstructing an Ethics of Care that Promotes Human\nRights,” <em>Hypatia</em>, 16(4): 1–16.",
                "Narayan, U., 1997. <em>Dislocating Cultures</em>, New York:\nRoutledge.",
                "Nicki, A., 2001. “The Abused Mind: Feminist Theory, Psychiatric\nDisability, and Trauma,” <em>Hypatia</em>, 16(4): 80–104.",
                "Nussbaum, M., 2001. “The Enduring Significance of John Rawls”,\n<em>The Chronicle of Higher Education</em>, Section 2, July\n20: B7–B9.",
                "–––, 2002. “Capabilities and\nDisabilities”, <em>Philosophical Topics</em>, 30(2):\n133–165.",
                "–––, 2006. <em>Frontiers of\nJustice</em>, Cambridge: Harvard University Press.",
                "Oliver, M., 1983. <em>Social Work with Disabled People</em>,\nLondon, Macmillan.",
                "O'Neil, J., 2003. “Vital Signs; the Senses; No Vision,\nBut Better Memory.” <em>The New York Times</em>, June\n17<sup>th</sup>.\n [<a href=\"http://query.nytimes.com/gst/fullpage.html?res=9B0DEED81538F934A25755C0A9659C8B63\" target=\"other\">Available online</a>]",
                "Parens, E. and A. Asch, 1999. “The Disability rights\nCritique of Prenatal Genetic Testing: Reflections and\nRecommendations,” <em>Hastings Center Report</em>, 29(5):\nS1-22.",
                "Paris, J., M. Schreiber and A. Elias-Jones, 2005.\n“Resuscitation of the Preterm Infant Against Parental\nWishes,” <em>Archives of Disease in Childhood, Fetal\nNeonatal Edition 90</em>, no. 3, May, F208–F210.",
                "Pateman, C., 1988. <em>The Sexual Contract</em>,\nStanford: Stanford University Press.",
                "Purdy, L., 1995. “Loving Future People”, In J. Callahan\n(ed.), <em>Reproduction, Ethics and the Law</em>, Bloomington, IN:\nIndiana University Press.",
                "Putnam, R.A., 1993. “Commentary on Michael Walzer:\nObjectivity and Social Meaning,” in M. Nussbaum and A. Sen\n(eds.), <em>The Quality of Life</em>, 178–184), Oxford, Clarendon\nPress.",
                "Rawls, J., 1985. “Justice as Fairness: Political not\nMetaphysical”, <em>Philosophy &amp; Public Affairs</em>,\n14(3): 223–251.",
                "Ruddick, S., 1989. <em>Maternal Thinking: Toward a Politics of\nPeace</em>, Boston: Beacon Press.",
                "<em>Schroer v. Billington</em>, 2006. 424 F. Supp. 2d 203 212\n(D.D.C.)",
                "<em>Schroer v. Billington</em>, 2009. No. CIV.A. 05-1090,2009 WL\n1543686, at *5(D.D.C. Apr 28, 2009)",
                "Scully, J. L., 2008. <em>Disability Bioethics: Moral Bodies, Moral\nDifference</em>, Lanham, Maryland: Rowman and Littlefield.",
                "Sherwin, S., 1992. <em>No Longer Patient: Feminist Ethics and Health\nCare</em>, Philadelphia, PA: Temple University Press,.",
                "Shildrick, M. and J. Price, 1998. eds. <em>Vital Signs:Feminist\nReconfigurations of the Bio/logical Body</em>, Edinburgh:\nEdinburgh University Press.",
                "Silvers, A., 1995. “Reconciling Equality To Difference:\nCaring (F)or Justice For People With\nDisabilities”, <em>Hypatia</em>, 10(1): 30–55.",
                "–––, 1998a. “Women and Disability”,\nin Jaggar, A. &amp; Young, I.M. (eds.), <em>Blackwell's Companion to\nFeminist Philosophy</em>, 330–340, Oxford: Basil Blackwell\nLtd.",
                "–––, 1998b. “Formal Justice”, in\nA. Silversm D.  Wasserman and M. Mahowald (eds.), <em>Disability,\nDifference, Discrimination</em>, Lanham, MD:\nRowman and Littlefield, 13–145.",
                "–––, 2000. “From The Crooked Timber of\nHumanity, Beautiful Things Can Be Made”, in P. Brand (ed.),\n<em>Beauty Matters: New Theories of Beauty</em>, 197–223,\nBloomington: Indiana University Press.",
                "–––, 2003. “On the possibility and\ndesirability of constructing a neutral conception of\ndisability”, <em>Theoretical Medicine and Bioethics</em>, 25(6):\n471–487.",
                "–––, 2008. “The right not to be normal as\nthe essence of freedom,” <em>Journal of Evolution and\nTechnology</em>, 17(2): 78–84.",
                "–––, 2009. “An Essay on Modeling:\nThe Social Model of Disability,” forthcoming in\n<em>Disability</em> in the Philosophy and Medicine Series,\nC. Ralston and J. Ho (eds.), New York: Springer.",
                "Silvers, A. and Francis, L.P., 2005. “Justice Through Trust:\nDisability and the ‘Outlier Problem’ in Social Contract \nTheory,” <em>Ethics</em>, 116(1):\n40–76.",
                "–––, 2008. “Thinking About the Good:\nReconfiguring Liberal Metaphysics (or Not) for People With Cognitive\nDisabilities,” <em>Metaphilosophy</em>, 40(34):\n475–498.",
                "Silvers, A. and Stein, M.A., 2002. “Disability, Equal\nProtection, and the Supreme Court: Standing at the Crossroads of\nProgressive and Retrogressive Logic in Constitutional\nClassification”, <em>The Michigan Journal of Law Reform</em>,\n35(1&amp;2): 81.",
                "–––, 2003. “Human rights and genetic\ndiscrimination: protecting genomics' promise for public health,”\n<em>Journal of Medicine, Law and Ethics</em>, 31(3):\n377–89.",
                "Silvers, A. and Wasserman, D., 2000. “Convention and\ncompetence: Disability Rights in Sports and Education,” <em>Society</em>,\n37(1): 63–67.",
                "Silvers, A., Wasserman, D., and Mahowald, M., 1998. <em>Disability,\nDifference, Discrimination: Perspectives on Justice in Bioethics and\nPublic Policy</em>, Lanham, Maryland: Rowman and Littlefield.",
                "Soares, C., 2007. “Move over Poirot: Belgium recruits blind\ndetectives to help fight crime,” <em>The Independent</em>,\n Nov 23. \n [<a href=\"http://www.independent.co.uk/news/world/europe/move-over-poirot-belgium-recruits-blind-detectives-to-help-fight-crime-5337339.html\" target=\"other\">Available online</a>]",
                "Spelman, Elizabeth, 1988. <em>The Inessential Woman</em>, Boston:\nBeacon Press.",
                "Squatrighlia, D., 2001. “Triumph Out of Tragedy”\n<em>San Francisco Chronicle</em>, July 1, A 19, A 22.",
                "Tannen, D., 1990. <em>You Just Don't Understand: Women and Men in\nConversation</em>, New York: William Morrow.",
                "Tronto, J., 1987. “Beyond Gender Difference To A Theory of\nCare”.  <em>Signs</em>, 12(4): 644–61.",
                "–––, 1993. <em>Moral Boundaries: A Political\nArgument for an Ethic of Care</em>, London: Routledge.",
                "Union of the Physically Impaired Against Segregation (UPIAS) and\nthe Disability Alliance, 1976. <em>Fundamental Principles of\n Disability</em>, London: Union of the Physically Impaired\nAgainst Segregation.  [1978 version]\n <a href=\"http://www.leeds.ac.uk/disability-studies/archiveuk/UPIAS/fundamental%20principles.pdf\" target=\"other\">available online</a>]",
                "Wendell, S, 1989. “Toward A Feminist Theory of\nDisability”, <em>Hypatia</em>, 4(2):\n104–124.",
                "–––, 1996. <em>The Rejected Body: Feminist\nPhilosophical Reflections on Disability</em>, London: Routledge.",
                "–––, 2001. “Unhealthy Disabled: Treating\nChronic Illnesses as Disabilities”, <em>Hypatia</em>, 16(4):\n17–33.",
                "Whitney, S.Y., 2011. “Dependency Relations: Corporeal\nVulnerability and Norms of Personhood in Hobbes and\nKittay”.  <em>Hypatia</em>, 26(3): 554–574.",
                "Young, I. M., 1980. “Throwing \nLike a Girl: A Phenomenology of\nFeminine Body Comportment, Motility and Spatiality,” <em>Human\nStudies</em>, 3(1): 137–56.",
                "–––, 1990a. <em>Justice and the Politics of\nDifference</em>, Princeton, NJ: Princeton University Press.",
                "–––, 1990b. <em>Throwing Like a Girl and Other\nEssays in Feminist Philosophy and Social Theory</em>, Bloomington:\nIndiana University Press.",
                "–––, 1997. “Asymmetrical Reciprocity: On\nMoral Respect, Wonder, and Enlarged\nThought” <em>Constellations</em>, 3(3): 340–363."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Abrams, K., 2011. “Performing Interdependence: Judith \nButler and Sunaura Taylor in the Examined Life”, <em>Columbia\nJournal of Gender &amp; Law</em>, 21(2): 72–89\n [<a href=\"http://scholarship.law.berkeley.edu/facpubs/464\" target=\"other\">available online</a>].</li>\n<li>Amundson, R., 1992, “Disability, Handicap, and the\nEnvironment”, <em>Journal of Social Philosophy</em>, 23(1):\n114–18.</li>\n<li>–––, 2000. “Against Normal Function”,\n<em>Studies in History and Philosophy of Biological and Biomedical\nSciences</em> 31C: 33–53.</li>\n<li>Amundson, R. and S. Tresky, 2007. “On a Bioethical\nChallenge to Disability Rights,” <em>Journal of Medicine and\nPhilosophy</em>, 32(6): 541–561.</li>\n<li>Anderson, E., 1999. “What Is the Point of Equality,”\n<em>Ethics</em>, 109(2): 287–337.</li>\n<li>Asch, A., 1990. “The meeting of disability and bioethics: A\nbeginning rapprochement”, in \n<em>Ethical issues in disability and rehabilitation: An international\nperspective</em>, B. S. Duncan and D. Woods (eds.), New York: World\nRehabilitation Fund, World Institute on Disability and Rehabilitation\nInternational, pp. 85–89.</li>\n<li>–––, 1999. “Prenatal diagnosis and selective\nabortion: A challenge to practice and policy”, <em>American Journal\nof Public Health</em>, 89(11): 1649–1657.</li>\n<li>–––, 2002. Disability and reproductive\nrights, in J.A. Baer (ed.), <em>Historical and multicultural\nencyclopedia of female reproductive rights in the United States</em>,\nWestport, CT: Greenwood Press, 64–66.</li>\n<li>Asch, A. &amp; Geller, G., 1996. “Feminism, bioethics and\ngenetics.” in S.M. Wolf (ed.), <em>Feminism and bioethics:\nBeyond reproduction</em>, New York: Oxford University\nPress, 318–350.</li>\n<li>Asch, A., Gostin, L. O., &amp; Johnson, D. M., 2003.\n“Respecting persons with disabilities and preventing disability:\nIs there a conflict?”, in S. Herr, L. O. Gostin, and H.\nH. Koh (ed.), <em>Different But Equal: The Rights of People with\nIntellectual Disabilities</em>, New York: Oxford\nUniversity Press, 319–346.</li>\n<li>Baier, A., 1986. “Trust and Antitrust”,\n<em>Ethics</em>, 96(2): 231–260.</li>\n<li>–––, 1987. “The Need for More Than\nJustice,” in M. Hanen, and K. Neilson (eds.), <em>Science,\nMorality, and Feminist Theory</em>, <em>Canadian Journal of\nPhilosophy</em>, supp. vol. 13: 41–56.</li>\n<li>Barron,K, 1997. “The Bumpy Road To Womanhood”,\n<em>Disability &amp; Society</em>, 12(2): 223–239.</li>\n<li>Barton, L., 1989. <em>Disability and Dependence</em>, Lewes:\nFaimer Press.</li>\n<li>Becker, L., 1996 “Trust As Noncognitive Security About\nMotives,” <em>Ethics</em>, 107(1): 43–61.</li>\n<li>–––, 2005. “Reciprocity, Justice, and\nDisability,” <em>Ethics</em>, 116(1): \n9–39.</li>\n<li>–––, 2012. <em>Habilitation, Health, and Agency:\nA Framework for Basic Justice</em>. New York: Oxford University\nPress.</li>\n<li>Belenky, M. F., Clinchy, N. Goldberger, L, &amp; Tarule, J. M.,\n1986. <em>Women's Ways of Knowing: The Development of Self, Voice,\nand Mind</em>, New York: Basic Books.</li>\n<li>Bhandary, A., 2010. “Dependency in Justice: Can Rawlsian\nLiberalism Accommodate Kittay's Dependency\nCritique?” <em>Hypatia</em>, 25(1): 140–156.</li>\n<li>Boorsay, A., 2005. <em>Disability and Social Policy in Britain\nSince 1750: A History of Exclusion</em>, Basingstoke, UK.:\nPalgrave.</li>\n<li>Bordo, S., 1993. <em>Unbearable Weight: Feminism, Western Culture,\nand the Body</em>, Berkeley, CA: University of California Press.</li>\n<li>Breslau, N., 1983. “Care of Disabled Children and Women's\nTime Use,” <em>Medical Care</em>, 216: 620–29.T.</li>\n<li>Butler, J. 2009. “Judith Butler with Sunaura Taylor:\nInterdepence.” ed. Astra Taylor, <em>The Examined Life:\nExcursions With Contemporary Thinkers</em>, New York: The New Press,\n185–214.</li>\n<li>Canguilhem, G., 1989. <em>The Normal and the Pathological</em>,\ntrans. Carolyn R. Fawcett &amp; Robert S. Cohen (trans.), New York:\nZone Books, originally published in France in 1968 as <em>Le Normal et\nle pathologique</em>.</li>\n<li>Carlson, L., 2001. “Cognitive Ableism and Disability\nStudies: Feminist Reflections on the History of Mental\nRetardation” <em>Hypatia</em>, 16(4): 124–146.</li>\n<li>–––, 2003. “Rethinking Normalcy,\nNormalization and Cognitive Disability,” in S. Harding and\nR. Figueroa (ed.)<em>, Science and Other Cultures: Issues in the\nPhilosophy of Science and Technology</em>, 154–171, New York:\nRoutledge.</li>\n<li>–––, 2009. <em>The Faces of\nIntellectual Disability</em>, Bloomington: Indiana University\nPress.</li>\n<li>–––, 2010. “Unmasking\nIntellectual Disability in Philosophical Discourse,”, in\nL. Carlson and E. Kittay (eds.), <em>Cognitive Disability: A Challenge\nto Moral Philosophy</em>, Boston: Blackwell Publishing.</li>\n<li>Clare, E., 1999. <em>Exile and Pride: Disability, Queerness, and\nLiberation</em>, Cambridge, MA: South End Press.</li>\n<li>Code, L., 1991. <em>What Can She Know? Feminist Theory and the\nConstruction of Knowledge</em>, Ithaca: Cornell University Press.</li>\n<li>Cohen, M. D., 1996. <em>Dirty Details: The Days and Nights of a\nWell Spouse</em>, Philadelphia, Temple University Press.</li>\n<li>Crenshaw, K. 1991. “Mapping the Margins: Intersectionality, Identity\nPolitics, and Violence Against Women of Color.” <em>Stanford Law\nReview</em>, 43(6): 1241–1299.</li>\n<li>Crow, L., 1996. “Including all of our lives: Renewing the\nsocial model of disability,” in J. Morris (ed.), <em>Encounters\nwith Strangers: Feminism and Disability</em>, 206–222, London:\nWomen's Press.</li>\n<li>Curran, A., 2013. “Diderot, an American Exemplar? Bien \nSûr!”, <em>The New York Times</em>, January 25: A27.</li>\n<li>Davis, A., 2005. “Invisible Disability”,\n<em>Ethics</em>, 116(1): 153–213.</li>\n<li>Deegan, M.J. &amp; Brooks, N., 1985. <em>Women and Disability: The\nDouble Handicap</em>, New Jersey: Transaction Press.</li>\n<li>Diderot, D., 1999 [1749]. “Letter on the Blind for the Use\nof Those Who See,” in D. Adams (ed.), <em>Thought on the\nInterpretation of Nature and Other Philosophical Works</em>,\n149–200, Manchester: Clinaman Press.</li>\n<li>Fine, M. and Asch, A., 1981. “Disabled women: Sexism without\nthe pedestal.” <em>Journal of Sociology</em> <em>and Social\nWelfare</em>, 8(2): 233–248.</li>\n<li>Fine, M. and A. Asch ed., 1988. <em>Women with Disabilities:</em>\n<em>Essays in Psychology, Culture, and\nPolitics</em>, Philadelphia: Temple University Press.</li>\n<li>Finkelstein, V., 1980. <em>Attitudes and Disabled People</em>,\nGeneva: World Health Organisation.</li>\n<li>Francis, L.P. and A. Silvers, 2007. “Liberalism and\nIndividually Scripted Ideas of the Good: Meeting the Challenge of\nDependent Agency,” <em>Social Theory and Practice</em>, 33(2):\n311–334.</li>\n<li>Fricker, M. 2009. <em>Epistemic Injustice: Power and the Ethics of\nKnowing</em>, Oxford: Oxford University Press</li>\n<li>Fuss, D., 1989. <em>Essentially Speaking: Feminism, Nature and\nDifference</em>, New York: Routledge.</li>\n<li>Gallagher, S., 2005.  <em>How the Body Shapes the Mind</em>,\nOxford: Oxford University Press.</li>\n<li>Garland, R., 1995. <em>The Eye of the Beholder: Deformity and\nDisability in the Graeco-Roman World</em>, Ithaca: Cornell University\nPress.</li>\n<li>Hanna, WJ, &amp; Rogovsky, E., 1991. “Women with\ndisabilities: two handicaps plus” <em>Disability</em>,\n<em>Handicap &amp; Society</em>, 6(1): 49–63.</li>\n<li>Herr, S., L. Gostin, and H.H. Koh., 2003. <em>The Human Rights of\nPersons with Intellectual Disabilities</em>, Oxford: Oxford University\nPress.</li>\n<li>Hoffman, S., 2003. “Corrective Justice and Title I of the\nADA,” <em>American University Law Review</em>, 52:\n1213–1289.</li>\n<li>Hume, D., 1757. “Of the Standard of Taste.”\n<em>English Essays: Sidney to Macaulay</em>, Vol. XXVII. The Harvard\nClassics. New York: P.F. Collier &amp; Son, 1909–14.  \n [<a href=\"http://www.bartleby.com/27/\" target=\"other\">Available online</a>]</li>\n<li>Kafer, A., 2005. “Hiking Boots and Wheelchairs: Ecofeminism,\nthe Body, and Physical Disability” in B. Andrew,  J. Keller and\nL. Schwartzman (eds.), <em>Feminist Interventions in Ethics and\nPolitics</em>, 131–150, Lanham, MD:Rowman and Littlefield.</li>\n<li>–––, 2013. <em>Feminist, Queer, Crip</em>,\nBloomington: Indiana University Press.</li>\n<li>Kallianes, V. &amp; Rubenfeld, P., 1997. “Disabled Women and\nReproductive Rights,” <em>Disability &amp; Society</em>, 12(2):\n203–221.</li>\n<li>Kittay, E., 1998. <em>Love's Labor: Essays on Women, Equality, and\nDependency</em>, New York: Routledge.</li>\n<li>–––, 2000. “At Home With My Daughter:\nReflections on Olmstead v. L.C.”, in L.P. Francis and A. Silvers\n(eds.), <em>Americans with Disabilities: Exploring Implications of the\nLaw for Individuals and Institutions</em>, 64–80, New\nYork: Routledge.</li>\n<li>–––, 2001. “When Care is Just and Justice\nis Caring: The Case of the Care for the Mentally Retarded”,\n<em>Public</em> <em>Culture</em>, 13(3): 557–579.</li>\n<li>–––, 2002. “Caring for the Vulnerable by\nCaring for the Caregiver: the Case of Mental Retardation”, in\nR. Rhodes, M. Battin and A. Silvers (eds.), <em>Health Care and\nDistributive Justice</em>, 290–300, Oxford: Oxford University\nPress.</li>\n<li>–––, 2005. “At the Margins of Moral\nPersonhood”, <em>Ethics</em>, 116: 100–131. \n [<a href=\"http://evafederkittay.com/wp-content/uploads/2014/11/At-the-Margins-of-Moral-Personhood.pdf\" target=\"other\">Preprint available from the author</a>]</li>\n<li>–––, 2006a. “The Idea of Care Ethics in\nBiomedicine: the Case of Disability”, in <em>Biomedicine and\nHuman Limits</em>, C. Rehman-Sutter (ed.), Amsterdam:\nSpringer-Verlag, pp. 319-339.</li>\n<li>–––, 2006b. “Beyond Autonomy and\nPaternalism: The Caring Transparent Self”, in <em>Autonomy and\nPaternalism: Between Independence and Good Intentions</em>, T. Nys,\nY. Denier, &amp; T. Vandevelde (eds.), Leuven: Peeters, pp. 23-70.</li>\n<li>–––, 2006c. “Thoughts on the Desire for\nNormality”, in <em>Surgically Shaping Children: Essays on\nTechnology, Ethics and the Pursuit of Normality</em>, E. Parens (ed.),\nBaltimore: Johns Hopins Press, pp. 90-112.</li>\n<li>–––, 2011. “The Ethics of Care,\nDependence, and Disability”,\n<em>Ratio Juris</em>, 24(1): 49–58.</li>\n<li>Kittay, E and L. Carlson, eds., 2010. <em>Cognitive Disability and\nIts Challenge to Moral Philosophy</em>, Boston: Blackwell\nPublishing.</li>\n<li>Kittay, E and E. Feder, eds., 2003. <em>The Subject of Care: Feminist\nPerspectives on Dependency</em>, Lanham, Md.: Rowan and\nLittlefield.</li>\n<li>Kittay, E., A. Silvers, and S. Wendell (eds.), 2001.\n<em>Hypatia: Special Issue on Feminism and Disability I</em>, \n16(4).</li>\n<li>–––, 2002.\n<em>Hypatia: Feminism and Disability II</em>, 17(1).</li>\n<li>Kuhse, H. and Singer, P., 1986. <em>Should the Baby Live?:\nThe Problem of Handicapped Infants</em>, New York: Oxford University\nPress.</li>\n<li>Kudlick, C. and P. Longmore, 2006. “Disability and\nthe Transformation of Historians' Public Sphere,” from the <em>Forum\non Disability</em> column, American Historical Association's\n<em>Perspectives Online</em>, 44(8): November.\n[<a href=\"http://www.historians.org/perspectives/issues/2006/0611/0611for2.cfm\" target=\"other\">Available online</a>]</li>\n<li>Lindemann, K., 2001. “Persons with Adult-Onset Head Injury:\nA Crucial Resource for Feminist Philosophers”,\n<em>Hypatia</em>, 16(4): 105–123.</li>\n<li>Lombardo, P., 2008. <em>Three Generations, No Imbeciles: Eugenics,\nthe Supreme Court, and Buck v. Bell</em>, Baltimore: The Johns Hopkins\nPress.</li>\n<li>Longino, H. 2001. <em>The Fate of Knowledge</em>, Princeton:\nPrinceton University Press.</li>\n<li>Magee, B. and M. Milligan., 1996. <em>On Blindness</em>:\n<em>Letters between Bryan Magee and Martin Milligan</em>, Oxford:\nOxford University Press.</li>\n<li>McMahan, J., 1996. “Cognitive Disability, Misfortune, and\nJustice,” <em>Philosophy and Public Affairs</em>, 25(1):\n3–34.</li>\n<li>–––, 1998. “Wrongful Life: Paradoxes in\nthe Morality of Causing People to Exist,” in J. Coleman and C.\nMorris (eds.), <em>Rational Commitment and Social Justice</em>,\nCambridge: Cambridge University Press, 208–247.</li>\n<li>–––, 2005. “Causing Disabled People to\nExist and Causing People to be Disabled,” <em>Ethics</em>,\n116(1): 77–99.</li>\n<li>Meekosha, H and Pettman, J, 1991. “Beyond Category Politics”\nin <em>Hecate</em>, 17(2): 75–92.</li>\n<li>Miles, R., 1988. <em>A Women's History of the World</em>,\nLondon: Michael Joseph.</li>\n<li>Morris, J, 1991. <em>Pride Against Prejudice</em>,\nPhiladelphia: New Society Publishers.</li>\n<li>–––, 1992. “Personal and political: a\nfeminist perspective on researching physical\ndisability”, <em>Disability, Handicap and Society</em>, 7(2):\n157–66.</li>\n<li>–––, 1993. <em>Independent Lives</em>, New York:\nMacmillan.</li>\n<li>–––, 2001. “Impairment and Disability:\nConstructing an Ethics of Care that Promotes Human\nRights,” <em>Hypatia</em>, 16(4): 1–16.</li>\n<li>Narayan, U., 1997. <em>Dislocating Cultures</em>, New York:\nRoutledge.</li>\n<li>Nicki, A., 2001. “The Abused Mind: Feminist Theory, Psychiatric\nDisability, and Trauma,” <em>Hypatia</em>, 16(4): 80–104.</li>\n<li>Nussbaum, M., 2001. “The Enduring Significance of John Rawls”,\n<em>The Chronicle of Higher Education</em>, Section 2, July\n20: B7–B9.</li>\n<li>–––, 2002. “Capabilities and\nDisabilities”, <em>Philosophical Topics</em>, 30(2):\n133–165.</li>\n<li>–––, 2006. <em>Frontiers of\nJustice</em>, Cambridge: Harvard University Press.</li>\n<li>Oliver, M., 1983. <em>Social Work with Disabled People</em>,\nLondon, Macmillan.</li>\n<li>O'Neil, J., 2003. “Vital Signs; the Senses; No Vision,\nBut Better Memory.” <em>The New York Times</em>, June\n17<sup>th</sup>.\n [<a href=\"http://query.nytimes.com/gst/fullpage.html?res=9B0DEED81538F934A25755C0A9659C8B63\" target=\"other\">Available online</a>]</li>\n<li>Parens, E. and A. Asch, 1999. “The Disability rights\nCritique of Prenatal Genetic Testing: Reflections and\nRecommendations,” <em>Hastings Center Report</em>, 29(5):\nS1-22.</li>\n<li>Paris, J., M. Schreiber and A. Elias-Jones, 2005.\n“Resuscitation of the Preterm Infant Against Parental\nWishes,” <em>Archives of Disease in Childhood, Fetal\nNeonatal Edition 90</em>, no. 3, May, F208–F210.</li>\n<li>Pateman, C., 1988. <em>The Sexual Contract</em>,\nStanford: Stanford University Press.</li>\n<li>Purdy, L., 1995. “Loving Future People”, In J. Callahan\n(ed.), <em>Reproduction, Ethics and the Law</em>, Bloomington, IN:\nIndiana University Press.</li>\n<li>Putnam, R.A., 1993. “Commentary on Michael Walzer:\nObjectivity and Social Meaning,” in M. Nussbaum and A. Sen\n(eds.), <em>The Quality of Life</em>, 178–184), Oxford, Clarendon\nPress.</li>\n<li>Rawls, J., 1985. “Justice as Fairness: Political not\nMetaphysical”, <em>Philosophy &amp; Public Affairs</em>,\n14(3): 223–251.</li>\n<li>Ruddick, S., 1989. <em>Maternal Thinking: Toward a Politics of\nPeace</em>, Boston: Beacon Press.</li>\n<li><em>Schroer v. Billington</em>, 2006. 424 F. Supp. 2d 203 212\n(D.D.C.)</li>\n<li><em>Schroer v. Billington</em>, 2009. No. CIV.A. 05-1090,2009 WL\n1543686, at *5(D.D.C. Apr 28, 2009)</li>\n<li>Scully, J. L., 2008. <em>Disability Bioethics: Moral Bodies, Moral\nDifference</em>, Lanham, Maryland: Rowman and Littlefield.</li>\n<li>Sherwin, S., 1992. <em>No Longer Patient: Feminist Ethics and Health\nCare</em>, Philadelphia, PA: Temple University Press,.</li>\n<li>Shildrick, M. and J. Price, 1998. eds. <em>Vital Signs:Feminist\nReconfigurations of the Bio/logical Body</em>, Edinburgh:\nEdinburgh University Press.</li>\n<li>Silvers, A., 1995. “Reconciling Equality To Difference:\nCaring (F)or Justice For People With\nDisabilities”, <em>Hypatia</em>, 10(1): 30–55.</li>\n<li>–––, 1998a. “Women and Disability”,\nin Jaggar, A. &amp; Young, I.M. (eds.), <em>Blackwell's Companion to\nFeminist Philosophy</em>, 330–340, Oxford: Basil Blackwell\nLtd.</li>\n<li>–––, 1998b. “Formal Justice”, in\nA. Silversm D.  Wasserman and M. Mahowald (eds.), <em>Disability,\nDifference, Discrimination</em>, Lanham, MD:\nRowman and Littlefield, 13–145.</li>\n<li>–––, 2000. “From The Crooked Timber of\nHumanity, Beautiful Things Can Be Made”, in P. Brand (ed.),\n<em>Beauty Matters: New Theories of Beauty</em>, 197–223,\nBloomington: Indiana University Press.</li>\n<li>–––, 2003. “On the possibility and\ndesirability of constructing a neutral conception of\ndisability”, <em>Theoretical Medicine and Bioethics</em>, 25(6):\n471–487.</li>\n<li>–––, 2008. “The right not to be normal as\nthe essence of freedom,” <em>Journal of Evolution and\nTechnology</em>, 17(2): 78–84.</li>\n<li>–––, 2009. “An Essay on Modeling:\nThe Social Model of Disability,” forthcoming in\n<em>Disability</em> in the Philosophy and Medicine Series,\nC. Ralston and J. Ho (eds.), New York: Springer.</li>\n<li>Silvers, A. and Francis, L.P., 2005. “Justice Through Trust:\nDisability and the ‘Outlier Problem’ in Social Contract \nTheory,” <em>Ethics</em>, 116(1):\n40–76.</li>\n<li>–––, 2008. “Thinking About the Good:\nReconfiguring Liberal Metaphysics (or Not) for People With Cognitive\nDisabilities,” <em>Metaphilosophy</em>, 40(34):\n475–498.</li>\n<li>Silvers, A. and Stein, M.A., 2002. “Disability, Equal\nProtection, and the Supreme Court: Standing at the Crossroads of\nProgressive and Retrogressive Logic in Constitutional\nClassification”, <em>The Michigan Journal of Law Reform</em>,\n35(1&amp;2): 81.</li>\n<li>–––, 2003. “Human rights and genetic\ndiscrimination: protecting genomics' promise for public health,”\n<em>Journal of Medicine, Law and Ethics</em>, 31(3):\n377–89.</li>\n<li>Silvers, A. and Wasserman, D., 2000. “Convention and\ncompetence: Disability Rights in Sports and Education,” <em>Society</em>,\n37(1): 63–67.</li>\n<li>Silvers, A., Wasserman, D., and Mahowald, M., 1998. <em>Disability,\nDifference, Discrimination: Perspectives on Justice in Bioethics and\nPublic Policy</em>, Lanham, Maryland: Rowman and Littlefield.</li>\n<li>Soares, C., 2007. “Move over Poirot: Belgium recruits blind\ndetectives to help fight crime,” <em>The Independent</em>,\n Nov 23. \n [<a href=\"http://www.independent.co.uk/news/world/europe/move-over-poirot-belgium-recruits-blind-detectives-to-help-fight-crime-5337339.html\" target=\"other\">Available online</a>]</li>\n<li>Spelman, Elizabeth, 1988. <em>The Inessential Woman</em>, Boston:\nBeacon Press.</li>\n<li>Squatrighlia, D., 2001. “Triumph Out of Tragedy”\n<em>San Francisco Chronicle</em>, July 1, A 19, A 22.</li>\n<li>Tannen, D., 1990. <em>You Just Don't Understand: Women and Men in\nConversation</em>, New York: William Morrow.</li>\n<li>Tronto, J., 1987. “Beyond Gender Difference To A Theory of\nCare”.  <em>Signs</em>, 12(4): 644–61.</li>\n<li>–––, 1993. <em>Moral Boundaries: A Political\nArgument for an Ethic of Care</em>, London: Routledge.</li>\n<li>Union of the Physically Impaired Against Segregation (UPIAS) and\nthe Disability Alliance, 1976. <em>Fundamental Principles of\n Disability</em>, London: Union of the Physically Impaired\nAgainst Segregation.  [1978 version]\n <a href=\"http://www.leeds.ac.uk/disability-studies/archiveuk/UPIAS/fundamental%20principles.pdf\" target=\"other\">available online</a>]</li>\n<li>Wendell, S, 1989. “Toward A Feminist Theory of\nDisability”, <em>Hypatia</em>, 4(2):\n104–124.</li>\n<li>–––, 1996. <em>The Rejected Body: Feminist\nPhilosophical Reflections on Disability</em>, London: Routledge.</li>\n<li>–––, 2001. “Unhealthy Disabled: Treating\nChronic Illnesses as Disabilities”, <em>Hypatia</em>, 16(4):\n17–33.</li>\n<li>Whitney, S.Y., 2011. “Dependency Relations: Corporeal\nVulnerability and Norms of Personhood in Hobbes and\nKittay”.  <em>Hypatia</em>, 26(3): 554–574.</li>\n<li>Young, I. M., 1980. “Throwing \nLike a Girl: A Phenomenology of\nFeminine Body Comportment, Motility and Spatiality,” <em>Human\nStudies</em>, 3(1): 137–56.</li>\n<li>–––, 1990a. <em>Justice and the Politics of\nDifference</em>, Princeton, NJ: Princeton University Press.</li>\n<li>–––, 1990b. <em>Throwing Like a Girl and Other\nEssays in Feminist Philosophy and Social Theory</em>, Bloomington:\nIndiana University Press.</li>\n<li>–––, 1997. “Asymmetrical Reciprocity: On\nMoral Respect, Wonder, and Enlarged\nThought” <em>Constellations</em>, 3(3): 340–363.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "affirmative action",
            "autonomy: in moral and political philosophy",
            "civil rights",
            "cloning",
            "contractarianism",
            "equality",
            "feminist philosophy",
            "feminist philosophy, interventions: bioethics",
            "feminist philosophy, interventions: ethics",
            "feminist philosophy, interventions: social epistemology",
            "identity politics",
            "information technology: phenomenological approaches to ethics and",
            "mental disorder",
            "parenthood and procreation",
            "repugnant conclusion, the",
            "rights",
            "social minimum [basic income]"
        ],
        "entry_link": [
            {
                "../affirmative-action/": "affirmative action"
            },
            {
                "../autonomy-moral/": "autonomy: in moral and political philosophy"
            },
            {
                "../civil-rights/": "civil rights"
            },
            {
                "../cloning/": "cloning"
            },
            {
                "../contractarianism/": "contractarianism"
            },
            {
                "../equality/": "equality"
            },
            {
                "../feminist-philosophy/": "feminist philosophy"
            },
            {
                "../feminist-bioethics/": "feminist philosophy, interventions: bioethics"
            },
            {
                "../feminism-ethics/": "feminist philosophy, interventions: ethics"
            },
            {
                "../feminist-social-epistemology/": "feminist philosophy, interventions: social epistemology"
            },
            {
                "../identity-politics/": "identity politics"
            },
            {
                "../ethics-it-phenomenology/": "information technology: phenomenological approaches to ethics and"
            },
            {
                "../mental-disorder/": "mental disorder"
            },
            {
                "../parenthood/": "parenthood and procreation"
            },
            {
                "../repugnant-conclusion/": "repugnant conclusion, the"
            },
            {
                "../rights/": "rights"
            },
            {
                "../social-minimum/": "social minimum [basic income]"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-disability\" target=\"other\">How to cite this entry</a>.",
            "<td valign=\"top\"><img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-disability/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<td valign=\"top\"><img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminism-disability&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<td valign=\"top\"><img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/feminism-disability/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-disability": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminism-disability/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminism-disability&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/feminism-disability/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Sen, A., 2004. \n“<a href=\"http://siteresources.worldbank.org/DISABILITY/Resources/280658-1172606907476/DisabilityDevelopmentWB.doc\" target=\"other\">Disability and Justice</a>”\n(see Attachment 2 to the Word document “Disability and\nDevelopment and The World Bank”). This is Sen's address to\nWorld Bank Disability &amp; Inclusive Development Conference,\nWashington, D.C., November 30–December 1, 2004.",
            "Tresniowski, A. and R. Arias, 2006, \n“<a href=\"https://people.com/archive/the-boy-who-sees-with-sound-vol-66-no-4/\" target=\"other\">The Boy Who Sees with Sound</a>,” \n<em>People</em>, July 14 (updated July 24)."
        ],
        "listed_links": [
            {
                "http://siteresources.worldbank.org/DISABILITY/Resources/280658-1172606907476/DisabilityDevelopmentWB.doc": "Disability and Justice"
            },
            {
                "https://people.com/archive/the-boy-who-sees-with-sound-vol-66-no-4/": "The Boy Who Sees with Sound"
            }
        ]
    }
}