{
    "url": "feminist-science",
    "title": "Feminist Perspectives on Science",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Sharon Crasnow\n<sharon.crasnow@norcocollege.edu>",
        "author_links": [
            {
                "mailto:sharon%2ecrasnow%40norcocollege%2eedu": "sharon.crasnow@norcocollege.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nSharon Crasnow\n&lt;<a href=\"mailto:sharon%2ecrasnow%40norcocollege%2eedu\"><em>sharon<abbr title=\" dot \">.</abbr>crasnow<abbr title=\" at \">@</abbr>norcocollege<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 23, 2009",
        "substantive revision Tue Nov 24, 2020"
    ],
    "preamble": "\n\nThere are a variety of ways that feminists have reflected upon and\nengaged with science critically and constructively each of which might\nbe thought of as perspectives on science. Feminists have detailed the\nhistorically gendered participation in the practice of\nscience—the marginalization or exclusion of women from the\nprofession and how their contributions have disappeared when they have\nparticipated. Feminists have also noted how the sciences have been\nslow to study women’s lives, bodies, and experiences. Thus from\nboth the perspectives of the agents—the creators of scientific\nknowledge—and from the perspectives of the subjects of\nknowledge—the topics and interests focused on—the sciences\noften have not served women satisfactorily. We can think of these\nperspectives as generating two types of equity issues: limitations on\nthe freedom to participate as reflected in the historical\nunderrepresentation of women in the scientific professions and the\nrelative lack of attention to research questions relevant to\nwomen’s lives.\n\nFeminist perspectives encompass more than equity issues however. They\nextend to questions about the methodology, epistemology, and ontology\nof scientific inquiry as well. Feminists have scrutinized explicit\nways that scientific research has been affected by sexist and gendered\npresuppositions about the subject matter and the methods appropriate\nto the sciences. Such investigations have sometimes revealed how\nscientific practice has failed to meet standards of good science.\nAdditionally, and more radically, feminists have questioned\ntraditional methodologies and offered alternative approaches better\nsuited to feminist subject matter and goals. Feminist perspectives on\nscientific knowledge production have been constructive where\ncriticisms have motivated alternative conceptualization of subject\nmatter, greater attention to the goals of scientific research, and\nreflection on the epistemological and ontological commitments of\nmethodology.\n\nMost generally feminists are united in urging recognition of the\nsocial contexts in which scientific research takes place and\nscientific knowledge is received. As such, feminist approaches to\nscience are situated in broader movements in philosophy of science and\nscience studies that emerged during the second half of the twentieth\ncentury. Such approaches acknowledge and explore the social nature of\nscientific knowledge (for example: Kuhn 1962 [1970]; Longino 1990,\n2002; Kitcher 1993, 2001; Solomon 2001). Additionally, they are\nsituated in the liberatory movements of the 1960s and 1970s. As the\nparticipation of women in the sciences increased in the second half of\nthe twentieth century, the effects of the absence of women as\nresearchers and women’s lives as subjects of knowledge were more\nreadily apparent. The coinciding feminist movements during the same\nperiod provided frameworks through which to theorize these lacunae and\nunderstand them as aspects of oppression.\n\nWhile the discussion thus far might suggest that feminists are a\nunited group whose perspectives differ only over their focus that is\nnot the case. Feminists vary among themselves in their political goals\nas well as in their epistemic and ontological commitments (see\n Feminist Philosophy).\n Not all feminisms are the same and consequently this is an additional\ndimension on which perspectives on science differ. Feminist philosophy\nof science and science studies is now a mature area of research and\nsubtle, internal debates reflect this. Even so it is possible to\nidentify some general areas of agreement. Minimally, feminist\nperspectives on science start from the premise that the question of\nwhether sex/gender matters to the production of scientific knowledge\nshould be taken as an open question. It cannot be assumed to be\nirrelevant as it so often was in the past. The question of how,\nwhere, why, and when gender is relevant is where various\nfeminist views differ. Additionally, the sciences themselves vary and\nso how they are viewed, which are deemed most relevant to feminism and\naffected by sex/gender and in what ways they might be affected is not\nlikely to be uniform. Accordingly, this entry seeks to capture\nfeminist perspectives both from the different political, epistemic,\nand social locations through which feminists view science as well as\nfrom the differences in focus feminists have when considering\nscientific knowledge production. That being said, it should be noted\nthat the entry prioritizes the social and life sciences when\ndiscussing subject matter (although not when discussing the\nparticipation of women in the science professions). This is because\nfeminists have been most active in investigating the operation of\nsexist assumptions in the social and life sciences. It should also be\nnoted that the philosophical perspective of this entry is\npredominantly Anglo-American and so does not include an analysis of,\nfor example, feminist approaches in the tradition of Continental\nphilosophy or careful consideration of issues that affect the global\nSouth. There are likely other lessons to learn from how feminist\napproach science in these other cultural, social, and historical\ncontexts. Some recent work by Sandra Harding on Latin American science\nstudies offers an example of how such differences in context matter\n(Harding 2017, 2019).\n",
    "toc": [
        {
            "#EquiIssu": "1. Equity Issues"
        },
        {
            "#WomeScie": "1.1 Women in the sciences"
        },
        {
            "#ScieStudWome": "1.2 Sciences Studying Women"
        },
        {
            "#FemiCritScie": "2. Feminist Critique of Science"
        },
        {
            "#FemiScieElimSexiValu": "2.1 Feminist Science as the Elimination of Sexist Values"
        },
        {
            "#CritConcBackAssu": "2.2 Critique of Concepts and Background Assumptions"
        },
        {
            "#FemiMeth": "3. Feminist Methodology"
        },
        {
            "#FemiPhilScie": "4. Feminist Philosophy of Science"
        },
        {
            "#FemiEmpiHoli": "4.1 Feminist Empiricist Holism"
        },
        {
            "#Obje": "4.2 Objectivity"
        },
        {
            "#FemiStanTheo": "4.3 Feminist Standpoint Theory"
        },
        {
            "#QueeScieStudNewMate": "5. Queer Science Studies and the New Materialisms"
        },
        {
            "#QueeScieStud": "5.1 Queer Science Studies"
        },
        {
            "#NewMate": "5.2 The New Materialisms"
        },
        {
            "#ReceAreaStudBraiHumaBeha": "6. Recent Areas of Study: The Brain and Human Behavior"
        },
        {
            "#Neur": "6.1 Neurofeminism"
        },
        {
            "#CognScie": "6.2 Cognitive Science"
        },
        {
            "#Conc": "7. Conclusions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#AddiRead": "Additional Readings"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Equity Issues\n\nEquity issues in the sciences often focus on underrepresentation.\nHowever, equity in any field has different causes and manifestations.\nThinking of equity as a matter of “how many” from the\ngroup in question participate is important insofar as it may reflect\ninjustices in access to science education, employment, or promotion.\nThese issues of social justice are a core element of feminism, but\nthey do not exhaust it.\n\nSmall numbers are indicative of other equity issues that feminists\nhave explored. The connection between who it is that participates in\nknowledge production and the nature of the knowledge produced is one.\nThis connection has both negative and positive aspects. On the\nnegative side, the unwarranted biases of researchers who share\nunexamined and unsupported assumptions go unchallenged when those who\nhave experiences conflicting with those assumptions are excluded. This\npoint is addressed in literature on the epistemic value of diversity.\nAs Kristen Intemann puts it \n\n\nby including individuals from relevantly diverse social positions, the\nresulting epistemic community will be comprised of scientists informed\nby diverse experiences that can increase the rigor of scrutiny brought\nto background assumptions, theories and models. (Intemann 2011: 126)\n\n\n\nOn the positive side, when such differences in experiences are\nincluded in the research process it may increase the quality and\nrelevance of the knowledge produced. Exploration of how this is so is\none way in which feminist perspectives have contributed to the growing\nawareness of the social nature of scientific knowledge (Intemann 2009,\nRolin 2006, Fehr 2011).\n\nWhile social justice concerns about equity are best understood as\ninseparable from epistemic concerns, this entry begins by considering\nthem individually with a focus on some specific aspects of equity\nissues. A more expansive and detailed account of the history of how\nthese issues have been addressed can be found in an earlier iteration\nof Feminist Perspectives on Science in the archives (Crasnow et al.\n2015 [2018]).\n1.1 Women in the Sciences\n\nAlthough there have always been women interested in the world in ways\nthat came to be identified as scientific, their participation has\nneither been uniformly encouraged nor consistently acknowledged. The\nrelative absence of women from the history of science, the low numbers\nof women formally participating in science prior to the twentieth\ncentury, and the continuing difficulties of many women in those fields\neven after they entered in significant numbers—lower promotion\nrates, lower wages, and lesser positions than men in the\nfield—are one focus of feminist attention. Feminist approaches\nhave included efforts to publicize the role of women in the past\n(e.g., the History of Women in Philosophy and Science, Paderborn\nUniversity), increase the participation of women and girls in science\nthrough education (for example, the ADVANCE initiative discussed in\ngreater detail in Crasnow et al. 2015 [2018]), and to identify factors\nthat create barriers to women persisting or advancing in the\nsciences.\n\nSandra Harding describes projects that reveal various ways in which\nwomen involved in science have been overlooked or forgotten as\n“women worthies” projects (Harding 1986). Such projects\ninvolve discovering and honoring women who were overlooked or\nforgotten in the history of science. There are multiple motivations\nfor such projects. One is simply the desire to correct the historical\nrecord and give women contributors their due. Another aim is to\nencourage future participation by girls and women. If one reason for\nthe historically low participation of women in the sciences is that\nstereotypes of women conflict with their ability to imagine themselves\nas scientists, then countering such stereotypes is one way to alter\nthat circumstance.\n\nPersistently low participation—or the appearance of low\nparticipation because of the invisibility of women—lends support\nto a problematic schema. Schemas are “hypotheses that we use to\ninterpret social events” (Valian 1999: 103)—in this case,\nthe hypothesis that girls and women are not suited to the pursuit of\nscientific knowledge. The cultural milieu in which girls and women\nfind themselves pursuing science is one in which stereotype threat\n(Steele 1997) is just one of the many challenges they must face.\nStereotype threat is the activation of internalized negative\nstereotypes, so that when the subject is reminded of their belonging\nto the stereotyped group their performance is affected so that it is\nconsistent with the stereotype. Girls reminded that they are girls\nperform less well on mathematics tests when the dominant stereotype is\nthat “girls don’t do math”. Thus it can be part of a\ncycle that helps perpetuate the low numbers through impacting scores\non tests and in classes that function as entry points to science\ncareers. However, there is evidence that counterexamples—such as\nthe awareness of successful women in these fields—can diminish\nthis effect thus potentially ending the cycle.\n\nThere is certainly reason to think that such projects are worthwhile,\nhowever they do not fundamentally alter the nature of the disciplines\nin question on their own. Harding describes these projects as part of\na progression in feminist approaches to science in order to contrast\nthem with later conceptual critiques of the sciences in both feminist\nscience and feminist philosophy of science. According to this\nnarrative feminist critique moves from a discussion of women worthies\nto a deeper examination of the features of scientific knowledge\nproduction. While the progressive story is appealing, looking back on\nthe past 30 years it would seem that the need for rewriting history to\ninclude women has not vanished and, while there have been many\npositive changes, some of which have been spurred by feminist\ncritique, work remains to be done to address remaining inequities. The\nuptake of many feminist ideas about who should do science, what\nscience ought to study, and how such research should be carried out\nhas been disappointingly slow. Although a greater number of women\nattain both undergraduate and graduate degrees in science fields than\never before, their participation in the science and engineering\nworkforce remains comparatively low at roughly 28% when considering\nall disciplines (Science and Engineering Indicators, National\nScience Board 2018: chapter 3, 3-106). Additionally, there is a\npersistent wage gap (decreasing with higher levels of education, but\nnonetheless remaining even as level of education increases).\n\nThe 2010 American Association of University Women (AAUW) report,\nWhy So Few? Women in Science, Technology, Engineering, and\nMathematics identified three themes that persist in conventional\nexplanations of the gender disparities in STEM fields. The first is\nthe idea that there are innate sex-linked differences in\ntalent—specifically that men typically have better mathematical\nand spatial skills required for success in STEM fields. The second is\nthe idea that both drive and preferences differ by gender—that\ngirls are simply less interested in STEM disciplines and so do not\nchoose to pursue STEM careers. The third focuses on inequities related\nto the workplace, including both explicit and implicit biases within\nthe workplace and life-work balance issues that are thought to drive\nwomen out of STEM fields. These conventional themes resurface\nperiodically in the discussion of gender inequities in STEM fields\nsuggesting an inevitability of the status quo. The AAUW report\nchallenges each of these standard explanations in turn and makes\nsuggestions designed to address features of STEM education that seem\nlikely to contribute to this persistent gender disparity.\n\nThe first sort of explanation for the lower participation of women\nreflects a tension between feminism and science that will be discussed\nin more detail in\n section 2.1.\n The suggestion is that science itself reveals (or will reveal) the\ninnate differences between men and women/girls and boys that account\nfor the ability to do science. This claim is countered by challenging\nthe evidence in two ways: revealing biases in the research or noting\nthat when differences in ability appear to be present they can equally\nwell be ascribed to culture (societal influences) rather than\nnature.\n\nThe second claim also postulates gendered differences, framing them in\nterms of natural preferences rather than abilities. Again, this is\ncountered by urging consideration of culture rather than nature.\nAnother approach is to critique the language of preferences, noting\nthat the structural nature of sexism shapes researchers’\nreadings of preferences but also that what options are believed to be\navailable shapes preferences.\n\nThe third theme has received more attention recently, in part because\nit goes some way towards explaining why the increase in the number of\nwomen receiving science education has not been matched by a comparable\nincrease in their participation in the workforce. While participation\nvaries by discipline—with most of the social sciences (except\neconomics and political science) having women in the majority and the\nlife sciences close to parity—overall it remains comparatively\nlow (28% as noted previously; National Science Board 2018: chapter 3,\n3-106), particularly when more leadership or prestigious roles are\nconsidered. There is a growing awareness that\n“microinequities”—small slights and injustices that\nhave an accumulative discouraging effect over time—may play a\nrole in this low rate of participation.\n\nAlison Wylie offers an account of these subtle forms of discrimination\nas first fully acknowledged in the 1999 MIT report “A Study on\nthe Status of Women Faculty in the School of Science” (MIT\n1999). \n\n\nDiscrimination in the 1990s, …, takes the form of innumerable\nsmall differences in uptake and response…. (Wylie 2011: 157)\n\n\n\nThis report notes the challenges faced by girls and women entering\nscience fields and clarifies how they had been underestimated or\ndiscounted. Wylie’s discussion of the reception of “chilly\nclimate” reports, like the MIT report gives some insight into\nthe depressing lack of progress in the past 30 years. \n\n\nEven when systematic gender differences were successfully documented,\neither in a particular context or as a pervasive feature of academic\nlife, the critics of chilly climate studies routinely denied that they\nreflect any unfairness on the part of individuals or institutions; if\nno harm was intended, and no intent to discriminate had been\ndemonstrated, allegations of injustice were unfounded. (Wylie 2011:\n171)\n\n\nFurther evidence of the pervasiveness and structural nature of the\nchallenges that women face appear in more recent research. The 2018\nConsensus Report Study carried out under the auspices of the National\nAcademies of Science, Engineering, and Medicine, Sexual Harassment\nof Women: Climate, Culture, and Consequences in Academic Sciences,\nEngineering, and Medicine explores the extent to which women are\ndriven out of the academy through sexual harassment (Johnson et al.\n2018). The Consensus Report Study makes concrete suggestions for\nimproving the environment to prevent sexual harassment and for\nhandling cases if they do occur. The very existence of the study and\nthe felt need that gave rise to it are indicators that the equity\nissues that feminists have been concerned with have not been\nsatisfactorily addressed. Consequently, increasing the participation\nof girls and women, as well as retaining women once they enter the\nscientific professions, remain of interest to feminists.\n1.2 Sciences Studying Women\n\nAs more women entered scientific fields during the twentieth century\nthey begin to focus on a variety of phenomena that previously had been\noverlooked—phenomena present in the lives, domains, and\nexperiences of women. This point is beautifully illustrated by the\nnote that Claude Lévi-Strauss made in an article describing his\nfield work in 1936:\n\n\nthe entire village left the next day in about thirty canoes, leaving\nus alone in the abandoned houses with the women and children. (1936:\n283, translated in Eichler & Lapointe 1985: 11) \n\n\nThe anthropologist finds himself “alone” since the proper\nsubjects of research have left the village. As women entered\nanthropology they recognized those left behind as part of the fabric\nof the culture that they sought, as social scientists, to\nunderstand.\n\nNeglect was sometimes the result of lack of access. In some cultures\nmen do not have access to women and domains identified with women due\nto cultural restrictions on the interactions among genders. In other\ncases, lack of awareness or interest in the phenomena that were\nidentified as connected to women resulted in lacunae in research. In\neconomics, for example, the failure to identify the role of (mostly)\nwomen’s domestic work as labor and hence as relevant to economic\nanalysis was not a result of its invisibility—domestic labor is\npresent throughout human experience—but rather because of\nconceptualizing labor so that such unpaid domestic labor remains\noutside of the economic sphere. It was economically\ninvisible. Women economists noticed and sought to correct this\nomission by clarifying the ways in which paid labor depends upon\ndomestic support and the role this plays in capitalism (Dalla Costa\n& James 1972; Federici 1975 [2020]; Himmelweit & Mohun 1977).\nPerhaps in part because of roots in the Marxist tradition and so its\nassociation with a non-mainstream economics, this understanding of\nlabor is still not fully incorporated into economics research.\n\nAdditionally, the domination of economics by rational choice theory\npushes against treating gender and gendered social structure as\nrelevant. The conception of the economic agent in rational choice\ntheory relies on an abstract understanding of agents as guided by\ntheir preferences. Any variation in the choices made by different\ngenders must be interpreted as a matter of differences in preferences.\nEmbedded in rational choice theory’s fundamental assumption\nabout agents is the idea that gender is irrelevant to the analysis of\nhuman behavior. A number of feminist economists have noted that the\nreliance on rational choice approaches is a factor in the failure to\nincorporate feminist interests and insights into economics (see Barker\n1995; Barker & Kuiper 2003). Although behavioral economics has\nchallenged many assumptions of rational choice theory, its emergence\nas a new approach has not necessarily ameliorated the situation.\nRecent research suggests that much work in behavioral economics is\naffected by stereotypical assumptions about differences in the\nbehavior of men and women (Sent & van Staveren 2019). Thus the\nresponses to attempts to incorporate gender analyses into economics\ncan be summarized as follows: relevant gender differences are\nidentified but there is a lack uptake (domestic labor/work); gender is\ntreated as irrelevant; or when identified as relevant, sexist\nstereotypes permeate research.\n\nMedicine provides another example of the limited responsiveness of a\nfield to feminist critique. Heart disease in women was often not\nrecognized or understood primarily because the research had focused on\nmen. Although more recent research has included women, as late as 2017\nresearch on medical practice indicated that women still are not\nscreened for heart disease as regularly as men during routine health\nexaminations. In addition, 45% of women in a nationwide survey were\nunaware that heart disease is the number one cause of fatality for\nwomen (Bairey Merz et al. 2017). Since 1993 the National Institutes of\nHealth (NIH) has required that women (and minorities) be included in\nresearch projects that are NIH funded (see\n Other Internet Resources).\n However, there are problems recruiting and retaining sufficient\nnumbers of women for such research as evidenced by the literature\nreview on the topic at the NIH website. The requirement does not, in\nitself, correct gender inequities in medical research which tend to be\nmore systematic and structural.\n\nAs a final example, consider Pamela Paxton’s critique of indices\nof democracy commonly used in political science research. Paxton\nargues that often the operationalization of democracy in the most\ncommonly used indices treats one of its key indicators,\n“universal suffrage”, as universal male\nsuffrage—either implicitly or explicitly. When understood as\nincluding women’s suffrage, Paxton notes that many of the key\nclaims of research on democracy—including a standard\ninterpretation that identifies three waves of democracy—may need\nto be revised (Paxton 2000). Although decisions about how to\noperationalize a concept like democracy can have far-reaching effects\nfor theoretical explanation, this is another case where uptake has\nbeen limited. Democracy indices have not been revised following\nPaxton’s critique.\n\nThese are just three examples of how attempts to challenge content,\nwhile widely recognized as legitimate, have failed to bring about\nfundamental change. Such examples suggest that feminist goals require\nmore than the inclusion of women as researcher or their lives as\nobjects of inquiry. It is not enough to “add women and\nstir”—as has become clear in the struggle to gain parity\nin employment, education, and research. Deeper conceptual change and\ncritique of the way scientific research is structured are needed.\n2. Feminist Critique of Science\n\nIt is tempting to think that the main benefit of feminist perspectives\non science has been to identify sexist bias in science and that the\nconsequently the elimination of bias would be a sufficient corrective.\nUndeniably, there are cases where bias is the primary issue, however,\nit is not clear that its removal is sufficient to serve feminist aims.\nEven if it were, however, identifying and eliminating bias may be more\ndifficult than it might seem for a number of reasons.\n\nFirst, bias is not always easy to identify. Even with a good will,\nscientists may be unable to identify problematic background\nassumptions since such assumptions are often deeply embedded in\nresearch practices, shared by the community involved in those\npractices (the broader social milieu), and so not readily available to\nscrutiny. Bias is not simply the tendency of individuals to prefer\nparticular views or to ignore the alternatives. \n\n\n[I]t also includes unreflective assent to background assumptions\nabout, for instance, causal relationships or how natural or social\nphenomena are to be classified. (Brister 2018: 214–215)\n\n\nSecond, the idea that the best science is that which eliminates bias\nevokes an ideal of science as value-free—that is, free from\nmoral, cultural, or political values. While this conception of science\ndominated philosophy of science in the first half of the twentieth\ncentury it has since been challenged. The extent to which values may\nplay a legitimate role, when, and in what aspects of science, has been\nextensively explored during the past few decades (see\n feminist epistemology and philosophy of science—section\n 7, also Lacey 1999; Kincaid, Dupré, & Wylie 2007; Elliott\n2017). Feminist philosophers of science have been active participants\nin this discussion.\n\nFinally, bias has sometimes been understood as a matter of the\nidiosyncratic and irrelevant beliefs or attitudes of individual\nscientists. This understanding of bias obscures the social nature of\nscience. Scientists typically work in teams, not in isolation, and the\nframeworks within which they labor have their own social histories.\nResearchers are trained by other scientists to adopt the practices of\nthe disciplines within which they work. In addition, the assessment of\ntheir research is done within that social context. These social\naspects of science provide an intellectual architecture that both\nshapes and constrains research.\n2.1 Feminist Science as the Elimination of Sexist Values\n\nWomen entering science also absorb the culture of their disciplines\nand so their research begins with the assumptions, frameworks, and\ndominant methodology of those disciplines. If they are feminists, or\neven if they are not, they sometimes come to their work with different\ninterests and goals. These differences may be because of an awareness\nof aspects of the world that are either not of interest or invisible\nto their counterparts who are men. They may frame research through\nquestions not asked by others and see phenomena that had been\noverlooked, deemed irrelevant, or misinterpreted. They also may be\nmore likely to notice when research has been guided by assumptions\nabout the subject matter that are informed by stereotypical\nunderstandings of gender.\n\nOn the face of it, there is no reason to think that better\nimplementation of the practices of science could not correct these\nabsences or misinterpretations. One could argue that social science\nthat fails to acknowledge the fundamentally gendered nature of society\nsimply fails to be empirically adequate. However, as Judith Stacey and\nBarrie Thorne put it, \n\n\nOver time … feminists discover that many gaps were there for a\nreason, i.e., that existing paradigms systematically ignore or erase\nthe significance of women’s experiences and the organization of\ngender. This discovery … leads feminists to rethink the basic\nconceptual and theoretical frameworks of their respective fields.\n(Stacey & Thorne 1985: 302) \n\n\nDoing traditional science better but with the same basic assumptions\ndoes not eliminate many of these problems.\n\nWorries about what it would mean to “rethink basic conceptual\nand theoretical frameworks” of science were among the reasons\nthat feminist critique of science was a target of the “science\nwars” of the 1990s. As philosophers, historians, and other\nsocial scientists recognized social influences on scientific research\nand the fact that scientific communities were social entities their\naccounts threatened the notion that moral, political, cultural, or\nsocial values should not play a role in the assessment of evidence,\nthe choice of methodology, or ultimately the acceptance of\ntheories—the value-free ideal. While those embracing the ideal\nhad always recognized that some values—epistemic or cognitive\nvalues that include, for example, the commitment to the pursuit of\ntruth, the empirical adequacy of theories, the consideration of total\nevidence—do and should play a role in science, they rejected\nthat social, political, or moral values should. From the perspective\nof the value-free ideal, feminist values are precisely the sort of\nvalues that ought to be excluded.\n\nThus, we see the value-free ideal evoked in philosophical discussions\nof feminist epistemology and philosophy of science during the 1990s.\nFor example, Susan Haack describes feminist epistemology as\n“incongruous on its face” (Haack 1993: 32; for similar\nsentiments see Pinnick 1994). In response, feminist philosophy of\nscience during the 1990s was formulated as a defense against the\ncharge that forsaking the value-free ideal would undermine the\nobjectivity of science and result in a pernicious relativism.\n\nCritiques like Haack’s and Pinnick’s mischaracterized at\nleast some feminist philosophy of science and science studies from\nthis period. Not all feminists were arguing for a radical rethinking\nof science and most were committed to maintaining some notion of\nobjectivity and resisting relativism. Harding described those who\nbelieved that science was fundamentally sound and feminist goals could\nbe achieved through eliminating bias “feminist\nempiricists” (Harding 1986). The view is not, prima facie,\nimplausible. Consider the cases discussed in\n section 1.2\n from economics, medicine, and political science. The idea that unpaid\ndomestic work should figure in economic analysis could be described as\ncontributing to a more empirically adequate economics. However, such\nan analysis fails to account for the lack of uptake of feminist\ncritique in the broader discipline.\n\nFor rational choice things are a bit trickier. For the agent of\nrational choice theory gender characteristics are not considered\nrelevant and so claiming that the approach is tainted by sexist values\nmight seem difficult to defend. Nonetheless a feminist empiricist (in\nHarding’s original sense) response is possible. Rational choice\naccounts can fail in circumstances when gender is in fact a relevant\nfeature—and so in such cases accounts that do not consider\ngender fail to be empirically adequate. Empirical adequacy requires\nthat all the significant or relevant phenomena be\naccounted for. But from the feminist perspective that requirement\nraises questions: “Relevant for whom?” and “Relevant\nfor what end?” Questions of significance and relevance suggest\nthat values are unavoidable.\n\nThis is even more clear in the medical example. The failure to\nconsider women when investigating cardiac health looks like sexist\nbias in the research. This might be seen as straightforward sexism\nresulting from considering the lives of men to be more important than\nthe lives of women. However, we need not assume such overt sexism in\norder to see values at work in this case. A more nuanced analysis\nrecognizes that on average heart disease has an earlier age of onset\nin men, striking them in the “prime of life”.\nConsequently, heart disease in men has a greater impact on economic\nproductivity in a society in which gender roles proscribe that men are\nin the workforce to a greater extent than women—as has\nhistorically been the case in the industrialized north. The value\nplaced on the lives of (younger) men as opposed to (older) women is\nreflected in the prioritizing of research on men. The impact of heart\ndisease on the economy because it affected more men of working age\nthan women, is a reflection of the gendered structure of the economy.\nUnderstanding such priorities requires identifying how values are\nimplicit in research decisions.\n\nWhat researchers (and the society in which they are embedded) take to\nbe important, and so, what they investigate, always sits in the\nbackground. The questions that are asked, what counts as evidence, and\nultimately what counts as knowledge, is dependent on those interests.\nEliminating bias in science does not mean eliminating interests.\n\nWhile there is general agreement that science improperly informed by\nunexamined sexist assumptions is bad science, current thinking is that\nwhat makes it bad is less that it incorporates values but rather that\nthe values that it incorporates either are the wrong ones (Kourany\n2010), are used in the wrong way (Anderson 2004), or are adopted\nuncritically (Longino 1990). These differing feminist attitudes\ntowards the role of values as they appear in feminist philosophy of\nscience will be discussed in more detail in\n section 4.2.\n2.2 Critique of Concepts and Background Assumptions\n\nOne reason why eliminating bias sometimes involves more than merely\ndoing science better is that gender assumptions are not always\napparent to the researchers that are in their thrall. For example,\ngender assumptions sometimes enter scientific research through\nmetaphor. Some early feminist critique emphasized this avenue\n(Merchant 1980/1990; Keller 1985; Spanier 1995). When their\nunderstanding of the objects of inquiry is shaped through unexamined\ngendered metaphors, scientists risk misdescribing and consequently\nmisunderstanding the material world. Additionally, metaphors often aid\nin the reproduction or reinforcement of unequal power relations by\ncarrying sets of associated expectations with them.\n\nEvelyn Fox Keller offers the following example. The understanding of\novum/sperm reproduction was shaped (wrongly) by thinking of the sperm\nas masculine and the ovum as feminine. The projection of human gender\nexpectations onto the gametes resulted in an assumption that the ovum\nwas passive (as women stereotypically are) and the sperm active (as\nmen stereotypically are). Writing in 2001, Keller recounts a shift to\nthe recognition of an active role for both gametes: \n\n\nThe story provides a powerful lesson. It illustrates the ways in which\nlanguage can shape the thinking and acting of working\nscientists—that is, by framing their attention, their\nperception, and, accordingly, the fields in which they can envision\nexperiments that might be useful to undertake. (Keller 2001: 106)\n\n\nMetaphors may signal hidden assumptions that play a role in\nidentifying what counts as relevant evidence. Sarah Richardson exposes\nand explores projective attributions of gender in the ways that\nstereotypical ideas about male and female traits shape research on\nchromosomes and sex determination. She argues that \n\n\n[f]rom the earliest theories of chromosomal sex determination to the\nmidcentury hypothesis of the aggressive XYY supermale, the\nlongstanding belief that the X is the “female chromosome”,\nand the recent claim that males and females have “different\ngenomes”, cultural gender conceptions have influenced the\ndirection of sex chromosome genetics. (Richardson 2013: 2) \n\n\nAs one example of the effects of this projection she discusses the\nfailed supermale hypothesis—the idea that XYY males have more\n“maleness” in virtue of having two Y chromosomes.\nSupermales were hypothesized to be, among other things, more\naggressive. Their greater numbers in both psychiatric and correctional\ninstitutions seemed to support this. The gendering of the Y\nchromosome—thinking of it as having stereotypically male\ntraits—supported a flawed transitive reasoning: Y distinguishes\nmaleness, males with double Y should have more (double?) maleness\n(e.g., aggression). The result was not only a false conclusion but a\nfailure to examine evidence that did not support the hypothesis. For\nexample, institutional populations also contain a disproportionate\nnumber of XXY males. Using the same gender stereotypical reasoning,\nthis evidence would be inconsistent with the supermale hypothesis.\nUltimately the hypothesis was discredited for a variety of reasons,\nbut this “embarrassment” in chromosomal sex determination\nresearch is only one example of how assumptions about gender can shape\nunderstanding of the object of inquiry. Richardson argues that such\nareas of research carry with them “gender valence”—a\nmore nuanced projective gendering of the subject matter that is more\nsubtle than what is typically referred to as “gender\nbias”.\n\nMetaphor is not the only avenue through which projections occur.\nAssumed similarity of the experience of men and women and the further\nassumption that the experiences of men are the norm is another.\nElisabeth Lloyd’s extended case study of accounts of female\norgasm illustrates how an assumption of this sort can prevent the\nconsideration of relevant evidence (Lloyd 2005). She examines 21\naccounts (hypotheses) proposed for giving an evolutionary explanation\nfor female orgasm—a seeming anomaly in that it does not appear\nto be necessary for reproduction. Of these, only one (the byproduct\naccount proposed by Donald Symons in 1979) incorporates a key piece of\nevidence—that many women do not experience orgasm with\nintercourse and many women do experience orgasm without\nintercourse.\n\nShe reviews the accounts and identifies two background assumptions\nthat inform all accounts except Symons’s. They are: the\nadaptationist assumption that \n\n\nnatural selection, rather than other evolutionary forces, directly\nshaped the trait into its present form, or that natural selection is\ncurrently maintaining the trait in the population….(Lloyd 2005:\n230) \n\n\nand \n\n\nthe androcentric assumption that males are taken to be the normal type\nor the exemplar. \n\n\nThe second of these has the problematic result that “to the\nextent that they differ from the male type, females are\ninvisible” (Lloyd 2005: 233). She takes these background\nassumptions to be responsible for the failure to consider the evidence\nthat human females do not consistently achieve orgasm with intercourse\nand do achieve orgasm without intercourse. She argues that any account\nthat does not explain this anomalous evidence should be considered\nproblematic.\n\nAlthough Symon’s account is not without problems, Lloyd argues\nthat it fits the evidence better than the alternatives. Symons\nproposes that female orgasm is a byproduct of evolution rather than a\nresult of natural selection, a hypothesis that he is able to consider\nbecause he is not assuming that orgasm in females must serve a\nreproductive function since it does in males. His explanation for\nfemale orgasm is that the biological development of males and females\nis parallel so that the features that lead to orgasm in males (nerves,\nerectile tissues, etc.) are also present in females, but not always\nactivated. Female orgasm is thus a byproduct of human evolution in\nmuch the same way that male nipples are a byproduct and just as the\nmale nipples play no role in human reproduction neither does female\norgasm.\n\nLloyd argues that the inclusion of sexist values (the androcentric\nunderstanding of orgasm) prevent the consideration of the available\ndata on female orgasm as evidence. Symons’ account does not rely\non this androcentric understanding of the phenomenon under\ninvestigation and consequently his hypothesis can both consider and\naccount for these data.\n\nThe examples offered here indicate that the way the objects of inquiry\nare understood can shape the resulting science, but the example from\nLloyd’s work also suggests that an epistemology that takes into\naccount the role of background assumptions (beliefs) in the context of\ninquiry is better equipped for thinking through how beliefs about\ngender can affect knowledge production. Both concerns point us towards\nfeminist philosophy of science, to be discussed in\n section 4.\n But first, section 3 considers the question of the appropriate\nmethods for feminist research.\n3. Feminist Methodology\n\nThe discussion of methodology in this section focuses on the social\nsciences, primarily because it is in these fields that most of the\ndebate on this topic has taken place. “Methodology” is\nunderstood following Harding’s distinction between method,\nmethodology, and epistemology. Methods are “techniques for\ngathering evidence”, whereas methodology is “a theory and\nanalysis of how research should proceed”. Epistemology is the\n“theory of knowledge or justificatory strategy” that\nunderlies the methodology (Harding 1987: 2). This three-way\ndistinction provides a framework for thinking about the relationship\namong method, methodology, and epistemology. The framework is\nreflected in sociologist Joey Sprague’s account of feminist\nmethodology. \n\n\nEach methodology is founded on either explicit or, more often,\nunexamined assumptions about what knowledge is and how knowing is best\naccomplished; together, these assumptions constitute a particular\nepistemology. That is, a methodology works out the implications of\na specific epistemology for how to implement a method. (Sprague\n2016: 5)\n\n\nSome feminists have been skeptical about the capacity of conventional\nresearch methods to address feminist interests and goals. But others\nhave chosen to use conventional methods in support of those goals.\nConsequently, a review of feminist social science gives no reason to\nthink that there are any particular methods that are distinctively\nfeminist. And indeed feminist research often uses a plurality of\nmethods or “mixed methods”—usually the combined use\nof both qualitative and quantitative methods within a single research\nproject. Nonetheless, there are elements of methodology that do seem\ndistinctly feminist. Most notable among these is the core commitment\nto “start research from the lives of women”—their\nlived experience.\n\nThe idea that research should start from the lived experiences of\nthose who are studied suggests an ethnographic approach and it is\nperhaps for this reason feminists have been thought to favor\nqualitative methods. But the frequent use of statistical\n(quantitative) methods used to support feminist goals belies this\nidea. Londa Schiebinger offers an example from primatology. In the\n1970s Jeanne Altmann (1974) used representative sampling techniques to\neffectively change research. The opportunistic sampling that this\napproach replaced failed to note the frequency and duration of\nbehavior among primates and so gave a distorted picture of primate\nlife, emphasizing high drama events centering around reproduction and\nmale conflict over commonplace events. The role of females in the\ngroup and family life had thus been overlooked (Schiebinger 1999:\n7).\n\nThe rise of quantitative methods throughout the social sciences has\nbeen associated with the idea that greater objectivity can be achieved\nthrough numerical representation (see Porter 1995 for an account of\nthe history of this view). The notion that quantitative methods are\nmore objective is again closely tied to an understanding of science as\nvalue-free and the desire to make the social sciences more\n“scientific”. In comparison qualitative methods like those\ninvolved in ethnographic research—interviews, participant\nobservation, and the like—appear to be vulnerable to\nsubjectivity. A more accurate understanding of what feminist\nmethodology is, how it relates to the choice of method, and what this\nhas to do with epistemological commitments requires a more nuanced\naccount than focusing on quantitative/qualitative divide in method can\nprovide.\n\nWhat does it mean to say a methodology is feminist? As\nSprague puts it, \n\n\nwhile feminists are a very heterogeneous group and we disagree on many\nissues, there are two points on which we have consensus: (1) gender,\nin interaction with other forms of social relations such as\nrace/ethnicity, class, ability, and nation, is a key organizer of\nsocial life; and (2) understanding how things work is not\nenough—we need to take action to make the social world more\nequitable. (Sprague 2016: 3) \n\n\nA feminist methodology is one that is shaped by and serves these\ncommitments. It requires adopting approaches and methods that are\nsensitive to the key structural elements of social life and it aims at\nproducing knowledge that can be used to further feminist goals.\nMinimally, meeting those requirements calls for starting research from\nthe lives of women—that is, starting research from the daily\nexperiences of their lives. Feminist methodological approaches are\nstrongly unified in this respect and it is this aspect of feminist\nmethodology that much feminist epistemology is responsive to. We see\nthis particularly in philosophical accounts of feminist standpoint\ntheory with its thesis that all knowledge is situated (to be discussed\nin\n section 4.3),\n but arguably all feminist epistemology calls for a recognition of the\nsituated nature of knowledge.\n\nSprague notes that qualitative methods are often thought to be better\nsuited to challenge inequalities that are apparent from “the\ndownside of the social hierarchies”—that is, from the\nlives of those who are the subjects of research (Sprague 2016: 140).\nDoing science as a feminist means paying attention to the way that\ngender structures the differential distribution of power in society\nand consequently access to the means of production of knowledge. We\nsee evidence of this in the invisibility of those who are\nmarginalized, the silencing of their voices, and the failure to\nacknowledge them as trustworthy epistemic agents—all of which\nare varieties of epistemic injustice (see\n feminist social epistemology,\n also Fricker 2007; Dotson 2011; Medina 2013). While the feminist\ncommitments that Sprague details are consistent with the idea that\nfeminist researchers are not confined to any specific methods, to\nstart from the lives of women when those lives are not among those who\nare producing knowledge or being listened to in the production of\nknowledge means that researchers should be thinking about the extent\nto which their methods will allow lived experience to be recognized as\nevidence. Consequently, feminist methodology calls for methods to be\nchosen consciously—that is, with awareness of their strengths\nand weakness in relation to the lives of those researched and\nresearcher’s feminist commitments and goals. Feminist\nmethodology is thus self-reflective in the sense that appropriateness\nof methods should always be considered.\n\nIt is not surprising then that methodological debates coincided with\nmore women entering the social sciences and finding that the tools\nthat they had been trained to use were not always adequate. In\nsociology we see several examples of this. The feminist sociologist\nMargaret DeVault altered her interview transcription practices,\nrejecting the traditional practices she had been taught, when she came\nto believe that the hesitations—the “ums”, and\n“you knows” in the responses of those she\ninterviewed—were relevant as evidence. Traditionally these would\nhave been eliminated or smoothed out in a transcription but DeVault\nfound that they often marked topics that needed to be returned to and\nreflected emotional factors that were relevant to the research\nquestions she was investigating (DeVault 1999: 78). DeVault starts\nfrom the lives of the women she studies as standpoint methodology\nurges, and in doing so she is attentive to the emotional valences of\ntheir lives (see\n section 4.3\n on standpoint theory). She chooses and adjust her methods in response\nto this guiding methodology.\n\nSociologists Dorothy Smith and Patricia Hill Collins also advocate\nstandpoint methodology. Smith notes the mismatch between the lived\nexperience of those who are researched and the concepts and methods\nsociology prescribes. She refers to this tension as producing\n“lines of fault” and urges critical feminist sociologists\nto rethink practices in order to better capture experience. Smith\ndescribes this as problematizing everyday life, with the result that\nwhat was taken to be “natural” is reassessed and\nreinterpreted (Smith 1987). Using a similar approach—starting\nfrom the lives of women in the African American communities she\nstudies—Collins finds that neither mainstream sociological\naccounts nor standard (white) feminist approaches fit the experiences\nof the women she studies—nor should they all be thought of as\nall having the same experiences (Collins 1990 [2000/2009]). Thus the\nself-reflective nature of feminist methodology directs the researcher\nto question tools (methods), assumptions about how to support\nknowledge (epistemology), and standard assumptions about the nature\nof the objects of inquiry (ontology).\n\nMethods are not neutral. They carry with them assumptions about what\nit is to produce knowledge (epistemology) and the world that they are\nused to explore (ontology). If those assumptions are flawed or not\nadequate to research goals then they can result in a failure to take\nappropriate evidence into consideration, distorting both the results\nand interpretations of research. When researchers avail themselves of\na plurality of methods, they are more likely to think through the\nbenefits and drawbacks of the various techniques and reflect on their assumptions.\n\nMethods may also carry value commitments—another reason for\nreflecting on their use. Quantitative methods in the social sciences\nare aimed at providing information about average effects in large\npopulations. When evidence is constrained by an epistemological\ncommitment to a method that only allows for evidence of average\neffects, then the method itself may result in treating characteristics\nof particular individuals as irrelevant. The methods force the\ndisappearance of differences which may be relevant with the result\nthat they may de-value minority populations or individuals. Methods\nthat produce evidence of average effects threaten to have a\ndisproportionate impact on those who are who are not\n“average” in the requisite sense.\n\nThe adept use of quantitative methods may ameliorate these worries to\nsome extent. If populations are recognized as heterogeneous then\nresearchers might engage in further research on subpopulations. Some\naspects of the problem of erasure of difference could be addressed,\nbut which characteristics indicate relevant subpopulations will\nrequire attention to the lived experience of those who are studied.\nThe need to identify relevant subpopulations reinforces a need for\npluralism regarding methods, since recognition of relevant difference\ndepends on the sort of scrutiny most frequently provided through\nqualitative methods. Recent feminist attention to intersectionality\nand the ways power differentially structures society through gender,\nrace, ability, sexuality, socioeconomic class, ethnicity, and other\nsalient features of individuals raises a further worry. It is not\nentirely clear how a subpopulation strategy can address social justice\nissues intertwined in this way. There is some recent research that\nattempts to address intersectionality. Bright, Malinsky, and Thompson\n(2016) offer one approach to examining intersectional causality, for\nexample. But intersectional effects cannot be understood as\nadditive—once again counting against reliance on exclusively\nquantitative approaches. Finally, there is the problem that further\npartitioning of the reference class may also decrease the sample size\nand thus undermine the power of the method. In any case, these worries\nfurther support the feminist intuition that methods must be chosen\nconsciously and with attention to the aims of research.\n\nIn summary, feminist methods sometimes reveal that standard\ndisciplinary conceptions of the objects of inquiry do not get at what\nis significant relative to feminist research questions. Furthermore,\nsome methods are suitable for studying large populations but not for\nrevealing what we may need to know about individuals or smaller\npopulations. (Longino makes this point as well in another context in\nPart 2 of Longino 2013.) Finally, what theory of evidence we\nhave—how we understand scientific knowledge to be\njustified—matters to how we understand the way gender matters to\nknowledge production. Thus we turn to feminist epistemology in the\ncontext of philosophy of science.\n4. Feminist Philosophy of Science\n\nAs noted in\n section 2,\n feminist philosophies of science came of age during the 1980s and\n90s, the period of the “science wars”. The\ninterdisciplinary analysis of science during this period included an\nexploration of the ways that society shaped the context of research.\nCritics interpreted this shift in interests as opening the door to\nrelativism and undermining the presumed objectivity of\nscience—an objectivity thought to be guaranteed by scientific\nmethod understood as value-free. Much early feminist philosophy of\nscience and epistemology was centered on defending the idea that\nscience informed by feminist analysis would be better science and so\nnot antithetical to the aims of science (such as the pursuit of truth)\nin the ways that critics feared. The concern of feminist philosophy of\nscience and epistemology with objectivity reflects this.\n\nSandra Harding (1986) characterized three approaches to feminist\nphilosophy of science: feminist empiricism, feminist postmodernism,\nand feminist standpoint theory. Much of the subsequent work took this\ntripartite distinction among feminist approaches as a starting point\n(see\n feminist epistemology and philosophy of science).\n In part, because of work on science and values in both feminist\nphilosophy of science and philosophy of science more broadly, the\nearly forms of feminist empiricism described in\n section 2.1\n have evolved into an empiricism that acknowledges that values may\nplay a role in science. This is reflected in a convergence of the two\ndominant Anglo-American feminist approaches of the late twentieth and\nearly twenty-first centuries—feminist empiricism and feminist\nstandpoint theory. Kristen Intemann suggests that the resulting views\nmight be labelled “feminist standpoint empiricism”\n(Intemann 2010).\n\nThe following is an account of some of the ways in which feminist\nphilosophers have responded to the challenge of acknowledging that\nsocial, political, and cultural values can play a positive role in\nscientific knowledge production.\n4.1 Feminist Empiricist Holism\n\nOne way in which feminist philosophers of science have accounted for\nthe role of values in science is through an empiricist holism. As\nMiriam Solomon has noted, many feminist empiricists were influenced by\nthe American pragmatists of the second half of the twentieth century,\nparticularly Wilfred Sellars, Willard van Orman Quine, and Donald\nDavidson. Among the similarities that result from this influence is\ntheir naturalized approach to the philosophy of science, in that they\nbase their accounts on the knowledge practices of the sciences on\nwhich they focus. They are empiricists in taking experience as the\nultimate arbitrator of our beliefs; they are holists in that they take\nbeliefs to answer to experience as whole—in Quine’s\nphrase, as a “web of belief”—rather than\none-by-one.\n\nLynn Hankinson Nelson (1990) is explicit in her debt to Quine, others\nare less so. Longino’s contextual empiricism, discussed in\ndetail elsewhere (see the entries on\n feminist epistemology and philosophy of science,\n feminist social epistemology,\n the social dimensions of scientific knowledge,\n and briefly in this entry in\n section 4.2),\n is one of the most influential of these approaches and differs from\nother empiricist approaches, most notably in the role that she\nascribes to values and how she believes that differences in values\nshould be adjudicated (Longino 1990, 2002). Other versions of holism\nappear in the work of Lynn Hankinson Nelson (1990), Elizabeth Anderson\n(1995a, 2004), and Sharyn Clough (2003a, 2003b, 2012) all of whom,\nunlike Longino, argue that values should answer to empirical evidence.\nSolomon has dubbed the latter approach “feminist radical\nempiricism” (Solomon 2012: 435).\n\nSince it is clear that problematic sexist values can distort science\n(see the examples discussed previously in\n section 2)\n much of the work of feminists exploring the role of values in science\nfocuses instead on the distinction between legitimate and illegitimate\nuses of values, and also on the legitimacy of the values\nthemselves.\n\nAnderson argues that values are used legitimately when they are used\nnon-dogmatically. As an illustration she offers an analysis of Abigail\nStewart et al.’s (1997) research on divorce (Anderson\n2004)—research that was explicitly guided by feminist values in\na variety of ways. According to Anderson, the values that Stewart and\nher team of researchers brought to their investigation are of the sort\nthat are answerable to empirical evidence—the evidence of\nemotional states.\n\nAnderson examines how background values function at various stages of\nStewart et al.’s research: the framing of research questions,\nthe understanding of the objects of inquiry, the making of decisions\nabout what data to collect, the generation and sampling of data, the\nanalysis of the data including the choice of technique for analysis,\ndecisions about when to end data analysis, and what conclusions are\ndrawn. To illustrate, consider just one of these stages—the way\nthat values enter into understanding the objects of inquiry.\n\nIn the case of studying divorce, there are a variety of such objects\nthat need to be considered, but prominent among these are\n“divorce” and “family”. Stewart’s\nresearch team identifies these objects of inquiry as\n“thickly” described—meaning that values are\nincorporated into their descriptions. Anderson notes that, for\nexample, Stewart’s team understanding of divorce incorporated\ndifferent values than those used in Judith Wallerstein and Joan\nKelly’s research (Wallerstein & Kelly 1980). For Wallerstein\nand Kelly loss and trauma are fundamental aspects of divorce.\nStewart’s team, in contrast, took divorce to be a process of\nadjustment to a new state. On this alternate understanding divorce is\nnot treated as a one-time event with an aftermath but rather as an\nongoing life adjustment. This framing also treats the process of\nadjustment as open-ended allowing for both positive and negative\neffects. Wallerstein and Kelly’s framing of divorce as a trauma\nor loss calls for researchers to focus on the negative effects and so\nshapes the data collection. Both studies incorporate values, however\nonly Stewart et al.’s values are explicitly acknowledged and\nself-consciously present and thus, open to empirical scrutiny.\n\nAnderson evaluates Stewart et al.’s work as better science\nbecause it is more empirically adequate.\n\nShe argues that since Stewart’s conception of divorce allows for\nboth negative and positive experiences to count as evidence of the\neffects of divorce, the way Stewart’s team conceptualizes\ndivorce as an object of inquiry allows for a consideration of all of\nthe evidence. Wallerstein and Kelly’s research focuses only on\nthe negative effects and consequently is less empirically adequate.\nThus Anderson argues that in this case the feminist values\nincorporated into the research produce more empirically adequate, and\nhence better, science. Anderson also notes that because the values in\nWallerstein and Kelly’s account are not explicitly identified\nthey are not open to empirical examination. They are consequently held\ndogmatically, whereas Stewart et al.’s are explicit and so open\nto empirical test. In this way, she argues that values are not\nproblematic for science per se, but become problematic when\nheld dogmatically.\n\nSharyn Clough also argues for a legitimate role for values in science,\ncontending that they are subject to the same sort of empirical\nevidence that other beliefs are. She takes Donald Davidson’s\naccount of belief formation as her starting point. For Clough,\n“some political claims (e.g., feminist claims) are better\nsupported by empirical evidence than others” (2003b: 4). Sexist\nand racist values, for example, are not well-supported by evidence and\nhence science that is sexist and racist is clearly not good science\n(Clough 2003a; Clough & Loges 2008).\n\nClough agrees with Anderson that feminist values can improve science\nand offers an illustration in her analysis of research on the hygiene\nhypothesis—the hypothesis that increased levels of concern about\nsanitation and the consequent decrease in exposure to micro-organisms\nand pathogens is causally related to increasing rates of auto-immune\ndisease and allergies, particularly in the industrialized nations of\nthe North and West (Clough 2011, 2012). Clough explores this case from\na feminist perspective noting some additional data related to\ngender—the affected populations (those suffering from allergies\nand auto-immune diseases) include a disproportionate representation of\nwomen and girls. Clough argues that the additional information that\ngender norms in the most severely affected societies generally require\nhigher standards of cleanliness for girls than for boys is\nevidentially relevant since research shows that increased\nexposure to microbes in childhood increases immunity to pathogens in\nadulthood. Since early exposure to pathogens may decrease the\nincidence of allergies and auto-immune diseases, the higher incidence\nof these conditions among girls and women in cultures where the they\nare subject to stricter norms of cleanliness is predicted by the\nhygiene hypothesis. Thus this correlation can provide additional\nevidence for the hypothesis when gender is taken into consideration.\nAdopting the minimal feminist value that gender matters improves\nresearch in this case. These values increase the empirical adequacy of\nthe account and thus improve the science.\n\nFor both Anderson and Clough the values incorporated into the science\nin this way are subject to empirical test as part of the theory as a\nwhole. Since the research relies on those values, when the evidence\nsupports the account as superior, it also confirms the values the\naccount incorporates. The objectivity of science is not threatened by\nthe inclusion of values since the account as a whole is still subject\nto empirical evidence.\n\nFeminist radical empiricist holist accounts such as Anderson’s\nand Clough’s present challenges however. Solomon questions\nwhether any single approach to values will be able to provide an\naccount of the varied ways that they can function appropriately in\nscience. She argues that values are not all of one type and\nconsequently, when relevant (and she notes that they may not always be\nrelevant) they may be relevant in different ways, playing different\nroles in knowledge production (Solomon 2012: 446). Audrey Yap worries\nthat some values may not be sensitive to evidence in the ways that\nAnderson’s and Clough’s accounts would seem to require\n(Yap 2016). Other feminist empiricist approaches, such as Helen\nLongino’s contextual empiricism discussed briefly in the next\nsection, may avoid these concerns.\n4.2 Objectivity\n\nThe commitment to the objectivity of science and the association of\nobjectivity with the value-free ideal are among the reasons many\nphilosophers of science found it difficult to accept that feminist\nvalues can make a constructive contribution to science. But as Lloyd\n(1995) notes, the meaning of “objectivity” is complex,\nunstable and hence far from clear. In one philosophical picture,\n“objectivity” characterizes a relationship between knowers\nand reality-as-independently-existing; methodologically, the knower\nmust be detached, because investment in a particular belief or\nattachment to a point of view (“bias”) “could impede\nthe free acquisition of knowledge and correct representation of\n(independent) reality…”. On Lloyd’s analysis the\nproblem lies with the claim that this “objective”\nreality—what she refers to as the “Really\nReal”—is “converged upon through the application of\nobjective methods”. The Really Real can be known since it is\npublicly accessible to those who use these objective methods and who\nare properly detached or disinterested. As Lloyd points out, this view\nassumes (a) that the Really Real is completely independent of us;\nthus, (b) objective knowledge of this Reality requires an\n“objective method” characterized by detachment, because\n(c) attachment or point of view might interfere with our independence\nfrom the reality we wish to know, and (d) this reality is publicly\naccessible, if it is accessible at all (Lloyd 1995: 354–356).\nThese assumptions are each problematic and this section and\n section 4.3\n address them.\n\nThe first assumption, that the Really Real is completely independent\nof us, fails to acknowledge that in addition to “resistances by\nreality”, sociocultural factors are “necessarily involved\nin the development of knowledge and concept-formation”.\nAnthropologists are virtually unanimous in holding that “sex and\ngender roles lay the foundations of every human society’s other\nsocial practices”, therefore, any epistemology or philosophy of\nscience that includes social interests and values as integral to the\nacquisition of knowledge should include sex and gender related values\nand interests (Lloyd 1995: 373 and 367–368).\n\nLloyd elaborates that when researchers investigate a phenomenon their\ngoal is not only to represent reality, but to give a\nsignificant, that is, relevant, representation.\nScientific accounts (theories and hypotheses) must focus on the parts\nof reality that are relevant to the interests (and values) that give\nrise to the research questions that motivate the research (2005:\n244–245). While reality may be independent of us, our accounts\nof reality are accounts of the aspects of reality that matter to us\nand are shaped by the interests that give rise to our research\nprograms. Additionally, the questions addressed through research\narise, in part, from what is thought to be known at the time that the\nresearch commences, this means that part of the evidence for the\naccount rests in that background knowledge. The ineliminability of\nvalues in both the background knowledge and the current projects\nchallenges the traditional ideal of objectivity.\n\nIn addressing the question of objectivity, both Lloyd and Anderson\nmake use of Hugh Lacey’s distinction between two aspects of the\nvalue-free ideal: neutrality and impartiality (Lacey 1999, 2–6).\nNeutrality is the requirement that scientific theories neither\npresuppose nor support any non-epistemic (moral, political, social, or\ncultural) values. Impartiality requires that theories be evaluated on\nthe basis of evidence and the extent to which they exhibit other\nepistemic values (Anderson uses Kuhn’s 1977 list: empirical\nadequacy, consistency, scope, and compatibility with other established\ntheories) (Anderson 2004: 3). Impartiality is not interest or\nvalue-free, but rather \n\n\na commitment to pass judgment in relation to a set of evaluative\nstandards that transcends the competing interests of those who\nadvocate rival answers to a question. (Anderson 1995b: 42) \n\n\nThus Lloyd and Anderson take impartiality to be the key feature of\nobjectivity, as does Lacey (Lacey 1999: 78). However, as noted in\n section 4.1,\n Anderson takes at least some value judgments to answer to empirical\nevidence and so they may legitimately serve as part of the evidence\nfor background theories against which evidence for hypotheses under\nconsideration is evaluated. This realization forces a reassessment of\nthe ideal of impartiality—background theories may affect our\nassessment of the evidence and so we must be prepared to determine\nwhen such influence is pernicious and when beneficial. As we have\nseen, Anderson makes the distinction by examining the extent to which\nvalues are responsive to evidence—that is, the extent to which\nthey are held non-dogmatically. In order to meet the ideal of\nimpartiality researchers must consider all of the evidence. Since some\nof the evidence is either value-laden or supports the values that\ndirect the research questions, impartial science need not be\nneutral.\n\nMuch feminist work on values has been influenced by Helen\nLongino’s contextual empiricism (see the entries on\n feminist epistemology and philosophy of science,\n feminist social epistemology, and\n the social dimensions of scientific knowledge).\n Using Kuhnian arguments for underdetermination of theory by evidence,\nLongino argues that since empirical evidence can never fully determine\nthat we should accept any particular theory, contextual values\n(social, moral, political, and cultural) may play a role in that\ndetermination by “filling the gap”—and thus Solomon\nrefers to this version of feminist empiricism as “gap feminist\nempiricism” (Solomon 2012: 436). As a result, Longino emphasizes\nthat evidence is relative to the contextual values against which the\nevaluation of the theory occurs. As a result, scientific theory is not\nneutral in Lacey’s sense; it presupposes certain social and\npolitical values that are among the background assumptions against\nwhich the theory is evaluated—its context. Hence scientific\ntheory is not objective in the traditional sense that requires\nneutrality. For Longino, it is not impartial either since social and\npolitical values can play, and often do play, a role in theory\nacceptance.\n\nLongino proposes an alternate understanding of objectivity. The social\ncharacter of science provides the opportunity for\n“transformative criticism”. Such criticism requires the\nadherence to social norms: publicly recognized forums for the\ncriticism of evidence, methods, and assumptions and reasoning; uptake\nof criticism, which requires that the community not merely tolerate\ndissent, but alter its beliefs and theories over time in response to\nthe critical discourse; publicly recognized standards by reference to\nwhich theories, hypotheses, and observational practices are evaluated\nand by appeal to which criticism is made relevant to the goals of the\ninquiring community; and finally, communities must be characterized by\ntempered equality of intellectual authority (Longino 1993, 2002). When\nscience is conducted according to these norms, Longino argues that it\nbalances partialities and hence is objective to the degree that it\nfulfills these norms. But it is neither neutral nor impartial since\nscientific theory is informed by values that shape the context in\nwhich the relevance of evidence is determined. \n4.3 Feminist Standpoint Theory\n\nWhile there are various standpoint theories, the commonalities include\nendorsement of the following three theses: the situated knowledge\nthesis, the thesis of epistemic privilege, and the achievement thesis\n(Wylie 2003; Rolin 2009; Intemann 2010; Crasnow 2013, 2014). The\nthesis of situated knowledge is based in the understanding that\nknowledge is for and by a particular set of socially\nsituated knowers and so is always local—a\ncultural/social/political “location” characterized by the\npower relations endemic in such settings. The differential\ndistribution of power and differences in interests are closely\nrelated—and thus the questions asked and the features of the\nworld that are relevant to answering those questions vary depending on\nlocation as well. Among the differences that are most salient are\nthose that are in conflict with the interests of the dominant groups.\nThus the metaphors of situated knowledge and social location give rise\nto one of the key ideas of feminist standpoint theory—the idea\nof the researcher as an insider/outsider who has “double\nvision”. She has access to the lived experience of those studied\nand the dominant culture of those who are doing the studying (the\nscholars). It is this double vision that aids in recognizing the\nlimits of the dominant frameworks.\n\nPatricia Hill Collins (1986), for example, advocates the use of\nstandpoint to analyze race and class. She argues that the researcher\nwho is marginalized may recognize that many of the concepts and\nprocedures adopted by the discipline are problematic when her\ncolleagues do not, precisely because she understands the objects of\ninquiry through her disciplinary research tradition and through her\nown experience occupying a marginalized social location. It is this\ndouble vision that makes the social scientist sensitive to the lines\nof fault that give rise to shifts in concepts and methods discussed in\n section 2\n and\n section 3.\n\nThe thesis of epistemic privilege is one of the more contentious\ncomponents of feminist standpoint theory. Many criticisms of the view\nstem from the mistaken understanding of epistemic privilege as\nautomatic. As Intemann points out, if this had been feminist\nstandpoint theory’s claim the view would be either trivial or\nfalse (Intemann 2010). But feminist standpoint theory is not committed\nto the trivial claim that only those who have had a particular\nexperience know what that experience is like. Nor does it make the\nobviously false claim that any woman can automatically know\nabout the experience of all other women. Such a claim would depend on\na presupposition of some sameness of women’s\nexperience—a presupposition that is not only false, but\nproblematically so since it erases the differences that race, class,\ndisability, sexuality, and gender identification make among\nwomen’s experiences. \n\nMisunderstandings of the situated knowledge and epistemic advantage\ntheses are partly due to two errors: thinking of them in isolation\nfrom each other and mistakenly taking them to be claims about\nindividualistic knowledge. Feminist standpoint theory is not an\naccount of how an individual acquires knowledge, but rather an account\nthat treats knowledge as social. This point can be made more clearly\nby considering the achievement thesis—the idea that standpoint\nis not automatic and must be achieved. Harding distinguishes between a\nperspective and a standpoint in order to clarify this. First, feminist\nstandpoint theory \n\n\nintends to map the practices of power, the ways the dominant\ninstitutions and their conceptual frameworks create and maintain\noppressive social relations. Secondly, it does this by locating, in a\nmaterial and political disadvantage or form of oppression, a\ndistinctive insight about how a hierarchical social structure works.\n(Harding 2004b: 31) \n\n\nHarding goes on to point out that just recording what members of\noppressed groups say is not adequate since they may have absorbed\ndominant understandings of the hierarchy. Standpoint requires the\ncreation of a group consciousness, and this is not equivalent to the\nshift in perspective of an individual (Harding 2004b: 31–32). A\nchange in the location of an individual automatically brings a\ndifferent perspective, however the achievement of a standpoint\nrequires working out where one is socially situated with others whose\nexperiences come to be mutually understood as shared.\n\nHarding’s account of what it is to achieve a standpoint thus\nemphasizes the deeply political nature of feminist standpoint theory.\nThis characterization also makes clear the challenge that feminist\nstandpoint theory raises for objectivity since both neutrality and\nimpartiality are in tension with feminist standpoint theory. Since\nknowledge is situated, it is also always partial. Recognizing that\nsome social locations provide epistemic privilege depends on\nacknowledging that partiality. Given this, it is not surprising that\nresistance to feminist standpoint theory has revolved around the way\nit has been perceived as a threat to the objectivity of science\n(Pinnick 2005).\n\nHarding has addressed the concern about objectivity repeatedly, most\nrecently in Harding 2015, through what she calls “strong\nobjectivity”. “Strong objectivity”, calls for the\nsubject of knowledge (the knowers) and the process through which\nknowledge is produced to be scrutinized according to the same\nstandards as the objects of knowledge. The contextual elements that\nfunction as part of the evidence, the selection of problems, the\nformation of hypotheses, the design of research (including the\norganization of research communities), the collection, interpretation,\nand sorting of data, decisions about when to stop research, the way\nresults of research are reported and so on need to be open to critical\nevaluation. But such evaluation requires that these contextual\nelements be accessible to researchers. The insider/outsider\ndouble-vision that feminist standpoint theory produces gives rise to\nthe epistemic advantage through which researchers have this access.\n\n\n\n…[A] maximally critical study of scientists and their\ncommunities can be done only from the perspective of those whose lives\nhave been marginalized by such communities. Thus, strong objectivity\nrequires that scientists and their communities be integrated into\ndemocracy-advancing projects for scientific and epistemological\nreasons as well as moral and political ones. (Harding 2004a: 136)\n\n\nAlison Wylie (2003) offers an alternative account of how feminist\nstandpoint can be understood to produce objectivity. Her approach is\nalso characteristic of shifts in the feminist epistemological landscape\nthat blur the lines between feminist empiricism and feminist\nstandpoint theory (Intemann 2010). Wylie notes that\n“objectivity” is frequently used to indicate a\nrelationship between theory and the world and so is identified as a\nproperty of knowledge claims. She proposes that we think about\nobjectivity as the degree to which these claims conform to some\nstandard set of epistemic virtues. She proposes empirical adequacy,\nexplanatory power, internal coherence, consistency with other\nestablished bodies of knowledge, although she notes that some other\nsuch list might serve as well. These theoretical virtues are rarely,\nif ever, all maximized by any one theory. Consequently, researchers\nmust make judgments about which virtues are most important at any\ngiven time for any particular knowledge project. These judgments\ndepend on the interests, purposes, intentions, and goals of the\nresearchers and research community, which can be seen as reflective of\na standpoint. Consequently, feminist standpoint can improve\nobjectivity through determining what sort of empirical adequacy,\nexplanatory power, or other virtues are relevant for a particular\nknowledge project and the degree to which each is relevant.\n\nOn Wylie’s account, science is not neutral (values inform\nhypotheses and are implied by them), nor is it impartial, given that\nvalues determine which among the characteristics that determine\nobjectivity are to be considered the most relevant for any\nspecific knowledge project. But impartiality has not entirely\nvanished in that what counts as empirical is not determined by values,\neven though its relevance is. Those in positions of subordination have\nepistemic privilege regarding some kinds of evidence and its\nrelevance, special inferential heuristics, and interpretative or\nexplanatory hypotheses.\n\nBoth Harding and Wylie appeal to standards (epistemic values) that do\nnot depend on any social/political (non-epistemic values) and yet\ntheir accounts accommodate social/political values and provide ways of\nunderstanding how such values play a positive role in knowledge\nproduction. Kristen Intemann (2010) has argued that refinements in\nboth feminist empiricism and feminist standpoint theory have resulted\nin a convergence of the two approaches. She identifies three shared\nfeatures: they are contextual, normative, and social. Feminist\n(holist) empiricism (both radical and gap empiricism) is contextual in\nthat it takes background assumptions and beliefs within a particular\ncontext either as part of the evidence for a theory or as determining\nwhat counts as evidence. Contemporary standpoint approaches are\ncontextual in that they point to social situatedness as a determinant\nof knowledge through the role that it plays either in revealing the\nevidence itself or the relevance of it. Both sorts of approaches are\nnormative in their focus on the role of social, political, and\ncultural values for knowledge production, in specification of\nevidence, and in determining the ends or goals of science. Both are\nalso social, focusing on the socio-political structure of the\nknowledge community. However, Intemann identifies two remaining areas\nof difference: feminist empiricism and feminist standpoint theory\ndiffer over the kind of diversity needed for objectivity and they\ndiffer over the role that non-epistemic values play in enhancing\nobjectivity (Intemann 2010: 790). For the former, Intemann argues that\nstandpoint’s understanding of diversity as social location\noffers a better grounding for a positive account of the role of\nfeminist values in science than feminist empiricist approaches in that\nit better explains the significance of particular sorts of evidence\nand why it is relevant for some knowledge projects and not others. But\nthe question of which knowledge projects are the ones that should be\npursued remains. It is not enough to say “women’s\nknowledge project” since women form a heterogeneous and unstable\ngroup. That is to say, which characteristics—sex, gender, race,\nsocio-economic class, ethnicity, sexuality, or differences in\nability—matter will vary depending on context.\n\nSharon Crasnow (2013, 2014) suggests that while the interests of the\nheterogeneous group “women” are often in conflict, through\nconversation, negotiation, and political action shared interests can\nbe identified and serve to provisionally stabilize evidential\nrelevance relations around a particular knowledge project. She\nconceives of this process as part of what it means for standpoint to\nbe achieved. Such an extension of feminist standpoint theory also\nsuggests a connection with current research in social epistemology\n(see the entry on\n feminist social epistemology).\n5. Queer Science Studies and the New Materialisms\n\nSeveral ways of thinking about science that are closely related to or\nbuild on feminist perspectives have emerged in recent scholarship. Two\nof these will be discussed here. The first, queer science studies,\nprovides an extension of feminist thought in that it challenges the\ntraditional assumptions about gender, many of which are also targets\nof feminist work. Another, the “new materialisms”,\nchallenges the idea that knowledge should be understood as\nrepresenting passive matter, arguing that such an analysis is not\nsufficiently attentive to the material aspects of embodiment. These\napproaches are related to each other (and to feminist perspectives) in\ntheir focus on the embodied nature of human subjects, and the\nimportance of lived experience as evidence (see also\n Biology and the New Materialisms).\n5.1 Queer Science Studies\n\nChallenges to assumptions about sex and gender and the role that they\nplay in shaping both scientific research and what counts as scientific\nknowledge suggest that while feminist approaches start with an\nexamination of these categories that very examination motivates\nfundamental rethinking of them. Just such a rethinking is taken up as\nan aspect of queer science studies. Queer science studies is queer\nboth in its challenge to beliefs about what are “ordinary”\nor “natural” features of the world (beliefs about sex and\nsexuality, for example) and in its subject matter—behavior and\nsubjects that have not traditionally been topics of science.\n\nWhile queer perspectives are not equivalent to feminist\nperspectives—there are feminists who do not consider the gender\nbinary to be a problem in itself, for example—they may\nnonetheless be thought of as extending approaches that feminists have\ntaken to critiquing dominant assumptions about sex and gender. Queer\nstudies does so more radically, however. Consider the distinction\nbetween sex and gender. The distinction arose as a way of separating\nbiological characteristics through which humans are classified into\nsexes from social attributions through which they are gendered.\nRoughly, characteristics directly associated with reproduction or\nsecondary sex traits were to be classed as the former whereas the\nsocial roles, clothing, and behavior associated with the different\nsexes were said to belong to the latter category. The idea allowed\nfeminists to argue that biological distinctions should not determine\nsocial role—that biology was not destiny. Some feminists\nultimately challenged the distinction in part because of the presumed\n“naturalness” of sex, its associations with a\n“natural” sexuality, and the recognition of the role that\nsuch assumptions play in science, including biology (ideas about\nreproduction) and scientific work on sexuality. In addition, the way\nsocial understandings of sex—beliefs about gender—shaped\nthese sciences also has become clearer. (See the discussion in\n section 2.2.)\n Thus, in practice, ideas of sex and gender turn out to be difficult\nto separate. Although the distinction has not been without\nbenefit—Deboleena Roy and Banu Subramaniam point out how the\ndistinction gave rise to productive work countering claims of\nbiological determinism by providing tools for discussing the social\nconstruction of the body, for example (Roy & Subramaniam 2016:\n25)—it has problems as well. \n\nQueer science studies have been more explicit about addressing\ndifficulties with the distinction and the reasons for doing so. Of\nparticular concern is the way medicine is implicated in the lives of\nintersex and trans individuals and the role of problematic assumptions\nunderlying that medicine. Prominent among these are the assumptions\nthat sexual identity is based in nature (biology) and also the belief\nthat characteristics that are stereotypically identified with one or\nanother gender are natural (based in biology). For example, Dussauge\nand Kaiser, voice such a challenge to the first of these and argue\nthat it should be replaced with an understanding of sexual identity as\nconstructed through “complex heteronormative power relations and\nsex/gendered norms” (Dussauge & Kaiser 2012: 122). This\nalternative framing encourages new approaches to scientific research\nfrom a queer perspective.\n\nA recent collection, Queer Feminist Science Studies: A Reader\n(Cipolla et al. 2017), emphasizes the connection to feminism both in\nits title and in the editors’ introduction where the focus is on\nthe dualisms that are part of the sex/gender framework (e.g.,\nnature/culture, male/female, normal/deviant) and how they shape\nsociety and consequently the social practices of scientific\nresearch.\n\n\n[W]e argue that queer theory sharpens feminist engagements with\nscience by turning critical attention to the imbrication or dependence\nof center and periphery, inside and outside, natural and artificial,\nand normativity and deviance. Rather than being opposed, these terms\nare coentangled divisions produced through specific histories. Thus,\nthere is now a rich array of queer work that contests the\nnaturalization of the categories of normal and deviant sexuality and\nbinarized notions of sexed anatomy, gender identity, sexual desire,\nand sexual identity. (Cipolla, et al. 2017: 12)\n\n\nAnne Fausto-Sterling’s research on the historical emergence of\nthe idea that there are two sexes exemplifies the kind of critique\nthat informs queer science studies. She traces this particular binary\nto the increasing involvement of science in deciding the fate of\nintersexual individuals, beginning in the nineteenth century. This\ndevelopment was partly a result of the emergence of sexuality as a\nproper subject of scientific study at this time, coupled with a belief\nthat science describes nature as it really is and hence should be\nappealed to when we were uncertain about nature. Fausto-Sterling\nidentifies several questionable assumptions underlying this research.\nThe first is that science is indeed able to provide objectivity on\nissues of sexual identity and sexuality. Second, that the\nclassification of humans into two sexes is natural. The final\nassumption she identifies is that science will find this\nclassification in nature through identifying the defining or essential\ncharacteristics of each of the two sexes.\n\nFausto-Sterling addresses each of these assumptions in turn. She\nargues that science does not provide an objective account of\nbiological sex, since science is a social and historical human\nactivity and many of the ways of thinking about sexuality and sexual\nidentity were guided by pre-existing conceptions of gender (also see\nthe discussion of objectivity in\n section 4.2).\n As an illustration, she examines the gendered understanding of female\nsexuality as passive and the way that understanding influenced the\ndesign of experiments meant to test the effect of sex hormones on the\nsexual behavior of rats (Fausto-Sterling 2000: 195–232). These\nhormones were themselves classified as male and female, in spite their\nhaving other functions besides those related to reproduction and in\nspite of their presence in both those identified as male and those\nidentified as female. The results of these experiments were in turn\nused to make claims about behavior and sex in humans. This move is\nproblematically circular and additionally depends on analogical\nreasoning to human sexual behavior from the behavior of rats.\n\nAs for the other two assumptions, that there are only two sexes and\nthat they are to be identified through essential characteristics,\nFausto-Sterling points out that the idea that there are only two sexes\nshould be rejected on the basis of two sorts of evidence, social and\nscientific. The social evidence indicates that there are cultures that\nrecognize more than two sexes and the evidence from science indicates\nthis as well. In addition, various different forms of intersexuality\nbelie the notion that there are two mutually exclusive and jointly\nexhaustive sexes (Fausto-Sterling 2000: Chapter 4). The belief that\nthere are essential characteristics that are identifiers for each of\nthe two sexes is rejected through similar arguments.\nFausto-Sterling’s discussion is in the context of the harms done\nto intersexual persons—usually as infants who are unable to make\nchoices for themselves—and so her concerns focus on the\ninjustice done in the name of a science that fails to examine these\nassumptions. \n\nSarah Richardson’s work on the human genome also\nillustrates the problematic intertwining of assumptions about gender\nand research on sex (Richardson 2013;\n section 2.2).\n In a 2012 article, she focuses on how the X chromosome came to be\nidentified as “female”—something that happened in\nspite of the anomalous presence of male sperm genes on X chromosomes\nand the fact that males also have X chromosomes (Richardson 2012,\nreprinted in abridged form in Cipolla et al. 2017).\n\nFausto-Sterling and Richardson provide examples of the sort of\nthinking that queer science studies is engaged in. The challenges to\ntraditional understanding of sex, sexuality, gender, gender identity,\nwhat is natural and what is cultural, what is normal and what is\ndeviant seek to disrupt conventional thinking and approaches. Insofar\nas sexist thinking is conventional, it too will be challenged.\n5.2 The New Materialisms\n\nMuch of the feminist work discussed thus far has focused on how the\nworld is conceptualized—that is, various different ways of\nrepresenting what is studied and the effects of these different\nrepresentations. The new materialisms challenge this emphasis on\nrepresentation, arguing that it treats matter as passive and that this\nsort of analysis is not sufficiently attentive to the material aspects\nof embodiment. As Pitts-Taylor puts it, “matter matters”.\nAs part of the corrective she proposes that science studies take the\nfollowing steps—some of which we have already seen in some of\nthe feminist work discussed. The first is breaking down the\ndistinction between the social and biological by recognizing how they\nare intertwined. The second involves documenting the way the\nbiological can be shaped by human needs which are in turn shaped\nthrough modes of power. Finally, she proposes rejecting dominant\ndualisms of the sort that queer science studies challenges\n(Pitts-Taylor 2016b: 1).\n\nAlthough Pitts-Taylor recognizes these moves may grow out of feminist\napproaches to science, the new materialisms are also critical of some\nfeminist thinking about science, claiming that science is too often\nrecognized as an instrument of oppression, but not engaged with\nsufficiently to support the development of feminist science. The new\nmaterialisms note that this is particularly true of feminism’s\nlack of engagement with the physical sciences—those areas of\nscience concerned with the basics of matter.\n\nKaren Barad’s work seeks to correct this, developing a view that\nshe calls it “agential realism”. For Barad, \n\n\nphenomena are not the mere result of laboratory exercises engineered\nby human subjects; rather, phenomena are differential patterns of\nmattering (“diffraction patterns”) produced through\ncomplex agential intra-actions of multiple material-discursive\npractices…. (emphasis in the original). \n\n\nSuch patterns may or may not involve humans, however these practices\nconstitute “boundaries between humans and nonhumans, culture and\nnature, science and the social” (Barad 2007: 140).\n\nBarad’s metaphor of “diffraction patterns” is taken\nfrom Donna Haraway (see particularly Haraway 1992), who proposed\ndiffraction as an alternative to the metaphor of reflection. While\nboth are optical metaphors, Barad notes that reflection emphasizes\nsameness and so evokes essentialism—the discovery of what is the\nsame in what is under investigation. Diffraction is about differences\nand moves the researcher towards tracing the histories of these\ndifferences, rather than fitting them into preconceived binaries\n(Barad 2007: 29–30). Barad describes this process of knowing the\nmaterial world as “intra-action” rather than interaction.\nIn doing so, she emphasizes that agency is not an\nattribute—something that someone has—but rather is the\ninvolvement in the iterative practices that constitute materiality\n(Barad 2007: 178). For Barad this intra-action entails the\ninseparability of science, ontology, epistemology, and ethics and\nhence the pun on “matter” that runs throughout the new\nmaterialism. Our practices matter both in the sense of making a\ndifference and in the sense of being involved in the configuring and\nreconfiguring of the material world.\n6. Recent Areas of Study: The Brain and Human Behavior\n\nThe work in the previous sections has focused primarily on examples of\nfeminist perspectives in biology and the social sciences. This may not\nbe surprising since in much of biology, sex is relevant and thinking\nabout sex has been among the issues that feminists have explored. The\nsocial sciences examine various aspects of society and the way gender\nstructures society has again been a major concern for feminists. Barad\nand the new materialists suggest ways in which feminist (and queer)\ncritique can be extended to the physical/material sciences. There are\nother areas of scientific research that have also drawn the attention\nof feminists however. Two of particular interest are neurofeminism\nwhich focuses on sexism in the study of the brain and feminist\ncritiques of the closely related field of cognitive science.\n6.1 Neurofeminism\n\nThe development of neuroscience in the twentieth and twenty-first\ncentury resulted in feminist examination of these\nfields—particularly in connection with cognitive science and\nresearch on differences in the brains of men and women (Bluhm,\nJacobson, & Maibom 2012; Fine 2010; Pitts-Taylor 2016a;\nJordan-Young 2010). Feminist work in this vein approaches neuroscience\nin ways similar to the approaches described in the previous sections.\nIt involves investigating sexist bias through examining background\nassumptions and other means through which such bias could enter, as\nwell as identifying background beliefs that shape research.\n\nIt may be somewhat misleading to treat neuroscience as a new area of\ninterest from a feminist perspective. As Bluhm, Jacobson, and Maibom\npoint out, \n\n\nFeminist neuroscientists were among the first to critique androcentric\ntheories and assumptions in their disciplines,…. (Bluhm,\nJacobson, & Maibom 2012: 6) \n\n\nHowever, the twenty-first century has seen substantial advances in\nneuroscience and cognitive science coupled with new tools for studying\nthe brain. These advances have been accompanied by worries about how\nandrocentric assumptions have persisted in research and how they\nmanifest in the use of new ways of investigating the brain, such as\nfMRI.\n\nOne research area that has attracted feminist attention is the study\nof sex differences in the brain. There is a considerable range of work\nthat might qualify under this heading. As an example, Rebecca\nJordan-Young’s book Brain Storm: The Flaws in the Science of\nSex Differences (2010) focuses on a dominant approach in that\narea of study which she dubs “brain organization\nresearch”. She argues that the main theoretical framework\nguiding sex difference research is that \n\n\nprenatal hormone exposures cause sexual differentiation of the\nbrain—that is, early hormones create permanent masculine or\nfeminine patterns of desire, personality, temperament, and cognition.\n(Jordan-Young 2010: xi) \n\n\nThe prenatal hormone exposure referred to here is the flooding of\nandrogens during fetal development prior to which the there is no sex\ndifferentiation between fetuses. The organizational hypothesis is that\nthis same infusion of androgens that determines differential\nreproductive development also determines brain development and\nultimately differential brain structure in males and females.\nJordan-Young is particularly interested in how conclusions are drawn\nabout sexuality from brain organization research. Her main concern\nabout the uncritical use of the hormonal theory of brain organization\nis that alternative hypotheses—specifically the hypothesis that\nsocial factors, expectations, and learned behaviors play a role in\nbrain organization—fail to be considered adequately.\n\nAs Jordan-Young acknowledges, most brain organizational researchers\nclaim to be interactionists—that is, they recognize that social\nfactors play some role and that both hormones and society affect the\nbrain. However, she argues that their accounts are typically additive\nrather than truly interactive, with the hormonal influence acting\nfirst and social influence coming in later. Additive accounts treat\nthe causal factors as separable whereas a truly interactive account\nwould not do so. Jordan-Young credits Doell and Longino’s work\non the topic with having pointed this out decades ago (1988: 59).\n\nThe failure to question organization theory is one point of\nJordan-Young’s account, but she also considers other assumptions\nabout hormones, the relationship between sex and gender, and\nsexuality. Specifically, in considering other assumptions about\nhormones, she notes that the understanding of steroid hormones from\nthe onset of this research was that some were masculine and some\nfeminine. (For this account she relies on the work of Nelly Oudshoorn\n(1994)). Further, she argues that thinking of hormones in this\nway—as androgens (male hormones) and estrogens (female\nhormones)—is not without problems for researchers that make\nthese assumptions, since both types of hormones are present in both\nmales and females—an anomaly the approach does not account for\n(see also\n section 5.1).\n She identifies this as a failure to take into account evidence that\ndoes not fit with the prior interpretation of hormones as sexed. Thus\nfeatures of accounts depending on organization theory appear to be\nboth value-laden and held dogmatically.\n\nJordan-Young is using patterns of feminist critique similar to those\ndescribed in previous sections. She interrogates unexamined\nassumptions, traces the ways in which those assumptions shape the\nunderstanding of the objects of inquiry and determine what will count\nas evidence. She reveals the line of thought from the\nassumptions—the conceptualization of hormones as sexed—to\nunderstandings of the world that are problematic including conclusions\nabout sexual desire, sexual orientation, and “sex-typed”\ninterests and behaviors.\n6.2 Cognitive Science\n\nThe last of these brings us to cognitive science, which focuses more\nspecifically on connections between the structure of the brain and\nbehavior—such as career choices. Arguments from brain\ndifferences to a differential ability of men and women when it comes\nto math and science (see\n section 1.1)\n are not unusual. Such moves and the scientific research on the brain\nthat surrounds them have led Cordelia Fine to identify these\napproaches as part of a pattern that she calls\n“neurosexism” (Fine 2010). Simon Baron-Cohen’s work\nprovides an example (2003) in that he connects the different\nstructures of the brain with behaviors that are identified as\nspecifically male or female. His argument relies on combining two\ntheoretical tools—brain organization theory and evolutionary\ntheory. The resulting evolutionary psychology seeks to give an account\nof differences in the behavior of men and women that result from the\ndifferent adaptive pressures that males and females have had to face\n(the evolutionary portion of the argument relies on Darwinian sexual\nselection). The sexual differentiation and brain differentiation go\ntogether to produce differences in brains adapted for different\nreproductive roles. In Baron-Cohen’s account, these different\nadaptive pressures result in a female brain that evolved for\nempathizing with others (E brains) and a male brain that evolved for\nsystematizing (S brains).\n\nAgain, this sort of approach relies upon organizational theory, which\nis not critically examined, and is extended to non-reproductive\nbehavior, such as the ability to do science—an ability claimed\nto be greatly diminished in the sex that (on average) does not have a\nsystematizing brain. The fundamental point that these approaches are\nresistant to the consideration of alternatives is at the heart of this\nfeminist critique.\n\nAdditionally, there is some dispute about whether the claimed sex\ndifferences in behavior are real. As examples, Grossi and Fine\nchallenge the claim that mental spatial rotation skills are superior\nfor males. Recent evidence suggests that when girls and women practice\nspatial rotation, say through video games, the differences in\nperformance rapidly disappear (Feng, Spence, and Pratt 2007). Similar\narguments can also be made about empathizers. Sex differences in\nlanguage proficiency tend to disappear as children grow older. There\nare also reasons to doubt the accuracy of the tests used to produce\nevidence of cognitive sex difference given that not all methods of\ntesting produce the same results (Grossi and Fine 2012: 78). Finally,\nwhen there does seem to be evidence of sex differences in behavior\nthese differences are highly sensitive to the social context. Girls\nwhose performance is poorer on math tests when they are reminded of\ntheir gender, do better when gender is made less salient (see the\ndiscussion of stereotype threat in\n section 1.1).\n\nFeminists have offered several other lines of response to claims that\ndifferences in brain structure and behavior are linked. Letitia\nMeynell argues that the illusion of transparency in brain imaging\nthrough fMRI and the consequent understanding of these images as\nobjective evidence disguises the ways they are read and interpreted\nthrough our already existing notions of gender (Meynell 2012). Ginger\nHoffman (2012) appeals to the plasticity of the brain and a truly\ninteractive understanding of the relationship between the brain and\nthe social environment in which it functions to challenge the idea\nthat observed differences in brain structure indicate immutable\ndifferences between the sexes. Victoria Pitts-Taylor (2016a) argues\nfor understanding the brain as both biological and social—shaped\nby its bodily/social presence in the world.\n\nThese last points reinforce that the assumptions underlying the\ncritiqued accounts (e.g., that organizational theory is correct, that\nhormones are sex hormones) are held dogmatically. It is worth noting\nthat this is not an idle claim—these assumptions can be and have\nbeen investigated. For example, the assumption about the\n“maleness” of testosterone and its causal relation to\ncertain “male” behaviors is challenged by recent research\nthat indicates that engaging in stereotypically male behaviors (making\nmovements that are associated with wielding a sword) can increase the\nproduction of testosterone in both males and females (van Anders,\nSteiger, & Goldey 2015). This sort of research lends plausibility\nto a more interactive account and erodes a sharp distinction between\nbiology and society.\n7. Conclusions\n\nIn spite of the wide-range of topics covered in this entry—from\nequity issues, philosophy of science, queer science studies, and\nneuroscience—the focus has been incomplete in its focus on\nfeminism in the global North. The entry thus fails to fully represent\nfeminist perspectives on science. It is more accurate to describe it\nas presenting some feminist perspectives on science. Those\nthat are presented here have been important to those working in these\ntraditions and to some degree they include elements that have informed\nother feminisms, but not all. An example of the sort of work that has\nnot been considered is research on colonial, postcolonial, and\ndecolonial science studies (see Harding 2017 for an example of the\nlast). And, as Uma Narayan has pointed out, because western feminist\nphilosophers of science have so often targeted the value-free ideal\nassociated with positivism (see\n section 4.2),\n they sometimes fail to see the usefulness of that ideal for\nnonwestern feminists who may use it as a tool to challenge, for\nexample, oppressive religious values within their own culture (Narayan\n2004: 216–217). Another area of interest also not addressed here\nis data science and questions about how power hierarchies are\noften reinforced through the categories and algorithms used in the\ncollection and interpretation of data—including but not limited\nto gender classifications (D’Ignazio & Klein 2020). There is\nalso an increasing body of work on the intersection of sex/gender,\nrace, class, and how science is implicated in the oppressions such\nintersections support. Also missing are discussion of disability and\nits problematic intersection with science, as well as reproductive\ntechnologies and feminist concerns (for example, see de\nMelo-Martín 2017).\n\nThe result is that the entry provides background, but there is much\nmore that could be said and those interested would do well to begin\nwith the additional readings. What is covered here only gives a\nstarting point from which to investigate the many ways in which power,\nsex/gender, sexuality, and science are intertwined.\n",
    "bibliography": {
        "categories": [
            "Sources Cited",
            "Additional Readings"
        ],
        "cat_ref_text": {
            "Sources Cited": [
                "</h3>\n<ul class=\"hanging\">",
                "Alcoff, Linda and Elizabeth Potter (eds.), 1993, <em>Feminist\nEpistemologies</em>, New York: Routledge.\ndoi:10.4324/9780203760093",
                "Altmann, Jeanne, 1974, “Observational Study of Behavior:\nSampling Methods”, <em>Behaviour</em>, 49(3–4):\n227–266. doi:10.1163/156853974X00534",
                "American Association of University Women (AAUW), 2010, <em>Why So\nFew? Women in Science, Technology, Engineering, and Mathematics</em>,\nWashington, DC: American Association of University Women.",
                "Anderson, Elizabeth, 1995a, “Feminist Epistemology: An\nInterpretation and a Defense”, <em>Hypatia</em>, 10(3):\n50–84. doi:10.1111/j.1527-2001.1995.tb00737.x",
                "–––, 1995b, “Knowledge, Human Interests,\nand Objectivity in Feminist Epistemology”:, <em>Philosophical\nTopics</em>, 23(2): 27–58. doi:10.5840/philtopics199523213",
                "–––, 2004, “Uses of Value Judgments in\nScience: A General Argument, with Lessons from a Case Study of\nFeminist Research on Divorce”, <em>Hypatia</em>, 19(1):\n1–24. doi:10.1111/j.1527-2001.2004.tb01266.x",
                "Bairey Merz, C. Noel, Holly Andersen, Emily Sprague, Adam Burns,\nMark Keida, Mary Norine Walsh, Phyllis Greenberger, Susan Campbell,\nIrene Pollin, Cassandra McCullough, et al., 2017, “Knowledge,\nAttitudes, and Beliefs Regarding Cardiovascular Disease in\nWomen”, <em>Journal of the American College of Cardiology</em>,\n70(2): 123–132. doi:10.1016/j.jacc.2017.05.024",
                "Barad, Karen, 2007, <em>Meeting the Universe Halfway: Quantum\nPhysics and the Entanglement of Matter and Meaning</em>, Durham, NC:\nDuke University Press.",
                "Barker, Drucilla K., 1995, “Economists, Social Reformers,\nand Prophets: A Feminist Critique of Economic Efficiency”,\n<em>Feminist Economics</em>, 1(3): 26–39.\ndoi:10.1080/714042247",
                "Barker, Drucilla K. and Edith Kuiper, 2003, <em>Towards a Feminist\nPhilosophy of Economics</em>, London/New York: Routledge.",
                "Baron-Cohen, Simon, 2003, <em>The Essential Difference: Men, Women\nand the Extreme Male Brain</em>, London: Allen Lane.",
                "Bluhm, Robyn, Anne Jaap Jacobson, and Heidi Lene Maibom (eds),\n2012, <em>Neurofeminism: Issues at the Intersection of Feminist Theory\nand Cognitive Science</em>, London: Palgrave Macmillan UK.\ndoi:10.1057/9780230368385",
                "Bright, Liam Kofi, Daniel Malinsky, and Morgan Thompson, 2016,\n“Causally Interpreting Intersectionality Theory”,\n<em>Philosophy of Science</em>, 83(1): 60–81.\ndoi:10.1086/684173",
                "Brister, Evelyn, 2018, “Objectivity in Science”, in\nGaravaso 2018: 212–235.",
                "Cipolla, Cyd, Kristina Gupta, David A. Rubin, and Angela Willey\n(eds), 2017, <em>Queer Feminist Science Studies: A Reader</em>,\nSeattle, WA: University of Washington Press.",
                "Clough, Sharyn, 2003a, <em>Beyond Epistemology: A Pragmatist\nApproach to Feminist Science Studies</em>, Lanham, MD: Rowman and\nLittlefield.",
                "–––, 2003b, “Introduction”, in\n<em>Siblings Under the Skin: Feminism, Social Justice and Analytic\nPhilosophy</em>, Sharyn Clough (ed.), Aurora, CO: Davies Group\nPublishers.",
                "–––, 2011, “Gender and the Hygiene\nHypothesis”, <em>Social Science &amp; Medicine</em>, 72(4):\n486–493. doi:10.1016/j.socscimed.2010.11.021",
                "–––, 2012, “The Analytic Tradition,\nRadical (Feminist) Interpretation, and the Hygiene Hypothesis”,\nin Crasnow and Superson 2012: 405–434.",
                "Clough, Sharyn and William E. Loges, 2008, “Racist Value\nJudgments as Objectively False Beliefs: A Philosophical and\nSocial-Psychological Analysis”, <em>Journal of Social\nPhilosophy</em>, 39(1): 77–95.\ndoi:10.1111/j.1467-9833.2007.00412.x",
                "Collins, Patricia Hill, 1986, “Learning from the Outsider\nWithin: The Sociological Significance of Black Feminist\nThought”, <em>Social Problems</em>, 33(6): S14–S32.\ndoi:10.2307/800672",
                "–––, 1990 [2000/2009], <em>Black Feminist\nThought: Knowledge, Consciousness, and the Politics of\nEmpowerment</em>, Boston: Unwin Hyman. Second revised edition, New\nYork: Routledge, 2000/Routledge Classics, 2009.",
                "Crasnow, Sharon, 2013, “Feminist Philosophy of Science:\nValues and Objectivity”, <em>Philosophy Compass</em>, 8(4):\n413–423. doi:10.1111/phc3.12023",
                "–––, 2014, “Feminist Standpoint\nTheory”, in <em>Philosophy of Social Science: A New\nIntroduction</em>, Nancy Cartwright and Eleonora Montuschi (eds),\nOxford: Oxford University Press, pp. 145–161.",
                "Crasnow, Sharon L. and Anita M. Superson (eds), 2012, <em>Out from\nthe Shadows: Analytical Contributions to Traditional Philosophy</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199855469.001.0001",
                "Crasnow, Sharon, Alison Wylie, Wenda K. Bauchspies, and Elizabeth\nPotter, 2015 [2018], “Feminist Perspectives on Science”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2018\nEdition), Edward N. Zalta (ed.), URL =\n <a href=\"https://plato.stanford.edu/archives/spr2018/entries/feminist-science/\" target=\"other\">https://plato.stanford.edu/archives/spr2018/entries/feminist-science/</a>.",
                "Dalla Costa, Mariarosa and Selma James, 1972, <em>The Power of\nWomen and the Subversion of Community</em>, Bristol, UK: Falling Wall\nPress.",
                "de Melo-Martín, Inmaculada, 2017, <em>Rethinking\nReprogenetics: Enhancing Ethical Analyses of Reprogenetic\nTechnologies</em>, Oxford: Oxford University Press.\ndoi:10.1093/med/9780190460204.001.0001",
                "DeVault, Marjorie, 1999, <em>Liberating Method: Feminism and\nSocial Research</em>, Philadephia, PA: Temple University Press.",
                "D’Ignazio, Catherine and Lauren F. Klein, 2020, <em>Data\nFeminism</em>, Cambridge, MA: Massachusetts Institute of Technology\nPress.",
                "Doell, Ruth G. and Helen E. Longino, 1988, “Sex Hormones and\nHuman Behavior:: A Critique of the Linear Model”, <em>Journal of\nHomosexuality</em>, 15(3–4): 55–78.\ndoi:10.1300/J082v15n03_03",
                "Dotson, Kristie, 2011, “Tracking Epistemic Violence,\nTracking Practices of Silencing”, <em>Hypatia</em>, 26(2):\n236–257. doi:10.1111/j.1527-2001.2011.01177.x",
                "Dussauge, Isabelle and Anelis Kaiser, 2012, “Re-Queering the\nBrain”, in Bluhm, Jacobson, and Maibom 2012: 121–144.",
                "Eichler, Margrit and Jeanne Lapointe, 1985, <em>On the Treatment\nof the Sexes in Research</em>, Ottawa, ON: Social Sciences and\nHumanities Research Council of Canada.",
                "Elliott, Kevin C., 2017, <em>A Tapestry of Values: An Introduction\nto Values in Science</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190260804.001.0001",
                "Fausto-Sterling, Anne, 2000, <em>Sexing the Body: Gender Politics\nand the Construction of Sexuality</em>, New York: Basic Books.",
                "Federici, Silvia, 1975 [2020], “Wages Against\nHousework”, Bristol, UK: Power of Women Collective and the\nFalling Wall Press. Reprinted in <em>Revolution at Point Zero:\nHousework, Reproduction, and Feminist Struggle</em>, Oakland, CA: PM\nPress, pp. 1–18.",
                "Fehr, Carla, 2011, “What Is in It for Me? The Benefits of\nDiversity in Scientific Communities”, in Grasswick 2011:\n133–155. doi:10.1007/978-1-4020-6835-5_7",
                "Feng, Jing, Ian Spence, and Jay Pratt, 2007, “Playing an\nAction Video Game Reduces Gender Difference in Spatial\nCognition”, <em>Psychological Science</em>, 10: 850–855.\ndoi: 10.1111/j.1467-9280.2007.01990.x",
                "Fine, Cordelia, 2010, <em>Delusions of Gender: How our Minds,\nSociety, and Neurosexism Create Difference</em>, New York:\nNorton.",
                "Fricker, Miranda, 2007, <em>Epistemic Injustice: Power and the\nEthics of Knowing</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198237907.001.0001",
                "Garavaso, Pieranna (ed.), 2018, <em>The Bloomsbury Companion to\nAnalytic Feminism</em>, London: Bloomsbury Academic.",
                "Grasswick, Heidi E. (ed.), 2011, <em>Feminist Epistemology and\nPhilosophy of Science: Power in Knowledge</em>, Dordrecht: Springer\nNetherlands. doi:10.1007/978-1-4020-6835-5",
                "Grossi, Giordana and Cordelia Fine, 2012, “The Role of Fetal\nTestosterone in the Development of the ‘Essential\nDifferences’ Between the Sexes: Some Essential Issues”, in\nBluhm, Jacobson, and Maibom 2012: 73–104.",
                "Haack, Susan, 1993, “Epistemological Reflections of an Old\nFeminist”, <em>Reason Papers</em>, 18: 31–43.\n [<a href=\"https://reasonpapers.com/pdf/18/rp_18_3.pdf\" target=\"other\">Haack 1993 available online</a>]",
                "Haraway, Donna, 1992, “The Promises of Monsters: A\nRegenerative Politics for Inappropriate/d Others”, in\n<em>Cultural Studies</em>, Lawrence Grossberg, Cary Nelson, and Paula\nTreichler (eds), New York: Routledge, pp. 295–337.",
                "Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca NY: Cornell University Press.",
                "–––, 1987, “Is There a Feminist\nMethod?” in <em>Feminism and Methodology: Social Science\nIssues</em>, Sandra Harding (ed.), Bloomington, IN: Indiana University\nPress, pp. 1–14.",
                "–––, 2004a, “Rethinking Standpoint\nEpistemology: What is ‘Strong Objectivity?’”, in\nHarding (ed.) 2004c: 127–140.",
                "–––, 2004b, “A Socially Relevant\nPhilosophy of Science? Resources from Standpoint Theory’s\nControversiality”, <em>Hypatia</em>, 19(1): 25–47.\ndoi:10.1111/j.1527-2001.2004.tb01267.x",
                "––– (ed.), 2004c, <em>The Feminist Standpoint\nTheory Reader</em>, New York: Routledge.",
                "–––, 2015, <em>Objectivity and Diversity:\nAnother Logic of Scientific Research</em>, Chicago, IL: University of\nChicago Press.",
                "–––, 2017, “Latin American Decolonial\nStudies: Feminist Issues”, <em>Feminist Studies</em>, 43(3):\n624–636. doi:10.15767/feministstudies.43.3.0624",
                "–––, 2019, “State of the Field: Latin\nAmerican Decolonial Philosophies of Science”, <em>Studies in\nHistory and Philosophy of Science Part A</em>, 78: 48–63.\ndoi:10.1016/j.shpsa.2018.10.001",
                "Himmelweit, Susan and Simon Mohun, 1977, “Domestic Labour\nand Capital”, <em>Cambridge Journal of Economics</em>, 1(1):\n15–31. doi:10.1093/oxfordjournals.cje.a035348",
                "Hoffman, Ginger, 2012, “What, If Anything, Can Neuroscience\nTell Us About Gender Differences?” in Bluhm, Jacobson, and\nMaibom 2012: 30–55.",
                "Intemann, Kristen, 2009, “Why Diversity Matters:\nUnderstanding and Applying the Diversity Component of the National\nScience Foundation’s Broader Impacts Criterion”,\n<em>Social Epistemology</em>, 23(3–4): 249–266.\ndoi:10.1080/02691720903364134",
                "–––, 2010, “25 Years of Feminist\nEmpiricism and Standpoint Theory: Where Are We Now?”,\n<em>Hypatia</em>, 25(4): 778–796.\ndoi:10.1111/j.1527-2001.2010.01138.x",
                "–––, 2011, “Diversity and Dissent in\nScience: Does Democracy Always Serve Feminist Aims?”, in\nGrasswick 2011: 111–132. doi:10.1007/978-1-4020-6835-5_6",
                "Johnson, Paula A., Sheila E. Widnall, and Frazier F. Benya, (eds),\n2018,<em>Sexual Harassment of Women Climate, Culture, and Consequences\nin Academic Sciences, Engineering, and Medicine (2018)</em>,\nWashington, DC: The National Academies Press.",
                "Jordan-Young, Rebecca, 2010, <em>Brain Storm: The Flaws in the\nScience of Sex Differences,</em> Cambridge, MA: Harvard University\nPress.",
                "Keller, Evelyn Fox, 1985, <em>Reflections on Gender and\nScience</em>, New Haven: Yale University Press.",
                "–––, 2001, “Making a Difference: Feminist\nMovement and Feminist Critique of Science”, in <em>Feminism in\nTwentieth-Century Science, Technology, and Medicine</em>, Angela N.H.\nCreager, Elizabeth Lunbeck, and Londa Schiebinger (eds), Chicago:\nUniversity of Chicago Press, pp. 98–109.",
                "Kincaid, Harold, John Dupré, and Alison Wylie (eds), 2007,\n<em>Value-Free Science? Ideals and Illusions</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780195308969.001.0001",
                "Kitcher, Philip, 1993, <em>The Advancement of Science: Science\nWithout Legend, Objectivity Without Illusions</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0195096533.001.0001",
                "–––, 2001, <em>Science, Truth, and\nDemocracy</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195145836.001.0001",
                "Kourany, Janet A., 2010, <em>Philosophy of Science after\nFeminism</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199732623.001.0001",
                "Kuhn, Thomas S., 1962 [1970], <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.",
                "–––, 1977, <em>The Essential Tension: Selected\nStudies in Scientific Tradition and Change</em>, Chicago: University\nof Chicago Press.",
                "Lacey, Hugh, 1999, <em>Is Science Value Free? Values and\nScientific Understanding</em>, New York: Routledge.\ndoi:10.4324/9780203983195",
                "Lévi-Strauss, Claude, 1936, “Contribution a\nl’étude de l’organisation Sociale des Indiens\nBororo”, <em>Journal de La Société Des\nAméricanistes</em>, 28(2): 269–304.",
                "Lloyd, Elisabeth A., 1995, “Objectivity and the Double\nStandard for Feminist Epistemologies”, <em>Synthese</em>,\n104(3): 351–381. doi:10.1007/BF01064505",
                "–––, 2005, <em>The Case of the Female Orgasm:\nBias in the Science of Evolution</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Longino, Helen E., 1990, <em>Science as Social Knowledge</em>,\nPrinceton, NJ: Princeton University Press.",
                "–––, 1993, “Subjects, Power, and\nKnowledge: Description and Prescription in Feminist Philosophies of\nScience”, in Alcoff and Potter 1993: 101–120.",
                "–––, 2002, <em>The Fate of Knowledge</em>,\nPrinceton NJ: Princeton University Press.",
                "–––, 2013, <em>Studying Human Behavior: How\nScientists Investigate Aggression and Sexuality</em>, Chicago, IL:\nChicago University Press.",
                "Medina, José, 2013, <em>The Epistemology of Resistance:\nGender and Racial Oppression, Epistemic Injustice, and Resistant\nImaginations</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199929023.001.0001",
                "Merchant, Carolyn, 1980/90, <em>The Death of Nature: Women,\nEcology, and the Scientific Revolution</em>, New York: Harper and\nRow.",
                "Meynell, Letitia, 2012, “The Politics of Pictured Reality:\nLocating the Object from Nowhere in fMRI”, in Bluhm, Jacobson,\nand Maibom 2012: 11–29.",
                "MIT, Committee on Women Faculty in the School of Science, 1999,\n“A Study on the Status of Women Faculty in Science at\nMIT”, <em>The MIT Faculty Newsletter</em>, 11(4).\n [<a href=\"https://web.mit.edu/fnl/women/women.html\" target=\"other\">MIT 1999 available online</a>]",
                "Narayan, Uma, 2004, “The Project of Feminist Epistemology:\nPerspectives from a Nonwestern Feminist”, in Harding (ed.)\n2004c: 213–224.",
                "National Science Board, 2018, <em>Science &amp; Engineering\nIndicators</em>, NSB-2018-1. Alexandria, VA: National Science\nFoundation.\n [<a href=\"https://www.nsf.gov/statistics/2018/nsb20181/report\" target=\"other\">National Science Board 2018 available online</a>]",
                "Nelson, Lynn Hankinson, 1990, <em>Who Knows: From Quine to a\nFeminist Empiricism</em>, Philadelphia: Temple University Press.",
                "Oudshoorn, Nelly, 1994, <em>Beyond the Natural Body: An\nArchaeology of Sex Hormones</em>, London: Routledge.\ndoi:10.4324/9780203421529",
                "Paxton, Pamela, 2000, “Women’s Suffrage in the\nMeasurement of Democracy: Problems of Operationalization”,\n<em>Studies in Comparative International Development</em>, 35(3):\n92–111. doi:10.1007/BF02699767",
                "Pinnick, Cassandra L., 1994, “Feminist Epistemology:\nImplications for Philosophy of Science”, <em>Philosophy of\nScience</em>, 61(4): 646–657. doi:10.1086/289827",
                "–––, 2005, “The Failed Feminist Challenge\nto ‘Fundamental Epistemology’”, <em>Science &amp;\nEducation</em>, 14(2): 103–116.\ndoi:10.1007/s11191-004-9515-8",
                "Pitts-Taylor, Victoria, 2016a, <em>The Brain’s Body:\nNeuroscience and Corporeal Politics</em>, Durham, NC: Duke University\nPress.",
                "–––, 2016b, “Mattering: Feminism, Science,\nand Corporeal Politics”, in Pitts-Taylor 2016c: 1–20.",
                "––– (ed.), 2016c, <em>Mattering: Feminism,\nScience, and Materialism</em>, New York: New York University\nPress.",
                "Porter, Theodore M., 1995, <em>Trust in Numbers: The Pursuit of\nObjectivity in Science and Public Life</em>, Princeton, NJ: Princeton\nUniversity Press.",
                "Richardson, Sarah S., 2012, “Sexing the X: How the X Became\nthe ‘Female Chromosome’”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 37(4): 909–933.\ndoi:10.1086/664477",
                "–––, 2013, <em>Sex Itself: The Search for Male\nand Female in the Human Genome</em>, Chicago, IL: University of\nChicago Press.",
                "Rolin, Kristina, 2006, “The Bias Paradox in Feminist\nStandpoint Epistemology”, <em>Episteme</em>, 3(1–2):\n125–136. doi:10.3366/epi.2006.3.1-2.125",
                "–––, 2009, “Standpoint Theory as a\nMethodology for the Study of Power Relations”, <em>Hypatia</em>,\n24(4): 218–226. doi:10.1111/j.1527-2001.2009.01070.x",
                "Roy, Deboleena and Banu Subramaniam, 2016, “Matter in the\nShadows: Feminist New Materialism and the Practices of\nColonialism”, in Pitts-Taylor 2016c: 23–42.",
                "Schiebinger, Londa, 1999, <em>Has Feminism Changed Science?</em>\nCambridge, MA: Harvard University Press.",
                "Sent, Esther-Mirjam and Irene van Staveren, 2019, “A\nFeminist Review of Behavioral Economic Research on Gender\nDifferences”, <em>Feminist Economics</em>, 25(2): 1–35.\ndoi:10.1080/13545701.2018.1532595",
                "Smith, Dorothy E., 1987, <em>The Everyday World as\nProblematic</em>, Boston, MA: Northeastern University Press.",
                "Solomon, Miriam, 2001, <em>Social Empiricism</em>, Cambridge, MA:\nMIT Press.",
                "–––, 2012, “The Web of Valief: An\nAssessment of Feminist Radical Empiricism”, in Crasnow and\nSuperson 2012: 435–450.",
                "Spanier, Bonnie B., 1995, <em>Im/Partial Science: Gender Ideology\nin Molecular Biology</em>, Bloomington, IN: Indiana University\nPress.",
                "Sprague, Joey, 2016, <em>Feminist Methodologies for Critical\nResearchers: Bridging Differences</em>, Lanham, MD: Rowman &amp;\nLittlefield Publishers.",
                "Stacey, Judith and Barrie Thorne, 1985, “The Missing\nFeminist Revolution in Sociology”, <em>Social Problems</em>,\n32(4): 301–316. doi:10.2307/800754",
                "Steele, Claude M., 1997, “A Threat in the Air: How\nStereotypes Shape Intellectual Identity and Performance.”,\n<em>American Psychologist</em>, 52(6): 613–629.\ndoi:10.1037/0003-066X.52.6.613",
                "Stewart, Abigail J., Anne P. Copeland, Nia Lane Chester, Janet E.\nMalley, and Nicole B. Barenbaum, 1997, <em>Separating Together: How\nDivorce Transforms Families</em>, New York: Guilford Press.",
                "Valian, Vivian, 1999, <em>Why So Slow? The Advancement of\nWomen</em>, Cambridge MA: MIT Press.",
                "van Anders, Sari M., Jeffrey Steiger, and Katherine L. Goldey,\n2015, “Effects of Gendered Behavior on Testosterone in Women and\nMen”, <em>Proceedings of the National Academy of Sciences</em>,\n112(45): 13805–13810. doi:10.1073/pnas.1509591112",
                "Wallerstein, Judith and Joan Kelly, 1980, <em>Surviving the\nBreakup</em>, New York: Basic Books.",
                "Wylie, Alison, 2003, “Why Standpoint Matters”, in\n<em>Science and Other Cultures: Issues in Philosophies of Science and\nTechnology</em>, Robert Figueroa and Sandra Harding (eds), New York:\nRoutledge, pp. 26–48.",
                "–––, 2011, “What Knowers Know Well: Women,\nWork and the Academy”, in Grasswick 2011: 157–179.\ndoi:10.1007/978-1-4020-6835-5_8",
                "Wylie, Alison, Elizabeth Potter, and Wenda K. Bauchspies, 2010,\n“Feminist Perspectives on Science”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2010 Edition), Edward N. Zalta\n(ed.), URL =\n <a href=\"https://plato.stanford.edu/archives/spr2010/entries/feminist-science/\" target=\"other\">https://plato.stanford.edu/archives/spr2010/entries/feminist-science/</a>.",
                "Yap, Audrey, 2016, “Feminist Radical Empiricism, Values, and\nEvidence”, <em>Hypatia</em>, 31(1): 58–73.\ndoi:10.1111/hypa.12221\n</ul>\n<h3 id=\"AddiRead\">"
            ],
            "Additional Readings": [
                "</h3>\n<ul class=\"hanging\">",
                "Almassi, Ben, 2019, “Beyond Science Wars Redux: Feminist\nPhilosophy of Science as Trustworthy Science Criticism”,\n<em>Hypatia</em>, 34(4): 858–868. doi:10.1111/hypa.12500",
                "Amoretti, Maria Cristina and Nicla Vassallo (eds), 2016,\n<em>Meta-Philosophical Reflection on Feminist Philosophies of\nScience</em>, (Boston Studies in the Philosophy and History of Science\n317), Cham: Springer International Publishing.\ndoi:10.1007/978-3-319-26348-9",
                "Barad, Karen, 2003, “Posthumanist Performativity: Toward an\nUnderstanding of How Matter Comes to Matter”, <em>Signs: Journal\nof Women in Culture and Society</em>, 28(3): 801–831.\ndoi:10.1086/345321",
                "Bleier, Ruth (ed.), 1986, <em>Feminist Approaches to Science</em>,\nNew York: Routledge",
                "Blizzard, Deborah, 2007, <em>Looking Within: A Socio-cultural\nExamination of Fetoscopy</em>, Cambridge, MA: MIT Press.",
                "Bug, Amy, 2003, “Has Feminism Changed Physics?”,\n<em>Signs: Journal of Women in Culture and Society</em>, 28(3):\n881–899. doi:10.1086/345323",
                "Campion, Patricia and Wesley Shrum, 2004, “Gender and\nScience in Development: Women Scientists in Ghana, Kenya, and\nIndia”, <em>Science, Technology, &amp; Human Values</em>, 29(4):\n459–485. doi:10.1177/0162243904265895",
                "Chilly Collective, 1995, <em>Breaking Anonymity: The Chilly\nClimate for Women Faculty</em>, Waterloo ON: Wilfrid Laurier\nUniversity Press.",
                "Code, Lorraine, 1993, “Taking Subjectivity into\nAccount”, in Alcoff and Potter 1993: 15–48.",
                "–––, 1991, <em>What Can She Know?</em> Ithaca,\nNY: Cornell University Press.",
                "Cole, Jonathan R., 1979, <em>Fair Science: Women in the Scientific\nCommunity</em>, New York: The Free Press.",
                "Crasnow, Sharon, 2018, “Contemporary Standpoint Theory:\nTensions, Integrations, and Extensions”, in Garavaso 2018:\n188–211.",
                "Crasnow, Sharon and Kristen Intemann (eds), forthcoming, <em>The\nRoutledge Handbook of the Philosophy of Science</em>, New York:\nRoutledge.",
                "Dahlberg, Frances (ed.), 1981, <em>Woman the Gatherer</em>, New\nHaven, CT: Yale University Press.",
                "Douglas, Heather, 2009, <em>Science, Policy, and the Value Free\nIdeal</em>, Pittsburgh, PA: Pittsburgh University Press.",
                "Ebbersmeyer, Sabrina and Gianni Paganini (eds.), 2020, <em>Women,\nPhilosophy and Science: Italy and Early Modern Europe</em>, (Women in\nthe History of Philosophy and Sciences 4), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-030-44548-5",
                "Elliott, Kevin C. and Daniel Steel (eds.), 2017, <em>Current\nControversies in Values and Science</em>, New York: Routledge.\ndoi:10.4324/9781315639420",
                "Fausto-Sterling, Anne, 1985, <em>Myths of Gender: Biological\nTheories About Women and Men</em>, New York: Basic Books.",
                "Fedigan, Linda Marie, 1986, “The Changing Role of Women in\nModels of Human Evolution”, <em>Annual Review of\nAnthropology</em>, 15(1): 25–66.\ndoi:10.1146/annurev.an.15.100186.000325",
                "Fedigan, Linda Marie and Laurence Fedigan, 1989, “Gender and\nthe Study of Primates”, in <em>Gender and Anthropology: Critical\nReviews for Research and Teaching</em>, Sandra Morgen (ed.),\nWashington, DC: American Anthropological Association, pp.\n41–64.",
                "Fonow, Mary Margaret and Judith A. Cook, 2005, “Feminist\nMethodology: New Applications in the Academy and Public Policy”,\n<em>Signs: Journal of Women in Culture and Society</em>, 30(4):\n2211–2236. doi:10.1086/428417",
                "Fonow, Mary Margaret and Judith A. Cook (eds), 1991, <em>Beyond\nMethodology: Feminist Scholarship as Lived Research</em>, Bloomington,\nIN: Indiana University Press.",
                "Fortmann, Louise (ed.), 2008, <em>Participatory Research in\nConservation and Rural Livelihoods: Doing Science Together</em>,\nLondon: Wiley-Blackwell.",
                "Fujimura, Joan H., 2006, “Sex Genes: A Critical\nSociomaterial Approach to the Politics and Molecular Genetics of Sex\nDetermination”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 32(1): 49–82. doi:10.1086/505612",
                "Garry, Ann, Serene J. Khader, and Alison Stone (eds.), 2017,\n<em>The Routledge Companion to Feminist Philosophy</em>, New York:\nRoutledge. doi:10.4324/9781315758152",
                "Ginther, Donna K., 2004, “Why Women Earn Less: Economic\nExplanations for the Gender Salary Gap in Science”, <em>AWIS\nMagazine</em>, 33: 6–10.",
                "Goodman, Alan H., Deborah Heath, and M. Susan Lindee (eds.), 2003,\n<em>Genetic Nature/Culture: Anthropology and Science beyond the\nTwo-Culture Divide</em>, Berkeley, CA: University of California\nPress.",
                "Greaves, Lorraine, Alison Wylie, Cheryl Champagne, Louise Karch,\nRuth Lapp, Julie Lee and Bina Osthoff, 1995, “Women and\nViolence: Feminist Practice and Quantitative Method”, in\n<em>Changing Methods: Feminist Transforming Practice</em>, Sandra Burt\nand Lorraine Code (eds.), Peterborough ON: Broadview Press, pp.\n301–326.",
                "Greenwood, Mary Rita Cooke, 2000, “Plenary IV: Advancing\nWomen into Science Leadership”, <em>Who Will Do the Science of\nthe Future? A Symposium on Careers of Women in Science</em> Washington\nDC: National Academy Press, pp. 57–74.",
                "Hall, Kim Q., 2017, “Feminist and Queer Intersections with\nDisability Studies”, in Garry, Khader, and Stone 2017: 405–418.",
                "–––, 2002, “Feminism, Disability, and\nEmbodiment”, <em>NWSA Journal</em>, Special Issue: Feminist\nDisability Studies, 14(3): vii–xii.\ndoi:10.1353/nwsa.2003.0006",
                "Hammonds, Evelynn and Banu Subramaniam, 2003, “A\nConversation on Feminist Science Studies”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 28(3): 923–944.\ndoi:10.1086/345455",
                "Haraway, Donna, 1989, <em>Primate Visions: Gender, Race, and\nNature in the World of Modern Science</em>, New York: Routledge.",
                "–––, 1991, <em>Simians, Cyborgs, and Women: The\nReinvention of Nature</em>, New York, Routledge.",
                "Harding, Sandra, 1991, <em>Whose Science? Whose Knowledge?\nThinking from Women’s Lives</em>, Ithaca, NY: Cornell University\nPress.",
                "–––, 1993, <em>The “Racial” Economy\nof Science: Toward a Democratic Future</em>, Bloomington, IN: Indiana\nUniversity Press.",
                "––– (ed.), 2006, <em>Science and Social\nInequality: Feminist and Postcolonial Issues</em>, Urbana and Chicago:\nUniversity of Illinois Press.",
                "Harding, Sandra and Kathryn Norberg, 2005, “New Feminist\nApproaches to Social Science Methodologies: An Introduction”,\n<em>Signs: Journal of Women in Culture and Society</em>, 30(4):\n2009–2015. doi:10.1086/428420",
                "Hastorf, Christine A., 1991, “Gender, Space, and Food in\nPrehistory”, in <em>Engendering Archaeology: Women and\nPrehistory</em>, Joan M. Gero and Margaret W. Conkey (eds.), Oxford:\nBlackwell, 132–159.",
                "Hesse-Biber, Sharlene (ed.), 2011, <em>Handbook of Feminist\nResearch</em>, second edition, New York: Sage.",
                "Hesse-Biber, Sharlene and Michelle L. Yaiser, 2004, <em>Feminist\nPerspectives on Social Research</em>, New York: Oxford University\nPress.",
                "Hubbard, Ruth, 2003, “Science, Power, Gender: How DNA Became\nthe Book of Life”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 28(3): 791–799. doi:10.1086/345334",
                "–––, 1990, <em>The Politics of Women’s\nBiology</em>, New Brunswick, NJ: Rutgers University Press.",
                "Kafer, Alison, 2003, “Compulsory Bodies: Reflections on\nHeterosexuality and Able- bodiedness”, <em>Journal of\nWomen’s History</em>, 15(3): 77–89",
                "Keller, Evelyn Fox, 1983, <em>A Feeling for the Organism: The Life\nand Work of Barbara McClintock</em>, New York: W. H. Freeman and\nCompany.",
                "–––, 1992, <em>Secrets of Life, Secrets of\nDeath: Essays on Language, Gender and Science</em>, New York:\nRoutledge.",
                "–––, 1995, “The Origin, History, and\nPolitics of the Subject Called ‘Gender and Science’: A\nFirst Person Account”, in <em>Handbook of Science and Technology\nStudies</em>, Sheila Jasanoff, Gerald E. Markle, James C. Petersen,\nand Trevor Pinch (eds.), Thousand Oaks, CA: Sage Publications,\n80–94.",
                "–––, 2011, <em>The Mirage of a Space Between\nNature and Nurture</em>, Durham, NC: Duke University Press.",
                "Kitcher, Philip, 2011, <em>Science in a Democratic Society</em>,\nAmherst, NY: Prometheus Books.",
                "Kittay, Eva, Anita Silvers, and Susan Wendell (eds.), 2001,\n<em>Feminism and Disability</em>, Special Issue of <em>Hypatia</em>,\n16(4).",
                "Kourany, Janet, 2017, “Philosophy of Science and the\nFeminist Legacy”, in Garry, Khader, and Stone 2017:\n303–313.",
                "Lloyd, Elisabeth A., 1993, “Pre-Theoretical Assumptions in\nEvolutionary Explanations of Female Sexuality”,\n<em>Philosophical Studies</em>, 69(2–3): 139–153.\ndoi:10.1007/BF00990080",
                "Longino, Helen E., 1995, “Gender, Politics, and the\nTheoretical Virtues”, <em>Synthese</em>, 104(3): 383–397.\ndoi:10.1007/BF01064506",
                "Longino, Helen and Ruth Doell, 1983, “Body, Bias, and\nBehavior: A Comparative Analysis of Reasoning in Two Areas of\nBiological Science”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 9(2): 206–227. doi:10.1086/494044",
                "Nelson, Lynn Hankinson, 1993, “Epistemological\nCommunities”, in Alcoff and Potter 1993: 121–159.",
                "–––, 1995, “A Feminist Naturalized\nPhilosophy of Science”, <em>Synthese</em>, 104(3):\n399–421. doi:10.1007/BF01064507",
                "–––, 1996, “Empiricism Without\nDogmas”, in <em>Feminism, Science, and the Philosophy of\nScience</em>, Lynn H. Nelson and Jack Nelson (eds.), Dordrecht, Boston\nand London: Kluwer Academic Publishers, pp. 95–119.",
                "–––, 2018, “Feminist Philosophies of\nScience: The Social and Contextual Nature of Science”, in\nGaravaso 2018: 236–259.",
                "Newcombe, Nora S., 2010, “On Tending to Our Scientific\nKnitting: Thinking About Gender in the Context of Evolution”, in\n<em>Handbook of Gender Research in Psychology, Volume 1: Gender\nResearch in General and Experimental Psychology</em>, Joan C. Chrisler\nand Donald R. McCreary (eds.), New York, NY: Springer New York,\n259–274. doi:10.1007/978-1-4419-1465-1_13",
                "Meynell, Letitia, 2012, “Evolutionary Psychology, Ethology,\nand Essentialism (Because What They Don’t Know Can Hurt\nUs)”, <em>Hypatia</em>, 27(1): 3–27.\ndoi:10.1111/j.1527-2001.2011.01240.x",
                "Pohlhaus, Gaile, 2002, “Knowing Communities: An\nInvestigation of Harding’s Standpoint Epistemology”,\n<em>Social Epistemology</em>, 16(3): 283–293.\ndoi:10.1080/0269172022000025633",
                "Pérez Sedeño, E., 2001, “Gender: The Missing\nFactor in STS”, in <em>Visions of STS: Counterpoints in Science,\nTechnology and Society Studies</em>, Stephen H. Cutcliffe and Carl\nMitcham (eds.), Albany, NY: SUNY Press, pp. 123–138.",
                "Potter, Elizabeth, 1995, “Good Science and Good Philosophy\nof Science”, <em>Synthese</em>, 104(3): 423–439.\ndoi:10.1007/BF01064508",
                "–––, 2001, <em>Gender and Boyle’s Law of\nGases</em>, Bloomington, IN: Indiana University Press.",
                "Ramazanoglu, Caroline with Janet Holland, 2002, <em>Feminist\nMethodology: Challenges and Choices</em>, Thousand Oaks, CA: Sage\nPublications.",
                "Reardon, Jenny, 2005, <em>Race to the Finish: Identity and\nGovernance in an Age of Genomics</em>, Princeton, NJ: Princeton\nUniversity Press.",
                "Reinharz, Shulamit, 1992, <em>Feminist Methods in Social\nResearch</em>, New York: Oxford University Press.",
                "Richardson, Sarah S., 2010, “Feminist Philosophy of Science:\nHistory, Contributions, and Challenges”, <em>Synthese</em>,\n177(3): 337–362. doi:10.1007/s11229-010-9791-6",
                "Rose, Hilary, 1983, “Hand, Brain, and Heart: A Feminist\nEpistemology for the Natural Sciences”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 9(1): 73–90.\ndoi:10.1086/494025",
                "–––, 1994, <em>Love, Power and Knowledge:\nTowards a Feminist Transformation of the Sciences</em>, Cambridge, MA:\nPolity Press.",
                "Rosser, Sue V., 2002, “Twenty-five Years of NWSA: Have We\nBuilt the Two-Way Streets Between Women’s Studies and Women in\nScience and Technology?” <em>NWSA Journal</em>, 14(1):\n103–128. doi: 10.1353/nwsa.2002.0017",
                "Rossiter, Margaret, 1982, <em>Women Scientists in America:\nStruggles and Strategies to 1940</em>, Baltimore, MD: Johns\nHopkins.",
                "–––1995, <em>Women Scientists in America: Before\nAffirmative Action, 1940–1972</em>, Baltimore, MD: Johns Hopkins\nUniversity Press.",
                "Roughgarden, Joan, 2013, <em>Evolution’s Rainbow: Diversity,\nGender, and Sexuality in Nature and People</em>, Berkeley, CA:\nUniversity of California Press.",
                "Schiebinger, Londa 1989, <em>The Mind Has No Sex? Women in the\nOrigins of Modern Science</em>, Cambridge: Cambridge University\nPress.",
                "–––, 1999, “How Women Contribute”,\n<em>Science</em>, 285(5429): 835b–8835.\ndoi:10.1126/science.285.5429.835b",
                "––– (ed.), 2003, <em>Gender and Science: New\nIssues</em>, special issue of <em>Signs: Journal of Women in Culture\nand Society</em>, 28(3).",
                "Smith, Dorothy E., 1974, “Women’s Perspective as a\nRadical Critique of Sociology”, <em>Sociological Inquiry</em>,\n44(1): 7–13. doi:10.1111/j.1475-682X.1974.tb00718.x",
                "Smith, Dorothy E., 1978, “A Peculiar Eclipsing:\nWomen’s Exclusion from Man’s Culture”,\n<em>Women’s Studies International Quarterly</em>, 1(4):\n281–295. doi:10.1016/S0148-0685(78)91175-2",
                "Sonnert, Gerhard and Gerald Holton, 1995, <em>Who Succeeds in\nScience? The Gender Dimension</em>, New Brunswick, NJ: Rutgers\nUniversity Press.",
                "Sperling, Susan, 1991, “Baboons with Briefcases: Feminism,\nFunctionalism, and Sociobiology in the Evolution of Primate\nGender”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 17(1): 1–27. doi:10.1086/494711",
                "Squier, Susan and Melissa M. Littlefield, 2004, “Feminist\nTheory and/of Science: Feminist Theory Special Issue”,\n<em>Feminist Theory</em>, 5(2): 123–126.\ndoi:10.1177/1464700104045403",
                "Star, Susan Leigh (ed.), 1995, <em>Ecologies of Knowledge: Work\nand Politics in Science and Technology</em>, Albany, NY: SUNY\nPress.",
                "Strum, Shirley C. and Linda Marie Fedigan (eds.), 2000,\n<em>Primate Encounters: Models of Science, Gender, and Society</em>,\nChicago: University of Chicago Press.",
                "Suchman, Lucy, 2008, “Feminist STS and the Sciences of the\nArtificial”, in <em>The Handbook of Science and Technology\nStudies</em>, third edition, Edward J. Hackett, Olga Amsterdamska,\nMichael E. Lynch, and Judy Wajcman (eds.), Cambridge, Massachusetts\nand London: The MIT Press, pp. 139–164.",
                "Symons, Donald, 1979, <em>The Evolution of Human Sexuality</em>\nNew York: Oxford University Press.",
                "Tejani, Sheba, 2019, “What’s Feminist about Feminist\nEconomics?”, <em>Journal of Economic Methodology</em>, 26(2):\n99–117. doi:10.1080/1350178X.2018.1556799",
                "Watson, Patty Jo and Mary C. Kennedy, 1991, “The Development\nof Horticulture in the Eastern Woodlands of North America:\nWomen’s Role”, in <em>Engendering Archaeology: Women and\nPrehistory</em>, Joan M. Gero and Margaret W. Conkey (eds.), Oxford:\nBlackwell, 276–300.",
                "Wertheim, Margaret, 1995, <em>Pythagoras’ Trousers: God,\nPhysics and the Gender Wars</em>, New York: Random House.",
                "Whelan, Emma, 2001, “Politics by Other Means: Feminism and\nMainstream Science Studies”, <em>Canadian Journal of Sociology /\nCahiers Canadiens de Sociologie</em>, 26(4): 535–581.\ndoi:10.2307/3341492",
                "Wyer, Mary, Mary Barbercheck, Donna Cookmeyer, Hatice\nÖztürk, and Marta Wayne (eds), 2014, <em>Women, Science and\nTechnology: A Reader in Feminist Science Studies</em>, third edition,\nNew York: Routledge. doi:10.4324/9780203427415",
                "Wylie, Alison, 1992, “Reasoning About Ourselves: Feminist\nMethodology in the Social Sciences”, in <em>Women and\nReason</em>, Elizabeth Harvey and Kathleen Okruhlik (eds.), Ann Arbor,\nMI: University of Michigan Press, pp. 611–624.",
                "–––, 1995, “The Contexts of Activism on\n‘Climate’ Issues”, in <em>Breaking Anonymity: The\nChilly Climate for Women Faculty</em>, The Chilly Collective (eds.),\nWaterloo, Ontario: Wilfrid Laurier University Press, pp.\n26–60.",
                "–––, 2007, “The Feminism Question in\nScience: What Does It Mean to ‘Do Social Science as a\nFeminist’?”, in <em>Handbook of Feminist Research: Theory\nand Praxis</em>, Sharlene Hesse-Biber (ed.), New York: Sage, pp.\n567–577. doi:10.4135/9781483384740.n26",
                "–––, 2017, “What Knowers Know Well:\nStandpoint Theory and the Formation of Gender Archaeology”,\n<em>Scientiae Studia</em> 15(1): 13–38.",
                "Wylie, Alison, Janet R. Jakobsen, and Gisela Fosado, 2008,\n<em>Women, Work, and the Academy: Strategies for Responding to\n‘Post-civil Rights Era’ Gender Discrimination</em>, (New\nFeminist Solutions, 2), New York: Barnard Center for Research on Women\n [<a href=\"https://bcrw.barnard.edu/publications/women-work-academy/\" target=\"other\">Wylie, Jakobsen, and Fosado 2008 available online</a>].",
                "Xie, Yu and Kimberlee A. Shauman, 2003, <em>Women in Science:\nCareer Processes and Outcomes</em>, Cambridge MA: Harvard University\nPress.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3>Sources Cited</h3>\n<ul class=\"hanging\">\n<li>Alcoff, Linda and Elizabeth Potter (eds.), 1993, <em>Feminist\nEpistemologies</em>, New York: Routledge.\ndoi:10.4324/9780203760093</li>\n<li>Altmann, Jeanne, 1974, “Observational Study of Behavior:\nSampling Methods”, <em>Behaviour</em>, 49(3–4):\n227–266. doi:10.1163/156853974X00534</li>\n<li>American Association of University Women (AAUW), 2010, <em>Why So\nFew? Women in Science, Technology, Engineering, and Mathematics</em>,\nWashington, DC: American Association of University Women.</li>\n<li>Anderson, Elizabeth, 1995a, “Feminist Epistemology: An\nInterpretation and a Defense”, <em>Hypatia</em>, 10(3):\n50–84. doi:10.1111/j.1527-2001.1995.tb00737.x</li>\n<li>–––, 1995b, “Knowledge, Human Interests,\nand Objectivity in Feminist Epistemology”:, <em>Philosophical\nTopics</em>, 23(2): 27–58. doi:10.5840/philtopics199523213</li>\n<li>–––, 2004, “Uses of Value Judgments in\nScience: A General Argument, with Lessons from a Case Study of\nFeminist Research on Divorce”, <em>Hypatia</em>, 19(1):\n1–24. doi:10.1111/j.1527-2001.2004.tb01266.x</li>\n<li>Bairey Merz, C. Noel, Holly Andersen, Emily Sprague, Adam Burns,\nMark Keida, Mary Norine Walsh, Phyllis Greenberger, Susan Campbell,\nIrene Pollin, Cassandra McCullough, et al., 2017, “Knowledge,\nAttitudes, and Beliefs Regarding Cardiovascular Disease in\nWomen”, <em>Journal of the American College of Cardiology</em>,\n70(2): 123–132. doi:10.1016/j.jacc.2017.05.024</li>\n<li>Barad, Karen, 2007, <em>Meeting the Universe Halfway: Quantum\nPhysics and the Entanglement of Matter and Meaning</em>, Durham, NC:\nDuke University Press.</li>\n<li>Barker, Drucilla K., 1995, “Economists, Social Reformers,\nand Prophets: A Feminist Critique of Economic Efficiency”,\n<em>Feminist Economics</em>, 1(3): 26–39.\ndoi:10.1080/714042247</li>\n<li>Barker, Drucilla K. and Edith Kuiper, 2003, <em>Towards a Feminist\nPhilosophy of Economics</em>, London/New York: Routledge.</li>\n<li>Baron-Cohen, Simon, 2003, <em>The Essential Difference: Men, Women\nand the Extreme Male Brain</em>, London: Allen Lane.</li>\n<li>Bluhm, Robyn, Anne Jaap Jacobson, and Heidi Lene Maibom (eds),\n2012, <em>Neurofeminism: Issues at the Intersection of Feminist Theory\nand Cognitive Science</em>, London: Palgrave Macmillan UK.\ndoi:10.1057/9780230368385</li>\n<li>Bright, Liam Kofi, Daniel Malinsky, and Morgan Thompson, 2016,\n“Causally Interpreting Intersectionality Theory”,\n<em>Philosophy of Science</em>, 83(1): 60–81.\ndoi:10.1086/684173</li>\n<li>Brister, Evelyn, 2018, “Objectivity in Science”, in\nGaravaso 2018: 212–235.</li>\n<li>Cipolla, Cyd, Kristina Gupta, David A. Rubin, and Angela Willey\n(eds), 2017, <em>Queer Feminist Science Studies: A Reader</em>,\nSeattle, WA: University of Washington Press.</li>\n<li>Clough, Sharyn, 2003a, <em>Beyond Epistemology: A Pragmatist\nApproach to Feminist Science Studies</em>, Lanham, MD: Rowman and\nLittlefield.</li>\n<li>–––, 2003b, “Introduction”, in\n<em>Siblings Under the Skin: Feminism, Social Justice and Analytic\nPhilosophy</em>, Sharyn Clough (ed.), Aurora, CO: Davies Group\nPublishers.</li>\n<li>–––, 2011, “Gender and the Hygiene\nHypothesis”, <em>Social Science &amp; Medicine</em>, 72(4):\n486–493. doi:10.1016/j.socscimed.2010.11.021</li>\n<li>–––, 2012, “The Analytic Tradition,\nRadical (Feminist) Interpretation, and the Hygiene Hypothesis”,\nin Crasnow and Superson 2012: 405–434.</li>\n<li>Clough, Sharyn and William E. Loges, 2008, “Racist Value\nJudgments as Objectively False Beliefs: A Philosophical and\nSocial-Psychological Analysis”, <em>Journal of Social\nPhilosophy</em>, 39(1): 77–95.\ndoi:10.1111/j.1467-9833.2007.00412.x</li>\n<li>Collins, Patricia Hill, 1986, “Learning from the Outsider\nWithin: The Sociological Significance of Black Feminist\nThought”, <em>Social Problems</em>, 33(6): S14–S32.\ndoi:10.2307/800672</li>\n<li>–––, 1990 [2000/2009], <em>Black Feminist\nThought: Knowledge, Consciousness, and the Politics of\nEmpowerment</em>, Boston: Unwin Hyman. Second revised edition, New\nYork: Routledge, 2000/Routledge Classics, 2009.</li>\n<li>Crasnow, Sharon, 2013, “Feminist Philosophy of Science:\nValues and Objectivity”, <em>Philosophy Compass</em>, 8(4):\n413–423. doi:10.1111/phc3.12023</li>\n<li>–––, 2014, “Feminist Standpoint\nTheory”, in <em>Philosophy of Social Science: A New\nIntroduction</em>, Nancy Cartwright and Eleonora Montuschi (eds),\nOxford: Oxford University Press, pp. 145–161.</li>\n<li>Crasnow, Sharon L. and Anita M. Superson (eds), 2012, <em>Out from\nthe Shadows: Analytical Contributions to Traditional Philosophy</em>,\nNew York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199855469.001.0001</li>\n<li>Crasnow, Sharon, Alison Wylie, Wenda K. Bauchspies, and Elizabeth\nPotter, 2015 [2018], “Feminist Perspectives on Science”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2018\nEdition), Edward N. Zalta (ed.), URL =\n <a href=\"https://plato.stanford.edu/archives/spr2018/entries/feminist-science/\" target=\"other\">https://plato.stanford.edu/archives/spr2018/entries/feminist-science/</a>.</li>\n<li>Dalla Costa, Mariarosa and Selma James, 1972, <em>The Power of\nWomen and the Subversion of Community</em>, Bristol, UK: Falling Wall\nPress.</li>\n<li>de Melo-Martín, Inmaculada, 2017, <em>Rethinking\nReprogenetics: Enhancing Ethical Analyses of Reprogenetic\nTechnologies</em>, Oxford: Oxford University Press.\ndoi:10.1093/med/9780190460204.001.0001</li>\n<li>DeVault, Marjorie, 1999, <em>Liberating Method: Feminism and\nSocial Research</em>, Philadephia, PA: Temple University Press.</li>\n<li>D’Ignazio, Catherine and Lauren F. Klein, 2020, <em>Data\nFeminism</em>, Cambridge, MA: Massachusetts Institute of Technology\nPress.</li>\n<li>Doell, Ruth G. and Helen E. Longino, 1988, “Sex Hormones and\nHuman Behavior:: A Critique of the Linear Model”, <em>Journal of\nHomosexuality</em>, 15(3–4): 55–78.\ndoi:10.1300/J082v15n03_03</li>\n<li>Dotson, Kristie, 2011, “Tracking Epistemic Violence,\nTracking Practices of Silencing”, <em>Hypatia</em>, 26(2):\n236–257. doi:10.1111/j.1527-2001.2011.01177.x</li>\n<li>Dussauge, Isabelle and Anelis Kaiser, 2012, “Re-Queering the\nBrain”, in Bluhm, Jacobson, and Maibom 2012: 121–144.</li>\n<li>Eichler, Margrit and Jeanne Lapointe, 1985, <em>On the Treatment\nof the Sexes in Research</em>, Ottawa, ON: Social Sciences and\nHumanities Research Council of Canada.</li>\n<li>Elliott, Kevin C., 2017, <em>A Tapestry of Values: An Introduction\nto Values in Science</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190260804.001.0001</li>\n<li>Fausto-Sterling, Anne, 2000, <em>Sexing the Body: Gender Politics\nand the Construction of Sexuality</em>, New York: Basic Books.</li>\n<li>Federici, Silvia, 1975 [2020], “Wages Against\nHousework”, Bristol, UK: Power of Women Collective and the\nFalling Wall Press. Reprinted in <em>Revolution at Point Zero:\nHousework, Reproduction, and Feminist Struggle</em>, Oakland, CA: PM\nPress, pp. 1–18.</li>\n<li>Fehr, Carla, 2011, “What Is in It for Me? The Benefits of\nDiversity in Scientific Communities”, in Grasswick 2011:\n133–155. doi:10.1007/978-1-4020-6835-5_7</li>\n<li>Feng, Jing, Ian Spence, and Jay Pratt, 2007, “Playing an\nAction Video Game Reduces Gender Difference in Spatial\nCognition”, <em>Psychological Science</em>, 10: 850–855.\ndoi: 10.1111/j.1467-9280.2007.01990.x</li>\n<li>Fine, Cordelia, 2010, <em>Delusions of Gender: How our Minds,\nSociety, and Neurosexism Create Difference</em>, New York:\nNorton.</li>\n<li>Fricker, Miranda, 2007, <em>Epistemic Injustice: Power and the\nEthics of Knowing</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198237907.001.0001</li>\n<li>Garavaso, Pieranna (ed.), 2018, <em>The Bloomsbury Companion to\nAnalytic Feminism</em>, London: Bloomsbury Academic.</li>\n<li>Grasswick, Heidi E. (ed.), 2011, <em>Feminist Epistemology and\nPhilosophy of Science: Power in Knowledge</em>, Dordrecht: Springer\nNetherlands. doi:10.1007/978-1-4020-6835-5</li>\n<li>Grossi, Giordana and Cordelia Fine, 2012, “The Role of Fetal\nTestosterone in the Development of the ‘Essential\nDifferences’ Between the Sexes: Some Essential Issues”, in\nBluhm, Jacobson, and Maibom 2012: 73–104.</li>\n<li>Haack, Susan, 1993, “Epistemological Reflections of an Old\nFeminist”, <em>Reason Papers</em>, 18: 31–43.\n [<a href=\"https://reasonpapers.com/pdf/18/rp_18_3.pdf\" target=\"other\">Haack 1993 available online</a>]</li>\n<li>Haraway, Donna, 1992, “The Promises of Monsters: A\nRegenerative Politics for Inappropriate/d Others”, in\n<em>Cultural Studies</em>, Lawrence Grossberg, Cary Nelson, and Paula\nTreichler (eds), New York: Routledge, pp. 295–337.</li>\n<li>Harding, Sandra, 1986, <em>The Science Question in Feminism</em>,\nIthaca NY: Cornell University Press.</li>\n<li>–––, 1987, “Is There a Feminist\nMethod?” in <em>Feminism and Methodology: Social Science\nIssues</em>, Sandra Harding (ed.), Bloomington, IN: Indiana University\nPress, pp. 1–14.</li>\n<li>–––, 2004a, “Rethinking Standpoint\nEpistemology: What is ‘Strong Objectivity?’”, in\nHarding (ed.) 2004c: 127–140.</li>\n<li>–––, 2004b, “A Socially Relevant\nPhilosophy of Science? Resources from Standpoint Theory’s\nControversiality”, <em>Hypatia</em>, 19(1): 25–47.\ndoi:10.1111/j.1527-2001.2004.tb01267.x</li>\n<li>––– (ed.), 2004c, <em>The Feminist Standpoint\nTheory Reader</em>, New York: Routledge.</li>\n<li>–––, 2015, <em>Objectivity and Diversity:\nAnother Logic of Scientific Research</em>, Chicago, IL: University of\nChicago Press.</li>\n<li>–––, 2017, “Latin American Decolonial\nStudies: Feminist Issues”, <em>Feminist Studies</em>, 43(3):\n624–636. doi:10.15767/feministstudies.43.3.0624</li>\n<li>–––, 2019, “State of the Field: Latin\nAmerican Decolonial Philosophies of Science”, <em>Studies in\nHistory and Philosophy of Science Part A</em>, 78: 48–63.\ndoi:10.1016/j.shpsa.2018.10.001</li>\n<li>Himmelweit, Susan and Simon Mohun, 1977, “Domestic Labour\nand Capital”, <em>Cambridge Journal of Economics</em>, 1(1):\n15–31. doi:10.1093/oxfordjournals.cje.a035348</li>\n<li>Hoffman, Ginger, 2012, “What, If Anything, Can Neuroscience\nTell Us About Gender Differences?” in Bluhm, Jacobson, and\nMaibom 2012: 30–55.</li>\n<li>Intemann, Kristen, 2009, “Why Diversity Matters:\nUnderstanding and Applying the Diversity Component of the National\nScience Foundation’s Broader Impacts Criterion”,\n<em>Social Epistemology</em>, 23(3–4): 249–266.\ndoi:10.1080/02691720903364134</li>\n<li>–––, 2010, “25 Years of Feminist\nEmpiricism and Standpoint Theory: Where Are We Now?”,\n<em>Hypatia</em>, 25(4): 778–796.\ndoi:10.1111/j.1527-2001.2010.01138.x</li>\n<li>–––, 2011, “Diversity and Dissent in\nScience: Does Democracy Always Serve Feminist Aims?”, in\nGrasswick 2011: 111–132. doi:10.1007/978-1-4020-6835-5_6</li>\n<li>Johnson, Paula A., Sheila E. Widnall, and Frazier F. Benya, (eds),\n2018,<em>Sexual Harassment of Women Climate, Culture, and Consequences\nin Academic Sciences, Engineering, and Medicine (2018)</em>,\nWashington, DC: The National Academies Press.</li>\n<li>Jordan-Young, Rebecca, 2010, <em>Brain Storm: The Flaws in the\nScience of Sex Differences,</em> Cambridge, MA: Harvard University\nPress.</li>\n<li>Keller, Evelyn Fox, 1985, <em>Reflections on Gender and\nScience</em>, New Haven: Yale University Press.</li>\n<li>–––, 2001, “Making a Difference: Feminist\nMovement and Feminist Critique of Science”, in <em>Feminism in\nTwentieth-Century Science, Technology, and Medicine</em>, Angela N.H.\nCreager, Elizabeth Lunbeck, and Londa Schiebinger (eds), Chicago:\nUniversity of Chicago Press, pp. 98–109.</li>\n<li>Kincaid, Harold, John Dupré, and Alison Wylie (eds), 2007,\n<em>Value-Free Science? Ideals and Illusions</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780195308969.001.0001</li>\n<li>Kitcher, Philip, 1993, <em>The Advancement of Science: Science\nWithout Legend, Objectivity Without Illusions</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0195096533.001.0001</li>\n<li>–––, 2001, <em>Science, Truth, and\nDemocracy</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195145836.001.0001</li>\n<li>Kourany, Janet A., 2010, <em>Philosophy of Science after\nFeminism</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199732623.001.0001</li>\n<li>Kuhn, Thomas S., 1962 [1970], <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1977, <em>The Essential Tension: Selected\nStudies in Scientific Tradition and Change</em>, Chicago: University\nof Chicago Press.</li>\n<li>Lacey, Hugh, 1999, <em>Is Science Value Free? Values and\nScientific Understanding</em>, New York: Routledge.\ndoi:10.4324/9780203983195</li>\n<li>Lévi-Strauss, Claude, 1936, “Contribution a\nl’étude de l’organisation Sociale des Indiens\nBororo”, <em>Journal de La Société Des\nAméricanistes</em>, 28(2): 269–304.</li>\n<li>Lloyd, Elisabeth A., 1995, “Objectivity and the Double\nStandard for Feminist Epistemologies”, <em>Synthese</em>,\n104(3): 351–381. doi:10.1007/BF01064505</li>\n<li>–––, 2005, <em>The Case of the Female Orgasm:\nBias in the Science of Evolution</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Longino, Helen E., 1990, <em>Science as Social Knowledge</em>,\nPrinceton, NJ: Princeton University Press.</li>\n<li>–––, 1993, “Subjects, Power, and\nKnowledge: Description and Prescription in Feminist Philosophies of\nScience”, in Alcoff and Potter 1993: 101–120.</li>\n<li>–––, 2002, <em>The Fate of Knowledge</em>,\nPrinceton NJ: Princeton University Press.</li>\n<li>–––, 2013, <em>Studying Human Behavior: How\nScientists Investigate Aggression and Sexuality</em>, Chicago, IL:\nChicago University Press.</li>\n<li>Medina, José, 2013, <em>The Epistemology of Resistance:\nGender and Racial Oppression, Epistemic Injustice, and Resistant\nImaginations</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199929023.001.0001</li>\n<li>Merchant, Carolyn, 1980/90, <em>The Death of Nature: Women,\nEcology, and the Scientific Revolution</em>, New York: Harper and\nRow.</li>\n<li>Meynell, Letitia, 2012, “The Politics of Pictured Reality:\nLocating the Object from Nowhere in fMRI”, in Bluhm, Jacobson,\nand Maibom 2012: 11–29.</li>\n<li>MIT, Committee on Women Faculty in the School of Science, 1999,\n“A Study on the Status of Women Faculty in Science at\nMIT”, <em>The MIT Faculty Newsletter</em>, 11(4).\n [<a href=\"https://web.mit.edu/fnl/women/women.html\" target=\"other\">MIT 1999 available online</a>]</li>\n<li>Narayan, Uma, 2004, “The Project of Feminist Epistemology:\nPerspectives from a Nonwestern Feminist”, in Harding (ed.)\n2004c: 213–224.</li>\n<li>National Science Board, 2018, <em>Science &amp; Engineering\nIndicators</em>, NSB-2018-1. Alexandria, VA: National Science\nFoundation.\n [<a href=\"https://www.nsf.gov/statistics/2018/nsb20181/report\" target=\"other\">National Science Board 2018 available online</a>]</li>\n<li>Nelson, Lynn Hankinson, 1990, <em>Who Knows: From Quine to a\nFeminist Empiricism</em>, Philadelphia: Temple University Press.</li>\n<li>Oudshoorn, Nelly, 1994, <em>Beyond the Natural Body: An\nArchaeology of Sex Hormones</em>, London: Routledge.\ndoi:10.4324/9780203421529</li>\n<li>Paxton, Pamela, 2000, “Women’s Suffrage in the\nMeasurement of Democracy: Problems of Operationalization”,\n<em>Studies in Comparative International Development</em>, 35(3):\n92–111. doi:10.1007/BF02699767</li>\n<li>Pinnick, Cassandra L., 1994, “Feminist Epistemology:\nImplications for Philosophy of Science”, <em>Philosophy of\nScience</em>, 61(4): 646–657. doi:10.1086/289827</li>\n<li>–––, 2005, “The Failed Feminist Challenge\nto ‘Fundamental Epistemology’”, <em>Science &amp;\nEducation</em>, 14(2): 103–116.\ndoi:10.1007/s11191-004-9515-8</li>\n<li>Pitts-Taylor, Victoria, 2016a, <em>The Brain’s Body:\nNeuroscience and Corporeal Politics</em>, Durham, NC: Duke University\nPress.</li>\n<li>–––, 2016b, “Mattering: Feminism, Science,\nand Corporeal Politics”, in Pitts-Taylor 2016c: 1–20.</li>\n<li>––– (ed.), 2016c, <em>Mattering: Feminism,\nScience, and Materialism</em>, New York: New York University\nPress.</li>\n<li>Porter, Theodore M., 1995, <em>Trust in Numbers: The Pursuit of\nObjectivity in Science and Public Life</em>, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Richardson, Sarah S., 2012, “Sexing the X: How the X Became\nthe ‘Female Chromosome’”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 37(4): 909–933.\ndoi:10.1086/664477</li>\n<li>–––, 2013, <em>Sex Itself: The Search for Male\nand Female in the Human Genome</em>, Chicago, IL: University of\nChicago Press.</li>\n<li>Rolin, Kristina, 2006, “The Bias Paradox in Feminist\nStandpoint Epistemology”, <em>Episteme</em>, 3(1–2):\n125–136. doi:10.3366/epi.2006.3.1-2.125</li>\n<li>–––, 2009, “Standpoint Theory as a\nMethodology for the Study of Power Relations”, <em>Hypatia</em>,\n24(4): 218–226. doi:10.1111/j.1527-2001.2009.01070.x</li>\n<li>Roy, Deboleena and Banu Subramaniam, 2016, “Matter in the\nShadows: Feminist New Materialism and the Practices of\nColonialism”, in Pitts-Taylor 2016c: 23–42.</li>\n<li>Schiebinger, Londa, 1999, <em>Has Feminism Changed Science?</em>\nCambridge, MA: Harvard University Press.</li>\n<li>Sent, Esther-Mirjam and Irene van Staveren, 2019, “A\nFeminist Review of Behavioral Economic Research on Gender\nDifferences”, <em>Feminist Economics</em>, 25(2): 1–35.\ndoi:10.1080/13545701.2018.1532595</li>\n<li>Smith, Dorothy E., 1987, <em>The Everyday World as\nProblematic</em>, Boston, MA: Northeastern University Press.</li>\n<li>Solomon, Miriam, 2001, <em>Social Empiricism</em>, Cambridge, MA:\nMIT Press.</li>\n<li>–––, 2012, “The Web of Valief: An\nAssessment of Feminist Radical Empiricism”, in Crasnow and\nSuperson 2012: 435–450.</li>\n<li>Spanier, Bonnie B., 1995, <em>Im/Partial Science: Gender Ideology\nin Molecular Biology</em>, Bloomington, IN: Indiana University\nPress.</li>\n<li>Sprague, Joey, 2016, <em>Feminist Methodologies for Critical\nResearchers: Bridging Differences</em>, Lanham, MD: Rowman &amp;\nLittlefield Publishers.</li>\n<li>Stacey, Judith and Barrie Thorne, 1985, “The Missing\nFeminist Revolution in Sociology”, <em>Social Problems</em>,\n32(4): 301–316. doi:10.2307/800754</li>\n<li>Steele, Claude M., 1997, “A Threat in the Air: How\nStereotypes Shape Intellectual Identity and Performance.”,\n<em>American Psychologist</em>, 52(6): 613–629.\ndoi:10.1037/0003-066X.52.6.613</li>\n<li>Stewart, Abigail J., Anne P. Copeland, Nia Lane Chester, Janet E.\nMalley, and Nicole B. Barenbaum, 1997, <em>Separating Together: How\nDivorce Transforms Families</em>, New York: Guilford Press.</li>\n<li>Valian, Vivian, 1999, <em>Why So Slow? The Advancement of\nWomen</em>, Cambridge MA: MIT Press.</li>\n<li>van Anders, Sari M., Jeffrey Steiger, and Katherine L. Goldey,\n2015, “Effects of Gendered Behavior on Testosterone in Women and\nMen”, <em>Proceedings of the National Academy of Sciences</em>,\n112(45): 13805–13810. doi:10.1073/pnas.1509591112</li>\n<li>Wallerstein, Judith and Joan Kelly, 1980, <em>Surviving the\nBreakup</em>, New York: Basic Books.</li>\n<li>Wylie, Alison, 2003, “Why Standpoint Matters”, in\n<em>Science and Other Cultures: Issues in Philosophies of Science and\nTechnology</em>, Robert Figueroa and Sandra Harding (eds), New York:\nRoutledge, pp. 26–48.</li>\n<li>–––, 2011, “What Knowers Know Well: Women,\nWork and the Academy”, in Grasswick 2011: 157–179.\ndoi:10.1007/978-1-4020-6835-5_8</li>\n<li>Wylie, Alison, Elizabeth Potter, and Wenda K. Bauchspies, 2010,\n“Feminist Perspectives on Science”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2010 Edition), Edward N. Zalta\n(ed.), URL =\n <a href=\"https://plato.stanford.edu/archives/spr2010/entries/feminist-science/\" target=\"other\">https://plato.stanford.edu/archives/spr2010/entries/feminist-science/</a>.</li>\n<li>Yap, Audrey, 2016, “Feminist Radical Empiricism, Values, and\nEvidence”, <em>Hypatia</em>, 31(1): 58–73.\ndoi:10.1111/hypa.12221</li>\n</ul>\n<h3 id=\"AddiRead\">Additional Readings</h3>\n<ul class=\"hanging\">\n<li>Almassi, Ben, 2019, “Beyond Science Wars Redux: Feminist\nPhilosophy of Science as Trustworthy Science Criticism”,\n<em>Hypatia</em>, 34(4): 858–868. doi:10.1111/hypa.12500</li>\n<li>Amoretti, Maria Cristina and Nicla Vassallo (eds), 2016,\n<em>Meta-Philosophical Reflection on Feminist Philosophies of\nScience</em>, (Boston Studies in the Philosophy and History of Science\n317), Cham: Springer International Publishing.\ndoi:10.1007/978-3-319-26348-9</li>\n<li>Barad, Karen, 2003, “Posthumanist Performativity: Toward an\nUnderstanding of How Matter Comes to Matter”, <em>Signs: Journal\nof Women in Culture and Society</em>, 28(3): 801–831.\ndoi:10.1086/345321</li>\n<li>Bleier, Ruth (ed.), 1986, <em>Feminist Approaches to Science</em>,\nNew York: Routledge</li>\n<li>Blizzard, Deborah, 2007, <em>Looking Within: A Socio-cultural\nExamination of Fetoscopy</em>, Cambridge, MA: MIT Press.</li>\n<li>Bug, Amy, 2003, “Has Feminism Changed Physics?”,\n<em>Signs: Journal of Women in Culture and Society</em>, 28(3):\n881–899. doi:10.1086/345323</li>\n<li>Campion, Patricia and Wesley Shrum, 2004, “Gender and\nScience in Development: Women Scientists in Ghana, Kenya, and\nIndia”, <em>Science, Technology, &amp; Human Values</em>, 29(4):\n459–485. doi:10.1177/0162243904265895</li>\n<li>Chilly Collective, 1995, <em>Breaking Anonymity: The Chilly\nClimate for Women Faculty</em>, Waterloo ON: Wilfrid Laurier\nUniversity Press.</li>\n<li>Code, Lorraine, 1993, “Taking Subjectivity into\nAccount”, in Alcoff and Potter 1993: 15–48.</li>\n<li>–––, 1991, <em>What Can She Know?</em> Ithaca,\nNY: Cornell University Press.</li>\n<li>Cole, Jonathan R., 1979, <em>Fair Science: Women in the Scientific\nCommunity</em>, New York: The Free Press.</li>\n<li>Crasnow, Sharon, 2018, “Contemporary Standpoint Theory:\nTensions, Integrations, and Extensions”, in Garavaso 2018:\n188–211.</li>\n<li>Crasnow, Sharon and Kristen Intemann (eds), forthcoming, <em>The\nRoutledge Handbook of the Philosophy of Science</em>, New York:\nRoutledge.</li>\n<li>Dahlberg, Frances (ed.), 1981, <em>Woman the Gatherer</em>, New\nHaven, CT: Yale University Press.</li>\n<li>Douglas, Heather, 2009, <em>Science, Policy, and the Value Free\nIdeal</em>, Pittsburgh, PA: Pittsburgh University Press.</li>\n<li>Ebbersmeyer, Sabrina and Gianni Paganini (eds.), 2020, <em>Women,\nPhilosophy and Science: Italy and Early Modern Europe</em>, (Women in\nthe History of Philosophy and Sciences 4), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-030-44548-5</li>\n<li>Elliott, Kevin C. and Daniel Steel (eds.), 2017, <em>Current\nControversies in Values and Science</em>, New York: Routledge.\ndoi:10.4324/9781315639420</li>\n<li>Fausto-Sterling, Anne, 1985, <em>Myths of Gender: Biological\nTheories About Women and Men</em>, New York: Basic Books.</li>\n<li>Fedigan, Linda Marie, 1986, “The Changing Role of Women in\nModels of Human Evolution”, <em>Annual Review of\nAnthropology</em>, 15(1): 25–66.\ndoi:10.1146/annurev.an.15.100186.000325</li>\n<li>Fedigan, Linda Marie and Laurence Fedigan, 1989, “Gender and\nthe Study of Primates”, in <em>Gender and Anthropology: Critical\nReviews for Research and Teaching</em>, Sandra Morgen (ed.),\nWashington, DC: American Anthropological Association, pp.\n41–64.</li>\n<li>Fonow, Mary Margaret and Judith A. Cook, 2005, “Feminist\nMethodology: New Applications in the Academy and Public Policy”,\n<em>Signs: Journal of Women in Culture and Society</em>, 30(4):\n2211–2236. doi:10.1086/428417</li>\n<li>Fonow, Mary Margaret and Judith A. Cook (eds), 1991, <em>Beyond\nMethodology: Feminist Scholarship as Lived Research</em>, Bloomington,\nIN: Indiana University Press.</li>\n<li>Fortmann, Louise (ed.), 2008, <em>Participatory Research in\nConservation and Rural Livelihoods: Doing Science Together</em>,\nLondon: Wiley-Blackwell.</li>\n<li>Fujimura, Joan H., 2006, “Sex Genes: A Critical\nSociomaterial Approach to the Politics and Molecular Genetics of Sex\nDetermination”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 32(1): 49–82. doi:10.1086/505612</li>\n<li>Garry, Ann, Serene J. Khader, and Alison Stone (eds.), 2017,\n<em>The Routledge Companion to Feminist Philosophy</em>, New York:\nRoutledge. doi:10.4324/9781315758152</li>\n<li>Ginther, Donna K., 2004, “Why Women Earn Less: Economic\nExplanations for the Gender Salary Gap in Science”, <em>AWIS\nMagazine</em>, 33: 6–10.</li>\n<li>Goodman, Alan H., Deborah Heath, and M. Susan Lindee (eds.), 2003,\n<em>Genetic Nature/Culture: Anthropology and Science beyond the\nTwo-Culture Divide</em>, Berkeley, CA: University of California\nPress.</li>\n<li>Greaves, Lorraine, Alison Wylie, Cheryl Champagne, Louise Karch,\nRuth Lapp, Julie Lee and Bina Osthoff, 1995, “Women and\nViolence: Feminist Practice and Quantitative Method”, in\n<em>Changing Methods: Feminist Transforming Practice</em>, Sandra Burt\nand Lorraine Code (eds.), Peterborough ON: Broadview Press, pp.\n301–326.</li>\n<li>Greenwood, Mary Rita Cooke, 2000, “Plenary IV: Advancing\nWomen into Science Leadership”, <em>Who Will Do the Science of\nthe Future? A Symposium on Careers of Women in Science</em> Washington\nDC: National Academy Press, pp. 57–74.</li>\n<li>Hall, Kim Q., 2017, “Feminist and Queer Intersections with\nDisability Studies”, in Garry, Khader, and Stone 2017: 405–418.</li>\n<li>–––, 2002, “Feminism, Disability, and\nEmbodiment”, <em>NWSA Journal</em>, Special Issue: Feminist\nDisability Studies, 14(3): vii–xii.\ndoi:10.1353/nwsa.2003.0006</li>\n<li>Hammonds, Evelynn and Banu Subramaniam, 2003, “A\nConversation on Feminist Science Studies”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 28(3): 923–944.\ndoi:10.1086/345455</li>\n<li>Haraway, Donna, 1989, <em>Primate Visions: Gender, Race, and\nNature in the World of Modern Science</em>, New York: Routledge.</li>\n<li>–––, 1991, <em>Simians, Cyborgs, and Women: The\nReinvention of Nature</em>, New York, Routledge.</li>\n<li>Harding, Sandra, 1991, <em>Whose Science? Whose Knowledge?\nThinking from Women’s Lives</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>–––, 1993, <em>The “Racial” Economy\nof Science: Toward a Democratic Future</em>, Bloomington, IN: Indiana\nUniversity Press.</li>\n<li>––– (ed.), 2006, <em>Science and Social\nInequality: Feminist and Postcolonial Issues</em>, Urbana and Chicago:\nUniversity of Illinois Press. </li>\n<li>Harding, Sandra and Kathryn Norberg, 2005, “New Feminist\nApproaches to Social Science Methodologies: An Introduction”,\n<em>Signs: Journal of Women in Culture and Society</em>, 30(4):\n2009–2015. doi:10.1086/428420</li>\n<li>Hastorf, Christine A., 1991, “Gender, Space, and Food in\nPrehistory”, in <em>Engendering Archaeology: Women and\nPrehistory</em>, Joan M. Gero and Margaret W. Conkey (eds.), Oxford:\nBlackwell, 132–159.</li>\n<li>Hesse-Biber, Sharlene (ed.), 2011, <em>Handbook of Feminist\nResearch</em>, second edition, New York: Sage.</li>\n<li>Hesse-Biber, Sharlene and Michelle L. Yaiser, 2004, <em>Feminist\nPerspectives on Social Research</em>, New York: Oxford University\nPress.</li>\n<li>Hubbard, Ruth, 2003, “Science, Power, Gender: How DNA Became\nthe Book of Life”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 28(3): 791–799. doi:10.1086/345334</li>\n<li>–––, 1990, <em>The Politics of Women’s\nBiology</em>, New Brunswick, NJ: Rutgers University Press.</li>\n<li>Kafer, Alison, 2003, “Compulsory Bodies: Reflections on\nHeterosexuality and Able- bodiedness”, <em>Journal of\nWomen’s History</em>, 15(3): 77–89</li>\n<li>Keller, Evelyn Fox, 1983, <em>A Feeling for the Organism: The Life\nand Work of Barbara McClintock</em>, New York: W. H. Freeman and\nCompany.</li>\n<li>–––, 1992, <em>Secrets of Life, Secrets of\nDeath: Essays on Language, Gender and Science</em>, New York:\nRoutledge.</li>\n<li>–––, 1995, “The Origin, History, and\nPolitics of the Subject Called ‘Gender and Science’: A\nFirst Person Account”, in <em>Handbook of Science and Technology\nStudies</em>, Sheila Jasanoff, Gerald E. Markle, James C. Petersen,\nand Trevor Pinch (eds.), Thousand Oaks, CA: Sage Publications,\n80–94.</li>\n<li>–––, 2011, <em>The Mirage of a Space Between\nNature and Nurture</em>, Durham, NC: Duke University Press.</li>\n<li>Kitcher, Philip, 2011, <em>Science in a Democratic Society</em>,\nAmherst, NY: Prometheus Books.</li>\n<li>Kittay, Eva, Anita Silvers, and Susan Wendell (eds.), 2001,\n<em>Feminism and Disability</em>, Special Issue of <em>Hypatia</em>,\n16(4).</li>\n<li>Kourany, Janet, 2017, “Philosophy of Science and the\nFeminist Legacy”, in Garry, Khader, and Stone 2017:\n303–313.</li>\n<li>Lloyd, Elisabeth A., 1993, “Pre-Theoretical Assumptions in\nEvolutionary Explanations of Female Sexuality”,\n<em>Philosophical Studies</em>, 69(2–3): 139–153.\ndoi:10.1007/BF00990080</li>\n<li>Longino, Helen E., 1995, “Gender, Politics, and the\nTheoretical Virtues”, <em>Synthese</em>, 104(3): 383–397.\ndoi:10.1007/BF01064506</li>\n<li>Longino, Helen and Ruth Doell, 1983, “Body, Bias, and\nBehavior: A Comparative Analysis of Reasoning in Two Areas of\nBiological Science”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 9(2): 206–227. doi:10.1086/494044</li>\n<li>Nelson, Lynn Hankinson, 1993, “Epistemological\nCommunities”, in Alcoff and Potter 1993: 121–159.</li>\n<li>–––, 1995, “A Feminist Naturalized\nPhilosophy of Science”, <em>Synthese</em>, 104(3):\n399–421. doi:10.1007/BF01064507</li>\n<li>–––, 1996, “Empiricism Without\nDogmas”, in <em>Feminism, Science, and the Philosophy of\nScience</em>, Lynn H. Nelson and Jack Nelson (eds.), Dordrecht, Boston\nand London: Kluwer Academic Publishers, pp. 95–119.</li>\n<li>–––, 2018, “Feminist Philosophies of\nScience: The Social and Contextual Nature of Science”, in\nGaravaso 2018: 236–259.</li>\n<li>Newcombe, Nora S., 2010, “On Tending to Our Scientific\nKnitting: Thinking About Gender in the Context of Evolution”, in\n<em>Handbook of Gender Research in Psychology, Volume 1: Gender\nResearch in General and Experimental Psychology</em>, Joan C. Chrisler\nand Donald R. McCreary (eds.), New York, NY: Springer New York,\n259–274. doi:10.1007/978-1-4419-1465-1_13</li>\n<li>Meynell, Letitia, 2012, “Evolutionary Psychology, Ethology,\nand Essentialism (Because What They Don’t Know Can Hurt\nUs)”, <em>Hypatia</em>, 27(1): 3–27.\ndoi:10.1111/j.1527-2001.2011.01240.x</li>\n<li>Pohlhaus, Gaile, 2002, “Knowing Communities: An\nInvestigation of Harding’s Standpoint Epistemology”,\n<em>Social Epistemology</em>, 16(3): 283–293.\ndoi:10.1080/0269172022000025633</li>\n<li>Pérez Sedeño, E., 2001, “Gender: The Missing\nFactor in STS”, in <em>Visions of STS: Counterpoints in Science,\nTechnology and Society Studies</em>, Stephen H. Cutcliffe and Carl\nMitcham (eds.), Albany, NY: SUNY Press, pp. 123–138.</li>\n<li>Potter, Elizabeth, 1995, “Good Science and Good Philosophy\nof Science”, <em>Synthese</em>, 104(3): 423–439.\ndoi:10.1007/BF01064508</li>\n<li>–––, 2001, <em>Gender and Boyle’s Law of\nGases</em>, Bloomington, IN: Indiana University Press.</li>\n<li>Ramazanoglu, Caroline with Janet Holland, 2002, <em>Feminist\nMethodology: Challenges and Choices</em>, Thousand Oaks, CA: Sage\nPublications.</li>\n<li>Reardon, Jenny, 2005, <em>Race to the Finish: Identity and\nGovernance in an Age of Genomics</em>, Princeton, NJ: Princeton\nUniversity Press.</li>\n<li>Reinharz, Shulamit, 1992, <em>Feminist Methods in Social\nResearch</em>, New York: Oxford University Press.</li>\n<li>Richardson, Sarah S., 2010, “Feminist Philosophy of Science:\nHistory, Contributions, and Challenges”, <em>Synthese</em>,\n177(3): 337–362. doi:10.1007/s11229-010-9791-6</li>\n<li>Rose, Hilary, 1983, “Hand, Brain, and Heart: A Feminist\nEpistemology for the Natural Sciences”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 9(1): 73–90.\ndoi:10.1086/494025</li>\n<li>–––, 1994, <em>Love, Power and Knowledge:\nTowards a Feminist Transformation of the Sciences</em>, Cambridge, MA:\nPolity Press.</li>\n<li>Rosser, Sue V., 2002, “Twenty-five Years of NWSA: Have We\nBuilt the Two-Way Streets Between Women’s Studies and Women in\nScience and Technology?” <em>NWSA Journal</em>, 14(1):\n103–128. doi: 10.1353/nwsa.2002.0017</li>\n<li>Rossiter, Margaret, 1982, <em>Women Scientists in America:\nStruggles and Strategies to 1940</em>, Baltimore, MD: Johns\nHopkins.</li>\n<li>–––1995, <em>Women Scientists in America: Before\nAffirmative Action, 1940–1972</em>, Baltimore, MD: Johns Hopkins\nUniversity Press.</li>\n<li>Roughgarden, Joan, 2013, <em>Evolution’s Rainbow: Diversity,\nGender, and Sexuality in Nature and People</em>, Berkeley, CA:\nUniversity of California Press.</li>\n<li>Schiebinger, Londa 1989, <em>The Mind Has No Sex? Women in the\nOrigins of Modern Science</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1999, “How Women Contribute”,\n<em>Science</em>, 285(5429): 835b–8835.\ndoi:10.1126/science.285.5429.835b</li>\n<li>––– (ed.), 2003, <em>Gender and Science: New\nIssues</em>, special issue of <em>Signs: Journal of Women in Culture\nand Society</em>, 28(3).</li>\n<li>Smith, Dorothy E., 1974, “Women’s Perspective as a\nRadical Critique of Sociology”, <em>Sociological Inquiry</em>,\n44(1): 7–13. doi:10.1111/j.1475-682X.1974.tb00718.x</li>\n<li>Smith, Dorothy E., 1978, “A Peculiar Eclipsing:\nWomen’s Exclusion from Man’s Culture”,\n<em>Women’s Studies International Quarterly</em>, 1(4):\n281–295. doi:10.1016/S0148-0685(78)91175-2</li>\n<li>Sonnert, Gerhard and Gerald Holton, 1995, <em>Who Succeeds in\nScience? The Gender Dimension</em>, New Brunswick, NJ: Rutgers\nUniversity Press.</li>\n<li>Sperling, Susan, 1991, “Baboons with Briefcases: Feminism,\nFunctionalism, and Sociobiology in the Evolution of Primate\nGender”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 17(1): 1–27. doi:10.1086/494711</li>\n<li>Squier, Susan and Melissa M. Littlefield, 2004, “Feminist\nTheory and/of Science: Feminist Theory Special Issue”,\n<em>Feminist Theory</em>, 5(2): 123–126.\ndoi:10.1177/1464700104045403</li>\n<li>Star, Susan Leigh (ed.), 1995, <em>Ecologies of Knowledge: Work\nand Politics in Science and Technology</em>, Albany, NY: SUNY\nPress.</li>\n<li>Strum, Shirley C. and Linda Marie Fedigan (eds.), 2000,\n<em>Primate Encounters: Models of Science, Gender, and Society</em>,\nChicago: University of Chicago Press.</li>\n<li>Suchman, Lucy, 2008, “Feminist STS and the Sciences of the\nArtificial”, in <em>The Handbook of Science and Technology\nStudies</em>, third edition, Edward J. Hackett, Olga Amsterdamska,\nMichael E. Lynch, and Judy Wajcman (eds.), Cambridge, Massachusetts\nand London: The MIT Press, pp. 139–164.</li>\n<li>Symons, Donald, 1979, <em>The Evolution of Human Sexuality</em>\nNew York: Oxford University Press.</li>\n<li>Tejani, Sheba, 2019, “What’s Feminist about Feminist\nEconomics?”, <em>Journal of Economic Methodology</em>, 26(2):\n99–117. doi:10.1080/1350178X.2018.1556799</li>\n<li>Watson, Patty Jo and Mary C. Kennedy, 1991, “The Development\nof Horticulture in the Eastern Woodlands of North America:\nWomen’s Role”, in <em>Engendering Archaeology: Women and\nPrehistory</em>, Joan M. Gero and Margaret W. Conkey (eds.), Oxford:\nBlackwell, 276–300.</li>\n<li>Wertheim, Margaret, 1995, <em>Pythagoras’ Trousers: God,\nPhysics and the Gender Wars</em>, New York: Random House.</li>\n<li>Whelan, Emma, 2001, “Politics by Other Means: Feminism and\nMainstream Science Studies”, <em>Canadian Journal of Sociology /\nCahiers Canadiens de Sociologie</em>, 26(4): 535–581.\ndoi:10.2307/3341492</li>\n<li>Wyer, Mary, Mary Barbercheck, Donna Cookmeyer, Hatice\nÖztürk, and Marta Wayne (eds), 2014, <em>Women, Science and\nTechnology: A Reader in Feminist Science Studies</em>, third edition,\nNew York: Routledge. doi:10.4324/9780203427415</li>\n<li>Wylie, Alison, 1992, “Reasoning About Ourselves: Feminist\nMethodology in the Social Sciences”, in <em>Women and\nReason</em>, Elizabeth Harvey and Kathleen Okruhlik (eds.), Ann Arbor,\nMI: University of Michigan Press, pp. 611–624.</li>\n<li>–––, 1995, “The Contexts of Activism on\n‘Climate’ Issues”, in <em>Breaking Anonymity: The\nChilly Climate for Women Faculty</em>, The Chilly Collective (eds.),\nWaterloo, Ontario: Wilfrid Laurier University Press, pp.\n26–60.</li>\n<li>–––, 2007, “The Feminism Question in\nScience: What Does It Mean to ‘Do Social Science as a\nFeminist’?”, in <em>Handbook of Feminist Research: Theory\nand Praxis</em>, Sharlene Hesse-Biber (ed.), New York: Sage, pp.\n567–577. doi:10.4135/9781483384740.n26</li>\n<li>–––, 2017, “What Knowers Know Well:\nStandpoint Theory and the Formation of Gender Archaeology”,\n<em>Scientiae Studia</em> 15(1): 13–38.</li>\n<li>Wylie, Alison, Janet R. Jakobsen, and Gisela Fosado, 2008,\n<em>Women, Work, and the Academy: Strategies for Responding to\n‘Post-civil Rights Era’ Gender Discrimination</em>, (New\nFeminist Solutions, 2), New York: Barnard Center for Research on Women\n [<a href=\"https://bcrw.barnard.edu/publications/women-work-academy/\" target=\"other\">Wylie, Jakobsen, and Fosado 2008 available online</a>].</li>\n<li>Xie, Yu and Kimberlee A. Shauman, 2003, <em>Women in Science:\nCareer Processes and Outcomes</em>, Cambridge MA: Harvard University\nPress.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "cognitivism vs. non-cognitivism, moral",
            "discrimination",
            "epistemology",
            "epistemology: naturalism in",
            "epistemology: social",
            "feminist philosophy, approaches: Latin American feminism",
            "feminist philosophy, approaches: psychoanalytic philosophy",
            "feminist philosophy, interventions: epistemology and philosophy of science",
            "feminist philosophy, interventions: philosophy of biology",
            "feminist philosophy, interventions: social epistemology",
            "feminist philosophy, topics: perspectives on power",
            "feminist philosophy, topics: perspectives on reproduction and the family",
            "feminist philosophy, topics: perspectives on sex and gender",
            "feminist philosophy, topics: perspectives on the body",
            "justice",
            "justification, epistemic: foundationalist theories of",
            "rationalism vs. empiricism",
            "relativism",
            "science: theory and observation in",
            "scientific knowledge: social dimensions of",
            "social norms"
        ],
        "entry_link": [
            {
                "../moral-cognitivism/": "cognitivism vs. non-cognitivism, moral"
            },
            {
                "../discrimination/": "discrimination"
            },
            {
                "../epistemology/": "epistemology"
            },
            {
                "../epistemology-naturalized/": "epistemology: naturalism in"
            },
            {
                "../epistemology-social/": "epistemology: social"
            },
            {
                "../feminism-latin-america/": "feminist philosophy, approaches: Latin American feminism"
            },
            {
                "../feminism-psychoanalysis/": "feminist philosophy, approaches: psychoanalytic philosophy"
            },
            {
                "../feminism-epistemology/": "feminist philosophy, interventions: epistemology and philosophy of science"
            },
            {
                "../feminist-philosophy-biology/": "feminist philosophy, interventions: philosophy of biology"
            },
            {
                "../feminist-social-epistemology/": "feminist philosophy, interventions: social epistemology"
            },
            {
                "../feminist-power/": "feminist philosophy, topics: perspectives on power"
            },
            {
                "../feminism-family/": "feminist philosophy, topics: perspectives on reproduction and the family"
            },
            {
                "../feminism-gender/": "feminist philosophy, topics: perspectives on sex and gender"
            },
            {
                "../feminist-body/": "feminist philosophy, topics: perspectives on the body"
            },
            {
                "../justice/": "justice"
            },
            {
                "../justep-foundational/": "justification, epistemic: foundationalist theories of"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            },
            {
                "../relativism/": "relativism"
            },
            {
                "../science-theory-observation/": "science: theory and observation in"
            },
            {
                "../scientific-knowledge-social/": "scientific knowledge: social dimensions of"
            },
            {
                "../social-norms/": "social norms"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminist-science\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminist-science/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminist-science&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feminist-science/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminist-science": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminist-science/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminist-science&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feminist-science/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "National Institutes of Health [NIH]: Office of Research on\nWomen’s Health, 2018,\n “<a href=\"https://orwh.od.nih.gov/womens-health/clinical-research-trials/nih-inclusion-policies/including-women-and-minorities\" target=\"other\">Including Women and Minorities in Clinical Research Background</a>”.",
            "<a href=\"https://www.nsf.gov/crssprgm/advance/\" target=\"other\">ADVANCE (NSF-funded Program for the Advancement of Women in Academic Science and engineering Careers)</a>",
            "<a href=\"https://www.facebook.com/Feministemmss/\" target=\"other\">FEMMSS</a>:\n Association for Feminist Epistemologies, Methodologies, Metaphysics\nand Science Studies",
            "<a href=\"https://sites.google.com/site/analyticalfeminism/\" target=\"other\">Society for Analytic Feminism</a>:\n a forum for feminist philosophy in the analytic tradition which\nincludes feminist philosophy of science",
            "<a href=\"https://sgrponline.com/\" target=\"other\">Gender, Race and Philosophy</a>,\n Editorial team: Amy Allen, Alia Al-Saji, Kathryn Sophia Belle,\nJosé Medina; Advisory Board: Sally Haslanger, Ronald Sundstorm,\nRobert Gooding-Williams, and Cynthia Willett (archives, book reviews,\nbibliography and links to related websites).",
            "<a href=\"https://www.queensu.ca/psychology/van-anders-lab/\" target=\"other\">van Anders lab: social neuroendocrinology | feminist science | sexuality | gender/sex | sexual diversity</a>\n (current research in feminist science)",
            "<a href=\"https://historyofwomenphilosophers.org/about/\" target=\"other\">History of Women in Philosophy and Science, University of Paderborn</a>"
        ],
        "listed_links": [
            {
                "https://orwh.od.nih.gov/womens-health/clinical-research-trials/nih-inclusion-policies/including-women-and-minorities": "Including Women and Minorities in Clinical Research Background"
            },
            {
                "https://www.nsf.gov/crssprgm/advance/": "ADVANCE (NSF-funded Program for the Advancement of Women in Academic Science and engineering Careers)"
            },
            {
                "https://www.facebook.com/Feministemmss/": "FEMMSS"
            },
            {
                "https://sites.google.com/site/analyticalfeminism/": "Society for Analytic Feminism"
            },
            {
                "https://sgrponline.com/": "Gender, Race and Philosophy"
            },
            {
                "https://www.queensu.ca/psychology/van-anders-lab/": "van Anders lab: social neuroendocrinology | feminist science | sexuality | gender/sex | sexual diversity"
            },
            {
                "https://historyofwomenphilosophers.org/about/": "History of Women in Philosophy and Science, University of Paderborn"
            }
        ]
    }
}