{
    "url": "feminism-self",
    "title": "Feminist Perspectives on the Self",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Ellie Anderson\n<ellie_anderson@pitzer.edu>\nCynthia Willett\n<cwillet@emory.edu>\nDiana Meyers",
        "author_links": [
            {
                "mailto:ellie_anderson%40pitzer%2eedu": "ellie_anderson@pitzer.edu"
            },
            {
                "mailto:cwillet%40emory%2eedu": "cwillet@emory.edu"
            },
            {
                "https://dianatietjensmeyers.wordpress.com/": "Diana Meyers"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nEllie Anderson\n&lt;<a href=\"mailto:ellie_anderson%40pitzer%2eedu\"><em>ellie_anderson<abbr title=\" at \">@</abbr>pitzer<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nCynthia Willett\n&lt;<a href=\"mailto:cwillet%40emory%2eedu\"><em>cwillet<abbr title=\" at \">@</abbr>emory<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://dianatietjensmeyers.wordpress.com/\" target=\"other\">Diana Meyers</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jun 28, 1999",
        "substantive revision Wed Feb 19, 2020"
    ],
    "preamble": "\n\nThe topic of the self has long been salient in feminist philosophy,\nfor it is pivotal to questions about personal identity, the body,\nsociality, and agency that feminism must address. Simone de\nBeauvoir’s provocative declaration, “He is the Subject, he\nis the Absolute—she is the Other”, signals the central\nimportance of the self for feminism. To be the Other is to be a\nnon-subject, a non-agent—in short, a mere thing. Women’s\nselfhood has been systematically subordinated or even outright denied\nby law, customary practice, and cultural stereotypes. Throughout\nhistory, women have been identified either as inferior versions of men\nor as their direct opposite, characterized through their perceived\ndifferences from men; in both cases, women have been denigrated on the\nbasis of these views. Since women have been cast as lesser forms of\nthe masculine individual, the paradigm of the self that has gained\nascendancy in Western philosophy and U.S. popular culture is derived\nfrom a masculine prototype. Feminists contend that the experiences of\npredominantly white and heterosexual, mostly economically advantaged\nmen who have wielded social, economic, and political power and who\nhave dominated the arts, literature, the media, and scholarship have\nbeen taken as universal and ideal. As a result, feminists have argued\nthat the self is not only a metaphysical issue for philosophy, but one\nthat is also ethical, epistemological, social, and political.\n\nResponding to this state of affairs, feminist philosophical work on\nthe self has taken three main tacks: (1) critiques of dominant modern,\nWestern views of the self, (2) reclamations of feminine identities,\nand (3) reconceptualizations of the self as (a) a dynamic, relational\nindividual beholden to unconscious desires and social bonds and (b)\nintersectional and even heterogeneous. The feminist\nreconceptualizations of the self have challenged standard\nphilosophical models for their biases and shifted the discipline\ntoward recognizing selfhood as a relational, multilayered phenomenon.\nThis entry will survey both critical and constructive feminist\napproaches to the self.\n",
    "toc": [
        {
            "#CritClasApprSelf": "1. Critique of Classical Approaches to Selfhood"
        },
        {
            "#ReclFemiIdenWomeStat": "2. Reclamation of Feminine Identities and Women’s Status"
        },
        {
            "#RecoSelf": "3. Reconceptualizations of the Self"
        },
        {
            "#DynaRelaSelf": "3.1 The Dynamic and Relational Self"
        },
        {
            "#InteMultSelf": "3.2 The Intersectional and Multiplicitous Self"
        },
        {
            "#Conc": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#CompBibl": "Comprehensive Bibliography"
        },
        {
            "#Refe": "References"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Critique of Classical Approaches to Selfhood\n\nModern philosophy in the West championed the individual. Extending\ninto contemporary moral and political thought is the idea that the\nself is a free, rational chooser and actor—an autonomous agent.\nTwo views of the self dominate this milieu: a Kantian ethical subject\nand a utilitarian “homo economicus”. Nevertheless, these\ntwo views differ in their emphasis. The Kantian ethical subject uses\nreason to transcend cultural norms and personal preferences in order\nto discover absolute truth, whereas homo economicus uses reason to\nrank desires in a coherent order and to figure out how to maximize\ndesire satisfaction with the instrumental rationality of the\nmarketplace. Both of these conceptions of the self minimize the\npersonal and ethical import of unchosen circumstances, interpersonal\nrelationships, and biosocial forces. They isolate the individual from\nits relationships and environment, as well as reinforcing a modern\nbinary that divides the social sphere into autonomous agents and\ndependents. For the Kantian ethical subject, emotional and social\nbonds imperil objectivity and undermine rational commitment to duty.\nFor homo economicus, it makes no difference which forces shape\none’s desires, provided they do not result from coercion or\nfraud, and one’s ties to other people are to be factored into\none’s calculations along with the rest of one’s desires.\nFor these prevailing conceptions of the self, structural domination\nand subordination are thought not to penetrate the “inner\ncitadel” of selfhood. The multiple, sometimes fractious sources\nof social identity constituted at the intersections of one’s\ngender, sexual orientation, race, class, age, ethnicity, ability, and\nso forth, are ignored. Likewise, these conceptions deny the complexity\nof the intrapsychic world of unconscious fantasies, fears, and\ndesires, and they overlook the ways in which such dynamics intrude\nupon conscious life. The modern philosophical construct of the\nrational subject projects a self that is not prey to ambivalence,\nanxiety and depression, obsession, prejudice, hatred, or violence. A\ndisembodied mind, the body is peripheral—a source of desires for\nhomo economicus to weigh and a distracting temptation to the Kantian\nethical subject. Age, looks, sexuality, biological composition, and\nphysical competencies are considered extraneous to the self.\n\nYet, as valuable as rational analysis and free choice undoubtedly are,\nsome feminists argue that these capacities do not operate apart from\nthe phenomenon we call the self. As such, feminist philosophers have\ncharged that dominant views of the self as rational and independent\nare fundamentally misleading. Although represented as genderless,\nraceless, ageless, and classless, feminists argue that the Kantian\nsubject and homo economicus mask a white, healthy, youthfully\nmiddle-aged, middle- or upper-class, heterosexual, cisgender male\ncitizen. On the Kantian view, he is an impartial judge deliberating\nabout applying universal principles, while on the utilitarian view, he\nis a self-interested bargainer wheeling and dealing in the\nmarketplace.\n\nIt is no accident that law and commerce are both public domains from\nwhich women have historically been excluded. It is no accident,\neither, that the philosophers who originated these views of the self\ntypically endorsed this exclusion. Deeming women emotional and\nunprincipled, these thinkers advocated confining women to the private\ndomestic sphere where their voices could be neutralized and even\ntransformed into virtues, in the role of empathetic, supportive wife,\nvulnerable sexual partner, and nurturing mother. Associated with\nbodies rather than minds, women were tasked with the maintenance of\ntheir own bodies and those of others in a gendered division of labor\n(Rawlinson 2016). The division of values along binary gendered lines\nhas historically been associated with the valorization of the\nmasculine and the stigmatization of the feminine. The masculine realm\nof rational selfhood is a realm of moral decency, principled respect\nfor duties, and prudent good sense. However, femininity has been\nassociated with a sentimental attachment to loved ones that spawns\nfavoritism and compromises principles. Likewise, femininity is\nassociated with immersion in the unpredictable domestic exigencies of\nthe private sphere, while the masculinized self appears as a sturdy\nfortress of integrity in the public domain of dutiful citizenship. The\nself is essentially masculine, and the masculine self is essentially\ngood and wise.\n\nSome feminist philosophers modify and defend these conceptions of the\nself, taking issue only with women’s historical exclusion from\nthem and claiming they should be extended to include women. However,\nthe decontextualized individualism and abstraction of reason from\nother capacities inherent in these two dominant views trouble many\nfeminist philosophers and have led them to seek alternative\nperspectives on the self. Many claim that the misogynist heritage of\nthe Kantian subject and homo economicus cannot be remedied simply by\nadvocating equal selves for women. Rather, these very conceptions of\nthe self are gendered. In Western culture, the mind and reason are\ncoded masculine, whereas the body and emotion are coded feminine\n(Irigaray 1985b; Lloyd 1984). To identify the self with the rational\nmind is, then, to masculinize the self according to entrenched\nstereotypes. Far from being apolitical, this conception of the self\nperpetuates neoliberal inequalities by teaching women to value\neconomic success and social independence in a way that requires the\ncontinual exploitation of other, less privileged, women (Oksala 2016;\nArruzza, Bhattacharya, and Fraser 2019).\n\nThe philosophical preeminence of the masculine over the feminine rests\non untenable assumptions about the transparency of the self, the\nimmunity of the self to social influences, and the reliability of\nreason to correct distorted moral judgment. People grow up in social\nenvironments saturated with culturally normative prejudice and\nimplicit bias, even in communities where overt forms of bigotry are\nstrictly proscribed (Meyers 1994). Although official norms uphold the\nvalues of equality and tolerance, cultures continue to transmit\ncamouflaged messages of the inferiority of historically subordinated\nsocial groups through stereotypes and other imagery. These deeply\ningrained schemas commonly structure attitudes, perceptions,\nbehavioral habits, judgment, and compassion or empathy despite the\nindividual’s conscious good will (Fischer 2014; Sullivan 2001\nand 2015; Valian 1998; Collins 1990). As Kate Manne elaborates,\nmisogynist norms skew empathy in favor of men in what she calls\n“himpathy” (Manne 2019). These norms also render societies more likely to believe\nthe testimony of those who are privileged and to diminish the\nperspectives of those not considered objective, rational knowers\n(Fricker 2007). As a\nresult, people often consider themselves objective and fair while\nsystematically discriminating against “different” others\n(Piper 1990; Young 1990). Such prejudice cannot be dispelled through\nrational reflection alone (Meyers 1994; Al-Saji 2014). In effect,\nthen, the conception of the unbiased rational self countenances\n“innocent” wrongdoing and reinforcement of the social\nstratification that privileges an elite whom this conception takes as\nparadigmatic.\n\nThe nullification of women’s selfhood was once explicitly\ncodified in Anglo-European and American law. The legal doctrine of\ncoverture held that a woman’s personhood was absorbed into that\nof her husband when she married (McDonagh 1996). Assuming her\nhusband’s surname symbolized the denial of the wife’s\nseparate identity. In addition, coverture deprived the wife of her\nright to bodily integrity, since rape and other forms of physical\nabuse within marriage were not recognized as crimes. She lost her\nright to owning property, controlling her own earnings, and making\ncontracts in her own name. Lacking the right to vote or serve on\njuries, she was a second-class citizen whose enfranchised husband\npurportedly represented her politically. Although coverture has been\nrescinded, vestiges of this denial of women’s selfhood can be\ndiscerned in recent legal rulings and in contemporary culture. For\nexample, pregnant women remain vulnerable to legally sanctioned\nviolations of their bodily integrity and legal autonomy, especially if\nthey lack race and class privilege (Bordo 1993; Brown 1998).\nSelflessness remains the pregnant woman’s legal status.\nMoreover, the stereotype of feminine selflessness still thrives in the\npopular imagination. Any self-confident, self-assertive woman is out\nof step with prevalent gender norms, and a mother who is not\nunstintingly devoted to her children is likely to be perceived as\nselfish or even a welfare “fraud” and to face severe\nsocial censure and deprivation of social services (Sparks, 2015).\n\nComplementing this line of argument, a number of feminists argue that\nthe very ideal of an independent, rational self has invidious social\nconsequences. To realize this ideal, it is necessary to repress inner\nconflict and to police the rigid boundaries of a purified self. Alien\ndesires and impulses are consigned to the unconscious, but this\nunconscious material inevitably intrudes upon conscious life and\ninfluences people’s attitudes and desires. In particular, the\nfeared and despised Other within is projected onto “other”\nsocial groups, and hatred and contempt are redirected at these\nimagined enemies (Kristeva 1988 [1991]; McAfee 2019; Scheman 1993).\nMisogyny and other forms of bigotry are thus borne of the demand that\nthe self be decisive, invulnerable, and unitary together with the\nimpossibility of meeting this demand. Worse still, these irrational\nhatreds cannot be cured unless this demand for self-mastery is\nrepudiated, but to repudiate it is to be resigned to a degraded,\nfeminized self whose concerns are not taken seriously. Indeed,\nall-too-often women’s protests are dismissed as those of a\nhysteric or killjoy (Ahmed 2017). Far from functioning as the\nguarantor of moral probity, the fictive Kantian self is the condition\nfor the possibility of intractable animosity and injustice.\n\nA further problem with the traditional modern views from a feminist\nstandpoint is that they fail to furnish an account of internalized\noppression and the process of overcoming it. It is common for women to\ncomport themselves in a feminine fashion, to scale down their\naspirations, and to embrace gender-compliant goals (Irigaray 1985a;\nBartky 1990; Babbitt 1993; Cudd 2006; Beauvoir 1949 [2011]). Feminists\naccount for this phenomenon by explaining that women internalize\npatriarchal norms: these norms are integrated into the cognitive,\nemotional, and conative structure of the self. Women may contribute to\ntheir own oppression without realizing it. At times, warped norms may\neven lead women to question their own sanity through a process that\nKate Abramson terms “gaslighting”. A gaslighted woman may\nlose her sense of self to the point where depression and grieving is\nappropriate (Abramson 2014). Once embedded in a woman’s psychic economy,\ninternalized oppression conditions her core desires. To maximize\ndesire-satisfaction, then, would be to collaborate in her own\noppression. Homo economicus’s equation of fulfillment with\ndesire-satisfaction is unable to get out of this bind.\n\nFinally, in dominant conceptions of the self, no one seems to be born\nand raised, for caregivers and birth mothers are driven offstage\n(Irigaray 1985b; Baier 1987; Code 1987; Held 1987; Willett 1995 and 2001; Kittay 1999; LaChance\nAdams and Lundquist 2012). The self appears to materialize on its own\nwith a starter set of basic physical desires and rational skills. No\none’s powers ever seem to deteriorate or change in different\ncontexts. Since dependency and vulnerability are denied, all\naffiliations are assumed to be freely chosen, and all transactions\nfreely negotiated. The repudiation of caregiving underwrites the\nvoluntaristic illusion of independence that characterizes the Kantian\nethical subject and homo economicus—and it is no coincidence\nhere that caregiving has traditionally been women’s work.\nAlternative virtues, such as care, love, tenderness, spontaneity, and\ninterdependence are registered as defeats for the “Man with the\nPlan” rather than aspects of resilient selfhood and a fluid\nsense of agency (Baier 1987; Koziej 2019). The mother cultivating a\n“social erotic” between herself and her infant through the\ndance of affect attunements (Willett 1995 and 2001), like the lover\nembracing the unexpected, transgress rigid modern norms of\nselfhood.\n\nFeminist critique exposes the partiality of the ostensibly universal\nKantian ethical subject and homo economicus. These conceptions of the\nself are: (1) androcentric because they replicate masculine\nstereotypes and ideals; (2) sexist because they demean anything that\nsmacks of the feminine; (3) masculinist because they help to\nperpetuate male dominance; and (4) elitist because they perpetuate\nother associated biases, including heterosexist, transphobic, racist,\nethnocentric, ableist, classist, and, arguably, speciesist biases\n(Haraway 2008). While the latter dimensions of these prevalent\nconceptions of the self are outside the scope of this article, these\nproblems cannot be disentangled from the larger critique and efforts\nat reconceptualizing a self that do not duplicate the modernist\nAnglo-European structures of dominance.\n2. Reclamation of Feminine Identities and Women’s Status\n\nThese oversights necessitate reconceptualizing the self in at least\ntwo respects. To account for features of the self that have been\ntraditionally overlooked, such as interdependence and vulnerability,\nthe self must be understood as socially situated and relational. To\naccount for the self’s ability to discern and resist ingrained\ncultural norms, the moral subject must not be reduced to the capacity\nfor reason. For many feminists, to acknowledge the self’s\ndependency is not to devalue the self but rather to value\nvulnerability (Code 2011), as well as to call into question the\nsupposed free agency of a self that implicitly corresponds to a\nmasculine ideal.\n\nYet one might worry that revaluing dependency risks perpetuating\nderogatory views of women as victim and men as agents and/or\nentrenching a gender binary that divides values into masculine and\nfeminine. A focus on dependency and care may additionally risk\nconflating women with mothers and nurturers in what Patrice DiQuinzio\nhas called “essential motherhood” (1999). Arguing that\nmoral virtues truly have no gender, Mary Wollstonecraft regards\n“feminine” virtues as perversions of these true virtues\nand laments women’s conscription into a bogus ideal\n(Wollstonecraft 1792). Similarly, Simone de Beauvoir labels women\nunder patriarchy “mutilated” and “immanent”\n(Beauvoir 1949 [2011]). Socialized to objectify themselves, women are\nsaid to become narcissistic, small-minded, and dependent on\nothers’ approval. Excluded from careers, waiting to be chosen by\ntheir future husbands, taken over by natural forces during pregnancy,\nand busy with tedious, repetitive housework, women never become\ntranscendent agents. For Beauvoir, they often resist the burden of\nresponsibility for their own freedom.\n\nThis portrayal of women as abject victims of the patriarchal family\nhas been challenged and modulated in contemporary feminist philosophy.\nWe shall review three major reclamation strategies: (1) revaluing the\ntraditionally “feminine” activities of mothering and other\nmodes of social bonding through the development of care ethics and\neros ethics; (2) rethinking autonomy by moving beyond the two\ntraditional models described above; and (3) reclaiming sexual\ndifference through a symbolic analysis of female identity.\n\nFeminists argue that pregnancy, birth, and mothering reveal important\nfeatures of the self, even for humans who do not have these\nexperiences themselves. Two overlapping philosophical\napproaches—an ethics of care and an ethics of eros—have\nrevalued the significance of the mother in ways that bear on the issue\nof the self. Both traditions emphasize that pregnancy and/or mothering\nreveal that agency is frequently co-constituted and dynamic. The care\ntradition varies among those who aim to value dependency work and/or\nreconceptualize autonomy so that autonomy and dependency are\ncompatible (Gilligan 1982 and 1987; Ruddick 1989; Kittay 1999; Held\n2006; Lindemann 2014). Care ethics emphasizes the value of care work\nand character virtues that reflect vulnerability. An ethics of eros\ndraws from traditions of “othermothering” and emancipatory\ndiscourses of generative libidinal drives and/or cultivating a social\neros of connection (Collins 1990; Irigaray 1993; Willett 1995, 2001, 2008, 2014, 2019; Lorde 2007). Social\nbonds may reflect a dynamic of kinship, political solidarity, or\ncommunity engagement outside the nuclear family paradigm (Collins\n1990; Nzegwu 2006). This tradition of eros foregrounds complicated\nmodes of interdependency that spiral out of the autonomy/dependency\nbinary and emphasize thick networks of social belongings. An ethics of\neros emphasizes the revitalizing affects of preconscious energy and\nconnectedness, and their creative potential for political subversion\nand communal practices. Here, the self is a multilayered phenomenon\nwith a dynamic set of roles and interconnected desires.\n\nHistorically, the relation between mother and child was either\nexcluded altogether from philosophical discourse or taken as mere\npreparation for a full expression of ethical selfhood. Prevalent\nWestern views commonly invoke a tale of early dependency on the family\nfollowed by the eventual achievement of autonomy through narratives of\nseparation and acquiring virtues of self-determination. In contrast,\nfeminists in the care ethics and eros traditions revalue the\nmother-child relationship as a way of figuring the interdependency of\nthe self. The infant’s development of creative communicative\nskills through affect attunement and face-to-face play explains the\nlifelong intensity of social bonds (Willett 1995, 2001, and 2014; Welsh 2013). Alternative traditions of\nmaturation may feature instead a multiplicity of social roles,\npractices, and connections. Hilde Lindemann argues that caregiving\nexhibits key features of what she calls the practice of\npersonhood of knowing when and how to hold and let go of parts of others identities (Lindemann 2014). Patricia Hill Collins\noffers glimpses of an erotic ethics of interconnectivity in her\ncharacterization of the fluidity of “othermothers” for\nblack American communities (Collins 1990). Collins cites Audre\nLorde’s distinct rendering of the term “eros” as not\nprimarily sexual or narrowly maternal, but rather as an energetic\ndrive that oppressive systems attempt to appropriate, but which may be\nregenerated through creative social practices. Cynthia Willett,\nexpanding upon critical traditions of eros, argues that the laughing\nmother provides a subversive complement to the long-suffering,\nself-sacrificing maternal ideal (Willett and Willett 2019), while Mary\nRawlinson advocates the generativity of mothers as an alternative to\nthe proprietary notion of the modern self (Rawlinson 2016). Because\nall people are cared for by an adult or adults, and every individual\nis shaped by this emotionally charged interaction, the self is\nessentially formed in and through its relations with its caregivers\n(Chodorow 1981). For Chodorow, the rigidly differentiated,\ncompulsively rational, and stubbornly independent self is a masculine\ndefensive formation—a warped form of the relational\nself—that develops as a result of fathers’ negligible\ninvolvement in childcare.\n\nCaring for a child involves a range of activities governed by a\ndistinct set of values: protecting and caring for a fragile existence\nand expanding the sense of self while acknowledging the limits of\none’s power and the unpredictability of events, being sensitive\nto the other’s very different viewpoint, and learning to love\nwhile struggling against traumatic social conditions, inadequate\nsocial services, and invasive governmental and medical interventions\n(Collins 1990; Brown 1998). The practice of motherhood calls upon a\nwide range of interpersonal, political, and reflective skills that go\nwell beyond the deliberative reasoning that dominates traditional view\nof the self. For instance, the ability to empathize with others and\nimaginatively reconstruct their unique viewpoints is vital to moral\nwisdom, but ethics that base moral judgment on an abstract conception\nof personhood marginalize this skill (Meyers 1994). Care and eros\nethicists revalue that which is traditionally deemed\nfeminine—feeling, intimacy, and nurturance—in order to\nreclaim the venues traditionally associated with women and to open up\na broader way of conceiving of the moral self.\n\nSome feminists seek to rebalance autonomy with care, while others do\naway with autonomy altogether. For some, autonomy is an androcentric\nrelic of modernism (Jaggar 1983; Addelson 1994; Hekman 1995; Card\n1996). Others assert women’s need for autonomous\nself-determination (Lugones and Spelman 1983; de Lauretis 1986; King\n1988; Govier 1993). Mothering itself frequently involves the need to\ncarve space and time away from one’s child (LaChance Adams\n and Lundquist 2012). It may also\ninvolve a reclamation of spirited independence in the “fearless\nfighter” role that women reclaim as part of a maternal ethos in\nsome cultures and/or oppressive conditions (Nzegwu 2006; Lorde 2007).\nIn this vein, a number of feminists present accounts of autonomy that\ndo not devalue the interpersonal capacities that are conventionally\ncoded feminine (Mackenzie 2014 and 2017; Nedelsky 1989; Meyers 1989\nand 2000; Benhabib 1999; Benjamin, 1988; Weir 1995). In feminist accounts, autonomy is not conflated\nwith self-sufficiency and free will, but rather is seen to be\nfacilitated by supportive relationships and to be a matter of degree\n(Friedman 1993). Feminist accounts also stress the autonomous\nindividual’s need for constructive feedback and the co-creation\nof selves with others (Brison 2002 and 2017; Cavarero 1997; Alcoff\n2017; Ahmed 2017). A feminist view opens the space for considering\nautonomy an ongoing and improvisational process of self-discovery,\nself-definition, and self-direction, rather than endorsing a set of\ndesires and goals chosen exclusively by the individual (Meyers 1989\nand 2000).\n\nIn addition to caregiving practices such as mothering, some feminists\nhave attended to the potential of pregnancy for reconsidering autonomy\nand independence. Additionally, pregnancy draws attention to a\nuniquely intimate embodiment of self-other imbrication. Iris Marion\nYoung argues that pregnancy is a testament to the split subject or\nself. For Young, pregnancy disrupts the integrity of the body. In\npregnancy, the boundary between self and other breaks down, and one\nexperiences one’s “insides as the space of another”\n(Young 1990). In contrast with Young, Gail Weiss suggests that\npregnancy allows us to re-envision the integrity of the body: instead\nof positioning the pregnant body as a breakdown of the traditional\nunified self, pregnancy reveals that bodily integrity is always\nalready fluid and expansive (Weiss 1999). As Talia Welsh points out,\nthe experiences of those who are pregnant reveal that selfhood is\nneither unified nor genderless (Welsh 2013). It may even be that\npregnancy offers a “metaphysically and phenomenologically\nprivileged” situation for investigating the interrelation\nbetween self and other (Rodemeyer 1998).\n\nWhile pregnancy affords opportunities for positively demonstrating the\nmultiplicity of the self, it may also shed light on the violations\nthat women face in patriarchal societies. Young points out that the\ninterventions of obstetric medicine into women’s bodies alienate\nwomen from themselves through pathologizing their conditions,\nsubjecting women to invasive medical technologies, and rendering women\npassive in the birthing process (Young 1990). The devaluation and\nsurveillance of black and brown pregnant bodies, such as in\nstate-induced abortions, call for greater empowerment of women rather\nthan an automatic praise of vulnerability (Brown 1998). In the last\nfew decades, medical technologies, such as sonography and fetal and\nneonatal surgery, have sometimes faced those who are pregnant with\nwrenching choices that test their agential resilience and capacities\nto care (Feder 2014; LaChance Adams and Lundquist 2012). Jennifer\nScuro suggests that all pregnancies involve a death within the self\nbecause all end in an expulsion of the other’s body from oneself\n(Scuro 2017). All\npregnancy thus dislodges presumptions of the self-possessed subject.\nAt the same time, this expulsion of the other is not always a\nbirth—pregnancy sometimes ends in miscarriage, when it does not\nend in abortion—and so pregnancy should be dissociated from\nchildbirth.\n\nAs is evident from this analysis of pregnancy, feminist theories of\nselfhood frequently combine philosophical analysis with social\ncritique and the testimony of lived experience. The latter has an\nespecially long history within phenomenology, where feminist\nphilosophers have been describing women’s experiences for the\npast century. Because phenomenology as a whole strongly emphasizes the\nbody and first-person experience, it fits methodologically with many\nof the goals of feminism. Specifically, phenomenological theories of\nembodiment emphasize the agential nature of the lived body, resisting\ntraditional conceptions from philosophy that make the body the mere\ninstrument of the mind. At the same time, feminist phenomenologists\nresist the abstract nature of traditional phenomenological methods.\nFor feminist phenomenology, different selves are differently\npositioned in ways that matter, and cannot be abstracted from their\nsocial roles into a transcendental domain of inquiry. This stands in\nopposition with classical phenomenology, which tended to promulgate a\nuniversalized notion of the ego that elided differences between\nbodies. Early women phenomenologists, such as Edith Stein and Gerda\nWalther, frequently analyze how traditionally feminine-coded values\nsuch as empathy and community play a part in women’s everyday\nlives and moral development (Stein 1996; Walther 1923). Most\ninfluentially, Simone de Beauvoir argues that the human condition is\nambiguous: experience involves “immanence”, or\nembeddedness within one’s historico-cultural and interpersonal\nsituation, and “transcendence”, or radical freedom with\nrespect to one’s choices and future. While all humans shared\nthis condition according to Beauvoir, she claims that women have been\noverwhelmingly associated with immanence, and thus have not been\nencouraged to claim their own freedom (Beauvoir 1949 [2011]). This\nmeans that their selves are generally overdetermined by their\nsituations and contexts—what biology and others claim them to\nbe. For Beauvoir, women should reassert their transcendence through\nproductive projects. Beauvoir thus puts an existentialist spin on both\nphenomenology’s emphasis on situation and some feminists’\nreclamation of autonomy. For Beauvoir, “woman” is a\ncategory imposed by society; women’s selves, then, are also in\nlarge part imposed on them by society, and women would do well to\nfashion their own selfhood through claiming their freedom. Yet this\nfreedom is always co-determined in situation with others.\n\nIn recent decades, feminist phenomenologists have further investigated\nthe living body as a site of selfhood that both reflects cultural\nnorms and can provide a site of resistance to them. Taking inspiration\nfrom Beauvoir’s claims about ambiguity, feminist\nphenomenologists undertake a wide range of investigations into\ndimensions of women’s bodily existence. Iris Marion Young, for\ninstance, has drawn attention to the way that women’s bodily\nmodes of expression reflect cultural norms of immanence and\nobjectification (Young 1990). Sandra Bartky shows that women are\nencouraged to take themselves as sexual objects, which alienates them\nfrom their lived bodies and encourages them to see their bodies and\nselves as passive (Bartky 1990). The phenomenology of embodiment is\nthus not separate from nexuses of social power (Oksala 2016). At the\nsame time, phenomenological attention to conditions such as pregnancy\n(described above) may illuminate a more positive side of the fractious\nnature of women’s selves: the self, here, is multiplicitous.\nConflict among roles is constitutive of the self, and it is especially\nsalient among women in patriarchal societies (Weiss 2008). Latina\nfeminist phenomenology has been particularly active in recent decades\nin reconceptualizing this multiplicitous self, as we will see in\ngreater detail in the following section.\n\nFeminist phenomenology also emphasizes the way that sexual violations\ntrade on the interdependent, vulnerable, and gendered nature of the\nself. Sexual violence is taken by many feminists not merely to be one\nform of physical violence among others, but rather to be a denial of\nself (Cahill 2001; Brison 2002). The body for phenomenology is the\ndynamic site of the self, and can only be reduced to an object under\noppressive social conditions (Beauvoir 1949 [2011]; Cahill 2001). As\nsuch, sexual violence cuts to the very heart of the self. Rape, for\ninstance, alters selfhood (Cahill 2001; Brison 2002; Alcoff 2017).\n\nPhenomenology is not the only site of feminist philosophy that\nunderscores the body and resists the mind/body dualism characteristic\nof modern notions of autonomous selfhood. The contemporary fields of\naffect theory and new materialism have pushed feminist conceptions of\nembodiment and selfhood even beyond a recognition of situated\nrelationality, sometimes arguing for a radical rupture of the\nself/other distinction. Sara Ahmed and Teresa Brennan suggest that\naffects and emotions neither go from the “inside out” nor\ncome from the “outside in”; rather, emotions may be found\nwithin the very atmosphere of the social (Ahmed 2004; Brennan 2004).\nRanjana Khanna sees affects as openings onto the other both\n“within” the self and beyond it (Khanna 2012). For\nfeminist new materialisms, the body is not an individual expressive\nwhole (as it remains in phenomenology); rather, the body is a\n“sexually preconstituted, dynamic bundle of relations”\n(Braidotti 2006) that is interconnected with the environment through\nintensities and flows (Grosz 1994). Feminist materialism often\npositions itself in contrast to poststructuralism because of the\nformer’s emphasis on the material body, but both of these\napproaches underscore the radical heterogeneity, or even nonexistence,\nof the self. And the new materialist focus on the body, following the\n“cyborg” theory of Donna Haraway, suggests that biological\nbodies are not set in opposition to technology; rather, they are\ndensely imbricated. Feminist materialism seeks to dislocate identities and\nfocus on becomings (Braidotti 2016).\n\nNew materialism in particular has been influenced by the work of\npoststructuralist Luce Irigaray, who draws on the imagery of the\nfemale body to offer an alternative to masculine models of autonomy.\nIrigaray plays off the symbol of the vaginal lips to figure a mode of\nselfhood in which the body is always already two, a self-touching\norganism that is multiplicitous (Irigaray 1985b and 1993). Through this gesture,\nIrigaray reclaims the association of the feminine with the body in the\nface of masculine dreams of separatist autonomy. Through her strategy\nof “mimesis”, Irigaray utilizes the very stereotypes that\nhave been used against women in order to undermine them: she plays on\nthe traditional conception of woman as the “other”, the\nmere body, the passive “mirror” of the male subject. She\ndepicts an erotic love of self that affirms difference within oneself\nand allows the self-differentiating subject to connect with others.\nShe also resists the very idea of identity as presuming a unified,\nphallocentric model of selfhood (Irigaray 1985b).\n\nThese and other reclamations of female identities have prompted a\nnumber of significant reconceptualizations of the self as relational\nand multilayered.\n3. Reconceptualizations of the Self\n3.1 The Dynamic and Relational Self\n\nAs we have seen, many feminist philosophers argue that it is a mistake\nto hold that rationality alone is essential to the self and that the\nideal self is transparent, unified, coherent, and independent, since\nthey discern misogynist subtexts in the atomistic individualism of the\nKantian ethical subject and homo economicus (see\n section 1).\n While some feminists argue for a relational model of autonomy, others\nreject the narrative of separation from the maternal sphere as an\noverarching framing device for maturation. Drawing upon multicultural\nand global sources, they see this narrative arc as falling short of\nthe complex dynamics of a multilayered, interconnected self that may\ngrow through sustained interactions through its community rather than\nin decisive breaks from them. In this section, we take up new\nconceptions of the relational self. These conceptions involve novel\ncontributions to the philosophy of selfhood, sometimes drawing on\nframeworks from traditions such as poststructuralism, psychoanalysis,\nnarrative theory, and local knowledges. Feminist philosophers\ngravitate toward these approaches to understanding selfhood because\nthey do not share the drawbacks that prompt feminist critiques of the\nKantian ethical subject and homo economicus. None of these approaches\nregards the self as homogeneous or transparent; none removes the self\nfrom its cultural or interpersonal setting; none sidelines the\nbody.\n\nTaking a psychoanalytic approach, Julia Kristeva maintains that\ninfants gradually develop autonomy from their caregivers, but\ncomplicates this narrative by transposing the classical Freudian\nconception of the self and its distinction between consciousness and\nthe unconscious into an explicitly gendered framework (Kristeva 1980;\nOliver 1993; McAfee 2003; Miller 2014). For Kristeva, the self is a\nsubject of enunciation—a speaker who can use the pronoun\n“I”. But speakers are neither unitary nor fully in control\nof what they say because discourse is bifurcated. The symbolic\ndimension of language, which is characterized by referential signs and\nlinear logic, corresponds to consciousness and control. The semiotic\ndimension of language, which is characterized by figurative language,\ncadences, and intonations, corresponds to the unruly, passion-fueled\nunconscious. All discourse combines elements of both registers. This\ncontention connects Kristeva’s account to feminist concerns\nabout gender and the self. Since the rational orderliness of the\nsymbolic is culturally coded masculine, while the affect-laden allure\nof the semiotic is culturally coded feminine, it follows that no\ndiscourse is purely masculine or purely feminine. The masculine\nsymbolic and the feminine semiotic are equally indispensable to the\nspeaking subject, whatever this individual’s socially assigned\ngender may be. Every self amalgamates masculine and feminine\ndiscursive modalities.\n\nLike the unconscious in classical psychoanalytic theory, the semiotic\ndecenters the self. One may try to express one’s thoughts in\ndefinite, straightforward language, yet because of the semiotic\naspects of one’s utterances, what one says carries no single\nmeaning and is amenable to being interpreted in more than one way. In\nKristeva’s view, this is all to the good, for accessing the\nsemiotic—that which is conveyed, often inadvertently, by the\nstyle of an utterance—kindles social critique. The semiotic\ngives expression to repressed, unconscious material. According to\nKristeva, what society systematically represses provides clues to what\nis oppressive about society and how society needs to be changed. Thus,\nshe discerns a vital ethical potential in the semiotic (Kristeva 1983\n[1987]). Since this ethical potential is explicitly linked to the\nfeminine, moreover, Kristeva’s account of the self displaces\n“masculine” adherence to principle as the prime mode of\nethical agency and recognizes the urgent need for a\n“feminine” ethical approach. At the same time,\nKristeva’s questionable-subject-in-process seems for some to\nenshrine the very gender dichotomy that causes women so much grief.\nThe association of the woman/mother with the unruly and ambiguous\nsemiotic may obscure the rich affect attunement and preverbal\ndialogues between caregivers and their socially-oriented infants\n(Willett 1995). Kelly Oliver’s interpretation of Kristeva\nresists some of these more gendered components of Kristeva’s\nview and expands upon the relational self as a capacity for a loving\nsense of “response-ability” to otherness and difference\n(Oliver 1998). For Oliver, the self is fluidly defined by its openness\nto others.\n\nIn contrast with the revaluing of motherhood and/or femininity that\nKristeva and others undertake (see\n section 2),\n poststructuralists, critical race theorists, and trans* feminists\nhave been vocal about the heterosexist and binary assumptions in some\nfeminist conceptions of the self, as well as their inattention to\nother forms of difference among women. In the face of this, many\nfeminists have offered accounts of the self designed to accommodate a\nwider range of differences. The earlier work of poststructuralist\nJudith Butler maintains that personal identity is an illusion (Butler\n1990). The self is merely an unstable discursive node, and\nsexed/gendered identity is a “corporeal style”—the\nimitation and repeated enactment of norms, frequently ones that are\ndemanded by cultural contexts. For Butler, psychodynamic accounts of\nthe self such as Kristeva’s camouflage the performative nature\nof the self and collaborate in the cultural conspiracy that maintains\nthe illusion that one has an anchored identity derived from\none’s biological nature (manifested in one’s genitalia).\nSuch accounts perniciously conceal the ways that normalizing regimes\nof the state and culture deploy power to enforce “natural”\nsexed/gendered bodies together with “unnatural” bodies,\nobscuring the arbitrariness of the constraints that are being imposed\nin order to deflect resistance to them. The solution, in\nButler’s view, is to question the categories of biological sex,\ngender, and sexuality that serve as markers of personal identity. Sex,\ngender, and sexuality are at the very “core” of\nself-identity, because self-identity is constructed through modes of\npower. Thus, resistance may be developed in enacting one’s\nidentity differently, through unorthodox performances and parodic\nidentities: the construction of identity is a site of political\ncontestation. Butler’s more recent work continues to emphasize\nthe relationality of the self through its dispossession by the very\ndiscursive structures that call the self into existence (Butler 2005).\n\nButler is also a major contributor to feminist theories of narrative\nidentity, one of the most important strands of contemporary feminist\ntheories of the self. Feminist narrative views of the self are\nprominent in both Anglo-American and Continental traditions of\nphilosophy. Adriana Cavarero promulgates the “narratable\nself” as an alternative to the self-constituting subject of\ntraditional philosophy (Cavarero 1997). This self does not have a\npremium on self-narration; rather, others may actually have a better\nhandle on one’s own self. For this reason, narrating oneself\nmust occur within a communal, political context. Subjectivity is\nnecessarily inclined toward others (Cavarero 1997). Butler, in part drawing on\nCavarero’s views, suggests that the self is constructed in an\nongoing fashion through giving an account of itself to others (Butler\n2005). Linda Martín Alcoff combines poststructuralism with a\nhermeneutic approach, declaring that social identities are\nrelational and core to narratives of the self (Alcoff\n2006). Memory has long been seen as a locus of\nself-identity, and narrating one’s life story is crucially\nlinked with memory. Yet feminists contend that narration and memory\nare relational, often involving communal social practices (Brison\n2002; Campbell 2003). Rather than promulgating an ideal of\nself-knowledge, which presumes a fixed self that a reliable, rational\nknower discovers at the core of everyday life, feminist narrative\ntheorists advocate self-cultivation within contextual practices.\nHere we see again that for\nfeminists, the ontology and metaphysics of selfhood are inseparable\nfrom ethical, social, and political domains.\n\nThis is also the case for strands of queer and trans* theory as they\nintersect with feminist approaches. For trans* theorists, metaphysical\nquestions about identity operate within dominant discourses that\nfrequently perpetuate violence and transphobia, as well as within\nqueer and transgender subcultures that redefine gender and sex\nidentities in a dynamic, collaborative fashion (Bettcher 2014, 2016,\n2017a, 2017b). Trans feminist Talia Mae Bettcher pushes back on\nnarratives of trans identity that are modeled on liberal individualist\nmodels of selfhood, such as the idea that a trans individual might\nhave been “trapped in the wrong body” and, after coming\nout, may let their core true self come to the surface (Bettcher 2014).\nBettcher contends that the idea of a true gendered self at the core of\na person overlooks the ways that gender and sex are created by culture\n(Bettcher 2014). It also tends to entrench mind-body dualism, whereas\nmovements such as phenomenology have shown that gendered embodiment is\na very feature of selfhood. In this vein, Bettcher argues that sexism\nand transphobia trade on a presumed hierarchy where one’s\n“proper” appearance, or clothed appearance in public, is\ntaken to be subordinate to one’s “intimate”\nappearance when naked. For Bettcher, these two forms of appearance are\nin fact on par, since both are culturally constituted.\n\nTrans* feminist accounts frequently underscore the relationality of\nthe self, including the potential that others have to define us. If\nothers did not have such power, internalized sources of psychic\ndiscord such as gender dysphoria, and the desire that many trans*\nfolks express for recognition or “passing”, would be\ndifficult to explain. It would also be difficult to explain\ntransphobia: as Alexis Shotwell and Trevor Sangrey argue, cisgender\nindividuals’ resistance to recognizing trans* identities hinges\non the fact that trans* gender expression affects cisgender identity\n(Shotwell and Sangrey 2009). Shotwell and Sangrey draw on the feminist\ntheory of selfhood put forth by Brison to develop this argument. And,\nwhile the relational constitution of gender identity within a given\nculture is a cause of transphobia, some queer and trans* feminists\nhold that it is also the basis of self-transformation. Specifically,\nKim Q. Hall points out that queer crip communities affirm transforming\noneself through transforming one’s bodies. These creative\ntransformations occur within “the context of communities of\nsupport and recognition” (Hall 2009). They frequently involve\nthe desire for intersubjective recognition, where body modifications\nmay be undertaken in order to foster a relatively continuous sense of\nself (Rubin 2003). This further demonstrates the way that public\nidentities are not removed from an interior sense of self, as liberal\nindividual models tended to assume. This continuity, however, need not\nrely on the narrative of a “core” interior self that is\nmerely seeking validation from a public. Instead, intersubjective\nself-fashioning may reject an interior/exterior dichotomy to begin\nwith, following arguments such as Bettcher’s above. They also\nfollow feminist phenomenology in disrupting the presumed binary\nbetween nature and culture in bodily comportment (Salamon 2010; Heyes\n2007; Hale 1998). Although discussions in trans* theory and queer\ntheory often do not occur within a feminist context, the emphasis on\nlived embodiment, first-person authority, and the relationality of\nselfhood frequently found in these discourses both draw on and\ncontribute to feminist discussions of selfhood in crucial ways.\n3.2 The Intersectional and Multiplicitous Self\n\nOver the past several decades, biosocial, intersectional, and\nphenomenological layers of the relational self have increasingly\ngained prominence. Intersectional theories of selfhood brought forward\nby African American feminists note that stratifications of social\nidentities such as gender, race, and class do not operate in isolation\nfrom one another (Williams 1991; Crenshaw 1993). Rather, these\nidentity modalities interact to produce compound effects. As such, the\nindividual is an intersectional self, or even multiple selves, where\nstructures of subordination but also of agency converge (Moraga and\nAnzaldúa 1981; King 1988; Crenshaw 1993). Intersectional theory\naims to capture those aspects of selfhood that are conditioned by\nmembership in subordinated or privileged social groups. Accenting the\nliabilities of belonging to more than one subordinated group,\nKimberlé Crenshaw likens the position of such individuals to\nthat of a pedestrian hit by several speeding vehicles simultaneously,\nwhile María Lugones likens their position to that of a\nborder-dweller who is not at home anywhere (Crenshaw 1991; Lugones\n1992). As a “world traveler”, Lugones finds herself\nshifting between Latinx and Anglo-American worlds. She offers the\nimage of a “curdled self” to indicate the heterogeneity of\nselfhood in such conditions (Lugones 1994). For Gloria\nAnzaldúa, the mestiza is a central figure for\nunderstanding a new kind of self with an ambiguous, fluid identity:\nthe mestiza experiences a sense of constant in-betweenness\nthat fosters unique modes of meaning-making. As such, intersectional\nborder-dwelling can be a model of positive identity that registers the\nmultiplicitous nature of the self (Anzaldúa 1987; Ruíz\n2016; Alarcón 1991 and 1996; Barvosa 2008; Ortega\n2016). Border-dwelling selves are frequently ill at ease in the world,\nbut this need not be a disadvantage; rather, it may offer a unique\nlens for interpreting the fractious nature of the self as well as the\npossibilities for resistance to oppressive social norms.\n\nSome feminists are comfortable rejecting the unity of the self\naltogether and suggesting that persons are comprised of what Edwina\nBarvosa calls a “wealth of selves” (Barvosa 2008).\nMaría Lugones influentially argues that\n“world-traveling” is a modality of moving between mutually\nexclusive selves that appear within different contexts (Lugones\n2003). Barvosa advocates\nstriving to unify these mutually exclusive selves through a\nself-integrative life project (Barvosa 2008). Mariana Ortega takes\nissue with both of these positions because they advocate an\nontological pluralism: one individual is comprised of multiple selves\n(Ortega 2016). For Ortega, this position is untenable, because it\nfails to account for the fact that a self must have some unique\nidentity. In order to do justice both to the uniqueness of the self\nand to its multiplicity, Ortega argues that selves are ontologically\nsingular but existentially plural. Persons, for her, are characterized\nby a singular multiplicitous self with various facets that are always\nin the process of becoming. Ortega utilizes phenomenology in order to\nargue that the self experiences an existential continuity over time,\neven as its roles and identities may be incommensurate in various\ncontexts.\n\nTheories of the multiplicitous self resonate with Lorde’s\n“sister outsider” and Collins’\n“outsider-within”, which, in contrast with W.E.B.\nDuBois’s well-established account of “double\nconsciousness”, develop a multitudinous identity in connection\nwith others. This identity is not primarily oriented around the\nblack/white divide prominent in DuBois, nor in modern theories of\nautonomy, but instead around multiple roles and sources of energy,\nkinship, and and community. As we saw above, proponents of the\nintersectional self credit multiply oppressed people with a certain\nepistemic advantage in virtue of their suffering and alienation. Thus,\nblack women are acutely aware of racism within feminism and sexism\nwithin the struggle for racial justice. Their intersectional\npositioned selfhood makes such insight virtually unavoidable.\n\nWhile intersectional theorists bring forward race, class, ability, and\nother socioeconomic markers as central to psychical-historical\nlocations of agency, power, and connectivity, a number of feminists\nare increasingly paying attention to somatic and organic factors in\nselfhood. In addition to the revaluing of embodiment in affect theory\nand new materialisms mentioned above\n (section 2),\n Catherine Malabou points to mental ailments such as Alzheimer’s\ndisease to press upon poststructuralist and psychoanalytic theories of\nselfhood (Malabou 2012). Diseases with a physical basis challenge any\nconception of subjectivity located exclusively in the psychic\ncontinuities of conscious and/or unconscious life as posited by\npsychoanalytic theory. Malabou reinterprets Derrida’s\ndeconstructive self as punctured by experiences of alterity through a\nnon-reductive neurobiology of trauma and brain injury. Injured selves\nmay experience radical discontinuities or lose entirely aspects of\ntheir former selves. The resulting picture of the self is a\nmultilayered nexus of relations with psychic-historical and\nsomatic-organic strata. Her work makes clear that feminist\nphilosophies of the self cannot ignore the biological sciences.\n\nWillett combines this turn to biological and psychological studies of\naffect and social emotions with Africana, Latina, and other feminist\ntraditions of the interconnected self. As a social species, the most\nbasic drives and affects of the human self are prosocial, not\nnarcissistic or hedonistic. Maturity does not require abjection,\nrepression, or traumatizing discipline for social cooperation. The\ncapacity for love, friendship, and cooperation with social groups\ncharacterizes humans as a biological species. One consequence of the\nbiosocial drives, as we have seen, is the rejection of the autonomy\nnarrative as the primary or exclusive goal of self-development\n(Willett 1995, 2001). The self matures through enhanced\ncapacities and desires to form social bonds, not severance from a\nsource of dependence (typically portrayed as the mother, the body,\nand/or the animal world).\n\nAnother consequence of this intermingling of the biological with the\nsocial is that intersectionality theory is now extended to include\nmixed-species communities (Haraway 2008; Midgley 1983). This\neco-feminist extension of eros ethics follows from the re-centering of\nethics on affects and eros rather than on the rational capacities that\nmark human superiority and separation from other animal species.\nWillett discerns four strata for envisioning connections across human\nand nonhuman selves, corresponding to modes of social bonds: 1)\nsubjectless sociality, 2) affect attunement, 3) biosocial network as\nlivable place or home, and 4) compassion and the visceral (gut)\nconscience (Willett 2014). These four layers reveal that social\naffects such as laughter or panic transfer from one creature to\nanother, whether from an adult to an infant or within a community of\nbirds, as well as emphasizing that visceral feelings shared among\ncreatures are a key source of moral response. The biosocial layering\nof selfhood reclaims maternal relationality as more than a mechanical\ninstinct for humans and any number of other animal species. The\naffect-laden, relational self cannot transcend through reason its\nsocial embeddedness in a complex politics of in-group/out-group\nmarkers. As we saw above\n (section 2),\n rules appealed to by autonomous selves do not guarantee unbiased\ndecisions. Thanks in large part to feminist critiques of traditional\nmodels of selfhood and ethics, views that emphasize the relational\nnature of the self and its heterogeneous features are moving to the\ncenter of ethics. At the same time, feminists offer a wide range of\nmethodologies and conclusions with respect to this relational self\nthat are sometimes in conflict, reminding us that the work of feminist\nphilosophy is far from finished.\n4. Conclusion\n\nAs this article attests, there is tremendous foment and variety within\nthe field of feminist work on the self. Yet, in reviewing this\nliterature, we have been struck by a recurrent theme: namely, the\ninextricability of metaphysical issues of the self from moral, social,\nand political theory. Feminist critiques of regnant philosophical\ntheories of the self expose the normative underpinnings of supposedly\nneutral metaphysics. Feminist analyses of women’s agential\ncapacities both acknowledge traditional feminine social contributions\nand provide accounts of how women can overcome oppressive norms and\npractices. Feminist reconstructions of the nature of the self are\ninterwoven with arguments that draw out the emancipatory benefits of\nconceiving the self one way rather than another. There is nothing\nsurprising, to be sure, about the salience of normative concerns in\nfeminist philosophizing Still, we mention it because we believe that\nfeminists’ attention to sociopolitical concerns leads to fresh\nquestions that enrich the philosophical understanding of the self.\nMoreover, we would urge that this forthrightness about the political\nviewpoint that informs philosophy s a virtue, for overlooking the\npolitical suppositions and implications of esoteric philosophical\nviews has led to considerable mischief. It is precisely the failure to\nacknowledge that the question of the self is not narrowly metaphysical\nthat has led to philosophy’s implicit modeling of the self on a\nmale subject, a tendency that feminist perspectives on the self seek\nto remediate.\n",
    "bibliography": {
        "categories": [
            "Comprehensive Bibliography",
            "References"
        ],
        "cat_ref_text": {
            "Comprehensive Bibliography": "</h3>\n<p>\nIn the interests of concision and readability, the present essay\nmentions only some of the representative works on the feminist\nliterature on the self. These cited works are collated in the\nBibliography which appears in the next section of this essay. However,\nthe feminist literature on the self is vast. Lisa Cassidy, Diana\nTietjens Meyers, and Ellie Anderson have put together a comprehensive\nbibliography of this literature; it attempts to cite all of the books\nand articles that are relevant to the present entry. This\ncomprehensive bibliography is linked into the present essay as the\nfollowing supplementary document:</p>\n<p>\n<a href=\"bib.html\">",
            "References": " of Feminist Perspectives on the Self</a>\n</p>\n<p>\nReaders are therefore encouraged to pursue additional references by\nfollowing the above link.</p>\n<h3 id=\"Refe\">"
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"CompBibl\">Comprehensive Bibliography</h3>\n<p>\nIn the interests of concision and readability, the present essay\nmentions only some of the representative works on the feminist\nliterature on the self. These cited works are collated in the\nBibliography which appears in the next section of this essay. However,\nthe feminist literature on the self is vast. Lisa Cassidy, Diana\nTietjens Meyers, and Ellie Anderson have put together a comprehensive\nbibliography of this literature; it attempts to cite all of the books\nand articles that are relevant to the present entry. This\ncomprehensive bibliography is linked into the present essay as the\nfollowing supplementary document:</p>\n<p>\n<a href=\"bib.html\">Comprehensive Bibliography of Feminist Perspectives on the Self</a>\n</p>\n<p>\nReaders are therefore encouraged to pursue additional references by\nfollowing the above link.</p>\n<h3 id=\"Refe\">References</h3>\n<p>\nThe following works are cited in the entry.</p>\n<ul class=\"hanging\">\n<li>Abramson, Kate, 2014, “Turning Up the Lights on\nGaslighting”, in <em>Philosophical Perspectives</em>, 28(1):\n1–30.</li>\n<li>Addelson, Kathryn Pyne, 1994, <em>Moral Passages: Toward a\nCollectivist Moral Theory</em>, New York: Routledge.</li>\n<li>Ahmed, Sara, 2004, <em>The Cultural Politics of Emotion</em>, New\nYork: Routledge.</li>\n<li>–––, 2017, <em>Living a Feminist Life</em>,\nDurham and London: Duke University Press.</li>\n<li>Alarcón, Norma, 1991, “The Theoretical Subject(s) of\nThis Bridge Called My Back and Anglo-American Feminism”, in\n<em>Criticism in the Borderlands: Studies in Chicano Literature,\nCulture, and Ideology</em>, Héctor Calderón and\nJosé David Saldívar (eds.), Durham, NC: Duke University\nPress, 28–40. doi:10.1215/9780822382355-005</li>\n<li>–––, 1996, “Conjugating Subjects in the\nAge of Multiculturalism”, in <em>Mapping Multiculturalism</em>,\nAvery F. Gordon and Christopher Newfield (eds.), Minneapolis, MN:\nUniversity of Minnesota Press, 127–148.</li>\n<li>Alcoff, Linda Martin, 2006, <em>Visible Identities: Race, Gender,\nand the Self</em>, (Studies in Feminist Philosophy), New York: Oxford\nUniversity Press. doi:10.1093/0195137345.001.0001</li>\n<li>–––, 2017, <em>Rape and Resistance</em>, Malden,\nMA: Polity Press.</li>\n<li>Al-Saji, Alia, 2014, “A Phenomenology of Hesitation:\nInterrupting Racializing Habits of Seeing”, in <em>Living\nAlterities: Phenomenology, Embodiment, and Race</em>, Emily Lee (ed.),\nAlbany, NY: State University of New York Press, 133–172.</li>\n<li>Anzaldúa, Gloria, 1987, <em>Borderlands: The New Mestiza/La\nFrontera</em>, San Francisco: Spinters/Aunt Lute. </li>\n<li>Arruzza, Cinzia, Tithi Bhattacharya, and Nancy Fraser, 2019,\n<em>Feminism for the 99%: A Manifesto</em>, London and New York:\nVerso.</li>\n<li>Babbitt, Susan, 1993, “Feminism and Objective Interests: The\nRole of Transformation Experiences in Rational Deliberation”, in\n<em>Feminist Epistemologies</em>, Linda Alcoff and Elizabeth Potter\n(eds.), New York: Routledge, 245–265.</li>\n<li>Baier, Annette C., 1987, “The Need for More than\nJustice”, <em>Canadian Journal of Philosophy</em>, 17(sup1):\n41–56. doi:10.1080/00455091.1987.10715928</li>\n<li>Bartky, Sandra Lee, 1990, <em>Femininity and Domination: Studies\nin the Phenomenology of Oppression</em>, New York: Routledge.\ndoi:10.4324/9780203825259</li>\n<li>Barvosa, Edwina, 2008, <em>Wealth of Selves: Multiple Identities,\nMestiza Consciousness, and the Subject of Politics</em>, College\nStation, TX: Texas A&amp;M University Press. </li>\n<li>Beauvoir, Simone de, 1949 [2011], <em>Le Deuxième\nSexe</em>, Paris: Gallimard. Translated as <em>The Second Sex</em>,\nConstance Borde and Sheila Malovaney-Chevallier (trans.), New York:\nAlfred A. Knopf, 2011.</li>\n<li>Benhabib, Seyla, 1999, “Sexual Difference and Collective\nIdentities: The New Global Constellation”, <em>Signs: Journal of\nWomen in Culture and Society</em>, 24(2): 335–361.\ndoi:10.1086/495343</li>\n<li>–––1992, <em>Situating the Self</em>, Cambridge: Polity.</li>\n<li>Benhabib, Seyla, Judith Butler, Drucilla Cornell, and Nancy\nFraser, 1995, <em>Feminist Contentions: A Philosophical Exchange</em>,\nNew York: Routledge. doi:10.4324/9780203825242</li>\n<li>Benjamin, Jessica, 1988, <em>The Bonds of Love</em>, New York: Random House.</li>\n<li>Bettcher, Talia Mae, 2014, “Trapped in the Wrong Theory:\nRethinking Trans Oppression and Resistance”, <em>Signs: Journal\nof Women in Culture and Society</em>, 39(2): 383–406.\ndoi:10.1086/673088</li>\n<li>–––, 2016, “Intersexuality, Transgender,\nand Transsexuality”, in Disch and Hawkesworth 2016,\n407–427.</li>\n<li>–––, 2017a, “Trans Feminism: Recent\nPhilosophical Developments: Recent Philosophical Developments”,\n<em>Philosophy Compass</em>, 12(11): e12438.\ndoi:10.1111/phc3.12438</li>\n<li>–––, 2017b, “Through the Looking Glass:\nTrans Theory Meets Feminist Philosophy”, in Garry, Khader, Stone\n2017, 393–404.</li>\n<li>Bordo, Susan, 1993, <em>Unbearable Weight: Feminism, Western\nCulture, and the Body</em>, Berkeley, CA: University of California\nPress. </li>\n<li>Braidotti, Rosi, 2006, <em>Transpositions: On Nomadic Ethics</em>,\nMalden, MA: Polity Press.</li>\n<li>–––, 2016, “Posthuman Feminist\nTheory”, in Disch and Hawkesworth 2016, 673–698.</li>\n<li>Brennan, Teresa, 2004, <em>The Transmission of Affect</em>,\nIthaca, NY: Cornell University Press.</li>\n<li>Brison, Susan J., 2002, <em>Aftermath: Violence and the Remaking\nof a Self</em>, Princeton and Oxford: Princeton University Press.</li>\n<li>–––, 2017, “Personal Identity and\nRelational Selves”, in Garry, Khader, Stone 2017, 218–230.</li>\n<li>Brown, Wendy, 1998, <em>Manhood and Politics: A Feminist Reading\nin Political Theory</em>, Totowa, NJ: Rowman and Littlefield. </li>\n<li>Butler, Judith, 1990, “Gender Trouble, Feminist Theory, and\nPsychoanalytic Discourse”, in <em>Feminism/Postmodernism</em>,\nLinda J. Nicholson (ed.), New York: Routledge, chapter 13. </li>\n<li>–––, 2005, <em>Giving an Account of\nOneself</em>, New York: Fordham University Press.</li>\n<li>Butler, Judith, and Athena Athanasiou, 2013, <em>Dispossession:\nThe Performative in the Political</em>, Malden, MA: Polity Press.</li>\n<li>Cahill, Ann J., 2001, <em>Rethinking Rape</em>, Ithaca and London:\nCornell University Press.</li>\n<li>Campbell, Sue, 2003, <em>Relational Remembering: Rethinking the\nMemory Wars</em>, Lanham, MD: Rowman and Littlefield.</li>\n<li>Card, Claudia, 1996, <em>The Unnatural Lottery: Character and\nMoral Luck</em>, Philadelphia, PA: Temple University Press.</li>\n<li>Cavarero, Adriana, 1997 [2000], <em>Tu che mi guardi, tu che mi\nracconti</em>, Milan: Giagiacomo Feltrinelli. Translated as\n<em>Relating Narratives: Storytelling and Selfhood</em>, Paul A.\nKottman (trans), (Warwick Studies in European Philosophy), London:\nRoutledge, 2000.</li>\n<li>–––, 2016, <em> Inclinations: A Critique of Rectitude</em>, Stanford: Stanford University Press. </li>\n<li>Chodorow, Nancy, 1981, “On ‘The Reproduction of\nMothering’: A Methodological Debate, part 4”, <em>Signs:\nJournal of Women in Culture and Society</em>, 6(3): 500–514.\ndoi:10.1086/493820</li>\n<li>Code, Lorraine, 1987, “Second Persons”, <em>Canadian\nJournal of Philosophy</em>, 17(sup1): 357–382.\ndoi:10.1080/00455091.1987.10715942</li>\n<li>–––, 2011, “Self, Subjectivity, and the\nInstituted Social Imaginary”, in <em>The Oxford Handbook of the\nSelf</em>, Shaun Gallagher (ed.), New York: Oxford University\nPress.</li>\n<li>Collins, Patricia Hill, 1990, <em>Black Feminist Thought:\nKnowledge, Consiousness, and the Politics of Empowerment</em>, Boston:\nUnwin Hyman. </li>\n<li>Crenshaw, Kimberlé William, 1991, “Demarginalizing\nthe Intersection of Race and Sex: A Black Feminist Critique of\nAntidiscrimination Doctrine, Feminist Theory, and Antiracist\nPolitics”, in <em>Feminist Legal Theory: Readings in Law and\nGender</em>, Katherine T. Bartlett and Rosanne Kennedy (eds), Boulder,\nCO: Westview Press, chapter 4. </li>\n<li>–––, 1993, “Beyond Race and Misogyny:\nBlack Feminism and 2 Live Crew”, in <em>Words that Wound:\nCritical Race Theory, Assaultive Speech, and the First Amendment</em>,\nMari J. Matsuda, Charles R. Lawrence III, Richard Delgado, and\nKimberlé Williams Crenshaw (eds), Boulder, CO: Westview Press,\nchapter 5.</li>\n<li>Cudd, Ann E., 2006, <em>Analyzing Oppression</em>, New York:\nOxford University Press. doi:10.1093/0195187431.001.0001</li>\n<li>de Lauretis, Teresa, 1986, “Feminist Studies/Critical\nStudies: Issues, Terms, Contexts”, in <em>Feminist\nStudies/Critical Studies</em>, Teresa de Lauretis (ed.), Bloomington,\nIN: Indiana University Press, chapter 1.</li>\n<li>DiQuinzio, Patrice, 1999, <em>The Impossibility of Motherhood:\nFeminism, Individualism and the Problem of Mothering</em>, New York:\nRoutledge. doi:10.4324/9780203820704</li>\n<li>Disch, Lisa and Mary Hawkesworth (eds.), 2016, <em>The Oxford\nHandbook of Feminist Theory</em>, New York: Oxford University Press.\ndoi:10.1093/oxfordhb/9780199328581.001.0001</li>\n<li>Feder, Ellen K., 2014, <em>Making Sense of Intersex: Changing\nEthical Perspectives in Biomedicine</em>, Bloomington, IN: Indiana\nUniversity Press. </li>\n<li>Fischer, Clara, 2014, <em>Gendered Readings of Change: A\nFeminist-Pragmatist Approach</em>, New York: Palgrave Macmillan US.\ndoi:10.1057/9781137342720</li>\n<li>Fricker, Miranda, 2007, <em>Epistemic Injustice: Power and the Ethics of Knowing</em>, Oxford: Oxford University Press. </li>\n<li>Friedman, Marilyn A., 1993, <em>What are Friends For?</em>,\nIthaca, NY: Cornell University Press. </li>\n<li>Garry, Ann, Serene J. Khader, and Alison Stone (eds.), 2017,\n<em>The Routledge Companion to Feminist Philosophy</em>, New York:\nRoutledge. doi:10.4324/9781315758152</li>\n<li>Gilligan, Carol, 1982, <em>In a Different Voice</em>, Cambridge,\nMA: Harvard University Press. </li>\n<li>–––, 1987, “Moral Orientation and Moral\nDevelopment”, in Kittay and Meyers 1987: 31–46. </li>\n<li>Govier, Trudy, 1993, “Self-Trust, Autonomy, and\nSelf-Esteem”, <em>Hypatia</em>, 8(1): 99–120.\ndoi:10.1111/j.1527-2001.1993.tb00630.x</li>\n<li>Grosz, Elizabeth, 1994, <em>Volatile Bodies: Toward a Corporeal\nFeminism</em>, Bloomington, IN: Indiana University Press.</li>\n<li>Hale, C. Jacob, 1998, “Tracing a Ghostly Memory in My\nThroat: Reflections on Ftm Feminist Voice and Agency”, in\n<em>Men Doing Feminism</em>, Tom Digby (ed), New York: Routledge,\n99–130.</li>\n<li>Hall, Kim Q., 2009, “Queer Breasted Experience”, in\n<em>“You’ve Changed”: Sex Reassignment and Personal\nIdentity</em>, Laurie J. Shrage (ed.), New York: Oxford University\nPress, chapter 7.</li>\n<li>Haraway, Donna, 2008, <em>When Species Meet</em>, Minneapolis, MN:\nUniversity of Minnesota Press.</li>\n<li>Hekman, Susan J., 1995, <em>Moral Voices, Moral Selves</em>,\nUniversity Park, PA: Pennsylvania State University Press. </li>\n<li>Held, Virginia, 1987, “Feminism and Moral Theory”, in\nKittay and Meyers 1987, pp. 111–128. Also in Meyers 1997:\nchapter 32.</li>\n<li>–––, 2006, <em>The Ethics of Care: Personal,\nPolitical, and Global</em>, New York: Oxford University Press.\ndoi:10.1093/0195180992.001.0001</li>\n<li>Heyes, Cressida, 2007, <em>Self-Transformations: Foucault, Ethics,\nand Normalized Bodies</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195310535.001.0001</li>\n<li>Irigaray, Luce, 1985a, <em>Speculum of the Other Woman</em>,\nIthaca, NY: Cornell University Press. </li>\n<li>–––, 1985b, <em>This Sex which is not one</em>,\nIthaca, NY: Cornell University Press. </li>\n<li>–––, 1993, <em>Ethics of Sexual Difference</em>,\nIthaca, NY: Cornell University Press. </li>\n<li>Jaggar, Alison M., 1983, <em>Feminist Politics and Human\nNature</em>, Totowa, NJ: Rowman &amp; Littlefield. </li>\n<li>Khanna, Ranjana, 2012, “Touching, Unbelonging, and the\nAbsence of Affect”, <em>Feminist Theory</em>, 13(2):\n213–232. doi:10.1177/1464700112442649</li>\n<li>King, Deborah K., 1988, “Multiple Jeopardy, Multiple\nConsciousness: The Context of a Black Feminist Ideology”,\n<em>Signs: Journal of Women in Culture and Society</em>, 14(1):\n42–72. Also in Meyers 1997: chapter 12. doi:10.1086/494491</li>\n<li>Kittay, Eva Feder, 1999, <em>Love's Labor</em>, New York:\nRoutledge. </li>\n<li>Kittay, Eva Feder and Diana T. Meyers (eds.), 1987, <em>Women and\nMoral Theory</em>, Totowa, NJ: Rowman &amp; Littlefield.</li>\n<li>Koziej, Stephanie, 2019, “Towards a Tender Sexuality: From\nFreud’s Implicit Taboo on Adult Erotic Tenderness, to the Unexplored\nTender Critical Potential of Mitchell and Perel’s Clinical\nPractice.”, <em>Psychoanalytic Psychology</em>, 36(4):\n342–350. doi:10.1037/pap0000258</li>\n<li>Kristeva, Julia, 1980, <em>Desire in Language: A Semiotic Approach\nto Literature and Art</em>, Leon S. Roudiez (ed.). Thomas Gora, Alice\nJardine, and Leon S. Roudiez (trans.), (European Perspectives), New\nYork: Columbia University Press. Translation of several of her French\nessays.</li>\n<li>–––, 1983 [1987], <em>Histoires d’amour</em>,\nParis: Editions Denoël. Translated as <em>Tales of Love</em>,\nLeon S. Roudiez (trans.), New York: Columbia University Press,\n1987.</li>\n<li>–––, 1988 [1991], <em>Étrangers à\nNous-Mêmes</em>, Paris: Fayard. Translated as <em>Strangers to\nOurselves</em>, Leon S. Roudiez (trans.), (European Perspectives), New\nYork: Columbia University Press, 1991.</li>\n<li>LaChance Adams, Sarah, 2014, <em>Mad Mothers, Bad Mothers, and\nWhat a ‘Good’ Mother Would Do: The Ethics of\nAmbivalence</em>, New York: Columbia University Press.</li>\n<li>LaChance Adams, Sarah and Caroline R. Lundquist (eds), 2012,\n<em>Coming to Life: Philosophies of Pregnancy, Childbirth, and\nMothering</em>, New York: Fordham University Press.</li>\n<li>Lindemann, Hilde, 2014, <em>Holding and Letting Go: The Social\nPractice of Personal Identities</em>, Oxford: Oxford University Press.\n</li>\n<li>Lloyd, Genevieve, 1984, <em>The Man of Reason “male”\nand “Female” in Western Philosophy</em>, London:\nMethuen.</li>\n<li>Lorde, Audre, 2007, <em>Sister Outsider: Essays and Speeches</em>,\nBerkeley, CA: Crossing Press. </li>\n<li>Lugones, María, 1992, “On ‘Borderlands/La\nFrontera’: An Interpretive Essay”, <em>Hypatia</em>, 7(4):\n31–37. doi:10.1111/j.1527-2001.1992.tb00715.x</li>\n<li>–––, 1994, “Purity, Impurity, and\nSeparation”, <em>Signs: Journal of Women in Culture and\nSociety</em>, 19(2): 458–479. doi:10.1086/494893</li>\n<li>–––, 2003, <em> Pilgrimages/Perigrinajes:\nTheorizing Coalition Against Multiple Oppressions</em>, Lanham,\nMaryland: Rowman and Littlefield.</li>\n<li>Lugones, María C. and Elizabeth V. Spelman, 1983,\n“Have We Got a Theory for You! Feminist Theory, Cultural\nImperialism and the Demand for ‘the Woman’s Voice’”,\n<em>Women’s Studies International Forum</em>, (Hypatia) 6(6):\n573–581. doi:10.1016/0277-5395(83)90019-5</li>\n<li>Malabou, Catherine, 2012, <em>The New Wounded: From Neurosis to\nBrain Damage</em>, New York: Fordham University Press. </li>\n<li>Mackenzie, Catriona, 2014, “The Importance of Relational\nAutonomy and Capabilities for and Ethics of Vulnerability”, in\n<em>Vulnerability: New Essays in Ethics and Feminist Philosophy</em>,\nCatriona Mackenzie, Wendy A. Rogers, and Susan Dodds (eds), New York:\nOxford University Press, 33–59.\ndoi:10.1093/acprof:oso/9780199316649.003.0002</li>\n<li>–––, 2017, “Feminist Conceptions of\nAutonomy”, in Garry, Khader, Stone 2017, 515–527.</li>\n<li>Manne, Kate, 2019, <i> Down Girl</i>, Oxford: Oxford University Press. </li>\n<li>McAfee, Noelle, 2003, <em>Julia Kristeva</em>, New York:\nRoutledge. </li>\n<li>–––, 2019, <em>Fear of Breakdown: Politics and\nPsychoanalysis</em>, New York: Columbia University Press.</li>\n<li>McDonagh, Eileen L., 1996, <em>Breaking the Abortion\nDeadlock</em>, New York: Oxford University Press. </li>\n<li>Meyers, Diana Tietjens, 1989, <em>Self, Society, and Personal\nChoice</em>, New York: Columbia University Press. </li>\n<li>–––, 1994, <em>Subjection and Subjectivity</em>,\nNew York: Routledge. </li>\n<li>––– (ed.), 1997, <em>Feminist Social Thought: A\nReader</em>, New York: Routledge. doi:10.4324/9780203705841</li>\n<li>–––, 2000, “Intersectional Identity and\nthe Authentic Self? Opposites Attract!”, in <em>Relational\nAutonomy: Feminist Perspectives on Automony, Agency, and the Social\nSelf</em>, Catriona Mackenzie and Natalie Stoljar (eds.), New York:\nOxford University Press, 151–180.</li>\n<li>Midgley, Mary, 1983, <em>Animals and Why They Matter: A Journey\nAround the Species Barrier</em>, Athens, GA: University of Georgia\nPress.</li>\n<li>Miller, Elaine P., 2014, <em>Head Cases: Julia Kristeva on\nPhilosophy and Art in Depressed Times</em>, New York: Columbia\nUniversity Press. </li>\n<li>Moraga, Cherríe, and Gloría Anzaldúa, 1981,\n<em>This Bridge Called My Back: Writings by Radical Women of\nColor</em>, Albany: State University of New York Press. </li>\n<li>Nedelsky, Jennifer, 1989, “Reconceiving Autonomy: Sources,\nThoughts and Possibilities”, <em>Yale Journal of Law &amp;\nFeminism</em>, 1(1): 7–36.</li>\n<li>Nzegwu, Nkiru Uwechia, 2006, <em>Family Matters: Feminist Concepts\nin African Philosophy of Culture</em>, Albany, NY: State University of\nNew York Press. </li>\n<li>Oksala, Johanna, 2016, <em>Feminist Experiences: Foucauldian and\nPhenomenological Investigations</em>, Evanston, IL: Northwestern\nUniversity Press.</li>\n<li>Oliver, Kelly, 1993, <em>Reading Kristeva: Unraveling the Double\nBind</em>, Bloomington, IN: Indiana University Press. </li>\n<li>–––, 1998, <em>Subjectivity Without Subjects:\nFrom Abject Fathers to Desiring Mothers</em>, Lanham, MD: Rowman &amp;\nLittlefield. </li>\n<li>Ortega, Mariana, 2016, <em>In-Between: Latina Feminist\nPhenomenology, Multiplicity, and the Self</em>, Albany, NY: State\nUniversity of New York Press. </li>\n<li>Piper, Adrian M.S., 1990, “Higher-Order\nDiscrimination”, In<em>Identity, Character and Morality: Essays\nin Moral Psychology</em>, Owen Flanagan and Amélie Okensberg\nRorty (eds), Cambridge, MA: MIT Pressm, 285–309. </li>\n<li>Rawlinson, Mary, 2016, <em>Just Life: Bioethics and the Future of\nSexual Difference</em>, New York: Columbia University Press. </li>\n<li>Rodemeyer, Lanei, 1998, “Dasein Gets Pregnant”:,\n<em>Philosophy Today</em>, 42(supplement): 76–84.\ndoi:10.5840/philtoday199842Supplement65</li>\n<li>Rubin, Henry, 2003, <em>Self-Made Men: Identity and Embodiment\nAmong Transsexual Men</em>, Nashville, TN: Vanderbilt University\nPress.</li>\n<li>Ruddick, Sara, 1989, <em>Maternal Thinking</em>, Boston, MA:\nBeacon Press. </li>\n<li>Ruíz, Elena Flores, 2016, “Linguistic Alterity and\nthe Multiplicitous Self: Critical Phenomenologies in Latina Feminist\nThought”, <em>Hypatia</em>, 31(2): 421–436.\ndoi:10.1111/hypa.12239</li>\n<li>Salamon, Gayle, 2010, <em>Assuming a Body: Transgender and\nRhetorics of Materiality</em>, New York: Columbia University\nPress.</li>\n<li>Scheman, Naomi, 1993, <em>Engenderings: Constructions of\nKnowledge, Authority, and Privilege</em>, New York: Routledge. </li>\n<li>Scuro, Jennifer, 2017, <em>The Pregnancy ≠ Childbearing\nProject: A Phenomenology of Miscarriage</em>, Lanham, MD: Rowman and\nLittlefield</li>\n<li>Shotwell, Alexis and Trevor Sangrey, 2009, “Resisting\nDefinition: Gendering through Interaction and Relational\nSelfhood”, <em>Hypatia</em>, 24(3): 56–76.\ndoi:10.1111/j.1527-2001.2009.01045.x</li>\n<li>Sparks, Holloway, 2015, “Mamma Grizzlies and Moral Guardians of the Republic: The Democratic and Intersectional Politics of Anger in the Tea Party Movement”, <em>New Political Science</em>, 37(1): 25–47.</li>\n<li>Stein, Edith, 1996, <em>Essays on Woman: The Collected Works of\nEdith Stein</em>, Freda Mary Oben (trans.), Washington, DC: ICS\nPublications.</li>\n<li>Sullivan, Shannon, 2001, <em>Living Across and Through Skins:\nTransactional Bodies, Pragmatism, and Feminism</em>, Bloomington, IN:\nIndian University Press. </li>\n<li>–––, 2015, <em>The Physiology of Sexist and\nRacist Oppression</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190250607.001.0001</li>\n<li>Valian, Virginia, 1998, <em>Why So Slow? The Advancement of\nWomen</em>, Cambridge, MA: MIT Press. </li>\n<li>Walther, Gerda, 1923, “Zur Ontologie der sozialen\nGemeinschaften (mit einem Anhang zur Phänomenologie der sozialen\nGemeinschaften)”, <em>Jahrbuch für Philosophie und\nPhänomenologische Forschung</em>, 6: 1–158.\n [<a href=\"https://www.digizeitschriften.de/dms/img/?PID=PPN827944462_0006%7CLOG_0007\" target=\"other\">Walther 1923 available online</a>]</li>\n<li>Weir, Allison, 1995, “Toward a Model of Self-Identity:\nHabermas and Kristeva”, In <em>Feminists Read Habermas:\nGendering the Subject of Discourse</em>, Johanna Meehan (ed.), New\nYork: Routledge, 263–282. </li>\n<li>Weiss, Gail, 1999, <em>Body Images: Embodiment as\nIntercorporeality</em>, New York: Routledge.</li>\n<li>–––, 2008, <em>Refiguring the Ordinary</em>,\nBloomington, IN: Indiana University Press.</li>\n<li>Welsh, Talia, 2013, <em>The Child as Natural Phenomenologist: Primal and Primary Experience in Merleau-Ponty's Psychology </em>, Evanston, IL: Northwestern University Press.</li>\n<li>Willett, Cynthia, 1995, <em>Maternal Ethics and Other Slave\nMoralities</em>, New York: Routledge. </li>\n<li>–––, 2001 <em>The Soul of Justice: Social Bonds and Racial Justice</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 2008, <em>Irony in the Age of Empire: Comic Perspectives on Freedom and Democracy</em>, Indianapolis: Indiana University Press. </li>\n<li>–––, 2014, <em>Interspecies Ethics</em>, New\nYork: Columbia University Press. </li>\n<li>Willett, Cynthia and Julie Willett, 2019, <em>Uproarious: How\nFeminists and Other Comic Subversives Speak Truth</em>, Minneapolis,\nMN: University of Minnesota Press.</li>\n<li>Williams, Patricia J., 1991, <em>The Alchemy of Race and\nRights</em>, Cambridge, MA: Harvard University Press. </li>\n<li>Wollstonecraft, Mary, 1792 [1982], <em>A Vindication of the Rights\nof Woman</em>, London. Reprinted, Miriam Brody Dramnick (ed.), New\nYork: Penguin, 1982. </li>\n<li>Young, Iris Marion, 1990, <em>Throwing Like a Girl and Other\nEssays In Feminist Philosophy and Social Theory</em>, Bloomington, IN:\nIndiana University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "feminist philosophy, topics: perspectives on class and work",
            "feminist philosophy, topics: perspectives on reproduction and the family"
        ],
        "entry_link": [
            {
                "../feminism-class/": "feminist philosophy, topics: perspectives on class and work"
            },
            {
                "../feminism-family/": "feminist philosophy, topics: perspectives on reproduction and the family"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-self\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/feminism-self/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=feminism-self&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/feminism-self/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=feminism-self": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/feminism-self/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=feminism-self&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/feminism-self/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}