{
    "url": "free-rider",
    "title": "The Free Rider Problem",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Russell Hardin\n\nGarrett Cullity\n<garrett.cullity@anu.edu.au>",
        "author_links": [
            {
                "http://politics.as.nyu.edu/object/RussellHardin.html": "Russell Hardin"
            },
            {
                "mailto:garrett%2ecullity%40anu%2eedu%2eau": "garrett.cullity@anu.edu.au"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://politics.as.nyu.edu/object/RussellHardin.html\" target=\"other\">Russell Hardin</a>\n<br/>\nGarrett Cullity\n&lt;<a href=\"mailto:garrett%2ecullity%40anu%2eedu%2eau\"><em>garrett<abbr title=\" dot \">.</abbr>cullity<abbr title=\" at \">@</abbr>anu<abbr title=\" dot \">.</abbr>edu<abbr title=\" dot \">.</abbr>au</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed May 21, 2003",
        "substantive revision Tue Oct 13, 2020"
    ],
    "preamble": "\n\n\nIn many contexts, all of the individual members of a group can\nbenefit from the efforts of each member and all can benefit\nsubstantially from collective action. For example, if each of us\npollutes less by paying a bit extra for our cars, we all benefit from\nthe reduction of harmful gases in the air we breathe and even in the\nreduced harm to the ozone layer that protects us against exposure to\ncarcinogenic ultraviolet radiation (although those with fair skin\nbenefit far more from the latter than do those with dark skin). If all\nof us or some subgroup of us prefer the state of affairs in which we\neach pay this bit over the state of affairs in which we do not, then\nthe provision of cleaner air is a collective good for us. (If it costs\nmore than it is worth to us, then its provision is not a collective\ngood for us.)\n\n\nUnfortunately, my polluting less does not matter enough for anyone—especially me—to notice. Therefore, I may not contribute my share toward not fouling the atmosphere. I may be a free\nrider (or free rider) on the beneficial actions of\nothers. A free rider, most broadly speaking, is someone who receives a benefit without contributing towards the cost of its production. The free rider problem is that the efficient production of important collective goods by free agents is jeopardized by the incentive each agent has not to pay for it: if the supply of the good is inadequate, one’s own action of paying will not make it adequate; if the supply is adequate, one can receive it without paying. This is a compelling application of the logic of collective action, an application of such grave import that we pass laws to regulate the behavior of individuals to force them\nto pollute less.\n\n\nThe free rider problem gives rise to large explanatory and normative questions in six main disciplines. Social psychology asks: To what extent and in what circumstances are people motivated to free ride? and What sorts of negative incentives are effective in motivating cooperation when free riding is possible? Game theory asks: Under what strategic circumstances does the rational promotion of individual self-interest recommend free riding? Informed by those two areas of enquiry, mainstream economics then asks: What real-world mechanisms are the most efficient ways of producing public goods, given the incentives to free ride? Political science asks: What explains the existence of large-scale political participation, despite the incentives that favor free riding? Moral philosophy asks: Under exactly which circumstances is free riding morally wrong? and What explains why it is wrong (when it is)? And relatedly, normative political philosophy asks: Do the moral reasons against free riding supply a satisfactory grounding for political obligation?\n",
    "toc": [
        {
            "#LogColAct": "1. The Logic of Collective Action"
        },
        {
            "#His": "1.1 History"
        },
        {
            "#PubGoo": "2. Public Goods"
        },
        {
            "#SelIntThe": "3. Self-Interest Theory"
        },
        {
            "#ExpColAct": "4. Explaining Collective Action"
        },
        {
            "#Dem": "5. Democracy"
        },
        {
            "#FreRidMor": "6. Free Riding and Morality"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Logic of Collective Action\n\n\nThe strategic structure of the logic of collective action is that of\nthe n-prisoner’s dilemma (Hardin 1971, 1982a). If n\nis 2 and the two members are able to coordinate on whether they act\ntogether, there can be no free rider unless one of the members is de\nfacto altruistic. As represented in Game 1, prisoner’s dilemma for two\nplayers is essentially the model of exchange (Hardin 1982b). Suppose\nthat, in the status quo, I have a car and you have $5000 but that both\nof us would prefer to have what the other has. Of course, each of us\nwould rather have the holdings of both of us: both the money and the\ncar. The second best outcome for both of us would be for you to have my\ncar in exchange for my having your money. The status quo is a worse\nstate of affairs for both of us than that in which we succeed in\nexchanging. In the matrix, the outcomes are ordinally ranked from best\n(1) to worst (4) for each player. For example, the outcome (upper right\ncell) in which you yield the money and I keep the car is worst (4) for\nyou as the Row player and best (1) for me as the Column player.\n\n\n\n\nColumn\n\n\nYield car\nKeep car\n\n\nRow\nYield $5000\n2, 2\n4, 1\n\n\nKeep $5000\n1, 4\n3, 3\n\n\nGame 1: Prisoner’s Dilemma or Exchange\n\n\n\nAs an n-prisoner’s dilemma for n ≫ 2,\ncollective action is therefore essentially large-number exchange. Each\nof us exchanges a bit of effort or resources in return for benefiting\nfrom some collective provision. The signal difference is that I can\ncheat in the large-number exchange by free riding on the contributions\nof others, whereas such cheating in the two-person case would commonly\nbe illegal, because it would require my taking from you without giving\nyou something you prefer in return.\n\n\nIn some collective provisions, each contribution makes the overall\nprovision larger; in some, there is a tipping point at which one or a\nfew more contributions secure the provision—as is true, for example,\nin elections, in which a difference of two more votes out of a very\nlarge number can change defeat into victory. Even in the latter case,\nhowever, the expected value of each voter’s contribution is the same ex\nante; there is no particular voter whose vote tips the outcome. Let us,\nhowever, neglect the tipping cases and consider only those cases in\nwhich provision is, if not an exactly linear function of the number of\nindividual contributions or of the amount of resources contributed, at\nleast a generally increasing function and not a tipping or step\nfunction at any point. In such cases, if n is very large and you do not\ncontribute to our collective effort, the rest of us might still benefit\nfrom providing our collective good, so that you benefit without\ncontributing. You are then a free rider on the efforts of the rest of\nus.\n\n\nUnfortunately, each and every one of us might have a positive\nincentive to try to free ride on the efforts of others. My\ncontribution—say, an hour’s work or a hundred\ndollars—might add substantially to the overall provision. But my\npersonal share of the increase from my own contribution alone might be\nvanishingly small. In any case of interest, it is true that my benefit\nfrom having all of us, including myself, contribute is far greater\nthan the status quo benefit of having no one contribute. Still, my\nbenefit from my own contribution may be negligible. Therefore I and\npossibly every one of us have incentive not to contribute and to free\nride on the contributions of others. If we all attempt to free ride,\nhowever, there is no provision and no ‘ride.’\n\n\nThe scope for free riding can be enormous. Suppose our large group\nwould benefit from providing ourselves some good at cost to each of us.\nIt is likely to be true that some subgroup, perhaps much smaller than\nthe whole group, would already benefit if even only its own members\ncontribute toward the larger group’s good. Suppose this is true for k\n≪ n. This k-subgroup now faces its own collective action\nproblem, one that is perhaps complicated by the sense that the large\nnumber of free riders are getting away with something unfairly. If one\nperson in an exchange tried to free ride, the other person would most\nlikely refuse to go along and the attempted free ride would fail. But if\nn − k members of our group attempt to free ride,\nthe rest of us cannot punish the free riders by refusing to go along\nwithout harming our own interests.\n1.1 History\n\n\nThe free rider problem and the logic of collective action have been\nrecognized in specific contexts for millennia. Arguably, Glaucon in\nPlato’s Republic (bk. 2, 360b–c) sees the logic in his\nargument against obedience to the law if only one can escape sanction\nfor violations. First-time readers of Plato are often astonished that\ndear old Socrates seems not to get the logic but insists that it is our\ninterest to obey the law independently of the incentive of its\nsanctions.\n\n\nAdam Smith’s argument for the invisible hand that keeps sellers\ncompetitive rather than in collusion is a fundamentally important and\nbenign—indeed, beneficial—instance of the logic of collective\naction. He says that each producer “intends only his own gain,\nand he is in this, as in many other cases, led by an invisible hand to\npromote an end which was no part of his intention. Nor is it always the\nworse for the society that it was no part of [the individual’s intended\nend]. By pursuing his own interest he frequently promotes that of\nsociety more effectually than when he really intends to promote\nit” (Smith [1776] 1976, bk. 4, chap. 2, p. 456). The back of the\ninvisible hand swats down efforts at price collusion, thereby pushing\nproducers to be innovative.\n\n\nDavid Hume grasps the generality of the problem clearly. He\nsays:\nTwo neighbours may agree to drain a meadow, which they\npossess in common; because ‘tis easy for them to know each other’s\nmind; and each must perceive, that the immediate consequence of his\nfailing in his part, is, the abandoning the whole project. But ‘tis\nvery difficult, and indeed impossible, that a thousand persons shou’d\nagree in any such action; it being difficult for them to concert so\ncomplicated a design, and still more difficult for them to execute it;\nwhile each seeks a pretext to free himself of the trouble and expence,\nand wou’d lay the whole burden on others. (Hume [1739–40] 1978, bk. 3,\npart 2, sect. 8, p. 538).\n\n\nJohn Stuart Mill ([1848] 1965, book 5, chap. 11, sect. 12) expresses\nthe logic very clearly in his defense of laws to require maximum hours\nof work. He supposes that all workers would be better off if the\nworkday were reduced from, say ten to nine hours a day for all, but\nthat every individual worker would be better off working the extra hour\nif most others do not. The only way for them to benefit from the\nshorter workday, therefore, would be to make it illegal to work longer\nthan nine hours a day.\n\n\nVilfredo Pareto stated the logic fully and for the general case:\nIf all individuals refrained from doing A, every\nindividual as a member of the community would derive a certain\nadvantage. But now if all individuals less one continue\nrefraining from doing A, the community loss is very slight, whereas the\none individual doing A makes a personal gain far greater than the loss\nthat he incurs as a member of the community. (Pareto 1935, vol. 3,\nsect. 1496, pp. 946–7)\n\n\nPareto’s argument is framed for the negative case, such as the\nexample of pollution above, but it fits positive provisions as well.\nUnfortunately, his argument is buried in a large four-volume magnum\nopus that is a rambling discussion of many and varied topics, and it\nseems to have had little or no influence on further discussion.\n\n\nFinally, the logic of collective action has long been generalized in\na loose way in the notion of the free rider problem. And it is captured\nin the popular slogan, “Let George do it,” in which George\ntypically stands in for the rest of the world.\n\n\nDespite such frequent and widespread recognition of the logic, it\nwas finally generalized analytically by Mancur Olson only in 1965 in\nhis Logic of Collective Action. The odd mismatch of individual\nincentives and what may loosely be called collective interests is the\nindependent discovery of two game theorists who invented the prisoner’s\ndilemma for two persons (see Hardin 1982a, 24–5) and of various\nphilosophers and social theorists who have noted the logic of\ncollective action in various contexts. In Olson’s account, what had\nbeen a fairly minor issue for economists became a central issue for\npolitical scientists and social theorists more generally. From early in\nthe twentieth century, a common view of collective action in pluralist\ngroup politics was that policy on any issue must be, roughly, a vector\nsum of the forces of all of the groups interested in the issue (Bentley\n1908). In this standard vision, one could simply count the number of\nthose interested in an issue, weight them by their intensity and the\ndirection they want policy to take, and sum the result geometrically to\nsay what the policy must be. Olson’s analysis abruptly ended this long\ntradition; and group theory in politics took on, as the central task,\ntrying to understand why some groups organize and others do not.\n\n\nAmong the major casualties of Olson’s revision of our views of groups\nis Karl Marx’s analysis of class conflict. Although many scholars\nstill elaborate and defend Marx’s vision, others now reject it as\nfailing to recognize the contrary incentives that members of the\nworking class face. (Oddly, Marx himself arguably saw the\ncross-cutting—individual vs. group—incentives of\ncapitalists, the other major group in his account.) This problem had\nlong been recognized in the thesis of the embourgeoisement of the\nworking class: Once workers prosper enough to buy homes and to benefit\nin other ways from the current level of economic development, they may\nhave so much to lose from revolutionary class action that they cease\nto be potential revolutionaries.\n\n\nIn essence, the theories that Olson’s argument demolished were all\ngrounded in a fallacy of composition. We commit this fallacy whenever\nwe suppose the characteristics of a group or set are the\ncharacteristics of the members of the group or set or vice versa. In\nthe theories that fail Olson’s test the fact that it would be in the\ncollective interest of some group to have a particular result, even\ncounting the costs of providing the result, is turned into the\nassumption that it would be in the interest of each individual in the\ngroup to bear the individual costs of contributing to the group’s\ncollective provision. If the group has an interest in contributing to\nprovision of its good, then individual members are (sometimes wrongly)\nassumed to have an interest in contributing. Sometimes, this assumption\nis merely shorthand for the recognition that all the members of a group\nare of the same mind on some issue. For example, a group of anti-war\nmarchers are of one mind with respect to the issue that gets them\nmarching. There might be many who are along for the entertainment, to\njoin a friend or spouse, or even to spy on the marchers, but the modal\nmotivation of the individuals in the group might well be the motivation\nsummarily attributed to the group. But very often the move from\nindividual to group intentions or vice versa is wrong.\n\n\nThis fallacious move between individual and group motivations and\ninterests pervades and vitiates much of social theory since at least\nAristotle’s opening sentence in the Politics. He says,\nWe see that every city-state is a community of some sort,\nand that every community is established for the sake of some good (for\neveryone performs every action for the sake of what he takes to be\ngood). (Aristotle Politics, book 1, chap. 1, p.\n1)\n\n\nEven if we grant his parenthetical characterization of individual\nreasons for action, it does not follow that the collective creation of\na city-state is grounded in the same motivations, or in any collective\nmotivation at all. Most likely, any actual city-state is the product in\nlarge part of unintended consequences.\n\n\nArgument from the fallacy of composition seems to be very appealing\neven though completely wrong. Systematically rejecting the fallacy of\ncomposition in social theory, perhaps especially in normative theory,\nhas required several centuries, and invocation of the fallacy is still\npervasive.\n2. Public Goods\n\n\nOlson based his analysis on Paul Samuelson’s theory of public goods.\nSamuelson (1954) noted that some goods, once they are made available to\none person, can be consumed by others at no additional marginal cost;\nthis condition is commonly called jointness of supply or nonrivalness\nof consumption, because your consumption of the good does not affect\nmine, as your eating a lovely dinner would block my eating it.\nTherefore, in standard price theory, in which price tends to equate to\nmarginal cost, such goods should have a zero price. But if they are\npriced at zero, they will generally not be provided. In essence, price\ntheory commends free riding on the provision of such goods. This might\nsound like merely a cute logical problem; but standard examples include\nradio broadcasts, national defense, and clean air. If any of these is\nprovided for anyone, they are de facto provided for everyone in the\nrelevant area or group.\n\n\nThere is a second feature of Samuelson’s public goods that would\nmake them problematic in practice: the impossibility of exclusion. Once\nsupplied at all, it is supposedly impossible to exclude anyone from the\nconsumption of a public good. It is often noted that this feature is\nanalytically interesting but empirically often beside the point. States\noften forcibly exclude people from enjoying such public goods as radio\nbroadcasts. Others can be provided through the use of various devices\nthat enable providers to charge the beneficiaries and to exclude those\nwho do not pay, as for example, by advertising that imposes a cost on\ntelevision viewers or the use of cable rather than broadcasting over\nthe air to provide television programming at a substantial price.\nExclusion is merely a problem of technology, not of logic. With present\ntechnology, however, it may be too expensive to exclude many people and\nwe may therefore want the state to provide many goods so that we can\navoid the costs of exclusion.\n\n\nThere are some compelling cases of goods that are both joint in\nsupply and nonexcludable. National defense that protects cities against\nattack from abroad, for example, is for all practical purposes a good\nwith both these features. But the full logic of public goods is of\nlittle practical interest for many important contexts. Indeed, what are\noften practically and politically interesting are goods that are in\nfact provided collectively, independently of whether they have either\nof the defining features of public goods. We can even provide purely\nprivate consumptions through collective choice. For example, most\nwelfare programs transfer ordinary private consumption goods or\nresources for obtaining these. Although technically these are not\npublic goods in Samuelson’s sense, we can refer to them as collective\ngoods and we can treat provision of them as essentially problems of\ncollective action.\n\n\nOlson notes that very many politically provided goods, such as\nhighways and public safety, roughly have the qualities of Samuelson’s\npublic goods and therefore face the problem of free riding that\nundercuts supply of the goods. Note that the supply of such goods by\nthe state overcomes the free rider problem because voters can vote on\nwhether everyone is required to pay toward the provision, as in the\ncase of national defense. If I am voting whether the good is to be\nprovided, I cannot free ride and I need not worry that anyone else can\neither. We can all vote our overall preferences between supply at the\nrelevant individual cost versus no supply and no cost of provision, so\nthat democratic choice turns our problem into a simple\ncoordination—if we are all in agreement that a relevant good\nshould be collectively provided.\n\n\nFrom the analysis of the de facto logic of collective action that\nwould block the spontaneous provision of many fundamentally important\nclasses of collective goods we can go on to argue for what is now often\ncalled the public-goods theory of the state (Baumol 1952, 90–93; more\ngenerally see Hardin 1997). The public-goods account gives us a clear\nnormative justification of the state in welfarist terms: The state\nresolves many centrally important and potentially pervasive free rider\nproblems. It does not give us an explanatory account of the origins of\nthe state, although it could arguably contribute to the explanation of\nthe maintenance of a state once it exists. It might do so through\nsupport for the state’s collective provisions and, therefore, support\nfor the state. Unfortunately, as libertarians are quick to note, giving\nthe state power to resolve certain free rider problems also gives it the\npower to do many other things that could not be justified with similar\nnormative arguments.\n3. Self-Interest Theory\n\n\nThe modern view of the fallacy of composition in social choice is a\nproduct of the understanding of politics as self-interested. That\nunderstanding begins partially with Niccolò Machiavelli, who\nadvised the prince to act from his own self-interest. A century later,\nHobbes did not bother to advise acting from self-interest because he\nsupposed virtually everyone naturally does so. From that assumption, he\nwent on to give us the first modern political theory of the state, an\nexplanatory political theory that is not merely a handbook for the\nprince and that is not grounded in normative assumptions of religious\ncommitment. To some extent, therefore, one could credit Hobbes with the\ninvention of social science and of explanatory, as opposed to\nhortatory, political theory.\n\n\nHobbes’s argument for the state is an argument from mutual\nadvantage. We all benefit if there is a powerful state in place to\nregulate behavior, thereby enabling us to invest efforts in producing\nthings to make our lives better and to enable us to exchange with each\nother without fear that others will wreck our efforts. Some scholars\nsee this resolution as a matter of mutual cooperation in a grand\nprisoner’s dilemma. This is strategically or game theoretically wrong\nbecause putting a state in place is a matter of coordination on one or\nanother sovereign, not a matter of exchange among us or between us and\nthe sovereign. Once that state is in place, it might be true that I\nwould rather free ride on the better behavior of my fellow citizens, who\nare generally law-abiding. But I generally cannot succeed in doing so,\nbecause there is police power to coerce me if necessary.\n\n\nWhat I cannot free ride on is the creation of a state. I want the\nstate, just as everyone who sees it as mutually advantageous wants it.\nSuppose that somehow, perhaps using the ring of Gyges to make me\ninvisible as Glaucon proposed, I could get away with theft or other\ncrimes. Even then, I would still want the state to have the power to\ncoerce people into order because if they are not orderly, they will\nproduce nothing for me to steal. If it is true, as Hobbes supposes,\nthat having a state is mutually advantageous, it follows that we all\nwant it; and none of us can free ride on whether there is a\nstate. Either there is one or there is not, and if there is one, then I\nam potentially subject to its powers of legal coercion. On balance, I\nwould want there to be an effective state for the protections it gives\nme against others despite its potential for coercing me into good\nbehavior.\n\n\nWhen we vote on a policy, as discussed above, we de facto change our\nproblem from a collective-action prisoner’s dilemma into a simple\ncoordination problem by ruling out individual idiosyncrasies in our\nchoices. We have only collective choice: provision for all or provision\nfor none. Although the state is itself not the resolution of a giant\nprisoner’s dilemma or collective action, as is sometimes supposed, it\ncan be used to resolve prisoner’s dilemma interactions. Suppose you and\nI both want cleaner air but that each of us would free ride on the\nefforts of others to clean the air. State policy can block free riding,\nif necessary at metaphorical gunpoint. We both prefer the general\neffort to provide cleaner air and we both pay our share toward the cost\nof providing it.\n4. Explaining Collective Action\n\n\nThe facts that there is a lot of collective action even in many\nlarge-number contexts in which the individuals do not have rich\nrelationships with each other and that, therefore, many people are not\nfree riding in relevant contexts suggest at least three possibilities.\nFirst, there are ways to affect the incentives of group members to make\nit their interest to contribute. Second, motivations other than\nself-interest may be in play. Third, the actors in the seemingly\nsuccessful collective actions fail to understand their own interests.\nEach of these possibilities is important and interesting, and the\nlatter two are philosophically interesting. Each is also supported by\nextensive empirical evidence.\n\n\nIn the first category are the by-product theory proposed by\nOlson and the possibility that political entrepreneurs, at\nleast partially acting in their own interest, can engineer provisions.\nIn the by-product theory, I might contribute to my group’s effort\nbecause the group ties my contribution to provision of some private\ngood that I want, such as participation in the Sierra Club’s outdoor\nactivities or, in the early days of unions, low-cost group-insurance\nbenefits not available in the market. Such private goods can commonly\nbe provided in the market, so that their usefulness may eventually be\nundercut. Indeed, firms that provide insurance benefits to their\nemployees thereby undercut one of the appeals of union membership. The\ngeneral decline of American unions in recent decades is partially the\nresult of their success in resolving problems for workers in ways that\ndo not require continuing union effort.\n\n\nWhen collective goods can be supplied by government or some other\nagency, political entrepreneurs might organize the provision. For\nexample, Senator Howard Metzenbaum worked to get legislation on behalf\nof the poor and of unions, although he was certainly not poor and was\nnot himself a working member of a union. Yet he benefited from his\nefforts in support of these groups if they voted to keep him in office.\nBecause there is government, collective action of many kinds is far\nmore likely than we might expect from the dismal logic of collective\naction.\n\n\nTurn now to the assumption of self-interest. In generalizing from\nthe motive of self-interest to the explanation and even justification\nof actions and institutions, Hobbes wished to reduce political theory\nto an analog of geometry or physics, so that it would be a deductive\nscience. All of the statements of the logic of collective action above\nare grounded in an assumption of the self-interested incentives of the\nactors. When the number of members of a group that would benefit from\ncollective action is small enough, we might expect cooperation that\nresults from extensive interaction, mutual monitoring, and even\ncommitments to each other that trump or block narrowly self-interested\nactions. But when the group is very large, free riding is often clearly\nin the interest of most and perhaps all members.\n\n\nAgainst the assumption of purely self-interested behavior, we know\nthat there are many active, more or less well funded groups that seek\ncollective results that serve interests other than those of their own\nmembers. For a trivial example, none of the hundreds of people who\nhave been members of the American League to Abolish Capital Punishment\nis likely to have had a personal stake in whether there is a death\npenalty (Schattschneider 1960, 26). In our time, thousands of people\nare evidently willing to die for their causes (and not simply to risk\ndying—we already do that when we merely drive to a restaurant\nfor dinner).  Perhaps some of these people act from a belief that they\nwill receive an eternal reward for their actions, so that their\nactions are consistent with their interests.\n\n\nFinally turn to the possible role of misunderstanding in leading\npeople to act for collective provisions. Despite the fact that people\nregularly grasp the incentive to free ride on the efforts of others in\nmany contexts, it is also true that the logic of collective action is\nhard to grasp in the abstract. The cursory history above suggests just\nhow hard it was to come to a general understanding of the problem.\nToday, there are thousands of social scientists and philosophers who do\nunderstand it and maybe far more who still do not. But in the general\npopulation, few people grasp it. Those who teach these issues regularly\ndiscover that some students insist that the logic is wrong, that it is,\nfor example, in the interest of workers to pay dues voluntarily to\nunions or that it is in one’s interest to vote. If the latter is true,\nthen about half of voting-age Americans evidently act against their own\ninterests every quadrennial election year. It would be extremely\ndifficult to assess how large is the role of misunderstanding in the\nreasons for action in general because those who do not understand the\nissues cannot usefully be asked whether they do understand. But the\nevidence of misunderstanding and ignorance is extensive (Hardin\n2002).\n5. Democracy\n\n\nThe logic of collective action has become one of the richest areas\nof research and theory in rational choice theory in the social sciences\nand philosophy. Much of that literature focuses on the explanation of\nvaried social actions and outcomes, including spontaneous actions,\nsocial norms, and large institutions. One of its main areas is efforts\nto explain behavior in elections. In general, voting seems clearly to\nbe a case of collective action for the mutual benefit of all those who\nsupport a particular candidate or whose interests would be furthered by\nthat candidate’s election. If voting entails costs to individuals\nwhereas the benefit from voting is essentially a collective benefit\nonly very weakly dependent on any individual’s vote, individuals may\nfind it in their interest not to vote (Downs 1957). When the number of\nvoters on one side of an election is in the tens of millions, no\nindividual’s vote is likely to matter at all. Even though it is not\nnarrowly in their own individual interest to do so if there are any\ncosts to be borne in going to the polls to vote and in learning enough\nabout various candidates to know which ones would further a voter’s\ninterests, millions of people vote. This is one of the most notorious\nfailures of the rational choice literature. A standard response to the\nphenomenon of massive voting is to note how cheap the action is and how\nmuch public effort is expended in exhorting citizens to vote. But it\nseems likely that much of the voting we see is normatively\nmotivated.\n\n\nBoth the voting that does happen and the non-voting or free riding\nthat accompanies it as well as the level of ignorance of voters call\nsimple normative theories or views of democracy into question.\n“The will of the people” is a notoriously hallowed phrase\nthat is vitiated by logical fallacy and that is generally meaningless\nas a supposed characterization of democracy, in which decisions are\nmajoritarian and not unanimous (Kant [1796] 1970, 101; Maitland [1875]\n2000, 101–112). It might on rare occasion be true that the people are\nin virtually unanimous agreement on some important policy so that they\nshare the same will on that issue. But generally, there is a diversity\nof views and even deep conflict over significant policies in modern\npluralist democracies. In large societies, democracy is invariably\nrepresentative democracy except on issues that are put to direct\npopular vote in referendums. Even this term,\n“representative,” is gutted by logical fallacy. My\nrepresentative on some governmental body is apt to work on behalf of my\ninterests some of the time and against them some of the time. Even\nthose for whom I vote often work against my interests; and if they\nshould be said to represent me, they often do a very bad job of it.\n\n\nNote that, as mentioned earlier, the election of a candidate is a good\nwhose provision is a step function of the number of votes. If there\nare n votes cast, then half of n − 1 votes spells defeat\nand half of n + 1 spells victory. If, as Mayor Daley did with\nthe Chicago votes in the US presidential election of 1960, I could\nwithhold my vote until all others have been counted, my vote might\nactually tip the result to victory for my candidate. In actual fact,\nthe typical voter casts a vote in a state of ignorance about the final\ncount. I might readily expect the margin to be very large or I might\nexpect it to be very narrow. But I am unlikely to expect it to be\ntied, so that my own vote would be decisive. Hence, although the\nactual provision is a step function, my vote or my free riding must be\nbased on some sense of the expected effect of my vote, and that must\ngenerally be minuscule for any election in a large electorate. With\nextremely high probability, my vote is likely to have no effect.\n6. Free Riding and Morality\n\n\nThe fact that people do organize for collective purposes is often\ntaken to imply the normative goodness of what they seek. If the\nby-product theory is correct, however, this conclusion is called into\nquestion. For example, we might join a union merely to obtain insurance\nat the inexpensive group rate even though we vote against all its\nstrike proposals, would never join a picket line, and might even be\nhostile to the idea of unions. Or we might go to a political\ndemonstration for varied reasons other than agreement with the\nostensible object of the demonstration; for example pro-war proponents\nmight join in a peace march on a glorious day to hear performances by\noutstanding singers in a large public park—something they might\nhappily have paid to do.\n\n\nIt is also widely held that there are circumstances in which free riding on the provision of a collective good is morally wrong, because unfair. The two most prominent attempts to describe the conditions under which this kind of wrongness occurs are H.L.A. Hart’s principle of “mutuality of restrictions”:\nwhen a number of persons conduct any joint enterprise according to rules and thus restrict their liberty, those who have submitted to these restrictions when required have a right to a similar submission from those who have benefited by their submission. (Hart 1955, 185)\n\n\nand John Rawls’s “principle of fairness”:\na person is required to do his part as defined by the rules of an institution when two conditions are met: first, the institution is just (or fair), that is, it satisfies the two principles of justice; and second, one has voluntarily accepted the benefits of the arrangement or taken advantage of the opportunities it offers to further one’s interests. (Rawls [1971] 1999, 96)\n\n\nHart (1955, 185) calls his formulation a “bare schematic outline” of the obligation one owes to other cooperators; and subsequent discussion has focused on examining what is required in order to make this outline fully accurate. As it stands, Hart’s principle invites the kinds of objections emphasized by Robert Nozick (1974, 90–95):  I am not morally required to pay for books that are thrown into my house with bills attached, or to take a day off work to entertain the neighbourhood over a public address system after my neighbours have taken it in turns to do so. Rawls’s formulation, which restricts the obligation to cases in which a benefit has been voluntarily accepted, avoids these objections. However, some writers argue that this is too tight a restriction (Arneson 1982; Cullity 1995; Trifan 2000): they maintain that when others are cooperating to produce a good that is compulsory, in the sense that once it is produced one cannot avoid receiving it (without excessive cost), one can still have an obligation of fairness to share the costs of producing it. If that is true, it keeps open the prospect (embraced by Hart but not Rawls) that political obligations can be grounded in an anti-free riding principle (Klosko 1992, 2005; Wolff 1995). However, the project of grounding political obligations in this way faces several significant obstacles. These include the objections that the operation of the state does not qualify as the kind of cooperative scheme to which a principle of fair contribution properly applies; that some citizens are sufficiently self-reliant that they do not receive a net benefit from the state; that grounding an obligation of fairness to contribute towards the cost of producing a collective good falls short of justifying the use of coercion to compel the contribution; and that an obligation to contribute to the production of a collective good does not apply when the question of which goods a group should be producing is itself contested.\n\n\nOne commonly claimed obligation of political participation is an obligation to vote. Support for this is sometimes attempted by appealing to a loose generalization argument that asks, “What if everybody failed to vote?” or, in the language here, “What if\neverybody chose to free ride on the voting of others?” The\npractical answer to that question, of course, is that everybody does\nnot choose to free ride, only some do, and that it is exceedingly\nunlikely that everyone will choose to do so. But if I think almost no\none else will vote, I should probably conclude that it is therefore\nthen in my interest to vote (that day has yet to come). Perhaps there\nis some number of citizens, k, such that, if fewer than k citizens\nvote, democracy will fail. If so, half of all citizens seems likely to\nbe a number significantly greater than k. Local elections in the US\noften turn out far less than half the eligible citizens and\npresidential elections turn out a bit more than half. One may question\njust what kind of democracy the US has, but it seems in some\nsignificant ways to work.\n\n\nThe generalization argument here is a variant of the fallacy of\ncomposition and it is logically specious in its presumed implication.\nYet many people assert such an argument in collective action contexts,\nand they may very well be motivated by the apparent moral authority of\nthe argument. An alternative question here would be something like:\n“What if everybody failed to take into account the effect of\ntheir own vote on the election?” The answer is that roughly half\nof Americans may well fail to take into account the effect of their own\nvotes on elections, and they vote. The rest ride free.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Andreoni, James, 1988, ‘Why Free Ride?: Strategies and Learning in Public Goods Experiments’, <em>Journal of Public Economics</em>, 37 (3): 291–304.",
                "Aristotle, 1998, <em>Politics</em>, trans. C.D.C. Reeve, Indianapolis: Hackett.",
                "Arneson, Richard J., 1982, ‘The Principle of Fairness and Free-Rider Problems’, <em>Ethics</em>, 92: 616–33.",
                "Axelrod, Robert, 1984, <em>The Evolution of Cooperation</em>, New York: Basic Books.",
                "Baumol, William J., 1952, <em>Welfare Economics and the Theory of\nthe State</em>, Cambridge, MA: Harvard University Press.",
                "Bentley, Arthur F., 1908, <em>The Process of Government</em>,\nChicago: University of Chicago Press.",
                "Bowles, Samuel, and Herbert Gintis, 2011, <em>A Cooperative Species: Human Reciprocity and Its Evolution</em>, Princeton: Princeton University Press.",
                "Binmore, Ken, 1998, <em>Game Theory and the Social Contract, Volume 2: Just Playing</em>, Cambridge, MA: MIT Press.",
                "Broad, C.D., 1916, ‘On the Function of False Hypotheses in Ethics’, <em>International Journal of Ethics</em>, 26: 377–97.",
                "Buchanan, J.M., 1968, <em>The Demand and Supply of Public Goods</em>, Chicago: Rand McNally.",
                "Cowen, Tyler (ed.), 1992, <em>Public Goods and Market Failures: A Critical Examination</em>, New Brunswick: Transaction Publishers.",
                "Cornes, Richard, and Todd Sandler, 1996, <em>The Theory of Externalities, Public Goods, and Club Goods</em>, New York: Cambridge University Press.",
                "Cullity, Garrett, 1995, ‘Moral Free Riding’, <em>Philosophy and Public Affairs</em>, 24: 3–34.",
                "–––, 2008, ‘Public Goods and Fairness’, <em>Australasian Journal of Philosophy</em>, 86: 1–21.",
                "Dagger, Richard, 2000, ‘Membership, Fair Play, and Political Obligation’, <em>Political Studies</em>, 48: 104–17.",
                "de Jasay, Anthony, 1989, <em>Social Contract, Free Ride: A Study of the Public Goods Problem</em>, Oxford: Clarendon Press.",
                "Egas, Martijn, and Arno Riedl, 2008, ‘The Economics of Altruistic Punishment and the Maintenance of Cooperation’, <em>Proceedings of the Royal Society: B, Biological Sciences</em>, 275 (1637): 871–78.",
                "Ewing, A.C., 1953, ‘What Would Happen if Everyone Acted Like Me?’, <em>Philosophy</em>, 28: 16–29.",
                "Feiock, Richard C., and John Scholz (eds), 2010, <em>Self-Organizing Federalism: Collaborative Mechanisms to Mitigate Institutional Collective Action Dilemmas</em>, Cambridge: Cambridge University Press.",
                "Fischbacher, Urs, and Simon Gäächter, 2010, ‘Social Preferences, Beliefs, and the Dynamics of Free Riding in Public Goods Experiments’, <em>The American Economic Review</em>, 100 (1): 541–56.",
                "Frohlich, Norman, Joe A. Oppenheimer, and Oran R. Young, 1971, <em>Political Leadership and Collective Goods</em>, Princeton: Princeton University Press.",
                "Gauthier, David, 1986, <em>Morals by Agreement</em>, Oxford: Clarendon Press.",
                "Hampton, Jean, 1987, ‘Free-Rider Problems in the Production of Collective Goods’, <em>Economics and Philosophy</em>, 3: 245–73.",
                "Hardin, Russell, 1971, ‘Collective Action As an Agreeable\nn-Prisoners’ Dilemma’, <em>Behavioral Science</em>, 16 (September):\n472–481.",
                "–––, 1982a, <em>Collective Action</em>,\nBaltimore: Johns Hopkins University Press.",
                "–––, 1982b, ‘Exchange Theory on Strategic\nBases’,\n<em>Social Science Information</em> 21 (2): 251–272.",
                "–––, 1997, ‘Economic Theories of the\nState’, Dennis C.  Mueller (ed.), <em>Perspectives on Public\nChoice: A Handbook</em>, New York: Cambridge University Press,\npp. 21–34.",
                "–––, 2002, ‘The Street-Level Epistemology\nof Democratic Participation’, <em>Journal of Political\nPhilosophy</em>, 10 (2): 212–29.",
                "Hart, H.L.A., 1955, ‘Are There any Natural Rights?’, <em>Philosophical Review</em>, 64: 175–91.",
                "Hauser, Oliver P., David G. Rand, Alexander Peysakhovich, and Martin A. Nowak, 2014, ‘Cooperating with the Future’, <em>Nature</em>, 511: 220–23.",
                "Hobbes, Thomas, [1651] 1996, <em>Leviathan, or the Matter, Forme, and Power of a Commonwealth Ecclesiasticall and Civil</em> Cambridge: Cambridge University Press.",
                "Hume, David, [1739–40] 1978, <em>A Treatise of Human Nature</em>,\nL. A. Selby-Bigge and P. H. Nidditch (eds.) Oxford, Oxford University\nPress, 2nd ed.",
                "Kameda, Tatsuya, Takafumi Tsukasaki, Reid Hastie, and Nathan Berg, 2011, ‘Democracy Under Uncertainty: The Wisdom of Crowds and the Free-Rider Problem in Group Decision Making’, <em>Psychological Review</em>, 118 (1): 76–96.",
                "Kant, Immanuel, [1796] 1970, ‘Perpetual Peace: A\nPhilosophical Sketch’, Hans Reiss (ed.), <em>Kant’s Political\nWritings</em>, Cambridge: Cambridge University Press, pp. 93–115.",
                "Klosko, George, 1992, <em>The Principle of Fairness and Political Obligation</em>, Lanham: Rowman &amp; Littlefield.",
                "–––, 2005, <em>Political Obligations</em>, Oxford: Oxford University Press.",
                "Kollock, Peter, 1998, ‘Social Dilemmas: The Anatomy of Cooperation’, <em>Annual Review of Sociology</em>, 24: 183–214.",
                "Kurzban, Robert, Maxwell N. Burton-Chellew, and Stuart A. West, 2015, ‘The Evolution of Altruism in Humans’, <em>Annual Review of Psychology</em>, 66 (1): 575–99.",
                "Marwell, Gerald, and Ruth E. Ames, 1979, ‘Experiments on the Provision of Public Goods, I: Resources, Interest, Group Size, and the Free-rider Problem’, <em>American Journal of Psychology</em>, 84: 1335–1360.",
                "Maitland, Frederic William, [1875] 2000, <em>A Historical Sketch of\nLiberty and Equality</em>, Indianapolis: Liberty Fund.",
                "McDermott, Daniel, 2004, ‘Fair-Play Obligations’, <em>Political Studies</em>, 52: 216–32.",
                "Mill, John Stuart, [1848] 1965, <em>Principles of Political\nEconomy</em>, J. M. Robson (ed.), <em>Collected Works of John Stuart\nMill</em>, Toronto: University of Toronto Press, 7th edition, vols. 2\nand 3.",
                "Miller, David, 2004, ‘Justice, Democracy, and Public Goods’, in Dowding, Keith, Robert E. Goodin, and Carole Pateman (eds), <em>Justice and Democracy: Essays for Brian Barry</em>, Cambridge: Cambridge\nUniversity Press, pp. 127–49.",
                "Miller, Frank, and Rolf Sartorius, 1979, ‘Population Policy and Public Goods’, <em>Philosophy and Public Affairs</em> 8: 148–74.",
                "Nozick, Robert, 1974, <em>Anarchy, the State, and Utopia</em>, New\nYork: Basic Books.",
                "Olson, Mancur, Jr., 1965, <em>The Logic of Collective Action</em>,\nCambridge, MA: Harvard University Press.",
                "Ostrom, Elinor, 1990, <em>Governing the Commons: The Evolution of Institutions for Collective Action</em> Cambridge: Cambridge University Press.",
                "Pareto, Vilfredo, 1935, <em>The Mind and Society</em>, Arthur Livingston (ed.), New York:\nHarcourt, Brace.",
                "Pecorino, Paul, 2015, ‘Olson’s Logic of Collective Action at Fifty’, <em>Public Choice</em>, 162 (3/4): 243–262.",
                "Pettit, Philip, 1986, ‘Free Riding and Foul Dealing’, <em>The Journal of Philosophy</em>, 83: 361–79.",
                "Plato, <em>The Republic</em>, trans. C.D.C. Reeve, Indianapolis:\nHackett, 2004.",
                "Rawls, John, 1964, ‘Legal Obligation and the Duty of Fair Play’, in S. Hook (ed.), <em>Law and Philosophy</em>, New York: New York University Press, pp. 3–18.",
                "–––, [1971] 1999, <em>A Theory of Justice</em>, Cambridge,\nMA: Harvard University Press.",
                "Samuelson, Paul A., 1954, ‘The Pure Theory of Public\nExpenditure’, <em>Review of Economics and Statistics</em>, 36:\n387–389.",
                "Schattschneider, E. E., 1960, <em>The Semi-Sovereign People</em>,\nNew York: Holt, Rinehart and Winston.",
                "Schmidtz, David, 1991, <em>The Limits of Government: An Essay on the Public Goods Argument</em>, Boulder: Westview.",
                "Simmons, A. John, 1979a, ‘The Principle of Fair Play’, <em>Philosophy and Public Affairs</em>, 8: 307–37.",
                "–––, 1979b, <em>Moral Principles and Political Obligations</em>, Princeton: Princeton University Press.",
                "Smith, Adam, [1776] 1976, <em>An Inquiry into the Nature and Causes\nof the Wealth of Nations</em>, Oxford: Oxford University Press.",
                "Sugden, Robert, 1993, ‘Thinking as a Team: Towards an Explanation of Nonselfish Behaviour’, <em>Social Philosophy and Policy</em>, 10: 69–89.",
                "Taylor, Michael, 1987, <em>The Possibility of Cooperation</em>, New York: Cambridge University Press.",
                "Tomasello, Michael, 2016, <em>A Natural History of Human Morality</em>, Cambridge, MA: Harvard University Press.",
                "Trifan, Isabella, 2020, ‘What Makes Free Riding Wrongful? The Shared Preference View of Fair Play’, <em>Journal of Political Philosophy</em>, 28 (2): 158–80.",
                "Tuck, Richard, 1979, ‘Is There a Free-Rider Problem, and If So, What Is It?’, in Ross Harrison (ed.), <em>Rational Action</em>, Cambridge: Cambridge University Press, pp. 147–56.",
                "–––, 2008, <em>Free Riding</em> Cambridge, MA: Harvard University Press.",
                "Tuomela, Raimo, 1988, ‘Free Riding and the Prisoner’s Dilemma’, <em>The Journal of Philosophy</em>, 85: 421–27.",
                "–––, 1992, ‘On the Structural Aspects of Collective Action and Free-Riding’, <em>Theory and Decision</em>, 32: 165–202.",
                "Wolff, Jonathan, 1995, ‘Political Obligation, Fairness, and Independence’, <em>Ratio</em>, 8: 87–99."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Andreoni, James, 1988, ‘Why Free Ride?: Strategies and Learning in Public Goods Experiments’, <em>Journal of Public Economics</em>, 37 (3): 291–304.</li>\n<li>Aristotle, 1998, <em>Politics</em>, trans. C.D.C. Reeve, Indianapolis: Hackett.</li>\n<li>Arneson, Richard J., 1982, ‘The Principle of Fairness and Free-Rider Problems’, <em>Ethics</em>, 92: 616–33.</li>\n<li>Axelrod, Robert, 1984, <em>The Evolution of Cooperation</em>, New York: Basic Books.</li>\n<li>Baumol, William J., 1952, <em>Welfare Economics and the Theory of\nthe State</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Bentley, Arthur F., 1908, <em>The Process of Government</em>,\nChicago: University of Chicago Press.</li>\n<li>Bowles, Samuel, and Herbert Gintis, 2011, <em>A Cooperative Species: Human Reciprocity and Its Evolution</em>, Princeton: Princeton University Press.</li>\n<li>Binmore, Ken, 1998, <em>Game Theory and the Social Contract, Volume 2: Just Playing</em>, Cambridge, MA: MIT Press.</li>\n<li>Broad, C.D., 1916, ‘On the Function of False Hypotheses in Ethics’, <em>International Journal of Ethics</em>, 26: 377–97.</li>\n<li>Buchanan, J.M., 1968, <em>The Demand and Supply of Public Goods</em>, Chicago: Rand McNally.</li>\n<li>Cowen, Tyler (ed.), 1992, <em>Public Goods and Market Failures: A Critical Examination</em>, New Brunswick: Transaction Publishers.</li>\n<li>Cornes, Richard, and Todd Sandler, 1996, <em>The Theory of Externalities, Public Goods, and Club Goods</em>, New York: Cambridge University Press.</li>\n<li>Cullity, Garrett, 1995, ‘Moral Free Riding’, <em>Philosophy and Public Affairs</em>, 24: 3–34.</li>\n<li>–––, 2008, ‘Public Goods and Fairness’, <em>Australasian Journal of Philosophy</em>, 86: 1–21.</li>\n<li>Dagger, Richard, 2000, ‘Membership, Fair Play, and Political Obligation’, <em>Political Studies</em>, 48: 104–17.</li>\n<li>de Jasay, Anthony, 1989, <em>Social Contract, Free Ride: A Study of the Public Goods Problem</em>, Oxford: Clarendon Press.</li>\n<li>Egas, Martijn, and Arno Riedl, 2008, ‘The Economics of Altruistic Punishment and the Maintenance of Cooperation’, <em>Proceedings of the Royal Society: B, Biological Sciences</em>, 275 (1637): 871–78.</li>\n<li>Ewing, A.C., 1953, ‘What Would Happen if Everyone Acted Like Me?’, <em>Philosophy</em>, 28: 16–29.</li>\n<li>Feiock, Richard C., and John Scholz (eds), 2010, <em>Self-Organizing Federalism: Collaborative Mechanisms to Mitigate Institutional Collective Action Dilemmas</em>, Cambridge: Cambridge University Press.</li>\n<li>Fischbacher, Urs, and Simon Gäächter, 2010, ‘Social Preferences, Beliefs, and the Dynamics of Free Riding in Public Goods Experiments’, <em>The American Economic Review</em>, 100 (1): 541–56.</li>\n<li>Frohlich, Norman, Joe A. Oppenheimer, and Oran R. Young, 1971, <em>Political Leadership and Collective Goods</em>, Princeton: Princeton University Press.</li>\n<li>Gauthier, David, 1986, <em>Morals by Agreement</em>, Oxford: Clarendon Press.</li>\n<li>Hampton, Jean, 1987, ‘Free-Rider Problems in the Production of Collective Goods’, <em>Economics and Philosophy</em>, 3: 245–73.</li>\n<li>Hardin, Russell, 1971, ‘Collective Action As an Agreeable\nn-Prisoners’ Dilemma’, <em>Behavioral Science</em>, 16 (September):\n472–481.</li>\n<li>–––, 1982a, <em>Collective Action</em>,\nBaltimore: Johns Hopkins University Press.</li>\n<li>–––, 1982b, ‘Exchange Theory on Strategic\nBases’,\n<em>Social Science Information</em> 21 (2): 251–272.</li>\n<li>–––, 1997, ‘Economic Theories of the\nState’, Dennis C.  Mueller (ed.), <em>Perspectives on Public\nChoice: A Handbook</em>, New York: Cambridge University Press,\npp. 21–34.</li>\n<li>–––, 2002, ‘The Street-Level Epistemology\nof Democratic Participation’, <em>Journal of Political\nPhilosophy</em>, 10 (2): 212–29.</li>\n<li>Hart, H.L.A., 1955, ‘Are There any Natural Rights?’, <em>Philosophical Review</em>, 64: 175–91.</li>\n<li>Hauser, Oliver P., David G. Rand, Alexander Peysakhovich, and Martin A. Nowak, 2014, ‘Cooperating with the Future’, <em>Nature</em>, 511: 220–23.</li>\n<li>Hobbes, Thomas, [1651] 1996, <em>Leviathan, or the Matter, Forme, and Power of a Commonwealth Ecclesiasticall and Civil</em> Cambridge: Cambridge University Press.</li>\n<li>Hume, David, [1739–40] 1978, <em>A Treatise of Human Nature</em>,\nL. A. Selby-Bigge and P. H. Nidditch (eds.) Oxford, Oxford University\nPress, 2nd ed.</li>\n<li>Kameda, Tatsuya, Takafumi Tsukasaki, Reid Hastie, and Nathan Berg, 2011, ‘Democracy Under Uncertainty: The Wisdom of Crowds and the Free-Rider Problem in Group Decision Making’, <em>Psychological Review</em>, 118 (1): 76–96.</li>\n<li>Kant, Immanuel, [1796] 1970, ‘Perpetual Peace: A\nPhilosophical Sketch’, Hans Reiss (ed.), <em>Kant’s Political\nWritings</em>, Cambridge: Cambridge University Press, pp. 93–115.</li>\n<li>Klosko, George, 1992, <em>The Principle of Fairness and Political Obligation</em>, Lanham: Rowman &amp; Littlefield.</li>\n<li>–––, 2005, <em>Political Obligations</em>, Oxford: Oxford University Press.</li>\n<li>Kollock, Peter, 1998, ‘Social Dilemmas: The Anatomy of Cooperation’, <em>Annual Review of Sociology</em>, 24: 183–214.</li>\n<li>Kurzban, Robert, Maxwell N. Burton-Chellew, and Stuart A. West, 2015, ‘The Evolution of Altruism in Humans’, <em>Annual Review of Psychology</em>, 66 (1): 575–99.</li>\n<li>Marwell, Gerald, and Ruth E. Ames, 1979, ‘Experiments on the Provision of Public Goods, I: Resources, Interest, Group Size, and the Free-rider Problem’, <em>American Journal of Psychology</em>, 84: 1335–1360.</li>\n<li>Maitland, Frederic William, [1875] 2000, <em>A Historical Sketch of\nLiberty and Equality</em>, Indianapolis: Liberty Fund.</li>\n<li>McDermott, Daniel, 2004, ‘Fair-Play Obligations’, <em>Political Studies</em>, 52: 216–32.</li>\n<li>Mill, John Stuart, [1848] 1965, <em>Principles of Political\nEconomy</em>, J. M. Robson (ed.), <em>Collected Works of John Stuart\nMill</em>, Toronto: University of Toronto Press, 7th edition, vols. 2\nand 3.</li>\n<li>Miller, David, 2004, ‘Justice, Democracy, and Public Goods’, in Dowding, Keith, Robert E. Goodin, and Carole Pateman (eds), <em>Justice and Democracy: Essays for Brian Barry</em>, Cambridge: Cambridge\nUniversity Press, pp. 127–49.</li>\n<li>Miller, Frank, and Rolf Sartorius, 1979, ‘Population Policy and Public Goods’, <em>Philosophy and Public Affairs</em> 8: 148–74.</li>\n<li>Nozick, Robert, 1974, <em>Anarchy, the State, and Utopia</em>, New\nYork: Basic Books.</li>\n<li>Olson, Mancur, Jr., 1965, <em>The Logic of Collective Action</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Ostrom, Elinor, 1990, <em>Governing the Commons: The Evolution of Institutions for Collective Action</em> Cambridge: Cambridge University Press.</li>\n<li>Pareto, Vilfredo, 1935, <em>The Mind and Society</em>, Arthur Livingston (ed.), New York:\nHarcourt, Brace.</li>\n<li>Pecorino, Paul, 2015, ‘Olson’s Logic of Collective Action at Fifty’, <em>Public Choice</em>, 162 (3/4): 243–262.</li>\n<li>Pettit, Philip, 1986, ‘Free Riding and Foul Dealing’, <em>The Journal of Philosophy</em>, 83: 361–79.</li>\n<li>Plato, <em>The Republic</em>, trans. C.D.C. Reeve, Indianapolis:\nHackett, 2004.</li>\n<li>Rawls, John, 1964, ‘Legal Obligation and the Duty of Fair Play’, in S. Hook (ed.), <em>Law and Philosophy</em>, New York: New York University Press, pp. 3–18.</li>\n<li>–––, [1971] 1999, <em>A Theory of Justice</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Samuelson, Paul A., 1954, ‘The Pure Theory of Public\nExpenditure’, <em>Review of Economics and Statistics</em>, 36:\n387–389.</li>\n<li>Schattschneider, E. E., 1960, <em>The Semi-Sovereign People</em>,\nNew York: Holt, Rinehart and Winston.</li>\n<li>Schmidtz, David, 1991, <em>The Limits of Government: An Essay on the Public Goods Argument</em>, Boulder: Westview.</li>\n<li>Simmons, A. John, 1979a, ‘The Principle of Fair Play’, <em>Philosophy and Public Affairs</em>, 8: 307–37.</li>\n<li>–––, 1979b, <em>Moral Principles and Political Obligations</em>, Princeton: Princeton University Press.</li>\n<li>Smith, Adam, [1776] 1976, <em>An Inquiry into the Nature and Causes\nof the Wealth of Nations</em>, Oxford: Oxford University Press.</li>\n<li>Sugden, Robert, 1993, ‘Thinking as a Team: Towards an Explanation of Nonselfish Behaviour’, <em>Social Philosophy and Policy</em>, 10: 69–89.</li>\n<li>Taylor, Michael, 1987, <em>The Possibility of Cooperation</em>, New York: Cambridge University Press.</li>\n<li>Tomasello, Michael, 2016, <em>A Natural History of Human Morality</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Trifan, Isabella, 2020, ‘What Makes Free Riding Wrongful? The Shared Preference View of Fair Play’, <em>Journal of Political Philosophy</em>, 28 (2): 158–80.</li>\n<li>Tuck, Richard, 1979, ‘Is There a Free-Rider Problem, and If So, What Is It?’, in Ross Harrison (ed.), <em>Rational Action</em>, Cambridge: Cambridge University Press, pp. 147–56.</li>\n<li>–––, 2008, <em>Free Riding</em> Cambridge, MA: Harvard University Press.</li>\n<li>Tuomela, Raimo, 1988, ‘Free Riding and the Prisoner’s Dilemma’, <em>The Journal of Philosophy</em>, 85: 421–27.</li>\n<li>–––, 1992, ‘On the Structural Aspects of Collective Action and Free-Riding’, <em>Theory and Decision</em>, 32: 165–202.</li>\n<li>Wolff, Jonathan, 1995, ‘Political Obligation, Fairness, and Independence’, <em>Ratio</em>, 8: 87–99.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "democracy",
            "game theory",
            "political obligation",
            "prisoner’s dilemma",
            "voting"
        ],
        "entry_link": [
            {
                "../democracy/": "democracy"
            },
            {
                "../game-theory/": "game theory"
            },
            {
                "../political-obligation/": "political obligation"
            },
            {
                "../prisoner-dilemma/": "prisoner’s dilemma"
            },
            {
                "../voting/": "voting"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=free-rider\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/free-rider/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=free-rider&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/free-rider/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=free-rider": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/free-rider/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=free-rider&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/free-rider/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}