{
    "url": "grosseteste",
    "title": "Robert Grosseteste",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Neil Lewis",
        "author_links": [],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nNeil Lewis\n\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Jul 10, 2007",
        "substantive revision Fri May 3, 2019"
    ],
    "preamble": "\nRobert Grosseteste (ca. 1168–1253), Bishop of Lincoln from 1235 to\n1253, was one of the most prominent and remarkable figures in\nthirteenth-century English intellectual life. He was a man of many\ntalents: commentator and translator of Aristotle and Greek patristic\nthinkers, philosopher, theologian, and student of nature. He was\nheavily influenced by Augustine, whose thought permeates his writings\nand from whom he drew a Neoplatonic outlook, but he was also one of\nthe first to make extensive use of the thought of Aristotle, Avicenna\nand Averroes.  He developed a highly original and imaginative\naccount of the generation and fundamental nature of the physical world\nin terms of the action of light, and composed a number of short works\nregarding optics and other natural phenomena, as well as works of\nphilosophy and theology. As bishop, he was an important figure in\nEnglish ecclesiastical life, focusing his energies on rooting out\nabuses of the pastoral care, which in later life he traced to the\npapacy itself.  He made a powerful impression on his\ncontemporaries and subsequent thinkers at Oxford, and has been hailed\nas an inspiration to scientific developments in fourteenth-century\nOxford.\n",
    "toc": [
        {
            "#Lif": "1. Life"
        },
        {
            "#Wor": "2. Works"
        },
        {
            "#Sou": "3. Sources"
        },
        {
            "#MetLig": "4. The Metaphysics of Light"
        },
        {
            "#InfConMea": "5. Infinity, Continuity, and Measurement"
        },
        {
            "#CreEteTimBei": "6. Creation, Eternity, Time and Being"
        },
        {
            "#DivForHumFre": "7. Divine Foreknowledge and Human Freedom"
        },
        {
            "#ModGodPow": "8.  Modality and God’s Power"
        },
        {
            "#FreDecFreWil": "9. Free Decision and Freedom of the Will"
        },
        {
            "#ExeTruIll": "10. Exemplarism, Truth and Illumination"
        },
        {
            "#Exe": "10.1 Exemplarism "
        },
        {
            "#Tru": "10.2 Truth"
        },
        {
            "#Ill": "10.3  Illumination"
        },
        {
            "#SciMet": "11.  Scientific Method"
        },
        {
            "#Inf": "12. Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Bibs": "Bibliographies"
        },
        {
            "#BioStu": "Biographical Studies"
        },
        {
            "#PriTexLat": "Primary Texts in Latin"
        },
        {
            "#PriTexEngTra": "Primary Texts in English Translation"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n Grosseteste was born into a humble Anglo-Norman family in the\ncounty of Suffolk in England.  He first appears in the historical\nrecord as a witness to a charter of the Bishop of Lincoln, written\nbetween 1189 and 1192.  His title of master of arts indicates that he\nhad acquired sufficient learning to be entitled to teach.  Assuming\nthat Grosseteste would therefore have been in his early twenties,\nCallus 1955 has suggested a birth date around 1168.  Around 1195, in a\nletter of recommendation to the Bishop of Hereford, William de Vere,\nGerald of Wales commends Grosseteste for his wide reading and skill in\nbusiness and legal affairs, medicine, and the liberal arts, and\nremarks on his exceptional standards of conduct.  Grosseteste appears\nas a witness to several of de Vere’s charters over the next few years,\nbut disappears from the historical record after de Vere’s death in\n1198. He reappears as a papal judge-delegate in Litchfield diocese\nbefore 1216 and in Hereford diocese between 1213 and 1216, acting with\nHugh Foliot, Archdeacon of Shropshire. Grosseteste’s name reappears\ntwice more in legal documents connected with Shropshire before 1227.\nFor at least part of the years 1208 to 1213, when England was under\npapal interdict, Grosseteste was in France, for in a death-bed\nconversation reported by the chronicler Matthew Paris he recalls\nhaving seen and heard preaching in France Eustace of Flay, James of\nVitry, Robert of Courson and the exiled Archbishop Steven Langton.  In\n1225, while still a deacon, Grosseteste was presented by the Bishop of\nLincoln, Hugh of Wells, to the living of Abbotsley; in 1229 he was\nmade Archdeacon of Leicester and presented with a prebend in Lincoln\nCathedral. In 1229/1230 Grosseteste accepted an invitation to become\nthe first lecturer to the Oxford Franciscans.  In 1235 he was elected\nBishop of Lincoln, a position he occupied until his death in 1253.\n Besides the facts just mentioned, and despite confident statements\nabout his early life in much of the literature, we know very little\nabout Grosseteste’s life before about 1230. He no doubt was educated\nin the liberal arts in England, possibly at Lincoln, and he probably\nstudied in the late twelfth century at Hereford, then a center of\nscientific learning.  He is thought to have studied theology in the\nearly thirteenth century, though exactly where and when is a matter of\ndisagreement, as is the related question of his relation to the then\nnascent Oxford University.\n Scholars have proposed different hypotheses regarding\nGrosseteste’s life between about 1200 and 1230.  According to Daniel\nCallus (Callus 1945, 1955, with Crombie 1953 and McEvoy 1982, 2000 in\nsubstantial agreement), from about 1200 Grosseteste probably taught\nthe arts at Oxford, only to leave Oxford in 1209 to study theology in\nFrance when the Oxford schools closed after some clerics were hanged by\nOxford’s mayor and officers. The resolution of the resulting\ntown-and-gown dispute was delayed by the papal interdict of England\nbut finally achieved in 1214, when the papal legate sent to England to\nnegotiate a settlement between the king and pope visited Oxford.  The\nlegate’s resolution, known as the Legatine Award, placed the Oxford\nmasters under the jurisdiction of the Bishop of Lincoln, who was to\nappoint as his representative a chancellor of the university. Remarks\nby Hugh Sutton, Grosseteste’s successor as Bishop of Lincoln, indicate\nthat Grosseteste had at one time occupied the position of chancellor\nat Oxford but had been allowed only to use the title “master of\nthe schools” and not “chancellor.” According to\nCallus, Grosseteste probably returned from France in 1214 to become,\nin function if not title, Oxford’s first chancellor, and lectured on\ntheology in Oxford’s secular schools from this year until\n1229/30.\n By contrast, Sir Richard Southern (1986) argued that until 1225\nGrosseteste more likely occupied a provincial administrative position,\nperhaps supplemented by occasional short periods of teaching, possibly\neven at Oxford, among other places. His time in France was in\nconsequence of the interdict rather than the closure of the Oxford\nschools, and was not spent in the study of theology.  According to\nSouthern, Grosseteste’s permanent association with Oxford began after\n1225, when, having received the prebend of Abbotsley, Grosseteste\nprobably became a priest and began to lecture in theology. According\nto Southern’s chronology, he would have become chancellor in the late\n1220s.\n Southern’s important study had the salutary effect of forcing a\nreexamination of the assumptions upon which earlier accounts of\nGrosseteste’s life rested, but his conclusions remain\ncontentious. Joseph Goering, after looking closely at the content of\nGrosseteste’s writings and the documentary evidence, concludes that\n“the evidence intimates that he was on the continent along with the\nbishop of Hereford and other English Churchmen in exile before 1215,\nthat he returned to the diocese of Hereford when the interdict was\nlifted, and that he continued his diocesan service and his teaching as\na master of arts, at Hereford or elsewhere, into the 1220s” (Goering\n1995, 26).  Yet Goering thinks that the sources used in Grosseteste’s\ntheological writings, as well as Grosseteste’s known ties with\nimportant Parisian thinkers, best support the view that Grosseteste’s\nstudy of scholastic theology—a casual and gradual process in his\nview—included at least some time studying in Paris in the 1220s,\npossibly around 1225 after receiving his substantial prebend in\nAbbotsley, which made (and perhaps was intended to make) such a course\nof study possible. Goering observes that there is no concrete evidence\nthat Grosseteste taught at Oxford prior to the late 1220s or that his\nteaching in the secular schools at Oxford was in theology rather than\nthe arts.  Grosseteste’s association with Oxford and chancellorship\nmay indeed have only been in the late 1220s as a master of arts—the\nfact that he was a master in the lower faculty of arts, not the higher\nfaculty of theology, would perhaps explain why he was not permitted to\nbe called chancellor.\nMore recently James Ginther (Ginther 2000) has argued that\nGrosseteste became regent master of theology ca. 1229/30, around the\ntime he became lecturer to the Oxford Franciscans. Ginther claims that\nGrosseteste’s Dictum 19 in fact records Grosseteste’s\ninception sermon at Oxford as regent master of theology. Brett Smith\n(Smith 2018, n. 34), however, has recently expressed some doubts over\nGinther’s claims, and the question of Grosseteste’s career before\nca. 1229/30 remains unresolved among scholars.\n\n\n In 1229/30 Grosseteste began a formal association with the\nFranciscans at Oxford as their first lecturer.  The Franciscans had\narrived at Oxford in 1224. Their Minister Provincial, Agnellus of\nPisa, provided this small but growing group with their first school\nand requested that Grosseteste lecture to them.  Grosseteste’s high\nregard for the mendicants no doubt played a role in his acceptance of\nthis request. Some indeed thought that Grosseteste would himself\nfollow the path of many other eminent scholars of his day and join the\nFranciscan order, but this was not to be. Instead, in 1235 he was\nelected Bishop of Lincoln. He was not the electors’ first choice but\nrather a compromise candidate, but he went on to become a powerful and\nexacting bishop.  Grosseteste’s teaching career was over, but he\ncontinued to enjoy close relations with the Franciscans for the rest\nof his life. They were members of his episcopal household and he\nemployed them as assistants and bequeathed his books to them. These\nbooks, kept in the Oxford Franciscan convent library, were to become\nan important source for later thinkers’ knowledge of Grosseteste’s\nteachings.\n In 1231, after recovering from serious illness, Grosseteste\nresigned all his sources of revenue, save his prebend in Lincoln\ncathedral.  He went on to compose a series of important theological\nworks, the most notable being his Hexaæmeron, a long\ncommentary on Genesis 1:1–2:17.  A feature of these theological works\nis Grosseteste’s increasing knowledge of ancient Greek. Just when\nGrosseteste began to study Greek is not known, but his studies appear\nto have been under way by the early 1230s (see Dionisotti 1988).\nAided by assistants proficient in Greek, Grosseteste became one of the\nvery few thinkers in the Latin West to know the language. He was not\ncontent, however, to employ his Greek learning simply as an aid in his\ntheological studies, but he also embarked on important projects of\ntranslation of Greek works into Latin.  The first of these projects,\ncommenced after about 1235, focused on works by the theologian, John\nof Damascus.  In the late 1230s and early 1240s, Grosseteste turned to\nthe writings of the Pseudo-Dionysius. He completed a new translation\nof the Pseudo-Dionysius’s works, to which he added his own original\ncommentary.  Grosseteste had also retained philosophical interests and\nin the 1240s turned again to the writings of Aristotle, with whose\nworks he had engaged as a commentator in the 1220s. He made the first\nextant complete Latin translation of the Nicomachean Ethics\nto circulate in the Latin West, as well as translations of a large\nbody of accompanying Greek commentary materials, some of which he\nsupplemented, where they were lacking, with his own original\ncommentary and notes.  Grosseteste also translated, apparently very\nlate in life, at least substantial parts of Aristotle’s De\ncaleo and Simplicius’s commentary on it.  \nThe 1240s also marked an important period of ecclesiastical\nactivity.  Conflict between the papacy and Emperor Frederick II had\nled Pope Innocent IV to flee to Lyon in 1244 and relocate the papal\ncourt there until 1251.  In hope of resolving this conflict, among\nother pressing concerns, Innocent convened the First Council of Lyon\nin 1245.  Grosseteste was included among the English delegation.\nGrosseteste returned to the papal court in 1250. Addressing the pope\nand cardinals, he bemoaned the failings of the church, which he\nlocated in its deviation from its pastoral mission. Grosseteste placed\nthe blame for this state of affairs squarely at the feet of the papal\ncourt, suggesting that if matters continued on their present course\nthe pope would not be due obedience.  In 1253, the last year of his\nlife, in a famous and angry letter to the pope (letter # 128),\nGrosseteste did indeed in no uncertain terms refuse to obey the pope’s\ninstructions to confer a benefice on one of the pope’s nephews, whom\nhe viewed as unfit for the pastoral care.  \nGrosseteste died on October 8–9, 1253.  His English contemporaries\nremembered him as a saintly man. Three attempts were made to have him\ncanonized, the last in 1307; all failed. \n2. Works\nGrosseteste’s large and rich body of writings includes scientific\nworks, commentaries on and translations of Aristotle’s writings and\nworks of Greek theology, commentaries on books of the Bible, works in\nphilosophy and speculative and pastoral theology, collections of\nsermons and letters, and a large collection of short theological\nwritings known as the Dicta. Grosseteste also composed some\nAnglo-Norman poetry.  His works of philosophical interest may be\nclassified, in modern terms, as follows: \n\nCommentaries on Aristotle. Many years before Grosseteste\ncomposed his translations of the Nicomachean Ethics and\nDe caelo, he had been deeply engaged in the study of\nAristotle’s views on scientific knowledge and natural philosophy, and\nhad composed a commentary on the Posterior Analytics and\ncommenced and made substantial progress on a commentary on the\nPhysics. These are the earliest surviving commentaries on\nthese works known to have been composed in the Latin West.  Extant\nmanuscripts also contain and attribute to Grosseteste a paraphrase of\nthe Prior Analytics, which may well be genuine, as well as a\ncommentary on the  Sophistici Elenchi and another commentary\non the Physics, both of which appear to be inauthentic. The\ncommentary on the Posterior Analytics appears to have been\nwritten in the 1220s and is an important source for Grosseteste’s\nepistemological views. The authentic commentary on the \nPhysics appears to have been assembled by a later editor or\neditors from notes Grosseteste had written in his copy of the\nPhysics as the basis of a commentary along the lines of the\ncommentary on the Posterior Analytics.  Though incomplete,\nthese notes comprise a substantial and coherent work, the bulk of\nwhich was also probably written in the 1220s, though what appear to be\nsome additions to the body of the work in which Averroes’s long commentary on the Physics is\nused probably date from the 1230s (see Lewis 2003).  This work is an\nimportant source for Grosseteste’s views on numerous topics in natural\nphilosophy.\nPhilosophical works.  Grosseteste composed a number of short\nphilosophical works. On Light (De luce) his minor\nmasterpiece, develops his so-called light metaphysics; it appears to\nbe the object of cross-references in his commentaries on Aristotle and\nthus written prior to them. Closely related to On Light is a\nshort work On Bodily Movement and Light (De motu\ncorporali et luce). Other short philosophical works are On\nPotency and Act (De potentia et actu), On the Halt\nof Causes (De statu causarum), On the Subsistence of\na Thing (De subsistentia rei), and On the Truth of\nthe Proposition (De veritate propositionis).  On the\nFinitude of Movement and Time (De finitate motus et\ntemporis) (a longer version of which is appended to the\ncommentary on the Physics) attacks Aristotle’s arguments for\nthe infinitude of past time and movement; it was probably written in the\n1230s\nPhilosophical-theological works. The most important and\nsubstantial of these works is On Free Decision (De libero\narbitrio), a relatively long work in two versions that is\nconcerned with arguments against the existence of free decision\n(liberum arbitrium)—especially those based on God’s\nforeknowledge—and with the nature of free decision itself. Closely\nrelated are the shorter works On Truth (De veritate)\nand On God’s Knowledge (De scientia Dei). These\nworks all appear to date from after ca. 1225, and more probably from the late 1220s or\nbeginning of the 1230s. A short work, On the Order of the\nEmanation of Caused Things from God (De ordine emamandi\ncausatorum a Deo), attacks the argument that an eternal being can\nonly create eternal creatures. A long letter to Adam Rufus (= Adam of Exeter), the first\nin Grosseteste’s letter collection, explains how God is form of all\nthings and investigates the relation of body and soul and the location\nof angels. In the manuscripts this letter is often divided into two\ndistinct works, On the Unique Form of all Things (De\nunica forma omnium) and On the Intelligences (De\nintelligentiis).\nScientific works.  Grosseteste’s scientific writings include\nwhat appear to be his earliest works, which possibly were written\nduring the first two decades of the thirteenth century: On the Liberal\nArts (De artibus liberalibus), On the Generation of\nSounds (De generatione sonorum), and On the\nSphere (De sphaera), an outline of astronomy.  Later in the\nthirteenth century, Grosseteste wrote a number of short\nscientific works including On Comets (De cometis), On Lines, Angles and Figures (De\nlineis, angulis et figuris), On the Nature of Places\n(De natura locorum), On the Rainbow (De\niride), On Color, (De colore), On Local\nDifferences (De diferentiis localibus), and On the Movement of the Supercelestial Bodies (De motu supercaelestium). (For an outline of the\ncontent of many of these works see Dales 1961 and Panti 2001. The works On the Heat of the Sun (De calore solis), On the Tides (De fluxu et refluxu maris), On the Generation of the Stars (De generatione stellarum), and On the Impressions of the Air (De impressionibus aeris), first edited in Baur 1912, are probably inauthentic. In the most recent discussion of the dating of Grosseteste’s scientific works, Panti 2013 argues that the first two of these works were probably written by Adam of Exeter, the addressee of Grosseteste’s first letter.).\nTheological works containing some material of philosophical\ninterest. Though not as expressly philosophical as the works\nnoted above, On the Cessation of the Ceremonial Laws (De\ncessatione legalium), On the Ten Commandments (De\ndecem mandatis) and the Hexaæmeron, all\nsubstantial works written in the 1230s, contain some material of\ninterest to the philosopher. On the Cessation of the Ceremonial\nLaws argues that the Incarnation would have occurred even without\nthe fall, and touches on the nature of human happiness and natural\nlaw. On the Ten Commandents provides some insight into\nGrosseteste’s thinking about ethics, while the \nHexaæmeron, his theological masterpiece, considers in\ndetail the problem of the eternity of the world. Material of\nphilosophical interest is also to be found in the Dicta, some\nof Grosseteste’s later sermons (notably the sermon Ecclesia sancta\ncelebrat where he outlines an account of human nature) and his\ncommentaries on the Pseudo-Dionysius.\n\n In the present article the focus is on Grosseteste’s thought in\nworks from the first three categories.\n3. Sources\n The most fundamental influence on Grosseteste’s thought was\nSt. Augustine, from whom Grosseteste drew a Neoplatonic outlook.  Yet\nGrosseteste was also strongly influenced by the Latin translations of\nGreek and Arabic philosophical and scientific writings that had poured\ninto the Latin West in his lifetime, notably the thought of such\nthinkers as Aristotle, Avicenna and Averroes (whose works Grosseteste\nwas one of the first to use; see Gauthier 1982). These influences often pull him in\ndifferent directions and his thought can take on an eclectic\ncharacter. In general, however, he attempts to subordinate Greek and\nArabic philosophical learning, when necessary, to his Augustinian\nNeoplatonism.\n Although there is little doubt that Grosseteste was to some extent\ninfluenced by his contemporaries, his writings show little concern to\nengage in debate with them, in contrast with the practice of his\ncontemporaries in Paris. This perhaps reflects a provincial origin\nof Grosseteste’s works, but may also reflect a conservative preference\nto engage with the ideas of the great thinkers of the recent and more\nremote Latin and Greek traditions. The Christian\ninfluences on his philosophical writings were in particular Boethius,\nSt. Anselm, and St. Bernard of Clairvaux, in addition to Augustine.\nGrosseteste also made frequent use of the writings of Cicero and\nSeneca.  Later in life, in the 1230s and 40s, the influence of Greek\nthinkers such as John of Damascus, St. Basil and the Pseudo-Dionysius\nis prominent in his theological writings.\n Grosseteste’s Tabula (Rosemann 1995) provides an unusual\ninsight into his sources. This work is a topical concordance in which\nGrosseteste lists readings, Christian and non-Christian, on a wide\nrange of topics of theological and philosophical interest.\nGrosseteste associated with each topic a sign, which, written in his\nown manuscript books, allowed him quick access to the material in\nquestion.\n4. The Metaphysics of Light\n If a single leitmotif runs through Grosseteste’s works, it is that\nof light.  The notion of light occupies a prominent place in\nGrosseteste’s commentaries on the Bible, in his account of sense\nperception and the relation of body and soul, in his illuminationist\ntheory of knowledge, in his account of the origin and nature of the\nphysical world, and, of course, in his writings on optics.  Just how\ntightly associated Grosseteste took the notions of light employed in\nsuch different contexts to be is unclear. From a philosophical point\nof view, which will be the focus here, undoubtedly his use of the\nnotion of light in his account of the basic structure and origin of\nthe physical universe is of fundamental importance and the greatest\noriginality.\n Grosseteste’s so-called metaphysics of light rests on a\nhylomorphic (matter-form) account of the metaphysical makeup of\nbodies. On this basis Grosseteste explains the generation and nature\nof the cosmos. Grosseteste also interprets aspects of Aristotle’s\nnatural philosophy in terms of this theory.  He sets out this theory\nmost fully in On Light, but elements of it are present also in\nhis commentaries on the Posterior Analytics and \nPhysics, in On Bodily Movement and Light, and in his\ncommentary on Ecclesiasticus 43: 1–5, also known as On the\nOperations of the Sun. \nGrosseteste treats bodies as composites of a first or prime matter\nand a corresponding first form. This form, termed\n“corporeity,” is the form in virtue of which something is\na body.  Grosseteste takes bodies to be more or less metaphysically\nsimple depending on whether, in addition to corporeity, they include\nother substantial forms. Thus, in On Light he holds the\nfirmament or outermost heavenly sphere to be the most simple body, as\nit is composed simply of first matter and first form, but in his\ncommentary on the Physics he speaks of the element fire as\nhaving in addition to first form the substantial form of fire.\n Grosseteste’s originality lay not in presenting a doctrine of\nfirst form and first matter.  Aristotle was standardly understood to\npropound a notion of first or prime matter, and the notion of a first\nform may be found in texts of Neoplatonic inspiration, such as the\nFons vitae of Avicebron (see McEvoy 1982, 158–162).  What\nappears to be original, however, is Grosseteste’s identification of\nfirst form with light (lux). On Light opens with an\nargument for this identification. Grosseteste asserts that first form\nand first matter are in themselves simple substances. Yet first form,\ncorporeity, necessarily results in the extension of matter into three\ndimensions, thereby yielding a quantified body. A simple form without\ndimension could only have this effect, however, if it instantaneously\nmultiplied and diffused itself in all directions, thereby extending\nmatter along with its diffusion of itself. But these are\ncharacteristic features of light, for light is essentially\nself-multiplicative and self-diffusive, a sphere of light being\ninstantaneously generated from a point of light. Thus, Grosseteste\nconcludes that light is in fact the first form.\n On the basis of this theory Grosseteste developed a cosmogony and\ncosmology. He saw in the metaphysics of light insight\ninto God’s creation of the physical universe and an explanation of why\nit took the form it did. At the beginning of time, Grosseteste\nasserts, God created first form or light in first matter.  First form\nand first matter are in themselves indivisible and simple, and\naccording to Grosseteste the finite multiplication of a simple cannot\ngenerate an item with size (quantum). But, he thinks, the\ninfinite multiplication of a simple will generate a finite\nquantum.  Thus, through the infinite multiplication of first\nform in first matter extended bodies, and thus the physical universe,\nwere produced.  To account for bodies of different sizes, Grosseteste\nposits that there are infinities of different sizes (see below) that\nstand in different ratios, numerical and non-numerical, to each\nother. Thus, “light by the infinite multiplication of itself extends\nmatter into larger and smaller finite dimensions that stand to one\nanother in all ratios, numerical and non-numerical” (Lewis 2013,\n241–242).\nGrosseteste employs the notion of light to explain the genesis of\nthe Aristotelian cosmos as a system of nested celestial spheres\nsurrounding the four sublunary or elemental spheres. According to\nGrosseteste, the infinite self-multiplication of the initial point of\nlight extended the first matter it informed into a spherical form,\nsince light diffuses itself spherically. The outermost parts of the\nmatter of the sphere thereby generated, unlike the parts of the matter\nbelow them, were maximally extended and rarefied and formed the\noutermost (or first) sphere, the firmament. Yet because light is\nessentially self-multiplicative, the light in this outermost sphere\ncontinued to multiply itself, only now it did so back inwards toward\nthe center from all parts of the outermost sphere, since it had\nalready diffused itself outward as far as it possibly could. And since\nlight, being a substantial form, cannot exist apart from matter, this\ninwardly directed light drew with itself what Grosseteste calls the\nspirituality of the matter of the outermost sphere, and thus\nlumen, a body comprised of light and the\nspirituality of this matter, proceeded inwards. Moving inwards,\nlumen concentrated the matter existing below the outermost\nsphere, leaving in its wake below the outermost sphere a second sphere\ncomprised of matter whose parts were rarefied as much as they could\nbe. This sphere in turn generated lumen, which moving inwards\nfurther concentrated the matter below it and rarefied the outermost\nparts of this matter so as to produce the third sphere. The repetition\nof this process gave rise to the nine celestial spheres, each sphere\nbeing comprised of matter whose parts were incapable of further\nrarefaction.\nThe lowest celestial sphere, the lunar sphere, also generated\nlumen, which moved inwards and further concentrated the matter\nbelow this sphere. But since this lumen lacked enough power to\nfully disperse the outermost parts of this matter below the lunar\nsphere, it produced a sphere comprised of incompletely dispersed\nmatter, the sphere of fire. Likewise, fire generated lumen,\nproducing below it yet another sphere of incompletely dispersed\nmatter, the sphere of air. This process continued, giving rise in turn\nto the spheres of water and earth, the latter being comprised of the\nmost concentrated and dense matter. Because the matter of these four\nelemental spheres was not fully dispersed, it remained capable of\nbeing concentrated and dispersed, and for this reason the elements,\nunlike the celestial spheres, are capable of alteration, growth,\ngeneration and corruption.\nGrosseteste also employs this theory of light as part of his\nexplanation of the nature of the heavenly movements. He explains that\nthe heavenly bodies can only move with a circular movement because the\nlumen in them is incapable of rarefaction or condensation, and as\na result cannot incline the parts of their matter upward (to rarefy\nthem) or downward (so as to condense them). Indeed, the heavenly\nspheres can only receive movement “from an intellective motive\npower,” that is, an intelligence or angel, “that in\nincorporeally casting its mental gaze back over itself rotates the\nspheres with a corporeal revolution” (Lewis 2013, 246).  Because\nthe elements, on the other hand, can be rarefied and condensed, they\ncan incline the lumen in themselves away from the center of the\nuniverse, so as to rarefy it, or toward the center so as to condense\nit, and this accounts for their natural capacity to move up and\ndown.\nAlthough the metaphysics of light is fundamentally non-Aristotelian\nin nature, Grosseteste clearly was concerned to use it to explain many\nof the features of the Aristotelian cosmos—the system of\nnested spheres, the distinction between the movement of celestial and\nsublunary bodies, and so forth. In like manner, in his commentary on\nthe Physics he interprets fundamental ideas in Aristotle’s\nnatural philosophy in terms of the light metaphysics, explaining\nAristotle’s theory of potentiality in terms of the replicability of\nform and holding that every bodily species comes to be by “the\ngreater or lesser replication of the simple first bodily form,”\nlight (Dales 1963a, 17).  Likewise, Aristotle’s three principles:\nform, privation and the underlying subject, are interpreted as the\nfirst form light, the impurity of light in things, and first matter\nrespectively. In On Bodily Movement and Light, Grosseteste\nidentifies nature, conceived by Aristotle as an internal source of\nmovement and rest, with the first form, light, and claims that all kinds\nof bodily change are the “multiplicative force” of the first\nbodily form, light (Baur 1912, 92).\n5. Infinity, Continuity, and Measurement\n Grosseteste appears to have been the first in the Latin West to\npropose a doctrine of unequal infinities. In On Light he holds\nthat there are infinite numbers that differ in size: “the sum of all\nnumbers, both odd and even, is infinite and  is greater than the sum of\nall the even numbers, even though this too is infinite, for it exceeds it\nby the sum of all the odd numbers” (Lewis 2013, 241).  According to\nGrosseteste, infinite numbers can stand to one another not only in\nevery numerical ratio, but also in every non-numerical ratio\n(Grosseteste has in mind the ratio of the infinite numbers of points\ncontained in incommensurable lines). He clearly thinks lines and other\ncontinua contain different-sized infinities of points or\nindivisibles, viewed as dimensionless simples. But he also thinks\npoints are parts of lines, and more generally, that\nindivisibles serve to make up continua. He is aware that Aristotle\nseems to reject this view and hold that magnitudes only have\nmagnitudes as their parts, but he claims in  On Light that the\nterm “part” has a range of meanings depending on which\nmathematical relationship of parts to wholes is in\nquestion. Aristotle, he asserts, means by “part” in\nconnection with continua an aliquot part and is concerned only\nto deny that continua are composed of indivisibles as aliquot\nparts. But this denial does not entail that indivisibles are not parts\nstanding in a different mathematical relationship to the wholes to\nwhich they belong. According to On Light, a point is a part of\na line in the sense that it is in a line “an infinite number of times,\nand does not diminish the line when substracted from it a finite\nnumber of times” (Lewis 2013, 242).  Grosseteste says little about the\nordering of indivisibles in continua but mentions without criticism\nAristotle’s view that indivisibles in continua must be densely or\n“mediately” ordered, so that between any two is yet another, a view\nattributed to him by Albert the Great and Thomas Bradwardine (see\nLewis 2005).\n Grosseteste’s theory of unequal infinities served as the basis of\na theory of how God measured the world he created.  Grosseteste takes\nup measurement in his commentary on the Physics (Dales 1963a,\n90–95), in one of the earliest theoretical discussions of measurement\nin the middle ages. He points out that human measurement of time\ninvolves taking some recurring movement—say, the daily movement of\nthe heaven—and stipulating its duration to be a unit of\nmeasurement. In the same way, the magnitude of some body is taken as a\nunit of the measurement of spatial magnitude. Measurement of this\nsort, Grosseteste holds, is inherently relative in nature. To say that\nan event lasts for a day, for example, is simply to relate its\nduration to the duration of the movement of the heavens. But Grosseteste\nthought that this mode of measurement would not suffice for God, who,\nas he frequently mentions, “has disposed all things in number, weight\nand measure” (Wisdom 11: 21).  God’s creative activity requires\nthat he create bodies with a definite magnitude and movements with a\ndefinite duration, and this requires that there be a non-relative\nmeasure intrinsic to magnitudes and durations.  According to\nGrosseteste, this measure is provided by the different-sized\ninfinities of indivisibles comprising spatial and temporal\nmagnitudes. Grosseteste points out in his commentary on the\nPhysics that were only a single line to exist, it would not be\npossible for us to measure its magnitude, and yet God could do so by\ncounting the infinite number of points that comprise its\nmagnitude. Only God can measure in this way, for only to him is the\ninfinite finite, an allusion to Augustine’s teaching in The City of\nGod 20.19 that God alone can embrace an infinity in his mind.\n6. Creation, Eternity, Time and Being\nAs a Christian, Grosseteste believed that God created the world\nwith a beginning; indeed, he thought, as some sketchy arguments in the\nHexaæmeron 1.9.7 indicate, that the beginning of the\nworld could be proved. But his primary contribution to the medieval\ndebate over the beginning of the world was his interpretation and\nrefutation of Aristotle’s arguments in Physics 8 for a\nbeginningless or “eternal” world (see Dales 1986).  In this connection\nGrosseteste was at odds with some of his early thirteenth-century\ncontemporaries, such as Alexander of Hales, who thought that Aristotle did not mean to deny the\nbeginning of the world but only that it had a natural\nbeginning.  Let those who adopt such an interpretation, he writes\nin his Hexaemeron, “not deceive themselves and pointlessly try\nto make a Catholic of Aristotle, thereby wasting their time and mental\npowers and, in making a Catholic of Aristotle, make heretics of\nthemselves” (Dales and Gieben 1982, 61)\n Grosseteste takes up Aristotle’s arguments for a beginningless\nworld in his  Hexaæmeron and, in greater detail, in the\nclosely related treatise On the Finitude of Movement and Time.\nIn both works he holds that Aristotle was led to propose his erroneous\narguments as a result of a failure to adequately grasp simple\neternity.  Grosseteste is prepared to grant that Aristotle and other\nphilosophers proved that God exists and is unchangeable and\nnon-temporal and that they indeed had some grasp of simple\neternity. Even so, their incomplete understanding of simple eternity\nmeant that they did not really understand what they proved.  This lack\nof understanding was due to a disordering of their affectus or\nwill, rather than of their aspectus or reason. This distinction\nbetween affectus and aspectus, which appears to derive\nfrom Augustine, is characteristic of Grosseteste’s thought (see Smith 2018). According\nto Grosseteste, genuine understanding requires that one’s will or\ndesires be directed away from the sensible world to the unchanging\neternal realm, but Aristotle and the other philosophers, being\npreoccupied with the sensible world, could not achieve true\nunderstanding.\nSimple eternity is God’s eternity, the\nnon-temporal mode of being enjoyed by God.  Like\nAugustine before him in Confessions 12.40, Grosseteste thinks we can speak\nof eternity as before time and of time as after eternity, provided we\nbear in mind that the terms “before” and\n“after” are in this connection employed in non-temporal\nsenses.  According to Grosseteste, if Aristotle had more fully grasped\nsimple eternity he would have realized his arguments for the eternity\nof the world rest on a failure to recognize non-temporal notions of\nbefore and after. Aristotle, he thinks, assumes in two of his\narguments for the eternity of the world that a first movement would have\nto have been preceded by a potentiality for this movement and thus by\ntime. But since, according to Aristotle, time requires movement and a\npotentiality for something can only be exercised through a movement,\nthere follows the absurdity that the first movement would not be the\nfirst movement. Thus time and movement must be without a beginning.\nGrosseteste objects that although the first movement exists after not\nexisting and that there was indeed a potential for that movement before\nit, in this context “was” and “before”\nrefer to the relation of eternity to time and are used in a\nnon-temporal sense. The first movement was preceded by a potentiality\nfor itself, not in time, but in God’s eternity, and the actualization\nof this potentiality involves no movement or change in God. As for\nAristotle’s third argument that there cannot be a first instant, hence\nnor a beginning of time or change, because an instant is a link\nbetween past and future, Grosseteste responds that this conception of\nan instant will appeal only to someone already committed to the\neternity of time and change.\n According to Grosseteste, the notion of eternity is key also to\nunderstanding the nature of time. In his commentary on the\nPhysics he takes Aristotle’s conception of time as a number of\nchange in respect of before and after to be the result of a\nsuperficial discussion, adequate as far as the natural philosopher is\nconcerned but inadequate as an account of time’s true essence, an\ninadequacy, he thinks, Augustine had also seen. But Grosseteste is not\nattracted to what he takes to be Augustine’s subjectivist conception\nof time and instead seeks an account of the true essence of time as an\nobjective phenomenon.\n According to Grosseteste, time is “the privation of the\nat-once of eternity from the totality of being” (Dales 1963a,\n96).  He means that for there to be time there must be items whose\nexistence does not adhere as a whole, as he puts it, with the\nat-once of eternity, that is, whose existence is not\ninstantaneous.  Eternity, is, as it were, a fixed point subject to a\ncontinuous succession of the adherences of instantaneous bits of the\ntotality of existence, one bit adhering to eternity only continuously\nto be replaced by another; this continuous replacement constitutes the\nflow of time. Grosseteste defines the instant, by which he means the\nnow, as this adherence of being with the at-once of eternity,\nand likewise defines past and future in terms of this adherence. He\nrealizes that his use of tenses in his explanations of these notions\nrenders them ultimately circular, but asks that he not be criticized\n“for making these differences known in terms, as it were, of\nthemselves, for it does not come to mind, or does not do so easily,\nhow they could otherwise be made known” (Dales 1963a, 98).\n \nGrosseteste’s account of time appears to be closely related to his\nconception of existence, as presented in his commentaries on the\nPosterior Analytics and Physics and in On\nTruth (Rossi 1981, 290–291; Dales 1963a, 7; Baur 1912,\n141; see also Lewis 2009).  Grosseteste holds that a created thing’s\nexistence just is its dependence on God.  Thus, a thing does not\ndepend on God for its existence; its dependence on God is its\nexistence.  Grosseteste appears to equate this relation of dependence\nwith the relation of adherence to the  at-once of eternity\nmentioned in his account of time. He remarks that “something no\nmore partakes of actual existence except insofar as it adheres to the\nfirst being that is all at once” (Dales 1963a, 96–97).  He\ndoes not seem to realize that the relata of the relation of adherence\nin his account of time and of the relation of dependence in his\naccount of being are different: in his account of time it is an\ninstantaneous bit of a thing’s existence that adheres, while\nin his account of existence it is the thing itself that is dependent\nand existence is itself treated as a relation, not as the term of a\nrelation.\n7. Divine Foreknowledge and Human Freedom\nOn Free Decision is one of Grosseteste’s most influential\nand substantial philosophical works. Its first half is largely devoted\nto the problem of reconciling God’s knowledge of the future with human\nfreedom. Much of the importance of this discussion resides in the\ntheory of modality that Grosseteste develops, but it is also of\nimportance for the argument Grosseteste presents for the\nincompatibility of God’s knowledge of the future and future\ncontingency. Grosseteste correctly takes himself to be presenting a\ndifferent argument, and different solution, from those found in\nBoethius and Anselm, who had written two of the most important earlier\ndiscussions of the issue.  \n Grosseteste presents this argument as follows: “Everything known\nby God is or was or will be; a is known by God (let a be a future\ncontingent); so a is or was or will be. But a neither is nor\nwas; so it will be. Each of the premises is clearly\nnecessary, as is the inference. So the conclusion is not just true but also\nnecessary, for only what is necessary follows from things that are necessary” (Lewis 2017, 111).  The argument is in two parts: A sound argument without modal premises is presented for the conclusion that an event will\noccur. It is then claimed that its premises are necessary, and thus,\nby the principle that entailment transmits necessity from premises to\nconclusion, that its conclusion is necessary too. In his discussion of\nthis argument Grosseteste focuses on premises formulated in terms of\nGod’s knowledge, but he clearly thinks that a range of arguments\nhaving the same form can be constructed, employing in their initial\npart not only premises about God’s knowledge, but also premises\nformulated in terms of prophecy or even just past-tensed truths of the\nform “It was the case that A will exist.”  \n Grosseteste’s appeal to the principle that entailment transmits\nnecessity from the premises to the conclusions of a valid inference is\na striking feature of the kind of argument he considers.  This\nprinciple forms the focus of much of Grosseteste’s discussion of the\nargument: “It would seem,” he notes, “that the only reply that we can give to the [arguments] stated above … is to say that what is contingent does indeed follow from things that are necessary” (Lewis 2017,\n129).  But in the final analysis Grossetete does not reject the\nprinciple; he holds that entailment does indeed transmit necessity\nfrom premises to conclusion: “By syllogistic inference, then, what is necessary follows from necessary antecedents with the kind of necessity possessed by the antecedents, and the conclusion, like the antecedents, has truth that cannot cease in the future and from which it cannot be altered.” (Lewis 2017, 139).\n Grosseteste’s response to such arguments is to grant that they in\nfact are sound and do indeed prove the necessity of true propositions\nabout future acts.  But he challenges the further conclusion drawn\nfrom them that if a proposition about a future act is necessary in the\nsense proved by such arguments, the act cannot really be a free\nact. Instead, Grosseteste takes the kind of necessity involved in such\narguments to be compatible with freedom. His strategy is to hold that\nthe freedom of future acts is incompatible only with a different kind\nof necessity, and that such arguments fail when formulated in terms of\nthis conception of necessity, since their premises and conclusions are\ncontingent in the correlative sense of contingency.\n Grosseteste’s response to the conflict between divine\nforeknowledge and free decision and related arguments therefore has\ntwo parts: first, the claim that there is a distinct family of modal\nnotions in respect of which future events and true propositions about\nthem may be contingent; second, the claim that freedom requires only\nthis kind of contingency.  Unfortunately Grosseteste has little to say\nin support of this second claim, but his introduction of a distinct\nfamily of modal notions is of philosophical interest in its own right,\nas it marks an important stage in the development of modal theory.\n8.  Modality and God’s Power\nWhen Grosseteste wrote On Free Decision modal concepts were\ntypically understood in terms of the notion of change and thus of\ntime. Thus, Grosseteste speaks of a necessary proposition, in this\nsense, as one that is true and cannot become false, or as one\nwhose truth is unable to cease to be. A contingent proposition\ncan change its truth value; a possible proposition, if false, can\nbecome true, and an impossible proposition is false and cannot become\ntrue. Conceptions of modality along these lines were sometimes\ndescribed as per accidens conceptions, since in many cases a\nproposition’s modal status could change with the passage of time; its\nmodal status, as it were, happens to or is incidental to it\n(accidit).  “Caesar crossed the Rubicon,” for\nexample, was once false and not necessary, but became true and\nnecessary, because unable to become false, after Caesar crossed the\nRubicon. Indeed, true propositions about the past were the standard\nexamples of propositions necessary in the sense that their truth\ncannot cease. \nGrosseteste holds that true propositions about the present may well\nbe contingent on this conception of contingency, since they can become\nfalse; he gives “Socrates is pale” as an example (Lewis\n2017, 41).  But he holds that all true propositions about the future\nare necessary.  It might be thought that this is incorrect, since it\nis not hard to think of cases in which a true proposition about the\nfuture becomes false after the occurrence of an event it predicts.\nBut closer inspection reveals that Grosseteste thinks that true\npropositions about the future are necessary because they cannot become\nfalse prior to the obtaining of the state of affairs they are\nabout; he has a limited unchangeability of truth in mind.\nGrosseteste does not reject this conception of per accidens\nmodalities.  Rather, he introduces another family of modal notions\nunconnected to considerations of time or change, a family of\nnon-temporal modal notions. And he holds that many true propositions\nabout the future, including those about future free acts, are\ncontingent in the sense of contingency belonging to this family, as\nindeed also are true propositions regarding God’s knowledge of those\nacts, past prophecies of them or even statements to the effect that it\nwas the case that the acts would occur.  Ideas along these lines, we\nmay note, were not original to Grosseteste; they are implicit\nin some of his predecessors, such as Peter Lombard, whom\nGrosseteste cites. But they, unlike Grosseteste, had not attempted to\nwork out in any detail a theory of modality severing a link\nwith considerations of time and change (the twelfth-century thinker,\nPeter Abelard, is an exception, but his theory of non-temporal\nmodality, which takes as its central notion that of a thing’s nature,\nis very different from Grosseteste’s and had little\ninfluence). Thinkers after Grosseteste, such as Duns Scotus, developed\naccounts of non-temporal modality in even more detail that share\nelements found in Grosseteste’s account and were perhaps influenced by\nit (see Lewis 1996).\nThe guiding idea behind Grosseteste’s approach to a notion of\nnon-temporal contingency is that even if a proposition such as\n“Antichrist will exist” (to use his standard example of a\ntrue, future contingent proposition) is true now and cannot become\nfalse until Antichrist comes into existence, the world might\nnevertheless have been such that “Antichrist will exist”\nwas never true.  A present-day thinker might spell this idea out in\nterms of alternative possible worlds, but Grosseteste spells it out in\nterms of the notion of a proposition’s eternal power or capacity for truth or\nfalsity without beginning, and grounds such powers ultimately in God’s\neternal power to know or will propositions.\nGrosseteste’s discussion of non-temporal modalities and their\nrelation to God’s power is most fully set out in the earlier\nrecension of On Free Decision.  Focusing on necessity, he\nwrites that “something is called necessary in that it has no\ncapacity, either not to be, or not to have been, or not to be going to\nbe. [The dictum] ‘that two and three are five’ is\nnecessary in this sense, because it has no capacity not to be true in\nthe present, or in the future, or in the past, or ever, be it with or\nwithout a beginning” (Lewis 2017, 39,41). He goes on to describe\nthe corresponding notion of contingency as a matter of a\nproposition’s having “a capacity for being true and being\nfalse without a beginning.” What is necessary in this sense\nutterly lacks a power to be false. What is contingent, in the\ncorresponding sense, could have had from the beginning a different\ntruth-value, though it may well lack a power to change its truth-value\nfrom that which it actually has. Grosseteste holds that this kind of\ncontingency of propositions about future events or things implies that\nthe things or events the proposition is about may themselves be called\ncontingent, and that this kind of contingency is sufficient for the\nfreedom of our future acts.\nMuch of Grosseteste’s account of modality is concerned with\ndifficulties posed by the notion of the eternal power of a proposition\nto be true or false without beginning. He seems to hold such powers to\nbe possessed not in time, but in eternity. He notes that God too has\neternal powers, namely to know or will without beginning, and that the\ndifficulties confronting the eternal powers of propositions also\nconfront the eternal powers of God. In fact, Grosseteste explains the\neternal powers of propositions in terms of God’s eternal powers\nto know and will propositions, effectively grounding non-temporal\nmodality in God’s powers or lack thereof (in the case of\nnecessity and impossibility). He notes, for example, that “the\neternal capacity for [the dictum] ‘that Antichrist was\ngoing to exist’ to have had truth and not to have had truth\nwithout a beginning is nothing but the capacity of God by which God\nwas able from eternity and without a beginning to will or not to will\nthat Antichrist will exist, or to know or not to know that Antichrist\nwill exist” (Lewis 2017, 55).\n The difficulties facing the notion of eternal powers stem from the\nidea that there are unexercised but nonetheless genuine eternal\npowers, as Grosseteste’s account of non-temporal contingency seems to\nrequire.  Put in terms of God’s powers to know or will, one problem is\nwhat it could mean to say that God could have not known or\nwilled what he in fact knows or wills (or the converse), as is\nimplied, Grosseteste thinks, by the doctrine that God has the power to\nnot know or not will what he knows or wills.  For “could\nhave” expresses the priority of power to act, the idea that\nprior to God’s willing that p, he had a power not to will that p. But\nGod is not in time and thus “could have” cannot express a\ntemporal priority of God’s power to its act.  Grosseteste’s solution\nto this problem is to hold that it expresses a so-called causal\npriority, a notion he drew from Eriugena (Grosseteste prefers not to\ncall it a natural priority since there is no distinction of natures\ninvolved in God’s power and act) (see Lewis 1996).\n The notion of unexercised eternal powers also faces the difficulty\nthat unexercised powers appear to be powers for future acts and, if\ngenuine, can be exercised in the future.  But how could a timeless\nbeing, as God is, exercise at a future time his power to know or will\nwhat he in fact does not know or will; indeed, are not such powers\ndescribed as powers to know or will without beginning? Such\nan attribution of power to God therefore seems to be empty\n(frustra).  The problem Grosseteste confronts here is central\nto anyone who, like him, takes God to be timeless and yet to have\npowers to do what he does not do, and it is to Grosseteste’s credit\nthat he puts the problem squarely on the table. His solution appeals\nto the idea that God’s powers to know or will are rational powers,\npowers that can be exercised in more than one way (the concept of a\nrational power is drawn from Aristotle).  Thus the power to know that\np is the same as the power to not-know that p. But\ngiven such a conception of power, if God knows that p, then\nhis power to not-know that p is ipso facto\nexercised, since it is the very same power as the power to know that\np. So there are no unexercised powers in God after\nall. Thomas Bradwardine noted in criticism of this account that a more\nplausible requirement on exercisability is that if an agent has a\npower to know that p and does not know that p, then\nhe can exercise that power by knowing that p.  Grosseteste\nhas no reply to this objection; its answer would require a more\nthoroughgoing examination of the relation of power to time and change\nthan Grosseteste gives (see Lewis 1996).\n9. Free Decision and Freedom of the Will\nEarly thirteenth-century accounts of human action and the freedom\nit involves focus on the notion of free decision (liberum\narbitrium).  This term, a legacy of Roman law and patristic\nthinkers, has no present-day counterpart, and even to thinkers in\nGrosseteste’s day its sense was unclear and stood in need of\ndetermination.  But if the notion of free decision itself is now of\nmerely antiquarian interest, accounts of free decision are nonetheless\nimportant for the insight they provide into their authors’\nunderstanding of human action and freedom, issues of perennial\nphilosophical concern. (On Grosseteste’s theory of free decision see Lewis 2013, 2017, and Pickavé 2017.)\nThe expression “free decision” was understood to refer\nnot only, as its grammar as a concrete term suggests, to a certain\nkind of act, but also to the capacity or capacities whose exercise\nsuch an act involves. The word “decision” was standardly\ntaken to involve a reference to reason and “free” a\nreference to the will. Thus, it was often asked whether “free\ndecision” refers to an act of reason or of the will, and whether\nthe capacities that such an act involves are reason or will, either\nalone or in combination, or possibly other capacities besides\nthese.\n According to Grosseteste in On Free Decision, “free\ndecision” in its concrete usage refers to a decision, a certain\nkind of act of reason. This act, like any other act of reason, is not\nitself free, but is said to be free in a derivative sense because it\nis an act providing direction to the will, whose acts are free. (Talk\nof will and reason or their acts as free or not is common in medieval\nthinkers, but is perhaps a mere manner of speaking, when what is\nintended is that the agent’s exercise of reason or will is done freely\nor not.) Reason has the task of distinguishing between good and bad,\nbetter and worse, and of proposing to the will what it should choose\nor reject.  The will by nature chooses or rejects after receiving such\na directive from reason, but is free not to implement reason’s\ndecision and choose or reject otherwise than reason has\npronounced. This freedom is why the decision is, in a derivative\nsense, said to be a free decision.  In proposing this view,\nGrosseteste indicates that he takes the choices made by the will not\nto be psychologically determined by reason: reason provides the will\nwith advice, not necessity. \n Grosseteste takes the capacities underlying free decision to be\nreason and will, which he identifies with aspectus and\naffectus respectively. He holds, perhaps under the influence of the Pseudo-Augustinian De spiritu et anima’s teaching of the simplicity of the soul, that these\ncapacities are at root one, but this one capacity can be exercised in\none way through a decision, and in another through a choice.\n Since Grosseteste holds that a decision is said to be free because\nit provides direction to the free will, as we might expect he takes\nthe freedom of decision (libertas arbitrii) to be the freedom\nof the will itself.  But what, exactly, is the nature of this freedom?\nIt is common to think that the freedom of the will is the will’s\ncapacity to will alternatives, or considered post factum, to\nhave willed otherwise than it did. Grosseteste and his contemporaries\nspeak in this connection of a flexibilitas or \nvertibilitas of the will. The importance of Grosseteste’s account\nof the freedom of the will lies in the fact he is one of the few\nthinkers in his day to hold that the freedom of the will is indeed to\nbe defined as a capacity to will alternatives. Many of his most\nimportant contemporaries, in contrast, explicitly reject such a\nconception. They understand the pertinent alternatives to be moral\ngood and evil, and point out the standard teaching that some agents\nwith freedom of the will (God and the angels confirmed in good) simply\ncannot will moral evil, whereas others (Satan and his cohorts) cannot\nwill moral good. Thus, they conclude that the freedom of the will\ncannot be defined as a capacity to turn between alternatives, and\ninstead present alternative definitions of freedom—some, for\nexample, define the will’s freedom as its inability to be compelled.\nGrosseteste saw that their rejection of a definition of freedom in\nterms of a capacity to will alternatives rested on the assumption that\nthe alternatives in question must be moral good and evil.  He rejected\nthis assumption and instead held that the freedom of the will is the\nwill’s capacity to turn between what he calls “bare opposites\nconsidered in themselves.”  Though Grosseteste provides little detail\nabout the notion of a “bare opposite”, it is clearly to be understood\nby reference to his view, as propounded in On Free Decision,\nthat the moral goodness or evil of an act is a matter of its relation\nto God’s will.  Considered in themselves in independence of their\nrelation to God’s will, as “bare” acts, acts are morally\nindifferent. \n Thus, the freedom of the will is the will’s capacity to will, or\nmore particularly, choose alternatives in the sense of morally\nindifferent alternatives. This is not to say that the objects of\nchoice are considered as neither good nor bad; Grosseteste believes\nthat one can only choose what one takes to be good. Rather, the notion\nof goodness involved in the choice of bare opposites is not the notion\nof moral goodness. Grosseteste describes it as natural goodness, but\nsays very little about it.  Given his views about the\nnon-determination of the will by reason, he would seem to think that\nan agent who is choosing among natural goods can choose contrary to\nreason’s dictate as to which of these is the best option or the one\nthat should be chosen, or can at least refrain from making a choice in line with reason’s dictate.\n According to Grosseteste, this capacity to choose morally\nindifferent alternatives underlies our capacity for moral choice when\nit is present, though he provides little explanation of how it does\nso. He holds that human beings cannot choose moral good without the\nassistance of God’s grace, but he does not discuss just how that\nassistance, combined with the aforementioned freedom, helps to make\nmoral choice possible. Possibly he thinks that God’s grace makes it\npossible for the fact that something is willed by God, and thus is\nmorally good, to serve as a reason one has for choosing it.  In any\nevent, he makes it clear that the capacity to choose moral good is not\nintrinsic to possession of reason and will; otherwise the aid of grace\nwould not be needed.  Likewise, the capacity to choose moral evil is\nmade possible by a feature that is not intrinsic to possession of\nreason and will, since God, who has reason and will, cannot choose\nmoral evil. Rather, in ways not explained, the creature’s capacity to\nchoose moral evil is due to the fact, as Augustine too had held, that\nthe creature is created from nothing, an inherent and unavoidable\ndefect in any creature. In those confirmed in good, however, God has\nso made it that this capacity cannot be exercised, and so they are\nincapable of making an evil moral choice.\nIt is now common to distinguish accounts of free will that take some sort of ability to do otherwise as key to freedom from those that emphasize self-determination (see the entry, Free will). Grosseteste’s theory as described above would seem to belong to the former class, and this conclusion is also indicated by arguments he gives for the existence of free decision, which point to a wide range of phenomena regarding which we believe that the agent could have done otherwise. Even so, there is some indication of a deeper self-determination account. For Grosseteste holds that the will’s capacity for opposites itself is contained in its power to will and move itself (Lewis, 2017, 255). Thus Grosseteste sees the will as a self-mover. Unfortunately, he leaves this issue unexplored, including it at the end of his treatise among a list of topics to be considered on another occasion.\n10. Exemplarism, Truth and Illumination\n10.1 Exemplarism\n Grosseteste’s exemplarism (see Lynch 1941) is in part an\nadaptation of Plato’s theory of Ideas to a Christian framework. Like\nother medieval thinkers, Grosseteste takes the existence of an\neternal, self-subsistent realm of Platonic Ideas to be inconsistent\nwith the dependence of all things on God.  Nevertheless, following\nAugustine and Seneca, he does not reject the Platonic ideas\noutright. Rather, he treats them as eternal models (exempla)\nor, as he also calls them, reasons (rationes) of things in\nGod’s mind. Like the Platonic ideas, these reasons function as\nparadigms or models created things can accord with or fall short of.\nGod looks to these reasons of things in creation, somewhat as a\ncraftsman looks to the idea in his mind of what he is to make. \n Given that God is absolutely simple, the reasons of things in\nGod’s mind must in the final analysis be identified with God. Thus\nGrosseteste moves between speaking of the reasons in God’s mind as\nexemplars or models and speaking of God himself as such. Indeed, he\ndescribes God, following Augustine in the Confessions and\nDe libero arbitrio, as first form, noting expressly that he\nis not using the notion of form in this connection in Aristotle’s\nsense as what enters into a form-matter composite (as the first form\ncorporeity does) (Luard 1861, 4; Goering and Mantello 2010, 38). In On the Halt of Causes he\nidentifies the first form, God, with “the form that is both a model\nand that in virtue of which a thing is” and notes that this form “is\nnot conjoined with a thing but exists on its own, simple and\nseparate. This is the first form, and how it is the first form is hard\nto explain” (Baur 1912, 125).\n10.2 Truth\n Grosseteste wrote in a tradition that employed the concept of\ntruth in a number of different contexts. We may speak not only of the\ntruth of propositions or thoughts, but also of things—e.g. of\na tree or a human being—and God himself or the eternal Word is\nidentified with truth. In his treatise On Truth Grosseteste\ntakes up the question, raised by Anselm, whether there is just one\ntruth (veritas), God, or many truths (veritates).\nBut much of his account is concerned to present a uniform conception\nof truth that embraces these different applications of the term noted\nabove. The doctrine of eternal exemplar forms plays an important role\nin this account.\n According to Grosseteste’s treatise On Truth, truth is\nthe conformity or adequation of things and speech, or more\nparticularly, the thought expressed by speech.  This conception of\ntruth as adequation had only recently entered the Latin West, but\nGrosseteste gives it a twist all his own, taking the speech in\nquestion to be that of God, the eternal Word. Thus truth\n(veritas) is a conformity between things and the eternal\nWord. Grosseteste claims that the eternal Word is itself its very own\nconformity to itself and thus may be identified with truth. As for\ncreated things, their truth is their conformity to their eternal model\nor reason in the eternal Word. Likewise, the truth of \npropositions—a subclass of things—is their conformity to their\neternal model or reason in the eternal Word. This, on first\nappearance, would appear to clash with the idea that a proposition’s\ntruth is not its conformity to anything in God, but rather to the\nstate of affairs in the world whose obtaining it asserts; but this\nappearance is deceptive.  A thing’s conformity to its eternal reason,\nits truth, is its having the being its exemplar specifies. Now,\nGrosseteste holds that created items have two kinds of being or\nperfection. In his commentary on the Posterior Analytics he\nholds that the second perfection of a thing is “the completion of the\nactivity of the thing to which it has, as such, been established to be\nfitted and for the sake of which it has been established” (Rossi 1981,\n240).  The first being of a thing is its simply being the kind of\nthing it is.  Thus, there is a twofold conformity possible of things\nto their eternal reasons. On the one hand, the eternal reason of a\nthing specifies the very kind of thing that thing is, and simply in\nvirtue of existing as an item of a determinate kind a thing will\nnecessarily conform to its exemplar in this respect and be true. Thus\nall human beings and all propositions are true, in this sense, in that\nthey are the kinds of things they are, this being specified by their\nexemplar. A human being is a composite of body and soul, and a\nproposition is “the statement of one thing about another or one thing\nfrom another” (Baur 1912, 143). On the other hand, the eternal reason\nspecifies the second perfection a thing ought to have but may\nnonetheless lack. In this sense a human being will be a false human\nbeing if, for example, she is vicious, falling short of the perfection\nof virtue specified in the eternal reason of a human being. Likewise,\na proposition will be a false proposition if it fails to perform the\nfunction of a proposition, this being to state things as they in fact\nare in the world.  Thus, the ordinary notion of propositional truth,\ndescribed by Aristotle as “to so be in the thing signified as speech\nsays,” is a matter of a proposition’s conformity, in respect of second\nbeing, to its eternal reason, and this is for it to perform the\nfunction perfective of propositions, namely, to be in conformity to\nthe states of affairs it asserts.\n With this account of truth Grosseteste thinks he can accommodate\nwithin one schema the divergent conceptions of truth present in his\nday. As to the initial question he drew from Anselm, whether there is\njust one truth or many, diverging from Anselm, who posits a single truth, he holds that there are many truths\n(veritates), for otherwise the term “truth” could\nnot admit a plural or be distributed (by which he means we\ncould not speak of “every truth”) (for the relation between Anselm’s and Grosseteste’s accounts of truth, see Noone 2010).  Nevertheless, he concludes that\n“there is a single truth that the name ‘truth’ everywhere\nsignifies and predicates—namely, the supreme\ntruth—though this one truth is called many truths in the many\ntruths of things” (Baur 1912, 139).  Thus, for Grosseteste any use of\nthe term “truth” involves in some way a reference to the supreme\ntruth, God.\n10.3  Illumination\nUnder Augustine’s influence Grosseteste subscribes to an\nilluminationist account of human knowledge, according to which human\nknowledge is understood by analogy to bodily vision: as a body can\nonly be seen if light is shed on it and the eyes, so something can\nonly be known if a spiritual light is shed on it and the mind’s\neye. Grosseteste presents versions of such an account in his\ntreatise On Truth and in his commentary on the Posterior\nAnalytics.\nIn On Truth Grosseteste presents an illuminationist theory\nof knowledge after outlining his theory of truth. Because created\ntruth is a conformity between things and their eternal reasons, we can\nonly know created truth if we know that a created thing conforms to\nits eternal reason in God. But as we can only see a body as colored if\nan external light is shed on its color, rendering it actually visible\nto us, so in order for us to see a created thing as true, an external\nlight must be shed on its truth, rendering it actually visible to\nus. This truth is the adequation of the thing and its eternal reason\nin God’s mind, and thus an external light, the light of the Supreme\nTruth, God, must be shed on both the thing and its eternal reason if\nit is to be visible to the mind. Grosseteste hastens to point out that\nthis doesn’t require that the knower see God himself or even be aware\nof God, for only the pure of heart see God as he is in himself in the\nface-to-face vision of God. All the same, all who know truth must in\nsome way have at least an unwitting cognition of the Supreme Truth and\nits light, and in it a vision of the eternal reasons, that falls short\nof the direct vision of God.\nGrosseteste makes no reference to Aristotle’s views on knowledge\nin On Truth but draws on Augustine and Anselm. But in the\ncommentary on the Posterior Analytics, which appears to be\nthe earlier of the two works, he relates an illuminationist conception\nof knowledge to Aristotle’s account of scientific knowledge. Scholars\ndisagree, however, regarding Grosseteste’s intentions in this\nregard. Some (Gilson 1926–7, Lynch 1941, McEvoy 1982) take his\ntreatment of Aristotle’s account of scientific knowledge to accord no\nrole to Aristotle’s notion of abstraction, in whose place Grosseteste\ninstead employs an Augustinian conception of divine\nillumination. Others (Marrone 1983), treating On Truth as the\nearlier work, take Grosseteste now to reject an account of divine\nillumination in our knowledge in this life and hold his references to\nillumination in the context of scientific knowledge to refer to a\nlight the human soul itself sheds on intelligible things in a process\nof abstraction understood along Aristotle’s lines. The truth, however,\nas Van Dyke 2009 argues, seems to be that Grosseteste is concerned to\nsubsume Aristotle’s account of scientific knowledge under a broader\naccount of cognition in which divine illumination plays a crucial role\nin all cognition, while at the same time he endorses the account of\nscientific knowledge and abstraction presented in the Posterior\nAnalytics. The following remarks briefly examine some aspects of\nthis attempt. (For further discussion and more technical aspects of\nGrosseteste’s account of demonstrative science, see the entry on\nMedieval Theories of Demonstration, as well as Crombie 1953, Evans 1983, Laird\n1987, Longeway 2007, McEvoy 1982, Marrone 1983, 1986, Rossi 1995, Serene 1979, Van\nDyke 2009 and 2010, and Wallace 1972.)\nThe Posterior Analytics is concerned to provide an account\nof scientia or “scientific knowledge.” By this is\nmeant not scientific knowledge in the modern sense of a body of theory\nbased on the experimental testing of hypotheses, but rather an\nunderstanding of the reason why a given fact obtains\n(knowledge propter quid), as opposed to knowledge simply that\nthe fact does obtain (knowledge quia), what might be\ndescribed as a certain kind of explanatory knowledge. An Aristotelian\nscience is a systematization of such knowledge based on the structure\nof Euclid’s axiomatic geometry and employing Aristotle’s syllogistic\nlogic. One arrives at scientia of a given fact by deriving it\nas the conclusion of a syllogism whose premises meets certain\nstringent conditions that render them explanatory of that fact. As\nGrosseteste puts it, the premises or principles–i.e., starting\npoints–of such a syllogism must be true, immediate, prior and\nbetter known than the conclusion, must state causes, be necessary,\nconcern essential connections, be universal, everlasting, and\nincorruptible. A syllogism that meets these conditions is called a\ndemonstrative syllogism or demonstration and will provide explanatory\nknowledge of its conclusion. At one point Grosseteste states that only\nmathematics is comprised of demonstrations in this strict sense,\nthough in another passage he suggests that theology would most fully\nmeet these conditions, apparently meaning that the demonstrative\nknowledge possible for us in this life (mathematics) is to be\ndistinguished from that which is possible in the afterlife\n(theology). The sciences of natural phenomena do not, Grosseteste\nclaims, fully meet the requirements for a fully demonstrative science,\nthough if we relax the conditions governing demonstrations somewhat we\nmay speak of a demonstrative science of natural phenomena (see the\nentry on Medieval Theories of Demonstration for details).\nAccording to Grosseteste, the Posterior Analytics is not\nconcerned to provide a method for arriving at demonstrations but\nrather to provide criteria to evaluate whether a given syllogism\ncounts as a demonstration. Nevertheless, Aristotle does discuss the\nsource of the principles and definitions employed in demonstrations,\nand it is in considering these remarks, in particular, that\nGrosseteste introduces the ideas of mental vision and the illumination\nof the mind.\nAccording to Aristotle, it is from sense experience that we obtain\nthe universal concepts and principles of a science. Thus, if someone\nlacks a sense, he will also lack the scientific knowledge involving\nthe concepts and principles derived from exercise of that sense. But\nGrosseteste holds that God and the intelligences (i.e., angels) know\nwithout reliance on the senses, and the intellective power, the\nhighest part of the human soul, relies on no bodily sense or organ in\nits proper operation. Instead, its proper operation involves a mental\nvision in which one arrives at knowledge of things by viewing their\nexemplar forms or reasons in an irradiation received from God or an\nintelligence.\nGrosseteste reconciles this doctrine with Aristotle’s teachings by\nholding that with rare exceptions most individuals in the present life\ndo not have knowledge of this sort; their intellective power is\n“sick” and unable to perform its proper operation. In the\npresent life the highest form of knowledge possible for most human\nbeings is Aristotelian demonstrative science, and for this sense\nexperience is indeed required.\nThis might suggest that Grosseteste reserves the notion of mental\nillumination simply for the proper operation of the intellective part\nof the soul. But this is not so. Mental vision and an illumination of\nthe mind are involved even in the operation of our rational power in\ndemonstrative science.\nAlluding to Wisdom 9: 15, Grosseteste holds the\nintellective power is sick because it is darkened and weighed down by\nthe corrupt body. He intimates that human beings are born in this\ncondition, presumably as a consequence of the fall. He likens this\ndarkening of the mind to a cloudy day: as bodily vision is darkened by\nclouds, so the operation of the cognitive powers is darkened by bodily\nappearances (phantasmata), which obstruct our mental vision\nand render it unable to see intelligible items in their purity. This\ndarkening of the mind, Grosseteste holds, is the source of all\nerror. In grasping the principles of demonstration, reason is\nstimulated to leave this darkness. In a newborn human being the powers\nof the rational soul are as if asleep and unable to act. But sense\nexperience in some way involves reason, and through repeated sense\nexperience reason is woken up and carried by the senses to perceptible\nthings. Reason then begins to distinguish and view apart the features\nconfused in sense experience, thereby formulating universal\nconcepts. Repeated experience of correlated perceptible phenomena\nleads the senses to estimate an imperceptible relationship between\nthem—a causal connection, for example. This too awakens reason\nand leads it to wonder whether this connection in fact\nobtains. Grosseteste uses an example, drawn from Avicenna, of the\nclaim that scammony of itself causes the discharge of red\nbile. Wondering whether this is true, we set up what we should now\ncall a controlled experiment in which we exclude other known causes of\nthe discharge of red bile and give someone scammony to see what will\nhappen. And in this way, Grosseteste writes, we arrive “from\nsense at an observational (experimentale) universal\nprinciple” (Rossi 1981, 215).\nGrosseteste describes this as the process in which the mind is\nstimulated on the occasion of sense experience to seek and find its\nown light—to turn from corruptible corporeal objects to\nintelligible things. The mind moves out of the darkness it is in to\nfind a trace of its light, which stands to it as the sun stands to the\neyes in bodily vision. As he puts it in discussing certainty,\n“there is a spiritual light shed on intelligible things and the\nmind’s eye, and this light is related to the inner eye and\nintelligible things in the way the bodily sun is related to bodily\neyes and visible bodily things” (Rossi 1981,\n240–241). Understanding (intellectus) and demonstrative\nknowledge are “like the vision of healthy eyes through the\nmedium of pure air with clear light spread over the colored\nobject…Understanding and demonstrative knowledge apprehend\nthings in the purity of their essence, as they are in\nthemselves” (Rossi 1981, 279–280).\nThese remarks indicate that for Grosseteste some sort of spiritual\nlight and vision is involved in scientific knowledge, but they also\nstrongly suggest that Grosseteste is wedded to an Aristotelian account\nin which the human mind abstracts intelligible items from the data of\nsense. These intelligible items would appear to be the genera and\nspecies of created things, viewed as immanent Aristotelian universals,\nthe second lowest level of a hierarchy of universals Grosseteste sets\nout in the commentary, the highest being the reasons of things in the\ndivine mind. But what exactly is the nature of the vision and\nillumination involved in scientific knowledge? In particular, in his\naccount of demonstrative science, and thus of the sort of knowledge\npossible for most of us in this life, is Grosseteste employing a\nnotion of divine illumination, as he clearly does in his\ntreatise On Truth?\nMarrone 1983, ch. 6, suggests he is not: the light Grosseteste\nmentions is a light, he thinks, that the mind itself sheds on items to\nrender them intelligible and the notions of light and vision play no\nessential role in Grosseteste’s understanding of Aristotelian science:\nthe commentary displays a movement away from the conception of\nknowledge in On Truth in terms of divine illumination towards\na purely naturalistic conception of knowledge. But this view\npresupposes the implausible chronology according to which On\nTruth was written before the commentary and, as van Dyke 2009\npoints out, fits poorly with Grosseteste’s analogy between the light\ninvolved in scientific knowledge and the light shed by the sun in\nbodily vision, which comes from a source apart from the\nsenses. So too, it seems, the light involved in scientific knowledge\nis a light that a source apart from the mind, namely God (or possibly\nan intelligence), sheds on objects of scientific knowledge so as to\nrender them actually intelligible, in the way the light the sun sheds\non bodies makes them actually visible. \n11.  Scientific Method\nGrosseteste’s numerous short scientific works made no significant\ncontribution to scientific theory. Yet it has been argued that\nGrosseteste played a key role in the development of scientific\nmethod.  In particular, Crombie 1955 (a summary of Crombie\n1953) has claimed (1) that Grosseteste was the first in the Latin West\nto develop an account of an experimental method in science (98); (2)\nthat he “seems to have been the first writer to make systematic\nuse of a method of experimental verification and falsification”\n(107); (3) that he gave a “special importance to mathematics in\nattempting to provide scientific explanations of the physical\nworld” (111).  These claims have been the subject of\nconsiderable debate. \n The claim that Grosseteste developed an account of experimental\nmethod in science puts great weight on the aforementioned passage in\nwhich Grosseteste describes a controlled experiment to see whether\nscammony causes the discharge of red bile.  There can be little doubt\nthat Grosseteste does indeed have in mind the idea of a controlled\nexperiment. The question, however, is whether Grosseteste makes the\nnotion of controlled experiment part of a general account of a\nscientific method for arriving at the principles of demonstrative\nscience. The evidence that he does so is not strong. The discussion of\nscammony is the only reference to controlled experiment in his\nwritings, and when Grosseteste refers back to this discussion later in\nthe commentary as explaining how we come to acquire experiential\nprinciples, the notion of controlled experiment is sometimes\ninapplicable—as for example, regarding our knowledge of\nthe cause of an eclipse. Moreover, Grosseteste is quite prepared to\ngrant that in some cases we can know causal connections after only a\nsingle perception (see Marrone 1986).  On balance, we may say that\nGrosseteste did employ the notion of controlled\nexperiment and related it to demonstrative science, but he hardly set\nit up as the method by which such knowledge is to be obtained; it is\none among many ways of arriving at such knowledge and is not accorded\nthe emphasis it has been given in scholarly commentary.\n As for Grosseteste’s actual practice in his scientific writings,\nif by an experimental method is meant a method of controlled\nexperiment, then it must be said that Grosseteste makes no use of such\na method in these writings. He arrives at his conclusions in his\nscientific writings on the basis of a mix of considerations.  He\nappeals to authority and everyday observation (“experimentum”\nin Latin) and makes use of thought experiments and certain\nmetaphysical assumptions, such as that “every operation of\nnature occurs in the most finite, ordered, shortest and best way\npossible for it” (Baur 1912, 75). Nowhere does he describe a\ncontrolled experiment as the basis of his conclusions (see Eastwood\n1968, regarding Grosseteste’s works in optics). We may grant that\nGrossetete does cite empirical observation as one factor among others\nwhen he assesses the adequacy of certain accounts of natural\nphenomena, but this is far from employing a method of experimental\nverification and falsification in the sense of a controlled\nexperiment.\n The claim that Grosseteste gave a “special importance to\nmathematics in attempting to provide scientific explanations of the\nphysical world” is on a stronger footing. In the opening of the\ntreatise On Lines, Angles and Figures Grosseteste remarks\nthat “the consideration of lines, angles and figures is of the\ngreatest utility since it is impossible for natural philosophy to be\nknown without them …. All causes of natural effects have to be\ngiven through lines, angles and figures, for otherwise it is\nimpossible for the reason why (propter quid) to be known in\nthem” (Baur 1912, 59–60).  In the treatise, On the Nature of\nPlaces, which is a continuation of On Lines, Angles and\nFigures, Grosseteste sums up the preceding text with the remark\nthat “the diligent investigator of natural phenomena can give\nthe causes of all natural effects, therefore, in this way by the rules\nand roots and foundations given from the power of geometry”\n(Baur 1912, 65). Undoubtedly, then, Grosseteste saw a key role for\ngeometry in the explanation of natural phenomena. \n At the basis of this view was Grosseteste’s view that natural\nagents act by the multiplication of their power or species, a view\nRoger Bacon was to develop in detail.  Grosseteste was, of course,\nthinking of the action of light. He holds that knowledge propter\nquid must be through angles, lines and figures because a\n“natural agent multiplies its power from itself to what it acts\nupon, whether it act upon the senses or upon matter” (Baur 1912,\n60).  Grosseteste holds that the intensity of operation of the natural\nagent will be a matter of its distance from what it acts upon, the\nangle at which it strikes it, and the figure in which it multiplies\nits operation, this being either a sphere or cone. He establishes\ncertain rudimentary rules to this effect, such as that the shorter the\ndistance, the stronger the operation. \nThe remarks above should not blind us to the fact that Grosseteste\nwas deeply concerned with the detailed investigation of natural\nphenomena.  It was the inspiration of this attitude of mind, together\nwith Grosseteste’s emphasis on the importance of mathematics, that was\nperhaps his chief legacy to thinkers in fourteenth-century Oxford who\nwere developing the beginnings of a mathematical physics.\n12. Influence\nBy the fourteenth century, Grosseteste had achieved the unusual\nstatus of being an authoritative figure for Oxford\nthinkers—someone from whose writings quotations might be\nmarshalled, on the strength of his name, in defense of one’s\nviews. Thus, both Thomas Bradwardine and Thomas Buckingham appeal to\nGrosseteste in support of their conflicting views on future\ncontingency. John Wyclif likewise appeals to Grosseteste as a fellow\ntraveller in support of his views on the continuum, among other\nissues, ranking him with Plato, Democritus and Augustine as one of the\ngreatest of thinkers. Such appeals are signs of the reverence with\nwhich Grosseteste was held in fourteenth-century Oxford.  \nThe influence of specific ideas of Grosseteste’s may be found in\nnumerous thinkers, especially those who flourished at Oxford. Their\nnumber includes Adam of Wodeham, John Wyclif, Robert Kilwardby, Thomas Bradwardine, Thomas Buckingham, Thomas of York, Walter Burley, William of Alnwick, William of Ockham, and others. But his greatest influence as\na philosopher, if we leave aside his commentary on the Posterior analytics, was perhaps as a source of ideas for thinkers\nflourishing in the first half of the thirteenth century. In\nparticular, Richard Rufus of Cornwall makes extensive use of\nGrosseteste’s writings in his large Scriptum on Aristotle’s\nMetaphysics and his Oxford commentary on the Sentences\nof Peter Lombard, as does his Oxford contemporary Richard Fishacre in\nhis commentary on the Sentences. These thinkers were heavily\ninfluenced by Grosseteste’s On Free Decision as well as by his\nwritings on the eternity of the world. Rufus also praises\nGrosseteste’s scientific and mathematical expertise, as does Roger\nBacon, a man by temperament more given to scorn than praise.\nGrosseteste’s philosophical influence on the Continent appears to\nhave been largely as a scholar of Aristotle. His commentary on the\nPosterior Analytics achieved renown across the Continent and\nwas used throughout the middle ages (for its influence in Britain see Rossi 2012), and the same was true of his\ntranslation of the Ethics.  Indeed, these two pieces of\nAristotelian scholarship alone would have sufficed to acquire for\nGrossetete an important place in the history of medieval thought. One exception, however, is the fourteenth-century French thinker, Nicole Oresme, who makes use of a number of Grosseteste’s philosophical and scientific writings in his works, most notably in his Questiones super Physicam.\n",
    "bibliography": {
        "categories": [
            "<a name=\"Bibs\">Bibliographies</a>",
            "<a name=\"BioStu\">Biographical Studies</a>",
            "<a name=\"PriTexLat\">Primary Texts in Latin</a>",
            "<a name=\"PriTexEngTra\">Primary Texts in English Translation</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"Bibs\">Bibliographies</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Gieben, Servus, 1962, “Bibliographia universa Roberti\nGrosseteste ab anno 1473 ad annum 1969,” <em>Collectanea\nFranciscana</em>, 39: 362–418.",
                "Gieben, Servus, 1995, “Robertus Grosseteste: Bibliographia\n1970–1991,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Turnhout: Brepols,\n415–431.",
                "Thomson, S. Harrison, 1940, <em>The Writings of Robert\nGrosseteste, Bishop of Lincoln, 1235–1253</em>, Cambridge:\nCambridge University Press.\n</ul>\n<h3>"
            ],
            "<a name=\"BioStu\">Biographical Studies</a>": [
                "</h3>\n<p>Important biographical material may also be found in a number of\nthe more general studies listed below, especially Southern 1986 and\nMcEvoy 1982, 2000. Grosseteste’s early career remains a matter of\ncontroversy. The literature is filled with unjustified assertions of\nfact and outright errors regarding this part of his life and readers\nmust be on their guard.</p>\n<ul class=\"hanging\">",
                "Callus, Daniel A., 1945, “The Oxford Career of Robert\nGrosseteste,” <em>Oxoniensia</em> 10 (1945): 42–72.",
                "Ginther, James R., 2000, “Natural Philosophy and Theology at Oxford in the Early Thirteenth Century,” <em>Medieval Sermon Studies</em> 44 (2000): 108–134.",
                "Goering, Joseph, 1995, “Where and When did Grosseteste\nStudy Theology?,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Turnhout: Brepols,\n17–51.",
                "Schulman, N. M., 1997, “Husband, Father, and Bishop?\nGrosseteste in Paris,” <em>Speculum</em> 72 (1997):\n330–346. [Argues on the basis of documentary sources that Grosseteste\nlived in Paris as a married (and ultimately widowed) father prior to\nteaching at Oxford and his episcopacy. This view is criticized by\nMcEvoy 2003, 19–20, who notes Grosseteste’s remark in one of his\nprayers that he had never polluted his body with the stain of the\nflesh.]\n</ul>\n<h3>"
            ],
            "<a name=\"PriTexLat\">Primary Texts in Latin</a>": [
                "</h3>\n<p>It should be noted that the quotations from texts in Baur 1912 and\nDales 1963a above at times rely on tacit alterations I have made to\nthe Latin text on the basis of my own consultation of the\nmanuscripts.</p>\n<ul class=\"hanging\">",
                "Baur, Ludwig (ed.), 1912, <em>Die Philosophischen Werke des\nRobert Grosseteste, Bischofs von Lincoln</em>, Beiträge zur\nGeschichte der Philosophie des Mittelalters, 9, Münster:\nAschendorff Verlag. [The standard edition of Grosseteste’s\nphilosophical works and scientific opuscula. A number of works in it\nhave been reedited, as noted below; the rest should be reedited, as\nthis edition is unreliable.]",
                "Dales, Richard C. (ed.), 1963a, \n <em>Roberti Grosseteste episcopi Lincolniensis commentarius in viii libros \nPhysicorum Aristotelis</em>, Boulder: University of Colorado Press. \n[Unfortunately a flawed edition of this important work that must be used \nwith great caution. A new edition is in preparation by N. Lewis and P. \nKing.]",
                "Dales, Richard C. (ed.), 1963b, “Robert Grosseteste’s Treatise\n<em>De finitate motus et temporis</em>,” <em>Traditio</em>, 19:\n245–266. [Supersedes the edition in Baur 1912.]",
                "Dales, Richard C. and Gieben, Servus (eds.), 1982,\n<em>Hexaæmeron</em>, Auctores Britannici Medii Aevi, 6, London:\nThe British Academy.",
                "Dales, Richard C. and King, Edward B. (eds.), 1986, <em>De\ncessatione legalium</em>, Auctores Britannici Medii Aevi 7, London:\nThe British Academy.",
                "Dales, Richard C. and King, Edward B. (eds.), 1987, <em>De decem\nmandatis</em>, Auctores Britannici Medii Aevi 10, Oxford: The British\nAcademy.",
                "Dinkova-Bruun, Greti <em>et al.</em>, (eds. and trans.), 2013, <em>The Dimensions of Colour: Robert Grosseteste’s</em> De colore, Toronto: The Pontifical Institute of Mediaeval Studies.",
                "Goering, Joseph and Westermann, Edwin J. (eds.), 2003,\n<em>Dicta</em>, [<a href=\"http://grosseteste.org/grosseteste/index.htm\" target=\"other\">Available online</a>]. [A\ntranscription of all 147 dicta as found in the manuscript Oxford,\nBodleian Library MS Bodley 798 (s.c. 2656). A useful working text\nwith no pretensions to be definitive.]",
                "Lewis, Neil, 2017, <em>Robert Grosseteste On Free Decision </em>, Auctores Britannici Medii Aevi 29, Oxford: Oxford University Press. Editions and English translation of the two recensions of Grosseteste’s <em>De libero arbitrio</em>. [Supersede the editions in Baur 1912.]",
                "Lewry, P. Osmund (ed.), 1983, “Robert Grosseteste’s Question on\nSubsistence: An Echo of the Adamites,” in <em>Mediaeval Studies</em>\n45 (1983), 1–21. [Contains an edition of the short work <em>De\nsubsistentia rei</em>.]",
                "Luard, Henry R. (ed.), 1861, <em>Roberti Grosseteste Episcopi\nquondam Lincolniensis Epistolae</em>, Rerum Britannicarum Medii Aevi\nScriptores, Rolls Series 25, London: Longman. [Luard’s edition of\nGrossteste’s first letter, though older, is better than that found in\nBaur 1912, where Baur prints it, following many manuscripts, as the\ntwo works <em>De unica forma omnium</em> and <em>De\nintelligentiis</em>.]",
                "McEvoy, James (ed.), 1974, “The Sun as <em>res</em> and\n<em>signum</em>: Grosseteste’s commentary on <em>Ecclesiasticus</em>,\nch. 43, vv. 1–5,” <em>Recherches de théologie ancienne et\nmédiévale</em>, 41 (1974), 38–91; reprinted in McEvoy\n1994. [This commentary is also known as <em>De operationibus\nsolis</em>.]",
                "McEvoy, James (ed.), 1980, “Robert Grosseteste’s Theory of Human\nNature. With the text of his conference <em>Ecclesia Sancta\nCelebrat</em>,” <em>Recherches de théologie ancienne et\nmédiévale</em> 47 (1980), 131–187; reprinted in McEvoy\n1994. [This sermon is an important text for Grosseteste’s late views\non human nature.]",
                "Panti, Cecilia (ed.), 2001, <em>Moti, virtù e motori\ncelesti nella cosmologia di Roberto Grossatesta</em>, Florence:\nSismel: Edizioni del Galluzo. [Critical editions of <em>De sphaera, De\ncometis, De motu supercaelestium</em> that supersede the editions of\nthese works in Baur.]",
                "Panti, Cecilia, 2011, <em>Roberto Grossatesta, La Luce</em>,\nPisa: Edizioni Plus-Pisa university press. [Text of the critical\nedition in Panti 2013, but without the critical apparatus. The Latin text is accompanied by an Italian translation and\ncommentary in Italian.]",
                "Panti, Cecilia, 2013, “Robert Grosseteste’s <em>De\nluce</em>: A Critical Edition,” in <em>Robert Grosseteste and\nHis Intellectual Milieu</em>, ed. John Flood, James R. Ginther and\nJoseph W. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n193–238. [A critical edition of <em>De luce</em> that supersedes\nthe edition in Baur.]",
                "Rosemann, Philipp W. (ed.), 1995, <em>Tabula</em>, in Corpus\nChristianorum Continuatio Mediaevalis, 130, Turnhout: Brepols.",
                "Rossi, Pietro (ed.), 1981, <em>Commentarius in Posteriorum\nAnalyticorum Libros</em>. Florence: Leo S. Olschki.\n</ul>\n<h3>"
            ],
            "<a name=\"PriTexEngTra\">Primary Texts in English Translation</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Crombie, A. C., 1955, “Grosseteste’s Position in the History of\nScience,” in <em>Robert Grosseteste: Scholar and Bishop</em>,\ned. Daniel A. Callus, Oxford: Clarendon Press, 98–120. Contains a\ntranslation of <em>De calore solis</em> (116–120). [The authenticity of this work is challenged in Panti 2013.]",
                "Dales, Richard C., 1966, “The Text of Robert Grosseteste’s\n<em>Questio de fluxu et refluxu maris</em> with an English\ntranslation,” <em>Isis</em> 57 (1966), 468–473; reprinted in <em>A\nSource Book in Medieval Science</em>, ed. Edward Grant, Cambridge,\nMass.: Harvard University Press, 640–644; and in Dales 1973. [The authenticity of this work is challenged in Dales 1977, Southern 1986, and Panti 2013.]",
                "Dales, Richard C., 1973, <em>The Scientific Achievement of the\nMiddle Ages</em>, Philadelphia: University of Pennsylvania\nPress. Contains translations of <em>De impressionibus elementorum</em>, <em>De calore solis</em> and <em>De fluxu et refluxu maris</em>. [The authenticity of the last work is challenged in Dales 1977, Southern\n1986,and Panti 2013. Panti 2013 also challenges the authenticity of <em>De calore solis</em>]",
                "Goering, Joseph and Mantello, F.A.C., 2010, <em>The Letters of\nRobert Grosseteste, Bishop of Lincoln</em>, Toronto: University of\nToronto Press. An annotated translation of Grosseteste’s letters,\nincluding the first letter, which circulated in the middle ages as two\nworks, <em>De unica forma omnium</em> and <em>De\nintelligentiis</em>.",
                "Hilderbrand, Stephen M., 2012, <em>On the Cessation of the\nLaws</em>, The Fathers of the Church, Medieval Continuation, vol. 13,\nWashington D.C.: Catholic University of America Press. A translation\nof <em>De cessatione legalium.</em>",
                "Lewis, Neil, 2013, “Robert Grosseteste’s <em>On\nLight</em>: An English Translation,” in <em>Robert Grosseteste\nand His Intellectual Milieu</em>, ed. John Flood, James R. Ginther and\nJoseph W. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n239–247. A translation of <em>De luce</em> based on the critical\nedition in Panti 2013.",
                "Lewis, Neil, 2017, <em>Robert Grosseteste On Free Decision </em>, Auctores Britannici Medii Aevi 29, Oxford: Oxford University Press. Editions and English translation of the two recensions of Grosseteste’s <em>De libero arbitrio</em>. [Supersedes the editions in Baur 1912.]",
                "Lindberg, David C., 1974, <em>A Source Book in Medieval\nScience</em>, ed. Edward Grant, Cambridge, Mass.: Harvard University\nPress, 385–391. Translations of <em>De lineis, angulis et figuris</em>\nand <em>De iride</em>.",
                "McKeon, Richard, 1929, <em>Selections from Medieval\nPhilosophers</em>, Vol. 1. New York: Charles Scribner’s\nSons, 263–287. Translations of <em>De veritate</em>, <em>De veritate\npropositionis</em>, and <em>De scientia Dei</em> based on the text in\nBaur 1912.",
                "Martin, C. F. J., 1996, <em>On the Six Days of Creation: A\nTranslation of the Hexaæmeron</em>, Auctores Britannici Medii\nAevi, 6(2), Oxford: The British Academy. </ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Baur, Ludwig, 1917, <em>Die Philosophie des Robert Grosseteste,\nBischofs von Lincoln</em>, Beiträge zur Geschichte der\nPhilosophie des Mittelalters, 18, Münster: Aschendorff\nVerlag.",
                "Callus, Daniel A., 1955, “Robert Grosseteste as Scholar,” in\n<em>Robert Grosseteste: Scholar and Bishop</em>, ed. Daniel A. Callus,\nOxford: Clarendon Press, 1–69.",
                "Crombie, A. C. , 1953, <em>Robert Grosseteste and the Origins of\nExperimental Science 1100–1700</em>. Oxford: Clarendon Press. [An\nimportant but controversial book.]",
                "Dales, Richard C., 1961, “Robert Grosseteste’s Scientific\nWorks,” <em>Isis</em>, 52: 381–402.",
                "–––, 1977, “Adam Marsh, Robert Grosseteste\nand the Treatise on the Tides,” <em>Speculum</em>, 52:\n900–901.",
                "–––, 1986, “Robert Grosseteste’s\nPlace in Medieval Discussions of the Eternity of the\nWorld,” <em>Speculum</em>, 61: 544–563.",
                "Dionisotti, A. C., 1988, “On the Greek Studies of Robert\nGrosseteste,” in <em>The Uses of Greek and Latin: Historical\nEssays</em>, ed. A. C. Dionisotti, Anthony Grafton, and Jill Kraye,\n London:Warburg, 19–39.",
                "Eastwood, Bruce S., 1968, “Medieval Empiricism: the Case of\nGrosseteste’s Optics,” <em>Speculum</em>, 43: 306–321.",
                "Evans, Gillian R., 1983, “The <em>Conclusiones</em> of Robert\nGrosseteste’s Commentary on the <em>Posterior Analytics</em>,”\n<em>Studi medievali ser.</em>, 3(24): 724–734.",
                "Gauthier, R. A., 1982, “Notes sur les débuts\n(1225–1240) du premier\n‘averröisme’,” <em>Revue des Sciences\nphilosophiques et théologiques</em>, 66: 321–374.",
                "Gieben, Servus, 2002, “Grosseteste and Universal Science,” in\n<em>Robert Grosseteste and the Beginnings of a British Theological\nTradition</em>, ed. Maura O’Carrol, Rome: Istituto storico dei\nCappucini, 219–238.",
                "Gilson, Étienne, 1926–7, “Porquoi saint Thomas a\ncritiqué saint Augustin,” <em>Archives d’Histoire\nDoctrinale et Littéraire du Moyen Age</em>, 1: 5–127.",
                "Laird, W. R., 1987, “Robert Grosseteste on the Subalternate\nSciences,” <em>Traditio</em>, 43: 147–169.",
                "Laird, Edgar, 2013,“Robert Grosseteste, Ptolemy, and\nChristian Knowledge,” in <em>Robert Grosseteste and His\nIntellectual Milieu</em>, ed. John Flood, James R. Ginther and Joseph\nW. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n131–152.",
                "Lewis, Neil, 1996, “Power and Contingency in Robert Grosseteste\nand Duns Scotus,” in <em>John Duns Scotus: Metaphysics and\nEthics</em>, Ludger Honnefelder, Rega Wood and Mechthild Dreyer (eds.),\nLeiden: E. J. Brill, 205–225.",
                "–––, 1998, “The Problem of a Plurality of Eternal\nBeings in Robert Grosseteste,” <em>Medieval Philosophy and\nTheology</em>, 7: 17–38.",
                "–––, 2003, “Robert Grosseteste’s Notes on the\n<em>Physics</em>,” in <em>Editing Robert Grosseteste</em>, ed. Evelyn\nA. Mackie and Joseph Goering, Toronto: University of Toronto Press,\n103–134.",
                "–––, 2005, “Robert Grosseteste and the\nContinuum” in\n<em>Albertus Magnus and the Beginnings of the Medieval Reception of\nAristotle in the Latin West</em>, Ludger Honnefelder, Rega Wood,\nMechthild Dreyer and Marc-Aeilko Aris (eds.), Münster: Aschendorff\nVerlag, 159–187.",
                "–––, 2009, “Grosseteste on\nBeing,” <em>Modern Schoolman</em>, 86: 25–46.",
                "–––, 2012, “Robert Grosseteste and Richard Rufus\nof Cornwall on Unequal Infinites,” in <em>Robert Grosseteste His\nThought and Its Impact</em>, ed. Jack P. Cunningham, Toronto:\nPontifical Institute of Mediaeval Studies, 227–256.",
                "–––, 2013, “<em>Libertas arbitrii</em> in Robert\nGrosseteste’s <em>De libero arbitrio</em>,” in <em>Robert\nGrosseteste and His Intellectual Milieu</em>, ed. John Flood, James\nR. Ginther and Joseph W. Goering, Toronto: Pontifical Institute of\nMediaeval Studies, 11–33.",
                "Longeway, John L., 2007, <em>Demonstration and\nscientific knowledge in William of Ockham : a translation of Summa\nlogicae III-II : De syllogismo demonstrativo, and selections from the\nprologue to the ordinatio</em>, Notre Dame, Ind.: University\nof Notre Dame Press [See pp. 13–46 for an account of Grosseteste’s\nviews on demonstrative science.]",
                "Lynch, Lawrence E., 1941, “The Doctrine of Divine Ideas and\nIllumination in Robert Grosseteste, Bishop of Lincoln,” <em>Mediaeval\nStudies</em>, 3: 161–173.",
                "Marrone, Steven P., 1983, <em>William of Auvergne and Robert\nGrosseteste: New Ideas of Truth in the Early Thirteenth Century</em>,\nPrinceton N.J.: Princeton University Press. [An important study of\nGrosseteste’s epistemology, though Marrone’s view that Grosseteste was\ndistancing himself from an illuminationist epistemology in the\ncommentary on the <em>Posterior Analytics</em> is generally rejected\nby scholars.]",
                "–––, 1986, “Robert Grosseteste on the Certitude\nof Induction,” in <em>L’Homme et son univers a moyen âge</em>,\ned. Christian Wenin, Editions de l’Institut supérieur de\nphilosophie, 2 vols. <em>Philosophes Médiévaux</em>,\n26–27: Louvain-la-Neuve, 2.481–488.",
                "McEvoy, James, 1982, <em>The Philosophy of Robert\nGrosseteste</em>, Oxford: Clarendon Press; corrected reprint, 1986. [A\nmagisterial study of Grosseteste’s thought. This work includes\nsignificant material on Grosseteste’s theological views in his\ncommentaries on the pseudo-Dionysius.]",
                "–––, 1983, “The Chronology of Robert\nGrosseteste’s Writings on Nature and Natural Philosophy,” <em>\nSpeculum</em>, 58: 614–655; reprinted in McEvoy 1994.",
                "–––, 1994, <em>Robert Grosseteste, Exegete and\nPhilosopher</em>, Aldershot: Variorum. [A collection of articles\nwritten by this pre-eminent student of Grosseteste.]",
                "–––, 2000, <em>Robert Grosseteste</em>, Oxford:\nOxford University Press. [An excellent overview of Grosseteste’s life\nand thought; essential first reading for the prospective student of\nGrosseteste.]",
                "–––, 2003, “Robert Grosseteste: The Man and His\nLegacy,” in <em>Editing Robert Grosseteste</em>, ed. Evelyn\nA. Mackie and Joseph Goering, Toronto: University of Toronto Press,\n3–29.",
                "McEvoy, James (ed.), 1995, <em>Robert Grosseteste: New\nPerspectives on his Thought and Scholarship</em>, Patristica, 27,\nTurnhout: Brepols.",
                "Noone, Timothy, 2010, “Truth, Creation, and Intelligibility in Anselm, Grosseteste, and Bonaventure,” in <em>Truth: Studies of a Robust Presence</em>, ed. Kurt Pritzl, Catholic University of America Press,\n102–126.",
                "Oliver, Simon, 2004, “Robert Grosseteste on Light, Truth and\n<em>Experimentum</em>,” <em>Vivarium</em>, 42: 151–180.",
                "Palma, Robert J., 1975, “Robert Grosseteste’s Understanding of\nTruth,” <em>Irish Theological Quarterly</em>, 42: 300–306.",
                "–––, 1976, “Grosseteste’s Ordering of\n<em>Scientia</em>,” <em>New Scholasticism</em>, 50: 447–463.",
                "Panti, Cecilia, 1999, “L’incorporazione della luce\nsecundo Roberto Grossatesta,” <em>Medioevo e Rinascimento</em>\n13, n.s. 10: 45–102.",
                "–––, 2003, “Robert Grosseteste’s Early Cosmology,” in\n<em>Editing Robert Grosseteste</em>, ed. Evelyn A. Mackie and Joseph\nGoering, Toronto: University of Toronto Press, 135–165.",
                "–––, 2012, “The Evolution of the Idea of\nCorporeity in Robert Grosseteste’s Writings,” in <em>Robert\nGrosseteste His Thought and Its Impact</em>, ed. Jack P. Cunningham,\nToronto: Pontifical Institute of Mediaeval Studies,\n111–139.",
                "–––, 2013, “Robert Grosseteste and Adam of\nExeter’s Physics of Light: Remarks on the Transmission, Authenticity,\nand Chronology of Grosseteste’s Scientific <em>Opuscula</em>,”\nin <em>Robert Grosseteste and His Intellectual Milieu</em>, ed. John\nFlood, James R. Ginther and Joseph W. Goering, Toronto: Pontifical\nInstitute of Mediaeval Studies, 165–190.",
                "–––, 2017, “Matter and Infinity in Robert Grosseteste’s <em>De luce</em> and <em>Notes on the Physics</em>,”\nin <em>Materia: Nouvelles perspectives de recherche dans la pensée et la culture médiévales (XIIe-XVIe siècles)</em>, ed. Tiziana Suarez-Nani and Agostino Paravicini Baliani, Florence: SISMEL, 27–55.",
                "Pickavé, Martin, 2017, “Robert Grosseteste on Free Choice,” in <em>From Learning to Love: Schools, Law, and Pastoral Care in the Middle Ages: Essays in Honour of Joseph W. Goering</em>, ed. Tristan Sharp, Toronto: Pontifical Institute of Mediaeval Studies, 70–89.",
                "Rossi, Pietro, 1995, “Robert Grosseteste and the Object of\nScientific Knowledge,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Instrumenta\nPatristica, 27, Turnhout: Brepols, 53–76.",
                "–––, 2012, “Grosseteste’s Influence on\nThirteenth- and Fourteenth-Century British Commentaries\non <em>Posterior Analytics</em>,” in <em>Robert Grosseteste His\nThought and Its Impact</em>, ed. Jack P. Cunningham, Toronto:\nPontifical Institute of Mediaeval Studies, 140–166.",
                "Serene, Eileen F., 1979, “Robert Grosseteste on Induction and\nDemonstrative Science,” <em>Synthese</em>, 40: 97–115. [A response to\nCrombie 1953.]",
                "Smith, Brett W., 2018, “A Theme Song of His Life: <em>Aspectus</em> and <em>Affectus</em> in the Writings of Robert Grosseteste,” <em>Franciscan Studies</em>, 76: 1–22.",
                "Southern, Sir Richard, 1986, <em>Robert Grosseteste: The Growth\nof an English Mind in Medieval Europe</em>, Oxford: Clarendon Press;\nsecond edition 1992. [One of the most important works on Grosseteste\nin recent years. The second edition contains a long reply to some\ncriticisms of the first edition.]",
                "Van Dyke, Christina, 2009, “An Aristotelian Theory of\nDivine Illumination: Robert Grosseteste’s Commentary on\nthe <em>Posterior Analytics</em>,” <em>British Journal for the\nHistory of Philosophy</em>, 17: 685–704.",
                "–––, 2010, “The Truth, the Whole Truth, and\nNothing but the Truth: Robert Grosseteste on Universals (and\nthe <em>Posterior Analytics</em>),” <em>Journal of the History\nof Philosophy</em>, 48: 153–170.",
                "Wallace, William A., 1972, <em>Causality and Scientific\nExplanation. I: Medieval and Early Classical Science</em>. Ann Arbor:\nUniversity of Michigan Press. [Chapter 2 discusses Grosseteste’s\naccount of demonstrative science.]\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"Bibs\">Bibliographies</a></h3>\n<ul class=\"hanging\">\n<li>Gieben, Servus, 1962, “Bibliographia universa Roberti\nGrosseteste ab anno 1473 ad annum 1969,” <em>Collectanea\nFranciscana</em>, 39: 362–418.</li>\n<li>Gieben, Servus, 1995, “Robertus Grosseteste: Bibliographia\n1970–1991,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Turnhout: Brepols,\n415–431.</li>\n<li>Thomson, S. Harrison, 1940, <em>The Writings of Robert\nGrosseteste, Bishop of Lincoln, 1235–1253</em>, Cambridge:\nCambridge University Press.</li>\n</ul>\n<h3><a name=\"BioStu\">Biographical Studies</a></h3>\n<p>Important biographical material may also be found in a number of\nthe more general studies listed below, especially Southern 1986 and\nMcEvoy 1982, 2000. Grosseteste’s early career remains a matter of\ncontroversy.  The literature is filled with unjustified assertions of\nfact and outright errors regarding this part of his life and readers\nmust be on their guard.</p>\n<ul class=\"hanging\">\n<li>Callus, Daniel A., 1945, “The Oxford Career of Robert\nGrosseteste,” <em>Oxoniensia</em> 10 (1945): 42–72.</li>\n<li>Ginther, James R., 2000,  “Natural Philosophy and Theology at Oxford in the Early Thirteenth Century,” <em>Medieval Sermon Studies</em> 44 (2000): 108–134.</li>\n<li>Goering, Joseph, 1995, “Where and When did Grosseteste\nStudy Theology?,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Turnhout: Brepols,\n17–51.  </li>\n<li>Schulman, N. M., 1997, “Husband, Father, and Bishop?\nGrosseteste in Paris,” <em>Speculum</em> 72 (1997):\n330–346. [Argues on the basis of documentary sources that Grosseteste\nlived in Paris as a married (and ultimately widowed) father prior to\nteaching at Oxford and his episcopacy. This view is criticized by\nMcEvoy 2003, 19–20, who notes Grosseteste’s remark in one of his\nprayers that he had never polluted his body with the stain of the\nflesh.]</li>\n</ul>\n<h3><a name=\"PriTexLat\">Primary Texts in Latin</a></h3>\n<p>It should be noted that the quotations from texts in Baur 1912 and\nDales 1963a above at times rely on tacit alterations I have made to\nthe Latin text on the basis of my own consultation of the\nmanuscripts.</p>\n<ul class=\"hanging\">\n<li>Baur, Ludwig (ed.), 1912, <em>Die Philosophischen Werke des\nRobert Grosseteste, Bischofs von Lincoln</em>, Beiträge zur\nGeschichte der Philosophie des Mittelalters, 9, Münster:\nAschendorff Verlag.  [The standard edition of Grosseteste’s\nphilosophical works and scientific opuscula.  A number of works in it\nhave been reedited, as noted below; the rest should be reedited, as\nthis edition is unreliable.]</li>\n<li>Dales, Richard C. (ed.), 1963a, \n <em>Roberti Grosseteste episcopi Lincolniensis commentarius in viii libros \nPhysicorum Aristotelis</em>, Boulder: University of Colorado Press. \n[Unfortunately a flawed edition of this important work that must be used \nwith great caution. A new edition is in preparation by N. Lewis and P. \nKing.]</li>\n<li>Dales, Richard C. (ed.), 1963b, “Robert Grosseteste’s Treatise\n<em>De finitate motus et temporis</em>,” <em>Traditio</em>, 19:\n245–266. [Supersedes the edition in Baur 1912.]</li>\n<li>Dales, Richard C. and Gieben, Servus (eds.), 1982,\n<em>Hexaæmeron</em>, Auctores Britannici Medii Aevi, 6, London:\nThe British Academy.</li>\n<li>Dales, Richard C. and King, Edward B. (eds.), 1986,  <em>De\ncessatione legalium</em>, Auctores Britannici Medii Aevi 7, London:\nThe British Academy.</li>\n<li>Dales, Richard C. and King, Edward B. (eds.), 1987, <em>De decem\nmandatis</em>, Auctores Britannici Medii Aevi 10, Oxford: The British\nAcademy.</li>\n<li>Dinkova-Bruun, Greti <em>et al.</em>, (eds. and trans.), 2013, <em>The Dimensions of Colour: Robert Grosseteste’s</em> De colore, Toronto: The Pontifical Institute of Mediaeval Studies.</li>\n<li>Goering, Joseph and Westermann, Edwin J. (eds.), 2003,\n<em>Dicta</em>, [<a href=\"http://grosseteste.org/grosseteste/index.htm\" target=\"other\">Available online</a>]. [A\ntranscription of all 147 dicta as found in the manuscript Oxford,\nBodleian Library MS Bodley 798 (s.c. 2656).  A useful working text\nwith no pretensions to be definitive.] </li>\n<li>Lewis, Neil, 2017, <em>Robert Grosseteste On Free Decision </em>, Auctores Britannici Medii Aevi 29, Oxford: Oxford University Press. Editions and English translation of the two recensions of Grosseteste’s <em>De libero arbitrio</em>. [Supersede the editions in Baur 1912.]</li>\n<li>Lewry, P. Osmund (ed.), 1983, “Robert Grosseteste’s Question on\nSubsistence: An Echo of the Adamites,” in  <em>Mediaeval Studies</em>\n45 (1983), 1–21. [Contains an edition of the short work <em>De\nsubsistentia rei</em>.]</li>\n<li>Luard, Henry R. (ed.), 1861, <em>Roberti Grosseteste Episcopi\nquondam Lincolniensis Epistolae</em>, Rerum Britannicarum Medii Aevi\nScriptores, Rolls Series 25, London: Longman. [Luard’s edition of\nGrossteste’s first letter, though older, is better than that found in\nBaur 1912, where Baur prints it, following many manuscripts, as the\ntwo works <em>De unica forma omnium</em> and <em>De\nintelligentiis</em>.]</li>\n<li>McEvoy, James (ed.), 1974,  “The Sun as <em>res</em> and\n<em>signum</em>: Grosseteste’s commentary on <em>Ecclesiasticus</em>,\nch. 43, vv. 1–5,” <em>Recherches de théologie ancienne et\nmédiévale</em>, 41 (1974), 38–91; reprinted in McEvoy\n1994.  [This commentary is also known as <em>De operationibus\nsolis</em>.]</li>\n<li>McEvoy, James (ed.), 1980, “Robert Grosseteste’s Theory of Human\nNature. With the text of his conference  <em>Ecclesia Sancta\nCelebrat</em>,” <em>Recherches de théologie ancienne et\nmédiévale</em> 47 (1980), 131–187; reprinted in McEvoy\n1994.  [This sermon is an important text for Grosseteste’s late views\non human nature.]</li>\n<li>Panti, Cecilia (ed.), 2001,  <em>Moti, virtù e motori\ncelesti nella cosmologia di Roberto Grossatesta</em>,  Florence:\nSismel: Edizioni del Galluzo. [Critical editions of <em>De sphaera, De\ncometis, De motu supercaelestium</em> that supersede the editions of\nthese works in Baur.]</li>\n<li>Panti, Cecilia, 2011,  <em>Roberto Grossatesta, La Luce</em>,\nPisa: Edizioni Plus-Pisa university press. [Text of the critical\nedition in Panti 2013, but without the critical apparatus. The Latin text is accompanied by an Italian translation and\ncommentary in Italian.]</li>\n<li>Panti, Cecilia, 2013, “Robert Grosseteste’s <em>De\nluce</em>: A Critical Edition,” in <em>Robert Grosseteste and\nHis Intellectual Milieu</em>, ed. John Flood, James R. Ginther and\nJoseph W. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n193–238. [A critical edition of <em>De luce</em> that supersedes\nthe edition in Baur.] </li>\n<li>Rosemann, Philipp W. (ed.), 1995,  <em>Tabula</em>, in Corpus\nChristianorum Continuatio Mediaevalis, 130, Turnhout: Brepols.</li>\n<li>Rossi, Pietro (ed.), 1981, <em>Commentarius in Posteriorum\nAnalyticorum Libros</em>. Florence: Leo S. Olschki.</li>\n</ul>\n<h3><a name=\"PriTexEngTra\">Primary Texts in English Translation</a></h3>\n<ul class=\"hanging\">\n<li>Crombie, A. C., 1955, “Grosseteste’s Position in the History of\nScience,” in <em>Robert Grosseteste: Scholar and Bishop</em>,\ned. Daniel A. Callus, Oxford: Clarendon Press, 98–120. Contains a\ntranslation of <em>De calore solis</em> (116–120). [The authenticity of this work is challenged in Panti 2013.]</li>\n<li>Dales, Richard C., 1966, “The Text of Robert Grosseteste’s\n<em>Questio de fluxu et refluxu maris</em> with an English\ntranslation,” <em>Isis</em>  57 (1966), 468–473; reprinted in <em>A\nSource Book in Medieval Science</em>, ed. Edward Grant, Cambridge,\nMass.: Harvard University Press, 640–644; and in Dales 1973. [The authenticity of this work is challenged in Dales 1977, Southern 1986, and Panti 2013.] </li>\n<li>Dales, Richard C., 1973, <em>The Scientific Achievement of the\nMiddle Ages</em>, Philadelphia: University of Pennsylvania\nPress. Contains translations of <em>De impressionibus elementorum</em>, <em>De calore solis</em> and <em>De fluxu et refluxu maris</em>. [The authenticity of the last work is challenged in Dales 1977, Southern\n1986,and Panti 2013. Panti 2013 also challenges the authenticity of <em>De calore solis</em>]</li>\n<li>Goering, Joseph and Mantello, F.A.C., 2010, <em>The Letters of\nRobert Grosseteste, Bishop of Lincoln</em>, Toronto: University of\nToronto Press. An annotated translation of Grosseteste’s letters,\nincluding the first letter, which circulated in the middle ages as two\nworks, <em>De unica forma omnium</em> and <em>De\nintelligentiis</em>.</li>\n<li>Hilderbrand, Stephen M., 2012, <em>On the Cessation of the\nLaws</em>, The Fathers of the Church, Medieval Continuation, vol. 13,\nWashington D.C.: Catholic University of America Press. A translation\nof <em>De cessatione legalium.</em></li>\n<li>Lewis, Neil, 2013, “Robert Grosseteste’s <em>On\nLight</em>: An English Translation,” in <em>Robert Grosseteste\nand His Intellectual Milieu</em>, ed. John Flood, James R. Ginther and\nJoseph W. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n239–247. A translation of <em>De luce</em> based on the critical\nedition in Panti 2013.</li>\n<li>Lewis, Neil, 2017, <em>Robert Grosseteste On Free Decision </em>, Auctores Britannici Medii Aevi 29, Oxford: Oxford University Press. Editions and English translation of the two recensions of Grosseteste’s <em>De libero arbitrio</em>. [Supersedes the editions in Baur 1912.]</li>\n<li>Lindberg, David C., 1974, <em>A Source Book in Medieval\nScience</em>, ed. Edward Grant, Cambridge, Mass.: Harvard University\nPress, 385–391. Translations of <em>De lineis, angulis et figuris</em>\nand <em>De iride</em>.</li>\n<li>McKeon, Richard, 1929,  <em>Selections from Medieval\nPhilosophers</em>, Vol. 1.  New York: Charles Scribner’s\nSons, 263–287.  Translations of <em>De veritate</em>, <em>De veritate\npropositionis</em>, and <em>De scientia Dei</em> based on the text in\nBaur 1912.</li>\n<li>Martin, C. F. J., 1996, <em>On the Six Days of Creation: A\nTranslation of the Hexaæmeron</em>, Auctores Britannici Medii\nAevi, 6(2), Oxford: The British Academy.</li> </ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Baur, Ludwig, 1917, <em>Die Philosophie des Robert Grosseteste,\nBischofs von Lincoln</em>, Beiträge zur Geschichte der\nPhilosophie des Mittelalters, 18, Münster: Aschendorff\nVerlag.</li>\n<li>Callus, Daniel A., 1955, “Robert Grosseteste as Scholar,” in\n<em>Robert Grosseteste: Scholar and Bishop</em>, ed. Daniel A. Callus,\nOxford: Clarendon Press, 1–69. </li>\n<li>Crombie, A. C. , 1953,  <em>Robert Grosseteste and the Origins of\nExperimental Science 1100–1700</em>.  Oxford: Clarendon Press. [An\nimportant but controversial book.]</li>\n<li>Dales, Richard C., 1961, “Robert Grosseteste’s Scientific\nWorks,” <em>Isis</em>, 52: 381–402.</li>\n<li>–––, 1977, “Adam Marsh, Robert Grosseteste\nand the Treatise on the Tides,” <em>Speculum</em>, 52:\n900–901. </li>\n<li>–––, 1986, “Robert Grosseteste’s\nPlace in Medieval Discussions of the Eternity of the\nWorld,” <em>Speculum</em>, 61: 544–563. </li>\n<li>Dionisotti, A. C., 1988, “On the Greek Studies of Robert\nGrosseteste,” in <em>The Uses of Greek and Latin: Historical\nEssays</em>, ed. A. C. Dionisotti, Anthony Grafton, and Jill Kraye,\n London:Warburg, 19–39.</li>\n<li>Eastwood, Bruce S., 1968,  “Medieval Empiricism: the Case of\nGrosseteste’s Optics,” <em>Speculum</em>, 43: 306–321.</li>\n<li>Evans, Gillian R., 1983,  “The <em>Conclusiones</em> of Robert\nGrosseteste’s Commentary on the <em>Posterior Analytics</em>,”\n<em>Studi medievali ser.</em>, 3(24): 724–734.</li>\n<li>Gauthier, R. A., 1982, “Notes sur les débuts\n(1225–1240) du premier\n‘averröisme’,” <em>Revue des Sciences\nphilosophiques et théologiques</em>, 66: 321–374.</li>\n<li>Gieben, Servus, 2002,  “Grosseteste and Universal Science,” in\n<em>Robert Grosseteste and the Beginnings of a British Theological\nTradition</em>, ed. Maura O’Carrol, Rome: Istituto storico dei\nCappucini, 219–238.</li>\n<li>Gilson, Étienne, 1926–7, “Porquoi saint Thomas a\ncritiqué saint Augustin,” <em>Archives d’Histoire\nDoctrinale et Littéraire du Moyen Age</em>, 1: 5–127.</li>\n<li>Laird, W. R., 1987,  “Robert Grosseteste on the Subalternate\nSciences,” <em>Traditio</em>, 43: 147–169.</li>\n<li>Laird, Edgar, 2013,“Robert Grosseteste, Ptolemy, and\nChristian Knowledge,” in <em>Robert Grosseteste and His\nIntellectual Milieu</em>, ed. John Flood, James R. Ginther and Joseph\nW. Goering, Toronto: Pontifical Institute of Mediaeval Studies,\n131–152.</li>\n<li>Lewis, Neil, 1996,  “Power and Contingency in Robert Grosseteste\nand Duns Scotus,” in <em>John Duns Scotus: Metaphysics and\nEthics</em>, Ludger Honnefelder, Rega Wood and Mechthild Dreyer (eds.),\nLeiden: E. J. Brill, 205–225.</li>\n<li>–––, 1998,  “The Problem of a Plurality of Eternal\nBeings in Robert Grosseteste,” <em>Medieval Philosophy and\nTheology</em>, 7: 17–38.</li>\n<li>–––, 2003,  “Robert Grosseteste’s Notes on the\n<em>Physics</em>,” in <em>Editing Robert Grosseteste</em>, ed. Evelyn\nA. Mackie and Joseph Goering, Toronto: University of Toronto Press,\n103–134.</li>\n<li>–––, 2005, “Robert Grosseteste and the\nContinuum” in\n<em>Albertus Magnus and the Beginnings of the Medieval Reception of\nAristotle in the Latin West</em>, Ludger Honnefelder, Rega Wood,\nMechthild Dreyer and Marc-Aeilko Aris (eds.), Münster: Aschendorff\nVerlag, 159–187.</li>\n<li>–––, 2009, “Grosseteste on\nBeing,” <em>Modern Schoolman</em>, 86: 25–46.</li>\n<li>–––, 2012, “Robert Grosseteste and Richard Rufus\nof Cornwall on Unequal Infinites,” in <em>Robert Grosseteste His\nThought and Its Impact</em>, ed. Jack P. Cunningham, Toronto:\nPontifical Institute of Mediaeval Studies, 227–256.</li>\n<li>–––, 2013, “<em>Libertas arbitrii</em> in Robert\nGrosseteste’s <em>De libero arbitrio</em>,” in <em>Robert\nGrosseteste and His Intellectual Milieu</em>, ed. John Flood, James\nR. Ginther and Joseph W. Goering, Toronto: Pontifical Institute of\nMediaeval Studies, 11–33.</li>\n<li>Longeway, John L., 2007, <em>Demonstration and\nscientific knowledge in William of Ockham : a translation of Summa\nlogicae III-II : De syllogismo demonstrativo, and selections from the\nprologue to the ordinatio</em>, Notre Dame, Ind.: University\nof Notre Dame Press [See pp. 13–46 for an account of Grosseteste’s\nviews on demonstrative science.]</li>\n<li>Lynch, Lawrence E., 1941,  “The Doctrine of Divine Ideas and\nIllumination in Robert Grosseteste, Bishop of Lincoln,” <em>Mediaeval\nStudies</em>, 3: 161–173.</li>\n<li>Marrone, Steven P., 1983,  <em>William of Auvergne and Robert\nGrosseteste: New Ideas of Truth in the Early Thirteenth Century</em>,\nPrinceton N.J.: Princeton University Press. [An important study of\nGrosseteste’s epistemology, though Marrone’s view that Grosseteste was\ndistancing himself from an illuminationist epistemology in the\ncommentary on the <em>Posterior Analytics</em> is generally rejected\nby scholars.]</li>\n<li>–––, 1986,  “Robert Grosseteste on the Certitude\nof Induction,” in <em>L’Homme et son univers a moyen âge</em>,\ned. Christian Wenin, Editions de l’Institut supérieur de\nphilosophie, 2 vols. <em>Philosophes Médiévaux</em>,\n26–27: Louvain-la-Neuve, 2.481–488.</li>\n<li>McEvoy, James, 1982, <em>The Philosophy of Robert\nGrosseteste</em>, Oxford: Clarendon Press; corrected reprint, 1986. [A\nmagisterial study of Grosseteste’s thought. This work includes\nsignificant material on Grosseteste’s theological views in his\ncommentaries on the pseudo-Dionysius.]</li>\n<li>–––, 1983, “The Chronology of Robert\nGrosseteste’s Writings on Nature and Natural Philosophy,” <em>\nSpeculum</em>, 58: 614–655; reprinted in McEvoy 1994.</li>\n<li>–––, 1994, <em>Robert Grosseteste, Exegete and\nPhilosopher</em>, Aldershot: Variorum. [A collection of articles\nwritten by this pre-eminent student of Grosseteste.]</li>\n<li>–––, 2000,  <em>Robert Grosseteste</em>, Oxford:\nOxford University Press. [An excellent overview of Grosseteste’s life\nand thought; essential first reading for the prospective student of\nGrosseteste.]</li>\n<li>–––, 2003, “Robert Grosseteste: The Man and His\nLegacy,” in <em>Editing Robert Grosseteste</em>, ed. Evelyn\nA. Mackie and Joseph Goering, Toronto: University of Toronto Press,\n3–29.</li>\n<li>McEvoy, James (ed.), 1995,  <em>Robert Grosseteste: New\nPerspectives on his Thought and Scholarship</em>, Patristica, 27,\nTurnhout: Brepols.</li>\n<li>Noone, Timothy, 2010, “Truth, Creation, and Intelligibility in Anselm, Grosseteste, and Bonaventure,” in <em>Truth: Studies of a Robust Presence</em>, ed. Kurt Pritzl, Catholic University of America Press,\n102–126.</li>\n<li>Oliver, Simon, 2004,  “Robert Grosseteste on Light, Truth and\n<em>Experimentum</em>,” <em>Vivarium</em>, 42: 151–180.</li>\n<li>Palma, Robert J., 1975,  “Robert Grosseteste’s Understanding of\nTruth,” <em>Irish Theological Quarterly</em>, 42: 300–306.</li>\n<li>–––, 1976,  “Grosseteste’s Ordering of\n<em>Scientia</em>,” <em>New Scholasticism</em>, 50: 447–463.</li>\n<li>Panti, Cecilia, 1999,  “L’incorporazione della luce\nsecundo Roberto Grossatesta,” <em>Medioevo e Rinascimento</em>\n13, n.s. 10: 45–102.</li>\n<li>–––, 2003, “Robert Grosseteste’s Early Cosmology,” in\n<em>Editing Robert Grosseteste</em>, ed.  Evelyn A. Mackie and Joseph\nGoering, Toronto: University of Toronto Press, 135–165.</li>\n<li>–––, 2012, “The Evolution of the Idea of\nCorporeity in Robert Grosseteste’s Writings,” in <em>Robert\nGrosseteste His Thought and Its Impact</em>, ed. Jack P. Cunningham,\nToronto: Pontifical Institute of Mediaeval Studies,\n111–139.</li>\n<li>–––, 2013, “Robert Grosseteste and Adam of\nExeter’s Physics of Light: Remarks on the Transmission, Authenticity,\nand Chronology of Grosseteste’s Scientific <em>Opuscula</em>,”\nin <em>Robert Grosseteste and His Intellectual Milieu</em>, ed. John\nFlood, James R. Ginther and Joseph W. Goering, Toronto: Pontifical\nInstitute of Mediaeval Studies, 165–190.</li>\n<li>–––, 2017, “Matter and Infinity in Robert Grosseteste’s <em>De luce</em> and <em>Notes on the Physics</em>,”\nin <em>Materia: Nouvelles perspectives de recherche dans la pensée et la culture médiévales (XIIe-XVIe siècles)</em>, ed. Tiziana Suarez-Nani and Agostino Paravicini Baliani, Florence: SISMEL, 27–55.</li>\n<li>Pickavé, Martin, 2017,  “Robert Grosseteste on Free Choice,” in <em>From Learning to Love: Schools, Law, and Pastoral Care in the Middle Ages: Essays in Honour of Joseph W. Goering</em>, ed. Tristan Sharp, Toronto: Pontifical Institute of Mediaeval Studies, 70–89.</li>\n<li>Rossi, Pietro, 1995,  “Robert Grosseteste and the Object of\nScientific Knowledge,” in <em>Robert Grosseteste: New Perspectives on\nhis Thought and Scholarship</em>, ed. James McEvoy, Instrumenta\nPatristica, 27, Turnhout: Brepols, 53–76.</li>\n<li>–––, 2012, “Grosseteste’s Influence on\nThirteenth- and Fourteenth-Century British Commentaries\non <em>Posterior Analytics</em>,” in <em>Robert Grosseteste His\nThought and Its Impact</em>, ed. Jack P. Cunningham, Toronto:\nPontifical Institute of Mediaeval Studies, 140–166.</li>\n<li>Serene, Eileen F., 1979,  “Robert Grosseteste on Induction and\nDemonstrative Science,” <em>Synthese</em>, 40: 97–115. [A response to\nCrombie 1953.]</li>\n<li>Smith, Brett W., 2018,  “A Theme Song of His Life: <em>Aspectus</em> and <em>Affectus</em> in the Writings of Robert Grosseteste,” <em>Franciscan Studies</em>, 76: 1–22. </li>\n<li>Southern, Sir Richard, 1986, <em>Robert Grosseteste: The Growth\nof an English Mind in Medieval Europe</em>, Oxford: Clarendon Press;\nsecond edition 1992.  [One of the most important works on Grosseteste\nin recent years. The second edition contains a long reply to some\ncriticisms of the first edition.]</li>\n<li>Van Dyke, Christina, 2009, “An Aristotelian Theory of\nDivine Illumination: Robert Grosseteste’s Commentary on\nthe <em>Posterior Analytics</em>,” <em>British Journal for the\nHistory of Philosophy</em>, 17: 685–704.</li>\n<li>–––, 2010, “The Truth, the Whole Truth, and\nNothing but the Truth: Robert Grosseteste on Universals (and\nthe <em>Posterior Analytics</em>),” <em>Journal of the History\nof Philosophy</em>, 48: 153–170.</li>\n<li>Wallace, William A., 1972,  <em>Causality and Scientific\nExplanation. I: Medieval and Early Classical Science</em>. Ann Arbor:\nUniversity of Michigan Press. [Chapter 2 discusses Grosseteste’s\naccount of demonstrative science.]</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Augustine, Saint",
            "Bacon, Roger",
            "continuity and infinitesimals",
            "demonstration: medieval theories of",
            "divine: illumination",
            "free will: divine foreknowledge and",
            "future contingents: medieval theories of",
            "modality: medieval theories of"
        ],
        "entry_link": [
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../roger-bacon/": "Bacon, Roger"
            },
            {
                "../continuity/": "continuity and infinitesimals"
            },
            {
                "../demonstration-medieval/": "demonstration: medieval theories of"
            },
            {
                "../illumination/": "divine: illumination"
            },
            {
                "../free-will-foreknowledge/": "free will: divine foreknowledge and"
            },
            {
                "../medieval-futcont/": "future contingents: medieval theories of"
            },
            {
                "../modality-medieval/": "modality: medieval theories of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grosseteste\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/grosseteste/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=grosseteste&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/grosseteste/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=grosseteste": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/grosseteste/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=grosseteste&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/grosseteste/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://grossetestesociety.org\" target=\"other\">The International Robert Grosseteste Society</a>. ",
            "<a href=\"http://ordered-universe.com\" target=\"other\">The Ordered Universe Project</a>,\nan international research project dedicated to the scientific works of Robert Grosseteste. "
        ],
        "listed_links": [
            {
                "http://grossetestesociety.org": "The International Robert Grosseteste Society"
            },
            {
                "http://ordered-universe.com": "The Ordered Universe Project"
            }
        ]
    }
}