{
    "url": "herder",
    "title": "Johann Gottfried von Herder",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Michael Forster\n<mnforster@uni-bonn.de>",
        "author_links": [
            {
                "mailto:mnforster%40uni-bonn%2ede": "mnforster@uni-bonn.de"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nMichael Forster\n&lt;<a href=\"mailto:mnforster%40uni-bonn%2ede\"><em>mnforster<abbr title=\" at \">@</abbr>uni-bonn<abbr title=\" dot \">.</abbr>de</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Oct 23, 2001",
        "substantive revision Thu May 19, 2022"
    ],
    "preamble": "\n\nJohann Gottfried von Herder (1744–1803) is a philosopher of the\nfirst importance. This judgment largely turns on the intrinsic quality\nof his ideas (of which this article will try to give some impression).\nBut another aspect of it is his intellectual influence. This has been\nimmense both within philosophy and beyond it (much greater than is\nusually realized). For example, Hegel’s philosophy turns out to\nbe largely a sort of elaborate systematic development of\nHerder’s ideas (especially concerning language, the mind,\nhistory, and God); so too does Schleiermacher’s (concerning\nlanguage, interpretation, translation, the mind, art, and God);\nNietzsche is deeply influenced by Herder as well (concerning language,\nthe mind, history, and values); so too is Dilthey (especially\nconcerning history); even John Stuart Mill has important debts to\nHerder (in political philosophy); and beyond philosophy, Goethe was\ntransformed from being merely a clever but rather conventional poet\ninto the great artist he eventually became largely through the early\nimpact on him of Herder’s ideas.\n\nIndeed, Herder virtually established whole disciplines that\nwe now take for granted. For example, it was mainly Herder (not, as\nhas often been claimed, Hamann) who established fundamental ideas\nconcerning an intimate dependence of thought on language that underpin\nmodern philosophy of language. It was Herder who, through those same\nideas, his recognition of deep variations in thought and language\nacross historical periods and cultures, his perception of the\nfundamental role of grammar in language and of grammar’s deep\nvariation between languages, his empirical approach to languages, and\nin other ways, inspired Friedrich Schlegel, Wilhelm von Humboldt, and\nothers to found modern linguistics. It was Herder who developed modern\ninterpretation-theory, or “hermeneutics”, in ways that\nwould subsequently be taken over by Schleiermacher and then more\nsystematically formulated by the latter’s pupil August Boeckh.\nIt was Herder who, by doing so, also contributed to establishing the\nmethodological foundations of nineteenth-century German classical\nscholarship (which rested on the Schleiermacher-Boeckh methodology),\nand thereby of modern classical scholarship generally. It was Herder\nwho did more than anyone else to establish the general conception and\nthe interpretive methodology of our modern discipline of anthropology.\nFinally, Herder also made vital contributions to the progress of\nmodern biblical scholarship.\n",
    "toc": [
        {
            "#LifeWork": "1. Life and Works"
        },
        {
            "#PhilStyl": "2. Philosophical Style"
        },
        {
            "#GeneProgPhil": "3. General Program in Philosophy"
        },
        {
            "#PhilLangInteTran": "4. Philosophy of Language, Interpretation, and Translation"
        },
        {
            "#PhilLangLangThouMean": "4.1 Philosophy of Language: Language, Thought, Meaning"
        },
        {
            "#TheoInte": "4.2 Theory of Interpretation (Hermeneutics)"
        },
        {
            "#TheoTran": "4.3 Theory of Translation"
        },
        {
            "#RoleBirtLingAnth": "5. Role in the Birth of Linguistics and Anthropology"
        },
        {
            "#PhilMind": "6. Philosophy of Mind"
        },
        {
            "#Aest": "7. Aesthetics"
        },
        {
            "#MoraPhil": "8. Moral Philosophy"
        },
        {
            "#PhilHist": "9. Philosophy of History"
        },
        {
            "#PoliPhil": "10. Political Philosophy"
        },
        {
            "#PhilReli": "11. Philosophy of Religion"
        },
        {
            "#InteInfl": "12. Intellectual Influence"
        },
        {
            "#GuidLite": "13. Guide to the Literature"
        },
        {
            "#GeneTrea": "General Treatments"
        },
        {
            "#InteLife": "Intellectual Life"
        },
        {
            "#PhilStyl_1": "Philosophical Style"
        },
        {
            "#GeneProgPhil_1": "General Program in Philosophy"
        },
        {
            "#PhilLang": "Philosophy of Language"
        },
        {
            "#InteHerm": "Theory of Interpretation (Hermeneutics)"
        },
        {
            "#TheoTran_1": "Theory of Translation"
        },
        {
            "#LingAnth": "Linguistics and Anthropology"
        },
        {
            "#PhilMind_1": "Philosophy of Mind"
        },
        {
            "#Aest_1": "Aesthetics"
        },
        {
            "#MoraPhil_1": "Moral Philosophy"
        },
        {
            "#PhilHist_1": "Philosophy of History"
        },
        {
            "#PoliPhil_1": "Political Philosophy"
        },
        {
            "#PhilReli_1": "Philosophy of Religion"
        },
        {
            "#HerdInfl": "Herder’s Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimText": "Primary Texts"
        },
        {
            "#PrimWorkOthe": "Primary Works by Others"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and Works\n\nJohann Gottfried Herder (1744–1803) was born in Mohrungen in\nEast Prussia. His father was a schoolteacher and he grew up in humble\ncircumstances. In 1762 he enrolled at the University of\nKönigsberg, where he studied with Kant, who accorded him special\nprivileges because of his unusual intellectual abilities. At this\nperiod he also began a lifelong friendship with the irrationalist\nphilosopher Hamann. In 1764 he left Königsberg to take up a\nschool-teaching position in Riga. There he wrote the programmatic\nessay How Philosophy Can Become More Universal and Useful for the\nBenefit of the People (1765); published his first major work,\nconcerning the philosophy of language and literature, the\nFragments on Recent German Literature (1767–8); and\nalso published an important work on aesthetics, the Critical\nForests (1769). In 1769 he resigned his position and\ntravelled—first to France, and then to Strasbourg, where in 1770\nhe met, and had a powerful impact on, the young Goethe. In 1771 he won\na prize from the Berlin Academy for his best-known work in the\nphilosophy of language, the Treatise on the Origin of\nLanguage (published in 1772). From 1771–6 he served as\ncourt preacher to the ruling house in Bückeburg. The most\nimportant works from this period are the essay Shakespeare\n(1773) and his first major essay on the philosophy of history,\nThis Too a Philosophy of History for the Formation of\nHumanity (1774). In 1776, partly thanks to Goethe’s\ninfluence, he was appointed General Superintendent of the Lutheran\nclergy in Weimar, a post he would keep for the rest of his life.\nDuring this period he published an important essay in the philosophy\nof mind, On the Cognition and Sensation of the Human Soul\n(1778); a seminal work on the Old Testament, On the Spirit of\nHebrew Poetry (1782–3); his well-known longer work on the\nphilosophy of history, the Ideas for the Philosophy of History of\nHumanity (1784–91); an influential essay on the philosophy\nof religion, God: Some Conversations (1787); a work largely\non political philosophy, written in response to the French Revolution,\nthe Letters for the Advancement of Humanity (1793–7); a\nseries of Christian Writings (1794–8) concerned with\nthe New Testament; and two works opposing Kant’s critical\nphilosophy, A Metacritique on the Critique of Pure Reason\n(1799) (directed against the theoretical philosophy of the\nCritique of Pure Reason [Kant 1781/7]) and the\nCalligone (1800) (directed against the aesthetics of the\nCritique of the Power of Judgment [Kant 1790]). In addition\nto the works just mentioned, Herder also wrote many others in the\ncourse of his career.\n\nHerder’s earlier works are often his best. He himself wrote in\nOn the Cognition and Sensation (this article will use such\nabbreviated titles throughout) that “the first uninhibited work\nof an author is … usually his best; his bloom is unfolding, his\nsoul still dawn” (HPW 219). Whether or not that\nis generally true, it does arguably apply to Herder\nhimself.\n2. Philosophical Style\n\nIn certain ways Herder’s philosophical texts are easier to read\nthan others from the period. For example, he avoids technical jargon,\nwrites in a way that is lively and rich in examples rather than dry\nand abstract, and has no large, complex system for the reader to keep\ntrack of. But his texts also have certain peculiarities that can\nimpede a proper understanding and appreciation of his thought, and it\nis important to be alerted to these.\n\nTo begin with, Herder’s writing often seems emotional and\ngrammatically undisciplined in ways that might perhaps be expected in\ncasual speech but not in philosophical texts. This is intentional.\nIndeed, Herder sometimes deliberately “roughed up”\nmaterial in this direction between drafts. Moreover, he has serious\nphilosophical reasons for writing in such a way, including the\nfollowing: (1) This promises to make his writing more broadly\naccessible and interesting to people—a decidedly non-trivial\ngoal for him, since he believes it to be an essential part of\nphilosophy’s vocation to have a broad social impact. (2) He\nbelieves in the expressive superiority of speech over writing. (3) One\nof his central theses in the philosophy of mind holds that thought is\nnot and should not be separate from volition, or affect, that types of\nthinking that attempt to exclude affect are inherently distorting and\ninferior. Standard academic writing has this vice, whereas spontaneous\nspeech, and writing that imitates it, do not. (4) Herder is opposed to\nany lexical or grammatical straitjacketing of language, any slavish\nobedience to dictionaries and grammar books. In his view, such\nstraitjacketing is inimical, not only to linguistic creativity and\ninventiveness, but also (much worse), since thought is essentially\ndependent on and confined in its scope by language, thereby to\ncreativity and inventiveness in thought itself.\n\nAnother peculiarity of Herder’s philosophical texts is their\nunsystematic nature. This is again deliberate. For Herder is\nlargely hostile toward systematicity in philosophy (a fact that is\nreflected both in explicit remarks and in many of his titles:\nFragments … , Ideas … , etc.). He is\nparticularly hostile to the ambitious sort of systematicity that is\naspired to in the tradition of Spinoza, Wolff, Kant, Fichte,\nSchelling, and Hegel: the ideal of a comprehensive theory whose parts\ndisplay some sort of strict overall pattern of derivation. He has\ncompelling reasons for this hostility: (1) He is very skeptical that\nsuch systematic designs can be made to work (as opposed to creating,\nthrough illicit means, an illusion that they do). (2) He\nbelieves that such system-building leads to a premature closure of\ninquiry, and in particular to a disregarding or distortion of new\nempirical evidence. Scrutiny of such systems amply bears out both of\nthese concerns. Herder’s well-grounded hostility to this type of\nsystematicity established an important counter-tradition in German\nphilosophy (which subsequently included, for example, Friedrich\nSchlegel, Nietzsche, Wittgenstein, and Adorno).\n\nOn the other hand, Herder is in favor of\n“systematicity” in a more modest sense: the ideal of a\ntheory that is self-consistent and supported by argument (this marks\nan important point of methodological contrast with Hamann, whom Herder\nalready criticizes for failing to provide arguments in an essay from\nearly 1765, Dithyrambic Rhapsody [G1:38]).\nHe by no means always achieves this ideal (so that interpreting him\ncalls for more selectivity and reconstruction than is the case with\nsome philosophers). However, his failures to do so are more often\napparent than real: First, in many cases where he may seem to be\nguilty of inconsistency he is really not. For he is sometimes\ndeveloping philosophical dialogues between two or more opposing\nviewpoints, in which cases it would clearly be a mistake to accuse him\nof inconsistency in any usual or pejorative sense. And (less\nobviously) in many other cases he is in effect still working in this\ndialogue-mode, only without bothering to distribute the positions\namong different interlocutors explicitly, and so is again innocent of\nreal inconsistency (examples of this occur in How Philosophy Can\nBecome and This Too a Philosophy of History). Moreover,\nhe has serious motives for using this method of (implicit) dialogue:\n(1) Sometimes his main motive is simply that when dealing with\nreligiously or politically delicate matters it permits him to state\nhis views but without quite stating them as his own and therefore\nwithout inviting trouble. But he also has philosophically deeper\nmotives: (2) He takes over from the pre-critical Kant an idea\n(inspired by ancient skepticism) that the best way for a philosopher\nto pursue the truth is by setting contrary views on a subject into\nopposition with one another in order to advance toward, and hopefully\nattain, the truth through their mutual testing and modification. (3)\nIn addition, he develops a more original variant of that idea on the\nsocio-historical plane: analogously, the way for humankind as a whole\nto attain the elusive goal of truth is through an ongoing contest\nbetween opposing positions, in the course of which the best ones will\neventually win out (this idea anticipates and indirectly influenced a\ncentral thesis of John Stuart Mill’s On Liberty\n[1859]). This yields a further motive for the dialogue-method (even\nwhen it does not lead Herder himself to any definite conclusion), in\neffect warranting the rhetorical question, And what does it matter to\nthe cause of humankind and its discovery of truth whether those\nvarious opposing positions are advanced by different people or by\nthe same person? Second, Herder’s frequent appearance\nof neglecting to give arguments is often, rather, a principled\nrejection of arguments of certain sorts. For example, he has\na general commitment to empiricism and against apriorism in philosophy\nthat usually leads him to avoid giving familiar sorts of a priori\narguments in philosophy; and a commitment to sentimentalism in ethics\nthat leads him to refrain from familiar sorts of cognitivist arguments\nin ethics.\n3. General Program in Philosophy\n\nThe extent of Hamann’s influence on Herder’s best thought\nhas been greatly exaggerated by some of the secondary literature\n(e.g., Isaiah Berlin). But Kant’s influence was early,\nfundamental, and enduring. However, the Kant who influenced Herder in\nthis way was the pre-critical Kant of the early and middle\n1760s, not the critical Kant (against whom Herder later engaged in\nthe—rather distracting and ineffective—public polemics of\nthe Metacritique and the Calligone).\n\nSome of the pre-critical Kant’s key positions in the 1760s,\nsharply contrasting with ones that he would later adopt during the\ncritical period, were: a (Pyrrhonist-influenced) skepticism about\nmetaphysics; a form of empiricism; and a (Hume-influenced)\nsentimentalism in ethics. Herder took over these positions in the\n1760s and retained them throughout his career. It should by no means\nbe assumed that this debt to the early Kant is a debt to a\nphilosophically inferior Kant, though; a good case could be\nmade for the very opposite.\n\nHerder’s 1765 essay How Philosophy Can Become More Universal\nand Useful for the Benefit of the People is a key text for\nunderstanding both his debt to Kant and the broad orientation of his\nphilosophy. The essay was written under strong influence from Kant,\nespecially, it seems, Kant’s 1766 essay Dreams of a Spirit\nSeer, which Kant sent to Herder prior to its publication\n(“a sheet at a time”, Herder reports\n[B2:259]).\n\nHerder’s essay answers a prize question set by a society in\nBern, Switzerland: “How can the truths of philosophy become more\nuniversal and useful for the benefit of the people?” This\nquestion was conceived in the spirit of the\nPopularphilosophie that was competing with school-philosophy\nin the German-speaking world at the time. Kant himself tended to\nidentify with Popularphilosophie at this period, and\nHerder’s selection of this question shows him doing so as well.\nBut in his case the identification would last a lifetime. Philosophy\nshould become relevant and useful for the people as a whole—this\nis a basic ideal of Herder’s philosophy.\n\nLargely in the service of this ideal, Herder’s essay argues in\nfavor of two sharp turns in philosophy, turns that would again remain\nfundamental throughout the rest of his career. The first turn consists\nin a rejection of traditional metaphysics, and closely follows an\nargument of Kant’s in Dreams of a Spirit Seer.\nHerder’s case is roughly this: (1) Traditional metaphysics,\nthrough undertaking to transcend experience (or strictly speaking, a\nlittle more broadly, “healthy understanding”, which\nincludes, in addition to empirical knowledge, also ordinary morality,\nintuitive logic, and mathematics), succumbs to unresolvable\ncontradictions between its claims, and hence to the Pyrrhonian\nskeptical problem of an equal plausibility on both sides that requires\na suspension of judgment (“I am writing for Pyrrhonists”,\nHerder says [HPW 8]). Moreover (Herder goes on to add\nin the Fragments of 1767–8), given the truth of a\nbroadly empiricist theory of concepts, much of the terminology of\ntraditional metaphysics turns out to lack the basis in experience that\nis required in order even to be meaningful, and is consequently\nmeaningless (the illusion of meaningfulness arising through the role\nof language, which spins on, creating illusions of meaning,\neven after the empirical conditions of meaning have been left behind).\n(2) Traditional metaphysics is not only, for these reasons, useless;\nit is also harmful, because it distracts its adherents from\nthe matters that should be their focus: empirical nature and human\nsociety. (3) By contrast, empirical knowledge (or strictly speaking, a\nlittle more broadly, “healthy understanding”) is free of\nthese problems. Philosophy should therefore be based on and continuous\nwith this.\n\nHerder’s second sharp turn concerns ethics. Here again he is\nindebted to the pre-critical Kant, but he also goes somewhat further\nbeyond him. Herder’s basic claims are these: (1) Morality is\nfundamentally more a matter of sentiments than of cognitions. (2)\nCognitivist theories of morality—of the sort espoused in this\nperiod by Rationalists such as Wolff, but also by many other\nphilosophers before and since (for example, Plato, the critical Kant,\nand G.E. Moore)—are therefore based on a mistake, and so useless\nas means of moral enlightenment or improvement. (3) But (and here\nHerder’s theory moves beyond Kant’s), worse than that,\nthey are actually harmful to morality, because they weaken\nthe moral sentiments on which morality really rests. In This Too a\nPhilosophy of History and On the Cognition and Sensation\nHerder suggests several reasons why: (a) Abstract theorizing weakens\nsentiments generally, and hence moral sentiments in\nparticular (this is perhaps his least interesting reason). (b) The\ncognitivists’ theories turn out to be so strikingly\nimplausible that they bring morality itself into disrepute, people\nreacting to them roughly along the lines of thinking, If this is\nthe best that even the experts can say in explanation and\njustification of morality, then morality must certainly be a sham, and\nI may as well ignore it and do as I please. (c) Such theories\ndistract people from recognizing, and working to reinforce, the\nreal foundations of morality: not an imaginary theoretical\ninsight of some sort, but a set of causal mechanisms that inculcate\nand sustain the moral sentiments. (4) More constructively, Herder\naccordingly turns instead to discovering theoretically and promoting\nin practice just such a set of causal mechanisms. In How\nPhilosophy Can Become he mainly emphasizes forms of education and\nan emotive type of preaching in this connection. But elsewhere he\nidentifies and promotes a much broader set of mechanisms as well,\nincluding: the influence of morally exemplary individuals; morally\nrelevant laws; and literature (along with other forms of art).\nLiterature is a special focus of Herder’s theory and practice\nhere. He sees literature as exerting a moral influence in several\nways—for instance, not only through fairly direct moral\ninstruction, but also through the literary perpetuation (or creation)\nof morally exemplary individuals (e.g., Jesus in the New Testament),\nand through the exposure of readers to other people’s inner\nlives and a consequent enhancement of their sympathies for them (a\nmotive that lies behind his epoch-making publication of the\nPopular Songs [Volkslieder] [1774/1778–9], a\ncollection of translations of poems from peoples around the world).\nHerder’s development of this theory and practice of moral\npedagogy was lifelong and tireless.\n4. Philosophy of Language, Interpretation, and Translation\n\nThe Treatise On the Origin of Language from 1772 is\nHerder’s best known work in the philosophy of language by far.\nHowever, it is in certain respects both unrepresentative and inferior\nin comparison with other works, such as the Fragments and\nOn the Cognition and Sensation, and should not monopolize\nattention.\n\nThe Treatise on the Origin is primarily concerned with the\nquestion whether the origin of language can be explained in purely\nnatural, human terms or (as Süßmilch had recently argued)\nonly in terms of a divine source. Herder argues in support of the\nformer position and against the latter. His argument is quite\npersuasive (especially when supplemented on its positive side from the\nFragments). But this will probably not constitute a modern\nphilosopher’s main reason for interest in Herder’s views\nabout language – deriving its zest, as it does, from a religious\nbackground that is no longer ours, and being an argument that Herder\nlong ago essentially won.\n\nOf far greater modern relevance are three interrelated theories that\nHerder develops: a philosophy of language concerning the very nature\nof language, thought, and meaning; a theory of interpretation; and a\ntheory of translation. These theories are found scattered through a\nlarge number of Herder’s works.\n\nHis theories in these areas owe significant debts to predecessors\n– for example, his philosophy of language to Leibniz, Christian\nWolff, Spinoza, and Ernesti, his theory of interpretation again to\nSpinoza and Ernesti, and his theory of translation to Thomas Abbt.\nHowever, they also include important refinements and elaborations, and\noverall his contribution was enormous.\n\nThe following are the main features of his theories in these\nareas.\n4.1 Philosophy of Language: Language, Thought, Meaning\n\nAlready in the mid-1760s—for example, in On Diligence in\nSeveral Learned Languages (1764) and the Fragments\n(1767–8)—Herder began advancing three fundamental theses\nin this area:\n\nThought is essentially dependent on, and bounded in scope by,\nlanguage—i.e., one can only think if one has a language, and one\ncan only think what one can express linguistically. (This thesis is\nalready prominent in On Diligence and in the\nFragments. To his credit, Herder normally refrains from\nadvancing a more extreme, but philosophically untenable, version of\nthe thesis, favored by some of his successors, that simply\nidentifies thought with language, or with inner\nlanguage.)\nMeanings or concepts are—not the sorts of things, in\nprinciple autonomous of language, with which much of the philosophical\ntradition has equated them, e.g., the referents involved (Augustine),\nPlatonic forms, or subjective mental ideas à la Locke or Hume,\nbut instead—usages of words. (This thesis is already\nprominent in the Fragments. Herder also develops important\narguments for it.)\nConceptualization is intimately bound up with (perceptual and\naffective) sensation. More precisely, Herder develops a\nquasi-empiricist theory of concepts that holds that sensation is the\nsource and basis of all our concepts, but that there is also a\nconverse dependence and that we are able to achieve non-empirical\nconcepts by means of metaphorical extensions from the empirical\nones—so that all of our concepts ultimately depend on sensation\nin one way or another. (For this thesis, see esp. Treatise on the\nOrigin, On the Cognition and Sensation, and the\nMetacritique.)\n\n\nThe first two of these theses dramatically overturned the sort of\ndualistic picture of the relation between language, on the one hand,\nand thought/meaning, on the other, that had predominated during the\nseventeenth and eighteenth centuries. They thereby essentially founded\nthe philosophy of language as we still know it today.\n\nHamann has often been credited with introducing something like these\ntwo revolutionary theses and then passing them on to Herder (e.g., by\nIsaiah Berlin). But that is a mistake; Herder was already committed to\nthem by the mid-1760s, Hamann only later and under Herder’s\ninfluence.\n\nThe third thesis, quasi-empiricism, would be far less widely accepted\nby philosophers of language today. However, it may well be correct\ntoo. Contrary to first appearances, it need not conflict with thesis\n(2), the equation of meanings with word-usages. And the most likely\nmodern ground for skepticism about it, namely, a\nFregean-Wittgensteinian anti-psychologism concerning meaning that is\npopular today, may well itself be mistaken.\n\nIn addition to making a fundamental contribution to the philosophy of\nlanguage, these three theses also underpin Herder’s theories of\ninterpretation and translation (as we are about to see).\n4.2 Theory of Interpretation (Hermeneutics)\n\nHerder’s theories of interpretation and translation both rest on\na certain epoch-making insight of his: Whereas such eminent\nEnlightenment philosopher-historians as Hume and Voltaire had normally\nstill held that, as Hume put it, “mankind are so much the same\nin all times and places that history informs us of nothing new or\nstrange” (1748: section VIII, part I, 65), Herder discovered, or\nat least saw more clearly than anyone before him, that this was false,\nthat peoples from different historical periods and cultures vary\ntremendously in their concepts, beliefs, values, (perceptual\nand affective) sensations, and so forth. He also recognized that\nsimilar, albeit usually less dramatic, variations occur even between\nindividuals within a single period and culture. These positions are\nprominent in many of Herder’s works (see, e.g., On the\nChange of Taste [1766], This Too a Philosophy of\nHistory, and On the Cognition and Sensation). Let us\ncall them together his principle of radical mental\ndifference.\n\nHerder in effect strives to develop a perfectly general theory of\ninterpretation (or achieving understanding), as Schleiermacher later\nwould – a theory that covers both texts and discourse, ancient\nas well as modern, sacred as well as profane, artistic as well as\nnon-artistic, and so on. Indeed, in one important respect, his theory\nis even more general than Schleiermacher’s would be: its\ninclusion of non-linguistic art (sculpture, painting, instrumental\nmusic, etc.). \n\nGiven the principle of radical mental difference, and the gulf that\nconsequently often initially divides an interpreter’s own\nthought from that of the person whom he wants to interpret,\ninterpretation is often an extremely difficult task,\nrequiring extraordinary efforts on the part of the interpreter. (See\nin this connection, e.g., Herder’s discussion of interpreting\nancient Hebrew in Treatise on the Origin.)\n\nIn particular, the interpreter often faces, and needs to resist, a\ntemptation falsely to assimilate the thought that he is\ninterpreting to someone else’s, especially his own. (This theme\nis prominent in This Too a Philosophy of History, for\ninstance.)\n\nHow, given these challenges, is the interpreter supposed to achieve\naccurate interpretation? Herder’s answer comprises several\npoints:\n\nHis three theses in the philosophy of language undergird his whole\ntheory of interpretation and entail certain parts of the answer to the\nquestion just raised. It is an implication of his thesis that all\nthought is essentially dependent on and bounded by language that an\ninterpreted subject’s language is in a certain sense bound to be\na reliable indicator of the nature of his thought, so that the\ninterpreter at least need not worry that the interpreted subject might\nbe entertaining ineffable thoughts or thoughts whose character is\nsystematically distorted by his expression of them in language. It is\nan implication of Herder’s thesis that meaning consists in\nword-usage that interpretation essentially and fundamentally requires\npinning down an interpreted subject’s word-usages, and thereby\nhis meanings. Finally, it is an implication of Herder’s\nquasi-empiricist thesis concerning concepts that an\ninterpreter’s understanding of an interpreted subject’s\nconcepts must include some sort of recapturing of their basis in the\ninterpreted subject’s sensations.\n\nHerder also espouses three further important principles in\ninterpretation-theory that contribute to answering the question raised\nabove:\n\nA principle of secularism in interpretation: Contrary to a\npractice that was still common in Herder’s day in relation to\nthe Bible, the interpretation of texts must never rely on religious\nassumptions or means, even when the texts are sacred ones, but must\ninstead rely only on secular ones. (This principle is already\nprominent in Herder’s writings on biblical interpretation from\nthe 1760s.) Relatedly, the temptation to give allegorical\ninterpretations of sacred texts must be resisted, except in those\nrelatively few cases, such as the parables of the New Testament, where\nthey are clearly warranted by the text (see esp. Songs of\nLove from 1778).\n\nA principle of generic interpretation. In addition to the\nnature of a work’s meanings, interpretation must also identify\nthe nature of its genre (i.e., roughly, a certain set of\ngeneral purposes and rules that it aspires to realize and conform to).\nAs in the case of meanings, genres vary from age to age, culture to\nculture, and even individual to individual, and the interpreter\ntherefore faces, and needs to resist, constant temptations falsely to\nassimilate a work’s genre to others with which he happens to be\nmore familiar (for example, Shakespearean “tragedy” to\nSophoclean “tragedy”, or vice versa). (This principle is\nalready prominent in the Critical Forests from 1769, but\nfinds its classic statement in the essay Shakespeare from\n1773.)\n\nA principle of methodological empiricism in interpretation:\nInterpretation must always be based on, and kept faithful to, exact\nobservations of relevant linguistic (and other) evidence. This applies\nwhen the interpreter investigates word-usages in order to discover\nmeanings (a point that is already prominent in the\nFragments); when he attempts to pin down a work’s\ngenre, or the purposes and rules that constitute it (see esp.\nShakespeare); and (to anticipate a bit) when he makes\nconjectures about an author’s individual psychology (see esp.\nOn Thomas Abbt’s Writings from 1768).\n\nSo far, these principles will probably seem sensible enough. But\nbeyond them, Herder also advances a further set of interpretive\nprinciples that are likely to sound much more touchy-feely at first\nhearing (the first of them, Einfühlung, rather literally\nso!). However, I want to suggest that on the contrary they are in fact\nquite hard-nosed.\n\nHerder proposes (prominently in This Too a Philosophy of\nHistory, for instance) that the way to bridge radical mental\ndifference when interpreting is through Einfühlung,\n“feeling one’s way in”. This proposal has often been\nthought (for example, by Friedrich Meinecke) to mean that the\ninterpreter should perform some sort of psychological self-projection\nonto texts. However, that is not Herder’s main idea\nhere—for making it so would amount to advocating just the sort\nof distorting assimilation of the thought in a text to one’s own\nthat he is above all concerned to avoid. As can be seen from\nThis Too a Philosophy of History, what he mainly has in mind\nis instead a rather arduous process of historical-philological\ninquiry. What, though, more specifically, is the cash value of his\nmetaphor of Einfühlung? It has at least five components,\nwhich are quite various in nature but consistent with each other and\nall quite sensible and deep: (1) First of all, the metaphor implies\n(once again) that the interpreter typically faces a radical\ndifference, a gulf, between his own mentality and that of the\ninterpreted subject, making interpretation a difficult, laborious task\n(it implies that there is an “in” there that the\ninterpreter must carefully and laboriously “feel his way\ninto”). (2) The metaphor also implies more specifically\n(This Too a Philosophy of History shows) that the\n“feeling one’s way in” should include thorough\nresearch not only into a text’s use of language but also into\nits whole geographical, historical, and social context. (3) It also\nimplies a claim—based on Herder’s quasi-empiricist theory\nof concepts—that in order to understand an interpreted\nsubject’s language the interpreter must achieve an imaginative\nreproduction of his (perceptual and affective) sensations. (4) It also\nimplies (This Too a Philosophy of History again shows) that\nhostility in an interpreter toward the people whom he interprets will\ngenerally distort his interpretation, and should therefore be avoided.\n(Herder, though, is equally opposed to excessive\nidentification with them for the same reason.) (5) Finally,\nit also implies that the interpreter should strive to develop his\ngrasp of linguistic usage, contextual facts, and relevant sensations\nto the point where this achieves something like the same immediacy and\nautomaticness that it had for a text’s original author and\naudience when they understood the text in light of such\nfactors (so that it acquires for him, as it had for them, the\nphenomenology more of a feeling than a cognition).\n\nHerder also insists (for example, in the Critical Forests) on\na principle of holism in interpretation. This principle rests\non several motives, including the following: (1) Parts of a text taken\nin isolation are typically ambiguous in various ways (in relation to\nbackground linguistic possibilities). In order to resolve such\nambiguities, an interpreter needs the guidance provided by surrounding\ntext. (2) That problem arises once a range of possible\nlinguistic meanings is established for a piece of text. But in the\ncase of a text that is separated from the interpreter by radical\nmental difference, knowledge of such a range itself presents a\nproblem. How is he to pin down the range of possible meanings, i.e.,\npossible usages, for a word? This requires a collation of the\nword’s actual uses and an inference from these to the rules that\ngovern them, i.e., to their usages, a collation that in turn requires\nlooking to remoter contexts in which the same word occurs (other parts\nof the text, other works in the author’s corpus, works by his\ncontemporaries, etc.), or in short: holism. (3) Authors typically\nwrite a work as a whole, conveying ideas not only in its\nparticular parts but also through the way in which these fit together\nto make up a whole. Consequently, readings that fail to interpret the\nwork as a whole will miss essential aspects of its meaning—both\nthe ideas in question themselves and meanings of the particular parts\non which they shed important light.\n\nSuch holism in interpretation (like the holism of taking into account\na whole geographical, historical, and social context) may seem to lead\nto a certain circularity: in order to interpret the part one needs to\ntake into account the whole, but equally, in order to grasp the whole\none needs to understand its parts. Herder agrees about this, but he\nconsiders the circularity involved benign. Specifically, he recommends\ninterpreting parts in a provisional way in light of a general\nknowledge of the language in order thereby to generate a provisional\ninterpretation of the whole, then applying this provisional\ninterpretation of the whole in order to refine the interpretation of\neach of the parts, and so on, back and forth, indefinitely (see again\nthe Critical Forests). This might seem like a mere\npseudo-solution, but it is not: the key insight on which it implicitly\nrests is that understanding is not an all-or-nothing matter but\ninstead something that comes in degrees. \n\nIn On Thomas Abbt’s Writings, On the Cognition and\nSensation, and elsewhere Herder makes one of his most important\nand influential innovations: interpretation must supplement its focus\non word-usage with attention to the author’s\npsychology. Herder implies several reasons for this (some of\nwhich would subsequently be developed more explicitly and elaborately\nby successors such as Schleiermacher and Friedrich Schlegel): (1) As\nwas already mentioned, he embraces a quasi-empiricist theory of\nconcepts that entails that in order to understand an author’s\nconcepts an interpreter must imaginatively recapture the\nauthor’s relevant sensations. (2) As Quentin Skinner has\nrecently emphasized, understanding the linguistic meaning of an\nutterance or text is only a necessary, not a sufficient, condition for\nunderstanding the utterance/text tout court; in addition, one\nneeds to discover what might nowadays be called the author’s\nillocutionary intentions. For example, I meet a\nstranger by a frozen lake who tells me, “The ice is thin over\nthere”; I understand his linguistic meaning perfectly; but is he\nsimply informing me?, warning me?, threatening me?, joking? …\n(3) Skinner himself tends to imply that one can determine linguistic\nmeanings prior to establishing authorial intentions. That may\nsometimes be so (e.g., in the example just given). But is it\ngenerally so? Herder implies not. And this seems right,\nbecause the linguistic meaning of a formula is often ambiguous (in\nterms of the background linguistic possibilities), and in order to\nidentify the relevant meaning one must turn, not only to larger bodies\nof text (as was already mentioned), but also to hypotheses, largely\nderived from them, concerning the author’s intentions (e.g.,\nconcerning the subject-matter that he intends to treat). This is a\nfurther reason why interpreters need to invoke psychology. (4) As was\nalready mentioned, Herder implies that an author often conveys ideas\nin his work, not explicitly in its parts, but rather via these and the\nway in which they are put together to form a textual whole. It is\nnecessary for the interpreter to capture these ideas, both for their\nown sake and in order thereby to resolve ambiguities at the level of\nthe parts. (5) Herder also implies that the second half of his\ndoctrine of radical mental difference—individual\nvariations in mode of thought even within a single period and\nculture—generates a need for psychological interpretation. Why\ndoes any special need arise here? Part of the answer seems to be that\nwhen an interpreter is dealing with a concept that is distinctive of a\nparticular author rather than common to a whole period/culture, he\ntypically faces a problem of relative paucity and lack of\ncontextual variety in the actual uses of the word that are\navailable as empirical evidence from which to infer the rule for use,\nor usage, constitutive of its meaning. Hence he needs extra\nhelp—and the author’s general psychology may provide this.\n(Points (2) and (5) would subsequently be elaborated by\nSchleiermacher, point (4) by Schlegel.)\n\nIn the same works Herder also indicates that interpretation,\nespecially in its psychological aspect, requires the interpreter to\nuse “divination”. This is another principle that is liable\nto sound disturbingly touchy-feely at first hearing—in\nparticular, it can sound as though Herder means some sort of prophetic\nprocess endowed with a religious basis and perhaps even infallibility.\nHowever, what he really has in mind here is instead, quite differently\nand far more sensibly, a process of hypothesis, based on the meager\nempirical evidence that is available, but also going well beyond it,\nand therefore vulnerable to subsequent falsification, and abandonment\nor revision if falsified. (Etymologically, the French word “deviner”,\nto guess/conjecture is relevant here.)\n\nHerder also implies an additional important point concerning the\ngeneral nature of interpretation: After him, the question would be\nexplicitly raised whether interpretation is a science or an art.\nHerder does not himself explicitly raise or address this question. But\nhis strong inclination would clearly be to say that interpretation is\nlike rather than unlike natural science; see, e.g., already\nOn Thomas Abbt’s Writings. He has several reasons for\nthinking so: (1) He assumes (as indeed did virtually everyone at this\nperiod) that the meaning of an author’s text is as much an\nobjective matter as the subjects investigated by the natural\nscientist. (2) The difficulty of interpretation that results\nfrom radical mental difference, and the consequent need for a\nmethodologically sophisticated and painstaking\napproach to interpretation in many cases, make for further points of\nsimilarity between interpretation and natural science. (3) The\nessential role of “divination”, qua hypothesis,\nin interpretation constitutes yet a further point of similarity\nbetween interpretation and natural science. Moreover, (4) even the\nsubject-matter of interpretation is not, in Herder’s view,\nsharply different from that dealt with by natural science: the latter\ninvestigates observable physical processes in nature in order to\ndetermine the forces that underlie and produce them, but, similarly,\ninterpretation investigates observable human verbal (and non-verbal)\nphysical behavior in order to determine the forces that underlie and\nproduce it (Herder explicitly identifying mental conditions,\nsuch as conceptual understanding, as “forces”).\n\nFinally, Herder also has a set of sophisticated and attractive reasons\nwhy accurate interpretation of the sort that he aims at is important.\nThese include (1) the intrinsic interest of the ideas of historical\nand cultural Others thereby discovered, (2) the cosmopolitan respect\nthat striving to understand them accurately both evinces and\nencourages, (3) the possibility of thereby discovering ideas different\nfrom our own which we can incorporate into our own perspective in\norder to improve it in various ways (e.g., ideas concerning morals or\nart), and (4) the possibility of thereby enhancing not only our\nunderstanding but also our self-understanding, namely, by\ncoming to see in the light of comparisons what is distinctive of our\nown perspective and what not, and by coming to see how it has\ndeveloped historically out of earlier perspectives. \n\nHerder’s theory of interpretation had an enormous and beneficial\nimpact on subsequent hermeneutics. His theory was taken over almost\nwholesale by Schleiermacher in his much more famous lectures on\nhermeneutics, delivered during the first third of the nineteenth\ncentury. In particular, such fundamental and famous positions in\nSchleiermacher’s hermeneutics as his supplementing of\n“linguistic” with “psychological”\ninterpretation and his identification of “divination” as\nthe main method of the latter are due entirely to Herder. Moreover,\nwhere Herder and Schleiermacher do occasionally disagree\nconcerning interpretation, Herder’s position almost always turns\nout to be philosophically superior on reflection.\n\nBy decisively influencing Schleiermacher’s hermeneutic theory\nHerder also exercised an indirect decisive influence on that of\nSchleiermacher’s great pupil August Boeckh, whose\nEncyclopedia and Methodology of the Philological Sciences\n(posthumously published in 1877) essentially reproduced\nSchleiermacher’s theory with only modest elaborations, and\nbecame the standard methodological work for classical scholars and\nothers. Moreover, Boeckh’s one significant departure from\nSchleiermacher’s theory, namely, his addition of\ngeneric (i.e., genre-focused) interpretation to the several\naspects of interpretation that Schleiermacher had already\ndistinguished, in effect simply reincorporated the strong emphasis\nthat Herder had already placed on this.\n4.3 Theory of Translation\n\nHerder already in the Fragments of 1767–8 developed an\nimportant new theory of translation that subsequently went on to have\nan enormous and beneficial impact on both the theory and the practice\nof translation in Germany. The following are some of its key\ntheses:\n\nTranslation (like interpretation) faces a deep challenge due to the\nphenomenon of radical mental difference. It especially does so because\nof the deep differences in concepts that occur between different\nhistorical periods and cultures, and even to some extent between\nindividuals within a single period and culture.\n\nAs a result, translation is in many cases an extremely difficult\nundertaking.\n\nAgain as a result, translation commonly confronts a choice between two\npossible approaches: what Herder calls a “lax” approach\n(i.e., one in which the language and thought of the target text are\nallowed to diverge rather freely from those of the source text) and an\n“accommodating” approach (i.e., one in which they are made\nto conform closely to those of the source text).\n\nHerder rejects the former approach. He does so largely because it\nfails to achieve the most widely accepted and fundamental goal of\ntranslation: semantic faithfulness.\n\nHe in particular rejects a certain rationale for it that Dryden and\nothers had advocated, namely, that a translation should provide\nthe work that the author would have written had his native\nlanguage not been the one he actually had but instead the target\nlanguage. Herder objects to this that due to the essential\ndependence of thought on language and the deep differences in the\nlatter, in cases such as that of translating Homer, for example, the\nauthor could not have written his work in the modern target\nlanguage.\n\nSo Herder urges that the translator should instead err in the other\ndirection, toward “accommodating”.\n\nBut how is this to be achieved?\n\nOne essential means to achieving it that Herder identifies is that the\ntranslator must have interpretive expertise. So Herder\nrequires this.\n\nAnother, much less obvious, means is a certain vitally important\ntechnique that Herder develops for overcoming conceptual discrepancies\nbetween the source language and the target language. That might seem\nsimply impossible (indeed, some more recent philosophers, such as\nDonald Davidson, have hastily assumed that it would be). But Herder,\ndrawing on his novel philosophy of language, finds a solution: Since\nmeanings or concepts are word-usages, in order to reproduce (or at\nleast optimally approximate) in the target language a concept from the\nsource language that the target language so far lacks, the translator\nshould take the closest corresponding word from the target language\nand “bend” its usage for the course of the translation in\nsuch a way as to make it mimic the usage of the source word. This\ntechnique essentially requires that the source word be translated\nuniformly across its multiple occurrences in a work (and also that the\nsingle target word chosen not be used to translate any other source\nwords). Such an approach is far from being common in translation\npractice, so far indeed that it is rarely found in translations.\nHowever, Herder scrupulously uses it in his own translations, as does\nan important tradition that has subsequently followed him in adopting\nit (including Schleiermacher, Franz Rosenzweig, and Martin Buber).\n\nHerder is well aware that using this “bending” approach\nwill inevitably make for translations that are more difficult to read\nthan those that can be produced by a more “lax” method\n(e.g., by using multiple words in the target language to translate a\nsingle word in the source language). However, he considers this price\nwell worth paying in order to achieve maximal semantic accuracy.\n\nAnother key means that Herder adopts is to complement the goal of\nsemantic faithfulness with that of faithfulness to the musical\nform of a work (e.g., meter, rhyme, alliteration, and assonance).\nAs might be expected, his motives for doing this are partly\nextra-semantic: in particular, aesthetic fidelity, and fidelity to the\nexact expression of feelings that is effected by means of a literary\nwork’s musical features. But they are also in part semantic: in\nhis view, musical form and semantic content are strictly inseparable,\nso that fully realizing even the goal of semantic faithfulness in fact\nrequires that a translation also be faithful to the work’s\nmusical form. Why does he believe that musical form and semantic\ncontent are inseparable in this way? He has two main reasons: First,\nmusical forms often carry their own meanings (think, for example, of\nthe humorous and bawdy connotations of the meter/rhyme-scheme of a\nlimerick). Second, as was recently mentioned, Herder believes that\nmusical form is essential to an exact expression of feelings; but, as\nwe saw earlier, he also thinks that feelings are internal to meanings\n(this is part of the force of his quasi-empiricism in the philosophy\nof language); so reproducing a work’s musical form in\ntranslation turns out to be essential even for accurately conveying\nthe meanings of its words and sentences in translation.\n\nIn addition to being necessary in order to achieve translation’s\ntraditional fundamental goal of exactly reproducing meaning (as well\nas aesthetic fidelity and fidelity in the expression of feelings) as\nfully as possible, the more “accommodating” sort of\ntranslation that has been described is also necessary, in\nHerder’s view, in order to achieve certain further important\ngoals. One of these lies in a potential that translation has for\nenriching the target language (both conceptually and in musical\nforms). Herder argues convincingly that whereas “lax”\ntranslation forgoes this opportunity, “accommodating”\ntranslation capitalizes on it.\n\nAnother of these further goals lies in both expressing and cultivating\nin a translation’s readers a cosmopolitan respect for the\nOther—something that requires that the translation reproduce the\nOther’s meanings and musical forms as accurately as\npossible.\n\nHerder holds that the preferred “accommodating” sort of\ntranslation demands that the translator be in a sense a\n“creative genius”, i.e., skilled and creative enough to\nsatisfy the heavy demands that this sort of translation imposes on\nhim, in particular, skilled and creative enough to invent the new\nconceptual and musical forms in the target language that it\nrequires.\n\nDespite his commitment to the central importance of this sort of\ntranslation (largely, as we have seen, due to its necessity for\nachieving translation’s traditional fundamental goal of\nfaithfully reproducing meaning), Herder is also in the end quite\nliberal about the forms that translation—or interlinguistic\ntransfer more generally, including, for example, what he sometimes\ndistinguishes from “translation\n[Übersetzung]” proper as “imitation\n[Nachbildung]” or “rejuvenation\n[Verjüngung]”—can legitimately take. He\nallows that its possible forms are quite various, and that which one\nis most appropriate in a particular case will largely depend on the\nauthor or genre in question and on the translator’s (or\ntransferer’s) purposes.\n\nHerder’s theory of translation (as just summarized), together\nwith his demonstration of its viability in practice, for example, in\nhis sample translations of Shakespeare in the Popular Songs,\nhad an enormous and beneficial impact on a whole generation of German\ntranslation theorists and practitioners—including Johann\nHeinrich Voss (the great translator of Homer), August Wilhelm Schlegel\n(an important translation theorist and the great translator of\nShakespeare), Goethe (a significant theorist of translation), Wilhelm\nvon Humboldt (a significant theorist of translation and translator),\nand especially Schleiermacher (an important theorist of translation\nand Germany’s great translator of the Platonic dialogues).\nHerder’s principle of complementing semantic faithfulness with\nfaithfulness in the reproduction of musical form had an especially\npowerful impact on these successors. His principle of\n“bending” word-usages in order to cope with conceptual\nincommensurabilities was less widely followed, but was adopted by\nSchleiermacher among others. The currently predominant translation\ntheory, the “foreignizing” approach of Antoine Berman and Lawrence\nVenuti, ultimately derives from Herder and Schleiermacher, and is\nindeed less an improvement on their version than an impoverishment of\nit (especially concerning meaning).\n5. Role in the Birth of Linguistics and Anthropology\n\nHerder’s philosophy of language and interpretation, together\nwith several further philosophical principles that he developed, made\na vitally important contribution to the birth of two whole new\nacademic disciplines that did not really yet exist in his day but\nwhich we today take for granted: linguistics and cultural\nanthropology. (For further details, see Section 1 of the\n Supplementary Discussion.)\n6. Philosophy of Mind\n\nIn On the Cognition and Sensation from 1778 and elsewhere\nHerder develops an important and influential position in the\nphilosophy of mind. The following are some of its central\nfeatures.\n\nConcerning the fundamental mind-body problem, Herder tried out various\nsolutions over the course of his career, but the considered solution\nat which he eventually arrived was uncompromisingly\nnaturalistic and anti-dualistic.\n\nIn On the Cognition and Sensation he undertakes to erase the\ntraditional sharp division between the mental and the physical in two\nspecific ways: First, he advances a theory that minds and mental\nconditions consist in forces [Kräfte] that\nmanifest themselves in people’s bodily behavior—just as\nphysical nature involves forces that manifest themselves in the\nbehavior of bodies. Officially, he remains agnostic on the question of\nwhat force is, except for conceiving it as something apt to produce a\ntype of bodily behavior, and as a real source thereof (not merely\nsomething reducible thereto). This, strictly speaking, absolves his\ntheory of certain common accusations (for example, H.B. Nisbet and\nFrederick Beiser’s characterization of it as\n“vitalist”). But it also leaves it with enough content to\nhave great virtues over rival theories: (1) The theory ties types of\nmental states conceptually to corresponding types of bodily\nbehavior—which seems correct (e.g., the desire to eat an apple\nseems not just contingently but conceptually tied to behavior that\ntends toward apple-eating), and which therefore marks a point of\nsuperiority over both dualistic theories and mind-brain identity\ntheories. (2) On the other hand, the theory avoids reducing\nmental states to bodily behavior—which again seems correct,\ngiven such obvious facts as that we can be, and indeed often are, in\ntoken mental states that happen to receive no behavioral manifestation\nat all, and which hence constitutes a point of superiority over\nbehaviorist theories. (3) Moreover, Herder’s official\nagnosticism about what (mental) force is can be seen, not as the\ntheoretical weakness it might seem to be, but as showing his\nrecognition of the important conceptual fact (recently exploited by\nfunctionalists in their “multiple realizability argument”)\nthat although the concepts of mind and mental conditions imply a real\nsource of a type of behavior, they do not imply anything about the\nnature of that source’s constitution.\n\nSecond, Herder also tries to explain the mind in terms of the\nphenomenon of irritation [Reiz], a phenomenon that\nhad recently been identified by the physiologist Albrecht von Haller,\nand which is paradigmatically exemplified by muscle fibers contracting\nin response to direct physical stimuli and relaxing upon their\nremoval—in other words, a phenomenon which, while basically\nphysiological, also seems to exhibit a transition to mental\ncharacteristics. There is an ambiguity in Herder’s position\nhere: Usually, he wants to resist physicalist reductionism, and so\nwould be reluctant to say that irritation is purely physiological and\nfully constitutes mental states. However, in the 1775 draft of On\nthe Cognition and Sensation, and even in parts of the published\nversion, that is his position. And from a modern standpoint,\nthis is arguably a further virtue of his account (albeit that we would\nof course today want to recast it in terms of different, and much more\ncomplex, physiological processes than irritation).\n\nThis second line of thought might seem at odds with the first one\n(forces). But it need not be. For, given Herder’s official\nagnosticism about what forces are, this second line of thought could,\nso to speak, fill in the “black box” of the hypothesized\nreal forces, namely in physicalist terms. In other words, it turns out\n(not indeed as a conceptual matter, but as a contingent one) that the\nreal forces in question consist in physiological processes.\n\nHerder’s philosophy of mind also advances another important\nthesis: that the mind is a unity, that there is no sharp\ndivision between its faculties. This thesis contradicted theorists\nsuch as Sulzer and Kant. However, it was not in itself new with\nHerder, having already been espoused in a strong form by the\nRationalists, especially Wolff (Herder’s introduction to his\n1775 draft shows that he is fully aware of this debt). Where Herder is\nmore original is in rejecting the Rationalists’ reduction of\nsensation and volition to cognition; establishing the unity thesis in\nan empirical rather than an apriorist way; and adding a normative\ndimension to it—this is not only how the mind is but\nalso how it ought to be. This last feature might sound\nincoherent at first hearing, for if the mind is this way by its very\nnature, what sense can there be in prescribing to people that it\nshould be so rather than otherwise? However, Herder’s idea here\nis rather the perfectly coherent one that, while the mind is indeed\nthis way by its very nature, people nonetheless sometimes behave as\nthough one faculty could be abstracted from another, and try to effect\nsuch an abstraction, but this then leads to various malfunctions, and\nshould therefore be avoided.\n\nHerder’s overall thesis of the mind’s unity rests on four\nmore specific doctrines concerning intimate mutual involvements\nbetween mental faculties, and malfunctions that arise from resisting\nthem, doctrines that are in large part empirically grounded and hence\nlend the overall thesis a sort of empirical basis as well:\n\nA first doctrine concerns the relation between thought and language:\nNot only does language of its very nature express thought (an\nuncontroversial point), but also (as we noted earlier) for Herder\nthought is essentially dependent on and bounded by language. Herder\nlargely bases this further claim on empirical grounds (for example,\nconcerning how children’s thought develops in step with language\nacquisition). The normative aspect of his position here is that\nattempts (in the manner of some forms of metaphysics, for example) to\ncut thought free from the constraints of language lead to\nnonsense.\n\nA second area of intimate mutual involvement concerns cognition and\nvolition, or affects. The claim that volition is and should be based\non cognition is not particularly controversial. But Herder also argues\nthe converse, that all cognition is and should be based on volition,\non affects—and indeed, not only on such relatively anemic\naffects as the impulse to know the truth, but also on much less anemic\nones. In this connection, he is especially concerned to combat the\nidea that theoretical work in philosophy or the sciences is or should\nbe detached from volition, from affects. In his view, it never really\nis even when it purports to be, and attempts to make it so merely\nimpoverish and weaken it. His grounds for this whole position are\nagain mainly empirical in nature.\n\nA third area of intimate mutual involvement concerns thought and\nsensation. Conceptualization and belief, on the one hand, and\nsensation, on the other, are intimately connected according to Herder.\nThus, he advances the quasi-empiricist theory of concepts that was\nmentioned earlier, which entails that all of our concepts (and hence\nalso all of our beliefs) ultimately depend in one way or another on\nsensation. But conversely, he also argues (anticipating much important\ntwentieth-century work in philosophy) that there is a dependence in\nthe other direction: that the character of an adult human\nbeing’s sensations depends on his concepts and beliefs.\nNormatively, he sees attempts to violate this interdependence as\ninevitably leading to intellectual malfunction—for example, as\nhas already been mentioned, he thinks that metaphysicians’\nattempts to cut entirely free from the empirical basis of our concepts\nlead to meaninglessness. His grounds for this whole position are again\nlargely empirical in character.\n\nA fourth area of intimate mutual involvement concerns unity among the\nfaculties of sensation themselves. For one thing, Herder implies that\nour underlying animal nature involves a sort of primordial fusion of\nperceptual with affective sensations (albeit that, unlike other\nanimals, we also have a distinctive ability to suspend this fusion, an\nability that he calls Besonnenheit). For another thing, he\nargues that the several faculties of perceptual sensation themselves\nform a sort of unity. His grounds for these two positions are again\nmainly empirical in character. In particular, he says that the unity\nof the several faculties of perceptual sensation is shown by clues\nthat emerge in unusual situations and in pathological cases. For\nexample, he argues that the dependence of the mature sense of sight on\nthe sense of touch is shown both by the way in which the sense of\nsight develops in young children and by the way in which it develops\nafter medical operations on previously blind people such as\nCheselden’s blind man.\n\nIn a further seminal move in the philosophy of mind Herder argues that\nlinguistic meaning is fundamentally social—so that thought and\nother aspects of human mental life (since they are essentially\narticulated in terms of linguistic meanings), and therefore even the\nvery self (since the self is essentially dependent on thought and\nother aspects of human mental life, and moreover defined in its\nspecific identity by theirs), are so too. Herder’s version of\nthis position seems intended only as an empirically based causal\nclaim. It has since fathered a long tradition of attempts to generate\nmore ambitious cases for stronger versions of the claim that\nmeaning—and hence also thought, human mental life more\ngenerally, and the very self—is at bottom socially constituted\n(for example, in Hegel, Wittgenstein, Kripke, Burge, and Brandom).\nHowever, it may well be that these more ambitious cases and stronger\nversions do not work, and that Herder’s original version is\nexactly what should be accepted.\n\nAs we have seen, Herder also, in tension but not contradiction with\nthis principle of sociality, holds that (even within a single period\nand culture) human minds are as a rule deeply individual,\ndeeply different from each other—so that in addition to a\ngeneralizing psychology there is also a need for a psychology oriented\nto individuality. This is an important idea that has strongly\ninfluenced many subsequent continental thinkers (for example,\nSchleiermacher, Nietzsche, Proust, Sartre, and Manfred Frank). Herder\nhimself advances it only as an empirically based rule of thumb. By\ncontrast, a prominent strand in Schleiermacher and Frank purports to\nestablish it as an a priori universal truth. However, here again\nHerder’s original version is arguably the more plausible\none.\n\nFinally, like predecessors in the Rationalist tradition and Kant,\nHerder sharply rejects the Cartesian idea of the mind’s\nself-transparency—instead insisting that much of what occurs in\nthe mind is unconscious, so that self-knowledge is often deeply\nproblematic. In addition, he identifies literature (e.g., Shakespeare)\nas an especially rich source of insights into the unconscious. This is\nanother compelling position that has had a strong influence on\nsubsequent thinkers (both in the philosophy of mind and in\nhermeneutics).\n\nThis whole Herderian philosophy of mind owes much to predecessors,\nespecially ones in the Rationalist tradition. But it is also in many\nways original. The theory is not only important in its own right, but\nalso exercised an enormous influence on Herder’s successors,\nincluding Schleiermacher, Hegel, and Nietzsche.\n7. Aesthetics\n\nUnlike his teacher Kant, who had relatively little interest in or\nknowledge of literature and art, and whose treatment of them in the\nCritique of the Power of Judgment (1790) is correspondingly\nweak, Herder had a passionate interest in and a deep knowledge of\nthem, and as a result was able to develop a rich set of original and\nimportant ideas about them. In this respect he set a valuable\nprecedent that would be followed in the next generation by the\nRomantics (especially Friedrich and August Wilhelm Schlegel) and\nHegel.\n\nHerder also anticipated and influenced the Romantics in another\nimportant way. One of their most striking and distinctive positions\nwas a certain valorization of literature and art over other areas of\nculture (such as science, religion, and morality). But Herder had\nalready developed such a position before them. First, from an early\nperiod he argued that song was the origin of all language\n– and consequently also of all thought. Second, in works such as\nthe Treatise on the Origin and especially the essay On\nImage, Poetry, and Fable (1787) he argued that all language (and\nconsequently also all thought) is fundamentally figurative or\nmetaphorical in nature—for example, that its grammar typically\nprojects the two genders onto the whole of nature, and that it\npervasively involves a set of creative transitions from an object to a\nsensory stimulus to an individualistically formed image and thence to\nthought and language—and is thus poetic. Third, he\nargued in works such as Attempt at a History of Lyric Poetry\n(1764) and On the Spirit of Hebrew Poetry that poetry has\nbeen fundamental to religion from the beginning, and elsewhere that\nnon-linguistic art, especially sculpture, has played an important role\nin religion from an early period as well. Fourth, he also argued that\npoetry has a very important function in moral education, indeed one\neven more important than that of other mechanisms of moral education\nsuch as laws.\n\nWhat, beyond this, are Herder’s most important contributions to\naesthetics? He is skeptical about the sort of aprioristic and\nsystematic aesthetics that the inventor of the discipline of\naesthetics, the Rationalist philosopher Baumgarten, had recently\ndeveloped. Instead, he calls for a bottom-up, or empirical,\napproach to the discipline. And his considered position concerning the\nideal of an aesthetic system is dismissive as well. It is\ntrue that he began his career aspiring to something of the sort and\nthat in the Critical Forests (1769) he accordingly set out to\nargue for the following little aesthetic system: whereas music is a\nmere succession of objects in time, and sculpture and painting are\nmerely spatial, poetry has a sense, a soul, a force; whereas music,\nsculpture, and painting belong solely to the senses (namely, to\nhearing, feeling, and vision, respectively), poetry not only depends\non the senses but also relates to the imagination; whereas music,\nsculpture, and painting employ only natural signs, poetry\nuses voluntary and conventional ones. It is also\ntrue that this system would later be taken over (with only minor\nmodifications) by Schleiermacher in his aesthetics lectures, and that\nit has sometimes been touted as Herder’s main achievement in\naesthetics more recently as well (for example, by Robert Norton). But\nas Herder himself quickly came to realize after formulating it, it is\na very naive system. And his real achievements in aesthetics are other\nthan and contrary to it.\n\nLet us turn to those real achievements, then. One of them concerns the\nrelation between art and language. As we saw earlier, Herder’s\nphilosophy of language is committed to the two doctrines that thought\nis essentially dependent on and bounded by language, and that meaning\nis word-usage. This prompts certain questions. These doctrines make a\nplausible break with a common Enlightenment assumption that thought\nand meaning are in principle autonomous of whatever material,\nperceptible expressions they may happen to receive. Following Charles\nTaylor, we might call such a move one to “expressivism”.\nBut what form should expressivism take exactly? Is the\ndependence of thought and meaning on external symbols strictly one on\nlanguage (in the usual sense of “language”)? Or\nis it rather a dependence on a broader range of symbolic media\nincluding, besides language, also such things as painting, sculpture,\nand music—so that a person might be able to entertain thoughts\nthat he was not able to express in language but only in some other\nsymbolic medium? Let us call the former position narrow\nexpressivism and the latter broad expressivism.\n\nHamann in his Metacritique, despite verbally echoing\nHerder’s two doctrines in the philosophy of language, espoused a\nversion of broad expressivism. But Herder adopted narrow expressivism,\nas those two doctrines already seem to imply. Moreover, after much\nwrestling with the subject, he eventually developed a very attractive\nversion of narrow expressivism. The key work here was again the\nCritical Forests. By the time of writing this work, Herder\nwas already committed to the two doctrines in question, and, as this\nwould suggest, from the start in the work he was committed to narrow\nexpressivism. However, his commitment to it there was initially\nunsatisfactory and indeed inconsistent. For one thing, it initially\ntook the implausible form of denying to the non-linguistic arts any\ncapacity to express thoughts autonomously of language by\ndenying that they can express thoughts at all. This was the\nforce of the naive theory recently described that the work initially\nset out to develop. Adding inconsistency to this unsatisfactoriness,\nHerder was from the start in the work also committed to saying (far\nmore plausibly) that visual art often does express\nthoughts—for example, he intervened in a quarrel between Lessing\nand Winckelmann on the question of whether linguistic art (especially\npoetry) or visual art (especially sculpture) is expressively superior\nin ways that tended to support Winckelmann’s case for visual\nart. This unsatisfactoriness and inconsistency mainly resulted\nfrom Herder’s oversight of a single fact: that it is perfectly\npossible to reconcile narrow expressivism with the attribution of\nthoughts to non-linguistic art, namely, by insisting that the\nthoughts expressed by non-linguistic art must be derivative from and\nbounded by the artist’s capacity for linguistic expression.\nHowever, by the time Herder wrote the later parts of the Critical\nForests, he had found this solution. Thus in the third part,\nfocusing on a particularly instructive example, he notes that the\npictorial representations on Greek coins are typically allegorical in\nnature. And by the time he writes the fourth part he is prepared to\nsay something similar about much painting as well, writing there, for\nexample, of “the sense, the allegory, the story/history that is\nput into the whole of a painting” (G2:313). By\n1778 he extends this account to sculpture as well. Thus in the essay\nSculpture [Plastik] from 1778 he abandons the merely\nsensualistic conception of sculpture that had predominated in the\nCritical Forests and instead argues that sculpture is\nessentially expressive of, and therefore needs to be interpreted by, a\nsoul. But this no longer forces him into unfaithfulness to\nhis principle that thought is essentially dependent on, and bounded\nby, language, for he now conceives the thoughts that are expressed by\nsculpture as having a linguistic source:\n\n\nThe sculptor stands in the dark of night and gropes toward the forms\nof gods. The stories of the poets are before and in him.\n(G4:317)\n\n\nSubsequently, in the Theological Letters (1780–1) and\nthe Letters for the Advancement, Herder extends the same\nsolution to instrumental music as well.\n\nThe considered position at which Herder eventually arrived also\nimplies that “non-linguistic” art is dependent on thought\nand language in another way: In the fourth and final part of the\nCritical Forests (which was only published posthumously in\nthe nineteenth century) he develops the point that human perception is\nof its nature infused with concepts and beliefs, and consequently with\nlanguage—which of course implies that the same is true of the\nperception of “non-linguistic” artworks in particular. So\n“non-linguistic” art is really doubly dependent on thought\nand language: not only for the thoughts that it expresses but\nalso for those that it presupposes in perception.\n\nWith Herder’s achievement of this refined form of narrow\nexpressivism and Hamann’s articulation of his broad\nexpressivism, there were now two somewhat plausible but competing\ntheories available. Nineteenth- and twentieth-century German theorists\n(e.g., Hegel, Schleiermacher, Dilthey, and Gadamer) would subsequently\nbe deeply torn between them. And the issue remains an important one\ntoday. While the philosophical considerations involved are difficult,\nI believe, and have argued elsewhere, that Herder’s position is\nthe correct one.\n\nHerder’s position here also carries important implications for\nhermeneutics. Since, in his considered view, thought/meaning and\nlanguage play important roles not only in literature but also in\n“non-linguistic” art, for him both cases present similar\ninterpretive challenges, requiring similar interpretive solutions.\n\nAnother of Herder’s most important contributions to aesthetics\nlies in his historicism, or, more broadly, his recognition that there\nare radical mental differences between historical periods, cultures,\nand even individuals. In connection with literature and art this\nposition takes five main specific forms.\n\nFirst, as we have already seen, Herder holds that concepts, beliefs,\nvalues, and so on vary deeply between historical periods, cultures,\nand even individuals. This obviously applies to literature in\nparticular. Moreover, since, as we have just seen, for Herder\nseemingly non-linguistic arts such as painting, sculpture, and music\nlikewise presuppose and express concepts, beliefs, and values, it also\napplies to them.\n\nSecond, Herder holds that genre—i.e., a certain set of purposes\nand rules—is an essential aspect of any work of literature or\nart. But he also holds that genres differ in deep ways between\nhistorical periods (as well as between cultures and even individuals),\nand this not only in the sense that new genres emerge and old ones\ndie, but also in the sense that seeming continuities in genre\ntypically in fact mask important differences. For example, in the\nessay Shakespeare (1773) he argues in detail that the genres\nof ancient Greek “tragedy” and Shakespearean\n“tragedy”, which interpreters have often assumed to be the\nsame, are in fact deeply different from each other, constituted by\ndifferent purposes and rules. Similarly, in This Too a Philosophy\nof History (1774), he argues, against Winckelmann, who had tended\nto assimilate the genres of ancient Greek portrait sculpture and\nPharaonic Egyptian portrait sculpture, that whereas the former was\ndominated by the genre-purpose of portraying this-worldly life, charm,\nand beauty, the latter had the quite contrary genre-purpose of\nconveying ideas of death and eternity.\n\nThird, Herder argues that literature started out predominantly\nsensuous in character but then became increasingly intellectual as\nhistory proceeded. In the early essays On the Ode (1764/5)\nand Attempt at a History of Lyric Poetry he explains this\ndevelopment in terms of a diminution of strong feelings (e.g., fear)\nand an increase in mental complexity and science, and he regards it as\na sort of decline. Later on, in the Letters for the\nAdvancement, he retains the descriptive part of this account, but\nrevises its conception that a decline is involved: the more sensuous\npoetry of the ancients and the more intellectualized poetry of the\nmoderns are two different but equally legitimate types of poetry.\n(This new position would strongly influence the Romantics.)\n\nFourth, Herder holds that aesthetic values such as beauty are\nfundamentally a matter of feelings and that the feelings in question\nvary in important ways between one period, culture, or even individual\nand another. This theme is already prominent in On the Ode,\nwhere he discusses major differences in the feelings of beauty that\noccur between different periods/cultures—for example, between\nhis own age and the age of the ancient Greeks. It is also prominent in\nOn the Change of Taste (1766), where he adds that the changes\ninvolved are indeed sometimes extreme enough to amount to an outright\ninversion.\n\nFifth, Herder holds that it is an essential part of the function of\nliterature and art to communicate moral values, but he also observes\nthat the moral values communicated often differ in deep ways from one\nperiod, culture, or individual to another. For example, in Attempt\nat a History of Lyric Poetry he argues (very insightfully) that\nearly Greek poetry, especially Homer, communicates a very different\nset of moral values than our own.\n\nThese historicist insights concerning literature and art are extremely\nimportant in their own right. In addition, Herder sees that they carry\ndeep implications for the interpretation and the critical\nevaluation of literature and art. Let us reconsider the first two\nof them in this connection.\n\nThe first insight concerns radical differences in concepts, beliefs,\nvalues, and so on. Since literature paradigmatically expresses such\nthings and is obviously linguistic, Herder’s general hermeneutic\nprinciples for interpreting linguistic texts and discourse in the face\nof radical mental difference (as already discussed) of course apply to\nliterature in particular. Accordingly, in the Critical\nForests he emphasizes that it is important to penetrate\nHomer’s alien linguistic and conceptual world by using careful\nphilological means; that it is always necessary to interpret the local\nfeatures within a work, for example, “ridiculous”\npassages, such as the Thersites passage, in the Iliad (II:\n211–277), in light of the economy of the whole work; and (this\ntime in connection with the example of Horace’s odes) that the\nsolution to the problem of achieving such holism despite the need to\ninterpret the parts of a text sequentially lies in working through the\ntext in sequence in order to arrive at a provisional interpretation of\nall its parts together, then applying this provisional interpretation\nof the whole text in order to refine the interpretation of each part,\nand so on indefinitely.\n\nBut since Herder also holds that such seemingly non-linguistic forms\nof art as painting, sculpture, and music likewise presuppose and\nexpress concepts, beliefs, values, and so on that are ultimately\ngrounded in language, he believes that the same general hermeneutic\nprinciples for interpreting linguistic works in the face of radical\nmental difference also make an essential contribution to the\ninterpretation of this sort of art.\n\nMoreover, since understanding what a piece of literature or art\npresupposes or expresses is obviously a prerequisite for evaluating it\nproperly, this sort of hermeneutic approach is not only essential for\ninterpreting it but also for evaluating it.\n\nOur second example concerns genre. Herder believes,\nplausibly, that a work of art is always written or made in order to\nexemplify a certain genre, and that it is vitally important for the\ninterpreter to identify its genre if he is to understand it.\n\nWhy does Herder believe that identifying genre is essential for\nunderstanding? He has at least three reasons in mind (all of them good\nones): First, grasping a work’s genre is itself an essential\nconstituent of understanding the work and its contents (much as\ngrasping a sentence’s meaning and illocutionary force is an\nessential constituent of understanding the sentence and its contents).\nSecond, since an author intends his work to exemplify a certain genre,\nthere will normally be aspects of the work’s meaning that are\nexpressed, not explicitly in any of its parts, but rather through its\nintended exemplification of the genre. Third, correctly identifying\nthe genre is also vitally important for accurately interpreting many\nthings that are expressed explicitly in the parts of a\nwork.\n\nHowever, as we noted, Herder introduces an important historicist\ninsight about genre here: he recognizes that even when different\nhistorical periods, cultures, or individuals appear to share a single\ngenre—for example, ancient Greek “tragedy” and\nShakespearean “tragedy”, or Pharaonic Egyptian\n“portrait sculpture” and ancient Greek “portrait\nsculpture”—this appearance usually in fact masks important\ndifferences.\n\nThis has important consequences for interpretation. For example, it\nleads Herder to emphatically reject apriorism as an approach to\nidentifying a work’s genre—certainly the absolute\napriorism of refusing in one’s definition of the genre to be\nguided by an observation of examples at all, but also the more\ntempting relative apriorism of indeed allowing oneself to be guided by\nit but restricting the examples considered to a limited number of\ncases to the exclusion of other ones to which the resulting\ngenre-conception is then to be applied in interpretation. For, in\nlight of the historicist insight just mentioned, even the latter\nprocedure will usually turn out to be disastrously misleading, in\nHerder’s view.\n\nInstead, according to Herder, the interpreter should approach the task\nof identifying the genre involved in a work in a thorough and\nscrupulous empirical manner. As one might expect, this above all\nrequires examining the work itself closely in order to discover which\ngenre-purposes and -rules are operative within it. But it also\nrequires taking into account the whole social context within which the\nwork was produced and the historical genesis of its genre through\nantecedent genres. In addition, it may sometimes include taking into\naccount an author’s or artist’s explicit statements about\nthe genre that he is using.\n\nMoreover, Herder emphasizes that correctly identifying the genre of a\nwork by these means is vitally important not only for\ninterpreting the work correctly, but also for critically\nevaluating it correctly: French critics not only make an\ninterpretive mistake when they go to Shakespeare’s\ntragedies with a genre in mind from the ancient world that was not in\nfact his, but they also, on this basis, make an evaluative\nmistake: because they falsely assume that he somehow must be aspiring\nto realize the genre-purpose and -rules that Aristotle found in\nancient tragedy, they fault him for failing to realize these, while at\nthe same time they overlook the quite different genre-purpose and\n-rules that he really does aspire to realize and his success in\nrealizing these. Similarly, Winckelmann not only makes an\ninterpretive mistake when he implicitly imputes to the\nEgyptians a Greek genre-conception for sculpture that was not theirs,\nbut also, on this basis, makes an evaluative one: because he\nfalsely assumes that the Egyptians somehow must be aspiring to realize\nthe Greek genre-purpose and -rules, he faults them for failing to\nrealize these, and at the same time he overlooks their success in\nrealizing the very different genre-purpose and -rules that they really\ndo aspire to realize.\n\nHerder’s new historicist approach to interpreting and evaluating\nliterature and art led to enormous progress in the actual\ninterpretation and critical evaluation of both. For example, it\nenabled the Schlegel brothers to achieve a much deeper understanding\nof ancient tragedy than had been achieved before, an\n(anti-Aristotelian) understanding of it on which all serious classical\nscholarship concerned with it has rested since. And it not only\nenabled Friedrich Schlegel (in his work on paintings in the Louvre and\non cathedral architecture) to develop a similar approach to visual\nart, but also (in part thereby) made possible the highly sophisticated\ntwentieth-century art history of Erwin Panofsky and Ernst Gombrich,\nwhich transcended previous art historians’ (Kant-influenced)\noveremphasis on style in visual art to include a scrupulously\nhistoricist attention to the role of meaning and genre in it as\nwell.\n\nHerder also has important ideas concerning a topic that has often been\nassumed to be central to aesthetics: beauty. A first\nimportant idea he develops here (both in relation to art and more\ngenerally) is that standards of beauty vary greatly from one\nhistorical period or culture to another. At least, this is his normal\nposition, from early works such as On the Ode and On the\nChange of Taste to late ones such as the Calligone\n(where he invokes it against Kant’s Critique of the Power of\nJudgment). Occasionally—for example, in the Critical\nForests and even at points in the Calligone—he\ninstead argues (as other thinkers, such as Hume, had done before him)\nthat there is a deeper uniformity in standards of beauty across\nhistorical periods and cultures. However, the former position is his\nmore considered one and is ultimately the more plausible one.\n\nA second important idea, which he already develops in the Critical\nForests and then repeats in the Calligone, concerns the\nvery concept of beauty. He argues, plausibly, that the concept’s\norigins lay in visual experience (as, he thinks, is suggested\nby an etymological connection in German between the words\nschön [beautiful] and Schein [shine,\nappearance]), but that it has since been extended from that primary\ndomain to cover virtually “everything that has a pleasurable\neffect on the soul”, that in this sense “sight …\nallegorizes the images, the representations, the conceits of the\nsoul”, so that beauty just becomes our most general\nterm of approval for whatever we find pleasing in relation to any of\nthe senses and indeed even mental life more broadly\n(G2:289–291).\n\nA third important idea that he develops is that beauty is in fact much\nless important in literature and art than it has often been thought to\nbe. This demotion of beauty is based not only on his somewhat\ndeflationary genealogy of the concept just mentioned but also on his\nproto-Romantic conception that literature and art have fundamental\nfunctions in relation to language/thought, religion, and morality, and\non his mature insistence that meaning and thought play a vital role\neven in “non-linguistic” art. He tended to accentuate this\ndemotion of beauty increasingly as time went on. Accordingly, whereas\nin early works such as On the Ode and the Critical\nForests he still treated beauty as central to aesthetics, by the\ntime he writes the Calligone he has changed his mind and now\ninsists that it is not nearly as essential to art as it is often taken\nto be. In particular, he argues there that art is much more\nessentially a matter of Bildung—cultural formation or\neducation (especially in moral respects).\n\nFinally, let us consider Herder’s thesis that literature and art\nhave a morally educative function a little further. In On the\nEffect of Poetic Art on the Ethics of Peoples in Ancient and Modern\nTimes (1778), On the Influence of the Belles Lettres on the\nHigher Sciences (1781), and the Calligone he not only\nsees this as one of their most essential functions, but also holds\nthat literature has a more powerful effect as an instrument of moral\neducation than other such instruments, including law.\n\nHe also develops a nuanced account of how literature and art do and\nshould perform this function. For example, in On the\nInfluence he specifies three distinct ways in which literature or\npoetry promotes the formation of moral character. First, it does so\n“through light rules”—in other words, through a\nsubtle articulation of ethical principles. Second, and more\nimportantly in his view, it does so by representing good moral role\nmodels in a positive light so that people will emulate them:\n“still better, through good examples”. Third, it also does\nso by conveying a range of practical experience that is conducive to\nthe formation of moral character and which would otherwise have to be\nacquired, if at all, by the more arduous and painful route of\nfirst-hand experience. In addition, Herder elsewhere implies a fourth\nimportant way in which literature contributes to moral character\nformation: it is a fundamental principle underlying his Popular\nSongs that literature, by vividly conveying the inner\nlives—for instance, the fears, hopes, and joys—of other\npeople to its audience or readership, will stir the latter’s\nsympathies for them and thereby inculcate more moral attitudes toward\nthem. Fifth, Herder in the Calligone adds a further point,\nconcerning “non-linguistic” art, namely, that visual art\nhas a power to make moral ideals attractive by presenting them blended\nwith physical beauty, and that, similarly, music has a power to affect\nmoral character either for good or for ill depending on the principles\nof conduct that are associated with it.\n\nHerder’s conception that the formation of moral character both\nis and ought to be a primary function of literature and art serves him\nas an important criterion for evaluating individual works. For\nexample, when he observes in On the Effect that unlike\nearlier poetry modern poetry has typically lost this function, he\nmeans this as a serious criticism of modern poetry. And he applies\nthis criterion as a ground for criticizing certain works by his friend\nGoethe that he considers to be immoral or amoral in content.\n8. Moral Philosophy\n\nHerder also develops a powerful and historically influential moral\nphilosophy. This includes positions in both meta-ethics and\nfirst-order morality. Let us consider the former first.\n\nAs in the philosophy of mind, Herder’s position in meta-ethics\nis naturalistic in spirit. Such a position was by no means\nuncontroversial in his day, as can be seen, for example, from his\ncorrespondence with Mendelssohn in 1769 concerning Spalding’s\nand Mendelssohn’s religious, afterlife-focused conception of\nhumankind’s “vocation [Bestimmung]”, which\nHerder sharply opposed in favor of a this-worldly conception of the\nsame.\n\nAs was mentioned earlier, Herder in particular holds a sentimentalist\nposition concerning the nature of morality: rather than being a sort\nof knowledge of objective facts (as in Plato’s moral theory, for\nexample) or a set of deliverances of universal reason (as in the\ncritical Kant’s moral theory, for instance), morality is\nfundamentally an expression of human sentiments. Herder already\nespouses such a position in How Philosophy Can Become (1765),\ncontinues it in This Too a Philosophy of History (1774)\n(where he usually refers to the sentiments in question as\nNeigungen, inclinations), and still holds it in Letters\nfor the Advancement (1793–7) (where he usually refers to\nthem as Gesinnungen, attitudes).\n\nHerder took over this position from his teacher, the pre-critical\nKant, who had similarly espoused a form of sentimentalism in\nDreams of a Spirit Seer (1766). Via Kant it can ultimately be\ntraced back to the British sentimentalist tradition, especially Hume,\nwhose main argument for it Herder seems to echo at points in This\nToo a Philosophy of History: moral judgment of its very nature\nmotivates; but reason does not motivate, only sentiments do that;\ntherefore moral judgment must fundamentally consist of sentiments.\n\nHowever, Herder’s sentimentalism is not crude or unqualified (as\nHume’s arguably was), for he recognizes that\ncognition—i.e., concepts and beliefs—plays a major role in\nmorality as well. This can already be seen from the Critical\nForests (1769), where he argues against cruder theories of moral\nvalue that equate them with sentiments abstracted from all cognition,\nand where in the fourth part he indeed argues that sensations in\ngeneral are concept-, belief-, and\ntheory-laden. It can also be seen from On the Cognition and\nSensation (1778). (Nietzsche would later take over this more\nsophisticated form of sentimentalism from Herder.)\n\nWhere Herder’s position becomes most original, though, is in\nhistoricizing the moral sentiments in question—or (a\nlittle more broadly and more precisely) in seeing them as varying\ndeeply from one historical period to another, one culture to another,\nand even one individual to another. He already champions such a\nposition in On the Change of Taste (1766), for example,\nindeed going as far as to point out that the moral sentiments in\nquestion sometimes even get inverted, so that what one period,\nculture, or individual found morally praiseworthy another finds\nmorally reprehensible or vice versa. This radical position can also be\nfound in his published writings. This position makes Herder’s\nsentimentalism markedly different from Hume’s, rather a\nprecursor of Nietzsche’s (which it again strongly influenced\nhere).\n\nAnother radical thesis that Herder champions is that moral sentiments\nmoreover as a rule turn out to be both suitable to and explicable in\nterms of the particular type of society and mode of life to which they\nbelong. This is a central thesis in This Too a Philosophy of\nHistory. Thus Herder tries to show there that the moral values of\neach of the major period/cultures that he considers in the work can be\nexplained in terms of their suitability to the character of the\nparticular society and way of life to which they belonged—for\nexample, the ancient Egyptians’ morality of diligence and civic\nfaithfulness to their agricultural, industrial, and urban society and\nmode of life; the Romans’ morality of courage, prudence, and\npatriotism to their imperialistic, war-based society and mode of life;\nand so on. This thesis implicitly reinforces Herder’s Humean\nargument for sentimentalism by showing that moral attitudes are\nexplicable in terms of their social function without recourse to moral\nfacts. (Here again Herder’s approach would later be echoed by\nNietzsche.)\n\nAnother major contribution that Herder makes in the area of\nmeta-ethics is his application of a novel “genetic” method\nof explanation to the domain of morality. This method depends on\nHerder’s historicism. It purports to make a psychological\nphenomenon more intelligible by tracing it back to its historical\norigins and showing how these developed into it via a series of\nintermediate forms. Herder first developed this method in the\nmid-1760s in application to literary genres and language (in\nAttempt at a History of Lyric Poetry and the\nFragments respectively), but he then went on to apply it to\nmoral (and other) values in This Too a Philosophy of History\n(1774). Since moralities change over time, it is possible to\ncontribute to explaining or better understanding the morality of a\nlate age, for example, eighteenth-century Europe, by identifying the\nearliest morality in its historical tradition and then showing how\nthis developed through a chain of subsequent moralities into the late\nmorality in question. Accordingly, This Too a Philosophy of\nHistory attempts to show (roughly) that after the authoritarian\nmorality of the ancient Hebrews had laid the foundations, the\nEgyptians’ morality of diligence and citizen’s\nfaithfulness arose; this then gave way to the Phoenicians’\nmorality of freedom and openness; the Greeks next synthesized the\npreceding moralities into a morality of citizen’s faithfulness\nand freedom; Rome then modified this inheritance into moral values of\ncourage, prudence, and patriotism; following the collapse of the Roman\nEmpire, the northern tribes, together with Christianity, developed a\nricher set of values that included courage, faith, honesty, reverence\nfor gods, humanity, chastity, and knightly honor; and then finally the\n(professed) morality of modern Europe emerged as a result of this\nwhole tradition. This Herderian approach to explaining, or\ncontributing to a better understanding of, morality would subsequently\nbe taken over and developed further by Hegel (in the early theological\nwritings and the Phenomenology of Spirit [1807]), Nietzsche\n(especially in On the Genealogy of Morality [1887]), and\nFoucault.\n\nA further important aspect of Herder’s meta-ethics has already\nbeen touched on: the complex position that he already develops in\nHow Philosophy Can Become that sentimentalism is the correct\naccount of the nature of morality; that cognitivism is therefore\nuseless as an account of morality or as an approach for inculcating\nit, and is moreover harmful because it provokes skepticism about\nmorality and distracts people from the real foundations of morality\nand from reinforcing them; and that philosophy should therefore\ninstead focus on identifying and reinforcing those real foundations,\nnamely, a set of causal mechanisms that generate and support the moral\nsentiments.\n\nAs was also mentioned earlier, How Philosophy Can Become\nmainly emphasizes certain forms of education and an emotive type of\npreaching in this connection—both activities that Herder went on\nto theorize about at greater length elsewhere. But these are only two\nparts of a much broader theory and practice of moral pedagogy, or\ncultivation of the moral sentiments, that he developed over the course\nof his career, in what became one of his most central, distinctive,\nand consuming projects. The additional causal mechanisms that he\nidentified and supported included the influence of morally exemplary\nindividuals, the law, and literature (together with the other\narts).\n\nHerder’s development of this whole theory and practice of moral\npedagogy was lifelong and tireless. It arguably constitutes the most\nimportant philosophical contribution to moral pedagogy since the\n(strikingly similar) moral pedagogy that Protagoras developed in\nantiquity (as preserved in the Great Discourse of Plato’s\nProtagoras).\n\nAs can be seen from This Too a Philosophy of History, Herder\nbelieved that this project had a special historical urgency in his day\nbecause since the Renaissance and the Reformation the moral values\nthat people profess, such as love of humanity, freedom, and honor,\nhave largely become hollow, no longer genuinely anchored in moral\nsentiments, and therefore fail to serve the social function to which\nthey would correspond.\n\nA final important aspect of Herder’s meta-ethics, prominent\nespecially in This Too a Philosophy of History, flows from\nseveral of the meta-ethical positions that have already been\nmentioned, specifically, from sentimentalism, his thesis of the\nprofound variability of moral sentiments between periods, cultures,\nand even individuals, and his thesis of the general suitedness of the\nvarious moralities that arise to the societies and modes of life to\nwhich they belong: there can be no valid justification for making\ndifferential evaluative comparisons between one morality and another,\nfor saying that one morality is better or worse than another. This is\nthe implication of a famous remark in This Too a Philosophy of\nHistory that where values are concerned\n\n\nat bottom all comparison proves to be problematic … Each nation\nhas its center of happiness in itself, like every sphere its center of\ngravity! (HPW 296–297)\n\n\nThis relativism (as it has often, and reasonably, been called) is\narguably one of Herder’s most important contributions to moral\nphilosophy. However, it is also problematic, both in its relation to\nother parts of Herder’s philosophy and intrinsically. (For\nfurther details, see Section 2 of the\n Supplementary Discussion.)\n\nLet us now turn more briefly to some of Herder’s distinctive\npositions in first-order morality. For at this level too he developed\npositions that are of great importance—for their intrinsic\nvalue, their influence on successors, or both.\n\nOne very fundamental, original, and attractive principle that he\ndevelops here is what might be called pluralist\ncosmopolitanism, in contradistinction to the homogenizing\ncosmopolitanism of the tradition. Cosmopolitanism already had a\nlong history by Herder’s day that reached back to (Cynicism and)\nStoicism in the pagan Greek world. That tradition had usually\nchampioned a homogenizing form of cosmopolitanism, i.e., a form of it\nthat grants equal ethical respect to all human beings only on the\nbasis of an assumption that they all share much in common\npsychologically, especially in their moral values. In particular,\nHerder’s Enlightenment predecessors, including Kant, had held\nsuch a position. Moreover, this version of cosmopolitanism continues\nto be predominant among moral philosophers and worthy organizations\nsuch as the United Nations to this day. There is a huge problem with\nthis form of cosmopolitanism, however: its assumption that human\nbeings all share a great deal in common psychologically, especially in\nmoral values, is false (and attempting to make it\ntrue would require massive coercion). Herder recognized this problem,\nbut he did not throw out the baby of cosmopolitanism with the\nbathwater of homogenization. Instead, he developed a distinctive\npluralist form of cosmopolitanism: a commitment to equal\nmoral respect for all human beings despite, or even in part\nbecause of, the diversity of their psychologies, and in\nparticular their moral values. This position is prominent in the\nLetters for the Advancement, for example. It also undergirds\nHerder’s strong stance against imperialism and colonialism in\nThis Too a Philosophy of History, the Ideas, and the\nLetters for the Advancement.\n\nA second moral principle of Herder’s that deserves mention here\nis the closely related principle of humanity\n[Humanität], which he develops in the Ideas and\nthe Letters for the Advancement. This principle has both\ndescriptive and normative aspects. Descriptively, it includes an\nimplication of the unity of the human species and of the mere\nsuperficiality of racial differences. Normatively, it includes an\nimplication of cosmopolitanism; implications of specific standards of\ndecent treatment (e.g., not killing, physically abusing, or deceiving\npeople); and also functions as a sort of substitute for the ideal of\nhuman rights, an ideal that constitutes a closer\nspecification of cosmopolitanism but which Herder tends to shy away\nfrom for various reasons (see for this the section on Political\nPhilosophy).\n\nHerder’s principle of humanity takes two distinguishable forms:\nan early form for which he normally uses the term Menschheit,\nfound especially in This Too a Philosophy of History, and a\nlater form for which he usually uses the term Humanität,\nfound especially in the Ideas and the Letters for the\nAdvancement. These versions differ not only terminologically but\nalso substantively, in that, for example, the later version tends\ntoward a more cognitive and universalistic conception of moral value\nthan the earlier one. It can be argued that Herder’s earlier\nversion was the actually the more original and philosophically deeper\nof the two.\n\nA further noteworthy component of Herder’s first-order morality\nis his moral ideal of Bildung, in the sense of an autonomous,\nindividualistic development of all one’s capacities into a\nharmonious whole. He already worked out this ideal in writings from\n1769 such as his Journal. Later, in On the Cognition and\nSensation, he developed some deeper philosophical foundations for\nit: an account of human autonomy or freedom as something quite\ncompatible with the laws of nature (an account closely related to one\nthat he had already worked out in the Treatise on the Origin\naccording to which a distinctive characteristic of humankind lies in a\ncertain sort of flexibility, or freedom from determination by narrow\ninstincts); a quasi-Leibnizian account of individuality as a general\nfeature of all nature, including human nature as a special\ncase; and an account of the deep interdependence of human\nbeings’ psychological faculties, which undergirds the\n“harmonious whole” component of the ideal. This ideal\nwould later go on to have an enormous influence on successors such as\nSchiller, Wilhelm von Humboldt (who saw its realization as the highest\npurpose of the state or even the whole universe), and Hegel.\n\nIn addition to these striking moral ideals, Herder is also committed\nto a range of much less surprising ones, especially ones associated\nwith the Christian moral tradition, such as sympathy, love,\nforgiveness, honesty, justice, and equality. Although not surprising\nin themselves, these ideals help to illustrate another striking\nfeature of his moral philosophy: his firm avoidance of the sort of\nmoral monism that began in antiquity with Plato’s\nProtagoras (specifically, with its argument for the unity of\nthe virtues) and which has continued in modernity with Kant (in his\ncommitment to the categorical imperative as the sole moral principle)\nand Utilitarianism (with its commitment to happiness as the sole moral\ncriterion), in favor of moral pluralism, or a commitment to\nan irreducible plurality of moral values/ideals. This is arguably\nanother great merit of his moral philosophy.\n\nFinally, Herder’s ethical theory is important not only for what\nit includes but also for what it excludes. In particular, he shows\nlittle interest in the issue of free will, rarely if ever implying\nthat such a thing exists or that it is a precondition of moral\nresponsibility. (Freedom in the sense of a sort of autonomy,\nor flexibility, that exists within the limits of the laws of\nnature and merely amounts to a certain liberty from constraint by\nnarrow instincts and political freedom are another matter; he\nis interested in these.) This position contrasts sharply with\nthat of most modern moral philosophers, including both Hume and Kant,\nfor example. However, it looks much less idiosyncratic if one takes a\nbroader perspective and notices, for instance, that neither the early\nGreeks (e.g., Homer) nor the Chinese ethical tradition have had any\nconception of free will or any inclination to think that such a thing\nis required for moral responsibility. Indeed, I would argue that\nHerder’s position here, like that of those other traditions,\nturns out to be a great virtue, since the very conception of free will\nand of morality’s dependence on it, which has dominated western\nphilosophy and religion since late antiquity, turns out to be\nmisbegotten.\n9. Philosophy of History\n\nHerder’s philosophy of history appears mainly in two works:\nfirst in This Too a Philosophy of History and then later in\nthe Ideas.\n\nHis philosophy of history is striking for its development of a\nteleological conception of history as the progressive realization of\n“reason” and “humanity”—a conception\nthat anticipated and strongly influenced Hegel, among others. However,\nthis conception is dubious on reflection, and is arguably not\none of Herder’s most intrinsically important achievements in\nthis area.\n\nHis most intrinsically important achievement arguably instead lies in\nhis development of the thesis already mentioned\nearlier—contradicting such Enlightenment philosopher-historians\nas Hume and Voltaire—that there exist radical mental differences\nbetween different historical periods (and cultures), that\npeople’s concepts, beliefs, values, sensations, and so on differ\nin deep ways from one period (or culture) to another. This thesis is\nalready prominent in On the Change of Taste (1766) and it\nendures throughout Herder’s career (albeit with some periods of\ndoubt or ambivalence). It had an enormous influence on successors such\nas the Schlegel brothers, Schleiermacher, Hegel, Nietzsche, and\nDilthey.\n\nHerder makes the empirical exploration of the realm of mental\ndiversity posited by this thesis the very core of the discipline of\nhistory. For, as has often been noted, he takes relatively little\ninterest in the so-called “great” political and military\ndeeds and events of history, focusing instead on the\n“innerness” of history’s participants. This choice\nis quite deliberate and self-conscious. Because of it, psychology\nand interpretation inevitably take center-stage as methods in the\ndiscipline of historiography for Herder.\n\nHerder has deep philosophical reasons for this choice, and hence for\nassigning psychology and interpretation a central role in\nhistoriography. To begin with, he has negative reasons\ndirected against traditional political-military historiography. Why\nshould historiography focus on the “great”\npolitical and military deeds and events of the past, after all? There\nare several possible answers: (1) A first would be that they are\nfascinating or morally edifying. But Herder will not accept this. For\none thing, he denies that mere fascination or curiosity is a\nsufficiently serious motive for doing historiography. For another\nthing, his antiauthoritarianism, antimilitarism, and borderless\nhumanitarianism cause him to find the acts of political domination,\nwar, and empire that make up the vast bulk of these\n“great” deeds and events not morally edifying but morally\nrepugnant.\n\nThis leaves two other types of motivation that might be appealed to\nfor doing the sort of historiography in question: (2) because\nexamining the course of such deeds and events reveals some sort of\noverall meaning in history, or (3) because it leads to\nefficient causal insights that enable us to explain the past and\nperhaps also predict or control the future. Herder is again\nskeptical about these rationales, however. This skepticism is perhaps\nclearest in the Older Critical Forestlet (1767–8)\nwhere, in criticism of rationale (2), he consigns the task of\n“the whole ordering together of many occurrences into a\nplan” not to the historian but instead to the “creator,\n… painter, and artist”, and in criticism of rationale\n(3), he goes as far as to assert (on the basis of a Hume- and\nKant-influenced general skepticism about causal knowledge) that with\nthe search for efficient causes in history “historical seeing\nstops and prophecy begins”. His later writings depart from this\nearly position in some obvious ways, but they also in important ways\nremain faithful to it. (For further details, see Section 3 of the\n Supplementary Discussion.)\n\nHerder’s arguments against these three rationales can all be\nfound briefly summarized in Letters 121–122 from the\n10th Collection of the Letters for the Advancement\n(though they are more fully stated individually elsewhere).\n\nComplementing this negative case against the claims of traditional\npolitical-military history to be of overriding importance, Herder also\nhas positive reasons for focusing instead on the\n“innerness” of human life in history. (1) One reason is\ncertainly just the sheer interest of this subject-matter (though, as\nwas mentioned before, that would not be a sufficient reason in his\neyes). (2) Another reason is that his discovery of radical diversity\nin human mentality has shown there to be a much broader, less\nexplored, and more intellectually challenging field for investigation\nhere than previous generations of historians have realized. Two\nfurther reasons are moral in nature: (3) He believes, quite plausibly,\nthat studying people’s minds through their literature, visual\nart, and so on generally exposes one to them at their moral best (in\nsharp contrast to studying their political-military history, which\nexposes one to them at their worst), so that there are benefits of\nmoral edification to be gleaned here. (4) He has cosmopolitan and\negalitarian moral motives for studying people’s minds through\ntheir literature, visual art, and so forth: in sharp contrast to\nstudying unedifying and elite-focused political-military history, this\npromises to enhance our sympathies for peoples, and moreover for\npeoples at all social levels, including lower ones. Finally, doing\n“inner” history is also important as an instrument for our\nnon-moral self-improvement: (5) It serves to enhance our\nself-understanding. One important reason for this is that it is by,\nand only by, contrasting one’s own outlook with the outlooks of\nother peoples that one comes to recognize what is universal and\ninvariant in it and what by contrast distinctive and variable. Another\nis that in order fully to understand one’s own outlook one needs\nto identify its historical origins and how they developed into it\n(this is Herder’s justly famous “genetic” method,\nabout which more will be said in a moment). (6) Herder believes that\nan accurate investigation of the (non-moral) ideals of past ages can\nserve to enrich our own ideals and happiness. This motive finds broad\napplication in his work. One example of this is his exploration of\npast literatures in the Fragments largely with a view to\ndrawing from them lessons about how better to develop modern German\nliterature.\n\nHerder’s decision to focus on the “innerness” of\nhistory’s participants, and his consequent emphasis on\npsychology and interpretation as historical methods, strikingly\nanticipated and strongly influenced Dilthey. So too did his rationale\nfor this decision, as described above, which is indeed arguably\nsuperior to Dilthey’s, especially on its positive side.\n\nAnother of Herder’s major contributions to the philosophy of\nhistory, likewise based on his insight into radical mental difference,\nis the “genetic” method recently mentioned. This was a\nrevolutionary invention that has proved to be of enormous intrinsic\nvalue and which has exercised a huge influence on the philosophies of\nimportant successors such as Hegel, Nietzsche, and Foucault.\n\nHerder’s genetic method is first and foremost a means toward\nbetter understanding, or explaining, psychological outlooks\nand psychologically laden practices—especially a means toward\nbetter understanding one’s own, toward better\nself-understanding. The method achieves its distinctive\ncontribution to better understanding such outlooks and practices,\nsaliently including one’s own, by showing, in a naturalistic\n(i.e., non-religious, non-mythical, non-transcendent) way, that and\nhow they have developed historically out of earlier origins prior to\nwhich they were not yet really present at all and from which they have\nemerged via a series of transformations.\n\nHerder initially developed this method in the 1760s mainly in relation\nto poetry and language. His unpublished Attempt at a History of\nLyrical Poetry (1764) contains his earliest presentation of the\nmethod and applies it to poetry. His slightly later published work,\nthe Fragments (1767–8), refines his presentation of it\nand applies it to language. He then goes on to apply the method to\nmoral (and other) values. Thus in This Too a\nPhilosophy of History (1774) he largely focuses on moral,\naesthetic, and prudential values, developing the large-scale\n“genetic” thesis that history has consisted of a great\nchain of cultures (Oriental patriarchal culture, then Egyptian, then\nPhoenician, then Greek, then Roman, and so on) that have built on each\nother cumulatively and thus eventually generated modern European\nculture (toward which he is strikingly ambivalent). For example, he\nclaims that Greek culture combined antecedent Oriental and Egyptian\nculture’s obedience with antecedent Phoenician culture’s\nfreedom in a new synthesis, and then passed this on to subsequent\nEuropean cultures.\n\nHegel, especially in his Phenomenology of Spirit (1807),\nNietzsche, especially in On the Genealogy of Morality (1887),\nand Foucault subsequently took over this method and modified it in\nvarious ways.\n\nHow exactly is Herder’s method supposed to advance (self-)understanding?\nIt aims to do so in two\ndistinguishable ways, which together constitute what one might call\nthe essential model of genetic explanation.\n\nThe method’s first contribution to (self-)understanding\nis roughly as follows. Someone who possesses his or her own\ndistinctive concepts, beliefs, values, sensations, customs, art forms,\nand so on but does not compare them with perspectives that have lacked\nthem altogether or possessed variant alternatives runs a grave risk of\ntaking them to be universal and indispensable, and also of overlooking\nwhat is distinctive in their character. The genetic method counteracts\nboth of these types of (self-)misunderstanding by making one familiar\nwith earlier historical periods that have lacked the relevant concepts\netc. altogether and with intervening historical periods in which they\nwere indeed anticipated but only in forms significantly different from\nthe form in which one possesses them oneself, thereby making it\npossible both to perceive the non-universality and dispensability of\nthe concepts etc. in question and to compare them with others in order\nto reveal their distinctive character.\n\nThe method’s second contribution to (self-)understanding\nconsists at its most basic level in showing two things: first, it\nshows that the concepts etc. in question, rather than, say, having\nbeen innate and therefore present in human minds all along or else\nhaving emerged ex nihilo fully formed at some point in\nhistory, are the products of historical developments before which they\ndid not really exist at all and in the course of which they only\nexisted in variant forms; second, it shows what exactly these\nhistorical developments that produced them have been. At a less basic\nlevel, it normally also includes a provision of one or another further\nsort of explanation that is more specific in character. For example,\nthe method shows that lyric poetry began as, and then continued\nthroughout its transformations to be, an expression of deep emotions;\nthat languages developed gradually from primitive beginnings to\nachieve their striking later complexity; or that modern culture and\nits values arose through a series of accumulations and transformations\nof earlier cultures and their values.\n\nFinally, Herder is also impressive for having recognized, and, though\nnot solved, at least grappled with, a problem that flows from his\npicture of history (and intercultural comparison) as an arena of\nradical differences in human mentality. This is the problem of\nskepticism. (For further details, see Section 4 of the\n Supplementary Discussion.)\n10. Political Philosophy\n\nHerder is not usually thought of as a political philosopher. But he\nwas one, and moreover one whose political ideals are more admirable,\ntheoretical stances more defensible, and thematic focuses of more\nenduring relevance than those of any other German philosopher of the\nperiod (including Kant). His most developed treatment of political\nphilosophy occurs relatively late, in a work prompted by the French\nRevolution of 1789: the Letters for the Advancement of\nHumanity (1793–7) (including the early draft from 1792,\nwhich is important for its frank statement of his views about domestic\npolitics).\n\nWhat are the main features of Herder’s political philosophy? Let\nus begin with his political ideals, first in domestic and\nthen in international politics. In domestic politics, the mature\nHerder is a liberal, a republican, a democrat, and an egalitarian\n(this, it should be noted, in historical circumstances where such\npositions were by no means commonplace, and were embraced at a\npersonal cost).\n\nHis liberalism is especially radical in that it advocates\nvirtually unrestricted freedom of thought and expression (including\nfreedom of worship). He has several reasons for this position: (1) He\nfeels that such freedom belongs to people’s moral dignity. (2)\nHe believes that it is essential for individuals’\nself-realization. (3) He believes that people’s capacities for\ndiscerning the truth are very limited and that it is only through a\nconstant contest between opposing viewpoints that the cause of truth\ngets advanced. (John Stuart Mill would later borrow from these\nconsiderations—largely via Wilhelm von Humboldt—to form\nthe core of his own case for freedom of thought and expression in\nOn Liberty.)\n\nHerder is also committed to republicanism and democracy\n(advocating a much broader franchise than Kant, for example). He has\nseveral reasons for this position, ultimately deriving from an\negalitarian concern for the interests of all members of society: (1)\nHe feels it to be intrinsically right that the mass of people should\nshare in their government, rather than having it imposed upon them.\n(2) He believes that this will better serve their other\ninterests as well, since government by also tends to be\ngovernment for. (3) He in particular believes that it will\ndiminish the warfare that is pervasive under the prevailing autocratic\npolitical régimes of Europe, where it benefits the few rulers\nwho decide on it but costs the mass of people dearly.\n\nFinally, Herder’s egalitarianism also extends beyond\nthat. He does not reject class differences, property, or inequalities\nof property outright. But he does oppose all hierarchical oppression;\nargue that all people in society have capacities for self-realization,\nand should receive the opportunity to fulfill them; and insist that\ngovernment should intervene to ensure that they do receive it, for\nexample, by guaranteeing education and a minimum standard of living\nfor the poor.\n\nConcerning international politics, Herder has often been classified as\na “nationalist” or (perhaps even worse) a “German\nnationalist” (for example, by R.R. Ergang in Herder and the\nFoundations of German Nationalism [1931] and K.R. Popper in\nThe Open Society and its Enemies [1945]). Some other\nphilosophers from the period deserve such a characterization (for\ninstance, Fichte). But where Herder is concerned it is deeply\nmisleading and unjust. On the contrary, like Kant’s, his\nfundamental position in international politics is a committed\ncosmopolitanism, an impartial concern for all human\nbeings. This is a large part of the force of his ideal of\n“humanity”. Hence, for example, in the Letters for the\nAdvancement he approvingly quotes Fénelon’s remark,\n“I love my family more than myself; more than my family my\nfatherland; more than my fatherland humankind”\n(HPW 389). Moreover, Herder’s cosmopolitanism\nis arguably a good deal purer than Kant’s. Kant’s is\nundermined by various prejudices that he harbors – in\nparticular, racism, antisemitism, and misogyny (for a charitable\ndiscussion, see Kleingeld 2013). By contrast, Herder’s is free\nof such prejudices, which he indeed worked tirelessly to combat.\n\nHerder does indeed also insist on respecting, preserving, and\nadvancing national groupings. However, this is entirely unalarming,\nfor the following reasons: (1) For Herder, this is emphatically\nsomething that must be done for all national groupings\nequally—not just or especially Germany! (In the\nLetters for the Advancement he emphatically rejects any such\nnotion of a “favorite people [Favoritvolk]”, as\nhe puts it [HPW 394].) (2) The “nation”\nin question is not racial but linguistic and cultural (in the\nIdeas and elsewhere Herder indeed criticizes and rejects the\nvery concept of race). (3) Herder does not seek to seal off nations\nfrom each other’s influence or to keep them static; he regards\ninter-linguistic and -cultural exchange and linguistic-cultural\ndevelopment as normal and welcomes them. (4) Nor does his commitment\nto national groupings involve a centralized, militarized state (in the\nIdeas and elsewhere he strongly advocates the disappearance\nof such a state and its replacement by loosely federated local\ngovernments with minimal instruments of force). (5) In addition, his\ninsistence on respecting national groupings is accompanied by the\nstrongest denunciations of military conflict, colonial exploitation,\nand all other forms of harm between nations; a demand that nations\ninstead peacefully cooperate and compete in trade and intellectual\nendeavors for their mutual benefit; and a plea that they should indeed\nactively work to help each other.\n\nMoreover, Herder has compelling reasons for this insistence on\nrespecting national groupings: (1) The deep diversity of values\nbetween nations entails that homogenization is only a fantasy:\nnon-existent hitherto and impracticable for the future. (2) Such\ndiversity also entails that, to the extent that it is\npracticable, it cannot occur voluntarily but only through external\ncoercion. (3) In practice, attempts to achieve it, for example, by\nEuropean colonialism, are moreover coercive from, and subserve,\nulterior motives of domination and exploitation. (4) Furthermore, real\nnational variety is positively valuable, both as affording individuals\na vital sense of local belonging and in itself.\n\nIndeed, Herder’s pluralist cosmopolitanism is an important and\nattractive alternative to the homogenizing forms of cosmopolitanism,\nbased on illusions concerning either the fact or the prospect of\nuniversally shared values, that have predominated since the\nEnlightenment and are still popular today, both among philosophers\n(especially in the Anglophone world) and in international political\norganizations such as the United Nations.\n\nAnother important part of Herder’s political philosophy, which\nbears on both domestic and international politics, is his striking\npreference for an ideal of humanity over his age’s\nideal of human rights. (For further details, see Section 5 of\nthe\n Supplementary Discussion.)\n\nNow that we have surveyed the various political ideals that make up\nHerder’s political position, one final issue still needs to be\naddressed. It might still be objected that all of this does not yet\nreally amount to a political theory—such as other\nphilosophers have provided, including some of Herder’s\ncontemporaries in Germany. In a sense that is true, but\nphilosophically defensible; in another sense it is false.\n\nIt is true in the following sense. There is indeed no grand\nmetaphysical theory underpinning Herder’s position—no\nPlatonic theory of forms, no correlation of political institutions\nwith “moments” in a Hegelian Logic, no\n“deduction” of political institutions from the nature of\nthe self or the will à la Fichte or Hegel, or whatnot. But that\nis quite deliberate, given Herder’s skepticism about such\nmetaphysics. And is it not indeed philosophically a good thing?\n\nNor does Herder have any account purporting to justify the moral\nintuitions at work in his political position as a sort of theoretical\ninsight (in the manner of Kant’s theory of the\n“categorical imperative” or Rawls’s theory of the\n“original position”, for example). But that is again quite\ndeliberate, given his sentimentalism in ethics, and his rejection of\nsuch theories as both false and harmful. And is he not again right\nabout this, and the absence of such an account therefore again a good\nthing?\n\nNor is Herder sympathetic with such tired staples of political theory\nas natural rights, the state of nature, the social contract, the\ngeneral will, and utopias for the future. But again, he has good\nspecific reasons for skepticism about these notions. So this again\nseems like a good thing.\n\nThis, then, is the sense in which the objection is correct; Herder\ndoes indeed lack a “political theory” of these\nsorts. But he lacks it on principle, and is arguably quite\nright to do so.\n\nOn the other hand, in another sense it is false to say that he lacks a\n“political theory”. For he does have a\n“political theory” of a different, and arguably far more\nvaluable, sort. First, consistently with his general empiricism, his\nposition in political philosophy is deeply empirically informed. For\ninstance, as can be seen from the Dissertation on the Reciprocal\nInfluence of Government and the Sciences (1780), his thesis\nconcerning the importance of freedom of thought and expression, and\nthe competition between views that it makes possible, for producing\nintellectual progress is largely based on the positive historical\nexample of ancient Greece, and in particular Athens, as contrasted\nwith later societies, such as Rome, that lacked the freedom and\ncompetition in question and generated correspondingly weaker\nintellectual achievements. And in the 1792 draft of the Letters\nfor the Advancement he even describes the French Revolution and\nits attempts to establish a modern democracy as a sort of\n“experiment” from which we can learn (for example, learn\nwhether democracy can be successfully extended to nations that are\nmuch larger than ancient Athens).\n\nSecond, in conformity with his general sentimentalism in ethics, he is\nacutely aware that his political position ultimately rests on moral\nsentiments—his own and, for its success, other people’s as\nwell. For example, in the 10th Collection of the\nLetters for the Advancement he emphasizes that people’s\nmoral “dispositions” or “feelings” play a\nfundamental role as essential supports for his political\nposition’s realization. This standpoint absolves him of the need\nto do certain sorts of theorizing—not only precluding any need\nfor cognitivist groundings of the moral intuitions in question, but\nalso promising short, effective solutions to various problems that\nwould no doubt look like real brain-teasers to a cognitivist. However,\nit also leads him to engage in theorizing of another sort, namely,\ntheorizing about the ways in which, and the causal means by which,\npeople’s moral sentiments should be molded in order to realize\nthe ideals of his political position. His discussion of moral\n“dispositions” in the 10th Collection is an example of\nsuch theorizing—concerning the ways in which, rather\nthan the causal means by which. Some of his extensive\ntheorizing about causal means (education, exemplary individuals, laws,\nliterature, and so on) has already been discussed earlier in this\narticle.\n\nThese two sorts of political theorizing—empirical\ntheorizing and theorizing about moral sentiments—are\ndeeply developed in Herder. And they are arguably much more pointful\nthan the sorts that are not.\n\nIn short, to the extent that Herder’s political philosophy\nreally is theoretically superficial, it is, to borrow a phrase of\nNietzsche’s, “superficial—out of\nprofundity” (whereas more familiar forms of political\nphilosophy are profound—out of superficiality). And in another,\nmore important, sense it is not theoretically superficial at all.\n11. Philosophy of Religion\n\nA final area in which Herder has noteworthy achievements is the\nphilosophy of religion. It seems appropriate to begin discussion of\nthis with a couple of qualifications, though. In Herder’s day\nGerman philosophy was still deeply committed to a sort of game of\ntrying to reconcile the insights of the Enlightenment, especially\nthose of modern natural science, with religion, and indeed more\nspecifically with Christianity. Leibniz, Kant, Hegel, Schleiermacher,\nand many others played this game—each proposing some new\nreconciliation or other. Herder was part of this game as well. This\nwas not a good game for philosophers to be playing. But it was not\nuntil the nineteenth century that German philosophy found the courage\nto cut the Gordian knot and turn from apologetics for religion and\nChristianity to thoroughgoing criticism of them (the prime examples\nbeing Marx and Nietzsche). This situation imposes certain limits on\nthe value of Herder’s philosophy of religion (as on that of the\nother reconciling philosophers just mentioned).\n\nAlso, it should be noted that while Herder’s philosophy of\nreligion was generally very enlightened and progressive in both his\nearly and his late periods, there was a spell in the middle, the years\n1771–6 in Bückeburg, during which he fell into the sort of\nreligious irrationalism (a position that essentially rejects reason\nand instead bases religious views on belief alone) that is more\ncharacteristic of his friend Hamann. This happened as the result of\nwhat would today be classified as a mild nervous breakdown\n(documentable from his correspondence at the time), and should\nbasically be discounted.\n\nNotwithstanding these qualifications, Herder did make important\ncontributions to the philosophy of religion—that is, important\nin terms of their intrinsic value, their influence, or both.\n\nOne of these contributions (arguably important mainly for its\ninfluence) lies in his neo-Spinozism. Herder’s sympathetic\nengagement with Spinoza’s work goes back at least as far as\n1769. But its main expression occurs in God: Some\nConversations from 1787 (a second, substantially revised edition\nappeared in 1800). Herder published this work in the wake of\nJacobi’s Letters on the Doctrine of Spinoza (1785), in\nwhich Jacobi had revealed that the highly respected philosopher,\ncritic, and dramatist Lessing—who was much admired by Herder in\nparticular—had confessed to him shortly before his death that he\nhad abandoned orthodox religious conceptions in favor of Spinozism.\nJacobi had himself argued, sharply to the contrary, that Spinozism,\nand indeed all fundamental reliance on reason, implies atheism and\nfatalism, and should therefore be rejected in favor of a leap of faith\nto a conventional Christian theism. Jacobi’s work, along with a\nreply by Moses Mendelssohn that disputed the attribution of Spinozism\nto Lessing though not the perniciousness of such a position, caused a\npublic furor. In God: Some Conversations Herder intervened.\nIn this work he supports Lessing as Jacobi had characterized him by\ndeveloping a version of “Spinozism” that modifies the\noriginal in some significant respects, largely with a view to defusing\nJacobi’s objections.\n\nHerder shares with Spinoza the basic thesis of monism, and\nlike Spinoza equates the single, all-encompassing principle in\nquestion with God (which of course already challenges Jacobi’s\ncharge of atheism). But whereas Spinoza had characterized this single,\nall-encompassing principle as substance, Herder instead\ncharacterizes it as force, or primal force. This\nfundamental modification involves several further ones that Herder\nalso finds attractive, including the following: (1) Whereas Spinoza\nhad tended to conceive the principle in question as an inactive\nthing, Herder’s revision rather turns it into an\nactivity. (2) Spinoza’s theory had attributed\nthought to the principle in question, but had rejected\nconceptions that it had intentions or was a mind. By\ncontrast, Herder claims that it does have intentions. And\nsince his general philosophy of mind identifies the mind with force,\nhis identification of the principle in question with force also\ncarries an implication that it is a mind (he does not yet\nquite say this in God: Some Conversations, but a few years\nlater in On the Spirit of Christianity of 1798 he explicitly\ndescribes God as a Geist, a mind). In these ways, Herder in\neffect re-mentalizes Spinoza’s God (thereby further undermining\nJacobi’s charge of atheism). (3) Whereas Spinoza had conceived\nnature mechanistically, in keeping with his Cartesian intellectual\nheritage (and had thereby invited Jacobi’s charge of fatalism),\nHerder (though officially still agnostic about what force is) rather\ntends to conceive the forces at work in nature as living, or\norganic (a conception of them that he mainly owes to Leibniz). (4)\nHerder believes that Spinoza’s original theory contained an\nobjectionable residue of dualism (again inherited from Descartes) in\nits conception of the relation between God’s two known\nattributes, thought and extension (and similarly, in its conception of\nthe relation between finite minds and bodies). By contrast,\nHerder’s own conception of God as a force (and of finite minds\nas likewise forces) is designed to overcome this alleged residual\ndualism. For forces are of their very nature expressed in the behavior\nof extended bodies. (5) Herder also sketches a more detailed account\nof nature as a system of living forces based in the primal force,\nGod—an account that in particular ascribes an important role in\nthis system to the sort of opposition between forces that is\nexemplified by the magnet with its two opposite poles, and that\ncharacterizes the system as a self-development toward higher and\nhigher forms of articulation.\n\nDuring the last quarter or so of the eighteenth century and then well\ninto the nineteenth century a wave of neo-Spinozism swept through\nGerman philosophy and literature: in addition to Lessing and Herder,\nfurther neo-Spinozists included Goethe, Schelling, Hegel,\nSchleiermacher, Hölderlin, Novalis, and Friedrich Schlegel. This\nwave was largely a result of Herder’s embrace of neo-Spinozism\nin God: Some Conversations (and in Goethe’s case\nHerder’s sympathy with Spinozism even before that work).\nAccordingly, it for the most part took over Herder’s\nmodifications of Spinoza’s position.\n\nHowever, it is arguable that Herder’s most\nintrinsically valuable contribution to the philosophy of\nreligion concerns the interpretation of the Bible. In this connection,\nas has already been mentioned, he champions a strict\nsecularism. This was already his position in the 1760s. At\nthat period he argued firmly, in the spirit of Galileo, for\ndisallowing revelation any jurisdiction over natural\nscience—though he did so not in an anti-religious spirit but in\nthe hope and expectation that an autonomous natural science would\nconfirm religion. And he made a parallel case for the autonomy of\ninterpretation: Religious assumptions and means have no\nbusiness interfering in the interpretation of texts either, even when\nthe texts are sacred ones. Instead, even the Bible must be interpreted\nas the work of human beings, and by means of the same sorts of\nrigorous hermeneutic methods that are employed for interpreting other\nancient texts—any religious enlightenment coming as a\nresult of such interpretation, not entering into the process\nitself. This whole position remained Herder’s considered\nposition in his later period as well.\n\nThe principle that the Bible should be interpreted in the same way as\nother texts was not the commonplace in Herder’s day that it has\nbecome since, but nor was it entirely new with him. In adopting it he\nwas self-consciously following the lead of several recent Bible\nscholars—in particular, Ernesti, Michaelis, and Semler. However,\nhis secularism is more consistent and radical than theirs, in\nparticular because it foreswears not only any reliance on a divine\ninspiration of the interpreter but also any assumption that the Bible,\nas the word of God, must be true and consistent throughout. (For\nfurther details, see Section 6 of the\n Supplementary Discussion.)\n\nAnother important interpretive principle of Herder’s, closely\nrelated to his strict secularism, is an insistence that interpreters\nof the Bible must resist the temptation to read the Bible as\nallegory (except in those relatively few cases—such as\nthe parables of the New Testament—where there is clear textual\nevidence that a biblical author intended to convey an allegorical\nmeaning). The locus classicus for this issue is the Songs of\nLove (1778), where Herder argues against then-common allegorical\ninterpretations of the Old Testament’s Song of Solomon\nin favor of an interpretation of it as simple erotic love poetry (an\ninterpretation that is now generally accepted as correct). In On\nGod’s Son, the World’s Savior (1797) Herder gives a\nperceptive general diagnosis of how the temptation to allegorical\ninterpretation arises: over the course of history people’s\nbeliefs and values change, leading to discrepancies between the claims\nmade by their traditional texts and their own beliefs and values; but\nthey expect and want to find their traditional texts to be correct;\nand so they try to effect a reconciliation of them with their own\nbeliefs and values by means of allegorical readings.\n\nHerder’s theoretical commitment to strict secularism and to\nnon-allegorical readings in biblical interpretation led him to\ninterpretive discoveries concerning the Bible that were themselves of\ngreat importance. For example, concerning the Old Testament, his\ncommitment to applying normal interpretive methods enabled him to\ndistinguish and define the different genres of poetry in the Old\nTestament in a way that was superior to anything that had been\nachieved before. The same commitment, and his consequent readiness to\nfind falsehood and even inconsistency in the Bible, also allowed him\nto make such important interpretive observations as that the ancient\nHebrews’ conceptions about death, the afterlife, the mind, and\nthe body had changed dramatically over time. (For both of these\nachievements, see especially On the Spirit of Hebrew Poetry.)\nAgain, as was just mentioned, his rejection of unwarranted allegorical\ninterpretations allowed him to substitute for the traditional\ninterpretation of the Song of Solomon as religious allegory\nan interpretation of it as simple erotic love poetry that is now\ngenerally accepted.\n\nSimilarly concerning the New Testament, Herder’s commitment to\napplying normal interpretive methods, including his readiness to\ndiscover falsehood and inconsistency, enabled him to treat the authors\nof the four gospels as individual human authors rather than mere\nmouthpieces of the deity, to perceive inconsistencies between their\naccounts, to establish the relative dates of the gospels correctly for\nthe first time (Mark first, Matthew and Luke in the middle, John last\nand late), and to give a broadly correct account of their genesis in\noral sermon and of their likely relations to each other (achievements\nthat he attained above all in two late works from 1796–7, On\nthe Savior of Mankind and On God’s Son, the\nWorld’s Savior).\n\nHerder’s strict secularism and resistance to allegory in\ninterpretation would shortly afterwards be taken over by\nSchleiermacher, who similarly embraced the principle that the\ninterpretation of sacred texts must treat them as the works of human\nauthors and apply exactly the same interpretive methods to them as are\napplied to profane texts, and who similarly followed through on this\ncommitment, in particular finding not only falsehoods but also\ninconsistencies in the Bible.\n\nHerder’s great achievements in this whole area also have\nsomething of the character of the early acts of an inexorable personal\ntragedy, however. As was mentioned, Herder by no means intended his\nchampioning of the cause of intellectual conscience in insisting on\nthe autonomy of natural science and interpretation to undermine\nreligion in general or Christianity in particular; on the contrary,\nhis hope and expectation was that both sorts of autonomy would in the\nend support religion and Christianity. However, this hope has been\nsorely disappointed. Autonomous natural science has increasingly made\nreligion generally and Christianity in particular look untenable. And\nHerder’s policy of reading the Bible with the aid of normal\ninterpretive means as a collection of human texts, with all of the\nfoibles of human texts, has increasingly led to an undermining of the\nBible’s claims to intellectual authority (a landmark here was\nthe publication of David Friedrich Strauss’s The Life of\nJesus [1835–6]). Much of what Herder has ultimately\nachieved in this area would therefore have been deeply unwelcome to\nhim.\n12. Intellectual Influence\n\nNow that we have surveyed Herder’s main achievements as a\nphilosopher, we are in a somewhat better position to see not only\ntheir intrinsic value but also their enormous intellectual influence,\nas adumbrated at the start of this article—an influence that\noccurred both within philosophy and beyond it, and that extended even\nto the founding of whole new disciplines. (For further details, see\nSection 7 of the\n Supplementary Discussion.)\n13. Guide to the Literature\nGeneral Treatments\n\nAdler and Koepke 2009 (an excellent collection of articles covering a\nwide range of topics); Beiser 1987 (ch. 5 covers several subject\nhelpfully, including Herder’s philosophies of language, mind,\nand religion); Berlin 1976 (concise and excellent); Clark 1955\n(detailed and useful, though unimaginative); Forster 2018 (covers the\nsubjects treated in this article in more detail); Gillies 1945 (not\nphilosophically sophisticated, but good on Herder’s relation to\nliterature and on his influence); Greif, Heinz, and Clairmont 2016 (a\nuseful reference work); Haym 1880 (a classic, detailed intellectual\nbiography; still the best general book on Herder available); Heise\n1998 (a good short introduction); Irmscher 2001 (an excellent short\nintroduction); Nisbet 1970 (a helpful general account of\nHerder’s views about science); Sauder 1987 (contains helpful\ncontributions on a wide range of topics); Wiese 1939 (a helpful\noverview).\nIntellectual Life\n\nAdler 1968; Beiser 1987 (ch. 5); Berlin 1976; Clark 1955; Haym\n1880.\nPhilosophical Style\n\nAdler 2009; Berlin 1976; Clark 1955; Haym 1880; Zammito 2001 (an\nexcellent, thorough study).\nGeneral Program in Philosophy\n\nHeinz 1994; Zammito 2001 (very good on this subject).\nPhilosophy of Language\n\nAarsleff 1982; Coseriu 2015; Forster 2010, 2011a, 2015, 2018 (ch. 1);\nHacking 1988, 1994; Sapir 1907 (an excellent discussion of the\nTreatise on the Origin by an important twentieth-century\nlinguist); Taylor 1991, 1996, 2016.\nTheory of Interpretation (Hermeneutics)\n\nForster 2010 (especially chs. 1–5), 2011a (especially ch. 9),\n2012b, 2016, 2018 (ch. 2), 2019b; Gjesdal 2004, 2017; Irmscher 1973 (a\nvery influential article that attempts to assimilate Herder’s\nposition to Gadamer’s, an ambition that is both interpretively\nand philosophically questionable); Willi 1971 (a helpful treatment of\nHerder’s approach to interpreting the Old Testament).\nTheory of Translation\n\nBerman 1984; Forster 2010 (ch. 12), 2018 (ch. 3), 2021; Huber 1968;\nHuyssen 1969; Kelletat 1984 (a helpful treatment of Herder’s\ninterest in world literature, and of his theory and practice of\ntranslation); Purdie 1965; Sauder 2009.\nLinguistics and Anthropology\n\nBroce 1986; Coseriu 2015; Forster 2010 (ch. 6), 2011a (ch. 4), 2018\n(ch. 4); Gjesdal 2013; Mühlberg 1984; Pross 1987; Zammito\n2001.\nPhilosophy of Mind\n\nBeiser 1987 (ch. 5); Forster 2011c, 2018 (ch. 5), 2019a; Nisbet\n1970.\nAesthetics\n\nForster 2010 (chs. 1, 3, and 5), 2011a (ch. 6), 2016, 2018 (ch. 6);\nGjesdal 2017; Guyer 2007; Irmscher 1987; Mayo 1969; Norton 1991\n(helpful both on aspects of Herder’s aesthetic theory and on his\ngeneral relation to the Enlightenment); Wiora 1953; Zuckert 2019.\nMoral Philosophy\n\nBerlin 1976; Booher 2015; Crowe 2012; DeSouza 2012a, 2012b, 2014;\nForster 2017b, 2018 (ch. 7), and forthcoming; Sikka 2011.\nPhilosophy of History\n\nBarnard 2003; Beiser 2003; Bollacher 1994; Forster 2011b, 2012a, 2018\n(ch. 8); Gadamer 1942; Irmscher 1984, 2010; Lovejoy 1948 (helpful and\nconcise); Maurer 1987; Meinecke [1936] 1972 (ch. 9 on Herder is very\nhelpful); Otto and Zammito 2001; Staedelmann 1928; Wells 1960; Zammito\n2009.\nPolitical Philosophy\n\nBarnard 1965 (chs. 3–5 cover Herder’s political thought\nvery well); Beiser 1992 (ch. 8 on Herder’s political philosophy\nis excellent); Berlin 1976; Bernasconi 1995; Ergang 1931 (helpful on\nHerder’s political thought and on his intellectual influence,\nbut marred by a false assimilation of Herder’s nationalism to\nlater German nationalism, and by an unduly warm assessment of such a\nposition); Forster 2010 (ch. 7), 2017a, 2018 (ch. 9); Sikka 2011.\nPhilosophy of Religion\n\nBell 1984; Forster 2012b, 2018 (ch. 10); Lindner 1960; Vollrath 1911;\nWilli 1971.\nHerder’s Influence\n\nErgang 1931; Forster 1998, 2010, 2011a, 2011b, 2011c, 2012a, 2012b,\n2012c, 2016, 2017b, 2018 (ch. 11), 2019a; Gillies 1945; Harris 1972;\nHeinz 1997; Jacoby 1911; Taylor 1975; Zammito 1992, 1997.\n",
    "bibliography": {
        "categories": [
            "Primary Texts",
            "Primary Works by Others",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Texts": [
                "</h3>\n<h4>In German</h4>\n<p>\nThere are two main German editions of Herder’s works:</p>\n<ul class=\"hanging\">",
                "<em>Johann Gottfried Herder Sämtliche Werke</em>, B. Suphan\net al. (eds.), Berlin: Weidmann, 1877–.",
                "[<strong>G</strong>] <em>Johann Gottfried Herder Werke</em>, U.\nGaier et al. (eds.), Frankfurt am Main: Deutscher Klassiker Verlag,\n1985–.\n</ul>\n<p>\nThe latter edition includes very helpful notes.</p>\n<ul class=\"hanging\">",
                "[<strong>B</strong>] <em>Johann Gottfried Herder Briefe</em>, W.\nDobbek and G. Arnold (eds.), Weimar: Hermann Böhlaus Nachfolger,\n1977.\n</ul>\n<h4>Translations</h4>\n<ul class=\"hanging\">",
                "<em>On World History: Johann Gottfried Herder, an Anthology</em>,\nHans Adler and Ernest A. Menze (eds.), Armonk, NY: M.E. Sharpe, 1996.\nContains short excerpts on history from a variety of works,\nprominently including the <em>Ideas</em>.",
                "<em>J.G. Herder on Social and Political Culture</em>, F.M. Barnard\n(ed.), Cambridge: Cambridge University Press, 1969. Includes (partial)\ntranslations of Herder’s\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>Journal</em> (1769)\n<li style=\"margin-bottom:0\"><em>Treatise on the Origin of\nLanguage</em> (1772)\n<li style=\"margin-bottom:0\"><em>This Too a Philosophy of History for\nthe Formation of Humanity</em> (1774)\n<li style=\"margin-bottom:0\"><em>Dissertation on the Reciprocal\nInfluence of Government and the Sciences</em> (1780)\n<li style=\"margin-bottom:0\"><em>Ideas for the Philosophy of the\nHistory of Humanity</em> (1784–91)\n</ul> plus a very helpful introduction.",
                "<em>Against Pure Reason: Writings on Religion, Language, and\nHistory</em>, Marcia Bunge (trans. &amp; ed.), Minneapolis: Fortress\nPress, 1993.",
                "<em>God: Some Conversations</em>, Frederick H. Burkhardt (ed.),\nNew York: Veritas Press, 1940. Reprinted Indianapolis: Bobbs-Merrill,\n1962.",
                "<em>Outlines of a Philosophy of the History of Man</em>, T.\nChurchill (ed.), London: J. Johnson/L. Hansard, 1803. (This is a\ntranslation of the <em>Ideas</em>.)",
                "[<strong>HPW</strong>] <em>J.G. Herder: Philosophical\nWritings</em>, Michael N. Forster (trans. &amp; ed.), Cambridge:\nCambridge University Press, 2002. Contains translations of\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>How Philosophy Can Become More\nUniversal and Useful for the Benefit of the People</em> (1765), pages\n3–30\n<li style=\"margin-bottom:0\"><em>Fragments on Recent German\nLiterature</em> (1767–8), (excerpts on language), pages\n33–64\n<li style=\"margin-bottom:0\"><em>Treatise on the Origin of\nLanguage</em> (1772), pages 65–164\n<li style=\"margin-bottom:0\"><em>On Thomas Abbt’s Writings</em>\n(1768), (selections concerning psychology), pages 167–177\n<li style=\"margin-bottom:0\"><em>On the Cognition and Sensation of the\nHuman Soul</em> (1778), pages 187–244\n<li style=\"margin-bottom:0\"><em>On the Change of Taste</em> (1766),\npages 247–256\n<li style=\"margin-bottom:0\"><em>Older Critical Forestlet</em>\n(1767/8), (excerpt on history), pages 257–267\n<li style=\"margin-bottom:0\"><em>This Too a Philosophy of History for\nthe Formation of Humanity</em>, pages 272–358\n<li style=\"margin-bottom:0\"><em>Letters for the Advancement of\nHumanity</em> (1792), (excerpts), pages 370–424\n</ul> as well as other pieces.",
                "<em>Sculpture: Some Observations on Shape and Form from\nPygmalion’s Creative Dream</em>, Jason Gaiger (ed.), Chicago:\nThe University of Chicago Press, 2002. (This is a translation of\n<em>Plastik</em> [1778].)",
                "<em>Reflections on the Philosophy of History of Mankind</em>,\nFrank E. Manuel (ed.), Chicago: The University of Chicago Press, 1968.\nContains excerpts from Churchill’s 1803 translation of the\n<em>Ideas</em>.",
                "<em>The Spirit of Hebrew Poetry</em>, James Marsh (ed.),\nBurlington, VT: Edward Smith, 1833.",
                "<em>Johann Gottfried Herder: Selected Early Works,\n1764–7</em>, Ernest A. Menze, Karl Menges, Michael Palma (eds.),\nUniversity Park, PA: Pennsylvania State University Press, 1992.\nContains several early essays, including <em>On Diligence in Several\nLearned Languages</em> (1764), and selections from the\n<em>Fragments</em>.",
                "<em>Selected Writings on Aesthetics</em>, Gregory Moore (trans.\n&amp; ed.), Princeton, NJ: Princeton University Press, 2006. Contains\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>Critical Forests</em> (1769), first\nand fourth books\n<li style=\"margin-bottom:0\"><em>Shakespeare</em> (1773)\n<li style=\"margin-bottom:0\"><em>On the Influence of the Belles Lettres\non the Higher Sciences</em> (1781)\n<li style=\"margin-bottom:0\"><em>On Image, Poetry, and Fable</em>\n(1787)\n</ul> and several other pieces on aesthetics.",
                "<em>On the Origin of Language</em>, John H. Moran and Alexander\nGode (eds.), Chicago: The University of Chicago Press, 1986. Contains\na partial translation of <em>Treatise on the Origin of Language</em>\n(1772).",
                "<em>German Aesthetics and Literary Criticism: Winckelmann,\nLessing, Hamann, Herder, Schiller, Goethe</em>, H.B. Nisbet (ed.),\nCambridge: Cambridge University Press, 1985. Contains two pieces of\nHerder’s in aesthetics, including his important essay\n<em>Shakespeare</em>.\n</ul>\n<h3 id=\"PrimWorkOthe\">"
            ],
            "Primary Works by Others": [
                "</h3>\n<ul class=\"hanging\">",
                "Boeckh, August, 1877, <em>Enzyklopädie und Methodologie der\nphilologischen Wissenschaften</em> (<em>Encyclopedia and Methodology\nof the Philological Sciences</em>), Leipzig: Teubner.",
                "Ernesti, Johann August, 1761, <em>Institutio interpretis Novi\nTestamenti</em>, Leipzig: Weidmann.",
                "Gerber, Gustav, 1871, <em>Die Sprache als Kunst</em>, reprinted\nHildesheim: Georg Olms, 1961.",
                "Hegel, Georg, 1795/6, <em>The Positivity of the Christian\nReligion</em>, in his <em>Early Theological Writings</em>, T.M. Knox\n(trans.), Philadelphia: University of Pennsylvania Press, 1971.",
                "–––, 1798–1800, <em>The Spirit of\nChristianity and Its Fate</em>, in his <em>Early Theological\nWritings</em>.",
                "–––, 1807, <em>Phenomenology of Spirit</em>,\nA.V. Miller (trans.), Oxford: Oxford University Press, 1977.",
                "–––, 1837, <em>Reason in History</em>, R.S.\nHartmann (trans.), Upper Saddle River, NJ: Library of Liberal Arts,\n1997.",
                "–––, 1832, <em>Science of Logic</em>, A.V.\nMiller (trans.), Amherst, NY: Prometheus, 1991.",
                "Hume, David, 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London: Millar.",
                "Jacobi, Friedrich, 1785, <em>Über die Lehre des Spinoza in\nBriefen an Herrn Moses Mendelssohn</em> (<em>On the Doctrine of\nSpinoza in Letters to Mr. Moses Mendelssohn</em>), Breslau:\nLöwe.",
                "Kant, Immanuel, 1766, <em>Dreams of a Spirit Seer</em>, in his\n<em>Theoretical Philosophy, 1755–1770</em>, David Walford and\nRalf Meerbote (trans. &amp; ed.), Cambridge: Cambridge University\nPress, 2003.",
                "–––, 1790, <em>Critique of the Power of\nJudgment</em>, Paul Guyer and Eric Matthews (trans. &amp; ed.),\nCambridge: Cambridge University Press, 2000.",
                "Mill, John Stuart, 1859, <em>On Liberty</em>, Stefan Collini\n(ed.), Cambridge: Cambridge University Press, 2003.",
                "Nietzsche, Friedrich, 1873, <em>On Truth and Lying in an\nExtra-moral Sense</em>, in <em>Friedrich Nietzsche on Rhetoric and\nLanguage</em>, Sander L. Gilman, Carole Blair, and David J. Parent\n(trans. &amp; ed.), New York: Oxford University Press, 1989.",
                "–––, 1882/7, <em>The Gay Science</em>, Walter\nKaufmann (trans.), New York: Vintage, 1974.",
                "–––, 1886, <em>Beyond Good and Evil</em>, Walter\nKaufmann (trans.), New York: Vintage, 1966.",
                "–––, 1887, <em>On the Genealogy of\nMorality</em>, Maudemarie Clark and Alan Swensen (trans.),\nIndianapolis: Hackett, 1998.",
                "Schlegel, Friedrich, 1795/7, <em>On the Study of Greek Poetry</em>\n(<em>Über das Studium der griechischen Poesie</em>), Stuart\nBarnett (trans.), Albany: State University of New York Press,\n2001.",
                "–––, 1808, <em>On the Language and Wisdom of the\nIndians</em> (<em>Über die Sprache und Weisheit der Indier</em>),\nin <em>The Aesthetic and Miscellaneous Works of Friedrich von\nSchlegel</em>, E. Millington (trans.), London: H. G. Bohn, 1848.",
                "Schelling, Friedrich, 1792, <em>Antiquissimi de prima malorum\norigine philosophematis explicandi tentamen criticum</em>, in his\n<em>Sämmtliche Werke</em>, Stuttgart: Cotta, 1856–1861,\ndiv. 1, vol. 1.",
                "–––, 1792/3, <em>Ueber Mythen, historische Sagen\nund Philosopheme der ältesten Welt</em> (<em>On Myths, Historical\nLegends, and Philosophemes of the Oldest World</em>), in his\n<em>Sämmtliche Werke</em>, div. 1, vol. 1.",
                "–––, 1795, <em>On the I as the Principle of\nPhilosophy or On the Unconditional in Human Knowledge</em>, in F.\nMarti (trans. &amp; ed.), <em>The Unconditional in Human\nKnowledge</em>, Lewisburg: Bucknell University Press, 1980.",
                "–––, 1795, <em>Philosophical Letters on\nDogmatism and Criticism</em>, in <em>The Unconditional in Human\nKnowledge</em>.",
                "–––, 1797, <em>Ideas for a Philosophy of\nNature</em>, Errol E. Harris and Peter Heath (trans.), Cambridge:\nCambridge University Press, 1988.",
                "–––, 1798, <em>Von der Weltseele</em> (<em>On\nthe World Soul</em>), Hamburg: Perthes.",
                "Strauss, David Friedrich, 1835–6, <em>Das Leben Jesu,\nkritisch bearbeitet</em> (<em>The Life of Jesus Critically\nExamined</em>), Tübingen: C.F. Osiander.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Aarsleff, Hans, 1982, <em>From Locke to Saussure: Essays on the\nStudy of Language and Intellectual History</em>, Minneapolis, MN:\nUniversity of Minnesota Press.",
                "Adler, Emil, 1968, <em>Herder und die deutsche\nAufklärung</em>, Vienna: Europa.",
                "Adler, Hans, 2009, “Herder’s Style”, in Adler\nand Koepke 2009: 331–350.",
                "Adler, Hans and Wulf Koepke (eds.), 2009, <em>A Companion to the\nWorks of Johann Gottfried Herder</em>, Rochester, NY: Camden\nHouse.",
                "Barnard, Frederick M., 1965, <em>Herder’s Social and\nPolitical Thought: From Enlightenment to Nationalism</em>, Oxford:\nOxford University Press.",
                "–––, 2003, <em>Herder on Nationality, Humanity,\nand History</em>, Montreal: McGill-Queen’s University\nPress.",
                "Beiser, Frederick C., 1987, <em>The Fate of Reason: German\nPhilosophy from Kant to Fichte</em>, Cambridge, MA: Harvard University\nPress.",
                "–––, 1992, <em>Enlightenment, Revolution, and\nRomanticism: The Genesis of Modern German Political Thought,\n1790–1800</em>, Cambridge, MA: Harvard University Press.",
                "–––, 2003, <em>The German Historicist\nTradition</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199691555.001.0001 esp. ch. 3.",
                "Bell, David, 1984, <em>Spinoza in Germany from 1670 to the Age of\nGoethe</em>, London: Institute of Germanic Studies, University of\nLondon.",
                "Berlin, Isaiah, 1976, <em>Vico and Herder: Two Studies in the\nHistory of Ideas</em>, New York: The Viking Press.",
                "Berman, Antoine, 1984, <em>L’Épreuve de\nl’étranger: Culture et traduction dans l’Allemagne\nromantique</em>, Paris: Gallimard.",
                "Bernasconi, Robert, 1995, “‘Ich mag in keinen Himmel,\nwo Weisse sind’: Herder’s Critique of Eurocentrism”,\nin <em>Acta Institutionis Philosophiae et Aestheticae</em> 13:\n69–81.",
                "Bollacher, Martin (ed.), 1994, <em>Johann Gottfried Herder:\nGeschichte und Kultur</em>, Würzburg: Königshausen und\nNeumann.",
                "Booher, Charles Richard, 2015, <em>Perfection, History, and\nHarmonious Individuality: Herder’s Ethical Thought,\n1765–1791</em>, Doctoral dissertation, SUNY at Syracuse.\n [<a href=\"http://surface.syr.edu/etd/203\" target=\"other\">Booher 2015 available online</a>]",
                "Broce, Gerald, 1986, “Herder and Ethnography”,\n<em>Journal of the History of the Behavioral Sciences</em>, 22(2):\n150–170.\ndoi:0.1002/1520-6696(198604)22:2&lt;150::AID-JHBS2300220206&gt;3.0.CO;2-H",
                "Clark, Robert Thomas Jr., 1955, <em>Herder: His Life and\nThought</em>, Berkeley: University of California Press.",
                "Coseriu, Eugenio, 2015, <em>Von Herder bis Humboldt</em>\n(<em>Geschichte der Sprachphilosophie</em>, Volume 2), Tübingen:\nNarr Franck Attempto.",
                "Crowe, Benjamin D., 2012, “Herder’s Moral Philosophy:\nPerfectionism, Sentimentalism, and Theism”, <em>British Journal\nfor the History of Philosophy</em>, 20(6): 1141–1161.\ndoi:10.1080/09608788.2012.731243",
                "DeSouza, Nigel, 2012a, “Language, Reason, and Sociability:\nHerder’s Critique of Rousseau,” <em>Intellectual History\nReview</em> 22/2 (2012): 221–240.",
                "–––, 2012b, “Leibniz in the Eighteenth\nCentury: Herder’s Critical Reflections on the Principles of\nNature and Grace,” <em>British Journal for the History of\nPhilosophy</em> 20/4 (2012): 773–795.",
                "–––, 2014, “The Soul-Body Relationship and\nthe Foundations of Morality: Herder contra Mendelssohn”,\n<em>Herder Yearbook</em> 12, Rainer Godel, Karl Menges, and Johannes\nSchmidt (eds.), Heidelberg: Synchron Wissenschaftsverlag der Autoren,\npages 145–161.",
                "Ergang, Robert Reinhold, 1931, <em>Herder and the Foundations of\nGerman Nationalism</em>, New York: Columbia University Press.\nReprinted New York: Octagon Books, 1966.",
                "Forster, Michael N., 1998, <em>Hegel’s Idea of a\nPhenomenology of Spirit</em>, Chicago: University of Chicago\nPress.",
                "–––, 2010, <em>After Herder: Philosophy of\nLanguage in the German Tradition</em>, Oxford: Oxford University\nPress.",
                "–––, 2011a, <em>German Philosophy of Language:\nFrom Schlegel to Hegel and Beyond</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:osobl/9780199604814.001.001",
                "–––, 2011b, “Genealogy”,\n<em>American Dialectic</em>, 1(2): 230–250.\n [<a href=\"https://www.yumpu.com/en/document/view/3684585/genealogy-michael-forster-american-dialectic\" target=\"other\">Forster 2011 available online</a>]",
                "–––, 2011c, “Ursprung und Wesen des\nHegelschen Geistbegriffs”, in Andreas Arndt, Paul Cruysberghs,\nand Andrzej Przylebski (eds.), <em>Hegel-Jahrbuch 2011</em>, Berlin:\nAkademie Verlag, pages 213–229.",
                "–––, 2012a, “Bildung bei Herder und seinen\nNachfolgern”, in Klaus Vieweg and Michael Winkler (eds.),\n<em>Bildung und Freiheit. Ein vergessener Zusammenhang</em>,\nPaderborn: Schöningh.",
                "–––, 2012b, “Herder and Spinoza”, in\nEckart Förster and Yitzhak Y. Melamed (eds.), <em>Spinoza and\nGerman Idealism</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139135139.005",
                "–––, 2012c, “Herders Beitrag zur\nEntstehung der Idee <em>romantisch</em>”, in Michael N. Forster\nand Klaus Vieweg (eds.), <em>Die Aktualität der Romantik</em>,\nBerlin: LIT.",
                "–––, 2015, “Herder’s Doctrine of\nMeaning as Use”, in Margaret Cameron and Robert J. Stainton\n(eds.), <em>Linguistic Content: New Essays in the History of the\nPhilosophy of Language</em>, Oxford: Oxford University Press, pages\n201–222. doi:10.1093/acprof:oso/9780198732495.003.0011",
                "–––, 2016, “Historicizing Genre: The\nGerman Romantic Rethinking of Ancient Tragedy”, in M. Baumstark\n(ed.), <em>Historisierung:\nBegriff—Geschichte—Praxisfelder</em>, Berlin: de\nGruyter.",
                "–––, 2017a, “Herder and Human\nRights”, in Anik Waldow and Nigel DeSouza (ed.), <em>Herder:\nPhilosophy and Anthropology</em>, Oxford: Oxford University\nPress.",
                "–––, 2017b, “Nietzsche on Morality as a\n‘Sign Language of the Affects’”, <em>Inquiry</em>,\n60(1–2): 165–188. doi:10.1080/0020174X.2016.1258146",
                "–––, 2018, <em>Herder’s Philosophy</em>,\nOxford: Oxford University Press.",
                "–––, 2019a, “The Origin and Character of\nHegel’s Concept of <em>Geist</em>”, in Marina F. Bykova (ed.),\n<em>Hegel’s Philosophy of Spirit: A Critical Guide</em>,\nCambridge: Cambridge University Press, pages 29–54.",
                "–––, 2019b, “Imagination and Interpretation:\nHerder’s Concept of <em>Einfühlung</em>”, in Gerad Gentry\nand Konstantin Pollok (eds.), <em>The Imagination in German Idealism\nand Romanticism</em>, Cambridge: Cambridge University Press, pages\n175–189.",
                "–––, 2021, “Les origines de la théorie de\nla traduction défamiliarisante chez d’Alembert, Abbt,\nHerder et Schleiermacher”, in Tatiana Milliaressi and Christian Berner\n(eds.), <em>Traduire les sciences humaines</em>, Paris: Classiques\nGarnier, pages 97–111.",
                "–––, forthcoming, “Herder on Humanity”, in\nStefanie Buchenau and Ansgar Lyssy (eds.), <em>Humankind and Humanity\nin the Philosophy of the Enlightenment</em>, London/New York:\nBloomsbury.",
                "Gadamer, Hans-Georg, 1942, <em>Volk und Geschichte im Denken\nHerders</em>, Frankfurt: Klostermann.",
                "Gillies, Alexander, 1945, <em>Herder</em> (Modern Language\nStudies), Oxford: Blackwell.",
                "Gjesdal, Kristin, 2004, “Reading Shakespeare—Reading\nModernity”, <em>Angelaki</em>, 9(3): 17–31.",
                "–––, 2013, “‘A Not Yet Invented\nLogic’: Herder on Bildung, Anthropology, and the Future of\nPhilosophy”, in Klaus Vieweg and Michael N. Forster (eds.),\n<em>Die Bildung der Moderne</em>, Tübingen: Francke-Verlag, pages\n53–69.",
                "–––, 2017, <em>Herder’s Hermeneutics:\nHistory, Poetry, Enlightenment</em>, Cambridge: Cambridge University\nPress.",
                "Greif, Stefan, Marion Heinz, and Heinrich Clairmont (eds.), 2016,\n<em>Herder Handbuch</em>, Paderborn: Fink.",
                "Guyer, Paul, 2007, “Free Play and True Well-Being:\nHerder’s Critique of Kant’s Aesthetics”, <em>The\nJournal of Aesthetics and Art Criticism</em>, 65(4): 353–368.\ndoi:10.1111/j.1540-594X.2007.00269.x",
                "Hacking, Ian, 1988, “Night Thoughts on Philology”,\n<em>History of the Present</em>, 1: 3–10. Reprinted in Hacking\n2002: 140–151.",
                "–––, 1994, “How, Why, When, and Where Did\nLanguage Go Public?” in <em>Reading After Foucault:\nInstitutions, Disciplines, and Technologies of the Self in Germany,\n1750–1830</em>, Robert Scott Leventhal (ed.), pages 31–50.\nReprinted in Hacking 2002: 121–139.",
                "–––, 2002, <em>Historical Ontology</em>,\nCambridge MA: Harvard University Press.",
                "Harris, H.S., 1972, <em>Hegel’s Development: Toward the\nSunlight 1770–1801</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198243588.001.0001",
                "Haym, Rudolf, 1880, <em>Herder nach seinem Leben und seinen\nWerken</em>, Berlin: Gaertner.",
                "Heinz, Marion, 1994, <em>Sensualistischer Idealismus.\nUntersuchungen zur Erkenntnistheorie des jungen Herder\n(1763–1778)</em>, Hamburg: Felix Meiner.",
                "––– (ed.), 1997, <em>Herder und die Philosophie\ndes deutschen Idealismus = Fichte-Studien-Supplementa</em> (Volume 8),\nAmsterdam / Atlanta, GA: Editions Rodopi B.V..",
                "Heise, Jens, 1998, <em>Johann Gottfried Herder zur\nEinführung</em>, Hamburg: Junius Verlag.",
                "Huber, Thomas, 1968, <em>Studien zur Theorie des Übersetzens\nim Zeitalter der deutschen Aufklärung 1730–1770</em>,\nMeisenheim am Glan: Anton Hain.",
                "Huyssen, Andreas, 1969, <em>Die frühromantische Konzeption\nvon Übersetzung und Aneignung</em>, Zürich and Freiburg:\nAtlantis.",
                "Irmscher, Hans Dietrich, 1973, “Grundzüge der\nHermeneutik Herders”, in <em>Bückeburger Gespräche\nüber J.G. Herder 1971</em>, Bückeburg: Grimme, pages\n17–59.",
                "–––, 1984, “Grundfragen der\nGeschichtsphilosophie Herders bis 1774”, in <em>Bückeburger\nGespräche über J.G. Herder 1983</em>, Bückeburg:\nGrimme, pages 10–33.",
                "–––, 1987, “Zur Ästhetik des jungen\nHerder”, in Sauder 1987: pages 43–76.",
                "–––, 2001, <em>Johann Gottfried Herder</em>,\nStuttgart: Reclam.",
                "–––, 2010, “Gegenwartskritik und\nZukunftsbild in Herders <em>Auch eine Philosophie der Geschichte zur\nBildung der Menschheit</em>”, in his\n<em>“Weitstrahlsinniges” Denken: Studien zu Johann\nGottfried Herder</em>, Würzburg: Königshausen und Neumann,\npages 73–84.",
                "Jacoby, Günther, 1911, <em>Herder als Faust</em>, Leipzig:\nFelix Meiner.",
                "Kelletat, Andreas F., 1984, <em>Herder und die Weltliteratur</em>,\nFrankfurt am Main: Peter Lang.",
                "Kleingeld, Pauline, 2013, <em>Kant and Cosmopolitanism: The\nPhilosophical Ideal of World Citizenship</em>, Cambridge: Cambridge\nUniversity Press.",
                "Lindner, Herbert, 1960, <em>Das Problem des Spinozismus im\nSchaffen Goethes und Herders</em>, Weimar: Arion Verlag.",
                "Lovejoy, Arthur O., 1948, “Herder and the Enlightenment\nPhilosophy of History”, in his <em>Essays on the History of\nIdeas</em>, Baltimore, MD: Johns Hopkins Press. Reprinted New York:\nCapricorn Books, 1960, pages 166–182.",
                "Mayo, Robert S., 1969, <em>Herder and the Beginnings of\nComparative Literature</em>, Chapel Hill, NC: The University of North\nCarolina Press.",
                "Maurer, Michael, 1987, “Die Geschichtsphilosophie des jungen\nHerder in ihrem Verhältnis zur Aufklärung”, in Sauder\n1987: pages 141–155.",
                "Meinecke, Friedrich, [1936] 1972, <em>Historism: The Rise of a New\nHistorical Outlook</em> (<em>Die Entstehung des Historismus</em>),\nJ.E. Anderson (trans.), New York: Herder and Herder.",
                "Mühlberg, Dietrich, 1984, “Herders Theorie der\nKulturgeschichte in ihrer Bedeutung für die Begründung der\nKulturwissenschaft”, <em>Jahrbuch für Volkskunde und\nKulturgeschichte</em>, 12 (1984), pages 9–26.",
                "Nisbet, H.B., 1970, <em>Herder and the Philosophy and History of\nScience</em>, Cambridge, MA: Modern Humanities Research\nAssociation.",
                "Norton, Robert Edward, 1991, <em>Herder’s Aesthetics and the\nEuropean Enlightenment</em>, Ithaca, NY: Cornell University\nPress.",
                "Otto, Regine and John H. Zammito (eds.), 2001, <em>Vom\nSelbstdenken: Aufklärung und Aufklärungskritik in Herders\n“Ideen zur Philosophie der Geschichte der\nMenschheit”</em>, Heidelberg: Synchron.",
                "Piirimäe, Eva, Liina Lukas, and Johannes Schmidt, 2020,\n<em>Herder on Empathy and Sympathy</em>, Leiden: Brill.",
                "Popper, Karl R., 1945, <em>The Open Society and its Enemies</em>,\nLondon: Routledge.",
                "Pross, Wolfgang, 1987, “Herder und die Anthropologie der\nAufklärung”, in W. Pross (ed.), <em>Johann Gottfried\nHerder: Werke</em>, Munich: Hanser.",
                "Purdie, Edna, 1965, <em>Studies in German Literature of the\nEighteenth Century: Some Aspects of Literary Affiliation</em>, London:\nAthlone.",
                "Sapir, Edward, 1907, “Herder’s ‘Ursprung der\nSprache’”, <em>Modern Philology</em>, 5(1): 109–142.\ndoi:10.1086/386734.",
                "Sauder, Gerhard (ed.), 1987, <em>Johann Gottfried Herder\n1744–1803</em>, Hamburg: Felix Meiner.",
                "–––, 2009, “Herder’s Poetic Works:\nHis Translations and His Views on Poetry”, in Adler and Koepke\n2009: 305–330.",
                "Sikka, Sonia, 2011, <em>Herder on Humanity and Cultural\nDifference: Enlightened Relativism</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511783012",
                "Staedelmann, Rudolf, 1928, <em>Der historische Sinn bei\nHerder</em>, Halle: Max Niemeyer Verlag.",
                "Taylor, Charles, 1975, <em>Hegel</em>, Cambridge: Cambridge\nUniversity Press.",
                "–––, 1991, “The Importance of\nHerder”, in E. and A. Margalit (eds.), <em>Isaiah Berlin: A\nCelebration</em>, Chicago: The University of Chicago Press.",
                "–––, 1996, “Language and Human\nNature”, in his <em>Human Agency and Language: Philosophical\nPapers I</em>, Cambridge: Cambridge University Press.",
                "–––, 2016, <em>The Language Animal: The Full\nShape of the Human Linguistic Capacity</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Vollrath, Wilhelm, 1911, <em>Die Auseinandersetzung Herders mit\nSpinoza</em>, Darmstadt: C.F. Winter.",
                "Wells, G.A., 1960, “Herder’s Two Philosophies of\nHistory”, <em>Journal of the History of Ideas</em>, 21(4):\n527–537. doi:10.2307/2708100",
                "Wiese, Benno von, 1939, <em>Herder: Grundzüge seines\nWeltbildes</em>, Leipzig: Bibliographisches Institut.",
                "Willi, Thomas, 1971, <em>Herders Beitrag zum Verstehen des Alten\nTestaments</em>, Tübingen: J.C.B. Mohr.",
                "Wiora, Walter, 1953, “Herders Ideen zur Geschichte der\nMusik”, in Erich Keyser (ed.), <em>Im Geiste Herders</em>,\nKitzingen am Main: Holzner.",
                "Zammito, John H., 1992, <em>The Genesis of Kant’s Critique\nof Judgment</em>, Chicago: University of Chicago Press.",
                "–––, 1997, “Herder, Kant, Spinoza und die\nUrsprünge des deutschen Idealismus”, in Heinz 1997: pages\n107–144.",
                "–––, 2001, <em>Kant, Herder, and the Birth of\nModern Anthropology</em>, Chicago: The University of Chicago\nPress.",
                "–––, 2009, “Herder and Historical\nMetanarrative: What’s Philosophical About History?” in\nAdler and Koepke 2009: 65–92.",
                "Zuckert, Rachel, 2019, <em>Herder’s Naturalist\nAesthetics</em>, Cambridge: Cambridge University Press.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimText\">Primary Texts</h3>\n<h4>In German</h4>\n<p>\nThere are two main German editions of Herder’s works:</p>\n<ul class=\"hanging\">\n<li><em>Johann Gottfried Herder Sämtliche Werke</em>, B. Suphan\net al. (eds.), Berlin: Weidmann, 1877–.</li>\n<li>[<strong>G</strong>] <em>Johann Gottfried Herder Werke</em>, U.\nGaier et al. (eds.), Frankfurt am Main: Deutscher Klassiker Verlag,\n1985–.</li>\n</ul>\n<p>\nThe latter edition includes very helpful notes.</p>\n<ul class=\"hanging\">\n<li>[<strong>B</strong>] <em>Johann Gottfried Herder Briefe</em>, W.\nDobbek and G. Arnold (eds.), Weimar: Hermann Böhlaus Nachfolger,\n1977.</li>\n</ul>\n<h4>Translations</h4>\n<ul class=\"hanging\">\n<li><em>On World History: Johann Gottfried Herder, an Anthology</em>,\nHans Adler and Ernest A. Menze (eds.), Armonk, NY: M.E. Sharpe, 1996.\nContains short excerpts on history from a variety of works,\nprominently including the <em>Ideas</em>.</li>\n<li><em>J.G. Herder on Social and Political Culture</em>, F.M. Barnard\n(ed.), Cambridge: Cambridge University Press, 1969. Includes (partial)\ntranslations of Herder’s\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>Journal</em> (1769)</li>\n<li style=\"margin-bottom:0\"><em>Treatise on the Origin of\nLanguage</em> (1772)</li>\n<li style=\"margin-bottom:0\"><em>This Too a Philosophy of History for\nthe Formation of Humanity</em> (1774)</li>\n<li style=\"margin-bottom:0\"><em>Dissertation on the Reciprocal\nInfluence of Government and the Sciences</em> (1780)</li>\n<li style=\"margin-bottom:0\"><em>Ideas for the Philosophy of the\nHistory of Humanity</em> (1784–91)</li>\n</ul> plus a very helpful introduction.</li>\n<li><em>Against Pure Reason: Writings on Religion, Language, and\nHistory</em>, Marcia Bunge (trans. &amp; ed.), Minneapolis: Fortress\nPress, 1993.</li>\n<li><em>God: Some Conversations</em>, Frederick H. Burkhardt (ed.),\nNew York: Veritas Press, 1940. Reprinted Indianapolis: Bobbs-Merrill,\n1962.</li>\n<li><em>Outlines of a Philosophy of the History of Man</em>, T.\nChurchill (ed.), London: J. Johnson/L. Hansard, 1803. (This is a\ntranslation of the <em>Ideas</em>.)</li>\n<li>[<strong>HPW</strong>] <em>J.G. Herder: Philosophical\nWritings</em>, Michael N. Forster (trans. &amp; ed.), Cambridge:\nCambridge University Press, 2002. Contains translations of\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>How Philosophy Can Become More\nUniversal and Useful for the Benefit of the People</em> (1765), pages\n3–30</li>\n<li style=\"margin-bottom:0\"><em>Fragments on Recent German\nLiterature</em> (1767–8), (excerpts on language), pages\n33–64</li>\n<li style=\"margin-bottom:0\"><em>Treatise on the Origin of\nLanguage</em> (1772), pages 65–164</li>\n<li style=\"margin-bottom:0\"><em>On Thomas Abbt’s Writings</em>\n(1768), (selections concerning psychology), pages 167–177</li>\n<li style=\"margin-bottom:0\"><em>On the Cognition and Sensation of the\nHuman Soul</em> (1778), pages 187–244</li>\n<li style=\"margin-bottom:0\"><em>On the Change of Taste</em> (1766),\npages 247–256</li>\n<li style=\"margin-bottom:0\"><em>Older Critical Forestlet</em>\n(1767/8), (excerpt on history), pages 257–267</li>\n<li style=\"margin-bottom:0\"><em>This Too a Philosophy of History for\nthe Formation of Humanity</em>, pages 272–358</li>\n<li style=\"margin-bottom:0\"><em>Letters for the Advancement of\nHumanity</em> (1792), (excerpts), pages 370–424</li>\n</ul> as well as other pieces.</li>\n<li><em>Sculpture: Some Observations on Shape and Form from\nPygmalion’s Creative Dream</em>, Jason Gaiger (ed.), Chicago:\nThe University of Chicago Press, 2002. (This is a translation of\n<em>Plastik</em> [1778].)</li>\n<li><em>Reflections on the Philosophy of History of Mankind</em>,\nFrank E. Manuel (ed.), Chicago: The University of Chicago Press, 1968.\nContains excerpts from Churchill’s 1803 translation of the\n<em>Ideas</em>.</li>\n<li><em>The Spirit of Hebrew Poetry</em>, James Marsh (ed.),\nBurlington, VT: Edward Smith, 1833.</li>\n<li><em>Johann Gottfried Herder: Selected Early Works,\n1764–7</em>, Ernest A. Menze, Karl Menges, Michael Palma (eds.),\nUniversity Park, PA: Pennsylvania State University Press, 1992.\nContains several early essays, including <em>On Diligence in Several\nLearned Languages</em> (1764), and selections from the\n<em>Fragments</em>.</li>\n<li><em>Selected Writings on Aesthetics</em>, Gregory Moore (trans.\n&amp; ed.), Princeton, NJ: Princeton University Press, 2006. Contains\n\n<ul class=\"hanging\" style=\"margin-bottom:1ex\">\n<li style=\"margin-bottom:0\"><em>Critical Forests</em> (1769), first\nand fourth books</li>\n<li style=\"margin-bottom:0\"><em>Shakespeare</em> (1773)</li>\n<li style=\"margin-bottom:0\"><em>On the Influence of the Belles Lettres\non the Higher Sciences</em> (1781)</li>\n<li style=\"margin-bottom:0\"><em>On Image, Poetry, and Fable</em>\n(1787)</li>\n</ul> and several other pieces on aesthetics.</li>\n<li><em>On the Origin of Language</em>, John H. Moran and Alexander\nGode (eds.), Chicago: The University of Chicago Press, 1986. Contains\na partial translation of <em>Treatise on the Origin of Language</em>\n(1772).</li>\n<li><em>German Aesthetics and Literary Criticism: Winckelmann,\nLessing, Hamann, Herder, Schiller, Goethe</em>, H.B. Nisbet (ed.),\nCambridge: Cambridge University Press, 1985. Contains two pieces of\nHerder’s in aesthetics, including his important essay\n<em>Shakespeare</em>.</li>\n</ul>\n<h3 id=\"PrimWorkOthe\">Primary Works by Others</h3>\n<ul class=\"hanging\">\n<li>Boeckh, August, 1877, <em>Enzyklopädie und Methodologie der\nphilologischen Wissenschaften</em> (<em>Encyclopedia and Methodology\nof the Philological Sciences</em>), Leipzig: Teubner.</li>\n<li>Ernesti, Johann August, 1761, <em>Institutio interpretis Novi\nTestamenti</em>, Leipzig: Weidmann.</li>\n<li>Gerber, Gustav, 1871, <em>Die Sprache als Kunst</em>, reprinted\nHildesheim: Georg Olms, 1961.</li>\n<li>Hegel, Georg, 1795/6, <em>The Positivity of the Christian\nReligion</em>, in his <em>Early Theological Writings</em>, T.M. Knox\n(trans.), Philadelphia: University of Pennsylvania Press, 1971.</li>\n<li>–––, 1798–1800, <em>The Spirit of\nChristianity and Its Fate</em>, in his <em>Early Theological\nWritings</em>.</li>\n<li>–––, 1807, <em>Phenomenology of Spirit</em>,\nA.V. Miller (trans.), Oxford: Oxford University Press, 1977.</li>\n<li>–––, 1837, <em>Reason in History</em>, R.S.\nHartmann (trans.), Upper Saddle River, NJ: Library of Liberal Arts,\n1997.</li>\n<li>–––, 1832, <em>Science of Logic</em>, A.V.\nMiller (trans.), Amherst, NY: Prometheus, 1991.</li>\n<li>Hume, David, 1748, <em>An Enquiry Concerning Human\nUnderstanding</em>, London: Millar.</li>\n<li>Jacobi, Friedrich, 1785, <em>Über die Lehre des Spinoza in\nBriefen an Herrn Moses Mendelssohn</em> (<em>On the Doctrine of\nSpinoza in Letters to Mr. Moses Mendelssohn</em>), Breslau:\nLöwe.</li>\n<li>Kant, Immanuel, 1766, <em>Dreams of a Spirit Seer</em>, in his\n<em>Theoretical Philosophy, 1755–1770</em>, David Walford and\nRalf Meerbote (trans. &amp; ed.), Cambridge: Cambridge University\nPress, 2003.</li>\n<li>–––, 1790, <em>Critique of the Power of\nJudgment</em>, Paul Guyer and Eric Matthews (trans. &amp; ed.),\nCambridge: Cambridge University Press, 2000.</li>\n<li>Mill, John Stuart, 1859, <em>On Liberty</em>, Stefan Collini\n(ed.), Cambridge: Cambridge University Press, 2003.</li>\n<li>Nietzsche, Friedrich, 1873, <em>On Truth and Lying in an\nExtra-moral Sense</em>, in <em>Friedrich Nietzsche on Rhetoric and\nLanguage</em>, Sander L. Gilman, Carole Blair, and David J. Parent\n(trans. &amp; ed.), New York: Oxford University Press, 1989.</li>\n<li>–––, 1882/7, <em>The Gay Science</em>, Walter\nKaufmann (trans.), New York: Vintage, 1974.</li>\n<li>–––, 1886, <em>Beyond Good and Evil</em>, Walter\nKaufmann (trans.), New York: Vintage, 1966.</li>\n<li>–––, 1887, <em>On the Genealogy of\nMorality</em>, Maudemarie Clark and Alan Swensen (trans.),\nIndianapolis: Hackett, 1998.</li>\n<li>Schlegel, Friedrich, 1795/7, <em>On the Study of Greek Poetry</em>\n(<em>Über das Studium der griechischen Poesie</em>), Stuart\nBarnett (trans.), Albany: State University of New York Press,\n2001.</li>\n<li>–––, 1808, <em>On the Language and Wisdom of the\nIndians</em> (<em>Über die Sprache und Weisheit der Indier</em>),\nin <em>The Aesthetic and Miscellaneous Works of Friedrich von\nSchlegel</em>, E. Millington (trans.), London: H. G. Bohn, 1848.</li>\n<li>Schelling, Friedrich, 1792, <em>Antiquissimi de prima malorum\norigine philosophematis explicandi tentamen criticum</em>, in his\n<em>Sämmtliche Werke</em>, Stuttgart: Cotta, 1856–1861,\ndiv. 1, vol. 1.</li>\n<li>–––, 1792/3, <em>Ueber Mythen, historische Sagen\nund Philosopheme der ältesten Welt</em> (<em>On Myths, Historical\nLegends, and Philosophemes of the Oldest World</em>), in his\n<em>Sämmtliche Werke</em>, div. 1, vol. 1.</li>\n<li>–––, 1795, <em>On the I as the Principle of\nPhilosophy or On the Unconditional in Human Knowledge</em>, in F.\nMarti (trans. &amp; ed.), <em>The Unconditional in Human\nKnowledge</em>, Lewisburg: Bucknell University Press, 1980.</li>\n<li>–––, 1795, <em>Philosophical Letters on\nDogmatism and Criticism</em>, in <em>The Unconditional in Human\nKnowledge</em>.</li>\n<li>–––, 1797, <em>Ideas for a Philosophy of\nNature</em>, Errol E. Harris and Peter Heath (trans.), Cambridge:\nCambridge University Press, 1988.</li>\n<li>–––, 1798, <em>Von der Weltseele</em> (<em>On\nthe World Soul</em>), Hamburg: Perthes.</li>\n<li>Strauss, David Friedrich, 1835–6, <em>Das Leben Jesu,\nkritisch bearbeitet</em> (<em>The Life of Jesus Critically\nExamined</em>), Tübingen: C.F. Osiander.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Aarsleff, Hans, 1982, <em>From Locke to Saussure: Essays on the\nStudy of Language and Intellectual History</em>, Minneapolis, MN:\nUniversity of Minnesota Press.</li>\n<li>Adler, Emil, 1968, <em>Herder und die deutsche\nAufklärung</em>, Vienna: Europa.</li>\n<li>Adler, Hans, 2009, “Herder’s Style”, in Adler\nand Koepke 2009: 331–350.</li>\n<li>Adler, Hans and Wulf Koepke (eds.), 2009, <em>A Companion to the\nWorks of Johann Gottfried Herder</em>, Rochester, NY: Camden\nHouse.</li>\n<li>Barnard, Frederick M., 1965, <em>Herder’s Social and\nPolitical Thought: From Enlightenment to Nationalism</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2003, <em>Herder on Nationality, Humanity,\nand History</em>, Montreal: McGill-Queen’s University\nPress.</li>\n<li>Beiser, Frederick C., 1987, <em>The Fate of Reason: German\nPhilosophy from Kant to Fichte</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>–––, 1992, <em>Enlightenment, Revolution, and\nRomanticism: The Genesis of Modern German Political Thought,\n1790–1800</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2003, <em>The German Historicist\nTradition</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199691555.001.0001 esp. ch. 3.</li>\n<li>Bell, David, 1984, <em>Spinoza in Germany from 1670 to the Age of\nGoethe</em>, London: Institute of Germanic Studies, University of\nLondon.</li>\n<li>Berlin, Isaiah, 1976, <em>Vico and Herder: Two Studies in the\nHistory of Ideas</em>, New York: The Viking Press.</li>\n<li>Berman, Antoine, 1984, <em>L’Épreuve de\nl’étranger: Culture et traduction dans l’Allemagne\nromantique</em>, Paris: Gallimard.</li>\n<li>Bernasconi, Robert, 1995, “‘Ich mag in keinen Himmel,\nwo Weisse sind’: Herder’s Critique of Eurocentrism”,\nin <em>Acta Institutionis Philosophiae et Aestheticae</em> 13:\n69–81.</li>\n<li>Bollacher, Martin (ed.), 1994, <em>Johann Gottfried Herder:\nGeschichte und Kultur</em>, Würzburg: Königshausen und\nNeumann.</li>\n<li>Booher, Charles Richard, 2015, <em>Perfection, History, and\nHarmonious Individuality: Herder’s Ethical Thought,\n1765–1791</em>, Doctoral dissertation, SUNY at Syracuse.\n [<a href=\"http://surface.syr.edu/etd/203\" target=\"other\">Booher 2015 available online</a>]</li>\n<li>Broce, Gerald, 1986, “Herder and Ethnography”,\n<em>Journal of the History of the Behavioral Sciences</em>, 22(2):\n150–170.\ndoi:0.1002/1520-6696(198604)22:2&lt;150::AID-JHBS2300220206&gt;3.0.CO;2-H</li>\n<li>Clark, Robert Thomas Jr., 1955, <em>Herder: His Life and\nThought</em>, Berkeley: University of California Press.</li>\n<li>Coseriu, Eugenio, 2015, <em>Von Herder bis Humboldt</em>\n(<em>Geschichte der Sprachphilosophie</em>, Volume 2), Tübingen:\nNarr Franck Attempto.</li>\n<li>Crowe, Benjamin D., 2012, “Herder’s Moral Philosophy:\nPerfectionism, Sentimentalism, and Theism”, <em>British Journal\nfor the History of Philosophy</em>, 20(6): 1141–1161.\ndoi:10.1080/09608788.2012.731243</li>\n<li>DeSouza, Nigel, 2012a, “Language, Reason, and Sociability:\nHerder’s Critique of Rousseau,” <em>Intellectual History\nReview</em> 22/2 (2012): 221–240.</li>\n<li>–––, 2012b, “Leibniz in the Eighteenth\nCentury: Herder’s Critical Reflections on the Principles of\nNature and Grace,” <em>British Journal for the History of\nPhilosophy</em> 20/4 (2012): 773–795.</li>\n<li>–––, 2014, “The Soul-Body Relationship and\nthe Foundations of Morality: Herder contra Mendelssohn”,\n<em>Herder Yearbook</em> 12, Rainer Godel, Karl Menges, and Johannes\nSchmidt (eds.), Heidelberg: Synchron Wissenschaftsverlag der Autoren,\npages 145–161.</li>\n<li>Ergang, Robert Reinhold, 1931, <em>Herder and the Foundations of\nGerman Nationalism</em>, New York: Columbia University Press.\nReprinted New York: Octagon Books, 1966.</li>\n<li>Forster, Michael N., 1998, <em>Hegel’s Idea of a\nPhenomenology of Spirit</em>, Chicago: University of Chicago\nPress.</li>\n<li>–––, 2010, <em>After Herder: Philosophy of\nLanguage in the German Tradition</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2011a, <em>German Philosophy of Language:\nFrom Schlegel to Hegel and Beyond</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:osobl/9780199604814.001.001</li>\n<li>–––, 2011b, “Genealogy”,\n<em>American Dialectic</em>, 1(2): 230–250.\n [<a href=\"https://www.yumpu.com/en/document/view/3684585/genealogy-michael-forster-american-dialectic\" target=\"other\">Forster 2011 available online</a>]</li>\n<li>–––, 2011c, “Ursprung und Wesen des\nHegelschen Geistbegriffs”, in Andreas Arndt, Paul Cruysberghs,\nand Andrzej Przylebski (eds.), <em>Hegel-Jahrbuch 2011</em>, Berlin:\nAkademie Verlag, pages 213–229.</li>\n<li>–––, 2012a, “Bildung bei Herder und seinen\nNachfolgern”, in Klaus Vieweg and Michael Winkler (eds.),\n<em>Bildung und Freiheit. Ein vergessener Zusammenhang</em>,\nPaderborn: Schöningh.</li>\n<li>–––, 2012b, “Herder and Spinoza”, in\nEckart Förster and Yitzhak Y. Melamed (eds.), <em>Spinoza and\nGerman Idealism</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139135139.005</li>\n<li>–––, 2012c, “Herders Beitrag zur\nEntstehung der Idee <em>romantisch</em>”, in Michael N. Forster\nand Klaus Vieweg (eds.), <em>Die Aktualität der Romantik</em>,\nBerlin: LIT.</li>\n<li>–––, 2015, “Herder’s Doctrine of\nMeaning as Use”, in Margaret Cameron and Robert J. Stainton\n(eds.), <em>Linguistic Content: New Essays in the History of the\nPhilosophy of Language</em>, Oxford: Oxford University Press, pages\n201–222. doi:10.1093/acprof:oso/9780198732495.003.0011</li>\n<li>–––, 2016, “Historicizing Genre: The\nGerman Romantic Rethinking of Ancient Tragedy”, in M. Baumstark\n(ed.), <em>Historisierung:\nBegriff—Geschichte—Praxisfelder</em>, Berlin: de\nGruyter.</li>\n<li>–––, 2017a, “Herder and Human\nRights”, in Anik Waldow and Nigel DeSouza (ed.), <em>Herder:\nPhilosophy and Anthropology</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2017b, “Nietzsche on Morality as a\n‘Sign Language of the Affects’”, <em>Inquiry</em>,\n60(1–2): 165–188. doi:10.1080/0020174X.2016.1258146</li>\n<li>–––, 2018, <em>Herder’s Philosophy</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2019a, “The Origin and Character of\nHegel’s Concept of <em>Geist</em>”, in Marina F. Bykova (ed.),\n<em>Hegel’s Philosophy of Spirit: A Critical Guide</em>,\nCambridge: Cambridge University Press, pages 29–54.</li>\n<li>–––, 2019b, “Imagination and Interpretation:\nHerder’s Concept of <em>Einfühlung</em>”, in Gerad Gentry\nand Konstantin Pollok (eds.), <em>The Imagination in German Idealism\nand Romanticism</em>, Cambridge: Cambridge University Press, pages\n175–189.</li>\n<li>–––, 2021, “Les origines de la théorie de\nla traduction défamiliarisante chez d’Alembert, Abbt,\nHerder et Schleiermacher”, in Tatiana Milliaressi and Christian Berner\n(eds.), <em>Traduire les sciences humaines</em>, Paris: Classiques\nGarnier, pages 97–111.</li>\n<li>–––, forthcoming, “Herder on Humanity”, in\nStefanie Buchenau and Ansgar Lyssy (eds.), <em>Humankind and Humanity\nin the Philosophy of the Enlightenment</em>, London/New York:\nBloomsbury. </li>\n<li>Gadamer, Hans-Georg, 1942, <em>Volk und Geschichte im Denken\nHerders</em>, Frankfurt: Klostermann.</li>\n<li>Gillies, Alexander, 1945, <em>Herder</em> (Modern Language\nStudies), Oxford: Blackwell.</li>\n<li>Gjesdal, Kristin, 2004, “Reading Shakespeare—Reading\nModernity”, <em>Angelaki</em>, 9(3): 17–31.</li>\n<li>–––, 2013, “‘A Not Yet Invented\nLogic’: Herder on Bildung, Anthropology, and the Future of\nPhilosophy”, in Klaus Vieweg and Michael N. Forster (eds.),\n<em>Die Bildung der Moderne</em>, Tübingen: Francke-Verlag, pages\n53–69.</li>\n<li>–––, 2017, <em>Herder’s Hermeneutics:\nHistory, Poetry, Enlightenment</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Greif, Stefan, Marion Heinz, and Heinrich Clairmont (eds.), 2016,\n<em>Herder Handbuch</em>, Paderborn: Fink.</li>\n<li>Guyer, Paul, 2007, “Free Play and True Well-Being:\nHerder’s Critique of Kant’s Aesthetics”, <em>The\nJournal of Aesthetics and Art Criticism</em>, 65(4): 353–368.\ndoi:10.1111/j.1540-594X.2007.00269.x</li>\n<li>Hacking, Ian, 1988, “Night Thoughts on Philology”,\n<em>History of the Present</em>, 1: 3–10. Reprinted in Hacking\n2002: 140–151.</li>\n<li>–––, 1994, “How, Why, When, and Where Did\nLanguage Go Public?” in <em>Reading After Foucault:\nInstitutions, Disciplines, and Technologies of the Self in Germany,\n1750–1830</em>, Robert Scott Leventhal (ed.), pages 31–50.\nReprinted in Hacking 2002: 121–139.</li>\n<li>–––, 2002, <em>Historical Ontology</em>,\nCambridge MA: Harvard University Press.</li>\n<li>Harris, H.S., 1972, <em>Hegel’s Development: Toward the\nSunlight 1770–1801</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198243588.001.0001</li>\n<li>Haym, Rudolf, 1880, <em>Herder nach seinem Leben und seinen\nWerken</em>, Berlin: Gaertner.</li>\n<li>Heinz, Marion, 1994, <em>Sensualistischer Idealismus.\nUntersuchungen zur Erkenntnistheorie des jungen Herder\n(1763–1778)</em>, Hamburg: Felix Meiner.</li>\n<li>––– (ed.), 1997, <em>Herder und die Philosophie\ndes deutschen Idealismus = Fichte-Studien-Supplementa</em> (Volume 8),\nAmsterdam / Atlanta, GA: Editions Rodopi B.V..</li>\n<li>Heise, Jens, 1998, <em>Johann Gottfried Herder zur\nEinführung</em>, Hamburg: Junius Verlag.</li>\n<li>Huber, Thomas, 1968, <em>Studien zur Theorie des Übersetzens\nim Zeitalter der deutschen Aufklärung 1730–1770</em>,\nMeisenheim am Glan: Anton Hain.</li>\n<li>Huyssen, Andreas, 1969, <em>Die frühromantische Konzeption\nvon Übersetzung und Aneignung</em>, Zürich and Freiburg:\nAtlantis.</li>\n<li>Irmscher, Hans Dietrich, 1973, “Grundzüge der\nHermeneutik Herders”, in <em>Bückeburger Gespräche\nüber J.G. Herder 1971</em>, Bückeburg: Grimme, pages\n17–59.</li>\n<li>–––, 1984, “Grundfragen der\nGeschichtsphilosophie Herders bis 1774”, in <em>Bückeburger\nGespräche über J.G. Herder 1983</em>, Bückeburg:\nGrimme, pages 10–33.</li>\n<li>–––, 1987, “Zur Ästhetik des jungen\nHerder”, in Sauder 1987: pages 43–76.</li>\n<li>–––, 2001, <em>Johann Gottfried Herder</em>,\nStuttgart: Reclam.</li>\n<li>–––, 2010, “Gegenwartskritik und\nZukunftsbild in Herders <em>Auch eine Philosophie der Geschichte zur\nBildung der Menschheit</em>”, in his\n<em>“Weitstrahlsinniges” Denken: Studien zu Johann\nGottfried Herder</em>, Würzburg: Königshausen und Neumann,\npages 73–84.</li>\n<li>Jacoby, Günther, 1911, <em>Herder als Faust</em>, Leipzig:\nFelix Meiner.</li>\n<li>Kelletat, Andreas F., 1984, <em>Herder und die Weltliteratur</em>,\nFrankfurt am Main: Peter Lang.</li>\n<li>Kleingeld, Pauline, 2013, <em>Kant and Cosmopolitanism: The\nPhilosophical Ideal of World Citizenship</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Lindner, Herbert, 1960, <em>Das Problem des Spinozismus im\nSchaffen Goethes und Herders</em>, Weimar: Arion Verlag.</li>\n<li>Lovejoy, Arthur O., 1948, “Herder and the Enlightenment\nPhilosophy of History”, in his <em>Essays on the History of\nIdeas</em>, Baltimore, MD: Johns Hopkins Press. Reprinted New York:\nCapricorn Books, 1960, pages 166–182.</li>\n<li>Mayo, Robert S., 1969, <em>Herder and the Beginnings of\nComparative Literature</em>, Chapel Hill, NC: The University of North\nCarolina Press.</li>\n<li>Maurer, Michael, 1987, “Die Geschichtsphilosophie des jungen\nHerder in ihrem Verhältnis zur Aufklärung”, in Sauder\n1987: pages 141–155.</li>\n<li>Meinecke, Friedrich, [1936] 1972, <em>Historism: The Rise of a New\nHistorical Outlook</em> (<em>Die Entstehung des Historismus</em>),\nJ.E. Anderson (trans.), New York: Herder and Herder.</li>\n<li>Mühlberg, Dietrich, 1984, “Herders Theorie der\nKulturgeschichte in ihrer Bedeutung für die Begründung der\nKulturwissenschaft”, <em>Jahrbuch für Volkskunde und\nKulturgeschichte</em>, 12 (1984), pages 9–26.</li>\n<li>Nisbet, H.B., 1970, <em>Herder and the Philosophy and History of\nScience</em>, Cambridge, MA: Modern Humanities Research\nAssociation.</li>\n<li>Norton, Robert Edward, 1991, <em>Herder’s Aesthetics and the\nEuropean Enlightenment</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Otto, Regine and John H. Zammito (eds.), 2001, <em>Vom\nSelbstdenken: Aufklärung und Aufklärungskritik in Herders\n“Ideen zur Philosophie der Geschichte der\nMenschheit”</em>, Heidelberg: Synchron.</li>\n<li>Piirimäe, Eva, Liina Lukas, and Johannes Schmidt, 2020,\n<em>Herder on Empathy and Sympathy</em>, Leiden: Brill.</li>\n<li>Popper, Karl R., 1945, <em>The Open Society and its Enemies</em>,\nLondon: Routledge.</li>\n<li>Pross, Wolfgang, 1987, “Herder und die Anthropologie der\nAufklärung”, in W. Pross (ed.), <em>Johann Gottfried\nHerder: Werke</em>, Munich: Hanser.</li>\n<li>Purdie, Edna, 1965, <em>Studies in German Literature of the\nEighteenth Century: Some Aspects of Literary Affiliation</em>, London:\nAthlone.</li>\n<li>Sapir, Edward, 1907, “Herder’s ‘Ursprung der\nSprache’”, <em>Modern Philology</em>, 5(1): 109–142.\ndoi:10.1086/386734.</li>\n<li>Sauder, Gerhard (ed.), 1987, <em>Johann Gottfried Herder\n1744–1803</em>, Hamburg: Felix Meiner.</li>\n<li>–––, 2009, “Herder’s Poetic Works:\nHis Translations and His Views on Poetry”, in Adler and Koepke\n2009: 305–330.</li>\n<li>Sikka, Sonia, 2011, <em>Herder on Humanity and Cultural\nDifference: Enlightened Relativism</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511783012</li>\n<li>Staedelmann, Rudolf, 1928, <em>Der historische Sinn bei\nHerder</em>, Halle: Max Niemeyer Verlag.</li>\n<li>Taylor, Charles, 1975, <em>Hegel</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>–––, 1991, “The Importance of\nHerder”, in E. and A. Margalit (eds.), <em>Isaiah Berlin: A\nCelebration</em>, Chicago: The University of Chicago Press.</li>\n<li>–––, 1996, “Language and Human\nNature”, in his <em>Human Agency and Language: Philosophical\nPapers I</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2016, <em>The Language Animal: The Full\nShape of the Human Linguistic Capacity</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Vollrath, Wilhelm, 1911, <em>Die Auseinandersetzung Herders mit\nSpinoza</em>, Darmstadt: C.F. Winter.</li>\n<li>Wells, G.A., 1960, “Herder’s Two Philosophies of\nHistory”, <em>Journal of the History of Ideas</em>, 21(4):\n527–537. doi:10.2307/2708100</li>\n<li>Wiese, Benno von, 1939, <em>Herder: Grundzüge seines\nWeltbildes</em>, Leipzig: Bibliographisches Institut.</li>\n<li>Willi, Thomas, 1971, <em>Herders Beitrag zum Verstehen des Alten\nTestaments</em>, Tübingen: J.C.B. Mohr.</li>\n<li>Wiora, Walter, 1953, “Herders Ideen zur Geschichte der\nMusik”, in Erich Keyser (ed.), <em>Im Geiste Herders</em>,\nKitzingen am Main: Holzner.</li>\n<li>Zammito, John H., 1992, <em>The Genesis of Kant’s Critique\nof Judgment</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1997, “Herder, Kant, Spinoza und die\nUrsprünge des deutschen Idealismus”, in Heinz 1997: pages\n107–144.</li>\n<li>–––, 2001, <em>Kant, Herder, and the Birth of\nModern Anthropology</em>, Chicago: The University of Chicago\nPress.</li>\n<li>–––, 2009, “Herder and Historical\nMetanarrative: What’s Philosophical About History?” in\nAdler and Koepke 2009: 65–92.</li>\n<li>Zuckert, Rachel, 2019, <em>Herder’s Naturalist\nAesthetics</em>, Cambridge: Cambridge University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "cosmopolitanism",
            "Dilthey, Wilhelm",
            "dualism",
            "egalitarianism",
            "Hamann, Johann Georg",
            "Hegel, Georg Wilhelm Friedrich",
            "hermeneutics",
            "history, philosophy of",
            "Humboldt, Wilhelm von",
            "Kant, Immanuel",
            "Kant, Immanuel: aesthetics and teleology",
            "liberalism",
            "Mill, John Stuart",
            "nationalism",
            "naturalism",
            "Nietzsche, Friedrich",
            "physicalism",
            "rationalism vs. empiricism",
            "relativism",
            "religion: philosophy of",
            "Schelling, Friedrich Wilhelm Joseph von",
            "Schlegel, Friedrich",
            "Schleiermacher, Friedrich Daniel Ernst",
            "skepticism",
            "Spinoza, Baruch",
            "Wolff, Christian"
        ],
        "entry_link": [
            {
                "../cosmopolitanism/": "cosmopolitanism"
            },
            {
                "../dilthey/": "Dilthey, Wilhelm"
            },
            {
                "../dualism/": "dualism"
            },
            {
                "../egalitarianism/": "egalitarianism"
            },
            {
                "../hamann/": "Hamann, Johann Georg"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../hermeneutics/": "hermeneutics"
            },
            {
                "../history/": "history, philosophy of"
            },
            {
                "../wilhelm-humboldt/": "Humboldt, Wilhelm von"
            },
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../kant-aesthetics/": "Kant, Immanuel: aesthetics and teleology"
            },
            {
                "../liberalism/": "liberalism"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../nationalism/": "nationalism"
            },
            {
                "../naturalism/": "naturalism"
            },
            {
                "../nietzsche/": "Nietzsche, Friedrich"
            },
            {
                "../physicalism/": "physicalism"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            },
            {
                "../relativism/": "relativism"
            },
            {
                "../philosophy-religion/": "religion: philosophy of"
            },
            {
                "../schelling/": "Schelling, Friedrich Wilhelm Joseph von"
            },
            {
                "../schlegel/": "Schlegel, Friedrich"
            },
            {
                "../schleiermacher/": "Schleiermacher, Friedrich Daniel Ernst"
            },
            {
                "../skepticism/": "skepticism"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../wolff-christian/": "Wolff, Christian"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=herder\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/herder/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=herder&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/herder/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=herder": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/herder/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=herder&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/herder/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://tinomarkworth.com/herder-bibliography/\" target=\"other\">Herder Bibliography</a>,\n maintained by Tino Markworth."
        ],
        "listed_links": [
            {
                "https://tinomarkworth.com/herder-bibliography/": "Herder Bibliography"
            }
        ]
    }
}