{
    "url": "higher-order-evidence",
    "title": "Higher-Order Evidence",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Sophie Horowitz\n<shorowitz@umass.edu>",
        "author_links": [
            {
                "mailto:shorowitz%40umass%2eedu": "shorowitz@umass.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nSophie Horowitz\n&lt;<a href=\"mailto:shorowitz%40umass%2eedu\"><em>shorowitz<abbr title=\" at \">@</abbr>umass<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Sep 6, 2022"
    ],
    "preamble": "\n\nHigher-order evidence is evidence which bears on a believer’s\nrational capacities, epistemic performance, or evidential situation.\nMany epistemologists hold that this kind of evidence can rationally\naffect our “first-order” beliefs as well: that is, those\nbeliefs about the world that we form using the relevant rational\ncapacities, or in the relevant evidential situation. It is easiest to\nget a grip on this phenomenon by looking at examples. Here is a\nparadigmatic case (paraphrased from Schoenfield 2018: 690, based on\nsimilar cases put forth by Adam Elga [2013 and 2008—see Other\nInternet Resources], Lasonen-Aarnio [2014], Christensen [2010a], and\nothers):\n\n\nHypoxia: Aisha is out flying her small, unpressurized\nairplane, wondering whether she has enough fuel to make it to Hawaii.\nShe looks at the gauges, dials, and maps, and obtains some evidence,\nE, which she knows strongly supports (say to degree .99)\neither the proposition that she has enough gas (G) or that\nshe does not (~G). Thinking it over and performing the\nnecessary calculations, Aisha concludes G; in fact, this is\nwhat E supports. But then she checks her altitude and notices\nthat she’s at great risk for hypoxia, a condition which impairs\none’s reasoning while leaving the reasoner feeling perfectly\ncogent and clear-headed. Aisha knows that at this altitude, pilots\nperforming the kinds of calculations she just did only reach the\ncorrect conclusion 50% of the time.\n\n\nAisha’s “first-order” evidence is her evidence\nbearing directly on her beliefs about G: that is, the\nevidence she receives by consulting her dials, gauges, and maps. Her\n“higher-order” evidence is her evidence suggesting that\nshe’s at risk for hypoxia. Higher-order evidence bears directly\non Aisha’s epistemic situation in various ways, but does not\nbear directly on G. The primary question that this case\nraises, for the higher-order evidence literature, is: does\nAisha’s higher-order evidence also rationally affect\nher beliefs about G? (That is, does it bear on G in\nsome indirect way?)\n\nSome say yes. It would be reckless for Aisha to head out over the\nPacific after realizing that there is such a serious chance that\nshe’s rationally impaired, which surely shows (some argue) that\nshe should not be very confident of G. Others say no. As the\ncase stipulates, Aisha’s first-order evidence strongly supports\nG; whether Aisha is hypoxic has absolutely nothing to do with\nwhether she has enough gas to make it to Hawaii. (Why would her\ntotal evidence prompt her to revise confidence in G,\nwhen the new evidence she has gained is irrelevant to\nG?) Answering “yes” raises questions about\nexactly how and why this level-interaction works. Answering\n“no” raises questions about how to explain the intuitive\nunreasonableness of Aisha’s maintaining high confidence in\nG.\n\nHigher-order evidence thus raises a puzzle. Two apparent features of\nHypoxia are in tension with one another: it seems that Aisha is\nrequired to reduce her confidence in G, and yet it also seems\nthat her evidence still strongly supports G. Some see this as\na conflict between the belief state that seems intuitively rational\n(reduced confidence or suspension of judgment about G) and\nthe belief state that seems strongly supported by her evidence (high\nconfidence in G). Others see it as a conflict within her\nbeliefs. If Aisha maintains high confidence in G, but also\ntakes seriously the possibility that she could be hypoxic, she will be\nin a state of epistemic akrasia: she will have a belief state\n(her high confidence in G) which she also judges likely to be\nirrational, or unsupported by her evidence.\n\nIn what follows we will see these issues crop up in several different\nforms. This article will be organized around a few core questions\nabout higher-order evidence, which will give us different ways to\napproach these central puzzles.\n\nIs higher-order evidence different from ordinary evidence? If so,\nhow?\nWhy might we deny that higher-order evidence has a\nrational effect on first-order beliefs? And if we take that approach,\nwhich problems and questions remain?\nIf higher-order evidence rationally affects first-order beliefs,\nhow does this work? What sort of principle might govern that\ninteraction?\nIs there a way to split the difference, embracing both sides of\nthe puzzle? For example, might there be different, incompatible\nepistemic norms at work in cases like Hypoxia, one telling Aisha to\nbelieve G and another telling her to suspend judgment?\n\n\nA few quick notes before moving on. Following most of the literature,\nthe term “higher-order evidence” is used here, although it\nwould be more accurate to speak of higher-order evidential\neffects or higher-order evidential import (since one\npiece of evidence may be relevant to a person’s beliefs about\nmany different subject matters, in a number of different ways). And\nlike most of the literature, the focus is on higher-order\ndefeat, rather than higher-order confirmation, even\nthough these possibilities go hand in hand. Some of the issues\ndiscussed in this article are discussed in more detail in the entry on\n epistemic self-doubt.\n Finally, although the higher-order evidence debate has its roots in\nthe literature on disagreement, this entry focuses on the simpler,\nsingle-person case introduced above and mostly omits disagreement.\n",
    "toc": [
        {
            "#WhatDistAbouHighOrdeEvid": "1. What is Distinctive About Higher-Order Evidence?"
        },
        {
            "#DenyImpoHighOrdeEvid": "2. Denying the Import of Higher-Order Evidence"
        },
        {
            "#StruProbForHighOrdeEvid": "2.1 Structural problems for higher-order evidence"
        },
        {
            "#HighOrdeDefeSelfUnde": "2.2 Higher-order defeat and self-undermining"
        },
        {
            "#ConsDenyImpoHighOrdeEvid": "2.3 Consequences of denying the import of higher-order evidence"
        },
        {
            "#AccoImpoHighOrdeEvid": "3. Accommodating the Import of Higher-Order Evidence"
        },
        {
            "#IndePrin": "3.1 Independence principles"
        },
        {
            "#LeveBridPrin": "3.2 Level-bridging principles"
        },
        {
            "#RatiFocuPrin": "3.2.1 Rationality-focused principles"
        },
        {
            "#ReliFocuPrin": "3.2.2 Reliability-focused principles"
        },
        {
            "#DileTwoNormView": "4. Dilemmas and Two-Norm Views"
        },
        {
            "#Dile": "4.1 Dilemmas"
        },
        {
            "#IdeaVsNonIdeaModeEval": "4.2 Ideal vs. non-ideal modes of evaluation"
        },
        {
            "#BestPlanFollVsBestPlanMake": "4.3 Best plans to follow vs. best plans to make"
        },
        {
            "#ReasVsRati": "4.4 Reasons vs. rationality"
        },
        {
            "#EvidVsDisp": "4.5 Evidence vs. dispositions"
        },
        {
            "#PropJustVsDoxaJust": "4.5 Propositional justification vs. doxastic justification"
        },
        {
            "#Conc": "5. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Distinctive About Higher-Order Evidence?\n\nHigher-order evidence was introduced above by example. We can come\nacross higher-order evidence in a variety of ways: brain-altering\nconditions like hypoxia, or drugs, but also more mundane sources like\nbias and fatigue. Many epistemologists have discussed\ndisagreement as a source of higher-order evidence: if an\nequally well-informed and thoughtful person looks at the evidence and\ndraws a different conclusion from yours, this arguably gives you\nreason to worry that you’ve made a rational error (see, e.g.,\nKelly 2005, Feldman 2006, Christensen 2007b, Elga 2008 and much\nfollowing literature). And some have argued that “irrelevant\ninfluences” on belief, such as one’s religious upbringing,\ncan be a source of higher-order evidence as well: the realization that\nyou would have had different religious beliefs if you had been raised\nin a different community, for example, might give you reason to doubt\nthe rationality of those beliefs (see Elga 2008—see Other\nInternet Resources, White 2010, and Vavova 2018). It is hard to find\nan uncontroversial definition of higher-order evidence, as different\nauthors understand it in different ways. But even without a general\ndefinition, we can look at cases like Hypoxia to see how higher-order\nevidence is importantly distinctive. (This section assumes that\nhigher-order evidence has some first-order rational import, as this is\nwhere the distinctive features arise.)\n\nAt first glance, one might think that Hypoxia is simply a case of\nundercutting defeat, and Aisha’s justification for believing\nG is defeated just as one’s perceptual beliefs might be\ndefeated by, for instance, evidence of tricky lighting. But as Feldman\n(2005) argues, higher-order defeat and undercutting defeat are\nimportantly different. Compare Hypoxia to a case in which you find out\nthat a certain wall, which appears to be red, is illuminated by a red\nlight. In the latter case, you might recognize that your experience as\nof a red wall generally supports the belief that the wall is\nred, and also recognize that you responded appropriately to that\nevidence before finding out about the tricky lighting. But in Hypoxia\nit seems that Aisha is not in a position to recognize either of these\nthings. If she takes her higher-order evidence seriously, she will\ncome to doubt whether her first-order evidence ever supported\nG in the first place. And she will also doubt whether she\nevaluated it correctly. (See Coates 2012 and Christensen 2010a for\nsimilar discussion.) So higher-order defeat is not simply undercutting\ndefeat.\n\nJoshua DiPaolo (2018) argues that higher-order defeat is also\ndistinctive in that it is “object-independent”. For\ninstance, learning that there is a red light on the wall will undercut\nyour belief that the wall is red, but will have no effect if you\nbelieve that the wall is not red. Higher-order evidence, on the other\nhand, typically does not discriminate based on the contents of the\nbeliefs it targets. Extending DiPaolo’s argument to our case\nabove, Aisha’s higher-order evidence targeted her belief about\nG, but could have easily targeted a belief with different\ncontents if she had been reasoning about a different matter while\nflying at that altitude.\n\nChristensen (2010a) argues that higher-order evidence is distinctive\nbecause its import is agent-relative. While Aisha's information about\nhypoxia gives Aisha reason to doubt her beliefs about whether\nshe will make it to Hawaii, it would have no such effect on another\nperson looking at the same charts and dials from the safety of the\nground. However, merely treating higher-order evidence as indexical\ndoes not seem to make it less puzzling; see Schoenfield 2018 for\nfurther discussion.\n\nPerhaps the most puzzling feature of higher-order evidence is that it\nseems to obligate agents to ignore or set aside parts of their total\nevidence. (See Christensen 2010a for an early defense of this idea;\nothers, including Elga (2007), also defend it in the context of\ndisagreement.) Even as Aisha comes to doubt her conclusion about\nG, her first-order evidence and reasoning is still plainly\nbefore her. But she cannot rationally appeal to it in forming her\nbeliefs. If she could, Aisha might argue:\n\n\nalthough I’m at an altitude that renders me susceptible to\nhypoxia, I must be immune. After all, my first-order evidence in fact\nsupports the conclusion that I have enough fuel to make it to Hawaii,\nand that’s the very same conclusion I reached!\n\n\nTo a supporter of higher-order defeat, such reasoning looks irrational\nand dogmatic. (Furthermore, if she could reason this way, Aisha could\narguably keep her high confidence in G—which his just\nto say, her higher-order evidence wouldn’t have a rational\neffect after all.) In order to rule out the rationality of such\nreasoning, while acknowledging that Aisha’s first-order evidence\nhas not vanished, some epistemologists say that Aisha must set aside\nthe targeted first-order evidence and reasoning once her higher-order\nevidence comes in. This thought is often called\n“Independence”.\n Section 3.1\n discusses it in more detail.\n\nFinally, related to this last observation, Horowitz (2019) and\nSchoenfield (2015b, 2018) both argue that higher-order evidence is\npredictably misleading: if it has first-order effects, we can predict\na priori that it will lead ideally rational thinkers away\nfrom the truth. We expect first-order evidence to generally make us\nmore accurate, provided that we respond to it rationally. And we\nexpect higher-order evidence to lead us away from what our first-order\nevidence supports. So when we accommodate all of that evidence\nrationally, we’ll tend to end up with a less accurate\nbelief state than we would if we had ignored the higher-order\nevidence.\n\nIn all of these ways, higher-order evidence presents distinctive\nproblems for epistemology. (Though distinctive does not necessarily\nmean rare: Hedden and Dorst [forthcoming] argue that almost all\nevidence has higher-order import.) As we will see in the next section,\nthe difficulties presented by higher-order evidence have prompted some\nepistemologists to deny that it has first-order import altogether.\n2. Denying the Import of Higher-Order Evidence\n\nHigher-order evidence raises special problems. One very general\nproblem is that it is hard to see how we could make sense of\nhigher-order evidence within a consistent, total picture of\nrationality. Maria Lasonen-Aarnio (2014) brings out this point\nespecially forcefully and comprehensively, so this next section will\nlargely follow her presentation. (See also Schechter 2013 for\ndiscussion of many similar concerns.) We will then look at a slightly\ndifferent objection to theories that accommodate higher-order\nevidence: the charge that they are self-defeating. The\nsection will conclude with some options for theories according to\nwhich higher-order evidence does not rationally affect\nfirst-order beliefs.\n2.1 Structural problems for higher-order evidence\n\nLasonen-Aarnio begins with the observation that respecting\nhigher-order evidence can compel a rational agent to violate genuine\nepistemic rules. (This is very similar to the idea presented in the\nintroduction: that after Aisha receives her higher-order evidence, her\ntotal evidence still supports G.) Since this thought\nis common to much of the higher-order evidence literature, it will be\nworth spelling out in detail the reasoning behind it. One simple way\nto make the thought plausible is to focus on a case of\nentailment—so, let’s suppose Aisha’s first-order\nevidence entails G. Then we can argue as follows:\n\nP1.\nAisha’s first-order evidence entails G.\nP2.\nAfter Aisha receives her higher-order evidence, her total evidence\nentails G.\nP3.\nIt is a rational requirement to believe what our evidence\nentails.\nP4.\nAfter Aisha receives her higher-order evidence, she is rationally\nrequired to believe G.\nP5.\nAfter Aisha receives her higher-order evidence, she is rationally\nrequired to suspend judgment on G.\nC.\nAfter receiving her higher-order evidence, Aisha is rationally\nrequired to violate a rational requirement.\n\n\nP1\n is built into (this version of) our case.\n P2\n follows from\n P1,\n assuming that Aisha’s body of total evidence grows\nmonotonically over the course of the story.\n P3\n is plausible, and would nicely explain our verdict at the beginning\nof the story: that, before she receives her higher-order evidence,\nAisha should believe G.\n P4\n follows from\n P2\n and\n P3.\n And\n P5\n is the intuitive verdict that many epistemologists share about cases\nlike Hypoxia. (Though see Henderson forthcoming, Staffel forthcoming,\nand Steglich-Peterson 2019 for alternative views on which higher-order\nevidence does not require suspension of judgment, but still has a\nrational effect.) So if\n P5\n is right, this means that Aisha is required to disobey an epistemic\nrule which applies to her current situation: she must suspend judgment\nin a proposition that is entailed by her evidence, rather than believe\nit.\n\nThough focusing on entailment makes the argument above particularly\nclear, it’s not essential. The same problem can, plausibly,\narise with non-entailing evidence as well. Lasonen-Aarnio focuses on a\nperceptual case, and Christensen (2010a) argues that cases involving\ninductive reasoning can lead to the same conclusion. (Both argue for\nversions of\n P2\n in non-entailing contexts: they argue, respectively, that the\nperceptual or inductive support remains even in the face of\nhigher-order undermining.)\n\nHow can we make sense of Aisha’s situation, in light of this\napparent conflict? Lasonen-Aarnio (2014) surveys several possible ways\nto make room for the conflict within our overall epistemological\ntheory. One strategy we might try is to say that epistemic rules have\nbuilt-in exceptions for higher-order defeat. That doesn’t solve\nthe problem, Lasonen-Aarnio argues, but just pushes it back: if any\nrule can be defeated, then so can rules with built-in exceptions. A\nsecond strategy is to say that epistemic rules are hierarchical, with\nsome taking precedence over others; but again, the higher-level rules\nmust themselves be defeasible, leading to an infinite hierarchy. The\nrules must also be ordered by a “meta-rule” which\ndetermines which rule governs one’s current situation; what if\nthe meta-rule itself is defeasible? It seems that we are either left\nwith an infinite regress, or that we must accept a stopping\npoint—a rule which itself cannot be rationally defeated. Another\nstrategy is to posit an “Über-rule” which specifies\nthe rational response for each unique situation. This fails,\nLasonen-Aarnio argues, because it is too complex for us to grasp, too\ndifferent from the epistemic rules we ordinarily take ourselves to\nfollow, and endorsing it leaves us with an unsatisfying kind of\nparticularism about rationality. This proposal also runs into the same\nproblem we saw above. If the Über-Rule is always correct, we must\nsay that it cannot be rationally defeated. If we are willing to accept\nindefeasible rules, why should we think that higher-order defeat\nhappens at all? (Why not just accept the rules governing Aisha’s\nbelief in G as themselves indefeasible by higher-order\ndoubt?) Lasonen-Aarnio concludes that in light of these problems, we\nshould reject higher-order defeat. (See Bradley 2019 for response to\nLasonen-Aarnio, and a defense of the Über-rule.)\n2.2 Higher-order defeat and self-undermining\n\nAnother route to doubt about higher-order defeat is what’s\nsometimes called the “self-undermining” objection. As\nseveral epistemologists have pointed out, there are strange\nconsequences for anyone who believes a theory on which\nhigher-order evidence has first-order effects: it seems that this\nbelief is liable to undercut its own justification. Let’s\nconsider a candidate principle on which higher-order evidence can\ndefeat first-order beliefs; call it “HOD” (for\n“higher-order defeat”). Now consider a person, Sam, who\nbelieves that HOD is a true principle of rationality. What happens if\nSam’s belief in HOD is itself a target of higher-order\ndefeat? This might happen through peer disagreement (which is the\nfocus of most of the literature on this objection) or other means.\nAfterwards, according to HOD, Sam cannot rationally believe HOD.\n\nThis might already seem like a problem to some: a true theory of\nrationality should not (arguably) undermine our justification for\nbelieving it. And taking it a step further, it can look like the\ntheory is either paradoxical or incoherent. If HOD can call for its\nown rejection (in the cases where belief in HOD is itself undermined),\nhow can it give us coherent directions? Suppose Sam’s\nhigher-order evidence targets two beliefs simultaneously: his belief\nabout some proposition P, and his belief about HOD itself.\nHOD tells him to reduce confidence in P. But since HOD is\nundermined as well, it is arguably also telling him not to\nreduce confidence (or to reduce confidence to a lesser degree). These\nrecommendations are incompatible, yielding the worry that HOD is\ninternally inconsistent. On the other hand, the worry about paradox\narises when we consider what happens when Sam begins to revise his\nbeliefs. Once HOD is undermined, suppose Sam no longer believes it,\nand goes back to revise the beliefs that he formed on its basis. But\nhis last application of HOD was what led to his doubting HOD—so\nif he “undoes” that step, he’ll believe HOD again!\nBut then his belief in HOD will be undermined by his higher-order\nevidence, and the loop will start over. (For further discussion see\nElga 2010, Weatherson 2013, Christensen 2013 and 2021a, and Bradley\n2019. See Roush 2009 for discussion of a related phenomenon.)\n\nAdvocates of higher-order defeat have offered a few different\nresponses to this class of objections. One option, proposed by Elga\n(2010), is to say that principles like HOD are exempt from\nundermining. (Elga’s view draws on an argument found in Lewis\n1971 and H. Field 2000, for the conclusion that our most fundamental\nbelief-forming methods must be self-recommending.) Another option is\nto say that our attitude towards principles like HOD is not one of\nbelief, but some other type of attitude. (See Goldberg 2013,\nBarnett 2019, and Fleisher 2021 for examples of this approach.)\nFinally, one might simply deny that Sam is obligated to enter the\nparadoxical loop once his belief in HOD is undermined. Christensen\n(2013, 2021a, 2021b) argues along these lines. The loop gets started\nif we think that once Sam rationally doubts HOD, he is rationally\nrequired to stop adopting the beliefs that HOD recommends, and instead\nadopt whichever beliefs he now regards as most rational. But this\nthought is not part of HOD, and we are free to deny it—we can\nmaintain that HOD is true, and rationally binding even for those who\nrationally doubt it. (This is different from saying that HOD must be\nself-recommending; on Elga’s proposal, one should\nbelieve that one should always follow HOD, and also always\nfollow it. On Christensen’s, one should always follow HOD,\nregardless of what one should believe one should do.) This response\nwould bypass the paradox. But it comes at what some defenders of HOD\nsee as a cost: it means we must accept some instances of rational\nepistemic akrasia. If Sam revises his belief in HOD, but continues to\nfollow it, as this suggestion would have him do, he will end up with a\nbelief state whose rationality he doubts.\n\nIn the face of these difficulties, some epistemologists conclude that\nhigher-order defeat is simply not a genuine phenomenon. These views\nare discussed next. In sections 3 and 4, we will come back to the\noptions for accommodating higher-order defeat.\n2.3 Consequences of denying the import of higher-order evidence\n\nIf we hold that higher-order evidence does not have first-order\nrational effects, what should we say about cases like Hypoxia? There\nare two mainstream options defended in the literature.\n“Level-Splitters” suggest that Aisha’s first-order\nbelief (about G) should follow her first-order evidence, so\nshe should be highly confident of G. But her higher-order\nbelief (about her own rationality, or about what her first-order\nevidence supports) should follow her higher-order evidence.\n“Steadfasters” argue that Aisha should just dismiss the\nhigher-order evidence altogether—believe G, and believe\nthat her evidence supports it. (See Alexander 2013, however, for an\nargument that no response is justified in Aisha’s case,\nand Leonard 2020 for an argument that it is indeterminate what Aisha\nshould believe.)\n\nDefenders of the Level-Splitting view include Lasonen-Aarnio (2014),\nCoates (2012), Weatherson (ms–see Other Internet Resources),\nWilliamson (2014), and Wedgwood (2012). The obvious advantage is that\nthis view straightforwardly takes all of Aisha’s evidence into\naccount: her evidence about G affects her beliefs about\nG, and her evidence about her epistemic situation affects her\nbeliefs about her epistemic situation. An obvious upshot of this view\nis that epistemic akrasia can be rational: in particular, in Hypoxia,\nAisha should end up believing G, while also believing that\nher evidence likely doesn’t support G.\n\nBut admitting rational epistemic akrasia in this case incurs a large\nintuitive cost. As Horowitz (2014) argues, if epistemic akrasia is\nrational in cases like Aisha’s, then so is bootstrapping: if\nAisha finds herself in this situation a number of times in a row, or\nregarding a number of different beliefs, she can use her first-order\nbeliefs to establish a fantastic track record of success, ultimately\ndismissing the possibility that she was ever rationally impaired. This\nreasoning looks absurd—because, presumably, there is a tension\nbetween strongly holding a belief while also believing one’s\nevidence doesn’t support it. So why allow this tension in even\none case? Horowitz also illustrates other examples of irrational\nreasoning and action that seem warranted by epistemic akrasia; see\nalso Brown 2018, Littlejohn 2018, and Silva 2018 for further\ndiscussion of intuitively irrational reasoning and action licensed by\nepistemic akrasia in these cases, as well as Feldman 2005 for an\nearlier rejection of epistemic akrasia in similar circumstances.\n\nThe second possibility is to say that higher-order evidence simply has\nno effect on first-order or higher-order beliefs. (Following\nthe peer disagreement literature, we could call this a\n“steadfast” view; Smithies [2019] calls it “upward\npush”.) Kelly (2005) seems to tentatively support this view in\nthe context of peer disagreement (though his later work defends a more\nmoderate “total evidence” view; see, for example, Kelly\n2010). Titelbaum (2015) argues for the nearby position that a rational\nagent can never be mistaken about the rational requirements that apply\nto her situation (although she might be rationally uncertain as to\nwhich situation she is in); he writes that “mistakes about\nrationality are mistakes of rationality”.\nTitelbaum’s argument for this rests on the assumption that\nepistemic akrasia is irrational. (See also Titelbaum 2019. See C.\nField 2019 for criticism of this position.) Tal (2021) also defends\nthe steadfast view, in part appealing to the irrationality of\nepistemic akrasia.\n\nSmithies (2019; see especially ch. 10) gives an extended defense of a\nsteadfast view. He argues that ideal rationality requires rational\nomniscience—that is, omniscience both about what the rational\nrequirements are and which requirements apply to one at all times.\nThis means that misleading higher-order evidence is, in an important\nsense, impossible to come by. While non-ideal agents like Aisha may be\nmistaken about what evidence they have or what it supports, these\nmistakes are themselves departures from ideal rationality. (Smithies\nalso supplements this with a view about non-ideal rationality, which\nis discussed below.)\n\nOne of the primary objections to the steadfast view is that ignoring\nhigher-order evidence appears to be blatantly dogmatic: it is hard to\nsee how it could be rational for Aisha to continue believing\nG with no reduction in confidence, after hearing that her\naltitude puts her at risk of hypoxia. (Though Tom Kelly has argued\n[see Kelly 2013, for example] that dogmatism in such cases is not\ninherently irrational.) Additionally, acting on her belief that\nG—say, setting off for Hawaii with a plane full of\npassengers—would be shockingly irresponsible, suggesting that\nsomething is wrong with the belief that G. (See Christensen\n2010a, for example.)\n\nCases like Hypoxia therefore leave us with three choices. If we say\nthat Aisha should maintain confidence in G, but reduce\nconfidence that it’s rational for her to belief G, we\nmust explain why epistemic akrasia can be rational. If we say she\nshould maintain confidence in G and dismiss the possibility\nof hypoxia, we must explain why dogmatism can be rational. And if we\nsay she should reduce confidence in G, we must explain how\nthis type of defeat works, and how it fits into our broader theory of\nrationality. Let us now return to that last question.\n3. Accommodating the Import of Higher-Order Evidence\n\nIn this section we will look more closely at the possibilities for\naccommodating higher-order defeat. Even setting aside questions about\nhow such defeat fits into the rest of our epistemological theory,\nthere are several more local questions about how higher-order defeat\nworks. What sort of principle could explain the intuitive verdicts in\ncases like Hypoxia? Which evidence and reasoning can agents like Aisha\nrely on in forming their beliefs, and under what circumstances? What\ndetermines which attitude, exactly, Aisha should have towards\nG after taking both her first-order and her higher-order\nevidence into account?\n\nThere are a couple of different ideas that epistemologists sympathetic\nto higher-order evidence typically aim to capture. One is the thought\nthat higher-order evidence requires us to “bracket” or set\naside some of our first-order evidence and reasoning. This is often\ncalled “Independence”. The second is the thought that, in\naccommodating one’s higher-order evidence, one should somehow\nadjust one’s first-order belief to match what one has\nlearned from the higher-order evidence: either to match what one\nbelieves or has reason to believe would be rational, to match\none’s expected level of reliability, or some variation\non one of these. Principles dictating how one should calibrate\none’s first-order beliefs in light of higher-order evidence are\noften called “level-bridging principles” or\n“calibration principles”.\n\nMany specific proposals for how to accommodate higher-order evidence\n(often focusing on the case of disagreement, which we can think of as\na variety of higher-order defeat) combine both of these ideas. For\nexample, here is Elga’s (2007: 490) formulation of the\n“Equal Weight View” of disagreement:\n\n\nEqual weight view Upon finding out that an advisor\ndisagrees, your probability that you are right should equal your prior\nconditional probability that you would be right. Prior to what? Prior\nto your thinking through the disputed issue, and finding out what the\nadvisor thinks of it. Conditional on what? On whatever you have\nlearned about the circumstances of the disagreement.\n\n\nCalibrating your confidence to the probability that “you would\nbe right” is a way of matching your confidence in P to your\nexpected reliability about P, so the Equal Weight View is in part a\nlevel-bridging principle. And the “prior” and\n“conditional” clauses commit Elga to an Independence\nprinciple as well: he is saying that we must set aside the\nspecific first-order evidence and reasoning about the relevant matter,\nand consider only the surrounding “circumstances”. In the\nvery next paragraph Elga clarifies that “whatever you have\nlearned about the circumstances of the disagreement” must be\nindependent from the reasoning leading to the disagreement itself.\nInstead, it should include facts about the situation that would affect\nyour or your peer’s reliability, such as how much coffee you\nhave each had, how absurd you find the other person’s answer,\nand whether the reasoning invites a type of mistake that you or your\nfriend is especially likely to make.\n\nThe next two subsections discuss Independence and level-bridging\nseparately. But many authors who endorse one of these (in one form or\nanother) also endorse the other.\n3.1 Independence principles\n\nIndependence principles say, roughly, that higher-order evidence calls\nfor us to set aside some of our evidence, and not rely on it in our\nreasoning. This thought is required to rule out the kind of dogmatic\nresponse to higher-order evidence discussed above: if we did\nnot have to set aside our first-order evidence and reasoning,\nit would be rational to rely on it to dismiss any higher-order doubt.\nIndependence raises a number of questions. How can it be rational to\nignore evidence? What, exactly, do we have to ignore? And does\nIndependence open the door to skepticism?\n\nSome balk at Independence because it simply seems irrational to ignore\nevidence (see Kelly 2005, 2010, for example). Kelly (2010) presents\nthe objection roughly like this: if higher-order evidence requires us\nto ignore our first-order evidence, he asks, doesn’t that make\nrationality far too easy to come by? It appears that someone could\nbotch their first-order reasoning completely, adjust their confidence\nin the face of higher-order evidence, and (since they are now\nobligated to ignore the first-order considerations) have all of their\nearlier rational mistakes forgiven. Christensen (2011) disagrees,\narguing that while someone in this situation may have responded to\npart of her evidence correctly, we can still distinguish\nbetween her final belief state and the belief state of someone who\ndidn’t make the initial mistake: someone who did every step\nproperly is more rational than someone who did not. (See Sliwa &\nHorowitz 2015 for further discussion; see Schoenfield 2015a for an\nobjection.)\n\nIf Independence is right, there are remaining questions about exactly\nwhat needs to be set aside—evidence? Reasoning? Something\nelse?—and under what circumstances. As several authors have\nbrought out, it is not quite right to simply say that our assessment\nmust be independent of our first-order reasoning; often, facts\nabout that reasoning, sometimes involving very specific aspects\nof our evidence, are highly relevant and it would be irrational to\nignore them. (See Arsenault & Irving 2012, Kelly 2013, and Lord\n2014 for versions of this objection; see Christensen 2018 and 2019 for\nreplies.) It is also not quite right to say that our assessment must\nbe independent of our first-order evidence; often, a single piece of\nevidence has several different effects, some of which should be set\naside and others of which should be taken into account. See\nChristensen 2019 for detailed discussion of these complexities and\nothers.\n\nA different sort of question concerns how much evidence,\ninformation, or background beliefs we must set aside, and whether\nthere are any limits on this. Intuitively, the scope of what we must\nset aside depends on the scope of higher-order undermining we receive,\nand which instances or types of reasoning are called into question.\nBut how far can it go? What if everything is called into\nquestion? Considering this possibility leads to paradox. On the one\nhand, reason to universally doubt our reasoning seems to justify\nskepticism across the board. On the other hand, the way we would\narrive at that skeptical state would be by using our reasoning…\nwhich has been, by hypothesis, called into question. Some\nepistemologists have suggested that since there is no stable and\nconsistent response to such cases, we ought to conclude that universal\ndefeat is impossible. But this response is hard to reconcile with the\nfact that defeat comes on a spectrum; if the extreme cases are\nimpossible, what about the intermediate cases? (For further\ndiscussion, see Egan & Elga 2005, Enoch 2010, Sliwa & Horowitz\n2015, Schoenfield 2015a, Christensen 2010a, 2019. See also the entry\non\n epistemic self-doubt\n for further discussion.)\n\nEven if we restrict our attention to more moderate cases of\nundermining, one still might wonder whether rationality can ask us to\ndoubt so much that we end up skeptics about large and important\ndomains (even if we are not skeptics across the board). Could it be\nrational for us to come to doubt, for example, all of our moral or\nreligious beliefs on the basis of higher-order undermining? Elga\n(2007) argues (again in the context of peer disagreement) that we\nshould not worry about this possibility. In order to doubt all of our\nmoral beliefs, for example, we must have independent grounds to judge\nthese beliefs to be unreliable. But if we set aside all of our moral\nbeliefs, Elga argues, we won’t have enough left over to make any\nsort of reliability judgment—and therefore, won’t have\nrational grounds for doubt. So undermining can only happen locally.\n(And even then, he argues, many of our religious and moral beliefs\nwill be safe, since on any particular occasion, the targeted religious\nor moral belief will be supported by our other moral and religious\nbeliefs—the ones that aren’t called into question.) See\nVavova 2018 and Christensen 2011 for further discussion of this point.\nVavova and Christensen both differentiate between two possible ways to\nformulate Independence: one on which you must revise your beliefs\ninsofar as you fail to have good independent reason to\ntrust them, and one on which you must revise insofar as you\nhave good independent reason to think that you’re\nmistaken. They argue that the first formulation has skeptical\nresults, while the second avoids them.\n3.2 Level-bridging principles\n\nWhile Independence principles tell us what to set aside,\nlevel-bridging principles specify how our first-order beliefs should\ncohere with our higher-order beliefs. (As mentioned above, however,\nthese principles aren’t always presented separately.\nLevel-bridging principles also often include some element of\nIndependence, or are meant to apply alongside an Independence\nprinciple.)\n\nSome epistemologists argue that our first-order beliefs should line up\nsomehow with our beliefs about rationality. (See Smithies\n2019 and Titelbaum 2015, 2019, for example.) Others argue that our\nfirst-order beliefs should line up somehow with our beliefs about\nreliability. And still others incorporate elements of both.\nSome literature discusses both notions together and other literature\ndistinguishes explicitly between the two. (See Christensen 2016b,\nSliwa & Horowitz 2015, and Schoenfield 2015a for a few examples of\nmore explicit discussions. See also Dorst [forthcoming] for a\ncomprehensive overview of some of the principles proposed in the\nliterature and the relationship between them, and the entry on\n epistemic self-doubt\n for discussion of some other level-bridging principles in greater\ndetail.)\n\nI will highlight the choice by first describing an intuitively\nplausible level-bridging principle that focuses on rationality, and a\nproblem case for this principle which has motivated some\nepistemologists to move towards reliability instead. Although the\nsecond principle, too, has come under criticism, the case is a useful\nillustration of some of the complications that arise in this\nchoice.\n3.2.1 Rationality-focused principles\n\nThe general thought behind rationality-focused level-bridging\nprinciples is that your beliefs about the world should line up with\nyour beliefs about what’s rational for you to believe. If you\nthink it’s rational to believe P (or, if it’s\nrational for you to think that’s rational…) you should\nbelieve P. If you think it’s rational to believe\n~P, you should believe ~P. This line of thought\ninvolves deferring to rationality as you would defer to an expert.\n\nWhat if you’re uncertain about what’s rational? Arguably,\nthis is Aisha’s situation: she’s unsure whether her\nevidence rationally supports G, as she initially thought it\ndid, or whether hypoxia has confused her and her evidence\ndoesn’t support G after all. One initially plausible\nresponse to this sort of situation is to say that when we’re\nuncertain, our beliefs should reflect a kind of weighted average of\nthe responses we take to be possibly rational. This yields the result\nthat if we’re about equally confident that we should believe\nP and that we should believe ~P, the thing to do is\nto suspend judgment.\n\nThe principle Rational Reflection makes this thought more precise in a\ndegreed-belief, or “credence” setting. (Christensen\n[2010b] introduces and discusses the principle at length. Salow [2018]\nand Skipper [2021] are proponents of the principle. Elga [2013] and\nDorst [2020] amend it, as we’ll see later.) Roughly, according\nto Rational Reflection, one’s credences (“Cr” in the\nformulation below) should align with those that one regards as\nrational (“Pr”):\n\n\nRational Reflection: \\(\\Cr(A\\mid \\Pr(A) = n) =\nn\\)\n\n\nIf this principle were a true rational requirement, then rational\nagents in situations like Aisha’s would end up with a strong\ncoherence between their first-order beliefs and their beliefs about\nwhat is rational. Rational Reflection says, for instance, that it\ncannot be rational for Aisha to be rationally certain that it\nis rational to have .9 confidence in G, without also\nhaving .9 confidence in G. And it cannot be rational for\nAisha to be uncertain, without also adopting a weighted average of the\ncredences that she regards as possibly rational (weighted by her\ncredence, in each, that it is rational). In the version of the case\ndiscussed in the introduction, one might interpret Aisha’s\nhigher-order evidence as indicating that her high confidence in\nG is only 50% likely to be rational, given her first-order\nevidence. If it is 50% likely that high confidence is rational, and\n50% likely that low confidence is rational, Aisha should plausibly\nadopt the weighted average of these possibilities and arrive at a\nmiddling level of credence. Rational Reflection supports this\nexplanation of the story.\n\nHowever, Rational Reflection has counterintuitive consequences in some\ncases, such as the “Unmarked Clock” case, introduced in\nWilliamson (2014). Here is that case (based on the presentation in\nChristensen 2010b; see also Elga 2013; see Horowitz 2014 for a similar\ncase, discussed in connection with epistemic akrasia, and see also\nSliwa & Horowitz 2015 for a non-perceptual case with similar\nfeatures):\n\n\nThe Unmarked Clock: Chloe is looking at an unmarked\nclock with just a minute hand, which jumps discretely between its\npositions. The hand is pointing somewhere around where the 4 would be,\nif it were marked, which of course it isn’t. Chloe is wondering:\nis the hand pointing to the 19? The 20? The 21? (call those\npropositions “P19”, “P20”, and\n“P21”).\n\n\nWilliamson, Christensen, and Elga (among others) all agree on the\nfollowing about this case:\n\n(1)\nChloe shouldn’t be certain of any of P19, P20, or P21.\n(2)\nChloe’s credence in whichever of these propositions is\nactually her evidence should be highest, and should taper off as\npossibilities become more remote. (In other words, if the hand is\nreally at 20 minutes after the hour, she should have highest credence\nin P20, a bit lower credence in P19 and P21, and lower credence still\nin P18 and P22.)\n\n\nAnd finally,\n\n(3)\nChloe can figure out all of these facts about her epistemic\nsituation simply by thinking about the setup of the case, as we just\nhave.\n\n\nThe problem is that (1), (2), and (3) together entail that Chloe\nshould violate Rational Reflection.\n\nHere is why: suppose the hand is at 20 minutes after the hour, and\nChloe’s credence is in fact distributed as it should be, with\nP20 receiving the highest value. Since Chloe is rational, then by\n (2)\n above, she should also give significant credence to P19 and P21. Now\nconsider the implications for what Chloe thinks her credence\nshould be. In P20, Chloe’s current credence is\nrational. But in P19 and P21 (which we have just said she gives\nsignificant credence to), her current credence in P20 is too high. So\nshe is in a position to conclude the following about her credence in\nP20: it’s definitely not too low, but it may well be too high.\nThis unbalanced state violates Rational Reflection, and also looks\nlike an instance of epistemic akrasia.\n\nAdam Elga (2013) argues that this sort of situation motivates a\ndifferent principle, which he calls “New Rational\nReflection” (following Ned Hall’s “New Principal\nPrinciple”, and the argument in favor of it; see Hall 1994).\nElga argues that just as we should not in general defer (directly) to\nexperts when we know more than they do, we should not in general defer\nto rationality in cases where it is rational to doubt one’s\nrationality. If we use “Cr” for an agent’s credence,\nand “Pr” for a candidate ideally rational credence, we can\nexpress Elga’s principle as follows:\n\n\nNew Rational Reflection: \\(\\Cr(A\\mid \\textrm{Pr is\nideal}) = \\Pr(A\\mid \\textrm{Pr is ideal})\\)\n\n\nBoth Rational Reflection and New Rational Reflection have us defer to\nrationality as we would defer to an expert. But whereas Rational\nReflection has us defer to rationality as an expert with exactly\nour evidence, New Rational Reflection has us defer to rationality\nas an expert who has our evidence and is certain that it is an\nexpert. Elga argues that this is the right way to defer to\nexperts more generally, making New Rational Reflection (on his view)\nsimply a more carefully-formulated expert deference principle. (See\nPettigrew & Titelbaum 2014 for a concurrent view.)\n\nIn the clock case, New Rational Reflection also allows for epistemic\nakrasia: Chloe’s beliefs about the clock come apart from her\nestimate of what’s rational for her to believe about the clock.\nBut New Rational Reflection offers us an explanation for why this is\nunproblematic. In normal cases, what’s rational is a\ngood guide to what’s true: if it’s rational to\nbelieve it will rain, it’s also likely to be true that it will\nrain. But in the clock case, this generality doesn’t hold. We\ncan predict that rationality and truth will come apart. So when\nChloe’s belief matches her best estimate of what’s true,\nit will diverge from her best estimate of what’s rational.\nFurthermore, this divergence comes about because of uncertainty about\nwhat’s rational. So by eliminating that uncertainty—by\ndeferring to rationality only on the condition that rationality is not\nuncertain about its own expertise—New Rational Reflection aims\nto eliminate that gap between rationality and truth. (See Elga 2013,\nas well as Horowitz 2014, for further discussion of this feature of\nthe case.)\n\nSeveral authors agree with this line of thought, accepting both the\nsetup of the clock case and Elga’s general line of thought\nregarding how it should be treated. These authors take the clock case\nto be one in which epistemic akrasia is rationally permissible after\nall, showing that any anti-akrasia norms must be formulated carefully.\nFor similar discussion, see Horowitz’s (2014) discussion of the\ndartboard case (which is modeled after the unmarked clock). There,\nHorowitz argues that epistemic akrasia is rationally permissible when\nwe expect the evidence to be “falsity-guiding”; though see\nWeatherson (2019: ch. 10), and Hawthorne, Isaacs, and Lasonen-Aarnio\n(2021) for arguments that this condition is too narrow. Sliwa and\nHorowitz (2015) present an alternative level-bridging principle,\n“Evidential Calibration”, and argue that, like New\nRational Reflection, it can help differentiate between rational and\nirrational cases of epistemic akrasia, as well as rule out\nbootstrapping. Christensen (2016a) proposes what he calls the\n“Idealized Thermometer Model”, and makes similar points in\nits favor. Dorst (2020; see also his 2019) proposes another principle,\n“Trust”, which is a weakening of Rational Reflection.\nDorst argues that Trust allows us to be uncertain about rationality,\nwhile still treating rationality as an expert; this vindicates the\nidea that we should defer to our evidence, and (following I. J. Good)\nthat more evidence is always epistemically beneficial. All of these\nlevel-bridging principles take higher-order evidence into account, but\nalso allow some instances of epistemic akrasia.\n\nIf we agree with this line of thought, we might draw two lessons.\nFirst: treating rationality as an expert is a complicated job, and any\nrational expert deference principle must be formulated carefully. If\nwe can predict that rationality and truth will come apart, we should\nnot defer unrestrictedly to rationality. And relatedly, we might take\ncases like this to show that epistemic akrasia can be rational: it can\ncrop up even on some views according to which higher-order evidence is\nepistemically significant.\n\nSome epistemologists disagree with these lessons, and moreover, with\nthe entire setup of the clock case. One camp of detractors objects to\nclaims\n (1),\n (2), and\n (3)\n as set out above. These epistemologists argue that we cannot be\nrationally uncertain about what our evidence is (as Chloe is) or about\nwhat it supports. See, for example, Stalnaker (2009), Smithies (2019:\nch. 11), and Skipper (2021). Salow (2018) argues that the conception\nof evidence required to get the puzzle going can be used to allow\n“biased inquiry”. Cases like the unmarked clock thus\npresent a choice point for epistemologists who want to accommodate\nhigher-order defeat: accept that such cases are possible and reject\nRational Reflection, or reject such cases and adopt a strong\ntransparency requirement about evidence and rationality.\n\nOthers disagree from the opposite side: Maria Lasonen-Aarnio (2015)\nargues that even the modified principle, New Rational Reflection,\npresupposes too much self-knowledge. She advocates rejecting all\nlevel-bridging principles, at least as far as our theory of evidential\nsupport is concerned (though see\n section 4\n for discussion of her view on cases like Aisha’s).)\n\nFinally, Christensen (2021a) argues that New Rational Reflection\ndoesn’t go far enough. New Rational Reflection says we should\ndefer, to some extent, to any theory of rationality we think\nmight possibly be right. But what if we think it’s possible that\nrationality can come apart from the truth—as it does in the\nclock case, or even more broadly, as it does on views that allow moral\nencroachment? (On the extreme end, consider views on which rationality\nis about believing what makes you happy.) Surely we should not defer\nto them, even a little bit. (If one of them is right, of course, we\nshould follow it—but the present question is just about\nwhether we should treat different candidates for rationality as\nexperts.) So Christensen argues we should reject New Rational\nReflection, and focus on attaining beliefs we take to be\naccurate, rather than beliefs we take to be rational. This\nmay mean moving away entirely from rationality-focused level-bridging\nprinciples.\n3.2.2 Reliability-focused principles\n\nSo far we have focused on Rational Reflection and New Rational\nReflection, which are motivated by the thought that in accommodating\nhigher-order evidence, we should calibrate our first-order beliefs to\nour higher-order beliefs about rationality. Another way to\napproach the question begins with reliability. The thought\nhere is that higher-order evidence affects our first-order beliefs\nbecause of its bearing on our reliability—that is, our\npropensity to get to the truth, under the relevant\ncircumstances. Examples of this approach include Elga’s\n“Equal Weight View”, quoted above; Christensen\n(2007a)’s “Integration”; the “Calibration\nRule”, discussed by White (2009); Weatherson’s\n(ms—see Other Internet Resources) “Judgments Screen\nEvidence” (which he argues against); “Guess\nCalibration”, discussed in Sliwa and Horowitz 2015;\n“Calibration”, discussed in Schoenfield 2015a; and the\n“Simple Thermometer Model” discussed in Christensen 2016a.\nAs a representative example, here is White’s “Calibration\nRule”, which he presents as a consequence of the Equal Weight\nView:\n\n\nCalibration Rule: If I draw the conclusion p\non the basis of any evidence e, my credence in p\nshould equal my prior expected reliability with respect to\np.\n\n\nThere are various complications involved in interpreting this rule\n(for instance, it refers to “drawing a conclusion”, which\nis an all-or-nothing judgment, as well as credences). But notice that,\nunlike Rational Reflection, the Calibration Rule makes no reference to\nrationality. (It does specify that the conclusion is drawn on\nthe basis of some evidence, but as White points out in his discussion\nof the rule, the evidence plays no part in determining what we should\nbelieve.)\n\nReliability-based level-bridging principles must also be formulated\ncarefully in order to navigate worries in the vicinity of the\ngenerality problem. (Among other things, one’s reliability\nestimate on a particular occasion must take base rates into account;\nsee Isaacs 2021.) But just as we saw before, such principles are\nalways put forth in conjunction with—or incorporate some element\nof—Independence principles. If we can answer the question of how\nto circumscribe Independence, presumably that will answer the\ngenerality problem in this domain as well.\n\nFocusing on reliability, rather than rationality, has advantages and\ndisadvantages. An important advantage is that this approach allows us\nto accommodate cases like the unmarked clock, discussed in the\nprevious section. But the disadvantage is that reliability-based\nlevel-bridging principles do not answer certain questions which, for\nmany epistemologists, lie at the heart of the higher-order evidence\ndebate: can epistemic akrasia be rational? And should we in some sense\ntreat rationality as an expert to which we should defer? If our\nlevel-bridging principle does not mention rationality, it will not\nhave immediate consequences for these questions, which may seem\nunsatisfying to some.\n\nDistinguishing between rationality-focused and reliability-focused\nlevel-bridging principles highlights another choice point for\nepistemologists. Some take questions about akrasia to be central, and\ndefend rationality-based level-bridging principles for that reason\n(Smithies 2019 is a paradigmatic example; see also Neta 2019).\nOthers—even those who support level-bridging—take cases\nlike the unmarked clock to show that these questions aren’t so\ncentral after all, and that perhaps epistemic akrasia is not so\nsignificant (Christensen 2016a and 2021a are paradigmatic examples of\nthis approach). A third strategy is to say that anti-akrasia, or\nlevel-coherence principles, have a special sort of normative status\nthat differs from other rational requirements. Some of the proposals\ndiscussed in the next section defend this view.\n4. Dilemmas and Two-Norm Views\n\nWe began by discussing a puzzle raised by higher-order evidence: it\nseems that agents in situations like Hypoxia should reduce confidence,\nbut also that if they do, they will be ignoring evidence in a\nproblematic way. We have seen some arguments against reducing\nconfidence, and some proposals for how Aisha should reduce\nconfidence. But some epistemologists think that neither of these\npossibilities gives us the full story. Maybe level-bridging principles\nare genuine rational requirements, but there is still\nsomething wrong with Aisha if she reduces confidence. Or maybe they\nare not genuine rational requirements, yet there is something\nelse wrong with Aisha if she does not reduce\nconfidence. Maybe they are both rational requirements, and Aisha is\nfacing an epistemic dilemma. (An alternative way to frame the puzzle\nfocuses on epistemic akrasia: maybe Aisha is rationally required to be\nepistemically akratic in her situation, but there is something else\nwrong with her if she is epistemically akratic, and so forth.)\n\nThis section discusses two strategies which acknowledge the remaining\npuzzle and attempt to solve it. One, defended most prominently by\nDavid Christensen, holds that higher-order evidence gives rise to\nepistemic dilemmas, where there is no fully rational response\navailable (though there may be a rationally best response). So Aisha\nis both required to believe G and to doubt G, and\nshe is just unfortunately unable to do both. Another family of\nresponses, here called “two-norm views”, aim to separate\ndifferent modes of epistemic evaluation, and argue that Aisha’s\nconflicting requirements somehow issue from different normative\nrealms. The common goal of all these strategies is to explain the\napparent conflict of norms in cases like Hypoxia, without denying the\nlegitimacy of any of these conflicting norms.\n4.1 Dilemmas\n\nChristensen takes the puzzles surrounding higher-order evidence to\nshow that the requirements of rationality sometimes conflict with one\nanother, putting agents like Aisha in an epistemic bind. This proposal\ndiffers from the two-norm views discussed below, in that there is just\none notion of epistemic rationality at work. According to the dilemma\nview, in some circumstances, it is impossible to satisfy all the\nrational requirements at once.(see Christensen 2007a, 2010a, 2013,\n2016b, and 2021c). In his more recent work (see Christensen 2021c),\nChristensen sees the norms in conflict, in Aisha’s case, as one\nrequiring us to believe what our evidence entails, and another\nrequiring us to revise in light of higher-order evidence. (An\nalternative possibility, which Christensen suggests in earlier work\n[see his 2013], is that the second norm is explicitly an anti-akratic\nnorm.)\n\nAn important feature of Christensen’s view is that, although\nAisha is subject to conflicting requirements, there is still a\nbest epistemic response in her situation. (Christensen holds\nthat the best response is to reduce confidence.) This raises a\nquestion: what determines which response is best? See Leonard 2020 for\narguments against the dilemma view; Leonard defends a nearby view\naccording to which there are conflicting norms, but it’s\nindeterminate (among a restricted set of possibilities) what\nAisha should believe. Knoks (2021) defends a view along similar lines,\narguing that Aisha’s situation is permissive (again, among a\nsimilarly-restricted set of possibilities). The possibility of\ndilemmas in epistemology raises several questions: how can epistemic\nrequirements relate (or not) to notions of epistemic blame, and how\ncan they guide our beliefs? See Hughes 2019 and 2021, e.g., for\nfurther discussion of these issues (though mostly focused on a\ndifferent putative source of conflicting requirements); Hughes defends\nthe position that we should accept epistemic dilemmas.\n4.2 Ideal vs. non-ideal modes of evaluation\n\nA few authors have suggested that while higher-order evidence has\ngenuine normative significance, this significance belongs only to some\nnon-ideal normative realm. So while a rationally ideal\nagent’s higher-order evidence would have no effect on her\nfirst-order beliefs, a non-ideal agent’s evidence should have\nsuch an effect—precisely because she is non-ideal.\n\nJoshua DiPaolo (2019) develops one version of this view. Drawing on\nwork in political philosophy, he argues that we need an\nepistemological “theory of the second best”. On his\nproposed view, the norms that apply to ideal agents are different from\nthe norms that apply to non-ideal agents. While the ideal norms define\na standard of perfection for all of us, non-ideal norms tell us how to\napproach that standard, taking our imperfections into account. DiPaolo\nargues that this approach allows us to resolve the apparent tensions\ninvolved in accommodating higher-order evidence: ideal rationality\nrequires ignoring higher-order evidence, but non-ideal rationality\nrequires respecting it.\n\nWhile non-ideal agents are limited in their reasoning abilities, they\nare also limited in their abilities to double-check and\n“police” themselves. Appealing to this consideration,\nJoshua Schechter (2013) makes a suggestion that cuts in the opposite\ndirection from DiPaolo’s: he argues that perhaps our epistemic\nimperfections cap our responsibility to respond to higher-order\nevidence. This means that while our available evidence may call for\nextensive belief revision—and while a more ideal agent\nwould revise her beliefs in response to higher-order\nevidence—non-ideal believers like us are permitted to stop when\nwe’ve done what we can.\n\nDeclan Smithies (2019) also defends a view on which the\nideal/non-ideal distinction comes into play. This is discussed in more\ndetail below.\n4.3 Best plans to follow vs. best plans to make\n\nAnother kind of two-norm view comes from Miriam Schoenfield (see her\n2015b and 2018). Schoenfield interprets judgments about rationality,\nin cases like Aisha’s, as plans. She points out that we\ncan evaluate plans in (at least) two different ways: by looking at\nwhat will happen if they are followed perfectly, and by looking at\nwhat will happen if they are made. If you need to leave the house at\n10:30, but are habitually running late, “leave the house at\n10” might be the best plan to make, even if “leave the\nhouse at 10:30” is the best plan to follow. This is similar to\nDiPaolo’s suggestion in that the difference between the best\nplan to make and the best plan to follow depends on a person’s\n(predicted) rational shortcomings: the best plan to make is one that\ntakes these shortcomings into account in a particular way. However,\nSchoenfield’s view is not that higher-order evidence\nonly has rational import for non-ideal agents; rather, it has the\nimport it has for anyone who rationally believes that they\nare non-ideal.\n\nAn advantage of this approach is that it allows us to focus on\naccuracy as the primary target of epistemic rationality. Schoenfield\nframes both modes of evaluation in terms of accuracy: specifically,\nthe accuracy-related consequences of the plan. So if she is\nright that the best-plan-to-make/best-plan-to-follow distinction can\nexplain higher-order evidence, we would end up with a relatively\nuniform two-norm view. See Horowitz 2019 for two objections: first,\nthat focusing on consequences seems to open the door to non-epistemic\nplans, such as “have a sandwich before reasoning”; second,\nthat the best plan to make might differ among different believers, in\nwhich case this strategy would not yield anything like a general\ndefense of revising in response to higher-order evidence. This second\nworry also raises questions about DiPaolo’s proposal and how\nuniversal we can expect a non-ideal rationality to be.\n4.4 Reasons vs. rationality\n\nAlex Worsnip (2018) argues that we can explain the oddness of\nhigher-order evidence by distinguishing between two kinds of epistemic\nrequirements: evidence responsiveness and coherence.\nIf Aisha maintains her belief that G, and believes\nthat her evidence may well not support this belief, she will believe\neverything her evidence supports. If she revises her belief that she\nhas enough fuel (aligning it with her estimate of what the evidence\nsupports) she will be coherent. This view is one that explicitly\nappeals to epistemic akrasia, as Worsnip’s coherence norms are\neffectively anti-akrasia norms.\n4.5 Evidence vs. dispositions\n\nMaria Lasonen-Aarnio (2020) argues that the conflict comes from two\ndifferent modes of evaluation which we can apply to Aisha’s\ncase. In addition to evaluating whether believers have correctly\nfollowed the epistemic requirements that apply to them, or have\ncorrectly accommodated their evidence, we can also evaluate their\nbelief-forming dispositions. If Aisha holds onto her belief about\nG, while recognizing the danger of hypoxia in her own case,\nshe is responding appropriately to her evidence and is (if her belief\nis formed in the right way) following the requirements that apply to\nher. But she is also manifesting a disposition that is unlikely to\nserve her well in the long term: ignoring what appears to be\na conclusive reason for belief (her belief that she’s likely to\nbe hypoxic, and therefore likely to be responding inappropriately to\nher evidence) will often involve actual conclusive reasons\nfor belief. We can criticize Aisha for manifesting this disposition,\neven if this particular case is not one of the situations in which it\ngoes wrong. (A relevant comparison here is Rule versus Act\nUtilitarianism: a good rule might occasionally lead to imperfect\noutcomes, whereas a good outcome might occasionally be the result of a\nbad rule. See Coates [2012] for a similar suggestion about rules in\nthis context.)\n\nSmithies (2019) defends a similar view, discussed in more detail in\nthe next subsection.\n4.5 Propositional justification vs. doxastic justification\n\nFinally, Paul Silva (2017) and Declan Smithies (2019) each\nargue—though in different ways—that we can resolve the\nconflict by distinguishing between propositional and doxastic\njustification. (Also see Ye 2020 for objections to the move to\ndoxastic justification in this context.) Let us consider Silva’s\nproposal first. An agent like Aisha, he argues, is\npropositionally justified in believing G, and in\nbelieving that her evidence may well not support G. But she\ncannot come to rationally hold the belief that G: in\nother words, she cannot be doxastically justified in\nbelieving G. Silva’s argument for this claim is in part\nan inference to the best explanation: although Aisha’s evidence\nsupports G, it seems irrational for Aisha to act on that\nbelief, suggesting that Aisha lacks knowledge of G. If\nAisha’s belief is propositionally justified but not known, this\nin turn suggests that the belief is not doxastically justified. (See\nalso van Wietmarschen 2013 for a similar proposal in the case of peer\ndisagreement. Van Wietmarschen’s argument does not appeal to\nknowledge; rather, he argues directly that an agent’s belief is\nnot well-grounded, or doxastically justified, if her basis for holding\nit does not respond to her higher-order evidence.)\n\nSmithies (2019) invokes this distinction to a slightly different end.\nAs mentioned above, he argues that we can never be propositionally\njustified in believing falsehoods about what our evidence\nsupports—so, Aisha is propositionally justified in believing\nG, and propositionally justified in believing that\nher evidence supports this. But assuming that Aisha is a normal,\nnon-ideal believer, her own doxastic dispositions won’t be\nsensitive enough to the evidence to safely track her propositional\njustification. This means that she can’t be doxastically\njustified in believing that her evidence supports G.\nInterestingly, Smithies argues that in this case a non-ideal agent\nlike Aisha should be epistemically akratic; the ideal,\nnon-akratic state isn’t available to her, and an akratic state\nis, he argues, the best she can do.\n5. Conclusion\n\nWe began by noting that higher-order evidence gives rise to a puzzle.\nIt seems that “higher-order evidence”—information\nabout our own irrationality or unreliability—should prompt us to\nrevise our beliefs about the world, but if we do so, we must ignore\nevidence and reasoning that is directly relevant to the truth of those\nbeliefs. Much of the literature on higher-order evidence revolves\naround this puzzle: arguing that we should reject one side of the\npuzzle or the other, or finding ways to hold onto both.\n\nAs of this writing, two related questions emerge as central to the\ndebate going forward. First: is higher-order evidence significant\nbecause it gives us information about our own rationality? Or\nbecause it gives us information about our own reliability?\nAnd second: are there genuine norms prohibiting epistemic akrasia?\n(So, should our beliefs about what’s rational line up\nwith our beliefs about the world?) Or does the appearance of these\nnorms merely arise because of nearby norms regarding\nreliability—or, perhaps, because there are multiple, conflicting\nmodes of epistemic normativity? Untangling the puzzles surrounding\nhigher-order evidence will ultimately involve answering these\nquestions as well, as well as broader questions about the relationship\nbetween rationality and truth.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alexander, David, 2013, “The Problem of Respecting\nHigher-Order Doubt”, <em>Philosopher’s Imprint</em>,\n13(September): article 18 (12 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0013.018\" target=\"other\">Alexander 2013 available online</a>]",
                "Arsenault, Michael and Zachary C. Irving, 2012, “Aha! Trick\nQuestions, Independence, and the Epistemology of Disagreement: Trick\nQuestions, Independence, and the Epistemology”, <em>Thought: A\nJournal of Philosophy</em>, 1(3): 185–194.\ndoi:10.1002/tht3.27",
                "Barnett, Zach, 2019, “Philosophy Without Belief”,\n<em>Mind</em>, 128(509): 109–138. doi:10.1093/mind/fzw076",
                "Bradley, Darren, 2019, “Are There Indefeasible Epistemic\nRules?”, <em>Philosopher’s Imprint</em>, 19: article 3 (19\npages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.003\" target=\"other\">Bradley 2019 available online</a>]",
                "Brown, Jessica, 2018, <em>Fallibilism: Evidence and\nKnowledge</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198801771.001.0001",
                "Christensen, David, 2007a, “Does Murphy’s Law Apply in\nEpistemology?”, in <em>Oxford Studies in Epistemology, Volume\n2</em>, Tamar Szabó Gendler and John Hawthorne (eds.),\nOxford/New York: Oxford University Press, 3–31.",
                "–––, 2007b, “Epistemology of Disagreement:\nThe Good News”, <em>The Philosophical Review</em>, 116(2):\n187–217. doi:10.1215/00318108-2006-035",
                "–––, 2010a, “Higher-Order Evidence”,\n<em>Philosophy and Phenomenological Research</em>, 81(1):\n185–215. doi:10.1111/j.1933-1592.2010.00366.x",
                "–––, 2010b, “Rational Reflection”,\n<em>Philosophical Perspectives</em>, 24(1): 121–140.\ndoi:10.1111/j.1520-8583.2010.00187.x",
                "–––, 2011, “Disagreement,\nQuestion-Begging, and Epistemic Self-Criticism”,\n<em>Philosopher’s Imprint</em>, 11(March): article 6 (22 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0011.006\" target=\"other\">Christensen 2011 available online</a>]",
                "–––, 2013, “Epistemic Modesty\nDefended”, in Christensen and Lackey 2013: 77–97.\ndoi:10.1093/acprof:oso/9780199698370.003.0005",
                "–––, 2016a, “Disagreement, Drugs, Etc.:\nFrom Accuracy to Akrasia”, <em>Episteme</em>, 13(4):\n397–422. doi:10.1017/epi.2016.20",
                "–––, 2016b, “Conciliation, Uniqueness and\nRational Toxicity”, <em>Noûs</em>, 50(3): 584–603.\ndoi:10.1111/nous.12077",
                "–––, 2018, “On Acting as Judge in\nOne’s Own (Epistemic) Case”, <em>Proceedings and Addresses\nof the American Philosophical Association</em>, 93(1):\n207–235.",
                "–––, 2019, “Formulating\nIndependence”, in Skipper and Steglich-Petersen 2019:\n13–34. doi:10.1093/oso/9780198829775.003.0001",
                "–––, 2021a, “Akratic (Epistemic)\nModesty”, <em>Philosophical Studies</em>, 178(7):\n2191–2214. doi:10.1007/s11098-020-01536-6",
                "–––, 2021b, “Rationality for the\nSelf-Aware”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 95(1): 213–236.",
                "–––, 2021c, “Embracing Epistemic\nDilemmas”, in McCain, Stapleford, and Steup 2021: chap. 10.",
                "Christensen, David and Jennifer Lackey (eds.), 2013, <em>The\nEpistemology of Disagreement: New Essays</em>, Oxford: Oxford\nUniversity Press.",
                "Coates, Allen, 2012, “Rational Epistemic Akrasia”,\n<em>American Philosophical Quarterly</em>, 49(2): 113–124.",
                "DiPaolo, Joshua, 2018, “Higher-Order Defeat Is\nObject-Independent”, <em>Pacific Philosophical Quarterly</em>,\n99(2): 248–269. doi:10.1111/papq.12155",
                "–––, 2019, “Second Best Epistemology:\nFallibility and Normativity”, <em>Philosophical Studies</em>,\n176(8): 2043–2066. doi:10.1007/s11098-018-1110-y",
                "Dorst, Kevin, 2019, “Higher-Order Uncertainty”, in\nSkipper and Steglich-Petersen 2019: 35–61.\ndoi:10.1093/oso/9780198829775.003.0002",
                "–––, 2020, “Evidence: A Guide for the\nUncertain”, <em>Philosophy and Phenomenological Research</em>,\n100(3): 586–632. doi:10.1111/phpr.12561",
                "–––, forthcoming, “Higher-Order\nEvidence”, in <em>The Routledge Handbook for the Philosophy of\nEvidence</em>, Maria Lasonen-Aarnio and Clayton Littlejohn (eds),\nRoutledge.<!-- suppose to 2022 or 2023-->",
                "Egan, Andy and Adam Elga, 2005, “I Can’t Believe\nI’m Stupid”, <em>Philosophical Perspectives</em>, 19(1):\n77–93. doi:10.1111/j.1520-8583.2005.00054.x",
                "Elga, Adam, 2007, “Reflection and Disagreement”,\n<em>Noûs</em>, 41(3): 478–502.\ndoi:10.1111/j.1468-0068.2007.00656.x",
                "–––, 2010, “How to Disagree about How to\nDisagree”, in Feldman and Warfield 2010: 175–186.\ndoi:10.1093/acprof:oso/9780199226078.003.0008",
                "–––, 2013, “The Puzzle of the Unmarked\nClock and the New Rational Reflection Principle”,\n<em>Philosophical Studies</em>, 164(1): 127–139.\ndoi:10.1007/s11098-013-0091-0",
                "Enoch, David, 2010, “Not Just a Truthometer: Taking Oneself\nSeriously (but Not Too Seriously) in Cases of Peer\nDisagreement”, <em>Mind</em>, 119(476): 953–997.\ndoi:10.1093/mind/fzq070",
                "Feldman, Richard, 2005, “Respecting the Evidence”,\n<em>Philosophical Perspectives</em>, 19(1): 95–119.\ndoi:10.1111/j.1520-8583.2005.00055.x",
                "–––, 2006, “Reasonable Religious\nDisagreements”, in <em>Philosophers Without Gods: Meditations on\nAtheism and the Secular Life</em>, Louise Antony (ed.), Oxford/New\nYork: Oxford University Press, 194–214.",
                "Feldman, Richard and Ted A. Warfield (eds.), 2010,\n<em>Disagreement</em>, Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199226078.001.0001",
                "Field, Claire, 2019, “It’s Ok to Make Mistakes:\nAgainst the Fixed Point Thesis”, <em>Episteme</em>, 16(2):\n175–185. doi:10.1017/epi.2017.33",
                "Field, Hartry, 2000, “Apriority as an Evaluative\nNotion”, in <em>New Essays on the A Priori</em>, Paul Boghossian\nand Christopher Peacocke (eds.), Oxford/New York: Oxford University\nPress, 117–149. doi:10.1093/0199241279.003.0006",
                "Fleisher, Will, 2021, “How to Endorse\nConciliationism”, <em>Synthese</em>, 198(10): 9913–9939.\ndoi:10.1007/s11229-020-02695-z",
                "Goldberg, Sanford, 2013, “Defending Philosophy in the Face\nof Systematic Disagreement”, in <em>Disagreement and\nSkepticism</em>, Diego E. Machuca (ed.), New York: Routledge,\n277–294.",
                "Hall, Ned, 1994, “Correcting The Guide to Objective\nChance”, <em>Mind</em>, 103(412): 505–518.\ndoi:10.1093/mind/103.412.505",
                "Hawthorne, John, Yoaav Isaacs, and Maria Lasonen‐Aarnio,\n2021, “The Rationality of Epistemic Akrasia”,\n<em>Philosophical Perspectives</em>, 35(1): 206–228.\ndoi:10.1111/phpe.12144",
                "Hedden, Brian and Kevin Dorst, forthcoming, “(Almost) All\nEvidence is Higher-Order Evidence”, <em>Analysis</em>, early\nonline: 8 May 2022. doi:10.1093/analys/anab081",
                "Henderson, Leah, forthcoming, “Higher‐order Evidence\nand Losing One’s Conviction”, <em>Noûs</em>, early\nonline: 3 May 2021. doi:10.1111/nous.12367",
                "Horowitz, Sophie, 2014, “Epistemic Akrasia”,\n<em>Noûs</em>, 48(4): 718–744. doi:10.1111/nous.12026",
                "–––, 2019, “Predictably Misleading\nEvidence”, in Skipper and Steglich-Petersen 2019: 105–123.\ndoi:10.1093/oso/9780198829775.003.0005",
                "Hughes, Nick, 2019, “Dilemmic Epistemology”,\n<em>Synthese</em>, 196(10): 4059–4090.\ndoi:10.1007/s11229-017-1639-x",
                "–––, 2021, “Who’s Afraid of\nEpistemic Dilemmas?”, in McCain, Stapleford, and Steup 2021:\nchap. 15.",
                "Isaacs, Yoaav, 2021, “The Fallacy of Calibrationism”,\n<em>Philosophy and Phenomenological Research</em>, 102(2):\n247–260. doi:10.1111/phpr.12640",
                "Kelly, Thomas, 2005, “The Epistemic Significance of\nDisagreement”, in <em>Oxford Studies in Epistemology, Volume\n1</em>, Tamar Szabó Gendler and John Hawthorne (eds.),\nOxford/New York: Oxford University Press, 167–196.",
                "–––, 2010, “Peer Disagreement and\nHigher‐Order Evidence”, in Feldman and Warfield 2010:\n111–174. doi:10.1093/acprof:oso/9780199226078.003.0007",
                "–––, 2013, “Disagreement and the Burdens\nof Judgment”, in Christensen and Lackey 2013: 31–53.\ndoi:10.1093/acprof:oso/9780199698370.003.0003",
                "Knoks, Aleks, 2021, “Misleading Higher-Order Evidence,\nConflicting Ideals, and Defeasible Logic”, <em>Ergo an Open\nAccess Journal of Philosophy</em>, 8(6): 141–174.\ndoi:10.3998/ergo.1143",
                "Lasonen-Aarnio, Maria, 2014, “Higher-Order Evidence and the\nLimits of Defeat”, <em>Philosophy and Phenomenological\nResearch</em>, 88(2): 314–345. doi:10.1111/phpr.12090",
                "–––, 2015, “New Rational Reflection and\nInternalism about Rationality”, in <em>Oxford Studies in\nEpistemology, Volume 5</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford/New York: Oxford University Press,\n145–171. doi:10.1093/acprof:oso/9780198722762.003.0005",
                "–––, 2020, “Enkrasia or Evidentialism?\nLearning to Love Mismatch”, <em>Philosophical Studies</em>,\n177(3): 597–632. doi:10.1007/s11098-018-1196-2",
                "Leonard, Nick, 2020, “Epistemic Dilemmas and Rational\nIndeterminacy”, <em>Philosophical Studies</em>, 177(3):\n573–596. doi:10.1007/s11098-018-1195-3",
                "Lewis, David, 1971, “Immodest Inductive Methods”,\n<em>Philosophy of Science</em>, 38(1): 54–63.\ndoi:10.1086/288339",
                "Littlejohn, Clayton, 2018, “Stop Making Sense? On a Puzzle\nabout Rationality”, <em>Philosophy and Phenomenological\nResearch</em>, 96(2): 257–272. doi:10.1111/phpr.12271",
                "Lord, Errol, 2014, “From Independence to Conciliationism: An\nObituary”, <em>Australasian Journal of Philosophy</em>, 92(2):\n365–377. doi:10.1080/00048402.2013.829506",
                "McCain, Kevin, Scott Stapleford, and Matthias Steup (eds), 2021,\n<em>Epistemic Dilemmas: New Arguments, New Angles</em>, New York:\nRoutledge. doi:10.4324/9781003134565",
                "Neta, Ram, 2019, “The Puzzles of Easy Knowledge and of\nHigher-Order Evidence: A Unified Solution”, in Skipper and\nSteglich-Petersen 2019: 173–188.\ndoi:10.1093/oso/9780198829775.003.0008",
                "Pettigrew, Richard and Michael G. Titelbaum, 2014,\n“Deference Done Right”, <em>Philosopher’s\nImprint</em>, 14(December): article 35 (19 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.035\" target=\"other\">Pettigrew and Titelbaum 2014 available online</a>]",
                "Roush, Sherrilyn, 2009, “Second Guessing: A Self-Help\nManual”, <em>Episteme</em>, 6(3): 251–268.\ndoi:10.3366/E1742360009000690",
                "–––, 2017, “Epistemic Self-Doubt”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2017\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/epistemic-self-doubt/\" target=\"other\">https://plato.stanford.edu/archives/win2017/entries/epistemic-self-doubt/</a>&gt;.",
                "Salow, Bernhard, 2018, “The Externalist’s Guide to\nFishing for Compliments”, <em>Mind</em>, 127(507):\n691–728. doi:10.1093/mind/fzw029",
                "Schoenfield, Miriam, 2015a, “A Dilemma for\nCalibrationism”, <em>Philosophy and Phenomenological\nResearch</em>, 91(2): 425–455. doi:10.1111/phpr.12125",
                "–––, 2015b, “Bridging Rationality and\nAccuracy”:, <em>The Journal of Philosophy</em>, 112(12):\n633–657. doi:10.5840/jphil20151121242",
                "–––, 2018, “An Accuracy Based Approach to\nHigher Order Evidence”, <em>Philosophy and Phenomenological\nResearch</em>, 96(3): 690–715. doi:10.1111/phpr.12329",
                "Schechter, Joshua, 2013, “Rational Self-Doubt and the\nFailure of Closure”, <em>Philosophical Studies</em>, 163(2):\n429–452. doi:10.1007/s11098-011-9823-1",
                "Silva, Paul, 2017, “How Doxastic Justification Helps Us\nSolve the Puzzle of Misleading Higher-Order Evidence”,\n<em>Pacific Philosophical Quarterly</em>, 98(S1): 308–328.\ndoi:10.1111/papq.12173",
                "–––, 2018, “Explaining Enkratic\nAsymmetries: Knowledge-First Style”, <em>Philosophical\nStudies</em>, 175(11): 2907–2930.\ndoi:10.1007/s11098-017-0987-1",
                "Skipper, Mattias, 2021, “Does Rationality Demand\nHigher-Order Certainty?”, <em>Synthese</em>, 198(12):\n11561–11585. doi:10.1007/s11229-020-02814-w",
                "Skipper, Mattias and Asbjørn Steglich-Petersen (eds.),\n2019, <em>Higher-Order Evidence: New Essays</em>, Oxford/New York:\nOxford University Press. doi:10.1093/oso/9780198829775.001.0001",
                "Sliwa, Paulina and Sophie Horowitz, 2015, “Respecting All\nthe Evidence”, <em>Philosophical Studies</em>, 172(11):\n2835–2858. doi:10.1007/s11098-015-0446-9",
                "Smithies, Declan, 2019, <em>The Epistemic Role of\nConsciousness</em>, (Philosophy of Mind Series), New York, NY: Oxford\nUniversity Press. doi:10.1093/oso/9780199917662.001.0001",
                "Staffel, Julia, forthcoming, “Transitional Attitudes and the\nUnmooring View of Higher‐order Evidence”,\n<em>Noûs</em>, early online: 6 October 2021.\ndoi:10.1111/nous.12400",
                "Stalnaker, Robert C., 2009, “On Hawthorne and Magidor on\nAssertion, Context, and Epistemic Accessibility”, <em>Mind</em>,\n118(470): 399–409. doi:10.1093/mind/fzp061",
                "Steglich-Petersen, Asbjørn, 2019, “Higher-Order\nDefeat and Doxastic Resilience”, in Skipper and\nSteglich-Petersen 2019: 209–225.\ndoi:10.1093/oso/9780198829775.003.0010",
                "Tal, Eyal, 2021, “Is Higher-Order Evidence Evidence?”,\n<em>Philosophical Studies</em>, 178(10): 3157–3175.\ndoi:10.1007/s11098-020-01574-0",
                "Titelbaum, Michael G., 2015, “Rationality’s Fixed\nPoint (or: In Defense of Right Reason)”, in <em>Oxford Studies\nin Epistemology, Volume 5</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford/New York: Oxford University Press,\n253–294. doi:10.1093/acprof:oso/9780198722762.003.0009",
                "–––, 2019, “Return to Reason”, in\nSkipper and Steglich-Petersen 2019: 226–245.\ndoi:10.1093/oso/9780198829775.003.0011",
                "Vavova, Katia, 2018, “Irrelevant Influences”,\n<em>Philosophy and Phenomenological Research</em>, 96(1):\n134–152. doi:10.1111/phpr.12297",
                "Weatherson, Brian, 2013, “Disagreements, Philosophical, and\nOtherwise”, in Christensen and Lackey 2013: 54–73.\ndoi:10.1093/acprof:oso/9780199698370.003.0004",
                "–––, 2019, <em>Normative Externalism</em>,\nOxford: Oxford University Press.\ndoi:10.1093/oso/9780199696536.001.0001",
                "Wedgwood, Ralph, 2012, “Justified Inference”,\n<em>Synthese</em>, 189(2): 273–295.\ndoi:10.1007/s11229-011-0012-8",
                "White, Roger, 2010, “You Just Believe That\nBecause…”, <em>Philosophical Perspectives</em>, 24(1):\n573–615. doi:10.1111/j.1520-8583.2010.00204.x",
                "–––, 2009, “On Treating Oneself and Others\nas Thermometers”, <em>Episteme</em>, 6(3):\n233–250. doi:10.3366/e1742360009000689",
                "van Wietmarschen, Han, 2013, “Peer Disagreement, Evidence,\nand Well-Groundedness”, <em>The Philosophical Review</em>,\n122(3): 395–425. doi:10.1215/00318108-2087654",
                "Williamson, Timothy, 2014, “Very Improbable\nKnowing”, <em>Erkenntnis</em>, 79(5): 971–999.\ndoi:10.1007/s10670-013-9590-9",
                "Worsnip, Alex, 2018, “The Conflict of Evidence and\nCoherence”, <em>Philosophy and Phenomenological\nResearch</em>, 96(1): 3–44. doi:10.1111/phpr.12246",
                "Ye, Ru, 2020, “Higher-Order Defeat and Intellectual\nResponsibility”, <em>Synthese</em>, 197(12): 5435–5455.\ndoi:10.1007/s11229-018-01972-2"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alexander, David, 2013, “The Problem of Respecting\nHigher-Order Doubt”, <em>Philosopher’s Imprint</em>,\n13(September): article 18 (12 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0013.018\" target=\"other\">Alexander 2013 available online</a>]</li>\n<li>Arsenault, Michael and Zachary C. Irving, 2012, “Aha! Trick\nQuestions, Independence, and the Epistemology of Disagreement: Trick\nQuestions, Independence, and the Epistemology”, <em>Thought: A\nJournal of Philosophy</em>, 1(3): 185–194.\ndoi:10.1002/tht3.27</li>\n<li>Barnett, Zach, 2019, “Philosophy Without Belief”,\n<em>Mind</em>, 128(509): 109–138. doi:10.1093/mind/fzw076</li>\n<li>Bradley, Darren, 2019, “Are There Indefeasible Epistemic\nRules?”, <em>Philosopher’s Imprint</em>, 19: article 3 (19\npages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.003\" target=\"other\">Bradley 2019 available online</a>]</li>\n<li>Brown, Jessica, 2018, <em>Fallibilism: Evidence and\nKnowledge</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198801771.001.0001</li>\n<li>Christensen, David, 2007a, “Does Murphy’s Law Apply in\nEpistemology?”, in <em>Oxford Studies in Epistemology, Volume\n2</em>, Tamar Szabó Gendler and John Hawthorne (eds.),\nOxford/New York: Oxford University Press, 3–31.</li>\n<li>–––, 2007b, “Epistemology of Disagreement:\nThe Good News”, <em>The Philosophical Review</em>, 116(2):\n187–217. doi:10.1215/00318108-2006-035</li>\n<li>–––, 2010a, “Higher-Order Evidence”,\n<em>Philosophy and Phenomenological Research</em>, 81(1):\n185–215. doi:10.1111/j.1933-1592.2010.00366.x</li>\n<li>–––, 2010b, “Rational Reflection”,\n<em>Philosophical Perspectives</em>, 24(1): 121–140.\ndoi:10.1111/j.1520-8583.2010.00187.x</li>\n<li>–––, 2011, “Disagreement,\nQuestion-Begging, and Epistemic Self-Criticism”,\n<em>Philosopher’s Imprint</em>, 11(March): article 6 (22 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0011.006\" target=\"other\">Christensen 2011 available online</a>]</li>\n<li>–––, 2013, “Epistemic Modesty\nDefended”, in Christensen and Lackey 2013: 77–97.\ndoi:10.1093/acprof:oso/9780199698370.003.0005</li>\n<li>–––, 2016a, “Disagreement, Drugs, Etc.:\nFrom Accuracy to Akrasia”, <em>Episteme</em>, 13(4):\n397–422. doi:10.1017/epi.2016.20</li>\n<li>–––, 2016b, “Conciliation, Uniqueness and\nRational Toxicity”, <em>Noûs</em>, 50(3): 584–603.\ndoi:10.1111/nous.12077</li>\n<li>–––, 2018, “On Acting as Judge in\nOne’s Own (Epistemic) Case”, <em>Proceedings and Addresses\nof the American Philosophical Association</em>, 93(1):\n207–235.</li>\n<li>–––, 2019, “Formulating\nIndependence”, in Skipper and Steglich-Petersen 2019:\n13–34. doi:10.1093/oso/9780198829775.003.0001</li>\n<li>–––, 2021a, “Akratic (Epistemic)\nModesty”, <em>Philosophical Studies</em>, 178(7):\n2191–2214. doi:10.1007/s11098-020-01536-6</li>\n<li>–––, 2021b, “Rationality for the\nSelf-Aware”, <em>Proceedings and Addresses of the American\nPhilosophical Association</em>, 95(1): 213–236.</li>\n<li>–––, 2021c, “Embracing Epistemic\nDilemmas”, in McCain, Stapleford, and Steup 2021: chap. 10.</li>\n<li>Christensen, David and Jennifer Lackey (eds.), 2013, <em>The\nEpistemology of Disagreement: New Essays</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Coates, Allen, 2012, “Rational Epistemic Akrasia”,\n<em>American Philosophical Quarterly</em>, 49(2): 113–124.</li>\n<li>DiPaolo, Joshua, 2018, “Higher-Order Defeat Is\nObject-Independent”, <em>Pacific Philosophical Quarterly</em>,\n99(2): 248–269. doi:10.1111/papq.12155</li>\n<li>–––, 2019, “Second Best Epistemology:\nFallibility and Normativity”, <em>Philosophical Studies</em>,\n176(8): 2043–2066. doi:10.1007/s11098-018-1110-y</li>\n<li>Dorst, Kevin, 2019, “Higher-Order Uncertainty”, in\nSkipper and Steglich-Petersen 2019: 35–61.\ndoi:10.1093/oso/9780198829775.003.0002</li>\n<li>–––, 2020, “Evidence: A Guide for the\nUncertain”, <em>Philosophy and Phenomenological Research</em>,\n100(3): 586–632. doi:10.1111/phpr.12561</li>\n<li>–––, forthcoming, “Higher-Order\nEvidence”, in <em>The Routledge Handbook for the Philosophy of\nEvidence</em>, Maria Lasonen-Aarnio and Clayton Littlejohn (eds),\nRoutledge.<!-- suppose to 2022 or 2023--></li>\n<li>Egan, Andy and Adam Elga, 2005, “I Can’t Believe\nI’m Stupid”, <em>Philosophical Perspectives</em>, 19(1):\n77–93. doi:10.1111/j.1520-8583.2005.00054.x</li>\n<li>Elga, Adam, 2007, “Reflection and Disagreement”,\n<em>Noûs</em>, 41(3): 478–502.\ndoi:10.1111/j.1468-0068.2007.00656.x</li>\n<li>–––, 2010, “How to Disagree about How to\nDisagree”, in Feldman and Warfield 2010: 175–186.\ndoi:10.1093/acprof:oso/9780199226078.003.0008</li>\n<li>–––, 2013, “The Puzzle of the Unmarked\nClock and the New Rational Reflection Principle”,\n<em>Philosophical Studies</em>, 164(1): 127–139.\ndoi:10.1007/s11098-013-0091-0</li>\n<li>Enoch, David, 2010, “Not Just a Truthometer: Taking Oneself\nSeriously (but Not Too Seriously) in Cases of Peer\nDisagreement”, <em>Mind</em>, 119(476): 953–997.\ndoi:10.1093/mind/fzq070</li>\n<li>Feldman, Richard, 2005, “Respecting the Evidence”,\n<em>Philosophical Perspectives</em>, 19(1): 95–119.\ndoi:10.1111/j.1520-8583.2005.00055.x</li>\n<li>–––, 2006, “Reasonable Religious\nDisagreements”, in <em>Philosophers Without Gods: Meditations on\nAtheism and the Secular Life</em>, Louise Antony (ed.), Oxford/New\nYork: Oxford University Press, 194–214.</li>\n<li>Feldman, Richard and Ted A. Warfield (eds.), 2010,\n<em>Disagreement</em>, Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199226078.001.0001</li>\n<li>Field, Claire, 2019, “It’s Ok to Make Mistakes:\nAgainst the Fixed Point Thesis”, <em>Episteme</em>, 16(2):\n175–185. doi:10.1017/epi.2017.33</li>\n<li>Field, Hartry, 2000, “Apriority as an Evaluative\nNotion”, in <em>New Essays on the A Priori</em>, Paul Boghossian\nand Christopher Peacocke (eds.), Oxford/New York: Oxford University\nPress, 117–149. doi:10.1093/0199241279.003.0006</li>\n<li>Fleisher, Will, 2021, “How to Endorse\nConciliationism”, <em>Synthese</em>, 198(10): 9913–9939.\ndoi:10.1007/s11229-020-02695-z</li>\n<li>Goldberg, Sanford, 2013, “Defending Philosophy in the Face\nof Systematic Disagreement”, in <em>Disagreement and\nSkepticism</em>, Diego E. Machuca (ed.), New York: Routledge,\n277–294.</li>\n<li>Hall, Ned, 1994, “Correcting The Guide to Objective\nChance”, <em>Mind</em>, 103(412): 505–518.\ndoi:10.1093/mind/103.412.505</li>\n<li>Hawthorne, John, Yoaav Isaacs, and Maria Lasonen‐Aarnio,\n2021, “The Rationality of Epistemic Akrasia”,\n<em>Philosophical Perspectives</em>, 35(1): 206–228.\ndoi:10.1111/phpe.12144</li>\n<li>Hedden, Brian and Kevin Dorst, forthcoming, “(Almost) All\nEvidence is Higher-Order Evidence”, <em>Analysis</em>, early\nonline: 8 May 2022. doi:10.1093/analys/anab081</li>\n<li>Henderson, Leah, forthcoming, “Higher‐order Evidence\nand Losing One’s Conviction”, <em>Noûs</em>, early\nonline: 3 May 2021. doi:10.1111/nous.12367</li>\n<li>Horowitz, Sophie, 2014, “Epistemic Akrasia”,\n<em>Noûs</em>, 48(4): 718–744. doi:10.1111/nous.12026</li>\n<li>–––, 2019, “Predictably Misleading\nEvidence”, in Skipper and Steglich-Petersen 2019: 105–123.\ndoi:10.1093/oso/9780198829775.003.0005</li>\n<li>Hughes, Nick, 2019, “Dilemmic Epistemology”,\n<em>Synthese</em>, 196(10): 4059–4090.\ndoi:10.1007/s11229-017-1639-x</li>\n<li>–––, 2021, “Who’s Afraid of\nEpistemic Dilemmas?”, in McCain, Stapleford, and Steup 2021:\nchap. 15.</li>\n<li>Isaacs, Yoaav, 2021, “The Fallacy of Calibrationism”,\n<em>Philosophy and Phenomenological Research</em>, 102(2):\n247–260. doi:10.1111/phpr.12640</li>\n<li>Kelly, Thomas, 2005, “The Epistemic Significance of\nDisagreement”, in <em>Oxford Studies in Epistemology, Volume\n1</em>, Tamar Szabó Gendler and John Hawthorne (eds.),\nOxford/New York: Oxford University Press, 167–196.</li>\n<li>–––, 2010, “Peer Disagreement and\nHigher‐Order Evidence”, in Feldman and Warfield 2010:\n111–174. doi:10.1093/acprof:oso/9780199226078.003.0007</li>\n<li>–––, 2013, “Disagreement and the Burdens\nof Judgment”, in Christensen and Lackey 2013: 31–53.\ndoi:10.1093/acprof:oso/9780199698370.003.0003</li>\n<li>Knoks, Aleks, 2021, “Misleading Higher-Order Evidence,\nConflicting Ideals, and Defeasible Logic”, <em>Ergo an Open\nAccess Journal of Philosophy</em>, 8(6): 141–174.\ndoi:10.3998/ergo.1143</li>\n<li>Lasonen-Aarnio, Maria, 2014, “Higher-Order Evidence and the\nLimits of Defeat”, <em>Philosophy and Phenomenological\nResearch</em>, 88(2): 314–345. doi:10.1111/phpr.12090</li>\n<li>–––, 2015, “New Rational Reflection and\nInternalism about Rationality”, in <em>Oxford Studies in\nEpistemology, Volume 5</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford/New York: Oxford University Press,\n145–171. doi:10.1093/acprof:oso/9780198722762.003.0005</li>\n<li>–––, 2020, “Enkrasia or Evidentialism?\nLearning to Love Mismatch”, <em>Philosophical Studies</em>,\n177(3): 597–632. doi:10.1007/s11098-018-1196-2</li>\n<li>Leonard, Nick, 2020, “Epistemic Dilemmas and Rational\nIndeterminacy”, <em>Philosophical Studies</em>, 177(3):\n573–596. doi:10.1007/s11098-018-1195-3</li>\n<li>Lewis, David, 1971, “Immodest Inductive Methods”,\n<em>Philosophy of Science</em>, 38(1): 54–63.\ndoi:10.1086/288339</li>\n<li>Littlejohn, Clayton, 2018, “Stop Making Sense? On a Puzzle\nabout Rationality”, <em>Philosophy and Phenomenological\nResearch</em>, 96(2): 257–272. doi:10.1111/phpr.12271</li>\n<li>Lord, Errol, 2014, “From Independence to Conciliationism: An\nObituary”, <em>Australasian Journal of Philosophy</em>, 92(2):\n365–377. doi:10.1080/00048402.2013.829506</li>\n<li>McCain, Kevin, Scott Stapleford, and Matthias Steup (eds), 2021,\n<em>Epistemic Dilemmas: New Arguments, New Angles</em>, New York:\nRoutledge. doi:10.4324/9781003134565</li>\n<li>Neta, Ram, 2019, “The Puzzles of Easy Knowledge and of\nHigher-Order Evidence: A Unified Solution”, in Skipper and\nSteglich-Petersen 2019: 173–188.\ndoi:10.1093/oso/9780198829775.003.0008</li>\n<li>Pettigrew, Richard and Michael G. Titelbaum, 2014,\n“Deference Done Right”, <em>Philosopher’s\nImprint</em>, 14(December): article 35 (19 pages).\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.035\" target=\"other\">Pettigrew and Titelbaum 2014 available online</a>]</li>\n<li>Roush, Sherrilyn, 2009, “Second Guessing: A Self-Help\nManual”, <em>Episteme</em>, 6(3): 251–268.\ndoi:10.3366/E1742360009000690</li>\n<li>–––, 2017, “Epistemic Self-Doubt”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Winter 2017\nEdition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2017/entries/epistemic-self-doubt/\" target=\"other\">https://plato.stanford.edu/archives/win2017/entries/epistemic-self-doubt/</a>&gt;.</li>\n<li>Salow, Bernhard, 2018, “The Externalist’s Guide to\nFishing for Compliments”, <em>Mind</em>, 127(507):\n691–728. doi:10.1093/mind/fzw029</li>\n<li>Schoenfield, Miriam, 2015a, “A Dilemma for\nCalibrationism”, <em>Philosophy and Phenomenological\nResearch</em>, 91(2): 425–455. doi:10.1111/phpr.12125</li>\n<li>–––, 2015b, “Bridging Rationality and\nAccuracy”:, <em>The Journal of Philosophy</em>, 112(12):\n633–657. doi:10.5840/jphil20151121242</li>\n<li>–––, 2018, “An Accuracy Based Approach to\nHigher Order Evidence”, <em>Philosophy and Phenomenological\nResearch</em>, 96(3): 690–715. doi:10.1111/phpr.12329</li>\n<li>Schechter, Joshua, 2013, “Rational Self-Doubt and the\nFailure of Closure”, <em>Philosophical Studies</em>, 163(2):\n429–452. doi:10.1007/s11098-011-9823-1</li>\n<li>Silva, Paul, 2017, “How Doxastic Justification Helps Us\nSolve the Puzzle of Misleading Higher-Order Evidence”,\n<em>Pacific Philosophical Quarterly</em>, 98(S1): 308–328.\ndoi:10.1111/papq.12173</li>\n<li>–––, 2018, “Explaining Enkratic\nAsymmetries: Knowledge-First Style”, <em>Philosophical\nStudies</em>, 175(11): 2907–2930.\ndoi:10.1007/s11098-017-0987-1</li>\n<li>Skipper, Mattias, 2021, “Does Rationality Demand\nHigher-Order Certainty?”, <em>Synthese</em>, 198(12):\n11561–11585. doi:10.1007/s11229-020-02814-w</li>\n<li>Skipper, Mattias and Asbjørn Steglich-Petersen (eds.),\n2019, <em>Higher-Order Evidence: New Essays</em>, Oxford/New York:\nOxford University Press. doi:10.1093/oso/9780198829775.001.0001</li>\n<li>Sliwa, Paulina and Sophie Horowitz, 2015, “Respecting All\nthe Evidence”, <em>Philosophical Studies</em>, 172(11):\n2835–2858. doi:10.1007/s11098-015-0446-9</li>\n<li>Smithies, Declan, 2019, <em>The Epistemic Role of\nConsciousness</em>, (Philosophy of Mind Series), New York, NY: Oxford\nUniversity Press. doi:10.1093/oso/9780199917662.001.0001</li>\n<li>Staffel, Julia, forthcoming, “Transitional Attitudes and the\nUnmooring View of Higher‐order Evidence”,\n<em>Noûs</em>, early online: 6 October 2021.\ndoi:10.1111/nous.12400</li>\n<li>Stalnaker, Robert C., 2009, “On Hawthorne and Magidor on\nAssertion, Context, and Epistemic Accessibility”, <em>Mind</em>,\n118(470): 399–409. doi:10.1093/mind/fzp061</li>\n<li>Steglich-Petersen, Asbjørn, 2019, “Higher-Order\nDefeat and Doxastic Resilience”, in Skipper and\nSteglich-Petersen 2019: 209–225.\ndoi:10.1093/oso/9780198829775.003.0010</li>\n<li>Tal, Eyal, 2021, “Is Higher-Order Evidence Evidence?”,\n<em>Philosophical Studies</em>, 178(10): 3157–3175.\ndoi:10.1007/s11098-020-01574-0</li>\n<li>Titelbaum, Michael G., 2015, “Rationality’s Fixed\nPoint (or: In Defense of Right Reason)”, in <em>Oxford Studies\nin Epistemology, Volume 5</em>, Tamar Szabó Gendler and John\nHawthorne (eds.), Oxford/New York: Oxford University Press,\n253–294. doi:10.1093/acprof:oso/9780198722762.003.0009</li>\n<li>–––, 2019, “Return to Reason”, in\nSkipper and Steglich-Petersen 2019: 226–245.\ndoi:10.1093/oso/9780198829775.003.0011</li>\n<li>Vavova, Katia, 2018, “Irrelevant Influences”,\n<em>Philosophy and Phenomenological Research</em>, 96(1):\n134–152. doi:10.1111/phpr.12297</li>\n<li>Weatherson, Brian, 2013, “Disagreements, Philosophical, and\nOtherwise”, in Christensen and Lackey 2013: 54–73.\ndoi:10.1093/acprof:oso/9780199698370.003.0004</li>\n<li>–––, 2019, <em>Normative Externalism</em>,\nOxford: Oxford University Press.\ndoi:10.1093/oso/9780199696536.001.0001</li>\n<li>Wedgwood, Ralph, 2012, “Justified Inference”,\n<em>Synthese</em>, 189(2): 273–295.\ndoi:10.1007/s11229-011-0012-8</li>\n<li>White, Roger, 2010, “You Just Believe That\nBecause…”, <em>Philosophical Perspectives</em>, 24(1):\n573–615. doi:10.1111/j.1520-8583.2010.00204.x</li>\n<li>–––, 2009, “On Treating Oneself and Others\nas Thermometers”, <em>Episteme</em>, 6(3):\n233–250. doi:10.3366/e1742360009000689</li>\n<li>van Wietmarschen, Han, 2013, “Peer Disagreement, Evidence,\nand Well-Groundedness”, <em>The Philosophical Review</em>,\n122(3): 395–425. doi:10.1215/00318108-2087654</li>\n<li>Williamson, Timothy, 2014, “Very Improbable\nKnowing”, <em>Erkenntnis</em>, 79(5): 971–999.\ndoi:10.1007/s10670-013-9590-9</li>\n<li>Worsnip, Alex, 2018, “The Conflict of Evidence and\nCoherence”, <em>Philosophy and Phenomenological\nResearch</em>, 96(1): 3–44. doi:10.1111/phpr.12246</li>\n<li>Ye, Ru, 2020, “Higher-Order Defeat and Intellectual\nResponsibility”, <em>Synthese</em>, 197(12): 5435–5455.\ndoi:10.1007/s11229-018-01972-2</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "disagreement",
            "evidence",
            "justification, epistemic: coherentist theories of",
            "justification, epistemic: foundationalist theories of",
            "justification, epistemic: internalist vs. externalist conceptions of",
            "rational choice, normative: expected utility",
            "rational choice, normative: rivals to expected utility",
            "rationality",
            "rationality: structural",
            "reliabilist epistemology",
            "self-doubt, epistemic\n\nepistemic-self-doubt"
        ],
        "entry_link": [
            {
                "../disagreement/": "disagreement"
            },
            {
                "../evidence/": "evidence"
            },
            {
                "../justep-coherence/": "justification, epistemic: coherentist theories of"
            },
            {
                "../justep-foundational/": "justification, epistemic: foundationalist theories of"
            },
            {
                "../justep-intext/": "justification, epistemic: internalist vs. externalist conceptions of"
            },
            {
                "../rationality-normative-utility/": "rational choice, normative: expected utility"
            },
            {
                "../rationality-normative-nonutility/": "rational choice, normative: rivals to expected utility"
            },
            {
                "../rationality-structural/": "rationality: structural"
            },
            {
                "../reliabilism/": "reliabilist epistemology"
            },
            {
                "../epistemic-self-doubt/": "self-doubt, epistemic"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=higher-order-evidence\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/higher-order-evidence/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=higher-order-evidence&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/higher-order-evidence/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=higher-order-evidence": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/higher-order-evidence/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=higher-order-evidence&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/higher-order-evidence/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Elga, Adam, 2008,\n “<a href=\"https://www.princeton.edu/~adame/papers/bellingham-lucky.pdf\" target=\"other\">Lucky to be Rational</a>”,\n paper presented on 6 June 2008 at the Bellingham Summer Philosophy\nConference.",
            "Weatherson Brian, ms\n “<a href=\"https://philarchive.org/rec/WEADJS\" target=\"other\">Do Judgments Screen Evidence?</a>”\n unpublished draft manuscript dated 14 April 2010."
        ],
        "listed_links": [
            {
                "https://www.princeton.edu/~adame/papers/bellingham-lucky.pdf": "Lucky to be Rational"
            },
            {
                "https://philarchive.org/rec/WEADJS": "Do Judgments Screen Evidence?"
            }
        ]
    }
}