{
    "url": "husserl",
    "title": "Edmund Husserl",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Christian Beyer",
        "author_links": [
            {
                "http://www.uni-goettingen.de/de/70428.html": "Christian Beyer"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"http://www.uni-goettingen.de/de/70428.html\" target=\"other\">Christian Beyer</a>\n</p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Feb 28, 2003",
        "substantive revision Mon Oct 17, 2022"
    ],
    "preamble": "\n\nEdmund Husserl was the principal founder of phenomenology—and\nthus one of the most influential philosophers of the 20th\ncentury. He has made important contributions to almost all areas of\nphilosophy and anticipated central ideas of its neighbouring\ndisciplines such as linguistics, sociology and cognitive\npsychology.\n",
    "toc": [
        {
            "#LifWor": "1. Life and work"
        },
        {
            "#PurLogMeaIntFulInt": "2. Pure logic, meaning, intuitive fulfillment and intentionality"
        },
        {
            "#IndProCon": "3. Indexicality and propositional content"
        },
        {
            "#SinHorInt": "4. Singularity, consciousness and horizon-intentionality"
        },
        {
            "#PheEpo": "5. The phenomenological epoché"
        },
        {
            "#EpoPerNoeHylTimConPheRed": "6. Epoché, perceptual noema, hýle, time-consciousness and phenomenological reduction"
        },
        {
            "#passivity": "7. Passivity vs. activity"
        },
        {
            "#communication": "8. Communication, sociality, personhood and personal values"
        },
        {
            "#EmpIntLif": "9. Empathy, intersubjectivity and lifeworld; ethics and value theory"
        },
        {
            "#IntConObj": "10. The intersubjective constitution of objectivity and the case for “transcendental idealism”"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriLit": "Primary Literature"
        },
        {
            "#SecLit": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life and work\n\nHusserl was born in Prossnitz (Moravia) on April 8th, 1859.\nHis parents were non-orthodox Jews; Husserl himself and his wife would\nlater convert to Protestantism. They had three children, one of whom\ndied in World War I. In the years 1876–78 Husserl studied\nastronomy in Leipzig, where he also attended courses of lectures in\nmathematics, physics and philosophy. Among other things, he heard\nWilhelm Wundt’s lectures on philosophy. (Wundt was the\noriginator of the first institute for experimental psychology.)\nHusserl’s mentor was Thomas Masaryk, a former student of\nBrentano’s, who was later to become the first president of\nCzechoslovakia. In 1878–81 Husserl continued his studies in\nmathematics, physics and philosophy in Berlin. His mathematics\nteachers there included Leopold Kronecker and Karl Weierstrass, whose\nscientific ethos Husserl was particularly impressed with. However, he\ntook his PhD in mathematics in Vienna (January 1883), with a thesis on\nthe theory of variations (Variationstheorie). After that he\nreturned to Berlin, to become Weierstrass’ assistant. When\nWeierstrass got seriously ill, Masaryk suggested that Husserl go back\nto Vienna, to study philosophy with Franz Brentano, the author of\nPsychology from an Empirical Standpoint (1874). After a brief\nmilitary service in Vienna, Husserl followed Masaryk’s advice\nand studied with Brentano from 1884–86. Brentano’s\nlectures on psychology and logic had a lasting impact on Husserl, as\nhad his general vision of a strictly scientific philosophy. Brentano\nthen recommended Husserl to his pupil Carl Stumpf in Halle, who is\nperhaps best known for his Psychology of Tone (two volumes,\n1883/90). This recommendation enabled Husserl to prepare and submit\nhis habilitation dissertation On the Concept of Number (1887)\nwith Stumpf.\n\nThat thesis was later integrated into Husserl’s first published\nmonograph, Philosophy of Arithmetic, which appeared in 1891.\nIn this work, Husserl combined his mathematical, psychological and\nphilosophical competencies to attempt a psychological foundation of\narithmetic (see Willard 1984, pp. 38–118; Bell 1990, pp.\n31–84). The book was, however, criticized for its underlying\npsychologism in a review by Gottlob Frege. It seems that Husserl took\nthat criticism very seriously (see Føllesdal 1958), although it\nis far from clear that the author of Philosophy of Arithmetic\nregards logic as a branch of psychology, as “strong\npsychologism” (Mohanty 1982, p. 20) has it. In any case, Husserl\nsharply attacked that kind of psychologism (raising about eighteen\nobjections in total; see Soldati 1994, pp. 117 ff) and developed the\nphilosophical method he is nowadays famous for: phenomenology.\n\nIn 1900/01 his first phenomenological work was published in two\nvolumes, titled Logical Investigations. The first volume\ncontains a forceful attack against psychologism, whereas the (much\nlarger) second volume consists of six\n“descriptive-psychological” and\n“epistemological” investigations into (I) expression and\nmeaning, (II) universals, (III) the formal ontology of parts and\nwholes (mereology), (IV) the “syntactical” and\nmereological structure of meaning, (V) the nature and structure of\nintentionality as well as (VI) the interrelation of truth, intuition\nand cognition. Husserl now adheres to a version of platonism that he\nderived from ideas of Hermann Lotze and especially Bernard Bolzano,\nwhere he embeds platonism about meaning and mental content in a theory\nof intentional consciousness (see Beyer 1996).\n\nIn the first decade of the 20th century, Husserl\nconsiderably refined and modified his method into what he called\n“transcendental phenomenology”. This method has us focus\non the essential structures that allow the objects naively taken for\ngranted in the “natural attitude” (which is characteristic\nof both our everyday life and ordinary science) to “constitute\nthemselves” in consciousness. (Among those who influenced him in\nthis regard are Descartes, Hume and Kant.) As Husserl explains in\ndetail in his second major work, Ideas (1913), the resulting\nperspective on the realm of intentional consciousness is supposed to\nenable the phenomenologist to develop a radically unprejudiced\njustification of his (or her) basic views on the world and himself and\nexplore their rational interconnections.\n\nHusserl developed these ideas in Göttingen, where—thanks to\nhis Logical Investigations and the support by Wilhelm\nDilthey, who admired that work and recommended Husserl to the Prussian\nministry of culture—he received an associate professorship\n(“Extraordinariat”, later turned into a\n“Persönliches Ordinariat”) in 1901. From 1910/11 and\n1913, respectively, he served as founding (co-)editor of\nLogos (in the first issue of which his programmatic article\n“Philosophy as a Rigorous Science” appeared, containing a\ncritique of naturalism) and of the Yearbook for Phenomenology and\nPhenomenological Research (opening with his Ideas Pertaining\nto a Pure Phenomenology and to a Phenomenological Philosophy).\nHusserl stayed in Göttingen until 1916. It is here that he made\nhis most important philosophical discoveries (cf. Mohanty 1995), such\nas the transcendental-phenomenological method, the phenomenological\nstructure of time-consciousness, the fundamental role of the notion of\nintersubjectivity in our conceptual system, the horizon-structure of\nour singular empirical thought, and more. In later works—most\nnotably in On the Phenomenology of the Consciousness of Internal\nTime (1928), Formal and Transcendental Logic (1929),\nCartesian Meditations (1931), The Crisis of European\nSciences and Transcendental Phenomenology (1954) and\nExperience and Judgement (1939)—these results were\ndeveloped further and put into new contexts, such as the path-breaking\nproject of linking the basic notions of science back to their\nconceptual roots in the pre-scientific (regions of the)\n“lifeworld” (Crisis).\n\nIn the year 1916 Husserl became Heinrich Rickert’s successor as\nfull professor (“Ordinarius”) in Freiburg/Breisgau, where\n(among many other things) he worked on passive synthesis (cf.\nHusserliana, vol. XI, XXXI). He gave four lectures on\nPhenomenological Method and Phenomenological Philosophy at\nUniversity College, London, in 1922 (cf. Husserliana, vol.\nXXXV). In 1923 he received a call to Berlin, which he rejected.\nHusserl retired in 1928, his successor being his (and Rickert’s)\nformer assistant Martin Heidegger (whose major work Being and\nTime had been published in Husserl’s Yearbook in\n1927). In 1929 he accepted an invitation to Paris. His lectures there\nwere published as Cartesian Meditations in 1931. In the same\nyear, Husserl gave a number of talks on “Phenomenology and\nAnthropology”, in which he criticized his two\n“antipodes”, Heidegger and Max Scheler (cf. Husserl 1997).\nIn 1933 Hitler took over in Germany. Husserl received a call to Los\nAngeles but rejected. Because of his Jewish ancestors, he became more\nand more humiliated and isolated. In 1935 he gave a series of invited\nlectures in Prague, resulting in his last major work, The Crisis\nof European Sciences and Transcendental Phenomenology.\n\nEdmund Husserl died on April 27, 1938 in Freiburg. His manuscripts\n(more than 40000 pages in total) were rescued by the Franciscan Herman\nLeo Van Breda, who brought them to Leuven (Belgium), where the first\nHusserl archive was founded in 1939. (Today, there are further\narchives in Freiburg, Cologne, Paris, New York and Pittsburgh.) Since\n1950 the Husserl archives are editing Husserl’s collected works,\nHusserliana.\n2. Pure logic, meaning, intuitive fulfillment and intentionality\n\nAs a philosopher with a mathematical background, Husserl was\ninterested in developing a general theory of inferential systems,\nwhich (following Bolzano) he conceived of as a theory of science, on\nthe ground that every science (including mathematics) can be looked\nupon as a system of propositions that are interconnected by a set of\ninferential and grounding relations. Following John S. Mill, he argues\nin Logical Investigations that the best way to study the\nnature of such propositional systems is to start with their linguistic\nmanifestations, i.e., (sets of) sentences and (assertive) utterances\nthereof.\n\nHow are we to analyse these sentences and the propositions they\nexpress? Husserl’s approach is to study the units of\nconsciousness that the respective speaker presents himself as\nhaving—that he “gives voice to”—in expressing\nthe proposition in question (for instance, while writing a\nmathematical textbook or giving a lecture). These units of\nconsciousness he labels intentional acts or intentional\nexperiences, since they always represent something as\nsomething—thus exhibiting what Brentano called intentionality.\nAccording to Husserl, there are non-intentional units of consciousness\nas well. (He quotes pain as an example.) What distinguishes\nintentional from non-intentional experiences is the former’s\nhaving intentional content.\n\nEven objectless (i.e., empty) intentional experiences like your\nthought of the winged horse Pegasus have content. On Husserl’s\nview, that thought simply lacks a corresponding object; the\nintentional act is “merely as of”, but not really of, an\nobject. Husserl rejects “representationalist” accounts of\nintentionality, such as the mental image theory, according to which\nintentional experiences represent intra-mental pictorial\nrepresentations of objects, where like other pictures such images may\nexist without there being a depicted object in the actual world. For\nHusserl, this view leads to a “false duplication” of\nobjects represented in the veridical case; and it already presupposes\nwhat an adequate conception of pictorial representation is yet to\naccomplish: an explanation of what it is that makes the underlying\n“phantasy content”, or phantasm, “the [r]epresenting\nimage of something or other” (Husserl 1994, p. 347;\nHusserliana, vol. XXII, pp. 305f). It is precisely an\nintentional content that does the trick here (as in all cases of\nintentional consciousness), according to Husserl, in a way to be\nexplained in more detail by his phenomenology of consciousness.\n\nIn the case of propositional acts, i.e., units of consciousness that\ncan be given voice to by a complete sentence (paradigmatically, a\ndeclarative sentence), Husserl identifies their content with the\npropositional meaning expressed by that sentence. In the case of their\nnon-propositional but still intentional parts, he identifies the\ncorresponding intentional content with a sub-propositional meaning.\nFor example, the judgement “Napoleon is a Frenchman”\ncontains an act of thinking of Napoleon whose intentional content is\nthe sub-propositional meaning expressed by the name\n“Napoleon”. (Accordingly, the judgement can be looked upon\nas an act of ascribing the property of being French to the referent of\nthat name.) Experiences like this, which can be given voice to by\neither a singular or a general term, are called “nominal\nacts” (as opposed to the propositional acts containing them).\nTheir contents are called “nominal meanings”.\n\nHusserl regards both propositional and nominal meanings as the\nsubject-matter of “pure logic” or “logic in the wide\nsense”—the study of (i) what distinguishes sense (alias\nmeaning) from nonsense (this part of pure logic being called\n“pure grammar”) and (ii) which of the senses delivered by\npure grammar are logically consistent and which of them are not (this\npart of pure logic being labelled “logic in the narrow\nsense”).\n\nAn important and still largely unexplored claim of Husserl’s is\nthat any logically consistent meaning can in principle be subjectively\nfulfilled, more or less adequately, by a unified intuition, such as an\nact of continuous perception or intuitive imagination, where the\nstructure and other essential features of the meaning in question can\nbe read off from the respective mode of intuitive fulfillment.\nInconsistent meanings can be singled out and studied by means of\n(reflection upon) corresponding experiences of intuitive conflict,\nlike for instance the discrete switching back and forth between a\nduck-head-imagination and a rabbit-head-imagination in the case of an\nattempted intuitive imagination of a duck-head that is at the same\ntime a rabbit-head. Some meanings are inconsistent for formal-logical\nreasons. According to Husserl, all analytically false propositions\nbelong to this category. Other meanings are inconsistent because they\nconflict with some general material a priori truth, also called\n“essential law”. The proposition expressed by the sentence\n“There are perceptual objects whose surface is both (visibly)\ncompletely green and completely red at the same time” is a case\nin point.\n\nMeanings generally and propositions in particular exist independently\nof their actually functioning as intentional content. Thus, true\npropositions such as the Pythagorean theorem can be\ndiscovered. Propositions and their components are abstract,\ni.e., atemporal, objects. However, what does it mean to grasp\na proposition or, more generally, a sense? How can an abstract object\nbecome the content of an intentional act? Combining ideas of Bolzano\nand Lotze, Husserl answers this question by taking recourse to the\nnotion of an ideal (i.e., abstract) species or type,\nas follows. Propositions and other meanings are ideal species that can\nbe (but do not have to be) instantiated by certain particular\nfeatures, i.e., dependent parts, of intentional acts. Those species\nare also called “ideal matters”. The particular features\ninstantiating an ideal matter—Husserl refers to them as\n“moments of matter”—are laid bare by\nphenomenological description, a reflection-based (or introspective)\nanalysis taking into account both the linguistic expression(s) (if\nany) and the modes of (possible) intuitive fulfillment or conflict\nassociated with the respective experience.\n\nSince phenomenological description yields ideal species, it involves\nwhat Husserl was later (notably in Ideas) to call\n“eidetic reduction”, i.e., an unfolding of abstract\nfeatures shared by appropriate sets of fictitious or real-life\nexamples, by way, e.g., of free imaginative variation on an\narbitrarily chosen initial example (for the method of “free\nvariation”, see Experience and Judgement, sec. 87).\n\nPhenomenological description also yields the “moment of\nquality” of the intentional experience under investigation,\ni.e., the particular feature instantiating its psychological mode\n(judgement, conscious deliberation, conscious desire, conscious hope,\netc.), which roughly corresponds to the speech act mode of an\nutterance giving voice to that experience. Furthermore, the\ndescription yields relations of “foundation”, i.e.,\none-sided or mutual relative existential dependencies between (1) the\nexperience in question and other experiences and (2) the particular\ndescriptive features of the experience. Thus, an experience of\npleasure about a given event is one-sidedly founded, relative to the\nstream of consciousness it belongs to, in a particular belief-state to\nthe effect that this event has occurred. (The relativization to a\nparticular stream of consciousness makes sure that both founded and\nfounding experience occur in the same person’s mind.) Like all\nfoundation relations, this one holds in virtue of an essential law, to\nthe effect that conscious pleasure about some state of affairs\nrequires a corresponding (and simultaneous) belief. Quite generally, a\ngiven object a of type F is founded in a particular\nobject b of type G (where a is different\nfrom b and F is different from G) relative\nto a particular whole c of type H if and only if (i)\nthere is an essential law in virtue of which it holds that for any\nobject x of type F there is an object y of\ntype G and a whole z of type H, such that\nboth x and y are (proper) parts of z, and\n(ii) both a and b are (proper) parts of c.\nOf course, the notion of an essential law needs further clarification\n(see De Santis 2021, pt. III ff).\n3. Indexicality and propositional content\n\nHowever, as Husserl was well aware, the species-theory of content\nfaces at least one serious objection. This objection concerns\nutterances that are “essentially occasional”, i.e.,\nsystematically context-sensitive, expressions like “I am here\nnow” and the ‘indexical’ experiences they give voice\nto. If the intentional content of an indexical experience is to serve\nas a (sub-)propositional content, it must uniquely determine the\nobject (if any) that the respective experience refers to. That is to\nsay: if two indexical experiences display the same intentional\ncontent, they must refer to the same object (if any). It seems,\nthough, that the moments of matter of two such experiences can\ninstantiate the same ideal matter—the same type of (particular)\ncontent—whilst representing different objects. If you and I both\nthink “I am here”, our respective thoughts share the same\ntype of content, or so it would seem, but they represent different\nstates of affairs. In order to accommodate this observation, Husserl\ndraws a distinction between, on the one hand, the “general\nmeaning function” of an utterance (which corresponds to what\nDavid Kaplan calls “character”, roughly: the linguistic\nmeaning of the expression used) and, on the other hand, the\n“respective meaning” (i.e., the propositional or\nsub-propositional content expressed in the relevant context of\nutterance). However, it is doubtful whether this distinction really\nhelps Husserl overcome the difficulty the phenomenon of\ncontext-sensitivity poses for his species-theory of content. If\nintentional contents are ideal matters in the sense of types\nof particular matters, and if this kind of type may remain constant\nwhile the intentional object and hence the (sub-)propositional content\ndiffers, then surely intentional contents thus conceived cannot always\nfunction as (sub-)propositional contents, as Husserl’s theory\nwould have it. Rather, there must be another intentional content\ninvolved, namely the “respective meaning”, which serves as\nthe (sub-)propositional content of the indexical experience. And this\ncontent does not appear to be an ideal species. (It may be\nargued, however, that even (sub-)propositional contents of indexical\nutterances can be instantiated multiply in thought and\nspeech, thus qualifying as ideal species after all. But the crucial\nquestion is whether this holds true in complete generality: consider\nthe above example “I am here now”.)\n\nHowever that may be, Husserl construes (sub-)propositional contents\n(“respective meanings”) as two-factored, with the general\nmeaning function plus the relevant context of utterance (if any)\ndetermining the content in question. And at least in the case of\nindexical experiences he seems to identify their intentional contents\nwith these two-factored contents, for he holds that intentional\ncontent, which is referred to as “noematic sense” or\n“noematic nucleus” in Ideas, uniquely determines\nreference, i.e., intentional object. (For the claim that noematic\nsense is contextually determined respective meaning rather than\ngeneral meaning function—which rules out any internalist\nreading; see Section 4 below—cf. Husserliana, vol.\nXX/1, pp. 74–78; see also Husserliana, vol. XXVI, p.\n212, fn.) Some scholars even go as far as to claim that Husserl\ndefines the noematic sense as “a certain person, object, event,\nstate of affairs which presents itself, taken exactly as it present\nitself or as it is intended” (Gurwitsch 1982, pp. 61 f.; cp.\nSokolowski 1987 and Drummond 1992; for a much-discussed critique of\nGurwitsch’s interpretation see Føllesdal 1969). The\nnotion of an intentional object “as it is intended” is\nalready introduced in LI. It is argued (in LI V, sec. 20) that the\nobject (e.g. the situation of affairs) as it is intended is to be\ndistinguished from the (sub-)propositional content, on the grounds\nthat, for instance, the state of affairs judged (the situation of\naffairs as it is categorically formed in the judgment) exists iff it\nobtains (so that the judgment is true), whilst the propositional\ncontent judged exists even if it is false (cf. Husserliana,\nvol. XIX/1, 427).\n4. Singularity, consciousness and horizon-intentionality\n\nHusserl sees quite clearly that indexical experiences (just as\nexperiences given voice to by means of genuine proper names) are\ncharacterized, among other things, by their singularity: they\nrepresent a particular object, or set of objects, x, such\nthat x is to be regarded as the intentional object of the\nrespective experience in all relevant possible worlds (i.e., in all\nactual or counterfactual circumstances relative to which we are\ndetermining the object represented by that experience). Thus, for\ninstance, in sec. 47 of Ideas, he describes what an\nexperiencing subject, at a given time, in the light of his (or her)\ncurrent indexical experiences, considers to be “the actual\nworld” as a “special case” of a whole manifold of\n“possible worlds” each of which corresponds to a possible\nfuture course of experience (possible, that is, relative to the\nindexical experience in question). These (actual or potential) future\nexperiences can be said to be (more or less) anticipated by the\nexperiencing subject at the respective time, and they constitute what\nHusserl calls the “intentional horizon” of the indexical\nexperience in the light of whose intentional content they are\nanticipated (cf. Smith and McIntyre 1982). For example, if you see\nsomething as a table, you will expect it to appear to you in certain\nways if you go around and observe it.\n\nWhat binds together the intentional horizon of a given indexical\nexperience? According to Husserl, all of the (actual or potential)\nexperiences constituting that horizon share a sense of identity\nthrough time, which sense he labels as the determinable\nX they belong to. As a first approximation, two experiences of a\ngiven subject belong to the same determinable X if and only\nif the subject believes them to represent the same object. (For a\nrelated criterion of intersubjective identity of determinable\nX, see Beyer 2000, sec. 7.) Hence, experiences belonging to a\ndeterminable X must be accompanied by at least one\nhigher-order belief. This view fits in well with the thesis (shared,\nat least in part, by so-called dispositional higher-order belief\ntheories of consciousness) that intentional experiences automatically\ngive rise to (i.e., motivate) momentary dispositions to make\ncorresponding reflective higher-order judgements, based on something\nlike inner perception, thus constituting a form of implicit or\n“pre-reflective self-consciousness” (to use Sartre’s\nterm).\n\nIt is controversial whether such a dispositional higher-order view may\nbe ascribed to Husserl (see Zahavi 2015, sec. 1; for a reply see Beyer\n2018, sec. 1). It should be uncontroversial that on his view the\nmotivational basis of the relevant higher-order dispositional beliefs\nmust already display the essential feature of consciousness\nindependently of occurrent higher-order thought in order to be\navailable for such thought in the first place (see Beyer 2011, p. 44).\nThis becomes clear on a close study of Husserl’s work on\n“inner time-consciousness” (see the entry on\n phenomenological approaches to self-consciousness;\n also see Section 6 below). However, there is ample textual evidence\nshowing that he regards the availability to inner perception (in the\nsense of a “real possibility” or “practical\nability”; see Section 8 below) and to accordingly motivated\nreflective higher-order judgements (in which a hitherto “latent\nEgo” becomes “patent”) as an essential feature of\nconsciousness, constituting its “mode of being” (cf.\nHusserliana, vol. III/1, p. 77, l. 27–35; p. 95, l.\n36–38; Husserliana, vol. VIII, p. 90).\n\nThe determinable X a given indexical experience belongs to,\nwith respect to certain other experiences, helps us answer the\nquestion of what determines the reference of that experience, if not\nits ideal meaning species alone. In order to take the role played by\nthe determinable X into account properly, we have to employ a\nHusserlian research strategy that could be called the dynamic\nmethod. That is to say, we have to look upon intentional acts as\nmomentary components of certain transtemporal cognitive\nstructures—dynamic intentional structures—in\nwhich one and the same object or state of affairs is represented\nthroughout a period of time during which the subject’s cognitive\nperspective upon that object or state of affairs is constantly\nchanging (see, e.g., Ideas, sec. 86). (Typical examples of\ndynamic intentional structures include continuous\nobservations—which represent Husserl’s standard\nexample—as well as those totalities of successive judgements, or\nmomentary belief-states, that actualize one and the same continuous\nbelief. For instance, my judgement that yesterday was Thursday\nactualizes the same belief as the judgement I could have given voice\nto yesterday by “Today is Thursday”.) Consequently, the\ndeterminable X is apt to lead us back through time towards\nthe original situation where the reference of the relevant unified\nseries of successive intentional horizons was fixed, like for instance\nthe occasion of the subject’s first perceptual encounter with a\nparticular object: the corresponding perceptual experience will belong\nto the same determinable X as all of the (remaining)\nexperiences belonging to the relevant series. In a more recent\nterminology, one may say that in this perceptual situation the subject\nhas opened a mental file about a particular object (cf. Perry\n1980).\n\nIn a research manuscript from 1913 Husserl refers to mental files\nassociated with proper names as “individual notions\n(Eigenbegriffe)” (cf. Husserliana, vol. XX/2,\np. 358), characterizing them as being infinitely “open”\nand “in flux” (cf. ibid., p. 359). Now it is the\n“referent” of the relevant mental file, or individual\nnotion, that will normally count as the common intentional object of\nthe experiences bound together in a unified series of successive\nintentional horizons in which the object “constitutes\nitself” empirically. (In cases where the “referent”\nof a mental file changes across time—i.e., is unnoticedly\nreplaced by another object—the situation becomes more\ncomplicated. The same goes for cases of perceptual judgements leading\nto, or taken by the respective subject to be confirming, entries into\nan already existing file. See Beyer 2000, sec. 7.) Note that\n“constitution” so conceived does not mean\ncreation.\n\nOn this reading of Husserl’s notion of the determinable\nX, there is a link, at least in the case of proper names and\nin the ubiqituous indexical case, between intentional content\n(including determinable X) on the one hand, and extra-mental\nreality on the other, such that intentional content thus understood\ndetermines reference in much the same way more recent externalist\ntheories of content would have it, i.e. in such a way that the\nreferent can in turn be said to help determine the intentional content\n(see Beyer 2000, 2001; cf. also Husserl’s discussion of Twin\nEarth in Husserliana, vol. XXVI, p. 212). Notice, however,\nthat Husserl does not naively take the existence of an extra-mental\nreferent for granted. Instead, he asks which structures of\nconsciousness entitle us to represent the world as containing\nparticular objects transcending what is currently given to us in\nexperience (see Sections 7 and 8 below).\n\nHusserl can thus be read (or at least be rationally reconstructed) as\nboth an early direct reference theorist (headword: singularity) and a\nnon-naive externalist about intentional content and (respective)\nmeaning.\n\nThe dynamic method has us look upon noematic Sinn under the\n“functional aspect” of how it enables us to keep the\nintentional object “in mind (im Sinn)”\n(Husserliana, vol. II/1, pp. 196 ff), instead of viewing it\nmerely statically as a psychological type or species to be\ninstantiated by isolated moments of consciousness. It makes us regard\nany content of the latter sort, particularly “static perceptual\ncontent”, as a mere “abstraction from dynamic\ncontent” (Mulligan 1995, pp. 195, 197). This may help to explain\nwhy the species-theory of content had become less important to Husserl\nby the time he wrote Ideas.\n5. The phenomenological epoché\n\nAn externalist reading (or rational reconstruction) of Husserl’s\ntheory of content might, however, be taken to conflict with the\nmethodological constraints posed by the phenomenological\nepoché, which—together with the dynamic method\nand eidetic reduction—builds the essential core of the\ntranscendental-phenomenological method introduced in\nIdeas.\n\nHusserl developed the method of epoché or\n“bracketing” around 1906. It may be regarded as a\nradicalization of the methodological constraint, already to be found\nin Logical Investigations, that any phenomenological\ndescription proper is to be performed from a first person\npoint of view, so as to ensure that the respective item is described\nexactly as is experienced, or intended, by the subject. Now\nfrom a first-person point of view, one cannot, of course, decide\nwhether in a case of what one takes to be, say, an act of perception\none is currently performing, there actually is an object that one is\nperceptually confronted with. For instance, it is well possible that\none is hallucinating. From a first-person point of view, there is no\ndifference to be made out between the veridical and the non-veridical\ncase—for the simple reason that one cannot at the same time\nfall victim to and detect a perceptual error or\nmisrepresentation. In the non-veridical case, too, a transcendent\nobject appears to “constitute itself” in consciousness. It\nis for such reasons that Husserl demanded (in Ideas) that in\na phenomenological description proper the existence of the object(s)\n(if any) satisfying the content of the intentional act described must\nbe “bracketed”. That is to say, the phenomenological\ndescription of a given act and, in particular, the phenomenological\nspecification of its intentional content, must not rely upon the\ncorrectness of any existence assumption concerning the\nobject(s) (if any) the respective act is about. Thus, the\nepoché has us focus on those aspects of our\nintentional acts and their contents that do not depend on the\nexistence of a represented object out there in the extra-mental\nworld.\n\nOn closer inspection, however, Husserl actually draws upon two\ndifferent versions of the epoché when introducing this\nmethod in Ideas, which versions he does not separate as\nclearly as one might have hoped: the “universal\nepoché” on the one hand, and a weaker\n“local epoché” (as one could label it) on\nthe other. The former version (as described in Ideas) seems\nto require the phenomenologist to put all his existence\nassumptions regarding the external world into brackets at once, at any\npoint, whereas the weaker version merely requires him to bracket\nparticular existence assumptions. The weaker version\nunderlies the introducing of the notion of noema in Ideas\nin connection with examples like the perceptual hallucination (a\nconcept not applicable within the universal epoché; see\nOvergaard 2004, p. 23) of a blooming apple tree (Husserliana,\nvol. III/1, pp. 204 ff): Husserl here in fact only brackets the\nexistence of particular real objects (Beyer 2000, pp. 140–148).\nBy contrast, the sole function of the universal epoché in\nIdeas seems to be to establish the “residuum”\nthesis, according to which the realm of “pure\nconsciousness” exists independently of the external world. His\nargument for this thesis in Ideas, referring to the\npossibility of “world annihilation”, is flawed, however\n(see Beyer 2000, pp. 138 ff; 2007, pp. 76ff) and, as Erhard (2014, fn.\n718) has observed, Husserl later discovered the relevant fallacy\nhimself (cf. Husserliana, vol. XXXIX, 256f). \n\nThis leaves it an open question what other function the epoché\nmay serve in the context of Husserl’s methodology. The most plausible\ninterpretation seems to be that “the only thing that is excluded\nas a result of the epoché is a certain naivety, the naivety of\nsimply taking the world for granted, thereby ignoring the contribution\nof consciousness (Husserliana, vol. 27/173)”\n(Zahavi 2017, p. 67; also cf. Landgrebe 1982a, pp. 26 ff), where\n“the suspension [of existential positings] in question is\nmerely propaedeutic and provisional” (Zahavi 2017, p. 58).\n\nOnly the method of universal epoché as introduced in\nIdeas seems to conflict with our externalist reading: if no\nextra-mental existence assumptions whatsoever are admitted at any\npoint, then phenomenologically there cannot be object-dependent\nintentional contents, as externalism would have it. By contrast, there\nmay be some such contents, even many of them, without intentional\ncontent generally having to be dependent on a particular extra-mental\nobject. Which leaves enough room for the method of\nepoché to apply to any given particular case, as will\nbecome clear in Section 6.\n6. Epoché, perceptual noema, hýle, time-consciousness and phenomenological reduction\n\nThe point of the local epoché can perhaps best be\nbrought out if we follow Husserl in applying it to the case of\nperceptual experience. The phenomenologist is supposed to perform his\nor her descriptions from a first-person point of view, so as\nto ensure that the respective item is described exactly as it is\nexperienced. Now in the case of perceptual experience one cannot, of\ncourse, both fall victim to and at the same time discover a particular\nperceptual error; it is always possible that one is subject to an\nillusion or even a hallucination, so that one’s perceptual\nexperience is not veridical. If one is hallucinating, there is really\nno object of perception. However, phenomenologically the experience\none undergoes is exactly the same as if one were successfully\nperceiving an external object.\n\nTherefore, the (adequacy of a) phenomenological description of a\nperceptual experience should be independent of whether for the\nexperience under investigation there is an object it represents or\nnot. Either way, there will at least be a perceptual content\n(if not the same content on both sides, though). It is this content\nthat Husserl calls the perceptual noema. Thanks to its noema,\neven a hallucination is an intentional act, an experience “as\nof” an object. Phenomenological description is concerned with\nthose aspects of the noema that remain the same irrespective of\nwhether the experience in question is veridical or not. Thus, our\nphenomenologist must not employ—he (or she) must\n“bracket”—his belief in the existence of the\nperceptual object.\n\nHowever, this lands him in a methodological dilemma. If, on the one\nhand, the phenomenologist leaves the “natural attitude”\nand brackets his corresponding existence-belief, he cannot at the same\ntime perform the perceptual experience he wishes to investigate. (This\nis the first horn of the dilemma.) For, as Husserl himself stresses\n(cf. Ideas, sec. 90, 109), the existence-belief is an\nindispensable part of the perceptual phenomenon: such experiences are\nessentially thetic, i.e., there can be no such thing as a\nperceptual experience without “belief-character” (cf.\n5th Logical Investigation, sec. 23). If, on the\nother hand, our phenomenologist makes use of that belief, then he is\nbound to violate the constraints put upon him by the local\nepoché: he cannot but fail to assume the\nphenomenological attitude. (This is the second horn.)\n\nThere are at least three possible ways out of this dilemma.\nFirst, the phenomenologist could choose the first horn of the\ndilemma, but analyse an earlier perceptual experience of his,\none that he now remembers. He just has to make sure here not to employ\nhis earlier (and perhaps still persisting) belief in the existence of\na perceptual object. Secondly, he could again decide in\nfavour of the first horn and analyse a perceptual experience that he\nmerely intuitively imagines himself to have. (For\nHusserl’s view on imagination see esp. Husserliana,\nvol. XXIII.) Thirdly, he could instead choose the second\nhorn, keep employing his existence-belief, but make a kind of\n“pragmatic ascent” and describe the perceptual\nexperience in such a way that the description, i.e., the speech\nact thus performed, does not presuppose the existence of a\nperceptual object. (The following sort of description may serve that\nfunction: “I am demonstratively identifying a so-and-so”;\n“I am performing an act of this-meaning under the aspect\nso-and-so”.) In any case, Husserl regards\n“bracketing” as what he calls the “neutrality\nmodification” of a positing act, to be distinguished both from a\ncorresponding supposition (hypothesis) and from what is commonly\nreferred to as suspension of judgment, as in a case of serious doubt\n(cf. Hua III/1, 247 ff). While in the latter case the subjective\nprobability may be 0.5, no degree of belief whatsoever can be assigned\nto an act of neutrality-modification (cf. Hua III/1, 252).\n\nIt is not entirely clear if Husserl considers all of these strategies\nto be admissible. The second one is certainly in line with the\nimportant methodological role he ascribes to “phantasy”,\ni.e., mere intuitive imagination, when it comes to eidetic reduction,\nwhich in turn constitutes an important part of the phenomenological\nmethod. The third strategy—pragmatic ascent—fits in well\nwith the way he uses to specify the common element of the noema of\nboth veridical perceptions and corresponding hallucinations (see,\ne.g., the first-person description of someone’s experience of\n“this blooming tree there in space” presented in sec. 90\nof Ideas; also see ibid., sec. 89f).\n\nNow we can apply the local epoché to specify the noema\nof both veridical perceptions and hallucinations so as to bring out\ntheir singularity. Already in his 1894 essay\n“Intentional Objects” (cf. Husserliana, vol.\nXXII; English translation of a somewhat different version of the essay\nin: Rollinger 1999) Husserl stressed that objectless representations\nsuch as hallucinations can in a sense be characterized as\n“representing an intentional object”, provided that this\ncharacterization is understood to be made “under an existential\nassumption”, as follows: “If the act of\nhallucination were veridical, it would successfully\nrepresent such-and-such an object (under such-and-such\naspects)”. Something similar goes with regard to the singularity\nof a hallucinatory experience’s noema: if such an experience\nwere veridical, it would, in virtue of its noema, represent a\nparticular perceptual object in all relevant possible worlds (see\nSection 3 above). Thus, we can provide an existentially\nneutral specification of the noema of a (veridical, illusory or\nhallucinatory) perceptual experience, just as local\nepoché demands, and still bring out the singular\ncharacter of their content that Husserl has done so much to uncover,\nespecially in his investigations into indexicality and the role of the\ndeterminable X in our constitution of spatio-temporal\nreality. The specification might run as follows: The noema of a\nperceptual experience i is such that either (1) there is an\nobject x that i represents in virtue of its noema,\nwhere x is to be regarded as the referent of i in\nall relevant possible worlds, or (2) there would be an object meeting\ncondition (1) if i were veridical. Condition (2) enables us\nto make sense of the behaviour of a speaker/thinker making\ncounterfactual assumptions about an object which he, unknowingly,\nmerely hallucinates, or of quantifying into modal statements about\nthat alleged object (cf. Beyer 2000, pp. 26–31). Notice that on\nthe above-proposed externalist reading of Husserl’s notion of\nintentional content, the noema will differ depending on whether\ncondition (1) or (2) is satisfied. Nevertheless, our noematic\nspecification meets the requirements of local epoché,\nas it does not rely on the existence of a particular perceptual\nobject. If there is no such object, condition (2) will be\nsatisfied—provided that we are dealing with a perceptual\nexperience. The rationale behind condition (2) is that even in the\nnon-veridical case an individual notion (a mental file) and\nconsequently a unified series of intentional horizons gets activated,\non the basis of the same sensory material, or hýle\n(see the following paragraph), as in the veridical case.\n\nIt should be noted that according to Husserl the complete noema of a\nperceptual experience contains an additional element, to be\ndistinguished from the intentional content, notably its\n“thetic” or “positing” character, i.e., its\nquality. Moreover, the manner in which the perceptual object (if any)\npresents (or would present) itself includes the sensual matter or\n“hýle” underlying the respective\nperceptual experience. Typical examples of hýle\ninclude sense impressions (i.e., sensory experiences), as opposed to\nthe perceptual experiences based upon them. Thus, to take\nJastrow’s/Wittgenstein’s duck-rabbit head as an example,\nthe perception of a duck-head may be founded in the same sense\nimpressions or hýle as the perception of a rabbit-head\n(cf. Føllesdal 1988, pp. 108f). (For Husserl all remaining\nintuitive acts involve something analogous (in a sense needing further\nexplanation) to hýle, which he labels as their\n“intuitive representational content”. In the case of acts\nof phantasy, he refers to the intuitive representational content as\n“phantasma”.) Husserl regards sense impressions\nas non-intentional (and thus non-conceptual) in nature. It is only the\nintentional content of a perceptual experience that\n“forms” its underlying hýle so as to yield\nthe perception of an object (for critical discussion see Hopp 2011,\nesp. sec. 7.3). Husserl compares this process of intentional\n“forming” of sensual matter to the interpretation of a\nlinguistic expression, but this comparison should not mislead us to\nconclude that he subscribes to a sense-datum theory of perception (see\nSection 2 above, headword: mental image theory). Rather, his view on\nperception is best characterized as a sophisticated version of direct\n(i.e., non-representationalist) realism.\n\nFinally, we should note that on Husserl’s view there is a\nfurther important dimension to perceptual experience, in that it\ndisplays a phenomenological deep- or micro-structure constituted by\ntime-consciousness (Husserliana, vol. X, XXXIII;\nalso see Miller 1984). This merely seemingly unconscious structure is\nessentially indexical in character and consists, at a given time, of\nboth retentions, i.e., acts of immediate memory of what has\nbeen perceived “just a moment ago”, original\nimpressions, i.e., acts of awareness of what is perceived\n“right now”, and protentions, i.e., immediate\nanticipations of what will be perceived “in a moment”. It\nis by such momentary structures of retentions, original impressions\nand protentions that moments of time are continuously constituted (and\nreconstituted) as past, present and future, respectively, so that it\nlooks to the experiencing subject as if time were permanently flowing\noff.\n\nThis deep-structure of intentional consciousness comes to light in the\ncourse of what Husserl calls the “phenomenological\nreduction” (Husserliana, vol. XIII, pp. 432 ff), which\nuses the method of epoché in order to make coherent\nsense, in terms of the essential horizon-structure of consciousness,\nof the transcendence of objective reality. The most global form of\nepoché is employed when this reality in total is\nbracketed. There is still something left at this point, though, which\nmust not, and cannot, be bracketed: the temporal flow of one’s\n“present” experience, constituted by current retentions\nand original impressions. These recurrent temporal features of the\nhorizon-structure of consciousness cannot be meaningfully doubted.\nThey provide a kind of hýle for “inner\nperception” and corresponding reflective judgements, but it is a\nvery special kind of hýle: one that is a proper part\nof the “perceived” item and does not get conceptually\n“formed” in the course of perception (reflecting the fact\nthat unlike spatio-temporal objects, lived experiences “do not\nadumbrate themselves”; cf. Husserliana, vol. III/1, p.\n88). Hence, there is no epistemically problematic gap between\nexperience and object in this case, which therefore provides an\nadequate starting point for the phenomenological reduction, that may\nnow proceed further by using holistic justification strategies. After\nall, intentional consciousness has now been shown to be coherently\nstructured at its phenomenologically deepest level.\n7. Passivity vs. activity\n\nHyletic data are arguably experiences, in the sense of\n“non-intentional”, “pre-reflective lived experiences\nthat can be grasped only abstractly in reflection” (Gallagher\n2011, p. 3). At the same time, at least some of them (the\n“kinaesthetic” sensations; cf. Zahavi 2003, p. 107) belong\nto the sphere of bodily passivity: they “serve in the\nconstitution of the experiencing body (the body-as-subject)”\n(Gallagher 2011, p. 4; for the distinction between\n“body-as-subject” and “body-as-object”, cf.\nZahavi 2003, pp. 101–106). The notion of passivity is given\nparticular emphasis both in the context of Husserl’s\ngenetic-phenomenological analyses, focussing on the dynamic aspects of\nself- and object-constitution, and in his reply to the\n“objection of solipsism” against transcendental\nphenomenology developed in the 5th of his Cartesian\nMeditations (see Section 10 below). In Experience and\nJudgement Husserl stresses “that the\ndistinction between activity and passivity is not a rigid one, that it\ncannot be a matter of terms that can be defined once and for all, but\nonly of means of description and contrast, the meaning of which must\noriginally be recreated in each individual case with regard to the\nconcrete situation of the analysis” (Husserl 1939, p. 119). On a\nplausible (i.e., epistemological) interpretation, a unit of\nconsciousness in which something constitutes itself is to be described\nas “passive” just in case this constitution occurs\nindependently of any simultaneous execution of the subject’s\nwill, e.g., its will to acquire knowledge; otherwise, it is to be\ndescribed as “active”. Passive constitution is sometimes\nreferred to as “pre-constitution”, as it is an\nindispensible precondition for active constitution (cf. Landgrebe\n1982b, p. 72.) According to the above interpretation, active\nconstitution in the form of judgements in turn initiates beliefs as\npersonal “acquisitions (Erwerbe)” or\n“habitualities” that help pre-constitute the further\ncourse of experience, thus forming a “secondary” level of\npassivity (cf. ibid.; for an overview of Husserl’s\n“phenomenology of habituality” cf. Moran 2011; Caminada\n2019 investigates into Husserl’s view of habit against the\nbackground of the re-edition of Ideas II on the basis of his\noriginal texts; see esp. ch. 10f). \n\nIn the context of the analysis of the constitution of individual\nperceptual objects, the spatio-temporally structured “field of\npre-givenness” (Husserl 1939, p. 74) against whose background\nthe object stands out contrastively (ready to catch the\nperceiver’s attention) counts as primarily passive (cf. Wu 2021,\nsec. 58). This field is structured by “syntheses of\nassociation” between (hyletic adumbrations of) similar and\ndissimilar elements (cf. Wu 2020, p. 189). These associative syntheses\nare such that (in the case at issue) one of those elements, e.g. a\ncolored three-dimensional (and thus non-hyletic; cf. Lee 1993, p. 99)\ndot, serves as sensual “stimulus” by “instinctively\ndriving” (Husserliana Mat., vol. VIII, p. 326) the\nperceiver to attend to it unwillingly, thus passively\n“affecting” the perceiver (Husserliana, vol.\nXXXIII, pp. 275f; cf. Yamaguchi 1982; Lee 1993; also cf. Mensch 1997;\nand Brudzinska 2020, containing a detailed comparison with Freud). If\nthe stimulus then catches the subject’s attention, it can\nsubsequently be “explicated” perceptually according to its\nobjectual determinations, in which case the subject enters “the\nfirst main stage of the striving for knowledge, i.e. the\npre-predicative or receptive stage” (Wu 2021, p.\n190). Thus, passivity precedes receptivity, which in turn precedes the\nsecond main stage, i.e. the “predicative” stage –\nthe level of the “spontaneity” of judgement (cf. Wu 2021,\np. 191). Both of these stages (the receptive and the spontaneous one)\nconstitute the level of cognitive “activity”. At the\nsecond stage, the processing of mental files such as “individual\nnotions” (see Section 4 above), guided by the subject’s\n“will to knowledge” (Husserl 1939, p. 92), is located. In\nExperience and Judgement Husserl calls the\nperceptual acts motivating predicative file entries (i.e., habitual\nyet variable empirical beliefs) “explications” of\nperceptual objects (cf. Husserl 1939, ch. 2). Such explications are\nfounded in “attention as a tendency of the ego”\n“toward the intentional object” (Husserl 1939, p. 85).\n(For the multifarious use of the term “attention” in\nHusserl cf. the introduction to Husserliana, vol. XXXVIII, p.\nXXXII; see also the entry on “Aufmerksamkeit” in Gander\n2010, pp. 36ff, and the secondary literature cited there, as well as\nBreyer 2011, ch. V, and Wehrle 2013, ch. I.)\n\nNote that while Husserl sometimes describes the field of pre-givenness\nin which pre-predicative and predicative acts are founded as\n“originarily passive” (cf. Husserl 1939, p. 300), he holds\nthat this field is itself pre-constituted at an even more basic level\nof constitution, also sometimes (in another context) described as\noriginarily or primarily passive. This more basic level is the\n“absolutely” originary one of (1) bodily and (2) temporal\npre-reflective self-consciousness, at which (1) the spatial and (2)\nthe temporal aspects of the field, respectively, constitute themselves\n(cf. Wu 2021, pp. 187f). This pre-constitution occurs automatically or\n“instinctively”, by “association” of\n“acquired” affective “drives” and\nteleologically directed “courses of drives\n(Triebverläufe)” rather than mere “(courses\nof) ideas”, such that “the ego as the subject of the drive\n[…] is awakened” (transcr. A VII 13, p. 20, cited after\nYamaguchi 1982, p. 57). If the subject then acquires an according\naffective “habituality”, then a new level of\n“secondary passivity” has been constituted (cf. Yamaguchi\n1982, p. 56). For example, the above-mentioned colored dot is then\nready to be perceived as located, at ‘this current moment’\nof (internal) time, at ‘that position’ in ‘my\nown’ (egocentric) perceptual field; it “affects” the\nsubject accordingly, thus serving as a visual stimulus. This\nperceptual field is regarded as ‘my own’ and ‘my\ncurrent’ one in virtue of its pre-constitution in pre-reflective\nself-awareness, in which both the subject’s stream of\nconsciousness and its living body (as it would appear in the\n“sphere of ownness”, i.e. independently of intersubjective\nexperience) constitute themselves, notably by both internal\ntime-consciousness (see Sections 4 and 6 above; cf. Held 1966) and the\ninstinctive “originary kinestheses” (Husserliana,\nvol. XV, p. 385) or “kinesthetic syntheses” associated\nwith the bodily movements involved in perception (cf. Landgrebe 1982b,\npp. 81 ff; also cf. Dodd 1997 for a further analysis of\nHusserl’s phenomenology of the body, taking into account the\nrich material to be found in Ideas II, but also in Thing\nand Space and the 5th of the Cartesian\nMeditations; and Taipale 2014, stressing the importance of the\nliving body for the different levels of constitution in Husserl; more\nrecent literature on embodiment in Husserl, covering topics like the\nconstitution of the ego’s own living body and the living bodies of\nothers, also includes Behnke 1996; Heinämaa 2011, 2018; Moran and\nJanssen, eds., 2018; Carr 2019; and Jardine 2022, ch. 5f).\n\nOn (one reading of) Husserl’s view, these very basic levels or\nstrata underlying self- and world-constitution are still\n“anonymous”, i.e. not available through\n(self-)“reflection” (cf. Landgrebe 1982b, p. 76), but only\nthrough the “genetic-phenomenological” method of\n“deconstruction” or “dismantling\n(Abbau)”. Dismantling starts from a given noematic\nsense, like ‘this coloured dot’, and tells a story about\nhow (the intentionality correlated with) this sense could have come\nabout, to which kinds of “subjective sources” or origins\nit implicitly refers back (as their “sedimentation”),\ngiven the transcendental conditions for the possibility of the\ncorresponding forms of intentionality (cf. Husserl 1939, p. 47). This\ndismantling leads back to the associative “originary\npairing” of ‘my own’, originarily-kinesthetic\npre-constituted living body, on the one hand, and a foreign one\naffecting ‘my own’, on the other, due to similarities\nwhich passively drive the “first ‘ego’ of the\nreduction” (Husserliana, vol. XV, p. 586) to\nco-constitute ‘my own’ and the ‘other’ bodily\nego by accordingly motivated “apperceptive transfer”\n(Husserliana, vol. I, 140) of the pre-constituted sense\n‘this living body of mine’ to the similarly behaving body\n‘over there’ (cf. A. D. Smith 2003, pp. 224–251).\nThis co-constitution forms the basis of, first, the co-constitution of\nthe alter ego as a personal human being and (on this basis; cf.\nHusserliana, vol. XIV, p. 418) myself as the same kind of\nbeing and, secondly, the constitution objective reality. The (analysis\nof the) constitution of the latter is sketched in Section 10 below.\nHusserl supposes that its passive pre-constitution\n“‘instinctively’ predeliniates the constitution of\nthe whole world for me”, a teleological “facticity”\nperhaps deriving from “God” (Husserliana, vol.\nXV, p. 385; see Held 2010). (In other words, the spade bends back\nhere.)\n8. Communication, sociality, personhood and personal values\n\nAs for the constitution of oneself as a person, Husserl\n(Husserliana, vol. XIV, pp. 170 ff) holds that it occurs,\namong other things, in connection with communicative or social acts\n(“Mitteilungen”, “soziale\nAkte”), which are pre-constituted by the mutual drives and\ninstincts involved in the education of small children who confidently\n“imitate” the linguistic behavior of educators\n“loving” them like parents (Husserliana, vol.\nXIV, 165f). (For additional aspects of the constitution of personhood,\nsee the last two paragraphs of this section and the literature cited\nthere. Further elements of Husserl’s view of personal love, esp.\nconcerning his ethics, are discussed in Melle 2002; Römer 2011;\nKern 2019, sec. 22f; Crespo 2019; Heinämaa 2020.) The relevant\ncommunicative acts are “I-thou acts”, in which the utterer\nempathetically ascribes to the addressee the empathetic ascription of\nthe “intention (Absicht)” to motivate the\naddressee, by means of his or her recognition of that very intention\n(cf. Husserliana, vol. IV, p. 192), to behave a certain way\n(Husserliana, vol. XIV, 166f in the light of\nHusserliana, vol. IV, p. 192); where utterer and addressee\nsimultaneously perceive each other (Husserliana, vol. XIV, p.\n167). Thus, these acts are based on “reciprocal empathy”\n(Zahavi 2018, p. 746), notably on “iterated, reflexive empathy:\nI empathetically ascribe to the Other(s) an\nempathetic ascription of an intention to me”\n(Beyer 2018, p. 100). In I-thou acts, the “originarily social\nI-thou relationship” is constituted, in which ego and alter ego\ndeliberately and reflexively motivate each other to display certain\npractical forms of behavior (Husserliana, vol. XIV, pp.\n171f). It is at this stage that the subject constitutes itself as a\nperson (belonging to the “world of persons”) by gaining\n“personal ‘self-consciousness’” of the sort\njust described in the course of I-thou acts (Husserliana,\nvol. XIV, pp. 171, 175f). This enables the subject to see him- or\nherself as subject to acts of self-determination: “If I\nagree [Vereinbare ich mich] with an other [...], the other\ndetermines me to determine myself to take on this or that [commitment;\nCB]” (Husserliana, vol. XIV, p. 180). (For some other\naspects of the role of communicative acts in Husserl’s analyses of\nconstitution see, e.g., Zahavi 2003, ch. 3, sec. C–D; Caminada\n2019, esp. ch. 6., sec. 2f.; also see Sections 9f below.)\n\nIt is by self-determination through “position-taking”, in\nthe form of “judgement” or “will”, that the\nsubject constitutes itself as an individual person. (For the\nfollowing cf. Beyer 2013, pp. 94, 110f. For a more recent analysis,\nalso taking into account the new critical edition of Ideas\nII, see Jardine 2022. Also see Jacobs 2010, pp. 353–356.)\nWhat distinguishes an individual personal subject from other such\nsubjects is a “total” personal “style and\nhabitus”, including “a certain pervasive unitary style in\nthe way [the subject] decides by judgement and will”\n(Husserliana, vol. IV, §61 p. 277; Husserl 1989, p. 290;\nalso cf. Husserliana, vol. IV, §59, p. 256). This latter\nstyle depends on the subject’s habits to let itself be determined by\nvalue-motives, that is, by emotional valuings\n(“Wertnehmungen”; cf. Husserliana, vol.\nXXXVII, p. 72) and, sometimes, also by accordingly motivated explicit\nvalue judgements, which concern the subject’s volitional motives,\nregarding which the free subject says ‘yes’ or\n‘no’. (These valuings, which motivate the subject’s\nwill, stand to passive emotional affections as full-fledged perceptual\nacts stand to their underlying sensual hyle; they can be looked upon\nas nonveridical or veridical, and, in the latter case, more or less\nadequate perceptions of (instances of) values; cf.\nHusserliana, vol. IV, sec. 44, p. 215, sec. 45, pp. 227f;\nHusserliana, vol. XXXVII, p. 326.) \n\nIn the former case (the subject says ‘yes’) the respective\nmotive becomes “a position-taking that issues from [the\nsubject’s] own ego”, as opposed to a mere stimulus coming from\noutside; the subject “annexes” it on his or her “own\naccord” (eignet es sich selbsttätig an), i.e. it\ninternalizes the corresponding value (Husserliana, vol. IV,\n§60, p. 269; Husserl 1989, p. 281). This enables the subject to\nget to know itself as an individual person, i.e. with regard to its\n“personal character-traits” (Husserliana, vol.\nXIV, p. 18), notably by learning “how such and such motives\n[...] would affect me, how I, as the one that I am, would act\nand could act, how I could, and how I could not, judge, value and\nwill” (Husserliana, vol. IV, §60, p. 265f; Husserl\n1989, p. 278). Husserl’s conception of individual personhood\nalso underlies his ethics (see end of Section 9).\n9. Empathy, intersubjectivity and lifeworld; ethics and value theory\n\nOne of the main themes of transcendental phenomenology is\nintersubjectivity. Among other things, it is discussed in considerable\ndetail in the 5th of the Cartesian Meditations and\nin the manuscripts published in vol. XIII–XV of Husserliana\n(see Kern 2019 for an overview). (A particularly\nimportant critique of Husserl’s view on intersubjectivity from a\nsociological viewpoint is found in Schütz 1966.)\n\nAccording to Husserl, intersubjective experience plays a fundamental\nrole in our constitution of both ourselves as objectively existing\nsubjects, other experiencing subjects, and the objective\nspatio-temporal world. Transcendental phenomenology attempts to\nreconstruct the rational structures underlying—and making\npossible—these constitutive achievements.\n\nFrom a first-person point of view, intersubjectivity comes in when we\nundergo acts of empathy. Intersubjective experience is\nempathic experience; it occurs in the course of our conscious\nattribution of intentional acts to other subjects, in the course of\nwhich we put ourselves into the other one’s shoes. In order to\nstudy this kind of experience from the phenomenological attitude, we\nmust bracket our belief in the existence of the respective target of\nour act-ascription qua experiencing subject and ask ourselves\nwhich of our further beliefs justify that existence-belief as well as\nour act-ascription. It is these further beliefs that make up the\nrational structure underlying our intersubjective experience. Since it\ntakes phenomenological investigation to lay bare these beliefs, they\nmust be first and foremost unconscious when we experience the world in\nthe natural attitude.\n\nAmong the fundamental beliefs thus uncovered by Husserl is the belief\n(or expectation) that a being that looks and behaves more or less like\nmyself, i.e., displays traits more or less familiar from my own case,\nwill generally perceive things from an egocentric viewpoint\nsimilar to my own (“here”, “over there”,\n“to my left”, “in front of me”, etc.), in the\nsense that I would roughly look upon things the way he does if I were\nin his shoes and perceived them from his perspective. This belief\nallows me to ascribe intentional acts to others immediately or\n“appresentatively”, i.e., without having to draw an\ninference, say, by analogy with my own case. So the belief in question\nmust lie quite at the bedrock of my belief-system. It forms a part of\nthe already pregiven (and generally unreflected) intentional\nbackground, or “lifeworld” (cf. Crisis), against\nwhich my practice of act-ascription and all constitutive achievements\nbased upon that practice make sense in the first place, and in terms\nof which they get their ultimate justification.\n\nHusserl’s notion of lifeworld is a difficult (and at the same\ntime important) one. It can roughly be thought of in two different\n(but arguably compatible) ways: (1) in terms of belief and (2) in\nterms of something like socially, culturally or evolutionarily\nestablished (but nevertheless abstract) sense or meaning.\n\n(1) If we restrict ourselves to a single subject of experience, the\nlifeworld can be looked upon as the rational structure underlying his\n(or her) “natural attitude”. That is to say: a given\nsubject’s lifeworld consists of the beliefs against which his\neveryday attitude towards himself, the objective world and others\nreceive their ultimate justification. (However, in principle not even\nbeliefs forming part of a subject’s lifeworld are immune to\nrevision. Hence, Husserl must not be regarded as an epistemological\nfoundationalist; see Føllesdal 1988.)\n\n(2a) If we consider a single community of subjects, their common\nlifeworld, or “homeworld”, can be looked upon, by first\napproximation, as the system of senses or meanings constituting their\ncommon language, or “form of life” (Wittgenstein), given\nthat they conceive of the world and themselves in the categories\nprovided by this language.\n\n(2b) If we consider subjects belonging to different communities, we\ncan look upon their common lifeworld as the general framework, or\n“a priori structure”, of senses or meanings that allows\nfor the mutual translation of their respective languages (with their\ndifferent associated “homeworlds”) into one another.\n\nThe term “lifeworld” thus denotes the way the members of\none or more social groups (cultures, linguistic communities) use to\nstructure the world into objects (Husserliana, vol. VI, pp.\n126–138, 140–145). The respective lifeworld is claimed to\n“predelineate” a “world-horizon” of potential\nfuture experiences that are to be (more or less) expected for a given\ngroup member at a given time, under various conditions, where the\nresulting sequences of anticipated experiences can be looked upon as\ncorresponding to different “possible worlds and\nenvironments” (Husserliana, vol. III/1, p. 100). These\nexpectations follow typical patterns, as the lifeworld is fixed by a\nsystem of (first and foremost implicit) intersubjective standards, or\nconventions, that determine what counts as “normal” or\n“standard” observation under “normal”\nconditions (Husserliana, vol. XV, pp. 135 ff, 142) and thus\nas a source of epistemic justification. Some of these standards are\nrestricted to a particular culture or “homeworld”\n(Husserliana, vol. XV, pp. 141 f, 227–236), whereas\nothers determine a “general structure” that is “a\npriori” in being “unconditionally valid for all\nsubjects”, defining “that on which normal Europeans,\nnormal Hindus, Chinese, etc., agree in spite of all relativity”\n(Husserliana, vol. VI, p. 142). Husserl quotes universally\naccepted facts about “spatial shape, motion,\nsense-quality” as well as our prescientific notions of\n“spatiotemporality”, “body” and\n“causality” as examples (ibid.). These conceptions\ndetermine the general structure of all particular thing-concepts that\nare such that any creature sharing the essential structures of\nintentional consciousness will be capable of forming and grasping\nthem, respectively, under different lifeworldly conditions.\n\nThe notion of lifeworld was already introduced in the posthumously\npublished second volume of Ideas, under the heading of\n“Umwelt”, to be translated as “surrounding\nworld” or “environment”. Husserl there characterizes\nthe environment as a world of entities that are\n“meaningful” to us in that they exercise\n“motivating” force on us and present themselves to us\nunder egocentric aspects. Any subject taking the “personalistic\nattitude” builds the center of an environment containing such\nobjects. The personalistic attitude is “the attitude we are\nalways in when we live with one another, talk to one another, shake\nhands with one another in greeting, or are related to one another in\nlove and aversion, in disposition and action, in discourse and\ndiscussion” (Husserliana, vol. IV, p. 183; Husserl\n1989, p. 192). The central notion of Husserl’s\n“Umweltanalyse” is the concept of motivation, whose\napplication he explains as follows: “how did I hit upon that,\nwhat brought me to it? That questions like these can be raised\ncharacterizes all motivation in general” (Husserliana,\nvol. IV, p. 222; Husserl 1989, p. 234, with translation change). The\nentities exercising motivating force on us owe their corresponding\n“meaning” or significance to certain forms of intentional\nconsciousness and intersubjective processes. Thus, to quote one of\nHusserl’s examples, “I see coal as heating material; I\nrecognize it and recognize it as useful and as used for heating, as\nappropriate for and as destined to produce warmth. [...] I can use [a\ncombustible object] as fuel; it has value for me as a possible source\nof heat. That is, it has value for me with respect to the fact that\nwith it I can produce the heating of a room and thereby pleasant\nsensations of warmth for myself and others. [...] Others also\napprehend it in the same way, and it acquires an intersubjective\nuse-value and in a social context is appreciated and is valuable as\nserving such and such a purpose, as useful to man, etc.”\n(Husserliana, vol. IV, pp. 186f; Husserl 1989, pp. 196f).\n\nOn Husserl’s view, it is precisely this\n“subjective-relative lifeworld”, or environment, that\nprovides the “grounding soil” of the more objective world\nof science (Husserliana, vol. VI, p. 134), in the twofold\nsense that (i) scientific conceptions owe their (sub-)propositional\ncontent and thus their reference to reality to the prescientific\nnotions they are supposed to “naturalize” and that,\nconsequently, (ii) when things get into flux in science, when a crisis\noccurs, all that is left to appeal to in order to defend new\nscientific approaches against their rivals is the prescientific\nlifeworld, as manifested in our according intuitive acceptances (for\nreferences cf. Føllesdal 1990a, pp. 139f). This view offers an\nalternative to the “naturalistic” stance taken by many\nanalytic philosophers today.\n\nOne of the constitutive achievements based upon my lifeworldly\ndetermined practice of act-ascription is my self-image as a\nfull-fledged person existing as a psycho-physical element of the\nobjective, spatio-temporal order. This self-image can be justified by\nwhat Edith Stein, in a PhD thesis on empathy supervised by Husserl\n(Stein 1917), has labelled as iterated empathy, where I put\nmyself into the other subject’s shoes, i.e., (consciously)\nsimulate him, under the aspect that he (or she) in turn puts himself\ninto my shoes. In this way, I can figure out that in order\nfor the other subject to be able to ascribe intentional acts to me, he\nhas to identify me bodily, as a flesh-and-blood human being,\nwith its egocentric viewpoint necessarily differing from his own. This\nbrings home to me that my egocentric perspective is just one among\nmany, and that from all foreign perspectives I appear as a physical\nobject among others in a spatio-temporal world. So the following\ncriterion of subject-identity at a given time applies both to myself\nand to others: one human living body, one experiencing subject.\nHowever, Husserl does not at all want to deny that we also ascribe\nexperiences, even intentional ones, to non-human animals. This becomes\nthe more difficult and problematic, though, the less bodily and\nbehavioural similarity obtains between them and ourselves.\n\nBefore finally turning to the question of what\n“objectivity” amounts to in this connection, let us notice\nthat in Husserl’s eyes something like empathy also forms the\nbasis of both our practical, aesthetical and moral evaluations and of\nwhat might be called intercultural understanding, i.e., the\nconstitution of a “foreign world” against the background\nof one’s own “homeworld”, i.e., one’s own\nfamiliar (but, again, generally unreflected) cultural heritage (cf.\nHusserliana, vol. XV). Husserl studied many of these\nphenomena in detail, and he even outlined the beginnings of a\nphenomenological ethics and value theory (cf. Husserliana,\nvol. XXVIII, XXXVII). In this context, he formulates a\n“categorical imperative” that makes recourse to the notion\nof lifeworld, or environment, as follows: Always act in such a way\nthat your action contributes as well as possible to the best (the most\nvaluable) you recognize yourself to be able to achieve in your life,\ngiven your individual abilities and environment (cf.\nHusserliana, vol. XXXVII, pp. 251 ff). (This version of the\n“categorical imperative” stems from Husserl’s post-war\nlectures on ethics and value theory. Earlier versions differ\nsignificantly; for the development of Husserl’s thought on this and\nrelated issues, see, e.g., Melle 1991; Peucker 2008; Donohoe 2016, ch.\n4; Drummond 2018; and Crespo 2021.)\n\nNote that on Husserl’s view the will of a free agent, capable of\nfollowing this imperative, is always already embedded in a\n“volitional context” predelineating the open “future\nhorizon” of a “full individual life” that the agent\nis currently able to lead (Husserliana, vol. XXXVII, p. 252),\nthus qualifying as a dynamic intentional structure. This individual\nlife corresponds to the agent‘s self-determination as an\nindividual person (see Section 8 above). The valuings underlying this\nself-determination can be veridical, and thus suitable for motivating\nobjectively valid evaluative judgments, because their correlates, i.e.\nvalues, are part of the ideal (but still intersubjectively\nconstituted) spiritual world (Husserliana, vol XXXVI, pp. 217\nff). These values stand in hierarchical relations to each other,\ngoverned by laws to be studied in what Husserl calls formal axiology\n(ibid., pp. 226–232). Value-perception in the form of emotional\nvaluing thus allows for a priori insights. It is such insights that\ndetermine the good will, in that the latter orients itself by the\nhighest values the subject, on reflection, including a priori\nreflection, based on emotion, recognizes him- or herself to be able to\nrealize in life, given his or her abilities and environment (for the\npresent paragraph cf. Beyer 2013, sec. 1; for more detailed analyses\nof Husserl’s ethics and value theory see, e.g., Luft 2010, the\ncontributions to Luft, ed., 2011 and the literature cited there, as\nwell as the secondary literature cited at the end of the foregoing\nparagraph.)\n10. The intersubjective constitution of objectivity and the case for “transcendental idealism”\n\nEven the objective spatio-temporal world, which represents a\nsignificant part of our everyday lifeworld, is constituted\nintersubjectively, says Husserl. (The same holds true for its\nspatio-temporal framework, consisting of objective time and space.)\nHow so? Husserl starts (again, from a first-person viewpoint) from a\n“solipsistic” abstraction of the notion of a\nspatio-temporal object which differs from that notion in that it does\nnot presuppose that any other subject can observe such an object from\nhis (or her) own perspective. His question is what justifies us (i.e.,\neach of us for him- or herself) in the assumption of an objective\nreality consisting of such objects, given only this\n“solipsistic” conception of a spatio-temporal thing (or\nevent) as our starting point. On Husserl’s view, “the\ncrucial further step” in order to answer this question consists\nin disclosing the dimension that opens up when the epistemic\njustification, or “motivation”, of intersubjective\nexperience, or empathy, is additionally taken into account and made\nexplicit (Husserliana, vol. VII, p. 435).\n\nRoughly, his argument goes as follows. In order for me to be able to\nput myself into someone else’s shoes and simulate his (or her)\nperspective upon his surrounding spatio-temporal world, I cannot but\nassume that this world coincides with my own, at least to a large\nextent; although the aspects under which the other subject represents\nthe world must be different, as they depend on his own egocentric\nviewpoint. Hence, I must presuppose that the spatio-temporal objects\nforming my own world exist independently of my subjective perspective\nand the particular experiences I perform; they must, in other words,\nbe conceived of as part of an objective reality. This result\nfits in well with—in fact, it serves to\nexplain—Husserl’s view, already stressed in\nIdeas, that perceptual objects are “transcendent”\nin that at any given moment they display an inexhaustive number of\nunperceived (and largely even unexpected) features, only some of which\nwill become manifest—will be intuitively presented—in the\nfurther course of observation.\n\nHowever, according to Husserl this does not mean that the objective\nworld thus constituted in intersubjective experience is to be regarded\nas completely independent of the aspects under which we represent the\nworld. For on his view another condition for the possibility of\nintersubjective experience is precisely the assumption that by and\nlarge the other subject structures the world into objects in the same\nstyle I myself do. It is partly for this reason that Husserl can be\nsaid to adhere to a version of both “realism” and\n“idealism” at the same time.\n\nAnother, related, reason is that Husserl’s argument for realism\nis developed in a context in which he defends what he refers to as\n“transcendental idealism” (a terminological choice he\nwould later regret; see Føllesdal 1990a, p. 128). During the\nyears in which his transcendental phenomenology took shape, he\ndeveloped a number of “proofs” of this position, most of\nwhich are based upon his conception of a “real\npossibility” regarding cognition or the acquisition of\nknowledge. By a “real possibility”, Husserl understands a\npossibility that is such that “something—more or\nless— ‘speaks in favour of it’”\n(Husserliana, vol. XX/1, p. 178). Real possibilities are, in\nother words, conceived of as more or less (rationally)\nmotivated possibilities; and Husserl understands motivation\nin such a way that it is always someone who is motivated a\ncertain way (cf. Husserliana, vol. IV, p. 222). This is why\nHusserl subscribes to the following dependency thesis: The\nreal possibility to acquire (empirical) knowledge regarding a\ncontingent object A (possible world, individual thing, state of\naffairs involving such thing; cf. Husserliana, vol. XXXVI,\npp. 139f) “requires” an “epistemic subject”,\nwhich “either experiences A, or acquires knowledge regarding A\non the basis of experience, or else has the practical possibility (or\nthe practical ability) to experience A and acquire knowledge regarding\nit” (Husserliana, vol. XXXVI, p. 139). Husserl also\nadheres to the following correlation thesis with regard to\nempirical reality and real epistemic possibility: If a contingent\nobject A is real (really exists), then the real (as opposed to the\nmerely logical) possibility obtains to acquire knowledge regarding A\n(cf. Husserliana, vol. XXXVI, p. 138, l. 35–36). From\nthese two propositions—the dependency and the correlation\nthesis—he derives the conclusion that the existence of a\ncontingent object A requires “the necessary co-existence of a\nsubject either acquiring knowledge” regarding A “or having\nthe ability to do so” (Husserliana, vol. XXXVI, pp.\n139f). This is nothing but “[t]he thesis of transcendental\nidealism [...]: A nature without co-existing subjects of possible\nexperience regarding it is unthinkable; possible subjects of\nexperience are not enough” (Husserliana, vol. XXXVI, p.\n156).\n\nWhy are actual subjects of experience supposed to be\nnecessary? Husserl’s answer refers to the notion of\nfull epistemic justification, or full degree of real\npossibility (with regard to empirical knowledge): “In order for\n[a thing of nature] to really exist, and thus in order for the\nassumption that it exists to be reasonable or justified not merely in\na restricted but rather in an unrestricted way, i.e. to the fullest\nextent, there must be an actual ego in whose experiences [...] the\nbeing of the thing manifests itself [...].”\n(Husserliana, vol. XXXVI, pp. 76f). Husserl takes this notion\nto be applicable (as far as empirical consciousness is concerned) in\ncase of truth only. Thus, in sec. 16 of Formal and Transcendental\nLogic he first equates “truth” with “genuine\nknowledge” which is “repeatable by any [...] rational\nbeing” (Husserliana, vol. XVII, p. 46) and then makes\nthe (somewhat weaker) claim that truth and such knowledge are\n“correlated” (Husserliana, vol. XVII, p. 47).\nThis conception of (empirical) truth, which is already to be found in\nLogical Investigations, has been compared to ideal\nverificationism (cf. Soldati 1994, p. 119) and to Putnam’s\ninternal realism (cf. Beyer 2020, p. 69).\n\nHusserl seems to regard real possibilities as epistemic dispositions\n(habitualities), or abilities, that require an actual\n“substrate” (cf. Husserliana, vol. XXXVI, p.\n139). At the same time, he stresses that “surely no human being\nand no animal” must exist in the actual world (adding that their\nnon-existence would however already result in a “change of the\nworld”) (cf. Husserliana, vol. XXXVI, p. 121). One way\nto make sense of this would be to weaken the dependency thesis, and\nthe requirement of an actual substrate, and to merely require what\nmight be called real higher-order possibilities—possibilities\nfor acquiring epistemic dispositions in counterfactual (or actual)\ncases where epistemic subjects would be co-existing—that may\nremain unactualized but could be actualized by someone properly taking\ninto account a multitude of individual epistemic perspectives, by\nmeans of intersubjective experience. But even under this\nreconstruction there remains a sense in which the criteria of real\npossibility and reality constitution, and the corresponding structure\nof the real world, are dependent on an “ego”, on\nHusserl’s view: What counts as a real possibility, or as\nepistemically justified, is dependent on the phenomenological subjects\nreflecting about such counterfactual cases in the methodological\ncontext of the transcendental reduction and the results they arrive at\nin this context.\n",
    "bibliography": {
        "categories": [
            "<a name=\"PriLit\">Primary Literature</a>",
            "<a name=\"SecLit\">Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a name=\"PriLit\">Primary Literature</a>": [
                "</h3>\n<p>\nThe collected works of Husserl were published over the course of\nseveral years, starting in 1950, in <em>Husserliana: Edmund\nHusserl—Gesammelte Werke</em>, The Hague/Dordrecht:\nNijhoff/Kluwer. The following works by Husserl have been translated\ninto English, and they are listed in the chronological order of the\npublication dates of the German originals (if these were originally\npublished).</p>\n<ul class=\"hanging\">",
                "1900/1 [2nd, revised edition 1913], <em>Logical\nInvestigations</em>, trans. J. N. Findlay, London: Routledge\n1973.",
                "1910, “Philosophy as Rigorous Science,” trans. in Q.\nLauer (ed.), <em>Phenomenology and the Crisis of Philosophy</em>, New\nYork: Harper 1965.",
                "1913, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—First Book: General Introduction to\na Pure Phenomenology</em>, trans. F. Kersten. The Hague: Nijhoff 1982\n(<strong>= <em>Ideas</em></strong>).",
                "1929, <em>Formal and Transcendental Logic</em>, trans. D. Cairns.\nThe Hague: Nijhoff 1969.",
                "1931, <em>Cartesian Meditations</em>, trans. D. Cairns, Dordrecht:\nKluwer 1988.",
                "1939, <em>Experience and Judgement</em>, trans. J. S. Churchill\nand K. Ameriks, London: Routledge 1973.",
                "1954, <em>The Crisis of European Sciences and Transcendental\nPhenomenology</em>, trans. D. Carr. Evanston: Northwestern University\nPress (<strong>= <em>Crisis</em></strong>) 1970.",
                "1980, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—Third Book: Phenomenology and the\nFoundations of the Sciences</em>, trans. T. E. Klein and W. E. Pohl,\nDordrecht: Kluwer.",
                "1989, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—Second Book: Studies in the\nPhenomenology of Constitution</em>, trans. R. Rojcewicz and A.\nSchuwer, Dordrecht: Kluwer.",
                "1990, <em>On the Phenomenology of the Consciousness of Internal\nTime (1893–1917)</em>, trans. J. B. Brough, Dordrecht:\nKluwer.",
                "1994, <em>Early Writings in the Philosophy of Logic and\nMathematics</em>, trans. D. Willard, Dordrecht: Kluwer.",
                "1997, <em>Psychological and Transcendental Phenomenology and the\nConfrontation with Heidegger (1927–1931)</em>, trans. T. Sheehan\nand R. Palmer, Dordrecht: Kluwer.",
                "1999, <em>The Essential Husserl</em>, ed. D. Welton, Bloomington:\nIndiana University Press.\n</ul>\n<h3>"
            ],
            "<a name=\"SecLit\">Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Behnke, Elizabeth A., 1996, “Edmund Husserl’s\nContribution to Phenomenology of the Body in Ideas II,” in Nenon\nand Embree (eds.), 135–160.",
                "Bell, David, 1990, <em>Husserl</em>, London: Routledge.",
                "Bernet, Rudolf, Iso Kern and Eduard Marbach, 1993, <em>An\nIntroduction to Husserlian Phenomenology</em>, Evanston: Northwestern\nUniversity Press.",
                "Beyer, Christian, 1996, <em>Von Bolzano zu Husserl</em>,\nDordrecht: Kluwer.",
                "–––, 2000, <em>Intentionalität und\nReferenz</em>, Paderborn: mentis.",
                "–––, 2001, “A Neo-Husserlian Theory of\nSpeaker’s Reference,” <em>Erkenntnis</em>, 54:\n277–297.",
                "–––, 2011, “Husserls Konzeption des\nBewusstseins,” in Cramer and Beyer (eds.), 43–54.",
                "–––, 2018, “How to Analyse (Intentional)\nConsciousness in Terms of Meta-Belief and Temporal Awareness,”\n<em>Frontiers in Psychology</em>, 9: Art. 1628 (September 7).",
                "–––, 2020, “Toward a Husserlian\n(Meta)Metaphysics,” in <em>Metametaphysics and the\nSciences</em>, F. Kjosavik and C. Serck-Hanssen (eds.), New\nYork/Oxford: Routledge.",
                "Biceaga, Victor, 2010, <em>The Concept of Passivity in Husserl’s\nPhenomenology</em>, Dordrecht: Springer.",
                "Boehm, Rudolf, 1968, <em>Vom Gesichtspunkt der\nPhänomenologie</em>, The Hague: Nijhoff.",
                "Breyer, Thiemo, 2011, <em>Attentionalität und\nIntentionalität</em>, München: Wilhelm Fink Verlag.",
                "Brudzińska, Jagna, 2020, <em>Bi-Valenz der Erfahrung</em>,\nDordrecht: Springer.",
                "Caminada, Emanuele, 2019, <em>Vom Gemeingeist zum Habitus:\nHusserls Ideen II</em>, Heidelberg: Springer.",
                "Carr, David, 1987, <em>Interpreting Husserl</em>, Dordrecht:\nNijhoff.",
                "–––, 2019, “Intersubjectivity and\nEmbodiment,” in Kjosavik, Beyer, and Fricke (eds.) 2019,\n249–262.",
                "Centrone, Stefania, 2010, <em>Logic and Philosophy of Mathematics\nin the Early Husserl</em>, Dordrecht: Springer.",
                "Claesges, Ulrich, 1964, <em>Edmund Husserls Theorie der\nRaumkonstitution</em>, The Hague: Nijhoff.",
                "Cramer, Konrad and Christian Beyer (eds.), 2011, <em>Edmund\nHusserl 1859–2009</em>, Berlin/New York: De Gruyter.",
                "Crespo, Mariano, 2019, “From Empathy to Sympathy: On the\nImportance of Love in the Experience of the Other,” in Kjosavik,\nBeyer, and Fricke (eds.) 2019, 235–248.",
                "–––, 2021, “The Ethics of Husserl and his\nContemporaries (Lipps, Pfänder, and Geiger),” in Jacobs\n(ed.) 2021, 367–376.",
                "De Boer, Theodore, 1978, <em>The Development of Husserl’s\nThought</em>, The Hague: Nijhoff.",
                "De Santis, Daniele, 2021, <em>Husserl and the A Priori:\nPhenomenology and Rationality</em>. Dordrecht: Springer.",
                "Dodd, James, 1997, <em>Idealism and Corporeity</em>, Dordrecht:\nKluwer.",
                "Donohoe, Janet, 2006, <em>Husserl on Ethics and\nIntersubjectivity</em>, Toronto: University of Toronto Press.",
                "Dreyfus, Hubert (ed.), 1982, <em>Husserl, Intentionality, and\nCognitive Science</em>, Cambridge, MA: MIT Press.",
                "Drummond, John and Lester Embree (eds.), 1992, <em>The\nPhenomenology of the Noema</em>, Dordrecht: Kluwer.",
                "–––, 2002, <em>Phenomenological Approaches to\nMoral Philosophy</em>, Dordrecht: Kluwer.",
                "Drummond, John, 1990, <em>Husserlian Intentionality and\nNon-Foundational Realism</em>, Dordrecht: Kluwer.",
                "–––, 1992, “An Abstract Consideration:\nDeontologizing the Noema,” in Drummond and Embree (eds.),\n189–209.",
                "–––, 2018, “Husserl’s Middle Period and\nthe Development of his Ethics,” in Zahavi (ed.) 2018,\n135–154.",
                "–––, 2022, <em>Historical Dictionary of\nHusserl‘s Philosophy</em>, 2nd edition, London: Rowman &amp;\nLittlefield.",
                "Føllesdal, Dagfinn, 1958, <em>Husserl und Frege</em>, Oslo:\nAschehoug; trans. in Haaparanta (ed.) 1994.",
                "–––, 1969, “Husserl’s Notion of\nNoema,” reprinted in Dreyfus (ed.) 1982.",
                "–––, 1988, “Husserl on Evidence and\nJustification,” in Sokolowski (ed.) 1988.",
                "–––, 1990, “Noema and Meaning in\nHusserl,” <em>Phenomenology and Philosophical Research</em>, 50:\n263–271.",
                "–––, 1990a, “The <em>Lebenswelt</em> in\nHusserl,” in: Haaparanta et al. 1990.",
                "–––, 1998, “Husserl, Edmund\n(1859–1938),” in <em>Routledge Encyclopedia of\nPhilosophy</em> (Volume 4), London: Routledge.",
                "Frank, Manfred and Niels Weidtmann (eds.), 2010, <em>Husserl und\ndie Philosophie des Geistes</em>, Frankfurt/Main: Suhrkamp.",
                "Gallagher, Shaun, 2011, “Embodiment and Phenomenal\nQualities: An Enactive Interpretation,” <em>Philosophical\nTopics</em>, 39/1: 1–14.",
                "Gander, Hans-Helmuth (ed.), 2010, <em>Husserl-Lexikon</em>,\nDarmstadt: Wissenschaftliche Buchgesellschaft.",
                "Gurwitsch, Aron, 1966, <em>Studies in Phenomenology and\nPsychology</em>. Evanston: Northwestern University Press.",
                "–––, 1982, “Husserl’s Theory of the\nIntentionality of Consciousness”, in: Dreyfus (ed.) 1982.",
                "Haaparanta, Leila, with Martin Kusch and Ilkka Niiniluoto (eds.),\n1990, <em>Language, Knowledge and Intentionality</em>, Helsinki\n(<em>Acta Philosophica Fennica</em> 49).",
                "Haaparanta, Leila (ed.), 1994, <em>Mind, Meaning and\nMathematics</em>, Dordrecht: Kluwer.",
                "Heinämaa, Sara, 2011, “The Body,” in Luft and\nOvergaard (eds.) 2011, 222–232.",
                "–––, 2020, “Values of Love: Two Forms of\nInfinity Characteristic of Human Persons,” <em>Phenomenology and\nthe Cognitive Sciences</em>, 19/3: 237–257.",
                "Held, Klaus, 1966, <em>Lebendige Gegenwart</em>, The Hague:\nNijhoff.",
                "–––, 1990, “Edmund Husserl,” in\n<em>Philosophen des 20. Jahrhunderts</em>, ed. M. Fleischer,\nDarmstadt: Wissenschaftliche Buchgemeinschaft.",
                "–––, 2010, “Gott in Edmund Husserls\nPhänomenologie,” in Ierna, Jacobs, and Mattens (eds.),\n723–738.",
                "Holenstein, Elmar, 1972, <em>Phänomenologie der\nAssoziation</em>, The Hague: Nijhoff.",
                "Hopp, Walter, 2011, <em>Perception and Knowledge</em>, Cambridge:\nCambridge University Press.",
                "–––, 2020, <em>Phenomenology: A Contemporary\nIntroduction</em>, New York: Routledge.",
                "Ierna, Carlo, with Hanne Jacobs and Filip Mattens (eds.), 2010,\n<em>Philosophy, Phenomenology, Sciences</em>, Dordrecht:\nSpringer.",
                "Ijselling, Samuel (ed.), 1990, <em>Husserl-Ausgabe und\nHusserl-Forschung</em>, Dordrecht: Kluwer.",
                "Ingarden, Roman, 1975, <em>On the Motives which led Husserl to\nTranscendental Idealism</em>, trans. A. Hannibalson. The Hague:\nNijhoff.",
                "Jacobs, Hanne, 2010, “Towards a Phenomenological Account of\nPersonal Identity,” in Ierna, Jacobs, and Mattens (eds.),\n333–361.",
                "––– (ed.), 2021, <em>The Husserlian Mind</em>.\nLondon: Routledge.",
                "Jardine, James, 2022, <em>Empathy, Embodiment, and the\nPerson</em>, Dordrecht: Springer.",
                "Kaplan, David, 1989, “Demonstratives,” in <em>Themes\nfrom Kaplan</em>, ed. J. Almog and J. Perry and H. Wettstein, New\nYork: Oxford University Press.",
                "Kern, Iso, 1964, <em>Husserl und Kant</em>, The Hague:\nNijhoff.",
                "–––, 2019, “Husserl’s Phenomenology\nof Intersubjectivity,” in Kjosavik, Beyer, and Fricke (eds.)\n2019, 11–89.",
                "Kjosavik, Frode, Christian Beyer and Christel Fricke (eds.), 2019,\n<em>Husserl’s Phenomenology of Intersubjectivity</em>, New York,\nOxford: Routledge.",
                "Küng, Guido, 1972, “The World as Noema and as\nReferent,” <em>Journal of the British Society for\nPhenomenology</em>, 3: 15–26.",
                "Künne, Wolfgang, 1986, “Edmund Husserl:\nIntentionalität,” in <em>Grundprobleme der großen\nPhilosophen: Philosophie der Neuzeit IV</em>, J. Speck (ed.),\nGöttingen: Vandenhoeck &amp; Ruprecht.",
                "Landgrebe, Ludwig, 1982a, “Das Problem des Anfangs der\nPhilosophie in der Phänomenologie Husserls,” in: Ludwig\nLandgrebe, <em>Faktizität und Individuation</em>, Hamburg:\nMeiner, 21–37.",
                "–––, 1982b, “Das Problem der passiven\nKonstitution,” in: Ludwig Landgrebe, <em>Faktizität und\nIndividuation</em>, Hamburg: Meiner, 71–87.",
                "Lee, Nam-In, 1993, <em>Edmund Husserls Phänomenologie der\nInstinkte</em>, Dordrecht: Kluwer.",
                "Luft, Sebastian and Søren Overgaard (eds.), 2011, <em>The\nRoutledge Companion to Phenomenology</em>, London/New York:\nRoutledge.",
                "Luft, Sebastian (ed.), 2011, <em>Husserls Ethik</em>, <em>Journal\nPhänomenologie</em> 36, Special issue.",
                "Luft, Sebastian and Maren Wehrle (eds.), 2018, <em>Husserl\nHandbuch</em>, Stuttgart: Metzler.",
                "Marbach, Eduard, 1974, <em>Das Problem des Ich in der\nPhänomenologie Husserls</em>, The Hague: Nijhoff.",
                "–––, 1993, <em>Mental Representation and\nConsciousness</em>, Dordrecht: Kluwer.",
                "Melle, Ulrich, 1991, “The Development of Husserl’s\nEthics,” <em>Études phénoménologiques</em>, 13–14:\n115–135.",
                "–––, 2002, “Edmund Husserl: From Reason to\nLove,” in Drummond and Embree (eds.), 2002, 229–248.",
                "Mayer, Verena, with Christopher Erhard and Marisa Scherini (eds.),\n2011, <em>Die Aktualität Husserls</em>, Freiburg: Alber.",
                "Mensch, James, 1997, “Instincts: A <em>Husserlian</em>\nAccount,” <em>Husserl Studies</em> 14/3, 219–237.",
                "Miller, Izchak, 1984, <em>Husserl, Perception and Temporal\nAwareness</em>, Cambridge, MA: MIT Press.",
                "Mohanty, J. N., 1982, <em>Husserl and Frege</em>, Bloomington:\nIndiana University Press.",
                "–––, 1995, “The Development of\nHusserl’s Thought,” in Smith and Smith (eds.), 1995.",
                "–––, 2008, <em>The Philosophy of Edmund Husserl:\nA Historical Development</em>, New Haven: Yale University Press.",
                "–––, 2011, <em>Edmund Husserl’s Freiburg\nYears: 1916–1938</em>, New Haven: Yale University Press.",
                "Mohanty, J. N. and William McKenna (eds.), 1989,\n<em>Husserl’s Phenomenology: A Textbook</em>, Lanham: The Center\nfor Advanced Research in Phenomenology and University Press of\nAmerica.",
                "Moran, Dermot and Joseph Cohen, 2012, <em>The Husserl\nDictionary</em>, London/New York: Continuum Press.",
                "Moran, Dermot and Rasmus T. Janssen (eds.), 2013, <em>The\nPhenomenology of Embodied Subjectivity</em>, Dordrecht, Springer.",
                "Moran, Dermot, 2005, <em>Edmund Husserl</em>, Cambridge and\nMalden, MA: Polity Press.",
                "Moran, Dermot, 2011, “Edmund Husserl’s Phenomenolology of\nHabituality and Habitus,” <em>Journal of the British Society for\nPhenomenology</em>, 42/1: 53–77.",
                "Mulligan, Kevin and Barry Smith, 1986, “Husserl’s\n<em>Logical Investigations</em>,” <em>Grazer Philosophische\nStudien</em>, 28: 199–207.",
                "Mulligan, Kevin, 1995, “Perception,” in Smith and\nSmith (eds.) 1995.",
                "Murphy, Richard, 1980, <em>Hume and Husserl</em>, The Hague:\nNijhoff.",
                "Nenon, Thomas and Lester Embree (eds.), 1996, <em>Issues in\nHusserl’s “Ideas II”</em>, Dordrecht: Kluwer.",
                "Overgaard, Søren, 2004, <em>Husserl and Heidegger on Being\nin the World</em>, Dordrecht: Springer.",
                "Perry, John, 1980, “A Problem About Continued Belief,”\nreprinted in <em>The Problem of the Essential Indexical</em>, New\nYork: Oxford University Press 1993.",
                "Petitot, Jean, with Francisco Varela, Bernard Pachoud, and\nJean-Michel Roy (eds.), 1999, <em>Naturalizing Phenomenology</em>,\nStanford: Stanford University Press.",
                "Peucker, Henning, 2008, “From Logic to the Person: An\nIntroduction to Husserl’s Ethics,” <em>Review of\nMetaphysics</em>, 62: 307–325.",
                "Rang, Bernard, 1973, <em>Kausalität und Motivation</em>, The\nHague: Nijhoff.",
                "Rinofner-Kreidl, Sonja, 2000, <em>Edmund Husserl: Zeitlichkeit und\nIntentionalität</em>, Freiburg/Br.: Alber.",
                "Rollinger, Robin, 1999, <em>Husserl’s Position in the School\nof Brentano</em>, Dordrecht: Kluwer.",
                "Römer, Inga 2011: “Von der wertmaximierenden\nLeistungsmaschine zur vernünftigen liebenden Person:\nSubjektivität in Husserls Ethik,”\n<em>Phänomenologie</em>, 36: 21–35.",
                "Römpp, Georg, 1991, <em>Husserls Phänomenologie der\nIntersubjektivität</em>, Dordrecht: Kluwer.",
                "Schuhmann, Karl, 1977, <em>Husserl-Chronik</em>, The Hague:\nNijhoff.",
                "–––, 1988, <em>Husserls Staatsphilosophie</em>,\nFreiburg/Br.: Alber.",
                "Schütz, Alfred, 1966, “The Problem of Transcendental\nIntersubjectivity in Husserl,” in <em>Collected Papers III</em>,\nThe Hague: Nijhoff.",
                "Schwabe-Hansen, Elling, 1991, <em>Das Verhältnis von\ntranszendentaler und konkreter Subjektivität in der\nPhänomenologie Edmund Husserls</em>, Oslo, Munich:\nSolum/Fink.",
                "Smith, A. D., 2003, <em>Husserl and the Cartesian\nMeditations</em>, London: Routledge.",
                "Smith, Barry and David Woodruff Smith (eds.), 1995, <em>The\nCambridge Companion to Husserl</em>, Cambridge: Cambridge University\nPress.",
                "Smith, Barry (ed.), 1992, <em>Parts and Moments</em>, Munich:\nPhilosophia Verlag.",
                "Smith, David Woodruff and Ronald McIntyre, 1982, <em>Husserl and\nIntentionality</em>, Dordrecht: Reidel.",
                "Smith, David Woodruff, 1989, <em>The Circle of Acquaintance</em>,\nDordrecht: Kluwer.",
                "–––, 2013, <em>Husserl</em>, 2nd revised\nedition, London: Routledge; 1st edition, 2007.",
                "Sokolowski, Robert, 1970, <em>The Formation of Husserl’s\nConcept of Constitution</em>, The Hague: Nijhoff.",
                "–––, 1971, “The Structure and Content of\nHusserl’s <em>Logical Investigations</em>,”\n<em>Inquiry</em>, 14: 318–347.",
                "–––, 1974, <em>Husserlian Meditations: How Words\nPresent Things</em>, Evanston: Northwestern University Press.",
                "–––, 1987, “Husserl and Frege,”\n<em>The Journal of Philosophy</em>, 84: 521–528.",
                "Sokolowski, Robert (ed.), 1988, <em>Edmund Husserl and the\nPhenomenological Tradition</em>, Washington: Catholic University of\nAmerica Press.",
                "Soldati, Gianfranco, 1994, <em>Bedeutung und psychischer\nGehalt</em>, Paderborn: Schöningh.",
                "Spiegelberg, Herbert, 1982, <em>The Phenomenological\nMovement</em>, 3<sup>rd</sup> revised and enlarged edition, The Hague:\nNijhoff.",
                "Staiti, Andrea (ed.), 2015, <em>Commentary on Husserl’s\n“Ideas I”</em>, Berlin/Boston: de Gruyter.",
                "Stein, Edith, 1917, <em>On the Problem of Empathy</em>, trans. W.\nStein. The Hague: Nijhoff 1970.",
                "Stepanians, Markus, 1998, <em>Frege und Husserl über Urteilen\nund Denken</em>, Paderborn: mentis.",
                "Ströker, Elisabeth, 1993, <em>Husserl’s Transcendental\nPhenomenology</em>, Stanford: Stanford University Press.",
                "Ströker, Elisabeth (ed.), 1979, <em>Lebenswelt und\nWissenschaft in der Philosophie Edmund Husserls</em>, Frankfurt/M.:\nKlostermann.",
                "Süßbauer, Alfons, 1995, <em>Intentionalität,\nSachverhalt, Noema</em>, Freiburg/Br.: Alber.",
                "Taipale, Joona, 2014, <em>Phenomenology and Embodiment</em>,\nEvanston: Northwestern University Press.",
                "Tugendhat, Ernst, 1967, <em>Der Wahrheitsbegriff bei Husserl und\nHeidegger</em>, Berlin: de Gruyter.",
                "Volonte, Paolo, 1997, <em>Husserls Phänomenologie der\nImagination</em>, Freiburg/Br.: Alber.",
                "Waldenfels, Bernard, 1971, <em>Das Zwischenreich des Dialogs</em>,\nThe Hague: Nijhoff.",
                "Wehrle, Maren, 2013, <em>Horizonte der Aufmerksamkeit</em>,\nMünchen: Wilhelm Fink Verlag.",
                "Welton, Don, 1983, <em>The Origins of Meaning</em>, The Hague:\nNijhoff.",
                "Willard, Dallas, 1984, <em>Logic and the Objectivity of\nKnowledge</em>, Athens/Ohio: University of Ohio Press.",
                "Wu, Jiahao, 2021, <em>Das Grammatikalitätsphänomen in\nHusserls Phänomenologie</em>, Georg-August-Universität\nGöttingen. doi:10.53846/goediss-8616",
                "Yamaguchi, Ichiro, 1982, <em>Passive Synthesis und\nIntersubjektivität bei Edmund Husserl</em>, The Hague:\nNijhoff.",
                "Zahavi, Dan, 2003, <em>Husserl’s Phenomenology</em>,\nStanford: Stanford University Press.",
                "–––, 2014, “Edmund Husserl,” in\n<em>Oxford Bibliographies in Philosophy</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2015, “Phenomenology of\nReflection,” in Staiti (ed.) 2015, 177–194.",
                "–––, 2017, <em>Husserl’s Legacy</em>,\nOxford: Oxford University Press.",
                "–––, (ed.) 2018, <em>The Oxford Handbook of the\nHistory of Phenomenology</em>, Oxford: Oxford University Press.",
                "–––, 2018, “Intersubjectivity, Sociality,\nCommunity: The Contributions of the Early Phenomenologists,” in\nZahavi (ed.), 2018, 734–752.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"PriLit\">Primary Literature</a></h3>\n<p>\nThe collected works of Husserl were published over the course of\nseveral years, starting in 1950, in <em>Husserliana: Edmund\nHusserl—Gesammelte Werke</em>, The Hague/Dordrecht:\nNijhoff/Kluwer. The following works by Husserl have been translated\ninto English, and they are listed in the chronological order of the\npublication dates of the German originals (if these were originally\npublished).</p>\n<ul class=\"hanging\">\n<li>1900/1 [2nd, revised edition 1913], <em>Logical\nInvestigations</em>, trans. J. N. Findlay, London: Routledge\n1973.</li>\n<li>1910, “Philosophy as Rigorous Science,” trans. in Q.\nLauer (ed.), <em>Phenomenology and the Crisis of Philosophy</em>, New\nYork: Harper 1965.</li>\n<li>1913, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—First Book: General Introduction to\na Pure Phenomenology</em>, trans. F. Kersten. The Hague: Nijhoff 1982\n(<strong>= <em>Ideas</em></strong>).</li>\n<li>1929, <em>Formal and Transcendental Logic</em>, trans. D. Cairns.\nThe Hague: Nijhoff 1969.</li>\n<li>1931, <em>Cartesian Meditations</em>, trans. D. Cairns, Dordrecht:\nKluwer 1988.</li>\n<li>1939, <em>Experience and Judgement</em>, trans. J. S. Churchill\nand K. Ameriks, London: Routledge 1973.</li>\n<li>1954, <em>The Crisis of European Sciences and Transcendental\nPhenomenology</em>, trans. D. Carr. Evanston: Northwestern University\nPress (<strong>= <em>Crisis</em></strong>) 1970.</li>\n<li>1980, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—Third Book: Phenomenology and the\nFoundations of the Sciences</em>, trans. T. E. Klein and W. E. Pohl,\nDordrecht: Kluwer.</li>\n<li>1989, <em>Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy—Second Book: Studies in the\nPhenomenology of Constitution</em>, trans. R. Rojcewicz and A.\nSchuwer, Dordrecht: Kluwer.</li>\n<li>1990, <em>On the Phenomenology of the Consciousness of Internal\nTime (1893–1917)</em>, trans. J. B. Brough, Dordrecht:\nKluwer.</li>\n<li>1994, <em>Early Writings in the Philosophy of Logic and\nMathematics</em>, trans. D. Willard, Dordrecht: Kluwer.</li>\n<li>1997, <em>Psychological and Transcendental Phenomenology and the\nConfrontation with Heidegger (1927–1931)</em>, trans. T. Sheehan\nand R. Palmer, Dordrecht: Kluwer.</li>\n<li>1999, <em>The Essential Husserl</em>, ed. D. Welton, Bloomington:\nIndiana University Press.</li>\n</ul>\n<h3><a name=\"SecLit\">Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Behnke, Elizabeth A., 1996, “Edmund Husserl’s\nContribution to Phenomenology of the Body in Ideas II,” in Nenon\nand Embree (eds.), 135–160.</li>\n<li>Bell, David, 1990, <em>Husserl</em>, London: Routledge.</li>\n<li>Bernet, Rudolf, Iso Kern and Eduard Marbach, 1993, <em>An\nIntroduction to Husserlian Phenomenology</em>, Evanston: Northwestern\nUniversity Press.</li>\n<li>Beyer, Christian, 1996, <em>Von Bolzano zu Husserl</em>,\nDordrecht: Kluwer.</li>\n<li>–––, 2000, <em>Intentionalität und\nReferenz</em>, Paderborn: mentis.</li>\n<li>–––, 2001, “A Neo-Husserlian Theory of\nSpeaker’s Reference,” <em>Erkenntnis</em>, 54:\n277–297.</li>\n<li>–––, 2011, “Husserls Konzeption des\nBewusstseins,” in Cramer and Beyer (eds.), 43–54.</li>\n<li>–––, 2018, “How to Analyse (Intentional)\nConsciousness in Terms of Meta-Belief and Temporal Awareness,”\n<em>Frontiers in Psychology</em>, 9: Art. 1628 (September 7).</li>\n<li>–––, 2020, “Toward a Husserlian\n(Meta)Metaphysics,” in <em>Metametaphysics and the\nSciences</em>, F. Kjosavik and C. Serck-Hanssen (eds.), New\nYork/Oxford: Routledge.</li>\n<li>Biceaga, Victor, 2010, <em>The Concept of Passivity in Husserl’s\nPhenomenology</em>, Dordrecht: Springer.</li>\n<li>Boehm, Rudolf, 1968, <em>Vom Gesichtspunkt der\nPhänomenologie</em>, The Hague: Nijhoff.</li>\n<li>Breyer, Thiemo, 2011, <em>Attentionalität und\nIntentionalität</em>, München: Wilhelm Fink Verlag.</li>\n<li>Brudzińska, Jagna, 2020, <em>Bi-Valenz der Erfahrung</em>,\nDordrecht: Springer.</li>\n<li>Caminada, Emanuele, 2019, <em>Vom Gemeingeist zum Habitus:\nHusserls Ideen II</em>, Heidelberg: Springer.</li>\n<li>Carr, David, 1987, <em>Interpreting Husserl</em>, Dordrecht:\nNijhoff.</li>\n<li>–––, 2019, “Intersubjectivity and\nEmbodiment,” in Kjosavik, Beyer, and Fricke (eds.) 2019,\n249–262.</li>\n<li>Centrone, Stefania, 2010, <em>Logic and Philosophy of Mathematics\nin the Early Husserl</em>, Dordrecht: Springer.</li>\n<li>Claesges, Ulrich, 1964, <em>Edmund Husserls Theorie der\nRaumkonstitution</em>, The Hague: Nijhoff.</li>\n<li>Cramer, Konrad and Christian Beyer (eds.), 2011, <em>Edmund\nHusserl 1859–2009</em>, Berlin/New York: De Gruyter.</li>\n<li>Crespo, Mariano, 2019, “From Empathy to Sympathy: On the\nImportance of Love in the Experience of the Other,” in Kjosavik,\nBeyer, and Fricke (eds.) 2019, 235–248.</li>\n<li>–––, 2021, “The Ethics of Husserl and his\nContemporaries (Lipps, Pfänder, and Geiger),” in Jacobs\n(ed.) 2021, 367–376.</li>\n<li>De Boer, Theodore, 1978, <em>The Development of Husserl’s\nThought</em>, The Hague: Nijhoff.</li>\n<li>De Santis, Daniele, 2021, <em>Husserl and the A Priori:\nPhenomenology and Rationality</em>. Dordrecht: Springer.</li>\n<li>Dodd, James, 1997, <em>Idealism and Corporeity</em>, Dordrecht:\nKluwer.</li>\n<li>Donohoe, Janet, 2006, <em>Husserl on Ethics and\nIntersubjectivity</em>, Toronto: University of Toronto Press.</li>\n<li>Dreyfus, Hubert (ed.), 1982, <em>Husserl, Intentionality, and\nCognitive Science</em>, Cambridge, MA: MIT Press.</li>\n<li>Drummond, John and Lester Embree (eds.), 1992, <em>The\nPhenomenology of the Noema</em>, Dordrecht: Kluwer.</li>\n<li>–––, 2002, <em>Phenomenological Approaches to\nMoral Philosophy</em>, Dordrecht: Kluwer.</li>\n<li>Drummond, John, 1990, <em>Husserlian Intentionality and\nNon-Foundational Realism</em>, Dordrecht: Kluwer.</li>\n<li>–––, 1992, “An Abstract Consideration:\nDeontologizing the Noema,” in Drummond and Embree (eds.),\n189–209.</li>\n<li>–––, 2018, “Husserl’s Middle Period and\nthe Development of his Ethics,” in Zahavi (ed.) 2018,\n135–154.</li>\n<li>–––, 2022, <em>Historical Dictionary of\nHusserl‘s Philosophy</em>, 2nd edition, London: Rowman &amp;\nLittlefield.</li>\n<li>Føllesdal, Dagfinn, 1958, <em>Husserl und Frege</em>, Oslo:\nAschehoug; trans. in Haaparanta (ed.) 1994.</li>\n<li>–––, 1969, “Husserl’s Notion of\nNoema,” reprinted in Dreyfus (ed.) 1982.</li>\n<li>–––, 1988, “Husserl on Evidence and\nJustification,” in Sokolowski (ed.) 1988.</li>\n<li>–––, 1990, “Noema and Meaning in\nHusserl,” <em>Phenomenology and Philosophical Research</em>, 50:\n263–271.</li>\n<li>–––, 1990a, “The <em>Lebenswelt</em> in\nHusserl,” in: Haaparanta et al. 1990.</li>\n<li>–––, 1998, “Husserl, Edmund\n(1859–1938),” in <em>Routledge Encyclopedia of\nPhilosophy</em> (Volume 4), London: Routledge.</li>\n<li>Frank, Manfred and Niels Weidtmann (eds.), 2010, <em>Husserl und\ndie Philosophie des Geistes</em>, Frankfurt/Main: Suhrkamp.</li>\n<li>Gallagher, Shaun, 2011, “Embodiment and Phenomenal\nQualities: An Enactive Interpretation,” <em>Philosophical\nTopics</em>, 39/1: 1–14.</li>\n<li>Gander, Hans-Helmuth (ed.), 2010, <em>Husserl-Lexikon</em>,\nDarmstadt: Wissenschaftliche Buchgesellschaft.</li>\n<li>Gurwitsch, Aron, 1966, <em>Studies in Phenomenology and\nPsychology</em>. Evanston: Northwestern University Press.</li>\n<li>–––, 1982, “Husserl’s Theory of the\nIntentionality of Consciousness”, in: Dreyfus (ed.) 1982.</li>\n<li>Haaparanta, Leila, with Martin Kusch and Ilkka Niiniluoto (eds.),\n1990, <em>Language, Knowledge and Intentionality</em>, Helsinki\n(<em>Acta Philosophica Fennica</em> 49).</li>\n<li>Haaparanta, Leila (ed.), 1994, <em>Mind, Meaning and\nMathematics</em>, Dordrecht: Kluwer.</li>\n<li>Heinämaa, Sara, 2011, “The Body,” in Luft and\nOvergaard (eds.) 2011, 222–232.</li>\n<li>–––, 2020, “Values of Love: Two Forms of\nInfinity Characteristic of Human Persons,” <em>Phenomenology and\nthe Cognitive Sciences</em>, 19/3: 237–257.</li>\n<li>Held, Klaus, 1966, <em>Lebendige Gegenwart</em>, The Hague:\nNijhoff.</li>\n<li>–––, 1990, “Edmund Husserl,” in\n<em>Philosophen des 20. Jahrhunderts</em>, ed. M. Fleischer,\nDarmstadt: Wissenschaftliche Buchgemeinschaft.</li>\n<li>–––, 2010, “Gott in Edmund Husserls\nPhänomenologie,” in Ierna, Jacobs, and Mattens (eds.),\n723–738.</li>\n<li>Holenstein, Elmar, 1972, <em>Phänomenologie der\nAssoziation</em>, The Hague: Nijhoff.</li>\n<li>Hopp, Walter, 2011, <em>Perception and Knowledge</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2020, <em>Phenomenology: A Contemporary\nIntroduction</em>, New York: Routledge.</li>\n<li>Ierna, Carlo, with Hanne Jacobs and Filip Mattens (eds.), 2010,\n<em>Philosophy, Phenomenology, Sciences</em>, Dordrecht:\nSpringer.</li>\n<li>Ijselling, Samuel (ed.), 1990, <em>Husserl-Ausgabe und\nHusserl-Forschung</em>, Dordrecht: Kluwer.</li>\n<li>Ingarden, Roman, 1975, <em>On the Motives which led Husserl to\nTranscendental Idealism</em>, trans. A. Hannibalson. The Hague:\nNijhoff.</li>\n<li>Jacobs, Hanne, 2010, “Towards a Phenomenological Account of\nPersonal Identity,” in Ierna, Jacobs, and Mattens (eds.),\n333–361.</li>\n<li>––– (ed.), 2021, <em>The Husserlian Mind</em>.\nLondon: Routledge.</li>\n<li>Jardine, James, 2022, <em>Empathy, Embodiment, and the\nPerson</em>, Dordrecht: Springer.</li>\n<li>Kaplan, David, 1989, “Demonstratives,” in <em>Themes\nfrom Kaplan</em>, ed. J. Almog and J. Perry and H. Wettstein, New\nYork: Oxford University Press.</li>\n<li>Kern, Iso, 1964, <em>Husserl und Kant</em>, The Hague:\nNijhoff.</li>\n<li>–––, 2019, “Husserl’s Phenomenology\nof Intersubjectivity,” in Kjosavik, Beyer, and Fricke (eds.)\n2019, 11–89.</li>\n<li>Kjosavik, Frode, Christian Beyer and Christel Fricke (eds.), 2019,\n<em>Husserl’s Phenomenology of Intersubjectivity</em>, New York,\nOxford: Routledge.</li>\n<li>Küng, Guido, 1972, “The World as Noema and as\nReferent,” <em>Journal of the British Society for\nPhenomenology</em>, 3: 15–26.</li>\n<li>Künne, Wolfgang, 1986, “Edmund Husserl:\nIntentionalität,” in <em>Grundprobleme der großen\nPhilosophen: Philosophie der Neuzeit IV</em>, J. Speck (ed.),\nGöttingen: Vandenhoeck &amp; Ruprecht.</li>\n<li>Landgrebe, Ludwig, 1982a, “Das Problem des Anfangs der\nPhilosophie in der Phänomenologie Husserls,” in: Ludwig\nLandgrebe, <em>Faktizität und Individuation</em>, Hamburg:\nMeiner, 21–37.</li>\n<li>–––, 1982b, “Das Problem der passiven\nKonstitution,” in: Ludwig Landgrebe, <em>Faktizität und\nIndividuation</em>, Hamburg: Meiner, 71–87.</li>\n<li>Lee, Nam-In, 1993, <em>Edmund Husserls Phänomenologie der\nInstinkte</em>, Dordrecht: Kluwer.</li>\n<li>Luft, Sebastian and Søren Overgaard (eds.), 2011, <em>The\nRoutledge Companion to Phenomenology</em>, London/New York:\nRoutledge.</li>\n<li>Luft, Sebastian (ed.), 2011, <em>Husserls Ethik</em>, <em>Journal\nPhänomenologie</em> 36, Special issue.</li>\n<li>Luft, Sebastian and Maren Wehrle (eds.), 2018, <em>Husserl\nHandbuch</em>, Stuttgart: Metzler.</li>\n<li>Marbach, Eduard, 1974, <em>Das Problem des Ich in der\nPhänomenologie Husserls</em>, The Hague: Nijhoff.</li>\n<li>–––, 1993, <em>Mental Representation and\nConsciousness</em>, Dordrecht: Kluwer.</li>\n<li>Melle, Ulrich, 1991, “The Development of Husserl’s\nEthics,” <em>Études phénoménologiques</em>, 13–14:\n115–135.</li>\n<li>–––, 2002, “Edmund Husserl: From Reason to\nLove,” in Drummond and Embree (eds.), 2002, 229–248.</li>\n<li>Mayer, Verena, with Christopher Erhard and Marisa Scherini (eds.),\n2011, <em>Die Aktualität Husserls</em>, Freiburg: Alber.</li>\n<li>Mensch, James, 1997, “Instincts: A <em>Husserlian</em>\nAccount,” <em>Husserl Studies</em> 14/3, 219–237.</li>\n<li>Miller, Izchak, 1984, <em>Husserl, Perception and Temporal\nAwareness</em>, Cambridge, MA: MIT Press.</li>\n<li>Mohanty, J. N., 1982, <em>Husserl and Frege</em>, Bloomington:\nIndiana University Press.</li>\n<li>–––, 1995, “The Development of\nHusserl’s Thought,” in Smith and Smith (eds.), 1995.</li>\n<li>–––, 2008, <em>The Philosophy of Edmund Husserl:\nA Historical Development</em>, New Haven: Yale University Press.</li>\n<li>–––, 2011, <em>Edmund Husserl’s Freiburg\nYears: 1916–1938</em>, New Haven: Yale University Press.</li>\n<li>Mohanty, J. N. and William McKenna (eds.), 1989,\n<em>Husserl’s Phenomenology: A Textbook</em>, Lanham: The Center\nfor Advanced Research in Phenomenology and University Press of\nAmerica.</li>\n<li>Moran, Dermot and Joseph Cohen, 2012, <em>The Husserl\nDictionary</em>, London/New York: Continuum Press.</li>\n<li>Moran, Dermot and Rasmus T. Janssen (eds.), 2013, <em>The\nPhenomenology of Embodied Subjectivity</em>, Dordrecht, Springer.</li>\n<li>Moran, Dermot, 2005, <em>Edmund Husserl</em>, Cambridge and\nMalden, MA: Polity Press.</li>\n<li>Moran, Dermot, 2011, “Edmund Husserl’s Phenomenolology of\nHabituality and Habitus,” <em>Journal of the British Society for\nPhenomenology</em>, 42/1: 53–77.</li>\n<li>Mulligan, Kevin and Barry Smith, 1986, “Husserl’s\n<em>Logical Investigations</em>,” <em>Grazer Philosophische\nStudien</em>, 28: 199–207.</li>\n<li>Mulligan, Kevin, 1995, “Perception,” in Smith and\nSmith (eds.) 1995.</li>\n<li>Murphy, Richard, 1980, <em>Hume and Husserl</em>, The Hague:\nNijhoff.</li>\n<li>Nenon, Thomas and Lester Embree (eds.), 1996, <em>Issues in\nHusserl’s “Ideas II”</em>, Dordrecht: Kluwer.</li>\n<li>Overgaard, Søren, 2004, <em>Husserl and Heidegger on Being\nin the World</em>, Dordrecht: Springer.</li>\n<li>Perry, John, 1980, “A Problem About Continued Belief,”\nreprinted in <em>The Problem of the Essential Indexical</em>, New\nYork: Oxford University Press 1993.</li>\n<li>Petitot, Jean, with Francisco Varela, Bernard Pachoud, and\nJean-Michel Roy (eds.), 1999, <em>Naturalizing Phenomenology</em>,\nStanford: Stanford University Press.</li>\n<li>Peucker, Henning, 2008, “From Logic to the Person: An\nIntroduction to Husserl’s Ethics,” <em>Review of\nMetaphysics</em>, 62: 307–325.</li>\n<li>Rang, Bernard, 1973, <em>Kausalität und Motivation</em>, The\nHague: Nijhoff.</li>\n<li>Rinofner-Kreidl, Sonja, 2000, <em>Edmund Husserl: Zeitlichkeit und\nIntentionalität</em>, Freiburg/Br.: Alber.</li>\n<li>Rollinger, Robin, 1999, <em>Husserl’s Position in the School\nof Brentano</em>, Dordrecht: Kluwer.</li>\n<li>Römer, Inga 2011: “Von der wertmaximierenden\nLeistungsmaschine zur vernünftigen liebenden Person:\nSubjektivität in Husserls Ethik,”\n<em>Phänomenologie</em>, 36: 21–35.</li>\n<li>Römpp, Georg, 1991, <em>Husserls Phänomenologie der\nIntersubjektivität</em>, Dordrecht: Kluwer.</li>\n<li>Schuhmann, Karl, 1977, <em>Husserl-Chronik</em>, The Hague:\nNijhoff.</li>\n<li>–––, 1988, <em>Husserls Staatsphilosophie</em>,\nFreiburg/Br.: Alber.</li>\n<li>Schütz, Alfred, 1966, “The Problem of Transcendental\nIntersubjectivity in Husserl,” in <em>Collected Papers III</em>,\nThe Hague: Nijhoff.</li>\n<li>Schwabe-Hansen, Elling, 1991, <em>Das Verhältnis von\ntranszendentaler und konkreter Subjektivität in der\nPhänomenologie Edmund Husserls</em>, Oslo, Munich:\nSolum/Fink.</li>\n<li>Smith, A. D., 2003, <em>Husserl and the Cartesian\nMeditations</em>, London: Routledge.</li>\n<li>Smith, Barry and David Woodruff Smith (eds.), 1995, <em>The\nCambridge Companion to Husserl</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Smith, Barry (ed.), 1992, <em>Parts and Moments</em>, Munich:\nPhilosophia Verlag.</li>\n<li>Smith, David Woodruff and Ronald McIntyre, 1982, <em>Husserl and\nIntentionality</em>, Dordrecht: Reidel.</li>\n<li>Smith, David Woodruff, 1989, <em>The Circle of Acquaintance</em>,\nDordrecht: Kluwer.</li>\n<li>–––, 2013, <em>Husserl</em>, 2nd revised\nedition, London: Routledge; 1st edition, 2007.</li>\n<li>Sokolowski, Robert, 1970, <em>The Formation of Husserl’s\nConcept of Constitution</em>, The Hague: Nijhoff.</li>\n<li>–––, 1971, “The Structure and Content of\nHusserl’s <em>Logical Investigations</em>,”\n<em>Inquiry</em>, 14: 318–347.</li>\n<li>–––, 1974, <em>Husserlian Meditations: How Words\nPresent Things</em>, Evanston: Northwestern University Press.</li>\n<li>–––, 1987, “Husserl and Frege,”\n<em>The Journal of Philosophy</em>, 84: 521–528.</li>\n<li>Sokolowski, Robert (ed.), 1988, <em>Edmund Husserl and the\nPhenomenological Tradition</em>, Washington: Catholic University of\nAmerica Press.</li>\n<li>Soldati, Gianfranco, 1994, <em>Bedeutung und psychischer\nGehalt</em>, Paderborn: Schöningh.</li>\n<li>Spiegelberg, Herbert, 1982, <em>The Phenomenological\nMovement</em>, 3<sup>rd</sup> revised and enlarged edition, The Hague:\nNijhoff.</li>\n<li>Staiti, Andrea (ed.), 2015, <em>Commentary on Husserl’s\n“Ideas I”</em>, Berlin/Boston: de Gruyter.</li>\n<li>Stein, Edith, 1917, <em>On the Problem of Empathy</em>, trans. W.\nStein. The Hague: Nijhoff 1970.</li>\n<li>Stepanians, Markus, 1998, <em>Frege und Husserl über Urteilen\nund Denken</em>, Paderborn: mentis.</li>\n<li>Ströker, Elisabeth, 1993, <em>Husserl’s Transcendental\nPhenomenology</em>, Stanford: Stanford University Press.</li>\n<li>Ströker, Elisabeth (ed.), 1979, <em>Lebenswelt und\nWissenschaft in der Philosophie Edmund Husserls</em>, Frankfurt/M.:\nKlostermann.</li>\n<li>Süßbauer, Alfons, 1995, <em>Intentionalität,\nSachverhalt, Noema</em>, Freiburg/Br.: Alber.</li>\n<li>Taipale, Joona, 2014, <em>Phenomenology and Embodiment</em>,\nEvanston: Northwestern University Press.</li>\n<li>Tugendhat, Ernst, 1967, <em>Der Wahrheitsbegriff bei Husserl und\nHeidegger</em>, Berlin: de Gruyter.</li>\n<li>Volonte, Paolo, 1997, <em>Husserls Phänomenologie der\nImagination</em>, Freiburg/Br.: Alber.</li>\n<li>Waldenfels, Bernard, 1971, <em>Das Zwischenreich des Dialogs</em>,\nThe Hague: Nijhoff.</li>\n<li>Wehrle, Maren, 2013, <em>Horizonte der Aufmerksamkeit</em>,\nMünchen: Wilhelm Fink Verlag.</li>\n<li>Welton, Don, 1983, <em>The Origins of Meaning</em>, The Hague:\nNijhoff.</li>\n<li>Willard, Dallas, 1984, <em>Logic and the Objectivity of\nKnowledge</em>, Athens/Ohio: University of Ohio Press.</li>\n<li>Wu, Jiahao, 2021, <em>Das Grammatikalitätsphänomen in\nHusserls Phänomenologie</em>, Georg-August-Universität\nGöttingen. doi:10.53846/goediss-8616</li>\n<li>Yamaguchi, Ichiro, 1982, <em>Passive Synthesis und\nIntersubjektivität bei Edmund Husserl</em>, The Hague:\nNijhoff.</li>\n<li>Zahavi, Dan, 2003, <em>Husserl’s Phenomenology</em>,\nStanford: Stanford University Press.</li>\n<li>–––, 2014, “Edmund Husserl,” in\n<em>Oxford Bibliographies in Philosophy</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2015, “Phenomenology of\nReflection,” in Staiti (ed.) 2015, 177–194.</li>\n<li>–––, 2017, <em>Husserl’s Legacy</em>,\nOxford: Oxford University Press.</li>\n<li>–––, (ed.) 2018, <em>The Oxford Handbook of the\nHistory of Phenomenology</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2018, “Intersubjectivity, Sociality,\nCommunity: The Contributions of the Early Phenomenologists,” in\nZahavi (ed.), 2018, 734–752.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "abstract objects",
            "Bolzano, Bernard",
            "Brentano, Franz",
            "cognitive science",
            "consciousness",
            "dependence, ontological",
            "Heidegger, Martin",
            "Ingarden, Roman",
            "intentionality",
            "Lotze, Hermann",
            "other minds",
            "perception: the problem of",
            "phenomenology",
            "propositions",
            "reference",
            "Sartre, Jean-Paul",
            "Schutz, Alfred",
            "self-consciousness: phenomenological approaches to",
            "Stumpf, Carl"
        ],
        "entry_link": [
            {
                "../abstract-objects/": "abstract objects"
            },
            {
                "../bolzano/": "Bolzano, Bernard"
            },
            {
                "../brentano/": "Brentano, Franz"
            },
            {
                "../cognitive-science/": "cognitive science"
            },
            {
                "../consciousness/": "consciousness"
            },
            {
                "../dependence-ontological/": "dependence, ontological"
            },
            {
                "../heidegger/": "Heidegger, Martin"
            },
            {
                "../ingarden/": "Ingarden, Roman"
            },
            {
                "../intentionality/": "intentionality"
            },
            {
                "../hermann-lotze/": "Lotze, Hermann"
            },
            {
                "../other-minds/": "other minds"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../phenomenology/": "phenomenology"
            },
            {
                "../propositions/": "propositions"
            },
            {
                "../reference/": "reference"
            },
            {
                "../sartre/": "Sartre, Jean-Paul"
            },
            {
                "../schutz/": "Schutz, Alfred"
            },
            {
                "../self-consciousness-phenomenological/": "self-consciousness: phenomenological approaches to"
            },
            {
                "../stumpf/": "Stumpf, Carl"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=husserl\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/husserl/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=husserl&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/husserl/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=husserl": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/husserl/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=husserl&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/husserl/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.husserlpage.com/\" target=\"other\">The Husserl Page</a>,\n maintained by Bob Sandmeyer (University of Kentucky)",
            "<a href=\"http://www.husserl.net/\" target=\"other\">Husserl.net</a>,\n maintained by Jeff Yoshimi (University of California at San\nDiego)",
            "<a href=\"https://ophen.org/\" target=\"other\">The Open Commons of Phenomenology</a>,\n (non-profit scholarly association)",
            "<a href=\"http://www3.ub.uni-freiburg.de/?id=1260\" target=\"other\">Information and Links on Husserl</a>,\n in German (University of Freiburg)"
        ],
        "listed_links": [
            {
                "http://www.husserlpage.com/": "The Husserl Page"
            },
            {
                "http://www.husserl.net/": "Husserl.net"
            },
            {
                "https://ophen.org/": "The Open Commons of Phenomenology"
            },
            {
                "http://www3.ub.uni-freiburg.de/?id=1260": "Information and Links on Husserl"
            }
        ]
    }
}