{
    "url": "idiolects",
    "title": "Idiolects",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Alex Barber\n<alex.barber@open.ac.uk>\nEduardo Garcia Ramirez\n<garciaramirez.edu@gmail.com>",
        "author_links": [
            {
                "http://www.open.ac.uk/people/awb64": "Alex Barber"
            },
            {
                "mailto:alex%2ebarber%40open%2eac%2euk": "alex.barber@open.ac.uk"
            },
            {
                "mailto:garciaramirez%2eedu%40gmail%2ecom": "garciaramirez.edu@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.open.ac.uk/people/awb64\" target=\"other\">Alex Barber</a>\n&lt;<a href=\"mailto:alex%2ebarber%40open%2eac%2euk\"><em>alex<abbr title=\" dot \">.</abbr>barber<abbr title=\" at \">@</abbr>open<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;<br/>\nEduardo Garcia Ramirez\n&lt;<a href=\"mailto:garciaramirez%2eedu%40gmail%2ecom\"><em>garciaramirez<abbr title=\" dot \">.</abbr>edu<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 15, 2004",
        "substantive revision Sat Mar 27, 2021"
    ],
    "preamble": "\n\nFor the purposes of this entry an idiolect is a language the\nlinguistic (i. e. syntactic, phonological, referential, etc.)\nproperties of which can be exhaustively specified in terms of the\nintrinsic properties of some single individual, the person whose\nidiolect it is. The force of “intrinsic” is to exclude\nessential reference to features of the person’s wider\nenvironment, and in particular to their linguistic community.\n\nSome hold that idiolects in this sense do not exist or that the notion\nis useless or incoherent, but are nonetheless happy to use the word\n“idiolect” to describe a person’s partial grasp of,\nor their pattern of deviance from, a language that is irreducibly\nsocial in nature. The substantial debate, here, is not over how to\ndefine a word. It turns, rather, on whether an idiolectal perspective\non language is to be preferred to a non-idiolectal one. Someone taking\nan idiolectal perspective on language treats idiolects (in something\nlike the first sense) as having ontological or investigative priority\nover social languages, conceiving of the latter as nothing but\nmore-or-less overlapping idiolects. Someone taking a non-idiolectal\nperspective will see social languages as ontologically distinct from\nand prior to the individual idiolects of those who speak them. At\nissue, then, is what we should take languages to be.\n\nThe terms of the debate are not quite as simple as this implies. There\nis scope, for example, for a spectrum of views. Perhaps we should be\nidiolectal when thinking about language acquisition but not when\nthinking about the reference of proper names. Perhaps too we should\nrecognize two kinds of linguistic content, only one of\nwhich—narrow content—is best thought of in idiolectal\nterms. Moreover, even someone taking a strongly idiolectal stance will\nwant to qualify the definition of “idiolect” given\nabove—by tying its properties to a person at a specified time,\nin a specified social setting, or on a specified occasion, for\nexample, or by treating the idiolect as belonging not to a concrete\nindividual speaker, replete with a suite of performance errors, but to\na person who is in some respects an idealization and an\nabstraction.\n\nSeveral important debates feature talk of languages that are more\nidiolectal than social. Some are considered in detail in other entries\n(see the entries on\n the language of thought hypothesis,\n private language, and\n externalism about mental content).\n This entry will concentrate instead on one extremely influential\nnon-idiolectal view (Lewis’s account of languages as\nconventions, Section 2, which also discusses Davidson’s\nanti-conventionalism) and one extremely influential idiolectal view\n(Chomsky’s notion of an I-language, Section 3). The entry begins\nin Section 1 with some general remarks about the ontology of\nlanguages.\n",
    "toc": [
        {
            "#LangOnto": "1. Language Ontology"
        },
        {
            "#IdioVersSociLang": "1.1 Idiolects versus Social Languages"
        },
        {
            "#CaseAgaiEnglOtheFolkLang": "1.2 The Case against English and Other Folk Languages"
        },
        {
            "#DebaOverConvLang": "2. The Debate over the Conventionality of Language"
        },
        {
            "#LangUseConvBasiView": "2.1 Language Use as a Convention: the Basic View"
        },
        {
            "#FurtImpoAspeLewiAcco": "2.2 Further Important Aspects of the Lewisian account"
        },
        {
            "#AgaiTreaLangConv": "2.3 Against Treating Languages as Conventions"
        },
        {
            "#ConvResp": "2.4 Conventionalist Responses"
        },
        {
            "#ELangVersILang": "3. E-Languages versus I-Languages"
        },
        {
            "#ChomNotiILang": "3.1 Chomsky’s notion of an I-language"
        },
        {
            "#CaseForILang": "3.1.1 The Case For I-languages"
        },
        {
            "#CaseAgaiELang": "3.1.2 The Case Against E-languages"
        },
        {
            "#FirsRespILangPersNoReprWithRepr": "3.2 First Response to the I-language Perspective: No Representations Without Representeds"
        },
        {
            "#SecoRespILangPersPsyc": "3.3 Second Response to the I-language Perspective: Psycholinguistics"
        },
        {
            "#FurtRead": "4. Further Reading"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Language Ontology\n1.1 Idiolects versus Social Languages\n\nKey to the distinction between an idiolect and a social language is\nthe fact that the same natural language, L, can be picked out\nin either of two ways: L as the language with specified\nlinguistic (semantic, syntactic, phonological, etc.)\nproperties, or L as the language possessed (spoken,\netc.) by a specific individual or population. French, for\nexample, is the language containing an adjective, rouge, that\nrefers to the color red and in its spoken form begins with a voiced\nuvular fricative, etc. But French is also the first language of most\nresidents of France, the lingua franca of Côte\nd’Ivoire, the medium in which Simone de Beauvoir wrote, spoke,\nand thought, etc.\n\nThere is no limit to the number of languages we could conjure up in\nthe abstract using the first mode of individuation. But only a small\nnumber of these abstract objects will be realized in the\nsense of being describable in the second mode—as possessed,\nknown, spoken, understood, or in some other respect used by some\nindividual or population. If we pick out a language as the language of\nsome individual, and believe we can specify its properties by\nreference to the intrinsic properties of that individual, then we are\npicking out an idiolect. If on the contrary we either specify it by\nreference to a community, or specify it by reference to an individual\nbut can only determine its properties by looking to their wider social\nenvironment (identifying salient linguistic authorities, for example),\nthen we are picking out a social language.\n\nLanguage theorists have varying conceptions of what it is for a\nlanguage to be realized. For David Lewis, a language in the abstract\n(which for him amounts to a pairing of sentences and meanings) is\nrealized in a population when it describes a convention governing\ntheir behaviour, in the specific sense summarized in\n Section 2.\n Lewis, then, takes a non-idiolectal perspective. For Noam Chomsky, in\ncontrast, a language is realized in an individual if it is\n“represented” in that individual’s “language\nfaculty”, a component of their brain. The goal of linguists\nworking in the Chomskian tradition is to make what is represented\nexplicit in the form of a theory, a grammar, for that individual.\nThis, then, is an idiolectal perspective. There is a twist, however.\nThe brain properties that most interest Chomsky are species-wide\nrather than unique to any individual, so the “individual”\nis essentially the product of an idealization, useful for helping us\nto understand linguistic competence, a human biological trait. Still,\nwe can persist in calling this an idiolectal perspective in that it\neschews any essential role for languages of discrete linguistic\ncommunities.\n1.2 The Case against English and Other Folk Languages\n\nThe folk, and plenty of self-proclaimed experts, tend to operate with\nan ontology of social languages that most linguists reject. This folk\nontology includes English, Hungarian, Tagalog, Old Norse, etc., and\ncommitment to this ontology has real-world effects, which politicians\nare sensitive to and which sociolinguists can study. But the objects\nthemselves, as opposed to the folk’s beliefs in and about them,\nare generally regarded, by linguists anyway, as fictional or\nideological. Although linguists will inevitably talk of\n“Hungarian” and the like, they tend to take themselves as\nusing a convenient shorthand for “the idiolect of some typical\ninhabitant of Hungary”.\n\nGrounds for rejecting folk ontologies of language vary. Some argue\nthat specifying a folk language’s properties is, unavoidably, a\nprescriptive (and so unscientific) exercise. An example sometimes used\nto illustrate this charge is the meaning of English word\n“livid”. Most dictionaries give its meanings as\n“bluish” or “pale”, in deference to its\ncomplex etymology. Most English speakers lean towards thinking it\nmeans red, after the idiomatic expression “livid with\nrage” and the belief that rage makes a person red. Similarly,\nand to the consternation of many who claim to know what English really\nis, English speakers regularly split infinitives, and see the use of\n“hopefully” in (1) as no less acceptable than its use in\n(2), despite being a “Germanism”.\n\n(1)Hopefully, all the passengers will escape by helicopter.\n(2) The passengers looked hopefully at the helicopter.\n\n\nThe problem with these and similar judgements (Crystal 2007 recounts\ntheir history in the case of English) is not that they are obnoxiously\nconservative, a tool for social exclusion. Often they don’t play\nthis role. Some dictionaries now include red as a possible meaning of\n“livid”, for example, but this, too, is a normative stance\nand it is normativity, not conservativism in particular, that is\nincompatible with a scientific stance. Even liberal views on\nlinguistic acceptability (e.g., that it is okay to end sentences with\na preposition) are prescriptions. In so far as such normativity is\nunavoidable in the determination of the properties of English and\nother languages in the folk ontology, these languages have no place in\nscience (save as a fictional object for sociological\ninvestigation—because belief in the fiction has social\neffects—or as a useful shorthand).\n\nA distinct but related case against the folk ontology is that the\ndelineation of a population as speakers of a single language is\ninvariably driven by geo-political considerations. Serbo-Croatian and\nthe Czechoslovak languages endured only as long as nationalist\npolitics required them to, and ceased to be almost overnight, without\nany major change in how people spoke. Some dialects of the Netherlands\nare closer in their characteristics to dialects in neighboring Germany\nthan they are to dialects spoken on the Netherlands coast, despite\nbeing grouped with the latter but not the former as variants of the\nsame language, Dutch. The concern here is not well captured in the\nobservation that languages in the folk sense are fuzzy. The special\nsciences are replete with fuzziness. Rather, the individuation\nconditions seem arbitrary from a linguistic perspective. The same\narguments against languages in the folk sense apply at the level of\ndialects in the folk sense. Cockneys, and hence speakers of the\ncockney dialect, are traditionally required to have been born within\nearshot of the bells of Bow Church in east London, but noise pollution\nand demographic change have rendered that definition absurd. No matter\nhow fine-grained a version of the folk ontology one seeks out, similar\nproblems will recur.\n\nRuling out folk-ontological languages does not necessarily push us\ninto an idiolectal direction. Nothing said so far speaks against the\npossibility of technical notions of a social language that side-step\nthe normativity or arbitrariness built into their folksy cousins\n(assuming such side-stepping is indeed needed). Lewis’s account\nof language as a convention is, arguably, in this category.\n2. The Debate over the Conventionality of Language\n2.1 Language Use as a Convention: the Basic View\n\nLewis’s (1975) take on human languages results from his attempt\nto solve an apparent paradox. On the one hand, languages are functions\nfrom sentences to meanings, and a theory of meaning for any language\nwill describe such functions. On the other hand, a natural\nlanguage is a social practice followed by a given population. It seems\nthat languages (simpliciter) and natural languages belong to deeply\ndifferent categories, raising the puzzle of how the two might be\nrelated. One difference is that there are indefinitely many languages,\nbut the great majority are not even potentially natural languages.\nThey could not be learned, acquired, or deployed by humans because\nthey have an infinite lexicon, for example, or infinitely many rules\nof composition, or allow for an unlimited embedding of subordinate\nsentences. Another difference is that languages are abstract objects\nwhile a natural language appears to be a concrete thing that, by\ndefinition, is learned, acquired, and developed by members of a\nspecific human population.\n\nLewis claims that we can incorporate both perspectives within a single\nview. Natural languages, he says, are a proper subset of the set of\nlanguages. More specifically, a natural language is a function\nL from sentences to meanings that a particular population uses,\nwhere this use of L is governed by a convention of\n“truthfulness and trust in L”. To understand this\nproposal, we need to understand (a) Lewis’s conception of the\nmotive a population might have to use L, (b) what he means by\n“convention”, and (c) how he thinks a language—a\nfunction from sentences to meanings—could figure within a\nconvention thus understood.\n(a) At the most general level, members of any population often want\nthe others to think and act in a particular way. This requires them to\nrecognize each other’s intentions, share thoughts, and to act\naccordingly. Members of the population must therefore find a way to\ndisplay their intentions, etc., and, in equal measure, to recognize\nthe intentions, etc., of others. Using the same language (i.e., the\nsame function from sentences to meanings) to convey their mental\nstates offers an excellent way of meeting this need. It gives members\nof the population a way to “control others’ beliefs and\nactions to some extent by means of sounds and marks” (Lewis\n1975: 166). Lewis explains how they do this—and in particular\nhow they settle on the same language—by invoking his general\nnotion of a convention.\n(b) A convention is a practice that solves a coordination problem\nwithin a community. The solution will bring mutual benefits but it\nwill also be arbitrary. For example, the practice in North America of\ndriving on the right is a convention in this sense: it is a mutually\nbeneficial practice, but at least one other solution to the problem of\navoiding head-on collisions is available: driving on the left. Natural\nlanguages (i.e., the use of languages by populations along the lines\ndescribed in (a)) seem to be conventions in this simple sense. The\nexistence of shared meanings within a community is clearly of mutual\nbenefit, as evidenced, for example, by the use of English among\nEnglish-speaking populations. It allows members of a population to\nlearn one another’s thoughts about the world, for example. But\nthere are many other solutions to the problem of finding out one\nanother’s thoughts about the world, such as using Spanish or\nJapanese, so the choice is arbitrary.\n\nMoving beyond this simple account of conventionality, Lewis tells us\nthat a convention in his sense is a regularity R in action\n(driving on the left, for example) or in belief within a population\nP for which the following six conditions nearly always\nhold:\n\nEveryone conforms to R.\nEveryone believes the others conform to R.\nThe belief in (2) gives each believer a (practical or epistemic)\nreason to conform to R.\nGeneral conformity is generally preferred to\nslightly-less-than-general conformity.\nR is not the only regularity that could satisfy (3) and\n(4).\n(1)–(5) are known matters of mutual knowledge: they are\nknown to everyone, and it is known that they are known to everyone,\nand so on.\n\n\n(2) and (3) jointly predict that R perpetuates itself within\nthe community (as in (1)), despite being (according to (5))\narbitrarily chosen. A convention is stable within a community because\nit is rational for each member of the community to abide by it. (The\n convention\n entry goes into more detail.)\n\n(c) How could the use of a language in Lewis’s sense (a function\npairing sentences with meanings) be a convention in his sense, i.e., a\nregularity satisfying conditions (1) to (6)? Lewis’s answer is\nthat the regularity, the R, is the practice of being truthful\nand trusting in a language, L. When this practice is a\nconvention in a community, L is the community’s language.\nTo be truthful in L is to utter a sentence only if one believes\nthat what it means in L holds. To be trusting in L is to\nbelieve whatever is meant in L by the sentences one hears\nuttered. Together, these conventions give rise to a basic two-way\ncooperation, with speakers being truthful and hearers being trusting.\nWithout this two-way coordination the coordination problem would be\ndifficult (if not impossible) to solve. If speakers are not truthful,\nwhat they say is not trustworthy evidence of what they think. If\nhearers are not trusting, what speakers say is not useful to get\nhearers to believe and act in the intended manner.\n\nPutting this together with the six conditions that define what it is\nto be a convention, a language L is the natural language of a\ngiven community when the following six conditions hold, at least to a\nsignificant degree:\n\nEveryone is truthful and trusting in L.\nEveryone believes the others are truthful and trusting in\nL.\nThe belief in (2) gives each a reason to be truthful and trusting\nin L.\nGeneral conformity to truthfulness and trustfulness in L is\ngenerally preferred to slightly-less-than-general conformity.\nL is not the only language that could satisfy (3) and\n(4).\n(1)–(5) are known matters of mutual knowledge: they are\nknown to everyone, and it is known that they are known to everyone,\nand so on.\n\n2.2 Further Important Aspects of the Lewisian account\n\nSection\n 2.1\n gives the basic vision of natural languages as the embodiment in a\npopulation of a convention defined in terms of a language in the\nabstract sense. There are three further features of Lewis’s view\nthat merit emphasis: his explanation of why natural languages must be\ncompositional, his disclaimer that his account is but an idealization,\nand the fact that his is a theory of expression meaning rather than of\nspeaker meaning.\n\nFor the coordination problem within P to be solved by using\nL, all members of P must be in a position to determine\nthe meaning of all the sentences of L. In other words, it must\nbe that members of P have a way to identify the function that,\nfor any given sentence, will deliver the corresponding meaning. Given\nthe limitations of speakers, both physical and cognitive, there must\nbe a finite and simple way to do this. The compositionality of\nL can help explain how this is possible (see entry on\n compositionality).\nRoughly put, for L to be compositional is for the meaning of\nall complex expressions\ne1…en of L to be\nfully determined by the meaning of their parts and by the way such\nparts are composed. Thus, the functions that map sentences into their\nmeanings will take into account the meaning of their parts and the way\nthey are combined.\n\nBut language use exhibits several problematic features that must be\naccommodated: indexicality, context sensitivity, ambiguity, etc. To\nproperly account for these features, the relevant meaning functions\nmust take several variables as arguments. It will not be a simple\none-to-one mapping from sentence to meaning, but a more complex\nmapping of a sentence together with a speaker, a time, a world, and\nwhat have you, onto a corresponding meaning. Lewis is aware of this,\nand includes it as part of what L should be like if it is to be\nused by P. So long as members of P know this about\nL, and use it while abiding by the conventions of truthfulness\nand trust, there should be no serious trouble. (To say that speakers\nknow this is not to say that they can, upon request, explicitly\ndescribe how it is that L works, but to say that they have\nimplicit knowledge of L, such that they can successfully use\nL to communicate with and understand other members of\nP.) Lewis calls the situation of a language’s being\nrealized in this way a “perfect case of normal language\nuse”. That is, it is at best an idealization in need of\nrefinement. Chomsky and Davidson (below) can be thought of as in\ndifferent ways suggesting that the conceptualization offered here of\nlanguage and its realization is fundamentally mistaken and not merely\na rough draft.\n\nLewis’s is an account of expression meaning and as such\nit is sometimes seen as a useful complement to an intention-based\naccount of speaker’s meaning, such as Paul\nGrice’s. Speaker’s meaning in the Gricean tradition is\nidentified with the effect that, in performing a given utterance, the\nspeaker intends, by means of the audience’s recognition of this\nvery intention, to produce in that audience. The exact form\nmeaning-bestowing intentions take is a matter of debate and not\nespecially relevant here (see entry on\n Paul Grice).\n But a theory of individual speaker’s meaning requires, in\naddition to an accurate statement of the meaning-bestowing intentions,\na complementary theory of expression meaning. Only with the latter can\nwe account, first, for the expectation on the part of the speaker that\nshe or he will be interpreted as intended (and some expectation of\nsuccess is a precondition for the formation of any intention); and\nsecond, for the rate of success in audience uptake. Grice originally\nrelated expression meaning to speaker’s meaning by suggesting\nthat:\n\n\n[expression] x means (timeless[ly]) that\n“so-and-so” might as a first shot be equated with some\nstatement or disjunction of statements about what “people”\n(vague) intend…to effect by x. (Grice 1957: 385).\n\n\nLewis’s convention-based account of expression meaning is\ngenerally thought to be a vast improvement on this crude early effort.\nBut equally, Grice’s account of speaker’s meaning gives us\nsomething missing from Lewis’s. For there to be a convention of\nbeing truthful and trusting in L, there has to be something it\nis to speak with a particular meaning on an occasion, and\nGrice’s theory gives us this.\n2.3 Against Treating Languages as Conventions\n\nIn “A Nice Derangement of Epitaphs”, Donald Davidson\nargues that languages, if they are “anything like what many\nphilosophers and linguists have supposed”, do not exist (1986:\n446). He does not list the philosophers and linguists he has in mind,\nbut somewhere near the centre of the cloud of positions he is\ncriticizing is Lewis’s conventionalist\n theory.[1]\n More broadly, he rejects the notion of socially established links\nbetween expressions and meanings, shared participation in which\nenables a community to communicate. Davidson’s article is\njargon-rich and so his argument is tricky to unpack. In this statement\nof it, we begin by explaining his formulation of the view he rejects,\nthen outline his case against the view so\n formulated.[2]\n\nThe view is expressed as the claim that first meaning is shared,\nsystematic, and prepared. To see what he means by “first\nmeaning”, consider Grice’s famous example of a testimonial\nfor an academic job candidate:\n\n\nDear Sir, Mr X’s command of English is excellent, and his\nattendance at tutorials has been regular. Yours, etc. (Grice 1975:\n33)\n\n\nThe author’s insinuation—that Mr X is a weak\ncandidate—is arrived at only via a prior interpretation of the\nexpressions as they are used in the utterance. This prior\ninterpretation is the first meaning. The contrast implicit in\n“first” is with the insinuations or implicatures one\nsubsequently goes on to read into the utterance. Davidson uses\n“first” meaning in an effort to avoid the terms\n“literal” or “conventional” meaning because\nthe thought that there is a level of meaning that is somehow\ndetermined independently of the communicative act, by linguistic\nconvention, is exactly what he plans to challenge. “First\nmeaning” is to be understood more neutrally as the initial\nmeaning the utterer intends you to ascribe to the uttered expressions\nin the context of a particular utterance.\n\nOn the view Davidson rejects, successful communication happens because\nthis first meaning is shared (i.e., utterer and audience\nassign the same first meaning), prepared (i.e., it was\navailable to both utterer and audience prior to the utterance) and\nsystematic (i.e., capturable in a compositional theory). All\nthree properties are implicit in the conventionalist supposition that\nexpressions have their meaning specified within the social language\nfrom which they are drawn. We might conceptualize this social language\nas English, or instead as a convention in Lewis’s technical\nsense. If the latter, the claim Davidson has in his sights is that\ncommunication within a given linguistic community is made possible by\na (shared, prepared, systematic) convention to be truthful and\ntrusting in some L. Davidson denies that there is any such\nL.\n\nHis argument against first meaning’s being systematic, shared,\nand prepared emerges from reflection on various linguistic phenomena,\nall of which have in common that “the speaker expects to be, and\nis, interpreted as the speaker intended, although the interpreter did\nnot have a correct theory in advance” (1986: 440). Grice’s\nexample does not fit this description. It does not,\ntherefore, threaten the thought that the first meaning (about regular\nattendance) is the simple product of an antecedently shared\ncompositional theory. Malapropisms, on the other hand do fit the\ndescription. Here is the original Mrs Malaprop addressing Captain\nAbsolute in the exchange that gives Davidson’s paper its\ntitle:\n\n\n[I]f I reprehend anything in this world, it is the use of my oracular\ntongue, and a nice derangement of epitaphs! (Richard Sheridan, The\nRivals, Act III, Scene 3)\n\n\nCaptain Absolute manages to figure out the first meaning of Mrs\nMalaprop’s utterance, which is that if she understands\n(comprehends) anything it is the use of her own vernacular tongue and\na nice arrangement of epithets. Davidson offers an intuitive\ndescription of what is going on in this case, a description that\napplies equally to regular communicative exchange. He then argues that\nthis description of communicative exchange is incompatible with the\nclaim that first meaning is systematic, shared, and prepared—and\nso conventional.\n\nThe intuitive description is couched in terms of prior theories and\npassing theories of first meaning, defined for an arbitrary utterer\nS and intended audience H as follows:\n\n\nH’s prior theory: How H is prepared in\nadvance of S’s utterance to interpret the expressions in\nit\n\nS’s prior theory: What S believes\nH’s prior theory to be\n\nS’s passing theory: The theory S intends\nH to use to interpret the expressions in S’s\nutterance\n\nH’s passing theory: How H in fact\ninterprets the expressions in S’s utterance\n\n\nSuccessful communication at the level of first meaning happens\nwhenever S’s and H’s passing theories\ncoincide, notwithstanding any disagreement in prior theories. Letting\nS be Mrs. Malaprop and H be Captain Absolute, their\nprior and passing theories assign meanings to “epitaph” as\nin the table below:\n\n\n\n\nS\nH \n\nMeaning of “epitaph” in prior theory\nepithet \nepitaph  \n\nMeaning of “epitaph” in passing theory\nepithet \nepithet  \n\n\n\nNeither meaning-according-to-prior-theories nor\nmeaning-according-to-passing-theories have all three of the properties\nrequired to make them conventional. Specifically:\n\nPrior theories are systematic and prepared, but not shared.\nPassing theories are systematic and shared, but not prepared\n\n\nDavidson anticipates the simple response that two interlocutors\n“share the same language” if their prior theories overlap\nclosely enough that they can exploit ad hoc strategies for\ninterpretation, such as that used by Captain Absolute and the theatre\naudience, i.e., searching for a similar sounding word that makes sense\nof the utterance in context. But these “principles of …\ninventive accommodation are not themselves reducible to theory,\ninvolving as they do nothing less than all our skills at theory\nconstruction”. In other words:\n\n\nSuch a capacity, though shared and prepared, is not systematic.\n\n\nTo put the claim as a charge against Lewis in particular: there is no\nL, no pairing of sentences and meanings, such that\ncommunication as it actually occurs is made possible by virtue of a\n(shared, prepared, systematic) convention to be truthful and trusting\nin L.\n\nMalapropisms may seem like a marginal phenomenon to be treated as a\nspecial case. But Davidson thinks the point generalizes, and that\nachieving passing-theory agreement involves far more work than\nparticipating in a convention. For a start there are plenty of\nrelevantly similar phenomena (metaphor, polysemy, incomplete\nsentences, unfamiliar names, and performance errors such as slips of\nthe tongue or temporary confusion over whether to use\n“underestimated” or “overestimated” after\n“cannot be”). Indeed, even where there is\nprior-theory agreement, general intelligence and not simply\napplication of a known convention must be exercised by both speaker\nand audience to appreciate this fact.\n2.4 Conventionalist Responses\n\nDavidson’s position, conceived as an objection to Lewis, comes\nwith three separate claims. First, as demonstrated in the case of\nmalapropisms, antecedent knowledge of L prior to a given use\nmay not be enough to reach successful communication, because\n“prior meanings” may not coincide between speaker and\nhearer and, thus, antecedent knowledge is not mutual. Second, once the\nrelevant use takes place, mutual knowledge of L is reached,\nwhich is enough to achieve communication, but such knowledge is not\ngrasped antecedently. Third, the move from insufficient antecedent\nknowledge of L to successful communication may happen in virtue\nof non-linguistic knowledge (i.e., practical reasoning, explanatory\nreasoning, general knowledge, etc.), but this knowledge is not\nsystematic.\n\nLewis, it seems, has a way to reply to Davidson’s objection.\nWe will only sketch such a reply here. Recall the central tenets of Lewis’s\naccount. First, languages (all of them, including natural ones) are\nabstract objects, a function from sentences to meanings. These\nfunctions may be as complex as required; they may take as arguments more\nthan just sentences (i.e., occasions of use, times, worlds, speakers,\netc.). As with any abstract object, these functions are what they are\nindependently of any convention that may hold among human populations.\nSecond, humans face a coordination problem. To solve it, they use some\nlanguage or other, some abstract set of functions or other. Third, for\nthe use of an abstract object L to successfully solve the\ncoordination problem among members of a population P, at least\ntwo conventions must hold among members of P: the conventions\nof truthfulness and of trust in L. Finally, it is assumed that\nmembers of P know all relevant functions, or have a way to know\nthem, for any possible sentence of L. In short, members of\nP antecedently know (in some sense) all the relevant\nsentence-to-meaning functions of L.\n\nNow, Davidson presents us with a case where antecedent knowledge of\nL is not enough to guarantee communication and, hence, to solve\nthe coordination problem that Lewis has in mind. Yet, there clearly is\na way in which speakers manage to solve the coordination problem even\nin cases of malapropisms. Davidson suggests that this is done in\nvirtue of using non-linguistic knowledge (e.g., using practical\nreasoning, explanatory reasoning, etc.). To see if such uses of\nL really constitute a counterexample to Lewis’s position\nwe must ask ourselves if, in solving this coordination problem,\nspeaker and hearer do observe the conventions of truthfulness and\ntrust in L, or if they simply reject them in order to\nsuccessfully communicate.\n\nA quick glance at Davidson’s example suggests that, even in\ncases of malapropisms, speaker and hearer do observe the said\nconventions. Both speaker S and hearer H presuppose that\nthey are using the same language, even though they do not realize that\nthis is not exactly true (i.e., in virtue of having different\nprior theories they do not share the same prior-L);\nyet, despite her malapropism, S is still being truthful.\nH assumes S to be truthful, and so finds a way to\nreinterpret S by engaging in practical, explanatory, or another\nform of general reasoning. Thus, we must take H as observing\nthe convention of trust, for otherwise H’s diagnosis of\nS’s malapropism (together with H’s\nreinterpretation of S’s original utterances) would be\nabsurd. Furthermore, it seems that something like an assumption of\ncompositionality is also in place, for otherwise it would be strange\nfor H to (so to speak) interpolate the expression “a nice\nderangement of epitaphs”, which seems to compose its meaning in\njust the same way as “a nice arrangement of epithets”.\n\nFrom here a Lewisian reply could follow either one of two strategies.\nOne would be to allow that the account does not extend to malapropisms\nbut treat malapropisms as a special case, an example of a non-purely\nlinguistic phenomenon that, as such, necessarily involves general\nintelligence. The success of this strategy depends on how\ngeneralizable these cases are.\n\nA second strategy would be to revise the theory in order to include\ngeneral intelligence as a central element. This should not have to be\nproblematic since Lewis’s theory is meant as an idealization. As\nLewis notes, general intelligence is already needed to deal with\nvagueness, indexicality, and other phenomena. Nor would Lewis be alone\nin claiming this. Some have claimed that “pragmatic determinants\nof what is said” are at work in every single utterance. (For\nmore on this same theme, see the entries on\n pragmatics\n and\n defaults in semantics and pragmatics.)\n\nThis second strategy might itself be developed in two distinct ways,\nin an effort to show its compatibility with the broad sweep of\nLewis’s theory. First, it could be admitted that there is no\nprior L with respect to which the conventions of truthfulness\nand trust both hold. The conventions hold, however, with respect to\ntheir passing theories. Participants arrive at these passing\ntheories from their (potentially divergent) prior theories plus some\ngeneral intelligence. Compositionality, moreover, also plays an\nessential role in the extraction of passing theories from prior\ntheories, with the conventions of truthfulness and trust being\nobserved in the resulting passing L. However, the principle of\ncompositionality would have to be weakened so as to not consider the\nstrictly linguistic process it describes as fully determining meaning,\nthus leaving room for extra elements to take part. Alternatively,\nthere could be truthfulness and trust in prior L if\nLewis’s fine-grained individuation of languages is rejected. On\nthis second version of the theory, one and the same L may\nsometimes have different sentence-to-meaning mappings; alternatively,\nit could be claimed that the conventions hold with respect to\ndifferent common Ls or a set of sufficiently similar such\nlanguages.\n\nWith appropriate extrapolation, then, Lewis’s main tenets may be\nperfectly compatible with Davidson’s own description of these\nsupposedly troublesome cases. Even in cases of malapropism, speaker\nand hearer are trying to solve a coordination problem by using a\ncommon language L (i.e., a common passing L, a common\nopen or dynamic L, or a common set of sufficiently similar\nLs) in a way that observes the conventions of truthfulness and\ntrust. Of course, Lewis must include some form of general explanatory\nreasoning, thereby contradicting his apparent assumption that\nsuccessful uses of L are fully systematic (or compositional).\nYet it is worth considering how damaging this would be for\nLewis’s account. It seems clear that something like\nLewis’s theory (including some appropriately weakened version of\nhis compositionality assumption, such as that developed in\nGarcía-Ramírez 2019), will be needed.\n3. E-Languages versus I-Languages\n3.1 Chomsky’s notion of an I-language\n\nThe “I-” in “I-language” is short, not for\n“idiolectal”, but for a cluster words that connote an\nidiolectal approach and coincidentally begin with the same letter,\nespecially “internal” and\n “individualistic”.[3]\n “E-language” is used critically by Chomsky to refer to\nthose things, whatever they are, that are the target of study for\nthose who take languages and their properties to be external to the\nmind. This includes many philosophers of language. Chomsky’s\ncase for introducing and using the notion of an I-language is, in the\nend, indistinguishable from his case for a cognitivist approach to the\nstudy of language as a natural phenomenon. And his case against\nE-languages is that there is no scientifically coherent project to\nwhich they belong as posits.\n3.1.1 The Case For I-languages\n\nOnce one sees beyond the technicalities, Lewis’s notion of\nnatural languages approximates to the ordinary notion of languages as\nthings we use to communicate with others in a linguistic community.\nChomsky’s notion of a language as an object internal to the\nhuman mind or brain can seem odd from this perspective. We can dispel\nthis sense of oddity by appreciating the scientific project from which\nthis usage of “a language” emerges. The fact that a usage\nfails to mesh with ordinary thinking hardly constitutes an objection\nto the usage if the project housing it is a good one. Ordinary\nthinking would struggle to accept mass as one of energy’s\npossible forms, but this gives physicists no cause to pause.\n\nChomsky’s project is to work towards a scientifically credible\nunderstanding of a natural object, the human brain. More feasibly, his\nambition is to make progress on understanding those aspects of the\nbrain that are central to our nature as linguistic beings. A\nreasonable starting hypothesis for such an inquiry is that a\nfunctionally discrete part of the brain, the “language\nfaculty”, is responsible for core elements of our capacity to\nuse language. If this hypothesis is right, other parts of the brain,\nand plenty that lies outside the brain in our external social and\nphysical environment, may well combine with this language faculty to\nproduce linguistic behaviour; but the inquiry itself is limited to\nunderstanding the language faculty itself. This voluntary limitation\nhas a rationale. Our overt behaviour is extraordinarily complex, an\nintractable interaction effect, so we need to be appropriately modest\nin our explanatory ambitions. A scientific understanding of the\ninternal workings of the language faculty would in itself be a massive\nachievement. Linguistic behaviour—the sounds language-users\nproduce, their description of certain constructions as ungrammatical,\netc.—can supply defeasible evidence for or against hypotheses we\nmake about the language faculty proper, but we should not treat the\ndescription of overt behaviour as the goal of study. (In an earlier\nincarnation of much the same point, Chomsky distinguished between core\ncompetence and the use of that competence manifest in overt\nperformance, arguing that competence is far more promising an\nobject of linguistic inquiry than the latter. He moved away from this\nterminology after it gave rise to persistent misinterpretations.\nCompetence, for example, has unintended normative\nconnotations—we speak of people as having “poor competence\nin Spanish”.)\n\nWhile this captures the sense in which Chomsky is taking an\ninternalist (and individualist) approach to the study of language, it\ndoes not yet reveal where the notion of a language, internalized or\notherwise, sits within the approach, or why any appeal to\nlanguages (with “language” used as a count noun\nrather than a mass noun) is needed at all. Chomsky’s discussion\nof language acquisition can provide us with a good illustration of\nthis further step. It will also bring out a revealing contrast with\nLewis’s approach (see\n 2.1).[4]\n\nLewis, we saw, thinks a language is an arbitrary pairing of sentences\nand meanings. This arbitrariness is overcome through the co-ordination\nembodied in a conventional practice, an E-language in Chomsky’s\nterminology. Chomsky does not deny the existence of some linguistic\narbitrariness, manifest in linguistic diversity but he holds that this\ndiversity is limited by human psychology (1995a: 15f). On a\n“learning” model of language development, which Chomsky\nrejects, infants are little scientists observing and inferring the\nlinguistic conventions prevailing among adult users (e.g., to be\ntruthful and trusting in some L). But these learners could not\npossibly rule out all but one of the languages that are logically\ncompatible with the data. Even if the child was exceptionally smart,\nthe evidence available in the typical linguistic environment is\ninsufficiently rich—there is a “poverty of\nstimulus”. If the information in a child’s environment is\ntoo poor to account for developments in her competence, anterior\nknowledge must be providing her with mental stirrups (see Laurence and\nMargolis 2001 and the entry on\n innateness and language).\n\nThis is the context in which introducing talk of I-languages can be\nuseful, according to Chomsky (1986: 22–3; 2000: 4–5).\nLanguage acquisition can be thought of as a development through states\nof the brain from S0 through intermediate states\ninto a relatively stable mature state, SM.\nS0 is the initial state common to all humans,\nidealizing away from individual linguistic impairments and the like.\nSubsequent states arise through exposure to a particular linguistic\nenvironment. Nothing said so far requires that these states be thought\nof as representational states we could call “knowing a\nlanguage”. But if we describe being-in-state\nSL as knowing a language L, knowledge that\na linguist might in principle make explicit in a theory of L,\nlanguage acquisition can be described—usefully—as a matter\nof children evolving through various stages of knowledge en\nroute to acquiring adult competence. This description is\nuseful because the empiricist/nativist debate can now be couched as a\ndebate over what linguistic information must already be known by\nsomeone in S0 if information supplied by the\nlinguistic environment is to culminate in knowledge of the mature\nlanguage M. Empiricists claim that nothing much is needed, that\nS0 is a “blank slate” to be filled in\nusing environmental data. Nativists claim that plenty of information\nmust already be provided, in the form of innate knowledge of a\nlanguage dubbed Universal Grammar (UG) by Chomsky. We each come\npredisposed to acquire only certain languages, the humanly possible\nones that can grow out of UG.\n\nAn I-language, then, is something that is represented in the language\nfaculty of an (idealized) individual at a particular stage of\ndevelopment. But it is not anything beyond the language faculty.\nStatements about I-languages being represented in the brain are\n“statements about the structures of the brain formulated at a\ncertain level of abstraction from mechanisms” (1986: 33). In\nother words, to talk of the language faculty as representing some\npiece of information is simply one way among others of giving an\nabstract description of the language faculty, a human\n“organ” (Chomsky 1975: 10; Anderson & Lightfoot 2000).\nAnother way might be to describe it in chemical terms, but the\nrepresentationalist description is—for reasons just\nsketched—rather more helpful than a chemical one within the\ncontext of explaining language acquisition. A grammar for an\nindividual, a linguistic theory in other words, is an abstract\nstatement of this I-language, but what it purports to describe is\ntheir language faculty, not something external to it.\n\nAs theoretical posits, I-languages earn their keep through their role\nin this kind of enquiry. By treating states on the path to normal\nmature linguistic competence in humans as representational states,\nstates of knowledge (where what is represented or known is an\nI-language), important empirical generalizations can be formulated and\nassessed. One would not even have to sit at the nativist end of the\nspectrum in the debate on language acquisition to accept this way of\nframing the question. Moreover, this conception of the brain as a\nrepresentational, information processing system, or as an integrated\nbundle of such systems, has application beyond the specific instance\nof language, developmental or otherwise. Chomsky’s case against\nbehaviorism in the study of language (1959), and his alternative\nvision of how it might be studied, was pivotal in the cognitive\nrevolution across psychology and affiliated disciplines (see e.g.,\nGlass, Holyoak, & Santa 1979; Marr 1982; Pylyshyn 1984; Fodor\n1987).\n3.1.2 The Case Against E-languages\n\nChomsky does not deny that language (in the mass-noun sense) is at\nleast in part “a social product” (1986: 18). He cites\nPutnam’s famous “division of linguistic labor”\nhypothesis (Putnam 1975), for example, arguing that, suitably\ndescribed, the phenomenon of semantic deference is compatible with his\ninternalized perspective. The E-languages (“E-” for\n“externalized”) of which he is skeptical are languages in\nthe count-noun sense. These objects have properties that are\nindependent of the mind/brain, or of the language faculty in\nparticular. He offers a number of examples (1986: 19):\nBloomfield’s view that a language is a totality of utterances\nthat can be made in a speech community; Saussure’s notion of a\nlangue (an arbitrary association of sounds with concepts);\nand Lewis’s pairing of sentences and meanings, the actual\nlanguage of a population when the regularities described earlier hold.\nChomsky also includes any system of actions or behaviours, where this\nsystem is individualist but is the product of a myriad of performance\nsystems interacting with the language faculty and each other. A\ngrammar, on the E-language approach, purports to describe these\nmind-external (or at least language-faculty external) entities.\n\nBecause there is considerable variety here in the underlying\nconceptions of languages, Chomsky’s criticisms can seem\nsweeping, but the underlying thought is that, because E-languages are\nless “real” than I-languages, “the concept [of an\nE-language] appears to play no role in the theory of language”\n(1986: 26). The argument for this negative conclusion is not so\ndifferent from the positive argument for an I-language perspective\noutlined in\n 3.1.1.\n Linguistic behaviour is the product of both the language faculty on\nthe one hand and external influences—performance systems in the\nmind/brain of the individual and social factors—on the other. At\nissue is not whether anything at all can ever be said, usefully, about\nthese “downstream” effects, but whether the notion of an\nE-language has any pivotal explanatory role to play in saying it (save\nas a useful shorthand). Nothing much is added to the account of\nlanguage learning in\n 3.1.1,\n for example, by describing it as development towards the learning of\nan externalistically specified social language, as opposed to some\nspecific mature state, SM, of an individual.\n\nOne apparent corollary of this is significant for those many\nphilosophers of language who have agonized over how to construct a\ntheory of meaning for English. A common thought is that such a theory\nought to take the form of a statement of the referential properties of\nthe expressions of English—a link between words and objects in\nthe world—from which the truth conditions of all English\nsentences can be derived (e.g., Davidson 1970, Montague 1970; see the\nentries for\n theories of meaning\n and\n reference).\n Echoing P.F. Strawson (1950), Chomsky suggests that referring is\nsomething people do. They use words in doing so, it is true, but\nreferring is not something that words somehow do by themselves,\nthrough some fantastical medium, English (2000: 40–1). If\nreferential properties of expressions amount to anything, rather than\nbeing relational properties between expressions and external objects\n(or “word-world” relations) they should be thought of as\nembodying instructions to the individual’s conceptual system,\none of the performance systems with which the language faculty\ninterfaces (an idea explored in Jackendoff 2002). If Chomsky is right,\na great deal of the philosophy of language is either radically off\nbeam or needs considerable re-interpretation (see Hornstein 1989,\nLudlow 2003, Pietroski 2003, Stainton 2006).\n3.2 First Response to the I-language Perspective: No Representations Without Representeds\n\nCriticisms of Chomsky’s internalism, and so by implication his\nnotion of an I-language, stretch back over half a century, as do his\nresponses. Three collections (George 1989; McGilvray 1999; Antony and\nHornstein 2003) between them contain a full array of philosophical\ncommentary. In this and the next section we focus on concerns that\nhave particular currency.\n\nMany critics have focused on an unacknowledged commitment to\nexternalism that they think is implicit in Chomsky’s\nterminology. The charge can be made using any of the different\nphrasings he has used to express his internalism, including\ncompetence, knowledge, and representation.\nFor the first: competence implies competence in something.\nFor that something to be defined in terms of the language faculty\nitself, there would be no such thing as incompetence, making a\nnonsense of talk of competence. Error would be impossible (see Barber\n2001). For the second: knowledge implies something known—an\nexternal language or some subset of its properties. Chomsky has\ndescribed these criticisms as arising from a misinterpretation of his\nview, and said that he was using competence and knowledge in a\ntechnical sense rather than in full accordance with ordinary usage. He\nhas occasionally suggested “cognize” as an alternative\nterm of art to prevent confusion, where to cognize an I-language is\nfor it to be represented in one’s language\n faculty.[5]\n Recent iterations of the criticism have thus tended to focus on\nrepresentation. It seems that there can be no representing without\nsomething’s being represented—something external to the\nthing doing the representating, and so external to the language\nfaculty or even the individual. Chomsky’s response has been to\nsay that he is not using representation in a relation sense,\nrepresentation of (1995a: 53 and in Antony and\nHornstein 2003: 276–7).\n\nThe notion of representation is central to a good deal of cognitive\nscience and is a topic that has preoccupied many philosophers of mind\nand language who share Chomsky’s naturalistic bent. Many of the\nlatter have been surprised and puzzled by his rejection of both the\nrelational notion of representation (where the relation is between\nvehicles of representation in the mind/brain, and the things they\nrepresent) and attempts to define this relation in naturalistic\nlanguage (see\n causal theories of mental content,\n intentionality, and\n mental representation).\n Georges Rey, for example, sees the intentionality, the\n“aboutness”, implicit in the notion of representation as\nessential to the computational-representational theory of\nmind—precisely the theory that he and others think\nChomsky’s work has helped to inspire and shape (Rey 2003a,b\n& 2005). Rey concludes that Chomsky is mistaken about the status\nhis own theory, and offers instead what he thinks is a more charitable\ninterpretation: that the representations are of something, but\ntypically inaccurate and harmlessly so.\n\nIn the earlier presentation\n (3.1.1)\n we tried to capture Chomsky’s arelational notion of\nrepresentation, where to describe something as representating an\nI-language is simply a way of describing it abstractly. John Collins\nhas gone to greater lengths to make good this suggestion that there\ncould be representations without representata (2014). Adopting “dyadic\nrepresentational talk” helps us to “frame generalizations\nabout monadic representational states”, he says. Representata\nare no more than the byproducts of a grammarians’ attempt to\ntype non-relational states the mind/brain can be in or pass through.\nInvoking them does not generate any ontological commitment to\nlanguages external to the mind/brain being described.\n\nFrances Egan has taken a view that appears to capture the spirit of\nChomsky’s attitude to representation while also making room (and\nseeing the need) for a relational notion of representational content\nin cognitive explanation (generally, and in linguistics in\nparticular). According to Egan (2003, 2014), representational\ncontent—the dyadic notion, that is—figures in cognitive\nexplanation, but not in the way orthodoxy would have it. The internal\ncomputational mechanism alone, uninterpreted, does the explaining.\nThat this mechanism has the representational content it does figures\nonly within the explanans. It is used to specify the explanandum.\nThis explanandum, and hence any allocation to it of content, will\noften be quite vaguely characterized, and may even fail to correspond\nto anything real.\n\n\nBecause the mechanism, as computationally characterized, would not\ntrack these [external] properties in every environment, the semantic\ninterpretation of the device is not an essential characterization, and\ncannot serve to individuate it. However, the semantic interpretation\nenables us to specify the cognitive function of the mechanism, to\ncharacterize it as computing [visual] depth from disparity, for\nexample, or as computing the syntactic structure of a sentence. (Egan\n2014: 98)\n\n\nThis is arguably in the same spirit as Chomsky’s description of\nthe language faculty as “providing instructions” to\nperformance systems (1995b: 15). Representations in the language\nfaculty corresponding to elements of a grammar such as [voiced coronal\nsibilant], for example, do not stand for movements of the mouth (such\nas the one produced at the beginning of an utterance of the English\nword zebra), but they might nonetheless be part of the causal\nstory of why a human moves her or his mouth in a particular way in\nparticular circumstances.\n\nMany of those engaged in this debate focus on cases such as the edges\nin Kaniza’s triange illusion (figure 1) or PRO (a sytanctic\nconstituent to which nothing corresponds in the sound-stream). The nub\nof the issue, here, seems to be what to make of the fact that there is\nno edge, or no syntactic constituent, beyond the edge or syntactic\nconstituent represented in our mind-brain. The same might even hold of\nthe notion of a common language. What we make of this for the nature\nof cognitive explanation, and of the notion of representation that so\ntypically figures within it, is yet to be settled, and goes to the\nvery heart of the philosophy of cognitive science.\n\n\n\nFigure 1. Kanizsa’s Triange (from\n Wikimedia Commons, by User:Fibonacci)\n\n3.3 Second Response to the I-language Perspective: Psycholinguistics\n\nMore recently, a whole field of scientific research,\npsycholinguistics, has been precisely dedicated to studying external,\nanti-individualistic, mind-independent properties of language,\nmassively advancing our understanding of language development in the\nprocess (see Hoff and Shatz 2007). The guiding assumption within this\nfield is that external factors, such as the child’s social and\nphysical environment, can play a substantial role in determining both\nthe child’s linguistic competence and the vocabulary and syntax\nof the acquired language. On this view, such external factors supply\nmost, if not all, of the relevant stimuli for language acquisition,\ncontrary to Chomsky’s central poverty of stimulus argument for\nI-languages.\n\nSeveral different inquires have benefited from psycholinguistic\nstudies of overt linguistic behavior. These include questions about\nthe relative autonomy of distinct areas of linguistic knowledge, such\nas the question: are syntax, semantics and pragmatics independent from\neach other, or do they rather support each other? (see Gleitman,\nCassidy, et al. 2005; Gleitman 1990; Naigles and Swensen 2007; and\nDiesendruck 2007); and about the role of the child in the process of\nlanguage acquisition: is the child a passive subject, or an active\nparticipant within her linguistic community (see Shatz 1987, 1994;\nShafer and Garrido-Nag 2007; and Poulin-Dubois and Graham 2007)?\n\nWe saw (in section\n 3.1.1\n and\n 3.1.2)\n that Chomsky’s case for I-languages and against E-languages is\nheavily entwined with the poverty of stimulus assumption. This is used\nto defend the claim that human languages are little more than\nmodifications of UG, and that the process of language acquisition and\ndevelopment is the process of such modifications. But studies have\nshown that social input, which children may pick up from and rely on,\nis rich both in content and structure (see Baldwin and Meyer 2007). In\nchild-directed speech, adults use words in a way that makes it easier\nfor children to identify the relevant information (see Brent and\nSiskind 2001; Akhtar, Dunham, and Dunham 1991), suggesting that social\ninput is highly relevant to the development of semantic knowledge.\nEven if we limit the UG hypothesis to a claim about syntax there are\nempirical challenges. According to this more limited reading, the\nacquisition of syntactic process is “seen to rely most heavily\non the operation of innate structural principles” (Baldwin and\nMeyer 2007: 95). Social input, on this view, plays a mere triggering\nrole. Further studies have shown this hypothesis to be controversial.\nAlternative, socio-pragmatic, accounts have shown that children can\nlearn syntax from adult language use (see Tomasello 2003, 2004).\nChildren’s domain general abilities of statistical analysis, and\npattern and intention recognition, are believed to assist the child in\nidentifying and acquiring syntactic structure from the social\nlinguistic input they receive (see Saffran, Aslin, and Newport 1996;\nGentner, Holyoak, and Kokinov 2001). In general, the empirical\nevidence obtained by psycholinguistic studies strongly suggests that\nlanguage acquisition and development is much more than just a process\nof UG modifications by means of mind/brain maturation.\n\nHowever these debates evolve, two things seem clear. First, the\nexternal, anti-individualistic, mind-independent properties of\nlanguage, including overt linguistic behavior, are apt for proper\nscientific investigation. Exactly how much of a threat this is to\nChomsky’s view is a matter for debate, since as we saw (in\n 3.1.2)\n he insists he is not denying that language is at least partly a\nsocial product; but the claims made on the back of these results\ncertainly seem to run contrary to the thrust of his internalism. And,\nsecond, against Chomsky’s skepticism, there are good reasons to\ndevelop such research into external influences, as it may prove to be\ncentral for a proper understanding of the semantics, and even the\ngrammar and syntax, of human language and its acquisition.\n4. Further Reading\n\nFor thoughts on how best to characterize an idiolectal conception of\nlanguage, and views on how such a conception sits with respect to\nChomskian internalism and to conventionalist views, see George 1990\nand Higginbotham 2006.\n\nThe theory of conventions used in Lewis 1975 is developed at length in\nhis earlier book (1969). The resulting theory of language is\nelaborated by Bennett 1976 and criticized in Burge 1975 and Laurence\n1996. Wiggins 1997 and Millikan 2005, like Lewis, see languages as\nessentially social in nature (Chomsky replies to a version of the\nlatter in Antony and Hornstein 2003).\n\nA special issue of the journal Inquiry (see Begby &\nRamberg 2016) contains a handful of useful discussions of\nDavidson’s influential 1986 article. These include Stainton\n2016, which rejects what the author describes as Davidson’s case\nagainst public languages, adding to parallel criticisms of Chomskian\narguments to the same end in Stainton 2011. For work on the\npragmatics/semantics boundary, much of it raising similar issues, see\nStanley 2000, Carston 2002, Borg 2004, Recanati 2004, Cappelen and\nLepore 2005, and Szabó 2005. In earlier work on\nDavidson’s paper, his anti-conventionalism is discussed by\nHacking 1986, Dummett 1986, Pietroski 1994, and Reimer 2004. Hacking\naddresses the extent to which Davidson’s conclusion undermines\nhis earlier philosophy of language. Dummett attempts to show that the\nnotion of a prior theory presupposes the notion of a linguistic\ncommunity, and hence of a shared language.\n\nMcGilvray 1999 and Smith and Allott 2016 both offer clear introductions to\nChomsky’s philosophy of language and linguistics, including his\nE-/I-language distinction. A shorter account of his views on this\ntopic in particular can be found in Bezuidenhout 2006. Critical\ndiscussion can be found in five collections: George 1989, Otero 1994\n(Volume II), Antony and Hornstein 2003, Barber 2003, and McGilvray\n2005. Chomsky’s own non-technical writing is usually accessible.\nGood starting places would be the second chapter of Chomsky 1986, the\nessays in Chomsky 2000 (some of which also appeared within his 1995a),\nor the early sections of Chapter 1 of his 1995b (co-written with\nHoward Lasnik).\n\nHoff and Shatz 2007 offers an excellent overview of the field of\nlanguage development, including foundational issues, as well as\nsyntactic, semantic and pragmatic topics in infancy, early childhood\nand atypical development.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Akhtar, Nameera, Frances Dunham, and Philip J. Dunham, 1991,\n“Directive Interactions and Early Vocabulary Development: The\nRole of Joint Attentional Focus”, <em>Journal of Child\nLanguage</em>, 18(1): 41–49. doi:10.1017/S0305000900013283",
                "Anderson, Stephen R. &amp; David W. Lightfoot, 2000, “The\nHuman Language Faculty as an Organ”, <em>Annual Review of\nPhysiology</em>, 62: 697–722.\ndoi:10.1146/annurev.physiol.62.1.697 ",
                "Antony, Louise M. and Norbert Hornstein (eds), 2003, <em>Chomsky\nand His Critics</em>, New York: Blackwell.\ndoi:10.1002/9780470690024",
                "Baldwin, Dare and Meredith Meyer, 2007, “How Inherently\nSocial is Language?”, in Hoff and Shatz 2007: chapter 5.\ndoi:10.1002/9780470757833.ch5",
                "Barber, Alex, 2001, “Idiolectal Error”, <em>Mind and\nLanguage</em>, 16(3): 263–83. doi:10.1111/1468-0017.00169",
                "–––, (ed.), 2003, <em>Epistemology of\nLanguage</em>, Oxford: Oxford University Press.",
                "Begby, Endre and Bjørn Torgrim Ramberg, 2016,\n“Davidson’s Derangement Revisited: Guest Editors’\nIntroduction”, <em>Inquiry</em>, 59(1): 1–5.\ndoi:10.1080/0020174X.2015.1122314",
                "Bennett, Jonathan, 1976, <em>Linguistic Behaviour</em>, Cambridge:\nCambridge University Press.",
                "Bezuidenhout, Anne L., 2006, “Language as Internal”,\nin Lepore and Smith 2006:\n127–39. doi:10.1093/oxfordhb/9780199552238.003.0005",
                "Borg, Emma, 2004, <em>Minimal Semantics</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199270252.001.0001",
                "Brent, Michael R. and Jeffrey Mark Siskind, 2001, “The Role\nof Exposure to Isolated Words in Early Vocabulary Development”,\n<em>Cognition</em>, 81(2): B33–B44.\ndoi:10.1016/S0010-0277(01)00122-6",
                "Burge, Tyler, 1975, “On Knowledge and Convention”,\n<em>Philosophical Review</em>, 84(2): 249–55.\ndoi:10.2307/2183970",
                "Cappelen, Herman and Erenest Lepore, 2005, <em>Insensitive\nSemantics: A Defense of Semantic Minimalism and Speech Act\nPluralism</em>, New York: Wiley-Blackwell.\ndoi:10.1002/9780470755792",
                "Carston, Robyn, 2002, <em>Thoughts and Utterances: The Pragmatics\nof Explicity Communication</em>, Oxford: Blackwell.\ndoi:10.1002/9780470754603",
                "Chomsky, Noam, 1959, “A Review of B. F. Skinner’s\n‘Verbal Behavior’”, <em>Language</em>, 35(1):\n26–58. doi:10.2307/411334 ",
                "–––, 1975, <em>Reflections on Language</em>, New\nYork: Pantheon.",
                "–––, 1986, <em>Knowledge of Language: Its\nNature, Origin, and Use</em>, New York: Praeger.",
                "–––, 1995a, “Language and Nature”,\n<em>Mind</em>, 104(413): 1–61. doi:10.1093/mind/104.413.1",
                "–––, 1995b, <em>The Minimalist Program</em>,\nCambridge, MA: MIT Press. Chapter 1, pp. 13–127, co-authored\nwith Howard Lasnik.",
                "–––, 2000, <em>New Horizons in the Study of\nLanguage and Mind</em>, Cambridge: Cambridge University\nPress.",
                "Collins, John, 2014, “Representations Without Representata:\nContent and Illusion in Linguistic Theory”, in Piotr\nStalmaszczyk (ed.), <em>Semantics and Beyond: Philosophical and\nLinguistic Inquiries</em>, Boston: Walter de Gruyter, pp. 27–64.\ndoi:10.1515/9783110362480.27",
                "Crystal, David, 2007, <em>The Fight for English: How Language\nPundits Ate, Shot, and Left</em>, Oxford: Oxford University\nPress.",
                "Davidson, Donald, 1970, “Semantics for Natural\nLanguages”, in Visentini et al. 1970: 177–88; reprinted in\nDavidson 1984: 55–64.  doi:10.1093/0199246297.003.0004 ",
                "–––, 1984, <em>Inquiries into Truth and\nInterpretation</em>, New York: Oxford University Press.",
                "–––, 1986, “A Nice Derangement of\nEpitaphs”, in Lepore 1986: 433–446.",
                "Diesendruck, Gil, 2007, “Mechanisms of Word Learning”,\nin Hoff and Shatz 2007: chapter 13. doi:10.1002/9780470757833.ch13\n",
                "Dummett, Michael, 1986, “A Nice Derangement of Epitaphs:\nSome Comments on Davidson and Hacking”, in Lepore 1986:\n459–76.",
                "Egan, Frances, 2003, “Naturalistic Inquiry: Where does\nMental Representation Fit in?” in Antony and Hornstein 2003:\n88–104. doi:10.1002/9780470690024.ch4",
                "–––, 2014, “How to Think About Mental\nContent”, <em>Philosophical Studies</em>, 170(1): 115–35.\ndoi:10.1007/s11098-013-0172-0",
                "Fodor, Jerry A., 1987, <em>Psychosemantics: The Problem of Meaning\nin the Philosophy of Mind</em>, Cambridge, MA: MIT Press.",
                "García-Ramírez, E., 2019, <em>Open Compositionality: Toward a New\nMethodology of Language</em>, Maryland: Lexington Books.",
                "Gentner, Dedre, Keith J. Holyoak, and Boicho N. Kokinov (eds.)\n2001. <em>The Analogical Mind</em>, Cambridge, MA: MIT Press.",
                "George, Alexander L. (ed.), 1989, <em>Reflections on Chomsky</em>,\nOxford: Blackwell.",
                "–––, 1990, “Whose Language Is It Anyway?\nSome Notes on Idiolects”, <em>Philosophical Quarterly</em>,\n40(160): 275–98. doi:10.2307/2219723 ",
                "Glass, Arnold Lewis, Keith James Holyoak, and John Lester Santa,\n1979, <em>Cognition</em>, Reading, MA: Addison-Wesley.",
                "Gleitman, Lila, 1990, “The Structural Sources of Verb\nMeanings”, <em>Language Acquisition</em>, 1(1): 3–55.\ndoi:10.1207/s15327817la0101_2",
                "Gleitman, Lila R., Kimberly Cassidy, Rebecca Nappa, Anna\nPapafragou, and John C. Trueswell, 2005, “Hard Words”,\n<em>Language Learning and Development</em>, 1(1): 23–64.\ndoi:10.1207/s15473341lld0101_4",
                "Grice, H.P., 1957, “Meaning”, <em>Philosophical\nReview</em>, 66(3): 377–88. doi:10.2307/2182440 ",
                "–––, 1975, “Logic and Conversation”,\nin P. Cole and J. Morgan (eds.), <em>Syntax and Semantics</em>, Volume\n3. London: Academic Press. Reprinted in H. P. Grice, <em>Studies in\nthe Way of Words</em>, Cambridge, Mass.: Harvard University Press,\n1989.",
                "Gunderson, Keith (ed.), 1975, <em>Language, Mind, and\nKnowledge</em> (Minnesota Studies in the Philosophy of Science, Volume\n7), Minneapolis: University of Minnesota Press.\n [<a href=\"http://mcps.umn.edu/philosophy/completeVol7.html\" target=\"other\">Gunderson 1975 papers are available online</a>]",
                "Hacking, Ian, 1986, “The Parody of Conversation”, in\nLepore 1986: 447–58.",
                "Higginbotham, James, 2006, “Languages and Idiolects: Their\nLanguage and Ours”, in Lepore and Smith 2006: 140–50.\ndoi:10.1093/oxfordhb/9780199552238.003.0006",
                "Hoff, Erika and Marilyn Shatz (eds), 2007, <em>Blackwell Handbook\nof Language Development</em>, Blackwell Publishing.\ndoi:10.1002/9780470757833 ",
                "Hornstein, Norbert, 1989, “Meaning and the Mental: The\nProblem of Semantics After Chomsky”, in George 1989:\n23–40.",
                "Jackendoff, Ray, 2002, <em>Foundations of Language: Brain,\nMeaning, Grammar, Evolution</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198270126.001.0001",
                "Laurence, Stephen, 1996, “A Chomskian Alternative to\nConvention-Based Semantics”, <em>Mind</em>, 105(418):\n269–301. doi:10.1093/mind/105.418.269",
                "Laurence, Stephen and Eric Margolis, 2001, “The Poverty of\nthe Stimulus Argument”, <em>British Journal for the Philosophy\nof Science</em>, 52(2): 217–76. doi:10.1093/bjps/52.2.217",
                "Lepore, Ernest (ed.), 1986, <em>Truth and Interpretation:\nPerspectives on the Philosophy of Donald Davidson</em>, Cambridge:\nBlackwell.",
                "Lepore, Ernest and Barry C. Smith (eds.), 2006, <em>The Oxford\nHandbook of Philosophy of Language</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780199552238.001.0001",
                "Lewis, David K., 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, MA: Harvard University Press.",
                "–––, [1975] 1983, “Languages and\nLanguage”, in Gunderson 1975: 3–35. Page references are to\nthe reprint in D. Lewis, <em>Philosophical Papers</em> (Volume 1), New\nYork: Oxford University Press, 1983, pp. 163–188.\ndoi:10.1093/0195032047.003.0011",
                "Ludlow, Peter, 2003, “Referential Semantics for\nI-languages?” in Antony and Hornstein 2003: 140–61.\ndoi:10.1002/9780470690024.ch6",
                "Marr, David, 1982, <em>Vision. A Computational Investigation into\nthe Human Representation and Processing of Visual Information</em>,\nSan Francisco, CA: W.H. Freeman.",
                "McGilvray, James, 1999, <em>Chomsky: Language, Mind, and\nPolitics</em>, Cambridge: Polity Press.",
                "–––, (ed.), 2005, <em>A Companion to\nChomsky</em>, Cambridge: Cambridge University Press.",
                "Millikan, Ruth Garrett, 2005, “In Defense of Public\nLanguage”, Chapter 2 of her <em>Language: A Biological\nModel</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199284768.001.0001",
                "Montague, Richard, 1970, “English as a Formal\nLanguage”, in Visentini et al. 1970: 189–224; reprinted in\nRichmond H. Thomason (ed.), <em>Formal Philosophy. Selected Papers of\nRichard Montague</em>, New Haven: Yale University Press, 1974,\npp. 188–221.",
                "Naigles, Letitia R. and Lauren D. Swensen, 2007, “Syntactic\nSupports for Word Learning”, in Hoff and Shatz 2007: chapter 11.\ndoi:10.1002/9780470757833.ch11 ",
                "Otero, Carlos P. (ed.), 1994, <em>Noam Chomsky: Critical\nAssessments</em>, New York: Routledge.",
                "Pietroski, Paul M., 1994, “A Defense of Derangement”,\n<em>Canadian Journal of Philosophy</em>, 24(1): 95–117.\ndoi:10.1080/00455091.1994.10717361",
                "–––, 2003, “The Character of Natural\nLanguage Semantics”, in Barber 2003: chapter 7.",
                "Poulin-Dubois, Diane and Susan A. Graham, 2007, “Cognitive\nProcesses in Early Word Learning”, in Hoff and Shatz 2007:\nchapter 10. doi:10.1002/9780470757833.ch10 ",
                "Putnam, Hilary, 1975, “The Meaning of\n‘Meaning’”, in Gunderson 1975: 131–193.",
                "Pylyshyn, Zenon W., 1984, <em>Computation and Cognition: Toward a\nFoundation for Cognitive Science</em>, Cambridge, MA: MIT Press.",
                "Quine, W.V., 1970, “Methodological Reflections on Current\nLinguistic Theory”, <em>Synthese</em>, 21(3/4): 386–98.\ndoi:10.1007/BF00484806",
                "Recanati, François, 2004, <em>Literal Meaning</em>,\nCambridge: Cambridge University Press.",
                "Reimer, Marga, 2004, “What Malapropisms Mean: A Reply to\nDavidson”, <em>Erkenntnis</em>, 60(3): 317–334.\ndoi:10.1023/B:ERKE.0000023383.38025.cd",
                "Rey, Georges, 2003a, “Chomsky, Intentionality and a\nCRTT”, in Antony and Hornstein 2003: 105–139.\ndoi:10.1002/9780470690024.ch5",
                "–––, 2003b, “Intentional Content and a\nChomskian Linguistics”, in Barber 2003: 140–186.",
                "–––, 2005, “Mind, Intentionality and\nInexistence: An Overview of My Work”, <em>Croatian Journal of\nPhilosophy</em>, 5(3): 389–415.",
                "Saffran, Jenny R., Richard N. Aslin, and Elissa L. Newport, 1996,\n“Statistical Learning by 8-Month-Old Infants”,\n<em>Science</em>, 274(5294): 1926–1928.\ndoi:10.1126/science.274.5294.1926 ",
                "Shafer, Valerie L. and Karen Garrido-Nag, 2007, “The\nNeurodevelopmental Bases of Language”, in Hoff and Shatz 2007:\nchapter 2. doi:10.1002/9780470757833.ch2 ",
                "Shatz, Marilyn, 1987, “Bootstrapping Operations in Child\nLanguage”, in Keith E., Nelson and Anne van Kleeck (eds),\n<em>Children’s Language</em> (Volume 6), Hillsdale, NJ: Erlbaum,\npp. 1–22.",
                "–––, 1994, <em>A Toddler’s Life: Becoming\na Person</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195099232.001.0001",
                "Smith, Neil, and Nicholas Allott, 2016, <em>Chomsky: Ideas and\nIdeals</em>, third edition, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139979634",
                "Stainton, Robert J., 2006, “Meaning and Reference—Some\nChomskian Themes”, in Lepore and Smith 2006: 913–40.\ndoi:10.1093/oxfordhb/9780199552238.003.0036",
                "–––, 2011, “In Defense of Public Languages”,\n<em>Linguistics and Philosophy</em>, 34: 479–488.\ndoi:10.1007/s10988-011-9104-7",
                "–––, 2016, “A Deranged Argument Against\nPublic Languages”, <em>Inquiry</em>, 59(1): 6–32.\ndoi:10.1080/0020174X.2015.1115279",
                "Stanley, Jason, 2000, “Context and Logical Form”,\n<em>Linguistics and Philosophy</em>, 23(4): 391–434.\ndoi:10.1023/A:1005599312747",
                "Strawson, P.F., 1950, “On Referring”, <em>Mind</em>,\n59(235): 320–44. doi:10.1093/mind/LIX.235.320",
                "Szabó, Zoltán Gendler (ed.), 2005, <em>Semantics\nversus Pragmatics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199251520.001.0001",
                "Tomasello, Michael, 2003, <em>Constructing a Language: A\nUsage-Based Theory of Language Acquisition</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 2004, “Syntax or Semantics? Response\nto Lidz et.al.” <em>Cognition</em>, 93(2): 139–140.\ndoi:10.1016/j.cognition.2003.09.015",
                "Visentini, Bruno et al. (eds.), 1970, <em>Linguaggi nella Società\ne nella Tecnica: convegno promosso dalla C. Olivetti, per il\ncentenario della nascita di Camillo Olivetti, Museo Nazionale della\nScienza e della Tecnica Milano, 14–17 ottobre 1968</em> (Volume 87 of\nSaggi di cultura contemporanea), Milan: Edizioni di Communita.",
                "Wiggins, David, 1997, “Languages as Social Objects”,\n<em>Philosophy</em>, 72(282): 499–524.\ndoi:10.1017/S0031819100062380"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Akhtar, Nameera, Frances Dunham, and Philip J. Dunham, 1991,\n“Directive Interactions and Early Vocabulary Development: The\nRole of Joint Attentional Focus”, <em>Journal of Child\nLanguage</em>, 18(1): 41–49. doi:10.1017/S0305000900013283</li>\n<li>Anderson, Stephen R. &amp; David W. Lightfoot, 2000, “The\nHuman Language Faculty as an Organ”, <em>Annual Review of\nPhysiology</em>, 62: 697–722.\ndoi:10.1146/annurev.physiol.62.1.697 </li>\n<li>Antony, Louise M. and Norbert Hornstein (eds), 2003, <em>Chomsky\nand His Critics</em>, New York: Blackwell.\ndoi:10.1002/9780470690024</li>\n<li>Baldwin, Dare and Meredith Meyer, 2007, “How Inherently\nSocial is Language?”, in Hoff and Shatz 2007: chapter 5.\ndoi:10.1002/9780470757833.ch5</li>\n<li>Barber, Alex, 2001, “Idiolectal Error”, <em>Mind and\nLanguage</em>, 16(3): 263–83. doi:10.1111/1468-0017.00169</li>\n<li>–––, (ed.), 2003, <em>Epistemology of\nLanguage</em>, Oxford: Oxford University Press.</li>\n<li>Begby, Endre and Bjørn Torgrim Ramberg, 2016,\n“Davidson’s Derangement Revisited: Guest Editors’\nIntroduction”, <em>Inquiry</em>, 59(1): 1–5.\ndoi:10.1080/0020174X.2015.1122314</li>\n<li>Bennett, Jonathan, 1976, <em>Linguistic Behaviour</em>, Cambridge:\nCambridge University Press.</li>\n<li>Bezuidenhout, Anne L., 2006, “Language as Internal”,\nin Lepore and Smith 2006:\n127–39. doi:10.1093/oxfordhb/9780199552238.003.0005</li>\n<li>Borg, Emma, 2004, <em>Minimal Semantics</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199270252.001.0001</li>\n<li>Brent, Michael R. and Jeffrey Mark Siskind, 2001, “The Role\nof Exposure to Isolated Words in Early Vocabulary Development”,\n<em>Cognition</em>, 81(2): B33–B44.\ndoi:10.1016/S0010-0277(01)00122-6</li>\n<li>Burge, Tyler, 1975, “On Knowledge and Convention”,\n<em>Philosophical Review</em>, 84(2): 249–55.\ndoi:10.2307/2183970</li>\n<li>Cappelen, Herman and Erenest Lepore, 2005, <em>Insensitive\nSemantics: A Defense of Semantic Minimalism and Speech Act\nPluralism</em>, New York: Wiley-Blackwell.\ndoi:10.1002/9780470755792</li>\n<li>Carston, Robyn, 2002, <em>Thoughts and Utterances: The Pragmatics\nof Explicity Communication</em>, Oxford: Blackwell.\ndoi:10.1002/9780470754603</li>\n<li>Chomsky, Noam, 1959, “A Review of B. F. Skinner’s\n‘Verbal Behavior’”, <em>Language</em>, 35(1):\n26–58. doi:10.2307/411334 </li>\n<li>–––, 1975, <em>Reflections on Language</em>, New\nYork: Pantheon.</li>\n<li>–––, 1986, <em>Knowledge of Language: Its\nNature, Origin, and Use</em>, New York: Praeger.</li>\n<li>–––, 1995a, “Language and Nature”,\n<em>Mind</em>, 104(413): 1–61. doi:10.1093/mind/104.413.1</li>\n<li>–––, 1995b, <em>The Minimalist Program</em>,\nCambridge, MA: MIT Press. Chapter 1, pp. 13–127, co-authored\nwith Howard Lasnik.</li>\n<li>–––, 2000, <em>New Horizons in the Study of\nLanguage and Mind</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Collins, John, 2014, “Representations Without Representata:\nContent and Illusion in Linguistic Theory”, in Piotr\nStalmaszczyk (ed.), <em>Semantics and Beyond: Philosophical and\nLinguistic Inquiries</em>, Boston: Walter de Gruyter, pp. 27–64.\ndoi:10.1515/9783110362480.27</li>\n<li>Crystal, David, 2007, <em>The Fight for English: How Language\nPundits Ate, Shot, and Left</em>, Oxford: Oxford University\nPress.</li>\n<li>Davidson, Donald, 1970, “Semantics for Natural\nLanguages”, in Visentini et al. 1970: 177–88; reprinted in\nDavidson 1984: 55–64.  doi:10.1093/0199246297.003.0004 </li>\n<li>–––, 1984, <em>Inquiries into Truth and\nInterpretation</em>, New York: Oxford University Press.</li>\n<li>–––, 1986, “A Nice Derangement of\nEpitaphs”, in Lepore 1986: 433–446.</li>\n<li>Diesendruck, Gil, 2007, “Mechanisms of Word Learning”,\nin Hoff and Shatz 2007: chapter 13. doi:10.1002/9780470757833.ch13\n</li>\n<li>Dummett, Michael, 1986, “A Nice Derangement of Epitaphs:\nSome Comments on Davidson and Hacking”, in Lepore 1986:\n459–76.</li>\n<li>Egan, Frances, 2003, “Naturalistic Inquiry: Where does\nMental Representation Fit in?” in Antony and Hornstein 2003:\n88–104. doi:10.1002/9780470690024.ch4</li>\n<li>–––, 2014, “How to Think About Mental\nContent”, <em>Philosophical Studies</em>, 170(1): 115–35.\ndoi:10.1007/s11098-013-0172-0</li>\n<li>Fodor, Jerry A., 1987, <em>Psychosemantics: The Problem of Meaning\nin the Philosophy of Mind</em>, Cambridge, MA: MIT Press.</li>\n<li>García-Ramírez, E., 2019, <em>Open Compositionality: Toward a New\nMethodology of Language</em>, Maryland: Lexington Books.</li>\n<li>Gentner, Dedre, Keith J. Holyoak, and Boicho N. Kokinov (eds.)\n2001. <em>The Analogical Mind</em>, Cambridge, MA: MIT Press.</li>\n<li>George, Alexander L. (ed.), 1989, <em>Reflections on Chomsky</em>,\nOxford: Blackwell.</li>\n<li>–––, 1990, “Whose Language Is It Anyway?\nSome Notes on Idiolects”, <em>Philosophical Quarterly</em>,\n40(160): 275–98. doi:10.2307/2219723 </li>\n<li>Glass, Arnold Lewis, Keith James Holyoak, and John Lester Santa,\n1979, <em>Cognition</em>, Reading, MA: Addison-Wesley.</li>\n<li>Gleitman, Lila, 1990, “The Structural Sources of Verb\nMeanings”, <em>Language Acquisition</em>, 1(1): 3–55.\ndoi:10.1207/s15327817la0101_2</li>\n<li>Gleitman, Lila R., Kimberly Cassidy, Rebecca Nappa, Anna\nPapafragou, and John C. Trueswell, 2005, “Hard Words”,\n<em>Language Learning and Development</em>, 1(1): 23–64.\ndoi:10.1207/s15473341lld0101_4</li>\n<li>Grice, H.P., 1957, “Meaning”, <em>Philosophical\nReview</em>, 66(3): 377–88. doi:10.2307/2182440 </li>\n<li>–––, 1975, “Logic and Conversation”,\nin P. Cole and J. Morgan (eds.), <em>Syntax and Semantics</em>, Volume\n3. London: Academic Press. Reprinted in H. P. Grice, <em>Studies in\nthe Way of Words</em>, Cambridge, Mass.: Harvard University Press,\n1989.</li>\n<li>Gunderson, Keith (ed.), 1975, <em>Language, Mind, and\nKnowledge</em> (Minnesota Studies in the Philosophy of Science, Volume\n7), Minneapolis: University of Minnesota Press.\n [<a href=\"http://mcps.umn.edu/philosophy/completeVol7.html\" target=\"other\">Gunderson 1975 papers are available online</a>]</li>\n<li>Hacking, Ian, 1986, “The Parody of Conversation”, in\nLepore 1986: 447–58.</li>\n<li>Higginbotham, James, 2006, “Languages and Idiolects: Their\nLanguage and Ours”, in Lepore and Smith 2006: 140–50.\ndoi:10.1093/oxfordhb/9780199552238.003.0006</li>\n<li>Hoff, Erika and Marilyn Shatz (eds), 2007, <em>Blackwell Handbook\nof Language Development</em>, Blackwell Publishing.\ndoi:10.1002/9780470757833 </li>\n<li>Hornstein, Norbert, 1989, “Meaning and the Mental: The\nProblem of Semantics After Chomsky”, in George 1989:\n23–40.</li>\n<li>Jackendoff, Ray, 2002, <em>Foundations of Language: Brain,\nMeaning, Grammar, Evolution</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198270126.001.0001</li>\n<li>Laurence, Stephen, 1996, “A Chomskian Alternative to\nConvention-Based Semantics”, <em>Mind</em>, 105(418):\n269–301. doi:10.1093/mind/105.418.269</li>\n<li>Laurence, Stephen and Eric Margolis, 2001, “The Poverty of\nthe Stimulus Argument”, <em>British Journal for the Philosophy\nof Science</em>, 52(2): 217–76. doi:10.1093/bjps/52.2.217</li>\n<li>Lepore, Ernest (ed.), 1986, <em>Truth and Interpretation:\nPerspectives on the Philosophy of Donald Davidson</em>, Cambridge:\nBlackwell.</li>\n<li>Lepore, Ernest and Barry C. Smith (eds.), 2006, <em>The Oxford\nHandbook of Philosophy of Language</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780199552238.001.0001</li>\n<li>Lewis, David K., 1969, <em>Convention: A Philosophical Study</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, [1975] 1983, “Languages and\nLanguage”, in Gunderson 1975: 3–35. Page references are to\nthe reprint in D. Lewis, <em>Philosophical Papers</em> (Volume 1), New\nYork: Oxford University Press, 1983, pp. 163–188.\ndoi:10.1093/0195032047.003.0011</li>\n<li>Ludlow, Peter, 2003, “Referential Semantics for\nI-languages?” in Antony and Hornstein 2003: 140–61.\ndoi:10.1002/9780470690024.ch6</li>\n<li>Marr, David, 1982, <em>Vision. A Computational Investigation into\nthe Human Representation and Processing of Visual Information</em>,\nSan Francisco, CA: W.H. Freeman.</li>\n<li>McGilvray, James, 1999, <em>Chomsky: Language, Mind, and\nPolitics</em>, Cambridge: Polity Press.</li>\n<li>–––, (ed.), 2005, <em>A Companion to\nChomsky</em>, Cambridge: Cambridge University Press.</li>\n<li>Millikan, Ruth Garrett, 2005, “In Defense of Public\nLanguage”, Chapter 2 of her <em>Language: A Biological\nModel</em>, Oxford: Oxford University Press.\ndoi:10.1093/0199284768.001.0001</li>\n<li>Montague, Richard, 1970, “English as a Formal\nLanguage”, in Visentini et al. 1970: 189–224; reprinted in\nRichmond H. Thomason (ed.), <em>Formal Philosophy. Selected Papers of\nRichard Montague</em>, New Haven: Yale University Press, 1974,\npp. 188–221.</li>\n<li>Naigles, Letitia R. and Lauren D. Swensen, 2007, “Syntactic\nSupports for Word Learning”, in Hoff and Shatz 2007: chapter 11.\ndoi:10.1002/9780470757833.ch11 </li>\n<li>Otero, Carlos P. (ed.), 1994, <em>Noam Chomsky: Critical\nAssessments</em>, New York: Routledge.</li>\n<li>Pietroski, Paul M., 1994, “A Defense of Derangement”,\n<em>Canadian Journal of Philosophy</em>, 24(1): 95–117.\ndoi:10.1080/00455091.1994.10717361</li>\n<li>–––, 2003, “The Character of Natural\nLanguage Semantics”, in Barber 2003: chapter 7.</li>\n<li>Poulin-Dubois, Diane and Susan A. Graham, 2007, “Cognitive\nProcesses in Early Word Learning”, in Hoff and Shatz 2007:\nchapter 10. doi:10.1002/9780470757833.ch10 </li>\n<li>Putnam, Hilary, 1975, “The Meaning of\n‘Meaning’”, in Gunderson 1975: 131–193.</li>\n<li>Pylyshyn, Zenon W., 1984, <em>Computation and Cognition: Toward a\nFoundation for Cognitive Science</em>, Cambridge, MA: MIT Press.</li>\n<li>Quine, W.V., 1970, “Methodological Reflections on Current\nLinguistic Theory”, <em>Synthese</em>, 21(3/4): 386–98.\ndoi:10.1007/BF00484806</li>\n<li>Recanati, François, 2004, <em>Literal Meaning</em>,\nCambridge: Cambridge University Press.</li>\n<li>Reimer, Marga, 2004, “What Malapropisms Mean: A Reply to\nDavidson”, <em>Erkenntnis</em>, 60(3): 317–334.\ndoi:10.1023/B:ERKE.0000023383.38025.cd</li>\n<li>Rey, Georges, 2003a, “Chomsky, Intentionality and a\nCRTT”, in Antony and Hornstein 2003: 105–139.\ndoi:10.1002/9780470690024.ch5</li>\n<li>–––, 2003b, “Intentional Content and a\nChomskian Linguistics”, in Barber 2003: 140–186.</li>\n<li>–––, 2005, “Mind, Intentionality and\nInexistence: An Overview of My Work”, <em>Croatian Journal of\nPhilosophy</em>, 5(3): 389–415.</li>\n<li>Saffran, Jenny R., Richard N. Aslin, and Elissa L. Newport, 1996,\n“Statistical Learning by 8-Month-Old Infants”,\n<em>Science</em>, 274(5294): 1926–1928.\ndoi:10.1126/science.274.5294.1926 </li>\n<li>Shafer, Valerie L. and Karen Garrido-Nag, 2007, “The\nNeurodevelopmental Bases of Language”, in Hoff and Shatz 2007:\nchapter 2. doi:10.1002/9780470757833.ch2 </li>\n<li>Shatz, Marilyn, 1987, “Bootstrapping Operations in Child\nLanguage”, in Keith E., Nelson and Anne van Kleeck (eds),\n<em>Children’s Language</em> (Volume 6), Hillsdale, NJ: Erlbaum,\npp. 1–22.</li>\n<li>–––, 1994, <em>A Toddler’s Life: Becoming\na Person</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195099232.001.0001</li>\n<li>Smith, Neil, and Nicholas Allott, 2016, <em>Chomsky: Ideas and\nIdeals</em>, third edition, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781139979634</li>\n<li>Stainton, Robert J., 2006, “Meaning and Reference—Some\nChomskian Themes”, in Lepore and Smith 2006: 913–40.\ndoi:10.1093/oxfordhb/9780199552238.003.0036</li>\n<li>–––, 2011, “In Defense of Public Languages”,\n<em>Linguistics and Philosophy</em>, 34: 479–488.\ndoi:10.1007/s10988-011-9104-7</li>\n<li>–––, 2016, “A Deranged Argument Against\nPublic Languages”, <em>Inquiry</em>, 59(1): 6–32.\ndoi:10.1080/0020174X.2015.1115279</li>\n<li>Stanley, Jason, 2000, “Context and Logical Form”,\n<em>Linguistics and Philosophy</em>, 23(4): 391–434.\ndoi:10.1023/A:1005599312747</li>\n<li>Strawson, P.F., 1950, “On Referring”, <em>Mind</em>,\n59(235): 320–44. doi:10.1093/mind/LIX.235.320</li>\n<li>Szabó, Zoltán Gendler (ed.), 2005, <em>Semantics\nversus Pragmatics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199251520.001.0001</li>\n<li>Tomasello, Michael, 2003, <em>Constructing a Language: A\nUsage-Based Theory of Language Acquisition</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 2004, “Syntax or Semantics? Response\nto Lidz et.al.” <em>Cognition</em>, 93(2): 139–140.\ndoi:10.1016/j.cognition.2003.09.015</li>\n<li>Visentini, Bruno et al. (eds.), 1970, <em>Linguaggi nella Società\ne nella Tecnica: convegno promosso dalla C. Olivetti, per il\ncentenario della nascita di Camillo Olivetti, Museo Nazionale della\nScienza e della Tecnica Milano, 14–17 ottobre 1968</em> (Volume 87 of\nSaggi di cultura contemporanea), Milan: Edizioni di Communita.</li>\n<li>Wiggins, David, 1997, “Languages as Social Objects”,\n<em>Philosophy</em>, 72(282): 499–524.\ndoi:10.1017/S0031819100062380</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "behaviorism",
            "compositionality",
            "convention",
            "Davidson, Donald",
            "defaults in semantics and pragmatics",
            "externalism about the mind",
            "Grice, Paul",
            "innateness: and language",
            "intentionality",
            "intrinsic vs. extrinsic properties",
            "language of thought hypothesis",
            "meaning, theories of",
            "meaning: normativity of",
            "mental content: causal theories of",
            "mental content: narrow",
            "mental representation",
            "pragmatics",
            "private language",
            "reference"
        ],
        "entry_link": [
            {
                "../behaviorism/": "behaviorism"
            },
            {
                "../compositionality/": "compositionality"
            },
            {
                "../convention/": "convention"
            },
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../defaults-semantics-pragmatics/": "defaults in semantics and pragmatics"
            },
            {
                "../content-externalism/": "externalism about the mind"
            },
            {
                "../grice/": "Grice, Paul"
            },
            {
                "../innateness-language/": "innateness: and language"
            },
            {
                "../intentionality/": "intentionality"
            },
            {
                "../intrinsic-extrinsic/": "intrinsic vs. extrinsic properties"
            },
            {
                "../language-thought/": "language of thought hypothesis"
            },
            {
                "../meaning/": "meaning, theories of"
            },
            {
                "../meaning-normativity/": "meaning: normativity of"
            },
            {
                "../content-causal/": "mental content: causal theories of"
            },
            {
                "../content-narrow/": "mental content: narrow"
            },
            {
                "../mental-representation/": "mental representation"
            },
            {
                "../pragmatics/": "pragmatics"
            },
            {
                "../private-language/": "private language"
            },
            {
                "../reference/": "reference"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=idiolects\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/idiolects/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=idiolects&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/idiolects/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=idiolects": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/idiolects/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=idiolects&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/idiolects/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.indiana.edu/~hlw/Introduction/dialects.html\" target=\"other\">Dialects and languages</a>,\n maintained by Michael Gasser, Indiana University.",
            "<a href=\"http://www.dif.unige.it/epi/hp/penco/pub/dummettidiolect.pdf\" target=\"other\">Idiolect and Context</a>,\n [in PDF], Carlo Penco, Università di Genova"
        ],
        "listed_links": [
            {
                "http://www.indiana.edu/~hlw/Introduction/dialects.html": "Dialects and languages"
            },
            {
                "http://www.dif.unige.it/epi/hp/penco/pub/dummettidiolect.pdf": "Idiolect and Context"
            }
        ]
    }
}