{
    "url": "infinite-regress",
    "title": "Infinite Regress Arguments",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Ross Cameron\n<cameron@virginia.edu>",
        "author_links": [
            {
                "https://rosscameronphilosophy.weebly.com": "Ross Cameron"
            },
            {
                "mailto:cameron%40virginia%2eedu": "cameron@virginia.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"https://rosscameronphilosophy.weebly.com\" target=\"other\">Ross Cameron</a>\n&lt;<a href=\"mailto:cameron%40virginia%2eedu\"><em>cameron<abbr title=\" at \">@</abbr>virginia<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Jul 20, 2018",
        "substantive revision Fri Aug 12, 2022"
    ],
    "preamble": "\n\nAn infinite regress is a series of appropriately related elements with\na first member but no last member, where each element leads to or\ngenerates the next in some\n sense.[1]\n An infinite regress argument is an argument that makes appeal to an\ninfinite regress. Usually such arguments take the form of objections\nto a theory, with the fact that the theory implies an infinite regress\nbeing taken to be objectionable.\n\nThere are two ways in which a theory’s resulting in an infinite\nregress can form an objection to that theory. The regress might reveal\na bad feature of the theory—a feature that is not the regress\nitself, that we have independent reason to think is a reason to reject\nthe theory. Or the fact that the theory results in the infinite\nregress might itself be taken to be a reason to reject the theory. The\nformer cases are the easier ones, since in those cases we do not have\nto make a judgment as to whether the regress itself is objectionable,\nwe only need to ask about the feature of the theory that the regress\nreveals. We will look at cases like this first, before turning to\ncases where the regress itself might be seen as a reason to reject a\ntheory.\n\nMany, many infinite regress arguments have been given throughout the\nhistory of philosophy, and we will not attempt here to survey even the\nmost important of them. Rather, the aim will be to shed light on the\nkinds of regress argument that may be encountered, and the different\nconsiderations that arise in different cases. As we proceed, however,\nwe will see some particularly famous regress arguments as examples.\n(Rescher 2010 and Wieland 2014 survey some historical\n regresses.)[2]\n",
    "toc": [
        {
            "#RegrTheoVice": "1. Regress and Theoretical Vices"
        },
        {
            "#RegrCont": "1.1 Regress and Contradiction"
        },
        {
            "#LocaTheoVice": "1.2 Local Theoretical Vices"
        },
        {
            "#RegrFailAnal": "1.3 Regress and Failure of Analysis"
        },
        {
            "#FounCoheRegr": "2. Foundations, Coherence, and Regress"
        },
        {
            "#RegrGlobLocaExpl": "3. Regress and Global and Local Explanation"
        },
        {
            "#RegrTheoVirt": "4. Regress and Theoretical Virtues"
        },
        {
            "#TranNonTranExpl": "5. Transmissive and Non-Transmissive Explanations"
        },
        {
            "#CoheCircHoli": "6. Coherence, Circularity, and Holism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Regress and Theoretical Vices\n\nSometimes it is uncontroversial that a theory that generates an\ninfinite regress is objectionable, because the regress reveals that\nthe theory suffers from some kind of theoretical vice that is a reason\nto reject the theory independently of it yielding an infinite\nregress. In these cases, an infinite regress argument can show us that\nwe have reason to reject a theory, but it is not because the theory\nyields a regress per se, but rather because it has this other\nbad feature, and the regress has revealed that.\n1.1 Regress and Contradiction\n\nOne such kind of case is when the very same principles of a theory\nthat generate the regress also lead to a contradiction. If this is so\nthen it does not matter what we think about infinite regress in\ngeneral, we will of course have reason to reject the theory, because\nit is contradictory. Two such examples are discussed by Daniel Nolan\n(2001), and we will recount one of them here (also cf. Clark 1988).\nThe theory in question is Plato’s theory of Forms, and the\nregress objection is Parmenides’s Third Man objection, as\nreconstructed by Vlastos (1954).\n\nSuppose some things, the \\(X\\)s, are alike in a certain way: they\nshare some feature, \\(F\\). The theory of Forms says that if this is so\nthen there is some form, \\(F\\)-ness, in which the \\(X\\)s each\nparticipate and in virtue of which they have that shared feature. The\ntheory of Forms also says that Forms are self-predicated: the Form of\nthe good is good, the Form of largeness is large, etc. So the Form of\n\\(F\\)-ness is \\(F\\). In that respect, then, it is like each of the\n\\(X\\)s. So not only are the \\(X\\)s all alike in a certain way, the\n\\(X\\)s and \\(F\\)-ness are all alike in a certain way. And so there\nmust be some Form in which each of the \\(X\\)s and \\(F\\)-ness\nparticipate, in virtue of which they have this shared feature.\nHowever, this Form cannot be \\(F\\)-ness, because the Form must be\ndistinct from the things that have that character that participate in\nit, so the \\(X\\)s and \\(F\\)-ness must participate in a new form\n\\(F_1\\)-ness. But \\(F_1\\)-ness will, just like the \\(X\\)s and\n\\(F\\)-ness, be \\(F_1\\), given that Forms self-predicate, and so the\n\\(X\\)s, \\(F\\)-ness and \\(F_1\\)-ness are all alike in a certain way\n… and so on. We are off on an infinite regress.\n\nWhatever one thinks about regresses in general, the principles that\ngenerate this regress must be denied, for they lead to contradiction.\nThe theory of Forms, as presented here at least, tells us (i) that\nwhen some things are a certain way, they participate in a single Form,\nin virtue of which they are that way; (ii) that Forms\nself-predicate—Forms themselves are the way that things that\nparticipate in them are; and (iii) that the Form is distinct from the\nthings that participate in it. Each of these three claims is essential\nto generating the regress: without (i) we don’t get the\nexistence of a Form in the first place, without (ii) we don’t\nget the second list of things with a shared feature, so would stop\nsimply with the \\(X\\)s participating in some Form, and without (iii)\nwe could conclude that just as the \\(X\\)s participate in \\(F\\)-ness,\nso do the \\(X\\)s and \\(F\\)-ness itself—there would be no need\nfor a new Form. So (i)–(iii) generate a regress, and they are\neach needed to do so. But (i)–(iii) are inconsistent, and no\nregress argument is needed to show that. (i) and (ii) together entail\nthat Forms participate in themselves. (ii) tells us that \\(F\\)-ness is\n\\(F\\), and (i) tells us that if this is so it is in virtue of\n\\(F\\)-ness participating in \\(F\\)-ness, since that is how in\ngeneral things get to be \\(F\\). So \\(F\\)-ness participates in\nitself, and so by (iii) \\(F\\)-ness must be distinct from itself, since\nForms are distinct from that which participates in them. But nothing\nis distinct from itself: contradiction.\n\nWe don’t need an argument against infinite regresses to show\nthat this version of the theory of Forms is no good: that it is\ncontradictory is the best reason we could have to reject it. Now, that\nthe theory is contradictory and that it leads to an intuitively\nworrying infinite regress are not unrelated. Beyond the mere\nontological profligacy involved in being committed to infinitely many\nForms any time we notice that some things are some way (we will come\nback to ontological profligacy and regress in section 4), what seems\nintuitively problematic about the regress of Forms is that we\nshouldn’t get a new Form each time. The \\(X\\)s\nare \\(F\\), so we have the form of \\(F\\)-ness in which they\nparticipate. We then get a new Form in which the \\(X\\)s and\n\\(F\\)-ness all participate. But why do we have a new Form? We\ndon’t have a new shared feature, we have the very same shared\nfeature we started with: just as the \\(X\\)s are all \\(F\\), so is\n\\(F\\)-ness itself. We already have the Form that makes\nsomething \\(F\\): \\(F\\)-ness. The regress is troubling because we\nshouldn’t be invoking a new Form, but we have to because of the\nban on Forms participating in themselves. But this diagnosis of why\nthe regress is troubling is really just another way of stating the\ncontradiction at the heart of the theory: the Form \\(F\\)-ness is\nsupposed to be in general the thing in virtue of which things\nget to be \\(F\\), but it also cannot be because it itself must be \\(F\\)\nand it cannot participate in itself. So the regress and the\ncontradiction are intimately related. As Nolan (2001, 528) puts it:\n“infinite regresses of this sort and the statement of formal\ncontradiction are different ways of bringing out [the same]\nunacceptable feature.”\n\nThis is an easy case, because we don’t have to adjudicate on\nwhether the fact that the theory leads to an infinite regress is\nitself objectionable. The principles that lead to regress also lead to\ncontradiction, and we know that a theory’s being contradictory\nis a good reason to reject it, whether it leads to regress or not.\n1.2 Local Theoretical Vices\n\nMore generally, if the features of a theory that result in an infinite\nregress also result in some theoretical vice that we know to be\nobjectionable independently of whether or not there is a\nregress, then we have a reason to reject that theory that\ndoesn’t depend on the theory leading to regress. Sometimes, the\ntheoretical vice in question will be a global one: a feature that is a\nreason to reject any theory that has it. Yielding a contradiction is,\nrelatively\n uncontroversially[3],\n such a vice. Other times, the feature in question might be a local\nvice: a feature that might be an unobjectionable feature of certain\ntheories, but a reason to reject a particular theory \\(T\\) because of\nthe particular theoretical ambitions of \\(T\\) or as a result of other\nthings we know about \\(T\\)’s subject matter.\n\nFor example, a theory might result in an infinite regress of entities\nand so entail that there are infinitely many things. This in itself\nis, arguably, not objectionable. But it might be a local vice to a\ntheory if we have independent reason to think that we are dealing with\na finite domain. (See Nolan 2001, 531–532, and Nolan 2019.)\n(Some philosophers object to the very idea of reality containing\ninfinities. Aristotle, e.g., famously allowed that there could be\npotential infinite series, but not completed\ninfinite series. (See Mendel 2017.)) But we will ignore such general\nanti-infinitism in this entry, for it is infinity itself that such\ntheorists take to be objectionable, not infinite regresses per\nse.)\n\nPeano’s axioms for arithmetic, e.g., yield an infinite regress.\nWe are told that zero is a natural number, that every natural number\nhas a natural number as a successor, that zero is not the successor of\nany natural number, and that if \\(x\\) and \\(y\\) are natural numbers\nwith the same successor, then \\(x = y\\). This yields an infinite\nregress. Zero has a successor. It cannot be zero, since zero is not\nany natural number’s successor, so it must be a new natural\nnumber: one. One must have a successor. It cannot be zero, as before,\nnor can it be one itself, since then zero and one would have the same\nsuccessor and hence be identical, and we have already said they must\nbe distinct. So there must be a new natural number that is the\nsuccessor of one: two. Two must have a successor: three. And so on\n… And this infinite regress entails that there are infinitely\nmany things of a certain kind: natural numbers. But few have found\nthis worrying. After all, there is no independent reason to think that\nthe domain of natural numbers is finite—quite the opposite.\n\nBy contrast, consider the following two principles: (i) Every event is\npreceded by another event that is its cause; (ii) The relation \\(x\\)\nprecedes \\(y\\) is irreflexive (nothing precedes itself),\nasymmetric (if \\(a\\) precedes \\(b\\) then \\(b\\) does not precede \\(a\\))\nand transitive (if \\(a\\) precedes \\(b\\) and \\(b\\) precedes \\(c\\) then\n\\(a\\) precedes \\(c\\)).\n\nThis yields an infinite regress, at least from the assumption that\nthere is at least one event. If there is an event, \\(E_1\\), then it is\npreceded by its cause. That cause cannot be \\(E_1\\), as nothing\nprecedes itself and causes precede what they cause. So the cause of\n\\(E_1\\) must be a new event, \\(E_2\\). This event is preceded by its\ncause. This cannot be \\(E_2\\) for the same reasons as before, and it\ncannot be \\(E_1\\) because then each of \\(E_1\\) and \\(E_2\\) would\nprecede the other in violation of asymmetry. So the cause of \\(E_2\\)\nmust be a new event, \\(E_3\\). \\(E_3\\) is preceded by its cause. It\ncannot be \\(E_3\\) or \\(E_2\\) for reasons similar to before. And it\ncannot be \\(E_1\\), for then \\(E_1\\) would precede \\(E_3\\), but since\n\\(E_3\\) precedes \\(E_2\\) which precedes \\(E_1\\), transitivity entails\nthat \\(E_3\\) precedes \\(E_1\\), and so \\(E_1\\) cannot precede \\(E_3\\)\ndue to asymmetry. So the cause of \\(E_3\\) must be a new event,\n\\(E_4\\). And so on …\n\nThis regress of events is very similar to the regress of natural\nnumbers. In each case we start from the claim that there is a thing of\na certain kind (a number or an event), and we have a principle that\ntells us that for each thing of that kind, there is another thing of\nthat very kind that bears a certain relation to the previous one (it\nis its successor, or it is its preceding cause). We then have\nsupplementary principles that rule out the other thing of that kind\nbeing any of the things on our list so far, thus forcing us to\nintroduce a new thing of that kind, thus inviting the application of\nthe principles to this new thing, and so on ad infinitum. But\nwhile the regress and resulting infinity of natural numbers is\narguably unobjectionable, the regress of events seems problematic,\nbecause we have good empirical reasons to deny that there are\ninfinitely many events, each preceded by another. For either that\ninfinite sequence of events takes place in a finite amount of time or\nan infinite one. We have good empirical reason to rule out the latter\noption, since we have good empirical reason to think that there has\nonly been a finite amount of past time: that time started a finite\ntime ago with the Big Bang. And we have good empirical reason to rule\nout the former option, since the only way of fitting an infinite\nseries of events, each preceded by another, into a finite stretch of\ntime is by having the time between them become arbitrarily small. So\nfor example, \\(A_2\\) might be a minute before \\(A_1\\), and \\(A_3\\)\nhalf a minute before \\(A_2\\), and \\(A_4\\) a quarter of a minute before\n\\(A_3\\), etc. If the time between events \\(A_n\\) and \\(A_{n + 1}\\) is\nalways half the time between events \\(A_{n - 1}\\) and \\(A_n\\), we can\nfit infinitely many events into a two minute time-period. But this\nrequires the time between events to become arbitrarily small, and\nthere is some reason to think that time is quantized, such that there\nis a minimum length of time during which a change can occur, thus\nproviding a lower limit on the amount of time that can separate two\ntemporally distant events. (See Nolan 2008b for relevant discussion\nand further references.)\n\nSo while the numbers regress and the events regress are structurally\nanalogous, we might find the principles that yield the regress\nobjectionable in one case but not the other, because while each\nregress entails that there are infinitely many things of kind \\(K\\),\nwhether that is a vice may depend on what kind \\(K\\) is, and whether\nwe have independent reason to think that the domain of \\(K\\)s is a\nfinite one. Yielding infinitely many things of kind \\(K\\) might be a\nlocal vice when the kind in question is events separated in time, but\nnot when the kind in question is natural numbers structured by the\nsuccessor relation.\n1.3 Regress and Failure of Analysis\n\nIn the previous section we saw two theories generating similar\nregresses, but where one is found unobjectionable whereas the other is\nfound objectionable due to the different things we think we know,\nindependently of encountering these regress arguments, about the\nsubject matter of the theories. We could also have cases where a\nsingle theory yields a regress that is objectionable by the lights of\none theorist and not another, as a result of their differing\ntheoretical commitments leading one but not the other to think that a\nfeature revealed by the regress is a vice. (See Cameron 2022, section\n1.3.)\n\nConsider Bradley’s regress. (Bradley 1893 [1968], (21–29).\nNote, however, that Bradley is very hard to interpret, and there is\nmuch debate concerning how to reconstruct his argument. See the entry\non\n Bradley’s regress\n for discussion.) We start with the demand to give an account of\npredication: what is it for \\(A\\) to be \\(F\\)? One answer is that it\nis for the particular \\(A\\) to be bound to the property of \\(F\\)-ness.\nBut this answer yields a new predication: \\(A\\) is bound to\n\\(F\\)-ness. If the original monadic predication of \\(A\\) demands an\naccount, this relational predication of \\(A\\) and \\(F\\)-ness also\ndemands an account. Since before we posited a property corresponding\nto the monadic predicate and said that the property was bound to the\nobject that was the subject of predication, we should follow suit here\nand posit a relation corresponding to the dyadic predicate and say\nthat it is bound to the two things that are the subjects of that\npredication. So we should posit a relation—let’s call it\ninstantiation—that binds together \\(A\\) and \\(F\\)-ness.\nBut this yields another new predication: Instantiation binds \\(A\\) to\n\\(F\\)-ness. Now this triadic predication needs to be accounted for,\nand so we need a relation corresponding to the triadic\npredicate—let’s call it the instantiation\\(_2\\)\nrelation—that binds together the instantiation relation, \\(A\\),\nand \\(F\\)-ness. But this yields yet another predication, this time a\ntetradic one: Instantiation\\(_2\\) binds Instantiation to \\(A\\) and\n\\(F\\)-ness… And so on. Each predicational fact tells us that\nsome particulars, properties, and relations are bound together, which\nforces us to posit a relation corresponding to that binding, which\ngenerates the next predicational fact, and so on ad\ninfinitum.\n\nIs this regress objectionable? Arguably it depends on what we want\nfrom an account of predication. If what you want is an\nanalysis of predication, then arguably this regress\nis objectionable. If you start off not understanding\npredication—if you find it just utterly mysterious what\n‘\\(A\\) is \\(F\\)’ is meant to mean, given that this\n‘is’ is not identity—then this regress means that\nthis account is not going to help you, for each answer simply invokes\nanother predication, which is exactly what you don’t understand.\nIf you don’t understand ‘\\(A\\) is \\(F\\)’,\nyou’re not going to understand ‘\\(A\\) is bound to\n\\(F\\)-ness’, or ‘Instantiation is bound to \\(A\\) and\n\\(F\\)-ness’, or etc., since the ‘is’ in those claims\nis also not the ‘is’ of identity but the ‘is’\nof predication, which you find a mystery. However, if you\nunderstand predication perfectly fine and want simply an\nontological account of it—an account of what in the\nworld makes true the true predications—then arguably\nthe regress is not objectionable, because while there are\ninfinitely many true predications, these can all be made true by the\none underlying state of the world: the state of affairs of the\nparticular \\(A\\) being bound to the property \\(F\\)-ness. Just as this\nstate of affairs makes it true that \\(A\\) is \\(F\\), so does it make it\ntrue that \\(A\\) is bound to \\(F\\)-ness, and that this binding holds\nbetween \\(A\\) and \\(F\\)-ness, and etc. We would have one ontological\nunderpinning for the infinitely many true predications. As Nolan\n(2008a, 182) puts it, we have “Ontology for each truth, and no\ninfinite regress of [states of affairs], but only of descriptions of\n[states of affairs]: and it should never be thought that an infinite\nregress of descriptions is something to worry about per se”.\n(Cf. Armstrong 1974 and 1997 (157–8).) So whether or not we will\nfind this regress objectionable depends on what we demand of an\naccount of predication. We can all agree that the regress shows that\nthe account does not yield an analysis of predication. Is this a\ntheoretical vice? It depends on whether or not predication requires an\nanalysis, and that depends on our theoretical goals.\n\nAnother regress that arguably fits this pattern is McTaggart’s\n(1908) regress argument against the reality of the A-series of time.\nThe A-series of time is the sequence of times one of which is present,\nothers past, and others future. (As opposed to the B-series, which\nmerely says that some times are before others, some after others,\netc., without singling out any as being past, present, or future.)\nBut, says McTaggart, the times that are past, were present;\nthe time that is present was future and will be\npast; the times that are future will be present and will\nbe past. McTaggart concludes that we end up attributing each\nA-property (is present, is past, and is future) to\nevery time (and therefore to every event in time). But this is absurd,\nbecause the A-properties are incompatible: to have one is to have\nneither of the others. So we end up in contradiction: each time both\nhas only one such property, and all such properties. McTaggart\nconcludes that the A-series cannot be real.\n\nAn obvious response to McTaggart’s argument is this: it’s\nnot that some future time is present and past as well,\nit’s merely that it will be present and will\nbe (later still) past. That is: no time and event has\nmore than one of the A-properties, it is merely the case that they\nhave one A-property and did and will have another.\nBut McTaggart thinks this response does not solve the problem, because\nit leads to regress. He says (ibid., 469):\n\n\nIf we avoid the incompatibility of the three characteristics by\nasserting that M is present, has been future, and will be past, we are\nconstructing a second A series, within which the first falls, in the\nsame way in which events fall within the first… the second A\nseries will suffer from the same difficulty as the first, which can\nonly be removed by placing it inside a third A series. The same\nprinciple will place the third inside a fourth, and so on without end.\nYou can never get rid of the contradiction, for, by the act of\nremoving it from what is to be explained, you produce it over again in\nthe explanation. And so the explanation is invalid.\n\n\nMcTaggart’s argument is difficult and philosophers disagree on\nhow to interpret it, but here is one interpretation. (See Dummett 1960\nand Mellor 1998 (72–74) for two among many presentations of the\nargument along similar lines. See Cameron 2015 (Ch. 2) and Skow 2015\n(Ch. 6) for recent discussion.)\n\nThe way things were and the way things will be seems to be part of\nreality in a way that, for example, Bilbo’s finding the One Ring\nis not, it’s merely part of a fiction. History is not a\nfiction, it’s part of our world, so historical truths and future\ntruths should, seemingly, be part of the overall account of how the\nworld is. But that is puzzling, given that things change and,\nhence, the way things were is incompatible with the way things are\nnow. How can they both contribute to the way reality is if\nthey are incompatible? McTaggart’s argument focuses on a\nparticular instance of this concerning the A-properties.\nCaesar’s crossing the Rubicon is past. But it was\npresent, and so its presentness is a feature of our world’s\nhistory. But our world’s history, as we just said, is part of\nthe complete account of how our world is, and so the complete\naccount of how our world is includes both Caesar’s crossing the\nRubicon being past and it being present, and yet those are\nincompatible features. The defender of the A-series replies by\ninsisting that in giving the complete account of how reality is we\nhave to take seriously the fact that reality changes and that\nit is, therefore, different ways successively, and there is\nno inconsistency in things being one way and then another,\nincompatible, way. So it’s not that reality is such that\nCaesar’s crossing the Rubicon is both past and present,\nit’s that reality is such that Caesar’s crossing the\nRubicon was future, and was present, and is\nnow past.\n\nMcTaggart responds by restating this response in terms of second-order\nA-properties. To say that Caesar’s crossing the Rubicon\nwas future, and was present, and is now\npast is to say that it has the properties of being past\nfuture (i.e. having been future), past present (i.e.\nhaving been present) and present past (i.e. now being past).\nAnd similar reasoning to the above suggests that every time and event\nhas each of the nine possible second-order A-properties; and while\nit’s not the case that any two of them are incompatible, certain\npairs of them are. Nothing can be both past past and\nfuture future, for example: if \\(E\\) has been a mere past\nevent, it can’t be true that \\(E\\) will be something that is yet\nto happen. And yet the complete account of reality seems to include\nboth Caesar’s crossing the Rubicon being past past and its being\nfuture future. After all, in 2000 BCE Caesar’s crossing the\nRubicon was future future, since 1000 BCE was the future and\nCaesar’s crossing the Rubicon would still be the future then.\nAnd Caesar’s crossing the Rubicon is past past just now, since\n1000 CE is past, and Caesar’s crossing the Rubicon was past\nthen. But both 2000 BCE and the present are part of the overall\nhistory of the world, so the goings on at each time are part of what\nthe world as a whole is like, and so Caesar’s crossing the\nRubicon is both past past and future future, and yet those are\nincompatible. And again, the defender of the A-series will respond\nthat it’s not that Caesar’s crossing the Rubicon\nis both past past and future future, it’s that it is\nnow past past and was future future. And McTaggart\nwill respond that this is to invoke third-order\nA-properties—being present past past, being past\nfuture future, etc. And the same problem will arise, and invite\nthe same response, which will lead to the same problem concerning\nfourth-order A-properties, which will invite the same response again\n… and so on, ad infinitum.\n\nWhether McTaggart’s regress is vicious has proven a subject of\nmuch debate. Some philosophers see the regress as demonstrating that\nany attempt to describe the world in A-theoretic terms is ultimately\ninconsistent, and see the A-theorist as merely invoking another\ninconsistent account of reality every time they attempt to explain\naway this inconsistency. Mellor, for example, says (1998, 75)\n“[McTaggart’s] critics react by denying the viciousness of\nthe regress. At every stage, they say, we can remove the apparent\ncontradiction by distinguishing the times at which the events have\nincompatible [A-properties]. They ignore the fact that the way they\ndistinguish these times … only generates more\ncontradictions.” Others see McTaggart as simply making a\nconfused challenge at each stage—as mistakenly concluding from\nthe fact that things were one way and are now\nanother incompatible way that they are both ways at\nonce—and continuing to make the same mistake in response to each\nof the A-theorist’s correct explanations that in fact the\nincompatible properties are only ever had one after another, never at\nthe same time. Skow (2015, 87), e.g., says “At each stage\n[McTaggart] accuses objective becoming [i.e. things changing their\nA-properties] of being inconsistent, and [the A-theorist] shows that\nallegation to be false. And even an infinite sequence of false\nallegations does not add up to a good argument.”\n\nThis is arguably another case where whether or not the regress is\nvicious by a philosopher’s lights will depend on their\nbackground theoretical commitments. If one starts out happy with the\nnotion of succession—i.e. of one thing being the case\nand then ceasing to be the case as something else comes\nto be the case—then one may be inclined to see\nMcTaggart’s regress as entirely benign. We start out with a set\nof incompatible properties that are never had by anything\nsimultaneously but are held by things successively; in stating that\nthose properties are had successively we make salient a new set of\nincompatible properties, but these are also never had by anything\nsimultaneously, only successively; this makes salient yet another set\nof incompatible properties, and so on ad infinitum. There is\nnever, at any stage, a contradiction, if the notion of succession is\nindeed in good standing, for we are never forced to say that a thing\nhas incompatible properties, only that a thing successively has\nproperties that cannot be had simultaneously. If, by contrast, one is\nsuspicious of the very notion of succession—if one sees\nin it simply an attempt to paper over what is ultimately a\ncontradiction inherent in the commitment to reality being each of two\nincompatible ways, the way it supposedly is now and the way it\nsupposedly was or will be—then one will see in McTaggart’s\nregress an infinite sequence of contradictory accounts of how reality\nis, with each attempt at explaining away the contradiction simply\nresulting in another such contradictory account. The regress, then,\nlooks vicious or benign depending on whether one is content to grant\nthe legitimacy of the notion of temporal succession.\n2. Foundations, Coherence, and Regress\n\nIn section 1 we looked at cases where an infinite regress is taken to\nreveal some feature that might, possibly depending on your other\ntheoretical commitments, be taken to reveal a feature of a theory\nindependent of its leading to regress that is a reason to\nreject it. But sometimes the regress itself is taken to be an\nobjectionable feature of the theory that yields it.\n\nSuppose that there is an \\(X\\) that is \\(F\\), and that to account for\nwhy \\(X\\) is \\(F\\) we need to appeal to another \\(X\\) that is\nalso \\(F\\). Now there is the question as to why this \\(X\\) is\n\\(F\\), and so we need to appeal to another \\(X\\) which is\nalso \\(F\\) …. If this proceeds ad infinitum,\nwith a new \\(X\\) invoked at each new stage in the process, there is a\nconcern that we end up without having accounted for the \\(F\\)-ness of\nany of the \\(X\\)s. If this infinite regress argument is successful\nthen our choices are either:\n\nFoundationalism: To halt the regress by taking there to be a\nfoundation—a set of \\(X\\)s whose \\(F\\)-ness is taken to\nbe basic, and by which we can account for the \\(F\\)-ness of all other\n\\(X\\)s.\n\nor:\n\nCoherentism: To resist an infinite regress by allowing a circular or\nholistic explanation of the \\(F\\)-ness of at least some \\(X\\)s.\n\nInfinite regress arguments used to motivate Foundationalism or\nCoherentism appear in many different areas of philosophy. Here are\nsome highlights:\n\nIn metaphysics:\n\nMetaphysicians have wanted to account for the very existence, or\nnature, of some things by appealing to things on which they\nontologically depend: for example, a complex object exists and is the\nway it is because its parts exist and are the way they are; a set\nexists because its members exist; etc. (See Fine 1995 and Koslicki\n2013 for discussion.) But of course the things the dependent beings\ndepend on must themselves exist as well. Some have been suspicious of\nthe idea that this can go on ad infinitum, with every thing\nbeing ontologically dependent on some new thing(s), and thus have\nargued for Metaphysical Foundationalism: the view that there is a\ncollection of absolutely\n fundamental[4]\n entities upon which all else ultimately ontologically depends.\nAquinas, e.g., holds that events are ontologically dependent on their\ncauses, and that an infinite regress of causes and effects would be an\ninfinite series of things each of which is ontologically dependent on\nthe next, and this is\n impossible.[5]\n Thus he concludes that there must be a first cause of all else that\nis itself uncaused—namely, God. We shall see more examples of\nMetaphysical Foundationalists below. See also the supplementary\ndocument on\n\nMetaphysical Foundationalism and the Well-Foundedness of Ontological Dependence.\n\n(Metaphysical Coherentism—the view that ontological dependence\ncould be a holistic phenomenon—has received few defenders, but\nsee Barnes 2018, Bliss 2014, Cameron 2022 (Chs. 4 & 5), Nolan\n2018, Priest 2014 (Chs. 11 & 12), and Thompson 2016 and 2018 for\nsome discussion.)\n\nIn epistemology:\n\nEpistemologists want to account for the justification of our beliefs.\nWe do not want to believe at random, we want our beliefs to be\njustified—that is, we want there to be a\nreason to believe the propositions we believe. But those\nreasons will be further propositions, and if our initial belief is to\nbe justified, so surely must the reasons for that belief be, and so we\nmust appeal to yet more propositions, and so on. Many—going back\nto Sextus Empiricus (Outlines of Pyrrhonism PH I,\n164–9)—have thought that this cannot proceed ad\ninfinitum, and that the only serious options are Epistemic\nFoundationalism—the view that there is a class of propositions\nwhose justification does not come via some other justified\npropositions, and that can provide a reason for everything else we\nbelieve—or Epistemic Coherentism—the view that a\ncollection of propositions can collectively be justified in virtue of\nthe web of epistemic relations they stand in to one another. Thus Sosa\n(1980, 3) says “epistemology must choose between the solid\nsecurity of the ancient foundationalist pyramid and the risky\nadventure of the new coherentist raft.” (See the entries on\n foundationalist theories of epistemic justification\n and\n coherentist theories of epistemic justification\n for surveys of Epistemic Foundationalism and Epistemic Coherentism,\nrespectively).\n\nIn ethics:\n\nAs well as asking about the source of justification for our moral\nbeliefs (see e.g., Sinnott-Armstrong 1996), moral philosophers have\nbeen concerned with distinctively moral regresses, which arise not\nwhen we attempt to account for the justification of a moral claim, but\nrather when we attempt to account for the moral status of something by\nappealing to something else of the same moral status, and so on.\nAristotle (Nicomachean Ethics, 1094a) thought that some things were\ngood because we desire them for the sake of something else that is\ngood. But if everything that is good is good simply because\nit aims at something else that is good, this would lead to a regress\nand “all desire would be futile and vain”. And so\nAristotle argues that there must be a Highest Good—something\nthat is desired for its own sake—that other things can be good\nin virtue of aiming towards this highest good. Aristotle is a Moral\nFoundationalist: there is something whose goodness does not get\nexplained by reference to anything else, by means of which the\ngoodness of other things is accounted for.\n\n(Explicit statements of anything other than Foundationalism in the\nmoral case are hard to come\n by.[6]\n But see Roberts 2017 for relevant discussion.)\n\nHowever it is also always possible to simply embrace the regress and\naccept:\n\nInfinitism: The \\(F\\)-ness of each \\(X\\) is accounted for by facts\ninvolving a new \\(X\\) that is \\(F\\), and this proceeds ad\ninfinitum.\n\nWhether in metaphysics, epistemology, or ethics, Foundationalism has\noften been seen as the default, orthodox, view, with Coherentism being\nseen as the radical alternative. Infinitism is often simply dismissed,\nor not even considered as a live option. Foundationalism and\nCoherentism are\n (often[7])\n motivated by the thought that if the \\(F\\)-ness of each \\(X\\) is\naccounted for by appeal to a new \\(X\\) that is \\(F\\) then each of\nthose infinitely many explanations fails. The thought is that each\nexplanation of the \\(F\\)-ness of an \\(X\\) would be dependent on the\nsuccess of the next, a promissory note that is never paid if that\nprocess does not end. Let’s examine this anti-Infinitist\nthought.\n\nTo focus our inquiry, consider the case of a complex object and its\nproper parts. Some metaphysicians have considered the possibility that\nthere are gunky objects: objects such that every part of them\nitself has proper parts. If \\(A\\) is gunky then it is composed of some\nthings, the \\(X\\)s, such that there is more than one of the \\(X\\)s,\nand \\(A\\) is not amongst the \\(X\\)s. Pick one of those \\(X\\)s,\n\\(X_1\\). \\(X_1\\) is composed of some things, the \\(Y\\)s, such that\nthere is more than one of the \\(Y\\)s, and neither \\(A\\) nor \\(X_1\\) is\namongst the\n \\(Y\\)s.[8]\n Pick one of those \\(Y\\)s, \\(Y_1\\). \\(Y_1\\) is composed of some\nthings, the \\(Z\\)s, such that there is more than one of the \\(Z\\)s,\nand neither \\(A\\), nor \\(X_1\\), nor \\(Y_1\\) is amongst the \\(Z\\)s. And\nso on. This process will never end: each item in the series is a\ncollection of entities (a collection containing just one thing in the\nfirst case, and more than one thing in every subsequent case), and\ngiven the transitivity of parthood each thing in each collection will\nbe a part of \\(A\\) and hence—since \\(A\\) is ex\nhypothesi gunky—will itself be composed of a collection of\nproper parts, and so we can therefore pick any member from any\ncollection to generate the next item on the list. (Of course, a thing\nneed not—and if it is gunky, will not—have a\nunique decomposition: there can be two collections of things, the\n\\(X\\)s and the \\(Y\\)s, each of which compose \\(A\\), where none of the\n\\(X\\)s is amongst the \\(Y\\)s and vice versa. But all we need is that\nthere are some such collections, from which we can pick\narbitrarily to get the next collection in the sequence.) Now take the\ninfinite series that consists of \\(A\\) as its first element, \\(X_1\\)\nas its second element, \\(Y_1\\) as its third, etc. So we form this\ninfinite sequence by taking one item from each collection that formed\nthe previous infinite sequence: namely that item which was used to\ngive us the collection of things that came next in the series.\n\nAssuming that complex objects are ontologically dependent on their\nproper parts, we now have an infinite regress of entities, each of\nwhich is ontologically dependent on the next. Such an infinite regress\nhas been thought by some metaphysicians to be objectionable, leading\nthem to reject the possibility of gunk. Leibniz, for example, argues\nthat there cannot be only “beings by aggregation” (i.e.,\ncomposite objects), because this would lead to an infinite regress,\nwith each being by aggregation being made up of further beings by\naggregation, and so on ad infinitum.\n\nLeibniz’s idea seems to be that if each thing depends on some\nother, there could not be anything at all in the first place. The\nthought is that ontologically dependent entities inherit their\nexistence, or being, from that on which they depend; so if this chain\nof dependence does not terminate, the whole process couldn’t get\noff the ground, and there would be nothing at all. Leibniz says\n(1686–87, 85):\n\n\nWhere there are only beings by aggregation [composite objects], there\nare no real beings. For every being by aggregation presupposes beings\nendowed with real unity [simples], because every being derives its\nreality only from the reality of those beings of which it is composed,\nso that it will not have any reality at all if each being of which it\nis composed is itself a being by aggregation, a being for which we\nmust still seek further grounds for its reality, grounds which can\nnever be found in this way, if we must always continue to seek for\nthem.\n\n\nBy contrast, if the dependence runs in the other direction—if we\nstart off with a fundamental entity whose being can then ground the\nbeing of each subsequent entity—there is arguably no problem if\nthat process continues ad infinitum: thus the infinite\nsequence where you start with a thing, form its singleton set, then\nform that thing’s singleton set and so on ad\ninfinitum has not been thought to be objectionable by those who\nreject gunky objects, for it is the set that is ontologically\ndependent on its members, not vice versa. (See Fine 1994 for\ndiscussion of the direction of ontological dependence. See Cameron\n2008 and Maurin 2007 for discussion of the difference between infinite\nregresses where ontological dependence runs upwards from ones where it\nruns downwards. Cf. Clark 1988, and also Johansson 2009 and the\ndiscussion in Maurin\n 2013.)[9]\n\nA contemporary sympathizer with Leibniz’s thought is Jonathan\nSchaffer (2010). Unlike Leibniz, Schaffer grants the possibility of\ngunky objects, but thinks that this possibility is precisely a reason\nto deny that complex objects are (always) ontologically\ndependent on their\n parts.[10]\n Instead, Schaffer takes the possibility of there being no simple\nthings as a reason to hold that the dependence flows in the other\ndirection: that parts are dependent on the wholes of which they are\nparts, and that every thing is thereby ontologically dependent on the\nbiggest thing that there is—the cosmos—that has everything\nelse as a proper\n part.[11]\n Since classical mereology guarantees that there is a biggest\nthing—the thing that has all else as proper parts—but it\ndoes not guarantee that there are any smallest things—things\nthat have no proper parts—it guarantees that if parts are\ndependent on the wholes of which they are parts then there will be a\nfirst, ontologically fundamental, element, whereas if wholes are\ndependent on their parts then there is the possibility of an infinite\nregress in which each thing is dependent on some further thing(s),\nwith nothing being fundamental: a possibility in which, Schaffer\n(2010, 62) says (agreeing with Leibniz), “Being would be\ninfinitely deferred, never achieved”. Leibniz and Schaffer\nadvocate Metaphysical Foundationalism: the view that there\nhave to be some things that are absolutely fundamental—dependent\non nothing—on which all else ultimately depends.\n\nBut is it true that if the \\(F\\)-ness of each \\(X\\) is dependent on\nthe next \\(X\\) in the sequence being \\(F\\), and if this goes on\nwithout end, that we cannot explain why any \\(X\\) is \\(F\\)? Schaffer\nclaims that in the case of an infinite regress of ontological\ndependence, with each entity depending on the next in the chain, and\nno independent entities, being would be “infinitely deferred,\nnever achieved”. Why think this? The idea seems to be that a\ndependent entity only has the being it has on condition of something\nelse having being. If \\(A\\) is ontologically dependent on \\(B\\) then\nthe existence of \\(A\\) is a promissory note, only paid if \\(B\\) itself\nexists. But if \\(B\\) is ontologically dependent on \\(C\\) then the\nexistence of \\(B\\) is a promissory note, only paid if \\(C\\) exists\n… and so on, so that if this process never stops, the\npromissory note is never paid, in which case, allegedly, the existence\nof all these things could never get off the ground in the first\nplace.\n\nAn analogy may help. Suppose Anne has no sugar, and needs some. She\ncan borrow a bag of sugar from Breanna. Now Anne has a bag of sugar.\nWhere did it come from? Easy—it came from Breanna, who is now a\nbag of sugar down. But suppose Breanna borrowed a bag of sugar from\nCraig in order to then pass it on to Anne. Where did Anne’s bag\nof sugar come from then? Ultimately, from Craig, who ends up a bag of\nsugar down. But suppose Craig borrowed a bag of sugar from Devi\n… and so on, ad infinitum. Then where did the bag of\nsugar come from? At the end of the infinite sequence, Anne is one bag\nof sugar up, and nobody is a bag of sugar down, for everyone after\nAnne simply borrowed a bag of sugar, and then passed it on to the next\nperson in the chain. There’s an extra bag of sugar in the system\nthat seems to have appeared as if by magic. If there is a finite\nsequence of borrowers, however long, then the last person in the chain\nends up a bag of sugar down, so that’s where the bag of sugar\nthat ends up with Anne ultimately comes from. But if the chain never\nends, Anne ends up with a bag of sugar that doesn’t seem to have\ncome from anybody, as nobody has lost any bags of sugar—they all\njust borrowed it to pass it on. The infinite regress seems to create\nsugar from nowhere: pleasant, perhaps, but metaphysically suspicious\nall the same.\n\nAs with sugar, likewise with being—or justification, or\ngoodness, or whatever feature we aim to account for. If \\(A\\) depends\non \\(B\\) and \\(B\\) is fundamental, where did \\(A\\)’s being come\nfrom? From \\(B\\). If \\(A\\) depends on \\(B\\) and \\(B\\) depends on\n\\(C\\), where did \\(A\\)’s being come from? Ultimately, from\n\\(C\\). And for any finite chain, no matter how long, we can say where\nthe being of any dependent entity ultimately comes from: from the\nfundamental thing(s) at the bottom of the chain. But if the chain is\ninfinite, the being of any thing is, arguably, as mysterious as\nAnne’s new bag of sugar. The explanation of where it came from\nis always postponed, and its presence in the system as a whole\nunexplained. So, at least, goes the regress objection.\n3. Regress and Global and Local Explanation\n\nDistinguish between a local explanation of the \\(F\\)-ness of\nsome particular \\(X\\) and a global explanation of why there\nare any things that are \\(F\\) at all. Some philosophers have argued\nthat when we have an infinite regress, with the \\(F\\)-ness of each\n\\(X\\) being accounted for by appeal to another \\(X\\) that is \\(F\\),\nthen we do indeed lack a global explanation of why there are\nthings that are \\(F\\), but we nevertheless have a local explanation\nfor each of the infinitely many \\(X\\)s as to why it is \\(F\\).\n(This seems to be the position of Hume’s Cleanthes in Part IX of\nHume 1779.)\n\nRicki Bliss, e.g., speaking of the infinite regress of ontologically\ndependent entities, says (2013, 408): “In a reality that\nadmitted of no foundations … although everything has its\nreality accounted for in terms of that upon which it depends, we have\nfailed to explain how the whole lot of them—everything—has\nany reality at all.” Compare to the infinite borrowers case: for\nany given instance of someone having received a bag of sugar, we can\nexplain where that bag of sugar came from: it came from the next\nperson in the chain. But what we can’t explain is a global fact\nabout the series as a whole: why is this bag of sugar in the series in\nthe first place?\n\nBut Bliss argues that it is not necessarily a mark against infinitely\ndescending chains of ontological dependence that it leaves this global\nfact—why does anything have being in the first\nplace?—unexplained. She says (ibid.):\n\n\n[T]he regress is not designed to answer this question. All the regress\ncan tell us is how each individual member has the property under\nconsideration, namely, in dependence upon something else. The\nappearance of an infinite regress should not lead us to conclude that\nnothing within the regress has the property under\nconsideration—nor has its possession of that property\nunexplained—but rather that not everything about the possession\nof the property that needs to be explained has been.\n\n\nContra Leibniz and Schaffer, then, Bliss rejects the idea that in an\ninfinitely descending chain of ontological dependence, being would\nnever be achieved. Having a property dependent on some\ncondition is nevertheless to have that property, so there is no\npressure, she argues, to conclude that nothing in the infinite series\nwould exist. Rather, they all exist, and the existence of each is\nperfectly well accounted for: it exists because the next thing in the\nsequence does. Everything has its being merely on some condition, but\nthe condition is always met. Why there is an infinite chain of\nexisting entities at all is not accounted for, but Bliss says it is a\nmistake to think that the regress was ever supposed to account for\nthat.\n\nBliss concludes that whether or not an ontological infinite regress is\nvicious or benign depends on what we set out to give an account of. If\nall we want is an account of why each thing exists, then it is benign;\nbut if we want an account of why there are things at all, it is\n vicious.[12]\n She says (ibid., 414):\n\n\nIf \\(x\\) is grounded in \\(y\\) and \\(y\\) in \\(z\\), [and so on ad\ninfinitum] and all that we are seeking for is an explanation of\nhow or why \\(x\\) exists (as the thing that it is), an explanation of\nhow or why \\(y\\) exists, and so on ad infinitum, the regress\nis benign. Why? Because where \\(z\\) explains \\(y\\) and \\(y\\) explains\n\\(x\\) our explanans and explanandum are not\nof the same form. In order to explain facts about my existence, we can\nmake recourse to the existence of—or facts of the existence\nof—my parents, my vital organs, etc. In order to explain these\nfacts, we make recourse to further facts, and so on. At each stage, we\nhave a satisfactory explanation of that for which we are seeking one .\n. .\n\nThe regress is not benign, however, if what we are seeking an\nexplanation for is how anything exists, or has being, at all. For even\nat infinity, what the regress shows is that we have not explained\nwhere existence comes from. Even at infinity, we are still invoking\nthings that exist in order to explain how anything exists at\nall… We encounter, at each level, the explanatory failure\ncharacteristic of a vicious infinite regress: existents whose\nexistence we seek an explanation for are explained in terms of\nexistents. The existence of \\(y\\) may explain the existence of \\(x\\)\nbut the existence of \\(x\\), \\(y\\), \\(z\\), and so on ad\ninfinitum cannot help us explain how anything exists at\nall—where being comes from. Whether or not a regress of grounds\nis vicious, therefore, will depend upon the question for which we are\nseeking an answer.\n\n\nSimilar remarks are made by Graham Priest (2014, 186), who asks us to\nimagine an infinite sequence of objects, \\(a_0\\), \\(a_{-1}\\),\n\\(a_{-2}\\), … etc. Each of these can be in one of two states:\nactive or passive. For each \\(n \\le 0\\), if \\(a_{n-1}\\) is passive it\ndoes nothing, but if it is active it instantaneously makes \\(a_n\\)\nactive as well; and the only way for \\(a_n\\) to become active is that\n\\(a_{n-1}\\) makes it so. Given this set-up there are only two possible\noptions: each object in the chain is active, or each is passive. But\nboth are logically possible options: the fact that each object is only\nactive if the next object makes it active (and this sequence continues\nwithout end) gives us no reason, says Priest, to reject the\npossibility of them being all active. The active status of each object\nwould be accounted for, by the active status of the previous one.\nFirst we explain the active status of \\(a_0\\): it is explained by the\nactive status of \\(a_{-1}\\). Then we have a completely different thing\nto explain: the active status of \\(a_{-1}\\): it is explained by the\nactive status of \\(a_{-2}\\) … and so on. All such facts get\nexplained and since, Priest argues, it is a different fact being\naccounted for each time, this regress is not vicious. But echoing\nBliss, Priest admits that something is not explained. He says (ibid.,\n187) “[W]hat an infinite regress will not explain is why the\nwhole regress is as it is … the state of each \\(a_n\\) is\ndetermined by the state of \\(a_{n-1}\\), but there is nothing in this\nstory to explain why the whole system is in the all active\nstate, as opposed to the all passive state. If there is such\nan explanation, it must come from elsewhere.”\n\nSo if \\(a\\) can only exist if \\(b\\) exists for \\(a\\) to be\nontologically dependent on, and \\(b\\) can only exist if \\(c\\) exists\nfor \\(b\\) to be ontologically dependent on … and so on ad\ninfinitum, either the whole infinite sequence of things exists,\nor none of them do. And if the whole infinite sequence exists, there\nis no explanation (from within the sequence at least) as to why\nanything exists at all. However, there is an explanation for\neach particular thing as to why it exists: it exists because\nthe next thing in the sequence does. If Bliss and Priest are correct,\nthen whether or not an ontological infinite regress is vicious or\nbenign depends on our explanatory ambitions: are we attempting to\nexplain an (infinite) collection of particular existence facts: that\nthis thing exists, that that thing exists, etc., or\nare we attempting to explain the global fact that things exist.\nExactly the same infinitely regressing ontology can be vicious or\nbenign depending on one’s theoretical lights. Notice the\nsimilarity to the discussion in section 1.3 of Bradley’s and\nMcTaggart’s regresses: once again, whether or not there is\nsomething inherently objectionable to an infinite regress may depend\non our theoretical ambitions. Bliss (2019) argues that Metaphysical\nFoundationalism appears to be motivated by an explanatory demand that\neverything that is apt for explanation be explained in terms of facts\nthat do not require an explanation, but that this explanatory demand\nbegs the question in favor of Foundationalism.\n\nRoss Cameron (2022) argues that when we have an infinite regress of\nontological dependence or grounding, we might as a result of that\nregress lack an explanation of the existence or nature of the entities\non the infinite chain, or of the facts on that chain. However, Cameron\nargues that this is not a reason to deny that such infinite regresses\nare impossible, and instead argues that we must pull apart the notion\nof metaphysical explanation from relations like ontological dependence\nand grounding, which he calls metaphysical determination relations. If\n\\(E_1\\) is ontologically dependent on \\(E_2\\), which is ontologically\ndependent on \\(E_3\\), which is ontologically dependent on \\(E_4\\)\n… and so on ad infinitum, there might be no\nmetaphysical explanation for certain facts concerning the existence\nand nature of \\(E_1\\), \\(E_2\\), … etc., but, argues Cameron,\nthis is compatible with each of the facts concerning those things\nbeing adequately grounded in reality, and hence with the reality of\nsuch an infinite sequence. Infinite regresses of metaphysical\ndetermination relations, argues Cameron, might require us to abandon\ncertain explanatory goals, but this does not render them\nimpossible.\n4. Regress and Theoretical Virtues\n\nBliss and Priest, as we have seen, argue that while an ontological\ninfinite regress might leave some questions unanswered, there is\nnothing inherently objectionable, incoherent, or inconsistent in an\ninfinite regress of things each of which is ontologically dependent on\nthe next. However, even if such ontological infinite regresses are\npossible, some metaphysicians argue that we may have good reason to\nthink that the actual world is not like that.\n\nNolan (2001) and Cameron (2008) argue that considerations of\ntheoretical parsimony can lead us to reject ontological infinite\nregresses even if such regresses are not metaphysically impossible. A\ntheory that yields an ontological infinite regress of course thereby\nyields an infinite ontology. Even if we are not in the situation\n(discussed above in section 1.2) where we have independent knowledge\nthat we are dealing with a finite domain, this could still be a mark\nagainst the theory, simply on the grounds that it is an unparsimonious\nontology. So for example, we might object to the claim that material\nobjects are gunky—with each part of them being divisible into\nfurther proper parts—not because there’s any inconsistency\nin the hypothesis, or because it leads to an infinite chain of\nontological dependence and thereby leaves the existence of all things\nunexplained, but simply because it means that whenever there is an\nobject somewhere, there are in fact infinitely many objects there. A\ngunky world is an ontologically extravagant world, and so we have the\nsame kind of reason to reject the hypothesis that things are gunky as\nwe have to reject needlessly complex hypotheses about how things\nbehave (e.g., the Ptolemaic theory of planetary motion with its\nepicycle upon epicycle): other things being equal, we should prefer\nsimpler theories and more economical ontologies over complex theories\nand more expansive ontologies.\n\nTo illustrate, Nolan considers the famous example of someone\nsuggesting that the Earth is held up by resting on the back of a giant\nturtle, which is in turn held up by resting on the back of another\nturtle, which is in turn … and so on, turtles all the way down.\nThere does not appear to be an inconsistency hiding in this regress,\nnor does it thwart an attempt at analysis. For all we know, space is\ninfinite, so there’s no problem fitting all these turtles in, so\nwe’re not in a case where we know independently that we’re\ndealing with a finite domain. This is not a regress that involves\nontological dependence, so there are no concerns about the existence\nof things going ungrounded. Of course, we have pretty good empirical\nevidence that the infinite turtles hypothesis is false, since we have\ngone into space and can’t see any world turtles. But even\nputting that aside—let’s suppose we’re considering\nthe hypothesis prior to our going into space—there is something\nintuitively weird about the turtles hypothesis. Nolan suggests it is\nthe ontological extravagance of the view. He says (2011,\n534–5)\n\n\n[T]he two turtle theory [the world rests on a turtle, which rests on\nanother turtle, which is unsupported] is stranger and more absurd than\nthe one turtle theory, the three turtle theory worse than the two, a\ntwenty-eight turtle theory worse even than the three, an exactly seven\nmillion turtle theory loonier still, and so on. The infinite turtle\ntheory, while perhaps more motivated than the finite turtle theories,\nseems to be in some respects the limit of an increasing sequence of\nabsurdity.\n\n\nNot everyone will agree that each additional turtle theory is more\nobjectionable than the last, since the extra things being postulated\nare of the same kind (world turtles) as the previous theory already\ncountenanced. David Lewis (1973, 87), e.g., held that while we should\nprefer theories that are more qualitatively\nparsimonious—they postulate fewer kinds of thing than\ntheir rivals—there is no reason at all to prefer theories that\nare merely more quantitatively parsimonious—they\npostulate fewer things of the same kind as their rivals. This\nis controversial, however, and Nolan (1997) argues that quantitative\nparsimony is a genuine reason to prefer a theory. If Nolan is correct,\nthe four turtle theory is indeed worse than the three turtle theory,\nthe ten turtle theory worse still, and the infinite turtle theory\nworse (other things being equal) than any finite turtle theory.\n\nCameron applies considerations of theoretical parsimony to the case of\ninfinite chains of ontological dependence. While allowing that there\nis no impossibility in an infinite regress of things, each\nontologically dependent on the next, Cameron argues that we can still\nhave reason to reject such a theory on parsimony considerations.\nCameron (2008, 12) says that what needs to be explained is the\nexistence of each dependent entity; and while he allows that in an\ninfinitely descending chain of ontologically dependent entities, there\nis an explanation for why each dependent entity exists, there is no\nsingle explanation for why all the dependent entities exist.\nWhereas if there is a collection of fundamental entities on which all\nthe dependent entities ultimately depend, these fundamental entities\nprovide a single unified explanation for why every dependent entity\nexists. Either way, everything that needs to be explained gets\nexplained, but Cameron says we have reason to prefer the unified\nexplanation over the infinitely many disparate explanations, since it\nis in general a theoretical virtue to provide a unified explanation.\nFor example, a physical theory that postulates one unified force to\nexplain all phenomena would, other things being equal, be preferable\nto one that postulates four fundamental forces—gravity,\nelectromagnetism, strong nuclear, and weak nuclear—even if the\ntwo theories explain exactly the same phenomena. (Orilia (2009)\nargues, contra Cameron, that there is no unified explanation provided\nby Metaphysical Foundationalism over theories with infinite\nontological descent.)\n\nIf Nolan and Cameron are right it at most gives us a pro\ntanto reason to reject a theory that leads to an ontological\ninfinite regress. Just as we can justifiably accept the more complex\nhypothesis over the simpler one because the more complex hypothesis is\nmore powerful (e.g.), so we might justifiably accept an ontological\ninfinite regress because there is some virtue afforded by the theory\nthat makes the cost worthwhile. Relatedly, Cameron (2008, 13–14)\nargues that this would not give us any reason to think that\nontological infinite regresses are metaphysically impossible, at most\nit gives us a reason to think they are not actual, which limits the\npositions that such regress arguments can be used to argue for.\n5. Transmissive and Non-Transmissive Explanations\n\nIn section 3 we considered the suggestion that if the explanation of\nthe \\(F\\)-ness of each \\(X\\) appeals to another \\(X\\) that is \\(F\\),\nand so on ad infinitum, then while the \\(F\\)-ness of each\nindividual \\(X\\) can be accounted for, something is left unexplained:\nwhy there are things that are \\(F\\) at all. But arguably, not every\ninfinite regress leaves even this global fact unexplained.\n\nTo say merely that the \\(F\\)-ness of each \\(X\\) is explained by appeal\nto another \\(X\\) that is \\(F\\) leaves open a crucial question: does\nthe \\(F\\)-ness of the new \\(X\\) play a role in the explanation of the\n\\(F\\)-ness of the initial \\(X\\)? Following Bob Hale (2002),\nlet’s distinguish between transmissive explanations of\n\\(F\\)-ness, in which the \\(F\\)-ness of \\(X_2\\) plays a crucial role in\nexplaining the fact that \\(X_1\\) is \\(F\\), the \\(F\\)-ness of \\(X_3\\)\nplays a crucial role in explaining the fact that \\(X_2\\) is \\(F\\), and\nso on, from non-transmissive explanations of \\(F\\)-ness, in\nwhich the \\(F\\)-ness of \\(X_1\\) is explained by facts concerning\n\\(X_2\\), which is in fact \\(F\\), but where the \\(F\\)-ness of \\(X_2\\)\nis not crucial to explaining the \\(F\\)-ness of \\(X_1\\), and so on.\nArguably an infinite regress of transmissive explanations of\n\\(F\\)-ness leaves unexplained why anything is \\(F\\) in the first\nplace, but an infinite regress of non-transmissive explanations need\nnot.\n\nSimon Blackburn (1986) argued that any realist attempt to explain why\nthere is necessity in the world would fail because it faced a dilemma.\nSuppose we say that \\(A\\) is necessary because \\(B\\). \\(B\\) at least\nhas to be true, but is \\(B\\) itself necessary? Blackburn thought we\ncould not answer no, because to explain the necessity of a necessary\ntruth \\(A\\) by appeal to a contingent truth would undermine the\nnecessity of \\(A\\). But to answer yes is to invite regress, for now we\nneed to explain the necessity of \\(B\\) by appeal to a necessary truth\n\\(C\\), and so on ad infinitum. Now, whether the contingency\nhorn is indeed vicious is debatable (see Hale 2002 and Cameron 2010\nfor discussion), but focus on the regress involved in the necessity\nhorn. Hale (2002) argues that the realist about necessity can resist\ngetting into a vicious regress by distinguishing between transmissive\nand non-transmissive explanations of the necessity of any given\nproposition. Grant that the necessity of \\(A\\) can only be explained\nby a proposition, \\(B\\), that is itself necessary: that explanation\nwill be transmissive if the necessity of \\(B\\) plays a role\nin explaining the necessity of \\(A\\), otherwise it will be\nnon-transmissive. Hale (ibid., 308–309) offers as an\nexample of a transmissive explanation of the necessity of \\(A\\) a\nproof of \\(A\\) with the necessary truth \\(B\\) as its sole premise. If\n\\(A\\) follows logically from a necessary truth, then \\(A\\) itself must\nbe necessary. And in this case, the necessity of \\(B\\) plays a crucial\nrole in the explanation, for if I do not know whether \\(B\\) is\nnecessary, knowing that it entails \\(A\\) does not tell me whether\n\\(A\\) is necessary, for a contingent proposition can follow from\nanother contingent proposition. In that case, \\(A\\)’s necessity\nseems to be hostage to \\(B\\)’s necessity, and so the ultimate\nexplanation of \\(A\\)’s necessity will seemingly involve whatever\nexplains \\(B\\)’s necessity, which is where Blackburn senses\nregress. But Hale thinks there can also be non-transmissive\nexplanations of necessity. He suggests: ‘Necessarily the\nconjunction of two propositions \\(A\\) and \\(B\\) is true only if \\(A\\)\nis true and \\(B\\) is true’ because ‘conjunction just is\nthat binary function of propositions which is true iff both its\narguments are true’ (ibid., 312). While he grants that the\nexplanans in this case is necessary, Hale thinks that its\nnecessity is no part of the explanation. All that is needed to explain\nwhy it is necessary that \\(A \\amp B\\) is true only if \\(A\\) and \\(B\\)\nare both true is the truth of the fact that conjunction just\nis that function which is true iff both its arguments are true. It may\nbe necessary the conjunction is that function, but that is not part of\nthe explanation of the original necessity, and thus the necessity of\nthe explanans is not appealed to in a way that makes the success of\nthe explanation dependent now on explaining this further necessity.\nPerhaps there is a new question to be asked concerning why this\nfurther claim is necessary, but our original explanation stands\nindependently of whether we can successfully answer this new\nquestion.\n\nAnother example. Epistemic Infinitists embrace the infinite regress of\nreasons and argue that it is not vicious (see, e.g., Aikin 2005, 2011,\nKlein 1998, 2003, Peijnenburg 2007 and Atkinson & Peijnenburg\n2017). One response for the Infinitist to make to the regress argument\nis the response from section 3: to hold that each belief is justified\nin virtue of the next one being justified, but to claim that this is\nnot a problem: that while the regress means we do not have an\nexplanation for why anything is justified in the first place, this is\nnot what the sequence was meant to explain—all that we\nneed is an explanation for each belief concerning why it is\njustified, and this we have. (See e.g., Aikin 2005, 197 and Klein\n2003, 727–729.)\n\nHowever, the Infinitist may also simply deny that anything remains\nunexplained in such a regress. Peter Klein (1998, 2003) holds not only\nthat there can be an infinite regress of justifications, but\nindeed that it is necessary for \\(S\\) to be justified in\nbelieving that \\(p\\) that \\(S\\) have available to them an infinite\nnumber of propositions such that the first of these, \\(r_1\\), is a\nreason for \\(p\\), the second, \\(r_2\\), is a reason for \\(r_1\\), the\nthird, \\(r_3\\), is a reason for \\(r_2\\), and so on ad\ninfinitum. The regress objection seems to presuppose that \\(r_1\\)\nis a reason for \\(p\\) in virtue of (at least in part) \\(r_2\\)\nbeing a reason for \\(r_1\\), etc. (See e.g., Gillett 2003, 713.) In\nwhich case, so the objection goes, the justificatory chain could not\nget off the ground, and nothing would be justified. But Klein (2003,\n720–723) denies that \\(r_1\\) is a reason for \\(p\\) in virtue\nof \\(r_2\\) being a reason for \\(r_1\\). There must be a\nreason, \\(r_2\\), for \\(r_1\\), and there must be a distinct\nreason for \\(r_2\\), \\(r_3\\), and so on. Each of these infinitely many\npropositions are justified, but each one’s being justified, says\nKlein, does not hold in virtue of any other being justified.\nThe Infinitist demands that there is an infinite justificatory\nsequence, but that in itself is silent as to what justification\nconsists in. The Infinitist can simply hold that there is\nsome feature \\(F\\) such that for \\(x\\) to be a reason for \\(y\\),\n\\(\\langle x,y \\rangle\\) has to have \\(F\\), and that \\(\\langle r_1,p\n\\rangle\\) has \\(F\\), and \\(\\langle r_2,r_1 \\rangle\\) has \\(F\\), and so\non. That feature could be the first element increasing the objective\nprobability of the second, or something else entirely (ibid., 722).\nThe point is, it needn’t involve the second element itself being\njustified, and thus the Infinitist need not accept that the\njustification of \\(p\\) from \\(r_1\\) is inherited from the\njustification of \\(r_1\\) from \\(r_2\\), and so on. In Hale’s\nterminology, the explanation of the justification of a proposition by\nappeal to another justified proposition is a non-transmissive one:\nwhile one must appeal in the explanation to a proposition that is in\nfact justified, the fact that it is justified plays no role in that\nexplanation. Thus there is, arguably, no reason to think that the\nregress of epistemic justification is vicious even if you\ndemand an explanation for why any of our beliefs are justified in the\nfirst place.\n\nIt’s worth reflecting on the difference between the epistemic\nregress and the ontological regress of dependent entities that makes\nKlein’s response here possible. Suppose that \\(A\\) is\nontologically dependent on \\(B\\) and \\(B\\) ontologically dependent on\n\\(C\\). It is very plausible that in this case, \\(C\\)’s existence\nand/or nature is part of the explanation of \\(A\\)’s existence\nand/or nature. In saying that \\(A\\) is ontologically dependent on\n\\(B\\) we are saying that \\(A\\) exists, or is the way it is, at least\npartly in virtue of \\(B\\)’s existence and/or nature. So \\(B\\)\nhas to exist, or be the way it is, in order for \\(A\\) to exist, or be\nthe way it is. In explaining \\(A\\)’s existence/nature, we are\nappealing to \\(B\\)’s existence/nature, in which case it seems\nthat anything that we need to explain \\(B\\)’s existence and/or\nnature—in this case \\(C\\)’s existence/nature—must\nultimately be part of the explanation of \\(A\\)’s existence\nand/or nature. That’s why when we have a chain of ontological\ndependence, the existence and/or nature of the first entity seems to\nbe ultimately dependent on not just the existence/nature of the second\nentity in the chain, but on that of every subsequent entity in the\nchain: explanations of being appear to be transmissive. Which is why,\nif the chain is endless, we seem to lack an explanation as to why\nanything exists at all.\n\nBut while it is overwhelmingly plausible that \\(B\\) can only serve as\nthe ontological ground of \\(A\\) because \\(B\\) itself exists,\nor is the way it is, it is not forced on us to hold that\n\\(r_2\\) can only be a reason for \\(r_1\\) because \\(r_2\\) is itself\njustified, and this is why Klein’s response to the epistemic\nregress is available. It need be no part of the explanation for why\n\\(r_2\\) is a reason for \\(r_1\\) that \\(r_2\\) itself be justified. As\nKlein says, the entirety of the explanation for why \\(r_2\\) is a\nreason for \\(r_1\\) might be simply that the objective probability of\n\\(r_1\\) given \\(r_2\\) is sufficiently high. That fact does not involve\n\\(r_2\\) being justified. Klein thinks that \\(r_2\\) must be\njustified if \\(r_1\\) is, but that need not be any part of why\n\\(r_2\\) is a reason for \\(r_1\\), and thus there is no pressure to hold\nthat the justification of \\(r_1\\) by \\(r_2\\) is dependent on, or\ninherited by, the justification of \\(r_2\\) by \\(r_3\\), and so on. So\nwhile there is indeed an infinite sequence of propositions, each of\nwhich is a reason for the previous one on the list, at no stage is the\nfact that one proposition is a reason for another hostage to the fact\nthat any other proposition is a reason for another. And so arguably,\nnothing remains unexplained: there can be a good explanation not only\nfor why each particular proposition is justified (\\(r_5\\) is justified\nby \\(r_6\\), etc.), but also for why there are any justified\npropositions in the first place (there are propositions that raise the\nobjective probability of others,\n e.g.).[13]\n6. Coherence, Circularity, and Holism\n\nThe Coherentist resists regress by allowing a circular or holistic\nexplanation of the \\(F\\)-ness of at least some \\(X\\)s. This could be\nto simply allow straightforwardly circular explanations, such as that\n\\(X_1\\) is \\(F\\) in virtue of \\(X_2\\) being \\(F\\) and \\(X_2\\) is \\(F\\)\nin virtue of \\(X_1\\) being \\(F\\). But that is not the only option for\nthe Coherentist. Consider again the regress argument concerning\njustification of belief: our belief \\(p_1\\) is justified by appeal to\n\\(p_2\\), which is in turn justified by appeal to \\(p_3\\), and so on.\nThere is an assumption behind this regress: that what is to be\nexplained are the facts concerning the individual beliefs—why is\nthis one justified, then why is that one justified,\netc. An epistemic Coherentist such as Bonjour (1985) rejects this\nassumption. It is not, primarily, individual beliefs that are\njustified, it is systems of belief. A particular belief is\njustified only in a derivative sense, by belonging to a justified\nsystem. A system of belief is justified because of the properties of\nthe system as a whole, namely that the beliefs in it form a coherent\nsystem. Thus, justification is a holistic phenomenon: a collection of\nbeliefs is justified because of what they, collectively, are like, not\nbecause of what each individual member of the system is like. This\nholistic explanation of where justification comes from is very\ndifferent from a circular explanation: a circular explanation tells us\nthat one individual’s being \\(F\\) explains another’s being\n\\(F\\) and also vice versa, but a holistic explanation tells us to\nabandon the idea of explaining an individual’s being \\(F\\) by\nappeal to another individual being \\(F\\), and instead hold that the\nexplanation for some things being \\(F\\) can be the facts\nconcerning what that collection of things as a whole is like. (An\nanalogous view concerning Metaphysical Coherentism and holistic\nexplanation is defended by Thompson (2018), and Cameron (2022, Ch.4).\nCf. Barnes (2018).)\n\nSometimes a circular explanation might be warranted because we are not\ntrying to explain in virtue of what the \\(X\\)s are \\(F\\), but rather\nwe are merely attempting to illuminate the \\(X\\)s being \\(F\\) by\nshowing how the \\(X\\)s relate. Consider the regress argument against\nthe thesis that time passes given by J.J.C. Smart (1949, 484):\n\n\nIf time is a flowing river we must think of events taking time to\nfloat down this stream, and if we say ‘time has flowed faster\ntoday than yesterday’ we are saying that the stream flowed a\ngreater distance today than it did in the same time yesterday. That\nis, we are postulating a second timescale with respect to which the\nflow of events along the first time dimension is measured …\nFurthermore, just as we thought of the first time dimension as a\nstream, so will we want to think of the second time dimension as a\nstream also; now the speed of flow of the second stream is a rate of\nchange with respect to a third time dimension, and so we can go on\nindefinitely postulating fresh streams without being any better\nsatisfied.\n\n\nHere we start with our ordinary temporal dimension—what we may\nhave supposed to be the only temporal dimension—the one\nphilosophers have in mind when they say that time passes. Smart\nsupposes that if this dimension of time indeed passes then there must\nbe a rate at which it\n passes.[14]\n Whether that rate can slow down or speed up or if time always flows\nat the same rate is not important, but there must be some rate at\nwhich it passes, thinks Smart. Now, just as we would measure the speed\nof a car, say, by measuring how much distance it covers in a given\namount of time, so, thinks Smart, we would have to measure the speed\nat which time itself passes by measuring how much time passes in a\ngiven amount of time of some second temporal dimension. While the car\ncovers forty miles of road in the space of an hour, an hour of time\npasses in the space of, say, two hours of this second temporal\ndimension. But then, how fast does this second dimension of time pass?\nWe need a third temporal dimension to measure how long it takes for an\nhour of the second temporal dimension to pass. But how fast does the\nthird temporal dimension pass? And so on, ad infinitum. Smart\nconcludes that time does not pass.\n\nA defender of the view that time passes could attempt to resist\nSmart’s regress by cutting off the regress at the second stage\nby claiming that there is a principled difference between the first\ntemporal dimension and the second that results in the first temporal\ndimension passing at some rate, but not the second. Smart himself\nconcludes that time does not pass, so can hardly object to the\npostulation of temporal dimensions that do not pass. However,\nSmart’s regress can be resisted without abandoning the principle\nthat all temporal dimensions pass at some rate.\n\nNed Markosian (1993) points out that to give a rate is to compare two\ndifferent types of change. When we say that the car travels at forty\nmph, we are comparing one type of change—the car started off in\none place and ended up forty miles distant—with another—it\nwas one time and it is now an hour later. In that case, we can always\nget the rate of the second type of change by comparing back to the\nfirst. As Markosian says (ibid., 842): “If … I tell you\nthat Montana’s passing totals increased at the rate of 21 passes\nper game, then I have also told you that the games progressed at the\nrate of one game per 21 completions by Montana.” So suppose we\nsay that the first temporal dimension passes at a rate of one hour for\nevery two hours of the second temporal dimension; there is no need to\ninvoke a third temporal dimension in order to state the rate at which\nthe second passes, for we have already given that rate: an hour of the\nsecond temporal dimension passes for every half hour of the first.\nIndeed, as Markosian points out, we need not even invoke a second\ntemporal dimension, for any time we give a rate of any ordinary\nprocess with respect to time—such as that the Earth goes around\nthe sun once every year—we have thereby stated the rate at which\ntime passes with respect to those ordinary processes: time passes at\nthe rate of one year for every orbit of the Earth around the sun.\n\nMarkosian’s maneuver is possible because in giving the rate of\none process of change by appeal to a second process of change we are\nnot saying what makes it the case that the first change\noccurs at the rate it does. What makes it the case—what are the\nontological grounds of the fact—that the car travels at 40 mph?\nNot that an hour of time passes while the car moves a distance of 40\nmiles, for that is merely a re-description of the fact in question: a\nway of describing the rate. In the case of time itself,\ndefenders of the view that time passes may plausibly claim that what\nmakes it the case that time passes is simply the nature of\ntime: that it is in its nature to pass at the rate it does. It\ndoesn’t pass at the rate it does because of some\nrelation it stands in, either to ordinary processes of change or to a\nsecond temporal dimension. Such relations allow us to informatively\nstate the rate of change, they do not provide the\ngrounds for it.\n\nIf we were providing the metaphysical grounds of rates of change,\nSmart might be right that this would lead to a vicious regress, since\narguably grounding is asymmetric (see e.g., Rosen 2010,\n 115).[15]\n If the car travels at the speed it does in virtue of\nsomething to do with the passage of time then, arguably, time cannot\npass at the rate it does in virtue of anything to do with the\nspeed of the car, and so we need to appeal to the passage of a second\ntemporal dimension to provide the ontological grounds of the rate of\npassage of the first. If the passage of this second temporal dimension\ngrounds facts about the passage of the first temporal dimension, it\nitself cannot pass in virtue of facts concerning the passage\nof the first, and so we need to appeal to a third temporal dimension,\nand so on. And even if we hold that it’s possible for\nthere to be infinitely descending chains of grounds, it seems absurd\nin this case to suppose that there are in fact infinitely many\ntemporal dimensions. But that is not what is going on. When we explain\nthe speed of the car by appeal to the passage of time, we’re not\nproviding the ontological grounds of its speed, we’re simply\nshowing a connection between two things: the movement of the car and\nthe passage of time. Likewise for the rate of time’s passage\nitself: we are not seeking to provide the ontological grounds of\ntime’s passage in stating its rate, for the ontological grounds\nare plausibly just the nature of time itself. Rather, when we compare\nthe two changes, we are simply trying to illuminate one or both of\nthose changes by pointing to the way they relate. That is the only\nsense in which one explains the rate of one change when\ncomparing it to another kind of change: the mutual connection tells us\nsomething enlightening about each. It is not to give a metaphysical\nexplanation in the sense of providing the metaphysical\ngrounds of either rate of change. Compare: if I tell you that\nthe value of a US dollar is 0.7 British pounds (and therefore\nthat the value of a British pound is 1.43 US dollars), this is not to\nsay that the US dollar has the worth that it has in virtue of\nstanding in this relation to the British pound. The US dollar relates\nthus to the British pound because of what they are each\nworth; they are not worth what they are in virtue of standing in that\nrelationship. What makes it the case that the US dollar is worth what\nit is is some incredibly complex set of facts concerning economics,\nmonetary policy, etc. To give an exchange rate is not to give the\ngrounds of the value of the currencies, but merely to say something\nsubstantive about each value by stating their connections. Likewise\nwith rates of change, which is why Markosian is able to resist\nSmart’s regress in this manner. Coherentist explanations might\nbe controversial when it comes to providing ontological grounds, but\nthey are less so when it comes to simply casting light on the nature\nof some phenomena by showing how they connect. So whether a regress\nargument even gets going will depend on the explanatory ambitions of\nthe view being targeted.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aikin, Scott F., 2005, “Who Is Afraid Of\nEpistemology’s Regress Problem?”, <em>Philosophical\nStudies</em>, 126(2): 191–217.",
                "–––, 2011, <em>Epistemology and the Regress\nProblem</em>, London: Routledge.",
                "Armstrong, D.M., 1974, “Arguments and the Problem of\nUniversals”, <em>Australasian Journal of Philosophy</em>, 52\n(3): 191–201.",
                "–––, 1997, <em>A World of States of\nAffairs</em>, Cambridge: Cambridge University Press.",
                "Atkinson, D., and A. Peijnenburg, 2017, <em>Fading Foundations:\nProbability and the Regress Problem</em> (Synthese Library: Volume\n383), Cham: Springer. doi: 10.1007/978-3-319-58295-5",
                "Barnes, Elizabeth, 2012, “Emergence and\nFundamentality”, <em>Mind</em>, 121(484): 873–901.",
                "–––, 2018, “Symmetric Dependence”,\nin Ricki Bliss and Graham Priest (eds.), <em>Reality and Its\nStructure: Essays in Fundamentality</em>, Oxford: Oxford University\nPress, pp. 50–69.",
                "Bennett, Karen, 2017, <em>Making Things Up</em>, Oxford: Oxford\nUniversity Press.",
                "Black, Oliver, 1996, “Infinite Regress Arguments and\nInfinite Regresses”, <em>Acta Analytica</em>, 16:\n95–124.",
                "Blackburn, Simon, 1986, “Morals and Modals”, in Graham\nMacDonald and Crispin Wright (eds.), <em>Fact, Science and Morality:\nEssays on A.J. Ayer’s Language, Truth and Logic</em>, Oxford:\nBlackwell, pp. 119–142.",
                "Bliss, Ricki Leigh, 2013, “Viciousness and the Structure of\nReality”, <em>Philosophical Studies</em>, 166(2):\n399–418.",
                "–––, 2014, “Viciousness and Circles of\nGround”, <em>Metaphilosophy</em>, 45(2): 245–256.",
                "–––, 2019, “What Work the\nFundamental?”, <em>Erkenntnis</em>, 82(2): 359–379.",
                "BonJour, Laurence, 1985, <em>The Structure of Empirical\nKnowledge</em>, Cambridge, Mass.: Harvard University Press.",
                "Bradley, F.H., 1893 [1968], <em>Appearance and Reality</em>,\nLondon: Swan Sonnenschein; reprinted, Oxford: Oxford University\nPress.",
                "Cameron, Ross, 2008, “Turtles all the way down: Regress,\nPriority and Fundamentality”, <em>The Philosophical\nQuarterly</em>, 58(230): 1–14.",
                "–––, 2010, “On the Source of\nNecessity”, in Bob Hale and Aviv Hoffman (eds.), <em>Modality:\nMetaphysics, Logic and Epistemology</em>, Oxford: Oxford University\nPress, pp. 137–152.",
                "–––, 2015, <em>The Moving Spotlight</em>,\nOxford: Oxford University Press.",
                "–––, 2022, <em>Chains of Being: Infinite\nRegress, Circularity, and Metaphysical Explanation</em>, Oxford:\nOxford University Press.",
                "Clark, Romane, 1988, “Vicious Infinite Regress\nArguments”, <em>Philosophical Perspectives</em>, 2:\n369–380.",
                "Cohoe, Caleb, 2013, “There Must Be A First: Why Thomas\nAquinas Rejects Infinite, Essentially Ordered, Causal Series”,\n<em>British Journal for the History of Philosophy</em>, 21(5):\n838–856.",
                "Dixon, T. Scott, 2016, “What Is the Well-Foundedness of\nGrounding?”, <em>Mind</em>, 125(498): 439–468.",
                "Dummett, Michael, 1960, “A Defense of McTaggart’s\nProof of the Unreality of Time”, <em>The Philosophical\nReview</em>, 69(4): 497–504.",
                "Fine, Kit, 1994, “Essence and Modality”,\n<em>Philosophical Perspectives</em>, 8: 1–16.",
                "–––, 1995, “Ontological Dependence”,\n<em>Proceedings of the Aristotelian Society</em>, 95:\n269–290.",
                "Gillett, Carl, 2003, “Infinitism Redux? A Response to\nKlein”, <em>Philosophy and Phenomenological Research</em>, 66\n(3): 709–717.",
                "Gratton, Claude, 1997, “What Is An Infinite Regress\nArgument?”, <em>Informal Logic</em>, 18: 203–224.",
                "–––, 2009, <em>Infinite Regress Arguments</em>,\nDordrecht: Springer.",
                "Hale, Bob, 2002, “The Source of Necessity”,\n<em>Philosophical Perspectives</em>, 16: 299–319.",
                "Incurvati, Luca, 2014, “The Graph Conception of Set”,\n<em>Journal of Philosophical Logic</em>, 43(1): 181–208.",
                "Hume, David, 1779, <em>Dialogues Concerning Natural Religion</em>,\nMartin Bell (ed.), London: Penguin, 1990.",
                "Jenkins, C.S., 2011, “Is Metaphysical Dependence\nIrreflexive?”, <em>The Monist</em>, 94(2): 267–276.",
                "Johansson, Ingvar, 2009, “Proof of the Existence of\nUniversals—and Roman Ingarden’s Ontology”,\n<em>Metaphysica</em>, 10(1): 65–87.",
                "Klein, Peter, 1998, “Foundationalism and the Infinite\nRegress of Reasons”, <em>Philosophy and Phenomenological\nResearch</em>, 58(4): 919–925.",
                "–––, 2003, “When Infinite Regresses Are\n<em>Not</em> Vicious”, <em>Philosophy and Phenomenological\nResearch</em>, 66(3): 718–729.",
                "Koslicki, Kathrin, 2013, “Ontological Dependence: An\nOpinionated Survey” in B. Schnieder, M. Hoeltje, and A.\nSteinberg (eds.), <em>Varieties of Dependence: Ontological Dependence,\nGrounding, Supervenience, Response-Dependence</em>, München,\nGermany: Philosophia Verlag, pp. 31–64.",
                "Leibniz, Gottfried, 1686–87, “Letters to\nArnauld”, page references are to the reprint in R. Ariew &amp;\nD. Garber (ed.), <em>G.W. Leibniz: Philosophical Essays</em>, Indiana:\nHackett, 1989, pp. 69–90.",
                "Lewis, David, 1973, <em>Counterfactuals</em>, Oxford:\nBlackwell.",
                "Löwenstein, David, 2017, “A Uniform Account of Regress\nProblems”, <em>Acta Analytica</em>, 32: 333–354.",
                "McTaggart, J. Ellis, 1908, “The Unreality of Time”,\n<em>Mind</em>, 17(68): 457–474.",
                "Markosian, Ned, 1993, “How Fast Does Time Pass?”,\n<em>Philosophy and Phenomenological Research</em>, 53(4):\n829–844.",
                "Maurin, Anna-Sofia, 2007, “Infinite Regress: Virtue of\nVice?”, in T. Rønnow-Rasmussen, B. Petersson, J.\nJosefsson &amp; D. Egonsson (eds.), <em>Hommage</em> <em>à\nWlodek: Philosophical Papers Dedicated to Wlodek Rabinowicz</em>.\n [<a href=\"http://www.fil.lu.se/hommageawlodek/index.htm\" target=\"other\">Available online</a>]",
                "Maurin, Anna-Sofia, 2013, “Infinite Regress\nArguments’” in C. Svennerlind, J. Almäng &amp; R.\nIngthorsson (eds.), <em>Johanssonian Investigations: Essays in Honour\nof Ingvar Johansson on His Seventieth Birthday</em>, New Jersey:\nTransaction Books, pp. 421–438.",
                "Mellor, D.H., 1998, <em>Real Time II</em>, London: Routledge.",
                "Mendell, Henry, 2017, “Aristotle and Mathematics”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2017\nEdition), Edward N. Zalta (ed.), URL =\n&lt;https://plato.stanford.edu/archives/spr2017/entries/aristotle-mathematics/&gt;.",
                "Nolan, Daniel, 1997, “Quantitative Parsimony”,\n<em>British Journal for the Philosophy of Science</em>, 48(3):\n329–343.",
                "–––, 2001, “What’s Wrong With\nInfinite Regresses?”, <em>Metaphilosophy</em>, 32(5):\n523–538.",
                "–––, 2008a, “Truthmakers and\nPredication”, in Dean Zimmerman (ed.), <em>Oxford Studies in\nMetaphysics</em>, 4: 171–192.",
                "–––, 2008b, “Finite Quantities”,\n<em>Proceedings of the Aristotelian Society</em>, 108:\n23–42.",
                "–––, 2018, “Cosmic Loops”, in Ricki\nBliss and Graham Priest (eds.), <em>Reality and Its Structure: Essays\nin Fundamentality</em>, Oxford: Oxford University Press, pp.\n91–106.",
                "–––, 2019, “Infinite Barbarians”,\n<em>Ratio</em>, 32(3): 173–181.",
                "Orilia, Francesco, 2009, “Bradley’s Regress and\nUngrounded Dependence Chains: A Reply to Cameron”,\n<em>Dialectica</em>, 63(3): 333–341.",
                "Passmore, John, 1961, <em>Philosophical Reasoning</em>, New York:\nScribner’s.",
                "Peijnenburg, J., 2007, “Infinitism regained”,\n<em>Mind</em>, 116(463): 597–602. doi:10.1093/mind/fzm597",
                "Priest, Graham, 2014, <em>One</em>, Oxford: Oxford University\nPress.",
                "Rabin, Gabriel and Rabern, Brian, 2016, “Well Founding\nGrounding Grounding”, <em>Journal of Philosophical Logic</em>,\n45(4): 349–379.",
                "Rieger, Adam, 2000, “An Argument for Finsler-Aczel Set\nTheory”, <em>Mind</em>, 109(434): 241–254.",
                "Rescher, Nicholas, 2010, <em>Infinite Regress</em>, New Jersey:\nTransaction Publishers.",
                "Roberts, Debbie, 2017, “Depending on the Thick”,\n<em>Aristotelian Society Supplementary Volume</em>, 91:\n197–220.",
                "Rosen, Gideon, 2010, “Metaphysical Dependence: Grounding and\nReduction”, in Bob Hale and Aviv Hoffman (eds.), <em>Modality:\nMetaphysics, Logic and Epistemology</em>, Oxford: Oxford University\nPress, pp. 109–136.",
                "Schaffer, Jonathan, 2003, “Must There Be A Fundamental\nLevel?”, <em>Noûs</em>, 37(3): 498–517.",
                "–––, 2009, “On What Grounds What”,\nin D. Chalmers, D. Manley &amp; R. Wasserman (eds.),\n<em>Metametaphysics</em>, Oxford: Oxford University Press, pp.\n347–383.",
                "–––, 2010, “Monism: The Priority of the\nWhole”, <em>Philosophical Review</em>, 119(1):\n31–76.",
                "Sider, Theodore, 2011, <em>Writing the Book of the World</em>,\nOxford: Oxford University Press.",
                "Sinnott-Armstrong, Walter, 1996, “Moral Skepticism and\nJustification”, in Walter Sinnott-Armstrong and Mark Timmons\n(eds.), <em>Moral Knowledge? New Readings in Moral Epistemology</em>,\nOxford: Oxford University Press, pp. 3–48.",
                "Skow, Bradford, 2015, <em>Objective Becoming</em>, Oxford: Oxford\nUniversity Press.",
                "Smart, J.J.C., 1949, “The River of Time”,\n<em>Mind</em>, 58(232): 483–494.",
                "Sosa, Ernest, 1980, “The Raft and the Pyramid: Coherence\nVersus Foundations in the Theory of Knowledge”, <em>Midwest\nStudies in Philosophy</em>, 5(1): 3–26.",
                "Thompson, Naomi, 2016, “Metaphysical Interdependence”,\nin Mark Jago (ed.), <em>Reality Making</em>, Oxford: Oxford University\nPress, pp. 38–55.",
                "–––, 2018, “Metaphysical Interdependence,\nEpistemic Coherentism and Holistic Explanation”, in Ricki Bliss\nand Graham Priest (eds.), <em>Reality and Its Structure: Essays in\nFundamentality</em>, Oxford: Oxford University Press, pp.\n107–125.",
                "Väyrynen, Pekka, 2013, “Grounding and Normative\nExplanation”, <em>Aristotelian Society Supplementary\nVolume</em>, 87: 155–178.",
                "Vlastos, Gregory, 1954, “The Third Man Argument in the\nParmenides”, <em>Philosophical Review</em>, 63(3):\n319–349.",
                "Wieland, Jan Willem, 2013a, “Infinite Regress\nArguments”, <em>Acta Analytica</em>, 28: 95–109.",
                "–––, 2013b, “Strong and Weak Regress\nArguments”, <em>Logique et Analyse</em>, 224:\n439–461.",
                "–––, 2014, <em>Infinite Regress Arguments</em>,\nSpringer.",
                "Wilson, Jessica, 2014, “No Work for a Theory Of\nGrounding”, <em>Inquiry</em>, 57(5–6):\n535–579."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Aikin, Scott F., 2005, “Who Is Afraid Of\nEpistemology’s Regress Problem?”, <em>Philosophical\nStudies</em>, 126(2): 191–217.</li>\n<li>–––, 2011, <em>Epistemology and the Regress\nProblem</em>, London: Routledge.</li>\n<li>Armstrong, D.M., 1974, “Arguments and the Problem of\nUniversals”, <em>Australasian Journal of Philosophy</em>, 52\n(3): 191–201.</li>\n<li>–––, 1997, <em>A World of States of\nAffairs</em>, Cambridge: Cambridge University Press.</li>\n<li>Atkinson, D., and A. Peijnenburg, 2017, <em>Fading Foundations:\nProbability and the Regress Problem</em> (Synthese Library: Volume\n383), Cham: Springer. doi: 10.1007/978-3-319-58295-5</li>\n<li>Barnes, Elizabeth, 2012, “Emergence and\nFundamentality”, <em>Mind</em>, 121(484): 873–901.</li>\n<li>–––, 2018, “Symmetric Dependence”,\nin Ricki Bliss and Graham Priest (eds.), <em>Reality and Its\nStructure: Essays in Fundamentality</em>, Oxford: Oxford University\nPress, pp. 50–69.</li>\n<li>Bennett, Karen, 2017, <em>Making Things Up</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Black, Oliver, 1996, “Infinite Regress Arguments and\nInfinite Regresses”, <em>Acta Analytica</em>, 16:\n95–124.</li>\n<li>Blackburn, Simon, 1986, “Morals and Modals”, in Graham\nMacDonald and Crispin Wright (eds.), <em>Fact, Science and Morality:\nEssays on A.J. Ayer’s Language, Truth and Logic</em>, Oxford:\nBlackwell, pp. 119–142.</li>\n<li>Bliss, Ricki Leigh, 2013, “Viciousness and the Structure of\nReality”, <em>Philosophical Studies</em>, 166(2):\n399–418.</li>\n<li>–––, 2014, “Viciousness and Circles of\nGround”, <em>Metaphilosophy</em>, 45(2): 245–256.</li>\n<li>–––, 2019, “What Work the\nFundamental?”, <em>Erkenntnis</em>, 82(2): 359–379.</li>\n<li>BonJour, Laurence, 1985, <em>The Structure of Empirical\nKnowledge</em>, Cambridge, Mass.: Harvard University Press.</li>\n<li>Bradley, F.H., 1893 [1968], <em>Appearance and Reality</em>,\nLondon: Swan Sonnenschein; reprinted, Oxford: Oxford University\nPress.</li>\n<li>Cameron, Ross, 2008, “Turtles all the way down: Regress,\nPriority and Fundamentality”, <em>The Philosophical\nQuarterly</em>, 58(230): 1–14.</li>\n<li>–––, 2010, “On the Source of\nNecessity”, in Bob Hale and Aviv Hoffman (eds.), <em>Modality:\nMetaphysics, Logic and Epistemology</em>, Oxford: Oxford University\nPress, pp. 137–152.</li>\n<li>–––, 2015, <em>The Moving Spotlight</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2022, <em>Chains of Being: Infinite\nRegress, Circularity, and Metaphysical Explanation</em>, Oxford:\nOxford University Press.</li>\n<li>Clark, Romane, 1988, “Vicious Infinite Regress\nArguments”, <em>Philosophical Perspectives</em>, 2:\n369–380.</li>\n<li>Cohoe, Caleb, 2013, “There Must Be A First: Why Thomas\nAquinas Rejects Infinite, Essentially Ordered, Causal Series”,\n<em>British Journal for the History of Philosophy</em>, 21(5):\n838–856.</li>\n<li>Dixon, T. Scott, 2016, “What Is the Well-Foundedness of\nGrounding?”, <em>Mind</em>, 125(498): 439–468.</li>\n<li>Dummett, Michael, 1960, “A Defense of McTaggart’s\nProof of the Unreality of Time”, <em>The Philosophical\nReview</em>, 69(4): 497–504.</li>\n<li>Fine, Kit, 1994, “Essence and Modality”,\n<em>Philosophical Perspectives</em>, 8: 1–16.</li>\n<li>–––, 1995, “Ontological Dependence”,\n<em>Proceedings of the Aristotelian Society</em>, 95:\n269–290.</li>\n<li>Gillett, Carl, 2003, “Infinitism Redux? A Response to\nKlein”, <em>Philosophy and Phenomenological Research</em>, 66\n(3): 709–717.</li>\n<li>Gratton, Claude, 1997, “What Is An Infinite Regress\nArgument?”, <em>Informal Logic</em>, 18: 203–224.</li>\n<li>–––, 2009, <em>Infinite Regress Arguments</em>,\nDordrecht: Springer.</li>\n<li>Hale, Bob, 2002, “The Source of Necessity”,\n<em>Philosophical Perspectives</em>, 16: 299–319.</li>\n<li>Incurvati, Luca, 2014, “The Graph Conception of Set”,\n<em>Journal of Philosophical Logic</em>, 43(1): 181–208.</li>\n<li>Hume, David, 1779, <em>Dialogues Concerning Natural Religion</em>,\nMartin Bell (ed.), London: Penguin, 1990.</li>\n<li>Jenkins, C.S., 2011, “Is Metaphysical Dependence\nIrreflexive?”, <em>The Monist</em>, 94(2): 267–276.</li>\n<li>Johansson, Ingvar, 2009, “Proof of the Existence of\nUniversals—and Roman Ingarden’s Ontology”,\n<em>Metaphysica</em>, 10(1): 65–87.</li>\n<li>Klein, Peter, 1998, “Foundationalism and the Infinite\nRegress of Reasons”, <em>Philosophy and Phenomenological\nResearch</em>, 58(4): 919–925.</li>\n<li>–––, 2003, “When Infinite Regresses Are\n<em>Not</em> Vicious”, <em>Philosophy and Phenomenological\nResearch</em>, 66(3): 718–729.</li>\n<li>Koslicki, Kathrin, 2013, “Ontological Dependence: An\nOpinionated Survey” in B. Schnieder, M. Hoeltje, and A.\nSteinberg (eds.), <em>Varieties of Dependence: Ontological Dependence,\nGrounding, Supervenience, Response-Dependence</em>, München,\nGermany: Philosophia Verlag, pp. 31–64.</li>\n<li>Leibniz, Gottfried, 1686–87, “Letters to\nArnauld”, page references are to the reprint in R. Ariew &amp;\nD. Garber (ed.), <em>G.W. Leibniz: Philosophical Essays</em>, Indiana:\nHackett, 1989, pp. 69–90.</li>\n<li>Lewis, David, 1973, <em>Counterfactuals</em>, Oxford:\nBlackwell.</li>\n<li>Löwenstein, David, 2017, “A Uniform Account of Regress\nProblems”, <em>Acta Analytica</em>, 32: 333–354.</li>\n<li>McTaggart, J. Ellis, 1908, “The Unreality of Time”,\n<em>Mind</em>, 17(68): 457–474.</li>\n<li>Markosian, Ned, 1993, “How Fast Does Time Pass?”,\n<em>Philosophy and Phenomenological Research</em>, 53(4):\n829–844.</li>\n<li>Maurin, Anna-Sofia, 2007, “Infinite Regress: Virtue of\nVice?”, in T. Rønnow-Rasmussen, B. Petersson, J.\nJosefsson &amp; D. Egonsson (eds.), <em>Hommage</em> <em>à\nWlodek: Philosophical Papers Dedicated to Wlodek Rabinowicz</em>.\n [<a href=\"http://www.fil.lu.se/hommageawlodek/index.htm\" target=\"other\">Available online</a>]</li>\n<li>Maurin, Anna-Sofia, 2013, “Infinite Regress\nArguments’” in C. Svennerlind, J. Almäng &amp; R.\nIngthorsson (eds.), <em>Johanssonian Investigations: Essays in Honour\nof Ingvar Johansson on His Seventieth Birthday</em>, New Jersey:\nTransaction Books, pp. 421–438.</li>\n<li>Mellor, D.H., 1998, <em>Real Time II</em>, London: Routledge.</li>\n<li>Mendell, Henry, 2017, “Aristotle and Mathematics”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Spring 2017\nEdition), Edward N. Zalta (ed.), URL =\n&lt;https://plato.stanford.edu/archives/spr2017/entries/aristotle-mathematics/&gt;.</li>\n<li>Nolan, Daniel, 1997, “Quantitative Parsimony”,\n<em>British Journal for the Philosophy of Science</em>, 48(3):\n329–343.</li>\n<li>–––, 2001, “What’s Wrong With\nInfinite Regresses?”, <em>Metaphilosophy</em>, 32(5):\n523–538.</li>\n<li>–––, 2008a, “Truthmakers and\nPredication”, in Dean Zimmerman (ed.), <em>Oxford Studies in\nMetaphysics</em>, 4: 171–192.</li>\n<li>–––, 2008b, “Finite Quantities”,\n<em>Proceedings of the Aristotelian Society</em>, 108:\n23–42.</li>\n<li>–––, 2018, “Cosmic Loops”, in Ricki\nBliss and Graham Priest (eds.), <em>Reality and Its Structure: Essays\nin Fundamentality</em>, Oxford: Oxford University Press, pp.\n91–106.</li>\n<li>–––, 2019, “Infinite Barbarians”,\n<em>Ratio</em>, 32(3): 173–181.</li>\n<li>Orilia, Francesco, 2009, “Bradley’s Regress and\nUngrounded Dependence Chains: A Reply to Cameron”,\n<em>Dialectica</em>, 63(3): 333–341.</li>\n<li>Passmore, John, 1961, <em>Philosophical Reasoning</em>, New York:\nScribner’s.</li>\n<li>Peijnenburg, J., 2007, “Infinitism regained”,\n<em>Mind</em>, 116(463): 597–602. doi:10.1093/mind/fzm597</li>\n<li>Priest, Graham, 2014, <em>One</em>, Oxford: Oxford University\nPress.</li>\n<li>Rabin, Gabriel and Rabern, Brian, 2016, “Well Founding\nGrounding Grounding”, <em>Journal of Philosophical Logic</em>,\n45(4): 349–379.</li>\n<li>Rieger, Adam, 2000, “An Argument for Finsler-Aczel Set\nTheory”, <em>Mind</em>, 109(434): 241–254.</li>\n<li>Rescher, Nicholas, 2010, <em>Infinite Regress</em>, New Jersey:\nTransaction Publishers.</li>\n<li>Roberts, Debbie, 2017, “Depending on the Thick”,\n<em>Aristotelian Society Supplementary Volume</em>, 91:\n197–220.</li>\n<li>Rosen, Gideon, 2010, “Metaphysical Dependence: Grounding and\nReduction”, in Bob Hale and Aviv Hoffman (eds.), <em>Modality:\nMetaphysics, Logic and Epistemology</em>, Oxford: Oxford University\nPress, pp. 109–136.</li>\n<li>Schaffer, Jonathan, 2003, “Must There Be A Fundamental\nLevel?”, <em>Noûs</em>, 37(3): 498–517.</li>\n<li>–––, 2009, “On What Grounds What”,\nin D. Chalmers, D. Manley &amp; R. Wasserman (eds.),\n<em>Metametaphysics</em>, Oxford: Oxford University Press, pp.\n347–383.</li>\n<li>–––, 2010, “Monism: The Priority of the\nWhole”, <em>Philosophical Review</em>, 119(1):\n31–76.</li>\n<li>Sider, Theodore, 2011, <em>Writing the Book of the World</em>,\nOxford: Oxford University Press.</li>\n<li>Sinnott-Armstrong, Walter, 1996, “Moral Skepticism and\nJustification”, in Walter Sinnott-Armstrong and Mark Timmons\n(eds.), <em>Moral Knowledge? New Readings in Moral Epistemology</em>,\nOxford: Oxford University Press, pp. 3–48.</li>\n<li>Skow, Bradford, 2015, <em>Objective Becoming</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Smart, J.J.C., 1949, “The River of Time”,\n<em>Mind</em>, 58(232): 483–494.</li>\n<li>Sosa, Ernest, 1980, “The Raft and the Pyramid: Coherence\nVersus Foundations in the Theory of Knowledge”, <em>Midwest\nStudies in Philosophy</em>, 5(1): 3–26.</li>\n<li>Thompson, Naomi, 2016, “Metaphysical Interdependence”,\nin Mark Jago (ed.), <em>Reality Making</em>, Oxford: Oxford University\nPress, pp. 38–55.</li>\n<li>–––, 2018, “Metaphysical Interdependence,\nEpistemic Coherentism and Holistic Explanation”, in Ricki Bliss\nand Graham Priest (eds.), <em>Reality and Its Structure: Essays in\nFundamentality</em>, Oxford: Oxford University Press, pp.\n107–125.</li>\n<li>Väyrynen, Pekka, 2013, “Grounding and Normative\nExplanation”, <em>Aristotelian Society Supplementary\nVolume</em>, 87: 155–178.</li>\n<li>Vlastos, Gregory, 1954, “The Third Man Argument in the\nParmenides”, <em>Philosophical Review</em>, 63(3):\n319–349.</li>\n<li>Wieland, Jan Willem, 2013a, “Infinite Regress\nArguments”, <em>Acta Analytica</em>, 28: 95–109.</li>\n<li>–––, 2013b, “Strong and Weak Regress\nArguments”, <em>Logique et Analyse</em>, 224:\n439–461.</li>\n<li>–––, 2014, <em>Infinite Regress Arguments</em>,\nSpringer.</li>\n<li>Wilson, Jessica, 2014, “No Work for a Theory Of\nGrounding”, <em>Inquiry</em>, 57(5–6):\n535–579.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Aristotle, Special Topics: mathematics",
            "Bradley, Francis Herbert: Regress",
            "cosmological argument",
            "dependence, ontological",
            "dialetheism",
            "grounding, metaphysical",
            "infinity",
            "justification, epistemic: coherentist theories of",
            "justification, epistemic: foundationalist theories of",
            "McTaggart, John M. E.",
            "space and time: supertasks",
            "Zeno of Elea: Zeno’s paradoxes"
        ],
        "entry_link": [
            {
                "../aristotle-mathematics/": "Aristotle, Special Topics: mathematics"
            },
            {
                "../bradley-regress/": "Bradley, Francis Herbert: Regress"
            },
            {
                "../cosmological-argument/": "cosmological argument"
            },
            {
                "../dependence-ontological/": "dependence, ontological"
            },
            {
                "../dialetheism/": "dialetheism"
            },
            {
                "../grounding/": "grounding, metaphysical"
            },
            {
                "../infinity/": "infinity"
            },
            {
                "../justep-coherence/": "justification, epistemic: coherentist theories of"
            },
            {
                "../justep-foundational/": "justification, epistemic: foundationalist theories of"
            },
            {
                "../mctaggart/": "McTaggart, John M. E."
            },
            {
                "../spacetime-supertasks/": "space and time: supertasks"
            },
            {
                "../paradox-zeno/": "Zeno of Elea: Zeno’s paradoxes"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=infinite-regress\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/infinite-regress/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=infinite-regress&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/infinite-regress/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=infinite-regress": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/infinite-regress/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=infinite-regress&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/infinite-regress/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Klein, Peter D., and Turri, John,\n “<a href=\"https://www.iep.utm.edu/inf-epis/\" target=\"other\">Infinitism in Epistemology</a>”,\n in <em>Internet Encyclopedia of Philosophy</em>, James Fieser and\nBradley Dowden (editors).",
            "Dowden, Bradley,\n “<a href=\"https://www.iep.utm.edu/infinite/\" target=\"other\">The Infinite</a>”,\n in <em>Internet Encyclopedia of Philosophy</em>, James Fieser and\nBradley Dowden (editors)."
        ],
        "listed_links": [
            {
                "https://www.iep.utm.edu/inf-epis/": "Infinitism in Epistemology"
            },
            {
                "https://www.iep.utm.edu/infinite/": "The Infinite"
            }
        ]
    }
}