{
    "url": "jaina-philosophy",
    "title": "Jaina Philosophy",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Marie-Hélène Gorisse\n<mhgorisse@gmail.com>",
        "author_links": [
            {
                "mailto:mhgorisse%40gmail%2ecom": "mhgorisse@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nMarie-Hélène Gorisse\n&lt;<a href=\"mailto:mhgorisse%40gmail%2ecom\"><em>mhgorisse<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Feb 13, 2023"
    ],
    "preamble": "\n\nThe Jains are those who consider that the teaching of the omniscient\nJinas is the expression of the eternal essential nature of the\nuniverse. The only extant teaching is that of Mahāvīra\n(traditional dates 599–527/510 BCE, in Magadha, South of modern\nBihar), the last Jina of the current cosmic period.\n\nIn their practice, Jaina renunciants follow a rigorous method towards\nsalvation, in which a non-violent way of life, the renunciation from a\nworldly ego, the dissociation of self and non-self, and a gradual\npurification of the self towards unobstructed knowledge, become as\nmany different facets of the same effort to access to a superior order\nof being in which each self manifests its true nature.\n\nThis path came to involve structured monastic and lay communities;\nsets of practices—ritual and devotional acts, ascetic practices,\nrules of life; as well as conceptions of the world deposited in\ncanonical and post-canonical corpuses, in systematic treatises, or in\nnarrative literature. Jaina Philosophy is the set of philosophical\ninvestigations developed by thinkers as they appear in these different\ncorpuses (Malvania & Soni 2007; Potter & Balcerowicz 2013,\n2014). While several trends can be observed from the canonical period\nto modern thinkers via the mystics, the following principles are\nshared: Jaina metaphysics is an atomist and dualist conception of the\nworld, it focuses on the nature of the self, on that of karmic matter,\nas well as on their principles of association. Jaina ethics consists\nof practices focused on non-violence, non-absolutism and\nnon-attachment, which aim to disentangle the self and karmic matter\nand which help one to reach omniscience. Besides, Jaina philosophers\nare particular renown for developing a realist epistemology centered\non “many-sidedness”.\n\nJaina philosophy is composed in Ardhamāgadhī, Jaina\nMāhārāṣṭrī, Śaurasenī,\nSanskrit, Apabhraṃśa, Braj Bhāṣā, Kannada,\nTamil, Gujarati, Hindi, to quote only the main languages. This entry\nprovides Sanskrit terms only, because Sanskrit became the\nlingua franca of philosophical inter-doctrinal discussions in\nSouth Asia at the turn of the common era.\n",
    "toc": [
        {
            "#EthiRenuSelfSacrNonViolOmni": "1. Ethics of renunciation: from self-sacrifice to non-violence and omniscience"
        },
        {
            "#EscaRebiThroSelfSacr": "1.1 Escaping rebirths through self-sacrifice"
        },
        {
            "#NonViolCharMarkJain": "1.2 Non-violence as a characteristic mark of Jainism"
        },
        {
            "#CateReal": "1.3 The categories of reality"
        },
        {
            "#LibeUnobKnow": "1.4 Liberation as unobstructed knowledge"
        },
        {
            "#CompWorlMetaTaxoCosm": "2. A complete worldview: metaphysics, taxonomies, cosmology"
        },
        {
            "#SixTypeSubs": "2.1 Six types of substances"
        },
        {
            "#Atom": "2.2 An atomism"
        },
        {
            "#ReasAnth": "2.3 A reasoned anthropocentrism"
        },
        {
            "#SelfKarmWhicTypeDualForJainPhil": "2.4 Of self and karma: which type of dualism for the Jaina philosopher"
        },
        {
            "#UnivSeenOmniOnes": "2.5 The universe as seen by the omniscient ones"
        },
        {
            "#Epis": "3. Epistemology"
        },
        {
            "#MainTypeKnow": "3.1 The main types of knowledge"
        },
        {
            "#AuthTeac": "3.2 Authoritative teaching"
        },
        {
            "#InfeReasDebaHall": "3.3 Inferential reasoning and the debating hall"
        },
        {
            "#RealManySide": "3.4 Realism and many-sidedness"
        },
        {
            "#MakiDist": "3.4.1 On making distinctions"
        },
        {
            "#ParaCausAccoForChanPers": "3.4.2 From the paradoxes of causation to accounting for change and persistence"
        },
        {
            "#ExisNonExisModePred": "3.4.3 Existence, non-existence, and the modes of predication"
        },
        {
            "#DoctPers": "3.4.4 The doctrine of perspectives"
        },
        {
            "#Conc": "Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#GeneIntr": "General introductions"
        },
        {
            "#PrimLite": "Primary literature"
        },
        {
            "#SecoLite": "Secondary literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Ethics of renunciation: from self-sacrifice to non-violence and omniscience\n1.1 Escaping rebirths through self-sacrifice\n\nJaina teaching firstly aims to promote a type of behavior, a method to\nconcretely modify an unsatisfying situation, not by modifying\none’s environment, but by modifying oneself. More precisely,\nindividuals aim at freeing themselves from the infinite cycle of\npainful rebirths. In order to achieve this, they are meant to progress\nwithin a spiritual path thanks to an internal sacrifice based on\nascetic practices of renunciation. The Jain who aspires to final\nemancipation abandons worldly life, notably all her possession. This\ncorrect behavior (samyak carita) consists in an extreme\nself-control. Jainism is an arduous path, in which the disciple needs\nmethods to assist her, as described in length notably in the Later\nChapters (Uttarādhyayana, 2nd century\nBCE–1st century CE [Utt.]). One such method is an\nincitement to cultivate a pessimistic attitude towards the world. For\nexample, the twelve contemplations (anuprekṣā),\nwhich are pre-meditative states, are incitements towards the\ncontemplation of human beings and of their relation to the surrounding\nworld, which prompt the awareness that:\n\neverything in the world is not enduring;\nall beings are helpless;\nwhen an individual is spiritually free, only she has been able to\nachieve it, and only she can enjoy it, no other individual can assist\nand share, each individual is isolated;\nall the relationships of an embodied self are temporary, not\nreal;\nempirical reality from life to death to life is endless and full\nof calamities;\nthe empirical universe is an abode for selves that do not know\ntheir real nature;\nembodied selves are bound in impure, rotten and stinking\nbodies;\nthe influx of karmic matter is the main cause of miseries;\nthe stoppage of the influx of karmic matter is possible by means\nof penances;\nthe purification of karmic matter that is already bound is\npossible by means of penances;\nthe doctrine (dharma) preached by the Jinas leads to\nspiritual freedom;\nhuman enlightenment is rare and difficult to obtain, it is an\nessential duty of all humans to get it prior to their death\n(Treatise on What There Is, TS 9.7).\n\n1.2 Non-violence as a characteristic mark of Jainism\n\nA peculiarity of Jainism is to essentially associate these\nrenunciatory liberating practices with the imperative of non-violence\n(ahiṃsā) (Donaldson & Bajželj 2021). More\nprecisely, at the heart of Jainism is the belief according to which\neach living being is the transitory embodiment of a permanent\ndivine-like self (jīva), which is unobstructed\nconsciousness. In this conception, a human being can clear her self\nfrom all the obstructions she currently experiences until she becomes\nthe unobstructed consciousness she essentially is. Now, this\nconception also implies the non-harming (ahiṃsā)\nof the other divine-like selves which, in turns, implies a constant\nawareness of their presence and true nature, as well as self-mastery\nand careful behavior. In one of the most ancient Jaina texts, the\nCanonical Text on Behavior\n(Ācārāṅgasūtra, ĀS), written\nin early Ardhamāgadhī around the\n4th–3rd centuries BCE, practices conducive\nto liberation are presented in the following way:\n\n\nĀS 1.1.21. For the sake of survival, for the sake of praise,\nhonor, reverence, for the sake of birth, death, liberation, for the\nsake of prevention of miseries…\nĀS 1.1.22. …some monk either indulges himself in\naction causing violence to the beings or earth-body through various\nkinds of weapons, makes others to cause violence to the beings of\nearth-body, or approve of others causing violence to the beings of\nearth-body.\nĀS 1.1.23. Such an act of violence proves baneful for him.\nSuch an act of violence deprives him of enlightenment.\nĀS 1.1.24. He (the true ascetic), comprehending it, becomes\nvigilant over the practice of self-discipline.\nĀS 1.1.25. Hearing from the Venerable Mahāvīra\nhimself or from the monks, one comes to know: it (i.e., causing\nviolence to the beings of earth-body), in fact, is the knot of\nbondage; it, in fact, is the delusion; it, in fact, is the death; it,\nin fact, is the hell.\n\n\n\nConcretely, to get closer to the realization of our real nature\nconsists of being aware of the presence of other selves in living\nbeings around oneself and of acting in a non-harming way towards them.\nThis gave rise to practices of renunciation:\n\npractices of non-violence, such as not eating meat, not drinking\nnon-filtered water containing microscopic forms of life, or walking\nwith extreme caution and restrictions;\npractices towards self-control, like meditation or mortification\nof the flesh;\npractices of abstinence, in the line of no sexual intercourse, no\nfood for given periods of time, non-possession up to the nudity of\nsome monks; and\npenances, today mainly consisting in fasts and recitation of\nprayers.\n\n\nOne can only notice the strict character of these norms of action.\nJaina thinkers have developed thorough classifications as a backdrop\nof these norms (Balbir 1999). First, classifications on the types of\nviolence to be avoided, that include not only direct harmful acts, but\nalso delegated ones, as well as the bare fact of permitting a harmful\nact by letting it happen. Besides, acts can be physical, verbal or\nmental ones. This forms the ground of a moral theory in which our\nresponsibility extends far beyond commonly shared conceptions.\n\nNext to this, living beings are classified, from one-sensed beings,\nlike earth-beings, water beings or plants, to five-senses beings, like\nhumans, mammals, or gods. In this classification, only human beings\ncan get liberated. So even if gods have more felicity than human\nbeings, this is not the ultimately desired state. With such a\nconception, Jainism propounds a type of reasoned anthropocentrism,\ninasmuch as there is a unicity and rarity of the human life, without\nit being central. Besides, one should avoid to harm even the\nmicroscopic life forms present in the soil. This version of\nnon-violence is so extreme that one’s restrained action is very\nclose to one’s mere absence of act, since even breathing,\ndrinking water, or walking can prove harmful.\n\nOn a methodological level, one can also only notice the thorough use\nof lists in this philosophical paradigm, the more striking example is\nprobably to be found in the Canonical text on possibilities\n(Sthānāṅgasūtra,\n3rd–2nd centuries BCE\n[Ṭhāṇ.]), in which philosophical considerations take\nthe form of ordered lists of items, starting with singletons in\nchapter one (e.g., one Mahāvīra in this cosmic cycle),\ncontinuing with lists of two items in chapter two (e.g., the self\nversus non-self stuff), and so on up to the tenth chapter,\nthat presents lists of ten items (e.g., there are ten characteristics\nof the Jaina path, namely patience, liberation, honesty, kindness,\nhumbleness, truth, self-discipline, austerity, detachment and\nchastity).\n\nThe difficulty of following these norms of action gave rise to two\nimportant changes in Jaina conceptions of the world (Johnson 1995).\nFirst, in early canons, violent acts are the only direct factors of\nbondage; while in later canonical texts, passions came to play an\nimportant role, which means that one’s intention to harm is\nvalued in the calculus of one’s bondage. In this dynamic,\nnon-intentional harmful act can be forgiven. Second, the difficulty to\nfollow these norms is one of the fields in which the many-sided\nperspectival stance of Jaina philosophers emerged, since an action can\nbe qualified as harmful from a given perspective, while qualified as\nnon-harmful—therefore permitted—from another\nperspective.\n\nNow, next to be able to determine whether an act is harmful or not is\nthe question to determine what is a self and what is not.\n1.3 The categories of reality\n\nThe Treatise on What There Is\n(Tattvārthasūtra, TS), associated with the name of\nUmāsvāmin and probably written by multiple authors around\n150–400 CE, is traditionally considered as the first work and\nmain representative of classical Jaina philosophy. It is the oldest\nextant Jaina treatise in Sanskrit. It aims to integrate themes tackled\nin canonical literature in a coherent philosophical system. The\nTreatise on what there is, opens with the following\nverses:\n\n\nTS 1.1. The path to liberation is constituted by right view\n(darśana), right knowledge, and right conduct.\nTS 1.2. Right view is confidence in the categories.\nTS 1.4. The categories are self, non-self, inflow [of karmic\nmatter], bondage [with karmic matter], stoppage [of the inflow],\ndestruction [of the bondage], liberation.\nTS 5.1. The inanimate entities (= non-self) are medium of motion\n(dharma), medium of rest, space and matter.\nTS 5.2. [These] together with the selves are the substances.\nTS 5.38. (exists only in some textual traditions). Time is also a\nsubstance.\n\n\n\nSo, there are seven categories and six types of substance. The first\ncategory consists in selves, which are a type of substance, while the\nsecond category, the non-self stuff, encompasses the five remaining\ntypes of substance. These two categories will be dealt with in more\ndepth in the section on metaphysics\n (§2.1).\n Next to these, are the inflow of harmful and harmless karmic matter\ninto a sentient substance (āsrava); the mutual\nintermingling of sentient and non-sentient karmic matter caused by\nwrong belief, non-renunciation, carelessness, passions and vibrations\nset in the soul through mind, body and speech (bandha); the\nstoppage of the inflow of karmic matter into a sentient substance that\nresults from right conduct (saṃvara); the gradual\ndissociation of karmic matter from a sentient substance\n(nirjarā); and the state of complete annihilation of\nkarmic matter in the pure sentient substance (mokṣa).\nFor this section on ethics, what is important to keep in mind is that\nfive out of the seven elementary categories are not ontological ones,\nbut define the way by means of which the self, which is primarily\nactive consciousness, relates to things which are not conscious and\npassive.\n\nFirst, this means that the categories relevant in this metaphysics are\nintroduced inasmuch as a good understanding of their nature is\nessential in characterizing the practice that will make one progress\nin the path towards liberation.\n\nSecond,\n\n\nthese categories (tattva) are essentially “facts”\nabout the nature of existence which enable those who analyse them\nproperly to plot their route to liberation. (Johnson 2014)\n\n\nAs such, there is an inbuilt soteriological concern of Jaina ontology\nand metaphysics.\n\nThird, the core categorical differentiation distinguishes between what\nis animate and conscious and what is not. Such an impermeable\ndistinction is especially essential in a conception in which one needs\nto be able to know precisely how much her acts are correct,\nrespectively incorrect, because the harm done to others binds her.\nThis was an important part of the discussions concerning monastic\npractices.\n1.4 Liberation as unobstructed knowledge\n\nNext to these considerations, epistemological concerns are likewise\nprevalent in the shaping of the metaphysical and soteriological\nedifices. This is due to the fact that Jaina practices aim at the\npractitioner’s liberation from wrong conceptions\n(mithyātva). In the Treatise on What There Is,\nthe self is defined in the following way:\n\n\nTS 2.8. The defining characteristic of the self is experience\n(upayoga).\n\n\n\nThis definition is further commented in the Commentary on the\nTreatise on What There Is\n(Tattvārthasūtrabhāṣya [TSBh]), written\nin Sanskrit by Umāsvāti (400–450 CE), by dividing this\nexperience into cognition (jñāna) and\nindeterminate perception (darśana) (TSBh 2.9.1).\n\nThis stress on epistemic abilities is not typical of Jainism. Indeed,\nin most South Asian philosophico-religious traditions, the divine, the\nabsolute, is usually primarily knowledge (jñāna),\nconsciousness (cit), insight (prajñā),\nthe subject of experience (puruṣa) or the seer\n(draṣṭṛ). Therefore, Jaina conceptions of\nthe self (ātman, jīva) as ultimately\nunobstructed consciousness are no exception here.\n\nNor is the fact that our spiritual progress consists in a progress\nwhich is virtuous and epistemic at the same time. To explain, karma is\nin Jainism conceived as a subtle type of matter that fills all cosmic\nspace. Its specific property is to develop the consequences of our\nvirtuous, respectively unethical, acts. And then, due to passions\nwhich act as a glue, karmic matter sticks to the self and obstructs\nits potency. Let us think of someone’s reflection in a mirror as\na type of expression of herself. Now, imagine that the mirror is red,\nwith the pun that the Sanskrit expression\n“rāga” means both “red object”\nand “attachment, passion.” In such a situation, the person\nwill have a red, therefore distorted, vision of herself. Jaina\nthinkers teach us that karmic matter function likewise, it has the\nshape of one’s impetus towards objects and, doing so, it impedes\none’s epistemic competence, as she approaches things as part of\na given limited project she has. From this, getting rid of specific\nintentions, acting in an equanimous virtuous way is also burning karma\nis also acquiring the means to see things in a less distorted way.\nThat is to say things as they are instead of things as I\nintend them to be. This is this removal of wrong habits that\nenables right knowledge and right sight to take place, and that\nexplains that the acquisition of higher faculties of knowledge is\nensured by renunciation from passions and the corresponding\ndestruction of karmic bondage.\n\nIn general, within a framework that admits the karma theory:\n\nThe acquisition of higher epistemic abilities is ensured by moral\nbehavior and the corresponding destruction of karma. In this dynamic,\ntheories of karma blur the distinction between epistemology and\nsoteriology.\nMetaphysical investigations focus on the world qua\nknowable. For example, Jainas derive the expression\n“loka”, “the universe”, not from the\nSanskrit etymology “open space”, but from the root\n“lok-”, “to see”, inasmuch as the\nuniverse is conceived as “that which is seen by the omniscient\none” (Dundas 2002). In general, theories of karma blur the\ndistinction between epistemology and metaphysics.\nEven a clod of earth exists as earth because it has\nearned its particular niche in the wider system of life processes due\nto its previous deeds. In consequence, the world of nature cannot be\nseparated from the moral order. In general, theories of karma blur the\ndistinction between metaphysics and soteriology.\n\n2. A complete worldview: metaphysics, taxonomies, cosmology\n2.1 Six types of substances\n\nWe have just seen that the Jaina ethical effort is focused on\ndistinguishing what is the self from what it is not. This is what\nexplains that Jaina metaphysics is regularly presented as a dualism\nthat conceives the world a resulting from the activity of the elements\nbelonging to these two everlasting uncreated coexisting and\nindependent categories (Dixit 1971). This conception is close to that\nof Sāṃkhya philosophy, which admits of two irreducible\ncategories, namely the Experiencer (puruṣa) and the\nExperienced (prakṛti), and which considers philosophy\nas the activity whose main goal is the disentanglement of these two\ncategories. Now, besides these shared fundamental conceptions, both\nclassifications deeply diverge (Bronkhorst 2007).\n\nIn Jainism, the self (jīva) is more precisely\nunobstructed consciousness that concretely experiences cognition and\nperception. It is also what desires pleasure, reads pain, acts\nbeneficially or harmfully and experiences the fruit thereof. In other\nwords, being an influential active self is a condition of possibility\nfor the individual to make or unmake herself in the world, which is\nperceived by Jains as a condition of possibility for ethical\nresponsibility. Here, their conception differs from the one of\nSāṃkhya philosophers, who consider that in deepest reality,\nthe self has never acted, and that all perceived activity is actually\nperformed by non-self stuff trying to imitate the self. From this,\nselves have never genuinely been bound by karma, and realizing this\nproper nature of things thanks to the yogic practice of meditation is\nalone sufficient to free from rebirth and karmic retribution. For more\non yoga and meditative practices in Jainism, see the Treatise on\nyoga (Yogaśāstra [YŚ]) by Hemacandra\n(1089–1172) (Chapple 2016; Tatia 1951).\n\nDespite the success of this conception and the fact that Jaina\nphilosophers share most of the necessary elements to also subscribe to\nthis conception, they will not take this direction. The reason for\nthis is that they need an active self, because moral distinctions lose\ntheir value on the hypothesis of the passivity of the soul. On this\npoint, they are also severe critics of theories of the creation of the\nworld by God (Īśvara), in which the intelligent\nsubject is the mere product of an external intelligent principle; or\nof the fatalist theory according to which all things are fixed; to\nindicate but a few interlocutors.\n\nBesides, Jaina philosophers consider that there are as many selves as\nthere are living beings in the world. Each has a persisting\nself-identity preserved even in the ultimate condition, which is a\ncondition of possibility for ethical responsibility. Concerning\none’s responsibility for a series of acts, Jaina authors are\nhighly critical, both of the Buddhist conception according to which\nthere is no self, and of the Brahmanic conception according to which\nthe individual self is ultimately undifferentiated with the universal\nself.\n\nFinally, there is a fixed amount of selves in the universe. Not only\nthe non-liberated ones go from one birth to the other in this cosmic\ncycle, but it will be the same ones who will continue to do so in the\nnext cosmic cycle, and so on. Besides, a self is fit, respectively\nunfit, for liberation. When a self is unfit, no amount of good act can\nchange this fact.\n\nSecond, the category of non-self (ajīva) deals with the\nmatter and organisational principles thereof. To begin with, space\n(ākāśa) is an all-pervading single indivisible\nwhole that includes both the part occupied by the world of things\n(loka) and the void and empty part beyond it\n(aloka). A point of space (pradeśa) is\nconceived as that which can be obstructed by one indivisible atom of\nmatter and which can give space to all types of particles.\n\nNow, space by itself is not a sufficient condition of motion and of\nrest. To avoid chaos, it is necessary to also postulate a medium of\nmotion (dharma), as well as a medium of rest\n(adharma). The traditional metaphor is that, as water is the\ncondition of the motion of fish, dharma and adharma\nare the condition of all motions. Here lies another specificity of\nJainism. While in other systems, dharma (etymologically\n“what sustains”) represents the only really sustainable\nstream of acts, the virtuous way of life, the worthy behavior,\none’s teaching or religion, here it stands for the medium of\nmotion, while meritorious behavior is\n“puṇya” (respectively, non-meritorious\nbehavior is “pāpa”). This is an instance of\na Jaina tendency to physicalize the philosophical and ethical\nconcepts. If we understand dharma as the universal law\nestablishing what is fit and what is not, hereby accounting for\nmovements with an intention, we can understand that in the early Jaina\nconceptions, in which the concrete acts, not the intention, are\nforemost, dharma becomes what accounts for movements in\ngeneral.\n\nTogether, space, the medium of motion and the medium of rest are the\nconditions of motion of things that can move, while they are\nthemselves unaffected by movement. They are devoid of the qualities of\ntaste, color, smell, sound, contact. They pervade the whole universe,\nyet they are non-physical, non-atomic and non-discrete. These three\nsubstances form a unity, they have the same all-embracing size and\ncontinuous form. They are distinguished merely because of the\ndifference in their respective functions. They are the conditions for\nthe subsistence of all things, selves and matter, the connecting\nenvironment which binds together the isolated phenomena into an\nordered whole.\n\nAs for matter (pudgala), it is the material cause of body,\nspeech, mind and breath. This means that in this conception, not only\nbodies (śārira), but also the physical mind, words,\nthoughts and breath, are types of subtle material substances. Matter\nis especially what accounts for the existence of karma, a subtle type\nof matter. To explain, there is a pan-Indian conception that what has\nparts is impermanent. In Jainism, matter is the only type of substance\nthat can associate or dissociate and, therefore, that has parts.\nTherefore, impermanence only comes from one’s association with\nmatter. Contrarily to matter, (i) a self is a single atom devoid of\nparts and totally independent from both other selves and other\nsubstances; (ii) space, medium of motion and medium of rest are each a\nsingle indivisible whole that occupies all cosmic space; and (iii)\ntime has no extension.\n\nFurthermore, Jaina thinkers develop a complex system, with\ncalculations, to explain the practical effects of karma, for example\nthe precise mass of material particles assimilated after a given act,\nor the duration and intensity of this assimilation. This resembles\nphysics, and one specificity of Jaina philosophy is to focus on\ndeveloping this complex system of the mechanisms of karma, as seen in\nthe Essence of [the teachings of] Mahāvīra\n(Gommaṭasāra [GS]) of Nemicandra (10th\ncentury CE). There are eight types of karmic matter (see TS 8.5),\ndivided in four harming (ghātiyā) and four\nnon-harming (aghātiyā) types (Jaini 1979). The\nharming types of karmic matter are:\n\ndelusory karma (mohanīya), which reduces one’s\ninnate bliss and brings about attachment to incorrect views. It\nnotably distorts one’s appreciation of the categories of\nreality;\nknowledge-obstructing karma\n(jñāna-avaraṇīya), which covers the\nself, the mind and the senses, therefore impedes their natural\nabilities;\nperception-obstructing karma\n(darśanāvaraṇīya), which impedes\none’s intuitions;\nobstacle karma (antarāya), which reduces one’s\ninnate energy.\n\n\nAnd the four non-harming types of karmic matter are:\n\nfeeling karma (vedanīya), which determines whether\nthe experiences of the self are pleasant or not;\nname karma (nāman), which determines what sort of\nrebirth is attained;\nlife karma (āyus), which decides the duration of\none’s life;\nclan karma (gotra), which determines one’s status\nwithin a species (Wiley 2011).\n\n\nFinally, time is what accounts for becoming. Time is not treated with\nother substances, because it has no extension. From this, it is not\nconsidered as a substance properly speaking, only in some aspects.\nEspecially, its existence can only be extrapolated from our awareness\nof phenomena. There is an absolute time (kāla), which is\neternal, and a relative time (samaya), with a beginning and\nvariations, determined by the motion in things. Time is called the\ndestroyer, because all things are liable to dissolution of form in the\ncyclic course of time.\n2.2 An atomism\n\nThe whole physics of Jainism is an atomism. In this, Jaina conceptions\nare close to those of the Nyāya-Vaiśeṣika tradition.\nAn atom (paramāṇu) is infinitesimal, ultimate and\neternal. From this, it is neither created nor destroyed. Now,\ncontrarily to the conceptions of Nyāya-Vaiśeṣika\nphilosophers, according to which God (Īśvara) is\nthe one who presides over the association of these atoms and creates\nthe world as we experience it, Jaina philosophers hold that there is\nno such entity. For them, atoms have always been there and their\nassociation follows natural laws. Jaina philosophers are especially\ncritical of an attitude that does not favor ethical responsibility,\nand the recognition that an external consciousness is responsible for\nthe state of the world risks to undermine this ethical responsibility\nbeyond repair. According to them, ethics especially requires that the\nindividual can make or unmake herself in this world. This is partly\nwhat explains that there is a lengthy tradition of refutations by both\nJaina and Buddhist philosophers of the Naiyāyika arguments in\nfavor of the fact that God is the sustainer of the world.\n\nNext to this, an atom is not necessarily material. Indeed, selves are\na type of atom. Matter exists as atom or as aggregate\n(skandha). The aggregates, produced out of a mutual\nattraction of atoms, vary from binary to infinite compounds and every\nperceivable object, that is to say every object endowed with a form,\nis an aggregate. As such, atoms are the formless basis of all forms,\nalthough sometimes it is said that it has form inasmuch as it can be\nperceived by the omniscient ones. Furthermore, in contradistinction\nwith the conception of Nyāya-Vaiśeṣika and in\nagreement with Leucippus and Democritus, Jaina philosophers hold that\nan atom of one type is first undifferentiated, similar to any other\natom of the same type, and then develops differentiated\ncharacteristics so as to become an atom of earth, an atom of water,\netc. Atoms therefore acquire a kind of taste, color, smell, contact,\nas well as weight, the heavier moving downwards and the lighter\nupwards. An interesting characteristic of Jainism is that an atom may\ndevelop a motion so swift that it traverses in one moment the whole\nuniverse. This explains that some saints, who are well advanced in the\npath that consists in realizing the proper nature of things, can\nperform this miracle.\n\nFinally, atoms can contract and expand. When in subtle state,\ninnumerable atoms occupy the space of one gross atom. Matter is an\neternal substance undetermined with regards to quantity and quality.\nIt is because the atoms in it can expand that matter may increase or\ndiminish in volume without addition or loss of particles. For a self,\nwhich also is an atom and which has dimensions although it is not\nmaterial, this means that it is capable of expansion and contraction.\nThe self is actually co-extensive with the physical body it occupies.\nThis is what explains that we have sensations from the top of the head\nto the tip of the toes. This means that the self is of a very small\nsize when it starts in the womb, then it expands and, at the end of\neach earthly life, it contracts again into the seed of the next birth.\nTo explain how this works, Jaina philosophers use metaphors such as\nthat of a lamp: whether placed in a small pot or in a larger room, a\nlamp illumines the whole space. In the same way, the self imparts\nconsciousness according to the dimensions of the body it occupies.\nAnother specificity of Jainism is the belief according to which, under\nspecial circumstances, an embodied self can expand beyond its body, up\nto the size of the universe, and act outside of it. This projection,\ncalled “samudghāta”,\n“extermination”, enables her to annihilate specific karmic\nmatter (Pragya 2021).\n2.3 A reasoned anthropocentrism\n\nJaina thinkers excel in developing lengthy and highly technical\nclassifications. A core classification is the taxonomy that\ndistinguishes the types of embodied selves according to the number of\nsenses they possess. This taxonomy has retained its importance for\ncontemporary practitioners, notably because it defines the extent of\ndemerit acquired when one actually harms a living being.\n\nThere, the first category gathers all the living beings possessing\nonly one sense, namely that of touch. This concerns either plants, or\nthe elemental selves which gets embodied in an atom of earth, of\nwater, of fire, or of air, either gross or subtle. In consequence,\nthere are souls also in things such as stones and metals. However, it\nis not always the case that a self gets embodied in these atoms. When\nthere is no self in it, the atom is purely inanimate matter, unable to\nsuffer. In opposition to this, each plant or animal is necessarily the\nhost of a self, this is what makes it alive. Concerning plants, some\ncan also be the host of several selves, as in the case of moss. This\nalso concerns the most basic life form, called\n“nigoda”, “idle”, and which consists\nin clusters of minute beings with little hope for liberation. They can\nbe found everywhere, including in air, tissues of plants, or flesh of\nanimals. The offense must be strong for a self once embodied in a\nhuman being to get embodied as a nigoda. One famous example\nis that of Makkhali Gośāla, leader of the heretic\nĀjīvika movement, who was disrespectful and challenged\nMahāvīra. Furthermore, if a plant dies, its self\ntransmigrates and gets re-embodied in another, more or less subtle,\nbody. In this case, the body of the plant is not alive anymore, but it\nis still inhabited by the selves of the bacteria that work towards its\ndecomposition. To conclude on one-sensed beings, they possess the\nsense of touch. This means that they cannot see, hear, smell, taste,\nnor think, but they have a minimal conscious activity in the form of\nthe tactile experience. Besides, even in a crude not developed way,\nthey can already experience pleasure and pain.\n\nNext to the one-sensed beings are all the animals. First, worms and\nevery being in their category, like leeches, mollusks, or a type of\nphytophagous beetles, are two-sensed beings, possessing both touch and\ntaste. Then, ants and all the beings in their category, like\nphytophagous insects, termites and millipedes, are three-sensed\nbeings, and are also able to smell. They are followed by the\nfour-sensed beings who can also see, like bees and similar beings as\nflies, mosquitoes, butterflies or scorpions. Finally, human beings and\nall the beings in their category, like fish, reptiles, birds,\nquadrupeds, demons and gods, are five-sensed beings, enjoying touch,\ntaste, smell, sight, and hearing. Amongst them, some also have an\nintellect (manas), considered by some authors as a sixth\nsense.\n\nIt is interesting to note that the English expression\n“animal” denotes what is animated, what has a soul. While\nin Jainism, what is animated, what has a soul (jīva),\nalso includes the immobile plants and elemental beings. In this\nconception, the Sanskrit expression for animal is\n“tiryañc-”, “what is able to cross a\nspatial area”.\n\nIt is hard to understand what is not alive in this system. Therefore,\nacting in a non-harmful way is close to non-acting. In practice, while\nthe lay community should avoid harming the beings with two or more\nsenses, the monastic community is supposed to also avoid harming the\none-sensed beings. With such a norm of action, monks and nuns cannot\ncook, nor perform a range of acts necessary for their survival. From\nthis, a system of redistribution of merit and demerit is developed for\nthe lay people, who perform some violent acts for their survival, but\nare redeemed in providing the means to live to the monastic\ncommunity.\n2.4 Of self and karma: which type of dualism for the Jaina philosopher\n\nEach self is eternal and, as such, it has no beginning nor end. At the\nsame time, each self is constantly experiencing change, because it is\nessentially active. This is a core teaching of Jainism to which we\nwill come back in the\n section 3.4\n on epistemology, namely, that every existing thing is at the same\ntime persistent and changing (Bajželj 2013). This is one of the\ndoctrinal points that prompted Jaina thinkers to speak in terms of\nmany-sided objects of knowledge.\n\nNow, this means that even the omniscient one who fully manifests the\nqualities of consciousness still has modal variations on its\nconsciousness, like momentary and innately arising modes of absolute\nknowledge and of absolute perception that continuously succeed to one\nanother being qualitatively identical, just as the innately produced\nmodes of time are qualitatively identical to one another (Bajželj\n2018).\n\nBesides, this also means that contrarily to the Sāṃkhya\nview, modifications are not only in the realm of matter. Selves also\nare experiencing states.\n\nBut this, in turns, entails that a change happens both at the level of\nmatter and at the radically distinct level of selves. A phenomenon\nthat helps us understand how this works in the Jaina view is the\nfunctioning of “life karma”. First, death is not an end,\nbut a reappraisal of the entanglement of one self with matter,\nregulated by karma. The fact that the life karma decides the duration\nof one’s life means nothing less that when one dies, say,\nbecause of a car accident, these external forces are only the material\ncause of the death of the embodied self, while the fruition of her\nlife karma is the efficient cause of her death. In such a conception,\ndeath happens as the fruit of the actions that one has herself\nperformed in a previous life.\n\nBefore we continue, it is worthy to note that one’s acts do not\ngenuinely determine the moment of one’s death in this life, but\nin the next one. Besides, when death happens, the most recent\nvolitional activities have an impact. All in all, one’s very\nlast breath can influence the specific outcome of the determination of\nthe life karma for one’s next life. This is what explains that\nthe Jains seek a good death. Such a good death is a death without\nstrong volitions, free from fears and desires. This, in turn, is what\nexplains the popularity of the ritual fast to death, called\n“sallekhana”, and that has caused some legal and\ncultural turmoil in recent years.\n\nSecond, since everything is already determined at the moment of death,\none’s transition from death to the being in a womb or other type\nof new type of life is considered instantaneous, there is no waiting\nperiod, since everything is already decided.\n\nTo come back to our main discussion, and try to understand how\none’s acts in the previous life also engender a duration\ndetermination for this experience, a parallel with the process of\nsedimentation is helpful. Take a muddy water, leave it without any\nmovement for a sufficient amount of time, and the different types of\nsubstances involved in this mixture will separate, the more gross\nparticles being at the bottom. In this process, time differs for each\nmixture, since the speed of the disentanglement depends upon the\nnature of the substances involved. The same phenomenon happens with\nthe self and its bodies, since their type of entanglement in the\nprevious life mechanically has an effect on the lapse of time that the\nnext entanglement will last. And this has nothing to do with a\ndeserved punishment after some fault, nor with a deserved reward after\nsome good deed. This has to do with the laws of physics. In the\nTreatise on What There Is, we can find calculations such as\nthis one:\n\n\nTS 8.15. Bondage to life karma lasts up to thirty-three\nocean-measured periods (that is, 1/3 × 8,400,00 × 8,400,00\n× 107 years).\n\n\n\nWith the sedimentation metaphor, it is still not clear why the\nefficient cause of death, the exhaustion of one’s life force, is\nnot enough, and why material factors are here also needed. This cannot\nmean that Jainism is a type of occasionalism, since originated\naggregates are efficient causes in their own realm. But at least, such\na conception is only possible if one conceives the world as a rational\nwhole in which things make sense together, even though only the\nomniscient ones can experience that.\n\nThe beginning of an answer to this question can be found in a second\ntradition, next to that of the Treatise on What There Is.\nThis tradition is that of Kundakunda. “Kundakunda” is\nactually not a single author, but the name that stands for the\ncollective authorship of a Jaina textual tradition composed in Prakrit\n(Jaina Śaurasenī) between the third and the eighth centuries\nCE around Karnataka in the South of India (Balcerowicz 2017).\nKundakunda’s textual tradition is as influent as the TS, and is\nregularly revered as sacred texts in Jaina temples. This textual\ntradition represents within Jainism a movement focused on the self, in\nwhich the religious practice that matters is the inward experience\nthat is self-knowledge. The central teaching of Kundakunda in his\nEssence of the self (Samayasāra [SSā]) is\nthat karmic matter is never genuinely mixed with the self. Therefore,\nit is close to Sāṃkhya conceptions, while keeping the Jaina\nspecificity of an essentially active self (Bronkhorst 2010). There,\nthe self is modified by modifications of consciousness\n(adhyavasāna) and by states (bhāva).\nHowever, it is possible to distinguish between different types of\nactivities, some of them not bringing about karmic retribution. And\nthis is exactly Kundakunda’s move when he redefines the self as\nnot the agent of what happens in the material world of karma. For him,\nthe self is active only in its own domain. Concretely, the self is the\nmaterial cause only of the modifications of consciousness, while\nkarmic matter is the indirect instrumental cause of wrong\nmodifications of it. In turn, the self is the indirect instrumental\ncause of karmic modifications, but only as a king indirectly causes\nthe virtue in his subjects when he acts in a virtuous way and is taken\nas a model.\n\nTo summarize, we have seen in the Treatise on What There Is\nthat karmic matter and the self intermingle in the same way some\nliquids do, since their respective nature is not modified by this\nmixture and can get separated. Indeed, in muddy water, water actually\nstays water; while sedimentary dust actually stays sedimentary dust.\nThen, we have seen that in the Essence of the self, the\nassociation between the self and karmic matter can be though of in\nterms of kings acting as models. Another metaphor is that of a\nmirror-like crystal: if a flower reflected in a crystal is red, we see\nthe crystal as if it was red, while it is not. Likewise, the self sees\nattachment and wrong notions superposed with it, not being it. All in\nall, in both textual lineages, what really matters is that the\ntwo—self and karmic matter—keep their essential distinct\nnatures. Besides, the world is a whole in which things are\nmechanically combined together. Even though the types of substances\nare radically separated, they co-exist within the same conditions and\nso they experience synchronized modifications (Gorisse 2019).\n2.5 The universe as seen by the omniscient ones\n\nFurthermore, Jaina authors believe that the life of the universe is a\nprocess without beginning nor end, that passes through an ongoing\nseries of cosmic cycles, each of which is billions of years in\nduration. The question of an origin and end of the universe does not\narise, since the latter is eternal. What matters is the transition\nbetween two types of periods. The universe goes through a series of\ncycles, each of which lasts several billion years. The wheel of time\nexperiences one descending cycle, which passes through six periods\nduring which prosperity, happiness, and morality decline; and one\nascending cycle, which passes through six periods during which\nprosperity, happiness, and morality increase. These periods are\ncharacterized by the possibility—respectively the\nimpossibility—of individual liberation while they happen.\nIndeed, on one hand, it takes a minimum of suffering to want to engage\nin the path of liberation. and on the other hand, serenity must be\nsufficiently accessible to be able to properly engage in ascetic\npractices. On the day when Kṛṣṇa left the earth, in\nthe third millennium BCE, after the great battle described in the\nThe Great [Epic of the Dynasty] of the Bhāratas\n(Mahābhārata), we entered into the fifth descending\nperiod of the cycle. It is therefore expected that things will go from\nbad to worse in our world for a few millennia before they get better\nagain. This means that it is no longer possible to achieve\nenlightenment in the current period, because the world order is too\nunstable.\n\nWe started this entry by stating that the Jains are those who consider\nthat the teachings of the omniscient Jinas are the expression of the\neternal essential nature of the universe, and that the only extant\nteaching is that of Mahāvīra “the Great Hero”\n(traditional dates 599–527/510 BCE), the twenty-fourth and last\nJina of the current cosmic period. Mahāvīra is an older\ncontemporary of the Buddha and has a biography very close to that of\nthe latter. Notably, he left his royal family, became an ascetic and\nfounded a community made of mendicant ascetics and lay followers. One\nnotable difference being that he follows a tradition that was existing\nlong before him.\n\nSo, at every cosmic cycle, the doctrine is taught by 24 such\nomniscient Jinas. These are also called\n“tīrthaṅkara” (ford makers). Since\nVedic times, a tīrtha refers to holy spots in shallow\nwaters, where people perform acts of devotion, especially bathing,\nwhich is considered as purifying sins. These shallow waters can also\nbe a crossing place symbolizing the junction between mundane world and\nsacred realm. In this line, a tīrthaṅkara is a\nspiritual pioneer able to cross beyond the perpetual flow of earthly\nlife and, as such, he or she (they do not have a sexual identity at\nthis stage) acts as a model mediating the passage between a mundane\nstate of our selves and a state of unobstructed consciousness in act.\nIt is important to notice that these liberated beings know all, but\nare by essence unable to influence the course of action of the world,\nsince they do not have intentions and that they are radically isolated\nfrom anything else.\n\nBesides, after Mahāvīra’s liberation, liberation is\nnot possible anymore in our realm for cosmic reasons. However, there\nare other realms, in which gods and demons notably live. Jainas have\ndeveloped a complex model of the universe (Dundas 2005). Canonical\nliterature (3rd century BCE—6th century\nCE) already includes description of the universe, but it is between\nthe 3rd and the 13th centuries CE that\nspecialized texts specifically dedicated to cosmography are composed,\namongst them, the influential Compendium of Middle Earth\n(Jambūdvīpasaṃgrahaṇī [JDS]) of\nHaribhadra Sūri (770 CE). There, the universe is described as\nbeing constituted of two parts. On one hand, the world\n(loka), extremely vast, but finite, is occupied by living\nbeings and by things; on the other hand, the rest (aloka)\nsurrounds the world with its infinite and empty space.\n\nThe inhabited world is made of a succession of island-continents,\noceans, hells and paradises. It measures the distance traveled by a\ngod who flies for six months at a speed of sixteen million kilometers\nper second. In this world, human beings live only in Middle-earth,\nalso called the Island-Continent of the Rose Apple Tree\n(Jambūdvīpa). Middle Earth is, as its name\nsuggests, central. Its surface is extremely small compared to the rest\nof the world. The different parts of the universe are defined in\nrelation to the possibility—respectively the\nimpossibility—of liberation therein and the region of Middle\nEarth is the only region from which it is possible to achieve\nliberation. Such a representation is conducive to remember the rare\nand central character of human birth, which alone can lead to\nliberation. Moreover, the extent and complexity of the whole is a\nconstant reminder of the skills of the omniscient Jinas who were able\nto teach such a system.\n\nAround the 16th c., the world is presented in the form of a\nhuman being, thus emphasizing the similarities between the structure\nof the world and the inner struggle faced by each individual.\nMoreover, the extremely detailed depiction of the world provides a\nbackdrop, both for the initiation tales of pious Jains found in\nnarrative literature, and for meditative practices, some of which\ninvolve the contemplation of a holy object. Ultimately, the precision\nwith which the authors describe the world allowed Jainism to stand out\nmore clearly from other worldviews. Indeed, only the values of Jainism\nprevail in these descriptions of the universe. In this sense, the\nuniverse thus represented becomes an emblem of religious identity, as\nwell as a guide to religious practice, because, above all else, the\nJaina world is the abode of beings on the path of liberation (Dundas\n2005).\n3. Epistemology\n3.1 The main types of knowledge\n\nIt is now clear that Jaina philosophy is essentially directed at the\nindividual effort of distinguishing the self and non-self stuff, until\none reaches liberation. Besides, the self is traditionally defined as\nexperience of consciousness, which consists in cognition\n(jñāna) and indeterminate perception\n(darśana). This will bring epistemological\nconsiderations at the core of Jaina philosophical investigations.\nFirst, there are many classifications of the different types of\nknowledge recognized by Jaina philosophers. The Treatise of What\nThere Is attempts at collecting and organizing the types of\nknowledge mentioned in earlier literature into four types of\nindeterminate perception, whose study is not developed; and eight\ntypes of cognition, namely ordinary cognition of the senses,\ntestimonial cognition, mental cognition, cosmic cognition, absolute\ncognition, and their faulty counterparts, namely wrong ordinary\ncognition of the senses, wrong testimonial cognition and wrong mental\ncognition (Shastri 1990; Balcerowicz 2017; den Boer 2020).\n\nA few remarks are in order. First, the distinction between cognition\nand indeterminate perception is inherited from older canonical sources\nand is discarded by most epistemologists after the seminal work of\nSiddhasena Mahāmati (710–780 CE), who indicates in his\nGuide of Logic (Nyāyāvatāra [NA])\nthat indeterminate perception collapses with cognition when perceptual\nexperience already retains some details. However, it gave the\nopportunity for Jaina philosophers to assimilate a distinction that\nwas especially important for Buddhist philosophers between conceptual\nand non-conceptual cognition.\n\nSecond, Jaina philosophers were influenced by the Nyāya\nclassification, which was the cornerstone of all the South Asian\nepistemological edifice, and that recognizes five means of knowledge\n(pramāṇa), namely perception, inference, testimony\nand analogy. Jainas assimilated this model by admitting these means of\nknowledge either as subtypes of ordinary cognition, or as testimonial\ncognition.\n\nThird, whatever enters our cognitive apparatus is a result of a\ncontact with what exists. The senses, which include the mind, are an\nintermediary between our self and the object of knowledge, but the\nself can also know the object of knowledge directly. Mental, cosmic\nand absolute cognitions are such direct types of knowledge, while\nordinary cognition and testimonial cognition are mediated ones. For\nJainas, direct knowledge of the soul is called\n“pratyakṣa” (directly present to the soul);\nwhile in other systems, “pratyakṣa”\n(present before the eyes) is what stands for everyday life perception,\ntherefore mediated by the organs of senses. This leads to competitive\nclassifications by Jaina authors in their attempts at being understood\nby their non-Jaina interlocutors (Clavel 2015).\n\nFourth, the material cause of cognitive error is wrong perception\n(mithyādarśana), which is due to knowledge\nobstructing karma. Therefore, error can only affect types of cognition\nof selves who are still entangled with this type of karma. Conversely,\nerror cannot affect cosmic and absolute cognition, which can be\nexperienced only when all one’s knowledge obscuring karma has\nbeen removed.\n3.2 Authoritative teaching\n\nIn this conception in which human beings are in principle able to\nexperience up to absolute cognition, it becomes possible even for\nsomeone who is not yet liberated to have a share in this, by relying\non the teaching of liberated beings. Such a possibility is especially\nvaluable, since knowing the phenomena unknowable by ordinary\ncognition, like the nature of the self, what happens after death, or\nthe primary cause and final end of the world, is essential inasmuch as\nit conditions one’s spiritual progress towards the realization\nof a proper human life. In this dynamic, Jaina philosophers consider\nthat a discourse is authoritative if it is uttered by such a liberated\nteacher, who is called “the one who has achieved, who is apt,\nreliable” (āpta).\n\nFirst, Jaina philosophers are here not concerned with everyday life\ntestimony, but with soteriological testimony.\n\nSecond, with this definition of an authoritative discourse, they are\nopposing the conceptions of the exegetes of the Veda, who consider\nthat an authoritative discourse is by definition non-human, whatever\none’s spiritual advancement, since the universal validity of a\ncorpus can only come from the power of language itself.\n\nThird, we said that liberated beings were absolutely isolated not\ninteracting life-monads. However, one reaches a state of experience of\nabsolute cognition before reaching liberation. More precisely, when\nall knowledge obscuring karmas are removed, one still has to wait for\na long time for non-harming karmas to also be exhausted. This is\nwithin this laps of time that the teaching of the Jinas happens.\n\nFourth, direct disciples of the liberated beings also experience extra\nmundane types of cognition, although lesser ones. This make them the\nperfect medium to interpret the sacred teaching and transmit it to us.\nIn such a way that “correct interpretation depends upon a\nteacher-pupil lineage or upon one”s own seniority and\nwisdom’ (Jyväsjärvi 2010). Indeed, an advanced monk is\nby definition both more knowledgeable and less deceptive (Flügel\n2010 [2016]). The fact that one can access soteriological relevant\nknowledge thanks to monks who are living members of a lineage of\ninterpretation is in part what explains the importance of theories of\ninterpretation in Jaina philosophy, as well as the fact that the\ncommentaries are regularly more important than the canon itself.\n\nIn the Manual for the behavior of laymen which is casket of\njewel\n(Ratna-karaṇḍa-śrāvakâcāra\n[RKŚĀ]), Samantabhadra (530–590 CE) characterizes the\nauthoritative teacher in the following way:\n\n\nRKŚĀ 1.6. This one is called the reliable one who has no\nhunger, thirst, old age, affliction (of body and of mind), birth,\ndeath, fear, pride, attachment, aversion, delusion.\n\n\n\nThe fact that the authoritative speaker is presented as a God-like\nentity who has moral aptitudes before he has intellectual ones, since,\nas we have seen, this is a step to reach unobstructed, absolute,\nknowledge, has a series of consequences on Jaina epistemology (Gorisse\n2022a). Especially, since these liberated beings have no intention, an\nauthoritative teacher who gives instructions does good to the people\nwithout being motivated by passions. He acts for the benefit of\nhumanity on account of his very nature, like a drum giving out sound\nat the touch of a beater does not want anything for itself:\n\n\nRKŚĀ 1.8. Un-egoistically and dispassionately a teacher\ninstructs from truth what is suitable. What (else) does a\nmuraja-drum require to sound but the touch of a skillful\nhand?\n\n\n\nOne consequence is that in Jainism, testimonial cognition can be\nconsidered as a proper means of knowledge, because knowledge acquired\nthanks to the teaching of an authoritative person is proper knowledge\nof what exists as it is, and not knowledge of what exists\nas intended. Now, this holds only if he authoritative speaker\nbelongs to the very specific category of speakers that we have seen.\nThis has the consequence that what is recognized as an authoritative\ndiscourse are the Jaina sacred Scriptures and their commentaries.\n\nFinally, we should keep in mind that this is consistently within an\napologetic objective to defend one’s own scriptural tradition\n(Qvarnström 2006) and to attack the one of others that the\ndifferent philosophico-traditions of India aimed to rationally justify\na given set of claims and that they developed their logical frameworks\nin the form of what can rightfully be called a “systematic\nphilosophy”, as we will investigate in the next paragraph. One\nissue in which the co-existence of a more systematic and a more\ndogmatic approach is manifest is the shift that happened with notably\nthe Buddhist Dharmakīrti (550–610) in his\nConsiderations on knowledge\n(Pramāṇavārttika [PV]), when a transition was\nmade from external criteria for the reliability of a discourse, like\nthe existence of an authoritative utterer; to internal criteria, like\nsoundness of the assertions themselves, or ability of the proponent to\nshow a proof for these assertions. The Jaina tradition experiences\nthis shift especially with the author Samantabhadra in his\nInvestigation on Authority\n(Āpta-mīmāṁsā [ĀMī])\n(Balcerowicz 2016a).\n3.3 Inferential reasoning and the debating hall\n\nA type of cognition that has a particular importance in South Asian\nphilosophy is that of inference (anumāna). Inference is\nthe type of cognition through which epistemic agents acquire new\nknowledge by means of reasoning upon what can be concluded with\ncertainty from previously acquired knowledge. This is what is\nexpressed by the Sanskrit expression\n“anumāna”, “the knowledge that follows\n[another knowledge]”. For example, when Devadatta wants to buy\nmangos, he wants to know which ones taste juicy before he buys them.\nAt this point, he is not yet allowed to taste them, but he can reason\nbased upon the color of the mangos and upon his past experience of a\ngiven color being associated with a given taste. In such a situation,\nthe regularity of Devadatta’s past experience is not a\ncoincidence, the co-presence of the property of having a given taste\nwith the property of having a given color is guaranteed by the fact\nthat both occurrences rely on the same causal complex, namely, a given\nstage of ripeness of the fruit at stake. This type of reasoning based\non a necessary relationship between two properties is what is called\n“inference”. In technical terms, there is a transmission\nof certainty from the established knowledge that an\n“evidence-property” (hetu) is ascribed to a given\nobject, to the new knowledge that a “target-property”\n(sādhya) is ascribed to the same object. This\ntransmission of certainty is based on the “invariable\nconcomitance” (vyāpti) between the two inferential\nproperties. Vyāpti originally means\n“pervasion” and is used in this technical sense, because\nthe pervasion of a property by another property, as in “whenever\nthere is a Sissoo tree, there is a tree”, is the model for\nsituations of necessary co-presence of the evidence-property with the\ntarget-property.\n\nInference has been thoroughly studied and its use strictly codified by\nthe different philosophico-religious traditions of South Asia, Jainism\nincluded, because it provides the structure of scientific reasoning.\nIndeed, the conclusion of an inferential reasoning is considered as a\nscientific truth inasmuch as this type of reasoning relies on the\nemancipation from contextual parameters and on the guarantee that the\nisolated relations are necessary ones.\n\nIn concert, inferential reasoning has a strong argumentative\npotential. To explain, by means of stating an inferential reasoning,\nit is possible to bring somebody else to the awareness of these\ntruths. Such a series of statements, even though it is not properly\nspeaking a type of cognition by itself, is metaphorically called\n“inference for others”\n(parārthānumāna), in opposition to the\n“inference for oneself”\n(svārthānumāna), which is a genuine type of\ncognition. An inference for others is traditionally used in a\nphilosophical debate in order to convince an interlocutor of a\ndifferent faith who has different beliefs concerning what there is. In\nJainism, there is an abundant literature of stories of conversion as\nthe outcome of such debates, as well as the development of debating\ntechniques to support one’s inferential reasoning (Gorisse\n2018). Furthermore, the different traditions share the belief that\nfrom this truth-preserving argument, it is possible to define the\nstandards of an ideally organized rational discussion, the outcomes of\nwhich are necessary true statements, and in the course of time, these\nphilosophers developed a common inter-doctrinal framework of\nargumentation for philosophical discussions (Gorisse 2017).\n\nFrom these observations, it comes as no surprise that the study of the\nrules to attack and defend the statement of an inference constitutes\nan important part of the logical investigations in Jainism. It also\ncomes as no surprise that these considerations developed in close\nrelationship with the logical investigations led by the other\ntraditions of classical Indian philosophy. More precisely, Jaina\nauthors routinely reference the Treatise on Logic\n(Nyāyasūtra [NS]), the epistemological treatise of\nthe Naiyāyika tradition, composed by Gautama in the second\ncentury CE, which is the pan Indian inter-doctrinal reference work for\nthe characterization of inference. Next to this, later Jaina authors\nconsistently engaged in discussions with the Buddhists, in particular\nwith Dignāga and Dharmakīrti, in the context of developing\ntheir theories of inference. The deep influence of\nDharmakīrti’s epistemology and theories of argumentation on\nJain philosophers can for example be seen in Vidyānandin’s\nreuse of some of the latter’s arguments in his Investigation\ninto the True Teaching\n(Satyaśāsanaparīkṣā [SŚP])\n(Trikha 2017).\n\nThe more systematic analysis of inference in Jainism begins with the\nŚvetāmbara philosopher Siddhasena Mahāmati and his\nyounger Digambara contemporary Akalaṅka Bhaṭṭa\n(720–780), author of the Royal Commentary [to the Treatise\non What there is] (Rājavārttika [RV])\n(Balcerowicz 2016b; Shah 1967), and develops through a continued line\nof commentaries until authors like Vādi Devasūri (1143 CE)\nin his Commentary on the explanation of the nature of modes of\nknowledge and perspectives\n(Pramāṇanayatattvālokālaṃkāra\n[PNT]) and later authors like Yaśovijaya (1638–1688 CE) and\nhis Manual of Jain Logic\n(Jainatarkabhāṣā [JTBh]) (Ganeri 2008). One\nof the main inter-doctrinal line of discussions and controversies in\nthis conceptual framework is to bring the probative inferential\nargument to its minimal form by reducing the number of necessary\nstatements. In these attempts, Jaina philosophers are traditionally\nconsidered as the ones to go the furthest. More precisely, the\nTreatise on Logic and its Commentary to the Treatise on\nLogic (Nyāyasūtrabhāṣya,\nNSBh) by Vātsyāyana (450–500 CE) had brought an old\nmodel with explicit psychological conditions like doubt and desire to\nknow, to a model linked only with the structure of the argument.\nThere, the only good way to express a truth-preserving argument\nconsists of a group of five statements expressing the thesis, the\nevidence, the account, the application and the conclusion in the\ninference. Jaina authors acknowledge this model and use Naiyāyika\ntraditional examples, like:\n\n\n[Thesis] Sound is impermanent,\n[Evidence] Because it is a product.\n[Account] Whatever is such is alike, like a pot.\n[Application] And this is a product.\n[Conclusion] Therefore it is impermanent.\n\n\n\nBut for Jaina authors, only pedagogical reasons can motivate a\nphilosopher to fully state an argument in this way. To explain, only\nthe first two statements are necessary steps to ensure the adhesion of\nthe interlocutor. In his Guide of logic, Siddhasena makes it\nclear, first, that the evidence is the central cog of the inferential\nreasoning; second, that the statement of the thesis is also\nindispensable, as it indicates the goal of the inference. Its absence\nwould be like observing an archer without knowing what his target is,\nthat is to say without the possibility to know whether he is skillful\nor not.\n\nA second major line of inter-doctrinal discussions and controversies\nin this conceptual framework is to aim towards a theory of the proper\nrelationship between the target-property and the evidence-property. A\nfirst attempt to distinguish between arbitrary and necessary\nrelationships is offered by the Buddhist Dignāga (480–540\nCE), according to which the evidence-property is necessarily\nconcomitant with the target-property if and only if it is possible to\nprove that the evidence-property is present in the case under\nconsideration, in similar cases and in no dissimilar cases. In our\nexample, it means that the property “being a product” has\nto be present in impermanent things like sound and pots, and absent in\npermanent things like the self. Jaina authors show that the three\nconditions of Dignāga are neither necessary, nor sufficient, and\nthat what ultimately counts is that the evidence-property cannot be\nthought of otherwise than in the presence of the target-property. To\nexplain, the only ultimately relevant criteria for the correctness of\nan inference is that its evidence-property is known as being\n“impossible otherwise” (anyathānupapatti)\nthan in the presence of the target-property. One specificity of the\nJaina tradition is to consider that this necessary concomitance\nbetween the inferential properties is known thanks to another type of\ncognition, “tarka” (here, not used in its\ntraditional technical sense of “suppositional reasoning”),\nwhich functions as a direct discernment of universals. More precisely,\nit is clear that necessary concomitance cannot be known by customary\nperception, since perception deals only with particulars, and that\neven the biggest list of particular instances would not suffice to\nreach certainty. Yet, we can realize that if something with certain\nproperties exists, something else with certain properties must also\nexist. It is not the same type of realization as the inferential one,\nsince it is linked with the Jaina epistemological theory of\nparticular-in-universal, according to which an object is a complex\nhaving both an existent universal aspect and an existent particular\naspect (see next section on many-sidedness). Therefore, in the same\nsituation in which one grasps a particular Sissoo, one can also grasp\nthe common properties shared by all Sissoos.\n3.4 Realism and many-sidedness\n3.4.1 On making distinctions\n\nThis complexity of the object of knowledge in Jaina philosophy has a\ndeeply ramified history. At the time of Mahāvīra around the\nfifth–sixth centuries BCE, a practice was observed in the\nnumerous movements of wandering mendicants: instead of answering\nphilosophical questions in a one-sided way, the teacher was analyzing\n(vibhajya) them, showing their different presuppositions and\npossible meanings. Probably inherited from exegetical practices of\ninterpretation of sacred texts, which dominantly consisted in\nanalyzing the many perspectives that one could have on a single\nsentence. In Jainism, one of the most famous examples of this practice\nis to be found in the Venerable Exposition of teaching\n(Bhagavatīsūtra, or\nVyākhyāprajñaptisūtra [Viy.]; old parts\n5th–2th centuries BCE, new 2nd\ncentury BCE to 1st century CE), in which the disciple\nIndrabhūti Gautama asks to the monk Jamāli:\n\n\n\nIs the “loka” (here meaning both\n“world” and “self”) eternal or is it,\nJamāli, non-eternal?\n\n\nBeing asked in this manner, Jamāli was doubtful and wanted to\nknow, but was overwhelmed with confusion. He was unable to speak in\nreply and remained silent. When Jamāli was confused,\nBhagavān Mahāvīra addressed him as follows:\n\n\nThe world is, Jamāli, eternal […] it was, it is and it\nwill be […].\n\nThe world is, Jamāli, non-eternal. For it becomes progressive\nafter being regressive. And it becomes regressive after being\nprogressive.\n\nThe soul is, Jamāli, eternal. For it did not cease to exist at\nany time.\n\nThe soul is, Jamāli, non-eternal. For it becomes animal after\nbeing a hellish creature, becomes a man after becoming an animal and\nit becomes a god after being a man.\n\n\n\nSo in this example, the Jaina teacher insists on the fact that:\n\nwith respect to its substance, the self is eternal, like atoms\nare.\nbut with respect to its modes, the self is non-eternal, like\ncombinations of atoms.\n\n\nHere, Mahāvīra does not make contradictory predications, but\nhe refutes extremes views, which are considered as wrong, by making\nexplicit the parameters of the different predications. It is\ninteresting to notice that at the same period, the Buddha, who also\nuses distinctions of the sort in his speech, is known to refuse to\nanswer questions of the sort (Matilal 1981).\n3.4.2 From the paradoxes of causation to accounting for change and persistence\n\nNow, this way of making distinctions in predication should be thought\nof in close connection with considerations about causation. Indeed,\nthe Jaina teacher also insists on the fact that one can give a proper\naccount of a causal process only when one acknowledges both\npersistence and change.\n\nTo explain, it is not so obvious that we are legitimate in considering\nourselves as being the same individual in time, since after all, the\ncells in our body are continuously replaced, none of the cells that\ncurrently constitute me will exist in seven years, each will have been\nrenewed. Conversely, how are we to account for change? Any mechanical\nexplanation of it fails, like Zeno’s arrow that has to travel\nhalf the way before it meets its target, but before it meets the half,\nit has to travel half the half, and before that, half of the half of\nthe half, and so, ad infinitum, without being able to even\nstart the movement. There is a problem with our way of accounting for\nchange. Noticing this state of affair, South Asian philosophers\nengaged in raging debates around the paradoxes of causality at the\nturn of the CE. In a nutshell, if someone says “the potter makes\nthe pot”, there are several types of possible stance on\nthis:\n\none can say that the effect “pot” already exists prior\nto the fruition of its immediate cause;\none can say that it does not, hence the relevance of the causation\nprocess;\nsome that it is neither existent, nor non-existent before the\ncausation process;\nand one can also say that it both exists and does not exist prior\nto that.\n\n\nWhile philosophers from different lineages have been variously\ndepicted as holding one or the other of these alternatives, Jainas are\nconsistently depicted as holding the last one and it is regularly\nconsidered as a Jaina specificity to hold that something both exists\nand does not exist prior to the causation process. But of course,\nJains are far from being the only ones to claim so. Besides, they\nclaim more precisely that what exists is at once originating, decaying\nand persisting in an essential and simultaneous way:\n\n\nTS 5.29. Existence is endowed with production, decay and\nduration.\n\n\n\nIndeed, any existing entity is both made of permanent atoms, sometimes\nincluding a permanent self; and partaking to the manifold and changing\nworld we experience (Soni 1991). Here, while it is produced:\n\nthe pot is already existent with respect to its substance\n(dravya), the clay;\nyet formerly non-existent with respect to its particular modes\n(paryāya; guṇa): shape, function,\netc.\n\n\nJaina philosophers insist on the fact that none of these aspects is\nmore important than the other one. This means that substance and mode\nco-exist not in, but as a single discrete entity in\nJainism. This single discrete entity is called a many-sided object of\nknowledge (prameya, vastu). This is the famous\ndoctrine of the many-sidedness of things\n(anekāntavāda). It notably goes against the\nVaiśeṣika conception, according to which qualities, like\n“being ochre”, exist independently of substances like\n“pots”, and are linked with them thanks to a relation of\ninherence. It also goes against the Buddhist conception, according to\nwhich only what is a non-complex unity is real (Gorisse 2022b). By the\nway, Jainas are realist philosophers who consider that human beings\nknow a world that exists in its particularity independently of their\nknowledge of it, in such a way that the fact that our assertions can\nbe specified following many perspectives can only come from the fact\nthat the known object itself has many aspects.\n3.4.3 Existence, non-existence, and the modes of predication\n\nNow, this conception led Jaina thinkers to claim that what surrounds\nus is at the same time existent and non-existent. Because, this\ncomplex object is existent as permanent with respect to its substance,\nyet non-existent as permanent with respect to its states. The Jaina\nauthor who spends the most time on elucidating in which sense\nexistence and non-existence can be predicated to an object is probably\nHaribhadrasūri in his Victory banner of the theory of\nnon-one-sidedness (Anekāntajayapatākā\n[AJP]) (Mundra 2022; Van Den Bossche 1995). Now, Jainas are known to\ngo further and to introduce not two, but seven modes of predication.\nHaribhadra is deeply influenced by the Investigation on\nAuthority (Āptamīmāṃsā\n[Āmī]) of Samantabhadra, which is amongst the first to teach\nthat:\n\n\nĀmī 14. An entity is somehow possessed of the character\n“being”, somehow possessed of the character\n“non-being”, somehow possessed of both, and somehow\nindescribable—all these four features characterizing it in\naccordance with the speaker’s intention and not in an absolute\nfashion.\nĀmī 15. Certainly, who will not allow that an entity is\npossessed of the character “being” so far as its own form\netc. are concerned; while it is possessed of the character\n“non-being” so far as opposite is the case? For if that be\nnot so, this entity will not be viewed as having a fixed nature of its\nown.\n\n\n\nThis means that existence is a property of something, inasmuch as this\nthing exists in relation to the substance, locus, time and state that\nare its own. In this dynamic, existence is identity with oneself.\nWhile non-existence is difference, and accounts for change. We need to\nrecognize the non-existence of the thing in relation with forms, etc.\nwhich are alien to it. As such, the not-being blue is part of the\nessence of the red pot. Only thanks to this can the thing have that\nparticular essence, because something is what it is as opposed\nto what it is not. This is close to the\nMīmāṃsā doctrine of identity in difference\n(bhedābheda) (Uno 1997). Now, when we act in our every\nday life, our decisions involve objects more complex than that, i.e.,\nobjects which are existent with respect to some parameters and\nnon-existent with respect to other parameters. Besides, also\ninexpressibility is somehow a property of the thing, in the sense that\nsometimes, existence and non-existence are considered simultaneously,\nand that this is impossible to express. In my everyday life, I act\nbeing surrounded by things which are all this, this is why existence,\nnon-existence and inexpressible combine into not two, but seven modes\nof predication, namely, I can say that something exist; does not\nexist; exist and does not exists; is inexpressible; exist and is\ninexpressible; does not exist and is inexpressible; or exist, does not\nexist and is inexpressible.\n3.4.4 The doctrine of perspectives\n\nTrying to make sense of the fact that a substance is at the same time\npersistent and subject to modification within a single coherent\nmetaphysical system is the old problem of the articulation of the one\nand the many. The solution that Jaina philosophers brought to this\nissue with all these doctrines linked with many-sidedness, is probably\ntheir major contribution to philosophy (Radhakrishnan 1923;\nPadmarajiah 1963; Shah 2000; Barbato 2018). The last doctrine which\nwill retain our attention here is the doctrine of perspectives\n(nayavāda). From Siddhasena Mahāmati,\nAkalaṅka, and their respective lineage of commentaries, see\nespecially Siddharṣigaṇi’s Commentary to the\nGuide of Logic (Nyāyâvatāravivṛtti\n[NAv], 900 CE) and Prabhācandra’s Sun [that opens] the\nlotus of the knowable\n(Prameyakāmalamārtaṇḍa [PKM],\n980–1065 CE), the doctrine of perspective is a technical\napparatus that deals with our ways to know something, like a\nmeta-epistemology. It provides an exhaustive classification of the\nmain epistemic perspectives through which one can consider the\nessentially complex knowable from the most inclusive to the most\nparticular perspective. Indeed, human epistemic faculties are such\nthat they subsume diversity under unity, otherwise nothing would be\nintelligible nor communicable, and that from this, the fundamental\ncomplexity of the object of knowledge is resolved. Now, there are\ndifferent ways to subsume diversity under unity or, to say it\ndifferently, different types of epistemic attention and different\ncontexts of assertion. And the doctrine of perspective enables to\nspecify the main favored types of attention that are active during the\nperformance of a knowledge statement.\n\nBuilding on this, Jaina philosophers came to explain the resisting\ndivergences between the different philosophical systems as resulting\nfrom an initial choice of an epistemic perspective. In this dynamic,\nthey classify the historical philosophical systems with which they\ninteract as developed not within a perspective, but within the\nerroneous radicalization of a perspective, because each tradition\ndepicted focuses on a given aspect of the knowable, since each also\nrefutes other unaddressed aspects. This will get clearer if we\nintroduce each perspective:\n\nThe first type of perspective, called the\n“comprehensive” (naigama), is close to the Jaina\nposition. It is the attitude of the knowing subjects who focus on both\nunity and difference, but not at the same time. The\nNyāya-Vaiśeṣika thinkers are representatives of its\nerroneous developments, because they consider that what exists, the\nreality robust to philosophical investigations, is either a substance\nor a property. They excel in identifying the fundamental differences\nbetween the types of objects of knowledge, but they fail to understand\nthat it is the very same object that is grasped under it substantial\nor its modal aspect.\nThe second type of perspective, called the\n“synthesizing” (saṃgraha) is the attitude\nof the knowing subjects who focus on unity, either unity of all things\nthat exist, or unity of all things which are a given type of\nsubstance. For Jaina philosophers, Advaita-vedānta and\nSāṃkhya thinkers are representatives of its erroneous\ndevelopments, as they consider that the only robust reality is a\nsingle permanent reality that includes everything. Hence, they excel\nin identifying the imperceptible connections and the homogeneity\nunderlying the diversity of objects of knowledge, but they fail to\nalso understand the fundamental differences between them.\nIn contrast to this epistemic attitude, the third type of\nperspective, called the “empirical”, on worldly\ntransactions (vyavahāra), is that of the knowing\nsubjects who focus on difference. Cārvāka thinkers are\nrepresentatives of its erroneous developments, because they consider\nthat the robust reality is the one that human beings encounter every\nday and that is useful to them. As such, they excel at identifying\nmodes and epistemic constructs active in the formulation of theses\nthat rely on more than just sense faculties, but they fail to see that\nalso metaphysical theses are relevant and that what we call\n“substance”, like selves, exists and are not entirely\nsimilar with the modes that we encounter in every day life.\nBesides, the fourth type of perspective, the “actual”,\non what is directly present to the senses\n(ṛjusūtra) is the stance of the knowing subjects\nwho focus on what is present in front of us at the moment, that is to\nsay on difference that is currently manifested. Buddhist thinkers are\nrepresentatives of its erroneous developments, because they consider\nthat only what is grasped in experience exists, nothing beyond, and\nthat the only robust reality is an extremely transient and particular\nreality. They therefore excel in identifying the epistemic\nconstructions active when operations of synthesis are performed on\nobjects of knowledge, but they fail to understand also the elements of\nfundamental permanence that exist in them.\nThe three last perspectives are those of the knowing subjects who\nfocus on the word. Grammarians are representatives of their erroneous\ndevelopments, because they consider that the robust reality is the\nlinguistic element that expresses the world. They excel at identifying\nthe semantic distinctions relevant to denote a given referent. But\nwhile they do so, they fail to also understand that only a plurality\nof frames of reference could enable to cover the integrality of\nreferential situations that one might experience. The fifth type of\nperspective, the “semantic” (śabda), deals\nmore precisely with grammatical rules. It is the perspective of the\nknowing subjects who focus on the word as expressing difference based\non grammatical categories.\nWhile the sixth, “etymological”\n(samabhirūḍha) is concerned with difference based\non etymology.\nAnd the seventh, the “actual etymological”\n(evaṃbhūta), with difference based on etymology\nthat is currently manifested.\n\n\nIn his Establishment of all objects\n(Sarvārthasiddhi [SAS]), Pūjyapāda\n(540–600 CE) explains that like a piece of cloth fulfils a\npurpose only if its different threads are woven; in the same way, the\ndifferent perspectives fulfil a purpose only if they work together,\nand that isolated, they do not convey even a little faith. The\ndoctrine of perspectives seems to be the Jaina reaction to\nphilosophical and religious pluralism in classical India. To explain,\nthere exist resisting divergences concerning the nature of the\nultimate constituent of the world, the ways in which they interact,\ntheir origin; the position of human beings in all this and the\nconception of the way in which we should act. No strictly regulated\nphilosophical debate has been able to overcome these differences.\nJaina thinkers are likewise not trying to flatten these irreducible\nviews within a single conception. Rather, they show how each could\ncontribute to the whole picture.\nConclusion\n\nTo conclude, philosophy within Jainism is mainly the means to come to\nknow the categories that are the selves and karmic matter, which are\nespecially relevant for our liberation. Many tools help us within this\neffort:\n\nthe Scriptures—the teaching of beings experiencing absolute\nknowledge—which, in turn, can be fully understood only by beings\nwith a similar mind. Here, the more advanced on the path, the more\nsenior the member of the monastic community, the better her\nunderstanding. This explains the huge number of hermeneutics\ntechniques come from this faith in the Scriptures, which are\nconsidered by some Jains as scientific treatises.\nour faculties of knowledge like perception, inference and the art\nof debate, up to a range of super-natural faculties of knowledge. Here\ntoo, a knowledge claim is to be analyzed through different types of\nperspectives.\nan openness to this higher order of being within ourselves,\nnotably through meditation.\n\n",
    "bibliography": {
        "categories": [
            "General introductions"
        ],
        "cat_ref_text": {
            "General introductions": [
                "</h3>\n<ul class=\"hanging\">",
                "Dundas, Paul, 2002, <em>The Jainas</em>, London and New-York:\nRoutledge.",
                "Radhakrishnan, Sarvepalli, 1923, “The Pluralistic Realism of\nthe Jainas”, in his <em>Indian Philosophy</em>, London: Georges\nAllen &amp; Unwin Ltd, volume 1, pp. 286–340 (ch. 6). New\nedition, Delhi: Oxford University Press, 2008.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"GeneIntr\">General introductions</h3>\n<ul class=\"hanging\">\n<li>Dundas, Paul, 2002, <em>The Jainas</em>, London and New-York:\nRoutledge.</li>\n<li>Radhakrishnan, Sarvepalli, 1923, “The Pluralistic Realism of\nthe Jainas”, in his <em>Indian Philosophy</em>, London: Georges\nAllen &amp; Unwin Ltd, volume 1, pp. 286–340 (ch. 6). New\nedition, Delhi: Oxford University Press, 2008.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "ethics: in Indian and Tibetan Buddhism",
            "Indian Philosophy (Classical): language and testimony",
            "Indian Philosophy (Classical): literal-nonliteral distinction",
            "Indian Philosophy (Classical): naturalism",
            "Indian Philosophy (Classical): personhood"
        ],
        "entry_link": [
            {
                "../ethics-indian-buddhism/": "ethics: in Indian and Tibetan Buddhism"
            },
            {
                "../language-india/": "Indian Philosophy (Classical): language and testimony"
            },
            {
                "../literal-nonliteral-india/": "Indian Philosophy (Classical): literal-nonliteral distinction "
            },
            {
                "../naturalism-india/": "Indian Philosophy (Classical): naturalism"
            },
            {
                "../personhood-india/": "Indian Philosophy (Classical): personhood"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=jaina-philosophy\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/jaina-philosophy/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=jaina-philosophy&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/jaina-philosophy/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=jaina-philosophy": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/jaina-philosophy/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=jaina-philosophy&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/jaina-philosophy/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://Jainpedia.org/\" target=\"other\">Jainpedia</a>",
            "<a href=\"https://Jainelibrary.org/\" target=\"other\">Jain e-library</a>"
        ],
        "listed_links": [
            {
                "https://Jainpedia.org/": "Jainpedia"
            },
            {
                "https://Jainelibrary.org/": "Jain e-library"
            }
        ]
    }
}