{
    "url": "james",
    "title": "William James",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Russell Goodman\n<rgoodman@unm.edu>",
        "author_links": [
            {
                "http://www.unm.edu/~rgoodman/": "Russell Goodman"
            },
            {
                "mailto:rgoodman%40unm%2eedu": "rgoodman@unm.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.unm.edu/~rgoodman/\" target=\"other\">Russell Goodman</a>\n&lt;<a href=\"mailto:rgoodman%40unm%2eedu\"><em>rgoodman<abbr title=\" at \">@</abbr>unm<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Sep 7, 2000",
        "substantive revision Wed Nov 3, 2021"
    ],
    "preamble": "\n\nWilliam James was an original thinker in and between the disciplines\nof physiology, psychology and philosophy. His twelve-hundred page\nmasterwork, The Principles of Psychology (1890), is a rich\nblend of physiology, psychology, philosophy, and personal reflection\nthat has given us such ideas as “the stream of thought”\nand the baby’s impression of the world “as one great\nblooming, buzzing confusion” (PP 462). It contains seeds of\npragmatism and phenomenology, and influenced generations of thinkers\nin Europe and America, including Edmund Husserl, Bertrand Russell,\nJohn Dewey, and Ludwig Wittgenstein. James studied at Harvard’s\nLawrence Scientific School and the School of Medicine, but his\nwritings were from the outset as much philosophical as scientific.\n“Some Remarks on Spencer’s Notion of Mind as\nCorrespondence” (1878) and “The Sentiment of\nRationality” (1879, 1882) presage his future pragmatism and\npluralism, and contain the first statements of his view that\nphilosophical theories are reflections of a philosopher’s\ntemperament.\n\nJames hints at his religious concerns in his earliest essays and in\nThe Principles, but they become more explicit in The Will\nto Believe and Other Essays in Popular Philosophy (1897),\nHuman Immortality: Two Supposed Objections to the Doctrine\n(1898), The Varieties of Religious Experience (1902) and\nA Pluralistic Universe (1909). James oscillated between\nthinking that a “study in human nature” such as\nVarieties could contribute to a “Science of\nReligion” and the belief that religious experience involves an\naltogether supernatural domain, somehow inaccessible to science but\naccessible to the individual human subject. \n\nJames made some of his most important philosophical contributions in\nthe last decade of his life. In a burst of writing in 1904–5\n(collected in  Essays in Radical Empiricism (1912)) he set\nout the metaphysical view most commonly known as “neutral\nmonism,” according to which there is one fundamental\n“stuff” that is neither material nor mental.  In\n“A Pluralistic Universe” he defends the mystical and\nanti-pragmatic view that concepts distort rather than reveal reality,\nand in his influential Pragmatism (1907), he presents\nsystematically a set of views about truth, knowledge, reality,\nreligion, and philosophy that permeate his writings from the late\n1870s onwards.\n",
    "toc": [
        {
            "#ChroJameLife": "1. Chronology of James’s Life"
        },
        {
            "#EarlWrit": "2. Early Writings"
        },
        {
            "#RemaSpenDefiMindCorr1878": "“Remarks on Spencer’s Definition of Mind as Correspondence” (1878)"
        },
        {
            "#SentRati18791882": "“The Sentiment of Rationality” (1879, 1882)"
        },
        {
            "#PrinPsyc": "3. The Principles of Psychology"
        },
        {
            "#EssaPopuPhil": "4. Essays in Popular Philosophy"
        },
        {
            "#VariReliExpe": "5. The Varieties of Religious Experience"
        },
        {
            "#LateWrit": "6. Late Writings"
        },
        {
            "#Prag1907": "Pragmatism (1907) "
        },
        {
            "#PlurUniv1909": "A Pluralistic Universe (1909)"
        },
        {
            "#EssaRadiEmpi1912": "Essays in Radical Empiricism (1912)"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimLiteWorkWillJame": "Primary Literature: Works by William James"
        },
        {
            "#SecoLite": "Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Chronology of James’s Life\n\n1842. Born in New York City, first child of Henry James and Mary\nWalsh. James. Educated by tutors and at private schools in New\nYork.\n1843. Brother Henry born.\n1848. Sister Alice born.\n1855–8. Family moves to Europe. William attends school in\nGeneva, Paris, and Boulogne-sur-Mer; develops interests in painting\nand science.\n1858. Family settles in Newport, Rhode Island, where James studies\npainting with William Hunt.\n1859–60. Family settles in Geneva, where William studies\nscience at Geneva Academy; then returns to Newport when William\ndecides he wishes to resume his study of painting.\n1861. William abandons painting and enters Lawrence Scientific\nSchool at Harvard.\n1864. Enters Harvard School of Medicine.\n1865. Joins Amazon expedition of his teacher Louis Agassiz,\ncontracts a mild form of smallpox, recovers and travels up the Amazon,\ncollecting specimens for Agassiz’s zoological museum at\nHarvard.\n1866. Returns to medical school. Suffers eye strain, back\nproblems, and suicidal depression in the fall.\n1867–8. Travels to Europe for health and education: Dresden,\nBad Teplitz, Berlin, Geneva, Paris. Studies physiology at Berlin\nUniversity, reads philosophy, psychology and physiology (Wundt, Kant,\nLessing, Goethe, Schiller, Renan, Renouvier).\n1869. Receives M. D. degree, but never practices. Severe\ndepression in the fall.\n1870–1. Depression and poor health continue.\n1872. Accepts offer from President Eliot of Harvard to teach\nundergraduate course in comparative physiology.\n1873. Accepts an appointment to teach full year of anatomy and\nphysiology, but postpones teaching for a year to travel in\nEurope.\n1874–5. Begins teaching psychology; establishes first\nAmerican psychology laboratory.\n1878. Marries Alice Howe Gibbens. Publishes “Remarks on\nSpencer’s Definition of Mind as Correspondence” in\nJournal of Speculative Philosophy.\n1879. Publishes “The Sentiment of Rationality” in \nMind.\n1880. Appointed Assistant Professor of Philosophy at\nHarvard.  Continues to teach psychology.\n1882. Travels to Europe. Meets with Ewald Hering, Carl Stumpf,\nErnst Mach, Wilhelm Wundt, Joseph Delboeuf, Jean Charcot, George Croom\nRobertson, Shadworth Hodgson, Leslie Stephen.\n1884. Lectures on “The Dilemma of Determinism” and\npublishes “On Some Omissions of Introspective Psychology”\nin Mind.\n1885–92. Teaches psychology and philosophy at Harvard: \nlogic, ethics, English empirical philosophy, psychological\nresearch.\n1890. Publishes The Principles of Psychology with Henry\nHolt of Boston, twelve years after agreeing to write it.\n1892. Publishes Psychology: Briefer Course with Henry\nHolt.\n1897. Publishes The Will to Believe and Other Essays in\nPopular Philosophy, with Longmans, Green & Co. Lectures on\n“Human Immortality” (published in 1898).\n1898. Identifies himself as a pragmatist in “Philosophical\nConceptions and Practical Results,” given at the University of\nCalifornia, Berkeley. Develops heart problems.\n1899. Publishes Talks to Teachers on Psychology: and to\nStudents on Some of Life’s Ideals (including “On a\nCertain Blindness in Human Beings” and “What Makes Life\nWorth Living?”) with Henry Holt.  Becomes active member of\nthe Anti-Imperialist League, opposing U. S. policy in\nPhilippines.\n1901–2. Delivers Gifford lectures on “The Varieties of\nReligious Experience” in Edinburgh (published in 1902).\n1904–5 Publishes “Does ‘Consciousness’\nExist?,” “A World of Pure Experience,” “How\nTwo Minds Can Know the Same Thing,” “Is Radical Empiricism\nSolipsistic?” and “The Place of Affectional Facts in a\nWorld of Pure Experience” in Journal of Philosophy,\nPsychology and Scientific Methods. All were reprinted in\nEssays in Radical Empiricism (1912).\n1907. Resigns Harvard professorship. Publishes  Pragmatism: A\nNew Name for Some Old Ways of Thinking with Longmans, Green &\nCo., based on lectures given in Boston and at Columbia.\n1909. Publishes A Pluralistic Universe with Longmans,\nGreen & Co., based on Hibbert Lectures delivered in England and at\nHarvard the previous year.\n1910. Publishes “A Pluralistic Mystic” in Hibbert\nJournal. Abandons attempt to complete a “system” of\nphilosophy. (His partially completed manuscript published posthumously\nas Some Problems of Philosophy). Dies of heart failure at\nsummer home in Chocorua, New Hampshire.\n\n2. Early Writings\n“Remarks on Spencer’s Definition of Mind as Correspondence” (1878)\n\nAlthough he was officially a professor of psychology when he published\nit, James’s discussion of Herbert Spencer broaches\ncharacteristic themes of his philosophy: the importance of religion\nand the passions, the variety of human responses to life, and the idea\nthat we help to “create” the truths that we\n“register” (E 21). Taking up Spencer’s view that the\nadjustment of the organism to the environment is the basic feature of\nmental evolution, James charges that Spencer projects his own vision\nof what ought to be onto the phenomena he claims to describe.\nSurvival, James asserts, is merely one of many interests human beings\nhave: “The social affections, all the various forms of play, the\nthrilling intimations of art, the delights of philosophic\ncontemplation, the rest of religious emotion, the joy of moral\nself-approbation, the charm of fancy and of wit—some or all of\nthese are absolutely required to make the notion of mere existence\ntolerable;…” (E 13). We are all teleological creatures at\nbase, James holds, each with a set of a priori values and\ncategories. Spencer “merely takes sides with the telos\nhe happens to prefer” (E 18).\n\nJames’s characteristic empiricism appears in his claim that\nvalues and categories fight it out in the course of human experience,\nand that their conflicts “can only be solved ambulando,\nand not by any a priori definition.” The “formula\nwhich proves to have the most massive destiny,” he concludes,\n“will be the true one” (E 17). Yet James wishes to defend\nhis sense that any such formulation will be determined as much by a\nfreely-acting human mind as by the world, a position he later (in\nPragmatism) calls “humanism”: “there\nbelongs to mind, from its birth upward, a spontaneity, a vote. It is\nin the game, and not a mere looker-on; and its judgments of the\nshould-be, its ideals, cannot be peeled off from the body of the\ncogitandum as if they were excrescences…” (E 21).\n“The Sentiment of Rationality” (1879, 1882)\n\nThe substance of this essay was first published in Mind in\n1879 and in the Princeton Review in 1882, and then\nrepublished in The Will to Believe and Other Essays in Popular\nPhilosophy in 1897. Although he never quite says that rationality\nis a sentiment, James holds that a sentiment—really a set of\nsentiments—is a “mark” of rationality. The\nphilosopher, James writes, will recognize the rationality of a\nconception “as he recognizes everything else, by certain\nsubjective marks with which it affects him. When he gets the marks, he\nmay know that he has got the rationality.” These marks include a\n“strong feeling of ease, peace, rest” (WB 57), and a\n“feeling of the sufficiency of the present moment, of its\nabsoluteness” (WB 58). There is also a “passion for\nparsimony” (WB 58) that is felt in grasping theoretical\nunifications, as well as a passion for distinguishing, a\n“loyalty to clearness and integrity of perception, dislike of\nblurred outlines, of vague identifications” (WB 59). The ideal\nphilosopher, James holds, blends these two passions of rationality,\nand even some great philosophers go too far in one direction or\nanother: Spinoza’s unity of all things in one substance is\n“barren,” as is Hume’s “‘looseness and\nseparateness’ of everything…” (WB 60).\n\nSentiments of rationality operate not just in logic or science, but in\nordinary life. When we first move into a room, for example, “we\ndo not know what draughts may blow in upon our back, what doors may\nopen, what forms may enter, what interesting objects may be found in\ncupboards and corners.” These minor uncertainties act as\n“mental irritant[s],” which disappear when we come to know\nour way around the room, to “feel at home” there (WB\n67–8).\n\nJames begins the second part of his essay by considering the case when\n“two conceptions [are] equally fit to satisfy the logical\ndemand” for fluency or unification. At this point, he holds, one\nmust consider a “practical” component of rationality. The\nconception that “awakens the active impulses, or satisfies other\naesthetic demands better than the other, will be accounted the more\nrational conception, and will deservedly prevail” (WB 66). James\nputs the point both as one of psychology—a prediction of what\nwill occur—and as one of judgment, for he holds that it will\nprevail “deservedly.” \n\nAs in his essay on Spencer, James explores the relations between\ntemperaments and philosophical theorizing. Idealism, he holds,\n“will be chosen by a man of one emotional constitution,\nmaterialism by another.” Idealism offers a sense of intimacy\nwith the universe, the feeling that ultimately I “am all.”\nBut materialists find in idealism “a narrow, close, sick-room\nair,” and prefer to conceive of an uncertain, dangerous and wild\nuniverse that has “no respect for our ego.” Let “the\ntides flow,” the materialist thinks, “even though they\nflow over us” (WB 76). James is sympathetic both to the idea\nthat the universe is something we can be intimate with and to the idea\nthat it is wild and unpredictable. If he criticizes idealism for its\n“sick-room air,” he criticizes reductive forms of\nmaterialism for denying to “our most intimate powers…all\nrelevancy in universal affairs” (WB 71). The intimacy and the\nwildness portrayed in these contrasting philosophies answer to\npropensities, passions, and powers in human beings, and the\n“strife” of these two forms of “mental\ntemper,” James predicts, will always be seen in philosophy (WB\n76). Certainly it is always seen in the philosophy of William James.\n\n3. The Principles of Psychology\n\nIn 1878, James agreed to write a psychology textbook for the American\npublisher Henry Holt, but it took him twelve years to produce the\nmanuscript, and when he did he described it to Holt as “a\nloathsome, distended, tumefied, bloated, dropsical mass, testifying to\nnothing but two facts: 1st, that there is no such thing as a\nscience of psychology, and 2nd, that W. J. is an\nincapable” (The Letters of William James, ed. Henry\nJames. (Boston: Little, Brown, 1926, pp. 393–4). Nevertheless,\nthis thousand page volume of psychology, physiology and philosophy has\nproved to be James’s masterwork, containing early statements of\nhis main philosophical ideas in extraordinarily rich chapters on\n“The Stream of Thought,” “The Consciousness of\nSelf,” “Emotion,” “Will,” and many other\ntopics.\n\nJames tells us that he will follow the psychological method of\nintrospection in The Principles, which he defines as\n“the looking into our own minds and reporting what we there\ndiscover” (PP 185). In fact he takes a number of methodological\napproaches in the book. Early on, he includes chapters on “The\nFunctions of the Brain” and “On Some General Conditions of\nBrain Activity” that reflect his years as a lecturer in anatomy\nand physiology at Harvard, and he argues for the reductive and\nmaterialist thesis that habit is “at bottom a physical\nprinciple” (PP 110). As the book moves along, he involves\nhimself in discussions with philosophers—for example with Hume\nand Kant in his hundred-page chapter on the self, and he finds himself\nmaking metaphysical claims that anticipate his later pragmatism, as\nwhen he writes: “There is no property ABSOLUTELY essential\nto any one thing. The same property which figures as the essence\nof a thing on one occasion becomes a very inessential feature on the\nother” (PP 959).\n\nEven “introspection” covers a range of reports. James\ndiscusses the experiments that his contemporaries Wundt, Stumpf and\nFechner were performing in their laboratories, which led them to\nresults such as that “sounds are less delicately discriminated\nin intensity than lights” (PP 513).  But many of\nJames’s most important and memorable introspective observations\ncome from his own life. For example:\n\nThe rhythm of a lost word may be there without a sound to clothe\nit…. Everyone must know the tantalizing effect of the blank\nrhythm of some forgotten verse, restlessly dancing in one’s\nmind, striving to be filled out with words (PP 244).\n\n\nOur father and mother, our wife and babes, are bone of our bone and\nflesh of our flesh. When they die, a part of our very selves is gone.\nIf they do anything wrong, it is our shame. If they are insulted, our\nanger flashes forth as readily as if we stood in their place. (PP\n280).\n\nThere is an excitement during the crying fit which is not without a\ncertain pungent pleasure of its own; but it would take a genius for\nfelicity to discover any dash of redeeming quality in the feeling of\ndry and shrunken sorrow (PP 1061).\n\n“Will you or won’t you have it so?” is the\nmost probing question we are ever asked; we are asked it every hour of\nthe day, and about the largest as well as the smallest, the most\ntheoretical as well as the most practical, things. We answer by\nconsents or non-consents and not by words. What wonder that\nthese dumb responses should seem our deepest organs of communication\nwith the nature of things! (PP, p. 1182). \n\n\nIn this last quotation, James tackles a philosophical problem from a\npsychological perspective. Although he refrains from answering the\nquestion of whether these “responses” are in fact deep\norgans of communication with the nature of things—reporting only\nthat they seem to us to be so—in his later writings, such as\nVarieties of Religious Experience and A Pluralistic\nUniverse, he confesses, and to some degree defends, his belief\nthat the question should be answered affirmatively. \n\nIn the deservedly famous chapter on “The Stream of\nThought” James takes himself to be offering a richer account of\nexperience than those of traditional empiricists such as Hume. He\nbelieves relations, vague fringes, and tendencies are experienced\ndirectly (a view he would later defend as part of his “radical\nempiricism.”) James finds consciousness to be a stream rather\nthan a succession of “ideas.” Its waters blend, and our\nindividual consciousness—or, as he prefers to call it sometimes,\nour “sciousness”—is “steeped and dyed”\nin the waters of sciousness or thought that surround it. Our psychic\nlife has rhythm: it is a series of transitions and resting-places, of\n“flights and perchings” (PP 236). We rest when we remember\nthe name we have been searching for; and we are off again when we hear\na noise that might be the baby waking from her nap.\n\nInterest—and its close relative, attention—is a major\ncomponent not only of James’s psychology, but of the\nepistemology and metaphysics that seep into his discussion. A thing,\nJames states in “The Stream of Thought,” is a group of\nqualities “which happen practically or aesthetically to interest\nus, to which we therefore give substantive names…”. (PP\n274). And reality “means simply relation to our emotional\nand active life…whatever excites and stimulates our interest is\nreal” (PP 924). Our capacity for attention to one thing\nrather than another is for James the sign of an “active\nelement in all consciousness,…a spiritual\nsomething…which seems to go out to meet these qualities and\ncontents, whilst they seem to come in to be received by it.” (PP\n285). Faced with the tension between scientific determinism and our\nbelief in our own freedom or autonomy, James—speaking not as a\npsychologist but as the philosopher he had become—argues that\nscience “must be constantly reminded that her purposes are not\nthe only purposes, and that the order of uniform causation which she\nhas use for, and is therefore right in postulating, may be enveloped\nin a wider order, on which she has no claims at all” (PP\n1179).\n\nIn his discussions of consciousness James appears at various times to\nbe a reductive materialist, a dualist, a proto-phenomenologist, and a\nneutral psychologist who wouldn’t dare to consider philosophical\nquestions. One of the most original layers of The Principles\nlies in James’s pursuit of a “pure” description of\nthe stream of thought that does not presuppose it to be either mental\nor material, a pursuit that anticipates not only his own later\n“radical empiricism,” but Husserl’s phenomenology.\nIn his chapter on “Sensation,” for example, James is at\npains to deny that sensations are “in the mind” and then\n“by a special act on our part ‘extradited’ or\n‘projected’ so as to appear located in an outer\nworld” (PP 678). He argues that our original experiences are\nobjective, that “only as reflection becomes developed do we\nbecome aware of an inner world at all” (PP 679). However, the\nobjective world originally experienced is not the world of spatial\nrelations that we think: \n\nCertainly a child newly born in Boston, who gets a sensation from the\ncandle-flame which lights the bedroom, or from his diaper-pin [who]\ndoes not feel either of these objects to be situated in longitude 71\nW. and latitude 42 N.….The flame fills its own place, the pain\nfills its own place; but as yet these places are neither identified\nwith, nor discriminated from, any other places. That comes\nlater.  For the places thus first sensibly known are elements of\nthe child’s space-world which remain with him all his life. (PP\n681–2)\n\n\nJames’s chapter on “Habit,” early in the book,\nbegins with habit as a physical matter but ends by considering its\nethical implications. James argues that the laws of nature are\nthemselves habits, “nothing but the immutable habits which the\ndifferent elementary sorts of matter follow in their actions and\nreactions upon each other” (PP 109). In our brains, habits are\npaths of nervous energy, as rivers and streams are the paths of\nwater’s flow. At skin level, even a scar is a kind of habit,\n“more likely to be abraded, inflamed, to suffer pain and cold,\nthan are the neighboring parts” (PP 111). On the psychological\nlevel as well, “any sequence of mental action which has been\nfrequently repeated, tends to perpetuate itself ...” (PP 116).\nHabits are useful in diminishing the attention that we have to devote\nto our actions, thereby allowing us to develop “our higher\npowers of mind” (PP 126). On the social level, habit is\n“the enormous fly-wheel of society, its most precious\nconservative agent. It alone is what keeps us all within the bounds of\nordinance, and saves the children of fortune from the envious\nuprisings of the poor” (PP 125). The “ethical implications\nof the law of habit,” (PP 124) as James sees them, concern which\nhabits we choose to develop, and when. Many habits must begin early in\nlife: “Hardly ever is a language learned after twenty spoken\nwithout a foreign accent” (PP 126). We should strive to make our\n“nervous system our ally instead of our enemy” by forming\nas many good habits as we can, as early in life as we can. Even later\nin life, we are to keep our capacity for resolution in shape by every\nday or two doing “something for no other reason than that you\nwould rather not do it” (PP 130).\n\nTwo noteworthy chapters late in The Principles are “The\nEmotions” and “Will.” The first sets out the\ntheory—also enunciated by the Danish physiologist Carl\nLange—that emotion follows, rather than causes, its bodily\nexpression: “Common-sense says, we lose our fortune, are sorry\nand weep; we meet a bear, are frightened and run; we are insulted by a\nrival, are angry and strike. The hypothesis here to be defended says\nthat this order of sequence is incorrect…that we feel sorry\nbecause we cry, angry because we strike, afraid because we\ntremble…” (PP 1065–6). The significance of this\nview, according to James, is that our emotions are tied in with our\nbodily expressions. What, he asks, would grief be “without its\ntears, its sobs, its suffocation of the heart, its pang in the\nbreast-bone?” Not an emotion, James answers, for a “purely\ndisembodied human emotion is a nonentity” (PP 1068).\n\nIn his chapter on “Will” James opposes the theory of his\ncontemporary Wilhelm Wundt that there is one special feeling—a\n“feeling of innervation”—present in all intentional\naction.  In his survey of a range of cases, James finds that some\nactions involve an act of resolve or of outgoing nervous energy, but\nothers do not. For example:\n\nI sit at table after dinner and find myself from time to time taking\nnuts or raisins out of the dish and eating them. My dinner properly is\nover, and in the heat of the conversation I am hardly aware of what I\ndo; but the perception of the fruit, and the fleeting notion that I\nmay eat it, seem fatally to bring the act about. There is certainly no\nexpress fiat here;… (PP 1131).\n\n\nThe chapter on “Will” also contains striking passages that\nanticipate the concerns of The Varieties of Religious\nExperience:  about moods, “changes of heart,”\nand “awakenings of conscience.”  These, James\nobserves, may affect the “whole scale of values of our motives\nand impulses” (PP 1140). \n4. Essays in Popular Philosophy\n\nJames’s popular and influential, The Will to Believe and\nOther Essays in Popular Philosophy, published in 1897, collects\npreviously published essays from the previous nineteen years,\nincluding “The Sentiment of Rationality” (discussed\nabove), “The Dilemma of Determinism,” “Great Men and\nTheir Environment” and “The Moral Philosopher and the\nMoral Life.” The title essay—published just two years\nearlier—proved to be controversial for seeming to recommend\nirresponsible or irrationally held beliefs. James later wrote that he\nshould have called the essay “the right to\nbelieve,” to indicate his intent to justify holding\ncertain beliefs in certain circumstances, not to claim that\nwe can (or should) believe things simply by an act of will.\n\nIn science, James notes, we can afford to await the outcome of\ninvestigation before coming to a belief, but in other cases we are\n“forced,” in that we must come to some belief even if all\nthe relevant evidence is not in. If I am on an isolated mountain\ntrail, faced with an icy ledge to cross, and do not know whether I can\nmake it, I may be forced to consider the question whether I can or\nshould believe that I can cross the ledge. This question is not only\nforced, it is “momentous”: if I am wrong I may fall to my\ndeath, and if I believe rightly that I can cross the ledge, my holding\nof the belief may itself contribute to my success. In such a case,\nJames asserts, I have the “right to\nbelieve”—precisely because such a belief may help bring\nabout the fact believed in. This is a case “where a fact cannot\ncome at all unless a preliminary faith exists in its coming”\n(WB, 25).\n\nJames applies his analysis to religious belief, particularly to the\npossible case in which one’s salvation depends on believing in\nGod in advance of any proof that God exists. In such a case the belief\nmay be justified by the outcome to which having the belief\nleads.  He extends his analysis beyond the religious domain,\nhowever, to a wide range of secular human life:\n\nA social organism of any sort is what it is because each member\nproceeds to his own duty with a trust that the other members will\nsimultaneously do theirs…. A government, an army, a commercial\nsystem, a ship, a college, an athletic team, all exist on this\ncondition, without which not only is nothing achieved, but nothing is\neven attempted (WB 24).\n\n\nMoral questions too are both momentous and unlikely to be sustained by\n“sensible proof.” They are not matters of science but of\n“what Pascal calls our heart” (WB 22). James defends our\nright to believe in certain answers to these questions anyway.\n\nAnother essay in the collection, “Reflex Action and\nTheism,” attempts a reconciliation of science and religion.\nJames’s expression “reflex action” alludes to the\nbiological picture of the organism as responding to sensations with a\nseries of actions. In the higher animals a theoretical or thinking\nstage intervenes between sensation and action, and this is where, in\nhuman beings, the thought of God arises. James maintains that this\nthought is a natural human response to the universe, independent of\nany proof that God exists, and he predicts that God will be the\n“centre of gravity of all attempts to solve the riddle of\nlife” (WB, 116). He ends the essay by advocating a\n“theism” that posits “an ultimate opacity in things,\na dimension of being which escapes our theoretic control” (WB\n143).\n\nThe Will to Believe also contains James’s most\ndeveloped account of morality, “The Moral Philosopher and the\nMoral Life.”  Morality for James rests on\nsentience—without it there are no moral claims and no moral\nobligations. But once sentience exists, a claim is made, and morality\ngets “a foothold in the universe” (WB 198). Although James\ninsists that there is no common essence to morality, he does find a\nguiding principle for ethical philosophy in the principle that we\n“satisfy at all times as many demands as we can” (WB 205).\nThis satisfaction is to be achieved by working towards a “richer\nuniverse…the good which seems most organizable, most fit to\nenter into complex combinations, most apt to be a member of a more\ninclusive whole” (WB 210). This work proceeds by a series of\nexperiments, by means of which we have learned to live (for the most\npart) without “polygamy and slavery, private warfare and liberty\nto kill, judicial torture and arbitrary royal power.” (WB\n205) . However, James holds that there is “nothing final in\nany actually given equilibrium of human ideals, [so that] as our\npresent laws and customs have fought and conquered other past ones, so\nthey will in their turn be overthrown by any newly discovered order\nwhich will hush up the complaints that they still give rise to,\nwithout producing others louder still” (WB 206).\n\nJames’s essay “On a Certain Blindness in Human\nBeings,” published in his Talks to Teachers on Psychology\nand to Students on Some of Life’s Ideals in 1899,\nillustrates another important element of James’s moral outlook.\nThe blindness to which James draws attention is that of one human\nbeing to another, a blindness he illustrates with a story from his own\nlife. Riding in the mountains of North Carolina he comes upon a\ndevastated landscape, with no trees, scars in the earth, here and\nthere a patch of corn growing in the sunlight. But after talking to\nthe settlers who had cleared the forest to make room for their farm,\nJames comes to see it their way (at least temporarily): not as\ndevastation but as a manifestation of “duty, struggle, and\nsuccess.” James concludes: “I had been as blind to the\npeculiar ideality of their conditions as they certainly would also\nhave been to the ideality of mine, had they had a peep at my strange\nindoor academic ways of life at Cambridge” (TT 233–4).\nJames portrays a plurality of outlooks in the essay to which he\nattaches both a metaphysical/epistemological and an ethical import.\nThis plurality, he writes:\n\ncommands us to tolerate, respect, and indulge those whom we see\nharmlessly interested and happy in their own ways, however\nunintelligible these may be to us. Hands off: neither the whole of\ntruth nor the whole of good is revealed to any single observer,\nalthough each observer gains a partial superiority of insight from the\npeculiar position in which he stands. Even prisons and sick-rooms have\ntheir special revelations (TT 264).\n\n\nAlthough “On a Certain Blindness” is about toleration and\nthe appreciation of different points of view, James sets out his own\nromantic point of view in his choice of heroes in the essay:\nWordsworth and Shelley, Emerson, and W. H. Hudson, all of whom are\nsaid to have a sense of the “limitless significance in natural\nthings” (TT 244). Even in the city, there is “unfathomable\nsignificance and importance” (TT 254) in the daily events of the\nstreets, the river, and the crowds of people. James praises Walt\nWhitman, “a hoary loafer,” for knowing how to profit by\nlife’s common opportunities: after a morning of writing and a\nbath, Whitman rides the omnibus down Broadway from 23rd street to\nBowling Green and back, just for the pleasure and the spectacle of it.\n“[W]ho knows the more of truth,” James asks,\n“Whitman on his omnibus-top, full of the inner joy with which\nthe spectacle inspires him, or you, full of the disdain which the\nfutility of his occupation excites?” (TT 252). James’s\ninterest in the inner lives of others, and in writers like Tolstoy who\nshare his understanding of their “mysterious ebbs and\nflows” (TT 255), leads him to the prolonged study of human\nreligious experience that he presented as the Gifford Lectures in\n1901–2, published as The Varieties of Religious\nExperience in 1902.\n5. The Varieties of Religious Experience\n\nLike The Principles of Psychology, Varieties is\n“A Study in Human Nature,” as its subtitle says. But at\nsome five hundred pages it is only half the length of The\nPrinciples of Psychology, befitting its more restricted, if still\nlarge, scope. For James studies that part of human nature that is, or\nis related to, religious experience. His interest is not in religious\ninstitutions, ritual, or, even for the most part, religious ideas, but\nin “the feelings, acts, and experiences of individual men in\ntheir solitude, so far as they apprehend themselves to stand in\nrelation to whatever they may consider the divine” (V 31).\n\nJames sets out a central distinction of the book in early chapters on\n“The Religion of Healthy-Mindedness” and “The Sick\nSoul.” The healthy-minded religious person—Walt Whitman is\none of James’s main examples—has a deep sense of\n“the goodness of life,” (V 79) and a soul of\n“sky-blue tint” (V 80). Healthy-mindedness can be\ninvoluntary, just natural to someone, but often comes in more willful\nforms. Liberal Christianity, for example, represents the triumph of a\nresolute devotion to healthy-mindedness over a morbid “old\nhell-fire theology” (V 91). James also cites the\n“mind-cure movement” of Mary Baker Eddy, for whom\n“evil is simply a lie, and any one who mentions it is a\nliar” (V 107). For “The Sick Soul,” in contrast,\n“radical evil gets its innings” (V 163). No matter how\nsecure one may feel, the sick soul finds that “[u]nsuspectedly\nfrom the bottom of every fountain of pleasure, as the old poet said,\nsomething bitter rises up: a touch of nausea, a falling dead of the\ndelight, a whiff of melancholy….” These states are not\nsimply unpleasant sensations, for they bring “a feeling of\ncoming from a deeper region and often have an appalling\nconvincingness” (V 136).  James’s main examples are\nLeo Tolstoy’s “My Confession,” John Bunyan’s\nautobiography, and a report of terrifying\n“dread”—allegedly from a French correspondent but\nactually from James himself. Some sick souls never get well, while\nothers recover or even triumph: these are the\n“twice-born.” In chapters on “The Divided Self, and\nthe Process of Its Unification” and on “Conversion,”\nJames discusses St. Augustine, Henry Alline, Bunyan, Tolstoy, and a\nrange of popular evangelists, focusing on what he calls “the\nstate of assurance” (V 247) they achieve. Central to this state\nis “the loss of all the worry, the sense that all is ultimately\nwell with one, the peace, the harmony, the willingness to be,\neven though the outer conditions should remain the same” (V\n248).\n\nVarieties’ classic chapter on “Mysticism”\noffers “four marks which, when an experience has them, may\njustify us in calling it mystical…” (V 380). The first is\nineffability: “it defies expression…its quality must be\ndirectly experienced; it cannot be imparted or transferred to\nothers.” Second is a “noetic quality”: mystical\nstates present themselves as states of knowledge. Thirdly, mystical\nstates are transient; and, fourth, subjects are passive with respect\nto them: they cannot control their coming and going. Are these states,\nJames ends the chapter by asking, “windows through which the\nmind looks out upon a more extensive and inclusive world[?]” (V\n428).\n\nIn chapters entitled “Philosophy”—devoted in large\npart to pragmatism—and “Conclusions,” James finds\nthat religious experience is on the whole useful, even “amongst\nthe most important biological functions of mankind,” but he\nconcedes that this does not make it true. Nevertheless, James\narticulates his own belief—which he does not claim to\nprove—that religious experiences connect us with a greater, or\nfurther, reality not accessible in our normal cognitive relations to\nthe world: “The further limits of our being plunge, it seems to\nme, into an altogether other dimension of existence from the sensible\nand merely ‘understandable’ world” (V 515).\n6. Late Writings\nPragmatism (1907)\n\nJames first announced his commitment to pragmatism in a lecture at\nBerkeley in 1898, entitled “Philosophical Conceptions and\nPractical Results.” Later sources for Pragmatism were\nlectures at Wellesley College in 1905, and at the Lowell Institute and\nColumbia University in 1906 and 1907. Pragmatism emerges in\nJames’s book as six things: a philosophical temperament, a\ntheory of truth, a theory of meaning, a holistic account of knowledge,\na metaphysical view, and a method of resolving philosophical\ndisputes.\n\nThe pragmatic temperament appears in the book’s opening chapter,\nwhere (following a method he first set out in “Remarks on\nSpencer’s Definition of Mind as Correspondence”) James\nclassifies philosophers according to their temperaments: in this case\n“tough-minded” or “tender-minded.” The\npragmatist is the mediator between these extremes, someone, like James\nhimself, with “scientific loyalty to facts,” but also\n“the old confidence in human values and the resultant\nspontaneity, whether of the religious or romantic type” (P 17).\nThe method of resolving disputes and the theory of meaning are on\ndisplay in James’s discussion of an argument about whether a man\nchasing a squirrel around a tree goes around the squirrel too. Taking\nmeaning as the  “conceivable effects of a practical kind\nthe object may involve,” the pragmatist philosopher finds that\ntwo “practical” meanings of “go around” are in\nplay: either the man goes North, East, South, and West of the\nsquirrel, or he faces first the squirrel’s head, then one of his\nsides, then his tail, then his other side. “Make the\ndistinction,” James writes, “and there is no occasion for\nany further dispute.”\n\nThe pragmatic theory of truth is the subject of the book’s sixth\n(and to some degree its second) chapter. Truth, James holds, is\n“a species of the good,” like health. Truths are goods\nbecause we can “ride” on them into the future without\nbeing unpleasantly surprised. They “lead us into useful verbal\nand conceptual quarters as well as directly up to useful sensible\ntermini. They lead to consistency, stability and flowing human\nintercourse.  They lead away from excentricity and isolation,\nfrom foiled and barren thinking” (103). Although James holds\nthat truths are “made” (104) in the course of\nhuman experience, and that for the most part they live “on a\ncredit system” in that they are not currently being verified, he\nalso holds the empiricistic view that “beliefs verified\nconcretely by somebody are the posts of the whole\nsuperstructure” (P 100).\n\nJames’s chapter on “Pragmatism and Humanism” sets\nout his voluntaristic epistemology. “We carve out\neverything,” James states, “just as we carve out\nconstellations, to serve our human purposes” (P 100).\nNevertheless, he recognizes “resisting factors in every\nexperience of truth-making” (P 117), including not only our\npresent sensations or experiences but the whole body of our prior\nbeliefs. James holds neither that we create our truths out of nothing,\nnor that truth is entirely independent of humanity. He embraces\n“the humanistic principle: you can’t weed out the human\ncontribution” (P 122). He also embraces a metaphysics of\nprocess in the claim that “for pragmatism [reality] is still in\nthe making,” whereas for “rationalism reality is\nready-made and complete from all eternity” (P 123).\nPragmatism’s final chapter on “Pragmatism and\nReligion” follows James’s line in Varieties in\nattacking “transcendental absolutism” for its unverifiable\naccount of God, and in defending a “pluralistic and moralistic\nreligion” (144) based on human experience. “On\npragmatistic principles,” James writes, “if the hypothesis\nof God works satisfactorily in the widest sense of the word, it is\ntrue” (143).\nA Pluralistic Universe (1909)\n\nOriginally delivered in Oxford as a set of lectures “On the\nPresent Situation in Philosophy,” James begins his book, as he\nhad begun Pragmatism, with a discussion of the temperamental\ndetermination of philosophical theories, which, James states,\n“are just so many visions, modes of feeling the whole push\n… forced on one by one’s total character and experience,\nand on the whole preferred—there is no other truthful\nword—as one’s best working attitude” (PU 15).\nMaintaining that a philosopher’s “vision” is\n“the important thing” about him (PU 3), James condemns the\n“over-technicality and consequent dreariness of the younger\ndisciples at our American universities…” (PU 13).\n\nJames passes from critical discussions of Josiah Royce’s\nidealism and the “vicious intellectualism” of Hegel to\nphilosophers whose visions he admires: Gustav Fechner and Henri\nBergson. He praises Fechner for holding that “the whole universe\nin its different spans and wave-lengths, exclusions and developments,\nis everywhere alive and conscious” (PU, 70), and he seeks to\nrefine and justify Fechner’s idea that separate human, animal\nand vegetable consciousnesses meet or merge in a “consciousness\nof still wider scope” (PU 72). James employs Henri\nBergson’s critique of “intellectualism” to argue\nthat the “concrete pulses of experience appear pent in by no\nsuch definite limits as our conceptual substitutes are confined by.\nThey run into one another continuously and seem to\ninterpenetrate” (PU 127). James concludes by embracing a\nposition that he had more tentatively set forth in The Varieties\nof Religious Experience: that religious experiences “point\nwith reasonable probability to the continuity of our consciousness\nwith a wider spiritual environment from which the ordinary prudential\nman (who is the only man that scientific psychology, so called, takes\ncognizance of) is shut off” (PU 135). Whereas in\nPragmatism James subsumes the religious within the pragmatic\n(as yet another way of successfully making one’s way through the\nworld), in A Pluralistic Universe he suggests that the\nreligious offers a superior relation to the universe.\nEssays in Radical Empiricism (1912)\n\nThis posthumous collection includes James’s groundbreaking\nessays on “pure experience,” originally published in\n1904–5. James’s fundamental idea is that mind and matter\nare both aspects of, or structures formed from, a more fundamental\nstuff—pure experience—that (despite being called\n“experience”) is neither mental nor physical. Pure\nexperience, James explains, is “the immediate flux of life which\nfurnishes the material to our later reflection with its conceptual\ncategories… a that which is not yet any definite \nwhat, tho’ ready to be all sorts of whats…”\n(ERE 46). That “whats” pure experience may be are minds\nand bodies, people and material objects, but this depends not on a\nfundamental ontological difference among these “pure\nexperiences,” but on the relations into which they\nenter. Certain sequences of pure experiences constitute physical\nobjects, and others constitute persons; but one pure experience (say\nthe perception of a chair) may be part both of the sequence\nconstituting the chair and of the sequence constituting a person.\nIndeed, one pure experience might be part of two distinct minds, as\nJames explains in a chapter entitled “How Two Minds Can Know One\nThing.”\n\nJames’s “radical empiricism” is distinct from his\n“pure experience” metaphysics. It is never precisely\ndefined in the Essays, and is best explicated by a passage\nfrom The Meaning of Truth where James states that radical\nempiricism consists of a postulate, a statement of fact, and a\nconclusion. The postulate is that “the only things that shall be\ndebatable among philosophers shall be things definable in terms drawn\nfrom experience,” the  fact is that relations are just as\ndirectly experienced as the things they relate, and the conclusion is\nthat “the parts of experience hold together from next to next by\nrelations that are themselves parts of experience” (MT,\n6–7).\n\nJames was still working on objections to his “pure\nexperience” doctrine, replying to critics of\nPragmatism, and writing an introduction to philosophical\nproblems when he died in 1910. His legacy extends into psychology and\nthe study of religion, and in philosophy not only throughout the\npragmatist tradition that he founded (along with Charles Peirce), but\ninto phenomenology and analytic philosophy. Edmund Husserl\nincorporated James’s notions of the “fringe” and\n“halo” into his phenomenology (Moran, pp. 276–80),\nBertrand Russell’s The Analysis of Mind is indebted to\nJames’s doctrine of “pure experience,” (Russell,\n1921, pp. 22–6), Ludwig Wittgenstein learned about “the\nabsence of the will act” from James’s Psychology\n(Goodman, Wittgenstein and William James, p. 81), and the\nversions of “neopragmatism” set out by Nelson Goodman,\nRichard Rorty and Hilary Putnam are saturated with James’s\nideas. In physics, James’s humanistic pragmatism, and his\nsuggestion that “new being come[s] in local spots and\npatches” (P 138; Fuchs 2017, p.  33) have inspired the version\nof quantum theory known as QBism (see Healey). James is one of the\nmost attractive and endearing of philosophers: for his vision of a\n“wild,” “open” universe that is nevertheless\nshaped by our human powers and answers to some of our deepest needs,\nbut also, as Russell observed in his obituary, because of the\n“large tolerance and … humanity” with which he sets\nthat vision out. (The Nation (3 September 1910:\n793–4).\n",
    "bibliography": {
        "categories": [
            "Primary Literature: Works by William James",
            "Secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature: Works by William James": [
                "</h3>\n<p>\nThe works that correspond to the abbreviations [PP], [WB], [TT], [V],\n[P], [PU], [MT], and [E] are referenced below -- the abbreviation is\nindicated occurs at the end of relevant reference.</p>\n<ul class=\"hanging\">",
                "<em>The Works of William James</em>, Cambridge, MA and London:\nHarvard University Press, 17 vol., 1975–.",
                "<em>William James: Writings 1878–1899</em>. New York:\nLibrary of America, 1992.",
                "<em>William James: Writings 1902–1910</em>. New York:\nLibrary of America, 1987",
                "“Remarks on Spencer’s Definition of Mind as\nCorrespondence,” first published in <em>The Journal of\nSpeculative Philosophy</em>, 1878. Contained in <em>Essays in\nPhilosophy</em>, pp. 7–22.",
                "<em>The Principles of Psychology</em>, Cambridge, MA: Harvard\nUniversity Press, 1981. Originally published in 1890 [PP].",
                "<em>The Will to Believe and Other Essays in Popular\nPhilosophy</em>, Cambridge, MA and London: Harvard University Press,\n1979; first published in 1897 [WB].",
                "“Philosophical Conceptions and Practical Results,”\n1898. Contained in <em>Pragmatism</em>, in <em>The Works of William\nJames</em>, pp. 255–70.",
                "<em>Talks to Teachers on Psychology and to Students on Some of\nLife’s Ideals</em>. New York: Henry Holt, 1899 [TT].",
                "<em>The Varieties of Religious Experience</em>, New York:\nLongmans, Green, 1916. Originally published in 1902 [V].",
                "<em>Pragmatism</em>. Cambridge, MA: Harvard University Press,\n1979. Originally published in 1907 [P].",
                "<em>A Pluralistic Universe</em>. Cambridge, MA: Harvard University\nPress, 1977. Originally published in 1909 [PU].",
                "<em>The Meaning of Truth</em>, Cambridge, MA and London: Harvard\nUniversity Press, 1979 [MT]. Originally published in 1909.",
                "<em>Essays in Philosophy</em>. Cambridge, MA and London: Harvard\nUniversity Press, 1978 [E].",
                "<em>Some Problems of Philosophy</em>. Cambridge, MA and London:\nHarvard University Press, 1979. Originally published in 1911.",
                "<em>The Letters of William James</em>, ed. Henry James, Boston:\nLittle Brown, 1926.",
                "<em>The Correspondence of William James</em>, ed. Ignas K.\nSkrupskelis and Elizabeth M. Berkeley, 12 volumes. Charlottesville and\nLondon, University Press of Virginia, 1992–.",
                "<em>Selected Letters of William and Henry James</em>,\nCharlottesville and London, University Press of Virginia, 1997.\n</ul>\n<h3 id=\"SecoLite\">"
            ],
            "Secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Baghramian, Maria and Sarin Marchetti (eds.), 2017, <em>Pragmatism\nand the European Traditions: Encounters with Analytic Philosophy and\nPhenomenology Before the Great Divide</em>, New York and London:\nRoutledge.",
                "Barzun, Jacques, 1983, <em>A Stroll with William James</em> New\nYork: Harper and Row.",
                "Benoist, Jocelyn, 2005, “A Phenomenology or\nPragmatism?” in <em>Pragmatism, Critical Concepts in\nPhilosophy</em>, vol. 2, Russell B. Goodman (ed.), London and New\nYork: Routledge, pp. 89–112.",
                "Bernstein, Richard, 2010, <em>The Pragmatic Turn</em>, Cambridge,\nU.K. and Malden, MA: Polity Press.",
                "Bird, Graham, 1986, <em>William James</em> (The Arguments of the\nPhilosophers), London: Routledge and Kegan Paul.",
                "Campbell, James, 2017, <em>Experiencing William James: Belief in a\nPluralistic World</em>, Charlottesville: University of Virginia\nPress.",
                "Carrette, Jeremy, 2013, <em>William James’s Hidden Religious\nImagination: A Universe of Relations</em>, New York: Routledge.",
                "Edie, James, 1987, <em>William James and Phenomenology</em>,\nIndianapolis: Indiana University Press.",
                "Feinstein, Howard M., 1984, <em>Becoming William James</em>,\nIthaca, NY: Cornell University Press.",
                "Friedl, Herwig, 2019, <em>Thinking in Search of a Language: Essays\non American Intellect and Intuition</em>, New York and London:\nBloomsbury Academic.",
                "Fuchs, Christopher A., 2017, “Notwithstanding Bohr: The\nReasons for QBism,” <em>Mind and Matter</em>, 15(2): 245–300;\npage reference is to the \n <a href=\"http://arxiv.org/pdf/1705.03483.pdf\" target=\"other\">preprint of Fuchs 2017 available online</a>].",
                "Gale, Richard M., 1999, <em>The Divided Self of William\nJames</em>, Cambridge: Cambridge University Press.",
                "–––, 2004, <em>The Philosophy of William James:\nAn Introduction</em>, Cambridge: Cambridge University Press.",
                "Girel, Mathias, 2004, “Les Angles de l’acte. Usages\nd’Emerson dans la Philosophie de William James,”\n<em>Cahier Charles V</em>, XXXVII (October): 207–245.",
                "Goodman, Russell B., 1990, <em>American Philosophy and the\nRomantic Tradition</em>, Cambridge: Cambridge University Press,\nChapter 3.",
                "–––, 2002, <em>Wittgenstein and William\nJames</em>, Cambridge: Cambridge University Press.",
                "–––, 2004, “James on the\nNonconceptual,” <em>Midwest Studies in Philosophy</em>, XXVIII:\n137–148.",
                "–––, 2008, “Emerson, Romanticism, and\nClassical American Pragmatism,” in <em>The Oxford Handbook of\nAmerican Philosophy</em>, ed. Cheryl Misak, Oxford: Oxford University\nPress, pp. 19–37.",
                "–––, 2010, “William James’s\nPluralisms,” <em>Revue Internationale de Philosophie</em>, 2:\n155–76.",
                "–––, 2016, “Thinking about Animals: James,\nWittgenstein, Hearne”, in <em>Nordic Wittgenstein Review</em>, 5(1):\n9–29.",
                "Healey, Richard, 2017, “Quantum-Bayesian and Pragmatist\nViews of Quantum Theory,” in <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2017 edition), Edward Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/spr2017/entries/quantum-bayesian/\">https://plato.stanford.edu/archives/spr2017/entries/quantum-bayesian/</a>&gt;.",
                "Jackman, Henry, 2008, “William James,” in <em>The\nOxford Handbook of American Philosophy</em>, Cheryl Misak (ed.),\nOxford: Oxford University Press, pp. 60–86.",
                "–––, 2017, “William James on Conceptions\nand Private Language,” <em>Belgrade Philosophical Annual</em>,\n30: 175–193.",
                "Klein, Alexander, 2009, “On Hume on Space: Green’s\nAttack, James’s Empirical Response,” in <em>Journal of the\nHistory of Philosophy</em>, 47(3): 415–49.",
                "––– (ed.), 2018, <em>The Oxford Handbook of William\nJames</em>, Oxford: Oxford University Press.",
                "Levinson, Henry S., 1981, <em>The Religious Investigations of\nWilliam James</em>, Chapel Hill: University of North Carolina\nPress.",
                "Madelrieux, Stéphane, 2008, <em>William James,\nl’attitude empiriste</em>, Paris: Presses Universitaires de\nFrance.",
                "Marchetti, Sarin, 2015, <em> Ethics and Philosophical Critique in\nWilliam James</em>, New York: Palmgrave Macmillan.",
                "–––, forthcoming, <em>The Jamesean Mind</em>,\nNew York and London: Routledge.",
                "Matthiessen, F. O., 1947, <em>The James Family</em>, New York:\nKnopf.",
                "McDermott, John, 1986, <em>Streams of Experience: Reflections on\nthe History and Philosophy of American Culture</em>, Amherst: \nUniversity of Massachusetts Press.",
                "Misak, Cheryl, 2013, <em>The American Pragmatists</em>, Oxford:\nOxford University Press.",
                "Moore, G. E., 1922, “William James’\n‘Pragmatism’,” in <em> Philosophical Studies</em>,\nLondon: Routledge &amp; Kegan Paul, pp. 97–146.",
                "Moran, Dermot, 2017, “Phenomenology and Pragmatism: Two\nInteractions. From Horizontal Intentionality to Practical\nCoping,” in Baghramian and Marchetti 2017, pp.\n272–93.",
                "Myers, Gerald, 1986, <em>William James: His Life and Thought</em>,\nNew Haven: Yale University Press.",
                "Pawelski, James O., 2007, <em>The Dynamic Individualism of William\nJames</em>, Albany, NY: State University of New York Press.",
                "Perry, Ralph Barton, 1935, <em>The Thought and Character of\nWilliam James</em>, Boston: Little, Brown, 2 vols.",
                "Pihlström, Sami, 2008, <em>The Trail of the Human Serpent is\nover Everything: Jamesian Perspectives on Mind, World, and\nReligion</em>, Lanham, MD: University Press of America.",
                "Poirier, Richard, 1992, <em>Poetry and Pragmatism</em>, \nCambridge, MA: Harvard University Press.",
                "Proudfoot, Wayne, ed., 2004, <em>William James and a Science of\nReligions</em>, New York: Columbia University Press.",
                "Putnam, Hilary, 1987, <em>The Many Faces of Realism</em>, La\nSalle, IL: Open Court.",
                "––– (with Ruth Anna Putnam), 1990,\n“William James’s Ideas,” in Putnam, Hilary,\n<em>Realism with a Human Face</em> (Cambridge, MA: Harvard University\nPress, pp. 217–231.",
                "Putnam, Ruth Anna, 1997, <em>The Cambridge Companion to William\nJames</em>, Cambridge: Cambridge University Press.",
                "Richardson, Robert D., 2006, <em>William James: In the Maelstrom\nof American Modernism</em>, Boston: Houghton Mifflin.",
                "Russell, Bertrand, 1921, <em>The Analysis of Mind</em>, London:\nGeorge Allen and Unwin.",
                "–––, 1986, <em>The Collected Papers of Bertrand\nRussell</em> (Volume 6), London: George Allen and Unwin, pp.\n257–306.",
                "Simon, Linda, 1998, <em>Genuine Reality: a life of William\nJames</em>, New York: Harcourt Brace.",
                "Seigfried, Charlene Haddock, 1990, <em>William James’s\nRadical Reconstruction of Philosophy</em>, Albany: State University of\nNew York Press.",
                "Skillen, Anthony, 1996, “William James, ‘A Certain\nBlindness’ and an Uncertain Pluralism,” in <em>Philosophy\nand Pluralism</em>, ed. David Archard. Cambridge: Cambridge University\nPress, pp. 33–45.",
                "Slater, Michael R., 2009, <em>William James on Ethics and\nFaith</em>, Cambridge: Cambridge University Press.",
                "–––, 2014, <em>Pragmatism and the Philosophy of\nReligion</em>, Cambridge: Cambridge University Press.",
                "Sprigge, T. L. S., 1993, <em>James and Bradley: American Truth and\nBritish Reality</em>, Chicago: Open Court.",
                "Suckiel, Ellen Kappy, 1982, <em>The Pragmatic Philosophy of\nWilliam James</em>, Notre Dame, IN and London: University of Notre\nDame Press.",
                "–––, 1996, <em>Heaven’s Champion</em>,\nNotre Dame, IN and London: University of Notre Dame Press.",
                "Tarver, Erin C. and Shannon Sullivan (eds.), 2015, <em>Feminist\nInterpretations of William James</em>, University Park, PA: The\nPennsylvania State University Press.",
                "Taylor, Eugene, 1996, <em>William James on Consciousness Beyond\nthe Fringe</em>, Princeton, NJ: Princeton University Press.",
                "Wahl, Jean, 1925, <em>Pluralist Philosophies of England and\nAmerica</em>, trans. Fred Rothwell , London: Open Court.",
                "Wilshire, Bruce, 1979, <em>William James and Phenomenology: A\nStudy of</em> “The Principles of Psychology”, New York:\nAMS Press, 1979.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimLiteWorkWillJame\">Primary Literature: Works by William James</h3>\n<p>\nThe works that correspond to the abbreviations [PP], [WB], [TT], [V],\n[P], [PU], [MT], and [E] are referenced below -- the abbreviation is\nindicated occurs at the end of relevant reference.</p>\n<ul class=\"hanging\">\n<li><em>The Works of William James</em>, Cambridge, MA and London:\nHarvard University Press, 17 vol., 1975–.</li>\n<li><em>William James: Writings 1878–1899</em>. New York:\nLibrary of America, 1992.</li>\n<li><em>William James: Writings 1902–1910</em>. New York:\nLibrary of America, 1987</li>\n<li>“Remarks on Spencer’s Definition of Mind as\nCorrespondence,” first published in <em>The Journal of\nSpeculative Philosophy</em>, 1878. Contained in <em>Essays in\nPhilosophy</em>, pp. 7–22.</li>\n<li><em>The Principles of Psychology</em>, Cambridge, MA: Harvard\nUniversity Press, 1981. Originally published in 1890 [PP].</li>\n<li><em>The Will to Believe and Other Essays in Popular\nPhilosophy</em>, Cambridge, MA and London: Harvard University Press,\n1979; first published in 1897 [WB].</li>\n<li>“Philosophical Conceptions and Practical Results,”\n1898. Contained in <em>Pragmatism</em>, in <em>The Works of William\nJames</em>, pp. 255–70.</li>\n<li><em>Talks to Teachers on Psychology and to Students on Some of\nLife’s Ideals</em>. New York: Henry Holt, 1899 [TT].</li>\n<li><em>The Varieties of Religious Experience</em>, New York:\nLongmans, Green, 1916. Originally published in 1902 [V].</li>\n<li><em>Pragmatism</em>. Cambridge, MA: Harvard University Press,\n1979. Originally published in 1907 [P].</li>\n<li><em>A Pluralistic Universe</em>. Cambridge, MA: Harvard University\nPress, 1977. Originally published in 1909 [PU].</li>\n<li><em>The Meaning of Truth</em>, Cambridge, MA and London: Harvard\nUniversity Press, 1979 [MT]. Originally published in 1909.</li>\n<li><em>Essays in Philosophy</em>. Cambridge, MA and London: Harvard\nUniversity Press, 1978 [E].</li>\n<li><em>Some Problems of Philosophy</em>. Cambridge, MA and London:\nHarvard University Press, 1979. Originally published in 1911.</li>\n<li><em>The Letters of William James</em>, ed. Henry James, Boston:\nLittle Brown, 1926.</li>\n<li><em>The Correspondence of William James</em>, ed. Ignas K.\nSkrupskelis and Elizabeth M. Berkeley, 12 volumes. Charlottesville and\nLondon, University Press of Virginia, 1992–.</li>\n<li><em>Selected Letters of William and Henry James</em>,\nCharlottesville and London, University Press of Virginia, 1997.</li>\n</ul>\n<h3 id=\"SecoLite\">Secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Baghramian, Maria and Sarin Marchetti (eds.), 2017, <em>Pragmatism\nand the European Traditions: Encounters with Analytic Philosophy and\nPhenomenology Before the Great Divide</em>, New York and London:\nRoutledge.</li>\n<li>Barzun, Jacques, 1983, <em>A Stroll with William James</em> New\nYork: Harper and Row.</li>\n<li>Benoist, Jocelyn, 2005, “A Phenomenology or\nPragmatism?” in <em>Pragmatism, Critical Concepts in\nPhilosophy</em>, vol. 2, Russell B. Goodman (ed.), London and New\nYork: Routledge, pp. 89–112.</li>\n<li>Bernstein, Richard, 2010, <em>The Pragmatic Turn</em>, Cambridge,\nU.K. and Malden, MA: Polity Press.</li>\n<li>Bird, Graham, 1986, <em>William James</em> (The Arguments of the\nPhilosophers), London: Routledge and Kegan Paul.</li>\n<li>Campbell, James, 2017, <em>Experiencing William James: Belief in a\nPluralistic World</em>, Charlottesville: University of Virginia\nPress.</li>\n<li>Carrette, Jeremy, 2013, <em>William James’s Hidden Religious\nImagination: A Universe of Relations</em>, New York: Routledge.</li>\n<li>Edie, James, 1987, <em>William James and Phenomenology</em>,\nIndianapolis: Indiana University Press.</li>\n<li>Feinstein, Howard M., 1984, <em>Becoming William James</em>,\nIthaca, NY: Cornell University Press.</li>\n<li>Friedl, Herwig, 2019, <em>Thinking in Search of a Language: Essays\non American Intellect and Intuition</em>, New York and London:\nBloomsbury Academic.</li>\n<li>Fuchs, Christopher A., 2017, “Notwithstanding Bohr: The\nReasons for QBism,” <em>Mind and Matter</em>, 15(2): 245–300;\npage reference is to the \n <a href=\"http://arxiv.org/pdf/1705.03483.pdf\" target=\"other\">preprint of Fuchs 2017 available online</a>].</li>\n<li>Gale, Richard M., 1999, <em>The Divided Self of William\nJames</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>The Philosophy of William James:\nAn Introduction</em>, Cambridge: Cambridge University Press.</li>\n<li>Girel, Mathias, 2004, “Les Angles de l’acte. Usages\nd’Emerson dans la Philosophie de William James,”\n<em>Cahier Charles V</em>, XXXVII (October): 207–245.</li>\n<li>Goodman, Russell B., 1990, <em>American Philosophy and the\nRomantic Tradition</em>, Cambridge: Cambridge University Press,\nChapter 3.</li>\n<li>–––, 2002, <em>Wittgenstein and William\nJames</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2004, “James on the\nNonconceptual,” <em>Midwest Studies in Philosophy</em>, XXVIII:\n137–148.</li>\n<li>–––, 2008, “Emerson, Romanticism, and\nClassical American Pragmatism,” in <em>The Oxford Handbook of\nAmerican Philosophy</em>, ed. Cheryl Misak, Oxford: Oxford University\nPress, pp. 19–37.</li>\n<li>–––, 2010, “William James’s\nPluralisms,” <em>Revue Internationale de Philosophie</em>, 2:\n155–76.</li>\n<li>–––, 2016, “Thinking about Animals: James,\nWittgenstein, Hearne”, in <em>Nordic Wittgenstein Review</em>, 5(1):\n9–29.</li>\n<li>Healey, Richard, 2017, “Quantum-Bayesian and Pragmatist\nViews of Quantum Theory,” in <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2017 edition), Edward Zalta (ed.), URL = \n&lt;<a href=\"https://plato.stanford.edu/archives/spr2017/entries/quantum-bayesian/\">https://plato.stanford.edu/archives/spr2017/entries/quantum-bayesian/</a>&gt;.</li>\n<li>Jackman, Henry, 2008, “William James,” in <em>The\nOxford Handbook of American Philosophy</em>, Cheryl Misak (ed.),\nOxford: Oxford University Press, pp. 60–86.</li>\n<li>–––, 2017, “William James on Conceptions\nand Private Language,” <em>Belgrade Philosophical Annual</em>,\n30: 175–193.</li>\n<li>Klein, Alexander, 2009, “On Hume on Space: Green’s\nAttack, James’s Empirical Response,” in <em>Journal of the\nHistory of Philosophy</em>, 47(3): 415–49.</li>\n<li>––– (ed.), 2018, <em>The Oxford Handbook of William\nJames</em>, Oxford: Oxford University Press.</li>\n<li>Levinson, Henry S., 1981, <em>The Religious Investigations of\nWilliam James</em>, Chapel Hill: University of North Carolina\nPress.</li>\n<li>Madelrieux, Stéphane, 2008, <em>William James,\nl’attitude empiriste</em>, Paris: Presses Universitaires de\nFrance.</li>\n<li>Marchetti, Sarin, 2015, <em> Ethics and Philosophical Critique in\nWilliam James</em>, New York: Palmgrave Macmillan.</li>\n<li>–––, forthcoming, <em>The Jamesean Mind</em>,\nNew York and London: Routledge.</li>\n<li>Matthiessen, F. O., 1947, <em>The James Family</em>, New York:\nKnopf.</li>\n<li>McDermott, John, 1986, <em>Streams of Experience: Reflections on\nthe History and Philosophy of American Culture</em>, Amherst: \nUniversity of Massachusetts Press.</li>\n<li>Misak, Cheryl, 2013, <em>The American Pragmatists</em>, Oxford:\nOxford University Press.</li>\n<li>Moore, G. E., 1922, “William James’\n‘Pragmatism’,” in <em> Philosophical Studies</em>,\nLondon: Routledge &amp; Kegan Paul, pp. 97–146.</li>\n<li>Moran, Dermot, 2017, “Phenomenology and Pragmatism: Two\nInteractions. From Horizontal Intentionality to Practical\nCoping,” in Baghramian and Marchetti 2017, pp.\n272–93.</li>\n<li>Myers, Gerald, 1986, <em>William James: His Life and Thought</em>,\nNew Haven: Yale University Press.</li>\n<li>Pawelski, James O., 2007, <em>The Dynamic Individualism of William\nJames</em>, Albany, NY: State University of New York Press.</li>\n<li>Perry, Ralph Barton, 1935, <em>The Thought and Character of\nWilliam James</em>, Boston: Little, Brown, 2 vols.</li>\n<li>Pihlström, Sami, 2008, <em>The Trail of the Human Serpent is\nover Everything: Jamesian Perspectives on Mind, World, and\nReligion</em>, Lanham, MD: University Press of America.</li>\n<li>Poirier, Richard, 1992, <em>Poetry and Pragmatism</em>, \nCambridge, MA: Harvard University Press.</li>\n<li>Proudfoot, Wayne, ed., 2004, <em>William James and a Science of\nReligions</em>, New York: Columbia University Press.</li>\n<li>Putnam, Hilary, 1987, <em>The Many Faces of Realism</em>, La\nSalle, IL: Open Court.</li>\n<li>––– (with Ruth Anna Putnam), 1990,\n“William James’s Ideas,” in Putnam, Hilary,\n<em>Realism with a Human Face</em> (Cambridge, MA: Harvard University\nPress, pp. 217–231.</li>\n<li>Putnam, Ruth Anna, 1997, <em>The Cambridge Companion to William\nJames</em>, Cambridge: Cambridge University Press.</li>\n<li>Richardson, Robert D., 2006, <em>William James: In the Maelstrom\nof American Modernism</em>, Boston: Houghton Mifflin.</li>\n<li>Russell, Bertrand, 1921, <em>The Analysis of Mind</em>, London:\nGeorge Allen and Unwin.</li>\n<li>–––, 1986, <em>The Collected Papers of Bertrand\nRussell</em> (Volume 6), London: George Allen and Unwin, pp.\n257–306.</li>\n<li>Simon, Linda, 1998, <em>Genuine Reality: a life of William\nJames</em>, New York: Harcourt Brace.</li>\n<li>Seigfried, Charlene Haddock, 1990, <em>William James’s\nRadical Reconstruction of Philosophy</em>, Albany: State University of\nNew York Press.</li>\n<li>Skillen, Anthony, 1996, “William James, ‘A Certain\nBlindness’ and an Uncertain Pluralism,” in <em>Philosophy\nand Pluralism</em>, ed. David Archard. Cambridge: Cambridge University\nPress, pp. 33–45.</li>\n<li>Slater, Michael R., 2009, <em>William James on Ethics and\nFaith</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2014, <em>Pragmatism and the Philosophy of\nReligion</em>, Cambridge: Cambridge University Press.</li>\n<li>Sprigge, T. L. S., 1993, <em>James and Bradley: American Truth and\nBritish Reality</em>, Chicago: Open Court.</li>\n<li>Suckiel, Ellen Kappy, 1982, <em>The Pragmatic Philosophy of\nWilliam James</em>, Notre Dame, IN and London: University of Notre\nDame Press.</li>\n<li>–––, 1996, <em>Heaven’s Champion</em>,\nNotre Dame, IN and London: University of Notre Dame Press.</li>\n<li>Tarver, Erin C. and Shannon Sullivan (eds.), 2015, <em>Feminist\nInterpretations of William James</em>, University Park, PA: The\nPennsylvania State University Press.</li>\n<li>Taylor, Eugene, 1996, <em>William James on Consciousness Beyond\nthe Fringe</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Wahl, Jean, 1925, <em>Pluralist Philosophies of England and\nAmerica</em>, trans. Fred Rothwell , London: Open Court.</li>\n<li>Wilshire, Bruce, 1979, <em>William James and Phenomenology: A\nStudy of</em> “The Principles of Psychology”, New York:\nAMS Press, 1979.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Dewey, John",
            "Husserl, Edmund",
            "pluralism",
            "pragmatism",
            "religious experience",
            "Russell, Bertrand",
            "Wittgenstein, Ludwig"
        ],
        "entry_link": [
            {
                "../dewey/": "Dewey, John"
            },
            {
                "../husserl/": "Husserl, Edmund"
            },
            {
                "../pragmatism/": "pragmatism"
            },
            {
                "../religious-experience/": "religious experience"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../wittgenstein/": "Wittgenstein, Ludwig"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=james\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/james/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=james&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/james/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=james": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/james/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=james&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/james/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.uky.edu/~eushe2/Pajares/james.html\" target=\"other\">William James</a>,\n web page by Frank Pajares",
            "<a href=\"http://www.pragmatism.org/\" target=\"other\">Pragmatism Cybrary</a>"
        ],
        "listed_links": [
            {
                "http://www.uky.edu/~eushe2/Pajares/james.html": "William James"
            },
            {
                "http://www.pragmatism.org/": "Pragmatism Cybrary"
            }
        ]
    }
}