{
    "url": "kant-transcendental-idealism",
    "title": "Kant’s Transcendental Idealism",
    "authorship": {
        "year": "Copyright © 2016",
        "author_text": "Nicholas F. Stang\n<nick.stang@gmail.com>",
        "author_links": [
            {
                "mailto:nick%2estang%40gmail%2ecom": "nick.stang@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2016</a> by\n\n<br/>\nNicholas F. Stang\n&lt;<a href=\"mailto:nick%2estang%40gmail%2ecom\"><em>nick<abbr title=\" dot \">.</abbr>stang<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Mar 4, 2016"
    ],
    "preamble": "\n\nIn the Critique of Pure Reason Kant argues that space and\ntime are merely formal features of how we perceive objects, not things\nin themselves that exist independently of us, or properties or\nrelations among them. Objects in space and time are said to be\n“appearances”, and he argues that we know nothing of\nsubstance about the things in themselves of which they are\nappearances. Kant calls this doctrine (or set of doctrines)\n“transcendental idealism”, and ever since the publication\nof the first edition of the Critique of Pure Reason in 1781,\nKant’s readers have wondered, and debated, what exactly\ntranscendental idealism is, and have developed quite different\ninterpretations. Some, including many of Kant’s contemporaries,\ninterpret transcendental idealism as essentially a form of\nphenomenalism, similar in some respects to that of Berkeley, while\nothers think that it is not a metaphysical or ontological theory at\nall. There is probably no major interpretive question in Kant’s\nphilosophy on which there is so little consensus. This entry provides\nan introduction to the most important Kantian texts, as well as the\ninterpretive and philosophical issues surrounding them.\n",
    "toc": [
        {
            "#AppeThinThem": "1. Appearances and Things in Themselves"
        },
        {
            "#TranRealEmpiIdea": "1.1 Transcendental Realism and Empirical Idealism"
        },
        {
            "#EmpiThinItse": "1.2 The Empirical Thing in Itself"
        },
        {
            "#FedeGarvReviKantRepl": "2. The Feder-Garve Review and Kant’s Replies"
        },
        {
            "#FedeGarvRevi": "2.1 The Feder-Garve review"
        },
        {
            "#VariPhen": "2.2 Varieties of Phenomenalism"
        },
        {
            "#KantStriBack": "2.3 Kant Strikes Back"
        },
        {
            "#ChanBEdit": "2.4 Changes in the B Edition"
        },
        {
            "#KantPhen": "3. Kant as a Phenomenalist"
        },
        {
            "#AppeRepr": "3.1 Appearances = representations?"
        },
        {
            "#QualPhen": "3.2 Qualified phenomenalism"
        },
        {
            "#CritPhenRead": "3.3 Criticisms of Phenomenalist Readings"
        },
        {
            "#ProbThinThem": "3.4 The Problem of Things in Themselves"
        },
        {
            "#DualAspeView": "4. The “Dual Aspect” View"
        },
        {
            "#OneObjeNotTwo": "4.1 One Object, Not Two"
        },
        {
            "#AlliEpisRead": "4.2 Allison’s “Epistemic” reading"
        },
        {
            "#ProbEpisRead": "4.3. Problems with the Epistemic reading"
        },
        {
            "#MetaDualAspeRead": "4.4 Metaphysical “Dual Aspect” Readings"
        },
        {
            "#ProbForLangRead": "4.5 Problems for Langton’s reading"
        },
        {
            "#OneObjeTwo": "5. One Object or Two?"
        },
        {
            "#IdenBetwAppeThinThem": "5.1 Identity between appearances and things in themselves"
        },
        {
            "#LangNonIden": "5.2 Langton and non-identity"
        },
        {
            "#PhenDualAspeRead": "5.3 Phenomenalist Dual Aspect Readings"
        },
        {
            "#AsseInteIssu": "5.4 Assessing the Interpretive Issues"
        },
        {
            "#ThinThemNoumTranObje": "6. Things in themselves, noumena, and the transcendental object"
        },
        {
            "#PhenNoum": "6.1 Phenomena and noumena"
        },
        {
            "#TranObjeX": "6.2 The transcendental object = X"
        },
        {
            "#Conc": "7. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#WorkKant": "Works of Kant"
        },
        {
            "#OthePrimSour": "Other Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Appearances and Things in Themselves\n\nIn the first edition (A) of the Critique of Pure Reason,\npublished in 1781, Kant argues for a surprising set of claims about\nspace, time, and objects:\n\n Space and time are merely the forms of our sensible intuition of\nobjects. They are not beings that exist independently of our intuition\n(things in themselves), nor are they properties of, nor relations\namong, such beings. (A26, A33)\n The objects we intuit in space and time are appearances, not\nobjects that exist independently of our intuition (things in\nthemselves). This is also true of the mental states we intuit in\nintrospection; in “inner sense” (introspective awareness\nof my inner states) I intuit only how I appear to myself, not how I am\n“in myself”. (A37–8, A42)\n We can only cognize objects that we can, in principle, intuit.\nConsequently, we can only cognize objects in space and time,\nappearances. We cannot cognize things in themselves. (A239)\n Nonetheless, we can think about things in themselves using the\ncategories (A254).\n Things in themselves affect us, activating our sensible faculty\n(A190,\n A387).[1]\n\n\nIn the “Fourth Paralogism” Kant defines\n“transcendental idealism”:\n\n\nI understand by the transcendental idealism of all\nappearances [Erscheinungen] the doctrine that they are all\ntogether to be regarded as mere representations and not as things in\nthemselves [nicht als Dinge an sich selbst ansehen], and\naccordingly that space and time are only sensible forms of our\nintuition, but not determinations given for themselves or conditions\nof objects as things in themselves [als Dinge an sich\nselbst]. (A369; the Critique is quoted from the Guyer\n& Wood translation (1998))\n\n\nEver since 1781, the meaning and significance of Kant’s\n“transcendental idealism” has been a subject of\ncontroversy. Kant’s doctrines raise numerous interpretive\nquestions, which cluster around three sets of issues:\n\n(a)\nThe nature of appearances. Are they (as Kant sometimes\nsuggests) identical to representations, i.e., states of our minds? If\nso, does Kant follow Berkeley in equating bodies (objects in space)\nwith ideas (representations)? If not, what are they, and what relation\ndo they have to our representations of them?\n(b)\nThe nature of things in themselves. What can we say\npositively about them? What does it mean that they are not in space\nand time? How is this claim compatible with the doctrine that we\ncannot know anything about them? How is the claim that they affect us\ncompatible with that doctrine? Is Kant committed to the\nexistence of things in themselves, or is the concept of a\n“thing in itself” merely the concept of a way objects\nmight be (for all we know)?\n(c)\nThe relation of things in themselves to appearances. Is\nthe appearance/thing in itself distinction an ontological one between\ntwo different kinds of objects? If not, is it a distinction between\ntwo aspects of one and the same kind of object? Or perhaps an\nadverbial distinction between two different ways of considering the\nsame objects?\n\n\nSections 2–6 examine various influential interpretations of\ntranscendental idealism, focusing on their consequences for\n(a)–(c). Section 7 is devoted more narrowly to the nature of\nthings in themselves, topic (b), and the related Kantian notions:\nnoumena, and the transcendental object. The primary focus\nwill be the Critique of Pure Reason itself; while\ntranscendental idealism, arguably, plays an equally crucial role in\nthe other Critiques, discussing them would take us too far\nafield into Kant’s ethics, aesthetics, and\n teleology.[2]\n While transcendental idealism is a view both about space and\ntime, and thus of objects of outer sense as well as inner sense (my\nown mental states), this entry will focus on Kant’s views about\nspace and outer objects. Kant’s transcendental idealist theory\nof time is too intimately tied up with his theory of the self, and the\nargument of the transcendental deduction, to discuss here (see\nFalkenstein 1991; Van Cleve 1999: 52–61; and Dunlop 2009 for\nmore on Kant’s theory of time).\n\nBefore discussing the details of different interpretations, though, it\nwill be helpful if readers have an overview of some relevant texts and\nsome sense of their prima facie meaning. The interpretation\nof these texts offered in this section is provisional; later, we will\nsee powerful reasons to question whether it is correct. Since some\nscholars claim there is a change in Kant’s doctrine from the A\nedition of 1781 to the B edition of 1787, we will begin by restricting\nattention to the A edition.\n Section 2.4\n discusses what relevance the changes made in the B edition have for\nthe interpretation of transcendental idealism. However, following\nstandard scholarly practice, for passages present in both editions,\nthe A page number followed by the B page number is given (e.g.,\nA575/B603). Works other than the Critique are cited by volume\nin the “Academy” edition of Kant’s work (Ak.),\nfollowed by the page number. At the end of this article can be found a\nguide to all the editions and translations of Kant used in its\npreparation.\n1.1 Transcendental Realism and Empirical Idealism\n\nOne promising place to begin understanding transcendental idealism is\nto look at the other philosophical positions from which Kant\ndistinguishes it. In the “Fourth Paralogism”, he\ndistinguishes transcendental idealism from transcendental realism:\n\n\nTo this [transcendental] idealism is opposed transcendental realism,\nwhich regards space and time as something given in themselves\n(independent of our sensibility). The transcendental realist therefore\nrepresents outer appearances (if their reality is conceded) as things\nin themselves [Dinge an sich selbst], which would exist\nindependently of us and our sensibility and thus would also be outside\nus according to pure concepts of the understanding. (A369)\n\n\nTranscendental realism, according to this passage, is the view that\nobjects in space and time exist independently of our experience of\nthem, while transcendental idealism denies this. This point is\nreiterated later in the Critique when Kant writes:\n\n\nWe have sufficiently proved in the Transcendental Aesthetic that\neverything intuited in space or in time, hence all objects of an\nexperience possible for us, are nothing but appearances, i.e., mere\nrepresentations, which, as they are represented, as extended beings or\nseries of alterations, have outside our thoughts no existence grounded\nin itself. This doctrine I call transcendental idealism.\n The realist, in the transcendental signification, makes\nthese modifications of our sensibility into things subsisting in\nthemselves, and hence makes mere representations into\nthings in themselves [Sachen an sich selbst].\n (A491/B519)[3]\n\n\nAppearances exist at least partly in virtue of our experience of them,\nwhile the existence of things in themselves is not grounded in our\nexperience at all (cf. A369, A492/B521, A493/B522). Kant calls\ntranscendental realism the “common prejudice” (A740/B768)\nand describes it as a “common but fallacious\npresupposition” (A536/B564; cf. Allison 2004: 22).\nTranscendental realism is the commonsense pre-theoretic view that\nobjects in space and time are “things in themselves”,\nwhich Kant, of course, denies.\n\nKant also distinguishes transcendental idealism from another position\nhe calls “empirical idealism”:\n\n\nOne would also do us an injustice if one tried to ascribe to us that\nlong-decried empirical idealism that, while assuming the proper\nreality of space, denies the existence of extended beings in it, or at\nleast finds this existence doubtful, and so in this respect admits no\nsatisfactorily provable distinction between dream and truth. As to the\nappearances of inner sense in time, it finds no difficulty in them as\nreal things, indeed, it even asserts that this inner experience and it\nalone gives sufficient proof of the real existence of their object (in\nitself) along with all this time-determination. (A491/B519)\n\n\nEmpirical idealism, as Kant here characterizes it, is the view that\nall we know immediately (non-inferentially) is the existence of our\nown minds and our temporally ordered mental states, while we can only\ninfer the existence of objects “outside” us in space.\nSince the inference from a known effect to an unknown cause is always\nuncertain, the empirical idealist concludes we cannot know that\nobjects exist outside us in space. Kant typically distinguishes two\nvarieties of empirical idealism: dogmatic idealism, which claims that\nobjects in space do not exist, and problematic idealism, which claims\nthat objects in space may exist, but we cannot know whether they do\n(see A377). Although he is never mentioned by name in the A Edition,\nBerkeley seems to be Kant’s paradigm dogmatic idealist, while\nDescartes is named as the paradigm problematic\n idealist.[4]\n\nTranscendental idealism is a form of empirical realism because it\nentails that we have immediate (non-inferential) and certain knowledge\nof the existence of objects in space merely through\nself-consciousness:\n\n\n[…] external objects (bodies) are merely appearances, hence\nalso nothing other than a species of my representations, whose objects\nare something only through these representations, but are nothing\nseparated from them. Thus external things exist as well as my self,\nand indeed both exist on the immediate testimony of my\nself-consciousness, only with this difference: the representation of\nmy Self, as the thinking subject is related merely to inner sense, but\nthe representations that designate extended beings are also related to\nouter sense. I am no more necessitated to draw inferences in respect\nof the reality of external objects than I am in regard to the reality\nof my inner sense (my thoughts), for in both cases they are nothing\nbut representations, the immediate perception (consciousness) of which\nis at the same time a sufficient proof of their reality.\n(A370–1)\n\n\nMerely through self-conscious introspection I can know that I have\nrepresentations with certain contents and since appearances are\n“nothing other than a species of my representations” this\nconstitutes immediate and certain knowledge of the existence of\nobjects in space.\n\nUnderstanding transcendental idealism requires understanding the\nprecise sense in which things in themselves are, and appearances are\nnot, “external to” or “independent” of the\nmind and Kant draws a helpful distinction between two senses in which\nobjects can be “outside me”:\n\n\nBut since the expression outside us carries with it\nan unavoidable ambiguity, since it sometimes signifies something that,\nas a thing in itself [Ding an sich selbst], exists distinct\nfrom us and sometimes merely that belongs to outer appearance, then in\norder to escape uncertainty and use this concept in the latter\nsignificance—in which it is taken in the proper psychological\nquestion about the reality of our outer intuition—we will\ndistinguish empirically external objects from those\nthat might be called “external” in the transcendental\nsense, by directly calling them “things that are to be\nencountered in space”. (A373)\n\n\nIn the transcendental sense, an object is “outside me”\nwhen its existence does not depend (even partly) on my representations\nof it. The empirical sense of “outside me” depends upon\nthe distinction between outer and inner sense. Inner sense is the\nsensible intuition of my inner states (which are themselves\nappearances); time is the form of inner sense, meaning that all the\nstates we intuit in inner sense are temporally ordered. Outer sense is\nthe sensible intuition of objects that are not my inner states; space\nis the form of outer sense. In the empirical sense,\n“outer” simply refers to objects of outer sense, objects\nin space. Transcendental idealism is the view that objects in space\nare “outer” in the empirical sense but not in the\ntranscendental sense. Things in themselves are transcendentally\n“outer” but appearances are not.\n1.2 The Empirical Thing in Itself\n\nJust as Kant distinguishes a transcendental from an empirical sense of\n“outer” he also distinguishes a transcendental version of\nthe appearance/thing in itself distinction (the distinction we have\nbeen concerned with up to now) from an empirical version of that\ndistinction. The key text here is A45–46/B62–63, which for\nreasons of brevity will not be quoted in full (cf. the discussion of\nthe rose at A29–30/B45, as well as A257/B313).\n\nIn the empirical case, the distinction seems to be between the\nphysical properties of an object and the sensory qualities it presents\nto differently situated human observers. This requires distinguishing\nbetween what is “valid for every human sense in general”\nand what “pertains to [objects] only contingently because [of]\n… a particular situation or organization of this or that\nsense” (A45/B62). The distinction seems to be that some\nproperties of objects are represented in experience just in virtue of\nthe a priori forms of experience, and thus have\ninter-subjective validity for all cognitive subjects, while some\nproperties depend upon the particular constitution of our sense organs\n(cf. A226/B273). The “empirical thing in itself” is the\nempirical object qua bearer of the former set of properties,\nwhile the “empirical appearance” is the empirical object\nqua bearer of all of its properties, including the latter.\nFor instance, the empirical “rainbow in itself” is a\ncollection of water droplets with particular sizes and shapes and\nspatial relations, while the empirical “rainbow\nappearance” is the colorful band we see in the\n sky.[5]\n\nFor our purposes, the importance of this distinction is two-fold.\nFirstly, the (transcendental) distinction is not the ordinary\ndistinction between how objects appear to us in sense perception and\nthe properties they actually have. Kantian appearances are not the\nobjects of ordinary sense perception, for Kant holds that appearances\nin themselves (things in themselves, in the empirical sense)\nlack sensory qualities like color, taste, texture, etc. In scientific\nresearch, we may discover how appearances are in themselves\n(in the empirical sense) but in so doing all we discover is more\nappearance (in the transcendental sense); scientific investigation\ninto the ultimate constituents or causal determinants of objects only\nreveals more appearance, not things in themselves. Secondly, there is\nan appearance/reality distinction at the level of\nappearances. This provides a further sense in which Kant is an\n“empirical realist”: appearances in themselves have\nproperties quite different than they seem to have in sense\nperception.\n\nKant’s empirical realism—not in his technical sense, but\nin the broader sense that he accepts an appearance/reality distinction\nat the level of appearances (see Abela 2002)—is further deepened\nby his scientific realism: he accepts the existence of unobservable\nentities posited by our best scientific theories and holds that these\nentities are appearances (because they are in\n space).[6]\n Earlier, we saw texts whose prima facie meaning is that\nappearances exist, at least partly, in virtue of the contents of our\nrepresentations of them. But it is clear that Kant cannot hold that\nthe existence of an object in space is grounded in our direct\nperception of that object, for that would be incompatible with the\nexistence of unperceived spatial objects.\n2. The Feder-Garve Review and Kant’s Replies\n\nThe first published review of the Critique of Pure Reason, by\nFeder and Garve (1782), accuses Kant of holding a basically Berkeleyan\nphenomenalist conception of objects in space. Feder and Garve were not\nthe only ones to read Kant as a phenomenalist. The phenomenalist\nreading was so widespread and influential that it became the default\ninterpretation for generations after the publication of the\nCritique. In fact, many of the key figures in German\nphilosophy in 1781 and after (e.g., Mendelssohn, Eberhard, Hamann,\nJacobi, Fichte, Schelling) take the phenomenalist or\n“subjectivist” reading of Kant for granted and think this\nis precisely why Kant must be “overcome”. The assumption\nthat Kant is a subjectivist about appearances is a major impetus in\nthe development of German\n idealism.[7]\n\nHowever, the phenomenalist reading of transcendental idealism has been\nchallenged on many fronts, both as an interpretation of Kant and\n(often on the assumption that it is Kant’s view) on its own\nphilosophical merits. This section explores the origin of the\nphenomenalist reading in the Feder-Garve review and its basis in the\ntext of the Critique. The next section provides some reasons\nto think that the phenomenalist reading is more defensible as an\ninterpretation of Kant than is sometimes appreciated. Section 3.4\nexplores influential objections by Kant’s contemporaries to\ntranscendental idealism, on the assumption that the phenomenalist\ninterpretation of that doctrine is correct, which were later taken up\nas criticisms of the phenomenalist interpretation itself.\n Section 4\n introduces a theme explored in greater detail in later sections: the\ndevelopment of non-phenomenalist interpretations of Kant’s\ntranscendental idealism.\n2.1 The Feder-Garve review\n\nAlthough it is uncharitable and, on some points, simply mistaken, the\nfirst published review of the Critique, originally written by\nChristian Garve and then substantially revised, and shortened, by\nJ.G.H. Feder, raised an issue that has been discussed ever\n since.[8]\n The Göttingen, or “Feder-Garve” review, as it is now\nknown, claims that Kantian “transcendental” idealism is\njust idealism of a familiar Berkeleyan or phenomenalist variety\n(Sassen 2000: 53).\n\nFirst of all, it should be noted that the Feder-Garve view, while not\nexactly an exercise in interpretive charity, is not without a basis in\nclaiming that there is a deep similarity between Berkeley and the\nCritique (this point is brought out well in Beiser 2002:\n49–52). First of all, Kant repeatedly claims that empirical\nobjects are representations. For instance, in the\n“Transcendental Aesthetic” he writes that “what we\ncall outer objects are nothing other than mere representations of our\nsensibility” (A30/B45) and in the “Fourth\nParalogism” he writes: “external objects (bodies) are\nmerely appearances, hence also nothing other than a species of my\nrepresentations” (A370; see also A30/B45, A104 and A375n, A490,\nA498, A563). Since “representation” [Vorstellung]\nis Kant’s term for what Berkeley calls “ideas”, this\nseems at least perilously close to the Berkeleyan view that bodies are\ncollections of ideas. Secondly, the A Edition is full of passages that\ncan easily suggest a phenomenalist view of objects in space, such as:\n\n\n\nWhy do we have need of a doctrine of the soul grounded merely on pure\nrational principles? Without doubt chiefly with the intent of securing\nour thinking Self from the danger of materialism. But this is achieved\nby the rational concept of our thinking Self that we have given. For\naccording to it, so little fear remains that if one took matter away\nthen all thinking and even the existence of thinking beings would be\nabolished, that it rather shows clearly that if I were to take away\nthe thinking subject, the whole corporeal world would have to\ndisappear, as this is nothing but the appearance in the sensibility of\nour subject and one mode of its representations. (A383; cf. A374n,\nA490–1/B518–9, A520/B492–A521/B493, A494/B522)\n\n\nOn one plausible reading of these passages, Kant is claiming that all\nthere is for objects in space to exist is for us to have experiences\nas of objects in space. Consequently, if we did not exist, or did not\nhave such experiences, these objects would not exist. The Feder-Garve\ninterpretation of transcendental idealism is not without some\n merit.[9]\n2.2 Varieties of Phenomenalism\n\nPhenomenalism can mean many things, and later we will explore these\nmeanings in detail, but for now it is worth distinguishing at least\nthree different things we might mean by phenomenalism:\n\n(1) \n Objects in space are identical to (unified collections of) our\n representations.[10]\n(2) \n Objects in space exist solely in virtue of the contents of our\nrepresentations of them. They possess all of their properties solely\nin virtue of the contents of those representations.\n(3)\n Objects in space exist partly in virtue of the contents of our\nrepresentations of them. They possess their “core physical\nproperties” solely in virtue of the contents of those\nrepresentations.\n\n\n“Core physical properties” here means the properties that\nappearances have “in themselves” according to Kant. These\nare, roughly, Lockean primary qualities (see Locke, Essay\nconcerning Human Understanding, book II, chapter VIII).\nFeder-Garve accuse Kant of holding (1), which we may call\n“identity phenomenalism”. But even if he did not hold that\nextreme view, he might hold one of the weaker views listed here. Claim\n(2) is a quite strong form of phenomenalism, for it entails that, in\nsome sense, all there is to objects is our representations of them,\nalthough they are not literally identical to those representation. We\nmay call this “strong phenomenalism”. The exact meaning of\nBerkeley’s own views about bodies is unclear, and not the\nsubject of this entry. But it is not implausible to read Berkeley as\nholding (2). However, claim (3), while very controversial and\n(arguably) extremely counter-intuitive, is weaker. It allows that\nthere may be more to the existence of objects in space than our\nrepresenting them, and it allows that there may be aspects or\nproperties of objects that they possess independently of how we\nrepresent them. We may call it “qualified phenomenalism”.\nIn discussing the debate about Kant’s alleged phenomenalism, and\nKant’s own responses to the Feder-Garve review, it will help to\nhave these distinctions in mind.\n2.3 Kant Strikes Back\n\nKant’s was apoplectic that Feder and Garve had, apparently, not\nmade any serious attempt to even understand the Critique, or\nto present its contents accurately to their readers. He penned a\nresponse to the review, published as an appendix to the\nProlegomena. In the appendix, and in the text of the\nProlegomena itself, Kant explains what he sees as clear\ndifferences between his own view and Berkeley’s. First, Kant\nidentifies idealism as the doctrine that\n\n\nall cognition through the senses and experience is nothing but sheer\nillusion, and there is truth only in the ideas of pure understanding\nand reason (Ak. 4:374)\n\n\nand points out that, in this sense, his view is not idealism at all\nbecause the Critique consistently maintains that bodies exist\nin space and that we have immediate (non-inferential) knowledge of\n them.[11]\nSecondly, Kant points out that his idealism is merely\nformal: he has argued only that the form of objects\nis due to our minds, not their matter (cf. Kant’s Dec.\n4 1792 letter to J.S. Beck (Ak. 11:395)). While the form-matter\ndistinction in Kant’s philosophy is a complex matter in its own\nright, Kant’s point seems to be that the matter of\nexperience, the sensory content that is perceptually and conceptually\nstructured by space and time, and the categories, respectively, is not\ngenerated by the mind itself, but is produced in our minds through\naffection by mind-independent objects, things in themselves (see,\nhowever,\n section 3.4\n for some reasons to be suspicious of the doctrine of “noumenal\naffection”). As he would write several years later in response\nto Eberhard, the Critique \n\n\nposits this ground of the matter of sensory representations not once\nagain in things, as objects of the senses, but in something\nsuper-sensible, which grounds the latter, and of which we can\nhave no cognition. (Discovery, Ak. 8:205) \n\n\nThus, Kant can claim that only the form of experience is\nmind-dependent, not its matter; the matter of experience depends upon\na source outside of the\n mind.[12]\n\nHowever, Kant’s attempts to distance himself from Berkeley may\nnot cut as deep as he seems to think. Regarding the first point,\nKant’s definition of idealism in the Appendix (quoted above)\ndoes not apply to Berkeley. Nor is it clear that his definition in the\nbody of the Prolegomena does either:\n\n\nthe claim that there are none other than thinking beings; the other\nthings that we believe we perceive in intuition are only\nrepresentations in thinking beings, to which in fact no object\nexisting outside these beings corresponds. (Ak. 4:289)\n\n\nOne of the main points of Berkeley’s philosophical project is to\ndefend the existence of bodies in space, while denying what he takes\nto be a philosophical misinterpretation of what this existence amounts\nto: the existence of non-thinking substances. Berkeley does not deny\nthat bodies exist; he claims that bodies cannot exist without minds to\nperceive them, something that Kant himself also seems to accept (see\nthe texts quoted in the previous section). In fact, Berkeley\nconstantly contends that his theory is the only way to avoid what Kant\ncalls “problematic” idealism: we do not know whether\nbodies exist (Treatise on the Principles of Human Knowledge,\nPart I, § 1, 6, 18, 20, 22–24, 34–38). That Kant\nwould describe Berkeley as an idealist in this sense (what he\nelsewhere designates a “dogmatic idealist”) raises the\nsuspicion that has misread\n Berkeley.[13]\n Since the misinterpretation of Berkeley as holding that sense\nperception is illusory and that bodies do not exist was widespread in\nGermany in the eighteenth-century (again, see Beiser 2002), it is\nquite possible that Kant shares it. It may be that Kant is more\nsimilar to Berkeley than he realizes because he is not familiar with\nBerkeley’s actual theory.\n\nNor does another point Kant makes—that Kant’s idealism\nconcerns merely the form and not the matter of\nexperience—constitute a clear difference from Berkeley. Berkeley\ndoes not claim that human spirits are the causes of their own ideas;\nhe claims that God acts on human spirits, causing us to perceive an\ninternally and inter-subjectively consistent world of ideas. Since\nKant’s official doctrine in the Critique seems to\nrequire agnosticism about the ultimate nature of the things in\nthemselves that causally affect us in experience, it is compatible\nwith what he says that the noumenal cause of experience is God\nhimself.\n\nKant’s argument might be that the matter of experience (its\nsensory content) depends upon how our sensibility is affected by\nmind-independent objects, things in themselves, while the form of\nexperience is determined by our minds alone. Consequently, experience\nitself requires the existence of objects “outside” (in the\ntranscendental sense) the mind. But this would show, at most, that\nKant is not a strong phenomenalist. It does not undercut the\ninterpretation of him as a qualified phenomenalist. Nor does it\nsucceed in clearly differentiating him from Berkeley. (See the\nsupplementary article:\n Kant’s Attempts to Distance Himself from Berkeley.)\n This, of course, does not settle the issue; it may be that Kantian\nappearances are quite different than bodies, as Berkeley, or even the\nqualified phenomenalist, conceive them (for important discussions of\ntranscendental idealism in the Prolegomena see Ak.\n4:283–4, 286, 289–294, 314–315, 320).\n2.4 Changes in the B Edition\n\nKant extensively revised certain sections of the Critique for\nthe second edition (B), published in 1787. It is widely accepted that\na main consideration in these revisions was to avoid the\nmisunderstanding of his view that had led to the Feder-Garve review.\nHowever, some scholars think that, on this point, there is a\ndifference in doctrine between the A and B editions: made aware of the\nproblematic Berkeleyan consequences of the first edition, Kant\nendeavored to develop a more realistic view in the B\n Edition.[14]\n Other scholars think the difference is largely a matter of\npresentation: in the B edition, Kant highlights the more realistic\naspects of his view and downplays its phenomenalistic sides, but the\nview is basically the same (e.g., Allison 2004). The rest of this\nsection considers the main textual changes from 1781 to 1787 and\nconsiders what implications they have for the interpretation of\nKant’s idealism. Since Kant made no significant changes past the\nParalogisms chapter, sections that did not undergo substantial\nrevision will not be cited as evidence; it may be that Kant would have\nsignificantly changed those sections if he had gotten there (on the\ngeneral topic of the changes from the A to the B edition, see Erdmann\n1878).\n\nKant did, however, make one relatively minor alteration in the later\nsections (in the “Antinomies”, to be specific) that is\nrelevant to our discussion. In the wake of the Feder-Garve review,\nKant evidently felt that “transcendental” idealism may\nhave been a poor choice of\n name.[15]\n In the B Edition Kant adds a footnote to his definition of\ntranscendental idealism at A491/519 (quoted earlier) to remark that\nperhaps he should have called his position “critical\n idealism”.[16]\n The section Kant most heavily revised for the B Edition is the\n“Transcendental Deduction”, but there is not space here to\ndiscuss the complex argument of that section, or the differences\nbetween the A “Deduction” and the B\n“Deduction”.\n2.4.1 Objects as representations\n\nAs mentioned earlier, one of the main sources, both in the eighteenth\ncentury and today, for the phenomenalist reading of Kant is\nKant’s tendency to identify empirical objects with\nrepresentations. But Kant continues to do this in the B Edition, not\nonly in sections that were heavily revised for the B\n Edition[17]\n but even in passages that were added to the B Edition (e.g.,\nB164).\n2.4.2 Preface\n\nThe B Preface contains several passages, which some scholars take to\nbe inconsistent with the phenomenalist reading. They are discussed\nbelow in\n section 4.1.\n2.4.3 Transcendental Aesthetic\n\nThe main addition to the B “Transcendental Aesthetic” is\nseveral pages (B66–69) at the end of the section, which includes\nthis discussion, a clear reference to the Feder-Garve review:\n\n\nIf I say: in space and time intuition represents both outer objects as\nwell as the self-intuition of the mind as each affects our senses,\ni.e., as it appears, that is not to say that these\nobjects would be a mere illusion. […] Thus I\ndo not say that objects merely seem to exist outside\nme or that my soul only seems to be given if I assert\nthat the quality of space […] lies in my kind of intuition and\nnot in these objects in themselves. It would be my own fault if I made\nthat which I should count as appearance [Erscheinung] into\nmere illusion [bloßen Schein]. (B70–1)\n\n\nThis reiterates a theme found in the A edition and in the\nProlegomena: transcendental idealism does not entail that\nobjects in space are illusions. Later in the paragraph Kant argues\nthat, if we assume that if space and time must be “infinite\nsubstances”, if they exist at all, then we cannot blame Berkeley\nfor concluding that space, time, and bodies are mere illusions;\nempirical idealism is the right conclusion to draw from transcendental\nrealism, according to Kant. While Kant is correct in representing\nBerkeley later in this paragraph as reacting against the Newtonian\nview of space and time as “absolute” entities, he is wrong\nto characterize Berkeley as concluding that bodies are mere illusions,\nso Kant’s dissatisfaction with Berkeley’s own view is not\nevidence that he does not have a some variety of phenomenalist view of\nobjects in space. The B “Transcendental Aesthetic” adds no\nnew evidence against the phenomenalist reading.\n2.4.4 Paralogisms\n\nOne main source of the phenomenalist reading is the A Edition\n“Fourth Paralogism”, in which Kant refutes the\n“Cartesian” view that our inner states are immediately\nknown while the existence of outer objects can only be known mediately\nby inference from our inner states. The Paralogisms section was\nentirely re-written in the B Edition, and none of the four B\nParalogisms correspond precisely to the fourth A Paralogism. The A\nEdition “Fourth Paralogoism” is the source of many of the\npassages quoted above, and, historically, an important source for the\nphenomenalist interpretation. The fact that it was, effectively,\nremoved in the B Edition has led many scholars to reject the\nphenomenalist interpretation, at least with respect to the B Edition\n(with some averring that he changed his mind from the A to the B\n Edition).[18]\n A version of the A Paralogism argument that self-consciousness\nrequires knowledge of objects in space reappears as the\n“Refutation of Idealism”, added in the B Edition.\n2.4.5 Refutation of Idealism\n\nGiven its brevity, the “Refutation of Idealism”, added to\nthe “Postulates of empirical thinking in general” in the B\nEdition, is, line for line, one of the most thoroughly commented upon\npassages in all of Kant’s\n writings.[19]\n Kant’s argument, very briefly, is that the existence of objects\nin space outside me (“empirically external” objects) is a\ncondition on the possibility of my being conscious of the determinate\ntemporal relations of my inner states. Consequently, it is impossible\nto be a self-conscious subject without there existing objects in space\noutside of me, and in being conscious of the temporal relations of my\ninner states I am immediately conscious of the existence of these\n objects.[20]\n The problem of “problematic idealism”—how can I\ninfer the existence of objects outside of me on the basis of my\nimmediate knowledge of my inner states?—is based on a false\npremise.\n\nNothing about this conclusion, or how Kant argues for it, is prima\nfacie incompatible with a qualified phenomenalist reading of\ntranscendental idealism, or even a strong phenomenalist\n one.[21]\n It may be incompatible with “identity” phenomenalism,\nsince Kant argues that self-consciousness requires the existence of\npermanent objects in space, yet there is no permanent representation\nin the mind (B278). If objects just are representations, it follows\nthat none of them are\n permanent.[22]\n At B274 Kant makes it clear that the “idealism” that he\nintends to refute is idealism as he defined it in the\nProlegomena and the “Fourth A Paralogism”: the\nclaim that objects in space do not exist (dogmatic idealism) or at\nleast that we do not know whether they exist (problematic idealism).\nThe sense of idealism that is at issue in the phenomenalist\nreading—empirical objects exist, and exist in virtue of the\ncontents of experience—is not, apparently, addressed here. On an\nextreme phenomenalist reading, all there is to the existence of\nempirical objects in space is our having appropriately unified\nexperiences of them. The phenomenalist can interpret Kant’s\nargument in the “Refutation” as an argument that\nconsciousness of the temporal relations of my inner states requires\nthat these inner states constitute appropriately unified experiences.\nConsequently, self-consciousness requires the existence of objects in\nspace (spatially) outside\n me.[23]\n,\n[24]\n2.4.6 General note to the principles\n\nIn the B Edition Kant added a “General Note” to the\n“Principles of Experience”, which some have read as ruling\nout the phenomenalist reading, especially the long passage from B291\nto 294 (excerpted here):\n\n\nThis entire remark is of great importance, not only in order to\nconfirm our preceding refutation of idealism, but, even more, when we\ncome to talk of self-cognition form mere inner\nconsciousness and the determination of our nature without the\nassistance of outer empirical intuition, to indicate to us the limits\nof the possibility of such a cognition. (B293–4)\n\n\nOnce again, this is a case of Kant emphasizing that his view is not\nidealist in the specific sense of idealism we have seen so\nfar—denying either that objects exist in space or that we\ncan know that they do. His point is that even understanding our most\nbasic a priori concepts, the categories, requires applying\nthem to outer objects in space. The remark about\n“self-cognition” at the end is a reminder that inner\nawareness is dependent upon outer experience; it does not address\nwhether empirical objects exist (partly or wholly) in virtue of the\ncontents of experience.\n2.4.7 Phenomena and noumena\n\nKant extensively revised the section entitled “On the grounds of\nthe distinction of all objects into phenomena and noumena” in\nthe B Edition. However, since that section concerns the Kantian notion\nof “noumena”, discussion of it is reserved until\n §6,\n which is devoted to that notion, its relation to the “thing in\nitself”, and the related notion of the “transcendental\nobject”.\n3. Kant as a Phenomenalist\n\nSo far, we have seen the prima facie evidence for the\nphenomenalist interpretation of Kant, made famous by Feder-Garve, and\nKant’s own attempts to distance himself from their accusations.\nHowever, we also distinguished three different kinds of phenomenalism:\nidentity phenomenalism, strong phenomenalism, and qualified\nphenomenalism. This section explores the interpretation of Kant as\nqualified phenomenalist, and explores how a defender of this\ninterpretation might answer some of the standard objections to the\nphenomenalist reading.\n3.1 Appearances = representations?\n\nWhile the identity phenomenalist interpretation has found few\ndefenders among contemporary readers (Guyer 1987: 333–336 is a\nnotable exception; for critical discussion, see Allison 2004:\n8–9), it is worth asking why exactly we should reject the\nprima facie meaning of the numerous passages in which Kant\nequates appearances with representations.\n\nPerhaps the best reason to reject the identity phenomenalist\ninterpretation is that it is incompatible with many of the very texts\nthat are used to motivate it (there is also the lingering problem of\nwhether it is compatible with the “Refutation of\nIdealism”; see\n section 2.4.\n and part IV of Guyer 1987). In many of the texts in which Kant\nidentifies appearances with (a species of) representations, he also\nclaims that representations are representations of\nappearances, i.e., that representations are representations of\nobjects, appearances. For instance,\n\n\n[…] external objects (bodies) are merely appearances, hence\nalso nothing other than a species of my representations, whose objects\nare something only through these representations, but are nothing\nseparated from them. (A370–1)\n\neverything intuited in space or in time, hence all objects of an\nexperience possible for us, are nothing but appearances, i.e., mere\nrepresentations, which, as they are represented, as extended beings or\nseries of alterations, have outside our thoughts no existence grounded\nin itself (A490–1/B518–9; Allison (2004: 36) attempts to\nexplain away the apparently phenomenalist implications of this\npassage)\n\n\nIn both passages, Kant describes appearances as representations but\nalso as objects of representation. If this is correct, then\nKant thinks that the sense in which an appearance is a\nrepresentation is compatible with it being the object of a\nrepresentation. For instance, the sense in which this table\n“is” a representation is compatible with it being the\nobject of my perception of it. Assuming that the\nrepresentations that empirical objects “are” are not\nalways self-representational (e.g., the table is not identical to a\ntable-ish visual perception that also represents itself), it follows\nthat the objects cannot be identical to our representations of them.\nFor instance, my visual perception of this table cannot be\nthis table, because my visual perception does not (presumably)\nrepresent itself. To make the identity phenomenalist view consistent\nwith the very texts that motivate it, we need to “double”\nour representations: a visual perception of the table and then the\nrepresentation that the table is. But what could that representation\nbe? It must be present when and only when the table exists (because\nthey are identical), and my perception of the table must be\nintentionally directed at it. While this is not conclusive,\nit is evidence that the identity phenomenalist interpretation should\nbe abandoned.\n\nIs there any way to free Kant from the apparent consequences of his\ntendency to identify appearances with representations of them? One\nstandard strategy is to say that Kant is simply being sloppy: he means\nthat appearances are the objects of our representations, not that they\nliterally are those\n representations.[25]\n However, the passages in question occur throughout the\nCritique, in both editions, and they remain after Feder-Garve\npointed out their apparently phenomenalist implications. On the other\nhand, their persistence in the B Edition suggests that they do not,\nand never were intended to, commit Kant to a form of identity\nphenomenalism. How could Kant claim Feder-Garve had misunderstood him\nif he had identified appearances with representations? This suggests\nthat another reading is possible, but does not tell us what it is.\n\nOne strategy would be to claim that Kant does not mean the\n“is” of identity, but the “is” of grounding.\nSometimes, apparent claims of identity are really claims about\ngrounding relations. For instance, if I say “pain is C-fiber\nfiring” I might mean the type-identity thesis that the state of\nbeing in pain is the state of C-fiber firing. But I might also mean\nthat all there is to pain is C-fiber firing, that if one is in pain it\nis in virtue of C-fiber firing, or that C-fiber firing non-causally\ngrounds the state of being in pain. On this view, in claiming that\nappearances are representations, Kant is claiming that the\ncontents of representations ground the existence and empirical\nproperties of appearances.\n\nBut this is not the plain meaning of the relevant passages. At A371\nKant claims that appearances are a species (Art) of\nrepresentations; while “is” can be interpreted in a number\nof ways (e.g., the “is” of constitution), it is hard to\ninterpret “As are a species of Bs” in\nany other way than: every A is a B, which means\nevery A is identical to a B (namely, itself). While\nthere may be something to the “grounding” interpretation\nof these passages, there are good reasons to think these texts have\nnot been explained (or explained away).\n\nA third alternative, proposed by Wilfred Sellars, and which may\nultimately face the same problem, relies on the Cartesian distinction\nbetween the formal and objective reality of representations (in\nCartesian terminology,\n ideas).[26]\n The objective reality of an idea is the representational character of\nthe idea, its character as a representation with a certain content.\nConsequently, we can talk about the object of an idea without assuming\nthat there is an object “external” to the idea; to talk of\nthe “internal” object of the idea is just to talk about\nthat idea’s objective reality. For instance, we can coherently\ntalk about God without presupposing that God exists\n“outside” our idea of him; this God-talk is to be\nunderstood as talk about our idea of God in its objective realty,\ni.e., to talk about the content of our God-idea. Translating this back\ninto Kant, we might take his claims that appearances are\nrepresentations as claims to the effect that appearances are\nrepresentations considered in their objective reality, or, in\nother words, that talking about appearances, objects of\nrepresentations, is just talking about representations and their\ncontents.\n\nThere are at least two problems with this strategy, however. For one,\nit is arguably no less a distortion of the plain letter of the text\nthan the other interpretations. If Kant meant that appearances are\nrepresentations considered with respect to their objective\nreality why didn’t he simply say that, rather than stating\nthat they are a species of representations? Secondly, it is\nfar from clear that, on Kant’s view, talk about\nappearances is equivalent to talk about the objective reality\nof representations. Kant may not be attempting a semantic analysis of\nappearances in terms of representations. To many readers, it has\nseemed more plausible to read Kant as claiming that appearances are\ngrounded (non-semantically) in representations and their\nobjective reality (content). So this proposal may collapse into the\nprevious one.\n3.2 Qualified phenomenalism\n\nKant repeatedly claims that our representations alone do not ground\nthe existence of their objects. At A92/B125 he writes that\n“representation in itself does not produce its objects in so far\nas existence is concerned” and in a 1792 letter to J.S. Beck he\ndismissed the Feder-Garve interpretation with one line: \n\n\nI speak of ideality in respect of the form of representation,\nwhile they construe it as ideality in respect of the matter,\ni.e., ideality of the object and its existence. (Ak. 11:395)\n\n\nThe first passage could be taken to mean that the existence of\nempirical objects is not wholly grounded in the contents of\nour experience; something else must be added. The second passage could\nbe taken to mean that Feder and Garve misattributed to him the\nopposite view: that all there is to the existence of an object in\nspace is our having mental states with a certain content. But all this\nshows is that strong phenomenalism is not Kant’s view.\nIt leaves open the possibility that he accepts qualified\nphenomenalism: the existence of objects in space is grounded\npartially, and their core physical properties are grounded wholly, in\nthe contents of our representations of them.\n\nThe first question to be answered is, what, in addition to the\ncontents of our representations, grounds the existence of empirical\nobjects? The natural answer, for the qualified phenomenalist, is that\nthere must be things in themselves that appear as these objects. Kant\nrepeatedly insists that it is a conceptual truth that appearances are\nappearances of something that is not itself an appearance, a thing in\nitself (e.g., A251–2, Bxxvi–xxvii, B306, B307, and Ak.\n4:314–5). On the qualified phenomenalist reading, this means\nthat the existence of an appearance requires (a) a representation of\nan object, and (b) a thing in itself that appears as that object. A\nfully developed qualified phenomenalist reading would require saying\nprecisely what it means for a thing in itself to appear as an\nempirical object (an object of experience), but for reasons of space\nonly a sketch of an answer can be given here. At the minimum, the\nqualified phenomenalist should require that the thing in itself\ncausally affect the experiencing subject, and that the sensory content\nthus produced be involved in the experience of the object. Some\nscholars have suggested that the properties of appearances are\nstructurally isomorphic to the properties of things in themselves, but\nthat idea will not be further pursued here (e.g., Findlay 1981:\n92–93; see also Van Cleve 1999: 155–162).\n\nThe qualified phenomenalist also owes us an answer to the question,\nwhich are the representations whose content partly grounds the\nexistence of empirical objects and wholly grounds their core physical\nproperties? The natural answer is “experience”, so the\nqualified phenomenalist owes us an interpretation of what Kant means\nby “experience”, what its content is, and how it grounds\n(partly) the existence and (wholly) empirical properties of\n appearances.[27]\n We have already seen that, for familiar reasons, Kant cannot ground\nthe existence of empirical objects in our mere perceptions of them:\nsometimes we misperceive objects, objects exist while unperceived, and\nthere are objects we cannot ever directly perceive.\n\nThere have been few worked-out phenomenalist interpretations of Kant\nin the secondary literature. An outline of one such reading is\npresented in what follows in order to present the reader with some\nmore determinate idea of what a qualified phenomenalist reading might\nlook like and why\n (section 3.3)\n some of the classic objections to phenomenalist interpretations may\nbe less devastating than they are sometimes presented. But this is not\nmeant to give the impression that this is the only plausible\nphenomenalist reading of Kant.\n\nThe qualified phenomenalist grounds the existence of objects (partly)\nand their core physical properties (wholly) in the content of\nexperience. But this requires a conception of experience on which it\nis not identical to any individual subject’s perceptual\nepisodes; otherwise, objects will have contradictory properties if,\nfor instance, I see the tower as round and you see it as square. Kant\ndistinguishes experience from perception in the A\n“Deduction”, writing:\n\n\nThere is only one experience, in which all\nperceptions are represented as in thoroughgoing and lawlike connection\n[…] If one speaks of different experiences, they are only so\nmany perceptions insofar as they belong to one and the same universal\nexperience. (A110).\n\n\nIn this sense of experience (“universal experience”) there\nis only one experience. It may also be that, inter-subjectively, there\nis only one universal experience as well: my perceptions and your\nperceptions are only “experiences” to the extent that they\ncohere with the one universal experience. Kant, in this passage, does\nnot tell us much about what universal experience is, or what its\ncontents are. He does tell us that it is composed from perceptions,\nthat it has an a priori form (space, time, and categories),\nand that the perceptions that constitute it are in\n“thoroughgoing and lawlike connection”.\n\nElsewhere, he sheds further light on the coherence relation that\ndefines universal experience:\n\n\nIn space and time, however, the empirical truth of appearances is\nsatisfactorily secured, and sufficiently distinguished from its\nkinship with dreams, if both are correctly and thoroughly connected up\naccording to empirical laws in one experience. Accordingly, the\nobjects of experience are never given in themselves, but only in\nexperience, and they do not exist at all outside it. (A493/B521)\n\n\nPerception Pn coheres with perceptions\nP1 through Pn−1\nto the extent that the causal laws observed in P1\nthrough Pn−1 are observed in\nPn. This gives us reason to exclude\nhallucinatory perceptions from universal experience: hallucinatory\nperceptions involve apparent violations of the causal laws that are\nobserved to hold in our “waking” perceptions, so they do\nnot cohere with those other perceptions.\n\nWe know a priori something very general about the form of\nuniversal experience, of course: it will be spatiotemporal and the\nprinciples of experience (applications of the categories) will hold in\nit. But that does not determine the determinate a posteriori\ncontent of universal experience, and the idea of a qualified\nphenomenalist analysis of empirical objects is to hold that their\nexistence and empirical properties are (partly and wholly,\nrespectively) grounded in that fully determinate a posteriori\ncontent. So we might begin with the following analysis:\n\n(Experience) Universal experience consists in the largest\ninternally coherent subset of perceptions that obeys the principles of\nexperience. A subset of perceptions is internally coherent to the\ndegree to which causal regularities hold among its contents.\n\nOn a qualified phenomenalist reading of Kant, this might be taken as\nthe set of representations whose content grounds objects. However,\nthere are at least two problems with this analysis of universal\nexperience:\n\n(i)\n Unperceived objects. Kant holds that there are\nspatiotemporal objects we cannot perceive. This by itself would pose a\nproblem for the proposed definition of universal experience, since, on\nthe qualified phenomenalist view, that definition entails that there\ncannot be unperceived spatiotemporal objects. But Kant further claims\nthat we can experience unperceivable objects through\nperceiving their effects and inferring their existence from causal\nlaws. So the definition of universal experience needs to be refined\n(A226/B273; Langton (1998: 186–190).\n (ii) \n Secondary qualities. As we discussed above in the\nsection on Kant’s empirical realism, Kant distinguishes between\nthe properties spatiotemporal objects actually have “in\nthemselves” and those they merely appear to have in sense\nperception. He has a basically Lockean distinction between primary and\nsecondary qualities at the empirical level. Since we perceive objects\nas having secondary qualities, the definition of universal experience\ngiven above, combined with the qualified phenomenalist analysis,\nentails that empirical objects have secondary qualities. We need to\nfurther refine our definition of universal experience to eliminate\nsecondary qualities from the empirical properties of objects.\n\n\nWe need to refine the conception of experience so as to include\nunperceived objects and exclude secondary qualities. This might push\nus towards a more “scientistic” conception of universal\nexperience, on which experience is something like the ideal scientific\ntheory of objects in space and\n time.[28]\n The form of that theory is a priori determinable from the\nforms of experience: it will represent persisting substances in a 3-D\nEuclidean space obeying universal causal laws and in simultaneous\nmutual interaction. However, the determinate a posteriori\ncontent of that theory will be grounded in the perceptions subjects\nactually have.\n\nHere is a sketch of a conception of universal experience that the\nqualified phenomenalist might accept:\n\n(Experience) Universal experience is the maximally unified\nand lawful representation of objects in space and time that is\ncompatible with the a priori forms of experience and\njustified by the totality of subjects’ perceptual states, or the\nconjunction of such representations if there is no unique such\n representation.[29]\n\nTo fully develop such a view, a lot more would have to be said about\nexactly how the content of experience is grounded in, and justified\nby, the contents of subjects’ perceptual states, but this gloss\nis enough to give us a sense of what a developed phenomenalist reading\nof Kant might look like.\n3.3 Criticisms of Phenomenalist Readings\n\nSince the Feder-Garve objection to Kant has been around almost as long\nas the Critique itself, many objections to broadly\nphenomenalist readings of Kant’s idealism have accumulated.\nPerhaps the most comprehensive list of such objections is given by\nAllais (2004). They include:\n\n “Kant’s claim that his notion of appearance\nimplies that there is something that appears”. We have already\ndiscussed how the qualified phenomenalist can accommodate this\npoint.\n “Empirically real objects and the space they\ninhabit are public”. Allais seems to assume that, on a\nphenomenalist analysis of objects in space, objects are\n“private”, meaning the objects each subject perceives are\nconstituted by sense data of that subject, which, by definition,\ncannot be perceived by other subjects. But the qualified phenomenalist\nconception of universal experience sketched above is explicitly\n“non-private” in this sense; it is based on the\nperceptions of all subjects.\n “Kant’s distinction between primary and secondary\nqualities”. However, the qualified phenomenalist can claim that\nwhile our perceptions represent objects as having secondary qualities,\nthe best scientific theory justified by the totality of those\nperceptions (universal experience) does not represent them as having\nthose properties, because there is a better theory available: objects\ndo not possess such properties but do possess powers to cause us to\nperceive them as having such properties. There is, in principle, no\nbarrier to a qualified phenomenalist allowing the distinction between\nprimary and secondary qualities.\n “Kant’s realism about the unobservable entities of\ntheoretical science”. Kant is a scientific realist, in that he\naccepts the existence of unobservable entities posited by our best\nphysical theories (magnetic matter, Newtonian “lamellae”).\nAllais thinks this is incompatible with a phenomenalist reading, but\nit is compatible with the conception of universal experience developed\nin the previous section. If universal experience has the content of\nthe scientific theory best justified by our perceptions, then\nuniversal experience can represent unobservable (=unperceivable)\nobjects (cf. Allison (2004: 46)) who also objects that phenomenalism\nis incompatible with Kant’s empirical realism).\n “Empirically real objects exist through time and\nunperceived, and are in causal relations”. The fact that\nempirically real objects exist through time while unperceived might be\nthought to pose a problem for phenomenalism, although it should be\nremembered that Berkeley (at least on some readings) is a\nphenomenalist and yet accepts that objects exist while unperceived\n(although he denies that they stand in causal relations). So it\nisn’t clear why Allais think this is incompatible with\nphenomenalism. And it clearly is compatible with the conception of\nuniversal experience developed in the previous section: experience\nrepresents objects as existing through time and unperceived, because a\ntheory that represents them as existing only when perceived would be\nfar less unified and lawful.\n “We do not know what ideas are in themselves”.\nAllais’s idea seems to be that the phenomenalist is committed to\ngrounding empirical objects not in “empirical ideas”\n(temporally ordered mental states available in conscious\nintrospection) but in “noumenal ideas” (the non-temporal\nstates of the subject in itself). But it is unclear why; the\nphenomenalist conception of experience developed in the previous\nsection explicitly grounds the a posteriori content of\nuniversal experience in “empirical” ideas, the totality of\nsubjects’\n perceptions.[30]\n\n\nAllais appears to have conflated phenomenalist readings of Kant in\ngeneral with the “strong” phenomenalism (or even identity\nphenomenalism) discussed in\n section 2,\n and one, moreover, that identifies experience with mere\nperception.\n3.4 The Problem of Things in Themselves\n\nNo discussion of Kant’s transcendental idealism would be\ncomplete without a discussion of F.H. Jacobi’s famous objection\nto the critique:\n\n\nwithout the presupposition of the [thing in itself] I cannot enter the\n[critical] system, and with that presupposition I cannot remain in it.\n(Jacobi, Werke, vol. II, p. 304)\n\n\nJacobi is referring to a number of quite serious problems for\nKant’s transcendental idealist theory. They do not disappear on\nother interpretations, but they are especially serious for the\ntraditional phenomenalist reading. Unlike the problems we discussed\nearlier, however, which were specifically problems for the\nphenomenalist analysis of appearances, these problems, as\nJacobi indicates, concern the thing in itself, and the relation\nbetween things in themselves and appearances.\n3.4.1 The Unknowability of Things in Themselves\n\nKant is committed to both of the following theses:\n\n(Existence) There are things in themselves.\n\n(Humility) We know nothing about things in themselves.\n\nWhile these are not, strictly speaking, incompatible, they are in\ntension, for Humility appears to remove any warrant Kant\nmight have for asserting Existence.\n\nBut it gets worse for the traditional view. Kant does not merely claim\nthat things in themselves exist, he also asserts that,\n\n(Non-spatiality) Things in themselves are not in space and\ntime.\n\n(Affection) Things in themselves causally affect\n us.[31]\n\nMany of Kant’s early readers concluded that Kant’s\nphilosophy is inconsistent: he claims that we cannot know the very\nassertions he makes about things in themselves. Kant’s own\ntheory renders itself\n unknowable.[32]\n\nIt would be over-hasty to suggest that each of these three\nproblems—how to square Humility, with Non-Spatiality, Affection,\nand Existence—are on a par. Since Non-spatiality makes only a\nnegative claim, it may be easier to make it consistent with Humility.\nFor instance, at B149 Kant writes:\n\n\nit is not yet a genuine cognition if I merely indicate what the\nintuition of the object is not, without being able to say\nwhat is then contained in it.\n\n\nThis suggests that, while Kant’s usually unqualified statements\nof our ignorance of things in themselves (they are “not cognized\nat all” A30/B45), his considered view might be more qualified:\nwe know nothing of the positive properties of things in\n themselves.[33]\n But Affection looks especially difficult to square with\nHumility (see Hogan 2009 and Stang 2013).\n3.4.2 Things in themselves as causes\n\nThe issue of things in themselves affecting us raises another\nproblem for Kant’s theory, for Kant also argues that categories\nlike cause-effect cannot be meaningfully applied to things in\nthemselves. Without an intuition “[the category] has no sense,\nand is entirely empty of content” (A239/B298). Since things in\nthemselves cannot be intuited, categories (including\ncause-effect) have no sense or content when applied to things\nin themselves. Jacobi and others thought this was yet another\ninconsistency in Kant’s philosophy: he denies that categories\ncan be applied to things in themselves, but then he applies the\ncategory cause-effect to them!\n\nHowever, one has to be careful in interpreting Kant’s denial of\n“sense” or “meaning” to categories as applied\nto things in themselves. It is tempting to read this as meaning that\nthe thought of things in themselves falling under categories is\nliterally nonsense, but there is textual evidence that Kant is making\na weaker point: thinking of things in themselves under the categories\nhas no cognitive sense, i.e., in making such judgments we do\nnot cognize anything. For instance,\n\n\n[…] the categories are not restricted in\nthinking by the conditions of our sensible intuition,\nbut have an unbounded field, and only the cognition\nof objects that we think, the determination of the object, requires\nintuition; in the absence of the latter, the thought of the object can\nstill have its true and useful consequences for the\nuse of reason […]\n (B166n)[34]\n\n\nWe can think of any objects whatsoever using the categories. In fact,\nthis is unavoidable; the categories are the most basic concepts of\nobjects in general, so we cannot think about anything whatsoever\nwithout using some categories to do so. But in thinking about the\nthings in themselves using categories we do not thereby (a)\nknow that there are things in themselves falling under the categories\nor (b) even that it is possible for there to be things in\nthemselves falling under the categories. The strongest form of\nJacobi’s objection—that Kant’s view entails that the\ncategories cannot be applied, even in thought, to things in\nthemselves—may rest on a misunderstanding (cf. Van Cleve 1999:\n137; Adams 1997: 820–1). This still leaves, though, the pressing\nproblem of how, given Kant’s Humility doctrine, he could have\nany epistemic warrant for making the various substantive claims he\ndoes about things in themselves (Existence, Non-spatiality,\nAffection).\n3.4.3 The Problem of Affection\n\nJacobi raises yet another problem about Kant’s theory of\nexperience. He notes Kant’s definition of sensibility as the\ncapacity “to receive representations through the manner in which\nwe are affected by objects” (A19/B33) and poses a dilemma: are\nthe objects that affect our sensibility appearances or things in\nthemselves? They cannot be things in themselves, Jacobi argues,\nbecause that would involve applying the categories to things in\nthemselves. And they cannot be appearances, because appearances exist\nin virtue of the very experiences they are (allegedly) causing. He\nconcludes that Kant’s system is inconsistent (Jacobi,\nWerke, vol. II, 291–310; Fichte raises the same\nobjection in the Second Introduction to the\nWissenschaftslehre; cf. Fichte, Werke I, 488).\n\nWe have already discussed the argument of the first horn of\nJacobi’s dilemma: we can think but not know that things\nin themselves causally affect us. But what about the second horn? Hans\nVaihinger concisely explains Jacobi’s argument:\n\n\nOr one understands by affecting objects the objects in space; but\nsince these are only appearances according to Kant, and thus our\nrepresentations, one falls into the contradiction that the same\nappearances, which we first have on the basis of affection, should be\nthe source of that very affection. (Vaihinger 1881: vol. 2, p. 53)\n\n\n“First” here does not refer to temporal priority, but to\nmetaphysical priority: if p is true in virtue of q,\nthen q is “prior” to p. Jacobi and\nVaihinger assume that appearances exist in virtue of the contents of\nour experience of them:\n\n(Trans. Idealism) If x is an appearance, then\nx exists in virtue of the fact that subjects experience\nx.\n\nIf we are empirically affected, though, it follows that:\n\n(Empirical affection) For some x, x is one\nof the causes of subjects’ experience of x.\n\nFor instance, this computer is one of the causes of my current\nexperience of it. But these assumptions are inconsistent if we assume\nthe following plausible principle:\n\n(Exclusion) If x exists in virtue of the fact that\np, then x cannot be even a partial cause of the fact\nthat p.\n\nIntuitively, this principle says that no object can be even a partial\ncause of the very fact in virtue of which it exists; if it were, it\nwould be a partial cause of its own existence. In the context of\nKant’s theory of experience, it means that appearances cannot\n“reach back” and cause the very experiences in virtue of\nwhich they exist. From the 1780s until today, many have taken this\nproblem to be fatal to Kant’s theory of\n experience.[35]\n4. The “Dual Aspect” View\n\nBecause the phenomenalist interpretation of transcendental idealism\nheld such sway, not only among Kant’s contemporaries, but for\ngenerations of German philosophers as well, these problems for the\nphenomenalist construal of transcendental idealism were taken to be\nevidence that Kant’s view itself is\n inconsistent.[36]\n In the twentieth century, the phenomenalist (or\n“Berkeleyan”) interpretation of transcendental idealism is\nassociated with P.F. Strawson, whose massively influential (1966)\nargued that, for many of the reasons we have seen, transcendental\nidealism was a blunder on Kant’s part (Strawson 1966: 16,\n38–42, 253–73). However, Strawson claimed, the core\narguments of the Critique do not in fact rely on it and can\nbe reconstructed independently of it.\n\nIn the 1960s and 1970s a group of scholars, in some cases in direct\nopposition to Strawson, developed a non-phenomenalist,\nanti-metaphysical reading of transcendental idealism, the “dual\naspect”\n view.[37]\n These scholars took the textbook problems for phenomenalism\n(especially, the problem of affection) as evidence that this was the\nwrong interpretation of Kant’s position to begin with. They\nsought to rescue transcendental idealism from what they took to be the\nphenomenalist misconstrual, defend its philosophical cogency from its\ndetractors, and show, contra Strawson, that the central arguments of\nthe Critique do rely on transcendental idealism. This was as\nmuch a philosophical defense of Kantian transcendental idealism as it\nwas an interpretive-exegetical project.\n\nThey developed what has become known as the “dual aspect”\nview. They argue that many of the classic problems for the\nphenomenalist reading (e.g., affection) arise because it was\nmistakenly assumed that appearances and things in themselves are\ndistinct kinds of objects. They argued instead that the\nappearance/thing in itself distinction is not an ontological\ndistinction between two kinds of objects, but an adverbial distinction\nbetween two different perspectives or stances we can take on one and\nthe same set of objects: we can consider them as they appear, or as\nthey are “in themselves”.\n4.1 One Object, Not Two\n\nIn numerous passages, Kant describes the appearance/thing in itself\ndistinction, not as a distinction between two different objects, but\nas a distinction between two ways of considering one and the same\nobject. For instance,\n\n\n[…] the same objects can be considered from two different\nsides, on the one side as objects of the senses and\nthe understanding for experience, and on the other\nside as objects that are merely thought at most for isolated\nreason striving beyond the bounds of experience. (Bxviii–Bxix,\nnote)\n\n[…] the reservation must well be noted that even if we cannot\ncognize these same objects as things in themselves, we are lat least\nable to think of them as things in themselves.\n (Bxxvi)[38]\n\n\nThe general characteristic of such passages is that they use the same\nchain of pronouns to refer both to appearances and things in\nthemselves. This strongly suggests that one and the same\nobject can be an appearance and a thing in itself, or, to put it\nanother way, the distinction between appearance and thing in itself is\nnot a distinction between two or more objects, but a distinction\nbetween two different aspects of, or ways of considering, one and the\nsame object. One and the same object can be considered as it\nappears to us in experience, or as it is in itself.\nConsidered in the former way, the object must conform to our a\npriori intuitional forms, so it is in space and time. Considered\nin the other way, the object may not be in space and time. Some\n“dual aspect” readers cite the increased frequency of such\npassages in the Prolegomena and the B Edition as evidence\nthat Kant, realizing that his distinction between two aspects of\nobjects was being conflated with a distinction between two kinds of\nobjects, sought to remedy this interpretation by emphasizing precisely\nthis point. Prauss (1974) notes that, in most cases, Kant uses the\nexpression “Dinge [Sachen, Objecte,\nGegenstände] an sich selbst” rather than\nthe shorter form “Dinge an sich”. He argues that\n“an sich selbst” functions as an adverb to modify\nan implicit attitude verb like “to consider”\n[betrachten]. He concludes that the dominant use of these\nexpressions is as a short-hand for “things considered as they\nare in themselves” (Prauss 1974: 14–15).\n\nDifferent scholars understand this distinction in different ways. The\nmain difference is between epistemological and metaphysical\n“dual aspect” interpretations (Allison 2004: 52). On the\nepistemological reading, the distinction between appearances and\nthings in themselves is simply a distinction in the standpoint from\nwhich we consider them. We can consider objects as objects of\nknowledge for discursive spatiotemporal cognizers like us, in which\ncase we are considering objects as appearances. Or we can\nabstract from our particular cognitive conditions and consider objects\nmerely as objects for a mind in general, in which case we are\nconsidering them as things in themselves. It is crucial to\nthe epistemological reading that there is no sense in which the\n“transcendental” perspective on objects as things in\nthemselves gets at how objects “are in themselves”.\nThe point of Kant’s transcendental idealism, epistemological\ninterpreters stress, is to get away from the incoherent idea of a\n“view from nowhere” in which we could know objects as they\n“really are in\n themselves”.[39]\n\nBy contrast, metaphysical “dual aspect” interpreters take\nthe distinction to carry more metaphysical weight. They interpret the\nappearance/thing in itself distinction as a metaphysical distinction\nbetween two different classes of properties had by objects, for\ninstance, their relational properties and their intrinsic properties.\nAppearances are objects qua bearers of “empirical\nproperties” (e.g., relational properties) while things in\nthemselves are the very same objects qua bearers of\n“noumenal” or “non-empirical” properties\n(e.g., intrinsic properties). The next two sub-sections explore the\nepistemological interpretation of Henry Allison. The remainder of the\nsections concerns metaphysical “dual aspect” readings,\nfocusing on the widely discussed interpretation of Langton (1998).\n4.2 Allison’s “Epistemic” reading\n\nIn modern Kant scholarship, the epistemic reading was first put\nforward by Gerold Prauss, Henry Allison, and Graham Bird. Since\nAllison’s work was the most influential among English language\nscholars, and most likely to be known to readers, this discussion will\nfocus on the interpretation of transcendental idealism in Allison\n(1983) and the revised and enlarged second edition (2004).\nAllison’s writings contain several distinct (and not obviously\nequivalent) formulations of transcendental idealism. This section\nconcentrates on reconstructing what is arguably the “core”\nof Allison’s reading: his interpretation of appearances and\nthings in themselves, and his reconstruction of the argument for the\nnon-spatiality of things in themselves.\n\nThe core insight of Kant’s epistemology in general, and his\ntranscendental idealism in particular, according to Allison, is the\nprinciple that we possess a discursive intellect. A\ndiscursive intellect is one that passively receives representations of\nparticular objects (intuitions) and then spontaneously subsumes those\nintuited objects under general concepts; consequently, a discursive\nintellect must possess a sensory faculty (through which it receives\nsensory data and intuits individual objects) and a conceptual faculty\n(through which it forms general concepts and applies them to objects)\n(A50–1/B74–5). By contrast, an intuitive intellect brings\ninto existence its objects merely by representing them, and thus has\nno need to receive representations of objects from\n outside.[40]\n But that is not all there is to the discursive nature of our\nintellect, Allison\n argues.[41]\n Kant’s key insight is that our sensible faculty has its own\nepistemic conditions.\n\nAn “epistemic condition” is Allison’s term for a\nrepresentation we must apply to objects in order to cognize them\n(Allison 2004: 11, 14). Space and time are epistemic conditions, as\nare the categories. If E is an epistemic condition then\nnecessarily if we know an object O, in knowing it we\nrepresent it using\n E.[42]\n Some of our epistemic conditions follow from the general fact that we\nare discursive cognizers (the categories) and some follow from the\nmore specific fact that we cognize objects given to us in space and\ntime. Representing objects using the categories is an epistemic\ncondition for any discursive intellect, i.e., for any intellect that\nmust conceptualize objects given passively in sensory\n intuition.[43]\n So space and time are epistemic conditions of spatiotemporal\ndiscursive cognition of objects, while the categories are epistemic\nconditions of discursive cognition of objects in general. Any\ndiscursive intellect must conceptualize sensibly intuited objects\nusing the categories, whether or not those objects are intuited in\nspace and time, or some other intuitional forms (Allison 2004:\n17).\n\nThis grounds a distinction between two ways of considering the objects\nof our cognition. When we consider objects qua objects of our\ncognition, we consider them as falling under the relevant epistemic\nconditions. If E is an epistemic condition of cognition of\nobjects, then objects must fall under E (i.e., be accurately\nrepresented by E); otherwise, in representing them with\nE, I would not be cognizing objects but misrepresenting them.\nMy representation of objects with E would be an illusion, the\nvery conclusion Kant wants to avoid with respect to space and objects\nrepresented in space. This means that if E is an epistemic\ncondition of the specific kind of discursive cognition of objects that\nwe have, then E correctly represents those objects. So, if\nspace and time are the forms of our intuition, it follows that\nempirical objects qua objects of the kind of discursive\nintellect we have, are in space and time. But if we do not consider\nobjects qua objects of our specific kind of discursive\nintellect, but qua objects of discursive intellect in\ngeneral, we can no longer assume that our specific intuitional\nepistemic condition applies to them. The more general epistemic\nconditions of all discursive cognition (in Kant’s view, the\ncategories) still apply to objects under this more abstract\nperspective, however. So we can say that objects qua\nappearing (objects of spatiotemporal discursive cognition) are in\nspace, but qua things in themselves (objects of discursive\ncognition in general) they are not in space. This, in a nutshell, is\nAllison’s reconstruction of the argument for the non-spatiality\nof things in\n themselves.[44]\n While it is legitimate to consider objects as things in themselves\nusing the categories, we do not thereby cognize them. This\nfollows trivially from the fact that space and time are epistemic\nconditions for us: without representing objects in space and time, we\ncan think of objects using the categories, but those thoughts are not\ncognitions (Allison 2004: 18).\n4.3. Problems with the Epistemic reading\n\nAllison’s interpretation has been challenged on a number of\npoints by other scholars. This section discusses a number of such\nobjections.\n4.3.1 The Triviality Objection\n\nSome scholars object that Allison’s reading of the\nnon-spatiality thesis, and the thesis that things in themselves are\nuncognizable by us, renders it a tautology, a trivial logical\nconsequence of\n definitions.[45]\n We may represent the definition of “thing in itself” talk\n(on Allison’s interpretation) as follows:\n\n(1)\nThings in themselves are F if and only if objects of\ndiscursive cognition as such are F.\n\n\nAnd the non-spatiality thesis as:\n\n(C)\n ∴ ~(Things in themselves are spatial)\n\n\nBut now the reader can see that to derive (C) from (1) we would need a\nfurther premise:\n\n(2)\n ~(Objects, considered, as objects of discursive cognition in\ngeneral, are spatial)\n\n\nBut this claim is not a definition, for it is equivalent to the claim\nthat the concept of a discursive cognition is more general than the\nconcept of a spatiotemporal discursive cognition, i.e., that a\nnon-spatial discursive intellect is conceivable. So although the\nnon-spatiality of things in themselves follows almost immediately from\nvery general truths, on Allison’s reconstruction, it is\nnot correct to say that it is a tautology, or that it is true by\ndefinition.\n\nNor is it true that the uncognizability of things in themselves is\ntrivial, on Allison’s reading. For that principle only follows\nfrom the claim that there are sensible epistemic conditions, space and\ntime. And that, on Allison’s reconstruction, is the key insight\nthat sets Kant apart from both his rationalist and empiricist\npredecessors. Thus, while Allison’s interpretation makes the\nargument for the non-spatiality of things in themselves relatively\neasy, it does not render the conclusion trivial.\n4.3.2 Epistemic conditions entail realism\n\nRobinson (1994) raises a quite general objection to Allison’s\nnotion of an epistemic condition, namely, an object must satisfy (fall\nunder) a representation if that representation is to constitute an\nepistemic condition for that object (Robinson 1994 is a response,\nmainly, to Allison 1983 and 1987). So in the claim that “objects\nqua appearances” or “objects considered\nwith our epistemic conditions” the qualification\n“qua appearances” or “considered with our\nepistemic conditions” is otiose. If space is an epistemic\ncondition of outer objects for us then this entails that objects we\ncognize are in space simpliciter. The claim that objects are\nspatial because of or in virtue of space being an\nepistemic condition for them entails either that these\nobjects exist in virtue of our representations of them (which results\nin phenomenalism) or it entails that they are spatial in\nvirtue of our representing them but would not be spatial otherwise. In\nthe latter case, we are not cognizing them in representing\nthem as spatial; we are misrepresenting them (Robinson 1994:\n420–22).\n\nAllison might reply to this objection by pointing out that it\nimplicitly assumes that the claim empirical objects are in\nspace is coherent independently of specifying a perspective on\nthose objects. In the terminology of Allison (2004) it is committed to\n“transcendental realism” (see the supplementary entry:\n Allison on Transcendental Realism and Transcendental Idealism).\n If this were Allison’s reply to the objection, then it would\nshow that the coherence of transcendental idealism, on Allison’s\nreconstruction, rests on the premise that there is no coherent sense\nto questions about how objects are independent of any perspective on\nthem. This is important, because it is not always clear that\nAllison’s reconstruction does depend on this premise, and it is\nnot clear where Kant argues for such a conclusion.\n4.3.3 Abstraction\n\nOne influential objection focuses on the role that\n“abstracting” from our spatiotemporal intuition plays in\nAllison’s reconstruction. Van Cleve puts it somewhat\nfacetiously:\n\n\nHow is it possible for the properties of a thing to be vary according\nto how it is considered? As I sit typing these words, I have shoes on\nmy feet. But consider me apart from my shoes: so considered, am I\nbarefoot? I am inclined to say no; consider me how you will, I am not\nnow barefoot. (Van Cleve 1999:\n 8)[46]\n\n\nTo put the point less facetiously: if the object o,\nconsidered as an object of spatiotemporal cognition, is spatial, then\nwhen we ascend to a more general perspective, in which we consider\no as the object of discursive cognition in general, then we\nshould not say that o is non-spatial; we should\nmerely not judge that it is spatial. To take an example of\nGuyer’s, when we consider a job applicant we might want to\nignore or abstract from their race or sex; in doing so we would not\njudge that they are race-less or sex-less, but merely refrain from\nrepresenting them as having a determinate race or sex.\n\nAllison can interpret Kant’s claim that things in themselves are\nnot spatial in either of two ways:\n\n(1)\nThings in themselves are non-spatial.\n(2)\nIt is not the case that things in themselves are spatial.\n\n\nWhile ordinarily we might take these claims to be equivalent, when\ntalking about “things in themselves” we can distinguish\nthem, because “things in themselves” talk is talk about\nobjects from a certain perspective (i.e., considered as objects of\ndiscursive intellect in general). In particular, (1) and (2) are\nequivalent to:\n\n(1*)\nObjects, considered as objects of discursive cognition in general,\nare non-spatial.\n(2*)\n~(Objects, considered as objects of discursive cognition in\ngeneral, are spatial)\n\n\nAllison’s critics assume that he opts for (1) (and its analysis,\n(1*)) and object, rightly, that this is the wrong conclusion to draw\nfrom the fact that discursive cognition is a more general notion than\nspatiotemporal discursive cognition. (Just as it would be wrong to\nconclude that the job candidate, considered in abstraction from his\nsex and race, is sex-less and race-less.) While it is sometimes\nunclear from Allison’s texts which analysis he opts for, the\ncharitable reading is that he accepts (2*).\n\nIf this is correct, Allison’s reasoning can be reconstructed as\nfollows:\n\n(3)\nThings in themselves are F = objects, considered as objects\nof discursive intellect in general, are F.\n (4)\nIt is conceivable that there is an object of discursive intellect\nthat is not an object of spatiotemporal discursive intellect, i.e.,\nspatiotemporal discursive intellect is a special case of discursive\nintellect.\n (5)\n ∴ ~(objects, considered as objects of discursive intellect\nin general, are spatial)\n (6)\n ∴ ~(Things in themselves are spatial)\n\n\nBut (6) must be distinguished from:\n\n(7)\n Things in themselves are non-spatial.\n\n\nOn this reconstruction of Allison, Kant is committed to (6) but not to\n(7).\n\nWe saw earlier that Allison’s critics assume that he must intend\n(7) rather than (6). They do so because they think that it is clear\nfrom the texts that Kant claims (7) and not the weaker (6). But that\nis not so clear from the texts, for instance:\n\n\nSpace represents no property at all of any things in themselves nor\nany relation of them each other, i.e., no determination of them that\nattaches to objects themselves and that would remain even if one were\nto abstract from all subjective conditions of intuition. (A26/B42)\n\n\nPrima facie it is compatible with the letter of these texts\nthat Kant is claiming (6) rather than (7). Note that (6) is not the\nclaim that we cannot know, or justifiably assert that things in\nthemselves are spatial. It is the claim that it is false to\nsay that they are spatial.\n\nThe stronger objection to Allison’s view, as reconstructed here,\nis that (6) is too weak to be a plausible reconstruction of\nKant’s non-spatiality thesis. Given Allison’s\nunderstanding of “thing in itself” talk (premise (3)) all\nthat (6) requires is that there is some conceivable perspective on\nobjects that is more general than the specifically spatiotemporal form\nof cognition that we have (premise (4)). It does not even require that\nit is possible that there be discursive intellects with a\nnon-spatiotemporal form of cognition. All it requires is that the\nconcept of discursive cognition as such is more general than the\nconcept of spatiotemporal discursive cognition, which, trivially, it\nis. (6) is compatible with it being impossible for there to be\nnon-spatiotemporal discursive cognition because all objects are\nnecessarily spatiotemporal and hence can only be cognized\nspatiotemporally. In other words (6) is compatible with transcendental\nrealism about space and time (as Kant defines that term)!\n\nOne potential Allisonian response to this objection would be that it\nimplicitly presupposes that there is a way objects are independently\nof any perspective on them. In particular, the claim that (6) is\ncompatible with all possible objects being spatial, and thus cannot be\na reconstruction of the non-spatiality thesis, begs the question by\nassuming that that state-of-affairs does not need to relativized to a\nperspective, e.g., all possible objects as objects for a certain\nkind of mind are spatial. Thus, the coherence of Allison’s\nreconstruction again depends upon the claim that there is no\n“standpoint-independent” perspective on reality.\n4.3.4 Things in themselves as more fundamental than appearances\n\nOne major textual hurdle for Allison’s “epistemic”\nreading of transcendental idealism is the various passages in which\nKant describes things in themselves as more fundamental, more\nontologically basic, than appearances, or describes things in\nthemselves as the grounds of appearances. Allison appears to\nreverse this relation of dependence because things in themselves\n(objects from the relatively abstract transcendental perspective) are\nan abstraction from appearances (objects from the more determinate\nempirical perspective). Ameriks (1992: 334) raises this objection, and\nAllison (2004: 45) replies to it. Allison does not offer an alternate\nreading of the relevant texts, but instead points out that, in the\ncase where the relative fundamentality of the phenomenal and noumenal\nis most important to Kant, namely the freedom of the\n will,[47]\n Ameriks’ objection assumes, once again, that there is some fact\nof the matter as to whether we are free or not, and this is to be\nsettled by determining whether we are free at the most fundamental\nlevel (the noumenal level, on Ameriks’ reading). Once again, the\ncoherence of Allison’s reading rests on the premise that there\nis no standpoint-independent perspective on reality (see the\nsupplementary entry:\n Allison on Transcendental Realism and Transcendental Idealism).\n4.4 Metaphysical “Dual Aspect” Readings\n\nOne prominent strand in recent scholarship on Kant’s\ntranscendental idealism has been the development of quite\nsophisticated interpretations that try to retain the original insight\nthat the appearance/thing in itself distinction is not a distinction\nbetween two different kinds of objects, while abandoning Allison-style\n“epistemic” readings. These interpretations take the\ndistinction to be a metaphysical one between two different sets of\nproperties had by one and the same set of objects. These metaphysical\n“dual aspect” interpretations differ in exactly how they\nunderstand the distinction between these different sets of properties\n(see also Allais (2004, 2006, 2007, 2015); Rosefeldt (2007, 2013);\nMcDaniel (ms); and Marshall (2013)).\n\nPerhaps the most influential metaphysical but non-phenomenalist\ninterpretation of Kant’s idealism has been Langton (1998).\nLangton begins by pointing out that Kant thinks we are genuinely\nmissing out on something in not knowing things in themselves, and this\nsense of “epistemic loss” is incompatible with\nAllison’s reading. As we saw in the previous section,\n“Allisonian humility” is apparently compatible with it\nbeing impossible that there are non-spatiotemporal objects and our\nforms of intuition being the only possible such forms. This\nloses Kant’s sense that we are genuinely cognitively deprived,\nthat there is something about the world of which we are irremediably\nignorant (Allison responds to Langton’s criticism in 2004:\n9–11).\n\nHaving rejected Allison’s epistemic reading, Langton goes on to\ndiscuss a familiar tension between two of the central doctrines of\nKant’s transcendental idealism:\n\n(Existence) Things in themselves exist.\n\n(Humility) We cannot know anything about things in\nthemselves.\n\nLangton’s solution to this, one of the oldest problems of Kant\nscholarship, is to interpret things in themselves as substances with\nintrinsic properties, and talk of “phenomena” as talk of\nthe extrinsic properties of those substances (things in themselves).\nSo in general,\n\n(1)\n Things in themselves are F = F is among the\nintrinsic properties of substances\n(2) \n Appearances are F = F is among the extrinsic\nproperties of substances\n\n\nIn particular, this allows Langton to interpret (Existence)\nand (Humility) as:\n\n(Existence*) Substances with intrinsic properties exist.\n\n(Humility*) We cannot cognize the intrinsic properties of\nsubstances.\n\nThe apparent tension between these doctrines has vanished.\nLangton’s interpretation also allows her to explain why the\napparent tension between Humility and\n\n(Non-spatiality) Things in themselves are not spatial.\n\nis merely apparent because, on her reading (Non-spatiality) is\nequivalent to:\n\n(Non-spatiality*) Being spatial is not an intrinsic property\nof substances.\n\nThis is compatible with (Humility*) because we can know it merely by\nknowing that being spatial is an extrinsic property in general (thus\nis not an intrinsic property had by substances), and to know this we\ndo not need to know anything about the intrinsic properties of\nsubstances. Langton thus offers a consistent, elegant interpretation\nof transcendental idealism that solves several of the oldest and\nhardest problems in the interpretation of Kant’s\n philosophy.[48]\n4.5 Problems for Langton’s reading\n\nMuch of the critical reaction to Langton (1998) has focused on her\nreconstruction of Kant’s argument for Humility, but that will\nnot be discussed further here; even if Langton is wrong about how Kant\nproves Humility, she may still be right about what Humility\nmeans and thus what the appearance/thing in itself\ndistinction means (e.g., Allais 2006).\n4.5.1 Textual evidence\n\nThere is substantial textual evidence that Kantian appearances have\nonly extrinsic properties. For instance, this passage from the\n“Aesthetic”:\n\n\neverything in our cognition that belongs to intuition (with the\nexception, therefore, of the feeling of pleasure and displeasure and\nthe will, which are not cognitions at all) contains nothing but mere\nrelations, of places in one intuition (extension), alteration of\nplaces (motion), and laws in accordance with which this alteration is\ndetermined (moving forces). (B67)\n\n\nThis, and other passages Langton cites, support attributing to Kant\nthese theses:\n\n(1)\nAppearances (phenomena) have only relational properties. (B67,\nA265/B321, A285/B341)\n (2)\n When we conceive of an object purely intellectually we conceive\nof it as having intrinsic properties. (A274/B330, A277/B333)\n (3)\n In knowing relational properties we do not know things as they\nare in themselves. (B67)\n\n\nHowever, in none of these passages does Kant directly state the\nstronger claim that:\n\n(4)\n Phenomena are extrinsic properties of substances with intrinsic\nproperties.\n\n\nIt is clear that Kant holds (1)–(3) and less clear that he holds\n(4). The textual case for (4) is weaker, though not absent. It is\npresented below, in\n sub-section 4.5.2.\n\nThere is a further textual problem for Langton’s interpretation,\nthough. In at least two passages Kant denies that we can know\nrelations between things in themselves:\n\n\nSpace represents no property at all of any things in themselves nor\nany relation of them each other […] (A26/B42)\n\n[…] the things that we intuit are not in themselves what we\nintuit them to be, nor are their relations so constituted in\nthemselves as they appear to us. (A42/B59)\n\n\nIn these passages Kant claims that space is not a relation among\nthings in themselves, nor are relations among objects “in\nthemselves” as they appear to us. This is hard to square with\nLangton’s reading. However, in her (2011) Langton responds to\nthese textual objections by suggesting that the relations among things\nin themselves of which Kant speaks are internal relations,\nrelations that supervene on the intrinsic properties of\n substances.[49]\n4.5.2 Phenomena substantiata\n\nOne source of resistance to Langton’s interpretation is that\nKant argues at length in the “First Analogy of Experience”\nthat the category substance can be applied to phenomena: \n\n\nall appearances contain that which persists (substance) as the object\nitself, and that which can change as its mere determination, i.e., a\nway in which the object exists. (A182) \n\n\nThis would appear to contradict Langton’s assertion that things\nin themselves are substances, while appearances (phenomena) are merely\nproperties of substances.\n\nLangton is well aware that Kant accepts “phenomenal\nsubstances” and endeavors to explain this within her picture. In\ndoing so, she compiles a compelling set of textual evidence for her\nalternative reading of the “First Analogy” and the meaning\nof substance for phenomena. She begins by pointing to\nAlexander Gottlieb Baumgarten’s notion of a phaenomena\nsubstantiata, a “substantiated phenomenon”, by which\nBaumgarten means a property that we treat as a substance by\npredicating other properties of it (Baumgarten, Metaphysica\n§193 (Ak. 18:150); quoted at Langton 1998: 53). She argues\nconvincingly that Kant’s fundamental notion of a substance is of\na being with properties but which is not a property of anything\n else.[50]\n Only such beings, of which other things are predicated (inhere in)\nbut which are not predicated of (inhere in) anything else, are truly\nsubstances. However, the properties that are predicated of substances\ncan also be spoken of as substances, because they themselves have\nproperties (which might also have properties, and so\n on).[51]\n These are substantiated phenomena.\n\nThe question is, are Kantian empirical substances genuine substances\nor mere substantiated phenomena? Do the objects subsumed under the\nempirical schema of substance (absolute persistence in time) also fall\nunder the pure category of substance (subjects of inherence which\ninhere in nothing further)? If not, then they must be predicated of\nsome more fundamental substance, which drives Langton to conclude that\nappearances (phenomena) are properties of substances (she does point\nout the hesitant terms in which Kant describes phenomena as substances\n(1998, 57). Langton assembles an impressive array of evidence that\nKant does regard empirical “substances” as phaenomena\nsubstantiata (e.g., A265/B321, A277/B333, Refl. 4421, 4422, 5294,\nAk. 28:209). However, in context it is not clear whether Kant has the\nBaumgarten notion in mind, or whether this Latin expression means\nsimply: phenomenal substance. So it is unclear, textually, whether\nphenomena are predicated of noumena in the\n Critique.[52]\n\nIn his metaphysics lectures, and other texts, Kant consistently\ndistinguishes the inherence relation (which holds between a property\nand an entity of which it is predicated) from the relation of\nground to consequence:\n\n\nThe world “substance” is clearly ambiguous. One translates\nit through the notion of self-sufficiency, i.e., the possibility of\nexisting without a ground, but also as the possibility of existing\nwithout inhering [in something else]. (Ak. 28:1308; Ak. 8:225n,\n28:562, 28:779, 28:638–9, 28:1041, 28:1104f)\n\n\nKant, following Baumgarten, criticizes Spinoza’s definition of\nsubstance as “what is in itself and conceived through\nitself” (Ethics Id3) because it conflates two notions:\n(i) a being that is not grounded in, or caused by, anything more\nfundamental, and (ii) a being that does not inhere in anything more\nfundamental. The second is the correct definition of substance,\naccording to Kant; by conflating these two notions, Spinoza forecloses\nthe following possibility: there are substances distinct from God\n(they are not modes of God), all of which are grounded in God.\n\nTo bring this back to Langton, we need to distinguish two different\nclaims:\n\n(i) \n Phenomena are extrinsic properties of substances (things in\nthemselves). They inhere in things in themselves.\n(ii) \n Phenomena exist (at least partly) in virtue of the extrinsic\nproperties of substances (things in themselves). They are grounded in\nthings in themselves.\n\n\nLangton attributes (i) to Kant, but her textual case appears to\nsupport (ii), at\n best.[53]\n This is significant, because (ii) is far less controversial. For\ninstance, it is in principle acceptable to the qualified\nphenomenalist, because the extrinsic properties of things in\nthemselves include (presumably) properties like causing us to have\nsuch and such experience.\n5. One Object or Two?\n\nSince Karl Ameriks’ classic survey of the literature, Ameriks\n(1982), it has been customary to divide interpretations of\ntranscendental idealism into “two object” readings and\n“one object” readings. By contrast, this article has been\norganized around the distinction between phenomenalist readings, and\nnon-phenomenalist dual-aspect readings. This section explores the\nrelation between the “one object”/“two object”\ndistinction and the phenomenalist/non-phenomenalist distinction among\ndifferent interpretations of Kant’s idealism.\n\nThe distinction between “one object” and “two\nobject” readings comes down to the question of whether\nappearances, in general, are numerically identical to things in\nthemselves: “one object” readers claim they are (Adickes\n1924: 20, 27; Allais 2004: 657; Langton 1998: 13; Westphal 1968: 120),\nand \"two object\" readers deny\n this.[54]\n Whether all things in themselves are numerically identical to\nappearances is not at issue, for most one object readers will admit\nthere could be things that never appear to us (cf. B306, where Kant\nseems to admit as much) (although it might be misleading to call them\nthings “in themselves” since they never appear to us, so\nwe never consider them as they are “in themselves”). The\nqualification “in general” is necessary because some\n“two object” readers will admit that some appearances are\nalso things in themselves; e.g., many “two object” readers\nwill admit that, in the case of the self, there is a single object, a\nthing in itself, that appears to itself as a spatiotemporal object (on\nthis issue, see Adams (1997), Aquila (1979), and Ameriks’\ndiscussion of Aquila in his 1982).\n\nHowever, the characterization of these views as “one\nobject” and “two object” is unfortunate, because it\nis not a commitment of “two object” readings that, for\neach appearance, there is one and only one thing in itself that\nappears as that object. The “two object” interpreter can\nhold that each appearance is the appearance of an indefinite plurality\nof things in themselves. Nor is the other standard moniker, “one\nworld” versus “two world”, helpful, either, for\n“world” is a technical term in Kant’s metaphysics\nand has a very specific\n meaning.[55]\n One can coherently hold a “non-identity” interpretation\nwhile denying that appearances in space and time constitute a\n“world” at\n all.[56]\n\nThis section explores how the identity/non-identity debate relates to\nthe non-phenomenalist/phenomenalist debate. They have often been\nconflated by equating the “two world” interpretation\n(non-identity) with the phenomenalist one, and conversely, by equating\nthe “one world” interpretation (identity) with the\nanti-phenomenalist one. There are grounds to think, however, that\nthese are distinct debates.\n Section 5.1\n examines whether claims about the numerical identity or non-identity\nof appearances and things in themselves are meaningful at all, and, if\nthey are, what warrant we could have for making them within\nKant’s theoretical philosophy.\n Section 5.2\n looks at whether paradigmatically anti-phenomenalist interpretations\n(e.g., Langton 1998) can be understood as non-identity views.\n Section 5.3\n examines some reasons for thinking that the phenomenalist\ninterpretation is compatible with the “identity” of\nappearances and things in themselves.\n Section 5.4\n considers the interpretive landscape in light of these\n results.[57]\n5.1 Identity between appearances and things in themselves\n\nAs Henry Allison and others have pointed out, it is not clear that\nthere is any content to the question of whether an appearance is\nnumerically identical to a thing in itself, outside of moral\n contexts.[58]\n It is relatively clear that in the context of his moral philosophy,\nKant wants to assert that one and the same object, a rational agent,\ncan be considered as an appearance and as a thing in itself.\nConsidered as an appearance, a rational agent is subject to conditions\nof experience (space, time, and the categories). Considered as a thing\nin itself, a rational agent can at least consistently be thought of as\nfree (because independent of the deterministic causal order of space\nand time), while practical reason gives us warrant for positively\nasserting that the agent is free. Kant typically expresses this\nsolution to the problem of freedom and determinism in terms of the\nnumerical identity of the appearance of the agent and the agent as\nthing in itself (e.g., Ak. 5: 105, 114). Practical reason gives both\ncontent and warrant to the assertion of numerical identity:\ncontent, because the assertion of numerical identity means\nthat one and the same noumenal agent is the cause of and therefore\nresponsible for the actions of an empirical rational agent\nover time, and warrant, because this assumption of the unity\nof a noumenal agent over time is a presupposition of our ordinary\nmoral cognition of blame and praise. But neither of these seem to hold\nin the theoretical use of reason. It is not clear that within the\ntheoretical use of reason we can give any content to the\nclaim of the numerical identity (or distinctness) of appearances and\nthings in themselves, nor any warrant for asserting or denying\n it.[59]\n\nIn defense of the contentfulness of these identity claims, one might\nargue that the term “appearance” and “thing in\nitself” each has an extension, a set of objects, and the\nquestion of identity is perfectly well-formed: do these two sets have\na non-empty intersection? If so, at least one appearance is identical\nto a thing in itself. But this argument begs the question by assuming\nthat the question of whether the set of appearances and the set of\nthing in themselves has an intersection is itself well-formed; whether\nthis is the case is precisely what is at issue.\n\nWhile many interpreters (notably Adams 1997: 822) think that we can\nhave no warrant for asserting the identity or non-identity of\nappearances and things in themselves in general, and thus think the\nidentity/non-identity debate (at least in theoretical contexts)\nconcerns something about which Kant must be agnostic, there are those\nwho disagree (Stang 2014; cf. Walker 2010). In texts quoted earlier,\nKant claims that appearances would cease to exist if there were not\nminds to experience them. On the assumption that this is not true of\nthings in themselves, consider the following argument:\n\n(P1) \n For any x, if x is an appearance, x\nwould not exist if there were no minds to experience it.\n (P2) \n For any x, if x is a thing in itself,\nx would exist if there were no minds to experience it.\n (C) \n For any x, if x is an appearance, x is\nnot a thing in itself.\n\n\nThis argument purports to show that, since appearances and things in\nthemselves have different modal properties, they must be distinct.\nSince (P1) and (P2) are claims Kant makes in the context of his\ntheoretical philosophy, this argument provides warrant for denying\nidentity on purely theoretical grounds.\n5.2 Langton and non-identity\n\nLangton’s view can be interpreted as either an identity reading\nor a non-identity reading. The difference is somewhat subtle, but it\nhas important consequences. On the identity version of Langton (1998),\nto talk about things in themselves is to predicate intrinsic\nproperties of substances, while to talk about phenomena is to\npredicate extrinsic properties of those very substances. On\nthe non-identity version of Langton (1998), phenomena are numerically\nidentical to those extrinsic properties. This would be a non-identity\nreading because substances are not identical to their properties\n(either extrinsic or intrinsic). By contrast, on the identity reading,\nan expression for a phenomenon refers to a substance. The\ndifference between these readings can be illustrated by how they give\ntruth-conditions for the judgment that some phenomenon x has\nproperty F:\n\n(Identity) x has F = F is among\nthe extrinsic properties of x\n\n(Non-Identity) x has F = x, an\nextrinsic property of some substance y (≠x), has\nF\n\nWhile Langton initially explains her view in a way that suggests an\nidentity reading, she in fact opts for a non-identity reading, for\ngood reason. Firstly, on the identity reading Kant would have to\nidentify subjects of predication in empirical judgments with\nsubstances. This is problematic because it would bring substances into\nthe world of space and time. For instance, if I can make a judgment\nabout this table, then it would be a judgment about the extrinsic\nproperties of this table, and this table would be a substance with\nintrinsic properties (although being a table would, presumably, not be\none of them). Alternately, if we identify the table as a collection of\nextrinsic properties of substances, then we can go on to predicate\nfurther properties of the table, without having to identify the\nsubstance or substances of which the table is ultimately\n predicated.[60]\n5.3 Phenomenalist Dual Aspect Readings\n\nSome scholars have defended what might initially seem like a\ncontradiction in terms: a phenomenalist “one object”\n(identity) interpretation of appearances and things in\n themselves.[61]\n On such a view, the appearance and the thing in itself are one and\nthe same object, but considered with respect to different properties:\nthe properties we experience the object as having, and the properties\nit has. On this interpretation, Kant is qualified phenomenalist\nbecause he holds that:\n\n(PhenomenalismP) The core physical properties of\nobjects in space are grounded in the contents of our experience of\nthem.\n\nHis attitude to:\n\n(PhenomenalismE) The existence of objects in space\nis ground partly or wholly in the contents of our experience of\nthem.\n\ndepends upon how we read it, on this interpretation. On the one hand,\nwe can understand it either as the “de re”\nclaim\n\n(PhenomenalismE*) (x)(x is an\nobject in space ⊃ the existence of x is partly or wholly\ngrounded in our experience of x)\n\nin which case Kant would reject it, because each such object in space\nis also a thing in itself and, as such, does not depend for its\nexistence on our experience of it. On the other hand, we could\nunderstand it as the de dicto claim\n\n(PhenomenalismE**) The fact that there are objects\nin space is partly or wholly grounded in our experience of objects in\nspace.\n\nin which case Kant would accept it, because there being objects in\nspace depends upon our experiencing objects as in space.\n\nThis leads to an important exegetical point. One of the main\nmotivations for “non-identity” interpretations are\npassages in which Kant claims that appearances would not exist if\nthere were not subjects to experience them, e.g., A42/B59. This might\nbe thought to directly entail phenomenalism, for, if appearances would\nnot exist without subjects to experience them, but things in\nthemselves would, then a fortiori appearances and things in\nthemselves are distinct. This line of reasoning can be represented\nformally as (P1), (P2) and C from section 5.1. But the identity reader\ncan interpret Kant’s claim “if I were to take away the\nthinking subject, the whole corporeal world would have to\ndisappear” as meaning: without subjects to experience them,\nappearances would not exist as appearances, i.e., would not\nappear. In other words, she can reinterpret (P1) as:\n\n(P1*)\n For all x, if x is an appearance, then\nx’s existence as an appearance (=the fact that\nx exists and appears) is grounded in the contents of\nexperience.\n\n\nBut the conjunction of this and (P2) does not entail (C); they are\ncompatible with the identity reading. These passages do not\nforce the non-identity interpretation on us. (For more on\nphenomenalist identity readings see the supplementary article:\n Phenomenalist Identity Readings and the Problem of Illusion.)\n5.4 Assessing the Interpretive Issues\n\nWe have seen some reasons to think that the resolutely\nanti-phenomenalist reading of Langton (1998) and the phenomenalist\nreading can be re-interpreted as, respectively, a non-identity reading\nand an identity reading. One reaction would be to conclude that the\ninterpretive options are simply more complex than is usually\nappreciated:\n\n\n\n\nNon-Identity\nIdentity \n\nEpistemic \nMetaphysical  \n\nPhenomenalist \nAquila (1983), Van Cleve (1999), cf. section 3 \nN/A \nAdickes (1924), Westphal (1968)  \n\nAnti-phenomenalist \nAlternate version of Langton \nAllison (1983/2004), Bird (1962), Prauss (1974) \nLangton (1998), Allais (2006)  \n\n\nTable 1\n\n\nBut the distinction between the two different versions of Langton, and\nbetween the non-identity version of phenomenalism (Aquila 1983; Van\nCleve 1999) and the identity version of phenomenalism (Adickes 1924;\nWestphal 1968) is relatively recondite. It depends on the\ncontroversial assumption that assertions of identity between\nappearances and things in themselves, outside of practical contexts,\nhave a content.\n\nFurthermore, Henry Allison has recently argued that even his view is\nneutral on the identity/non-identity debate:\n\n\nalthough it is sometimes assumed that [the two-aspect reading] commits\nKant to a highly implausible one-to-one mapping of the phenomenal and\nnoumenal, I take that to be a red herring. First, it is one thing to\ndistinguish between things (taken collectively) as they are for us in\nvirtue of the sensible conditions of human cognition and as they might\nbe for some putative pure understanding, unburdened by such\nconditions, and quite another to affirm a one-to-one correspondence or\nisomorphism between the members of the two domains. (Allison 2004: 459\nnote 19; cf. Allison 1987: 168)\n\n\nAllison’s idea is that the distinction between the empirical and\nthe transcendental standpoint is a distinction between how they\nconsider objects as a whole, not how they consider particular\nobjects. The Epistemic reading is not committed to Identity, but\nneither is it committed to Non-Identity. So an Identity version of the\nEpistemic reading is possible (according to which we can consider each\nobject individually from either standpoint), as is an Epistemic\nreading that is neither an Identity nor a Non-Identity reading (on\nwhich we remain agnostic as to whether objects considered from one\nstandpoint are numerically identical to objects considered from\n another).[62]\n So we might conclude that our interpretive options are even more\nnumerous than we initially thought:\n\n\n\n\nNeither Identity nor Non-Identity\n\nNon-Identity \nIdentity  \n\nEpistemic \nMetaphysical  \n\nPhenomenalist \nN/A \nAquila (1983), Van Cleve (1999), cf. section 3 \nN/A \nAdickes (1924), Westphal (1968)  \n\nAnti-phenomenalist \nAllison (1983/2004)\nAlternate version of Langton \nBird (1962), Prauss (1974), alternate version of Allison\n(1983/2004), \nLangton (1998), Allais (2006)  \n\n\nTable 2\n\n\nBut notice we now have doubling of interpretations: identity and\nnon-identity versions of Langton (1998), identity and non-identity\nversions of phenomenalist views, and identity and “neither\nidentity nor non-identity” versions of Allison.\n\nHowever, if one thinks that claims of identity between appearances and\nthings in themselves are contentless (see section 5.1), at least\noutside of the context of practical philosophy, then the menu of\ninterpretive options will appear as:\n\n\n\nPhenomenalist \nAnti-Phenomenalist  \n\nEpistemic \nMetaphysical  \n\nAquila (1983), Van Cleve (1999), Adickes (1924), Westphal\n(1968), cf. section 3 \nAllison (1983/2004), Bird (1962), Prauss (1974) \nLangton (1998), Allais (2006)  \n\n\nTable 3\n\n\nOn such a reading, there is no substance, outside of the practical\ncontext, to the question of whether an appearance is numerically\nidentical to a thing in itself, so the identity and non-identity\nversions of, e.g., phenomenalism, are\n equivalent.[63]\n If one holds instead that these identity claims have a content but\nthat we cannot know them on theoretical grounds alone (see section\n5.1) then one will likewise see these interpretive options as so\nconstrained, because, although there is a difference in content\nbetween, say, the identity and non-identity versions of phenomenalism,\nKant must be agnostic as to which is true.\n6. Things in themselves, noumena, and the transcendental object\n\nUp to this point, we have focused primarily on the nature of Kantian\nappearances, and their relation to things in themselves, questions (a)\nand (c) from section one. However, one of the main questions that must\nbe answered in any interpretation of Kant’s transcendental\nidealism is, what are things in themselves? Obviously, different\ninterpretations will give very different answers to this question:\n\nPhenomenalist interpretations. Perhaps the best statement of\nthe phenomenalist interpretation of things in themselves is given by\nErich Adickes (1924: 14–19): things in themselves are a\nplurality of mind-independent centers of force. On this view, things\nin themselves are just what we pre-theoretically took ordinary\nspatiotemporal objects to be: objects that exist, and possess their\ncore physical properties, wholly independently of our representations\nof them, and which are (among) the causal inputs to our perceptual\nfaculties (a variant of this thought is expressed by Ameriks 2003:\n23–25).\n\nEpistemic interpretations: On the epistemic reading, things\nin themselves are simply objects considered independently of our\ndistinctively spatiotemporal form of intuition. Thus, they are objects\nconsidered as objects of a discursive cognition in general. This very\nabstract thought is not the basis of any cognition, however; it is\nmerely a reminder that space and time are epistemic conditions,\nwithout which we cannot cognize any object.\n\nMetaphysical “dual aspect” interpretations. On\nthis family of interpretations, things in themselves are objects with\na given set of properties. Different interpretations give a different\nanswer as to which set of properties constitute things “as they\nare in themselves”. On Langton’s reading, for instance,\nthings in themselves are substances with intrinsic properties.\n\nIn this section we distinguish “things in themselves” from\nother, closely related Kantian notions: noumena, and the\n“transcendental object”.\n6.1 Phenomena and noumena\n\nIn the section “On the ground of the distinction of all objects\ninto phenomena and noumena”, which he\nsubstantially revised for the B Edition, Kant reiterates his argument\nthat we cannot cognize objects beyond the bounds of possible\nexperience, and introduces a complex distinction between phenomena and\nnoumena.\n\nFortunately, it is relatively clear what phenomena are:\n“appearances to the extent that as objects they are thought in\naccordance with the unity of the categories are called\nphenomena” (A249). Earlier, in the “Aesthetic”, Kant\nhad defined appearance as: “the undetermined object of an\nempirical intuition” (A20/B34). All objects of empirical\nintuition are appearances, but only those that are “thought in\naccordance with the unity of the categories” are phenomena. For\ninstance, if I have a visual after-image or highly disunified visual\nhallucination, that perception may not represent its object as\nstanding in cause-effect relations, or being an alteration in an\nabsolutely permanent substance. These would be appearances but not\nphenomena. The objects of “universal experience”, as\ndefined in section 3, are phenomena because the categories determine\nthe a priori conceptual form; universal experience represents\nits objects under the unity of the categories.\n\nKant’s then introduces the concept of noumena:\n\n\nif, however, I suppose that there be things that are merely objects of\nthe understanding and that, nevertheless, can be given to an\nintuition, although not to sensible intuition (as coram intuiti\nintellectuali), then such things would be called noumena\n(intelligibilia). (A249)\n\n\nThe concept of a noumenon, as defined here, is the concept of an\nobject of cognition for an intellect that is not, like ours,\ndiscursive, and thus has a non-sensible form of intuition, which Kant\nhere designates “intellectual\n intuition”.[64]\n A sensible intuition is one that can only intuit objects by being\ncausally affected by them; a non-sensible intuition is one in which\nthe intuition of the object brings the object into existence. Thus,\nthe concept of a noumenon is the concept of an object that would be\ncognized by an intellect whose intuition brings its very objects into\nexistence. Clearly, we do not cognize any noumena, since to cognize an\nobject for us requires intuition and our intuition is sensible, not\nintellectual.\n\nKant then connects the concept of noumena to things in themselves:\n\n\n\nit also follows naturally from the concept of an appearance in general\nthat something must correspond to it which is not in itself\nappearance, for appearance can be nothing for itself and outside of\nour kind of representation; thus, if there is not to be a constant\ncircle, the word \"appearance\" must already indicate a relation to\nsomething the immediate representation of which is, to be sure,\nsensible, but which in itself, without this constitution of our\nsensibility (on which the form of our intuition is grounded), must be\nsomething, i.e., an object independent of sensibility. Now from this\narises the concept of a noumenon, which, however, is not at\nall positive and does not signify a determinate cognition of something\nin general, in which I abstract from all form of sensible intuition.\n(A251–2)\n\n\nThis passage begins with the familiar point that the very concept of\nappearance requires that there be something that is not appearance\nthat appears. Usually Kant makes this point using the concept\n“things in themselves” (e.g., in the Prolegomena\n(Ak. 4:314–5); cf. Bxxvi–xxvii, B306, and B307). However,\nhere he claims that this idea—that it cannot be\n“appearances all the way down”—brings with it the\nidea of noumena. This is puzzling. Why must whatever it is that appear\nto us as phenomena be conceived of as an objects of intellectual\nintuition?\n\nKant clarifies precisely this point in the B Edition by distinguishing\nbetween a positive and a negative sense of “noumena”: \n\n\nIf by a noumenon we understand a thing insofar as it is not an\nobject of our sensible intuition, because we abstract from\nthe manner of our intuition of then this is a noumenon in the\nnegative sense. But if we understand by that an\nobject of a non-sensible intuition then we assume a\nspecial kind of intuition, namely intellectual intuition, which,\nhowever, is not our own, and the possibility of which we cannot\nunderstand, and this would be the noumenon in a\npositive sense. (B307)\n\n\nNoumena in a positive sense are simply noumena as Kant originally\ndefined that notion in the A edition: objects of an intellectual\n(non-sensible) intuition. The negative concept of noumena, however, is\nsimply the concept of objects that are not spatiotemporal (not objects\nof our sensible intuition, namely space and time). But then it follows\nthat things in themselves are noumena in the negative sense,\nretrospectively clarifying the passage from the A edition quoted\nimmediately above, where Kant seems to draw from the\n“Transcendental Aesthetic” the conclusion that there are\nnoumena: the concept of appearance requires that something appears,\nand this must be a negative noumena.\n\nPutting these pieces together we can see that “things in\nthemselves” [Dinge an sich selbst] and (negative)\n“noumena” are concepts that belong to two different\ndistinctions: “thing in itself” is one half of the\nappearance/thing in itself distinction, which Kant originally defined\nat A491/B519 in terms of their existence: appearances have no\nexistence “grounded in themselves” while things in\nthemselves do. “Noumena” is one half of the distinction\nphenomena/noumena which Kant characterizes at B307 as the distinction\nbetween what can be an object of our sensible spatiotemporal intuition\nand what cannot be an object of sensible intuition. (Kant here appears\nto overlook the possibility of objects of sensible but\nnon-spatiotemporal intuition). One is a distinction in what ground the\nexistence of objects; the other is a distinction in what kinds of\nintuition can present those objects. However, we can make a connection\nbetween them: things in themselves, the objects whose existence is\n“ground in itself”, and which appear to us in space and\ntime, cannot be objects of any sensible intuition, so they are\nnegative noumena. Whether, additionally, they are also objects of an\nintuitive intellect, is a separate matter. This is a point about the\nrelations among these concepts; it holds whether or not they are\npossibly instantiated.\n6.2 The transcendental object = X\n\nIn the “Phenomena and noumena” section, Kant distinguishes\nthe concept of a noumenon from the concept of a “transcendental\nobject” (A250). This is a reference to a notion introduced in\nthe A version of the “Transcendental Deduction”: \n\n\nThe pure concept of the transcendental object (which in all of our\ncognition is really one and the same = X) is that which in all\nof our empirical concepts in general can provide relation to an\nobject, i.e., objective reality. Now this concept cannot contains any\ndeterminate intuition at all, and therefore contains nothing but that\nunity which must be encountered in a manifold of cognition insofar as\nit stands in relation to an object. (A109; cf. A104)\n\n\nThe “concept of a transcendental object” might be\nfruitfully thought of as “the transcendental concept of an\nobject”: the concept of “object” that makes\nexperience possible. Our mind’s synthesis of representations\ninto experience of objects is guided and made possible by the idea\nthat there is a way objects are that must be tracked by our\nrepresentations of them. This wholly abstract concept of “a way\nthings are” is the concept of the transcendental object =\nX, the indeterminate concept of the “target” of our\nrepresentational activity. Consequently, the concept of the\ntranscendental object must be distinct from the concept of\n“things in themselves” or “negative noumena”.\nThe concept of things in themselves is the concept of the (unknowable\nby us) objects (or aspects of objects) that appear to us the 3D world\nof space and time. They are the grounds of phenomena, while the\ntranscendental object is the very abstract idea of those objects in\nspace and time as the targets of our cognitive activity.\n\nAnother way to appreciate this distinction is to consider the\ndifference in why these notions of object (noumena, transcendental\nobject) are unknowable by us. We cannot cognize things in themselves\nbecause cognition requires intuition, and our intuition only ever\npresents appearances, not things in themselves. We cannot cognize the\ntranscendental object because the transcendental object is a purely\nschematic, general idea of empirical objectivity. Whenever we cognize\na determinate empirical object we are cognitively deploying the\ntranscendental concept of an object in general, but we are not coming\nto know anything about the object of that concept as such.\n\nThis is Kant’s point in “phenomena and noumena” when\nhe writes: \n\n\nThis transcendental object cannot even be separated from the sensible\ndata, for then nothing would remain through which it would be\nthought. It is therefore no object of cognition in itself, but only\nthe representation of appearances under the concept of an object in\ngeneral, which is determinable through the manifold of those\nappearances. (A250–1) \n\n\nThe (negative) concept of a noumenon is the concept of an object that\nis not an object of our sensible spatiotemporal intuition. But the\ntranscendental object makes no sense in abstraction from intuition,\nbecause it is merely the abstract concept that the unity of our\nintuitions must have in order to constitute experience of an object\n(cf. Allison’s classic 1968 paper).\n7. Conclusion\n\nThis article has traced the meaning of transcendental idealism,\nsometimes referred to as “critical” or\n“formal” idealism, through the text of the Critique of\nPure Reason and various interpretive controversies. Historically,\nthe main question dividing different interpretations is whether Kant\nis a phenomenalist about object in space and time and, if so, in what\nsense. The phenomenalist interpretation of Kant, dominant among\nKant’s immediate predecessors and later German idealists, was\nchallenged in twentieth century Anglophone scholarship by, among\nothers, Graham Bird, Gerold Prauss, and Henry Allison. Some later\nscholars have retained a central idea of these scholars’\nreading—that the appearance/thing in itself distinction is a\ndistinction between distinct aspects of objects, not distinct kinds of\nobjects—while jettisoning the purely epistemological\ninterpretation of Kant’s idealism. The meaning and philosophical\nsignificance of “transcendental idealism” has been debated\nby Kant’s readers since 1781, and this debate shows no sign of\nabating any time soon.\n",
    "bibliography": {
        "categories": [
            "Works of Kant",
            "Other Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Works of Kant": [
                "</h3>\n<p>\nThe standard German edition of Kant’s works is:</p>\n<ul class=\"hanging\">",
                "[Ak.] Königlichen Preußischen (later Deutschen)\nAkademie der Wissenschaften (ed.), 1900–, <em>Kants gesammelte\nSchriften</em>, Berlin: Georg Reimer (later Walter De Gruyter).\n</ul>\n<p>\nThe most authoritative English translations of Kant’s works are\nin:</p>\n<ul class=\"hanging\">",
                "Guyer, P. and A. Wood (eds.), 1992–, <em>The Cambridge\nEdition of the Works of Immanuel Kant</em>, Cambridge: Cambridge\nUniversity Press. \n</ul>\n<p>\nIndividual volumes used in the preparation of this entry are:</p>\n<ul class=\"hanging\">",
                "Allison, H. and P. Heath (eds.), 2002, <em>Theoretical Philosophy\nafter 1781</em>, Cambridge: Cambridge University Press.",
                "Guyer, P. and A. Wood (eds.), 1998, <em>Critique of Pure\nReason</em>, Cambridge: Cambridge University Press.",
                "Zweig, A. (ed.), 1999, <em>Correspondence</em>, Cambridge:\nCambridge University Press.\n</ul>\n<p>\nWe refer to certain Kantian works by the following abbreviations:</p>\n<ul class=\"hanging\">",
                "[<em>Prolegomena</em>] <em>Prolegomena to any future\nmetaphysics</em>. Translation by Gary Hatfield in <em>Theoretical\nPhilosophy after 1781</em>.",
                "[<em>On a discovery</em>] <em>On a discovery according to which\nall future critiques of reason have been rendered superfluous by a\nprevious one</em>. Translation by Henry Allison in <em>Theoretical\nPhilosophy after 1781</em>.\n</ul>\n<h3 id=\"OthePrimSour\">"
            ],
            "Other Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Fichte, J.G., 1845–1846, <em>Johann Gottlieb Fichtes\nsämtliche Werke</em>, edited by I. H. Fichte, 8 vols, Berlin:\nVeit.",
                "Jacobi, F.H., 1812, <em>Werke</em>, edited by F. Roth and F.\nKöppen, 6 vols, Leipzig: Fleischer.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Abela, P., 2002, <em>Kant’s Empirical Realism</em>, Oxford:\nOxford University Press.",
                "Adams, R., 1997, “Things in Themselves”,\n<em>Philosophy and Phenomenological Research</em>, 57:\n801–825.",
                "Adickes, E., 1924, <em>Kant und das Ding an Sich</em>, Berlin: Pan\nVerlag.",
                "–––, 1929, <em>Kants Lehre von der doppelten\nAffektion unseres Ichs als Schlüssel zu seiner\nErkenntnistheorie</em>, Verlag von J.C.B. Mohr: Tübingen.",
                "Allais, L., 2003, “Kant’s transcendental idealism and\ncontemporary anti-realism”, <em>International Journal of\nPhilosophical Studies</em>, 11: 369–392.",
                "–––, 2004, “Kant’s “One\nWorld”: Interpreting Transcendental Idealism”, <em>British\nJournal for the History of Philosophy</em>, 12: 655–684.",
                "–––, 2006, “Kant on Intrinsic Natures: a\nCritique of Langton”, <em>Philosophy and Phenomenological\nResearch</em>, 73: 143–169.",
                "–––, 2007, “Kant’s Idealism and the\nSecondary Quality Analogy”, <em>Journal of the History of\nPhilosophy</em>, 45: 459–484.",
                "–––, 2015, <em>Manifest Reality: Kant’s\nIdealism and his Realism</em>, Oxford: Oxford University Press.",
                "Allison, H., 1968, “Kant’s Concept of the\nTranscendental Object”, <em>Kant-Studien</em>, 59:\n165–186.",
                "–––, 1973, “Kant’s Critique of\nBerkeley”, <em>Journal of the History of Philosophy</em>, 11:\n43–63.",
                "–––, 1976, “The Non-spatiality of Things\nin Themselves for Kant”, <em>Journal of the History of\nPhilosophy</em>, 14: 313–321.",
                "–––, 1983, <em>Kant’s Transcendental\nIdealism</em>, New Haven: Yale University Press.",
                "–––, 1987, “Transcendental Idealism: The\nTwo Aspect View”, in Ouden and Moen (eds.), <em>New Essays on\nKant</em>, 155–178.",
                "–––, 2004, <em>Kant’s Transcendental\nIdealism</em>, New Haven: Yale University Press. Revised and Enlarged\nEdition.",
                "Ameriks, K., 1982, “Recent Work on Kant’s Theoretical\nPhilosophy”, <em>The Philosophical Quarterly</em>, 19:\n1–24.",
                "–––, 1992, “Kantian Idealism Today”,\n<em>History of Philosophy Quarterly</em>, 9: 329–342.",
                "–––, 2003, <em>Interpreting Kant’s Three\nCritiques</em>, Oxford: Oxford University Press.",
                "Aquila, R., 1979, “Things in Themselves: Intentionality and\nReality in Kant”, <em>Archiv Fur Geschichte der\nPhilosophie</em>, 61: 293–307.",
                "–––, 1983, <em>Representational Mind: A Study of\nKant’s Theory of Knowledge</em>, Bloomington: Indiana University\nPress.",
                "Beck, L.W., 1960, <em>A Commentary on Kant’s Critique of\nPractical Reason</em>, Chicago: University of Chicago Press.",
                "Beiser, F., 1987, <em>The Fate of Reason: German Philosophy\nbetween Kant and Fichte</em>, Cambridge, MA: Harvard University\nPress.",
                "–––, 2002, <em>German Idealism: The Struggle\nagainst Subjectivism, 1781–1801</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Bennett, J., 1966, <em>Kant’s Analytic</em>, Cambridge:\nCambridge University Press.",
                "Bird, G., 1962, <em>Kant’s Theory of Knowledge</em>, London:\nRoutledge &amp; Kegan Paul.",
                "–––, 2000, “Review of <em>Kantian\nHumility</em>”, <em>The Philosophical Quarterly</em>, 50:\n105–108.",
                "Chignell, A., 2010, “Causal Refutations of Idealism”,\n<em>The Philosophical Quarterly</em>, 60: 487–507.",
                "Cohen, H., 1871/1885, <em>Kants Theorie der Erfahrung</em>,\nBerlin: Dümmler. Third revised edition, 1885. Reprinted in Cohen,\n<em>Werke</em>, H. Holzhey and H. Weidebach (eds.), Hildesheim: G.\nOlms.",
                "–––, 1907, <em>Kommentar zu Immanuel Kants\nKritik der reinen Vernunft</em>, Leipizig: Meiner.",
                "Collins, A., 1999, <em>Possible Experience</em>, Berkeley and Los\nAngeles: University of California Press.",
                "Cummins, P., 1968, “Kant on Outer and Inner\nIntuition”, <em>Noûs</em>, 2: 271–292.",
                "Dicker, G., 2008, “Kant’s Refutation of\nIdealism”, <em>Noûs</em>, 42: 80–108.",
                "–––, 2011, “Kant’s Refutation of\nIdealism: a Reply to Chignell”, <em>The Philosophical\nQuarterly</em>, 61: 175–183.",
                "Dunlop, K., 2009, “The Unity of Time’s Measure:\nKant’s Reply to Locke”, <em>Philosophers’\nImprint</em>, 9: 1–31.",
                "Drexler, H., 1904, <em>Die doppelte Affektion des erkennenden\nSubjekts</em>, Beuthen o.S.: Th. Kirch.",
                "Dryer, D.P., 1966, <em>Kant’s Solution for Verification in\nMetaphysics</em>, London: Allen &amp; Unwin.",
                "Emundts, D., 2008, “Kant’s Critique of\nBerkeley’s Concept of Objectivity”, in D. Garber and B.\nLonguenesse (eds.), <em>Kant and the Early Moderns</em>, Princeton:\nPrinceton University Press.",
                "–––, 2010, “The Refutation of Idealism and\nthe Distinction between <em>Phenomena</em> and\n<em>Noumena</em>”, in P. Guyer (ed.), <em>The Cambridge\nCompanion to Kant’s Critique of Pure Reason</em>, Cambridge:\nCambridge University Press.",
                "Erdmann, B., 1878, <em>Kants Kriticismus in der ersten und in der\nzweiten Auflage der Kritik der reinen Vernunft</em>, Leipzig:\nVoss.",
                "Falkenstein, L., 1991, “Kant, Mendelssohn, Lambert, and the\nSubjectivity of Time”, <em>Journal of the History of\nPhilosophy</em>, 29: 227–251.",
                "–––, 2000, “Langton on Things in\nThemselves”, <em>Kantian Review</em>, 5: 49–64.",
                "Findlay, J.N., 1981, <em>Kant and the Transcendental Object</em>,\nOxford: Clarendon Press.",
                "Förster, E., 2012, <em>The Twenty Five Years of Philosophy: A\nSystematic Reconstruction</em>, trans. B. Bowman, Cambridge, MA:\nHarvard University Press.",
                "Gram, M., 1975, “The Myth of Double Affection”, in\nWerkmeister (ed.), <em>Reflections on Kant’s Philosophy</em>.\nUniversity of Florida Press: Gainesville.",
                "–––, 1981, “Intellectual Intuition: The\nContinuity Thesis”, <em>Journal of the History of Ideas</em>,\n42:287–304.",
                "Grier, M., 2001, <em>Kant’s Doctrine of Transcendental\nIllusion</em>, Cambridge: Cambridge University Press.",
                "Guyer, P., 1983, “Kant’s Intentions in the Refutation\nof Idealism”, <em>The Philosophical Review</em>, 92:\n329–383.",
                "–––, 1987, <em>Kant and the Claims of\nKnowledge</em>, Cambridge: Cambridge University Press.",
                "Heidegger, M. 1929. <em>Kant und das Problem der Metaphysik</em>.\nVittorio Klostermann: Frankfurt a/M.",
                "Hanna, R., 2000, “The Inner and the Outer: Kant’s\n‘Refutation’ Reconsidered”, <em>Ratio</em>, 13:\n146–174.",
                "Hogan, D., 2009a, “How to Know Unknowable Things in\nThemselves ”, <em>Noûs</em>, 43: 49–63.",
                "–––, 2009b, “Noumenal Affection”,\n<em>The Philosophical Review</em>, 4: 501–532.",
                "Kemp Smith, N., 1962, <em>A Commentary on Kant’s Critique of\nPure Reason</em>, New York: Humanities Press.",
                "Köhnke, K., 1986, <em>Entstehung und Aufstieg des\n</em>Neukantianismus: <em>die deutsche Universitatsphilosophie\nzwischen Idealismus und Positivismus</em>, Frankfurt am Main:\nSuhrkamp.",
                "Langton, R., 1998, <em>Kantian Humility</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2011, “Kant’s Phenomena:\nExtrinsic or Relational Properties? A Reply to Allais”,\n<em>Philosophy and Phenomenological Research</em>, 73:\n170–185.",
                "Marshall, C., 2013, “Kant’s Appearances and Things in\nThemselves as Qua-Objects”, <em>The Philosophical\nQuarterly</em>, 63: 520–545.",
                "Matthews, H.E., 1969, “Strawson on Transcendental\nIdealism”, <em>The Philosophical Review</em>, 19:\n204–220.",
                "McDaniel, K., Ms, “Kantian Ignorance”.",
                "Paton, H.J., 1936, <em>Kant’s Metaphysic of Experience</em>,\n2 vols., London: Allen &amp; Unwin.",
                "Patton, L., 2005, “The Critical Philosophy Renewed: The\nBridge Between Hermann Cohen’s Early Work on Kant and Later\nPhilosophy of Science”, <em>Angelaki</em>, 10:\n109–118.",
                "Prauss, G., 1974, <em>Kant und das Problem der Dinge an Sich</em>,\nBonn: Grundman.",
                "Richardson, A., 2003, “Conceiving, Experiencing, and\nConceiving Experience: Neo-Kantianism and the History of the Concept\nof Experience”, <em>Topoi</em>, 22: 55–67.",
                "Robinson, H., 1994, “Two Perspectives on Kant’s\nAppearances and Things-in-Themselves”, <em>Journal of the\nHistory of Philosophy</em>, 33: 411–441.",
                "Rosefeldt, T., 2001, “Review of <em>Kantian\nHumility</em>”, <em>Zeitschrift für philosophische\nForschung</em>, 9 (2001): 236–69.",
                "–––, 2007, “Dinge an sich und\nsekundäre Qualitäten”, in J. Stolzenberg (ed.),\n<em>Kant in der Gegenwart</em>, Berlin, New York: Walter de Gruyter,\n167–209.",
                "–––, 2013, “Subject-Dependence and\nTrendelenburg’s Gap”, in <em>Akten des XI. Internationalen\nKant-Kongresses</em>, New York and Berlin: Walter de Gruyter, vol. 2,\n755–64.",
                "Sassen, B., 2000, <em>Kant’s Early Critics</em>, Cambridge:\nCambridge University Press.",
                "Schopenhauer, A., 1938, <em>Sämtliche Werke</em>, edited by\nArthur Hubscher, Leipzig: Brockhaus.",
                "Sellars, W., 1968, <em>Science and Metaphysics: Variations on\nKantian Themes</em>, London: Routledge.",
                "Stang, N., 2012, “Kant on Complete Determination and\nInfinite Judgment”, <em>British Journal for the History of\nPhilosophy</em>, 20: 1117–1139.",
                "–––, 2013, “Freedom, Knowledge and\nAffection”, <em>Kantian Review</em>, 18(1): 96–106.",
                "–––, 2014, “The Non-Identity of\nAppearances and Things in Themselves”, <em>Noûs</em>,\n48(1): 106–136.",
                "–––, 2015, “Who’s Afraid of Double\nAffection?” <em>Philosophers’ Imprint</em>,\n15:1–28.",
                "Strawson, P.F., 1966, <em>The Bounds of Sense</em>, London:\nMethuen.",
                "Turbayne, C., 1955, “Kant’s Refutation of Dogmatic\nIdealism”, <em>Philosophical Quarterly</em>, 5:\n225–244.",
                "–––, 1969, “Kant’s Relation to\nBerkeley”, in L.W. Beck (ed.), <em>Kant Studies Today</em>, La\nSalle, IL: Open Court.",
                "Vaihinger, H., 1881/1892, <em>Commentar zur Kants Kritik der\nreinen Vernunft</em>, 2 vols., Stuttgart: W. Spemann.",
                "–––, 1884, “Zu KantsWiderlegung des\nIdealismus”, <em>Strassberger Abhandlungen zur Philosophie</em>,\nFreiburg: Mohr.",
                "Van Cleve, J., 1999, <em>Problems from Kant</em>, Oxford: Oxford\nUniversity Press.",
                "Vogel, J., 1993, “The Problem of Self-Knowledge in\nKant’s ‘Refutation of Idealism’”,\n<em>Philosophy and Phenomenological Research</em>, 53:\n875–887.",
                "Walker, R., 1985, “Idealism: Kant and Berkeley”, in J.\nFoster and H. Robinson (ed.), <em>Essays on Berkeley</em>, Oxford:\nOxford University Press.",
                "–––, 2010, “Kant on the Number of\nWorlds”,<em>British Journal for the History of Philosophy</em>,\n18: 821–843.",
                "Weldon, T.D., 1958, <em>Kant’s Critique of Pure Reason</em>,\nOxford: Clarendon Press.",
                "Westphal, M., 1968, “In Defense of the Thing in\nItself”, <em>Kant-Studien</em>, 59: 118–141.",
                "Westphal, K.R., 2000, “Kant, Hegel, and the fate of\n‘the’ Intuitive Intellect”, in S. Sedgewick (ed.),\n<em>The Reception of Kant’s Critical Philosophy</em>, Cambridge\nUniversity Press.",
                "Wilson, M., 1971, “Kant and the ‘Dogmatic Idealism of\nBerkeley”, <em>Journal of the History of Philosophy</em>, 9:\n459–475. Reprinted in Wilson (ed.), 1999, <em>Ideas and\nMechanism: Essays on Early Modern Philosophy</em>, Princeton:\nPrinceton University Press: 277–293.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"WorkKant\">Works of Kant</h3>\n<p>\nThe standard German edition of Kant’s works is:</p>\n<ul class=\"hanging\">\n<li>[Ak.] Königlichen Preußischen (later Deutschen)\nAkademie der Wissenschaften (ed.), 1900–, <em>Kants gesammelte\nSchriften</em>, Berlin: Georg Reimer (later Walter De Gruyter).</li>\n</ul>\n<p>\nThe most authoritative English translations of Kant’s works are\nin:</p>\n<ul class=\"hanging\">\n<li>Guyer, P. and A. Wood (eds.), 1992–, <em>The Cambridge\nEdition of the Works of Immanuel Kant</em>, Cambridge: Cambridge\nUniversity Press. </li>\n</ul>\n<p>\nIndividual volumes used in the preparation of this entry are:</p>\n<ul class=\"hanging\">\n<li>Allison, H. and P. Heath (eds.), 2002, <em>Theoretical Philosophy\nafter 1781</em>, Cambridge: Cambridge University Press.</li>\n<li>Guyer, P. and A. Wood (eds.), 1998, <em>Critique of Pure\nReason</em>, Cambridge: Cambridge University Press.</li>\n<li>Zweig, A. (ed.), 1999, <em>Correspondence</em>, Cambridge:\nCambridge University Press.</li>\n</ul>\n<p>\nWe refer to certain Kantian works by the following abbreviations:</p>\n<ul class=\"hanging\">\n<li> [<em>Prolegomena</em>] <em>Prolegomena to any future\nmetaphysics</em>. Translation by Gary Hatfield in <em>Theoretical\nPhilosophy after 1781</em>.</li>\n<li> [<em>On a discovery</em>] <em>On a discovery according to which\nall future critiques of reason have been rendered superfluous by a\nprevious one</em>. Translation by Henry Allison in <em>Theoretical\nPhilosophy after 1781</em>.</li>\n</ul>\n<h3 id=\"OthePrimSour\">Other Primary Sources</h3>\n<ul class=\"hanging\">\n<li>Fichte, J.G., 1845–1846, <em>Johann Gottlieb Fichtes\nsämtliche Werke</em>, edited by I. H. Fichte, 8 vols, Berlin:\nVeit.</li>\n<li>Jacobi, F.H., 1812, <em>Werke</em>, edited by F. Roth and F.\nKöppen, 6 vols, Leipzig: Fleischer.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Abela, P., 2002, <em>Kant’s Empirical Realism</em>, Oxford:\nOxford University Press.</li>\n<li>Adams, R., 1997, “Things in Themselves”,\n<em>Philosophy and Phenomenological Research</em>, 57:\n801–825.</li>\n<li>Adickes, E., 1924, <em>Kant und das Ding an Sich</em>, Berlin: Pan\nVerlag.</li>\n<li>–––, 1929, <em>Kants Lehre von der doppelten\nAffektion unseres Ichs als Schlüssel zu seiner\nErkenntnistheorie</em>, Verlag von J.C.B. Mohr: Tübingen.</li>\n<li>Allais, L., 2003, “Kant’s transcendental idealism and\ncontemporary anti-realism”, <em>International Journal of\nPhilosophical Studies</em>, 11: 369–392.</li>\n<li>–––, 2004, “Kant’s “One\nWorld”: Interpreting Transcendental Idealism”, <em>British\nJournal for the History of Philosophy</em>, 12: 655–684.</li>\n<li>–––, 2006, “Kant on Intrinsic Natures: a\nCritique of Langton”, <em>Philosophy and Phenomenological\nResearch</em>, 73: 143–169.</li>\n<li>–––, 2007, “Kant’s Idealism and the\nSecondary Quality Analogy”, <em>Journal of the History of\nPhilosophy</em>, 45: 459–484.</li>\n<li>–––, 2015, <em>Manifest Reality: Kant’s\nIdealism and his Realism</em>, Oxford: Oxford University Press.</li>\n<li>Allison, H., 1968, “Kant’s Concept of the\nTranscendental Object”, <em>Kant-Studien</em>, 59:\n165–186.</li>\n<li>–––, 1973, “Kant’s Critique of\nBerkeley”, <em>Journal of the History of Philosophy</em>, 11:\n43–63.</li>\n<li>–––, 1976, “The Non-spatiality of Things\nin Themselves for Kant”, <em>Journal of the History of\nPhilosophy</em>, 14: 313–321.</li>\n<li>–––, 1983, <em>Kant’s Transcendental\nIdealism</em>, New Haven: Yale University Press.</li>\n<li>–––, 1987, “Transcendental Idealism: The\nTwo Aspect View”, in Ouden and Moen (eds.), <em>New Essays on\nKant</em>, 155–178.</li>\n<li>–––, 2004, <em>Kant’s Transcendental\nIdealism</em>, New Haven: Yale University Press. Revised and Enlarged\nEdition.</li>\n<li>Ameriks, K., 1982, “Recent Work on Kant’s Theoretical\nPhilosophy”, <em>The Philosophical Quarterly</em>, 19:\n1–24.</li>\n<li>–––, 1992, “Kantian Idealism Today”,\n<em>History of Philosophy Quarterly</em>, 9: 329–342.</li>\n<li>–––, 2003, <em>Interpreting Kant’s Three\nCritiques</em>, Oxford: Oxford University Press.</li>\n<li>Aquila, R., 1979, “Things in Themselves: Intentionality and\nReality in Kant”, <em>Archiv Fur Geschichte der\nPhilosophie</em>, 61: 293–307.</li>\n<li>–––, 1983, <em>Representational Mind: A Study of\nKant’s Theory of Knowledge</em>, Bloomington: Indiana University\nPress.</li>\n<li>Beck, L.W., 1960, <em>A Commentary on Kant’s Critique of\nPractical Reason</em>, Chicago: University of Chicago Press.</li>\n<li>Beiser, F., 1987, <em>The Fate of Reason: German Philosophy\nbetween Kant and Fichte</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>–––, 2002, <em>German Idealism: The Struggle\nagainst Subjectivism, 1781–1801</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Bennett, J., 1966, <em>Kant’s Analytic</em>, Cambridge:\nCambridge University Press.</li>\n<li>Bird, G., 1962, <em>Kant’s Theory of Knowledge</em>, London:\nRoutledge &amp; Kegan Paul.</li>\n<li>–––, 2000, “Review of <em>Kantian\nHumility</em>”, <em>The Philosophical Quarterly</em>, 50:\n105–108.</li>\n<li>Chignell, A., 2010, “Causal Refutations of Idealism”,\n<em>The Philosophical Quarterly</em>, 60: 487–507.</li>\n<li>Cohen, H., 1871/1885, <em>Kants Theorie der Erfahrung</em>,\nBerlin: Dümmler. Third revised edition, 1885. Reprinted in Cohen,\n<em>Werke</em>, H. Holzhey and H. Weidebach (eds.), Hildesheim: G.\nOlms.</li>\n<li>–––, 1907, <em>Kommentar zu Immanuel Kants\nKritik der reinen Vernunft</em>, Leipizig: Meiner.</li>\n<li>Collins, A., 1999, <em>Possible Experience</em>, Berkeley and Los\nAngeles: University of California Press.</li>\n<li>Cummins, P., 1968, “Kant on Outer and Inner\nIntuition”, <em>Noûs</em>, 2: 271–292.</li>\n<li>Dicker, G., 2008, “Kant’s Refutation of\nIdealism”, <em>Noûs</em>, 42: 80–108.</li>\n<li>–––, 2011, “Kant’s Refutation of\nIdealism: a Reply to Chignell”, <em>The Philosophical\nQuarterly</em>, 61: 175–183.</li>\n<li>Dunlop, K., 2009, “The Unity of Time’s Measure:\nKant’s Reply to Locke”, <em>Philosophers’\nImprint</em>, 9: 1–31.</li>\n<li>Drexler, H., 1904, <em>Die doppelte Affektion des erkennenden\nSubjekts</em>, Beuthen o.S.: Th. Kirch.</li>\n<li>Dryer, D.P., 1966, <em>Kant’s Solution for Verification in\nMetaphysics</em>, London: Allen &amp; Unwin.</li>\n<li>Emundts, D., 2008, “Kant’s Critique of\nBerkeley’s Concept of Objectivity”, in D. Garber and B.\nLonguenesse (eds.), <em>Kant and the Early Moderns</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 2010, “The Refutation of Idealism and\nthe Distinction between <em>Phenomena</em> and\n<em>Noumena</em>”, in P. Guyer (ed.), <em>The Cambridge\nCompanion to Kant’s Critique of Pure Reason</em>, Cambridge:\nCambridge University Press.</li>\n<li>Erdmann, B., 1878, <em>Kants Kriticismus in der ersten und in der\nzweiten Auflage der Kritik der reinen Vernunft</em>, Leipzig:\nVoss.</li>\n<li>Falkenstein, L., 1991, “Kant, Mendelssohn, Lambert, and the\nSubjectivity of Time”, <em>Journal of the History of\nPhilosophy</em>, 29: 227–251.</li>\n<li>–––, 2000, “Langton on Things in\nThemselves”, <em>Kantian Review</em>, 5: 49–64.</li>\n<li>Findlay, J.N., 1981, <em>Kant and the Transcendental Object</em>,\nOxford: Clarendon Press.</li>\n<li>Förster, E., 2012, <em>The Twenty Five Years of Philosophy: A\nSystematic Reconstruction</em>, trans. B. Bowman, Cambridge, MA:\nHarvard University Press.</li>\n<li>Gram, M., 1975, “The Myth of Double Affection”, in\nWerkmeister (ed.), <em>Reflections on Kant’s Philosophy</em>.\nUniversity of Florida Press: Gainesville.</li>\n<li>–––, 1981, “Intellectual Intuition: The\nContinuity Thesis”, <em>Journal of the History of Ideas</em>,\n42:287–304.</li>\n<li>Grier, M., 2001, <em>Kant’s Doctrine of Transcendental\nIllusion</em>, Cambridge: Cambridge University Press.</li>\n<li>Guyer, P., 1983, “Kant’s Intentions in the Refutation\nof Idealism”, <em>The Philosophical Review</em>, 92:\n329–383.</li>\n<li>–––, 1987, <em>Kant and the Claims of\nKnowledge</em>, Cambridge: Cambridge University Press.</li>\n<li>Heidegger, M. 1929. <em>Kant und das Problem der Metaphysik</em>.\nVittorio Klostermann: Frankfurt a/M.</li>\n<li>Hanna, R., 2000, “The Inner and the Outer: Kant’s\n‘Refutation’ Reconsidered”, <em>Ratio</em>, 13:\n146–174.</li>\n<li>Hogan, D., 2009a, “How to Know Unknowable Things in\nThemselves ”, <em>Noûs</em>, 43: 49–63.</li>\n<li>–––, 2009b, “Noumenal Affection”,\n<em>The Philosophical Review</em>, 4: 501–532.</li>\n<li>Kemp Smith, N., 1962, <em>A Commentary on Kant’s Critique of\nPure Reason</em>, New York: Humanities Press.</li>\n<li>Köhnke, K., 1986, <em>Entstehung und Aufstieg des\n</em>Neukantianismus: <em>die deutsche Universitatsphilosophie\nzwischen Idealismus und Positivismus</em>, Frankfurt am Main:\nSuhrkamp.</li>\n<li>Langton, R., 1998, <em>Kantian Humility</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2011, “Kant’s Phenomena:\nExtrinsic or Relational Properties? A Reply to Allais”,\n<em>Philosophy and Phenomenological Research</em>, 73:\n170–185.</li>\n<li>Marshall, C., 2013, “Kant’s Appearances and Things in\nThemselves as Qua-Objects”, <em>The Philosophical\nQuarterly</em>, 63: 520–545.</li>\n<li>Matthews, H.E., 1969, “Strawson on Transcendental\nIdealism”, <em>The Philosophical Review</em>, 19:\n204–220.</li>\n<li>McDaniel, K., Ms, “Kantian Ignorance”.</li>\n<li>Paton, H.J., 1936, <em>Kant’s Metaphysic of Experience</em>,\n2 vols., London: Allen &amp; Unwin.</li>\n<li>Patton, L., 2005, “The Critical Philosophy Renewed: The\nBridge Between Hermann Cohen’s Early Work on Kant and Later\nPhilosophy of Science”, <em>Angelaki</em>, 10:\n109–118.</li>\n<li>Prauss, G., 1974, <em>Kant und das Problem der Dinge an Sich</em>,\nBonn: Grundman.</li>\n<li>Richardson, A., 2003, “Conceiving, Experiencing, and\nConceiving Experience: Neo-Kantianism and the History of the Concept\nof Experience”, <em>Topoi</em>, 22: 55–67.</li>\n<li>Robinson, H., 1994, “Two Perspectives on Kant’s\nAppearances and Things-in-Themselves”, <em>Journal of the\nHistory of Philosophy</em>, 33: 411–441.</li>\n<li>Rosefeldt, T., 2001, “Review of <em>Kantian\nHumility</em>”, <em>Zeitschrift für philosophische\nForschung</em>, 9 (2001): 236–69.</li>\n<li>–––, 2007, “Dinge an sich und\nsekundäre Qualitäten”, in J. Stolzenberg (ed.),\n<em>Kant in der Gegenwart</em>, Berlin, New York: Walter de Gruyter,\n167–209.</li>\n<li>–––, 2013, “Subject-Dependence and\nTrendelenburg’s Gap”, in <em>Akten des XI. Internationalen\nKant-Kongresses</em>, New York and Berlin: Walter de Gruyter, vol. 2,\n755–64.</li>\n<li>Sassen, B., 2000, <em>Kant’s Early Critics</em>, Cambridge:\nCambridge University Press.</li>\n<li>Schopenhauer, A., 1938, <em>Sämtliche Werke</em>, edited by\nArthur Hubscher, Leipzig: Brockhaus.</li>\n<li>Sellars, W., 1968, <em>Science and Metaphysics: Variations on\nKantian Themes</em>, London: Routledge.</li>\n<li>Stang, N., 2012, “Kant on Complete Determination and\nInfinite Judgment”, <em>British Journal for the History of\nPhilosophy</em>, 20: 1117–1139.</li>\n<li>–––, 2013, “Freedom, Knowledge and\nAffection”, <em>Kantian Review</em>, 18(1): 96–106.</li>\n<li>–––, 2014, “The Non-Identity of\nAppearances and Things in Themselves”, <em>Noûs</em>,\n48(1): 106–136.</li>\n<li>–––, 2015, “Who’s Afraid of Double\nAffection?” <em>Philosophers’ Imprint</em>,\n15:1–28.</li>\n<li>Strawson, P.F., 1966, <em>The Bounds of Sense</em>, London:\nMethuen.</li>\n<li>Turbayne, C., 1955, “Kant’s Refutation of Dogmatic\nIdealism”, <em>Philosophical Quarterly</em>, 5:\n225–244.</li>\n<li>–––, 1969, “Kant’s Relation to\nBerkeley”, in L.W. Beck (ed.), <em>Kant Studies Today</em>, La\nSalle, IL: Open Court.</li>\n<li>Vaihinger, H., 1881/1892, <em>Commentar zur Kants Kritik der\nreinen Vernunft</em>, 2 vols., Stuttgart: W. Spemann.</li>\n<li>–––, 1884, “Zu KantsWiderlegung des\nIdealismus”, <em>Strassberger Abhandlungen zur Philosophie</em>,\nFreiburg: Mohr.</li>\n<li>Van Cleve, J., 1999, <em>Problems from Kant</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Vogel, J., 1993, “The Problem of Self-Knowledge in\nKant’s ‘Refutation of Idealism’”,\n<em>Philosophy and Phenomenological Research</em>, 53:\n875–887.</li>\n<li>Walker, R., 1985, “Idealism: Kant and Berkeley”, in J.\nFoster and H. Robinson (ed.), <em>Essays on Berkeley</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2010, “Kant on the Number of\nWorlds”,<em>British Journal for the History of Philosophy</em>,\n18: 821–843.</li>\n<li>Weldon, T.D., 1958, <em>Kant’s Critique of Pure Reason</em>,\nOxford: Clarendon Press.</li>\n<li>Westphal, M., 1968, “In Defense of the Thing in\nItself”, <em>Kant-Studien</em>, 59: 118–141.</li>\n<li>Westphal, K.R., 2000, “Kant, Hegel, and the fate of\n‘the’ Intuitive Intellect”, in S. Sedgewick (ed.),\n<em>The Reception of Kant’s Critical Philosophy</em>, Cambridge\nUniversity Press.</li>\n<li>Wilson, M., 1971, “Kant and the ‘Dogmatic Idealism of\nBerkeley”, <em>Journal of the History of Philosophy</em>, 9:\n459–475. Reprinted in Wilson (ed.), 1999, <em>Ideas and\nMechanism: Essays on Early Modern Philosophy</em>, Princeton:\nPrinceton University Press: 277–293.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Kant, Immanuel",
            "Kant, Immanuel: view of mind and consciousness of self",
            "Kant, Immanuel: views on space and time"
        ],
        "entry_link": [
            {
                "../kant/": "Kant, Immanuel"
            },
            {
                "../kant-mind/": "Kant, Immanuel: view of mind and consciousness of self"
            },
            {
                "../kant-spacetime/": "Kant, Immanuel: views on space and time"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-transcendental-idealism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/kant-transcendental-idealism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=kant-transcendental-idealism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/kant-transcendental-idealism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=kant-transcendental-idealism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/kant-transcendental-idealism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=kant-transcendental-idealism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/kant-transcendental-idealism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.korpora.org/kant/\" target=\"other\">Immanuel Kant Corpora (in German)</a>",
            "<a href=\"http://kantpapers.org/\" target=\"other\">Kant Papers.org</a>"
        ],
        "listed_links": [
            {
                "http://www.korpora.org/kant/": "Immanuel Kant Corpora (in German)"
            },
            {
                "http://kantpapers.org/": "Kant Papers.org"
            }
        ]
    }
}