{
    "url": "latinx",
    "title": "Latinx Philosophy",
    "authorship": {
        "year": "Copyright © 2018",
        "author_text": "Manuel Vargas\n<mrvargas@ucsd.edu>",
        "author_links": [
            {
                "http://vargasphilosophy.com/": "Manuel Vargas"
            },
            {
                "mailto:mrvargas%40ucsd%2eedu": "mrvargas@ucsd.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2018</a> by\n\n<br/>\n<a href=\"http://vargasphilosophy.com/\" target=\"other\">Manuel Vargas</a>\n&lt;<a href=\"mailto:mrvargas%40ucsd%2eedu\"><em>mrvargas<abbr title=\" at \">@</abbr>ucsd<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Dec 13, 2018"
    ],
    "preamble": "\n\nLatinx philosophy is philosophical work substantively concerned with\nLatinxs, including the moral, social, political, epistemic, and\nlinguistic significance of Latinxs and their\n experiences.[1]\n Although its emergence as a distinctive, self-identified field is\nrelatively recent, Latinx philosophy includes a substantial body of\nwork that draws from a variety of philosophical traditions, including\ncritical race theory, Latina feminist philosophy, Latinx and Chicanx\nStudies, various strands of Latin American, Continental, analytic,\nCaribbean, and Africana philosophy.\n\nThis entry focuses on the nature, history, and recent developments of\nLatinx philosophy in the United States. It discusses current work in\nLatinx philosophy, the various origins of Latinx philosophy, disputes\nabout the nature and scope of the field, and ongoing developments.\n",
    "toc": [
        {
            "#CurrIssu": "1. Current Issues"
        },
        {
            "#GrouIden": "1.1 Group Identity"
        },
        {
            "#SociPoliPhil": "1.2 Social and Political Philosophy"
        },
        {
            "#MetaIssu": "1.3 Metaphilosophical Issues"
        },
        {
            "#Orig": "2. Origins"
        },
        {
            "#ChicThou": "2.1 Chicano Thought"
        },
        {
            "#LatiAmerPrec": "2.2 Latin American Precursors"
        },
        {
            "#LatiFemi": "2.3 Latina Feminism"
        },
        {
            "#SelfConsLatiPhil": "2.4 Self-Consciously Latinx Philosophy"
        },
        {
            "#DefiLatiPhil": "3. Defining Latinx Philosophy"
        },
        {
            "#WideVsNarrScop": "3.1 Wide vs. Narrow Scope"
        },
        {
            "#SourVsSubjMatt": "3.2 Source vs. Subject Matter"
        },
        {
            "#OngoDeve": "4. Ongoing Developments"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Current Issues\n\nCurrent work on Latinx philosophy tends to cluster into several\nsubject matters: (1) accounts of group identity, including accounts of\nthe phenomenology and senses of self in Latinxs; (2) broadly social\nand political questions about Latinxs, with a special eye towards\ncitizenship and immigration issues; and (3) a range of\nmetaphilosophical issues, including efforts to identify or expand the\ncanon of Latinx philosophy, and efforts to speak to various concerns\nabout the status of Latinxs in the profession of philosophy.\n1.1 Group Identity\n\nA recurring issue within Latinx philosophy is the characterization of\nLatinxs. US and Latin American social identity categories are\noftentimes distinct, and products of different racial and social\ncategories. Latinx is a term used exclusively within the\nUnited States, or nearly so, such that people from Latin America would\nnot ordinarily think of themselves as Latinxs, unless or until they\nreside in the United States. Within the United States, the social\ncategory has had various labels, including “Hispanic”,\n“Latino”, “Latina/o”, “Latin@”.\nThe adoption of particular labels has served varied roles in response\nto interests in self-identification, coalition building, marketing\npressures, and government bureaucratic interests (Alcoff 1999; Gracia\n2000).\n\nIn the first decade of the twenty-first century philosophers began to\noffer systematic accounts of the social category of Hispanics or\nLatinxs, the way the category functions as an identity category, and\nhow Latinxs fit in (or don’t) within the racial and ethnic\nmatrix of the United States. Three approaches emerged: an\nethnoracial account, a cultural ethnic group\naccount, and a familial-historical view.\n\nLinda Alcoff (2000) has maintained that Latinxs are best understood as\nan ethnoracial group—i.e., a group whose identity in some\ncontexts functions as a racial group, and in others as an ethnic\ngroup. As a group, Latinxs do not neatly fit within US racial and\nethnic matrix, she has argued (Alcoff 1999, 2000, 2003, 2006). The\nracial diversity of peoples descended from Latin America, which span\nthe full set of standard US racial categories, make Latinxs an\nunstable category in US social identity categories. Thus, how the term\n“Latinx” works in ordinary discourse—and its\nsignificance in lived experience—tends to vary in light of the\ninteraction of locally predominant Latinx group (i.e., Mexicans,\nDominicans, Cubans, etc.), with US racial categories. The only way to\ndo justice to this complexity, she thinks, is to recognize Latinxs as\noccupying a hybrid social category, i.e., an ethnorace.\n\nOn J. Angelo Corlett’s (2003) account, Latinxs constitute an\nethnic group unified by broadly cultural features, including such\nfeatures as language competence in a “Latino” language,\npossession of a traditional “Latino” last name,\nself-recognition, and in- and out-group recognition. However, for\npublic policy purposes, Corlett maintains that to be Latinx is a\nmatter of genealogy or descent from certain Latin American groups. On\nthis approach, in public policy contexts the category Latinx\nfunctions in a manner more typical of a racial group, and not like a\ngroup unified historically contingent cultural practices (cf. Blum\n2009).\n\nIn contrast to the cultural ethnic group account, Jorge Gracia’s\nfamilial-historical view grounds ethnic group membership in\nhistorical ties, such that members of the group need not share any\nother features, cultural or otherwise (2008). Apart from the very\ngeneral constraint of a suitable historical tie to the post-1492\nevents involving the Iberian Peninsula and the Americas, Latinxs in\none time and place can have some characteristics in common that are\nlacked by Latinxs in another time and\n place.[2]\n Depending on the local norms that configure contingent (and often\nscalar) understandings of group membership, one can be Latinx without\nspeaking Spanish or Portuguese, without partaking in various cultural\npractices associated with the identity, and so on. Gracia thus rejects\nboth the cultural continuity account and the public policy\ngenealogical account emphasized by Corlett.\n\nBeyond attempts to characterize the category of Latinx, and efforts to\nidentify how it does (or should) operate in discourse, philosophers\nhave also considered the distinctive challenges and puzzles of Latinx\nidentity in the face of US social identity categories (e.g., Lugones\n1987; Mendieta 1999; Schutte 2000; Alcoff 2000; see also Lewis\nforthcoming and Spencer 2018). One important strand of this\nliterature—largely grounded in the reflections of Latina\nfeminist philosophers—has focused on the idea that the condition\nof being Latinx (and, especially, Latina) has tended to produce\ndistinct senses of self-identity that resists easy integration into a\nunified self (Lugones 1987, 1994; Schutte 2000; Barvosa 2008; Ortega\n2016). These works frequently take up and explore particular forms of\nmarginalization, as well as strategies of response to them in light of\nthe varied but distinctive social positions of Latinxs.\n1.2 Social and Political Philosophy\n\nIf the first decade of twenty-first century work on Latinx philosophy\nwas dominated by questions of identity—in particular, of\nspecifying the nature, experiences, and even preferred term for\nLatinxs—the second decade might best be characterized as\ninvolving the arrival of questions in political philosophy (including\ncitizenship and immigration) and the development of a more pronounced\nmetaphilosophical sensibility. \n\nWrit large, a good deal of recent Latinx philosophy has centered on\nthe consequences of demographic changes in the United States, and on\nreactions to them. Philosophers have argued that Latinxs constitute\ndistinctive challenges for conventional understandings of social and\npolitical theory in the United States (Mendieta 2003; Gracia 2005;\nAlcoff 2006). In particular, the “browning” of America\n(Sundstrom 2008) and the implications of these demographic\ntransformation for whiteness (Alcoff 2015; Mendoza 2017) have been\nsubjects of important discussions.\n\nThis engagement with questions in political philosophy is not entirely\nnew, of course. For example, there has been ongoing philosophical\ndebate about the status of Latinxs with respect to affirmative action\n(Corlett 2003; Gracia 2008; McGary 2013; Gracia 2013). Within the\nrecent expansion of work in political philosophy, however, two issues\nhave emerged as particularly salient: citizenship and immigration\nethics.\n\nCitizenship, and its entanglement with race, has a long and\ncomplicated history within Latin America (Quijano 2000, von Vacano\n2012). The same is true in the United States, where the boundaries of\ncitizenship of oftentimes been carved with an eye towards the racial\nconsequences of those boundaries (Silva 2015a). The upshot of these\ncomplex but distinct histories is that Latinx populations sometimes\nstand in systematically produced situations of unorthodox citizenship.\nFor example, Puerto Ricans are US citizens, but those living on the\nisland cannot vote in US presidential elections. The Tohono\nO’odham Nation, recognized by the US Bureau of Indian Affairs,\nis a tribal group divided by the US/Mexico border. Members born from\nthose enrolled in the tribe on the US side are US citizens, even if\nthey are born in Mexico and live with their fellow tribe members who\nare Mexican citizens (Luger 2018).\n\nMore generally, immigration rights, border politics, and the status of\npopulations that move across national boundaries have been the subject\nof particularly sustained discussions within Latinx philosophy\n(Cisneros 2013; Mendoza 2016; Reed-Sandoval 2016a; Orosco 2016a).\nMendoza (2016), for example, has argued that even if we suppose that\nnation states have some right to control their borders, it does not\nfollow that immigration enforcement is permissible or ethically\ndesirable. Reed-Sandoval (2016b) has argued that some populations\nwithin the larger web of immigration patterns (specific Oaxacan\ncommunities, in particular) have distinctive rights of migration,\ngiven their nature as a transborder community.\n1.3 Metaphilosophical Issues\n\nBeyond political philosophy, a number of philosophers have taken up\nquestions about the relationship of Latinxs to the discipline of\nphilosophy. One preoccupation concerns the relatively low numbers of\nLatinx philosophers in the US academy (Gracia 2000, 2008; R. Sanchez\n2013). Others have written about whether Latinxs are subject to bias\nof some or another sort (Madva 2016). Several philosophers have argued\nthat the particular cultural practices of the discipline of philosophy\ncreate special barriers for Latinxs (Gracia 2000: 159–188; C.\nSánchez 2016, 135–140; see also essays in Yancy\n2012).\n\nA different family of broadly metaphilosophical endeavors has focused\non the identification of conceptual continuities and historical ties\nbetween Latinxs, Latinx philosophy, and other philosophical movements.\nFor example, Gregory Pappas (2011), Carlos Sánchez (2016:\n93–112), and José-Antonio Orosco (2016a) have taken up\nthe question of whether philosophical pragmatism is continuous with,\nuseful for, or particularly representative of Latinx thought and\nculture.\n\nAnother notable interest for some philosophers working within Latinx\nphilosophy has been the expansion of what figures are canonical for\nphilosophy, and in particular, for Latinx philosophy, or more\nspecifically, a Mexican American philosophy. Orosco (2016b) has argued\nthat important figures in the Chicano Civil Rights\nmovement—Cesar Chavez and Armando Rendon, among\nothers—ought to count as philosophers. In a different direction,\nCarlos Sánchez’s work in the history of Mexican\nphilosophy—including translations and discussions of Mexican\nexistentialism (2012, 2016)—has been animated by the goal of\nexpanding the philosophical canon in ways that might helpfully speak\nto contemporary Mexican American people and their circumstances (see\nthe introduction and conclusion of Sanchez 2016).\n\nSurveying the state of contemporary work in Latinx philosophy suggests\nan initial taxonomy of the field. First, there is a distinct set of\nquestions about who is Latinx, the nature of the category,\nand whether it makes sense to speak of there being any interesting\nunity to the category. We can characterize this first set of issues as\ncategorical or identitarian.\n\nSecond, as we have seen, there is a set of relatively “first\norder” or substantive philosophical questions within\nLatinx philosophy. These include questions about racialization of\ncitizenship; the ethics of immigration; matters in political and\nsocial philosophy that impinge upon and that are structured by\nLatinxs; the peculiar features of transnational identities for some\nLatinx groups; the nature of intersectionality in the Latinx case;\nepistemic injustice concerning Latinxs; social, moral, and political\nquestions about, for example, the role of Latinxs within the academic\ndiscipline of philosophy.\n\nThird, there are questions about whether a Latinx philosophy\nessentially involves—or ought to involve—aspirations for\nliberation, whether Latinx philosophy is ultimately a form of identity\npolitics, whether it makes sense to talk of ethnic philosophies at\nall, and even questions about what sort of work regarding Latinxs\n(scholarly or otherwise) properly counts as philosophy. Call these\nmetaphilosophical questions about Latinx philosophy.\n\nRoughly, categorical questions (the first cluster) concern how we\nought to understand the Latinx part of Latinx philosophy.\nMetaphilosophical questions (the third cluster) concern how we ought\nto under the philosophy part of Latinx\n philosophy.[3]\n Together, the presumptions one has about these questions structure a\ngood deal of the shape of what constitutes substantive Latinx\nphilosophy. Some of these issues are canvassed in\n §§3–4.\n2. Origins\n\nAccounting for the origins of Latinx philosophy is a difficult\nbusiness, both because of the messy, slowly-emerging nature of\nacademic fields and because of special puzzles about how to\ncharacterize the field (see\n §3,\n below). Philosophers have only recently begun to speak of Latinx\nphilosophy (and/or Latino and Latina/o\nphilosophy) (Gracia 2008; Mendieta 2011; R. Sánchez 2013;\nLlorente 2013; Millán & Deere 2017). However, prior to the\ncurrency of the term, philosophers were already doing philosophical\nwork that recognizably constituted Latinx philosophy, i.e., philosophy\nconcerned with Latinxs.\n\nAlthough a wider and more detailed history is still waiting to be\ntold, what follows is a provisional and partial reconstruction of\nseveral intertwined origins of Latinx philosophy. This account focuses\non four sources of contemporary Latinx philosophy: the Chicano\nmovement, the history of Latin American philosophy, Latina feminism,\nand recent efforts at philosophy that is explicitly conceived of as\nLatinx philosophy.\n2.1 Chicano Thought\n\nOne way to reconstruct the origins of Latinx philosophy goes through\nthe history of the Chicano\n movement.[4]\n The Chicano movement was never any one thing, but in broad\nbrushstrokes, it tended to be distinguished by a kind of cultural\nnationalism that identified a people—a Chicano\nraza—with a homeland—Aztlán—while\nalso emphasizing an imperative of liberation for those people and,\nsometimes, for that land (I. Garcia 2015). If we think of early\nChicano thought as a species of Latinx philosophy, then early Chicano\nthought is a natural candidate for one origin of Latinx\nphilosophy.\n\nImportant articulations of the movement’s\naspirations—including El plan espiritual de\nAztlán—employed concepts borrowed from twentieth\ncentury Mexican philosophy. Prominently among these was José\nVasconcelos’ La raza cósmica. In the prologue to\nLa raza cósmica, Vasconcelos claimed that Latin\nAmerica had the opportunity to be the future birthplace of a new and\nfinal race that would integrate the best cultural features from the\nrest of the world. The work’s emphasis on seeing humankind as\ndivided by race, its articulation of a glorious indigenous past in the\nAmericas, its assertion that the age of the White race was coming to\nan end, and its prophetic tone of racial uplift rooted in the peoples\nof Latin America provided a ready framework for articulating some of\nthe Chicano movement’s early aspirations (cf. Romano 1969).\n\nThere is some evidence that syllabi of the period included work by the\nMexican philosopher Samuel Ramos, and by Patrick Romanell, an\nimportant English-language discussant of Mexican philosophy\n(Soldatenko\n 1996).[5]\n Moreover, Spanish philosopher José Ortega y Gasset’s\nperspectivism—roughly, the idea that knowledge is perspectival,\nand frequently structured by features of culture, time, and\nplace—may have filtered into the self-understanding of parts of\nthe movement, in part because of his putative influence on Mexican\nfigures, the availability of translations of his work, and some\ndiscussion of him in the work of Octavio Paz. Nevertheless, systematic\nattempts to pursue anything like a Chicanx philosophy in a form that\nmight be recognized as academic philosophy was rare. In general, the\nChicano movement was not marked by frequent or sustained attempts to\nelaborate an explicit theoretical foundation in philosophical terms\n(I. Garcia 2015).\n\nNevertheless, there were some attempts at doing philosophy in a\ndistinctively Chicano vein. Perhaps the most notable example was Elihu\nCarranza’s Chicanismo: Philosophical Fragments (1978).\nIt is an unusual text. It owes its structure and sensibility in part\nto Kierkegaard’s Philosophical Fragments, and each of\nthe main chapters has a pseudonymous author. At the same time, its\nconcern and motivations openly draw from Mexican philosopher Samuel\nRamos’ critical investigation into a supposedly shared\n“Mexican” psychological profile. In Carranza’s case,\nChicanxs (and Chicano Studies) are the\n subject.[6]\n\nDespite some threads of influence from Mexican philosophy (for an\noverview, see Soldatenko 1996), philosophical work on Chicanxs (and\nLatinxs more generally) seems to have been limited to work by those\noutside the discipline of philosophy, at least until the later\nrenaissance of Latina feminist philosophy. Moreover, the nature of\nearly Chicanx thought presents an ambiguous case for the origins of a\nLatinx philosophy.\n\nFirst, especially in the early period of the Chicano Movement there\nwas comparatively little systematic concern for articulating a\ntheoretical framework that encompassed Latinos more generally. Second,\na good deal of the symbolic framework of the movement did not readily\ngeneralize to other groups of Latinxs. For example, the mestizo racial\nnarrative has proven to be problematic in a variety of ways and it\ndoes not readily extend to all Latinx groups (cf. Velazco y Trianosky\n2009; Gallegos forthcoming). Moreover, documents like the Treaty of\nGuadalupe, and the appeal to an indigenous—especially\nAztec—past, cannot be used in the same way to anchor a shared\nidentity with other Latinx groups (or even those groups of\nMexican-descended people who cannot trace their ancestry to the\nAztecs). Third, it would be something of a cold irony for one strand\nof the cultural-nationalist (and sometimes separatist wing) of the\nChicano movement to be thought of as having constituted the origins of\na broader, pan-Latinx intellectual project. Those strands of the\nChicano movement were often animated by a resistance to anything that\nfailed to recognize the cultural specificity of Chicanxs. On such\nviews, acceptance of a Latinx identity necessarily entails a risk of\ncultural dissociation from the specifically Mexican roots of Chicanx\nidentity, and brings with it an impermissible homogenization via a\npan-Latinx\n category.[7]\n For that reason, it would sound strange to some activists and\ntheorists to frame Chicanx thought as an early exemplar of Latinx\nphilosophy.\n\nStill, if one did think it plausible that Chicanx thought was an\norigin for Latinx philosophy, it might seem natural to find the origin\nof Latinx philosophy still further back in Latin American philosophy.\nIndeed, there is a case to be made for that more distal origin.\n2.2 Latin American Precursors\n\nPhilosophy within Latin America was, for many centuries, undertaken\nwith a sense of its general continuity with European philosophy.\nHowever, by the second half of the nineteenth century a number of\nprominent thinkers in Latin America began to speak of the possibility\nor need of a distinctively Latin American philosophy (Magallón\n1991: 212; Gracia 1995: 462). In his “Ideas for a Course in\nPhilosophy” [“Ideas para un curso de filosofía\ncontemporánea”] Argentinian Juan Alberdi\n(1812–1884) called for the creation of national philosophies in\nLatin America. The idea was that these philosophical theories were to\nbe responses to local social and political circumstances, expressing\n“the most vital and highest needs of these countries”\n(1842 [1978: 14] translation by entry author). Similarly,\nAndrés Bello (1848) and Francisco Bilbao (1856) called for\nphilosophical work to be responsive to national and broadly Latin\nAmerican circumstances, and to separate itself from mere imitation of\nEuropean thought.\n\nIt is unclear how influential any of these proposals were (Nuccetelli\n2017: §2.2.3), and whether they were really understood as calls\nfor radical originality in Latin American thought, as opposed to\ninvitations to be more attentive to local circumstances when deploying\nphilosophical proposals that largely originated elsewhere. Still,\nthese gestures came to be regarded as early canonical statements of\nthe need for an autochthonous Latin American philosophy.\n\nProposals to develop an autochthonous Latin American philosophy\nfigured prominently in the early to mid-twentieth century\nphilosophical scene of Mexico, subsequently spreading to other parts\nof Latin America. The concerns for a distinctively Mexican and Latin\nAmerican philosophy figured in the work of José Gaos, Leopoldo\nZea, Emilio Uranga, and Octavio Paz. In their concern for the\nparticular circumstances of Mexico (and less frequently, Latin\nAmerica), this work extended threads already present in earlier work,\ne.g., that of José Vasconcelos, Samuel Ramos, and Ortega y\nGasset. However, mid-twentieth century concerns for articulating\nfeatures of a putatively Mexican circumstance, and subsequent efforts\nby Zea to articulate a broadly pan-Latin American philosophical\npicture, ultimately gave rise to several generations of critical\nreactions concerning the proper nature and aspirations of philosophy\nin Latin America (for discussion, see Nuccetelli 2017; Gracia &\nVargas 2018).\n\nAs we saw in the prior section, invocations of Latin American\nphilosophers sometimes played a role in the articulation of the\nideological aspirations of the Chicano movement. So, it is tempting to\nread at least some early efforts at a Latinx philosophy as inheritors\nof a prior Latin American tradition of efforts at a self-consciously\nautochthonous body of philosophical\n work.[8]\n This narrative is not unproblematic, however. It is unclear how\nsystematic and serious the philosophical influence of Mexican\nphilosophy was on the Chicano movement. It was sporadically present,\nto be sure, and there were various attempts to appeal to Mexican\nphilosophers as antecedents or intellectual forerunners of the\nmovement. Nonetheless, apart from providing a sense of intellectual\nforerunners and a license for advocating for curricular changes, there\nis only sporadic evidence of efforts at engagement with that work in a\nway continuous with Mexican and US academic philosophy.\n\nWhat makes those tenuous connections to Latin American philosophy\nsomewhat more intriguing as an origin story for Latinx philosophy is\nthat the mainstream of current work in Latinx philosophy reflects at\nleast some familiarity with the history of Latin American philosophy\n(cf. R. Sánchez 2013; Millán & Deere 2017). Beyond\nfamiliarity with the history of Latin American philosophy, there is\nalso a variety of more recent strands of influence from Latin American\nphilosophy of liberation, postcolonial, and decolonial philosophy into\nthe work of several Latinx philosophers (e.g., those in Alcoff &\nMendieta 2000, also, Maldonado-Torres 2008, Lugones 2010, Silva 2015b,\nRuíz\n 2016).[9]\n So, even if early strands of Latinx philosophy were not\nintellectually connected to impulses for an autochthonous Latin\nAmerican philosophy, or otherwise systematic engagements with themes\nand concerns in Latin American philosophy, later strands clearly came\nto have those\n connections.[10]\n For this reason, is not entirely unreasonable to locate the origin of\nat least some important forms of Latinx philosophy in impulses to\nautochthonous philosophy within Latin American philosophy.\n2.3 Latina Feminism\n\nRichard Bernstein once declared the following:\n\n\nLet me be fully explicit. I am not questioning that there is Hispanic\nphilosophy or Latin American philosophy, or even that some Hispanic\nAmericans in the United States are concerned with their history and\ntraditions. I am questioning whether there now exists\nsomething that we can identify as Hispanic American philosophy. (2001:\n50)\n\n\nAt the time, such skepticism was plausibly the standard view among\nthose who entertained the question of whether Latinx or Hispanic\nAmerican philosophy existed. However, there is a compelling case to be\nmade that such a philosophy already existed when Bernstein wrote those\nwords, albeit pursued under another name. That body of work is Latina\nfeminist philosophy. It constitutes perhaps the best proximal\ncandidate for the formation of a distinctively Latinx philosophy.\nUnlike the philosophical gestures of the Chicano movement, the\ndevelopment of Latina feminist philosophy constituted (and continues\nto constitute) a substantial body of disciplinarily recognizable\nwork—albeit one that has had to fight for its recognition. And,\nunlike Latin American philosophical work, which has a more tenuous\nlink to US Latinxs, Latina feminism is centrally focused on US\nLatinxs.\n\nDiscourse about a specifically Latina feminism extends at least as far\nback as the late 1970s. However, the idea of a self-consciously Latina\ntheorizing by philosophers (and philosophically-minded theorists\nworking outside of philosophy departments), began to emerge in the\nlate\n 1980s.[11]\n If there is a founding text of Latina feminist philosophy, it is\nplausibly Gloria Anzaldúa’s Frontera/Borderlands\n (1987).[12]\n Anzaldúa was not herself trained as an academic philosopher,\nbut her writing inspired generations of more traditionally trained\nacademic philosophers, many of whom continue to reflect on, revisit,\nand draw from the distinctive phenomenology, vocabulary, concerns, and\nmethodology expressed in her\n work.[13]\n Anzaldúa’s work pulled together threads of feminist,\nqueer, and Chicana thought, and situated them the US/Mexico border\ncontext. In doing so, she gave expression to a distinctive range of\nexperiences and concerns that had, until that point, been mostly\ninvisible to academic work in Chicano studies, feminism, and academic\nphilosophy.\n\nOther self-consciously Latina feminist writing by academic\nphilosophers followed. Important work in this vein includes essays by\nLugones (1994, 2003) and Schutte (1998, 2000), and monographs by\nAlcoff (2006) and Ortega (2016). Much of this work emphasizes the\nimportance of lived experience, the significance of the social ties\nand the norms governing them, and the unique ways in which gender\ninteracts with Latina-hood. In recent years, this literature has been\nmarked by a reinvigoration of a broadly phenomenological approach to\nidentity, selfhood, oppression, alienation, and marginalization.\n\nThe case for thinking of Latina feminist philosophy as plausibly the\nmost important origin of Latinx philosophy is straightforward: from\nthe 1980s onward, self-identified Latina feminist philosophers were\nexploring a wide range of philosophical issues concerning agency,\nepistemology, and politics, especially as structured by gender. Within\nthat matrix of issues, a central recurring issue in that literature\nwas (and continues to be) the lived consequences of\nlatinidad, or the property of being Latinx. As such, this\nwork has as much a claim to being Latinx philosophy as any\nphilosophical work that has been produced under the label.\n\nTo be sure, given the focus on gender, Latina feminist philosophy has\nnot always been explicitly concerned about the global status of\nLatinxs qua Latinxs (as opposed to, for example, being\nfocused on Latinas qua Latinas). For example, Lugones’\nobservations about the emergence of different selves in the context of\nworld-traveling (1987) as well as her thoughts about the tacit\nmetaphysics presupposed by the discourse of purity (1994) are intended\nto offer particular insight into the condition of Latinas. However,\nthe central insights in these works plausibly generalizes to Latinxs\nin general, and perhaps beyond. Similarly, Schutte’s (1998)\nreflections about the peculiar dilemma of visibility for\nLatinas—they must either erase their Latinidad or be able to\nshow that their facility with multiple cultures is beneficial in the\nAnglo-American public sphere—is not unfamiliar to many Latinxs\nmore generally, and indeed, to a variety of other social identity\ngroups.\n\nAt this stage, it is difficult to do extensive work within Latinx\nphilosophy without engaging with the work of Latina feminist\nphilosophers. In light of these considerations, and the relatively\ndirect connections in motivations and subjects of theorizing, it is\notiose to resist the idea that Latina feminist philosophy is a main,\nif not the main proximal origin to what we now recognize as\nLatinx philosophy.\n2.4 Self-Consciously Latinx Philosophy\n\nThere is a final thread to the origin of Latinx philosophy that merits\nattention: the emergence of a self-aware field, a field that thinks of\nitself as engaged in explicitly Latinx philosophy. At roughly the end\nof the twentieth century, a group of US-based academic philosophers\nbegan to frame their work in terms of its significance for Latinx\npopulations in the United States. For example, Eduardo Mendieta (1999)\nexplored the complexities of US citizenship and the “becoming\nHispanic” that is sometimes involved in Latinx identity. Alcoff\n(2000, 2006) explored the difficulty of thinking of Latinxs as simply\na race or simply an ethnic group, and in general, the complexity of\nlived social identities in the US context. Gracia (2000, 2008) and\nCorlett (2000, 2003) each offered accounts of the nature of group\nmembership, and explored the consequences of these things for concrete\npolitical questions, such as affirmative action.\n\nAll of this work was explicitly about Latina/os, and is now rightly\nthought of as squarely in the ambit of Latinx philosophy. It was also\ntrue that when it was written, it was not regularly thought of as a\ncontribution to Latinx philosophy, per se. As we saw above, to the\nextent that scholars considered the possibility, they tended to deny\nthat such a field existed (cf. Bernstein 2001). So, even when\nLatinx-focused work was undertaken partly in conversation with\ndevelopments in Africana philosophy, Asian-American philosophy, and\nvarious developments in ethnic studies, the work of Latinx-specific\nphilosophy was typically understood as a contribution to, for example,\nthe philosophy of race, or as a piece of social and political\nphilosophy.\n\nBy the end of the first decade of the twenty-first century, this\npresumption began to change. A body of self-described Latinx\nphilosophy began to emerge, with all the usual academic apparatus\nsurrounding it, along with more frequent usages of the term\n“Latinx philosophy” and its variants (R. Sánchez\n 2013).[14]\n3. Defining Latinx Philosophy\n\nThis entry has relied on a particular conception of Latinx philosophy,\nnamely, philosophy focused on (primarily) US Latinxs. In the\nterminology that follows, this is a narrow scope and\nsubject-based characterization of the field; narrow in terms\nof how “Latinx” is understood, and subject-based in topic,\nas opposed to a construal of the field based on the identity of the\nauthors. Each of these presumptions—about scope and whether a\nsubject-based characterization is apt—is subject to dispute.\nFirst, there is a disagreement about whether “Latinx”\nought to be understood expansively (as including both Latin Americans\nand US Latinxs) or whether it ought to be understood narrowly (as\nfocused on US\n Latinxs).[15]\n The second axis of disagreement concerns whether Latinx philosophy\nshould be thought of as philosophy produced by Latinxs\n(Gracia 2008) or as philosophy about Latinxs (cf.\nReed-Sandoval 2016a: 11).\n3.1 Wide vs. Narrow Scope\n\nOn the question of scope, a more expansive conception of the field\ntends to take its cue from the work of Jorge Gracia. Gracia\ncharacterizes Hispanic/Latinx philosophy as an ethnic\nphilosophy, that is, the philosophy produced by an ethnic group.\nIn his groundbreaking Hispanic/Latino Identity (2000), Gracia\nargues for the idea of a Hispanic philosophy, understood as philosophy\nproduced by members of the ethnic group Hispanics. On\nGracia’s account—the “Familial-Historical\nView”—Hispanics constitute an ethnic group unified by\nhistorical connections to the events following 1492 and the Iberian\npeninsula’s subsequent role in the Americas. Putting aside some\ncomplexities, he holds that Hispanics include the people of the\nIberian Peninsula, Latin America, and their descendants in, for\nexample, the United States.\n\nIn later work, Gracia explicitly recognizes that, in at least some\ncontexts, there are important reasons to emphasize the term Latino\nrather than Hispanic (see Gracia 2008, esp. 58–9). In\nacknowledging this, he does not abandon the idea that “Hispanic\nphilosophy” picks out an explanatorily important thing. For\nGracia, what makes Hispanic philosophy interesting as a category of\nphilosophical work is that the underlying historical ties that define\nthe maximal limits of the ethnic group (recall: roughly, historical\nconnection to the Iberian-influenced aftermath of 1492) also structure\nimportant features of philosophical work by that group.\n\nGracia’s thought is that these historical connections matter:\none cannot understand the work of Las Casas and Clavijero, for\nexample, without understanding the significance of scholastic work in\nSpain. And, one cannot understand the work of Latin American liberals\nand positivists without understanding the web of historical ties that\nfollowed from Iberian colonialism. Certainly, one cannot understand\nearly twentieth century Latin American philosophy without\nunderstanding the Iberian-to-Latin American intellectual connections\nthat go through José Ortega y Gasset or José Gaos. So,\non Gracia’s account, the term “Hispanic philosophy”\nearns its theoretical keep by organizing our conception of things in a\nway that informatively characterizes some contingent but nevertheless\nreal and informative feature of the world.\n\nIn the context of this account of Hispanic and Latin American\nphilosophy, Gracia introduces the term Latino philosophy to\npick out “philosophical work produced by Latinos both in Latin\nAmerica and the United States” (2008: 129). This way of\nformulating the category is deceptively simple. Gracia accepts a\nbroadly contextualist understanding of what it is to be Latino, the\nconsequence of which is that “[w]hat Latino philosophy is, when\nit is understood ethnically, can be asked only in the context of the\nLatino ethnos” (2008: 141). That is, whether a work of\nphilosophy counts as a work of Latino philosophy is never a\ntranshistorical fact, as it were, but always something indexed to a\nlocal, historically-specific standard given by the ethnos.\n\nGracia understands himself to be committed to a kind of\nnon-essentialism about both Latinxs and Hispanics. Although there is\nthe general fact of an ethnos-defining set of historical events to\nwhich many people are related, the standards of membership in the\ngroup is always contingent on those facts plus local facts\nabout which particular kinds and degrees of relations matter. So,\nwhether Frantz Fanon—born in Martinique—counts as a Latino\nphilosopher depends in part of what a given, historically specific\nstandard of Latino membership\n specifies.[16]\n\n\nGracia’s original and distinctive proposal for how to understand\nthe term Latinx philosophy was perhaps the first account to explicitly\ndefine the term “Latino philosophy”. It has the virtue of\nbeing continuous with his well-developed and extensively defended\naccounts of ethnic philosophy, Hispanic philosophy, and Latin American\nphilosophy. It also faces challenges along multiple dimensions.\n\nFirst, notice that Gracia’s account doesn’t specify what\nLatinx philosophy actually is, here and now. Rather, it gives\nus a kind of formula for defining it: we are to look to the ethnic\ngroup’s conception of Latinx philosophy. Second, putting aside\nthe various empirical and conceptual puzzles about how we would\ndetermine the ethnic group’s views (surveys? conceptual\nanalysis? patterns of linguistic usage?), it simply unclear there is\nanything in the views of the ethnos that would settle the question.\nThat is, it is entirely unclear that the ethnos has a conception of\nphilosophy—much less Latinx philosophy—that would settle\nthe reference of “Latinx philosophy”. Perhaps Gracia would\nregard this as an adequate result. Nevertheless, it is easy enough to\nsee why it might be attractive to others to have a more practicable\naccount of Latinx philosophy, one that tells us something about what\nthe term does (or ought to) pick out.\n\nSecond, several philosophers have noted that standard usages of\n“Latino” or “Latinx” is typically understood\nto pick out people living in non-Latin American countries who are\neither Latin American immigrants or descendants of Latin Americans\n(Llorente 2013: 73; Millán & Deere 2017; see also Mendieta\n 2011).[17]\n In contrast, Gracia’s conception of Latinos includes Latin\nAmericans residing in Latin America. An important reason for having a\nterm to pick out the narrower group—US Latinxs, we might say in\nan effort at provisional neutrality—is that the social position\nof Latinxs in the United States—and thus, of Latinx philosophers\nin the United States—is very different from the social position\nof Latin Americans in Latin America, and the position of Latin\nAmerican philosophers with respect to philosophy in the United States\nand\n beyond.[18]\n Thus, there is reason to be able to pick out and talk about\nphilosophy that is in some or another way specifically tied to Latinxs\nas conventionally understood, i.e., as a population of people outside\nof Latin America who are themselves either Latin Americans by origin\nor descendants of Latin Americans.\n\nCollectively, these concerns might be put as follows: even if there is\nsome useful category or property picked out by Gracia’s usage of\n“Latino”, his usage runs afoul of the standard usage of\nthe term, a term that reflects important differences between\nLatin-Americans-in-Latin-America and those people (and their\ndescendants) who reside outside of Latin America. Thus, if we accept\nGracia’s explicitly revisionist\n proposal[19]\n for using “Latino Philosophy”—a proposal according\nto which Latin American nationals doing philosophy in Latin America\nare doing Latinx philosophy—the worry is that it displaces a\nmore natural and explanatorily helpful usage of the term.\n\nRenzo Llorente (2013) has made the striking proposal that the\ndifficulties with Gracia’s revisionism about\n“Latino”—particularly the way it departs from\nexclusively picking out US Latinos—is grounds for abandoning the\nterm “Latino philosophy”. In its stead, he recommends\nsticking with the older and more familiar categories of Latin American\nand Hispanic philosophy.\n\nThis proposal has its own difficulties. For example, it would obscure\nwork by US Latina feminist philosophers, as well as other contemporary\nphilosophers working on Latinx-connected issues. Those works all have\na relatively clear claim on being an instance of Latinx philosophy, in\na way that doesn’t do violence to either ordinary or standard\nspecialist understandings of “Latinx” and\n“philosophy”. Because there is a discernible body of work\nthere, united by an interest that we can helpfully and accurately\ndesignate with the term “Latinx philosophy”, abandoning\nthe term would produce no gain, but it would entail a loss of\nexpressive precision.\n3.2 Source vs. Subject Matter\n\nOne might accept a narrower scope for the term “Latinx”,\nbut emphasis that the right understanding of “Latinx\nphilosophy” is defined in terms of the source of the\nphilosophical work, rather than its subject or content. That is, one\ncould accept that “Latinx philosophy” picks out Latinxs as\nconventionally understood, and treats Latinx philosophy as the\nphilosophy produced by that group, rather than being\nphilosophy about that group. This proposal would respect\nstandard usage of the term without denying that there can be important\nrelationships between Hispanic, Latin American, and Latinx philosophy.\nFurther, it would allow us to think of Latinx philosophy as an ethnic\nphilosophy, i.e., philosophy (whatever that is) that is produced by a\nspecific ethnos (whatever that comes to). One appeal to thinking of\nLatinx philosophy in this way—as unified by its source (i.e.,\nLatinxs)—is that it is continuous with other familiar ways of\ncharacterizing some parts of philosophy. That is, it is a familiar to\nthing to characterize some parts of philosophy in terms of their\nsource (e.g., Asian philosophy; German philosophy; European philosophy\netc.).\n\nHowever, a source-based characterization of Latinx philosophy remains\nat odds with current usage. Consider a Latina philosopher who spends\nher life work on the philosophy of quantum mechanics, or on set\ntheory, or on free will. Suppose she has no interest in social\nidentity and does not think of her work as in any way informed,\nconnected to, or directly relevant to Latinxs. On a source-based\naccount, she would nevertheless count as doing Latinx philosophy. This\nseems strange. Inverse cases generate infelicitous results as well.\nConsider a scholar who is not Latinx but who exclusively works on\nquestions of Latinx identity, the politics of Latinx immigration, and\ntopics in Latina feminism. On a source-based conception, such a\nscholar could not be said to be working on Latinx philosophy, at least\nnot in the sense under consideration.\n\nCurrent linguistic convention suggests that a subject-based\ncharacterization of the field is preferable. Construing the field as\ndefined by subject matter—i.e., philosophy that is concerned\nwith Latinxs—gets the right results in the cases mentioned\nabove. That is, non-Latinxs can do Latinx philosophy, and Latinxs can\ndo philosophy that isn’t Latinx\n philosophy.[20]\n Moreover, subject-based approaches to defining a field is already\nfamiliar from our standard understandings of, for example, ethics,\nmetaphysics, and epistemology. To be sure, the appeal of a\nsubject-based characterization depends in large part on whether it\npicks out anything of interest. The body of work gestured at in this\nentry makes the case for that conception.\n\nWhy not pluralism, allowing for different construals of the scope and\ncontent of Latinx philosophy? In everyday discourse, we are prepared\nto allow that any number of terms admit of multiple meanings, picking\nout different, if sometimes overlapping things. In Southern\nCalifornia, “Mexican” can refer to both Mexican nationals\nand to nth-generation US citizens descended from Mexican\n nationals.[21]\n Given the fact that many terms have multiple meanings, perhaps there\nis room for both a source-based and subject-based account of Latinx\nphilosophy? Perhaps there is. Still, there is reason to plump for a\nsingle privileged meaning in disciplinary contexts: labels and\ncharacterizations of a nascent subject matter are the public face of\nthe field. When a field is more mature and there are plenty of\nfamiliar and undisputed exemplars of it, the precise characterizations\nof a field is less pragmatically significant and more a matter of\ntaxonomical fussiness. In light of this, there seems to be at least\nsome reason to prefer to think of Latinx philosophy in terms of its\nsubject matter, i.e., as philosophy concerned in some substantive way\nwith Latinxs.\n4. Ongoing Developments\n\nGiven how the contents of Latinx philosophy has been partly propelled\nby the experiences and interests of Latinxs, it plausibly matters that\nthe demographics of the philosophers working on Latinx philosophy is\nchanging. A substantial portion of the early work in Latinx\nphilosophy, especially work recognized as straightforwardly academic\nphilosophy, has been done by scholars who were born outside of the\nUnited\n States.[22]\n Over the past decade, however, there has been a marked increase of\nwork on Latinx philosophy by US-born philosophers, and in particular,\nby Mexican American philosophers. Along with this change has been\nincreased attention in the idea of a specifically “Mexican\nAmerican philosophy”. It remains to be seen the extent to which\nthose working on issues within the ambit of Latinx philosophy will\ncontinue to focus on a broader Latinx landscape, as previous\ngenerations have done, or whether newer work will tend to focus on\nmore narrowly circumscribed topics.\n\nQuestions about the demographic makeup of the philosophers and its\nconsequences for the discipline has been a matter of increased\nattention the academy. Presumably, these discussions will continue\nuntil as long as academics remain concerned about discrepancies\nbetween the academy and the populations it serves. However, one thread\nthat is oftentimes implicit but only infrequently taken up concerns\nthe possibility of duties (real or imagined, moral or otherwise) that\nLatinx scholars have to undertake engagement with Latin American and\nLatinx philosophy (Gracia 2000: 159–188; J.L.A. García\n2001: 96–7; Covarrubias 2015). It is imaginable that as Latinx\nphilosophy grows, questions about who does it, what falls into its\nambit, and whether there are obligations to do Latinx philosophical\nscholarship in particular ways, will animate discussions within parts\nof the field.\n\nA third ongoing development involves more explicit ties between\nphilosophical work in Latin America and the United States In this\ncontext, a US-based academic field focused on Latinxs risks\nperpetuating epistemically and morally fraught practices with respect\nto Latin Americans. As noted above, a number of philosophers working\nin Latinx philosophy explicitly draw from and interact with aspects of\nLatin American philosophy. Similarly, there is some evidence of Latin\nAmerican attention on the work of US Latinx\n philosophy.[23]\n Given the differences in comparative support, visibility, and global\nprestige of academic work within the United States, it seems plausible\nthat academic work on Latinx philosophy in the United States will go a\nlong way towards defining the field internationally, including its\nterminology and its chief subjects. It is this fact—US academic\ninfluence on the global academy, and the way it can occlude the\ncontributions and work of those outside the US scene—that\nprovides the background for a worrisome set of possibilities about how\nwe understand Latinxs and their philosophical significance.\n\nFrom the standpoint of US-based academics, this risk may not be\nobvious. After all, the subject just is US populations, their\nexperiences, and the philosophical issues they raise. However, Latinxs\nare not just US populations. Latinxs are also, for example,\nmembers of the Salvadoran diaspora, indigenous Oaxacan laborers,\nArgentinian ex-patriate academics, and so on. Once we recognize these\nfacts, it is less obvious that US identity categories and frameworks\nshould be taken as presumptive, fundamental, or guiding when it comes\nto understanding the philosophical—phenomenological, conceptual,\nsocial, moral, political, etc.—significance of these\npopulations. Moreover, taking US identity categories as presumptive\nalso threatens to re-enact a tradition of\ndomination-and-description-from-without that has plagued Latin America\nsince its inception. So, given the fact of a field constructed on US\nidentity categories, and given the fact of US influence on the global\nacademy, the construction of the field’s categories and\npractices (and who may speak authoritatively about them) may itself\nbecome an important subject matter, especially in Latinx-Latin\nAmerican academic discussions.\n\nA final development worth noting here concerns methodological\nfrictions. There are philosophers working in Latinx philosophy whose\nphilosophical work is substantively structured by liberationist,\nactivist, or praxis-oriented methodologies. At the same time, there\nare philosophers working on Latinx philosophy who are drawn to other\nconceptions of philosophy, including versions committed to something\nlike a putatively disinterested search for truth, and/or philosophy in\nthe mode of a love of wisdom. Competing visions about what work is\nmethodologically preferable is a matter of ongoing contestation.\n\nThat said, it is not always clear that these differences in\nphilosophical orientation have the significance they are ordinarily\ntaken to have. Accounts of the phenomenology of racialized identities\nin the US subject to immigration pressures might speak to broader\nfeatures of human beings. At the same time, putatively\nnon-liberationist accounts of, say, the structure of responsible\nagency and how oppression alters it, might be thought to provide\nresources of its own for more straightforwardly liberationist\ntheories. So, although the broadly liberationist and\ntheory-for-its-own-sake threads of the subfield may sometimes find\nthemselves at cross-purposes, it is unclear that these disagreements\nneed to result in a deep fissure in the field. For the field as a\nwhole, one aspiration might be for philosophical work to have\n“exemplary validity”, i.e., philosophy that teaches us\nsomething about wider features of humanity without losing its cultural\nspecificity.\n\nStill, there is reason for caution. Philosophical fights about\nmethodology have consequences for what is viewed as inside and outside\nof a field. Moreover, scholars have noted that philosophical borders\nare oftentimes particularly vigorously patrolled—and worse, that\nthis has been especially so for work in Latinx (Ortega 2016:\n4–5) and Latin American (Vargas 2007: 61–63) philosophy.\nFor that reason, it is very likely that what counts as\n“good” work, or even as part of the field, will remain a\ncontested matter.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alberdi, Juan Bautista, 1842 [1978], “Ideas para un curso de\nfilosofía contemporánea” (“Ideas for a\nCourse in Philosophy”), presented at <em>Curso de\nFilosofía Contemporánea</em>, Montevideo. Reprinted in\n<em>Latinoamerica: Cuadernos de Cultura Latinoamericana</em>, 9,\nMéxico, D.F.: Universidad Nacional Autónoma de\nMéxico, 1978.\n [<a href=\"http://ru.ffyl.unam.mx//handle/10391/2953\" target=\"other\">Alberdi 1842 [1978] available online</a>]\n ",
                "Alcoff, Linda Martin, 1999, “Latina/o Identity\nPolitics”, in Batstone &amp; Mendieta 1999: 93–112.",
                "–––, 2000, “Is Latina/o Identity a Racial\nIdentity?” in Gracia &amp; De Greiff 2000: 23–44.",
                "–––, 2003, “Latino/as, Asian Americans,\nand the Black/White Binary”, <em>The Journal of Ethics</em>,\n7(1): 5–27. doi:10.1023/A:1022870628484",
                "–––, 2006, <em>Visible Identities: Race, Gender,\nand the Self</em>, New York: Oxford University Press.\ndoi:10.1093/0195137345.001.0001",
                "–––, 2015, <em>The Future of Whiteness</em>,\nCambridge, UK: Polity Press.",
                "Alcoff, Linda Martin and Eduardo Mendieta (eds.), 2000,\n<em>Thinking from the Underside of History: Enrique Dussel’s\nPhilosophy of Liberation</em>, Lanham, MD: Rowman &amp; Littlefield\nPublishers.",
                "Anzalduá, Gloria, 1987, <em>Borderlands/La Frontera: The\nNew Mestiza</em>, (Chicana Studies), San Francisco, CA: Aunt Lute\nBooks.",
                "Batstone, David B. and Eduardo Mendieta (eds), 1999, <em>The Good\nCitizen</em>, New York: Routledge.",
                "Barvosa, Edwina, 2008, <em>Wealth of Selves: Multiple Identities,\nMestiza Consciousness, and the Subject of Politics</em>, (Rio\nGrande/Río Bravo, no. 14), College Station, TX: Texas A&amp;M\nUniversity Press.",
                "Bello, Andrés, 1848 [1978], “Autonomia Cultural de\nAmérica” (“The Cultural Autonomy of\nAmerica”), <em>El Araucano</em>, Santiago de Chile. Reprinted in\n<em>Latinoamerica: Cuadernos de Cultura Latinoamericana</em>, 11,\nMéxico, D.F.: Universidad Nacional Autónoma de\nMéxico, 1978.\n [<a href=\"http://ru.ffyl.unam.mx/handle/10391/2955\" target=\"other\">Bello 1848 [1978] available online</a>]\n ",
                "Bernstein, Richard J., 2001, “Comment on <em>Hispanic/Latino\nIdentity</em> by J.J.E. Gracia”, <em>Philosophy and Social\nCriticism</em>, 27(2): 44–50.\ndoi:10.1177/019145370102700206",
                "Bilbao, Francisco, 1856 [1978], “Iniciativa de la America:\nIdea de un Congreso Federal de las Republicas”(“Initiative\nof America: The Idea of a Federal Congress of the Republics ”),\nPublic presentation in Paris. Reprinted in <em>Latinoamerica:\nCuadernos de Cultura Latinoamericana</em>, 3, México, D.F.:\nUniversidad Nacional Autónoma de México, 1978.\n [<a href=\"http://ru.ffyl.unam.mx/handle/10391/2947\" target=\"other\">Bilbao 1856 [1978] available online</a>]\n ",
                "Blum, Lawrence, 2009, “Latinos on Race and Ethnicity:\nAlcoff, Corlett, and Gracia”, in Nuccetelli, Schutte, and Bueno\n2009: 269–282. doi:10.1002/9781444314847.ch19",
                "Carranza, Elihu, 1978, <em>Chicanismo: Philosophical\nFragments</em>, Dubuque, IA: Kendall/Hunt Pub. Co.",
                "Casanova, Pascale, 1999 [2004], <em>La république mondiale\ndes lettres</em>, Paris: Éditions du Seuil. Translated as\n<em>The World Republic of Letters</em>, Malcolm B. DeBevoise (trans.),\nCambridge, MA: Harvard University Press, 2004.",
                "Cisneros, Natalie, 2013, “‘Alien’ Sexuality:\nRace, Maternity, and Citizenship”, <em>Hypatia</em>, 28(2):\n290–306. doi:10.1111/hypa.12023",
                "Corlett, J. Angelo, 2000, “Latino Identity and Affirmative\nAction.” in Gracia &amp; De Greiff 2000: 223–234.",
                "–––, 2003, <em>Race, Racism, and\nReparations</em>, Ithaca, NY: Cornell University Press.",
                "Covarrubias, Julio, 2015, “Report on the 2015 Fleishhacker\nChair Lecture Series and Latin American Philosophy Conference”,\n<em>APA Newsletter on Hispanic/Latino Issues in Philosophy</em>,\n15(1): 2–8.",
                "Cruz Revueltas, Juan Cristóbal, 2003, <em>La\nfilosofía en América Latina como problema</em>, Mexico\nCity: Publicaciones Cruz.",
                "Dussel, Enrique, Eduardo Mendieta, &amp; Carmen Bohórquez\n(eds.), 2011, <em>El pensamiento filosófico latinoamericano,\ndel Caribe y “latino” (1300–2000) : historia,\ncorrientes, temas y filósofos.</em> México, D.F.: Siglo\nXXI.",
                "Ezcurdia, Maite, 2003, “Originalidad y presencia”, in\nCruz Revueltas 2003: 196–202.",
                "Gallegos, Sergio A., forthcoming, “Mestizaje as an\nEpistemology of Ignorance: The Case of the Mexican Genome Diversity\nProject”, in Nancy McHugh &amp; Heidi Grasswick (eds.),\n<em>Making the Case: Feminists and Critical Race Theorists Investigate\nCase Studies</em>, Albany, NY: SUNY Press.",
                "Gallegos de Castillo, Lori, 2016, “Skillful Coping and the\nRoutine of Surviving: Isasi-Díaz on the Importance of Identity\nto Everyday Knowledge”,<em>APA Newsletter on Hispanic/Latino\nIssues</em>, 15(2): 7–11.",
                "Garcia, Ignacio, 2015, “Chicano Movement”, <em>Oxford\nBibliographies Online</em>, Oxford: Oxford University Press,\ndoi:10.1093/obo/9780199913701-0092",
                "García, J.L.A., 2001, “Is Being Hispanic an Identity?\nReflections on J. J. E. Gracia’s Account”, <em>Philosophy\nand Social Criticism</em>, 27(2): 29–43.\ndoi:10.1177/019145370102700205",
                "Gracia, Jorge J.E., 1995, “Latin American Philosophy”,\nin <em>The Oxford Companion to Philosophy</em>, Ted Honderich (ed.),\nOxford; New York: Oxford University Press, pp. 462–463.",
                "–––, 2000, <em>Hispanic/Latino Identity: A\nPhilosophical Perspective</em>, Malden, MA: Blackwell Publishers.",
                "–––, 2005, <em>Surviving Race, Ethnicity, and\nNationality: A Challenge for the Twenty-First Century</em>, Oxford:\nRowman &amp; Littlefield.",
                "––– (ed.), 2007, <em>Race or Ethnicity? On Black\nand Latino Identity</em>, Ithaca, NY: Cornell University Press.",
                "–––, 2008, <em>Latinos in America: Philosophy\nand Social Identity</em>, Malden, MA: Blackwell.",
                "––– (ed.), 2011, <em>Forging People: Race,\nEthnicity, and Nationality in Hispanic American and Latino/a\nThought</em>, Notre Dame, IN: University of Notre Dame Press.",
                "–––, 2013, “Latinos in America: A\nResponse”, <em>The Journal of Speculative Philosophy</em>,\n27(1): 95–111.",
                "Gracia, Jorge J. E and Pablo De Greiff (eds), 2000,\n<em>Hispanics/Latinos in the United States: Ethnicity, Race, and\nRights</em>, New York: Routledge.",
                "Gracia, Jorge and Manuel Vargas, 2018, “Latin American\nPhilosophy”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2018), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/latin-american-philosophy/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/latin-american-philosophy/</a>&gt;",
                "González, María Cristina and Nora Stigol, 2013,\n“Gracia on Latino and Latin American Philosophy”, <em>The\nJournal of Speculative Philosophy</em>, 27(1): 79–90.",
                "Henry, Paget, 2000, <em>Caliban’s Reason: Introducing\nAfro-Caribbean Philosophy</em>, New York: Routledge.",
                "Isasi-Díaz, Ada María and Eduardo Mendieta (eds.),\n2012, <em>Decolonizing Epistemologies: Latina/o Theology and\nPhilosophy</em>, New York: Fordham University Press.",
                "Jaksić, Iván (ed.), 2015, <em>Debating Race,\nEthnicity, and Latino Identity: Jorge J. E. Gracia and His\nCritics</em>, New York: Columbia University Press.",
                "Lewis, Christopher, forthcoming, “Latinos and the Principles\nof Racial Demography”, <em>Du Bois Review: Social Science\nResearch on Race</em>.",
                "Llorente, Renzo, 2013, “Gracia on Hispanic and Latino\nIdentity”, <em>The Journal of Speculative Philosophy</em>,\n27(1): 67–78.",
                "Luger, Chelsey, 2018, “How the U.S.-Mexico Border Has Split\nthe Tohono O’odham”, <em>High Country News</em>, March 19,\nURL =\n &lt;<a href=\"https://www.hcn.org/issues/50.5/tribal-affairs-how-the-u-s-mexico-border-has-split-the-tohono-oodham\" target=\"other\">https://www.hcn.org/issues/50.5/tribal-affairs-how-the-u-s-mexico-border-has-split-the-tohono-oodham</a>&gt;",
                "Lugones, María, 1987, “Playfulness,\n‘World’-Travelling, and Loving Perception”,\n<em>Hypatia</em>, 2(2): 3–19.\ndoi:10.1111/j.1527-2001.1987.tb01062.x",
                "–––, 1994, “Purity, Impurity, and\nSeparation”, <em>Signs</em>, 19(2): 458–479.\ndoi:10.1086/494893",
                "–––, 2003, <em>Pilgrimages/Peregrinajes:\nTheorizing Coalition Against Multiple Oppressions</em>, Lanham, MD:\nRowman &amp; Littlefield.",
                "–––, 2010, “Toward a Decolonial\nFeminism”, <em>Hypatia</em>, 25(4): 742–759.\ndoi:10.1111/j.1527-2001.2010.01137.x",
                "Madva, Alex, 2016, “Implicit Bias and Latina/os in\nPhilosophy”, <em>APA Newsletter on Hispanic/Latino Issues in\nPhilosophy</em>, 16(1): 8–15.",
                "Magallón Anaya, Mario, 1991, <em>Dialéctica de la\nfilosofía latinoamericana: una filosofía en la\nhistoria</em>, México, D.F.: AutonUniversidad Nacional\nAutónoma de México.",
                "McGary, Howard, 2013, “Gracia on Affirmative Action for\nLatinos”, <em>Journal of Speculative Philosophy</em>, 27(1):\n91–95.",
                "Maldonado-Torres, Nelson, 2008, <em>Against War: Views from the\nUnderside of Modernity</em>, Durham, NC: Duke University Press.",
                "Mendieta, Eduardo, 1999, “Becoming Citizens, Becoming\nHispanics”, in Batstone &amp; Mendieta 1999: 113–132.",
                "–––, 2003, “At the Limits of Political\nTheory: Culture, Property and Latinos”, <em>Philosophy and\nSocial Criticism</em>, 29(1): 71–83.\ndoi:10.1177/0191453703029001834",
                "–––, 2011, “La filosofía de los\n‘Latinos’ en Estados Unidos”, in Dussel, Mendieta,\n&amp; Bohórquez 2011: 518–522.",
                "–––, 2016, “Philosophy of\nLiberation”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2016), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/liberation/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/liberation/</a>&gt;",
                "Mendoza, José Jorge, 2016, <em>The Moral and Political\nPhilosophy of Immigration</em>, Lanham, MD: Lexington Books.",
                "–––, 2017 “Latinx and the Future of\nWhiteness in American Democracy”, <em>APA Newsletter on\nHispanic/Latino Issues in Philosophy</em>, 16(2): 6–10.",
                "Millán, Elizabeth and Don T. Deere, 2017, “History of\nLatino/a Philosophy”, <em>Oxford Bibliographies Online</em>,\nOxford: Oxford University Press.\ndoi:10.1093/obo/9780199913701-0118",
                "Moraga, Cherríe and Gloria Anzaldúa, 1981, <em>This\nBridge Called my Back: Writings by Radical Women of Color</em>,\nWatertown, MA: Persephone Press.",
                "Nuccetelli, Susana, 2017, “Latin American Philosophy:\nMetaphilosophical Foundations”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2017), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2017/entries/latin-american-metaphilosophy/\" target=\"other\">https://plato.stanford.edu/archives/fall2017/entries/latin-american-metaphilosophy/</a>&gt;",
                "Nuccetelli, Susana, Ofelia Schutte, and Otvio Bueno (eds.), 2009,\n<em>A Companion to Latin American Philosophy</em>, Oxford, UK:\nWiley-Blackwell. doi:10.1002/9781444314847",
                "Orosco, José-Antonio, 2016a, <em>Toppling the Melting Pot:\nImmigration and Multiculturalism in American Pragmatism</em>,\nBloomington, IN: Indiana University Press.",
                "–––, 2016b, “The Philosophical Gift of\nBrown Folks: Mexican American Philosophy in the United States”,\n<em>APA Newsletter on Hispanic/Latino Issues in Philosophy</em>,\n15(2): 23–28.",
                "Ortega, Mariana, 2016, <em>In-Between: Latina Feminist\nPhenomenology, Multiplicity, and the Self</em>, Albany, NY: SUNY\nPress.",
                "Pappas, Gregory, 2011, “The Latino Character of American\nPragmatism”, in Gregory Pappas (ed.), <em>Pragmatism in the\nAmericas</em>, New York: Fordham University Press.",
                "Pereda, Carlos, 2006, “Latin American Philosophy: Some\nVices”, <em>Journal of Speculative Philosophy</em>, 20(3):\n192–203.",
                "Quijano, Anibal, 2000, “Coloniality of Power, Eurocentrism,\nand Latin America”, <em>Nepantla</em>, 1(3): 533–580.",
                "Reed-Sandoval, Amy, 2016a, “‘Immigrant’ or\n‘Exiled’? Reconceiving the Desplazada/os of Latin American\nand Latina/o Philosophy”, <em>APA Newsletter on Hispanic/Latino\nIssues in Philosophy</em>, 15(2): 11–14.",
                "–––, 2016b, “Oaxacan Transborder\nCommunities and the Political Philosophy of Immigration”,\n<em>International Journal of Applied Philosophy</em>, 30(1):\n91–104. doi:10.5840/ijap201641457",
                "Rodriguez-Pereyra, Gonzalo, 2013, “The Language of\nPublication of ‘Analytic’ Philosophy”,\n<em>Crítica: Revista Hispanoamericana de Filosofía</em>,\n45(133): 83–90.\n [<a href=\"https://doi.org/10.22201/iifs.18704905e.2013.718\" target=\"other\">Rodriguez-Pereyra 2013 available online</a>]",
                "Romano, Octavio Ignacio, 1969, “The Intellectual and\nHistorical Presence of Mexican-Americans”, <em>El Grito: A\nJournal of Contemporary Mexican-American Thought</em>, II(2):\n32–46.",
                "Ruíz, Elena, 2016 “Existentialism for Postcolonials:\nFanon and the Politics of Authenticity”, <em>APA Newsletter on\nHispanic/Latino Issues in Philosophy</em>, 15(2): 19–22.",
                "Sánchez, Carlos Alberto, 2012, <em>The Suspension of\nSeriousness: on the Phenomenology of Jorge Portilla</em>, Albany, NY:\nSUNY Press.",
                "–––, 2016, <em>Contingency and Commitment:\nMexican Existentialism and the Place of Philosophy</em>, Albany, NY:\nSUNY Press.",
                "Sánchez, Robert Eli, Jr., 2013, “The Process of\nDefining Latino/a Philosophy”, <em>APA Newsletter on\nHispanic/Latino Issues</em>, 13(1): 1–4.",
                "Schutte, Ofelia, 1993, <em>Cultural Identity and Social Liberation\nin Latin American Thought</em>, Albany, NY: SUNY Press.",
                "–––, 1998, “Cultural Alterity:\nCross-Cultural Communication and Feminist Theory in North-South\nContexts”, <em>Hypatia</em>, 13(2): 53–72.\ndoi:10.1111/j.1527-2001.1998.tb01225.x",
                "–––, 2000, “Negotiating Latina\nIdentities”, in Gracia &amp; De Greiff 2000: 61–76.",
                "Silva, Grant J., 2015a “Embodying a ‘New’ Color\nLine: Racism, Anti-Immigrant Sentiment and Racial Identities in the\n‘Postracial’ Era”, <em>Knowledge Cultures</em>,\n3(1): 65–90.",
                "–––, 2015b, “Why the Struggle Against\nColoniality is Paramount to Latin American Philosophy”, <em>APA\nNewsletter on Hispanic/Latino Issues</em>, 15(1): 8–12.",
                "Soldatenko, Michael, 1996, “Perspectivist Chicano Studies,\n1970–1985”, <em>Ethnic Studies Review</em>, 19(2–3):\n181–208.",
                "Spencer, Quayshawn, 2018, “Racial Realism II: Are Folk Races\nReal?”, <em>Philosophy Compass</em>, 13(1): e12467;\ndoi:10.1111/phc3.12467",
                "Sundstrom, Ronald Robles, 2008, <em>The Browning of America and\nthe Evasion of Social Justice</em>, Albany, NY: SUNY Press.",
                "Vargas, Manuel, 2007, “‘Real’ Philosophy,\nMetaphilosophy, and Metametaphilosophy”, <em>CR: The New\nCentennial Review</em>, 7(3): 51–78. doi:10.1353/ncr.0.0006",
                "von Vacano, Diego A., 2012, <em>The Color of Citizenship: Race,\nModernity and Latin American/Hispanic Political Thought</em>, New\nYork: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199746668.001.0001",
                "Velazco y Trianosky, Gregory, 2009, “‘Mestizaje’\nand Hispanic Identity”, in Nuccetelli, Schutte, and Bueno 2009:\n283–296. doi:10.1002/9781444314847.ch20",
                "Yancy, George (ed.), 2012, <em>Reframing the Practice of\nPhilosophy: Bodies of Color, Bodies of Knowledge</em>, Albany, NY:\nSUNY Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alberdi, Juan Bautista, 1842 [1978], “Ideas para un curso de\nfilosofía contemporánea” (“Ideas for a\nCourse in Philosophy”), presented at <em>Curso de\nFilosofía Contemporánea</em>, Montevideo. Reprinted in\n<em>Latinoamerica: Cuadernos de Cultura Latinoamericana</em>, 9,\nMéxico, D.F.: Universidad Nacional Autónoma de\nMéxico, 1978.\n [<a href=\"http://ru.ffyl.unam.mx//handle/10391/2953\" target=\"other\">Alberdi 1842 [1978] available online</a>]\n </li>\n<li>Alcoff, Linda Martin, 1999, “Latina/o Identity\nPolitics”, in Batstone &amp; Mendieta 1999: 93–112.</li>\n<li>–––, 2000, “Is Latina/o Identity a Racial\nIdentity?” in Gracia &amp; De Greiff 2000: 23–44.</li>\n<li>–––, 2003, “Latino/as, Asian Americans,\nand the Black/White Binary”, <em>The Journal of Ethics</em>,\n7(1): 5–27. doi:10.1023/A:1022870628484</li>\n<li>–––, 2006, <em>Visible Identities: Race, Gender,\nand the Self</em>, New York: Oxford University Press.\ndoi:10.1093/0195137345.001.0001</li>\n<li>–––, 2015, <em>The Future of Whiteness</em>,\nCambridge, UK: Polity Press.</li>\n<li>Alcoff, Linda Martin and Eduardo Mendieta (eds.), 2000,\n<em>Thinking from the Underside of History: Enrique Dussel’s\nPhilosophy of Liberation</em>, Lanham, MD: Rowman &amp; Littlefield\nPublishers.</li>\n<li>Anzalduá, Gloria, 1987, <em>Borderlands/La Frontera: The\nNew Mestiza</em>, (Chicana Studies), San Francisco, CA: Aunt Lute\nBooks.</li>\n<li>Batstone, David B. and Eduardo Mendieta (eds), 1999, <em>The Good\nCitizen</em>, New York: Routledge.</li>\n<li>Barvosa, Edwina, 2008, <em>Wealth of Selves: Multiple Identities,\nMestiza Consciousness, and the Subject of Politics</em>, (Rio\nGrande/Río Bravo, no. 14), College Station, TX: Texas A&amp;M\nUniversity Press.</li>\n<li>Bello, Andrés, 1848 [1978], “Autonomia Cultural de\nAmérica” (“The Cultural Autonomy of\nAmerica”), <em>El Araucano</em>, Santiago de Chile. Reprinted in\n<em>Latinoamerica: Cuadernos de Cultura Latinoamericana</em>, 11,\nMéxico, D.F.: Universidad Nacional Autónoma de\nMéxico, 1978.\n [<a href=\"http://ru.ffyl.unam.mx/handle/10391/2955\" target=\"other\">Bello 1848 [1978] available online</a>]\n </li>\n<li>Bernstein, Richard J., 2001, “Comment on <em>Hispanic/Latino\nIdentity</em> by J.J.E. Gracia”, <em>Philosophy and Social\nCriticism</em>, 27(2): 44–50.\ndoi:10.1177/019145370102700206</li>\n<li>Bilbao, Francisco, 1856 [1978], “Iniciativa de la America:\nIdea de un Congreso Federal de las Republicas”(“Initiative\nof America: The Idea of a Federal Congress of the Republics ”),\nPublic presentation in Paris. Reprinted in <em>Latinoamerica:\nCuadernos de Cultura Latinoamericana</em>, 3, México, D.F.:\nUniversidad Nacional Autónoma de México, 1978.\n [<a href=\"http://ru.ffyl.unam.mx/handle/10391/2947\" target=\"other\">Bilbao 1856 [1978] available online</a>]\n </li>\n<li>Blum, Lawrence, 2009, “Latinos on Race and Ethnicity:\nAlcoff, Corlett, and Gracia”, in Nuccetelli, Schutte, and Bueno\n2009: 269–282. doi:10.1002/9781444314847.ch19</li>\n<li>Carranza, Elihu, 1978, <em>Chicanismo: Philosophical\nFragments</em>, Dubuque, IA: Kendall/Hunt Pub. Co.</li>\n<li>Casanova, Pascale, 1999 [2004], <em>La république mondiale\ndes lettres</em>, Paris: Éditions du Seuil. Translated as\n<em>The World Republic of Letters</em>, Malcolm B. DeBevoise (trans.),\nCambridge, MA: Harvard University Press, 2004.</li>\n<li>Cisneros, Natalie, 2013, “‘Alien’ Sexuality:\nRace, Maternity, and Citizenship”, <em>Hypatia</em>, 28(2):\n290–306. doi:10.1111/hypa.12023</li>\n<li>Corlett, J. Angelo, 2000, “Latino Identity and Affirmative\nAction.” in Gracia &amp; De Greiff 2000: 223–234.</li>\n<li>–––, 2003, <em>Race, Racism, and\nReparations</em>, Ithaca, NY: Cornell University Press.</li>\n<li>Covarrubias, Julio, 2015, “Report on the 2015 Fleishhacker\nChair Lecture Series and Latin American Philosophy Conference”,\n<em>APA Newsletter on Hispanic/Latino Issues in Philosophy</em>,\n15(1): 2–8.</li>\n<li>Cruz Revueltas, Juan Cristóbal, 2003, <em>La\nfilosofía en América Latina como problema</em>, Mexico\nCity: Publicaciones Cruz.</li>\n<li>Dussel, Enrique, Eduardo Mendieta, &amp; Carmen Bohórquez\n(eds.), 2011, <em>El pensamiento filosófico latinoamericano,\ndel Caribe y “latino” (1300–2000) : historia,\ncorrientes, temas y filósofos.</em> México, D.F.: Siglo\nXXI.</li>\n<li>Ezcurdia, Maite, 2003, “Originalidad y presencia”, in\nCruz Revueltas 2003: 196–202.</li>\n<li>Gallegos, Sergio A., forthcoming, “Mestizaje as an\nEpistemology of Ignorance: The Case of the Mexican Genome Diversity\nProject”, in Nancy McHugh &amp; Heidi Grasswick (eds.),\n<em>Making the Case: Feminists and Critical Race Theorists Investigate\nCase Studies</em>, Albany, NY: SUNY Press.</li>\n<li>Gallegos de Castillo, Lori, 2016, “Skillful Coping and the\nRoutine of Surviving: Isasi-Díaz on the Importance of Identity\nto Everyday Knowledge”,<em>APA Newsletter on Hispanic/Latino\nIssues</em>, 15(2): 7–11.</li>\n<li>Garcia, Ignacio, 2015, “Chicano Movement”, <em>Oxford\nBibliographies Online</em>, Oxford: Oxford University Press,\ndoi:10.1093/obo/9780199913701-0092</li>\n<li>García, J.L.A., 2001, “Is Being Hispanic an Identity?\nReflections on J. J. E. Gracia’s Account”, <em>Philosophy\nand Social Criticism</em>, 27(2): 29–43.\ndoi:10.1177/019145370102700205</li>\n<li>Gracia, Jorge J.E., 1995, “Latin American Philosophy”,\nin <em>The Oxford Companion to Philosophy</em>, Ted Honderich (ed.),\nOxford; New York: Oxford University Press, pp. 462–463.</li>\n<li>–––, 2000, <em>Hispanic/Latino Identity: A\nPhilosophical Perspective</em>, Malden, MA: Blackwell Publishers.</li>\n<li>–––, 2005, <em>Surviving Race, Ethnicity, and\nNationality: A Challenge for the Twenty-First Century</em>, Oxford:\nRowman &amp; Littlefield.</li>\n<li>––– (ed.), 2007, <em>Race or Ethnicity? On Black\nand Latino Identity</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 2008, <em>Latinos in America: Philosophy\nand Social Identity</em>, Malden, MA: Blackwell.</li>\n<li>––– (ed.), 2011, <em>Forging People: Race,\nEthnicity, and Nationality in Hispanic American and Latino/a\nThought</em>, Notre Dame, IN: University of Notre Dame Press.</li>\n<li>–––, 2013, “Latinos in America: A\nResponse”, <em>The Journal of Speculative Philosophy</em>,\n27(1): 95–111.</li>\n<li>Gracia, Jorge J. E and Pablo De Greiff (eds), 2000,\n<em>Hispanics/Latinos in the United States: Ethnicity, Race, and\nRights</em>, New York: Routledge.</li>\n<li>Gracia, Jorge and Manuel Vargas, 2018, “Latin American\nPhilosophy”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2018), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/latin-american-philosophy/\" target=\"other\">https://plato.stanford.edu/archives/sum2018/entries/latin-american-philosophy/</a>&gt;</li>\n<li>González, María Cristina and Nora Stigol, 2013,\n“Gracia on Latino and Latin American Philosophy”, <em>The\nJournal of Speculative Philosophy</em>, 27(1): 79–90.</li>\n<li>Henry, Paget, 2000, <em>Caliban’s Reason: Introducing\nAfro-Caribbean Philosophy</em>, New York: Routledge.</li>\n<li>Isasi-Díaz, Ada María and Eduardo Mendieta (eds.),\n2012, <em>Decolonizing Epistemologies: Latina/o Theology and\nPhilosophy</em>, New York: Fordham University Press.</li>\n<li>Jaksić, Iván (ed.), 2015, <em>Debating Race,\nEthnicity, and Latino Identity: Jorge J. E. Gracia and His\nCritics</em>, New York: Columbia University Press.</li>\n<li>Lewis, Christopher, forthcoming, “Latinos and the Principles\nof Racial Demography”, <em>Du Bois Review: Social Science\nResearch on Race</em>.</li>\n<li>Llorente, Renzo, 2013, “Gracia on Hispanic and Latino\nIdentity”, <em>The Journal of Speculative Philosophy</em>,\n27(1): 67–78.</li>\n<li>Luger, Chelsey, 2018, “How the U.S.-Mexico Border Has Split\nthe Tohono O’odham”, <em>High Country News</em>, March 19,\nURL =\n &lt;<a href=\"https://www.hcn.org/issues/50.5/tribal-affairs-how-the-u-s-mexico-border-has-split-the-tohono-oodham\" target=\"other\">https://www.hcn.org/issues/50.5/tribal-affairs-how-the-u-s-mexico-border-has-split-the-tohono-oodham</a>&gt;</li>\n<li>Lugones, María, 1987, “Playfulness,\n‘World’-Travelling, and Loving Perception”,\n<em>Hypatia</em>, 2(2): 3–19.\ndoi:10.1111/j.1527-2001.1987.tb01062.x</li>\n<li>–––, 1994, “Purity, Impurity, and\nSeparation”, <em>Signs</em>, 19(2): 458–479.\ndoi:10.1086/494893</li>\n<li>–––, 2003, <em>Pilgrimages/Peregrinajes:\nTheorizing Coalition Against Multiple Oppressions</em>, Lanham, MD:\nRowman &amp; Littlefield.</li>\n<li>–––, 2010, “Toward a Decolonial\nFeminism”, <em>Hypatia</em>, 25(4): 742–759.\ndoi:10.1111/j.1527-2001.2010.01137.x</li>\n<li>Madva, Alex, 2016, “Implicit Bias and Latina/os in\nPhilosophy”, <em>APA Newsletter on Hispanic/Latino Issues in\nPhilosophy</em>, 16(1): 8–15.</li>\n<li>Magallón Anaya, Mario, 1991, <em>Dialéctica de la\nfilosofía latinoamericana: una filosofía en la\nhistoria</em>, México, D.F.: AutonUniversidad Nacional\nAutónoma de México.</li>\n<li>McGary, Howard, 2013, “Gracia on Affirmative Action for\nLatinos”, <em>Journal of Speculative Philosophy</em>, 27(1):\n91–95.</li>\n<li>Maldonado-Torres, Nelson, 2008, <em>Against War: Views from the\nUnderside of Modernity</em>, Durham, NC: Duke University Press.</li>\n<li>Mendieta, Eduardo, 1999, “Becoming Citizens, Becoming\nHispanics”, in Batstone &amp; Mendieta 1999: 113–132.</li>\n<li>–––, 2003, “At the Limits of Political\nTheory: Culture, Property and Latinos”, <em>Philosophy and\nSocial Criticism</em>, 29(1): 71–83.\ndoi:10.1177/0191453703029001834</li>\n<li>–––, 2011, “La filosofía de los\n‘Latinos’ en Estados Unidos”, in Dussel, Mendieta,\n&amp; Bohórquez 2011: 518–522.</li>\n<li>–––, 2016, “Philosophy of\nLiberation”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2016), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/liberation/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/liberation/</a>&gt;</li>\n<li>Mendoza, José Jorge, 2016, <em>The Moral and Political\nPhilosophy of Immigration</em>, Lanham, MD: Lexington Books.</li>\n<li>–––, 2017 “Latinx and the Future of\nWhiteness in American Democracy”, <em>APA Newsletter on\nHispanic/Latino Issues in Philosophy</em>, 16(2): 6–10.</li>\n<li>Millán, Elizabeth and Don T. Deere, 2017, “History of\nLatino/a Philosophy”, <em>Oxford Bibliographies Online</em>,\nOxford: Oxford University Press.\ndoi:10.1093/obo/9780199913701-0118</li>\n<li>Moraga, Cherríe and Gloria Anzaldúa, 1981, <em>This\nBridge Called my Back: Writings by Radical Women of Color</em>,\nWatertown, MA: Persephone Press.</li>\n<li>Nuccetelli, Susana, 2017, “Latin American Philosophy:\nMetaphilosophical Foundations”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2017), Edward N. Zalta (ed.). URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2017/entries/latin-american-metaphilosophy/\" target=\"other\">https://plato.stanford.edu/archives/fall2017/entries/latin-american-metaphilosophy/</a>&gt;</li>\n<li>Nuccetelli, Susana, Ofelia Schutte, and Otvio Bueno (eds.), 2009,\n<em>A Companion to Latin American Philosophy</em>, Oxford, UK:\nWiley-Blackwell. doi:10.1002/9781444314847</li>\n<li>Orosco, José-Antonio, 2016a, <em>Toppling the Melting Pot:\nImmigration and Multiculturalism in American Pragmatism</em>,\nBloomington, IN: Indiana University Press.</li>\n<li>–––, 2016b, “The Philosophical Gift of\nBrown Folks: Mexican American Philosophy in the United States”,\n<em>APA Newsletter on Hispanic/Latino Issues in Philosophy</em>,\n15(2): 23–28.</li>\n<li>Ortega, Mariana, 2016, <em>In-Between: Latina Feminist\nPhenomenology, Multiplicity, and the Self</em>, Albany, NY: SUNY\nPress.</li>\n<li>Pappas, Gregory, 2011, “The Latino Character of American\nPragmatism”, in Gregory Pappas (ed.), <em>Pragmatism in the\nAmericas</em>, New York: Fordham University Press.</li>\n<li>Pereda, Carlos, 2006, “Latin American Philosophy: Some\nVices”, <em>Journal of Speculative Philosophy</em>, 20(3):\n192–203.</li>\n<li>Quijano, Anibal, 2000, “Coloniality of Power, Eurocentrism,\nand Latin America”, <em>Nepantla</em>, 1(3): 533–580.</li>\n<li>Reed-Sandoval, Amy, 2016a, “‘Immigrant’ or\n‘Exiled’? Reconceiving the Desplazada/os of Latin American\nand Latina/o Philosophy”, <em>APA Newsletter on Hispanic/Latino\nIssues in Philosophy</em>, 15(2): 11–14.</li>\n<li>–––, 2016b, “Oaxacan Transborder\nCommunities and the Political Philosophy of Immigration”,\n<em>International Journal of Applied Philosophy</em>, 30(1):\n91–104. doi:10.5840/ijap201641457</li>\n<li>Rodriguez-Pereyra, Gonzalo, 2013, “The Language of\nPublication of ‘Analytic’ Philosophy”,\n<em>Crítica: Revista Hispanoamericana de Filosofía</em>,\n45(133): 83–90.\n [<a href=\"https://doi.org/10.22201/iifs.18704905e.2013.718\" target=\"other\">Rodriguez-Pereyra 2013 available online</a>]</li>\n<li>Romano, Octavio Ignacio, 1969, “The Intellectual and\nHistorical Presence of Mexican-Americans”, <em>El Grito: A\nJournal of Contemporary Mexican-American Thought</em>, II(2):\n32–46.</li>\n<li>Ruíz, Elena, 2016 “Existentialism for Postcolonials:\nFanon and the Politics of Authenticity”, <em>APA Newsletter on\nHispanic/Latino Issues in Philosophy</em>, 15(2): 19–22.</li>\n<li>Sánchez, Carlos Alberto, 2012, <em>The Suspension of\nSeriousness: on the Phenomenology of Jorge Portilla</em>, Albany, NY:\nSUNY Press.</li>\n<li>–––, 2016, <em>Contingency and Commitment:\nMexican Existentialism and the Place of Philosophy</em>, Albany, NY:\nSUNY Press.</li>\n<li>Sánchez, Robert Eli, Jr., 2013, “The Process of\nDefining Latino/a Philosophy”, <em>APA Newsletter on\nHispanic/Latino Issues</em>, 13(1): 1–4.</li>\n<li>Schutte, Ofelia, 1993, <em>Cultural Identity and Social Liberation\nin Latin American Thought</em>, Albany, NY: SUNY Press.</li>\n<li>–––, 1998, “Cultural Alterity:\nCross-Cultural Communication and Feminist Theory in North-South\nContexts”, <em>Hypatia</em>, 13(2): 53–72.\ndoi:10.1111/j.1527-2001.1998.tb01225.x</li>\n<li>–––, 2000, “Negotiating Latina\nIdentities”, in Gracia &amp; De Greiff 2000: 61–76.</li>\n<li>Silva, Grant J., 2015a “Embodying a ‘New’ Color\nLine: Racism, Anti-Immigrant Sentiment and Racial Identities in the\n‘Postracial’ Era”, <em>Knowledge Cultures</em>,\n3(1): 65–90.</li>\n<li>–––, 2015b, “Why the Struggle Against\nColoniality is Paramount to Latin American Philosophy”, <em>APA\nNewsletter on Hispanic/Latino Issues</em>, 15(1): 8–12.</li>\n<li>Soldatenko, Michael, 1996, “Perspectivist Chicano Studies,\n1970–1985”, <em>Ethnic Studies Review</em>, 19(2–3):\n181–208.</li>\n<li>Spencer, Quayshawn, 2018, “Racial Realism II: Are Folk Races\nReal?”, <em>Philosophy Compass</em>, 13(1): e12467;\ndoi:10.1111/phc3.12467</li>\n<li>Sundstrom, Ronald Robles, 2008, <em>The Browning of America and\nthe Evasion of Social Justice</em>, Albany, NY: SUNY Press.</li>\n<li>Vargas, Manuel, 2007, “‘Real’ Philosophy,\nMetaphilosophy, and Metametaphilosophy”, <em>CR: The New\nCentennial Review</em>, 7(3): 51–78. doi:10.1353/ncr.0.0006</li>\n<li>von Vacano, Diego A., 2012, <em>The Color of Citizenship: Race,\nModernity and Latin American/Hispanic Political Thought</em>, New\nYork: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199746668.001.0001</li>\n<li>Velazco y Trianosky, Gregory, 2009, “‘Mestizaje’\nand Hispanic Identity”, in Nuccetelli, Schutte, and Bueno 2009:\n283–296. doi:10.1002/9781444314847.ch20</li>\n<li>Yancy, George (ed.), 2012, <em>Reframing the Practice of\nPhilosophy: Bodies of Color, Bodies of Knowledge</em>, Albany, NY:\nSUNY Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "feminist philosophy, topics: perspectives on the self",
            "identity politics",
            "Latin American Philosophy",
            "Latin American Philosophy: metaphilosophical foundations",
            "liberation, philosophy of",
            "race"
        ],
        "entry_link": [
            {
                "../feminism-self/": "feminist philosophy, topics: perspectives on the self"
            },
            {
                "../identity-politics/": "identity politics"
            },
            {
                "../latin-american-philosophy/": "Latin American Philosophy"
            },
            {
                "../latin-american-metaphilosophy/": "Latin American Philosophy: metaphilosophical foundations"
            },
            {
                "../liberation/": "liberation, philosophy of"
            },
            {
                "../race/": "race"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=latinx\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/latinx/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=latinx&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/latinx/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=latinx": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/latinx/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=latinx&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/latinx/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}