{
    "url": "leibniz-exoteric",
    "title": "Leibniz’s Exoteric Philosophy",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "John Whipple\n<jwhipple@uic.edu>",
        "author_links": [
            {
                "mailto:jwhipple%40uic%2eedu": "jwhipple@uic.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nJohn Whipple\n&lt;<a href=\"mailto:jwhipple%40uic%2eedu\"><em>jwhipple<abbr title=\" at \">@</abbr>uic<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Jun 18, 2013",
        "substantive revision Sun Jul 3, 2022"
    ],
    "preamble": "\n\nIt is no secret that G. W. Leibniz is a difficult philosopher to\nstudy. One central reason for this is that the content of his\nphilosophy is extremely challenging. It involves a range of subtle\ndistinctions and paradoxical theses, such as the denial of causal\ninteraction between substances and the thesis that each substance\nexpresses every other substance in the universe. Just as significant,\nhowever, is the fact that his philosophical corpus is immense,\ncomprising a bewildering array of letters, notes, essays, and larger\nmanuscripts. These writings span a period of over fifty years. Only a\nsmall number of his essays and one philosophical book, the Essais\nde théodicée, were published during his lifetime.\nNone of his published or unpublished works is considered a magnum\nopus on the order of Spinoza’s Ethics or\nKant’s Critique of Pure Reason. The complexity of\nLeibniz’s literary remains forces scholars of his thought to\nengage difficult questions: how much continuity is there between\nLeibniz’s treatments of particular topics at different times in\nhis career? On what issues does he attain considered views? Should\ncertain texts be privileged over others in attempting to discern\nLeibniz’s views? Is Leibniz a deeply systematic philosopher who\naddresses a wide range of problems from the perspective of a unified\ntheory, or does he apply his penetrating mind to a series of\nphilosophical problems with little concern for the systematic\ncoherence of his results?\n\nOne important clue for approaching the labyrinth of Leibniz’s\ntexts is a distinction that he draws between esoteric\n(acroamaticus/acroamatique) and exoteric\n(exotericus/exoterique) presentations of his philosophy.\nRoughly speaking an esoteric presentation is one that is fully\nrigorous while an exoteric or “popular” presentation is\nless rigorous but easier to understand, which is more appropriate for\na general audience. Leibniz distinguishes between these two modes of\npresentation early in his career and explicitly classifies many of his\n(later) published works such as the Essais de\nthéodicée as exoteric. This distinction is clearly\nrelevant to the questions raised in the previous paragraph. If it is\npossible to distinguish between esoteric and exoteric texts, then the\nmost precise statements of Leibniz’s considered views are likely\nto be found in the esoteric texts. Similarly, if Leibniz’s\ntreatments of an issue in different works seem to be in tension with\none another, one potential explanation of the discrepancy is that one\ntreatment is esoteric and the other is exoteric.\n\nIn order to plausibly use Leibniz’s distinction between the\nesoteric and the exoteric as an interpretive tool one must have a more\ndetailed account of how he understands the distinction. This itself is\nnot an easy matter, however, as Leibniz’s remarks on the\ndistinction also require interpretation. One challenge for\nunderstanding his views on this issue is that some of his most\nexplicit remarks on it are written quite early in his career. Although\nit is clear that he does not abandon the distinction later in his\ncareer one should not uncritically assume that his views on the\ndistinction do not change over time. A second challenge is that\nLeibniz typically does not identify his exoteric texts as exoteric\nwithin those texts. For example, if you were to focus exclusively on\nwhat Leibniz writes in the Système nouveau de la nature et\nde la communication des substances, aussi bien que de l’union\nqu’il y a entre l’âme et le corps (New\nsystem of the nature and communication of substances, and of the union\nof the soul and body)—the first public presentation of his\nphilosophy—you would have no idea that it is a popular\npresentation of is views. It is only in letters to certain of his\ncorrespondents that Leibniz identifies this text as exoteric. And when\nhe does identify a text as exoteric he often provides few details\nabout exactly what this is supposed to involve. A third challenge for\nunderstanding Leibniz’s views is that he does not use the terms\n“esoteric” and “exoteric” univocally.\nSometimes these words are used to distinguish different kinds of\ncontent that a philosophy might have; other times they signify\ndifferent modes of presenting one’s philosophy. It will be\ncrucial to disambiguate these terms as we proceed (see Melzer 2014 for\nan insightful account of different kinds of esoteric and exoteric\nwriting that have been utilized throughout the history of\nphilosophy).\n\nThe notion of an exoteric Leibnizian philosophy is often associated\nwith Bertrand Russell’s influential interpretation of Leibniz.\nRussell infamously claimed that the difference between Leibniz’s\npublic and private writings is so significant that they effectively\ncomprise two distinct philosophies: a theologically imbued fantasy\ndesigned to please royalty, and his true philosophy, derived from\naustere logical principles, that he revealed to a select few of his\ncorrespondents (Russell 1945). In recent decades Russell’s view\nhas been rejected; nearly everyone agrees that there is much more\ncontinuity between Leibniz’s public and private works than\nRussell was willing to admit (see Curley 1972 for a critique of\nRussell’s view). And as we will see, the distinction between the\nesoteric and the exoteric does not involve a simple classification of\nhis works depending on whether or not they were published. In order to\nattain a more accurate understanding of Leibniz’s distinction\nbetween the esoteric and the exoteric we must turn to his views on the\nideal form that metaphysics should take.\n",
    "toc": [
        {
            "#IdeaFormMeta": "1. The Ideal Form of Metaphysics"
        },
        {
            "#EsotFormEsotCont": "2. Esoteric Form and Esoteric Content"
        },
        {
            "#PrimFuncExotText": "3. The Primary Function of Exoteric Texts"
        },
        {
            "#EcleExotPhil": "4. Eclecticism and Exoteric Philosophy"
        },
        {
            "#SeleOmisLeibSystNouv": "5. Selective Omission in Leibniz’s Système Nouveau"
        },
        {
            "#AddiExotStra": "6. Additional Exoteric Strategies"
        },
        {
            "#Summ": "7. Summary"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Ideal Form of Metaphysics\n\nLeibniz conceived of metaphysics as an a priori demonstrative science.\nIn its ideal form metaphysics would be presented in a manner analogous\nto Euclid’s Elements, where propositions are rigorously\ndemonstrated on the basis of definitions and axioms. The point of\ndeparture for this conception of metaphysics is Leibniz’s theory\nof truth. Leibniz thought that truth consisted in conceptual\ncontainment: a proposition is true just in case the concept of the\npredicate is contained in the concept of the subject. This implies\nthat all metaphysical truths are conceptual truths. Leibniz thought\nthat a concept could be defined by analyzing it into simpler component\nconcepts. A rigorous demonstration, for Leibniz, consists in a\n“chain of definitions” (catena definitionum)\nwhere one moves from premises to a conclusion via the substitution of\ndefinitionally equivalent terms (A II.i.398; L 198). In order for such\ndemonstrations to attain the degree of certainty found in geometry\nthey would need to be set forth in a purely formal system, which\nLeibniz termed his “universal characteristic”\n(characteristica universalis). The universal characteristic\nwould allow one to express in a purely formal manner the composition\nof any concept on the basis of a set of primitive concepts. This\nsystem of representation, in conjunction with a logical calculus for\nexpressing identity and inclusion relations among concepts, would\nenable one to set forth a strictly demonstrative metaphysics (see\nRutherford 1996 for a detailed discussion of Leibniz’s\nconception of a demonstrative metaphysics).\n\nLeibniz’s conception of an ideal metaphysics was incredibly\nambitious. He made impressive progress on the project during his\ncareer, though he fell well short of attaining his lofty ideal. Some\nof Leibniz’s very early texts contain stretches of argument that\nare not carefully divided into axioms, definitions, propositions, and\ndemonstrations, but which could be reconstructed to fit that model.\nConsider, for example, Leibniz’s unpublished 1672–3\nConfessio Philosophi (The Confession of a Philosopher).\nTowards the beginning of this work, after providing definitions of\n“God”, “justice”, “love”, and\n“harmony”, he demonstrates that “happiness consists\nin the most harmonious state of mind” (A VI.iii.117; CP\n31). Leibniz then argues (in the voice of The Philosopher):\n\n\nIf all happiness is harmonious (as demonstrated), and all harmony is\nknown by God (by the definition of God), and all experience\nof harmony is a delight (by the definition of delight), it\nfollows that all happiness is pleasing to God. Therefore (by the\ndefinition of love assumed previously) God loves everyone,\nand, accordingly (by the definition of the just) God is\njust. (A VI.iii.117; CP 31)\n\n\nLeibniz’s demonstration is slightly informal here (as one might\nexpect in a dialogue), but it could easily be reconstructed in\ndeductive form. In 1675–6 Leibniz wrote a number of unpublished\npapers and notes on metaphysical topics (most of the papers are\nincluded in Parkinson’s De Summa Rerum: Metaphysical\nPapers, 1675–1676).  These texts include definitions of key\nmetaphysical concepts and many informal demonstrations of metaphysical\npropositions. In the late 1670s Leibniz completed several short drafts\nof works that were divided into axioms, definitions, and propositions,\nalthough the subject matter of those works was not strictly\nmetaphysical (see De Obligatione Credendi A\nVI.iv.c.2149–2155 and Animadversiones in schedam ex Batavis\nMissam A VI.iv.c.2204–2210). In 1679 Leibniz quickly\ncomposed a work that was closer to the ideal of a demonstrative\nscience of metaphysics than anything he had written to date (De\nAffectibus AVI.iv.b.1410–1441). It contained a long list of\ndefinitions of key terms along with some demonstrations of\nmetaphysical principles and theses. Leibniz’s project continued\nin the 1680s in a series of extensive definitional studies of key\nconcepts (see, e.g., De Notionibus Omnia Quae Cogitamus\nContinentibus A.VI.iv.a.398–405, Definitiones Notionum\nMetaphysicarum atque Logicarum A.VI.iv.a.624–630, and\nTabula Notionum Praeparanda A.VI.iv.a.630–635). By 1690\nLeibniz had developed a logical calculus for expressing identity and\ninclusion relations among concepts. Around this time, however, Leibniz\nbegan to doubt whether it was possible to discover absolutely\nprimitive concepts. He also did not succeed in developing his purely\nformal system of representation, the universal characteristic. Without\nprimitive concepts or the universal characteristic it was not possible\nfor Leibniz to attain his ideal of a fully demonstrative metaphysics.\nIt is plausible to think that Leibniz could nevertheless have\ncompleted a work that was an approximation of the ideal, written in\nLatin and using non-primitive concepts. Leibniz insisted throughout\nhis later years that he could complete a work along these lines. In\n1710, for example, he explains to correspondent Charles Hugony that in\nhis (Leibniz’s) recently published Essais de\nthéodicée he set forth one part of his views\n“in an informal manner” and that he is “thinking of\n[writing] a Latin work in which I will try to unfold my entire\nsystem” (G 3:680). And in 1715 Leibniz writes to Biber:\n\n\nif God will grant me more free time, I will attempt by means of\nwell-formed demonstrations to impart to a good portion of my views the\ncertainty of Euclid’s Elements. (LBr 64)\n\n\nBut Leibniz never did unfold his entire system, even in this less\nambitious form.\n\nLeibniz’s account of the ideal form of metaphysics provides the\nbasis for one of the ways that he distinguishes between the esoteric\nand the exoteric. In one of his earliest philosophical works, a very\nopinionated preface to an edition of a book by Marius Nizolius,\nLeibniz distinguishes between esoteric and exoteric modes of\nphilosophizing. In this text he claims that the notion of\ndemonstration provides the line of demarcation between the esoteric\nand exoteric modes. In the former “all things are\ndemonstrated” while in the latter less rigorous forms of\nargumentation are utilized (e.g., supporting a proposition by means of\nan analogical argument). Works written in the exoteric mode, though\nuseful in various respects, are “not most rigorous, not most\nexact” (A VI.ii.416). In this and other texts Leibniz equates\nthe esoteric mode of philosophizing with the geometrical model of\ndemonstration, as briefly described above.\n2. Esoteric Form and Esoteric Content\n\nLeibniz advocated the geometrical model of demonstration as the ideal\nform for metaphysics throughout his career. He claimed later in his\ncareer that he had all the materials at hand to compose a work that\nwas a close approximation of the ideal. Yet such a work he did not\ncompose. Why did Leibniz not make more progress on this task, which\nwould seem to be of such great importance? Leibniz often mentioned his\nlack of free time as the reason for not completing an esoteric\ntreatise. But this seems to provide an incomplete explanation of the\nsituation. Though his extra-philosophical duties were numerous and\nburdensome, he made the time to write quite a lot on metaphysical\nsubjects. If he thought that the geometrical model of demonstration\nwas indeed the ideal form for metaphysics, one cannot help but wonder\nwhy he did not find the time to begin composing such a work.\n\nIt is likely that there were several additional factors that led\nLeibniz to compose exoteric rather than esoteric works. Consider the\nfollowing remarks on the distinction between exoteric and esoteric\nmodes of exposition in his 1704 Nouveaux Essais sur\nl’entendement humain (an unpublished critical examination\nof Locke’s Essay Concerning Human Understanding written\nin dialogue form). The remarks occur in the context of a discussion of\nthe precision (or lack thereof) in natural language:\n\n\nThe ancients distinguished the ‘exoteric’\n[exoterique] or popular mode of exposition [maniere\nd’ecrire] from the ‘esoteric’\n[acroamatique] one which is suitable for those who are\nseriously concerned to discover the truth; and that distinction is\nrelevant here. If anyone wants to write like a mathematician in\nmetaphysics or moral philosophy there is nothing to prevent him from\nrigorously doing so; some have announced that they would do this, and\nhave promised us mathematical demonstrations outside mathematics, but\nit is extremely seldom that anyone has succeeded. I believe that\npeople are repelled by the amount of trouble they would have to take\nfor a tiny number of readers: like the question in Persius, ‘Who\nwill read this?’, with its answer ‘Maybe a couple of\npeople, maybe no one’. Yet I think that if anyone did go about\nit in the right way, he would have no reason to regret his labour. I\nhave been tempted to try it myself. (NE: 260–261)\n\n\nIn this intriguing text Leibniz (through the voice of Theophilus)\nnotes that few people have tried to write in the esoteric mode, and\neven fewer (if any) have succeeded in the endeavor. He also suggests\nseveral reasons that authors avoid esoteric expositions. Esoteric\ntexts are both difficult to compose and unlikely to attract readers,\npresumably because of their intimidating formal apparatus. And what is\nthe point of writing a text that no one is going to read? This point\nis also emphasized by Leibniz in a 1705 letter to Burnett:\n\n\nI never write anything in philosophy that I do not treat by\ndefinitions and axioms, though I do not always give it that\nmathematical air, which puts people off, for one must speak in a\nfamiliar manner to be read by ordinary people. (G 3:302)\n\n\nDespite these significant drawbacks to writing in the esoteric mode,\nLeibniz insists that if someone pursued this strategy “in the\nright way” it would be a worthwhile project. In the New\nEssays Leibniz does not explain what doing this “in the\nright way” would involve. He does, however, provide some\nimportant additional remarks on esoteric philosophy earlier in the\ntext. In the Preface he points out some key differences between his\nphilosophy and the philosophy of Locke:\n\n\n…although the author of the Essay says hundreds of\nfine things which I applaud, our systems are very different. His is\ncloser to Aristotle and mine to Plato, although each of us parts\ncompany at many points from the teachings of both of these ancient\nwriters. He is more popular [populaire] whereas I am\nsometimes forced to be a little more esoteric [acroamatique]\nand abstract—which is no advantage for me, particularly when\nwriting in a living language. (Preface to the New Essays, NE:\n48)\n\n\nIn these remarks Leibniz is using the term “esoteric” in a\nsubtly different way than he is in the earlier quote from the New\nEssays. Whereas in the first text “esoteric”\ndesignated a mode of presenting one’s philosophy, in\nthis text it concerns the content of one’s philosophy.\nHere he is drawing attention to the fact that his philosophy is less\n“popular” than Locke’s. Locke’s philosophy is\npopular in the sense that much of his philosophy accords with the\ndeliverances of the senses and so-called “common sense”.\nLeibniz’s philosophy, in contrast, is often very abstract and\nfar removed from ordinary opinions. Leibniz elaborates on this point\nin a 1702 letter to Sophie Charlotte where he distinguishes between\nthings that can be known through the senses (the\n“sensible”) and things that are the “object of the\nunderstanding alone” (the “intelligible”). Leibniz\nclaims that the existence of “intelligible things”,\nparticularly the “mind or or soul”, is more certain than\nthe existence of things that can be sensed. However, many people fail\nto recognize this because “they take sensible things for the\nonly true things” (G 6:502–3; AG 188–9). This\noverreliance on the senses makes it difficult for people to understand\nLeibniz’s metaphysics, which involves a number of things that\nsimply cannot be known through the senses. This puts Leibniz at a\nsignificant disadvantage when it comes to trying to communicate his\nphilosophy to the general public. Readers are far more likely to find\nfavor with Locke’s philosophy given that it coheres much better\nwith their current beliefs (see Nelson 2005 for more on this general\ntheme).\n\nIn some of his letters Leibniz makes the point about how difficult it\nis for most people to understand his philosophy in even stronger\nterms. Consider, for example, what he writes to Pierre Bayle in\n1702:\n\n\n…I should not be in too much of a hurry to publish what I have\nwritten, the point of which was only to provide some clarification for\nyou, sir, and for some other people, so as to receive the same in\nreturn. For I write not so much to make an impression as to\ninvestigate the truth, which it is often useless, and even harmful, to\npublish—on account of the uninitiated [des profanes],\nwho are incapable of appreciating it, and quite capable of taking it\nthe wrong way. (G 3:66–7; WF 127)\n\n\nThese are striking words. Read in isolation from his other remarks on\nthe exoteric/esoteric distinction, one might take this text to suggest\nthat Leibniz had two distinct philosophies—a false philosophy\nsuitable for presentation to the public, and his true philosophy,\nwhich he only revealed to a few trusted correspondents. But\nLeibniz’s claim is not as radical as it might initially seem.\nWhile it is true that the esoteric character of the content of his\nmetaphysics made it susceptible to being seriously misunderstood, his\nsolution was not to permanently hide his views from everyone who was\nlikely to misunderstand them. His point, as additional texts will make\nclear, is that he thinks it is often useless and harmful to\nstraightforwardly present the content of his metaphysics to\nthe public (and even to trusted correspondents). For example, in a\n1710 letter to Charles Hugony, he claims that some of his views\n\n\ncannot be presented in a straightforward manner [ne peut donner\ncruement], since people are likely to misunderstand them …\nin relation to the senses. (G 3:680)\n\n\nThis suggests that although Leibniz thinks it is unwise to present\nsome of his views straightforwardly, there is a way to\npresent them that is not straightforward. We need to now\nconsider what this involves.\n3. The Primary Function of Exoteric Texts\n\nLeibniz faced what might seem like an intractable problem. He thought\nthat the ideal form for metaphysics was the esoteric mode of\npresentation. However, he knew that few people were inclined to read\ntexts presented in the esoteric mode due to their daunting formal\nstructure. Even worse, Leibniz thought that the content of his\nphilosophy was such that most people were likely to misunderstand it\nin fundamental ways (see Whipple 2015a for a discussion of this\nproblem). How then would it be possible for him to communicate his\nviews to people? His letter to Hugony, cited earlier, suggested that\nit would involve a non-straightforward presentation of his views. In\nthat text he did not elaborate on what non-straightforward\npresentation involved, but he did provide more concrete suggestions in\nsome unpublished remarks appended to metaphysical notes written in\n1676. The quotation is divided into several parts for ease of\nreference:\n\n\n[a] Metaphysics should be written with accurate definitions and\ndemonstrations, [b] but nothing should be demonstrated in it that\nconflicts too much with received opinions. For thus this metaphysics\nwill be able to be received. [c] If it is once approved, then\nafterwards, if any examine it more profoundly, they will draw the\nnecessary consequences themselves. [d] Besides this, one can, as a\nseparate undertaking, show these people later the way of reasoning\nabout these things. [e] In this metaphysics, it will be useful for\nthere to be added here and there the authoritative utterances of great\nmen, who have reasoned in a similar way; especially when these\nutterances contain something that seems to have some possible\nrelevance to the illustration of a view. (A VI.iii.573)\n\n\n[a] is best read as a terse reference to the esoteric mode of\npresentation. Although this is the way that metaphysics should ideally\nbe written, he thinks that it would be a mistake to publish anything\nthat “conflicts too much with received opinions”. As we\nhave already seen, this is because many people will regard it as\nabsurd, summarily reject it, or misunderstand it entirely (possibly\nall three at the same time!). Leibniz suggests a strategy of selective\nomission, not to permanently hide the controversial features of his\nphilosophy, but as part of a longer-term strategy of preparing his\nreaders to understand his most esoteric doctrines. In some cases he\nthinks that sympathetic readers who study his texts “more\nprofoundly” will be able to infer the esoteric conclusions\nthemselves. In [d] he suggests a complementary strategy of\nsupplementation. In subsequent works he can explicitly draw the\nconclusions that may have only been implicit in the initial text.\nTaken collectively Leibniz’s remarks in this passage suggest\nthat the primary function of exoteric texts is pedagogical: they are\ndesigned to serve as intellectual stepping stones that enable his\nreaders to gradually move from received opinions to esoteric\ndoctrine.\n\nA number of Leibniz’s remarks in later texts confirm that he\nconceives of exoteric texts as important preparatory works. Consider,\nfor example, what he writes to Fontenelle in 1704:\n\n\nThe true metaphysics, or philosophy, if you will, does not appear to\nme any less important than geometry, especially if there is also a way\nof introducing into it demonstrations, which until now have been\nentirely excluded from it, along with the calculus that will be\nnecessary in order to give them all the entry they need. However, it\nis necessary to prepare readers with exoteric writings. The journals\nhave served me well until now. (FC 1:234)\n\n\nHere Leibniz explicitly claims that his choice to present various\nfeatures of his philosophy in journal articles should be understood as\npart of a broad exoteric strategy to prepare his readers to understand\nthe “true metaphysics”. This helps shed light on some of\nLeibniz’s better-known remarks about the composition of his\njournal articles. Consider what Leibniz writes to correspondent\nNicolas Remond in 1714:\n\n\nIn the Leipzig journal [Acta Eruditorum] I adapt myself to\nthe language of the schools, in the others I adapt myself more to the\nstyle of Cartesians, and in this latest piece I try to express myself\nin a way that could be understood by those who are not yet very\naccustomed to the style of one or the other. (G 3:624)\n\n\nLeibniz’s strategy of adapting himself to the language of the\nschools in some articles and to the language of the Cartesians in\nothers is one of his core exoteric strategies. He thinks that using\nlanguage that is familiar with his readers is a good way to make his\nviews seem not too far removed from received opinions. This is not\nmerely a feature of his published writings. Leibniz tailors his\nwritings in a similar way in his private correspondences. For example,\nin his correspondence with Jesuit theologian Bartholomew Des Bosses he\nfrequently employs scholastic terminology, and in his correspondence\nwith (largely) Cartesian physicist Burcher De Volder he sometimes\npresents his views with a Cartesian slant. To use a more concrete\nexample, early in the correspondence with De Volder, Leibniz appeals\nto the doctrine of continued divine creation, which he (Leibniz)\nregards as a central Cartesian tenet. Although he initially presents\nthe doctrine in a way that makes it seem like this is a point of\ncommon doctrine between him and the Cartesians, it emerges later in\nthe correspondence that Leibniz only affirms the doctrine in a\nqualified sense (for a detailed discussion of this issue see Whipple\n2011). The general strategy here is to use language that is familiar\nto the reader or correspondent and to emphasize initial points of\nagreement. Fine-grained differences and esoteric implications are\ntypically avoided at the initial stages of engagement.\n\nOne important general point that emerges from Leibniz’s remarks\nin the letter to Remond is that there was more than one set of\n“received opinions” that he needed to take into account.\nThe received opinions of a Cartesian and the opinions of someone who\nwas committed to a version of Aristotelian Scholasticism would be\ndifferent in fundamental respects. In the letter cited above Leibniz\nspeaks of another of his works, the Principes de la Nature et de\nla Grace, fondés en raison (Principles of Nature and\nGrace, Based on Reason), which targets yet another\naudience—those who are not accustomed to the style of the\nCartesians or the scholastics. When it comes to exoteric philosophy,\none size does not fit all. Different strategies are required for\npeople with different backgrounds and views.\n4. Eclecticism and Exoteric Philosophy\n\nLeibniz is sometimes described as being an eclectic philosopher. There\nare different ways of understanding eclecticism, but the basic idea is\nthat an eclectic philosopher is one who incorporates ideas from a wide\nrange of sources. In certain places Leibniz characterizes himself as\nproceeding along these lines. He famously writes to Remond, for\nexample, that:\n\n\nI have tried to uncover and unite the truth buried and scattered under\nthe opinions of all the philosophical sects, and I believe I have\nadded something of my own that takes a few steps forward…most\nsects are right in a good part of what they affirm, but not so much in\nwhat they deny. (10 Jan 1714, G 3:606–7; L 654)\n\n\nIt is undeniable that Leibniz read from an extraordinary range of\nsources and that his thought was influenced by a number of these\ntexts. Although the precise nature of these influences is a matter of\nscholarly controversy that cannot be engaged in this article, it is\nimportant to note that Leibniz’s exoteric strategies bear\nsignificantly on this general topic. Recall the final sentence in the\nlong quotation from Leibniz’s 1676 notes on exoteric philosophy:\n\n\n\nIn this metaphysics, it will be useful for there to be added here and\nthere the authoritative utterances of great men, who have reasoned in\na similar way; especially when these utterances contain something that\nseems to have some possible relevance to the illustration of a view.\n(A VI.iii.573)\n\n\nAppealing to similarities between his views and those of his\npredecessors is one of Leibniz’s strategies for presenting his\nphilosophy in a way that makes it seem to be not too far from received\nopinions. We need to remain open to the possibility that\nLeibniz’s proclamations of continuity between his thought and\nthe thought of his philosophical forebears often mask subtle or not so\nsubtle differences between their respective views. Nuanced differences\nand radical implications may be left implicit or omitted entirely in\nhis more exoteric works. One might put the point as follows. Leibniz\nis not merely finding ideas in other philosophers and incorporating\nthem whole cloth into his philosophical system. In some cases, at\nleast, Leibniz develops distinctive philosophical views and then seeks\nout similar ideas in his predecessors as a strategy for presenting his\nviews to the public (see Schepers 2008 and Mercer 2001: 23–59\nfor more on this topic).\n5. Selective Omission in Leibniz’s Système Nouveau\n\nLeibniz first presented his philosophy to the public in an essay\ntitled “Système nouveau de la nature et de la\ncommunication des substances, aussi bien que de l’union\nqu’il y a entre l’âme et le corps”\n(New system of the nature and communication of substances, and of\nthe union of the soul and body). This essay was published in 1695\nin the Journal des savants. If one were to read this essay in\nisolation from Leibniz’s other writings (as would have been the\ncase with most of his readers) one would likely have no idea that it\nis an exoteric text. He prefaces the essay in the following way:\n\n\nFinally, since some important persons have desired to see my opinions\nfurther clarified, I have risked publishing these meditations, even\nthough they are not at all popular [populaires], nor can they\nbe appreciated by all sorts of minds. I have decided upon this mainly\nto profit from the judgments of persons enlightened in these matters,\nsince it would be too troublesome to seek out and call individually\nupon all those who would be disposed to give me\ninstruction—which I shall always be glad to receive, provided\nthat it contains the love of truth, rather than a passion for\npreconceived opinions. (G 4:477; AG 138)\n\n\nNote that Leibniz claims that his meditations are “not at all\npopular” and that many people will not be able to appreciate\nthem. These remarks, in conjunction with the comment on preconceived\nopinions, are designed to encourage the reader to seriously consider\nthe views that he will be presenting despite the fact that they will\nbe difficult to understand and will likely diverge—perhaps\nsignificantly—from the reader’s current beliefs. What\nLeibniz leaves unsaid, however, is that the Système\nnouveau is written according to the exoteric mode of\npresentation. First, the essay is clearly not written in accordance\nwith the formal apparatus of definitions and demonstrations that is\nrequired in a strictly esoteric presentation. Second, and perhaps more\nsignificantly, Leibniz purposefully omits some of the most\ncontroversial features of his philosophical system in this essay.\n\nIn order to more fully appreciate the exoteric features of the\nSystème nouveau it will be helpful to consider this\ntext in relation to Leibniz’s earlier Discours de\nmétaphysique (Discourse on Metaphysics). Leibniz\nwrote the Discours in 1686. Although it was not published\nduring his lifetime, this text has become one of Leibniz’s most\nfamous works. It is best known for presenting the complete concept\ntheory of substance. This theory states, roughly, that each substance\nhas an infinitely complex complete concept that specifies everything\nthat will ever happen to that substance. It is contained in the\ncomplete concept of Judas, for example, that he betrays Jesus (along\nwith everything else that can be truly predicated of Judas). Leibniz\nwas well aware that his readers might think that the complete concept\ntheory implies that all of a person’s actions are necessary, and\nthus that no person is free. In the main text of the Discours\nand in its section headings Leibniz attempts to show that Judas’\nbetrayal of Jesus, for example, is both contingent and a free action\ndespite being foreseen in Judas’ complete concept for all\neternity. Part of Leibniz’s strategy for showing this is his\nclaim that Judas’ reasons for betraying Jesus “incline\nwithout necessitating”. Leibniz’s discussion of these\nthorny philosophical issues is exoteric, at least to a certain degree.\nLike the Système nouveau it was not written in strict\naccordance with the esoteric mode of presentation. And arguably,\nLeibniz’s use of language such as “inclination without\nnecessitation” is carefully chosen with the aim of making his\nposition seem closer to received views.\n\nThe section headings of the Discours were sent to Antoine\nArnauld, a well-regarded theologian and philosopher of the day, to see\nhow the text would be received. Leibniz could not have been encouraged\nby Arnauld’s response:\n\n\nI find in these thoughts so many things which alarm me and which\nalmost all men, if I am not mistaken, will find so shocking, that I do\nnot see of what use a writing can be, which apparently all the world\nwill reject. (G 2:15)\n\n\nArnauld singled out as an example the complete concept theory of\nsubstance, which he took to imply a “more than fatal\nnecessity” that would undermine the very possibility of human\nfreedom. Leibniz’s attempts to forestall this implication in the\nsections headings of the Discours had not worked as planned,\nat least for Arnauld. Leibniz attempted to assuage Arnauld’s\nconcerns in subsequent letters with moderate success.\n\nIt is no surprise that Leibniz chose not to publish the\nDiscours. It is also no surprise that the complete concept\ntheory of substance does not make an appearance in the\nSystème nouveau. This does not imply that Leibniz\nabandoned the complete concept theory; it might just be that he came\nto realize that it was not the most effective way of introducing\nreaders to his philosophical system. Leibniz utilizes the exoteric\nstrategy of selective omission, choosing to avoid a detailed\ndiscussion of necessity and contingency. Instead he introduces his\ntheory of substance by appealing to the less controversial\ncharacteristics of unity and activity, and by trying to show how his\ntheory could resolve the notorious problem of mind-body interaction.\nLetters to some of Leibniz’s correspondents confirm that he was\n“testing the waters” in the Système\nnouveau, and that he would reveal more of his system to the\npublic if it was well received. He writes to Simon Foucher, for\nexample:\n\n\nIf the public receives these meditations well, I will be encouraged to\noffer in addition some rather remarkable ideas I have for alleviating\nthe difficulties concerning fate and contingency, and to clarify an\nessential distinction that can be drawn between material forms and\nintelligences or spirits. (1695, G 1:423)\n\n\nLeibniz’s aim was not to permanently hide his views on\ncontingency, fate, and freedom. By selectively omitting some of these\nmore controversial features of his system he increased the likelihood\nthat his readers would grasp the features of his system that were\npresented in the Système nouveau. Once they endorsed\nthese parts of the system they would be more receptive to\nLeibniz’s views on more controversial topics. Such was\nLeibniz’s hope, in any case.\n\nLeibniz returned to the topics of fate, necessity, and contingency in\nthe one philosophical book that he published during his lifetime, the\nEssais de théodicée of 1710. It has been\nsuggested in the secondary literature that Leibniz’s treatment\nof necessity and contingency in this text is exoteric to a significant\ndegree (Adams 1994:52). For example, Leibniz frequently uses terms\nsuch as “inclination without necessitating”, “moral\nnecessity”, and “hypothetical necessity” without\nproviding strict definitions of them. Some of Leibniz’s\npredecessors understood these terms in ways that implied a\nnon-deterministic view of human action. According to most\ninterpretations of Leibniz’s considered views on these issues\n(based on a number of texts other than the Essais de\nthéodicée), he was committed to a strict\ndeterminism (but not necessitarianism) about human actions. However,\nby omitting definitions of terms like “moral necessity” in\nthe Essais de théodicée Leibniz might have\nallowed readers that were committed to non-deterministic accounts of\n“moral necessity” to assume that he was using this concept\nin a way that was less deterministic than his considered view allowed.\nThis is in keeping with Leibniz’s stated strategy of not\npresenting anything to the public that is too far removed from\nreceived opinions. One way of not presenting something to the public\nthat is far removed from received opinions is to selectively omit it\n(his strategy in the Système nouveau). Another\nstrategy is to present a view that is far removed from received\nopinions in a way that makes it seem less removed than it actually is.\nIf Leibniz is utilizing this latter strategy in the discussions of\nnecessity and contingency in the Essais de\nthéodicée, it does not imply that he is trying to\npermanently mislead his readers. As we have seen, he has several\ngeneral strategies for helping his reader progress to a more rigorous\nunderstanding of his views. One of the strategies is to provide subtle\nhints such that a “more profound” examination of the text\nwould yield a deeper understanding. By omitting clear definitions of\nterms such as “moral necessity”, however, it is not clear\nwhether there is enough material in the Essais de\nthéodicée for even a discerning reader to grasp\nLeibniz’s views on necessity and contingency. But Leibniz did\nnot claim that such inferences could always be made on the basis of an\nexoteric text alone. In a number of cases his exoteric treatments need\nto be supplemented by a more rigorous work. And we must keep in mind\nthat Leibniz clearly did conceive of the Essais de\nthéodicée in precisely this way (see Antognazza\n2009: 481–2). He writes to Charles Hugony shortly after its\npublication:\n\n\nMy essays on the goodness of God, the freedom of man, and the origin\nof evil have been printed in Holland, but I did not want to put my\nname on them. They are woven together from what I said and wrote at\nvarious times to the Queen of Prussia, who enjoyed reading M. Bayle\nand in whose company the difficulties that he raises on these matters\nwere often discussed. I try to explain one part of my views in a\nrather informal manner [un peu familierement]. As you know,\nsome of my views cannot be presented in a straightforward manner\n[ne peut donner cruement], since people are liable to\nmisunderstand them, not in relation to religion, which is strongly\nsupported, but in relation to the senses. I am therefore thinking of\n[writing] a Latin work in which I will try to unfold my entire system.\n(6 November 1710, G 3:680)\n\n\nLeibniz’s remarks in this passage cohere well with the other\nremarks on exoteric philosophy that we have considered thus far. As in\nthe case of the Système nouveau and Leibniz’s\nother journal articles, he conceives of the Essais de\nthéodicée as a preparatory work that will help\nprepare his readers for a more systematic and rigorous presentation of\nhis views.\n6. Additional Exoteric Strategies\n\nWe have seen that the primary function of exoteric texts is to serve\nas intellectual stepping-stones that bridge the gulf between received\nopinions and esoteric truth. Leibniz utilizes a wide range of\nstrategies in his exoteric works, some of which we have already\ndiscussed. Several additional strategies deserve mention as well. Let\nus begin by returning to Leibniz’s remarks on the distinction\nbetween esoteric and exoteric modes of presentation in the 1670\nPreface to Nizolius:\n\n\nThere is…a vast difference between modes of philosophizing\n[philosophandi modus], for one is, if I may so speak,\nesoteric [acroamaticus], another is exoteric\n[exotericus]. The esoteric mode is that in which all things\nare demonstrated; the exoteric is that in which some things are said\nwithout demonstration, but they are still given confirmation by means\nof certain similarities and by dialectical arguments, or even by\narguments based on definition, but not proposed except dialectically,\n[and] they are illustrated by examples and likenesses. Such a kind of\nspeaking is indeed dogmatic or philosophical; however, it is not\nesoteric, that is, not most rigorous, not most exact. (A\nVI.ii.416)\n\n\nOne point that we take Leibniz to be making here is that in exoteric\ncontexts propositions can be treated as hypotheses rather than\nproviding rigorous demonstrations of them. He seems to think that in\ncertain cases his readers will be less hostile to a novel thesis if it\nis presented as a hypothesis than if it is presented as a thesis that\ncan be demonstrated from metaphysical principles. Although\npropositions that are presented hypothetically are not demonstrated\nthey can be motivated and illustrated by examples, analogies,\nmetaphors, and stories (as he says later on). He does not, however,\nclaim that an esoteric work cannot contain analogies, metaphors, and\nthe like. It can include these things, which “give a pleasing\nrespite to a weary soul”, so long as they are carefully\ndistinguished from the rigorous demonstrations that form the core of\nthe work. Leibniz notes that this difference is also observed in\nmathematics where demonstrations, which are rigorous and exact, are\ncarefully distinguished from scholia in which reasoning can be treated\nin a more familiar manner.\n\nIt is striking to look at a text like the Monadologie through\nthe lens of Leibniz’s remarks about the distinction between\nesoteric and exoteric modes of presentation in the Preface to Nizolius\n(and the other texts that we have considered thus far). The text is\nreplete with analogies, metaphors, and other forms of argumentation\nthat fall well short of rigorous demonstrations. On the assumption\nthat Leibniz remains committed to his early account of the distinction\nbetween the esoteric and the exoteric, it follows that even the\nMonadologie, which has traditionally been taken to be one of\nthe definitive statements of Leibniz’s mature metaphysics,\ncontains numerous exoteric features. As in the case of the\nSystème nouveau, Leibniz does not explicitly flag the\nexoteric features of this work as exoteric. It is thus easy to mistake\nexoteric illustration for esoteric demonstration.\n\nBefore considering a few particular examples of exoteric strategies in\nthe Monadologie (and other texts), it is worth reiterating\nLeibniz’s explanation of why his philosophy was easy to\nmisunderstand. In the letter to Hugony quoted earlier Leibniz said\nthat he needed to present his philosophy in an informal manner because\nit was likely to be misunderstood in relation to the senses.\nThe tendency people have to rely on a sensory-based theory of\nknowledge is one of the primary stumbling blocks that prevent them\nfrom understanding his philosophical system. Many of Leibniz’s\ncore concepts and principles can only be adequately grasped through\nthe intellect, not through the senses or the imagination (see, for\nexample, Leibniz’s remarks on force in De Ipsa Natura\n(G 4:508; AG 159)). One of Leibniz’s main exoteric strategies\nfor dealing with this situation is to utilize sensible\nanalogies, imaginative metaphors, anecdotes, and stories to\nintroduce and motivate his abstract concepts, principles, and theses.\nSuch metaphors and analogies enable his readers to attain an\nintroductory understanding of the thesis or principle in question. Let\nus consider a few examples.\n\nIn explaining the thesis that there is no inter-substantial causation\nbetween finite substances in the Monadologie, Leibniz\nfamously says: “monads have no windows through which something\ncan enter or leave” (G 6:607; AG 214). This metaphor of being\n“windowless” helps the reader attain some understanding of\nLeibniz’s thesis, but it will be an imperfect understanding to\nthe extent that it involves conceiving of monads as being\nextended.\n\nLeibniz frequently uses imagistic metaphors to describe God’s\nsustenance of finite substances. Late in the Monadologie, for\nexample, he writes:\n\n\nall created or derivative monads are generated, so to speak, by\ncontinual fulgurations of the divinity from moment to moment. (G\n6:614; AG 219)\n\n\nAnd in the Essais de théodicée Leibniz uses the\nanalogy of a heavy-laden boat travelling down a river to explain how\nGod and finite substances can be said to co-operate in the production\nof particular effects in the ordinary course of nature (T 30–1).\nBoth the metaphor and the analogy provide useful but imperfect devices\nfor conceiving of things that cannot be sensed or imagined, strictly\nspeaking. In reading Leibniz’s texts it is important to\nrecognize that these are only metaphors and analogies—they are\nnot meant to provide metaphysically rigorous descriptions of divine\naction (see Whipple 2015b).\n\nLeibniz is committed to the principle of the identity of\nindiscernibles. This principle states, roughly, that it is impossible\nfor there to be two numerically distinct substances that are\nqualitatively identical. In discussing this principle Leibniz\nsometimes supports it by appealing to an anecdote and other empirical\nconsiderations. In the anecdote he recalls discussing the principle\nwith an “ingenious gentleman” who thought he could find\ntwo perfectly identical leaves. Princess Sophia, who was observing the\nconversation, “defied him to do it; he ran all over the garden a\nlong time to look for some but it was to no purpose”\n(4th letter to Clarke, G 7:372; AG 327–8). Leibniz\nalso defends the principle by appealing to the empirical results of\nthe microscopists: objects that can seem qualitatively identical to\nthe naked eye (two drops of water, or two drops of milk) are shown to\nbe different when viewed under the microscope. Neither the anecdote\nnor the appeal to microscopes is intended to be anything like a\nrigorous proof of the principle of the identity of indiscernibles. A\nrigorous proof would show how the principle is derived a\npriori from other principles such as the principle of sufficient\nreason.\n\nFew people are likely to interpret Leibniz’s anecdote concerning\nthe principle of the identity of indiscernibles as a rigorous\nargument. Other cases are more easily misunderstood, however. Consider\nsection 17 of the Monadologie:\n\n\n…perception, and what depends on it is inexplicable in\nterms of mechanical reasons, that is, through shapes and motions.\nIf we imagine that there is a machine whose structure makes it think,\nsense, and have perceptions, we could conceive it enlarged, keeping\nthe same proportions, so that we could enter into it, as one enters\ninto a mill. Assuming that, when inspecting its interior, we will only\nfind parts that push and pull one another, and we will never find\nanything to explain a perception. And so, we should seek perception in\nthe simple substance and not in the composite or in the machine. (G\n6:609; AG 215)\n\n\nIt is easy to see why this is one of the better-known passages in the\nMonadologie. It contains a vivid imaginative thought\nexperiment that is presented in support of an anti-materialist\nconclusion, namely that perception is inexplicable by means of shapes\nand motions. Given that thought experiments along these lines have\nbeen popular in contemporary philosophy of mind it might seem natural\nto suppose that Leibniz takes the thought experiment to provide a\nconclusive argument for his conclusion (it is sometimes referred to as\n“Leibniz’s Mill Argument”). Although this is not the\nplace to discuss the issue at length, we can say that Leibniz’s\nremarks on the exoteric/esoteric distinction suggest that this might\nnot be the case. It is plausible to think that the passage is designed\nto appeal to people who rely heavily on the imagination in doing\nphilosophy; it could be a heuristic that will help motivate\nLeibniz’s thesis that perception is a property of simple\nsubstances and not of bodies, not a rigorous argument for this\nconclusion .\n\nAs the discussion of Leibniz’s Mill Argument suggests, it is not\nalways easy to recognize when Leibniz is using an exoteric strategy.\nAnother place where an exoteric strategy might be at work is in one of\nhis most frequent “arguments” for the theory of simple\nsubstances. Consider the first section of the Principes de la\nNature et de la Grace and the first three sections of the\nMonadologie:\n\n[1]\n “A substance is a being capable of action. It is simple or\ncomposite. A simple substance is that which has no parts.\nA composite substance is a collection\n[l’assemblage] of simple substances, or\nmonads. Monas is a Greek word signifying unity, or\nwhat is one. Composites or bodies are multitudes; and simple\nsubstances—lives, souls, and minds—are unities. There must\nbe simple substances everywhere, because, without simples, there would\nbe no composites” (G 6:598; AG 207).\n[2]\n“1. The Monad, which we shall discuss here, is\nnothing but a simple substance that enters into\ncomposites—simple, that is, without parts. 2. And there must be\nsimple substances, since there are composites; for the composite is\nnothing more than a collection, or aggregate [un amas, ou\naggregatum], of simples. 3. But where there are no parts, neither\nextension, nor shape, nor divisibility is possible. These monads are\nthe true atoms of nature and, in brief, the elements of things”\n(G 6:607; AG 213).\n\n\nThese texts contain important similarities and differences. In\n [1]\n he speaks of “composite substances”, which he also\ndescribes as “bodies”, while in\n [2]\n he speaks only of “composites”. Setting these differences\naside for the moment, both texts contain a version of what has been\ntermed the “grounding argument” for simple substances.\nTaken at face value, the texts suggests the following argument:\n\ncomposites exist\na composite is a collection of simple substances\ntherefore, simple substances exist\n\n\nThe reader seems invited in these passages (particularly in\n [1]\n and the first two sections of\n [2])\n to conceive of the relation between simples and composites in a\nstraightforward and intuitive way. If you have a dozen eggs, for\nexample, you must have twelve individual eggs. Trying to argue that\none could have a dozen eggs without having any individual eggs seems a\nhopeless task indeed. The argument also initially lends itself to a\nkind of physical atomism. If one thinks that tables and chairs, for\nexample, are collections of indivisible physical atoms, then the\nargument is once again intuitive and difficult to deny. It becomes\nclear in the third section of text\n [2]\n that the relation between composite and simple cannot be quite this\nstraightforward because the simples are not extended. Leibniz also\nmakes this point in the section that follows\n [1]\n in the Principes de la Nature et de la Grace. But something\nlike the intuitive picture remains. There are composites (bodies).\nComposites are collections of simples. If you put a bunch of simples\ntogether you get a composite. It is natural to think that the relation\nbetween simples and composites is understood on the model of part and\nwhole. Simples are the parts that compose wholes (bodies).\n\nLeibniz’s considered view is far more nuanced and less\nstraightforward than texts\n [1]\n and\n [2]\n suggest. First, Leibniz does not think monads compose bodies in the\nmanner of a part/whole relation. As he explains elsewhere, a part of a\nwhole must be “of the same sort” as the whole (G 3:591).\nMonads and bodies are not of the same sort because only the latter are\nextended. This implies that the parts of an extended body must\nthemselves be extended. Leibniz does assert on a number of occasions\nthat bodies are aggregates of monads (or simple substances). However,\nhe has a technical conception of an aggregate (see Lodge 2001).\nSuppose, for example, that there were a carton of twelve eggs sitting\non a table. This alone would not imply that there was an aggregate of\neggs, strictly speaking. For there to be an aggregate of eggs there\nwould need to be at least two eggs that are perceived by a mind as\nbeing one thing (i.e., by perceiving them as a unity). So you cannot\nmerely add together a bunch of eggs to get an aggregate of eggs.\nSimilarly, you cannot merely add together a bunch of monads to get an\naggregate of monads. You only have an aggregate if there is a mind\nthat perceives the individuals as constituting one thing. The precise\ndetails of how one should understand Leibniz’s claim that bodies\nare aggregates of monads is a matter of scholarly controversy that we\nneed not engage here. It will suffice to make the following points.\nThe fact that bodies are aggregates of monads implies that bodies\ndepend ontologically on monads but it does not imply that the relation\nbetween monads and bodies is a part/whole relation. As Leibniz\nexplains to De Volder,\n\n\nproperly speaking, matter isn’t composed of constitutive\nunities, but results from them…substantial unities aren’t\nreally parts, but the foundations of phenomena. (G 2:268; AG 179)\n\n\nOnce one becomes aware of Leibniz’s technical notion of an\naggregate and of certain aspects of his conception of the part-whole\nrelation, it becomes less clear exactly how the “grounding\nargument” in texts\n [1]\n and\n [2]\n is supposed to work. The intuitive appeal of the argument seems to\ndepend, at least in part, on assuming a straightforward account of the\nrelation between bodies and monads that Leibniz does not actually\nendorse. Leibniz seems to encourage this oversimplified account of the\nrelation by omitting an explanation of his notion of an aggregate and\nof his account of the part-whole relation, among other things. This\nsuggests that Leibniz is not trying to provide a fully rigorous\nargument for the existence of simple substances or a full explanation\nof the relation between monads and bodies in the Monadologie\nor the Principes de la Nature et de la Grace. What Leibniz is\ndoing, one might think, is helping his readers attain a preliminary\ngrasp of the relation between bodies and simple substances—to\nhelp them recognize that simple substances provide some kind of\nontological grounding for the world of bodies. By introducing the view\nin the form of a simple and intuitive argument Leibniz helps to\nmotivate the radical idea that an infinity of immaterial mind-like\nsimple substances exist. The reader will thus be more likely to take\nthe view seriously enough to consider the further elaborations of the\ntheory that are presented in the remainder of the texts. This is not\nto deny that Leibniz might have had a fully demonstrative\n“grounding argument” for the existence of simple\nsubstances, or that he wanted the fully demonstrative argument to be\nconsistent with the versions of the argument that are presented in\ntexts\n [1]\n and\n [2].\n The point is that Leibniz omits too many essential distinctions and\ndetails for even a very discerning reader to be able to reconstruct a\ndemonstrative argument merely on the basis of texts\n [1]\n or\n [2].\n On this reading\nsignificant portions of the Monadologie and the Principes\nde la Nature et de la Grace are exoteric in content and form.\nThey serve to introduce some of the central features of\nLeibniz’s metaphysics while omitting many important details\n(more details are omitted in the latter text, as we will soon\nsee).\n\nLet us now consider one notable difference between the\nMonadologie and the Principes de la Nature et de la\nGrace. In the Principes de la Nature et de la Grace\nLeibniz speaks of “composite substances” while in the\nMonadologie he only speaks of “composites”. The\ndifference is puzzling. In the Monadologie Leibniz is\ntypically taken to be presenting a strictly monadological metaphysics\naccording to which simple substances are the only finite substances.\nBodies exist and animals exist, but they are not substances (roughly\nspeaking he thinks that an animal is a dominant monad and its organic\nbody, which is itself an aggregate of monads). A number of texts\nsuggest that neither bodies nor animals are true unities, and only a\ntrue unity (an unum per se) can qualify as a substance,\nstrictly speaking. Any reality that bodies and animals possess is in\nsome way derivative of the reality of simple substances. The obvious\npuzzle is that Leibniz speaks of simple and composite\nsubstances in the Principes de la Nature et de la Grace. What\nare we to make of these seemingly divergent claims?\n\nOne way of accounting for divergent claims in different texts is to\nsay that Leibniz had different views on the issue over time. There is\nno question that Leibniz’s views on substance changed to some\ndegree over the course of his career (exactly how much they changed is\none of the most contentious issues in Leibniz scholarship). However,\nthe developmental strategy is more difficult (though not impossible)\nto deploy in the present case because both texts were written around\nthe same time in 1714. Another possibility (suggested in the secondary\nliterature) is that Leibniz is exploring different theories of\nsubstance at this point in his career. Though he is tempted by a\nstrictly monadological metaphysics (as presented in the\nMonadologie), he is also considering an ontology that\ncountenances the existence of simple substances and corporeal\nsubstances (where corporeal substances are “animals” as\ndescribed in the previous paragraph). Leibniz is laying out this\nlatter theory in The Principes de la Nature et de la Grace\n(see Hartz 2007). There are some prima facie reasons for\nresisting an interpretation along these lines (though it cannot be\nconclusively ruled out). First, Leibniz does not describe himself as a\n“theory pluralist” with respect to substance. As we have\nseen, Leibniz consistently refers to his philosophy as a (single)\nsystem. This is one of the things that make it amenable to the\ngeometric model of demonstration.  When Leibniz addresses the fact\nthat he has not unfolded his entire system in a single work, he\nemphasizes that this is not because he has not thought the system all\nthe way through. In one of his less modest moments he writes to\nBurnett, for example:\n\n\nI never write anything in philosophy that I do not treat by\ndefinitions and axioms, though I do not always give it that\nmathematical air, which puts people off, for one must speak in a\nfamiliar manner [familierement] to be read by ordinary\npeople…I would even dare to say that I have established\nsufficiently in all matters of thought what is most fundamental to\nthem, and that I no longer have any need to reason about them. Thus\nwhat you wish for me to do was already done a long time ago. I have\nquite satisfied myself on nearly all matters of reasoning. (10\nDecember 1705 letter to Burnett; G 3:302–3)\n\n\nAnother place where Leibniz emphasizes the systematicity of his\nphilosophy is in his correspondence with Des Bosses:\n\n\nMy views certainly are connected with each other in such a way that no\nlink can be removed without the chain’s being broken. From the\nvery consideration of possible worlds and God’s choice, it\nfollows both that he has chosen the best and that he has chosen it\nwith one decree, whose object, obviously, is the chosen world.\n(October 1708 letter to Des Bosses, LR 113)\n\nIf only the attribute of incomprehensibility were proper to God alone!\nThen, our hope of knowing nature would be greater. But it is all too\ntrue that there is no part of nature that could be known perfectly by\nus, and the very interconnection of things proves this. No creature,\nhowever elevated, can perceive distinctly or comprehend the infinite\nat the same time; but, on the contrary, whoever comprehends even one\npart of matter likewise comprehends the whole universe on account of\nthe same interconnection I mentioned. My principles are such that they\ncan hardly be separated one from another. Whoever knows one well,\nknows them all. (7 November 1710 letter to Des Bosses, LR 189)\n\n\nMore could be said about the context of these passages and exactly how\nthey should be interpreted. At the very least, however, these texts do\nnot suggest that Leibniz saw himself as unsure about which theory of\nsubstance to endorse. That being said, Leibniz wrote a considerable\namount on the theory of monads and bodies between 1710 and 1714. Did\nLeibniz’s views on substance evolve during those intervening\nyears?\n\nTo answer this question one would need to delve deeply into\nLeibniz’s long and fascinating correspondence with Des Bosses\n(as well as other texts). This is obviously not the place to provide\nsuch an investigation, but we can briefly summarize a standard\ninterpretation of one of the central moments of the correspondence\n(see Look and Rutherford’s introduction [2007] to the\nLeibniz-Des Bosses Correspondence, xlix–lxxviii). As a Jesuit\npriest, Des Bosses was interested in determining whether\nLeibniz’s philosophy could provide an adequate ontological\nframework for the doctrine of transubstantiation. The central point of\ncontention in their discussion of this issue concerned the reality of\ncorporeal substance. Did Leibnizian corporeal substances meet the\ncriteria for being a substance in the strict sense of the term? On a\nmonadological view a corporeal substance (or animal) is a dominant\nmonad united with an organic body, which is itself an aggregate of\nsubordinate monads. The “union” of a dominant monad and\nits organic body consists in certain harmonious perceptual relations\nthat obtain between the dominant monad and the subordinate monads of\nthe organic body. This rather weak notion of union is not sufficient\nto make the dominant monad and its organic body truly one being. This\nimplies that a corporeal substance is not a substance strictly\nspeaking because it does not possess per se unity. Des Bosses\nthought that this reductive view of corporeal substance did not\nprovide a robust enough conception of the reality of bodies to\nproperly ground the doctrine of transubstantiation. In response to Des\nBosses’ concerns Leibniz developed the notion of a substantial\nbond (vinculum substantiale). This substantial bond\n(superadded by God) could serve as a kind of metaphysical glue uniting\nthe dominant monad and the subordinate monads of an organic body.\nLeibniz told Des Bosses that the only way for a corporeal substance to\nbe a per se unity would be through one of these substantial\nbonds. Arguably, Leibniz did not endorse the theory himself; he told\nDes Bosses that he preferred the more ontologically parsimonious\nversion of the theory of monads (letter of 16 June 1712; LR 255).\n\nThe correspondence with Des Bosses has thus been taken to provide\nsupport for the interpretive thesis that Leibniz’s mature\nontology of finite substance countenances the existence of simple\nsubstances exclusively (but see Garber 2009 for an opposing view). The\ncorrespondence also shows, importantly, that the mere occurrence of\nthe word “corporeal substance” in a text does not\nimmediately imply that Leibniz takes corporeal substances to be\nsubstances, strictly speaking. These conclusions might help\nresolve the apparent tension between Leibniz’s remarks on\nsubstance in the Monadologie and the Principes de la\nNature et de la Grace. The text of the Monadologie more\naccurately reflects Leibniz’s considered position because it\nonly characterizes simple substances as “substances”. The\nPrincipes de la Nature et de la Grace, in contrast, is less\nrigorous on this issue (more exoteric) because it uses the term\n“composite substance” when composites are not substances,\nstrictly speaking (Rutherford 1995: 281–2).\n\nBut why would Leibniz use a term like “composite\nsubstance” in the Principes de la Nature et de la Grace\nif it did not accurately reflect his considered position? Here is one\npossible answer. In presenting his theory of simple substances Leibniz\nwas concerned to avoid a fundamental misunderstanding. The\nmisunderstanding is that if the only true substances are unextended\nsimple substances, then bodies must be mere illusions. Leibniz does\nnot think that bodies are mere illusions. His view of bodies (from the\nperspective of the theory of monads) is, roughly, that they are\n“real but not fully real”. To adequately grasp\nLeibniz’s view one must understand that his ontology\ncountenances different levels or degrees of reality. Simplifying\nthings considerably, these degrees range from the ideal (the least\nreal) to the phenomenal (mid-grades of reality) to the level of monads\n(the most real). Bodies fall within the purview of the phenomenal:\nthey are more real than entities that are purely ideal (e.g.,\nspace) but less real than simple substances. Bodies are\naccorded an enhanced degree of reality (in comparison to merely ideal\nentities) because they are well founded on the reality of monads. The\nprecise nature of this “well founding”—and of\nLeibniz’s ontological scheme more generally—is a\ncomplicated and controversial matter. The nuanced framework (however\none might fill in the details) does not lend itself to a\nstraightforward and intuitive presentation in several paragraphs of\ntext (see Whipple 2020 for a more detailed account).\n\nOne can reasonably view the Principes de la Nature et de la\nGrace as one of the most exoteric presentations of\nLeibniz’s theory of monads. In the text he omits nearly all of\nthe details of his nuanced ontological scheme. He describes bodies as\n“composite substances” so that his reader will recognize\nthat both simple substances and bodies are “real”. By\noveremphasizing the degree of reality that he grants bodies he is able\nto introduce the theory of monads in a way that makes it appear less\nfar removed from received opinions. It also helps avoid the serious\nmisunderstanding that bodies are mere illusions—a\nmisunderstanding that one could easily fall into in the absence of a\nfull presentation of Leibniz’s ontological scheme.\n\nThis very brief sketch of an “exoteric resolution” of the\ntextual discrepancy between Leibniz’s use of the word\n“substance” in the Monadologie and the\nPrincipes de la Nature et de la Grace provides an alternative\nto the “developmental” and “two theory”\nreadings of the relevant passages mentioned earlier. It suggests a\nmore general moral for Leibniz scholarship. Whenever one is faced with\ntexts that appear to provide conflicting remarks on an issue, it is\nimportant to consider whether an exoteric strategy that could resolve\nthe apparent conflict might be at work. It is not easy to determine\nwhen an exoteric strategy is at work given that Leibniz rarely flags\nthe features of his works that are exoteric within the works\nthemselves. One must consider Leibniz’s general remarks on\nexoteric strategies along with any additional texts that explicitly or\nimplicitly bear on the passages in question. It is only once all of\nthese texts have been examined that one can argue that a particular\ninterpretive hypothesis is the best all things considered. In some\ncases an esoteric/exoteric interpretation will be the most plausible;\nin other cases it might be more plausible to view Leibniz as having\nchanged his views over time, or as having not fully resolved a\ndifficult problem, among other possibilities (see Whipple 2010 for\ndiscussion of a problem where it is particularly difficult to discern\nthe most plausible interpretation).\n7. Summary\n\nThroughout his career Leibniz distinguished between esoteric and\nexoteric modes of presentation in philosophy. He endorsed the esoteric\nmode, which was modeled closely on the Geometrical model of\ndemonstration, as the ideal mode of presentation. Leibniz did some\nimportant preparatory work for an esoteric presentation of his\nmetaphysics in the 1670s and 1680s, but he never completed a work that\nwas in strict accordance with the esoteric ideal. Although he\ncontinued to regard the geometrical model of demonstration as the\nideal, he thought it would be a mistake to introduce his\nphilosophy to people in the form of an esoteric treatise. This is\nbecause the content of his philosophy was highly esoteric; it\ninvolved a range of abstract principles and theses, many of which were\nfar removed from received opinions. He thought that if he were to\npresent his philosophy in a strictly esoteric manner people would\nmisunderstand it and summarily reject it. This is why exoteric texts\nwere so important for Leibniz. They were designed to serve as\nintellectual stepping-stones that could help readers move from\nreceived opinions to esoteric truth. In letters to trusted\ncorrespondents Leibniz explicitly describes his journal articles and\nthe Essais de théodicée as exoteric works. But\neven Leibniz’s letters to trusted correspondents such as De\nVolder and Des Bosses fall short of the esoteric ideal. All of\nLeibniz’s texts are exoteric to a certain degree, but some are\nmore so than others. They can be categorized as more or less exoteric\ndepending on the degree to which they approximate the esoteric ideal\nin form and content. It is difficult to provide this categorization\ngiven that Leibniz never completed a strictly esoteric treatise.\nHowever, Leibniz’s general comments about the exoteric mode of\npresentation can help us form reasonable hypotheses about the\nimplicitly exoteric features of his texts. We have seen that Leibniz\nutilized a variety of complimentary exoteric techniques,\nincluding:\n\n\n\nSelective omission: he omits the features of his philosophy that are\nfurthest removed from received opinions. In some cases it is possible\nto infer the omitted views from a careful reading of the exoteric\ntext; in other cases a supplementary work is required. \n\n\nSurface reading vs. deep reading: the text admits of an intuitive\nsurface reading that can make his views seem closer to received\nopinions than they actually are. The texts are also compatible with a\nmore rigorous but less straightforward reading; it may or may not be\npossible to grasp the deeper meaning on the basis of the exoteric text\nalone. \n\n\nFamiliar language: he tailors his language to his audience so that it\nwill appear more familiar to them. For example, he uses Cartesian\nlanguage when he writes in the journals of Paris and the language of\nthe schools when he writes in the journals of Leipzig. \n\n\nEclectic references: he appeals to the claims of well-regarded\nhistorical and contemporary figures to illustrate and motivate his own\ntheses. \n\n\nHypothesis: he presents a thesis as a hypothesis rather than providing\na strict demonstration of the thesis, even if he is capable of\nproviding the demonstration. He thinks that in some cases a reader\nwill be less hostile to a novel thesis if it is presented as a\nhypothesis. \n\n\nSensible analogies, metaphors, imaginative thought experiments,\nstories, and anecdotes: he utilizes these devices because they allow\nreaders that are accustomed to conceiving of things by means of the\nsenses and the imagination to attain an introductory understanding of\ntheses and principles that are abstract and distinctly conceivable\nonly through the intellect (not the senses or the imagination).\n\n\n\nSome work identifying particular exoteric strategies has been done in\nthe secondary literature on Leibniz. However, much work remains to be\ndone. More detailed examinations of the exoteric features of\nLeibniz’s works will help us more adequately determine which\ntexts (if any) present his considered views and the extent to which\nhis philosophy is systematic.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources"
        ],
        "cat_ref_text": {
            "Primary Sources": "</h3>\n<p>Note that all quotes from untranslated sources listed below are\ntranslated by the author of this entry.</p>\n<dl class=\"sentag tag3em\">\n<dt>[A]</dt>\n<dd><em>Sämtliche Schriften und Briefe</em>, Darmstadt and\nBerlin: Berlin Academy, 1923–, (cited by series, volume, and\npage).</dd>\n<dt>[AG]</dt>\n<dd><em>Philosophical Essays</em>, Roger Ariew and Daniel Garber\n(trans.), Indianapolis, IN: Hackett, 1989.</dd>\n<dt>[CP]</dt>\n<dd><em>Confessio Philosophi: Papers Concerning the Problem of Evil,\n1671–1678</em>. Translated and edited by Robert C. Sleigh, Jr. New\nHaven, CT: Yale University Press, 2005.</dd>\n<dt>[FC]</dt>\n<dd> <em>Lettres et opuscules inedits</em>, Louis Alexandre Foucher de\nCareil (ed.), Hildesheim, New York: George Olms, 1975.</dd>\n<dt>[G]</dt>\n<dd><em>Die philosophischen Schriften von Gottfried Wilhelm\nLeibniz</em>, C. I. Gerhardt (ed.), Berlin: Weidman, 1875–1890\n(cited by volume and page).</dd>\n<dt>[L]</dt>\n<dd><em>Philosophical Papers and Letters</em>, second edition, Leroy\nE. Loemker (trans.), Dordrecht and Boston: Reidel, 1969.</dd>\n<dt>[LR]</dt>\n<dd><em>The Leibniz-Des Bosses Correspondence</em>, Brandon C. Look\nand Donald Rutherford (trans.), New Haven, CT: Yale University Press,\n2007.</dd>\n<dt>[LBr]</dt>\n<dd><em>Briefwechsel</em>, Hannover: Gottfried Wilhelm Leibniz\nBibliothek/Niedersächsische Landesbibliothek.</dd>\n<dt>[NE]</dt>\n<dd><em>New Essays on Human Understanding</em> (<em>Nouveaux essais\nsur l’entendement humain</em>), Peter Remnant and Jonathan\nBennett (trans.), Cambridge: Cambridge University Press, 1981 (the\npagination of this work corresponds to that of the Academy edition A\nvi 6; thus only one reference is required).</dd>\n<dt>[RA]</dt>\n<dd><em>The Labyrinth of the Continuum: Writings on the Continuum\nProblem, 1672–1686</em>, Richard T. W. Arthur (trans.), New\nHaven, CT: Yale University Press, 2001.</dd>\n<dt>[SR]</dt>\n<dd><em>De Summa Rerum: Metaphysical Paper,\n1675–1676</em>. Translated and edited by G.H.R. Parkinson. New\nHaven, CT: Yale University Press, 1992.</dd>\n<dt>[T]</dt>\n<dd><em>Theodicy: Essays on the Goodness of God, the Freedom of Man,\nand the Origin of Evil</em> (<em>Essais de\nthéodicée</em>), E. M. Huggard (trans.), La Salle, IL:\nOpen Court, 1985 (cited from G 4 by section number).</dd>\n<dt>[WF]</dt>\n<dd><em>Leibniz’s ‘New System’ and Associated\nContemporary Texts</em>, Roger S. Woolhouse and Richard Francks\n(trans), Oxford: Clarendon Press, 1997.\ndoi:10.1093/actrade/9780198248460.book.1</dd>\n</dl>\n<h3 id=\"SecoSour\">",
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, New York: Oxford University Press.\ndoi:10.1093/0195126491.001.0001",
                "Antognazza, Maria Rosa, 2009, <em>Leibniz: An Intellectual\nBiography</em>, Cambridge/New York: Cambridge University Press.\ndoi:10.1017/CBO9781139012805",
                "Brown, Stuart, 1996, “Leibniz’s <em>New System</em>\nStrategy”, in Woolhouse 1996: 37–61.",
                "Curley, E. M., 1972, “The Root of Contingency”, in\n<em>Leibniz: a Collection of Critical Essays</em>, Harry G. Frankfurt\n(ed.), Notre Dame, IN: University of Notre Dame Press,\n69–97.",
                "Garber, Daniel, 2009, <em>Leibniz: Body, Substance, Monad</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199566648.001.0001",
                "Hartz, Glenn A., 2007, <em>Leibniz’s Final System: Monads,\nMatter, and Animals</em>, London: Routledge.\ndoi:10.4324/9780203967966",
                "Lamarra, Antonio, 2009, “<em>La Pensée Monadologique\nde Leibniz dans la Théodicée: Problèmes\nd’Interprétation</em>”, in <em>L’idée\nde théodicée de Leibniz à Kant: héritage,\ntransformations, critiques</em>, Paul Rateau (ed.), Stuttgart: Franz\nSteiner Verlag, 11–21.",
                "Lodge, Paul, 2001, “Leibniz’s Notion of an\nAggregate”, <em>British Journal for the History of\nPhilosophy</em>, 9(3): 467–486.\ndoi:10.1080/09608780110072461",
                "–––, 2010, “The Empirical Grounds for\nLeibniz’s ‘Real Metaphysics’:”, <em>Leibniz\nSociety Review</em>, 20: 13–36. doi:10.5840/leibniz2010202",
                "Look, Brandon, 1999, <em>Leibniz and the “Vinculum\nSubstantiale”</em>, Stuttgart: Franz Steiner.",
                "Look, Brandon C. and Donald Rutherford, 2007,\n“Introduction”, in <em>The Leibniz-Des Bosses\nCorrespondence</em>, New Haven, CT: Yale University Press.",
                "Melzer, Arthur M., 2014, <em>Philosophy Between the Lines: The\nLost History of Esoteric Writing</em>, Chicago: University of Chicago\nPress.",
                "Mercer, Christia, 2001, <em>Leibniz’s Metaphysics: Its\nOrigins and Development</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511498268",
                "Nelson, Alan, 2005, “The Rationalist Impulse”, in\n<em>A Companion to Rationalism</em>, Alan Nelson (ed.), Oxford:\nBlackwell Publishing, 1–11. doi:10.1002/9780470996904.ch1",
                "Russell, Bertrand, 1937, <em>A Critical Exposition of the\nPhilosophy of Leibniz</em>, second edition, London: Allen and\nUnwin.",
                "–––, 1945, <em>A History of Western Philosophy,\nand Its Connection with Political and Social Circumstances from the\nEarliest Times to the Present Day</em>, New York: Simon and Schuster.\n[Chapter 11 on Leibniz is on pp. 581–596.]",
                "Rutherford, Donald, 1995, <em>Leibniz and the Rational Order of\nNature</em>, Cambridge/New York, NY: Cambridge University Press.\ndoi:10.1017/CBO9781139172776",
                "–––, 1996. “Demonstration and\nReconciliation: The Eclipse of the Geometrical Method in\nLeibniz’s Philosophy”, in Woolhouse 1996:\n181–201.",
                "Schepers, Heinrich, 2008, “Leibniz’s Rationalism: A\nPlea Against Equating Soft and Strong Rationality”, in\n<em>Leibniz: What Kind of Rationalist?</em>, Marcelo Dascal (ed.),\n(Logic, Epistemology, and the Unity of Science 13), Dordrecht:\nSpringer Netherlands, 17–35.\ndoi:10.1007/978-1-4020-8668-7_2",
                "Whipple, John, 2010, “The Structure of Leibnizian Simple\nSubstances”, <em>British Journal for the History of\nPhilosophy</em>, 18(3): 379–410.\ndoi:10.1080/09608781003779768",
                "–––, 2011, “Continual Creation and Finite\nSubstance in Leibniz’s Metaphysics:”, <em>Journal of\nPhilosophical Research</em>, 36: 1–30.\ndoi:10.5840/jpr_2011_6",
                "–––, 2015a, “Leibniz and the Art of\nExoteric Writing”, <em>Philosopher’s Imprint</em>, 15:\narticle 35.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0015.035\" target=\"other\">Whipple 2015a available online</a>]",
                "–––, 2015b, “Leibniz on Substance and\nCausation”, in <em>Locke and Leibniz on Substance</em>, Paul\nLodge and Tom Stoneham (eds.), New York: Routledge.",
                "–––, 2017, “Leibniz on Fundamental\nOntology: Idealism and Pedagogical Exoteric Writing”, <em>Ergo,\nan Open Access Journal of Philosophy</em>, 4(11): 311–348.\ndoi:10.3998/ergo.12405314.0004.011",
                "–––, 2020, “The Correspondence with De\nVolder”, in <em>Leibniz’s Key Philosophical Writings</em>,\nPaul Lodge and Lloyd Strickland (eds.), Oxford: Oxford University\nPress, 123–144. doi:10.1093/oso/9780198844983.003.0007",
                "Woolhouse, Roger S. (ed.), 1996, <em>Leibniz’s “New\nSystem” (1695)</em>, Firenze, Italy: L.S. Olschki.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<p>Note that all quotes from untranslated sources listed below are\ntranslated by the author of this entry.</p>\n<dl class=\"sentag tag3em\">\n<dt>[A]</dt>\n<dd><em>Sämtliche Schriften und Briefe</em>, Darmstadt and\nBerlin: Berlin Academy, 1923–, (cited by series, volume, and\npage).</dd>\n<dt>[AG]</dt>\n<dd><em>Philosophical Essays</em>, Roger Ariew and Daniel Garber\n(trans.), Indianapolis, IN: Hackett, 1989.</dd>\n<dt>[CP]</dt>\n<dd><em>Confessio Philosophi: Papers Concerning the Problem of Evil,\n1671–1678</em>. Translated and edited by Robert C. Sleigh, Jr. New\nHaven, CT: Yale University Press, 2005.</dd>\n<dt>[FC]</dt>\n<dd> <em>Lettres et opuscules inedits</em>, Louis Alexandre Foucher de\nCareil (ed.), Hildesheim, New York: George Olms, 1975.</dd>\n<dt>[G]</dt>\n<dd><em>Die philosophischen Schriften von Gottfried Wilhelm\nLeibniz</em>, C. I. Gerhardt (ed.), Berlin: Weidman, 1875–1890\n(cited by volume and page).</dd>\n<dt>[L]</dt>\n<dd><em>Philosophical Papers and Letters</em>, second edition, Leroy\nE. Loemker (trans.), Dordrecht and Boston: Reidel, 1969.</dd>\n<dt>[LR]</dt>\n<dd><em>The Leibniz-Des Bosses Correspondence</em>, Brandon C. Look\nand Donald Rutherford (trans.), New Haven, CT: Yale University Press,\n2007.</dd>\n<dt>[LBr]</dt>\n<dd><em>Briefwechsel</em>, Hannover: Gottfried Wilhelm Leibniz\nBibliothek/Niedersächsische Landesbibliothek.</dd>\n<dt>[NE]</dt>\n<dd><em>New Essays on Human Understanding</em> (<em>Nouveaux essais\nsur l’entendement humain</em>), Peter Remnant and Jonathan\nBennett (trans.), Cambridge: Cambridge University Press, 1981 (the\npagination of this work corresponds to that of the Academy edition A\nvi 6; thus only one reference is required).</dd>\n<dt>[RA]</dt>\n<dd><em>The Labyrinth of the Continuum: Writings on the Continuum\nProblem, 1672–1686</em>, Richard T. W. Arthur (trans.), New\nHaven, CT: Yale University Press, 2001.</dd>\n<dt>[SR]</dt>\n<dd><em>De Summa Rerum: Metaphysical Paper,\n1675–1676</em>. Translated and edited by G.H.R. Parkinson. New\nHaven, CT: Yale University Press, 1992.</dd>\n<dt>[T]</dt>\n<dd><em>Theodicy: Essays on the Goodness of God, the Freedom of Man,\nand the Origin of Evil</em> (<em>Essais de\nthéodicée</em>), E. M. Huggard (trans.), La Salle, IL:\nOpen Court, 1985 (cited from G 4 by section number).</dd>\n<dt>[WF]</dt>\n<dd><em>Leibniz’s ‘New System’ and Associated\nContemporary Texts</em>, Roger S. Woolhouse and Richard Francks\n(trans), Oxford: Clarendon Press, 1997.\ndoi:10.1093/actrade/9780198248460.book.1</dd>\n</dl>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Adams, Robert Merrihew, 1994, <em>Leibniz: Determinist, Theist,\nIdealist</em>, New York: Oxford University Press.\ndoi:10.1093/0195126491.001.0001</li>\n<li>Antognazza, Maria Rosa, 2009, <em>Leibniz: An Intellectual\nBiography</em>, Cambridge/New York: Cambridge University Press.\ndoi:10.1017/CBO9781139012805</li>\n<li>Brown, Stuart, 1996, “Leibniz’s <em>New System</em>\nStrategy”, in Woolhouse 1996: 37–61.</li>\n<li>Curley, E. M., 1972, “The Root of Contingency”, in\n<em>Leibniz: a Collection of Critical Essays</em>, Harry G. Frankfurt\n(ed.), Notre Dame, IN: University of Notre Dame Press,\n69–97.</li>\n<li>Garber, Daniel, 2009, <em>Leibniz: Body, Substance, Monad</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199566648.001.0001</li>\n<li>Hartz, Glenn A., 2007, <em>Leibniz’s Final System: Monads,\nMatter, and Animals</em>, London: Routledge.\ndoi:10.4324/9780203967966</li>\n<li>Lamarra, Antonio, 2009, “<em>La Pensée Monadologique\nde Leibniz dans la Théodicée: Problèmes\nd’Interprétation</em>”, in <em>L’idée\nde théodicée de Leibniz à Kant: héritage,\ntransformations, critiques</em>, Paul Rateau (ed.), Stuttgart: Franz\nSteiner Verlag, 11–21.</li>\n<li>Lodge, Paul, 2001, “Leibniz’s Notion of an\nAggregate”, <em>British Journal for the History of\nPhilosophy</em>, 9(3): 467–486.\ndoi:10.1080/09608780110072461</li>\n<li>–––, 2010, “The Empirical Grounds for\nLeibniz’s ‘Real Metaphysics’:”, <em>Leibniz\nSociety Review</em>, 20: 13–36. doi:10.5840/leibniz2010202</li>\n<li>Look, Brandon, 1999, <em>Leibniz and the “Vinculum\nSubstantiale”</em>, Stuttgart: Franz Steiner.</li>\n<li>Look, Brandon C. and Donald Rutherford, 2007,\n“Introduction”, in <em>The Leibniz-Des Bosses\nCorrespondence</em>, New Haven, CT: Yale University Press.</li>\n<li>Melzer, Arthur M., 2014, <em>Philosophy Between the Lines: The\nLost History of Esoteric Writing</em>, Chicago: University of Chicago\nPress.</li>\n<li>Mercer, Christia, 2001, <em>Leibniz’s Metaphysics: Its\nOrigins and Development</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511498268</li>\n<li>Nelson, Alan, 2005, “The Rationalist Impulse”, in\n<em>A Companion to Rationalism</em>, Alan Nelson (ed.), Oxford:\nBlackwell Publishing, 1–11. doi:10.1002/9780470996904.ch1</li>\n<li>Russell, Bertrand, 1937, <em>A Critical Exposition of the\nPhilosophy of Leibniz</em>, second edition, London: Allen and\nUnwin.</li>\n<li>–––, 1945, <em>A History of Western Philosophy,\nand Its Connection with Political and Social Circumstances from the\nEarliest Times to the Present Day</em>, New York: Simon and Schuster.\n[Chapter 11 on Leibniz is on pp. 581–596.]</li>\n<li>Rutherford, Donald, 1995, <em>Leibniz and the Rational Order of\nNature</em>, Cambridge/New York, NY: Cambridge University Press.\ndoi:10.1017/CBO9781139172776</li>\n<li>–––, 1996. “Demonstration and\nReconciliation: The Eclipse of the Geometrical Method in\nLeibniz’s Philosophy”, in Woolhouse 1996:\n181–201.</li>\n<li>Schepers, Heinrich, 2008, “Leibniz’s Rationalism: A\nPlea Against Equating Soft and Strong Rationality”, in\n<em>Leibniz: What Kind of Rationalist?</em>, Marcelo Dascal (ed.),\n(Logic, Epistemology, and the Unity of Science 13), Dordrecht:\nSpringer Netherlands, 17–35.\ndoi:10.1007/978-1-4020-8668-7_2</li>\n<li>Whipple, John, 2010, “The Structure of Leibnizian Simple\nSubstances”, <em>British Journal for the History of\nPhilosophy</em>, 18(3): 379–410.\ndoi:10.1080/09608781003779768</li>\n<li>–––, 2011, “Continual Creation and Finite\nSubstance in Leibniz’s Metaphysics:”, <em>Journal of\nPhilosophical Research</em>, 36: 1–30.\ndoi:10.5840/jpr_2011_6</li>\n<li>–––, 2015a, “Leibniz and the Art of\nExoteric Writing”, <em>Philosopher’s Imprint</em>, 15:\narticle 35.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0015.035\" target=\"other\">Whipple 2015a available online</a>]</li>\n<li>–––, 2015b, “Leibniz on Substance and\nCausation”, in <em>Locke and Leibniz on Substance</em>, Paul\nLodge and Tom Stoneham (eds.), New York: Routledge.</li>\n<li>–––, 2017, “Leibniz on Fundamental\nOntology: Idealism and Pedagogical Exoteric Writing”, <em>Ergo,\nan Open Access Journal of Philosophy</em>, 4(11): 311–348.\ndoi:10.3998/ergo.12405314.0004.011</li>\n<li>–––, 2020, “The Correspondence with De\nVolder”, in <em>Leibniz’s Key Philosophical Writings</em>,\nPaul Lodge and Lloyd Strickland (eds.), Oxford: Oxford University\nPress, 123–144. doi:10.1093/oso/9780198844983.003.0007</li>\n<li>Woolhouse, Roger S. (ed.), 1996, <em>Leibniz’s “New\nSystem” (1695)</em>, Firenze, Italy: L.S. Olschki.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Arnauld, Antoine",
            "Bayle, Pierre",
            "identity: of indiscernibles",
            "Leibniz, Gottfried Wilhelm",
            "Leibniz, Gottfried Wilhelm: on causation",
            "metaphor"
        ],
        "entry_link": [
            {
                "../arnauld/": "Arnauld, Antoine"
            },
            {
                "../bayle/": "Bayle, Pierre"
            },
            {
                "../identity-indiscernible/": "identity: of indiscernibles"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../leibniz-causation/": "Leibniz, Gottfried Wilhelm: on causation"
            },
            {
                "../metaphor/": "metaphor"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=leibniz-exoteric\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/leibniz-exoteric/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=leibniz-exoteric&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/leibniz-exoteric/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=leibniz-exoteric": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/leibniz-exoteric/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=leibniz-exoteric&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/leibniz-exoteric/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}