{
    "url": "logic-conditionals",
    "title": "The Logic of Conditionals",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Paul Egré\n<paulegre@gmail.com>\nHans Rott\n<hans.rott@ur.de>",
        "author_links": [
            {
                "http://paulegre.free.fr/": "Paul Egré"
            },
            {
                "mailto:paulegre%40gmail%2ecom": "paulegre@gmail.com"
            },
            {
                "https://www.uni-regensburg.de/philosophie-kunst-geschichte-gesellschaft/theoretische-philosophie/personen/prof-dr-hans-rott/index.html": "Hans Rott"
            },
            {
                "mailto:hans%2erott%40ur%2ede": "hans.rott@ur.de"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://paulegre.free.fr/\" target=\"other\">Paul Egré</a>\n&lt;<a href=\"mailto:paulegre%40gmail%2ecom\"><em>paulegre<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;<br/>\n<a href=\"https://www.uni-regensburg.de/philosophie-kunst-geschichte-gesellschaft/theoretische-philosophie/personen/prof-dr-hans-rott/index.html\" target=\"other\">Hans Rott</a>\n&lt;<a href=\"mailto:hans%2erott%40ur%2ede\"><em>hans<abbr title=\" dot \">.</abbr>rott<abbr title=\" at \">@</abbr>ur<abbr title=\" dot \">.</abbr>de</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Jul 3, 2021"
    ],
    "preamble": "\n\nThis article provides a survey of classic and recent work in\nconditional logic. We review the problems of a two-valued analysis and\nexamine logics based on richer semantic frameworks that have been\nproposed to deal with conditional sentences of the form “if\nA, B,” including trivalent semantics,\npossible-world semantics, premise semantics, and probabilistic\nsemantics. We go on to examine theories of conditionals involving\nbelief revision, and highlight recent approaches based on the idea\nthat a conditional is assertable provided the truth of its antecedent\nmakes a relevant difference to that of its consequent. We close with a\nbrief discussion of systems accounting for the interaction of\nconditionals with modalities and speech act operators.\n",
    "toc": [
        {
            "#Intr": "1. Introduction"
        },
        {
            "#ThreValuCond": "2. Three-Valued Conditionals"
        },
        {
            "#Moti": "2.1 Motivations"
        },
        {
            "#SomeTrivLogi": "2.2 Some trivalent logics"
        },
        {
            "#OpenIssu": "2.3 Open issues"
        },
        {
            "#PossWorlMode": "3. Possible Worlds Models"
        },
        {
            "#StriCond": "3.1 Strict conditionals"
        },
        {
            "#VariStriCond": "3.2 Variably strict conditionals"
        },
        {
            "#MainSema": "3.2.1 Main semantics"
        },
        {
            "#FramCorrProp": "3.2.2 Frame correspondence properties"
        },
        {
            "#LogiForCond": "3.3 Logics for conditionals"
        },
        {
            "#NonmLogiPrefMode": "3.4 Nonmonotonic logic and preferential models"
        },
        {
            "#IfImpoExpoSimpDisjAnte": "3.5 Or-to-If, Import-Export, Simplification of Disjunctive Antecedents"
        },
        {
            "#PremSema": "4. Premise Semantics"
        },
        {
            "#Moti_1": "4.1 Motivations"
        },
        {
            "#PremFram": "4.2 Premise frames"
        },
        {
            "#CorrOrdeSema": "4.3 Correspondence with ordering semantics"
        },
        {
            "#ProbLogi": "5. Probabilistic Logics"
        },
        {
            "#AdamLogi": "5.1 Adams’s logic"
        },
        {
            "#LewiTrivTheo": "5.2 Lewis’s triviality theorem"
        },
        {
            "#CardImag": "5.3 Cardinality and imaging"
        },
        {
            "#Card": "5.3.1 Cardinality"
        },
        {
            "#Imag": "5.3.2 Imaging"
        },
        {
            "#ProbForCompCond": "5.4 Probabilities for compound conditionals"
        },
        {
            "#BeliReviAppr": "6. Belief Revision Approaches"
        },
        {
            "#BeliReviModeRamsTest": "6.1 Belief revision models and the Ramsey test"
        },
        {
            "#GrdeTrivTheo": "6.2 Gärdenfors’s triviality theorem"
        },
        {
            "#ReleDiffMaki": "7. Relevance and Difference-Making"
        },
        {
            "#ModaSpeeActs": "8. Modals and Speech Acts"
        },
        {
            "#Moda": "8.1 Modalities"
        },
        {
            "#BeyoAsse": "8.2 Beyond assertion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introduction\n\nLogics of conditionals deal with inferences involving sentences of the\nform “if A, (then) B” of natural\nlanguage. Despite the overwhelming presence of such sentences in\neveryday discourse and reasoning, there is surprisingly little\nagreement about what the right logic of conditionals might be, or even\nabout whether a unified theory can be given for all kinds of\nconditionals. The problem is not new, but can be traced back to\ndebates between Megarian and Stoic logicians (see Sextus Empiricus,\nOutlines of Scepticism II, 110–112; Kneale & Kneale\n1962; Sanford 1989; Weiss 2019). Famously, Philo of Megara proposed\nthat a conditional of the form “if A then\nB” is true exactly when it is not the case that\nA is true and B is false. The same definition is at\nthe core of the modern treatment of the conditional as so-called\n“material implication” in the two-valued propositional\nframework of Frege (1879) and Whitehead and Russell (1910).\n\n\n  \n\n\n\n \n\\(B\\) \n\n\\(A \\supset B\\)\n1\n0  \n\n\n\\(A\\)\n1\n1\n0 \n\n0\n1\n1  \n\n\nTable 1: The material conditional\n\n\nThis understanding of the conditional has considerable virtues of\nsimplicity, and in that regard the material conditional analysis\nprovides a benchmark for other theories. Probably its main virtue is\nthat it lends itself to a truth-functional treatment (the truth value\nof a conditional is a function of the truth values of antecedent and\nconsequent). A related one is that it makes the conditional\ninterdefinable with Boolean negation, disjunction, and conjunction. A\nthird, among the driving motivations for Frege, Russell and Whitehead,\nis that it appears adequate to regiment mathematical proofs involving\nconditional sentences. Despite that, as granted by Frege himself in\nthe Begriffsschrift, it fails to do justice to some of the\nways in which conditionals are ordinarily understood and used in\nnatural language.\n\nAn oddity pointed out early by MacColl (1908) is the observation that\nof any two sentences of the form “not A or\nB” and “not B or A”, at\nleast one must be true. Assuming the equivalence with the material\nconditional, this implies that either “if John is a physician,\nthen he is red-haired” or “if John is red-haired, then he\nis a physician” must be true. Intuitively, however, one may be\ninclined to reject both conditionals. Similar complications, known as\nthe paradoxes of material implication, concern the fact that\nfor any sentences A and B, “if A then\nB” follows from “not A”, but also\nfrom “B”, thereby allowing true and false\nsentences to create true conditionals irrespective of their content\n(C. I. Lewis 1912). Another peculiarity looms large: the negation of\n“if A then B” is predicted to be\n“A and not B”, but intuitively one may\ndeny that “if God exists, all criminals will go to heaven”\nwithout committing oneself to the existence of God (cited in Lycan\n2001).\n\nA fourth complication is that conditional sentences in natural\nlanguage are not limited to indicative conditionals (“if I\nstrike this match, it will light”), but also include subjunctive\nconditionals used to express counterfactual hypotheses (“if I\nhad struck this match, it would have lit”). All counterfactual\nconditionals would be vacuously true if analyzed as material\nconditionals with a false antecedent, as pointed out by Quine (1950),\nan obviously inadequate result, suggesting that the interplay of\ngrammatical tense and grammatical mood should also be of concern to\nunderstand the logic of conditionals.\n\nTo a large extent, the development of conditional logics over the past\ncentury has thus been driven by the quest for a more sophisticated\naccount of the connection between antecedent and consequent in\nconditionals. A number of conditional logics have thus been developed\nwithin the framework of modal logic, to capture the idea that\nconditional sentences express a necessary connection of sort between\nantecedent and consequent, whether metaphysical, epistemic, or deontic\n(see C. I. Lewis 1912; Stalnaker 1968; D. Lewis 1973; Kratzer 2012). A\nrelated wave of work encompasses the so-called cotenability theories\nof conditionals, in which the idea is that a conditional is assertable\nif its antecedent, together with suitable (co-tenable) premises,\nentails its consequent (see Chisholm 1946; Goodman 1955; Rescher\n1964).\n\nAnother strand of influential logics has been motivated by the idea\nthat conditionals have probabilities or express a probabilistic\ndependence between their antecedents and their consequents (Ramsey\n1931; de Finetti 1936; Adams 1965; Edgington 1995; Douven 2016). A\nvery influential source of this is a passage by Ramsey (1931), in\nwhich he writes:\n\n\nIf two people are arguing “If \\(p\\), then \\(q\\)?” and are\nboth in doubt as to \\(p\\), they are adding \\(p\\) hypothetically to\ntheir stock of knowledge and arguing on that basis about \\(q\\); so\nthat in a sense “If \\(p\\), \\(q\\)” and “If \\(p\\),\n\\(\\neg q\\)” are contradictories. We can say that they are fixing\ntheir degree of belief in \\(q\\) given \\(p\\). If \\(p\\) turns out false,\nthese degrees of belief are rendered void. If either party\nbelieves not \\(p\\) for certain, the question ceases to mean\nanything to him except as a question about what follows from certain\nlaws or hypothesis. [Notation adapted]\n\n\nImportantly, the so-called Ramsey Test (adding the antecedent\nhypothetically to one’s beliefs) has inspired a number of\napproaches that stand as some of the cornerstones of conditional\nlogics. This includes Stalnaker’s modal logic of conditionals\nbased on the idea that the antecedent of a conditional selects a\nhypothetical possible world (Stalnaker 1968). It also includes\nAdams’s approach based on studying formally the idea that the\nprobability of (non-nested) conditionals is given by the corresponding\nconditional probability (Adams 1965, 1975), as well as more\nqualitative theories of the acceptability of conditionals in terms of\n(non-probabilistic) belief revision policies (Gärdenfors 1986).\nFinally, Ramsey’s idea that conditionals with a false antecedent\nare void underlies the main motivation behind three-valued accounts of\nconditionals, developed independently by various authors (in\nparticular by de Finetti 1936).\n\nIn this entry, our presentation of conditional logics will be\nstructured by the centrality of those various frameworks. Our goal in\nparticular will be to allow readers to orient themselves easily\nbetween those frameworks, and also to show how they communicate. We\nstart with a presentation of three-valued logics of conditionals in\n section 2.\n Section 3 surveys the main analyses of the conditional in modal\nlogics (possible worlds semantics). In\n section 4,\n we discuss so-called premise semantics, which formalize the\nco-tenability idea, and which shed a different light on standard modal\nanalyses.\n Section 5\n moves on to probabilistic logics of conditionals, and\n section 6\n to qualitative approaches in terms of belief revision.\n Section 7\n and\n section 8,\n finally, will present more recent developments or refinements: first,\nlogics based on the idea that the antecedent ought to make a relevant\ndifference to the consequent, then some extensions of propositional\nlogics of conditionals addressing the interaction of conditionals with\nmodalities as well as with questions and commands.\n\nOne caveat is that in this entry we will try to keep a unified\nperspective on both indicative and subjunctive conditionals. Although\nsome authors, notably David Lewis, have insisted on treating them\ndifferently, differences can be handled parametrically relative to a\ncommon semantic core (viz., Stalnaker 1975 or Pearl 2009). We will\npoint to differences when relevant, but refer the reader to\nStarr’s (2019) SEP entry on counterfactuals that deals with the\ntopic rather extensively. On some aspects our entry also overlaps with\nEdgington’s (2020) SEP entry on indicative conditionals, and\nreaders are invited to consult both of those entries for\ncomplements.\n\nIn what follows, we will represent the conditional operator by the\nsymbol \\(>\\). We distinguish three main layers of syntactic\ncomplexity. Let \\(L_0\\) be a propositional language capable of\nbuilding factual sentences from atoms with the help of the\nusual Boolean connectives (\\(\\neg\\), \\(\\wedge\\), \\(\\vee\\), \\(\\supset\\)\nand \\(\\equiv\\) for negation, conjunction, disjunction, material\nconditional and material equivalence, respectively). Then \\(L_1\\) is\nthe extension of \\(L_0\\) with flat conditionals, such that if\n\\(A\\) and \\(B\\) are in \\(L_0\\) then \\(A>B\\) is in \\(L_1\\). And\n\\(L_2\\) is the extension of \\(L_0\\) and \\(L_1\\) allowing free\ncombinations of all connectives, including arbitrary nestings of\nconditionals.\n2. Three-Valued Conditionals\n2.1 Motivations\n\nLogics of indicative conditionals, in so far as they are based on\ntruth evaluations, all agree that a conditional is false if its\nantecedent is true and its consequent is false. This is captured by\nthe two-valued analysis. Less obvious is the assumption that a\nconditional is true when both antecedent and consequent are true, for\nthis predicts that \\(A\\wedge B\\) entails \\(A >B\\). And even more\ncontroversial is the proviso that a conditional is true whenever its\nantecedent is false, which indeed is one of the paradoxes of the\nmaterial conditional.\n\nC. I. Lewis’s (1912) response to the paradoxes of the material\nconditional is his proposal of a strict conditional (aka “strict\nimplication”, section\n 3).\n The strict conditional is no longer truth-functional, however. A\ncloser kin to standard two-valued logic in this regard is the family\nof three-valued logics originating from the work of Łukasiewicz\n(1920), which retain truth-functionality. Łukasiewicz’s\nmain motivation was not to deal specifically with conditionals,\nhowever, but with the notion of possibility. Łukasiewicz’s\nconditional is shown in\n Table 2.\n Łukasiewicz defines validity to be the preservation of the value\n1 from premises to conclusion, as in two-valued logic. His operator\nretains the law of Identity \\(A>A\\) and various classic schemata\n(such as Modus Ponens), but it also fails some classical properties\n(it is non-contractive, for example, failing the inference from\n\\(A>(A>B)\\) to \\(A>B\\)). It agrees with the two-valued\nconditional on classical input, and it does not block the paradoxes of\nthe material conditional.\n\n\n  \n\n\n\n \n\\(B\\) \n\n\\(A > B\\)\n1\n½\n0  \n\n\n \n1\n1\n½\n0 \n\n\\(A\\)\n½\n1\n1\n½ \n\n \n0\n1\n1\n1  \n\n\nTable 2: Łukasiewicz’s\nconditional\n\n\nŁukasiewicz’s work was a source of inspiration to\nReichenbach, and subsequently to de Finetti, both of whom put forward\nthe idea expressed earlier by Ramsey that a conditional must be\nindeterminate when its antecedent is false (see Reichenbach 1935,\n1944; de Finetti 1936). Reichenbach deems meaningless the\nevaluation of a conditional \\(A>B\\) when \\(A\\) concerns some\nmeasurement rendered impossible by some other measurement (as\npredicted in quantum physics). For de Finetti, the idea is that a\nconditional sentence is like a bet. When someone bets that the card\nwill be a king if it is a club, the bet should simply be called off if\nthe card turns out to be of a different suit. On that basis, de\nFinetti proposed a table (sometimes called the “defective”\nconditional, see Baratgin et al. 2013, Over & Baratgin 2017) for\nwhat he calls the logic of tri-events, where a tri-event refers to\n“the event \\(B\\) conditional upon event \\(A\\)”. The\ntri-event is true when both events are true, false when \\(A\\) is true\nand \\(B\\) false, and null if \\(B\\) is false.\n\n\n  \n\n\n\n \n\\(B\\) \n\n\\(A > B\\)\n1\n½\n0  \n\n\n \n1\n1\n½\n0 \n\n\\(A\\)\n½\n½\n½\n½ \n\n \n0\n½\n½\n½  \n\n\nTable 3: De Finetti’s\nconditional\n\n\nAs\n Table 3\n shows, there is now a third truth value ½ (for\n“null” or “void” or\n“indeterminate”) beyond the classical values 1 (for\n“true”) and 0 (for “false”). This is why these\nlogics are called trivalent. The conditional is no longer\nclassically valued for classical input. Although Reichenbach and de\nFinetti considered the interplay of this conditional with other\ntrivalent connectives, they did not investigate the logics resulting\nfrom that choice. Investigations of logics resulting from de\nFinetti’s table spread in a scattered way, often oblivious of\nthe work of Reichenbach and de Finetti. One path was paved by remarks\ndue to Quine (1950), crediting the work of Ph. Rhinelander on the idea\nthat the assertion of a sentence of the form “if \\(A\\) then\n\\(C\\)” is commonly felt “less as the assertion of a\nconditional than as a conditional assertion of the consequent”\n(see Jeffrey 1963; Cooper 1968; Belnap 1970, 1973; Manor 1975; Farrell\n1979, 1986; Olkhovikov 2002; Huitink 2008). This view is known more\nbroadly as the suppositional view (Adams 1975; Edgington 1995).\nAnother line of work was pursued in connection with algebraic\ntreatments of probability, much in the spirit of de Finetti’s\noriginal work, who viewed trivalence as a way of representing the\nnotion of conditional probability more qualitatively (see Schay 1968;\nCalabrese 1991; Dubois & Prade 1994; McDermott 1996; Milne 1997;\nCantwell 2008; Rothschild 2014; Lassiter 2020).\n2.2 Some trivalent logics\n\nAmongst trivalent logics based on variations of de Finetti’s\ntable, some systems stand out. First, there is Cooper’s logic\nOL and a close variant of it, Cantwell’s logic\nCC/TT (as named in Égré, Rossi, &\nSprenger 2021, after Cooper and Cantwell), itself a fragment of the\nlogic LImp of Olkhovikov (2002), which also\nincorporates a modal necessity operator.\nOL and CC/TT are\ndefined for \\(L_2\\), the full language allowing nested conditionals.\nLike de Finetti, Cooper (1968) handles the conditional as\nindeterminate when the antecedent is false (0). However, the\nconditional takes the value of the consequent when the antecedent is\nnot false (either 1 or ½). Hence, instead of grouping\n½ with 0, as de Finetti does, it groups ½ with 1.\n Table 4\n was rediscovered independently by Olkhovikov (2002) and by Cantwell\n(2008), with very similar motivations in mind. It was also proposed by\nBelnap (1973), who presents it as a suitable modification from Belnap\n(1970), who first used the same table as De Finetti’s.\n\n\n  \n\n\n\n \n\\(B\\) \n\n\\(A > B\\)\n1\n½\n0  \n\n\n \n1\n1\n½\n0 \n\n\\(A\\)\n½\n1\n½\n0 \n\n \n0\n½\n½\n½  \n\n\nTable 4: Cooper’s conditional\n\n\nCooper, Olkhovikov, and Cantwell define an inference to be valid\nif the conclusion is not false whenever all the premises are not\nfalse, for all trivalent valuations of the language. A central feature\nof their systems is that the full deduction theorem holds (a feature\nalso stressed by Jeffrey 1963 and Belnap 1973): \n\n\\[\\tag{DT} \\Gamma, A\\vDash B \\tiff \\Gamma\\vDash A>B.\\]\n\n\nOne difference between their systems is that Cooper defines validity\nrelative to trivalent valuations that are atom-classical; another is\nthat Cooper uses so-called quasi-conjunction and disjunction (see\nbelow), whereas Olkhovikov and Cantwell use the common min and max\nrules for conjunction and disjunction, respectively. For Cooper and\nCantwell, in particular, and similarly for Belnap (1973), a central\nmotivation for this conditional is the validation of the principle of\nNegation Commutation for the conditional, namely the conjunction\nof: \n\n\\[\\tag{EX} A>\\neg B \\;\\vDash\\; \\neg (A>B). \\] \\[\\tag{IN} \\neg (A>B) \\;\\vDash\\; A>\\neg B.\\]\n\n\nPrinciple EX in particular is characteristic of connexive logics (see\nSection\n 7\n below). Another important feature of the resulting logics is that\nwhereas Modus Ponens is a valid argument schema, Modus Tollens and\nContraposition fail in general (though they remain valid over atomic\nvariants of the schemata in Cooper’s OL):\n\n\\[\\tag{MP} A,\\ A>B \\;\\vDash\\; B.\\] \\[\\tag{MT} \\neg B,\\ A>B \\;\\not\\vDash\\; \\neg A.\\] \\[\\tag{CP} A>B \\;\\not\\vDash\\; \\neg B >\\neg A.\\]\n\n\nSince \\(A\\not \\vDash \\neg A >B\\), the Cooper conditional blocks one\nof the paradoxes of the material conditional, but it retains another\none, namely \\(A\\vdash B>A\\). Relatedly, although Cooper and\nCantwell or Olkhovikov use different semantics for conjunction,\non their approaches, conjunction entails the conditional. This\nprinciple is called Conjunctive Sufficiency: \n\n\\[\\tag{CS} A \\wedge B \\;\\vDash\\; A>B.\\]\n\n\nCooper provides a complete axiomatization for his logic, using a\nsystem of inference rules close to a natural deduction system (system\nOL). Using tableaux and sequent calculi,\nÉgré, Rossi, and Sprenger (2021) compare the\nCooper-Cantwell logic CC/TT with the logic\nDF/TT that results from de Finetti’s table and\nthe same notion of validity (preservation of non-zero values). The\nlogic DF/TT is connexive, too, and supports Negation\nCommutation. A central difference, however, is that de Finetti’s\ntable fails to support MP.\n\nAnother system worthy of consideration is the trivalent logic of\n“conditional objects” investigated by Dubois and Prade\n(1994). This system is itself closely related to a three-valued\ntreatment of conditionals presented in Adams (1986). The system rests\non de Finetti’s original table, but only formulae from the flat\nfragment \\(L_1\\) are admitted. Validity in Dubois and Prade’s\napproach is defined as follows. Assume \\(\\Gamma\\) is a set of flat\nconditionals of the form \\(A_i>B_i\\). Then define \\(\\Gamma \\models\nA>B\\) iff either \\(A\\) classically entails \\(B\\)\nor for every trivalent valuation the value of the\nquasi-conjunction of some subset of conditionals in \\(\\Gamma\\) is less\nthan or equal to the value of \\(A>B\\) (for the usual ordering of\ntruth-values: \\(0<½<1\\)). Quasi-conjunction—a\nconnective proposed by Cooper (1968: 305) and in a different guise by\nAdams (1966: 306), also proposed by Belnap (1973:60), and earlier by\nSobociński 1952 in relation to a different trivalent conditional\n—differs from min conjunction in that the conjunction of\nclassical values is classical, and the conjunction of ½ with a\nclassical value is that classical value. Quite remarkably, this\nrelation of logical consequence can be axiomatized by the system\nP of preferential entailment of Kraus, Lehmann and\nMagidor, which is discussed in detail below. Thus, the associated\nnotion of consequence does not support Monotonicity, Transitivity, and\nContraposition of the conditional (see\n section 3.2).\n2.3 Open issues\n\nDespite its simplicity, the use of trivalence raises several issues.\nOne open problem is how to deal with counterfactual\nconditionals—the problem is not without options, but trivalence\nso far has been used mostly to deal with indicative conditionals. A\nrelated issue is how to make three-valued conditionals interact with\nmodalities and other operators more generally.\n\nAnother problem concerns the expressiveness of a finitely-valued\ntruth-functional account. McGee (1981) shows that the common\n“flat” \\(L_1\\)-fragment of the logics of conditionals of\nAdams, Stalnaker and Lewis, i.e., the system P,\ncannot be characterized in terms of the preservation of a designated\nset of truth-values in a finite-valued logic. Prima facie, this\nresults appears in tension with Adams’s as well as Dubois and\nPrade’s trivalent characterization of P. As\npointed out by M. Schulz (2009), however, the trivalent\ncharacterization proposed by Adams—or indeed Dubois and\nPrade—differs from the one entertained by McGee (it asks for\nmore than the preservation of a fixed set of designated values, and\nallows quantification over subsets of the\n premises).[1]\n As discussed by Schulz, whether a similar characterization can be\ngiven for the non-flat logics of Stalnaker and Lewis is an open\nquestion.\n3. Possible Worlds Models\n\nTrivalent accounts suppose that the truth value of a conditional\ndepends only on the truth values of its parts. However, this\nassumption does not account for a connection of the contents of the\nantecedent and the consequent, a point granted by Frege (1879)\nhimself. In this section we review accounts that preserve the idea\nthat conditionals are truth-evaluable, but assume that their truth\nvalue cannot be settled just by the truth values of the antecedent and\nthe consequent at the actual world. Instead, the antecedent has a\ncertain modal force, it makes its consequent in some sense necessary.\nPossible-worlds models give an explication of the necessity\ninvolved.\n3.1 Strict conditionals\n\nThe first step toward an intensional treatment of conditionals was\nmade with C. I. Lewis’s introduction of the strict conditional.\nAlthough Lewis’s treatment was axiomatic, its semantic content\ncan be made transparent using possible worlds semantics. On\nLewis’s approach, “If \\(A\\), then \\(C\\)” means that\nthe material conditional is not just true, but necessarily true:\n\n\\[\\tag{SI} (A >B ) \\equiv \\Box (A\\supset B).\\]\n\n\nFrom a semantic view point, reference is made here not just to the\nactual world, but also to other possible worlds, in fact to all\n“accessible” worlds. Thus, the meaning of this conditional\ncannot be explained by a simple truth table.\n\nIn modal logic, a Kripke frame is a pair \\(\\langle W,\nR\\rangle\\) where \\(W\\) is a non-empty set of possible worlds\n(possible states, possible situations or possible ways the world might\nbe) and \\(R\\) is a binary relation on \\(W\\). \\(R\\) is called the\naccessibility relation of the model, and intuitively \\(Rwv\\)\nmeans that world \\(v\\) is (in some sense) possible from the point of\nview of \\(w\\). A model is a triple \\(\\langle W, R, V\\rangle\\)\nsuch that \\(\\langle W, R\\rangle\\) is a frame and \\(V\\) is a valuation\nfunction assigning truth values to all propositional variables of the\nlanguage at all possible worlds in \\(W\\). We write \\(M, w \\Vdash A\\)\nfor “\\(A\\) is true at world \\(w\\) in model \\(M\\)” and let\n\\(\\lvert A\\rvert^M\\) denote the set \\(\\{w\\in W: M, w \\Vdash A\\}\\) of\npossible worlds at which \\(A\\) is true. Let \\(R(w) := \\{v\\in W:\nRwv\\}\\). The truth conditions for the Boolean connectives are the\nusual ones for propositional logic, extending \\(V\\) to complex\nsentences. Those for the strict conditional are as follows:\n\n\\[\\tag{SC } \\begin{align} M, w \\Vdash A >B & \\quad\\text{iff}\\quad \\text{for all } v \\text{ such that } Rwv,\\quad M, v \\Vdash A \\supset B\\\\ & \\quad\\text{iff}\\quad R(w) \\cap \\lvert A\\rvert^M \\subseteq \\lvert B\\rvert^M.\\\\ \\end{align} \\]\n\n\nValidity (relative to a class of frames) is defined as\ntruth-preservation at all worlds of all models (based on any frame in\nthe class). It is easy to see that the strict conditional invalidates\nthe paradoxes of the material conditional, relative to models built on\narbitrary Kripke frames. The strict conditional retains Modus Ponens\nand a number of classic properties, such as Monotonicity,\nTransitivity, and Contraposition (see below). Starting with Goodman\n(1955), however, such inferences have been regarded with suspicion,\nboth for indicative conditionals (see Adams 1965) and for\ncounterfactuals conditionals (see Stalnaker 1968, Lewis 1973). For\ninstance, in the case of Transitivity, we have the following\ncounterexamples:\n\n(1)\nIf Brown wins the election, Smith will retire to private life. If\nSmith dies before the election, Brown will win it. #Therefore, if\nSmith dies before the election, then he will retire to private life.\n(Adams 1965, p. 166)\n(2)\nIf J. Edgar Hoover were today a communist, then he would be a\ntraitor. If J. Edgar Hoover had been born a Russian, then he would\ntoday be a communist. #Therefore, if J. Edgar Hoover had been born a\nRussian, he would be a traitor. (Stalnaker 1968, p. 106)\n\n\nSuch examples inspired Adams to propose a probabilistic treatment of\nconditionals. They inspired Stalnaker, Lewis, Nute, and a number of\nothers to weaken the strict conditional analysis. But recently there\nhas been a revival of the strict conditional analysis, based on the\nidea that many phenomena can be accounted for pragmatically by\nconstruing the accessibility relation that determines which possible\nworlds are relevant as massively context-dependent (Daniels &\nFreeman 1980; von Fintel 2001; Gillies 2007; Starr 2014a, and\nStarr’s entry on counterfactuals).\n3.2 Variably strict conditionals\n\nThe basic idea behind “variably strict conditionals” (an\nexpression due to D. Lewis 1973) is that the standard of necessity\nrelevant to evaluate a conditional sentence depends on the antecedent.\nRoughly speaking, in order to evaluate a conditional \\(A>B\\), one\nhas to extend the reach of the accessibility relation to the\n“closest” or “most similar” worlds in which\nthe antecedent is true. In what follows we present three related ways\nof stating the truth conditions of the variably strict\nconditional.\n3.2.1 Main semantics\nRelative modalities\n\nThough not historically the first, arguably the simplest way of\nexpressing the idea of a strict conditional whose necessity varies\ndepending on the antecedent can be found in Chellas (1975) and\nSegerberg (1989), who describe a conditional \\(A>B\\) as a relative\nmodality, namely a sententially indexed modality \\(\\Box_{A}B\\), with\nthe corresponding accessibility relation \\(R_{\\lvert A\\rvert^{M}}\\)\nfor every sentence \\(A\\). A relative-modality frame or\nrm-frame can be defined as a pair \\(\\langle W, R\\rangle\\)\nwhere \\(R\\) is a ternary relation on \\(W\\times W\\times \\cP(W)\\). In\npractice we can write \\(R_Uvw\\) instead of \\(RvwU\\), and see \\(R\\) as\nassigning a binary relation over worlds relative to a proposition\n\\(U\\). An rm-model is a triple \\(M = \\langle W, R, V\\rangle\\)\nsuch that \\(\\langle W, R\\rangle\\) is an rm-frame and \\(V\\) a valuation\nfunction. Given an rm-model \\(M\\), the truth condition for the\nconditional is this: \n\n\\[\\tag*{(VSC)-rm } \\begin{align} \\ M, w \\Vdash A >B & \\quad\\text{iff}\\ \\text{for all } v \\text{ such that } R_{\\lvert A\\rvert^{M}} wv, \\ M, v \\Vdash B\\\\ & \\quad\\text{iff}\\ R_{\\lvert A\\rvert^{M}}(w) \\subseteq \\lvert B\\rvert^M.\\\\ \\end{align} \\]\n\n\nNote that \\(R\\) could be defined on \\(W\\times W\\times L_2\\), letting\n\\(R_A(w)\\) depend on the syntactic form of \\(A\\) (instead of the\nproposition \\(\\lvert A\\rvert^M\\) expressed by \\(A\\)). The main effect\nof this modification is to block the substitution of equivalent\nantecedents, a feature called for by several theorists on separate\ngrounds (see\n section 3.5).\nSelection functions\n\nAn equivalent definition is in terms of selection functions (Stalnaker\n1968; Nute 1980). An sf-frame is a pair \\(\\langle W,\nf\\rangle\\) where \\(W\\) is a non-empty set of possible worlds\nand \\(f: W \\times \\cP(W) \\to \\cP(W)\\) is a function taking a world and\na proposition (i.e., a set of worlds) and yielding a proposition.\n\\(f\\) is called the selection function of the model, and\nintuitively \\(v \\in f(w,U)\\), where \\(U\\subseteq W\\), means that world\n\\(v\\) is a world in \\(U\\) that is (in some sense) closest or\nmost similar to \\(w\\), as compared to all the other worlds in\n\\(U\\). The correspondence with the previous approach is\nstraightforward, if we let \\(f(w,\\lvert A\\rvert^M)\\) coincide with\n\\(R_{\\lvert A\\rvert^M}(w)\\). An sf-model is a triple \\(M =\n\\langle W, f, V\\rangle\\) such that \\(\\langle W, f\\rangle\\) is an\nsf-frame and \\(V\\) is a valuation function. The truth condition for\nthe variably strict conditional becomes: \n\n\\[\\tag*{(VSC)-sf} \\begin{align} \\ M, w \\Vdash A >B & \\quad\\text{iff}\\ \\text{for all } v \\in f(w,\\lvert A\\rvert^M), \\ M, v \\Vdash B\\\\ & \\quad\\text{iff}\\ f(w,\\lvert A\\rvert^M) \\subseteq \\lvert B\\rvert^M.\\\\ \\end{align} \\]\n\n\nAs with rm-frames, the definition of an sf-frame can be modified to\nlet \\(f\\) depend on \\(w\\) and \\(A\\), instead of \\(\\lvert\nA\\rvert^M\\).\nSimilarity orderings\n\nThere is a closely related alternative to this set-up which uses\ncomparative similarity orderings in place of selection functions (D.\nLewis 1973; Burgess 1981). Here, an o-frame is a pair\n\\(\\langle W, \\prec \\rangle\\) where \\(W\\) is a non-empty set of\npossible worlds and \\(\\prec\\) is a ternary relation on the\nset of worlds, assumed to be transitive and irreflexive relative to\nits first argument. The relation \\(u \\prec_w v\\) is supposed to mean\nthat world \\(u\\) is (in some sense) more similar or\ncloser to \\(w\\) than world \\(v\\). Let \\(R(w) := \\{y\\in W:\n\\exists z \\in W(y\\prec_wz)\\}\\). This corresponds to the set of\naccessible worlds from \\(w\\). An o-model is a triple\n\\(\\langle W, \\prec, V\\rangle\\) such that \\(\\langle W, \\prec\\rangle\\)\nis an o-frame, and \\(V\\) is a valuation function. We use the\nabbreviation \\(\\lvert A\\rvert^M_w := \\lvert A\\rvert^M \\cap R(w)\\), and\nlet \\(min_{\\prec_{w}}(U)\\) denote the \\(U\\)-worlds most similar to\n\\(w\\) (such that no \\(U\\)-world is strictly more similar to \\(w\\)). A\nsimple form of the truth-condition for the variably strict conditional\nreads as follows: \n\n\\[\\tag*{(VSC)-o-L } \\begin{align} \\ M, w \\Vdash A >B & \\quad\\text{iff}\\ \\text{for all } v \\in \\min_{\\prec_w} (\\lvert A\\rvert^M_w), \\ M, v \\Vdash B\\\\ & \\quad\\text{iff}\\ \\min_{\\prec_w} (\\lvert A\\rvert^M_w) \\subseteq \\lvert B\\rvert^M. \\end{align} \\]\n\n\nThese truth-conditions, however, make sense only if \\(\\lvert\nA\\rvert^M_w\\) possesses minimal elements under \\(\\prec_w\\), that is,\nonly if we can assume (L), in which we write \\(v \\preceq_w u\\) for \\(v\n\\prec_w u\\) or \\(v = u\\): \n\n\\[\\tag{L } \\forall w \\in W \\;\\forall u \\in \\lvert A\\rvert^M_w \\;\\exists v \\in \\lvert A\\rvert^M_w ((v\\preceq_w u) \\amp \\neg\\exists v' \\in \\lvert A\\rvert^M_w (v'\\prec_w v)).\\]\n\n\n(L) is a slight generalization of the Limit Assumption of\nLewis (1973, 1981). While most researchers are ready to endorse the\nLimit Assumption, Lewis rejects it. According to him, for a\ncounterfactual such as “If Fred was taller than 2 meters, he\nwould be in the university basketball team” there is no closest\nworld that would make the antecedent true. Ordering semantics can deal\nwith failures of (L) by stating more complex truth conditions.\n\n(VSC)-o\n\\(M, w \\Vdash A >B\\quad \\) iff for all \\(v \\in \\lvert\nA\\rvert^M_w\\) there is a \\(u\\in \\lvert A\\rvert^M_w\\) such that \\(u\n\\preceq_w v\\) and for all \\(u'\\in \\lvert A\\rvert^M_w\\) such that \\(u'\n\\preceq_w u,\\ M, u' \\Vdash B\\).\n\n\nThis intuitively means that the \\(A\\wedge \\neg B\\) worlds are more\nremote from \\(w\\) than the \\(A\\wedge B\\)-worlds.\nComparisons\n\nFirst of all, it is easy to see how all three semantics can invalidate\ninferences like\n (1)\n and\n (2),\n which assume Transitivity. In an o-model, for example, from\n\n\\[\\min_{\\prec_w} (\\lvert A\\rvert^M_w)\\subseteq \\lvert B\\rvert^M\\]\n\n\nand \n\n\\[\\min_{\\prec_w} (\\lvert B\\rvert^M_w)\\subseteq \\lvert C\\rvert^M,\\]\n\n\nit need not follow that \n\n\\[\\min_{\\prec_w} (\\lvert A\\rvert^M_w)\\subseteq \\lvert C\\rvert^M.\\]\n\n\nSee the three-world model in\n Fig. 1,\n where the arrows represent \\(\\prec_w\\) so that \\(x\\!\\leftarrow\\!y\\)\nmeans the same thing as \\(x\\prec_w y\\).\n\n\n\nFigure 1: Counterexample against Transitivity in an\no-model [An\n extended description of Figure 1\n is in the supplement.]\n\n\nSimilar counterexamples to Monotonicity and Contraposition are easy to\ncome by.\n\nThe correspondence between selection function models and relative\nmodality models is very direct. The correspondence between selection\nfunction models and ordering models is less obvious. How can we\nexplain it? If we interpret similarity relations as preference\nrelations, we can import the insights gained in rational choice theory\nto the analysis of conditionals (Sen 1970; Suzumura 1983; Aleskerov,\nBouyssou, & Monjardet 2007; applications to nonmonotonic reasoning\nare in Lindström 1994 and Rott 2001). If the Limit Assumption is\nsatisfied, then we can simply identify \\(f(w,U)\\) with\n\\(\\min_{\\prec_w} (U)\\), for all \\(U\\subseteq W\\). For the converse\ndirection, we can use the revealed preferences, defined by\n\n\\[u\\prec_w v \\ \\textrm{ iff for all } U \\subseteq W \\text{ such that } u,v \\in U, v\\notin f(w,U)\\]\n\n\nor, if \\(f\\) can take propositions with two elements, \n\n\\[u\\prec_w v \\tiff v\\notin f(w,\\{u,v\\}).\\]\n\n\nThese preferences “rationalize” the selections made by\n\\(f\\). This, however, works only under certain constraints. In this\nrespect sf-models are more general than o-models. They are also easier\nto work with, and giving up the Limit Assumption is generally viewed\nas inadequate from a linguistic point of view (see Stalnaker 1980;\nSchlenker 2004; S. Kaufmann 2017 for more on (L)).\n3.2.2 Frame correspondence properties\n\nFor each semantics, specific conditions can be imposed on frames in\norder to secure the validity of particular axioms or argument\nschemata. Their effects on the logic of conditionals have been studied\nin detail. For illustration we give the examples of two specific\naxioms and their correspondence properties in the three frameworks.\nIdentity requires that every \\(A\\)-closest world be indeed an\n\\(A\\)-world. Conditional excluded middle corresponds to a uniqueness\ncondition: there is at most one closest \\(A\\)-world.\n\n\n\n\n \n\\(A>A\\)\n\\((A>B) \\vee (A >\\neg B)\\) \n\nrm\n\\(R_Avw \\supset w\\in A\\)\n\\(wR_Aw_1 \\wedge wR_Aw_2 \\supset w_1=w_2\\) \n\nsf\n\\(f(w,A)\\subseteq A\\)\n\\(card(f(w,A))\\leq 1\\) \n\no\n\\(\\forall x\\,\\forall y\\,(\\exists z(x\\preceq_y z) \\supset\nx\\preceq_y x)\\)\n\\(\\forall y\\,\\forall y'\\,\\forall w\\,((y\\in \\lvert A\\rvert^M_w\n\\wedge \\forall z(z\\prec_{w}y \\supset z\\notin \\lvert\nA\\rvert^M_w))\\supset {}\\) \\(((y'\\in \\lvert A\\rvert^M_w \\wedge \\forall\nz(z\\prec_{w}y' \\supset z\\notin \\lvert A\\rvert^M_w))\\supset\ny=y'))\\)  \n\n\nTable 5: Some frame correspondence\nproperties\n\n\nWe refer to Unterhuber and Schurz (2014) for a systematic presentation\nof frame correspondence properties for rm-frames, to Nute (1980),\nGirard (2007), and Raidl (2021) on the correspondence properties of\nsf-frames, and to Friedman and Halpern (1994) and Herzig (1996) on the\ncorrespondence properties of o-frames.\n3.3 Logics for conditionals\n\nIn order to present some central logics of conditionals based on the\npossible-worlds framework, we adopt a Frege-Hilbert axiomatic\nperspective and introduce a list of axioms and rules of inference. Our\npresentation and choice of terminology relies on Nute (1980) as well\nas Herzig (1996), Unterhuber and Schurz (2014), and Crupi and Iacona\n(forthcoming-b).\n\nAs a first layer for all systems, we let PC\nconsist of all tautologies of the classical propositional\ncalculus.\nWe also assume the systems below to be closed under material Modus Ponens, but distinguish moreover the following inference rules (Left Logical Equivalence, Right Weakening, and Rule of Conditional K). Those mean that if the premises are theorems, then so is the conclusion. \\[\\tag*{LLE} \\frac{B \\equiv C}{(B >A) \\equiv(C >A)} \\] \\[\\tag*{RW} \\frac{B \\supset C}{(A >B) \\supset(A >C)} \\] \\[\\tag*{RCK} \\frac{(B_1 \\wedge \\ldots \\wedge B_n) \\supset C} {(A >B_1) \\wedge \\ldots (A >B_n) \\supset(A >C)\\quad (n\\geq 0)} \\]\nAxioms\n\n\n\n\nLT\n(Logical Truth)\n\n\\(A>\\top\\) \n\nID\n(Identity)\n\n\\(A>A\\) \n\nAND\n(And)\n\n\\(((A>B)\\wedge (A>C))\\supset(A>(B\\wedge C))\\) \n\nOR\n(Or)\n\n\\(((A>C)\\wedge (B>C))\\supset((A\\vee B)>C)\\) \n\nCCut\n(Cautious Transitivity)\n\n\\(((A>B)\\wedge ((A\\wedge B)>C))\\supset(A>C)\\) \n\nCMon\n(Cautious Monotonicity)\n\n\\(((A>B)\\wedge (A>C))\\supset((A\\wedge B)>C)\\) \n\nRec\n(Reciprocity)\n\n\\(((A>B)\\wedge (B>A)) \\supset((A>C) \\equiv(B>C))\\)\n\n\nSM\n(Stronger-than-Material)\n\n\\((B>C)\\supset(B\\supset C)\\) \n\nCS\n(Conjunctive Sufficiency)\n\n\\((B\\wedge C)\\supset(B>C)\\) \n\nRMon\n(Rational Monotonicity)\n\n\\(((A>B)\\wedge \\neg(A>\\neg C))\\supset((A\\wedge C)>B)\\)\n\n\nCEM\n(Conditional Excluded Middle)\n\n\\((A>B)\\vee (A>\\neg B)\\)  \n \n\n\n\n  \n\n\n\nRules and\n\naxioms\nSystems \n\nCk\nCK\nB\nSS\nNP\nV\nVW\nVC\nC2  \n\n\nLLE\n \n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nRW\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nRCK\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nLT\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nID\n \n \n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nAND\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nOR\n \n \n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nCCut\n \n \n✓\n✓\n✓\n✓\n✓\n✓\n✓ \n\nCMon\n \n \n✓\n✓\n \n✓\n✓\n✓\n✓ \n\nRec\n \n \n✓\n✓\n \n✓\n✓\n✓\n✓ \n\nRMon\n \n \n \n \n✓\n✓\n✓\n✓\n✓ \n\nSM\n \n \n \n✓\n \n \n✓\n✓\n✓ \n\nCS\n \n \n \n✓\n \n \n \n✓\n✓ \n\nCEM\n \n \n \n✓\n \n \n \n \n✓  \n\n\nTable 6: Salient logics of conditionals.\nCk and CK correspond to basic\nconditional logics; System B is due to Burgess;\nsystem SS to Pollock; system NP to\nDelgrande; systems V, VW and\nVC to D. Lewis; system C2 to\nStalnaker.\n\n\nWe highlight nine systems of conditional logic that have drawn\nparticular attention.\n\nSystem CK axiomatizes the truth-conditions laid out\nin (VSC)-rm. CK has been called the basic conditional\nlogic by Chellas (1980), as it is meant to be the counterpart to the\nbasic system K of modal logic. In particular it\nyields the same theorems as system K relative to a\nfixed modality \\(\\Box_{A}\\). Thus, it satisfies conditional analogues\nof the axiom K of standard modal logic (viz., the axiom CK: \\((A>B)\n\\supset((A > (B\\supset C)) \\supset(A > C))\\)) and of the rule of\nNecessitation (viz., the rule CNec: from \\(C\\) infer \\(A>C\\)). It\ncan be described as the smallest logic closed under LLE and RCK (the\nlatter entailing LT, RW and AND), and is also called a normal\nconditional logic because of that. The logic Ck\ncorresponds to its hyperintensional variant, in which LLE is\ndropped.\n\nSystem B, proposed by Burgess, is the smallest\nextension of CK containing ID, OR and CMon. System\nB axiomatizes the truth conditions stated under\n(VSC)-o assuming \\(\\preceq\\) is a preorder (reflexive and transitive).\nAnother specific interest of system B is that its\nflat fragment corresponds to the system P of\nnonmonotonic logic due to Kraus, Lehmann and Magidor (see\n section 3.4).\n System P is also sound and complete for Adams’\nprobabilistic semantics of conditionals (see\n section 5),\n and a three-valued characterization can be given for it too, as\nmentioned above, see Dubois and Prade (1994). In that sense, system\nP is quite central amongst logic of conditionals.\n\nParticularly noteworthy is the fact that none of these logics\nvalidates Monotonicity (also known as Strengthening the Antecedent),\nTransitivity or Contraposition for conditionals:\n\n\n\nMonotonicity\n\\((A>C)\\supset ((A\\wedge B) >C)\\) \n\nTransitivity\n\\((A>B) \\supset ((B>C) \\supset (A>C))\\) \n\nContraposition\n\\((A>C)\\supset (\\neg C>\\neg A)\\)  \n\n\nThese principles have in many contexts been considered as paradigmatic\ninvalidities of conditional logic.\n\nIf we add RMon to B we get the system\nV of David Lewis. John Pollock (1976) proposed the\nsystem SS obtained by adding SM and CS to\nB. Lewis’ “official” axiomatization\nof the logic of counterfactuals is the system VC that\nis obtained by adding SM and C to V. The extension of\nV with just SM is the system VW.\nFinally, system C2 with the incorporation of CEM into\nVC is Stalnaker’s logic of conditionals. As\n Table 6\n makes clear, principles like CS, CMon, RMon, and CEM in particular\nare controversial, they have all been subject to philosophical\ndiscussions.\n\nJames Delgrande (1987) proposed the system NP as a\ndifferent extension of CK. The main difference is\nthat B satisfies Cautious Monotonicity, whereas\nNP satisfies Rational Monotonicity. In\nDelgrande’s interpretation, an instance of Rational Monotonicity\nis the inference from the premises “ravens normally fly”\nand “it is not the case that normally ravens are not\nblack” to “black ravens normally fly”. Note that\nCautious Monotonicity predicts the inference from “ravens\nnormally fly” and “ravens normally are black” to\n“black ravens normally fly”. The existence of systems\nB and NP makes clear that strictly\nspeaking, RMon and CMon are logically independent. But it is fair to\nsay that RMon is essentially stronger than CMon, because in\nmost environments one can infer \\(\\neg(A>\\neg C)\\) from \\(A>C\\).\nIn the ordering semantics, RMon needs weak orders which satisfy\nModularity (for all worlds \\(t, u, v, w \\in W\\), if \\(t\\prec_w u\\),\nthen \\(t\\prec_w v\\) or \\(v\\prec_w u\\)), while CMon needs only\ntransitive relations. But RMon may be satisfied without CMon being\nsatisfied if one has a weak order over an infinite set without\nanything like the limit assumption and uses a selection function or a\nminimal models approach. This is the case in Delgrande\n (1987).[2]\n\nBeside the systems mentioned, other intermediate systems between\nCK and C2 have been studied, in\nparticular by proof theorists. Olivetti, Pozzato, and Schwind (2007)\nand Poggiolesi (2016) present sequent calculi for the systems\nCK, CK+ID, CK+SM\nand CK+SM+ID. Poggiolesi also investigates systems of\nnatural deduction for the same systems.\n3.4 Nonmonotonic logic and preferential models\n\nEarlier we mentioned that system P corresponds to the\nflat fragment of system B. Given the centrality of\nsystem P, here we say more about the way Kraus,\nLehmann and Magidor defined it as a system of nonmonotonic logic. KLM\ndo not aim at characterizing which formulae are logically valid, but\nat specifying closure conditions for rational sets of conditionals.\nThey read the conditional \\(A>C\\) (actually they use the notation\n\\(A\\pipsim C\\)), with \\(A\\) and \\(B\\) only from \\(L_0\\), as expressing\na default of the form “if \\(A\\) then normally \\(C\\)” or\n“\\(C\\) is a plausible consequence of \\(A\\)”. They start\nwith models right away, but their models are slightly different from\nthe ones we have seen so far. Importantly, KLM have no use for a truth\nvalue of a conditional at a single world, but only look at the\n“consequence relation” determined by a full model. What\nKLM call “states” are more like information states than\nlike possible worlds, what they call “worlds” are\nvaluations, i.e., assignments of truth values to the propositional\nvariables of the language. KLM’s preferential models are similar\nto the o-models discussed above, except there is only one binary\nrelation for the full model rather than one for each world in the\nmodel.\n\nA cumulative model \\(M\\) for a universe \\(W\\) is a triple\n\\(\\langle S, l, < \\rangle\\) where \\(S\\) is a set of states, \\(l: S\n\\rightarrow \\cP(W)\\) is a labeling function assigning to each state a\nnon-empty set of worlds from the universe \\(W\\), and \\(<\\) is a\nbinary relation on \\(S\\) satisfying the smoothness condition:\nfor all \\(A\\in L_0\\) and all \\(s\\) such that\n\\(s\\mathrel|\\mathrel{\\mkern-3mu}\\equiv A\\) either \\(s\\) is minimal in\n\\(\\hat{A} = \\{s \\in S: s\\mathrel|\\mathrel{\\mkern-3mu}\\equiv A\\}\\) or\nthere is an \\(s' < s\\) that is minimal in \\(\\hat{A}\\). Here\n\\(s\\mathrel|\\mathrel{\\mkern-3mu}\\equiv A\\) (read: \\(s\\) satisfies\n\\(A\\)) means that for every world \\(w\\) in \\(l(s)\\), \\(w \\Vdash\nA\\).\n\nThe smoothness condition is almost the same as condition (L) of\n section 3.2.1\n above. This notion of a model allows for a modification of the\nclassical definition of entailment in such a way that it becomes\ncompatible with the idea of defeasibility or nonmonotonicity:\n\nGiven a cumulative model \\(M = \\langle S, l, < \\rangle\\), the\nentailment relation \\(\\pipsim _M\\) defined by \\(M\\) is given by: \\(A\n\\pipsim _{M} B\\) iff for all states \\(s\\) minimal in \\(\\hat{A}\\),\n\\(s\\mathrel|\\mathrel{\\mkern-3mu}\\equiv B\\).\n\nThus every single cumulative model defines a preferential entaliment\nrelation—one with respect to which a sentence A\ntypically entails much more than just its classical logical\nconsequences.\n\nKraus, Lehmann, and Magidor (1990) focused on a particular class of\ncumulative models, the so-called preferential models. They require the\nbinary relation to be a strict partial order and the labeling function\nto assign just one world to each state. A preferential model\nfor a universe \\(W\\) is a triple \\(\\langle S, l, < \\rangle\\) where\n\\(S\\) is a set of states, \\(l: S \\rightarrow W\\) is a labeling\nfunction assigning to each state a single world from the universe\n\\(W\\), and \\(<\\) is a strict partial order on \\(S\\) (irreflexive,\ntransitive) satisfying the smoothness condition.\n\nLehmann and Magidor (1992) focused on a subfamily of preferential\nmodels, the so-called ranked models. A ranked model \\(R\\) is\na preferential model \\(\\langle S, l, < \\rangle\\) where the strict\npartial order \\(<\\) satisfies Modularity: for all \\(s, t, u \\in\nS\\), if \\(s<t\\), then \\(u<t\\) or \\(s<u\\).\n\nThese modes are called “ranked” because the property of\nModularity of the strict partial order < is equivalent to there\nbeing a totally ordered set \\(\\Omega\\) (the strict order on \\(\\Omega\\)\nwill be denoted by \\(\\bangle\\)) and a ranking function \\(r : S\n\\rightarrow \\Omega\\) such that \\(s < t\\) iff \\(r(s) \\bangle r(t)\\).\nIntuitively, a state of smaller rank is “more normal” than\na state of higher rank.\n\nThe main representation theorem of Kraus, Lehmann, and Magidor\nconcerns the system P in terms of preferential\nmodels. Below we repeat the rules of the system, except that here\naxioms come in argument form (the entailment symbol\n“\\(\\pipsim\\)” is not part of the object language), and\ninference rules in meta-argument form. The rules in the systems they\nconsider are not thought of as validity preserving. They are rather\ntaken to be closure conditions: any reasonable nonnomotonic inference\nrelation \\(\\pipsim \\) is such that when it includes the premises\n(sometimes, though, the premises are exclusion conditions,\nsee RMon, DRat and NRat below), then it includes the conclusion, too.\nKraus, Lehmann and Magidor’s representation results then state\nthat an inference relations \\(\\pipsim \\) is reasonable in this\nsyntactically specified sense just in case it can be defined by a\nmodel with certain properties. \n\n\\[\\tag*{ID\\(_{\\pipsim}\\)} A \\pipsim A \\] \\[\\tag*{LLE\\(_{\\pipsim}\\)} \\frac{\\models A \\equiv B \\qquad A \\pipsim C}{B \\pipsim C}\\] \\[\\tag*{RW\\(_{\\pipsim}\\)} \\frac{\\models A \\supset B \\qquad C \\pipsim A}{C \\pipsim B}\\] \\[\\tag*{CCut\\(_{\\pipsim}\\)} \\frac{A \\pipsim B \\qquad A \\wedge B \\pipsim C}{A \\pipsim C}\\] \\[\\tag*{CMon\\(_{\\pipsim}\\)} \\frac{A \\pipsim B \\qquad A \\pipsim C}{A \\wedge B \\pipsim C}\\] \\[\\tag*{AND\\(_{\\pipsim}\\)} \\frac{A \\pipsim B \\qquad A \\pipsim C}{A \\pipsim B \\wedge C}\\] \\[\\tag*{OR\\(_{\\pipsim}\\)} \\frac{A \\pipsim C \\qquad B \\pipsim C}{A \\vee B \\pipsim C}\\]\n\n\nIn Kraus, Lehmann, and Magidor (1990), rules ID\\(_{\\pipsim}\\),\nLLE\\(_{\\pipsim}\\), RW\\(_{\\pipsim}\\), CCut\\(_{\\pipsim}\\) and\nCMon\\(_{\\pipsim}\\) together define the system C of\ncumulative reasoning; AND\\(_{\\pipsim}\\) is a derived rule of\nC. If OR\\(_{\\pipsim}\\) is added, one gets system\nP of preferential reasoning; if one keeps\nAND\\(_{\\pipsim}\\), CCut\\(_{\\pipsim}\\) can be derived from the other\nrules of P.\n\nLehmann and Magidor (1992) prove that the system R of\nrational reasoning that is obtained by adding the following\nrule of Rational Monotonicity to the above set of rules is complete\nwith respect to ranked models. \n\n\\[\\tag*{RMon\\(_{\\pipsim}\\)} \\frac{A \\pipsim C \\qquad A \\npipsim \\neg B} {A \\wedge B \\pipsim C} \\]\n\n\nThis rule has an untypical form in that one of its premises is the\ndenial of a nonmonotonic implication; such rules are called\n“non-Horn”. If RMon\\(_{\\pipsim}\\) is added to\nP, then CM\\(_{\\pipsim}\\) can be replaced by the rule\nthat infers \\(A\\wedge B\\pipsim \\bot\\) from \\(A\\pipsim \\bot\\).\nArló-Costa and Shapiro (1992) proved that the system obtained\nby dropping CMon\\(_{\\pipsim}\\) from R is sound and\ncomplete with respect to “rough” ranked models in which\nthe ordering of the states is no longer subject to the smoothness\ncondition.\n\nOther important non-Horn rules in the literature are\n“Disjunctive Rationality” and “Negation\nRationality”: \n\n\\[\\tag*{DRat\\(_{\\pipsim}\\)} \\frac{A\\vee B \\pipsim C \\qquad A \\npipsim C} {B \\pipsim C} \\] \\[\\tag*{NRat\\(_{\\pipsim}\\)} \\frac{A \\pipsim C \\qquad A\\wedge B \\npipsim C}{A \\wedge \\neg B \\pipsim C} \\]\n\n\nNegation Rationality is weaker than Disjunctive Rationality, which in\nturn is weaker than Rational Monotonicity (see Lehmann & Magidor\n1992).\n3.5 Or-to-if, import-export, simplification of disjunctive antecedents\n\nTo conclude this section we point out three axioms that are valid for\nthe material conditional but which fail in the extensions of\nCK mentioned earlier, even in the strong logics\nC2 and VC of Stalnaker and\n Lewis.[3]\n These principles concern the interaction of conditionals with\ndisjunction and conjunction. They are:\n\n\n\nOI\n\\((A\\vee B) \\supset(\\neg A >B)\\)\n(Or to If) \n\nIE\n\\((A >(B >C)) \\equiv (A\\wedge B >C)\\)\n(Import-Export) \n\nSDA\n\\(((A \\vee B) >C) \\supset((A >C) \\wedge (B >C))\\)\n(Simplification of Disjunctive\n\nAntecedents)  \n\n\nThe principle OI is intuitively plausible, but as noted by C. I.\nLewis, assuming it leads to one of the paradoxes of the material\nconditional. For assuming that \\(A\\) entails \\(A\\vee B\\) (disjunction\nintroduction), and that the latter entails \\(\\neg A>B\\), by\ntransitivity it should follow that \\(A\\) entails \\(\\neg A>B\\).\nVarious options exist in the face of the paradox: to deny disjunction\nintroduction, to deny transitivity, or indeed to deny the validity of\nOI. Stalnaker (1975) for one defends the invalidity of OI, arguing\nthat OI is a pragmatically reasonable principle, but that the\ninference is context-sensitive.\n\nA similar collapse result concerns the principle IE. Gibbard (1980)\nshows that provided we have Modus Ponens, IE, LLE, and the principle\nof Supraclassicality—whereby \\(A>C\\) must hold if \\(A\\)\nclassically entails \\(C\\)—, then if the conditional entails the\nmaterial conditional, the reciprocal also holds. McGee (1989) modified\nStalnaker’s semantics in such a way that IE is valid, but MP is\nno longer valid. McGee’s rejection of MP is independently\nmotivated by natural language examples, in particular by the famous\nexample of the 1980 US elections, in which Reagan was ahead of the\npolls as a Republican, Carter second as a Democrat, and then Anderson\nas a distant third, but also a Republican. In this context, McGee\nargues that the following instance of MP is problematic:\n\n(3)\nA Republican will win. If a Republican wins, then if Reagan does\nnot win, Anderson will win. Therefore if Reagan does not win, Anderson\nwill win.\n\n\nHere the conclusion is problematic, because intuitively, if Reagan\ndoes not win, Carter appears as the more likely winner. Recently\nMandelkern (2020) has argued that IE should not be viewed as\nunrestrictedly valid. Mandelkern’s argument is in part based on\nlogical considerations and in part based on natural language examples.\nMandelkern points out that in a situation (adapted from McGee’s\ncounterexample) in which Reagan is ahead of Carter and Anderson, but\nthe relative situation of Anderson and Carter is not known, there is a\ncontrast between:\n\n(4)\nIf a Republican will win the election, and Anderson will win if\nReagan doesn’t win, then both Republicans are currently in a\nstronger position to win than Carter.\n(5)\nIf a Republican will win the election, then if Anderson will win\nif Reagan doesn’t, then both Republicans are currently in a\nstronger position to win than Carter.\n\n\nAccording to Mandelkern, the latter is less acceptable than the\nformer, because the second conditional antecedent “Anderson will\nwin if Reagan doesn’t” is contextually equivalent to\n“a Republican will win”. Mandelkern does find IE\nacceptable if the nested antecedent is restricted to a non-conditional\nsentence, however.\n\nAnother argument against IE, put forward in Adams (1975), concerns the\nequivalence of \\(A>(B >A)\\) and \\((A\\wedge B) >A\\). Whereas\nthe latter is a clear logical truth, the former is not. S. Kaufmann\n(2005) thus argues that the validity or invalidity of IE depends on\nspecific causal assumptions linking the consequent and the\nantecedents.\n\nThe case of SDA is also a bone of contention between theorists.\nChellas (1975) and Fine (1975) first pointed out that SDA seems\nintuitively valid, against Lewis’s and Stalnaker’s\ntheories. However, as pointed out by Ellis, Jackson, and Pargetter\n(1977), SDA and LLE together imply Monotonicity: from \\(A>C\\), it\nfollows that \\(((A\\wedge B) \\vee (A\\wedge \\neg B)) >C\\) by LLE, and\nthus by SDA, \\((A\\wedge B) >C\\).\n\nSince then, various theorists have proposed to abandon LLE (viz., Nute\n1980; Fine 2012; Ciardelli, Zhang, & Champollion 2018; Santorio\n2018) in order to endorse SDA without Monotonicity. Santorio (2018) in\nparticular provides a systematic comparison between pragmatic accounts\nbased on the idea that SDA might be based on a mechanism akin to\nscalar implictures (see Klinedinst 2009), and semantic accounts based\non the idea that logically equivalent antecedents can directly\ngenerate different alternatives. Santorio’s proposal, in a\nnutshell, is that \\(A>C\\) is true iff the alternative propositions\n\\(A_1,\\dots,A_n\\) that are ways for \\(A\\) to be true are such that the\nclosest worlds in them are \\(C\\)-worlds.\n\nImportantly, Santorio’s account drops LLE but nevertheless makes\nSDA only optionally valid. Lassiter (2018) recently suggested that\nsome classic counterexamples put forward against SDA by McKay and\nInwagen (1977), and originally judged inconclusive, can be\nstrengthened. For example, assuming Jim likes odd numbers but is\nindifferent between them, and actually bet on 5, one can accept:\n\n(6)\nIf Jim had bet on 1 or 3, there is an exactly 50% probability that\nhe would have bet on 3.\n\n\nSDA would predict:\n\n(7)\n\n\na.\nIf Jim had bet on 1 there is an exactly 50% probability that he\nwould have bet on 3.\nb.\nIf Jim had bet on 3 there is an exactly 50% probability that he\nwould have bet on 3.\n \n\n\nBoth conclusions are problematic under at least one reading. However,\nwe note that there is also a reading that would make them fine, if the\nevaluation of chance is prior to Jim’s betting.\n\nIn summary, we see that although OI, IE and SDA appear intuitively\nvalid, to accept them involves substantive trade-offs regarding other\nbasic principles.\n4. Premise Semantics\n4.1 Motivations\n\nSome early theories of conditionals said that a counterfactual is\ntrue, or assertable, if and only if its antecedent, together with\nfurther “co-tenable” premises, implies its consequent\n(Ramsey 1931 commenting on Mill; Chisholm 1946; Goodman 1947, 1955;\nMackie 1962). D. Lewis called such theories metalinguistic, the idea\nbeing that “if \\(A\\), \\(C\\)” is true provided there is an\nargument leading from the sentence \\(A\\) and additional premises to\n\\(C\\). On these accounts, the counterfactual is either a sentence\nmeaning that some suitable argument backing it exists, or—as in\nMackie’s version—it is itself an elliptical presentation\nof such an argument. The principal problem of any such theory is to\nspecify which “additional premises” are suitable to be\nconjoined to a given antecedent and which are not. Goodman (1955)\nviews the additional premises as general laws, supplemented by\nrelevant factual conditions, but the problem is to determine which\nfacts are to be assumed, and which facts are to be retracted. Rescher\n(1964) treats additional potential premises as ordered according to\ntheir position in a system of “modal categories”.\n\nAn account of the co-tenability idea based on possible worlds was\nfurther elaborated in the work of Veltman (1976) and Kratzer (1979),\nin what has come to be known as premise semantics (an\nexpression coined by D. Lewis 1981). Premise semantics can be\npresented either as providing acceptance conditions or as providing\ntruth conditions. It is compatible with an epistemic as well as with\nan ontic interpretation of conditionals. The former builds on the idea\nthat the premises represent essentially an agent’s basic\nbeliefs; this is the approach of Veltman (1976) who took inspiration\nfrom Ramsey. The latter takes the premises to represent the basic\nfacts of a possible world; this is the approach of Kratzer (1979,\n1981), who was inspired by Rescher and Lewis (D. Lewis 1981) and has\nfunctions assigning a premise set to every possible world. In any\ncase, the idea of premise semantics is this. Relative to a given set\n\\(\\Gamma\\) of premises (assigned to a possible world \\(w\\)), a\nconditional \\(A>B\\) is accepted (or true at \\(w\\)) if and only if\nfor every maximal subset of \\(\\Gamma'\\) of \\(\\Gamma\\) that is\nconsistent with \\(A\\) it holds that \\(\\Gamma' \\cup \\{A\\}\\) implies\n\\(B\\).\n4.2 Premise frames\n\nMore formally, a premise frame is a pair \\(\\langle W,\n\\Gamma\\rangle\\) where \\(W\\) is a non-empty set of possible worlds and\n\\(\\Gamma: W \\to \\cP(\\cP(W))\\) is as a function assigning to any world\n\\(w\\) a set of propositions—the premises for \\(w\\). One may, but\nneed not stipulate that \\(w\\) does, and all other worlds do not,\nbelong to every proposition in \\(\\Gamma(w)\\) (Centering). For the sake\nof simplicity, we assume that \\(W\\) is finite. A premise\nmodel is a triple \\(M = \\langle W, \\Gamma, V\\rangle\\) such that\n\\(\\langle W, \\Gamma\\rangle\\) is a premise frame and \\(V\\) a valuation\nfunction. For any proposition \\(F\\), let \\(\\Gamma(w)\\bot F\\) denote\nthe set of all subsets of \\(\\Gamma(w)\\) that are consistent with \\(F\\)\nbut have no proper supersets in \\(\\Gamma(w)\\) that are also consistent\nwith \\(F\\). That is, \\(\\Gamma(w)\\bot F\\) is the set of subsets of\n\\(\\Gamma(w)\\) that are maximally consistent with \\(F\\). The truth\nconditions for conditionals are: \n\n\\[\\tag{PS} M, w \\Vdash A >C \\text{ iff for each } X \\in \\Gamma(w)\\bot\\lvert A\\rvert^M, \\\\ \\bigcap (X\\cup \\lvert A\\rvert^M) \\subseteq \\lvert C\\rvert^M. \\]\n\n\nThis means that a (counterfactual) conditional is true at a world\n\\(w\\) if each set of basic beliefs or facts associated with this world\nthat is maximally consistent with \\(A\\), taken together with \\(A\\),\nimplies \\(C\\).\n\nKratzer shows how this definition gives the flexibility to either\n“lump” some facts together, or to keep facts separate from\neach other relative to a conditional antecedent. One of her\nillustrative examples is the\n following.[4]\n Angelika and Regina must pass a bridge one after the other. Angelika\ntakes one minute to pass the bridge, and Regina is waiting one minute\nbefore passing. Assuming Angelika had passed the bridge in 40 seconds,\nwould Regina still be waiting for one minute? Let \\(B\\) represent\n“Angelika passes in one minute”, \\(C\\) “Regina waits\none minute” and \\(A\\) represent “Angelika passes in 40\nseconds”, with the proviso that \\(A\\) and \\(B\\) are\ninconsistent. The issue is whether the conditional \\(A>C\\),\n“if Angelika had passed in 40 seconds, Regina would have waited\none minute”, is true or false. One option is to let\n \\(\\Gamma(w)=\\{B,C\\}\\).[5]\n \\(\\Gamma(w)\\cup \\{A\\}\\) is inconsistent, but contains as maximal\n\\(A\\)-consistent set only \\(\\{A,C\\}\\) and the intersection of this set\nentails \\(C\\). This predicts that Regina would have waited one minute\nindeed under the assumption that Angelika had passed faster. Another\noption is to let \\(\\Gamma(w)=\\{B\\cap C\\}\\). This time, \\(\\Gamma(w)\\cup\n\\{A\\}\\) contains \\(\\{A\\}\\) as sole maximal \\(A\\)-consistent set, and\nthis set fails to entail \\(C\\). Although the two premise sets have the\nsame intersection, the lumping of premises in the second set leads one\nto retract more facts when making the counterfactual assumption. This\nflexibility, as emphasized by Kratzer, accounts for the\ncontext-sensitivity of conditionals.\n\nIt is easy to see how premise semantics invalidates Transitivity. For\nexample, if \n\n\\[\\Gamma(w) = \\{A\\supset B,\\, A\\supset\\neg C,\\, \\neg A\\wedge(B\\supset C)\\},\\]\n\n\nthen we get that both \\(A>B\\) and \\(B>C\\) are true, but\n\\(A>C\\) is false at \\(w\\) (in fact, \\(A>\\neg C\\) is true; see\n Fig. 2).\n There are similar counterexamples to Monotonicity and\nContraposition.\n\n\n\nFigure 2: Counterexample against\nTransitivity in a premise model [An\n extended description of figure 2\n is in the supplement.]\n\n4.3 Correspondence with ordering semantics\n\nDavid Lewis (1981) proved that the truth conditions of premise\nsemantics and ordering semantics fundamentally correspond to each\nother. One can start with a premise model and define a strict partial\nordering for an o-model that gives the same results: define \\(u\n\\prec_w v\\) iff the set of all premises in \\(\\Gamma(w)\\) true at world\n\\(u\\) is a proper superset of the set of premises true at world \\(v\\).\nAnd conversely, one can start with an o-model based on a strict\npartial ordering and define a premise model that gives the same\nresults: define \\(\\Gamma(w)\\) as the set of all propositions of the\nform \n\n\\[X_v := \\{u\\in W: u\\prec_w v \\text{ or } u=v\\},\\]\n\n\nfor every \\(v\\in W\\).\n\nLewis in his paper discusses several refinements of the\ncorrespondence, depending on which conditions are imposed on ordering\nframes, and further results can be found in Chemla (2011). From a\nphilosophical and foundational perspective, the correspondence may be\ntaken to suggest that the choice between an ordering-first approach\nand a premise-first approach doesn’t matter. Arguably, however,\na premise semantics may be judged more explanatory than one in which\nthe ordering comes first, for two reasons. First of all, from a\ncognitive perspective, it may be argued that premise semantics is\ncloser to implementing the Ramsey test idea, since an ordering\nsemantics only implicitly refers to the idea of making adjustments to\none’s belief set. Secondly, in an o-semantics the question is\nindeed moot what determines similarity between worlds. Of course,\nwhich facts to admit or not in premise semantics is also problematic,\nbut using propositions as an ordering source makes clearer that\nsimilarity between worlds is a relative rather than an absolute\nmatter. In recent years, several authors have proposed to further\nclarify the problem of premise selection in counterfactuals by looking\nat causal models of reasoning (K. Schulz 2007; Briggs 2012; S.\nKaufmann 2013; Santorio 2019).\n\nBased on the correspondence between ordering semantics and premise\nsemantics, Kratzer (1979) mentions that Burgess’s system\nB is sound and complete for the latter. Veltman\n(1985: 108–132) proved that flat conditionals interpreted by\npremise semantics can be characterized by the axioms of system\nP. Results obtained in the 1990s show that such\nconditionals have an additional special property that cannot, however,\nbe expressed as an axiom of conditional\n logic:[6]\n\n\\((*)\\)\nIf \\((A\\vee B) >C\\) is accepted (or true at \\(w\\)), then there\nare \\(D\\) and \\(E\\) such that \\(D\\wedge E\\) entails \\(C\\), and \\(A\n>D\\) and \\(B >E\\) are both accepted (or true at \\(w\\)).\n\n\nAmong the recent modifications of premise semantics with causal\nmodels, Santorio’s (2019) filtering semantics ends up giving up\nOR.\n5. Probabilistic Logics\n\nThe idea that the right semantics for conditionals may be\nprobabilistic is appealing for at least three reasons. First of all,\nas pointed out by Adams (1965), it is unclear whether it makes sense\nto declare either true or false conditionals with false antecedents.\nAdams thus prefers to think of conditionals as having assertability\nconditions, rather than truth conditions, and justified assertability\nis naturally handled in terms of probability. Adams’s scepticism\nabout truth conditions for conditionals is shared by several authors,\nin particular Gibbard (1980) and Edgington (1995), and it was further\nfueled by Lewis’s (1976) triviality results. Secondly, many\nconditional sentences appear to express only a relation of probable\ninference between antecedent and consequent. Thus, whereas “if\n\\(a=b\\), then \\(a+1=b+1\\)” expresses a purely deductive\nrelation, “if you boil this egg, it will become hard”\nexpresses an inductive relation, and “if the light does not turn\non, then the lamp must be broken” expresses an abductive\nrelation (Douven & Verbrugge 2010; Krzyżanowska, Wenmackers,\n& Douven 2013; Douven 2016). But in the same way in which\ninductive and abductive inferences express that a conclusion may be\ninferred from given premises with only a reasonable probability,\nputting these inferences into a conditional appears to demand the\nassignment of a degree of probability to the corresponding sentences.\nThirdly, as stressed by Stalnaker (1970),\n\n\n[a]lthough the interpretation of probability is controversial, the\nabstract calculus is a relatively well defined and well established\nmathematical theory.\n\n\nIndeed, based on its mathematical simplicity, the theory offers a\nuniversal framework in the psychology of reasoning, where conditionals\noccupy central stage (Over, Hadjichristidis, Evans, Handley, &\nSloman 2007). We open this section with Adams’s logic for\nconditionals. We then explain Lewis’s triviality results and the\nproblem they raise for the assignment of probabilities to compounds of\nconditionals.\n5.1 Adams’s logic\n\nCentral to probabilistic treatments of conditionals is the notion of\nconditional probability. Given a Boolean formula \\(A\\) of \\(L_0\\), and\na set \\(W\\) of possible worlds over which they are interpreted, we let\n\\(\\Pr(A)\\) denote \\(\\Pr(\\lvert A\\rvert)\\), namely the probability\nassigned to the worlds in which \\(A\\) is true. For \\(A\\) and \\(C\\) two\nBoolean formulae, the conditional probability\n\\(\\Pr(C\\mkern2mu|\\mkern2muA)\\) is definable by the Ratio Formula:\n\n(Ratio Formula)\n\\(\\Pr(C\\mkern2mu|\\mkern2muA)=\\displaystyle\\frac{\\Pr(A\\wedge\nC)}{\\Pr(A)}\\), provided \\(\\Pr(A)>0\\).\n\n\nNow consider the problem of determining the probability that if a fair\ndie lands even, it will land on six. The probability of the material\nconditional “either it is not even, or it is a six” is\n\n\\[\\Pr(1\\vee 3\\vee 5\\vee 6)=\\nicefrac{2}{3}.\\]\n\n\nThis clearly exceeds the probability sought, which is instead captured\nin terms of the conditional probability of getting a six assuming it\nis an even number, \n\n\\[\\Pr(6 \\mid 2\\vee 4 \\vee 6)=\\nicefrac{1}{3}.\\]\n\n\nMore generally, the probability \\(\\Pr(A\\supset C)\\) of any material\nconditional is never less than the conditional probability\n\\(\\Pr(C\\mkern2mu|\\mkern2muA)\\), a point apparently first stressed by\nReichenbach (1949, p. 437).\n\nAdams’s central assumption is that for every conditional\nsentence \\(A>C\\) in which \\(A\\) and \\(C\\) are Boolean sentences,\nand for every probability function \\(\\Pr\\), the probability of the\nconditional equals the corresponding conditional probability:\n\n(Adams’s Thesis) For every Boolean\nsentences \\(A\\), \\(C\\), and every probability function \\(\\Pr\\),\n\\(\\Pr(A>C)=\\Pr(C\\mkern2mu|\\mkern2muA)\\), provided\n\\(\\Pr(A)>0\\).\n\n\nAdams’s Thesis has two sides. From the inner standpoint of\nAdams’ logic of conditionals, it may be viewed as a\ndefinition: the conditional probability defines the degree of\nprobability assigned to a simple conditional. From the outer\nstandpoint of ordinary English, Adams’s Thesis makes an\nempirical claim: namely, that the assertability of a simple\nconditional is a function of the conditional probability of the\nconsequent given the antecedent.\n\nStipulating that \\(\\Pr(A>C)=1\\) when \\(\\Pr(A)=0\\), Adams\ninvestigates several notions of validity for the language \\(L_1\\) of\nflat conditionals. His original definition is the following:\n\n(Probabilistic Validity) An inference is\nprobabilistically valid if and only if, for any positive\n\\(\\varepsilon\\), there exists a positive \\(\\delta\\) such that under\nany probability assignment under which each of the premises has a\nprobability greater than \\(1 - \\delta\\), the conclusion will have a\nprobability of at least \\(1 - \\varepsilon\\).\n\n\nOne way of understanding this definition is by contraposing it: an\nargument is invalid when an arbitrarily high probability can be\nassigned to the premises, but such that the conclusion falls short of\na high probability.\n\nAdams contrasts this definition with an alternative criterion for\nvalidity that is perhaps more intuitive:\n\n(Strict Validity) An inference is strictly\nvalid if and only if its conclusion has probability 1 under any\nprobability assignment under which its premises each have probability\n1.\n\n\nEvery probabilistically valid inference is strictly valid, but not\nvice versa. Strict validity coincides with classical validity. In\nlater work, Adams uses an alternative definition of probabilistic\nvalidity, based on the notion of uncertainty. Given a probability\nfunction \\(\\Pr\\), the uncertainty U\\((A)\\) of a sentence \\(A\\) is\ndefined as \\(1-\\Pr(A)\\):\n\n(p-Validity) An inference is p-valid if\nand only if for every probability assignment, the uncertainty of the\nconclusion is no greater than the sum of the uncertainty of the\npremises.\n\n\nProbabilistic validity and \\(p\\)-validity can be shown to coincide\n(Adams 1975: Thm. 3.1). For Boolean formulae, moreover, Adams shows\nthat the three definitions of validity coincide with classical\nvalidity. For conditional sentences, however, the resulting logic is\nweaker, and corresponds in fact to system P.\n\nAs in the semantics considered in\n sections 3\n and 4, Monotonicity, Transitivity, and Contraposition fail\nin Adams’ semantics. Consider Transitivity: it is easy to\nconstruct models in which \\(\\Pr(B\\mkern2mu|\\mkern2muA)=1\\),\n\\(\\Pr(C\\mkern2mu|\\mkern2muB)>1-\\delta\\) for positive, but\narbitrarily small \\(\\delta\\), and yet \\(\\Pr(C\\mkern2mu|\\mkern2muA)=0\\)\n(see\n Fig. 3).\n\n\n\nFigure 3: Counterexample against\nTransitivity in an Adams model [An\n extended description of Figure 3\n is in the supplement.]\n\n\nThis yields a counterexample according to either definition of\nprobabilistic validity. Similar examples can be constructed for\nMonotonicity, Contraposition, and the paradoxes of the material\nconditional.\n5.2 Lewis’s triviality theorem\n\nViewed as logics that tell us which conditionals are consequences of a\ngiven set of conditionals, Adams’s logic coincides, over their\ncommon language, with Stalnaker’s and Lewis’s logics. That\nis, for every argument with a finite set of premises \\(\\Gamma\\) and\nconclusion \\(A\\) of \\(L_1\\), \\(A\\) is a \\(p\\)-consequence of\n\\(\\Gamma\\) iff \\(A\\) is a consequence of \\(\\Gamma\\) according to\nStalnaker’s semantics (see Gibbard 1980 for a\n proof).[7]\n However, the main limit of Adams’s logic is that it does not\naccount for embeddings of conditionals (negated conditionals,\ndisjunctions of conditionals, right-nested and left-nested\nconditionals). Nevertheless, the coincidence of the logics generated\nby possible worlds and probabilistic semantics suggests that\nAdams’ Thesis could be extended to the language \\(L_2\\) of\narbitrarily complex conditionals. This hypothesis is known as\nStalnaker’s Hypothesis, who formulates it in his 1970\n article.[8]\n\n(Stalnaker’s Hypothesis) For every\nprobability function \\(\\Pr\\) and for every conditional \\(A>C\\),\npossibly complex: \\(\\Pr(A>C)=\\Pr(C\\mkern2mu|\\mkern2muA)\\), provided\nthat \\(\\Pr(A)>0\\).\n\n\nThe empirical adequacy of Stalnaker’s Hypothesis depends on the\ntreatment of nested conditionals. However, Lewis (1976) shows that\nunder rather uncontroversial assumptions on the probability of nested\nconditionals, the thesis leads to triviality. Lewis assumes the\nfollowing Factorization Hypothesis (Fitelson 2015):\n\n(Factorization Hypothesis) For every probability\nfunction \\(\\Pr\\) and for all sentences \\(A\\) and \\(B\\) such that\n\\(\\Pr(A\\wedge B)>0\\):\n\\[\\Pr(B >C\\mid A)=\\Pr(C\\mid A\\wedge B).\\]\n\n\nGiven Stalnaker’s Hypothesis, the Factorization Hypothesis is\nequivalent to the Law of Import-Export, namely \\(\\Pr(A > (B >\nC))=\\Pr((A\\wedge B) > C).\\)\n\nFrom Factorization, Lewis derives the following result, which\nbasically expresses that the probability of the conditional collapses\nto the unconditional probability of its consequent:\n\nTriviality Theorem (Lewis) If \\(A\\) is\nprobabilistically compatible with both \\(C\\) and \\(\\neg C\\), that is,\nif \\(\\Pr(A\\wedge C)>0\\) and \\(\\Pr(A\\wedge \\neg C)>0\\), then\n\\(\\Pr(A>C)=\\Pr(C)\\).\n\n\nThe proof goes as follows: \n\n\\[\\begin{align} \n\\Pr(A> C)&=\\Pr(A>C\\mid C)\\Pr(C) + \\Pr(A>C\\mid \\neg C)\\Pr(\\neg C) \\\\\n  & \\hspace{4cm} {\\scriptsize\\text{(Expansion)}}\\\\ \n\\Pr(A>C\\mid C)&=\\Pr(C\\mid A\\wedge C) = 1 \\\\\n  & \\hspace{4cm} {\\scriptsize\\text{(by Factorization)}}\\\\ \n\\Pr(A>C\\mid \\neg C)&=\\Pr(C\\mid A\\wedge \\neg C) = 0 \\\\\n  & \\hspace{4cm} {\\scriptsize\\text{(by Factorization)}}\\\\ \n\\Pr(A>C)&=1\\cdot \\Pr(C)+0\\cdot \\Pr(\\neg C) = \\Pr(C) \n\\end{align}\\]\n\n\nLewis himself states further variants, and several generalizations\nhave been proposed since (Hájek & Hall 1994; Bradley 2000;\nMilne 2003; Fitelson 2015). Bradley (2000) in particular shows that\nthe following Preservation Condition inspired by Belief Revision\ntheory also leads to triviality.\n\nPreservation Condition (Bradley): For every\nprobability function \\(\\Pr\\) and all sentences \\(A\\) and \\(C\\), if\n\\(\\Pr(A)>0\\) and \\(\\Pr(C)=0\\), then \\(\\Pr(A>C)=0\\).\n\n\nThe condition is weaker than Stalnaker’s Thesis, and therefore\nit extends triviality to an even wider class of conditionals.\n5.3 Cardinality and imaging\n\nLewis’s triviality results expose a mismatch between\n\\(\\Pr(C\\mkern2mu|\\mkern2muA)\\) and \\(\\Pr(A>C)\\). To clarify the\nphenomenon, we ask what each quantity represents in light of\nLewis’s result, already for simple conditionals.\n5.3.1 Cardinality\n\nLet us start with \\(\\Pr(C\\mkern2mu|\\mkern2muA)\\). Even with a fixed\nprobability assignment over a finite set of worlds, the conditional\nprobability may not correspond to the probability of any set of\nworlds. Let \\(W=\\{a,b,c\\}\\) and let \n\n\\[\\Pr(a)=\\Pr(b)=\\Pr(c)=⅓.\\]\n\n\nClearly, \n\n\\[\\Pr(a\\mid a\\vee b)=½.\\]\n\n\nHowever, in the Boolean algebra generated from \\(W\\), no\npossible-worlds proposition gets a probability of ½ under\n\\(\\Pr\\). Hájek (1989) in fact showed that there are more\ndistinct conditional probability values than distinct unconditional\nprobability values, for any finite set of possible worlds \\(W\\) that\nhas at least three worlds with non-zero probability. As pointed out in\nÉgré and Cozic (2011), this result offers a structural\nanalogy with undefinability results in generalized quantifier theory.\n“Most \\(A\\)s are \\(C\\)s” is not definable by applying the\nunrestricted “most” to first-order definable propositions.\nSimilarly here, we may view the result as showing that in a sentence\nlike “there is a probability of ½ that if \\(A\\) then\n\\(C\\)”, the embedded conditional does not express any\nproposition.\n\nThis result, however, is compatible with the idea that if-clauses\nfundamentally act as restrictors of overt or covert operators (see\nLewis 1975; Kratzer 2012; and\n section 8.1\n below). Égré and Cozic (2011) use the result to\nvindicate that view, though Charlow (2016) argues that the restrictor\nview is not in itself immune to triviality. Another take on it\nconcerns three-valued approaches. In the three-valued case, the\nassertability of a proposition is naturally viewed as the probability\nof that proposition being true given it has a determinate truth value\n(McDermott 1996). Assuming De Finetti’s scheme for the\nconditional, the assertability of \\(A>C\\) is then equal to the\nprobability that \\(A\\wedge C\\) is true, given that \\(A\\) is true, and\nso to the conditional probability. This derives Adams’ Thesis\nfor simple conditionals. That fact notwithstanding, note that with\n\\(a, b,c\\) as atoms and \\(\\Pr\\) as equiprobable on them, again there\nis no three-valued proposition whose probability is ½ for the\nconditional \\(a\\vee b > a\\), if we define a possible world by an\nassignment of one of the three values to atomic propositions (and\nhandle disjunction Strong Kleene style). Rather, if three-valued\nconditionals do express propositions, those propositions then need to\nbe viewed as relations between those worlds where the sentence is true\nand those where it is defined, so again as more complex objects than\nset of worlds (cf. Dubois & Prade 1994 who represent them as\npairs).\n5.3.2 Imaging\n\nConsider now \\(\\Pr(A>C)\\). Assume Stalnaker’s semantics for\n\\(A>C\\); what does the probability of that conditional correspond\nto, if not the conditional probability? D. Lewis (1976) identifies a\nrevision rule he calls imaging. Given \\(\\Pr\\), he defines\n\\(\\Pr\\mkern.1mu'_A\\) to be the imaging under the antecedent, where\n\\(\\Pr\\mkern.1mu'_A(w)=0\\) if \\(w\\) is not an \\(A\\)-world; and if \\(w\\)\nis an \\(A\\)-world, then \\(\\Pr\\mkern.1mu'_A(w)\\) equals \\(\\Pr(w)\\)\naugmented by the sum of the non-\\(A\\) worlds to which \\(w\\) comes\nclosest according to Stalnaker’s selection function. Lewis shows\nthat the probability of Stalnaker’s conditional is the\nprobability of the consequent under imaging by the antecedent. Whereas\nconditioning upon \\(A\\) kills off the non-\\(A\\) worlds and spreads\ntheir mass uniformly over the \\(A\\)-worlds, imaging upon \\(A\\) is a\ndifferent operation, which shifts the weight of non-\\(A\\) worlds\nnon-uniformly to the \\(A\\)-worlds depending on the selection function\n(see\n Fig. 4).\n\n\n\n\n(a) Conditionalization on \\(A\\) results in posterior probabilities\n\\(\\Pr'(u)=\\frac{p}{p+q}\\), \\(\\Pr'(v)=\\frac{q}{p+q}\\) and\n\\(\\Pr'(w)=0\\).\n\n\n\n\n(b) Imaging on \\(A\\) results in posterior probabilities\n\\(\\Pr'(u)=p+r\\), \\(\\Pr'(v)=q\\) and \\(\\Pr'(w)=0\\).\n\n\nFigure 4: Example with \\(W=\\{u,v,w\\}\\)\nand prior probabilities \\(\\Pr(u)=p\\), \\(\\Pr(v)=q\\) and \\(\\Pr(w)=r\\).\nIn the figure a red dashed arrow from \\(x\\) to \\(y\\) represents that\n\\(y\\) is the closest \\(A\\)-world to \\(x\\) [An\n extended description of Figure 4\n is in the supplement.]\n\n\nAn example from Edgington (2020) can help to figure out the\ndifference. Assume a stack of 100 straws, out of which 90 are 10 cm\nlong, 1 is 11 cm long, and 9 are 20 cm long. Consider the conditional\n“if the straw is longer than 10 cm, then it is shorter than 15\ncm”. Assume similarity between worlds is set by the closeness in\nlengths between straws. The probability of the set of worlds in which\nStalnaker’s conditional is true is \\(\\nicefrac{91}{100}\\), since\nthe 10-cm-straw worlds and the 11-cm-straw world are such that the\nclosest world in which the straw is longer than 10 cm is indeed a\nworld where it is less than 15 cm. But the conditional probability for\nthe conditional is \\(\\nicefrac{1}{10}\\), since only one of the straws\nthat are 11 cm or 20 cm long is less than 15 cm.\n\nThe upshot of these considerations is that starting from\nStalnaker’s conditional, we can see that its probability is not\nthe conditional probability, but the imaging probability (for more on\nimaging, we refer to Günther 2018). Conversely, starting from the\nconditional probability of \\(C\\) given \\(A\\), we have seen that it is\nnot in general equal to the probability of any possible world\nproposition. Importantly, Adams’s Thesis remains coherent for\nsimple conditionals qua definition, because it stipulates\nthat the probability of a conditional sentence is a certain\nconditional probability. However, as an empirical thesis,\nStalnaker’s Hypothesis states a substantive identity between\nquantities defined separately, and we now see better why it should\nfail. Whether Adams’ Thesis holds as a matter of empirical fact\nand even for simple conditionals is still debated. Recent findings, to\nwhich we return in\n section 7,\n suggest that relevance considerations also come into play (Douven\n2016; Skovgaard-Olsen, Singmann, & Klauer 2016).\n5.4 Probabilities for compound conditionals\n\nStalnaker’s Thesis is consistent for simple conditionals, but\nfails for conditionals of arbitrary complexity. A challenge is to\nextend Stalnaker’s Thesis to more or less extended classes of\ncompound conditionals. Several proposals have been made toward that\ngoal. The associated literature is quite technical, however, and we\ngive only a few landmarks here. Important is that all the resulting\nsystems mentioned here conservatively extend Adams’s basic\nlogic, namely system P (i.e., they preserve the same\naxioms for simple conditionals, though not necessarily for compound\nconditionals).\n\nVan Fraassen (1976) extends Stalnaker’s Thesis to right-nested\nconditionals of the form \\(A> (B>C)\\) in which \\(A, B,C\\) are\nBoolean, and to left-nested conditionals \\((A>B)>C\\) with the\nsame restriction, and he can also deal with specific conjunctions and\ndisjunctions of conditionals. Van Fraassen’s proposal involves a\nproduct space construction, relying on so-called Stalnaker-Bernoulli\nmodels, allowing him to assign probabilities to infinite sequences of\nworlds based on standard Stalnaker models. The construction is used in\nStalnaker and Jeffrey (1994) and extended in S. Kaufmann (2009). One\nnoteworthy aspect of the construction is that the probability of\nright-nested conditionals of the form \\(A>(B>C)\\) is not in all\ncases identical to the probability of \\((A\\wedge B) > C\\). McGee\n(1989) on the other hand proposes a distinct construction that does\nnot permit left-nested conditionals, but which is intended to secure\nthe law of import-export for right-nested conditionals (famously, by\ngiving up Modus Ponens for nested conditionals). Both approaches have\nsome probabilistic principles in common, however, for instance\n\n\\[\\Pr(A\\wedge (A>B))=\\Pr(A\\wedge B)\\]\n\n\nholds in both theories. For both approaches, moreover, the associated\nlogics are semantically interpretable starting from Stalnaker’s\npossible world semantics. Bradley (2012) builds on the\nJeffrey-Stalnaker and McGee approaches to show that for simple\nconditionals Adams Thesis can be derived by assigning probabilities to\npairs of worlds, instead of just worlds. The probability of a pair\n\\((w_0,w_1)\\) represents the probability that \\(w_0\\) is the actual\nworld, and that \\(w_1\\) is its selected alternative given the\nantecedent under discussion (note that one needs such probabilities\nfor all potential antecedents). A generalization of this property to\nnested conditionals is outlined, with philosophical emphasis on the\nidea that the probability of a conditional does not depend on a single\nworld, but also on the nonfactual relations of counterfactual\ndependence between worlds.\n\nA related approach to iterated conditionals is based on the so-called\ncoherence approach to probability, coming from de Finetti’s\nbetting view of probability (see Coletti & Scozzafava 1999; Gilio\n2002; Gilio & Sanfilippo 2014; and Pfeifer 2014 for an\nintroduction). The idea is that probability degrees can be attached to\nconditional events so long as they do not violate certain coherence\nconstraints on those bets (no sure losses or “Dutch\nbooks”). In this framework the probability of an event is\ndefined in terms of the technical notion of prevision. The prevision\n\\(x\\) attached to \\(A>C\\) corresponds to the fact that\n\n\nfor every real number \\(s\\), you are willing to pay (resp., to\nreceive) an amount \\(sx\\) and to receive (resp., to pay) \\(s\\), or\n\\(0\\), or \\(sx\\), according to whether \\(A\\wedge C\\) is true, or\n\\(A\\wedge\\neg C\\) is true, or \\(\\neg A\\) is true (bet called off),\nrespectively. (Sanfilippo, Gilio, Over, & Pfeifer (2020 notation\nadapted))\n\n\nDepending on independence assumptions concerning basic propositions,\nprevisions can be defined not only for conjunctions of conditionals,\nbut also for various nested conditionals. A recent overview of results\nin that domain appears in Sanfilippo et al. (2020).\n6. Belief Revision Approaches\n\nWhile Stalnaker rendered Ramsey’s suggestion about the role of\n“if \\(A\\)” in terms of closest antecedent world, and Adams\nfocused on the probabilistic interpretation of it, Peter\nGärdenfors (1978) introduced a semantics of conditionals that\nuses the Ramsey idea in a direct and purely qualitative way. His\napproach is resolutely epistemic—or more precisely,\ndoxastic— and it is based on the notion of belief or acceptance.\nPrecursors of this approach were William Harper (1976) and Isaac Levi\n(1977).\n6.1 Belief revision models and the Ramsey test\n\nA belief set over a language \\(L\\) is a set of sentences that\nis closed under a given background logic \\(\\iCn\\) (i.e., a\ntheory in the logician’s sense). A belief revision\nmodel (BRM) is a pair \\(M = \\langle \\cK, *\\rangle\\), where\n\\(\\cK\\) is a set of belief sets over \\(L\\) and *: \\(\\cK \\times L \\to\n\\cK\\) is a belief revision function assigning to every belief set\n\\(K\\) and every sentence \\(A\\) a revised belief set \\(K*A\\). The\nacceptance condition for conditionals at a belief set in a belief\nrevision model is a straightforward formalization of Ramsey’s\ntest: \n\n\\[\\tag{RT} M, K \\Vdash_{acc} A >B \\text{ if and only if } B \\in K*A.\\]\n\n\nGärdenfors’s (1978, 1988: sects. 7.1–7.2) initial\nidea was to take conditionals that are accepted at a belief set as\nbeliefs, i.e., as elements of this very belief set. Let us\ncall this Gärdenfors’s Ramsey test: \n\n\\[\\tag{GRT} A >B \\in K (\\text{in } M) \\text{ if and only if } B \\in K*A.\\]\n\n\nPrinciples for the logic of conditionals then fall out directly of the\nfollowing rationality postulates for belief revision introduced by\nGärdenfors (1978) and Alchourrón, Gärdenfors, and\nMakinson (“AGM”, 1985). Using the abbreviation \\(K+A\\) for\n\\(\\iCn(K\\cup\\{A\\})\\), the eight AGM-postulates read as follows: For\nall belief sets \\(K\\) (in all BRMs \\(M\\)) and all sentences \\(A\\) and\n\\(B\\),\n\n\n\n(\\(*\\)1)\n\\(K*A\\) is a belief set.\n(Closure) \n\n(\\(*\\)2)\n\\(A\\in K*A.\\)\n(Success) \n\n(\\(*\\)3)\n\\(K*A\\subseteq K+A.\\)\n(Inclusion) \n\n(\\(*\\)4)\nIf \\(\\neg A\\not\\in K\\), then \\(K+A \\subseteq K*A\\).\n(Vacuity) \n\n(\\(*\\)5)\n\\(K*A = K_{\\bot}\\) only if \\(\\vdash \\neg A\\).\n(Consistency) \n\n(\\(*\\)6)\nIf \\(\\vdash A\\equiv B\\), then \\(K*A = K*B\\).\n(Extensionality) \n\n(\\(*\\)7)\n\\(K*(A\\wedge B) \\subseteq(K*A)+B\\).\n(Superexpansion) \n\n(\\(*\\)8)\nIf \\(\\neg B \\notin K*A\\), then \\((K*A)+B \\subseteq K*(A\\wedge\nB)\\)\n(Subexpansion, Rational Monotonicity)  \n\n\nThe numbering is AGM’s, the names are due to Hansson (1999).\nPostulates (\\(*\\)3) and (\\(*\\)4) taken together say that if the input\n\\(A\\) is consistent with the belief set \\(K\\), then the background\nlogic alone is sufficient to guide belief revision. When (\\(*\\)1) and\n(\\(*\\)2) are present and \\(\\iCn\\) is a monotonic consequence\noperation, (\\(*\\)4) is equivalent to the Preservation\nPrinciple stating that if \\(A\\) is consistent with \\(K\\), then\nall elements of \\(K\\) are preserved in \\(K*A\\):\n\n(Pres)\nIf \\(\\neg A\\not\\in K\\), then \\(K \\subseteq K*A\\). (Preservation)\n\n\nAGM called (\\(*\\)1)–(\\(*\\)6) the basic set of\npostulates. The supplementary postulates (\\(*\\)7) and\n(\\(*\\)8) concern composite belief revisions of the form \\(K*(A\\wedge\nB)\\). The idea is that, if \\(K\\) is to be changed minimally so as to\ninclude two sentences \\(A\\) and \\(B\\), such a change should be\npossible by first revising \\(K\\) with respect to \\(A\\) and then\nexpanding \\(K*A\\) by \\(B\\)—provided that \\(B\\) does not\ncontradict the beliefs in \\(K*A\\).\n\nThe logic of conditionals then mirrors the logic of belief revision:\n(\\(*\\)1) corresponds to RCK, (\\(*\\)2) to ID, (\\(*\\)3) to SM, a\nweakened version of (\\(*\\)4) (viz., if \\(A \\in K\\) and \\(K\\) is\nconsistent, then \\(K \\subseteq K*A\\)) to CS, (\\(*\\)6) corresponds to\nLLE, (\\(*\\)7) to OR and (\\(*\\)8) to RMon. In establishing this logic,\nGärdenfors used the following notion of validity: a sentence\n\\(A\\) is valid in a BRM \\(M\\) if there is no consistent \\(K\\in \\cK\\)\nwith \\(\\neg A\\in K\\). A sentence \\(A\\) is valid iff it is valid in\nevery BRM. Arló-Costa and Levi (1996) call this notion\nnegative validity and contrast it with a notion of\npositive validity that they argue is preferable: \\(A\\) is\npositively valid in a BRM \\(M\\) if \\(A\\in K\\) for every \\(K\\in\n\\cK\\).\n6.2 Gärdenfors’s triviality theorem\n\nGärdenfors (1986; 1988 sects. 7.4–7.7) soon noticed that\ncoupling the Ramsey test with the AGM theory of belief revision leads\nto a trivialization, which is in many respects similar to\nLewis’s trivialization (see\n section 5.2).\n\nTriviality Theorem (Gärdenfors):A belief\nrevision model satisfies the AGM postulates\n (\\(*\\)4)\n and\n (\\(*\\)5)\n and Gärdenfors’s Ramsey Test only if it is trivial in the\nsense that it does not contain any belief set that is logically\ncompatible with three sentences \\(A\\), \\(B\\) and \\(C\\) that are\npairwise inconsistent with each other.\n\n\nA quick and simple proof goes as follows: Suppose for reductio that we\nhave a BRM \\(M = \\langle \\cK, *\\rangle\\) with a belief set \\(K\\in\n\\cK\\) that is logically compatible with three pairwise inconsistent\nsentences \\(A\\), \\(B\\) and \\(C\\). First notice that \n\n\\[B\\in K+(\\neg A\\wedge B) = (K+(A\\vee B))+\\neg A \\subseteq(K+(A\\vee B))*\\neg A,\\]\n\n\nby (\\(*\\)4), and similarly \\(C\\in (K+(A\\vee C))*\\neg A\\). So by\nGRT, \n\n\\[\\neg A > B \\in K+(A\\vee B)\\]\n\n\nand \n\n\\[\\neg A > C \\in K+(A\\vee C).\\]\n\n\nSince \\(A\\) is logically stronger than both \\(A\\vee B\\) and \\(A\\vee\nC\\), we have \n\n\\[K+(A\\vee B)\\subseteq K+A\\]\n\n\nand \n\n\\[K+(A\\vee C)\\subseteq K+A.\\]\n\n\nBut since \\(A\\) is compatible with \\(K\\), \\(K+A \\subseteq K*A\\), by\n(\\(*\\)4). So both \\(\\neg A > B\\) and \\(\\neg A > C\\) are in\n\\(K*A\\). This implies, by GRT again, that both \\(B\\) and \\(C\\) are in\n\\((K*A)*\\neg A\\). Since \\(B\\) and \\(C\\) are inconsistent with each\nother, the latter belief set is inconsistent, contradicting (\\(*\\)5).\nSo the supposition is impossible.\n\nGärdenfors’s triviality theorem was widely perceived as an\nunexpected and somewhat shocking result. Postulate\n (\\(*\\)5)\n can hardly been seen as the culprit, so the triviality theorem was\ninterpreted by Gärdenfors basically as a conflict between\n (\\(*\\)4)\n or the Preservation Principle on the one hand, and the Ramsey Test on\nthe other. But the reactions to his result were mixed, and no\nconsensus has emerged so far.\n\nA first position, taken by Levi and very much in line with those\ndenying that conditionals have truth values, was that conditionals do\nnot express propositions, but epistemic appraisals, and thus should\nnot be objects of belief and elements of belief sets, but rather\nsentences that can only be accepted. This amounts to rejecting\nGRT.\n\nAnother group of researchers suggested to modify or restrict the\nRamsey test. Solutions of this kind were discussed, amongst others, by\nRott (1986), Gärdenfors (1987, 1988), Levi (1996: Chapter 2),\nLindström and Rabinowicz (1998) and Nute and Cross (2001).\nArguably, none of these adaptations of the Ramsey test has retained\nthe intuitive appeal of the original idea.\n\nOthers think that the Ramsey test is perfectly all right. Some authors\nargue that the right reaction is to say that conditionals should not\nbe analyzed by AGM-style revisions, but rather by\nupdates in the style of Katsuno and Mendelzon (1992). Members\nof this party include Ryan and Schobbens (1997), Grahne (1998) and\nCrocco and Herzig (2002). Updates in this sense are closely related to\nLewis’s (1976) imaging (see\n section 5.3.2\n above). These operations violate the AGM-postulate (\\(*\\)4) and the\nPrinciple of Preservation, but satisfy the following Monotonicity\ncondition which is immediately entailed by GRT: \n\n\\[\\tag{MON} \\text{If } K_1\\subseteq K_2 \\text{ then } K_1*A \\subseteq K_2*A.\\]\n\n\nRott (2011) defends Gärdenfors’s Ramsey test by showing\nthat it does not create a specific problem for the Preservation\nPrinciple. Its consequence is rather that both preservation of factual\nbeliefs and preservation of flat conditionals entail that there is no\npreservation of right-nested conditionals of depth 2. GRT allows for\nright-nested conditionals if a model for iterated belief revision is\navailable (other compounds of conditionals are more difficult to make\nsense of). It can be shown, for instance, that supposing there is an\natom \\(p\\) on which the believer suspends judgment, the\nconditional \n\n\\[(\\neg A\\vee p)>((\\neg A\\vee \\neg p)>\\neg A)\\]\n\n\nfunctions exactly like the epistemic modal “might \\(\\neg\nA\\)”: it is believed (or accepted) if and only if \\(A\\) is not\nbelieved. Thus, if our language includes right-nested conditionals,\nthere are no two belief sets \\(K\\) and \\(K'\\) such that \\(K\\) is a\nstrict subset of \\(K'\\). Rott argues that it has simply been a mistake\nto take it for granted that Preservation can and should be transferred\nfrom factual language to languages containing nested conditionals.\n\nDetailed analyses of the dialectics of the situation emerging from\nGärdenfors’s triviality theorem can be found in\nLindström and Rabinowicz (1998), Nute and Cross (2001), and\nArló-Costa (2007). An up-to-date discussion of related problems\nis Boylan & Schultheis (forthcoming).\n7. Relevance and Difference-Making\n\nSince MacColl’s and C. I. Lewis’s strictures against\nmaterial implication, there has been an increasing number of voices\narguing that some notion of relevant connection between antecedent and\nconsequent is part of the meaning of conditionals. In the area of\nconditionals, the notion of relevance is claimed by distinct\ntraditions, however, and means slightly different\n things.[9]\n\nOne tradition concerns so-called relevant logics, designed to\nformulate a more demanding notion of implication than Lewis’s\nstrict implication (cf. Meyer & Routley 1973). The idea of\nrelevant implication is based in large part on the idea that the\nantecedent and the consequent of an acceptable conditional \\(A>B\\)\nmust be connected in terms of topics. For example, a\nconditional of the form \\((p \\wedge \\neg p) > q\\) need not be\nvalid, despite having an impossible antecedent, since the consequent\nshares no content with the antecedent. Various constraints can be\nimposed on the idea of content-sharing, leading to various\nnon-classical logics of so-called relevant implication (see\nMares’s 2020 SEP entry on relevant logics for an overview, and\nWeiss 2019 on the use of analytic entailment to deal with\nSextus’ so-called fourth conditional).\n\nAnother approach to the notion of relevance is in terms of the idea\nthat the antecedent of a conditional should make a difference to the\ntruth, assertability or probability of the consequent. Consider a\nconditional like “if London is in England, then Aristotle was a\nGreek philosopher”. The conditional sounds odd because the truth\nof the antecedent does not matter to the truth of the consequent.\nWhile relevant logics capture the idea of relevance in terms of\ntopic-sharing, here the idea of relevance is captured in terms of the\ndifference that the antecedent makes for the consequent.\n\nThe idea of difference-making itself can be formulated in\nseveral ways. One way is proposed by Douven, in what he calls the\n“Evidential support thesis” (“EST”, Douven\n[2008, 2016: 108]). Basically, the EST says that a conditional\n\\(A>C\\) is relevantly assertable provided \\(\\Pr(C|A)\\) exceeds a\nsufficiently high threshold and \\(\\Pr(C|A)>\\Pr(C)\\). Douven’s\nmain argument in support of the latter condition—which is a\nrelevance criterion—is that high probability is not enough for\nassertion. He gives the example of the following minimal pair:\n\n(8)\n\n\na.\nIf there is at least 1 Head in the first 10 tosses of this coin,\nthen there is at least 1 Head in the first 100,000 tosses.\nb.\nIf Chelsea wins the Champion’s league, then there is at\nleast 1 Head in the first 100,000 tosses.\n \n\n\nBoth statements are such that the probability of the consequent given\nthe antecedent is high. However, in (8)-b the antecedent does not\nincrease the probability of the consequent, it is irrelevant in that\nsense, and the conditional may be called a “non-interference\nconditional”. Douven (2016) defines validity in terms of\nacceptability-preservation according to the EST criterion, for all\nthresholds \\(t\\in [0.5, 1)\\). The resulting logic is weak, in\nparticular it violates Modus Ponens, RW, AND, CMon, Cut, OR and\nContraposition. Douven establishes the validity and invalidity of\nspecific principles (see Douven 2016: Theorem 5.2.1), but a sound and\ncomplete axiomatization of his logic is still an open problem.\n\nMore recently, an alternative approach was proposed by Crupi and\nIacona (forthcoming-b), yielding a stronger logic. Crupi and Iacona\nuse the Rips measure of confirmation and associate to a conditional\n\\(A>C\\) a score defined as \n\n\\[\\frac{P(C|A)-P(C)}{1-P(C)}\\]\n\n\nwhen \\(P(C|A)>P(C)\\), and defined to be equal to \\(0\\) otherwise.\nThis yields a modified score of “uncertainty” for a\nconditional, which they substitute for the standard notion of\nuncertainty in Adams’s definition of \\(p\\)-validity. The logic\nthey identify violates RW and Cut, but it validates AND, CMon, OR,\nModus Ponens, restricted forms of Aristotle’s and\nAbelard’s theses (principles of connexive logic), and even\nContraposition. Crupi and Iacona (forthcoming-a) present a\npossible-worlds semantics for what appears to be the same logic, in\nwhich contraposition plays a central role.\n\nAhead of this recent wave of work, Rott (1986) pioneered another\nmeasure of relevance in a belief revision framework, a measure picked\nup by Spohn (2013), and proposed independently in various accounts of\ncausality. Arguing against Conjunctive Sufficiency (see\n sections 2.2),\n Rott’ suggests that a “difference-making”\nconditional \\(A>C\\) is accepted provided \\(C\\in K*A\\) and \\(C\\notin\nK*\\neg A\\). This is a relevantized variant of the Ramsey Test, ruling\nthat the conditional is accepted provided the revision by \\(A\\)\nresults in the belief that \\(C\\), but the revision by \\(\\neg A\\) does\nnot result in the belief that \\(C\\). Using the terminology of\n“difference-making conditionals”, Rott (forthcoming) calls\nthe violation of RW the hallmark of conditionals that encode the idea\nthat the antecedent is positively relevant to the consequent. This\nyields a logic that also invalidates CMon, Cut, Or and Contraposition,\nbut it validates And, Aristotle’s theses, a restricted form of\nAbelard’s thesis as well as conditions such as\n\n(\\(>\\)1)\nIf \\(A >B\\wedge C\\), then \\(A>B\\) or \\(A>C\\).\n(\\(>\\)2a)\n\\(A>C \\tiff (A >A\\wedge C \\text{ and }A >A\\vee C)\\).\n\n\nIn general conditionals with a relevance reading tend to behave in\nrather unusual and unruly ways. Raidl (2021) develops a general\ntechnique of transferring completeness results for more\n“well-behaved” suppositional conditionals \\(>\\) to\nrelevance-expressing conditionals definable in terms of \\(>\\). He\nis thus able to cover the proposal of Crupi and Iacona as well as that\nof Rott in a unified manner.\n\nRott’s proposal turns out to be related to what is known as the\n“difference measure” or as the “score of\ncontingency” \n\n\\[\\Delta(p)=P(C\\mkern2mu|\\mkern2muA)-P(C|\\neg A)\\]\n\n\nin the psychology of causality (Shanks 1995; Cheng 1997). In\nparticular, (Skovgaard-Olsen et al. 2016) found that depending on\nwhether this measure is positive, negative, or null, the probability\nof a conditional may or may not equal the conditional probability. In\nother words, relevance considerations appear to interact with\nassignments of probabilities to conditionals, the main finding being\nthat Adams’ Thesis appears to hold good only when \\(\\Delta(p)\\)\nis positive. The equation breaks down, on the other hand, when\n\\(\\Delta(p)\\) is null, so precisely in the case of non-interference\nconditionals. Furthermore, Rooij and Schulz (2019) argue that an even\nbetter predictor of the acceptability of conditionals is given by a\nnormalized measure of contingency, that is, by the measure\n\n\\[\\Delta^*(p) = \\frac{P(C|A)-P(C|\\neg A)}{1-P(C|\\neg A)}.\\]\n\n\nWhether in logic or in the psychology of reasoning, the investigation\nof relevance measures and of the resulting inferences is currently a\nvery active field in the study of conditionals.\n8. Modals and Speech Acts\n\nThe previous sections have looked at propositional logics of\nconditionals, which extend Boolean logic with a distinguished\nconditional operator. To wrap up, we look briefly at some richer\nlanguages, in particular at the interplay of conditionals with\nmodalities, and at the interplay of conditionals with other speech\nacts than assertions.\n8.1 Modalities\n\nPossible-worlds analyses of conditionals make it possible to define\nmodalities from conditionals as follows (Stalnaker 1968; Nute\n1980): \n\n\\[\\begin{align} \\Diamond A & \\equiv \\neg (A > \\neg A)\\\\ \\Box A &\\equiv (\\neg A > A)\\end{align}\\]\n\n\nConversely, we saw how strict conditional analyses treat the\nconditional as definable from modalities. Those facts may seem to\nsuggest that modals and conditionals are interdefinable. However, the\ninteraction between them is actually more complex.\n\nLinguistic facts about conditionals suggest that across a wide range\nof languages, modal operators commute with conditional\nantecedents.\n\n(9)\nIf \\(A\\) then necessarily \\(C \\equiv\\) Necessarily if \\(A\\) then\n\\(C\\).\n(10)\nIf \\(A\\) then possibly \\(C \\equiv\\) Possibly if \\(A\\) then\n\\(C\\).\n\n\nSuch facts centrally motivate Kratzer’s account of conditionals\nas restrictors of modal operators (Kratzer (2012), inspired by D.\nLewis 1975). As Kratzer (1991, pp. 468–469) puts it,\n“there is a very close relationship between if-clauses\nand operators like must”, and more specifically\n“for each world, the if-clause has the function of\nrestricting the set of worlds which are accessible from that\nworld”.\n\nKratzer formulates the restrictor view of conditionals by relativizing\nthe semantics of modals to two premise sets, a so-called modal base\n(“hard” facts known or believed by the speaker) and an\nordering source (“soft” facts taken to be revisable).\nConsider a model \\(\\langle W, \\Gamma, \\Delta\\rangle\\) where \\(\\Gamma\\)\nis a premise function for the ordering source, and \\(\\Delta\\) the\npremise function for the modal base. Let us assume the Limit\nassumption and let \\(\\max_{\\Gamma(w)}(F)\\) be the set of worlds in a\nproposition \\(F\\) that satisfy a maximal set of propositions in\n\\(\\Gamma(w)\\). Kratzer’s semantics for \\(\\Box\\) is:\n\n(Kratzer’s Must) \n\n\\[ M, w,\\Gamma, \\Delta\\Vdash \\Box C \\tiff \\max_{\\Gamma(w)}\\left(\\bigcap \\Delta(w)\\right)\\subseteq \\lvert C\\rvert^{M,w,\\Gamma, \\Delta}\\]\n\n\nThe conditional “if \\(A\\) then \\(C\\)” can be treated as a\nbinary modality \\(\\Box(A,C)\\), with the following truth conditions,\nwhere \\((\\Delta+A)(w)\\) equals \\(\\Delta(w) \\cup \\{\\lvert\nA\\rvert^{M,w,\\Gamma, \\Delta}\\}\\):\n(Restricted Must) \\[M, w,\\Gamma, \\Delta\\Vdash \\Box (A,C) \\tiff M, w, \\Gamma, (\\Delta+A) \\Vdash \\Box C\\]\n\nFor bare conditionals, Kratzer postulates that the antecedent also\nrestricts a covert modal. This particular assumption is a source of\ncontroversy. Several authors point out that while if-clauses\nmay restrict operators, modal operators and conditional operators can\nalso have separate contributions (von Fintel 1994; M. Kaufmann &\nS. Kaufmann 2015).\n\nAn important issue is whether the interaction of modals and\nconditionals can be accounted for when both types of operators are\nlogically represented in the language. We highlight two recent\naccounts along those lines. Both take inspiration from Yalcin’s\n(2007) conception of modal operators as expressive devices, and also\nfrom Veltman’s (1996) and Gillies’s (2004) emphasis on the\nidea that utterances involving epistemic modals update informational\nstates.\n\nCiardelli (forthcoming) states truth conditions for a language with\nmodal operators and a conditional operator. He defines the semantic\nvalue of sentences relative to two parameters, a state parameter \\(s\\)\n(set of worlds), and an attitude parameter \\(a\\). In Ciardelli’s\napproach, if-clauses restrict the state \\(s\\), as in\nKratzer’s approach, but modals basically act on the attitude\nparameter \\(a\\), which can express various modal forces (universal,\nexistential, or probabilistic). The framework allows him to derive as\nequivalences the facts\n (9)\n and\n (10),\n in the following guise: \n\n\\[\\begin{align} A > \\Box C & \\equiv \\Box(A > C)\\\\ A > \\Diamond C & \\equiv \\Diamond (A > C) \\end{align}\\]\n\n\nBare conditionals of the form \\(A>B\\) turn out equivalent to\nconditionals \\(A>\\Box B\\), but only under the default attitude\ncoming with universal force. Ciardelli (forthcoming) also derives the\nincompatibility of the conditional \\(A>C\\) with the\nmight-conditional \\(A>{\\Diamond \\neg C}\\) (If-Might Contradiction,\nhenceforth IMC). The same incompatibility is at the heart of\nSantorio’s (forthcoming) so-called path semantics for\nconditionals. Santorio exposes a contradiction between this principle\nand two other principles of conditional logic, namely CEM and the\nDuality principle whereby \\(A>\\Diamond C\\,\\equiv\\, \\neg (A >\\neg\nC)\\) (endorsed by D. Lewis 1973, though rejected by Stalnaker 1968).\nHis semantics validates IMC and preserves CEM, but drops Duality. A\nnumber of further predictions follow from Santorio’s semantics,\nin particular OI becomes valid, as well as restricted versions of IE.\nLike Ciardelli, Santorio does not have to treat bare conditionals as\nimplicitly modalized, and like Ciardelli he can derive commutation\nfacts about modalities.\n\nBeside those proposals, Omori (2019) focuses also on the interplay of\nnegation, modals, and conditionals in the framework of connexive\nlogics. Omori uses Odintsov and Wansing’s (2010) four-valued\nframework for modal logic, to show that conditional negations of\nvarying strength for \\(A>B\\) can be derived from the outer negation\nof a conditional (building on distinctions made in Égré\n& Politzer 2013), in particular \\(A>{\\Diamond\\neg B}\\) instead\nof \\(A >\\neg B\\). He gives sound and complete axiomatizations for\nthe resulting conditional logics. An earlier connexive system is\nOlkhovikov (2002)’s logic LImp,\neffectively combining Cooper’s conditional with a trivalent\nnecessity operator of determinate truth (mapping 1 to 1\nand ½ and 0 to 0).\n8.2 Beyond assertion\n\nConditionals do not only appear in declarative sentences, but also in\nquestions and in commands, as in:\n\n(11)\nIf John visits, will Mary visit too?\n(12)\nIf John visits, make sure to bring cheese!\n\n\nThe semantics of imperatives and interrogatives lies beyond the scope\nof this entry. However, we mention such constructions because they too\nmay be seen as supporting Kratzer’s restrictor analysis. In\nparticular, S. Kaufmann and Schwager (2011) treat imperatives as\ninvolving a covert modal operator, which can have a deontic, or\nbouletic meaning, but basically acting like “must”. In the\ncase of questions, Isaacs and Rawlins (2008) treat questions as\nprefixed with a covert speech act operator, coming with a modal domain\nrestricted by the if-clause. In a related way, Ciardelli,\nGroenendijk, and Roelofsen (2018) point out that the semantics of a\nquestion can be specified by resolution conditions relative to an\ninformation state. Again, conditional questions can be viewed as\nappropriately restricting the information state to the antecedent\nworlds, so as to resolve the question relative to those (see\nCiardelli, forthcoming). For a polar question of form \\(?M\\)\n(“will Mary visit?”) the information state \\(s\\) resolves\nit if either \\(s\\) supports \\(M\\) or \\(s\\) supports \\(\\neg M\\). In the\ncase of a conditional polar question like\n (11),\n the semantics of Ciardelli, Groenendijk, and Roelofsen (2018)\npredicts that a state \\(s\\) will resolve a question of the form \\(J\n>{?M}\\) provided either \\(s\\) supports \\(J >M\\) or \\(s\\)\nsupports \\(J >\\neg M\\).\n\nFurther connections have been explored between the semantics of\ninterrogatives and the very structure of conditional sentences. Starr\n(2014b) in particular argues that all conditionals have a\ntopic-comment structure, allowing to treat the antecedent as a covert\nquestion itself. Finally, more aspects of the interaction of\nconditional phrases with speech acts deserve to be mentioned,\nincluding so-called biscuit-conditionals (“if you want\nsome biscuits, there are some in the cupboard”, Austin 1956,\nLycan 2001), as well as concessives (“even if A, B”\nsentences, see Lycan 2001, Guerzoni and Lim 2007). For both kinds,\npermitted inferences differ significantly from those found in regular\nconditionals (in particular, both entail the truth of the consequent).\nThis is evidence that the diversity found in logics of conditionals\nalso depends on the variety of uses and linguistic environments in\nwhich if-clauses occur.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "<li id=\"ref-Adams1965\">Adams, Ernest, 1965, “The Logic of\nConditionals”, <em>Inquiry</em>, 8(1–4): 166–197.\ndoi:10.1080/00201746508601430",
                "<li id=\"ref-Adams1966\">–––, 1966, “Probability\nand the Logic of Conditionals”, in <em>Aspects of Inductive\nLogic</em>, Jaakko Hintikka and Patrick Suppes (eds.), Amsterdam:\nNorth-Holland, 265–316.",
                "<li id=\"ref-Adams1975\">–––, 1975, <em>The Logic of\nConditionals</em>, Dordrecht: Reidel.",
                "<li id=\"ref-adams1986logic\">–––, 1986, “On the\nLogic of High Probability”, <em>Journal of Philosophical\nLogic</em>, 15(3): 255–279. doi:10.1007/BF00248572",
                "<li id=\"ref-agm85\">Alchourrón, Carlos E., Peter\nGärdenfors, and David Makinson, 1985, “On the Logic of\nTheory Change: Partial Meet Contraction and Revision Functions”,\n<em>Journal of Symbolic Logic</em>, 50(2): 510–530.\ndoi:10.2307/2274239",
                "<li id=\"ref-aleskerov-bouyssou-monjardet-07\">Aleskerov, Fuad, Denis\nBouyssou, and Bernard Monjardet, 2007, <em>Utility Maximization,\nChoice and Preference</em>, second edition, Berlin: Springer.\ndoi:10.1007/978-3-540-34183-3",
                "<li id=\"ref-arlo-costa-sep-07\">Arló-Costa, Horacio, 2007,\n“The Logic of Conditionals”, in <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2007 edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2007/entries/logic-conditionals/\" target=\"other\">https://plato.stanford.edu/archives/fall2007/entries/logic-conditionals/</a>&gt;.",
                "<li id=\"ref-arlo-costa-levi-96\">Arló Costa, Horacio and Isaac\nLevi, 1996, “Two Notions of Epistemic Validity: Epistemic Models\nfor Ramsey’s Conditionals”, <em>Synthese</em>, 109(2):\n217–262. doi:10.1007/BF00413768",
                "<li id=\"ref-Arlo-Costa-1992\">Arló-Costa, Horacio and Scott J.\nShapiro, 1992, “Maps between Conditional Logic and Non-Monotonic\nLogic”, in <em>Principles of Knowledge Representation and\nReasoning: Proceedings of the Third International Conference</em>,\nBernhard Nebel, Charles Rich, and William R. Swartout (eds.), San\nMateo, CA: Morgan Kaufmann, 553–565.",
                "<li id=\"ref-austin1956ifs\">Austin, J. L., 1956, “Ifs and\nCans”, <em>Proceedings of the British Academy</em>, 42:\n109–132.",
                "Baratgin, Jean, David Over, and Guy Politzer, 2013,\n“Uncertainty and the de Finetti tables”, <em>Thinking\n&amp; Reasoning</em> 19, 308–328.\ndoi:10.1080/13546783.2013.809018",
                "<li id=\"ref-belnap1970conditional\">Belnap, Nuel D., 1970,\n“Conditional Assertion and Restricted Quantification”,\n<em>Noûs</em>, 4(1): 1–12. doi:10.2307/2214285",
                "Belnap, Nuel D., 1973, “Restricted Quantification and\nConditional Assertion”, in <em>Truth, Syntax, and Modality</em>,\nHughes Leblanc (ed.), Studies in Logic and the Foundations of\nMathematics, vol. 68, Elsevier, 48–75.\ndoi:10.1016/S0049-237X(08)71533-7",
                "<li id=\"ref-boylan-schultheis-qualitative-20\">Boylan, David and Ginger\nSchultheis, forthcoming, “The Qualitative Thesis”, <em>The\nJournal of Philosophy</em>.",
                "<li id=\"ref-bradley2000preservation\">Bradley, Richard, 2000, “A\nPreservation Condition for Conditionals”, <em>Analysis</em>,\n60(3): 219–222. doi:10.1093/analys/60.3.219",
                "<li id=\"ref-bradley2012multidimensional\">–––, 2012,\n“Multidimensional Possible-World Semantics for\nConditionals”, <em>Philosophical Review</em>, 121(4):\n539–571. doi:10.1215/00318108-1630921",
                "<li id=\"ref-briggs2012interventionist\">Briggs, Rachael, 2012,\n“Interventionist Counterfactuals”, <em>Philosophical\nStudies</em>, 160(1): 139–166.\ndoi:10.1007/s11098-012-9908-5",
                "<li id=\"ref-burgess-81\">Burgess, John P., 1981, “Quick\nCompleteness Proofs for Some Logics of Conditionals”, <em>Notre\nDame Journal of Formal Logic</em>, 22(1): 76–84.\ndoi:10.1305/ndjfl/1093883341",
                "<li id=\"ref-calabrese1991deduction\">Calabrese, Philip, 1991,\n<em>Deduction and Inference Using Conditional Logic and\nProbability</em>, San Diego, CA: Naval Ocean Systems Center.",
                "<li id=\"ref-cantwell2008logic\">Cantwell, John, 2008, “The Logic\nof Conditional Negation”, <em>Notre Dame Journal of Formal\nLogic</em>, 49(3): 245–260. doi:10.1215/00294527-2008-010",
                "<li id=\"ref-charlow2016triviality\">Charlow, Nate, 2016,\n“Triviality for Restrictor Conditionals”,\n<em>Noûs</em>, 50(3): 533–564. doi:10.1111/nous.12111",
                "<li id=\"ref-chellas-75\">Chellas, Brian F., 1975, “Basic\nConditional Logic”, <em>Journal of Philosophical Logic</em>,\n4(2): 133–153. doi:10.1007/BF00693270",
                "<li id=\"ref-chellas-modal-logic-80\">–––, 1980,\n<em>Modal Logic: an Introduction</em>, Cambridge: Cambridge University\nPress.",
                "<li id=\"ref-chemla2011expressible\">Chemla, Emmanuel, 2011,\n“Expressible Semantics for Expressible Counterfactuals”,\n<em>Review of Symbolic Logic</em>, 4(1): 63–80.\ndoi:10.1017/S175502031000016X",
                "<li id=\"ref-ChemlaEgreSpector2017\">Chemla, Emmanuel, Paul\nÉgré, and Benjamin Spector, 2017, “Characterizing\nLogical Consequence in Many-Valued Logic”, <em>Journal of Logic\nand Computation</em>, 27(7): 2193–2226.",
                "<li id=\"ref-cheng1997covariation\">Cheng, Patricia W., 1997,\n“From Covariation to Causation: A Causal Power Theory”,\n<em>Psychological Review</em>, 104(2): 367–405.\ndoi:10.1037/0033-295X.104.2.367",
                "<li id=\"ref-chisholm1946contrary\">Chisholm, Roderick M., 1946,\n“The Contrary-to-Fact Conditional”, <em>Mind</em>,\n55(220): 289–307. doi:10.1093/mind/LV.219.289",
                "<li id=\"ref-ciardelli2020restrictor\">Ciardelli, Ivano, forthcoming,\n“The Restrictor View, Without Covert Modals”,\n<em>Linguistics and Philosophy</em>, first online: 31 May 2021.\ndoi:10.1007/s10988-021-09332-z.",
                "<li id=\"ref-ciardelli2018inquisitive\">Ciardelli, Ivano, Jeroen\nGroenendijk, and Floris Roelofsen, 2018, <em>Inquisitive\nSemantics</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198814788.001.0001",
                "<li id=\"ref-ciardelli2018two\">Ciardelli, Ivano, Linmin Zhang, and\nLucas Champollion, 2018, “Two Switches in the Theory of\nCounterfactuals: A Study of Truth Conditionality and Minimal\nChange”, <em>Linguistics and Philosophy</em>, 41(6):\n577–621. doi:10.1007/s10988-018-9232-4",
                "<li id=\"ref-coletti1999conditioning\">Coletti, Giulianella and Romano\nScozzafava, 1999, “Conditioning and Inference in Intelligent\nSystems”, <em>Soft Computing</em>, 3(3): 118–130.\ndoi:10.1007/s005000050060",
                "<li id=\"ref-cooper1968propositional\">Cooper, William S., 1968,\n“The Propositional Logic of Ordinary Discourse”,\n<em>Inquiry</em>, 11(1–4): 295–320.\ndoi:10.1080/00201746808601531",
                "<li id=\"ref-crocco_herzig\">Crocco, Gabriella and Andreas Herzig, 2002,\n“Les Opérations de Changement Basées sur le Test\nde Ramsey”, in <em>Révision Des Croyances</em>, Pierre\nLivet (ed.), Paris: Hermes Science Publications, 21–41.",
                "<li id=\"ref-crupi-iacona-evidential-conditional-19\">Crupi, Vincenzo\nand Andrea Iacona, forthcoming-a, “The Evidential\nConditional”, <em>Erkenntnis</em>, first online: 31 December\n2020. doi:10.1007/s10670-020-00332-2",
                "<li id=\"ref-daniels-freeman-subjunctive-80\">–––,\nforthcoming-b, “Three Ways of Being Non-Material”,\n<em>Studia Logica</em>, first online: 30 May 2021, 1–47.\ndoi:10.1007/s11225-021-09949-y",
                "Daniels, Charles B. and James B. Freeman, 1980, “An Analysis\nof the Subjunctive Conditional”, <em>Notre Dame Journal of\nFormal Logic</em>, 21(4): 639–655.\ndoi:10.1305/ndjfl/1093883247",
                "<li id=\"ref-delgrande1987first\">Delgrande, James P., 1987, “A\nFirst-Order Conditional Logic for Prototypical Properties”,\n<em>Artificial Intelligence</em>, 33(1): 105–130.\ndoi:10.1016/0004-3702(87)90053-1",
                "<li id=\"ref-Douven2008\">Douven, Igor, 2008, “The Evidential\nSupport Theory of Conditionals”, <em>Synthese</em>, 164(1):\n19–44. doi:10.1007/s11229-007-9214-5",
                "<li id=\"ref-Douven2016\">–––, 2016, <em>The\nEpistemology of Indicative Conditionals: Formal and Empirical\nApproaches</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781316275962",
                "<li id=\"ref-DouvenVerbrugge2010\">Douven, Igor and Sara Verbrugge,\n2010, “The Adams Family”, <em>Cognition</em>, 117(3):\n302–318. doi:10.1016/j.cognition.2010.08.015",
                "<li id=\"ref-dubois1994conditional\">Dubois, Didier and Henri Prade,\n1994, “Conditional Objects as Nonmonotonic Consequence\nRelationships”, <em>IEEE Transactions on Systems, Man, and\nCybernetics</em>, 24(12): 1724–1740. doi:10.1109/21.328930",
                "Eells, Ellery and Brian Skyrms (eds.), 1994, <em>Probability and\nConditionals: Belief Revision and Rational Decision</em>, (Cambridge\nStudies in Probability, Induction, and Decision Theory), Cambridge:\nCambridge University Press.",
                "<li id=\"ref-Edgington1995\">Edgington, Dorothy, 1995, “On\nConditionals”, <em>Mind</em>, 104(414): 235–329.\ndoi:10.1093/mind/104.414.235",
                "<li id=\"ref-sep-conditionals\">–––, 2020,\n“Indicative Conditionals”, in <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2020 edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2020/entries/conditionals/\" target=\"other\">https://plato.stanford.edu/archives/fall2020/entries/conditionals/</a>&gt;",
                "<li id=\"ref-ellis1977objection\">Ellis, Brian, Frank Jackson, and\nRobert Pargetter, 1977, “An Objection to Possible-World\nSemantics for Counterfactual Logics”, <em>Journal of\nPhilosophical Logic</em>, 6(1): 355–357.\ndoi:10.1007/BF00262069",
                "<li id=\"ref-egre2011if\">Égré, Paul and Mikaël\nCozic, 2011, “If-Clauses and Probability Operators”,\n<em>Topoi</em>, 30(1): 17–29. doi:10.1007/s11245-010-9087-y",
                "<li id=\"ref-egre2013negation\">Égré, Paul and Guy\nPolitzer, 2013, “On the Negation of Indicative\nConditionals”, in <em>Proceedings of the 19th Amsterdam\nColloquium</em>, Maria Aloni, Michael Franke, and Floris Roelofsen\n(eds.), Amsterdam: ILLC, University of Amsterdam, 10–18.",
                "<li id=\"ref-egre2019finettian\">Égré, Paul, Lorenzo\nRossi, and Jan Sprenger, 2021, “De Finettian Logics of\nIndicative Conditionals Part I: Trivalent Semantics and\nValidity”, <em>Journal of Philosophical Logic</em>, 50(2):\n187–213. doi:10.1007/s10992-020-09549-6",
                "<li id=\"ref-farrell1979material\">Farrell, Robert J., 1979,\n“Material Implication, Confirmation, and Counterfactuals”,\n<em>Notre Dame Journal of Formal Logic</em>, 20(2): 383–394.\ndoi:10.1305/ndjfl/1093882546",
                "<li id=\"ref-farrell1986implication\">–––, 1986,\n“Implication and Presupposition”, <em>Notre Dame Journal\nof Formal Logic</em>, 27(1): 51–61.\ndoi:10.1305/ndjfl/1093636522",
                "<li id=\"ref-Fine1975\">Fine, Kit, 1975, “Vagueness, Truth and\nLogic”, <em>Synthese</em>, 30(3–4): 265–300.\ndoi:10.1007/BF00485047",
                "<li id=\"ref-fine2012counterfactuals\">–––, 2012,\n“Counterfactuals Without Possible Worlds”, <em>Journal of\nPhilosophy</em>, 109(3): 221–246.",
                "<li id=\"ref-finetti1936logic\">Finetti, Bruno de, 1936, “La\nLogique de La Probabilité”, in <em>Actes Du\nCongrès International de Philosophie Scientifique, Paris\n1935</em>, Vol. IV: Induction et Probabilité, Paris: Hermann,\n31–39.",
                "<li id=\"ref-fintel1994restrictions\">von Fintel, Kai, 1994,\n<em>Restrictions on Quantifier Domains</em>, PhD Thesis, University of\nMassachusetts, Amherst.",
                "<li id=\"ref-von-fintel-counterfactuals-01\">–––,\n2001, “Counterfactuals in a Dynamic Context”, in <em>Ken\nHale: A Life in Language</em>, Michael Kenstowicz (ed.), Cambridge,\nMA: MIT Press, 123–152.",
                "<li id=\"ref-fitelson2015strongest\">Fitelson, Branden, 2015, “The\nStrongest Possible Lewisian Triviality Result”,\n<em>Thought</em>, 4(2): 69–74. doi:10.1002/tht3.159",
                "<li id=\"ref-fraassen1976probabilities\">van Fraassen, Bas C., 1976,\n“Probabilities of Conditionals”, in Harper and Hooker\n1976: 261–308. doi:10.1007/978-94-010-1853-1_10",
                "<li id=\"ref-frege1879begriffsschrift\">Frege, Gottlob, 1879,\n<em>Begriffsschrift</em>, Halle: Nebert.",
                "<li id=\"ref-freund-93\">Freund, Michael, 1993, “Injective Models\nand Disjunctive Relations”, <em>Journal of Logic and\nComputation</em>, 3(3): 231–247. doi:10.1093/logcom/3.3.231",
                "<li id=\"ref-friedman1994complexity\">Friedman, Nir and Joseph Y.\nHalpern, 1994, “On the Complexity of Conditional Logics”,\nin <em>Principles of Knowledge Representation and Reasoning:\nProceedings of the Fourth International Conference (KR’94)</em>,\nJon Doyle, Erik Sandewall, and Pietro Torasso (eds.), San Francisco,\nCA: Morgan Kaufmann, 202–213.",
                "<li id=\"ref-gardenfors-79\">Gärdenfors, Peter, 1978,\n“Conditionals and Changes of Belief”, in <em>The Logic and\nEpistemology of Scientific Change</em>, Illkka Niiniluoto and Raimo\nTuomela (eds.), (Acta Philosophica Fennica), Amsterdam: North Holland,\n381–404.",
                "<li id=\"ref-gardenfors1986belief\">–––, 1986,\n“Belief Revisions and the Ramsey Test for Conditionals”,\n<em>Philosophical Review</em>, 95(1): 81–93.\ndoi:10.2307/2185133",
                "<li id=\"ref-gardenfors-87\">–––, 1987,\n“Variations on the Ramsey Test: More Triviality Results”,\n<em>Studia Logica</em>, 46(4): 321–327.\ndoi:10.1007/BF00370643",
                "<li id=\"ref-gardenfors-88\">–––, 1988, <em>Knowledge\nin Flux: Modeling the Dynamics of Epistemic States</em>, Cambridge,\nMA: Bradford Books, MIT Press.",
                "<li id=\"ref-gibbard1980two\">Gibbard, Allan, 1980, “Two Recent\nTheories of Conditionals”, in Harper, Stalnaker, and Pearce\n1980: 211–247. doi:10.1007/978-94-009-9117-0_10",
                "<li id=\"ref-gilio2002probabilistic\">Gilio, Angelo, 2002,\n“Probabilistic Reasoning under Coherence in System P”,\n<em>Annals of Mathematics and Artificial Intelligence</em>,\n34(1–3): 5–34. doi:10.1023/A:1014422615720",
                "<li id=\"ref-gilio2014conditional\">Gilio, Angelo and Giuseppe\nSanfilippo, 2014, “Conditional Random Quantities and Compounds\nof Conditionals”, <em>Studia Logica</em>, 102(4): 709–729.\ndoi:10.1007/s11225-013-9511-6",
                "<li id=\"ref-gillies2004epistemic\">Gillies, Anthony S., 2004,\n“Epistemic Conditionals and Conditional Epistemics”,\n<em>Noûs</em>, 38(4): 585–616.\ndoi:10.1111/j.0029-4624.2004.00485.x",
                "<li id=\"ref-gillies_scorekeeping-07\">–––, 2007,\n“Counterfactual Scorekeeping”, <em>Linguistics and\nPhilosophy</em>, 30(3): 329–360.\ndoi:10.1007/s10988-007-9018-6",
                "<li id=\"ref-girard2007onions\">Girard, Patrick, 2007, “From\nOnions to Broccoli: Generalizing Lewis’ Counterfactual\nLogic”, <em>Journal of Applied Non-Classical Logics</em>, 17(2):\n213–229. doi:10.3166/jancl.17.213-229",
                "<li id=\"ref-goodman47\">Goodman, Nelson, 1947, “The Problem of\nCounterfactual Conditionals”, <em>Journal of Philosophy</em>,\n44(5): 113–128. doi:10.2307/2019988",
                "<li id=\"ref-goodman1955fact\">–––, 1955, <em>Fact,\nFiction and Forecast</em>, Cambridge, MA: Harvard University\nPress.",
                "<li id=\"ref-grahne_update_counterfactuals\">Grahne, Gösta, 1998,\n“Updates and Counterfactuals”, <em>Journal of Logic and\nComputation</em>, 8(1): 87–117. doi:10.1093/logcom/8.1.87",
                "Guerzoni, Elena, &amp; Lim, Dongsik (2007). “Even if,\nfactivity and focus”, in <em>Proceedings of Sinn und Bedeutung,\n</em>vol. 11: 276–290. doi:10.18148/sub/2007.v11i0.645",
                "Günther, Mario, 2018, “Learning conditional information\nby Jeffrey imaging on Stalnaker conditionals”, <em>Journal of\nPhilosophical Logic</em>, 47(5), 851–876.\ndoi:10.1007/s10992-017-9452-z",
                "<li id=\"ref-hansson_textbook\">Hansson, Sven Ove, 1999, <em>A Textbook\non Belief Dynamics</em>, Dordrecht: Kluwer.",
                "<li id=\"ref-harper76\">Harper, William L., 1976, “Ramsey Test\nConditionals and Iterated Belief Change (A Response to\nStalnaker)”, in Harper and Hooker 1976: 117–135.\ndoi:10.1007/978-94-010-1853-1_6",
                "Harper, William L. and Clifford Alan Hooker (eds.), 1976,\n<em>Foundations of Probability Theory, Statistical Inference, and\nStatistical Theories of Science</em>, Vol. 1, Dordrecht: Springer\nNetherlands. doi:10.1007/978-94-010-1853-1",
                "Harper, William L., Robert Stalnaker, and Glenn Pearce (eds.),\n1980, <em>IFS: Conditionals, Belief, Decision, Chance and Time</em>,\nDordrecht: Springer Netherlands. doi:10.1007/978-94-009-9117-0",
                "<li id=\"ref-hajek1989probabilities\">Hájek, Alan, 1989,\n“Probabilities of Conditionals – Revisited”,\n<em>Journal of Philosophical Logic</em>, 18(4): 423–428.\ndoi:10.1007/BF00262944",
                "<li id=\"ref-hajek1994hypothesis\">Hájek, Alan, and Hall, Ned,\n1994, “The Hypothesis of the Conditional Construal of\nConditional Probability”, in Eells and Skyrms 1994:\n75–111.",
                "<li id=\"ref-herzig1996scan\">Herzig, Andreas, 1996, <em>SCAN and\nSystems of Conditional Logic</em> (No. MPI-I-1996-2-007),\nSaarbrücken: Max-Planck-Institut für Informatik.",
                "<li id=\"ref-huitink2008phd\">Huitink, Janneke, 2008, <em>Modals,\nConditionals and Compositionality</em>, PhD Thesis, Radboud\nUniversity, Nijmegen.",
                "<li id=\"ref-isaacs2008conditional\">Isaacs, James and Kyle Rawlins,\n2008, “Conditional Questions”, <em>Journal of\nSemantics</em>, 25(3): 269–319. doi:10.1093/jos/ffn003",
                "<li id=\"ref-jeffrey1963indeterminate\">Jeffrey, Richard C., 1963,\n“On Indeterminate Conditionals”, <em>Philosophical\nStudies</em>, 14(3): 37–43. doi:10.1007/BF00427948",
                "<li id=\"ref-katmend-91\">Katsuno, Hirofumi and Alberto O. Mendelzon,\n1991, “Propositional Knowledge Base Revision and Minimal\nChange”, <em>Artificial Intelligence</em>, 52(3): 263–294.\ndoi:10.1016/0004-3702(91)90069-V",
                "<li id=\"ref-katmend-92\">–––, 1992, “On the\nDifference between Updating a Knowledge Base and Revising It”,\nin <em>Belief Revision</em>, Peter Gärdenfors (ed.), Cambridge:\nCambridge University Press, 183–203.\ndoi:10.1017/CBO9780511526664.007",
                "<li id=\"ref-kaufmann2015conditionals\">Kaufmann, Magdalena and Stefan\nKaufmann, 2015, “Conditionals and Modality”, in <em>The\nHandbook of Contemporary Semantic Theory</em>, Shalom Lappin and Chris\nFox (eds.), 2nd ed., Chichester, UK: John Wiley &amp; Sons,\n237–270. doi:10.1002/9781118882139.ch8",
                "<li id=\"ref-kaufmann2005conditional\">Kaufmann, Stefan, 2005,\n“Conditional Predictions: A Probabilistic Account”,\n<em>Linguistics and Philosophy</em>, 28(2): 181–231.\ndoi:10.1007/s10988-005-3731-9",
                "<li id=\"ref-kaufmann2009conditionals\">–––, 2009,\n“Conditionals Right and Left: Probabilities for the Whole\nFamily”, <em>Journal of Philosophical Logic</em>, 38(1):\n1–53. doi:10.1007/s10992-008-9088-0",
                "<li id=\"ref-kaufmann2013causal\">–––, 2013,\n“Causal Premise Semantics”, <em>Cognitive Science</em>,\n37(6): 1136–1170. doi:10.1111/cogs.12063",
                "<li id=\"ref-kaufmann2017limit\">–––, 2017, “The\nLimit Assumption”, <em>Semantics and Pragmatics</em>, 10: art.\n18. doi:10.3765/sp.10.18",
                "<li id=\"ref-kaufmann2009unified\">Kaufmann, Stefan and Magdalena\nSchwager, 2011, “A Unified Analysis of Conditional\nImperatives”, in <em>Proceedings of Semantics and Linguistic\nTheory (SALT) 19, 2009</em>, Ed Cormany, Satoshi Ito, and David Lutz\n(eds.), 239–256. doi:10.3765/salt.v19i0.2545",
                "<li id=\"ref-klinedinst2009simplification\">Klinedinst, Nathan, 2009,\n“(Simplification of)<sup>2</sup> Disjunctive Antecedents”,\nin <em>Presuppositions and Implicatures: Proceedings of the MIT-Paris\nWorkshop</em>, Paul Égré and Giorgio Magri (eds.),\nCambridge, MA: MIT Working Papers in Linguistics, 135–151.",
                "<li id=\"ref-kneale1962development\">Kneale, William and Martha Kneale,\n1962, <em>The Development of Logic</em>, Oxford: Oxford University\nPress.",
                "<li id=\"ref-kratzer-79\">Kratzer, Angelika, 1979, “Conditional\nNecessity and Possibility”, in <em>Semantics from Different\nPoints of View</em>, Rainer Bäuerle, Urs Egli, and Arnim von\nStechow (eds.), Berlin: Springer, 117–147.",
                "<li id=\"ref-Kratzer\">–––, 1981, “Partition and\nRevision: The Semantics of Counterfactuals”, <em>Journal of\nPhilosophical Logic</em>, 10(2). doi:10.1007/BF00248849",
                "<li id=\"ref-Kratzer1991\">–––, 1991,\n“Modality”, in <em>Semantics: An International Handbook of\nContemporary Research</em>, Arnim von Stechow and Dieter Wunderlich\n(eds.), Berlin: de Gruyter, 639–650.",
                "<li id=\"ref-kratzer2012modals\">–––, 2012, <em>Modals\nand Conditionals: New and Revised Perspectives</em>, Oxford: Oxford\nUniversity Press.",
                "<li id=\"ref-klm\">Kraus, Sarit, Daniel Lehmann, and Menachem Magidor,\n1990, “Nonmonotonic Reasoning, Preferential Models and\nCumulative Logics”, <em>Artificial Intelligence</em>,\n44(1–2): 167–207. doi:10.1016/0004-3702(90)90101-5",
                "<li id=\"ref-krzyzanowska2013inferential\">Krzyżanowska, Karolina,\nSylvia Wenmackers, and Igor Douven, 2013, “Inferential\nConditionals and Evidentiality”, <em>Journal of Logic, Language\nand Information</em>, 22(3): 315–334.\ndoi:10.1007/s10849-013-9178-4",
                "<li id=\"ref-lassiter2018complex\">Lassiter, Daniel, 2018,\n“Complex Sentential Operators Refute Unrestricted Simplification\nof Disjunctive Antecedents”, <em>Semantics and Pragmatics</em>,\n11: art. 9. doi:10.3765/sp.11.9",
                "<li id=\"ref-lassiter2019triviality\">–––, 2020,\n“What We Can Learn from How Trivalent Conditionals Avoid\nTriviality”, <em>Inquiry</em>, 63(9–10): 1087–1114.\ndoi:10.1080/0020174X.2019.1698457",
                "<li id=\"ref-lehmann-magidor-92\">Lehmann, Daniel and Menachem Magidor,\n1992, “What Does a Conditional Knowledge Base Entail?”,\n<em>Artificial Intelligence</em>, 55(1): 1–60.\ndoi:10.1016/0004-3702(92)90041-U",
                "<li id=\"ref-levisubjunctives-77\">Levi, Isaac, 1977,\n“Subjunctives, Dispositions and Chances”,\n<em>Synthese</em>, 34(4): 423–455. doi:10.1007/BF00485649",
                "<li id=\"ref-levi_fsa\">–––, 1996, <em>For the Sake of\nthe Argument: Ramsey Test Conditionals, Inductive Inference and\nNonmonotonic Reasoning</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511720161",
                "<li id=\"ref-lewis1912implication\">Lewis, Clarence Irving, 1912,\n“Implication and the Algebra of Logic”, <em>Mind</em>,\n21(84): 522–531. doi:10.1093/mind/XXI.84.522",
                "<li id=\"ref-Lewis1973\">Lewis, David, 1973, <em>Counterfactuals</em>,\nOxford: Basil Blackwell.",
                "<li id=\"ref-lewis1975adverbs\">–––, 1975,\n“Adverbs of Quantification”, in <em>Formal Semantics of\nNatural Language</em>, Edward L. Keenan (ed.), Cambridge: Cambridge\nUniversity Press, 178–188.",
                "<li id=\"ref-lewis_76\">–––, 1976,\n“Probabilities of Conditionals and Conditional\nProbabilities”, <em>Philosophical Review</em>, 85(3):\n297–315. doi:10.2307/2184045",
                "<li id=\"ref-lewis-81\">–––, 1981, “Ordering\nSemantics and Premise Semantics for Counterfactuals”,\n<em>Journal of Philosophical Logic</em>, 10(2): 217–234.\ndoi:10.1007/BF00248850",
                "<li id=\"ref-lindstrom\">Lindström, Sten, 1994, <em>A Semantic\nApproach to Nonmonotonic Reasoning: Inference Operations and\nChoice</em> (Uppsala Prints and Preprints in Philosophy, 1994, 10),\nUniversity of Uppsala: Department of Philosophy.",
                "<li id=\"ref-lindstr_rabino-98\">Lindström, Sten and Wlodek\nRabinowicz, 1998, “Conditionals and the Ramsey Test”, in\n<em>Belief Change</em>, Didier Dubois and Henri Prade (eds.),\n(Handbook of Defeasible Reasoning and Uncertainty Management Systems\n3), Dordrecht: Kluwer, 147–188.\ndoi:10.1007/978-94-011-5054-5_4",
                "<li id=\"ref-lukasiewicz1920three\">Łukasiewicz, Jan, 1920,\n“O logice trójwartościowej” (“On\nThree-Valued Logic”), <em>Ruch Filosoficzny</em>, 5:\n170–171.",
                "<li id=\"ref-lycan2001real\">Lycan, William G., 2001, <em>Real\nConditionals</em>, Oxford: Clarendon Press.",
                "<li id=\"ref-maccoll1908if\">MacColl, Hugh, 1908, “`If’and\n`Imply’”, <em>Mind</em>, 17(67): 453–455.\ndoi:10.1093/mind/XVII.3.453",
                "<li id=\"ref-mackie1962counterfactuals\">Mackie, John Leslie, 1962,\n“Counterfactuals and Causal Laws”, in <em>Analytical\nPhilosophy</em>, R. J. Butler (ed.), Oxford: Blackwell,\n66–80.",
                "<li id=\"ref-Mandelkern2018import\">Mandelkern, Matthew, 2020,\n“Import‐Export and ‘And’”,\n<em>Philosophy and Phenomenological Research</em>, 100(1):\n118–135. doi:10.1111/phpr.12513",
                "<li id=\"ref-manor1975propositional\">Manor, Ruth, 1975,\n“Propositional Commitment and Presuppositions”,\n<em>American Philosophical Quarterly</em>, 12(2): 141–149.",
                "<li id=\"ref-sep-logic-relevance\">Mares, Edwin, 2020, “Relevance\nLogic”, in <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2020 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2020/entries/logic-relevance/\" target=\"other\">https://plato.stanford.edu/archives/sum2020/entries/logic-relevance/</a>&gt;",
                "<li id=\"ref-mcdermott1996truth\">McDermott, Michael, 1996, “On\nthe Truth Conditions of Certain ’If’-Sentences”,\n<em>Philosophical Review</em>, 105(1): 1–37.\ndoi:10.2307/2185762",
                "<li id=\"ref-McGee1981\">McGee, Vann, 1981, “Finite Matrices and\nthe Logic of Conditionals”, <em>Journal of Philosophical\nLogic</em>, 10(3): 349–351. doi:10.1007/BF00293426",
                "<li id=\"ref-mcgee1989conditional\">–––, 1989,\n“Conditional Probabilities and Compounds of Conditionals”,\n<em>Philosophical Review</em>, 98(4): 485–541.\ndoi:10.2307/2185116",
                "<li id=\"ref-mckay1977counterfactuals\">Mckay, Thomas and Peter Van\nInwagen, 1977, “Counterfactuals with Disjunctive\nAntecedents”, <em>Philosophical Studies</em>, 31(5):\n353–356. doi:10.1007/BF01873862",
                "<li id=\"ref-meyer1973classical\">Meyer, Robert K. and Richard Routley,\n1973, “Classical Relevant Logics. I”, <em>Studia\nLogica</em>, 32(1): 51–66. doi:10.1007/BF02123812",
                "<li id=\"ref-milne1997finetti\">Milne, Peter, 1997, “Bruno de\nFinetti and the Logic of Conditional Events”, <em>British\nJournal for the Philosophy of Science</em>, 48(2): 195–232.\ndoi:10.1093/bjps/48.2.195",
                "<li id=\"ref-milne2003simplest\">–––, 2003, “The\nSimplest Lewis-Style Triviality Proof Yet?”, <em>Analysis</em>,\n63(4): 300–303. doi:10.1093/analys/63.4.300",
                "<li id=\"ref-nute-80\">Nute, Donald, 1980, <em>Topics in Conditional\nLogic</em>, Dordrecht: Reidel. doi:10.1007/978-94-009-8966-5",
                "<li id=\"ref-NuteCross2001\">Nute, Donald and Charles B. Cross, 2001,\n“Conditional Logic”, in <em>Handbook of Philosophical\nLogic</em>, volume 4, Dov M. Gabbay and Franz Guenthner (eds.), 2nd\ned., Dordrecht: Kluwer, 1–98.\ndoi:10.1007/978-94-017-0456-4_1",
                "<li id=\"ref-odintsov2010modal\">Odintsov, Sergei P. and Heinrich\nWansing, 2010, “Modal Logics with Belnapian Truth Values”,\n<em>Journal of Applied Non-Classical Logics</em>, 20(3):\n279–301.",
                "<li id=\"ref-olivetti2007sequent\">Olivetti, Nicola, Gian Luca Pozzato,\nand Camilla B. Schwind, 2007, “A Sequent Calculus and a Theorem\nProver for Standard Conditional Logics”, <em>ACM Transactions on\nComputational Logic</em>, 8(4): art. 22.\ndoi:10.1145/1276920.1276924",
                "Olkhovikov, Grigory, 2002, “On a new three-valued\nparaconsistent logic”, T. Ferguson (trans.), <em>IFCoLog Journal\nof Logic and Applications</em>, 3 (2016): 317–334; originaly\npublished in Russian, <em>Logic of Law and Tolerance</em>,\nYekaterinburg: Ural State University Press, 2002, pp. 96–113.\n",
                "<li id=\"ref-omori2019bridge\">Omori, Hitoshi, 2019, “Towards a\nBridge over Two Approaches in Connexive Logic”, <em>Logic and\nLogical Philosophy</em>, 28(3): 553–566.\ndoi:10.12775/LLP.2019.005",
                "<li id=\"ref-over2017defective\">Over, David and Jean Baratgin, 2017,\n“The ‘Defective’ Truth Table: Its Past, Present, and\nFuture”, in <em>The Thinking Mind: A Festschrift for Ken\nManktelow</em>, Niall Galbraith, Erica Lucas, and David Over (eds.),\nLondon: Routledge, 15–28.",
                "<li id=\"ref-OverEtAl2007\">Over, David E., Constantinos\nHadjichristidis, Jonathan St. B.T. Evans, Simon J. Handley, and Steven\nA. Sloman, 2007, “The Probability of Causal Conditionals”,\n<em>Cognitive Psychology</em>, 54(1): 62–97.\ndoi:10.1016/j.cogpsych.2006.05.002",
                "<li id=\"ref-pearl2009causality\">Pearl, Judea, 2009, <em>Causality:\nModels, Reasoning, and Inference</em>, second edition, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511803161",
                "<li id=\"ref-pfeifer2014reasoning\">Pfeifer, Niki, 2014,\n“Reasoning About Uncertain Conditionals”, <em>Studia\nLogica</em>, 102(4): 849–866. doi:10.1007/s11225-013-9505-4",
                "<li id=\"ref-poggiolesi2016natural\">Poggiolesi, Francesca, 2016,\n“Natural Deduction Calculi and Sequent Calculi for\nCounterfactual Logics”, <em>Studia Logica</em>, 104(5):\n1003–1036. doi:10.1007/s11225-016-9662-3",
                "<li id=\"ref-pollock\">Pollock, John L., 1976, <em>Subjunctive\nReasoning</em>, Dordrecht: Reidel. doi:10.1007/978-94-010-1500-4",
                "<li id=\"ref-quine1950methods\">Quine, W. V. O., 1950, <em>Methods of\nLogic</em>, New York: Holt.",
                "<li id=\"ref-raidl-definable-conditionals-20\">Raidl, Eric, 2021,\n“Definable Conditionals”, <em>Topoi</em>, 40(1):\n87–105. doi:10.1007/s11245-020-09704-3",
                "<li id=\"ref-Ramsey1929\">Ramsey, Frank P., 1931, “General\nPropositions and Causality”, in <em>The Foundations of\nMathematics and Other Logical Essays</em>, Joseph B. Braithwaite\n(ed.), London: Kegan Paul, 237–255.",
                "<li id=\"ref-reichenbach1935wahr\">Reichenbach, Hans, 1935,\n<em>Wahrscheinlichkeitslehre</em>, Leiden: Sijthoff.",
                "<li id=\"ref-reichenbach1944philosophic\">–––, 1944,\n<em>Philosophic Foundations of Quantum Mechanics</em>, Berkeley, CA:\nUniversity of California Press.",
                "<li id=\"ref-reichenbach1949prob\">–––, 1949, <em>The\nTheory of Probability</em>, Berkeley: University of California\nPress.",
                "<li id=\"ref-rescher1964hypothetical\">Rescher, Nicholas, 1964,\n<em>Hypothetical Reasoning</em>, Amsterdam: North-Holland.",
                "<li id=\"ref-rooij2019conditionals\">Rooij, Robert van and Katrin\nSchulz, 2019, “Conditionals, Causality and Conditional\nProbability”, <em>Journal of Logic, Language and\nInformation</em>, 28(1): 55–71.\ndoi:10.1007/s10849-018-9275-5",
                "Rothschild, D., 2014, “Capturing the relationship between\nconditionals and conditional probability with a trivalent\nsemantics”, <em>Journal of Applied Non-Classical\nLogics</em>, 24(1–2), 144–152.\ndoi:10.1080/11663081.2014.911535",
                "<li id=\"ref-rott_ifs\">Rott, Hans, 1986, “Ifs, Though, and\nBecause”, <em>Erkenntnis</em>, 25(3): 345–370.\ndoi:10.1007/BF00175348",
                "<li id=\"ref-pmcpbc\">–––, 1993, “Belief\nContraction in the Context of the General Theory of Rational\nChoice”, <em>Journal of Symbolic Logic</em>, 58(4):\n1426–1450. doi:10.2307/2275152",
                "<li id=\"ref-cci\">–––, 2001, <em>Change, Choice and\nInference: A Study in Belief Revision and Nonmonotonic Reasoning</em>,\nOxford: Oxford University Press.",
                "<li id=\"ref-reapramsey-11\">–––, 2011,\n“Reapproaching Ramsey: Conditionals and Iterated Belief Change\nin the Spirit of AGM”, <em>Journal of Philosophical Logic</em>,\n40(2): 155–191. doi:10.1007/s10992-011-9177-3",
                "<li id=\"ref-rott-relevant-ramsey-19\">–––,\nforthcoming, “Difference-Making Conditionals and the Relevant\nRamsey Test”, <em>Review of Symbolic Logic</em>, first online:\n12 December 2019, 1–32. doi:10.1017/S1755020319000674",
                "<li id=\"ref-ryan-schobbens_counterfactuals-97\">Ryan, Mark D. and\nPierre-Yves Schobbens, 1997, “Counterfactuals and Updates as\nInverse Modalities”, <em>Journal of Logic, Language and\nInformation</em>, 6(2): 123–146.\ndoi:10.1023/A:1008218502162",
                "<li id=\"ref-sanfilippo2020probabilities\">Sanfilippo, Giuseppe, Angelo\nGilio, David E. Over, and Niki Pfeifer, 2020, “Probabilities of\nConditionals and Previsions of Iterated Conditionals”,\n<em>International Journal of Approximate Reasoning</em>, 121:\n150–173. doi:10.1016/j.ijar.2020.03.001",
                "<li id=\"ref-sanford1989if\">Sanford, David, 1989, <em>If P, Then Q:\nConditionals and the Foundations of Reasoning</em>, London:\nRoutledge.",
                "<li id=\"ref-santorio2018alternatives\">Santorio, Paolo, 2018,\n“Alternatives and Truthmakers in Conditional Semantics”,\n<em>Journal of Philosophy</em>, 115(10): 513–549.\ndoi:10.5840/jphil20181151030",
                "<li id=\"ref-santorio2019interventions\">–––, 2019,\n“Interventions in Premise Semantics”,\n<em>Philosopher’s Imprint</em>, 19: art. 1.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.001\" target=\"other\">Santorio 2019 available online</a>]",
                "<li id=\"ref-santorio2020path\">–––, forthcoming,\n“Path Semantics for Conditionals”, <em>Mind</em>.",
                "<li id=\"ref-schay1968algebra\">Schay, Geza, 1968, “An Algebra of\nConditional Events”, <em>Journal of Mathematical Analysis and\nApplications</em>, 24(2): 334–344.\ndoi:10.1016/0022-247X(68)90035-8",
                "<li id=\"ref-schlenker2004conditionals\">Schlenker, Philippe, 2004,\n“Conditionals as Definite Descriptions”, <em>Research on\nLanguage and Computation</em>, 2(3): 417–462.\ndoi:10.1007/s11168-004-0908-2",
                "<li id=\"ref-schulz2007minimal\">Schulz, Katrin, 2007, <em>Minimal\nModels in Semantics and Pragmatics: Free Choice, Exhaustivity, and\nConditionals</em>, PhD Thesis, Institute for Logic, Language;\nComputation, Amsterdam.",
                "<li id=\"ref-Schulz2009\">Schulz, Moritz, 2009, “A Note on Two\nTheorems by Adams and McGee”, <em>Review of Symbolic Logic</em>,\n2(3): 509–516. doi:10.1017/S1755020309990189",
                "<li id=\"ref-segerberg_cond-log-89\">Segerberg, Krister, 1989,\n“Notes on Conditional Logic”, <em>Studia Logica</em>,\n48(2): 157–168. doi:10.1007/BF02770509",
                "<li id=\"ref-senCCSW-70\">Sen, Amartya K., 1970, <em>Collective Choice\nSocial Welfare</em>, San Francisco: Holden-Day.",
                "Sextus Empiricus, 2000, <em>Outlines of Skepticism</em>, J. Annas\nand J. Barnes (eds.), Cambridge: Cambridge University Press.",
                "<li id=\"ref-shanks1995psychology\">Shanks, David R., 1995, <em>The\nPsychology of Associative Learning</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511623288",
                "<li id=\"ref-skovgaard2016relevance\">Skovgaard-Olsen, Niels, Henrik\nSingmann, and Karl Christoph Klauer, 2016, “The Relevance Effect\nand Conditionals”, <em>Cognition</em>, 150(1): 26–36.\ndoi:10.1016/j.cognition.2015.12.017",
                "Sobociński, Bolesław, 1952. Axiomatization of a partial\nsystem of three-value calculus of propositions. <em>Journal of\nComputing Systems</em> 1, 23–55.",
                "<li id=\"ref-spohn2013ranking\">Spohn, Wolfgang, 2013, “A\nRanking-Theoretic Approach to Conditionals”, <em>Cognitive\nScience</em>, 37(6): 1074–1106. doi:10.1111/cogs.12057",
                "<li id=\"ref-Stalnaker1968\">Stalnaker, Robert C., 1968, “A Theory\nof Conditionals”, in <em>Studies in Logical Theory</em>,\nNicholas Rescher (ed.), Oxford: Blackwell, 98–112.",
                "<li id=\"ref-stalnaker1970probability\">–––, 1970,\n“Probability and Conditionals”, <em>Philosophy of\nScience</em>, 37(1): 64–80. doi:10.1086/288280",
                "<li id=\"ref-stalnaker1975indicative\">–––, 1975,\n“Indicative Conditionals”, <em>Philosophia</em>, 5(3):\n269–286. doi:10.1007/BF02379021",
                "<li id=\"ref-stalnaker1980defense\">–––, 1980,\n“A Defense of Conditional Excluded Middle”, in Harper,\nStalnaker, and Pearce 1980: 87–104.\ndoi:10.1007/978-94-009-9117-0_4",
                "<li id=\"ref-stalnaker1994conditionals\">Stalnaker, Robert C. and\nRichard Jeffrey, 1994, “Conditionals as Random Variables”,\nin Eells and Skyrms 1994: 31–46.",
                "<li id=\"ref-starr2014uniform\">Starr, William B., 2014a, “A\nUniform Theory of Conditionals”, <em>Journal of Philosophical\nLogic</em>, 43(6): 1019–1064. doi:10.1007/s10992-013-9300-8",
                "<li id=\"ref-starr2015whatif\">–––, 2014b, “What\n‘If’?”, <em>Philosopher’s Imprint</em>, 14:\nart. 10.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.010\" target=\"other\">Starr 2014 available online</a>]",
                "<li id=\"ref-sep-counterfactuals\">–––, 2019,\n“Counterfactuals”, in <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2019 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/counterfactuals/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/counterfactuals/</a>&gt;",
                "<li id=\"ref-suzu\">Suzumura, Kotaro, 1983, <em>Rational Choice,\nCollective Decisions, and Social Welfare</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511897993",
                "<li id=\"ref-unterhuber2014completeness\">Unterhuber, Matthias and\nGerhard Schurz, 2014, “Completeness and Correspondence in\nChellas–Segerberg Semantics”, <em>Studia Logica</em>,\n102(4): 891–911. doi:10.1007/s11225-013-9504-5",
                "<li id=\"ref-delval94\">del Val, Alvaro, 1994, “On the Relation\nBetween the Coherence and Foundations Theories of Belief\nRevision”, in <em>Proceedings of the Twelfth National Conference\nof the American Association on Artificial Intelligence\n(AAAI’94)</em>, Barbara Hayes-Roth and Richard E. Korf (eds.),\nMenlo Park, CA: AAAI Press, 909–914.",
                "<li id=\"ref-veltman-76\">Veltman, Frank, 1976, “Prejudices,\nPresuppositions and the Theory of Counterfactuals”, in\n<em>Amsterdam Papers of Formal Grammar</em>, volume 1, Jeroen\nGroenendijk and Martin Stokhof (eds.), Centrale Interfaculteit,\nUniversiteit van Amsterdam, 248–281.",
                "<li id=\"ref-Veltman\">–––, 1985, <em>Logics for\nConditionals</em>, PhD Thesis, University of Amsterdam,\nAmsterdam.",
                "<li id=\"ref-veltman1996defaults\">–––, 1996,\n“Defaults in Update Semantics”, <em>Journal of\nPhilosophical Logic</em>, 25(3): 221–261.\ndoi:10.1007/BF00248150",
                "<li id=\"ref-veltman2005making\">–––, 2005,\n“Making Counterfactual Assumptions”, <em>Journal of\nSemantics</em>, 22(2): 159–180. doi:10.1093/jos/ffh022",
                "Weiss, Yale, 2019, “Sextus Empiricus’ Fourth\nConditional and Containment Logic”, <em>History and Philosophy\nof Logic</em>, 40(4), 307–322.\ndoi:10.1080/01445340.2019.1647083",
                "<li id=\"ref-russell1910principia\">Whitehead, Alfred North, and\nBertrand Russell, 1910, <em>Principia Mathematica</em>, Vol. 1,\nCambridge: Cambridge University Press.",
                "<li id=\"ref-yalcin2007epistemic\">Yalcin, Seth, 2007, “Epistemic\nModals”, <em>Mind</em>, 116(464): 983–1026.\ndoi:10.1093/mind/fzm983"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li id=\"ref-Adams1965\">Adams, Ernest, 1965, “The Logic of\nConditionals”, <em>Inquiry</em>, 8(1–4): 166–197.\ndoi:10.1080/00201746508601430</li>\n<li id=\"ref-Adams1966\">–––, 1966, “Probability\nand the Logic of Conditionals”, in <em>Aspects of Inductive\nLogic</em>, Jaakko Hintikka and Patrick Suppes (eds.), Amsterdam:\nNorth-Holland, 265–316.</li>\n<li id=\"ref-Adams1975\">–––, 1975, <em>The Logic of\nConditionals</em>, Dordrecht: Reidel.</li>\n<li id=\"ref-adams1986logic\">–––, 1986, “On the\nLogic of High Probability”, <em>Journal of Philosophical\nLogic</em>, 15(3): 255–279. doi:10.1007/BF00248572</li>\n<li id=\"ref-agm85\">Alchourrón, Carlos E., Peter\nGärdenfors, and David Makinson, 1985, “On the Logic of\nTheory Change: Partial Meet Contraction and Revision Functions”,\n<em>Journal of Symbolic Logic</em>, 50(2): 510–530.\ndoi:10.2307/2274239</li>\n<li id=\"ref-aleskerov-bouyssou-monjardet-07\">Aleskerov, Fuad, Denis\nBouyssou, and Bernard Monjardet, 2007, <em>Utility Maximization,\nChoice and Preference</em>, second edition, Berlin: Springer.\ndoi:10.1007/978-3-540-34183-3</li>\n<li id=\"ref-arlo-costa-sep-07\">Arló-Costa, Horacio, 2007,\n“The Logic of Conditionals”, in <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2007 edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2007/entries/logic-conditionals/\" target=\"other\">https://plato.stanford.edu/archives/fall2007/entries/logic-conditionals/</a>&gt;.</li>\n<li id=\"ref-arlo-costa-levi-96\">Arló Costa, Horacio and Isaac\nLevi, 1996, “Two Notions of Epistemic Validity: Epistemic Models\nfor Ramsey’s Conditionals”, <em>Synthese</em>, 109(2):\n217–262. doi:10.1007/BF00413768</li>\n<li id=\"ref-Arlo-Costa-1992\">Arló-Costa, Horacio and Scott J.\nShapiro, 1992, “Maps between Conditional Logic and Non-Monotonic\nLogic”, in <em>Principles of Knowledge Representation and\nReasoning: Proceedings of the Third International Conference</em>,\nBernhard Nebel, Charles Rich, and William R. Swartout (eds.), San\nMateo, CA: Morgan Kaufmann, 553–565.</li>\n<li id=\"ref-austin1956ifs\">Austin, J. L., 1956, “Ifs and\nCans”, <em>Proceedings of the British Academy</em>, 42:\n109–132.</li>\n<li>Baratgin, Jean, David Over, and Guy Politzer, 2013,\n“Uncertainty and the de Finetti tables”, <em>Thinking\n&amp; Reasoning</em> 19, 308–328.\ndoi:10.1080/13546783.2013.809018</li>\n<li id=\"ref-belnap1970conditional\">Belnap, Nuel D., 1970,\n“Conditional Assertion and Restricted Quantification”,\n<em>Noûs</em>, 4(1): 1–12. doi:10.2307/2214285</li>\n<li>Belnap, Nuel D., 1973, “Restricted Quantification and\nConditional Assertion”, in <em>Truth, Syntax, and Modality</em>,\nHughes Leblanc (ed.), Studies in Logic and the Foundations of\nMathematics, vol. 68, Elsevier, 48–75.\ndoi:10.1016/S0049-237X(08)71533-7</li>\n<li id=\"ref-boylan-schultheis-qualitative-20\">Boylan, David and Ginger\nSchultheis, forthcoming, “The Qualitative Thesis”, <em>The\nJournal of Philosophy</em>.</li>\n<li id=\"ref-bradley2000preservation\">Bradley, Richard, 2000, “A\nPreservation Condition for Conditionals”, <em>Analysis</em>,\n60(3): 219–222. doi:10.1093/analys/60.3.219</li>\n<li id=\"ref-bradley2012multidimensional\">–––, 2012,\n“Multidimensional Possible-World Semantics for\nConditionals”, <em>Philosophical Review</em>, 121(4):\n539–571. doi:10.1215/00318108-1630921</li>\n<li id=\"ref-briggs2012interventionist\">Briggs, Rachael, 2012,\n“Interventionist Counterfactuals”, <em>Philosophical\nStudies</em>, 160(1): 139–166.\ndoi:10.1007/s11098-012-9908-5</li>\n<li id=\"ref-burgess-81\">Burgess, John P., 1981, “Quick\nCompleteness Proofs for Some Logics of Conditionals”, <em>Notre\nDame Journal of Formal Logic</em>, 22(1): 76–84.\ndoi:10.1305/ndjfl/1093883341</li>\n<li id=\"ref-calabrese1991deduction\">Calabrese, Philip, 1991,\n<em>Deduction and Inference Using Conditional Logic and\nProbability</em>, San Diego, CA: Naval Ocean Systems Center.</li>\n<li id=\"ref-cantwell2008logic\">Cantwell, John, 2008, “The Logic\nof Conditional Negation”, <em>Notre Dame Journal of Formal\nLogic</em>, 49(3): 245–260. doi:10.1215/00294527-2008-010</li>\n<li id=\"ref-charlow2016triviality\">Charlow, Nate, 2016,\n“Triviality for Restrictor Conditionals”,\n<em>Noûs</em>, 50(3): 533–564. doi:10.1111/nous.12111</li>\n<li id=\"ref-chellas-75\">Chellas, Brian F., 1975, “Basic\nConditional Logic”, <em>Journal of Philosophical Logic</em>,\n4(2): 133–153. doi:10.1007/BF00693270</li>\n<li id=\"ref-chellas-modal-logic-80\">–––, 1980,\n<em>Modal Logic: an Introduction</em>, Cambridge: Cambridge University\nPress.</li>\n<li id=\"ref-chemla2011expressible\">Chemla, Emmanuel, 2011,\n“Expressible Semantics for Expressible Counterfactuals”,\n<em>Review of Symbolic Logic</em>, 4(1): 63–80.\ndoi:10.1017/S175502031000016X</li>\n<li id=\"ref-ChemlaEgreSpector2017\">Chemla, Emmanuel, Paul\nÉgré, and Benjamin Spector, 2017, “Characterizing\nLogical Consequence in Many-Valued Logic”, <em>Journal of Logic\nand Computation</em>, 27(7): 2193–2226.</li>\n<li id=\"ref-cheng1997covariation\">Cheng, Patricia W., 1997,\n“From Covariation to Causation: A Causal Power Theory”,\n<em>Psychological Review</em>, 104(2): 367–405.\ndoi:10.1037/0033-295X.104.2.367</li>\n<li id=\"ref-chisholm1946contrary\">Chisholm, Roderick M., 1946,\n“The Contrary-to-Fact Conditional”, <em>Mind</em>,\n55(220): 289–307. doi:10.1093/mind/LV.219.289</li>\n<li id=\"ref-ciardelli2020restrictor\">Ciardelli, Ivano, forthcoming,\n“The Restrictor View, Without Covert Modals”,\n<em>Linguistics and Philosophy</em>, first online: 31 May 2021.\ndoi:10.1007/s10988-021-09332-z.</li>\n<li id=\"ref-ciardelli2018inquisitive\">Ciardelli, Ivano, Jeroen\nGroenendijk, and Floris Roelofsen, 2018, <em>Inquisitive\nSemantics</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198814788.001.0001</li>\n<li id=\"ref-ciardelli2018two\">Ciardelli, Ivano, Linmin Zhang, and\nLucas Champollion, 2018, “Two Switches in the Theory of\nCounterfactuals: A Study of Truth Conditionality and Minimal\nChange”, <em>Linguistics and Philosophy</em>, 41(6):\n577–621. doi:10.1007/s10988-018-9232-4</li>\n<li id=\"ref-coletti1999conditioning\">Coletti, Giulianella and Romano\nScozzafava, 1999, “Conditioning and Inference in Intelligent\nSystems”, <em>Soft Computing</em>, 3(3): 118–130.\ndoi:10.1007/s005000050060</li>\n<li id=\"ref-cooper1968propositional\">Cooper, William S., 1968,\n“The Propositional Logic of Ordinary Discourse”,\n<em>Inquiry</em>, 11(1–4): 295–320.\ndoi:10.1080/00201746808601531</li>\n<li id=\"ref-crocco_herzig\">Crocco, Gabriella and Andreas Herzig, 2002,\n“Les Opérations de Changement Basées sur le Test\nde Ramsey”, in <em>Révision Des Croyances</em>, Pierre\nLivet (ed.), Paris: Hermes Science Publications, 21–41.</li>\n<li id=\"ref-crupi-iacona-evidential-conditional-19\">Crupi, Vincenzo\nand Andrea Iacona, forthcoming-a, “The Evidential\nConditional”, <em>Erkenntnis</em>, first online: 31 December\n2020. doi:10.1007/s10670-020-00332-2</li>\n<li id=\"ref-daniels-freeman-subjunctive-80\">–––,\nforthcoming-b, “Three Ways of Being Non-Material”,\n<em>Studia Logica</em>, first online: 30 May 2021, 1–47.\ndoi:10.1007/s11225-021-09949-y</li>\n<li>Daniels, Charles B. and James B. Freeman, 1980, “An Analysis\nof the Subjunctive Conditional”, <em>Notre Dame Journal of\nFormal Logic</em>, 21(4): 639–655.\ndoi:10.1305/ndjfl/1093883247</li>\n<li id=\"ref-delgrande1987first\">Delgrande, James P., 1987, “A\nFirst-Order Conditional Logic for Prototypical Properties”,\n<em>Artificial Intelligence</em>, 33(1): 105–130.\ndoi:10.1016/0004-3702(87)90053-1</li>\n<li id=\"ref-Douven2008\">Douven, Igor, 2008, “The Evidential\nSupport Theory of Conditionals”, <em>Synthese</em>, 164(1):\n19–44. doi:10.1007/s11229-007-9214-5</li>\n<li id=\"ref-Douven2016\">–––, 2016, <em>The\nEpistemology of Indicative Conditionals: Formal and Empirical\nApproaches</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9781316275962</li>\n<li id=\"ref-DouvenVerbrugge2010\">Douven, Igor and Sara Verbrugge,\n2010, “The Adams Family”, <em>Cognition</em>, 117(3):\n302–318. doi:10.1016/j.cognition.2010.08.015</li>\n<li id=\"ref-dubois1994conditional\">Dubois, Didier and Henri Prade,\n1994, “Conditional Objects as Nonmonotonic Consequence\nRelationships”, <em>IEEE Transactions on Systems, Man, and\nCybernetics</em>, 24(12): 1724–1740. doi:10.1109/21.328930</li>\n<li>Eells, Ellery and Brian Skyrms (eds.), 1994, <em>Probability and\nConditionals: Belief Revision and Rational Decision</em>, (Cambridge\nStudies in Probability, Induction, and Decision Theory), Cambridge:\nCambridge University Press.</li>\n<li id=\"ref-Edgington1995\">Edgington, Dorothy, 1995, “On\nConditionals”, <em>Mind</em>, 104(414): 235–329.\ndoi:10.1093/mind/104.414.235</li>\n<li id=\"ref-sep-conditionals\">–––, 2020,\n“Indicative Conditionals”, in <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2020 edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2020/entries/conditionals/\" target=\"other\">https://plato.stanford.edu/archives/fall2020/entries/conditionals/</a>&gt;</li>\n<li id=\"ref-ellis1977objection\">Ellis, Brian, Frank Jackson, and\nRobert Pargetter, 1977, “An Objection to Possible-World\nSemantics for Counterfactual Logics”, <em>Journal of\nPhilosophical Logic</em>, 6(1): 355–357.\ndoi:10.1007/BF00262069</li>\n<li id=\"ref-egre2011if\">Égré, Paul and Mikaël\nCozic, 2011, “If-Clauses and Probability Operators”,\n<em>Topoi</em>, 30(1): 17–29. doi:10.1007/s11245-010-9087-y</li>\n<li id=\"ref-egre2013negation\">Égré, Paul and Guy\nPolitzer, 2013, “On the Negation of Indicative\nConditionals”, in <em>Proceedings of the 19th Amsterdam\nColloquium</em>, Maria Aloni, Michael Franke, and Floris Roelofsen\n(eds.), Amsterdam: ILLC, University of Amsterdam, 10–18.</li>\n<li id=\"ref-egre2019finettian\">Égré, Paul, Lorenzo\nRossi, and Jan Sprenger, 2021, “De Finettian Logics of\nIndicative Conditionals Part I: Trivalent Semantics and\nValidity”, <em>Journal of Philosophical Logic</em>, 50(2):\n187–213. doi:10.1007/s10992-020-09549-6</li>\n<li id=\"ref-farrell1979material\">Farrell, Robert J., 1979,\n“Material Implication, Confirmation, and Counterfactuals”,\n<em>Notre Dame Journal of Formal Logic</em>, 20(2): 383–394.\ndoi:10.1305/ndjfl/1093882546</li>\n<li id=\"ref-farrell1986implication\">–––, 1986,\n“Implication and Presupposition”, <em>Notre Dame Journal\nof Formal Logic</em>, 27(1): 51–61.\ndoi:10.1305/ndjfl/1093636522</li>\n<li id=\"ref-Fine1975\">Fine, Kit, 1975, “Vagueness, Truth and\nLogic”, <em>Synthese</em>, 30(3–4): 265–300.\ndoi:10.1007/BF00485047</li>\n<li id=\"ref-fine2012counterfactuals\">–––, 2012,\n“Counterfactuals Without Possible Worlds”, <em>Journal of\nPhilosophy</em>, 109(3): 221–246.</li>\n<li id=\"ref-finetti1936logic\">Finetti, Bruno de, 1936, “La\nLogique de La Probabilité”, in <em>Actes Du\nCongrès International de Philosophie Scientifique, Paris\n1935</em>, Vol. IV: Induction et Probabilité, Paris: Hermann,\n31–39.</li>\n<li id=\"ref-fintel1994restrictions\">von Fintel, Kai, 1994,\n<em>Restrictions on Quantifier Domains</em>, PhD Thesis, University of\nMassachusetts, Amherst.</li>\n<li id=\"ref-von-fintel-counterfactuals-01\">–––,\n2001, “Counterfactuals in a Dynamic Context”, in <em>Ken\nHale: A Life in Language</em>, Michael Kenstowicz (ed.), Cambridge,\nMA: MIT Press, 123–152.</li>\n<li id=\"ref-fitelson2015strongest\">Fitelson, Branden, 2015, “The\nStrongest Possible Lewisian Triviality Result”,\n<em>Thought</em>, 4(2): 69–74. doi:10.1002/tht3.159</li>\n<li id=\"ref-fraassen1976probabilities\">van Fraassen, Bas C., 1976,\n“Probabilities of Conditionals”, in Harper and Hooker\n1976: 261–308. doi:10.1007/978-94-010-1853-1_10</li>\n<li id=\"ref-frege1879begriffsschrift\">Frege, Gottlob, 1879,\n<em>Begriffsschrift</em>, Halle: Nebert.</li>\n<li id=\"ref-freund-93\">Freund, Michael, 1993, “Injective Models\nand Disjunctive Relations”, <em>Journal of Logic and\nComputation</em>, 3(3): 231–247. doi:10.1093/logcom/3.3.231</li>\n<li id=\"ref-friedman1994complexity\">Friedman, Nir and Joseph Y.\nHalpern, 1994, “On the Complexity of Conditional Logics”,\nin <em>Principles of Knowledge Representation and Reasoning:\nProceedings of the Fourth International Conference (KR’94)</em>,\nJon Doyle, Erik Sandewall, and Pietro Torasso (eds.), San Francisco,\nCA: Morgan Kaufmann, 202–213.</li>\n<li id=\"ref-gardenfors-79\">Gärdenfors, Peter, 1978,\n“Conditionals and Changes of Belief”, in <em>The Logic and\nEpistemology of Scientific Change</em>, Illkka Niiniluoto and Raimo\nTuomela (eds.), (Acta Philosophica Fennica), Amsterdam: North Holland,\n381–404.</li>\n<li id=\"ref-gardenfors1986belief\">–––, 1986,\n“Belief Revisions and the Ramsey Test for Conditionals”,\n<em>Philosophical Review</em>, 95(1): 81–93.\ndoi:10.2307/2185133</li>\n<li id=\"ref-gardenfors-87\">–––, 1987,\n“Variations on the Ramsey Test: More Triviality Results”,\n<em>Studia Logica</em>, 46(4): 321–327.\ndoi:10.1007/BF00370643</li>\n<li id=\"ref-gardenfors-88\">–––, 1988, <em>Knowledge\nin Flux: Modeling the Dynamics of Epistemic States</em>, Cambridge,\nMA: Bradford Books, MIT Press.</li>\n<li id=\"ref-gibbard1980two\">Gibbard, Allan, 1980, “Two Recent\nTheories of Conditionals”, in Harper, Stalnaker, and Pearce\n1980: 211–247. doi:10.1007/978-94-009-9117-0_10</li>\n<li id=\"ref-gilio2002probabilistic\">Gilio, Angelo, 2002,\n“Probabilistic Reasoning under Coherence in System P”,\n<em>Annals of Mathematics and Artificial Intelligence</em>,\n34(1–3): 5–34. doi:10.1023/A:1014422615720</li>\n<li id=\"ref-gilio2014conditional\">Gilio, Angelo and Giuseppe\nSanfilippo, 2014, “Conditional Random Quantities and Compounds\nof Conditionals”, <em>Studia Logica</em>, 102(4): 709–729.\ndoi:10.1007/s11225-013-9511-6</li>\n<li id=\"ref-gillies2004epistemic\">Gillies, Anthony S., 2004,\n“Epistemic Conditionals and Conditional Epistemics”,\n<em>Noûs</em>, 38(4): 585–616.\ndoi:10.1111/j.0029-4624.2004.00485.x</li>\n<li id=\"ref-gillies_scorekeeping-07\">–––, 2007,\n“Counterfactual Scorekeeping”, <em>Linguistics and\nPhilosophy</em>, 30(3): 329–360.\ndoi:10.1007/s10988-007-9018-6</li>\n<li id=\"ref-girard2007onions\">Girard, Patrick, 2007, “From\nOnions to Broccoli: Generalizing Lewis’ Counterfactual\nLogic”, <em>Journal of Applied Non-Classical Logics</em>, 17(2):\n213–229. doi:10.3166/jancl.17.213-229</li>\n<li id=\"ref-goodman47\">Goodman, Nelson, 1947, “The Problem of\nCounterfactual Conditionals”, <em>Journal of Philosophy</em>,\n44(5): 113–128. doi:10.2307/2019988</li>\n<li id=\"ref-goodman1955fact\">–––, 1955, <em>Fact,\nFiction and Forecast</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li id=\"ref-grahne_update_counterfactuals\">Grahne, Gösta, 1998,\n“Updates and Counterfactuals”, <em>Journal of Logic and\nComputation</em>, 8(1): 87–117. doi:10.1093/logcom/8.1.87</li>\n<li>Guerzoni, Elena, &amp; Lim, Dongsik (2007). “Even if,\nfactivity and focus”, in <em>Proceedings of Sinn und Bedeutung,\n</em>vol. 11: 276–290. doi:10.18148/sub/2007.v11i0.645</li>\n<li>Günther, Mario, 2018, “Learning conditional information\nby Jeffrey imaging on Stalnaker conditionals”, <em>Journal of\nPhilosophical Logic</em>, 47(5), 851–876.\ndoi:10.1007/s10992-017-9452-z</li>\n<li id=\"ref-hansson_textbook\">Hansson, Sven Ove, 1999, <em>A Textbook\non Belief Dynamics</em>, Dordrecht: Kluwer.</li>\n<li id=\"ref-harper76\">Harper, William L., 1976, “Ramsey Test\nConditionals and Iterated Belief Change (A Response to\nStalnaker)”, in Harper and Hooker 1976: 117–135.\ndoi:10.1007/978-94-010-1853-1_6</li>\n<li>Harper, William L. and Clifford Alan Hooker (eds.), 1976,\n<em>Foundations of Probability Theory, Statistical Inference, and\nStatistical Theories of Science</em>, Vol. 1, Dordrecht: Springer\nNetherlands. doi:10.1007/978-94-010-1853-1</li>\n<li>Harper, William L., Robert Stalnaker, and Glenn Pearce (eds.),\n1980, <em>IFS: Conditionals, Belief, Decision, Chance and Time</em>,\nDordrecht: Springer Netherlands. doi:10.1007/978-94-009-9117-0</li>\n<li id=\"ref-hajek1989probabilities\">Hájek, Alan, 1989,\n“Probabilities of Conditionals – Revisited”,\n<em>Journal of Philosophical Logic</em>, 18(4): 423–428.\ndoi:10.1007/BF00262944</li>\n<li id=\"ref-hajek1994hypothesis\">Hájek, Alan, and Hall, Ned,\n1994, “The Hypothesis of the Conditional Construal of\nConditional Probability”, in Eells and Skyrms 1994:\n75–111.</li>\n<li id=\"ref-herzig1996scan\">Herzig, Andreas, 1996, <em>SCAN and\nSystems of Conditional Logic</em> (No. MPI-I-1996-2-007),\nSaarbrücken: Max-Planck-Institut für Informatik.</li>\n<li id=\"ref-huitink2008phd\">Huitink, Janneke, 2008, <em>Modals,\nConditionals and Compositionality</em>, PhD Thesis, Radboud\nUniversity, Nijmegen.</li>\n<li id=\"ref-isaacs2008conditional\">Isaacs, James and Kyle Rawlins,\n2008, “Conditional Questions”, <em>Journal of\nSemantics</em>, 25(3): 269–319. doi:10.1093/jos/ffn003</li>\n<li id=\"ref-jeffrey1963indeterminate\">Jeffrey, Richard C., 1963,\n“On Indeterminate Conditionals”, <em>Philosophical\nStudies</em>, 14(3): 37–43. doi:10.1007/BF00427948</li>\n<li id=\"ref-katmend-91\">Katsuno, Hirofumi and Alberto O. Mendelzon,\n1991, “Propositional Knowledge Base Revision and Minimal\nChange”, <em>Artificial Intelligence</em>, 52(3): 263–294.\ndoi:10.1016/0004-3702(91)90069-V</li>\n<li id=\"ref-katmend-92\">–––, 1992, “On the\nDifference between Updating a Knowledge Base and Revising It”,\nin <em>Belief Revision</em>, Peter Gärdenfors (ed.), Cambridge:\nCambridge University Press, 183–203.\ndoi:10.1017/CBO9780511526664.007</li>\n<li id=\"ref-kaufmann2015conditionals\">Kaufmann, Magdalena and Stefan\nKaufmann, 2015, “Conditionals and Modality”, in <em>The\nHandbook of Contemporary Semantic Theory</em>, Shalom Lappin and Chris\nFox (eds.), 2nd ed., Chichester, UK: John Wiley &amp; Sons,\n237–270. doi:10.1002/9781118882139.ch8</li>\n<li id=\"ref-kaufmann2005conditional\">Kaufmann, Stefan, 2005,\n“Conditional Predictions: A Probabilistic Account”,\n<em>Linguistics and Philosophy</em>, 28(2): 181–231.\ndoi:10.1007/s10988-005-3731-9</li>\n<li id=\"ref-kaufmann2009conditionals\">–––, 2009,\n“Conditionals Right and Left: Probabilities for the Whole\nFamily”, <em>Journal of Philosophical Logic</em>, 38(1):\n1–53. doi:10.1007/s10992-008-9088-0</li>\n<li id=\"ref-kaufmann2013causal\">–––, 2013,\n“Causal Premise Semantics”, <em>Cognitive Science</em>,\n37(6): 1136–1170. doi:10.1111/cogs.12063</li>\n<li id=\"ref-kaufmann2017limit\">–––, 2017, “The\nLimit Assumption”, <em>Semantics and Pragmatics</em>, 10: art.\n18. doi:10.3765/sp.10.18</li>\n<li id=\"ref-kaufmann2009unified\">Kaufmann, Stefan and Magdalena\nSchwager, 2011, “A Unified Analysis of Conditional\nImperatives”, in <em>Proceedings of Semantics and Linguistic\nTheory (SALT) 19, 2009</em>, Ed Cormany, Satoshi Ito, and David Lutz\n(eds.), 239–256. doi:10.3765/salt.v19i0.2545</li>\n<li id=\"ref-klinedinst2009simplification\">Klinedinst, Nathan, 2009,\n“(Simplification of)<sup>2</sup> Disjunctive Antecedents”,\nin <em>Presuppositions and Implicatures: Proceedings of the MIT-Paris\nWorkshop</em>, Paul Égré and Giorgio Magri (eds.),\nCambridge, MA: MIT Working Papers in Linguistics, 135–151.</li>\n<li id=\"ref-kneale1962development\">Kneale, William and Martha Kneale,\n1962, <em>The Development of Logic</em>, Oxford: Oxford University\nPress.</li>\n<li id=\"ref-kratzer-79\">Kratzer, Angelika, 1979, “Conditional\nNecessity and Possibility”, in <em>Semantics from Different\nPoints of View</em>, Rainer Bäuerle, Urs Egli, and Arnim von\nStechow (eds.), Berlin: Springer, 117–147.</li>\n<li id=\"ref-Kratzer\">–––, 1981, “Partition and\nRevision: The Semantics of Counterfactuals”, <em>Journal of\nPhilosophical Logic</em>, 10(2). doi:10.1007/BF00248849</li>\n<li id=\"ref-Kratzer1991\">–––, 1991,\n“Modality”, in <em>Semantics: An International Handbook of\nContemporary Research</em>, Arnim von Stechow and Dieter Wunderlich\n(eds.), Berlin: de Gruyter, 639–650.</li>\n<li id=\"ref-kratzer2012modals\">–––, 2012, <em>Modals\nand Conditionals: New and Revised Perspectives</em>, Oxford: Oxford\nUniversity Press.</li>\n<li id=\"ref-klm\">Kraus, Sarit, Daniel Lehmann, and Menachem Magidor,\n1990, “Nonmonotonic Reasoning, Preferential Models and\nCumulative Logics”, <em>Artificial Intelligence</em>,\n44(1–2): 167–207. doi:10.1016/0004-3702(90)90101-5</li>\n<li id=\"ref-krzyzanowska2013inferential\">Krzyżanowska, Karolina,\nSylvia Wenmackers, and Igor Douven, 2013, “Inferential\nConditionals and Evidentiality”, <em>Journal of Logic, Language\nand Information</em>, 22(3): 315–334.\ndoi:10.1007/s10849-013-9178-4</li>\n<li id=\"ref-lassiter2018complex\">Lassiter, Daniel, 2018,\n“Complex Sentential Operators Refute Unrestricted Simplification\nof Disjunctive Antecedents”, <em>Semantics and Pragmatics</em>,\n11: art. 9. doi:10.3765/sp.11.9</li>\n<li id=\"ref-lassiter2019triviality\">–––, 2020,\n“What We Can Learn from How Trivalent Conditionals Avoid\nTriviality”, <em>Inquiry</em>, 63(9–10): 1087–1114.\ndoi:10.1080/0020174X.2019.1698457</li>\n<li id=\"ref-lehmann-magidor-92\">Lehmann, Daniel and Menachem Magidor,\n1992, “What Does a Conditional Knowledge Base Entail?”,\n<em>Artificial Intelligence</em>, 55(1): 1–60.\ndoi:10.1016/0004-3702(92)90041-U</li>\n<li id=\"ref-levisubjunctives-77\">Levi, Isaac, 1977,\n“Subjunctives, Dispositions and Chances”,\n<em>Synthese</em>, 34(4): 423–455. doi:10.1007/BF00485649</li>\n<li id=\"ref-levi_fsa\">–––, 1996, <em>For the Sake of\nthe Argument: Ramsey Test Conditionals, Inductive Inference and\nNonmonotonic Reasoning</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511720161</li>\n<li id=\"ref-lewis1912implication\">Lewis, Clarence Irving, 1912,\n“Implication and the Algebra of Logic”, <em>Mind</em>,\n21(84): 522–531. doi:10.1093/mind/XXI.84.522</li>\n<li id=\"ref-Lewis1973\">Lewis, David, 1973, <em>Counterfactuals</em>,\nOxford: Basil Blackwell.</li>\n<li id=\"ref-lewis1975adverbs\">–––, 1975,\n“Adverbs of Quantification”, in <em>Formal Semantics of\nNatural Language</em>, Edward L. Keenan (ed.), Cambridge: Cambridge\nUniversity Press, 178–188.</li>\n<li id=\"ref-lewis_76\">–––, 1976,\n“Probabilities of Conditionals and Conditional\nProbabilities”, <em>Philosophical Review</em>, 85(3):\n297–315. doi:10.2307/2184045</li>\n<li id=\"ref-lewis-81\">–––, 1981, “Ordering\nSemantics and Premise Semantics for Counterfactuals”,\n<em>Journal of Philosophical Logic</em>, 10(2): 217–234.\ndoi:10.1007/BF00248850</li>\n<li id=\"ref-lindstrom\">Lindström, Sten, 1994, <em>A Semantic\nApproach to Nonmonotonic Reasoning: Inference Operations and\nChoice</em> (Uppsala Prints and Preprints in Philosophy, 1994, 10),\nUniversity of Uppsala: Department of Philosophy.</li>\n<li id=\"ref-lindstr_rabino-98\">Lindström, Sten and Wlodek\nRabinowicz, 1998, “Conditionals and the Ramsey Test”, in\n<em>Belief Change</em>, Didier Dubois and Henri Prade (eds.),\n(Handbook of Defeasible Reasoning and Uncertainty Management Systems\n3), Dordrecht: Kluwer, 147–188.\ndoi:10.1007/978-94-011-5054-5_4</li>\n<li id=\"ref-lukasiewicz1920three\">Łukasiewicz, Jan, 1920,\n“O logice trójwartościowej” (“On\nThree-Valued Logic”), <em>Ruch Filosoficzny</em>, 5:\n170–171.</li>\n<li id=\"ref-lycan2001real\">Lycan, William G., 2001, <em>Real\nConditionals</em>, Oxford: Clarendon Press.</li>\n<li id=\"ref-maccoll1908if\">MacColl, Hugh, 1908, “`If’and\n`Imply’”, <em>Mind</em>, 17(67): 453–455.\ndoi:10.1093/mind/XVII.3.453</li>\n<li id=\"ref-mackie1962counterfactuals\">Mackie, John Leslie, 1962,\n“Counterfactuals and Causal Laws”, in <em>Analytical\nPhilosophy</em>, R. J. Butler (ed.), Oxford: Blackwell,\n66–80.</li>\n<li id=\"ref-Mandelkern2018import\">Mandelkern, Matthew, 2020,\n“Import‐Export and ‘And’”,\n<em>Philosophy and Phenomenological Research</em>, 100(1):\n118–135. doi:10.1111/phpr.12513</li>\n<li id=\"ref-manor1975propositional\">Manor, Ruth, 1975,\n“Propositional Commitment and Presuppositions”,\n<em>American Philosophical Quarterly</em>, 12(2): 141–149.</li>\n<li id=\"ref-sep-logic-relevance\">Mares, Edwin, 2020, “Relevance\nLogic”, in <em>The Stanford Encyclopedia of Philosophy</em>\n(Summer 2020 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2020/entries/logic-relevance/\" target=\"other\">https://plato.stanford.edu/archives/sum2020/entries/logic-relevance/</a>&gt;</li>\n<li id=\"ref-mcdermott1996truth\">McDermott, Michael, 1996, “On\nthe Truth Conditions of Certain ’If’-Sentences”,\n<em>Philosophical Review</em>, 105(1): 1–37.\ndoi:10.2307/2185762</li>\n<li id=\"ref-McGee1981\">McGee, Vann, 1981, “Finite Matrices and\nthe Logic of Conditionals”, <em>Journal of Philosophical\nLogic</em>, 10(3): 349–351. doi:10.1007/BF00293426</li>\n<li id=\"ref-mcgee1989conditional\">–––, 1989,\n“Conditional Probabilities and Compounds of Conditionals”,\n<em>Philosophical Review</em>, 98(4): 485–541.\ndoi:10.2307/2185116</li>\n<li id=\"ref-mckay1977counterfactuals\">Mckay, Thomas and Peter Van\nInwagen, 1977, “Counterfactuals with Disjunctive\nAntecedents”, <em>Philosophical Studies</em>, 31(5):\n353–356. doi:10.1007/BF01873862</li>\n<li id=\"ref-meyer1973classical\">Meyer, Robert K. and Richard Routley,\n1973, “Classical Relevant Logics. I”, <em>Studia\nLogica</em>, 32(1): 51–66. doi:10.1007/BF02123812</li>\n<li id=\"ref-milne1997finetti\">Milne, Peter, 1997, “Bruno de\nFinetti and the Logic of Conditional Events”, <em>British\nJournal for the Philosophy of Science</em>, 48(2): 195–232.\ndoi:10.1093/bjps/48.2.195</li>\n<li id=\"ref-milne2003simplest\">–––, 2003, “The\nSimplest Lewis-Style Triviality Proof Yet?”, <em>Analysis</em>,\n63(4): 300–303. doi:10.1093/analys/63.4.300</li>\n<li id=\"ref-nute-80\">Nute, Donald, 1980, <em>Topics in Conditional\nLogic</em>, Dordrecht: Reidel. doi:10.1007/978-94-009-8966-5</li>\n<li id=\"ref-NuteCross2001\">Nute, Donald and Charles B. Cross, 2001,\n“Conditional Logic”, in <em>Handbook of Philosophical\nLogic</em>, volume 4, Dov M. Gabbay and Franz Guenthner (eds.), 2nd\ned., Dordrecht: Kluwer, 1–98.\ndoi:10.1007/978-94-017-0456-4_1</li>\n<li id=\"ref-odintsov2010modal\">Odintsov, Sergei P. and Heinrich\nWansing, 2010, “Modal Logics with Belnapian Truth Values”,\n<em>Journal of Applied Non-Classical Logics</em>, 20(3):\n279–301.</li>\n<li id=\"ref-olivetti2007sequent\">Olivetti, Nicola, Gian Luca Pozzato,\nand Camilla B. Schwind, 2007, “A Sequent Calculus and a Theorem\nProver for Standard Conditional Logics”, <em>ACM Transactions on\nComputational Logic</em>, 8(4): art. 22.\ndoi:10.1145/1276920.1276924</li>\n<li>Olkhovikov, Grigory, 2002, “On a new three-valued\nparaconsistent logic”, T. Ferguson (trans.), <em>IFCoLog Journal\nof Logic and Applications</em>, 3 (2016): 317–334; originaly\npublished in Russian, <em>Logic of Law and Tolerance</em>,\nYekaterinburg: Ural State University Press, 2002, pp. 96–113.\n</li>\n<li id=\"ref-omori2019bridge\">Omori, Hitoshi, 2019, “Towards a\nBridge over Two Approaches in Connexive Logic”, <em>Logic and\nLogical Philosophy</em>, 28(3): 553–566.\ndoi:10.12775/LLP.2019.005</li>\n<li id=\"ref-over2017defective\">Over, David and Jean Baratgin, 2017,\n“The ‘Defective’ Truth Table: Its Past, Present, and\nFuture”, in <em>The Thinking Mind: A Festschrift for Ken\nManktelow</em>, Niall Galbraith, Erica Lucas, and David Over (eds.),\nLondon: Routledge, 15–28.</li>\n<li id=\"ref-OverEtAl2007\">Over, David E., Constantinos\nHadjichristidis, Jonathan St. B.T. Evans, Simon J. Handley, and Steven\nA. Sloman, 2007, “The Probability of Causal Conditionals”,\n<em>Cognitive Psychology</em>, 54(1): 62–97.\ndoi:10.1016/j.cogpsych.2006.05.002</li>\n<li id=\"ref-pearl2009causality\">Pearl, Judea, 2009, <em>Causality:\nModels, Reasoning, and Inference</em>, second edition, Cambridge:\nCambridge University Press. doi:10.1017/CBO9780511803161</li>\n<li id=\"ref-pfeifer2014reasoning\">Pfeifer, Niki, 2014,\n“Reasoning About Uncertain Conditionals”, <em>Studia\nLogica</em>, 102(4): 849–866. doi:10.1007/s11225-013-9505-4</li>\n<li id=\"ref-poggiolesi2016natural\">Poggiolesi, Francesca, 2016,\n“Natural Deduction Calculi and Sequent Calculi for\nCounterfactual Logics”, <em>Studia Logica</em>, 104(5):\n1003–1036. doi:10.1007/s11225-016-9662-3</li>\n<li id=\"ref-pollock\">Pollock, John L., 1976, <em>Subjunctive\nReasoning</em>, Dordrecht: Reidel. doi:10.1007/978-94-010-1500-4</li>\n<li id=\"ref-quine1950methods\">Quine, W. V. O., 1950, <em>Methods of\nLogic</em>, New York: Holt.</li>\n<li id=\"ref-raidl-definable-conditionals-20\">Raidl, Eric, 2021,\n“Definable Conditionals”, <em>Topoi</em>, 40(1):\n87–105. doi:10.1007/s11245-020-09704-3</li>\n<li id=\"ref-Ramsey1929\">Ramsey, Frank P., 1931, “General\nPropositions and Causality”, in <em>The Foundations of\nMathematics and Other Logical Essays</em>, Joseph B. Braithwaite\n(ed.), London: Kegan Paul, 237–255.</li>\n<li id=\"ref-reichenbach1935wahr\">Reichenbach, Hans, 1935,\n<em>Wahrscheinlichkeitslehre</em>, Leiden: Sijthoff.</li>\n<li id=\"ref-reichenbach1944philosophic\">–––, 1944,\n<em>Philosophic Foundations of Quantum Mechanics</em>, Berkeley, CA:\nUniversity of California Press.</li>\n<li id=\"ref-reichenbach1949prob\">–––, 1949, <em>The\nTheory of Probability</em>, Berkeley: University of California\nPress.</li>\n<li id=\"ref-rescher1964hypothetical\">Rescher, Nicholas, 1964,\n<em>Hypothetical Reasoning</em>, Amsterdam: North-Holland.</li>\n<li id=\"ref-rooij2019conditionals\">Rooij, Robert van and Katrin\nSchulz, 2019, “Conditionals, Causality and Conditional\nProbability”, <em>Journal of Logic, Language and\nInformation</em>, 28(1): 55–71.\ndoi:10.1007/s10849-018-9275-5</li>\n<li>Rothschild, D., 2014, “Capturing the relationship between\nconditionals and conditional probability with a trivalent\nsemantics”, <em>Journal of Applied Non-Classical\nLogics</em>, 24(1–2), 144–152.\ndoi:10.1080/11663081.2014.911535</li>\n<li id=\"ref-rott_ifs\">Rott, Hans, 1986, “Ifs, Though, and\nBecause”, <em>Erkenntnis</em>, 25(3): 345–370.\ndoi:10.1007/BF00175348</li>\n<li id=\"ref-pmcpbc\">–––, 1993, “Belief\nContraction in the Context of the General Theory of Rational\nChoice”, <em>Journal of Symbolic Logic</em>, 58(4):\n1426–1450. doi:10.2307/2275152</li>\n<li id=\"ref-cci\">–––, 2001, <em>Change, Choice and\nInference: A Study in Belief Revision and Nonmonotonic Reasoning</em>,\nOxford: Oxford University Press.</li>\n<li id=\"ref-reapramsey-11\">–––, 2011,\n“Reapproaching Ramsey: Conditionals and Iterated Belief Change\nin the Spirit of AGM”, <em>Journal of Philosophical Logic</em>,\n40(2): 155–191. doi:10.1007/s10992-011-9177-3</li>\n<li id=\"ref-rott-relevant-ramsey-19\">–––,\nforthcoming, “Difference-Making Conditionals and the Relevant\nRamsey Test”, <em>Review of Symbolic Logic</em>, first online:\n12 December 2019, 1–32. doi:10.1017/S1755020319000674</li>\n<li id=\"ref-ryan-schobbens_counterfactuals-97\">Ryan, Mark D. and\nPierre-Yves Schobbens, 1997, “Counterfactuals and Updates as\nInverse Modalities”, <em>Journal of Logic, Language and\nInformation</em>, 6(2): 123–146.\ndoi:10.1023/A:1008218502162</li>\n<li id=\"ref-sanfilippo2020probabilities\">Sanfilippo, Giuseppe, Angelo\nGilio, David E. Over, and Niki Pfeifer, 2020, “Probabilities of\nConditionals and Previsions of Iterated Conditionals”,\n<em>International Journal of Approximate Reasoning</em>, 121:\n150–173. doi:10.1016/j.ijar.2020.03.001</li>\n<li id=\"ref-sanford1989if\">Sanford, David, 1989, <em>If P, Then Q:\nConditionals and the Foundations of Reasoning</em>, London:\nRoutledge.</li>\n<li id=\"ref-santorio2018alternatives\">Santorio, Paolo, 2018,\n“Alternatives and Truthmakers in Conditional Semantics”,\n<em>Journal of Philosophy</em>, 115(10): 513–549.\ndoi:10.5840/jphil20181151030</li>\n<li id=\"ref-santorio2019interventions\">–––, 2019,\n“Interventions in Premise Semantics”,\n<em>Philosopher’s Imprint</em>, 19: art. 1.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0019.001\" target=\"other\">Santorio 2019 available online</a>]</li>\n<li id=\"ref-santorio2020path\">–––, forthcoming,\n“Path Semantics for Conditionals”, <em>Mind</em>.</li>\n<li id=\"ref-schay1968algebra\">Schay, Geza, 1968, “An Algebra of\nConditional Events”, <em>Journal of Mathematical Analysis and\nApplications</em>, 24(2): 334–344.\ndoi:10.1016/0022-247X(68)90035-8</li>\n<li id=\"ref-schlenker2004conditionals\">Schlenker, Philippe, 2004,\n“Conditionals as Definite Descriptions”, <em>Research on\nLanguage and Computation</em>, 2(3): 417–462.\ndoi:10.1007/s11168-004-0908-2</li>\n<li id=\"ref-schulz2007minimal\">Schulz, Katrin, 2007, <em>Minimal\nModels in Semantics and Pragmatics: Free Choice, Exhaustivity, and\nConditionals</em>, PhD Thesis, Institute for Logic, Language;\nComputation, Amsterdam.</li>\n<li id=\"ref-Schulz2009\">Schulz, Moritz, 2009, “A Note on Two\nTheorems by Adams and McGee”, <em>Review of Symbolic Logic</em>,\n2(3): 509–516. doi:10.1017/S1755020309990189</li>\n<li id=\"ref-segerberg_cond-log-89\">Segerberg, Krister, 1989,\n“Notes on Conditional Logic”, <em>Studia Logica</em>,\n48(2): 157–168. doi:10.1007/BF02770509</li>\n<li id=\"ref-senCCSW-70\">Sen, Amartya K., 1970, <em>Collective Choice\nSocial Welfare</em>, San Francisco: Holden-Day.</li>\n<li>Sextus Empiricus, 2000, <em>Outlines of Skepticism</em>, J. Annas\nand J. Barnes (eds.), Cambridge: Cambridge University Press.</li>\n<li id=\"ref-shanks1995psychology\">Shanks, David R., 1995, <em>The\nPsychology of Associative Learning</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511623288</li>\n<li id=\"ref-skovgaard2016relevance\">Skovgaard-Olsen, Niels, Henrik\nSingmann, and Karl Christoph Klauer, 2016, “The Relevance Effect\nand Conditionals”, <em>Cognition</em>, 150(1): 26–36.\ndoi:10.1016/j.cognition.2015.12.017</li>\n<li>Sobociński, Bolesław, 1952. Axiomatization of a partial\nsystem of three-value calculus of propositions. <em>Journal of\nComputing Systems</em> 1, 23–55.</li>\n<li id=\"ref-spohn2013ranking\">Spohn, Wolfgang, 2013, “A\nRanking-Theoretic Approach to Conditionals”, <em>Cognitive\nScience</em>, 37(6): 1074–1106. doi:10.1111/cogs.12057</li>\n<li id=\"ref-Stalnaker1968\">Stalnaker, Robert C., 1968, “A Theory\nof Conditionals”, in <em>Studies in Logical Theory</em>,\nNicholas Rescher (ed.), Oxford: Blackwell, 98–112.</li>\n<li id=\"ref-stalnaker1970probability\">–––, 1970,\n“Probability and Conditionals”, <em>Philosophy of\nScience</em>, 37(1): 64–80. doi:10.1086/288280</li>\n<li id=\"ref-stalnaker1975indicative\">–––, 1975,\n“Indicative Conditionals”, <em>Philosophia</em>, 5(3):\n269–286. doi:10.1007/BF02379021</li>\n<li id=\"ref-stalnaker1980defense\">–––, 1980,\n“A Defense of Conditional Excluded Middle”, in Harper,\nStalnaker, and Pearce 1980: 87–104.\ndoi:10.1007/978-94-009-9117-0_4</li>\n<li id=\"ref-stalnaker1994conditionals\">Stalnaker, Robert C. and\nRichard Jeffrey, 1994, “Conditionals as Random Variables”,\nin Eells and Skyrms 1994: 31–46.</li>\n<li id=\"ref-starr2014uniform\">Starr, William B., 2014a, “A\nUniform Theory of Conditionals”, <em>Journal of Philosophical\nLogic</em>, 43(6): 1019–1064. doi:10.1007/s10992-013-9300-8</li>\n<li id=\"ref-starr2015whatif\">–––, 2014b, “What\n‘If’?”, <em>Philosopher’s Imprint</em>, 14:\nart. 10.\n [<a href=\"http://hdl.handle.net/2027/spo.3521354.0014.010\" target=\"other\">Starr 2014 available online</a>]</li>\n<li id=\"ref-sep-counterfactuals\">–––, 2019,\n“Counterfactuals”, in <em>The Stanford Encyclopedia of\nPhilosophy</em> (Fall 2019 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/counterfactuals/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/counterfactuals/</a>&gt;</li>\n<li id=\"ref-suzu\">Suzumura, Kotaro, 1983, <em>Rational Choice,\nCollective Decisions, and Social Welfare</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9780511897993</li>\n<li id=\"ref-unterhuber2014completeness\">Unterhuber, Matthias and\nGerhard Schurz, 2014, “Completeness and Correspondence in\nChellas–Segerberg Semantics”, <em>Studia Logica</em>,\n102(4): 891–911. doi:10.1007/s11225-013-9504-5</li>\n<li id=\"ref-delval94\">del Val, Alvaro, 1994, “On the Relation\nBetween the Coherence and Foundations Theories of Belief\nRevision”, in <em>Proceedings of the Twelfth National Conference\nof the American Association on Artificial Intelligence\n(AAAI’94)</em>, Barbara Hayes-Roth and Richard E. Korf (eds.),\nMenlo Park, CA: AAAI Press, 909–914.</li>\n<li id=\"ref-veltman-76\">Veltman, Frank, 1976, “Prejudices,\nPresuppositions and the Theory of Counterfactuals”, in\n<em>Amsterdam Papers of Formal Grammar</em>, volume 1, Jeroen\nGroenendijk and Martin Stokhof (eds.), Centrale Interfaculteit,\nUniversiteit van Amsterdam, 248–281.</li>\n<li id=\"ref-Veltman\">–––, 1985, <em>Logics for\nConditionals</em>, PhD Thesis, University of Amsterdam,\nAmsterdam.</li>\n<li id=\"ref-veltman1996defaults\">–––, 1996,\n“Defaults in Update Semantics”, <em>Journal of\nPhilosophical Logic</em>, 25(3): 221–261.\ndoi:10.1007/BF00248150</li>\n<li id=\"ref-veltman2005making\">–––, 2005,\n“Making Counterfactual Assumptions”, <em>Journal of\nSemantics</em>, 22(2): 159–180. doi:10.1093/jos/ffh022</li>\n<li>Weiss, Yale, 2019, “Sextus Empiricus’ Fourth\nConditional and Containment Logic”, <em>History and Philosophy\nof Logic</em>, 40(4), 307–322.\ndoi:10.1080/01445340.2019.1647083</li>\n<li id=\"ref-russell1910principia\">Whitehead, Alfred North, and\nBertrand Russell, 1910, <em>Principia Mathematica</em>, Vol. 1,\nCambridge: Cambridge University Press.</li>\n<li id=\"ref-yalcin2007epistemic\">Yalcin, Seth, 2007, “Epistemic\nModals”, <em>Mind</em>, 116(464): 983–1026.\ndoi:10.1093/mind/fzm983</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "conditionals",
            "conditionals: counterfactual",
            "Lewis, Clarence Irving",
            "logic: connexive",
            "logic: relevance",
            "probability, interpretations of"
        ],
        "entry_link": [
            {
                "../conditionals/": "conditionals"
            },
            {
                "../counterfactuals/": "conditionals: counterfactual"
            },
            {
                "../lewis-ci/": "Lewis, Clarence Irving"
            },
            {
                "../logic-connexive/": "logic: connexive"
            },
            {
                "../logic-relevance/": "logic: relevance"
            },
            {
                "../probability-interpret/": "probability, interpretations of"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-conditionals\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/logic-conditionals/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=logic-conditionals&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/logic-conditionals/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-conditionals": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/logic-conditionals/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=logic-conditionals&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/logic-conditionals/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Arlo-Costa, Horacio, “The Logic of Conditionals”,\n<em>Stanford Encyclopedia of Philosophy</em> (Summer 2021 Edition),\nEdward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/sum2021/entries/logic-conditionals/\">https://plato.stanford.edu/archives/sum2021/entries/logic-conditionals/</a>&gt;.\n [This was the previous entry on this topic in the <em>Stanford\nEncyclopedia of Philosophy</em> — see the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-conditionals\" target=\"other\">version history</a>.]"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/sum2021/entries/logic-conditionals/": "https://plato.stanford.edu/archives/sum2021/entries/logic-conditionals/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logic-conditionals": "version history"
            }
        ]
    }
}