{
    "url": "logical-form",
    "title": "Logical Form",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Paul Pietroski\n<paul.pietroski@rutgers.edu>",
        "author_links": [
            {
                "https://philosophy.rutgers.edu/people/regular-faculty/regular-faculty-profile/182-regular-faculty-full-time/917-pietroski-paul": "Paul Pietroski"
            },
            {
                "mailto:paul%2epietroski%40rutgers%2eedu": "paul.pietroski@rutgers.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://philosophy.rutgers.edu/people/regular-faculty/regular-faculty-profile/182-regular-faculty-full-time/917-pietroski-paul\" target=\"other\">Paul Pietroski</a>\n&lt;<a href=\"mailto:paul%2epietroski%40rutgers%2eedu\"><em>paul<abbr title=\" dot \">.</abbr>pietroski<abbr title=\" at \">@</abbr>rutgers<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Oct 19, 1999",
        "substantive revision Wed Sep 1, 2021"
    ],
    "preamble": "\nLogical FormFirst published Tue Oct 19, 1999; substantive revision Wed Sep 1, 2021\n\nSome inferences are impeccable. Examples like (1–3) illustrate\nreasoning that cannot lead from true premises to false\nconclusions.\n\n(1)\nJohn danced if Mary sang, and Mary sang; so John\ndanced.\n(2)\nEvery politician is deceitful, and every senator is\na politician; so every senator is deceitful.\n(3)\nThe detective is in the garden; so someone is in\nthe garden.\n\n\nIn such cases, a thinker takes no epistemic risk by endorsing the\nconditional claim that the conclusion is true if the\npremises are true. The conclusion follows from the premises, without\nany further assumptions that might turn out to be false. Any risk of\nerror lies with the premises, as opposed to the reasoning. By\ncontrast, examples like (4–6) illustrate reasoning that involves\nat least some risk of going wrong—from correct premises to a\nmistaken conclusion.\n\n(4)\nJohn danced if Mary sang, and John danced; so Mary\nsang.\n(5)\nEvery feathered biped is a bird, and Tweety is a\nfeathered biped; so Tweety can fly.\n(6)\nEvery human born before 1879 died; so every human\nwill die.\n\n\nInference (4) is not secure. John might dance whenever Mary sings, but\nalso sometimes when Mary doesn’t sing. Similarly, with regard to\n(5), Tweety might be a bird that cannot fly. Even (6) falls short of\nthe demonstrative character exhibited by (1–3). While laws of\nnature may preclude immortality, the conclusion of (6) goes beyond its\npremise, even if it is foolish to resist the inference.\n\nAppeals to logical form arose in the context of attempts to say more\nabout this intuitive distinction between impeccable inferences, which\ninvite metaphors of security, and inferences that involve some risk of\nslipping from truth to falsity. The idea is that some inferences, like\n(1–3), are structured in a way that confines any risk\nof error to the premises. The motivations for developing this idea\nwere both practical and theoretical. Experience teaches us that an\ninference can initially seem more secure than it is; and if we knew\nwhich forms of inference are risk-free, that might help us\navoid errors. As we’ll see, claims about inference are also\nintimately connected with claims about the nature of thought and its\nrelation to language.\n\nMany philosophers have been especially interested in the possibility\nthat grammar masks the underlying structure of thought,\nperhaps in ways that invite mistaken views about how ordinary language\nis related to cognition and the world we talk about. For example,\nsimilarities across sentences like ‘Homer talked’,\n‘Nobody talked’, and ‘The nymph talked’\ninitially suggest that the corresponding thoughts exhibit a common\nsubject-predicate form. But even if ‘Homer’ indicates an\nentity that can be the subject of a thought that is true if and only\nif the entity in question talked, ‘Nobody’ does not; and\nas we’ll see, ‘The’ is complicated. Philosophers and\nlinguists have also asked general questions about how logic is related\nto grammar. Do thoughts and sentences exhibit different kinds\nof structure? Do sentences exhibit grammatical structures\nthat are not obvious? And if the logical structure of a thought can\ndiverge from the grammatical structure of a sentence that is used to\nexpress the thought, how should we construe proposals about the\nlogical forms of inferences like (1)–(6)? Are such proposals\nnormative claims about how we ought to think/talk, or empirical\nhypotheses about aspects of psychological/linguistic reality?\n\nProposed answers to these questions are usually interwoven with claims\nabout why various inferences seem compelling. So it would be nice to\nknow which inferences really are secure, and in virtue of what these\ninferences are special. The most common suggestion has been that\ncertain inferences are secure by virtue of their logical form. Though\nunsurprisingly, conceptions of form have evolved along with\nconceptions of logic and language.\n",
    "toc": [
        {
            "#pat": "1. Patterns of Reason"
        },
        {
            "#prop": "2. Propositions and Traditional Grammar"
        },
        {
            "#mot": "3. Motivations for Revision"
        },
        {
            "#freg": "4. Frege and Formal Language"
        },
        {
            "#des": "5. Descriptions and Analysis"
        },
        {
            "#reg": "6. Regimentation and Communicative Slack "
        },
        {
            "#not": "7. Notation and Restricted Quantification"
        },
        {
            "#tran": "8. Transformational Grammar"
        },
        {
            "#sem": "9. Semantic Structure and Events"
        },
        {
            "#fq": "10. Further Questions"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Patterns of Reason\n\nOne ancient idea is that impeccable inferences exhibit patterns that\ncan be characterized schematically by abstracting away from the\nspecific contents of particular premises and conclusions, thereby\nrevealing a general form common to many other impeccable inferences.\nSuch forms, along with the inferences that exemplify them, are said to\nbe valid.\n\nGiven a valid inference, there is a sense in which the premises\ncontain the conclusion, which is correspondingly extractable from the\npremises. With regard to (1) and (7), it seems especially clear that\nthe conclusion is part of the first premise, and that the second\npremise is another part of the first.\n\n(1)\nJohn danced if Mary sang, and Mary sang; so John\ndanced.\n(7)\nChris swam if Pat was asleep, and Pat was asleep;\nso Chris swam.\n\n\nWe can express this point by saying that these inferences are\ninstances of the following form: B if\nA, and A; so B. The\n Stoics\n discussed several patterns of this kind, using ordinal numbers\n(instead of letters) to capture abstract forms like the ones shown\nbelow.\n\n\nIf the first then the second, and\nthe first; so the second.\n\nIf the first then the second, but\nnot the second; so not the\nfirst.\n\nEither the first or the second, but\nnot the second; so the first.\n\nNot both the first and the second,\nbut the first; so not the\nsecond.\n\n\nThese schematic formulations employ variables, indicated in bold.\nFollowing a long tradition, let’s use the word\n‘proposition’ as a term of art for whatever these\nvariables range over.\n Propositions\n are potential premises/conclusions, which can be endorsed or\nrejected. So they are, presumably, things that can be evaluated for\ntruth or falsity. This leaves room for various proposals about what\npropositions are: sentences, statements, states of affairs, etc. But\nlet’s assume that declarative sentences can be used to express\npropositions; see, e.g., Cartwright (1962) and the essay on\n structured propositions.\n\nA significant complication is that in ordinary conversation, the\ncontext matters with regard to which proposition is expressed with a\ngiven sentence. For example, ‘Pat is asleep’ can be used\nat one time to express a true premise, and at another time to express\na false premise. A certain speaker might use ‘I am tired’\nto express a false proposition, while another speaker uses the same\nsentence at the same time to express a true proposition. What counts\nas being tired can also vary across conversations. Context\nsensitivity, of various kinds, is ubiquitous in typical discourse.\nMoreover, even given a context, a sentence like ‘He is\nbald’ may not express a unique proposition. (There may be no\nreferent for the pronoun; and even if there is, the\n vagueness\n of ‘bald’ may yield a range of candidate propositions,\nwith no fact of the matter as to which one is the proposition\nexpressed.) Still, we can and often do use sentences like ‘Every\ncircle is an ellipse’ and ‘Thirteen is a prime\nnumber’ to express premises of valid arguments. To be sure,\nmathematical examples are special cases. But the distinction between\nimpeccable and risky inferences is not limited to atypical contexts in\nwhich we try to think especially clearly about especially abstract\nmatters. So when focusing on the phenomenon of valid inference, we can\ntry to simplify the initial discussion by abstracting away from the\ncontext sensitivity of language use.\n\nAnother complication is that in speaking of an inference, one might be\ntalking about (i) a process in which a thinker draws a conclusion from\nsome premises, or (ii) some propositions, one of which is designated\nas an alleged consequence of the others; see, e.g., Harman (1973). But\nwe can describe a risky thought process as one in which a thinker who\naccepts certain propositions—perhaps tentatively or\nhypothetically—comes to accept, on that basis, a proposition\nthat does not follow from the initial premises. And it will be simpler\nto focus on premises/conclusions, as opposed to episodes of\nreasoning.\n\nWith regard to (1), the inference seems secure in part\nbecause its first premise has the form\n‘B if A’.\n\n(1)\nJohn danced if Mary sang, and Mary sang; so John\ndanced.\n\n\nIf the first premise didn’t have this form, the inference\nwouldn’t be an instance of ‘B if\nA, and A; so\nB’. It isn’t obvious that all\nimpeccable inferences are instances of a more general valid form, much\nless inferences whose impeccability is due to the forms of the\nrelevant propositions. But this thought has served as an ideal for the\nstudy of valid inference, at least since Aristotle’s treatment\nof examples like (2).\n\n(2)\nEvery senator is a politician, and every politician\nis deceitful; so every senator is deceitful.\n\n\nAgain, the first premise seems to have several parts, each of which is\na part of the second premise or the conclusion. (In English, the\nindefinite article in ‘Every senator is a politician’\ncannot be omitted; likewise for ‘Every politician is a\nliar’. But at least for now, let’s assume that in examples\nlike these, ‘a’ does not itself indicate a propositional\nconstituent.)\n Aristotle,\n predating the Stoics, noted that conditional claims like the\nfollowing are sure to be true: if (the property of) being a politician\nbelongs to every senator, and being deceitful belongs to every\npolitician, then being deceitful belongs to every senator.\nCorrespondingly, the inference pattern below is valid.\n\nEvery S is P, and every P is D; so\nevery S is D.\n\n\nAnd inference (2) seems to be valid because its parts exhibit this\npattern. Aristotle discussed many such forms of inference, called\nsyllogisms, involving propositions that can be expressed with\nquantificational words like ‘every’ and\n‘some’. For example, the syllogistic patterns below are\nalso valid.\n\n\nEvery S is P, and some S is D; so\nsome P is D.\n\nSome S is P, and every P is D; so\nsome S is D.\n\nSome S is not P, every D is P; so\nsome S is not D.\n\n\nWe can rewrite the last two, so that each of the valid syllogisms\nabove is represented as having a first premise of the form\n‘Every S is P’.\n\n\nEvery S is P, and some D is S; so\nsome D is P.\n\nEvery S is P, and some D is not P;\nso some D is not S.\n\n\nBut however the inferences are represented, the important point is\nthat the variables—represented here in italics—range over\ncertain parts of propositions. Intuitively, common nouns like\n‘politician’ and adjectives like ‘deceitful’\nare general terms, since they can apply to more than one individual.\nAnd many propositions apparently contain correspondingly general\nelements. For example, the proposition that every senator is wealthy\ncontains two such elements, both relevant to the validity of\ninferences involving this proposition.\n\nPropositions thus seem to have structure that bears on the validity of\ninferences, even ignoring premises/conclusions with propositional\nparts. In this sense, even atomic propositions have logical form. And\nas Aristotle noted, pairs of such propositions can be related in\ninteresting ways. If every S is P, then some\nS is P. (For these purposes, assume there is at\nleast one S.) If no S is P, then some\nS is not P. It is certain that either every\nS is P or some S is not P; and\nwhichever of these propositions is true, the other is false.\nSimilarly, the following propositions cannot both be true: every\nS is P; and no S is P. But it\nisn’t certain that either every S is P, or no\nS is P. Perhaps some S is P, and\nsome S is not P. This network of logical relations\nstrongly suggests that the propositions in question contain a\nquantificational element and two general elements—and in some\ncases, an element of negation; see\n logic: classical.\n This raises the question of whether other propositions have a similar\nstructure.\n 2. Propositions and Traditional Grammar\n\nConsider the proposition that Vega is a star, which can figure in\ninferences like (8).\n\n(8)\nEvery star is purple, and Vega is a star; so Vega\nis purple.\n\n\nAristotle’s logic focused on quantificational propositions; and\nas we shall see, this was prescient. But on his view, propositions\nlike the conclusion of (8) still exemplify a subject-predicate\nstructure that is shared by at least many of the sentences we used to\nexpress propositions. And one can easily formulate the schema\n‘every S is P, and n is S;\nso n is P’, where the new lower-case variable\nis intended to range over proposition-parts of the sort indicated by\nnames. (On some views, discussed below, a name like ‘Vega’\nis a complex quantificational expression; though unsurprisingly, such\nviews are tendentious.)\n\nTypically, a declarative sentence can be divided into a subject and a\npredicate: ‘Every star / is purple’, ‘Vega / is a\nstar’, ‘Some politician / lied’, ‘The\nbrightest planet / is visible tonight’, etc. Until quite\nrecently, it was widely held that this grammatical division reflects a\ncorresponding kind of logical structure: the subject of a proposition\n(i.e., what the proposition is about) is a target for predication. On\nthis view, both ‘Every star’ and ‘Vega’\nindicate subjects of propositions in (8), while ‘is’\nintroduces predicates. Aristotle would have said that in the premises\nof (8), being purple is predicated of every star, and being a star is\npredicated of Vega. Later theorists emphasized the contrast between\ngeneral terms like ‘star’ and singular terms like\n‘Vega’, while also distinguishing terms from\nsyncategorematic expressions (e.g., ‘every’ and\n‘is’) that can combine with terms to form complex subjects\nand predicates, including ‘will lie’, ‘can\nlie’, and ‘may have lied’. But despite the\ncomplications, it seemed clear that many propositions have the\nfollowing canonical form: Subject-copula-Predicate; where a copula\nlinks a subject, which may consist of a quantifier and a general term,\nto a general term. Sentences like ‘Every star twinkles’\ncan be paraphrased with sentences like ‘Every star is a\ntwinkling thing’. This invites the suggestion that\n‘twinkles’ is somehow an abbreviation for ‘is a\ntwinkling thing’.\n\nThe proposition that not only Vega twinkles, which seems to contain\nthe proposition that Vega twinkles, presumably includes elements that\nare indicated with ‘only’ and ‘not’. Such\nexamples invite the hypothesis that all propositions are composed of\nterms along with a relatively small number of syncategorematic\nelements, and that complex propositions can be reduced to canonical\npropositions that are governed by Aristotelian logic. This is not to\nsay that all propositions were, or could be, successfully analyzed in\nthis manner. But via this strategy, medieval logicians were able to\ndescribe many impeccable infereces as instances of valid forms. And\nthis informed their discussions of how logic is related to\ngrammar.\n\nMany viewed their project as an attempt to uncover principles of a\nmental language common to all thinkers. Aristotle had said, similarly,\nthat spoken sounds symbolize “affections of the soul.”\nFrom this perspective, one expects to find some differences between\npropositions and overt sentences. If ‘Every star twinkles’\nexpresses a proposition that contains a copula, then spoken languages\nmask certain aspects of logical structure.\n William of Ockham\n held that a mental language would have no need for Latin’s\ndeclensions, and that logicians could ignore such aspects of spoken\nlanguage. The ancient Greeks were aware of sophisms like the\nfollowing: that dog is a father, and that dog is yours; so that dog is\nyour father. This bad inference cannot share its form with the\nsuperficially parallel but impeccable variant: that dog is a mutt, and\nthat mutt is yours; so that dog is your mutt. (See Plato, Euthydemus\n298 d-e.) So the superficial features of sentences are not infallible\nguides to the logical forms of propositions. Still, the divergence was\nheld to be relatively minor. Spoken sentences have structure; they are\ncomposed, in systematic ways, of words. And the assumption was that\nspoken sentences reflect the major aspects of propositional form,\nincluding a subject-predicate division. So while there is a\ndistinction between the study of valid inference and the study of\nsentences used in spoken language, the connection between logic and\ngrammar was thought to run deep. This suggested that the logical form\nof a proposition just is the grammatical form of some (perhaps mental)\nsentence.\n3. Motivations for Revision\n\nTowards the end of the eighteenth century, Kant could say (without\nmuch exaggeration) that logic had followed a single path since its\ninception, and that “since Aristotle it has not had to retrace a\nsingle step.” He also said that syllogistic logic was “to\nall appearance complete and perfect.” But this was exuberance.\nThe successes also highlighted problems that had been recognized.\n\nSome valid schemata are reducible to others, in that any inference of\nthe reducible form can be revealed as valid (with a little work) given\nother schemata. Consider (9).\n\n(9)\nIf Al ran then either Al did not run or Bob did not\nswim, and Al ran; so Bob did not swim.\n\n\nAssume that ‘Al did not run’ negates ‘Al ran’,\nwhile ‘Bob did not swim’ negates ‘Bob swam’.\nThen (9) is an instance of the following valid form: if\nA then either not-A or\nnot-B, and A; so\nnot-B. But we can treat this as a derived form, by\nshowing that any instance of this form is valid given two (intuitively\nmore basic) Stoic inference forms: if the first then\nthe second, and the first, so\nthe second; either not the first or\nnot the second, and the first; so\nnot the second. For suppose we are given the\nfollowing premises: A; and if A,\nthen either not-A or not-B. We can\nsafely infer that either not-A or\nnot-B; and since we were given A, we\ncan safely infer not-B. Similarly, the syllogistic\nschema (10) can be treated as a derived form.\n\n(10)\nSome S is not P, and every\nD is P; so not every S is D.\n\n\nIf some S is not P, and every D is\nP, then it isn’t true that every S is\nD. For if every S is D, and every\nD is P, then every S is P. But\nif some S is not P, then as we saw above,\nnot every S is P. So given the premises of (10),\nadding ‘every S is D’ would lead to\ncontradiction: every S is P, and not every\nS is P. So the premises imply the negation of\n‘every S is D’. This reasoning shows how\n(10) can be reduced to inferential patterns that seem more\nbasic—raising the question of how much reduction is possible.\nEuclid’s geometry had provided a model for how to present a body\nof knowledge as a network of propositions that follow from a few basic\naxioms. Aristotle himself indicated how to reduce all the valid\nsyllogistic schemata to four basic patterns, given a few principles\nthat govern how the basic patterns can be used to derive others; see\nParsons (2014) for discussion. And further reduction is possible given\ninsights from the medieval period.\n\nConsider the following pair of valid inferences: Fido is a brown dog,\nso Fido is a dog; Fido is not a dog, so Fido is not a brown dog. As\nillustrated with the first example, replacing a predicate (or general\nterm) like ‘brown dog’ with a less restrictive\npredicate like ‘dog’ is often valid. But\nsometimes—paradigmatically, in cases involving\nnegation—replacing a predicate like ‘dog’ with a\nmore restrictive predicate like ‘brown dog’ is\nvalid. Plausibly, the first pattern reflects the default direction of\nvalid replacement: removing a restriction preserves truth, except in\nspecial cases like those involving negation. Suppose we take it as\ngiven that poodles are dogs of a particular sort, and hence that every\npoodle is a dog. Then replacing‘poodle’ with\n‘dog’ in ‘Fido is P’ is valid,\nregardless of what ‘Fido’ names. This can be viewed as a\nspecial case of ‘n is P, and every P\nis D; so n is D’. But the validity of\nthis inference form can also be viewed as symptom of a basic principle\nthat came be called dictum de omni: whatever is true of every\nP is true of any P. Or as Aristotle might have put\nit, if the property of being a dog belongs to every poodle, then it\nbelongs to any poodle. In which case, Fido is a dog if Fido is a\npoodle. And since the property of being a dog surely belongs to every\nbrown dog, any brown dog is a dog. The flip side of this point is that\nnegation inverts the default direction of inference. Anything that\nisn’t a dog isn’t a brown dog; and similarly, if Fido\nisn’t a dog, then Fido isn’t a poodle. So in special\ncases, adding a restriction to a general term like ‘dog’\ncan preserve truth.\n\nFrom this perspective, the Aristotelian quantifier ‘Some’\nis a default-style quantifier that validates removing\nrestrictions. If some brown dog is a clever mutt, it follows that some\ndog is a clever mutt, and hence that some dog is a mutt. By contrast,\n‘No’ is an inverted-style quantifier that validates\nadding restrictions. If no dog is a mutt, it follows that no\ndog is a clever mutt, and hence that no brown dog is a clever mutt.\nThe corresponding principle, dictum de nullo, encodes this\npattern: whatever is true of no P is not true of any\nP; so if the property of being a mutt belongs to no dog, it\nbelongs to no poodle. (And as Aristotle noted, instances of ‘No\nS is P’ can be analyzed as the propositional\nnegations of corresponding instances of ‘Some S\nisn’t P’.)\n\nInterestingly, ‘Every’ is like ‘No’ in one\nrespect, and like ‘Some’ in another respect. If every dog\nis clever, it follows that every brown dog is clever; but if every dog\nis a clever mutt, it follows that every dog is a mutt. So when the\nuniversal quantifier combines with a general term S to form a\nsubject, S is governed by the inverted rule of\nreplacement. But when a universally quantified subject combines with a\nsecond general term to form a proposition, this second term is\ngoverned by the default rule of replacement. Given that\n‘Every’ has this mixed logical character, the valid\nsyllogisms can be derived from two basic patterns (noted above), both\nof which reflect dictum de omni: whatever is true of every\nP is true of any P.\n\n\nEvery S is P, and every P is D; so\nevery S is D.\n\nEvery S is P, and some D is S; so\nsome D is P.\n\n\nThe first principle reflects the sense in which universal\nquantification is transitive. The second principle captures the idea\nthat the universal premise can license replacement of\n‘S’ with ‘P’ in a\nproposition about some individual. In this sense, classical logic\nexhibits a striking unity and simplicity, at least with regard to\ninferences involving the Aristotelian quantifiers and predication. For\nfurther discussion, see Sommers (1984), van Bentham (1986), Sanchez\n(1991, 1994), and Ludlow (2005).\n\nAlas, matters become more complicated once we consider relations.\n\nSentences like ‘Juliet kissed Romeo’ do not seem to have\nSubject-copula-Predicate form. One might suggest ‘Juliet was a\nkisser of Romeo’ as a paraphrase. But ‘kisser of\nRomeo’ differs, in ways that matter to inference, from general\nterms like ‘politician’. If Juliet (or anyone) was a\nkisser of Romeo, it follows that someone was kissed; whereas if Juliet\nwas a politician, there is no corresponding logical consequence to the\neffect that someone was __-ed. Put another way, the proposition that\nJuliet kissed someone exhibits interesting logical structure, even if\nwe can express this proposition via the sentence ‘Juliet was a\nkisser of someone’. A quantifier can be part of a complex\npredicate. But classical logic did not capture the validity of\ninferences involving predicates that have quantificational\nconstituents. Consider (11).\n\n(11)\nSome patient respects every doctor, and some doctor\nis a liar; so some patient respects some liar.\n\n\nIf ‘respects every doctor’ and ‘respects some\nliar’ indicate nonrelational proposition-parts, much like\n‘is sick’ or ‘is happy’, then inference (11)\nhas the following form ‘Some P is S, and some\nD is L; so some P is H’. But\nthis schema, which fails to reflect the quantificational structure\nwithin the predicates is not valid. Its instances include bad\ninferences like the following: some patient is sick, and some doctor\nis a liar; so some patient is happy. This dramatizes the point that\n‘respects every doctor’ and ‘respects some\nliar’ are—unlike ‘is sick’ and ‘is\ntall’—logically related in a way that matters given the\nsecond premise of (11).\n\nOne can adopt the view that many propositions have relational parts,\nintroducing a variable ‘R’ intended to range over\nrelations; see the entries on\n medieval relations,\n and\n medieval terms.\n One can also formulate the following schema: some P R\nevery D, and some D is L; so some\nP R some L. But the problem remains.\nQuantifiers can appear in complex predicates that figure in valid\ninferences like (12).\n\n(12)\nEvery patient who respects every doctor is sick,\nand\n\nsome patient who saw every lawyer respects every doctor; so\n\nsome patient who saw every lawyer is sick.\n\n\nBut if ‘patient who respects every doctor’ and\n‘patient who saw every lawyer’ are nonrelational, much\nlike ‘old patient’ or ‘young patient’, then\n(12) has the following form: every O is S, and some\nY R every D; so some Y is\nS. And many inferences of this form are invalid. For example:\nevery otter is sick, and some yak respects every doctor; so some yak\nis sick. Again, one can abstract a valid schema that covers (12),\nletting parentheses indicate a relative clause that restricts the\nadjacent predicate.\n\nEvery P(R1 every D) is S, and some\nP(R2 every L) R1 every D; so\nsome P(R2 every L) is S.\n\n\nBut no matter how complex the schema, the relevant predicates can\nexhibit further quantificational structure. (Consider the proposition\nthat every patient who met some doctor who saw no lawyer\nrespects some lawyer who saw no patient who met every\ndoctor.) Moreover, schemata like the one above are poor\ncandidates for basic inference patterns.\n\nAs medieval logicians knew, propositions expressed with relative\nclauses also pose other difficulties; see the entry on\n medieval syllogism.\n If every doctor is healthy, it follows that every young doctor is\nhealthy. By itself, this is expected, since a universally quantified\nsubject licenses replacement of ‘doctor’ with the more\nrestrictive predicate ‘young doctor’. But consider (13)\nand (14).\n\n(13)\nNo patient who saw every young doctor is\nhealthy.\n(14)\nNo patient who saw every doctor is healthy.\n\n\nHere, the direction of valid inference is from ‘young\ndoctor’ to ‘doctor’, as if the inference is governed\nby the (default) inference rule that licenses replacement of\n‘young doctor’ with the less restrictive predicate\n‘doctor’. One can say that the default direction of\nimplication, from more restrictive to less restrictive predicates, has\nbeen inverted twice—once by ‘No’, and once by\n‘every’. But one wants a systematic account of\npropositional structure that explains the net effect; see Ludlow\n(2002) for further discussion. Sommers (1982) offers a strategy for\nrecoding and extending classical logic, in part by exploiting an idea\nsuggested by\n Leibniz\n (and arguably Pāṇini): a relational sentence like\n‘Juliet loved Romeo’ somehow combines an active-voice\nsentence with a passive-voice sentence, perhaps along the lines of\n‘Juliet loved, and thereby Romeo was loved’; cp.\n section nine.\n But one way or another, quantifiers need to be characterized in a way\nthat captures their general logical role—and not just their role\nas potential subjects of Aristotelian propositions—if\nimpeccability is to be revealed as a matter of form. Quantifiers are\nnot simply devices for creating schemata like ‘Every S\nis P’, into which general terms like\n‘politician’ and ‘deceitful’ can be inserted.\nInstances of ‘S’ and ‘P’ can\nthemselves have quantificational structure and relational\nconstituents.\n4. Frege and Formal Language\n\nGottlob Frege\n showed how to resolve these difficulties for classical logic in one\nfell swoop. His system of logic, published in 1879 and still in use\n(with notational modifications), was arguably the single greatest\ncontribution to the subject. So it is significant that on\nFrege’s view, propositions do not have subject-predicate form.\nIndeed, his leading idea was that propositions have\n“function-argument” structure. Frege thereby drew a\nsubstantial distinction between logical form and grammatical form as\ntraditionally conceived. This had a major impact on subsequent\ndiscussions of thought and its relation to language. Though before\nturning to details, it is worth taking a slight detour to note that\nFrege did not think of functions as abstract objects like\nnumbers.\n\nEvery function maps each entity in some domain onto exactly one entity\nin some range. But while every function thus determines a set of\nordered pairs, Frege (1891) did not identify functions with such sets.\nHe said that a function “by itself must be called incomplete, in\nneed of supplementation, or unsaturated. And in this respect functions\ndiffer fundamentally from numbers (p. 133).” For example, we can\nrepresent the successor function as follows, with the natural numbers\nas the relevant domain for the variable ‘\\(x\\)’: \\(S(x) = x + 1\\).\nThis function maps zero onto one, one onto two, and so on. So we can\nspecify the set \\(\\{\\langle x, y \\rangle : y = x + 1\\}\\) as the\n“value-range” of the successor function. But according to\nFrege, any particular argument (e.g., the number one) “goes\ntogether with the function to make up a complete whole” (e.g.,\nthe number two); and a number does not go together with a set to form\na unit in this fashion. Frege granted that the word\n‘function’ is often used to talk about the sets he would\ncall value-ranges. But he maintained that the notion of an\n“unsaturated” function, which may be applied to endlessly\nmany arguments, is logically prior to any notion of a set with\nendlessly many elements that are specified functionally; see p.135,\nnote E. While the second positive integer is the successor of the\nfirst, the number two is still a single thing, distinct from any\ncombination of a number with a set. Frege was influenced by\n Kant’s discussion of judgment,\n the kind of unity that a\n (structured) proposition\n exhibits, and the ancient observation that merely combining two\nthings (e.g., Socrates and the property of being mortal) does not make\nthe combination true or false. If it helps, think about\n‘\\(S(x)\\)’—or better, ‘\\(S(\\ )\\)’—as the\nunsaturated result of abstracting away from the numerical argument in\na complex denoting expression like ‘\\(S(1)\\)’ or\n‘\\(S(62)\\)’; and think about saturating ‘\\(S(\\ )\\)’\nwith a numerical argument, like ‘1’ or ‘62’,\nas a process of “de-abstraction.” So in saying that\npropositions have “function-argument” structure, Frege was\nnot only rejecting the traditional idea that logical from reflects the\nsubject-predicate structure of ordinary sentences, he was suggesting\nthat propositions (and any of their complex constituents) exhibit a\nkind of unity that is like the unity of ‘\\(S(1)\\)’, which can\nappear in invented arithmetic sentences like ‘\\(S(1) = 2\\)’.\nChurch (1941) echoed Frege by distinguishing functions-in-intension,\nwhich Church identified with computational procedures, from their\nextensions. Perhaps Frege would have said that even procedures, as\nabstractions of a special kind, are too object-like to be functions in\nhis special sense. But distinct procedures can determine the same\nextension. (Compare adding one to a natural number n with the\nfollowing procedure: take the positive square root of the result of\nadding one to n squared plus n doubled.) So at least\nin this sense, functions-in-intension can be distinguished from the\nextensions they determine; cp. Chomsky’s (1986) contrast between\nI-languages and E-languages.\n\nFor purposes of capturing valid arguments concerning relations, the\nmore important point is that functions need not be unary. For example,\narithmetic division can be represented as a function from ordered\npairs of numbers onto quotients: \\(Q(x, y) = \\frac{x}{y}\\). Mappings can also be\nconditional. Consider the function that maps every even integer onto\nitself, and every odd integer onto its successor: \\(C(x) = x\\) if \\(x\\) is\neven, and \\(x + 1\\) otherwise; \\(C(1) = 2\\), \\(C(2) = 2\\), \\(C(3) = 4\\), etc. Frege\nheld that propositions have parts that correspond to functions, and in\nparticular, conditional functions that map arguments onto special\nvalues that reflect the truth or falsity of propositions/sentences.\n(As discussed below, Frege [1892] also distinguished these\n“truth values” from what he called Thoughts [Gedanken] or\nthe “senses” [Sinnen] of propositions; where each of these\nsentential senses “presents” a truth value in certain\nway—i.e., as the value of a certain indicated function given a\ncertain indicated argument.)\n\nVariable letters, such as ‘\\(x\\)’ and ‘\\(y\\)’ in\n‘\\(Q(x, y) = \\frac{x}{y}\\)’, are typographically convenient for\nrepresenting functions that take more than one argument. But we could\nalso index argument places, as shown below.\n\n\\[\nQ[(\\ )_i, (\\ )_j] = \\frac{(\\ )_i}{(\\ )_j}\n\\]\n\n\nOr we could replace the subscripts above with lines that connect each\npair of round brackets on the left of ‘\\(=\\)’ to a\ncorresponding pair of brackets on the right. But the idea, however we\nencode it, is that a proposition has at least one constituent that is\nsaturated by the requisite number of arguments.\n\nOn Frege’s view, the proposition that Mary sang has a functional\ncomponent corresponding to ‘sang’ and an argument\ncorresponding to ‘Mary’, even if the English sentence\n‘Mary sang’ has ‘Mary’ as its subject and\n‘sang’ as its predicate. The proposition can be\nrepresented as follows: \\(\\textrm{Sang}(\\textrm{Mary})\\). Frege thought of the relevant\nfunction as a conditional mapping from individuals to truth values:\n\\(\\textrm{Sang}(x) = \\textbf{T}\\) if \\(x\\) sang, and \\(\\textbf{F}\\)\notherwise; where ‘\\(\\textbf{T}\\)’ and\n‘\\(\\textbf{F}\\)’ stand for special entities such that\nfor each individual \\(x\\), \\(\\textrm{Sang}(x) = \\textbf{T}\\) if and only if \\(x\\)\nsang, and \\(\\textrm{Sang}(x) = \\textbf{F}\\) if and only if \\(x\\) did not sing.\nAccording to Frege, the proposition that John admires Mary combines an\nordered pair of arguments with a functional component that corresponds\nto the transitive verb: \\(\\textrm{Admires}(\\textrm{John}, \\textrm{Mary})\\); where for any individual\n\\(x\\), and any individual \\(y\\), \\(\\textrm{Admires}(x, y) = \\textbf{T}\\) if \\(x\\)\nadmires \\(y\\), and \\(\\textbf{F}\\) otherwise. From this perspective,\nthe structure and constituents are the same in the proposition that\nMary is admired by John, even though ‘Mary’ is the\ngrammatical subject of the passive sentence. Likewise, Frege did not\ndistinguish the proposition that three precedes four from the\nproposition that four is preceded by three. More importantly,\nFrege’s treatment of quantified propositions departs radically\nfrom the traditional idea that the grammatical structure of sentence\nreflects the logical structure of the indicated proposition.\n\nIf \\(S\\) is the function corresponding to ‘sang’, then Mary\nsang iff—i.e., if and only if—\\(S(\\textrm{Mary}) =\n\\textbf{T}\\). Likewise, someone sang iff: \\(S\\) maps some individual\nonto \\(\\textbf{T}\\); that is, for some individual \\(x\\), \\(S(x) =\n\\textbf{T}\\). Or using a modern variant of Frege’s\noriginal notation, someone sang iff \\(\\exists x [S(x)]\\). The quantifier\n‘\\(\\exists x\\)’ is said to bind the variable ‘\\(x\\)’,\nwhich ranges over individual things in a domain of discourse. (For\nnow, assume that the domain contains only people.) If every individual\nin the domain sang, then \\(S\\) maps every individual onto the truth value\n\\(\\textbf{T}\\); or using formal notation, \\(\\forall x [S(x)]\\). A\nquantifier binds each occurrence of its variable, as in\n‘\\(\\exists x [P(x) \\land D(x)]\\)’,\nwhich reflects the logical form of ‘Someone is both a politician\nand deceitful’. In this last example, the quantifier combines\nwith a complex functional component that is formed by conjoining two\nsimpler ones.\n\nWith regard to the proposition that some politician is deceitful,\ntraditional grammar suggests the division ‘Some politician / is\ndeceitful’, with the noun ‘politician’ combining\nwith the quantificational word to form a complex subject. But on a\nFregean view, grammar masks the logical division between the\nexistential quantifier and the rest: \\(\\exists x [P(x) \\land D(x)]\\). With\nregard to the proposition that every politician is deceitful, Frege\nalso stresses the logical division between the quantifier and its\nscope: \\(\\forall x [P(x) \\rightarrow D(x)]\\); every individual is deceitful if a\npolitician. Here too, the quantifier combines with a complex\nfunctional component, albeit one that is conditional rather than\nconjunctive. (The formal sentence ‘\\(\\forall x [P(x) \\land D(x)]\\)’\nimplies, unconditionally, that every individual is a\npolitician.) As Frege (1879) defined his analogs of the modern symbols\nused here, ‘\\(P(x) \\rightarrow D(x)\\)’ is equivalent to\n‘\\(\\lnot P(x) \\lor D(x)\\)’, and\n‘\\(\\forall x\\)’ is equivalent to ‘\\(\\lnot \\exists\n\\lnot\\)’. So ‘\\(\\forall x [P(x) \\rightarrow D(x)]\\)’\nis equivalent to ‘\\(\\lnot \\exists x \\lnot\n[\\lnot P(x) \\lor D(x)]\\)’; and given de Morgan’s\nLaws (concerning the relations between negation, disjunction, and\nconjunction), \\(\\lnot \\exists x \\lnot [\\lnot P(x) \\lor D(x)]\\) iff\n\\(\\lnot \\exists x [P(x) \\land \\lnot D(x)]\\). Hence, \\(\\forall x [P(x)\n\\rightarrow D(x)]\\) iff \\(\\lnot \\exists x [P(x) \\land \\lnot\nD(x)]\\). This captures the idea that every politician is deceitful iff\nno individual is both a politician and not deceitful.\n\nIf this conception of logical form is correct, then grammar is\nmisleading in several respects. First, grammar leads us to think that\n‘some politician’ indicates a constituent of the\nproposition that some politician is deceitful. Second, grammar masks a\ndifference between existential and universally quantified\npropositions; predicates are related conjunctively in the former, and\nconditionally in the latter. (Though as discussed in\n section seven,\n one can—and Frege [1884] did—adopt a different view that\nallows for relational/restricted quantifiers as in\n‘\\(\\forall x{:}P(x) [D(x)]\\)’.)\n\nMore importantly, Frege’s account was designed to apply equally\nwell to propositions involving relations and multiple quantifiers. And\nwith regard to these propositions, there seems to be a big difference\nbetween logical structure and grammatical structure.\n\nOn Frege’s view, a single quantifier can bind an unsaturated\nposition that is associated with a function that takes a single\nargument. But it is equally true that two quantifiers can bind two\nunsaturated positions associated with a function that takes a pair of\narguments. For example, the proposition that everyone likes everyone\ncan be represented with the formal sentence\n‘\\(\\forall x \\forall y [L(x, y)]\\)’. Assuming that\n‘Romeo’ and ‘Juliet’ indicate arguments, it\nfollows that Romeo likes everyone, and that everyone likes\nJuliet—\\(\\forall y [L(r, y)]\\) and \\(\\forall x [L(x, j)]\\). And it follows\nfrom all three propositions that Romeo likes Juliet: \\(L(r, j)\\). The\nrules of inference for Frege’s logic capture this general\nfeature of the universal quantifier. A variable bound by a universal\nquantifier can be replaced with a name for some individual in the\ndomain. Correlatively, a name can be replaced with a variable bound by\nan existential quantifier. Given that Romeo likes Juliet, it follows\nthat someone likes Juliet, and Romeo likes someone. Frege’s\nformalism can capture this as well: \\(L(r, j)\\); so \\(\\exists x [L(x, j)] \\land \\exists x [L(r, x)]\\).\nAnd given either conjunct in the conclusion,\nit follows that someone likes someone: \\(\\exists x \\exists y [L(x, y)]\\). A\nsingle quantifier can also bind multiple argument positions, as in\n‘\\(\\exists x [L(x, x)]\\)’, which is true iff someone likes\nherself. Putting these points schematically:\n\\(\\forall x (\\dots x \\dots)\\), so \\(\\dots n \\dots\\); and\n\\(\\dots n \\dots\\), so \\(\\exists x (\\dots x \\dots)\\).\n\nMixed quantification introduces an interesting wrinkle. The\npropositions expressed with ‘\\(\\exists x \\forall y [L(x, y)]\\)’\nand ‘\\(\\forall y \\exists x [L(x, y)]\\)’ differ. We can paraphrase\nthe first as ‘there is someone who likes everyone’ and the\nsecond as ‘everyone is liked by someone or other’. The\nsecond follows from the first, but not vice versa. This suggests that\n‘someone likes everyone’ is ambiguous, in that this string\nof English words can be used to express two different propositions.\nThis in turn raises difficult questions about what natural language\nexpressions are, and how they can be used to express propositions; see\n section eight.\n But for Frege, the important point concerned the distinction between\nthe propositions (Gedanken). Similar remarks apply to\n‘\\(\\forall x \\exists y [L(x, y)]\\)’ and\n‘\\(\\exists y \\forall x [L(x, y)]\\)’.\n\nA related phenomenon is exhibited by ‘John danced if Mary sang\nand Chris slept’. Is the intended proposition of the form\n‘(A if B) and\nC’ or ‘A if\n(B and C)’? Indeed, it seems\nthat the relation between word-strings and propositions expressed is\noften one-to-many. Is someone who says ‘The artist drew a\nclub’ talking about a sketch or a card game? One can use\n‘is’ to express identity, as in ‘Hesperus is the\nplanet Venus’; but in ‘Hesperus is bright’,\n‘is’ indicates predication. In ‘Hesperus is a\nplanet’, ‘a’ seems to be logically inert; yet in\n‘John saw a planet’, ‘a’ seems to indicate\nexistential quantification: \\(\\exists x [P(x) \\land S(j, x)]\\). (One can\nrender ‘Hesperus is a planet’ as ‘\\(\\exists x [P(x) \\land h = x]\\)’.\nBut this treats ‘is a planet’ as\nimportantly different than ‘is bright’; and this leads to\nother difficulties.) According to Frege, such ambiguities provide\nfurther evidence that natural language is not suited to the task of\nrepresenting propositions and inferential relations perspicuously.\n(Leibniz and others had envisioned a “Characteristica\nUniversalis”, but without detailed proposals for how to proceed\nbeyond syllogistic logic in creating one.) This is not to deny that\nnatural language is well suited for other purposes, perhaps including\nefficient human communication. And Frege held that we often do use\nnatural language to express propositions. But he suggested that\nnatural language is like the eye, whereas a good formal language is\nlike a microscope that reveals structure not otherwise observable. On\nthis view, the logical form of a proposition is made manifest by the\nstructure of a sentence in an ideal formal language—what Frege\ncalled a Begriffsschrift (concept-script); where the sentences of such\na language exhibit function-argument structures that differ in kind\nfrom the grammatical structures exhibited by the sentences we use in\nordinary communication.\n\nThe real power of Frege’s strategy for representing\npropositional structure is most evident in his discussions of proofs\nby induction, the Dedekind-Peano axioms for arithmetic, and how the\nproposition that every number has a successor is logically related to\nmore basic truths of arithmetic; see the entry on\n Frege’s theorem and foundations for arithmetic.\n But without getting into these details, one can get a sense of\nFrege’s improvement on previous logic by considering\n(15–16) and Fregean analyses of the corresponding\npropositions.\n\n(15)\nEvery patient respects some doctor\n\n\\(\\forall x \\{P(x) \\rightarrow \\exists y [D(y) \\land R(x,y)]\\}\\)\n(16)\nEvery old patient respects some doctor\n\n\\(\\forall x \\{[O(x) \\land P(x)] \\rightarrow \\exists y [D(y) \\land R(x,y)]\\}\\)\n\n\n\nSuppose that every individual has the following conditional property:\nif he\\(_x\\) is a patient, then some individual is such\nthat she\\(_y\\) is both a doctor and respected by\nhim\\(_x\\). Then it follows—intuitively and given\nthe rules of Frege’s logic—that every\nindividual\\(_x\\) has the following conditional property:\nif he\\(_x\\) is both old and a patient, then some\nindividual\\(_y\\) is such that she\\(_y\\) is\nboth a doctor and respected by him\\(_x\\). So the\nproposition expressed with (16) follows from the one expressed with\n(15). More interestingly, we can also account for why the proposition\nexpressed with (14) follows from the one expressed with (13).\n\n(13)\nNo patient who saw every young doctor is healthy\n\n\\(\\neg \\exists x \\{P(x) \\land \\forall y \\{[Y(y) \\land D(y)] \\rightarrow S(x,y)\\} \\land H(x)\\}\\)\n\n(14)\nNo patient who saw every doctor is healthy\n\n\\(\\neg \\exists x \\{P(x) \\land \\forall y [D(y) \\rightarrow S(x,y)] \\land H(x)\\}\\)\n\n\nFor suppose it is false that some individual has the following\nconjunctive property: he\\(x\\) is a patient; and\nhe\\(x\\) saw every young doctor (i.e., every\nindividual\\(y\\) is such that if she\\(y\\)\nis a young doctor, then he\\(x\\) saw\nher\\(y\\)); and he\\(x\\) is healthy. Then\nintuitively, and also given the rules of Frege’s logic, it is\nfalse that some individual has the following conjunctive property:\nhe\\(x\\) is a patient; and he\\(x\\) saw\nevery doctor; and he\\(x\\) is healthy. This captures the\nfact that the direction of valid inference is from ‘every young\ndoctor’ in (13) to ‘every doctor’ in (14), despite\nthe fact that in simpler cases, replacing ‘every doctor’\nwith ‘every young doctor’ is valid. More generally,\nFrege’s logic handles a wide range of inferences that had\npuzzled medieval logicians. But the Fregean logical forms seem to\ndiffer dramatically from the grammatical forms of sentences like\n(13–16). Frege concluded that we need a Begriffsschrift,\ndistinct from the languages we naturally speak, to depict (and help us\ndiscern) the structures of the propositions we can somehow express by\nusing ordinary sentences in contexts.\n\nFrege also made a different kind of contribution, which would prove\nimportant, to the study of propositions. In early work, he spoke as\nthough propositional constituents were the relevant functions and\n(ordered n-tuples of) entities that such functions map to\ntruth-values. But he later refined this view in light of his\ndistinction between Sinn and Bedeutung; see the entry on\n Frege.\n The Sinn of an expression was said to be a “way of\npresenting” the corresponding Bedeutung, which might be an\nentity (with truth-values as special cases of\nentities) or a function from (ordered n-tuples of) entities to\ntruth-values. The basic idea is that two names, like\n‘Hesperus’ and ‘Phosphorus’, can present the\nsame Bedeutung in different ways; in which case, the Sinn of the first\nname differs from the Sinn of the second. Given this distinction, we\ncan think of ‘Hesperus’ as an expression that presents\nVenus as the evening star, while ‘Phosphorus’\npresents Venus as the morning star. Likewise, we can think of\n‘is bright’ as an expression that presents a certain\nfunction in a certain way, and ‘Hesperus is bright’ as a\nsentence that presents its truth-value in a certain way—i.e., as\nthe value of the function in question given the argument in question.\nFrom this perspective, propositions are sentential ways of presenting\ntruth-values, and proposition-parts are subsentential ways of\npresenting functions and arguments. Frege could thus distinguish the\nproposition that Hesperus is bright from the proposition that\nPhosphorus is bright, even though the two propositions are alike with\nregard to the relevant function and argument. Likewise, he could\ndistinguish the trivial proposition Hesperus is Hesperus from the\n(apparently nontrivial) proposition Hesperus is Phosphorus. This is an\nattractive view. For intuitively, the inference ‘Hesperus is\nHesperus, so Hesperus is Phosphorus’ is not an instance of the\nfollowing obviously valid schema: A, so\nA. But this raised questions about what the Sinn of\nan expression really is, what “presentation” could amount\nto, and what to say about a name with no Bedeutung.\n5. Descriptions and Analysis\n\nFrege did not distinguish (or at least did not emphasize any\ndistinction between) names like ‘John’ and descriptions\nlike ‘the boy’ or ‘the tall boy from Canada’.\nInitially, both kinds of expression seem to indicate arguments, as\nopposed to functions. So one might think that the logical form of\n‘The boy sang’ is simply ‘\\(S(b)\\)’, where\n‘\\(b\\)’ is an unstructured symbol that stands for the boy in\nquestion (and presents him in a certain way). But this makes the\nelements of a description logically irrelevant. And this seems wrong.\nIf the tall boy from Canada sang, then some boy from Canada sang.\nMoreover, ‘the’ implies uniqueness in a way that\n‘some’ does not. Of course, one can say ‘The boy\nsang’ without denying that universe contains more than one boy.\nBut likewise, in ordinary conversation, one can say ‘Everything\nis in the trunk’ without denying that the universe contains some\nthings not in the trunk. And intuitively, a speaker who uses\n‘the’ does imply that the adjacent predicate is satisfied\nby exactly one contextually relevant thing.\n\nBertrand Russell\n held that these implications reflect the logical form of a\nproposition expressed (in a given context) with a definite\ndescription. On his view, ‘The boy sang’ has the following\nlogical form:\n\n\\[\\exists x \\{\\textrm{Boy}(x) \\land \\forall y [\\textrm{Boy}(y) \\rightarrow y = x] \\land S(x)\\}\n\\]\n\n\nsome individual\\(x\\) is such that\nhe\\(x\\) is a boy, and every (relevant)\nindividual\\(y\\) is such that if he\\(y\\) is\na boy, then he\\(y\\) is identical with\nhim\\(x\\), and he\\(x\\) sang. The awkward\nmiddle conjunct was Russell’s way of expressing uniqueness with\nFregean tools; cf.\n section seven.\n But rewriting the middle conjunct would not affect Russell’s\ntechnical point, which is that ‘the boy’ does not\ncorrespond to any constituent of the formalism. This in turn reflects\nRussell’s central claim—viz., that while a speaker may\nrefer to a certain boy in saying ‘The boy sang’, the boy\nin question is not a constituent of the proposition indicated.\nAccording to Russell, the proposition has the form of an existential\nquantification with a bound variable. It does not have the\nform of a function saturated by (an argument that is) the boy referred\nto. The proposition is general rather than singular. In this respect,\n‘the boy’ is like ‘some boy’ and ‘every\nboy’; though on Russell’s view, not even ‘the’\nindicates a constituent of the proposition expressed.\n\nThis extended Frege’s idea that natural language misleads us\nabout the structure of the propositions we assert. Russell went on to\napply this hypothesis to what became a famous puzzle. Even though\nFrance is currently kingless, ‘The present king of France is\nbald’ can be used to express a proposition. The sentence is not\nmeaningless; it has implications. So if the proposition consists of a\nfunction indicated with ‘\\(\\textrm{Bald}(\\ )\\)’ and an argument\nindicated with ‘The present king of France’, there must\nbe an argument that is indicated. But appeal to nonexistent\nkings is, to say the least, dubious. Russell concluded that ‘The\npresent king of France is bald’ expresses a quantificational\nproposition:\n\n\\[\\exists x \\{K(x) \\land \\forall y [K(y) \\rightarrow y = x] \\land B(x)\\};\n\\]\n\n\nwhere \\(K(x) = \\textbf{T}\\) iff \\(x\\) is a present king of\nFrance, and \\(B(x) = \\textbf{T}\\) iff \\(x\\) is bald. (For present\npurposes, set aside worries about the vagueness of\n‘bald’.) And as Russell noted, the following contrary\nreasoning is spurious: every proposition is true or false; so the\npresent king of France is bald or not; so there is a king of France,\nand he is either bald or not. For let P be the\nproposition that the king of France is bald. Russell held that\nP is indeed true or false. On his view, it is false.\nGiven that \\(\\neg \\exists x [K(x)]\\), it follows that\n\n\\[\n\\neg \\exists x \\{K(x) \\land \\forall y [K(y) \\rightarrow y = x] \\land B(x)\\}.\n\\]\n\n\nBut it does not follow\nthat there is a present king of France who is either bald or not.\nGiven that \\(\\neg \\exists x [K(x)]\\), it hardly follows that\n\n\\[\\exists x \\{K(x) \\land [B(x) \\lor \\neg B(x)]\\}.\\]\n\n\nSo we must not confuse the negation of\nP with the following false proposition:\n\n\\[\\exists x \\{K(x) \\land \\forall y [K(y) \\rightarrow y = x] \\land \\neg B(x)\\}.\n\\]\n\n\nThe ambiguity of natural language may foster such confusion, given\nexamples like ‘The present king of France is bald or\nnot’. But according to Russell, puzzles about\n“nonexistence” can be resolved without special\nmetaphysical theses, given the right views about logical form and\nnatural language.\n\nThis invited the thought that other philosophical puzzles might\ndissolve if we properly understood the logical forms of our\nclaims.\n Ludwig Wittgenstein\n argued, in his influential Tractatus Logico-Philosophicus,\nthat: (i) the very possibility of meaningful sentences, which can be\ntrue or false depending on how the world is, requires propositions\nwith structures of the sort that Frege and Russell were getting at;\n(ii) all propositions are logical compounds of—and thus\nanalyzable into—atomic propositions that are inferentially\nindependent of one another; though (iii) even simple natural language\nsentences may correspond to very complex propositions; and (iv) the\nright analyses would, given a little reflection, reveal all\nphilosophical puzzles as confusions about how language is related to\nthe world. Wittgenstein later noted that examples like ‘This is\nred’ and ‘This is yellow’ present difficulties for\nhis earlier view. (If the expressed propositions are unanalyzable, and\nthus logically independent, each should be compatible with the other;\nbut at least so far, no one has provided a plausible analysis that\naccounts for the apparent impeccability of ‘This is red, so this\nis not yellow’. This raises questions about whether all\ninferential security is due to logical form.) And in any case, Russell\ndid not endorse (iv). But he did say, for reasons related to certain\nepistemological puzzles, that (a) we are directly acquainted\nwith the constituents of those propositions into which every\nproposition (that we can grasp) can be analyzed; (b) at least\ntypically, we are not directly acquainted with the mind-independent\nbearers of proper names; and so (c) the things we typically refer to\nwith names are not constituents of basic propositions.\n\nThis led Russell to say that natural language names are disguised\ndescriptions. On this view, ‘Hesperus’ is semantically\nassociated with a complex predicate—say, for illustration, a\npredicate of the form ‘\\(E(x) \\land S(x)\\)’, suggesting\n‘evening star’. In which case, ‘Hesperus is\nbright’ expresses a proposition of the form \n\n\\[\\lsquo\\exists x \\{[E(x) \\land S(x)] \\land\n\\forall y \\{[E(y) \\land S(y)] \\rightarrow y = x\\} \\land\nB(x)\\}\\rsquo.\n\\]\n\n\nIt also follows that Hesperus exists iff\n\\(\\exists x [E(x) \\land S(x)]\\); and this would be challenged by\nKripke (1980) and others; see the entries on\n rigid-designators\n and\n names.  But by analyzing names as\n descriptions—quantificational expressions, as opposed to logical\nconstants (like ‘\\(b\\)’) that indicate\nindividuals—Russell offered an attractive account of why the\nproposition that Hesperus is bright differs from the proposition that\nPhosphorus is bright. Instead of saying that propositional\nconstituents are Fregean senses, Russell could say that\n‘Phosphorus is bright’ expresses a proposition of the\nform\n\n\\[\\lsquo\\exists x \\{[M(x) \\land S(x)] \\land\n\\forall y \\{[M(y) \\land S(y)] \\rightarrow y = x\\} \\land\nB(x)\\}\\rsquo ;\\]\n\n\nwhere ‘\\(E(x)\\)’ and\n‘\\(M(x)\\)’ indicate different functions, specified\n(respectively) in terms of evenings and mornings. This leaves room for\nthe discovery that the complex predicates ‘\\(E(x) \\land\nS(x)\\)’ and ‘\\(M(x) \\land S(x)\\)’ both indicate\nfunctions that map Venus and nothing else to the\ntruth-value T.  The hypothesis was that the\npropositions expressed with ‘Hesperus is bright’ and\n‘Phosphorus is bright’ have different (fundamental)\nconstituents, even though Hesperus is Phosphorus, but not because\npropositional constituents are “ways of presenting”\nBedeutungen. Similarly, the idea was that the propositions expressed\nwith ‘Hesperus is Hesperus’ and ‘Hesperus is\nPhosphorus’ differ, because only the latter has\npredicational/unsaturated constituents corresponding to\n‘Phosphorus’. Positing unexpected logical forms seemed to\nhave explanatory payoffs.\n\nQuestions about names and descriptions are also related to\npsychological reports, like ‘Mary thinks Venus is bright’,\nwhich present puzzles of their own; see the entry on\n propositional attitude reports.\n Such reports seem to indicate propositions that are neither atomic\nnor logical compounds of simpler propositions. For as Frege noted,\nreplacing one name with another name for the same object can\napparently affect the truth of a psychological report. If Mary fails\nto know that Hesperus is Venus, she might think Venus is a planet\nwithout thinking Hesperus is a planet; though cp. Soames (1987, 1995,\n2002) and see the entry on\n singular propositions.\n Any function that has the value T given Venus as\nargument has the value T given Hesperus as argument.\nSo Frege, Russell, and Wittgenstein all held—in varying\nways—that psychological reports are also misleading with respect\nto the logical forms of the indicated propositions.\n6. Regimentation and Communicative Slack\n\nWithin the analytic tradition inspired by these philosophers, it\nbecame a commonplace that logical form and grammatical form typically\ndiverge, often in dramatic ways. This invited attempts to provide both\nanalyses of propositions and claims about natural language, with the\naim of saying how relatively simple sentences (with subject-predicate\nstructures) could be used to express propositions (with\nfunction-argument structures).\n\nThe logical positivists explored the idea that the meaning of a\nsentence is a procedure for determining the truth or falsity of that\nsentence. From this perspective, studies of linguistic meaning and\npropositional structure still dovetail, even if natural language\nemploys “conventions” that make it possible to indicate\ncomplex propositions with grammatically simple sentences; see the\nentry on\n analysis.\n But to cut short a long and interesting story, there was little\nsuccess in formulating “semantic rules” that were\nplausible both as (i) descriptions of how ordinary speakers understand\nsentences of natural language, and (ii) analyses that revealed logical\nstructure of the sort envisioned. (And until Montague [1970],\ndiscussed briefly in the next section, there was no real progress in\nshowing how to systematically associate quantificational constructions\nof natural language with Fregean logical forms.)\n\nRudolf Carnap,\n one of the leading positivists, responded to difficulties facing his\nearlier views by developing a sophisticated position according to\nwhich philosophers could (and should) articulate alternative sets of\nconventions for associating sentences of a language with propositions.\nWithin each such language, the conventions would determine what\nfollows from what. But one would have to decide, on broadly pragmatic\ngrounds, which interpreted language was best for certain purposes\n(like conducting scientific inquiry). On this view, questions about\n“the” logical form of an ordinary sentence are in part\nquestions about which conventions one should adopt. The idea was that\n“internal” to any logically perspicuous linguistic scheme,\nthere would be an answer to the question of how two sentences are\ninferentially related. But “external” questions, about\nwhich conventions we should adopt, would not be settled by descriptive\nfacts about how we understand languages that we already use.\n\nThis was, in many ways, an attractive development of Frege’s\nvision. But it also raised a skeptical worry. Perhaps the structural\nmismatches between sentences of a natural language and sentences of a\nFregean Begriffsschrift are so severe that one cannot formulate\ngeneral rules for associating the sentences we ordinarily use with\npropositions. Later theorists would combine this view with the idea\nthat propositions are sentences of a\n mental language\n that is relevantly like Frege’s invented language and\nrelevantly unlike the spoken languages humans use to communicate; see\nFodor (1975, 1978). But given the rise of\n behaviorism,\n both in philosophy and psychology, this variant on a medieval idea\nwas initially ignored or ridiculed. (And it does face difficulties;\nsee\n section eight.)\n\nWillard Van Orman Quine\n combined behaviorist psychology with a normative conception of\nlogical form similar to Carnap’s. The result was an influential\nview according to which there is no fact of the matter about which\nproposition a speaker/thinker expresses with a sentence of natural\nlanguage, because talk of propositions is (at best) a way of talking\nabout how we should regiment our verbal behavior for certain\npurposes—and in particular, for purposes of scientific inquiry.\nOn this view, claims about logical form are evaluative, and such\nclaims are underdetermined by the totality of facts concerning\nspeakers’ dispositions to use language. From this perspective,\nmismatches between logical and grammatical form are to be expected,\nand we should not conclude that ordinary speakers have mental\nrepresentations that are isomorphic with sentences of a Fregean\nBegriffsschrift.\n\nAccording to Quine, speakers’ behavioral dispositions constrain\nwhat can be plausibly said about how to best regiment their language.\nHe also allowed for some general constraints on interpretability that\nan idealized “field linguist” might impose in coming up\nwith a regimented interpretation scheme.\n (Donald Davidson\n developed a similar line of thought in a less behavioristic idiom,\nspeaking in terms of constraints on a “Radical\nInterpreter,” who seeks “charitable” construals of\nalien speech.) But unsurprisingly, this left ample room for\n“slack” with respect to which logical forms should be\nassociated with a given sentential utterance.\n\nQuine also held that decisions about how to make such associations\nshould be made holistically. As he sometimes put it, the\n“unit of translation” is an entire language, not a\nparticular sentence. On this view, one can translate a sentence\nS of a natural language NL with a structurally mismatching\nsentence µ of a formal language FL, even if it seems (locally)\nimplausible that S is used to express the proposition\nassociated with µ, so long as the following condition is met:\nthe association between S and µ is part of a general\naccount of NL and FL that figures in an overall theory—which\nincludes an account of language, logic, and the language-independent\nworld—that is among the best overall theories available. This\nholistic conception of how to evaluate proposed regimentations of\nnatural language was part and parcel of Quine’s criticism of the\nearly positivists’\n analytic-synthetic distinction,\n and his more radical suggestion that there is no such distinction\n\nThe suggestion was that even apparently tautologous sentences, like\n‘Bachelors are unmarried’ and ‘Caesar died if Brutus\nkilled him’, have empirical content. These may be among the last\nsentences we would dissent from, faced with recalcitrant experience;\nwe may prefer to say that Caesar didn’t really die, or that\nBrutus didn’t really kill him, if the next best alternative is\nto deny the conditional claim. But for Quine, every meaningful claim\nis a claim that could turn out to be false—and so a claim we\nmust be prepared, at least in principle, to reject. Correlatively, no\nsentences are known to be true simply by knowing what they mean and\nknowing a priori that sentences with such meanings must be\ntrue.\n\nFor present purposes, we can abstract away from the details of debates\nabout whether Quine’s overall view was plausible. Here, the\nimportant point is that claims about logical form were said to be (at\nleast partly) claims about the kind of regimented language we\nshould use, not claims about the propositions actually\nexpressed with sentences of natural language. And one aspect of\nQuine’s view, about the kind of regimented language we\nshould use, turned out to be especially important for\nsubsequent discussions of logical form. For even among those who\nrejected the behavioristic assumptions that animated Quine’s\nconception of language, it was often held that logical forms are\nexpressions of a first-order predicate calculus.\n\nFrege’s Begriffsschrift, recall, was designed to capture the\nDedekind-Peano axioms for arithmetic, including the axiom of\ninduction; see the entry on\n Frege’s theorem and foundations for arithmetic.\n This required quantification into positions occupiable by predicates,\nas well as positions occupiable by names. Using modern notation, Frege\nallowed for formulae like ‘\\((Fa \\land Fb) \\rightarrow \\exists X (Xa \\land Xb)\\)’\nand ‘\\(\\forall x \\forall y [x = y \\leftrightarrow \\forall X (Xx \\leftrightarrow Xy)]\\)’.\nAnd he took second-order\nquantification to be quantification over functions. This is to say,\nfor example, that ‘\\(\\exists X (Xa \\land Xb)\\)’ is true iff:\nthere is a function, \\(X\\), that maps both the individual called\n‘\\(a\\)’ and the individual called ‘\\(b\\)’ onto the\ntruth-value T. Frege also took it to be a truth of\nlogic that for any predicate \\(P\\), there is a function such that\nfor each individual \\(x\\), that function maps \\(x\\) to T iff\n\\(x\\) satisfies (or “falls under”) \\(P\\). In which case,\nfor each predicate, there is the set of all and only the things that\nsatisfy the predicate. The axioms for Frege’s logic thus\ngenerated\n Russell’s paradox, \n\ngiven predicates like ‘is not a member of itself’. This\ninvited attempts to weaken the axioms, while preserving\nsecond-order quantification. But for various reasons, Quine and others\nadvocated a restriction to a first-order fragment of Frege’s\nlogic, disallowing quantification into positions occupied by\npredicates.  (Kurt Gödel had proved the\ncompleteness of first-order predicate calculus, thus providing a\npurely formal criterion for what followed from what in that\nlanguage. Quine also held that second-order quantification illicitly\ntreated predicates as names for sets, thereby spoiling Frege’s\nconception of propositions as unified by virtue of having unsaturated\npredicational constituents that are satisfied by things denoted by\nnames.) On Quine’s view, we should\nreplace\n\n\\[\\lsquo (Fa \\land Fb) \\rightarrow \\exists X\n(Xa \\land Xb)\\rsquo\\]\n\n with explicit first-order quantification\nover sets, as in\n\n\\[\\lsquo (Fa \\land Fb) \\rightarrow\n\\exists s (a \\in s \\land b \\in s)\\rsquo ;\\]\n\n\nwhere ‘\\(\\in\\)’ stands for ‘is an element of’,\nand this second conditional is not a logical truth, but rather a\nhypothesis (to be evaluated holistically) concerning sets.\n\nThe preference for first-order regimentations has come to seem\nunwarranted, or at least highly tendentious; see Boolos (1998). But it\nfueled the idea that logical form can diverge wildly from grammatical\nform. For as students quickly learn, first-order regimentations of\nnatural sentences often turn out to be highly artificial. (And in some\ncases, such regimentations seem to be unavailable.) This was, however,\ntaken to show that natural languages are far from ideal for purposes\nof indicating logical structure.\n\nA different strand of thought in analytic philosophy—pressed by\nWittgenstein in Philosophical Investigations and developed by\nothers, including\n Peter Strawson\n and\n John Austin—also\n suggested that a single sentence could be used (on different\noccasions) to express different kinds of propositions. Strawson (1950)\nargued that pace Russell, a speaker could use an instance of\n‘The F is G’ to express a singular\nproposition about a specific individual: namely, the F in the\ncontext at hand. According to Strawson, sentences themselves do not\nhave truth conditions, since sentences (as opposed to speakers) do not\nexpress propositions; and speakers can use ‘The boy is\ntall’ to express a proposition with the contextually relevant\nboy as a constituent. Donnellan (1966) went on to argue that a speaker\ncould even use an instance of ‘The F is\nG’ to express a singular proposition about an\nindividual that isn’t an F; see the entry on\n reference.\n Such considerations, which have received a great deal of attention in\nrecent discussions of context dependence, suggested that relations\nbetween natural language sentences and propositions are (at best) very\ncomplex and mediated by speakers’ intentions. All of which made\nit seem that such relations are far more tenuous than the pre-Fregean\ntradition suggested. This bolstered the Quine/Carnap idea that\nquestions about the structure of premises and conclusions are really\nquestions about how we should talk (when trying to describe\nthe world), much as logic itself seems to be more concerned with how\nwe should infer than with how we do infer. From this perspective, the\nconnections between logic and grammar seemed rather shallow; see\nIacona (2018) for extended discussion.\n7. Notation and Restricted Quantification\n\nOn the other hand, more recent work on quantifiers suggests that the\ndivergence had been exaggerated, in part because of how Frege’s\nidea of variable-binding was originally implemented. Consider again\nthe proposition that some boy sang, and the proposed logical division\ninto the quantifier and the rest: \\(\\exists x [\\textrm{Boy}(x) \\land \\textrm{Sang}(x)]\\);\nsomething is both a boy and an individual that sang. This is one way\nto regiment the English sentence. But one can also offer a logical\nparaphrase that more closely parallels the grammatical division\nbetween ‘some boy’ and ‘sang’: for some\nindividual \\(x\\) such that \\(x\\) is a boy, \\(x\\) sang. One can formalize this\nparaphrase with restricted quantifiers, which incorporate a\nrestriction on the domain over which the variable in question ranges.\nFor example, ‘\\(\\exists x{:}B(x)\\)’ can be an existential\nquantifier that binds a variable ranging over the boys in the relevant\ndomain, with ‘\\(\\exists x{:}B(x) [S(x)]\\)’ being true iff some boy\nsang. Since ‘\\(\\exists x{:}B(x) [S(x)]\\)’ and ‘\\(\\exists x [B(x) \\land S(x)]\\)’\nare logically equivalent, logic provides no reason\nfor preferring the latter regimentation of the English sentence. And\nchoosing the latter does not show that the proposition expressed with\n‘Some boy sang’ has a structure that differs from\ngrammatical structure of the sentence.\n\nUniversal quantifiers can also be restricted, as in\n‘\\(\\forall x{:}B(x) [S(x)]\\)’, interpreted as follows: for every\nindividual \\(x\\) such that \\(x\\) is a boy, \\(x\\) sang. Restrictors can also be\nlogically complex, as in ‘Some boy from Canada sang’ or\n‘Some boy who respects Mary sang’, rendered as\n‘\\(\\exists x{:}B(x) \\land F(x, c)[S(x)]\\)’ and\n‘\\(\\exists x{:}B(x) \\land R(x, m)[S(x)]\\)’. Given these representations, the inferential\ndifference between ‘some boy sang’ and ‘every boy\nsang’ lies with the propositional contributions of\n‘some’ and ‘every’ after all, and not partly\nwith the contribution of connectives like ‘\\(\\land\\)’ and\n‘\\(\\rightarrow\\)’.\n\nWords like ‘someone’, and the grammatical requirement that\n‘every’ must be followed by a noun (or noun phrase),\nsuggest that natural language employs restricted quantifiers. Phrases\nlike ‘every boy’ are composed of a determiner and a noun.\nCorrespondingly, one can think of determiners as expressions that can\ncombine with an ordered pair of predicates to form a sentence, much as\none can think of transitive verbs as expressions that can combine with\nan ordered pair of names to form a sentence. And this grammatical\nanalogy, between determiners and transitive verbs, invites a semantic\ncorrelate.\n\nSince ‘\\(x\\)’ and ‘\\(y\\)’ are variables ranging over\nindividuals, one can say that the function indicated by the transitive\nverb ‘likes’ yields the value T given the\nordered pair \\(\\langle x,y \\rangle\\) as argument if and only if \\(x\\) likes \\(y\\). In\nthis notational scheme, ‘\\(y\\)’ corresponds to the direct\nobject (or internal argument), which combines with the verb to form a\nphrase; ‘\\(x\\)’ corresponds to the grammatical subject (or\nexternal argument) of the verb. If we think about ‘every boy\nsang’ analogously, ‘boy’ is the internal argument of\n‘every’, since ‘every boy’ is a phrase. By\ncontrast, ‘boy’ and ‘sang’ do not form a\nphrase in ‘every boy sang’. So let us introduce\n‘\\(X\\)’ and ‘\\(Y\\)’ as second-order variables ranging\nover functions, from individuals to truth values, stipulating that the\nextension of such a function is the set of things that the function\nmaps onto the truth value T. Then one can say that\nthe function indicated by ‘every’ yields the value\nT given the ordered pair \\(\\langle X,Y \\rangle\\) as argument\niff the extension of \\(X\\) includes the extension of \\(Y\\). Similarly, one can\nsay that the function indicated by ‘some’ maps the ordered\npair \\(\\langle X, Y \\rangle\\) onto T iff the extension of \\(X\\)\nintersects with the extension of \\(Y\\).\n\nJust as we can describe ‘likes’ as a predicate satisfied\nby ordered pairs \\(\\langle x, y \\rangle\\) such that \\(x\\) likes \\(y\\), so we can think\nabout ‘every’ as a predicate satisfied by ordered pairs\n\\(\\langle X, Y \\rangle\\) such that the extension of \\(X\\) includes the extension\nof \\(Y\\). (This is compatible with thinking about ‘every boy’\nas a restricted quantifier that combines with a predicate to form a\nsentence that is true iff every boy satisfies that predicate.) One\nvirtue of this notational scheme is that it lets us represent\nrelations between predicates that cannot be captured with\n‘\\(\\forall\\)’, ‘\\(\\exists\\)’, and the sentential\nconnectives; see Rescher (1962), Wiggins (1980). For example, most\nboys sang iff the boys who sang outnumber the boys who did not sing.\nSo we can say that ‘most’ indicates a function that maps\n\\(\\langle X, Y \\rangle\\) to T iff the number of things that\nboth \\(Y\\) and \\(X\\) map to T exceeds the number of things\nthat \\(Y\\) but not \\(X\\) maps to T.\n\nUsing restricted quantifiers, and thinking about determiners as\ndevices for indicating relations between functions, also suggests an\nalternative to Russell’s treatment of ‘the’. The\nformula\n\n\\[\\lsquo \\exists x \\{B(x) \\land \\forall y\n[B(y) \\rightarrow x = y] \\land S(x)\\}\\rsquo\\]\n\n can be rewritten\nas ‘\\(\\exists x{:}B(x)[S(x)] \\land |B| =\n1\\)’, interpreted as follows: for some individual \\(x\\)\nsuch that \\(x\\) is a boy, \\(x\\) sang; and the number of (relevant)\nboys is exactly one. On this view, ‘the boy’ still does\nnot correspond to a constituent of the formalism; nor does\n‘the’. But one can depart farther from Russell’s\nnotation, while emphasizing his idea that ‘the’ is\nrelevantly like ‘some’ and ‘every’. For one\ncan analyze ‘the boy sang’ as\n‘\\(!x:\\textrm{Boy}(x)[\\textrm{Sang}(x)]\\)’, specifying the\npropositional contribution of ‘\\(!\\)’—on a par with\nas ‘\\(\\exists\\)’ and ‘\\(\\forall\\)’—as\nfollows:\n\n\\[!x:Y(x)[X(x)] = \\textbf{T} \\text{ iff the extensions of } X \n\\text{ and } Y \\text{ intersect & } |Y| = 1.\\]\n\n\nThis way of encoding Russell’s theory preserves his central\nclaim. While there may be a certain boy that a speaker refers to in\nsaying ‘The boy sang’, that boy is not a constituent of\nthe quantificational proposition expressed with\n‘\\(!x:\\textrm{Boy}(x)[\\textrm{Sang}(x)]\\)’; see Neale (1990) for discussion. But\nfar from showing that the logical form of ‘The boy sang’\ndiverges dramatically from its grammatical form, the\nrestricted quantifier notation suggests that the logical form closely\nparallels the grammatical form. For ‘the boy’ and\n‘the’ do correspond to constituents of\n‘\\(!x:B(x)[S(x)]\\)’, at least if we allow for logical forms\nthat represent quantificational propositions in terms of second-order\nrelations; see Montague (1970), and for discussion of relevant\nconstraints on how such relations can be expressed with\nquantificational determiners, see Barwise and Cooper (1981),\nHigginbotham and May (1981), Keenan (1996), and the article on\n generalized quantifiers.\n\nIt is worth noting, briefly, a potential implication for inferences\nlike ‘The boy sang, so some boy sang’. If the logical form\nof ‘The boy sang’ is\n\n\\[\\lsquo\\exists x{:}B(x) [S(x)] \\land |B| = 1\\rsquo ,\\]\n\n\nthen the inference is an\ninstance of the schema ‘\\(\\textbf{A} \\land \\textbf{B}\\), so\n\\(\\textbf{A}\\)’. But if the logical form of ‘The boy\nsang’ is simply ‘\\(!(x){:}B(x)[S(x)]\\)’, the premise\nand conclusion have the same form, differing only by substitution of\n‘\\(!\\)’ for ‘\\(\\exists\\)’. In which case, the\nimpeccability of the inference depends on the specific contributions\nof ‘the/\\(!\\)’ and ‘some/\\(\\exists\\)’. Only\nwhen these contributions are “spelled out,” perhaps in\nterms of set-intersection, would the validity of the inference be\nmanifest; see, e.g., King (2002). So even if grammar and logic do not\ndiverge in this case, one might say that grammatical structure does\nnot\nreveal the logical structure. From this perspective, further\nanalysis of ‘the’ is required. Those who are skeptical of\nan analytic/synthetic distinction can say that it remains more a\ndecision than a discovery to say that ‘Some boy sang’\nfollows from ‘The boy sang’. In general, and especially\nwith regard to aspects of propositional form indicated with individual\nwords, issues about logical form are connected with issues about the\n analytic-synthetic distinction.\n8. Transformational Grammar\n\nEven given restricted quantifiers (and acceptance of second-order\nlogical forms), the subject/predicate structure of ‘Juliet /\nlikes every doctor’ diverges from the corresponding formula\nbelow.\n\n\\[\\forall y{:}\\textrm{Doctor}(y) [\\textrm{Likes}(\\textrm{Juliet}, y)]\n\\]\n\n\nWe can rewrite ‘\\(\\textrm{Likes}(\\textrm{Juliet}, y)\\)’ as\n‘\\([\\textrm{Likes}(y)](\\textrm{Juliet})\\)’, to reflect the\nfact that ‘likes’ combines with a direct object to form a\nphrase, which in turn combines with a subject. But this does not\naffect the main point: ‘every’ seems to be a grammatical\nconstituent of the verb phrase ‘likes every doctor’; yet\nit also seems to indicate the main quantifier of the expressed\nproposition. In natural language, ‘likes’ and ‘every\ndoctor’ form a phrase. But with respect to logical form, it is\nas if ‘likes’ combines with ‘Juliet’ and a\nvariable to form a complex predicate that is in turn an external\nargument of the higher-order predicate ‘every’. Similar\nremarks apply to ‘Some boy likes every doctor’ and\n\n\\[\\lsquo[\\exists x{:}\\textrm{Boy}(x)][\\forall y{:}\\textrm{Doctor}(y)]\\{\\textrm{Likes}(x,y)\\}\\rsquo.\\]\n\n\nSo it\nseems that mismatches remain in the very places that troubled medieval\nlogicians—viz., quantificational direct objects and other\nexamples of complex predicates with quantificational constituents.\n\nMontague (1970, 1974) showed that these mismatches do not preclude\nsystematic connections of natural language sentences with the\ncorresponding propositional structures. Abstracting from the technical\ndetails, one can specify an algorithm that pairs each natural language\nsentence that contains one or more quantificational expressions like\n‘every doctor’ with one or more Fregean logical forms.\nThis was a significant advance. Together with subsequent developments,\nMontague’s work showed that Frege’s logic was compatible\nwith the idea that quantificational constructions in natural language\nhave a systematic semantics. Indeed, one can use Frege’s formal\napparatus to study such constructions. Montague maintained that the\nsyntax of natural language was, nonetheless, misleading for purposes\nof (what he took to be) real semantics. On this view, the study of\nvalid inference still suggests that grammar disguises the structure of\npropositional thought. But in thinking about the relation of logic to\ngrammar, one should not assume a naive conception of the latter.\n\nFor example, the grammatical form of a sentence need not be determined\nby the linear order of its words. Using brackets to disambiguate, we\ncan distinguish the sentence ‘Mary [saw [the [boy [with\nbinoculars]]]]’—whose direct object is ‘the boy with\nbinoculars’—from the homophonous sentence ‘Mary\n[[saw [the boy]] [with binoculars]]’, in which ‘saw the\nboy’ is modified by an adverbial phrase. The first implies that\nthe boy had binoculars, while the second implies that Mary used\nbinoculars to see the boy. Even if this distinction is not audibly\nmarked, there is a significant difference between modifying a noun\n(like ‘boy’) with a prepositional phrase and modifying a\nverb phrase (‘saw the boy’). More generally, grammatical\nstructure need not be obvious. Just as it may take work to discover\nthe kind(s) of structure that propositions exhibit, so it may take\nwork to discover the kind(s) of structure that sentences exhibit. And\nmany studies of natural language suggest a rich conception of\ngrammatical form that diverges from traditional views; see especially\nChomsky (1957, 1964, 1965, 1981, 1986, 1995). So we need to ask how\nlogical forms are related to actual grammatical forms, which linguists\ntry to discover, since these may differ importantly from any\nhypothesized grammatical forms that may be suggested by casual\nreflection on spoken language. Appearances may be misleading with\nrespect to both grammatical and logical form, leaving room for the\npossibility that these notions of structure are not so different after\nall.\n\nA leading idea of modern linguistics is that at least some grammatical\nstructures are transformations of others. Put another way, linguistic\nexpressions often appear to be displaced from positions canonically\nassociated with certain grammatical relations that the expressions\nexhibit. For example, the word ‘who’ in (17) is apparently\nassociated with the internal (direct object) argument position of the\nverb ‘saw’.\n\n(17)\nMary wondered who John saw\n\n\nCorrespondingly, (17) can be glossed as ‘Mary wondered which\nperson is such that John saw that person’. This invites the\nhypothesis that (17) reflects a transformation of the “Deep\nStructure” (17D) into the “Surface Structure” (17S);\nwhere the subscripts indicate that ‘who’ bears a certain\ngrammatical relation, often called “movement,” to the\ncoindexed position.\n\n(17D)\n{Mary [wondered {John [saw who]}]}\n(17S)\n{Mary [wondered [whoi {John [saw\n( … )i ]}]]}\n\n\nThe idea is that the embedded clause in (17D) has the same form as\n‘John saw Bill’, but in (17S), ‘who’ has been\ndisplaced from its original argument position. Similar remarks apply\nto the question ‘Who did John see’ and other\nquestion-words like ‘why’, ‘what’,\n‘when’, and ‘how’.\n\nOne might also try to explain the synonymy of (18) and (19) by\npositing a common deep structure, (18D).\n\n(18)\nJohn seems to like Mary\n(19)\nIt seems John likes Mary\n(18D)\n[Seems{John [likes Mary]}]\n(18S)\n{Johni [seems { ( _ )i [to like Mary]}]}\n\n\nIf every English sentence needs a subject of some kind, (18D) must be\nmodified: either by displacing ‘John’, as in (18S); or by\ninserting a pleonastic subject, as in (19). Note that in (19),\n‘It’ does not indicate an argument; compare\n‘There’ in ‘There is something in the garden’.\nAppeal to displacement also lets one distinguish the superficially\nparallel sentences (20) and (21).\n\n(20)\nJohn is easy to please\n(21)\nJohn is eager to please\n\n\nIf (20) is true, John is easily pleased. In which case, it is easy\n(for someone) to please John; and here, ‘it’ is\npleonastic. But if (21) is true, John is eager that he please someone\nor other. This asymmetry is effaced by representations like\n‘Easy-to-please(John)’ and\n‘Eager-to-please(John)’. The contrast is made manifest,\nhowever, with (20S) and (21S); where ‘e’ indicates an\nunpronounced argument position.\n\n(20S)\n{Johni [is easy { e [to please (\n_ )i ]}]}\n(21S)\n{Johni [is eager { ( _\n)i [to please e ]}]}\n\n\nIt may be that in (21S), which does not mean that it is eager for John\nto please someone, ‘John’ is grammatically linked to the\ncoindexed position without being displaced from that position. But\nwhatever the details, the “surface subject” of a sentence\ncan be the object of a verb embedded within the main predicate, as in\n(20S). Of course, such hypotheses about grammatical structure require\ndefense. But Chomsky and others have long argued that such hypotheses\nare needed to account for various facts concerning human linguistic\ncapacities; see, e.g., Berwick et.al. (2011). As an illustration of\nthe kind of data that is relevant, note that while (22–24) are\nperfectly fine as expressions of English, (25) is not.\n\n(22)\nThe boy who sang was happy\n(23)\nWas the boy who sang happy\n(24)\nThe boy who was happy sang\n(25)\n*Was the boy who happy sang\n\n\nThis suggests that the auxiliary verb ‘was’ can be\ndisplaced from some positions but not others. That is, while (23S) is\na permissible transformation of (22D), (25S) is not a permissible\ntransformation of (24D).\n\n(22D)\n{[The [boy [who sang]]] [was happy]}\n(23S)\nWasi {[the [boy [who sang]]] [\n( _ )i happy]}\n(24D)\n{[The [boy [who [was happy]]]] sang}\n(25S)\n*Wasi {[the [boy [who [ ( _\n)i happy]]]] sang}\n\n\nIn (25), the asterisk indicates intuitive deviance; in (25S), it\nindicates the hypothesized source of this deviance—viz., that\nthe auxiliary verb cannot be displaced from the embedded relative\nclause. The ill-formedness of (25S) is striking, since one can\nsensibly ask whether or not the boy who was happy sang. One can also\nask whether or not (26) is true. But (27) is not the yes/no question\ncorresponding to (26).\n\n(26)\nThe boy who was lost kept crying\n(27)\nWas the boy who lost kept crying\n\n\nRather, (27) is the yes/no question corresponding to ‘The boy\nwho lost was kept crying’, which has an unexpected meaning. So\nwe want some account of why (27) cannot have the interpretation\ncorresponding to (26). But this “negative fact” concerning\n(27) is precisely what one would expect if ‘was’ cannot be\ndisplaced from its position in (26), as in the following logically\npossible but grammatically illicit structure: *Wasi\n{[the [boy [who [( _ )i lost]]]] [kept crying]}.\n\nBy contrast, if we merely specify an algorithm that associates (27)\nwith its actual meaning—or if we merely hypothesize that (27) is\nthe English translation of a certain mental sentence—we have not\nyet explained why (27) cannot also be used to ask whether or not (26)\nis true. Explanations of such facts appeal to nonobvious grammatical\nstructure, and constraints on natural language transformations. (For\nexample, an auxiliary verb in a relative clause cannot be\n“fronted;” though of course, theorists try to find deeper\nexplanations for such constraints.)\n\nThe idea was that a sentence has both a deep structure (DS), which\nreflects semantically relevant relations between verbs and their\narguments, and a surface structure (SS) that may include displaced (or\npleonastic) elements. In some cases, pronunciation might depend on\nfurther transformations of SS, resulting in a distinct\n“phonological form” (PF). Linguists posited various\nconstraints on these levels of grammatical structure, and the\ntransformations that relate them. But as the theory was elaborated and\nrefined under empirical pressure, various facts that apparently called\nfor explanation in these terms still went unexplained. This suggested\nanother level of grammatical structure, obtained by a different kind\nof transformation on SS. The hypothesized level was called\n‘LF’, intimating ‘Logical Form’; and the\nhypothesized transformation—called ‘Quantifier\nRaising’ because it targeted the kinds of expressions that\nindicate (restricted) quantifiers—mapped structures like (28S)\nonto structures like (28L).\n\n(28S)\n{Juliet [likes [every doctor]]}\n(28L)\n{[every doctor]i {Juliet [\nlikes ( _ )i ]}}\n\n\nClearly, (28L) does not reflect the pronounced word order in English.\nBut the idea was that PF determines pronunciation, while LF was said\nto be the level at which the scope of a natural language quantifier is\ndetermined; see May (1985). If we think about ‘every’ as a\nkind of second-order transitive predicate, which can combine with two\npredicates like ‘doctor’ and ‘Juliet likes ( _\n)i’ to form a complete sentence, we should\nexpect that at some level of analysis, the sentence ‘Juliet\nlikes every doctor’ has the structure indicated in (28L). And\nmapping (28L) to the Fregean logical\nform\n\n\\[\\lsquo [\\forall x{:}\\textrm{Doctor}(x)]\\{\\textrm{Likes}(\\textrm{Juliet},\nx)\\}\\rsquo\\]\n\n\nis trivial.  Similarly, consider the following:\n\n(29S)\n{[some boy] [likes [every doctor]]}\n(29L)\n{[some boy]i {[every\ndoctor]jj {( _ )i [likes ( _\n)j ]}}\n(29L′)\n{[every doctor]j {[some\nboy]i { ( _ )i [likes ( _\n)j ]}}}\n\nIf the surface structure\n(29S) can be mapped onto either (29L) or (29L′), then (29S) can\nbe easily mapped onto the Fregean logical\nforms\n\n\\[\\lsquo[\\exists x{:}\\textrm{Boy}(x)][\\forall\ny{:}\\textrm{Doctor}(y)]\\{\\textrm{Likes}(x,y)\\}\\rsquo\\]\n\nand\n\n\\[\\lsquo [\\forall y{:}\\textrm{Doctor}(y)][\\exists x{:} \\textrm{Boy}(x)]\\{\\textrm{Likes}(x,y)\\}\\rsquo .\n\\]\n\n\n\nThis assimilates quantifier scope ambiguity to the structural\nambiguity of examples like ‘Juliet saw the boy with\nbinoculars’. More generally, many apparent examples of\ngrammar/logic mismatches were rediagnosed as mismatches between\ndifferent aspects of grammatical structure—between those aspects\nthat determine pronunciation, and those that determine interpretation.\nIn one sense, this is fully in keeping with the idea that in natural\nlanguage, “surface appearances” are often misleading with\nregard to propositional structure. But it also makes room for the idea\nthat grammatical structure and logical structure converge, in ways\nthat can be discovered through investigation, once we move beyond\ntraditional subject-predicate conceptions of structure with regard to\nboth logic and grammar.\n\nThere is independent evidence for “covert”\ntransformations—displacement of expressions from their audible\npositions, as in (28L); see Huang (1995), Hornstein (1995). Consider\n‘Jean a vu qui’, which is the French translation of\n‘Who did John see’. If we assume that ‘qui’\n(‘who’) is displaced at LF, then we can explain why the\nquestion-word is understood in both French and English like a\nquantifier binding a variable: which person \\(x\\) is such that John saw \\(x\\)?\nSimilarly, example (30) from Chinese is transliterated as in (31).\n\n(30)\nZhangsan zhidao Lisi mai-te sheme\n(31)\nZhangsan know Lisi bought what\n\n\nBut (30) is ambiguous, between the interrogative (31a) and the complex\ndeclarative (31b).\n\n(31a)\nWhich thing is such that Zhangsan knows Lisi bought\nit\n(31b)\nZhangsan knows which thing (is such that) Lisi\nbought (it)\n\n\nThis suggests covert displacement of the quantificational\nquestion-word in Chinese; see Huang (1982, 1995). Chomsky (1981) also\nargued that the constraints on such displacement can help explain\ncontrasts like the one illustrated with (32) and (33).\n\n(32)\nWho said he has the best smile\n(33)\nWho did he say has the best smile\n\n\nIn (32), the pronoun ‘he’ can have a bound-variable\nreading: which person \\(x\\) is such that \\(x\\) said that \\(x\\) has the best smile.\nThis suggests that the following grammatical structure is possible:\nWhoi {[( )i said\n[hei has the best smile]]}. But (33) cannot be used\nto ask this question, suggesting that some linguistic constraint rules\nout the following logically possible structure:\n*Whoi [did {[hei say [(\n)i has the best smile]]]. And there cannot be\nconstraints on transformations without transformations. So if English\novertly displaces question-words that are covertly displaced in other\nlanguages, we should not be too surprised if English covertly\ndisplaces other quantificational expressions like ‘every\ndoctor’. Likewise, (34) has the reading indicated in (34a) but\nnot the reading indicated in (34b).\n\n(34)\nIt is false that Juliet likes every doctor\n(34a)\n\\(\\neg \\forall x{:}\\textrm{Doctor}(x) [\\textrm{Likes}(\\textrm{Juliet}, x)]\\)\n(34b)\n\\(\\forall x{:}\\textrm{Doctor}(x) \\neg [\\textrm{Likes}(\\textrm{Juliet}, x)]\\)\n\n\nThis suggests that ‘every doctor’ gets displaced, but only\nso far. Similarly, (13) cannot mean that every doctor is such that no\npatient who saw that doctor is healthy.\n\n(13)\nNo patient who saw every doctor is healthy\n\n\nAs we have already seen, English seems to abhor fronting certain\nelements from within an embedded relative clause. This invites the\nhypothesis that Quantifier Raising is subject to a similar constraint,\nand hence, that many quantificational expressions get displaced in\nEnglish. This hypothesis is not uncontroversial; see, e.g., Jacobson\n(1999). But many linguists (following Chomsky [1995, 2000]) would now\nposit only two levels of grammatical structure, corresponding to PF\nand LF—the thought being that constraints on DS and SS can be\neschewed in favor of a simpler theory that only posits constraints on\nhow expressions can be combined in the course of constructing complex\nexpressions that can be pronounced and interpreted. If this\ndevelopment of earlier theories proves correct, then the only\nsemantically relevant level of grammatical structure often reflects\ncovert displacement of audible expressions; see, e.g., Hornstein\n(1995). In any case, there is a large body of work suggesting that\nmany logical properties of quantifiers, names, and pronouns are\nreflected in properties of LF.\n\nFor example, if (35) is true, it follows that some doctor treated some\ndoctor; whereas (36) does not have this consequence:\n\n(35)\nEvery boy saw the doctor who treated himself\n(36)\nEvery boy saw the doctor who treated him\n\n\nThe meanings of (35) and (36) seem to be roughly as indicated in (35a)\nand (36a); where ‘\\(!\\)’ indicates the contribution of\n‘the’.\n\n(35a)\n\\([\\forall x{:}\\textrm{Boy}(x)][!y{:}\\textrm{Doctor}(y) \\land \\textrm{Treated}(y,y)] \\{\\textrm{Saw}(x,y)\\}\\)\n(36a)\n\\([\\forall x{:}\\textrm{Boy}(x)][!y{:}\\textrm{Doctor}(y) \\land \\textrm{Treated}(y,x)] \\{\\textrm{Saw}(x,y)\\}\\)\n\n\nThis suggests that ‘himself’ is behaving like a variable\nbound by ‘the doctor’, while ‘every boy’ can\nbind ‘him’. And there are independent grammatical reasons\nfor saying that ‘himself’ must be linked to ‘the\ndoctor’, while ‘him’ must not be so linked. Note\nthat in ‘Pat thinks Chris treated himself/him’, the\nantecedent of ‘himself’ must be the subject of\n‘treated’, while the antecedent of ‘him’ must\nnot be; see Chomsky (1981).\n\nWe still need to enforce the conceptual distinction between LF and the\ntraditional notion of logical form. There is no guarantee that\nstructural features of natural language sentences will mirror the\nlogical features of propositions; cp. Stanley (2000), King (2007). But\nthis leaves room for the empirical hypothesis that LF reflects at\nleast a great deal of propositional structure; see Harman (1972),\nHigginbotham (1986), Segal (1989), Larson and Ludlow (1993), and the\nessay on\n structured propositions.\n Moreover, even if the LF of a sentence S underdetermines the logical\nform of the proposition a speaker expresses with S (on a given\noccasion of use), the LF may provide a “scaffolding” that\ncan be elaborated in particular contexts, with little or no mismatch\nbetween grammatical and propositional architecture. If some such view\nis correct, it might avoid certain (unpleasant) questions prompted by\nearlier Fregean views: how can a sentence be used to express a\nproposition with a radically different structure; and if grammar is\ndeeply misleading, why think that our intuitions concerning\nimpeccability provide reliable evidence about which propositions\nfollow from which? These are, however, issues that remain\nunsettled.\n9. Semantic Structure and Events\n\nIf propositions are the “things” that really have logical\nform, and sentences of English are not themselves propositions, then\nsentences of English “have” logical forms only by\nassociation with propositions. But if the meaning of a sentence is\nsome proposition—or perhaps a function from contexts to\npropositions—then one might say that the logical form\n“of” a sentence is its semantic structure (i.e., the\nstructure of that sentence’s meaning). Alternatively, one might\nsuspect that in the end, talk of propositions is just convenient\nshorthand for talking about the semantic properties of certain\nsentences: perhaps sentences of a Begriffsschrift, or sentences of\nmentalese, or sentences of natural languages (abstracting away from\ntheir logically/semantically irrelevant properties). In any case, the\nnotion of logical form has played a significant role in recent work on\ntheories of meaning for natural languages. So an introductory\ndiscussion of logical form would not be complete without some hint of\nwhy such work is relevant, especially since attending to details of\nnatural languages (as opposed to languages invented to study the\nfoundations of arithmetic) led to renewed discussion of how to\nrepresent propositions that involve relations.\n\nPrima facie, ‘Every old patient respects some doctor’ and\n‘Some young politician likes every liar’ exhibit common\nmodes of linguistic combination. So a natural hypothesis is that the\nmeaning of each sentence is fixed by these modes of combination, given\nthe relevant word meanings. It may be hard to see how this hypothesis\ncould be true if there are widespread mismatches between logical and\ngrammatical form. But it is also hard to see how the hypothesis could\nbe false. Children, who have finite cognitive resources, typically\nacquire the capacity to understand the endlessly many expressions of\nthe languages spoken around them. A great deal of recent work has\nfocussed on these issues, concerning the connections between logical\nform and the senses in which natural languages are semantically\n compositional.\n\nIt was implicit in Frege that each of the endlessly many sentences of\nan ideal language would have a compositionally determined\ntruth-condition. Frege did not actually specify an algorithm that\nwould associate each sentence of his Begriffsschrift with its\ntruth-condition. But\n Tarski (1933) showed how to do this for the\n first-order predicate calculus, focussing on interesting cases of\n multiple quantification like the one shown below:\n\n\\[\\begin{align}\n\\forall x &[\\textrm{Number}(x) \\:\\rightarrow \\\\\n & \\exists y [\\textrm{SuccessorOf}(y, x) \n \\land \\forall z [\\textrm{SuccessorOf}(z, x) \\rightarrow z =  y]]]\n\\end{align}\\]\n\n\nThis made it possible to capture, with precision, the idea that an\ninference is valid in the predicate calculus iff: every interpretation\nthat makes the premises true also makes the conclusion true, holding\nfixed the interpretations of logical elements like ‘if’\nand ‘every’. Davidson (1967a) conjectured that one could\ndo for English what Tarski did for the predicate calculus; and\nMontague, similarly inspired by Tarski, showed how one could start\ndealing with predicates that have quantificational\nconstituents. Still, many apparent objections to the conjecture\nremained. As noted at the end of\n section four,\n sentences like ‘Pat thinks that Hesperus is Phosphorus’\npresent difficulties; though Davidson (1968) offered an influential\nsuggestion. Davidson’s (1967b) proposal concerning examples like\n(37–40) also proved enormously fruitful.\n\n(37)\nJuliet kissed Romeo quickly at midnight.\n(38)\nJuliet kissed Romeo quickly.\n(39)\nJuliet kissed Romeo at midnight.\n(40)\nJuliet kissed Romeo.\n\n\nIf (37) is true, so are (38–40); and if (38) or (39) is true, so\nis (40). The inferences seem impeccable. But the function-argument\nstructures are not obvious. If we represent ‘kissed quickly at\nmidnight’ as an unstructured predicate that takes two arguments,\nlike ‘kissed’ or ‘kicked’, we will represent\nthe inference from (37) to (40) as having the form: \\(K^*(x, y)\\); so \\(K(x, y)\\).\nBut this form is exemplified by the bad inference ‘Juliet\nkicked Romeo; so Juliet kissed Romeo’. Put another way, if\n‘kissed quickly at midnight’ is a logically unstructured\nbinary predicate, then the following conditional is a nonlogical\nassumption: if Juliet kissed Romeo in a certain manner at a certain\ntime, then Juliet kissed Romeo. But this conditional seems like a\ntautology, not an assumption that introduces any epistemic risk.\nDavidson concluded that the surface appearances of sentences like\n(37–40) mask relevant semantic structure. In particular, he\nproposed that such sentences are understood in terms of quantification\nover events.\n\nAccording to Davidson, who echoed Ramsey (1927), the meaning of (40)\nis reflected in the paraphrase ‘There was a kissing of Romeo by\nJuliet’. One can formalize this proposal in various ways, with\ndifferent implications for how verbs like ‘kiss’ are\nrelated to propositional constituents: \\(\\exists e [\\textrm{Past}(e)\n\\land \\textrm{KissingOf}(e, \\textrm{Romeo}) \\land\n\\textrm{KissingBy}(e, \\textrm{Juliet})]\\); or \\(\\exists e\n[\\textrm{Past}(e) \\land \\textrm{KissingByOf}(e, \\textrm{Juliet},\n\\textrm{Romeo})]\\); or as in (40a), with Juliet and Romeo explicitly\nrepresented as players of certain roles in an event.\n\n(40a)\n\\(\\exists e [\\textrm{Agent}(e, \\textrm{Juliet}) \\land \\textrm{Kissing}(e) \\land \\textrm{Patient}(e, \\textrm{Romeo})]\\)\n\n\nBut given any such representation, adverbs like ‘quickly’\nand ‘at midnight’ can be analyzed as additional predicates\nof events, as shown in (37a–39a).\n\n(37a)\n\\(\\exists e [\\textrm{Agent}(e, \\textrm{Juliet}) \\land\n  \\textrm{Kissing}(e) \\land \\textrm{Patient}(e, \\textrm{Romeo})\\:\\land\\)\n  \\(\\textrm{Quick}(e) \\land \\textrm{At-midnight}(e)]\\)\n(38a)\n\\(\\exists e [\\textrm{Agent}(e, \\textrm{Juliet}) \\land\n  \\textrm{Kissing}(e) \\land \\textrm{Patient}(e, \\textrm{Romeo})\\:\\land\\)\n  \\(\\textrm{Quick}(e)]\\)\n(39a)\n\\(\\exists e [\\textrm{Agent}(e, \\textrm{Juliet}) \\land\n  \\textrm{Kissing}(e) \\land \\textrm{Patient}(e, \\textrm{Romeo})\\:\\land\\)\n  \\(\\textrm{At-midnight}(e)]\\)\n\n\nIf this is correct, then the inference from (37) to (40) is an\ninstance of the following valid form: \\(\\exists e [\\ldots e \\ldots\n\\land Q(e) \\land A(e)]\\); hence, \\(\\exists e [\\dots e \\dots]\\). The\nother impeccable inferences involving (37–40) can likewise be\nviewed as instances of conjunction reduction in the scope of an\nexistential quantifier; see Pietroski (2018) for discussion that\nconnects this point to medieval insights noted in\n section three.\n If the grammatical form of (40) is simply ‘{Juliet [kissed\nRomeo]}’, then the mapping from grammatical to logical form is\nnot transparent; and natural language is misleading, in that no word\ncorresponds to the event quantifier. But this does not posit a\nsignificant structural mismatch between grammatical and logical form.\nOn the contrary, each word in (40) corresponds to a conjunct in (40a).\nThis suggests a strategy for thinking about how the meaning of a\nsentence like (40) might be composed from the meanings of the\nconstituent words. A growing body of literature, in philosophy and\nlinguistics, suggests that Davidson’s proposal captures an\nimportant feature of natural language semantics, and that “event\nanalyses” provide a useful framework for discussions of logical\nform; see, e.g., Schein (2017) for extended discussion and many\nreferences.\n\nIn one sense, it is an ancient idea that action reports like (40)\nrepresent individuals as participating in events; see Gillon’s\n(2007) discussion of Pāṇini’s grammar of Sanskrit.\nBut if (40) can be glossed as ‘Juliet did some kissing, and\nRomeo was thereby kissed’, perhaps the ancient idea can be\ndeployed in developing Leibniz’ suggestion that relational\nsentences like (40) somehow contain simpler active-voice and\npassive-voice sentences; cp. Kratzer (1996). And perhaps appeals to\nquantifier raising can help in defending the idea that ‘Juliet\nkissed some/the/every boy’ is, after all, a sentence\nthat exhibits Subject-copula-Predicate form:\n‘[some/the/every boy]i is\nP’, with ‘P’ as a complex\npredicate akin to ‘[some event]e was both a\nkissing done by Juliet and one in which hei was\nkissed’.\n\nWith this in mind, let’s return to the idea that each complex\nexpression of natural language has semantic properties that are\ndetermined by (i) the semantic properties of its constituents, and\n(ii) the ways in which these constituents are grammatically arranged.\nIf this is correct, then following Davidson, one might say that the\nlogical forms of expressions (of some natural language) just are the\nstructures that determine the corresponding meanings given the\nrelevant word meanings; see Lepore and Ludwig (2002). In which case,\nthe phenomenon of valid inference may be largely a by-product of\nsemantic compositionality. If principles governing the meanings of\n(37–40) have the consequence that (40) is true iff an\nexistential claim like (40a) is true, perhaps this is illustrative of\nthe general case. Given a sentence of some natural language NL, the\ntask of specifying its logical form may be inseparable from the task\nof providing a compositional specification of what the sentences of NL\nmean.\n10. Further Questions\n\nAt this point, many issues become relevant to further discussions of\nlogical form. Most obviously, there are questions concerning\nparticular examples. Given just about any sentence of natural\nlanguage, one can ask interesting questions (that remain unsettled)\nabout its logical form. There are also very abstract questions about\nthe relation of semantics to logic. Should we follow Davidson and\nMontague, among others, in characterizing theories of meaning for\nnatural languages as theories of truth (that perhaps satisfy certain\nconditions on learnability)? Is an algorithm that correctly associates\nsentences with truth-conditions (relative to contexts) necessary\nand/or sufficient for being an adequate theory of meaning? What should\nwe say about the paradoxes apparently engendered by sentences like\n‘This sentence is false’? If we allow for second-order\nlogical forms, how should we understand second-order quantification,\ngiven Russell’s Paradox? Are claims about the “semantic\nstructure” of a sentence fundamentally descriptive claims about\nspeakers (or their communities, or their languages)? Or is there an\nimportant sense in which claims about semantic structure are normative\nclaims about how we should use language? Are facts about the\nacquisition of language germane to hypotheses about logical form? And\nof course, the history of the subject reveals that the answers to the\ncentral questions are by no means obvious: what is logical structure,\nwhat is grammatical structure, and how are they related? Or put\nanother way, what kinds of structures do propositions and sentences\nexhibit, and how do thinkers/speakers relate them?\n",
    "bibliography": {
        "categories": [
            "Cited Works",
            "Some Other Useful Works"
        ],
        "cat_ref_text": {
            "Cited Works": [
                "</h3>\n<ul class=\"hanging\">",
                "Barwise, J. &amp; Cooper, R., 1981, “Generalized Quantifiers\nand Natural Language”, <em>Linguistics and Philosophy</em>, 4:\n159–219.",
                "Beaney, M., ed., 1997, <em>The Frege Reader</em>, Oxford:\nBlackwell.",
                "Berwick, B. et al., 2011, “Poverty of the Stimulus\nRevisited”, <em>Cognitive Science</em>, 35: 1207–42.",
                "Boolos, G., 1998, <em>Logic, Logic, and Logic</em>, Cambridge, MA:\nHarvard University Press.",
                "Carnap, R., 1950, “Empiricism, Semantics, and\nOntology”, reprinted in R. Carnap, <em>Meaning and\nNecessity</em>; second edition, Chicago: University of Chicago Press,\n1956.",
                "Cartwright, R., 1962, “Propositions”, in R. J. Butler,\n<em>Analytical Philosophy</em>, 1st series, Oxford: Basil Blackwell\n1962; reprinted with addenda in Richard Cartwright, <em>Philosophical\nEssays</em>, Cambridge, MA: MIT Press 1987.",
                "Chomsky, N., 1957, <em>Syntactic Structures</em>, The Hague:\nMouton.",
                "–––, 1964, <i>Current Issues in Linguistic\nTheory</i>, The Hague: Mouton.",
                "–––, 1965, <em>Aspects of the Theory of\nSyntax</em>, Cambridge, MA: MIT Press.",
                "–––, 1981, <em>Lectures on Government and\nBinding</em>, Dordrecht: Foris.",
                "–––, 1986, <em>Knowledge of Language</em>, New\nYork: Praeger.",
                "–––, 1995, <em>The Minimalist Program</em>,\nCambridge, MA: MIT Press.",
                "Davidson, D., 1967a, “Truth and Meaning”,\n<em>Synthese</em>, 17: 304–23.",
                "–––, 1967b, “The Logical Form of Action\nSentences”, in N. Rescher (ed.), <em>The Logic of Decision and\nAction</em>, Pittsburgh: University of Pittsburgh Press.",
                "–––, 1968, “On Saying That”,\n<em>Synthese</em>, 19: 130–46.",
                "–––, 1980, <em>Essays on Actions and\nEvents</em>, Oxford: Oxford University Press.",
                "–––, 1984, <em>Inquiries into Truth and\nInterpretation</em>, Oxford: Oxford University Press.",
                "Donnellan, K., 1966, “Reference and Definite\nDescriptions”, <em>Philosophical Review</em>, 75:\n281–304.",
                "Fodor, J., 1978, “Propositional Attitudes”, <em>The\nMonist</em>, 61: 501–23.",
                "Frege, G., 1879, <em>Begriffsschrift</em>, reprinted in Beaney\n1997.",
                "–––, 1884, <em>Die Grundlagen der\nArithmetik</em>, Breslau: Wilhelm Koebner. English translation,\n<em>The Foundations of Arithmetic</em>, J. L. Austin (trans). Oxford:\nBasil Blackwell, 1974.",
                "–––, 1891, “Function and Concept”,\nreprinted in Beaney 1997.",
                "–––, 1892, “On Sinn and Bedeutung”,\nreprinted in Beaney 1997.",
                "Gillon, B., 2007, “Pāṇini’s\nAṣṭādhyāyī and Linguistic Theory”,\n<em>Journal of Indian Philosophy</em>, 35: 445–468.",
                "Harman, G., 1972, “Logical Form”, <em>Foundations of\nLanguage</em>, 9: 38–65.",
                "–––, 1973, <em>Thought</em>, Princeton: Princeton\nUniversity Press.",
                "Higginbotham, J., 1986, “Linguistic Theory and\nDavidson’s Program in Semantics”, in E. Lepore (ed.),\n<em>Truth and Interpretation</em>, pp. 29–48, Oxford:\nBlackwell.",
                "Higginbotham, J. &amp; May, R., 1981, “Questions,\nQuantifiers, and Crossing”, <em>Linguistic Review</em>, 1:\n47–79.",
                "Hornstein, N., 1995, <em>Logical Form: From GB to Minimalism</em>,\nOxford: Blackwell.",
                "Huang, J., 1995, “Logical Form”, in G. Webelhuth\n(ed.), <em>Government and Binding Theory and the Minimalist Program:\nPrinciples and Parameters in Syntactic Theory</em>, pp. 127–175,\nOxford: Blackwell.",
                "Iacona, A., 2018, <em>Logical Form: Between Logic and Natural\nLanguage</em>, Berlin: Springer.",
                "Jacobson, P., 1999, “Variable Free Semantics”,\n<em>Linguistics and Philosophy</em>, 22: 117–84.",
                "King, J., 2002, “Two Sorts of Claims about Logical Form\n” in Preyer and Peter 2002.",
                "–––, <em>The Nature and Structure of\nContent</em>, Oxford: Oxford University Press.",
                "Keenan, E., 1996, “The Semantics of Determiners”, in\nS. Lappin (ed.), <em>The Handbook of Contemporary Semantic\nTheory</em>, Oxford: Blackwell, pp. 41–63.",
                "Kratzer, A., 1986, “Severing the External Argument from its\nVerb”, in J. Rooryck and L. Zaring (eds.), <em>Phrase Structure\nand the Lexicon</em>, Dordrecht: Kluwer, pp. 109–137.",
                "Larson, R. and Ludlow, P., 1993, “Interpreted Logical\nForms”, <em>Synthese</em>, 95: 305–55.",
                "Lepore, E. and Ludwig, K., 2002, “What is Logical\nForm?”, in Preyer and Peter 2002, pp. 54–90.",
                "Ludlow, P., 2002, “LF and Natural Logic”, in Preyer\nand Peter 2002, pp. 132–168.",
                "May, R., 1985, <em>Logical Form: Its Structure and\nDerivation</em>, Cambridge, MA: MIT Press.",
                "Montague, R., 1970, “English as a Formal Language”, in\nR. Thomason (ed.), <em>Formal Philosophy</em>, New\nHaven, CT: Yale University Press, 1974, pp. 7–27.",
                "Parsons, T., 2014, <em>Articulating Medieval Logic</em>, Oxford:\nOxford University Press.",
                "Pietroski, P., 2018, <em>Conjoining Meanings</em>, Oxford: Oxford\nUniversity Press.",
                "Preyer, G. and Peter, G. (eds.), 2002, <em>Logical Form and\nLanguage</em>, Oxford: Oxford University Press.",
                "Quine, W.V.O., 1950, <em>Methods of Logic</em>, New York: Henry\nHolt.",
                "–––, 1951, “Two Dogmas of\nEmpiricism”, <em>Philosophical Review</em>, 60:\n20–43.",
                "–––, 1953, “On What There Is”, in\n<i>From a Logical Point of View</i>, Cambridge, MA:\nHarvard University Press, pp. 1–19.",
                "–––, 1960, <em>Word and Object</em>, Cambridge\nMA: MIT Press.",
                "–––, 1970, <em>Philosophy of Logic</em>,\nEnglewood Cliffs, NJ: Prentice Hall.",
                "Ramsey, F., 1927, “Facts and Propositions”,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 7: 153–170.",
                "Sànchez, V., 1991, <em>Studies on Natural Logic and\nCategorial Grammar</em>, Ph.D. Thesis, University of Amsterdam.",
                "—1994, “Montonicity in Medieval Logic”,\n<i>Language and Cognition</i>, 4: 161–74.",
                "Schein, B., 1993, <i>Events and Plurals</i>, Cambridge, MA: MIT\nPress.",
                "–––, 2017, <em>And: Conjunction Reduction\nRedux</em>, Cambridge, MA: MIT Press.",
                "Segal, G., 1989, “A Preference for Sense and\nReference”, <em>The Journal of Philosophy</em>, 86:\n73–89.",
                "Soames, S., 1987, “Direct Reference, Propositional\nAttitudes, and Semantic Content”, <em>Philosophical Topics</em>,\n15: 47–87.",
                "–––, 1995, “Beyond Singular\nPropositions”, <em>Canadian Journal of Philosophy</em>, 25:\n515–50.",
                "–––, 2002, <em>Beyond Rigidity</em>, Oxford:\nOxford University Press.",
                "Sommers, F., 1984, <em>The Logic of Natural Language</em>, Oxford:\nOxford University Press.",
                "Stanley, J., 2000, “Context and Logical Form”,\n<em>Linguistics and Philosophy</em>, 23: 391–434.",
                "Strawson, P., 1950, “On Referring”, <em>Mind</em>, 59:\n320–44.",
                "Tarski, A., 1933, “The Concept of Truth in Formalized\nLanguages”, reprinted in Tarski 1983.",
                "–––, 1944, “The Semantic Conception of\nTruth”, <em>Philosophy and Phenomenological Research</em>, 4:\n341–75.",
                "–––, 1983, <em>Logic, Semantics,\nMetamathematics</em>, J. Corcoran (ed.), J.H. Woodger (trans.), 2nd\nedition, Indianapolis: Hackett.",
                "van Benthem, J., 1986, <i>Essays in Logical Semantics</i>,\nDordrecht: D. Reidel.",
                "Wiggins, D., 1980, “‘Most’ and\n‘all’: some comments on a familiar programme, and on th\nclogical form of quantified sentences”, in M. Platts (ed.)\n<i>Reference, truth and reality: Essays on the philosophy of\nlanguage</i>, London: Routledge &amp; Kegan\nPaul, pp. 318–346.",
                "Wittgenstein, L., 1921, <i>Tractatus Logico-Philosophicus</i>, D.\nPears and B. McGuinness (trans.), London: Routledge &amp; Kegan\nPaul.",
                "–––, 1953. <i>Philosophical Investigations</i>,\nNew York: Macmillan.\n</ul>\n<h3>"
            ],
            "Some Other Useful Works": [
                "</h3>\n<p>\nA few helpful overviews of the history and basic subject matter of\nlogic:</p>\n<ul class=\"hanging\">",
                "Kneale, W. &amp; Kneale, M., 1962, <em>The Development of\nLogic</em>, Oxford: Oxford University Press; reprinted 1984.",
                "Sainsbury, M., 1991, <em>Logical Forms</em>, Oxford:\nBlackwell.",
                "Broadie, A., 1987, <em>Introduction to Medieval Logic</em>,\nOxford: Oxford University Press.",
                "For these purposes, Russell’s most important books are:\n<em>Introduction to Mathematical Philosophy</em>, London: George Allen\nand Unwin, 1919; <em>Our Knowledge of the External World</em>, New\nYork: Norton, 1929; and <em>The Philosophy of Logical Atomism</em>, La\nSalle, Ill: Open Court, 1985. Stephen Neale’s\nbook <em>Descriptions</em> (Cambridge, MA: MIT Press, 1990) is a\nrecent development of Russell’s theory.\n</ul>\n<p>\nFor introductions to Transformational Grammar and Chomsky’s\nconception of natural language:</p>\n<ul class=\"hanging\">",
                "Radford, A., 1988, <em>Transformational Grammar</em>, Cambridge:\nCambridge University Press.",
                "Haegeman, L., 1994, <em>Introduction to Government &amp; Binding\nTheory</em>, Oxford: Blackwell.",
                "Lasnik, H. (with M. Depiante and A. Stepanov), 2000, <em>Syntactic\nStructures Revisited</em>, Cambridge, MA: MIT Press.\n</ul>\n<p>\nFor discussions of work in linguistics bearing directly on issues of\nlogical form:</p>\n<ul class=\"hanging\">",
                "Higginbotham, J., 1985, “On Semantics”, <em>Linguistic\nInquiry</em>, 16: 547–93.",
                "Hornstein, N., 1995, <em>Logical Form: From GB to Minimalism</em>,\nOxford: Blackwell.",
                "Larson, R. and Segal, G., 1995, <em>Knowledge of Meaning</em>,\nCambridge, MA: MIT Press.",
                "May, R., 1985, <em>Logical Form: Its Structure and\nDerivation</em>, Cambridge, MA: MIT Press.",
                "Neale, S., 1993, <em>Grammatical Form, Logical Form, and\nIncomplete Symbols</em>, in A. Irvine &amp; G. Wedeking (eds.),\n<em>Russell and Analytic Philosophy</em>, Toronto:\nUniversity of Toronto, pp. 97–139.\n</ul>\n<p>\nFor discussions of the Davidsonian program (briefly described in\n <a href=\"#sem\">section nine</a>)\n and appeal to events:</p>\n<ul class=\"hanging\">",
                "Davidson, D., 1984, <em>Essays on Truth and Interpretation</em>,\nOxford: OUP.",
                "–––, 1985, “Adverbs of Action”, in\nB. Vermazen and M. Hintikka (eds.), <em>Essays on Davidson: Actions\nand Events</em>, Oxford: Clarendon Press, pp. 230–241.",
                "Evans, G. &amp; McDowell, J. (eds.), 1976, <em>Truth and\nMeaning</em>, Oxford: Oxford University Press.",
                "Higginbotham, J., Pianesi, F. and Varzi, A. (eds.), 2000,\n<em>Speaking of Events</em>, Oxford: Oxford University Press.",
                "Ludwig, K. (ed.), 2003, <em>Contemporary Philosophers in Focus:\nDonald Davidson</em>, Cambridge: Cambridge University Pres",
                "Lycan, W., 1984, <em>Logical Form in Natural Language</em>,\nCambridge, MA: MIT Press.",
                "Parsons, T., 1990, <em>Events in the Semantics of English</em>\nCambridge, MA: MIT Press.",
                "Pietroski, P., 2005, <em>Events and Semantic Architecture</em>,\nOxford: Oxford University Press.",
                "Taylor, B., 1985, <em>Modes of Occurrence</em>, Oxford:\nBlackwell.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Cited Works</h3>\n<ul class=\"hanging\">\n<li>Barwise, J. &amp; Cooper, R., 1981, “Generalized Quantifiers\nand Natural Language”, <em>Linguistics and Philosophy</em>, 4:\n159–219.</li>\n<li>Beaney, M., ed., 1997, <em>The Frege Reader</em>, Oxford:\nBlackwell.</li>\n<li>Berwick, B. et al., 2011, “Poverty of the Stimulus\nRevisited”, <em>Cognitive Science</em>, 35: 1207–42.</li>\n<li>Boolos, G., 1998, <em>Logic, Logic, and Logic</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Carnap, R., 1950, “Empiricism, Semantics, and\nOntology”, reprinted in R. Carnap, <em>Meaning and\nNecessity</em>; second edition, Chicago: University of Chicago Press,\n1956.</li>\n<li>Cartwright, R., 1962, “Propositions”, in R. J. Butler,\n<em>Analytical Philosophy</em>, 1st series, Oxford: Basil Blackwell\n1962; reprinted with addenda in Richard Cartwright, <em>Philosophical\nEssays</em>, Cambridge, MA: MIT Press 1987.</li>\n<li>Chomsky, N., 1957, <em>Syntactic Structures</em>, The Hague:\nMouton.</li>\n<li>–––, 1964, <i>Current Issues in Linguistic\nTheory</i>, The Hague: Mouton.</li>\n<li>–––, 1965, <em>Aspects of the Theory of\nSyntax</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 1981, <em>Lectures on Government and\nBinding</em>, Dordrecht: Foris.</li>\n<li>–––, 1986, <em>Knowledge of Language</em>, New\nYork: Praeger.</li>\n<li>–––, 1995, <em>The Minimalist Program</em>,\nCambridge, MA: MIT Press.</li>\n<li>Davidson, D., 1967a, “Truth and Meaning”,\n<em>Synthese</em>, 17: 304–23.</li>\n<li>–––, 1967b, “The Logical Form of Action\nSentences”, in N. Rescher (ed.), <em>The Logic of Decision and\nAction</em>, Pittsburgh: University of Pittsburgh Press.</li>\n<li>–––, 1968, “On Saying That”,\n<em>Synthese</em>, 19: 130–46.</li>\n<li>–––, 1980, <em>Essays on Actions and\nEvents</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1984, <em>Inquiries into Truth and\nInterpretation</em>, Oxford: Oxford University Press.</li>\n<li>Donnellan, K., 1966, “Reference and Definite\nDescriptions”, <em>Philosophical Review</em>, 75:\n281–304.</li>\n<li>Fodor, J., 1978, “Propositional Attitudes”, <em>The\nMonist</em>, 61: 501–23.</li>\n<li>Frege, G., 1879, <em>Begriffsschrift</em>, reprinted in Beaney\n1997.</li>\n<li>–––, 1884, <em>Die Grundlagen der\nArithmetik</em>, Breslau: Wilhelm Koebner. English translation,\n<em>The Foundations of Arithmetic</em>, J. L. Austin (trans). Oxford:\nBasil Blackwell, 1974.</li>\n<li>–––, 1891, “Function and Concept”,\nreprinted in Beaney 1997.</li>\n<li>–––, 1892, “On Sinn and Bedeutung”,\nreprinted in Beaney 1997.</li>\n<li>Gillon, B., 2007, “Pāṇini’s\nAṣṭādhyāyī and Linguistic Theory”,\n<em>Journal of Indian Philosophy</em>, 35: 445–468.</li>\n<li>Harman, G., 1972, “Logical Form”, <em>Foundations of\nLanguage</em>, 9: 38–65.</li>\n<li>–––, 1973, <em>Thought</em>, Princeton: Princeton\nUniversity Press.</li>\n<li>Higginbotham, J., 1986, “Linguistic Theory and\nDavidson’s Program in Semantics”, in E. Lepore (ed.),\n<em>Truth and Interpretation</em>, pp. 29–48, Oxford:\nBlackwell.</li>\n<li>Higginbotham, J. &amp; May, R., 1981, “Questions,\nQuantifiers, and Crossing”, <em>Linguistic Review</em>, 1:\n47–79.</li>\n<li>Hornstein, N., 1995, <em>Logical Form: From GB to Minimalism</em>,\nOxford: Blackwell.</li>\n<li>Huang, J., 1995, “Logical Form”, in G. Webelhuth\n(ed.), <em>Government and Binding Theory and the Minimalist Program:\nPrinciples and Parameters in Syntactic Theory</em>, pp. 127–175,\nOxford: Blackwell.</li>\n<li>Iacona, A., 2018, <em>Logical Form: Between Logic and Natural\nLanguage</em>, Berlin: Springer.</li>\n<li>Jacobson, P., 1999, “Variable Free Semantics”,\n<em>Linguistics and Philosophy</em>, 22: 117–84.</li>\n<li>King, J., 2002, “Two Sorts of Claims about Logical Form\n” in Preyer and Peter 2002.</li>\n<li>–––, <em>The Nature and Structure of\nContent</em>, Oxford: Oxford University Press.</li>\n<li>Keenan, E., 1996, “The Semantics of Determiners”, in\nS. Lappin (ed.), <em>The Handbook of Contemporary Semantic\nTheory</em>, Oxford: Blackwell, pp. 41–63.</li>\n<li>Kratzer, A., 1986, “Severing the External Argument from its\nVerb”, in J. Rooryck and L. Zaring (eds.), <em>Phrase Structure\nand the Lexicon</em>, Dordrecht: Kluwer, pp. 109–137.</li>\n<li>Larson, R. and Ludlow, P., 1993, “Interpreted Logical\nForms”, <em>Synthese</em>, 95: 305–55.</li>\n<li>Lepore, E. and Ludwig, K., 2002, “What is Logical\nForm?”, in Preyer and Peter 2002, pp. 54–90.</li>\n<li>Ludlow, P., 2002, “LF and Natural Logic”, in Preyer\nand Peter 2002, pp. 132–168.</li>\n<li>May, R., 1985, <em>Logical Form: Its Structure and\nDerivation</em>, Cambridge, MA: MIT Press.</li>\n<li>Montague, R., 1970, “English as a Formal Language”, in\nR. Thomason (ed.), <em>Formal Philosophy</em>, New\nHaven, CT: Yale University Press, 1974, pp. 7–27.</li>\n<li>Parsons, T., 2014, <em>Articulating Medieval Logic</em>, Oxford:\nOxford University Press.</li>\n<li>Pietroski, P., 2018, <em>Conjoining Meanings</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Preyer, G. and Peter, G. (eds.), 2002, <em>Logical Form and\nLanguage</em>, Oxford: Oxford University Press.</li>\n<li>Quine, W.V.O., 1950, <em>Methods of Logic</em>, New York: Henry\nHolt.</li>\n<li>–––, 1951, “Two Dogmas of\nEmpiricism”, <em>Philosophical Review</em>, 60:\n20–43.</li>\n<li>–––, 1953, “On What There Is”, in\n<i>From a Logical Point of View</i>, Cambridge, MA:\nHarvard University Press, pp. 1–19.</li>\n<li>–––, 1960, <em>Word and Object</em>, Cambridge\nMA: MIT Press.</li>\n<li>–––, 1970, <em>Philosophy of Logic</em>,\nEnglewood Cliffs, NJ: Prentice Hall.</li>\n<li>Ramsey, F., 1927, “Facts and Propositions”,\n<em>Proceedings of the Aristotelian Society</em> (Supplementary\nVolume), 7: 153–170.</li>\n<li>Sànchez, V., 1991, <em>Studies on Natural Logic and\nCategorial Grammar</em>, Ph.D. Thesis, University of Amsterdam.</li>\n<li>—1994, “Montonicity in Medieval Logic”,\n<i>Language and Cognition</i>, 4: 161–74.</li>\n<li>Schein, B., 1993, <i>Events and Plurals</i>, Cambridge, MA: MIT\nPress.</li>\n<li>–––, 2017, <em>And: Conjunction Reduction\nRedux</em>, Cambridge, MA: MIT Press.</li>\n<li>Segal, G., 1989, “A Preference for Sense and\nReference”, <em>The Journal of Philosophy</em>, 86:\n73–89.</li>\n<li>Soames, S., 1987, “Direct Reference, Propositional\nAttitudes, and Semantic Content”, <em>Philosophical Topics</em>,\n15: 47–87.</li>\n<li>–––, 1995, “Beyond Singular\nPropositions”, <em>Canadian Journal of Philosophy</em>, 25:\n515–50.</li>\n<li>–––, 2002, <em>Beyond Rigidity</em>, Oxford:\nOxford University Press.</li>\n<li>Sommers, F., 1984, <em>The Logic of Natural Language</em>, Oxford:\nOxford University Press.</li>\n<li>Stanley, J., 2000, “Context and Logical Form”,\n<em>Linguistics and Philosophy</em>, 23: 391–434.</li>\n<li>Strawson, P., 1950, “On Referring”, <em>Mind</em>, 59:\n320–44.</li>\n<li>Tarski, A., 1933, “The Concept of Truth in Formalized\nLanguages”, reprinted in Tarski 1983.</li>\n<li>–––, 1944, “The Semantic Conception of\nTruth”, <em>Philosophy and Phenomenological Research</em>, 4:\n341–75.</li>\n<li>–––, 1983, <em>Logic, Semantics,\nMetamathematics</em>, J. Corcoran (ed.), J.H. Woodger (trans.), 2nd\nedition, Indianapolis: Hackett.</li>\n<li>van Benthem, J., 1986, <i>Essays in Logical Semantics</i>,\nDordrecht: D. Reidel.</li>\n<li>Wiggins, D., 1980, “‘Most’ and\n‘all’: some comments on a familiar programme, and on th\nclogical form of quantified sentences”, in M. Platts (ed.)\n<i>Reference, truth and reality: Essays on the philosophy of\nlanguage</i>, London: Routledge &amp; Kegan\nPaul, pp. 318–346.</li>\n<li>Wittgenstein, L., 1921, <i>Tractatus Logico-Philosophicus</i>, D.\nPears and B. McGuinness (trans.), London: Routledge &amp; Kegan\nPaul.</li>\n<li>–––, 1953. <i>Philosophical Investigations</i>,\nNew York: Macmillan.</li>\n</ul>\n<h3>Some Other Useful Works</h3>\n<p>\nA few helpful overviews of the history and basic subject matter of\nlogic:</p>\n<ul class=\"hanging\">\n<li>Kneale, W. &amp; Kneale, M., 1962, <em>The Development of\nLogic</em>, Oxford: Oxford University Press; reprinted 1984.</li>\n<li>Sainsbury, M., 1991, <em>Logical Forms</em>, Oxford:\nBlackwell.</li>\n<li>Broadie, A., 1987, <em>Introduction to Medieval Logic</em>,\nOxford: Oxford University Press.</li>\n<li>For these purposes, Russell’s most important books are:\n<em>Introduction to Mathematical Philosophy</em>, London: George Allen\nand Unwin, 1919; <em>Our Knowledge of the External World</em>, New\nYork: Norton, 1929; and <em>The Philosophy of Logical Atomism</em>, La\nSalle, Ill: Open Court, 1985. Stephen Neale’s\nbook <em>Descriptions</em> (Cambridge, MA: MIT Press, 1990) is a\nrecent development of Russell’s theory.</li>\n</ul>\n<p>\nFor introductions to Transformational Grammar and Chomsky’s\nconception of natural language:</p>\n<ul class=\"hanging\">\n<li>Radford, A., 1988, <em>Transformational Grammar</em>, Cambridge:\nCambridge University Press.</li>\n<li>Haegeman, L., 1994, <em>Introduction to Government &amp; Binding\nTheory</em>, Oxford: Blackwell.</li>\n<li>Lasnik, H. (with M. Depiante and A. Stepanov), 2000, <em>Syntactic\nStructures Revisited</em>, Cambridge, MA: MIT Press.</li>\n</ul>\n<p>\nFor discussions of work in linguistics bearing directly on issues of\nlogical form:</p>\n<ul class=\"hanging\">\n<li>Higginbotham, J., 1985, “On Semantics”, <em>Linguistic\nInquiry</em>, 16: 547–93.</li>\n<li>Hornstein, N., 1995, <em>Logical Form: From GB to Minimalism</em>,\nOxford: Blackwell.</li>\n<li>Larson, R. and Segal, G., 1995, <em>Knowledge of Meaning</em>,\nCambridge, MA: MIT Press.</li>\n<li>May, R., 1985, <em>Logical Form: Its Structure and\nDerivation</em>, Cambridge, MA: MIT Press.</li>\n<li>Neale, S., 1993, <em>Grammatical Form, Logical Form, and\nIncomplete Symbols</em>, in A. Irvine &amp; G. Wedeking (eds.),\n<em>Russell and Analytic Philosophy</em>, Toronto:\nUniversity of Toronto, pp. 97–139.</li>\n</ul>\n<p>\nFor discussions of the Davidsonian program (briefly described in\n <a href=\"#sem\">section nine</a>)\n and appeal to events:</p>\n<ul class=\"hanging\">\n<li>Davidson, D., 1984, <em>Essays on Truth and Interpretation</em>,\nOxford: OUP.</li>\n<li>–––, 1985, “Adverbs of Action”, in\nB. Vermazen and M. Hintikka (eds.), <em>Essays on Davidson: Actions\nand Events</em>, Oxford: Clarendon Press, pp. 230–241.</li>\n<li>Evans, G. &amp; McDowell, J. (eds.), 1976, <em>Truth and\nMeaning</em>, Oxford: Oxford University Press.</li>\n<li>Higginbotham, J., Pianesi, F. and Varzi, A. (eds.), 2000,\n<em>Speaking of Events</em>, Oxford: Oxford University Press.</li>\n<li>Ludwig, K. (ed.), 2003, <em>Contemporary Philosophers in Focus:\nDonald Davidson</em>, Cambridge: Cambridge University Pres</li>\n<li>Lycan, W., 1984, <em>Logical Form in Natural Language</em>,\nCambridge, MA: MIT Press.</li>\n<li>Parsons, T., 1990, <em>Events in the Semantics of English</em>\nCambridge, MA: MIT Press.</li>\n<li>Pietroski, P., 2005, <em>Events and Semantic Architecture</em>,\nOxford: Oxford University Press.</li>\n<li>Taylor, B., 1985, <em>Modes of Occurrence</em>, Oxford:\nBlackwell.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "analysis",
            "analytic/synthetic distinction",
            "Aristotle, General Topics: logic",
            "behaviorism",
            "Carnap, Rudolf",
            "Davidson, Donald",
            "descriptions",
            "Frege, Gottlob",
            "Frege, Gottlob: theorem and foundations for arithmetic",
            "generalized quantifiers",
            "logic: classical",
            "logic: modal",
            "logical consequence",
            "model theory",
            "names",
            "propositional attitude reports",
            "propositions",
            "propositions: singular",
            "propositions: structured",
            "Quine, Willard Van Orman",
            "reference",
            "relations: medieval theories of",
            "rigid designators",
            "Russell, Bertrand",
            "Russell’s paradox",
            "syllogism: medieval theories of",
            "terms, properties of: medieval theories of",
            "vagueness"
        ],
        "entry_link": [
            {
                "../analysis/": "analysis"
            },
            {
                "../analytic-synthetic/": "analytic/synthetic distinction"
            },
            {
                "../aristotle-logic/": "Aristotle, General Topics: logic"
            },
            {
                "../behaviorism/": "behaviorism"
            },
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../frege-theorem/": "Frege, Gottlob: theorem and foundations for arithmetic"
            },
            {
                "../generalized-quantifiers/": "generalized quantifiers"
            },
            {
                "../logic-classical/": "logic: classical"
            },
            {
                "../logic-modal/": "logic: modal"
            },
            {
                "../logical-consequence/": "logical consequence"
            },
            {
                "../model-theory/": "model theory"
            },
            {
                "../names/": "names"
            },
            {
                "../prop-attitude-reports/": "propositional attitude reports"
            },
            {
                "../propositions/": "propositions"
            },
            {
                "../propositions-singular/": "propositions: singular"
            },
            {
                "../propositions-structured/": "propositions: structured"
            },
            {
                "../quine/": "Quine, Willard Van Orman"
            },
            {
                "../reference/": "reference"
            },
            {
                "../relations-medieval/": "relations: medieval theories of"
            },
            {
                "../rigid-designators/": "rigid designators"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../russell-paradox/": "Russell’s paradox"
            },
            {
                "../medieval-syllogism/": "syllogism: medieval theories of"
            },
            {
                "../medieval-terms/": "terms, properties of: medieval theories of"
            },
            {
                "../vagueness/": "vagueness"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logical-form\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/logical-form/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=logical-form&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/logical-form/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=logical-form": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/logical-form/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=logical-form&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/logical-form/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://en.wikipedia.org/wiki/Logical_form_(linguistics)\">Logical Form (linguistics)</a>,\n entry on Wikipedia"
        ],
        "listed_links": [
            {
                "https://en.wikipedia.org/wiki/Logical_form_(linguistics)": "Logical Form (linguistics)"
            }
        ]
    }
}