{
    "url": "ludwig-feuerbach",
    "title": "Ludwig Andreas Feuerbach",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Todd Gooch\n<todd.gooch@eku.edu>",
        "author_links": [
            {
                "http://philosophy.eku.edu/people/gooch": "Todd Gooch"
            },
            {
                "mailto:todd%2egooch%40eku%2eedu": "todd.gooch@eku.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"http://philosophy.eku.edu/people/gooch\" target=\"other\">Todd Gooch</a>\n&lt;<a href=\"mailto:todd%2egooch%40eku%2eedu\"><em>todd<abbr title=\" dot \">.</abbr>gooch<abbr title=\" at \">@</abbr>eku<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Dec 9, 2013",
        "substantive revision Wed Sep 20, 2023"
    ],
    "preamble": "\n\nFor a number of years in the mid-nineteenth century, Ludwig Feuerbach\n(1804–1872) played a pivotal role in the history of\npost-Hegelian German philosophy, and in the emergence of various forms\nof naturalism, materialism, and positivism that is one of the most\ncharacteristic developments of this period (cf. Mandelbaum 1971:\n3–37 and Arndt & Jaeschke 2000). As a public intellectual in\nGermany during the decade that culminated in the revolutionary\nuprising of 1848, Feuerbach embodied many of the democratic and\nprogressive aspirations that were frustrated by its eventual failure.\nThereafter, during a decade of political reaction, he was an\ninspiration to such populizers of scientific materialism as Carl Vogt,\nJacob Moleschott, and Ludwig Büchner, whose role in the\nsecularization of modern culture in the second half of the nineteenth\ncentury was considerable (cf. Gregory 1977). By virtue of the enduring\ninfluence of his most famous book, The Essence of\nChristianity, which was translated into English by George Eliot,\nFeuerbach has continued, since the beginning of the twentieth century,\nto attract the interest of theologians. The theological reception of\nFeuerbach has been shaped to a considerable extent by the disputed\ncontention first expressed in the 1920s by the Neo-Orthodox\ntheologian, Karl Barth, that Feuerbach’s atheistic account of\nChristianity only brought to their most logically consistent\nconclusion the foundational premises of the liberal Protestant\ntheological enterprise inaugurated by Friedrich Schleiermacher at the\noutset of the nineteenth century. This enterprise, which Barth and a\nnumber of his contemporaries sought to repudiate, had, in the wake of\nHume and Kant, shifted the starting point of theological reflection\nfrom divine revelation and metaphysics to human religious experience.\nIn the field of religious studies (as distinct from theology),\nFeuerbach is often considered to have produced a classical\n“projection” theory of religion. Such theories seek to\nidentify the underlying psychological and cognitive mechanisms that\ngive rise to, and explain the persistence of, various religious\nbeliefs and\n behaviors.[1]\n\n\nTo the extent that Feuerbach is remembered today outside the context\nof theology and religious studies, it is mainly as the object of Karl\nMarx’s criticism in his famous Theses on Feuerbach,\noriginally penned in 1845, but first published posthumously by\nFriedrich Engels as an appendix to his book, Ludwig Feuerbach and\nthe End of Classical German Philosophy (Engels 1888). These\ntheses are often thought to represent the first cursory articulation\nof the theory that subsequently came to be known as historical\nmaterialism. This theory began to be spelled out in more detail by\nMarx and Engels in The German Ideology, a lengthy work in\nwhich they sought to distance themselves from their erstwhile Young\nHegelian compatriots. Renewed philosophical attention paid to\nFeuerbach in the middle of the twentieth century is largely\nattributable to the publication for the first time, beginning in the\nlate 1920s, of Marx’s early philosophical manuscripts, including\nThe German Ideology, which revealed the extent of\nFeuerbach’s influence on Marx and Engels during the period\nculminating in its composition\n (1845–46).[2]\n In 1870, two years prior to his death, after having studied the first\nvolume of Marx’s Capital (1867), Feuerbach became a\nmember of the Social Democratic Party, some financial support from\nwhich helped him to survive the penury to which he and his family were\nsubjected toward the end of his life. Feuerbach’s funeral\nprocession in Nuremberg is said to have been attended by crowds waving\nred banners, the symbol of the worker’s movement. Nevertheless,\nFeuerbach’s direct public influence and popularity as a\nphilosophical writer declined rapidly in the 1850s in approximately\ninverse proportion to the rising, albeit belated, influence of\nSchopenhauer, whose spirit of pessimistic resignation was perhaps more\nin tune with the prevailing historical reality.\n\nApart from the influences outlined above, Feuerbach’s importance\nfor the history of modern philosophy is due to the fact that the\npublication of The Essence of Christianity in 1841 can be\ntaken, as it was by Engels, to symbolically mark the end of the period\nof classical German philosophy that had begun sixty years earlier with\nthe appearance of Kant’s Critique of Pure\nReason—though some might want to question the assumption\ninvolved in this way of putting things that classical German\nphilosophy culminated in the Hegelian system that Engels thought of\nFeuerbach as having\n overthrown.[3]\n In any case, Feuerbach’s intellectual biography; his initially\ndeep investment in, and subsequent effort to distance himself from,\nthe Hegelian cause; and his attempt to inaugurate a new, sensualistic\n“philosophy of the future,” are all closely intertwined\nwith political and intellectual developments in Germany during this\n period.[4]\n Although Feuerbach ultimately failed to adequately develop the\naphoristically formulated “principles” of the new\nphilosophy that he set out in 1843, the emphases in his later essays\non corporeality, the senses, finitude, inter-subjectivity, and drive\npsychology nevertheless succeeded in introducing into the history of\nmodern European thought themes developed further by Marx, Friedrich\nNietzsche, Sigmund Freud, Max Scheler, Martin Buber, Karl Löwith,\nMaurice Merleau-Ponty and Alfred Schmidt, among\n others.[5]\n\n",
    "toc": [
        {
            "#BiogIntr": "1. Biographical Introduction"
        },
        {
            "#EarlIdeaPant": "2. Early Idealistic Pantheism"
        },
        {
            "#FeueHistPhil": "3. Feuerbach as Historian of Philosophy"
        },
        {
            "#CritChri": "4. The Critique of Christianity"
        },
        {
            "#NewPhil": "5. The “New” Philosophy"
        },
        {
            "#LateTheoReli": "6. The Later Theory of Religion"
        },
        {
            "#NatuEthiFeueLastWrit": "7. The Naturalization of Ethics in Feuerbach’s Last Writings"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#FeueWork": "Feuerbach Works"
        },
        {
            "#OtheRefe": "Other References"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Biographical Introduction\n\nLudwig was the fourth son of the distinguished jurist, Paul Johann\nAnselm Ritter von Feuerbach. His nephew, the neo-classical painter,\nAnselm Feuerbach, was the son of Ludwig’s older brother, also\ncalled Anselm, who was himself a classical archaeologist and\naesthetician “in the spirit of Gotthold Ephraim Lessing and\nJohann Joachim\n Winckelmann”.[6]\n Ludwig’s father, who studied philosophy and law at Jena in the\n1790s with the Kantians, Karl Reinhold and Gottlieb Hufeland,\nrespectively, belonged to a group of distinguished northern German\nscholars called to Bavaria during the period of administrative reform\nunder Maximilian Montgelas and charged with the task of modernizing\nthe legal and educational institutions of what became in 1806 the\nmodern kingdom of Bavaria. Other members of this group of so-called\nNordlichter or “northern lights” included F.I.\nNiethammer, F.H. Jacobi (the godfather of Ludwig’s younger\nbrother, Friedrich), and Friedrich Thiersch (the tutor of\nLudwig’s two oldest brothers, who has sometimes been called\n“the Humboldt of Bavaria”). P.J.A. Feuerbach was knighted\nin recognition of his achievement in modernizing the Bavarian penal\ncode, though his political influence was dramatically curtailed as a\nresult of outspoken national-liberal criticisms of Napoleon expressed\nin pamphlets he published in 1813 and 1814 (cf. Tomasoni 2015:\n16–25).\n\nRaised Protestant and religiously devout in his youth, Ludwig\nmatriculated in 1823 in the theological faculty of the University of\nHeidelberg, where his father hoped he would come under the influence\nof the late rationalist, H.E.G. Paulus. Ludwig was won over instead by\nthe speculative theologian, Karl Daub, who had been instrumental in\nbringing Hegel to Heidelberg for two years in 1816, and was by this\ntime one of the foremost theologians of the Hegelian school. By 1824,\nLudwig had secured his father’s grudging permission to transfer\nto Berlin under the pretext of wanting to study with the theologians,\nFriedrich Schleiermacher and August Neander, but in fact because of\nhis growing infatuation with Hegel’s philosophy.\nFeuerbach’s matriculation at Berlin was delayed because of\nsuspicions of his involvement in the politically subversive student\nfraternity (Burschenschaft) movement, in which two of his\nolder brothers were active, for which reason one of them (Karl, a\ntalented mathematician) was imprisoned and subsequently attempted\nsuicide. In 1825, to his father’s consternation, Ludwig\ntransferred to the philosophical faculty, thereafter hearing within a\ntwo-year period all of Hegel’s lectures, except for those on\naesthetics, repeating the lectures on logic\n twice.[7]\n\nFeuerbach defended his Latin dissertation, De ratione, una,\nuniversali, infinita, at the University of Erlangen in 1828. Soon\nthereafter, he began to deliver lectures on the history of modern\nphilosophy at the same university, a bastion of theological and\npolitical conservatism many of whose faculty were closely associated\nwith the neo-Pietist Awakening. One colleague of Feuerbach’s at\nErlangen was Julius Friedrich Stahl, who would go on to become a\nleading theorist of conservatism, and was associated by Feuerbach with\nthe so-called “positive philosophy” of the late Schelling.\nFeuerbach imprudently appended to his first book, Thoughts on\nDeath and Immortality (1830, hereafter Thoughts; see\n Section 2\n below), which was published anonymously, but to no avail, a number of\nscathingly satirical and even vulgar couplets (Xenien)\ndirected against the Pietists that effectively destroyed his prospects\nfor an academic career.\n\nDuring the 1830s, Feuerbach published three books on the history of\nmodern philosophy, in addition to several essays and reviews. These\ninclude the History of Modern Philosophy from Bacon to\nSpinoza (1833), History of Modern Philosophy: Presentation,\nDevelopment, and Critique of the Leibnizian Philosophy (1837),\nand Pierre Bayle: A Contribution to the History of Philosophy and\nHumanity (1838), none of which have been translated into\n English.[8]\n The first won him the praise of Edward Gans and an invitation from\nLeopold von Henning to contribute reviews to the Annals for\nScientific Criticism, the principal journal of the Hegelian\nacademic establishment in Berlin. In these reviews, Feuerbach defended\nthe Hegelian philosophy vigorously against critics such as Karl\nBachmann. Even after the publication of the works on Leibniz and\nBayle, however, his efforts to secure an academic appointment remained\nunsuccessful. He was able for several decades to sustain his existence\nas an independent scholar in the remote Frankish village of Bruckberg\nby virtue of his wife, Bertha Löw, having been partial heir of a\nporcelain factory located there, from a modest pension due to his\nfather’s service to Bavaria, and from publishing royalties.\n\nThe event that precipitated the gradual dissolution of the Hegelian\nsynthesis of faith and knowledge (a process later referred to\nsardonically by Marx and Engels as the “putrefaction of absolute\nspirit”) was the publication in two volumes in 1835–36 of\nD.F. Strauss’s Life of Jesus Critically Examined. In\nthis controversial work, Strauss used the tools of historical\ncriticism he had acquired from his Tübingen teacher, F.C. Baur,\nto develop a compelling argument for the historical unreliability of\nthe accounts of the life of Jesus preserved in the canonical gospels.\nIn a relatively brief “concluding dissertation” at the end\nof this lengthy work of biblical criticism, Strauss appealed to\nHegel’s philosophy in proposing to interpret the doctrine of the\nincarnation of Christ as a mythological expression of the\nphilosophical truth of the identity of the divine spirit and the human\nspecies (conceived as the community of finite spirits existing\nthroughout history, and not as the historical individual, Jesus of\nNazareth). The appearance of Strauss’s book confirmed the\nsuspicions of theological conservatives like E.W. Hengstenberg and\nHeinrich Leo that Hegel’s philosophy, despite its use of\nChristian terminology, is incompatible with the historical faith, and\nthe editors of the Berlin Annals felt compelled to publicly discredit\nStrauss’s Hegelian credentials. It was in the wake of these\nevents that Arnold Ruge and Theodor Echtermeyer established the\nHalle Annals for German Science and Art, which served for\nseveral years as the principal literary organ of the so-called Young\nHegelians. Among the essays and reviews that Feuerbach began to\ncontribute to the Halle Annals in 1838 is one entitled\n“Toward a Critique of the Hegelian Philosophy” (1839), in\nwhich he began to distance himself publicly from the Hegelian cause,\ncalling for a “return to nature,” as well as for a\nnaturalistic explanation of the mysteries of Christianity and of\nreligion more\n generally.[9]\n Publication of the Halle Annals was suspended by the\nPrussian censor in 1841.\n\nFeuerbach achieved the height of his brief literary fame with the\npublication, also in 1841, of The Essence of Christianity, a\nwork that made a striking impression on a number of his\ncontemporaries. Engels recalled the appearance of this book as having\na profoundly “liberating effect” on him and Marx by\n“breaking the spell” of the Hegelian system and\nestablishing the truths that human consciousness is the only\nconsciousness or spirit that exists, and that it is ontologically\ndependent upon the physical existence of human beings as part of\nnature (Engels 1888: 12–13). In 1844, Marx wrote to Feuerbach,\nwith reference to the latter’s Principles of the Philosophy\nof the Future (1843; hereafter Principles) and The\nEssence of Faith According to Luther (1844), that in them he had,\nintentionally or not, “given socialism a philosophical\nfoundation” (GW v. 18, p. 376). In fact, Feuerbach was\nonly then beginning to acquaint himself with socialist ideas through\nhis reading of authors like Lorenz von Stein and Wilhelm Weitling. In\nthe end, he declined Marx’s request for a contribution to the\nGerman-French Annals, as well as Ruge’s urging that he\nbecome more politically engaged. He came out of rural seclusion to\nobserve, with great anticipation followed by mounting disillusionment,\nthe events in Frankfurt in 1848, and to deliver a series of public\nlectures at Heidelberg beginning the same year. Rather than working to\nspell out in detail the “philosophy of the future” for\nwhich he himself had called in the early 1840s, Feuerbach continued to\nfocus his attention mainly on religion in works including The\nEssence of Religion (1845), Lectures on the Essence of\nReligion (1851), and Theogony According to the Sources of\nClassical, Hebrew and Christian Antiquity (1857). The five years\nof philological labor he invested in the latter work, which he\nconsidered his crowning achievement, went largely unnoticed both by\nhis contemporaries and by posterity.\n\nDuring the 1840s, Feuerbach corresponded, and occasionally visited and\nmaintained close personal relationships with, several leading German\nradicals, including, in addition to Ruge and Marx, the publishers,\nOtto Lüning, Otto Wigand, and Julius Fröbel; the\nrevolutionary poet, Georg Herwegh, and his wife, Emma; Hermann Kriege,\na freelance activist and early German socialist who emigrated to\nAmerica; as well as the scientific materialists, Carl Vogt and Jacob\nMoleschott. It was in a review of a book on nutrition published by the\nlatter figure that Feuerbach famously quipped, “Man ist, was man\nißt,” making a play on words that doesn’t come\nthrough in the English expression, “You are what you eat.”\nThe impression made by Feuerbach on several leading lights of the\nyounger generation is reflected in Gottfried Keller’s\nBildungsroman, Green Henry (1855), which features a\ncharacter inspired by Feuerbach, as well as in the original dedication\n(to Feuerbach) of Richard Wagner’s early book, The Art-Work\nof the Future (1850).\n\nPartly as the result of a global financial crisis, the porcelain\nfactory that had supported Feuerbach’s literary existence went\nbankrupt in 1859. The following year he and his wife and daughter were\nforced to relocate to the village of Rechenberg, located then on the\noutskirts of Nuremberg, where Feuerbach lived out the remainder of his\nlife in increasingly ill health. Although his productivity as a writer\ndeclined sharply during this period, he was able, in 1866, to bring\nout the tenth and final volume of his collected works (which had begun\nto appear in 1846), bearing the title, God, Freedom and\nImmortality from the Standpoint of Anthropology, and including a\nfairly substantial, though fragmentary, essay “On Spiritualism\nand Materialism, Especially in Relation to the Freedom of the\nWill”. In this essay, and in an essay on ethics that Feuerbach\nleft incomplete at his death, we find him beginning to sketch out a\nmoral psychology, and an eudaimonistic ethical theory, in which the\nconcept of the “drive-to-happiness”\n(Glückseligkeitstrieb) plays a central role.\n2. Early Idealistic Pantheism\n\nIn an essay published in 1835, Heinrich Heine observed that pantheism\nhad by this time become “the secret religion of\n Germany”.[10]\n That Feuerbach is generally remembered as an atheist and a\nmaterialist has tended to obscure the fact that he began his\nphilosophical career as an enthusiastic adherent of this philosophical\nreligion, one early expression of which can be found in the Greek\nwords “Hen kai Pan” (One and All) inscribed in\n1791 by Hölderlin in Hegel’s student album from\nTübingen (cf. Pinkard 2000:\n 32).[11]\n This inscription is an allusion to words uttered by Lessing after\nreading Goethe’s poem-fragment, “Prometheus”, and\nresponding enthusiastically by declaring himself a Spinozist,\naccording to the account contained in Jacobi’s famous\nLetters on the Doctrine of Spinoza (1785; cf. Jacobi [MPW]:\n187). It was the publication of these letters that set off the\noriginal Pantheism Controversy, and had the unintended effect of\nleading more than one generation of young German poets and thinkers to\nregard Spinoza no longer as a “dead dog” and a godless\natheist, but rather as the God-intoxicated sage of a pantheistic creed\nin which those who, like Lessing, could no longer\n“stomach” orthodox conceptions of the divinity that make a\nstrict distinction between creator and creation, could seek to satisfy\ntheir spiritual aspirations. Feuerbach included several verses of the\nPrometheus-fragment as an epigram to his first book, in which he used\nthe tools of Hegelian logic to develop a conception of the divinity as\nOne and All along lines laid out by Spinoza, Giordano Bruno and Jacob\nBoehme. These three he hailed as ‘pious God-inspired\nsages’ (GTU 241/48) who set the table for the ‘feast of\nreconciliation’ (GTU 463/214) between nature and spirit that it\nis that task of the modern age to celebrate. But this reconciliation,\nhe argued, cannot occur as long as God continues to be thought of as\nan individual person existing independently of the world.\n\nThat Feuerbach, unlike Strauss, never accepted Hegel’s\ncharacterization of Christianity as the consummate religion is clear\nfrom the contents of a letter he sent to Hegel along with his\ndissertation in\n 1828.[12]\n In this letter he identified the historical task remaining in the\nwake of Hegel’s philosophical achievement to be the\nestablishment of the “sole sovereignty of reason” in a\n“kingdom of the Idea” that would inaugurate a new\nspiritual dispensation. Foreshadowing arguments put forward in his\nfirst book, Feuerbach went on in this letter to emphasize the need for\n“the I, the self in general, which especially since the\nbeginning of the Christian era, has ruled the world and has thought of\nitself as the only spirit that exists at all [to be] cast down from\nits royal throne” (GW v. 17, Briefwechsel I\n(1817–1839), 103–08). This, he proposed, would require\nprevailing ways of thinking about time, death, this world and the\nbeyond, individuality, personhood and God to be radically transformed\nwithin and beyond the walls of academia.\n\nFeuerbach made his first attempt to challenge prevailing ways of\nthinking about individuality in his inaugural dissertation, where he\npresented himself as a defender of speculative philosophy against\nthose critics who claim that human reason is restricted to certain\nlimits beyond which all inquiry is futile, and who accuse speculative\nphilosophers of having transgressed these. This criticism, he argued,\npresupposes a conception of reason is a cognitive faculty of the\nindividual thinking subject that is employed as an instrument for\napprehending truths. He aimed to show that this view of the nature of\nreason is mistaken, that reason is one and the same in all thinking\nsubjects, that it is universal and infinite, and that thinking\n(Denken) is not an activity performed by the individual, but\nrather by “the species” acting through the individual.\n“In thinking”, Feuerbach wrote, “I am bound together\nwith, or rather, I am one with—indeed, I myself am—all\nhuman beings” (GW I:18).\n\nIn the introduction to Thoughts Feuerbach assumes the role of\ndiagnostician of a spiritual malady by which he claims that modern\nmoral subjects are afflicted. This malady, which he does not name but\nmight have called either individualism or egoism, he takes to be the\ndefining feature of the modern age insofar as this age conceives of\n“the single human individual for himself in his individuality\n[…] as divine and infinite” (GTU 189/10). The\nprincipal symptom of this malady is the loss of “the perception\n[Anschauung] of the true totality, of oneness and life in one\nunity” (GTU 264/66). This loss Feuerbach finds\nreflected in three general tendencies of the modern age: 1) the\ntendency to regard human history solely as the history of the opinions\nand actions of individual human subjects, and not as the history of\nhumanity conceived as a single collective agent; 2) the tendency to\nregard nature as a mere aggregate of “countless single stars,\nstones, plants, animals, elements and things” (GTU\n195/14) whose relations to one another are entirely external and\nmechanical, rather than as an organic whole the internal dynamics of\nwhich are animated by a single all-encompassing vital principle; and\n3) the tendency to conceive of God as a personal agent whose\ninscrutable will, through which the world came into being from nothing\nand is continually directed, is unconstrained by rational\nnecessity.\n\nFeuerbach’s basic objection to the theistic conception of God\nand his relation to creation is that, on it, both are conceived as\nequally spiritless. Rather than consisting of lifeless matter to which\nmotion is first imparted by the purposeful action of an external\nagent, Feuerbach argues that nature contains within itself the\nprinciple of its own development. It exercises “unlimited\ncreative power” by ceaselessly dividing and distinguishing its\nindividual parts from one another. But the immeasurable multiplicity\nof systems within systems that results from this activity constitutes\na single organic totality.\n\n\nNature is ground and principle of itself, or—what is the same\nthing, it exists out of necessity, out of the soul, the essence of\nGod, in which he is one with nature. (GTU 291/86)\n\n\nGod, on this view, is not a skilled mechanic who acts upon the world,\nbut a prolific artist who lives in and through it.\n\nIn Thoughts, Feuerbach further argues that the death of\nfinite individuals is not merely an empirical fact, but also an a\npriori truth that follows from a proper understanding of the\nrelations between the infinite and the finite, and between essence and\nexistence. Nature is the totality of finite individuals existing in\ndistinction from one another in time and space. Since to be a finite\nindividual is not to be any number of other individuals from which one\nis distinct, non-being is not only the condition of individuals before\nthey have begun to exist and after they have ceased to do so, but also\na condition in which they participate by being the determinate\nentities that they are. Thus, being and non-being, or life and death,\nare equally constitutive of the existence of finite entities\nthroughout the entire course of their generation and destruction.\n\nEverything that exists has an essence that is distinct from its\nexistence. Although individuals exist in time and space, their\nessences do not. Essence in general is timeless and unextended.\nFeuerbach nevertheless regards it as a kind of cognitive space in\nwhich individual essences are conceptually contained. Real or\nthree-dimensional space, within which individual things and people\nexist in distinction from one another and in temporal succession, he\nthinks of as essence “in the determination of its\nbeing-outside-of-itself” (GTU 250/55). In his\nbeing-one, Feuerbach argues, God is everything-as-one, and is, as\nsuch, the universal essence in which all finite essences are\n“grounded, contained and comprehended\n[begriffen]” (GTU 241/48).\n\nIt is by means of Empfindung or sense experience that\nsentient beings are able to distinguish individuals from one another,\nincluding, in some instances, individuals that share the same essence.\nThe form of experience is temporality, which is to say that whatever\nis directly experienced occurs “now”, or at the moment in\ntime to which we refer as “the present”. Experience, in\nother words, is essentially transitory, and its contents are\nincommunicable. What we experience are the perceivable features of\nindividual objects. It is through the act of thinking that we are able\nto identify those features through the possession of which different\nindividuals belong to the same species, with the other members of\nwhich they share these essential features in common.\n\nUnlike sense experience, thought is essentially communicable. Thinking\nis not an activity performed by the individual person qua\nindividual. It is the activity of spirit, to which Hegel famously\nreferred in the Phenomenology as “‘I’ that\nis ‘We’ and ‘We’ that is\n‘I’” (Hegel [1807] 1977: 110). Pure spirit is\nnothing but this thinking activity, in which the individual thinker\nparticipates without himself (or herself) being the principal thinking\nagent. That thoughts present themselves to the consciousness of\nindividual thinking subjects in temporal succession is due not to the\nnature of thought itself, but to the nature of individuality, and to\nthe fact that individual thinking subjects, while able to participate\nin the life of spirit, do not cease in doing so to exist as\ncorporeally distinct entities who remain part of nature, and are thus\nnot pure spirit.\n\nA biological species is both identical with, and distinct from, the\nindividual organisms of which it is composed. The species has no\nexistence apart form these individual organisms, and yet the\nperpetuation of the species involves the perpetual generation and\ndestruction of these particular individuals. Similarly,\nSpirit has no existence apart from the existence of individual\nself-conscious persons in whom Spirit becomes conscious of itself\n(i.e., constitutes itself as Spirit). Just as the life of a biological\nspecies only appears in the generation and destruction of individual\norganisms, so the life of Spirit involves the generation and\ndestruction of these individual persons. Viewed in this light,\nFeuerbach maintains, the death of the individual is necessitated by\nthe life of infinite Spirit.\n\n\nDeath is just the withdrawal and departure of your objectivity from\nyour subjectivity, which is eternally living activity and therefore\neverlasting and immortal. (GTU 323/111)\n\n\nArguing thus, he urges his readers to acknowledge and accept the\nirreversibility of their individual mortality so that, in doing so,\nthey might come to an awareness of the immortality of their\nspecies-essence, and thus to knowledge of their true self, which is\nnot the individual person with whom they are accustomed to identifying\nthemselves. They will then be in a position to recognize that, while\n“the shell of death is hard, its kernel is sweet”\n(GTU 205/20), and that the true belief in immortality is\n\n\na belief in the infinity of Spirit and in the everlasting youth of\nhumanity, in the inexhaustible love and creative power of Spirit, in\nits eternally unfolding itself into new individuals out of the womb of\nits plenitude and granting new beings for the glorification,\nenjoyment, and contemplation of itself. (GTU 357/137)\n\n\nIn light of the emphasis placed in his later works on the pressing\nexistential needs of the embodied individual subject, it should be\nnoted that, during his early idealistic phase, Feuerbach was strongly\ncommitted to a theoretical ideal of philosophy according to which\ncontemplation of, and submersion in, God is the highest\nethical act of which human beings are capable. Whereas, in\nhis later works, Feuerbach would seek to compel philosophy\n\n\nto come down from its divine and self-sufficient blissfulness in\nthought and open its eyes to human misery, (GPZ\n264/3)\n\n\nhere he spoke instead of\n\n\nthe painful whimpering of the sick and the last moans of the dying as\nvictory songs of the species [in which it] celebrates its reality and\nvictorious lordship over the single phenomenon. (GTU 302/\n95)\n\n3. Feuerbach as Historian of Philosophy\n\nThe understanding of reason as one and universal that underlies the\nworks discussed in the preceding section also informs the approach\ntaken by Feuerbach to the history of philosophy in the three\npreviously mentioned books, and in a series of lectures, that he\nproduced during the\n 1830s.[13]\n In his lectures on the history of modern philosophy, Feuerbach\nemphasizes that philosophical reflection is an activity to which human\nbeings are driven. The history of the philosophical systems\nthat this activity has produced, he maintains, is conceived only\nsubjectively, and thus inadequately, so long as it is regarded as the\nhistory of the opinions of individual thinkers. Because thinking is a\nspecies-activity, the philosophical systems that have arisen in the\ncourse of the history of philosophy should be regarded as necessary\nstandpoints of reason itself. The Idea is not something first produced\nby philosophical reflection. Rather, the individual thinker, to the\nextent the he or she succeeds in transcending his or her\nindividuality, comes to function as an instrument or organ through\nwhich the Idea actualizes one of its moments, which is later\nreproduced in the consciousness of the historian of philosophy. The\nactivity of the Idea is experienced subjectively as inspiration\n(Begeisterung). In producing itself, the Idea does not pass\nfrom nonbeing into being, but rather from one state of being (being in\nitself) to another (being for itself). The Idea produces itself by\ndetermining itself, and human consciousness is the medium of its\nself-actualization.\n\n\nReason is nothing but the self-activity of the eternal,\ninfinite idea, whether in art or religion or philosophy, but this\nactivity is always the activity of the Idea in a particular\ndetermination and thus also at a particular time, for it\nis precisely according to the particular determinations of the idea\nthat enter successively into human consciousness that we differentiate\nthe periods and epochs of history. (VGP 11)\n\n\nThe emergence of new philosophical systems results, on this view, from\na necessity that is both internal and external. Certain philosophical\nideas are only capable of being conceived and articulated under\nspecific historical conditions. Just as it was only possible for\nChristianity to appear at that point in history when the ties that\nbound family and nation in Greco-Roman antiquity were dissolving, so\nit was only possible for modern philosophy to appear under specific\nhistorical conditions. Feuerbach locates the beginning of the history\nof modern philosophy at the point where the modern spirit first begins\nto distinguish itself from the medieval spirit. The dominant principle\nof the medieval period was the Judeo-Christian, monotheistic\nprinciple, according to which God is conceived as an omnipotent person\nthrough an act of whose will the material world was created from\nnothing (ex nihilo). It is because nature, as conceived from\nthis standpoint, is excluded from the divine substance, according to\nFeuerbach, that medieval thought showed so little interest in the\ninvestigation of nature. It is only where the substantiality of nature\nbegins to be rediscovered that the spirit of modernity distinguishes\nitself from the medieval spirit. This occurs most clearly where matter\ncomes to be regarded as an attribute of the divine substance, so that\nGod is no longer conceived of as a being distinct from nature but\nrather as the immutable and eternal imminent cause from which the\nplenitude of finite shapes in nature pours forth. This happens first\namong the nature philosophers of the Italian Renaissance, and\nsubsequently in the speculative reflections of Jakob Böhme and in\nthe system of Spinoza. Indeed, it is one distinctive feature of\nFeuerbach’s view of the history of modern philosophy that he\nthinks of it as beginning, not with Descartes, but with the nature\nphilosophers of the Italian Renaissance. Feuerbach insists upon the\nspeculative significance of Bacon’s philosophy of nature. It is\nprecisely in subjecting nature to experimentation, and thereby to\nrational comprehension, that spirit raises itself above nature. But\nwhile Feuerbach emphasizes the philosophical importance of experience\nin the modern rediscovery of nature, he nevertheless insists that\nempiricism lacks a “principle” of its own. Later he will\nspeak of the need for an alliance between German metaphysics and\n“the anti-scholastic, sanguine principle of French\nsensualism and materialism” (VT 254–255/165,\nemphasis in the original).\n\nFeuerbach’s conviction that Christian faith is inimical to\nreason and philosophy was strengthened by his own studies of the\nhistory of modern philosophy, especially his studies of Leibniz and\nBayle. As previously noted, his monographs on these figures were\nwritten during the period of controversy following the appearance of\nStrauss’s Life of Jesus. Toward the end of the 1830s,\nthe Young Hegelians were increasingly opposed on two fronts: on the\none hand, by right-wing Hegelians such as Friedrich Göschel, who\ninsisted upon the compatibility of Hegelianism and Protestant\northodoxy, and, on the other, by representatives of the so-called\n“Positive Philosophy”, who, taking their inspiration from\nthe late Schelling, identified the personality of God as disclosed in\nthe Christian revelation as the supreme metaphysical principle (cf.\nBreckman 1999 and Gooch 2011). It is in light of these developments\nthat, beginning in the Leibniz monograph, Feuerbach sought\nincreasingly to distinguish from one another, and to demonstrate the\nincompatibility of, what he refers to there as “the\nphilosophical standpoint” and “the theological\nstandpoint”, respectively. Feuerbach regards the theological\nstandpoint as “practical” because it imagines God as a\nbeing separate from the world, upon which he acts according to\npurposes similar to those that guide the actions of human beings,\nrather than conceiving the world as a necessary, and hence rationally\nintelligible, consequence of the divine nature. To be sure, for\nLeibniz, there is nothing arbitrary about the divine will. God’s\nwill is determined by his infinite wisdom and goodness, which compel\nhim to choose to create the best possible world. But this attempt to\nsynthesize rational necessity and divine sovereignty remains in\nFeuerbach’s view an unacceptable compromise. Like Tycho Brahe,\nwho sought to combine the Ptolemaic and Copernican astronomies, he\nthinks Leibniz sought to reconcile the irreconcilable. Feuerbach took\nLeibniz’s theory of monads to be an original philosophical\nposition that offers a genuinely novel conception of substance, and an\nalternative to the mechanistic-mathematical Cartesian account of\nmotion, and thus constitutes an organic link in the developmental\nsequence of historical philosophical systems. He criticized Leibniz,\nhowever, for not having derived the unity or harmony of the monads\nfrom the nature of the monads themselves, and for appealing instead to\na theological representation of God as an alien, external power who\nachieves this harmonization miraculously, and hence, inexplicably.\n\nAlthough, considered superficially, Feuerbach’s study of Bayle\nis a continuation of the line of inquiry pursued in his earlier\nhistorical monographs, closer inspection confirms Rawidowicz’s\nobservation that this book marks an important turning point in his\nintellectual development (Rawidowicz 1964: 62–62). The book is\nfull of digressions that go on for many pages without making any\nreference to Bayle, which can produce an impression that it lacks a\nclearly defined focus. In fact Feuerbach is here moving toward, and\nbuilding a case for, a claim that he articulates more explicitly in\nsucceeding years, namely, that the “practical negation” of\nChristianity is a fait accompli insofar as the scientific,\neconomic, aesthetic, ethical and political values and institutions\nthat are constitutive of modern European culture are incompatible with\nthe demands of authentic Christian faith as expressed in the Bible and\nin the writings of patristic and medieval authors, who are either\nindifferent or inimical to the scientific investigation of nature, the\nacquisition of wealth, the pursuit of artistic creativity as an end in\nitself, and attempts to establish ethical and political norms on the\nbasis of universally valid rational principles rather than the\nauthority of revelation or of the Church.\n\nAlthough the Protestant Reformation, in its rejection of clerical\ncelibacy, its affirmation of the vocation of the laity, and its\nseparation of temporal and spiritual authority, resolved the\ncontradiction between the spirit and the flesh that was characteristic\nof medieval Catholicism, Feuerbach argues, it failed to resolve the\ncontradiction between faith and reason, or theology and philosophy.\nBayle’s historical significance for Feuerbach consists in his\nuncompromising exposure of this contradiction, which, because it was\nso deeply rooted in Bayle’s own character, he himself could only\nresolve by embracing fideism. Feuerbach sought to further expose this\ncontraction in his 1839 essay, “On Philosophy and\nChristianity”, in which he for the first time publicly\nrepudiated the Hegelian claim that philosophy affirms in the form of\nconceptual thinking the same truths affirmed by religion in the form\nof sensible representations.\n4. The Critique of Christianity\n\nIn a section of the preface to the second edition of The Essence\nof Christianity (1843) that Eliot omitted from her translation,\nFeuerbach reveals that he had sought in this book to achieve two\nthings: First, to attack the Hegelian claim for the identity of\nreligious and philosophical truth by showing that Hegel succeeds in\nreconciling religion with philosophy only by robbing religion of its\nmost distinctive content. Second,\n\n\nto place the so-called positive philosophy in a most fatal light by\nshowing that the original of its idolatrous image of God\n[Götzenbild] is man, that flesh and blood belong to\npersonality essentially. (WC 10–11)\n\n\nAppreciation of each of these objectives requires further\nclarification of the historical context in which Feuerbach’s\nbook appeared, namely one year after the ascension to the Prussian\nthrone of the Romantic conservative, Friedrich Wilhelm IV. The new\nking’s inner circle of advisers consisted of devout aristocrats\nclosely associated with the neo-Pietist Awakening, who sought to\nestablish a German-Christian state as a bulwark against the influence\nof subversive ideas on the continent. 1840 also saw the death of the\nPrussian minister of culture, Karl vom Stein zum Altenstein, who had\nbeen a supporter of the Hegelian cause and a bearer of the hopes of\nthe Young Hegelians both for academic advancement and for a Prussian\nstate informed by a progressive Protestant ethos amenable to the\nfreedom of theoretical inquiry. The wedge driven by the outcry\nsurrounding the appearance of Strauss’s book between the right\nand left wings of the Hegelian camp made this “center”\nposition increasingly untenable. The policies of Altenstein’s\nsuccessor, including the appointment, in 1841, of Schelling to the\nchair in Berlin formerly occupied by Hegel, were aimed instead at\nslaying the “dragonseed” of Hegelian pantheism in the\nuniversities under Prussian jurisdiction (cf. Pinkard 2002:\n317–332).\n\nBy the time Feuerbach published his most famous book, The Essence\nof Christianity (1841), in which he sought to develop “a\nphilosophy of positive religion or revelation” (WC 3),\nhe had begun to move away from his earlier idealistic\n pantheism.[14]\n That he nevertheless sought in this book to criticize both Hegelian\nspeculative theology and the positive philosophy from “the same\nstandpoint” taken by Spinoza in his Theologico-Political\nTreatise (VWR 16/9; cf. WC 10–11) has\noften been overlooked. At one point in the Treatise Spinoza\nobserves that the biblical authors\n\n\nimagined God as ruler, legislator, king, merciful, just, etc., despite\nthe fact that all the latter are merely attributes of human nature and\nfar removed from the divine nature. (Spinoza [1677] 2007: 63)\n\n\nIn Christianity, Feuerbach makes a similar distinction\nbetween the metaphysical and personal divine predicates. God\nconsidered as the theoretical object of rational reflection, or\n“God as God”, is a timeless and impassible entity that is\nunaffected by human suffering and ultimately indistinguishable from\nreason itself.\n\n\nThe consciousness of human nullity that is bound up with consciousness\nof this being is in no way a religious consciousness; it is much more\ncharacteristic of skeptics, materialists, naturalists and pantheists.\n(WC 89/44)\n\n\nIt is God’s personal predicates that concern the religious\nbeliever, for whom God exists, not as an object of theoretical\ncontemplation, but of feeling, imagination, and prayerful\nsupplication.\n\nWhereas the metaphysical predicates, which “serve only as\nexternal points of support to religion” (WC 62/25), can\nbe thought of as ones that apply to the first person of the Trinity\n(i.e., God in his abstract universality), the second person of the\nTrinity, by virtue of his having subjected himself, for the salvation\nof humanity, to a humble birth and an ignominious death, “is the\nsole, true, first person in religion” (WC 106/51). The\ndoctrine of the Incarnation, Feuerbach argues against Hegel, is not,\nfor the Christian believer, a symbolic representation of the eternal\nprocession and return of infinite spirit into, and back from, its\nfinite manifestations. It is rather “a tear of divine compassion\n[Mitleid]” (WC 102/50), and, as such, the act\nof a sacred heart that is able to sympathize with human suffering.\nThat God was compelled by his love for humanity to renounce his\ndivinity and become human Feuerbach takes as proof that “Man was\nalready in God, was already God himself, before God\nbecame man” (ibid.), i.e., that belief in divine compassion\ninvolves the attribution or projection onto God of a moral sentiment\nthat can only be experienced by a being capable of suffering, which\n“God as God” is not.\n\nThe Essence of Christianity is divided into two parts. In the\nfirst part, Feuerbach considers religion “in its agreement with\nthe human essence” (WC 75). Here he argues that, when\npurportedly theological claims are understood in their proper sense,\nthey are recognized as expressing anthropological, rather than\ntheological, truths. That is, the predicates that religious believers\napply to God are predicates that properly apply to the human\nspecies-essence of which God is an imaginary representation. In the\nsecond part, Feuerbach considers religion “in its contradiction\nwith the human essence” (WC 316). Here he argues that,\nwhen theological claims are understood in the sense in which they are\nordinarily taken (i.e., as referring to a non-human divine person),\nthey are\n self-contradictory.[15]\n In early 1842, Feuerbach still preferred that his views be presented\nto the public under the label “anthropotheism” rather than\n“atheism” (GW v. 18, 164), emphasizing that his\noverriding purpose in negating “the false or theological essence\nof religion” had been to affirm its “true or\nanthropological essence”, i.e., the divinity of man.\n\nFeuerbach begins The Essence of Christianity by proposing\nthat, since human beings have religion and animals do not, the key to\nunderstanding religion must be directly related to whatever it is that\nmost essentially distinguishes human beings from animals. This, he\nmaintains, is the distinctive kind of consciousness that is involved\nin the cognition of\n universals.[16]\n A being endowed with such “species-consciousness” is able\nto take its own essential nature as an object of thought. The capacity\nfor thought is conceived here as the capacity to engage in internal\ndialogue, and thus to be aware of oneself as containing both an I and\na Thou (a generic other), so that, in the act of thinking, the human\nindividual stands in a relation to his species in which non-human\nanimals, and human beings qua biological organisms, are\nincapable of standing. When a human being is conscious of himself (or\nherself) as human, he is conscious of himself not only as a thinking\nbeing, but also as a willing and a feeling being.\n\n\nThe power of thinking is the light of knowledge [des\nErkenntnis], the power of the will is the energy of character,\nthe power of the heart is love. (WC 31/3)\n\n\nThese are not powers that the individual has at his or her disposal.\nThey are rather powers that manifest themselves psychologically in the\nform of non-egoistic species-drives (Gattungstriebe) by which\nindividuals periodically find themselves overwhelmed, especially those\npoets and thinkers in whose works the species-essence is most clearly\n instantiated.[17]\n Such manifestations include the experiences of erotic and platonic\nlove; the drive to knowledge; the experience of being moved by the\nemotion expressed in music; the voice of conscience, which compels us\nto moderate our desires to avoid infringing on the freedom of others;\ncompassion; admiration; and the urge to overcome our own moral and\nintellectual limitations. The latter urge, Feuerbach contends,\npresupposes an awareness that our individual limitations are\nnot limitations of the species-essence, which functions thus\nas the norm or ideal toward which the individual’s efforts at\nself-transcendence are directed.\n\nThe individual human being is limited both physically and morally. Our\nphysical existence is limited in time and space. We are also\nlimited—and often painfully aware of our being so—in our\nintellectual and moral capacities. But I only experience as a painful\nlimitation my inability to be and do things that others of my kind are\nable to be and to do, so that, in recognizing my own limitations, I\nsimultaneously recognize that they are not limitations of the\nspecies. If they were, either I would not be aware of them at all, or\nI would not experience my awareness of them as painful. For example, I\nonly reprove myself for cowardice because I am aware of the bravery of\nothers, which I myself lack, and for my stinginess because I am aware\nof the generosity of others, which I myself lack. The experience of\nconscience—taken in the broad sense as an awareness of\none’s moral and intellectual shortcomings and\ninadequacies—thus presupposes species-consciousness in the form\nof an awareness of qualities that one finds oneself lacking but can\nimagine oneself, under other circumstances, possessing.\n\nFeuerbach’s central claim in The Essence of\nChristianity is that Christian theism is predicated upon an\nalienated form of human self-consciousness wherein human beings relate\nthemselves to their own human species-essence as though it were a\nbeing distinct from themselves. Although, in developing this claim,\nFeuerbach was clearly influenced by Hegel’s account of Unhappy\nConsciousness in the Phenomenology, Ameriks’ contention\nthat\n\n\nFeuerbach’s philosophical doctrines […] can be understood\nas little more than a filling out of the details of Hegel’s\nscathing account of orthodox Christianity as a form of “unhappy\nconsciousness” (Ameriks 2000: 259)\n\n\nis problematic for several reasons. First, it overlooks the likelihood\nof Hegel’s having understood his analysis of Unhappy\nConsciousness to apply to the otherworldliness he associated with\nmedieval Catholicism, or perhaps to otherworldly religion more\ngenerally, but not in any case to the type of Protestantism that he\nregarded as “the religion of the modern age” (Hegel [1807]\n1977: 14), and in which he found the sacred and the secular\nreconciled. Second, it overlooks the fact that Feuerbach’s\nappropriation of themes found in Hegel’s account of Unhappy\nConsciousness occurs in the context of an explicit, albeit incomplete,\nrepudiation of Hegel’s philosophy of spirit. Unlike Hegel, who\nconceives of Unhappy Consciousness as a moment in the development of\nhuman self-consciousness that is also a moment in the\ncoming-to-be-for-itself of the absolute, Feuerbach has by this time\nreached the conclusion that one cannot distinguish absolute spirit\nfrom “subjective spirit or the essence of man” without, in\nthe end, continuing to occupy “the old standpoint of\ntheology” (VT 246–247). Third, it overlooks the\nsignificance of Feuerbach’s emphasis on the importance, for\ngrasping the essence of religion, of precisely those subjective\naspects of religious consciousness (imagination and feeling) that\nHegel himself regarded as inessential or of secondary importance.\nFinally, in connection with this third point, it overlooks the\nsignificance of Feuerbach’s agreement with Spinoza against Hegel\nthat “faith […] requires not so much truth as\npiety” (Spinoza [1677] 2007: 184).\n\nIn a short essay, published 1842, in which he sought to clarify the\ndifference between his own approach to the philosophy of religion and\nHegel’s, Feuerbach suggested that this difference is most\nevident in the relations in which each of them stands to\nSchleiermacher, who famously defined religion as the feeling of utter\ndependence. Whereas Hegel had “rebuked” Schleiermacher for\nabdicating the truth-claims of the Christian faith by taking the\narticles of faith as expressions of this feeling, Feuerbach says he\ndoes so only because Schleiermacher was prevented by his\n“theological prejudice” from drawing the unavoidable\nconclusion that, “if feeling is subjectively what religion is\nchiefly about, then God is objectively nothing but the essence of\nfeeling” (B 230). These comments fail to acknowledge\nthat, in The Essence of Christianity, Feuerbach had conceived\nof God as an alienated projection of the human species-essence, which\nwas said to include not only feeling, but reason and will, as\nwell. They nevertheless reflect Feuerbach’s generally overlooked\ndeployment against Hegel of resources derived from the philosophies of\nfeeling of Schleiermacher and\n Jacobi,[18]\n and they indicate the direction in which his thinking about religion\ncontinued to move after the publication of The Essence of\nChristianity, namely, away from an emphasis on\nspecies-consciousness conceived along Hegelian lines, and toward what\nHarvey has aptly referred to as the\n“naturalist-existentialist” themes that predominate in his\nlater writings on religion (cf. Harvey 1995). These are discussed in\n Section 6\n below.\n5. The “New” Philosophy\n\nIn notes for lectures on the history of modern philosophy that he\ndelivered in 1835/36, Feuerbach wrote that idealism is the “one\ntrue philosophy”, and that “what is not spirit is\nnothing” (VGP 139). Around the same time, he\nvigorously defended the “absolute method” employed by\nHegel in his Logic against its critics (GW 8:73).\nFeuerbach himself referred to his early philosophical\n“standpoint” as “the standpoint of pantheistic\nidentity” (GW 10:291). His efforts to extricate himself\nfrom this standpoint were ongoing over the course of two decades. The\nextent to which they ultimately succeeded is debatable. Whereas the\nyoung Marx saw Feuerbach as “the true conqueror of the\nold philosophy”, the neo-Kantian historian of\nmaterialism, F.A. Lange, could find in his “new”\nphilosophy only another iteration of the philosophy of spirit,\n“which we encounter here in the form of a philosophy of\nsensuousness” that lacks materialistic bona fides (Marx 1844:\n80; Lange [1866] 1974: v. 2,\n 522).[19]\n\n\nIn 1839, the same year that Feuerbach made his first public break with\nHegelianism in the essay, “Toward a Critique of the Hegelian\nPhilosophy”, he was still able to write that he missed in\nspeculative philosophy “the element of the empirical, and in\nempiricism the element of speculation”, and to describe his own\nmethod as an effort to conjoin both kinds of philosophical\n“activity” into a form of “skepticism or\ncritique just as much of the merely speculative as\nof the merely empirical” (GW 9:12). It was\nonly in 1842, between the time of the publication of the first (1841)\nand second (1843) editions of The Essence of Christianity\n(which happens also to have been a time of draconian censorship and\npolice surveillance) that Feuerbach became convinced of the need to\nmake a “radical break” with the speculative philosophical\n tradition.[20]\n This prompted him to report in the preface to the second edition of\nhis famous book that “the Idea” retained for him only a\npractical significance as “faith in the historical future”\nand in the triumph of truth and virtue. In the realm of theoretical\nphilosophy proper, and “in complete opposition to the Hegelian\nphilosophy,” he now considered himself a realist and a\nmaterialist (WC 15).\n\nIn two brief philosophical manifestos published in 1842 and 1843,\nrespectively, Feuerbach sought to “deduce”, through an\ninternal criticism of the “old” philosophy (culminating in\nthe Hegelian system), the “principles”\n(Grundsätze) that would lay the foundation for a\n“new”, naturalistic “philosophy of the\nfuture”. After the publication of these two manifestos, however,\nhe turned his attention back to religion, claiming in the foreword to\nthe first volume of his collected works (1846) that it was only in his\nbook on The Essence of Faith According to Luther (1844) that\nhe came to appreciate the “truth and essentiality of\nsensuousness [Sinnlichkeit]” (GW 10:187), and\nthereby to overcome the “contradiction” between\nspeculation and empiricism in which his position in The Essence of\nChristianity had remained mired. It is certainly the case that a\nnumber of concepts that are central to the philosophical anthropology\nwith which Feuerbach sought to replace the “old”\nphilosophy, including the effort to “naturalize freedom”\nundertaken in his final writings, were first introduced and developed\nin writings on religion published in the 1840s and 1850s. Because of\nthis, it’s difficult to neatly separate a discussion of\nFeuerbach’s “new” philosophy from his later\ntheorizing about religion. Be that as it may, the first of these\ntopics will be explored in this section and the second in the\nsucceeding section. Feuerbach’s preliminary efforts in his last\nactive years to develop a drive psychology and to naturalize ethics\nwill be considered briefly in the final section.\n\nOne thing that distinguishes Feuerbach’s “new”\nphilosophy from other versions of modern empiricism and materialism is\nhis claim to have derived the “principles” of this\nphilosophy through a dialectical inversion of the Hegelian system. In\nthe “Theses” Feuerbach argues that, by\n“positing” the human essence “outside of man”\nin the ethereal realm of absolute spirit, the Hegelian philosophy\nperpetuates the theological alienation of human beings from their own\nessence, which he now explicitly equates with subjective spirit. The\nre-appropriation of this abstracted essence by finite, corporeal human\nsubjects cannot be achieved “positively” [auf positive\nWeg], but only through a “total negation” of the\nHegelian philosophy that will reveal once and for all the\nincarnational telos of the history of philosophy and humanity\n(VT 247). In this way, Feuerbach thinks, the hidden\n“truth of Christianity” (VT 263) will finally be\nrealized in the form of an atheistic humanism that renounces the\nfantastical consolations of religion in order to embrace the\nhistorical tasks of human self-realization and the creation of new\npolitical and cultural institutions that will be conducive to it.\n\nIn 1846, Feuerbach published a number of “fragments” from\nhis unpublished papers intended to document the course of his\nphilosophical development. One of these fragments, entitled\n“Doubt”, and dated 1827–28 (which is the time when\nFeuerbach was writing his doctoral dissertation) seems already to\nanticipate Feuerbach’s later critique of Hegel. In this\nfragment, we find him questioning the transition from the first to the\nsecond part of Hegel’s tripartite philosophical system, i.e.,\nthe transition from the Logic to the Philosophy of Nature. The\nconceptual process traced by Hegel in the Logic, whereby the\ncategories of thought are successively deduced from one another, is\ndriven by the negativity of the logical determinations of each of\nthese categories, until the process culminates in the absolute Idea.\nBut what negativity remains within the absolute Idea to propel the\ntransition from thought to being, Feuerbach wonders, unless it is that\nthe purportedly “absolute” Idea remains unrealized, and\nhence incomplete, until it becomes incarnate in the realm of the\nsensuous, i.e., nature? In that case, however, nature itself (as the\nrealm of the sensuous) is the hidden truth of the Idea.\n\nThe speculative claim for the identity of thought and being was the\ncornerstone of the Hegelian philosophy in which Feuerbach finds the\n“old” philosophy perfected. One of the principal\n“theses” of the new philosophy is its repudiation of this\nclaim. Feuerbach argues that, because the concept of pure being with\nwhich Hegel begins the Logic is an abstraction, in the end\nHegel succeeds only in reconciling thought with the thought of being,\nrather than with being itself, which is the “other” of\nthought. The new philosophy affirms that being is distinct from, and\nprior to, thought, and that it is as various as is the panoply of\nindividually existing beings, from which it cannot be intelligibly\ndistinguished.\n\n\nThought comes from being, but being does not come from thought.\n[…] The essence of being as being [i.e., in contrast\nto the mere thought of being] is the essence of nature.\n(VT 258/168)\n\n\nTo say that something exists in actuality is to say that it exists not\nonly as a figment of someone’s imagination, or as a mere\ndetermination of their consciousness, but for itself, independently of\nconsciousness. “Being is something in which not only I but also\nothers, above all also the object itself, participate”\n(GPZ 304/40). In affirming the distinction between thought\nand being, repudiating Hegel’s critique of sense certainty, and\naffirming the claim that nature exists through itself, independently\nof thought, the new philosophy also affirms the reality of time and\nspace, insisting that real existence is finite, determinate, corporeal\nexistence. Whereas, in his lectures on logic and metaphysics, and in\nhis writings from the mid-1830’s, Feuerbach had defended the\nHegelian method of the logical Entwicklung or development of\nthe various moments of the absolute Idea, he now argues that the\nconcept of development entails or presupposes temporality, so that a\nnon-temporal developmental process is a contradiction in terms. If\nspeculative philosophy is the philosophy of the infinite, the new\nphilosophy aims to disclose the truth of finitude by reversing the\npath taken by speculation from the infinite to the finite, and from\nthe indeterminate to the determinate (VT 249).\n\nAlthough, in the “Theses”, Feuerbach refers to\n“speculative philosophy” as having been inaugurated by\nSpinoza, revived by Schelling, and perfected by Hegel (VT\n243), in Principles he locates the origin of this tradition\nin the Cartesian philosophy, and specifically in “the\nabstraction from the sensuous [Sinnlichkeit], from\nmatter” (GPZ 275/ 13) through which the conception of\nthe cogito first arose. Much of the content of Principles\nconsists of a truncated survey of the history of modern philosophy\nthat purports to trace, through several dialectical inversions, a\nnecessary development from the rationalistic theism of Descartes and\nLeibniz through the pantheism of Spinoza to the idealism of Kant and\nFichte, culminating in Hegel’s philosophy of identity. What this\nsurvey is primarily intended to show is that the fundamental tendency\nof this development has been toward the actualization and humanization\nof God or, alternatively, toward\n\n\nthe divinization of the real, of the materially\nexistent—of materialism, empiricism, realism,\nhumanism—[and] the negation of theology. (GPZ 285/\n22)\n\n\nThis survey is followed by a short “demonstration” of the\nhistorical necessity of the new philosophy, which takes the form of a\ncritique of Hegel, and by the enumeration of several doctrines that\ndistinguish the new philosophy from the old.\n\nWhereas earlier rationalists had conceived of God as existing prior\nto, and independently of, nature, and as possessing perfect knowledge\nuntainted by materiality; and had, further, “placed the effort\nand labor of abstraction and of self-liberation from the sensuous only\nin themselves”, Feuerbach views Hegel as having been the first\nto transform “this subjective activity into the self-activity of\nthe divine being.” Thus, for Hegel, like the heroes of pagan\nantiquity, God (or the Idea) must “fight through virtue for his\ndivinity”, and only comes to be for himself (or itself) at the\nend of a lengthy and laborious process (GPZ 296/32). This\nprocess, as it is described by Hegel at the end of the Science of\nLogic, involves the logical Idea\n\n\nfreely releas[ing] itself … [into] the\nexternality of space and time existing absolutely on its own\nwithout the moment of subjectivity. (Hegel [1812–1816] 1969:\n843)\n\n\nWhat Feuerbach refers to as “the liberation of the absolute from\nmatter” is achieved as spirit gradually distinguishes itself\nfrom nature before attaining to the awareness of itself as absolute.\nHere, Feuerbach notes, “matter is indeed posited in God, that\nis, it is posited as God”, and to posit matter as God is to\naffirm atheism and materialism, but insofar as the\nself-externalization of the Idea in nature is superseded in the course\nof the coming-to-be-for-itself of the Idea in the forms of subjective,\nobjective and absolute spirit, this negation of “theology”\n(i.e., of God conceived as an immaterial being distinct from nature)\nis negated in turn. This is what Feuerbach seems to have in mind when\nhe refers to Hegel’s philosophy as\n\n\nthe last magnificent attempt to restore Christianity, which was lost\nand wrecked, through philosophy … by identifying it with the\nnegation of Christianity. (GPZ 297/34)\n\n\nThe new philosophy categorically affirms the embodied nature of human\nsubjectivity and self-consciousness. Whereas the old philosophy\nconceived of the cogito as “an abstract and merely a thinking\nbeing to whose essence the body does not belong” (GPZ\n319–320/ 54), the new philosophy affirms that, as a thinking\nsubject, “I am a real, sensuous being and, indeed, the body in\nits totality is my ego, my essence itself” (ibid.). Although it\nis not entirely clear just what Feuerbach could mean in claiming that\n“the body in its totality is my ego”, elsewhere he says\nthat to affirm that the ego is corporeal “has no other meaning\nthan that the ego is not only active but also passive … [and\nthat] the passivity of the ego is the activity of the object” in\nsuch a way that “the object belongs to the innermost being of\nthe ego” (AP 150/142). Object and ego are thus, to use\na Heideggerian term, gleichursprunglich or\n“equiprimordial”.\n\n\nIt is through the body that the ego is not just an ego but also an\nobject. To be embodied is to be in the world; it means to have so many\nsenses, i.e., so many pores and naked surfaces. The body is nothing\nbut the porous ego. (AP 151/143)\n\n\nIf philosophical thought is to avoid remaining “a prisoner of\nthe ego”, Feuerbach insists, it “must begin with its\nantithesis, with its alter ego” (AP\n146/138). The antithesis of thought is sensation. Whereas, in\nthinking, it is the object that is determined by the thinking activity\nof the subject, in sense experience, Feuerbach insists (without much\nargument and with apparently little concern for problems that\npreoccupied the British empiricists and Kant), the consciousness of\nthe subject is determined by the activity of the object. The object\ncan thus be said to function as a subject in its own right. What makes\nit possible for the ego to posit the object is only that, in positing\nthe object as something distinct from itself, the ego is at the same\ntime posited by the object. If, however, the\n\n\nthe object is not only something posited, but also (to continue in\nthis abstract language) something which itself posits, then it is\nclear that the presuppositionless ego, which excludes the object from\nitself and negates it, is only a presupposition of the subjective ego\nagainst which the object must protest. (AP 147/ 139)\n\n\nIt is not to the I, but to the not-I within the I, that real, sensuous\nobjects are given. Memory is what first enables us to transform\nobjects of sense experience into objects of thought, so that what is\nno longer present to the senses can nevertheless be recalled to\nconsciousness. In doing so, it allows us to transcend the limitations\nof time and space in thought, and to construct, from a multitude of\ndistinct sense experiences, a conception of the universe as a whole,\nand of our relations to the various other beings that exist in it.\nFeuerbach continues to affirm that, unlike the animals,\n“man” is a universal, cosmopolitan being. However, he now\nmaintains that we need not ascribe to human beings any unique\nsupersensible faculty in order to affirm this truth, since\n\n\nwherever a sense is elevated above the limits of particularity and its\nbondage to needs, it is elevated to an independent and theoretical\nsignificance and dignity; universal sense is intelligence\n[Verstand]; universal sensibility, mentality\n[Geistigkeit]. (GPZ 336/69)\n\n\nWhat distinguishes humans from non-human animals is thus not our\npossession of non-natural powers, either of reason or volition, but\nthe fact that human beings are “absolute sensualists”\nwhose collective powers of observation and recollection extend, in\nprinciple, to the whole of nature.\n6. The Later Theory of Religion\n\nFeuerbach is most often associated with the slogan underlying The\nEssence of Christianity, according to which “theology is\nanthropology” (insofar as the predicates attributed by\nChristians to God are in fact predicates of the human\nspecies-essence). In a number of works on religion published in the\n1840s and 1850s, however, Feuerbach advanced explanations of the\norigin of religious concepts and beliefs that are strikingly different\nfrom, and apparently at odds with, the more familiar position put\nforward in that book. The works in which Feuerbach advanced these new\ntheoretical initiatives include the previously referenced Luther book\n(1844), a short book entitled The Essence of Religion (1846),\nthe essay, “Belief in Immortality from the Standpoint of\nAnthropology” (1847), the Lectures on the Essence of\nReligion originally delivered in 1848–9, but first\npublished in 1851 (hereafter Lectures), and the\nTheogony (1857). The question of the relationship between the\naccount of religion contained in The Essence of Christianity\nand the views put forward in these later writings is a complex one.\nThe most thorough investigation of this question is to be found in\nHarvey (1995), where Harvey distinguishes five different\n“explanatory principles” employed by Feuerbach in The\nEssence of Christianity, among which he divides those that are\nconceived along Hegelian lines from those that tend instead toward the\n“existentialist-naturalist” themes which predominate in\nFeuerbach’s later writings on religion (Harvey 1995:\n68–69). Harvey’s thesis is that, in his later writings,\nFeuerbach in fact develops an alternative, bipolar model of religion\nthat is both incompatible with, and more compelling than, the more\nfamiliar theory presented in The Essence of Christianity.\nWhereas, in that work, Feuerbach had proposed that God is an alienated\nprojection of the human species-essence to whom the\n“perfections” of the latter are mistakenly attributed, the\nnew bipolar model seeks instead to explain the origin and persistence\nof religious beliefs and practices, Christian and non-Christian alike,\nin terms of their role in meeting deep-seated psychological needs\nresulting from the contingency and finitude of embodied human subjects\nseeking to preserve their existence and to expand their natural\npowers.\n\nIn a previously cited essay published in 1842, in which Feuerbach\nsought to clarify the differences between Hegel’s philosophy of\nreligion and his own, he referred readers seeking to evaluate his\nargument in The Essence of Christianity to his\n“Critique of the So-Called Positive Philosophy”, published\nin the Halle Annals in December, 1838 (B 235). It\nwas there that Feuerbach first put forward the claim that all the\n“determinations” (Bestimmungen) ascribed by the\npositive philosophy to God are determinations either of “the\nessence of nature” or of “the essence of man”\n(KPP 204). This claim is consistent with subsequent\nstatements of Feuerbach’s, including his observation in\nPrinciples that “God, in the theological sense, is God\nonly as long as he is conceived as a being distinguished from the\nbeing of man and nature” (GPZ 280/19). Here the\nsuggestion seems to be that, if it can be shown that attributes\nascribed by theists to God are attributes derived either from human\nconsciousness or from nature, then it will have been shown that God\nhas no existence apart from the existence of human consciousness and\nof nature. Thus, even if it is true, as Harvey is probably correct to\nargue, that the bipolar model of religion found in the later writings\ndoes not merely supplement, but replaces, the position taken by\nFeuerbach in The Essence of Christianity, these two distinct\nexplanatory enterprises can nevertheless be understood as alternative\nstrategies for making good on Feuerbach’s original claim that\nthe predicates of divinity can be reduced to predicates derived\neither from the essence of nature or from the human essence.\nIt should be noted that, while Harvey is correct in pointing out that\nthe human species-essence is rarely mentioned in Feuerbach’s\nlater writings, by 1851 Feuerbach had nevertheless still not abandoned\nthe claim that God, conceived as a personal being distinct from\nnature, “is nothing other than the deified and objectified\nspiritual essence of man” (VWR 28/21).\n\nAs Rawidowicz (1964: 113) and Ascheri (1964: 62) have both observed,\nthe break with the speculative tradition that Feuerbach signaled in\nthe “Preliminary Theses” and in Principles\ncorresponds to a noticeable change in his stance toward religion, if\nnot in his estimation of the truth-value of traditional doctrinal\nclaims. In his polemical essays of the late 1830s, and in The\nEssence of Christianity, Feuerbach had unfavorably contrasted the\n“egoistic”, practical standpoint of religion, which he\nassociated with the unrestricted subjectivity of feeling\n(Gemüt) and imagination (Phantasie), with the\nimpartial, theoretical standpoint of philosophy, which he associated\nwith reason and objectivity. At the end of Principles,\nhowever, he informs his readers that the new philosophy, without\nceasing to be theoretical, nevertheless has a fundamentally practical\ntendency, and that in this respect it “assumes the place of\nreligion” and “is in truth itself religion”\n(GPZ 341/73). This line of thought is developed somewhat\nfurther in an unpublished manuscript where Feuerbach observes that, in\norder to replace religion, philosophy must itself become religion in\nthe sense that “it must, in a way suited to its own nature,\nincorporate the essence of religion or the advantage that religion\npossesses over philosophy” (NV 123/148). Here,\nFeuerbach does not say what he takes religion’s\n“advantage” over philosophy to be, but in the\nLectures he claims that the difference between philosophy and\nreligion can be reduced to “the simple statement that religion\nis sensuous and aesthetic, while philosophy is nonsensuous and\nabstract” (VWR 20/13). Religion’s\n“advantage” over the old philosophy, then, is presumably\nit’s implicit acknowledgment of the “truth and\nessentiality of sensuousness” and of human finitude, which it is\nthe task of the new philosophy to articulate explicitly.\n\nWhen Feuerbach’s Luther book was first published in 1844, its\nsubtitle suggested that it was conceived of as an addendum to The\nEssence of Christianity. Because, in the first edition of that\nbook, Feuerbach had relied heavily on quotations from patristic and\nmedieval works to support his claims, some theological critics had\nretorted that, while Feuerbach’s account of Christianity might\napply to Catholicism, it did not apply to Protestantism. It was in\nresponding to these critics that Feuerbach turned his attention to\nLuther, and, in doing so, introduced a number of concepts and themes\nthat had not figured prominently in The Essence of\nChristianity, but which he continued to develop in his later\nwritings, including both those devoted to religion, as well as those\ndevoted to other topics. Foremost among these concepts and themes are\nSeligkeit (blessedness or perfect happiness) and the\nGlückseligkeitstrieb or drive-to-happiness; “human\negoism” or human self-love; the feeling of dependence on nature;\nand the powerful, theogonic (i.e., god-originating) wish to be free\nfrom the limitations of nature by which the human drive-to-happiness\nis restricted.\n\nFeuerbach begins the Luther book by conceding that no doctrine would\nseem more clearly to contradict the central claim advanced in The\nEssence of Christianity, namely, that Christians worship the\nhuman species-essence, than does Luther’s doctrine. That\ndoctrine seems, on the contrary, to be the epitome of human\nself-abnegation insofar as it emphasizes the depravity and\ncontemptibleness of human nature in contrast to the perfection and\nglory of the divine nature. This appearance, however, is deceptive, on\nFeuerbach’s account; for, while it’s true that, whatever\nLuther takes from human beings, he gives to God, since all that\nbelongs to God belongs to Christ, and all that belongs to Christ\nbelongs to the Christian, it is only on the surface that\nLuther’s doctrine is dehumanizing. Whereas, in The Essence\nof Christianity, Feuerbach had contrasted the egoism and\nintolerance of faith (which he associated with the false, theological\nessence of religion) with the altruism and universality love (which he\nassociated with the true, human essence of religion), in the Luther\nbook he emphasizes instead that Christian faith is faith in a God who\nis love. Since, however, it is human beings who are the principal\nobject of this love, Luther’s emphasis on the comptemptability\nof human nature turns out to be an indirect form of human self-love or\nself-affirmation. The Christian believer affirms the existence of, as\nwell as his or her confidence in, the goodness of God, who has\npromised him or her blessedness or freedom from the painful\nlimitations of mortality. It is only because the Christian believer\nthus “completes and satisfies himself in God”\n(WGL 363/46) that God is credited with the possession of all\nthat human beings lack. Luther, with his emphasis on God’s being\npro nobis or “for us”, was “the first to\nlet out the secret of the Christian faith” (WGL\n366/50), which is, at bottom, the assurance\n\n\nthat God is by his very nature concerned with man, … that God\nis a being not for himself or against us, but rather for us, a good\nbeing, good to us men. (WGL 366–67/51)\n\n\nFrom this recognition, Feuerbach goes on to develop an analysis of the\ndivine attributes, which he interprets in this context as “means\nto the end of benevolence” (WGL 368/52). Here, and in\nFeuerbach’s later writings, the concepts of blessedness and the\ndrive-to-happiness seem to play a role analogous to the one played by\nthe concept of the species-essence in The Essence of\nChristianity. Whereas, in the latter work, divine attributes such\nas omniscience and perfection were said to be attributes of the human\nspecies-essence, in the section on Seligkeit toward the end\nof the Theogony, where Feuerbach develops a line of thought\nfirst introduced in the Luther book, many of these same attributes are\nsaid to characterize the state of blessedness itself. “God is\nonly the foreword, blessedness the text of Christianity. Or: The\nmystery of divinity is first unveiled and revealed in the gospel of\nblessedness” (T 308). The thesis here is that the\nattributes of the Christian God are determined by the most fundamental\nwishes of the Christian believer. For example, God qua\ncreator is first and foremost omnipotent, but omnipotence is ascribed\nto God only because it is necessary for God to be omnipotent in order\nfor God to be able to exercise his benevolence toward the faithful by\nsupplying them with what they lack, including eternal life. There is\nno lack that cannot be satisfied, and no ultimate harm that can\nbefall, the person who is the object of the benevolence of an\nomnipotent being. On this account, the divine attributes are\ndetermined by human needs. These are determined, in turn, by the\npsycho-physical constitution of human beings as self-conscious\nsubjects constrained by natural limitations from which they have an\nurgent wish to be liberated. In the final analysis, belief in divine\nomnipotence is said be motivated, not by any specific wish, but rather\nby “the unspecific over-all wish that there be in general no\nnatural necessity; no limitations, no opposition to the human being\nand to human wishes” (WGL 372/59).\n\nFeuerbach, whose conception of Seligkeit or blessedness seems\nto have been influenced by Augustine’s account of\nfelicitas in The City of God, defines blessedness at\none point as freedom from sin, sensual drives, “the oppression\nof matter”, death, and the limitations of nature in general\n(WGL 403/103). Whereas the God of Christianity had previously\nbeen identified by Feuerbach as an alienated projection of the human\nspecies-essence, here God is defined instead as the realized\ndrive-to-happiness of the Christian believer. To say that belief in\nGod is motivated or caused by the human drive-to-happiness is not\nnecessarily to deny that attributes ascribed to God are attributes\nderived from human nature. It is, however, in any case to affirm that\nthe ascription to God of the perfections of the human species-essence\nserves an underlying psychological need that is itself determined by\nthe dependence of human beings upon nature, and their awareness of\nthis dependence in the form of powerful hopes and fears that give rise\nto belief in supernatural agencies and efforts to secure their\nblessings.\n\nTwo years after the publication of the Luther book, Feuerbach\npublished another short book entitled The Essence of\nReligion, the core ideas in which are further developed in the\nLectures. Here, Feuerbach explains that, because Christians\nthemselves do not worship such things as the sun and the moon, but\ninstead worship “will, intelligence, consciousness as divine\nbeings and powers” (VWR 27/20), he himself had\n“disregarded nature” in his account of Christianity\n(VWR, 26/19). This had given rise to certain unspecified but\n“preposterous” misunderstandings which he sought to\ncorrect by augmenting the slogan encapsulating his doctrine from\n“theology is anthropology” to “theology is\nanthropology ‘and physiology’”\n(VWR 28/21). This modification reflects a new emphasis in\nFeuerbach’s later writings on the ontological dependence of\nhuman consciousness upon the physical human organism, which itself\nexists only in relation to the natural order of which it is a\npart—a relation mediated, or, to be more precise,\nrevealed, by the senses.\n\nThe Essence of Religion begins with the striking claims that\n1) the feeling of dependence is the “ground” of religion,\nand that 2) the original object of this feeling, i.e., in the history\nof religion, is nature. Feuerbach defines the feeling of dependence\nas\n\n\nthe feeling or consciousness of man that he does not and cannot exist\napart from a being that is distinct from himself, that he does not\nhave himself to thank for his own existence. (WR 4)\n\n\nThis feeling can manifest itself negatively as fear, to which\nFeuerbach refers at one point as “a feeling of dependency on an\nobject without which I am nothing, which has the power to destroy\nme” (VWR 39/31); but the feeling of dependent can also\nmanifest itself positively in the form of celebratory joy and\nexaltation. Feuerbach finds both of these powerful emotions expressed\nin the act of sacrifice, which he takes to be the most characteristic\npractice of nature religions (as opposed, presumably, to prayer as the\ncharacteristic act of “spiritual”, i.e., monotheistic,\nreligions). In addition to filling a “gap” in the argument\nput forward in The Essence of Christianity by emphasizing the\ndependence of “the human essence” upon “the essence\nof nature”, Feuerbach also sought in The Essence of\nReligion to identify features shared in common by what he calls\n“nature religions”, on the one hand, and\n“spiritual” religions like Christianity, on the other, and\nto clarify the relationship between these two kinds of religion.\nFeuerbach uses the term “nature religion” to refer both\nthe pagan religions of classical antiquity, and the religions of\nvarious tribal peoples whose beliefs and practices were described for\nFeuerbach and his contemporaries by European travelers in journals\nsuch as Das Ausland, from which Feuerbach derived a number of\nthe examples to which he refers in this book (cf. Tomasoni 1990:\n10–11, 127–135).\n\nWhile the feeling of dependence is said to be the “ground”\nof religion, what the act of sacrifice aims at, or seeks to achieve,\nis freedom from the restrictions of nature, or, alternatively, human\nindependence. If blessedness is the condition of not being subjected\nto the restrictions imposed by nature on all finite, corporeal\nindividuals subject to generation and corruption, then human\nblessedness can be regarded as the final goal (Endzweck) of\nreligion (WR 34). The gods are the objects of worship, and\nthe recipients of sacrifice, because they are the benefactors of human\nbeings in the specific sense that they are imagined to have it in\ntheir power to satisfy fundamental human wishes, including the wish\nnot to die. “Only a being who loves man and desires his\nhappiness [Seligkeit] is an object of human worship, of\nreligion” (VWR 71/60). The sacrificial act is motivated\nby the experience of need (Bedürfnis), which involves\nthe simultaneous awareness both of one’s “non-being apart\nfrom nature”, and of one’s existence as a self-conscious\nbeing distinct from nature (WR 32). In the Lectures,\nFeuerbach claims that the feeling of dependence on nature is the only\n“truly universal” designation for the “psychological\nor subjective ground of religion” (VWR 39/31). This\ncontinues to be the case even after nature has ceased to be the locus\nof divinity, and the origin of the visible world is sought in the will\nof a transcendent creator who brought forth the world into being from\nnothing, and who is solely responsible for occurrences attributed by\npolytheists to a multitude of divine agencies. The objective\ncorrelates of the feeling of dependence, in the case of both\npolytheism and monotheism, are the really existing things and people\nwho are the objects of various human needs, physical and\npsychological, at least some of which Feuerbach implicitly recognizes,\nespecially in the Theogony, to be culturally determined.\n\nFeuerbach’s description of the feeling of dependence as\ninvolving the awareness\n\n\nthat I am nothing without a not-I which is distinct from me\nyet intimately related to me, something other, which is at\nthe same time my own being (VWR 350/311)\n\n\nreflects his understanding of nature as the totality of “the\nbeings [Wesen], things, [and] objects that man distinguishes\nfrom himself and his products” (WR 4). Nature, in other\nwords, is coterminous with the non-human world, devoid of\nconsciousness, will and sentiment. It includes such things as light,\nelectricity, air, water, earth, and the plants and animals upon which\nthe existence of human beings depends, but it also includes the human\norganism itself insofar as the effects produced by that organism are\nproduced unconsciously and involuntary. Nature is the “cause and\nground of man”; in human beings nature “becomes a\npersonal, conscious, intelligent (verständiges)\nbeing” (VWR 29/21). To say that human beings are\ndependent upon nature is to say, among other things, that nature,\nwhich is devoid of consciousness and intention, is what has caused\nhuman beings to exist, and that the same physical processes that have\nproduced the human brain have also produced human consciousness. While\nall organisms are dependent upon nature for their existence, human\nbeings are distinguished from other organisms by the extent of their\nconscious awareness of this dependence. This awareness Feuerbach finds\nexpressed in the earliest forms of cultic activity, including the\nearliest forms of nature religion focused, for example, on the changes\nof the seasons, and in the offering of sacrifice to divine beings\nassociated with various aspects of the natural world. Although nature\nis the original object of religion, this goes unrecognized initially\nbecause human beings do not at first distinguish themselves from\nnature or vice versa. The forces of nature are instead personified,\nand naturally occurring events are attributed to the human-like\nmotivations of spirits and gods. Religion, according to Feuerbach,\nexhibits the following contradiction: When it conceives of itself\ntheistically, it mistakenly thinks of God as a thoroughly non-human\nbeing (i.e., one whose existence and attributes in no way depends on\nthe existence and attributes of human beings), and when in conceives\nof itself as nature religion, it mistakenly attributes consciousness\nand will to what is in fact entirely non-human.\n\nFurther analysis of the feeling of the dependence leads Feuerbach to\nconclude that this feeling itself presupposes “egoism as the\nultimate hidden ground of religion” (VWR\n91–92/79). Here he reasons that, if human beings were not\nsubject to powerful psychological drives which compel them to expand\nand develop their natural powers, including most fundamentally the\ndrive-to-self-preservation, they would not experience the limitations\nimposed upon them by nature as painful and restricting.\n“Life is egoism” (EEWR 82)\ninsofar as the fundamental drive of all living things, including the\nhuman organism, is the drive to self-preservation\n(Selbsterhaltungstrieb). Nevertheless, what Feuerbach calls\n“human egoism” doesn’t seem to be the same thing\neither as psychological egoism (the claim that everyone always acts\nfrom self-interest) or ethical egoism (the claim that\n“good” is whatever serves my own interests). Feuerbach\nwrites that, by “human egoism” he means\n\n\nman’s love for himself, that is, love of the human essence, the\nlove that spurs him on to satisfy and develop all the impulses and\ntendencies without whose satisfaction and development he neither is\nnor can be a true, complete human being. (VWR\n60–61/50)\n\n\nThis type of self-love, which warrants comparison with, but is not the\nsame as, Rousseau’s amour de soi, encompasses love of\none’s fellow human beings, apart from whom one cannot either\ncultivate or satisfy the ethical, intellectual and aesthetic impulses\nand capacities in which one’s essential humanity consists, and\nto whose well-being one’s own is thus inextricably linked.\n\nFeuerbach’s book, Theogony according to the Sources of\nClassical, Hebrew and Christian Antiquity (1857), which is the\nproduct of six years of close engagement with Hebrew, Greek, and Latin\ntexts from antiquity, exemplifies the vastness of Feuerbach’s\nhumanistic erudition. Feuerbach considered it his “simplest,\nmost complete, mature work” (GW 20: 292). It may not be\na mere coincidence that the period of Feuerbach’s engagement in\nthese philological labors was the same period when one of his closest\ncorrespondents was Emil Ernst Gottfried von Herder, the son of Johann\nGottfried von Herder, whose introduction to the study of theology\nFeuerbach had read as a young man while he himself was learning Hebrew\ngrammar in preparation for his matriculation in the theological\nfaculty at the University of Heidelberg. Like the older Herder, who\nconceived of the poetry of the Hebrew Bible as a product of the genius\nof humanity in its childhood, Feuerbach turned to the Iliad\nand the Odyssey, which he thought of as the\nUrstätten or “original sites” of\nanthropology, and to the Hebrew scriptures, for clues to the origins\nof belief in the gods and in God. Large portions of the book consist\neither of 1) careful philological analyses of individual passages\nselected, for example, from the Iliad or the\nOdyssey, or from the creation accounts in Genesis, or else of\na verse from Pindar or Ovid, or a passage from the New Testament; or\n2) quotations from a wide range of Greco-Roman, patristic, rabbinical\nand medieval sources which Feuerbach cites in support of the central\nexplanatory claim of the book. This claim is that the psychological\norigin of belief in the gods and in God is the powerful human wish for\nhappiness or blessedness conceived as a state of freedom from the\n“limitations” (Grenze) that nature imposes on\nhuman existence, which are experienced by the human subject in the\nform of powerful feelings of hope and fear.\n\nIn seeking to substantiate the claim that the wish is the fundamental\nreligious phenomenon, Feuerbach analyzes several theophanies from the\nIliad in an effort to show that the gods make their\nappearances in the epic in response to petitions directed to them by\nhumans. Insofar as the ends toward which the actions of the gods in\nthe Homeric epics are directed are determined by the wishes of the\nmortals who invoke their blessings and curses, the gods act as the\nrepresentatives or deputies of (Vertreter) of human self-love\n(T 12). “The wish is a slave of necessity, but a slave\nwith the will to freedom” (T 47), and the gods are the\nimaginary embodiment of human freedom from the restrictions of\nfinitude. Feuerbach arrives at this conclusion through his analysis of\nacts of petitionary prayer in the Iliad and their role in\nwish fulfillment, and cites in this context the observation of the\nByzantine Homeric commentator, Eustathius of Thessalonica, that Homer\nallows no just request made of the gods to remain unfulfilled. In the\ndivine-human relationship, it is the mortals who desire, strive, and\nwill; and it is the gods who complete or bring to fruition these human\nintentions to the extent that the conditions for their satisfaction\nare beyond human control (T 19). While the wish itself is a\npurely subjective psychological occurrence, the completion of the\naction to which a wish might give rise, or the achievement of the end\ntoward which the wish is directed, depends upon external circumstances\nthat may or may not be conducive to the fulfillment of the wish.\nAnticipating a similar observation more famously made by the\npioneering field anthropologist, Bronislaw Malinowski, it is under\nsuch circumstances, where failure is a distinct possibility, and a\nmatter of urgency hangs in the balance, that the gods are invoked and\ntheir blessings sought in order to bring some human endeavor to a\nsuccessful completion. The gods are beings who are able to do or know\nwhat humans would like to be able to do or know, but cannot\n(T 39).\n\nReligion, on this account, does not originate, as philosophy does,\nfrom a theoretical or speculative impulse to understand the world, but\nrather from a practical concern to influence the course of events that\ntranspire within it. Belief in gods thus presupposes a desire that\nthere should exist beings capable of guaranteeing the success of human\nendeavors, and faith is preceded by hope in the logical order of\nthings religious. If human beings did not have a powerful desire, say,\nto be liberated from bondage or to avoid death, belief in the Promised\nLand or in immortality would never have arisen. In biblical terms,\nfaith in God is trust in what God promises, but what is promised by\nGod is what is sought after or desired by human beings. The religious\nsignificance of God’s promises is contingent upon their\ncorrespondence to deep-seated human desires. Whereas, in The\nEssence of Religion, Feuerbach referred to the feeling of\ndependence as the “ground” of religion, he now attributes\nthe psychological origin of the gods to the wish. The wish, considered\nas an act of striving for what remains beyond the limits of human\npower to achieve, is theogonic in the sense that theophanies (i.e.,\nmanifestations of the gods or of God) described in the Homeric epics\nand in the Bible, considered as narrative events, occur as responses\nto powerful human wishes or needs, or else as expressions of gratitude\nand celebration in response to occasions where these needs are\nbelieved to have been met through the cooperation or assistance of a\ndivine agency (T 32). The gods owe their existence to\n“sensualism and materialism” insofar as they are the\nproduct of the material needs of finite, embodied human subjects.\n\nInteresting sections of the Theogony are devoted to analyzing\nthe role of the gods in the consecration of oaths, and to the origins\nof conscience in the aggrieved will-to-happiness of the other.\nFeuerbach attributes belief in divine justice to the wish that the\nperson by whom one has been harmed should suffer harm themselves\n(T 103). He appeals to the mythological representations of\nthe furies and of Medusa as evidence of the “sensual”\norigins of the voice of conscience (T 136), which presupposes\na powerful, involuntary sense of sympathy with the suffering of person\nwho has suffered, or stands to suffer from, one’s actions. It is\n“only in his egoism that man has a criterion for distinguishing\nbetween right and writing” (T 140). At one point in the\nTheogony Feuerbach defines morality (Sittlichkeit)\nas “the drive-to-happiness endowed with wisdom, the wise,\nrational, healthy, normal, justified (gerechte)\nself-love” (T 82).\n\nWhen human beings in the course of their history acquire new and\ndifferent wishes, they tend also to worship new and different\ndivinities. Whereas the ancient Greco-Roman pagans, and even the\nancient Hebrews, were mainly concerned to secure blessedness in the\nform of long life and temporal prosperity, the early Christians sought\ntheir blessedness in eternity or “eternal life”. Feuerbach\nclosely associates this shift from a concern with temporal blessedness\nto a concern with eternal blessedness with the Christian emphasis on\ncreation ex nihilo, which he contrasts both with the Hebrew account of\ncreation as involving the forming and ordering of pre-existent\nelements, and the limitation of the Greco-Roman gods to being able to\nprolong the lives of mortals, and securing their blessedness in this\nlife, without being able to confer immortality upon them. The freedom\nfrom natural necessity ascribed by early Christian thinkers to God is\ninterpreted by Feuerbach as an expression of the wish of these\nChristians to be free themselves from the constraints of material\nexistence.\n7. The Naturalization of Ethics in Feuerbach’s Last Writings\n\nAs noted in the preceding section, Feuerbach’s espousal of\nsensuousness coincides with a movement toward nominalism that is\nreflected in a shift of emphasis from the human species to the\nindividual human being in his later works on religion. One way that\nthis shift shows itself is in a striking change in Feuerbach’s\nestimation of egoism. Among the many issues that remain unclear in\nFeuerbach’s later writings is what the expression “human\nessence” can mean for him once he has abandoned the\nspecies-ontology of his earlier writings and declared himself a\nnominalist. That pivotal question aside, it is at least clear that in\nPrinciples, and in his later writings on ethics, Feuerbach\ncontinues to emphasize the importance of inter-subjectivity and of the\nI-Thou relationship. However, these are no longer conceived in\nidealistic terms, as they had been previously, including\nFeuerbach’s doctoral dissertation, where he had spoken of\nthought as a species-activity in which the individual thinking subject\nparticipates. In his later writings on ethics, Feuerbach continues to\naffirm that human beings are essentially communal and dialogical\nbeings, both with respect to our cognitive and linguistic capacities,\nand with respect to the range of moral sentiments we experience toward\none another, but the communality in which the human essence is\nmanifested is now said to be one that presupposes a real,\n“sensible” distinction between I and Thou.\n\nUndoubtedly, the central concept in Feuerbach’s last works,\nwhich include the essay, “On Spiritualism and Materialism,\nEspecially in Relation to the Freedom of the Will”, as well as\nan incomplete essay on ethics, is the concept of the\nGlückseligkeitstrieb or drive-to-happiness. Toward the\nend of the Preliminary Theses, after affirming that all\nscience must be grounded in nature, and that doctrines not so grounded\nremain purely “hypothetical”, Feuerbach had gone on to\nnote that this is especially true of the doctrine of freedom, and he\nhad assigned to the new philosophy the task of “naturalizing\nfreedom” (VT 262/172). This is one of the tasks to\nwhich he applies himself in “On Spiritualism and\nMaterialism”, where he takes aim at\n“supernaturalistic” philosophers, among whom he counts\nKant, Fichte and Hegel, who ascribe to human beings a noumenal or\nuniversal will that is “independent of all natural laws and\nnatural causes and thus of all sensuous motivations\n[Triebfedern]” (SM 54). In arguing that it is\npossible for the will to be determined by the mere form of the moral\nlaw, independently of any sensible inclination, Kant had identified\nthe will with pure practical reason. In doing so, Feuerbach argues, he\nturned the will into a mere abstraction. For Feuerbach, it makes no\nsense to speak of a timeless will devoid of a volitional impulse\ndirected toward some particular object.\n\nThe concepts of drive (Trieb), happiness, sensation and will\nare closely interrelated in the account of agency that Feuerbach seeks\nto develop in these last writings. Feuerbach regards sensation as the\n“first condition of willing” (M 366), since\nwithout sensation there is no pain or need or sense of lack against\nwhich for the will to strive to assert itself. At one point, he\ndefines happiness as the “healthy, normal” state of\ncontentment or wellbeing experienced by an organism that is able to\nsatisfy the needs and drives that are constitutive of its\n“individual, characteristic nature and life” (M\n366). The drive-to-happiness is a drive toward the overcoming of a\nmultitude of painful limitations by which the finite, corporeal\nsubject is afflicted. These can include social conditions involving\n“political brutality and despotism” (VWR 61/50).\nEvery particular drive is a manifestation of the drive-to-happiness,\nand the different individual drives are named after the different\nobjects in which people seek their happiness (SM 70). Among\nthe specific drives to which Feuerbach refers in his later writings\nare the drive-to-self-preservation, the sexual drive, the\ndrive-to-enjoyment, the drive-to-activity and the drive-to-knowledge.\nAlthough he does not explicitly associate drives with the unconscious,\nFeuerbach does anticipate Nietzsche and Freud in regarding the body as\nthe “ground” of both the will and of consciousness\n(SM 153), and he emphasizes that action results from the\nforce with which a dominant drive succeeds in subduing other\nconflicting drives that may reassert themselves under altered\ncircumstances (SM 91). Feuerbach also occasionally\ndistinguishes between healthy and unhealthy drives, though he has\nlittle to say about the standard or criterion he uses for making such\na distinction.\n\nWhereas happiness involves the experience of a sense of contentment on\nthe part of a being that is able to satisfy the drives that are\ncharacteristic of its nature, the inability to satisfy these drives\nresults in various forms of discontent, aggravation, pain and\nfrustration. The German word, “Widerwille”, means\ndisgust or repugnance, but literally it involves not-wanting or,\netymologically, “willing against”, and this, Feuerbach\ncontends, is the most rudimentary form of willing.\n\n\nEvery malady (Übel), every unsatisfied drive, every\nunassuaged longing, every sense of absence [i.e., of a desired object]\nis an irritating or stimulating injury and negation of the\ndrive-to-happiness innate in each living and sensing being, and the\ncountervailing affirmation of the drive-to-happiness, accompanied by\nrepresentations and consciousness, is what we call “will”.\n(M 367)\n\n\nFreedom of the will, as Feuerbach conceives of it here, is freedom\nfrom the evils (Übeln) by which my drive-to-happiness is\nrestricted, and is contingent upon the availability to me of the\nspecific means required for overcoming these restrictions.\n\nAnother way that Feuerbach seeks to “naturalize freedom”\nis by developing a naturalistic account of conscience according to\nwhich the voice of conscience, which imposes restrictions on my own\ndrive-to-happiness, functions in doing so as the advocate for the\ndrive-to-happiness of “the I apart from me, the sensuous\nThou” (SM 80), who has been or stands to be harmed by\nthose actions from which I can have a moral obligation to refrain from\nperforming. Where there is no harm or benefit, Feuerbach contends,\nthere is no criterion for distinguishing right from wrong (SM\n75–76). Feuerbach agrees with Schopenhauer in regarding\ncompassion (Mitleid) as a basic source of moral motivation,\nbut rejects Schopenhauer’s association of compassion with the\nrenunciation of the will to live. The purpose of morality and law is\nto harmonize the drive-to-happiness of the various individual members\nof a moral community.\n\n\nMy right is the legal recognition of my own drive-to-happiness, my\nduty is the drive-to-happiness of the other that demands recognition\nfrom me. (SM 74)\n\n\nThe moral will, as Feuerbach conceives of it here, is not a\ndisinterested will. It is rather “that will which seeks to cause\nno harm because it wishes to suffer no harm” (SM 80),\nand has come to identify its own interests with those of others.\nBecause sympathy for the suffering of others presupposes antipathy\ntoward my own suffering, whoever does away with self-interest (i.e.,\nrefuses to recognize moral value in actions motivated by\nself-interest) does away at the same time with compassion\n(Mitleid).\n",
    "bibliography": {
        "categories": [
            "Feuerbach Works",
            "Other References"
        ],
        "cat_ref_text": {
            "Feuerbach Works": [
                "</h3>\n<ul class=\"hanging\">",
                "[<em>AP</em>] “Einige Bemerkungen über den <em>Anfang\nder Philosophie</em> von D.J.F. Reiff” (1841) = <em>GW</em>, v.\n9, 143–153 = “On ‘The Beginning of\nPhilosophy,’” in <em>FB</em> 135–144.",
                "[<em>B</em>] “Zur Beurteilung der Schrift <em>Das Wesen des\nChristentums</em>” (1842) = <em>GW</em> v. 9, 229–242. No\ntranslation available.",
                "[<em>EEWR</em>] <em>Ergänzungen und Erläuterungen zum\n“Wesen der Religion”</em> (1846) = <em>GW</em> v. 10,\n80–121.",
                "[<em>FB</em>] <em>The Fiery Brook: Selected Writings of Ludwig\nFeuerbach</em>, trans. with an introduction by Z. Hanfi, Garden City,\nN.Y., Doubleday, 1972.",
                "[<em>GPZ</em>] <em>Grundsätze der Philosophie der\nZukunft</em> = <em>GW</em> v. 9, 264–341 = <em>Principles of the\nPhilosophy of the Future</em>, trans. M. Vogel with an intro by T.E.\nWartenberg, Indianapolis: Hackett, 1986.",
                "[<em>GTU</em>] <em>Gedanken über Tod und Unsterblichkeit aus\nden Papieren eines Denkers</em> (1830), <em>GW</em> v. 1,\n175–515 = <em>Thoughts on Death and Immortality from the Papers\nof a Thinker</em>, trans. with intro and notes by J.A. Massey,\nBerkeley: University of California Press, 1980.",
                "[<em>GW</em>] Feuerbach, L. (1981–), <em>Gesammelte\nWerke</em>, W. Schuffenhauer (ed.), Berlin: Akademie Verlag.",
                "[<em>KPP</em>] <em>Zur Kritik der “positiven\nPhilosophie”</em> (1839) = <em>GW</em>, v. 8, 181–207. No\ntranslation available.",
                "[<em>M</em>] “Zur Moralphilosophie” (1868), W.\nSchuffenhauer (ed.), in Braun, 1994: 353–430. No translation\navailable.",
                "[<em>NV</em>] “Grundsätze der Philosophie:\nNotwendigkeit einer Veränderung” (date uncertain), in\nFeuerbach, 1996: 119–135 = “The Necessity of a Reform of\nPhilosophy”, in <em>FB</em>, 145–152. This unpublished\nmanuscript is not included in any of the volumes of <em>GW</em> that\nhave appeared to date.",
                "[<em>SM</em>] “Über Spiritualismus und Materialismus,\nbesonders in Beziehung auf die Willensfreiheit” (1866) =\n<em>GW</em> v. 11, 53–186. No translation available.",
                "[<em>VGP</em>] <em>Vorlesungen über die Geschichte der\nneueren Philosophie</em>, E. Thies (ed.), Darmstadt: Wissenschaftliche\nBuchgesellschaft, 1974. This volume contains notes for lectures on the\nhistory of modern philosophy delivered by Feuerbach in Erlangen during\nthe 1835/36 academic year.",
                "[<em>VWR</em>] <em>Vorlesungen über das Wesen der\nReligion</em> = <em>GW</em> v. 6 = <em>Lectures on the Essence of\nReligion</em>, trans. R. Manheim, New York: Harper &amp; Row,\n1967.",
                "[<em>VT</em>] “Vorläufige Thesen zur Reformation der\nPhilosophie” (1842) = <em>GW</em> v. 9, 243–263.",
                "[<em>WC</em>] <em>Das Wesen des Christentums</em> (1841) =\n<em>GW</em>, v. 5 = <em>The Essence of Christianity</em>, trans. G.\nEliot with an intro by K. Barth and a foreword by H.R. Niebuhr, New\nYork: Harper Torchbooks, 1957.",
                "[<em>WGL</em>] <em>Das Wesen des Glaubens im Sinne</em> Luthers =\n<em>GW</em>, v. 9, 353–412 = <em>The Essence of Faith According\nto Luther</em>, trans. and with an introduction by M. Cherno, New\nYork: Harper &amp; Row, 1967.",
                "[<em>WR</em>] <em>Das Wesen der Religion</em> (1846) = <em>GW</em>\nv. 10, 3–19.",
                "[<em>T</em>] <em>Theogonie nach den Quellen des klassischen,\nhebräischen und christlichen Altertums</em> (1857) = <em>GW</em>\nv. 7.\n</ul>\n<h3 id=\"OtheRefe\">"
            ],
            "Other References": [
                "</h3>\n<ul class=\"hanging\">",
                "Ameriks, Karl, 2000, “The Legacy of Idealism in the\nPhilosophy of Feuerbach, Marx, and Kierkegaard”, in <em>The\nCambridge Companion to German Idealism</em>, Karl Ameriks (ed.).\nCambridge: Cambridge University Press, 258–281.\ndoi:10.1017/CCOL0521651786.014",
                "Arndt, Andreas (ed.), 2020, <em>Ludwig Feuerbach: Das Wesen des\nChristentums</em>, Klassiker Auslegen, Bd. 52, Berlin/Boston: de\nGruyter.",
                "Arndt, Andreas and Walter Jaeschke (eds.), 2000, <em>Materialismus\nund Spiritualismus: Philosophie und Wissenschaften nach 1848</em>,\nHamburg: Meiner.",
                "Ascheri, Carlo, 1964, Review of Rawidowicz (1964) in\n<em>Philosophische Rundschau</em>, 11(1): 55–65.",
                "Ascheri, Carlo, 1969, <em>Feuerbachs Bruch mit der Spekulation;\nEinleitung zur kritischen Ausgabe von Feuerbach: Notwendigkeit einer\nVeränderung (1842)</em>, Frankfurt: Europäische\nVerlagsanstalt.",
                "Bishop, Paul, 2009, “Eudaimonism, Hedonism and\nFeuerbach’s Philosophy of the Future”, <em>Intellectual\nHistory Review</em>, 19(1): 65–81.\ndoi:10.1080/17496970902722908",
                "Braun, Hans-Jürg, 1971, <em>Ludwig Feuerbachs Lehre vom\nMenschen</em>. Stuttgart-Bad Cannstatt: F. Frommann.",
                "––– (ed.), 1990, <em>Ludwig Feuerbach und die\nPhilosophie der Zukunft</em>, Berlin: Akademie-Verlag.",
                "––– (ed.), 1994, <em>Solidarität oder\nEgoismus: Studien zu einer Ethik bei und nach Ludwig Feuerbach</em>,\nBerlin: Akademie-Verlag.",
                "Breckman, Warren, 1999, <em>Marx, the Young Hegelians, and the\nOrigins of Radical Social Theory</em>, Cambridge: Cambridge University\nPress.",
                "Brudney, Daniel, 1998, <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.",
                "Buber, Martin, 1965, <em>Between Man and Man</em>, New York:\nMacmillan.",
                "Cornehl, Peter, 1969, “Feuerbach und die Naturphilosophie:\nZur Genese der Anthropologie und Religionskritik des jungen\nFeuerbachs”, in <em>Neue Zeitschrift für systematische\nTheologie und Religionsphilosophie</em>, 11(1): 37–93.\ndoi:10.1515/nzst.1969.11.1.37",
                "Deranty, Jean-Philippe, 1973, “Feuerbach’s Theory of\nObject-Relations and Its Legacy in 20th Century Post-Hegelian\nPhilosophy,” <em>The Southern Journal of Philosophy</em>, 53(3):\n286–310.",
                "Dickey, Laurence, “Hegel on Religion and Philosophy,”\nin <em>The Cambridge Companion to Hegel</em>, Frederick C. Beiser\n(ed.), Cambridge: Cambridge University Press, 301–347.",
                "Ebbinghaus, J., 1930, “Ludwig Feuerbach”, in\n<em>Deutsche Vierteljahrsschrift für Literaturwissenschaft und\nGeistesgeschichte</em>, 8: 283–305.",
                "Engels, Friedrich, 1888, <em>Ludwig Feuerbach und der Ausgang der\nklassischen deutschen Philosophie</em>, Stuttgart: J.H.W. Dietz.",
                "Feuerbach, Ludwig, 1996, <em>Entwürfe zu einer Neuen\nPhilosophie</em>, W. Jaeschke and W. Schuffenhauer (eds.), Hamburg:\nMeiner.",
                "–––, 2012, <em>Abelard and Heloise or The Writer\nand the Human: A Series of Humorous Philosophical Aphorisms</em>,\ntrans. with an introduction by Eric v. d. Luft, foreword by Angela\nMoreira, North Syracuse: Gegensatz Press.",
                "von Gagern, Michel, 1970, <em>Ludwig Feuerbach: Philosophie- und\nReligionskritik; Die “Neue” Philosophie</em>, Munich:\nAnton Pustet.",
                "Gedö, A., 1995, “Philosophie zwischen den Zeiten:\nAuseinandersetzungen um den Philosophiebegriff im Vormärz”,\nin Walter Jaeschke (ed.), <em>Philosophie und Literatur im\nVormärz: Der Streit um die Romantik (1820–1854)</em>,\nHamburg: Felix Meiner Verlag, 1–39.",
                "Gooch, Todd, 2011, “Some Political Implications of\nFeuerbach’s Theory of Religion”, in Douglas Moggach (ed.),\n<em>Politics, Religion, and Art: Hegelian Debates</em>, Evanston, IL:\nNorthwestern University Press), 257–280.",
                "–––, 2013a, “‘Bruno\nReincarnate’: The Early Feuerbach on God, Love and Death”,\n<em>Journal for the History of Modern Theology / Zeitschrift für\nNeuere Theologiegeschichte</em>, 20(1): 1–23.\ndoi:10.1515/znth-2013-0005",
                "–––, 2013b, “Philosophy, Religion and the\nPolitics of <em>Bildung</em>, in Hegel and Feuerbach,” in\n<em>Hegel on Religion and Politics</em>, Angelica Nuzzo (ed.), Albany,\nNY: SUNY Press, 187–211.",
                "–––, 2019, “Critique of Religion: Strauss,\nFeuerbach, Marx,” in <em>A Companion to Nineteenth-Century\nPhilosophy</em>, ed. John Shand, Blackwell Companions to Philosophy,\nMalden, Mass.: Blackwell, 212–235.",
                "Gordon, Frederick M., 1979, “The Contradictory Nature of\nFeuerbachian Humanism”, <em>Philosophical Forum</em>, 8(2):\n31–47.",
                "Guidry, G.A., 1993, “Ludwig Anselm Feuerbach\n(1804–1872)”, <em>Dictionary of Literary Biography</em>,\nv. 133, <em>Nineteenth-Century German Writers to 1840</em>, James\nHardin and Siegfried Mews (eds.), the Gale Group, 68–77.",
                "Gregory, Frederick, 1977, <em>Scientific Materialism in Nineteenth\nCentury Germany</em>, Dordrecht, Holland/Boston: D. Reidel.",
                "Harvey, Van A., 1995, <em>Feuerbach and the Interpretation of\nReligion</em>, Cambridge/New York, Cambridge University Press.",
                "–––, 2009, “Ludwig Feuerbach”, in\nG.R. Oppy and N. Trakakis (eds.), <em>The History of Western\nPhilosophy of Religion</em>, v. 4, New York: Oxford University Press,\n133–144.",
                "Hegel, Georg Wilhelm Friedrich, [1807] 1977, <em>Phenomenology of\nSpirit</em>, trans. A.V. Miller, Oxford: Oxford University Press.",
                "–––, [1812–1816] 1969, <em>Hegel’s\nScience of Logic</em>, trans. A.V. Miller, London: Allen &amp;\nUnwin.",
                "–––, [L], <em>Hegel: The Letters</em>, trans. C.\nButler and C. Seiler. Bloomington: Indiana University Press,\n1984.",
                "–––, [EPS], <em>The Encyclopedia Logic: Part I\nof the Encyclopaedia of Philosophical Sciences with the\nZusätze</em>, trans. T.F. Geraets, W.A. Suchting &amp; H.S.\nHarris, Indianapolis/Cambridge: Hackett, 1991.",
                "Jacobi, Friedrich Heinrich, [MPW], <em>The Main Philosophical\nWritings and the Novel</em>, Allwill, trans. George di Giovanni,\nMontreal &amp; Kingston: McGill-Queen’s University Press,\n1994.",
                "Jaeschke, Walter, 1978, “Feuerbach redivivus: Eine\nAuseinandersetzung mit der gegenwärtigen Forschung im Blick auf\nHegel”, <em>Hegel-Studien</em>, 13: 199–237.",
                "–––, 1990, <em>Reason in Religion: The\nFoundations of Hegel’s Philosophy of Religion</em>, trans. J.\nMichael Stewart and Peter C. Hodgson, Berkeley: University of\nCalifornia Press.",
                "––– (ed.), 1992, <em>Sinnlichkeit und\nRationalität: der Umbruch in der Philosophie des 19. Jahrhunderts\n: Ludwig Feuerbach</em>, Berlin: Akademie Verlag.",
                "–––, 1980, “Speculative and\nAnthropological Criticism of Religion: A Theological Orientation to\nHegel and Feuerbach”, <em>Journal of the American Academy of\nReligion</em>, 48(3): 345–64.",
                "Jaeschke, Walter and Francesco Tomasoni (eds.), 1998, <em>Ludwig\nFeuerbach und die Geschichte der Philosophie</em>, Berlin: Akademie\nVerlag.",
                "Johnston, Larry, 1995, <em>Between Transcendence and Nihilism:\nSpecies-Ontology in the Philosophy of Ludwig Feuerbach</em>, New York:\nPeter Lang.",
                "Lange, Friedrich Albert, [1866] 1974, <em>Geschichte des\nMaterialismus und Kritik seiner Bedeutung in der Gegenwart</em>,\nAlfred Schmidt (ed.), 2 vols., Frankfurt am Main: Suhrkamp.",
                "Levitt, Cyril and Anouk Turgeon, 2009, “Sigmund\nFreud’s Intensive Reading of Ludwig Feuerbach,”\n<em>Canadian Journal of Psychoanalysis</em>, 17(1): 14–35.",
                "Löwith, Karl, 1964, <em>From Hegel to Nietzsche: The\nRevolution in Nineteenth-Century Thought</em>, David E. Green (tr.),\nNew York: Columbia University Press.",
                "Löwith, Karl, 1981, <em>Das Individuum in seiner Rolle des\nMitmenschen</em>, (1928), in <em>Mensch und Menschenwelt:\nBeiträge zur Anthropologie</em>, Klaus Stichweh (ed.), Stuttgart:\nMetzler, 9–197.",
                "Lübbe, Hermann and Hans-Martin Saß (eds.), 1975,\n<em>Atheismus in der Diskussion: Kontroversen um Ludwig\nFeuerbach</em>, Munich: Kaiser; Mainz: Grunewald.",
                "Marx, Karl, 1844, “Economic and Philosophical\nManuscripts”, in <em>Selected Writings</em>, L.H. Simon (ed.),\nIndianapolis/Cambridge: Hackett, 1994.",
                "Mandelbaum, Maurice, 1971, <em>History, Man, &amp; Reason: A Study\nin Nineteenth-Century Thought</em>, Baltimore and London: John Hopkins\nPress.",
                "Pinkard, Terry, 2002, <em>German Philosophy 1760–1860: The\nLegacy of Idealism</em>, Cambridge: Cambridge University Press.",
                "–––, 2000, <em>Hegel: A Biography</em>,\nCambridge: Cambridge University Press.",
                "Rawidowicz, Simon, 1964, <em>Ludwig Feuerbachs Philosophie:\nUrsprung und Schicksal</em>, 2<sup>nd</sup> edition, Berlin: Walter de\nGruyter.",
                "Reitemeyer, Ursula, 1988, <em>Philosophie Der Leiblichkeit: Ludwig\nFeuerbachs Entwurf Einer Philosophie Der Zukunft</em>, Frankfurt am\nMain: Suhrkamp.",
                "Schmidt, Alfred, 1973, <em>Emanzipatorische Sinnlichkeit: Ludwig\nFeuerbachs anthropologischer Materialismus</em>, Munich: Carl Hanser\nVerlag.",
                "Schott, Uwe, 1973, <em>Die Jugendentwicklung Ludwig Feuerbachs bis\nzum Fakultätswechsel 1825</em>, Göttingen: Vandenhoeck und\nRuprecht.",
                "Spinoza, Baruch, [1677] 2007, <em>Theological-Political\nTreatise</em>, Jonathan Israel (ed.), Michael Silverstone and Jonathan\nIsrael (trs). Cambridge: Cambridge University Press.",
                "Thies, Erich (ed.), 1976, <em>Ludwig Feuerbach</em>, Wege der\nForschung 438, Darmstadt: Wissenschaftliche Buchgesellschaft.",
                "Toews, John E., 1980, <em>Hegelianism: The Path Toward Dialectical\nHumanism, 1805–1841</em>, Cambridge/New York: Cambridge\nUniversity Press.",
                "Tomasoni, Francesco, 2015, <em>Ludwig Feuerbach: Entstehung,\nEntwicklung und Bedeutung seines Werkes</em>, trans. Gunnhild\nSchneider, Münster/New York.",
                "Tomasoni, Francesco, 1990, <em>Ludwig Feuerbach und die\nnicht-menschliche Natur: Das Wesen der Religion: Die\nEntstehungsgeschichte des Werks, rekonstruirt auf der Grundlage\nunveröffintlichter Manuskripte</em>, Stuttgart/Bad Cannstatt:\nFrommann-Holzboog.",
                "Wartofsky, Marx W., 1977, <em>Feuerbach</em>, Cambridge: Cambridge\nUniversity Press.",
                "Weckwerth, Christine, 2002, <em>Ludwig Feuerbach zur\nEinführung</em>, Hamburg: Junius.",
                "Winiger, Josef, 2004, <em>Ludwig Feuerbach: Denker der\nMenschlichkeit : Biographie</em>, Berlin: Aufbau Taschenbuch\nVerlag.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<p>\nReferences to Feuerbach’s published writings are to the critical\nedition of his collected works or <em>Gesammelte Werke</em> (hereafter\n<em>GW</em>) edited by Werner Schuffenhauer, Berlin: Akademie Verlag,\n1981–. Feuerbach’s writings are cited in the text using\nthe following system of abbreviation. Page numbers refer to the\nrelevant volume of <em>GW</em> as indicated below. In cases where two\npage numbers are separated by a slash, the second refers to the\nrelevant translation as indicated below. Although I have made use of\nthese translations, in many cases I have preferred to provide my\nown.</p>\n<h3 id=\"FeueWork\">Feuerbach Works</h3>\n<ul class=\"hanging\">\n<li>[<em>AP</em>] “Einige Bemerkungen über den <em>Anfang\nder Philosophie</em> von D.J.F. Reiff” (1841) = <em>GW</em>, v.\n9, 143–153 = “On ‘The Beginning of\nPhilosophy,’” in <em>FB</em> 135–144.</li>\n<li>[<em>B</em>] “Zur Beurteilung der Schrift <em>Das Wesen des\nChristentums</em>” (1842) = <em>GW</em> v. 9, 229–242. No\ntranslation available.</li>\n<li>[<em>EEWR</em>] <em>Ergänzungen und Erläuterungen zum\n“Wesen der Religion”</em> (1846) = <em>GW</em> v. 10,\n80–121.</li>\n<li>[<em>FB</em>] <em>The Fiery Brook: Selected Writings of Ludwig\nFeuerbach</em>, trans. with an introduction by Z. Hanfi, Garden City,\nN.Y., Doubleday, 1972.</li>\n<li>[<em>GPZ</em>] <em>Grundsätze der Philosophie der\nZukunft</em> = <em>GW</em> v. 9, 264–341 = <em>Principles of the\nPhilosophy of the Future</em>, trans. M. Vogel with an intro by T.E.\nWartenberg, Indianapolis: Hackett, 1986.</li>\n<li>[<em>GTU</em>] <em>Gedanken über Tod und Unsterblichkeit aus\nden Papieren eines Denkers</em> (1830), <em>GW</em> v. 1,\n175–515 = <em>Thoughts on Death and Immortality from the Papers\nof a Thinker</em>, trans. with intro and notes by J.A. Massey,\nBerkeley: University of California Press, 1980.</li>\n<li>[<em>GW</em>] Feuerbach, L. (1981–), <em>Gesammelte\nWerke</em>, W. Schuffenhauer (ed.), Berlin: Akademie Verlag.</li>\n<li>[<em>KPP</em>] <em>Zur Kritik der “positiven\nPhilosophie”</em> (1839) = <em>GW</em>, v. 8, 181–207. No\ntranslation available.</li>\n<li>[<em>M</em>] “Zur Moralphilosophie” (1868), W.\nSchuffenhauer (ed.), in Braun, 1994: 353–430. No translation\navailable.</li>\n<li>[<em>NV</em>] “Grundsätze der Philosophie:\nNotwendigkeit einer Veränderung” (date uncertain), in\nFeuerbach, 1996: 119–135 = “The Necessity of a Reform of\nPhilosophy”, in <em>FB</em>, 145–152. This unpublished\nmanuscript is not included in any of the volumes of <em>GW</em> that\nhave appeared to date.</li>\n<li>[<em>SM</em>] “Über Spiritualismus und Materialismus,\nbesonders in Beziehung auf die Willensfreiheit” (1866) =\n<em>GW</em> v. 11, 53–186. No translation available.</li>\n<li>[<em>VGP</em>] <em>Vorlesungen über die Geschichte der\nneueren Philosophie</em>, E. Thies (ed.), Darmstadt: Wissenschaftliche\nBuchgesellschaft, 1974. This volume contains notes for lectures on the\nhistory of modern philosophy delivered by Feuerbach in Erlangen during\nthe 1835/36 academic year.</li>\n<li>[<em>VWR</em>] <em>Vorlesungen über das Wesen der\nReligion</em> = <em>GW</em> v. 6 = <em>Lectures on the Essence of\nReligion</em>, trans. R. Manheim, New York: Harper &amp; Row,\n1967.</li>\n<li>[<em>VT</em>] “Vorläufige Thesen zur Reformation der\nPhilosophie” (1842) = <em>GW</em> v. 9, 243–263.</li>\n<li>[<em>WC</em>] <em>Das Wesen des Christentums</em> (1841) =\n<em>GW</em>, v. 5 = <em>The Essence of Christianity</em>, trans. G.\nEliot with an intro by K. Barth and a foreword by H.R. Niebuhr, New\nYork: Harper Torchbooks, 1957.</li>\n<li>[<em>WGL</em>] <em>Das Wesen des Glaubens im Sinne</em> Luthers =\n<em>GW</em>, v. 9, 353–412 = <em>The Essence of Faith According\nto Luther</em>, trans. and with an introduction by M. Cherno, New\nYork: Harper &amp; Row, 1967.</li>\n<li>[<em>WR</em>] <em>Das Wesen der Religion</em> (1846) = <em>GW</em>\nv. 10, 3–19.</li>\n<li>[<em>T</em>] <em>Theogonie nach den Quellen des klassischen,\nhebräischen und christlichen Altertums</em> (1857) = <em>GW</em>\nv. 7.</li>\n</ul>\n<h3 id=\"OtheRefe\">Other References</h3>\n<ul class=\"hanging\">\n<li>Ameriks, Karl, 2000, “The Legacy of Idealism in the\nPhilosophy of Feuerbach, Marx, and Kierkegaard”, in <em>The\nCambridge Companion to German Idealism</em>, Karl Ameriks (ed.).\nCambridge: Cambridge University Press, 258–281.\ndoi:10.1017/CCOL0521651786.014</li>\n<li>Arndt, Andreas (ed.), 2020, <em>Ludwig Feuerbach: Das Wesen des\nChristentums</em>, Klassiker Auslegen, Bd. 52, Berlin/Boston: de\nGruyter.</li>\n<li>Arndt, Andreas and Walter Jaeschke (eds.), 2000, <em>Materialismus\nund Spiritualismus: Philosophie und Wissenschaften nach 1848</em>,\nHamburg: Meiner.</li>\n<li>Ascheri, Carlo, 1964, Review of Rawidowicz (1964) in\n<em>Philosophische Rundschau</em>, 11(1): 55–65.</li>\n<li>Ascheri, Carlo, 1969, <em>Feuerbachs Bruch mit der Spekulation;\nEinleitung zur kritischen Ausgabe von Feuerbach: Notwendigkeit einer\nVeränderung (1842)</em>, Frankfurt: Europäische\nVerlagsanstalt.</li>\n<li>Bishop, Paul, 2009, “Eudaimonism, Hedonism and\nFeuerbach’s Philosophy of the Future”, <em>Intellectual\nHistory Review</em>, 19(1): 65–81.\ndoi:10.1080/17496970902722908</li>\n<li>Braun, Hans-Jürg, 1971, <em>Ludwig Feuerbachs Lehre vom\nMenschen</em>. Stuttgart-Bad Cannstatt: F. Frommann.</li>\n<li>––– (ed.), 1990, <em>Ludwig Feuerbach und die\nPhilosophie der Zukunft</em>, Berlin: Akademie-Verlag.</li>\n<li>––– (ed.), 1994, <em>Solidarität oder\nEgoismus: Studien zu einer Ethik bei und nach Ludwig Feuerbach</em>,\nBerlin: Akademie-Verlag.</li>\n<li>Breckman, Warren, 1999, <em>Marx, the Young Hegelians, and the\nOrigins of Radical Social Theory</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Brudney, Daniel, 1998, <em>Marx’s Attempt to Leave\nPhilosophy</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Buber, Martin, 1965, <em>Between Man and Man</em>, New York:\nMacmillan.</li>\n<li>Cornehl, Peter, 1969, “Feuerbach und die Naturphilosophie:\nZur Genese der Anthropologie und Religionskritik des jungen\nFeuerbachs”, in <em>Neue Zeitschrift für systematische\nTheologie und Religionsphilosophie</em>, 11(1): 37–93.\ndoi:10.1515/nzst.1969.11.1.37</li>\n<li>Deranty, Jean-Philippe, 1973, “Feuerbach’s Theory of\nObject-Relations and Its Legacy in 20th Century Post-Hegelian\nPhilosophy,” <em>The Southern Journal of Philosophy</em>, 53(3):\n286–310.</li>\n<li>Dickey, Laurence, “Hegel on Religion and Philosophy,”\nin <em>The Cambridge Companion to Hegel</em>, Frederick C. Beiser\n(ed.), Cambridge: Cambridge University Press, 301–347.</li>\n<li>Ebbinghaus, J., 1930, “Ludwig Feuerbach”, in\n<em>Deutsche Vierteljahrsschrift für Literaturwissenschaft und\nGeistesgeschichte</em>, 8: 283–305.</li>\n<li>Engels, Friedrich, 1888, <em>Ludwig Feuerbach und der Ausgang der\nklassischen deutschen Philosophie</em>, Stuttgart: J.H.W. Dietz.</li>\n<li>Feuerbach, Ludwig, 1996, <em>Entwürfe zu einer Neuen\nPhilosophie</em>, W. Jaeschke and W. Schuffenhauer (eds.), Hamburg:\nMeiner.</li>\n<li>–––, 2012, <em>Abelard and Heloise or The Writer\nand the Human: A Series of Humorous Philosophical Aphorisms</em>,\ntrans. with an introduction by Eric v. d. Luft, foreword by Angela\nMoreira, North Syracuse: Gegensatz Press.</li>\n<li>von Gagern, Michel, 1970, <em>Ludwig Feuerbach: Philosophie- und\nReligionskritik; Die “Neue” Philosophie</em>, Munich:\nAnton Pustet.</li>\n<li>Gedö, A., 1995, “Philosophie zwischen den Zeiten:\nAuseinandersetzungen um den Philosophiebegriff im Vormärz”,\nin Walter Jaeschke (ed.), <em>Philosophie und Literatur im\nVormärz: Der Streit um die Romantik (1820–1854)</em>,\nHamburg: Felix Meiner Verlag, 1–39.</li>\n<li>Gooch, Todd, 2011, “Some Political Implications of\nFeuerbach’s Theory of Religion”, in Douglas Moggach (ed.),\n<em>Politics, Religion, and Art: Hegelian Debates</em>, Evanston, IL:\nNorthwestern University Press), 257–280.</li>\n<li>–––, 2013a, “‘Bruno\nReincarnate’: The Early Feuerbach on God, Love and Death”,\n<em>Journal for the History of Modern Theology / Zeitschrift für\nNeuere Theologiegeschichte</em>, 20(1): 1–23.\ndoi:10.1515/znth-2013-0005</li>\n<li>–––, 2013b, “Philosophy, Religion and the\nPolitics of <em>Bildung</em>, in Hegel and Feuerbach,” in\n<em>Hegel on Religion and Politics</em>, Angelica Nuzzo (ed.), Albany,\nNY: SUNY Press, 187–211.</li>\n<li>–––, 2019, “Critique of Religion: Strauss,\nFeuerbach, Marx,” in <em>A Companion to Nineteenth-Century\nPhilosophy</em>, ed. John Shand, Blackwell Companions to Philosophy,\nMalden, Mass.: Blackwell, 212–235.</li>\n<li>Gordon, Frederick M., 1979, “The Contradictory Nature of\nFeuerbachian Humanism”, <em>Philosophical Forum</em>, 8(2):\n31–47.</li>\n<li>Guidry, G.A., 1993, “Ludwig Anselm Feuerbach\n(1804–1872)”, <em>Dictionary of Literary Biography</em>,\nv. 133, <em>Nineteenth-Century German Writers to 1840</em>, James\nHardin and Siegfried Mews (eds.), the Gale Group, 68–77.</li>\n<li>Gregory, Frederick, 1977, <em>Scientific Materialism in Nineteenth\nCentury Germany</em>, Dordrecht, Holland/Boston: D. Reidel.</li>\n<li>Harvey, Van A., 1995, <em>Feuerbach and the Interpretation of\nReligion</em>, Cambridge/New York, Cambridge University Press.</li>\n<li>–––, 2009, “Ludwig Feuerbach”, in\nG.R. Oppy and N. Trakakis (eds.), <em>The History of Western\nPhilosophy of Religion</em>, v. 4, New York: Oxford University Press,\n133–144.</li>\n<li>Hegel, Georg Wilhelm Friedrich, [1807] 1977, <em>Phenomenology of\nSpirit</em>, trans. A.V. Miller, Oxford: Oxford University Press.</li>\n<li>–––, [1812–1816] 1969, <em>Hegel’s\nScience of Logic</em>, trans. A.V. Miller, London: Allen &amp;\nUnwin.</li>\n<li>–––, [L], <em>Hegel: The Letters</em>, trans. C.\nButler and C. Seiler. Bloomington: Indiana University Press,\n1984.</li>\n<li>–––, [EPS], <em>The Encyclopedia Logic: Part I\nof the Encyclopaedia of Philosophical Sciences with the\nZusätze</em>, trans. T.F. Geraets, W.A. Suchting &amp; H.S.\nHarris, Indianapolis/Cambridge: Hackett, 1991.</li>\n<li>Jacobi, Friedrich Heinrich, [MPW], <em>The Main Philosophical\nWritings and the Novel</em>, Allwill, trans. George di Giovanni,\nMontreal &amp; Kingston: McGill-Queen’s University Press,\n1994.</li>\n<li>Jaeschke, Walter, 1978, “Feuerbach redivivus: Eine\nAuseinandersetzung mit der gegenwärtigen Forschung im Blick auf\nHegel”, <em>Hegel-Studien</em>, 13: 199–237.</li>\n<li>–––, 1990, <em>Reason in Religion: The\nFoundations of Hegel’s Philosophy of Religion</em>, trans. J.\nMichael Stewart and Peter C. Hodgson, Berkeley: University of\nCalifornia Press.</li>\n<li>––– (ed.), 1992, <em>Sinnlichkeit und\nRationalität: der Umbruch in der Philosophie des 19. Jahrhunderts\n: Ludwig Feuerbach</em>, Berlin: Akademie Verlag.</li>\n<li>–––, 1980, “Speculative and\nAnthropological Criticism of Religion: A Theological Orientation to\nHegel and Feuerbach”, <em>Journal of the American Academy of\nReligion</em>, 48(3): 345–64.</li>\n<li>Jaeschke, Walter and Francesco Tomasoni (eds.), 1998, <em>Ludwig\nFeuerbach und die Geschichte der Philosophie</em>, Berlin: Akademie\nVerlag.</li>\n<li>Johnston, Larry, 1995, <em>Between Transcendence and Nihilism:\nSpecies-Ontology in the Philosophy of Ludwig Feuerbach</em>, New York:\nPeter Lang.</li>\n<li>Lange, Friedrich Albert, [1866] 1974, <em>Geschichte des\nMaterialismus und Kritik seiner Bedeutung in der Gegenwart</em>,\nAlfred Schmidt (ed.), 2 vols., Frankfurt am Main: Suhrkamp.</li>\n<li>Levitt, Cyril and Anouk Turgeon, 2009, “Sigmund\nFreud’s Intensive Reading of Ludwig Feuerbach,”\n<em>Canadian Journal of Psychoanalysis</em>, 17(1): 14–35.</li>\n<li>Löwith, Karl, 1964, <em>From Hegel to Nietzsche: The\nRevolution in Nineteenth-Century Thought</em>, David E. Green (tr.),\nNew York: Columbia University Press.</li>\n<li>Löwith, Karl, 1981, <em>Das Individuum in seiner Rolle des\nMitmenschen</em>, (1928), in <em>Mensch und Menschenwelt:\nBeiträge zur Anthropologie</em>, Klaus Stichweh (ed.), Stuttgart:\nMetzler, 9–197.</li>\n<li>Lübbe, Hermann and Hans-Martin Saß (eds.), 1975,\n<em>Atheismus in der Diskussion: Kontroversen um Ludwig\nFeuerbach</em>, Munich: Kaiser; Mainz: Grunewald.</li>\n<li>Marx, Karl, 1844, “Economic and Philosophical\nManuscripts”, in <em>Selected Writings</em>, L.H. Simon (ed.),\nIndianapolis/Cambridge: Hackett, 1994.</li>\n<li>Mandelbaum, Maurice, 1971, <em>History, Man, &amp; Reason: A Study\nin Nineteenth-Century Thought</em>, Baltimore and London: John Hopkins\nPress.</li>\n<li>Pinkard, Terry, 2002, <em>German Philosophy 1760–1860: The\nLegacy of Idealism</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2000, <em>Hegel: A Biography</em>,\nCambridge: Cambridge University Press.</li>\n<li>Rawidowicz, Simon, 1964, <em>Ludwig Feuerbachs Philosophie:\nUrsprung und Schicksal</em>, 2<sup>nd</sup> edition, Berlin: Walter de\nGruyter.</li>\n<li>Reitemeyer, Ursula, 1988, <em>Philosophie Der Leiblichkeit: Ludwig\nFeuerbachs Entwurf Einer Philosophie Der Zukunft</em>, Frankfurt am\nMain: Suhrkamp.</li>\n<li>Schmidt, Alfred, 1973, <em>Emanzipatorische Sinnlichkeit: Ludwig\nFeuerbachs anthropologischer Materialismus</em>, Munich: Carl Hanser\nVerlag.</li>\n<li>Schott, Uwe, 1973, <em>Die Jugendentwicklung Ludwig Feuerbachs bis\nzum Fakultätswechsel 1825</em>, Göttingen: Vandenhoeck und\nRuprecht.</li>\n<li>Spinoza, Baruch, [1677] 2007, <em>Theological-Political\nTreatise</em>, Jonathan Israel (ed.), Michael Silverstone and Jonathan\nIsrael (trs). Cambridge: Cambridge University Press.</li>\n<li>Thies, Erich (ed.), 1976, <em>Ludwig Feuerbach</em>, Wege der\nForschung 438, Darmstadt: Wissenschaftliche Buchgesellschaft.</li>\n<li>Toews, John E., 1980, <em>Hegelianism: The Path Toward Dialectical\nHumanism, 1805–1841</em>, Cambridge/New York: Cambridge\nUniversity Press.</li>\n<li>Tomasoni, Francesco, 2015, <em>Ludwig Feuerbach: Entstehung,\nEntwicklung und Bedeutung seines Werkes</em>, trans. Gunnhild\nSchneider, Münster/New York.</li>\n<li>Tomasoni, Francesco, 1990, <em>Ludwig Feuerbach und die\nnicht-menschliche Natur: Das Wesen der Religion: Die\nEntstehungsgeschichte des Werks, rekonstruirt auf der Grundlage\nunveröffintlichter Manuskripte</em>, Stuttgart/Bad Cannstatt:\nFrommann-Holzboog.</li>\n<li>Wartofsky, Marx W., 1977, <em>Feuerbach</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Weckwerth, Christine, 2002, <em>Ludwig Feuerbach zur\nEinführung</em>, Hamburg: Junius.</li>\n<li>Winiger, Josef, 2004, <em>Ludwig Feuerbach: Denker der\nMenschlichkeit : Biographie</em>, Berlin: Aufbau Taschenbuch\nVerlag.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "afterlife",
            "atheism and agnosticism",
            "Bauer, Bruno",
            "Bayle, Pierre",
            "death",
            "egoism",
            "Engels, Friedrich",
            "faith",
            "Hegel, Georg Wilhelm Friedrich",
            "Leibniz, Gottfried Wilhelm",
            "Marx, Karl",
            "pantheism",
            "Schelling, Friedrich Wilhelm Joseph von",
            "Schleiermacher, Friedrich Daniel Ernst",
            "Schopenhauer, Arthur",
            "Spinoza, Baruch",
            "Stirner, Max"
        ],
        "entry_link": [
            {
                "../afterlife/": "afterlife"
            },
            {
                "../atheism-agnosticism/": "atheism and agnosticism"
            },
            {
                "../bauer/": "Bauer, Bruno"
            },
            {
                "../bayle/": "Bayle, Pierre"
            },
            {
                "../death/": "death"
            },
            {
                "../egoism/": "egoism"
            },
            {
                "../faith/": "faith"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../leibniz/": "Leibniz, Gottfried Wilhelm"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../pantheism/": "pantheism"
            },
            {
                "../schelling/": "Schelling, Friedrich Wilhelm Joseph von"
            },
            {
                "../schleiermacher/": "Schleiermacher, Friedrich Daniel Ernst"
            },
            {
                "../schopenhauer/": "Schopenhauer, Arthur"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../max-stirner/": "Stirner, Max"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ludwig-feuerbach\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/ludwig-feuerbach/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=ludwig-feuerbach&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/ludwig-feuerbach/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ludwig-feuerbach": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/ludwig-feuerbach/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=ludwig-feuerbach&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/ludwig-feuerbach/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Harvey, Van, “Ludwig Andreas Feuerbach”, <em>The\nStanford Encyclopedia of Philosophy</em> (Fall 2011 edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2011/entries/ludwig-feuerbach/\" target=\"other\">https://plato.stanford.edu/archives/fall2011/entries/ludwig-feuerbach/</a>&gt;.\n [This was the previous entry on Feuerbach in the <em>Stanford\nEncyclopedia of Philosophy</em> — see the\n <a class=\"plain\" href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ludwig-feuerbach\" target=\"other\">version history</a>.]",
            "<a href=\"https://www.uni-muenster.de/EW/forschung/forschungsstellen/feuerbach/kooperationen/international.html\" target=\"other\">International Society of Feuerbach Researchers</a>",
            "<a href=\"http://www.ludwig-feuerbach.de/\" target=\"other\">Ludwig Feuerbach Society</a>\n (Germany).",
            "<a href=\"https://www.waxmann.com/waxmann-reihen/?no_cache=1&amp;tx_p2waxmann_pi2%5Breihe%5D=REI100207&amp;tx_p2waxmann_pi2%5Baction%5D=show&amp;tx_p2waxmann_pi2%5Bcontroller%5D=Reihe&amp;cHash=e4d27fdbc8d587b5f5dc50c011460e9d\" target=\"other\">Waxmann Verlag Book Series on International Feuerbach Research</a>",
            "<a href=\"http://www.marxists.org/reference/archive/feuerbach/index.htm\" target=\"other\">Ludwig Feuerbach Archive</a>",
            "<a href=\"http://people.bu.edu/wwildman/bce/feuerbach.htm\" target=\"other\">Feuerbach</a>,\n entry at the Boston Collaborative Encyclopedia of Western\nTheology."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/fall2011/entries/ludwig-feuerbach/": "https://plato.stanford.edu/archives/fall2011/entries/ludwig-feuerbach/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=ludwig-feuerbach": "version history"
            },
            {
                "https://www.uni-muenster.de/EW/forschung/forschungsstellen/feuerbach/kooperationen/international.html": "International Society of Feuerbach Researchers"
            },
            {
                "http://www.ludwig-feuerbach.de/": "Ludwig Feuerbach Society"
            },
            {
                "https://www.waxmann.com/waxmann-reihen/?no_cache=1&tx_p2waxmann_pi2%5Breihe%5D=REI100207&tx_p2waxmann_pi2%5Baction%5D=show&tx_p2waxmann_pi2%5Bcontroller%5D=Reihe&cHash=e4d27fdbc8d587b5f5dc50c011460e9d": "Waxmann Verlag Book Series on International Feuerbach Research"
            },
            {
                "http://www.marxists.org/reference/archive/feuerbach/index.htm": "Ludwig Feuerbach Archive"
            },
            {
                "http://people.bu.edu/wwildman/bce/feuerbach.htm": "Feuerbach"
            }
        ]
    }
}