{
    "url": "lukasiewicz",
    "title": "Jan Łukasiewicz",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Peter Simons\n<psimons@tcd.ie>",
        "author_links": [
            {
                "http://sites.google.com/site/petermsimons/": "Peter Simons"
            },
            {
                "mailto:psimons%40tcd%2eie": "psimons@tcd.ie"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://sites.google.com/site/petermsimons/\" target=\"other\">Peter Simons</a>\n&lt;<a href=\"mailto:psimons%40tcd%2eie\"><em>psimons<abbr title=\" at \">@</abbr>tcd<abbr title=\" dot \">.</abbr>ie</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu May 15, 2014",
        "substantive revision Thu Nov 4, 2021"
    ],
    "preamble": "\n\nJan Łukasiewicz (1878–1956) was a Polish logician and\nphilosopher who introduced mathematical logic into Poland, became the\nearliest founder of the Warsaw school of logic, and one of the\nprincipal architects and teachers of that school. His most famous\nachievement was to give the first rigorous formulation of many-valued\nlogic. He introduced many improvements in propositional logic, and\nbecame the first historian of logic to treat the subject’s\nhistory from the standpoint of modern formal logic.\n",
    "toc": [
        {
            "#Lif": "1. Life"
        },
        {
            "#InfTwa": "2. The Influence of Twardowski"
        },
        {
            "#EarWor": "3. Early Work"
        },
        {
            "#ProLog": "4. Propositional Logic"
        },
        {
            "#DisProLog": "4.1 Discoveries in Propositional Logic"
        },
        {
            "#VarProFun": "4.2 Variable Propositional Functors"
        },
        {
            "#IntLog": "4.3 Intuitionistic Logic"
        },
        {
            "#ManValLog": "5. Many-Valued Logic"
        },
        {
            "#PosThiVal": "5.1 Possibility and the Third Value"
        },
        {
            "#IndThiVal": "5.2 Indeterminism and the Third Value"
        },
        {
            "#ThaThrVal": "5.3 More than Three Values"
        },
        {
            "#AxiDef": "5.4 Axioms and Definitions"
        },
        {
            "#SecThoModSysL": "5.5 Second Thoughts on Modality: System Ł"
        },
        {
            "#HisLog": "6. History of Logic"
        },
        {
            "#StoProLog": "6.1 Stoic Propositional Logic"
        },
        {
            "#Ari": "6.2 Aristotle"
        },
        {
            "#PhiPos": "7. Philosophical Positions"
        },
        {
            "#Leg": "8. Legacy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#GenRem": "General Remarks"
        },
        {
            "#Abb": "Abbreviations"
        },
        {
            "#PriSouWorLuk": "Primary Sources: Works by Łukasiewicz"
        },
        {
            "#SelSecLit": "Selected Secondary Literature"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\nJan Łukasiewicz’s life was that of a career academic and\nscholar, seriously disrupted by the upheavals of war in the twentieth\ncentury. Born and educated in Polish Austria, he flourished in\nPoland’s Second Republic, endured the hardships of war, fled\nahead of the Red Army to Germany, and found a final haven in the\nRepublic of Ireland.\n\nJan Leopold Łukasiewicz was born on 21 December 1878 in\n Lwów[1],\n historically a Polish city, at that time the capital of Austrian\nGalicia. Łukasiewicz’s father Paweł was a captain in\nthe Austrian military, his mother Leopoldine, née Holtzer, was\ndaughter of an Austrian civil servant. Jan was their only child. The\nfamily spoke Polish. Łukasiewicz attended school (classical\nGimnazjum or grammar school, emphasizing classical languages)\nfrom 1890, completing in 1897 and beginning the study of law at the\nUniversity of Lwów. Under Austrian rule the university\npermitted instruction in Polish. In 1898 he switched to mathematics,\nstudying under Józef Puzyna, and philosophy, studying under\nKazimierz Twardowski, who had been appointed Extraordinary (Associate)\nProfessor there in 1895, and also Wojciech Dzieduszycki. In 1902\nŁukasiewicz was awarded his doctorate in philosophy under\nTwardowski with a dissertation “On induction as the inverse of\ndeduction”. Having achieved only top marks in all examinations\nbetween his school leaving examinations and his dissertation, he was\nawarded the doctorate sub auspiciis Imperatoris, a rare\ndistinction, and he received a diamond ring from Emperor Franz\nJosef.\n\nFrom 1902 he was employed as a private teacher and as a clerk in the\nuniversity library. In 1904 he obtained a scholarship from the\nGalician autonomous government and went to study in Berlin then in\nLouvain. In 1906 he obtained his Habilitation with a piece on\n“Analysis and construction of the concept of cause”. As a\nPrivatdozent in Philosophy, he was able to give lectures at\nthe university, becoming the first of Twardowski’s students to\njoin him in doing so. His first course of lectures, delivered in\nAutumn 1906, was on the algebra of logic, as formulated by Couturat.\nIn 1908 and 1909 he obtained a stipendium which enabled him to visit\nGraz, where he made acquaintance with Alexius Meinong and his school.\nIn 1911 he was appointed Extraordinary Professor, and continued to\nteach in Lwów until the outbreak of war in 1914. During this\ntime his students included Kazimierz Ajdukiewicz and Tadeusz\nKotarbiński, who would later become famous philosophers in their\nown right. He also in 1912 got to know Stanisław Leśniewski,\nwho had however come to Lwów after studying abroad and cannot\nbe counted as his pupil.\n\nIn 1915 the fortunes of war put Germany in control of Warsaw, and they\ndecided to re-open the university, which had not been allowed to\nfunction as a Polish-speaking university under Russian rule.\nŁukasiewicz became professor of philosophy there. In 1916 he was\ndean of the Faculty of Arts, and in 1917 prorector of the university.\nIn 1918 he left the university, being appointed Head of the Department\nof Higher Schools in the new Polish Ministry of Education, and after\nPoland obtained full independence he became Minister of Education in\nPaderewski’s Cabinet, serving from January to December 1919.\nFrom 1920 until 1939 he was, as was Leśniewski, a Professor in\nthe Faculty of Natural Sciences at the University of Warsaw. In\n1922/23 and again in 1931/32 he served as rector of the university. In\n1929 he married Regina Barwińska.\n\nThe interwar period was most fruitful for Łukasiewicz. He was a\nleading figure, with Leśniewski and Tarski, in what became known\nas the Warsaw School of Logic. He made a friend of the only German\nprofessor of mathematical logic, Heinrich Scholz, and was awarded an\nhonorary doctorate by the latter’s University of Münster in\n1938. Other honors awarded him in this period were Grand Commander of\nthe Order of Polonia Restituta (1923), Grand Commander of the\nHungarian Order of Merit, a monetary award from the City of Warsaw\n(1935) and memberships of the Polish Academy of Arts and Sciences in\nKraków, and the Polish Scientific Societies in Lwów and\nWarsaw.\n\nStudents whom he supervised through their doctoral dissertations were:\nMordechaj Wajsberg, Zygmunt Kobrzyński, Stanisław\nJaśkowski, Bolesław Sobociński, and Jerzy\nSłupecki.\n\nAt the outbreak of war in September 1939 the Łukasiewiczes’\nhome was bombed by the Luftwaffe: all his books, papers and\ncorrespondence were destroyed, except for one volume of his bound\noffprints. The Łukasiewiczes lived in provisional accommodation\nfor academics. The German occupiers closed the university and\nŁukasiewicz found employment for a meagre salary in the Warsaw\ncity archives. Additional financial support came from Scholz.\nŁukasiewicz taught in the underground university. From late 1943,\nfearing the imminent arrival and occupation of Poland by the Red Army,\nand under suspicion by some colleagues of being pro-German and\nanti-Jewish, Łukasiewicz expressed the wish to Scholz that he and\nhis wife should leave Poland. As a first step to their going to\nSwitzerland, Scholz managed to obtain permission for the\nŁukasiewiczes to travel to Münster. They left Warsaw on 17\nJuly 1944, just two weeks before the outbreak of the Warsaw Rising.\nFollowing the 20 July 1944 bomb plot against Hitler there was no hope\nof them obtaining permission to leave for Switzerland. They stayed in\nMünster, enduring allied bombing, until January 1945, when they\nwere offered accommodation by Jürgen von Kempski at his farm in\nHembsen (Kreis Höxter, Westphalia), where they were liberated by\nAmerican troops on 4 April.\n\nFrom the summer of 1945 Łukasiewicz taught logic at a Polish\nsecondary school set up at a former Polish POW camp in Dössel. In\nOctober 1945 they were allowed to travel to Brussels. There\nŁukasiewicz again taught logic at a provisional Polish Scientific\nInstitute. Being unwilling to return to a Poland under communist\ncontrol, Łukasiewicz looked for a post elsewhere. In February\n1946 he received an offer to go to Ireland. On 4 March 1946 the\nŁukasiewiczes arrived in Dublin, where they were received by the\nForeign Secretary and the Taoiseach Eamon de Valera. In autumn 1946\nŁukasiewicz was appointed Professor of Mathematical Logic at the\nRoyal Irish Academy (RIA), where he gave lectures at first once and\nthen twice a week.\n\nIn his final years in Ireland Łukasiewicz resumed contacts with\ncolleagues abroad, particularly Scholz, with whom he was in constant\ncorrespondence. He attended conferences in Britain, France and\nBelgium, sent papers to Poland before being expelled (with 15 other\nexiled Poles) from the Polish Academy in Kraków, lectured on\nmathematical logic at Queen’s University Belfast and on\nAristotle’s syllogistic at University College Dublin. His health\ndeteriorated and he had several heart attacks: by 1953 he was no\nlonger able to lecture at the Academy. In 1955 he received an honorary\ndoctorate from Trinity College Dublin. On 13 February 1956 after an\noperation to remove gallstones he suffered a third major coronary\nthrombosis and died in hospital. He was buried in Mount Jerome\nCemetery in Dublin, “far from dear Lwów and\nPoland”, as his gravestone reads. Regina deposited most of his\nscientific papers and correspondence with the RIA. In 1963 the Academy\ntransferred their holdings to the library of the University of\nManchester, where they remain, uncatalogued. The choice of Manchester\nwas due to the presence there as a lecturer of Czesław Lejewski,\nwho had studied with Łukasiewicz in Warsaw and twice been\nexamined by the latter for doctoral theses, once in 1939, when war\nintervened, a second time in London in 1954. Lejewski had seen the\nsecond edition of Łukasiewicz’s book on Aristotle’s\nsyllogistic through the press: it appeared posthumously in 1957. In\n2022 on the initiative of the Polish government his remains were\nrepatriated and reinterred with military honors in Warsaw’s\nPowązki Cemetery.\n2. The Influence of Twardowski\n\nŁukasiewicz was one of Twardowski’s first students in\nLwów, and was influenced in his attitudes and methods by his\nteacher. Twardowski was born and studied in Vienna, where he became a\ndisciple of Franz Brentano, and was imbued with the latter’s\npassionate advocacy of philosophy as a rigorous discipline, to be\ninvestigated with the same care and attention to detail as any\nempirical science, and to be communicated with utmost transparency. In\n1895 Twardowski was appointed Professor Extraordinary in Lwów.\nHe found Polish philosophical life dormant and third-rate, and set\nabout vitalising the subject and building its Polish institutions, at\nthe cost of his own academic output. Like Brentano, he believed that a\nsound descriptive psychology was methodologically basic for\nphilosophy, and like Brentano he advocated modest reforms in formal\nlogic. Łukasiewicz, under the influence of Husserl, Russell and\nFrege, rejected any foundational role for psychology, and inspired in\nparticular by the latter two, he carried the reform of logic far\nbeyond anything Twardowski envisaged. He read Russell’s The\nPrinciples of Mathematics in 1904 and it influenced him\nconsiderably. The general attitude that philosophy could and should\naspire to be scientifically exact was one that stayed with\nŁukasiewicz, though his estimation of the state of the subject\ntended to become more pessimistic than optimistic, and he advocated\nfundamentally reforming philosophy along logical lines.\n\nAnother respect in which Łukasiewicz continued the tradition of\nthe Brentano School was in his respect for the history of philosophy,\nparticularly that of Aristotle and the British empiricists. (He and\nTwardowski translated Hume’s first Enquiry into\nPolish.) Twardowski, who knew Bolzano’s work well, pointed out\nsimilarities between concepts in Bolzano’s and\nŁukasiewicz’s theories of probability. The respect for\nhistory also lay behind Łukasiewicz’s groundbreaking\nstudies in the history of logic, notably his accounts of Stoic\npropositional logic and Aristotle’s syllogistic.\n\nŁukasiewicz emulated and indeed surpassed Twardowski in his\nattention to clarity of expression. Qualified experts agree that\nŁukasiewicz’s scientific prose, in whichever of the three\nlanguages in which he wrote, is of unmatched clarity and beauty.\n3. Early Work\n\nIn the years before World War I, Łukasiewicz worked predominantly\non matters to do with the methodology of science. His doctorate,\npublished in 1903 as “On induction as the inverse of\ndeduction”, investigated the relationship between the two forms\nof reasoning, in the light of work by Jevons, Sigwart and Erdmann.\nInductive reasoning, proceeding from singular empirical statements,\nattempts on his early view to reach a general conclusion to which a\ncertain probability can be ascribed. But he soon shifted to the view\nthat it is impossible to ascribe a determinate probability to a\ngeneral statement on the basis of induction. Rather the method of the\nempirical sciences is to creatively hazard the thought that a certain\ngeneralization is true, deduce singular conclusions from this, and\nthen see whether these are true. If one conclusion is not, then the\ngeneral statement is refuted. This, an early formulation of the\nhypothetico-deductive method of science, anticipates the ideas of\nPopper by more than two decades, though expressed less forcefully.\nŁukasiewicz also anticipated Popper by stressing what he called\n“creative elements in science”, against the idea that the\nscientist’s task is to reproduce or replicate the facts.\n\nIn 1906 Łukasiewicz published a substantial piece,\n“Analysis and construction of the concept of cause”, which\ngained him his Habilitation in Lwów. It is significant\nboth for its carefully argued method and for presaging themes that\nwere to occupy him later. Taking concepts platonistically as abstract\nobjects, Łukasiewicz rejects psychological, subjective and\nregularity accounts of causality and accepts that cause and effect are\nlinked by necessity, which he identifies with logical necessity:\n“a causal relation is a necessary relation, and the relative\nfeature […] due to which we call some object a cause, is the\nfeature ‘entailing or bringing-about with\nnecessity’.” The piece’s motto is Arceo\npsychologiam, “Reject psychology”, marking a clear\nbreak with Twardowski and Brentano, while the logical analysis is\naimed at extracting the logical features of the notion of cause. It is\na clear example of what later came to be called ‘analytic\nphilosophy’, and shows Łukasiewicz bringing logical\nconcepts to bear on scientifically central concepts, as he was later\nto do with his logical analysis of determinism.\n\nAn interest in probability lay behind one of Łukasiewicz’s\ntwo monographs published before the war, namely Logical\nFoundations of Probability Theory, which was written and\npublished not in Polish but in German. In 1908 and 1909\nŁukasiewicz visited Graz where both Alexius Meinong and Ernst\nMally were also working on probability theory at this time, so it is\nlikely that the book was written in German because their language of\ndiscussion was German, and also in order to ensure a wider audience.\nŁukasiewicz’s theory makes constructive use of ideas\nplucked from elsewhere: from Frege he took the idea of a truth-value,\nfrom Whitehead and Russell the idea of an indefinite proposition, and\nfrom Bolzano the idea of the ratio of true values to all values for a\nproposition. Consider the classical urn example, where an urn contains\nm black balls and n white balls. Let the indefinite\nproposition ‘\\(x\\) is a black ball in this urn’ be such\nthat the variable ‘\\(x\\)’ may take as value any expression\nnaming a ball in the urn: the variable is then said to range\nover the individual balls, and different expressions naming the\nsame ball to have the same value. (Note that Łukasiewicz indeed\nuses the terminology, later associated with Quine, of a variable\ntaking values, here expressions, and ranging over objects designated\nby said expressions.) An indefinite proposition is said to be true if\nit yields a true proposition (Łukasiewicz says\n‘judgement’ for a definite proposition) for all values of\nits variables, it is false if it yields a false judgement for all\nvalues, and is neither true nor false if it yields true judgements for\nsome values and false judgements for others. The ratio true values/all\nvalues is then called by Łukasiewicz the truth-value of\nthe indefinite proposition. For true indefinites it is 1, for false\nindefinites it is 0, and for others it is a rational number between 0\nand 1 (rational because only finite domains are considered). In our\nurn case the truth-value of the indefinite proposition\n‘x is a black ball in this urn’ is\n\\(\\frac{m}{m+n}\\).\n\nOn this basis Łukasiewicz develops a calculus of truth-values in\nwhich he can deal with logically complex propositions, conditional\nprobability, probabilistic independence, and derive Bayes’\nTheorem. The calculus of truth-values is used as a logical\ntheory of probability, assisting us in our dealings with definite\nreality: Łukasiewicz denies that there can be a theory either of\nobjective or of subjective probability as such. Two ideas from this\nshort but remarkable work are worth emphasizing because they resonate\nwith later ones of Łukasiewicz. Firstly, there is the idea of a\nproposition (in this case an indefinite proposition) being neither\ntrue nor false; secondly, and connected with this, of such a\nproposition having a numerical truth-value properly between 0 (false)\nand 1 (true). Łukasiewicz’s theory deserves to be better\nknown: it continues and extends earlier ideas of Bolzano, his\nprobability corresponding to the latter’s degree of validity of\na proposition (with respect to variable components). Its chief\ndrawback is that it is formulated for finite domains only.\n\nOf all the works Łukasiewicz published before World War I, one\nmost clearly anticipated his later concerns. This was the 1910\nmonograph On the Principle of Contradiction in Aristotle. It\nmarked a crucial turning point in the development of the\nLwów-Warsaw school. For Łukasiewicz it represented the\nfirst sustained questioning of the assumptions of traditional\nAristotelian logic.\n\nŁukasiewicz introduces the project of his monograph, a critical\ninvestigation of the legitimacy of the Principle of Contradiction (PC)\nas variously formulated by Aristotle, in the context of its critique\nby Hegel and the opportunity to re-examine the PC in the light of the\ndevelopment of mathematical logic from Boole to Russell.\nŁukasiewicz’s sources for the post-Hegelian discussion of\nthe ‘logical question’ are Ueberweg, Trendelenburg and\nSigwart. A more local background was probably Twardowski’s\naccount of the absolute and timeless nature of truth.\n\nŁukasiewicz distinguishes three different, non-equivalent\nversions of PC in Aristotle: an ontological version, a logical\nversion, and a psychological version, as follows:\n\nOntological (OPC): No object may at the same time possess and\nnot possess the same property.\n\nLogical (LPC): Contradictory statements are not\nsimultaneously true.\n\nPsychological (PPC): No one can simultaneously believe\ncontradictory things.\n\nŁukasiewicz criticises Aristotle for on the one hand claiming PC\ncannot be proved, and on the other hand attempting an indirect or\npragmatic “proof”. In partial agreement with the tradition\naccording to which PC is not the cornerstone or basic principle of\nlogic, Łukasiewicz claims that its status is less secure than\nsome other logical propositions, and that its function is principally\nto serve as a pragmatic norm. Nevertheless, in an Appendix to the book\nhe gives a formal derivation of one version of PC from other\nassumptions. This shows that PC is as it were just one logical theorem\namong others, a statement that would raise few eyebrows today but was\nfairly radical in its day. Among the assumptions used in the\nderivation is a version of the Principle of Bivalence, that every\nproposition is either true or false and none is both, so the\nderivation of PC is not after all such a surprise.\n\nŁukasiewicz described himself later as attempting in the\nmonograph to devise a “non-Aristotelian logic” but admits\nthat he did not succeed, principally because at this stage he was not\nprepared to reject the principle of bivalence. It may well be\nMeinong’s influence at work when Łukasiewicz comes to give\nhis natural-language renderings of the symbolism of Couturat’s\nalgebra of logic in the Appendix. There is little or no trace of the\npropositional logic that Łukasiewicz was to make very much his\nown: the renderings are clumsily object-theoretic: the constant\n‘0’ for example, which might be naturally construed as a\nconstant false proposition (and is so in later Łukasiewicz) is\nrendered as “the object that does not exist”. This is one\nreason why Łukasiewicz’s formal work in the Appendix to the\n1910 work appears relatively archaic. While the variable letters like\n\\(a, b\\) etc. “signify affirmative statements” and their\nnegations \\(a', b'\\) etc. “signify negative statements”,\nand in practice do work like propositional variables and their\nnegations in modern propositional logic, Łukasiewicz’s\nrenderings of them are curiously hybrid: ‘\\(a\\)’ is\nrendered as ‘\\(X\\) contains \\(a\\)’ and\n‘\\(a'\\)’ as ‘\\(X\\) contains no \\(a\\)’, while\n‘1’ signifies ‘\\(X\\) is an object’ and\n‘0’ signifies ‘\\(X\\) is not an object’. This\nis all very confused, and by no means a classical sentential logic in\nintent, even if it works like one in practice.\n\nWhile not in itself a success, the book shows Łukasiewicz on the\nthreshold of his later logical breakthroughs. It was read in 1911 by\nthe young Leśniewski, who sought against Łukasiewicz to\nprove OPC, and who first introduced himself in 1912 on\nŁukasiewicz’s doorstep with the words, “I am\nLeśniewski, and I have come to show you the proofs of an article\nI have written against you.” The book also contains a brief\ndiscussion of Russell’s Paradox, and it was reading this that\ninspired Leśniewski to become a logician, intent on providing a\nparadox-free logical foundation for mathematics. The book promoted\nfurther discussion in Lwów: Kotarbiński wrote in defense\nof Aristotle’s idea, discussed by Łukasiewicz, that a\nstatement about future contingent events may lack a truth-value before\nthe event and only gain one afterwards, while Leśniewski wrote in\nopposition to this and brought Kotarbiński round to his own view\n(which agreed with earlier views of Twardowski and later ones of\nTarski) that truth is timeless, or as Leśniewski expressed it,\nboth eternal and sempiternal. Łukasiewicz was soon to side with\nthe earlier Kotarbiński, and in so doing to make his most famous\ndiscovery, that of many-valued logic.\n4. Propositional Logic\n4.1 Discoveries in Propositional Logic\n\nŁukasiewicz came across propositional logic, which he originally\nfollowed Whitehead and Russell in calling ‘theory of\ndeduction’, in their work and also in that of Frege. In 1921\nŁukasiewicz published a ground-clearing article,\n“Two-Valued Logic”, in which he brought together results\nin the algebra of logic governing the two truth-values true and false,\nwhich, like Frege, Łukasiewicz construed as what sentences or\npropositions denoted, but for which, unlike Frege, he\nintroduced constant propositional symbols ‘1’ and\n‘0’. He intended it as the first part of a monograph on\nthree-valued logic, which however was never completed, probably\nbecause Łukasiewicz became dissatisfied with the rather hybrid\napproach which was already being outdated by his rapid development.\nThe article is notable for several innovations. Using a symbolism\nderived from those of Couturat and Peirce, it introduces the idea of\naxiomatic rejection alongside that of axiomatic assertion, which\nlatter was of course familiar from Frege, Whitehead and Russell. The\nconstants ‘0’ and ‘1’ also occur in asserted\nand rejected formulas, in effect setting up an object-language version\nof truth-tables. To show this we use Łukasiewicz’s later\nparenthesis-free notation (see the supplementary document\n (Łukasiewicz’s Parenthesis-Free or Polish Notation)\n and his symbols ‘\\(\\vdash\\)’ for assertion and\n‘\\(\\dashv\\)’ for rejection, to be read respectively as\n“I assert” and “I reject”. The first\nprinciples of logic are simply \\({\\vdash}1\\) and \\({\\dashv}0\\) but to\nindicate the tabulation for implication the following principles must\nbe adhered to: \\({\\vdash}C00, {\\vdash}C01, {\\dashv}C10, {\\vdash}C11\\).\nWhen Łukasiewicz employed propositional variables, he quantified\nthem in the manner of Peirce, using ‘\\(\\Pi\\)’ for the\nuniversal and ‘\\(\\Sigma\\)’ for the particular\nquantifier.\n\nŁukasiewicz and his students made the study of propositional\ncalculi very much their own: the results obtained between 1920 and\n1930 were published in a 1930 joint paper of Łukasiewicz and\nTarski, “Untersuchungen über den\nAussagenkalkül”. Work proceeded on both classical\n(bivalent) and many-valued calculi. The clearest and most complete\ndemonstration of how Łukasiewicz in his maturity treated\nclassical propositional calculus comes in his 1929 student textbook,\nbased on lecture notes, Elements of Mathematical Logic. The\nsystem, following Frege, is based on implication \\((C)\\) and negation\n\\((N)\\) alone, with the elegant axiom set \n\\[ \\begin{align}\n&CCpqCCqrCpr \\\\\n &CCNppp \\\\\n &CpCNpq \n\\end{align} \\]\n\n\nand three rules of inference: modus ponens, a rule of uniform\nsubstitution of formulas for propositional variables, and a rule of\ndefinitional replacement. On this basis, and using an extremely\ncompressed linear notation for proofs which is at the opposite extreme\nof Frege’s space-occupying proofs, Łukasiewicz proves\naround 140 theorems in a mere 19 pages.\n\nŁukasiewicz, aided and abetted by students and colleagues, not\njust Tarski but also Adolf Lindenbaum, Jerzy Słupecki,\nBolesław Sobociński, Mordechaj Wajsberg and others,\ninvestigated not only the full (functionally complete) propositional\ncalculus, with different sets of connectives as basic, including the\nSheffer functor D, but also partial calculi, in particular\nthe pure implicational calculus (based on C alone) and the\npure equivalential calculus (based on E alone). They strove\nto find axioms sets satisfying a number of normative criteria: axioms\nshould be as few as possible, as short as possible, independent, with\nas few primitives as possible. Undoubtedly there was a competitive\nelement to the search for ever better axiom systems, in particular in\nthe attempt to find single axioms for various systems, and the\nexercise has been smiled upon or even belittled as a mere\n“sport”, but the Polish preoccupation with improving axiom\nsystems was a search for logical perfection, an illustration of what\nJan Woleński has termed “logic for logic’s\nsake”. At one time it was thought, not without some\njustification, that only Poles could compete. When Tarski once\ncongratulated the American logician Emil Post on being the only\nnon-Pole to make fundamental contributions to propositional logic,\nPost replied that he had been born in Augustów and his mother\ncame from Białystok. Later, Łukasiewicz was to find in the\nIrish mathematician Carew Meredith a worthy non-Pole who could outdo\neven the Poles in the brevity of his axioms (see Meredith 1953).\n\nŁukasiewicz used many-valued matrices to establish the\nindependence of logical axioms in systems of Frege, Russell and\nothers. He proved the completeness of full, implicational and\nequivalential calculi, and proved that the equivalential calculus\ncould be based on the single axiom \\(EEpqErqEpr\\), with substitution\nand detachment for equivalence, and showed further that no shorter\naxiom could be the sole axiom of the system. Tarski showed in 1925\nthat the pure implicational calculus could be based on a single axiom,\nbut a series of improvements by Wajsberg and Łukasiewicz led to\nthe latter’s discovering in 1936 that the formula\n\\(CCCpqrCCrpCsp\\) could serve as single axiom and that no shorter\naxiom would suffice, though the publication of this result had to wait\nuntil 1948.\n4.2 Variable Propositional Functors\n\nStandard propositional calculus employs neither quantifiers nor\nvariable functors, that is, functors of one or more places taking\npropositional arguments, but which unlike such constant functors as\n\\(N\\) or \\(C\\) do not have a fixed meaning. Such variable functors act\nlike the predicates of first-order predicate logic except for taking\npropositional rather than nominal arguments. They thus add to the\nexpressive power of the logic. Leśniewski added both quantifiers\nand bound propositional and functorial variables to propositional\nlogic, and called the resulting theory protothetic. Leaving\nprefixed universal quantifiers tacit, it is a thesis of protothetic\nthat \n\\[ \\begin{align}\n& CEpqC\\delta p \\delta q \n\\end{align} \\]\n\n\nwhere \\(\\delta\\) is a one-place propositional functor, out of the same\nsyntactic stable as negation or necessity. This thesis is an\nexpression of the law of extensionality for propositional expressions.\nIf \\(p\\) and \\(q\\) are replaced by complex expressions \\(x\\) and \\(y\\)\nthe thesis can be used to enable definitions to be given in the\nimplicational form \\(C\\delta x\\delta y\\).\n\nIf \\(\\delta\\) is replaced by the first part of a complex expression,\ne.g., \\(Cq\\) or \\(CCq0\\), then simply adjoining a variable such as\n\\(p\\) to give \\(Cqp\\), \\(CCq0p\\), is straightforward. But if the\n“gap” where the variable is to go is not at the end, such\nas \\(Cpq\\), or if the variable is to be inserted more than once, as\n\\(CCp0p\\), this simple replacement procedure will not work.\nLeśniewski got around the problem by introducing auxiliary\ndefinitions which maneuvered the required variable slot into the right\nposition with only one occurrence. But Łukasiewicz found this\nprocedure unintuitive and wasteful. His preference—which in fact\nechoes the practice of Frege—was to allow any context in which a\nsingle propositional variable is free to serve as a substituend for a\nfunctor like \\(\\delta\\), and mark the places into which the argument\nof \\(\\delta\\) was to be slotted with an apostrophe, so in our examples\n\\(C \\apos q\\), \\(CC\\apos 0 \\apos\\). This more liberal\n“substitution with apostrophe” allows definitions to be\ngiven a satisfyingly simple implicational form. For example, in\npropositional calculus based on implication and the propositional\nconstant 0, negation can be defined simply by \\(C\\delta Np\\delta\nCp0\\). The use of variable functors with liberal substitution enables\na number of principles of propositional logic to be given startlingly\ncompressed and elegant formulations, for example the principle of\nbivalence in the form \n\\[ \\begin{align}\n& C\\delta 0C\\delta C00 \\delta p \n\\end{align} \\]\n\n\nwhich can be read as “if something is true of a false\nproposition then if it true of a true proposition, it is true of any\nproposition” (C00 is a true proposition). The supreme\nachievements of compression using variable functors were made by\nMeredith, who showed (as quoted by Łukasiewicz, referring to an\napparently unpublished paper) that the whole of classical\npropositional logic with variable functors can be based on the single\naxiom \n\\[ \\begin{align}\n& C\\delta pC\\delta Np\\delta q. \n\\end{align} \\]\n\n\nMore astonishingly, Meredith (1951) showed that the whole of bivalent\npropositional calculus with quantifiers and variable functors can be\ndeduced, using substitution, detachment and quantifier rules, from the\nsingle axiomatic formula \n\\[ \\begin{align}\n& C\\delta \\delta 0\\delta p. \n\\end{align} \\]\n\n\nŁukasiewicz admiringly described this feat as “a\nmasterpiece of the art of deduction”.\n4.3 Intuitionistic Logic\n\nŁukasiewicz was interested in intuitionistic logic, not least\nbecause, like his own, it rejected the law of excluded middle. In a\nlate article published in 1952, he gave an elegant axiomatization with\nten axioms, using the letters \\(F\\), \\(T\\) and \\(O\\) for the\nintuitionist connectives of implication, conjunction and disjunction\nrespectively, in order to obviate clashes caused by\n“competition” for the connectives, though interestingly he\nkept the usual negation for both systems. He then showed how to define\nclassical implication as \\(NTpNq\\), formulated this definition using a\nvariable functor as the implication \n\\[ \\begin{align}\n& F\\delta NTpNq\\delta Cpq \n\\end{align} \\]\n\n\nand proved that in this version classical bivalent logic based on\n\\(C\\) and \\(N\\) is contained in intuitionistic logic, provided that\ndetachment is confined to \\(C\\)-\\(N\\) formulas only. Classical\nconjunction and disjunction can be defined in the usual way as\n\\(NCpNq\\) and \\(CNpq\\) respectively. By differentiating intuitionistic\nfrom classical connectives his perspective reverses the usual one that\nintuitionistic propositional calculus is poorer in theorems than\nclassical: in Łukasiewicz’s formulation it is the other way\naround.\n5. Many-Valued Logic\n5.1 Possibility and the Third Value\n\nŁukasiewicz’s most celebrated achievement was his\ndevelopment of many-valued logics. This revolutionary development came\nin the context of discussing modality, in particular possibility. To\nmodern logicians, used to the idea of modal logic being grafted onto\nclassical bivalent logic, this may seem odd. But let us consider how\nŁukasiewicz arrived at the idea. If \\(p\\) be any proposition, let\n\\(Lp\\) notate that it is necessary that \\(p\\) and \\(Mp\\) that it is\npossible that \\(p\\). The two modal operators are connected by the\nusual equivalence \\(ENLpMNp\\). Everyone accepts the implications\n\\(CLpp\\) and \\(CpMp\\). Łukasiewicz supposes one accepts also the\nconverse implications \\(CpLp\\) and \\(CMpp\\), as one would from a\ndeterministic point of view. That gives the equivalences \\(EpLp\\) and\n\\(EpMp\\), which effectively collapse modal distinctions. Now add in\nthe idea that possibility is two-sided: if something is possible, then\nso is its negation: \\(EMpMNp\\). From these it immediately follows that\n\\(EpNp\\), and this is paradoxical in two-valued logic. The way out, as\nŁukasiewicz portrays it, is to uncollapse the modal distinctions,\nnot by rejecting any of the principles above but by finding a case\nwhere \\(EpNp\\) is true. We entertain the idea of the\nproposition \\(Mp\\) being true when \\(p\\) is neither true nor false. In\naddition to the truth-values true (1) and\nfalse (0), allow then a third value,\npossible, which we write\n‘\\(\\tfrac{1}{2}\\)’, so that when \\(p\\) is neither true nor\nfalse, it is possible, and so is its negation \\(Np\\), for if \\(Np\\)\nwere true, \\(p\\) would be false, and vice versa. If \\(Epq\\) is true\nwhen \\(p\\) and \\(q\\) have the same truth-value, then when \\(p\\) is\npossible (we write ‘\\(\\tval{p}\\)’ for the truth-value of\n\\(p\\), so \\(\\tval{p}=\\tfrac{1}{2}\\)) we have \n\\[ \\begin{align}\n& \\tval{EpNp} = \\tval{E \\tfrac{1}{2} \\tfrac{1}{2}} = 1 \n\\end{align} \\]\n\n\nThis is, with minor changes, the way in which Łukasiewicz\nintroduces the third value in his first published paper on the\nsubject, which bears the title “On the Concept of\nPossibility”. This short paper is based on a talk given on 5\nJune 1920 in Lwów. Two weeks later a second talk in the same\nplace was more transparently titled “On Three-Valued\nLogic”. In this, Łukasiewicz sets out principles governing\nimplication and equivalence involving the third value. These in effect\ndetermine the\n truth-tables[2]\n for these connectives:\n\n\n\n\n\n\n\n\\(C\\)\n1\n½\n0 \n\n1\n1\n½\n0 \n\n½\n1\n1\n½ \n\n0\n1\n1\n1  \n \n   \n\n\n\n\n\\(E\\)\n1\n½\n0 \n\n1\n1\n½\n0 \n\n½\n½\n1\n½ \n\n0\n0\n½\n1  \n   \n\n\nTogether with the assumed definitions of negation, conjunction and\ndisjunction as, respectively \n\\[ \\begin{align}\nNp & = Cp0 \\\\\n Apq & = CCpqq \\\\\n Kpq & = NANpNq \n\\end{align} \\]\n\n\nthis yields truth-tables for these connectives as\n\n\n\n\n\n\n\n\\(N\\)\n  \n\n1\n0 \n\n½\n½ \n\n0\n1  \n \n   \n\n\n\n\n\\(A\\)\n1\n½\n0 \n\n1\n1\n1\n1 \n\n½\n1\n½\n½ \n\n0\n1\n½\n0  \n \n   \n\n\n\n\n\\(K\\)\n1\n½\n0 \n\n1\n1\n½\n0 \n\n½\n½\n½\n0 \n\n0\n0\n0\n0  \n   \n\n\nŁukasiewicz proudly declares “that three-valued logic has,\nabove all, theoretical significance as the first attempt to create a\nnon-Aristotelian logic” (PL, 18; SW, 88). What\nits practical significance is, he thinks awaits to be seen, and for\nthis we need “to compare with experience the consequences of the\nindeterministic view which is the metaphysical basis of the new\nlogic” (ibid.).\n5.2 Indeterminism and the Third Value\n\nThis final remark reveals the motivation of Łukasiewicz’s\ndrive to replace the old bivalent logic with the new trivalent one. It\nwas in order to defend indeterminism and freedom. In fact the idea had\ncome to fruition some three years earlier. Having been appointed to an\nadministrative position in the Ministry of Education in 1918, and\nbeing about to leave academic life for an indefinite period,\nŁukasiewicz delivered a “farewell lecture” to the\nUniversity of Warsaw on 17 March, in which he announced dramatically,\n“I have declared a spiritual war upon all coercion that\nrestricts man’s free creative activity.” The logical form\nof this coercion, in Łukasiewicz’s view, was Aristotelian\nlogic, which restricted propositions to true or false. His own weapon\nin this war was three-valued logic. Recalling his 1910 monograph, he\nnotes that:\n\nEven then I strove to construct non-Aristotelian logic, but in vain.\nNow I believe I have succeeded in this. My path was indicated to me by\nantinomies, which prove that there is a gap in Aristotle’s\nlogic. Filling that gap led me to a transformation of the traditional\nprinciples of logic. Examination of that issue was the subject-matter\nof my last lectures. I have proved that in addition to true and false\npropositions there are possible propositions, to which\nobjective possibility corresponds as a third in addition to being and\nnon-being. This gave rise to a system of three-valued logic, which I\nworked out in detail last summer. That system is as coherent and\nself-consistent as Aristotle’s logic, and is much richer in laws\nand formulae. That new logic, by introducing the concept of objective\npossibility, destroys the former concept of science, based on\nnecessity. Possible phenomena have no causes, although they themselves\ncan be the beginning of a causal sequence. An act of a creative\nindividual can be free and at the same time affect the course of the\nworld. (SW, 86)\n\n\nBecause Łukasiewicz was involved in government until the end of\n1919, it took until 1920 for his discoveries of 1917 to be revealed to\na wider academic public. Łukasiewicz returned to the subject of\ndeterminism for his inaugural lecture as Rector of the University of\nWarsaw on 16 October 1922. That lecture, delivered without notes but\nlater written down, was reworked, though not in essentials, up until\n1946. It was published only posthumously in 1961 as “On\nDeterminism”. Distinguishing logical from causal determinism,\nŁukasiewicz claims that if a prediction of a future contingent\nevent such as an action is true at the time the prediction is made,\nthe event must occur, so the only way to rescue the agent’s\nfreedom of action is to deny that the prediction is true, and assign\nit instead the third truth-value of possibility.\n\nHere is not the place to go into the problems with\nŁukasiewicz’s argumentation. Suffice it to say that the\nprinciple EpLp need not be accepted by determinists, and that\nother logicians who have considered adding a third value to logic,\nsuch as (unbeknown to Łukasiewicz) William of Ockham, concluded\nthat there was no reason to reject bivalence while upholding freedom.\nThis is without even considering compatibilist views.\n5.3 More than Three Values\n\nOnce the spell of bivalence was broken, a natural next step was to\nconsider logic with more than three values. In 1922 Łukasiewicz\nindicated how to give truth-tables for the standard connectives in\nsystems with finitely or infinitely many truth values, according to\nthe following principles, where the truth-values are numbers in the\ninterval [0,1]: \n\\[ \\begin{aligned}\n\\tval{Cpq} & = \\begin{cases}\n1, & \\text{if } \\tval{p} \\le \\tval{q} \\\\\n (1 - \\tval{p}) + \\tval{q}, & \\text{if } \\tval{p} \\gt \\tval{q} \n\\end{cases} \\\\\n \\tval{Np} & = 1 - \\tval{p} \n\\end{aligned} \\]\n\n\nIn proposing logics with infinitely many values, Łukasiewicz was\nthus the inventor of what was much later (43 years later, to be exact)\nto be called ‘fuzzy logic’. Commenting on these systems in\n1930, Łukasiewicz wrote\n\nit was clear to me from the outset that among all the many-valued\nsystems only two can claim any philosophical significance: the\nthree-valued one and the infinite-valued ones. For if values other\nthan “0” and “1” are interpreted as “the\npossible”, only two cases can reasonably be distinguished:\neither one assumes that there are no variations in degrees of the\npossible and consequently arrives at the three-valued system; or one\nassumes the opposite, in which case it would be most natural to\nsuppose, as in the theory of probabilities, that there are infinitely\nmany degrees of possibility, which leads to the infinite-valued\npropositional calculus. I believe that the latter system is preferable\nto all others. Unfortunately this system has not yet been investigated\nsufficiently; in particular the relations of the infinite-valued\nsystem to the calculus of probabilities awaits further inquiry.\n(SW, 173)\n\n\nWe will discuss this philosophical attitude below.\n5.4 Axioms and Definitions\n\nOnce the truth-tabular or matrix approach to many-valued logics was\nestablished, it was natural to consider their axiomatization.\nŁukasiewicz’s students assisted in this. In 1931 Wajsberg\naxiomatized the three-valued system Ł\\(_3\\)\nby the theses \n\\[ \\begin{align}\n& CpCqp \\\\\n & CCpqCCqrCpr \\\\\n & CCNpNqCqp \\\\\n & CCCpNppp \n\\end{align} \\]\n\n\nWajsberg also proved a conjecture of Łukasiewicz that the\ndenumerably infinite-valued system Ł\\(_{\\aleph_0}\\)\ncan be axiomatized by\n\n\\[ \\begin{align}\n& CpCqp \\\\\n & CCpqCCqrCpr \\\\\n & CCCpqqCCqpp \\\\\n & CCCpqCqpCqp \\\\\n & CCNpNqCqp \n\\end{align} \\]\n\n\nNone of these systems is functionally complete: there are connectives\nnot definable on the basis of C and N alone. Among\nthose that are definable is possibility M: as early as 1921\nTarski showed that it could be defined as CNpp. In 1936\nSłupecki showed that by adding a functor \\(T\\) specifiable as\n\\(\\tval{Tp} = \\tfrac{1}{2}\\) for all values of p, all\nconnectives can be defined in Ł3. To axiomatize these\nfunctionally complete system the formulas \n\\[ \\begin{align}\n& CTpNTp \\\\\n & CNTpTp \n\\end{align} \\]\n\n\nhave to be added to Wajsberg’s axioms.\n\nAdolf Lindenbaum showed that Ł\\(_n\\) is\ncontained in Ł\\(_m\\) \\((n \\lt m)\\) if and\nonly if \\(n - 1\\) is a divisor of \\(m - 1\\), so if neither divides the\nother their respective tautologies properly overlap but neither set is\ncontained in the other. Tautologies of the infinite-valued system\nŁ\\(_{\\aleph_0}\\) are contained in those\nof all the finite-valued systems.\n5.5 Second Thoughts on Modality: System Ł\n\nFrom 1917, Łukasiewicz had been happy with the three-valued logic\nas formulating adequate notions of modality, with the noted preference\nfor the infinite-valued system as optimally precise. At some time,\nprobably around 1951–52, when he was working on\nAristotle’s modal logic, Łukasiewicz changed his mind.\nThere are a number of reasons behind the change of mind but the\neasiest to identify is Łukasiewicz’s concern that in Ł\\(_3\\)\nthere are theorems of the form\n\\(L\\alpha\\), for example \\(LCpp\\). Why should this be a concern, given\nthat most “standard” modal logics recognize the principle\nthat if \\(\\alpha\\) is a theorem, so is \\(L\\alpha\\)? Łukasiewicz\ngives two examples to justify the worry. If \\({=}ab\\) is the\nproposition that \\(a\\) is identical with \\(b\\), then basing identity\non the two axioms of self-identity and extensionality \n\\[ \\begin{align}\n& {=}aa \\\\\n & C{=}abC{\\phi}a{\\phi}b \n\\end{align} \\]\n\n\nthen instantiating \\(L{=}a\\apos\\) for \\(\\phi\\) gives \n\\[ \\begin{align}\n& C{=}abCL{=}aaL{=}ab \n\\end{align} \\]\n\n\nand if we accept \\(L{=}aa\\) we are forced to conclude that \\(L{=}ab\\),\nwhich Łukasiewicz thinks is false (SW 392, AS\n171), citing Quine’s (1953) example (now outdated because the\nnumber has changed) that while it’s true that 9 = the number of\nplanets, this is not necessarily true, although necessarily 9 = 9.\nDually, we have \n\\[ \\begin{align}\n& CMN{=}abN{=}ab \n\\end{align} \\]\n\n\nthat is, if \\(MN{=}ab\\) then \\(N{=}ab\\). But suppose a is\nreplaced by “the number thrown on this throw of this die”\nand b by “the number thrown on the next throw of this\ndie” the antecedent can be true and the consequent false.\n\nIn the wake of much subsequent discussion of such examples by Quine,\nKripke and others, these examples are hardly convincing, but there is\nanother more general reason why Łukasiewicz rejects necessities\nas theorems:\n\nit is commonly held that apodeictic propositions have a higher dignity\nand are more reliable than corresponding assertoric ones. This\nconsequence is for me by no means evident. […] I am inclined to\nthink that all systems of modal logic which accept asserted apodeictic\npropositions are wrong. (SW 395–6).\n\n\nSince \\(LCpp\\) is a theorem of all the systems of many-valued logic to\ndate, Łukasiewicz needed to come up with something new. This he\ndid in his 1953 paper “A System of Modal Logic”.\n\nŁukasiewicz begins the paper by laying out the conditions that a\nmodal logic needs to satisfy. These include axiomatic rejections as\nwell as assertions, as follows: \n\\[ \\begin{align}\n& \\vdash CpMp \\\\\n & \\dashv CMpp \\\\\n & \\dashv Mp \\\\\n & \\vdash CLpp \\\\\n & \\dashv CpLp \\\\\n & \\dashv NLp \\\\\n & \\vdash EMpNLNp \\\\\n & \\vdash ELpNMNp \n\\end{align} \\]\n\n\nTo obtain a system of modal logic respecting extensionality for\npropositional functors, Łukasiewicz takes Meredith’s axiom\nfor \\(C\\)-\\(N\\)-\\(\\delta\\) propositional calculus \n\\[ \\begin{align}\n& \\vdash C\\delta pC\\delta Np\\delta q \n\\end{align} \\]\n\n\nand adds one more axiomatic assertion and two axiomatic rejections\n\n\\[ \\begin{align}\n& \\vdash CpMp \\\\\n & \\dashv CMpp \\\\\n & \\dashv Mp \n\\end{align} \\]\n\n\ntogether with rules of substitution and detachment for both assertion\nand rejection, to obtain his logic. The principles for assertion are\nas usual, while those for rejection are:\n\n\\(\\dashv\\) Substitution: Any formula which has a rejected substitution\ninstance is rejected.\n\n\\(\\dashv\\) Detachment: If \\(Cab\\) is asserted and \\(b\\) is rejected\nthen \\(a\\) is rejected.\n\nFrom these he can derive all the desired principles and\nextensionality.\n\nThis is the logic Ł. Unlike standard modal logics, it has a\nfinite characteristic matrix, as follows, where like Łukasiewicz\nwe now replace ‘\\(M\\)’ by a new symbol\n‘\\(\\Delta\\)’, with 1 as the designated (true) value and 4\nthe antidesignated (false) value:\n\n\n\n\\(C\\)\n1\n2\n3\n4\n\\(N\\)\n\\({\\Delta}\\) \n\n1\n1\n2\n3\n4\n4\n1 \n\n2\n1\n1\n3\n3\n3\n1 \n\n3\n1\n2\n1\n2\n2\n3 \n\n4\n1\n1\n1\n1\n1\n3  \n\n\nThe matrix was proved characteristic by Smiley in 1961. Functors of\nnecessity (\\(\\Gamma\\)) and conjunction are definable in the standard\nway. More intriguingly, Łukasiewicz notes that there is another\npossibility operator \\(\\nabla\\) with the truth-table also given\nbelow:\n\n\n\n\\(K\\)\n1\n2\n3\n4\n\\(\\Gamma\\)\n\\({\\nabla}\\) \n\n1\n1\n2\n3\n4\n2\n1 \n\n2\n2\n2\n4\n4\n2\n2 \n\n3\n3\n4\n3\n4\n4\n1 \n\n4\n4\n4\n4\n4\n4\n2  \n\n\nTaken in isolation, this is indistinguishable from \\(\\Delta\\), but the\ntwo operators together interact differently, for while \\(\\dashv\n\\Delta\\Delta p\\) and \\(\\dashv \\nabla\\nabla p\\), both \\(\\vdash\n\\Delta\\nabla p\\) and \\(\\vdash \\nabla\\Delta p\\). Łukasiewicz\ncompares them to twins which are indistinguishable separately but\ndistinguishable together. Similar twins are the necessity operator\n\\(\\Gamma\\) and its counterpart (with values 3434), and indeed the two\nintermediate truth-values 2 and 3.\n\nThe logic is very unlike Łukasiewicz’s earlier multivalent\nsystems and also very unlike other modal systems. It is unlike his own\nsystems in that it is an extension of classical bivalent logic and\nincludes all bivalent tautologies. This is less surprising when we\nnote that the four-valued matrices for the standard connectives are\nsimply the Cartesian product of the standard bivalent matrices with\nthemselves. It is the modal operators that make the difference.\nSeveral features make this very unlike standard modal systems. One is\nthe complete lack of any truths, let alone theorems, of the form\n\\(\\Gamma a\\), in line with Łukasiewicz’s rejection of\ntruths of “higher dignity”. Other odd theorems are:\n\n\\(\\vdash CK{\\Delta}p{\\Delta}q{\\Delta}Kpq\\)\n\nall possible propositions are compossible\n\n\\(\\vdash CEpqC{\\Delta}p{\\Delta}q\\)\n\nmaterially equivalent propositions are both possible if one is\n\n\\(\\vdash C{\\Delta}pC{\\Delta}Np{\\Delta}q\\)\n\nif a proposition and its negation are both possible, anything is\n\nŁukasiewicz was aware of many of these odd consequences, but\ncontinued to uphold his system. Despite a number of attempts to make\nsense of the system, it has generally been concluded that because of\nthese oddities it is not really a system of modal logic. If there is\none dominant reason for this it is Łukasiewicz’s adherence\nto the principle of extensionality (truth-functionality) even for\nmodal operators, which forced his account of modality to go\nmultivalent in the first place.\n6. History of Logic\n6.1 Stoic Propositional Logic\n\nŁukasiewicz’s third signal achievement, along with his\ninvestigations of many-valued and propositional logics, is his work in\nthe history of logic. Indeed he can reasonably be considered the\nfather of the modern way of doing the history of logic, which is\npursued, to quote the subtitle of his book on Aristotle’s\nsyllogistic, “from the standpoint of modern formal logic.”\nWe saw that his early book on the principle of contradiction in\nAristotle was relatively unsuccessful in its own terms, though it\ndemonstrated his ability to go to the heart of the ancient Greek\ntexts.\n\nA decisive event in Łukasiewicz’s development as an\nhistorian of logic was his discovery of ancient Stoic logic. It seems\nhe was examining a dissertation on the Stoics and to prepare for it he\nread original texts. He thereupon discovered that Stoic logic,\ncontrary to the then standard opinion, voiced by Prantl, Zeller and\nothers, was not a bowdlerized and defective Aristotelian syllogistic,\nbut an early propositional logic, so that for example the first Stoic\nindemonstrable, “if the first, then the second; but the first,\ntherefore the second” is simply modus ponens or detachment for\nthe conditional ‘if’, and the variables, represented not\nby letters but by ordinal numerals, are propositional variables, not\nterm variables. He first voiced this view, which is now of course\nstandard, at a meeting in Lwów in 1923. A more systematic\ntreatment of 1934, “On the History of the Logic of\nPropositions”, is a delightful vignette taking in the broad\nsweep from the Stoics, ancient disputes about the meaning of the\nconditional, Petrus Hispanus and Ockham on the De Morgan laws, the\nmedieval theory of consequences, and culminating with Frege and modern\npropositional calculi. Modern appreciation of the achievements of\nStoic logic dates from Łukasiewicz’s clarification and his\nunstinting praise of the Stoics, especially Chrysippus.\nŁukasiewicz appreciated that Prantl did not have the benefit of\nknowing post-Fregean logic, and despite Prantl’s erroneous\ndismissal of the “stupidity” of much Stoic logic did at\nleast provide helpful sources. Nevertheless, Łukasiewicz’s\njudgement on past historians of logic is scathing:\n\nThe history of logic must be written anew, and by an\nhistorian who has a thorough command of modern mathematical logic.\nValuable as Prantl’s work is as a compilation of sources and\nmaterials, from a logical point of view it is practically worthless\n[…] Nowadays it does not suffice to be merely a philosopher in\norder to voice one’s opinion on logic. (SW, 198)\n\n6.2 Aristotle\n\nIn Łukasiewicz’s logic textbook of 1929, after treating\npropositional calculus he does not go on, as one would nowadays, to\nexpound predicate logic, but gives a brief formal account of\nAristotle’s categorical (non-modal) syllogistic, presupposing\ntwelve theorems of propositional calculus. This foreshadowed his 1951\nbook, Aristotle’s Syllogistic, by 22 years. This book,\nwhich revolutionized the study of Aristotle’s logic, had a long\nand interrupted genesis. A talk on the subject given at Kraków\nin 1939 was published in Polish only in 1946. In 1939 Łukasiewicz\nprepared a Polish monograph, but the partial proofs and manuscript\nwere destroyed in the bombing of Warsaw. In 1949 he was invited to\nlecture on Aristotle’s syllogistic at University College Dublin,\nand those lectures formed the basis of the book, completed in 1950 and\npublished the following year, his first in English. The first edition\ndealt only with categorical syllogistic. For the second edition,\ncompleted in 1955, less than a year before his death, Łukasiewicz\nadded three chapters on the modal syllogistic, employing the modal\nlogic Ł that he had developed in the meantime. The second edition\nwas proof-read and indexed by Lejewski, and appeared in 1957.\n\nŁukasiewicz’s understanding of Aristotle’s\nsyllogistic is based on two specific interpretative principles and a\ngeneral attitude. The first principle is that Aristotle’s\nsyllogisms are not, as had traditionally been supposed, inference\nschemata, of the form ‘p, q, therefore\nr’, but conditional propositions of the form ‘if\np and q, then r’. This leads\ndirectly into the second principle, which is that there is behind the\nsyllogistic treatment of term logic a deeper logic, that of\npropositions, and in particular a logic of opposition,\n‘and’ and ‘if’, as well as (in modal\nsyllogistic) ‘necessarily’ and ‘possibly’.\nŁukasiewicz takes this propositional basis to be occasionally\ninvoked by Aristotle, for instance in the treatment of indirect\nproofs, but for the most part left as tacit, and he therefore regards\nit as legitimate to criticise Aristotle (unlike the Stoics) for not\nexplicitly formulating the underlying propositional logic.\nŁukasiewicz’s trenchant and controversial views sparked a\ncontroversy over how to interpret the syllogistic. While the\nprinciples did win an early adherent in Patzig (1968), subsequent\ncriticisms by Corcoran (1972, 1974) and, independently, Smiley (1974)\nestablished clearly that syllogisms are not propositions but\ninferences, and that Aristotle had no need of a prior logic of\npropositions. That view is now universal among scholars of\nAristotle’s logic. In retrospect, it appears that\nŁukasiewicz was keen to wish onto Aristotle his own (Fregean)\nview of logic as a system of theorems based on a propositional\nlogic.\n\nThe general attitude, present throughout Łukasiewicz’s\ntreatment, is that Aristotle’s work is of sufficient precision\nand stature to warrant and withstand exposition using the most\nrigorous modern logical methods and concepts. In other words, the\ndevelopment of modern logic, while it may highlight lacunae and\ndeficits of Aristotle’s logic, in fact brings out its merits,\ninnovations and genius more clearly than previous traditional or\nphilological studies. Łukasiewicz’s attitude has prevailed\nand is now pervasive among those studying Aristotle’s logic,\nwhether or not they agree with his specific interpretative\nprinciples.\n\nAfter an exposition of the basics of Aristotle’s treatment of\nsyllogistic, in which he criticises earlier commentators and notes\nthat Aristotle originated the method of rejected forms in order to\nshow not just which are the valid syllogisms but also to prove the\ninvalid forms to be such, Łukasiewicz presents his formalization\nof categorical syllogistic, based on the following logical\nexpressions\n\n\n\nExpression\nMeaning \n\n\\(Aab\\)\nAll \\(a\\) is \\(b\\) (or \\(b\\) belongs to all \\(a\\)) \n\n\\(Eab\\)\nNo \\(a\\) is \\(b\\) (or \\(b\\) belongs to no \\(a\\)) \n\n\\(Iab\\)\nSome \\(a\\) is \\(b\\) (or \\(b\\) belongs to some \\(a\\)) \n\n\\(Oab\\)\nSome \\(a\\) is not \\(b\\) (or \\(b\\) does not belong to some\n\\(a\\))  \n\n\nTaking \\(A\\) and \\(I\\) as primitive and defining \\(E = NI\\) and \\(O =\nNA\\), the axioms, added to propositional calculus, are\n\n\n\n\\(\\vdash Aaa\\)\n  \n\n\\(\\vdash Iaa\\)\n  \n\n\\(\\vdash CKAbcAabAac\\)\n(Barbara in the first figure) \n\n\\(\\vdash CKAbcIbaIac\\)\n(Datisi in the second figure) \n\n\n\ntogether with modus ponens and a substitution rule for term variables.\nThis in fact was the system that Łukasiewicz had put forward in\nhis 1929 textbook. As the second axiom indicates, Łukasiewicz is\nhere following Aristotle in assuming that all terms denote. Rejected\nforms can be added: Łukasiewicz gives from the second figure\n\n\\[ \\begin{align}\n& \\dashv CKAcbAabIac & \\text{and}\\\\\n & \\dashv CKEcbEabIAc & \n\\end{align} \\]\n\n\nwhich together with detachment and substitution for rejection deliver\nall Aristotle’s 232 rejected moods. Łukasiewicz’s\nverdict on Aristotle’s categorical syllogistic is, that despite\nits narrowness, it is “a system the exactness of which surpasses\neven the exactness of a mathematical theory, and this is its\neverlasting merit.” (AS, 131)\n\nThe modal syllogistic on the other hand is little studied, according\nto Łukasiewicz, both because it falls well below the standards of\nperfection of the categorical, and for lack of a “universally\nacceptable system of modal logic”, which Łukasiewicz takes\nhimself, with Ł, now to have provided. Łukasiewicz’s\nown treatment falls short of being definitive, though it provides\nmaterial for later studies, and we shall not pursue it here.\nInterestingly, in Aristotle’s attempts in Book I, Chapter 15 of\nthe Prior Analytics, to establish the theses \n\\[ \\begin{align}\n& CCpqCLpLq \\\\\n & CCpqCMpMq \n\\end{align} \\]\n\n\nŁukasiewicz sees an Aristotelian endorsement for the idea of a\nprinciple of extensionality for modal operators as well as for\ncategorical ones.\n7. Philosophical Positions\n\nIn his early philosophy, the most significant and influential position\nadopted by Łukasiewicz is his anti-psychologism in logic. This\nwas influenced by Frege, Husserl and Russell. It manifested itself\nterminologically in Łukasiewicz’s replacement of the\ntraditional term sąd (judgement), used by Twardowski, by\nthe term zdanie (sentence). This change of perspective and\nterminology was adopted by subsequent Polish logicians en\nmasse. After 1920, Łukasiewicz is very sparing in his\nstatements regarding philosophy and philosophical problems. His\nabiding commitment to indeterminism we have noted. His main comments\nand indeed ire are reserved for those who criticise the place of\nmathematical logic (or logistic, as it was then known) in philosophy\nand thought in general. He noted certain convergences in method and\nstyle between the Lwów–Warsaw School and the Vienna\nCircle, but criticised the latter for their conventionalism and\nrejection of all metaphysics and for their attempt to turn substantive\nproblems into linguistic ones. Despite its abstractness, logic is no\nmore detached from reality than any other science, and it is\nconstrained to conform to aspects of the world. It was his conviction\nthat determinism was false that drove his rejection of bivalent logic.\nWhile maintaining the metaphysical neutrality of logic, he admitted\nlater in the 1930s that whereas he had earlier been a nominalist, he\nwas now a platonist. The source of this conviction is stated at the\nend of his 1937 polemic “In defence of logistic”:\n\nwhenever I work even on the least significant logistic problem, for\ninstance, when I search for the shortest axiom of the propositional\ncalculus, I always have the impression that I am facing a powerful,\nmost coherent and most resistant structure. I sense that structure as\nif it were a concrete, tangible object, made of the hardest metal, a\nhundred times stronger than steel and concrete. I cannot change\nanything in it; I do not create anything of my own will, but by\nstrenuous work I discover in it ever new details and arrive at\nunshakable and eternal truths. (SW, 249)\n\n\nRarely has the motivation for platonism been so eloquently stated.\n\nIn the philosophy of logic, one of Łukasiewicz’s most\ndeep-seated convictions, one that he shared with the other logicians\nof the Warsaw School, was that logic has to be extensional, that it is\nthe study of the calculi not of linguistic meanings or psychological\njudgements but of the truth-values, whether just the classical two or\nmore besides. His view is that sentences denote truth-values, and that\nlogic is the science of such logical values, not of sentences (which\nis grammar) or of judgements (which is psychology), or of contents\nexpressed by propositions, or of objects in general (ontology). He\ndoes not justify this position, but simply accepts and assumes it. As\nwe saw, it has far-reaching consequences for his treatment of modal\nlogic, forcing it to be many-valued.\n\nIn addition to the general attitude to scientific philosophizing that\nhe derived from Twardowski, there is one identifiable source of some\nother of Łukasiewicz’s philosophical stances regarding\nlogic, or if not a source, at least a point of convergent convictions.\nOne is the rejection of a “supertruth” above ordinary\ntruth. This comes out especially clearly in the modal logic Ł.\nThe other is his liking for degrees of possibility intermediate\nbetween truth (1) and falsity (0), by contrast with the\nnon-quantitative third case of possibility (or in Ł twin third\ncases). An exactly similar distinction between two kinds of\npossibility, “unincreasable”, without degrees, and\n“increasable”, with infinite degrees, can be found in\nMeinong’s massive 1915 treatise Über Möglichkeit\nund Wahrscheinlichkeit. Like Łukasiewicz, Meinong does not\naccord propositions a dignity of necessity higher than truth, and\ndespite having the most ample ontology known to philosophy,\nMeinong’s object theory lacks objects described as necessary: he\nnever mentions God, and ideal objects such as numbers are taken by him\nto subsist, not to exist or subsist necessarily. It is perhaps not\nincidental that on returning to Lwów after his visit to Graz,\nŁukasiewicz spoke in 1910 about the law of excluded middle,\nconcluding that like the principle of contradiction it is not\nfundamental, and has practical rather than logical significance. He\nconjectured that it failed for general objects like the triangle in\ngeneral, which is neither equilateral nor not equilateral. Meinong\naccepted such objects, which he called “incomplete”, and\nhad in fact adopted the idea from Łukasiewicz’s teacher\nTwardowski. Łukasiewicz also regarded the application of the\nprinciple to real objects as “connected with the universal\ndeterminism of phenomena, not only present and past ones but also\nfuture ones. Were someone to deny that all future phenomena are today\nalready predetermined in all respects, he would probably not be able\nto accept the principle in question.” The seeds of three-valued\nlogic were already germinating in 1910, after the visit to Graz.\n\nMeinong employed the many values of increasable possibility to give an\naccount of probability. While Łukasiewicz’s procedure in\nhis 1913 monograph was based on a different idea, he continued to be\npulled towards the idea that infinite-valued logic might be able to\nshed light on probability. At the very latest by 1935, with the\npublication of a short article on probability and many-valued logic by\nTarski, he knew that the most straightforward approach, that of\nidentifying probabilities with truth-values between 0 and 1, would not\nwork. The reason is that because of probabilistic dependence,\nprobability is not extensional: if \\(p\\) is the proposition that it\nwill rain in Dublin tomorrow and \\(Np\\) is its negation, the\nprobability of the contradictory conjunction \\(KpNp\\) is 0, but if\n\\(p\\) has degree of truth \\(\\tfrac{1}{2}\\), so does \\(Np\\), and so\n\\(\\tval{KpNp} = \\tfrac{1}{2}\\) in both Ł\\(_3\\)\nand Ł\\(_{\\aleph_0}\\).\nDespite this, as late as 1955\nŁukasiewicz could still muse,\n\nI have always thought that only two modal systems are of possible\nphilosophic and scientific importance: the simplest modal system, in\nwhich possibility is regarded as having no degrees at all, that is our\nfour-valued model system, and the ℵ0-valued system\nin which there exist infinitely many degrees of possibility. It would\nbe interesting to investigate this problem further, as we may find\nhere a link between modal logic and the theory of probability.\n(AS, 180)\n\n8. Legacy\n\nŁukasiewicz once declared somewhat immodestly that the discovery\nof many-valued logics was comparable to that of non-Euclidean\ngeometries (SW 176). Whatever their significance,\nŁukasiewicz’s hopes for such logics have not been realized\nin the way he anticipated. The semantics and pure mathematics of\nmultivalued logics have flourished, leading to the development of\nMV-algebras in use for the algebraic semantics of\nŁukasiewicz’s logics. Infinite-valued or fuzzy logic has\nits own mathematics, and prominent among its developers is the Czech\nmathematical logician Petr Hájek, whose work is influenced by\nthat of Łukasiewicz. Fuzzy logic is found in many practical\napplications, where it is used to deal with vagueness, inexactness, or\nlack of knowledge, whether these are the same or different. But\nŁukasiewicz’s championing of multivalence in the analysis\nof modality has been almost universally rejected, and the logic of\nmodality has inexorably followed other paths, mostly bivalent,\nnon-extensional ones. His final logic Ł has resisted consensual\ninterpretation, and is regarded as at best an oddity and at worst a\ndead end.\n\nThe outstanding work that Łukasiewicz and his students\naccomplished in the logic and metalogic of propositional calculus, the\nPolish speciality of ever-shorter axioms and so on, now belongs to the\nbygone heroic age of logistic. Its results have indeed only been\nbettered occasionally by automated theorem-provers. On the other hand\nthe emphasis on logical semantics, Łukasiewicz’s abundant\nuse of truth-values notwithstanding, has shifted interest away from\naxiomatic virtuosity.\n\nIn the history of logic, Łukasiewicz’s pioneering studies\nopened up a new and more fruitful interaction between the past and the\npresent, and the rediscovery and new appreciation of figures from\nlogic’s past “in the light of modern formal logic”\nhas continued to this day, though not all of Łukasiewicz’s\nown views on how to approach Aristotle or the Stoics have stood the\ntest of time. His work also helped to inspire those historians of\nlogic from the Catholic tradition in Kraków, most notably Jan\nSalamucha and Józef Bocheński, who applied modern methods\nto the investigation of logical problems and arguments from the\nhistory of philosophy.\n\nDuring the heyday of the Warsaw School, 1920–1939,\nŁukasiewicz played a key role in educating the next generation of\nlogical researchers and inspiring them with methods, results and\nproblems. Even ideas he tossed off as exercises have changed logic,\nfor example a 1929 suggestion to formalize the informal procedure of\nproof from assumptions led to Stanisław Jaśkowski’s\n1934 system of natural deduction, in essentials the way logic is\nmainly taught to students today. The war irrevocably interrupted their\nwork. Several of Łukasiewicz’s best students were Jewish,\nand were killed in Nazi death camps. In his exile from Poland after\n1944, Łukasiewicz had scant opportunity to continue this\npedagogical work, holding a research position in a non-teaching\ninstitution in a country with no logical tradition. His interactions\nwith contemporaries were much more sparse, and those chiefly through\ncorrespondence. The one notable logician who interacted with\nŁukasiewicz at this time and whose work intersects with his in\nboth interests (time, modality, many-valuedness) and attitudes (the\nimportance of logic for philosophy) is Arthur Prior, who was the only\nmajor logician to adopt Polish notation, and who also expended more\neffort than anyone in the attempt to find a plausible interpretation\nfor the system Ł. It is also fair to say that of the major\nfigures among the Warsaw logicians, Łukasiewicz has received the\nleast attention from commentators and historians. There are relatively\nfewer monographs and papers on Łukasiewicz than on other major\nfigures of the Lwów–Warsaw School.\n\nDespite such disappointments, Łukasiewicz’s achievements\nand inventions ensure him a permanent and honorable place in the\nhistory of mathematical and philosophical logic. Łukasiewicz was\njustly proud of the prominence achieved by Polish logicians between\nthe wars, and fully deserves his commemoration by one of Adam\nMyjak’s four statues of prominent Lwów–Warsaw\nSchool members at the entrance to Warsaw University Library.\n",
    "bibliography": {
        "categories": [
            "<a id=\"GenRem\">General Remarks</a>",
            "<a id=\"Abb\">Abbreviations</a>",
            "<a id=\"PriSouWorLuk\">Primary Sources: Works by Łukasiewicz</a>",
            "<a id=\"SelSecLit\">Selected Secondary Literature</a>"
        ],
        "cat_ref_text": {
            "<a id=\"GenRem\">General Remarks</a>": "</h3>\n<p>\nTitles have been given in their original language, followed in the\ncase of pieces originally in Polish by the title of any published\nEnglish translation where one exists, or by our English translation\nwhere none does. The bibliography of Łukasiewicz’s\npublished writings is not complete, since a large number of his\npublished pieces consist of one- or two-page summaries or abstracts of\ntalks given at various venues, as was the Polish practice of the time.\nOf this kind, only those which are important for\nŁukasiewicz’s development or the exposition of his views\nhave been included. Translations into languages other than English\nhave not been included, with one exception, the 1910 monograph on\nAristotle.</p>\n<p>\nA comprehensive bibliography in Polish, compiled by the editor Jacek\nJuliusz Jadacki, is published in the collection <em>Logika i\nMetafizyka</em> (1998), which reprints most of\nŁukasiewicz’s essays, along with a number of incidentally\ninteresting speeches, reviews and excerpts from correspondence, a\nbiographical chronology, and a large number of photographs.</p>\n<h3>",
            "<a id=\"Abb\">Abbreviations</a>": [
                "</h3>\n<ul class=\"sentag tag4em\">",
                "<span class=\"tag\">(<em>AS</em>)</span> <span class=\"sen\"><em>Aristotle’s\nSyllogistic from the Standpoint of\nModern Formal Logic</em>, 2nd ed.</span>",
                "<span class=\"tag\">(<em>PF</em>)</span> <span class=\"sen\"><em>Przegląd\nFilozoficzny</em></span>",
                "<span class=\"tag\">(<em>PL</em>)</span> <span class=\"sen\"><em>Polish\nLogic, 1920–1939</em>, ed. S.\nMcCall.</span>",
                "<span class=\"tag\">(PWN)</span> <span class=\"sen\">Państwowe\nWydawnictwo Naukowe</span>",
                "<span class=\"tag\">(<em>RF</em>)</span> <span class=\"sen\"><em>Ruch\nFilozoficzny</em></span>",
                "<span class=\"tag\">(<em>SW</em>)</span> <span class=\"sen\"><em>Selected\nWorks</em>, ed. L. Borkowski.</span>",
                "<span class=\"tag\">(<em>Z</em>)</span> <span class=\"sen\"><em>Z\nzagadnień logiki i filozofii. Pisma wybrane</em>, ed. J.\nSłupecki.</span>\n</ul>\n<h3>"
            ],
            "<a id=\"PriSouWorLuk\">Primary Sources: Works by Łukasiewicz</a>": [
                "</h3>\n<h4>Collections</h4>\n<ul class=\"hanging\">",
                "<em>Z zagadnień logiki i filozofii. Pisma wybrane</em>.\n[<em>Topics in Logic and Philosophy. Selected Writings</em>], ed. J.\nSłupecki. Warsaw: PWN, 1961.",
                "<em>Selected Works</em>, ed. L. Borkowski. Amsterdam:\nNorth-Holland, 1970.",
                "<em>Logika i Metafizyka.</em> <em>Miscellanea</em>. [<em>Logic and\nMetaphysics. A Miscellany</em>], ed. J. J. Jadacki. Warsaw:\nTowarzystwo Naukowe Warszawskie, 1998.",
                "<em>Pamiętnik</em>. [<em>Diary</em>], ed. J. J. Jadacki and\nP. Surma. Warsaw: Wydawnictwo Naukowe Semper, 2013. [Contains diary\nentries by Łukasiewicz and a number of incidental pieces of\nbiographical note by him and others.]\n</ul>\n<h4>Monographs</h4>\n<ul class=\"hanging\">",
                "<em>O zasadzie sprzeczności u Arystotelesa, Studium\nkrytyczne.</em> [<em>On the Principle of Contradiction in Aristotle. A\nCritical Study.</em>] Kraków: Akademia Umiejętności,\n1910. 2nd ed., ed. J. Woleński, Warsaw: PWN, 1987. Translations:\n<em>Über den Satz vom Widerspruch bei Aristoteles</em>.\nHildesheim: Olms, 1993; <em>Del principio di contradizzione in\nAristotele</em>. Macerata: Quodlibet, 2003.",
                "<em>Die logischen Grundlagen der Wahrscheinlichkeitsrechnung</em>.\nKraków: Spółka Wydawnicza Polska, 1913.\nTranslation: Logical Foundations of Probability Theory, in\n<em>SW</em>, 16–63.",
                "<em>Elementy logiki matematycznej.</em> <em>Skrypt\nautoryzowany</em>, ed. M. Presburger. Warsaw: Wydawnictwo Koła\nMatematyczno-Fizycznego Słuchaczów Uniwersytetu\nWarszawskiego, 1929. 2nd ed., ed. J. Słupecki, Warsaw: PWN, 1958.\nTranslation: <em>Elements of Mathematical Logic</em>. Oxford: Pergamon\nPress, 1966.",
                "<em>Aristotle’s Syllogistic from the Standpoint of Modern\nFormal Logic</em>. Oxford: Clarendon Press, 1951. 2nd, enlarged ed.,\n1957.\n</ul>\n<h4>Papers</h4>\n<ul class=\"hanging\">",
                "O indukcji jako inwersji dedukcji [On induction as the inversion\nof deduction]. <em>PF</em> 6 (1903), 9–24, 138–152.",
                "Analiza i konstrukcja pojęcia przyczyna. <em>PF</em> 9\n(1906), 105–179. Reprinted in <em>Z</em>, 9–62.\nTranslation: Analysis and construction of the concept of cause, in J.\nJadacki and E. Swiderski, eds., <em>The Concept of Causality in the\nLvov-Warsaw School. The Legacy of Jan Łukasiewicz</em>. Leiden:\nBrill, forthcoming.",
                "O zasadzie wyłączonego środka. <em>PF</em> 13\n(1910), 372–3. Translation: On the Principle of the Excluded\nMiddle. <em>History and Philosophy of Logic</em> 8 (1987),\n67–9.",
                "Über den Satz von Widerspruch bei Aristoteles. <em>Bulletin\ninternationale de l’Académie des Sciences de Cracovie,\nClasse de Philosophie</em> (1910), 15–38. Translation: On the\nPrinciple of Contradiction in Aristotle. <em>Review of\nMetaphysics</em> 24 (1970/71), 485–509; Aristotle on the Law of\nContradiction, in: J. Barnes, M. Schofield and R. Sorabji, eds.,\n<em>Articles on Aristotle 3. Metaphysics</em>. London: Duckworth,\n1979, 50–62.",
                "O twórczości w nauce, <em>Księga pamiątkowa\nku uczczeniu 250-tej rocznicy zalożenia Uniwersytetu Lwowskiego\nprzez Króla Jana Kazimierza r. 1661.</em> Lwów:\nUniwersytet Lwowski, 1912, 3–15. Translation: Creative elements\nin science, in <em>SW</em>, 1–15.",
                "W sprawie odwracalności stosunku racji i następstwa\n[Concerning the reversibility of the relation between reason and\nconsequence], <em>PF</em> 26 (1913), 298–314.",
                "O nauce i filozofii [On science and philosophy], <em>PF</em> 28\n(1915), 190–196.",
                "O pojęciu wielkości, <em>PF</em> 19 (1916), 1–70.\nTranslation: On the concept of magnitude. in <em>SW</em>,\n64–83.",
                "Treść wykładu pożegnalnego wygłoszonego w\nauli Uniwersytetu Warszawskiego 7 marca 1918 r. <em>Pro arte et\nstudio</em> 3 (1918), 3–4. Translation: Farewell lecture\ndelivered in the Warsaw University Lecture Hall on March 7, 1918, in\n<em>SW</em>, 84–6.",
                "O pojęciu możliwości, <em>RF</em> 5 (1920),\n169–170. Translation: On the concept of possibility, in\n<em>PL</em>, 15–16.",
                "O logice trójwartościowej, <em>RF</em> 5 (1920),\n170–1. Translation: On three-valued logic, in <em>PL</em>,\n16–18, and in <em>SW</em>, 87–8.",
                "Logika dwuwartościowa, <em>PF</em> 23 (1921), 189–205.\nTranslation: Two-valued logic, in <em>SW</em>, 89–109.",
                "Interpretacja liczbowa teorii zdań, <em>RF</em> 7 (1922/23),\n92–3. Translation: A numerical interpretation of the theory of\npropositions, in <em>SW</em>, 129–30.",
                "O logice stoikow [On Stoic logic], <em>PF</em> 30 (1927),\n278–9.",
                "O znaczeniu i potrzebach logiki matematycznej [On the importance\nand needs of mathematical logic], <em>Nauka Polska</em> 10 (1929),\n604–20.",
                "(with A. Tarski) Untersuchungen über den Aussagenkalkül,\n<em>Comptes rendus de la Société des Sciences et des\nLettres de Varsovie,</em> cl. iii, 23 (1930), 1–21. Translation:\nInvestigations into the Sentential Calculus, in <em>SW</em>,\n131–52.",
                "Philosophische Bemerkungen zu mehrwertigen Systemen des\nAussagenkalküls, <em>Comptes rendus de la Société\ndes Sciences et des Lettres de Varsovie,</em> cl. iii, 23 (1930),\n51–77. Translation: Philosophical remarks on many-valued systems\nof propositional logic, in <em>PL</em>, 40–65, and in\n<em>SW</em>, 153–78.",
                "Uwagi o aksjomacie Nicoda i “dedukcji\nuogólniającej”, <em>Księga pamiątkowa\nPolskiego Towarzystwa Filozoficznego,</em> Lwów, 1931,\n366–83. Translation: Comments on Nicod’s axiom and on\n“generalizing deduction”, in <em>SW</em>,\n179–96.",
                "Ein Vollstandigkeitsbeweis des zweiwertigen Aussagenkalküls,\n<em>Comptes rendus de la Société des Sciences et des\nLettres de Varsovie,</em> cl. iii, 24 (1931), 153–83.",
                "Z historii logiki zdań, <em>PF</em> 37 (1934), 417–37.\nTranslation: On the history of the logic of propositions, in\n<em>PL</em>, 66–87, and in <em>SW</em>, 197–217.",
                "Znaczenie analizy logicznej dla poznania [The importance of\nlogical analysis for cognition], <em>PF</em> 37 (1934),\n369–77.",
                "Bedeutung der logischen Analyse für die Erkenntnis, <em>Actes\ndu VIII Congrès International de Philosophie,</em> Prague\n(1936), 75–84.",
                "W obronie logistyki. <em>Myśl katolicka wobec logiki\nwspólczesnej</em>, <em>Studia Gnesnensia</em> 15 (1937),\n12–26. Translation: In defence of logistic, in <em>SW</em>,\n236–49.",
                "Kartezjusz [Descartes], <em>Kwartalnik Filozoficzny</em> 15\n(1938), 123–8.",
                "Geneza logiki trójwartościowej [The origins of\nthree-valued logic]. <em>Nauka Polska</em> 24 (1939).\n215–223.",
                "O sylogistyce Arystotelesa [On Aristotle’s syllogistic],\n<em>Sprawozdania PAU,</em> 44 (1939), 220–7. Published\n1946.",
                "Der Äquivalenzkalkül, <em>Collectanea logica</em> 1\n(1939), 145–69. Did not appear then. One offprint survived in\nMünster, and served for the translation: The Equivalential\nCalculus, in <em>PL</em>, 88–115, and in <em>SW</em>,\n250–77.",
                "Die Logik und das Grundlagenproblem, <em>Les entretiens de Zurich\nsur les fondements et la méthode des sciences\nmathématiques</em> 6–9.XII.1938, Zurich: Leemann, 1941,\n82–100.",
                "The shortest axiom of the implicational calculus of propositions,\n<em>Proceedings of the Royal Irish Academy,</em> Sect. A, 52 (1948),\n25–33.",
                "W sprawie aksjomatyki implikacyjnego rachunku zdań [On the\nsystem of axioms of the implicational prepositional calculus],\n<em>Annales de la Société Polonaise de\nMathématique</em> 22 (1950), 87–92.",
                "On Variable Functors of Propositional Arguments, <em>Proceedings\nof the Royal Irish Academy,</em> Sect. A, 54 (1951), 25–35.",
                "On the intuitionistic theory of deduction, <em>Indagationes\nMathematicae</em>. <em>Koninklijke Nederlandse Academie van\nWetenschappen, Proceedings</em> Series A 14(1952), 201–212,\nrepr. in <em>SW</em>, 325–40.",
                "Sur la formalisation des théories mathématiques.\n<em>Colloques internationaux du Centre National de la Recherche\nScientifique</em>, 36: Les méthodes formelles en axiomatique,\nParis, 1953, 11–19. Translation: Formalization of Mathematical\nTheories, in <em>SW</em>, 341–51.",
                "A System of Modal Logic, <em>The Journal of Computing\nSystems,</em> 1 (1953), 111–49, repr. in <em>SW</em>,\n352–90.",
                "Arithmetic and Modal Logic, <em>The Journal of Computing\nSystems,</em> 1 (1954), 213–9, repr. in <em>SW</em>,\n391–400.",
                "The principle of individuation, <em>Proceedings of the\nAristotelian Society,</em> supplementary volume XXVII (Berkeley and\nmodern problems) (1953), 69–82.",
                "On a controversial problem of Aristotle’s modal syllogistic,\n<em>Dominican Studies</em> 7 (1954), 114–28.",
                "Curriculum vitae [1953], <em>Philosophical Studies</em> 6 (1956),\n43–6.",
                "O determinizmie, in <em>Z</em>, 114–26. Translation: On\ndeterminism, in <em>PL</em> 19–39, and in <em>SW</em>,\n110–28.\n</ul>\n<h4>Translation</h4>\n<ul class=\"hanging\">",
                "David Hume, <em>Badania dotycące rozumu ludzkiego</em>\n[<em>An enquiry concerning human understanding</em>]; translation by\nJan L. Łukasiewicz and Kazimierz Twardowski, Lwów:\nNakładem Polskiego Towarzystwa Filozoficznego, 1905.\n</ul>\n<h3>"
            ],
            "<a id=\"SelSecLit\">Selected Secondary Literature</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Agassi, A. and Woleński, J., 2010, “Łukasiewicz\nand Popper on Induction”, <em>History and Philosophy of\nLogic</em>, 31: 385–388. [Contains English translation of two\nsmall texts of Łukasiewicz on induction.]",
                "Betti, A., 2002, “The incomplete story of Łukasiewicz\nand bivalence”, in T. Childers (ed.), <em>The Logica 2002\nYearbook</em>, Prague: The Czech Academy of Sciences—Filosofia,\n21–36.",
                "Childers, T. and Majer, O., 1998, “On\nŁukasiewicz’s theory of probability”, in K.\nKijania-Placek and J. Woleński (eds.), <em>The Lvov-Warsaw School\nand Contemporary Philosophy</em>, Dordrecht: Kluwer,\n303–12.",
                "Corcoran, J., 1972, “Completeness of an Ancient\nLogic”, <em>Journal of Symbolic Logic</em>, 37:\n696–705.",
                "–––, 1974, “Aristotelian Syllogisms: Valid\nArguments or True Universalized Conditionals?”, <em>Mind</em>,\n83: 278–81.",
                "Font, J. P. and Hájek, P., 2002, “On\nŁukasiewicz’s Four-Valued Modal Logic”, <em>Studia\nLogica</em>, 70: 157–82.",
                "McCall, S. (ed.), 1967, <em>Polish Logic</em>\n<em>1920–1939</em>, Oxford: Clarendon Press.",
                "Malinowski, G., 1993, <em>Many-Valued Logics</em>, Oxford:\nClarendon Press.",
                "Meredith, C. A., 1951, “On an extended system of the\npropositional calculus”, <em>Proceedings of the Royal Irish\nAcademy</em>, 54 (Section A): 37–47.",
                "Meredith, C. A., 1953, “Single axioms for the systems\n(<em>C</em>,<em>N</em>), (<em>C</em>,0), and (<em>A</em>,<em>N</em>)\nof the two-valued propositional calculus”, <em>The Journal of\nComputing Systems</em>, 1: 155–164.",
                "Patzig, G., 1968. <em>Die aristotelische Syllogistik</em>,\nGöttingen: Vandenhoeck and Ruprecht, 3rd edition (1st edition,\n1959); translation by J. Barnes, <em>Aristotle’s Theory of the\nSyllogism</em>, Dordrecht: Reidel, 1969.",
                "Placek, T., 2006. “A Puzzle about Semantic Determinism:\nŁukasiewicz’s ‘On Determinism’ Years\nLater”, in J. Jadacki and J. Paśniczek (eds.), <em>The\nLvov-Warsaw School – The New Generation</em>, Amsterdam: Rodopi,\n171–185.",
                "Prior, A. N., 1954, “The Interpretation of Two Systems of\nModal Logic”, <em>The Journal of Computing Systems</em>, 1:\n201–8.",
                "Quine, W. V., 1953, “Three Grades of Modal\nInvolvement”, <em>Proceedings of the XIth International Congress\nof Philosophy</em> (Volume XIV), Brussels, pp. 80 ff.",
                "Schmidt am Busch, H.-C. and Wehmeier, K. F., 2007, “On the\nrelations between Heinrich Scholz and Jan Łukasiewicz”,\n<em>History and Philosophy of Logic</em>, 28: 67–81.",
                "Seddon, F., 1996, <em>Aristotle and Łukasiewicz on the\nPrinciple of Contradiction</em>, Ames: Modern Logic Publishing.",
                "Simons, P., 1992, “Łukasiewicz, Meinong, and\nMany-Valued Logic”, in K. Szaniawski (ed.), <em>The Vienna\nCircle and the Lvov-Warsaw School</em>, Dordrecht: Kluwer, 1989,\n249–91; reprinted in P. Simons, <em>Philosophy and Logic in\nCentral Europe from Bolzano to Tarski</em>. Dordrecht: Kluwer,\n193–225.",
                "Smiley, T. J., 1961, “On Łukasiewicz’s\nŁ-modal system”, <em>Notre Dame Journal of Formal\nLogic</em>, 2: 149–53.",
                "–––, 1974, “What is a Syllogism?”,\n<em>Journal of Philosophical Logic</em>, 2: 136–154.",
                "Sobociński, B., 1956, “In memoriam: Jan\nŁukasiewicz (1878–1956)” <em>Philosophical\nStudies</em>, 6: 3–49. [Includes as an appendix\nŁukasiewicz’s Curriculum Vitae of 1953.]",
                "Tarski, A., 1935/6, “Wahrscheinlichkeitslehre und\nmehrwertige Logik”, <em>Erkenntnis</em>, 5: 174–5.",
                "Wójcicki, R. and Malinowski, G. (eds.), 1977, <em>Selected\nPapers on Łukasiewicz’s Sentential Calculi</em>,\nWrocław: Ossolineum.",
                "Woleński, J., 1994, “Jan Łukasiewicz on the Liar\nParadox, Logical Consequence, Truth, and Induction”, <em>Modern\nLogic</em>, 4: 392–400.",
                "–––, 2000, “Jan Łukasiewicz und der\nSatz vom Widerspruch”, in N. Öffenberger and M. Skarica\n(eds.), <em>Beiträge zum Satz vom Widerspruch und zur\nAristotelischen Prädikationtheorie</em>, Hildesheim: Olms,\n1–42.",
                "–––, 2013, “The Rise of Many-Valued Logic\nin Poland”, in J. Woleński, <em>Historico-Philosophical\nEssays</em> (Volume 1), Kraków: Copernicus Press,\n37–50.",
                "Zinoviev, A. A., 1963, <em>Philosophical Problems of Many-Valued\nLogic</em>, Dordrecht: D. Reidel.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"GenRem\">General Remarks</a></h3>\n<p>\nTitles have been given in their original language, followed in the\ncase of pieces originally in Polish by the title of any published\nEnglish translation where one exists, or by our English translation\nwhere none does. The bibliography of Łukasiewicz’s\npublished writings is not complete, since a large number of his\npublished pieces consist of one- or two-page summaries or abstracts of\ntalks given at various venues, as was the Polish practice of the time.\nOf this kind, only those which are important for\nŁukasiewicz’s development or the exposition of his views\nhave been included. Translations into languages other than English\nhave not been included, with one exception, the 1910 monograph on\nAristotle.</p>\n<p>\nA comprehensive bibliography in Polish, compiled by the editor Jacek\nJuliusz Jadacki, is published in the collection <em>Logika i\nMetafizyka</em> (1998), which reprints most of\nŁukasiewicz’s essays, along with a number of incidentally\ninteresting speeches, reviews and excerpts from correspondence, a\nbiographical chronology, and a large number of photographs.</p>\n<h3><a id=\"Abb\">Abbreviations</a></h3>\n<ul class=\"sentag tag4em\">\n<li><span class=\"tag\">(<em>AS</em>)</span> <span class=\"sen\"><em>Aristotle’s\nSyllogistic from the Standpoint of\nModern Formal Logic</em>, 2nd ed.</span></li>\n<li><span class=\"tag\">(<em>PF</em>)</span> <span class=\"sen\"><em>Przegląd\nFilozoficzny</em></span></li>\n<li><span class=\"tag\">(<em>PL</em>)</span> <span class=\"sen\"><em>Polish\nLogic, 1920–1939</em>, ed. S.\nMcCall.</span></li>\n<li><span class=\"tag\">(PWN)</span> <span class=\"sen\">Państwowe\nWydawnictwo Naukowe</span></li>\n<li><span class=\"tag\">(<em>RF</em>)</span> <span class=\"sen\"><em>Ruch\nFilozoficzny</em></span></li>\n<li><span class=\"tag\">(<em>SW</em>)</span> <span class=\"sen\"><em>Selected\nWorks</em>, ed. L. Borkowski.</span></li>\n<li><span class=\"tag\">(<em>Z</em>)</span> <span class=\"sen\"><em>Z\nzagadnień logiki i filozofii. Pisma wybrane</em>, ed. J.\nSłupecki.</span></li>\n</ul>\n<h3><a id=\"PriSouWorLuk\">Primary Sources: Works by Łukasiewicz</a></h3>\n<h4>Collections</h4>\n<ul class=\"hanging\">\n<li><em>Z zagadnień logiki i filozofii. Pisma wybrane</em>.\n[<em>Topics in Logic and Philosophy. Selected Writings</em>], ed. J.\nSłupecki. Warsaw: PWN, 1961.</li>\n<li><em>Selected Works</em>, ed. L. Borkowski. Amsterdam:\nNorth-Holland, 1970.</li>\n<li><em>Logika i Metafizyka.</em> <em>Miscellanea</em>. [<em>Logic and\nMetaphysics. A Miscellany</em>], ed. J. J. Jadacki. Warsaw:\nTowarzystwo Naukowe Warszawskie, 1998.</li>\n<li><em>Pamiętnik</em>. [<em>Diary</em>], ed. J. J. Jadacki and\nP. Surma. Warsaw: Wydawnictwo Naukowe Semper, 2013. [Contains diary\nentries by Łukasiewicz and a number of incidental pieces of\nbiographical note by him and others.]</li>\n</ul>\n<h4>Monographs</h4>\n<ul class=\"hanging\">\n<li><em>O zasadzie sprzeczności u Arystotelesa, Studium\nkrytyczne.</em> [<em>On the Principle of Contradiction in Aristotle. A\nCritical Study.</em>] Kraków: Akademia Umiejętności,\n1910. 2nd ed., ed. J. Woleński, Warsaw: PWN, 1987. Translations:\n<em>Über den Satz vom Widerspruch bei Aristoteles</em>.\nHildesheim: Olms, 1993; <em>Del principio di contradizzione in\nAristotele</em>. Macerata: Quodlibet, 2003.</li>\n<li><em>Die logischen Grundlagen der Wahrscheinlichkeitsrechnung</em>.\nKraków: Spółka Wydawnicza Polska, 1913.\nTranslation: Logical Foundations of Probability Theory, in\n<em>SW</em>, 16–63.</li>\n<li><em>Elementy logiki matematycznej.</em> <em>Skrypt\nautoryzowany</em>, ed. M. Presburger. Warsaw: Wydawnictwo Koła\nMatematyczno-Fizycznego Słuchaczów Uniwersytetu\nWarszawskiego, 1929. 2nd ed., ed. J. Słupecki, Warsaw: PWN, 1958.\nTranslation: <em>Elements of Mathematical Logic</em>. Oxford: Pergamon\nPress, 1966.</li>\n<li><em>Aristotle’s Syllogistic from the Standpoint of Modern\nFormal Logic</em>. Oxford: Clarendon Press, 1951. 2nd, enlarged ed.,\n1957.</li>\n</ul>\n<h4>Papers</h4>\n<ul class=\"hanging\">\n<li>O indukcji jako inwersji dedukcji [On induction as the inversion\nof deduction]. <em>PF</em> 6 (1903), 9–24, 138–152.</li>\n<li>Analiza i konstrukcja pojęcia przyczyna. <em>PF</em> 9\n(1906), 105–179. Reprinted in <em>Z</em>, 9–62.\nTranslation: Analysis and construction of the concept of cause, in J.\nJadacki and E. Swiderski, eds., <em>The Concept of Causality in the\nLvov-Warsaw School. The Legacy of Jan Łukasiewicz</em>. Leiden:\nBrill, forthcoming.</li>\n<li>O zasadzie wyłączonego środka. <em>PF</em> 13\n(1910), 372–3. Translation: On the Principle of the Excluded\nMiddle. <em>History and Philosophy of Logic</em> 8 (1987),\n67–9.</li>\n<li>Über den Satz von Widerspruch bei Aristoteles. <em>Bulletin\ninternationale de l’Académie des Sciences de Cracovie,\nClasse de Philosophie</em> (1910), 15–38. Translation: On the\nPrinciple of Contradiction in Aristotle. <em>Review of\nMetaphysics</em> 24 (1970/71), 485–509; Aristotle on the Law of\nContradiction, in: J. Barnes, M. Schofield and R. Sorabji, eds.,\n<em>Articles on Aristotle 3. Metaphysics</em>. London: Duckworth,\n1979, 50–62.</li>\n<li>O twórczości w nauce, <em>Księga pamiątkowa\nku uczczeniu 250-tej rocznicy zalożenia Uniwersytetu Lwowskiego\nprzez Króla Jana Kazimierza r. 1661.</em> Lwów:\nUniwersytet Lwowski, 1912, 3–15. Translation: Creative elements\nin science, in <em>SW</em>, 1–15.</li>\n<li>W sprawie odwracalności stosunku racji i następstwa\n[Concerning the reversibility of the relation between reason and\nconsequence], <em>PF</em> 26 (1913), 298–314.</li>\n<li>O nauce i filozofii [On science and philosophy], <em>PF</em> 28\n(1915), 190–196.</li>\n<li>O pojęciu wielkości, <em>PF</em> 19 (1916), 1–70.\nTranslation: On the concept of magnitude. in <em>SW</em>,\n64–83.</li>\n<li>Treść wykładu pożegnalnego wygłoszonego w\nauli Uniwersytetu Warszawskiego 7 marca 1918 r. <em>Pro arte et\nstudio</em> 3 (1918), 3–4. Translation: Farewell lecture\ndelivered in the Warsaw University Lecture Hall on March 7, 1918, in\n<em>SW</em>, 84–6.</li>\n<li>O pojęciu możliwości, <em>RF</em> 5 (1920),\n169–170. Translation: On the concept of possibility, in\n<em>PL</em>, 15–16.</li>\n<li>O logice trójwartościowej, <em>RF</em> 5 (1920),\n170–1. Translation: On three-valued logic, in <em>PL</em>,\n16–18, and in <em>SW</em>, 87–8.</li>\n<li>Logika dwuwartościowa, <em>PF</em> 23 (1921), 189–205.\nTranslation: Two-valued logic, in <em>SW</em>, 89–109.</li>\n<li>Interpretacja liczbowa teorii zdań, <em>RF</em> 7 (1922/23),\n92–3. Translation: A numerical interpretation of the theory of\npropositions, in <em>SW</em>, 129–30.</li>\n<li>O logice stoikow [On Stoic logic], <em>PF</em> 30 (1927),\n278–9.</li>\n<li>O znaczeniu i potrzebach logiki matematycznej [On the importance\nand needs of mathematical logic], <em>Nauka Polska</em> 10 (1929),\n604–20.</li>\n<li>(with A. Tarski) Untersuchungen über den Aussagenkalkül,\n<em>Comptes rendus de la Société des Sciences et des\nLettres de Varsovie,</em> cl. iii, 23 (1930), 1–21. Translation:\nInvestigations into the Sentential Calculus, in <em>SW</em>,\n131–52.</li>\n<li>Philosophische Bemerkungen zu mehrwertigen Systemen des\nAussagenkalküls, <em>Comptes rendus de la Société\ndes Sciences et des Lettres de Varsovie,</em> cl. iii, 23 (1930),\n51–77. Translation: Philosophical remarks on many-valued systems\nof propositional logic, in <em>PL</em>, 40–65, and in\n<em>SW</em>, 153–78.</li>\n<li>Uwagi o aksjomacie Nicoda i “dedukcji\nuogólniającej”, <em>Księga pamiątkowa\nPolskiego Towarzystwa Filozoficznego,</em> Lwów, 1931,\n366–83. Translation: Comments on Nicod’s axiom and on\n“generalizing deduction”, in <em>SW</em>,\n179–96.</li>\n<li>Ein Vollstandigkeitsbeweis des zweiwertigen Aussagenkalküls,\n<em>Comptes rendus de la Société des Sciences et des\nLettres de Varsovie,</em> cl. iii, 24 (1931), 153–83.</li>\n<li>Z historii logiki zdań, <em>PF</em> 37 (1934), 417–37.\nTranslation: On the history of the logic of propositions, in\n<em>PL</em>, 66–87, and in <em>SW</em>, 197–217.</li>\n<li>Znaczenie analizy logicznej dla poznania [The importance of\nlogical analysis for cognition], <em>PF</em> 37 (1934),\n369–77.</li>\n<li>Bedeutung der logischen Analyse für die Erkenntnis, <em>Actes\ndu VIII Congrès International de Philosophie,</em> Prague\n(1936), 75–84.</li>\n<li>W obronie logistyki. <em>Myśl katolicka wobec logiki\nwspólczesnej</em>, <em>Studia Gnesnensia</em> 15 (1937),\n12–26. Translation: In defence of logistic, in <em>SW</em>,\n236–49.</li>\n<li>Kartezjusz [Descartes], <em>Kwartalnik Filozoficzny</em> 15\n(1938), 123–8.</li>\n<li>Geneza logiki trójwartościowej [The origins of\nthree-valued logic]. <em>Nauka Polska</em> 24 (1939).\n215–223.</li>\n<li>O sylogistyce Arystotelesa [On Aristotle’s syllogistic],\n<em>Sprawozdania PAU,</em> 44 (1939), 220–7. Published\n1946.</li>\n<li>Der Äquivalenzkalkül, <em>Collectanea logica</em> 1\n(1939), 145–69. Did not appear then. One offprint survived in\nMünster, and served for the translation: The Equivalential\nCalculus, in <em>PL</em>, 88–115, and in <em>SW</em>,\n250–77.</li>\n<li>Die Logik und das Grundlagenproblem, <em>Les entretiens de Zurich\nsur les fondements et la méthode des sciences\nmathématiques</em> 6–9.XII.1938, Zurich: Leemann, 1941,\n82–100.</li>\n<li>The shortest axiom of the implicational calculus of propositions,\n<em>Proceedings of the Royal Irish Academy,</em> Sect. A, 52 (1948),\n25–33.</li>\n<li>W sprawie aksjomatyki implikacyjnego rachunku zdań [On the\nsystem of axioms of the implicational prepositional calculus],\n<em>Annales de la Société Polonaise de\nMathématique</em> 22 (1950), 87–92.</li>\n<li>On Variable Functors of Propositional Arguments, <em>Proceedings\nof the Royal Irish Academy,</em> Sect. A, 54 (1951), 25–35.</li>\n<li>On the intuitionistic theory of deduction, <em>Indagationes\nMathematicae</em>. <em>Koninklijke Nederlandse Academie van\nWetenschappen, Proceedings</em> Series A 14(1952), 201–212,\nrepr. in <em>SW</em>, 325–40.</li>\n<li>Sur la formalisation des théories mathématiques.\n<em>Colloques internationaux du Centre National de la Recherche\nScientifique</em>, 36: Les méthodes formelles en axiomatique,\nParis, 1953, 11–19. Translation: Formalization of Mathematical\nTheories, in <em>SW</em>, 341–51.</li>\n<li>A System of Modal Logic, <em>The Journal of Computing\nSystems,</em> 1 (1953), 111–49, repr. in <em>SW</em>,\n352–90.</li>\n<li>Arithmetic and Modal Logic, <em>The Journal of Computing\nSystems,</em> 1 (1954), 213–9, repr. in <em>SW</em>,\n391–400.</li>\n<li>The principle of individuation, <em>Proceedings of the\nAristotelian Society,</em> supplementary volume XXVII (Berkeley and\nmodern problems) (1953), 69–82.</li>\n<li>On a controversial problem of Aristotle’s modal syllogistic,\n<em>Dominican Studies</em> 7 (1954), 114–28.</li>\n<li>Curriculum vitae [1953], <em>Philosophical Studies</em> 6 (1956),\n43–6.</li>\n<li>O determinizmie, in <em>Z</em>, 114–26. Translation: On\ndeterminism, in <em>PL</em> 19–39, and in <em>SW</em>,\n110–28.</li>\n</ul>\n<h4>Translation</h4>\n<ul class=\"hanging\">\n<li>David Hume, <em>Badania dotycące rozumu ludzkiego</em>\n[<em>An enquiry concerning human understanding</em>]; translation by\nJan L. Łukasiewicz and Kazimierz Twardowski, Lwów:\nNakładem Polskiego Towarzystwa Filozoficznego, 1905.</li>\n</ul>\n<h3><a id=\"SelSecLit\">Selected Secondary Literature</a></h3>\n<ul class=\"hanging\">\n<li>Agassi, A. and Woleński, J., 2010, “Łukasiewicz\nand Popper on Induction”, <em>History and Philosophy of\nLogic</em>, 31: 385–388. [Contains English translation of two\nsmall texts of Łukasiewicz on induction.]</li>\n<li>Betti, A., 2002, “The incomplete story of Łukasiewicz\nand bivalence”, in T. Childers (ed.), <em>The Logica 2002\nYearbook</em>, Prague: The Czech Academy of Sciences—Filosofia,\n21–36.</li>\n<li>Childers, T. and Majer, O., 1998, “On\nŁukasiewicz’s theory of probability”, in K.\nKijania-Placek and J. Woleński (eds.), <em>The Lvov-Warsaw School\nand Contemporary Philosophy</em>, Dordrecht: Kluwer,\n303–12.</li>\n<li>Corcoran, J., 1972, “Completeness of an Ancient\nLogic”, <em>Journal of Symbolic Logic</em>, 37:\n696–705.</li>\n<li>–––, 1974, “Aristotelian Syllogisms: Valid\nArguments or True Universalized Conditionals?”, <em>Mind</em>,\n83: 278–81.</li>\n<li>Font, J. P. and Hájek, P., 2002, “On\nŁukasiewicz’s Four-Valued Modal Logic”, <em>Studia\nLogica</em>, 70: 157–82.</li>\n<li>McCall, S. (ed.), 1967, <em>Polish Logic</em>\n<em>1920–1939</em>, Oxford: Clarendon Press.</li>\n<li>Malinowski, G., 1993, <em>Many-Valued Logics</em>, Oxford:\nClarendon Press.</li>\n<li>Meredith, C. A., 1951, “On an extended system of the\npropositional calculus”, <em>Proceedings of the Royal Irish\nAcademy</em>, 54 (Section A): 37–47.</li>\n<li>Meredith, C. A., 1953, “Single axioms for the systems\n(<em>C</em>,<em>N</em>), (<em>C</em>,0), and (<em>A</em>,<em>N</em>)\nof the two-valued propositional calculus”, <em>The Journal of\nComputing Systems</em>, 1: 155–164.</li>\n<li>Patzig, G., 1968. <em>Die aristotelische Syllogistik</em>,\nGöttingen: Vandenhoeck and Ruprecht, 3rd edition (1st edition,\n1959); translation by J. Barnes, <em>Aristotle’s Theory of the\nSyllogism</em>, Dordrecht: Reidel, 1969.</li>\n<li>Placek, T., 2006. “A Puzzle about Semantic Determinism:\nŁukasiewicz’s ‘On Determinism’ Years\nLater”, in J. Jadacki and J. Paśniczek (eds.), <em>The\nLvov-Warsaw School – The New Generation</em>, Amsterdam: Rodopi,\n171–185.</li>\n<li>Prior, A. N., 1954, “The Interpretation of Two Systems of\nModal Logic”, <em>The Journal of Computing Systems</em>, 1:\n201–8.</li>\n<li>Quine, W. V., 1953, “Three Grades of Modal\nInvolvement”, <em>Proceedings of the XIth International Congress\nof Philosophy</em> (Volume XIV), Brussels, pp. 80 ff.</li>\n<li>Schmidt am Busch, H.-C. and Wehmeier, K. F., 2007, “On the\nrelations between Heinrich Scholz and Jan Łukasiewicz”,\n<em>History and Philosophy of Logic</em>, 28: 67–81.</li>\n<li>Seddon, F., 1996, <em>Aristotle and Łukasiewicz on the\nPrinciple of Contradiction</em>, Ames: Modern Logic Publishing.</li>\n<li>Simons, P., 1992, “Łukasiewicz, Meinong, and\nMany-Valued Logic”, in K. Szaniawski (ed.), <em>The Vienna\nCircle and the Lvov-Warsaw School</em>, Dordrecht: Kluwer, 1989,\n249–91; reprinted in P. Simons, <em>Philosophy and Logic in\nCentral Europe from Bolzano to Tarski</em>. Dordrecht: Kluwer,\n193–225.</li>\n<li>Smiley, T. J., 1961, “On Łukasiewicz’s\nŁ-modal system”, <em>Notre Dame Journal of Formal\nLogic</em>, 2: 149–53.</li>\n<li>–––, 1974, “What is a Syllogism?”,\n<em>Journal of Philosophical Logic</em>, 2: 136–154.</li>\n<li>Sobociński, B., 1956, “In memoriam: Jan\nŁukasiewicz (1878–1956)” <em>Philosophical\nStudies</em>, 6: 3–49. [Includes as an appendix\nŁukasiewicz’s Curriculum Vitae of 1953.]</li>\n<li>Tarski, A., 1935/6, “Wahrscheinlichkeitslehre und\nmehrwertige Logik”, <em>Erkenntnis</em>, 5: 174–5.</li>\n<li>Wójcicki, R. and Malinowski, G. (eds.), 1977, <em>Selected\nPapers on Łukasiewicz’s Sentential Calculi</em>,\nWrocław: Ossolineum.</li>\n<li>Woleński, J., 1994, “Jan Łukasiewicz on the Liar\nParadox, Logical Consequence, Truth, and Induction”, <em>Modern\nLogic</em>, 4: 392–400.</li>\n<li>–––, 2000, “Jan Łukasiewicz und der\nSatz vom Widerspruch”, in N. Öffenberger and M. Skarica\n(eds.), <em>Beiträge zum Satz vom Widerspruch und zur\nAristotelischen Prädikationtheorie</em>, Hildesheim: Olms,\n1–42.</li>\n<li>–––, 2013, “The Rise of Many-Valued Logic\nin Poland”, in J. Woleński, <em>Historico-Philosophical\nEssays</em> (Volume 1), Kraków: Copernicus Press,\n37–50.</li>\n<li>Zinoviev, A. A., 1963, <em>Philosophical Problems of Many-Valued\nLogic</em>, Dordrecht: D. Reidel.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "logic: many-valued",
            "Lvov-Warsaw School",
            "Twardowski, Kazimierz"
        ],
        "entry_link": [
            {
                "../logic-manyvalued/": "logic: many-valued"
            },
            {
                "../lvov-warsaw/": "Lvov-Warsaw School"
            },
            {
                "../twardowski/": "Twardowski, Kazimierz"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lukasiewicz\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/lukasiewicz/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=lukasiewicz&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/lukasiewicz/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=lukasiewicz": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/lukasiewicz/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=lukasiewicz&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/lukasiewicz/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}