{
    "url": "marcuse",
    "title": "Herbert Marcuse",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Arnold Farr\n<arnold.farr@uky.edu>",
        "author_links": [
            {
                "mailto:arnold%2efarr%40uky%2eedu": "arnold.farr@uky.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nArnold Farr\n&lt;<a href=\"mailto:arnold%2efarr%40uky%2eedu\"><em>arnold<abbr title=\" dot \">.</abbr>farr<abbr title=\" at \">@</abbr>uky<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 18, 2013",
        "substantive revision Wed Apr 10, 2019"
    ],
    "preamble": "\n Herbert Marcuse (1898–1979) was one of the most prominent\nmembers of the Frankfurt School or The Institute for Social Research\n(Institute für Sozialforschung) in Frankfurt am Main. The\nFrankfurt School was formed in 1922 but went into exile in the United\nStates in the early 1930s during the reign of the Third\nReich. Although most of his colleagues returned to Germany after World\nWar II, Marcuse remained in the United States. \n\nThe Frankfurt School has had an enormous impact on philosophy as\nwell as social and political theory in the United States and around the\nworld. In the 1960s Marcuse ascended to prominence and became one\nof the best known philosophers and social theorists in the\nworld. He was often referred to as the Guru of the New Left (a\ntitle which he rejected). During the late 1970s through the\n1990s, Marcuse’s popularity began to wane as he was eclipsed by\nsecond and third generation critical theorists, postmodernism, Rawlsian\nliberalism, and his former colleagues Theodor Adorno and Walter\nBenjamin. In recent years there has been a new surge of interest\nin Marcuse.\n",
    "toc": [
        {
            "#Bio": "1. Biography"
        },
        {
            "#AesDim": "2. The Aesthetic Dimension"
        },
        {
            "#SeaForPhiFouForMarRadSub": "3. The Search for a Philosophical Foundation for Marxism and the Radical Subject"
        },
        {
            "#PheMar": "3.1 Phenomenological Marxism"
        },
        {
            "#PhiAntRadSub": "3.2 Philosophical Anthropology and Radical Subjectivity"
        },
        {
            "#NegDiaThiSocCha": "3.3 Negative (Dialectical) Thinking and Social Change"
        },
        {
            "#PsyUtoVis": "4. Psychoanalysis and Utopian Vision"
        },
        {
            "#HisSocNatHumDri": "4.1 The Historical and Social Nature of Human Drives"
        },
        {
            "#Rep": "4.2  Repression"
        },
        {
            "#EroLog": "4.3  Eros and Logos"
        },
        {
            "#IdeSca": "4.4 The Ideology of Scarcity"
        },
        {
            "#FanUtoRatGra": "4.5  Fantasy, Utopia, and the Rationality of Gratification"
        },
        {
            "#OneDimThiDemRejDem": "5. One-Dimensional Thinking and the Democratic Rejection of Democracy"
        },
        {
            "#DiaTec": "6. The Dialectic of Technology"
        },
        {
            "#SpeLibGreRefNewSen": "7. The Specter of Liberation: The Great Refusal and the New Sensibility "
        },
        {
            "#MarFem": "8. Marcuse and Feminism"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#OthWorCit": "Other Works Cited"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Biography\n\n\nHerbert Marcuse was born on July 19, 1898 in Berlin. His mother was\nborn Gertrud Kreslawsky and his father was a well-off businessman,\nCarl Marcuse. According to Marcuse, his childhood was that of a\ntypical German upper-middle class youth whose Jewish family was well\nintegrated into German society (Kellner 1984: 13). Marcuse’s\nformal education began at the Mommsen Gymnasium and continued at the\nKaiserin-Augusta Gymnasium in Charlottenburg from 1911–1916. In\n1916 Marcuse was called to military service. It was in the military\nwhere his political education began, although during this period his\npolitical involvement was brief. The experience of war and the German\nRevolution led Marcuse to a study of Marxism as he tried to understand\n“the dynamics of capitalism and imperialism, as well as the\nfailure of the German Revolution” (Kellner 1984: 17). Marcuse\nalso wanted to learn more about socialism and the Marxian theory of\nrevolution so that he may understand his own inability to identify\nwith any of the major Left parties at that time (Kellner 1984: 17).\nHowever, this study of Marxism would be brief. In 1918 Marcuse was\nreleased from military service.\n\nIn 1919 he entered Humboldt University in Berlin and took courses for\nfour semesters. In 1920 he transferred to Freiburg to concentrate on\nGerman literature and to take courses in philosophy, politics, and\neconomics. This period of study culminated in a doctoral dissertation\nentitled Der deutsche Künstlerroman (The German\nArtist-Novel), which was accepted in 1922 (Kellner 1984: 18). This\nwork would be the first in a life-long engagement with aesthetics for\nMarcuse. \n After the acceptance of his dissertation Marcuse returned to\nBerlin where “his father provided him with an apartment and a\nshare in a publishing and antiquarian book business”\n(Wiggershaus 1994: 96). Marcuse worked mainly as a catalogue researcher\nand bibliographer, and published a Schiller bibliography in 1925\n(Kellner 1984: 32–33). In 1924 Marcuse married his first wife,\nSophie.\n\nWhile in Berlin, Marcuse began reading Martin Heidegger’s newly\npublished Being and Time with a friend in 1927. Although\nMarcuse was already a student of philosophy, his interest in\nphilosophy had remained second to his interest in German literature up\nto this point. The excitement caused by Being and Time would\nlead Marcuse to a life-long serious engagement with philosophy.\nAccording to Douglas Kellner, this move from a primary concern with\nart to a deeper engagement with philosophy suggests that Marcuse was a\nbit skeptical about the power of art as a “cognitive source of\nknowledge and as an instrument of personal liberation and social\nchange” (Kellner 1984: 36–37). The impact of Heidegger was\nso great that Marcuse returned to Freiburg in 1928 to study philosophy\nwith Heidegger and Edmund Husserl. While in Freiburg Marcuse worked as\nHeidegger’s assistant and began work on his second dissertation,\nHegel’s Ontologie und die Grundlegung einer Theorie der\nGeschichtlichkeit (Hegel’s Ontology and the Theory of\nHistoricity) (1932 [1987]). Although this dissertation was never\napproved by Heidegger (and according to Marcuse, perhaps not read), it\nwas published in 1932.\n In 1932 Marcuse and Heidegger parted ways due to the\nlatter’s developing interest in National Socialism, although\nHeidegger didn’t officially join the Nazi Party until 1933. As\nthe Nazis soared to power and anti-Semitism began to spread, it became\nclear to Marcuse that he “would never be able to qualify for a\nprofessorship under the Nazi regime” (Kellner 1984: 92). Given\nhis situation, Marcuse began to inquire about employment with the\nInstitute for Social Research in Frankfurt. After an interview, a\nletter of support from Edmund Husserl, and a word of support from a\nmember of the Institute (Leo Lowenthal), Marcuse was hired\n(Wiggershaus 1994: 104; Kellner 1984: 92)\n Due to Nazi activity, Marcuse never actually worked in\nFrankfurt. Anticipating the fascist takeover, the Institute deposited\ntheir endowment in Holland. A branch office was established in Geneva\nwhere Marcuse began his work with the Institute. He would go to Paris\nfor a short time and then finally in July 1934 to New York. From\n1934–1942 Marcuse worked at the Institute’s branch at\nColumbia University. In 1942 he moved to Washington D.C. to work first\nwith the Office of War Information and then with the Office of\nStrategic Services. Later Marcuse would teach at Brandeis University\nand then the University of California, San Diego. He became a United\nStates citizen in 1940 and remained in the United States until his\ndeath in 1979.\n2. The Aesthetic Dimension\n\n\nThe bookends of Marcuse’s literary, philosophical, and political\nlife are works on aesthetics. In 1922 he completed a doctoral\ndissertation entitled Der deutsche Künstlerroman\n(The German Artist-Novel). In 1978, one year before his death\nhe published The Aesthetic Dimension: Toward A Critique of Marxist\nAesthetics. Between these two works are several smaller works on\naesthetics. However, even the works that do not deal directly with\naesthetics still contain (we might say) an aesthetic dimension. It is\nnot possible to discuss the role of aesthetics in all of\nMarcuse’s works. Therefore, the role of aesthetics in\nMarcuse’s critical theory in general will be discussed. There\nare three key works on aesthetics which were written at different\ntimes that reveal the overall point of Marcuse’s aesthetic\ntheory. \n Even in his youth, Marcuse had a love for the classics of German\nand world literature (Marcuse 2007a: 4). After serving military duty\nand after his brief period of political engagement Marcuse returned to\nhis literary studies. However, in the aftermath of his reading of\nMarxism, Marcuse’s literary studies had a decisive political\norientation. He was interested in the revolutionary and transformative\nfunction of art. \n\nThis turn to art and literature was a return to an earlier love with a\nnew mission. This new mission was of course inspired by his encounter\nwith Marxism and the crisis of Marxism. The turn toward literature was\nalso a quest for revolutionary subjectivity. Put another way, from the\nbeginning to the end of his literary career Marcuse looked for spaces\nof a critical consciousness that had not been completely whittled down\nby the oppressive and repressive forces of capitalism. Revolution and\nsocial change demands a space for thought and action that make\nresistance to the status quo possible. Well before he began\nto use the term “the Great Refusal”, he was in search of\nsuch.\n\nIn his dissertation of 1922, The German Artist-Novel, the\nartist represents a form of radical subjectivity. Marcuse makes a\ndistinction between epic poetry and the novel in this work. Epic\npoetry deals with the origin and development of a people and culture\nwhile the novel does not focus on the form of life of a people and\ntheir development, but rather, on a sense of longing and striving\n(Marcuse 2007a: 72). The novel indicates alienation from social\nlife. The details of Marcuse’s argument will not be addressed\nhere. The point is to show that there is a certain orientation of\nthought in Marcuse’s 1922 dissertation that is motivated by his\nencounter with Marxism and will stay with him as his project becomes\nmore philosophical. In short, the artist experiences a gap between the\nideal and the real. This ability to entertain, at least theoretically,\nan ideal form of existence for humanity, while at the same time living\nin far less than ideal conditions, produces a sense of alienation in\nthe artist. This alienation becomes the catalyst for social\nchange. This function of art stays with Marcuse and will be developed\nfurther as he engages with psychoanalysis and philosophy.\n\nAs a dialectical thinker, Marcuse was also able to see both sides of\nthe coin. That is, while art embodied revolutionary potential, it\nwas also produced, interpreted, and distributed in a repressive\nsociety. In an oppressive/repressive society the forces of\nliberation and the forces of domination do not develop in isolation\nfrom each other. Instead, they develop in a dialectical\nrelationship where one produces the conditions for the other. \nThis can be seen throughout almost all of Marcuse’s writings and\nwill be pointed out at different points in this essay. The task\nhere is to take a look at how this dialectic of liberation and\ndomination occurs within the context of Marcuse’s aesthetic\ntheory. This should not be taken to mean that there will never be\na point in time when human beings are liberated from the forces of\ndomination. This simply means that if an individual group seeks\nliberation, their analysis or critique of society must come to terms\nwith how things actually work at that moment in that society if any\nform of liberation is possible. As Marcuse saw it, there is a\nform of ideology that serves domination and creates the conditions for\nliberation at the same time. This will be discussed later. \nAlso, there is a form of liberation that lends itself to be co-opted by\nthe forces of domination.   \n Just as art embodied the potential for liberation and the\nformation of radical subjectivity, it was also capable of being taken\nup by systems of domination and used to further or maintain\ndomination.  This is the theme of Marcuse’s 1937 essay\n“The Affirmative Character of Culture”. Culture, which is\nthe domain of art, develops in tension with the overall structure of a\ngiven society. The values and ideals produced by culture call for the\ntranscending of oppressive social reality. Culture separates itself\nfrom the social order. That is, the social realm or civilization is\ncharacterized by labor, the working day, the realm of necessity,\noperational thought, etc. (Marcuse 1965: 16). This is the realm of real\nmaterial and social relations as well as the struggle for\nexistence. The cultural realm or civilization is characterized by\nintellectual work, leisure, non-operational thought, and freedom\n(Marcuse 1965: 16). The freedom to think and reflect that is made\npossible at the level of culture makes it possible to construct values\nand ideals that pose a challenge to the social order. This is the\nemancipatory function of art. However, art itself does not bring about\nliberation; it must be translated into political\nactivity. Nevertheless, art is important because it opens up the space\nfor thinking that may then produce revolution. \n\nThe separation between culture and society does not suggest a flight\nfrom social reality. Instead, it represents an alien or critical\nspace within social reality. The ideals produced by culture must\nwork within society as transformative ideas. In “The\nAffirmative Character of Culture”, Marcuse, in good dialectical\nfashion, shows how culture separates itself from society or\ncivilization and creates the space for critical thought and social\nchange but then succumbs to the oppressive demands of bourgeois\nsociety. It does this by “separating ‘culture’\nfrom the everyday world” (Marcuse 2007a: 23). In\naffirmative culture art becomes the object of spiritual\ncontemplation. The demand for happiness in the real world is\nabandoned for an internal form of happiness, the happiness of the\nsoul. Hence, bourgeois culture creates an interior of the human\nbeing where the highest ideals of culture can be realized. This\ninner transformation does not demand an external transformation of the\nreal world and its material conditions. \n\nIn such a society the cultivation of the soul becomes an important\npart of one’s education. The belief that the soul is more\nimportant than the body and material needs leads to political\nresignation insofar as freedom becomes internal. “The soul takes\nflight at the hard truth of theory, which points up the necessity of\nchanging as impoverished form of existence” (Marcuse 2007b:\n222). Hence, the soul accepts the facts of its material existence\nwithout fighting to change these facts. Affirmative culture with its\nidea of the soul has used art to erase radical subjectivity. \n\nIn his last book The Aesthetic Dimension (1978), Marcuse\ncontinues his attempt to rescue the radical transformative nature of\nart. In this text he takes a polemical stance against the problematic\ninterpretation of the function of art by orthodox Marxists. These\nMarxists claimed that only proletarian art could be\nrevolutionary. Marcuse attempts to establish the revolutionary\npotential of all art by establishing the autonomy of authentic\nart. Marcuse states: “It seems that art as art expresses a\ntruth, an experience, a necessity which, although not in the domain of\nradical praxis, are nevertheless essential components of\nrevolution” (Marcuse 1978: 1). It is the experience that art\ntries to express that Marcuse will focus on and it is this which\nseparates him from orthodox Marxists. \n It must be remembered that for Marcuse and the Frankfurt School\nthere was no evidence that the proletariat would rise up against their\noppressors. In addition to developing theories that disclosed the\nsocial and psychological mechanisms at work in society that made the\nproletariat complicit in their own domination, Marcuse saw\npossibilities for revolution in multiple places. Some of this will be\ndiscussed later. The student revolts of the 1960s confirmed much of\nthe direction of Marcuse’s critical theory from early on. That\nis, the need for social change includes class struggle but cannot be\nreduced to class struggle. There is a multiplicity of social groups in\nour society that seek social change for various reasons. There are\nmultiple forms of oppression and repression that make revolution\ndesirable. Hence, the form of art produced, and its revolutionary\nvision, may be determined by a multiplicity of oppressed/repressed\nsubject positions. \n\nOrthodox Marxism focused on the proletariat by excluding all other\npossible sites for revolution. For this reason, orthodox Marxism\nitself becomes a form of ideology and produces a reified state of\naffairs. In orthodox Marxist aesthetics\n\n The subjectivity of individuals, their own consciousness and\nunconscious tends to be dissolved into class consciousness. Thereby, a\nmajor prerequisite of revolution is minimized, namely, the fact that\nthe need for radical change must be rooted in the subjectivity of\nindividuals themselves, in their intelligence, and their passions,\ntheir drives and their goals. (Marcuse 1978: 3–4)\n\n In orthodox Marxism, radical subjectivity was reduced to one\nsocial group, the proletariat. Marcuse greatly expands the space\nwhere radical subjectivity can emerge. Marcuse argues that\n“liberating subjectivity constitutes itself in the inner history\nof the individuals” (Marcuse 1978: 5). Each subject as distinct\nfrom other subjects represents a particular subject position. For\nexample; white female, working class, mother of two, born in the\nmid-west, etc. However, with each distinct feature of the individual\nsubject corresponds a structural position. That is, in a given society,\ngender, race, class, level of education etc., are interpreted in\ncertain ways. Experiences and the opportunities provided by them are\noften affected by subject and structural position and produce what\nMarcuse calls “the inner history of the individual”\n(Marcuse 1978: 5). \n\nGiven that there are many subject positions that are positions of\nrepression and dehumanization, radical subjectivity and art may come\nfrom any of these positions. Economic class is just one structural\nposition among many. Hence, it is not only the proletariat who may\nhave an interest in social change.\n        \n3. The Search for a Philosophical Foundation for Marxism and the Radical Subject\n3.1 Phenomenological Marxism\n\n\nInspired by his reading of Heidegger’s Being and\nTime, and having already been influenced by Marxism during his\nmilitary days, Marcuse went to Freiberg to study with Heidegger in\n1928. Between 1928 and 1932 he attempted to develop what has been\ncalled Heideggerian or phenomenological Marxism. This project was\nMarcuse’s response to what has been called the “crisis of\nMarxism.” \n\nBy the early twentieth century it appeared to be the case that\nthe proletarian revolution predicted by Marx was not going to\nhappen. Europe had witnessed several failed attempts at a\nrevolution. The Bolshevik Revolution of 1917 was not lead by the\nproletariat and it simply produced a different form of\ntotalitarianism.\n\n Marcuse undoubtedly accepted Rosa Luxemburg’s trenchant\ncritique of the authoritarian implications of Lenin’s\nvanguardism. In fact, most European socialists viewed Lenin’s\nvoluntarism as inappropriate for Western and Central Europe, where a\nmore advanced and experienced proletariat existed. (Wolin 2005: xiv)\n\n\nThis situation produced the political crisis of Marxism.\n\nThe political crisis of Marxism was entangled with its\nepistemological crisis (Wolin 2005: xiv). The\nepistemological crisis was the result of the scientific reductionism\nof Marxism which was encouraged by Engels and Karl Kautsky (Marcuse\n2005: xiv). So-called scientific Marxism is a non-philosophical,\nmechanistic form of Marxist theory that teaches the inevitable,\nautomatic collapse of capitalism. This form of theory ends up being\nnon-revolutionary to the extent that the “subjective factor of\nworking class consciousness is down played” (Marcuse\n2005: xiv). The Second International produced a form of positivism that\neliminated the dialectical approach of Marxism and erased the role of\nhuman subjectivity. That is, if the collapse of capitalism was\ninevitable because of the effects of certain natural laws and not due\nto the conscious, intentional efforts of the proletariat, then there\nis no need to work toward the development of revolutionary\nconsciousness. \n Marcuse’s entire project can be seen as an attempt to rescue\nradical, socially transformative subjectivity. He gravitates toward\nMarxism because Marxism is an attempt to rescue subjectivity or\nhumanity from the reifying, oppressive forces of capitalism.\nUnfortunately, the Marxism of the Second International also erased\nhuman subjectivity as this form of Marxism became mechanistic in\nnature. It is in this context, where subjectivity and human agency are\nbeing whittled down, that Marcuse turns to Heidegger for a possible\nsolution. Marcuse saw in Marx and Heidegger “a demand for\nradical action” (Wolin 2001: 146). \n\n\nFor Marx, it took the form of “praxis,”\n“revolutionary, practical-critical activity.” On the basis\nof authentic temporality, Dasein, too, demanded a radical\nresponse to the realities of alienated social existence. (Wolin 2001: 147)\n\nFor Marcuse, radical action was needed to overcome the oppressive,\nrepressive, and reified structure of advanced industrial society. He\nsaw common ground between Marx and Heidegger regarding this\nproblem. At this point in his career, Marcuse read the oppressive\nstructure of advanced industrial society through three lenses, the\nMarxian lens of alienation, The Lukácsian lens of reification,\nand the Heideggerian lens of inauthenticity. Although Marx’s\n1844 Manuscripts which includes a discussion of alienation\nwere not yet available to Marcuse when he went to Freiburg,\nMarx’s theory of alienation is implicit in various places in\nvolume one of Capital where he discusses the reduction of\nsocial relations between persons to the relations between things while\nthe relations between things are treated as social relations.\n\n\nThus, Marcuse believed that Heidegger’s Being and Time\nrepresented a potentially valuable ally in the struggle against the\nreified social continuum of advanced industrial society. He\nconjectured that Heidegger’s philosophy of existence possessed\nthe conceptual means required to counteract an inverted social world\nin which, according to Marx, “social relations between men\nassume…the fantastic form of a relation between\nthings.” In part, Marcuse read Heidegger’s philosophy\nas an ontologically veiled critique of reification: an\nindictment of the way in which oppressive social circumstances\nmilitate against the possibility of human self-realization. It seemed\nthat, like the critical Marxists Lukács and Korsch, Heidegger\nstrove to surmount the fetishization of appearances that characterized\nthe shadow-world of bourgeois immediacy. Like Lukács and\nKorsch, in Being and Time Heidegger strove concertedly to\nbreak with the deterministic worldview of bourgeois science, in which\nhuman being or Dasein was degraded to the status of a\n”thing among things.“ After all, this was the main point\nbehind Heidegger’s critique of Vorhandenheit or being\npresent-at-hand as a mode of inauthenticity. (Wolin 2005:\nxiv–xv). \n\nMarcuse’s reading of Marx, Heidegger, Lukács, Korsch, and\neven Max Weber is based on his quest for radical or revolutionary\nsubjectivity. Like Horkheimer and Adorno, Marcuse saw western\nsociety as moving in the direction of a totally administered\nsociety. His later notion of one-dimensionality was developed\nvia his critique of such a society. However, he\neventually became disillusioned with Heidegger.\n\nEven while under Heidegger’s influence Marcuse was never a mere\nHeideggerian. He recognized early on that Heidegger’s philosophy\nhad certain limitations. He would eventually discover that\nHeidegger’s philosophy was not all that concrete. While\nHeidegger’s philosophy explicated the ontological structure of\nDasein in its everydayness, it never dwelled at the ontic\nlevel. At the ontological level Heidegger merely examined the\nfundamental structures of Dasein. That is, Dasein in\ngeneral carries out its life within a certain universal structure\nwhich is constituted by modes of existence such as fallenness, idle\ntalk, boredom, care, being toward death, etc. What has been disclosed\nhere are mere universal conditions or modes of existence in which\nDasein happens and experiences happenings. However, these\nmodes of existence are experienced in different ways, at different\ntimes, and with different levels of intensity by different\nindividuals. \n\nAt the end of the day, Marcuse sees that Heidegger avoids the type of\nanalyses that would reveal systems of oppression and domination from\nwhich many human beings suffer. The modes of existence for\nDasein have a social, historical, and political context that\nshape the way they are experienced. For example, Dasein has a\nrace, gender, class, etc. These particular features come with specific\nsocial interpretations which affect Dasein’s\nlife’s prospects. According to Marcuse, Heidegger’s\nDasein is a sociologically and biologically neutral category\n(Marcuse 2005b: 167). Heidegger gives no account of the multiple forms\nof oppression and domination present in advanced industrial societies\nnor the way that individuals respond to these forms of oppression and\ndomination. In a 1977 interview conducted by Frederick A. Olafson,\nMarcuse raises the following criticism of Heidegger:\n\n\nHow does the individual situate himself and see himself in\ncapitalism—at a certain stage of capitalism, under socialism, as\na member of this or that class, and so on? This entire dimension is\nabsent. To be sure, Dasein is constituted in historicity, but\nHeidegger focuses on individuals purged of the hidden and not so\nhidden injuries of their class, their work, their recreation, purged\nof the injuries they suffer from their society. There is no trace of\nthe daily rebellion, of the striving for liberation. The Man\n(the anonymous anyone) is no substitute for the social reality\n(Marcuse 2005b: 169) \n\n Hence, Heidegger’s concrete philosophy is not so concrete as\nhe defines human beings and their historicity in such a way that omits\nthe real, concrete struggles in which social actors find\nthemselves. In the same interview quoted above, Marcuse claims that he\nand others realized that “Heidegger’s concreteness was to\na great extent a phony, false concreteness,” removed from\nreality (Marcuse 2005b: 166)\n\nWe can see now that the very thing that drew Marcuse to\nHeidegger’s philosophy was missing. Heidegger’s philosophy\nfailed to provide Marcuse with a concrete philosophical foundation for\nMarxism as well as a theory of the radical act or radical\nsubjectivity. Heidegger’s interest with Nazism made it easy for\nMarcuse to leave Heidegger in 1932. This move was also made easy by\nthe publication of Marx’s 1844 Manuscripts first\npublished in 1932. \n Although Marcuse breaks with Heidegger in 1932, for some scholars\nthe break is not all that clear. Martin Jay claims that when Marcuse\njoined the Institute, the influence of Horkheimer was so great that\nMarcuse “abandoned Heidegger’s vocabulary, as the impact\nof phenomenology on his thinking began to recede” (Jay\n1973: 76). However, in a letter to Horkheimer on May 13, 1935, Adorno\nstrongly suggests that Marcuse was still a Heideggerian\n(Marcuse/Kellner 1998: 16 n.22). One must, however, maintain some level\nof suspicion of Adorno’s claim since he and Marcuse were engaged\nin competition for Horkheimer’s favor. Nevertheless, the\nquestion of Marcuse’s Heideggerianism is still of interests for\nMarcuse scholars. For example, Richard Wolin writes: “In\nMarcuse’s postwar writings, the Heideggerian dimension is muted\nbut nevertheless traceable” (Wolin 2001: 167). \n\nDoes Marcuse continue to employ Heideggerian ideas in a new language?\nIs Marcuse’s critique of one-dimensionality nothing more than a\nHeideggerian critique of inauthenticity? Both terms refer to “a\nmass society of blind conformity” (Wolin 2001: 168). Wolin also\nraises the question of parallels between Heidegger’s ontological\nelitism and Marcuse’s notion of an “educational\ndictatorship” (Wolin 2001: 172). The issue of an educational\ndictatorship occurs in Eros and Civilization (1955) as well\nas in “Repressive Tolerance” (1965) and reflects\nMarcuse’s pessimism about the development of radical\nconsciousness in the working class. The problem of some form of\nintellectual elitism is not only found in Heidegger but in Marxism\nitself. One need only think about Lenin’s notion of the\nVanguard. However, whether the source be Heidegger or certain\nMarxists, the wave toward elitism, in one form or another, remains a\nproblem in Marcuse’s work.  \n3.2 Philosophical Anthropology and Radical Subjectivity\n\n\nIn 1932 Marcuse published one of the first reviews of the newly\npublished 1844 Manuscripts entitled “Neue Quellen zur\nGrundlegung des historischen Materialismus” (New Sources on the\nFoundation of Historical Materialism). According to Marcuse, the\n1844 Manuscripts had the possibility to accomplish two things.\n\n\nThese manuscripts could put the discussion about the origins and\noriginal meaning of historical materialism, and the entire theory of\n“scientific socialism,” on a new footing. They also\nmake it possible to pose the question of the actual connections between\nMarx and Hegel in a more fruitful way. (Wolin 2001: 86)\n\n\nHowever, these manuscripts also provided Marcuse with the necessary\ntheoretical tools needed for developing a critical, philosophical\nanthropology that would aid him in the development of his own brand of\ncritical theory.\n\nIn this context, “anthropology” does not refer to the\nstudy of past cultures, as it often does in the United\nStates. Instead, it refers to the German idea of anthropology which is\nmore of a philosophical and social scientific examination of human\nnature.  The 1844 Manuscripts are important for Marcuse\nbecause in them Marx provides a philosophical foundation for his later\ncritique of political economy as well as an action-theoretic,\nphilosophical anthropology. Philosophical categories such as labor,\nobjectification, alienation, sublation, property, and others all\nexplored in Hegel’s philosophy were scrutinized dialectically by\nMarx (Kellner 1984: 79). \n\nIn a nutshell, what Marcuse sees in the 1844 Manuscripts is\nan analysis of the social conditions for a communist revolution. \nThe revolution itself requires the development of radical\nsubjectivity. Radical subjectivity refers to the development of a\nform of self-consciousness that finds present social and economic\nconditions intolerable. The radical act is a refusal of these\nconditions and an orientation toward social transformation. To make\nsense of Marcuse’s position we must ask: what are these\nintolerable conditions and how are they produced? Philosophical\nanthropology and radical subjectivity are connected here insofar as the\nintolerable conditions that must be overcome by revolution or the\nradical act represent social distortions of the human essence. It\nis Marx and Hegel who provided Marcuse with a philosophical\nanthropology that discloses human essence and the social mechanisms by\nwhich it is distorted. The key category here is that of\n“alienation” which cannot be understood without examining\nthe role of labor and objectification.\n\nAccording to Marcuse, Hegel, and Marx, human beings develop through\na self-formative process wherein the external world (nature) is\nappropriated and transformed according to human needs. Labor is\none of the main areas for this self-formative activity. The idea\nthat labor is an essential part of a self-formative process is what\ndistinguishes Marx from the classical economists such as Smith,\nRicardo, etc. In classical economics, labor is simply the means\nby which individuals make provisions for themselves and their\nfamilies. In these theories labor is not viewed as that activity\nby which the human subject is constituted. The Marxian view of\nlabor as a self-formative process is what makes possible the Marxian\ntheory of alienation and revolution.\n\nMarcuse argues that in the 1844 Manuscripts Marx shows how\nthe role of labor as a self-realization or self-formative process gets\ninverted. Instead of having his or her subjectivity affirmed, the\nindividual becomes an object that is now shaped by external, alien\nforces. Hence, Marx’s theory makes a transition from an\nexamination of the self-formative process of labor to a critique of the\nforms of alienation caused by the historical facticity of capitalism.\nWithin the historical facticity of capitalism\n\n\nthis fact appears as the total inversion and concealment of what\ncritique had defined as the essence of man and human labor. Labor is\nnot “free activity” or the universal and free\nself-realization of man, but his enslavement and loss of reality. The\nworker is not man in the totality of his life-expression, but\nsomething unessential [ein Unwesen], the purely physical\nsubject of “abstract” activity. The objects of labor are\nnot expressions and confirmations of the human reality of the worker,\nbut alien things, belonging to someone other than the\nworker—“commodities.” (Marcuse 2005b: 104)\n\nMarcuse will spend the rest of his life carrying out the\ninvestigations started in these early works. What distinguishes his\nproject from Marx’s is the way in which each will deal with the\nproblem of concealment mentioned in the above quote. Marx will\ndevelop two different but related approaches. His critique of\npolitical economy is an attempt to disclose the inner logic of\ncapitalism (how it works) as well as the contradictions that will lead\nto the collapse of capitalism. The second approach is to work out\na theory of revolution which presupposes the awakening of\nself-consciousness in the working class. In both approaches\nconcealment will give way to disclosure and social\ntransformation. We saw earlier that Marx’s predictions did\nnot come true on either account. This failure in part led to what\nhas been called the crisis of Marxism to which the birth of the\nFrankfurt School was a response. Marcuse’s work will go\nthrough many phases as he tries to unlock the key to revolutionary\naction. The next key move for him is to engage in a deeper study\nof Hegel as a source for critical social theory.\n3.3 Negative (Dialectical) Thinking and Social Change\n\n\nIn 1941 Marcuse’s studies of Marx and Hegel culminated in a book\nentitled Reason and Revolution: Hegel and the Rise of Social\nTheory (1941 [1983]). This book accomplished several\nthings. First, it disclosed the role of Hegel’s most critical,\nrevolutionary, and emancipatory concepts in the development of\nMarx’s critical philosophy. Secondly, it rescued Hegel from the\ncharge that his social and political philosophy was conservative and\nlegitimated the oppressive Prussian state. The third great\naccomplishment, or at least goal, embodies the first two\naccomplishments and is perhaps the most important for the formation of\nMarcuse’s form of critical theory. The Hegelian/Marxian notion\nof dialectic or what Marcuse will call negative thinking becomes a\ncentral element in Marcuse’s critical theory. In part,\nReason and Revolution is not an attempt to rescue Hegel, but\nrather, an attempt to rescue dialectical or negative thinking. Marcuse\nmakes this clear in a new preface to the 1960 edition of the book. The\nnew preface entitled “A Note on Dialectic” can actually\nstand on its own as a guide to reading and understanding Marcuse.\nMarcuse begins with the claim that this book is an attempt to rescue a\nform of thinking or a mental faculty which is in danger of being\nobliterated (Marcuse 1960: vii).\n\n\nThe purpose of dialectical or negative thinking is to expose and then\novercome by revolutionary action the contradictions by which advanced\nindustrial societies are constituted. The problem of concealment\noccurs here because not only does society produce contradictions and\nthe forms of domination that come with them, but also produces the\nsocial and psychological mechanisms that conceal these\ncontradictions. An example of a social contradiction is the\nco-existence of the growth of national wealth and poverty at the same\ntime. Those who own, control, and influence the means of production\n(the minority) grow richer while the workers (the minority) grow\npoorer. The idea that the unbridled attempt by the rich to become\nricher will somehow allow their wealth to trickle down so that all\nwill benefit has been proven false as the gap between the rich and\npoor continues to grow. However, the trickle down ideology is still\nvery effective. The capitalist belief that unbridled competition is\ngood for everyone conceals the goal of purging society of competition\nby allowing large corporations to buy out their competition.\n\nIn this situation, the worker does not become a free and rational\nsubject through her labor, but rather, an object to be used by the\neconomic system, a system that is a human creation, but over which the\nworker has no control. In the capitalist system, the worker is used as\nan object for the sake of production while not reaping the full\nbenefits of production. In such a situation the worker is not able to\nactualize his or her potential as a free and rational human being but\nis instead reduced to a life of toil for the sake of survival. The\nexistence of the worker erases her essence. The task of dialectical\nthinking is to bring this situation to consciousness. Once this\nsituation is brought to consciousness it can be resolved through\nrevolutionary practice. Thus, Kellner writes:\n\n The central concepts presented are precisely those of the\nbook’s title, “reason” and\n“revolution”. Reason distinguishes between existence and\nessence through conceptualizing unrealized potentialities, norms and\nideals that are to be realized in social practice. If social\nconditions prevent their realization, reason calls for\nrevolution. (Kellner 1984: 131) \n\nMarcuse’s concept of essence is not transcendental but\nhistorical. That is, there is no human essence apart from\nhistorical context. Within the context of historical happening,\nwithin material existence, what the human being could potentially be is\nalready present. For example, it seems logical to assert that no\nhuman being would want to spend his or her entire life engaged in\nalienating labor just to remain in poverty. Nevertheless, this is\nprecisely the situation in which many human beings find\nthemselves. However, essence is embedded in this historical\nappearance insofar as the potential for the worker to be free from\nexploitation and alienating toil is present as a real possibility that\nneed only be actualized. In the society wherein the worker works\nthere is enough wealth (produced by the worker) to free the worker of\nendless toil. In an essay entitled “The Concept of\nEssence” Marcuse writes: “Materialist theory thus\ntranscends the given state of fact and moves toward a different\npotentiality, proceeding from immediate appearance to the essence that\nappears in it. But here appearance and essence become members of\na real antithesis arising from the particular historical structure of\nthe social process of life” (Marcuse 1968b: 67). \n\nThe above passage is crucial for understanding the theme of\nReason and Revolution and Marcuse’s famous later work\nOne-Dimensional Man (1964) (which will be discussed later). His\nconcept of essence is not static or transcendental. Essence\npresents itself as the possibility of a free non-alienating,\nnon-repressive form of life within a particular historical,\nsocial/political structure. Appearance (the present order of\nthings) is in contradiction to the very possibilities that are produced\nby the present social reality. For example, the capitalist mode\nof production has made it possible for all members of our society to\nlive non-alienating and fruitful lives. However, many are still\nin poverty. Dialectical or negative thinking sees this\ncontradiction and attempts to negate such circumstances. \n The concept of negation is best understood by distinguishing\nbetween two levels of negation in capitalist societies. The concept of\nnegation employed by Marcuse is actually a critical response to a\nprior form of negation. This prior form of negation will be referred\nto as negation1 and the response to it as negation2. Negation1 is the\nnegation of human essence or freedom by an oppressive, repressive\nsocio/economic system. Here the potential for liberation,\nself-development, self-determination, the good life, etc. are all\nerased by various forms of domination. Hence, the human individual is\nnegated. Negation2 refers to the development of critical,\nrevolutionary consciousness that seeks to negate these oppressive\nsocial structures. The goal of negation2 is liberation (Farr 2009: 85–86). \n\nThere are many other features of Reason and Revolution that\nare worth discussing here, especially Marcuse’s critique of\npositivism. However, these issues will come up again in other\nworks that will be discussed later. Suffice it to say that at\nthis point Marcuse presents negative thinking as an alternative to what\nhe will later call one-dimensional thinking. It is through\nnegative thinking and revolution that liberation becomes\npossible. In the next section we will examine another possibility\nfor liberation. \n4. Psychoanalysis and Utopian Vision\n4.1 The Historical and Social Nature of Human Drives\n\n\nPsychoanalysis was an essential theoretical tool for the Frankfurt\nSchool from the beginning. When Max Horkheimer took over as director\nin 1931, he had already been influenced by psychoanalysis (Abromeit\n2011: 192–195). Soon after becoming director he brought\nPsychoanalyst Erich Fromm on board. The initial goal was to use\npsychoanalytic theory to understand the psyche of the working\nclass. That is, the goal was to understand why those who would benefit\nmost from a revolution of social change seemed to resist it. Marcuse\ndid not engage psychoanalysis until later. Although he made the\nsame use of psychoanalysis as his colleagues, Marcuse also developed\nhis own unique approach to interpreting psychoanalytic\ntheory. While Eros and Civilization is a work on Freud and is\nreplete with the language of psychoanalysis, it is as Marxian as it is\nFreudian. The name Marx it not mentioned in the text, and rarely\nare Marxian categories be introduced. Nevertheless, the Freudian\ncategories are bent toward a Marxist/Marxian type of analysis of\nadvanced industrial societies.\n\nAlthough Marcuse had read Freud in the 1920s and 1930s, his serious\nengagement did not begin until the 1950s. Marcuse was invited to give\na series of lectures in 1950–51 by the Washington School of\nPsychiatry. The result of this engagement was one of Marcuse’s\nmost famous books, Eros and Civilization: A Philosophical Inquiry\ninto Freud. Marcuse’s book is a response to the pessimism\nof Freud’s Civilization and its Discontents (1930\n[1961]). Freud’s book paints a bleak picture of the evolution of\ncivilization as the evolution of greater and greater repression from\nwhich there seems to be no escape. The death and life instincts are\nengaged in a battle for dominance with no clear winner in\nsight. According to Marcuse, Freud fails to develop the emancipatory\npossibility of his own theory. Marcuse’s task is\ntwo-fold. First, he must show that human instincts or drives are not\nmerely biological and fixed, but also social, historical, and\nmalleable. Secondly, he must show that repressive society also\nproduces the possibility of the abolition of repression (Marcuse 1955: 5). \n\nThat the instincts can be repressed already suggests that society and\nits form of organization play a role in shaping the instincts. \nIf this is the case, the instincts cannot be fixed. As society\nand its mechanisms of repression change, so does the instincts. \nMarcuse claims that:\n\n The vicissitudes of the instincts are the vicissitudes of the\nmental apparatus in civilization. The animal drive become human\ninstincts under the influence of the external reality. (Marcuse 1955: 11–12)\n\n\nIn this transformation of the animal drives into human instincts there\nis a transformation of the pleasure principle into the reality\nprinciple (Marcuse 1955: 12). In Civilization and its\nDiscontents Freud claimed it was the program of the pleasure\nprinciple that decided the purpose of life (Freud 1961 [1930]:\n25). However, the external world does not conform to the dictates of\nthe pleasure principle and is even hostile toward it. Hence, the\npleasure principle reverts, turns inward, is repressed. \n\nFor Marcuse, liberation means a freeing up of the pleasure\nprinciple. However, he realizes that if human beings are to\nco-exist, some degree of repression is necessary. That is, if one\nacted simply according to the demands of the pleasure principle, this\nwould lead to an infringement on the freedom of others. Hence,\nthere has to be a mutual limiting of freedom and happiness if we are to\nco-exist. It is with regards to this problem that Marcuse comes\nup with one of his most creative modifications of Freud’s\ntheory. \n4.2  Repression\n\n\nMarcuse introduces two new terms to distinguish between the biological\nvicissitudes of the instincts and the social.  Basic\nrepression refers to the type of repression or modification of\nthe instincts that is necessary “for the perpetuation of the\nhuman race in civilization” (Marcuse 1955: 35). At this level,\nrepression does not lend itself to domination or\noppression. Surplus repression, on the other hand, refers to\n“the restrictions necessitated by social domination”\n(Marcuse 1955: 35). The purpose of surplus repression is to shape the\ninstincts in accordance with the present “performance\nprinciple” which is “the prevailing form of the\nreality principle” (Marcuse 1955: 35).\n\nIt is in this idea of the performance principle where Marx and Freud\nmeet.\n\n\nThe performance principle, which is that of an acquisitive and\nantagonistic society in the process of constant expansion, presupposes\na long development during which domination has been increasingly\nrationalized: control over social labor now reproduces society on a\nlarge scale and under improving conditions. For a long way, the\ninterests of domination and the interests of the whole coincide: the\nprofitable utilization of the productive apparatus fulfills the needs\nand faculties of individuals. For the vast majority of the population,\nthe scope and mode of satisfaction are determined by their own labor;\nbut their labor is work for an apparatus which they do not control,\nwhich operates as an independent power to which individuals must\nsubmit if they want to live. And it becomes the more alien the more\nspecialized the division of labor becomes. Men do not live their own\nlives but perform pre-established functions. While they work, they do\nnot fulfill their own needs and faculties but work in\nalienation. (Marcuse 1955: 45)\n\nMarcuse’s point here is that while work is necessary for the\nmaintenance of life, in our society there has been a transition from\nthe basic amount of work needed to maintain life to what we might call\nsurplus work. There is a distinction here between the work that\nis needed for one’s satisfaction and work that is needed for the\napparatus. The worker has no control insofar as he has no say in\nwhat his wages will be and cannot determine the amount of work that is\nneeded to meet his needs. Work in a capitalist society extends\nitself beyond what is required for the satisfaction of the worker to\nwhat will maximize profit for the capitalist. The\n“pre-established function” of the worker is to produce\ncommodities and maximize profit for the capitalist. The worker\nmust work to live but the conditions under which she works is\ndetermined by the apparatus. \n\nBeing used by the apparatus requires conformity with the\napparatus. This is what Marcuse means by the performance\nprinciple. Members of society must perform according to the\ndictates of their pre-established function. This performance\nrequires the restriction of the libido. The worker must be\nmanipulated in such a way so that these restrictions seem to function\nas rational, external objective laws which are then internalized by the\nindividual. The desires of the individual must conform to the\ndesires of the apparatus. The individual must define himself as\nthe apparatus defines all humanity. As Marcuse puts it, “he\ndesires what he is supposed to desire” (Marcuse 1955: 46).  \n\nAlthough Marcuse’s theory of repression and the recognition of\ntwo forms of repression is a useful theoretical tool for understanding\nwhy we have not entered a revolutionary period, it falls short of\nexplaining how desires are manipulated in such a way that\none-dimensional identities are formed. One of the most\ninteresting and fruitful criticisms of what is now called the\n“repression hypothesis” (Foucault 1976 [1990]: 17–49). \nFor Foucault, forms of subjectivity or identity are not a result of the\nrepression of some primordial desire. Rather, identities are\nformed through power and certain discursive practices. Further,\nin the process of identity-formation, knowledge is not repressed but\nrather, called forth or produced. In his critique of Marcuse,\nFoucault writes:\n\n I would also distinguish myself from para-Marxist like Marcuse who\ngive the notion of repression an exaggerated role—because power\nwould be a fragile thing if its only function were to repress, if it\nworked only through the mode of censorship, exclusion, blockage and\nrepression, in the manner of a great Superego, exercising itself only\nin a negative way. If, on the contrary, power is strong this is\nbecause, as we are beginning to realize, it produces effects at the\nlevel of desire—and also at the level of knowledge. Far from\npreventing knowledge, power produces it. (Foucault 1980: 59)\n4.3  Eros and Logos\n\n\nChapter Five of Eros and Civilization entitled\n“Philosophical Interlude” occurs as a bit of a rupture in\nthe text. After discussing the Freudian theory of the instincts\nfor four chapters, Marcuse takes a break from Freud and engages\nphilosophy instead. However, this break is consistent with the\npurpose of the book. One of Marcuse’s main concerns in all\nof his work is the rationalization of domination. This was a\nmajor theme in One-Dimensional Man. This chapter also\ngives us a clue as to why Freud is so important for critical\ntheory. Freud is put in opposition to the entire western\nphilosophical tradition. The problem with the western\nphilosophical tradition is that it constructs a view of rationality\nthat is in compliance with the oppressive function of rationality or\nthe form of rationality that supports domination. For example,\nthe Kantian notion of moral duty for the sake of duty subordinates\nhappiness to duty. Although Kant provides good reasons for this,\nhe does not adequately address the need for happiness. According\nto Kant following, the moral law makes one worthy of happiness perhaps\nin the afterlife, but there is no real concern for happiness in the\npresent world. \n\nMarcuse’s criticism of western philosophy is very similar to\nrecent criticisms by feminists and Africana philosophers. That\nis, philosophy tends to treat human beings as pure, abstract\nconsciousness. The body and the passions are to be subdued by\nreason or Logos. Marcuse does not intend to subjugate\nLogos (reason) to Eros (desire). He simply\nwants to return Eros to its proper place as equal to\nLogos. It is Freud who recognizes the central role of\nEros as a motivating factor in human action. \n4.4 The Ideology of Scarcity\n\n\nOne of the most important features of Marcuse’s work is his\ndialectical analysis of western society. In his work he tries to\nbring attention to the co-existence of possibilities for liberation and\nthe further development of mechanisms of domination. Our society\nproduces the necessary conditions for freedom while at the same time\nproducing greater oppression.\n\n\nThe very progress of civilization under the performance principle has\nattained a level of productivity at which the social demands upon\ninstinctual energy to be spent in alienated labor could be\nconsiderably reduced (Marcuse 1955: 129)\n\n\nThe capitalist performance principle (the maximization of production\nand profit) has actually created the preconditions for a qualitatively\ndifferent and non-repressive form of life. However, we have not\nentered into this new form of life as more repression is\ndemanded. \n Individual workers continue to engage in alienating labor although\ntheir labor has produced enough wealth to sustain them without ongoing\ntoil. The problem is that the capitalist system is structured in such\na way that all of the wealth goes to the minority who own or control\nthe means of production. Although wealth is socially produced, its\nownership and use is restricted to a few individuals. Hence the\nconcept of scarcity has become obsolete and is used in an ideological\nsense to control the worker. The inhibitions and forms of repression\nthat the worker must impose on himself so that he may direct his\nlibidinal energy toward work goes beyond producing the goods that he\nneeds for survival and instead produces extreme wealth for the\ncapitalist. It is here where Marcuse, relying on his distinction\nbetween basic and surplus repression, goes beyond Freud. Regarding\nFreud’s metapsychology Marcuse says:\n\n\nFor his metapsychology, it is not decisive whether the inhibitions are\nimposed by scarcity or by the hierarchical distribution of\nscarcity, by the struggle for existence or by the interest in\ndomination. (Marcuse 1955: 134)\n\nMarcuse’s point is that in advanced industrial societies there\nis no longer a problem with acquiring the resources needed for existence\nor even the optimum life for members of those societies. The\nproblem is with the fair and just distribution of resources. The\nvery existence of the concept of scarcity in this age functions\nideologically and supports the domination of the worker by the\ncapitalist. \n4.5  Fantasy, Utopia, and the Rationality of Gratification\n\n\nWhile the first half of Eros and Civilization does not sound\nany more optimistic than the conclusion of Freud’s\nCivilization and its Discontents, it does move from diagnosis\nto prognosis or from critique to hope. At the diagnostic level,\nMarcuse examines the form of social pathology that permeates advanced\nindustrial societies. The conclusion is that capitalism demands a\nlevel of surplus repression that supports the development of the death\ninstinct and social domination. However, repression is never\ncomplete. Even Freud was aware of the incompleteness of repression in\na 1915 essay simply entitled “Repression”. Both Freud and\nMarcuse recognize that repressed instincts never go away, but continue\nto assert themselves in one way or another. The erotic drive, which is\nthe builder of culture, continues to assert itself in its conflict\nwith the death instinct. According to Marcuse, the erotic drive for\nhappiness and pleasure lives on in fantasies, art, and utopian\nvisions.\n\nThe second half of Eros and Civilization is devoted to the\nwork of fantasy and the imagination. Marcuse builds a case for the\nemancipatory function of the imagination by reconstructing Freud,\nKant, Schiller, and others. His main point is that through the\nimagination we can envision a better world. This is not a blind\nutopian vision insofar as the resources for creating a qualitatively\nbetter form of life already exists. At the prognostic level, Marcuse\nargues for a fusion of Logos and Eros. This fusion\nhe refers to as the “rationality of\ngratification” (Marcuse 1955: 224). Here, the struggle for\nexistence is based on co-operation and free development and\nfulfillment of needs. \n\nAlthough Eros and Civilization is one of Marcuse’s\nmore optimistic works and offered a new and radical interpretation\nof Freud, it is not without controversy. Marcuse’s\nattempt to make Freud’s drive theory central to an emancipatory\ncritical theory drew criticisms from several sources. I will\ndiscuss the response by some feminists in a later section. \n\nIn an Epilogue to Eros and Civilization entitled\n“Critique of Neo-Freudian Revisionism”, Marcuse accuses\nseveral prominent psychoanalysts of revising Freud’s work in such\na way that it is purged of its critical implications. These\nrevisionists use psychoanalysis to develop a conformist psychology\nrather than a critical one. This led to an open debate between\nMarcuse and a former member of the Institute, Erich Fromm. The\ndebate took place in the mid 1950s in the journal Dissent. \nMarcuse believed that Fromm and others had rejected some of\nFreud’s key insights such as his libidinal theory, the death\ninstinct, the Oedipus complex, the primal horde of patricides,\netc.\n\n The essential problem for Marcuse, was that as the years went by,\nFromm moved further and further away from the instinctual basis of\nhuman personality. He had instead embraced “positive thinking\nwhich leaves the negative where it is—predominant over human\nexistence” (Friedman 2013: 195). \n\nFromm’s approach differed from Marcuse’s insofar as he\nwas more concerned with the role that society played in shaping\none’s character. This different approach does not mean that\nFromm has become less critical. Fromm is perhaps correct in his\nclaim that Marcuse misread him. Given Fromm’s continued\ncommitment to Marxism, it is not likely that he would reduce\npsychoanalysis to a conformist psychology. What appears to be\npositive thinking in Fromm’s work is really not far from what\nMarcuse was after himself in Eros and Civilization. That\nis, Fromm, in a way that differed from Marcuse, was attempting to\nrescue Eros, the builder of culture from the oppressive forces\nof capitalism. The Fromm/Marcuse debate represents an unfortunate\nmoment in the history of critical theory where two major thinkers spoke\nright past each other.   \n5. One-Dimensional Thinking and the Democratic Rejection of Democracy\n\n\nThe first chapter of One-Dimensional Man begins with the\nfollowing sentence:\n\n\nA comfortable, smooth, reasonable, democratic unfreedom prevails in\nadvanced industrial civilization, a token of technical\nprogress. (Marcuse 1964: 1)\n\n\nOne-Dimensional Man is a further analysis of the worry at the\ncenter of Reason and Revolution, the whittling down of\ncritical or negative thinking. As we saw earlier, negative thinking is\ntwo-dimensional as it sees the contradictions by which society is\nconstituted, and it is aware of forces of domination.  The person who\nthinks critically demands social change. One-dimensional thinking\ndoes not demand change nor does it recognize the degree to which the\nindividual is a victim of forces of domination in society.  \n\nThe idea of a democratic unfreedom refers to the free acceptance of\noppression and surplus repression. In One-Dimensional\nMan and in Eros and Civilization, Marcuse makes a decisive\nmove beyond Marx and Freud in his explanation of the containment of\nsocial change. He uses Freud to go beyond Marx insofar as Freud\nhelps us understand the psychological mechanisms at work in individuals\nwho accept surplus repression. However, he goes beyond Freud\ninsofar as Freud’s theory of the super ego is obsolete. \nThat is, in Freud’s theory, the super ego develops through the\ninternalization of the values of some authority figure. According\nto Marcuse, the authority figure is no longer needed. The super\nego has become depersonalized and is no longer fed by authority figures\nsuch as the father, ministers, teachers, the principle, etc. He\nwrites:\n\n\nBut these personal father-images have gradually disappeared behind the\ninstitutions. With the rationalization of the productive apparatus,\nwith the multiplication of functions, all domination assumes the form\nof administration. (Marcuse 1955: 98) \n\nMarcuse’s point is that domination no longer requires force or\nthe presence of an authority figure. The function of\none-dimensional thinking is to produce a one-dimensional society by\nwhittling down critical, two-dimensional consciousness. This is\naccomplished in several ways which will simply be listed here. \n \n\nThe system must make the citizens think that they are freer than they\nreally are.\nThe system must provide the citizens with enough goods to keep\nthem pacified.\nThe citizens must identify with their\noppressors. \nPolitical discourse must be eliminated.\n\n\n\nThere is not enough space here to examine each of these. One example\nshould suffice. It was shown earlier that the purpose of dialectical\nor negative thinking was to reveal social contradictions and demand\nthe overcoming of those contradictions through social\nchange. One-dimensional thinking smoothes over these contradictions\nand makes them invisible. A form of ideology is put in place where the\noppressed identifies with the oppressor.  People feel a sense of unity\nsimply because they watch the same TV programs, or support the same\nsport teams. In politics, vague terms are used such as \"the American\npeople\" or \"the American way of life\" to hide the very different ways\nthat people in America actually experience America. The American way\nof life differs greatly between rich and poor Americans. \n Another example of one-dimensional thinking is the subject of\nMarcuse’s famous and controversial essay “Repressive\nTolerance”. Here, Marcuse shows how terms, ideas, or concepts\nthat have their origin in struggles for liberation can be co-opted and\nused to legitimate oppression. The concept of tolerance was once used\nas a critical concept by marginalized social groups. According to\nMarcuse, the term is now used by the Establishment to legitimate its\nown oppressive views and policies. It is the idea of pure tolerance or\ntolerance for the sake of tolerance that ignores the real concrete\nsocial conflict out of which the concept emerged. Rather than pure\ntolerance, Marcuse calls for “discriminating tolerance”\n(Marcuse 1968a: 123).\n6. The Dialectic of Technology\n\n\nIn their famous book Dialectic of Enlightenment\nMarcuse’s colleagues Max Horkheimer and Theodor Adorno attempted\nto demonstrate that the Enlightenment embodied a tension between its own\nproject of liberation and its own new mechanisms of oppression and\ndomination. For Marcuse, modern technology (a product of the\nEnlightenment) embodies a similar tension. The question for him\nwas “what role does technology play in the project of human\nemancipation?” The technological boom has been supported by\nthe idea that there is some fundamental connection between\ntechnological development and the human quest for liberation and a\nbetter life. However, we were disabused of this idea by Freud and\nmany others. The question now is “does technological\nadvance lead to more repression and domination?”\n Marcuse’s critical theory is always dialectical, as he\nexamines forms of oppression and domination while also, at the same,\nlooking for the potential for liberation. In an essay entitled\n“Some Social Implications of Modern Technology” written in\n1941, Marcuse makes an important distinction between technology and\ntechnics. He would continue to employ some version of this distinction\nfor the rest of his life when writing about technology. In this essay\nhe says:\n\n\nIn this article, technology is taken as a social process in which\ntechnics proper (that is, the technical apparatus of industry,\ntransportation, communication) is but a partial factor. We do not ask\nfor the influence or effect of technology on human individuals. For\nthey are themselves an integral part and factor of technology, not\nonly as the men who invent or attend to machinery but also as the\nsocial groups which direct its application and\nutilization. Technology, as a mode of production, as the totality of\ninstruments, devices and contrivances which characterize the machine\nage is thus at the same time a mode of organization and perpetuating\n(or changing) social relationships, a manifestation of prevalent\nthought and behavior patterns, an instrument for control and\ndomination. Technics by itself can promote authoritarianism as well as\nliberty, scarcity as well as abundance, the extension as well as the\nabolition of toil. (Marcuse 1998) \n\nOn the basis of the above passage it may sound as if technics is\nneutral as it can promote either oppression or liberation. \nHowever, this is not the case. Marcuse makes this clear in\nanother essay entitled “The Problem of Social Change in the\nTechnological Society” written twenty years later. Also, in\na 1960 essay entitled “From Ontology to Technology”, using\nthe term “technicity” instead of “technics” he\nagain rejects the neutrality of technics or technicity. By\n“technics”, Marcuse means the devices or instruments that\nare used to transform nature in the service of human beings.\n\n\nTechnics is the methodological negation of nature by human\nthought and action. In this negation, natural conditions and\nrelations become instrumentalities for the preservation, enlargement,\nand refinement of human society. (Marcuse 2011: 45)\n\n By “Technology”, Marcuse means the mode of production\nor the totality of instruments, devices, etc.\n\nIf technology refers to a mode of production or totality of\ninstruments, then as such it is situated within a certain ideological\nstructure, indeed, it is a form of ideology which determines the form\nof machinery for a particular form of production as well as that form\nof production itself. Here, “ideology” simply refers\nto a belief system or a way of thinking which would include the\ntelos or purpose of all social thought and action.\n\nAt the level of technics, a machine can be considered neutral only\nas pure matter, but in a technological society no such machine exists,\nhence, technics is not neutral. Every machine is constituted\nwithin a web of social, political, economic meaning, an ensemble of\nsocial relations. Technics exists within a certain mode of\nproduction as well as in certain relations of production. Every\ntechnical item is given a mission and is to further the goals of the\npresent reality principle or capitalist performance principle. \nThere is a dialectic involved here insofar as even if modern technology\nhas its origin in a repressive, oppressive, capitalist reality\nprinciple, this same technology carries within itself other\npossibilities. \n\nMarcuse believed that it was possible to conceive of technology\nunder an entirely new reality principle. In the capitalist\nsystem, technics and its governing technological ideology is based on\nthe performance principle of competition and production and must serve\nthe goals set by this performance principle. Even if scarcity is\nno longer a real problem, the idea and fear of scarcity are taken up\nand put to work for the ideology of production for the sake of\nproduction and competition for the sake of competition. We are\nnever told that at this moment we have the necessary resources to end\nworld hunger. Instead, we are told that more and more\ntechnological progress will end the problem of scarcity. \n\nAccording to Marcuse, the use that is made of technology is\nideologically shaped by the present reality principle. It is this\noppressive/repressive reality principle that shapes the telos\nof technological development. Hence, neither technology nor\ntechnics can be neutral because the entire meaning and purpose of such\nhas its birth within a reality and performance principle that as\nMarcuse has reminded us, does not have the liberation and happiness of\nall human beings as its goal. The entire technological and\ntechnical apparatus is given its form and mission by the ruling\nclass. \n\nAccording to Marcuse, a new sensibility, that is, a reshaping of\nhuman relationships with each other as well as with nature would usher\nin a new reality principle. With this new reality principle would\ncome a new mission or telos for technology. Under this\nnew reality principle it would be unthinkable to associate\ntechnological progress with the building of bombs and more\nsophisticated instruments of death. \n7. The Specter of Liberation: The Great Refusal and the New Sensibility \n\n\nAlthough the form of critique in some of Marcuse’s works and the\nuse of concepts such as one-dimensionality may cause one to read a bit\nof pessimism into Marcuse’s texts, nothing could be more\nproblematic than such a reading. The social reality in advanced\nindustrial societies is that very sophisticated systems of domination\nare in place and they are capable of transforming themselves to meet\nthe challenge of any movement for liberation. However, as Marx and\nEngels warned in The Communist Manifesto, “A specter is\nhaunting Europe—the specter of communism” (Marx and Engels\n1848 [1964]: 55). For Marcuse, the specter of liberation haunted\nadvanced industrial societies. One might even say that Marcuse’s\nown critical theory was haunted by the specter of liberation. That is,\nat one level Marcuse engaged in a critique of oppressive social\nstructures so that the door for revolution and liberation could be\nopened. At another level, Marcuse modified his theory to make room for\nvarious form of resistance that he saw developing in oppressive\nsocieties. Marcuse was at once a teacher of revolutionary\nconsciousness and a student. \n\nAlthough he was called the guru of the student movements in the\n1960s, he rejected this title because he was also learning from these\nmovements. The hope for revolution lay within individuals who in\ntheir very being have grown weary with their own repression. The\nstudent movements of the 60s were not based on class struggle, but\nrather, a rejection of their own repression as well as a growing lack\nof tolerance for war and waste. In the Preface to An Essay on\nLiberation while reflecting on the student revolt of 1968, Marcuse\nsays:\n\n\nIn proclaiming the “permanent challenge,”\n(la contestation permanente), the “permanent\neducation,” the Great Refusal, they recognized the mark of social\nrepression, even in the most sublime manifestations of traditional\nculture, even in the most spectacular manifestations of technical\nprogress. They have again raised a specter (and this time a\nspecter which haunts not only the bourgeoisie but all exploitative\nbureaucracies): the specter of a revolution which subordinates the\ndevelopment of productive forces and higher standards of living to the\nrequirements of creating solidarity for the human species, for\nabolishing poverty and misery beyond all national frontiers and spheres\nof interest, for the attainment of peace. (Marcuse 1969: ix–x)\n\nThe student protests of the 1960s were a form of Great Refusal, a\nsaying “NO” to multiple forms of repression and\ndomination. This Great Refusal demands a new/liberated\nsociety. This new society requires what Marcuse calls the new\nsensibility which is an ascension of the life instincts over the\naggressive instincts (Marcuse 1969: 23). This idea of a new\nsensibility is yet another move beyond Marxism insofar as it requires\nmuch more than new power relations. It requires the cultivation\nof new forms of subjectivity. Human subjectivity in its present\nform is the product of systems of domination. We rid society of\nits systems of domination by ridding it of the forms of subjectivity\nformed by those systems and replacing them with new forms of\nsubjectivity. This is why Marcuse was so interested in the\nfeminist movement. He saw in this movement the potential for\nradical social change. The process of rethinking femininity and\nmasculinity could be the beginning of redefining male subjectivity so\nthat it develops in a way that males become less aggressive. \n\nThe cultivation of a new sensibility would transform the\nrelationship between human beings and nature as well as the\nrelationships among human beings. The new sensibility is the\nmedium of social change that mediates between the political practice of\nchanging the world and one’s own drive for personal liberation\n(Marcuse 2007: 234).\n8. Marcuse and Feminism\n\n\nMarcuse’s search for a form of radical subjectivity that could\nserve as an impetus for revolution or social transformation led him\ndown a path not traveled by his Frankfurt School colleagues. \nIndeed, one of the criticisms of Marcuse is that he gave in to\npessimism and gave up on the working class as revolutionary\nsubject. For Marcuse, we must look to “the substratum of\nthe outcasts and outsiders, etc,” for any social change\n(MacIntyre 1970: 87). \n One of the social movements that Marcuse turns to is the feminist\nmovement. On March 7, 1974 Marcuse gave a paper at Stanford University\nentitled, “Marxism and Feminism”. In it he states:\n\n I believe the women’s liberation movement today is, perhaps\nthe most important and potentially the most radical political movement\nthat we have. (Marcuse 2005a: 165)\n\n For Marcuse, the women’s liberation movement was important\nnot only for the liberation of women, but also for the liberation of\nall oppressed people in our society. His hope was that the struggle\nfor the liberation of women would create a new type of performance\nprinciple and aid in the cultivation of a new sensibility. In short,\ncertain feminine qualities would replace brutish, violent, masculine\nqualities. Marcuse actually advocated a form of androgyny. \n One of the main criticisms of Marcuse’s attitude toward\nfeminism is that he simply reinforces gendered stereotypes as he falls\nback into essentialism. Nina Power has recently defended Marcuse\nagainst this charge. Her argument is similar to the one that Marcuse\nmade in an interview with Brian Magee in 1978. Power and Marcuse both\nargue that although so-called feminine categories are social\nconstructs, they still can be universalized in such a way that all\nhuman beings develop a new sensibility. Power states that:\n\n\nFeminist socialism would universalize these so-called feminine\ncharacteristics so that they were no longer specifically\n“feminine” at all but would characterize all culture,\nculminating in androgyny. Residual aggression would be channeled into\n“the destruction of the ugly destructiveness of\ncapitalism,” in Marcuse’s rather neat phrase. “Feminism\nis a revolt against decaying capitalism” and will ultimately\nhave to develop its “own morality”. (Power 2013: 79)\n\nFeminists such as Jessica Benjamin and Nancy Chodorow have pointed\nout a particular weakness in Marcuse’s critical theory that was\nnever addressed by Marcuse himself. For both thinkers,\nMarcuse’s reliance on Freud’s drive theory as that which\nmight produce the need for social change is inadequate because he fails\nto account for the intersubjective development of the individual. \n",
    "bibliography": {
        "categories": [
            "<a id=\"PriSou\">Primary Sources</a>",
            "<a id=\"SecSou\">Secondary Sources</a>",
            "<a id=\"OthWorCit\">Other Works Cited</a>"
        ],
        "cat_ref_text": {
            "<a id=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "1922, <em>Der deutsche Künstlerroman</em>,\nDissertation. Freiburg.",
                "1932 [1987], <em>Hegel’s Ontology and the Theory of\nHistoricity</em>, Seyla Benhabib (trans.), Cambridge and London: The\nMIT Press.",
                "1932 [2005], “Neue Quellen zur Grundlegung des historischen\nMaterialismus” (“New Sources on the Foundation of\nHistorical Materialism”), in <em>Heideggerian Marxism</em>,\nRichard Wolin and John Abromeit (eds.) Lincoln and London: University\nof Nebraska Press.",
                "1937 [2007a], “Der affirmative Character der Kulture,”\n<em>Zeitschrift für Sozialforschung</em>, VI(1), Paris: Libraire\nFélix Alcan, 1937; translated as “The Affirmative\nCharacter of Culture,” <em>Negations</em>, Boston, 1968;\nreference is to the version in <em>Herbert Marcuse: Art and\nLiberation</em>, Douglas Kellner (ed.), London and New York:\nRoutledge, 2007.",
                "1941 [1983], <em>Reason and Revolution: Hegel and the Rise of\nSocial Theory</em>, New Jersey and London: Humanities Press.",
                "1941 [1998],OB “Some Social Implications of Modern\nTechnology,” in\n<em>Technology, War and Fascism</em>, Douglas Kellner (ed.) London and\nNew York: Routledge Press.",
                "1955, <em>Eros and Civilization: A Philosophical Inquiry into\nFreud</em>, Boston: Beacon Press.",
                "1958, <em>Soviet Marxism: A Critical Analysis</em>, New York:\nVintage Books.",
                "1960 [2011], “From Ontology to Technology,” in <em>Philosophy,\nPsychoanalysis and Emancipation</em>, Douglas Kellner (ed.), London and\nNew York: Routledge Press.",
                "1961 [2001], “The Problem of Social Change in the Technological\nSociety,” in <em>Towards a Critical Theory of Society</em>, Douglas\nKellner (ed.), London and New York: Routledge Press.",
                "1964, <em>One-Dimensional Man: Studies in the Ideology of\nAdvanced Industrial Society</em>, Boston: Beacon Press.",
                "1965, “Repressive Tolerance” (with R.P. Wolff and\nBarrington Moore), in <em>A Critique of Pure Tolerance</em>, Boston:\nBeacon Press.",
                "1968a, “Postscript 1968,” in <em>A Critique of\nPure Tolerance</em>, Boston: Beacon Press.",
                "1968b, <em>Negations: Essays in Critical Theory</em>, \nBoston: Beacon Press.",
                "1969, <em>An Essay on Liberation</em>, Boston: Beacon\nPress.",
                "1970, <em>Five Lectures</em>, Jeremy Shapiro and Shierry Weber\n(trans.), Boston: Beacon Press.",
                "1972, <em>A Study on Authority</em>, Joris De Bres\n(trans.), London and New York: Verso.",
                "1973, <em>Studies in Critical Philosophy</em>, Joris De Bres\n(trans.), Boston: Beacon.",
                "1978, <em>The Aesthetic Dimension: Toward a Critique of Marxist\nAesthetics</em>, Boston: Beacon Press.",
                "1978, “BBC Interview: Marcuse on the Frankfurt\nSchool,”, in Bryan Magee (Ed.), <em>Man of Ideas</em>,\n(pp. 62–73). London: BBC Publishing.",
                "1998, <em>Technology, War and Fascism: Collected Papers of\nHerbert Marcuse</em> (Volume 1), Douglas Kellner (ed.), London\nand New York: Routledge.",
                "2001, <em>Towards A Critical Theory of Society: Collected\nPapers of Herbert Marcuse</em> (Volume 2), Douglas Kellner (ed.), \nLondon and New York: Routledge.",
                "2005a, <em>The New Left and the 1960s: Collected Papers of Herbert\nMarcuse</em> (Volume 3), Douglas Kellner (ed.), London and New York:\nRoutledge.",
                "2005b, <em>Heideggerian Marxism</em>, Richard Wolin and John\nAbromeit (eds.), Lincoln and London: University of Nebraska\nPress.",
                "2007a, <em>Art and Liberation: Collected Papers of Herbert\nMarcuse</em> (Volume 4), Douglas Kellner (ed.), London and New York:\nRoutledge.",
                "2007b, <em>The Essential Marcuse</em>, Andrew Feenberg\nand William Leiss (ed.), Boston: Beacon Press.",
                "2011, <em>Philosophy, Psychoanalysis and Emancipation:\nCollected Papers of Herbert Marcuse</em> (Volume 5), Douglas Kellner\n(ed.), London and New York: Routledge.",
                "2014, <em>Marxism, Revolution and Utopia: Collected Papers of Herbert\nMarcuse</em> (Volume 6) Douglas Kellner and Clayton Pierce (ed.), London\nand New York: Routledge.\n</ul>\n<h3>"
            ],
            "<a id=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Abromeit, John, 2011, <em>Max Horkheimer and the Foundations\nof the Frankfurt School</em>, Cambridge, New York, Melbourne, Madrid,\nCape Town: Cambridge University Press.",
                "Abromeit, John and Mark Cobb (eds.), 2004, <em>Herbert\nMarcuse: A Critical Reader</em>, New York and London: Routledge.",
                "Alford, Fred C., 1985, <em>Science and the Revenge of Nature:\nHabermas &amp; Marcuse</em>, Tampa and Gainesville: University\nPresses of Florida.",
                "Always, Joan, 1995, <em>Critical Theory and Political\nPossibilities: Conceptions of Emancipatory Politics in the Works of\nHorkheimer, Adorno, Marcuse, and Habermas</em>, Westport, Connecticut\nand London: Greenwood Press.",
                "Anderson, Kevin B. and Russell Rockwell (eds.), 2012, <em>The\nDunayevskaya-Marcuse-Fromm Correspondence, 1954–1978</em>, Lanham,\nBoulder, New York, Toronto, Plymouth, UK: Lexington Books.",
                "Benjamin, Jessica, 1988, <em>The Bonds of Love:\nPsychoanalysis, Feminism, and The Problem of Domination</em>, New York:\nPantheon Books.",
                "Bernstein, Richard, 2013, “Marcuse’s Critical\nLegacy,” <em>Radical Philosophy Review</em>, 16(1): 59–71.",
                "Bokina, John and Timothy Lukes (eds.), 1994, <em>Marcuse:\nFrom the New Left to the Next Left</em>, Lawrence, Kansas: University\nPress of Kansas.",
                "Breines, Paul (ed.), 1970, <em>Critical Interruptions: New\nLeft Perspectives on Herbert Marcuse</em>, New York: Herder and\nHerder.",
                "Bronner, Stephen Eric, 2002, <em>Critical Theory and Its\nTheorists</em>, New York and London: Routledge.",
                "Chodorow, Nancy J., 1989, <em>Feminism and Psychoanalytic\nTheory</em>, New Haven and London: Yale University Press.",
                "Davis, Angela, 2004, “Marcuse’s Legacies,” in\n<em>Herbert Marcuse: A Critical Reader</em>, John Abromeit and Mark\nCobb (eds.), New York and London: Routledge.",
                "Dabrowski, Tomash Conrad, 2016, “Concrete Philosophy: The\nProblem of Judgement in the Early Work of Herbert\nMarcuse,” <em>Philosophy and Social Criticism</em>, 42(6):\n576–593.",
                "Farr, Arnold, 2009, <em>Critical Theory and Democratic Vision:\nHerbert Marcuse and Recent Liberation Philosophies</em>, Lanham,\nBoulder, New York, Toronto, and Plymouth, UK: Lexington Books.",
                "Feenberg, Andrew, 2018, “Marcuse,” <em>Radical\nPhilosophy Review</em>, 21(2): 271–298.",
                "Feenberg, Andrew, 2005, <em>Heidegger and Marcuse: The\nCatastrophe and Redemption of History</em>, New York and London:\nRoutledge.",
                "Foucault, Michel, 1976 [1990], <em>The History of Sexuality: An\nIntroduction</em>, New York: Vintage Books.",
                "–––, 1980, “Body/Power,” in\n<em>Power/Knowledge: Selected Interviews &amp; Other\nWritings</em>, New York: Pantheon Books.",
                "Friedman, Lawrence, 2013, <em>The Lives of Erich\nFromm</em>, New York: Columbia University Press.",
                "Geoghegan, Vincent, 1981, <em>Reason and Eros: The Social\nTheory of Herbert Marcuse</em>, London: Pluto Press.",
                "Habermas, Jürgen and Charles Reitz, 2013, “Herbert\nMarcuse,” <em>Radical Philosophy Review</em>, 16(1):\n17–19.",
                "Held, David, 1980, <em>Introduction to Critical Theory:\nHorkheimer to Habermas</em>, Berkeley and Los Angeles: University of\nCalifornia Press.",
                "Holman, Christopher, 2013, <em>Politics as Radical Creation:\nHerbert Marcuse and Hannah Arendt on Political Performativity</em>,\nToronto: University of Toronto Press.",
                "Honneth, Axel and Reitz Charles, 2013, “Herbert Marcuse and\nthe Frankfurt School,” <em>Radical Philosophy Review</em>,\n16(1): 49–57.",
                "Horowitz, Gad, 1977, <em>Repression: Basic and Surplus\nRepression in Psychoanalytic Theory: Freud, Reich, and Marcuse</em>,\nToronto and Buffalo: University of Toronto Press.",
                "Jay, Martin, 1973, <em>The Dialectical Imagination: A History\nof the Frankfurt School and the Institute of Social Research,\n1923–1950</em>, Boston and Toronto: Little, Brown and\nCompany.",
                "Katz, Barry, 1982, <em>Herbert Marcuse and the Art of\nLiberation: An Intellectual Biography</em>, London: Verso.",
                "Kellner, Douglas, 1984, <em>Marcuse and the Crisis of\nMarxism</em>, London: Macmillan.",
                "Kellner, Doug, Tyson Lewis, Clayton Pierce, and Daniel Cho (eds.),\n2009, <em>Marcuse’s Challenge to Education</em>, Lanham,\nBoulder, New York, Toronto, Plymouth, UK: Rowman &amp; Littlefield\nPublishers.",
                "Lipshires, Sidney, 1974, <em>Herbert Marcuse: From Marx to\nFreud and Beyond</em>, Cambridge, Massachusetts: Schenkman Publishing\nCompany, INC.",
                "Lukes, Timothy, 1985, <em>The Flight into Inwardness: An\nExposition and Critique of Herbert Marcuse’s Theory of Liberative\nAesthetics</em>, London and Toronto: Susquehanna University Press and\nAssociated University Press.",
                "Marks, Robert, 1970, <em>The Meaning of Marcuse</em>, New\nYork: Ballantine Books.",
                "MacIntyre, Alasdair, 1970, <em>Marcuse</em>, London:\nFontana/Collins.",
                "Maley, Terry (ed.), 2017, <em>One-Dimensional Man 50 Years On: The\nStruggle Continues</em>, Halifax and Winnipeg: Fernwood Publishing.",
                "Pippin, Robert, Andrew Feenberg, and Charles Webel, 1988 (eds.). \n<em>Marcuse: Critical Theory and the Promise of Utopia</em>, \nMassachusetts: Bergin &amp; Garvey Publishers, INC.",
                "Power, Nina, 2009, <em>One Dimensional Woman</em>, Winchester, UK\nand Washington, USA: Zero Books.",
                "–––, 2013, “Marcuse and Feminism\nRevisited,” <em>Radical Philosophy Review</em>, 16(1):\n73–79.",
                "Reitz, Charles, 2000, <em>Art, Alienation, and the Humanities:\nA Critical Engagement with Herbert Marcuse</em>, Albany, NY: State\nUniversity of New York Press.",
                "Reitz, Charles, 2019, <em>Ecology and Revolution: Herbert Marcuse and\nthe Challenge of a New World System Today</em>, New York and London:\nRoutledge.",
                "Schoolman, Morton, 1980, <em>The Imaginary Witness: The\nCritical Theory of Herbert Marcuse</em>, New York: The Free Press.",
                "Steuernagel, Gertrude, 1979, <em>Political Philosophy as Therapy:\nMarcuse Reconsidered</em>, Westport, Connecticut and London, England:\nGreenwood Press.",
                "–––, 1994, “Marcuse, the Women’s Movement,\nand Women’s Studies,” in <em>Marcuse: From the New Left to the\nNext Left</em>, edited by John Bokina and Timothy J. Lukes, Lawrence,\nKansas: University Press of Kansas.",
                "Wiggershaus, Rolf, 1994, <em>The Frankfurt School: Its\nHistory, Theories, and Political Significance</em>, Michael Robertson\n(trans.), Cambridge, Massachusetts: The MIT Press.",
                "Wolin, Richard, 2001, <em>Heidegger’s Children: Hannah\nArendt, Karl Lüwith, Hans Jonas, and Herbert Marcuse</em>,\nPrinceton and Oxford: Princeton University Press.",
                "–––, 2005, “Introduction: What is\nHeideggerian Marxism,” in Wolin &amp; Abromeit (eds.) 2005,\npp.xi–xxx.",
                "Wolff, Kurt and Barrington Moore (eds,) 1968, <em>The Critical\nSpirit: Essays in Honor of Herbert Marcuse</em>, Boston: Beacon\nPress. \n</ul>\n<h3>"
            ],
            "<a id=\"OthWorCit\">Other Works Cited</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Freud, Sigmund, 1915 [1949], “Repression”\nin <em>Sigmund Freud: Collected Papers</em> Vol. IV, Ernest Jones\n(trans.), London: The Hogarth Press and the Institute of\nPsycho-Analysis.",
                "Freud, Sigmund, 1930 [1961], <em>Civilization and its\nDiscontents</em>, James Strachey (trans.), New York and London:\nW.W. Norton &amp; Company.",
                "Heidegger, Martin, 1927 [1962], <em>Being and Time</em>, John\nMacquarrie and Edward Robinson (trans.), New York, Hagerstown, San\nFrancisco, London: Harper &amp; Row Publishers.",
                "Marx, Karl and Friedrich Engels, 1848 [1964], <em>The Communist\nManifesto</em>, Samuel Moore (trans.), New York: Washington Square\nPress.",
                "Marx, Karl, 1844, “Okonomisch-philosophichen Manuskripte von\n1844,” in <em>Marx-Engels-Gesamtausgabe</em>, half-vol 3, sect\nI, D. Rjazanov (ed.), Frankfurt: Marx-Engels Archiv, 1932.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"PriSou\">Primary Sources</a></h3>\n<ul class=\"hanging\">\n<li>1922, <em>Der deutsche Künstlerroman</em>,\nDissertation. Freiburg.</li>\n<li>1932 [1987], <em>Hegel’s Ontology and the Theory of\nHistoricity</em>, Seyla Benhabib (trans.), Cambridge and London: The\nMIT Press. </li>\n<li>1932 [2005], “Neue Quellen zur Grundlegung des historischen\nMaterialismus” (“New Sources on the Foundation of\nHistorical Materialism”), in <em>Heideggerian Marxism</em>,\nRichard Wolin and John Abromeit (eds.) Lincoln and London: University\nof Nebraska Press.</li>\n<li>1937 [2007a], “Der affirmative Character der Kulture,”\n<em>Zeitschrift für Sozialforschung</em>, VI(1), Paris: Libraire\nFélix Alcan, 1937; translated as “The Affirmative\nCharacter of Culture,” <em>Negations</em>, Boston, 1968;\nreference is to the version in <em>Herbert Marcuse: Art and\nLiberation</em>, Douglas Kellner (ed.), London and New York:\nRoutledge, 2007.</li>\n<li>1941 [1983], <em>Reason and Revolution: Hegel and the Rise of\nSocial Theory</em>, New Jersey and London: Humanities Press.</li>\n<li>1941 [1998],OB “Some Social Implications of Modern\nTechnology,” in\n<em>Technology, War and Fascism</em>, Douglas Kellner (ed.) London and\nNew York: Routledge Press.</li>\n<li>1955, <em>Eros and Civilization: A Philosophical Inquiry into\nFreud</em>, Boston: Beacon Press.</li>\n<li>1958, <em>Soviet Marxism: A Critical Analysis</em>, New York:\nVintage Books.</li>\n<li>1960 [2011], “From Ontology to Technology,” in <em>Philosophy,\nPsychoanalysis and Emancipation</em>, Douglas Kellner (ed.), London and\nNew York: Routledge Press. </li>\n<li>1961 [2001], “The Problem of Social Change in the Technological\nSociety,” in <em>Towards a Critical Theory of Society</em>, Douglas\nKellner (ed.), London and New York: Routledge Press.</li>\n<li>1964, <em>One-Dimensional Man: Studies in the Ideology of\nAdvanced Industrial Society</em>, Boston: Beacon Press.</li>\n<li>1965, “Repressive Tolerance” (with R.P. Wolff and\nBarrington Moore), in <em>A Critique of Pure Tolerance</em>, Boston:\nBeacon Press.</li>\n<li>1968a, “Postscript 1968,” in <em>A Critique of\nPure Tolerance</em>, Boston: Beacon Press.</li>\n<li>1968b, <em>Negations: Essays in Critical Theory</em>, \nBoston: Beacon Press.</li>\n<li>1969, <em>An Essay on Liberation</em>, Boston: Beacon\nPress.</li>\n<li>1970, <em>Five Lectures</em>, Jeremy Shapiro and Shierry Weber\n(trans.), Boston: Beacon Press.</li>\n<li>1972, <em>A Study on Authority</em>, Joris De Bres\n(trans.), London and New York: Verso.</li>\n<li>1973, <em>Studies in Critical Philosophy</em>, Joris De Bres\n(trans.), Boston: Beacon.</li>\n<li>1978, <em>The Aesthetic Dimension: Toward a Critique of Marxist\nAesthetics</em>, Boston: Beacon Press.</li>\n<li>1978, “BBC Interview: Marcuse on the Frankfurt\nSchool,”, in Bryan Magee (Ed.), <em>Man of Ideas</em>,\n(pp. 62–73). London: BBC Publishing.</li>\n<li>1998, <em>Technology, War and Fascism: Collected Papers of\nHerbert Marcuse</em> (Volume 1), Douglas Kellner (ed.), London\nand New York: Routledge.</li>\n<li>2001, <em>Towards A Critical Theory of Society: Collected\nPapers of Herbert Marcuse</em> (Volume 2), Douglas Kellner (ed.), \nLondon and New York: Routledge. </li>\n<li>2005a, <em>The New Left and the 1960s: Collected Papers of Herbert\nMarcuse</em> (Volume 3), Douglas Kellner (ed.), London and New York:\nRoutledge.</li>\n<li>2005b, <em>Heideggerian Marxism</em>, Richard Wolin and John\nAbromeit (eds.), Lincoln and London: University of Nebraska\nPress. </li>\n<li>2007a, <em>Art and Liberation: Collected Papers of Herbert\nMarcuse</em> (Volume 4), Douglas Kellner (ed.), London and New York:\nRoutledge.</li>\n<li>2007b, <em>The Essential Marcuse</em>, Andrew Feenberg\nand William Leiss (ed.), Boston: Beacon Press.</li>\n<li>2011, <em>Philosophy, Psychoanalysis and Emancipation:\nCollected Papers of Herbert Marcuse</em> (Volume 5), Douglas Kellner\n(ed.), London and New York: Routledge.</li>\n<li>2014, <em>Marxism, Revolution and Utopia: Collected Papers of Herbert\nMarcuse</em> (Volume 6) Douglas Kellner and Clayton Pierce (ed.), London\nand New York: Routledge.</li>\n</ul>\n<h3><a id=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Abromeit, John, 2011, <em>Max Horkheimer and the Foundations\nof the Frankfurt School</em>, Cambridge, New York, Melbourne, Madrid,\nCape Town: Cambridge University Press.</li>\n<li>Abromeit, John and Mark Cobb (eds.), 2004, <em>Herbert\nMarcuse: A Critical Reader</em>, New York and London: Routledge.</li>\n<li>Alford, Fred C., 1985, <em>Science and the Revenge of Nature:\nHabermas &amp; Marcuse</em>, Tampa and Gainesville: University\nPresses of Florida.</li>\n<li>Always, Joan, 1995, <em>Critical Theory and Political\nPossibilities: Conceptions of Emancipatory Politics in the Works of\nHorkheimer, Adorno, Marcuse, and Habermas</em>, Westport, Connecticut\nand London: Greenwood Press.</li>\n<li>Anderson, Kevin B. and Russell Rockwell (eds.), 2012, <em>The\nDunayevskaya-Marcuse-Fromm Correspondence, 1954–1978</em>, Lanham,\nBoulder, New York, Toronto, Plymouth, UK: Lexington Books. </li>\n<li>Benjamin, Jessica, 1988, <em>The Bonds of Love:\nPsychoanalysis, Feminism, and The Problem of Domination</em>, New York:\nPantheon Books.</li>\n<li>Bernstein, Richard, 2013, “Marcuse’s Critical\nLegacy,” <em>Radical Philosophy Review</em>, 16(1): 59–71.</li>\n<li>Bokina, John and Timothy Lukes (eds.), 1994, <em>Marcuse:\nFrom the New Left to the Next Left</em>, Lawrence, Kansas: University\nPress of Kansas.</li>\n<li>Breines, Paul (ed.), 1970, <em>Critical Interruptions: New\nLeft Perspectives on Herbert Marcuse</em>, New York: Herder and\nHerder.</li>\n<li>Bronner, Stephen Eric, 2002, <em>Critical Theory and Its\nTheorists</em>, New York and London: Routledge.</li>\n<li>Chodorow, Nancy J., 1989, <em>Feminism and Psychoanalytic\nTheory</em>, New Haven and London: Yale University Press.</li>\n<li>Davis, Angela, 2004, “Marcuse’s Legacies,” in\n<em>Herbert Marcuse: A Critical Reader</em>, John Abromeit and Mark\nCobb (eds.), New York and London: Routledge.</li>\n<li>Dabrowski, Tomash Conrad, 2016, “Concrete Philosophy: The\nProblem of Judgement in the Early Work of Herbert\nMarcuse,” <em>Philosophy and Social Criticism</em>, 42(6):\n576–593.</li>\n<li>Farr, Arnold, 2009, <em>Critical Theory and Democratic Vision:\nHerbert Marcuse and Recent Liberation Philosophies</em>, Lanham,\nBoulder, New York, Toronto, and Plymouth, UK: Lexington Books.</li>\n<li>Feenberg, Andrew, 2018, “Marcuse,” <em>Radical\nPhilosophy Review</em>, 21(2): 271–298.</li>\n<li>Feenberg, Andrew, 2005, <em>Heidegger and Marcuse: The\nCatastrophe and Redemption of History</em>, New York and London:\nRoutledge.</li>\n<li>Foucault, Michel,  1976 [1990], <em>The History of Sexuality: An\nIntroduction</em>,  New York: Vintage Books.</li>\n<li>–––,  1980, “Body/Power,” in\n<em>Power/Knowledge: Selected Interviews &amp; Other\nWritings</em>,  New York: Pantheon Books.</li>\n<li>Friedman, Lawrence,  2013, <em>The Lives of Erich\nFromm</em>, New York: Columbia University Press.</li>\n<li>Geoghegan, Vincent, 1981, <em>Reason and Eros: The Social\nTheory of Herbert Marcuse</em>, London: Pluto Press.</li>\n<li>Habermas, Jürgen and Charles Reitz, 2013, “Herbert\nMarcuse,” <em>Radical Philosophy Review</em>, 16(1):\n17–19.</li>\n<li>Held, David, 1980, <em>Introduction to Critical Theory:\nHorkheimer to Habermas</em>, Berkeley and Los Angeles: University of\nCalifornia Press.</li>\n<li>Holman, Christopher, 2013, <em>Politics as Radical Creation:\nHerbert Marcuse and Hannah Arendt on Political Performativity</em>,\nToronto: University of Toronto Press.</li>\n<li>Honneth, Axel and Reitz Charles, 2013, “Herbert Marcuse and\nthe Frankfurt School,” <em>Radical Philosophy Review</em>,\n16(1): 49–57.</li>\n<li>Horowitz, Gad, 1977, <em>Repression: Basic and Surplus\nRepression in Psychoanalytic Theory: Freud, Reich, and Marcuse</em>,\nToronto and Buffalo: University of Toronto Press.</li>\n<li>Jay, Martin, 1973, <em>The Dialectical Imagination: A History\nof the Frankfurt School and the Institute of Social Research,\n1923–1950</em>,  Boston and Toronto: Little, Brown and\nCompany.</li>\n<li>Katz, Barry, 1982, <em>Herbert Marcuse and the Art of\nLiberation: An Intellectual Biography</em>, London: Verso.</li>\n<li>Kellner, Douglas, 1984, <em>Marcuse and the Crisis of\nMarxism</em>, London: Macmillan.</li>\n<li>Kellner, Doug, Tyson Lewis, Clayton Pierce, and Daniel Cho (eds.),\n2009, <em>Marcuse’s Challenge to Education</em>, Lanham,\nBoulder, New York, Toronto, Plymouth, UK: Rowman &amp; Littlefield\nPublishers.</li>\n<li>Lipshires, Sidney, 1974, <em>Herbert Marcuse: From Marx to\nFreud and Beyond</em>, Cambridge, Massachusetts: Schenkman Publishing\nCompany, INC.</li>\n<li>Lukes, Timothy, 1985, <em>The Flight into Inwardness: An\nExposition and Critique of Herbert Marcuse’s Theory of Liberative\nAesthetics</em>, London and Toronto: Susquehanna University Press and\nAssociated University Press.</li>\n<li>Marks, Robert, 1970, <em>The Meaning of Marcuse</em>, New\nYork: Ballantine Books.</li>\n<li>MacIntyre, Alasdair, 1970, <em>Marcuse</em>, London:\nFontana/Collins.</li>\n<li>Maley, Terry (ed.), 2017, <em>One-Dimensional Man 50 Years On: The\nStruggle Continues</em>, Halifax and Winnipeg: Fernwood Publishing.</li>\n<li>Pippin, Robert, Andrew Feenberg, and Charles Webel, 1988 (eds.). \n<em>Marcuse: Critical Theory and the Promise of Utopia</em>, \nMassachusetts: Bergin &amp; Garvey Publishers, INC.</li>\n<li>Power, Nina, 2009, <em>One Dimensional Woman</em>, Winchester, UK\nand Washington, USA: Zero Books.</li>\n<li>–––, 2013, “Marcuse and Feminism\nRevisited,” <em>Radical Philosophy Review</em>, 16(1):\n73–79.</li>\n<li>Reitz, Charles, 2000, <em>Art, Alienation, and the Humanities:\nA Critical Engagement with Herbert Marcuse</em>, Albany, NY: State\nUniversity of New York Press.</li>\n<li>Reitz, Charles, 2019, <em>Ecology and Revolution: Herbert Marcuse and\nthe Challenge of a New World System Today</em>, New York and London:\nRoutledge.</li>\n<li>Schoolman, Morton, 1980, <em>The Imaginary Witness: The\nCritical Theory of Herbert Marcuse</em>, New York: The Free Press.</li>\n<li>Steuernagel, Gertrude, 1979, <em>Political Philosophy as Therapy:\nMarcuse Reconsidered</em>, Westport, Connecticut and London, England:\nGreenwood Press.</li>\n<li>–––, 1994, “Marcuse, the Women’s Movement,\nand Women’s Studies,” in <em>Marcuse: From the New Left to the\nNext Left</em>, edited by John Bokina and Timothy J.  Lukes, Lawrence,\nKansas: University Press of Kansas. </li>\n<li>Wiggershaus, Rolf, 1994, <em>The Frankfurt School: Its\nHistory, Theories, and Political Significance</em>, Michael Robertson\n(trans.), Cambridge, Massachusetts: The MIT Press.</li>\n<li>Wolin, Richard, 2001, <em>Heidegger’s Children: Hannah\nArendt, Karl Lüwith, Hans Jonas, and Herbert Marcuse</em>,\nPrinceton and Oxford: Princeton University Press.</li>\n<li>–––, 2005, “Introduction: What is\nHeideggerian Marxism,” in Wolin &amp; Abromeit (eds.) 2005,\npp.xi–xxx. </li>\n<li>Wolff, Kurt and Barrington Moore (eds,) 1968, <em>The Critical\nSpirit: Essays in Honor of Herbert Marcuse</em>, Boston: Beacon\nPress. </li>\n</ul>\n<h3><a id=\"OthWorCit\">Other Works Cited</a></h3>\n<ul class=\"hanging\">\n<li>Freud, Sigmund, 1915 [1949], “Repression”\nin <em>Sigmund Freud: Collected Papers</em> Vol. IV, Ernest Jones\n(trans.), London: The Hogarth Press and the Institute of\nPsycho-Analysis.</li>\n<li>Freud, Sigmund, 1930 [1961], <em>Civilization and its\nDiscontents</em>, James Strachey (trans.),  New York and London:\nW.W. Norton &amp; Company.</li>\n<li>Heidegger, Martin, 1927 [1962], <em>Being and Time</em>, John\nMacquarrie and Edward Robinson (trans.), New York, Hagerstown, San\nFrancisco, London: Harper &amp; Row Publishers.</li>\n<li>Marx, Karl and Friedrich Engels, 1848 [1964], <em>The Communist\nManifesto</em>, Samuel Moore (trans.), New York: Washington Square\nPress.</li>\n<li>Marx, Karl, 1844, “Okonomisch-philosophichen Manuskripte von\n1844,” in <em>Marx-Engels-Gesamtausgabe</em>, half-vol 3, sect\nI, D. Rjazanov (ed.), Frankfurt: Marx-Engels Archiv, 1932.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Adorno, Theodor W.",
            "Benjamin, Walter",
            "critical theory",
            "frankfurt-school",
            "Freud, Sigmund",
            "Habermas, Jürgen",
            "Hegel, Georg Wilhelm Friedrich",
            "Hegel, Georg Wilhelm Friedrich: dialectics",
            "Heidegger, Martin",
            "Horkheimer, Max",
            "Marx, Karl",
            "Marxism, analytical"
        ],
        "entry_link": [
            {
                "../adorno/": "Adorno, Theodor W."
            },
            {
                "../benjamin/": "Benjamin, Walter"
            },
            {
                "../critical-theory/": "critical theory"
            },
            {
                "../habermas/": "Habermas, Jürgen"
            },
            {
                "../hegel/": "Hegel, Georg Wilhelm Friedrich"
            },
            {
                "../hegel-dialectics/": "Hegel, Georg Wilhelm Friedrich: dialectics"
            },
            {
                "../heidegger/": "Heidegger, Martin"
            },
            {
                "../horkheimer/": "Horkheimer, Max"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../marxism-analytical/": "Marxism, analytical"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=marcuse\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/marcuse/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=marcuse&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/marcuse/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=marcuse": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/marcuse/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=marcuse&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/marcuse/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://pages.gseis.ucla.edu/faculty/kellner/Illumina%20Folder/\" target=\"other\">Illuminations: The Critical Theory Project</a>",
            "<a href=\"http://www.marxists.org/reference/archive/marcuse/\" target=\"other\">The Herbert Marcuse Internet Archive</a>",
            "<a href=\"http://www.marcuse.org/herbert/\" target=\"other\">Herbert Marcuse Official Homepage</a>",
            "<a href=\"http://www.marcusesociety.org\" target=\"other\">International Herbert Marcuse Society</a>"
        ],
        "listed_links": [
            {
                "http://pages.gseis.ucla.edu/faculty/kellner/Illumina%20Folder/": "Illuminations: The Critical Theory Project"
            },
            {
                "http://www.marxists.org/reference/archive/marcuse/": "The Herbert Marcuse Internet Archive"
            },
            {
                "http://www.marcuse.org/herbert/": "Herbert Marcuse Official Homepage"
            },
            {
                "http://www.marcusesociety.org": "International Herbert Marcuse Society"
            }
        ]
    }
}