{
    "url": "moore-moral",
    "title": "Moore’s Moral Philosophy",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Thomas Hurka\n<tom.hurka@utoronto.ca>",
        "author_links": [
            {
                "https://thomashurka.com/": "Thomas Hurka"
            },
            {
                "mailto:tom%2ehurka%40utoronto%2eca": "tom.hurka@utoronto.ca"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"https://thomashurka.com/\" target=\"other\">Thomas Hurka</a>\n&lt;<a href=\"mailto:tom%2ehurka%40utoronto%2eca\"><em>tom<abbr title=\" dot \">.</abbr>hurka<abbr title=\" at \">@</abbr>utoronto<abbr title=\" dot \">.</abbr>ca</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jan 26, 2005",
        "substantive revision Mon Mar 22, 2021"
    ],
    "preamble": "\n\nG.E. Moore’s Principia Ethica of 1903 is often\nconsidered a revolutionary work that set a new agenda for\n20th-century ethics. This historical view is, however,\nsomewhat overstated. In metaethics Moore’s non-naturalist\nrealism was close to that defended by Henry Sidgwick and other late\n19th-century philosophers such as Hastings Rashdall, Franz\nBrentano, and J.M.E. McTaggart; in normative ethics his ideal\nconsequentialism likewise echoed views of Rashdall, Brentano, and\nMcTaggart. But Principia Ethica presented its views with\nunusual force and vigor. In particular, it made much more of the\nalleged errors of metaethical naturalism than Sidgwick or Rashdall\nhad, saying they vitiated most previous moral philosophy. For this\nreason, Moore’s work had a disproportionate influence on\n20th-century moral philosophy and remains the best-known\nexpression of a general metaethical view also shared by later writers\nsuch as H.A. Prichard, W.D. Ross, and C.D. Broad.\n",
    "toc": [
        {
            "#NonNatuOpenQuesArgu": "1. Non-naturalism and the Open-Question Argument"
        },
        {
            "#MetaInno": "2. Metaethical Innovations"
        },
        {
            "#ImpeCons": "3. Impersonal Consequentialism"
        },
        {
            "#Idea": "4. The Ideal"
        },
        {
            "#Infl": "5. Influence"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PrimSour": "Primary Sources"
        },
        {
            "#SecoSour": "Secondary Sources"
        },
        {
            "#SpecIssu": "Special Issues"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Non-naturalism and the Open-Question Argument\n\nMoore’s non-naturalism comprised two main theses. One was the\nrealist thesis that moral and more generally normative judgements\n– like many of his contemporaries, Moore did not distinguish the\ntwo – are true or false objectively, or independently of any\nbeliefs or attitudes we may have. The other was the autonomy-of-ethics\nthesis that moral judgements are sui generis, neither\nreducible to nor derivable from non-moral, for example scientific or\nmetaphysical, judgements; they express a distinctive kind of objective\ntruth. Closely connected to his non-naturalism was the epistemological\nview that our knowledge of moral truths is intuitive, in the sense\nthat it is not arrived at by inference from non-moral truths but rests\non our recognizing certain moral propositions as self-evident, by a\nkind of direct or immediate insight.\n\nMoore expressed the realist side of his non-naturalism by saying that\nfundamental moral judgements ascribe the property of goodness or\nbadness to states of affairs, though especially in Principia\nEthica he tended not to distinguish moral concepts and moral\nproperties. Like others of his time, he seems to have taken the\nrealist view that moral judgements are objectively true for granted;\nhe certainly did not defend it extensively against anti-realist\nalternatives. Thus the first sentence of Principia Ethica\nrefers casually, and without any sense of controversy, to the\n“truth” of some ethical judgements (1903: 1/1993: 53). In\nthis he was doubtless influenced by the grammar of moral judgements,\nwhich have a standard subject-predicate form, as in “x\nis good.” But it may also be relevant that, at least early on,\nthe only version of subjectivism he seems to have been aware of was\nthe naturalist view that to say “x is good” is to\nreport some psychological fact such as that you approve of x\nor that most people in your society do. In his later book\nEthics he argued, among other things, that this view does not\nallow for moral disagreement, since, for example, my report that I\napprove of x and your report that you disapprove of it can\nboth be true (1912: 100–03/1947: 62–64/1965: 42–43).\nLate in his life he encountered the non-cognitivist emotivism of C.L.\nStevenson, which says that moral judgements express rather than report\nfeelings and therefore can conflict (Stevenson 1942). He initially\nconceded, surprisingly, that Stevenson’s anti-realist view had\nas good a claim as his own to be true (1942: 544–45), but\nshortly after he reverted to his earlier non-naturalism, saying he\ncould not imagine what had induced him to consider abandoning it\n(Ewing 1962: 251).\n\nEspecially in Principia Ethica, Moore spent much more time\ndefending his other non-naturalist thesis, about the autonomy of\nethics, which he expressed by saying the property of goodness is\nsimple and unanalyzable, and in particular unanalyzable in non-moral\nterms. This meant the property is “non-natural,” or\ndistinct from any of the natural properties studied by science, though\nhe also thought it distinct from metaphysical properties. Views that\ndenied this thesis committed what he called “the naturalistic\nfallacy” (1903: 10/1993: 62), which he found in hedonists such\nas Jeremy Bentham, evolutionary ethicists such as Herbert Spencer, and\nmetaphysical ethicists such as T.H. Green. His main argument against\ntheir view was what has come to be known as the “open-question\nargument,” though he actually stated in two slightly different\nways. Consider a particular naturalist claim, such as that\n“x is good” is equivalent to “x is\npleasant” or “x is pleasure.”If this claim\nwere true, he argued, the judgement “Pleasure is good”\nwould be equivalent to “Pleasure is pleasure,” yet surely\nsomeone who asserts the former means to express more than that\nuninformative tautology. Alternatively, if this naturalist claim were\ntrue, “x is pleasant but x is not good”\nwould be self-contradictory. Once it was established that x\nis pleasant, the question whether it is good would then be\nclosed, or not worth considering, whereas, he argued, it remains open.\nThe same argument can be mounted against any other naturalist\nproposal: even if we have determined that something is what we desire\nto desire or is more evolved, the question whether it is good remains\nopen, in the sense of not being settled by the meaning of the word\n“good.” We can ask whether what we desire to desire is\ngood, and likewise for what is more evolved, more unified, or whatever\n(1903: 10–17/1993: 62–69). Sidgwick had used one form of\nthis argument against Bentham and Spencer, but only in passing (1907:\n26n, 109); Moore developed it a greater length and made it central to\nhis metaethics. And though he applied it specifically to\n“good,” it can equally well be used about other moral or\nnormative concepts such as “ought” and\n“duty.”\n\nThe open-question argument was extensively discussed in\n20th-century metaethics and met with several objections.\nOne said the argument’s persuasiveness depends on the\n“paradox of analysis”: that any definition of a concept\nwill, if it is successful, appear uninformative. If an analysis does\ncapture all its target concept’s content, the sentence linking\nthe two will be a tautology; but this is hardly a reason to reject all\nanalyses (Langford 1942). Here it can be replied that in other cases\naccepting a definition leads us to see that the sentence affirming it,\nwhile initially seeming informative, in fact is not; thus “a\nbachelor is an unmarried man” is not informative. This does not\nhappen, however, in the case of “good.” Even if we agree\nthat only pleasure is good, no amount of reflection will make us think\n“Pleasure is good” is equivalent to “Pleasure is\npleasure”; Ross, for one, gave this response (1930:\n92–94). Another objection, made from the 1970s on and very\ninfluential, says that while the open-question argument may show that\nthe concept “good” is distinct from any non-moral concept,\nit cannot support a similar conclusion about the property of goodness.\n(Recall that Moore tended not to distinguish concepts from\nproperties.) Empirical science, the objection runs, uncovers many\nnon-analytic property-identities, for example, that the property of\nbeing water is identical to the property of being H2O even\nthough the concepts “water” and\n“H2O” are distinct. By analogy, the property of\ngoodness could be identical to that of being pleasant even if\n“good” and “pleasant” have different meanings\n(e.g. Brink 1989: Ch. 6). Moore’s mistake, then, was to think\nthat what may indeed hold for the concept “good” also\nholds for the property of goodness. Again, however, it can be replied\nthat natural-kind properties such as being water have special features\nthat allow non-analytic identities but that aren’t had by\nethical properties such as goodness, for which such identities are\nimpossible. More specifically, it can be argued, the property of being\nwater is the property of having that underlying structure, whichever\nit is, the explains the behaviour of the stuff found in lakes, rivers,\nand streams; when this structure turns out to be H2O, the\nlatter property “fills a gap” in the former and makes the\ntwo identical (Parfit 2011, vol. 2: 298–303, 329–38; also\nGampel 1996). But this explanation does not extend to the case of\ngoodness, which is not a higher-level property with any gap that needs\nfilling. To be good is not to have whatever other property plays some\nfunctional role; it is just to be good. It follows that if goodness is\nanalytically distinct from any natural property, it is metaphysically\ndistinct from it too.\n\nIt is worth noting, however, that Moore did not explain his\nopen-question argument in the way many later non-cognitivists, who\nlikewise endorsed the argument, would. Following Hume, they held that\nmoral judgements are intrinsically motivating, so that sincerely\naccepting “x is good” requires a commitment or at\nleast some motivation to pursue x if that is possible (e.e.\nHare 1952: 81–93; Hare 1963: 22–29). But then no analysis\nof “good” in purely natural terms can succeed, since it\ncannot capture the term’s action-guiding force; nor can an\nevaluative conclusion be validly inferred from premises none of which\nhave that force. Whatever the merits of this Humean explanation, Moore\nhimself did not give it. The question whether moral judgements are\nintrinsically motivating is not one on which he expressed clear views\nor which he apparently thought important. In Principia Ethica\nhe remarked in passing that we “hardly ever” think\nsomething good without having some attitude of will towards it, but he\ndenied that this is true universally (1903: 131, 135–6/1993:\n181–82, 186). Whether it is true universally, and what might\nfollow if it is, is not something he seems to have thought it worth\nconsidering further.\n2. Metaethical Innovations\n\nThe main elements of Moore’s non-naturalism – moral\nrealism and the autonomy of ethics – had been defended earlier\nby Sidgwick and others and were reasonably well known when Moore\nwrote. This is reflected in the initial reviews of Principia\nEthica, many of which questioned its claims to metaethical\noriginality (see Welchman 1989). But Moore did add two metaethical\ninnovations. One was his view that the fundamental moral concept is\n“good” (plus its contrary “bad”), which he\nexpressed by saying that goodness is simple and unanalyzable, even in\nmoral terms. This had not been Sidgwick’s view. For him the\ncentral moral concept was “ought,” and he defined good in\nterms of ought, more specifically, as what one ought to desire (1907:\n112). Principia Ethica took the exactly opposite view,\ndefining ought in terms of good, so “one ought to do\nx” literally means “x will produce the\nmost good possible” (1903: 25, 146–48/1993: 76–77,\n196–98). But Moore was quickly persuaded by Bertrand Russell\nthat this view is vulnerable to his own open-question argument, since\nin saying “one ought to do what will produce the most\ngood” we do not mean “what will produce the most good will\nproduce the most good” (Russell 1904: 330). In later work such\nas Ethics he therefore held that ought is a distinct moral\nproperty from good (1912: 173, 180–81/1947: 107–08,\n112–13/1965: 73, 76–77; also 1942: 558–59), and in\nan uncompleted Preface to a planned second edition of Principia\nEthica he allowed that it would not affect the essence of his\nnon-naturalism if good were defined in moral terms, say, as what one\nought to desire (1993: 5, 14–15). But he continued to prefer the\nview that good is a simple concept, not definable in deontic terms\n(1942: 574–77), and there was vigorous debate on this topic in\nthis general period, with Brentano, Broad, and A.C. Ewing defending\nreductive analyses similar to Sidgwick’s while Ross preferred a\nnon-reductive view like Moore’s. On the Moorean view judgements\nabout the goodness of states of affairs are not shorthand for\njudgements about how we ought or have reason to respond to those\nstates; they are independent judgements that explain, synthetically\nbut as following “from the very nature” of goodness, why\nwe ought so to respond.\n\nMoore’s second innovation was his view that the intrinsic value\nof a state of affairs can depend only on its intrinsic properties,\nones it has apart from any relations to other states. Earlier writers\nhad distinguished between goodness as an end, which they also called\nintrinsic or ultimate goodness, and goodness as a means, and had said\nthe former cannot rest just on a state’s causally producing\ngoods external to itself. But they seemed to allow that goodness as an\nend can depend on other relational properties; thus they talked as if\na belief’s being true, which is necessary for its being\nknowledge, can increase its value, while a pleasure’s being that\nof a bad person can make it worse. Moore did not explicitly state his\nmore restrictive view that intrinsic goodness can depend only on\nintrinsic properties until “The Conception of Intrinsic\nValue” of 1922, but it nonetheless guided Principia\nEthica at two points. One was the book’s specific\nformulation of its principle of organic unities, discussed below. The\nother was its testing for a state’s intrinsic value by the\n“method of isolation,” which involves asking whether a\nuniverse containing only that state and no other would be good (1903:\n91, 93, 95, 187–88, 208/1993: 142, 145, 147, 236–37, 256);\nthe point of this method is precisely to insulate judgements of\nintrinsic value from facts about a state’s external relations by\nensuring that there are none such. Moore’s strict view was\nshared by some later writers such as Ross (1930: 75), while others\nargued that a better theory of value results if intrinsic goodness is\nallowed to depend on some relational properties (e.g. Ewing 1947:\n114). But Moore was the first to raise this issue clearly.\n\nThese two innovations, though not trivial, do not affect the core of a\nnon-naturalist metaethics. Some critics, however, charge that Moore\ndid change that view fundamentally, and for the worse. They say\nSidgwick’s non-naturalism was comparatively modest, holding only\nthat there are truths about what people ought or have reason to do\nthat we can know by reflection. Moore, the objection runs,\nsupplemented this modest view with an extravagant metaphysics of\nnon-natural properties inhabiting a dubious supersensible realm and a\nmysterious faculty of intuition that acquaints us with them. These\nadditions opened non-naturalism to entirely avoidable objections and\nled, regrettably, to its widespread rejection by later philosophers\n(e.g. Mackie 1976: 323; Shaver 2000: 263–65; Phillips 2011:\n29–30).\n\nThese charges are, however, hard to sustain. Principia Ethica\nactually downplayed the metaphysical side of its non-naturalism,\nsaying that goodness has “being” but does not\n“exist”, as numbers, too, have being but do not exist; in\nparticular, goodness does not exist in any “supersensible\nreality,” because there is no such reality (1903: 110–12,\n123–25/1993: 161–63, 174–76). What exactly Moore\nmeant by these claims is unclear, but it’s at least possible to\nread them as suggesting a non-metaphysical moral realism like those\ndefended more recently by Nagel (1986), Scanlon (1998, 2014), and\nParfit (2011, vol. 2: 464–87 ). Nor did his explicit talk of\nproperties mark a significant departure from Sidgwick. This is partly\nbecause he did not clearly distinguish concepts and properties, and\npartly because if Sidgwick thought people ought to pursue pleasure, he\nwould surely have to grant that pleasure has the property of being\nsomething people ought to pursue. The question is how ontologically\nrobust Moore’s talk of a property of goodness was, and given his\ndenial that such goodness exists the answer is uncertain. The\ndistinction between more and less metaphysical forms of non-naturalism\nis not one he clearly addressed.\n\nMoore was similarly modest in his moral epistemology, saying several\ntimes, as Sidgwick also had, that by calling our knowledge of basic\nmoral truths “intuitive” he meant only that it is not\nderived by inference from other knowledge; he likewise denied that\nmoral intuition is infallible, saying that in whatever way we can\ncognize a true proposition, we can cognize a false one (1903: viii.\nx/1993: 34, 36). He did sometimes make bald assertions of\nself-evidence, as in his claim in Principia Ethica that it is\n“obvious” that the chief intrinsic goods are aesthetic\nappreciation and personal love (1903: 188/1993: 237) or in\nEthics that it is “self-evident” that what is\nright is always what most promotes the good (1912: 1809–81/1947:\n112–13/1965: 76–77), and some critics have found this\nbaldness troubling. But the contrast with earlier non-naturalists such\nas Sidgwick should again not be overdrawn. Sidgwick arguably, too,\ngave most weight to intuitions about abstract moral principles (1907:\n379–84), including one close to that which Moore cited in\nEthics, and appealed to more concrete judgements only in\nad hominem arguments against opponents. And Moore often\nargued in more complex ways. In Principia Ethica he defended\nhis claim that beauty on its own is good by appealing to intuitions\nabout a specific beautiful world, containing mountains, rivers, and\nsunsets (1903: 83–85/1993: 135–36), and criticized the\nview that only pleasure is good by arguing that it conflicts with\nseveral concrete things we believe, such as that there are bad\npleasures (1903: 95/1993:146–47) and that a life of intensely\npleasurable but illusory experiences would not be best (1903:\n197–98/1993: 246–47; compare 1912: 52–53,\n237–39/1947: 34, 146–47/1965: 22, 102). Moore likewise\ninsisted that before we make judgements of self-evidence we must make\nsure that the propositions we are considering are clear (1903:\nviii/1993: 34); failure to do so, he argued, explains many of the\nexisting disagreements about ethics. And he took note of common\nopinions to the extent of trying to explain away contrary views when\nhe found them. Overall his approach to establishing moral truths was\nclose to Sidgwick’s, appealing to intuitive judgements that can\nbe made at different levels of generality and that must be brought\ninto a coherent whole, though with the primary emphasis on abstract\njudgements. This is not to say his non-naturalism was beyond\nobjection. Any such view holds that there are truths independent of\nnatural and logical ones and knowable by some non-empirical means, and\nmany find this pair of claims problematic. But Moore’s version\nof the view was arguably no more objectionable than others. If\nSidgwick’s non-naturalism did not involve a problematic\nmetaphysics and epistemology, neither did Moore’s; if\nMoore’s was hopelessly extravagant, so was a supposedly more\nmodest one like Sidgwick’s.\n\nA final important feature of Moore’s metaethics was its\nreductionism about normative concepts. Like Sidgwick, the Moore of\nPrincipia Ethica held that there is just one basic normative\nconcept, though he thought it was good rather than ought; like Ross,\nthe later Moore held that there are just two. But this conceptual\nreductionism, which was common throughout the period from Sidgwick to\nRoss, Broad, and Ewing, contrasts with the plurality of concepts\nrecognized in much present-day ethics. First, Moore and his\ncontemporaries took as basic only the “thin” concepts good\nand ought rather than “thick” moral concepts such as\ncourage and generosity; the latter, they held, combined a thin concept\nwith some more or less determinate descriptive content. They were also\nreductive about the thin concepts. They did not distinguish between\nmoral oughts and prudential or rational ones, holding that there is\nonly the single, moral ought; this is why for them egoism was a view\nabout morality, not a challenge to it from outside the moral realm.\nNor did they recognize different types of value. For them goodness was\na property only of states of affairs and not, as some Kantians hold,\nof persons and other objects. They likewise did not accept the late\n20th-century idea that there is a distinct concept of\n“well-being,” or of what is “good for” a\nperson; instead, they often defined a person’s good as what is\nsimply good and located in his life (e.g. Sidgwick 1907: 112; Moore\n1903: 98–99/1993: 150–51). Nor did they distinguish\nbetween moral and non-moral goodness, holding that the former is just\nordinary goodness when possessed by certain objects, such as traits of\ncharacter (e.g. Ross 1930: 155). The result was that all normative\njudgements can be expressed using at most the two concepts\n“good” and “ought,” which are therefore the\nonly ones one needed. To some this conclusion will mean that Moore and\nhis contemporaries ignored important conceptual distinctions; to\nothers it will mean they avoided pointless conceptual debates. But it\ndid free them to discuss substantive questions about what is in fact\ngood and right. On this topic Moore’s views, though not entirely\nnovel, were again both striking and strikingly stated.\n3. Impersonal Consequentialism\n\nMoore’s normative view again comprised two main theses. One was\nimpersonal consequentialism, the view that what is right is always\nwhat produces the greatest total good impartially considered, or\ncounting all goods equally. The other was the ideal or perfectionist\nthesis that what is good is not only or primarily pleasure or the\nsatisfaction of desires but certain states whose value is independent\nof people’s attitudes to them. Moore recognized several such\nstates, but in Principia Ethica he famously said that\n“by far the most valuable things…are certain states of\nconsciousness, which may roughly be described as the pleasures of\nhuman intercourse and the enjoyment of beautiful objects” (1903:\n188/1993: 237). According to his ideal consequentialism, what is right\nis in large part what most promotes loving personal relationships and\naesthetic appreciation for all persons everywhere.\n\nPrincipia Ethica took the consequentialist part of this view\nto be analytically true, since it defined the right as what most\npromotes the good. But once Moore abandoned this definition, he had to\ntreat the consequentialist principle as synthetic and he did so in\nEthics, which allowed that deontological views that say some\nacts that maximize the good are wrong are coherent. But even there he\ndid not argue at length for consequentialism, simply announcing that\nit is self-evident (1912: 180–81/1947: 112–13/1965:\n76–77). This in part reflected a common assumption of his time,\nwhen a majority of moral philosophers accepted some form of\nconsequentialism. But it may also be relevant that the only\nalternative he seems to have considered was an absolute deontology\nlike Kant’s, which says that some acts such as killing and lying\nare wrong no matter what their consequences (1903: 106/1993: 157;\n1912: 175–81/1947: 109–13/1965: 74–77). His major\nethical works did not consider a moderate deontology such as would\nlater be developed by Ross (1930), in which deontological prohibitions\nagainst killing and lying often outweigh considerations of good\nconsequences but can themselves be outweighed if enough good is at\nstake. It is not clear what Moore’s response to such a moderate\ndeontology would have been.\n\nPrincipia Ethica also took the impartialism of its view to be\nanalytic, and in particular claimed that ethical or rational egoism,\nwhich says each person should pursue only his own good, is\nself-contradictory. (Despite his interest in personal love, Moore\nnever considered the intermediate view that Broad (1971)) would call\nself-referential altruism, according to which each person should care\nmore about the good of those close to him, such as his family and\nfriends.) Sidgwick had claimed that if a rational egoist confines\nhimself to saying that each person’s pleasure is good for him,\nor from his point of view, he cannot be argued out of his position\n(1907: 420–21). But Moore argued that the concept of\nagent-relative goodness invoked here is unintelligible (1903:\n97–102/1993: 148–53), and that conclusion does follow from\nhis view that goodness is simple and unanalyzable. If goodness is a\nsimple property, how can a state such as person A’s\npleasure have this property “from one point of view” but\nnot “from another”? (Compare squareness. An object cannot\nbe square from one point of view but not from another; it either is\nsquare or is not.) All that talk of the good “for” a\nperson can pick out, he urged, is what is simply good and located in\nthat person; and simple goodness gives everyone equally reason to\npursue it. In Ethics Moore abandoned this argument, saying\nthat egoism cannot be proven false by any argument, even though he\nthought its falsity is self-evident (1912: 228–32/1947:\n141–43/1965: 98–100). But it is not clear how he could\nmake this concession if he still held, as he preferred to, that\ngoodness is a simple property. Perhaps he was tacitly allowing, as he\nwould in the uncompleted draft Preface to Principia Ethica\n(1993: 5, 14–15), that it would not centrally damage his\nposition if good were analyzed in terms of ought, as it had been by\nSidgwick. There is no contradiction in saying that what each person\nought to desire is different, say, just his own pleasure. But if all\noughts derive from a simple property of goodness, as Moore always\npreferred to hold, all oughts must be impartial.\n\nIn applying this view, Moore gave it the form of what today is called\n“indirect” or “two-level” (Hare 1981)\nconsequentialism. In deciding how to act, we should not try to assess\nindividual acts for their specific consequences; instead, we should\nfollow certain general moral rules, such as “Do not kill”\nand “Keep promises,” which are such that adhering to them\nwill most promote the good through time. This policy will sometimes\nlead us not to do the act with the best individual outcome, but given\nour general propensity to error the policy’s consequences will\nbe better in the long run than trying to assess acts one by one;\nhowever well-meaning, the latter attempt will be counterproductive\n(1903: 149–70/1993: 198–219. This indirect\nconsequentialism had again been defended earlier, by Sidgwick and John\nStuart Mill, but Moore gave it a very conservative form, urging\nadherence to the rules even in the face of apparently compelling\nevidence that breaking them now would be optimific. Principia\nEthica made the surprising claim that the relevant rules will be\nthe same given any commonly accepted theory of the good, for example,\ngiven either hedonism or Moore’s own ideal theory (1903:\n158/1993: 207). This claim of extensional equivalence for different\nconsequentialist views was not new; T.H. Green, F.H. Bradley, and\nMcTaggart had all suggested that hedonism and ideal consequentialism\nhave similar practical implications. But Moore was surely expressing\nthe more plausible view when in Ethics he doubted that\npleasure and ideal values always go together (1912: 234–39/1947:\n144–47/1965: 100–02), and even when he accepted the\nequivalence claim he remained intensely interested in what he called\n“the primary ethical question of what is good in itself”\n(1903: 158, 26, 77/1993: 207, 78, 128). Like Green, Bradley, and\nMcTaggart, he thought the central philosophical question is what\nexplains why good things are good, i.e., which of their\nproperties make them good. That was the subject of his most\nbrilliant piece of ethical writing, Chapter 6 of Principia\nEthica on “The Ideal.”\n4. The Ideal\n\nOne of this chapter’s larger aims was to defend value-pluralism,\nthe view that there are many ultimate goods. Moore thought one bar to\nthis view is the naturalistic fallacy. He assumed, plausibly, that\nphilosophers who treat goodness as identical to some natural property\nwill usually make this a simple property, such as just pleasure or\njust evolutionary fitness, rather than a disjunctive property such as\npleasure-or-evolutionary-fitness-or-knowledge. But then any naturalist\nview pushes us toward value-monism, or toward the view that only one\nkind of state is good (1903: 20; 1993: 72). Once we reject naturalism,\nhowever, we can see what Moore thought is self-evident: that there are\nirreducibly many goods. Another bar to value-pluralism is excessive\ndemands for unity or system in ethics. Sidgwick had used such demands\nto argue that only pleasure can be good, since no theory with a\nplurality of ultimate values can justify a determinate scheme for\nweighing them against each other (1907: 406). But Moore, agreeing here\nwith Rashdall, Ross, and others, said that “to search for\n‘unity’ and ‘system,’ at the expense of truth,\nis not, I take it, the proper business of philosophy” (1903:\n222/1993: 270). If intuition reveals a plurality of ultimate goods, an\nadequate theory must recognize that plurality.\n\nAccording to a famous part of Principia Ethica, one of those\ngoods is the existence of beauty. Arguing against Sidgwick’s\nview that all goods must be states of consciousness (1907:\n113–15), Moore asked readers to imagine a beautiful world with\nno minds in it: is this world’s existence not better than that\nof a horribly ugly world (1903: 83–85/1993: 135–36)? In\nanswering yes, he anticipated some strands in present-day\nenvironmental ethics, which likewise hold that there can be value in\nfeatures of the natural environment apart from any awareness of them.\nBut he did not insist on this view. Later in Principia Ethica\nhe said that beauty on its own at most has little and may have no\nvalue (1903: 202, 203/1993: 250, 251), and in Ethics he\nimplicitly denied that beauty on its own has value. There he held, as\nSidgwick had, that all intrinsic goods involve some state of\nconsciousness and perhaps even of pleasure (1912: 239–41,\n249/1947: 147–49, 153/1965: 103–04, 107). But his first\nbook had defended the contrary view.\n\nMoore also gave some weight to the hedonic states of pleasure and\npain. He thought the former a very minor good, saying pleasure on its\nown at most has limited and may have no value, but he thought pain a\nvery great evil, which there is a serious duty to prevent (1903:\n212–13, 222–23/1993: 260–61, 270–71) His view\ntherefore involved a value-asymmetry, with pain a much greater evil\nthan pleasure is a good. This had not been the traditional view; most\nhedonists had held that a pleasure of a given intensity is exactly as\ngood as a pain of the same intensity is evil (e.g. Sidgwick 1907:\n413). But Moore thought it intuitively compelling that the pain is\nworse; if that makes the theory of value less systematic, so much the\nworse for system.\n\nWhile many ideal consequentialists have treated knowledge as\nintrinsically good, in some cases supremely so, Principia\nEthica did not, saying knowledge is a necessary component of the\nlarger good of appreciating existing beauty but has little or no value\nin itself (1903: 199/1993: 248). Again Ethics may have\nreversed this view, citing knowledge several times as one ideal good\nthat may be added to the hedonists’ good of pleasure (1912: 237,\n247/1947 146, 152/1965: 102, 106). But Moore never saw any intrinsic\nvalue in achievement, for example in business or politics, or indeed\nin any active changing of the world. As John Maynard Keynes said, his\nchief goods were states of mind that “were not associated with\naction or achievement or with consequence. They consisted in timeless,\npassionate states of contemplation and communion, largely unattached\nto ‘before and after’” (Keynes 1949: 83).\n\nThe first of these goods was the appreciation of beauty, which for\nMoore combined the cognition of beautiful qualities with an\nappropriately positive emotion toward them, such as enjoyment or\nadmiration. We listen to music, for example, hear beautiful qualities\nin it, and are pleased by or admire those qualities. But the value\nhere is entirely contemplative; Moore saw no separate worth in what\nthe romantics had especially valued, the active creation of beauty. He\nmight say that an artist must understand and love his work’s\nbeauty if he is to create it, perhaps even more than someone who\nmerely enjoys it, but the value in his work is still not distinctively\ncreative. In characterizing this good Moore gave a further reductive\nanalysis, this time of beauty as “that of which the admiring\ncontemplation is good in itself” (1903: 201–02/1993:\n249–50). Beauty too, then, was not a distinct normative concept\nbut analyzable in terms of goodness. He did not notice, however, that\nthis definition seems again to open him to an open-question argument,\nsince it reduces the claim that it is good to contemplate beauty to\nthe near-tautology that it is good to contemplate what it is good to\ncontemplate.\n\nThough Moore in Principia Ethica thought beauty good in\nitself, he did not insist on this view when valuing the appreciation\nof beauty; the latter might be good even if the former was not. But he\nstill thought the existence of beauty makes a significant difference\nto value. More specifically, he thought the admiring contemplation of\nbeauty that actually exists and causes your contemplation is\nsignificantly better than an otherwise similar contemplation of merely\nimagined beauty, and better by more than can be attributed to the\nexistence of the beauty on its own. This view involved an application\nof his “principle of organic unities,” which is one of his\nmain contributions and says the value of a whole need not equal the\nsum of the values its parts would have on their own (1903:\n27–29/1993: 78–80). If state x on its own has\nvalue a and state y on its own has value b,\nthe whole combining them by relation R need not have value\na + b; it may have more and it may have less. This\nprinciple had been accepted by Idealists such as Bradley, who gave it\na characteristically anti-theoretical formulation. They held that if\nx and y combine to form the whole x-R-y,\ntheir values, like their very identities, are dissolved in that larger\nwhole, whose value cannot be computed from the values of its parts. It\nwas Moore’s contribution to accept the principle in a way that\nrejected this anti-theoretical interpretation and allowed computation,\nthough exactly how it did so depended on his strict view that\nintrinsic value can depend only on intrinsic properties.\n\nThis view implies that when x and y enter into the\nrelation R that constitute the whole x-R-y, their\nown values cannot be changed by those relations. Moore recognized\nthis, saying, “The part of a valuable whole retains exactly the\nsame value when it is, as when it is not, a part of that whole”\n(1903: 30/1993: 81). Any additional value in the whole x-R-y\nmust therefore be attributed to it as an entity distinct from its\nparts, and with the relations between those parts internal to it.\nMoore called this additional value the value of a whole “as a\nwhole,” and said it needed to be added to the value in the parts\nto arrive at the whole’s value “on the whole” (1903:\n214–16/1993: 263–64). Thus, if x and y\nhave values a and b on their own, and x-R-y\nhas value c “as a whole,” the value of\nx-R-y “on the whole” is a + b +\nc. (The value of the whole is therefore not equal to the sum\nof the values of its parts, but is equal to a sum of which those\nvalues are constituents.) This “holistic” formulation of\nthe principle of organic unities is not the only possible one. We\ncould relax the conditions on intrinsic value so it can be affected by\nexternal relations and say that when x and y enter\ninto a whole their own values change, so that, say, x’s\nvalue becomes a + c. This “variability”\nformulation can always reach the same final conclusions as the\nholistic one, since whatever positive or negative value the latter\nfinds in the whole as a whole the former can add to one or other of\nthe parts. But the two formulations locate the additional value in\ndifferent places, and sometimes one and sometimes the other gives what\nseems the intuitively better explanation of an organic value (Hurka\n1998). Moore, however, was forced by his strict view of intrinsic\ngoodness to use only the holistic formulation. In the aesthetic case,\nhe held that the admiring contemplation of beauty considered apart\nfrom the existence of its object always has the same (moderate) value\na, while the existence of beauty always has the same\n(minimal) value b. But when the two are combined so a person\nadmiringly contemplates beauty that exists and causes his\ncontemplation, the resulting whole has the significant additional\nvalue c as a whole. The existence of the beauty is therefore\nnecessary for the significant value c, but that value is not\nintrinsic to it, belonging instead to the larger whole of which it is\npart.\n\nMoore made several other uses of the principle of organic unities,\nincluding in response to an argument of Sidgwick’s for hedonism.\nSidgwick had claimed that there would be no value in a world without\nconsciousness and, more specifically, pleasure, and had concluded that\npleasure must therefore be the only good (1907: 113, 399–401).\nGiven Principia Ethica’s view about the value of\nbeauty, Moore there rejected the premise of Sidgwick’s argument,\nbut he also argued that, even granting this premise, Sidgwick’s\nconclusion does not follow. It may be that pleasure is a necessary\ncondition for any value, but that once pleasure is present, other\nstates such as the awareness of beauty or personal love increase the\nvalue of the resulting whole even though alone they have no worth\n(1903: 92–94/1993: 144–45; also 1912: 240–46/1947:\n148–51/1965: 103–06). And of course this was precisely his\nlater view. Another application of the principle was in explicating\nclaims about desert. Moore endorsed the retributive view that when a\nperson is morally vicious it is good if he is punished, and he\nexpressed this view by saying that although the person’s vice is\nbad and his suffering pain is bad, the combination of vice and pain in\nthe same life is good as a whole, and sufficiently so to make the\nsituation on the whole better than if there were vice and no pain\n(1903: 214–15/1993: 263–64). This is in fact a point where\nMoore’s holistic formulation of the principle is positively\nappealing. The alternative variability view must say that when a\nperson is vicious, his suffering pain switches from being purely bad\nto being purely good. But this implies that the morally appropriate\nresponse to deserved suffering is simply positive, for example simple\njoy, which does not seem right; the better response mixes satisfaction\nthat justice is being done with sorrow at the infliction of pain, as\nMoore’s holistic view implies.\n\nMoore’s other chief good of personal love also involved admiring\ncontemplation, but now of objects, namely persons, that are not just\nbeautiful but also intrinsically good (1903: 203/1993: 251). Since for\nMoore the main intrinsic goods were mental qualities, such love\ninvolved primarily the admiring contemplation of another’s good\nstates of mind. In so characterizing love Moore was applying one of\nfour recursive principles he used to generate higher-level intrinsic\ngoods and evils from an initial base-set of goods and evils. The first\nprinciple says that if state x is intrinsically good,\nadmiringly contemplating, or loving, x for itself is also\nintrinsically good (1903: 203–04, 217/1993: 251–53, 265).\nThus, if person A’s admiringly contemplating beauty is\ngood, person B’s admiringly contemplating\nA’s admiration is a further good, as is\nC’s admiration of B’s admiration, and so\non. A second principle says that if x is intrinsically evil,\nhating x for itself is intrinsically good (1903: 217/1993\n265); thus, B’s feeling compassionate pain at\nA’s pain is good. And two final principles say that\nloving for itself what is evil, as in sadistic pleasure in\nanother’s pain, and hating for itself what is good, as in\nenvious pain at his pleasure, are evil (1903: 208–10,\n211–12/1993: 257–58, 259–60). Though Moore stated\nthese four principles separately, they all make morally appropriate\nattitudes to intrinsic goods and evils, ones whose orientation matches\ntheir objects’ values, additional such goods and morally\ninappropriate attitudes additional evils. The principles were by no\nmeans unique to him; they had been defended earlier by Rashdall and\nBrentano and would be defended later by Ross. But Moore’s\nformulation was in two respects distinctive. Rashdall and Ross called\nthe higher-level values they generated virtues and vices, as it is\nindeed plausible to do; surely benevolence and compassion are virtuous\nand sadism vicious. But Moore preferred to define the virtues\ninstrumentally, as traits that cause goods and prevent evils, and said\nthat as such they lack intrinsic worth (1903: 172–77/1993:\n220–26). Rashdall and especially Ross also held that virtue is\nthe greatest intrinsic good and vice the greatest evil. In contrast,\nMoore suggested that the value of an appropriate or inappropriate\nattitude is often less than the value of its object; thus compassion\nfor another’s pain, though good, is not as good as the pain is\nevil, so the combination of one person’s pain and\nanother’s compassion for it has on balance negative value.\n“We have no reason,” he wrote, “to maintain the\nparadox that an ideal world would be one in which vice and suffering\nmust exist in order that it may contain the goods consisting in the\nappropriate emotion towards them. … we cannot admit the actual\nvalidity of any of the arguments commonly used in Theodicies; no such\nargument succeeds in justifying the fact that there does exist even\nthe smallest of the many evils which this world contains” (1903:\n220/1993: 268)\n\nThe recursive principles are clearly relevant to personal love, whose\ncore involves positive concern for another’s good. But\nMoore’s particular application of the principles led to a\ncuriously restricted picture of what love is. First, as in the\naesthetic case, he took the main valuable attitude to be\ncontemplative, involving the admiration of another’s already\nexisting good qualities rather than any active engagement with them.\nThis applied even to the love of another’s physical beauty.\nThough he thought this a central part of love (1903:\n203–04/1993: 252), he took it to involve mere passive admiration\nof another’s beauty, as it were from the other side of the room.\nThere was no desire to possess or interact physically with the\nother’s beauty, that is, no active eroticism; he actually held\nthat sexual arousal, and especially arousal by another’s\narousal, involves love of the ugly or evil and so is evil (1903:\n209–10/1993: 257–58). The same point applied more\ngenerally: the loving attitude was one of appreciating goods in\nanother’s life rather than of acting to produce or to help her\nachieve them. One did not do anything for or with a loved one; one\nsimply admired her. (In an 1899 paper presented to the Apostles\nsociety at Cambridge he had said, “Love of others is a thing of\nvery great value, and it may be very strong although it does not lead\nto any action. There is, indeed, no reason why it should”\n(quoted in Levy 1979: 203).Though he presented personal love as an\nadditional good to aesthetic appreciation, he characterized it in an\nessentially aesthetic way. Moreover, his list of the goods one is to\nappreciate or comment in a loved one was also truncated. It did not\ninclude pleasure or happiness, since that was not a significant good,\nnor even knowledge or achievement. Instead, it centered on the\nother’s admiring contemplation of beauty (1903: 204/1993:\n252–53), as if the supreme expression of love were “What\nexcellent taste in pictures you have.” Finally, he took the\nqualities one appreciates in a loved one to be simply and therefore\nimpartially good. This meant his account had no room for the special\nattachment to or heightened concern for an individual that many take\nto be central to personal love. If I love a friend for qualities\nx, y, and z, and a new person comes along\nwith the same qualities to a slightly higher degree, then, on\nMoore’s theory, I should admire the new person’s qualities\nmore and therefore love them more; I should trade up to a better\nbeloved. This is at odds with the loyalty, or attachment to\nindividuals, that many think essential to love. This is not to say\nthat a more adequate account of love cannot be constructed with the\nsame basic structure as Moore’s; it can. It will hold that\npersonal love involves a wider range of positive attitudes, including\nactively promoting as well as contemplating, to a wider range of\ngoods, including happiness, knowledge, and achievement, where those\ngoods in a loved one’s life have greater value from a\nlover’s point of view than do the similar states of strangers,\nwhich makes loving them more appropriate and therefore intrinsically\nbetter. But Moore was prevented from giving this account by other\nfeatures of his view, such as his general emphasis on contemplative\nforms of love, his restricted list of initial goods, and his strict\nimpartialism about value.\n5. Influence\n\nDespite not always containing entirely new ideas, Moore’s\nethical writings, and especially Principia Ethica, were\nextremely influential, both outside and within philosophy. Outside\nphilosophy one influence was through the literary and artistic figures\nin the Bloomsbury Group, such as Keynes, Lytton Strachey, and Leonard\nand Virginia Woolf, several of whom had come to know Moore while\nmembers with him of the Apostles. They were most impressed by the last\nchapter of Principia Ethica, whose identification of\naesthetic appreciation and personal love as the highest goods very\nmuch fit their predilections. Keynes said the book’s publication\nwas for them “the opening of a new heaven on a new earth”\nand its theory of the good became for a time their\n“religion” (1949: 82) Many of them – the gay men in\nparticular – sexualized Moore’s account of love, adding an\nerotic element not present in his formulations. But according to\nKeynes (though Leonard Woolf (1960: 146–49) disagreed), they\ntended to ignore the impartial consequentialism within which he\nembedded those goods, concentrating on pursuing them just within their\nown lives rather than encouraging their wider spread in society. The\nnovels of E.M. Forster, another Cambridge Apostle, contain several\nfigures representing Moorean ideas, for example the Schlegel sisters\nin Howards End (Sidorsky 2007). An important element in\nPrincipia Ethica’s extra-philosophical appeal was its\nbrash iconoclasm, its claiming, however inaccurately, to sweep away\nall past moral philosophy. This tone entirely fit its time, when the\ndeath of Queen Victoria had led many in Britain to think a new, more\nprogressive age was dawning.\n\nThe book’s influence within philosophy was even greater. On the\nnormative side, views close to its ideal consequentialism remained\nprominent and even dominant, at least in Britain, until the 1930s,\nthough it is hard to know how far this is attributable to Moore\nhimself since similar views had been widely accepted before him. In\nmetaethics his non-naturalism likewise remained dominant for several\ndecades, though here Moore played a larger role, especially for later\nwriters, in part because of his general philosophical eminence and in\npart because of the vigor with which he presented the view. By talking\nexplicitly of non-natural properties he at least seemed to give\nnon-naturalism a more robust metaphysical side than predecessors such\nas Sidgwick had, and he defended the view more emphatically, in\nparticular by putting more weight on the open-question argument. When\nSidgwick noticed Bentham or Spencer equating goodness with a natural\nproperty such as pleasure, he thought it a minor slip that ought in\ncharity to be ignored; Moore deemed it a decisive error that vitiated\nthe philosopher’s entire system. By so emphasizing the two\nelements of non-naturalism – its realism and its commitment to\nthe autonomy of ethics – Moore helped initiate a sequence of\ndevelopments in 20th-century metaethics.\n\nThe first reaction to non-naturalism, other than simple acceptance,\ncame from philosophers who endorsed the autonomy of ethics but,\nsometimes under the influence of logical positivism, rejected its\nmoral realism, holding instead that there are no facts other than\nnatural ones and no modes of knowing other than the empirical and the\nstrictly logical. They therefore developed various versions of\nnon-cognitivism, which hold that moral judgements are not true or\nfalse but express attitudes, as in emotivism (Ayer 1936; Stevenson\n1944), or issue something like imperatives, as in prescriptivism (Hare\n1952; Hare 1963). Unlike the subjective naturalism Moore criticized in\nEthics, these views allow moral disagreement, since attitudes\nand imperatives can oppose each other, for example positive versus\nnegative. They also, their later proponents held, give a better\nexplanation of the open-question argument, since they find a\ndistinctive emotive or action-guiding force in moral concepts and\njudgements that is not present in non-moral ones; that is why, it was\nsaid, the moral is neither reducible to nor derivable from the\nnon-moral. Non-cognitivism can also explain, some said, why morality\nmatters to us as it does. Non-naturalism implies that moral judgements\nconcern a mysterious type of property, but why should facts about that\nproperty be important to us or influence our behavior? If moral\njudgements express deep-seated attitudes, however, the question\nanswers itself.\n\nA later reaction, starting around the mid-century, rejected both\nnon-naturalism and non-cognitivism and explored versions of\nnaturalism, including a neo-Aristotelian version that grounds all\nethical demands in a conception of human flourishing, or of the\ndevelopment of a human nature understood in quasi-biological terms\n(Anscombe 1958; Foot 2001); this view implicitly denies the autonomy\nof ethics. Here a specifically ant-Moorean claim was that predicative\nuses of “good,” as in Moore’s “aesthetic\nappreciation is good,” are ungrammatical, since the only\nlegitimate uses of the word in English are attributive, as in\n“good knife,” “good pickpocket,” and, most\nrelevantly to the neo-Aristotelian view, “good human\nbeing” (Geach 1956; also Thomson 1997). But, despite being made\nat the high-water mark of ordinary-language philosophy, this claim\nabout English grammar seems plainly false: the language has always\nallowed predicative uses of “good,” from the King James\ntranslation of Genesis – “God saw the light, that it was\ngood” (cited in Butchvarov 1989: 17) – to everyday phrases\nsuch as “It is good that …” Moore’s moral\nphilosophy cannot credibly be dismissed as resting on a crude\nlinguistic error (see also e.g. Pigden 1990; Zimmerman 1999; Kraut\n2011: 173–83). One strand in this later reaction, like others\ninfluenced by Wittgenstein, rejected the calculating side of\nMoore’s consequentialism, which identifies right and wrong acts\nby adding up the goods and evils in their consequences. Moral\njudgements, some argued, can’t be codified or theorized in this\nway but instead call for ethically trained and sensitive insight into\nparticular situations as particular (e.g. McDowell 1979). Even apart\nfrom that there was, in many circles, skepticism about the supposed\nextravagance and dogmatism of Moore’s substantive claims about\nthe good – such as his specific valuing of aesthetic\nappreciation and personal love – and a preference for the\nallegedly more modest view that what is good in people’s lives\nis just the fulfilment of whatever desires they have. By the 1960s, it\nseems fair to say, many of Moore’s views were thought deeply\nproblematic and his moral philosophy as a whole was not considered an\nespecially live option. It was still thought important to read\nPrincipia Ethica, or at least its first chapter, as having\ninitiated the sequence of developments that led to the then-current\nviews. But from the standpoint of many of those views, Moore’s\ngeneral approach to ethics was at key points misguided.\n\nFifty-plus years later the philosophical climate is more favorable to\nMoore. A number of philosophers now defend metaethical non-naturalism\n(e.g. Shafer-Landau 2003; Huemer 2006), either in versions they say\nare ontologically minimalist (Nagel 1986; Scanlon 1998, 2014; Parfit\n2011, vol. 2: 464–87) or in ones they present as more robust\n(Enoch 2011), but all embracing some account of normative truth that\nseparates it sharply from non-normative, for example scientific,\ntruth. In addition, and of necessity, these current versions of\nnon-naturalism share something close to Moore’s moral\nepistemology, his view that normative truths are known by a kind of\ndirect insight or intuition, though the present-day views are often\nmore explicitly fallibilist and coherentist than his sometimes\nappeared to be. Still, for many philosophers, Moore’s version of\nnon-naturalist realism remains the best-known or canonical one. In\nnormative ethics, too, there is increasing sympathy for accounts of\nthe good with an ideal or perfectionist content and admiration for\nparticular features of Moore’s own account, such as his valuing\nof personal love, his recursive principles (Hurka 2001) and his\nprinciple of organic unities. Moorean ideas are by no means the only\nones alive in present-day moral philosophy; there are many\nalternatives, including many that reject, for example, his\nconsequentialism and impartialism. One especially relevant strand in\nthe recent literature, dating from the 1980s, says ethics needs the\nnon-Moorean concept of “good for” mentioned above, which\nis associated with “well-being” and “prudential\nvalue” and also distinct from the agent-relative goodness\nSidgwick used to state egoism. Here one view proposes to use this\nalternative concept in addition to the Moorean “good,” so\nwhat is simply good is wholly or at least largely what is good\n“for” individuals (e.g. Sumner 1996). Another, more\nradical view wants “good for” to entirely replace\nMoore’s “good,” so the former is the only ethically\nsignificant evaluative concept (e.g. Kraut 2007; Kraut 2011). (The\nargument here is not, as in Geach, that the Moorean “good”\nis ungrammatical; it is that, though linguistically unimpeachable, it\nmakes no useful contribution to ethical thought.) But there have also\nbeen defences, against these views, of Moore’s “simply\ngood” and his reductive or “locative” account of\n“good for” (e.g. McDaniel 2014; Rowland 2016; Tucker 2018;\nHurka 2021). Often what present-day philosophers take from Moore is\njust an individual idea or argument rather than his theory as a whole\n(Regan 2003 is an exception). But whereas in the early 20th century\nMoore’s approach to ethics, and especially his metaethics, was\ndominant, at least in British moral philosophy, and whereas in the\nmid-century it was widely dismissed, it now represents, at several\npoints, a valuable contributor to many lively ongoing debates.\n",
    "bibliography": {
        "categories": [
            "Primary Sources",
            "Secondary Sources",
            "Special Issues"
        ],
        "cat_ref_text": {
            "Primary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "“Mr. McTaggart’s Ethics,” <em>International\nJournal of Ethics</em>, 13 (1903): 341–70; reprinted in <em>The\nEarly Essays</em>, pp. 201–32",
                "<em>Principia Ethica</em>, Cambridge: Cambridge University Press,\n1903; revised edition with “Preface to the second edition”\nand other papers, T. Baldwin (ed.), Cambridge: Cambridge University\nPress, 1993 (page references are first to the original and then to the\nrevised edition).",
                "Review of Franz Brentano, <em>The Origin of the Knowledge of Right\nand Wrong</em>, <em>International Journal of Ethics</em>, 14 (1903):\n115–23.",
                "Review of Hastings Rashdall, <em>The Theory of Good and Evil</em>,\n<em>Hibbert Journal</em>, 6 (1907–8): 446–51.",
                "<em>Ethics</em>, London: Williams and Norgate, 1912; London:\nOxford University Press, 1947 (hardcover); London: Oxford University\nPress, 1965 (paperback) (page references are first to the original\nedition, then to the OUP hardcover, then to the OUP paperback).",
                "“The Conception of Intrinsic Value” and “The\nNature of Moral Philosophy,” in G.E. Moore, <em>Philosophical\nStudies</em>, London: Routledge &amp; Kegan Paul, 1922, pp.\n253–75 and 310–39; “The Conception of Intrinsic\nValue” reprinted in Revised edition of <em>Principia\nEthica</em>, pp. 280–98",
                "“Is Goodness a Quality?”, <em>Proceedings of the\nAristotelian Society, Supplementary Volume</em>, 11 (1932):\n116–31.",
                "“An Autobiography” and “A Reply to My\nCritics,” in P.A. Schilpp (ed.), <em>The Philosophy of G.E.\nMoore</em>, Evanston, IL: Northwestern University Press, 1942, pp.\n3–39 and 535–687.",
                "<em>The Early Essays</em>, Tom Regan (ed.), Philadelphia: Temple\nUniversity Press, 1986.",
                "<em>The Elements of Ethics</em>, T. Regan (ed.), Philadelphia:\nTemple University Press, 1991.\n</ul>\n<h3 id=\"SecoSour\">"
            ],
            "Secondary Sources": [
                "</h3>\n<ul class=\"hanging\">",
                "Anonymous, 1903, Review of <em>Principia Ethica</em>,\n<em>Athenaeum</em>, 3794: 847–8.",
                "Anscombe, G.E.M., 1958, “Modern Moral Philosophy,”\n<em>Philosophy</em> 35: 1–19.",
                "Ayer, A.J., 1936, <em>Language, Truth, and Logic</em>, London:\nVictor Gollancz.",
                "Baldwin, Thomas, 1990, <em>G.E. Moore</em>, London: Routledge,\nChs. 3–4.",
                "–––, 1993, “Editor’s\nIntroduction,” Revised edition of <em>Principia Ethica</em>, pp.\nix–xxxvii.",
                "Bosanquet, Bernard, 1904, Critical Notice of <em>Principia\nEthica</em>, <em>Mind</em>, 13: 254–61",
                "Braithwaite, R.B., 1961, “George Edward Moore,”\n<em>Proceedings of the British Academy</em>, 47: 293–310.",
                "Brentano Franz, 1969, <em>The Origin of Our Knowledge of Right and\nWrong</em>, trans. Roderick M. Chisholm and Elizabeth Schneewind,\nLondon: Routledge &amp; Kegan Paul.",
                "Brink, David O., 1989, <em>Moral Realism and the Foundations of\nEthics</em>, Cambridge: Cambridge University Press, Ch. 6.",
                "Broad, C.D., 1930, <em>Five Types of Ethical Theory</em>, London:\nRoutledge &amp; Kegan Paul.",
                "–––, 1933–34, “Is\n‘Goodness’ a Name of a Simple Non-Natural Quality?”,\n<em>Proceedings of the Aristotelian Society</em>, 34:\n249–68.",
                "–––, 1942, “Certain Features in\nMoore’s Ethical Doctrines,” in Schilpp 1942, pp.\n43–67.",
                "–––, 1961, “G.E. Moore’s Latest\nPublished Views on Ethics,” <em>Mind</em>, 70:\n435–57.",
                "–––, 1971, “Self and Others,” in\nCheney, ed., <em>Broad’s Critical Essays in Moral\nPhilosophy</em>, London: George Allen &amp; Unwin, pp. 262–83\n(this essay was first published in 1953).",
                "Butchvarov, Panayot, 1989, <em>Skepticism in Ethics</em>,\nBloomington, IN: Indiana University Press.",
                "Chisholm, Roderick M., 1986, <em>Brentano and Intrinsic\nValue</em>, Cambridge: Cambridge University Press.",
                "Cox, H.H., 1970, “Warnock on Moore,” <em>Mind</em>,\n79: 265–69.",
                "Darwall, Stephen, 2003, “Moore, Normativity, and Intrinsic\nValue,” <em>Ethics</em>, 113: 468–89.",
                "Darwall, S., Gibbard, A., and Railton, P., 1992, “Toward\n<em>Fin de Siècle</em> Ethics: Some Trends,”\n<em>Philosophical Review</em>, 101: 115–89.",
                "Enoch, David, 2011, <em>Taking Morality Seriously: A Defense of\nRobust Realism</em>, Oxford: Oxford University Press.",
                "Ewing, A.C., 1962, “G.E. Moore,” <em>Mind</em>, 71:\n251.",
                "–––, 1947, <em>The Definition of Good</em>,\nLondon: Macmillan.",
                "Foot, Philippa, 2001, <em>Natural Goodness</em>, Oxford: Oxford\nUniversity Press.",
                "Frankena, William, 1939, “The Naturalistic Fallacy,”\n<em>Mind</em>, 48: 464–77.",
                "–––, 1942, “Obligation and Value in the\nEthics of G.E. Moore,”, in Schilpp 1942, pp. 93–110.",
                "Gampel, Eric, 1996, “A Defense of the Autonomy of Ethics:\nWhy Value is Not Like Water,” <em>Canadian Journal of\nPhilosophy</em>, 26: 191–209.",
                "Geach, P.T., 1956, “Good and Evil,” <em>Analysis,</em>\n17: 33–42.",
                "Hare, R.M., 1952, <em>The Language of Morals</em>, Oxford:\nClarendon Press.",
                "–––, 1963, <em>Freedom and Reason</em>, London:\nOxford University Press.",
                "–––, 1981, <em>Moral Thinking: Its Levels,\nMethod and Point</em>, Oxford: Clarendon Press.",
                "Horgan, Terence and Mark Timmons (eds.), 2006, <em>Metaethics\nAfter Moore</em>, Oxford: Oxford University Press.",
                "Hudson, W.D., 1970, <em>Modern Moral Philosophy</em>, London:\nMacmillan, Ch. 3.",
                "Huemer, Michael, 2006, <em>Ethical Intuitionism</em>, New York:\nPalgrave Macmillan.",
                "Hurka, Thomas, 1998, “Two Kinds of Organic Unity,”\n<em>Journal of Ethics</em>, 2: 283–304.",
                "–––, 2001, <em>Virtue, Vice, and Value</em>, New\nYork: Oxford University Press.",
                "–––, 2003, “Moore in the Middle,”\n<em>Ethics</em>, 113: 599–628.",
                "–––, 2014, <em>British Ethical Theorists from\nSidgwick to Ewing</em>, Oxford: Oxford University Press.",
                "–––, 2021, “Against ‘Good\nFor’/‘Well-Being,’ For ‘Simply\nGood’,” <em>Philosophical Quarterly</em> in press",
                "Hutchinson, Brian, 2001, <em>G.E. Moore’s Ethical Theory:\nResistance and Reconciliation</em>, Cambridge: Cambridge University\nPress.",
                "Irwin, Terence, 2009, <em>The Development of Ethics: A Historical\nand Critical Study, Vol. III: From Kant to Rawls</em>, Ch. 86, Oxford:\nOxford University Press.",
                "Jones, E.E. Constance, 1906, “Mr. Moore on Hedonism,”\n<em>International Journal of Ethics</em>, 16: 429–64.",
                "Keynes, John Maynard, 1949, “My Early Beliefs,” in\n<em>Two Memoirs</em>, London: Hart-Davis, pp. 78–103.",
                "Kraut, Richard, 2007, <em>What is Good and Why: The Ethics of\nWell-Being</em>, Cambridge, MA: Harvard University Press.",
                "–––, 2011, <em>Against Absolute Goodness</em>,\nNew York: Oxford University Press.",
                "Langford, C.H., 1942 “Moore’s Notion of\nAnalysis,” in Schilpp 1942, pp. 321–342.",
                "Lemos, Noah M., 1994, <em>Intrinsic Value</em>, Cambridge:\nCambridge University Press.",
                "Levy, Paul, 1979, <em>Moore: G.E. Moore and the Cambridge\nApostles</em>, New York: Holt, Rinehart and Winston.",
                "MacIntyre, Alasdair, 1981, <em>After Virtue: A Study in Moral\nTheory</em>, London: Duckworth, Ch. 2.",
                "Mackenzie, J.S., 1904, Review of <em>Principia Ethica</em>,\n<em>International Journal of Ethics</em>, 14: 377–82.",
                "Mackie, J.L., 1976, “Sidgwick’s Pessimism,”\n<em>Philosophical Quarterly</em> 26: 317–28",
                "–––, 1977, <em>Ethics: Inventing Right and\nWrong</em>, Harmondsworth: Penguin.",
                "McDaniel, Kris, 2014, “A Moorean View of the Value of\nLives,” <em>Pacific Philosophical Quarterly</em>, 95:\n23–46.",
                "McDowell, John, 1979, “Virtue and Reason,” <em>The\nMonist</em> 62: 331–50.",
                "McTaggart, John McTaggart Ellis, 1908, “The Individualism of\nValue,” <em>International Journal of Ethics</em>, 18:\n433–45.",
                "Nagel, Thomas, 1986, <em>The View From Nowhere</em>, New York:\nOxford University Press.",
                "Nuccetelli, Susana and Gary Seay (eds.), 2007, <em>Themes from\nG.E. Moore: New Essays in Epistemology and Ethics</em>, Oxford: Oxford\nUniversity Press.",
                "Parfit, Derek, 2011, <em>On What Matters</em>, 2 vols., Oxford:\nOxford University Press.",
                "Phillips, David, 2011, <em>Sidgwickian Ethics</em>, New York:\nOxford University Press.",
                "Pigden, Charles R., 1990, “Geach on Good,”\n<em>Philosophical Quarterly</em> 40: 129–54.",
                "–––, 2007, “Desiring to Desire: Russell,\nLewis, and G.E. Moore,” in Nuccetelli and Seay (eds.),\n<em>Themes from G.E. Moore</em>, Oxford: Clarendon Press, pp.\n244–60.",
                "Prichard, H.A., 1912, “Does Moral Philosophy Rest on a\nMistake?”, <em>Mind</em>, 21: 21–37.",
                "Rashdall, Hastings, 1907, <em>The Theory of Good and Evil</em>, 2\nvols., London: Oxford University Press.",
                "Regan, Donald H., 2003, “How to Be a Moorean,”\n<em>Ethics</em>, 113: 651–77.",
                "Regan, Tom, 1986, <em>Bloomsbury’s Prophet: G.E. Moore and\nthe Development of His Moral Philosophy</em>, Philadelphia: Temple\nUniversity Press.",
                "Ross, W.D., 1930, <em>The Right and the Good</em>, Oxford:\nClarendon Press.",
                "Rowland, Richard, 2016, “In Defence of Good\n<em>Simpliciter</em>,” <em>Philosophical Studies</em> 173:\n1371–91.",
                "Russell, Bertrand, 1904, Review of <em>Principia Ethica</em>,\n<em>Independent Review</em>, 2: 328–33.",
                "–––, 1966, “The Elements of Ethics,”\nin Bertrand Russell, <em>Philosophical Essays</em>, London: George\nAllen &amp; Unwin, pp. 13–59 (first published 1910).",
                "Scanlon, T.M., 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2014, <em>Being Realistic About\nReasons</em>, Oxford: Oxford University Press.",
                "Schilpp, P.A., 1942, <em>The Philosophy of G.E. Moore</em>,\nEvanston, IL: Northwestern University Press.",
                "Shafer-Landau, Russ, 2003, <em>Moral Realism: A Defence</em>,\nOxford: Oxford University Press.",
                "Shaver, Robert, 2000, “Sidgwick’s Minimal\nMetaethics,” <em>Utilitas</em>, 12: 261–77.",
                "–––, 2003, “<em>Principia</em> Then and\nNow,” <em>Utilitas</em>, 15: 261–78.",
                "Shaw, William H, 2020, <em>Moore’s Ethics</em>, Cambridge:\nCambridge University Press.",
                "Sidorsky, David, 2007, “The Uses of the Philosophy of G.E.\nMoore in the Works of E.M. Forster,” <em>New Literary\nHistory</em>, 38: 245–71.",
                "Sidgwick, Henry, 1907, <em>The Methods of Ethics</em>, London,\nMacmillan, 7<sup>th</sup> edition.",
                "Skelton, Anthony, 2011, “Ideal Utilitarianism: Rashdall and\nMoore,” in Thomas Hurka (ed.), 2011, <em>British Moral\nPhilosophers from Sidgwick to Ewing</em>, Oxford: Oxford University\nPress, pp. 45–65.",
                "Stevenson, Charles L., 1944, <em>Ethics and Language</em>, New\nHaven: Yale University Press.",
                "–––, “Moore’s Arguments Against\nCertain Forms of Ethical Naturalism,” in Schilpp 1942, pp.\n71–90",
                "Stratton-Lake, Philip (ed.), 2002, <em>Ethical Intuitionism:\nRe-evaluations</em>, Oxford: Clarendon Press.",
                "Sumner, L.W., 1996, <em>Welfare, Happiness, and Ethics</em>,\nOxford: Clarendon Press.",
                "Sylvester, Robert Peter, 1990, <em>The Moral Philosophy of G.E.\nMoore</em>, Philadelphia: Temple University Press.",
                "Thomson, Judith Jarvis, 1997, “The Right and the\nGood,” <em>Journal of Philosophy</em> 94: 273–98.",
                "Tucker, Miles, 2018, “Simply Good: A Defence of the\nPrincipia,” <em>Utilitas</em> 30: 253–70.",
                "Warnock, G.J., 1967, <em>Contemporary Moral Philosophy</em>,\nLondon: Macmillan, Ch. 2.",
                "Warnock, Mary, 1978, <em>Ethics Since 1900</em>, 3<sup>rd</sup>\ned., Oxford: Oxford University Press, Ch. 1.",
                "Welchman, Jennifer, 1989, “G.E. Moore and the Revolution in\nEthics: A Reappraisal,” <em>History of Philosophy\nQuarterly</em>, 6: 317–29.",
                "Wilde, Norman, 1905, Review of <em>Principia Ethica</em>,\n<em>Journal of Philosophy, Psychology, and Scientific Method</em>, 2:\n581–3.",
                "Woolf, Leonard, 1960, <em>Sowing</em>, London: Hogarth.",
                "Zimmerman, Michael J., 1999, “In Defense of the Concept of\nIntrinsic Value,” <em>Canadian Journal of Philosophy</em>, 29:\n389–410.\n</ul>\n<h3 id=\"SpecIssu\">"
            ],
            "Special Issues": [
                "</h3>\n<ul class=\"hanging\">",
                "<em>Ethics</em>, 113/3 (2003): special volume for the centenary of\n<em>Principia Ethica</em>.",
                "<em>Journal of Value Inquiry</em>, 37/3 (2003): special volume for\nthe centenary of <em>Principia Ethica</em>.",
                "<em>Southern Journal of Philosophy</em>, 41 (2003) Supplement:\nspecial volume for the centenary of <em>Principia Ethica</em>.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"PrimSour\">Primary Sources</h3>\n<ul class=\"hanging\">\n<li>“Mr. McTaggart’s Ethics,” <em>International\nJournal of Ethics</em>, 13 (1903): 341–70; reprinted in <em>The\nEarly Essays</em>, pp. 201–32</li>\n<li><em>Principia Ethica</em>, Cambridge: Cambridge University Press,\n1903; revised edition with “Preface to the second edition”\nand other papers, T. Baldwin (ed.), Cambridge: Cambridge University\nPress, 1993 (page references are first to the original and then to the\nrevised edition).</li>\n<li>Review of Franz Brentano, <em>The Origin of the Knowledge of Right\nand Wrong</em>, <em>International Journal of Ethics</em>, 14 (1903):\n115–23.</li>\n<li>Review of Hastings Rashdall, <em>The Theory of Good and Evil</em>,\n<em>Hibbert Journal</em>, 6 (1907–8): 446–51.</li>\n<li><em>Ethics</em>, London: Williams and Norgate, 1912; London:\nOxford University Press, 1947 (hardcover); London: Oxford University\nPress, 1965 (paperback) (page references are first to the original\nedition, then to the OUP hardcover, then to the OUP paperback).</li>\n<li>“The Conception of Intrinsic Value” and “The\nNature of Moral Philosophy,” in G.E. Moore, <em>Philosophical\nStudies</em>, London: Routledge &amp; Kegan Paul, 1922, pp.\n253–75 and 310–39; “The Conception of Intrinsic\nValue” reprinted in Revised edition of <em>Principia\nEthica</em>, pp. 280–98</li>\n<li>“Is Goodness a Quality?”, <em>Proceedings of the\nAristotelian Society, Supplementary Volume</em>, 11 (1932):\n116–31.</li>\n<li>“An Autobiography” and “A Reply to My\nCritics,” in P.A. Schilpp (ed.), <em>The Philosophy of G.E.\nMoore</em>, Evanston, IL: Northwestern University Press, 1942, pp.\n3–39 and 535–687.</li>\n<li><em>The Early Essays</em>, Tom Regan (ed.), Philadelphia: Temple\nUniversity Press, 1986.</li>\n<li><em>The Elements of Ethics</em>, T. Regan (ed.), Philadelphia:\nTemple University Press, 1991.</li>\n</ul>\n<h3 id=\"SecoSour\">Secondary Sources</h3>\n<ul class=\"hanging\">\n<li>Anonymous, 1903, Review of <em>Principia Ethica</em>,\n<em>Athenaeum</em>, 3794: 847–8.</li>\n<li>Anscombe, G.E.M., 1958, “Modern Moral Philosophy,”\n<em>Philosophy</em> 35: 1–19.</li>\n<li>Ayer, A.J., 1936, <em>Language, Truth, and Logic</em>, London:\nVictor Gollancz.</li>\n<li>Baldwin, Thomas, 1990, <em>G.E. Moore</em>, London: Routledge,\nChs. 3–4.</li>\n<li>–––, 1993, “Editor’s\nIntroduction,” Revised edition of <em>Principia Ethica</em>, pp.\nix–xxxvii.</li>\n<li>Bosanquet, Bernard, 1904, Critical Notice of <em>Principia\nEthica</em>, <em>Mind</em>, 13: 254–61</li>\n<li>Braithwaite, R.B., 1961, “George Edward Moore,”\n<em>Proceedings of the British Academy</em>, 47: 293–310.</li>\n<li>Brentano Franz, 1969, <em>The Origin of Our Knowledge of Right and\nWrong</em>, trans. Roderick M. Chisholm and Elizabeth Schneewind,\nLondon: Routledge &amp; Kegan Paul.</li>\n<li>Brink, David O., 1989, <em>Moral Realism and the Foundations of\nEthics</em>, Cambridge: Cambridge University Press, Ch. 6.</li>\n<li>Broad, C.D., 1930, <em>Five Types of Ethical Theory</em>, London:\nRoutledge &amp; Kegan Paul.</li>\n<li>–––, 1933–34, “Is\n‘Goodness’ a Name of a Simple Non-Natural Quality?”,\n<em>Proceedings of the Aristotelian Society</em>, 34:\n249–68.</li>\n<li>–––, 1942, “Certain Features in\nMoore’s Ethical Doctrines,” in Schilpp 1942, pp.\n43–67.</li>\n<li>–––, 1961, “G.E. Moore’s Latest\nPublished Views on Ethics,” <em>Mind</em>, 70:\n435–57.</li>\n<li>–––, 1971, “Self and Others,” in\nCheney, ed., <em>Broad’s Critical Essays in Moral\nPhilosophy</em>, London: George Allen &amp; Unwin, pp. 262–83\n(this essay was first published in 1953).</li>\n<li>Butchvarov, Panayot, 1989, <em>Skepticism in Ethics</em>,\nBloomington, IN: Indiana University Press.</li>\n<li>Chisholm, Roderick M., 1986, <em>Brentano and Intrinsic\nValue</em>, Cambridge: Cambridge University Press.</li>\n<li>Cox, H.H., 1970, “Warnock on Moore,” <em>Mind</em>,\n79: 265–69.</li>\n<li>Darwall, Stephen, 2003, “Moore, Normativity, and Intrinsic\nValue,” <em>Ethics</em>, 113: 468–89.</li>\n<li>Darwall, S., Gibbard, A., and Railton, P., 1992, “Toward\n<em>Fin de Siècle</em> Ethics: Some Trends,”\n<em>Philosophical Review</em>, 101: 115–89.</li>\n<li>Enoch, David, 2011, <em>Taking Morality Seriously: A Defense of\nRobust Realism</em>, Oxford: Oxford University Press.</li>\n<li>Ewing, A.C., 1962, “G.E. Moore,” <em>Mind</em>, 71:\n251.</li>\n<li>–––, 1947, <em>The Definition of Good</em>,\nLondon: Macmillan.</li>\n<li>Foot, Philippa, 2001, <em>Natural Goodness</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Frankena, William, 1939, “The Naturalistic Fallacy,”\n<em>Mind</em>, 48: 464–77.</li>\n<li>–––, 1942, “Obligation and Value in the\nEthics of G.E. Moore,”, in Schilpp 1942, pp. 93–110.</li>\n<li>Gampel, Eric, 1996, “A Defense of the Autonomy of Ethics:\nWhy Value is Not Like Water,” <em>Canadian Journal of\nPhilosophy</em>, 26: 191–209.</li>\n<li>Geach, P.T., 1956, “Good and Evil,” <em>Analysis,</em>\n17: 33–42.</li>\n<li>Hare, R.M., 1952, <em>The Language of Morals</em>, Oxford:\nClarendon Press.</li>\n<li>–––, 1963, <em>Freedom and Reason</em>, London:\nOxford University Press.</li>\n<li>–––, 1981, <em>Moral Thinking: Its Levels,\nMethod and Point</em>, Oxford: Clarendon Press.</li>\n<li>Horgan, Terence and Mark Timmons (eds.), 2006, <em>Metaethics\nAfter Moore</em>, Oxford: Oxford University Press.</li>\n<li>Hudson, W.D., 1970, <em>Modern Moral Philosophy</em>, London:\nMacmillan, Ch. 3.</li>\n<li>Huemer, Michael, 2006, <em>Ethical Intuitionism</em>, New York:\nPalgrave Macmillan.</li>\n<li>Hurka, Thomas, 1998, “Two Kinds of Organic Unity,”\n<em>Journal of Ethics</em>, 2: 283–304.</li>\n<li>–––, 2001, <em>Virtue, Vice, and Value</em>, New\nYork: Oxford University Press.</li>\n<li>–––, 2003, “Moore in the Middle,”\n<em>Ethics</em>, 113: 599–628.</li>\n<li>–––, 2014, <em>British Ethical Theorists from\nSidgwick to Ewing</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2021, “Against ‘Good\nFor’/‘Well-Being,’ For ‘Simply\nGood’,” <em>Philosophical Quarterly</em> in press</li>\n<li>Hutchinson, Brian, 2001, <em>G.E. Moore’s Ethical Theory:\nResistance and Reconciliation</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Irwin, Terence, 2009, <em>The Development of Ethics: A Historical\nand Critical Study, Vol. III: From Kant to Rawls</em>, Ch. 86, Oxford:\nOxford University Press.</li>\n<li>Jones, E.E. Constance, 1906, “Mr. Moore on Hedonism,”\n<em>International Journal of Ethics</em>, 16: 429–64.</li>\n<li>Keynes, John Maynard, 1949, “My Early Beliefs,” in\n<em>Two Memoirs</em>, London: Hart-Davis, pp. 78–103.</li>\n<li>Kraut, Richard, 2007, <em>What is Good and Why: The Ethics of\nWell-Being</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2011, <em>Against Absolute Goodness</em>,\nNew York: Oxford University Press.</li>\n<li>Langford, C.H., 1942 “Moore’s Notion of\nAnalysis,” in Schilpp 1942, pp. 321–342.</li>\n<li>Lemos, Noah M., 1994, <em>Intrinsic Value</em>, Cambridge:\nCambridge University Press.</li>\n<li>Levy, Paul, 1979, <em>Moore: G.E. Moore and the Cambridge\nApostles</em>, New York: Holt, Rinehart and Winston.</li>\n<li>MacIntyre, Alasdair, 1981, <em>After Virtue: A Study in Moral\nTheory</em>, London: Duckworth, Ch. 2.</li>\n<li>Mackenzie, J.S., 1904, Review of <em>Principia Ethica</em>,\n<em>International Journal of Ethics</em>, 14: 377–82.</li>\n<li>Mackie, J.L., 1976, “Sidgwick’s Pessimism,”\n<em>Philosophical Quarterly</em> 26: 317–28</li>\n<li>–––, 1977, <em>Ethics: Inventing Right and\nWrong</em>, Harmondsworth: Penguin.</li>\n<li>McDaniel, Kris, 2014, “A Moorean View of the Value of\nLives,” <em>Pacific Philosophical Quarterly</em>, 95:\n23–46.</li>\n<li>McDowell, John, 1979, “Virtue and Reason,” <em>The\nMonist</em> 62: 331–50.</li>\n<li>McTaggart, John McTaggart Ellis, 1908, “The Individualism of\nValue,” <em>International Journal of Ethics</em>, 18:\n433–45.</li>\n<li>Nagel, Thomas, 1986, <em>The View From Nowhere</em>, New York:\nOxford University Press.</li>\n<li>Nuccetelli, Susana and Gary Seay (eds.), 2007, <em>Themes from\nG.E. Moore: New Essays in Epistemology and Ethics</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Parfit, Derek, 2011, <em>On What Matters</em>, 2 vols., Oxford:\nOxford University Press.</li>\n<li>Phillips, David, 2011, <em>Sidgwickian Ethics</em>, New York:\nOxford University Press.</li>\n<li>Pigden, Charles R., 1990, “Geach on Good,”\n<em>Philosophical Quarterly</em> 40: 129–54.</li>\n<li>–––, 2007, “Desiring to Desire: Russell,\nLewis, and G.E. Moore,” in Nuccetelli and Seay (eds.),\n<em>Themes from G.E. Moore</em>, Oxford: Clarendon Press, pp.\n244–60.</li>\n<li>Prichard, H.A., 1912, “Does Moral Philosophy Rest on a\nMistake?”, <em>Mind</em>, 21: 21–37.</li>\n<li>Rashdall, Hastings, 1907, <em>The Theory of Good and Evil</em>, 2\nvols., London: Oxford University Press.</li>\n<li>Regan, Donald H., 2003, “How to Be a Moorean,”\n<em>Ethics</em>, 113: 651–77.</li>\n<li>Regan, Tom, 1986, <em>Bloomsbury’s Prophet: G.E. Moore and\nthe Development of His Moral Philosophy</em>, Philadelphia: Temple\nUniversity Press.</li>\n<li>Ross, W.D., 1930, <em>The Right and the Good</em>, Oxford:\nClarendon Press.</li>\n<li>Rowland, Richard, 2016, “In Defence of Good\n<em>Simpliciter</em>,” <em>Philosophical Studies</em> 173:\n1371–91.</li>\n<li>Russell, Bertrand, 1904, Review of <em>Principia Ethica</em>,\n<em>Independent Review</em>, 2: 328–33.</li>\n<li>–––, 1966, “The Elements of Ethics,”\nin Bertrand Russell, <em>Philosophical Essays</em>, London: George\nAllen &amp; Unwin, pp. 13–59 (first published 1910).</li>\n<li>Scanlon, T.M., 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2014, <em>Being Realistic About\nReasons</em>, Oxford: Oxford University Press.</li>\n<li>Schilpp, P.A., 1942, <em>The Philosophy of G.E. Moore</em>,\nEvanston, IL: Northwestern University Press.</li>\n<li>Shafer-Landau, Russ, 2003, <em>Moral Realism: A Defence</em>,\nOxford: Oxford University Press.</li>\n<li>Shaver, Robert, 2000, “Sidgwick’s Minimal\nMetaethics,” <em>Utilitas</em>, 12: 261–77.</li>\n<li>–––, 2003, “<em>Principia</em> Then and\nNow,” <em>Utilitas</em>, 15: 261–78.</li>\n<li>Shaw, William H, 2020, <em>Moore’s Ethics</em>, Cambridge:\nCambridge University Press.</li>\n<li>Sidorsky, David, 2007, “The Uses of the Philosophy of G.E.\nMoore in the Works of E.M. Forster,” <em>New Literary\nHistory</em>, 38: 245–71.</li>\n<li>Sidgwick, Henry, 1907, <em>The Methods of Ethics</em>, London,\nMacmillan, 7<sup>th</sup> edition.</li>\n<li>Skelton, Anthony, 2011, “Ideal Utilitarianism: Rashdall and\nMoore,” in Thomas Hurka (ed.), 2011, <em>British Moral\nPhilosophers from Sidgwick to Ewing</em>, Oxford: Oxford University\nPress, pp. 45–65.</li>\n<li>Stevenson, Charles L., 1944, <em>Ethics and Language</em>, New\nHaven: Yale University Press.</li>\n<li>–––, “Moore’s Arguments Against\nCertain Forms of Ethical Naturalism,” in Schilpp 1942, pp.\n71–90</li>\n<li>Stratton-Lake, Philip (ed.), 2002, <em>Ethical Intuitionism:\nRe-evaluations</em>, Oxford: Clarendon Press.</li>\n<li>Sumner, L.W., 1996, <em>Welfare, Happiness, and Ethics</em>,\nOxford: Clarendon Press.</li>\n<li>Sylvester, Robert Peter, 1990, <em>The Moral Philosophy of G.E.\nMoore</em>, Philadelphia: Temple University Press.</li>\n<li>Thomson, Judith Jarvis, 1997, “The Right and the\nGood,” <em>Journal of Philosophy</em> 94: 273–98.</li>\n<li>Tucker, Miles, 2018, “Simply Good: A Defence of the\nPrincipia,” <em>Utilitas</em> 30: 253–70.</li>\n<li>Warnock, G.J., 1967, <em>Contemporary Moral Philosophy</em>,\nLondon: Macmillan, Ch. 2.</li>\n<li>Warnock, Mary, 1978, <em>Ethics Since 1900</em>, 3<sup>rd</sup>\ned., Oxford: Oxford University Press, Ch. 1.</li>\n<li>Welchman, Jennifer, 1989, “G.E. Moore and the Revolution in\nEthics: A Reappraisal,” <em>History of Philosophy\nQuarterly</em>, 6: 317–29.</li>\n<li>Wilde, Norman, 1905, Review of <em>Principia Ethica</em>,\n<em>Journal of Philosophy, Psychology, and Scientific Method</em>, 2:\n581–3.</li>\n<li>Woolf, Leonard, 1960, <em>Sowing</em>, London: Hogarth.</li>\n<li>Zimmerman, Michael J., 1999, “In Defense of the Concept of\nIntrinsic Value,” <em>Canadian Journal of Philosophy</em>, 29:\n389–410.</li>\n</ul>\n<h3 id=\"SpecIssu\">Special Issues</h3>\n<ul class=\"hanging\">\n<li><em>Ethics</em>, 113/3 (2003): special volume for the centenary of\n<em>Principia Ethica</em>.</li>\n<li><em>Journal of Value Inquiry</em>, 37/3 (2003): special volume for\nthe centenary of <em>Principia Ethica</em>.</li>\n<li><em>Southern Journal of Philosophy</em>, 41 (2003) Supplement:\nspecial volume for the centenary of <em>Principia Ethica</em>.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "autonomy: in moral and political philosophy",
            "consequentialism",
            "desert",
            "egoism",
            "hedonism",
            "love",
            "mathematics, philosophy of: intuitionism",
            "Moore, George Edward",
            "moral realism",
            "Sidgwick, Henry",
            "value: intrinsic vs. extrinsic"
        ],
        "entry_link": [
            {
                "../autonomy-moral/": "autonomy: in moral and political philosophy"
            },
            {
                "../consequentialism/": "consequentialism"
            },
            {
                "../desert/": "desert"
            },
            {
                "../egoism/": "egoism"
            },
            {
                "../hedonism/": "hedonism"
            },
            {
                "../love/": "love"
            },
            {
                "../intuitionism/": "mathematics, philosophy of: intuitionism"
            },
            {
                "../moore/": "Moore, George Edward"
            },
            {
                "../moral-realism/": "moral realism"
            },
            {
                "../sidgwick/": "Sidgwick, Henry"
            },
            {
                "../value-intrinsic-extrinsic/": "value: intrinsic vs. extrinsic"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=moore-moral\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/moore-moral/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=moore-moral&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/moore-moral/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=moore-moral": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/moore-moral/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=moore-moral&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/moore-moral/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}