{
    "url": "natural-language-ontology",
    "title": "Natural Language Ontology",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Friederike Moltmann\n<Friederike.Moltmann@univ-paris1.fr>",
        "author_links": [
            {
                "mailto:Friederike%2eMoltmann%40univ-paris1%2efr": "Friederike.Moltmann@univ-paris1.fr"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nFriederike Moltmann\n&lt;<a href=\"mailto:Friederike%2eMoltmann%40univ-paris1%2efr\"><em>Friederike<abbr title=\" dot \">.</abbr>Moltmann<abbr title=\" at \">@</abbr>univ-paris1<abbr title=\" dot \">.</abbr>fr</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Aug 17, 2022"
    ],
    "preamble": "\n\nNatural language ontology is the study of the ontology (ontological\ncategories, structures, and notions) implicit in natural language.\nNatural language ontology is part of “descriptive\nmetaphysics” to use Strawson’s term (1959), as opposed to\nwhat Fine (2017a) calls “foundational metaphysics”,\nmetaphysics whose interest is in what there ultimately is. Natural\nlanguage ontology is a sub-discipline of both philosophy and\nlinguistics, more specifically, of metaphysics and natural language\nsemantics. It was recognized as a separate field of study relatively\nrecently, through the development of natural language semantics over\nthe last decades. At the same time, natural language ontology can be\nconsidered a practice that philosophers have engaged in throughout the\nhistory of philosophy when drawing on language in support of a\nmetaphysical argument or notion. The ontology of natural language is\nto be distinguished from the ontology a speaker accepts on the basis\nof philosophical or naïve reflection or reasoning using language,\nas well as from the ontology that is reflected in cognition in\ngeneral. The ontology of a natural language is thus best characterized\nas the ontology competent speakers implicitly accept by way of using\nthe language.\n",
    "toc": [
        {
            "#NatuLangOntoEmerDiscPrac": "1. Natural Language Ontology as An Emerging Discipline and Practice"
        },
        {
            "#NatuLangOntoDisc": "1.1 Natural Language Ontology as a Discipline"
        },
        {
            "#NatuLangOntoPracThroHistPhil": "1.2 Natural Language Ontology as a Practice Throughout the History of Philosophy"
        },
        {
            "#OntoNatuLangRelaReal": "1.3 The Ontology of Natural Language and Its Relation to Reality"
        },
        {
            "#OntoNatuLangTrutCond": "1.4 The Ontology of Natural Language and Truth Conditions"
        },
        {
            "#OntoReflNatuLangCognReas": "1.5 Ontology Reflected in Natural Language, in Cognition, and in Reasoning"
        },
        {
            "#ReleNatuLangOntoForPhil": "1.6 The Relevance of Natural Language Ontology for Philosophy"
        },
        {
            "#NatuLangOntoSubdBothLingPhil": "2. Natural Language Ontology as a Subdiscipline of Both Linguistics and Philosophy"
        },
        {
            "#NatuLangOntoPartDescMeta": "2.1 Natural Language Ontology as Part of Descriptive Metaphysics"
        },
        {
            "#HowDoesNatuLangReflOnto": "2.2 How Does Natural Language Reflect Ontology?"
        },
        {
            "#EntiDiffSemaRole": "2.2.1 Entities in different semantic roles"
        },
        {
            "#SemaValuRefeNPsVari": "2.2.1.1 Semantic values of referential NPs and variables"
        },
        {
            "#ImplArgu": "2.2.1.2 Implicit arguments"
        },
        {
            "#ParaEvalTrut": "2.2.1.3 Parameters of evaluation and truthmakers"
        },
        {
            "#OtheSemaRoleForSitu": "2.2.1.4 Other semantic roles for situations"
        },
        {
            "#ConnBetwOntoComp": "2.2.2 The connection between ontology and compositionality"
        },
        {
            "#OntoCateSyntCatePosiStru": "2.2.3 Ontological categories and syntactic categories, positions, and structures"
        },
        {
            "#MetaReleSpecExprCons": "2.2.4 Metaphysically relevant specific expressions and constructions"
        },
        {
            "#ChomSkepAbouRefeObjeSemaNatuLang": "2.2.5 Chomskyan skepticism about reference to objects in the semantics of natural language"
        },
        {
            "#DistFeatOntoNatuLang": "3. Distinctive Features of the Ontology of Natural Language"
        },
        {
            "#CompNPsConsOnto": "3.1 Complex NPs and Constructional Ontology"
        },
        {
            "#RefeUnreSumsKind": "3.1.1 Reference to unrestricted sums and kinds"
        },
        {
            "#InteDefiNPs": "3.1.2 Intensional definite NPs"
        },
        {
            "#IntrEntiAbst": "3.1.3. Introduction of entities by abstraction"
        },
        {
            "#InteNoneObje": "3.2 Intentional or Nonexistent Objects"
        },
        {
            "#MassCounDist": "3.3 The Mass-Count Distinction"
        },
        {
            "#IssuOnto": "4. The Issue of Ontologies"
        },
        {
            "#OntoNatuLangCorePeriDist": "4.1 The Ontology of Natural Language and the Core-Periphery Distinction"
        },
        {
            "#QuesOnto": "4.2 The Question of Ontologies"
        },
        {
            "#Outl": "5. Outlook"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Natural Language Ontology as an Emerging Discipline and Practice\n1.1 Natural Language Ontology as a Discipline\n\nThe subject matter of natural language ontology is the ontology\nimplicit in natural language, which is to be distinguished from the\nontologies of the various metaphysical theories or naïve\nphilosophical views formulated by using natural language. Natural\nlanguage ontology has as its task to uncover the ontology that is\nreflected in relevant sorts of linguistic intuitions, setting aside\nthe question whether that ontology is real or merely apparent.\n\nThis entry uses “natural language ontology” as the term\nfor the discipline and “the ontology of natural language”\nas a term for its subject matter. The more accurate term for the\nsubject matter of natural language ontology would actually be\n“the ontologies of natural languages”, since natural\nlanguages may, in principle, reflect different ontologies and even the\nsame language (or idiolect) might reflect different ontologies. For\nmost of the entry, this is simplified by talking about the\nontology of natural language, addressing the issue of different\nontologies only in\n Section 4.\n This is justified by the fact that philosophers practicing natural\nlanguage ontology generally presuppose that there is a single ontology\nshared by natural languages, as do, to a great extent at least,\nsemanticists.\n\nNatural language ontology had been suggested as a discipline first by\nBach (1986), who uses the term “natural language\nmetaphysics”. That term is in a sense more adequate than\n“natural language ontology”: ontology is often taken to be\nnarrower than metaphysics, dealing just with what there is (the\ninventory of things) rather than, as metaphysics does, with the nature\nof things (Quine 1948). However, “ontology” is\nincreasingly used in the broader sense of metaphysics as well,\nespecially when it has an empirical or applied dimension (e.g.,\n“applied ontology”, a field of study that involves the\npractical application of ontological notions and theories to specific\ndomains, such as management, biomedicine, or geography), a usage this\nentry will adopt as well. Also the count noun “ontology”\nis better usable than “metaphysics” to denote the subject\nmatter of a branch of metaphysics since it comes with a plural,\nallowing talk about “the ontologies of natural languages”\nand “different ontologies” being the subject matter of\ndifferent branches of metaphysics.\n\nThe ontology (or metaphysics) of natural language needs to be\ndistinguished from the ontology of linguistic entities, words,\nmeanings, phonemes, etc. Sometimes the term “metaphysics of\nnatural language” is used for the study of the latter (Postal\n2018).\n\nBach (1986) conceives of natural language metaphysics somewhat\ndifferently than the present entry in that for him it is just part of\nlinguistics, not of philosophy. For Bach, whereas proper metaphysics\nis concerned with the question “what sort of things are\nthere?”, natural language metaphysics is concerned with the\nquestion “what sort of things do people talk as if there\nwere?” Bach goes on saying \n\n\nIs there Natural Language Metaphysics? How could there not? […]\nDo the overt and covert distinctions that correspond to natural\nlanguage categories correspond to the structure of the world? How\ncould they not? But this is where linguistics stops. (1986: 593) \n\n\nBach then adopts agnosticism as to the ontological and cognitive\nstatus of the entities that are posited as semantic values. The view\nthat natural language metaphysics is part only of linguistics has also\nbeen adopted by Fiorin & Delfitto (2020: chap. 14), who\ncharacterize it as \n\n\nthe practice of identifying and studying the qualitative differences\nbetween the objects in the model that are relevant to the\ninterpretation of natural languages, (2020: 117) \n\n\nwhereby a model is strictly motivated by linguistic data.\n1.2 Natural Language Ontology as a Practice Throughout the History of Philosophy\n\nNatural language ontology as a discipline whose subject matter is the\nontology implicit in natural language is a developing discipline that,\non the view adopted in this entry, is part of both metaphysics and\nnatural language semantics. But in a way it has also been a practice\nthroughout the history of philosophy. Throughout the history of\nphilosophy, at times more often than others, natural language has been\nused as method for clarifying intuitions, that is, states of\nintellectual seeming that contrast, very roughly, with inferential\nbelief, reasoning or reflection and that have been considered the\nprimary evidence in philosophy (see entry on\n intuition).\n In particular, natural language has played an important role in\nclarifying intuitions that bear on metaphysical issues.\n\nNatural language has been used, for example, by Fine (2003) to\nelucidate the intuitive distinction between an object and the material\nconstituting it While the statue may seem a distinct entity from the\nalloy that constitutes it, the distinction becomes particularly\nconvincing when paying attention to ranges of predicates that are or\naren’t meaningfully applicable to the statue and the alloy. The\nstatue can be said to be “defective”, “well\nmade”, “valuable”, “ugly”,\n“Romanesque”, “insured”, or\n“admired”, even though the alloy which makes it up is not.\nSome predicates may not hold of the alloy; others cannot even be\napplied meaningfully to it, e.g., Romanesque. A philosopher\nthat denies an ontological distinction between an object and the\nmatter constituting it faces the considerable challenge of explaining\nthose differences in the applicability of predicates.\n\nAnother ontological distinction that has been elucidated significantly\nusing natural language is the distinction between objects and events.\nWhile some philosophers take objects and events to be of the same\ncategory and identify both with the material content of space-time\nregions, others distinguish them in the way they persist through time\n(endurance and perdurance, see entry on\n identity over time).\n Natural language gives significant support for the view that objects\nand events relate to time and space differently. The difference is\nreflected in the choice of existence predicates: exist\napplies to objects, but occur, take place, happen to events\n(* The palace existed / ??? happened, The murder\nhappened / ??? existed)); it also reflected in the\napplicability of spatial modifiers to the respective existence\npredicates (The party took place in the garden, ??? The\nflowers existed in the garden) (Hacker 1982; Cresswell 1986; Fine\n2006; Moltmann 2020b).\n\nPhilosophers when making use of natural language in such ways to\nclarify metaphysical intuitions practice natural language ontology\n(even if no distinction is made yet between what is reflected in such\nintuitions and what there really is, which is discussed in the next\nsection). They thereby generally presuppose that metaphysical\nintuitions do not show interpersonal inconsistencies (see entry on\n intuitions)\n and in their linguistic manifestation, cross-linguistic differences\n (§4.2).\n\nAppeals to natural language of this kind can be found within different\napproaches to metaphysics, as long as the philosophers in questions\ntake metaphysical intuitions to be a basis for developing\nphilosophical views. They can be found, for example, in Aristotle and\nvery explicitly in medieval metaphysics (Aquinas, Buridan, Ockham),\nwhere the use of natural language examples was a common practice. It\ncan be found in the phenomenological tradition (Bolzano, Brentano,\nHusserl, Meinong), and, again quite explicitly, in early analytic\nphilosophy (Frege, Twardowski, Strawson, Austin, Vendler, Ryle).\nDrawing on natural language as a method of clarifying metaphysical\nintuitions is also common among many contemporary philosophers that do\nnot explicitly engage in natural language ontology as an emerging\ndiscipline, but just take a descriptive approach to metaphysics\n (§1.6).\n \n1.3 The Ontology of Natural Language and Its Relation to Reality\n\nThere are various ways in which philosophers have used natural\nlanguage to clarify metaphysical intuitions. One of the most common\nways in which philosophers draw on language concerns the denotations\nof particular types of referential noun phrases (NPs). It is\na standard assumption in both philosophy and linguistics that\nreferential NPs stand for entities and predicates express properties\nof entities. The types of predicates acceptable with a particular type\nof referential NP are thus indicative of the ontological category of\nthe entities that that type of NP denotes. The types of NPs\nphilosophers make use of include bare adjective nominalizations like\nwisdom when arguing for qualities or properties, deverbal\nnominalizations like laughter when arguing for events,\nmodified adjective nominalizations like Socrates’\nwisdom when arguing for tropes or particularized properties (see\nentry on\n tropes),\n NPs with a relational use of number such as the number\nof planets when arguing for numbers as objects, and\nfact-referring terms like the fact that it is raining or\nthe facts when discussing the nature and role of facts\n(Austin 1950; Strawson 1950). Other ways in which natural language\nappears to reflect ontology and which have played a role in philosophy\nwill be discussed later\n (§2.2).\n\nThe appeal to natural language in the history of philosophy was\ngenerally based on the assumption that natural language just reflects\nreality and that natural language thus provides a particularly\nmanifest indication for the way reality should be understood. While\nthe view is still present in some of the ways in which contemporary\nmetaphysicians draw on natural language, there is another view that\nhas gained prominence, and that is that natural language does not in\nfact reflect the ontology of what there really is, or at least not\nfundamental reality. Rather, natural language comes with an ontology\nthat may be quite different from what many philosophers consider the\nontology of the real.\n\nFor example, a lot of referential NPs in natural language seem to\nstand for entities that many philosophers would not consider real, let\nalone fundamental. These include ontologically dependent, minor, and\nderivative objects such as holes, shadows, smiles, homes, problems,\nreasons, advantages, and mistakes, as well as construction-driven\nobjects such as pluralities like “the stones in the\ngarden”\n (§3.1.1),\n functional, variable, or intensional objects like “the\nincreasing temperature” or “the book John needs to\nwrite”\n (§3.1.1),\n and intentional objects of the sort “the house John was\ndreaming about”\n (§3.2).\n\nThere are also predicates of natural language that reflect notions\nthat diverge from corresponding “philosophical” notions,\nsuch as the verb exist, which cannot convey the univocal\nnotion that can be conveyed by philosophical uses of the noun\nexistence (as in the existence of everything there\nis)\n (§1.2).\n\nAlso categorial distinctions such as the mass-count distinction, which\nincludes a distinction between “the water” and “the\nquantity of water”, “the rice” and “the rice\ngrains”, as well as “the clothes” and “the\nclothing”, are nowadays not generally taken to reflect a real\nontological distinction, but, at best, a distinction at a level of\n“grammaticized individuation”\n (§3.3).\n\nSuch discrepancies motivate distinguishing two ways of pursuing\nmetaphysics:\n\n metaphysics whose aim is to uncover the ontology\nreflected in natural language or intuitions more generally, that is,\ndescriptive metaphysics\n metaphysics whose aim is to uncover what there really\nis, that is, foundational metaphysics.\n\n\nThis distinction raises important questions itself, though.\n\nFirst of all, how should reality itself be understood? Does reality\njust consist in what is fundamental, and if so what entities or\nontological category would be fundamental (e.g., certain sorts of\nobjects, properties or facts), and in what sense of fundamentality?\n(see entries on\n fundamentality\n and\n metaphysical realism).\n Or does reality also include ordinary objects (which are generally\nnot considered fundamental), and perhaps entities ontologically\ndependent on them (such as tropes and events, or even entities like\nshadows and holes), and in what sense of ontological dependence (see\nentry on\n ontological dependence)?\n Or does reality consist of a much greater range of entities, even\nperhaps a plenitude of just anything x that is conceivable that\nmeets the conditions for x’s existence (Eklund 2008;\nSchaffer 2009; entry on\n existence)?\n Does reality consist of a single level of being or different levels\nordered by relations of grounding or fundamentality, and would there\nbe a single such relation or a plurality of relations? (see entries on\n metaphysical grounding\n and\n fundamentality).\n Does reality come with a structure at all or is it an\n“amorphous lump”, to be carved out in one way or another\nby language? Finally, should reality include a realm of mere\npossibilia and perhaps nonexistent, merely intentional objects (see\nentries on\n possible objects\n and\n nonexistent objects)?\n Depending on how reality itself is conceived, the ontology of natural\nlanguage may or may not be viewed as an ontology of the real (see also\n §2.2.5).\n\nA second question is whether the two metaphysical projects can be\npursued independently of each other. While many contemporary\nmetaphysicians aim to pursue\n [ii]\n without engaging in\n [i],\n Fine (2017a) argues that the two branches of metaphysics cannot be\npursued independently, but that [ii] presupposes [i]: metaphysics that\naims to figure out what there really is has to take descriptive\nmetaphysics or what Fine calls “naïve metaphysics” or\n“the metaphysics of appearances” as its starting point,\nthat is, the metaphysics whose aim is to uncover the ontology\nreflected in our intuitions or ordinary judgments. That is because\nnaïve (or descriptive) metaphysics provides the clarification of\nthe metaphysical notions that foundational metaphysics aims to explain\nin more fundamental terms.\n\nA third issue is whether metaphysics that aims to uncover what there\nreally is can even be pursued in the first place. There have been\nvarious movements in metaphysics that deny that, including Kantian and\nphenomenological approaches\n (§2.1).\n In fact, natural language ontology might very well be pursued while\ntaking a skeptical stance toward the metaphysics of the real.\n1.4 The Ontology of Natural Language and Truth Conditions\n\nSome central issues in natural language ontology bear on the question\nof how reality and existence are to be understood.\n\nOne of them concerns natural language ontology itself, when its\nsubject matter is an ontology that may diverge from the ontology of\nwhat is considered real. How is natural language ontology compatible\nwith what is widely regarded as a fundamental requirement on semantic\ntheory, namely that of giving truth conditions? For a sentence\nS about an entity d to be true or false, what makes\nS true or false, it seems, needs to be a part of reality that\nincludes d itself, and thus d needs to be a real entity,\nrather than part of an ontology of “appearances”. There\nare various options to pursue, each of which may be adopted for just\nsome part of the ontology reflected in natural language. One option is\nthat natural language displays ontological notions or items that\nsimply fail to be real, and thus speakers making use of them in their\nutterances are in error. Second, entities in the ontology of natural\nlanguage may have the status of fictional entities, which means that a\nsentence about such entities may not be able to be\n“really” be true (unless it predicates a property of the\nfictional entity as a fictional entity, with predicates such\nas is a fictional character) (see entry on\n nonexistent objects, section nuclear and extranuclear properties).\n Third, entities in the ontology of natural language, even if not\nconsidered fundamental, may be considered derivative, yet real, which\nwould allow sentences involving reference to them to be true. As was\nmentioned in\n Section 1.1,\n some proponents of natural language ontology remain agnostic\nregarding the metaphysical status of the items that natural language\nontology posits, as long as they are motivated by empirical\ngeneralizations and theoretical linguistic considerations.\n\nAnother general issue, skeptically addressed in particular by Chomsky,\nis whether referential NPs even have as their semantic function to be\nused to refer to entities and thus whether referentialist semantics is\neven possible\n (§2.2.5).\n Not all approaches to natural language semantics in fact have as\ntheir aim giving truth conditions (whether such an aim is set aside or\nabandoned) and thus rely on referentialist semantics. Chomsky (2000)\nhimself takes the view that the semantics of natural language can\ninvolve only our cognitive representation of the world and thus only\nanother level of syntax, not entities and their properties\nthemselves.\n1.5 Ontology Reflected in Natural Language, in Cognition, and in Reasoning\n\nIt is tempting to take the ontology of natural language to just be the\nontology implicit in cognition, including perception. In fact, often\nresearchers pursuing natural language ontology take research in\ncognitive science into account or pursue interdisciplinary research in\nboth areas at once (e.g., Wellwood et al. 2012; Wisniewski et al.\n1996). While there are without doubt important connections and a\nsignificant overlap, the two ontologies need to be kept distinct. To\ngive an example, it is generally agreed that the ontology implicit in\ncognition in general, that is, the ontology of ordinary objects, is\nnot closed under sum formation, but rather subject to constraints of\ngestalt (integrity) as well as function (Schaffer & Rose 2017).\nThus, the sum of the stuff in my room does not form an entity that\nbelongs to the ontology of ordinary objects and neither does the sum\nof the Eiffel Tower and the Dalai Lama. But natural language appears\nto allow for unrestricted sum formation with definite mass and plural\nNPs and conjunctions of definite singular NPs (the stuff in my\nroom, the Eiffel Tower and the Dalai Lama), at least on\nthe dominant view on which definite plural and mass NPs stand for sums\n (§3.1.1).\n Another example of a divergence between the ontology implicit in\ncognition and in natural language is the mass-count distinction, with\nchoices such as the English mass noun pasta and the French\nplural count noun pâtes hardly reflecting a cognitive\ndistinction\n (§3.3).\n\nGiven the divergence of the ontology of natural language from that\nreflected in cognition, how does the ontology of natural language\nrelate to cognitive agents? What sort of ontological commitment does\nit involve? One option may be that the ontology of natural language is\nthe ontology a speaker accepts just when using the language. This\ncannot be right, though: a speaker may just accept the ontology by\ncoincidence when using the language. Rather the acceptance of the\nontology of natural language has to be strictly tied to the use of\nlanguage; it has to be acceptance that necessarily goes along with the\nuse of language, that is, ontological acceptance by way of using\nthe language.\n\nThere is another cognitive dimension that matters for distinguishing\nthe ontology of natural language, namely that of intuition as opposed\nto inferential belief, reasoning, or reflection (see entry on\n Intuition).\n Natural language can be used for making and denying various\nontological claims and for introducing revisionary ontological\ntheories. This may consist both in making ontological assertions and\nin introducing expressions for the purpose of conveying a particular\nontological notion (see\n §4.1).\n\nThe practice of natural language ontology, as it has been pursued by\nphilosophers and linguistics, makes a clear distinction between the\nsorts of linguistic data indicative of the ontology implicit in\nnatural language and those indicative of an ontology based on\nreasoning. Explicit metaphysical assertions are not indicative of the\nontology implicit in natural language, for example assertions of the\nfollowing sentences (whether they are widely believed or not):\n\n(1)\n\n\na.\nThere are artifacts.\nb.\n Objects are not events.\nc.\n There are things that don’t exist\n\n\n\nNo philosopher or linguist would appeal to sentences such as\n (1a, b, c)\n when arguing for an ontology of artifacts, of states distinct from\nevents, or of nonexistent entities. Otherwise, another philosopher or\nlinguists might just as well appeal to the negations of\n (1a, b, c),\n which are equally acceptable, to argue for just the opposite. Such\nuses of language do not display the ontology implicit in natural\nlanguage, but rather ontological views based on reasoning, that is,\nontologies that philosophers accept when thinking about there is or\nontologies that non-philosophers (“the folk”) naively\naccept when thinking about what there is. The latter are the subject\nmatter of folk metaphysics (Schaffer 2019), the analogue of folk\nphysics and folk biology.\n\nThe ontology of natural language is instead displayed in other ways.\nOne way in which it has been taken to manifest itself is in\npresuppositions of ontological categories carried by certain\npredicates: stop and happen require events, and\nmove and exist (enduring) objects, on pain of\nresulting in a category mistake (but see Magidor 2013 for a critical\ndiscussion). A particularly important way in which the ontology of\nnatural language manifests itself is restrictions of particular types\nof NPs to ontological categories of entities they may stand for.\n'Perfect nominals' like John’s buying of the house can\nonly stand for events, 'imperfect nominals' like John’s\nbuying the house can only stand for facts (Vendler 1967). Bare\nadjective nominalizations like wisdom can only stand for\nqualities, and adjective nominalizations with a specifier\n(Socrates’ wisdom) for tropes; deverbal nominalizations\nlike laughter are generally restricted to events\n (§1.3).\n Quantificational NPs like every time can range only over\ntimes or situations, quantifiers like somewhere only over\nplaces, and quantifiers like somehow only over qualities.\nOther ways in which the ontology of natural language manifests itself\nwill be elaborated in\n Section 2.2.\n \n\nThe distinction between ontological assertions and presuppositions\ngoes along with two ways of accepting an ontology: acceptance though\nreasoning or reflection and implicit acceptance by way of using the\nlanguage. The latter should be part of the definition of the ontology\nimplicit in natural language (Moltmann 2019):\n\n(2)\n The ontology of a natural language is the ontology speakers\nimplicitly accept by way of using the language.\n\n\nNote that it may very well turn out that the ontology arrived at\nthrough reasoning is the very same as the ontology implicit in natural\nlanguage. What matters thus is the relation of agents to the ontology,\nrather than the nature of the ontology itself.\n\nThe ontology of natural language is reflected not only in\npresuppositions, but also in certain kinds of linguistic data that are\ngenerally inaccessible to linguistically uninformed philosophical or\nnaive reflection. These are syntactic analyses of sentences that would\nbe unavailable to non-linguists and involve particular ontological\ncommitments. One example is syntactic analyses that posit silent\nsyntactic elements with ontological content. Thus, Kayne (2005: chap.\n8) argues that the sentence John has few books contains a\nsilent (antecedent-less) occurrence of the noun number, which\nsuggests that the actual structure of the sentence, John has few\nnumber books, involves reference to\na number. Another example is syntactic analyses that make use of\nlexical decomposition with ontological relevance. Thus, Harves &\nKayne (2012) argue that the underlying form of the English verb\nneed is have need, which involves an ontological\ncommitment to things like needs that is not evident from the simple\nverb need alone. Underlying syntactic structures of this sort\nare posited in generative linguistics on the background assumption\nthat knowledge of grammar is implicit and to an extent innate. If\nontological notions go along with such structures, then they should be\njust as much part of implicit knowledge as the syntactic structures\nthemselves, which means that they will be unavailable to rejection or\nrevision through reasoning.\n\nTaking ontology to be part of the implicit knowledge of grammar may\nalso solve the puzzle of how it is possible for a speaker to reject\nupon reflection (part of) the ontology that is implicit in natural\nlanguage while still committing herself to it through the continued\nuse of the language. On such a view, the implicit acceptance of the\nontology of natural language would not be a form of belief, but rather\na form of tacit knowledge on a par with that of grammar (Moltmann\n2020a). This would explain the robustness of such a form of implicit\nacceptance, which resists rejection upon reflection as long as the\nagent uses the same language, unlike the implicit acceptance or bias\nin ethics, for example, which does permit rejection upon reflection\n(see entry on\n implicit bias).\n\nDistinguishing implicit acceptance of an ontology through the use of\nlanguage from metaphysical reflection does of course not prevent the\nlatter to come into play when building a theory of the\nontology reflected in natural language. Natural language data may\nprovide only a partial specification of a particular ontological\nnotion so that metaphysical reasoning would fill in the rest—at\nleast on a view on which natural language ontology is also part of\nmetaphysics and not just linguistics (cf.\n §1.1),\n and metaphysical reasoning may give independent support for\nontological notions reflected in natural language.\n1.6 The Relevance of Natural Language Ontology for Philosophy\n\nThere are two general questions that arise regarding natural language\nontology as an emerging discipline. \n\n Why should natural language ontology be pursued in the\nfirst place? \n Why is its pursuit relevant to philosophy?\n\n\nAs regards\n [i],\n at least given certain general assumptions about semantic values,\ntruth conditions, and compositionality\n (§2.2),\n natural language ontology is an integral part of theoretical\nlinguistics and thus as important to pursue as theoretical linguistics\nitself. Theoretical linguistics has grown enormously over the last 70\nyears providing a wealth of semantic and syntactic generalizations and\ntheories, which permits a more systematic and accurate use of natural\nlanguage for metaphysical purposes. When pursued within the context of\ntheoretical linguistics, natural language ontology will also set its\nown ambitions regarding universals, the alignment of ontology with\nsyntax, the relation of ontology to lexical semantics, and the\nconnections of the ontology reflected in natural language to that\nreflected in cognition.\n\nAs regards\n [ii],\n there are specific reasons for a philosopher to pursue natural\nlanguage ontology. First of all, natural language ontology has an\nimportant contribution to make to descriptive metaphysics\n (§2.1),\n as it deals with linguistic manifestations of intuitions bearing on\nmetaphysical issues. In fact, natural language ontology can be\nregarded a linguistically informed development of descriptive\nmetaphysics. \n\nSecond, various topics in metaphysics have evolved historically around\nlinguistic facts, generally used as manifestations of shared\nintuitions or of reality itself\n (§1.2).\n By making full use of empirical and theoretical research in\nlinguistics, natural language ontology can shed a significant light on\nthose topics. For example, linguistic facts have played an important\nrole in the debate surrounding universals since the middle ages, where\nquestions were pursued such as whether wisdom is a term that\npicks out an abstract universal or just its various instances. Natural\nlanguage examples play a significant role also in contemporary\ndiscussions of abstract objects (Zalta 1983; Boolos 1998), properties\n(Chierchia & Turner 1988; Bealer 1993), and types (Wetzel 2009).\nThose discussions generally presuppose the view that natural language\nallows reference to a wide range of abstract objects, though that view\nhas been challenged on the basis of other linguistic generalizations\nand analyses\n (§4.1).\n \n\nLinguistic facts, at least since Frege (1918/9), have also played a\ncentral role in motivating abstract propositions as truth bearers:\nthat-clauses appear to act as singular terms standing for\nabstract propositions, truth bearers that are both meanings of\nsentences and objects or contents of thought. Using a different range\nof linguistic data from Polish, German, and French (in three versions\nof the same article), Twardowski (1911) argued for non-enduring\nproducts of acts (“claims”, “judgments”,\n“assumptions”) being truth bearers rather than\npropositions, proposing a novel cognitively realistic yet not\npsychologistic account of the content of attitudes as well as the\nsubject matter of logic.\n\nFinally, linguistic facts play an important role in the debate about\nthe existence and nature of numbers. Frege’s (1884) theory of\nnumbers as abstract objects was motivated by sentences such as the\nnumber of planets is eight, an apparent identity statement\ncontaining two apparent number-referring terms. More recent\nlinguistically oriented research has put into question whether\neight in that sentence really refers to a number rather than\nkeeping its “adjectival” meaning (as a quantifier or\nplural property) and moreover whether the number of planets\nin that sentence is really a number-referring term rather than acting\nas a “concealed question”, standing for the question about\nhow many planets there are (Romero 2005; Hofweber 2016).\n\nSuch philosophical debates show that when metaphysical arguments rely\non linguistic data, those data need to be subject to serious\nlinguistic examination, in the recognition that natural language\nontology is also part of linguistics.\n2. Natural Language Ontology as a Subdiscipline of Both Linguistics and Philosophy\n\nNatural language ontology as a subdiscipline of both linguistics and\nphilosophy raises a number of general questions. First, how does\nnatural language ontology situate itself within metaphysics and how is\nit to be understood as a part of metaphysics? Second, how exactly does\nthe semantics of natural language involve ontology and thus in what\nsense is natural language ontology part of linguistics? Third, what\nsorts of linguistic data reflect the ontology implicit in language,\nand how is that ontology itself to be characterized? In what follows,\nthese questions will be addressed in turn.\n2.1 Natural Language Ontology as Part of Descriptive Metaphysics\n\nA dominant contemporary view of metaphysics is that its subject matter\nis that of fundamental reality, the task of metaphysics being, in\nPlato’s words, to “carve nature at its joints”. If\nthe subject matter of metaphysics is fundamental reality, then natural\nlanguage ontology will have no place in it. There is another view of\nmetaphysics, however, on which metaphysics, at least in part, has as\nits subject matter the general nature of things as reflected\nin a particular range of “data”. Those data may\nconsist in intuitions, experiences (as in phenomenology), or in\nlinguistic intuitions about the acceptability, truth conditions, and\ninferential relations of natural language sentences (natural language\nontology). On such an approach to metaphysics, it is left open what\nsuch data may reflect, whether it is reality in one sense or another,\na realm of actual but derivative entities, entities constituted by the\nexperience itself, or a realm of conceived reality. Older traditions\nof metaphysics that fall under the approach include the Kantian\ntradition, which deals, for example, with ontological categories, but\nas preconditions of accessing the world, rather than as categories of\nhow things really are, as well as the phenomenological tradition\n(Brentano, Husserl, Ingarden), where ontology was also pursued, but\nbased on how things appear (or are constituted by appearance), rather\nthan assumptions about a mind-independent reality.\n\nIn contemporary analytic philosophy, Strawson’s (1959) notion of\ndescriptive metaphysics most clearly focuses on what is reflected in\ndata. The subject matter of descriptive metaphysics is what Strawson\ncalls our “shared conceptual scheme”, a term indicative of\na Kantian background (see entry on\n Strawson).\n Nowadays descriptive metaphysics is more commonly taken to have as\nits subject matter the ontology reflected in our shared intuitions or\nordinary judgments (since metaphysics is generally taken not to be\nabout representations or concepts, but things and their nature).\nStrawson contrasts descriptive metaphysics with what he calls\n“revisionary metaphysics”, which aims to produce a better\nstructure of our thought (or a better ontology, as one may rather\nsay). Strawson does not elaborate how “better” is to be\nunderstood; it may be meant to be metaphysics that better carves\nnature at its joints, provides a better foundation of the natural\nsciences, or is better able to meet whatever the standard a given\nrevisionary metaphysician may have in mind.\n\nGiven the Strawsonian distinction, natural language ontology clearly\nbelongs to descriptive metaphysics, in the sense that its subject\nmatter is the ontology reflected in linguistic intuitions regarding\nthe truth conditions or acceptability of natural language\nsentences.\n\nA distinction somewhat similar to the Strawsonian distinction between\ndescriptive and revisionary metaphysics is Fine’s (2017a)\nalready mentioned distinction between “naïve\nmetaphysics” and “foundational metaphysics”.\nNaïve metaphysics is interested in the general nature of things,\nwithout regard for whether they are real, with our ordinary judgments\nbeing an important guide. As it does not distinguish between\nappearance and reality, Fine also calls it the “metaphysics of\nappearances”. The subject matter of foundational metaphysics, by\ncontrast, is the ontology of what there really is, fundamental\nreality. Foundational metaphysics is defined in terms of its subject\nmatter, not in terms of its deviation from naïve metaphysics.\nWhat is novel in Fine’s distinction is how the relation between\nnaïve and foundational metaphysics is understood: foundational\nmetaphysics must take naïve metaphysics as its starting point (as\nmentioned in\n §1.3);\n naive metaphysics, by contrast, should be pursued without regard of\nfoundational considerations\n\nGiven the Finean distinction, natural language ontology will be part\nof naïve metaphysics. The term “naïve\nmetaphysics” is potentially misleading, though, when applied to\nnatural language ontology. The ontology implicit in natural language\nneeds to be distinguished from the ontology of what non-philosophers\nnaively think there is or accept upon (naive) reflection (the subject\nmatter of folk metaphysics). The ontology of natural language, by\ncontrast, is the ontology that competent speakers of the language\nimplicitly accept, whether philosophers or non-philosophers and\nwhether they would naively or not so naively agree with it upon\nreflection. For that reason, this entry stays with the better\nestablished and less misleading Strawsonian term “descriptive\nmetaphysics”, suitably understood.\n\nThe view that descriptive metaphysics is to be pursued without\nfoundational considerations also defines a methodological principle\nfor natural language ontology, which is not always adhered to in\nnatural language semantics, namely that the decision whether to posit\nentities of particular ontological categories as semantic values\nshould not be made based on assumptions about what is fundamental or\nwhat really exists, but rather on the grounds of the semantic behavior\nof expressions.\n\nIt is not clear that natural language ontology can be pursued just as\na form of “metaphysics of appearances” without\nfoundationalist considerations. Considerations as to what is\nrelatively fundamental certainly enter decisions as to how to\nunderstand derivative entities as semantic values. More importantly,\nconsiderations regarding truth play a central role in semantics as\nwell as natural language ontology. The guiding principle for natural\nlanguage ontology may better be that of giving priority to linguistic\nintuitions over foundationalist considerations when linguistic\nintuitions are available.\n\nOne might think that involving metaphysical considerations in natural\nlanguage ontology means mistakenly imposing a sophisticated\nmetaphysics on the “folk” (competent speakers that are\nnon-philosophers). Clearly, however, what matters is whether the\nontology posited is the correct one, as the ontology speakers\nimplicitly accept by way of using language, not whether it has been\nposited through reflection by the ontologist.\n2.2 How Does Natural Language Reflect Ontology?\n\nIt is a guiding assumption of natural language ontology that natural\nlanguage reflects ontology. That is, the semantics of natural\nlanguages involves entities of various ontological categories,\nontological structures, and ontological notions on the basis of\nsyntactic roles of expressions, syntactic categories and features, and\nlexical words. The following will elaborate some of the ways in which\nnatural language reflects ontology. \n2.2.1 Entities in different semantic roles\n\nFirst of all, entities may play various roles in the semantic\nstructure of natural language sentences. To an extent, it depends on\nparticular semantic theories about relevant constructions or\nexpressions, though, what entities play what sorts of roles\n (§2.2.2).\n \n2.2.1.1 Semantic values of referential NPs and variables\n\nMost importantly, entities play a role as the semantic values of\nreferential noun phrases (NPs), as the things that quantificational\nNPs range over, and as arguments of predicates. Referential NPs are\noccurrences of NPs in sentences in which they have the function of\nstanding for entities. Natural language comes with a wealth of\nexpressions referring to or quantifying over entities, as well as a\nwealth of expressions that express properties of entities (or\nrelations among them). The standard view is that with the utterance of\na simple sentence like the apple is red, the property\nexpressed by red is attributed to the entity the speaker\nrefers to with the apple.\n\nThe notion of a referential NP has played a central role in\nphilosophical discussions about ontological commitment; it is an\nimportant notion in semantics and also plays a role in syntactic\ntheory. Names and definite NPs can serve as referential NPs, as can\nspecific indefinites and certain determinerless (bare) plurals and\nmass nouns. Only certain syntactic positions are reserved for\nreferential NPs, such as the subject or the object position of\nextensional predicates, as opposed to intensional predicates like\nlook for, intentional predicates like imagine, and\nexistence predicates like exist and occur. There are\nvarious syntactic and semantic criteria for referential NPs. For\nphilosophers, since Frege, they include the ability of an NP to\nsupport anaphora, to be replaceable by quantificational NPs, and to\nserve as an argument of ordinary (i.e., extensional) predicates (Frege\n1892; Hale 1987). For syntacticians, referential NPs also must satisfy\ncertain syntactic conditions: they are generally taken to have the\nmore complex structure of a determiner phrase (DP) rather than just\nthat of what syntacticians take to be an NP, NPs being able to be used\nonly predicatively (Abney 1987; Borer 2005).\n\nThe notion of a referential NP (or Eigenname\n‘name’ as it was called at the time) already plays a\ncentral role in Frege’s (1892) philosophy of language, where it\nprovides a syntactic criterion for being an entity. For Frege, an\nentity is what can be the semantic value of a referential NP, since\nstanding for an entity is the role of a referential NP in the context\nof a sentence.\n\nEntities also play a role as semantic values of quantificational NPs,\nmore precisely, the variables that serve to formalize them.\nOntological commitment has been tied to the role of semantic values of\nvariables by Quine (1948), who put forward the dictum “to be is\nto be the value of a variable”. This was meant to apply not so\nmuch to natural language, though, but to regimentations of it in\nformal theories of science. Yet being the semantic value of a variable\nor being in the domain of a quantificational NP has become a\nwell-established criterion for being an entity in the practice of\nnatural language ontology.\n\nSome caution needs to be applied to both the Fregean and the Quinean\ncriterion of objecthood. There are apparently referential NPs whose\nfunction is not that of standing for an actual entity, for example the\nsubjects of negative existentials (Santa Claus does not\nexist) and the arguments of intentional verbs (John is\nthinking about Santa Claus). Furthermore, there are Meinongian\nviews according to which reference and quantification are not actually\nexistence-entailing but only lexical predicates are\n (§3.2;\n Priest 2005). Moreover, there are views according to which\nreferential and quantificational NPs do not always range over\nentities, but may just have an inferential role (Hofweber 2016).\nFinally, not all quantificational NPs have the same semantic role,\nranging over entities that will also act as arguments of the embedding\npredicate. Quantificational NPs of the sort something,\neverything, and several things in English, which can\ntake the place of predicative complements as well as other\nnonreferential positions, have been argued to have a nominalizing\nfunction, introducing “new” entities into the semantic\nstructure of a sentence (Moltmann 2013: Chap. 3) or to be non-nominal\nquantifiers, ranging over the same higher-order entities as are the\nsemantic values of the expressions they may replace (Rosefeldt\n2008).\n\nThe notion of a referential NP also plays a central role in the\ntradition of Montague Grammar, where referential NPs are taken to be\nof type e, the type of entities (Montague 1974). Montague\nhimself, though, also proposed type-lifting referential NPs to the\ntype of individual concepts (of type \\(\\langle\\langle e, t\\rangle,\nt\\rangle\\)). This was meant to allow for semantic uniformity with\nrespect to NPs that for Montague must stand for individual concepts,\nsuch as the rising temperature, the golden mountain,\nand the mathematician John claims to be (but see\n §3.1.1).\n The move no longer maintains a straightforward notion of a\nreferential NP and thus a criterion for entities being part of the\nontology of natural language.\n2.2.1.2 Implicit arguments\n\nAnother role entities may play in the semantic structure of sentences\nis that of implicit arguments, that is, arguments of predicates that\nare not also the semantic values of referential NPs. For example, on\nDavidson‘s (1967) influential analysis of adverbial\nmodification, the sentence John walked slowly states that\nthere is an event which, together with John, is an argument of\nwalk and of which slowly (now treated as a predicate\nof events) is true  \n\\[\\exists e(\\textrm{walk}(e, \\textrm{John}) \\amp \\textrm{slowly}(e)).\\]\n\n\nThe very same considerations that lead Davidson to posit events as\nimplicit arguments apply to adjectives and motivate tropes as\narguments of adjectives. John is profoundly happy will then\nstate that there is a happiness trope that, together with John, is an\nargument of happy and of which profoundly is true\n \n\\[\\exists t(\\textrm{happy}(t, \\textrm{John}) \\amp \\textrm{profoundly}(t)).\\]\n\n\nInstead of tropes, degrees have been used widely as implicit arguments\nof adjectives (Kennedy 2007; Wellwood 2015). Other implicit arguments\nproposed in the literature are implicit location arguments for weather\npredicates (it is raining) (Perry 1986) and implicit taste\nparameters for predicates of personal taste (Stephenson 2007).\nImplicit arguments are posited when expressions appear to act as\npredicates targeting entities for which there are no overt NPs in the\nsyntactic context.\n\nThe semantic role of implicit arguments raises the question whether\nthere is a difference in ontological status between entities that are\nimplicit arguments and entities that are semantic values of\nreferential NPs. Davidson’s arguments for events are generally\ntreated as stronger arguments for events being part of the ontology of\nnatural language than the fact that there are event-referring NPs,\nwhich may have to do with the distinction between core and periphery\nof language\n (§4.1).\n There are alternatives to Davidson’s semantics of adverbials,\nthough, which do not posit such implicit arguments (Kim 1976; Copley\n& Harley 2015).\n2.2.1.3 Parameters of evaluation and truthmakers\n\nYet another important role of entities in the semantic structure of\nnatural language is that of a parameter of evaluation for the truth of\nsentences. The standard semantic view takes a sentence to be true or\nfalse not absolutely, but relative to a time and a (possible) world.\nThis first of all gives justice to the intuition that sentences can be\ntrue or false in actual as well as counterfactual circumstances.\nMoreover, there are natural language expressions that have been\nconsidered operators shifting a parameter of evaluation. Tenses and\ntemporal adverbials are standardly taken to act as operators shifting\nthe time of evaluation and modals as operators shifting the world of\nevaluation. Also conditionals are generally treated as potentially\nshifting the world of evaluation for antecedent and consequent.\n\nThere is generally taken to be a difference in ontological commitment\nbetween parameters of evaluation on the one hand and semantic values\nof referential terms and implicit arguments of predicates on the\nother. It is generally understood that parameters of evaluation do not\ninvolve an ontological commitment on the part of the language user,\nbut are mere posits in the semantic theory, which means they have a\nstatus as entities only in the semantic metalanguage. Parameters of\nevaluation involve an ontological commitment on the part of the\nlanguage users only if there are referential expression in the object\nlanguage making reference to them, or so the general view appears to\nbe. For example, there are referential expressions in English\nreferring to times (today, that day, that moment, etc), but\nnot those referring to worlds, at least not from the core of language\n (§4.1).\n Frege’s criterion of objecthood of course does not apply to\nparameters of evaluation (and, in fact, it did not even apply to\nimplicit arguments).\n2.2.1.4 Other semantic roles for situations\n\nSituations have been considered parameters of evaluation, but they\nplay yet other semantic roles within particular approaches to natural\nlanguage semantics (see entry on\n situations in natural language semantics).\n Thus, in Austin’s (1950) theory of sentence meaning, a speaker,\nwhen uttering a sentence, refers to a situation that provides semantic\nvalues for context-dependent expressions. Does this mean an\nontological commitment to situations? The answer to that question\nbears on another criterion for ontological commitment, that of an\nentity being part of the intended meaning of a sentence. Certainly, an\nontological commitment to situations is in place if situations must\nform part of the intention of speakers when correctly using a\nsentence, as is the case on that theory. This is also the case for\nvarious roles of situations in semantic analyses of definite and\nquantificational NPs, as well as E-type pronouns (Elbourne 2005). By\ncontrast, situations play a role strictly outside the (intended)\nmeaning of a sentence in Récanati’s (2010) theory of\npragmatic enrichment.\n\nIn the more recent development of truthmaker semantics (Fine 2017b),\nsituations play somewhat similar roles to worlds as parameters of\nevaluation for the truth of sentences, though truthmakers are based on\na more restricted relation of exact truthmaking between situations and\nsentences. Situations in their role as truthmakers, it has been\nargued, also act as semantic values of referential and\nquantificational NPs, namely NPs with case as head noun\n(Moltmann 2021a), which would amount to an explicit ontological\ncommitment, in both the Fregean and the Quinean sense.\n2.2.2 The connection between ontology and compositionality\n\nThe ontology of natural language is intimately linked to\ncompositionality, the chief tenet of natural language semantics. Which\nentities play a role in the semantic structure of natural language\ndepends very much on what the semantic contribution of occurrences of\nexpressions to the composition of the meaning of the sentence is taken\nto be. Different compositional semantic analyses of the language may\nthus go along with different ontologies. This means that the choice of\nan ontology may depend on the choice of a compositional semantic\ntheory, which in turn may depend on the choice of a syntactic theory.\nGenerally, the contribution of referential NPs is taken to be that of\nstanding for entities and the role of predicates that of expressing\nproperties that are applied to entities. There is a formal\nalternative, though, on which referential NPs denote higher-level\nfunctions (individual concepts) that apply to predicate denotations\n (§2.2.1.1).\n What is most important is that for the purpose of compositionality\nthe contributions of referential NPs and of predicates are the same in\ndifferent types of sentences. Sometimes, different syntactic analyses\nmay have significant consequences for ontological issues, such as the\nanalysis of the number of planets is eight as an identity\nstatement about numbers (Frege) as opposed to an analysis of the\nsentence as a so-called specificational sentence, conveying a\nquestion-answer relation\n (§1.6).\n\nThere is also a view according to which the semantic role of\nexpressions reflects ontology. Specifically this view has been held by\nFrege, for whom predicates stand for concepts, that is, unsaturated\nentities that need to apply to an object to yield a truth value (entry\non\n Frege,\n see also Liebesman 2015, who takes a critical stance).\n2.2.3 Ontological categories and syntactic categories, positions, and structures\n\nNatural language may manifest ontology also in its syntactic\ncategories, which often appear to reflect ontological categories.\nThus, verbs are generally taken to reflect the category of events\n(Szabó 2015), and adjectives the category of tropes or\nparticularized properties (Williams 1953; Strawson 1959). Syntactic\ncategories do not strictly correlate with ontological categories,\nthough. Be in a hurry, be hurried, and\nhurry all are predicates seemingly standing for the same\nproperty, but based on the lexical content of a noun, an adjective,\nand a verb, respectively. Another, mere tendency of a correlation is\nthat of the syntactic mass-count distinction with the distinction\nbetween stuff and individuals\n (§3.3).\n\nThere is no agreement, at this point, as to the ontological content of\nsyntactic category distinctions. This is a difficult issue also\nbecause there is a lot of cross-linguistic variation as to what\nsyntactic categories natural languages display (Gil 2000). Moreover,\nthere are theoretical developments in syntax that put familiar\nsyntactic category distinctions into question and require at least a\nrecasting of the issue. For example, in distributive morphology (Halle\n& Marantz 1993; Borer 2005), lexical elements (roots) are not\nassociated with syntactic categories in the lexicon. Only when they\nare inserted in a syntactic structure will they be associated with\nsyntactic categories, which means that they cannot owe any\nontologically relevant lexical content to a syntactic category.\nAnother example is the theory of radical lexical decomposition (Hale\n& Kayser 2002), according to which a range of full verbs are\nderived from combinations of a light verb and a noun, e.g.,\nwalk from take a walk (take being the light\nverb and walk the noun). This view gives up a close\nconnection between events and the category of verbs, but posits a much\ngreater range of nouns instead that underlie full verbs.\n\nOntological categories in natural language may be reflected in other\nways in syntax than in syntactic categories, for example in syntactic\npositions. On the recent cartographic theory of syntax (Cinque &\nRizzi 2010), syntactic positions in a sentence or an NP are associated\nwith a semantic content, which often amounts to an ontological\ncategory. For example different positions for adjectival modifiers in\nan NP are distinguished for modifiers of number, size, shape, and\ncolor.\n\nAnother correlation of syntactic structure with ontology may concern\nthe different types of situations that serve as truthmakers for\ndifferent types of modal auxiliaries (Ramchand 2018).\n2.2.4 Metaphysically relevant specific expressions and constructions\n\nBesides syntactic categories, natural language displays particular\ntypes of expressions and constructions that appear to express\nmetaphysical notions. Examples are of course the copula be,\nwhich conveys identity, predication, existence, and perhaps other\nrelated notions, modals that convey metaphysical modality (may,\nmust, essential, the nature of), existence predicates that convey\nexistence or ways of being (exist, occur, obtain)\n (§1.2),\n ontological dependence (which may be conveyed by have or the\npossessor construction), part-whole-related expressions (Vieu 2006),\nexpressions of causation (make, cause) (Swanson 2012), and\ntruth (Hinzen & Wiltschko forthcoming, Moltmann 2021b). In\naddition, there are various nominal constructions that serve to denote\nentities of particular categories, perhaps introduced in particular\nconstruction-specific ways\n (§3.1)\n\nWith metaphysically relevant expressions, there is a general issue\nwhether they may be used as technical terms pertaining to a particular\nphilosophical view, in which case the expressions may be regarded as\npart of the periphery of language, not displaying an ontological\nnotion that is part of the ontology of natural language\n (§4.1).\n Nouns such as existence, property, being,\nevent, and number may be candidates since they can\nbe used with particular philosophical notions in mind, unlike the verb\nexist\n (§1.3)\n and copula and modal verbs, which do not permit non-ordinary,\n“philosophical” uses.\n2.2.5 Chomskyan skepticism about reference to objects in the semantics of natural language\n\nAs mentioned in\n Section 1.3,\n the view that referential NPs stand for objects is not\nuncontroversial. It has been the target of critique particularly by\nChomsky (1986; 1995; 2013), who put forward various challenges to the\ntraditional notion of reference as a relation to “real”\nobjects in a mind-independent reality. These are for the most part\ncases of inconsistent property ascriptions that objects on standard\nviews would not be able to bear. For example, what we refer to as a\n“door” could be painted, replaced, and walked through,\nproperties that could not be attributed jointly to material objects as\nstandardly understood. Another example Chomsky gives is a home, which\nunlike a house may have peculiar combinations of properties: one can\nown or sell a home, but not, for example paint a home. Other examples\nare cities, which can be destroyed and rebuilt at a different\nlocation, artifacts, which can undergo complete replacement of their\nparts, and persons with their relative independence of the bodies.\nEven terms like water, Chomsky (1995) argues, do not stand\nfor an external substance, but are individuated in part by their roles\nin people’s lives. For example, water can be polluted but not\nH2O. Moreover, Sprite has the same percentage of\nH2O as tap water, but one would not call it water, water\nbeing individuated by function, not just chemical composition.\n\nAgainst the background of traditional assumptions of how reality and\nthe individuation of objects is to be conceived\n (§1.3),\n Chomsky’s conclusion is that natural language does not involve\nthe reference relation, as a relation to “real” objects.\nThe semantics of referential noun phrases rather involves\nlexical/conceptual structures deployed by speakers in particular\ncontexts to refer to particular aspects of reality. Instead of a\nsemantics with the (traditional) notion of external reference as its\ncentral notion, referential terms should have an internalist\nsemantics, involving another level of syntactic representation, that\nof lexical-conceptual structure. This view will then require a\ndifferent conception of compositionality than the standard one. Rather\nthan being based on objects and properties, compositional semantics\nwill have to do with concepts only or concepts together with mental\ninstructions (Pietroski 2018).\n\nChomsky’s position, which denies that speakers using referential\nNPs refer to objects (on a particular standard understanding), appears\nto imply a rejection of natural language ontology as such. There are\ndifferent kinds of ontological responses to the various Chomskyan\nchallenges. First, one may adopt a different conception of reality.\nReality need not be conceived as a mind-independent realm of material\nobjects, subject to particular constraints on their spatio-temporal\nlocation. Instead it may be taken to consist in a plenitude of\nentities, including entities that are individuated by function and\npurposes. Second, one may adopt non-standard notions of an object that\nallow for apparently contradictory property attributions, such as\n“complex objects” that obtain properties from distinct\nentities of which they are composed (Arapinis & Vieu 2015) or\n“variable embodiments” that inherit properties from\ndifferent manifestations (Fine 1999). A third type of response is to\nrevise standard views of predication by having predicates apply to\nunderspecified conceptual units (“dot objects”), which are\nthen mapped them onto real objects (Pustejovsky 1995) or to have\npredication be based on particular ways of property inheritance from\nparts or constituting matter (Liebesman & Magidor 2017). \n3. Distinctive Features of the Ontology of Natural Language\n3.1 Complex NPs and Constructional Ontology\n\nThe pursuit of natural language ontology appears to go along with a\nview of ontological pluralism according to which there is not a single\nontology, but several ontologies associated with different cognitive\nor representational functions, in addition to the ontology of what\nthere ultimately is. The following sections will discuss cases that\nappear to show a discrepancy between the ontology of natural language\nand the reflective ontology of ordinary speakers, that is, the\nontology speakers naively accept when thinking about what there is, an\nontology that includes the ontology of ordinary objects. They are just\nsome of examples of the wealth of “derivative” or\n“minor” entities that referential NPs may stand for and\nthat are likely to be rejected by speakers of the language when\nthinking about there is. Referential NPs standing for such\ncontroversial entities satisfy the very same criteria of\nreferentiality as NPs standing for less controversial entities, by\naccepting the same sorts of predicates as ordinary referential NPs,\nsupporting anaphoric pronouns, and being replaceable by\nquantifiers.\n3.1.1 Reference to unrestricted sums and kinds\n\nThe first case involves definite plurals and mass nouns as well as\nconjunctions of definite NPs. The dominant view in natural language\nsemantics is that the semantics of such NPs involves an ontology of\nunrestricted sums of individuals (in the case of plurals) and of\nquantities (in the case of mass NPs). That is, the things in my\ngarden stands for the sum of the things in my garden, the\ndefinite mass NP the sand in the Sahara stands for the sum of\nthe sand quantities in the Sahara, and the Eiffel Tower and the\nDalai Lama stands for the sum of the Eiffel Tower and the Dalai\nLama (Link 1983; Champollion & Krifka 2017; Ojeda 1993).\nMotivations for that view are that definite plurals and mass NPs\nexhibit standard criteria of referentiality and share predicates with\nsingular NPs with the same readings. Thus, heavy displays\nreadings applying to the entire referent of the definite NPs\nbelow:\n\n(3)\n\n\na.\n The stone is heavy\nb.\n The stones are heavy.\nc.\n The sand is heavy.\n\n\n\nA sum of individuals is generally understood on the basis of a part\nrelation specific to plurals and distinct from the part relation\napplying to individuals (Link 1979; Ojeda 1993).\n\nIf definite plural and mass NPs and conjunctions of definite NPs stand\nfor sums, they do not impose any restrictions on sum formation, which\nmeans that the ontology of natural language displays mereological\nuniversalism (see entry on\n mereology).\n Mereological universalism is generally not taken to obtain for the\nontology of ordinary objects, where sum formation appears subject to\nconditions of integrity (such as having a form or boundary) that the\npotential sum must fulfill (Simons 1987) or by teleological conditions\nof purpose (Rose & Schaffer 2017)\n (§1.5).\n Such restrictions need not obtain for sum formation in the ontology\nof the real or fundamental, where mereological universalism is a\nplausible view.\n\nA similar issue arises with the denotation of bare (determinerless)\nplurals and mass nouns such as dinosaurs or water.\nBare plurals and mass nouns in English are generally taken to be able\nto act as terms referring to kinds (Carlson 1977):\n\n(4)\n\n\na.\nPigeons are widespread\nb.\n Water is transparent\n\n\n\nPredicates of kinds include those conveying properties of the kind as\na whole, as in\n (4a),\n and those conveying properties characteristic of the instances of the\nkind, as in\n (4b).\n The kind-referential status of the bare nouns in\n (4a, b)\n is supported by the usual criteria for referentiality. \nPigeons will thus stand for a kind whose instances are particular\npigeons, and water will stand for a kind (substance) whose\ninstances are particular water quantities.\n\nThe semantics of bare plurals and mass nouns involves a particular\nnotion of kind: kind formation for the purpose of the semantics of\nbare plural and mass nouns is unrestricted. Bare plurals like\ntypographical mistakes, old pink buttons or\ncheap red wine are semantically entirely on a par with\npigeons, displaying the same semantic characteristic readings\nof predicates. Those would hardly be considered kinds in folk\nmetaphysics or the ontology of the real, where not just any\ninstantiated (non-natural) property corresponds to a kind. \n\nSuch a divergence also holds for qualities. In the tradition of\nAristotle’s Categories (see entry on\n Aristotle’s Categories),\n bare adjective nominalizations such as wisdom in\n (5)\n can be regarded terms for qualities, universals whose instances have\nbeen taken to be tropes (modes or Aristotelian accidents) (Lowe\n2006):\n\n(5)\n Wisdom is better than cleverness.\n\n\nAs a universal, “wisdom” will have as its instances tropes\nsuch as Socrates’ wisdom or the wisdom of that remark. With bare\nplurals and adjective nominalizations, English appears to reflect the\nAristotelian four-category ontology of individuals (primary\nsubstances), kinds of individuals (secondary substances), tropes\n(accidents/modes), and kinds of tropes (qualities). Like Aristotelian\nsecondary substances, the kinds that bare plurals stand for generally\ninherit their properties from their instances (Pigeons can\nfly) and exist only if instantiated (Pigeons exists\nimplies the existence of an individual pigeon). However, qualities as\ndenotations of bare adjectives are unrestricted.\nIrregularity, dirtiness, and underserved\nwealth will likewise stand for qualities, but not in any sense of\nnaturalness that would put them on a par with natural kinds.\n\nThe view that definite plurals and mass NPs and bare plurals and mass\nnouns stand for unrestricted sums or kinds is not uncontroversial. An\nalternative view that has been pursued for definite plurals is that of\nplural reference, the view according to which the definite plural\nthe stones refers to each stone at once, rather than\nreferring to a single plurality (Yi 2005; 2006; McKay 2006; Oliver\n& Smiley 2013; entry on\n plural quantification).\n There are various motivations for plural reference. One of them is\nthe intuition that a sentence such as\n (3b)\n is about the stones, not a distinct object that is the sum of stones.\nAnother motivation is the applicability of many and numerals\nlike ten to plurals (the stones are many / ten), but\nnot sums (?? the group / sum of the stones is many / ten).\nPlural reference is also motivated by the way the predicates are\nsome of and is one of are understood. If Genie\nis the name for the sum of Russell and Whitehead, only\n (6a)\n will be true, not\n (6b)\n (Yi 2005: 472):\n\n(6)\n\n\na.\nGenie is one of Frege and Genie.\nb.\n Genie is one of Frege and Russell and Whitehead.\n\n\n\nSimilarly, quantities as denotations of definite mass NPs (the\nsand) appear to behave neither as one nor as many and may\nultimately require a different account (Laycock 2006; McKay 2016).\n\nSimilar considerations shed doubt on bare plural and mass nouns\nreferring to kinds as single entities. For example, just as\n (7a),\n unlike\n (7b),\n cannot express the existence of a sum as an entity distinct from the\nindividuals,\n (8a)\n could not be used to make a claim about the existence of an entity\nthat is a possibly uninstantiated kind or property (Strawson 1959;\nWolterstorff 1970: Chap. 7), as opposed to\n (8b),\n which can be used that way:\n\n(7)\n\n\na.\nThe books exist.\nb.\n The sum of the books exists.\n\n(8)\n\n\na.\n Wisdom exists.\nb.\n The property of being wise exists.\n\n\n\nThere are two alternatives one might pursue for the semantics of kind\nterms of the sort of bare plurals and mass nouns: first, posit\nentities that fail to have properties themselves but have properties\nstrictly on the basis of inheritance from their instances; second,\nextend plural reference to bare plurals and mass nouns, by taking them\nto plurally refer to all the possible instances (Moltmann 2013: chap.\n2).\n3.1.2 Intensional definite NPs\n\nNPs such as the increasing air in the balloon, the rising\ntemperature, the people that can fit into the car, or\nthe book John needs to write appear to behave like\nreferential NPs and have been analyzed as standing for particular\nsorts of entities, variable embodiments or variable objects (Fine\n1999; Moltmann 2013: chap. 4), entities that are hardly part of the\nontology speakers in general accept when thinking about what there is.\nThere are alternatives to the ontological analysis, though, such as\nthat of Montague (Montague 1974), who took the temperature to\nstand for a functional concept, and of Grosu & Krifka (2007), who\ntook the related NP the gifted mathematician you claim to be\nto stand for an individual concept.\n3.1.3. Introduction of entities by abstraction\n\nAn important way of introducing abstract objects that has been\ndiscussed in the philosophical literature is that of abstraction from\nconcepts (Frege 1884; Wright 1983; Hale 1987). A related view is that\nof pleonastic entities introduced by “something-from-nothing\ntransformations” on the basis of nonreferential expressions\n(Schiffer 1996). Are these strategies part of the (constructional)\nontology of natural language? On the Fregean view, abstraction is part\nof the semantics of functional number terms like the number of\nplanets, which, on that view, introduce a number on the basis of\na concept (the concept planet) and the relation of equinumerosity. The\npleonastic account was originally applied to that-clauses and\nnominals like the property of being wise (Schiffer 1996). The\nmethod of introducing objects on the basis of nonreferential\nexpressions has been argued to be associated with the compositional\nsemantics of close appositions of the sort the number eight\nand the truth value true, as well as other “reifying\nterms” of the sort the property of being wise and\nthe fact that S (Moltmann 2013: chap. 6). The use of\nthe abstraction strategy may serve the purpose of enlarging the domain\nof the ontology of natural language by choice, if reifying terms are\npart of the “periphery”, not the “core” of\nlanguage\n (§4.1).\n The introduction of entities by abstraction, though, also appears to\nunderlie the Kimian notion of events, as opposed to the Davidsonian\none of events as primitives (Kim 1976; Davidson 1967; Maienborn\n2007).\n3.2 Intentional or Nonexistent Objects\n\nThe view that there are nonexistent or intentional objects,\nMeinongianism, is a highly controversial philosophical view (van\nInwagen 2003; entries on\n existence,\n nonexistent objects,\n fictional entities).\n But it is a view that is often motivated or defended by appeal to\nnatural language (Fine 1982; van Inwagen 1977; Kripke 2013; McGinn\n2000; Parsons 1980; Priest 2005; Salmon 1987, 1998; Thomasson 1999),\nnamely sentences with existence predicates or intentional verbs such\nas look for or think about:\n\n(9)\n\n\na.\n Pegasus does not exist.\nb.\n John thought about / was looking for Pegasus.\n\n\n\nThe Meinongian takes Pegasus in\n (9a)\n and\n (9b)\n to stand for a nonexistent object. There is an alternative view,\nthough, on which it is an exceptional, empty occurrence of a name\n(Sainsbury 2005). Linguistic support for the Meinongian view comes\nfrom the fact that Pegasus in\n (8a)\n and\n (8b)\n fulfills standard criteria for referential terms, such as supporting\nanaphora and allowing for replacement by quantifiers\n(something), as well as from the compositional semantics of\nconstructions with relative clauses as below (Moltmann 2016):\n\n(10)\n\n\na.\nThe building John thought about does not exist.\nb.\n John thought about a building that does not exist.\n\n\n\nA compositional semantics of the relative clause constructions in\n (10a, b)\n can hardly be achieved without positing intentional objects as\narguments of both think about and exist. The task\nfor natural language ontology then is to develop a theory of\nintentional objects that is both coherent and does justice to their\nrestricted occurrences in the semantic structure of sentences.\n\nIf descriptive metaphysics is conceived as the “metaphysics of\nappearances”, this might suggest that non-existent objects would\nhave to be posited as semantic values of referential NPs even with\nextensional predicates. Referential NPs should reflect entities of a\ncertain sort whether or not they exist. However, non-intentional\npredicates are existence-entailing (Priest 2005), which means that in\nextensional contexts only actual entities as semantic values of\nreferential NPs contribute to truth conditions. Thus, the building\nis tall is true only if the building being referred to is an\nactual building that is tall. In extensional contexts, referential NPs\nthat turn out not to refer to actual entities better fail to have a\nsemantic value rather than standing for nonexistent objects. \n\nIn intensional contexts, intentional objects have been posited also as\nsemantic values of anaphora, both within the context of an attitude of\na single agent and across attitudinal contexts involving different\nagents (Edelberg 1986). In those contexts, intentional objects serve\nas discourse referents (Karttunen 1976) and thus interact with dynamic\nsemantics, being individuated not just by what properties agents\nattribute to them, but also by the flow of information in the\ndiscourse (Edelberg 1986). Discourse referents in fact have sometimes\nbeen conceived ontologically even in extensional contexts (Landman\n1986), though this is not the dominant view in dynamic semantics (see\nentry on\n dynamic semantics).\n3.3 The Mass-Count Distinction\n\nThe mass-count distinction displays, in a particularly striking way, a\ndiscrepancy between the ontology displayed by natural language and the\nontology tied to cognition or what is generally taken to be the\nontology of the real. Various criteria distinguish count nouns from\nmass nouns in English. Most important is the availability of the\nplural and the applicability of cardinal and ordinal numerals with\ncount nouns, but not mass nouns (Pelletier & Schubert 1989/ 2003;\nDoetjes 2012). The mass-count distinction, it is generally agreed, has\nsemantic content, but there is much less agreement as to what that\ncontent amounts to (see entry on\n metaphysics of mass expressions).\n The mass-count distinction has often been taken to reflect the\nontological distinction between individuals (chair, door) and\nmatter or stuff (metal, wood), a distinction that has been\ncast either in terms of the notion of having a boundary or integrity\nor being an atom (with respect to some concept). However, more\nrecently linguists have drawn attention to a number of generalizations\nthat indicate that the distinction between singular count, mass, and\nplural nouns does not strictly go along with an ontological\ndistinction between different types of beings (Pelletier &\nSchubert 1989/2003; Chierchia 1998; Moltmann 1997; Rothstein 2017).\nFirst, singular count NPs seem to be able to stand for the very same\nthings as definite plural or mass NPs (the (loose) collection of\nstuff on this desk—the stuff on this desk, the quantity of\nliquid in the container—the liquid in the container).\nSecond, languages may make a choice of mass as opposed to count\nwithout apparent perceptual differences (rice—oats,\ncorn—peas, cattle—cows). Also\ncross-linguistically, the choice of mass versus count for particular\nentities appears to an extent arbitrary (English\nhair—Italian capelli, English\npasta—French pâtes). Third, there is an\nimportant class of so-called object mass nouns, mass nouns that appear\nto stand for pluralities of well-individuated objects, such as\nhardware, jewelry, luggage, staff,\npolice force, often competing with apparent co-extensional\nplural nouns in the same language (clothes—clothing,\npolicemen—police force, cows—cattle,\ncarpets—carpeting). Yet like other mass nouns, object mass\nnouns resist numerals (* the three police force) as well as a\nrange of other predicates applicable to plurals (John listed the\nclothes / ??? the clothing, The policemen / ??\nthe police force are / is numerous). Whether a language\nchooses a singular count, plural, or mass noun appears to an extent\narbitrary; yet the choice between mass and count plays a role for the\napplicability of number-related predicates and quantifiers. The\nmass-count distinction thus displays a form of “grammaticized\nindividuation” (Rothstein 2017), involving a language-driven\nnotion of unity that may diverge from the notion of unity that\npertains to cognition or what is taken to be the real structure of\nthings.\n4. The Issue of Ontologies\n4.1 The Ontology of Natural Language and the Core-Periphery Distinction\n\nNot only metaphysical assertions are generally set aside when pursuing\nnatural language ontology. Philosophers when clarifying metaphysical\nintuitions make use only of certain sorts of expressions (or uses of\nexpressions) and not others, and so for a linguist interested in the\nontology of natural language. Certainly, they will not appeal to\ntechnical philosophical expressions or uses of expressions, that is,\n(uses of) expressions meant to convey philosophical notions arrived at\nby reflection, whether by philosophers or non-philosophers (the\n“folk”). It is a characteristic feature of natural\nlanguage to allow for expansion, permitting at least certain\ntypes of expressions to be used with a particular intended meaning and\nto allow conveying new concepts through the formation of new\nexpressions, by means of morphological processes or syntactic\ncomposition. These are entirely legitimate ways of using language, but\nthey are generally set aside when philosophers appeal to language as a\nway of clarifying metaphysical intuitions. For example, Heidegger\nintroduced the nominalization das Nichts “the\nnothing” as well as the verb nichten “to\nnothing”. While this is not an illegitimate use of language, no\nphilosopher or linguist would take the existence of the nominalization\nor the verb to be evidence for there to be an entity that is a nothing\nor a corresponding process or state. Likewise, the possibility of\nforming, legitimately, the term the truth value true is\ncertainly never taken as evidence for truth values being entities.\nAnother example is the various meanings philosophers associate with\nthe noun existence. The fact that there are different notions\nof existence that different philosophers endorse and associate as the\nmeaning of the noun existence does not mean that the ontology\nof natural language reflects those notions all at once. As was\nmentioned in\n Section 2.2.4,\n not all expressions allow for “non-ordinary” or\n“philosophical” uses in that way. Expressions that belong\nto the functional part of grammar generally do not, such as\nauxiliaries (have, be, can, may), determiners, and\nquantifiers, and neither does the verb exist\n (§1.3).\n\nPhilosophers and non-philosophers when engaging in ontological\nreflection may use or introduce expressions specifically meant to\nconvey their own ontological views. But such (uses of) expressions are\nnever considered indicative of the ontology implicit in natural\nlanguage. Yet they should come with a semantics as well, and may have\nto be assigned as semantic values entities or properties, even if\nfictional, in order to be integrated within a single compositional\nsemantics of the language. Still a distinction needs to be maintained,\nin some way, between what is implicitly accepted as part of our\nlinguistically manifest intuitions (non-technical expressions with\ntheir ordinary meaning) and what is added on through reflection.\n\nThe different ways in which the two sorts of linguistic data are\ntreated, by both philosophers and by linguists, motivate a distinction\nbetween the (ontological) core of natural language (or the\nuse of it) and its (ontological) periphery (Moltmann 2020c):\nonly the core, not the periphery, reflects our metaphysical intuitions\nand thus the ontology of natural language. Clearly, without a\ncore-periphery distinction, any ontological view or notion, as\nreflected in particular technical (uses) of terms, would be part of\nthe ontology of natural language. This would mean that the ontology of\nnatural language would no longer reflect metaphysical intuitions and\nwould comprise an unrestricted range of not generally mutually\ncompatible ontologies.\n\nThough the core-periphery distinction appears to have been tacitly\nmade throughout the history of philosophy as well as in the practice\nof contemporary semanticists, the task of making it precise faces\nconsiderable challenges. One challenge is to elaborate the distinction\ncontent-wise, say in terms of cognitive relations on the part of\nagents, distinguishing, in some way, between intuition or implicit\nacceptance and inferential or reflective acceptance (of part of the\nontology). A second challenge is to investigate whether the\ndistinction is grounded in the grammar of language. A plausible\nhypothesis to pursue is that it goes along with the divide between the\nfunctional part of language (which includes syncategorematic\nexpressions, syntactic categories and features, and auxiliary verbs)\nand the lexicon. The example of the contrast between\nexistence and exist suggests, though, that this may\nbe too simplified: the noun existence should belong to the\nperiphery (since it is able to convey just any notion of existence a\nparticular metaphysician has in mind), whereas the verb exist\nbelongs to the core, not permitting a non-ordinary use.\n\nThe question also arises whether and how the distinction relates to\nthe core-periphery distinction that Chomsky (1981, 1986) introduced\nfor syntax, where, very roughly, the core of the syntactic system of a\nlanguage represents universal grammar and the periphery exceptions and\noutside influences.\n\nNote that “periphery” is not meant to mean\n“marginal” in the sense of statistically less used.\nMoreover, it does not concern the kind of ontology itself: the\nperiphery may contain a technical use of a term which ends up denoting\nthe very same category or entity as a term from the core. What\nmatters, rather, is language-users’ cognitive relation to\nsemantic values, whether it involves some form of reflection or\nderivative acceptance rather than implicit acceptance.\n\nGiven the core-periphery distinction,\n (2)\n will need to be revised as follows:\n\n(11)\n The ontology of a natural language is the ontology a speaker\nimplicitly accepts by way of making use of the core of the\nlanguage.\n\n\nThe periphery by itself imposes challenges for natural language\nsemantics and natural language ontology. The periphery, from a\nlinguistic point of view at least, is a legitimate part of natural\nlanguage (or a legitimate extension of it): technical (uses) of terms\ncertainly have a semantics and will reflect an ontology, even if it is\nnot the ontology of natural language, but one that goes beyond it. It\nis part of the task of natural language semantics to in principle\nallow for the semantic composition of the meaning of sentences\ncontaining philosophical (uses) of terms.\n\nIt has been argued that there is one kind of complex expression that\ngenerally belongs to the periphery, and that is reifying NPs of the\nsort the number eight, the property of being happy, the\nproposition that it is raining, or the truth value true\n(Moltmann 2020c). It is a general observation that philosophers\nusually stay away from reifying NPs when drawing on natural language\nfor motivating an ontological category. For example, Frege (1884) did\nnot motivate numbers as objects by appealing to the construction\nthe number eight in natural language, and he did not motivate\ntruth values as objects by appealing to the truth value true.\nRather he used expressions from the core like the number of\nplanets and eight when arguing for numbers being\nobjects, and his motivations for considering truth values to be\nobjects did not come from particular natural language sentences at\nall. Likewise, Hale (1987) argued for properties being objects not on\nthe basis of terms like the property of mercy, but rather\nsimple terms like mercy from the core of language. Finally,\nLink (1979) motivated mereological sums being part of the ontology of\nlanguage not on the basis of terms like the sum of the\nstudents from the periphery of language, but rather simple\ndefinite plurals like the students. The semantics of reifying\nterms itself appears to be associated with abstraction involving the\nintroduction of an entity on the basis of a nonreferential (use of) an\nexpression (Moltmann 2013, chap. 6). If such an operation of object\nintroduction (a form of derivative acceptance) defines the content of\nreifying terms\n (§3.1.3),\n their classification as part of the periphery may become\nplausible.\n\nThe core-periphery distinction in natural language ontology would be\nimportant also for the quest for universals of natural language\nontology. Only the core reflects metaphysical intuitions, which are\ngenerally held to not display interpersonal inconsistency (see entry\non\n intuition).\n This means that only the core, not the periphery can represent a form\nof universal language-related ontology. Of course, the general\npresupposition that intuitions show no interpersonal inconsistency may\nbe in error, and so may be the assumption that the ontology of the\ncore is universal rather than showing language-particular\ndifferences.\n\nWhile philosophers and linguists generally appear to adopt a\ncore-periphery distinction implicitly, the distinction appears\nexplicitly in a general hypothesis about reference to abstract objects\nin natural language that has been pursued in Moltmann (2013):\n\n(12)\n\n\nThe Abstract-Objects Hypothesis\n\nNatural language does not involve reference to abstract objects in its\ncore, but only in its periphery. \n\n\nThe Abstract-Object Hypothesis is a particular thesis within\nnatural language ontology; it is not a methodological principle of\nnatural language ontology as such. This means that natural language\nontology, with (or even without) its core-periphery distinction, may\nbe pursued while not subscribing to the Abstract-Objects\nHypothesis.\n\nThe Abstract-Objects Hypothesis goes against the widely held belief\nthat reference to abstract objects in natural language is rampant\n (§1.6).\n Based on a range of semantic and syntactic generalizations, Moltmann\n(2013) argues that this view is mistaken: what appear to be\nexpressions in the core of natural language, referring to abstract\nobjects (numbers, properties, propositions, degrees, expression types)\nare in fact expressions referring to particulars, pluralities of\n(actual or possible) particulars, or variable objects, or else they\nare expressions that fail to have a referential function in the first\nplace (numerals, clausal complements, predicative complements,\ncomplements of intensional transitive verbs). The particulars comprise\ntropes, including quantitative tropes (John’s height) and number\ntropes (the number of planets) (see entry on\n tropes).\n Only in the periphery, so the view, is reference to abstract objects\npossible, for example through the use of reifying terms such as\nthe number eight, the property of being happy,\nthe word “happy”, or the proposition that it\nis raining. Thus, the view is that in its core, the ontology of\nnatural language displays a form of trope nominalism (see entry on\n nominalism in metaphysics).\n4.2 The Question of Ontologies\n\nDistinguishing different branches of metaphysics goes hand in hand\nwith the view according to which there is not a single ontology, but\nseveral, at least apparent, ontologies, ontologies pertaining to\nlanguage, to cognition, and to fundamental reality. But there is also\nthe question whether there is in fact a single ontology of natural\nlanguage. When natural language has been used to clarify metaphysical\nintuitions, the presupposition was that metaphysical intuitions do not\nshow interpersonal inconsistencies, which means that there is a unique\nontology reflected in the relevant ways in natural language. There are\nreasons to be skeptical of that presupposition. It is not necessarily\nthe case that there is a single ontology implicit in all natural\nlanguages, just as there may in fact be interpersonal differences\namong intuitions, which have now become the subject of experimental\nphilosophy (see entry on\n experimental philosophy).\n The proper subject matter of natural language ontology should thus be\nthe ontologies of natural languages. The possibility of\ninterlinguistic ontological differences touches touches upon the\nSapir-Whorf hypothesis and the controversy surrounding it (Pinker\n1994; Hespos & Spelke 2004; Pelletier 2011). Of course, it may\nturn out that the ontologies of natural languages are in fact the same\nor at least that there are constraints on how the they may differ from\neach other and what linguistic phenomena (of the lexical or functional\npart of grammar) such differences may pertain to. Assuming a\ndistinction between core and periphery, clearly, if there is a\nuniversal ontology shared by human languages, it should pertain to the\ncore only. Generative linguists may furthermore be interested in such\nconstraints, or a universal ontology, as a way of explaining how the\ngrammar of a language with the ontology that goes along with it can be\nlearned.\n5. Outlook\n\nNatural language ontology is just at the initial stage of developing\nas a discipline of its own. The methodological issues surrounding it\nstill await a serious discussion, such as the relation of the ontology\nreflected in language to different conceptions of reality and to\nontologies tied to other representational or cognitive functions, the\nparticular notion of implicit acceptance that the ontology of natural\nlanguage involves, the core-periphery distinction, the ontological\nstatus associated with different semantic roles, the way ontological\ncategories are reflected in natural language given recent theoretical\nsyntactic and cross-linguistic research, and the different connections\nof the ontology of natural language to the functional and the lexical\npart of grammar.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abney, Steven P., 1987, “The English Noun Phrase in Its\nSentential Aspect”, PhD thesis, Massachusetts Institute of\nTechnology, Cambridge, MA.\n [<a href=\"https://dspace.mit.edu/handle/1721.1/14638\" target=\"other\">Abney 1987 available online</a>]",
                "Arapinis, Alexandra and Laure Vieu, 2015, “A Plea for\nComplex Categories in Ontologies”, <em>Applied Ontology</em>,\n10(3–4): 285–296. doi:10.3233/AO-150156",
                "Asher, Nicholas, 1993, <em>Reference to Abstract Objects in\nDiscourse</em>, (Studies in Linguistics and Philosophy 50),\nDordrecht/Boston: Kluwer Academics. doi:10.1007/978-94-011-1715-9",
                "Austin, J. L., 1950, “Truth”, <em>Aristotelian Society\nSupplementary Volume</em>, 24: 111–128. Reprinted in his\n<em>Philosophical Papers</em>, Oxford: Clarendon Press 1961, third\nedition 1979: 117–133.\ndoi:10.1093/aristoteliansupp/24.1.111",
                "Azzouni, Jody, 2004, <em>Deflating Existential Consequence: A Case\nfor Nominalism</em>, New York: Oxford University Press.\ndoi:10.1093/0195159888.001.0001",
                "Bach, Emmon, 1986, “Natural Language Metaphysics”, in\n<em>Logic, Methodology and Philosophy of Science VII</em>, Ruth Barcan\nMarcus, Georg J. W. Dorn, and Paul Weingartner (eds.), (Studies in\nLogic and the Foundations of Mathematics 114), Amsterdam: North\nHolland, 573–595. doi:10.1016/S0049-237X(09)70714-1",
                "Bach, Emmon and Wynn Chao, 2012, “The Metaphysics of Natural\nLanguage(s)”, in <em>Philosophy of Linguistics</em>, Ruth M.\nKempson, Tim Fernando, and Nicholas Asher (eds.), (Handbook of the\nPhilosophy of Science 14), Amsterdam: North Holland, 175–196.\ndoi:10.1016/B978-0-444-51747-0.50006-8",
                "Barwise, Jon and John Perry, 1983, <em>Situations and\nAttitudes</em>, Cambridge, MA: The MIT Press.",
                "Bealer, George, 1993, “Universals”, <em>Journal of\nPhilosophy</em>, 90(1): 5–32. doi:10.2307/2940824",
                "Boolos, George, 1998, “Must We Believe in Set\nTheory?”, in <em>Logic, Logic, and Logic</em>, Richard Jeffrey\n(ed.), Cambridge, MA: Harvard University Press, 120–132.",
                "Borer, Hagit, 2005, <em>Structuring Sense, Volume I: In Name\nOnly</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199263905.001.0001",
                "Carlson, Gregory Norman, 1977, “Reference to Kinds in\nEnglish.”, Ph.D. thesis, University of Massachusetts at Amherst.\nPublished New York: Garland, 1980.",
                "Champollion, Lucas and Manfred Krifka 2017,\n“Mereology”, in Paul Dekker and Maria Aloni (eds.):\n<em>Cambridge Handbook of Semantics</em>, 369–388.\ndoi:10.1007/BF00632905",
                "Chierchia, Gennaro, 1998, “Plurality of Mass Nouns and the\nNotion of ‘Semantic Parameter’”, in <em>Events and\nGrammar</em>, Susan Rothstein (ed.), (Studies in Linguistics and\nPhilosophy 70), Dordrecht: Kluwer, 53–103.\ndoi:10.1017/CB09781139236157.014",
                "Chierchia, Gennaro and Raymond Turner, 1988, “Semantics and\nProperty Theory”, <em>Linguistics and Philosophy</em>, 11(3):\n261–302. doi:10.1007/BF00632905",
                "Chomsky, Noam, 1981, <em>Lectures on Government and Binding. The\nPisa Lectures</em>, (Convergence), Dordrecht: Foris Publications.",
                "Chomsky, Noam, 1986, <em>Knowledge of Language: Its Nature,\nOrigins, and Use</em>, (Convergence), Westport, CT/London:\nPraeger.",
                "–––, 1995, “Language and Nature”,\n<em>Mind</em>, 104(413): 1–61. doi:10.1093/mind/104.413.1",
                "–––, 2000, <em>New Horizons in the Study of\nLanguage and Mind</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511811937",
                "Chomsky, Noam, 2013, “Notes on Denotation and\nDenoting”, in Ivano Caponigro and Carlo Cecchetto <em>From\nGrammar to Meaning. The Sponaneous Logicality of Language</em>,\n38–46. Cambride: Cambridge University Press.",
                "Cinque, Guglielmo and Luigi Rizzi, 2010, “The Cartography of\nSyntactic Structures”, in <em>The Oxford Handbook of Linguistic\nAnalysis</em>, Bernd Heine and Heiko Narrog (eds.), (Oxford Handbooks\nin Linguistics), Oxford/New York: Oxford University Press,\n51–65. doi:10.1093/oxfordhb/9780199544004.013.0003",
                "Copley, Bridget and Heidi Harley, 2015, “A Force-Theoretic\nFramework for Event Structure”, <em>Linguistics and\nPhilosophy</em>, 38(2): 103–158.\ndoi:10.1007/s10988-015-9168-x",
                "Cresswell, M. J., 1986, “Why Objects Exist but Events\nOccur”, <em>Studia Logica</em>, 45(4): 371–375.\ndoi:10.1007/BF00370270",
                "Davidson, Donald, 1967, “The Logical Form of Action\nSentences”, in <em>The Logic of Decision and Action</em>,\nNicholas Rescher (ed.), Pittsburgh, PA: University of Pittsburgh\nPress, 81–95.",
                "Doetjes, Jenny, 2012, “Count/Mass Distinctions across\nLanguages”, in <em>Semantics: An International Handbook of\nNatural Language Meaning, Volume 3</em>, Claudia Maienborn, Klaus von\nHeusinger, and Paul Portner (eds.), Berlin/Boston: De Gruyter,\n2559–2580. doi:10.1515/9783110253382.2559",
                "Edelberg, Walter, 1986, “A New Puzzle about Intentional\nIdentity”, <em>Journal of Philosophical Logic</em>, 15(1):\n1–25. doi:10.1007/BF00250547",
                "Eklund, Matti, 2008, “The Picture of Reality as an Amorphous\nLump”, in <em>Contemporary Debates in Metaphysics</em>, Theodore\nSider, John Hawthorne, and Dean W. Zimmerman (eds.), Malden, MA:\nBlackwell, 382–396.",
                "Elbourne, Paul D., 2005, <em>Situations and Individuals</em>,\n(Current Studies in Linguistics 41), Cambridge, MA: MIT Press.",
                "Fine, Kit, 1982, “The Problem of Non-Existents: I.\nInternalism”, <em>Topoi</em>, 1(1–2): 97–140.\ndoi:10.1007/BF00157548",
                "–––, 1999, “Things and Their Parts”,\n<em>Midwest Studies in Philosophy</em>, 23(1): 61–74.\ndoi:10.1111/1475-4975.00004",
                "–––, 2003, “The Non-Identity of a Material\nThing and Its Matter”, <em>Mind</em>, 112(446): 195–234.\ndoi:10.1093/mind/112.446.195",
                "–––, 2006, “In Defense of\nThree-Dimensionalism”, <em>Journal of Philosophy</em>, 103(12):\n699–714. doi:10.5840/jphil2006103126",
                "–––, 2017a, “Naive Metaphysics”,\n<em>Philosophical Issues</em>, 27(1): 98–113.\ndoi:10.1111/phis.12092",
                "–––, 2017b, “Truthmaker Semantics”,\nin <em>A Companion to the Philosophy of Language</em>, Bob Hale,\nCrispin Wright, and Alexander Miller (eds.), second edition,\nChichester, UK: Wiley Blackwell, II:556–577.\ndoi:10.1002/9781118972090.ch22",
                "Fiorin, Gaetano and Denis Delfitto, 2020, <em>Beyond Meaning: A\nJourney Across Language, Perception and Experience</em>, (Perspectives\nin Pragmatics, Philosophy &amp; Psychology 25), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-030-46317-5",
                "Frege, Gottlob, 1884, <em>Die Grundlagen der Arithmetik</em>\n(<em>Foundations of Arithmetic</em>), Breslau: Verlage Wilhelm\nKoebner.",
                "–––, 1892, “Funktion und Begriff”,\nJena: Hermann Pohle. Reprinted in his <em>Funktion, Begriff,\nBedeutung: Fünf Logische Studien</em>, Günther Patzig (ed.),\n(Kleine Vandenhoeck-Reihe 144/145), Göttingen: Vandenhoeck &amp;\nRuprecht, 1962. Translated as “Function and Concept” by P.\nGeach in <em>Translations from the Philosophical Writings of Gottlob\nFrege</em>, P. Geach and M. Black (eds. and trans.), 1980, Oxford:\nBlackwell, pp. 21–41.",
                "–––, 1918/19, “Der Gedanke. Eine Logische\nUntersuchung”, <em>Beiträge zur Philosophie des deutschen\nIdealismus</em>, 1: 58–77. Translated by P. Geach and R.\nStoothoff as “Thoughts” in Frege’s <em>Collected\nPapers on Mathematics, Logic, and Philosophy</em>, Brian McGuinness\n(ed.), Oxford: Blackwell, 1984, pp. 351–372.",
                "Gil, David, 2000, “Syntactic Categories, Cross-Linguistic\nVariation and Universal Grammar”, in <em>Approaches to the\nTypology of Word Classes</em>, Petra M. Vogel and Bernard Comrie\n(eds.), (Empirical Approaches to Language Typology 23), New York: De\nGruyter Mouton, 173–216. doi:10.1515/9783110806120.173",
                "Grosu, Alexander and Manfred Krifka, 2007, “<em>The Gifted\nMathematician That You Claim to Be</em>: Equational Intensional\n‘Reconstruction’ Relatives”, <em>Linguistics and\nPhilosophy</em>, 30(4): 445–485.\ndoi:10.1007/s10988-008-9022-5",
                "Hacker, P. M. S., 1982, “Events, Ontology and\nGrammar”, <em>Philosophy</em>, 57(222): 477–486.\ndoi:10.1017/S0031819100056102",
                "Hale, Bob, 1987, <em>Abstract Objects</em>, (Philosophical\nTheory), Oxford/New York: B. Blackwell.",
                "Hale, Kenneth L. and Samuel Jay Keyser, 2002, <em>Prolegomenon to\na Theory of Argument Structure</em>, (Linguistic Inquiry Monographs\n39), Cambridge, MA: MIT Press.",
                "Halle, Morris and Alec Marantz, 1993, “Distributive\nMorphology and the Pieces of Inflection”, in <em>The View from\nBuilding 20: Essays in Linguistics in Honor of Sylvain\nBromberger</em>, Kenneth L. Hale, Samuel Jay Keyser, and Sylvain\nBromberger (eds.), (Current Studies in Linguistics 24), Cambridge,\nMass: MIT Press, 111–176.",
                "Harves, Stephanie and Richard S. Kayne, 2012, “Having\n‘Need’ and Needing ‘Have’”,\n<em>Linguistic Inquiry</em>, 43(1): 120–132.\ndoi:10.1162/LING_a_00076",
                "Hespos, Susan J. and Elizabeth S. Spelke, 2004, “Conceptual\nPrecursors to Language”, <em>Nature</em>, 430(6998):\n453–456. doi:10.1038/nature02634",
                "Hinzen, Wolfram and Martina Wiltschko, forthcoming, “The\nGrammar of Truth”, <em>Inquiry</em>, first online: 29 October\n2018, 33 pages. doi:10.1080/0020174X.2018.1532691",
                "Hofweber, Thomas, 2016, <em>Ontology and the Ambitions of\nMetaphysics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198769835.001.0001",
                "Karttunen, Lauri, 1976, “Discourse Referents”, in\n<em>Notes from the Linguistic Underground</em>, James D. McCawley\n(ed.), (Syntax and Semantics 7), New York: Academic Press,\n363–386.",
                "Kayne, Richard S., 2005, <em>Movement and Silence</em>, (Oxford\nStudies in Comparative Syntax), New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195179163.001.0001",
                "Kennedy, Christopher, 2007, “Vagueness and Grammar: The\nSemantics of Relative and Absolute Gradable Adjectives”,\n<em>Linguistics and Philosophy</em>, 30(1): 1–45.\ndoi:10.1007/s10988-006-9008-0",
                "Kim, Jaegwon, 1976, “Events as Property\nExemplifications”, in <em>Action Theory</em>, Myles Brand and\nDouglas Walton (eds.), Dordrecht: Reidel, 159–177.\ndoi:10.1007/978-94-010-9074-2_9",
                "Kripke, Saul A., 2013, <em>Reference and Existence: The John Locke\nLectures</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199928385.001.0001",
                "Landman, Fred, 1986, “Pegs and Alecs”, in his\n<em>Towards a Theory of Information: The Status of Partial Objects in\nSemantics</em>, (GRASS 6), Dordrecht: Foris, 97–155.",
                "Laycock, Henry, 2006, <em>Words without Objects: Semantics,\nOntology, and Logic for Non-Singularity</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199281718.001.0001",
                "Liebesman, David and Ofra Magidor, 2017, “Copredication and\nProperty Inheritance: Copredication and Property Inheritance”,\n<em>Philosophical Issues</em>, 27(1): 131–166.\ndoi:10.1111/phis.12104",
                "Liebesman, David 2015, “Predication as Ascription”,\n<em>Mind</em>, 124(494): 217–569. doi:10.1093/fzu182",
                "Link, Godehard, 1983, “The Logical Analysis of Plurals and\nMass Nouns”, in <em>Meaning, Use, and Interpretation of\nLanguage</em>, Rainer Bäeuerle, Christoph Schwarze, and Arnim von\nStechow (eds.), Berlin/New York: De Gruyter, 302–323.",
                "Lowe, E. J., 2006, <em>The Four-Category Ontology: A Metaphysical\nFoundation for Natural Science</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199254397.001.0001",
                "Ludlow, Peter, 1999, <em>Semantics, Tense, and Time: An Essay in\nthe Metaphysics of Natural Language</em>, Cambridge, MA: MIT\nPress.",
                "Magidor, Ofra, 2013, <em>Category Mistakes</em>, (Oxford\nPhilosophical Monographs), Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199572977.001.0001",
                "Maienborn, Claudia, 2007, “On Davidsonian and Kimian\nStates”, in <em>Existence: Semantics and Syntax</em>, Ileana\nComorovski and Klaus von Heusinger (eds.), (Studies in Linguistics and\nPhilosophy 84), Dordrecht: Springer Netherlands, 107–130.\ndoi:10.1007/978-1-4020-6197-4_4",
                "McGinn, Colin, 2000, <em>Logical Properties: Identity, Existence,\nPredication, Necessity, Truth</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199241813.001.0001",
                "McKay, Thomas J., 2006, <em>Plural Predication</em>, Oxford:\nClarendon Press. doi:10.1093/acprof:oso/9780199278145.001.0001",
                "–––, 2016, “Mass and Plural”, in\n<em>Unity and Plurality: Logic, Philosophy, and Linguistics</em>,\nMassimiliano Carrara, Alexandra Arapinis, and Friederike Moltmann\n(eds.), Oxford: Oxford University Press, 171–193.\ndoi:10.1093/acprof:oso/9780198716327.003.0008",
                "Moltmann, Friederike, 1997, <em>Parts and Wholes in\nSemantics</em>, New York: Oxford University Press.",
                "–––, 2013, <em>Abstract Objects and the\nSemantics of Natural Language</em>, Oxford/New York: Oxford University\nPress. doi:10.1093/acprof:oso/9780199608744.001.0001",
                "–––, 2015, “Quantification with\nIntentional and with Intensional Verbs”, in <em>Quantifiers,\nQuantifiers, and Quantifiers: Themes in Logic, Metaphysics, and\nLanguage</em>, Alessandro Torza (ed.), (Synthese Library 373), Cham:\nSpringer International Publishing, 141–168.\ndoi:10.1007/978-3-319-18362-6_8",
                "–––, 2016, “Quantification with\nIntentional and with Intensional Verbs,” in A. Torza (ed.),\n<em>Quantifiers, Quantifiers, Quantifiers</em>, Dordrecht: Springer,\nSynthese Library, pp. 141–168.",
                "–––, 2019, “Natural Language and Its\nOntology”, in <em>Metaphysics and Cognitive Science</em>, Alvin\nI. Goldman and Brian P. McLaughlin (eds.), Oxford: Oxford University\nPress, 206–232. doi:10.1093/oso/9780190639679.003.0009",
                "–––, 2020a, “Natural Language\nOntology”, in <em>The Routledge Handbook of Metametaphyics</em>,\nRicki Bliss and J. T. M. Miller (eds.), New York: Routledge, ch.\n25.",
                "–––, 2020b, “Existence Predicates”,\n<em>Synthese</em>, 197(1): 311–335.\ndoi:10.1007/s11229-018-1847-z",
                "–––, 2020c, “Abstract Objects and the\nCore-Periphery Distinction in the Ontological and the Conceptual\nDomain of Natural Language”, in <em>Abstract Objects: For and\nAgainst</em>, José L. Falguera and Concha Martínez-Vidal\n(eds.), (Synthese Library 422), Cham: Springer International\nPublishing, 255–276. doi:10.1007/978-3-030-38242-1_13",
                "–––, 2021a, “Situations, Alternatives, and\nthe Semantics of ‘Cases’”, <em>Linguistics and\nPhilosophy</em>, 44(1): 153–193.\ndoi:10.1007/s10988-019-09282-7",
                "–––, 2021b, “Truth Predicates, Truth\nBearers, and Their Variants”, <em>Synthese</em>, 198(S2):\n689–716. doi:10.1007/s11229-018-1814-8",
                "Montague, Richard, 1974, <em>Formal Philosophy: Selected Papers of\nRichard Montague</em>, Richmond H. Thomason (ed.), New Haven, CT: Yale\nUniversity Press.",
                "Ojeda, Almerindo E., 1993, <em>Linguistic Individuals</em>, (CSLI\nLecture Notes 31), Stanford, CA: CSLI Publications.",
                "Oliver, Alex and Timothy Smiley, 2013, <em>Plural Logic</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199570423.001.0001",
                "Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven,\nCT: Yale University Press.",
                "Pelletier, Jeffry, 2011, “Descriptive Metaphysics, Natural\nLanguage Metaphysics, Sapir-Whorf, and All That Stuff”,\n<em>Baltic International Yearbook of Cognition, Language, and\nCommunication</em> 6.",
                "Pelletier, Jeffry, and Leonard Schubert 1989/2003, “Mass\nExpressions”, in Franz Guenthner and Dov Gabbay (eds.),\n<em>Handbook of Philosophical Logic</em> 2nd edition, vol. 10,\n249–336; updated version of the 1989 version in the 1st edition\nof <em>Handbook of Philosophical Logic</em>.",
                "Perry, John, 1986, “Thought without Representation”,\n<em>Aristotelian Society Supplementary Volume</em>, 60: 137–151.\ndoi:10.1093/aristoteliansupp/60.1.137",
                "Pietroski, Paul M., 2018, <em>Conjoining Meanings: Semantics\nwithout Truth Values</em>, (Context and Content), Oxford: Oxford\nUniversity Press. doi:10.1093/oso/9780198812722.001.0001",
                "Pinker, Steven, 1994, <em>The Language Instinct</em>, New York: W.\nMorrow and Co.",
                "Postal, Paul M., 2018, “The Ontology of Natural\nLanguage”, in <em>Essays on Linguistic Realism</em>, Christina\nBehme and Martin Neef (eds.), (Studies in Language Companion Series\n196), Amsterdam/Philadelphia: John Benjamins Publishing Company,\n1–6.",
                "Priest, Graham, 2015, <em>Towards Nonbeing. The Logic and\nMetaphysics of Intentionality</em>, Oxford: Oxford University\nPress.",
                "Pustejovsky, James, 1995, <em>The Generative Lexicon</em>,\nCambridge: MIT Press.",
                "Quine, W. V., 1948, “On What There Is”, <em>The Review\nof Metaphysics</em>, 2(5): 21–38. Reprinted in his <em>From a\nLogical Point of View</em>, Cambridge, MA: Harvard University Press,\n1953, 1–19.",
                "Ramchand, Gilllian, 2018, <em>Situations and Syntactic\nStructures</em>, Cambridge: MIT Press.",
                "Récanati, François, 2010, <em>Truth-Conditional\nPragmatics</em>, Oxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199226993.001.0001",
                "Romero, Maribel, 2005, “Concealed Questions and\nSpecificational Subjects”, <em>Linguistics and Philosophy</em>,\n28(6): 687–737. doi:10.1007/s10988-005-2654-9",
                "Rose, David and Jonathan Schaffer, 2017, “Folk Mereology Is\nTeleological”, <em>Noûs</em>, 51(2): 238–270.\ndoi:10.1111/nous.12123",
                "Rosefeldt, Tobias, 2008, “‘That’-Clauses and\nNon-Nominal Quantification”, <em>Philosophical Studies</em>,\n137(3): 301–333. doi:10.1007/s11098-006-0002-8",
                "Rothstein, Susan, 2017, <em>Semantics for Counting ad\nMeasuring</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/978051.173.4830",
                "Sainsbury, R. M., 2005, <em>Reference without Referents</em>,\nOxford: Clarendon Press. doi:10.1093/0199241805.001.0001",
                "Salmon, Nathan, 1987, “Existence”, <em>Philosophical\nPerspectives</em>, 1: 49–108. doi:10.2307/2214143",
                "–––, 1998, “Nonexistence”,\n<em>Noûs</em>, 32(3): 277–319.\ndoi:10.1111/0029-4624.00101",
                "Schaffer, Jonathan, 2019, “Cognitive Science and\nMetaphysics: Partners in Debunking”, in <em>Metaphysics and\nCognitive Science</em>, Alvin I. Godman and Brian P. McLaughlin\n(eds.), Oxford: Oxford University Press, 38–70.\ndoi:10.1093/oso/9780190639679.003.0003",
                "Schaffer, Jonathan, 2019, “What grounds What”, in\n<em>Metametaphysics</em>, David Chalmers, David Manley, and Ryan\nWasserman (eds.), Oxford: Oxford University Press, 347–383.\ndoi:10.1093/oso/9780190639679.003.0003",
                "Schiffer, Stephen, 1996, “Language-Created\nLanguage-Independent Entities”:, <em>Philosophical Topics</em>,\n24(1): 149–167. doi:10.5840/philtopics199624117",
                "Simons, Peter, 1987, <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199241460.001.0001",
                "Stephenson, Tamina, 2007, “Judge Dependence, Epistemic\nModals, and Predicates of Personal Taste”, <em>Linguistics and\nPhilosophy</em>, 30(4): 487–525.\ndoi:10.1007/s10988-008-9023-4",
                "Strawson, P.F., 1950, “Truth”, <em>Aristotelian\nSociety Supplementary Volume</em>, 24(1): 111–172. Reprinted in\nhis <em>Logico-Linguistic Papers</em>, London: Methuen, 1971, pp.\n190–213. doi:10.1093/aristoteliansupp/24.1.111",
                "–––, 1959, <em>Individuals: An Essay in\nDescriptive Metaphysics</em>, London: Methuen.",
                "Swanson, Eric, 2012, “The Language of Causation,” in\n<em>The Routledge Companion to Philosophy of Language</em>, Gillian\nRussell and Delia Graff Fara (eds), New York/London: Routledge,\n716–728 (6.3.1).",
                "Szabó, Zoltán Gendler, 2006, “Counting across\nTimes”, <em>Philosophical Perspectives</em>, 20(1):\n399–426. doi:10.1111/j.1520-8583.2006.00113.x",
                "–––, 2015, “Major Parts of Speech”,\n<em>Erkenntnis</em>, 80(S1): 3–29.\ndoi:10.1007/s10670-014-9658-1",
                "Thomasson, Amie L., 1999, <em>Fiction and Metaphysics</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511527463",
                "Twardowski, Kazimierz, 1911, “O czynnościach i\nwytworach. Kilka uwag z pogranicza psychologii, gramatyki i\nlogiki”, Lwdw: Uniwersytetu Lwowskiego. Translated as\n“Actions and Products. Some Remarks from the Borderline of\nPsychology, Grammar and Logic”, in <em>Kazimierz Twardowski. On\nActions, Products and Other Topics in the Philosophy</em>, Johannes L.\nBrandl and Jan Woleński (eds.) and Arthur Szylewicz (trans.),\nAmsterdam/Atlanta: Rodopi, 1999, 103–132.",
                "Van Inwagen, Peter, 1977, “Creatures of Fiction”,\n<em>American Philosophical Quarterly</em>, 14(4): 299–308.",
                "–––, 2003, “Existence, Ontological\nCommitment, and Fictional Entities”, in <em>The Oxford Handbook\nof Metaphysics</em>, Michael J. Loux and Dean W. Zimmerman (eds.),\nOxford: Oxford University Press, 131–158.\ndoi:10.1093/oxfordhb/9780199284221.003.0006",
                "Vendler, Zeno, 1967, <em>Linguistics in Philosophy</em>, Ithaca,\nNY: Cornell University Press.",
                "–––, 1972, <em>Res Cogitans: An Essay in\nRational Psychology</em>, (Contemporary Philosophy), Ithaca, NY:\nCornell University Press.",
                "Vieu, Laure, 2006, “On the Transitivity of Functional\nParthood”, <em>Applied Ontology</em>, 1(2): 147–155.",
                "Wellwood, Alexis, 2015, “On the Semantics of Comparison\nacross Categories”, <em>Linguistics and Philosophy</em>, 38(1):\n67–101. doi:10.1007/s10988-015-9165-0",
                "Wellwood, Alexis, Valentine Hacquard, and Roumyana Pancheva, 2012,\n“Measuring and Comparing Individuals and Events”,\n<em>Journal of Semantics</em>, 29(2): 207–228.\ndoi:10.1093/jos/ffr006",
                "Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: MIT Press.",
                "Williams, Donald C., 1953, “On the Eelements of\nBeing”, <em>The Review of Metaphysics</em>, 7: 3–18 (Part\nI), 171–192 (Part II).",
                "Wisniewski, Edward J., Mutsumi Imai, and Lyman Casey, 1996,\n“On the Equivalence of Superordinate Concepts”,\n<em>Cognition</em>, 60(3): 269–298.\ndoi:10.1016/0010-0277(96)00707-X",
                "Wolterstorff, Nicholas, 1970, <em>On Universals: An Essay in\nOntology</em>, Chicago: University of Chicago Press.",
                "Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, (Scots Philosophical Monographs 2), Aberdeen: Aberdeen\nUniversity Press.",
                "Yi, Byeong-Uk, 2005, “The Logic and Meaning of Plurals. Part\nI”, <em>Journal of Philosophical Logic</em>, 34(5–6):\n459–506. doi:10.1007/s10992-005-0560-9",
                "–––, 2006, “The Logic and Meaning of\nPlurals. Part II”, <em>Journal of Philosophical Logic</em>,\n35(3): 239–288. doi:10.1007/s10992-005-9015-6",
                "Zalta, Edward N., 1983, <em>Abstract Objects: An Introduction to\nAxiomatic Metaphysics</em>, (Synthese Library 160), Dordrecht: D.\nReidel."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Abney, Steven P., 1987, “The English Noun Phrase in Its\nSentential Aspect”, PhD thesis, Massachusetts Institute of\nTechnology, Cambridge, MA.\n [<a href=\"https://dspace.mit.edu/handle/1721.1/14638\" target=\"other\">Abney 1987 available online</a>]</li>\n<li>Arapinis, Alexandra and Laure Vieu, 2015, “A Plea for\nComplex Categories in Ontologies”, <em>Applied Ontology</em>,\n10(3–4): 285–296. doi:10.3233/AO-150156</li>\n<li>Asher, Nicholas, 1993, <em>Reference to Abstract Objects in\nDiscourse</em>, (Studies in Linguistics and Philosophy 50),\nDordrecht/Boston: Kluwer Academics. doi:10.1007/978-94-011-1715-9</li>\n<li>Austin, J. L., 1950, “Truth”, <em>Aristotelian Society\nSupplementary Volume</em>, 24: 111–128. Reprinted in his\n<em>Philosophical Papers</em>, Oxford: Clarendon Press 1961, third\nedition 1979: 117–133.\ndoi:10.1093/aristoteliansupp/24.1.111</li>\n<li>Azzouni, Jody, 2004, <em>Deflating Existential Consequence: A Case\nfor Nominalism</em>, New York: Oxford University Press.\ndoi:10.1093/0195159888.001.0001</li>\n<li>Bach, Emmon, 1986, “Natural Language Metaphysics”, in\n<em>Logic, Methodology and Philosophy of Science VII</em>, Ruth Barcan\nMarcus, Georg J. W. Dorn, and Paul Weingartner (eds.), (Studies in\nLogic and the Foundations of Mathematics 114), Amsterdam: North\nHolland, 573–595. doi:10.1016/S0049-237X(09)70714-1</li>\n<li>Bach, Emmon and Wynn Chao, 2012, “The Metaphysics of Natural\nLanguage(s)”, in <em>Philosophy of Linguistics</em>, Ruth M.\nKempson, Tim Fernando, and Nicholas Asher (eds.), (Handbook of the\nPhilosophy of Science 14), Amsterdam: North Holland, 175–196.\ndoi:10.1016/B978-0-444-51747-0.50006-8</li>\n<li>Barwise, Jon and John Perry, 1983, <em>Situations and\nAttitudes</em>, Cambridge, MA: The MIT Press.</li>\n<li>Bealer, George, 1993, “Universals”, <em>Journal of\nPhilosophy</em>, 90(1): 5–32. doi:10.2307/2940824</li>\n<li>Boolos, George, 1998, “Must We Believe in Set\nTheory?”, in <em>Logic, Logic, and Logic</em>, Richard Jeffrey\n(ed.), Cambridge, MA: Harvard University Press, 120–132.</li>\n<li>Borer, Hagit, 2005, <em>Structuring Sense, Volume I: In Name\nOnly</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199263905.001.0001</li>\n<li>Carlson, Gregory Norman, 1977, “Reference to Kinds in\nEnglish.”, Ph.D. thesis, University of Massachusetts at Amherst.\nPublished New York: Garland, 1980.</li>\n<li>Champollion, Lucas and Manfred Krifka 2017,\n“Mereology”, in Paul Dekker and Maria Aloni (eds.):\n<em>Cambridge Handbook of Semantics</em>, 369–388.\ndoi:10.1007/BF00632905</li>\n<li>Chierchia, Gennaro, 1998, “Plurality of Mass Nouns and the\nNotion of ‘Semantic Parameter’”, in <em>Events and\nGrammar</em>, Susan Rothstein (ed.), (Studies in Linguistics and\nPhilosophy 70), Dordrecht: Kluwer, 53–103.\ndoi:10.1017/CB09781139236157.014</li>\n<li>Chierchia, Gennaro and Raymond Turner, 1988, “Semantics and\nProperty Theory”, <em>Linguistics and Philosophy</em>, 11(3):\n261–302. doi:10.1007/BF00632905</li>\n<li>Chomsky, Noam, 1981, <em>Lectures on Government and Binding. The\nPisa Lectures</em>, (Convergence), Dordrecht: Foris Publications.</li>\n<li>Chomsky, Noam, 1986, <em>Knowledge of Language: Its Nature,\nOrigins, and Use</em>, (Convergence), Westport, CT/London:\nPraeger.</li>\n<li>–––, 1995, “Language and Nature”,\n<em>Mind</em>, 104(413): 1–61. doi:10.1093/mind/104.413.1</li>\n<li>–––, 2000, <em>New Horizons in the Study of\nLanguage and Mind</em>, Cambridge/New York: Cambridge University\nPress. doi:10.1017/CBO9780511811937</li>\n<li>Chomsky, Noam, 2013, “Notes on Denotation and\nDenoting”, in Ivano Caponigro and Carlo Cecchetto <em>From\nGrammar to Meaning. The Sponaneous Logicality of Language</em>,\n38–46. Cambride: Cambridge University Press.</li>\n<li>Cinque, Guglielmo and Luigi Rizzi, 2010, “The Cartography of\nSyntactic Structures”, in <em>The Oxford Handbook of Linguistic\nAnalysis</em>, Bernd Heine and Heiko Narrog (eds.), (Oxford Handbooks\nin Linguistics), Oxford/New York: Oxford University Press,\n51–65. doi:10.1093/oxfordhb/9780199544004.013.0003</li>\n<li>Copley, Bridget and Heidi Harley, 2015, “A Force-Theoretic\nFramework for Event Structure”, <em>Linguistics and\nPhilosophy</em>, 38(2): 103–158.\ndoi:10.1007/s10988-015-9168-x</li>\n<li>Cresswell, M. J., 1986, “Why Objects Exist but Events\nOccur”, <em>Studia Logica</em>, 45(4): 371–375.\ndoi:10.1007/BF00370270</li>\n<li>Davidson, Donald, 1967, “The Logical Form of Action\nSentences”, in <em>The Logic of Decision and Action</em>,\nNicholas Rescher (ed.), Pittsburgh, PA: University of Pittsburgh\nPress, 81–95.</li>\n<li>Doetjes, Jenny, 2012, “Count/Mass Distinctions across\nLanguages”, in <em>Semantics: An International Handbook of\nNatural Language Meaning, Volume 3</em>, Claudia Maienborn, Klaus von\nHeusinger, and Paul Portner (eds.), Berlin/Boston: De Gruyter,\n2559–2580. doi:10.1515/9783110253382.2559</li>\n<li>Edelberg, Walter, 1986, “A New Puzzle about Intentional\nIdentity”, <em>Journal of Philosophical Logic</em>, 15(1):\n1–25. doi:10.1007/BF00250547</li>\n<li>Eklund, Matti, 2008, “The Picture of Reality as an Amorphous\nLump”, in <em>Contemporary Debates in Metaphysics</em>, Theodore\nSider, John Hawthorne, and Dean W. Zimmerman (eds.), Malden, MA:\nBlackwell, 382–396.</li>\n<li>Elbourne, Paul D., 2005, <em>Situations and Individuals</em>,\n(Current Studies in Linguistics 41), Cambridge, MA: MIT Press.</li>\n<li>Fine, Kit, 1982, “The Problem of Non-Existents: I.\nInternalism”, <em>Topoi</em>, 1(1–2): 97–140.\ndoi:10.1007/BF00157548</li>\n<li>–––, 1999, “Things and Their Parts”,\n<em>Midwest Studies in Philosophy</em>, 23(1): 61–74.\ndoi:10.1111/1475-4975.00004</li>\n<li>–––, 2003, “The Non-Identity of a Material\nThing and Its Matter”, <em>Mind</em>, 112(446): 195–234.\ndoi:10.1093/mind/112.446.195</li>\n<li>–––, 2006, “In Defense of\nThree-Dimensionalism”, <em>Journal of Philosophy</em>, 103(12):\n699–714. doi:10.5840/jphil2006103126</li>\n<li>–––, 2017a, “Naive Metaphysics”,\n<em>Philosophical Issues</em>, 27(1): 98–113.\ndoi:10.1111/phis.12092</li>\n<li>–––, 2017b, “Truthmaker Semantics”,\nin <em>A Companion to the Philosophy of Language</em>, Bob Hale,\nCrispin Wright, and Alexander Miller (eds.), second edition,\nChichester, UK: Wiley Blackwell, II:556–577.\ndoi:10.1002/9781118972090.ch22</li>\n<li>Fiorin, Gaetano and Denis Delfitto, 2020, <em>Beyond Meaning: A\nJourney Across Language, Perception and Experience</em>, (Perspectives\nin Pragmatics, Philosophy &amp; Psychology 25), Cham: Springer\nInternational Publishing. doi:10.1007/978-3-030-46317-5</li>\n<li>Frege, Gottlob, 1884, <em>Die Grundlagen der Arithmetik</em>\n(<em>Foundations of Arithmetic</em>), Breslau: Verlage Wilhelm\nKoebner.</li>\n<li>–––, 1892, “Funktion und Begriff”,\nJena: Hermann Pohle. Reprinted in his <em>Funktion, Begriff,\nBedeutung: Fünf Logische Studien</em>, Günther Patzig (ed.),\n(Kleine Vandenhoeck-Reihe 144/145), Göttingen: Vandenhoeck &amp;\nRuprecht, 1962. Translated as “Function and Concept” by P.\nGeach in <em>Translations from the Philosophical Writings of Gottlob\nFrege</em>, P. Geach and M. Black (eds. and trans.), 1980, Oxford:\nBlackwell, pp. 21–41.</li>\n<li>–––, 1918/19, “Der Gedanke. Eine Logische\nUntersuchung”, <em>Beiträge zur Philosophie des deutschen\nIdealismus</em>, 1: 58–77. Translated by P. Geach and R.\nStoothoff as “Thoughts” in Frege’s <em>Collected\nPapers on Mathematics, Logic, and Philosophy</em>, Brian McGuinness\n(ed.), Oxford: Blackwell, 1984, pp. 351–372.</li>\n<li>Gil, David, 2000, “Syntactic Categories, Cross-Linguistic\nVariation and Universal Grammar”, in <em>Approaches to the\nTypology of Word Classes</em>, Petra M. Vogel and Bernard Comrie\n(eds.), (Empirical Approaches to Language Typology 23), New York: De\nGruyter Mouton, 173–216. doi:10.1515/9783110806120.173</li>\n<li>Grosu, Alexander and Manfred Krifka, 2007, “<em>The Gifted\nMathematician That You Claim to Be</em>: Equational Intensional\n‘Reconstruction’ Relatives”, <em>Linguistics and\nPhilosophy</em>, 30(4): 445–485.\ndoi:10.1007/s10988-008-9022-5</li>\n<li>Hacker, P. M. S., 1982, “Events, Ontology and\nGrammar”, <em>Philosophy</em>, 57(222): 477–486.\ndoi:10.1017/S0031819100056102</li>\n<li>Hale, Bob, 1987, <em>Abstract Objects</em>, (Philosophical\nTheory), Oxford/New York: B. Blackwell.</li>\n<li>Hale, Kenneth L. and Samuel Jay Keyser, 2002, <em>Prolegomenon to\na Theory of Argument Structure</em>, (Linguistic Inquiry Monographs\n39), Cambridge, MA: MIT Press.</li>\n<li>Halle, Morris and Alec Marantz, 1993, “Distributive\nMorphology and the Pieces of Inflection”, in <em>The View from\nBuilding 20: Essays in Linguistics in Honor of Sylvain\nBromberger</em>, Kenneth L. Hale, Samuel Jay Keyser, and Sylvain\nBromberger (eds.), (Current Studies in Linguistics 24), Cambridge,\nMass: MIT Press, 111–176.</li>\n<li>Harves, Stephanie and Richard S. Kayne, 2012, “Having\n‘Need’ and Needing ‘Have’”,\n<em>Linguistic Inquiry</em>, 43(1): 120–132.\ndoi:10.1162/LING_a_00076</li>\n<li>Hespos, Susan J. and Elizabeth S. Spelke, 2004, “Conceptual\nPrecursors to Language”, <em>Nature</em>, 430(6998):\n453–456. doi:10.1038/nature02634</li>\n<li>Hinzen, Wolfram and Martina Wiltschko, forthcoming, “The\nGrammar of Truth”, <em>Inquiry</em>, first online: 29 October\n2018, 33 pages. doi:10.1080/0020174X.2018.1532691</li>\n<li>Hofweber, Thomas, 2016, <em>Ontology and the Ambitions of\nMetaphysics</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780198769835.001.0001</li>\n<li>Karttunen, Lauri, 1976, “Discourse Referents”, in\n<em>Notes from the Linguistic Underground</em>, James D. McCawley\n(ed.), (Syntax and Semantics 7), New York: Academic Press,\n363–386.</li>\n<li>Kayne, Richard S., 2005, <em>Movement and Silence</em>, (Oxford\nStudies in Comparative Syntax), New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780195179163.001.0001</li>\n<li>Kennedy, Christopher, 2007, “Vagueness and Grammar: The\nSemantics of Relative and Absolute Gradable Adjectives”,\n<em>Linguistics and Philosophy</em>, 30(1): 1–45.\ndoi:10.1007/s10988-006-9008-0</li>\n<li>Kim, Jaegwon, 1976, “Events as Property\nExemplifications”, in <em>Action Theory</em>, Myles Brand and\nDouglas Walton (eds.), Dordrecht: Reidel, 159–177.\ndoi:10.1007/978-94-010-9074-2_9</li>\n<li>Kripke, Saul A., 2013, <em>Reference and Existence: The John Locke\nLectures</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199928385.001.0001</li>\n<li>Landman, Fred, 1986, “Pegs and Alecs”, in his\n<em>Towards a Theory of Information: The Status of Partial Objects in\nSemantics</em>, (GRASS 6), Dordrecht: Foris, 97–155.</li>\n<li>Laycock, Henry, 2006, <em>Words without Objects: Semantics,\nOntology, and Logic for Non-Singularity</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/0199281718.001.0001</li>\n<li>Liebesman, David and Ofra Magidor, 2017, “Copredication and\nProperty Inheritance: Copredication and Property Inheritance”,\n<em>Philosophical Issues</em>, 27(1): 131–166.\ndoi:10.1111/phis.12104</li>\n<li>Liebesman, David 2015, “Predication as Ascription”,\n<em>Mind</em>, 124(494): 217–569. doi:10.1093/fzu182</li>\n<li>Link, Godehard, 1983, “The Logical Analysis of Plurals and\nMass Nouns”, in <em>Meaning, Use, and Interpretation of\nLanguage</em>, Rainer Bäeuerle, Christoph Schwarze, and Arnim von\nStechow (eds.), Berlin/New York: De Gruyter, 302–323.</li>\n<li>Lowe, E. J., 2006, <em>The Four-Category Ontology: A Metaphysical\nFoundation for Natural Science</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199254397.001.0001</li>\n<li>Ludlow, Peter, 1999, <em>Semantics, Tense, and Time: An Essay in\nthe Metaphysics of Natural Language</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Magidor, Ofra, 2013, <em>Category Mistakes</em>, (Oxford\nPhilosophical Monographs), Oxford/New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199572977.001.0001</li>\n<li>Maienborn, Claudia, 2007, “On Davidsonian and Kimian\nStates”, in <em>Existence: Semantics and Syntax</em>, Ileana\nComorovski and Klaus von Heusinger (eds.), (Studies in Linguistics and\nPhilosophy 84), Dordrecht: Springer Netherlands, 107–130.\ndoi:10.1007/978-1-4020-6197-4_4</li>\n<li>McGinn, Colin, 2000, <em>Logical Properties: Identity, Existence,\nPredication, Necessity, Truth</em>, Oxford: Clarendon Press.\ndoi:10.1093/0199241813.001.0001</li>\n<li>McKay, Thomas J., 2006, <em>Plural Predication</em>, Oxford:\nClarendon Press. doi:10.1093/acprof:oso/9780199278145.001.0001</li>\n<li>–––, 2016, “Mass and Plural”, in\n<em>Unity and Plurality: Logic, Philosophy, and Linguistics</em>,\nMassimiliano Carrara, Alexandra Arapinis, and Friederike Moltmann\n(eds.), Oxford: Oxford University Press, 171–193.\ndoi:10.1093/acprof:oso/9780198716327.003.0008</li>\n<li>Moltmann, Friederike, 1997, <em>Parts and Wholes in\nSemantics</em>, New York: Oxford University Press.</li>\n<li>–––, 2013, <em>Abstract Objects and the\nSemantics of Natural Language</em>, Oxford/New York: Oxford University\nPress. doi:10.1093/acprof:oso/9780199608744.001.0001</li>\n<li>–––, 2015, “Quantification with\nIntentional and with Intensional Verbs”, in <em>Quantifiers,\nQuantifiers, and Quantifiers: Themes in Logic, Metaphysics, and\nLanguage</em>, Alessandro Torza (ed.), (Synthese Library 373), Cham:\nSpringer International Publishing, 141–168.\ndoi:10.1007/978-3-319-18362-6_8</li>\n<li>–––, 2016, “Quantification with\nIntentional and with Intensional Verbs,” in A. Torza (ed.),\n<em>Quantifiers, Quantifiers, Quantifiers</em>, Dordrecht: Springer,\nSynthese Library, pp. 141–168.</li>\n<li>–––, 2019, “Natural Language and Its\nOntology”, in <em>Metaphysics and Cognitive Science</em>, Alvin\nI. Goldman and Brian P. McLaughlin (eds.), Oxford: Oxford University\nPress, 206–232. doi:10.1093/oso/9780190639679.003.0009</li>\n<li>–––, 2020a, “Natural Language\nOntology”, in <em>The Routledge Handbook of Metametaphyics</em>,\nRicki Bliss and J. T. M. Miller (eds.), New York: Routledge, ch.\n25.</li>\n<li>–––, 2020b, “Existence Predicates”,\n<em>Synthese</em>, 197(1): 311–335.\ndoi:10.1007/s11229-018-1847-z</li>\n<li>–––, 2020c, “Abstract Objects and the\nCore-Periphery Distinction in the Ontological and the Conceptual\nDomain of Natural Language”, in <em>Abstract Objects: For and\nAgainst</em>, José L. Falguera and Concha Martínez-Vidal\n(eds.), (Synthese Library 422), Cham: Springer International\nPublishing, 255–276. doi:10.1007/978-3-030-38242-1_13</li>\n<li>–––, 2021a, “Situations, Alternatives, and\nthe Semantics of ‘Cases’”, <em>Linguistics and\nPhilosophy</em>, 44(1): 153–193.\ndoi:10.1007/s10988-019-09282-7</li>\n<li>–––, 2021b, “Truth Predicates, Truth\nBearers, and Their Variants”, <em>Synthese</em>, 198(S2):\n689–716. doi:10.1007/s11229-018-1814-8</li>\n<li>Montague, Richard, 1974, <em>Formal Philosophy: Selected Papers of\nRichard Montague</em>, Richmond H. Thomason (ed.), New Haven, CT: Yale\nUniversity Press.</li>\n<li>Ojeda, Almerindo E., 1993, <em>Linguistic Individuals</em>, (CSLI\nLecture Notes 31), Stanford, CA: CSLI Publications.</li>\n<li>Oliver, Alex and Timothy Smiley, 2013, <em>Plural Logic</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199570423.001.0001</li>\n<li>Parsons, Terence, 1980, <em>Nonexistent Objects</em>, New Haven,\nCT: Yale University Press.</li>\n<li>Pelletier, Jeffry, 2011, “Descriptive Metaphysics, Natural\nLanguage Metaphysics, Sapir-Whorf, and All That Stuff”,\n<em>Baltic International Yearbook of Cognition, Language, and\nCommunication</em> 6.</li>\n<li>Pelletier, Jeffry, and Leonard Schubert 1989/2003, “Mass\nExpressions”, in Franz Guenthner and Dov Gabbay (eds.),\n<em>Handbook of Philosophical Logic</em> 2nd edition, vol. 10,\n249–336; updated version of the 1989 version in the 1st edition\nof <em>Handbook of Philosophical Logic</em>.</li>\n<li>Perry, John, 1986, “Thought without Representation”,\n<em>Aristotelian Society Supplementary Volume</em>, 60: 137–151.\ndoi:10.1093/aristoteliansupp/60.1.137</li>\n<li>Pietroski, Paul M., 2018, <em>Conjoining Meanings: Semantics\nwithout Truth Values</em>, (Context and Content), Oxford: Oxford\nUniversity Press. doi:10.1093/oso/9780198812722.001.0001</li>\n<li>Pinker, Steven, 1994, <em>The Language Instinct</em>, New York: W.\nMorrow and Co.</li>\n<li>Postal, Paul M., 2018, “The Ontology of Natural\nLanguage”, in <em>Essays on Linguistic Realism</em>, Christina\nBehme and Martin Neef (eds.), (Studies in Language Companion Series\n196), Amsterdam/Philadelphia: John Benjamins Publishing Company,\n1–6.</li>\n<li>Priest, Graham, 2015, <em>Towards Nonbeing. The Logic and\nMetaphysics of Intentionality</em>, Oxford: Oxford University\nPress.</li>\n<li>Pustejovsky, James, 1995, <em>The Generative Lexicon</em>,\nCambridge: MIT Press.</li>\n<li>Quine, W. V., 1948, “On What There Is”, <em>The Review\nof Metaphysics</em>, 2(5): 21–38. Reprinted in his <em>From a\nLogical Point of View</em>, Cambridge, MA: Harvard University Press,\n1953, 1–19.</li>\n<li>Ramchand, Gilllian, 2018, <em>Situations and Syntactic\nStructures</em>, Cambridge: MIT Press.</li>\n<li>Récanati, François, 2010, <em>Truth-Conditional\nPragmatics</em>, Oxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199226993.001.0001</li>\n<li>Romero, Maribel, 2005, “Concealed Questions and\nSpecificational Subjects”, <em>Linguistics and Philosophy</em>,\n28(6): 687–737. doi:10.1007/s10988-005-2654-9</li>\n<li>Rose, David and Jonathan Schaffer, 2017, “Folk Mereology Is\nTeleological”, <em>Noûs</em>, 51(2): 238–270.\ndoi:10.1111/nous.12123</li>\n<li>Rosefeldt, Tobias, 2008, “‘That’-Clauses and\nNon-Nominal Quantification”, <em>Philosophical Studies</em>,\n137(3): 301–333. doi:10.1007/s11098-006-0002-8</li>\n<li>Rothstein, Susan, 2017, <em>Semantics for Counting ad\nMeasuring</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/978051.173.4830</li>\n<li>Sainsbury, R. M., 2005, <em>Reference without Referents</em>,\nOxford: Clarendon Press. doi:10.1093/0199241805.001.0001</li>\n<li>Salmon, Nathan, 1987, “Existence”, <em>Philosophical\nPerspectives</em>, 1: 49–108. doi:10.2307/2214143</li>\n<li>–––, 1998, “Nonexistence”,\n<em>Noûs</em>, 32(3): 277–319.\ndoi:10.1111/0029-4624.00101</li>\n<li>Schaffer, Jonathan, 2019, “Cognitive Science and\nMetaphysics: Partners in Debunking”, in <em>Metaphysics and\nCognitive Science</em>, Alvin I. Godman and Brian P. McLaughlin\n(eds.), Oxford: Oxford University Press, 38–70.\ndoi:10.1093/oso/9780190639679.003.0003</li>\n<li>Schaffer, Jonathan, 2019, “What grounds What”, in\n<em>Metametaphysics</em>, David Chalmers, David Manley, and Ryan\nWasserman (eds.), Oxford: Oxford University Press, 347–383.\ndoi:10.1093/oso/9780190639679.003.0003</li>\n<li>Schiffer, Stephen, 1996, “Language-Created\nLanguage-Independent Entities”:, <em>Philosophical Topics</em>,\n24(1): 149–167. doi:10.5840/philtopics199624117</li>\n<li>Simons, Peter, 1987, <em>Parts: A Study in Ontology</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780199241460.001.0001</li>\n<li>Stephenson, Tamina, 2007, “Judge Dependence, Epistemic\nModals, and Predicates of Personal Taste”, <em>Linguistics and\nPhilosophy</em>, 30(4): 487–525.\ndoi:10.1007/s10988-008-9023-4</li>\n<li>Strawson, P.F., 1950, “Truth”, <em>Aristotelian\nSociety Supplementary Volume</em>, 24(1): 111–172. Reprinted in\nhis <em>Logico-Linguistic Papers</em>, London: Methuen, 1971, pp.\n190–213. doi:10.1093/aristoteliansupp/24.1.111</li>\n<li>–––, 1959, <em>Individuals: An Essay in\nDescriptive Metaphysics</em>, London: Methuen.</li>\n<li>Swanson, Eric, 2012, “The Language of Causation,” in\n<em>The Routledge Companion to Philosophy of Language</em>, Gillian\nRussell and Delia Graff Fara (eds), New York/London: Routledge,\n716–728 (6.3.1).</li>\n<li>Szabó, Zoltán Gendler, 2006, “Counting across\nTimes”, <em>Philosophical Perspectives</em>, 20(1):\n399–426. doi:10.1111/j.1520-8583.2006.00113.x</li>\n<li>–––, 2015, “Major Parts of Speech”,\n<em>Erkenntnis</em>, 80(S1): 3–29.\ndoi:10.1007/s10670-014-9658-1</li>\n<li>Thomasson, Amie L., 1999, <em>Fiction and Metaphysics</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511527463</li>\n<li>Twardowski, Kazimierz, 1911, “O czynnościach i\nwytworach. Kilka uwag z pogranicza psychologii, gramatyki i\nlogiki”, Lwdw: Uniwersytetu Lwowskiego. Translated as\n“Actions and Products. Some Remarks from the Borderline of\nPsychology, Grammar and Logic”, in <em>Kazimierz Twardowski. On\nActions, Products and Other Topics in the Philosophy</em>, Johannes L.\nBrandl and Jan Woleński (eds.) and Arthur Szylewicz (trans.),\nAmsterdam/Atlanta: Rodopi, 1999, 103–132.</li>\n<li>Van Inwagen, Peter, 1977, “Creatures of Fiction”,\n<em>American Philosophical Quarterly</em>, 14(4): 299–308.</li>\n<li>–––, 2003, “Existence, Ontological\nCommitment, and Fictional Entities”, in <em>The Oxford Handbook\nof Metaphysics</em>, Michael J. Loux and Dean W. Zimmerman (eds.),\nOxford: Oxford University Press, 131–158.\ndoi:10.1093/oxfordhb/9780199284221.003.0006</li>\n<li>Vendler, Zeno, 1967, <em>Linguistics in Philosophy</em>, Ithaca,\nNY: Cornell University Press.</li>\n<li>–––, 1972, <em>Res Cogitans: An Essay in\nRational Psychology</em>, (Contemporary Philosophy), Ithaca, NY:\nCornell University Press.</li>\n<li>Vieu, Laure, 2006, “On the Transitivity of Functional\nParthood”, <em>Applied Ontology</em>, 1(2): 147–155.</li>\n<li>Wellwood, Alexis, 2015, “On the Semantics of Comparison\nacross Categories”, <em>Linguistics and Philosophy</em>, 38(1):\n67–101. doi:10.1007/s10988-015-9165-0</li>\n<li>Wellwood, Alexis, Valentine Hacquard, and Roumyana Pancheva, 2012,\n“Measuring and Comparing Individuals and Events”,\n<em>Journal of Semantics</em>, 29(2): 207–228.\ndoi:10.1093/jos/ffr006</li>\n<li>Wetzel, Linda, 2009, <em>Types and Tokens: On Abstract\nObjects</em>, Cambridge, MA: MIT Press.</li>\n<li>Williams, Donald C., 1953, “On the Eelements of\nBeing”, <em>The Review of Metaphysics</em>, 7: 3–18 (Part\nI), 171–192 (Part II).</li>\n<li>Wisniewski, Edward J., Mutsumi Imai, and Lyman Casey, 1996,\n“On the Equivalence of Superordinate Concepts”,\n<em>Cognition</em>, 60(3): 269–298.\ndoi:10.1016/0010-0277(96)00707-X</li>\n<li>Wolterstorff, Nicholas, 1970, <em>On Universals: An Essay in\nOntology</em>, Chicago: University of Chicago Press.</li>\n<li>Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, (Scots Philosophical Monographs 2), Aberdeen: Aberdeen\nUniversity Press.</li>\n<li>Yi, Byeong-Uk, 2005, “The Logic and Meaning of Plurals. Part\nI”, <em>Journal of Philosophical Logic</em>, 34(5–6):\n459–506. doi:10.1007/s10992-005-0560-9</li>\n<li>–––, 2006, “The Logic and Meaning of\nPlurals. Part II”, <em>Journal of Philosophical Logic</em>,\n35(3): 239–288. doi:10.1007/s10992-005-9015-6</li>\n<li>Zalta, Edward N., 1983, <em>Abstract Objects: An Introduction to\nAxiomatic Metaphysics</em>, (Synthese Library 160), Dordrecht: D.\nReidel.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "anaphora",
            "Aristotle",
            "Aristotle, General Topics: categories",
            "bias, implicit",
            "category mistakes",
            "compositionality",
            "Davidson, Donald",
            "dependence, ontological",
            "events",
            "existence",
            "experimental philosophy",
            "fiction: fictional entities",
            "Frege, Gottlob",
            "fundamentality",
            "grounding, metaphysical",
            "identity: over time",
            "intuition",
            "linguistics: philosophy of",
            "mass expressions: metaphysics of",
            "meaning, theories of",
            "mereology",
            "metaphysics",
            "nominalism: in metaphysics",
            "nonexistent objects",
            "object",
            "ontological commitment",
            "plural quantification",
            "possible objects",
            "possible worlds",
            "semantics: dynamic",
            "semantics: Montague",
            "situations: in natural language semantics",
            "states of affairs",
            "Strawson, Peter Frederick",
            "tropes",
            "Twardowski, Kazimierz"
        ],
        "entry_link": [
            {
                "../anaphora/": "anaphora"
            },
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-categories/": "Aristotle, General Topics: categories"
            },
            {
                "../implicit-bias/": "bias, implicit"
            },
            {
                "../category-mistakes/": "category mistakes"
            },
            {
                "../compositionality/": "compositionality"
            },
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../dependence-ontological/": "dependence, ontological"
            },
            {
                "../events/": "events"
            },
            {
                "../existence/": "existence"
            },
            {
                "../experimental-philosophy/": "experimental philosophy"
            },
            {
                "../fictional-entities/": "fiction: fictional entities"
            },
            {
                "../frege/": "Frege, Gottlob"
            },
            {
                "../fundamentality/": "fundamentality"
            },
            {
                "../grounding/": "grounding, metaphysical"
            },
            {
                "../identity-time/": "identity: over time"
            },
            {
                "../intuition/": "intuition"
            },
            {
                "../linguistics/": "linguistics: philosophy of"
            },
            {
                "../metaphysics-massexpress/": "mass expressions: metaphysics of"
            },
            {
                "../meaning/": "meaning, theories of"
            },
            {
                "../mereology/": "mereology"
            },
            {
                "../metaphysics/": "metaphysics"
            },
            {
                "../nominalism-metaphysics/": "nominalism: in metaphysics"
            },
            {
                "../nonexistent-objects/": "nonexistent objects"
            },
            {
                "../object/": "object"
            },
            {
                "../ontological-commitment/": "ontological commitment"
            },
            {
                "../plural-quant/": "plural quantification"
            },
            {
                "../possible-objects/": "possible objects"
            },
            {
                "../possible-worlds/": "possible worlds"
            },
            {
                "../dynamic-semantics/": "semantics: dynamic"
            },
            {
                "../montague-semantics/": "semantics: Montague"
            },
            {
                "../situations-semantics/": "situations: in natural language semantics"
            },
            {
                "../states-of-affairs/": "states of affairs"
            },
            {
                "../strawson/": "Strawson, Peter Frederick"
            },
            {
                "../tropes/": "tropes"
            },
            {
                "../twardowski/": "Twardowski, Kazimierz"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=natural-language-ontology\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/natural-language-ontology/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=natural-language-ontology&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/natural-language-ontology/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=natural-language-ontology": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/natural-language-ontology/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=natural-language-ontology&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/natural-language-ontology/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}