{
    "url": "neurath",
    "title": "Otto Neurath",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Jordi Cat\n<jcat@indiana.edu>",
        "author_links": [
            {
                "mailto:jcat%40indiana%2eedu": "jcat@indiana.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nJordi Cat\n&lt;<a href=\"mailto:jcat%40indiana%2eedu\"><em>jcat<abbr title=\" at \">@</abbr>indiana<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sun Aug 15, 2010",
        "substantive revision Wed Aug 28, 2019"
    ],
    "preamble": "\n\nNeurath was a social scientist, scientific philosopher and maverick\nleader of the Vienna Circle who championed ‘the scientific\nattitude’ and the Unity of Science movement. He denied any value\nto philosophy over and above the pursuit of work on science, within\nscience and for science. And science was not logically fixed, securely\nfounded on experience nor was it the purveyor of any System of\nknowledge. Uncertainty, decision and cooperation were intrinsic to it.\nFrom this naturalistic, holistic and pragmatist viewpoint, philosophy\ninvestigates the conditions of the possibility of science as apparent\nin science itself, namely, in terms of physical, biological, social,\npsychological, linguistic, logical, mathematical, etc. conditions. His\nviews on the language, method and unity of science were led throughout\nby his interest in the social life of individuals and their\nwell-being. To theorize about society is inseparable from theorizing\nfor and within society. Science is in every sense a social and\nhistorical enterprise. It is as much about social objectives as it is\nabout physical objects, and about social realizations as much as about\nempirical reality. Objectivity and rationality, epistemic values to\nconstrain scientific thought, were radically social. The topics of\npolitical economy and visual education, based on the ISOTYPE language,\nare concrete legacies that have regained relevance, urgency and\ninterest. These are discussed in the supplements,\n Political Economy\n and\n Visual Education.\n",
    "toc": [
        {
            "#BioSke": "1. Biographical sketch"
        },
        {
            "#EcoTheSciEpi": "2. From economic theory to scientific epistemology"
        },
        {
            "#NeuPlaLogEmpPhyAntFouHolNatExtPra": "3. Neurath’s place in logical empiricism: physicalism, anti-foundationalism, holism, naturalism, externalism, pragmatism"
        },
        {
            "#UniSciEncMod": "4. Unity of Science and the Encyclopedia Model"
        },
        {
            "#PsyEduSocSci": "5. Philosophy of psychology, education, and the social sciences"
        },
        {
            "#Psy": "5.1 Philosophy of psychology"
        },
        {
            "#Edu": "5.2 Philosophy of education"
        },
        {
            "#SocSci": "5.3 Philosophy of the social sciences"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Biographical sketch\n\nOtto Neurath was born on 10 December 1882 in Vienna. He was the son of\nGertrud Kaempffert and Wilhelm Neurath, a Hungarian Jewish political\neconomist and social reformer, and was born Roman Catholic. Initially\nstudying in Vienna philosophy, mathematics and physics and then\nhistory, philosophy and economics (he formally enrolled for classes at\nthe University of Vienna only for two semesters in 1902-3), he\nfollowed the social scientist Ferdinand Tönnies’s advice to\nmove to Berlin, where he received a doctoral degree in history of\neconomics in 1906. He studied under Eduard Meyer and Gustav Schmoller\nand he was awarded the degree for two studies of economic history of\nantiquity, one on Cicero’s De Officiis and the other\nwith an emphasis on the non-monetary economy of Egypt. In his\nbiographical précis at the end his doctoral dissertation on\nCicero, he mentioned having studied mathematics, natural science and\nphilosophy in Vienna with von Escherich, Haberda, Haffner, Hartl,\nJodl, Kohn, Kretschmer, von Lang, Lieben, Mertens, Müch,\nMüllner, Oberhummer, Penck, Schindler and von Schroeder, and that\nin Berlin, he studied national economy, history and philosophy with\nvon Bortkiewicz, Breysig, Brunner, Eberstadt, Hintze, Jastrow, Landau,\nMenzer, Meyer, Paulsen, Schmoller, Simmel, and Wagner. He also\nacknowledged that he had studied the ideas of the logician Gregor\nItelson, Wilhelm Neurath’s colleague and mathematician Oskar\nSimony, and the social scientist Ferdinand Tönnies.\n\nHis first publications were in logic, a subject he had formally\nlearned at the University of Vienna from Laurenz Müllner and\npossibly Friedrich Jodl, and in the history of political economy, on\nwhich his father had also written. The papers on logic (see below)\nexamined different kinds of identities and the principle of duality\nstimulated by Schröder; they included one paper co-authored with\nhis friend and second wife, Olga Hahn, sister of the mathematician\nHans Hahn. In the history of political economy, topics included the\nhistory of money and economic organizations in antiquity, and his\npublications included textbooks and readers either co-authored or\nco-edited with his first wife Anna Schapire-Neurath. Not surprisingly,\nhis subsequent theorizing on the social sciences and his contributions\nto debates in logical empiricism integrated both disciplines. With the\nmathematician Hans Hahn and the physicist Philip Frank, around 1910\nNeurath formed in Vienna a philosophical discussion group devoted to\nthe philosophical ideas about science of Vienna’s\nphenomenologist Ernst Mach and the French conventionalists Pierre\nDuhem, Abel Rey and Henri Poincaré. A great deal of\nphilosophical and scientific concerns and insight were already in\nplace in Neurath’s thinking and projects. With a grant from the\nCarnegie Endowment for International Peace, a subsequent study of the\nBalkan wars before World War I led to his theory of war economy as a\nnatural (non-monetary) economy, or economy in kind.\n\nIn 1919 the short-lived Bavarian socialist government (November\n1918-April 1919) appointed him head of the Central Planning Office.\nThe fall of the subsequent Bavarian Soviet Republic in May 1919 got\nhim expelled from his junior post teaching economic theory at\nHeidelberg University, where he had received his Habilitation\nin 1917. His program for full socialization was inspired by his\nstudies of war economics and based on his theory of natural economy\nand a holistic requirement to bring different institutions and kinds\nof knowledge together in order to understand, predict and control the\ncomplex phenomena of the social world. From 1921 until 1934 Neurath\nparticipated actively in the development of Vienna’s socialist\npolitics, especially in housing and adult education (on his political\nlife, see Sandner 2014). He established the Social and Economic Museum\nof Vienna, where he developed and applied the ‘Vienna\nmethod’ of picture statistics and the ISOTYPE language\n(International System of Typographic Picture Education) (see the\nsupplementary document on\n Visual Education).\n Like the thought of other Viennese philosophers such as Wittgenstein\nand Popper, Neurath’s philosophy was inextricably linked to\npedagogical theory, critique of language and, in Popper’s case,\npolitical thought. In 1928, with members of the Austrian Freethinkers\nAssociation and the Vienna City Council and the scientifically-trained\nmembers of the informal circle around the current holder of\nMach’s University Chair, the philosopher Moritz Schlick\n(1924-29), Neurath helped found the Verein Ernst Mach, the\nErnst Mach Association for the Promotion of Science Education. The\npublication in 1929 of an intellectual manifesto gave way to the\nformation of the Vienna Circle, whose narrower goal was the\narticulation and promotion of a scientific world-conception and\nlogical empiricism (on the Viennese intellectual landscape, see\nStadler 2001).\n\nSubsequently, when in 1934 the Austrian government allied itself with\nthe Nazi government in Germany, Neurath fled to the Netherlands. As a\nresult, his local, Viennese, socialist Enlightenment project turned\ninto an internationalist, intellectual and social-political project.\nHe created the International Foundation for Visual Education in The\nHague, with his assistants from Vienna, and spearheaded the\nInternational Unity of Science movement. The latter, inspired by a\ntradition culminating in the Enlightenment’s French\nEncyclopedists, launched the project of an Encyclopedia of Unified\nScience. Together with the pictorial languages, the scientific\nencyclopedia would promote scientific and social cooperation and\nprogress at an international level. After Austria became part of the\nGerman Reich in 1938, even though living in the Netherlands, Neurath\nwas considered a German citizen and a ‘half-Jew’ and he\nwas not allowed to marry his ‘Aryan’ assistant Marie\nReidemeister—after his second wife, Olga, had died in 1937.\nDuring this period, he travelled abroad, including the United States,\nwhere logical empiricism had become entangled with the Cold War\npolitical and intellectual debates and witch hunts (on the Cold War\nphase, see Reich 2005). Carnap and Charles Morris at the University of\nChicago acted as his co-editors of the International Encyclopedia of\nUnified Science. New York leftist intellectuals hosted him as an\nintellectual and political ally. And his maternal first cousin\nWaldemar Kaempffert, influential editor for The New York\nTimes and Popular Science, introduced him as an\ninternational reformer and visionary, praising his science-oriented\nintellectual, social and educational ideas, especially his\ncontribution to unity of science and visual language (see Reisch\n2019). After the Nazi invasion of the Netherlands in 1940, Otto\nNeurath and Marie Reidemeister fled to England, on the small\nSeaman’s Hope. After nine months in an internment camp\nthey resumed activities related to the Isotype language and the unity\nof science. He died in Oxford on 22 December 1945 (on activities in\nthe camp see Henning 2019; on activities after see Körber 2019\nand Tuboly 2019).\n2. From economic theory to scientific epistemology\n\nDuring the Vienna Circle years, Neurath introduced in the new context\nviews which he developed and generalized from his earlier social\ntheory, only now in terms of the debates on scientific epistemology\nthat came to characterize logical empiricism: (1) a notion of\ntheorizing in natural and social sciences, including history, based on\nthe exploration of combinatorial possibilities and models; (2) the\nlogical under-determination and conventional and pragmatic aspect of\ndecision-making in the methodology of evaluation and choice of data\nand hypotheses; (3) the social, cooperative dimension of scientific\nresearch (‘the republic of scientists’); and, connectedly,\n(4) an argument for a holistic approach to scientific knowledge in the\nform of unified science as a tool for successful prediction and\nengineering (mechanical, electrical and social) of events and their\nevolution in a world understood as a complex of factors (Cat et\nal. 1991 and 1996)—where an alternative model of\nunification would replace the standard set by the reductive, precise\nand abstract monetary units of the market model (Nemeth 1991).\n\nThis engineering value of unity applied equally to political\ngovernance and scientific action, since both are collective and\npragmatic endeavors. According to Neurath, ‘scientific theories\nare sociological events’ (Neurath 1932a/1983, 88), and, since\n‘our thinking is a tool’, in this case the ‘modern\nscientific world-conception’ aims to ‘create a unified\nscience that can successfully serve all transforming activity’\n(Neurath 1930/1983, 42). In both cases, Neurath noted, ‘common\nplanned action is possible only if the participants make common\npredictions’ and group predictions yield more reliable results;\ntherefore, he concluded, ‘common action presses us toward\nunified science’ (Neurath 1931/1973, 407). Indeed, all along,\nfor Neurath scientific attitude and solidarity (and socialism) go\ntogether (Neurath 1928/1973, 252).\n\nDuring the 1910s Neurath engaged the intellectual issues of holism and\nconventionalism raised both by the models of economies in kind\n—the Balkan war economies and socialization of the Bavarian\neconomy—and by Duhem’s philosophy of scientific testing.\nNot surprisingly, his intellectual attitude led him to the recurrent\ndismissal of the myth of the fundamental epistemological and political\nvalue of isolated statements (hypotheses) and isolated individuals\n(citizens, scholars). The problem of unity of the sciences would\nbecome another problem of coordination and cooperation, social and\nintellectual (see above), of scholars and statements, and Neurath\npresented it in just those terms (Neurath 1936/1983).\n\nNeurath developed and generalized his early practical, theoretical and\nmeta-theoretical concerns about social theory (with his talk of a\n‘universal science’ in 1910, a ‘unified construction\nof economic science’ in 1917 and a ‘unified program’\nfor socialization in 1919) as a philosophy of the human sciences.\nThese included psychology and sociology, which he treated in contrast\nwith the natural sciences. His study of the foundations of the social\nsciences extended to import normative constraints set by logical\nempiricism, e.g., the emphasis on foundations and the logical and\nempiricist considerations with respect to physicalism. This\ncontribution determined his qualifications to ideals of unity of the\nsciences, especially involving the relation between the natural and\nthe human sciences, and to ideals of shared scientific\nmethodology.\n\nThe new framework for philosophy, and meta-theory, was characterized\nby an anti-metaphysical attitude towards linguistic and otherwise\nformal, rather than material, entities. For Neurath, social theory\npoints not only to the contingent historical and social nature of\nlanguage; it also points to a more naturalistic attitude towards\nlanguage—and knowledge—in connection with its social roots\nand uses. As a result, his early considerations of social theory and\nvalues yielded a model of language of theory and observation that were\nmeant to do justice to the social and voluntaristic dimensions of\nunity, rationality, and objectivity in the language and methodology of\nthe sciences. Next, in the rest of this section, I provide details of\nthe connection I have indicated. \n\nIn the early 1930s Neurath would point to weakness and incompleteness\nof the logical and linguistic relations between different kinds of\nscientific statements—mainly due to the unavoidable presence of\nvague cluster-concepts, or congestions (Ballungen). They\nconsisted in linguistic manifestation of the ineliminable social,\neveryday, non-theoretical vague elements of language and of the\nintrinsic complexity of the world discussed in the German metaphysical\nliterature and the later socialist debates (Cat 1995 and Cartwright\net al. 1996). Since then his notion of unity is phrased in\nterms of an anti-reductionistic and\nanti-systematic—anti-axiomatic—‘encyclopedia\nmodel’, by establishing cross-connections among disciplines, as\nin a Crusonian archipelago: a ‘great, rather badly coordinated\nmass of statements’ in which at best ‘systems develop like\nlittle islands, which we must try to enlarge’ (Neurath\n1936/1983, 153).\n\nThe connection between the arguments and positions in 1930s scientific\nepistemology or philosophy of science and the arguments in the debates\nin the history of economics points to a kind of unity and continuity\nin Neurath’s thinking in which specific claims in epistemology\nand social thought are historically as well as conceptually connected.\nThis unity is moreover an instance of Neurath’s persistent\nviews: his pragmatic and conventionalist epistemology and his view of\nthe unity of science.\n\nThe historical and conceptual link is suggested by two elements that\nappear in Neurath’s arguments. One is the notion of control, the\nother is the reference to the scenario illustrated by the fiction of\nRobinson Crusoe. They are both a common feature of discussions of\ncentral planning. In Neurath’s writings on that subject they\nappear together at least once, in 1935 in his essay ‘What is\nMeant by a Rational Economic Theory?’ There, Neurath protests\nthat\n\n\n’quite a few political economists advocate the thesis that a\nRobinson Crusoe—or what amounts to the same thing, a controlled\neconomy—calculates in terms of profits and losses.’\n(Neurath 1935/1987, 95)\n\n\nThe two references appear also in the formulations of his private\nlanguage argument, this time with epistemological meaning. A reference\nto controlling and an indirect mention of Crusoe appear in 1931 in his\nessay ‘Physicalism’ and an explicit reference to Crusoe\nappears in 1932 in ‘On Protocol Statements’. Thus in\n‘Physicalism’ Neurath put the argument as follows:\n\n\nCarnap…distinguished two languages: a\n‘monologizing’ one (phenomenalist) and an\n‘intersubjective’ (physicalist) one. (…) only one\nlanguage comes into question from the start, and that is the\nphysicalist. One can learn the physicalist language from earliest\nchildhood. If someone makes predictions and wants to check them\nhimself, he must count on changes in the system of his senses, he must\nuse clocks and rulers, in short, the person supposedly in isolation\nalready makes use of the ‘intersensual’ and\n‘intersubjective’ language. The forecaster of yesterday\nand the controller of today are, so to speak, two persons. (Neurath\n1931/1983, 54–55)\n\n\nIn ‘On Protocol Statements’ Neurath refers to Robinson\nCrusoe explicitly:\n\n\nThe universal jargon…is the same for the child and for the\nadult. It is the same for a Robinson Crusoe as for a human society. If\nRobinson wants to join what is in a protocol of yesterday with what is\nin his protocol today, that is, if he wants to make use of language at\nall, he must make use of the ‘intersubjective’ language.\nThe Robinson of yesterday and the Robinson of today stand precisely in\nthe same relation in which Robinson stands to Friday…In other\nwords, every language as such is intersubjective. (Neurath 1932b/1983,\n96)\n\n\nObjectivity features prominently in the private language argument.\nBoth Neurath’s argument and Wittgenstein’s earlier one are\nlaid out for the case of an individual epistemic agent understanding\nhimself before he needs to understand others (Uebel 1995b). For both,\nthe constancy and consistency of language use is paramount. It can\nonly be ensured by an intersubjective, that is, objective and social,\nlanguage, namely the language of physicalism, about\n‘spatio-temporal structures’. For Wittgenstein, especially\nin the Philosophical Investigations, the social dimension of\nlanguage is a key element of its extrinsic character and therefore its\nproper justification, the normative condition of possibility and\nintelligibility of success, and likewise for the more general case of\nrule-following. The scope of Neurath’s argument is more\nparticularly directed to the case of scientific language in the\nscientific community.\n\nThe notion of private language argument is typically associated with\nthe later argument by Wittgenstein in Philosophical\nInvestigations to the effect that a private language is logically\nimpossible for an individual to use consistently and for others to\nunderstand. By private language, Wittgenstein means a language with\nwords whose meaning is essentially constituted by and for the inner\nexperience or individual consciousness of a subject. In a previous\nversion from 1929 (see the Bergen electronic edition), Wittgenstein\nrefers to the primacy of our public everyday language about physical\nthings over a language of immediate sensations. In the 1951 version\n(2009, 203, 242ff) such language is impossible to coherently make\nsense of, the language is being shown to be dependent on the public\nsocial institutions of language-games and their rules as embedded in\nactual forms of life. A private language would be a language which\ncould be generated wholly through individual acts of unsharable\nself-consciousness and understood, in principle, only by that\nindividual speaker, by means of his or her self-consciousness. This is\nan incoherent notion. \n\nTo follow a rule privately means to assume that thinking that one is\nfollowing a rule is the same as following it (Philosophical\nInvestigations, art. 202). But this assumption is based on a\nsubjective internal notion of justification, dependent on intrinsic\nindividual consciousness. And this is incorrect. For according to\nWittgenstein ‘justification consists in appealing to something\nindependent’ (ibid., art. 265). The independence is\nprovided by a notion of language use and rule following with\nreference, actual or potential, to membership in a wider external\ncommunity and to intersubjective, that is, public and social,\ninteraction.\n\nFor Wittgenstein as well the external, pragmatic and independent\nnotion of calculation and rule following applies to the circulation of\nmoney as economic practice. In Wittgenstein’s own words:\n\n\nWhy can’t the right hand give my left hand money? My right hand\ncan put it into my left hand. My right hand can write a deed of gift\nand my left hand a receipt. But the further practical consequences\nwould not be those of a gift. When the left hand has taken money from\nthe right, etc., we shall ask, “Well, what of it?”\n(ibid., art. 268)\n\n\nThis intersubjective or objective constraint provides a normative,\neven if conventional, distinction between consistent and inconsistent\nlanguage use, or between correct and incorrect rule following. Kripke\nand David Bloor correctly point out that this condition is not\nincompatible with Robinson Crusoe’s physical isolation (Kripke\n1989, 112, n. 89; Bloor 1997). Now we can see the point of\nKripke’s analogy between the impossibility of a private language\nand the impossibility of central planning. If, as in Mises’s\nargument, an economic agent has no extrinsic range of intersubjective\nand commensurable values—that is, the numerical market prices\nwhich are set independently by others—, then he has no rational\nand objective justification for choosing between alternative courses\nof action. Here exact numerical commensurability and explicit\ncalculation rules are the basis for both objectivity and rationality.\nIn contrast with Kripke’s analogy there is a strong opposing\nanalogy between Neurath’s argument against private language and\nhis defense of central planning. The analogy, as explained in\nconnection with Neurath’s position towards Mises, above, reveals\na common set of values that are coherent yet different from the ones\ninvolved in Mises’s argument.\n\nThe issue of the connection between social models of society and\nscientific methodology might have been encouraged by the social and\npolitical turmoils of the first half of the twentieth century.\nNeurath’s case was not unique. The issue persists in the works\nof Neurath’s contemporaries, the philosophers of science Michael\nPolanyi (1958) and Karl Popper (1950, 1957). Their epistemology of\nscience is also radically social and linked to political and economic\nthought. A recurring thought experiment that provides guidance through\nthese discussions is the story of Robinson Crusoe.\n3. Neurath’s place in logical empiricism: physicalism, anti-foundationalism, holism, naturalism, externalism, pragmatism\n3.1 On Language\n\nNeurath’s later views on the language and method of science\nexpressed his simultaneous response to problems in the social sciences\nand to philosophical issues addressed by the Vienna Circle between\n1928 and 1934 and by Karl Popper. A primary aim of the Vienna Circle\nwas to account for the objectivity and intelligibility of scientific\nmethod and concepts. Their philosophical approach was to adopt what\nthe Circle member Gustav Bergmann called the linguistic turn, namely,\nto investigate the formal or structural, logical and linguistic\nframework of scientific knowledge. The formal approach encompassed\nlogicism and logical analysis as views about the formation and\njustification of theoretical statements. The problem of empiricism\nbecame then the problem of coordination between the formal theoretical\nstructures and the records of observations in such a way that it also\noffered an explication of how scientific knowledge can be formally\nconstructed (especially logic and mathematics), empirically grounded\n(except logic and mathematics), rational and objective.\n\nBesides his own early interest in logic and classical and ancient\nlanguages, the value of attention to language was familiar to Neurath\nfrom the Austrian fin-de-siècle culture of critique of language\n(Janik and Toulmin 1973), his interest (and his first wife’s) in\nliterature, especially in Goethe (Zemplen 2006, see above), the\ninternationalist and utopianists efforts at introducing new universal\nlanguages such as Volapük and Esperanto, the emphasis on signs\nand universal languages – to be known as pasigraphy – in\nthe scholastic and rationalist philosophical traditions, in the\ntraditions of empirical taxonomies and in the interest in universal\nlanguage as instrument of knowledge and social order in the\nEnlightenment, a semiotic tradition in scientific epistemology\nincluding Helmholtz, Mach, Duhem and Peirce (Cat 2019) and the\nsociologist Ferdinand Tönnies’s formal approach to\nsociology and social signs (Tönnies 1899–1900 and\nCartwright et al. 1996, 121–24). The significance of\nthe internationalist and philosophical projects of pasigraphy were\nacknowledged also by Carnap. More “scientific” sources\nwere recent technical developments in logic, philosophy of science and\nthe foundation of mathematics often claiming Leibniz as a precursor\n(Leibniz’s logic and project of a universal characteristic had\nbecome widely recognized by the late nineteenth century (Peckhaus\n2012)). Leading figures in such developments were Frege, Hilbert,\nWhitehead, Russell and Wittgenstein.\n\nDavid Hilbert placed the axiomatic tradition in mathematics on a\nformalist footing by eliminating the requirement of a fixed meaning\nfor primitive terms such as ’points’ and\n’lines’ except holistically and implicitly, in the set of\naxioms or definitions in which they appear. Hilbert extended the\napplication of his program of axiomatics from geometry and arithmetic\nto physics. Gottlob Frege, followed by A.N. Whitehead and Bertrand\nRussell, sought to place mathematics, or at least arithmetic, on firm\nand rational principles of logic, which now included a theory of\nrelations and was to provide a comprehensive and unifying foundation.\nThe reductionist ideal was fatally criticized by Kurt Gödel.\nRussell, having replaced idealist monism with perceptual atomism, next\nput the new logical framework to epistemological use in the scientific\nprogram of logical construction of objects of experience and thought.\nHis student Wittgenstein, in turn, introduced a linguistic philosophy\nthat limited the world to the scope of the application of an ideal\nsymbolic languages, or calculus. As a result, the sole task of\nphilosophy was, according to Wittgenstein, the critique of language in\nthe form of an activity of clarification, without yielding a\ndistinctive philosophical body of knowledge or set of\npropositions.\n\nLooking to the rationalist traditions of Descartes and Leibniz, Jean\nvan Heijenoort and Jaakko Hintikka have distinguished between two views\nof language that are relevant to the new linguistic turn (Mormann\n1999): language as calculus (LC) and language as universal medium\n(LUM). The LC tradition, illustrated by Tarski’s views, aligned\nitself with the Cartesian ideal of a transparent language, with clear\nand distinctive meaning and explicit, mechanical combination and\nrule-following that extended to its use in reasoning. There are many\npossible constructed languages and each is an interpreted calculus\nwith different possible semantics. The LUM tradition adopted the idea\nof a single actual or ideal language and one semantic or\ninterpretation, to be elucidated, with no possibility of representing\nits relation to the world from outside. Views by Frege, who pointed to\nLeibniz on language and reasoning, and Wittgenstein illustrate this\ntradition, which in turn accommodates two versions, a Cartesian one\n(Frege and Russell) and a non-Cartesian one (Wittgenstein).\nCarnap’s conversion to semantics in the early 1930s took him to\nthe LC Cartesian tradition seeking a universal language of rational\nreconstruction he had previously recognized in the language of\nphysics. Neurath, by contrast, modeled his unification of the sciences\nin the LUM tradition, on a universal mixed language he called a\nuniversal jargon, with descriptions of spatio-temporal arrangements\nand connections he called physicalism, historically contingent use of\nvague and ordinary terms (see below). In this context Neurath adopted\na militant syntacticism that opposed Carnap’s defense of\nsemantics as metaphysical (Anderson 2019) and engaged in heated\nterminological disputes that ignored Carnap’s commitment to\nontological neutrality (Carus 2019).\n\nThe Circle’s projects shared the aforementioned focus on\nlanguage and experience. The ‘linguistic turn’, as it is\nknown, was adopted as a philosophical tool in order to explicate the\nrationality and the objectivity—that is,\ninter-subjectivity—and communicability of thought. Lacking the\ntranscendental dimension of Kant’s metaphysical apparatus,\nattention to language extended to non-scientific cases such as\n‘ordinary language philosophy’ in Oxford. In the context\nof logical empiricism, the formal dimension of knowledge was thought\nto be manifest particularly in the exactness of scientific statements.\nFor Schlick, knowledge proper, whether of experience or transcendent\nreality, was such only by virtue of form or\nstructure—‘only structure is knowable’. For Carnap,\nin addition, the formal dimension possessed distinct methodological\nvalues: it served the purpose of logical analysis and rational\nreconstruction of knowledge and helped expose and circumvent\n‘pseudo-philosophical’ problems around metaphysical\nquestions about reality (his objections to Heidegger appealed to\nfailures of proper logical formulation and not just empirical\nverification). In 1934 he proposed as the task of philosophy the\nmetalinguistic analysis of logical and linguistic features of\nscientific method and knowledge (the ‘thesis of\nmetalogic’). For Neurath, this approach helped purge philosophy\nof deleterious metaphysical nonsense and dogmatism, and acknowledged\nthe radically social nature of language and science.\n3.2 From language to logic and its broader relevance\n\nNeurath enjoyed early attention and recognition for his logic work\nalso reflected in early reminiscences of figures such as Popper and\nthe mathematician Karl Menger. Perhaps now surprisingly, mentions of\nNeurath’s and Olga Hahn’s papers, including a joint one,\nwere included by the logicians C.I. Lewis, in 1918, and Alonzo Church,\nin 1936, in their canonical bibliographies on symbolic logic (Lewis\n1918 and Church 1936).Neurath kept algebraic logic and its symbolic\ndimension as a recurrent standard and resource, first in his earlier\nwork on the social sciences and pictorial language, and subsequently\nin related contributions to the discussions that informed logical\nempiricism (for a detailed discussion, see Cat 2019). The relevance to\nhis interest in political economy concerned the rational and\nscientific character of economic theory, the possibility of\nqualitative measurement and the limits of quantification and univocal\ndetermination, and, as a result, also of decision-making and\nprediction. Contrary to predominant accounts using attention to formal\nlanguages and logic to pit against each other wings and members of the\nlogical empiricist movement, the symbolic logical standard may be\nconsidered a unifying framework that distinguished Neurath with it and\nnot from it. It a unifying reference he willingly adopted when he\ncoined the term ’logical empiricism’ (Mormann 1999 and Cat\n2019). The differentiating role in Neurath’s positions can be\nidentified in his shifting and progressively skeptical and critical\nattention to the standard and the his attention to algebraic logic\nrather than the newer logic familiar to Carnap at work in Frege and\nRussell’s logicism. \n\nLeibniz had given modern philosophical currency to the pasigraphic\nnotion of a universal characteristic or Alphabet of Thought that both\nexpressed reality and operated as a logical calculus of reasoning. In\nthe Cartesian spirit, language and reason were inseparable instruments\nof knowledge and mathematical, logical and philosophical methods were\nidentical. In the late nineteenth century and the early twentieth,\nLeibniz’s project became a common reference in works in\nmathematical logic. Not only did Frege see his philosophy of language\nand mathematical logic within this tradition, as did Peano; Russell\npenned a landmark study and logicians such as Ernst Schröder and\nLouis Couturat associated it distinctively with the development of\nalgebraic logic since Boole, especially with Schröder’s own\n(Peckhaus 2012 and Cat 2019). In this tradition the logician and\npolitical economist Stanley Jevons recovered the combinatorial element\nin Leibniz’s method.\n\nNeurath’s logic writings focused on Schröder’s\naxiomatic systematization of algebraic logic, mainly in the monumental\nVorlesungen über die Algebra der Logik (exakte Logik)\n(1890-95). There and in earlier writings, Schröder geve a\nfundamental role to the relation of subsumption and a law of duality.\nSubsumption was a part-whole relation defined over domains of objects\nand it was expressed with a symbol, €, which denoted both\ninclusion and equality (with a corresponding algebraic expression,\nfollowing Hermann Grassmann, in terms of partial inequality ≤) so\nthat if a € b and b € a, then a=b. The law of duality\nestablished a systematic correspondence between theorems in terms of 1\nand operation + and theorems in terms of 0 and operation x. The\nmethodological role of duality organizing and deriving theorems was\nexpressed in a dual-column presentation. The latter was adopted in a\nmore general spirit by Neurath and subsequently also by Carnap in his\npresentation of the systematic correspondence between formal and\nmaterial modes (see Cat 2019).\n\nBy the late nineteenth century, in Austria as well as Germany,\nalgebraic logic had found a central place in the raging controversies\nover the relationship between science and philosophy and, in\nparticular, between mathematics, logic and psychology. Neurath and\nOlga Hahn became acquainted with algebraic logic at the University of\nVienna sometime around 1902-3, but it wasn’t until 1909, after\nOlga had become blind and Neurath was back in Vienna providing\nassistance, that she started working on algebraic logic for her\ndoctorate in philosophy. In 1909 Wilhelm Wundt had published a third\nvolume of his Logik; in 1909, part 1 of Schröder’s\nsynthetic treatment, Abriss der Algebra der Logik appeared\nposthumously; and in 1910 part 2 was published, as well as Olha\nHahn’s thesis director Adolph Stöhr’s Lehrbuch\nder Logik in Psychologisiender Darstellung (see Cat 2019 for\ndetails and references).\n\nNeurath published four papers, one with Hahn (Neurath 1909a, 1909b and\n1910a, and Hahn and Neurath 1909). Hahn separately published two\nothers, the second submitted as her doctoral thesis (Hahn 1909 and\n1910).In the joint paper, Hahn and Neurath proved the dependence of\nthe principle of duality on the algebraic complementarity of domains\nof objects to which symbols and operations are applied.\nNeurath’s own three papers addressed mainly\nSchröder’s symbolic relation of equality and the property\nof commutativity of operations sum and product over symbols standing\nfor classes of objects. It included a classification of applications\nof symbolic equalities and a discussion of univocality, or\ndeterminateness, noting its fundamental role in Schröder’s\nsystem and following the positivist philosopher Joseph\nPetzoldt’s discussion of causality, determinism and the\ninterpretation of equality signs in mathematical equations. Neurath\ndistinguished between (quantitative) equality, definitional equality\nand symbolic equality (Neurath 1910a). with the notational dimension\nof the latter equality and the lack of cognitive significance Neurath\nassociated with differences in symbolic expression, his linguistic\nperspective differed markedly from Frege’s. Besides attention to\nthe relativity of notational convention, the significance of the\ncommutation law was, according to Neurath, relative to the axiomatic\nsystem (echoing Poincaré’s conventionalist treatment of\ngeometry).\n\nThe issues Neurath addressed resonated with ongoing philosophical\ndebates over equality in mathematical equations, identity,\ndefinitions, analyticity, axiomatization and conceptual analysis. In\naddition to the theme of univocality, a second enduring theme that\nappeared first in the logic writings was the semiotic, or notational,\nand typographic approach to the conventional introduction and\norganization of symbols, especially the linear, one-dimensional\ncharacter of typographic arrangements. The ideas and perspectives he\ndeveloped in the logic writings played a role in his subsequent\ndiscussions of economics, decision-making, scientific theorizing\nthrough combinatorial classifications and the epistemological and\nmethodological contributions to logical empiricism.\n\nFor instance, he cast the scientific character of political economy in\nterms of a modal criterion according to which true science consists in\nsystematically examining all possible cases and historical methods\nprovided a laboratory for the exploration of such possibilities\n(Neurath 1910b, 277). Moreover, this scientific character was also\nexpressed by the aims of systematicity, rationality and exactness, but\nnot quantitative measurability. Exact relations, he declared, were\npossible between non-measurable quantities. Such qualitative\nmeasurements involved logical (and topological) relations such as the\nordinal standard based on the algebraic relation of inequality\n(ibid.). Poincaré had introduced the same ordering relations\nbetween ’non-measurable quantities’ such as Gustav\nFechner’s psycho-physical sensations to draw attention to the\ngap between the phenomenological and mathematical ideas of the spatial\ncontinuum (Poincaré 1906, 28; Turk 2018). Neurath, following\nalso Poincaré and Fechner by analogy with the case of\nsubjective utility measures, applied this approach to study of the\nlimitations in the method of determination of decisions over\ncollective distributions of satisfaction based on aggregations of\nindividual attributions (Uebel 2004, 37 and Turk 2018, 136).\nComparisons between individual pleasure attributions for the same\nindividual or the same object did not determine the comparative order\nbetween aggregations: for individuals a and b and objects a and b, we\nmay have determined (Aa)>(Ab) and (Ba)>(Bb), and yet,\n(Aa)+(Bb)?(Ab)+(Ba) (Neurath 1912/1973, 115). Methodological and\nepistemological consequences for the formulation of logical empiricist\nincluded acknowledging the technical formal contributions to modern\nscience protecting it from metaphysics and meaninglessness, a role\ncaptured by the term ’logical empiricism,’ while\nacknowledging only a limited value for the empirical application\nformal logical standard (with the risk of pseudorationalism),\ndefending syntacticism about language and unification only through a\nuniversal mixed jargon and local logical systematization.\n3.3 Scientific and linguistic epistemology\n\nKant had delivered the latest grand attempt to address the relation\nbetween science and philosophy, by taking the former to provide\nobjective empirical knowledge (exact, universal and necessary) and\ngiving to the latter knowledge the task of laying out the conditions\nof intelligibility and possibility of such knowledge as the sole,\ncritical scope of metaphysics and legitimate exercise of reason.\nKant’s standard of a priori, an expression of\nrationality, was challenged and relativized by the Frege, Russell and\nWhitehead’s notions of mathematical numbers grounded in logic\nand by the new notions of space and time in Einstein’s\nrelativity theories. Neither mathematics was synthetic, nor physics\nseemed a priori; and the synthetic a priori was dismissed as\nempty of content in the new scientific landscape.\n\nWith the scientific world-conception, logical empiricists followed in\nthe footsteps and Helmholtz and Mach and considered a new post-Kantian\nproblematic: investigating the possibility of objective empirical\nknowledge with a role for intellectual construction without\nuniversality or necessity, neither Kantian apriorism nor radical\npositivism. Logic, with scientific status linked to technical\nsymbolism and the possibility of mathematics, was the sole last refuge\nfor philosophy. The new problematic suggested a demarcation project\nwith two inseparable tasks that were both descriptive and normative: a\npositive, unifying task to establish and promote the marks of\nscientific knowledge and the negative task to distinguish it from\nphilosophy.\n\nThe a priori kind of knowledge claims expressed in exact\ntheory was circumscribed to the analytic, voided of universality and\nnecessity and deflated by Schlick and Reichenbach to the character of\ndefinitions and conventions (following Poincaré). The synthetic\nkind of knowledge claim was exclusively a posteriori,\ngrounded in experience. The dominating, and later popularized,\nposition was that revisable theoretical scientific statements should\nstand in appropriate logical relations to unrevisable statements about\nelementary observations (data), called ‘control sentences’\nor ‘protocol sentences’. Such relations would provide\ntheoretical terms with cognitive meaning or sense, and theoretical\nstatements with verification. The form, role and status of protocol\nstatements thus became the topic of an important philosophical debate\nin the early 1930s involving logical-empiricist philosophers such as\nCarnap, Moritz Schlick, Edgar Zilsel and Otto Neurath, and others such\nas Karl Popper. At stake in the debate was precisely the very\narticulation of a philosophy of scientific knowledge, hence its\nimportance and also the diversity of positions that animated it.\n\nThe philosophical discussion that developed around the members of the\nVienna Circle was associated with the formulation of logical\nempiricism and the banner of ‘unity of science against\nmetaphysics’, but it cannot be adequately understood without\ntaking into account the diversity of evolving projects it\naccommodated. Carnap (much influenced by the neo-Kantian tradition,\nEinstein’s theories of relativity, Husserl’s\nphenomenology, Frege’s logic and, i.e., Hilbertian axiomatic\napproach to mathematics as well as Russell’s own logicism and\nhis philosophical project of logical constructions) was concerned with\nthe conditions of the possibility of objective knowledge, which he\nconsidered especially manifest in the formal exactness of scientific\nclaims (Carnap 1928). Schlick (inspired by turn-of-the-century French\nconventionalists such as Rey, Duhem and Poincaré,\nWittgenstein’s philosophy of representation of facts, as well as\nEinstein’s relativity theories and Hilbert’s implicit\ndefinitions and axiomatic approach to mathematics) was interested in\nthe meaning of terms in which actual scientific knowledge of reality\nis expressed, as well as its foundation on true and certain beliefs\nabout reality (Schlick 1918, 1934). Neurath (influenced by Mach,\nvarieties of French conventionalism, especially Duhem’s, and\nMarxism) sought to explore the empirical and historical conditions of\nscientific practice in both the natural and social sciences (Neurath\n1931/1973, 1932a/1983). Outside the Vienna Circle, Popper (influenced\nby Hume, Kant and Austrian child psychology) was interested in\naddressing the logical and normative issues of justification and\ndemarcation of objective and empirical scientific knowledge, without\nrelying on descriptive discussions of the psychology of subjective\nexperience and meaning (Popper 1935/1951). \n\nThe linguistic turn framed the examination of the controversial role\nof experience. In that respect the discussions of protocol sentences,\nthe so-called protocol sentence debate, addressed their linguistic\ncharacteristics and their epistemological status (Uebel 1992). It was\nanother dimension of their examination of both the source of human\nknowledge and the rejection of metaphysics as nonsense—often\ndangerous nonsense (Carnap, Hahn and Neurath 1929/1973, and Stadler\n2007).\n\nIn his classic work Der Logische Aufbau der Welt (1928)\n(known as the Aufbau and translated as The Logical\nStructure of the World), Carnap investigated the logical\n‘construction’ of objects of inter-subjective knowledge\nout of the simplest starting point or basic types of fundamental\nentities (Russell had urged in his late solution to the problem of the\nexternal world to substitute logical constructions for inferred\nentities). He introduced several possible domains of objects, one of\nwhich being the psychological objects of private sense\nexperience—analysed as ‘elementary experiences’.\nThese provided the simplest but also the ‘natural starting point\nin the epistemic order of objects’. This specific construction\ncaptures the fact that knowledge is someone’s private knowledge,\nwhile it raises Carnap’s (and Kant’s) main problem,\nnamely, how then objective knowledge is possible. In the\nAufbau and especially in Pseudoproblems in\nPhilosophy, also here the inclusion of terms and statements in\nthe system of science by this method was intended to exclude all\nnonsensical speculative statements. It provided a verification\ncriterion not only of testing but also of cognitive significance, or\nmeaning. Carnap stated in that vein that ‘science is a system of\nstatements based on direct experience’ (Carnap 1932/1934).\n\nIn spite of the range of alternatives considered, the\nAufbau’s main focus on an empiricist, or\nphenomenological, model of knowledge in terms of the immediate\nexperiential basis was quickly understood by fellow members of the\nVienna Circle as manifesting three philosophical positions:\nreductionism, atomism and foundationalism.\nReductionism took one set of terms to be fundamental or\nprimitive; the rest would be logically connected to them. The\nobjectivity, rationality and empirical content and justification of\nscientific knowledge depended on the resulting vertical integration.\nAtomism, especially in Neurath’s reading, was manifest\nsemantically and syntactically: semantically, in the analyzability of\na term; syntactically or structurally, in the elementary structure of\nprotocols in terms of a single experiential term—‘red\ncircle here now’—; it also appeared in the possibility of\nan individual testing relation of a theoretical statement to one of\nmore experiential statements. Note that this version of atomism\ndiffers from the atomistic positivism about the form of elementary\nexperience that Carnap attributed to Mach, in contrast with his own,\nscientifically updated and preferred Gestalt-doctrine of a\nunified field of experience at a given time. The ‘atomic’\nconcepts of the experiential basis are the result of a\n‘quasi-analysis’.\n\nFoundationalism, in the Cartesian tradition of secure basis,\ntook the beliefs in these terms held by the subject to be infallible,\nor not requiring verification, as well as the sole empirical source of\nepistemic warrant—or credibility—for all other beliefs.\nDescartes’s foundationalism is based on a priori\nknowledge; Carnap’s presentation of the empirical basis\ninstantiates a more modest version. Still a controversial issue among\nCarnap scholars, Carnap’s kind of foundationalism would be\ncharacterized within one structure as a relation to its basis rather\nthan foundationalism, as in Hume or Descartes, regarding one\nprivileged basis over others. In 1932 Carnap acknowledged that he had\nadopted a ‘refined form of absolutism of the\nur-sentence (“elementary sentence”, “atomic\nsentence”)’ (1932/1987, 469).\n\nNeurath first confronted Carnap on yet another alleged feature of his\nsystem, namely, subjectivism. He immediately rejected Carnap’s\nproposals on the grounds that if the language and the system of\nstatements that constitute scientific knowledge are intersubjective,\nthen phenomenalist talk of immediate subjective, private experiences\nshould have no place. More generally, Neurath offered a private\nlanguage argument to the effect that languages are necessarily\nintersubjective. In order to use experience reports to test and verify\neven one individual’s own beliefs over time, private\ninstantaneous statements of the form ‘red here now’ will\nnot do. To replace Carnap’s phenomenalist language Neurath\nintroduced in 1931 the language of physicalism (Neurath 1931/1983 and\n1932a/1983). This is the controversial Thesis of Physicalism:\nthe unity, intelligibility and objectivity of science rests on\nstatements in a language of public things, events and processes in\nspace and time —including behavior and physiological events,\nhence not necessarily in the technical terms of physical theory. While\ninspired by materialism, for Neurath this was a methodological and\nlinguistic rule, and not an ontological thesis. (As is the case in\nCarnap’s methodological solipsism, given Neurath’s\nanti-metaphysical attitude it would not have been meant as an\nexpression of an objectivist metaphysics in the form of either\nmaterialism or social idealism). That physicalism was to avoid\nmetaphysical connotations can be seen further in that, in the spirit\nof Carnap’s Thesis of Metalogic, its linguistic nature\nwas also central to its applications:\n\n\nstatements are compared with statements, certainly not with some\n“reality”, nor with “things”, as the Vienna\nCircle also thought up until now. (Neurath 1931/1983, 53)\n\n\nFollowing Neurath, Carnap explicitly opposed to the language of\nexperience a narrower conception of intersubjective physicalist\nlanguage which was to be found in the exact quantitative determination\nof physics-language realized in the readings of measurement\ninstruments. Remember that for Carnap only the structural or formal\nfeatures, in this case, of exact mathematical relations (manifested in\nthe topological and metric characteristics of scales), can guarantee\nobjectivity. Now the unity, objectivity and cognitive significance of\nscience rested on the universal possibility of the translation of any\nscientific statement into physical language—which in the long\nrun might lead to the reduction of all scientific knowledge to the\nlaws and concepts of physics.\n\nNeurath responded with a new doctrine of protocol statements that\nconsidered their distinctive linguistic form, contents and\nmethodological status (Neurath 1932b/1983). This doctrine was meant to\nexplicate the idea of scientific evidence in the framework of\nempiricism, and it did so by specifying conditions of acceptance of a\nstatement as empirical scientific evidence. It was meant also to\ncircumvent the pitfalls of the alleged subjectivism, atomism,\nreductionism and foundationalism attributed to Carnap’s earlier\ndiscussion of the experiential constitution, or construction system of\nconcepts and knowledge. Neurath’s informal but paradigmatic\nexample of a protocol was:\n\n\nOtto’s protocol at 3:17 o’clock: [Otto’s\nspeech-thinking at 3:16 was: (at 3:15 o’clock there was a table\nin the room perceived by Otto)].\n\n\nFar from Carnap’s atomic sort of protocol statements,\nNeurath’s model manifested a distinctive complexity of terms and\nstructure (“aggregations”). The protocol contains a\nfactual physicalist core in terms about the table and its location. It\nalso contains the experiential term that provides the linguistic\nrecording of the empirical character of protocols, that is, their\nexperiential origin. Neurath was mindful to caution here that\nperception terms only admitted physicalistic meaning in terms, for\ninstance, of physiological mechanisms of perception. It also contains\nthe declarative level, marked with ‘Otto says’, which\ndistinguishes the protocol as a linguistic statement. Neurath\ninsisted, again, that the statement had a dual nature, linguistic\n(propositional and communicative) and physicalist in the form of a\nphysical and physiological process. Finally, the other distinctive\nelements were the name of the protocolist and the times and locations\nof the experience and the reports, which provided an intersubjective ,\nphysicalist, public alternative to Carnap’s subjective\n‘I see a red circle here now’.\n(Note, however, that for Carnap, the idea of self itself is a\nconstituted concept.)\n\nThe general attention to language turned the project of logical\nempiricism into the problem of the acceptable universal language.\nScience must be characterized by its proper scientific language.\nNeurath’s plan was for a unified science against metaphysics,\nand this involved a plan to police the proper unifying,\nmetaphysics-free language. The negative track of the plan was\neffectively carried out by the development and adoption of a list of\n‘dangerous terms’, which he sometimes referred to,\nsemi-jokingly, as an index verborum prohibitorum: a list of\nforbidden terms such as ‘I’, ‘ego’,\n‘substance’, etc. (Neurath 1933, Neurath 1940/1984, 217).\nThe positive track was the adoption of the universal language of\nphysicalism: ‘metaphysical terms\ndivide—scientific terms unite’ (1935, 23,\norig. ital.).\n\nUnlike Carnap’s ideal of basic statement, whether protocol or\nphysicalist, Neurath’s protocols were not ‘clean’,\nprecise or pure in their terms. For Neurath physicalist language, and\nhence science in turn, is inseparable from ordinary language of any\ntime and place. In particular, it is muddled with imprecise,\nunanalyzed, cluster-like terms (Ballungen) that appear\nespecially in the protocols: the name of the protocolist,\n‘seeing’, ‘microscope’, etc. They were often\nto be further analyzed into more precise terms or mathematical\nco-ordinations, but they often would not be eliminated. Even the\nempirical character of protocol statements could not be pure and\nprimitive, as physicalism allowed the introduction of\ntheoretical—non-perception—terms. Carnap himself, in\nThe Logical Syntax of Language (1934), declared the\ndistinction between analytic and synthetic (protocol-based) statements\narbitrary. Physicalism, and thus unified science, were based on a\nuniversal ‘jargon’.\n\nThe empirical genealogy expressed by protocols was the linguistic\nexpression of empiricism that identified protocol statements as\nepistemological special units in the system of statements that would\nconstitute objective scientific knowledge. This was Neurath’s\nattempt to express the empiricist sentiment also behind Carnap’s\nappeal to experience. A difference from Carnap’s model of\nprotocol appears in the second aspect of their empiricist character,\ntheir testing function.\n\nNeurath’s protocols didn’t have the atomic structure and\nthe atomic testing role of Carnap’s. Their methodological role\nreflected Duhem’s holism: hypotheses are not tested\nindividually; only clusters of statements confront empirical data. But\ntheir methodological value in the testing of other statements\ndidn’t make them unrevisable. This is Neurath’s\nanti-foundationalism: Insofar as they were genuinely\nscientific statements, consistency with the spirit that opposed\nscience to dogmatic speculation and, no less importantly, opposed\nnaturalistic attention to actual practice, required that protocols too\nbe testable. This is the so-called Neurath Principle: in the\nface of conflict between a protocol and theoretical statements, the\ncancellation of a protocol statement is a methodological possibility\nas well (Neurath 1932b/1983, 95, Haller 1982). The role of\nindeterminacy in the protocol language points to a distinction between\na special Neurath Principle and a general Neurath\nPrinciple (Cartwright et al. 1996, 202–6). In the\nformer, and earlier, Neurath assumed a determinate logical relation of\ninconsistency. In the latter, subsequent version, the scope of\nrelations between hypotheses and protocol statements extended to\nindeterminate relations such that the principle behind the epistemic\nstatus of protocol statements is simply grounded on the voluntarisitic\nand conventionalist doctrine that ‘[a]ll content statements of\nscience, and also their protocol statements that are used for\nverification, are selected on the basis of decisions and can be\naltered in principle’ (Neurath 1934/1983, 102). Carnap adopted a\nsimilar conventionalist and pragmatic attitude in ‘On Protocol\nSentences’ (1932/1987) and in Logical Syntax (1934).\nThe complex structure of the explicitly laid out protocol would serve,\nin the holistic Duhemian spirit, the purpose of testing it by making\nexplicit as many circumstances as possible which are relevant to the\nexperience, especially as sources of its fallibility (was Otto\nhallucinating? were all the parts of the experimental instrument\nworking reliably? etc.). Neurath’s dictum was meant to do\njustice to actual scientific practice with regard to the role of\nexperimental data.\n\nThis problematic was only made more challenging by the presence of\nBallung-type terms. The method of testing could not be\ncarried out in a logically precise, determinate and conclusive manner,\nexpecting calculability, determinism, omniscience and certainty, as\nthe prevailing ideal of rationality required (Neurath 1913/1983,\nNeurath 1934/1983 and Cat 1995). Protocol sentences, by virtue of\nperception terms, could provide certain stability in the permanence of\ninformation necessary for the generation of new expressions. But\nmethodologically they could only bolster or shake our confidence. To\nacknowledge these limitations is a mark of proper\nrationality—which he opposed to pseudorationality. A\nloose coherentist view of justification and unification is the only\nlogical criterion available: ‘a statement is called correct if\nit can be incorporated in this totality’ of ‘existing\nstatements that have already been harmonized with each other’\n(Neurath 1931/1984, 66). Reasons underdetermine our actions and thus\npragmatic extra-logical factors are required to make decisions about\nwhat hypotheses to accept. Thinking requires provisional rules, or\nauxiliary motives, that fix a conclusion by decision (Neurath\n1913/1983). Scientific rationality is situated, contextually\nconstrained by, practical rationality. The system of knowledge is\nconstrained by historically, methodologically and theoretically\naccepted terms and beliefs, with limited stability, and cannot be\nrebuilt on pure, secure, infallible empirical foundations. This is the\nanti-Cartesian naturalism, non-foundationalism, fallibilism and holism\nof Neurath’s model. This is also the basis for its corresponding\nconventionalist, constructivist normativity (Uebel 1996 and 2007 and\nCartwright et al. 1996). Without the conventions there is no\npossibility of rationality or objectivity of knowledge. Neurath\ncaptured the main features of his doctrine of scientific knowledge in\nthe image of a boat:\n\n\nThere is no way to establish fully secured, neat protocol statements\nas starting points of the sciences. There is no tabula rasa.\nWe are like sailors who have to rebuild their ship on the open sea,\nwithout ever being able to dismantle it in dry-dock and reconstruct it\nfrom its best components. Only metaphysics can disappear without a\ntrace. Imprecise ‘verbal clusters’ [Ballungen]\nare somehow always part of the ship. If imprecision is diminished at\none place, it may well re-appear at another place to a stronger\ndegree. (Neurath 1932b/1983, 92)\n\n\nBy 1934, the year of the completion of his Logic of Scientific\nDiscovery (Logik der Forschung), Popper had adopted an\napproach to scientific knowledge based on the logic of method, not on\nmeaning, so that any talk of individual experience would have no\nlinguistic expression (Popper 1935/1951). He unfairly criticized\nNeurath and also Carnap for allowing with such expressions the\nintroduction of psychologism in a theory of knowledge. For Popper a\ntheory of scientific knowledge was to be not a subjective or\ndescriptive account, but a normative logic of justification and\ndemarcation. He also criticized Neurath’s antifoundationalism\nabout protocols as a form of anti-empiricism that merely opened the\ndoor to dogmatism or arbitrariness.\n\nInstead of protocols, Popper proposed to speak about basic\nstatements—a term more attuned to their logical and functional\nrole. They are basic relative to a theory under test. Their empirical\ncharacter would invisibly reside in the requirement that basic\nstatements be singular existential ones describing material objects in\nspace and time—much like Neurath’s physicalism—which\nwould be observable, in a further unspecified logical not\npsychological sense. Their components would not themselves be purely\nempirical terms since many would be understood in terms of\ndispositional properties, which, in turn, involved reference to\nlaw-like generalizations. But their ‘basic’ role was\nmethodological ‘with no direct function of demarcation from\nmetaphysics in terms of meaning, sense or cognitive\nsignificance’ and only provisional. They would be brought to\nmethodological use for the purpose of falsifying theories and\nhypotheses ‘individually and conclusively’ only once they\nwere conventionally and communally accepted by decision in order to\nstop infinite regress and further theoretical research.\n\nBut such acceptance, much as in Neurath’s model, could be in\nprinciple revoked. It is a contingent fact that scientists will stop\nat easily testable statements simply because it will be easier to\nreach an agreement. It is important that basic statements satisfy\nexplicit conditions of testability or else they could not be rightful\npart of science. Popper could offer no rational theory of their\nacceptance on pain of having to have recourse to theories of\npsychology of perception and thereby weakening his normative criterion\nof demarcation. In his view, his method, unlike Neurath’s,\ndidn’t lead to either arbitrariness or dogmatism or the\nabandonment of empiricism. As he had argued against Spengler in 1921,\nhistorical contingency provides the rich constraints that establish\ncommunities and communication and the possibility of knowledge and, in\nthis holistic form, preclude radical relativism in practice; in\nhistorically situated practice, inherited or constructed stable\nArchimedean points always come into place; there is no tabula\nrasa (Neurath 1921/1973). Neurath rejected Popper’s\napproach for its stealth empiricism and its pseudorationalism: its\nmisplaced emphasis on and faith in the normative uniqueness, precision\nand conclusiveness of a logical method—at the expense of its own\nlimitations and pragmatic character (Zolo 1989, Cat 1995, Hacohen\n2000).\n\nFinally, the most radical empiricist attitude toward protocol\nsentences within the Vienna Circle came from Schlick. Schlick\nendorsed, following Hilbert, a formal, structural notion of\ncommunicable, objective knowledge and meaning as well as a\ncorrespondence theory of truth. His realism opposed Neurath’s\ncoherentism, and also the pragmatism and conventionalism of\nCarnap’s Principle of Tolerance in logical matters as\nwell as his Thesis of Metalogic. But like Carnap’s latter thesis\nand his syntactic approach of 1934, Schlick was concerned with both\nthe Cartesian ideal of foundational certainty and Wittgenstein’s\nmetalinguistic problem of how language represents the reality it is\nabout; such relation could only be shown, not said. In 1934 Schlick\nproposed to treat the claims motivating protocol statements, left by\nNeurath with the status of little more than mere hypotheses, as key to\nthe foundation of knowledge. They would be physicalistic statements\nthat, albeit being fallible, could be subjectively linked to\nstatements about immediate private experiences of reality such as\n‘blue here now’ he called affirmations\n(Konstatierungen) (Schlick 1934). Affirmations carried\ncertainty and elucidated what could be showed but not said, they\nprovided the elusive confrontation or correspondence between\ntheoretical propositions and facts of reality. In this sense they\nafforded, according to Schlick, the fixed starting points and\nfoundation of all knowledge. But the foundation raised a psychological\nand semantic problem about the acceptance of a protocol. Affirmations,\nas acts of verification or giving meaning, lacked logical inferential\nforce; in Schlick’s words, they ‘do not occur within\nscience itself, and can neither be derived from scientific\npropositions, nor the latter from them’ (Schlick 1934, 95).\nSchlick’s empiricism regarding the role of protocol sentences\nsuggests but does not support strong epistemological foundationalism.\nSchlick’s occasional references to a correspondence theory of\ntruth were just as unacceptable and were felt to be even more of a\nphilosophical betrayal within the framework of empiricism.\nPredictably, Neurath rejected Schlick’s doctrines as\nmetaphysical, manifesting the pseudorationalist attitude (Neurath\n1934/1983).\n4. Unity of Science and the Encyclopedia Model\n\nEarly in his intellectual life, at the turn of the twentieth century,\nNeurath was acquainted with at least four recent images and projects\nof unification of the sciences: (1) The scholastic (Llull) and\nrationalist (Leibniz) tradition of an ideal universal language and\ncalculus of reasoning; (2) the Neo-Kantians’distinction between\nthe Naturwissenschaften and the\nGeisteswissenschaften; (3) Wundt’s comprehensive\nlogical viewpoints associated with different sciences, or perspectival\nmonism; and (4) the Monist movement more generally, with figures such\nas Ernst Haeckel and Wilhelm Ostwald that included the project of\nenergetics, with Mach’s related bio-economic, neutral monism of\nelementary sensations. Subsequently, throughout the 1910s, Neurath\nengaged four connected debates: (1) The debate over the Neo-Kantian\ndivide between natural and human, or cultural, sciences; (2) the\ndebate over the distinctive role of value judgment in the social\nsciences; (3) the debate over the scope and validity of concepts and\nlaws in economics; and (4) the debate over the possibility of history\nas a positive science.\n\nIn the Vienna Circle’s manifesto (1929), Neurath ushered in and\nextolled a scientistic turn in philosophy he labelled the scientific\nworld-conception. Beyond the intellectual, he added, ‘the\nscientific world-conception serves life and life receives\nit’ (Carnap, Hahn and Neurath 1929/1973, 306, orig. ital.).\nHere the project of logical empiricism gets its Enlightenment\ndimension, with the old reforming, constructive and universalist\nambitions, but with new and revised ideas and ideals of society,\nscience and rationality (Uebel 1998). Neurath continued to maintain\nthe view that, as predictive tools, all sciences are ‘aids to\ncreative life’ (Neurath 1931/1973, 319), alongside his view of\nthe complexity of life, e.g., the earthly plane of the empirical world\nthat includes the human, private and social. It cannot surprise, then,\nthat in this new transformative joint philosophical-social project he\nwould urge that ‘the goal ahead is unified\nscience’ (Carnap, Hahn and Neurath 1929/1973, 306, orig.\nital.). Like science itself, unified science straddles any divide\nbetween theory and action, the world of physical objects and the world\nof social objectives, past and future, empirical reality and human\nrealization. It is unity of science at the point of action (Cartwright\net al 1991, Cartwright et al. 1996 and Cat et al.\n1996, O’Neill 2003).\n\nNeurath illustrated the fact that the holistic argument for\nunification from the complexity of life generalizes Duhem’s\nholistic argument about prediction and testing with the example of a\nforest fire:\n\n\nCertainly, different kinds of laws can be distinguished from each\nother: for example, chemical, biological or sociological laws;\nhowever, it can not be said of a prediction of a concrete\nindividual process that it depend on one definite kind of law\nonly. For example, whether a forest will burn down at a certain\nlocation on earth depends as much on the weather as on whether human\nintervention takes place or not. This intervention, however, can only\nbe predicted if one knows the laws of human behaviour. That is,\nunder certain circumstances, it must be possible to connect all kinds\nof laws with each other. Therefore all laws, whether chemical,\nclimatological or sociological, must be conceived as parts of a\nsystem, namely of unified science. (Neurath 1931/1983, 59, orig.\nitals.)\n\n\nLaws of one kind may apply nicely to systems, phenomena or events\npurely of one kind, but such things are not concrete individuals in\nthe real world. We may think of them as useful models or abstractions;\nreality behaves more like them only in controlled settings, the\noutcome of engineering, of planned design and construction, that is,\nthe materialized form of abstraction. Idealizations, like ideal types,\ndangerously assume real separability between properties (Neurath\n1941/1983, 225). In this sense, necessary experimentation for the\npurpose of prediction and testing that control is key to observation\nand in turn observation controls theory. In general, from that point\nof view, exactness and scope requires the possibility of composing\nmodels, laws and sciences of different kinds. Science at the point of\naction is unified science.\n\nNeurath’s philosophical contributions to logical empiricism\nappear now more distinctly motivated and more clearly understood: It\nis to serve the valuable goal of unified science, within science,\nphilosophy and society, that Neurath conceived the stress on two\nfurther epistemological aims, namely, the role of collective efforts\nand finally, by implication, intersubjectivity (ibid.). The\nargument from holism would in turn meet the requirements of the\ndemarcation against metaphysics, since metaphysical terms and\nmetaphysicians divide, whereas scientific terms and scientists unite.\nThe boat images further illustrated Neurath’s aim of unity,\nwithin its proper epistemological framework: as a historically\nsituated, non-foundational and collective enterprise. Science is a\nmodel and a resource for society and society is in turn a model and\nresource for science.\n\nIn the context and the phase of the rise of logical empiricism,\nNeurath’s arguments took a general intellectual formulation and\napplication, with references to precedents from intellectual history\nsuch as Leibniz and L’Encyclopédie (see SCIENTIFIC\nUNITY), and an institutional expression in the form of the planned\nunity of science movement, with its different institutions (Institute\nof Unified Science), events (International Congresses for the Unity of\nScience) and publications (International Encyclopedia of Unified\nScience) (Neurath 1937a/1983, Reisch 1994, Symons et al. 2011).\n\nWhat are the model and mode of unity? What is the alternative they\noppose? Despite popular approaches suggesting a hierarchical, or\npyramidal, structure, which he associated with, among others, Comte,\nOstwald and then Carnap (in the Aufbau and in his subsequent\ndoctrine of physicalism), Neurath opposed the ideal of\n‘pyramidism’ and a ‘system-model’: an\naxiomatic, precisely and deductively closed and complete hierarchy of\nconceptually pure, distinct and fixed sciences. He also dismissed the\nidea of ONE method and ONE ideal language, for instance, mathematics\nor physics, followed by all the other sciences (Neurath 1936/1983 and\nNeurath 1937b/1983). Since 1910 Neurath’s approach to the issue\nwas thoroughly antireductionist: cognitively, logically and\npragmatically. Each science would fail to deal with the connections to\nothers (Neurath 1910/2004). In particular, electron talk, Neurath\ninsisted, is irrelevant to understanding and predicting the complex\nbehavior of social groups.\n\nThe imperative of unity required that ‘it must be possible to\nconnect each law with every other law under certain circumstances, in\norder to obtain new formulations’ (Neurath 1931/1983, 59).\nInstead of the system-model, he proposed a weaker, dynamical and local\nmodel of integration he called the ‘encyclopedia-model’: a\nmore or less coherent totality of scientific statements at a given\ntime, in flux, incomplete, with linguistic imprecisions and logical\nindeterminacy and gaps, unified linguistically by the universal jargon\nof physicalist language (not Carnap’s physicalism)—a\nmixture of ‘cluster’ and ‘formula’—, the\ncooperative and empiricist spirit, and the acceptance of a number of\nmethods or techniques (probability, statistics, etc), all providing\n‘cross-connections’ (Neurath 1936/1983, 145–158 and\n213–229). The evolution of the sciences could be said to proceed\nfrom encyclopedias to encyclopedias (a model weaker and more\npluralistic than those based on Kuhn’s paradigms and\nFoucault’s epistèmes, but closer to\nCarnap’s later notion of linguistic frameworks; from this\nperspective, it seems less paradoxical that Carnap published\nKuhn’s The Structure of Scientific Revolutions in the\nlast volume of the International Encyclopedia of Unified Science).\nNeurath spoke of a ‘mosaic’, an ‘aggregation’,\nan interdisciplinary ‘orchestration’ of the sciences as\n‘systematisation from below’ rather than a ‘system\nfrom above’, especially, after World War II, carefully excluding\nany form of ‘authoritative integration’, even favoring\n‘cooperation in fruitful discussion’ to a socialist, Nazi\nor totalitarian-sounding talk of a ‘programme’ (Neurath\n1936/1983 and Neurath 1946/1983, 230–242). Correspondingly, his\nlater political writings emphasized internationalism, democracy and\nplurality of institutional loyalties.\n\nThe disciplinary dismissal of philosophy, especially its talk of\ntranscendental entities that make up metaphysical doctrines, hardly\nrecommend calling Neurath’s views a philosophy. At the same\ntime, his emphasis on science was coached in a framework that\nconnected thought and action. One may speak of a program.\nNeurath’s program was intended to be and was pluralistic and\n‘aggregational’ through and through, semantically,\ntheoretically, disciplinarily, educationally, socially,\npolitically.\n5. Philosophy of psychology, education, and the social sciences\n5.1 Philosophy of psychology\n\nVienna became an international capital of psychological research while\nlogical empiricism started to develop a scientific epistemology and an\nepistemology of science with normative demarcation goals.\nFreud’s psychoanalysis was more popular than J.B. Watson’s\nAmerican behaviorism and Gestalt psychology was dominant neither in\npsychology nor scientific philosophy. The members of the Vienna Circle\ncollectively adopted its framework of scientism and anti-metaphysics,\nof logic and empiricism, and aimed to select their intellectual allies\nand targets accordingly. Yet, individually, they tailored their\nconsiderations of the different sciences to their respective agendas,\nshifting projects and development. In the Vienna Circle manifesto, the\nofficial programmatic position was to point to the defects of much\ncontemporary psychological language, plagued by metaphysical burden,\nconceptual imprecision and logical inconsistency. The emphasis on\nperception selected behaviorist psychology as intellectual ally\nconsistent with the Circle’s scientific world-conception\n(Carnap, Hahn and Neurath 1929/1973, 314-5, Hardcastle 2007).\n\nHans Reichenbach, Carnap and Schlick’s ally in Berlin, was the\nleader of the Berlin Society for Scientific Philosophy, also known as\nthe Berlin Circle, and hence was in personal and intellectual\ninteraction with Wolfgang Köhler in Berlin. Eventually he would\nmention Gestalt theory in his writings in 1931, in ‘Aims of\nModern Philosophy of Nature’. There he raised the question of\nthe philosophical problems of psychology and focused on Gestalt theory\nas ‘a recent development’ that ‘subsumes\npsychological events under the concept of Gestalt (…) an\norganized arrangement of experiences’ (Reichenbach 1931/1959,\n88).\n\nLike Kant, Popper was interested in a transcendental and regulative\nphilosophy, and, more so than Kant, he hailed science as the paradigm\nof intellectual activity. But by 1928 he was still holding a\ncommitment to inductivism. In 1928 Popper finished his doctoral\ndissertation, ‘On the Methodological Problem of Cognitive\nPsychology’. There, Popper set out to understand the relations\nbetween logic, biology and psychology in the production of knowledge\nand, to that effect, to outline the methodological preconditions of\ncognitive psychology. Two alternative views of psychology were\navailable to Popper through his two doctoral examiners, Karl\nBühler and Moritz Schlick.\n\nSchlick represented Gestalt theory as psychology within the reductive\nframework of physicalism, that is, rejecting the existence of\nautonomous entities, laws and methods of psychology.\nBühler’s career was central to Austrian psychology and to\nRed Vienna culture. After an assistantship with Stumpf in his\nBerlin’s laboratory, Bühler had emerged, along with Otto\nSelz and Max Wertheimer, from the research laboratory of Ostwald\nKülpe in Würtzburg. With Külpe he had engaged in\nempirical research on thought processes—contra Wundt’s\natomistic psychology-, with special attention to imageless thought and\nthe importance of language. He subsequently moved with Külpe to\nBonn and eventually replaced him in Munich in 1915. In 1912\nBühler had originally contributed to Gestalt psychology with the\ndiscussion of simple Gestalt forms involved in the perception of\nproportions of geometrical figures and ended concentrating on his\ncognitive phenomenon of the ‘aha experience’, a sudden\ninsight in problem solving. Interested in the same phenomenon,\nCharlotte Malachowski was encouraged by Stumpf to join Bühler in\nMunich, where she became his wife. They collaborated on a project to\nstudy the mental development of children, ending with intelligent\nlearning through language. The results appeared in his The Mental\nDevelopment of the Child (1918), which immediately became the\nstandard reference on the subject.\n\nIn Vienna, Otto Glöckel, founder of the world-renowned Vienna\nSchool Reform movement and president of the Vienna School Board,\noffered to fund for the Bühlers a psychological laboratory. After\nKarl Bühler had lost to Köhler the appointment to the Berlin\nposts, he ended up assuming in 1923 the directorship of the newly\nfunded Psychological Institute of Vienna. From the Institute the\nBühlers became central to Red Vienna culture. They taught at the\nPedagogical Academy of Vienna. In addition, she focused on children\neducation and psychological welfare. His interest in language and\nphilosophy brought him closer to Schlick (Wittgenstein’s sister\nMargaret organized social occasions for Wittgenstein, the Bühlers\nand the Schlicks to meet) and he encouraged his students to attend\nVienna Circle seminars (Egon Brunswick, Elsa Frankel, Marie Jahoda,\nPaul Lazersfeld, Rudolf Ekstein and Edith Weisskopf). Then in 1927 he\npublished Die Krise der Psychologie (The Crisis of\nPsychology). In the book, Bühler argued that the problem of\nexplaining the social significance of language showed that psychology\nhas lost the complexity and richness required to synthesize three\nlevels of psychology: experience, behavior and intellectual structure\n(Bühler 1927, Hacohen 2000 and Humphrey 1951). A framework was\nneeded for unifying the different narrow ‘schools’ of\npsychology: Behaviorism, Gestalt theory, psychoanalysis,\nassociationism, and humanistic psychology. They were deficient in\ntheir narrow domain of application. The unity of psychology demanded\nmethodological pluralism at the point of cooperation.\n\nAround this time, Popper’s interest in the scientific character\nof psychology was still bound to the notion that induction is the\nempirical method of the natural sciences (ter Hark 2002, and Gattei\n2004, 453). He developed his interest in psychology in his second\nthesis, on the method of cognitive psychology, of 1928 (the first was\non the inductive basis of pedagogy). Popper argued against\nSchlick’s views rejecting the reciprocal interaction between\nbody and mind: physicalism was impractical and psychophysical\nparallelism empirically unverifiable. The choice between\nSchlick’s physicalism and Bühler’s pluralism was not\nlogically decidable. Psychology was better off autonomous, discovering\nempirically new laws and phenomena that only subsequently might or\nmight not prove reducible to material interpretation. Moreover, he was\nprimarily concerned with his own epistemological project, descriptive\nand regulative, regarding the production of scientific knowledge.\nPopper reasoned by analogy with Bühler’s problem regarding\nlanguage: Gestalt psychology was too narrow to establish the\nconditions of possibility of cognitive psychology and the logic of\nintellectual structures. He was further interested in the Viennese\nOtto Selz’s holistic and functional notion of ‘total\ntask’, based on a psychological mechanism of trial and error\n(this notion would inspire not only Popper’s pedagogy, but\nelements of his scientific methodology of hypotheses and\nfalsification, conjectures and refutations). His heart and mind were\nset against the sufficiency of Gestalt psychology.\n\nIn the Aufbau Carnap associated Watson’s behaviorism\nwith a physicalist basis for a construction system, whereas Gestalt\npsychology was better suited to provide an empirical basis for the\nepistemological system (which was to reflect the origin of the\nconcepts in our system of knowledge) (Carnap 1928). Carnap was\nconcerned, in a neo-Kantian fashion, with the question of the\nconstitution of the world; and he tried to combine the strengths of\nempiricist and Kantian epistemologies in a system that was\nmetaphysically neutral. One of the many possible logical constructions\n—borrowing Russell’s terminology—or constitution\nsystems of knowledge was to accommodate the epistemic value of\nindividual experience while preserving the objective form of\nscientific knowledge (Friedman 1999). It is there that in order to\nrepresent experience scientifically, he chose, following Schlick,\nGestalt theory. Experience contributed a complex holistic\nstream—a ‘true’, ‘organic’\nwhole—out of which the elementary empirical concepts must be\nabstracted, by the process he called quasi-analysis. Unlike for\nStumpf, but like for Wertheimer and Köhler, for Carnap elementary\nsensations were only abstractions—he wrote of quasi-analysis\nthrough classes of recollected experiences—from experiential\nGestalts. In the book he explicitly referred to Köhler’s\narticle ‘Gestaltprobleme und Anfänge einer Gestalttheorie,\nÜbersichtsreferat’ (1925) and Wertheimer’s survey\nUeber Gestalttheorie (1925) (Carnap (1928), sects. 62 and\n109; besides Husserl’s, the influence of Meinong’s\nGestalt-based philosophy deserves careful exploration).\n\nLike Wittgenstein and Popper, both prior to but especially during the\nRed Vienna period, Neurath was interested in education and cognitive\npsychology (like Popper, also in connection with socialist political\nand social goals). He quickly gained notoriety with his visual method\nof communication, known as ISOTYPE or Vienna Method. Neurath’s\ncrusade for unified science against speculative metaphysics and the\nconnected challenge of understanding the social and objective nature\nof scientific knowledge drove him in 1931 to adopt physicalism as the\nchief constraint on scientific concepts and theories. Physicalism, in\na sense broader than Carnap and Schlick’s doctrine of the same\nterm, was the materialist view that science speaks only of observable\nevents, things and processes in space and time. This view set a\n(normative) bridge intended to unify the truly scientific natural and\nthe social sciences, yet it did not require any reduction to physics.\nRadical empiricism, by contrast, would only impose the primacy of the\nsubjective, the source of contentiousness, dogmatism and\narbitrariness, which he abhorred in speculative metaphysical\ndoctrines. Neurath rejected, along these lines, the language of the\nunconscious and the ego, subjective mental states devoid of material\n-physiological-, perceptual or operational correlates. \n\nThe metaphysical or semantic policing of psychological vocabulary took\nplace at two levels: as a science integrated within the unity of the\nsciences according to principles of physicalism, and as part of the\nscientific representation of relevant perception in the form of\nprotocol sentences. As a matter of psychology of perception and\nlanguage, all events and processes, all perceptual, speech and thought\nterms involved in the production of empirical data were to be taken\nphysicalistically, e.g., as descriptions of spatio-temporal structures\ninvolving behavior or bodily—anatomical and physiological-\nchanges under given observed conditions (Neurath 1931/1983, 55).\n\nFrom the point of view of Neurath’s physicalism or enlightened\nempiricism, the goal was to achieve a unity of empirical formulations\nin psychology. The only acceptable psychological positions were the\nkinds of behaviorism championed by J.B. Watson, E.C. Tolman, and F.B.\nSkinner and physiological theories (Neurath 1931a/1983, 50;\n1931b/1983, 55; 1932a/1983, 63, 67, and 73). Yet he also drew some\ndistance between physicalism and behaviorism by declaring the latter\nboth too narrow and too broad, and containing non-physicalist notions\n(Neurath 1936/1983, 164). He came to distinguish behaviorism, in this\nnarrow sense, from ‘behavioristics’, the emphasis on\nperceptual considerations of behavior within the framework of\nphysicalism (Neurath 1933/1987, 13). Neurath mentioned Gestalt theory\nas one of the schools of psychology alongside behaviorism and\npsychoanalysis disrupting the unity of psychology as a discipline\n(implicitly echoing Bühler’s earlier lamentations; Neurath\n1937/1983, 172–3, and 1933/1987, 15), but he did not mention\nGestalt as an example of scientific psychology (a few statements on\nthis point in Cat 2005 are regrettably mistaken or else misleading).\nHe merely pointed to the promise of its empirical contributions to\nscientific behaviorism with a rejection of its talk of holistic\nproperties as metaphysical danglers (Neurath 1933/1987, 17–8).\n\n5.2 Philosophy of education\n\nAs mentioned above, psychology and pedagogy were inseparable in\nVienna’s intellectual, scientific and political culture of the\n1920s. Glöckel’s school reform movement of 1922 onwards\nadvocated empirical research in pedagogy, it separated school from\nchurch and promoted social equality. Child welfare became a central\nconcern and attracted the pedagogical interest for intellectual and or\npolitical reasons of Popper, Wittgenstein and Neurath (on Popper see\nHacohen 2002; Wittgenstein see Bartley 1974 and Peters 2001). In their\npedagogical activities one can find the roots of some of their\nepistemological views. Popper and Wittgenstein became school-teachers\nand Wittgenstein even published in 1925 a spelling dictionary,\nWörterbuch für Volksschullen. Lili Roubiczek, a\nstudent of Maria Montessori in London and Karl Bühler in Vienna\nestablished a Montessori school in 1923 and soon Montessori ideas\nattracted educators and psychologists alike (from Charlotte\nBühler to Anna Freud) (Kramer 1988). Montessori stressed the idea\nof the child’s capacity for active self-directed learning\nthrough sensory and motor interaction with the environment with\nguidance and error-correcting feedback. Gestalt psychologists,\npsychoanalysts and others defended similarly active models of the\nchild’s mind. \n\nIn 1927, after Vienna’s city council had unified the\npsychological and pedagogical institutes into a Pedagogic Institute,\nPopper wrote his first thesis, ‘“Habit” and\n“Experience of Law” in Education’. There, he\njustified the scientific status of pedagogy on inductivist grounds.\nAnd he raised the fateful philosophical problems of the\n‘objective-scientific decidability of pedagogical\nproblems’ and ‘the delimitation of the empirical part of\npedagogy from its non-empirical part’ (ter Hark 2002, 88 and\nGattei 2004, 454). Selz’s holistic and functional notion of\n‘total task’, based on a psychological mechanism of trial\nand error would inspire Popper’s pedagogy as well as his\nscientific methodology. Moreover, his awareness of Montessori methods\nwas secured in the 1920s by his teaching education, his friendship\nwith a carpenter who made toys for a Montessori orphanage and turned\nhim to cabinet-making and the Montessori-inspired ‘Socratic\nmethod’ of his admired Kantian critical philosopher Leonard\nNelson (Hacohen 2000, 90 and 122).\n\nNeurath’s views on education, as did his scientific\nepistemology, integrated social, political, scientific and empiricist\nelements in a mutually reinforcing manner. Equally, his synthetic\nattitude integrated attention to different specific dimensions such as\nconceptual information, material, linguistic and graphic\nrepresentation, and cognitive and social attitudes, capacities,\nvalues, goals and institutions. The most influential example and\noutcome of his views were the development and application of ISOTYPE\nmethod of visual education (See the supplementary document\n Visual Education.).\n\nEducation involves argument and discussion. It is in\nthis sense dialogical. The term ‘argument’ was used by\nNeurath broadly, to include the case or point being made and\ncommunicated, both senses of demonstration. Neurath wrote that to\nargue requires one to distinguish between essentials and incidentals\n(Neurath 1945/1973, 239). So a visual argument is ‘a combination\nof verbal and visual aids leading to the essentials’\n(ibid., 240). \n\nUnder the aegis of the values of neutrality and universality that\ncharacterized his economic theory, social views and scientific\nepistemology, Neurath sought also the universal media of communication\nof knowledge: visual perception and scientific information. Science is\n‘the typical species of arguing which human beings of all\nnations, rich and poor, have in common’ (ibid., 229),\nallowing for discussions in any civilization, which other disciplines\nor discourses render local. As in the doctrines of the objective\n(intersubjective), universal, unifying value of observation language,\nNeurath claimed that simple visual representations were theoretically-\nand value-neutral, eliminating judgment, at least compared to verbal\nexpressions (and theoretical statements) (ibid., 234).\n\nThe interest in cognitive psychology, child psychology and child\nwelfare, and the anti-metaphysical and epistemological value of\nempiricism led him to defend the value of visual education. Quoting\nfrom the Victorian self-improvement author Samuel Smiles, he declared\nthat ‘all persons are more or less apt to learn through the eyes\nrather than the ear… especially the case in early youth, when\nthe eye is the chief inlet of knowledge’ (Neurath 1946, 100).\nThis approach was consistent with Montessori’s and other\ncontemporary educational theories as well as with scientific\neducation. He repeatedly pointed to another Victorian hero of his,\nBritain’s foremost experimental scientist and popular science\neducator, Michael Faraday, and his Course of Six Lectures\non the Chemical History of a Candle (1861), which was intended\nprimarily for children. Given the importance he placed on scientific\ninformation, also socially, the main challenge he routinely took up\nbecame the concretization of abstract information, especially the\nvisual communication of statistical information. More generally, he\nbelieved that visual education provided a unifying framework that\nbridged the gap between science and the humanities (Neurath 1945/1973,\n234). \n\nEducation requires simplification, that is, the empiricist\nnotion of abstraction in the face of the complexity of facts.\nTeaching requires knowing what to leave out, what counts as\nsuperfluous detail and accuracy: ‘he who knows best what to omit\nis the best teacher’ and so ‘to remember simplified\npictures is better than to forget accurate figures’ (Neurath\n1933/1973, 220 and 1945a, 440). The graphic, visual counterpart of\nthis point constitutes the basis for his design of ISOTYPE icons, by\nanalogy with the method of silhouettes, so popular in Austrian art, as\na form of visual abstraction for the communication of information\nabout types or general concepts. The approach was consistent with the\nempiricist anti-metaphysical spirit and Bauhaus and modernist\naesthetic of the rejection of ornament famously advocated by the\nViennese architect Adolf Loos in Ornament and Crime (1908)\nalso echoed by Neurath in 1926: ‘the time of ornaments is\nover’ (recounted by Ernst Niekisch in Neurath 1973, 22).\n\nReinforced by the Viennese School Reform movement led by Glöckel,\nhis scientific attitude, and the philosophy of logical empiricism, was\nthe scientific and empirical attitude towards models of education.\nThis applied to the methods and tools of visual education in two ways:\nby applying accepted recent ideas from empirical disciplines such as\ndevelopmental psychology, anthropology, art history, even ideas by his\nEncyclopedia co-editor Charles Morris in his Foundations of a\nTheory of Signs (Morris 1938); and by testing the end-products,\nalbeit with different degrees of rigor (see the supplementary document\non\n Visual Education).\n\nNeurath was aware of the values and limitations of the elements of\nvisual education (see below), and admitted the diversity of tools and\nvalues with the same kind of pluralism, holism and\npragmatism he adopted in his economic theory and more general\nscientific epistemology: each educational media had educational\ncharacteristics of each own that are incomparable and non-additive,\ncannot be ranked and serve different purposes (Neurath 1944, 56,\nNeurath 1945/1973, 238 and Neurath 1946, 99).\n\nThe sensual dimension of education is part of the larger goal of\nhumanization: the elimination of secret knowledge and\nexclusive communities. Education involves the language of daily life\nand the avoidance of unnecessary technical terms, and thereby enables\norganized humanity, including international cooperation (Neurath\n1945/1973, 231). \n\nMore intellectually, education involves comparison (Neurath\n1945/1973, 238). But the comparative analysis, which Hume made a\nstaple of empiricist methodology, does not exhaust the gamut of\nintellectual values. The exploration of incomparable or alternative\npossibilities, as was illustrated by the cases of economic and social\ntheory, practical rationality and scientific method (see the\nsupplementary document\n Political Economy),\n is a key cognitive goal of education that was to make the other\nspecific practices possible (logically and psychologically). He called\nthis meditation: besides handing out knowledge, education\ninvolves a transfer of criticism, a meditative mood and atmosphere,\nand the ability to consider matter under discussion from all sides\n(possible and actual perspectives within the pluralistic attitude)\n(ibid., 233).\n\nEducation should discourage narrow specialization. Since the holistic\nand synthetic model of socialization, epistemology and science\nrequires the consideration of alternative perspectives and the\nintegration of different kinds of knowledge. Neurath praised the\nDanish pedagogical model of university education, a Philosophy Faculty\nin the medieval comprehensive, universalist spirit of the scholastic\nmeaning of ‘university’. In the setting of one of the\nCongresses of the Unity of Science Movement, he praised the\nrequirement at University of Copenhagen of mandatory science and\nphilosophy courses for students of all specialties, and Joerg\nJoergensen’s lectures on scientific thinking based on historical\nexplanation and logical reasoning (Neurath 1938).\n\nEducation depends on intellectual ethos and social values as\nwell. Education includes what he called also the habits of scientific\nattitude: habits of ‘sincerity of research and\nintegrity of arguing’ (Neurath 1946/1973, 233).\nEducation involves also tolerance: the transfer of tradition\nis a preference within one community, not an expression of an absolute\nhigher point of view above other communities, also a preference among\nothers within that community independent of that tradition\n(ibid., 229). \n\nThe social dimension was a recurring theme even though with changing\nconnotations or emphasis, from post-WWI socialism to post-WWII\ninternationalism. Public education was dependent on an institutional\nbasis consisting of a number of institutions: schools, museums and\nother places holding public exhibitions, and periodicals (Neurath\n1931/1973, 222). Neurath was director of the Social and Economic\nMuseum in Vienna from 1924 until 1934. Not coincidently, his cousin\nWaldemar Kaempffert planned and proceeded along lines similar to\nNeurath’s during his tenure as director of the Museum for\nScience and Industry of Chicago from 1928 until 1931.\n\nThe social dimension extended to groups, generations and nations\nrelated by education as the process of group transfer of\ntraditions: ‘Education may be regarded as the transfer of\ncertain traditions in a more or less systematized way, from one person\nto another person, from one group of persons to another group,\nparticularly from one generation to the next. It is also the transfer\nof tradition from one nation to another’ (Neurath 1945/1973,\n228).\n\nIt also extended to political arrangements, from socialism\nand democracy to ideals of international\ncooperation. The earlier views emphasized the socialist\nsignificance of education as condition of democracy in the form of\ninformed participation and of cooperation, since ‘successful\ncollaboration is possible only when those who act fix on one\npossibility, whether by agreement or by propaganda’ (Neurath\n1928/1973, 293). Education as spreading of knowledge is required for\neveryone involved in taking common decisions and hence for the working\nof democracy (Neurath 1945/1973, 230). Democratic society, Neurath\nconcluded, requires a common language (ibid., 247). Post-WWII\ninternationalism became a motivation for visual education\n(ibid., 234, 247). Common language without common laws and\ncommon language for common knowledge and cooperation, rendered visual\nlanguage a socio-political tool, as the non-dictatorial basis for a\npotential human brotherhood (ibid., 248). In both contexts,\nNeurath offered a criticism of elitist individualistic teaching with a\ncontrast between Anglo-Saxon education methods linked to empiricism\nand utilitarianism and Nazi education linked to German romanticism and\ntranscendentalism (Neurath 1945b, 370–1).\n\nThe social and political valence of education provided the framework\nfor linking education to social structures such as entrenched\ninstitutions, techniques and habits involving advertising and\nentertainment that supported the relevant cognitive models such as\nvisual media: ‘Modern man is conditioned by the cinema and a\nwealth of illustrations. He gets much of his knowledge during leisure\nhours in the most pleasing way through his eyes. If one wants to\nspread social knowledge, one should use means similar to modern\nadvertisement’ (Neurath 1925/1973, 214). In the latter context,\nNeurath stressed the superiority of visual education to verbal\neducation as the basis for international or general education:\n‘words divide, pictures unite’ (Neurath 1931/1973, 217).\n\n5.3 Philosophy of the social sciences\n\nAs in the case of philosophy of psychology, Neurath’s\nphilosophical theory of the social sciences was his attempt at a\nparadigmatic application of the logical empiricist framework that\nreplaced philosophy as a speculative and autonomous source of\nknowledge. Philosophy was now the reflexive perspective of unified\nscience and it was constituted by two meta-theoretical approaches to\nscience: logical analysis and empirical theory, that is, the\n‘logic of science’—emphasized by Carnap— and\nthe ‘behavioristics of science’—emphasized by\nNeurath. The non-formal, empirical, perspective, allied to the\n‘scientific attitude’, became in 1931 Neurath’s\nphysicalism, his compromise between empiricism and\nmaterialism—Mach and Marx—; this was also his attempt at a\nresolution of the conflict between experience and objectivity (of\nscientific knowledge), which Carnap attempted through the formal\naspect of structural descriptions and logical relations. \n\nWork on the foundation of the social sciences, a critical\nmeta-theoretical discussion, was of special importance to Neurath as a\ncore motivation behind the very program of logical empiricism. Because\nknowledge is a tool (whether propaganda or reform), only the best\npossible tool would help transform society. Science was precisely the\nantidote to the speculative, metaphysical, philosophical discourses\nbehind much racist, classist, nationalistic and oppressive ideology,\npolitics and social theory. In this sense, Neurath’s exposition\nof his own social and economic views was from the beginning of his\ncareer inseparable from an element of meta-theoretical or\nphilosophical discussion and motivation (elicited by the opposition\nfrom the more dominant, orthodox doctrines and their proponents).\nNeurath’s views on the social sciences are also the source of\nmuch of his distinctive, non-reductionistic, views on physicalism and\nunity within the movement of logical empiricism (Cartwright et\nal. 1996).\n\nPhysicalism encompasses psychology, history, economics and sociology\nwithout reducing them to physics. Social sciences are scientific\nwithin the framework of physicalism, namely, insofar as they describe\nconcrete spatially and temporally ordered events and processes and\nmake predictions about them (Neurath 1931b/1973, 325). Social behavior\nis itself a complex and its prediction requires that sociology\nincorporate various sources such as history, ethics, jurisprudence,\neconomics, ethnography, etc. (ibid., 328). For Neurath,\nMarx’s study of capital is important first and foremost as an\ninstance of empirical research that brings together history and\neconomics, and the most complete case of physicalist sociology\n(ibid., 349). Sociology is a synthetic effort part of in turn\na larger synthetic effort that is unified science, the set of all\nconnectible languages and laws required to describe and predict order.\nThe synthetic dimension is inseparable from the empirical one: It is\nthe formal, linguistic and conceptual, expression of the totalistic,\nholist approach required by the conception of empirical reality as a\ncomplex, including the phenomena of ‘concrete ways of\nlife’. Empirically determinable behaviors are partial\ndescriptions, separations, for instance ‘peoples’ are\n‘loosely separable sections of the mass of men’\n(ibid., 332). In general, concreteness and complexity are\ncharacteristics of reality that language expresses, especially\nunanalyzed and imprecise cluster (Ballung)-type terms.\n\nThe alliance between unity and empiricism, or physicalism, is thrown\ninto further relief by contrast with the post-Diltheyan German\nsociology of Windelband, Rickert, Sombart and especially Weber. They\ndistinguished between the natural and the social sciences and, as\ndistinctive feature of the latter, in Weber’s sociology there\nappear non-scientific, non-behavioristic entities and activities such\nas the spirit of the age (Zeitgeist), and empathy or\nunderstanding, poetic activity that grounds what he calls\n‘Verstehende sociology’ (ibid., 353).\nNeurath’s was willing to accept the use of such concepts\nprovided they could be given a physicalistic meaning. \n\nNeurath emphasized attention to individuals and groups, individuated\nin terms of stimulus/response interrelationship and clusters of shared\ncustoms and habits, and, for instance, the transfer of such habits or\ntraditions (ibid., 371), which is how he defined education\n(see above). The empirical conceptualization of the social units is\nGestalt-like and holistic, like the silhouettes, patterns or profiles\nof total life plans: ‘Peoples, states, age groups, religious\ncommunities, all are complexes built up of single individuals. Such\ncomposite groups have certain interconnections which are ruled by\nlaws, and they have a definite ‘physiognomy’. The separate\nfeatures of these complexes are not independent of each other but are\nrelated’ (ibid., 387). Decisions and predictions, as in\nthe case of social planning, often involved the ‘comparison of\ntotal complexes’ (ibid.).\n\nCiting Mill, Neurath noted that empiricism brings the natural and the\nsocial sciences together, but so do some of its limits. The\nmarkers of empirical science are the practices of observation,\nexperimentation and prediction. Laws are merely vehicles for taking us\nfrom the concrete and unique to the concrete and unique, whether in\nbiology or history. Sociology is like geology and biology in that the\npossibility of many experiments is prevented by certain\nconstraints of ethical values or scale (ibid., 365).\nPredictability is characterized by nine conditions. It is\nbased on (1) the availability of generalizations about groups and (2)\nstable conditions, or control, and for a limited period. Control is a\nkey notion that connects empiricism and engineering, mechanical and\nsocial. Neurath didn’t think that laws of physics, for instance,\nare in that sense more universal or unconditioned:\n‘Mariotte’s law in physics holds only within certain\nlimits’ (ibid., 331). (3) Correlations on which\npredictions are based are the product of induction, and inductive\nconclusions, in sociology as elsewhere, are based on a decision\n(Neurath 1931b/1973, 407). (4) Moreover, sociology, like the natural\nsciences, often has recourse to information, including laws, from\nother disciplines, in a local synthetic effort of predictive value\n(ibid., 364). (5) Holism prevents sociology from the\n‘ideal forecast’ associated with the fiction of the\nLaplacean mind and the availability of molecular descriptions of\nindividuals free from instabilities (in a symposium on Pasqual\nJordan’s quantum mechanics, Neurath addressed the new\nperspective from quantum mechanics on the problem of free will and its\nconflict with the determinism (causality) of natural laws as riddled\nwith metaphysics (Neurath 1935)). One may not expect, however, that\naggregations or complexes will be always more predictable than\nindividuals, since the evolution of the complex might depend on the\ninteraction with individuals and the environment in a way affected by\nchance. Instead, it has to make do with ‘rough facts of a\ncomplex character’ (ibid., 405) in a ‘system of\nentangled habits’ (ibid., 371 and 374), and most social\ntypes of behavior in a group are not ‘autonomously\ncomputable’ and have to be regarded as ‘parts of the\ncomplex that is being investigated at the time’, considering\n‘the whole of life’ of the group, since each\n‘historical period = non-analysed complex of conditions’\n(Neurath 1932a/1983, 76 and 85); he would subsequently speak of\naggregations (Neurath 1944a). Any resulting prediction or explanation\n(retrodiction) of individual behavior is an approximation to a\n‘world history without names’. (6) A linguistic\nimplication is that empiricism in general and the social sciences in\nparticular are dependent on non-univocal, indistinct\nterms—‘a “clot” (German Ballung,\nFrench grégat)’—, in both protocol\nstatements (see above) and theories insofar as they are sensitive to\ncultural phenomena and historically inherited concepts that cannot be\nusefully replaced with precise technical terms of the ‘modern\ninternational folklore’ (Neurath 1944a, 5–7, 18). (7) The\n‘multivocality’ of the relation between phenomena and\ntheoretical interpretations is more pervasive than the sort of\npluralism Duhem noted in physics, and leads Neurath to speak of\n‘pluri-items’ (ibid., 14). (8) Certain phenomena\nor entities such as inventions can only be predicted provided one has\nalso the means to create them (Neurath 1931b/1973, 405); this insight\nis typically attributed to the critic of Neurath Popper, who published\nit much later. (9) Sociological predictions are co-determinants in the\noccurrence of the predicted event, for instance a position in the\nstock market or a political revolution (ibid., 405); the\nprediction may have a reinforcing or a preventive character (he wrote\nabout self-fulfilling prophecies as early as 1921, in his polemic\nagainst Spengler; Neurath 1921). Theory becomes part of practice;\nscientist becomes part of the social scene (ibid., 406).\n\nA related issue is Max Weber’s issue of value-freedom,\nand objectivity, in the social sciences. Neurath noted that all\nsciences are based on values that determine the choice of relevant\naspects, phenomena, quantities, etc. This is not just consistent with,\nbut an implication of his voluntarism and his\n‘rationalism’. Value-free methods are not essential for\nscientific practice. The formulation of a question or the choice of a\nquantity might be value-dependent but their respective answer or\nmeasurement will not be so in the same sense (ibid.,\n364–5). Neurath formulated the same idea in terms of\ntheory-dependence: the putting right questions and making the right\nobservations require a ‘meta-concept’ or an\n‘approximate theory’ (ibid., 388–89).\n\nIn spite of these caveats, the value of the social sciences remains\nattached to the value of empirical knowledge and the scientific\nattitude in the social roots of our life: ‘Even where\nsociologists cannot make predictions, they may provide men of action\nor meditation with empiricist material. (…) We argue\ndifferently and act differently when we know the material provided by\nthe social sciences. (…) altering our scientific language is\ncohesive with altering out social and private life’ (Neurath\n1944a, 46).\n\nFinally, we should address the reflexive value of the social sciences\ninsofar as science plays the meta-theoretical and critical role of\nphilosophy, displacing any alternative, autonomous and speculative\nsource of insight. History of science, for instance, will require\nadequate classifications for the purposes of advancing correlations.\nIn that regard, it will benefit from avoiding narrow dichotomies of\nclassification and adopt, instead, the notion of theory –\napplied in economic planning – that aims at exploring all\npossibilities in the form of a matrix of combinations, realized and\nunrealized (in the tradition of encyclopedic and symbolic calculus of\nLlull and Leibniz). Neurath himself provided an application to the\ncase of optics (Neurath 1916/1983 and Neurath 1944a, 42). Similarly\nfor sociology, the search of an adequate classification of hypotheses\nin the first step. Notice, however, that the epistemological\nrelativism associated with logical empiricism is not the outcome\nsolely of such external sociological perspective or naturalistic and\nempirical considerations about scientific practice, but the\nphilosophical rejection of Kant’s synthetic a priori and, as\nalternative to Kant’s approach to apriorism, the development of\nconventionalism by Carnap, Reichenbach and others inherited from\nDuhem, Poincaré and others concerning the exact sciences\n(Nemeth 2007, 283–4). Otherwise, Neurath pointed to the\nreflexivity of the social character of science itself and declared\nthat sociologists argued, decided and acted in science as they\nthemselves and others do in society. They are on the same boat with\nus; the boat of social sciences is just like that of the unified\nscience and of social planning itself. This notion of social\nscientists, thinking up and putting in place possibilities under\nconditions of uncertainty, prompted Neurath’s final version of\nthe boat analogy:\n\n\nImagine sailors, who, far out at sea, transform the shape of their\nclumsy vessel from a more circular to a more fishlike one. They make\nuse of some drifting timber, besides the timber of the old structure,\nto modify the skeleton and the hull of their vessel. But they cannot\nput the ship in dock in order to start from scratch. During their work\nthey stay on the old structure and deal with heavy gales and\nthundering waves. In transforming their ship they take care that\ndangerous leakages do not occur. A new ship grows out of the old one,\nstep by step—and while they are still building, the sailors may\nalready be thinking of a new structure, and they will not always agree\nwith one another. The whole business will go on in a way that we\ncannot even anticipate today. That is our fate. (Neurath 1944a,\n47)\n\n\nCriticisms came from Viennese social scientists such as Karl Menger,\nEdgar Zilsel and Felix Kaufmann. Zilsel, an ally of the Circle,\nobjected to the programmatic nature of Neurath’s foundational\nwork, namely, that it was empiricism without empirical research. They\nall objected to the narrow strictures on the relation between the\nnatural and the human sciences imposed by physicalism. Kaufmann, in\nparticular, defended a phenomenological sociology, following Husserl\nmuch more closely than Carnap especially did, based on the value of\nintrospective experience, although without the scientifically\nmysterious Weberian method of empathy (Uebel 2007, 255–57).\n\nZilsel, Frank and Neurath had learned from Mach the value of history\nas a creative source of theoretical possibilities and critical\nperspective. Mach had called his approach ‘historical-critical\nmethod’ which echoed in his heirs’ ears with relevant\nreferences to Kant and Marx, and was understood to support the\nrejection of superhuman metaphysical inevitability. Like Reichenbach,\nZilsel replaced the Kantian inquiry into the preconditions of the\npossibility scientific knowledge with more modest and\nanti-metaphysical projects, in his case, centered on the\nempirical—social political, economic-preconditions. Later on,\nPhilip Frank advocated the empirical historical studies of science as\npart of the more complete answer to the question of the choice of\nhypotheses raised by Duhem and Poincaré, and the insufficiency\nof the logical inference that grounded their conventionalism. These\nare important sources and precedents of modern empirical studies of\nscience.\n",
    "bibliography": {
        "categories": [
            "Primary Literature: Neurath’s Works",
            "Primary works by other authors and secondary Literature"
        ],
        "cat_ref_text": {
            "Primary Literature: Neurath’s Works": [
                "</h3>\n<ul class=\"hanging\">",
                "1909a,‘Ernst Schröders Beweis des 12. Theorems:\nFür die identischen Operationen gilt das\n’Kommutationgesetz’’, in Neurath 1981, 1-3.",
                "1909b, ‘Eindeutigkeit und Kommutativität’, in\nNeurath 1981, 17-18.",
                "1909c, <em>Antike Wirtschaftgeschichte</em>, Leipzig:\nTeubner.",
                "1910a, ‘Definitionsgleicheit und symbolische\nGleicheit’, in Neurath 1981, 19-21.",
                "1910b, ‘On the Theory of Social Science’, in Neurath\n2004, 265-91.",
                "1910c, <em>Lehrbuch der Volkwirtschaftslehre</em>, Vienna:\nHölder.",
                "1911, ‘Nationalökonomie und Wertlehre’,\n<em>Zeitschrift für Volkswirtschaft, Sozialpolitik und\nVerwaltung</em>, 20: 52–114.",
                "1912/1973, ‘The Problem of the Pleasure Maximum’, in\nNeurath 1973, 113–22.",
                "1913/1983, ‘The Lost Wanderers of Descartes and the\nAuxiliary Motive (On the Psychology of Decision)’, in Neurath\n1983, 1–12.",
                "1916/1983, ‘On the Classification of Systems of\nHypotheses’, in Neurath 1983, 13–31.",
                "1917/2004, ‘The Conceptual Structure of Economics and Its\nFoundation’, in Neurath 2004, 312–344.",
                "1919/1973, ‘Through War Economy to Economy in Kind’,\nin Neurath 1973, 123–157.",
                "1920/1973, ‘Socialization of Bavaria’, in Neurath\n1973, 18–28.",
                "1920/2004, ‘A System of Socialization’, in Neurath\n2004, 345–370.",
                "1921/1973, ‘Anti-Spengler’, in Neurath 1973,\n158-213.",
                "1925/1973, ‘The Social and Economic Museum in Vienna’,\nin Neurath 1973, 214.",
                "1928/1973, ‘Personal Life and Class Struggle’, in\nNeurath 1973, 249–98.",
                "1930/1983, ‘Ways of the Scientific World Conception’,\nin Neurath 1983, 32–47.",
                "1931a/1973, ‘Visual Education and the Social and Economic\nMuseum in Vienna’, in Neurath 1973, 215–218.",
                "1931b/1973, ‘Empirical Sociology’, in Neurath 1973,\n319–421.",
                "1931a/1983, ‘Physicalism: The Philosophy of the Vienna\nCircle’, in Neurath 1983, 48–51.",
                "1931b/1983, ‘Physicalism’, in Neurath 1983, 52-7.",
                "1932a/1983, ‘Sociology in the Framework of\nPhysicalism’, in Neurath 1983, 58–90.",
                "1932b/1983, ‘Protocol Statements’, in Neurath 1983,\n91–99.",
                "1933, ‘L’Urbanisme et le Lotissement du Sol en\nRepresentation Optique d’après la Méthode\nViennoise’, <em>Annales Techniques</em> 44–46,\n1153–4.",
                "1933/1987, ‘Unified Science and Psychology’, in B.\nMcGuinness 1987, ed., <em>Unified Science</em>, Dordrecht: Reidel,\n1–23.",
                "1934/1983, ‘Radical Physicalism and “the Real\nWorld”’, in Neurath 1983, 100–14.",
                "1935/1983, ‘Pseudorationalism of Falsification’, in\nNeurath 1983, 121–31.",
                "1935/1987, ‘What Is Meant by a Rational Economic\nTheory?’, in B. McGuinness 1987, ed., <em>Unified Science</em>,\nDordrecht: Reidel, 67–109.",
                "1936/1983, ‘Encyclopedia as Model’, in Neurath 1983,\n145–58.",
                "1937a/1983, ‘Unity of Science and its Encyclopedia’,\nin Neurath 1983, 172–82.",
                "1937b/1983, ‘The Departmentalization of Unified\nScience’, in Neurath 1983, 200–5.",
                "1938, ‘Encyclopedism as a Pedagogical Aim: A Danish\nApproach’, <em>Philosophy of Science</em>, 5(4):\n484–92.",
                "1939, <em>Modern Man in the Making</em>, New York: Knopf.",
                "1941/1983, ‘Universal Jargon and Terminology’, in\nNeurath 1983, 213–29.",
                "1942/1973, ‘International Planning for Freedom’, in\nNeurath 1973, 442–70.",
                "1943, ‘Planning or Managerial Revolution?’ <em>The New\nCommonwealth Quarterly</em>, 8(4): 148–54.",
                "1944a, <em>Foundations of the Social Sciences</em>, in O. Neurath,\nR. Carnap, Ch. Morris, eds., <em>International Encyclopedia of Unified\nScience</em>, vol. 2, n.1, Chicago: University of Chicago Press.",
                "1944b, ‘Visual Aids and Arguing’, <em>New Era</em>,\n25(3): 51–61.",
                "1945a, ‘Education Through the Eye’, <em>Journal of\nEducation</em>, 77: 914.",
                "1945b, ‘German Education and Democracy’, <em>Journal\nof Education</em>, 77: 370–1.",
                "1945/1973, ‘Visual Education: Humanisation versus\nPopularisation’, in Neurath 1973, 227–248.",
                "1945/2004, ‘Alternative to Market Competition. Review of\n<em>The Road to Serfdom</em>’, in Neurath 2004,\n546–548.",
                "1946, ‘From Hieroglyphics to Isotypes’, extracts from\na visual autobiography, with introduction by Paul Rotha, in <em>Future\nBooks</em>, 46(3): 92–100.",
                "1973, <em>Empiricism and Sociology</em>, R. S. Cohen and M.\nNeurath, eds., Dordrecht: Reidel.",
                "1981, <em>Gesammelte philosophische und methodologische\nSchriften</em>, R. Haller and H. Rutte, eds., Vienna:\nHölder-Pichler-Tempsky.",
                "1983, <em>Philosophical Papers 1913-1946</em>, R.S. Cohen and M.\nNeurath, eds., Dordrecht: Reidel.",
                "1991, <em>Gesammelte bildpädagogische Schriften</em>, R.\nHaller and R. Kinross, eds., Vienna: Hölder-Pichler-Tempsky.",
                "1994, <em>Otto Neurath oder Die Einheit von Wissenschaft und\nGesellschaft</em>. P. Neurath and E. Nemeth (eds.), Vienna:\nBöhlau.",
                "1998, <em>Gesammelte ökonomische, soziologische und\nsozialpolitische Schriften</em>, vols. 1 and 2. R. Haller and U.\nHoefer, eds., Vienna: Hölder-Pichler-Tempsky.",
                "2004, <em>Selected Economic Writings</em>, R.S. Cohen and T.E.\nUebel (eds.), Dordrecht: Kluwer.\n</ul>\n<h4>Collaborative Works</h4>\n<ul class=\"hanging\">",
                "Carnap, R., H. Hahn and O. Neurath, 1929/1973, ‘The\nScientific Conception of the World: The Vienna Circle’, in\nNeurath 1973, 299–318.",
                "Carnap, R., Ch. Morris, and O. Neurath (eds.), 1970,\n<em>Foundations of the Unity of Science. Towards an International\nEncyclopedia of Unified Science</em>, vols. 1 and 2, Chicago:\nUniversity of Chicago Press.",
                "Hahn, O. and O. Neurath, 1909, ‘Zum Dualismus in der\nLogik’, in Neurath 1981, 5-16.\n</ul>\n<h3>"
            ],
            "Primary works by other authors and secondary Literature": [
                "</h3>\n<ul class=\"hanging\">",
                "Anderson, D., 2019, ‘Rejecting Semantic Truth: On the\nSignificance of Neurath’s Syntacticism’, in Cat and Tuboly\n(eds.) 2019, 363-82.",
                "Ballod, K./Atlanticus (pseud.), 1898, <em>Produktion und Konsum im\nSozialstaat</em>, Stuttgart: Dietz.",
                "Bartley, W.W., 1973, <em>Wittgenstein</em>, New York: J.B.\nLippincott.",
                "Blaug, M., 1996, <em>Economic Theory in Retrospect</em>,\nCambridge: Cambridge University Press.",
                "–––, 1997, <em>Great Economists Before\nKeynes</em>, Cheltenham: Edward Elgar.",
                "Bloor, D., 1997, <em>Wittgenstein, Rules and Institutions</em>,\nLondon: Routledge.",
                "Boon, T., 2008, <em>Films of Fact. A history of Science in\nDocumentary Films and Television</em>, London: Wallflower Press.",
                "Bühler, K., 1927, <em>Die Krise der Psychologie</em>, Jena:\nFischer.",
                "Burke, C., E. Kindel and S. Walker, eds., 2014, <em>Isotype.\nDesign and Contexts 1925-1971</em>, London: Hyphen Press.",
                "Burke, M. and T. Haggitt, 1999, ‘Words Divide; Pictures\nUnite. Otto Neurath and British Propaganda Films of the Second World\nWar’, <em>Imperial War Museum Review</em>, 12: 59–71.",
                "Carnap, R., 1928, <em>Der logische Aufbau der Welt</em>, Berlin:\nBernary.",
                "–––, 1932/1987, ‘On Protocol\nSentences’, <em>Noûs</em>, 21: 457–470.",
                "–––, 1932/1934, <em>The Unity of Science</em>,\nLondon: Kegan Paul, Trench, Teubner and Co.",
                "–––, 1934/1937, <em>The Logical Syntax of\nLanguage</em>, London: Kegan Paul, Trench, Trubner and Co.",
                "Cartwright, N., J. Cat, L. Fleck and T.E. Uebel, 1996, <em>Otto\nNeurath: Philosophy Between Science and Politics</em>, Cambridge:\nCambridge University Press.",
                "Carus, A.W., 2019, ‘Neurath and Carnap on Semantics’,\nin Cat and Tuboly (eds.) 2019, 339-62.",
                "Cat, J., 1995, ‘The Popper-Neurath Debate and\nNeurath’s Attack on Scientific Method’, <em>Studies in the\nHistory and Philosophy of Science</em>, 26(2): 219–250.",
                "–––, 2005, ‘Switching Gestalts on Gestalt\nPsychology: On the Relation Between Science and Philosophy’,\n<em>Perspectives on Science</em>, 15(2): 131–177.",
                "–––, 2019, ‘Neurath and the Legacy of\nAlgebraic Logic’, in Cat and Tuboly (eds.) 2019, 241-338.",
                "Cat, J., N. Cartwright and H. Chang, 1991, ‘Otto Neurath:\nUnification as the Way to Socialism’, in J. Mittelstrass, ed.,\n<em>Einheit der Wissenschaften</em>, Berlin: de Gruyter.",
                "–––, 1996, ‘Otto Neurath: Politics and the\nUnity of Science’, in P. Galison and D. Stump, eds., <em>The\nDisunity of Science</em>, Stanford: Stanford University Press,\n347–69.",
                "Cat, J. and A. T. Tuboly (eds.), 2019, <em>Neurath Reconsidered.\nNew sources and Perspectives</em>, Cham: Springer.",
                "Chaloupek, G.K., 1990, ‘The Austrian Debate on Economic\nCalculation in a Socialist Economy’, <em>J. History of Political\nEconomy</em>, 22: 659–75.",
                "Chang, R. (ed.), 1997, <em>Incommensurability and Practical\nReason</em>, Cambridge, MA: Harvard University Press.",
                "Church, A., 1936, ‘A Bibliography of Symbolic Logic’,\n<em>Journal of Symbolic Logic</em>, 1(4): 121-216.",
                "Dahms, H-J., 2001/2004, ‘Neue Sachlichkeit in der\nArchitektur und Philosophie der zwanziger Jahre’,\n<em>Zeitschrift fuer Architektur und Staedtebau</em>, Mai 2001,\n82–7, translated as ‘<em>Neue Sachlichkeit</em> in the\nArchitecture and Philosophy of the 20s’, in S. Awodey and C.\nKlein, eds., 2004, <em>Carnap Brought Home: The View from Jena</em>,\nChicago: Open Court, 357–75.",
                "Duhem, P., 1906, <em>La Théorie Physique: Son Objet et sa\nStructure</em>, Paris: Vrin.",
                "Faludi, A., 1989, ‘Planning According to the\n‘Scientific Conception of the World’: the Work of Otto\nNeurath’, <em>Environment and Planning D: Society and\nSpace</em>, 7: 397–418.",
                "Fechner, G, 1860, <em>Elemente der Psychophysik</em>, 2 vols.,\nLeipzig: Breitkopf and Hartl.",
                "Feyerabend, P.K., 1975, <em>Against Method: Outline of an\nAnarchistic Theory of Knowledge</em>, London: Verso.",
                "Friedman, M., 1999, <em>Reconsidering Logical Positivism</em>, New\nYork: Cambridge University Press.",
                "Galison, P., 1990, ‘Aufbau/Bauhaus: Logical Positivism and\nArchitectural Modernism’, <em>Critical Inquiry</em>, 16:\n709–52.",
                "–––, 1996, ‘Constructing Modernism: The\nCultural Location of <em>Aufbau</em>’, in R.N. Giere and A.W.\nRichardson (eds.), <em>Origins of Logical Empiricism</em>, Minnesota\nStudies in the Philosophy of Science VXI, Minneapolis: University of\nMinnesota Press, 17–44.",
                "Gattei, S., 2004, ‘Karl Popper’s Philosophical\nBreakthrough’, <em>Philosophy of Science</em>, 71:\n448–466.",
                "Grierson, J., 1939, ‘Searchlight on Democracy’,\n<em>Documentary Newsletter</em>, December 1939; reprinted in Forsyth\nHardy (ed.), <em>Grierson on Documentary</em>, London: Faber &amp;\nFaber: 227–237.",
                "–––, 1941, <em>Education and the New Order</em>,\nToronto: Canadian Association for Adult Education",
                "Grimmer-Solem, E., 2003, <em>Economics and Social Reform in\nGermany 1864–1894</em>, Oxford: Oxford University Press.",
                "Groß, A., 2019, ‘Generating Cognitive Tools:\nNeurath’s Educational Ideal and the Concept of Isotype’,\nin Cat and Tuboly (eds.) 2019, 177-96.",
                "Hacohen, M., 2000, <em>Karl Popper. The Formative Years,\n1902–1945</em>, New York: Cambridge University Press.",
                "Hahn, O., 1909, ‘Zur Axiomatik des logischen\nGebietkalkuls’, <em>Archiv für systematische\nPhilosophie</em> 15, 345–7; English translation in Cat and\nTuboly (eds.) 2019, 507–9.",
                "–––, 1910,‘Über die Koeffizienten\neiner logischen Gleichung und ihre Beziehung zur Lehre von den\nSchlüssen’, <em>Archiv für systematische\nPhilosophie</em>, 16: 149-176.",
                "Haller, R., 1982, ‘The Neurath Principle: Its Grounds and\nConsequences’, in Uebel 1991, 117–30.",
                "Hardcastle, G., 2007, ‘Logical Empiricism and the Philosophy\nof Psychology’, in Richardson and Uebel, eds., 2007,\n228–249.",
                "Hayek, F.A. von, ed., 1935, <em>Collectivist Economic Planning.\nCritical Studies on the Possibilities of Socialism</em>, London:\nRoutledge.",
                "Henning, M. 2019, ‘Of Tennis Courts and Fireplaces:\nNeurath’s Internment on the Isle of Man and his Politics of\nDesign’, in Cat and Tuboly (eds.) 2019, 413–34.",
                "Humphrey, G., 1951, <em>Thinking</em>, London: Methuen and\nCo.",
                "Janik, A. and S. Toulmin, 1973, <em>Wittgenstein’s\nVienna</em>, New York: Simon and Schuster.",
                "Kaempffert, W., 1938, ‘Towards Bridging the Gaps Between the\nSciences’, <em>New York Times Book Review</em>, August 7, 1938,\npp. 2, 18.",
                "–––, 1939, ‘The Facts March On—with\nNeurath’, <em>Survey Graphic</em>, 28 (September 1939):\n538–40.",
                "Kinross, R., 1990, ‘Emigré Graphic Designers in\nBritain: Around the Second World War and Afterwards’, J. of\n<em>Design History</em>, 3(1): 35–57.",
                "Körber, S., ‘Thinking about the “Common\nReader”: Otto Neurath, L. Susan Stebbing and the (Modern)\nPicture-Text Style’, in Cat and Tuboly (eds.) 2019, 451-70.",
                "Kramer, R., 1988, <em>Maria Montessori: A Biography</em>, Boulder:\nWestview Press.",
                "Kraeutler, H., 2008, <em>Otto Neurath. Museum and Exhibition\nWork</em>, Frankfurt: Peter Lang.",
                "Kripke, S., 1989, <em>Wittgenstein on Rules and Private\nLanguage</em>, Oxford: Blackwell.",
                "Lavoie, D., 1985, <em>Rivalry and Central Planning. The Socialist\nCalculation Debate Reconsidered</em>, Cambridge: Cambridge University\nPress.",
                "Lewis, C.I., 1918, <em>A Survey of Symbolic Logic</em>, Berkeley:\nUniversity of California Press.",
                "Lindenfeld, D., 1997, <em>The Practical Imagination. The German\nSciences of State in the Nineteenth Century</em>, Chicago: Chicago\nUniversity Press.",
                "Low, R., 1979, <em>The History of the British Film 1929-1939.\nDocumentary and Educational Films of the 1930s</em>, London: Allen and\nUnwin.",
                "Lupton, E., 1986, ‘Reading Isotype’, <em>Design\nIssues</em>, 3(2): 47–58.",
                "Martínez-Alier, J., 1987, <em>Ecological Economics.</em>\n<em>Energy, Environment and Society</em>, Oxford: Basil\nBlackwell.",
                "Marx, K., 1887/1973, <em>Capital</em>, Volume 1, New York: Free\nPress.",
                "Mises, L. von, 1920/1935, ‘Economic Calculation in the\nSocialist Commonwealth’, in Hayek 1935.",
                "–––, 1922/1981, <em>Socialism, an Economic and\nSociological Analysis</em>, Indianapolis: Liberty Fund.",
                "Mooslechner, P., 2008, ‘Neurath on Money: Some Reflections\non Neurath’s Monetary Thought in the Context of the Birth of\nModern Monetary Economics, in Nemeth, E., S.W. Schmitz and T.E. Uebel\n(eds.) 2008, 101–114.",
                "Mormann, T., 1999, ‘Neurath’s Opposition to Tarskian\nSemantics’, in J. Woleński and E. Köhler (eds.) 1999,\n<em>Alfred Tarski and the Vienna Circle</em>, Dordrecht: Springer,\n165-78.",
                "Morris, Ch., 1938, ‘Foundations of the Theory of\nSigns’, <em>International Encyclopedia of Unified Science</em>,\nR. Carnap, Ch. Morris, and O. Neurath (eds.), Volumes 1 and 2,\nChicago: University of Chicago Press.",
                "–––, 1960, ‘On the History of the\nInternational Encyclopaedia of Unified Science’\n<em>Synthese</em>, 12: 517–21.",
                "Müller, K.H.,1991, ‘Neurath’s Theory of\nPictorial-Statistical Representation’, in Uebel (ed.) 1991,\n223–51.",
                "Nemeth 1991, ‘The Unity of Planned Economy and the Unity of\nScience’, in Uebel 1991, 275–84.",
                "–––, 2007, ‘Logical Empiricism and the\nHistory and Sociology of Science’, in Richardson and Uebel\n(eds.) 2007, 278–304.",
                "–––, 2019, ‘Visualizing Relations in\nSociety and Economics: Otto Neurath’s Isotype-Method Against the\nBackground of his Economic Thought’, in Cat and Tuboly (eds.)\n2019, 117-40.",
                "Nemmeth, E. and F. Stadler, eds., 1996, <em>Encyclopedia and\nUtopia. The Life and Work of Otto Neurath (1882–1945)</em>,\nDordrecht: Kluwer.",
                "Nemeth, E. and R. Heinrich, eds., 1999, <em>Otto Neurath:\nRationalität, Planung, Vielfalt</em>, Vienna: Olderbourg.",
                "Nemeth, E., S.W. Schmitz and T.E. Uebel (eds.), 2008, <em>Otto\nNeurath’s Economics in Context</em>,",
                "Neurath, M., 1974, ‘ISOTYPE’, <em>Instructional\nScience</em>, 3: 127–50.",
                "O’Neill, J., 1993, <em>Ecology, Policy and Politics. Human\nWell-being and the Natural World</em>, London: Routledge.",
                "–––, 1995, ‘In Praise of a\nPositivist’, in <em>Radical Philosophy</em>, 74:\n29–58.",
                "–––, 1998, <em>The Market. Ethics, Knowledge and\nPolitics</em>, London: Routledge.",
                "–––, 2002, ‘Socialist Calculation and\nEnvironmental Valuation: Money, Market and Ecology’, <em>Science\nand Society</em>, 66: 137–151.",
                "–––, 2008, ‘Pluralism and Economic\nInstitutions’, in Uebel 2008: 77–100.",
                "Oakes, G., 1988, <em>Weber and Rickert. Concept Formation in the\nCultural Sciences</em>, Cambridge: MIT Press.",
                "Peckhaus, V., 2012, ‘The Reception of Leibniz’s Logic\nin 19th Century German Philosophy’, in R. Krömer and Y.\nChin-Drian, eds., 2012, <em>New essays on Leibniz Reception</em>,\nBasel: Springer.",
                "Peters, M. A., 2001, ‘Philosophy as Pedagogy:\nWittgenstein’s Style of Thinking’ <em>Radical\nPedagogy</em>, 3(3),\n [<a href=\"http://radicalpedagogy.icaap.org/content/issue3_3/4-peters.html\" target=\"other\">Available online</a>].",
                "Poincaré, H., 1906, <em>Wissenschaft und Hypothese</em>,\nLeipzig: Teubner. German translation of <em>La Science et\nl’Hypothèse</em>, Paris: Flammarion.",
                "Polanyi, Michael, 1958, <em>Personal Knowledge</em>, Chicago:\nUniversity of Chicago Press.",
                "Popper, K.R., 1935/1951, <em>Logic of Scientific Discovery</em>,\nLondon: Allen and Unwin.",
                "–––, 1950, <em>The Open Society and its\nEnemies</em>, Princeton: Princeton University Press.",
                "–––, 1957, <em>The Poverty of Historicism</em>,\nBoston: Beacon Press.",
                "Popper-Lynkeus, J., 1912, <em>Die allgemeine Nährpflicht als\nLösung der Sozialen Frage</em>, Dresden: Reisner.",
                "Potochnik, A. and A. Yap, 2006, ‘Revisiting Galison’s\n‘Aufbau/Bauhaus’ in light of Neurath’s Philosophical\nProjects’, <em>Stud. Hist. Phil. Sci.</em>, 37:\n469–488.",
                "Reichenbach, H, 1931/1959, <em>Modern Philosophy of Science</em>,\nLondon: Routledge and Kegan Paul.",
                "Reisch, G.,1994, ‘Planning Science: Otto Neurath and the\nInternational Encyclopedia of Unified Science’, <em>British\nJournal for the Philosophy of Science</em>, 27: 153–75.",
                "–––, 2005, <em>How the Cold War Transformed\nPhilosophy of Science. To the Icy Slopes of Logic</em>, Cambridge:\nCambridge University Press.",
                "–––, 2019, ‘What a Difference a Decade\nMakes: The Planning Debates and the Fate of the Unity of Science\nMovement’, in Cat and Tuboly (eds.) 2019, 385-412.",
                "Richardson, A.W. and T.E. Uebel (eds.), 2007, <em>The Cambridge\nCompanion to Logical Empiricism</em>, New York: Cambridge University\nPress.",
                "Rotha, P., 1936, <em>Documentary Film</em>, London: Faber and\nFaber.",
                "Sandner, G., 2008, ‘Economy, Ideology and Culture: Otto\nNeurath’s Approach to a Precarious Relationship’, in\nNemeth, E., S.W. Schmitz and T.E. Uebel (eds.) 2008,\n141–57.",
                "Sandner, G., 2014, <em>Otto Neurath. Eine politische\nBiographie</em>, Vienna: Paul Zsolnay.",
                "Schlick, M., 1918, <em>Allgemeine Erkenntnislehre</em>, Berlin:\nSpringer.",
                "–––, 1934/1979, ‘The Foundation of\nKnowledge’, in M. Schlick, <em>Philosophical Papers Vol. II\n(1925–1936)</em>, H. L. Mulder and B. van de Velde-Schlick\n(eds.), Dordrecht: Reidel.",
                "Soulez, A. (ed.), 1997, <em>Otto Neurath, un Philosophe entre\nScience et Guerre</em>, Paris: Harmattan.",
                "Stadler, F., 2001, <em>The Vienna Circle. Studies in the Origins,\nDevelopment, and Influence of Logical Empiricism</em>, Dordrecht:\nSpringer.",
                "–––, 2007, The Vienna Circle: Context, Profile\nand Development´, in Richardson and Uebel 2007,\n13–40.",
                "Steele, D., 1999, <em>From Max to Mises. Post-capitalist Society\nand the Challenge of Economic Calculation</em>, Lasalle, IL: Open\nCourt.",
                "Symons, J., O. Pombo and J.M. Torres, eds., 2011, <em>Otto Neurath\nand the Unity of Science</em>, New York: Springer.",
                "ter Hark, M., 2002, ‘Between Autobiography and Reality:\nPopper’s Inductive Years’, <em>Stud. Hist. Phil.\nSci.</em>, 33: 79–103.",
                "Tönnies, F., 1899-1900, ‘Philosophical\nTerminology’, <em>Mind</em>, 8: 289–332, 467–91, and\n9, 46–61.",
                "Tribe, K., 1995, <em>Strategies of Economic Order.</em> <em>German\nEconomic Discourse, 1750–1950</em>, Cambridge: Cambridge\nUniversity Press.",
                "Tuboly, A.T., 2019, ‘United by Action: Neurath in\nEngland’, in Cat and Tuboly, eds., 2019, 89-116.",
                "Turk, M., 2018, <em>Otto Neurath and the History of\nEconomics</em>, New York: Routledge.",
                "Uebel, T.E., ed., 1991, <em>Rediscovering the Forgotten Vienna\nCircle</em>, Dordrecht: Kluwer.",
                "–––, 1992, <em>Overcoming Logical Positivism\nFrom Within. The Emergence of Neurath’s Naturalism in the Vienna\nCircle’s Protocol Sentence Debate</em>, Amsterdam: Rodopi.",
                "–––, 1995a, ‘Otto Neurath’s\nIdealistic Inheritance: The Social and Economic Thought of Wilhelm\nNeurath’, <em>Synthese</em>, 103: 87–121.",
                "–––, 1995b, ‘Wittgenstein and the Vienna\nCircle’, K. Gavroglu, et al., eds., <em>Physics, Philosophy and\nthe Scientific Community</em>, Dordrecht: Kluwer.",
                "–––, 1998, ‘Enlightenment and the Vienna\nCircle’s Scientific World-Conception’, in A.E. Rorty\n(ed.), <em>Philosophers on Education. Historical Perspectives</em>,\nLondon: Routledge.",
                "–––, 2004, ‘Preface’, in Neurath\n2004.",
                "–––, 2007, ‘Philosophy of Social Science\nin Early Logical Empiricism’, in Richardson and Uebel 2007,\n250–77.",
                "–––, 2007, <em>Empiricism at the Crossroads: The\nVienna Circle’s Procol-Sentence Debate</em>, Chicago and\nLaSalle, IL: Open Court.",
                "–––, 2008, ‘Otto Neurath as an Austrian\nEconomist: Behind the Scenes of the Early Socialist Calculation\nDebate’, in E. Nemeth, S.W. Schmitz and T.E. Uebel (eds.) 2008,\n37–60.",
                "–––, 2019, ‘Rationality and\nPseudo-Rationality in Political Economy: Neurath, Mises, Weber’,\nin Cat and Tuboly (eds.) 2019, 197-216.",
                "Vaughn K., 1994, ‘The Socialist Calculation Debate’,\nP., Boettke, ed., <em>The Elgar Companion to Austrian Economics</em>,\nAldershot: Elgar, 478–84.",
                "Vossoughian, N, 2008, <em>The Language of the Global Polis</em>,\nNAi Publishers.",
                "Weber, M., 1921, <em>Gesammelte politische Schriften</em>,\nMünchen: Drei Masken.",
                "Weybright, W., 1936, ‘Social Showman’, <em>Survey\nGraphic</em>, 25(11): 618–9.",
                "Wittgenstein, Ludwig, G. E. M. Anscombe, P. M. S. Hacker, and J.\nSchulte, 2009, <em>Philosophische Untersuchungen</em>\n(<em>Philosophical investigations</em>), Chichester, West Sussex,\nU.K.; Malden, MA: Wiley-Blackwell.",
                "Zemplen, G.A., 2006, ‘The Development of the Neurath\nPrinciple: Unearthing the Romantic Link’, <em>Stud. Hist. Phil.\nSci.</em>, 37: 585–609.",
                "Zolo, D., 1990, <em>Reflexive Epistemology and Social Complexity.\nThe Philosophical Legacy of Otto Neurath</em>, Dordrecht: Kluwer.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3>Primary Literature: Neurath’s Works</h3>\n<ul class=\"hanging\">\n<li>1909a,‘Ernst Schröders Beweis des 12. Theorems:\nFür die identischen Operationen gilt das\n’Kommutationgesetz’’, in Neurath 1981, 1-3.</li>\n<li>1909b, ‘Eindeutigkeit und Kommutativität’, in\nNeurath 1981, 17-18.</li>\n<li>1909c, <em>Antike Wirtschaftgeschichte</em>, Leipzig:\nTeubner.</li>\n<li>1910a, ‘Definitionsgleicheit und symbolische\nGleicheit’, in Neurath 1981, 19-21.</li>\n<li>1910b, ‘On the Theory of Social Science’, in Neurath\n2004, 265-91.</li>\n<li>1910c, <em>Lehrbuch der Volkwirtschaftslehre</em>, Vienna:\nHölder.</li>\n<li>1911, ‘Nationalökonomie und Wertlehre’,\n<em>Zeitschrift für Volkswirtschaft, Sozialpolitik und\nVerwaltung</em>, 20: 52–114.</li>\n<li>1912/1973, ‘The Problem of the Pleasure Maximum’, in\nNeurath 1973, 113–22.</li>\n<li>1913/1983, ‘The Lost Wanderers of Descartes and the\nAuxiliary Motive (On the Psychology of Decision)’, in Neurath\n1983, 1–12.</li>\n<li>1916/1983, ‘On the Classification of Systems of\nHypotheses’, in Neurath 1983, 13–31.</li>\n<li>1917/2004, ‘The Conceptual Structure of Economics and Its\nFoundation’, in Neurath 2004, 312–344.</li>\n<li>1919/1973, ‘Through War Economy to Economy in Kind’,\nin Neurath 1973, 123–157.</li>\n<li>1920/1973, ‘Socialization of Bavaria’, in Neurath\n1973, 18–28.</li>\n<li>1920/2004, ‘A System of Socialization’, in Neurath\n2004, 345–370.</li>\n<li>1921/1973, ‘Anti-Spengler’, in Neurath 1973,\n158-213.</li>\n<li>1925/1973, ‘The Social and Economic Museum in Vienna’,\nin Neurath 1973, 214.</li>\n<li>1928/1973, ‘Personal Life and Class Struggle’, in\nNeurath 1973, 249–98.</li>\n<li>1930/1983, ‘Ways of the Scientific World Conception’,\nin Neurath 1983, 32–47.</li>\n<li>1931a/1973, ‘Visual Education and the Social and Economic\nMuseum in Vienna’, in Neurath 1973, 215–218.</li>\n<li>1931b/1973, ‘Empirical Sociology’, in Neurath 1973,\n319–421.</li>\n<li>1931a/1983, ‘Physicalism: The Philosophy of the Vienna\nCircle’, in Neurath 1983, 48–51.</li>\n<li>1931b/1983, ‘Physicalism’, in Neurath 1983, 52-7.</li>\n<li>1932a/1983, ‘Sociology in the Framework of\nPhysicalism’, in Neurath 1983, 58–90.</li>\n<li>1932b/1983, ‘Protocol Statements’, in Neurath 1983,\n91–99.</li>\n<li>1933, ‘L’Urbanisme et le Lotissement du Sol en\nRepresentation Optique d’après la Méthode\nViennoise’, <em>Annales Techniques</em> 44–46,\n1153–4.</li>\n<li>1933/1987, ‘Unified Science and Psychology’, in B.\nMcGuinness 1987, ed., <em>Unified Science</em>, Dordrecht: Reidel,\n1–23.</li>\n<li>1934/1983, ‘Radical Physicalism and “the Real\nWorld”’, in Neurath 1983, 100–14.</li>\n<li>1935/1983, ‘Pseudorationalism of Falsification’, in\nNeurath 1983, 121–31.</li>\n<li>1935/1987, ‘What Is Meant by a Rational Economic\nTheory?’, in B. McGuinness 1987, ed., <em>Unified Science</em>,\nDordrecht: Reidel, 67–109.</li>\n<li>1936/1983, ‘Encyclopedia as Model’, in Neurath 1983,\n145–58.</li>\n<li>1937a/1983, ‘Unity of Science and its Encyclopedia’,\nin Neurath 1983, 172–82.</li>\n<li>1937b/1983, ‘The Departmentalization of Unified\nScience’, in Neurath 1983, 200–5.</li>\n<li>1938, ‘Encyclopedism as a Pedagogical Aim: A Danish\nApproach’, <em>Philosophy of Science</em>, 5(4):\n484–92.</li>\n<li>1939, <em>Modern Man in the Making</em>, New York: Knopf.</li>\n<li>1941/1983, ‘Universal Jargon and Terminology’, in\nNeurath 1983, 213–29.</li>\n<li>1942/1973, ‘International Planning for Freedom’, in\nNeurath 1973, 442–70.</li>\n<li>1943, ‘Planning or Managerial Revolution?’ <em>The New\nCommonwealth Quarterly</em>, 8(4): 148–54.</li>\n<li>1944a, <em>Foundations of the Social Sciences</em>, in O. Neurath,\nR. Carnap, Ch. Morris, eds., <em>International Encyclopedia of Unified\nScience</em>, vol. 2, n.1, Chicago: University of Chicago Press.</li>\n<li>1944b, ‘Visual Aids and Arguing’, <em>New Era</em>,\n25(3): 51–61.</li>\n<li>1945a, ‘Education Through the Eye’, <em>Journal of\nEducation</em>, 77: 914.</li>\n<li>1945b, ‘German Education and Democracy’, <em>Journal\nof Education</em>, 77: 370–1.</li>\n<li>1945/1973, ‘Visual Education: Humanisation versus\nPopularisation’, in Neurath 1973, 227–248.</li>\n<li>1945/2004, ‘Alternative to Market Competition. Review of\n<em>The Road to Serfdom</em>’, in Neurath 2004,\n546–548.</li>\n<li>1946, ‘From Hieroglyphics to Isotypes’, extracts from\na visual autobiography, with introduction by Paul Rotha, in <em>Future\nBooks</em>, 46(3): 92–100.</li>\n<li>1973, <em>Empiricism and Sociology</em>, R. S. Cohen and M.\nNeurath, eds., Dordrecht: Reidel.</li>\n<li>1981, <em>Gesammelte philosophische und methodologische\nSchriften</em>, R. Haller and H. Rutte, eds., Vienna:\nHölder-Pichler-Tempsky.</li>\n<li>1983, <em>Philosophical Papers 1913-1946</em>, R.S. Cohen and M.\nNeurath, eds., Dordrecht: Reidel.</li>\n<li>1991, <em>Gesammelte bildpädagogische Schriften</em>, R.\nHaller and R. Kinross, eds., Vienna: Hölder-Pichler-Tempsky.</li>\n<li>1994, <em>Otto Neurath oder Die Einheit von Wissenschaft und\nGesellschaft</em>. P. Neurath and E. Nemeth (eds.), Vienna:\nBöhlau.</li>\n<li>1998, <em>Gesammelte ökonomische, soziologische und\nsozialpolitische Schriften</em>, vols. 1 and 2. R. Haller and U.\nHoefer, eds., Vienna: Hölder-Pichler-Tempsky.</li>\n<li>2004, <em>Selected Economic Writings</em>, R.S. Cohen and T.E.\nUebel (eds.), Dordrecht: Kluwer.</li>\n</ul>\n<h4>Collaborative Works</h4>\n<ul class=\"hanging\">\n<li>Carnap, R., H. Hahn and O. Neurath, 1929/1973, ‘The\nScientific Conception of the World: The Vienna Circle’, in\nNeurath 1973, 299–318.</li>\n<li>Carnap, R., Ch. Morris, and O. Neurath (eds.), 1970,\n<em>Foundations of the Unity of Science. Towards an International\nEncyclopedia of Unified Science</em>, vols. 1 and 2, Chicago:\nUniversity of Chicago Press.</li>\n<li>Hahn, O. and O. Neurath, 1909, ‘Zum Dualismus in der\nLogik’, in Neurath 1981, 5-16.</li>\n</ul>\n<h3>Primary works by other authors and secondary Literature</h3>\n<ul class=\"hanging\">\n<li>Anderson, D., 2019, ‘Rejecting Semantic Truth: On the\nSignificance of Neurath’s Syntacticism’, in Cat and Tuboly\n(eds.) 2019, 363-82.</li>\n<li>Ballod, K./Atlanticus (pseud.), 1898, <em>Produktion und Konsum im\nSozialstaat</em>, Stuttgart: Dietz.</li>\n<li>Bartley, W.W., 1973, <em>Wittgenstein</em>, New York: J.B.\nLippincott.</li>\n<li>Blaug, M., 1996, <em>Economic Theory in Retrospect</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1997, <em>Great Economists Before\nKeynes</em>, Cheltenham: Edward Elgar.</li>\n<li>Bloor, D., 1997, <em>Wittgenstein, Rules and Institutions</em>,\nLondon: Routledge.</li>\n<li>Boon, T., 2008, <em>Films of Fact. A history of Science in\nDocumentary Films and Television</em>, London: Wallflower Press.</li>\n<li>Bühler, K., 1927, <em>Die Krise der Psychologie</em>, Jena:\nFischer.</li>\n<li>Burke, C., E. Kindel and S. Walker, eds., 2014, <em>Isotype.\nDesign and Contexts 1925-1971</em>, London: Hyphen Press.</li>\n<li>Burke, M. and T. Haggitt, 1999, ‘Words Divide; Pictures\nUnite. Otto Neurath and British Propaganda Films of the Second World\nWar’, <em>Imperial War Museum Review</em>, 12: 59–71.</li>\n<li>Carnap, R., 1928, <em>Der logische Aufbau der Welt</em>, Berlin:\nBernary.</li>\n<li>–––, 1932/1987, ‘On Protocol\nSentences’, <em>Noûs</em>, 21: 457–470. </li>\n<li>–––, 1932/1934, <em>The Unity of Science</em>,\nLondon: Kegan Paul, Trench, Teubner and Co.</li>\n<li>–––, 1934/1937, <em>The Logical Syntax of\nLanguage</em>, London: Kegan Paul, Trench, Trubner and Co.</li>\n<li>Cartwright, N., J. Cat, L. Fleck and T.E. Uebel, 1996, <em>Otto\nNeurath: Philosophy Between Science and Politics</em>, Cambridge:\nCambridge University Press.</li>\n<li>Carus, A.W., 2019, ‘Neurath and Carnap on Semantics’,\nin Cat and Tuboly (eds.) 2019, 339-62. </li>\n<li>Cat, J., 1995, ‘The Popper-Neurath Debate and\nNeurath’s Attack on Scientific Method’, <em>Studies in the\nHistory and Philosophy of Science</em>, 26(2): 219–250.</li>\n<li>–––, 2005, ‘Switching Gestalts on Gestalt\nPsychology: On the Relation Between Science and Philosophy’,\n<em>Perspectives on Science</em>, 15(2): 131–177.</li>\n<li>–––, 2019, ‘Neurath and the Legacy of\nAlgebraic Logic’, in Cat and Tuboly (eds.) 2019, 241-338.</li>\n<li>Cat, J., N. Cartwright and H. Chang, 1991, ‘Otto Neurath:\nUnification as the Way to Socialism’, in J. Mittelstrass, ed.,\n<em>Einheit der Wissenschaften</em>, Berlin: de Gruyter.</li>\n<li>–––, 1996, ‘Otto Neurath: Politics and the\nUnity of Science’, in P. Galison and D. Stump, eds., <em>The\nDisunity of Science</em>, Stanford: Stanford University Press,\n347–69.</li>\n<li> Cat, J. and A. T. Tuboly (eds.), 2019, <em>Neurath Reconsidered.\nNew sources and Perspectives</em>, Cham: Springer.</li>\n<li>Chaloupek, G.K., 1990, ‘The Austrian Debate on Economic\nCalculation in a Socialist Economy’, <em>J. History of Political\nEconomy</em>, 22: 659–75.</li>\n<li>Chang, R. (ed.), 1997, <em>Incommensurability and Practical\nReason</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Church, A., 1936, ‘A Bibliography of Symbolic Logic’,\n<em>Journal of Symbolic Logic</em>, 1(4): 121-216.</li>\n<li>Dahms, H-J., 2001/2004, ‘Neue Sachlichkeit in der\nArchitektur und Philosophie der zwanziger Jahre’,\n<em>Zeitschrift fuer Architektur und Staedtebau</em>, Mai 2001,\n82–7, translated as ‘<em>Neue Sachlichkeit</em> in the\nArchitecture and Philosophy of the 20s’, in S. Awodey and C.\nKlein, eds., 2004, <em>Carnap Brought Home: The View from Jena</em>,\nChicago: Open Court, 357–75.</li>\n<li>Duhem, P., 1906, <em>La Théorie Physique: Son Objet et sa\nStructure</em>, Paris: Vrin.</li>\n<li>Faludi, A., 1989, ‘Planning According to the\n‘Scientific Conception of the World’: the Work of Otto\nNeurath’, <em>Environment and Planning D: Society and\nSpace</em>, 7: 397–418.</li>\n<li>Fechner, G, 1860, <em>Elemente der Psychophysik</em>, 2 vols.,\nLeipzig: Breitkopf and Hartl.</li>\n<li>Feyerabend, P.K., 1975, <em>Against Method: Outline of an\nAnarchistic Theory of Knowledge</em>, London: Verso.</li>\n<li>Friedman, M., 1999, <em>Reconsidering Logical Positivism</em>, New\nYork: Cambridge University Press.</li>\n<li>Galison, P., 1990, ‘Aufbau/Bauhaus: Logical Positivism and\nArchitectural Modernism’, <em>Critical Inquiry</em>, 16:\n709–52.</li>\n<li>–––, 1996, ‘Constructing Modernism: The\nCultural Location of <em>Aufbau</em>’, in R.N. Giere and A.W.\nRichardson (eds.), <em>Origins of Logical Empiricism</em>, Minnesota\nStudies in the Philosophy of Science VXI, Minneapolis: University of\nMinnesota Press, 17–44.</li>\n<li>Gattei, S., 2004, ‘Karl Popper’s Philosophical\nBreakthrough’, <em>Philosophy of Science</em>, 71:\n448–466.</li>\n<li>Grierson, J., 1939, ‘Searchlight on Democracy’,\n<em>Documentary Newsletter</em>, December 1939; reprinted in Forsyth\nHardy (ed.), <em>Grierson on Documentary</em>, London: Faber &amp;\nFaber: 227–237.</li>\n<li>–––, 1941, <em>Education and the New Order</em>,\nToronto: Canadian Association for Adult Education</li>\n<li>Grimmer-Solem, E., 2003, <em>Economics and Social Reform in\nGermany 1864–1894</em>, Oxford: Oxford University Press.</li>\n<li>Groß, A., 2019, ‘Generating Cognitive Tools:\nNeurath’s Educational Ideal and the Concept of Isotype’,\nin Cat and Tuboly (eds.) 2019, 177-96.</li>\n<li>Hacohen, M., 2000, <em>Karl Popper. The Formative Years,\n1902–1945</em>, New York: Cambridge University Press.</li>\n<li>Hahn, O., 1909, ‘Zur Axiomatik des logischen\nGebietkalkuls’, <em>Archiv für systematische\nPhilosophie</em> 15, 345–7; English translation in Cat and\nTuboly (eds.) 2019, 507–9.</li>\n<li>–––, 1910,‘Über die Koeffizienten\neiner logischen Gleichung und ihre Beziehung zur Lehre von den\nSchlüssen’, <em>Archiv für systematische\nPhilosophie</em>, 16: 149-176.</li>\n<li>Haller, R., 1982, ‘The Neurath Principle: Its Grounds and\nConsequences’, in Uebel 1991, 117–30.</li>\n<li>Hardcastle, G., 2007, ‘Logical Empiricism and the Philosophy\nof Psychology’, in Richardson and Uebel, eds., 2007,\n228–249.</li>\n<li>Hayek, F.A. von, ed., 1935, <em>Collectivist Economic Planning.\nCritical Studies on the Possibilities of Socialism</em>, London:\nRoutledge.</li>\n<li>Henning, M. 2019, ‘Of Tennis Courts and Fireplaces:\nNeurath’s Internment on the Isle of Man and his Politics of\nDesign’, in Cat and Tuboly (eds.) 2019, 413–34.</li>\n<li>Humphrey, G., 1951, <em>Thinking</em>, London: Methuen and\nCo.</li>\n<li>Janik, A. and S. Toulmin, 1973, <em>Wittgenstein’s\nVienna</em>, New York: Simon and Schuster.</li>\n<li>Kaempffert, W., 1938, ‘Towards Bridging the Gaps Between the\nSciences’, <em>New York Times Book Review</em>, August 7, 1938,\npp. 2, 18.</li>\n<li>–––, 1939, ‘The Facts March On—with\nNeurath’, <em>Survey Graphic</em>, 28 (September 1939):\n538–40.</li>\n<li>Kinross, R., 1990, ‘Emigré Graphic Designers in\nBritain: Around the Second World War and Afterwards’, J. of\n<em>Design History</em>, 3(1): 35–57.</li>\n<li>Körber, S., ‘Thinking about the “Common\nReader”: Otto Neurath, L. Susan Stebbing and the (Modern)\nPicture-Text Style’, in Cat and Tuboly (eds.) 2019, 451-70.</li>\n<li>Kramer, R., 1988, <em>Maria Montessori: A Biography</em>, Boulder:\nWestview Press.</li>\n<li>Kraeutler, H., 2008, <em>Otto Neurath. Museum and Exhibition\nWork</em>, Frankfurt: Peter Lang.</li>\n<li>Kripke, S., 1989, <em>Wittgenstein on Rules and Private\nLanguage</em>, Oxford: Blackwell.</li>\n<li>Lavoie, D., 1985, <em>Rivalry and Central Planning. The Socialist\nCalculation Debate Reconsidered</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Lewis, C.I., 1918, <em>A Survey of Symbolic Logic</em>, Berkeley:\nUniversity of California Press.</li>\n<li>Lindenfeld, D., 1997, <em>The Practical Imagination. The German\nSciences of State in the Nineteenth Century</em>, Chicago: Chicago\nUniversity Press.</li>\n<li>Low, R., 1979, <em>The History of the British Film 1929-1939.\nDocumentary and Educational Films of the 1930s</em>, London: Allen and\nUnwin.</li>\n<li>Lupton, E., 1986, ‘Reading Isotype’, <em>Design\nIssues</em>, 3(2): 47–58.</li>\n<li>Martínez-Alier, J., 1987, <em>Ecological Economics.</em>\n<em>Energy, Environment and Society</em>, Oxford: Basil\nBlackwell.</li>\n<li>Marx, K., 1887/1973, <em>Capital</em>, Volume 1, New York: Free\nPress.</li>\n<li>Mises, L. von, 1920/1935, ‘Economic Calculation in the\nSocialist Commonwealth’, in Hayek 1935.</li>\n<li>–––, 1922/1981, <em>Socialism, an Economic and\nSociological Analysis</em>, Indianapolis: Liberty Fund.</li>\n<li>Mooslechner, P., 2008, ‘Neurath on Money: Some Reflections\non Neurath’s Monetary Thought in the Context of the Birth of\nModern Monetary Economics, in Nemeth, E., S.W. Schmitz and T.E. Uebel\n(eds.) 2008, 101–114.</li>\n<li>Mormann, T., 1999, ‘Neurath’s Opposition to Tarskian\nSemantics’, in J. Woleński and E. Köhler (eds.) 1999,\n<em>Alfred Tarski and the Vienna Circle</em>, Dordrecht: Springer,\n165-78.</li>\n<li>Morris, Ch., 1938, ‘Foundations of the Theory of\nSigns’, <em>International Encyclopedia of Unified Science</em>,\nR. Carnap, Ch. Morris, and O. Neurath (eds.), Volumes 1 and 2,\nChicago: University of Chicago Press.</li>\n<li>–––, 1960, ‘On the History of the\nInternational Encyclopaedia of Unified Science’\n<em>Synthese</em>, 12: 517–21.</li>\n<li>Müller, K.H.,1991, ‘Neurath’s Theory of\nPictorial-Statistical Representation’, in Uebel (ed.) 1991,\n223–51.</li>\n<li>Nemeth 1991, ‘The Unity of Planned Economy and the Unity of\nScience’, in Uebel 1991, 275–84.</li>\n<li>–––, 2007, ‘Logical Empiricism and the\nHistory and Sociology of Science’, in Richardson and Uebel\n(eds.) 2007, 278–304.</li>\n<li>–––, 2019, ‘Visualizing Relations in\nSociety and Economics: Otto Neurath’s Isotype-Method Against the\nBackground of his Economic Thought’, in Cat and Tuboly (eds.)\n2019, 117-40.</li>\n<li>Nemmeth, E. and F. Stadler, eds., 1996, <em>Encyclopedia and\nUtopia. The Life and Work of Otto Neurath (1882–1945)</em>,\nDordrecht: Kluwer.</li>\n<li>Nemeth, E. and R. Heinrich, eds., 1999, <em>Otto Neurath:\nRationalität, Planung, Vielfalt</em>, Vienna: Olderbourg.</li>\n<li>Nemeth, E., S.W. Schmitz and T.E. Uebel (eds.), 2008, <em>Otto\nNeurath’s Economics in Context</em>, </li>\n<li>Neurath, M., 1974, ‘ISOTYPE’, <em>Instructional\nScience</em>, 3: 127–50.</li>\n<li>O’Neill, J., 1993, <em>Ecology, Policy and Politics. Human\nWell-being and the Natural World</em>, London: Routledge.</li>\n<li>–––, 1995, ‘In Praise of a\nPositivist’, in <em>Radical Philosophy</em>, 74:\n29–58.</li>\n<li>–––, 1998, <em>The Market. Ethics, Knowledge and\nPolitics</em>, London: Routledge.</li>\n<li>–––, 2002, ‘Socialist Calculation and\nEnvironmental Valuation: Money, Market and Ecology’, <em>Science\nand Society</em>, 66: 137–151.</li>\n<li>–––, 2008, ‘Pluralism and Economic\nInstitutions’, in Uebel 2008: 77–100.</li>\n<li>Oakes, G., 1988, <em>Weber and Rickert. Concept Formation in the\nCultural Sciences</em>, Cambridge: MIT Press.</li>\n<li>Peckhaus, V., 2012, ‘The Reception of Leibniz’s Logic\nin 19th Century German Philosophy’, in R. Krömer and Y.\nChin-Drian, eds., 2012, <em>New essays on Leibniz Reception</em>,\nBasel: Springer.</li>\n<li>Peters, M. A., 2001, ‘Philosophy as Pedagogy:\nWittgenstein’s Style of Thinking’ <em>Radical\nPedagogy</em>, 3(3),\n [<a href=\"http://radicalpedagogy.icaap.org/content/issue3_3/4-peters.html\" target=\"other\">Available online</a>].\n </li>\n<li>Poincaré, H., 1906, <em>Wissenschaft und Hypothese</em>,\nLeipzig: Teubner. German translation of <em>La Science et\nl’Hypothèse</em>, Paris: Flammarion.</li>\n<li>Polanyi, Michael, 1958, <em>Personal Knowledge</em>, Chicago:\nUniversity of Chicago Press.</li>\n<li>Popper, K.R., 1935/1951, <em>Logic of Scientific Discovery</em>,\nLondon: Allen and Unwin.</li>\n<li>–––, 1950, <em>The Open Society and its\nEnemies</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1957, <em>The Poverty of Historicism</em>,\nBoston: Beacon Press.</li>\n<li>Popper-Lynkeus, J., 1912, <em>Die allgemeine Nährpflicht als\nLösung der Sozialen Frage</em>, Dresden: Reisner.</li>\n<li>Potochnik, A. and A. Yap, 2006, ‘Revisiting Galison’s\n‘Aufbau/Bauhaus’ in light of Neurath’s Philosophical\nProjects’, <em>Stud. Hist. Phil. Sci.</em>, 37:\n469–488.</li>\n<li>Reichenbach, H, 1931/1959, <em>Modern Philosophy of Science</em>,\nLondon: Routledge and Kegan Paul.</li>\n<li>Reisch, G.,1994, ‘Planning Science: Otto Neurath and the\nInternational Encyclopedia of Unified Science’, <em>British\nJournal for the Philosophy of Science</em>, 27: 153–75.</li>\n<li>–––, 2005, <em>How the Cold War Transformed\nPhilosophy of Science. To the Icy Slopes of Logic</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 2019, ‘What a Difference a Decade\nMakes: The Planning Debates and the Fate of the Unity of Science\nMovement’, in Cat and Tuboly (eds.) 2019, 385-412.</li>\n<li>Richardson, A.W. and T.E. Uebel (eds.), 2007, <em>The Cambridge\nCompanion to Logical Empiricism</em>, New York: Cambridge University\nPress.</li>\n<li>Rotha, P., 1936, <em>Documentary Film</em>, London: Faber and\nFaber.</li>\n<li>Sandner, G., 2008, ‘Economy, Ideology and Culture: Otto\nNeurath’s Approach to a Precarious Relationship’, in\nNemeth, E., S.W. Schmitz and T.E. Uebel (eds.) 2008,\n141–57.</li>\n<li>Sandner, G., 2014, <em>Otto Neurath. Eine politische\nBiographie</em>, Vienna: Paul Zsolnay.</li>\n<li>Schlick, M., 1918, <em>Allgemeine Erkenntnislehre</em>, Berlin:\nSpringer.</li>\n<li>–––, 1934/1979, ‘The Foundation of\nKnowledge’, in M. Schlick, <em>Philosophical Papers Vol. II\n(1925–1936)</em>, H. L. Mulder and B. van de Velde-Schlick\n(eds.), Dordrecht: Reidel.</li>\n<li>Soulez, A. (ed.), 1997, <em>Otto Neurath, un Philosophe entre\nScience et Guerre</em>, Paris: Harmattan.</li>\n<li>Stadler, F., 2001, <em>The Vienna Circle. Studies in the Origins,\nDevelopment, and Influence of Logical Empiricism</em>, Dordrecht:\nSpringer.</li>\n<li>–––, 2007, The Vienna Circle: Context, Profile\nand Development´, in Richardson and Uebel 2007,\n13–40.</li>\n<li>Steele, D., 1999, <em>From Max to Mises. Post-capitalist Society\nand the Challenge of Economic Calculation</em>, Lasalle, IL: Open\nCourt.</li>\n<li>Symons, J., O. Pombo and J.M. Torres, eds., 2011, <em>Otto Neurath\nand the Unity of Science</em>, New York: Springer.</li>\n<li>ter Hark, M., 2002, ‘Between Autobiography and Reality:\nPopper’s Inductive Years’, <em>Stud. Hist. Phil.\nSci.</em>, 33: 79–103.</li>\n<li>Tönnies, F., 1899-1900, ‘Philosophical\nTerminology’, <em>Mind</em>, 8: 289–332, 467–91, and\n9, 46–61.</li>\n<li>Tribe, K., 1995, <em>Strategies of Economic Order.</em> <em>German\nEconomic Discourse, 1750–1950</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Tuboly, A.T., 2019, ‘United by Action: Neurath in\nEngland’, in Cat and Tuboly, eds., 2019, 89-116.</li>\n<li>Turk, M., 2018, <em>Otto Neurath and the History of\nEconomics</em>, New York: Routledge.</li>\n<li>Uebel, T.E., ed., 1991, <em>Rediscovering the Forgotten Vienna\nCircle</em>, Dordrecht: Kluwer.</li>\n<li>–––, 1992, <em>Overcoming Logical Positivism\nFrom Within. The Emergence of Neurath’s Naturalism in the Vienna\nCircle’s Protocol Sentence Debate</em>, Amsterdam: Rodopi.</li>\n<li>–––, 1995a, ‘Otto Neurath’s\nIdealistic Inheritance: The Social and Economic Thought of Wilhelm\nNeurath’, <em>Synthese</em>, 103: 87–121.</li>\n<li>–––, 1995b, ‘Wittgenstein and the Vienna\nCircle’, K. Gavroglu, et al., eds., <em>Physics, Philosophy and\nthe Scientific Community</em>, Dordrecht: Kluwer.</li>\n<li>–––, 1998, ‘Enlightenment and the Vienna\nCircle’s Scientific World-Conception’, in A.E. Rorty\n(ed.), <em>Philosophers on Education. Historical Perspectives</em>,\nLondon: Routledge.</li>\n<li>–––, 2004, ‘Preface’, in Neurath\n2004.</li>\n<li>–––, 2007, ‘Philosophy of Social Science\nin Early Logical Empiricism’, in Richardson and Uebel 2007,\n250–77.</li>\n<li>–––, 2007, <em>Empiricism at the Crossroads: The\nVienna Circle’s Procol-Sentence Debate</em>, Chicago and\nLaSalle, IL: Open Court.</li>\n<li>–––, 2008, ‘Otto Neurath as an Austrian\nEconomist: Behind the Scenes of the Early Socialist Calculation\nDebate’, in E. Nemeth, S.W. Schmitz and T.E. Uebel (eds.) 2008,\n37–60.</li>\n<li>–––, 2019, ‘Rationality and\nPseudo-Rationality in Political Economy: Neurath, Mises, Weber’,\nin Cat and Tuboly (eds.) 2019, 197-216.</li>\n<li>Vaughn K., 1994, ‘The Socialist Calculation Debate’,\nP., Boettke, ed., <em>The Elgar Companion to Austrian Economics</em>,\nAldershot: Elgar, 478–84.</li>\n<li>Vossoughian, N, 2008, <em>The Language of the Global Polis</em>,\nNAi Publishers.</li>\n<li>Weber, M., 1921, <em>Gesammelte politische Schriften</em>,\nMünchen: Drei Masken.</li>\n<li>Weybright, W., 1936, ‘Social Showman’, <em>Survey\nGraphic</em>, 25(11): 618–9.</li>\n<li>Wittgenstein, Ludwig, G. E. M. Anscombe, P. M. S. Hacker, and J.\nSchulte, 2009, <em>Philosophische Untersuchungen</em>\n(<em>Philosophical investigations</em>), Chichester, West Sussex,\nU.K.; Malden, MA: Wiley-Blackwell.</li>\n<li>Zemplen, G.A., 2006, ‘The Development of the Neurath\nPrinciple: Unearthing the Romantic Link’, <em>Stud. Hist. Phil.\nSci.</em>, 37: 585–609.</li>\n<li>Zolo, D., 1990, <em>Reflexive Epistemology and Social Complexity.\nThe Philosophical Legacy of Otto Neurath</em>, Dordrecht: Kluwer.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Carnap, Rudolf",
            "ecology",
            "economics: philosophy of",
            "film, philosophy of",
            "Marx, Karl",
            "naturalism",
            "physicalism",
            "rationalism vs. empiricism",
            "science: unity of",
            "socialism",
            "Vienna Circle"
        ],
        "entry_link": [
            {
                "../carnap/": "Carnap, Rudolf"
            },
            {
                "../ecology/": "ecology"
            },
            {
                "../economics/": "economics: philosophy of"
            },
            {
                "../film/": "film, philosophy of"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../naturalism/": "naturalism"
            },
            {
                "../physicalism/": "physicalism"
            },
            {
                "../rationalism-empiricism/": "rationalism vs. empiricism"
            },
            {
                "../scientific-unity/": "science: unity of"
            },
            {
                "../socialism/": "socialism"
            },
            {
                "../vienna-circle/": "Vienna Circle"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=neurath\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/neurath/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=neurath&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/neurath/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=neurath": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/neurath/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=neurath&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/neurath/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.univie.ac.at/ivc/\" target=\"other\">Institute Vienna Circle</a>",
            "<a href=\"http://www.rdg.ac.uk/typography/collectionsandarchives/typ-collectionsandarchives.aspx\" target=\"other\">Typography and Graphic Communication Collections and Archives</a>,\n at the University of Reading"
        ],
        "listed_links": [
            {
                "http://www.univie.ac.at/ivc/": "Institute Vienna Circle"
            },
            {
                "http://www.rdg.ac.uk/typography/collectionsandarchives/typ-collectionsandarchives.aspx": "Typography and Graphic Communication Collections and Archives"
            }
        ]
    }
}