{
    "url": "paine",
    "title": "Thomas Paine",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Mark Philp\n<mark.philp@warwick.ac.uk>",
        "author_links": [
            {
                "http://www2.warwick.ac.uk/fac/arts/history/people/staff_index/philp": "Mark Philp"
            },
            {
                "mailto:mark%2ephilp%40warwick%2eac%2euk": "mark.philp@warwick.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www2.warwick.ac.uk/fac/arts/history/people/staff_index/philp\" target=\"other\">Mark Philp</a>\n&lt;<a href=\"mailto:mark%2ephilp%40warwick%2eac%2euk\"><em>mark<abbr title=\" dot \">.</abbr>philp<abbr title=\" at \">@</abbr>warwick<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Jul 18, 2013",
        "substantive revision Mon Aug 16, 2021"
    ],
    "preamble": "\n\nThomas Paine was a pamphleteer, controversialist and international\nrevolutionary. His Common Sense (1776) was a central text\nbehind the call for American independence from Britain; his Rights\nof Man (1791–2) was the most widely read pamphlet in the\nmovement for reform in Britain in the 1790s and for the opening\ndecades of the nineteenth century; he was active in the French\nRevolution and was a member of the French National Convention between\n1792 and 1795; he is seen by many as a key figure in the emergence of\nclaims for the state’s responsibilities for welfare and\neducational provision, and his Age of Reason provided a\npopular deist text that remained influential throughout the\n19th century. In his own lifetime, and subsequently, he has\nbeen extensively vilified and often dismissed. Yet many of his ideas\nstill command wide interest and enthusiasm in readers throughout the\nworld.\n",
    "toc": [
        {
            "#Life": "1. Life"
        },
        {
            "#PoliTheo": "2. Political Theory"
        },
        {
            "#SociGove": "2.1 Society and Government"
        },
        {
            "#Righ": "2.2 Rights"
        },
        {
            "#SoveLimi": "2.3 Sovereignty and its limits"
        },
        {
            "#NewOrdeGove": "2.4 The New Order of Government"
        },
        {
            "#Welf": "2.5 Welfare"
        },
        {
            "#Prop": "2.6 Property"
        },
        {
            "#Repr": "2.7 Representation"
        },
        {
            "#Reli": "3. Religion"
        },
        {
            "#SignLega": "4. Significance and Legacy"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#ArchReso": "Archival Resources"
        },
        {
            "#PainWork": "Paine’s Works"
        },
        {
            "#BiblWork": "Bibliographic works"
        },
        {
            "#ContWrit": "Contemporary Writing"
        },
        {
            "#ModeBiogComm": "Modern Biography and Commentary"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Life\n\nThomas Paine was born on January 29, 1737 to a family of moderate\nmeans in Norfolk, England. His father was a Quaker and his mother an\nAnglican, and it is likely Paine was baptized into the Anglican\nchurch. He had some schooling, although his father forbade him to\nlearn Latin, and at the age of twelve he was withdrawn from school and\napprenticed to his father to learn the craft of staymaking. When he\nwas in his mid-teens, inspired by the romantic stories of naval life\nby one of his teachers, Paine twice ran away from home to sea. The\nfirst time he was intercepted. The second time he enlisted on the\nprivateer, the King of Prussia. The exact sequence of events\nover the subsequent ten to fifteen years is unclear. He lived in\nLondon on and off, but also had periods in Sandwich and in Margate. He\ncontinued periodically to ply his skills as a staymaker; he may have\ndone some preaching (in the Methodist persuasion); and in 1759 he\nmarried a Mary Lambert, who died the following year in childbirth.\nFollowing his wife’s death, he sought his father-in-law’s\nsupport to take up a career in the excise service. He first served as\nan officer in December 1762, but in August 1765 he was dismissed.\nTradition has it that this was for\n‘stamping’—providing certificates for goods not\ninspected. New research (in Brent et al) suggests it may have been for\nwhistleblowing. He wrote formally seeking re-admission to the service,\nwhich was granted. While awaiting a posting he taught school in\nLondon. In 1768 he accepted a posting to Lewes, on the South Coast of\nEngland, and he took up lodgings with a Samuel Ollive, a local\ntobacconist. In Lewes he became a member of the debating\nsociety—the Headstrong Club—and he was also reputed as a\nskater and player of bowls. Ollive died in July 1769, and Paine took\nlodgings elsewhere. But he sustained his links with the family, and in\nMarch 1771 he married the daughter, Elizabeth Ollive (1741–1808)\nand established himself as part proprietor of the business. The\nfollowing year he went to London to press the claims of the excisemen\nfor higher pay. Although he returned to Lewes, he was sacked by the\nexcise and his marriage had failed, and he sold up his business. In\nthe final settlement between Paine and his wife he was awarded\n£400. He headed to London, where he secured letters of\nintroduction from Benjamin Franklin, whom he had encountered on an\nearlier visit to the capital, and embarked in April 1774 for the New\nWorld. He was carried ashore in Philadelphia in November 1774\nsuffering from putrid fever, but he survived. \n\nIn Philadelphia Paine developed an acquaintance with Robert Aitkin, a\npublisher and bookseller, who employed him to edit the\nPennsylvania Magazine. There remains considerable\ndisagreement about which pieces in the Magazine were written by Paine,\nbut it seems clear that he did contribute and that he developed a\nreputation among political circles in Philadelphia as a result, at\njust the time that tensions with Britain were reaching a crisis point.\nIn the autumn of 1775, encouraged by Benjamin Rush, Paine began work\non a pamphlet defending the case of American independence. He\ndiscussed his work with Rush, David Rittenhouse, Benjamin Franklin,\nand Samuel Adams, but the work was his own (save for the title, for\nwhich Rush claimed responsibility). Common Sense (1776) was\nthe most widely read pamphlet of the American Revolution. It was a\nclarion call for unity, against the corrupt British court, so as to\nrealize America’s providential role in providing an asylum for\nliberty. Written in a direct and lively style, it denounced the\ndecaying despotisms of Europe and pilloried hereditary monarchy as an\nabsurdity. At a time when many still hoped for reconciliation with\nBritain, Common Sense demonstrated to many the inevitability\nof separation.\n\nPaine consolidated his reputation as a pamphleteer with his series of\nAmerican Crisis letters (1777–83); he also served in a\nnumber of capacities for Congress and the Pennsylvanian Assembly.\nAlthough he had links with the more radical elements of Pennsylvanian\npolitics, he also committed his energies to a number of more elite\nprojects—contributing to the establishment of the Bank of\nAmerica to help raise money for the war, and working with Robert\nMorris to encourage State Legislatures to accept the need for Federal\ntaxation to support the war. Following the conclusion of the war he\nwas awarded a farm by the New York assembly, and Congress voted him a\ngrant of $3,000 for his services.\n\nAfter the Revolution he dedicated his time to scientific experiments,\ndesigning an iron bridge capable of spanning wide distances without\nthe use of piers, experimenting with marsh gas with Washington, and\nattempting to produce a smokeless candle with Franklin. In 1787 he\ntook a wooden model of his bridge to Paris, and subsequently to\nEngland where an iron model of 110 feet was forged and constructed for\npublic display in a field near Paddington in May 1790. He also became\nincreasingly caught up in the initial events of the French revolution,\nthanks in part to his involvement with a group of French intellectuals\nenabled by Thomas Jefferson (US Minister to France until late 1789).\nPaine contemplated writing a history of the French Revolution but he\nmade slow progress—exacerbated by his poor French. When Edmund\nBurke’s Reflections on the Revolution in France\nappeared in November 1790, he determined to answer it and turned his\nmaterials to that task. The result, Rights of Man\n(February/March 1791) coupled a narrative of French events with a\ntrenchant attack on Burke and the Revolution Settlement of 1688. It\nwas an immediate success, and brought Paine into the circles of those\nseeking to achieve parliamentary reform in Britain. He continued to\nvisit France and was in Paris in June 1791 in the immediate aftermath\nof Louis XVI’s flight to Varennes. He collaborated with a small\ngroup (including Nicholas Bonneville and the Marquis de Condorcet) to\nproduce a republican manifesto that was pasted on the walls of Paris,\nto the outrage of most members of the National Assembly. That movement\nwas firmly repressed at the Massacre of the Champs de Mars in July\n1791, by which time Paine was already back in Britain. But the\noccasion marks a shift in his thinking—from seeing monarchy as\nan inevitable part of the institutional order in the corrupt states of\nEurope, to thinking that the American model could be applied more\ngenerally throughout Europe. Where Rights of Man had shown\nconsiderable tolerance for France’s limited monarchy, his\nRights of Man: Part the Second (March 1792) was explicitly\nrepublican and he drew extensively on his American experience in\nsketching the basic principles of a largely self-regulating commercial\nsociety, coupled with representative government, the rule of law, and\na periodically renewable covenant. The final chapter, influenced by\nhis friendship with Condorcet and other members of the\nComité de Mendicité, outlined a program for\nwelfare provision for the poor, aged, disabled and destitute.\n\nThe two parts of Rights of Man were quickly combined in cheap\neditions (at Paine’s insistence) and sold in unprecedented\nnumbers. Paine’s advocacy of natural rights, his attacks on\nmixed government, his outspoken republicanism, and his extensive\nproposals for schemes of social welfare set him apart from the more\ncommon opposition rhetoric that emphasized the need to protect the\nintegrity of the mixed constitution to secure English liberties. His\nsuccess suggests that he was reaching a popular audience who attached\ndiminishing weight to these traditions and were struck by his\ninsistence on their essential equality and their right to challenge\nthe status quo. In May 1792 a prosecution for sedition was initiated\nagainst him. When the case was heard in November of that year he was\noutlawed—but by this time he had returned to France, having been\nelected as a member to the National Convention in the summer of\n1792.\n\nHe arrived in Paris shortly before the September massacres, and it\nseems clear that he found it hard to find his feet—being out of\nsympathy with the more sanguinary elements in the city. His closest\nconnections were with Girondin leaders in Paris, who were rapidly to\nfall from favour. Moreover, his plea in the National Convention for\nclemency for Louis XVI at his trial at the end of 1792, led to his\ndenunciation by Marat and the enmity of the Jacobin faction. He served\nwith Condorcet and Sieyes on the Committee to design a republican\nconstitution, but the extent of his contribution is unclear, and\nalthough Condorcet pressed on with the work, producing a report in the\nspring of 1793, it was immediately shelved. Paine led an increasingly\nconstrained life as the Jacobins assumed ascendancy and his friends\nwere arrested and executed, fled, or killed themselves. Orders for his\narrest were issued on 27 December 1793. While he was being taken into\ncustody he passed to his American friend Joel Barlow the manuscript\nfor the first part of Age of Reason which was published\nshortly thereafter. Paine spent eleven months in the Luxembourg (not\nunconnected to the studied neglect of his case by the US Minister,\nGouvernor Morris), and seems only narrowly to have escaped the\nguillotine. When he left prison, after Robespierre’s execution,\nit was thanks to the intervention of Morris’s successor, James\nMonroe. On his release, Paine was in an extremely debilitated state,\nand Monroe looked after him in his home. Paine’s angry\ndenunciation of Washington, whom he believed had ignored his pleas for\nhelp, and the publication of subsequent parts of Age of\nReason made Monroe increasingly uncomfortable with his guest and\nPaine left to live with the printer Nicholas Bonneville and his\nfamily.\n\nAlthough still a member of the National Convention, Paine had rarely\nattended and did not do so after his release. His one intervention was\nhis Dissertation on First Principles of Government (1795), a\ncritique of the Constitution of 1795, and a summary of his own\nthinking about politics, in which he urged the Convention to institute\nuniversal manhood suffrage. In 1796, responding to the attempted coup\nby Babeuf’s ‘conspiracy of equals’, Paine’s\nAgrarian Justice developed further ideas fist canvassed in\nthe second part of Rights of Man and set out a principled\ncase for a tax on inheritance so as to provide a capital grant for all\nreaching the age of majority, together with an annual pension for all\nat fifty, arguing that the earth is common property to the human race\nand that everyone is owed compensation for the private appropriation\nof it.\n\nPaine finally left France to return to America in 1803, during the\nPeace of Amiens, but was vilified on his return for his radicalism,\nhis deism, and for his embittered critique of Washington. He was\njoined in America in 1804 by the wife of Nicholas de Bonneville and\nher three sons who lived with him for a period; but this arrangement\nbroke down and Paine became increasingly ill and isolated. He died in\nobscurity in 1809. In 1819, William Cobbett, the Tory turned radical\nand critic of Paine turned supporter, had Paine’s bones dug up\nand returned to England to be buried with honour. They were promptly\nlost, thereby ensuring that the man who declared his attachment to be\n‘to all the world, not to any particular part’ retained\nhis universal citizenship.\n2. Political Theory\n\nPaine’s reputation has been a source of controversy since his\nown lifetime. He was a controversialist—what he wrote invariably\nprovoked controversy and was intended to do so. As such, one needs a\nreasonably capacious understanding of ‘philosophy’ to\ncount him as a philosopher. He was a pamphleteer, a journalist, a\npropagandist, a polemicist. Nonetheless, he also settled on a number\nof basic principles that have subsequently become central to much\nliberal-democratic culture. Few of these are original to Paine, but\nhis drawing together of them, and his bringing them before a wide\npopular audience, at this key historical moment when the people emerge\nas a consistent and increasingly independent force on the political\nstages of Europe and North America, has ensured that his works remain\nwidely read and are seen as of enduring value. That said, a great deal\nabout his life and about the value and interpretation of his work is\nhotley disputed and promises to remain so.\n\nFor example, the intellectual and emotional legacy of Paine’s\nexperience in Britain is a matter of speculation in secondary work,\nand has recently been strongly emphasised in Clark (2018) to the\nexclusion of other influences. Other authors have emphasised American\ninfluence (Cotler, 2011), and still others that of his French\nexperience (Lounissi 2018). These debates also involve disputes over\nthe character of English radicalism, the impact of evolving American\ntraditions of exceptionalism and internationalism, and the question of\nhow far Paine’s thinking changes and develops over time and in\nresponse to particular political circumstances. What should be\nemphasised is that these ongoing disagreements also involve\nconflicting interpretations of events, ideas, and actions. This means\nthat locating Paine and his ideas is also partly a question of arguing\nfor a particular interpretation of the political debates, events and\ncontroversies in which he was involved in America, France and Britain.\nAnd, since these remain a matter of controversy in both academic and\ncontemporary popular debate, it is fair to say that Paine’s\nthought and legacy remains deeply contested.\n2.1 Society and Government\n\nIn Common Sense Paine opens his account with the contrast\nbetween society and government: ‘Society is produced by our\nwants and government by our wickedness; the former promotes our\nhappiness positively by uniting our affections, the latter\nnegatively by restraining our vices’ (CW I, 4). [CW\nrefers to The Complete Writings of Thomas Paine, P.S. Foner\n(ed.), 1945.] As with many Paine claims, this seems simple, intuitive,\nand attractive. Our interests unite us, and it is only when we\noverstep the legitimate bounds of those interests, or push them to the\ndetriment of others, that we need constraint. But when we do that, we\nought to know better, and as such Government can appropriately be\nregarded as constraining our vices. What is less clear is how far we\nmust assume vice (and thereby government). ‘Society in every\nstate is a blessing, but government even in its best state is but a\nnecessary evil; in its worst state an intolerable one.’ The\nopening of Common Sense can be read as a gloss on\nLocke’s Second Treatise, without the references to God.\nYet Paine claimed never to have read Locke. He also seems clear in his\nfirst major pamphlet that government ‘is a mode rendered\nnecessary by the inability of moral virtue to govern the world’\n(CW I, 6). The issue, then is how extensive must government be, and\nwhat sort of government provides the necessary benefits, without\nmultiplying the evils. Paine’s view is that ‘the more\nsimple anything is, the less liable it is to be\ndisordered…’ Simple government for Paine is\n‘republican government’: he rejects monarchical and mixed\nforms of government, in favour of a system in which ‘the liberty\nof choosing an House of Commons out of their own body’ is the\nkey republican moment (CW I, 16).\n\nPaine’s attack on monarchy in Common Sense is\nessentially an attack on George III. Whereas colonial resentments were\noriginally directed primarily against the king’s ministers and\nParliament, Paine lays the responsibility firmly at the king’s\ndoor. And he appeals to a sense among Americans that they have all the\nresources, and every claim, to rule themselves without the\ninterference and control of a body half-way around the world.\nSubverting paternalist metaphors for Britain’s colonial claims,\nPaine creates an image of a nation come of age, ready for freedom from\nits leading strings, having every justification for separation from\nits unnatural parent, and seeking to stand on its own as a commercial\nrepublic, trading in its own right. It is not America who is behaving\nunnaturally and ungratefully, but the ‘royal brute of Great\nBritain.’ ‘Nature has deserted the connection, and art\ncannot supply her place’ (CW I, 23).\n\nAmericans do not see the way forward, but it is simple. The colonies\nneed to be divided into districts, districts should elect their\nrepresentatives to Congress, and Congress should choose a President by\nballot from the delegates of each state in turn, with the first state\nbeing chosen by lot. To avoid injustice, three fifths should be\nrequired for a majority. To avoid imposing his views, however, he\nsuggests that each state nominate two members to a Continental\nCongress to frame a charter fixing the details of the\ngovernment—‘always remembering that our strength is\ncontinental, not provincial’ (CW I, 29). And in a rare citation\nof another’s works, Paine appeals to Dragonetti’s adage\nthat the aim should be ‘a mode of government that should combine\nthe greatest sum of individual happiness with the least national\nexpense’ (CW I, 29).\n\nFor all its success, Common Sense is not without flaws. It\ncontains a digression on biblical accounts of the origin of monarchy;\nits powerful rhetoric leaves unanswered a range of more practical and\ntheoretical questions, and the argument jumps around considerably.\nLater editions added an appendix denouncing the Quakers for their\nquietism. But its rhetorical effectiveness cannot be\ndoubted—which suggests that it intersected powerfully with the\nconcerns and beliefs that were widespread in colonial America at the\npoint of rupture. Political theorists might want to press for more\ndetails about who will have the vote; about whether there is an\nimplicit acceptance of a doctrine of the fall; about the extent to\nwhich his appeals to republics envisage a degree of republican civic\nvirtue; about whether the argument is based on an account of natural\nrights; and so on. But on such issues the pamphlet is either silent or\nonly barely suggestive. Unlike Locke, this is not a principled\njustification for resistance, so much as a concatenation of points\nabout Americans taking their collective identity and independent\ninterests seriously and separating from the increasingly arbitrary\nrule of Britain. Given these sweeping claims, it is easy to see why so\nmany commentators have held that Paine was both lacking in\nintellectual sophistication and basically held to a consistent set of\nprinciples throughout his work, since it is difficult to demonstrate\nthat much he says is actively inconsistent with what he later wrote.\nNonetheless, if we take increasing precision in his claims as evidence\nof greater attention to issues that he felt he could confidently sweep\npast in Common Sense, then a case for a deepening of his\nthinking and for a process of change over time can be made.\n2.2 Rights\n\nWhile there may be suggestions of rights claims in Common\nSense and in a number of minor texts attributed by some to Paine\nbut where the authorship is a matter of dispute, it is clear that the\nfully fledged account of rights that Paine advances in the first part\nof Rights of Man (1791) represents a significant development\nin his thinking. It is common to attribute that development to the\nfoil he found in Burke’s Reflections on the Revolution in\nFrance (1790), where Burke inveighs against the idea that rights\nare preserved from the state of nature in the civil state. ‘Men\ncannot enjoy the rights of an uncivil and of a civil state\ntogether…That he may secure some liberty, he makes a surrender\nin trust of the whole of it’ (CW VIII, p. 110). And where he\nclaims that, in England, ‘We have not been drawn and trussed, in\norder that we may be filled, like stuffed birds in a museum, with\nchaff and rage, and paltry, blurred shred of paper about the rights of\nman’ (CW VIII, p. 137). It seems more likely, however, that\nPaine’s distinction between natural rights, where we necessarily\nhave the power to execute the right (as in the right of conscience),\nas against rights where we need the arm of society to secure the right\n(as in property), although more sharply expressed in Rights of\nMan (1791), is a product of discussions with Jefferson and French\nsympathizers with America in the late 1780s, when they were discussing\nthe proposed Federal Constitution and its failure to contain a bill of\nrights. In a letter to Jefferson written in 1788/9 Paine draws a\ndistinction between ‘rights they could individually exercise\nfully and perfectly, and those they could not’ (CW II, 1298). In\nthe reply to Burke this is used to show that every civil right grows\nout of a natural right or ‘is a natural right exchanged)’;\nthat the civil power is made up of the aggregate of that class of the\nnatural rights of man, which becomes defective in the individual in\npoint of power; and that the power produced from the aggregate of\nnatural rights, imperfect in power in the individual’, cannot be\napplied to invade the natural rights which are retained by the\nindividual…’ (CW I, 276).\n\nHow much, in fact, separates Paine from Burke? The rights in which our\npower is perfect, are relatively few—so that many of the things\nthat really matter, access to means of labour and sustenance, freedom\nof movement and contract, seem to fall under Burke’s sense of\nmatters of convenience which government orders on the basis of general\nutility. Although Paine does not provide much detail, it seems clear\nthat he sees himself as different from Burke primarily because he\nargues for continuing normative salience of the natural right and for\nthe on-going collective sovereignty of the people over the\narrangements that they make the better to secure those rights.\nPaine’s readers had little doubt that he sought to defend their\nrights from invasion, but his distinction does not in-itself do that.\nAfter all, what is to stop the collective encroaching on the rights of\ncitizens? One answer is given in Paine’s account of popular\nsovereignty.\n2.3 Sovereignty and its limits\n\nCommon Sense might presume a principle of collective\nself-determination and the sovereignty of the people, but it does not\narticulate or defend it. Something like this issue does come under\nconsideration in Paine’s Dissertations on Government, a\npamphlet written in 1786, defending the Bank of America and the\nprinciple that contracts formed by government ought to be respected by\nsubsequent occupants of power. ‘Every government…contains\nwithin itself a principle common to all, which is that of a sovereign\npower, or a power over which there is no control, and which controls\nall others….In republics, such as those established in America,\nthe sovereign power…remains where nature placed it—in the\npeople. …This sovereignty is exercised in electing and deputing\na certain number of persons to represent and to act for the whole. But\nhe goes on to insist that\n\nWhen a people agree to form themselves into a republic…it is\nunderstood that they mutually resolve and pledge themselves to each\nother, rich and poor alike, to support this rule of equal justice\namong them… (and) they renounce as detestable, the power of\nexercising, at any future time any species of despotism over each\nother, or of doing a thing not right in itself, because a majority of\nthem may have the strength of numbers sufficient to accomplish it. (CW\nII, 373)\n\n\nAs a result,\n\nThe sovereignty in a republic is exercised to keep right and wrong in\ntheir proper and distinct places, and never suffer the one to usurp\nthe place of the other. A republic, properly understood, is a\nsovereignty of justice, in contradistinction to a sovereignty of will.\n(CW II, 375)\n\n\nThis position sits uncomfortably with more direct and active\ninterpretations of the sovereignty of the people or any general will.\nHence Paine’s claim in 1791 to be ‘a Citizen of a country\nwhich knows no other Majesty than that of the People; no other\nGovernment than that of the Representative body; no other sovereignty\nthan that of the Laws…’ (CW II, 1315).\n\nPaine’s account of sovereignty dramatically delimits collective\npower to the securing of civil rights, based on natural right. In\nRights of Man (1791) he quotes Lafayette’s claim that\n‘For a nation to be free it is sufficient that she wills\nit’ (CW I, 322). Lafayette most likely meant it as a call to\nreject despotism; but Paine’s account is perhaps more subtle,\nseeing it as a right of the nation to determine its government, but\nalso as a right that is itself delimited by the end of\nliberty—that is, by the protection of individual rights and by\nensuring their more adequate security within the collective.\n\nThat this is so helps account for Paine’s account of\ngenerational sovereignty. In Rights of Man (1791) he attacks\nBurke’s claim that the terms of the 1688 Revolution Settlement\n“bind us,” (meaning the people of the day) “our\nheirs and our posterity, to them, their\nheirs and posterity, to the end of time” (CW\nI, 250). Paine demurs:\n\n\nThere never did, there never will, there never can exist a parliament,\nor any description of men, or any generation of men, in any country,\npossessed of the right or the power of binding and controlling\nposterity to the ‘end of time’…Every\ngeneration must be as free to act for itself, in all cases,\nas the ages and generation which preceded it.\n\n\nThis too looks like a principle that Paine worked out with Jefferson,\nin 1788–9, when Jefferson first mentions it in his\ncorrespondence, although the prior source is likely to be Adam\nSmith’s Wealth of Nations. The principle is a powerful\none—but it is negative: no generation can be bound by those\nbefore it; and none can bind those after. But equally, no generation\nis free to act unjustly. In his Dissertations of Government\n(1786), Paine had struggled with precisely this issue in wanting to\nclaim both the sovereign power of the people and the duty on the part\nof the state to respect contracts made previously by others in their\ncapacity of representatives. Paine tries to reconcile the claims by\narguing that a contract is not a law but an action, and while laws can\nbe changed, acts are binding. He does not yet claim generational\nsovereignty, although the right to change laws is clearly there. But\nthe insistence on a sovereignty of justice is designed to ensure that\nactions that involve the transfer of rights must have the protection\nof the state and cannot be justly abrogated.\n\nWhat becomes clear, is that, as Paine struggles to articulate his\naccount of rights, he comes to defend a very Lockean account in which\nthe government is there to interpret and to secure antecedently\ndefined rights and just claims that are the outcome of the exercise of\nthese rights. Rights acquired through clear contract or agreement\ndeserve every protection: even if subsequent generations are at\nliberty to question the laws of the nation and to alter them as they\nwill, they are not at liberty to invade the property rights of people\nsecured through past agreements.\n2.4 The New Order of Government\n\nPaine’s institutional suggestions in Common Sense are\nhardly fully fledged proposals. Indeed, one of the most surprising\naspects of Paine’s writing is how little institutional\ndiscussion there is—he is not a man for the detailed discussions\nof constitutions and legislative and executive arrangements. Even his\npiece in the summer of 1791 Answer to Four Questions on the\nLegislative and Executive Power is not especially illuminating.\nMost modern commentators tend not to notice this. Paine is clearly a\ndemocrat, he advocates democratic institutions, and he rejects those\nof monarchy and aristocracy. But such judgments are often deeply\nanachronistic. If we examine what Paine actually says, we see that his\nown perspective was one which evolved and remained inclusive in many\nareas. It seems clear that Paine was a republican—but in a\nchanging and always very specific sense. In Dissertations on\nGovernment (1786) he specifies it as government directed towards\n‘the public good, or the good of the whole’ (II, 372). In\nRights of Man (1791) he understands it as government by\nelection and representation (I, 338)—a definition of republic\nthat matches closely that advocated by Madison in the Federalist\nPapers. In Rights of Man (1792) he switches back to the\nearlier formulation:\n\nWhat is called a republic is not any particular form\nof government. It is wholly characteristical of the purport, matter,\nor object for which government ought to be instituted, and on which it\nis to be employed, res-publica, the public affairs, or the public\ngood….Republican government is no other than government\nestablished and conducted for the interest of the public, as well\nindividually as collectively. (CW I, 369–70)\n\n\nYet he steadfastly refuses to call the form of government he is\ninterested in a ‘democracy’—which he identifies with\nancient direct democracy and sees as essentially limited. The system\nhe sees as operating in America is ‘representation ingrafted\nupon democracy’ (CW I, 371). And, unlike Joel Barlow, he does\nnot use the neologism ‘representative democracy’ nor, like\nJohn Adams, ‘representative government.’ Paine thus plays\na part in the process of transforming representation from something\nthat was seen as compatible with monarchical—indeed with\nabsolutist—states, although it could also take more popular\nforms, often linked to a gothic feudal past—into something that\nwas directly linked to the sovereignty of the people in their nations.\nBut, in many respects, he does little especially innovative. The one\nmajor impact of his work was to bring to a wide audience some of the\nthinking that he shared with both Madison and Jefferson about the\ndistinctive features of the American form of government.\n\nRights of Man (1791) is a rather mixed performance, combining\nhistorical narrative of events in France, engagement with Burke, the\nadumbration of principles, and some powerful moments of political\nrhetoric—suggesting that Burke has constructed a set of tragic\npaintings by which he has ‘outraged his own imagination’\n(CW I, 258), that Burke ‘pities the plumage but forgets the\ndying bird’ (CW I, 260) and that he has worked ‘up a tale\naccommodated to his own passions and prejudices.’ He makes his\npoints about rights polemically, as he does those concerning the\nsovereignty of each generation and in drawing a distinction between\nthe constitution and the government, and his most passionate attacks\nare on the hereditary principle and its accompanying\n‘gibberish’ of titles and distinctions—‘the\nidea of hereditary legislators is as inconsistent as that of\nhereditary judges, or hereditary juries; and as absurd as an\nhereditary mathematician, or an hereditary wise man; and as ridiculous\nas an hereditary poet-laureate’ (CW I, 289).\n\nIn Rights of Man (1792) Paine shifts the ground\nsubstantially. He hardly mentions events in France, and barely touches\non Burke. Instead, the revolution in America is announced as an event\nof global importance—the place ‘where the principles of\nuniversal reformation could begin’ (CW I, 354). What began in\nAmerica is now seen, not as an exception, but as the trigger for a\nrenovation or the world as a whole. The relative tolerance for\nFrance’s monarchy in the first part of Rights of Man is\nset aside, suggesting that Paine had not previously thought that the\nold world states could manage a representative system of the American\nform, but that he now does think this. Moreover, his old distinction\nbetween society and government is re-animated but, instead of\nemphasizing the inevitability of vice, he represents society as in\nalmost every respect sufficient unto itself: ‘Government is no\nfurther necessary than to supply the few cases to which society and\ncivilisation (a new concept) are not conveniently competent’ (CW\nI, 357–8). Indeed, ‘the more perfect civilisation is, the\nless occasion has it for government, because the more does it regulate\nits own affairs, and govern itself…’ (CW I, 358–9).\nAnd, again, it is America that is the model—where the country\nsubsisted with hardly any form of government throughout the revolution\nand the subsequent period. Moreover, America becomes the model for\nreform: a society that agrees articles, establishes a constitution,\nand is able periodically to revise the constitution as the collective\nact of the people. Contrasting old forms of government, based on an\nassumption of power, for the aggrandizement of itself’; and the\nnew: ‘a delegation of power, for the common benefit of the\npeople’ (CW I, 363), Paine roots the new forms in the\nestablishment of a constitution and the regulation of government in\naccordance with the constitution for the good of all, seeing the\nAmerican example as one that may be spread throughout the globe.\nIndeed, Paine thinks ‘it is too soon to determine to what extent\nof improvement government may yet be carried. For what we can foresee,\nEurope may form but one great republic, and man be free of the\nwhole’ (CW I, 397). This is a hymn to representative government,\nto minimal government, and to government with the primary concern of\nprotecting the natural rights of man more effectively. It is not a\ndefense of democracy or universal suffrage. For all his\ncharacterization as a democrat he does not embrace that description;\nand there is no advocacy of universal suffrage prior to Paine’s\nLetter Addressed to the Addressers, written and published in\nthe summer of 1792 shortly before he left for France. This should\nfurther alert us to the fact that, in this period, Paine’s\nthinking was changing, often as rapidly as events around him\nchanged.\n2.5 Welfare\n\nIn the final chapter of Rights of Man, Paine addresses the\nexpenditure of the British state and to issues of commerce. Since his\nLetter to the Abbe Raynal (1782), he had expressed a growing\nconfidence in commerce as a means of uniting the interests of nations\nand rendering outdated and irrelevant the European system of war. The\nfinal chapter of Rights of Man develops the same view,\nsuggesting the incompatibility between monarchical regimes and the\ngrowth of commerce and national wealth, and going on to itemize the\ntaxation raised in Britain to support the costs of monarchical wars.\nGiven the new era of peace between nations consequent upon the\nrevolutions in America and France, Paine raises the question of what\nshould be done about the immense sums raised in taxes in Britain (some\n£15.5 millions), suggesting that ‘whoever has observed the\nmanner in which trade and taxes twist themselves together, must be\nsensible of the impossibility of separating them suddenly’ (CW\nI, 423). Paine then develops a series of welfare proposals that seem\nto have no underlying principle of justice, but are proffered wholly\nas a way of redirecting spending. He advocates that poor relief be\nremoved as a local tax and replaced by central provision from\ngovernment coffers; that pensions be offered for those advanced in\nage, starting at 50, and in full form at 60; that provision be made\nfor the education of the poor; that maternity be benefit be granted to\nall women immediately after the birth of a child; that a fund be\nestablished for the burial of those who die away from home; and that\narrangements be made for the many young people who travel to the\nmetropolis in search of a livelihood to provide initial accommodation\nand support until they find work. Paine ends by identifying provision\nfor those who have served in the army and navy, and suggesting that,\nas demands on the public purse from these sources declines, then items\nof indirect taxation might also be lifted, and the burden of taxation\ngradually shifted towards a progressive taxation on landed property,\ncoupled with the abolition of primogeniture, and a progressive tax on\nthe income from investments. Although certainly influenced by his\nacquaintance with Condorcet and members of the Comité de\nMendicité de la Constituante, this raft of proposals\nrepresents a major innovation on Paine’s part, its slight oddity\nbeing the absence of any clear set of underlying principles for its\njustification.\n2.6 Property\n\nThe ad hoc turn to welfare in the second part of Rights\nof Man (1792) finds some compensation in the short pamphlet,\nAgrarian Justice (1795–6), that Paine wrote after his\nrelease from prison in response to the unrest in 1795 in Paris as\nprotests spread against the economic hardship suffered in the capital,\nstimulating culminating in Babeuf’s conspiracy of equals. Unlike\nthe final chapter of Rights of Man, Agrarian Justice provides\na principled defense for welfare provision, rooted in a conception of\nthe original equality of man and the equal right to a subsistence from\nthe earth. He acknowledges that there are benefits to allowing private\nproperty in land and its cultivation, but argues that every proprietor\nowes the community a ground-rent for the land he holds, which should\nbe used as a right of inheritance for all, paying the sum of £15\nas a compensation for the loss of natural inheritance at the age of\ntwenty-one and an annual grant to the aged. These payments are a\nmatter of right, not of charity. A claim against the common stock that\nall may make, on the ground that ‘no person ought to be in a\nworse condition when born under what is called a state of\ncivilization, than he would have been had he been born in a state of\nnature…’ (I, 613). The money is to be raised from\nprogressive taxation in inherited wealth and will contribute to its\nmore equal distribution.\n\nTo modern critics it may seem odd to couple the essentially\nlibertarian sentiments of the opening of the second part of Rights\nof Man with a major raft of welfare reforms. But Paine clearly\ndid not think about these reforms as an extension of\ngovernment. Although he does not make the point, they seem to\nbe more a matter of administration, and that is in keeping with his\nessentially consensual view of the formal exercise of responsibilities\nby those invested with the confidence of the nation as a whole.\n\nPaine’s proposals probably had little practical effect on the\nemergence of the welfare state, but they helped influence early\nsocialist doctrines and working men’s associations, and they\nhave since been taken up by those advocating a right to basic income\nor a child inheritance as a way of ensuring that the young need not\ninherit their parents’ poverty.(See Van Parijs and Vanderborght,\n2017)\n2.7 Representation\n\nIn his Letter Addressed to the Addressers (1792), and more\nfully in Dissertation on First Principles of Government 1795)\nPaine commits to the conclusion that equal rights entail an equal\nright to have a say in one’s representative. He provides two\nmain arguments. In the Letter… he argues that as every\nman over the age of twenty-one pays taxes in one form of another, so\neveryone has a right to vote—or a form of entitlement through\ncontribution. But in the Dissertation he makes the case\nwholly on the basis of equal natural rights: ‘the right of\nvoting for representatives is the primary right by which other rights\nare protected. To take away this right is to reduce a man to slavery,\nfor slavery consists in being subject to the will of another, and he\nthat has not a vote in the election of representatives is in this\ncase. (II, 579) ‘It is possible to exclude men from the right of\nvoting, but it impossible to exclude them from the right of rebelling\nagainst that exclusion; and when other rights are taken away, the\nright of rebellion is made perfect.’ (II, 580) This suggests\nthat the role of rights grows in importance for Paine, making little\nappearance at all before 1788, and then coming to play an expanding\nrole in his account, to provide the underpinning for political\nauthority and an account of its limits, to justify the right to vote,\nand to make the case for a right to land and the fruits of nature\nwhich is translated into an inheritance right and a range of welfare\nrights. In his account of the origin of rights in Rights of\nMan (1791), he suggests that those (like Burke) who appeal to the\nauthority of antiquity simply do not go back far enough:\n\nIf antiquity is to be an authority, a thousand such authorities may be\nproduced, successively contradicting each other; but if we proceed on,\nwe shall at last come out right; we shall come to the time when man\ncame from the hand of his Maker…we have now arrived at the\norigin of man, and at the origin of his rights…It is authority\nagainst authority all the way, until we come to the divine origin of\nthe rights of man, at the Creation. Here or inquiries find a\nresting-place, and out reason finds a home. (I, 273)\n\n3. Religion\n\nFor a man so frequently called an atheist, Paine shows a remarkable\nconfidence in the divine order of the creation. The work that did most\nto damage his reputation in America, and which split his supporters in\nBritain, was his Age of Reason (1793/4), which was followed\nby a further part in 1795, and additional writings compiled by later\neditors into a third part, from 1804. The Age of Reason is\nnot an atheist tract, but a deist one. It combines scathing criticism\nof claims to authority for the bible by religious authorities, with an\nexpression of confidence in a divinely ordered world, revealed in\nnature through the exercise of reason, that drew heavily on the\nlectures he had attended in London prior to leaving for America, given\nby James Ferguson and Benjamin Martin. Indeed, he seemed to have\ncommitted their account to memory, and uses the text to lay out the\norder of the universe, to speculate on the possibility of a plurality\nof worlds, and to dismiss all claims for mystery, miracles and\nprophecy. God is an unmoved first cause, who designs and sets the\nuniverse in motion for the benefit of man, and the moral duty of man\nconsists in ‘imitating the moral goodness and beneficence of\nGod, manifested in the creation toward all His\ncreatures…everything of persecution and revenge between man and\nman, and everything off cruelty to animals, is a violation of moral\nduty.’ (I, 512). Although the later parts of Age of\nReason descend into detailed interpretation and controversy, and\nlose much of their intuitive appeal, the first part is a powerful\nconfession of rationalist faith in a divine creator whose design can\nbe appreciated by man in the Bible of Creation, whose principles are\neternal, and which rejects as meaningless the claims to authority and\nthe theology of the Christian Churches. ‘The study of theology,\nas it stands in the Christian churches, is the study of nothing; it is\nfounded on nothing; it rests on no principles; it produces no\nauthorities; it has no data; it can demonstrate nothing; and it admits\nof no conclusion’ (CW I, 601). ‘The only religion that has\nnot been invented, and that has in it every evidence of divine\noriginality, is pure and simple Deism’ (CW I, 600). And as\nsimple government avoids us becoming the dupes of fraud, so simple\nbelief protects us from the fraud of priestcraft, which so often runs\nhand in hand with despotism.\n4. Significance and Legacy\n\nPaine’s religious views, not unlike his political views, are not\nespecially original or subtle. They follow much of the deist writing\nof the late seventeenth and early eighteenth centuries. But, as with\nmuch Paine wrote, the bluntness and sweeping rhetoric that alienates\nthe more philosophically inclined modern reader were an essential\nelement in his success and his continuing importance. Paine spoke to\nordinary people—and they read him in their\nthousands—indeed, he was often read aloud in public houses and\ncoffee shops. He claimed no authority over them, but helped them to\ndoubt those who did claim such authority, whether civil or religious,\nand he affirmed over and over again their right and responsibility to\nthink for themselves and to reach their own judgment on matters. He\ndid so at a time when the press had become capable of reaching even\nthe poorest of society—when the Attorney General launched the\nprosecution of Rights of Man (1792) he distinguished between\nthe first part, which was ‘ushered into the world under\ncircumstances that led me to conceive that it would be confined to the\njudicious reader’, and the second part, which ‘with an\nindustry incredible, it was either totally or partially thrust into\nthe hands of all persons in this country, of subjects of every\ndescription…Gentlemen, to whom are those positions, that are\ncontained in this book addressed…to the ignorant, to the\ncredulous, to the desperate.’ (State Trails v. 22,\n381–3).\n\nPaine would have embraced the description—although he was less\nof a ‘common man’ than many who have subsequently\neulogized him make him out to be. In many respects, he was a\nmoderately respectable radical, with a deep suspicion of the\nhierarchical systems of Europe, a brimming confidence in his own\njudgment that his experience in America confirmed—which\nexpressed itself in his willingness to tackle a range of subject\nareas, including bridge-building and scientific experiments—and\nwith a growing sense that he knew how to communicate, with powerful\neffect, with a popular audience at exactly the point at which that\npopular audience was beginning to feel and test its political\ninfluence.\n\nPaine was vehemently attacked in his own lifetime—if the\nscurrilous biography was not invented for him it certainly attained\nsomething of an art form in his depiction. He was outlawed in England,\nnearly lost his life in France, and was largely ostracized and\nexcluded when he returned to America. A sizable collection of papers\nat his New Rochelle farm were destroyed in a fire, and his oeuvre\nremains contested, at least at the margins. Biographers have drawn\nheavily on early work by Moncure Conway, but while several new\naccounts appear each decade few add much to our knowledge. Serious\nanalysis of his ideas is relatively rare, and tends to be more\nhistorically than philosophically orientated (although recent work by\nRobert Lamb does give his ideas serious philosophical attention, and\nvan Parijs’s work on Basic Income recognizes his importance).\nBut until very recently he has remained on the edges of the canon of\npolitical thought, easily dismissed by those who want more substantial\nphilosophical fare, and subject to fits of enthusiasm by writers who\nare either insufficiently attuned to the complexities of the period or\nare simply uncritical. Such an attitude does poor service to the\nhistory, to the ideas, or to the man.\n",
    "bibliography": {
        "categories": [
            "Archival Resources",
            "Paine’s Works",
            "Bibliographic works",
            "Contemporary Writing",
            "Modern Biography and Commentary"
        ],
        "cat_ref_text": {
            "Archival Resources": [
                "</h3>\n<ul class=\"hanging\">",
                "American Philosophical Society, Philadelphia, Richard Gimbel\nCollection of Thomas Paine manuscripts",
                "Indiana University, Bloomington, Lilly Library, Paine\ncollection",
                "Historical Society of Philadelphia, Paine Letters",
                "Norwich Central Library, Thomas Paine collection at Thetford: an\nanalytical catalogue",
                "Thomas Paine National Historical Association, New York",
                "Thomas Paine Society, Nottingham",
                "Bodleian Library, Petty MSS, letters to Lord Lansdowne\n</ul>\n<h3 id=\"PainWork\">"
            ],
            "Paine’s Works": [
                "</h3>\n<ul class=\"hanging\">",
                "P. S. Foner (ed.), 1945, <em>The Complete Writings of Thomas\nPaine</em>, 2 vols., Secaucus, NJ: The Citadel Press. [This is\nreferenced as <b>CW</b> in the text.]",
                "M. D. Conway (ed.), 1894, <em>The Writings of Thomas Paine</em>, 4\nvols., New York: G.P. Putnam’s Sons.",
                "Hazel Burgess (ed.), 2010, <em>Thomas Paine: A Collection of\nUnknown Writings</em>, Basingstoke, Hants: Palgrave MacMillan. [Many\nof the items in this collection are disputed. See (Philp 2011, p.\n185); and Clark, 2018, Appendix]\n</ul>\n<h3 id=\"BiblWork\">"
            ],
            "Bibliographic works": [
                "</h3>\n<ul class=\"hanging\">",
                "R. Gimbel, 1956, <em>Thomas Paine: A Bibliographical Checklist of\n‘Common Sense’</em>, New Haven: Yale University\nPress.\n</ul>\n<h3 id=\"ContWrit\">"
            ],
            "Contemporary Writing": [
                "</h3>\n<ul class=\"hanging\">",
                "F. Oldys [pseud for G. Chalmers], 1791/3, <em>The Life of Thomas\nPaine</em> London: Stockdale. [Is “G. Chalmers” an editor?]",
                "J. Cheetham, 1809, <em>The Life of Thomas Paine</em>,London.",
                "C. Rickman, 1819, <em>Life of Thomas Paine</em>, London: T.C.\nRickman.",
                "Edmund Burke, <em>Reflections on the Revolution in France</em>, in\nL. G. Mitchell (ed.), <em>The Writings and Speeches of Edmund Burke:\nVol VIII The French Revolution 1790–1794</em>, Oxford: Oxford\nUniversity Press, 1989.\n</ul>\n<h3 id=\"ModeBiogComm\">"
            ],
            "Modern Biography and Commentary": [
                "</h3>\n<ul class=\"hanging\">",
                "Abel, D., 1942, ‘The significance of the letter to the\nAbbé Raynal in the progress of Thomas Paine’s\nthought’, <em>Pennsylvania Magazine of History and\nBiography</em>, 66: 176–90",
                "Aldridge, A. O., 1960, <em>Man of Reason: The Life of Thomas\nPaine</em>, London: The Cresset Press.",
                "–––, 1984, <em>Thomas Paine’s American\nIdeology</em>, Cranbury, NJ: Associated University Presses.",
                "Armytage, W. H. G., 1951, ‘Thomas Paine and the Walkers: An\nearly episode in Anglo-American cooperation’, <em>Pennsylvania\nHistory</em>, 18: 16–30",
                "Ayer, A. J., 1988, <em>Thomas Paine</em>, London: Secker and\nWarberg.",
                "Bailyn, B., 1990, <em>Faces of Revolution: Personalities and\nThemes in the Struggle for American Independence</em>, New York:\nAlfred A. Knopf.",
                "Brent, C., Gage, D., Myles, P., 2009, <em> Thomas Paine in Lewes\n1768–1774: A Prelude to American Independence</em>, Lewes,\nSussex: PM Trading.",
                "Brent, C., 2009, ‘Thirty Something: Thomas Paine at Bull\nHouse in Lewes 1768–74—Six formative years’\n<em>Sussex Archaeological Collections</em>, 147: 153–67.",
                "Chiu, F., 2020, <em>The Routledge Guidebook to Paine’s\nRights of Man</em>, Abingdon, Oxon: Routledge.",
                "Claeys, G., 1989, <em>Thomas Paine: Social and Political\nThought</em>, Boston: Unwin Hyman.",
                "Clark, J. C. D., 2018, <em>Thomas Paine: Britain, America and\nFrance in the Age of Enlightenment and Revolution</em>, Oxford: Oxford\nUniversity Press.",
                "Clark, H. H., 1933, ‘An historical interpretation of Thomas\nPaine’s religion’, <em>University of California\nChronicle</em>, 35: 56–87",
                "–––, 1944, Introduction to <em>Thomas Paine:\nRepresentative Selections, with Introduction, Bibliography and\nNotes</em>, New York: Hill and Wang.",
                "Cleary, S., 2016, ed., <em>New Directions in Thomas Paine\nStudies</em>, Basingstoke, Hants: Pagrave/Macmillan.",
                "Conway, M. D., 1892, <em>The Life of Thomas Paine, with a History\nof his Literary, Political, and Religious Career in America, France,\nand England</em>, 2 volumes, London: Watts and Co.",
                "–––, 1900, <em>Thomas Paine (1737–1809) et\nla révolution dans les deux mondes</em>, Paris: Plon-Nourrit et\ncie.",
                "Copeland, T. 1950, ‘Burke, Paine, and Jefferson’, in\nhis <em>Edmund Burke: Six Essays</em>, London: Jonathan Cape, pp.\n146–89.",
                "Cotler, S. 2011, <em>Tom Paine’s America: The Rise and Fall\nof Transatlantic Republicanim in the Early Republic</em>,\nCharlottesville, VA: University of Virginia Press.",
                "Dyck, I. (ed.), 1988, <em>Citizen of the World: Essays on Thomas\nPaine</em>, New York: St. Martin’s Press.",
                "–––, 1933, ‘Local attachments, national\nidentities and world citizenship in the thought of Thomas\nPaine’, <em>History Workshop Journal</em>, 35: 117–35.",
                "Fennessy, R. R., 1963, <em>Burke, Paine, and the ‘Rights of\nMan’</em>, The Hague: Catholic University of Louvain.",
                "Foner, Eric, 1976, <em>Tom Paine and revolutionary America</em>,\nNew York: Oxford University Press.",
                "Fruchtman, Jack, 1994, <em>Thomas Paine: Apostle of Freedom</em>,\nNew York: Four Walls Eight Windows.",
                "–––, 1993, <em>Thomas Paine and the religion of\nnature</em>, Baltimore: Johns Hopkins University Press.",
                "–––, 2011, <em>The Political Philosophy of\nThomas Paine</em>, Baltimore: Johns Hopkins University Press.",
                "Hawke, D., 1974, <em>Paine</em>, New York: W. W. Norton.",
                "James, J. G., 1988, ‘Thomas Paine’s iron bridge work,\n1785–1803’, <em>Newcomen Society Transactions</em>, 57:\n189–221",
                "Kates, G., 1989, ‘From liberalism to radicalism: Tom\nPaine’s <em>Rights of man</em>’, <em>Journal of the\nHistory of Ideas</em>, 50: 569–87.",
                "Keane, J., 1995, <em>Tom Paine: A Political Life</em>, London:\nBloomsbury.",
                "Kaye, H. J., 2005, <em>Thomas Paine and the Promise of\nAmerica</em>, New York: Hill and Wang.",
                "Kramnick, I., 1990, ‘Tom Paine: radical liberal’,\nreprinted in I. Kramnick, <em>Republicanism and bourgeois radicalism:\npolitical ideology in late-eighteenth century England and\nAmerica</em>, Ithaca: Cornell University Press.",
                "Kuklick, B. (ed.), 2006, <em>Thomas Paine</em>, Burington, VT:\nAshgate.",
                "Lamb, R., 2015, <em>Thomas Paine and the Idea of Human\nRights</em>, Cambridge: Cambridge University Press.",
                "Lounissi, C., 2018, <em>Thomas Paine and The French\nRevolution</em>, Cham: Springer.",
                "Myles, P., 2018, <em>The Rise of Thomas Paine and the Case of the\nOfficers of Excise</em>, Lewes: The Thomas Paine Society.",
                "Nelson, C., 2006, <em>Thomas Paine: His Life, His Time and the\nBirth of Modern Nations</em>, London: Profile Books.",
                "Payne, E. A., 1947, ‘Tom Paine: preacher’, <em>Times\nLiterary Supplement</em> May 31, No. 2365, p. 267.",
                "Philp, M., 1989, <em>Paine</em>, Oxford: Oxford University\nPress.",
                "–––, 2011, ‘Review of Hazel Burgess\n(ed.), <em>Thomas Paine: A Collection of Unknown\nWritings</em>’, <i>English Historical Review</i>, 126(518):\npp. 185–7.",
                "–––, 1998, ‘Paine and science’,\n<em>Enlightenment and Dissent</em>, 16: 210–249.",
                "–––, 2007, <em>Thomas Paine</em>, Oxford: Oxford\nUniversity Press.",
                "–––,2013 <em>Reforming Ideas in Britain</em>,\nCambridge: Cambridge University Press.",
                "–––, 2019, ‘Paine and Socioeconomic\nRights’, <em>French History</em>, 33(4): 554–71.\ndoi:10.1093/fh/crz092",
                "Prochaska, F. K., 1972, ‘Thomas Paine’s “The age\nof reason revisited” ’, <em>Journal of the History\nof Ideas</em>, 33: 561–76.",
                "Robbins, C., 1983, ‘The lifelong education of Thomas Paine\n(1737–1809): Some reflections on his acquaintance among\nbooks’, <em>Proceedings of the American Philosophical\nSociety</em>, 127: 135–42.",
                "Roosevelt, T., 1888, <em>Gouverneur Morris</em>, Boston: Houghton\nMifflin.",
                "Speck, W. A., 2013, <em>A Political Biography of Thomas\nPaine</em>, London: Pickering and Chatto.",
                "Thomson, A., 1991, ‘Thomas Paine and the United\nIrishmen’, <em>Études Irlandaises</em>, 16:\n109–19.",
                "Turner, J., 1989, ‘Burke, Paine, and the nature of\nlanguage’, in J. R. Watson (ed.), <em>Yearbook of English\nStudies: The French Revolution in English Literature and Art</em>, 19:\n75–92.",
                "van Parijs, P., and Vandeborght, Y. 2017, <em>Basic Income: a\nRadical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.",
                "Vincent, B., 1987, <em>Thomas Paine, ou la religion de la\nliberté</em>, Paris: Aubier.",
                "–––, 1993, <em>Thomas Paine, ou la\nrépublique sans frontières</em>, Nancy: Presses\nuniversiaires de Nancy.",
                "Williamson, A., 1973, <em>Thomas Paine: His Life, Work and\nTimes</em>, London:George Allen.",
                "Wilson, D. A., 1988, <em>Paine and Cobbett: The Transatlantic\nConnection</em>, Montreal: McGill-Queen’s University Press.",
                "Woodward, W. E., 1945, <em>Tom Paine: America’s godfather,\n1737–1809</em>, London: Secker and Warberg.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<h3 id=\"ArchReso\">Archival Resources</h3>\n<ul class=\"hanging\">\n<li>American Philosophical Society, Philadelphia, Richard Gimbel\nCollection of Thomas Paine manuscripts</li>\n<li>Indiana University, Bloomington, Lilly Library, Paine\ncollection</li>\n<li> Historical Society of Philadelphia, Paine Letters</li>\n<li>Norwich Central Library, Thomas Paine collection at Thetford: an\nanalytical catalogue</li>\n<li>Thomas Paine National Historical Association, New York</li>\n<li>Thomas Paine Society, Nottingham</li>\n<li>Bodleian Library, Petty MSS, letters to Lord Lansdowne</li>\n</ul>\n<h3 id=\"PainWork\">Paine’s Works</h3>\n<ul class=\"hanging\">\n<li>P. S. Foner (ed.), 1945, <em>The Complete Writings of Thomas\nPaine</em>, 2 vols., Secaucus, NJ: The Citadel Press. [This is\nreferenced as <b>CW</b> in the text.]</li>\n<li>M. D. Conway (ed.), 1894, <em>The Writings of Thomas Paine</em>, 4\nvols., New York: G.P. Putnam’s Sons.</li>\n<li>Hazel Burgess (ed.), 2010, <em>Thomas Paine: A Collection of\nUnknown Writings</em>, Basingstoke, Hants: Palgrave MacMillan. [Many\nof the items in this collection are disputed. See (Philp 2011, p.\n185); and Clark, 2018, Appendix]</li>\n</ul>\n<h3 id=\"BiblWork\">Bibliographic works</h3>\n<ul class=\"hanging\">\n<li>R. Gimbel, 1956, <em>Thomas Paine: A Bibliographical Checklist of\n‘Common Sense’</em>, New Haven: Yale University\nPress.</li>\n</ul>\n<h3 id=\"ContWrit\">Contemporary Writing</h3>\n<ul class=\"hanging\">\n<li>F. Oldys [pseud for G. Chalmers], 1791/3, <em>The Life of Thomas\nPaine</em> London: Stockdale. [Is “G. Chalmers” an editor?]</li>\n<li>J. Cheetham, 1809, <em>The Life of Thomas Paine</em>,London.</li>\n<li>C. Rickman, 1819, <em>Life of Thomas Paine</em>, London: T.C.\nRickman.</li>\n<li>Edmund Burke, <em>Reflections on the Revolution in France</em>, in\nL. G. Mitchell (ed.), <em>The Writings and Speeches of Edmund Burke:\nVol VIII The French Revolution 1790–1794</em>, Oxford: Oxford\nUniversity Press, 1989.</li>\n</ul>\n<h3 id=\"ModeBiogComm\">Modern Biography and Commentary</h3>\n<ul class=\"hanging\">\n<li>Abel, D., 1942, ‘The significance of the letter to the\nAbbé Raynal in the progress of Thomas Paine’s\nthought’, <em>Pennsylvania Magazine of History and\nBiography</em>, 66: 176–90</li>\n<li>Aldridge, A. O., 1960, <em>Man of Reason: The Life of Thomas\nPaine</em>, London: The Cresset Press.</li>\n<li>–––, 1984, <em>Thomas Paine’s American\nIdeology</em>, Cranbury, NJ: Associated University Presses.</li>\n<li>Armytage, W. H. G., 1951, ‘Thomas Paine and the Walkers: An\nearly episode in Anglo-American cooperation’, <em>Pennsylvania\nHistory</em>, 18: 16–30</li>\n<li>Ayer, A. J., 1988, <em>Thomas Paine</em>, London: Secker and\nWarberg.</li>\n<li>Bailyn, B., 1990, <em>Faces of Revolution: Personalities and\nThemes in the Struggle for American Independence</em>, New York:\nAlfred A. Knopf.</li>\n<li>Brent, C., Gage, D., Myles, P., 2009, <em> Thomas Paine in Lewes\n1768–1774: A Prelude to American Independence</em>, Lewes,\nSussex: PM Trading.</li>\n<li>Brent, C., 2009, ‘Thirty Something: Thomas Paine at Bull\nHouse in Lewes 1768–74—Six formative years’\n<em>Sussex Archaeological Collections</em>, 147: 153–67.</li>\n<li>Chiu, F., 2020, <em>The Routledge Guidebook to Paine’s\nRights of Man</em>, Abingdon, Oxon: Routledge.</li>\n<li>Claeys, G., 1989, <em>Thomas Paine: Social and Political\nThought</em>, Boston: Unwin Hyman.</li>\n<li>Clark, J. C. D., 2018, <em>Thomas Paine: Britain, America and\nFrance in the Age of Enlightenment and Revolution</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Clark, H. H., 1933, ‘An historical interpretation of Thomas\nPaine’s religion’, <em>University of California\nChronicle</em>, 35: 56–87</li>\n<li>–––, 1944, Introduction to <em>Thomas Paine:\nRepresentative Selections, with Introduction, Bibliography and\nNotes</em>, New York: Hill and Wang. </li>\n<li>Cleary, S., 2016, ed., <em>New Directions in Thomas Paine\nStudies</em>, Basingstoke, Hants: Pagrave/Macmillan.</li>\n<li>Conway, M. D., 1892, <em>The Life of Thomas Paine, with a History\nof his Literary, Political, and Religious Career in America, France,\nand England</em>, 2 volumes, London: Watts and Co.</li>\n<li>–––, 1900, <em>Thomas Paine (1737–1809) et\nla révolution dans les deux mondes</em>, Paris: Plon-Nourrit et\ncie.</li>\n<li>Copeland, T. 1950, ‘Burke, Paine, and Jefferson’, in\nhis <em>Edmund Burke: Six Essays</em>, London: Jonathan Cape, pp.\n146–89.</li>\n<li>Cotler, S. 2011, <em>Tom Paine’s America: The Rise and Fall\nof Transatlantic Republicanim in the Early Republic</em>,\nCharlottesville, VA: University of Virginia Press.</li>\n<li>Dyck, I. (ed.), 1988, <em>Citizen of the World: Essays on Thomas\nPaine</em>, New York: St. Martin’s Press.</li>\n<li>–––, 1933, ‘Local attachments, national\nidentities and world citizenship in the thought of Thomas\nPaine’, <em>History Workshop Journal</em>, 35: 117–35.</li>\n<li>Fennessy, R. R., 1963, <em>Burke, Paine, and the ‘Rights of\nMan’</em>, The Hague: Catholic University of Louvain.</li>\n<li>Foner, Eric, 1976, <em>Tom Paine and revolutionary America</em>,\nNew York: Oxford University Press.</li>\n<li>Fruchtman, Jack, 1994, <em>Thomas Paine: Apostle of Freedom</em>,\nNew York: Four Walls Eight Windows.</li>\n<li>–––, 1993, <em>Thomas Paine and the religion of\nnature</em>, Baltimore: Johns Hopkins University Press.</li>\n<li>–––, 2011, <em>The Political Philosophy of\nThomas Paine</em>, Baltimore: Johns Hopkins University Press.</li>\n<li>Hawke, D., 1974, <em>Paine</em>, New York: W. W. Norton.</li>\n<li>James, J. G., 1988, ‘Thomas Paine’s iron bridge work,\n1785–1803’, <em>Newcomen Society Transactions</em>, 57:\n189–221</li>\n<li>Kates, G., 1989, ‘From liberalism to radicalism: Tom\nPaine’s <em>Rights of man</em>’, <em>Journal of the\nHistory of Ideas</em>, 50: 569–87.</li>\n<li>Keane, J., 1995, <em>Tom Paine: A Political Life</em>, London:\nBloomsbury.</li>\n<li>Kaye, H. J., 2005, <em>Thomas Paine and the Promise of\nAmerica</em>, New York: Hill and Wang.</li>\n<li>Kramnick, I., 1990, ‘Tom Paine: radical liberal’,\nreprinted in I. Kramnick, <em>Republicanism and bourgeois radicalism:\npolitical ideology in late-eighteenth century England and\nAmerica</em>, Ithaca: Cornell University Press.</li>\n<li>Kuklick, B. (ed.), 2006, <em>Thomas Paine</em>, Burington, VT:\nAshgate.</li>\n<li>Lamb, R., 2015, <em>Thomas Paine and the Idea of Human\nRights</em>, Cambridge: Cambridge University Press.</li>\n<li>Lounissi, C., 2018, <em>Thomas Paine and The French\nRevolution</em>, Cham: Springer.</li>\n<li>Myles, P., 2018, <em>The Rise of Thomas Paine and the Case of the\nOfficers of Excise</em>, Lewes: The Thomas Paine Society.</li>\n<li>Nelson, C., 2006, <em>Thomas Paine: His Life, His Time and the\nBirth of Modern Nations</em>, London: Profile Books.</li>\n<li>Payne, E. A., 1947, ‘Tom Paine: preacher’, <em>Times\nLiterary Supplement</em> May 31, No. 2365, p. 267.</li>\n<li>Philp, M., 1989, <em>Paine</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2011, ‘Review of Hazel Burgess\n(ed.), <em>Thomas Paine: A Collection of Unknown\nWritings</em>’, <i>English Historical Review</i>, 126(518):\npp. 185–7.</li>\n<li>–––, 1998, ‘Paine and science’,\n<em>Enlightenment and Dissent</em>, 16: 210–249.</li>\n<li>–––, 2007, <em>Thomas Paine</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––,2013 <em>Reforming Ideas in Britain</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2019, ‘Paine and Socioeconomic\nRights’, <em>French History</em>, 33(4): 554–71.\ndoi:10.1093/fh/crz092</li>\n<li>Prochaska, F. K., 1972, ‘Thomas Paine’s “The age\nof reason revisited” ’, <em>Journal of the History\nof Ideas</em>, 33: 561–76.</li>\n<li>Robbins, C., 1983, ‘The lifelong education of Thomas Paine\n(1737–1809): Some reflections on his acquaintance among\nbooks’, <em>Proceedings of the American Philosophical\nSociety</em>, 127: 135–42.</li>\n<li>Roosevelt, T., 1888, <em>Gouverneur Morris</em>, Boston: Houghton\nMifflin.</li>\n<li>Speck, W. A., 2013, <em>A Political Biography of Thomas\nPaine</em>, London: Pickering and Chatto.</li>\n<li>Thomson, A., 1991, ‘Thomas Paine and the United\nIrishmen’, <em>Études Irlandaises</em>, 16:\n109–19.</li>\n<li>Turner, J., 1989, ‘Burke, Paine, and the nature of\nlanguage’, in J. R. Watson (ed.), <em>Yearbook of English\nStudies: The French Revolution in English Literature and Art</em>, 19:\n75–92.</li>\n<li>van Parijs, P., and Vandeborght, Y. 2017, <em>Basic Income: a\nRadical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Vincent, B., 1987, <em>Thomas Paine, ou la religion de la\nliberté</em>, Paris: Aubier.</li>\n<li>–––, 1993, <em>Thomas Paine, ou la\nrépublique sans frontières</em>, Nancy: Presses\nuniversiaires de Nancy.</li>\n<li>Williamson, A., 1973, <em>Thomas Paine: His Life, Work and\nTimes</em>, London:George Allen.</li>\n<li>Wilson, D. A., 1988, <em>Paine and Cobbett: The Transatlantic\nConnection</em>, Montreal: McGill-Queen’s University Press.</li>\n<li>Woodward, W. E., 1945, <em>Tom Paine: America’s godfather,\n1737–1809</em>, London: Secker and Warberg.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "common good",
            "deism",
            "democracy",
            "property and ownership",
            "representation, political",
            "republicanism",
            "rights",
            "social minimum [basic income]",
            "sovereignty"
        ],
        "entry_link": [
            {
                "../common-good/": "common good"
            },
            {
                "../democracy/": "democracy"
            },
            {
                "../property/": "property and ownership"
            },
            {
                "../political-representation/": "representation, political"
            },
            {
                "../republicanism/": "republicanism"
            },
            {
                "../rights/": "rights"
            },
            {
                "../social-minimum/": "social minimum [basic income]"
            },
            {
                "../sovereignty/": "sovereignty"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=paine\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/paine/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=paine&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/paine/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=paine": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/paine/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=paine&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/paine/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://oll.libertyfund.org/?option=com_staticxt&amp;staticfile=show.php%3Ftitle=1743&amp;Itemid=27\" target=\"other\">Facsimile PDFs of the four volume Conway edition of Paine’s works</a>,\n a libertyfund.org"
        ],
        "listed_links": [
            {
                "http://oll.libertyfund.org/?option=com_staticxt&staticfile=show.php%3Ftitle=1743&Itemid=27": "Facsimile PDFs of the four volume Conway edition of Paine’s works"
            }
        ]
    }
}