{
    "url": "panentheism",
    "title": "Panentheism",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "John Culp\n<jculp@apu.edu>",
        "author_links": [
            {
                "mailto:jculp%40apu%2eedu": "jculp@apu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nJohn Culp\n&lt;<a href=\"mailto:jculp%40apu%2eedu\"><em>jculp<abbr title=\" at \">@</abbr>apu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Dec 4, 2008",
        "substantive revision Mon Apr 24, 2023"
    ],
    "preamble": "\n\n“Panentheism” is a constructed word composed of the\nEnglish equivalents of the Greek terms “pan”, meaning all,\n“en”, meaning in, and “theism”, derived from\nthe Greek ‘theos’ meaning God. Panentheism\nconsiders God and the world to be inter-related with the world being\nin God and God being in the world. While panentheism offers an\nincreasingly popular alternative to classical theism, both panentheism\nand classical theistic systems affirm divine transcendence and\nimmanence. But, classical theistic systems by prioritizing the\ndifference between God and the world reject any influence by the world\nupon God while panentheism affirms the world’s influence upon\nGod. On the other hand, while pantheism emphasizes God’s\nidentity with the world, panentheism maintains the identity and\nsignificance of the non-divine. Anticipations of panentheistic\nunderstandings of God have occurred in both philosophical and\ntheological writings throughout history (Hartshorne and Reese 1953; J.\nCooper, 2006). However, a rich diversity of panentheistic\nunderstandings has developed in the past two centuries primarily in\nChristian traditions responding to scientific thought (Clayton and\nPeacocke 2004). Although panentheism affirms God’s presence in\nthe world without losing the distinct identity of either God or the\nworld, specific forms of panentheism, drawing from different sources,\nexplain the nature of the relationship of God to the world in a\nvariety of ways and come to different conclusions about the nature of\nthe significance of the world for the identity of God. Panentheists\nhave responded to two primary criticisms: (1) the panentheistic God is\na limited God, and (2) panentheism cannot be distinguished from other\nforms of theism such as classical theism or pantheism.\n",
    "toc": [
        {
            "#Ter": "1. Terminology"
        },
        {
            "#His": "2. History"
        },
        {
            "#ConExp": "3. Contemporary Expressions"
        },
        {
            "#OntBas": "4. Nature of the God/world Relation"
        },
        {
            "#CriRes": "5. Criticisms and Responses"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Terminology\n\nBecause modern “panentheism” developed under the influence\nof German Idealism, Whiteheadian process philosophy, and current\nscientific thought, panentheists employ a variety of terms with\nmeanings that have specialized content.\n\nTheological terms as understood by panentheists:\n\n1. Classical Theism\nClassical theism as a specific form of theism understands God as\ntranscendent, immutable, impassible, timeless (Mullins 2020, 393).\nUltimate reality is a reality which is distinct from the world (J.\nCooper, 2008, 11; Stenmark, 2019, 30). This distinction at times\ndevelops into an ontological separation between God and the world that\nmakes any interaction between God and the world problematic. Classical\nChristian theism bases God’s immanence and presence in the world\non God’s transcendence. This priority of transcendence implies\nthat God’s presence is always partial. God’s difference\nfrom the world is crucial. Even if God’s relationship to the\nworld is dynamic rather than static, developing rather than fixed,\ndivine transcendence does not allow the world to affect God.\n2. Pantheism\nA type of theism that stresses the identity of God and the world\nontologically. This identity is expressed in different manifestations\nso distinctions can be made, but the distinctions are temporary. There\nis often a strong sense of necessity in God’s creation of the\nworld so that God as God must express deity in creation.\n3. Transcendence\nGenerally, God’s externality to the world so that God is\nunlimited by any other being or reality. Hegel and then Hartshorne,\nhowever, understand transcendence as including all the parts that make\nup the world in order to avoid any reality external to God that limits\nGod (Whittemore 1960, 141; Davis 2019, 8 [Other Internet\nResources]).\n4. Immanence\nGod’s presence and activity within the world. Panentheists\nassert that classical theism limits its affirmation of God’s\nimmanence by deriving God’s immanence from God’s\ntranscendence. God is present in every situation because God is\nunlimited by any reality external to God.\n5. Kenosis\nDivine self-emptying, or withdrawal, of divine attributes.\nTraditionally, the limitation of the exercise of the divine attributes\nresulted from the divine will whether in the case of Jesus’\nhuman life or in God’s relation to the creation.\n6. Essential Kenosis\nGod’s nature is self-giving and other-empowering. Thomas J.\nOord’s concept of essential kenosis bases the emptying of divine\nattributes on the divine nature rather than the divine will (Oord\n2015, 158–166).\n\n\nTerms influenced by the German Idealism of Hegel and Schelling:\n\n1. Dialectic\nThe presence of contradictory realities where the contradiction is\novercome by including elements from each of the contradictory elements\nin a synthesis that is more than the combination of each member of the\ncontradiction. Whitehead’s understanding of God’s\nredemption of evil by placing an evil event in a contrast to a good\nevent expresses a similar understanding although he is not as explicit\nas Hegel in understanding all of reality as a dialectical\ndevelopment.\n2. Infinite\nThe obvious understanding of the infinite is as a negation of any\nlimits such as a bounded space or time. However, many panentheists,\nand other thinkers (Williams 2010, 143), understand the infinite in a\npositive sense as the inclusion of all that is and that might be\n(Clayton 2008a, 152). Panentheists influenced by process philosophy\nemphasize that divine infinity deals with possibility not actuality\n(Dombrowski 2013, 253; Keller 2014, 80). In process thought, God\ncontains all possibilities and presents every possible response that\nan actual event might make to any events from the past that influence\nwhat that event becomes.\n3. Perichoresis\nThe ontological intermingling of Christ’s divine and human\nnatures and the ontological intermingling of the members of the\nTrinity (Otto 2001). This concept of intermingling has also been\nutilized to describe the Incarnation and the relationship between God\nand individuals/creation. Moltmann generalizes perichoresis to the\ncosmic realm by affirming the presence of God in the world and the\nworld in God (J. Cooper 2006, 252 citing Moltmann 1985, 17).\n\n\nTerms influenced by Whiteheadian process philosophy:\n\n1. Internal and External Relations\nInternal relations are relations that affect the being of the\nrelated beings. External relations do not change the basic nature or\nessence of a being. For panentheism, the relationship between God and\nthe world is an internal relationship in that God affects the world\nand the world affects God.\n2. Dipolar\nRefers especially to God as having two basic aspects. Schelling\nidentified these aspects as necessary and contingent. Whitehead\nreferred to God’s primordial and consequent natures meaning that\nGod has an eternal nature and a responsive nature. Whitehead\nunderstood all reality to be dipolar in that each event includes both\nphysical and mental aspects in opposition to a mind-body dualism.\nHartshorne identified these aspects as abstract and concrete.\n3. Panpsychism\nIn the most general description, panpsychism assumes that\nfundamental entities possess mental and physical properties\n(Göcke 2018, 208). Process panentheism and panpsychism are\nfrequently connected although neither entails the other. The basis for\nthe connection between panentheism and panpsychism is\nWhitehead’s concept that every actual occasion consists of a\nmental and physical pole. Whitehead understood this mental pole as\nalways present, but Philip Clayton understands mentality as emergent\n(Clayton 2020b).\n\n\nTerms related to current scientific thought:\n\n1. Research Program\nDrawing on scientific practice, a research program in philosophy\ninvolves central affirmations and auxiliary hypotheses which are\nconsistent with available data. Consistency with data, rather than\nbeing either true or false, characterizes research programs (Clayton\n2019).\n2. Dualism\nWhile dualism may refer to a variety of pairs of opposites, in\nscientific thought and process philosophy dualism refers to the\nposition that consciousness and matter are fundamentally different\nsubstances, or types of reality. Panentheists generally reject the\ndualism of consciousness and matter (Clayton 2004c, 3). As an\nalternative, panentheists tend to affirm that consciousness and matter\nare different manifestations of a basic ontological unity. This basic\nontological unity may take the form of panpsychism, in which all\nactualities include an element of mentality. Griffin prefers the term\n“panexperientialism” because all actualities have an\nexperiential component (2004, 44–45). Clayton takes an\nalternative approach to overcome the consciousness-material dualism by\nadvocating strong emergence in which ontologically different types of\nexistence develop out of the basic ontological unity (2004c,\n3–6). J. Leidenhag identifies difficulties with each of these\napproaches (2016).\n3. Reductionism\nThe properties of one scientific domain consists of properties of\na more elementary scientific domain (Kim 2005, 164). Modern\nreductionism primarily holds that all of reality can be explained by\nusing only physical, sub-atomic, entities and denies the existence of\nmental realities as a separate kind of existence. Any reference to a\nhigher type of existence results from a lack of information about the\nphysical entities that are involved. Causation always moves from the\nbottom-up, from the basic physical entities to higher forms of\norganization. For example, thought is caused by the physical\ncomponents of the brain. Reductionism allows for weak emergence but\nnot strong emergence and top-down causation (Davies 2006, 37).\nPanentheism critiques reductionism as an oversimplification of reality\nand the experience of reality.\n4. Supervenience\nGenerally refers to a relation between properties. Popular usage\nrefers to one property depending on another property such as mind\nbeing a quality that supervenes on physical structures. Analytic\nphilosophy instead emphasizes a logical relation between classes of\nproperties with a variety of understandings of the nature of the\nrelationship (Leuenberger 2008; McLaughlin and Bennett 2014).\n5. Emergence\nA. Meaning:\nEmergence is a process that occurs when a new property arises out\nof a combination of elements. The traditional example is that water\nemerges out of the combination of oxygen and hydrogen atoms in certain\nproportions. The concept of emergence arose in a scientific response\nto reductionistic explanations of reality that failed to recognize the\nimportance of a system as a whole as well as the parts of that whole\n(Clayton 2004a, 85). Four characteristics are involved in emergence:\n1) ontological monism but not physicalism, 2) emergence of properties\nthat are potential in complex objects, but absent from any of the\nobject’s parts, and distinct from any structural property of the\nobject, 3) recognizing distinct levels of causal relations, and 4)\ndownward causation that cannot be reduced to the structural\nmacro-properties (Clayton 2006a, 2–4). Emergence may be either\nstrong or weak. Strong emergence understands evolution to produce new\nand distinct levels characterized by their own laws, regularities, or\ncausal forces. Weak emergence holds that the new level follows the\nfundamental causal process of physics (Clayton 2004c, 9). Strong\nemergence is also known as ontological emergence and weak as\nepistemological emergence (Clayton 2006b, 67). Strong emergence holds\nthat genuinely new causal agents or processes come into existence over\nthe course of evolutionary history. Weak emergence insists that as new\npatterns emerge, the fundamental processes remain ultimately\nphysical.\nB. Role in panentheism:\nEmergence as a scientific concept helps explain the\n“in” of panentheism (Clayton 2004a, 84). The scientific\nrecognition of the limitations of reductionistic understandings of\nreality led to an interest in emergence as recognition of the\nimportance of the system as a whole as well as the parts of the whole\n(Clayton 2004a, 85). Further, the scientific understanding of matter\nas having a propensity to self-organization leading to a more and more\ncomplex system makes possible an internalist understanding of\nGod’s action and creativity (Clayton 2001, 209). Emergence\nprovides the best current way to understand the immanence of God in\nthe world (Clayton 2004a, 87) by exemplifying the radically different\nsorts of inclusion relations found in the natural world (Clayton\n2008a, 132).\n6. Top-Down Causation\nMore complex levels of objects or events affect less complex\nelements. A common example of top-down causation is the effect of\nthought upon a person’s body. This contrasts with bottom-up\ncausation where the simple is the cause of the more complex. In\nbottom-up causation, physical elements cause other, more complex,\nobjects or events. Scientists debate the possibility of top-down\ncausation (Davies 2006).\n7. Entanglement\nIn quantum theory, the correlation of two particles that originate\nin a single event even though separated from each other by significant\ndistance. Entangled objects behave in ways that cannot be predicted on\nthe basis of their individual properties. The impossibility of\nprediction can be understood epistemically if behavior is considered\nthe result of an average of many similar measurements or ontologically\nif behavior results from the existence of the world in an indefinite\nstate prior to measurement. Both Bohr’s indeterministic and\nBohm’s deterministic understandings of quantum theory accept\nthis relational understanding of physical processes. Understanding the\nworld as composed of persistent relationships among particles that are\nphysically separated provides a model based in science for\nunderstanding God’s relation to the world. God’s influence\ncan be present at the level of individual events although this\nentanglement would remain hidden from a local perspective. However,\nthe implications of entanglement for concepts of causality become even\nmore complex when considering the relation between God and the world.\nPolkinghorne suggests that causality may be active information,\n“pattern-forming operations” of what might be called\n“the causal principle”, rather than an exchange of energy\n(2010, 9).\n\n\nAlthough numerous meanings have been attributed to the\n“in” in panentheism (Clayton 2004b, 253), the more\nsignificant meanings are:\n\n1. Locative\nLocation that is included in a broader location. For example,\nsomething may be located in a certain part of a room. Such a meaning\nis problematic in reference to God because of the common understanding\nthat God is not limited by spatial categories. If spatial categories\ndo not apply to God in ordinary usage, to say something is located in\nGod becomes problematic. “In” then takes on metaphysical\nmeanings.\n2. Metaphysical basis for being\nBeings come into existence and continue to exist due to the\npresence of divine Being. The concept of participation in both\nclassical theism and panentheism often includes the understanding that\nthe world comes into being and continues to exist through taking part\nin God’s Being (Clayton 2008a, 118–119).\n3. Metaphysical-Epistemological basis for being\nPresence in God provides both identity and being. Karl\nKrause’s panentheism asserted a metaphysical structure that\ninvolved both how an entity differs from other entities\n(epistemological identity) and what it is in itself (ontological\nstatus) (Göcke 2013a).\n4. Metaphysical interactive potential\nNeither God’s actions nor the world is completely\ndetermined. This lack of complete determination leads to an\nunpredictable self-organizing relation of both God and the world based\non prior actualizations of each. “The ‘en’\ndesignates an active indeterminacy, a commingling of unpredictable,\nand yet recapitulatory, self-organizing relations” (Keller 2003,\n219).\n5. Emergence metaphor\nA more complex entity comes from at least a partial source.\n6. Mind/Body analogy\nThe mind provides structure and direction to the organization of\nthe organism of the body. The world is God’s body in the sense\nthat the world actualizes God as specifically who God is and manifests\nGod while different from God.\n7. Part/Whole analogy\nA particular exists in relation to something that is greater and\ndifferent from any of its parts and the total sum of the parts. The\nworld is in God because the world shares in the greater unity of\nGod’s being and action.\n\n2. History\n\nIn 1821, Karl Krause (1781–1832) used the explicit label of\n“panentheism” for apparently the first time. (See Pfeifer\n2020, 123, especially n. 1 for a brief discussion about the first\nexplicit use of the term “panentheism”.) However, various\nadvocates and critics of panentheism find evidence of incipient or\nimplicit forms of panentheism present in religious thought as early as\n1300 BCE. Hartshorne discovers the first indication of panentheistic\nthemes in Ikhnaton (1375–1358 BCE), the Egyptian pharaoh often\nconsidered the first monotheist. In his poetic description of the sun\ngod, Ikhnaton avoids both the separation of God from the world that\nwill characterize theism and the identification of God with the world\nthat will characterize pantheism (Hartshorne 1953, 29–30). Early\nVedantic thought implies panentheism in non-Advaita forms that\nunderstand non-dualism as inclusive of differences. Although there are\ntexts referring to Brahman as contracted and identical to Brahman,\nother texts speak of Brahman as expanded. In these texts, the perfect\nincludes and surpasses the total of imperfect things as an\nappropriation of the imperfect. Although not the dominant\ninterpretation of the Upanishads, multiple intimations of\npanentheism are present in the Upanishads (Whittemore 1988,\n33, 41–44). Hartshorne finds additional religious concepts of\nGod that hold the unchanging and the changing together in a way that\nallows for the development and significance of the non-divine in\nLao-Tse (fourth century BCE) and in the Judeo-Christian scriptures\n(1953, 32–38).\n\nIn philosophical reflection, Plato (427/428–348/347 BCE) plays a\nrole in the development of implicit panentheism although there is\ndisagreement about the nature of that role. Hartshorne drew a dipolar\nunderstanding of God that includes both immutability and mutability\nfrom Plato. Hartshorne understood Plato’s concept of the divine\nto include the Forms as pure and unchanging being and the World soul\nas changing and in motion. Although he concluded that Plato never\nreconciled these two elements in his understanding of the divine, both\naspects were present (1953, 54). J. Cooper maintains that Plato\nretained an essential distinction between the Good and the other\nbeings that Plato called gods. According to J. Cooper, Plotinus\n(204–270 CE) rather than Plato provided the basis for\npanentheism with his description of the physical world as an emanation\nof being from the One making the world part of the Ultimate (2006,\n35–39). However, Baltzly finds evidence in the Timaeus\nof a polytheistic view that can be identified as panentheistic\n(2010).\n\nFrom Plato to Schelling (1775–1854 CE), various theologians and\nphilosophers developed ideas that are similar to themes in\ncontemporary panentheism. These ideas developed as expressions of\ntheism. Proclus (412–485 CE) and Pseudo-Dionysus (late Fifth to\nearly Sixth century) drawing upon Plotinus developed perspectives in\nwhich the world came from God and understood the relationship between\nGod and the world as a dialectical relationship in which the world\ncame from God and returned to God (J. Cooper 2006, 42–46). In\nthe Middle Ages, the influence of Neoplatonism continued in the\nthought of Eriugena (815–877 CE), Eckhart (1260–1328 CE),\nNicholas of Cusa (1401–1464 CE), and Boehme (1575–1624\nCE). Although accused of pantheism by their contemporaries, their\nsystems can be identified as panentheistic because they understood God\nin various ways as including the world rather than being the world and\nbecause they used a dialectical method. The dialectical method\ninvolved the generation of opposites and then the reconciliation of\nthe opposition in God. This retained the distinct identity of God in\nGod’s influence of the world (J. Cooper 2006, 47–62).\nDuring the early modern period, Bruno (1548–1600 CE) and Spinoza\n(1631–1677 CE) responded to the dualism of classical theism by\nemphasizing the relationship between God and the world to the point\nthat the nature of any ontological distinction between God and the\nworld became problematic. Later thinkers such as the Cambridge\nPlatonists (Seventeenth century), Jonathan Edwards (1703–1758\nCE) (Crisp 2009), and Friedrich Schleiermacher (1768–1834 CE)\nthought of the world as in some way in God or a development from God.\nAlthough they did not stress the ontological distinction between God\nand the world, they did emphasize the responsive relationship that\nhumans have to God. Human responsiveness assumed some degree of human\ninitiative if not freedom, which indicates some distinction between\nGod and humans. The assumption of some degree of human initiative was\na reaction against the loss of freedom due to Spinoza’s close\nidentification between God and the world (J. Cooper 2006,\n64–90).\n\nThe nineteenth and twentieth centuries saw the development of\npanentheism as a specific position regarding God’s relationship\nto the world. The awareness of panentheism as an alternative to\nclassical theism and pantheism developed out of a complex of\napproaches. Philosophical idealism and philosophical adaptation of the\nscientific concept of evolution provided the basic sources of the\nexplicit position of panentheism. Philosophical approaches applying\nthe concept of development to God reached their most complete\nexpression in process philosophy’s understanding of God being\naffected by the events of the world.\n\nHegel (1770–1831) and Schelling (1775–1854) sought to\nretain the close relationship between God and the world that Spinoza\nproposed without identifying God with the world. Their concept of God\nas developing in and through the world provided the means for\naccomplishing this. Prior to this time, God had been understood as\nunchanging and the world as changing while existing in God (J. Cooper\n2006, 90). Schelling’s understanding of God as personal provided\nthe basis for the unity of the diversity in the world in a manner that\nwas more open than Hegel’s understanding. Schelling emphasized\nthe freedom of the creatures in relation to the necessity of\nGod’s nature as love. For Schelling, God’s free unfolding\nof God’s internal subjective necessity did not result in an\nexternal empirical necessity determining the world (Clayton 2000,\n474). This relationship resulted in vitality and on-going development.\nHartshorne classified this as a dipolar understanding of God in that\nGod is both necessary and developing (1953, 234). J. Cooper describes\nSchelling’s thought as dynamic cooperative panentheism (2006,\n95). Hegel found Schelling inadequate and sought a greater unity for\nthe diversity. He united Fichte’s subjective idealism and\nSchelling’s objective idealism to provide a metaphysics of\nsubjectivity rather than substance (Clayton 2008a, 125). Hegel’s\nunification of Fichte and Schelling resulted in a more comprehensive\nand consistent system still based upon change in God. God as well as\nnature is characterized by dialectical development. In his rejection\nof pantheism, Hegel understood the infinite as including the finite by\nabsorbing the finite into its own fuller nature. This retained divine\ntranscendence in the sense of the divine surpassing its parts although\nnot separate from the parts (Whittemore 1960, 141–142). The\ndivine transcendence provided unity through the development of the\nAbsolute through history. Karl Krause (1781–1832) in 1828\nlabeled Schelling’s and Hegel’s positions as\n“panentheism” in order to emphasize their differences from\nSpinoza’s identification of God with the world (Atmanspacher and\nvon Sas 2017, 1032). J. Cooper describes Hegel’s panentheism as\ndialectical historical panentheism (2006, 107).\n\nAs Darwin’s theory of evolution introduced history into the\nconceptualization of biology, Samuel Alexander (1859–1938),\nHenri Bergson (1859–1941), and C. Lloyd Morgan (1852–1936)\nintroduced development into the ways in which all of physical reality\nwas conceptualized. They then worked out positions that in a variety\nof ways understood God and the world as growing in relationship to\neach other. Although Hartshorne’s classification of\n“panentheism” did not include Alexander in the category of\n“panentheism,” only occasionally mentioned Bergson, and\nmade no reference to Morgan, Whitehead referred to all three of these\nthinkers positively. It may be too strong to claim that they\ninfluenced Whitehead (Emmett 1992), but they did provide the\nbackground for Whitehead’s and then Hartshorne’s\nsystematic development of process philosophy as an expression of\npanentheism. Hartshorne popularized the modern use of the term\n“panentheism” and considered Whitehead to be the\noutstanding panentheist (Hartshorne 1953, 273). Although Hartshorne\nmade several modifications to Whitehead’s understanding of God,\nthe basic structures of Whitehead’s thought were continued in\nHartshorne’s further development of Whitehead’s philosophy\n(Ford 1973, Cobb 1965). God, for process philosophy, is necessary for\nany actual world. Without God, the world would be nothing more than an\nunchanging existence radically different from the actual world of\nexperience. God as both eternal and temporal provides possibilities\nthat call the world to change and develop. God as eternal provides an\nactual source of those possibilities. However, if God is only eternal,\nthe possibilities would be unrelated to the actual world as it\npresently exists. Thus, Whitehead and Hartshorne understand the world\nto be present in God in order for the possibilities that lead to\ndevelopment to be related to the world (Hartshorne 1953, 273). The\nimplication of God’s inclusion of the world is that God is\npresent to the world and the world influences God. Although the\npresence of the world in God could be understood as a form of\npantheism, process philosophy avoids collapsing the world into God or\nGod into the world by maintaining a distinction between God and the\nworld. This distinction is manifest in the eternality of God and the\ntemporality of the world. It is also apparent in the freedom of the\nevents in the world. Although God presents possibilities to the events\nin the world, each event “decides” how it will actualize\nthose possibilities. The freedom of each event, the absence of divine\ndetermination, provides a way for process thought to avoid God being\nthe cause of evil. Since God includes the events of the world, God\nwill include the evil as well as the good that occurs in the world and\nthis evil will affect God since the world affects God’s\nactualization. But, because God does not determine the response of\neach event to the possibilities that God presents, any event may\nreject God’s purpose of good through the intensification of\nexperience and actualize a less intense experience. God does take this\nless intense, evil, experience into God’s self, but redeems that\nevil by means of relating it to the ways in which good has been\nactualized. Thus, God saves what can be saved from the world rather\nthan simply including each event in isolation from other events (J.\nCooper 2006, 174, 180).\n3. Contemporary Expressions\n\nAlthough recent developments of panentheism tend to continue the\nGerman Idealist tradition or the tradition of process philosophy,\ncontemporary panentheism demonstrates great diversity (see Michael\nBrierley 2004, 3). Many of these contemporary expressions of\npanentheism involve scientists and protestant theologians or\nphilosophers. But, articulations of forms of panentheism have also\ndeveloped among feminists, in the Roman Catholic tradition, in the\nOrthodox tradition, and in religions other than Christianity.\n\nUtilizing resources from the tradition of German Idealism, Jürgen\nMoltmann developed a form of panentheism in his early work, The\nCrucified God in 1974 (1972 for the German original), where he\nsaid that the suffering and renewal of all humanity are taken into the\nlife of the Triune God. He explicated his understanding of panentheism\nmore fully in The Trinity and the Kingdom in 1981.\nTheological concerns motivate Moltmann’s concept of panentheism.\nPanentheism avoids the arbitrary concept of creation held by classical\ntheism and the loss of creaturely freedom that occurs in Christian\npantheism (J. Cooper 2006, 248). The relationship between God and the\nworld is like the relationship among the members of the Trinity in\nthat it involves relationships and communities (Molnar 1990, 674).\nMoltmann uses the concept of perichoresis to describe this\nrelationship of mutual interpenetration. By using the concept of\nperichoresis, Moltmann moves away from a Hegelian understanding of the\ntrinity as a dialectical development in history (J. Cooper 2006, 251).\nThe relationship between God and the world develops because of\nGod’s nature as love that seeks the other and the free response\nof the other (Molnar 1990, 677). Moltmann does not consider creation\nnecessary for God nor the result of any inner divine compulsion.\nInstead, creation is the result of God’s essential activity as\nlove rather than the result of God’s self-determination (Molnar\n1990, 679). This creation occurs in a process of interaction between\nnothingness and creativity, contraction and expansion, in God. Because\nthere is no “outside” of God due to God’s infinity,\nGod must withdraw in order for creation to exist. Kenosis, or\nGod’s self-emptying, occurs in creation as well as in the\nincarnation. The nothing in the doctrine of “creation from\nnothing” is the primordial result of God’s contraction of\nGod’s essential infinity (J. Cooper 2006, 247). Moltmann finds\nthat panentheism as mutual interpenetration preserves unity and\ndifference in a variety of differences in kind such as God and human\nbeing, person and nature, and the spiritual and the sensuous (Moltmann\n1996, 307).\n\nIn his process panentheism, David Ray Griffin assumes that scientific\nunderstandings of the world are crucial and recognizes the\nimplications of scientific understanding for theology. However, his\nconcept of panentheism builds on the principles of process philosophy\nrather than scientific concepts directly. Griffin traces modern\natheism to the combination of understanding perception as exclusively\nbased on physical sensations, accepting a naturalistic explanation of\nreality, and identifying matter as the only reality. But, the\nemergence of mind challenges the adequacy of this contemporary\nworldview (2004, 40–41). He claims that the supernaturalistic\nform of theism with its emphasis upon the divine will does not provide\nan adequate alternative to the atheism of the late modern worldview\nbecause God becomes the source of evil. Griffin argues that\nsupernaturalistic theism makes God the source of evil because\nGod’s will establishes the general principles of the universe\n(2004, 37). Process panentheism provides a way to avoid the problems\nof both materialistic naturalism and classical theism (2004, 42).\nGriffin’s panexperientialism bases sensory perception on a\nnon-sensory mode of perception in order to explain both the mind-body\ninteraction and the God-world interaction. God and the world are\ndifferent entities but both are actual. They are numerically distinct\nbut ontologically the same, in Griffin’s terms, avoiding dualism\nand supernaturalism. God and events in the world interact through\nnon-sensory perception (2004, 44–45). Through this interaction,\nGod can influence but not determine the world, and the world can\ninfluence God’s concrete states without changing God’s\nessence. Process panentheism recognizes two aspects of the divine, an\nabstract and unchanging essence and a concrete state that involves\nchange. Through this dipolar concept, God both influences and is\ninfluenced by the world (2004, 43–44). Griffin understands God\nas essentially the soul of the universe although distinct from the\nworld. The idea of God as the soul of the world stresses the intimacy\nand direct nature of God’s relationship to the world, not the\nemergence of the soul from the world (2004, 44). Relationality is part\nof the divine essence, but this does not mean that this specific world\nis necessary to God. This world came into existence from relative\nnothingness. This relative nothingness was a chaos that lacked any\nindividual that sustained specific characteristics over time. However,\neven in the chaos prior to the creation of this world, events had some\ndegree of self-determination and causal influence upon subsequent\nevents. These fundamental causal principles along with God exist\nnaturally since these causal principles are inherent in things that\nexist including the nature of God. The principles cannot be broken\nbecause such an interruption would be a violation of God’s\nnature. An important implication of the two basic causal principles, a\ndegree of self-determination and causal influence, is that God\ninfluences but does not determine other events (2004, 43).\nGriffin’s understanding of naturalism allows for divine action\nthat is formally the same in all events. But this divine action can\noccur in a variable manner so that some acts are especially revelatory\nof the divine character and purpose (2004, 45).\n\nThe context of the science and religion discussion responds to the\nearly modern concept of an unchanging natural order which posed a\nchallenge to understandings of divine action in the world. The current\ndiscussion draws on the development of scientific information about\nthe natural world that can contribute to religious efforts to explain\nhow God acts in the world. Arthur Peacocke and Paul Davies have made\nimportant contributions as scientists. Peacocke developed his\nunderstanding of panentheism beginning in 1979 and continuing through\nworks in 2001, 2004, and 2006. Peacocke starts with the shift in the\nscientific understanding of the world from a mechanism to the current\nunderstandings of the world as a unity composed of complex systems in\na hierarchy of different levels. These emergent levels do not become\ndifferent types of reality but instead compose a unity that can be\nunderstood naturally as an emergentist monism. At the same time, the\ndifferent levels of complexity cannot be reduced to an explanation of\none type or level of complexity. The creative dynamic of the emergence\nof complexity in hierarchies is immanent in the world rather than\nexternal to the world (Peacocke 2004, 137–142). Similarly, Paul\nDavies describes the universe by talking about complexity and higher\nlevels of organization in which participant observers bring about a\nmore precise order (2007). An important scientific aspect of this\nconcept of complexity and organization is the notion of entanglement\nespecially conceptual level entanglement (Davies 2006, 45–48).\nAgain, the organization, which makes life possible, is an internal, or\nnatural, order rather than an order imposed from outside of the\nuniverse (Davies 2004). Peacocke draws upon this contemporary\nscientific understanding of the universe to think about the\nrelationship between God and the natural world. He rejects any\nunderstanding of God as external to nature whether it is a theistic\nunderstanding where God intervenes in the natural world or a deistic\nunderstanding where God initiates the natural world but does not\ncontinue to be active in the world. For Peacocke, God continuously\ncreates through the processes of the natural order. God’s active\ninvolvement is not an additional, external influence upon events.\nHowever, God is not identified with the natural processes, which are\nthe action of God as Creator (Peacocke 2004, 143–144). Peacocke\nidentifies his understanding of God’s relation to the world as\npanentheism because of its rejection of external interactions by God\nin favor of God always working from inside the universe. At the same\ntime, God transcends the universe because God is more than the\nuniverse in the sense of God being unlimited by the world. This\npanentheistic model combines a stronger emphasis upon God’s\nimmanence with God’s ultimate transcendence over the universe by\nusing a model of personal agency (Peacocke 2004, 147–151).\nDavies also refers to his understanding of the role of laws in nature\nas panentheism rather than deism because God chose laws that give a\nco-creative role to nature (2004, 104).\n\nPhilip Clayton begins with contemporary scientific understandings of\nthe world and combines them with theological concepts drawn from a\nvariety of sources including process theology. He describes\nGod’s relationship with the world as an internal rather than an\nexternal relationship. Understanding God’s relationship as\ninternal to the world recognizes the validity of modern scientific\nunderstandings that do not require any external source in order to\naccount for the order in the world. At the same time, God’s\ninternal presence provides the order and regularity that the world\nmanifests (2001, 208–210). Clayton agrees that the world is in\nGod and God is in the world. Panentheism, according to him, affirms\nthe interdependence of God and the world (2004a, 83). This affirmation\nbecame possible as a result of the rejection of substantialistic\nlanguage in favor of personal language in thinking of God.\nSubstantialistic language excludes all other actualities from any one\nactuality. Rejection of substantialistic language thus allows for the\ninteraction of beings. Clayton cites Hegel’s recognition that\nthe logic of the infinite requires the inclusion of the finite in the\ninfinite and points towards the presence of the world in God (Clayton\n2004a, 78–79). Clayton, along with Joseph Bracken (1995),\nidentifies panentheism as Trinitarian and kenotic (Clayton 2005, 255).\nIt is Trinitarian because the world participates in God in a manner\nanalogous to the way that members of the Trinity participate in each\nother although the world is not and does not become God. God freely\ndecides to limit God’s infinite power in an act of kenosis in\norder to allow for the existence of non-divine reality. The divine\nkenotic decision results in the actuality of the world that is taken\ninto God. But, for Clayton, God’s inclusion of finite being as\nactual is contingent upon God’s decision rather than necessary\nto God’s essence (2003, 214). Clayton affirms creation from\nnothing as a description of creaturely existence prior to God’s\ndecision. The involvement of the world in an internal relationship\nwith God does not completely constitute the divine being for Clayton.\nInstead, God is both primordial, or eternal, and responsive to the\nworld. The world does constitute God’s relational aspect but not\nthe totality of God (2005, 250–254). The best way to describe\nthe interdependence between God and the world for Clayton is through\nthe concept of emergence. Emergence may be explanatory,\nepistemological, or ontological. Ontological understandings of\nemergence, which Clayton supports, hold (1) monism but not\nphysicalism, (2) properties emerge in objects from the potentiality of\nan object that cannot be previously identified in the object’s\nparts or structure, (3) the emergence of new properties giving rise to\ndistinct levels of causal relations, and (4) downward causation of the\nemergent level upon prior levels (2006a, 2–4). Emergence\nrecognizes that change is important to the nature of the world and\nchallenges views of God as unchanging (Clayton 2006b, 320).\n\nA number of feminists advocate panentheism by critiquing traditional\nunderstandings of transcendence for continuing dualistic ways of\nthinking. Feminist panentheists conceive of the divine as continuous\nwith the world rather than being ontologically transcendent over the\nworld (Frankenberry 2011). Sallie McFague’s use of metaphors in\nboth theology and science led her to describe the world as God’s\nbody. McFague bases the metaphorical nature of all statements about\nGod upon panentheism (2001, 30). Furthermore, for McFague, panentheism\nsees the world as in God which gives priority to God’s name but\nincludes each person’s name and preserves their distinctiveness\nin the divine reality (2001, 5). God’s glory becomes manifest in\nGod’s total self-giving to the world so that transcendence\nbecomes immanence rather than being understood as God’s power\nmanifest in distant control of the world. Grace Jantzen also uses the\nmetaphor of the world as God’s body. Additionally, Jantzen\n(1998) and Gloria Schaab (2007) have proposed metaphors about the womb\nand midwifery to describe God’s relation to the world. Anna\nCase-Winters challenges McFague’s metaphor of the world as\nGod’s body. Case-Winters acknowledges that this metaphor\nmaintains God’s personal nature, offers a coherent way to talk\nabout God’s knowledge of and action in the world, recognizes\nGod’s vulnerable suffering love, and revalues nature and\nembodiment. But at least McFague’s early use of the\nworld-as-God’s-body metaphor tended towards pantheism and even\nher later introduction of an agential role for the divine still\nretains the possibility of the loss of the identity of the world.\nCase-Winters uses Jay McDaniel’s (1989) distinction between\nemanational, arising out of the being of the One, and relational,\npresent through relationship, understandings of God’s immanence\nin the world to establish a form of panentheism with a clearer\ndistinction between God and the world. The world is an\n“other” in relation to God rather than being a direct\nexpression of God’s own being through emanation for Case-Winters\n(30–32). Nancy Frankenberry contrasts McFague’s and\nCase-Winter’s two concepts of transcendence to the traditional\nhierarchical concept of transcendence. McFague’s concept is one\nof total immanence while Case-Winters holds a dialectic between\nindividual transcendence and immanence (2011).\n\nAlthough much of the development of panentheism takes place in the\ncontext of the Christian tradition, connections between other world\nreligions and panentheism have been identified. These connections\nrange from explicitly panentheistic traditions, to similarities to\nspecific beliefs and practices of a tradition, to beliefs and\npractices that could be developed into panentheistic positions.\nHartshorne in his discussion of panentheism included a section on\nHinduism (1953). Lorilai Biernacki considers Hinduism to be one of the\nmost panentheistic traditions (Biernacki 2014b). The concept of the\nworld as the body of the divine offers a strong similarity to Western\npanentheism. The Gita identifies the whole world, including\nall the gods and living creatures, as the Divine body. But the Divine\nBeing has its own body that contains the world while being more than\nthe world. While the Upanishads acknowledge the body of the Divine at\ntimes, the body of the divine is never identified as the cosmos. Most\nof the Tantrics hold a pantheistic view in which the practitioner is a\nmanifestation of the divine. Abhinavagupta, in the tenth century,\nprovided the first panentheistic understanding of the world as\nGod’s body. For him, differentiation is Shiva concealing his\nwholeness. Abhinavagupta also insisted that Shiva transcends the\ncosmos (Bilimoria and Stansell 2010, 244–258; Clayton 2010,\n187–189; and Barua 2010, 1–30. See also Hardy 2016;\nSilberstein 2017; and Stavig 2017). Other traditions where connections\nto panentheism have been found include Judaism (Artson 2014 and\nLangton 2016), Jainism (Chapple 2014), Confucianism (Lee 2014),\nBuddhism (Samuel 2014), and Sufism (Sharify-Funk and Dickson 2014).\nWhile these connections might imply a universalistic theology,\npanentheism affirms the importance of all religions and supports\ninter-religions dialogue (Biernacki 2014a, 6, 10).\n4. The Nature of the God/world Relation\n\nThe God/world relation plays a crucial role in the variety of\nexpressions of panentheism. Using metaphors to describe the\nrelationship between God and the world has been controversial. McFague\nargues that any attempt to do theology requires the use of metaphor\n(2001, 30) and for Peacocke the limitation of language requires the\nuse of models and metaphors in describing both God and the cosmos\n(Schaab 2008, 13). The primary objection to the dominant metaphor in\npanentheism of the world as God’s body is the substantialistic\nimplications of the term “body” that lead either to an\nontological separation between the world and God or to a loss of\nidentity for God or the world. Bracken finds that the soul–body\nmetaphor lacks clarity about the freedom and self-identity of the\ncreatures in relations to God (1992, 211). Case-Winters faults the\nsoul–body metaphor for tending to see the soul as dominating the\nbody and failing to recognize the world as a unified organism (1995,\n251, 254). Clayton proposes different levels of metaphor as the most\nadequate way to reconcile the conflict between divine action and the\nintegrity of the created realm (2003, 208).\n\nDescribing the God–world relation by use of the term\n“in” lacks precision in understanding the ontological\nnature of the relation due to the variety of meanings of\n“in”. Friedrich Wilhelm Joseph Schelling used the phrase\n“Pan+en+theism” in his “Essay on Freedom” in\n1809 where the “en” meant inherence as strong ontological\ndependence and referred to participation as a relation to the divine\n(Clayton 2008a, 169). Karl Krause (1781–1832) created the German\nterm translated as “panentheism” seeking to overcome the\nsplit between humanity and nature that was expressed both in the\nsupernaturalist theism epitomized by Leibniz and the naturalism of\nSpinoza’s pantheism (Gregersen 2004, 28). Metaphysical\nunderstandings of God’s relation to the world have been proposed\nthat are more precise than metaphors or “in”.\nSchelling’s German idealism understood God as freely unfolding\nemanation by introducing subjectivity. Emanation avoids ontological\nseparation between God and the world because the world participates in\nthe infinite as its source (Clayton 2000, 477–481). Krause\nunderstood the world’s participation in God both ontologically\nand epistemically. The particularity of each existent being depends\nupon the Absolute for its existence as what it is (Göcke 2013a,\n372). Keller offers another metaphysical understanding by arguing for\ncreation out of chaos. She rejects substance metaphysics and describes\nthe relation between God and the world as a complex relationality\ninvolving an active indeterminacy and past realities (2003, 219).\nFinally, the science and religion discussion provides another\nmetaphysical understanding by drawing upon scientific concepts of\nsupervenience, emergence, downward causation, and entanglement to\nprovide a ground for theological concepts of God’s relation to\nthe world.\n\nThe nature of this mutual relationship between the infinite and the\nfinite basically depends upon the understanding of the ontology of\neach member of the relationship. The issue is the nature of being for\nGod and for the world as the basis for mutual influence between God\nand the world. A variety of attempts have sought to describe the\nnature of God’s being and the world’s being in their\nrelationship. Thomistic thought utilizes a concept of analogy as it\nwrestles with the nature of the being of God and the being of the\nworld (Malloy 2014). Others in considering God’s action in the\nworld posit the necessity of ontological difference between God and\nfinite reality (M. Leidenhag 2014, 219). Process thought directly\naddresses the issue of ontology by calling for an ontology that does\nnot consider substance as the basic type of existence because\nsubstance does not allow for internal relations (Bracken 2014, 10).\nAccording to Wesley Wildman the relations between entities are\nontologically more fundamental than the entities themselves for\nrelational ontology in contrast to substantivist ontology where\nentities are ontologically primary and relations derivative (2010,\n55).\n\nHistorically, participation, Hegelian dynamic ontology, and process\ndynamic ontology have been utilized to describe the ontological basis\nfor the relations between God and the world. Participation has\nphilosophical antecedents in Plato and Aristotle and was utilized in\nAugustinian and Orthodox Christian traditions. In participation, the\nexistence of the world somehow takes part in God’s being. Early\nmodern usage of the concept of participation appears in the thought of\nKrause (1781–1832) and Sergei Bulgakov (1871–1944). Krause\nidentifies the character of each thing as the result of its\nparticipation in the original unity of the Absolute. But the Absolute\nis still different from its parts in its internal constitution\n(Göcke 2013a, 372). Bulgakov describes participation as the\ninclusion of the finite by the Absolute (Gavrilyuk 2015, 453).\nHegelian dynamic ontology describes an Infinite which gives rise to\nthe finite through a dialectical process of negation. The finite\nthrough a second reciprocal negation of its finitude brings about\nunion and return in transformation to both the Infinite and the finite\n(Williams 2010, 143). Process dynamic ontology understands God as\ndipolar with a primordial nature that is eternal and a consequent\nnature that includes the actualizations achieved by the world. God\npresents possibilities to the events of the world which then make\ndecisions bringing about actualities that are then included in\nGod.\n\nBracken and Cazalis seek to make the ontological nature of the\nrelation more precise. Bracken proposes a Trinitarian field theory to\nexplain the world’s presence in God. The world is a large but\nfinite field of activity within the all-comprehensive field of\nactivity constituted by the three divine persons in ongoing relations\nwith each other and with all the creation (2009, 159). Bracken’s\nTrinitarian field theory draws on systems theory from science,\nWhitehead’s concept of society, and Christian Trinitarian\ndoctrine. A society as a type of system is a group of entities with an\norganizing principle. Basically, reality is an all-encompassing\nsociety in which subsocieties operate in their own ways as distinct.\nGod functions as the regnant subsociety and receives the richness of\nthe information from the world of creation (Bracken 2014, 80). Bracken\nsummarizes this system understanding of panentheism in three\nconclusions: (1) systems are social rather than individual, can be\ncombined horizontally and vertically, change over time due to changes\nin constituents, and do not make decisions; (2) the three divine\npersons and all their creatures are together constituent members of an\nexpanded divine life-system; and (3) the relationships of the various\nlevels of societies involve both bottom-up causation and an objective\nformal top-down causation of the constraints of higher order systems\non lower order systems (2015a, 223). Although not as fully developed\nas Bracken’s society explanation, Cazalis uses category theory\nand the concept of adjunction in order to offer an internal law that\ngives specificity to panentheism. In this approach relations go both\nways between two categories and the link carries the universal\nproperty from one element of a given category to another category\n(Cazalis 2016, 210).\n5. Criticisms and Responses\n\nPanentheism continues to develop. This growth has led to diverse forms\nof panentheism such as soteriological, revelational or expressivist,\nand dipolar (Gregersen 2004, 21). The variety of forms of panentheism\nhas also resulted in different degrees of panentheism ranging from\nexplicit fully developed panentheism to vague and underdeveloped forms\nof panentheism and to expressions of theism that share certain\nconcepts with fully developed forms of panentheism. Michael Brierley\nlists three premises as distinctive to panentheism: God is not\nseparate from the cosmos, God is affected by the cosmos, and God is\nmore than the cosmos (2006, 639–640). Fully developed\npanentheism includes thinkers such as Charles Hartshorne, Phillip\nClayton, Leonardo Boff, Peter Hodgson, John Macquarrie, Sallie\nMcFague, Jürgen Moltmann, and Arthur Peacocke who have identified\nthemselves as panentheists. Other thinkers such as Paul Tillich have\nrarely self-identified as panentheists but share concepts with\npanentheism (Burch 1998, 251). And finally, especially through world\nreligions and early theologies various forms of theism offer diversity\nsharing certain concepts with panentheism.\n\nAnother impetus for development has been criticisms of panentheism.\nThese criticisms have taken two forms. One form, by major alternatives\nto panentheistic understandings of the God-world relation, has\ncriticized the adequacy of panentheism. Panentheism faces challenges\nboth from those who resist any lessening of the emphasis upon divine\ntranscendence and from those who find pantheism more adequate than any\nsystem distinguishing between God and the world. Recently, an\nimportant criticism, especially from Analytic theology, has been that\npanentheism lacks the distinctiveness needed to identify it precisely\nenough to distinguish it from other forms of theism, critique it, and\nfurther its development. Finally, the variety of the versions of\npanentheism has led to an active internal discussion among the various\nversions.\n\nCriticisms of panentheism from major alternatives such as pantheists\nand scientists working with naturalist assumptions criticize\npanentheism for its metaphysical claim that there is a being above or\nother than the natural world. At times, this criticism has been made\nby claiming that a thorough-going naturalism does not need a\ntranscendent, individualized reality. Robert Corrington describes the\ndevelopment of his thought as a growing awareness that panentheism\nunnecessarily introduces a being above nature as well as in nature\n(2002, 49). William Drees expresses a similar criticism by arguing\nthat all contemporary explanations of human agency, including\nnon-reductionist explanations, are naturalistic and do not require any\nreference to a higher being. For panentheists to claim that divine\nagency is analogous to human agency fails both to recognize that human\nagency requires no additional source or cause and to explain how a\ndivine source of being could act in the realm of physical and mental\nprocesses (1999). Frankenberry makes this objection more specific.\nPanentheism offers a more complex relationship between God and the\nworld than is necessary. This unnecessary complexity is revealed by\nthe problems that panentheism has with the logic of the freedom of\nparts in wholistic relations, the possibility of the body-soul analogy\nrelapsing into gender inflected ideas of the soul as the male\nprinciple, the problem with simultaneity of events in the divine\nexperience in relation to the principle of the relativity of time, the\nnecessity of the everlasting nature of value, and finally the use of\nthe ontological argument to establish the necessity of the abstract\npole of the divine nature (1993, 36–39). Carl Gillett points out\nthat panentheism lacks an explanation for a causal efficacy higher\nthan the causal efficacy realized by microphysical causation (2003,\n19). Generally, panentheists respond to these criticisms by claiming\nthe inadequacy both scientifically and metaphysically of any type of\nreductionistic naturalism. Such a naturalism whether articulated in\nscientific categories or religious categories fails to recognize the\nemergence of levels of complexity in nature. The emergence of higher\nlevels of organization that cannot be completely explained in terms of\nlower levels renders non-differentiated accounts of being inadequate.\nPanentheists often argue that the emergence of higher levels of order\nmakes possible downward causation. Davies describes the difficulties\nin coming to a clear description of downward causation and concludes\nthat the complexity of systems open to the environment makes room for\ndownward causation but has not yet provided an explanation of how\ndownward causation works (2006, 48). The concepts of entanglement and\ndivine entanglement may offer a new perspective on causation and\nespecially the role of the divine in natural causation (Wegter-McNelly\n2011).\n\nThe basic theological criticism of panentheism is that its concept of\nGod is inadequate. J. Cooper concludes that panentheists reduce the\nscope and power of God’s immanence (J. Cooper, 2006, 330). M.\nLeidenhag criticizes the panentheist rejection of ontological\ndifference between divine influence and natural causes for making the\nnotion of divine influence ontologically superfluous (M. Leidenhag\n2014, 209–210). Similarly, Mariusz Tabaczek requires that the\ndifference between God and the world hold that God is distinct and\nutterly different from all created entities (Tabaczek 2022, 631). The\npanentheistic God changes because God needs the world and thus is\nchanged by changes in the world (Tabaczek 2022, 633). Because God\nchanges, God is not essentially identical to God, God’s aseity\nis compromised by including potential rather than being fully actual\n(Tabaczek 2022, 634). God loses metaphysical independence from\ncreatures, and has only a relative transcendence, transcendence of\ndifference rather than transcendence of being (Tabaczek 2022, 634).\nEfforts to justify a mutual relation fail to recognize that relation\nis posterior to substance, things need to be what they are in order to\nrelate (Tabaczek 2022, 638). If God is not ontologically different\nfrom the world, God lacks the omni characteristics and an adequate\ntype of transcendence. According to J. Cooper, if God’s\ntranscendence does not infinitely exceed God’s immanence,\nGod’s presence, knowledge, and power are limited rather than\ncomplete, immediate, and unconditioned (J. Cooper 2006,\n322–328). Whitehead’s understanding of God’s\ntranscendence is limited because God only influences events before or\nafter the decisions of the events. Likewise, Hegel’s denial of\ndivine simplicity makes ontological difference between God and the\nworld impossible thus limiting God’s transcendence (Tabaczek\n2013, 151, 154).\n\nThe panentheistic response to the foundational issue of the\nontological distance between God and world is that the essential\ndifferences between God and the world adequately distinguish God from\nthe world. Clayton argues that the differences in essence and function\nbetween God and creation preserve the divinity of God (Clayton 2001,\n10). Humans are constituted by free and finite relatedness but God has\na primordial and essential nature (Clayton 2005, 254). Real change\ndoes occur in the divine experience, but not in the divine nature\n(Clayton 2019, 9). God is prior to the evolution of the natural world\nbecause creation is contingent (Macallan, 376). The divine act of\ncreation exceeds the individual identities and their transcendence\nover other created beings. Divine transcendence is not mere\nself-transcendence of created beings because the actions of all finite\nagents participate in the divine act (Clayton 2008a, 216). God’s\ntranscendence is found in God’s awareness of all that occurs\nwithin the world but this transcendence is much more intimate than an\nexternalist or substantialist model can account for (Clayton 2008a,\n148).\n\nTop-down causation indicating God’s vertical transcendence is a\nfurther response that Clayton and others have made to critiques about\nthe absence ontological difference. But Jensen finds this inadequate\nbecause they are unable to verify clearly God’s presence in the\ncausal nexus of the world (2014, 131). However, Bracken rejects the\nnecessity of a causal joint when both top-down and bottom-up causation\ntakes place (2014, 10). Also, Clayton counters that few process\npanentheists accept a full equality between finite actual occasions\nand the divine actual occasion or occasions. While God and finite\nrealities are equal in having existence, God being the chief\nexemplification of creativity indicates a difference between God and\nactual occasions and thus a vertical transcendence (Clayton 2015b,\n27). Finally, Bracken’s field understanding of panentheism gives\npriority to God as the regent subsociety that communicates a unifying\npatter of operation just as mind does in human existence (2014,\n79–80).\n\nSeveral challenges to panentheism claim that the absence of an\nontological difference between God and the world means that\npanentheism cannot account for God’s causal influence on the\nworld. J. Leidenhag concludes that salvation through emergence as the\nmeans of divine action cannot explain how an individual can accelerate\nevolutionary development to significant change rather than gradual\ndevelopment (J. Leidenhag 2016, 872). M. Leidenhag thinks that the\nabsence of ontological difference runs the risk of making the notion\nof divine influence ontologically superfluous (M. Leidenhag 2014,\n209–210). Panentheistic explanations of divine causation argue\nthat the differences between God and the world allow for divine\ncausation without control of creation. Clayton argues that differences\nin essence and function between God and the world preserve the\ndivinity of God so that it is not necessary to locate creation outside\nof God (2001, 210). Bringing emergence together with transcendence\nrecognizes that the physical is not closed and in downward causation\ncan be influenced by the non-physical. Science is coming to understand\nmatter as having a propensity to self-organization leading to more and\nmore complex systems that display new qualities that are not present\nat simpler stages (Clayton 2001, 209). “Just as the\nneurophysiological structure of the higher primates is ‘upwardly\nopen’ to the emergence and causal power of the mental, so the\nmental or cultural world is upwardly open to the influence of the\nCreator Spirit.” (Clayton 2003, 211). This makes possible an\ninternalist understanding of God’s action and creativity.\nConcepts of emergence and system levels avoid the dilemma between\nupward and downward causation by understanding causation as circular,\ninvolving interacting effects between different levels of organization\n(Clayton 2008a, 68). Bringing emergence together with transcendence\nrecognizes that a divine source entails divine involvement with the\nworld (Clayton 2004c, 185). Divine causality is best understood as a\nform of causal influence that prepares and persuades. History in this\nsense is the result of divine persuasion and is open (Clayton 2008a,\n198).\n\nHowever, a concept of divine causation risks raising the problem of\nevil if divine causation is the sole source of reality. J. Leidenhag\npoints out that if God generates the world with all its inequality and\ninjustice God becomes responsible for evil with all the issues of\ntheodicy (J. Leidenhag 2016, 879). Thomas J. Oord illustrates a\ntypical panentheist response to the critique that a panentheist\nconcept of God makes God responsible for evil. For Oord, God’s\nlove is inherently uncontrolling (Oord 2019, 30). God’s love\nempowers others giving them the possibility of choosing to do evil.\nGod does not create or cause evil. Clayton describes all the actions\nof finite agents as participating in the divine act in a way that\ntheir partial autonomy of action is preserved (Clayton 2008a, 216).\nThe autonomy of finite actions makes possible the existence of\nevil.\n\nBut if God does not control all that happens, the question of if God\ncan guarantee the defeat of evil arises. If God cannot finally\novercome evil, God is not worthy of worship. A closely related\ncritique is that the panentheistic God is unable to guarantee a future\ngood. While panentheists agree that human freedom logically precludes\nGod’s prevention of future evil that results from human choice,\nmany affirm that God’s response to unpreventable evil is that\nGod suffers with the person suffering evil. However, God’s\nsuffering with a person does not offer any guarantee that evil will be\novercome. But the support of a relationship with God does offer a\nbasis for the hope of overcoming evil. Clayton and Bracken maintain\nthat the world does influence God but God’s will, expressed\nthrough the decisions that God makes, protects God’s ability to\nsave (Clayton 2005). Moltmann’s description of God’s\nessence as directing God’s activity in order to maintain the\nreliability of God as love acting on behalf of creation provides an\nexplanation of how God acts to overcome evil. Moltmann does not find\nit necessary to protect divine freedom by giving it priority over\ndivine love but rather understands freedom as acting according to the\ndivine nature of love (Moltmann 1981, 98, 99). Even more specifically,\nGriffin’s discussion of divine variable action allows for\nspecific and distinctive manifestations of divine love (2004, 45).\nBut, Alexander Jensen criticizes the ability of the panentheist\nconcept to save by distinguishing between salvation by God and\nsalvation through agents of their own salvation (2014, 12–13).\nFor him a process panentheist’s God can only draw and persuade\nrather than save (Jensen 2014, 128). Kenneth Pak concludes that an\nopen future makes any ultimate victory over evil impossible (2014,\n223–224). In response, B. Cooper lists five ways in which a\nprocess theology supports God’s power over other realities and\nevil: 1) ontological priority in providing definition, God’s\nexistence establishes the nature of all that exists, 2) universality\nto all actuality, actual existence occurs due to divine actuality, 3)\nas the ground of novelty, God makes possible new realities, 4) as the\nground and preserver of all value, God preserves all value, and 5) as\nthe unconditioned character of God’s integrity seeking to\nincrease value in the world and love towards the world, God’s\nincrease of value and love depends only upon God (1974, 102). Palmyre\nOomen finds three similar elements in Whitehead’s thought that\nrelate to God’s governing and sustaining the world: 1) God\noriginates all occasions by presenting the initial aim which provides\nsome direction against evil, 2) God preserves all that can be\npreserved, and 3) God as everlasting means that no occasion can\novercome God forever (2015, 287–288).\n\nAnalytic theology (Jeanine Diller and Asa Kasher, eds. 2013; Andrei A.\nBuckareff and Yujin Nagasawa, eds. 2016) offers a different type of\ncritique of panentheism. Analytical approaches to panentheism critique\npanentheism as lacking a distinctive identity making careful\nidentification, research, and development of a distinctive position\nimpossible. Two responses to this challenge to identify the\ndistinctiveness of panentheism have developed. One response seeks to\nidentify a defining characteristic. The second response affirms the\nrichness of diversity and suggests certain commonalities distinguish\npanentheism from other forms of theism.\n\nBenedikt Göcke’s effort to identify a specific\ncharacteristic of panentheism notes the similarities of classical\ntheism and panentheism and concludes that the crucial difference is a\nmodal difference in that the world is not necessary for God in\nclassical theism while the world is necessary for God in panentheism\n(2013b). Raphael Lataster challenges Göcke’s limitation of\nthe distinction between classical theism and panentheism by claiming\nthat panentheism’s rejection of divine immutability\ndistinguishes panentheism from classical theism (2014). Göcke\nrejects this distinction as failing to recognize that spatial\nreferences are not adequate in dealing with metaphysical rather than\nphysical or logical necessity (2014). Göcke makes the\nrequirements for the distinction between classical theism and\npanentheism more specific by calling for a consistent definition of\n“in” by panentheists and by noting the presence of\nlogically contradictory but self-consistent interpretations of key\nnotions by various panentheists (2015). Yujin Nagasawa develops the\nconcept of modal panentheism by describing modal panentheism as\nholding that God is the totality of all possible worlds and that all\npossible worlds exist to the same extent that the actual world exists.\nThus, God includes all possible worlds and any actual worlds. But\nNagasawa also notes that modal panentheism has some similarities to\nclassical theism which limits any modal distinction between classical\ntheism and panentheism (2016). R. T. Mullins provides further evidence\nand refinement in identifying the distinctiveness of panentheism by\npointing out similarities among panentheism, open theism, and\nneo-classical theism and by critiquing Göcke’s modal\ndistinction as failing to say anything unique about God. Both modal\ndistinctions and considering the world as God’s body fail\nbecause they do not say anything unique about the nature of God\n(2016). Mullins offers an analytic response to the challenge regarding\nthe distinctiveness of panentheism by suggesting that panentheism can\ndistinguish itself from classical theism by making absolute space and\ntime attributes of God and by recognizing the distinction between\nabsolute time and space and physical and temporal realities contained\nwithin absolute time and space. Such a distinction offers a literal\nunderstanding of “in” in contrast to classical theism\n(2016). Oliver Crisp critiques Mullins’s identification of\nabsolute space and time as attributes of God because that appears to\nmake God spatial and temporal (2019, 30–31). Pfeifer finds that\nMullins’s identification of absolute time and space is helpful\nbut lacks clarity as to whether absolute time and space are attributes\nof God or the substance of God (2020, 130).\n\nA different response to the challenge that panentheism lacks a\ndistinctive characteristic suggests a symmetrical, mutual relation\nbetween God and the universe as the crucial characteristic of\npanentheism (Griffin 2004, 43–44; Keller 2008, 73; Clayton 215a,\n189; Gregersen 2004, 20, 22, 23; J. Cooper 2006, 29; Olson 2013, 330;\nMeister 2017, 5; Henriksen 2017, 1084; Stenmark 2019, 27; Gasser 2019,\n50).\n\nA variety of terms have been used to describe a mutual relation\nbetween God and the universe. Daniel Dombrowski (2013a, 32) described\nGod’s relation to the universe as an organic relation in that\nGod and the universe influence each other. Niels Gregersen (2004, 20),\ncited by Stenmark (2019, 29), uses the phrase “bilateral\nrelations”. Stenmark calls God’s relation to the world an\n“ontological symmetrical” relation in comparison to\nclassical theism’s “asymmetrical” ontological\ndependence. The basic nature of a mutual relation between God and the\nuniverse involves an influence of each member of the relationship on\nthe other member and assumes some degree of independence or freedom of\neach member.\n\nA mutual relation differs from the understanding of the God/world\nrelation in classical Christian theism. Panentheism and classical\nChristian theism both distinguish between God and the world. Classical\ntheism identifies this as an ontological difference. God’s being\ndiffers from the being of the world. Göcke calls this a model\ndifference in which God’s existence is necessary while the\nworld’s existence is contingent (2013b). Stenmark describes this\nas God being ontologically distinct from the world in classical theism\nand contrasts that with panentheism as holding that God ontologically\nincludes the world (2019, 19, 27; Göcke 2017, 5–6). At\ntimes, classical Christian theism maintains the ontological difference\nbetween God and the world while allowing for the influence of the\nworld upon God by distinguishing between God’s ontological\nnature and God’s conceptual knowledge of the world or\nGod’s compassion for the world (Göcke 2017, 3). God’s\nknowledge may change as the world changes and God’s care may\nrespond to different events in the world, but God’s existence or\nessence is not changed (Stenmark 2019, 30). While God is immanent and\nactive in the world as well as transcendent for classical Christian\ntheism, the relationship between God and the universe is asymmetrical\nin that God influences the universe, but the universe does not affect\nGod (J. Cooper, 2006, 18, 22 and Stenmark 2019, 30). The world changes\nbecause of God’s presence in the world, but this dynamic\nrelationship does not indicate any change in God’s nature or\nwill.\n\nThe balance between God’s transcendence and God’s\nimmanence further refines the distinctiveness of panentheism’s\nmutual relation between God and the universe in distinction from both\nclassical Christian theism and pantheism. By deriving divine immanence\nfrom divine transcendence, classical Christian theism prioritizes\nGod’s transcendence (J. Cooper 2006, 328; Coman 2016, 82). In\ncontrast, Gregersen (2004, 19) balances transcendence and immanence.\nThus, panentheism affirms the basic role of divine immanence.\nLikewise, in contrast to pantheism’s derivation of divine\ntranscendence from divine immanence, panentheism affirms God’s\ntranscendence from the world. David Nikkel recognizes the importance\nof this balance even within panentheism. He warns against an\noveremphasis upon transcendence leading to the loss of the\nindeterminacy needed for growth that occurs in panentheism overly\ninfluenced by German idealism and an overemphasis on immanence leading\nto the loss of God as the source of existence that occurs in\npanentheism overly influenced by process thought (2016). The classical\nChristian tradition due to a variety of influences such as Platonic\ninfluence that stressed the reality of the forms in contrast to matter\nshaped by the forms (see Straus 2010) has tended to understand God as\nan unrelated Other to ordinary existence. Prioritizing divine\ntranscendence by calling for a deity unlimited by events in the world\nas seen in the doctrine of creation from nothing limits\ncreation’s freedom to impact divine actions. While divine\nimmanence is not denied by the classical Christian tradition,\ntranscendence over all specific relations enables the immanence of the\ndivine relation to all of reality. God is present to all of reality\nbecause God exists independently from all other reality and is\nuninfluenced by other reality. This separation of divine reality from\nordinary, created reality makes the relationship of the divine to all\nof created reality an external relationship. The external nature of\nthis relationship becomes apparent in deviations from the classical\nChristian tradition such as deism. Because of the assumed external\nnature of God’s relation to creation, God cannot logically be\nconceived of as being affected by created reality. God then does not\nrespond in any way to the created order but acts without consideration\nof the events of the world. Understanding God’s transcendence in\nbalance with God’s immanence enables a positive relation between\nscience and theology (Clayton 2020a) and provides a basis for morality\nand ethics (Ciocan 2016, 175).\n\nThe panentheistic mutual relation also differs from pantheism which\nprioritizes divine immanence by identifying the infinite with the\nfinite. The emphasis upon divine immanence seeks to affirm the\npresence of God in the world. In contrast to pantheism’s\nderivation of divine transcendence from divine immanence, panentheism\naffirms God’s transcendence from the world. If divine immanence\nrather than transcendence is stressed, even when that includes the\ninfluence of other realities, it fails to retain a robust concept of\ndivine transcendence. While some forms of this interest lead to\npantheism and the identity of God with the creation, the emphasis upon\nimmanence can acknowledge the need for a source of newness and novelty\nthat is not limited by, or to, the past. For panentheism the basis for\nthis novelty is internal to created reality rather than an external\nreality providing novelty. However, the question about the adequacy of\nthe novelty for the present situation must be considered. The\ntranscendence involved in the emphasis upon immanence is a horizontal\nrather than a vertical transcendence. A horizontal transcendence\ninvolves beings of the same ontological status. For example, a person\ndiffers from other persons and thus in a sense transcends the\nlimitation of other peoples’ experiences just as they are not\nlimited to the first person’s experiences. Newness and novelty\nthen arise from the unrealized potentials in the original situation.\nHowever, this limitation risks making radical novelty impossible\nbecause the context always limits the possibilities.\n\nAnother response to the challenge that panentheism lacks a distinctive\ncharacteristic recognizes the diversity of types of panentheism and\nsimilarities between some other forms of theism and panentheism (Olson\n2020 [Other Internet Resources]; Burch 1998; Gustafson 2011). This\ndiversity of panentheism and the similarities to other forms of theism\nrequires identifying panentheism by means of more than single\ncharacteristic (Lataster and Bilimoria 2018, 57–58). Several\nsuggestions about ways to identify the commonality among the diverse\nexpressions of panentheism and similar forms of theism have been made.\nMichael Brierley finds eight common themes in panentheism although all\neight themes may not be present in each expression of panentheism\n(2004, 6–8). Gregersen identifies a core common to all forms of\npanentheism, God contains the world so that the world belongs to God\nand there is a feeding back from the world into divine life (2017,\n582). This common core then is expressed in a variety of forms of\npanentheism as particular theologies (Gregersen 2017, 583). Stenmark\ndescribes panentheism as having core doctrines and extension claims\n(2019, 23). Panentheism and classical theism share extension claims\nthat God is the creator of the world and that continued existence of\nthe world depends upon God’s ongoing creative activity. Both\npanentheism and classical theism maintain the immanence of God, but\nthey differ in that panentheism holds that God ontologically includes\nthe world while classical theism maintains an ontological distinction\nbetween God and creation. For Stenmark, the core claims of panentheism\nare that God ontologically includes the world and that God depends on\nthe world for God’s own existence (2019, 25–26). Clayton\nsuggests that panentheism be considered a philosophical research\nprogram which may include sub-research programs. The panentheistic\nresearch program affirms the pervasiveness of change with real change\ntaking place in the divine experience but not in the divine nature.\nSince panentheists differ on whether creation is from nothing or is\nnecessary this is a sub-research program within panentheism (Clayton\n2019, 9–10).\n\nWhile the idea of panentheism may not be a philosophically stable\nconcept in itself, that instability makes possible respecification in\nlight of particular theologies (Gregersen 2017, 583). Thus the term\n“panentheism” pointed to a balance between classical\ntheism and pantheism in the early twentieth century with its use of\n“in”. The growth of the influence of scientific thought\nupon theology leads to a more specific understanding of the balance in\nthe relation between God and the world that emphasizes the mutual\ninteraction of God and the world and moves on from the usefulness of\n“in”.\n\nThe varieties of panentheism participate in internal criticism.\nClayton (2008a, 127) and Steven Crain (2006) emphasize the dependence\nof the world upon God rather than the dependence of God upon the world\nalthough they maintain that God is influenced, and changed, by the\nworld. They criticize understandings of God that limit God by making\nGod subject to metaphysical principles. Griffin emphasizes the\nregularity provided by metaphysical principles. This regularity\nrecognizes the order in reality that the reliability of God’s\nlove provides. Panentheists also caution that the emphasis upon the\nontological nature of the relation between God and the world can lead\nto a loss of the integrity of the world. Richardson warns against\nlosing the discrete identity of finite beings in God (2010, 345).\nCase-Winters calls for maintaining a balance between the distinction\nbetween God and the world and God’s involvement with the world.\nOver-emphasis upon either side of the balance leads to positions that\nare philosophically and theologically inadequate (Case-Winters 2007,\n125).\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Atmanspacher, Harald and von Sass, Hartmut, 2017, “The Many\nFaces of Panentheism: An Editorial Introduction”,\n<em>Zygon</em>, 52: 1029–1043.",
                "Artson, Bradley Shavit, 2014, “Holy, Holy, Holy! Jewish\nAffirmations of Panentheism”, <em>Panentheism across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 18–36.",
                "Baltzly, Dirk, 2010, “Is Plato’s Timaeus\nPanentheistic?” <em>Sophia</em>, 49: 193–215.",
                "Barua, Ankur, 2010, “God’s Body at Work: Ramanuja and\nPanentheism”, <em>International Journal of Hindu Studies</em>,\n14: 1–30.",
                "Biernacki, Lorilai, 2014a, “Introduction: Panentheism\nOutside the Box”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 1–17.",
                "–––, 2014b, “Panentheism and Hindu Tantra:\nGrammatical Cosmology”, in <em>Panentheism Across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 161–176.",
                "Bilimoria, Purushottama and Stansell, Ellen, 2010, “Suturing\nthe Body Corporate (Divine and Human) in the Brahmanic\nTraditions”, <em>Sophia</em>, 49: 237–259.",
                "Bracken, Joseph A. S.J., 1995, “Panentheism from a\nTrinitarian Perspective”, <em>Horizons</em>, 22:\n7–28.",
                "–––, 1992, “The issue of panentheism in\nthe dialogue with the non-believer”, <em>Studies in\nReligion/Sciences Religeiuses</em>, 21: 207–218.",
                "–––, 2004, “Panentheism: A Field-Oriented\nApproach”, in <em>In Whom We Live and Move and Have Our\nBeing</em>, P. Clayton and A. Peacocke (eds.), Grand Rapids, MI:\nWilliam B. Eerdmans, pp. 211–221.",
                "–––, 2009, “Whitehead and Roman Catholics:\nWhat Went Wrong?”, <em>American Journal of Theology and\nPhilosophy</em>, 30: 153–167.",
                "–––, 2014, “Panentheism in the context of\nthe theology and science dialogue”, <em>Open Theology</em>, 1:\n1–11.",
                "–––, 2015a, “Panentheism and the Classical\nGod–World Relationship: A Systems-Oriented Approach”,\n<em>American Journal of Theology and Philosophy</em>, 36:\n73–82.",
                "–––, 2015b, “Comparing and Contrasting\nAquinas and Whitehead: An Introductory Commentary”, <em>Open\nTheology</em>, 1: 540–545.",
                "Brierley, Michael W., 2004, “Naming a Quiet Revolution: The\nPanentheistic Turn in Modern Theology”, in <em>In Whom We Live\nand Move and Have our Being: Panentheistic Reflections on God’s\nPresence in a Scientific World</em>, P. Clayton and A. Peacocke\n(eds.), Grand Rapids, MI: William B. Eerdmans, pp. 1–15.",
                "–––, 2006, “The Potential of Panentheism\nfor Dialogue between Science and Religion”, in <em>The Oxford\nHandbook of Religion and Science,</em> Phillip Clayton and Zachary\nSimpson (eds.), Oxford: Oxford University Press, pp.\n635–651.",
                "Buckareff, Andrei A. and Nagasawa, Yujin (eds.), 2016,\n<em>Alternative Concepts of God</em>, Oxford: Oxford University\nPress.",
                "Burch, Sharon Peebles, 1998, “Panentheism in Hartshorne and\nTillich: A Creative Synthesis”, <em>The Personalist Forum</em>,\n14: 250–252.",
                "Case-Winters, Anna, 1995, “Toward a Theology of Nature:\nPreliminary Intuitions”, <em>Religiologiques</em>, 11:\n249–267.",
                "–––, 2007, <em>Reconstructing a Christian\nTheology of Nature</em>, Burlington, VT: Ashgate.",
                "–––, 2014, “Metaphysics for a World in\nEvolution”, <em>Science, Religion and Culture</em>, 1:\n73–82.",
                "Cazalis, Roland, 2016, “A Pedagogical Approach to\nPanentheism”, in <em>Recent Advances in the Creation of\nProcess-Based Worldview: Human Life in Process</em>, Lukas Lamza and\nJakub Dziadkowiec (eds.), Newcastle upon Tyne: Cambridge Scholars\nPublishing, pp. 206–216.",
                "Chapple, Christopher Key, 2014, “Life All Around: Soul in\nJainism”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 100–122.",
                "Ciocan, Cosmin Tudor, 2016, “God’s immanency in\nAbraham’s response to revelation: from providence to\nomnipresence”, <em>Dialogo</em>, 2(2): 175–183.",
                "Clayton, Philip, 2000, <em>The Problem of God in Modern\nThought</em>, Grand Rapids, MI: Eerdmans.",
                "–––, 2001, “Panentheist Internalism:\nLiving within the Presence of the Trinitarian God”,\n<em>Dialog</em>, 40: 208–215.",
                "–––, 2003, “God and World”, in\n<em>The Cambridge Companion to Postmodern Theology</em>, Kevin J.\nVanhoozer (ed.), Cambridge: Cambridge University Press, pp.\n203–218.",
                "–––, 2004a, “Panentheism in Metaphysical\nand Scientific Perspective”, in <em>In Whom We Live and Move and\nHave Our Being: Panentheistic Reflections on God’s Presence in a\nScientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 73–91.",
                "–––, 2004b, “Panentheism Today: A\nConstructive Systematic Evaluation”, in <em>In Whom We Live and\nMove and Have Our Being: Panentheistic Reflections on God’s\nPresence in a Scientific World</em>, P. Clayton and A. Peacocke\n(eds.), Grand Rapids, MI: William B. Eerdmans, pp. 249–264.",
                "–––, 2004c, <em>Mind and Emergence: From Quantum\nto Consciousness</em>, Oxford: Oxford University Press.",
                "–––, 2005, “Kenotic trinitarian\npanentheism”, <em>Dialog</em>, 44: 250–255.",
                "–––, 2006a, “Conceptual Foundations of\nEmergence Theory,” in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford: Oxford University Press, pp.\n1–31.",
                "–––, 2006b, “Emergence from Quantum\nPhysics to Religion: A Critical Appraisal”, in <em>The\nRe-Emergence of Emergence: The Emergentist Hypothesis from Science to\nReligion</em>, P. Clayton and P. Davies (eds.), Oxford: Oxford\nUniversity Press, pp. 303–322.",
                "–––, 2008a, <em>Adventures in the Spirit: God,\nWorld, Divine Action</em>, Minneapolis: Fortress Press.",
                "–––, 2008b, “Open Panentheism and\n<em>Creatio Ex Nihilo</em>”, <em>Process Studies</em>, 37:\n166–183.",
                "–––, 2010, “Panentheisms East and\nWest”, <em>Sophia</em>, 49: 183–191.",
                "–––, 2015a, “The Recent <em>Ex Nihilo</em>\nDebate and the Radical contingency of God”, <em>Philosophy,\nTheology, and Science</em>, 2: 178–193.",
                "–––, 2015b, “Creation <em>Ex Nihilo</em>\nand Intensifying the Vulnerability of God”, in <em>Theologies of\nCreation</em>: Creatio Ex Nihilo <em>and Its New Rivals</em>, Thomas\nJay Oord (ed.), New York: Routledge, pp. 17–30.",
                "–––, 2019, “Prospects for Panentheism as\nResearch Program”, <em>European Journal for Philosophy of\nReligion</em>, 11: 1–18.",
                "–––, 2020a, “Nature and Beyond? Immanence\nand Transcendence in Science and Religion”, in Michael Fuller et\nal editors, <em>Issues in Science and Theology: Nature—and\nBeyond: Transcendence and Immanence in Science and Theology</em>, vol.\n5, <em>Issues in Science and Religion: Publications for the European\nSociety for the Study of Science and Theology</em>, Springer Nature:\nSwitzerland, pp. 3–17.",
                "–––, 2020b, “Varieties of\nPanpsychism”, in <em>Panentheism and Panpsychism: Philosophy of\nReligion Meets Philosophy of Mind</em>, Godehard Brüntrup, Paul\nGöcke, Ludwig Jaskolla (eds.), Boston: Brill USA Inc., pp.\n191–203.",
                "Cobb, John B., Jr., 1965, <em>A Christian Natural Theology, Based\non the Thought of Alfred North Whitehead</em>, Philadelphia:\nWestminster Press.",
                "–––, 1982, <em>Beyond Dialogue: Toward a Mutual\nTransformation of Christianity and Buddhism</em>, Philadelphia:\nFortress Press.",
                "Coman, Iacob, 2016, “Transcendence as Objective Argument of\nthe Existence of the Personal God”, <em>Philosophy and\nTheology</em>, 2(2): 81–91.",
                "Cooper, Burton Z., 1974, <em>The Idea of God: A Whiteheadian\nCritique of St. Thomas Aquinas’ Concept of God</em>, The Hague:\nMartinus Nijhoff.",
                "Cooper, John W., 2006, <em>Panentheism The Other God of the\nPhilosophers: From Plato to the Present</em>, Grand Rapids, MI: Baker\nAcademic.",
                "–––, 2008, “Panentheism: The Other\n”God of the Philosophers“: An Overview”,\n<em>American Theological Inquiry</em>, 1: 11–24.",
                "Corning, Peter A., 2002, “The Re-emergence of\n‘Emergence’: A Venerable Concept in Search of a\nTheory”, <em>Complexity</em>, 7: 18–30.",
                "Corrington, Robert S., 2002, “My Passage from Panentheism to\nPantheism”, <em>American Journal of Theology &amp;\nPhilosophy</em>, 23: 129–153.",
                "Crain, Steven D., 2006, “God Embodied in, God Bodying Forth\nthe World: Emergence and Christian Theology”, <em>Zygon</em>,\n41: 655–673.",
                "Crisp, Oliver, 2009, “Jonathan Edwards on the divine\nnature”, <em>Journal of Reformed Theology</em>, 3:\n175–201.",
                "–––, 2019, “Against Mereological\nPanentheism”, <em>European Journal for Philosophy of\nReligion</em>, 11: 23–41.",
                "Davies, Paul, 2004, “Teleology without Teleology: Purpose\nthrough Emergent Complexity”, in <em>In Whom We Live and Move\nand Have Our Being: Panentheistic Reflections on God’s Presence\nin a Scientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 95–108.",
                "–––, 2006, “The Physics of Downward\nCausation”, in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford, Oxford University Press, pp.\n35–52.",
                "–––, 2007, <em>Cosmic Jackpot: Why Our Universe\nIs Just Right for Life</em>, Boston: Houghton Mifflin.",
                "Diller Jeanine and Kasher, Asa (eds.), 2013, <em>Models of God and\nAlternative Ultimate Realities</em>, New York: Springer.",
                "Dombrowski, Daniel A., 2013a, “Classical theism, pantheism,\nand panentheism”, <em>Cithara</em>, 36(1): 22–33.",
                "–––, 2013b, “Oppy, Infinity, and the\nNeoclassical Concept of God”, in <em>Models of God and\nAlternative Ultimate Realities</em>, Jeanine Diller and Asa Kasher\n(eds.), New York: Springer, pp. 245–258.",
                "Drees, Willem B., 1999, “God and Contemporary Science:\nPhilip Clayton’s Defense of Panentheism”, <em>Zygon</em>,\n34: 515–525.",
                "Emmett, Dorothy, 1992, “Whitehead and Alexander”,\n<em>Process Studies</em>, 3: 137–148.",
                "Ford, Lewis, (ed.), 1973, <em>Two Process Philosophers:\nHartshorne’s Encounter with Whitehead</em>, Tallahassee, FL:\nAmerican Academy of Religion.",
                "Frankenberry, Nancy, 1993, “Classical Theism, Panentheism,\nand Pantheism: On the Relation between God Construction and Gender and\nConstruction”, <em>Zygon</em>, 28: 29–46.",
                "–––, 2011, “Feminist Philosophy of\nReligion”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2011 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2011/entries/feminist-religion/\">https://plato.stanford.edu/archives/win2011/entries/feminist-religion/</a>&gt;.",
                "Gasser, Georg, 2019, “God’s omnipresence in the world:\non possible meanings of ‘en’ in panentheism”,\n<em>Zygon</em>, 85: 29–62.",
                "Gavrilyuk, Paul, 2015, “Bulgakov’s Account of\nCreation: Neglected Aspects, Critics and Contemporary\nRelevance”, <em>International Journal of Systematic\nTheology</em>, 17: 450–463.",
                "Gillett, Carl, 2003, “Physicalism and Panentheism: Good News\nand Bad News”, <em>Faith and Philosophy</em>, 20:\n3–23.",
                "Göcke, Benedikt Paul, 2013a, “The Importance of Karl\nChristian Friedrich Krause’s Panentheism”, <em>Zygon</em>,\n48: 364–379.",
                "–––, 2013b, “Panentheism and Classical\nTheism”, <em>Sophia</em>, 52: 61–75.",
                "–––, 2014, “Reply to Raphael\nLataster”, <em>Sophia</em>, 53: 397–400.",
                "–––, 2015, “There Is No Panentheistic\nParadigm”, <em>The Heythrop Journal</em>, 56: 1–8.",
                "–––, 2018, <em>The Panentheism of Karl Christian\nFriedrich Kruse (1781–1832): From Transcendental Philosophy to\nMetaphysics</em>, New York: Peter Lang.",
                "Gregersen, Niels Henrik, 2004, “Three Varieties of\nPanentheism”, in <em>In Whom We Live and Move and Have Our\nBeing: Panentheistic Reflections on God’s Presence in a\nScientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 19–35.",
                "–––, 2017, “The Exploration of Ecospace:\nExtending or Supplementing the neo-Darwinian Paradigm?”\n<em>Zygon</em>, 52: 561–586.",
                "Griffin, David Ray, 2004, “Panentheism: A Postmodern\nRevelation”, in <em>In Whom We Live and Move and Have Our\nBeing</em>, P. Clayton and A. Peacocke (eds.), Grand Rapids, MI:\nWilliam B. Eerdmans, pp. 36–47.",
                "–––, 2014, <em>Panentheism and Scientific\nNaturalism: Rethinking Evil, Morality, Religious Experience, Religious\nPluralism, and the Academic Study of Religion</em>, Claremont, CA:\nProcess Century Press.",
                "Gustafson, Hans, 2011, “Collapsing the Sacred and the\nProfane: Pan-Sacramental Panentheistic Possibilities in Aquinas and\ntheir Implications for Spirituality”, <em>Heythrop Journal</em>,\nSeptember: 1–14.",
                "Hardy, Adam, 2016, “Hindu Temples and the Emanating\nCosmos”, <em>Religion and the Arts</em>, 20: 112–134.",
                "Henriksen, Jan-Olav, 2017, “The Experience of God and the\nWorld: Christianity’s Reasons for Considering Panentheism a\nViable Option”, <em>Zygon</em>, 52: 1080–1097.",
                "Hartshorne, Charles and Reese, William L. (eds.), 1953,\n<em>Philosophers Speak of God</em>, Chicago: University of Chicago\nPress.",
                "Hosinski, Thomas E., 2015, “Thomas Aquinas and Alfred North\nWhitehead on God’s Action in the World” <em>Open\nTheology</em>, 1: 269–276.",
                "Jantzen, Grace, 1998, <em>Becoming Divine: Towards a feminist\nphilosophy of religion</em>, Manchester: Manchester University\nPress.",
                "Jensen, Alexander S., 2014, <em>Divine Providence and Human\nAgency: Trinity, Creation and Freedom</em>, Burlington, VT:\nAshgate.",
                "Keller, Catherine, 2003, <em>Face of the Deep: A Theology of\nBecoming</em>, New York: Routledge.",
                "–––, 2008, <em>On the Mystery: Discerning God in\nProcess</em>, Minneapolis: Fortress Press.",
                "–––, 2014, “The Body of\nPanentheism”, in <em>Panentheism across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 63–82.",
                "Kim, Jaegwon, 2005, <em>Physicalism or Something Near Enough</em>,\nPrinceton: Princeton University Press.",
                "Langton, Daniel R., 2016, “Elijah Benamozegh and\nEvolutionary Theory: A Nineteenth-Century Italian Kaabbalist’s\nPanentheistic Response to Darwin”, <em>Jewish Studies</em>, 10:\n223–245.",
                "Lataster, Raphael, 2014, “The Body of Panentheism, The\nAttractiveness of Panentheism – a Reply to Benedict Paul\nGöcke”, <em>Sophia</em>, 53: 389–395.",
                "Lataster, Raphael and Bilimoria, Purushottama, 2018,\n“Panentheism(s): What It Is and Is Not”, <em>Journal of\nWorld Philosophies</em>, 3: 49–64.",
                "Lee, Hyo-Dong, 2014, “The Heart–Mind of the Way and\nthe Human Heart–Mind are Nondual: A reflection on Neo-Confucian\nPanentheism”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 37–62.",
                "Leftow, Brian, 2016, “Naturalistic Pantheism”, in\n<em>Alternative Concepts of God</em>, Andrei A. Buckareff and Yujin\nNagasawa (eds.), Oxford: Oxford University Press, pp.\n64–87.",
                "Leidenhag, Joanna, 2016, “A Critique of Emergent\nTheologies”, <em>Zygon</em>, 51: 867–882.",
                "Leidenhag, Mikael, 2014, “Is Panentheism Naturalistic: How\nPanentheistic Conceptions of Divine Action Imply Dualism”,\n<em>Forum Philosophicum</em>, 19: 209–225.",
                "–––, 2016, “From Emergence Theory to\nPanpsychism – A Philosophical Evaluation of Nancey\nMurphy’s Non-Reductive Physicalism”, <em>Sophia</em>, 55:\n381–394.",
                "Leuenberger, Stephen, 2008, “Supervenience in\nMetaphysics”, <em>Philosophy Compass</em>, 3/4:\n749–762.",
                "Malloy, Christopher J., 2014, “Review of Erich Przywara,\n<em>Anologia Entis: Metaphysics: Original Structure and Universal\nRhythm</em>”, <em>Notre Dame Philosophical Reviews</em>, 22\nAugust 2014\n [<a href=\"https://ndpr.nd.edu/news/49831-alalogia-entis-metaphysics-original-structure-and-universal-rhythm/\" target=\"other\">Malloy 2014 available online</a>].",
                "McDaniel, Jay, 1989, <em>Of God and Pelicans: A Theology of\nReverence for Life</em>, Louisville, KY: John Knox/Westminster.",
                "McFague, Sallie, 2001, <em>Life Abundant: Rethinking Theology and\nEconomy for a Planet in Peril</em>, Minneapolis: Fortress Press.",
                "McLaughlin, Brian and Bennett, Karen, 2011,\n“Supervenience”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2014/entries/feminist-religion/\">https://plato.stanford.edu/archives/spr2014/entries/supervenience/</a>&gt;.",
                "Meister, C., 2017, “Ancient and contemporary expressions of\npanentheism:”, <em>Philosophy Compass</em>, 12, published 05\nSeptember 2017. doi:10.1111/phc3.12436",
                "Molnar, Paul D., 1990, “The Function of the Trinity in\nMoltmann’s Ecological Doctrine of Creation”,\n<em>Theological Studies</em>, 51: 673–697.",
                "Moltmann, Jürgen, 1974, <em>The Crucified God</em>, Evanston,\nIL: Harper and Row.",
                "–––, 1981, <em>The Trinity and the Kingdom</em>,\nNew York: Harper and Row.",
                "–––, 1985, <em>God in Creation</em>, San\nFrancisco: Harper and Row.",
                "–––, 1996, <em>The Coming of God: Christian\nEschatology</em>, Minneapolis: Fortress Press.",
                "Mullins, R. T., 2014, “Review of Jeanine Diller and Asa\nKasher, eds., <em>Models of God and Alternative Ultimate\nRealities</em>, New York: Springer, 2013”, <em>Journal of\nAnalytic Theology</em>, 2: 288–293.",
                "–––, 2016, “The Difficulty with\nDemarcating Panentheism”, <em>Sophia</em>, 55:\n325–346.",
                "–––, 2020, “The Problem of Arbitrary\nCreation for Impassibility”, <em>Open Theology</em>, 6:\n392–406.",
                "Nagasawa, Yujin, 2016, “Modal Panentheism”, in\n<em>Alternative Concepts of God</em>, Andrei A. Buckareff and Yujin\nNagasawa (eds.), Oxford: Oxford University Press, pp.\n91–105.",
                "Nash, Ronald H., 1983, <em>The Concept of God</em>, Grand Rapids,\nMI: Zondervan.",
                "Nikkel, David H., 2016, “Affirming God as Panentheistic and\nEmbodied”, <em>Sophia</em>, 55: 291–302.",
                "Nobuhara, Tokiyuki, 2015, “Divine Ecozoics and\nWhitehead’s Adventure or Resurrection Metaphysics”,\n<em>Open Theology</em>, 1: 494–511.",
                "Olson, Roger, 2013, “A Postconservative Evangelical Response\nto Panentheism”, <em>Evangelical Review of Theology</em>, 85:\n328–337.",
                "Oomen, Palmyre, 2015, “God’s Power and Almightiness in\nWhitehead’s Thought”, <em>Open Theology</em>, 1:\n277–292.",
                "Oord, Thomas Jay, 2015, <em>The Uncontrolling Love of God: An Open\nand Relational Account of Providence</em>, Downers Grove, IL: IVP\nAcademic.",
                "–––, 2019, <em>God Can’t! How to Believe\nin God and Love after Tragedy, Abuse, or Other Suffering</em>,\nGrasmere, Idaho: SacraSage Press.",
                "Otto, Randall E., 2001, “The Use and Abuse of Perichoresis\nin Recent Theology”, <em>Scottish Journal of Theology</em>, 54:\n366–384.",
                "Pak, Kenneth, 2014, “Could Process Theodicy Uphold the\nGeneric Idea of God?” <em>American Journal of Theology and\nPhilosophy</em>, 35: 211–228.",
                "Peacocke, Arthur, 1979, <em>Creation and the World of\nScience</em>, Oxford: Clarendon Press.",
                "–––, 2001, <em>Paths from Science towards God:\nThe End of All Our Exploring</em>, Oxford: Oneworld.",
                "–––, 2004, “Articulating God’s\nPresence in and to the World Unveiled by the Sciences”, in\n<em>In Whom We Live and Move and Have Our Being</em>, P. Clayton and\nA. Peacocke (eds.), Grand Rapids, MI: William B. Eerdmans, pp.\n137–154.",
                "–––, 2006, “Emergence, Mind, and Divine\nAction: The Hierarchy of the Sciences in Relation to the Human\nMind-Brain-Body”, in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford, Oxford University Press, pp.\n257–278.",
                "Pfeifer, Karl, 2020, “Naive Panentheism”, in\n<em>Panentheism and Panpsychism: Philosophy of Religion Meets\nPhilosophy of Mind</em> (Innsbruck Studies in Philosophy of Religion:\nVolume 2), Godehard Brüntrup, Benedikt Paul Göcke, and\nLudwig Jaskolla, (eds.), Paderborn: Mentis/Brill, pp.\n123–138.",
                "Polkinghorne, John, 2010, “The Demise of Democritus”,\nin <em>Physical Science and Theology</em>, John Polkinghorne (ed.),\nGrand Rapids, MI: Eerdmans, pp. 1–14.",
                "Richardson, W. Mark, 2010, “Evolutionary-emergent worldview\nand Anglican theological revision: case studies from the 1920s”,\n<em>Anglican Theological Review</em>, 92: 321–345.",
                "Rubenstein, Mary-Jane, 2012, “The Lure of Pan(en)theism:\nDifference and Desire in <em>Divine Enticement</em>”,\n<em>Theology and Sexuality</em>, 18: 113–117.",
                "Samuel, Geoffrey, 2014, “Panentheism and the Longevity\nPractices of Tibetan Buddhism”, in <em>Panentheism Across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 83–99.",
                "Schaab, Gloria, 2007, “Midwifery as a Model for\nEnvironmental Ethics: Expanding Arthur Peacocke’s Models of\n’Man-in-Creation”, <em>Zygon</em>, 42(2):\n487–498.",
                "–––, 2008, “Evolutionary Theory and\nTheology: A Mutually Illuminative Dialogue”, <em>Zygon</em>,\n43(1): 9–18.",
                "Sharify-Funk, Meena and Dickson, William Rory, 2014, “Traces\nof Panentheism in Islam: Ibn al-ʿArabi and the Kaleidoscope of\nBeing”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 142–160.",
                "Silberstein, Michael, 2017, “Panentheism, Neutral Monism,\nand Advaita Vedanta”, <em>Zygon</em>, 52: 1123–1145.",
                "Skrbina, David, 2017, <em>Panpsychism in the West</em>, Cambridge:\nMIT Press.",
                "Stansell, Ellen and Phillips, Stephen H., 2010, “Hartshorne\nand Indian Panentheism”, <em>Sophia</em>, 49: 9–18.",
                "Stavig, Gopal, 2017, “Swami Vivekananda, the Modern\nPanentheism Movement and the New Biology”, <em>Bulletin of the\nRamakrishna Mission Institute of Culture</em>, July: 19–27.",
                "Stenmark, Mikael, 2019, “Panentheism and its\nneighbors”, <em>International Journal for Philosophy of\nReligion</em>, 85: 23–41.",
                "Straus, D. F. M., 2010, “’God in Himself’and\n’God as revealed to us’: The Impact of the <em>Substance\nConcept</em>”, <em>Acta Theologica</em>, 11: 123–144.",
                "Tabaczek, Mariusz, 2013, “Hegel and Whitehead: in Search for\nSources of Contemporary in the Contemporary Versions of Panentheism in\nthe Science–Theology Dialogue”, <em>Theology and\nScience</em>, 11: 143–161.",
                "–––, 2022, “The Image of God in Western\n(Christian) Panentheism: A Critical Evaluation from the Point of View\nof Classical Theism”, <em>Sophia</em>, 61: 611–642.\n[Published online 26 October 2021.] doi:10.1007/s11841-021-00848-2",
                "Vanhoozer, Kevin J., 1998, “Effectual Call or Causal Effect?\nSummons, Sovereignty and Supervenient Grace”, <em>Tyndale\nBulletin</em>, 49: 213–251.",
                "Verhoef, Ann, 2013, “Embodied religion’s\nradicalization of immanence and the consequent question of\ntranscendence,” <em>Acta Academica</em>, 45(4):\n173–194.",
                "Wegter-McNelly, Kirk, 2011, <em>The Entangled God: Divine\nRelationality and Quantum Physics</em>, New York: Routledge.",
                "Whittemore, Robert C., 1960, “Hegel As Panentheist”,\n<em>Studies in Hegel</em> (Tulane Studies in Philosophy: Volume 9),\npp. 134–164.",
                "–––, 1988, “The meeting of East and West\nin neglected Vedanta”, <em>Dialogue &amp; Alliance</em>, 2:\n33–47.",
                "Wildman, Wesley J., 2010, “An Introduction to Relational\nOntology”, in <em>The Trinity and an Entangled World:\nRelationality in Physical Science and Theology</em>, John Polkinghorne\n(ed.), Grand Rapids: Eerdmans, pp. 55–73.",
                "Williams, Robert R., 2010, “Hegel’s True Infinity as\nPanentheism: Reply to Robert Wallace”, <em>Owl of Minerva</em>,\n42: 137–152."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Atmanspacher, Harald and von Sass, Hartmut, 2017, “The Many\nFaces of Panentheism: An Editorial Introduction”,\n<em>Zygon</em>, 52: 1029–1043.</li>\n<li>Artson, Bradley Shavit, 2014, “Holy, Holy, Holy! Jewish\nAffirmations of Panentheism”, <em>Panentheism across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 18–36.</li>\n<li>Baltzly, Dirk, 2010, “Is Plato’s Timaeus\nPanentheistic?” <em>Sophia</em>, 49: 193–215.</li>\n<li>Barua, Ankur, 2010, “God’s Body at Work: Ramanuja and\nPanentheism”, <em>International Journal of Hindu Studies</em>,\n14: 1–30.</li>\n<li>Biernacki, Lorilai, 2014a, “Introduction: Panentheism\nOutside the Box”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 1–17.</li>\n<li>–––, 2014b, “Panentheism and Hindu Tantra:\nGrammatical Cosmology”, in <em>Panentheism Across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 161–176.</li>\n<li>Bilimoria, Purushottama and Stansell, Ellen, 2010, “Suturing\nthe Body Corporate (Divine and Human) in the Brahmanic\nTraditions”, <em>Sophia</em>, 49: 237–259.</li>\n<li>Bracken, Joseph A. S.J., 1995, “Panentheism from a\nTrinitarian Perspective”, <em>Horizons</em>, 22:\n7–28.</li>\n<li>–––, 1992, “The issue of panentheism in\nthe dialogue with the non-believer”, <em>Studies in\nReligion/Sciences Religeiuses</em>, 21: 207–218.</li>\n<li>–––, 2004, “Panentheism: A Field-Oriented\nApproach”, in <em>In Whom We Live and Move and Have Our\nBeing</em>, P. Clayton and A. Peacocke (eds.), Grand Rapids, MI:\nWilliam B. Eerdmans, pp. 211–221.</li>\n<li>–––, 2009, “Whitehead and Roman Catholics:\nWhat Went Wrong?”, <em>American Journal of Theology and\nPhilosophy</em>, 30: 153–167.</li>\n<li>–––, 2014, “Panentheism in the context of\nthe theology and science dialogue”, <em>Open Theology</em>, 1:\n1–11.</li>\n<li>–––, 2015a, “Panentheism and the Classical\nGod–World Relationship: A Systems-Oriented Approach”,\n<em>American Journal of Theology and Philosophy</em>, 36:\n73–82.</li>\n<li>–––, 2015b, “Comparing and Contrasting\nAquinas and Whitehead: An Introductory Commentary”, <em>Open\nTheology</em>, 1: 540–545.</li>\n<li>Brierley, Michael W., 2004, “Naming a Quiet Revolution: The\nPanentheistic Turn in Modern Theology”, in <em>In Whom We Live\nand Move and Have our Being: Panentheistic Reflections on God’s\nPresence in a Scientific World</em>, P. Clayton and A. Peacocke\n(eds.), Grand Rapids, MI: William B. Eerdmans, pp. 1–15.</li>\n<li>–––, 2006, “The Potential of Panentheism\nfor Dialogue between Science and Religion”, in <em>The Oxford\nHandbook of Religion and Science,</em> Phillip Clayton and Zachary\nSimpson (eds.), Oxford: Oxford University Press, pp.\n635–651.</li>\n<li>Buckareff, Andrei A. and Nagasawa, Yujin (eds.), 2016,\n<em>Alternative Concepts of God</em>, Oxford: Oxford University\nPress.</li>\n<li>Burch, Sharon Peebles, 1998, “Panentheism in Hartshorne and\nTillich: A Creative Synthesis”, <em>The Personalist Forum</em>,\n14: 250–252.</li>\n<li>Case-Winters, Anna, 1995, “Toward a Theology of Nature:\nPreliminary Intuitions”, <em>Religiologiques</em>, 11:\n249–267.</li>\n<li>–––, 2007, <em>Reconstructing a Christian\nTheology of Nature</em>, Burlington, VT: Ashgate.</li>\n<li>–––, 2014, “Metaphysics for a World in\nEvolution”, <em>Science, Religion and Culture</em>, 1:\n73–82.</li>\n<li>Cazalis, Roland, 2016, “A Pedagogical Approach to\nPanentheism”, in <em>Recent Advances in the Creation of\nProcess-Based Worldview: Human Life in Process</em>, Lukas Lamza and\nJakub Dziadkowiec (eds.), Newcastle upon Tyne: Cambridge Scholars\nPublishing, pp. 206–216.</li>\n<li>Chapple, Christopher Key, 2014, “Life All Around: Soul in\nJainism”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 100–122.</li>\n<li>Ciocan, Cosmin Tudor, 2016, “God’s immanency in\nAbraham’s response to revelation: from providence to\nomnipresence”, <em>Dialogo</em>, 2(2): 175–183.</li>\n<li>Clayton, Philip, 2000, <em>The Problem of God in Modern\nThought</em>, Grand Rapids, MI: Eerdmans.</li>\n<li>–––, 2001, “Panentheist Internalism:\nLiving within the Presence of the Trinitarian God”,\n<em>Dialog</em>, 40: 208–215.</li>\n<li>–––, 2003, “God and World”, in\n<em>The Cambridge Companion to Postmodern Theology</em>, Kevin J.\nVanhoozer (ed.), Cambridge: Cambridge University Press, pp.\n203–218.</li>\n<li>–––, 2004a, “Panentheism in Metaphysical\nand Scientific Perspective”, in <em>In Whom We Live and Move and\nHave Our Being: Panentheistic Reflections on God’s Presence in a\nScientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 73–91.</li>\n<li>–––, 2004b, “Panentheism Today: A\nConstructive Systematic Evaluation”, in <em>In Whom We Live and\nMove and Have Our Being: Panentheistic Reflections on God’s\nPresence in a Scientific World</em>, P. Clayton and A. Peacocke\n(eds.), Grand Rapids, MI: William B. Eerdmans, pp. 249–264.</li>\n<li>–––, 2004c, <em>Mind and Emergence: From Quantum\nto Consciousness</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2005, “Kenotic trinitarian\npanentheism”, <em>Dialog</em>, 44: 250–255.</li>\n<li>–––, 2006a, “Conceptual Foundations of\nEmergence Theory,” in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford: Oxford University Press, pp.\n1–31.</li>\n<li>–––, 2006b, “Emergence from Quantum\nPhysics to Religion: A Critical Appraisal”, in <em>The\nRe-Emergence of Emergence: The Emergentist Hypothesis from Science to\nReligion</em>, P. Clayton and P. Davies (eds.), Oxford: Oxford\nUniversity Press, pp. 303–322.</li>\n<li>–––, 2008a, <em>Adventures in the Spirit: God,\nWorld, Divine Action</em>, Minneapolis: Fortress Press.</li>\n<li>–––, 2008b, “Open Panentheism and\n<em>Creatio Ex Nihilo</em>”, <em>Process Studies</em>, 37:\n166–183.</li>\n<li>–––, 2010, “Panentheisms East and\nWest”, <em>Sophia</em>, 49: 183–191.</li>\n<li>–––, 2015a, “The Recent <em>Ex Nihilo</em>\nDebate and the Radical contingency of God”, <em>Philosophy,\nTheology, and Science</em>, 2: 178–193.</li>\n<li>–––, 2015b, “Creation <em>Ex Nihilo</em>\nand Intensifying the Vulnerability of God”, in <em>Theologies of\nCreation</em>: Creatio Ex Nihilo <em>and Its New Rivals</em>, Thomas\nJay Oord (ed.), New York: Routledge, pp. 17–30.</li>\n<li>–––, 2019, “Prospects for Panentheism as\nResearch Program”, <em>European Journal for Philosophy of\nReligion</em>, 11: 1–18.</li>\n<li>–––, 2020a, “Nature and Beyond? Immanence\nand Transcendence in Science and Religion”, in Michael Fuller et\nal editors, <em>Issues in Science and Theology: Nature—and\nBeyond: Transcendence and Immanence in Science and Theology</em>, vol.\n5, <em>Issues in Science and Religion: Publications for the European\nSociety for the Study of Science and Theology</em>, Springer Nature:\nSwitzerland, pp. 3–17.</li>\n<li>–––, 2020b, “Varieties of\nPanpsychism”, in <em>Panentheism and Panpsychism: Philosophy of\nReligion Meets Philosophy of Mind</em>, Godehard Brüntrup, Paul\nGöcke, Ludwig Jaskolla (eds.), Boston: Brill USA Inc., pp.\n191–203.</li>\n<li>Cobb, John B., Jr., 1965, <em>A Christian Natural Theology, Based\non the Thought of Alfred North Whitehead</em>, Philadelphia:\nWestminster Press.</li>\n<li>–––, 1982, <em>Beyond Dialogue: Toward a Mutual\nTransformation of Christianity and Buddhism</em>, Philadelphia:\nFortress Press.</li>\n<li>Coman, Iacob, 2016, “Transcendence as Objective Argument of\nthe Existence of the Personal God”, <em>Philosophy and\nTheology</em>, 2(2): 81–91.</li>\n<li>Cooper, Burton Z., 1974, <em>The Idea of God: A Whiteheadian\nCritique of St. Thomas Aquinas’ Concept of God</em>, The Hague:\nMartinus Nijhoff.</li>\n<li>Cooper, John W., 2006, <em>Panentheism The Other God of the\nPhilosophers: From Plato to the Present</em>, Grand Rapids, MI: Baker\nAcademic.</li>\n<li>–––, 2008, “Panentheism: The Other\n”God of the Philosophers“: An Overview”,\n<em>American Theological Inquiry</em>, 1: 11–24.</li>\n<li>Corning, Peter A., 2002, “The Re-emergence of\n‘Emergence’: A Venerable Concept in Search of a\nTheory”, <em>Complexity</em>, 7: 18–30.</li>\n<li>Corrington, Robert S., 2002, “My Passage from Panentheism to\nPantheism”, <em>American Journal of Theology &amp;\nPhilosophy</em>, 23: 129–153.</li>\n<li>Crain, Steven D., 2006, “God Embodied in, God Bodying Forth\nthe World: Emergence and Christian Theology”, <em>Zygon</em>,\n41: 655–673.</li>\n<li>Crisp, Oliver, 2009, “Jonathan Edwards on the divine\nnature”, <em>Journal of Reformed Theology</em>, 3:\n175–201.</li>\n<li>–––, 2019, “Against Mereological\nPanentheism”, <em>European Journal for Philosophy of\nReligion</em>, 11: 23–41.</li>\n<li>Davies, Paul, 2004, “Teleology without Teleology: Purpose\nthrough Emergent Complexity”, in <em>In Whom We Live and Move\nand Have Our Being: Panentheistic Reflections on God’s Presence\nin a Scientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 95–108.</li>\n<li>–––, 2006, “The Physics of Downward\nCausation”, in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford, Oxford University Press, pp.\n35–52.</li>\n<li>–––, 2007, <em>Cosmic Jackpot: Why Our Universe\nIs Just Right for Life</em>, Boston: Houghton Mifflin.</li>\n<li>Diller Jeanine and Kasher, Asa (eds.), 2013, <em>Models of God and\nAlternative Ultimate Realities</em>, New York: Springer.</li>\n<li>Dombrowski, Daniel A., 2013a, “Classical theism, pantheism,\nand panentheism”, <em>Cithara</em>, 36(1): 22–33.</li>\n<li>–––, 2013b, “Oppy, Infinity, and the\nNeoclassical Concept of God”, in <em>Models of God and\nAlternative Ultimate Realities</em>, Jeanine Diller and Asa Kasher\n(eds.), New York: Springer, pp. 245–258.</li>\n<li>Drees, Willem B., 1999, “God and Contemporary Science:\nPhilip Clayton’s Defense of Panentheism”, <em>Zygon</em>,\n34: 515–525.</li>\n<li>Emmett, Dorothy, 1992, “Whitehead and Alexander”,\n<em>Process Studies</em>, 3: 137–148.</li>\n<li>Ford, Lewis, (ed.), 1973, <em>Two Process Philosophers:\nHartshorne’s Encounter with Whitehead</em>, Tallahassee, FL:\nAmerican Academy of Religion.</li>\n<li>Frankenberry, Nancy, 1993, “Classical Theism, Panentheism,\nand Pantheism: On the Relation between God Construction and Gender and\nConstruction”, <em>Zygon</em>, 28: 29–46.</li>\n<li>–––, 2011, “Feminist Philosophy of\nReligion”, <em>The Stanford Encyclopedia of Philosophy</em>\n(Winter 2011 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2011/entries/feminist-religion/\">https://plato.stanford.edu/archives/win2011/entries/feminist-religion/</a>&gt;.</li>\n<li>Gasser, Georg, 2019, “God’s omnipresence in the world:\non possible meanings of ‘en’ in panentheism”,\n<em>Zygon</em>, 85: 29–62.</li>\n<li>Gavrilyuk, Paul, 2015, “Bulgakov’s Account of\nCreation: Neglected Aspects, Critics and Contemporary\nRelevance”, <em>International Journal of Systematic\nTheology</em>, 17: 450–463.</li>\n<li>Gillett, Carl, 2003, “Physicalism and Panentheism: Good News\nand Bad News”, <em>Faith and Philosophy</em>, 20:\n3–23.</li>\n<li>Göcke, Benedikt Paul, 2013a, “The Importance of Karl\nChristian Friedrich Krause’s Panentheism”, <em>Zygon</em>,\n48: 364–379.</li>\n<li>–––, 2013b, “Panentheism and Classical\nTheism”, <em>Sophia</em>, 52: 61–75.</li>\n<li>–––, 2014, “Reply to Raphael\nLataster”, <em>Sophia</em>, 53: 397–400.</li>\n<li>–––, 2015, “There Is No Panentheistic\nParadigm”, <em>The Heythrop Journal</em>, 56: 1–8.</li>\n<li>–––, 2018, <em>The Panentheism of Karl Christian\nFriedrich Kruse (1781–1832): From Transcendental Philosophy to\nMetaphysics</em>, New York: Peter Lang.</li>\n<li>Gregersen, Niels Henrik, 2004, “Three Varieties of\nPanentheism”, in <em>In Whom We Live and Move and Have Our\nBeing: Panentheistic Reflections on God’s Presence in a\nScientific World</em>, P. Clayton and A. Peacocke (eds.), Grand\nRapids, MI: William B. Eerdmans, pp. 19–35.</li>\n<li>–––, 2017, “The Exploration of Ecospace:\nExtending or Supplementing the neo-Darwinian Paradigm?”\n<em>Zygon</em>, 52: 561–586.</li>\n<li>Griffin, David Ray, 2004, “Panentheism: A Postmodern\nRevelation”, in <em>In Whom We Live and Move and Have Our\nBeing</em>, P. Clayton and A. Peacocke (eds.), Grand Rapids, MI:\nWilliam B. Eerdmans, pp. 36–47.</li>\n<li>–––, 2014, <em>Panentheism and Scientific\nNaturalism: Rethinking Evil, Morality, Religious Experience, Religious\nPluralism, and the Academic Study of Religion</em>, Claremont, CA:\nProcess Century Press.</li>\n<li>Gustafson, Hans, 2011, “Collapsing the Sacred and the\nProfane: Pan-Sacramental Panentheistic Possibilities in Aquinas and\ntheir Implications for Spirituality”, <em>Heythrop Journal</em>,\nSeptember: 1–14.</li>\n<li>Hardy, Adam, 2016, “Hindu Temples and the Emanating\nCosmos”, <em>Religion and the Arts</em>, 20: 112–134.</li>\n<li>Henriksen, Jan-Olav, 2017, “The Experience of God and the\nWorld: Christianity’s Reasons for Considering Panentheism a\nViable Option”, <em>Zygon</em>, 52: 1080–1097.</li>\n<li>Hartshorne, Charles and Reese, William L. (eds.), 1953,\n<em>Philosophers Speak of God</em>, Chicago: University of Chicago\nPress.</li>\n<li>Hosinski, Thomas E., 2015, “Thomas Aquinas and Alfred North\nWhitehead on God’s Action in the World” <em>Open\nTheology</em>, 1: 269–276.</li>\n<li>Jantzen, Grace, 1998, <em>Becoming Divine: Towards a feminist\nphilosophy of religion</em>, Manchester: Manchester University\nPress.</li>\n<li>Jensen, Alexander S., 2014, <em>Divine Providence and Human\nAgency: Trinity, Creation and Freedom</em>, Burlington, VT:\nAshgate.</li>\n<li>Keller, Catherine, 2003, <em>Face of the Deep: A Theology of\nBecoming</em>, New York: Routledge.</li>\n<li>–––, 2008, <em>On the Mystery: Discerning God in\nProcess</em>, Minneapolis: Fortress Press.</li>\n<li>–––, 2014, “The Body of\nPanentheism”, in <em>Panentheism across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 63–82.</li>\n<li>Kim, Jaegwon, 2005, <em>Physicalism or Something Near Enough</em>,\nPrinceton: Princeton University Press.</li>\n<li>Langton, Daniel R., 2016, “Elijah Benamozegh and\nEvolutionary Theory: A Nineteenth-Century Italian Kaabbalist’s\nPanentheistic Response to Darwin”, <em>Jewish Studies</em>, 10:\n223–245.</li>\n<li>Lataster, Raphael, 2014, “The Body of Panentheism, The\nAttractiveness of Panentheism – a Reply to Benedict Paul\nGöcke”, <em>Sophia</em>, 53: 389–395.</li>\n<li>Lataster, Raphael and Bilimoria, Purushottama, 2018,\n“Panentheism(s): What It Is and Is Not”, <em>Journal of\nWorld Philosophies</em>, 3: 49–64.</li>\n<li>Lee, Hyo-Dong, 2014, “The Heart–Mind of the Way and\nthe Human Heart–Mind are Nondual: A reflection on Neo-Confucian\nPanentheism”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 37–62.</li>\n<li>Leftow, Brian, 2016, “Naturalistic Pantheism”, in\n<em>Alternative Concepts of God</em>, Andrei A. Buckareff and Yujin\nNagasawa (eds.), Oxford: Oxford University Press, pp.\n64–87.</li>\n<li>Leidenhag, Joanna, 2016, “A Critique of Emergent\nTheologies”, <em>Zygon</em>, 51: 867–882.</li>\n<li>Leidenhag, Mikael, 2014, “Is Panentheism Naturalistic: How\nPanentheistic Conceptions of Divine Action Imply Dualism”,\n<em>Forum Philosophicum</em>, 19: 209–225.</li>\n<li>–––, 2016, “From Emergence Theory to\nPanpsychism – A Philosophical Evaluation of Nancey\nMurphy’s Non-Reductive Physicalism”, <em>Sophia</em>, 55:\n381–394.</li>\n<li>Leuenberger, Stephen, 2008, “Supervenience in\nMetaphysics”, <em>Philosophy Compass</em>, 3/4:\n749–762.</li>\n<li>Malloy, Christopher J., 2014, “Review of Erich Przywara,\n<em>Anologia Entis: Metaphysics: Original Structure and Universal\nRhythm</em>”, <em>Notre Dame Philosophical Reviews</em>, 22\nAugust 2014\n [<a href=\"https://ndpr.nd.edu/news/49831-alalogia-entis-metaphysics-original-structure-and-universal-rhythm/\" target=\"other\">Malloy 2014 available online</a>].</li>\n<li>McDaniel, Jay, 1989, <em>Of God and Pelicans: A Theology of\nReverence for Life</em>, Louisville, KY: John Knox/Westminster.</li>\n<li>McFague, Sallie, 2001, <em>Life Abundant: Rethinking Theology and\nEconomy for a Planet in Peril</em>, Minneapolis: Fortress Press.</li>\n<li>McLaughlin, Brian and Bennett, Karen, 2011,\n“Supervenience”, <em>The Stanford Encyclopedia of\nPhilosophy</em> (Spring 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2014/entries/feminist-religion/\">https://plato.stanford.edu/archives/spr2014/entries/supervenience/</a>&gt;.</li>\n<li>Meister, C., 2017, “Ancient and contemporary expressions of\npanentheism:”, <em>Philosophy Compass</em>, 12, published 05\nSeptember 2017. doi:10.1111/phc3.12436</li>\n<li>Molnar, Paul D., 1990, “The Function of the Trinity in\nMoltmann’s Ecological Doctrine of Creation”,\n<em>Theological Studies</em>, 51: 673–697.</li>\n<li>Moltmann, Jürgen, 1974, <em>The Crucified God</em>, Evanston,\nIL: Harper and Row.</li>\n<li>–––, 1981, <em>The Trinity and the Kingdom</em>,\nNew York: Harper and Row.</li>\n<li>–––, 1985, <em>God in Creation</em>, San\nFrancisco: Harper and Row.</li>\n<li>–––, 1996, <em>The Coming of God: Christian\nEschatology</em>, Minneapolis: Fortress Press.</li>\n<li>Mullins, R. T., 2014, “Review of Jeanine Diller and Asa\nKasher, eds., <em>Models of God and Alternative Ultimate\nRealities</em>, New York: Springer, 2013”, <em>Journal of\nAnalytic Theology</em>, 2: 288–293.</li>\n<li>–––, 2016, “The Difficulty with\nDemarcating Panentheism”, <em>Sophia</em>, 55:\n325–346.</li>\n<li>–––, 2020, “The Problem of Arbitrary\nCreation for Impassibility”, <em>Open Theology</em>, 6:\n392–406.</li>\n<li>Nagasawa, Yujin, 2016, “Modal Panentheism”, in\n<em>Alternative Concepts of God</em>, Andrei A. Buckareff and Yujin\nNagasawa (eds.), Oxford: Oxford University Press, pp.\n91–105.</li>\n<li>Nash, Ronald H., 1983, <em>The Concept of God</em>, Grand Rapids,\nMI: Zondervan.</li>\n<li>Nikkel, David H., 2016, “Affirming God as Panentheistic and\nEmbodied”, <em>Sophia</em>, 55: 291–302.</li>\n<li>Nobuhara, Tokiyuki, 2015, “Divine Ecozoics and\nWhitehead’s Adventure or Resurrection Metaphysics”,\n<em>Open Theology</em>, 1: 494–511.</li>\n<li>Olson, Roger, 2013, “A Postconservative Evangelical Response\nto Panentheism”, <em>Evangelical Review of Theology</em>, 85:\n328–337.</li>\n<li>Oomen, Palmyre, 2015, “God’s Power and Almightiness in\nWhitehead’s Thought”, <em>Open Theology</em>, 1:\n277–292.</li>\n<li>Oord, Thomas Jay, 2015, <em>The Uncontrolling Love of God: An Open\nand Relational Account of Providence</em>, Downers Grove, IL: IVP\nAcademic.</li>\n<li>–––, 2019, <em>God Can’t! How to Believe\nin God and Love after Tragedy, Abuse, or Other Suffering</em>,\nGrasmere, Idaho: SacraSage Press.</li>\n<li>Otto, Randall E., 2001, “The Use and Abuse of Perichoresis\nin Recent Theology”, <em>Scottish Journal of Theology</em>, 54:\n366–384.</li>\n<li>Pak, Kenneth, 2014, “Could Process Theodicy Uphold the\nGeneric Idea of God?” <em>American Journal of Theology and\nPhilosophy</em>, 35: 211–228.</li>\n<li>Peacocke, Arthur, 1979, <em>Creation and the World of\nScience</em>, Oxford: Clarendon Press.</li>\n<li>–––, 2001, <em>Paths from Science towards God:\nThe End of All Our Exploring</em>, Oxford: Oneworld.</li>\n<li>–––, 2004, “Articulating God’s\nPresence in and to the World Unveiled by the Sciences”, in\n<em>In Whom We Live and Move and Have Our Being</em>, P. Clayton and\nA. Peacocke (eds.), Grand Rapids, MI: William B. Eerdmans, pp.\n137–154.</li>\n<li>–––, 2006, “Emergence, Mind, and Divine\nAction: The Hierarchy of the Sciences in Relation to the Human\nMind-Brain-Body”, in <em>The Re-Emergence of Emergence: The\nEmergentist Hypothesis from Science to Religion</em>, P. Clayton and\nP. Davies (eds.), Oxford, Oxford University Press, pp.\n257–278.</li>\n<li>Pfeifer, Karl, 2020, “Naive Panentheism”, in\n<em>Panentheism and Panpsychism: Philosophy of Religion Meets\nPhilosophy of Mind</em> (Innsbruck Studies in Philosophy of Religion:\nVolume 2), Godehard Brüntrup, Benedikt Paul Göcke, and\nLudwig Jaskolla, (eds.), Paderborn: Mentis/Brill, pp.\n123–138.</li>\n<li>Polkinghorne, John, 2010, “The Demise of Democritus”,\nin <em>Physical Science and Theology</em>, John Polkinghorne (ed.),\nGrand Rapids, MI: Eerdmans, pp. 1–14.</li>\n<li>Richardson, W. Mark, 2010, “Evolutionary-emergent worldview\nand Anglican theological revision: case studies from the 1920s”,\n<em>Anglican Theological Review</em>, 92: 321–345.</li>\n<li>Rubenstein, Mary-Jane, 2012, “The Lure of Pan(en)theism:\nDifference and Desire in <em>Divine Enticement</em>”,\n<em>Theology and Sexuality</em>, 18: 113–117.</li>\n<li>Samuel, Geoffrey, 2014, “Panentheism and the Longevity\nPractices of Tibetan Buddhism”, in <em>Panentheism Across the\nWorld’s Traditions</em>, Lorilai Biernacki and Philip Clayton\n(eds.), Oxford: Oxford University Press, pp. 83–99.</li>\n<li>Schaab, Gloria, 2007, “Midwifery as a Model for\nEnvironmental Ethics: Expanding Arthur Peacocke’s Models of\n’Man-in-Creation”, <em>Zygon</em>, 42(2):\n487–498.</li>\n<li>–––, 2008, “Evolutionary Theory and\nTheology: A Mutually Illuminative Dialogue”, <em>Zygon</em>,\n43(1): 9–18.</li>\n<li>Sharify-Funk, Meena and Dickson, William Rory, 2014, “Traces\nof Panentheism in Islam: Ibn al-ʿArabi and the Kaleidoscope of\nBeing”, in <em>Panentheism Across the World’s\nTraditions</em>, Lorilai Biernacki and Philip Clayton (eds.), Oxford:\nOxford University Press, pp. 142–160.</li>\n<li>Silberstein, Michael, 2017, “Panentheism, Neutral Monism,\nand Advaita Vedanta”, <em>Zygon</em>, 52: 1123–1145.</li>\n<li>Skrbina, David, 2017, <em>Panpsychism in the West</em>, Cambridge:\nMIT Press.</li>\n<li>Stansell, Ellen and Phillips, Stephen H., 2010, “Hartshorne\nand Indian Panentheism”, <em>Sophia</em>, 49: 9–18.</li>\n<li>Stavig, Gopal, 2017, “Swami Vivekananda, the Modern\nPanentheism Movement and the New Biology”, <em>Bulletin of the\nRamakrishna Mission Institute of Culture</em>, July: 19–27.</li>\n<li>Stenmark, Mikael, 2019, “Panentheism and its\nneighbors”, <em>International Journal for Philosophy of\nReligion</em>, 85: 23–41.</li>\n<li>Straus, D. F. M., 2010, “’God in Himself’and\n’God as revealed to us’: The Impact of the <em>Substance\nConcept</em>”, <em>Acta Theologica</em>, 11: 123–144.</li>\n<li>Tabaczek, Mariusz, 2013, “Hegel and Whitehead: in Search for\nSources of Contemporary in the Contemporary Versions of Panentheism in\nthe Science–Theology Dialogue”, <em>Theology and\nScience</em>, 11: 143–161.</li>\n<li>–––, 2022, “The Image of God in Western\n(Christian) Panentheism: A Critical Evaluation from the Point of View\nof Classical Theism”, <em>Sophia</em>, 61: 611–642.\n[Published online 26 October 2021.] doi:10.1007/s11841-021-00848-2</li>\n<li>Vanhoozer, Kevin J., 1998, “Effectual Call or Causal Effect?\nSummons, Sovereignty and Supervenient Grace”, <em>Tyndale\nBulletin</em>, 49: 213–251.</li>\n<li>Verhoef, Ann, 2013, “Embodied religion’s\nradicalization of immanence and the consequent question of\ntranscendence,” <em>Acta Academica</em>, 45(4):\n173–194.</li>\n<li>Wegter-McNelly, Kirk, 2011, <em>The Entangled God: Divine\nRelationality and Quantum Physics</em>, New York: Routledge.</li>\n<li>Whittemore, Robert C., 1960, “Hegel As Panentheist”,\n<em>Studies in Hegel</em> (Tulane Studies in Philosophy: Volume 9),\npp. 134–164.</li>\n<li>–––, 1988, “The meeting of East and West\nin neglected Vedanta”, <em>Dialogue &amp; Alliance</em>, 2:\n33–47.</li>\n<li>Wildman, Wesley J., 2010, “An Introduction to Relational\nOntology”, in <em>The Trinity and an Entangled World:\nRelationality in Physical Science and Theology</em>, John Polkinghorne\n(ed.), Grand Rapids: Eerdmans, pp. 55–73.</li>\n<li>Williams, Robert R., 2010, “Hegel’s True Infinity as\nPanentheism: Reply to Robert Wallace”, <em>Owl of Minerva</em>,\n42: 137–152.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "emergent properties",
            "feminist philosophy, interventions: philosophy of religion",
            "Japanese Philosophy: Kyoto School",
            "monotheism",
            "pantheism",
            "process theism",
            "reduction, scientific",
            "religion: philosophy of",
            "Schopenhauer, Arthur",
            "Spinoza, Baruch",
            "supervenience"
        ],
        "entry_link": [
            {
                "../properties-emergent/": "emergent properties"
            },
            {
                "../feminist-religion/": "feminist philosophy, interventions: philosophy of religion"
            },
            {
                "../kyoto-school/": "Japanese Philosophy: Kyoto School"
            },
            {
                "../monotheism/": "monotheism"
            },
            {
                "../pantheism/": "pantheism"
            },
            {
                "../process-theism/": "process theism"
            },
            {
                "../scientific-reduction/": "reduction, scientific"
            },
            {
                "../philosophy-religion/": "religion: philosophy of"
            },
            {
                "../schopenhauer/": "Schopenhauer, Arthur"
            },
            {
                "../spinoza/": "Spinoza, Baruch"
            },
            {
                "../supervenience/": "supervenience"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=panentheism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/panentheism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=panentheism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/panentheism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=panentheism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/panentheism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=panentheism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/panentheism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Davis, Andrew M., 2019,\n “<a href=\"https://www.academia.edu/31886078/Ambiguities_in_Panentheism_Definitions_Distinctions_and_Demarcations\" target=\"other\">Ambiguities in Panentheism: Definitions, Distinctions, and Demarcations</a>”,\n unpublished manuscript.",
            "Olson, Roger, 2012,\n “<a href=\"https://www.patheos.com/blogs/rogereolson/2012/08/whats-wrong-with-panentheism/\" target=\"other\">What’s wrong with panentheism</a>”,\n blog post (August 7, 2012), at pantheos.com.",
            "–––, 2020,\n “<a href=\"https://www.patheos.com/blogs/rogereolson/2020/11/can-god-change-without-changing/?utm_source=Newsletter&amp;utm_medium=email&amp;utm_campaign=Sharing+the+Gospel&amp;utm_content=46\" target=\"other\">Can God Change Without Changing?</a>”,\n blog post (13 November 2020), at pantheos.com.",
            "<a href=\"http://cosmos.asu.edu/\" target=\"other\">Paul Davies’s web pages at Arizona State University</a>",
            "<a href=\"https://www.ctr4process.org/\" target=\"other\">Center for Process Studies</a>",
            "<a href=\"https://www.ctr4process.org/media/page6.shtml#20080501\" target=\"other\">Emergence</a>,\n by Joseph Bracken, with a response from Philip Clayton."
        ],
        "listed_links": [
            {
                "https://www.academia.edu/31886078/Ambiguities_in_Panentheism_Definitions_Distinctions_and_Demarcations": "Ambiguities in Panentheism: Definitions, Distinctions, and Demarcations"
            },
            {
                "https://www.patheos.com/blogs/rogereolson/2012/08/whats-wrong-with-panentheism/": "What’s wrong with panentheism"
            },
            {
                "https://www.patheos.com/blogs/rogereolson/2020/11/can-god-change-without-changing/?utm_source=Newsletter&utm_medium=email&utm_campaign=Sharing+the+Gospel&utm_content=46": "Can God Change Without Changing?"
            },
            {
                "http://cosmos.asu.edu/": "Paul Davies’s web pages at Arizona State University"
            },
            {
                "https://www.ctr4process.org/": "Center for Process Studies"
            },
            {
                "https://www.ctr4process.org/media/page6.shtml#20080501": "Emergence"
            }
        ]
    }
}