{
    "url": "pineal-gland",
    "title": "Descartes and the Pineal Gland",
    "authorship": {
        "year": "Copyright © 2013",
        "author_text": "Gert-Jan Lokhorst\n<g.j.c.lokhorst@tudelft.nl>",
        "author_links": [
            {
                "http://gjclokhorst.nl/": "Gert-Jan Lokhorst"
            },
            {
                "mailto:g%2ej%2ec%2elokhorst%40tudelft%2enl": "g.j.c.lokhorst@tudelft.nl"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2013</a> by\n\n<br/>\n<a href=\"http://gjclokhorst.nl/\" target=\"other\">Gert-Jan Lokhorst</a>\n&lt;<a href=\"mailto:g%2ej%2ec%2elokhorst%40tudelft%2enl\"><em>g<abbr title=\" dot \">.</abbr>j<abbr title=\" dot \">.</abbr>c<abbr title=\" dot \">.</abbr>lokhorst<abbr title=\" at \">@</abbr>tudelft<abbr title=\" dot \">.</abbr>nl</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Apr 25, 2005",
        "substantive revision Wed Sep 18, 2013"
    ],
    "preamble": "\nThe pineal gland is a tiny organ in the center of the brain that played an important role in Descartes’ philosophy. He regarded it as the principal seat of the soul and the place in which all our thoughts are formed. In this entry, we discuss Descartes’ views concerning the pineal gland. We also put them into a historical context by describing the main theories about the functions of the pineal gland that were proposed before and after his time.\n",
    "toc": [
        {
            "#PreCartViewPineGlan": "1. Pre-Cartesian Views on the Pineal Gland"
        },
        {
            "#Anti": "1.1 Antiquity"
        },
        {
            "#LateAnti": "1.2 Late Antiquity"
        },
        {
            "#MiddAges": "1.3 Middle Ages"
        },
        {
            "#Rena": "1.4 Renaissance"
        },
        {
            "#DescViewPineGlan": "2. Descartes’ Views on the Pineal Gland"
        },
        {
            "#TreaMan": "2.1 The Treatise of Man"
        },
        {
            "#BetwTreaManPassSoul": "2.2 Between the Treatise of Man and The Passions of the Soul"
        },
        {
            "#PassSoul": "2.3 The Passions of the Soul"
        },
        {
            "#BodySoul": "2.4 Body and Soul"
        },
        {
            "#PostCartDeve": "3. Post-Cartesian Development"
        },
        {
            "#ReacDescView": "3.1 Reactions to Descartes’ Views"
        },
        {
            "#ScieDeve": "3.2 Scientific Developments"
        },
        {
            "#PseuScie": "3.3 Pseudo-Science"
        },
        {
            "#Conc": "3.4 Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Pre-Cartesian Views on the Pineal Gland\nThe pineal gland or pineal body is a small gland in the middle of the head. It often contains calcifications (“brain sand”) which make it an easily identifiable point of reference in X-ray images of the brain. The pineal gland is attached to the outside of the substance of the brain near the entrance of the canal (“aqueduct of Sylvius”) from the third to the fourth ventricle of the brain.\n\nFigure 1. The Pineal Gland. Sagittal section of brain, view from the left, the surface of the medial half of the right side is seen. Source: Professor Dr. Carl Ernest Bock, Handbuch der Anatomie des Menschen, Leipzig 1841. From a scan originally published at: Anatomy Atlases (edited). Figure labels are as follows:\n(I) Frontal bone (with frontal sinus); (II) Crista galli (of ethmoidal bone); (III) Perpendicular lamina of the ethmoid bone; (IV) Body of the ethmoid bone; (V) Back of the sella turcica (posterior clinoid process); (VI) Sella turcica; (VII) Sphenoid sinus; (VIII) Basilar part of the occipital bone (with the fossa for medulla oblongata); (IX) Occipital part of the occipital bone; (X) Vomer; (XI) Pharynx; (XII) Tentorium cerebelli (with confluence of sinuses and opened great cerebral vein of Galen).\n(A) Anterior (Frontal) cerebral lobe; (B) Middle (Parietal) cerebral lobe; (C) Posterior (Parietal) cerebral lobe; (D) Medulla oblongata.\n(a) gyri; (b) sulci (furrow between gyri); (c) corpus callosum (body); (d) genu of corpus callosum; (e) corpus callosum, splenium; (f) septum pellucidum; (g) fornix (body); (h) fornix column; (i) foramen of Munro; (k) thalamus (optic thalamus); (l) anterior commissure; (m) interthalamic adhesion; (n) posterior commissure; (o) pineal gland; (p) stalk of pineal gland (crus glandulae pinealis); (q) corpora quadrigemina; (r) pons Varoli; (s) aqueduct of Sylvius; (t) tuber cinereum; (u) infundibulum; (v) pituitary gland (hypophysis); (w) optic chiasm; (x) optic nerve; (y) fourth ventricle; (z) mamillary body.\n(α) anterior cerebellar valvule; (β) anterior cerebral artery;\n\nIt is nowadays known that the pineal gland is an endocrine organ, which produces the hormone melatonin in amounts which vary with the time of day. But this is a relatively recent discovery. Long before it was made, physicians and philosophers were already busily speculating about its functions.\n1.1 Antiquity\nThe first description of the pineal gland and the first speculations about its functions are to be found in the voluminous writings of Galen (ca. 130-ca. 210 CE), the Greek medical doctor and philosopher who spent the greatest part of his life in Rome and whose system dominated medical thinking until the seventeenth century.\nGalen discussed the pineal gland in the eighth book of his anatomical work On the usefulness of the parts of the body. He explained that it owes its name (Greek: kônarion, Latin: glandula pinealis) to its resemblance in shape and size to the nuts found in the cones of the stone pine (Greek: kônos, Latin: pinus pinea). He called it a gland because of its appearance and said that it has the same function as all other glands of the body, namely to serve as a support for blood vessels.\nIn order to understand the rest of Galen’s exposition, the following two points should be kept in mind. First, his terminology was different from ours. He regarded the lateral ventricles of the brain as one paired ventricle and called it the anterior ventricle. He accordingly called the third ventricle the middle ventricle, and the fourth the posterior one. Second, he thought that these ventricles were filled with “psychic pneuma,” a fine, volatile, airy or vaporous substance which he described as “the first instrument of the soul.” (See Rocca 2003 for a detailed description of Galen’s views about the anatomy and physiology of the brain.)\nGalen went to great lengths to refute a view that was apparently circulating in his time (but whose originators or protagonists he did not mention) according to which the pineal gland regulates the flow of psychic pneuma in the canal between the middle and posterior ventricles of the brain, just as the pylorus regulates the passage of food from the esophagus to the stomach. Galen rejected this view because, first, the pineal gland is attached to the outside of the brain and, second, it cannot move on its own. He argued that the “worm-like appendage” [epiphysis or apophysis] of the cerebellum (nowadays known as the vermis superior cerebelli) is much better qualified to play this role (Kühn 1822, pp. 674–683; May 1968, vol. 1, pp. 418–423).\n1.2 Late Antiquity\nAlthough Galen was the supreme medical authority until the seventeenth century, his views were often extended or modified. An early example of this phenomenon is the addition of a ventricular localization theory of psychological faculties to Galen’s account of the brain. The first theory of this type that we know of was presented by Posidonius of Byzantium (end of the fourth century CE), who said that imagination is due to the forepart of the brain, reason to the middle ventricle, and memory to the hind part of the brain (Aetius 1534, 1549, book 6, ch. 2). A few decades later, Nemesius of Emesa (ca. 400 CE) was more specific and maintained that the anterior ventricle is the organ of imagination, the middle ventricle the organ of reason, and the posterior ventricle the organ of memory (Nemesius 1802, chs. 6–13). The latter theory was almost universally adopted until the middle of the sixteenth century, although there were numerous variants. The most important variant was due to Avicenna (980–1037 CE), who devised it by projecting the psychological distinctions found in Aristotle’s On the soul onto the ventricular system of the brain (Rahman 1952).\n1.3 Middle Ages\nIn a treatise called On the difference between spirit and soul, Qusta ibn Luqa (864–923) combined Nemesius’ ventricular localization doctrine with Galen’s account of a worm-like part of the brain that controls the flow of animal spirit between the middle and posterior ventricles. He wrote that people who want to remember look upwards because this raises the worm-like particle, opens the passage, and enables the retrieval of memories from the posterior ventricle. People who want to think, on the other hand, look down because this lowers the particle, closes the passage, and protects the spirit in the middle ventricle from being disturbed by memories stored in the posterior ventricle (Constantinus Africanus 1536, p. 310).\n\nFigure 2. Qusta ibn Luqa’s Theory (modern schematic reconstruction, view from the left). Thinking is associated with the animal spirit in the middle ventricle (II), memories are stored in the posterior ventricle (III). Left: people who want to remember look up because this raises the worm-like obstacle and enables the passage of memories from the posterior to the middle ventricle. Right: people who want to think look down because this depresses the worm-like obstacle and isolates the middle ventricle from the contents of the posterior ventricle.\n\n\nFigure 3. The Worm-Like Obstacle. This illumination from ca. 1300 shows how the worm guards the entrance of the posterior ventricle (University Library, Cambridge, ms Gr.g.1.1; Source: Web Gallery of Art).\n\nQusta’s treatise was very influential in thirteenth-century scholastic Europe (Wilcox 1985).\nIn several later medieval texts, the term pinea was applied to the worm-like obstacle, so that the view that the pineal gland regulates the flow of spirits (the theory that Galen had rejected) made a come-back (Vincent de Beauvais 1494, fol. 342v; Vincent de Beauvais 1624, col. 1925; Israeli 1515, part 2, fol. 172v and fol. 210r; Publicius 1482, ch. Ingenio conferentia). The authors in question seemed ignorant of the distinction that Galen had made between the pineal gland and the worm-like appendage. To add to the confusion, Mondino dei Luzzi (1306) described the choroid plexus in the lateral ventricles as a worm which can open and close the passage between the anterior and middle ventricles, with the result that, in the late Middle Ages, the term ‘worm’ could refer to no less than three different parts of the brain: the vermis of the cerebellum, the pineal body and the choroid plexus.\n\nFigure 4. The Worm According to Mondino (view from the left). In this diagram, there is a “worm” (“vermis”) between the anterior and middle ventricles, in conformity with Mondino’s Anothomia (Reisch 1535, p. 883).\n\n\nFigure 5. The Worm According to Mondino (view from above). In this view of the brain from above, the label “worm” (“vermis”) is applied to the choroid plexus in the lateral and third ventricles, just as in Mondino’s Anothomia (Berengario da Carpi 1530, fol. O3r).\n\n1.4 Renaissance\nIn the beginning of the sixteenth century, anatomy made great progress and at least two developments took place that are important from our point of view. First, Niccolò Massa (1536, ch. 38) discovered that the ventricles are not filled with some airy or vaporous spirit but with fluid (the liquor cerebro-spinalis). Second, Andreas Vesalius (1543, book 7) rejected all ventricular localization theories and all theories according to which the choroid plexus, pineal gland or vermis of the cerebellum can regulate the flow of spirits in the ventricles of the brain.\n2. Descartes’ Views on the Pineal Gland\nToday, René Descartes (1596–1650) is mainly known because of his contributions to mathematics and philosophy. But he was highly interested in anatomy and physiology as well. He paid so much attention to these subjects that it has been suggested that “if Descartes were alive today, he would be in charge of the CAT and PET scan machines in a major research hospital” (Watson 2002, p. 15). Descartes discussed the pineal gland both in his first book, the Treatise of man (written before 1637, but only published posthumously, first in an imperfect Latin translation in 1662, and then in the original French in 1664), in a number of letters written in 1640–41, and in his last book, The passions of the soul (1649).\n2.1 The Treatise of Man\nIn the Treatise of man, Descartes did not describe man, but a kind of conceptual models of man, namely creatures, created by God, which consist of two ingredients, a body and a soul. “These men will be composed, as we are, of a soul and a body. First I must describe the body on its own; then the soul, again on its own; and finally I must show how these two natures would have to be joined and united in order to constitute men who resemble us” (AT XI:119, CSM I:99). Unfortunately, Descartes did not fulfill all of these promises: he discussed only the body and said almost nothing about the soul and its interaction with the body.\nThe bodies of Descartes’ hypothetical men are nothing but machines: “I suppose the body to be nothing but a statue or machine made of earth, which God forms with the explicit intention of making it as much as possible like us” (AT XI:120, CSM I:99). The working of these bodies can be explained in purely mechanical terms. Descartes tried to show that such a mechanical account can include much more than one might expect because it can provide an explanation of “the digestion of food, the beating of the heart and arteries, the nourishment and growth of the limbs, respiration, waking and sleeping, the reception by the external sense organs of light, sounds, smells, tastes, heat and other such qualities, the imprinting of the ideas of these qualities in the organ of the ‘common’ sense and the imagination, the retention or stamping of these ideas in the memory, the internal movements of the appetites and passions, and finally the external movements of all the limbs” (AT XI:201, CSM I:108). In scholastic philosophy, these activities were explained by referring to the soul, but Descartes proudly pointed out that he did not have to invoke this notion: “it is not necessary to conceive of this machine as having any vegetative or sensitive soul or other principle of movement and life, apart from its blood and its spirits, which are agitated by the heat of the fire burning continuously in its heart—a fire which has the same nature as all the fires that occur in inanimate bodies” (AT XI:201, CSM I:108).\nThe pineal gland played an important role in Descartes’ account because it was involved in sensation, imagination, memory and the causation of bodily movements. Unfortunately, however, some of Descartes’ basic anatomical and physiological assumptions were totally mistaken, not only by our standards, but also in light of what was already known in his time. It is important to keep this in mind, for otherwise his account cannot be understood. First, Descartes thought that the pineal gland is suspended in the middle of the ventricles.\n\nFigure 6. The Pineal Gland According to Descartes. This image from the 1664 edition of the Treatise of man illustrates Descartes’ view that the pineal gland (H) is suspended in the middle of the ventricles (Descartes 1664, p. 63).\n\nBut it is not, as Galen had already pointed out (see above). Secondly, Descartes thought that the pineal gland is full of animal spirits, brought to it by many small arteries which surround it. But as Galen had already pointed out, the gland is surrounded by veins rather than arteries. Third, Descartes described these animal spirits as “a very fine wind, or rather a very lively and pure flame” (AT XI:129, CSM I:100) and as “a certain very fine air or wind” (AT XI:331, CSM I:330). He thought that they inflate the ventricles just like the sails of a ship are inflated by the wind. But as we have mentioned, a century earlier Massa had already discovered that the ventricles are filled with liquid rather than an air-like substance.\nIn Descartes’ description of the role of the pineal gland, the pattern in which the animal spirits flow from the pineal gland was the crucial notion. He explained perception as follows. The nerves are hollow tubes filled with animal spirits. They also contain certain small fibers or threads which stretch from one end to the other. These fibers connect the sense organs with certain small valves in the walls of the ventricles of the brain. When the sensory organs are stimulated, parts of them are set in motion. These parts then begin to pull on the small fibers in the nerves, with the result that the valves with which these fibers are connected are pulled open, some of the animal spirits in the pressurized ventricles of the brain escape, and (because nature abhors a vacuum) a low-pressure image of the sensory stimulus appears on the surface of the pineal gland. It is this image which then “causes sensory perception” of whiteness, tickling, pain, and so on. “It is not [the figures] imprinted on the external sense organs, or on the internal surface of the brain, which should be taken to be ideas—but only those which are traced in the spirits on the surface of the gland H (where the seat of the imagination and the ‘common’ sense is located). That is to say, it is only the latter figures which should be taken to be the forms or images which the rational soul united to this machine will consider directly when it imagines some object or perceives it by the senses” (AT XI:176, CSM I:106). It is to be noted that the reference to the rational soul is a bit premature at this stage of Descartes’ story because he had announced that he would, to begin with, discuss only the functions of bodies without a soul.\nImagination arises in the same way as perception, except that it is not caused by external objects. Continuing the just-quoted passage, Descartes wrote: “And note that I say ‘imagines or perceives by the senses’. For I wish to apply the term ‘idea’ generally to all the impressions which the spirits can receive as they leave gland H. These are to be attributed to the ‘common’ sense when they depend on the presence of objects; but they may also proceed from many other causes (as I shall explain later), and they should then be attributed to the imagination” (AT XI:177, CSM I:106). Descartes’ materialistic interpretation of the term ‘idea’ in this context is striking. But this is not the only sense in which he used this term: when he was talking about real men instead of mechanical models of their bodies, he also referred to ‘ideas of the pure mind’ which do not involve the ‘corporeal imagination’.\nDescartes’ mechanical explanation of memory was as follows. The pores or gaps lying between the tiny fibers of the substance of the brain may become wider as a result of the flow of animal spirits through them. This changes the pattern in which the spirits will later flow through the brain and in this way figures may be “preserved in such a way that the ideas which were previously on the gland can be formed again long afterwards without requiring the presence of the objects to which they correspond. And this is what memory consists in” (AT XI:177, CSM I:107).\nFinally, Descartes presented an account of the origin of bodily movements. He thought that there are two types of bodily movement. First, there are movements which are caused by movements of the pineal gland. The pineal gland may be moved in three ways: (1) by “the force of the soul,” provided that there is a soul in the machine; (2) by the spirits randomly swirling about in the ventricles; and (3) as a result of stimulation of the sense organs. The role of the pineal gland is similar in all three cases: as a result of its movement, it may come close to some of the valves in the walls of the ventricles. The spirits which continuously flow from it may then push these valves open, with the result that some of the animal spirits in the pressurized ventricles can escape through these valves, flow to the muscles by means of the hollow, spirit-filled nerves, open or close certain valves in the muscles which control the tension in those muscles, and thus bring about contraction or relaxation of the muscles. As in perception, Descartes applied the term ‘idea’ again to the flow of animal spirits from the pineal gland: “And note that if we have an idea about moving a member, that idea—consisting of nothing but the way in which spirits flow from the gland—is the cause of the movement itself” (AT XI:181; Hall 1972, p. 92). Apart from the just-mentioned type of bodily motions, caused by motions of the pineal gland, there is also a second kind, namely reflexes. The pineal gland plays no role with respect to them. Reflexes are caused by direct exchanges of animal spirits between channels within the hemispheres of the brain. (Descartes did not know that there are “spinal reflexes”.) They do not necessarily give rise to ideas (in the sense of currents in the ventricles) and are not brought about by motions of the pineal gland.\n2.2 Between the Treatise of Man and The Passions of the Soul\nThe first remarks about the pineal gland which Descartes published are to be found in his Dioptrics (1637). The fifth discourse of this book contains the thesis that “a certain small gland in the middle of the ventricles” is the seat of the sensus communis, the general faculty of sense (AT VI:129, not in CSM I). In the sixth discourse, we find the following interesting observation on visual perception: “Now, when this picture [originating in the eyes] thus passes to the inside of our head, it still bears some resemblance to the objects from which it proceeds. As I have amply shown already, however, we must not think that it is by means of this resemblance that the picture causes our sensory perception of these objects—as if there were yet other eyes within our brain with which we could perceive it. Instead we must hold that it is the movements composing this picture which, acting directly upon our soul in so far as it is united to our body, are ordained by nature to make it have such sensations” (AT VI:130, CSM I:167). This remark shows that Descartes tried to avoid the so-called “homuncular fallacy,” which explains perception by assuming that there is a little man in the head who perceives the output of the sense organs, and obviously leads to an infinite regress.\nDescartes’ short remarks about a small gland in the middle of the brain which is of paramount importance apparently generated a lot of interest. In 1640, Descartes wrote several letters to answer a number of questions that various persons had raised. In these letters, he not only identified the small gland as the conarion or pineal gland (29 January 1640, AT III:19, CSMK 143), but also added some interesting points to the Treatise of man. First, he explained why he regarded it as the principal seat of the rational soul (a point that he had not yet addressed in the Treatise of man): “My view is that this gland is the principal seat of the soul, and the place in which all our thoughts are formed. The reason I believe this is that I cannot find any part of the brain, except this, which is not double. Since we see only one thing with two eyes, and hear only one voice with two ears, and in short have never more than one thought at a time, it must necessarily be the case that the impressions which enter by the two eyes or by the two ears, and so on, unite with each other in some part of the body before being considered by the soul. Now it is impossible to find any such place in the whole head except this gland; moreover it is situated in the most suitable possible place for this purpose, in the middle of all the concavities; and it is supported and surrounded by the little branches of the carotid arteries which bring the spirits into the brain” (29 January 1640, AT III:19–20, CSMK 143). And as he wrote later that year: “Since it is the only solid part in the whole brain which is single, it must necessarily be the seat of the common sense, i.e., of thought, and consequently of the soul; for one cannot be separated from the other. The only alternative is to say that the soul is not joined immediately to any solid part of the body, but only to the animal spirits which are in its concavities, and which enter it and leave it continually like the water of river. That would certainly be thought too absurd” (24 December 1640, AT III:264, CSMK 162). Another important property of the pineal gland, in Descartes’ eyes, is that it is small, light and easily movable (29 January 1640, AT III:20, CSMK 143). The pituitary gland is, though small, undivided and located in the midline, not the seat of the soul because it is outside the brain and entirely immobile (24 December 1640, AT III:263, CSMK 162). The processus vermiformis of the cerebellum (as Descartes called the appendage which Galen had discussed) is not a suitable candidate because it is divisible into two halves (30 July 1640, AT III:124, not in CSMK).\nA second interesting addition to the Treatise of man that Descartes made in these letters concerns memory. Descartes now wrote that memories may not only be stored in the hemispheres, but also in the pineal gland and in the muscles (29 January 1640, AT III:20, CSMK 143; 1 April 1640, AT III:48, CSMK 146). Apart from this, there is also another kind of memory, “entirely intellectual, which depends on the soul alone” (1 April 1640, AT III:48, CSMK 146).\nDescartes’ thesis that “the pineal gland is the seat of the sensus communis” was soon defended by others. The medical student Jean Cousin defended it in Paris in January 1641 (Cousin 1641) and the professor of theoretical medicine Regius defended it in Utrecht in June 1641 (Regius 1641, third disputation). Mersenne described the reaction of Cousin’s audience in a letter to Descartes, but this letter never reached its destination and is now lost (Lokhorst and Kaitaro 2001).\n2.3 The Passions of the Soul\nThe most extensive account of Descartes’ pineal neurophysiology and pineal neuropsychology is to be found in his The passions of the soul (1649), the last book that he published.\nThe Passions may be seen as a continuation of the Treatise of man, except that the direction of approach is different. The Treatise of man starts with the body and announces that the soul will be treated later. The conclusion would probably have been that we are indistinguishable from the hypothetical “men who resemble us” with which the Treatise of man is concerned and that we are just such machines equipped with a rational soul ourselves. In the Passions, Descartes starts from the other end, with man, and begins by splitting man up into a body and a soul.\nDescartes’ criterion for determining whether a function belongs to the body or soul was as follows: “anything we experience as being in us, and which we see can also exist in wholly inanimate bodies, must be attributed only to our body. On the other hand, anything in us which we cannot conceive in any way as capable of belonging to a body must be attributed to our soul. Thus, because we have no conception of the body as thinking in any way at all, we have reason to believe that every kind of thought present in us belongs to the soul. And since we do not doubt that there are inanimate bodies which can move in as many different ways as our bodies, if not more, and which have as much heat or more […], we must believe that all the heat and all the movements present in us, in so far as they do not depend on thought, belong solely to the body” (AT XI:329, CSM I:329).\nJust before he mentioned the pineal gland for the first time, Descartes emphasized that the soul is joined to the whole body: “We need to recognize that the soul is really joined to the whole body, and that we cannot properly say that it exists in any one part of the body to the exclusion of the others. For the body is a unity which is in a sense indivisible because of the arrangement of its organs, these being so related to one another that the removal of any one of them renders the whole body defective. And the soul is of such a nature that it has no relation to extension, or to the dimensions or other properties of the matter of which the body is composed: it is related solely to the whole assemblage of the body’s organs. This is obvious from our inability to conceive of a half or a third of a soul, or of the extension which a soul occupies. Nor does the soul become any smaller if we cut off some part of the body, but it becomes completely separate from the body when we break up the assemblage of the body’s organs” (AT XI:351, CSM I:339). But even though the soul is joined to the whole body, “nevertheless there is a certain part of the body where it exercises its functions more particularly than in all the others. […] The part of the body in which the soul directly exercises its functions is not the heart at all, or the whole of the brain. It is rather the innermost part of the brain, which is a certain very small gland situated in the middle of the brain’s substance and suspended above the passage through which the spirits in the brain’s anterior cavities communicate with those in its posterior cavities. The slightest movements on the part of this gland may alter very greatly the course of these spirits, and conversely any change, however slight, taking place in the course of the spirits may do much to change the movements of the gland” (AT XI:351, CSM I:340).\nThe view that the soul is attached to the whole body is already found in St Augustine’s works: “in each body the whole soul is in the whole body, and whole in each part of it” (On the Trinity, book 6, ch. 6). St Thomas Aquinas accepted this view and explained it by saying that the soul is completely present in each part of the body just as whiteness is, in a certain sense, completely present in each part of the surface of a blank sheet of paper. In deference to Aristotle, he added that this does not exclude that some organs (the heart, for example) are more important with respect to some of the faculties of the soul than others are (Summa theologica, part 1, question 76, art. 8; Quaestiones disputatae de anima, art. 10; Summa contra gentiles, book 2, ch. 72).\nAugustine’s and Aquinas’ thesis sounds reasonable as long as the soul is regarded as the principle of life. The principle of life may well held to be completely present in each living part of the body (just as biologists nowadays say that the complete genome is present in each living cell). However, Descartes did not regard the soul as the principle of life. He regarded it as the principle of thought. This makes one wonder what he may have meant by his remark. What would a principle of thought be doing in the bones and toes? One might think that Descartes meant that, although the pineal gland is the only organ to which the soul is immediately joined, the soul is nevertheless indirectly joined to the rest of the body by means of the threads and spirits in the nerves. But Descartes did not view this as immediate attachment: “I do not think that the soul is so imprisoned in the gland that it cannot act elsewhere. But utilizing a thing is not the same as being immediately joined or united to it” (30 July 1640). Moreover, it is clear that not all parts of the body are innervated.\nThe solution of this puzzle is to be found in a passage which Descartes wrote a few years before the Passions, in which he compared the mind with the heaviness or gravity of a body: “I saw that the gravity, while remaining coextensive with the heavy body, could exercise all its force in any one part of the body; for if the body were hung from a rope attached to any part of it, it would still pull the rope down with all its force, just as if all the gravity existed in the part actually touching the rope instead of being scattered through the remaining parts. This is exactly the way in which I now understand the mind to be coextensive with the body—the whole mind in the whole body and the whole mind in any one of its parts” (Replies to the sixth set of objections to the Meditations, 1641, AT VII:441, CSM II:297). He added that he thought that our ideas about gravity are derived from our conception of the soul.\nIn the secondary literature one often meets the claim that Descartes maintained that the soul has no spatial extension, but this claim is obviously wrong in view of Descartes’ own assertions. Those who make it may have been misled by Descartes’ quite different claim that extension is not the principal attribute of the soul, where ‘principal’ has a conceptual or epistemic sense.\nMost of the themes discussed in the Treatise of man and in the correspondence of 1640 (quoted above) reappear in the Passions of the soul, as this summary indicates: “the small gland which is the principal seat of the soul is suspended within the cavities containing these spirits, so that it can be moved by them in as many different ways as there are perceptible differences in the objects. But it can also be moved in various different ways by the soul, whose nature is such that it receives as many different impressions—that is, it has as many different perceptions as there occur different movements in this gland. And conversely, the mechanism of our body is so constructed that simply by this gland’s being moved in any way by the soul or by any other cause, it drives the surrounding spirits towards the pores of the brain, which direct them through the nerves to the muscles; and in this way the gland makes the spirits move the limbs” (AT XI:354, CSM I:341).\nThe description of recollection is more vivid than in the Treatise of man: “Thus, when the soul wants to remember something, this volition makes the gland lean first to one side and then to another, thus driving the spirits towards different regions of the brain until they come upon the one containing traces left by the object we want to remember. These traces consist simply in the fact that the pores of the brain through which the spirits previously made their way owing to the presence of this object have thereby become more apt than the others to be opened in the same way when the spirits again flow towards them. And so the spirits enter into these pores more easily when they come upon them, thereby producing in the gland that special movement which represents the same object to the soul, and makes it recognize the object as the one it wanted to remember” (AT XI:360, CSM I:343).\nThe description of the effect of the soul on the body in the causation of bodily movement is also more detailed: “And the activity of the soul consists entirely in the fact that simply by willing something it brings it about that the little gland to which it is closely joined moves in the manner required to produce the effect corresponding to this volition” (AT XI:359, CSM I:343).\nThe pineal neurophysiology of the passions or emotions is similar to what is occurring in perception: “the ultimate and most proximate cause of the passions of the soul is simply the agitation by which the spirits move the little gland in the middle of the brain” (AT XI:371, CSM I:349). However, there are some new ingredients which have no parallel in the Treatise of man. For example, in a chapter on the “conflicts that are usually supposed to occur between the lower part and the higher part of the soul,” we read that “the little gland in the middle of the brain can be pushed to one side by the soul and to the other side by the animal spirits” and that conflicting volitions may result in a conflict between “the force with which the spirits push the gland so as to cause the soul to desire something, and the force with which the soul, by its volition to avoid this thing, pushes the gland in a contrary direction” (AT XI:364, CSM I:345).\nIn later times, it was often objected that incorporeal volitions cannot move the corporeal pineal gland because this would violate the law of the conservation of energy. Descartes did not have this problem because he did not know this law. He may nevertheless have foreseen difficulties because, when he stated his third law of motion, he left the possibility open that it does not apply in this case: “All the particular causes of the changes which bodies undergo are covered by this third law—or at least the law covers all changes which are themselves corporeal. I am not here inquiring into the existence or nature of any power to move bodies which may be possessed by human minds, or the minds of angels” (AT VIII:65, CSM I:242).\n2.4 Body and Soul\nOne would like to know a little more about the nature of the soul and its relationship with the body, but Descartes never proposed a final theory about these issues. From passages such as the ones we have just quoted one might infer that he was an interactionist who thought that there are causal interactions between events in the body and events in the soul, but this is by no means the only interpretation that has been put forward. In the secondary literature, one finds at least the following interpretations.\n\nDescartes was a Scholastic-Aristotelian hylomorphist, who thought that the soul is not a substance but the first actuality or substantial form of the living body (Hoffman 1986, Skirry 2003).\nHe was a Platonist who became more and more extreme: “The first stage in Descartes’ writing presents a moderate Platonism; the second, a scholastic Platonism; the third, an extreme Platonism, which, following Maritain, we may also call angelism: ‘Cartesian dualism breaks man up into two complete substances, joined to another no one knows how: one the one hand, the body which is only geometric extension; on the other, the soul which is only thought—an angel inhabiting a machine and directing it by means of the pineal gland’ (Maritain 1944, p. 179). Not that there is anything very ‘moderate’ about his original position—it is only the surprising final position that can justify assigning it that title” (Voss 1994, p. 274).\nHe articulated—or came close to articulating—a trialistic distinction between three primitive categories or notions: extension (body), thought (mind) and the union of body and mind (Cottingham 1985; Cottingham 1986, ch. 5).\nHe was a dualistic interactionist, who thought that the rational soul and the body have a causal influence on each other. This is the interpretation one finds in most undergraduate textbooks (e.g., Copleston 1963, ch. 4).\nHe was a dualist who denied that causal interactions between the body and the mind are possible and therefore defended “a parallelism in which changes of definite kinds occurrent in the nerves and brains synchronize with certain mental states correlated with them” (Keeling 1963, p. 285).\nHe was, at least to a certain extent, a non-parallelist because he believed that pure actions of the soul, such as doubting, understanding, affirming, denying and willing, can occur without any corresponding or correlated physiological events taking place (Wilson 1978, p. 80; Cottingham 1986, p. 124). “The brain cannot in any way be employed in pure understanding, but only in imagining or perceiving by the senses” (AT VII:358, CSM II:248).\nHe was a dualistic occasionalist, just like his early followers Cordemoy (1666) and La Forge (1666), and thought that mental and physical events are nothing but occasions for God to act and bring about an event in the other domain (Hamilton in Reid 1895, vol. 2, p. 961 n).\nHe was an epiphenomenalist as far as the passions are concerned: he viewed them as causally ineffectual by-products of brain activity (Lyons 1980, pp. 4–5).\nHe was a supervenientist in the sense that he thought that the will is supervenient to (determined by) the body (Clarke 2003, p. 157).\nThe neurophysiology of the Treatise of man “seems fully consistent […] with a materialistic dual-aspect identity theory of mind and body” (Smith 1998, p. 70).\nHe was a skeptical idealist (Kant 1787, p. 274).\nHe was a covert materialist who hid his true opinion out of fear of the theologians (La Mettrie 1748).\n\nThere seem to be only two well-known theories from the history of the philosophy of mind that have not been attributed to him, namely behaviorism and functionalism. But even here one could make a case. According to Hoffman (1986) and Skirry (2003), Descartes accepted Aristotle’s theory that the soul is the form of the body. According to Kneale (1963, p. 839), the latter theory was “a sort of behaviourism”. According to Putnam (1975), Nussbaum (1978) and Wilkes (1978), it was similar to contemporary functionalism. By transitivity, one might conclude that Descartes was either a sort of behavorist or a functionalist.\nEach of these interpretations agrees with at least some passages in Descartes’ writings, but none agrees with all of them. Taken together, they suggest that Descartes’ philosophy of mind contains echoes of all theories that had been proposed before him and anticipations of all theories that were developed afterwards: it is a multi-faceted diamond in which all mind-body theories that have ever been proposed are reflected.\nIn his later years, Descartes was well aware that he had not successfully finished the project that he had begun in the Treatise of man and had not been able to formulate one comprehensive mind-body theory. He sometimes expressed irritation when others reminded him of this. In reply to the questions “how can the soul move the body if it is in no way material, and how can it receive the forms of corporeal objects?” he said that “the most ignorant people could, in a quarter of an hour, raise more questions of this kind than the wisest men could deal with in a lifetime; and this is why I have not bothered to answer any of them. These questions presuppose amongst other things an explanation of the union between the soul and the body, which I have not yet dealt with at all” (12 January 1646, AT IX:213, CSM II:275). On other occasions, he came close to admitting defeat. “The soul is conceived only by the pure intellect; body (i.e. extension, shapes and motions) can likewise be known by the intellect alone, but much better by the intellect aided by the imagination; and finally what belongs to the union of the soul and the body is known only obscurely by the intellect alone or even by the intellect aided by the imagination, but it is known very clearly by the senses. […] It does not seem to me that the human mind is capable of forming a very distinct conception of both the distinction between the soul and the body and their union; for to do this it is necessary to conceive them as a single thing and at the same time to conceive them as two things; and this is absurd” (28 June 1643, AT III:693, CSMK 227). He admitted that the unsuccessfulness of his enterprise might have been his own fault because he had never spent “more than a few hours a day in the thoughts which occupy the imagination and a few hours a year on those which occupy the intellect alone” (AT III:692, CSMK 227). But he had done so for a good reason because he thought it “very harmful to occupy one’s intellect frequently upon meditating upon [the principles of metaphysics which give us or knowledge of God and our soul], since this would impede it from devoting itself to the functions of the imagination and the senses” (AT III:695, CSMK 228). He advised others to do likewise: “one should not devote so much effort to the Meditations and to metaphysical questions, or give them elaborate treatment in commentaries and the like. […] They draw the mind too far away from physical and observable things, and make it unfit to study them. Yet it is just these physical studies that are most desirable for people to pursue, since they would yield abundant benefits for life” (Conversation with Burman, 1648, AT V:165, CSMK 346–347). We will follow this wise advice.\n3. Post-Cartesian Development\n3.1 Reactions to Descartes’ Views\nOnly a few people accepted Descartes’ pineal neurophysiology when he was still alive, and it was almost universally rejected after his death. Willis wrote about the pineal gland that “we can scarce believe this to be the seat of the Soul, or its chief Faculties to arise from it; because Animals, which seem to be almost quite destitute of Imagination, Memory, and other superior Powers of the Soul, have this Glandula or Kernel large and fair enough” (Willis 1664, ch. 14, as translated in Willis 1681). Steensen (1669) pointed out that Descartes’ basic anatomical assumptions were wrong because the pineal gland is not suspended in the middle of the ventricles and is not surrounded by arteries but veins. He argued that we know next to nothing about the brain. Camper (1784) seems to have been the very last one to uphold the Cartesian thesis that the pineal gland is the seat of the soul, although one may wonder whether he was completely serious. In philosophy, a position called “Cartesian interactionism” immediately provoked “either ridicule or disgust” (Spinoza 1677, part 4, preface), usually because it was seen as raising more problems than it solved, and it continues to do so to this day, but as we have already indicated, it is doubtful whether Descartes was a Cartesian interactionist himself.\nSome of the reasons that Descartes gave for his view that the pineal gland is the principal seat of the soul died out more slowly than this view itself. For example, his argument that “since our soul is not double, but one and indivisible, […] the part of the body to which it is most immediately joined should also be single and not divided into a pair of similar parts” (30 July 1640, AT III:124, CSMK 149), for instance, still played a role when Lancisi (1712) identified the unpaired corpus callosum in the midline of the brain as the seat of the soul. This view was, however, refuted by Zinn (1749) in a series of split-brain experiments on dogs. Lamettrie and many others explicitly rejected the thesis that the unity of experience requires a corresponding unity of the seat of the soul (Lamettrie 1745, ch. 10).\n3.2 Scientific Developments\nIn scientific studies of the pineal gland, little progress was made until the second half of the nineteenth century. As late as 1828, Magendie could still advance the theory that Galen had dismissed and Qusta ibn Luca had embraced: he suggested that it is “a valve designed to open and close the cerebral aqueduct” (Magendie 1828). Towards the end of the nineteenth century, however, the situation started to change (Zrenner 1985). First, several scientists independently launched the hypothesis that the pineal gland is a phylogenic relic, a vestige of a dorsal third eye. A modified form of this theory is still accepted today. Second, scientists began to surmise that the pineal gland is an endocrine organ. This hypothesis was fully established in the twentieth century. The hormone secreted by the pineal gland, melatonin, was first isolated in 1958. Melatonin is secreted in a circadian rhythm, which is interesting in view of the hypothesis that the pineal gland is a vestigial third eye. Melatonin was hailed as a “wonder drug” in the 1990s and then became one of the best-sold health supplements. The history of pineal gland research in the twentieth century has received some attention from philosophers of science (Young 1973, McMullen 1979), but this was only a short-lived discussion.\n3.3 Pseudo-Science\nAs philosophy reduced the pineal gland to just another part of the brain and science studied it as one endocrine gland among many, the pineal gland continued to have an exalted status in the realm of pseudo-science. Towards the end of the nineteenth century, Madame Blavatsky, the founder of theosophy, identified the “third eye” discovered by the comparative anatomists of her time with the “eye of Shiva” of “the Hindu mystics” and concluded that the pineal body of modern man is an atrophied vestige of this “organ of spiritual vision” (Blavatsky 1888, vol. 2, pp. 289–306). This theory is still fairly well-known today.\n3.4 Conclusion\nDescartes was neither the first nor the last philosopher who wrote about the pineal gland, but he attached more importance to it than any other philosopher did. Descartes tried to explain most of our mental life in terms of processes involving the pineal gland, but the details remained unclear, even in his own eyes, and his enterprise was soon abandoned for both philosophical and scientific reasons. Even so, the pineal gland remains intriguing in its own right and is still intensely studied today, with even a whole journal dedicated to it, the Journal of Pineal Research.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "[AT] Adam, C., Tannery, P., eds., 1964–1974 [1897–1913], <em>Oeuvres de Descartes</em>, 11 volumes + supplement, Paris: Vrin/CNRS. (In French.)",
                "Aetius, 1534, <em>Librorum medicinalium tomus primus</em>, Venice: In aedibus Aldi Manutii et Andreae Asulani. (In Greek.)",
                "Aetius, 1549, <em>Contractae ex veteribus medicinae tetrabiblos</em>, Lyons: Godefridus et Marcellus Beringi fratres. (In Latin.) <!-- Digitized photographic\nreproductions available online; \n <a href=\"http://gallica.bnf.fr/catalog?CT=N052834\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N052834\" target=\"other\">TIFF</a>.\n-->",
                "St Augustine, <em>De Trinitate</em>. (In Latin.) Electronic text <a href=\"http://www.thelatinlibrary.com/august.html\" target=\"other\">available online</a>. English translation also <a href=\"http://www.newadvent.org/fathers/1301.htm\" target=\"other\">available online</a>.",
                "Berengario da Carpi, J., 1530, <em>Isagogae breues et exactissimae in anatomia humani corporis</em>, Strasbourg: Benedictus Hectoris. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531915564&amp;idioma=1\" target=\"other\">available online</a> (JPEG).",
                "Blavatsky, H.P., 1888, <em>The Secret Doctrine</em>, 2 vols., London: The Theosophical Publishing Company. Electronic text <a href=\"http://www.theosociety.org/pasadena/sd/sd-hp.htm\" target=\"other\">available online</a>.",
                "Bos, J.J.F.M., 2002, <em>The Correspondence between Descartes and Henricus Regius</em>, Ph.D. Thesis, Utrecht University. Electronic text <a href=\"http://dspace.library.uu.nl/bitstream/handle/1874/88/full.pdf?sequence=1\" target=\"other\">available online</a>.",
                "Camper, P., 1784, Kurze Nachricht von der Zergliederung eines jungen Elephanten, in: Camper, P., <em>Kleinere Schriften</em>, vol. 1, pp. 50–93, Leipzig: Siegfried Lebrecht Crusius (In German.)",
                "Clarke, D.M., 2003, <em>Descartes’s Theory of Mind</em>, Oxford: Oxford University Press.",
                "Constantinus Africanus, 1536, De animae et spiritus discrimine liber, in: <em>Constantini Africani Opera</em>, pp. 308–317, Basel: Henricus Petrus. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532872834&amp;idioma=1\" target=\"other\">available online</a> (JPEG).",
                "Copleston, F., 1963, <em>A History of Philosophy</em>, vol. 4, New York: Doubleday.",
                "Cordemoy, G. de, 1666, <em>Le discernement du corps et de l’âme</em>, Paris: Florentin Lambert. (In French.) <!--\nDigitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N094249\" target=\"other\">available online</a>\n(PDF and TIFF).-->",
                "Cottingham, J., 1985, Cartesian trialism, <em>Mind</em>, 94: 218–230.",
                "Cottingham, J., 1986, <em>Descartes</em>, Oxford: Oxford University Press.",
                "[CSM] Cottingham, J., Stoothoff, R., Murdoch, D., 1984, <em>The Philosophical Writings of Descartes</em>, 2 vols., Cambridge: Cambridge University Press.",
                "[CSMK] Cottingham, J., Stoothoff, R., Murdoch, D., Kenny, A., 1991, <em>The Philosophical Writings of Descartes, Vol. III: The Correspondence</em>, Cambridge: Cambridge University Press.",
                "Cousin, J., 1641, An <em>kônarion</em> sensus communis sedes? Thesis, 24 January 1641, <em>École de médecine</em>, Paris. (In Latin.) Photographically reproduced and partially translated in Lokhorst and Kaitaro 2001.",
                "Descartes, R., 1637, La dioptrique, in: Descartes, R., <em>Discours de la méthode</em>, Leyden: Ian Maire. (In French.) Digitized photographic reproduction <a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=423_D44D_1637\" target=\"other\">available online</a> (JPEG). Reprinted in AT, vol. VI. Partial English translation in CSM, vol. I.",
                "Descartes, R., 1641, <em>Meditationes de prima philosophia</em>, Paris: Michel Soly. (In French.) Reprinted in AT, vol. VII. English translation in CSM, vol. II. <!-- Digitized photographic reproduction of 1685 Amsterdam edition\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057490\" target=\"other\">available online</a>\n (PDF and TIFF).-->",
                "Descartes, R., 1644, <em>Principia philosophiae</em>, Amsterdam: Lodewijk Elsevier. (In Latin.) <!--  Digitized photographic reproductions available online\n (<a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=526_D44P_1644\" target=\"other\">JPEG</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057492\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057492\" target=\"other\">TIFF</a>).\nReprinted in AT, vol. VIII. Partial English translation in CSM, vol.\nI.-->",
                "Descartes, R., 1649, <em>Les passions de l’âme</em>, Amsterdam: Lodewijk Elsevier. (In French.) Reprinted in AT, vol. XI. Electronic text <a href=\"http://www.fh-augsburg.de/~harsch/gallica/Chronologie/17siecle/Descartes/des_pas0.html\" target=\"other\">available online</a>. English translation in CSM, vol. I.",
                "Descartes, R., 1662, <em>De homine</em>, Leyden: Peter Leffen and Francis Moyard. (In Latin). <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057493\" target=\"other\">available online</a>\n(PDF and TIFF).-->",
                "Descartes, R., 1664, <em>L’Homme</em>, Paris: Charles Angot. (In French.) Reprinted in Adam and Tannery vol. XI. Partial English translation in CSM, vol. I. Complete English translation in Hall 1972. <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057485\" target=\"other\">available online</a>\n(PDF and TIFF). -->",
                "Israeli, Isaac ben Salomon, 1515, <em>Omnia opera Ysaac</em>, Lyons: Barthélemy Trot. (In Latin.) Digitized photographic reproductions available online (<a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532761552&amp;idioma=1\" target=\"other\">JPEG</a>). <!-- <a href=\"http://gallica.bnf.fr/catalog?CT=N054266\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N054266\" target=\"other\">TIFF</a>).-->",
                "Hall, T.S., 1972, <em>Treatise of Man</em>, Cambridge, MA: Harvard University Press.",
                "Hoffman, P., 1986, The unity of Descartes’s man, <em>Philosophical Review</em>, 95: 339–370.",
                "Kant, I., 1787, <em>Kritik der reinen Vernunft</em>, 2nd ed., Riga: Hartknoch. (In German.) Electronic text <a href=\"http://www.gutenberg.org/etext/6343\" target=\"other\">available online</a>. English translation also <a href=\"http://www.gutenberg.org/etext/4280\" target=\"other\">available online</a>.",
                "Keeling, S.V., 1963, Descartes, René, <em>Encyclopaedia Britannica</em>, vol. 7, London: Encyclopaedia Britannica, pp. 281–288.",
                "Kneale, M., 1963, Body and mind, <em>Encyclopaedia Britannica</em>, vol. 3, London: Encyclopaedia Britannica, pp. 838–840.",
                "Kühn, C.G., 1822, <em>Claudii Galeni opera omnia, vol. 3</em>, Leipzig: Cnobloch. (Greek text with Latin translation.)",
                "La Forge, L. de, 1666, <em>Traitté de l’esprit de l’homme</em>, Amsterdam: Abraham Wolfgang. (In French.) <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057384\" target=\"other\">available online</a>\n(PDF and TIFF).-->",
                "La Mettrie, J.O. de, 1745, <em>Histoire naturelle de l’âme</em>, The Hague: Jean Neulme. (In French.) The “London 1751” edition is photographically reproduced in Verbeek 1988.",
                "La Mettrie, J.O. de, 1748, <em>L’homme machine</em>, Leyden: Elie Luzac. (In French.) Electronic text <a href=\"http://www.fh-augsburg.de/~harsch/gallica/Chronologie/18siecle/LaMettrie/met_hom0.html\" target=\"other\">available online</a>. <!--\n English translation also\n <a href=\"http://cscs.umich.edu/~crshalizi/LaMettrie/Machine/\" target=\"other\">available online</a>.-->",
                "Lancisi, G.M., 1712, <em>Dissertatio altera de sede cogitantis animae</em>, Rome: Apud D. Joannem Fantonum. (In Latin.)",
                "Lokhorst, G.J.C., Kaitaro, T.T., 2001, The originality of Descartes’ theory about the pineal gland, <em>Journal for the History of the Neurosciences</em>, 10: 6–18.",
                "Lyons, W., 1980, <em>Emotion</em>, Cambridge: Cambridge University Press.",
                "McMullen, T., 1979, Philosophy of science and the pineal gland, <em>Philosophy</em>, 54: 380–384.",
                "Magendie, F., 1828, Mémoire physiologique sur le cerveau, <em>Journal de physiologie expérimentale et pathologique</em>, 8: 211–229. (In French.)",
                "Maritain, J., 1944, <em>The Dream of Descartes</em>, New York: Philosophical Library.",
                "Massa, N., 1536, <em>Liber introductorius anatomiae</em>, Venice: Francesco Bindoni and Maffeo Pasini. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531822124&amp;idioma=1\" target=\"other\">available online</a> (JPEG).",
                "May, M.T., 1968, <em>Galen: On the usefulness of the parts of the body</em>, 2 vols., Ithaca NY: Cornell University Press.",
                "Mondino dei Luzzi, 1306, <em>Anothomia</em>. (In Latin.) <!-- Digitized photographic reproductions of the\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058700\" target=\"other\">1482</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058545\" target=\"other\">1484</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058546\" target=\"other\">1494</a>\n and\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058724\" target=\"other\">1507</a>\n editions available online (PDF and TIFF).--> Digitized photographic reproductions of the <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532753274&amp;idioma=1\" target=\"other\">1513</a>, <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531822515&amp;idioma=1\" target=\"other\">1521</a>, <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531945854&amp;idioma=1\" target=\"other\">1531</a> and <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531937401&amp;idioma=1\" target=\"other\">1540</a> editions also available online (JPEG).",
                "Nemesius, 1802, <em>De natura hominis graece et latine</em>, Halle: Joan. Jac. Gebauer. (Greek text with Latin translation.) Photographic reprint, Hildesheim: Olms, 1967.",
                "Nussbaum, M., 1978, <em>Aristotle’s De Motu Animalium</em>, Princeton NJ: Princeton University Press.",
                "Publicius, J., 1482, <em>Artis oratoriae epitoma. Ars epistolandi. Ars memorativa</em>, Venice: Erhard Ratdolt. (In Latin.) Digitized photographic reproduction <a href=\"http://www.cervantesvirtual.com/servlet/SirveObras/bc/02415286111683495222202/index.htm\" target=\"other\">available online</a> (JPEG).",
                "Putnam, H., Philosophy and our mental life, in H. Putnam, <em>Mind, Language, and Reality: Philosophical Papers</em> (vol. 2), Cambridge: Cambridge University Press, pp. 291–303.",
                "Rahman, F., 1952, <em>Avicenna’s Psychology</em>, London: Oxford University Press.",
                "Regius, H., 1641, <em>Physiologia, sive cognitio sanitatis, tribus disputationibus in Academia Ultrajectina publicè proposita</em>, Utrecht: Aeg. Roman. (In Latin.) Reprinted in Bos 2002.",
                "Reid, T., 1895, <em>Philosophical works</em>, with notes and supplementary dissertations by W. Hamilton, 2 vols., Edinburgh: James Thin.",
                "Reisch, G., 1535, <em>Margarita philosophica</em>, Basel: H. Petrus. (In Latin.) <!-- Digitized photographic  reproduction\n <a href=\"http://bibliotecaforal.bizkaia.net/search/areisch&x=0&y=0/areisch/1,3,3,B/l962&FF=areischius+gregorius&1,1,,002010,-1\" target=\"other\">available online</a>.-->",
                "Rocca, J., 2003, <em>Galen on the Brain</em>, Leyden: Brill.",
                "Skirry, J.J., 2003, <em>Descartes on the Metaphysics of Human Nature</em>, Ph.D. Thesis, Purdue University.",
                "Smith, C.U.M., 1998, Descartes’ pineal neuropsychology, <em>Brain and Cognition</em>, 36: 57–72.",
                "Spinoza, B. de, 1677, Ethica ordine geometrico demonstrata, part 4, preface, in: <em>Opera posthuma</em>, Amsterdam: Rievwertsz. (In Latin.) Digitized photographic reproduction <a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=199_S75O\" target=\"other\">available online</a> (JPEG). English translation also <a href=\"http://www.gutenberg.org/etext/3800\" target=\"other\">available online</a>.",
                "Steensen, N., 1669, <em>Discours de Monsieur Stenon sur l’anatomie du cerveau</em>, Paris: R. de Ninville. (In French.) <!--\nDigitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N106685\" target=\"other\">available online</a>\n(PDF and TIFF).--> Photographic reproduction and English translation in G. Scherz, 1965, <em>Nicolaus Steno’s Lecture on the Anatomy of the Brain</em>, Copenhagen: Busck.",
                "St Thomas Aquinas, <em>Quaestiones disputatae de anima</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/qda00.html\" target=\"other\">available online</a>.",
                "St Thomas Aquinas. <em>Summa contra gentiles</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/scg1001.html\" target=\"other\">available online</a>.",
                "St Thomas Aquinas, <em>Summa theologica</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/sth0000.html\" target=\"other\">available online</a>. English translation also <a href=\"http://www.newadvent.org/summa/\" target=\"other\">available online</a>.",
                "Verbeek, T.H.M., 1988, <em>Le Traité de l’Ame de La Mettrie</em>, 2 vols., Ph.D. Thesis, Utrecht University. (In French.)",
                "Vesalius, A., 1543, <em>De Humani corporis fabrica Libri septem</em>, Basel: Johannes Oporinus. (In Latin).",
                "Vincent de Beauvais, 1494, <em>Speculum Naturale</em>, Venice: Hermannus Liechtenstein. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531445908&amp;idioma=1\" target=\"other\">available online</a> (JPEG).",
                "Vincent de Beauvais, 1624, <em>Speculum Quadruplex sive Speculum Majus I: Speculum Naturale</em>, Douai: Balthazar Bellère. (In Latin.) Photographic reprint, Graz: Akademische Druck- und Verlagsanstalt, 1964.",
                "Voss, S., 1994, Descartes: the end of anthropology, in: Cottingham, J., ed., <em>Reason, Will, and Sensation: Studies in Descartes’s Metaphysics</em>, Oxford: Oxford University Press, pp. 273–306.",
                "Watson, R., 2002, <em>Cogito Ergo Sum: The Life of René Descartes</em>, Boston: David Godine.",
                "Wilcox, J.-C., 1985, <em>The Transmission and Influence of Qusta ibn Luqa’s “On the Difference between Spirit and the Soul”</em>, Ph.D. thesis, City University of New York.",
                "Wilkes, K.V., 1978, <em>Physicalism</em>, London: Routledge &amp; Kegan Paul.",
                "Willis, T., 1664, <em>Cerebri anatome cui accessit nervorum descriptio et usus</em>, London: J. Martyn and J. Allestry. (In Latin.) [Digitized reproduction of 1666 Amsterdam edition <a href=\"http://books.google.com/books?id=FEUUAAAAQAAJ&amp;dq=Cerebri+anatome+cui+accessit+nervorum+descriptio+et+usus&amp;printsec=frontcover&amp;source=bl&amp;ots=mQus3y7LXj&amp;sig=cDvPIMrKWm4CehlvQQFd4qei8BI&amp;hl=en&amp;ei=SCv7Sa-FKpiKtgPV2u3fAQ&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=5\" target=\"other\">available online</a> (Google Books)].",
                "Willis, T., 1681, The anatomy of the brain and the description and use of the nerves, in: <em>The Remaining Medical Works of That Famous and Renowned Physician Dr. Thomas Willis</em>, translated by S. Pordage, London: Printed for T. Dring, C. Harper, J. Leigh and S. Martyn.",
                "Wilson, M.D., 1978, <em>Descartes</em>, London: Routledge.",
                "Young, J.Z., 1973, The pineal gland, <em>Philosophy</em>, 48: 70–74.",
                "Zinn, J.-G., 1749, <em>Experimenta quaedam circa corpus callosum, cerebellum, duram meningem, in vivis animalibus instituta</em>, Göttingen: Abram Vandenhoeck. (In Latin.)",
                "Zrenner, C., 1985, Theories of pineal function from classical antiquity to 1900: a history, <em>Pineal Research Reviews</em>, 3: 1–40."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>[AT] Adam, C., Tannery, P., eds., 1964–1974 [1897–1913], <em>Oeuvres de Descartes</em>, 11 volumes + supplement, Paris: Vrin/CNRS. (In French.)</li>\n<li>Aetius, 1534, <em>Librorum medicinalium tomus primus</em>, Venice: In aedibus Aldi Manutii et Andreae Asulani. (In Greek.)</li>\n<li>Aetius, 1549, <em>Contractae ex veteribus medicinae tetrabiblos</em>, Lyons: Godefridus et Marcellus Beringi fratres. (In Latin.) <!-- Digitized photographic\nreproductions available online; \n <a href=\"http://gallica.bnf.fr/catalog?CT=N052834\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N052834\" target=\"other\">TIFF</a>.\n--></li>\n<li>St Augustine, <em>De Trinitate</em>. (In Latin.) Electronic text <a href=\"http://www.thelatinlibrary.com/august.html\" target=\"other\">available online</a>. English translation also <a href=\"http://www.newadvent.org/fathers/1301.htm\" target=\"other\">available online</a>.</li>\n<li>Berengario da Carpi, J., 1530, <em>Isagogae breues et exactissimae in anatomia humani corporis</em>, Strasbourg: Benedictus Hectoris. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531915564&amp;idioma=1\" target=\"other\">available online</a> (JPEG).</li>\n<li>Blavatsky, H.P., 1888, <em>The Secret Doctrine</em>, 2 vols., London: The Theosophical Publishing Company. Electronic text <a href=\"http://www.theosociety.org/pasadena/sd/sd-hp.htm\" target=\"other\">available online</a>.</li>\n<li>Bos, J.J.F.M., 2002, <em>The Correspondence between Descartes and Henricus Regius</em>, Ph.D. Thesis, Utrecht University. Electronic text <a href=\"http://dspace.library.uu.nl/bitstream/handle/1874/88/full.pdf?sequence=1\" target=\"other\">available online</a>.</li>\n<li>Camper, P., 1784, Kurze Nachricht von der Zergliederung eines jungen Elephanten, in: Camper, P., <em>Kleinere Schriften</em>, vol. 1, pp. 50–93, Leipzig: Siegfried Lebrecht Crusius (In German.)</li>\n<li>Clarke, D.M., 2003, <em>Descartes’s Theory of Mind</em>, Oxford: Oxford University Press.</li>\n<li>Constantinus Africanus, 1536, De animae et spiritus discrimine liber, in: <em>Constantini Africani Opera</em>, pp. 308–317, Basel: Henricus Petrus. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532872834&amp;idioma=1\" target=\"other\">available online</a> (JPEG).</li>\n<li>Copleston, F., 1963, <em>A History of Philosophy</em>, vol. 4, New York: Doubleday.</li>\n<li>Cordemoy, G. de, 1666, <em>Le discernement du corps et de l’âme</em>, Paris: Florentin Lambert. (In French.) <!--\nDigitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N094249\" target=\"other\">available online</a>\n(PDF and TIFF).--></li>\n<li>Cottingham, J., 1985, Cartesian trialism, <em>Mind</em>, 94: 218–230.</li>\n<li>Cottingham, J., 1986, <em>Descartes</em>, Oxford: Oxford University Press.</li>\n<li>[CSM] Cottingham, J., Stoothoff, R., Murdoch, D., 1984, <em>The Philosophical Writings of Descartes</em>, 2 vols., Cambridge: Cambridge University Press.</li>\n<li>[CSMK] Cottingham, J., Stoothoff, R., Murdoch, D., Kenny, A., 1991, <em>The Philosophical Writings of Descartes, Vol. III: The Correspondence</em>, Cambridge: Cambridge University Press.</li>\n<li>Cousin, J., 1641, An <em>kônarion</em> sensus communis sedes? Thesis, 24 January 1641, <em>École de médecine</em>, Paris. (In Latin.) Photographically reproduced and partially translated in Lokhorst and Kaitaro 2001.</li>\n<li>Descartes, R., 1637, La dioptrique, in: Descartes, R., <em>Discours de la méthode</em>, Leyden: Ian Maire. (In French.) Digitized photographic reproduction <a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=423_D44D_1637\" target=\"other\">available online</a> (JPEG). Reprinted in AT, vol. VI. Partial English translation in CSM, vol. I.</li>\n<li>Descartes, R., 1641, <em>Meditationes de prima philosophia</em>, Paris: Michel Soly. (In French.) Reprinted in AT, vol. VII. English translation in CSM, vol. II. <!-- Digitized photographic reproduction of 1685 Amsterdam edition\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057490\" target=\"other\">available online</a>\n (PDF and TIFF).--></li>\n<li>Descartes, R., 1644, <em>Principia philosophiae</em>, Amsterdam: Lodewijk Elsevier. (In Latin.) <!--  Digitized photographic reproductions available online\n (<a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=526_D44P_1644\" target=\"other\">JPEG</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057492\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057492\" target=\"other\">TIFF</a>).\nReprinted in AT, vol. VIII. Partial English translation in CSM, vol.\nI.--></li>\n<li>Descartes, R., 1649, <em>Les passions de l’âme</em>, Amsterdam: Lodewijk Elsevier. (In French.) Reprinted in AT, vol. XI. Electronic text <a href=\"http://www.fh-augsburg.de/~harsch/gallica/Chronologie/17siecle/Descartes/des_pas0.html\" target=\"other\">available online</a>. English translation in CSM, vol. I.</li>\n<li>Descartes, R., 1662, <em>De homine</em>, Leyden: Peter Leffen and Francis Moyard. (In Latin). <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057493\" target=\"other\">available online</a>\n(PDF and TIFF).--></li>\n<li>Descartes, R., 1664, <em>L’Homme</em>, Paris: Charles Angot. (In French.) Reprinted in Adam and Tannery vol. XI. Partial English translation in CSM, vol. I. Complete English translation in Hall 1972. <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057485\" target=\"other\">available online</a>\n(PDF and TIFF). --></li>\n<li>Israeli, Isaac ben Salomon, 1515, <em>Omnia opera Ysaac</em>, Lyons: Barthélemy Trot. (In Latin.) Digitized photographic reproductions available online (<a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532761552&amp;idioma=1\" target=\"other\">JPEG</a>). <!-- <a href=\"http://gallica.bnf.fr/catalog?CT=N054266\" target=\"other\">PDF</a>\nand\n <a href=\"http://gallica.bnf.fr/catalog?CT=N054266\" target=\"other\">TIFF</a>).--></li>\n<li>Hall, T.S., 1972, <em>Treatise of Man</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Hoffman, P., 1986, The unity of Descartes’s man, <em>Philosophical Review</em>, 95: 339–370.</li>\n<li>Kant, I., 1787, <em>Kritik der reinen Vernunft</em>, 2nd ed., Riga: Hartknoch. (In German.) Electronic text <a href=\"http://www.gutenberg.org/etext/6343\" target=\"other\">available online</a>. English translation also <a href=\"http://www.gutenberg.org/etext/4280\" target=\"other\">available online</a>.</li>\n<li>Keeling, S.V., 1963, Descartes, René, <em>Encyclopaedia Britannica</em>, vol. 7, London: Encyclopaedia Britannica, pp. 281–288.</li>\n<li>Kneale, M., 1963, Body and mind, <em>Encyclopaedia Britannica</em>, vol. 3, London: Encyclopaedia Britannica, pp. 838–840.</li>\n<li>Kühn, C.G., 1822, <em>Claudii Galeni opera omnia, vol. 3</em>, Leipzig: Cnobloch. (Greek text with Latin translation.)</li>\n<li>La Forge, L. de, 1666, <em>Traitté de l’esprit de l’homme</em>, Amsterdam: Abraham Wolfgang. (In French.) <!-- Digitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N057384\" target=\"other\">available online</a>\n(PDF and TIFF).--></li>\n<li>La Mettrie, J.O. de, 1745, <em>Histoire naturelle de l’âme</em>, The Hague: Jean Neulme. (In French.) The “London 1751” edition is photographically reproduced in Verbeek 1988.</li>\n<li>La Mettrie, J.O. de, 1748, <em>L’homme machine</em>, Leyden: Elie Luzac. (In French.) Electronic text <a href=\"http://www.fh-augsburg.de/~harsch/gallica/Chronologie/18siecle/LaMettrie/met_hom0.html\" target=\"other\">available online</a>. <!--\n English translation also\n <a href=\"http://cscs.umich.edu/~crshalizi/LaMettrie/Machine/\" target=\"other\">available online</a>.--></li>\n<li>Lancisi, G.M., 1712, <em>Dissertatio altera de sede cogitantis animae</em>, Rome: Apud D. Joannem Fantonum. (In Latin.)</li>\n<li>Lokhorst, G.J.C., Kaitaro, T.T., 2001, The originality of Descartes’ theory about the pineal gland, <em>Journal for the History of the Neurosciences</em>, 10: 6–18.</li>\n<li>Lyons, W., 1980, <em>Emotion</em>, Cambridge: Cambridge University Press.</li>\n<li>McMullen, T., 1979, Philosophy of science and the pineal gland, <em>Philosophy</em>, 54: 380–384.</li>\n<li>Magendie, F., 1828, Mémoire physiologique sur le cerveau, <em>Journal de physiologie expérimentale et pathologique</em>, 8: 211–229. (In French.)</li>\n<li>Maritain, J., 1944, <em>The Dream of Descartes</em>, New York: Philosophical Library.</li>\n<li>Massa, N., 1536, <em>Liber introductorius anatomiae</em>, Venice: Francesco Bindoni and Maffeo Pasini. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531822124&amp;idioma=1\" target=\"other\">available online</a> (JPEG).</li>\n<li>May, M.T., 1968, <em>Galen: On the usefulness of the parts of the body</em>, 2 vols., Ithaca NY: Cornell University Press.</li>\n<li>Mondino dei Luzzi, 1306, <em>Anothomia</em>. (In Latin.) <!-- Digitized photographic reproductions of the\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058700\" target=\"other\">1482</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058545\" target=\"other\">1484</a>,\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058546\" target=\"other\">1494</a>\n and\n <a href=\"http://gallica.bnf.fr/catalog?CT=N058724\" target=\"other\">1507</a>\n editions available online (PDF and TIFF).--> Digitized photographic reproductions of the <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X532753274&amp;idioma=1\" target=\"other\">1513</a>, <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531822515&amp;idioma=1\" target=\"other\">1521</a>, <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531945854&amp;idioma=1\" target=\"other\">1531</a> and <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531937401&amp;idioma=1\" target=\"other\">1540</a> editions also available online (JPEG).</li>\n<li>Nemesius, 1802, <em>De natura hominis graece et latine</em>, Halle: Joan. Jac. Gebauer. (Greek text with Latin translation.) Photographic reprint, Hildesheim: Olms, 1967.</li>\n<li>Nussbaum, M., 1978, <em>Aristotle’s De Motu Animalium</em>, Princeton NJ: Princeton University Press.</li>\n<li>Publicius, J., 1482, <em>Artis oratoriae epitoma. Ars epistolandi. Ars memorativa</em>, Venice: Erhard Ratdolt. (In Latin.) Digitized photographic reproduction <a href=\"http://www.cervantesvirtual.com/servlet/SirveObras/bc/02415286111683495222202/index.htm\" target=\"other\">available online</a> (JPEG).</li>\n<li>Putnam, H., Philosophy and our mental life, in H. Putnam, <em>Mind, Language, and Reality: Philosophical Papers</em> (vol. 2), Cambridge: Cambridge University Press, pp. 291–303.</li>\n<li>Rahman, F., 1952, <em>Avicenna’s Psychology</em>, London: Oxford University Press.</li>\n<li>Regius, H., 1641, <em>Physiologia, sive cognitio sanitatis, tribus disputationibus in Academia Ultrajectina publicè proposita</em>, Utrecht: Aeg. Roman. (In Latin.) Reprinted in Bos 2002.</li>\n<li>Reid, T., 1895, <em>Philosophical works</em>, with notes and supplementary dissertations by W. Hamilton, 2 vols., Edinburgh: James Thin.</li>\n<li>Reisch, G., 1535, <em>Margarita philosophica</em>, Basel: H. Petrus. (In Latin.) <!-- Digitized photographic  reproduction\n <a href=\"http://bibliotecaforal.bizkaia.net/search/areisch&x=0&y=0/areisch/1,3,3,B/l962&FF=areischius+gregorius&1,1,,002010,-1\" target=\"other\">available online</a>.--></li>\n<li>Rocca, J., 2003, <em>Galen on the Brain</em>, Leyden: Brill.</li>\n<li>Skirry, J.J., 2003, <em>Descartes on the Metaphysics of Human Nature</em>, Ph.D. Thesis, Purdue University.</li>\n<li>Smith, C.U.M., 1998, Descartes’ pineal neuropsychology, <em>Brain and Cognition</em>, 36: 57–72.</li>\n<li>Spinoza, B. de, 1677, Ethica ordine geometrico demonstrata, part 4, preface, in: <em>Opera posthuma</em>, Amsterdam: Rievwertsz. (In Latin.) Digitized photographic reproduction <a href=\"http://posner.library.cmu.edu/Posner/books/book.cgi?call=199_S75O\" target=\"other\">available online</a> (JPEG). English translation also <a href=\"http://www.gutenberg.org/etext/3800\" target=\"other\">available online</a>.</li>\n<li>Steensen, N., 1669, <em>Discours de Monsieur Stenon sur l’anatomie du cerveau</em>, Paris: R. de Ninville. (In French.) <!--\nDigitized photographic reproduction\n <a href=\"http://gallica.bnf.fr/catalog?CT=N106685\" target=\"other\">available online</a>\n(PDF and TIFF).--> Photographic reproduction and English translation in G. Scherz, 1965, <em>Nicolaus Steno’s Lecture on the Anatomy of the Brain</em>, Copenhagen: Busck.</li>\n<li>St Thomas Aquinas, <em>Quaestiones disputatae de anima</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/qda00.html\" target=\"other\">available online</a>.</li>\n<li>St Thomas Aquinas. <em>Summa contra gentiles</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/scg1001.html\" target=\"other\">available online</a>.</li>\n<li>St Thomas Aquinas, <em>Summa theologica</em>. (In Latin.) Electronic text <a href=\"http://www.corpusthomisticum.org/sth0000.html\" target=\"other\">available online</a>. English translation also <a href=\"http://www.newadvent.org/summa/\" target=\"other\">available online</a>.</li>\n<li>Verbeek, T.H.M., 1988, <em>Le Traité de l’Ame de La Mettrie</em>, 2 vols., Ph.D. Thesis, Utrecht University. (In French.)</li>\n<li>Vesalius, A., 1543, <em>De Humani corporis fabrica Libri septem</em>, Basel: Johannes Oporinus. (In Latin).</li>\n<li>Vincent de Beauvais, 1494, <em>Speculum Naturale</em>, Venice: Hermannus Liechtenstein. (In Latin.) Digitized photographic reproduction <a href=\"http://alfama.sim.ucm.es/dioscorides/consulta_libro.asp?ref=X531445908&amp;idioma=1\" target=\"other\">available online</a> (JPEG).</li>\n<li>Vincent de Beauvais, 1624, <em>Speculum Quadruplex sive Speculum Majus I: Speculum Naturale</em>, Douai: Balthazar Bellère. (In Latin.) Photographic reprint, Graz: Akademische Druck- und Verlagsanstalt, 1964.</li>\n<li>Voss, S., 1994, Descartes: the end of anthropology, in: Cottingham, J., ed., <em>Reason, Will, and Sensation: Studies in Descartes’s Metaphysics</em>, Oxford: Oxford University Press, pp. 273–306.</li>\n<li>Watson, R., 2002, <em>Cogito Ergo Sum: The Life of René Descartes</em>, Boston: David Godine.</li>\n<li>Wilcox, J.-C., 1985, <em>The Transmission and Influence of Qusta ibn Luqa’s “On the Difference between Spirit and the Soul”</em>, Ph.D. thesis, City University of New York.</li>\n<li>Wilkes, K.V., 1978, <em>Physicalism</em>, London: Routledge &amp; Kegan Paul.</li>\n<li>Willis, T., 1664, <em>Cerebri anatome cui accessit nervorum descriptio et usus</em>, London: J. Martyn and J. Allestry. (In Latin.) [Digitized reproduction of 1666 Amsterdam edition <a href=\"http://books.google.com/books?id=FEUUAAAAQAAJ&amp;dq=Cerebri+anatome+cui+accessit+nervorum+descriptio+et+usus&amp;printsec=frontcover&amp;source=bl&amp;ots=mQus3y7LXj&amp;sig=cDvPIMrKWm4CehlvQQFd4qei8BI&amp;hl=en&amp;ei=SCv7Sa-FKpiKtgPV2u3fAQ&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=5\" target=\"other\">available online</a> (Google Books)].</li>\n<li>Willis, T., 1681, The anatomy of the brain and the description and use of the nerves, in: <em>The Remaining Medical Works of That Famous and Renowned Physician Dr. Thomas Willis</em>, translated by S. Pordage, London: Printed for T. Dring, C. Harper, J. Leigh and S. Martyn.</li>\n<!--\nRemoving these links because they no longer work.\n\nElectronic text available online in the form of 2 JPEG\nfiles and 23 Microsoft Office Document files:\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/Willis.doc\" target=\"other\">index</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_frontpage.jpg\" target=\"other\">frontpage</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_portrait.jpg\" target=\"other\">portrait</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_001epistle.doc\" target=\"other\">epistle</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_003preface.doc\" target=\"other\">preface</a>,\n chapters\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_01.doc\" target=\"other\">1</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_02.doc\" target=\"other\">2</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_03.doc\" target=\"other\">3</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_04.doc\" target=\"other\">4</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_05.doc\" target=\"other\">5</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_06.doc\" target=\"other\">6</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_07.doc\" target=\"other\">7</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_08.doc\" target=\"other\">8</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_09.doc\" target=\"other\">9</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_10.doc\" target=\"other\">10</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_11.doc\" target=\"other\">11</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_12.doc\" target=\"other\">12</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_13.doc\" target=\"other\">13</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_14.doc\" target=\"other\">14</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_15.doc\" target=\"other\">15</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_16.doc\" target=\"other\">16</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_17.doc\" target=\"other\">17</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_18.doc\" target=\"other\">18</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_19.doc\" target=\"other\">19</a>,\n <a href=\"http://www.cite-sciences.fr/english/ala_cite/expo/tempo/defis/histoire/medias3/PopUpWillis/willis_chapter_20.doc\" target=\"other\">20</a>.\n-->\n<li>Wilson, M.D., 1978, <em>Descartes</em>, London: Routledge.</li>\n<li>Young, J.Z., 1973, The pineal gland, <em>Philosophy</em>, 48: 70–74.</li>\n<li>Zinn, J.-G., 1749, <em>Experimenta quaedam circa corpus callosum, cerebellum, duram meningem, in vivis animalibus instituta</em>, Göttingen: Abram Vandenhoeck. (In Latin.)</li>\n<li>Zrenner, C., 1985, Theories of pineal function from classical antiquity to 1900: a history, <em>Pineal Research Reviews</em>, 3: 1–40.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Descartes, René",
            "dualism",
            "emotion",
            "Galen",
            "memory",
            "mind/brain identity theory",
            "perception: the problem of",
            "substance"
        ],
        "entry_link": [
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../dualism/": "dualism"
            },
            {
                "../emotion/": "emotion"
            },
            {
                "../galen/": "Galen"
            },
            {
                "../memory/": "memory"
            },
            {
                "../mind-identity/": "mind/brain identity theory"
            },
            {
                "../perception-problem/": "perception: the problem of"
            },
            {
                "../substance/": "substance"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=pineal-gland\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/pineal-gland/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=pineal-gland&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/pineal-gland/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=pineal-gland": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/pineal-gland/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=pineal-gland&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/pineal-gland/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.philological.bham.ac.uk/bibliography/\" target=\"other\">An analytic bibliography of on-line neo-latin texts</a>, by Dana F. Sutton, The University of California, Irvine. This bibliography contains links to electronic versions of almost all Latin texts mentioned above.",
            "<a href=\"https://serendipstudio.org/Mind/\" target=\"other\">Mind and body, Rene Descartes to William James</a>, by Robert H. Wozniak, Bryn Mawr"
        ],
        "listed_links": [
            {
                "http://www.philological.bham.ac.uk/bibliography/": "An analytic bibliography of on-line neo-latin texts"
            },
            {
                "https://serendipstudio.org/Mind/": "Mind and body, Rene Descartes to William James"
            }
        ]
    }
}