{
    "url": "quotation",
    "title": "Quotation",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Herman Cappelen\n<h.w.cappelen@ifikk.uio.no>\nErnest Lepore\n\nMatthew McKeever\n<mipmckeever@gmail.com>",
        "author_links": [
            {
                "mailto:h%2ew%2ecappelen%40ifikk%2euio%2eno": "h.w.cappelen@ifikk.uio.no"
            },
            {
                "http://ruccs.rutgers.edu/faculty/lepore.html": "Ernest Lepore"
            },
            {
                "mailto:mipmckeever%40gmail%2ecom": "mipmckeever@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\nHerman Cappelen\n&lt;<a href=\"mailto:h%2ew%2ecappelen%40ifikk%2euio%2eno\"><em>h<abbr title=\" dot \">.</abbr>w<abbr title=\" dot \">.</abbr>cappelen<abbr title=\" at \">@</abbr>ifikk<abbr title=\" dot \">.</abbr>uio<abbr title=\" dot \">.</abbr>no</em></a>&gt;<br/>\n<a href=\"http://ruccs.rutgers.edu/faculty/lepore.html\" target=\"other\">Ernest Lepore</a>\n<br/>\nMatthew McKeever\n&lt;<a href=\"mailto:mipmckeever%40gmail%2ecom\"><em>mipmckeever<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Sat Jul 16, 2005",
        "substantive revision Wed Apr 19, 2023"
    ],
    "preamble": "\n\nStarting with Frege, the semantics (and pragmatics) of quotation has\nreceived a steady flow of attention over the last one hundred or so\nyears. It has not, however, been subject to the same kind of intense\ndebate and scrutiny as, for example, the semantics of definite\ndescriptions or of propositional attitude verbs. Many philosophers\nprobably share Davidson’s experience: ‘When I was\ninitiated into the mysteries of logic and semantics, quotation was\nusually introduced as a somewhat shady device, and the introduction\nwas accompanied by a stern sermon on the sin of confusing the use and\nmention of expressions’ (Davidson 1979, p. 79). Those who leave\nit at that, however, miss out on one of the most difficult and\ninteresting topics in the philosophy of language.\n\nConsider the following\n sentences:[1]\n\n(1)\n‘Snow is white’ is true in English iff snow is white.\n\n(2)\n‘Aristotle’ refers to Aristotle.\n(3)\n‘The’ is the definite article in English.\n(4)\n‘Bachelor’ has eight letters.\n\n\nQuotation interests philosophers and linguists for various reasons,\nincluding these:\n\nWhen language is used to attribute properties to language or\notherwise theorize about it, a linguistic device is needed that\n‘turns language on itself’. Quotation is one such device.\nIt is our primary meta-linguistic tool and if you don’t\nunderstand quotation, then you can’t understand sentences like\n(1)–(4). Those who are in the business of theorizing about\nlanguage are particularly interested in understanding the mechanisms\nthat render (1)–(4) intelligible.\nTheories of quotation address questions not just about\nhow quotations refer, but also about what they refer\nto. In this regard, theories of quotation tell us what we are talking\nabout in (1)–(4).\nQuotation is a paradigmatic opaque context, i.e. a context in\nwhich substitution of synonymous or co-referential expressions can\nfail to preserve truth-value. To understand the nature of opacity you\nmust understand how quotation functions.\nQuotation is a device for talking about language, but it does so\nin a particularly tricky way: somehow quotation manages to use its\nreferent to do (or at least to participate in) the referring. Putting\nquotation marks around a word creates a device that refers to that\nvery word: ‘‘Aristotle’’ refers to\n‘Aristotle’. As such, quotation is a particularly\ninteresting referential device.\nAs with all issues in the philosophy of language, theories of\nquotation harbor assumptions about how best to draw the distinction\nbetween semantics and pragmatics, and they do so in a particularly\nilluminating way.\nAccounting for quotation presents some interesting technical\nchallenges in formal semantics, attempting to resolve which can shed\nlight on our understanding of such fundamental notions as\nindexicality, monstrosity, and compositionality.\n\n\nThe entry is structured as follows:\n",
    "toc": [
        {
            "#HowCharQuot": "1. How to Characterize Quotation"
        },
        {
            "#QuotIdenThroExam": "1.1 Quotation Identified Through Examples"
        },
        {
            "#QuotIdenSynt": "1.2 Quotation Identified Syntactically"
        },
        {
            "#QuotIdenSema": "1.3 Quotation Identified Semantically"
        },
        {
            "#BasiQuotFeat": "2. Basic Quotational Features"
        },
        {
            "#GuidQuesForTheoQuot": "2.1 Guiding Questions for Theories of Quotation"
        },
        {
            "#UseMentDist": "2.2 The Use-Mention Distinction"
        },
        {
            "#FiveTheoQuot": "3. Five Theories of Quotation"
        },
        {
            "#PropNameTheo": "3.1 The Proper Name Theory"
        },
        {
            "#DescTheoQuot": "3.2 The Description Theory of Quotation"
        },
        {
            "#DemoTheoQuot": "3.3 The Demonstrative Theory of Quotation"
        },
        {
            "#DisqTheoQuot": "3.4 Disquotational Theory of Quotation"
        },
        {
            "#IdenTheoQuotBettUseTheoQuot": "3.5 The Identity Theory of Quotation (or, better: the Use-Theory of Quotation)"
        },
        {
            "#MixeQuot": "4. Mixed Quotation"
        },
        {
            "#WhatKindEntiDoQuotRefe": "5. What Kinds of Entities do Quotations Refer to?"
        },
        {
            "#AlteQuotDevi": "6. Alternative Quotational Devices"
        },
        {
            "#TokeQuot": "6.1 Token Quotes"
        },
        {
            "#CornQuasQuot": "6.2 Corner (Quasi) Quotation"
        },
        {
            "#DotQuot": "6.3 Dot Quotes"
        },
        {
            "#UnamQuot": "6.4 Unambiguous Quotes"
        },
        {
            "#FormMateMode": "7. Formal-Material Modes"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. How to Characterize Quotation\n\nProblems arise right at the outset since quotation is not an easy\nthing to characterize. We start with reflections on how one might try\nto do so.\n1.1 Quotation Identified Through Examples\n\nThere’s an easy and relatively non-controversial way to\nidentify quotation: it is the sort of linguistic\nphenomenon exemplified by the subject in (4) and the direct\n object[2]\n in (5); these are instances of pure and direct\nquotation, respectively.\n\n(5)\nQuine said, ‘Quotation has a certain anomalous\nfeature’.\n\n\nThat leaves open the question of which semantic and syntactic devices\nbelong to that sort. Any characterization of a more specific nature,\neither of a syntactic or a semantic sort, moves into controversial\nterritory immediately.\n1.2 Quotation Identified Syntactically\n\nA syntactic characterization might go something like this:\nTake two quotation marks— single apostrophes in Britain, double\nin the United States, double angles in parts of Europe — and\nput, for example, a letter, a word, or a sentence between the two.\nWhat results is a quotation, as in (4)–(5). But then consider\nthe following sentences:\n\n(6)\nMy name is Donald.\n(7)\nBachelor has eight letters.\n\n\nWe can see there are two problems with the syntactic\ncharacterization:\n\nIn spoken language, no obvious correlates of quotation marks\nexist. Spoken utterances of (6) seem often to be\nunaccompanied by lexical items corresponding to\n‘quote/unquote’.\nEven if attention is restricted to written language, quotation is\nnot invariably indicated by the use of quotation marks. Sometimes, for\nexample, italicization is used instead, as in (7).\n\n\nOther devices employed as substitutes for quotation marks include bold\nface, indentation, and line indentation (cf. Quine 1940, pp.\n23–24; Geach 1957, p. 82). There’s no clear limit on the\nrange of distinct written options, other than that they are used as\nquotation marks, but this renders the syntactic characterization\nincomplete, and thus, unsatisfactory.\n1.3 Quotation Identified Semantically\n\nAnother tempting strategy is to say that an expression is quoted if it\nis mentioned. There are two problems with this\ncharacterization.\n\nSeveral theorists want to distinguish between mention and\nquotation (see\n Section 3.5).\n This definition would rule their theories out by stipulation.\nThis characterization is no clearer than the intuitive distinction\nbetween use and mention, and matters become even more complicated as\nsoon as we do try to characterize ‘mention’ and\n‘use’. Isn’t ‘bachelor’ in (4) in some\nsense used to refer to itself? If the response is that it is used, but\nnot with its normal semantic value, then we are left with the\nchallenge of defining ‘normal’ and ‘abnormal’\nsemantic values. That, again, leads immediately to controversy.\n\n\nIn order to remain as neutral as possible, we will stick with a simple\nidentification-through-examples strategy, and emphasize that it is an\nopen question as to how to identify the sort of linguistic devices to\nwhich the subject in (4) belongs.\n2. Basic Quotational Features\n\nQuotation is a subject matter that brings together a rather\nspectacular array of linguistic and semantic issues. Here are six\nbasic quotational features of particular importance (BQ1–BQ6,\nfor short) that will guide our search for an adequate account:\n\nBQ1. In quotation you cannot substitute\nco-referential or synonymous terms salva veritate.\n\nAn inference from (4) to (8), for example, fails to preserve\ntruth-value.\n\n(4)\n‘Bachelor’ has eight letters\n(8)\n‘Unmarried man’ has eight letters\n\n\nNo theory of quotation is adequate unless it explains this feature\n(and no theory of opacity is complete before it explains why quotation\nhas this feature).\n\nBQ2. It is not possible to quantify into\nquotation.\n\n(9), for example, does not follow from (4):\n\n(9)\n\\((\\exists x)\\)(‘\\(x\\)’ has eight letters)\n\n\n\nAn adequate theory of quotation must explain why not. The product of\nquoting ‘\\(x\\)’ is an expression that refers to the\n24th letter of the Roman alphabet. The point is that\nquotation marks, at least in natural language, cannot be quantified\ninto because they trap the variable; what results is a quotation that\nrefers to that very variable. Together, BQ1 and BQ2 place tough\nconstraints on developing a compositional theory for quotation:\nBQ1 would suggest quotational environments are opaque\nyet opaque environments often permit quantifying in which, per\nBQ2, quotation doesn’t. For discussion of\ncompositionality and quotation, see Pagin and Westerståhl 2010,\nBazzoni 2016, and Rabern 2022.\n\nBQ3. Quotation can be used to introduce novel\nwords, symbols and alphabets; it is not limited to the extant lexicon\nof any one language.\n\nBoth (10) and (11) are true English sentences:\n\n(10)\n‘\\(\\Phi\\)’ is not a part of any English expression. \n(11)\n‘❦’ is not an expression in any natural\nlanguage.\n\n\nAn adequate theory of quotation must explain what makes this practice\npossible.\n\nBQ4. There’s a particularly close\nrelationship between quotations and their semantic values.\n\n“lobsters” and its semantic value are more intimately\nrelated than ‘lobster’ and its semantic value, i.e., the\nrelationship between “lobster” and ‘lobster’\nis closer than that which obtains between ‘lobsters’ and\nlobsters. Whereas the quotation (i.e., “lobster”), in some\nway to be further explained, has its referent (i.e.,\n‘lobster’) contained in it, the semantic value of\n‘lobsters’, i.e., lobsters, are not contained in\n‘lobster’. One way to put it is that an expression e is\nin the quotation of e. No matter how one chooses to spell\nthis out, any theory of quotation must explain this relationship.\n\nBQ5. To understand quotation is to have an\ninfinite capacity, a capacity to understand and generate a potential\ninfinity of new quotations.\n\nWe don’t learn quotations one by one. Never having encountered\nthe quotation in (10) or (11) does nothing to prohibit comprehending\nthem (Christensen 1967, p. 362) and identifying their semantic\nvalues.\n\nSimilarly, there doesn’t seem to be any upper bound on a\nspeaker’s ability to generate novel quotations. One natural\nexplanation for this is that quotation is a productive device\nin natural language.\n\nBQ6. Quoted words can be simultaneously used and\nmentioned. This is an important observation due to Davidson,\nas exemplified in\n (12).[3]\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’.\n\n\n(12) is called a ‘mixed quotation’. This is because it\nmixes the direct quotation (as in (5)) and indirect (as in (13)).\n\n(5)\nQuine said ‘quotation has a certain anomalous\nfeature’.\n(13)\nQuine said that quotation has a certain anomalous feature.\n\n\nIn this regard, the quotation in (12) is, in an intuitive sense,\nsimultaneously used and mentioned. It is used to say what Quine said\n(viz. that quotation has a certain anomalous feature), and\nalso to say that Quine used the words ‘has a certain anomalous\nfeature’ in saying it.\n\nMixed quotation had not been much discussed prior to Davidson (1979)\nbut it has recently taken center stage in discussions of theories of\nquotation. For those who believe themselves unfamiliar with the data,\nwe point out that mixed quotation is one of the most frequently used\nforms of quotation. Casually peruse any newspaper and you will find\npassages like the following from the New York Times:\n\nNYT Dec 7, 2004: The court ruled that the sentence was\ninvalid because the document signed into law by President Bill Clinton\ncontained a phrase that was illogical. The law said that defendants\nlike Mr. Pabon, who was convicted two years ago of advertising to\nreceive or distribute child pornography over the Internet, should be\nfined or receive a mandatory minimum sentence of 10 years ‘and\nboth.’ The appeals court said this language ‘makes no\nsense.’\n\n\nIn the 21st century, mixed quotation has become one of the central\ntopics in the theory of quotation: a range of interesting data has\nbeen brought to light and a flurry of theories have been defended. In\n Section 4\n below we introduce some of the data.\n\nIn what follows we will refer back to these six features and make the\nfollowing assumption:\n\nIt is a necessary adequacy condition on a theory of quotation that it\neither explains how quotations can exhibit features (BQ1)–(BQ6),\nor, if it fails to do so, then it must present an argument for why any\nunexplained feature doesn’t require explanation.\n\nBefore going on, an important note: quotation, perhaps more than any\nother area of language, is difficult because not only is there no\nconsensus about what the correct theory is, but there’s also\nbasic disagreements about the space of options, and about the data to\nbe accounted for. We’ll see this below, but it’s important\nto bear in mind that when it comes to quotation, the consensus is that\nthere’s no consensus, and disagreement is the norm.\n2.1 Guiding Questions for Theories of Quotation\n\nBQ1–BQ6 play an important role because theories of quotation are\nattempts to answer certain questions, and those questions won’t\nhave satisfactory answers unless BQ1–BQ6 are accounted for.\nThree questions can be thought of as the guiding questions for a\ntheory of quotation:\n\nQ1. In a quotation, what does the referring? There are three\noptions:\n\n\nThe quotation marks\nThe expression between the quotation marks\nA complex of the expression and the quotation marks\n\n\n\nAlternatively, one might hold that quotations fail to refer at all,\nbut rather that speakers refer contingent upon the intentions with\nwhich they use an expression—with or without quotation\nmarks.\n\nQ2. How do quotations refer?\n\nAre they names, descriptions, demonstratives, functors or some sui\ngeneris linguistic category?\n\nIn addition to Q1 and Q2, theories of quotation often try answer a\nthird question:\n\nQ3. What do quotations refer to?\n\nWhat kinds of objects are picked out? Is it always the same object or\nare quotations\n ambiguous?[4]\n\nOur primary focus in what follows will be in Q1 and Q2, but along the\nway we will also address Q3.\n (Section 5\n is entirely devoted to Q3.)\n2.2 The Use-Mention Distinction\n\nIt is standard practice in philosophy to distinguish the use\nof an expression from the mentioning of it. Confusing these\ntwo is often taken to be a philosophical mortal sin. Despite its\nubiquitous appeal, it is controversial exactly how to draw the\ndistinction. The initial thought is easy enough. Consider (D1) and\n(D2):\n\nD1. Jim went to Paris\n\nD2. ‘Jim’ has three letters\n\nIn (D1) the word ‘Jim’ is used to talk about (or signify,\nor denote) a person, i.e. Jim, and the sentence says about that person\nthat he went to Paris. In (D2) the word is not used in that way.\nInstead, ‘Jim’ is used to talk about (or signify or\ndenote) a word, i.e. ‘Jim’, and the sentence says about\nthat word that it has three\n letters[5].\n In (D1), ‘Jim’ is being used and in (D2) it is\nbeing mentioned.\n\nThe initial thought seems right as far as it goes, but it might be\nthought it doesn’t go far enough. One might hope that we could\nsay more to flesh it out in an uncontroversial way, a\ntheory-neutral way that any party to the debate could agree on. In\nfact, though (and this is not recognized enough), this is not\nstraightforward. To see this, consider a couple of ways to try to\nbuild on the initial characterization:\n\nExpression \\(E\\) is mentioned in sentence \\(S\\) just in\ncase \\(E\\) is quoted in \\(S\\).\n\n\nA problem with this is that according to some theories, an expression\ncan be mentioned without being quoted (see Objection 3 in section\n3.3.2).\n\nExpression \\(E\\) is mentioned in sentence \\(S\\) just in\ncase it is used to refer to itself in \\(S\\).\n\n\nThis is problematic in a couple of ways. First, notice that according\nto (ii), \\(E\\) must be used in order to mention it; that’s\npotentially puzzling. More significantly, it is controversial whether\nstandard meta-linguistic devices such as quotation are referring\nexpressions. The theories presented in sections 3.2 and 3.3 treat\nquotations as descriptions. If descriptions are quantified\nexpressions, then quotations are quantifiers, and quantifiers are\ntypically not treated as referring expressions. Proposals along the\nlines of (ii) would also have to ensure that ‘the first seven\nwords in this sentence’ in (D3) don’t end up referring to\n‘the first seven words in this sentence’:\n\nD3. The first seven words in this sentence contain thirty-two\nletters.\n\nWhat this suggests is that any attempt to characterize the distinction\nbetween use and mention more sophisticated than the\ninitial characterization in this section will need to address at least\nsome of the tricky issues that face the various theories of quotation\nwe describe in what follows.\n3. Five Theories of Quotation\n\nThere are, roughly, five kinds of theories of quotation that have been\ncentral to the discussion of quotation: the Proper Name Theory, the\nDescription Theory, the Demonstrative/Paratactic Theory, the\nDisquotational Theory, and the Use/Identity Theory. (See here\nMaier’s taxonomy (2014b), which just includes the first four\ntheories, and which evaluates them according in terms of formal\ndesiderata like compositionality and productivity, and cf. Saka 2013,\nwhich includes ten. This divergence, incidentally, is a good\nillustration of the point we made above about lack of consensus among\ntheorists of quotation.) In the following sections we discuss each of\nthese and review their strengths and weaknesses.\n3.1 The Proper Name Theory\n\nIt is now almost a tradition in the literature on quotation to include\na brief dismissive discussion of the Proper Name Theory of Quotation.\nThis view is described, although not clearly endorsed, in passages in\nQuine and Tarski (e.g., Quine 1940, pp. 23–26; 1961, p. 140;\nTarski 1933, p. 159ff), and comments in passing in both Reichenbach\n(1947, p. 335) and Carnap (1947, p. 4) strongly suggest they were\nadherents. That said, there is some debate about whether Quine and\nTarski ever held the view (see, e.g., Bennett 1988, Richard 1986, Saka\n1998, and Gomez-Torrente 2001). And so it is worth mentioning that\nalthough we quote both Quine and Tarski below, we do not thereby\nmean to attribute the Proper Name Theory to either of them; we do so\nmerely because they describe it clearly.\n\nUntil recently, it was generally held that the name theory was\n‘an utter failure’ (Saka 1998, p. 114), of interest only\nas showing us how not to theorize about quotation. In recent years,\nhowever, there have been at least two defenses of something like the\nname theory (Gomez-Torrente 2013 and Johnson 2018). We here present\nthe reasons the name theory was long taken to be a non-starter, as\nwell as the responses to these problems by the authors mentioned\nabove.\n\nAccording to the Proper Name Theory, quotations are unstructured\nproper names of the quoted expressions. Quine writes:\n\nFrom the standpoint of logical analysis each whole quotation must be\nregarded as a single word or sign, whose parts count for no more than\nserifs or syllables. (Quine 1940, p. 26)\n\n\nThe personal name buried within the first word of the statement\n‘‘Cicero’ has six letters’, e.g., is logically\nno more germane to the statement than is the verb ‘let’\nwhich is buried within the last word. (Quine 1940, p. 26)\n\n\nTarski formulates the view as follows:\n\nQuotation-mark names may be treated like single words of a language,\nand thus like syntactically simple expressions. The single\nconstituents of these names—the quotation marks and the\nexpressions standing between them—fulfill the same function as\nthe letters and complexes of successive letters in single words. Hence\nthey can possess no independent meaning. Every quotation-mark name is\nthen a constant individual name of a definite expression (the\nexpression enclosed by the quotation marks) and is in fact a name of\nthe same nature as the proper name of a man. (Tarski 1933, p. 159)\n\n3.1.1 Strengths of the Proper Name Theory\n\nThe Proper Name Theory nicely accommodates (BQ1)–(BQ3); that is,\non this theory we see why co-referential expressions cannot be\nsubstituted for one another. According to the Proper Name Theory, the\nname ‘Cicero’ does not occur in\n‘‘Cicero’’; from the mere fact that Cicero =\nTully, it does not follow that ‘Tully’ can be substituted\nfor ‘Cicero’ in ‘‘Cicero’’. As\nQuine puts it, ‘[t]o make substitution upon a personal name,\nwith such a context, would be no more justifiable than to make a\nsubstitution upon the term ‘cat’ within the context\n‘cattle’ (Quine 1961, p. 141). The Proper Name Theory\npermits the creation of new quotations much as natural languages\npermit the introduction of new names. And it prohibits quantifying in,\nsince each quotation is a single word, and so there is nothing to\nquantify into. To see this, consider the following. We obviously can’t\nquantify into words. The idea barely makes sense. Imagine we have the\nsentence ‘there is a birth dearth in Europe’. We can’t\nquantify into, say, the word ‘dearth’. The following\ndoesn’t make sense, where we’re trying to express an existential\ngeneralization satisfied by the word or string\n‘earth’:\n\n(14)\n\\((\\exists x)\\) (there is a birth \\(dx\\) in Europe) \n\n\nThis is nonsense: ‘dx’ just can’t mean ‘d’\ncombined with the value of the variable ‘x’. Now\nconsider:\n\n(15)\n‘bachelor’ has eight letters.\n(16)\n\\((\\exists x)\\)(‘\\(x\\)’ has eight letters)\n\n\n\nThis is also ill-formed. The proper name theorist can explain it.\nRemember, for the proper name theorist, quotations are akin to names\nand quotation marks are akin to letters. But then if that’s so, (16)\nis on a par with (14): both are trying to quantify into expressions\n(the former expressions beginning with ‘d’ and the\nlatter expressions beginning with ‘ and ending with\n‘). The obvious badness of (14) can explain the badness of (16),\nfor the proper name theorist.\n3.1.2 Weaknesses of the Proper Name Theory\n\nHere are three objections to the Proper Name Theory of Quotation. (The\nmain objections are in Davidson (1979, pp. 81–83), though some\nwere anticipated by Geach (1957, p.79ff).)\n\nObjection 1: The Proper Name Theory cannot\nexplain how we can generate and interpret an indefinite number of\nnovel quotations (see BQ5).\n\nIf quotations were proper names and lacked semantic structure\naltogether, then there would be no rule for determining how to\ngenerate or interpret novel quotations. To understand one would be to\nlearn a new name. (Remember, the quotation marks, according to Quine,\ncarry no more significance than the serifs you see on these letters.)\nBut (11), e.g., can be understood by someone who has never encountered\nits quoted symbol before.\n\n(11)\n‘❦’ is not a letter in any language\n\n\nUnderstanding (11) is not like understanding a sentence with a\npreviously unknown proper name. Upon encountering (11), it would seem\nthat you know exactly which symbol is being referenced in a way that\nyou do not with a name you’ve never before encountered.\n\nFor a long time, this objection was thought fatal. However, a paper by\nMario Gomez-Torrente (2013) suggests a way to square something like\nthe name view with Objection 1. In brief, he points\nout that there are some names that can be indefinitely generated and\ninterpreted. For example, street names. ‘East 6th Street’,\npresumably, is a bona fide name, but one doesn’t either need to\nindividually bestow it on the particular street it applies to (the\nstreet between East 5th and East 7th), nor does one need to have\nalready learned it to understand what ‘East 6th Street has some\ngreat bars’ means.\n\nObjection 2: There’s a special relationship\nbetween quotations and their semantic values (see BQ4).\n\nAccording to the Proper Name Theory, the relationship between\n“lobsters” and ‘lobsters’ is no closer than\nthe relationship between ‘lobsters’ and lobsters. That\nseems to miss the fundamental aspect of quotation spelled out in\n(BQ4).\n\nDavidson summarizes these first two objections succinctly:\n\nIf quotations are structureless singular terms, then there is no more\nsignificance to the category of quotation-mark names than to\nthe category of names that begin and end with the letter\n‘a’ (‘Atlanta’, ‘Alabama’,\n‘Alta’, ‘Athena’, etc.). On this view, there\nis no relation, beyond an accident of spelling, between an expression\nand the quotation-mark name of that expression. (Davidson 1979, pp.\n81–82; cf., also, Garcia-Carpintero 1994, pp. 254–55)\n\n\nAgain, however, some work has pushed back against these old\nobjections. Michael Johnson (2018) points to some names which bear\nspecial relationships to their referents. In particular, he points to\nonomatopoeia. For example, ‘buzz’ refers to a\nsound, a buzzing sound. But the word ‘buzz’, when uttered,\nmakes the sound it refers to. Roughly speaking, Johnson holds that we\ncould view quotations in the same way: as he says, ‘the name of\na person sounds like the name of his name’ (2018). For some\ndiscussion of Johnson’s view, see Miller 2019.\n\nObjection 3: Proper Name Theory leaves no room\nfor dual use and mention (see BQ6).\n\nIf quotations were proper names, and if their interiors lacked\nsignificant structure, there would seem to be no room for dual usage\nof the kind found in (12); indeed, on the Proper Name Theory, (12) has\nthe same interpretive form as (17):\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’.\n(17)\nQuine said that quotation Ted.\n\n\nThat is, the Proper Name Theory fails to account for (BQ6).\n\nOther objections have been raised against the Proper Name Theory of\nQuotation. For further discussion, see Davidson (1979), Cappelen and\nLepore (1997b) and Saka (1998). Whether the recent defenders of the\nname theory will be able to take it off its deathbed remains to be\nseen, but it’s fair to say that their work shows that reports of\nits demise have been, at least, a bit premature.\n3.2 The Description Theory of Quotation\n\nThe Description Theory of Quotation was introduced in order to\nguarantee that ‘a quoted series of expressions is always a\nseries of quoted expressions’ (Geach 1957, p. 82) and not\n‘a single long word, whose parts have no separate\nsignificance’ (ibid., p. 82). According to this theory,\nthere is a set of basic units in each language: words, according to\nGeach (ibid., Ch. 18 and 1970); letters, according to Tarski\n(1956, p. 160) and Quine (1960, p. 143, p.\n 212)).[6]\n\nThis view retains the Proper Name Theory for basic quotations, e.g.,\naccording to Quine, “\\(a\\)” is a name of one letter,\n“\\(b\\)” a name of another, etc. For Geach, each word\nhas a quotation name. Complex quotations, i.e., quotations with more\nthan one basic unit, are understood as descriptions of concatenations\nof the basic units. Here is an illustration from Geach (where\n‘-’ is his sign for concatenation):\n\n…the quotation ‘‘man is mortal’’ is\nrightly understood only if we read it as meaning the same as\n‘‘man’-‘is’-‘mortal’’,\ni.e., read it as describing the quoted expression in terms of\nthe expressions it contains and their order. (Geach 1957, pp.\n82–83)\n\n\nFor Quine and Tarski, (4) gets analyzed as (18):\n\n(4)\n‘Bachelor’ has eight letters.\n(18)\n\n‘B’-‘a’-‘c’-‘h’-‘e’-‘l’-‘o’-‘r’\nhas eight letters\n\n\nwhere ‘-’ is their sign for concatenation and the\nindividual quotations are names of the letters.\n\nDavidson characterizes the difference between the two versions as\nfollows:\n\nIn primitive notation, which reveals all structure to the eye, Geach\nhas an easier time writing (for only each word needs quotation marks)\nbut a harder time learning or describing the language (he has a much\nlarger primitive vocabulary—twice normal size if we disregard\niteration). (Davidson 1979, p. 84)\n\n\nThat is to say, if Geach’s theory were true, the appropriate\nrepresentation of (4) is simply (4), whereas for Tarski and Quine\nit’s the much more unwieldy (18). On the other hand, a Geachian\nlanguage has (at least) twice as many words as we might expect: for\neach word in the dictionary, there would also be the word that stands\nfor that word (got by enclosing the initial word in quotation\nmarks).\n3.2.1 Strengths and Weaknesses of the Description Theory\n\nIn one respect the Description Theory is an immense improvement over\nthe Proper Name Theory: it deals with no more than a finite set of\nbasic names, thus, potentially accommodating (BQ5). In other respects,\nhowever, the theory is, by a wide consensus, not much of an\nimprovement over the Proper Name Theory. At the basic level, the\ntheory still treats quotations as names. So, at that level, it\ninherits many of the problems confronting the simpler Proper Name\nTheory. Some of the more obvious objections are these (again we\nmention only some of the most obvious ones here since the theory is\nnot central to contemporary discussions):\n\nAt the basic level (i.e., the level of words or letters),\nthere’s no rule for determining how to interpret and generate\nnovel quotations (BQ3). This is so because there is no a\npriori reason to believe there are finitely many basic\nexpressions (cf., Lepore 1999).\nAt the basic level, it doesn’t explain the special\nrelationship between the expression and the quotation of that\nexpression (BQ4). It’s obvious to us that “Sam” and\n“Alice” do not refer to the same expression, but how can\nGeach explain this triviality if both are just proper names; ditto for\nQuine with respect to “a” and “b” (cf.,\nDavidson 1979, p. 87).\nAt the basic level, it fails to account for dual use and mention\n(BQ6). This is particularly a problem for Geach’s version. Any\naccount, including the Proper Name Theory, according to which the\nsemantic function of word-tokens inside quotation marks is just to\nrefer to word-types (or some other type of linguistic entity) fails to\nassign correct truth-conditions to (12). In essence, it predicts that\n(12) is syntactically equivalent to something like ‘Quine said\nthat quotation the phrase’, which is ungrammatical as containing\na definite description where a verb phrase should be.\nAccording to Davidson (1979, pp. 86–87), the Description\nTheory can’t explain why we can’t quantify into quotation\n(i.e. it fails to account for BQ2). Roughly, the thought seems to be\nthat we can existentially generalize from (4) to ‘some word has\neight letters’. But by a similar sort of reasoning, we should be\nable to move from (18) to ‘some letter is that such that\n‘B’-‘a’-‘c’-‘h’-‘e’-‘l’-it-‘r’\nhas eight letters’. But clearly no such move can be made.\n\n3.3 The Demonstrative Theory of Quotation\n\nThe seminal paper on quotation in the twentieth century is, by almost\nuniversal consensus, Davidson’s ‘Quotation’ (1979).\nIt is without comparison the most discussed and influential paper on\nthe subject. The view Davidson defends is called the Demonstrative\nTheory. (It is also called the Paratactic Theory, though we shall use\nthe former label in our discussion.) The Demonstrative Theory is\npresented in the final pages of ‘Quotation’ and the key\npassages are\n these:[7]\n\n\n…quotation marks…help refer to a shape by pointing out\nsomething that has it…The singular term is the quotation marks,\nwhich may be read ‘the expression a token of which is\nhere’. (Davidson 1979, p. 90)\n\nOn my theory which we may call the demonstrative theory of quotation,\nthe inscription inside does not refer to anything at all, nor is it\npart of any expression that does. Rather it is the quotation marks\nthat do all the referring, and they help to refer to a shape by\npointing out something that has it. (Davidson 1979, p. 90)\n\nQuotation marks could be warped so as to remove the quoted material\nfrom a sentence in which they play no semantic role. Thus instead\nof:\n\n‘Alice swooned’ is a sentence.\n\n\nwe could write:\n\nAlice swooned. The expression of which this is a token is a sentence.\n (Davidson 1979, p. 90)\n\n\nThe Demonstrative Theory has three central components. First, the\nquotation marks are treated as contributing a definite description\ncontaining a demonstrative to sentences in which they occur, i.e., the\nquotation marks in (4) become ‘The expression of which this is a\ntoken’, as in (19):\n\n(4)\n‘Bachelor’ has eight letters.\n(19)\nBachelor. The expression of which that is a token has eight\nletters.\n\n\nSecond, in the logical form of a sentence containing a quotation, the\ntoken that occurs between the two quotation marks in the surface\nsyntax is displaced, so to speak, from the sentence containing the\nquotation. What occurs between the quotation marks in the surface\nsyntax is not part of the sentence in which those quotation marks\noccur. Having been displaced from its surface syntactic position, it\nserves as an object apt for demonstrative reference (An analogy: if I\nutter ‘consider the word ‘apples’.’,\n‘apples’ becomes available for demonstrative reference, as\nwhen I continue ‘It is an English word.’)\n\nThird, utterances of quotation marks, by virtue of having a\ndemonstrative/indexical ingredient, refer to the expression\ninstantiated by the demonstrated token, i.e., the expression\ninstantiated by the token that in surface syntax sits between the\nquotation marks.\n3.3.1 Strengths of the Demonstrative Theory\n\nThe Demonstrative Theory is attractive for at least five reasons.\nFirst, to grasp the function of quotation marks is to acquire a\ncapacity with infinite applications (BQ5). The Demonstrative Theory\nexplains why: there’s no limit to the kinds of entities we can\ndemonstrate. Hence, (BQ5) is explained without making quotation a\nproductive device (for elaboration see Cappelen and Lepore 1997b).\n\nSecond, opacity is explained (BQ1): There’s no reason to think\nthat two sentences demonstrating different objects will have the same\ntruth-value. (4) and (8) demonstrate different objects, so\nthere’s no more reason to think the move from (4) to (8) is\ntruth preserving than there is to think that the move from (20) to\n(21) is:\n\n(20)\nThat’s nice.\n(21)\nThat’s nice.\n\n\nThird, we have an elegant explanation of mixed quotation, i.e., we can\nexplain (BQ6). Davidson says:\n\nI said that for the demonstrative theory the quoted material was no\npart, semantically, of the quoting sentence. But this was stronger\nthan necessary or desirable. The device of pointing can be used on\nwhatever is in range of the pointer, and there is no reason why an\ninscription in active use can’t be ostended in the process of\nmentioning an expression. (Davidson 1979, p. 91)\n\n\nThis, according to Davidson, is what goes on in (12). A token that is\nbeing used for one purpose is at the same time demonstrated for\nanother: ‘Any token may serve as target for the arrows of\nquotation, so in particular a quoting sentence may after all by chance\ncontain a token with the shape needed for the purposes of\nquotation’ (Davidson 1979, pp. 90–91; cf., also, Cappelen\nand Lepore 1997b). On this view, (12) is understood as (22). (Note:\nthe ‘these’ in (22) is accompanied by a pointing or\nindexing to the token of Quine’s words.)\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’\n(22)\nQuine said, using words of which these are a token, that quotation\nhas a certain anomalous\n feature.[8]\n\n\n\nFourth, there is no mystery about how to introduce new vocabulary;\nsince there’s no limit to what can be demonstrated,\nthere’s no limit to what can be quoted. (BQ3) is explained.\n\nFinally, quantifying-in is obviously ruled out, since the quoted token\nis placed outside the quoting sentence, i.e., the Demonstrative Theory\ncan explain (BQ2).\n\nThe Demonstrative Theory is both bold and radical. It triggered an\nentire cottage industry devoted to criticizing and defending it. For\nproponents, see, for example, Partee 1973; Garcia-Carpintero 1994,\n2017, 2018; Cappelen and Lepore 1997b; McCullagh 2007; and Predelli\n2008; for critics, see just about anyone else writing on quotation\nafter 1979.\n3.3.2 Weaknesses of the Demonstrative Theory\n\nIn what follows we present five criticisms of the Demonstrative\nTheory. Needless to say, the list is not exhaustive (e.g., see\nSorensen 2008 and Saka 2011b on the problem of empty quotation), and\nindeed, each objection has triggered lively discussion which space\nlimitations prohibit our taking up here.\n\nObjection 1. If the Demonstrative Theory were\ncorrect, it should be possible for (4) to demonstrate, e.g., a\npenguin.\n\nHere is an argument that mimics a range of objections raised against\nDavidson’s account of the semantics for indirect reports (Burge\n1986, Stainton\n 1999).[9]\n\nRecall that according to Davidson the logical form of (4) is (19).\n\n(4)\n‘Bachelor’ has eight letters.\n(19)\nBachelor. The expression of which that is a token has eight\nletters.\n\n\n(19) contains a demonstrative and demonstratives refer to whatever is\ndemonstrated with their use. What is demonstrated on a given occasion\ndepends on the speaker (either the demonstration or the intention or\nsome combination of the two). It should be possible, then, for a\nspeaker to utter (4) and not demonstrate the exhibited token\nof ‘bachelor’. That is to say, if there really is a\ndemonstrative in (19), that demonstrative should have the same kind of\nfreedom that other demonstratives have: it should be able to refer to,\nfor example, a nearby penguin. Of course, no utterance of (4) makes\nreference to a penguin. So the Demonstrative Theory is\n wrong.[10]\n (For replies to this objection see Cappelen and Lepore 1999b.)\n\nObjection 2. The Problem of Relevant\nFeatures\n\nAccording to Davidson, a quotation refers to an expression indirectly,\nby referring to a token that instantiates that expression. Davidson\nthinks expressions are shapes or patterns (see\nDavidson 1979, p. 90). A problem for this view is that any one token\ninstantiates indefinitely many distinct shapes or patterns, i.e. many\ndifferent expressions. So how, on Davidson’s view, do we get\nfrom a particular token to a unique type, i.e., from a token to an\nexpression?\n\nJonathan Bennett formulates the problem as follows:\n\nAny displayed token has countless features, and so it is of countless\ndifferent kinds. Therefore, to say the inscription-types instantiated\nhere: Sheep or what amounts to the same thing, the inscription-type\neach token of which is like this: Sheep is to leave things open to an\nintolerable degree. How do we narrow it down? That is what I call the\nproblem of relevant features. It urgently confronts the demonstrative\ntheory which must be amplified so as to meet it. (Bennett 1988, p.\n403, see also Washington 1992, pp. 595–7.)\n\n\nA related worry is this: Read (4) out loud. It seems obvious that a\nspoken utterance says (makes) the same claim as a written utterance of\n(4). On the Demonstrative Theory it is unclear why this should be so:\nthe spoken utterance demonstrates a vocal pattern, and the written\nutterance a graphemic pattern. They seem to be attributing properties\nto different objects. (Several suggestions are on offer for how to\namend the Demonstrative Theory in this respect: cf., Garcia-Carpintero\n1994, Cappelen and Lepore 1997b, 1999c, and Davidson 1999.)\n\nObjection 3. The Problem of Missing Quotation\nMarks\n\nAccording to Davidson, quotation marks are what are used to do the\nreferring. They are descriptions containing demonstratives whose uses\nrefer to whatever pattern is instantiated by the demonstrated token.\nThis makes the presence of quotation marks essential. Much recent work\non quotation argues that we can quote (or do something quote-like)\nwithout quotation marks and that a theory of quotation should\nbe capable of explaining how quotation can take place in the absence\nof quotation marks. Here is Reimer’s version of this\nobjection:\n\nConsider the following sentence:\n\n(7)\nBachelor has eight letters.\n\n\nHere, we have a case in which an expression is quoted—not by\nmeans of quotation marks—but by means of italicization. But\nsurely it would be absurd to suppose (consistently with\nDavidson’s view) that the italicization of (7)’s subject\nterm is itself a demonstrative expression! (Reimer 1996, p. 135)\n\nThe same idea is expressed by Washington (1992):\n\nIn conversation, oral promptings (‘Quote-unquote’) or\nfinger-dance quotes can often be omitted without impairing the\nintelligibility or well-formedness of the utterance. When I introduce\nmyself, I do not say ‘My name is quote-unquote Corey,’ nor\ndo I make little finger gestures or even use different intonation in\norder to show that it is my name and not myself that is being talked\nabout. (Washington 1992, p. 588; Saka 1998, pp. 118–19; Recanati\n2001; and Benbaji 2004a, 2004b.)\n\n\nThe Demonstrative Theory depends on the presence of quotation marks\n(inasmuch as they are what get used to do the referring), so if\nquotation can occur without quotation marks (as in the Reimer and\nWashington cases), it’s hard to see how the Demonstrative Theory\nis adequate.\n\nProponents have been unimpressed. Consider an utterance of (6):\n\n(6)\nMy name is Donald.\n\n\nSeveral possible replies can be made by proponents of the\nDemonstrative Theory. One thing a Demonstrative Theorist might say is\nthat there are no missing quotation marks in (6): they are in the\nlogical form of the sentence, not in its surface syntax.\n\nAlternatively, quotation marks for an utterance of (6) could be\ngenerated as conversational or conventional implicatures. (He\ncan’t be saying that Donald, the person, is his name as he knows\nthat that is false, so he must be conversationally implicating that\nthe expression of which he used a token is a name (cf.\nGarcia-Carpintero 1994, pp. 262–63)). Or perhaps we could appeal\nto the distinction between semantic reference and speaker reference.\n(6) is grammatically correct but false; nonetheless, someone can\nsucceed in communicating something true about Donald’s name if\nhe succeeds in conveying to his audience his intention to refer to it\n(cf., Gomez-Torrente 2001).\n\nFinally, a Demonstrative Theorist can argue that these other\nquotation-like phenomena are just that—quotation-like. They\nrequire a separate treatment. There’s no need for a unified\ntheory (cf., Cappelen and Lepore 2003).\n\nObjection 4. The Problem of Iteration\n\nThe Demonstrative Theory seems to have difficulty dealing with\niterated quotation. (24) refers to the quotation in (23):\n\n(23)\n‘Smooth’ is an English expression.\n(24)\n“Smooth” is an English expression.\n\n\nThe Demonstrative Theory’s account for (23) is (25).\n\n(25)\nSmooth. The expression of which that is a token is an English\nexpression\n\n\nHow, then, can the account accommodate (24)? (24), after all, includes\ntwo sets of quotation marks. It might seem like the\nDemonstrative Theory would have to treat it as the ungrammatical (26)\nor the unintelligible (27).\n\n(26)\nSmooth. That that is an English expression.\n(27)\nSmooth. That. That is an English expression.\n\n\nThis objection has been raised by Saka (1998, pp. 119–20),\nReimer (1996), and Washington (1992).\n\nIn response, Demonstrative Theorists insist that quotations are not\niterative. On this topic, Cappelen and Lepore write:\n\nQuoted expressions are exhibited so that speakers can talk about the\npatterns (according to Davidson) they instantiate. The semantic\nproperties of the tokens are not in active use; they are semantically\ninert…So, quotation marks within quotation marks are\nsemantically inert. (Cappelen and Lepore 1997b, pp. 439–40)\n\n\nFor further discussion of whether quotation is a genuinely iterative\ndevice, see Cappelen and Lepore (1999a) and Saka (2013).\n\nObjection 5. The Problem of Open Quotation:\nDangling Singular Terms\n\nRecanati (2001) focuses on cases where quoted expressions do not serve\nas noun phrases in sentences. He has in mind cases like (29) and\n(30):\n\n(29)\nStop that John! ‘Nobody likes me’, ‘I am\nmiserable’…\n\nDon’t you think you exaggerate a bit?\n(30)\nThe story-teller cleared his throat and started talking.\n‘Once upon a time, there was a beautiful princess named\nArabella. She loved snakes and always had a couple of pythons around\nher…’\n\n\nIn these cases it looks like the Demonstrative Theory would have to\npostulate a dangling singular term, something like (31) or (32):\n\n(31)\nStop that John. That. Nobody likes me. That. I am miserable.\n… Don’t you think you exaggerate a bit?\n(32)\nThe story-teller cleared his throat and started talking. That.\nOnce upon a time, there was a beautiful princess named Arabella. She\nloved snakes and always had a couple of pythons around her…\n\n\n\nIn response to the idea that (29) is elliptical for (33),\n\n(33)\nStop that John! You say ‘Nobody likes me’,\n‘I am miserable’ … Don’t you think you\nexaggerate a bit?\n\n\nRecanati says:\n\nI deny that [29] and [33] are synonymous. Nor are there any grounds\nfor postulating ellipsis here except the desire to save the theory in\nthe face of obvious counterexamples (Recanati 2001, p. 654).\n\n3.4 Disquotational Theory of Quotation\n\nLess baroque than the Demonstrative Theory, the Disquotational Theory\nis probably the simplest, most natural and obvious account of\nquotation. It is endorsed by a wide range of authors, often in\npassing, as if completely obvious. A simple version of it can be found\nin Richard’s Disquotational Schema (DQR):\n\nDQR: For any expression \\(e\\), the left quote (lq) followed by e\nfollowed by the right quote (rq) denotes e (Richard 1986, p. 397)\n\nLudwig and Ray write:\n\nIts semantic function is given by the following reference clause in\nthe theory: (ref\\((\\ulcorner\\)‘E’\\(\\urcorner)\n=\\) E (Ludwig and Ray, 1998, p.163, note 43)\n\n\nwhere the ‘\\(\\ulcorner\\)’ and\n‘\\(\\urcorner\\)’ are the left and right corner quotes.\n(See also Smullyan 1957, Mates 1972, p. 21; Wallace 1972, p. 237;\nSalmon 1986, p. 6, Gomez-Torrente 2001, Botteral and Stainton 2005. A\nnearby view is the minimalism of Cappelen and Lepore 2007; discussion\nof it can be found in Garcia-Carpintero 2011.)\n\nOn this account, quotations are not proper names, or descriptions or\ndemonstratives but rather they are functors that take an expression as\ntheir argument and return it as value.\n3.4.1 Strengths of Disquotational Theory\n\nThe two most obvious strengths of the Disquotational Theory are its\nsimplicity and intuitiveness. If asked how quotation functions, the\nobvious reply is something along the lines of (DQR). It is also an\naxiom (or axiom schema) that’s pleasingly simple and requires no\ncomplicated assumptions about the surface structure of the sentence\n(in this respect, it has a clear edge on the Demonstrative\nTheory).\n\nIn addition to be being exceedingly simple and intuitive, this theory\neasily accounts for three of the Basic Facts about Quotation.\n\nFirst, it explains opacity: ‘bachelor’ and\n‘unmarried man’ have different semantic values because\nwhat is between the quotation marks are distinct expressions. An\nexpression’s semantic value is irrelevant for determining the\nsemantic value of the quotation of that expression, thus accounting\nfor (BQ1).\n\nSecond, since quotations are functor expressions without internal\nstructure, (BQ2) is explained: there’s no possibility of\nquantifying into a quotation on this view.\n\nFinally, since quotations, as functors, map all expressions onto\nthemselves, this account can explain the special relationship between\na quotation and the quoted expression—namely,\nidentity—thus explaining (BQ4).\n3.4.2 Weaknesses of the Disquotational Theory\n\nEven with these advantages, at least three serious difficulties\nconfront the Disquotational Theory. First, (BQ3) says that we can\nuse quotation to refer to symbols that are not in the English lexicon,\nas in (9) and (10):\n\n\n(9)\n‘\\(\\Phi\\)’ is not a part of any English expression.\n(10)\n‘❦’ is not an expression in any language.\n\n\n(DQR) says we can take any expression e, put quotation marks\naround e, and what results is an expression that refers to e. What\nexactly is meant by ‘any expression’ in (DQR)? Richard\noffers the following answer:\n\nIt is easy enough to come up with a finite list of\nelements (the letters, punctuation symbols, the digits, the space,\netc.) and an operation (concatenation) with which one can generate all\nof the concatenates…If we are formalizing a grammar for a\nlanguage with quotation names, we would include, as part of the\nspecification of the lexicon, a proviso to the effect that, for each\nconcatenate e, the left quote (lq), followed by e, followed by the\nright quote (rq) is a singular term (Richard 1986, pp. 386–89,\nour emphasis).\n\n\nIf this is how expressions are generated, how then are we to account\nfor the truth of (9) and (10)? More generally, the worry is this:\n(DQR) needs to specify, in some manner or other, the domain of\nexpressions over which it quantifies. How can it do this without\nunreasonably limiting the kinds of symbols that can be\n quoted?[11]\n (See Lepore (1999) for elaboration on this point.)\n\nSecond, according to (BQ6), a theory of quotation should leave room\nfor dual use and mention. It is hard to see how (DQR) leaves such\nroom. If quotes are referring expressions (as they are according to\nDQR), then if we let ‘Ted’ name the expression ‘has\na certain anomalous feature’, (12) should say the same as,\nexpress the same proposition as, (17).\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’.\n(17)\nQuine said that quotation Ted.\n\n\nNot only should (12) and (17) express the same proposition, according\nto DQR, they should also have the same logical form. That’s an\nobviously incorrect account of (12). (For further discussion of mixed\nquotation see\n Section 4\n below.)\n\nFinally, those who raise Objection 4 against the Demonstrative Theory\nwould probably raise the same objection here: the Disquotational\nTheory fails to account for quotation without quotation marks. All the\nwork is being done by quotation marks, so there’s no room for\nquotation without quotation marks. (DQR) proponents would presumably\nbe as unimpressed as Demonstrative Theorists and their replies would\nbe much the same (see above).\n3.5 The Identity Theory of Quotation (or, better: the Use-Theory of Quotation)\n\nThe label ‘the Identity Theory of Quotation’ was first\nused, as far as we know, by Washington (1992), though he attributes\nthe view to Frege (1892) and Searle (1969). However, the passages in\nwhich this view was allegedly offered prior to Washington hardly count\nas presenting a theory; they read more like dogmatic pronouncements\ndevoid of argumentation. Since Washington’s paper was published\nrelated views have been developed in more detail by Saka (1998, 2004,\n2011a), Reimer (1996), Recanati (2000, 2001) and others.\n\nWashington’s presentation of the Identity Theory is somewhat\ncompressed—the key passage is this:\n\nThe quotation as a whole is analyzed into the marks that signify\nquotational use of the quoted expression and the quoted expression\nitself used to mention an object. All expressions, even those whose\nstandard uses are not as mentioning expressions, become mentioning\nexpressions in quotation…a quoted expression is related to its\nvalue by identity: a quoted expression mentions itself. (Washington\n1992, p. 557)\n\n\nThere are three important components of this\n view:[12],\n[13]\n\nThe use of quotation marks (as in (4)) is a derivative\nphenomenon. The basic phenomenon is what Washington calls\nquotational use (Washington 1992, p. 557).\nThe primary function of quotation marks is to indicate that words\nare used quotationally (or mentioned) and not (merely) used with their\nregular extensions.\nQuotation marks do not refer according to Washington;\nthat which is doing the referring in the quotation is the expression\nitself, so in (2), for example, it is ‘Aristotle’, not\n“Aristotle” that refers to ‘Aristotle’, i.e.,\n‘Aristotle’ refers to itself. It refers to itself because\nit is being used quotationally (not with its regular extension.)\n\n\nOne way to get a handle on this kind of view is to consider a spoken\nutterance of (6)\n\n(6)\nMy name is Donald.\n\n\nAccording to the Use/Identity theory, (6), when spoken, is grammatical\n(Washington 1992, pp. 588–90). There are no missing (or\nimplicit) quotation marks. When uttered by a person whose name is\n‘Donald’ it is true (if ‘Donald’ is used\nquotationally). The function of quotation marks in written language is\nsimply to indicate that words are being used in this special,\nquotational, way, i.e. not (only) with their regular extensions. In\nother words, ‘Donald’ can be used in two different ways:\nwith its usual semantic value (its regular referent) or quotationally.\nIn the latter case, its semantic value is an expression.\n\nWe wish that the Identity Theory were not called ‘the Identity\nTheory’. (In private communication, Washington has expressed the\nsame sentiment.) The ‘identity’ component is picked up\nfrom the formulation, ‘a quoted expression is related to its\nvalue by identity: a quoted expression mentions itself’. This\nformulation, however, is deeply misleading, since according to both\nWashington (and later, for example, Saka (1998)), quotations are\nambiguous. They can, according to Washington, refer to types, tokens,\nor shapes (see Washington 1992, p. 594) and according to another\nproponent of this kind of view, Saka, they are even more flexible\n(Saka 1998, see further presentation of Saka’s view below). A\nbetter label would be ‘the Use-Theory of Quotation’, since\nthis emphasizes the point that a proper understanding of quotation\nrequires appealing to a special way of using language. In what\nfollows, we use the ungainly compromise ‘the Use/Identity\nTheory’.\n\nIt is useful to contrast Washington’s account with the\nDisquotational Theory. Recall, that, according to DQR, quotation\nmarks have a semantic function and that function is spelled out\nin the disquotational schema (DQR). (DQR) is a semantic axiom. It\ntreats quotation marks as identity functions. Speakers’\nintentions figure not at all in this axiom (other than the intention\nto speak English). There is no need, on the Disquotational Theory, to\nappeal to a special kind of quotational usage. For Washington, the\nquotation marks have no genuine semantic function. They are no more\nthan a heuristic device for indicating that expressions are used in a\nspecial way, i.e. quotationally.\n3.5.1 Other Versions of the Use/Identity Theory: Reimer, Recanati, Saka, and the Picture Theory\n\nSeveral recent views share important components of Washington’s.\nReimer (2003) combines versions of the Demonstrative Theory and the\nIdentity Theory. Recanati (2000, 2001, 2010) doesn’t explicitly\ndiscuss any version of the Identity Theory, but his theory\nincorporates some of its components; it is distinctive by focusing on\nwhat he calls ‘Open Quotation’ (see Objection 5 to the\nDemonstrative Theory above) and the iconic aspects of\nquotation (see Recanati 2001 for elaboration). Two theories might be\nworth a closer look for those interested in exploring Use/Identity\nTheories further (the second of these is mostly of historical\ninterest).\n\nFirst, Saka (1998, 1999, 2003) has developed a theory that has much in\ncommon with Washington’s (though it also differs in important\nrespects). He agrees with Washington in emphasizing ‘quotational\nuse’ (Saka calls it ‘mentioning’), but Saka has more\nto say about mentioning than Washington has to say about quotational\nuse (see Saka 1998 and 2003). Saka also goes further than Washington\nin claiming that quotation marks are not required for mentioning even\nin written language. (For Washington, it is only in spoken language\nthat we can quote without quotation marks). According to Saka, (34)\n‘is a grammatical and true sentence’ (Saka 1998,\np.118.)\n\n(34)\nCats is a noun.\n\n\nEven though Saka agrees with Washington that quotation marks\n‘announce ‘I am not (merely) using expression X;\nI am also mentioning it’’ (Saka 1998, p. 127), he differs\nfrom Washington in that he assigns them a genuine syntactic and\nsemantic function (Saka, 1998, p. 128). In this respect he\nincorporates components of what we above called the Disquotational\n Theory.[14],\n[15]\n\nSaka’s account also differs from Washington’s in that he\nemphasizes that quotations are ambiguous (or indeterminate) and that\nwhat they refer to depends on the speaker’s intentions (see Saka\n1998, pp. 123–4). For further discussion of this point, see\n Section 5\n below.\n\nSecond, there is one view we have not discussed and which might\n(admittedly with some difficulty) be squeezed into the category of the\nUse/Identity Theory. Quine said a number of things about quotation; in\none passage he writes:\n\n…a quotation is not a description but a hieroglyph; it\ndesignates its object not by describing it in terms of other objects,\nbut by picturing it. (Quine 1940, p. 26)\n\n\nDavidson (1979), taking his cue from this passage and others, baptized\nthe view intimated in Quine’s passage as ‘the Picture\nTheory of Quotation’ (cf., also, Christensen 1967, p. 362). As\nDavidson notes, on this view:\n\n…it is not the entire quotation, that is, expression named plus\nquotation marks, that refers to the expression, but rather the\nexpression itself. The role of the quotation marks is to indicate how\nwe are to take the expression within: the quotation marks constitute a\nlinguistic environment within which expressions do something\nspecial… (Davidson 1979, pp. 83–84)\n\n\nNotice that according to Davidson’s description of this view,\nthe quotation marks per se have no semantic function; rather,\nthey indicate that the words are being used in a special way. They are\nbeing used ‘autonymously’, that is, to name themselves. So\nunderstood, the Picture Theory has at least this much in common with a\nUse/Identity Theory: they agree that quotation marks are inessential;\nthey only indicate a special use. They indicate that expressions are\nbeing used as a picture (or as a hieroglyph). The Picture\nTheory—if it’s even appropriate to call it a\ntheory—is never elaborated in any great detail and we suspect\nthat if it were, it would become obvious that it is a version of the\nUse/Identity Theory.\n3.5.2 Strengths of the Use/Identity Theory\n\nUse/Identity Theorists claim that their theories are explanatorily\nmore powerful than traditional semantic theories. By seeing quotation\nmarks as a parasitic phenomenon, they are able to explain the\nsemantics of both quotation and this more general phenomenon in a\nunified way.\n\nThere’s a great deal of specific data that these theories claim\nto be able to explain. The most important of these is the possibility\nof mentioning without quotation marks (as in spoken language and in\nwritten language when no quotation marks are used). If we take\nappearances at face value, that means meta-linguistic discourse (call\nit mentioning or quotational use) can take place in the absence of\nquotation marks. Hence, an account of meta-linguistic discourse must\nproceed independently of an account of the semantics (or pragmatics)\nfor quotation marks.\n\nThe following are additional claims made on behalf of the Use/Identity\nTheory (we take it to be an open question at this point whether these\npoints are sustainable):\n\nWhatever can be mentioned can be quoted. If new symbols and signs\ncan be mentioned, then they can also be quoted; hence, (BQ3) is\nsatisfied.\nThere is, on this view, often a particularly close relationship\nbetween the quoted material and the referent; sometimes it is\nidentity, sometimes it is instantiation, etc, so in various ways we\nmight say that (BQ4) is satisfied.\nIf our capacity for mentioning is limitless, then we have an\naccount of how quotation can be too (i.e., we have at least the\nbeginning of an account of (BQ1)).\n\n3.5.3 Weaknesses of the Use/Identity Theory\n\nDiscussion of the Use/Identity Theories is not yet as extensive as\ndiscussion of the Demonstrative Theory, so there are fewer objections\nto report. We discuss four concerns that have surfaced in various\ndiscussions.\n\nQuestion about the Relevance of Quotational Use/Mention:\nUse/Identity Theories put a great deal of weight on the idea that the\nsemantics for quotation cannot be developed without an account of\nquotational usage (mention in Saka’s\nterminology.) There are several reasons for doubting this, two of\nwhich are these:\n\nIt is not obvious that the alleged phenomenon of mention without\nquotation marks is genuine. It might very well be, as mentioned in\nconnection with Objection 3 to the Demonstrative Theory, that it is\nnot possible to mention without using quotation marks. The cases\nappealed to might all turn out to be cases in which a conversational\nor conventional implicature is generated and where that implicature\ncontains quotation marks. Alternatively, the quotation marks might\nactually be in the logical form of the sentence through some form of\nellipsis. (See Garcia-Carpintero 1994 and Cappelen and Lepore\n1999).\nEven if we suppose that the phenomenon of mentioning without\nquotation marks is genuine, it is not clear why we should consider it\nrelevant to the semantics for quotation. Suppose that you’re in\nthe business of trying to develop a semantic theory of sentences with\nquotation marks. Suppose it also turns out that it is possible to talk\nabout language by mentioning without the use of quotation marks. This\nmight just be a different way of talking about language. An\ninteresting phenomenon, no doubt, but not one that needs to have\nanything to do with the semantics for sentences containing quotation\nmarks. It does not follow from there being a variety of ways in which\nlanguage can be used to talk about language, that all of these ways\nare relevant to the semantics of quotation.\n\n\nQuestion about the Semantics-Pragmatics Divide: On the\nUse/Identity Theory, a lot of work is done by pragmatic mechanisms.\nThe appeal to speaker intentions plays a central role on all levels of\nanalysis. On Saka’s view, for example, what a quoted expression\nrefers to is largely up to the speaker’s intentions (and, maybe,\nwhat’s salient in the context of utterance). A consequence of\nthis view is that there is no guarantee, for example, that an\nutterance of (35) or (36) will be true:\n\n(35)\n‘\\(a\\)’ = ‘\\(a\\)’\n(36)\n‘run’ is a verb in English\n\n\nThe two ‘\\(a\\)’s in (35) could refer to different\nobjects; the “run” in (36) might refer to, for example, a\nconcept (see Cappelen and Lepore 1999b and Saka 1999, 2003, 2011).\n\nOver-generation Problems: According to Use/Identity Theories,\nyou can do a lot with quotation. The question is whether this results\nin such theories running into problems of over-generation. Take, for\nexample, Saka’s claim that a quotation refers to an item\nassociated with the expression. There’s only one\nrestriction: This item cannot be the expression’s regular\nextension. If this is the sole restriction on what quotations\ncan be used to refer to, we should be able to do things with quotation\nthat there’s no evidence that we can. It could, for example, be\nthe case that in a particular context, the (regular) extension of\n‘love’, call it love, was associated with the\nexpression ‘money’; maybe, for some reason, that\nassociation was contextually salient. Nonetheless, (37) cannot be used\nto say that love plays a central role in many peoples’\nlives.\n\n(37)\n‘Money’ plays a central role in many peoples’\nlives.\n\n\nUse/Identity Theories have to explain what blocks such readings (or\nshow that they are possible). (See Saka 2003, and Cappelen and Lepore\n2003.)\n\nDual Use-Mention (BQ6): Washington says that quotation marks\nindicate quotational usage and that expressions used quotationally\nrefer to themselves (or some related entity). If so, the logical form\nof (12) should be that of (17), clearly not a correct result.\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’.\n(17)\nQuine said that quotation\n Ted.[16]\n\n\n\nIt is at least a challenge to Identity/Use theorists to explain how\nthe theory can accommodate simultaneous use and mention.\n\nIn addition to the above points, there’s a lively debate about\nthe specifics of identity/use theories. For discussions of Saka, see\nCappelen and Lepore (2003), Reimer (2003), and for discussions of\nRecanati, see Cappelen and Lepore (2003), Reimer (2003), Benbaji\n(2003, 2004a, 2004b), and Cumming (2003).\n\nWe now turn from discussions of large-scale theories of quotation to\ndiscussions of how to understand specific aspects of our quotational\npractice. Two issues have been particularly important in the recent\ndiscussions: Mixed Quotation and the alleged ambiguity of quotations.\nOne’s view of these issues has wide reaching implications for\nwhich theory of quotation one favors. We discuss these in turn.\n4. Mixed Quotation\n\nFrom around the millennium, beginning with Cappelen and Lepore’s\n1997a, which made the topic mainstream, mixed quotation has been,\narguably, the area in which theorizing about quotation has advanced\nthe most. The problem has attracted the attention of both philosophers\nand linguists, and our understanding of both the data to be accounted\nfor, and the various possibilities for doing so, has been greatly\nimproved.\n\nIt’s important to reiterate our above note that here as\nelsewhere in the theory of quotation what comprises the phenomenon is\nup for debate; different theorists emphasise or play down different\nbits of data. What follows, accordingly, doesn’t represent a\nconsensus position on the problem, simply because there isn’t\none (indeed, somewhat unfortunately, there isn’t even consensus\nabout the terminology, some calling it ‘hybrid’ or\n‘impure’, and some subsuming mixed quotation under\n‘scare quoting’; De Brabanter 2010 is helpful here, as\nwell as being a useful survey of the field from a linguist’s\npoint of view). We will simply present some of the more interesting\nand central data points and problems for a theory of mixed quotation\n(for the theories themselves, we refer the reader to Maier’s\n(2020) overview article which presents some of the main formal\nsemantic theories out there. For recent theories by philosophers on\nmixed quotation, see Gomez-Torrente 2005, Kirk and Ludwig 2017,\nMcCullagh 2007, 2017. The main linguists to consult are cited in this\nsection.)\n\nThe paradigm example of mixed quotation is the following,\nrepeated:\n\n(12)\nQuine said that quotation ‘has a certain anomalous\nfeature’.\n\n\nIt is mostly agreed that this sentence puts forward the following\nclaim: Quine said (expressed the proposition or content) that\nquotation has an anomalous feature, and did so by uttering the\nexpression ‘has an anomalous feature’. This suggests two\ninitial requirements:\n\nAn adequate theory of mixed quotation must account for the fact\nthat the quoted material is used by the reporter to characterise the\nproposition that the reportee expressed.\nIt must also account for the fact that the quoted material was\nuttered by the reportee.\n\n\nLet’s call these the use requirement and the\nmention requirement, respectively.\n\nWhile these both seem clearly on the right lines (if you doubt this,\nopen or scroll to a newspaper and read until you find the first mixed\nquotation (it shouldn’t take long) and see if the requirements\nare operative) there are problems with both of them. It might\ninitially seem that the mention requirement requires that the reportee\nhave uttered verbatim the words ascribed to him or her. That would\naccount for the anomalousness of:\n\n(38)\n# Quine said quotation ‘has a certain anomalous\nfeature’, although he didn’t use the words ‘has a\ncertain anomalous feature’.\n\n\nThings aren’t so clear, though. Certain other pieces of data are\nin tension with this purported feature of the mention requirement,\nmost notably that one can mixed quote someone correctly in a language\nother than the one they spoke (Cappelen and Lepore 2007 p. 44). Thus\nthe following, as well as its parenthesised continuation, is fine:\n\n(39)\nKant said that concepts without intuition ‘are empty’,\n(although he didn’t use those words: he said ‘sind\nleer’).\n\n\nMoreover, more subtle problems for the use requirement come from\ninflected languages (Shan 2010, Maier 2014a). Thus in Italian, nouns\nmust agree in gender and number with adjectives. Imagine Ken says:\n\n(40)\nGli uomini italiani mi sembrano molto carini.\n\n\nThis means ‘I find Italian men very cute’, and since the\nnoun ‘uomini’ (men) is m.pl, so is the adjective\n‘carini’ (cute). But if one wanted to mixed quote Ken,\nusing a different word than ‘uomini’, that different word\nwould have to agree:\n\n(41)\nKen ha detto che le persone italiane ‘mi sembrano molto\ncarine’\n\n\nSo the mixed quoted material used to report Ken’s utterance is\nnot what he said verbatim: he said ‘carini’ and he is\nreported as saying ‘carine’ (the example is from Shan\n2010). Maier presents similar cases for Dutch. Yet a third problem\ncomes from the fact that one can ‘clean up’ quotations, by\nremoving grammatical slurs, umms and ahhs, and so on (see Cappelen and\nLepore 2007 p. 45).\n\nWhat exactly the mention requirement requires is uncertain, then. But\nnor, however, is the use requirement without its problems. There are\nat least two, which again differ in subtlety. From the beginning,\nit’s been realised that indexicals in mixed quotations cause\nintriguing problems. Consider:\n\n(42)\nMr. Greenspan said he agreed with Labor Secretary R. B. Reich\n‘on quite a lot of things’. Their accord on this issue, he\nsaid, has proved ‘quite a surprise to both of us’.\n(Cappelen and Lepore 1997b, p. 429)\n\n\nIf the second mixed quotation were simply being used, then the second\nsentence should be true provided accord was a surprise to the people\nwriting the report, not to Greenspan and Reich. That’s clearly\nthe wrong result, and shows that the use requirement needs some\nmodifiction (for discussion about indexicals in mixed quotation, and\nwhether they call for Kaplanian monstrous operators, see also Recanati\n(2001), Cumming (2003), Geurts and Maier (2003), and Maier\n(2016)).\n\nThe behaviour of indexicals in mixed quotation is important, because\nit gives strong evidence against the possibility that mixed quotation\nis a pragmatic phenomenon. A typical pragmatic analysis would say that\nthe semantic contribution of the quoted material in a mixed quotation\nis just its unquoted semantic value (so that the literal semantic\ncontent of (12) is simply ‘Quine said that quotation has a\ncertain anomalous feature’), but that to utter a mixed quotation\nis to imply, but not to say, that the quoted material was used by the\nspeaker to say what they said.\n\nThe advantages of a pragmatic analysis of mixed quotation are those\ntypical of pragmatic analyses in general: no extra semantic machinery\nis required to account for the problem cases. As such, versions of\nsuch an analysis have had many adherents at the end of the twentieth\ncentury (see, for example, Recanati (2001), Clark & Gerrig (1990),\nWilson (2000), Sperber & Wilson (1981), Tsohatzidis (1998),\nStaintion (1999), Saka (2003) and the discussion in by Reimer\n(2003)).\n\nHowever, the behaviour of indexicals in mixed quotation make the\npragmatic analysis harder to uphold. One needs to say that (42) is\nliterally false, and while that is a move that can be made, it’s\nnot particularly attractive. Accordingly, the pragmatic analysis has\ngone somewhat out of fashion, and has been argued against explicitly\nexplicitly by Gomez-Torrente (2017), and implicitly by most of the\nlinguists working in the field, for whom the behaviour of indexicals\nis a key explanandum of a theory of mixed quotation, and not something\nto be explained away (although see De Brabanter 2019 for a\npragmatic theory of indexicals in mixed quotation).\n\nThe second, more subtle, problem is a consequence of the fact that one\ncan mixed quote an expression belonging to a dialect other than the\none one speaks, or even to no dialect at all (Shan 2010). Thus even in\ninformal British English, ‘accident’ always takes the\npreposition ‘by’ and never ‘on’. A British\nspeaker can draw attention to this fact, by uttering, about an\nAmerican friend of theirs:\n\n(43)\nMeagan said she took out the trash ‘on accident’.\n\n\nBut a British speaker can’t felicitiously use ‘on\naccident’ because that’s not a part of British English\nspeakers’ dialect. Similarly, ‘misunderestimated’\nisn’t a word in most anybody’s dialects, but we can\nsay:\n\n(44)\nBush said that his opponents ‘misunderestimated’\nhim.\n\n\nA different, more fundamental, source of complication arises from the\nfact that it’s unclear exactly how much to include under mixed\nquotation. Thus consider:\n\n(45)\nQuine wrote a couple of papers on quotation, the ‘anomalous\nfeature’ of which he thought about a lot.\n(46)\nA: The Godfather II is a total snooze.\n\nB: Well, Pauline Kael said this ‘total snooze’ is a\ndefining moment in American cinema. (Potts 2007, p 420)\n\n\nShould we include such phenomena in our theory of mixed quotation? The\nfirst sentence doesn’t contain a speech verb, while the second\ndoes, but the person to whom the mixed quotation is attributed\nisn’t the person who uttered the mixed quoted words. It’s\nunclear. Things get even more uncertain when we consider scare quotes\n(Predelli 2003a,b, Saka 2013, Gomez-Torrente 2017) and what are known\neuphemistically as grocers’ quotes:\n\n(47)\nTeens are spending more and more time ‘sexting’,\nsomething of concern to parents and even technology companies.\n(48)\n[written on a desiccate in a new pair of shoes] Do not\n‘eat’!\n\n\nIn the former case, there isn’t any one person who used\n‘sexting’; rather, the writer is marking that it’s\nused in a community which they are not part of or disapprove of. In\nthe latter case, the quotation marks are serving as emphasis. While we\nprobably don’t want to spend a lot of time seriously theorizing\nabout grocers’ quotes (although see Abbott 2003), whether or not\nscare quotes should be treated as we treat mixed quotation (indeed,\nwhether or not they’re one and the same) is an open question\n(see McCullagh 2017 for discussion and an affirmative answer to these\nquestions; Gomez-Torrente 2017 demurs).\n\nThis isn’t even an exhaustive characterization. Thus it’s\nimportant to attend to cognate phenomena like dequotation (Shan 2010)\nand free indirect discourse (Maier 2015, 2017). And the theorist of\nmixed quotation should at least be aware of the problem of mixed\nquoting non-constituent clauses (Abbott 2003, De Brabanter 2022), and\nthe possibility that one can mixed quote without quotation marks (De\nBrabanter 2010). The complexity of the data has inspired much\ninteresting theorizing, and we expect that mixed quotation will\ncontinue to be a focal question in the theory of quotation.\n5. What Kinds of Entities do Quotations Refer to?\n\nRunning parallel to the debate about how quotations refer\n(how they manage to hook up with their semantic values) is a debate\nabout what quotations refer to. One view that is widespread\nis that quotations are ambiguous or indeterminate. That is, one and\nthe same quotation, e.g. “lobster” can, on this view,\nrefer to different objects on different occasions of use, all\ndepending on the context of utterance. Garcia-Carpintero (1994, p.\n261) illustrates this kind of view and the kind of argument typically\ngiven for it. He says that “gone” can refer to any of the\nfollowing:\n\nThe expression (‘ ‘gone’ is\ndissyllabic’);\nDifferent types instantiated by the tokens\n(‘ ‘gone’ is cursive’);\nDifferent types somehow related to the token (say, the graphic\nversion of the uttered quoted material, or the spoken version of the\ninscribed quoted material, as in ‘ ‘gone’\nsounds nice’);\nDifferent tokens somehow related to the quoted token (‘What\nwas the part of the title of the movie which, by falling down, caused\nthe killing?—‘gone’ was’);\nThe quoted token itself (‘At least one of these words is\nheavier than ‘gone’ which you should imagine written in\nbig wooden letters’);\n\n\nOthers think quotation can pick out contents or concepts. Goldstein\nsays:\n\nFor when Elvis says ‘Baby, don’t say\n‘don’t’,’ he is not just requiring his baby to\nrefrain, when confronted with a certain request, from uttering tokens\nof the same phonetic shape as ‘don’t’, but from\nuttering any tokens that mean the same. (Goldstein 1984, p.\n4)\n\n\nSaka (1998, p. 124) concurs and claims that “premise” and\n“premiss” in (38) pick out concepts:\n\n(38)\nThe concept ‘premise’ is the same as the concept\n‘premiss’.\n\n\nTsohatzidis (1998) claims that since T1 is true, even though Descartes\ndidn’t speak English, “is a thinking substance” in\nT1 can’t refer to an English expression.\n\n(T1) In one of the greatest philosophy books ever written in Latin,\nDescartes said that man ‘is a thinking substance’.\n\nThese arguments all take the same form: first, they identify a\nsentence \\(S\\) that we are inclined to interpret as true and\nsuggest that the only way to understand how \\(S\\) can be true is\nto assume that quotations can refer to some kind of object \\(O\\).\nThis is then alleged to be evidence that quotations can be used to\nrefer to objects of kind \\(O\\).\n\nIf quotation has this kind of flexibility, the five theories discussed\nabove will all have to be evaluated with respect to whether they can\naccommodate it. The Proper Name Theory, Description theory, and\nDisquotational Theory, all seem to have particular difficulties in\nthis respect.\n\nNot all, however, are convinced that quotations are flexible in just\nthis way. Some have expressed skepticism both about the form of\nargument (see Cappelen and Lepore 1999a) and about the specific\nexamples. Cappelen and Lepore (1999a) also argue that the multiple\nambiguity view over-generates, i.e., it predicts that it is possible\nto express propositions with quotation sentences that it is not\npossible to express with such sentences. For further discussion, see\nalso Saka (2003).\n6. Alternative Quotational Devices\n\nA number of authors over the years have thought that our standard\npractices of quotation are not suitable for all purposes and have, in\neffect, introduced new technical devices. They cannot all be\nsummarized here, but here is a brief sketch of some such devices.\n6.1 Token Quotes\n\nReichenbach (1947, p. 284) writes: ‘Whereas the ordinary-quotes\noperation leads from a word to the name of that word, the token-quotes\noperation leads from a token to a token denoted by that token’.\nReichenbach uses little arrows (\\(\\tokenquote{\\,}\\)) for token quotes,\nso that the sign (39):\n\n(39)\n\\(\\tokenquote{a}\\)\n\n\nrepresents not a name for the token of ‘a’, but a token\nfor it. That is, the token in (39) cannot be repeated. (40), for\nexample, is not only a token different from (39) but refers to a\ndifferent token (Reichenbach 1947, pp. 285–86).\n\n(40)\n\\(\\tokenquote{a}\\)\n\n\nToken quotes then are much like writing a demonstrative expression\nlike ‘this’ and fastening to it an object to produce a\nsymbol of that object. (As noted above, some authors (Bennett 1988,\nSaka 1998, Washington 1992) opine that this is how ordinary quotation\nsometimes functions.)\n6.2 Corner (Quasi) Quotation\n\nAs Quine (1940, §6) notes, the quotation:\n\n‘\\((\\mu)\\)’\n\n\ndesignates only the specific expression therein depicted, containing a\nspecific Greek letter. In order to effect reference to the unspecified\nexpression he introduces a new notation of corners (namely,\n‘\\(\\ulcorner\\)’ and\n‘\\(\\urcorner\\)’). So, for example, if we take the\nexpression ‘Quine’ as \\(\\mu\\), then\n\\(\\ulcorner(\\mu)\\urcorner\\) is ‘(Quine)’.\nThe quasi-quotation is synonymous with the following verbal\ndescription: The result of writing ‘(’ and then \\(\\mu\\) and\n‘)’ (Quine 1940, p. 36). For an interesting suggestion\nabout quasi-quotation in natural language, see Saka (2017).\n6.3 Dot Quotes\n\nSomeone who uses the word ‘red’ in speaking or thinking\nwould generally be held to be employing the same concept as a French\nperson who uses ‘rouge’. Assuming that ‘rouge’\nis a good translation of ‘red’, Sellars (1963) thought it\nconvenient to have a general term by which to classify words that are\nfunctional counterparts in this way. Such a term is provided by\nSellars’ dot quotes. Dot-quotes form a common noun true of items\nin any language that play the role performed in our language by the\ntokens exhibited between them, so any expression that is a functional\ncounterpart to ‘red’ can be described as a\n·red·. In Sellars’ terminology,\nthe concept red is something that is common and peculiar to\n·red·s.\n6.4 Unambiguous Quotes\n\nConsider (41):\n\n(41)\n‘a’ concatenated with ‘b’ is an\nexpression.\n\n\nMichael Ernst claims this sentence is ambiguous. Read one way, (41)\nmeans that the concatenation of the first letter of the Roman alphabet\nwith the second letter is an expression; read another way it means\nthat the expression between the two outer quote marks is an\nexpression. Confronted with this ambiguity, Boolos (1995) introduced a\nnotation for quotation in which every quotation mark ‘knows its\nmate’. So understood there are denumerably many distinct\nquotation marks, each formed by prefixing a natural number n of\nstrokes to a small circle, and in order to meaningfully enclose an\nexpression with Boolos quotation marks we have to choose quotation\nmarks of a ‘higher order’ than the quotation marks that\noccur in the expression to be quoted (if there are any) and each\nquotation mark in a grammatical sentence is to be ‘paired’\nwith the next identical quotation mark (Boolos 1995, p. 291).\nAccordingly, reading (41) as containing Boolos quotation marks, we get\nthe more natural reading according to which it says that the first\nletter of the Roman alphabet concatenated with the second is an\nexpression.\n7. Formal-Material Modes\n\nCarnap introduced in Logical Syntax of Language (1937) a\ndistinction between formal and material modes. The material mode is\ngenerally used to describe the non-linguistic world; the formal mode\nis generally used to discuss the language that is used to describe the\nmaterial world. Thus ‘one is a number’ is a sentence in\nmaterial mode; and ‘‘one’ is a number word’ is\nits sentential counterpart in formal mode. This distinction is\nmentioned in passing here since some authors have thought it\ncorresponds to the use/mention distinction. Since the use/mention\ndistinction isn’t particularly about quotation, there\nisn’t much that needs to be said about the material/formal mode\nhere either. Revealing that a statement is basically about the use of\nlanguage may succeed in removing some of its metaphysical mystery. And\nit may even be that semantic ascent (that is, the device of making a\nsentence the topic, instead of what the sentence purports to refer to)\nsucceeds in demystifying much of what goes on in certain quarters of\nphilosophy. But as we’ve said, this distinction, and the various\nphilosophical moves surrounding it, doesn’t have much to do with\nquotation per se.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Abbott, Barbara, 2003. ‘Some Notes on Quotation’,\n<em>Belgian Journal of Linguistics</em>, 17(1): 13–26.",
                "Bazzoni, André, 2016. ‘Pure quotation, metalanguage\nand metasemantics’, <em>Linguistics and Philosophy</em>, 39(2):\n119–149.",
                "Benbaji, Yitzhak, 2003. ‘Who needs semantics of quotation\nmarks?’ <em>Belgian Journal of Linguistics</em>, 17:\n27–49.",
                "–––, 2004a. ‘A demonstrative analysis of\n“open quotation”‘. <em>Mind and Language</em>, 19:\n534–547.",
                "–––, 2004b. ‘Using others’\nwords’, <em>Journal of Philosophical Research</em>, 29:\n93–112.",
                "Bennett, Jonathan, 1988. ‘Quotation’,\n<em>Noûs</em>, 22: 399–418.",
                "Boolos, George, 1995. ‘Quotational ambiguity’, in\n<em>On Quine</em>, P. Leonardi and M. Santambrogio (eds.), Cambridge:\nCambridge University Press, pp. 283–296.",
                "Botterell, Andrew and Stainton, Robert, 2005. ‘Quotation:\nCompositionality and Innocence without Demonstration’,\n<em>Critica: Revista Hispanoamericana de Filosofia</em>, 37(110):\n3–33.",
                "Burge, Tyler, 1986. ‘On Davidson’s ‘Saying\nthat’’, in <em>Truth and Interpretation</em>, Basil E.\nLepore (ed.), Oxford: Blackwell, pp. 190–208.",
                "Cappelen, Herman, 1997. <em>Signs</em>, Doctoral Dissertation,\nPhilosophy Department, University of California-Berkeley.",
                "Cappelen, Herman and Ernest Lepore, 1997a. ‘On an alleged\nconnection between semantic theory and indirect quotation’,\n<em>Mind and Language</em>, 12: 278–296.",
                "–––, 1997b. ‘Varieties of\nquotation’, <em>Mind</em>, 106: 429–50.",
                "–––, 1998. ‘Using, mentioning, and\nquoting: reply to Tsohatzidis’, <em>Mind</em>, 107:\n665–666.",
                "–––, 1999a. ‘Reply to Saka’,\n<em>Mind</em>, 108: 741–50.",
                "–––, 1999b. ‘Reply to Stainton’, in\nKumiko and Robert, pp. 279–283.",
                "–––, 1999c. ‘Reply to Pietroski’, in\nKumiko and Robert, pp. 283–285.",
                "–––, 1999d. ‘Semantics of\nquotation’, in Zeglen, pp. 90–99.",
                "–––, 2003. ‘Varieties of quotation\nrevisited’, <em>Belgian Journal of Linguistics</em>, 17:\n51–75.",
                "–––, 2004. <em>Insensitive Semantics</em>,\nOxford: Basil Blackwell Publishers.",
                "–––, 2007. <em>Language Turned On Itself</em>,\nOxford: Oxford University Press.",
                "Carnap, Rudolf, 1937. <em>Logical Syntax of Language</em>, London:\nRoutledge and Kegan Paul.",
                "–––, 1947. <em>Meaning and Necessity</em>,\nChicago: University of Chicago Press.",
                "Christensen, Niels, 1967. ‘The alleged distinction between\nuse and mention’, <em>Philosophical Review</em>, 76:\n358–67.",
                "Clark, Herbert &amp; Richard Gerrig, 1990. ‘Quotations as\ndemonstrations’, <em>Language</em>, 66(4): 764–805.",
                "Cumming, Sam, 2003. ‘Two accounts of indexicals in mixed\nquotation’, <em>Belgian Journal of Linguistics</em>, 17:\n77–88.",
                "De Brabanter, Philippe, 2010. ‘The semantics and pragmatics\nof hybrid quotations’, <em>Language and Linguistics\nCompass</em>, 4(2): 107–120.",
                "–––, 2019. ‘The Interpretation of\nIndexicals in Hybrid Quotation: A Pragmatic Account’,\n<em>Anglophonia: French Journal Of English Linguistics</em>, 28.\ndoi:10.4000/anglophonia.2646.",
                "–––, 2022. ‘Accounting for\nnon-constituents in hybrid quotations. Why unquotation is not the\nanswer’, <em>Journal of Linguistics</em>, 59(1): 1–22.\ndoi:10.1017/S0022226722000184",
                "Elugardo, Reinaldo, 1999. ‘Mixed quotation’, in\nMurasugi &amp; Stainton.",
                "Davidson, Davidson, 1968. ‘On saying that’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp. 93–108.",
                "–––, 1975. ‘Thought and talk’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp. 155–170.",
                "–––, 1979. ‘Quotation’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp.79–92. Originally published in <em>Theory\nand Decision</em>, 11 (1979): 27–40.",
                "–––, 1999. ‘Reply to Cappelen and\nLepore’, in Zeglen, pp. 100–102.",
                "Frege, Gottlob, 1892. ‘On sense and reference’, in\n<em>Translations from the Philosophical Writings of Gottlob\nFrege</em>, P. Geach and M. Black (eds.), 3rd edition, Oxford: Basil\nBlackwell, 1980, pp. 56–78.",
                "Garcia-Carpintero, Manuel, 1994. ‘Ostensive signs: against\nthe identity theory of quotation’, <em>Journal of\nPhilosophy</em>, 91: 253–64.",
                "–––, 2004. ‘The deferred ostension theory\nof quotation’, <em>Noûs</em>, 38(4): 674–692.",
                "–––, 2012. ‘Minimalism on quotation?\nCritical Review of Cappelen and Lepore’s Language Turned On\nItself’, <em>Philosophical Studies</em>, 161(2):\n207–225",
                "–––, 2017. ‘Reference and Reference-Fixing\nin Pure Quotation’, in Saka and Johnson (eds.) 2017, pp.\n169–194",
                "–––, 2018. ‘Pure Quotation Is\nDemonstrative Reference’, <em>Journal of Philosophy</em>, 115\n(7): 361–381.",
                "Geach, Peter, 1957. <em>Mental Acts</em>, London: Routledge Kegan\nPaul.",
                "–––, 1970. ‘Quotation and\nquantification’, in <em>Logic Matters</em>, Oxford: Basil\nBlackwell.",
                "Geurts, Bart and Emar Maier, 2003. ‘Quotation in\ncontext’, <em>Belgian Journal of Linguistics</em>, 17:\n109–128.",
                "Goddard, Leonard and Richard Routley, 1966. ‘Use, mention,\nand quotation’, <em>Australasian Journal of Philosophy</em>, 44:\n1–49.",
                "Goldstein, Laurence, 1984. ‘Quotation of types and types of\nquotation’, <em>Analysis</em>, 44: 1–6.",
                "Gomez-Torrente, Mario, 2001. ‘Quotation revisited’,\n<em>Philosophical Studies</em>, 102: 123–53.",
                "–––, 2005. ‘Remarks on Impure\nQuotation’, in Philippe De Brabanter (ed.), <em>Hybrid\nQuotations</em> (<em>Belgian Journal of Linguistics</em> 2003\nYearbook, Volume 17), Amsterdam: John Benjamins, pp.\n129–151",
                "–––, 2013. ‘How Quotations Refer’,\n<em>Journal of Philosophy</em>, 110(7): 353–390",
                "–––, 2017. ‘Semantics vs. Pragmatics in\nImpure Quotation’, in Saka and Johnson 2017, pp.\n135–16",
                "Johnson, Michael, 2018. ‘Pure Quotation and Natural\nNaming’, <em>Journal of Philosophy</em>, 115(10):\n550–566.",
                "Kaplan, David, 1973. ‘Bob, Ted, Carol and Alice’, in\n<em>Approaches to Natural language</em>, J. Hintikka, et al. (eds.),\npp. 490–518.",
                "–––, 1989. ‘Demonstratives’, in\n<em>Themes from Kaplan</em>, J. Almog, J. Perry, and H. Wettstein\n(eds.), Oxford: Oxford University Press, pp. 481–564.",
                "Lepore, Ernest, 1999. ‘The scope and limits of\nquotation.’ in <em>The Philosophy of Donald Davidson</em>, L. E.\nHahn (ed.), Open Court Publishers, pp. 691–714.",
                "Lepore, Ernest, and Barry Loewer, 1989. ‘You can say that\nagain’, <em>Midwest Studies in Philosophy</em>, 14:\n338–356.",
                "Ludwig, Kurt and Greg Ray, 1998. ‘Semantics for opaque\ncontexts.’ <em>Philosophical Perspectives</em>, 12:\n141–166.",
                "–––, 2017. ‘Unity in the Variety of\nQuotation’, in Saka and Johnson (eds.) 2017,\npp.99–134",
                "Maier, Emar, 2014a. ‘Mixed quotation: the grammar of\napparently transparent opacity’, <em>Semantics and\nPragmatics</em>, 7(7): 1–67.",
                "–––, 2014b. ‘Pure Quotation’,\n<em>Philosophy Compass</em>, 9(9): 615–630",
                "–––, 2015. ‘Quotation and unquotation in\nfree indirect discourse’, <em>Mind and Language</em>, 30(3):\n345–373.",
                "–––, 2016. ‘A plea against\nmonsters’, <em>Grazer Philosophische Studien</em>, 93:\n363–395.",
                "–––, 2017. ‘The Pragmatics Of Attraction.\nExplaining Unquotation in Direct and Free Indirect Discourse’,\nin Saka and Johnson (eds.) 2017: 259–302",
                "–––, 2020. ‘Mixed Quotation’, in\n<em>The Companion to Semantics</em>, Daniel Gutzmann, Lisa Matthewson,\nCécile Meier, Hotze Rullman, and Ede Zimmerman (eds.), Wiley\nBlackwell.",
                "Mates, B., 1972. <em>Elementary Logic</em>, 2<sup>nd</sup>\nedition, Oxford: Oxford University Press.",
                "McCullagh, Mark, 2006. ‘Understanding mixed\nquotation’, <em>Mind</em>, 116: 927–46.",
                "–––, 2017. ‘Scare-quoting and\nincorporation’, in Saka and Johnson (eds.) 2017,\npp.3–34.",
                "Miller, James, 2019. ‘Natural Name Theory and Linguistic\nKinds’, <em>Journal of Philosophy</em>, 116(9):\n494–508",
                "Munro, Pamela, 1982. ‘On the transitivity of\nsay-verbs’ in P. Hopper &amp; S. Thompson (eds.), <em>Studies in\nTransitivity. Syntax and Semantics</em>, New York, San Francisco,\nLondon: Academic Press, pp. 301–318.",
                "Murasugi, Kumiko &amp; Robert Stainton (eds.), 1999.\n<em>Philosophy and Linguistics</em>, Boulder CO: Westview.",
                "Pagin, Peter &amp; Westerståhl, Dag, 2010. ‘Pure\nquotation and general compositionality’, <em>Linguistics and\nPhilosophy</em>, 33(5): 381–415.",
                "Parsons, Terence, 1982. ‘What do quotation marks name?\nFrege’s theories of quotations and that-clauses’,\n<em>Philosophical Studies</em>, 42: 315–328.",
                "Partee, Barbara, 1973. ‘The syntax and semantics of\nquotation’, in <em>A Festschrift for Morris Halle</em>, S.R.\nAnderson and P. Kiparsky (eds.), New York: Holt, Reinehart and\nWinston, pp. 410–418.",
                "Pietroski, Paul, 1999. ‘Compositional quotation’, in\nMurasugi &amp; Stainton, pp. 245–58.",
                "Potts, Christopher, 2007. ‘The Dimensions of\nQuotation’, in Chris Barker and Pauline Jacobsen (eds.),\n<em>Direct Compositionality</em>, Oxford: Oxford University Press, pp.\n405–431",
                "Predelli, Stefano, 2003. ‘Scare quotes and their relation to\nother semantic issues’, <em>Linguistics and Philosophy</em>,\n26(1): 1–28.",
                "–––, 2003. ‘“Subliminable”\nmessages, scare quotes, and the use hypothesis’, <em>Belgian\nJournal of Linguistics</em>, 17: 153–166.",
                "–––, 2008. ‘The demonstrative theory of\nquotation’, <em>Linguistics and Philosophy</em>, 31(5):\n555–572.",
                "Prior, Arthur, 1971. <em>Objects of Thought</em>, Oxford: Oxford\nUniversity Press.",
                "Quine, Willard Van Orman., 1940. <em>Mathematical Logic</em>,\nBoston, MA: Harvard University Press.",
                "–––, 1955. ‘Quantifiers and propositional\nattitudes’, <em>Journal of Philosophy</em>, 53:\n177–86.",
                "–––, 1960. <em>Word and Object</em>, Cambridge,\nMA: MIT Press.",
                "–––, 1961. ‘Reference and modality’,\nin Quine 1961a, pp. 139–159.",
                "–––, 1961a. <em>From a Logical Point Of\nView</em>, Cambridge, MA: Harvard University Press.",
                "Rabern, Brian, forthcoming. ‘Pure quotation in linguistic\ncontext’, <em>Journal of Philosophical Logic</em>, first online\n07 September 2022. doi:10.1007/s10992-022-09675-3",
                "Read, Stephen, 1997. ‘Quotation and Geach’s\npuzzle’, <em>Acta Analytica</em>, 19(S): 9–20.",
                "Recanati, François, 2000. <em>Oratio Obliqua, Oratio Recta:\nAn Essay on Metarepresentation</em>, Cambridge, MA: MIT Press.",
                "–––, 2001. ‘Open quotation’,\n<em>Mind</em>, 110: 637–87.",
                "–––, 2010. <em>Truth-conditional\nPragmatics</em>, Oxford: Oxford University Press.",
                "Reichenbach, Hans, 1947. <em>Elements of Symbolic Logic</em>, New\nYork: Free Press.",
                "Reimer, Marga, 1996. ‘Quotation marks: demonstratives or\ndemonstrations?’ <em>Analysis</em>, 56: 131–42.",
                "–––, 2003. ‘Too counter-intuitive to\nbelieve? Pragmatic accounts of mixed quotation’, <em>Belgian\nJournal of Linguistics</em>, 17: 167–186.",
                "Richard, Mark, 1986. ‘Quotation, grammar, and\nopacity’, <em>Linguistics and Philosophy</em>, 9:\n383–403.",
                "Saka, Paul, 1998. ‘Quotation and the use-mention\nDistinction’, <em>Mind</em>, 107: 113–35.",
                "–––, 1999. ‘Quotation: a reply to Cappelen\n&amp; Lepore’, <em>Mind</em>, 108(432): 751–54.",
                "–––, 2003. ‘Quotational\nconstructions’, <em>Belgian Journal of Linguistics</em>, 17:\n187–212.",
                "–––, 2006. ‘The Demonstrative and Identity\nTheories of Quotation’, <em>The Journal of Philosophy</em>,\n103(9): 452–471.",
                "–––, 2011a. ‘The act of quotation’,\nin E. Brendal, J. Meibauer, M. Steinbach (eds.), <em>Understanding\nQuotation</em>, Berlin: Mouton De Gruyter, 303–22.",
                "–––, 2011b. ‘Quotation And Conceptions Of\nLanguage’, <em>dialectica</em>, 65(2): 205–220.",
                "–––, 2013. ‘Quotation’,\n<em>Philosophy Compass</em> 8(10): 935–949",
                "–––, 2017. ‘<em>Blah,Blah,Blah</em>:\nQuasi-quotation and Unquotation’, in Saka and Johnson (eds.)\n2017, pp. 35–63",
                "Saka, Paul and Michael Johnson (eds.), 2017. <em>The Semantics and\nPragmatics of Quotation</em>, Dordrecht: Springer.",
                "Salmon, Nathan, 1986. <em>Frege’s Puzzle</em>, Cambridge,\nMA: MIT Press.",
                "Searle, John, 1969. <em>Speech Acts</em>, Cambridge: Cambridge\nUniversity Press, §4.1.",
                "Sellars, W., 1963. ‘Abstract entities’, <em>Review of\nMetaphysics</em>, 16(4): 627–671; reprinted in Sellars,\n<em>Philosophical Perspectives</em>, Springfield, IL, Charles Thomas,\n1967, pp. 229–269.",
                "Seymour, Michel, 1994. ‘Indirect discourse and\nquotation’, <em>Philosophical Studies</em>, 74: 1–38.",
                "Smullyan, Raymond, 1957, ‘Languages in which self-reference\nis possible’, <em>Journal of Symbolic Logic</em>, 22:\n55–67.",
                "Sorensen, Roy, 2008. ‘Empty quotation’,\n<em>Analysis</em>, 68(297): 57–61.",
                "Sperber, Dan and Deirdre Wilson, 1981. ‘Irony and the\nuse-mention distinction’, in P. Cole (ed.), <em>Radical\nPragmatics</em>, New York: Academic Press, pp. 295–318.",
                "–––, 1986. <em>Relevance: Communication and\nCognition</em>, Oxford: Blackwell, 2nd edition, 1995.",
                "Stainton, Robert, 1999, ‘Remarks on the syntax and semantics\nof mixed quotation’, in Murasugi &amp; Stainton,\n259–278.",
                "Tarski, Alfred, 1933. ‘The concept of truth in formalized\nlanguages’, in A. Tarski, <em>Logic, Semantics,\nMetamathematics</em>, 2<sup>nd</sup> edition, Indianapolis: Hackett,\n1983, pp. 152–278.",
                "Tsohatzidis, Savas, 1998. ‘The hybrid theory of mixed\nquotation’, <em>Mind</em>, 107: 661–64.",
                "Wallace, Jay, 1972. ‘On the frame of reference’, in\n<em>Semantics of Natural Language</em>, D. Davidson and G. Harman\n(eds.), Dordrecht: D. Reidel, pp. 219–252.",
                "Washington, Corey, 1992. ‘The identity theory of\nquotation’, <em>Journal of Philosophy</em>, 89:\n582–605.",
                "Wertheimer, Roger, 1999. ‘Quotation apposition’,\n<em>Philosophical Quarterly</em>, 49(197): 514–19.",
                "Wilson, Dan, 2000. ‘Metarepresentation in linguistic\ncommunication’, in D. Sperber (ed.), <em>Metarepresentations: A\nMultidisciplinary Perspective</em>, New York: Oxford University Press,\npp. 411–448.",
                "Zeglen, Urszula, 1999. <em>Donald Davidson: Truth, Meaning and\nKnowledge</em>, London: Routledge."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Abbott, Barbara, 2003. ‘Some Notes on Quotation’,\n<em>Belgian Journal of Linguistics</em>, 17(1): 13–26.</li>\n<li>Bazzoni, André, 2016. ‘Pure quotation, metalanguage\nand metasemantics’, <em>Linguistics and Philosophy</em>, 39(2):\n119–149.</li>\n<li>Benbaji, Yitzhak, 2003. ‘Who needs semantics of quotation\nmarks?’ <em>Belgian Journal of Linguistics</em>, 17:\n27–49.</li>\n<li>–––, 2004a. ‘A demonstrative analysis of\n“open quotation”‘. <em>Mind and Language</em>, 19:\n534–547.</li>\n<li>–––, 2004b. ‘Using others’\nwords’, <em>Journal of Philosophical Research</em>, 29:\n93–112.</li>\n<li>Bennett, Jonathan, 1988. ‘Quotation’,\n<em>Noûs</em>, 22: 399–418.</li>\n<li>Boolos, George, 1995. ‘Quotational ambiguity’, in\n<em>On Quine</em>, P. Leonardi and M. Santambrogio (eds.), Cambridge:\nCambridge University Press, pp. 283–296.</li>\n<li>Botterell, Andrew and Stainton, Robert, 2005. ‘Quotation:\nCompositionality and Innocence without Demonstration’,\n<em>Critica: Revista Hispanoamericana de Filosofia</em>, 37(110):\n3–33.</li>\n<li>Burge, Tyler, 1986. ‘On Davidson’s ‘Saying\nthat’’, in <em>Truth and Interpretation</em>, Basil E.\nLepore (ed.), Oxford: Blackwell, pp. 190–208.</li>\n<li>Cappelen, Herman, 1997. <em>Signs</em>, Doctoral Dissertation,\nPhilosophy Department, University of California-Berkeley.</li>\n<li>Cappelen, Herman and Ernest Lepore, 1997a. ‘On an alleged\nconnection between semantic theory and indirect quotation’,\n<em>Mind and Language</em>, 12: 278–296.</li>\n<li>–––, 1997b. ‘Varieties of\nquotation’, <em>Mind</em>, 106: 429–50.</li>\n<li>–––, 1998. ‘Using, mentioning, and\nquoting: reply to Tsohatzidis’, <em>Mind</em>, 107:\n665–666.</li>\n<li>–––, 1999a. ‘Reply to Saka’,\n<em>Mind</em>, 108: 741–50.</li>\n<li>–––, 1999b. ‘Reply to Stainton’, in\nKumiko and Robert, pp. 279–283.</li>\n<li>–––, 1999c. ‘Reply to Pietroski’, in\nKumiko and Robert, pp. 283–285.</li>\n<li>–––, 1999d. ‘Semantics of\nquotation’, in Zeglen, pp. 90–99.</li>\n<li>–––, 2003. ‘Varieties of quotation\nrevisited’, <em>Belgian Journal of Linguistics</em>, 17:\n51–75.</li>\n<li>–––, 2004. <em>Insensitive Semantics</em>,\nOxford: Basil Blackwell Publishers.</li>\n<li>–––, 2007. <em>Language Turned On Itself</em>,\nOxford: Oxford University Press.</li>\n<li>Carnap, Rudolf, 1937. <em>Logical Syntax of Language</em>, London:\nRoutledge and Kegan Paul.</li>\n<li>–––, 1947. <em>Meaning and Necessity</em>,\nChicago: University of Chicago Press.</li>\n<li>Christensen, Niels, 1967. ‘The alleged distinction between\nuse and mention’, <em>Philosophical Review</em>, 76:\n358–67.</li>\n<li>Clark, Herbert &amp; Richard Gerrig, 1990. ‘Quotations as\ndemonstrations’, <em>Language</em>, 66(4): 764–805.</li>\n<li>Cumming, Sam, 2003. ‘Two accounts of indexicals in mixed\nquotation’, <em>Belgian Journal of Linguistics</em>, 17:\n77–88.</li>\n<li>De Brabanter, Philippe, 2010. ‘The semantics and pragmatics\nof hybrid quotations’, <em>Language and Linguistics\nCompass</em>, 4(2): 107–120.</li>\n<li>–––, 2019. ‘The Interpretation of\nIndexicals in Hybrid Quotation: A Pragmatic Account’,\n<em>Anglophonia: French Journal Of English Linguistics</em>, 28.\ndoi:10.4000/anglophonia.2646.</li>\n<li>–––, 2022. ‘Accounting for\nnon-constituents in hybrid quotations. Why unquotation is not the\nanswer’, <em>Journal of Linguistics</em>, 59(1): 1–22.\ndoi:10.1017/S0022226722000184</li>\n<li>Elugardo, Reinaldo, 1999. ‘Mixed quotation’, in\nMurasugi &amp; Stainton.</li>\n<li>Davidson, Davidson, 1968. ‘On saying that’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp. 93–108.</li>\n<li>–––, 1975. ‘Thought and talk’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp. 155–170.</li>\n<li>–––, 1979. ‘Quotation’, in\n<em>Inquiries Into Truth and Interpretation</em>, Oxford: Oxford\nUniversity Press, pp.79–92. Originally published in <em>Theory\nand Decision</em>, 11 (1979): 27–40.</li>\n<li>–––, 1999. ‘Reply to Cappelen and\nLepore’, in Zeglen, pp. 100–102.</li>\n<li>Frege, Gottlob, 1892. ‘On sense and reference’, in\n<em>Translations from the Philosophical Writings of Gottlob\nFrege</em>, P. Geach and M. Black (eds.), 3rd edition, Oxford: Basil\nBlackwell, 1980, pp. 56–78.</li>\n<li>Garcia-Carpintero, Manuel, 1994. ‘Ostensive signs: against\nthe identity theory of quotation’, <em>Journal of\nPhilosophy</em>, 91: 253–64.</li>\n<li>–––, 2004. ‘The deferred ostension theory\nof quotation’, <em>Noûs</em>, 38(4): 674–692.</li>\n<li>–––, 2012. ‘Minimalism on quotation?\nCritical Review of Cappelen and Lepore’s Language Turned On\nItself’, <em>Philosophical Studies</em>, 161(2):\n207–225</li>\n<li>–––, 2017. ‘Reference and Reference-Fixing\nin Pure Quotation’, in Saka and Johnson (eds.) 2017, pp.\n169–194</li>\n<li>–––, 2018. ‘Pure Quotation Is\nDemonstrative Reference’, <em>Journal of Philosophy</em>, 115\n(7): 361–381.</li>\n<li>Geach, Peter, 1957. <em>Mental Acts</em>, London: Routledge Kegan\nPaul.</li>\n<li>–––, 1970. ‘Quotation and\nquantification’, in <em>Logic Matters</em>, Oxford: Basil\nBlackwell.</li>\n<li>Geurts, Bart and Emar Maier, 2003. ‘Quotation in\ncontext’, <em>Belgian Journal of Linguistics</em>, 17:\n109–128.</li>\n<li>Goddard, Leonard and Richard Routley, 1966. ‘Use, mention,\nand quotation’, <em>Australasian Journal of Philosophy</em>, 44:\n1–49.</li>\n<li>Goldstein, Laurence, 1984. ‘Quotation of types and types of\nquotation’, <em>Analysis</em>, 44: 1–6.</li>\n<li>Gomez-Torrente, Mario, 2001. ‘Quotation revisited’,\n<em>Philosophical Studies</em>, 102: 123–53.</li>\n<li>–––, 2005. ‘Remarks on Impure\nQuotation’, in Philippe De Brabanter (ed.), <em>Hybrid\nQuotations</em> (<em>Belgian Journal of Linguistics</em> 2003\nYearbook, Volume 17), Amsterdam: John Benjamins, pp.\n129–151</li>\n<li>–––, 2013. ‘How Quotations Refer’,\n<em>Journal of Philosophy</em>, 110(7): 353–390</li>\n<li>–––, 2017. ‘Semantics vs. Pragmatics in\nImpure Quotation’, in Saka and Johnson 2017, pp.\n135–16</li>\n<li>Johnson, Michael, 2018. ‘Pure Quotation and Natural\nNaming’, <em>Journal of Philosophy</em>, 115(10):\n550–566.</li>\n<li>Kaplan, David, 1973. ‘Bob, Ted, Carol and Alice’, in\n<em>Approaches to Natural language</em>, J. Hintikka, et al. (eds.),\npp. 490–518.</li>\n<li>–––, 1989. ‘Demonstratives’, in\n<em>Themes from Kaplan</em>, J. Almog, J. Perry, and H. Wettstein\n(eds.), Oxford: Oxford University Press, pp. 481–564.</li>\n<li>Lepore, Ernest, 1999. ‘The scope and limits of\nquotation.’ in <em>The Philosophy of Donald Davidson</em>, L. E.\nHahn (ed.), Open Court Publishers, pp. 691–714.</li>\n<li>Lepore, Ernest, and Barry Loewer, 1989. ‘You can say that\nagain’, <em>Midwest Studies in Philosophy</em>, 14:\n338–356.</li>\n<li>Ludwig, Kurt and Greg Ray, 1998. ‘Semantics for opaque\ncontexts.’ <em>Philosophical Perspectives</em>, 12:\n141–166.</li>\n<li>–––, 2017. ‘Unity in the Variety of\nQuotation’, in Saka and Johnson (eds.) 2017,\npp.99–134</li>\n<li>Maier, Emar, 2014a. ‘Mixed quotation: the grammar of\napparently transparent opacity’, <em>Semantics and\nPragmatics</em>, 7(7): 1–67.</li>\n<li>–––, 2014b. ‘Pure Quotation’,\n<em>Philosophy Compass</em>, 9(9): 615–630</li>\n<li>–––, 2015. ‘Quotation and unquotation in\nfree indirect discourse’, <em>Mind and Language</em>, 30(3):\n345–373.</li>\n<li>–––, 2016. ‘A plea against\nmonsters’, <em>Grazer Philosophische Studien</em>, 93:\n363–395.</li>\n<li>–––, 2017. ‘The Pragmatics Of Attraction.\nExplaining Unquotation in Direct and Free Indirect Discourse’,\nin Saka and Johnson (eds.) 2017: 259–302</li>\n<li>–––, 2020. ‘Mixed Quotation’, in\n<em>The Companion to Semantics</em>, Daniel Gutzmann, Lisa Matthewson,\nCécile Meier, Hotze Rullman, and Ede Zimmerman (eds.), Wiley\nBlackwell.</li>\n<li>Mates, B., 1972. <em>Elementary Logic</em>, 2<sup>nd</sup>\nedition, Oxford: Oxford University Press.</li>\n<li>McCullagh, Mark, 2006. ‘Understanding mixed\nquotation’, <em>Mind</em>, 116: 927–46.</li>\n<li>–––, 2017. ‘Scare-quoting and\nincorporation’, in Saka and Johnson (eds.) 2017,\npp.3–34.</li>\n<li>Miller, James, 2019. ‘Natural Name Theory and Linguistic\nKinds’, <em>Journal of Philosophy</em>, 116(9):\n494–508</li>\n<li>Munro, Pamela, 1982. ‘On the transitivity of\nsay-verbs’ in P. Hopper &amp; S. Thompson (eds.), <em>Studies in\nTransitivity. Syntax and Semantics</em>, New York, San Francisco,\nLondon: Academic Press, pp. 301–318.</li>\n<li>Murasugi, Kumiko &amp; Robert Stainton (eds.), 1999.\n<em>Philosophy and Linguistics</em>, Boulder CO: Westview.</li>\n<li>Pagin, Peter &amp; Westerståhl, Dag, 2010. ‘Pure\nquotation and general compositionality’, <em>Linguistics and\nPhilosophy</em>, 33(5): 381–415.</li>\n<li>Parsons, Terence, 1982. ‘What do quotation marks name?\nFrege’s theories of quotations and that-clauses’,\n<em>Philosophical Studies</em>, 42: 315–328.</li>\n<li>Partee, Barbara, 1973. ‘The syntax and semantics of\nquotation’, in <em>A Festschrift for Morris Halle</em>, S.R.\nAnderson and P. Kiparsky (eds.), New York: Holt, Reinehart and\nWinston, pp. 410–418.</li>\n<li>Pietroski, Paul, 1999. ‘Compositional quotation’, in\nMurasugi &amp; Stainton, pp. 245–58.</li>\n<li>Potts, Christopher, 2007. ‘The Dimensions of\nQuotation’, in Chris Barker and Pauline Jacobsen (eds.),\n<em>Direct Compositionality</em>, Oxford: Oxford University Press, pp.\n405–431</li>\n<li>Predelli, Stefano, 2003. ‘Scare quotes and their relation to\nother semantic issues’, <em>Linguistics and Philosophy</em>,\n26(1): 1–28.</li>\n<li>–––, 2003. ‘“Subliminable”\nmessages, scare quotes, and the use hypothesis’, <em>Belgian\nJournal of Linguistics</em>, 17: 153–166.</li>\n<li>–––, 2008. ‘The demonstrative theory of\nquotation’, <em>Linguistics and Philosophy</em>, 31(5):\n555–572.</li>\n<li>Prior, Arthur, 1971. <em>Objects of Thought</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Quine, Willard Van Orman., 1940. <em>Mathematical Logic</em>,\nBoston, MA: Harvard University Press.</li>\n<li>–––, 1955. ‘Quantifiers and propositional\nattitudes’, <em>Journal of Philosophy</em>, 53:\n177–86.</li>\n<li>–––, 1960. <em>Word and Object</em>, Cambridge,\nMA: MIT Press.</li>\n<li>–––, 1961. ‘Reference and modality’,\nin Quine 1961a, pp. 139–159.</li>\n<li>–––, 1961a. <em>From a Logical Point Of\nView</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Rabern, Brian, forthcoming. ‘Pure quotation in linguistic\ncontext’, <em>Journal of Philosophical Logic</em>, first online\n07 September 2022. doi:10.1007/s10992-022-09675-3</li>\n<li>Read, Stephen, 1997. ‘Quotation and Geach’s\npuzzle’, <em>Acta Analytica</em>, 19(S): 9–20.</li>\n<li>Recanati, François, 2000. <em>Oratio Obliqua, Oratio Recta:\nAn Essay on Metarepresentation</em>, Cambridge, MA: MIT Press.</li>\n<li>–––, 2001. ‘Open quotation’,\n<em>Mind</em>, 110: 637–87.</li>\n<li>–––, 2010. <em>Truth-conditional\nPragmatics</em>, Oxford: Oxford University Press.</li>\n<li>Reichenbach, Hans, 1947. <em>Elements of Symbolic Logic</em>, New\nYork: Free Press.</li>\n<li>Reimer, Marga, 1996. ‘Quotation marks: demonstratives or\ndemonstrations?’ <em>Analysis</em>, 56: 131–42.</li>\n<li>–––, 2003. ‘Too counter-intuitive to\nbelieve? Pragmatic accounts of mixed quotation’, <em>Belgian\nJournal of Linguistics</em>, 17: 167–186.</li>\n<li>Richard, Mark, 1986. ‘Quotation, grammar, and\nopacity’, <em>Linguistics and Philosophy</em>, 9:\n383–403.</li>\n<li>Saka, Paul, 1998. ‘Quotation and the use-mention\nDistinction’, <em>Mind</em>, 107: 113–35.</li>\n<li>–––, 1999. ‘Quotation: a reply to Cappelen\n&amp; Lepore’, <em>Mind</em>, 108(432): 751–54.</li>\n<li>–––, 2003. ‘Quotational\nconstructions’, <em>Belgian Journal of Linguistics</em>, 17:\n187–212.</li>\n<li>–––, 2006. ‘The Demonstrative and Identity\nTheories of Quotation’, <em>The Journal of Philosophy</em>,\n103(9): 452–471.</li>\n<li>–––, 2011a. ‘The act of quotation’,\nin E. Brendal, J. Meibauer, M. Steinbach (eds.), <em>Understanding\nQuotation</em>, Berlin: Mouton De Gruyter, 303–22.</li>\n<li>–––, 2011b. ‘Quotation And Conceptions Of\nLanguage’, <em>dialectica</em>, 65(2): 205–220.</li>\n<li>–––, 2013. ‘Quotation’,\n<em>Philosophy Compass</em> 8(10): 935–949</li>\n<li>–––, 2017. ‘<em>Blah,Blah,Blah</em>:\nQuasi-quotation and Unquotation’, in Saka and Johnson (eds.)\n2017, pp. 35–63</li>\n<li>Saka, Paul and Michael Johnson (eds.), 2017. <em>The Semantics and\nPragmatics of Quotation</em>, Dordrecht: Springer.</li>\n<li>Salmon, Nathan, 1986. <em>Frege’s Puzzle</em>, Cambridge,\nMA: MIT Press.</li>\n<li>Searle, John, 1969. <em>Speech Acts</em>, Cambridge: Cambridge\nUniversity Press, §4.1.</li>\n<li>Sellars, W., 1963. ‘Abstract entities’, <em>Review of\nMetaphysics</em>, 16(4): 627–671; reprinted in Sellars,\n<em>Philosophical Perspectives</em>, Springfield, IL, Charles Thomas,\n1967, pp. 229–269.</li>\n<li>Seymour, Michel, 1994. ‘Indirect discourse and\nquotation’, <em>Philosophical Studies</em>, 74: 1–38.</li>\n<li>Smullyan, Raymond, 1957, ‘Languages in which self-reference\nis possible’, <em>Journal of Symbolic Logic</em>, 22:\n55–67.</li>\n<li>Sorensen, Roy, 2008. ‘Empty quotation’,\n<em>Analysis</em>, 68(297): 57–61.</li>\n<li>Sperber, Dan and Deirdre Wilson, 1981. ‘Irony and the\nuse-mention distinction’, in P. Cole (ed.), <em>Radical\nPragmatics</em>, New York: Academic Press, pp. 295–318.</li>\n<li>–––, 1986. <em>Relevance: Communication and\nCognition</em>, Oxford: Blackwell, 2nd edition, 1995.</li>\n<li>Stainton, Robert, 1999, ‘Remarks on the syntax and semantics\nof mixed quotation’, in Murasugi &amp; Stainton,\n259–278.</li>\n<li>Tarski, Alfred, 1933. ‘The concept of truth in formalized\nlanguages’, in A. Tarski, <em>Logic, Semantics,\nMetamathematics</em>, 2<sup>nd</sup> edition, Indianapolis: Hackett,\n1983, pp. 152–278.</li>\n<li>Tsohatzidis, Savas, 1998. ‘The hybrid theory of mixed\nquotation’, <em>Mind</em>, 107: 661–64.</li>\n<li>Wallace, Jay, 1972. ‘On the frame of reference’, in\n<em>Semantics of Natural Language</em>, D. Davidson and G. Harman\n(eds.), Dordrecht: D. Reidel, pp. 219–252.</li>\n<li>Washington, Corey, 1992. ‘The identity theory of\nquotation’, <em>Journal of Philosophy</em>, 89:\n582–605.</li>\n<li>Wertheimer, Roger, 1999. ‘Quotation apposition’,\n<em>Philosophical Quarterly</em>, 49(197): 514–19.</li>\n<li>Wilson, Dan, 2000. ‘Metarepresentation in linguistic\ncommunication’, in D. Sperber (ed.), <em>Metarepresentations: A\nMultidisciplinary Perspective</em>, New York: Oxford University Press,\npp. 411–448.</li>\n<li>Zeglen, Urszula, 1999. <em>Donald Davidson: Truth, Meaning and\nKnowledge</em>, London: Routledge.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Davidson, Donald",
            "descriptions",
            "Quine, Willard Van Orman",
            "reference",
            "Tarski, Alfred"
        ],
        "entry_link": [
            {
                "../davidson/": "Davidson, Donald"
            },
            {
                "../descriptions/": "descriptions"
            },
            {
                "../quine/": "Quine, Willard Van Orman"
            },
            {
                "../reference/": "reference"
            },
            {
                "../tarski/": "Tarski, Alfred"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=quotation\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/quotation/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=quotation&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/quotation/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=quotation": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/quotation/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=quotation&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/quotation/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}