{
    "url": "rationality-structural",
    "title": "Structural Rationality",
    "authorship": {
        "year": "Copyright © 2023",
        "author_text": "Benjamin Kiesewetter\n<benjamin.kiesewetter@uni-bielefeld.de>\nAlex Worsnip\n<aworsnip@unc.edu>",
        "author_links": [
            {
                "https://www.benjaminkiesewetter.net/": "Benjamin Kiesewetter"
            },
            {
                "mailto:benjamin%2ekiesewetter%40uni-bielefeld%2ede": "benjamin.kiesewetter@uni-bielefeld.de"
            },
            {
                "http://www.alexworsnip.com": "Alex Worsnip"
            },
            {
                "mailto:aworsnip%40unc%2eedu": "aworsnip@unc.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2023</a> by\n\n<br/>\n<a href=\"https://www.benjaminkiesewetter.net/\" target=\"other\">Benjamin Kiesewetter</a>\n&lt;<a href=\"mailto:benjamin%2ekiesewetter%40uni-bielefeld%2ede\"><em>benjamin<abbr title=\" dot \">.</abbr>kiesewetter<abbr title=\" at \">@</abbr>uni-bielefeld<abbr title=\" dot \">.</abbr>de</em></a>&gt;<br/>\n<a href=\"http://www.alexworsnip.com\" target=\"other\">Alex Worsnip</a>\n&lt;<a href=\"mailto:aworsnip%40unc%2eedu\"><em>aworsnip<abbr title=\" at \">@</abbr>unc<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Sep 13, 2023"
    ],
    "preamble": "\n\nMany paradigm instances of irrationality involve one’s mental\nstates failing to cohere with one another, in a fairly broad sense of\n ‘cohere’.[1]\n For example, it’s commonly thought to be irrational to hold\n(obviously) inconsistent beliefs – say, to believe that you are\na great cook, to believe that great cooks never overcook eggs, and yet\nto believe that you have overcooked the eggs. These three beliefs are\njointly incoherent. Similarly, many central instances of practical\nirrationality, such as instrumental irrationality, can be thought of\nas instances of incoherence: it is incoherent to simultaneously intend\nto shop for groceries today, believe that to shop for groceries today\nyou must get on your bike now, but yet not intend to get on your bike\nnow. In recent years, many philosophers have come to refer to\nthese incoherence-involving instances of irrationality as forms\nof ‘structural irrationality’, and to call the property of\nhaving mental states that do cohere with one\nanother properly ‘structural rationality’.\n\nStructural rationality is often contrasted with ‘substantive\nrationality’, which is typically understood in terms of\nresponsiveness to normative reasons. So, for example, when we say that\nit isn’t rational to (intend to) gamble one’s life savings\non the outcome of a horse race, this seems to reflect the existence of\nstrong normative reasons against gambling (or intending to gamble)\none’s life savings on the outcome of the race, rather than\npinpointing any incoherence that must be present in the mental states\nof anyone who gambles her life savings on the outcome of the race.\nSimilarly, when we say it isn’t rational to believe in\nastrology, this seems to reflect a judgment that there are strong\nnormative reasons – presumably supplied by the available\nevidence – against believing in astrology, rather than presuming\nthat anyone who believes in astrology must be incoherent.\n\nThis entry is composed of three sections. In §1, we survey\ndebates about what structural rationality is, including the emergence\nof the concept in the contemporary literature, its key\ncharacteristics, its relationship to substantive rationality, its\nparadigm instances, and the questions of whether these instances are\nunified and, if so, how. In §2, we turn to the debate about\nstructural requirements of rationality – including\ncontroversies about whether they are “wide-scope” or\n“narrow-scope”, synchronic or diachronic, and whether they\ngovern processes or states; as well as examining various forms of\nskepticism about structural requirements of rationality. In §3,\nwe turn to the debate about the normative significance of structural\nrationality, surveying central challenges for the view that structural\nrationality is normatively significant and the theoretical options\nthat arise in light of these challenges.\n",
    "toc": [
        {
            "#WhatStruRati": "1. What is Structural Rationality?"
        },
        {
            "#EmerConcStruRati": "1.1 The Emergence of the Concept of Structural Rationality"
        },
        {
            "#KeyCharStruRati": "1.2 Key Characteristics of Structural Rationality"
        },
        {
            "#RelaBetwStruSubsRati": "1.3 The Relationship Between Structural and Substantive Rationality"
        },
        {
            "#InstStruIrraInve": "1.4 Instances of Structural (Ir)rationality: An Inventory"
        },
        {
            "#UnitStruRati": "1.5 The Unity of Structural Rationality"
        },
        {
            "#RequStruRati": "2. Requirements of Structural Rationality"
        },
        {
            "#WideVsNarrScopRequ": "2.1 Wide- vs. Narrow-Scope Requirements"
        },
        {
            "#SyncVsDiacRequ": "2.2 Synchronic vs. Diachronic Requirements"
        },
        {
            "#ProcVsStatRequ": "2.3 Process vs. State Requirements"
        },
        {
            "#SkepAbouAlteRequStruRati": "2.4 Skepticism about and Alternatives to Requirements of Structural Rationality"
        },
        {
            "#NormSignStruRati": "3. The Normative Significance of Structural Rationality"
        },
        {
            "#BootDeta": "3.1 Bootstrapping and Detachment"
        },
        {
            "#WhyRatiChal": "3.2 The Why-Be-Rational Challenge"
        },
        {
            "#TranAppaReasAcco": "3.3 Transparency and Apparent Reasons Accounts"
        },
        {
            "#TheoOpti": "3.4 The Theoretical Options"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#OnliManuBlogPost": "Online manuscripts and blog posts"
        },
        {
            "#Webs": "Websites"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is Structural Rationality?\n1.1 The Emergence of the Concept of Structural Rationality\n\nThe term ‘structural (ir)rationality’ is relatively\nrecent; to the best of our knowledge, its first use with its current\nmeaning is in Scanlon\n (2007).[2]\n However, philosophers have been theorizing about the underlying\nconcept, using different terminology, for significantly longer.\nInteresting questions can be asked about whether historical figures\nsuch as Hume and Kant had theories of structural rationality. However,\nthe contemporary debate about structural rationality can be more\ndirectly traced to a number of important articles and books from the\n1970s and 80s (Hill 1973; Greenspan 1975; Dancy 1977; Darwall 1983),\nwhich largely focus on practical rationality.\n\nDarwall’s 1983 book Impartial Reason is particularly\ninstructive to focus on. The first half of the book is devoted to\narguing against what Darwall calls the “DBR thesis”, on\nwhich an agent’s normative reasons are all dependent on her\ndesires or ends – a thesis that was highly popular at the time.\nOne line of support for the DBR thesis to which Darwall responds can\nbe reconstructed roughly as follows:\n\nIt’s irrational not to intend to take the believed means to\none’s ends.\nTherefore, not intending to take the believed means to one’s\nends involves a failure to respond to one’s reasons.\nTherefore, one’s reasons are strongly dependent on\none’s ends.\n\n\nThis line of argument, if successful, generates strongly subjectivist\n(and anti-moralist) results about reasons. For example, to adapt\nDarwall’s memorable example, suppose Jo intends to kill Jay in\nthe most violent way possible, and believes that the most violent way\nto kill Jay is with a cleaver. But suppose Jo does not intend to kill\nJay with a cleaver. Jo is, then, practically irrational. According to\nthe line of thought above, the way to explain this is by holding that\nJo’s intention to kill Jay in the most violent way possible\n– perhaps together with her belief that the most violent way to\nkill Jay is with a cleaver – gives her a strong reason\nto (intend to) kill Jay with a cleaver. Generalizing, the result is\nthat Jo can give herself strong reasons to perform highly immoral (or,\nindeed, imprudent) acts merely by adopting ends to which those acts\nare (believed) necessary means.\n\nNot so fast, says Darwall, however. He focuses on critiquing the\ntransition from (a) to (b) – though one could certainly also\nquestion the transition from (b) to (c). According to Darwall, the\nirrationality of failing to (intend to) take the (believed) means to\none’s ends need not equate to a failure to respond to\none’s reasons. Rather, it can be understood as a\nfailure to conform to a sui generis rational requirement of\ncoherence, which itself has no consequences for claims about reasons.\nDarwall calls such requirements principles of “relative\nrationality”; this notion is roughly equivalent to the more\ncontemporary notion of structural rationality. As well as treating the\nrequirement of instrumental rationality this way, Darwall makes a\nsimilar move regarding decision-theoretic principles that require us\nto do what maximizes subjective utility given our credences and\npreferences.\n\nThe basic maneuver here recurs in the works of a number of other\nphilosophers (McDowell 1995; Scanlon 1998, 2004; Broome 1999, 2001a,\n2004; Dancy 2000). In each case, the aim is to avoid highly\nsubjectivist or anti-moralist results about reasons, or instances of\nwhat is often called “bootstrapping” (Bratman 1987; Broome\n2001a), whereby merely having an attitude that is itself immoral or\nunreasonable can give one reasons to adopt further immoral or\nunreasonable attitudes. And in each case, these results are avoided by\ntreating the requirements of structural rationality as autonomous and\ndistinct from requirements that concern responding to reasons. By\nmaking space for a distinctively structural or coherence-based notion\nof rationality, the thought goes, we can accommodate intuitions about\nthe irrationality of incoherence without committing ourselves to\npotentially problematic subjectivist assumptions about normative\nreasons.\n\nAnalogous points can be made in doxastic cases. To adapt an example\nfrom Fogal (2020), suppose that Ali believes that he is Superman, and\nbelieves that Superman can fly. If we now add that Ali believes that\nhe cannot fly, Ali seems to be subject to a (further) charge of\nirrationality that he was not otherwise subject to. Should we conclude\nfrom this that, merely by believing that he is Superman and that\nSuperman can fly, Ali gives himself a strong reason to\nbelieve that he can fly – one that he flouts by believing,\ninstead, that he cannot fly? Many epistemologists would deny this: on\nmost views, you can’t make an evidentially unsupported belief\nreasonable just by adopting other, equally unsupported, beliefs that\nentail it. Indeed, as Broome (1999) points out, if this were so, then\nany belief could make itself reasonable, since all propositions entail\nthemselves. Rather, the thought goes, we can account for Ali’s\nirrationality by saying that he violates a requirement of structural\nrationality forbidding inconsistent beliefs (or, perhaps, particular\nkinds of inconsistent beliefs).\n\nOnce reasons and requirements of structural rationality are\ndistinguished in this way, a number of important questions arise. One\npressing question is whether there are any reasons to comply with the\nrequirements of structural rationality. We’ll return to this\nquestion in §3. Before that, there is more to be said about the\nnotion of structural rationality and requirements thereof.\n1.2 Key Characteristics of Structural Rationality\n\nAs we have already seen, evaluations of structural rationality concern\nthe coherence of one’s mental states. However, we can get a\nsharper focus on the notion of structural rationality by identifying\nsome further often identified features of evaluations of structural\nrationality or irrationality, which are supposed to distinguish them\nfrom evaluations of substantive rationality or irrationality.\n\nFirst, structural rationality typically concerns combinations\nof attitudes (and absences thereof), rather than individual\nattitudes (and absences thereof). Consider someone who believes \\(p\\)\nand believes not-\\(p\\). Either or both beliefs may fail to be\nsubstantively rational if they are ill-supported by the agent’s\nepistemic reasons. But the structural irrationality lies in the\ncombination, not in either individual belief. The same is true of, for\nexample, intending to \\(\\Phi\\), believing that in order to \\(\\Phi\\)\none must \\(\\Psi\\), but not intending to \\(\\Psi\\). Again, one or more\nof these states may fail to be individually substantively rational,\nbut the structural irrationality lies in the combination. However, it\nis controversial whether structural rationality always\nconcerns combinations of attitudes, rather than individual attitudes.\nBroome (2013: 153), for example, suggests that a belief in a\nconjunctive proposition of the form \\((p\\) & not-\\(p)\\) is, on its\nown, structurally irrational. Nor is it distinctive of\nstructural rationality that it concerns combinations of attitudes.\nThere may be failures of substantive rationality that obtain\nspecifically in virtue of a combination of attitudes: for example, it\nmight not be substantively rational to intend to go to a job interview\ntomorrow and intend to wear swim shorts tomorrow, even if\neither of these intentions is rationally permitted on its own.\n\nSecond, and relatedly, evaluations of the structural rationality of\nsome combination of attitudes can be made independently of judgments\nabout which (if any) of the individual attitudes within the\ncombination of attitude is substantively rational, or adequately\nsupported by reasons. For example, suppose that Ravi believes that all\ntaxes are illegitimate, while also believing that income taxes are\nlegitimate. A left-liberal might judge that Ravi has good reasons for\nthe second belief but not the first, while an anarcho-capitalist might\njudge the reverse, and a political agnostic might have no views about\nwhich of Ravi’s beliefs, if either, is supported by good\nreasons. Yet this should be no barrier to all three agreeing that\nRavi’s combination of beliefs is structurally\nirrational. Similarly, even when we disagree about whether some end is\nworth pursuing, we should be able to agree that intending that end\nwhile not intending the believed means to it is structurally\nirrational.\n\nThird, evaluations of structural rationality can be made without\nknowing anything about the situation of the agent being evaluated, or\nabout the agent’s information about their situation. In this\nrespect, they again contrast with evaluations of substantive\nrationality. Whether it is substantively rational for you to intend to\ngo to medical school depends on the information available to you about\nyour likely chances of succeeding in medical school, the costs of\ngoing, whether being a doctor would be a career you’d enjoy, and\nso on. We cannot possibly evaluate the substantive rationality of your\nintention to go to medical school without knowing what information is\navailable to you about these matters. But if you simultaneously intend\nto go to medical school, believe that to do so you must take the\nentrance exam, and yet do not intend to take the entrance exam, then\nwe can tell that you are structurally irrational, without needing to\nknow this sort of information.\n\nFinally, evaluations of structural rationality may be called\nformal in the sense that we can tell whether combinations of\nattitudes are structurally irrational even when abstracting at least\nsomewhat from their content. So, for example, it’s always\nstructurally irrational to believe \\(p\\) and believe not-\\(p\\), for\nany proposition \\(p\\), regardless of its content. Similarly, the\nmeans-end requirement says (or entails) that it is irrational to\nintend to \\(\\Phi\\), to believe that to \\(\\Phi\\) one must \\(\\Psi\\), and\nnot intend to \\(\\Psi\\), for any actions \\(\\Phi\\) and \\(\\Psi\\),\nregardless of what they are.\n1.3 The Relationship Between Structural and Substantive Rationality\n\nThe distinction between structural and substantive rationality is not\nbeyond dispute. Some hold that it does not bear scrutiny. Moreover,\nthose who accept the distinction hold competing views on its\nsignificance as well as on the relation between substantive and\nstructural rationality.\n\nFirst, there are those who identify rationality simpliciter\nwith structural rationality (Scanlon 1998; Broome 2013, 2020; Ridge\n2014: ch. 8). Such philosophers deny that what others call\n‘substantive rationality’ is genuinely a kind of\nrationality at all: they hold that the requirements of structural\nrationality exhaust the requirements of rationality\nsimpliciter. It is debatable to what extent this dispute is\nmerely terminological or substantive. These philosophers don’t\ndeny that there is an important normative notion – viz.\n‘ought’ or ‘most reason’ – that can be\nunderstood in terms of what one’s reasons, on balance, support.\nBut they want to withhold the label ‘rationality’ from\nit.\n\nOne argument for withholding the label ‘rationality’ from\n(what we’ve called) substantive rationality proceeds from the\npurported conceptual constraint that rationality supervenes on the\nmind: there can be no change in whether an agent counts as rational\nwithout a change in her mental states (Wedgwood 2002; Broome 2013,\n2020). It then holds that reasons do not supervene on the mind:\none’s reasons can change without one’s mental states\nchanging. Thus, it is concluded, rationality cannot require us to\ncorrectly respond to our reasons. The argument can be supported by\nintuitions about cases. In a famous case (Broome 2007a), Lois has a\npiece of fish in front of her, which unbeknownst to her, contains\nsalmonella. The fact that the fish contains salmonella is a decisive\nreason for Lois not to eat it; yet, since Lois is unaware of this\nreason, she cannot be irrational for failing to respond to it.\nArguably, it is precisely because rationality supervenes on the mind\nthat Lois cannot be irrational for failing to respond to a reason that\nshe is entirely unaware of.\n\nDefenders of the notion of substantive rationality reply that the\nnotion of ‘reasons’ at work in the conception of\nrationality as reasons-responsiveness is in some important way\nconstrained by the agent’s epistemic position (Kiesewetter 2017;\nLord 2018). Perhaps, for example, substantive rationality requires us\nto respond only to the reasons that our evidence makes available to us\n– often called “available” or\n“possessed” reasons. If this is so, then eating the fish\nmay well be substantively rational for Lois. Moreover, while\nunpossessed reasons do not supervene on the mind, it is less clear\nthat the same is true for possessed reasons. Thus, the rational\nrequirement to correctly respond to these reasons may be compatible\nwith the supervenience of rationality on the mind (Kiesewetter\n2020).\n\nIt is also worth noting that the proposal that rationality\nsimpliciter is just structural rationality is much less\npopular in epistemology than it is in ethics and the practical\nrationality literature (Worsnip 2016b). In epistemology, it is\northodoxy that agents who fail to respond to their evidential reasons\nfor belief thereby fail to be\n rational,[3]\n and thus that there are rational requirements of\nreasons-responsiveness – i.e. requirements of substantive\nrationality. By contrast, purely coherentist theories of epistemic\nrationality – which effectively identify epistemic rationality\nwith a kind of structural rationality – are now widely\nrejected.\n\nA second view about the relationship between structural and\nsubstantive rationality contends that these two notions of rationality\nultimately come to the same thing (Wedgwood 2017; Smithies,\nforthcoming). This position can be motivated in part by taking on\nboard the aforementioned point that substantive rationality requires\nus only to respond to those reasons that our evidence makes available\nto us. Putting this together with the claim that our evidence consists\nin or at least supervenes on our mental states, it can be argued that\nthe rational requirement to respond to our evidentially available\nreasons is itself a requirement to ensure a kind of coherence between\nour mental states, in a broad sense of ‘coherence’. Thus,\nit is argued, the distinction between substantive rationality (viz.\nreasons-responsiveness) and structural rationality (viz. coherence)\nbreaks down.\n\nDefenders of the structural-substantive distinction respond that the\nnotion of (in)coherence that we should employ in order to understand\nstructural rationality is narrower than the one needed to break the\ndistinction down (Fogal and Worsnip 2021). Consider someone who has a\nbelief that is insufficiently supported by her (available) evidence:\nsay, she believes that the Orioles will win today’s baseball\ngame, when her (available) evidence doesn’t, in fact, give her\nsufficient grounds for thinking this. Suppose, however, that she holds\nher belief not in knowing defiance of her evidence, but rather because\nshe simply mistakenly overestimates the probative strength of her\nevidence. In this case, she has a belief that is insufficiently\nsupported by her (available) evidential reasons, and thus fails to be\nsubstantively rational. Yet it is only in a very broad sense of\n‘incoherent’ that she is incoherent. In a narrower sense\nof ‘incoherent’, she need not be incoherent: as long as\nshe does not recognize what her (available) reasons support believing,\nthere seems to be no internal clash between her attitudes here. This\nnarrow sense of ‘incoherent’ – it is held – is\nthe one relevant for structural rationality. This position can be\nbolstered by appeal to the central characteristics of structural\nrationality identified in §1.2 above. The judgment that there is\na rational shortcoming involved in believing that the Orioles will win\ntoday depends on substantive judgments about reasons, and the\ncircumstances and evidence of the agent. Moreover, this rational\nshortcoming isn’t an instance of a more general pattern of\nirrationality that can be identified in abstraction from the content\nof the attitude involved. Additionally, the narrower sense of\n(in)coherence relevant for structural (ir)rationality is held to\nobtain only between what Scanlon (1998, 18ff.) has called\n“judgment-sensitive attitudes”, such as beliefs and\nintentions, and cannot involve other mental states such as\nperceptions, which are not responsive to judgment or reasoning. Thus,\nto have beliefs that are out of whack with one’s perceptual\nevidence will not be incoherent in this narrower sense, nor\nstructurally irrational.\n\nA third set of views holds that, though substantive and structural\nrationality can be intelligibly distinguished, one is reducible to the\nother. Some hold that structural rationality can be reduced to\nsubstantive rationality (Kiesewetter 2017; Lord 2018; Henning 2018;\nLasonen-Aarnio 2021; see also Singh forthcoming). One way of effecting\nthis reduction is via the claim that what it is to be structurally\nirrational is to have a combination of attitudinal mental states such\nthat it is guaranteed that, whatever one’s situation\n(and thus, one’s reasons) is like, at least one of the mental\nstates fails to be substantively rational (Kiesewetter 2017:\n235–39; see also Kolodny 2007a and 2008 and Lord 2018 for\nrelated ideas). For example, it seems plausible that whatever\none’s situation (and thus, one’s reasons) is like,\none’s evidence can never sufficiently support both believing\n\\(p\\) and believing not-\\(p\\). If this is so, then to believe \\(p\\)\nand believe not-\\(p\\) is to have a combination of attitudinal mental\nstates such that it is guaranteed that, whatever one’s situation\nis like, at least one of these mental states fails to be substantively\nrational. Similarly, it might be thought, one’s reasons could\nnever support intending an end and believing that a means is\nnecessary for that end, while also supporting not intending\nthe means; and this is what makes the combination structurally\nirrational. Notice that this view is not one on which structural and\nsubstantive irrationality turn out to be the same property: having\nattitudes that guarantee a failure to respond correctly to one’s\nreasons (structural irrationality) is a stronger property than merely\nhaving failed to respond correctly to one’s reasons (a failure\nof substantive rationality). It thus accommodates the natural idea\nthat structural rationality involves a distinct kind of failure.\n\nCritics of this view push back in a number of ways, but perhaps the\nmost common response is to point to cases where jointly incoherent\nattitudes are individually permitted by one’s reasons (Broome\n2013: 85–6; Way 2013). For example, suppose that your evidence\nindicates that to go to the supermarket, you must get on your bike\n(thus permitting, or perhaps even requiring, belief in this\nproposition). And suppose that your reasons permit, but don’t\nrequire, you to go to the supermarket. In that case, it seems like\nyour reasons permit, but don’t require, you to get on your bike.\nIn that case, neither the intention to go to the supermarket, nor the\nbelief that to do so you must get on your bike, nor the absence of an\nintention to get on your bike, fails to be substantively rational. Yet\nit seems that the three are still structurally irrational in\ncombination. If this is right, then the structural irrationality of\nsome combination of attitudes is not a guarantee that at least one of\nthe attitudes fails to be substantively rational. Similarly, perhaps\nthere are permissive cases with respect to one’s doxastic\nattitudes (Ballantyne and Coffman 2011; Schoenfield 2014). For\nexample, perhaps your evidence can permit a credence of 0.6 for \\(p\\),\nbut also permit a credence of 0.61 for \\(p\\). Correspondingly, then,\nit permits a credence of either 0.39 or 0.4 for not-\\(p\\). In that\ncase, neither a credence of 0.61 for \\(p\\) nor a credence of 0.4 for\nnot-\\(p\\) fails to be substantively rational. Yet the combination of\nthe two is structurally irrational (Staffel 2020).\n\nVarious strategies have been proposed to deal with this challenge.\nKolodny (2011) and Lord (2018: Ch.2) both suggest that the adoption of\nan intention can alter one’s reasons to take the means,\nrendering a means-intention that was merely permitted prior to the\nadoption of the end-intention, substantively required (an analogous\nstory about credences is suggested in Lord 2020). Drawing on work by\nBratman (1987), Kiesewetter (2017: Ch. 10) argues that in cases of\nmerely permissible ends, means-end incoherent agents will flout\neconomical reasons because maintaining intentions that one\nwill not carry out makes one susceptible to waste resources. With\nrespect to doxastic incoherence, it is also an option to reject the\nkind of permissivism that is in conflict with explaining structural\nirrationality in terms of substantive requirements of rationality\n(e.g., White 2005, Schultheis 2018). On one alternative view,\nsubstantive epistemic rationality permits us to have imprecise\ncredences rather than several precise credences that are\nprobabilistically incoherent.\n\nOther philosophers can be understood as pursuing a reduction in the\nopposite direction: that is, a reduction of substantive rationality to\nstructural rationality. For example, some hold that what it is to have\na reason to \\(\\Phi\\) is to be such that, were one’s\nmental states to be corrected for structural irrationality, one would\nbe motivated to \\(\\Phi\\) – or desire to \\(\\Phi\\), or intend to\n\\(\\Phi\\), or similar (Smith 1994; Markovits 2014). Such accounts of\nreasons are often called “idealized attitudes” accounts.\nIf reasons can be reduced to facts about structural rationality, this\nplausibly provides the materials to reduce substantive rationality\n(itself understood in terms of reasons-responsiveness) to facts about\nstructural rationality too. However, idealized attitudes accounts of\nreasons have been subjected to numerous objections (see e.g. Enoch\n2005). One important objection in the present context is that it is\nquite unclear how to generalize this view to reasons for (and thus,\nthe substantive irrationality of) belief (Cuneo 2007: ch. 7). Another\nis that, since there is typically more than one way to correct for\nstructural irrationality, such views will leave it radically\nindeterminate what our reasons are, or perhaps generate reasons for\nalmost anything (Sampson 2021).\n\nFourth, and finally, some philosophers hold that substantive and\nstructural rationality are both equally genuine kinds of rationality\nand that neither is reducible to the other (Worsnip 2021). Such views\nowe us an account of how, if at all, these two kinds of rationality\nrelate to one another: for example, can they come into conflict with\none another? If substantive rationality often recommends one thing and\nstructural rationality recommends another, this may seem\ndissatisfying, especially if there is nothing to be said about which\ndemand takes rational precedence. Indeed, some may think the prospect\nof structural and substantive rationality conflicting shows that they\ncan’t both be bona fide sources of rational requirements.\n\nHowever, it’s worth noting that the extent of any conflicts\nbetween structural and substantive rationality depends on the positive\ntheory of structural rationality that we adopt. On a\n“wide-scope” view about structural rationality (see\n§2.1 below), its requirements are merely negative, prohibiting\nincoherent combinations of attitudes, and one can come to satisfy the\nrelevant requirement by revising any of the incoherent\nattitudes. If this is so, it reduces the potential for conflicts\nbetween substantive and structural rationality. This is because, on\nthis view, structural rationality simply tells one that one should\nrestore coherence in some way when one is incoherent, and\nthis leaves room for substantive rationality to (sometimes) determine,\nmore specifically, which way to do so. For example, consider\nagain Ali, who believes that he is Superman and that Superman can fly.\nIf Ali’s evidence is normal, substantive rationality prohibits\nAli from believing he can fly. Does structural rationality require him\nto believe he can fly? Not obviously: it might permit him instead to\nrevise one of his original beliefs, requiring only that he\neither believe he can fly or revise one of these\noriginal beliefs. Some have argued, however, that conflicts between\nsubstantive and structural rationality can arise in subtler ways in\nspecial cases (Worsnip 2018a).\n1.4 Instances of Structural (Ir)rationality: An Inventory\n\nSo far, we’ve focused mostly on inconsistent beliefs and\nmeans-end incoherence as paradigm instances of structural\nirrationality. But there are many other putative instances. Any\nparticular instance will be controversial, since it is always up for\ndebate whether some combination of mental states really is\nstructurally irrational. And it is not feasible to be completely\ncomprehensive in identifying all the candidate instances. But we will\ndraw attention to some of the (patterns of) combinations of states\nthat are among the most plausible candidates.\n\nLet’s begin with some combinations of doxastic states that are\nplausibly structurally irrational. Along with strictly contradictory\nbeliefs – i.e., a belief in \\(p\\) and a belief in not-\\(p\\)\n– it is often thought that other logically inconsistent sets of\nbeliefs are structurally irrational. For example, as mentioned\nearlier, it seems structurally irrational for Ali to believe he is\nSuperman, believe that Superman can fly, and yet believe that he\ncannot fly. More strongly, some have thought that it is structurally\nirrational to fail to believe the logical entailments of one’s\nbeliefs – so that Ali would be irrational were he to believe\nthat he is Superman, believe that Superman can fly, and merely\nfail to believe that he himself can fly. The requirement that\none believes the logical entailments of one’s beliefs is often\ncalled ‘deductive closure’.\n\nHowever, there are thorny issues about whether all instances\nof inconsistency, or of failing to believe the logical entailments of\none’s beliefs, involve irrationality. First, it is not clear if\nthis is so when the relevant inconsistency or entailment is extremely\nsubtle and would take a complex logical proof to detect (Broome 2013:\n154–5). Second, it is not clear that we are irrational for\nfailing to clutter our minds with the infinite trivial consequences of\nour existing beliefs (Harman 1986: 12). In response to the first\nproblem, some say that structural irrationality obtains only when one\nrecognizes the relevant inconsistency or entailment\n(Sainsbury 2002). In response to the second, some say that, where\n\\(q\\) is some consequence of one’s existing beliefs, one needs\nto care about whether \\(q\\) (Broome 2013) or attend to \\(q\\) to be\nstructurally irrational for failing to believe \\(q\\). However, these\nrestrictions do not deal with all purported cases of rational\ninconsistency. For example, the preface paradox (Makinson 1965) is a\nplausible case of rational but inconsistent beliefs (see esp.\nChristensen 2004). In this case, an author writes a book containing a\nnumber of claims, but modestly affirms in the preface that doubtless,\nthe book contains errors – i.e., that at least one of the claims\nin the book is false. This total set of beliefs – the claims in\nthe book, plus the preface claim – is inconsistent, but\narguably, it is not irrational to hold these beliefs – even if\none recognizes the inconsistency, and attends to and cares about the\nrelevant beliefs. While some (MacFarlane 2004 – see Other\nInternet Resources) hold that this is a case where substantive and\nstructural rationality conflict, others (Worsnip 2016a) have argued\nthat the inconsistent beliefs in these cases are not even\nstructurally irrational.\n\nIt is also widely held that agents can be structurally irrational in\nvirtue of the ways that their first-order beliefs combine with their\nhigher-order beliefs: that is, with beliefs about the normative status\nof their first-order beliefs, or about their evidence for them. For\nexample, it’s often thought to be structurally irrational to\nbelieve \\(p\\) while also believing that one’s evidence does not\nadequately support \\(p\\) – or to fail to believe \\(p\\) while\nalso believing that one’s evidence decisively supports \\(p\\)\n(see, among many others, Kolodny 2005; Feldman 2005; Titelbaum 2015).\nSuch combinations of states are sometimes described as\n“epistemically akratic” (Horowitz 2014; Greco 2014). While\nsome deny that such states must be irrational on the grounds that they\ncan be rational in cases of misleading higher-order evidence (Coates\n2012; Lasonen-Aarnio 2020), others think that it is at most\nsubstantively rational, but not structurally rational, to be\nepistemically akratic in such cases (Worsnip 2018a).\n\nMany of the kinds of irrationality pinpointed by formal\nepistemologists, which typically pertain to credences rather than to\nfull belief, can also be plausibly regarded as structural. For\nexample, (most) failures to conform one’s credences to the\naxioms of probability – such as the aforementioned case of\nassigning credence 0.6 to \\(p\\) and credence 0.41 to\nnot-\\(p\\) – are plausibly structurally irrational.\nSomewhat more controversially, failing to update one’s credences\nvia conditionalization might be viewed as a kind of structural\nirrationality between one’s prior and posterior credences. The\nlatter case is more controversial, because this kind of\n“incoherence” is typically understood as diachronic,\nwhereas some think that structural irrationality is a synchronic\nphenomenon (see §2.3). Consequently, viewing it as a kind of\nincoherence either requires us to pinpoint some kind of synchronic\nfailure that occurs when one fails to conditionalize properly, or to\nallow for diachronic instances of structural irrationality.\n\nLet’s now turn to forms of structural irrationality that (at\nleast partly) involve non-doxastic states. One paradigmatic example of\nstructural irrationality that we’ve already mentioned is\nmeans-end incoherence (also known as ‘instrumental\nirrationality’, though this term is sometimes used with other\nmeanings; see also the entry on\n instrumental rationality),\n whereby one intends to \\(\\Phi\\), believes that in order to \\(\\Phi\\)\none must \\(\\Psi\\), but does not intend to \\(\\Psi\\). Besides this,\nperhaps the most common example of structural irrationality involving\nnon-doxastic states is practical akrasia – believing one ought,\nall things considered, to \\(\\Phi\\) but not intending to \\(\\Phi\\) (see,\namong many others, Broome 2001b, 2013; Kolodny 2005; for dissent, see\nArpaly 2000). Notably, this form of structural irrationality (as well\nas means-end incoherence) involves incoherence between a belief and an\nintention (or lack of), thus bridging doxastic and conative states.\nAnother example of a form of incoherence that bridges doxastic and\nconative states might be intending to do something that one believes\none cannot do.\n\nThere are also plausible examples of structural irrationality that\nobtain solely between conative states. It’s often held that it\nis structurally irrational to have contradictory intentions –\nthat is, to intend to \\(\\Phi\\) and intend not to \\(\\Phi\\). And as in\nthe doxastic case, there are forms of incoherence studied by\nformally-inclined philosophers (and economists) that are naturally\nthought of as instances of structural irrationality – such as\nhaving cyclical preferences, whereby one prefers \\(A\\) to \\(B\\),\nprefers \\(B\\) to \\(C\\), and yet prefers \\(C\\) to \\(A\\) (Davidson,\nMcKinsey and Suppes 1955; Gaus 2008: 36–40).\n\nFinally – though this is understudied – there may be forms\nof structural irrationality that involve affective and emotional\nstates (see also the entry on\n emotion,\n section 10). For example, perhaps it is structurally irrational to\nhope for something that one believes to be bad, or to fear something\nthat one believes to be good. And perhaps it is also irrational to\nhope for or fear something that one believes to be\nimpossible.\n1.5 The Unity of Structural Rationality\n\nAs the above list makes clear, the instances of structural\nirrationality are a diverse bunch. One may reasonably wonder what, if\nanything, all these instances have in common. Some (e.g. Broome 2013)\nseem to think that it is enough simply to say that they are all\ncombinations of states that are jointly irrational, but others aspire\nto identify something deeper in virtue of which they share this\nproperty.\n\nOne way of trying to do this is to embrace the reductivist view\nmentioned in §1.3 above. On this view, what structurally\nirrational states have in common is that they are all combinations of\nattitudes that cannot simultaneously be supported by one’s\nreasons. However, as we saw, this view faces some important\nchallenges, such as accounting for the structural irrationality of\nsets of individually permissible attitudes. (It’s worth noting\nthat there is another family of views that also, in a different way,\ntries to explain structural rationality in terms of reasons. On these\nviews, what unifies structurally irrational states is that they\ninvolve the agent’s going against her beliefs about\nreasons (“transparency” accounts), or her apparent reasons\n(“apparent reasons accounts”). We discuss these views, and\nproblems with them, in §3.3.)\n\nIn a similar but somewhat different vein, some explore the idea that\nattitudes are structurally irrational just in case they can’t\nall “succeed”, or fulfil their “aim”, where\nthis might be truth for beliefs and satisfaction or correctness for\nintentions or preferences (Fink forthcoming; Fullhart and Martinez\nforthcoming; see also Gibbard 2003; Brunero 2020: Ch. 7; Rosa 2022;\nSingh forthcoming). However, this proposal struggles to explain the\nincoherence of other mental states, such as credences. It is also far\nfrom obvious that akratic attitude combinations cannot be jointly\nsuccessful – after all, the beliefs involved in epistemic\nakrasia are logically consistent, and it is possible for a belief that\none ought to \\(\\Phi\\) to be true even if the corresponding intention\nis not satisfied. Proponents of this view are thus pressed to either\naccept certain revisionary implications, to introduce more substantive\nand hence more controversial success conditions for attitudes, or to\ngive up the ambition to provide a fully unifying account of structural\nirrationality.\n\nAnother at least partially unifying proposal is\n“cognitivism”, which aspires to reduce certain structural\nrequirements governing intention (such as that of means-end coherence)\nto certain structural requirements governing belief (such as that of\ndeductive closure) (Harman 1976; Velleman 1989; Wallace 2001; Setiya\n2007). This view is premised on a corresponding cognitivism about\nintention, on which, roughly, intending to \\(\\Phi\\) involves believing\none will \\(\\Phi\\). Given this, failures of means-end coherence (for\nexample) arguably result in one’s violating closure –\nspecifically, violating a modus ponens requirement by believing one\nwill \\(\\Phi\\), believing that one will \\(\\Phi\\) only if one\n\\(\\Psi\\)-s, but not believing that one will \\(\\Psi\\). As cognitivists\nrecognize (Setiya 2007), their account must be complicated or\nsupplemented to deliver this result. This is because even if intending\nto \\(\\Phi\\) involves believing that one will \\(\\Phi\\), it\ndoesn’t follow that not intending to \\(\\Psi\\) involves\nnot believing that one will \\(\\Psi\\) (perhaps one believes\nthat one will unintentionally \\(\\Psi)\\). Moreover, the view that an\nintention to \\(\\Phi\\) involves believing one will \\(\\Phi\\) has been\ncriticized (e.g., Bratman 2009a). Further, even if cognitivists are\nright to think that means-end incoherence necessarily involves\ndoxastic incoherence, there are reasons to think that the former\ninvolves a distinctively practical mistake that cannot be reduced to a\nmistake in one’s cognitive attitudes (e.g., Brunero 2020: Ch.\n6). And finally, in our context, it is an open question whether\ncognitivism can be a fully unifying theory of structural rationality,\nas it is unclear how, for example, practical akrasia can be understood\nas a violation of a purely doxastic structural requirements, or how\ncognitivism delivers unity within the class of doxastic\nstructural requirements.\n\nA proposal put forward by some formally-inclined philosophers is that\nstructurally irrational states are those that make one exploitable to\nloss through devices such as Dutch books or money\n pumps.[4]\n However, again, this proposal seems insufficiently general to capture\nall instances of structural irrationality: for example, there is no\nobvious way in which someone with (either epistemically or\npractically) akratic states is vulnerable to such loss. Moreover, even\nwhere structural irrationality and exploitability coincide, it is\ndubious whether it is the latter that explains the former, rather than\nvice versa. Numerous philosophers have argued that one’s\nsusceptibility to Dutch books or money pumps merely reflects\nor brings out one’s irrationality, rather than\ngrounding or explaining it, since it is unclear why vulnerability to\npurely hypothetical monetary loss (that can only be exacted by someone\nwith full knowledge of one’s mental states, and is almost\ncertain not to actually occur) is the right sort of thing to\nmake one irrational (Lewis 1999: 404–5; Christensen\n2004: 109–24; Gaus 2008: 39; Levy 2014: 2).\n\nFinally, it has recently been proposed that structurally irrational\nstates are unified by the fact that it is in some way difficult to\nsustain them in full, reflective self-knowledge. On one version of\nthis proposal (Worsnip 2018b), this is because it is constitutive of\nthe mental states involved that to genuinely count as having these\nstates, one must have some disposition to revise them when these\nconditions of “full transparency” are met. For example, if\none believes that to go shopping today one must get on one’s\nbike now, and does not intend to get on one’s bike now, and one\nis fully and consciously aware of both of these states and has no\ndisposition to revise them, then one arguably does not count as\nintending to go shopping today (cf. also Finlay 2009; Lee 2022).\nAgain, though, this proposal faces some challenges. In particular, it\nseems to force us to choose between denying that completely clear-eyed\npractical akrasia is possible and denying that practical akrasia is\nstructurally irrational. It may also struggle with examples of\nindividuals who hold logically inconsistent or even contradictory\nbeliefs but are not disposed to revise them because they subscribe to\nnon-classical logics.\n2. Requirements of Structural Rationality\n\nA common assumption in the literature on structural rationality is\nthat agents have the property of being structurally rational or\nirrational in virtue of satisfying or violating certain norms or\nrequirements of structural rationality (see esp. Broome 2013: Ch. 7).\nThis section is concerned with various disputes surrounding such\nstructural requirements. §§2.1–2.4 address questions\nabout the general form of structural requirements, while §2.5 is\nconcerned with skepticism about structural requirements and with\napproaches to structural rationality that dispense with structural\nrequirements. These disputes are important for anyone who aspires to\nspell out a theory of structural rationality. They are also – as\nwe’ll see in §3 – relevant for debates about the\nnormativity of rationality.\n2.1 Wide- vs. Narrow-Scope Requirements\n\nThe most widely debated – and arguably most important –\nquestion about the form of structural requirements of rationality is\nwhether these requirements take wide scope (e.g. Broome 1999; Wallace\n2001; Bratman 2009b) or narrow scope (e.g. Korsgaard 1997; Schroeder\n2004; Kolodny 2005). To explain this distinction, recall that\nstructural irrationality involves (at least in the vast majority of\ncases) a tension between at least two attitude-states (where an\nattitude-state might consist in either the presence or the absence of\nan attitude). For example, akrasia involves a tension between a belief\nto the effect that one ought to \\(\\Phi\\) \\([\\rBO\\Phi]\\) and the lack\nof an intention to \\(\\Phi\\) \\([\\rI\\Phi].\\) On the received view,\nhaving this combination of attitude-states is irrational in virtue of\nviolating a requirement of structural rationality. And on a prima\nfacie natural interpretation of such requirements, these\nrequirements are conditional on one (or more) of the relevant\nattitude-states (the “antecedent state(s)”) and take scope\nover some other attitude-state (the “consequent state”).\nThus, for example, a natural way to understand what Broome (2013) has\ndubbed the “enkratic requirement” – the requirement\nprohibiting akrasia – is as follows:\n\nEnkratic requirement, narrow-scope:\n\nIf \\(A\\) believes that she ought to \\(\\Phi\\), then rationality\nrequires \\(A\\) to intend to \\(\\Phi\\) \\([\\rBO\\Phi \\to\n\\rR(\\rI\\Phi)].\\)\n\nAs several authors have emphasized, however, structural requirements\ncan also be understood in a different way (Hill 1973; Greenspan 1975;\nDancy 1977; Darwall 1983; and, more recently, Broome 1999, 2007c,\n2013; Wallace 2001; Bratman 2009b; Brunero 2010, 2020; Way 2011).\nAccording to this alternative reading, structural requirements are not\nconditional on the antecedent state; instead, both the antecedent and\nthe consequent state are part of the scope of requirement, which is\nwhy this is called a ‘wide scope’ reading. In case of the\nenkratic requirement, this interpretation says:\n\nEnkratic requirement, wide-scope:\n\nRationality requires of \\(A\\) that [if \\(A\\) believes that she ought\nto \\(\\Phi\\), then \\(A\\) intends to \\(\\Phi\\)]\n\\([\\rR(\\rBO\\Phi\\to\\rI\\Phi)]\\).\n\nTo illustrate the relevance of this distinction and the ways in which\nthe two requirements have different consequences, consider Ava, an\nenvironmentalist activist who has gone astray and formed the belief\nthat she ought to extinguish all human life. The narrow-scope and\nwide-scope enkratic requirements will have different results for our\nverdicts about Ava along two dimensions: symmetry and\ndetachment.\n\nBeginning with symmetry: Ava can comply with the wide-scope enkratic\nrequirement in one of two ways: either by coming to intend to\nextinguish human life or by dropping her belief that she ought to\nextinguish human\n life.[5]\n Conversely, she can comply with the narrow-scope enkratic requirement\nonly by coming to intend to extinguish human life. In this sense, the\nwide-scope requirement is symmetric while the narrow-scope\nrequirement is asymmetric. Strikingly, this difference has\nbeen employed as part of arguments for both the wide-scope\nand narrow-scope views. Wide-scopers claim that symmetry is desirable\nbecause it would not be irrational in any good sense for Ava to drop\nher misguided belief instead of coming to intend to extinguish human\nlife (Broome 1999; Worsnip 2021). Narrow-scopers, by contrast, charge\nthat symmetry is undesirable because there is an important difference\nbetween forming an intention on the basis of a normative\nbelief and dropping a normative belief merely on the basis of\nan absence of an intention to follow through on it: the former process\nseems in some way more rational than the latter (Schroeder 2004, 2009;\nKolodny 2005; Bedke 2009; Finlay 2010). Whether this latter charge is\na compelling argument against the wide-scope view depends in large\npart on whether structural requirements such as the enkratic\nrequirement should reflect facts about which states it is rational to\nbase on which: Kolodny (2005) argues that they must, while\nmany wide-scopers (Way 2011; Brunero 2012; Broome 2013) hold that they\ndo not, maintaining that there are independent “basing\nprohibitions” and “basing permissions” that account\nfor the rationality of basing in particular.\n\nLet’s now consider detachment. Consider the inference:\n\n(1a)\n\\(\\rBO\\Phi\\to \\rR(\\rI\\Phi)\\)\n(2)\n\\(\\rBO\\Phi\\)\nSo,\n \n(3)\n\\(\\rR(\\rI\\Phi)\\)\n\n\nThis inference-pattern is valid via modus ponens. Applied to\nthe case of Ava, this means that we can derive (or\n“detach”) a requirement for Ava to intend to extinguish\nhuman life (3) from the narrow-scope enkratic requirement (1a) and the\npremise that Ava believes that she ought to extinguish human life (2).\nThe wide-scope account avoids this implication, for the following\ninference is not validated by the propositional calculus:\n\n(1b)\n\\(\\rR(\\rBO\\Phi\\to\\rI\\Phi)\\)\n(2)\n\\(\\rBO\\Phi\\)\nSo,\n \n(3)\n\\(\\rR(\\rI\\Phi)\\)\n\n\nHence, the conclusion that Ava is rationally required to intend to\nextinguish all human life (3) does not obviously follow from the\nwide-scope enkratic requirement (1b) and the premise that Ava believes\nthat she ought to extinguish all human life (2). In order for this\ninference to be valid, the deontic logic of rational requirements\nwould need to contain the following axiom:\n\nFactual detachment:\n\nIf \\(p\\), and rationality requires of \\(A\\) that \\(p\\to q,\\) then\nrationality requires of \\(A\\) that \\(q\\).\n\nBut this principle is questionable and widely rejected (see esp.\nBroome 1999).\n\nSome philosophers (e.g., Broome 1999; Bratman 2009b) take the fact\nthat narrow-scope requirements detach while wide-scope requirements do\nnot as a point in favor of the wide-scope requirement. Suppose that we\nhave derived the conclusion that Ava is rationally required to intend\nto extinguish all human life from the narrow-scope enkratic\nrequirement via modus ponens. If we add the further premise that\nrationality is normative (see §3 below) in the sense that we\nought (or have reason) to comply with structural requirements, we are\nforced to conclude that Ava ought (or has reason) to intend\nto extinguish all human life – simply because she has adopted a\ncrazy belief. But this kind of “bootstrapping” is widely\nregarded as unacceptable (recall §1.1). Thus, if rationality is\nnormative, this seems to tell against the narrow-scope view.\n\nIt is worth noting that the issues of symmetry, detachment, and\nbootstrapping arise with regard to the scope of all structural\nrequirements on attitude-combinations, including those that concern\nonly doxastic states. For one example, take the aforementioned\n(putative) requirement forbidding “epistemic akrasia”,\nwhich requires alignment between one’s higher-order and\nfirst-order doxastic states. Suppose Darren believes that his evidence\nsupports believing that the earth is flat. Again, a narrow-scope\nversion of an anti-epistemic akrasia requirement seems to allow us to\ndetach the conclusion that (structural) rationality requires Darren to\nbelieve that the earth is flat. Wide-scopers will complain that this\nis incorrect, since structural rationality should at least permit\nDarren to instead drop his higher-order belief that the evidence\nsupports believing that the earth is flat (i.e., the requirement\nshould be symmetrical). Moreover, they will say, it is particularly\nobjectionable when paired with the thesis that rationality is\nnormative, since this would allow us to conclude that Darren can make\nit the case that he ought or has reason to believe the earth is flat\nmerely by (unjustifiably) believing that this is what his evidence\nsupports (i.e., would license problematic bootstrapping). On the other\nhand, narrow-scopers will charge that it is more rational to come to\nbelieve \\(p\\) on the basis of a belief that one’s\nevidence supports \\(p\\) than to drop a belief that one’s\nevidence support \\(p\\) on the basis of a mere absence of\nbelief in \\(p\\). Or consider the requirement to respect modus\nponens, and our aforementioned character Ali, who believes he is\nSuperman and that Superman can fly. Wide-scopers will hold that\nstructural rationality should at least permit Ali to drop his belief\nthat he is Superman rather than come to believe he can fly. In\naddition, they will stress that any view that yields the conclusion\nthat Ali can make it the case that he ought or has reason to believe\nhe can fly merely by holding the beliefs that he is Superman and that\nSuperman can fly must be rejected. By contrast, narrow-scopers will\nhold that it is more rational to come to believe \\(q\\) on the basis of\nbelief in \\(p\\) and belief that if \\(p\\) then \\(q\\) than it is to give\nup one’s belief in \\(p\\) or one’s belief that if \\(p\\)\nthen \\(q\\) on the basis of a mere absence of belief in \\(q\\)\n(as distinct from a positive belief that not-\\(q)\\). (For reasons of\nbrevity, we will focus on the practical enkratic requirement in the\nremainder of this section, but as with this subsection, the same\npoints apply to other structural requirements, including those that\nconcern only doxastic states.)\n\nThe wide-scope account has sometimes been charged with assuming a\nmistaken semantic view, namely that ordinary conditionals of\nthe form “If you \\(\\Phi\\), you ought to \\(\\Psi\\)” are to\nbe read as really expressing the wide-scope requirement that you ought\nto be such that (if you \\(\\Phi\\), then you\n \\(\\Psi)\\).[6]\n Many philosophers of language reject this “wide-scope\nsemantics” (Hansson 1969, van Fraassen 1972, Lewis 1973, Kratzer\n1981; for applications to contemporary debates about rationality, see\nDreier 2009, Schroeder 2011, Dowell 2012, Silk 2014). In response,\nwide-scopers can make two points (Kiesewetter 2017: Ch. 3; Worsnip\n2021: Chs. 6–7). First, they can maintain that while the\nfundamental explanation of structural irrationality is provided by\nwide-scope requirements, the semantics of ordinary conditionals is a\ndifferent matter. For example, Worsnip (2021: Ch. 7) combines the\nwide-scope view of structural requirements with a more orthodox,\ncontextualist account of ordinary deontic conditionals along the lines\nof Kratzer (1981). Second, they can point out that the spirit of the\nwide-scope view can be maintained without stating structural\nrequirements as involving conditionals at all. The relevant\nrequirements can instead be understood as requiring disjunctive\nresponses or as prohibitions on combinations of responses. For\nexample, the wide-scope enkratic requirement can be formulated in\neither of the following two ways:\n\nEnkratic requirement, disjunctive:\n\nRationality requires \\(A\\) to [intend to \\(\\Phi\\) or not believe that\nshe ought to \\(\\Phi\\)].\n\nEnkratic requirement, combination prohibition:\n\nRationality requires \\(A\\) to not [believe that she ought to \\(\\Phi\\)\nand not intend to \\(\\Phi\\)].\n\nThese requirements are symmetric and do not allow for detachment; they\nthus share with the original wide-scope formulations the properties\nthat distinguish them from narrow-scope requirements.\n2.2 Synchronic vs. Diachronic Requirements\n\nAs we have discussed them so far, structural requirements do not index\nattitude-states to time points and are thus open to two\ninterpretations. On the synchronic interpretation, all the\nattitude-states are indexed to the same point in time, while on a\ndiachronic interpretation, the attitude-states are indexed to\ndifferent time points or periods. For example, the narrow-scope\nenkratic requirement (§2.1) may be understood in either of the\nfollowing ways:\n\nEnkratic requirement, narrow-scope + synchronic: If \\(A\\)\nbelieves at \\(t\\) that she ought to \\(\\Phi\\), rationality requires\n\\(A\\) to intend at \\(t\\) to \\(\\Phi\\).\n\nEnkratic requirement, narrow-scope + diachronic: If \\(A\\)\nbelieves at \\(t_1\\) that she ought to \\(\\Phi\\), rationality requires\n\\(A\\) to intend at \\(t_2\\) to \\(\\Phi\\).\n\nThe literature contains two kinds of arguments for the diachronic\napproach. The first is that only diachronic requirements can guide our\nreasoning going forward (Schroeder 2004; Kolodny 2005). The second is\nthat synchronic requirements cannot accommodate “rational\ndelay” – the assumption that limited beings like us are\nnot rationally criticizable for taking time to adjust their attitudes\nto new circumstances and establish coherence (Kiesewetter 2017:\n62–70; Podgorski 2017).\n\nHowever, it is difficult to spell out diachronic requirements. An\nimportant challenge for any diachronic approach is to specify the\nrelation between \\(t_1\\) and \\(t_2\\). A possible view is that \\(t_2\\)\nis just any time after \\(t_1\\), perhaps even including \\(t_1\\) (Lord\n2014). While this might speak to the guidance-related argument for the\ndiachronic account, it does not seem appropriate as a response to the\nphenomenon of rational delay. And since the length of rational delay\nappears to depend on particular circumstances and individual\nabilities, there is reason to be skeptical that there could be a\nprincipled specification of diachronic requirements that accounts for\nrational delay.\n\nMoreover, if one is persuaded that the wide-scope approach is superior\nto the narrow-scope approach, there are further problems for the\ndiachronic approach, as it is debatable whether the diachronic\napproach is consistent with the spirit of the wide-scope approach.\nConsider:\n\nEnkratic requirement, wide-scope + diachronic: Rationality\nrequires \\(A\\) to (not-believe at \\(t_1\\) that she ought to \\(\\Phi\\)\nor intend at \\(t_2\\) to \\(\\Phi)\\).\n\nIf \\(A\\) believes at \\(t_1\\) that she ought to \\(\\Phi\\), then at\n\\(t_2\\) intending to \\(\\Phi\\) is the only way in which \\(A\\) can\nsatisfy this requirement. Thus, a requirement to adopt this intention\ncan plausibly be detached (Broome 2013). This violates the spirit of\nthe wide-scope approach. While other ways of spelling out diachronic\nwide-scope requirements have been proposed, it remains controversial\nwhether they can preserve symmetry and non-detachability without\ncollapsing into their synchronic counterparts (Lord 2014; Reisner\n2009; Kiesewetter 2017: 58–69; Worsnip 2021: 183–7).\n\nWhile there is considerable disagreement about whether all structural\nrequirements are diachronic, it is somewhat less controversial that\nthere are at least some essentially diachronic requirements of\nrationality ­– for example, requirements of attitude\npersistence that prohibit abandoning beliefs or intentions\narbitrarily (Broome 2013; Bratman 2018; Brunero 2022). However, at\nleast in the doxastic realm, some authors have argued that there are\nno diachronic requirements at all (Hedden 2015; Moss 2015).\n2.3 Process vs. State Requirements\n\nWhile most authors take requirements of structural rationality to\ngovern attitude-states, such as beliefs or intentions, some have\nargued that they should rather be understood as requirements on\nprocesses, such as reasoning or, more generally, the forming,\ndropping or retaining of attitudes (Kolodny 2005,\n2007b; Podgorski 2017). Since processes are temporally extended, all\nprocess requirements are diachronic. What is less often recognized is\nthat the reverse is not true: diachronic requirements need not be\nprocess-requirements, since they can govern states at\ndifferent points in time (Podgorski 2017). Thus, the\nsynchronic/diachronic debate is distinct from the process/state\ndebate.\n\nIn support of the process-oriented view, Kolodny (2005) holds that\nrequirements can be response-guiding and potentially normative\n(§2.2) only if they govern processes rather than states. He also\nargues that state-requirements are redundant once all plausible\nprocess requirements have been specified. Critics of the\nprocess-oriented view have responded by drawing an analogy to\nreasons for belief and other attitudes, which can be\nresponse-guiding and normative even though they are for states rather\nthan processes, and have challenged Kolodny’s redundancy claim\n(Kiesewetter 2017: 73–79).\n\nWhile it is very controversial whether all instances of structural\nirrationality can be explained in terms of process requirements, it is\nless controversial that there are process requirements that\ncannot be reduced to state requirements. For example, what seems\nirrational about wishful thinking is not necessarily the belief or the\nwish, or the combination of these states, or their occurrence in a\ncertain chronological order, but specifically the process\nthrough which the belief was formed. More generally, it seems\nplausible that there are basing prohibitions (Broome 2013)\n– rational requirements not to base certain attitudes\non others – which cannot be reduced to state-requirements.\n2.4 Skepticism about and Alternatives to Requirements of Structural Rationality\n\nA number of authors have raised skepticism about structural\nrequirements of rationality. We will distinguish three varieties of\nsuch skepticism.\n\nThe first variety, which we call “impossibilist\nskepticism”, is based on the view that once one specifies\nsufficient conditions for structural irrationality, it turns out to be\nimpossible to violate these conditions. The idea that it is impossible\nto violate at least some putative structural requirements has a long\nhistory: the Socrates of Plato’s Protagoras denies the\npossibility of akrasia (see also Davidson 1969 and the entry on\n weakness of will),\n while other authors have denied the possibility of epistemic\nakrasia specifically (Hurley 1989; Adler 2002), irrational\nself-contradiction (Price 2008), and instrumental irrationality\n(Finlay 2009; Timmermann 2022). Impossibilist skeptics combine the\npremise that the putative structural requirements are inviolable with\nthe further premise (argued for by Korsgaard 1997, among others) that\nany genuine requirement of rationality must leave room for violation,\nto yield the conclusion that the putative structural requirements are\nnot genuine rational requirements after all (Finlay 2009; Lee\n2022).\n\nImpossibilist skepticism entails not only that there are no structural\nrequirements of rationality, but also that there is no such\nthing as a property of structural rationality (understood as a\nproperty that people can fail to have). By contrast, a second kind of\nskepticism, which we call “particularist skepticism”, does\nnot necessarily take issue with this property; it merely denies that\nthe occurrence of structural irrationality can be explained in terms\nof general structural requirements. Proponents of this view\nhold that all general structural requirements prohibiting\nattitude-combinations are subject to counterexamples, for example in\ncases of luminosity failure (i.e. failure to be in a position to know\none’s own attitudes) and cases in which subjects have\nhigher-order beliefs or evidence that conflict with the putative\nrequirement (Fogal 2020; Lasonen-Aarnio 2021).\n\nIn place of the requirements-based approach, particularist skeptics\noffer alternative models. For example, Fogal (2020) suggests a\n“pressure-based” model, on which attitudes exert a\ngradable rational pressure (analogous to the normative pressure of\npro tanto reasons) and the structural rationality or\nirrationality of an attitude depends on the greatest positive or\nnegative rational pressure overall. By contrast, Lasonen-Aarnio (2021)\nproposes to explain the irrationality of incoherence in terms of the\nmanifestation of certain bad dispositions – dispositions that\nconflict with being a competent follower of substantive norms (for a\nsimilar view, see also Raz 2005). Both views avoid a commitment to\ngeneralizable truths to the effect that certain sets of attitudes are\nby themselves sufficient for irrationality.\n\nA third kind of skepticism, which we call “substantivist\nskepticism”, holds that even if extensionally adequate\nformulations of general structural requirements are available, the\nassumption that there are such requirements is dispensable since\nstructural irrationality can be explained in terms of requirements of\nsubstantive rationality\n alone.[7]\n (We mentioned this reductive view already in §1.3.) Proponents\nof substantivist skepticism often hold that we should dispense with\nstructural requirements if we can because they are problematic. For\nexample, some hold that such requirements cannot be normative (see\n§3) but would have to be normative in order to exist at all\n(Price 2008; Kiesewetter 2017: Ch. 2, and Ch. 6 for some additional\nundesirable implications of structural requirements).\n3. The Normative Significance of Structural Rationality\n\nIt is widely held that ascriptions of irrationality involve a certain\nkind of criticism and, thus, that truths about rationality or\nirrationality are, or at least appear to be, normative or normatively\nsignificant (e.g. Parfit 2001; Kolodny 2005; Broome 2007b; Scanlon\n2007). A natural (and dominant) way to spell out this intuition is to\nsay that there necessarily are normative reasons to conform to\nrational requirements. But while it seems evident that there\nnecessarily are reasons to conform to substantive\nrequirements (at least on standard conceptions of substantive\nrationality), it is much less clear why this should be so in the case\nof structural requirements. In this section, we give an overview of\nthe most important challenges for the assumption that there\nnecessarily are reasons to conform to structural requirements and\ndiscuss the major theoretical options that one can adopt with respect\nto the normativity of rationality more generally.\n3.1 Bootstrapping and Detachment\n\nPerhaps the most widely discussed challenge for the normativity of\nstructural rationality is the worry that the assumption of reasons for\nconforming to structural requirements would license implausible forms\nof “bootstrapping” or detachment (see esp. Bratman 1981,\nBroome 2001a, Kolodny 2005, and cf. §1.1 above). As we already\nsaw in §2.1, a narrow-scope account of structural requirements\nplus the assumption that rationality is normative seems to yield\nunacceptable bootstrapping. For example, it suggests that merely by\nbelieving that she ought to extinguish all human life, Ava can\nmake it the case that she ought to, or at least has reason to, intend\nto extinguish all human life. As we again saw in §2.1, some take\nthis as an objection to the narrow-scope view. Others, however, take\nit as an argument that structural rationality cannot be normative\n(Kolodny 2005).\n\nIn support of the latter way of going, some have argued that a\nnormative interpretation of structural requirements licenses\nimplausible detachment even on the wide-scope view. Such arguments\ntypically appeal to certain transmission principles – which are\n(roughly speaking) principles about how reasons are transmitted from\nends to means (see also the entry on\n instrumental rationality,\n section 2). A prominent instance is Raz’s argument against the\nwide-scope instrumental requirement (Raz 2005). The argument is based\non what is sometimes called a “liberal” principle of\nreasons transmission, which says (roughly) that for every means that\nfacilitates or probabilizes doing what we have reason to do, there is\na derivative reason to take this means (Raz 2005; Bedke 2009; Kolodny\n2018). Because wide-scope requirements are symmetric, both dropping\nthe antecedent attitude-state as well as adopting the consequent\nattitude-state are (highly effective) means to conforming to the\nrequirement. Therefore, if there is a reason to conform to wide-scope\nrequirements, it follows from the liberal transmission principle that\nwe can detach a reason to adopt the consequent attitude-state (as well\nas a reason to drop the antecedent attitude-state). Again, we end up\nwith the unwanted result that Ava has a reason to intend to extinguish\nall human life. If this argument is sound, opting for a wide-scope\nrather than a narrow-scope account of structural requirements does not\navoid the problem with detachment. However, some reject the liberal\ntransmission principle on which the argument is based, at least in\nfull generality (Broome 2005; Way 2010; Rippon 2011; Kiesewetter and\nGertken 2021).\n\nA different argument to the effect that even wide-scope normative\nrequirements of structural rationality license implausible detachment\nis based not on the liberal transmission principle, but on the weaker\nprinciple that reasons transmit to necessary means (Setiya\n2007, who partly draws on Greenspan 1975). The problem is that an\nagent may be psychologically incapable of altering one of her\nantecedent attitudes, which renders adopting the consequent attitude a\nnecessary means for conforming to the wide-scope requirement. For\nexample, if Ava is unable to give up her belief that she ought to\nextinguish all human life, then intending to extinguish all human life\nis a necessary means to conforming to the wide-scope enkratic\nrequirement. Thus, if Ava has reason to conform to this requirement,\nthe necessary means transmission principle entails that we can detach\na reason to intend to extinguish all human life once again. As before,\nhowever, some reject the transmission principle on which this argument\nis based (Broome 2013; but see Kiesewetter 2015 for replies). Others\n(Bratman 2009b) have replied to the argument by suggesting that the\ngeneral reason to satisfy structural requirements – which in\nBratman’s view, is one of self-governance – is not\noperative in cases where the agent is psychologically unable to alter\ntheir attitudes (but see Brunero 2010; 2020: Ch. 5; Kiesewetter 2017:\nCh. 5 for challenges for Bratman’s view).\n3.2 The Why-Be-Rational Challenge\n\nA second major difficulty for the view that there necessarily are\nreasons to conform to structural requirements is to come up with a\nsatisfying answer to the question “Why be rational?”\n(Kolodny 2005) ­– an answer that explicates what such\nreasons consist in and justifies the assumption that they\n exist.[8]\n It is worth noting that this challenge applies to requirements of\nstructural rationality in particular. At least if\nrequirements of substantive rationality are understood in terms of\nfacts about the balance of reasons, it makes no sense to ask what\nreasons we have to conform to such requirements: there is no need for\na reason to do what there is reason to do. But since structural\nrequirements are not to be understood in terms of facts about the\nbalance of reasons, it is a fair question why one should conform to\nthem.\n\nIt is natural to think that an answer to the why-be-rational challenge\nmust show how one can derive a reason to conform to structural\nrequirements from other reasons that exist independently of structural\nrationality. According to this derivative approach, there is\nreason to satisfy structural requirements because doing so is\nconducive to (or necessary for) – for example – being an\nagent (Korsgaard 2009), governing oneself (Bratman 2009b), doing what\nis objectively choiceworthy (Wedgwood 2017), or being interpretable by\nothers (Mildenberger 2019). Proposals of this form are subject to at\nleast one of two potential objections. One might question that\nstructural rationality is in fact necessarily conducive to (or\nnecessary for) the other relevant property, and one might question\nthat there necessarily is a reason to instantiate this other property\n(Kolodny 2005; Broome 2007b; Kiesewetter 2017; Brunero 2020). The\ncurrent state of the literature tends towards the verdict that none of\nthe existing proposals has been shown to be immune against both kinds\nof objections.\n\nPartly in response to problems for the derivative approach, some of\nthose who are sympathetic to the normativity of structural rationality\nhave opted for a non-derivative approach, according to which,\nfor any structurally irrational combination of attitudes, there is a\nsui generis “reason of [structural] rationality”\nto avoid them, constituted by the very fact that the attitudes in\nquestion are prohibited by structural rationality (Southwood 2008; see\nalso Broome 2013; Hussain 2007 – see Other Internet Resources).\nThis move is often supported by way of an analogy with H.A.\nPrichard’s influential response to the why-be-moral challenge,\nwhich essentially involved the rejection of the idea that morality\ncould be derivatively justified (Prichard 1912). Critics of the\nnon-derivative approach respond that it seems fetishistic to treat\nstructural rationality as something we have reason to aim at for\nits own sake (Kolodny 2005) and that the alleged normativity of\nstructural rationality lacks the kind of self-evident status that\nPrichard claims for the moral case and bases his view on (Brunero\n2020).\n\nBesides the objections that apply to the derivative and the\nnon-derivative approaches specifically, Kolodny (2005) also has raised\nan important general challenge for the assumption that there\nnecessarily is a reason to do what satisfies structural requirements.\nOn the most general level, the problem is that it is unclear what\ndeliberative relevance such a reason could have. Typically, we form\nattitudes on the basis of considerations connected to their\ncorrectness rather than their coherence with other\nattitudes. For example, we adopt beliefs because we think they are\nsupported by evidence rather than because they cohere with our other\nbeliefs. Indeed, it seems that because of their\ncorrectness-independence, coherence-based reasons for attitudes would\nbelong to the category of so-called “wrong-kind\n reasons”.[9]\n The existence of wrong-kind reasons is often denied (e.g. Kolodny\n2005; Way 2016), and even those who accept their existence typically\nagree that such reasons are irrelevant for the rationality of\nattitudes (Schroeder 2012). It would thus be very surprising if the\nnormativity of certain rational requirements depended on such reasons.\n(See Worsnip 2021: Ch. 8 for a recent defense of the view that the\nnormativity of structural rationality can be understood in terms of\nright-kind of reasons, and Daoust 2022 and Kiesewetter 2023\nfor criticism.)\n3.3 Transparency and Apparent Reasons Accounts\n\nIf there are not necessarily reasons to conform with requirements of\nstructural rationality, this raises the questions of whether there is\nsome other interesting relation between structural rationality and\nreasons, and whether there is an explanation of why it has seemed to\nmany that structural rationality is normatively significant. Two\nprominent views in the literature on rationality – the\ntransparency account and the apparent reasons account – provide\nanswers to these questions.\n\nAccording to the transparency account, structural rationality\nis a matter of coherence between one’s attitudes and one’s\nnormative beliefs about such attitudes, and for an attitude to be\nrequired by structural rationality is for one to have a belief that\nthis attitude is supported by conclusive reasons (Kolodny 2005, and on\none reading, Scanlon 2007). On this view, the apparent normativity of\nstructural rationality is due to the fact that from the first-personal\nstandpoint, rationally required attitudes are always believed\nto be supported by conclusive reasons.\n\nThe transparency account faces problems, however. First, the normative\nappearance of rationality is not limited to the first-personal\nperspective. We seem to presuppose that rationality is normatively\nsignificant when we recommend options as rational or\ncriticize responses as irrational, and the hypothesis that\nrationally required responses must be believed to be\nnormatively supported by the agent for whom they are required\ndoes not help to understand this (Bridges 2009; Hussain 2007 –\nsee Other Internet Resources). Second, the assumption that structural\nirrationality always involves a conflict between an attitude and a\nnormative belief about that attitude is questionable: a number of\nplausible instances of structural irrationality – in particular\nthose involved in certain forms of belief inconsistency and means-end\nincoherence (see §1.4) – do not seem to involve such a\nconflict.\n\nWhile the transparency account explains rationality in terms of\nbelieved reasons, the apparent reasons account explains rationality in\nterms of “apparent reasons”, which are usually understood\nas the reasons we would have if our beliefs were true (e. g.\nParfit 2011; Schroeder 2009; Way 2009; Whiting 2014; Alvarez 2018; see\nalso Sylvan 2015 for a more sophisticated conception of apparent\nreasons). It has been stated as the view that “for you to be\nrationally required to \\(A\\) is for it to be the case that you would\nhave conclusive reasons to \\(A\\), if your beliefs were true”\n(Way 2009, 4). Parfit (2001) first proposed a view along these lines,\narguably as an account of substantive rationality. However,\nseveral authors have tried to explain structural rationality (and, by\nextension, its apparent or actual normative force) in terms of\napparent reasons as well (Schroeder 2009; Way 2012; Sylvan 2021a).\n\nSome proponents of the apparent reasons account suggest that\nrationality is in fact normative on their view. For example, Schroeder\n(2009) identifies rational requirements with “subjective\noughts”, which he takes to be genuinely normative, and Parfit\nclaims that “normativity involves reasons or apparent\nreasons” (2011, 59). According to Way (2009), the apparent\nreasons account vindicates the normativity of rationality, because it\nexplains rational requirements in terms of hypothetical truths of the\nform ‘If your beliefs were true, you would have conclusive\nreason to A’ – and such truths are in an interesting sense\nnormative, as a normative error theorist is committed to denying them.\nHowever, critics have contended that the sense in which hypotheticals\nabout reasons are normative is a merely technical one that does\nnothing to vindicate the actual normative significance of\nrationality (Kiesewetter 2012). (For more on the normative relevance\nof apparent reasons, see González de Prado Salas 2018; Sylvan\n2021a).)\n\nThe apparent reasons account also faces similar challenges as the\ntransparency account when it comes to accounting for kinds of\nstructural irrationality that do not involve attitudes with normative\ncontents. While it is straightforward that akratic agents go against\nwhat would be conclusive reasons if their beliefs were true, it is\nmuch more difficult to see that this is true for agents with\n“formally incoherent” attitudes, such as incoherent\ncredences.\n3.4 The Theoretical Options\n\nTo summarize, the debate on the normativity of rationality is often\ncentred around two theoretical options. One is to preserve the\nnormativity of rationality by defending the claim that there\nnecessarily are reasons to conform to structural requirements. The\nother is to deny this claim, and abandon the view that rationality is\nnormative. As we have seen, both options face significant challenges.\nProponents of the first view must explain why their views do not\nentail implausible forms of detachment, why the reasons they allude to\nexist, and why they are of the right kind. Proponents of the second\nview must explain why rationality seems normative when it isn’t.\nMore specifically, proponents of the second view need to explain both\nwhy describing someone as irrational amounts to a serious form of\ncriticism if there is no reason to avoid irrationality, and how\nrequirements of structural rationality can count as\nrequirements if there’s no sense in which we have\nreason to comply with them (and if they also aren’t\n“institutional” or “positive” requirements\nlike the requirements of a social club or 19th century\netiquette). In addition, they face an especially strong challenge to\nsay what unites structural requirements as such, as they cannot to\naccount for the unity of structural rationality by appeal to the\nreasons that support it.\n\nThere is a third option to deal with the issues discussed in this\nsection, which is to dispense with structural requirements of\nrationality (§2.4) and adopt the view (briefly discussed in\n§1.3) that structural irrationality is to be explained in terms\nof substantive requirements of rationality, understood as requirements\nto respond correctly to reasons, alone. As its proponents have\nemphasized, this view has the benefits of preserving the idea that\nrationality is normative, while avoiding the problems that arise with\nassuming that there are reasons to comply with structural\nrequirements. It is not troubled by detachment worries and can dismiss\nthe why-be-rational challenge as an illegitimate request for a reason\nto do what we have reason to do. It is well-positioned to explain the\ncriticizability of irrationality and the unity of rationality. But as\nwe have seen already, it faces its own challenges. As noted at the\nbeginning of this entry (§1.1), distinguishing between reasons\nand requirements of structural rationality gave us a way to explain\nhow one’s holding one attitude can make it the case that one\nholds another attitude, one is irrational, without allowing\nthe attitudes one has (no matter how misguided) to dictate what\nsubstantive reasons one has. Whether a theory that operates only with\nrequirements of substantive rationality can do this is still a\ncontroversial question.\n\nThus, despite the now-voluminous literature on structural rationality,\nthere remain deep challenges for all the views that have been\nidentified. How one adjudicates the comparative seriousness of these\nchallenges will affect whether one opts for a theory of rationality\nthat includes normative structural requirements, non-normative\nstructural requirements, or no structural requirements at all.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Adler, Jonathan, 2002, <em>Belief’s Own Ethics</em>,\nCambridge, Mass: MIT Press.",
                "Alvarez, Maria, 2018, “Reasons for Action, Acting for\nReasons, and Rationality”, <em>Synthese</em>, 195(8):\n3293–3310.",
                "Arpaly, Nomy, 2000, “On Acting Rationally Against\nOne’s Best Judgment”, <em>Ethics</em>, 110(3):\n488–513.",
                "Ballantyne, Nathan and E.J. Coffman, 2011, “Uniqueness,\nEvidence, and Rationality”, <em>Philosophers’\nImprint</em>, 11(18), 1–13.",
                "Bedke, Matthew S., 2009, “The Iffiest Oughts: A Guise of\nReasons Account of End-Given Conditionals”, <em>Ethics</em>,\n119(4): 672–98.",
                "Bratman, Michael E., 1981, “Intention and Means-End\nReasoning”, <em>The Philosophical Review</em>, 90(2):\n252–65.",
                "–––, 1987, <em>Intention, Plans, and Practical\nReason</em>, Stanford: CSLI.",
                "–––, 2009a, “Intention, Belief,\nTheoretical, Practical”, in Simon Robertson (ed.), <em>Spheres\nof Reason</em>, Oxford: Oxford University Press, pp. 29–61.",
                "–––, 2009b, “Intention, Practical\nRationality, and Self-Governance”, <em>Ethics</em>, 119(3):\n411–443.",
                "–––, 2018, <em>Planning, Time, and\nSelf-Governance: Essays in Practical Rationality</em>, Oxford\nUniversity Press.",
                "Bridges, Jason, 2009, “Rationality, Normativity, and\nTransparency”, <em>Mind</em>, 118(470): 353–67.",
                "Broome, John, 1999, “Normative Requirements”,\n<em>Ratio</em>, 12(4): 398–419.",
                "–––, 2001a, “Are Intentions Reasons? And\nHow Should We Cope with Incommensurable Values?”, in Christopher\nMorris and Arthur Ripstein (eds.), <em>Practical Rationality and\nPreference: Essays for David Gauthier</em>, Cambridge, UK: Cambridge\nUniversity Press, pp. 98–120.",
                "–––, 2001b, “Normative Practical\nReasoning”, <em>Proceedings of the Aristotelian Society\nSupplementary Volume</em>, 75: 175–193.",
                "–––, 2004, “Reasons”, in R. Jay\nWallace, Philip Pettit, and Samuel Scheffler (eds.), <em>Reason and\nValue: Themes from the Moral Philosophy of Joseph Raz</em>, Oxford:\nOxford University Press, pp. 28–55.",
                "–––, 2005, “Have We Reason to Do as\nRationality Requires? – A Comment on Raz”, <em>Journal of\nEthics and Social Philosophy</em>, 1(1): 1–8.",
                "–––, 2007a, “Does Rationality Consist in\nResponding Correctly to Reasons?”, <em>Journal of Moral\nPhilosophy</em>, 4(3): 349–374.",
                "–––, 2007b, “Is Rationality\nNormative?”, <em>Disputatio</em>, 2(23): 161–78.",
                "–––, 2007c, “Wide or Narrow Scope?”,\n<em>Mind</em>, 116(462): 359–70.",
                "–––, 2013, <em>Rationality through\nReasoning</em>, Chichester: Wiley-Blackwell.",
                "–––, 2020, “Rationality versus\nNormativity”, <em>Australasian Philosophical Review</em>, 4(4):\n293–311.",
                "Brunero, John, 2010a, “Self-Governance, Means-Ends\nCoherence, and Unalterable Ends”, <em>Ethics</em>, 120(3):\n579–91.",
                "–––, 2010b, “The Scope of Rational\nRequirements”, <em>The Philosophical Quarterly</em>, 60(238):\n28–49.",
                "–––, 2012, “Instrumental Rationality,\nSymmetry and Scope”, <em>Philosophical Studies</em>, 157(1):\n125–40.",
                "–––, 2020, <em>Instrumental Rationality: The\nNormativity of Means-End Coherence</em>, Oxford: Oxford University\nPress.",
                "–––, 2022, “Intention Persistence”,\n<em>Philosophy and Phenomenological Research</em>, 104(3):\n747–763.",
                "Christensen, David, 2004, <em>Putting Logic in its Place</em>,\nOxford: Oxford University Press.",
                "Coates, Allen, 2012, “Rational Epistemic Akrasia”,\n<em>American Philosophical Quarterly</em>, 49(2): 113–124.",
                "Cuneo, Terence, 2007, <em>The Normative Web</em>, Oxford: Oxford\nUniversity Press.",
                "Dancy, Jonathan, 1977, “The Logical Conscience”,\n<em>Analysis</em>, 37(2): 81–84.",
                "–––, 2000, <em>Practical Reality</em>, Oxford:\nOxford University Press.",
                "Daoust, MK, 2022, “Imperfection, Accuracy, and Structural\nRationality”. <em>Erkenntnis.</em>,\nhttps://doi.org/10.1007/s10670-022-00571-5",
                "Darwall, Stephen, 1983, <em>Impartial Reason</em>, Ithaca, NY:\nCornell University Press.",
                "Davidson, Donald, 1969, “How Is Weakness of the Will\nPossible?”, reprinted in Davidson 1980, pp. 21–42.",
                "–––, 1980, <em>Essays on Actions and\nEvents</em>, 2nd ed. 2001, Oxford: Clarendon Press.",
                "Davidson, Donald, J.C.C. McKinsey and Patrick Suppes, 1955,\n“Outlines of a Formal Theory of Value, I”, <em>Philosophy\nof Science</em>, 22(2): 140–160.",
                "Dennett, Daniel, 1971, “Intentional Systems”,\n<em>Journal of Philosophy</em> 68(4): 87–106.",
                "Dowell, Janice, 2012, “Contextualist Solutions to Three\nPuzzles about Practical Conditionals”, in Russ Shafer-Landau\n(ed.), <em>Oxford Studies in Metaethics</em>, vol. 7, Oxford: Oxford\nUniversity Press, pp. 271–301.",
                "Dreier, James, 2009, “Practical Conditionals”, in\nDavid Sobel and Steven Wall (eds.), <em>Reasons for Action</em>,\nCambridge: Cambridge University Press, pp. 116–33.",
                "Enoch, David, 2005, “Why Idealize?”, <em>Ethics</em>,\n115(4), 759–787.",
                "Feldman, Richard, 2005, “Respecting the Evidence”,\n<em>Philosophical Perspectives</em>, 19: 9–119.",
                "de Finetti, Bruno, 1937, “Foresight: Its Logical Laws, Its\nSubjective Sources”, reprinted in Henry Kyburg and Howard\nSmokler (eds.), <em>Studies in Subjective Probability</em>,\nHuntingdon, NY: Krieger, 1980, pp. 57­­–118.",
                "Fink, Julian, forthcoming, “The Essence of Attitude-Based\nIrrationality: The Impossibility of Attitudinal Success”,\n<em>Journal of Ethics and Social Philosophy</em>.",
                "Finlay, Stephen, 2009, “Against All Reason? Skepticism about\nthe Instrumental Norm”, in Charles Pigden (ed.), <em>Hume on\nMotivation and Virtue</em>, Basingstoke: Palgrave Macmillan.",
                "–––, 2010, “What Ought Probably Means, and\nWhy You Can’t Detach It”, <em>Synthese</em>, 177(1):\n67–89.",
                "Fogal, Daniel, 2020, “Rational Requirements and the Primacy\nof Pressure”, <em>Mind</em>, 129(516): 1033–1070.",
                "Fogal, Daniel and Alex Worsnip, 2021, “Which Reasons? Which\nRationality?” <em>Ergo</em>, 8(11): 306–343.",
                "van Fraassen, Bas C., 1972, “The Logic of Conditional\nObligation”, <em>Journal of Philosophical Logic</em>, 1(3/4):\n417–438.",
                "Fullhart, Samuel, and Camilo Martinez, forthcoming,\n“Coherence as Joint Satisfiability”, <em>Australasian\nJournal of Philosophy</em>.",
                "Gaus, Gerald F., 2008, <em>On Philosophy, Politics, and\nEconomics</em>, Belmont, CA: Wadsworth Cengage Learning.",
                "Gertken, Jan, and Benjamin Kiesewetter, 2017, “The Right and\nthe Wrong Kind of Reasons”, <em>Philosophy Compass</em>, 12(5):\n1–14.",
                "Gibbard, Allan, 2003, <em>Thinking How to Live</em>, Cambridge,\nMA: Harvard University Press.",
                "González de Prado Salas, Javier,\n2018, “Rationality, Appearances, and Apparent\nFacts”, <em>Journal of Ethics and Social Philosophy</em>,\n14(2): 83–111.",
                "Greco, Daniel, 2014, “A Puzzle about Epistemic\nAkrasia”, <em>Philosophical Studies</em>, 167(2):\n201–219.",
                "Greenspan, Patricia, 1975, “Conditional Oughts and\nHypothetical Imperatives”, <em>Journal of Philosophy</em>,\n72(10): 259–276.",
                "Gustafsson, Johan E., 2022, <em>Money-Pump Arguments</em>,\nCambridge: Cambridge University Press.",
                "Harman, Gilbert, 1976, “Practical Reasoning”,\n<em>Review of Metaphysics</em>, 29: 431–63.",
                "–––, 1986, <em>Change in View: Principles of\nReasoning</em>, Cambridge, MA: MIT Press.",
                "Hansson, Bengt, 1969, “An Analysis of Some Deontic\nLogics”, <em>Noûs</em> 3(4): 373–398.",
                "Hedden, Brian, 2015, “Time-Slice Rationality”,\n<em>Mind</em>, 124(494): 449–491.",
                "Henning, Tim, 2018, <em>From a Rational Point of View</em>,\nOxford: Oxford University Press.",
                "Hill, Thomas E., 1973, “The Hypothetical Imperative”,\n<em>Philosophical Review</em>, 82(4): 429–450.",
                "Horowitz, Sophie, 2014, “Epistemic Akrasia”,\n<em>Noûs</em>, 48(4): 718–744.",
                "Hurley, Susan L., 1989, <em>Natural Reasons: Personality and\nPolity</em>, Oxford: Oxford University Press.",
                "Kiesewetter, Benjamin, 2012, “A Dilemma for Parfit’s\nConception of Normativity”, <em>Analysis</em>, 72(3):\n466–74.",
                "–––, 2015, “Instrumental Normativity: In\nDefense of the Transmission Principle”, <em>Ethics</em>, 125(4):\n921–46.",
                "–––, 2017, <em>The Normativity of\nRationality</em>, Oxford: Oxford University Press.",
                "–––, 2018, “Contrary-to-Duty Scenarios,\nDeontic Dilemmas, and Transmission Principles”, <em>Ethics</em>,\n129(1): 98–115.",
                "–––, 2020, “Rationality as\nReasons-Responsiveness”, <em>Australasian Philosophical\nReview</em>, 4(4): 332–42.",
                "–––, 2023, Review of <em>Fitting Things\nTogether: Coherence and the Demands of Structural Rationality</em>,\n<em>Mind</em>. https://doi.org/10.1093/mind/fzad016",
                "Kiesewetter, Benjamin, and Jan Gertken, 2021, “How Do\nReasons Transmit to Non-Necessary Means?”, <em>Australasian\nJournal of Philosophy</em>, 99(2): 271–85.",
                "Kolodny, Niko, 2005, “Why Be Rational?”,\n<em>Mind</em>, 114(455): 509–63.",
                "–––, 2007a, “How Does Coherence\nMatter?”, <em>Proceedings of the Aristotelian Society</em>,\n107(3): 229–63.",
                "–––, 2007b, “State or Process\nRequirements?”, <em>Mind</em>, 116(462): 371–85.",
                "–––, 2008, “The Myth of Practical\nConsistency”, <em>European Journal of Philosophy</em>, 16(3):\n366–402.",
                "–––, 2011, “Aims as Reasons”, in Jay\nWallace, Rahul Kumar, and Samuel Freeman (eds.), <em>Reasons and\nRecognition: Essays on the Philosophy of T.M. Scanlon</em>, Oxford:\nOxford University Press, pp. 43–78.",
                "–––, 2018, “Instrumental Reasons”,\nin Daniel Star (ed.), <em>The Oxford Handbook of Reasons and\nNormativity</em>, Oxford: Oxford University Press, pp.\n731–63.",
                "Korsgaard, Christine, 1997, “The Normativity of Instrumental\nReason”, in Garrett Cullity and Berys Gaut (eds.), <em>Ethics\nand Practical Reason</em>, Oxford: Clarendon Press, pp.\n215–54.",
                "–––, 2009, “The Activity of Reason”,\n<em>Proceedings and Addresses of the APA</em>, 83(2):\n23–43.",
                "Kratzer, Angelika, 1981, “The Notional Category of\nModality”, in Hans Eikmeyer and Hannes Rieser (eds.), <em>Words,\nWorlds, and Contexts</em>, Berlin: de Gruyter, pp. 38–74.",
                "Lasonen-Aarnio, Maria, 2020, “Enkrasia or Evidentialism?\nLearning to Love Mismatch”, <em>Philosophical Studies</em>,\n117(3): 597731–63, 632.",
                "–––, 2021, “Coherence as\nCompetence”, <em>Episteme</em>, 18(3): 453–76.",
                "Lee, Wooram, 2022, “The Real Myth of Coherence”,\n<em>Erkenntnis</em>, 87(3): 1211–1230.",
                "Levy, Yair, 2014, “Money Pumps, Diachronic and\nSynchronic”, <em>Journal of Ethics and Social Philosophy</em>,\n8(2): 1–6.",
                "Lewis, David, 1973, <em>Counterfactuals</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1999, “Why Conditionalize?”, in\nhis <em>Papers in Metaphysics and Epistemology, Vol. II</em>.\nCambridge, UK: Cambridge University Press, pp. 403–407.",
                "Lord, Errol, 2011, “Violating Requirements, Exiting from\nRequirements, and the Scope of Rationality”, <em>The\nPhilosophical Quarterly</em>, 61(243): 392–399.",
                "–––, 2014, “The Real Symmetry Problem(s)\nfor Wide-Scope Accounts of Rationality”, <em>Philosophical\nStudies</em>, 170(3): 443–64.",
                "–––, 2018, <em>The Importance of Being\nRational</em>, Oxford: Oxford University Press.",
                "–––, 2020, “Replies to Schafer, Schroeder,\nand Staffel”, <em>Philosophy and Phenomenological Research</em>,\n100(2): 476–87.",
                "Makinson, D. C., 1965, “The Paradox of the Preface”,\n<em>Analysis</em>, 25(6): 205–7.",
                "Markovits, Julia, 2014, <em>Moral Reason</em>, Oxford: Oxford\nUniversity Press.",
                "McDowell, John, 1995, “Might There Be External\nReasons?”, in J. E. J. Altham and Ross Harrison (eds.),\n<em>World, Mind and Ethics: Essays on the Ethical Philosophy of\nBernard Williams</em>, Cambridge, UK: Cambridge University Press, pp.\n68–85.",
                "Mildenberger, Carl, 2019, “A Reason to Be Rational”,\n<em>Inquiry</em>, 62(9–10): 1008–32.",
                "Moss, Sarah, 2015, “Time-Slice Epistemology and Action under\nIndeterminacy”, in Tamar Gendler and John Hawthorne (eds.),\n<em>Oxford Studies in Epistemology</em>, vol. 5, Oxford: Oxford\nUniversity Press, pp. 172–194.",
                "Nida-Rümelin, Julian, 2001, “Structural\nRationality”, reprinted in Nida-Rümelin 2019,\n<em>Structural Rationality and Other Essays on Practical Reason</em>,\nBerlin/Dordrecht/Heidelberg/New York: Springer, pp. 1–63.",
                "Parfit, Derek, 2001, “Rationality and Reasons”, in Dan\nEgonsson, Jonas Josefsson, Björn Petersson, and Toni\nRønnow-Rasmussen (eds.), <em>Exploring Practical Philosophy:\nFrom Action to Values</em>, Aldershot: Ashgate, pp. 17–39.",
                "–––, 2011, <em>On What Matters</em>, Vol. 1,\nOxford: Oxford University Press.",
                "Podgorski, Abelard, 2017, “Rational Delay”,\n<em>Philosophers’ Imprint</em> 17(5), 1–19.",
                "Price, A. W., 2008, “Against Requirements of\nRationality”, <em>Proceedings of the Aristotelian Society</em>,\n108 (2): 157–76.",
                "Prichard, H.A., 1912, “Does Moral Philosophy Rest on a\nMistake?”, reprinted in H.A. Prichard, 2002, <em>Moral\nWritings</em>, Oxford: Clarendon Press, pp. 7–20.",
                "Ramsey, F.P., 1926, “Truth and Probability”, reprinted\nin Henry Kyburg and Howard Smokler (eds.), <em>Studies in Subjective\nProbability</em>, Huntingdon, NY: Krieger, 1980, pp. 25–52.",
                "Raz, Joseph, 2005, “The Myth of Instrumental\nRationality”, <em>Journal of Ethics and Social Philosophy</em>,\n1(1): 2–28.",
                "Reisner, Andrew, 2009, “Unifying the Requirements of\nRationality”, <em>Philosophical Explorations</em>, 12:\n243–60.",
                "Ridge, Michael, 2014, <em>Impassioned Belief</em>, Oxford: Oxford\nUniversity Press.",
                "Rippon, Simon, 2011, “In Defense of the Wide-Scope\nInstrumental Principle”, <em>Journal of Ethics and Social\nPhilosophy</em>, 5(2): 1–21.",
                "Rosa, Luis, 2022, “Coherence and Knowability”,\n<em>Philosophical Quarterly</em>, 72(4): 960–78.",
                "Sainsbury, R. M., 2002, “What Logic Should We Think\nWith?”, <em>Royal Institute of Philosophy Supplement</em>, 51:\n1–17.",
                "Sampson, Eric, 2021, “What If Ideal Advice Conflicts? A\nDilemma for Idealizing Accounts of Normative Practical Reasons”,\n<em>Philosophical Studies</em>, 179(4), 1091–1111.",
                "Scanlon, T.M., 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 2004, “Reasons: A Puzzling\nDuality?”, in R. Jay Wallace, Philip Pettit, Samuel Scheffler,\nand Michael Smith (eds.), <em>Reason and Value: Themes from the Moral\nPhilosophy of Joseph Raz</em>, Oxford: Oxford University Press, pp.\n231–246.",
                "–––, 2007, “Structural\nIrrationality”, in Geoffrey Brennan, Robert Goodin, Frank\nJackson, and Michael Smith (eds.), <em>Common Minds: Themes from the\nPhilosophy of Philip Pettit</em>, Oxford: Oxford University Press, pp.\n84–103.",
                "Schoenfield, Miriam, 2014, “Permission to Believe: Why\nPermissivism is True and What It Tells Us About Irrelevant Influences\non Belief”, <em>Noûs</em>, 48(2): 193–218.",
                "Schroeder, Mark, 2004, “The Scope of Instrumental\nReason”, <em>Philosophical Perspectives</em>, 18(1):\n337–364.",
                "–––, 2007, <em>Slaves of the Passions</em>,\nOxford: Oxford University Press.",
                "–––, 2009, “Means-End Coherence,\nStringency, and Subjective Reasons”, <em>Philosophical\nStudies</em>, 143(2): 223–48.",
                "–––, 2011, “<em>Ought</em>, Agents, and\nActions”, <em>The Philosophical Review</em>, 120(1):\n1–41.",
                "–––, 2012, “The Ubiquity of State-Given\nReasons”, <em>Ethics</em> 122(3): 457–88.",
                "Schultheis, Ginger, 2018, “Living on the Edge: Against\nEpistemic Permissivism”, <em>Mind</em>, 127(507):\n863–79.",
                "Setiya, Kieran, 2007, “Cognitivism about Instrumental\nReason”, <em>Ethics</em> 117(4): 649–673.",
                "Silk, Alex, 2014, “Why ‘Ought’ Detaches: or, Why\nYou Ought to Get With my Friends (If You Want to Be My Lover)”,\n<em>Philosophers’ Imprint</em>, 14(7), pp. 1–16.",
                "Singh, Keshav, forthcoming, “Rationality Reunified”,\nin Russ Shafer-Landau (ed.), <em>Oxford Studies in Metaethics</em>,\n20.",
                "Smith, Michael, 1994, <em>The Moral Problem</em>, Oxford:\nBlackwell.",
                "Smithies, Declan, forthcoming, “The Unity of Evidence and\nCoherence”, in Nick Hughes (ed.), <em>Epistemic Dilemmas</em>,\nOxford: Oxford University Press.",
                "Southwood, Nicholas, 2008, “Vindicating the Normativity of\nRationality”, <em>Ethics</em>, 119(1): 9–30.",
                "Staffel, Julia, 2020, “Reasons Fundamentalism and Rational\nUncertainty – Comments on Lord, <em>The Importance of Being\nRational</em>”, <em>Philosophy and Phenomenological\nResearch</em>, 100(2): 463–68.",
                "Sylvan, Kurt, 2015, “What Apparent Reasons Appear to\nBe”, <em>Philosophical Studies</em>, 172(3): 587–606.",
                "–––, 2021a, “Respect and the Reality of\nApparent Reasons”, <em>Philosophical Studies</em>, 178(10):\n3129–56.",
                "–––, 2021b, “The Eclipse of Instrumental\nRationality”, in Kurt Sylvan and Ruth Chang (eds.), <em>The\nRoutledge Handbook of Practical Reason</em>, Routledge, pp.\n482–504.",
                "Titelbaum, Michael, 2015, “Rationality’s Fixed\nPoint”, in Tamar Gendler and John Hawthorne (eds.), <em>Oxford\nStudies in Epistemology</em>, vol. 5, Oxford: Oxford University Press,\npp. 253–292.",
                "Timmermann, Jens, 2022, <em>Kant’s Will at the Crossroads:\nAn Essay on the Failings of Practical Rationality</em>, Oxford: Oxford\nUniversity Press.",
                "Velleman, J. David, 1989, <em>Practical Reflection</em>,\nPrinceton: Princeton University Press.",
                "Wallace, R. Jay, 2001, “Normativity, Commitment, and\nInstrumental Reason”, <em>Philosophers’ Imprint</em>,\n1(3): 1–26.",
                "Way, Jonathan, 2009, “Two Accounts of the Normativity of\nRationality”, <em>Journal of Ethics and Social Philosophy</em>\n(Discussion Note): 1–8.",
                "–––, 2010, “Defending the Wide-Scope\nApproach to Instrumental Reason”, <em>Philosophical\nStudies</em>, 147(2): 213–33.",
                "–––, 2011, “The Symmetry of Rational\nRequirements”, <em>Philosophical Studies</em>, 155(2):\n227–39.",
                "–––, 2012, “Explaining the Instrumental\nPrinciple”, <em>Australasian Journal of Philosophy</em>, 90(3):\n487–506.",
                "–––, 2013, “Intentions, Akrasia, and Mere\nPermissibility”, <em>Organon F</em>, 20(4): 588–611.",
                "–––, 2016, “Two Arguments for\nEvidentialism”, <em>The Philosophical Quarterly</em>, 66(265):\n805–18.",
                "–––, 2018, “Reasons and\nRationality”, in Daniel Star (ed.), <em>The Oxford Handbook of\nReasons and Normativity</em>, 485–503, Oxford: Oxford University\nPress.",
                "Wedgwood, Ralph, 2002, “Internalism Explained”,\n<em>Philosophy and Phenomenological Research</em>, 65(2):\n349–369.",
                "–––, 2017, <em>The Value of Rationality</em>,\nOxford: Oxford University Press.",
                "White, Roger, 2005, “Epistemic Permissiveness”,\n<em>Philosophical Perspectives</em>, 19(1): 445–59.",
                "Whiting, Daniel, 2014, “Keep Things in Perspective: Reasons,\nRationality and the A Priori”, <em>Journal of Ethics and Social\nPhilosophy</em>, 8(1): 1–22.",
                "Worsnip, Alex, 2016a, “Belief, Credence, and the Preface\nParadox”, <em>Australasian Journal of Philosophy</em>, 94(3):\n549–562.",
                "–––, 2016b, “Moral Reasons, Epistemic\nReasons, and Rationality”, <em>Philosophical Quarterly</em>,\n66(263): 341–361.",
                "–––, 2018a, “The Conflict of Evidence and\nCoherence”, <em>Philosophy and Phenomenological Research</em>,\n96(1): 3–44.",
                "–––, 2018b, “What is\n(In)coherence?”, in Russ Shafer-Landau (ed.), <em>Oxford Studies\nin Metaethics</em>, vol. 13, Oxford: Oxford University Press, pp.\n184–206.",
                "–––, 2021, <em>Fitting Things Together:\nCoherence and the Demands of Structural Rationality</em>, New York:\nOxford University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Adler, Jonathan, 2002, <em>Belief’s Own Ethics</em>,\nCambridge, Mass: MIT Press.</li>\n<li>Alvarez, Maria, 2018, “Reasons for Action, Acting for\nReasons, and Rationality”, <em>Synthese</em>, 195(8):\n3293–3310.</li>\n<li>Arpaly, Nomy, 2000, “On Acting Rationally Against\nOne’s Best Judgment”, <em>Ethics</em>, 110(3):\n488–513.</li>\n<li>Ballantyne, Nathan and E.J. Coffman, 2011, “Uniqueness,\nEvidence, and Rationality”, <em>Philosophers’\nImprint</em>, 11(18), 1–13.</li>\n<li>Bedke, Matthew S., 2009, “The Iffiest Oughts: A Guise of\nReasons Account of End-Given Conditionals”, <em>Ethics</em>,\n119(4): 672–98.</li>\n<li>Bratman, Michael E., 1981, “Intention and Means-End\nReasoning”, <em>The Philosophical Review</em>, 90(2):\n252–65.</li>\n<li>–––, 1987, <em>Intention, Plans, and Practical\nReason</em>, Stanford: CSLI.</li>\n<li>–––, 2009a, “Intention, Belief,\nTheoretical, Practical”, in Simon Robertson (ed.), <em>Spheres\nof Reason</em>, Oxford: Oxford University Press, pp. 29–61.</li>\n<li>–––, 2009b, “Intention, Practical\nRationality, and Self-Governance”, <em>Ethics</em>, 119(3):\n411–443.</li>\n<li>–––, 2018, <em>Planning, Time, and\nSelf-Governance: Essays in Practical Rationality</em>, Oxford\nUniversity Press.</li>\n<li>Bridges, Jason, 2009, “Rationality, Normativity, and\nTransparency”, <em>Mind</em>, 118(470): 353–67.</li>\n<li>Broome, John, 1999, “Normative Requirements”,\n<em>Ratio</em>, 12(4): 398–419.</li>\n<li>–––, 2001a, “Are Intentions Reasons? And\nHow Should We Cope with Incommensurable Values?”, in Christopher\nMorris and Arthur Ripstein (eds.), <em>Practical Rationality and\nPreference: Essays for David Gauthier</em>, Cambridge, UK: Cambridge\nUniversity Press, pp. 98–120.</li>\n<li>–––, 2001b, “Normative Practical\nReasoning”, <em>Proceedings of the Aristotelian Society\nSupplementary Volume</em>, 75: 175–193.</li>\n<li>–––, 2004, “Reasons”, in R. Jay\nWallace, Philip Pettit, and Samuel Scheffler (eds.), <em>Reason and\nValue: Themes from the Moral Philosophy of Joseph Raz</em>, Oxford:\nOxford University Press, pp. 28–55.</li>\n<li>–––, 2005, “Have We Reason to Do as\nRationality Requires? – A Comment on Raz”, <em>Journal of\nEthics and Social Philosophy</em>, 1(1): 1–8.</li>\n<li>–––, 2007a, “Does Rationality Consist in\nResponding Correctly to Reasons?”, <em>Journal of Moral\nPhilosophy</em>, 4(3): 349–374.</li>\n<li>–––, 2007b, “Is Rationality\nNormative?”, <em>Disputatio</em>, 2(23): 161–78.</li>\n<li>–––, 2007c, “Wide or Narrow Scope?”,\n<em>Mind</em>, 116(462): 359–70.</li>\n<li>–––, 2013, <em>Rationality through\nReasoning</em>, Chichester: Wiley-Blackwell.</li>\n<li>–––, 2020, “Rationality versus\nNormativity”, <em>Australasian Philosophical Review</em>, 4(4):\n293–311.</li>\n<li>Brunero, John, 2010a, “Self-Governance, Means-Ends\nCoherence, and Unalterable Ends”, <em>Ethics</em>, 120(3):\n579–91.</li>\n<li>–––, 2010b, “The Scope of Rational\nRequirements”, <em>The Philosophical Quarterly</em>, 60(238):\n28–49.</li>\n<li>–––, 2012, “Instrumental Rationality,\nSymmetry and Scope”, <em>Philosophical Studies</em>, 157(1):\n125–40.</li>\n<li>–––, 2020, <em>Instrumental Rationality: The\nNormativity of Means-End Coherence</em>, Oxford: Oxford University\nPress.</li>\n<li>–––, 2022, “Intention Persistence”,\n<em>Philosophy and Phenomenological Research</em>, 104(3):\n747–763.</li>\n<li>Christensen, David, 2004, <em>Putting Logic in its Place</em>,\nOxford: Oxford University Press.</li>\n<li>Coates, Allen, 2012, “Rational Epistemic Akrasia”,\n<em>American Philosophical Quarterly</em>, 49(2): 113–124.</li>\n<li>Cuneo, Terence, 2007, <em>The Normative Web</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Dancy, Jonathan, 1977, “The Logical Conscience”,\n<em>Analysis</em>, 37(2): 81–84.</li>\n<li>–––, 2000, <em>Practical Reality</em>, Oxford:\nOxford University Press.</li>\n<li>Daoust, MK, 2022, “Imperfection, Accuracy, and Structural\nRationality”. <em>Erkenntnis.</em>,\nhttps://doi.org/10.1007/s10670-022-00571-5</li>\n<li>Darwall, Stephen, 1983, <em>Impartial Reason</em>, Ithaca, NY:\nCornell University Press.</li>\n<li>Davidson, Donald, 1969, “How Is Weakness of the Will\nPossible?”, reprinted in Davidson 1980, pp. 21–42.</li>\n<li>–––, 1980, <em>Essays on Actions and\nEvents</em>, 2nd ed. 2001, Oxford: Clarendon Press.</li>\n<li>Davidson, Donald, J.C.C. McKinsey and Patrick Suppes, 1955,\n“Outlines of a Formal Theory of Value, I”, <em>Philosophy\nof Science</em>, 22(2): 140–160.</li>\n<li>Dennett, Daniel, 1971, “Intentional Systems”,\n<em>Journal of Philosophy</em> 68(4): 87–106.</li>\n<li>Dowell, Janice, 2012, “Contextualist Solutions to Three\nPuzzles about Practical Conditionals”, in Russ Shafer-Landau\n(ed.), <em>Oxford Studies in Metaethics</em>, vol. 7, Oxford: Oxford\nUniversity Press, pp. 271–301.</li>\n<li>Dreier, James, 2009, “Practical Conditionals”, in\nDavid Sobel and Steven Wall (eds.), <em>Reasons for Action</em>,\nCambridge: Cambridge University Press, pp. 116–33.</li>\n<li>Enoch, David, 2005, “Why Idealize?”, <em>Ethics</em>,\n115(4), 759–787.</li>\n<li>Feldman, Richard, 2005, “Respecting the Evidence”,\n<em>Philosophical Perspectives</em>, 19: 9–119.</li>\n<li>de Finetti, Bruno, 1937, “Foresight: Its Logical Laws, Its\nSubjective Sources”, reprinted in Henry Kyburg and Howard\nSmokler (eds.), <em>Studies in Subjective Probability</em>,\nHuntingdon, NY: Krieger, 1980, pp. 57­­–118.</li>\n<li>Fink, Julian, forthcoming, “The Essence of Attitude-Based\nIrrationality: The Impossibility of Attitudinal Success”,\n<em>Journal of Ethics and Social Philosophy</em>.</li>\n<li>Finlay, Stephen, 2009, “Against All Reason? Skepticism about\nthe Instrumental Norm”, in Charles Pigden (ed.), <em>Hume on\nMotivation and Virtue</em>, Basingstoke: Palgrave Macmillan.</li>\n<li>–––, 2010, “What Ought Probably Means, and\nWhy You Can’t Detach It”, <em>Synthese</em>, 177(1):\n67–89.</li>\n<li>Fogal, Daniel, 2020, “Rational Requirements and the Primacy\nof Pressure”, <em>Mind</em>, 129(516): 1033–1070.</li>\n<li>Fogal, Daniel and Alex Worsnip, 2021, “Which Reasons? Which\nRationality?” <em>Ergo</em>, 8(11): 306–343.</li>\n<li>van Fraassen, Bas C., 1972, “The Logic of Conditional\nObligation”, <em>Journal of Philosophical Logic</em>, 1(3/4):\n417–438.</li>\n<li>Fullhart, Samuel, and Camilo Martinez, forthcoming,\n“Coherence as Joint Satisfiability”, <em>Australasian\nJournal of Philosophy</em>.</li>\n<li>Gaus, Gerald F., 2008, <em>On Philosophy, Politics, and\nEconomics</em>, Belmont, CA: Wadsworth Cengage Learning.</li>\n<li>Gertken, Jan, and Benjamin Kiesewetter, 2017, “The Right and\nthe Wrong Kind of Reasons”, <em>Philosophy Compass</em>, 12(5):\n1–14.</li>\n<li>Gibbard, Allan, 2003, <em>Thinking How to Live</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>González de Prado Salas, Javier,\n2018, “Rationality, Appearances, and Apparent\nFacts”, <em>Journal of Ethics and Social Philosophy</em>,\n14(2): 83–111.</li>\n<li>Greco, Daniel, 2014, “A Puzzle about Epistemic\nAkrasia”, <em>Philosophical Studies</em>, 167(2):\n201–219.</li>\n<li>Greenspan, Patricia, 1975, “Conditional Oughts and\nHypothetical Imperatives”, <em>Journal of Philosophy</em>,\n72(10): 259–276.</li>\n<li>Gustafsson, Johan E., 2022, <em>Money-Pump Arguments</em>,\nCambridge: Cambridge University Press.</li>\n<li>Harman, Gilbert, 1976, “Practical Reasoning”,\n<em>Review of Metaphysics</em>, 29: 431–63.</li>\n<li>–––, 1986, <em>Change in View: Principles of\nReasoning</em>, Cambridge, MA: MIT Press.</li>\n<li>Hansson, Bengt, 1969, “An Analysis of Some Deontic\nLogics”, <em>Noûs</em> 3(4): 373–398.</li>\n<li>Hedden, Brian, 2015, “Time-Slice Rationality”,\n<em>Mind</em>, 124(494): 449–491.</li>\n<li>Henning, Tim, 2018, <em>From a Rational Point of View</em>,\nOxford: Oxford University Press.</li>\n<li>Hill, Thomas E., 1973, “The Hypothetical Imperative”,\n<em>Philosophical Review</em>, 82(4): 429–450.</li>\n<li>Horowitz, Sophie, 2014, “Epistemic Akrasia”,\n<em>Noûs</em>, 48(4): 718–744.</li>\n<li>Hurley, Susan L., 1989, <em>Natural Reasons: Personality and\nPolity</em>, Oxford: Oxford University Press.</li>\n<li>Kiesewetter, Benjamin, 2012, “A Dilemma for Parfit’s\nConception of Normativity”, <em>Analysis</em>, 72(3):\n466–74.</li>\n<li>–––, 2015, “Instrumental Normativity: In\nDefense of the Transmission Principle”, <em>Ethics</em>, 125(4):\n921–46.</li>\n<li>–––, 2017, <em>The Normativity of\nRationality</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2018, “Contrary-to-Duty Scenarios,\nDeontic Dilemmas, and Transmission Principles”, <em>Ethics</em>,\n129(1): 98–115.</li>\n<li>–––, 2020, “Rationality as\nReasons-Responsiveness”, <em>Australasian Philosophical\nReview</em>, 4(4): 332–42.</li>\n<li>–––, 2023, Review of <em>Fitting Things\nTogether: Coherence and the Demands of Structural Rationality</em>,\n<em>Mind</em>. https://doi.org/10.1093/mind/fzad016</li>\n<li>Kiesewetter, Benjamin, and Jan Gertken, 2021, “How Do\nReasons Transmit to Non-Necessary Means?”, <em>Australasian\nJournal of Philosophy</em>, 99(2): 271–85.</li>\n<li>Kolodny, Niko, 2005, “Why Be Rational?”,\n<em>Mind</em>, 114(455): 509–63.</li>\n<li>–––, 2007a, “How Does Coherence\nMatter?”, <em>Proceedings of the Aristotelian Society</em>,\n107(3): 229–63.</li>\n<li>–––, 2007b, “State or Process\nRequirements?”, <em>Mind</em>, 116(462): 371–85.</li>\n<li>–––, 2008, “The Myth of Practical\nConsistency”, <em>European Journal of Philosophy</em>, 16(3):\n366–402.</li>\n<li>–––, 2011, “Aims as Reasons”, in Jay\nWallace, Rahul Kumar, and Samuel Freeman (eds.), <em>Reasons and\nRecognition: Essays on the Philosophy of T.M. Scanlon</em>, Oxford:\nOxford University Press, pp. 43–78.</li>\n<li>–––, 2018, “Instrumental Reasons”,\nin Daniel Star (ed.), <em>The Oxford Handbook of Reasons and\nNormativity</em>, Oxford: Oxford University Press, pp.\n731–63.</li>\n<li>Korsgaard, Christine, 1997, “The Normativity of Instrumental\nReason”, in Garrett Cullity and Berys Gaut (eds.), <em>Ethics\nand Practical Reason</em>, Oxford: Clarendon Press, pp.\n215–54.</li>\n<li>–––, 2009, “The Activity of Reason”,\n<em>Proceedings and Addresses of the APA</em>, 83(2):\n23–43.</li>\n<li>Kratzer, Angelika, 1981, “The Notional Category of\nModality”, in Hans Eikmeyer and Hannes Rieser (eds.), <em>Words,\nWorlds, and Contexts</em>, Berlin: de Gruyter, pp. 38–74.</li>\n<li>Lasonen-Aarnio, Maria, 2020, “Enkrasia or Evidentialism?\nLearning to Love Mismatch”, <em>Philosophical Studies</em>,\n117(3): 597731–63, 632.</li>\n<li>–––, 2021, “Coherence as\nCompetence”, <em>Episteme</em>, 18(3): 453–76.</li>\n<li>Lee, Wooram, 2022, “The Real Myth of Coherence”,\n<em>Erkenntnis</em>, 87(3): 1211–1230.</li>\n<li>Levy, Yair, 2014, “Money Pumps, Diachronic and\nSynchronic”, <em>Journal of Ethics and Social Philosophy</em>,\n8(2): 1–6.</li>\n<li>Lewis, David, 1973, <em>Counterfactuals</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1999, “Why Conditionalize?”, in\nhis <em>Papers in Metaphysics and Epistemology, Vol. II</em>.\nCambridge, UK: Cambridge University Press, pp. 403–407.</li>\n<li>Lord, Errol, 2011, “Violating Requirements, Exiting from\nRequirements, and the Scope of Rationality”, <em>The\nPhilosophical Quarterly</em>, 61(243): 392–399.</li>\n<li>–––, 2014, “The Real Symmetry Problem(s)\nfor Wide-Scope Accounts of Rationality”, <em>Philosophical\nStudies</em>, 170(3): 443–64.</li>\n<li>–––, 2018, <em>The Importance of Being\nRational</em>, Oxford: Oxford University Press.</li>\n<li>–––, 2020, “Replies to Schafer, Schroeder,\nand Staffel”, <em>Philosophy and Phenomenological Research</em>,\n100(2): 476–87.</li>\n<li>Makinson, D. C., 1965, “The Paradox of the Preface”,\n<em>Analysis</em>, 25(6): 205–7.</li>\n<li>Markovits, Julia, 2014, <em>Moral Reason</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>McDowell, John, 1995, “Might There Be External\nReasons?”, in J. E. J. Altham and Ross Harrison (eds.),\n<em>World, Mind and Ethics: Essays on the Ethical Philosophy of\nBernard Williams</em>, Cambridge, UK: Cambridge University Press, pp.\n68–85.</li>\n<li>Mildenberger, Carl, 2019, “A Reason to Be Rational”,\n<em>Inquiry</em>, 62(9–10): 1008–32.</li>\n<li>Moss, Sarah, 2015, “Time-Slice Epistemology and Action under\nIndeterminacy”, in Tamar Gendler and John Hawthorne (eds.),\n<em>Oxford Studies in Epistemology</em>, vol. 5, Oxford: Oxford\nUniversity Press, pp. 172–194.</li>\n<li>Nida-Rümelin, Julian, 2001, “Structural\nRationality”, reprinted in Nida-Rümelin 2019,\n<em>Structural Rationality and Other Essays on Practical Reason</em>,\nBerlin/Dordrecht/Heidelberg/New York: Springer, pp. 1–63.</li>\n<li>Parfit, Derek, 2001, “Rationality and Reasons”, in Dan\nEgonsson, Jonas Josefsson, Björn Petersson, and Toni\nRønnow-Rasmussen (eds.), <em>Exploring Practical Philosophy:\nFrom Action to Values</em>, Aldershot: Ashgate, pp. 17–39.</li>\n<li>–––, 2011, <em>On What Matters</em>, Vol. 1,\nOxford: Oxford University Press.</li>\n<li>Podgorski, Abelard, 2017, “Rational Delay”,\n<em>Philosophers’ Imprint</em> 17(5), 1–19.</li>\n<li>Price, A. W., 2008, “Against Requirements of\nRationality”, <em>Proceedings of the Aristotelian Society</em>,\n108 (2): 157–76.</li>\n<li>Prichard, H.A., 1912, “Does Moral Philosophy Rest on a\nMistake?”, reprinted in H.A. Prichard, 2002, <em>Moral\nWritings</em>, Oxford: Clarendon Press, pp. 7–20.</li>\n<li>Ramsey, F.P., 1926, “Truth and Probability”, reprinted\nin Henry Kyburg and Howard Smokler (eds.), <em>Studies in Subjective\nProbability</em>, Huntingdon, NY: Krieger, 1980, pp. 25–52.</li>\n<li>Raz, Joseph, 2005, “The Myth of Instrumental\nRationality”, <em>Journal of Ethics and Social Philosophy</em>,\n1(1): 2–28.</li>\n<li>Reisner, Andrew, 2009, “Unifying the Requirements of\nRationality”, <em>Philosophical Explorations</em>, 12:\n243–60.</li>\n<li>Ridge, Michael, 2014, <em>Impassioned Belief</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Rippon, Simon, 2011, “In Defense of the Wide-Scope\nInstrumental Principle”, <em>Journal of Ethics and Social\nPhilosophy</em>, 5(2): 1–21.</li>\n<li>Rosa, Luis, 2022, “Coherence and Knowability”,\n<em>Philosophical Quarterly</em>, 72(4): 960–78.</li>\n<li>Sainsbury, R. M., 2002, “What Logic Should We Think\nWith?”, <em>Royal Institute of Philosophy Supplement</em>, 51:\n1–17.</li>\n<li>Sampson, Eric, 2021, “What If Ideal Advice Conflicts? A\nDilemma for Idealizing Accounts of Normative Practical Reasons”,\n<em>Philosophical Studies</em>, 179(4), 1091–1111.</li>\n<li>Scanlon, T.M., 1998, <em>What We Owe to Each Other</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 2004, “Reasons: A Puzzling\nDuality?”, in R. Jay Wallace, Philip Pettit, Samuel Scheffler,\nand Michael Smith (eds.), <em>Reason and Value: Themes from the Moral\nPhilosophy of Joseph Raz</em>, Oxford: Oxford University Press, pp.\n231–246.</li>\n<li>–––, 2007, “Structural\nIrrationality”, in Geoffrey Brennan, Robert Goodin, Frank\nJackson, and Michael Smith (eds.), <em>Common Minds: Themes from the\nPhilosophy of Philip Pettit</em>, Oxford: Oxford University Press, pp.\n84–103.</li>\n<li>Schoenfield, Miriam, 2014, “Permission to Believe: Why\nPermissivism is True and What It Tells Us About Irrelevant Influences\non Belief”, <em>Noûs</em>, 48(2): 193–218.</li>\n<li>Schroeder, Mark, 2004, “The Scope of Instrumental\nReason”, <em>Philosophical Perspectives</em>, 18(1):\n337–364.</li>\n<li>–––, 2007, <em>Slaves of the Passions</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2009, “Means-End Coherence,\nStringency, and Subjective Reasons”, <em>Philosophical\nStudies</em>, 143(2): 223–48.</li>\n<li>–––, 2011, “<em>Ought</em>, Agents, and\nActions”, <em>The Philosophical Review</em>, 120(1):\n1–41.</li>\n<li>–––, 2012, “The Ubiquity of State-Given\nReasons”, <em>Ethics</em> 122(3): 457–88.</li>\n<li>Schultheis, Ginger, 2018, “Living on the Edge: Against\nEpistemic Permissivism”, <em>Mind</em>, 127(507):\n863–79.</li>\n<li>Setiya, Kieran, 2007, “Cognitivism about Instrumental\nReason”, <em>Ethics</em> 117(4): 649–673.</li>\n<li>Silk, Alex, 2014, “Why ‘Ought’ Detaches: or, Why\nYou Ought to Get With my Friends (If You Want to Be My Lover)”,\n<em>Philosophers’ Imprint</em>, 14(7), pp. 1–16.</li>\n<li>Singh, Keshav, forthcoming, “Rationality Reunified”,\nin Russ Shafer-Landau (ed.), <em>Oxford Studies in Metaethics</em>,\n20.</li>\n<li>Smith, Michael, 1994, <em>The Moral Problem</em>, Oxford:\nBlackwell.</li>\n<li>Smithies, Declan, forthcoming, “The Unity of Evidence and\nCoherence”, in Nick Hughes (ed.), <em>Epistemic Dilemmas</em>,\nOxford: Oxford University Press.</li>\n<li>Southwood, Nicholas, 2008, “Vindicating the Normativity of\nRationality”, <em>Ethics</em>, 119(1): 9–30.</li>\n<li>Staffel, Julia, 2020, “Reasons Fundamentalism and Rational\nUncertainty – Comments on Lord, <em>The Importance of Being\nRational</em>”, <em>Philosophy and Phenomenological\nResearch</em>, 100(2): 463–68.</li>\n<li>Sylvan, Kurt, 2015, “What Apparent Reasons Appear to\nBe”, <em>Philosophical Studies</em>, 172(3): 587–606.</li>\n<li>–––, 2021a, “Respect and the Reality of\nApparent Reasons”, <em>Philosophical Studies</em>, 178(10):\n3129–56.</li>\n<li>–––, 2021b, “The Eclipse of Instrumental\nRationality”, in Kurt Sylvan and Ruth Chang (eds.), <em>The\nRoutledge Handbook of Practical Reason</em>, Routledge, pp.\n482–504.</li>\n<li>Titelbaum, Michael, 2015, “Rationality’s Fixed\nPoint”, in Tamar Gendler and John Hawthorne (eds.), <em>Oxford\nStudies in Epistemology</em>, vol. 5, Oxford: Oxford University Press,\npp. 253–292.</li>\n<li>Timmermann, Jens, 2022, <em>Kant’s Will at the Crossroads:\nAn Essay on the Failings of Practical Rationality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Velleman, J. David, 1989, <em>Practical Reflection</em>,\nPrinceton: Princeton University Press.</li>\n<li>Wallace, R. Jay, 2001, “Normativity, Commitment, and\nInstrumental Reason”, <em>Philosophers’ Imprint</em>,\n1(3): 1–26.</li>\n<li>Way, Jonathan, 2009, “Two Accounts of the Normativity of\nRationality”, <em>Journal of Ethics and Social Philosophy</em>\n(Discussion Note): 1–8.</li>\n<li>–––, 2010, “Defending the Wide-Scope\nApproach to Instrumental Reason”, <em>Philosophical\nStudies</em>, 147(2): 213–33.</li>\n<li>–––, 2011, “The Symmetry of Rational\nRequirements”, <em>Philosophical Studies</em>, 155(2):\n227–39.</li>\n<li>–––, 2012, “Explaining the Instrumental\nPrinciple”, <em>Australasian Journal of Philosophy</em>, 90(3):\n487–506.</li>\n<li>–––, 2013, “Intentions, Akrasia, and Mere\nPermissibility”, <em>Organon F</em>, 20(4): 588–611.</li>\n<li>–––, 2016, “Two Arguments for\nEvidentialism”, <em>The Philosophical Quarterly</em>, 66(265):\n805–18.</li>\n<li>–––, 2018, “Reasons and\nRationality”, in Daniel Star (ed.), <em>The Oxford Handbook of\nReasons and Normativity</em>, 485–503, Oxford: Oxford University\nPress.</li>\n<li>Wedgwood, Ralph, 2002, “Internalism Explained”,\n<em>Philosophy and Phenomenological Research</em>, 65(2):\n349–369.</li>\n<li>–––, 2017, <em>The Value of Rationality</em>,\nOxford: Oxford University Press.</li>\n<li>White, Roger, 2005, “Epistemic Permissiveness”,\n<em>Philosophical Perspectives</em>, 19(1): 445–59.</li>\n<li>Whiting, Daniel, 2014, “Keep Things in Perspective: Reasons,\nRationality and the A Priori”, <em>Journal of Ethics and Social\nPhilosophy</em>, 8(1): 1–22.</li>\n<li>Worsnip, Alex, 2016a, “Belief, Credence, and the Preface\nParadox”, <em>Australasian Journal of Philosophy</em>, 94(3):\n549–562.</li>\n<li>–––, 2016b, “Moral Reasons, Epistemic\nReasons, and Rationality”, <em>Philosophical Quarterly</em>,\n66(263): 341–361.</li>\n<li>–––, 2018a, “The Conflict of Evidence and\nCoherence”, <em>Philosophy and Phenomenological Research</em>,\n96(1): 3–44.</li>\n<li>–––, 2018b, “What is\n(In)coherence?”, in Russ Shafer-Landau (ed.), <em>Oxford Studies\nin Metaethics</em>, vol. 13, Oxford: Oxford University Press, pp.\n184–206.</li>\n<li>–––, 2021, <em>Fitting Things Together:\nCoherence and the Demands of Structural Rationality</em>, New York:\nOxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "bounded rationality",
            "Dutch book arguments",
            "evidence",
            "intention",
            "logic, normative status of",
            "motivation",
            "practical reason",
            "rational choice, normative: expected utility",
            "rational choice, normative: rivals to expected utility",
            "rationality",
            "rationality: instrumental",
            "reasons for action: internal vs. external",
            "reasons for action: justification, motivation, explanation",
            "weakness of will"
        ],
        "entry_link": [
            {
                "../bounded-rationality/": "bounded rationality"
            },
            {
                "../dutch-book/": "Dutch book arguments"
            },
            {
                "../evidence/": "evidence"
            },
            {
                "../intention/": "intention"
            },
            {
                "../logic-normative/": "logic, normative status of"
            },
            {
                "../practical-reason/": "practical reason"
            },
            {
                "../rationality-normative-utility/": "rational choice, normative: expected utility"
            },
            {
                "../rationality-normative-nonutility/": "rational choice, normative: rivals to expected utility"
            },
            {
                "../rationality-instrumental/": "rationality: instrumental"
            },
            {
                "../reasons-internal-external/": "reasons for action: internal vs. external"
            },
            {
                "../reasons-just-vs-expl/": "reasons for action: justification, motivation, explanation"
            },
            {
                "../weakness-will/": "weakness of will"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=rationality-structural\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/rationality-structural/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=rationality-structural&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/rationality-structural/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=rationality-structural": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/rationality-structural/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=rationality-structural&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/rationality-structural/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Hussain, Nadeem, 2007,\n “<a href=\"https://philpapers.org/go.pl?id=HUSTRO&amp;proxyId=&amp;u=https%3A%2F%2Fphilpapers.org%2Farchive%2FHUSTRO.pdf\" target=\"other\">The Requirements of Rationality</a>”,\n unpublished manuscript, Stanford University, version 2.4.",
            "MacFarlane, John, 2004,\n “<a href=\"http://www.johnmacfarlane.net/normativity_of_logic.pdf\" target=\"other\">Is Logic Normative for Thought?</a>”,\n unpublished manuscript.",
            "<a href=\"https://peasoupblog.com/2018/07/ndpr-forum-the-normativity-of-rationality/\" target=\"other\">NDPR Forum on Benjamin Kiesewetter’s <em>The Normativity of Rationality</em></a>,\n PEA Soup Blog.",
            "<a href=\"https://peasoupblog.com/category/discussions/metaethics/reasons-and-rationality/\" target=\"other\">PEA Soup, Category: Reasons and Rationality</a>."
        ],
        "listed_links": [
            {
                "https://philpapers.org/go.pl?id=HUSTRO&proxyId=&u=https%3A%2F%2Fphilpapers.org%2Farchive%2FHUSTRO.pdf": "The Requirements of Rationality"
            },
            {
                "http://www.johnmacfarlane.net/normativity_of_logic.pdf": "Is Logic Normative for Thought?"
            },
            {
                "https://peasoupblog.com/2018/07/ndpr-forum-the-normativity-of-rationality/": "NDPR Forum on Benjamin Kiesewetter’s The Normativity of Rationality"
            },
            {
                "https://peasoupblog.com/category/discussions/metaethics/reasons-and-rationality/": "PEA Soup, Category: Reasons and Rationality"
            }
        ]
    }
}