{
    "url": "real-essence",
    "title": "Locke on Real Essence",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Jan-Erik Jones\n<je.jones@svu.edu>",
        "author_links": [
            {
                "mailto:je%2ejones%40svu%2eedu": "je.jones@svu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\nJan-Erik Jones\n&lt;<a href=\"mailto:je%2ejones%40svu%2eedu\"><em>je<abbr title=\" dot \">.</abbr>jones<abbr title=\" at \">@</abbr>svu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Dec 19, 2012",
        "substantive revision Fri Sep 2, 2022"
    ],
    "preamble": "\n\nThe technical term ‘real essence’ is introduced into the\nphilosophical lexicon by the English philosopher John Locke\n(1632–1704) in his An Essay Concerning Human\n Understanding[1]\n (hereafter “Essay”) that was first published in\nLondon, in December of 1689. In order to understand a great many of\nLocke’s arguments in Books III and IV of the Essay, it\nis important to understand what a real essence is. Thus, the purpose\nof this entry is to explain the various interpretations of ‘real\nessence’ that are in the current literature. Another reason why\nthis matters is that the concept of ‘real essence’ (or\nvariations of it) has been at the center of much of the philosophical\ndebate over natural kind realism since the time of Locke, so some of\nthis entry can serve as an historical introduction to that debate as\nwell.\n\nVery simply stated, a real essence, for Locke, is what makes something\nwhat it is, and in the case of physical substances, it is the\nunderlying cause of the object’s observable qualities (unless\notherwise noted, we shall confine our discussion in this article to\nthe real essences of material substances). A nominal essence, on the\nother hand, is an abstract idea that we make when we identify similar\nqualities shared by objects; the nominal essence is the idea of those\nshared similarities. The distinction between real and nominal essences\nplays an important semantic role in Book III and an important\nepistemological role in Book IV of the Essay. The semantic\nrole will be discussed more below, but in a nutshell, Locke argues in\nBook III that words have meaning only insofar as we can attach ideas\nto them. Since nominal essences are the abstract ideas we use to name\nand distinguish the species or genera of things, the meanings of our\nspecies or genera terms just are abstract ideas. For example, a common\nidea of penguins is of short, black and white flightless waterfowl.\nThat abstract idea is the meaning of the word ‘penguin’.\nBy contrast, Locke goes on to argue, we have no ideas of real essences\nand so our species or genus terms refer to the nominal essences, not\nto the real essences (II.xxxi.6; citations to Locke’s\nEssay are given as book, chapter, section; so Book II,\nchapter xxxi, section 6 is given as “II.xxxi.6”).\n\nRegarding knowledge, in Book IV Locke argues that knowledge is real\nonly if our ideas correspond to their archetypes in the appropriate\nway. Scientific knowledge occurs when our nominal essence ideas match\nthe real essences. According to Locke, in mathematics and morality the\nnominal and real essences are the same. That is, the definitions of\nmathematical or moral concepts constitute both the nominal and real\nessences of those concepts. For that reason it is possible to have a\nhuman science of mathematics and morality. In the case of substances,\nhowever, the real and nominal essences are always different, and so\nthere is no possible human science of substances\n(IV.vi.12–16).\n",
    "toc": [
        {
            "#ReaEssSub": "1. Essences of Substances: Real and Nominal"
        },
        {
            "#HisBacSchSubFor": "2. Polemics: Real and Nominal Essences vs. Scholastic Substantial Forms"
        },
        {
            "#HisAntBacBoy": "3. Historical Antecedents: Bacon and Boyle"
        },
        {
            "#IntIss": "4. Interpretive Issues"
        },
        {
            "#RelReaEss": "4.1 Relativized Real Essences"
        },
        {
            "#IndReaEss": "4.2 Individual Real Essences"
        },
        {
            "#ReaEssNatKin": "4.3 Real Essences & Natural Kinds"
        },
        {
            "#ReaEssIntConSub": "4.4 Real Essences, Internal Constitutions and Substance"
        },
        {
            "#ReaEssSimIdeMod": "5. Real Essences of Simple Ideas and Modes"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#OriSou": "Original Sources"
        },
        {
            "#GenStuLoc": "General Studies of Locke"
        },
        {
            "#IntLocReaEss": "Interpretations of Locke on Real Essences"
        },
        {
            "#IntLocNatKin": "Interpretations of Locke on Natural Kinds"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Essences of Substances: Real and Nominal\n\nThe canonical definition of the real essences is given in III.iii.15,\nwhere Locke contrasts his ‘real essences’ with what he\ncalls ‘nominal essences’:\n\n\nFirst, Essence may be taken for the very being of any thing,\nwhereby it is, what it is. And thus the real internal, but generally\nin Substances, unknown Constitution of Things, whereon their\ndiscoverable Qualities depend, may be called their\nEssence…Secondly,…it being evident,\nthat Things are ranked under Names into sorts or Species,\nonly as they agree to certain abstract Ideas, to which we\nhave annexed those Names, the Essence of each Genus,\nor Sort, comes to be nothing but that abstract Idea, which\nthe General, or Sortal (if I may have leave so to call it\nfrom Sort, as I do General from Genus,)\nName stands for. And this we shall find to be that, which the Word\nEssence imports, in its most familiar use. These two sorts of\nEssences, I suppose, may not unfitly be termed, the one the\nReal, the other the Nominal Essence.\n\n\nReal essences are the unknown constitutions which cause the\nobservable qualities of substances, and the nominal essences are the\nabstract ideas that constitute the definitions of species or genera.\nTo flesh this out a little more clearly we must define a few more\nterms.\n\nLocke defines the ‘quality’ of any substance as “the\nPower to produce any Idea in our mind” (II.viii.8).\nThere are three categories of qualities according to the mechanical\nnatural philosophy. Primary qualities are the inseparable\nfeatures of a body, e.g., its solidity, extension,\nfigure, motion or rest, number, situation, etc. (II.viii.9 &\n23). Secondary qualities are the colors, sounds, smells,\ntastes, etc., of any object. These are secondary because\nthese features of objects do not exist in the objects themselves, but\nrather are nothing but the power of the primary qualities of the\nobject to produce an idea in us of a certain kind (II.viii.10). So,\nfor example, the color of the table is not in the table, rather, it is\npart of how the matter and texture of the table (i.e., its primary\nqualities), as it reflects, absorbs and refracts light, has the power\nto produce ideas in us of that color. Finally, the tertiary\nqualities of a body are those powers in it that, by virtue of its\nprimary qualities, give it the power to produce observable changes in\nthe primary qualities of other bodies, e.g., the power of the sun to\nmelt wax is a tertiary quality of the sun (II.viii.23).\n\nWhen one creates a nominal essence, one is cobbling together a\ncollection of particular qualities—from among these three kinds\nof qualities—that one observes together in a substance and\nmaking that collection definitive of a species or genus. Having said\nthat, I should point out that when Locke thinks of a species\nor genus, he is not thinking of these terms as applying\nexclusively in the biological realm, but rather as applying generally\nto any possible classification scheme we create when we organize our\nworld through naming. So, for example, gold is as much a\nspecies of the genus metal as human is a species of\nthe genus animal.\n\nThe term ‘nominal’ refers to names or naming, and is used\nby Locke to indicate that classifying substances based on their\nsimilar qualities is an exercise in naming. For example, the nominal\nessence of gold is the abstract idea that constitutes our definition\nof ‘gold’, i.e., yellowish, heavy, malleable metal that\ncan be dissolved in Aqua Regia, but not in sulfuric acid,\netc. According to Locke, the nominal essence contains the properties\nthat give meaning to the name ‘gold’ and allow us to know\nwhat gold is wherever we find it. What makes the nominal essence an\nessence is that it contains both the necessary and sufficient\nconditions for something to belong to its species or genus. Because of\nhow gold is defined, every yellowish, heavy, malleable metal that\ndissolves in water and hydrochloric acid and not in sulfuric acid, is\ngold.\n\nIn this way, nominal essences are created by human choice: we decide\nwhat we want to include in our definitions of species or genera. To\nborrow from Locke, species are “the workmanship of the\nunderstanding”, not of nature.\n\n\nI would not here be thought to forget, much less to deny, that Nature\nin the Production of Things, makes several of them alike: there is\nnothing more obvious, especially in the Races of Animals, and all\nThings propagated by Seed. But yet, I think, we may say, the\nsorting of them under Names, is the Workmanship of the\nUnderstanding, taking occasion from the similitude it observes\namongst them, to make abstract general Ideas, and set them up\nin the mind, with Names annexed to them, as Patterns, or Forms, (for\nin that sense the word Form has a very proper signification,) to\nwhich, as particular Things existing are found to agree, so they come\nto be of that Species, have that Denomination, or are put into that\nClassis. (III.iii.13)\n\n\nNature provides us with similarities and we create definitions of\nspecies and genera. However, no matter how dependent general names are\non our definitions, we are answerable to nature and must keep our\ndefinitions as close as we can to what nature provides. It is in this\nsense that species and genera are the workmanship of the human\nunderstanding; we take what nature gives us and we create our own\ndefinitions and taxonomical categories.\n\nOn the other hand, a real essence is an essence\nbecause it makes the object to be what it is. It is real in\nthat it does not include human choice for it to be what it is, rather,\nit is precisely as nature made it. In the case of a piece of gold, the\nreal essence for the corpuscularian is that collection of\nparticles that make up that particular piece of gold and give it its\nqualities of color, weight, electrical conductivity, malleability,\netc.\n2. Polemics: Real and Nominal Essences vs. Scholastic Substantial Forms\n\nNatural philosophy (as contrasted with metaphysics and mathematics) in\nthe Aristotelian tradition is the science of physical substances in\nthe sublunary world. The aim of natural philosophy is knowledge of\ncauses, and for the Aristotelian tradition, this includes knowledge\nof essences. Locke’s above definition of real and\nnominal essences is given as a critical response to the Aristotelian\ninfluenced Scholasticism of the late medieval and early renaissance\nnatural philosophy. Locke’s distinction between real and nominal\nessences appears to be in reference to the Aristotelian distinction\nbetween real and nominal definitions. A real definition, according to\nthe Aristotelian tradition, is one that accords with the natural\nhierarchy and identifies the essence of the species or genus being\nstudied, e.g., ‘man is the rational animal’\n(reason being the essence of the species, animal\nbeing the genus). A nominal definition, by contrast, is a\npseudo-definition that identifies the members of the species or genus,\nbut fails to capture the essence, e.g., ‘man is the featherless\nbiped’. A science of nature, for Aristotle and the Scholastics,\nconsists of real definitions and not mere nominal ones. While Locke\nagrees that a science requires knowledge of essences, and thus of\nspecies, he differs from the Aristotelians by arguing that there are\nno real definitions of substances, but there are of moral and\nmathematical concepts (see Ayers 1996, Locke, vol. II, pp.\n18–30). This account of real essences, then, is crafted to\nbe capacious enough to accommodate both the Aristotelian and\ncorpuscularian versions on offer. \n\nAccording to the Scholastic way of understanding the term\n‘essence’, it refers to what makes a thing what it is:\n\n\nConcerning the real Essences of corporeal Substances, (to mention\nthose only,) there are, if I mistake not, two Opinions. The one is of\nthose, who using the Word Essence, for they know not what,\nsuppose a certain number of those Essences, according to which, all\nnatural things are made, and wherein they do exactly every one of them\npartake, and so become of this or that Species.\n(III.iii.17)\n\n\nThe Scholastic concept of essence, or what is more properly called a\n‘substantial form’, is of an imperceptible, immaterial\nessence that imposes order onto the matter that it is joined with and\nmakes it a member of a natural species or genus, imbuing it with all\nof its relevant characteristics, i.e., its essential properties.\nEssential properties are those features that tell us to what species\nor genus an object belongs, e.g., being warm blooded is an essential\nproperty of mammals, being rational is an essential property of\nhumans, being yellowish and heavy are essential properties of gold.\nEach of these essential properties is caused by the substantial form\nthat is conjoined with the matter of the substance to make it what it\nis.\n\nIn this way, then, the substantial form of any object in the\nScholastic theory plays two roles: it (a) tells us to what species the\nsubstance belongs; and (b) it causes the observable qualities and\nproperties of the substance. For example, according to the Scholastic\ntheory, a lump of gold is an instance of gold because its\nmatter possesses the substantial form of gold which causes all of the\nproperties of gold, e.g., malleability, yellowish color, heaviness,\netc..\n\nBy contrast, however, Locke does not think of the essence of a\nphysical object as an immaterial substantial form, nor does he think\nthat a single entity can play both roles of determining the species or\ngenus membership of a substance and be the unobservable\nunderlying cause of the qualities of the substance. Instead, Locke\ndivides up the concept of essence into two different concepts playing\ntwo distinct roles. First, he defines the real essence of physical\nobjects as the internal constitution of the substance that is the\ncause of the observable qualities of the object. He then argues that\nthis internal constitution is not what answers the ‘what is\nit?’ question because the species membership of physical beings\nis only determined by their outward appearance, i.e., by their nominal\nessences. Second, he defines the nominal essence as that collection of\nobservable qualities that are included in the definition of the\nspecies or genus. This process has three stages; we create an abstract\nidea based on similarities among objects, we then give a name to that\nabstract idea, and finally we classify objects that fit our abstract\nidea into the same species or genus. So, for Locke, the real essence\nplays role (b), that is, the causal and explanatory role of being the\nphysical cause of the properties and qualities of each substance; but\nonly the nominal essence plays role (a), that is, the nominal essence\nalone determines its species or genus membership. The chart below\nillustrates this division of labor:\n\n\n\n \n(a) Determines Species/Genus\n\nMembership\n(b) Causes/Explains Observable\n\nQualities \n\nScholastics\nSubstantial Form\nSubstantial Form \n\nLocke\nNominal Essence\nReal Essence  \n\n\nOne of Locke’s main purposes in making this distinction is to\ndeploy it in his criticisms of the Scholastic account of (a), the\nspecies of natural substances. However, when criticizing the\nScholastic account of (b), the explanation of the qualities of bodies,\nLocke typically refrains from invoking the concept of ‘real\nessence’ and instead talks about the primary, secondary and\ntertiary qualities of bodies (see, for example II.viii.10–26).\nSo, at a minimum, it seems that Locke invoked this distinction between\nreal and nominal essences in order to prove a negative point: real\nessences are not relevant to role (a).\n\nAs noted above, according to the Scholastics, species and genera are\ncreated by nature; every natural substance is a combination of matter\nand substantial form. The substantial form of any substance is its\nspecies essence, which is an immaterial entity that makes the object\nwhat it is, makes it a member of a particular species and genus and\ncauses its characteristic properties. So, for the Scholastics, all\nnatural substances belong to a determinate species by nature,\nindependently of any human naming activities. On this view then, if we\nknow what qualities a substance possesses, and we know that all\nqualities are produced by a substantial form, then it is a simple\nmatter to determine its species simply by noting the qualities the\nsubstance exhibits. For example, if what makes a particular object a\npiece of gold is the possession of the substantial form of gold, then\nwhatever exhibits the properties of gold has the substantial form of\ngold, and so we know the species to which it belongs is gold.\nCreating a taxonomy for the Scholastics is attempting to discover how\nnature has already classified substances into species and genera by\nlooking for similarities among their persistent qualities (qualities\nthat tend to remain even when the circumstances or conditions of the\nobject change) that reveal the deeper similarity of sharing\nsubstantial forms.\n\nBy distinguishing between real and nominal essences, Locke can deploy\nthese new concepts in a sustained critique of the Scholastic theory of\nspecies. Locke offers three main arguments against the Scholastic\nview.\n\nFirst, he deploys the corpuscularian hypothesis against the\nScholastics to argue that ‘borderline cases’ create a\nserious challenge to their doctrine of substantial forms, but which\nare allowed for, and even explained by, corpuscularian principles. By\nhis lights, if we assume that nature produces substances by imposing a\nsubstantial form (what Locke mockingly calls ‘moulds and\nforms’), or species essence onto them, then the existence of\nentities that either fit into more than one species, or do not fit\ninto any single species, shows us at least that not all beings are\nproduced according to natural moulds and forms:\n\n\n[The opinion] which supposes these Essences, as a certain\nnumber of Forms or Molds, wherein all natural Things, that exist, are\ncast, and do equally partake, has, I imagine, very much perplexed the\nKnowledge of natural Things. The frequent Productions of Monsters, in\nall the Species of Animals, and of Changelings, and other strange\nIssues of humane Birth, carry with them difficulties, not possible to\nconsist with this Hypothesis: Since it is as impossible, that\ntwo Things, partaking exactly of the same real Essence,\nshould have different Properties, as that two Figures partaking in the\nsame real Essence of a Circle, should have different\nProperties. (III.iii.17)\n\n\nIf nature made species or genera by giving all members of the same\nkind the same form or mould (or, he seems to suggest above, real\nessence), then there would be no way to explain generative variation\nin nature (he reiterates this kind of argument in III.vi.15–17)\nor the differences between samples of the same species of chemicals or\nminerals. On the other hand, if nature makes real essences, which are\nmaterial structures that cause the observable qualities of each\nsubstance, then these kinds of variations can be explained by\nvariations among the physical structures of the bodies (see Jolley\n1999, pp. 144–50).\n\nSecondly, as we saw above, Locke adduces the semantic point that our\ngeneral terms (and their corresponding ideas), being human constructs\nvia the process of abstraction, constitute the (nominal)\nessences of things, not some immaterial substantial form:\n“Whereby it is evident, that the Essences of the\nsorts, or (if the Latin word pleases better) Species\nof Things, are nothing else but these abstract Ideas”\n(III.iii.12). Abstract ideas are formed when we take a set of objects\nand mentally strip away enough particular ideas to reveal what\nproperties they all have in common. The resulting ideas are purely\nmental constructions; the putative substantial forms of the objects\nare irrelevant to this process. Therefore, essences and species are\nhuman constructs, not the products of nature, i.e., they are purely\nnominal.\n\nLocke’s third argument rests on the Scholastic’s\nassumption that nature produces many things alike. The natural\nproduction of physically similar entities, however, is a double-edged\nsword. Nature not only produces similarities among objects, but it\nproduces far too many similarities. That is, among the vast array of\nsimilar qualities that objects share we must select those few which we\ntake to be important enough to constitute the meaning of the general\nterm and thereby constitute the species or genus. This selection\nprocess is not something that nature can do, only we can decide which\nqualities are important enough to count as part of the definition of a\nspecies or genus.\n\nLocke has a further argument up his sleeve: generality does not exist\nin nature. For the Aristotelian tradition, perception occurs when the\nmind receives the form (i.e., sensible species) without the\nmatter of the substance. So, the human mind has access\nto forms (which are general) through\nperception. However, in the lead up to III.iii.15, Locke\nstresses that generality occurs only in words and ideas, not in nature\n(III.iii.1, 10, 13), and that we do not perceive substantial\nforms (II.xxiii.3; II.xxxi.6). Nominal essences provide the only\nuniversality we possess in natural philosophy (III.iii.9, 10, 11).\n\nBy introducing the distinction between real and nominal essences and\nthereby dividing their roles, Locke has provided himself with a number\nof resources to criticize the Scholastic theory of species. There are,\nhowever, reasons to worry about the viability of these criticisms.\nAfter all, these arguments seem to beg the question against the\nAristotelian tradition. The existence of substantial forms need not\nentail the existence of hard-edged natural kinds, and so Locke's\n'moulds and forms' metaphor does not damage the Aristotelian\nposition. In the borderline cases argument, the Aristotelian tradition\ncan appeal to their matter/form distinction and remind Locke that even\nthough the form guides the changes in material substances, not all\nmatter is suitable for all changes. That is, a form is\nteleological and is what guides the matter as it\nachieves its final cause, but not all matter is suitable to\nachieve that end. For example, wood might be highly suitable to\nconstruct a ship, but stone would not be. The matter, if\nsuitable, may indeed achieve the end of the formal cause, however,\nwhen the matter is not suitable it can result in\nmonsters and deformities. With regard to abstract ideas, i.e., nominal\nessences, being the foundation of species, the Aristotelian tradition\ncan surely reject the claim that the form plays no role in the\nformation of our abstract ideas. So long as our abstract ideas must be\nanswerable to what exists in nature, and so long as nature presents us\nwith the effects of the substantial form, what we have\navailable to include in our nominal essences will be very\nmuch rooted in the substantial form. This same argument can be applied\nto the third criticism as well; substantial forms guide our\nselection of nominally essential properties because they carve nature\nat its joints and help some appear more natural than others. Finally,\nthe claim that generality does not exist in nature\nis question-begging: if there are substantial forms, then there\nis generality in nature.\n\nIt is likely that Locke was aware of the limits of these criticisms,\nafter all, he was both educated with and taught Scholastic texts.\nNevertheless, as Jolley argues (1999, 146), Locke could reply\nby arguing that the properties of bodies are\ncausally dependent on their essences, just as all the properties\nof every triangle flow from the essences of the triangles,\nbut then why do mathematical and geometrical essences\nproduce hard-edged kinds while the essences of material bodies do\nnot? More to the point, if substantial forms are causal and\nexplanatory posits in Aristotelian scientia, and they are\nheld to be knowable via perception, but the evidence\nfrom perception yields a host of borderline cases, then it\nis plausible to conclude that either substantial forms are not doing\ntheir job or there are no such forms. However, this reply will\nnot cut much ice with the Aristotelians, who have yet to be shown\nwhy their appeal to the weakness of matter is insufficient to explain\ngenerative variation.\n\nPerhaps a more powerful interpretation of Locke's arguments would be\nto see them as an empirical challenge to (rather than as a refutation\nof) the idea that nature comes pre-structured by substantial forms. In\nreference to borderline cases, Locke could be arguing that, without\nassuming that there are substantial forms, nature does not give us\nconvincing evidence of such order. The semantic argument can be seen\nas a similar empirical challenge: there is no evidence that nature is\nnarrowly constraining the creation of our nominal essences (we have\nbroad latitude in their creation), but if there were substantial forms\nwe should expect much less latitude. It is this challenge that seems\nto undergird Locke's third argument: even though nature provides us\nwith the qualities we ultimately include in our nominal essences, it\nis up to us to determine what goes into each nominal essence, and\nthere is no place for a substantial form to be involved in that\nprocess. Although this might be a stretch, even Locke's fourth\ncriticism may still function as an empirical challenge. Perception is\na highly contentious subject that seems beyond our ability to explain,\neven by appeal to the existence of substantial forms. So, without\nevidence that there are such forms, there is no reason to take nature\nto be the locus of generality. Whether these replies would be\neffective, or even whether these are what Locke had in mind, it is\nclear that Locke was convinced that substantial forms are not a viable\ncomponent of natural philosophy.\n3. Historical Antecedents: Bacon and Boyle\n\nWhile the concept and definition of ‘real essence’ is\noriginal with Locke, at least a generation before him there were\nEnglishmen who defended non-Scholastic taxonomical theories that\nemployed material structures, either atomic or corpuscularian\nstructures, to play both roles (a) and (b), and therefore serve as the\nessences of physical substances. One notable example is from Sir\nFrancis Bacon.\n\nIn Book II §§i–vii of The New Organon (1620),\nBacon seems to give a version of corpuscular natural kinds by\nredefining the concept of ‘formal cause’ as both the\nmaterial structure of bodies and the laws that govern the natural\neffects of these structures that accounts for their species and genus\nmembership. For example, in II.ii he says,\n\n\nFor though nothing exists in nature except individual bodies which\nexhibit pure individual acts [powers] in accordance with law…It\nis this law and its clauses which we understand by the term\nForms…. (Bacon 1620, 103)\n\n\nAnd later in II.iii: “But he who knows forms comprehends the\nunity of nature in very different materials” (Bacon 1620, 103).\nThese Baconian forms, as they constitute the powers of material\nbodies, divide nature into two classes of material structures: the\nelements (what he calls ‘major associations’) and the\ngenera and species of natural bodies (his ‘minor\nassociations’):\n\n\nWe want elements to be understood in the sense not of the prime\nqualities of things, but of the major constituents of natural bodies.\nFor the nature of things is so distributed that the quantity or mass\nof certain bodies is very great, because their structure requires the\ntexture of an easy and common material…But the quantity of\ncertain other bodies in the universe is small and occurs rarely,\nbecause the texture of their matter is very different, very subtle and\nfor the most part delimited and organic; such are the species of\nnatural things, metals, plants, animals. (Bacon 1620, 226)\n\n\nAccording to Bacon, more general material structures convene to create\nlarger—and more sparse—bodies, and given the laws of\nnature that correlate powers to these structures, these bodies have\ntheir natures and belong to a species or genus due to the structures\nand causal powers of their constituent parts. Baconian forms exhibit\nthe two features of what me might call ‘corpuscular\nforms’: material structures plus the laws of nature combine to\ncause and explain the properties of bodies and determine their species\n membership.[2]\n\nSimilarly, in the Origine of Formes and Qualities, Robert\nBoyle employs the concept of a material essence when he argues for the\nexistence of corpuscular forms that do all the same philosophical and\nexplanatory work as both the real and nominal essences:\n\n\n…why may we not say, that the Form of a Body, being made up of\nthose Qualities united in one Subject, doth likewise consist in such a\nConvention of those newly nam’d Mechanical Affections of Matter,\nas is necessary to constitute a Body of that Determinate kind. And so,\nthough I shall for brevities sake retain the word Forme, yet\nI would be understood to mean by it, not a Real Substance\ndistinct from Matter, but onely the Matter it self of a Natural Body,\nconsider’d with its peculiar manner of Existence [corpuscular\nstructure], which I think may not inconveniently be call’d\neither its Specifical or its Denominating State, or\nits Essential Modification, or, if you would have me express\nit in one word, its Stamp: for such a Convention of Accidents\nis sufficient to perform the Offices that are necessarily\nrequir’d in what Men call a Forme, since it makes the\nbody such as it is, making it appertain to this or that Determinate\nSpecies of Bodies, and discriminating it from all other Species of\nBodies whatsoever…. (Boyle 1666, p. 324.)\n\n\nThat is, Boylean corpuscular forms both cause and explain the\nqualities of bodies and sort natural bodies into species based on the\nstructure of the matter and the laws binding qualities to the specific\n structures.[3]\n\nSo, we see that there are corpuscular versions of natural kind realism\nafoot in early seventeenth-century England where both roles of\ndetermining the species or genus membership and of causing and\nexplaining the observable qualities are played by the same entity:\ncorpuscular structure. The degree to which Locke agrees with, rejects\nor even engages with these views is a matter of scholarly\ncontroversy.\n\nNevertheless, we can say that, just as with the Scholastic natural\nphilosophy, there were adherents to the mechanical natural philosophy\nwho postulated a single entity to play both the causal and\nclassificatory roles; we can call these philosophers\n‘corpuscular realists’ and we may say that they argue for\nthe existence of what we might call ‘corpuscular species’,\ni.e., species created by nature by corpuscular forms. By contrast,\nagain, Locke objects to this general approach for the creation of a\nscientific taxonomy:\n\n\nNor indeed can we rank, and sort Things, and\nconsequently (which is the end of sorting) denominate them by\ntheir real Essences, because we know them not. Our Faculties\ncarry us no farther towards the knowledge and distinction of\nSubstances, than a Collection of those sensible Ideas, which\nwe observe in them; which however made with the greatest diligence and\nexactness, we are capable of, yet is more remote from the true\ninternal Constitution, from which those Qualities flow, than, as I\nsaid, a Countryman’s Idea is from the inward\ncontrivance of that famous Clock at Strasburg, whereof he\nonly sees the outward Figure and Motions. (III.vi.9)\n\n\nIf we have no knowledge of real essences, then there is no way to use\nreal essences in our sorting practice. Moreover, as he alludes at the\nend of the quotation, in order for a general inference about the\ninternal constitutions of substances to be justified, we would have to\nknow a lot more about the causal connections between the internal\nconstitution and what we observe than we do:\n\n\n…it is impossible for us to know, that this or that quality or\nIdea has a necessary connexion with a real Essence, of which\nwe have no Idea at all, whatever Species that supposed real\nEssence may be imagined to constitute. (IV.vi.5)\n\n\nThe differences between Locke and the natural kind realists from among\nthe ranks of the corpuscularians can be illustrated by the following\nchart:\n\n\n\n \n(a) Determines Species/Genus\n\nMembership\n(b) Causes/Explains Observable\n\nQualities \n\nScholastics\nSubstantial Form\nSubstantial Form \n\nCorpuscular Realists\nCorpuscular Form\nCorpuscular Form \n\nLocke\nNominal Essence\nReal Essence  \n\n\nThere are Locke scholars who (though this is controversial) argue that\nLocke uses this distinction between real and nominal essences to\ncriticize the taxonomical theories of both the Scholastics and those\nmechanistic natural philosophers who invoke corpuscular species forms\n(see Jones 2010, pp. 147–172).\n\nIt is universally agreed that Locke thinks that we sort things into\nspecies and genera based on nominal essences and species and genera\nare a kind of human linguistic categorization process. On the other\nhand, one might think, Locke has no reason to reject natural kinds\n(which concern the metaphysics of nature, and not the meanings of\nnames) simply because our sorting process is arbitrary. In other\nwords, there are those who argue that Locke was a natural kind\nrealist, even though he was convinced that taxonomies are the\nworkmanship of the understanding. Whether Locke thinks that there are\nnatural kinds, i.e., types of real essences independently of human\nsorting activities, is an interpretive issue we shall address in\n 4.3 below.\n4. Interpretive Issues\n\nIn this section, I discuss four main areas of interpretive dispute\nconcerning real essences: (i) relativized real essences; (ii)\nindividual real essences; (iii) real essences and natural kinds; and\n(iv) real essences, internal constitutions and substance.\n4.1 Relativized Real Essences\n\nThere are two main interpretations of real essences in the literature:\nthe relativized real essence thesis, according to which a real essence\njust is whatever microstructure causes the nominally essential\nqualities of the object; and (for lack of a better name) the\nunrelativized real essence thesis, whereby the real essences consist\nof the total microstructure of the substance, not just the features\ncausally responsible for the nominal essence. Textual evidence for the\nrelativized real essence thesis comes from III.vi.6:\n\n\nBy this real Essence, I mean, that real constitution of any\nThing, which is the foundation of all those Properties, that are\ncombined in, and are constantly found to co-exist with the nominal\nEssence; that particular constitution, which every Thing has\nwithin it self, without any relation to any thing without it. But\nEssence, even in this sense, relates to a Sort, and\nsupposes a Species: For being that real Constitution, on\nwhich the Properties depend, it necessarily supposes a sort of Things,\nProperties belonging only to Species, and not to\nIndividuals…Here are Essences and Properties,\nbut all upon supposition of a Sort, or general abstract Idea,\nwhich is considered as immutable: but there is no individual parcel of\nMatter, to which any of these Qualities are so annexed, as to be\nessential to it, or inseparable from it. That which is\nessential, belongs to it as a Condition, whereby it is of\nthis or that Sort: But take away the consideration of its being ranked\nunder the name of some abstract Idea, and then there is\nnothing necessary to it, nothing inseparable from it.\n [4]\n\n\nSome Locke scholars take this to imply that the real essence is always\nrelativized to the nominal essence for Locke. If properties belong\nonly to species—not to individuals—and real essences are\ndefined as the real constitution of a thing that is the foundation of\nits properties, then it seems to follow that the real essence of a\nthing is defined in relation to the species to which the thing\nbelongs; essences relate to a sort (III.vi.4).\n\nCritics of the relativized real essence interpretation of the\nEssay will point out that if real essences are only for\nsorted substances, then Locke ought to consistently use the term\n‘real essence’ whenever referring to the submicroscopic\nstructure of sorted individuals. However, in II.xxiii.37 Locke uses\n‘internal constitution,’ not ‘real essence’ to\nrefer to the causal ground of the nominally essential qualities of\ngold:\n\n\n…the greatest part of the Ideas, that make our complex\nIdea of Gold, are Yellowness, great Weight,\nDuctility, Fusibility, and Solubility, in Aqua Regia,\netc. all united together in an unknown Substratum;\nall which Ideas, are nothing else, but so many relations to\nother Substances; and are not really in the Gold, considered barely in\nit self, though they depend on those real, and primary Qualities of\nits internal constitution, whereby it has a fitness, differently to\noperate, and be operated on by several other Substances.\n\n\nThese powers he lists are nominally essential properties of gold, but\nsince Locke refers to their causal ground as an ‘internal\nconstitution’ and not as a ‘real essence,’ one might\nargue, it seems that ‘real essence’ is not uniquely\nemployed to designate the submicroscopic foundation of the powers\nincluded within the nominal essence.\n\nMoreover, critics of the relativized real essence interpretation will\nlikely focus on the part of (III.vi.6) that seems to bracket off all\nnominally essential qualities from a real essence: “By this\nreal Essence, I mean, that real constitution of any\nThing…which every Thing has within it self, without any\nrelation to any thing without it.” That is, one might argue that\nif we can consider a real essence all by itself, independently of any\nrelations to other objects or observers, then real essences are not\nrelativized to nominal essences because we can consider a real essence\nwithout reference to “any relation to anything without it”\nand nominally essential qualities require relations to observers.\n\nThere are important issues here that a consistent and plausible\ninterpretation of Locke on real essences must take into account. How\none does so will impact what one may say with respect to the\npossibility of real essences for individual objects in Locke.\n4.2 Individual Real Essences\n\nA related, but importantly distinct issue, concerns the possibility of\nreal essences for individuals. On the one hand, if every object has an\nunderlying physical constitution, then there seems to be no problem\nwith thinking of individuals has possessing real essences. On the\nother hand, if real essences are only for sorted individuals, then\nthere are no real essences for individuals until we have classified\nthem by a nominal essence; until an individual is sorted, it only has\nan internal constitution, not a real essence. If one adopts the\nrelativized real essence interpretation of the Essay, then\nthere are no real essences for unsorted individuals. If, however, one\nadopts the unrelativized real essence interpretation, then it appears\npossible that Locke could think that unsorted individuals have a real\nessence and not just an internal constitution.\n\nOf course, in III.vi.4 Locke famously denies that anything is\nessential to a particular:\n\n\n‘Tis necessary for me to be as I am; GOD and Nature has made me\nso: But there is nothing I have, is essential to me. An Accident, or\nDisease, may very much alter my Colour, or Shape; a Fever, or Fall,\nmay take away my Reason, or Memory, or both; and an Apoplexy leave\nneither Sense, nor Understanding, no nor Life…None of these are\nessential to the one, or the other, or to any Individual whatsoever,\ntill the Mind refers it to some Sort or Species of things;\nand then presently, according to the abstract Idea of that\nsort, something is found essential. Let any one examine his\nown Thoughts, and he will find, that as soon as he supposes or speaks\nof Essential, the consideration of some Species, or\nthe complex Idea, signified by some general name, comes into\nhis Mind: And ‘tis in reference to that, that this or that\nQuality is said to be essential. So that if it be asked,\nwhether it be essential to me, or any other particular\ncorporeal Being to have Reason? I say no; no more than it is\nessential to this white thing I write on, to have words in\nit. But if that particular Being, be to be counted of the sort\nMan, and to have the name Man given it, then Reason\nis essential to it, supposing Reason to be a part of the\ncomplex Idea the name Man stands for….\n\n\nHowever, one might argue that in this section Locke is only\nconsidering nominally essential qualities and saying that none of the\ncandidates for nominally essential qualities are essential to a being,\nqua species or genus member, until it has been sorted.\n\nMoreover, the second sentence of III.vi.6, where he inserts the\nclarification that a real essence is “…that particular\nconstitution, which every Thing has within it self, without any\nrelation to any thing without it,” appears to say that there can\nbe real essences of unsorted individuals. If a real essence is\ndefinable as a corpuscular structure cum causal powers that a\nbody has independently of anything else, then it seems to\nfollow that there are individual real essences independently of how we\nsort them. That is, if every natural substance has some submicroscopic\ncorpuscular constitution on which its observable qualities depend,\nthen it seems to follow that unsorted individuals have a real essence\n(see Owen 1991 and Vienne\n 1993).[5]\n\nIn II.xxxi.6, Locke refers to individual real essences: “The like\nignorance I have of the real Essence of this particular Substance, I\nhave also of the real Essence of all other natural ones”. In\nIII.iii.15, as he is defining the concept of a real essence, he says:\n“Essentia, in its primary notation signifying properly\nBeing. And in this sense it is still used, when we\nspeak of the Essence of particular things, without\ngiving them any Name”. One might argue that, if a substance can have\nan essence prior to being named--prior to having a nominal\nessence--then the only other kind of essence it could have is a real\nessence.\n\nIt is possible that Locke was not always clear and consistent in his\nuse of the term ‘real essence’ and that these puzzles are\nimpossible to resolve. However, it is also possible that when Locke\nwas focusing on the precise meanings of terms that he was indeed\ncareful, and there is a consistent interpretation of his views on this\nissue. Either way, any interpretation of Locke on real essences must\ndetermine whether there are real essences for only sorted individuals\nor not.\n4.3 Real Essences & Natural Kinds\n\nAnother important exegetical issue that arises in the Essay\nis whether Locke thought that there are natural kinds based on real\nessences. Scientific disciplines categorize the objects they study\ninto kinds. To say that a kind is natural is to say\nthat a grouping of similar individuals exists independently of human\ndecisions. The hope of each scientific discipline is to identify as\nmany natural kinds as possible within their domain and to determine\ntheir properties accurately. To this end, we create scientific\ntaxonomies, like the periodic table of elements, the phylogenetic\ntree, etc., to organize the kinds we have identified and to study\ntheir properties. On the face of it, the question of whether there are\nnatural kinds in Locke seems to be the same as the question of whether\nthere are species, and as we saw above (in §§1–3)\nLocke denies that there are natural species. However, it is possible\nto distinguish between a species (a classification humans make based\non observed similarities) and a natural kind (a grouping that occurs\nnaturally and independently of human naming practices). Locke is\nclearly aware of this distinction, so it is possible that what he has\nsaid about sorting and nominal essences only reveals what he thinks\nabout nominal essences and our practice of sorting, which is a\nsemantic issue, not about the metaphysics of nature.\n\nTo be sure, there are passages in the Essay that seem to\nindicate that Locke was a natural kind realist even if he was a\nconventionalist about taxonomical practices. For example:\n\n\nThe other, and more rational Opinion, is of those, who look on all\nnatural Things to have a real, but unknown Constitution of their\ninsensible Parts, from which flow those sensible Qualities, which\nserve us to distinguish them one from another, according as we have\nOccasion to rank them into sorts, under common Denominations.\n(III.iii.17)\n\n\nIn other words, one might argue, if real essences cause the observable\nqualities of bodies, and we sort things into species based on\nobservable similarities, then if we assume that similarities among the\nreal essences always results in similar observable qualities, and\nsimilar observable qualities are always caused by similar real\nessences, there is reason to think that Locke assumed that our nominal\nessences track, at least to some degree, real kinds in nature.\n\nThere are places in the Essay where Locke seems to think\nalong these lines. In III.vi.36 he says “Nature makes many\nparticular Things, which do agree one with another, in many\nsensible Qualities, and probably too, in their internal frame and\nConstitution.” In a letter to Molyneux, Locke says:\n\n\nI hope I have no where said, there is no such sort of creatures in\nnature as birds; if I have, it is both contrary to the truth and to my\nopinion. This I do say, that there are real constitutions in things\nfrom whence these simple ideas flow, which we observ’d combined\nin them. And this I farther say, that there are real distinctions and\ndifferences in those real constitutions one from another; whereby they\nare distinguished one from another, whether we think of them or name\nthem or no. (Locke, Works, vol. IV, pp. 305–6)\n\n\nIndeed, there are passages where Locke speaks of the\n“imperfection” of our species ideas and the need to make\nthem better conform to nature. For example, in III.xi.24 he says\nthat:\n\n\nAnd therefore in Substances, we are not always to rest in the ordinary\ncomplex Idea, commonly received as the signification of that\nWord, but must go a little farther, and enquire into the Nature and\nProperties of the Things themselves, and thereby perfect, as much as\nwe can, our Ideas of their distinct Species…\n\n\nThere is no reason, so one may argue, to suspect that our species\nideas could be either perfected or imperfect if there is no natural\nkind archetype. On the other hand, there is some evidence that Locke\nanticipated this kind of account and rejected it. For example, he\nsays:\n\n\n…That we find many of the Individuals that are ranked into one\nSort, called by one common Name, and so received as being of one\nSpecies, have yet Qualities depending on their real\nConstitutions, as far different one from another, as from others, from\nwhich they are accounted to differ specifically. This, as it\nis easy to be observed by all, who have to do with natural Bodies; so\nChymists especially are often, by sad Experience, convinced of it,\nwhen they, sometimes in vain, seek for the same Qualities in one\nparcel of Sulphur, Antimony, or Vitriol, which they have found in\nothers. For though they are Bodies of the same Species,\nhaving the same nominal Essence, under the same Name; yet do\nthey often, upon severe ways of examination, betray Qualities so\ndifferent one from another, as to frustrate the Expectation and Labour\nof very wary Chymists. But if Things were distinguished into\nSpecies, according to their real Essences, it would be as\nimpossible to find different Properties in any two individual\nSubstances of the same Species, as it is to find different\nProperties in two Circles, or two equilateral Triangles.\n(III.vi.8)\n\n\nThis argument is a modus tollens: if the members of a\nnominally defined species had the same type of real essence, then they\nshould all exhibit the same qualities (including those not included in\nthe nominal essence), but they do not exhibit all of the same\nqualities, therefore they do not all have the same type of real\nessence.\n\nThis question of whether real essences could be the foundation of\nnatural kinds for Locke is as old as the Essay itself. Both\nGottfried Wilhelm Leibniz and Edward Stillingfleet, Lord Bishop of\nWorcester, point out that Locke’s position on real essences\nseems to entail that there are natural kinds based on similarities\namong the real essences. As Leibniz put it in his critique of the\nEssay entitled New Essays on Human Understanding\n(1704),\n\n\n[i]t is true that we cannot define a species in terms of something\nwhich is unknown to us [e.g., real essences]; but the outer features\nserve in place of it…. (Leibniz 1704, p. 311)\n\n\nLater, he reiterates this point:\n\n\n[when] I think of a body which is at once yellow, fusible and\nresistant to cupellation, I am thinking of a body whose specific\nessence, though hidden from me within it, gives rise to these\nqualities and reveals itself, at least confusedly, through them.\n(Leibniz 1704, p. 405)\n\n\nLocke died before Leibniz’s New Essays on Human\nUnderstanding were published (they were not published until 1765,\nsixty-one years after Locke’s death and nearly fifty years after\nLeibniz’s death), so we do not have Locke’s response to\nLeibniz’s arguments, nevertheless, Stillingfleet gave a similar\nargument and we have Locke’s replies to him.\n\nLike Leibniz, Stillingfleet appeals to the concept of real essence as\na “natural kind” concept, claiming that there are types of\nreal essences, and belonging to the same natural kind is a function of\npossessing the same kind of real essence:\n\n\nBut in this one sun there is a real essence, and not a mere nominal or\nabstracted essence; but suppose there were more suns; would not each\nof them have the real essence of the sun? For what is it makes the\nsecond sun to be a true sun, but having the same real essence with the\nfirst? If it were but a nominal essence, then the second would have\nnothing but the name. (Locke, Works, vol. IV, p. 83. Here\nLocke is quoting from Stillingfleet’s Discourse in\nVindication of the Doctrine of the Trinity, where the latter\ncriticizes Locke’s Essay.)\n\n\nLocke’s response is to turn the whole discussion away from real\nessences and back onto the nominal essences:\n\n\nYour lordship’s proof here brought out of my Essay,\nconcerning the sun, I humbly conceive will not reach it; because what\nis said there, does not at all concern the real, but nominal essence;\nas is evident from hence, that the idea I speak of there, is a complex\nidea; but we have no complex idea of the internal constitution, or\nreal essence of the sun. Besides, I say expressly, that our\ndistinguishing substances into species by names, is not at all founded\non their real essences. So that the sun being one of these substances,\nI cannot, in the place quoted by your lordship, be supposed to mean by\nessence of the sun, the real essence of the sun, unless I had so\nexpressed it. But all this argument will be at an end, when your\nlordship shall have explained what you mean by these words,\n“true sun.” In my sense of them, any thing will be a true\nsun, to which the name sun may be truly and properly applied; and to\nthat substance or thing, the name sun may be truly and properly\napplied, which has united in it that combination of sensible\nqualities, by which any thing else that is called sun is distinguished\nfrom other substances, i.e. by the nominal essence…. (Locke,\nWorks, vol. IV, pp. 83–4)\n\n\nAlthough this is controversial exegetical territory, it appears that\nLocke is aware of this ‘real essence’ version of natural\nkinds, but it further appears that he is unwilling to discuss it; his\nresponse was to steer clear of the metaphysical claim and return to\nthe semantic issue of nominal essences.\n\nAs natural as it is to interpret Locke as a natural kind realist,\nthere are problematic passages for that interpretation. With respect\nto the similarities among real essences, which was the main concern of\nLeibniz and Stillingfleet, in IV.vi.4 Locke argues that the assumption\nthat species are determined by real essences fails to tell us what\nwould count as a member of any species. That is, because we have no\nknowledge of real essences, no general claims about species would be\njustified and no individual would obviously belong to a particular\nspecies. So the assumption that Leibniz and Stillingfleet propose\nappears to be theoretically unmotivated. Moreover, as Locke’s\nargument in III.vi.39 suggests, similarities in structure of the real\nessences, even if known, would still require us to decide which\nsimilarities (not to mention what degrees of similarity) would amount\nto similar enough to belong together in the same class:\n\n\nFor what is sufficient in the inward Contrivance, to make a new\nSpecies? There are some Watches, that are made with\nfour Wheels, others with five: Is this a specifick difference to the\nWorkman? Some have Strings and Physies, and others none; some have the\nBalance loose, and others regulated by a spiral Spring, and others by\nHogs Bristles: Are any, or all of these enough to make a specifick\ndifference to the Workman, that knows each of these, and several other\ndifferent contrivances, in the internal Constitutions of\nWatches? ‘Tis certain, each of these hath a real\ndifference from the rest: But whether it be an essential, a specifick\ndifference or no, relates only to the complex Idea, to which\nthe name Watch is given: as long as they all agree in the\nIdea which that name stands for, and that name does not as a\ngenerical name comprehend different Species under it, they\nare not essentially nor specifically different. (III.vi.39; see also\nIII.vi.30)\n\n\nOf course, this view has been challenged recently. Allison Kuklok\n(2018) argues that this watch passage does not show that Locke took\nour sorting practices (at either the phenomenal or microphysical\nlevel) to be arbitrary. For her, a mistake that interpreters of Locke\nmake is to claim that the watch passage asserts that there is no fact\nof the matter about how things should be classified, and therefore,\nour classifications are arbitrary. According to Kuklok, this watch\nanalogy is intended to show the irrelevance of hidden internal\ndifferences to species whose boundaries are antecedently drawn at the\nphenomenal level by our natural sorting practices. By her lights, once\nwe acknowledge that passages like the watch analogy do not concern\nclassification, we see that Locke never argued that classification is\narbitrary.\n\nOn her reading, Locke thinks that species are made by the vulgar prior\nto our theorizing about internal constitutions, and these species\ncannot plausibly be understood as the result of arbitrary choice.\nAccording to Kuklok, the naturalness of our classifications stems from\nthe fact that Locke holds that humans have a natural disposition\ntoward species realism, and the fact that nature presents us with\nclusters of ‘leading qualities’ that appear as patterns or\nstandards. A relevant passage from Locke comes from II.xxxii.14: “God\nin His wisdom…set [simple ideas] as Marks of Distinction in Things,\nwhereby we may be able to discern one Thing from\nanother”. Given the vulgar realism and the leading patterns in\nnature, the vulgar classify based on non-arbitrary natural\nsimilarities. It is implausible “to say that the similarities and\ndifferences between things leave it undetermined how we are to group\nand distinguish them” (2022, p. 318). \n\nHowever, those who interpret the watch passage as implying\narbitrariness in classification (see Uzgalis (1988) and Jones (2010))\nwould have at least two replies. First, that ‘arbitrary’\ndoes not mean ‘random’ or that all qualities are equally\nadequate as differentia. The vulgar have good empirical\nreasons for their taxonomies, however, there are lots of similarly\ngood and natural reasons for different taxonomies. That does not imply\nthat every taxonomy is equally as acceptable. Moreover, given the\nbackground of corpuscularians who appeal to corpuscular forms as a\nground for natural kind realism, and given that Locke’s focus is\nthe internal structure and arrangement of objects, it is plausible to\nsee the watch passage as insisting that real essences are not an\nadequate foundation for a theory of natural kinds.\n\nAs we can see, whether, in fact, Locke employed real essences as the\nfoundations of natural kinds is currently one of the hottest debates\namong Locke scholars, and there have been a number of good studies\nwritten in recent years.\n4.4 Real Essences, Internal Constitutions and Substance\n\nThroughout the Essay, Locke discusses real essences, internal\nconstitutions and substratum, and getting clear on each concept is\nrequired in order to produce a consistent and accurate interpretation\nof Locke on real essences. While it is not possible to do justice to\nany of the subjects here, it is important to give some background\nbefore proceeding. When Locke defines the ‘real essence’,\nhe often describes it as “that Constitution, whereon the\nProperties of these several things depended” (III.iii.19). On\noccasion he even connects internal constitutions with essences as if\nthey were synonymous: “[collections of simple ideas] are\ntherefore supposed to flow from the particular internal Constitution,\nor unknown Essence of that Substance” (II.xxiii.3). Similarly,\nthe concept of ‘substance’ or ‘substratum’,\ni.e., pure substance in general, is conceived as an underlying\n‘thing’ which supports, or upholds, the properties of\nbodies:\n\n\nThe Idea then we have, to which we give the general name\nSubstance, being nothing, but the supposed, but unknown support of\nthose Qualities, we find existing, which we imagine cannot subsist,\nsine re substante, without something to support them, we call\nthat Support Substantia; which, according to the true import\nof the Word, is in plain English, standing under, or\nupholding. (II.xxiii.2)\n\n\nThe fact that the Essay uses internal constitutions,\nsubstance, and real essences as the underlying ground of the qualities\nof physical objects has led to some debate over the way Locke\nunderstands the relationship between the three concepts.\n\nRegarding the relationship between real essences and substance in\ngeneral, Michael Ayers has argued that Locke uses the terms\n‘substance’ and ‘real essence’ as\nextensionally equivalent, but not intensionally equivalent. That is,\nboth terms refer to the same objects, but convey a very different\nmeaning. For Ayers, Locke’s use of ‘substance’\nconveys the idea of a thing that supports properties, whereas\n‘real essence’ conveys the idea of a submicroscopic\nmaterial structure that causes the powers of the object; these are\ndifferent meanings, but both terms refer to only one\n object.[6]\n\nOn the other hand, some Locke scholars interpret the concepts of\n‘substance’ (in the sense of pure substance in general, or\n‘substratum’) and ‘real essence’ as both\nintensionally and extensionally distinct because they play very\ndifferent philosophical roles. For example, according to Nicholas\nJolley, Locke employs the concept of a real essence when he is\naddressing issues of scientific explanation and he appeals to\nsubstratum when he is discussing the general concept of what it is to\nbe a thing (as opposed to a property or mode) (see Jolley\n1999, pp. 70–78).\n\nOn the relationship between real essences and internal constitutions,\none view is that Locke uses the terms ‘real essence’ and\n‘internal constitution’ interchangeably. For example, in\nII.xxxi.6 he says “its real Essence, or internal Constitution,\non which these Qualities depend, can be nothing but the Figure, Size,\nand Connexion of its solid Parts.” Again in III.iii.19 he uses\n‘real essence’ as if it were synonymous with\n‘internal constitution’: “In all which, and the like\nChanges, ‘tis evident, their real Essence, i.e. that\nConstitution, whereon the Properties of these several things depended,\nis destroy’d, and perishes with them.”\n\nBy contrast, Susanna Goodin (1998) argues that ‘real\nessence’ and ‘internal constitution’ cannot be\nsynonymous because, according to Locke, real essences are unknowable\n(IV.vi.5 & 12), but internal constitutions are knowable\n(II.xxiii.12). One way to distinguish them is, as we saw above, to\nadopt the relativized view and interpret the real essence as the\ninternal constitution that underlies the nominally essential\nproperties, whereas the internal constitution of a substance is simply\nits physical make-up, independently of considerations of its nominal\nessence. So, on this view, Locke’s uses of ‘real\nessence’ and ‘internal constitution’ are\nnon-synonymous technical terms.\n\nP. Kyle Stanford (1998), on the other hand, distinguishes real\nessences from internal constitutions by arguing that real essences, by\ndefinition, include the causal powers of the body, whereas the\ninternal constitution is simply its material components. Thus, for\nStanford, a real essence “consists of those features of an\nentity from which all of its observable or experienceable properties\ncan be logically deduced” (Stanford 1998, p. 80). By contrast,\nknowledge of the internal constitution, qua mere material\ncomponents, entails no such deducibility. For example, in IV.vi.11 he\nsays that knowledge of the real essence of an object entails knowledge\nof all of its powers, but knowledge of mere material structure cannot\nentail that kind of knowledge. Moreover, in all the quotations where\nLocke talks about real essences, he does not just define them as a\nmaterial structure, but also as the causal grounds of the observable\nqualities of the body, indicating that the powers are included in the\ndefinition.\n5. Real Essences of Simple Ideas and Modes\n\nOne of Locke’s epistemological projects is to distinguish\nmetaphysics and natural philosophy from ethics and mathematics, and\none way he does that is to distinguish their subject matters.\nMetaphysics and natural philosophy are concerned with substances,\nwhereas mathematics and ethics are concerned with modes. For Locke,\nsince an essence accounts for the existence and nature of any being,\ni.e., “Essence may be taken for the very being of anything,\nwhereby it is what it is”, it follows that the concepts of real\nand nominal essences apply outside the realm of metaphysics and\nnatural philosophy as well. By his lights, both simple ideas and modes\nhave real and nominal essences. To see this, some definitions are in\norder.\n\nBy ‘simple idea’, Locke means a single, uniform concept or\nappearance that cannot be analyzed into more basic parts:\n\n\nThe coldness and hardness, which a Man feels in a piece of\nIce, being as distinct Ideas in the Mind, as the\nSmell and Whiteness of a Lily; or as the taste of Sugar, and smell of\na Rose: And there is nothing can be plainer to a Man, than the clear\nand distinct Perception he has of those simple Ideas; which\nbeing each in it self uncompounded, contains in it nothing but one\nuniform Appearance, or Conception in the mind, and is not\ndistinguishable into different Ideas. (II.ii.1)\n\n\nOur complex idea of gold might include its color, heaviness, solidity,\netc., but each of these ideas can be set aside and considered all on\nits own as a simple idea. One simple idea, e.g., that of the\nyellowness of the lump of gold, is simple because it is a single,\nuniform appearance of that particular shade and not a collection of\nmore basic appearances. The same goes for our idea of its hardness and\nheaviness. We can mentally separate the color from the hardness or\nheaviness and think of it all on its own.\n\nBy ‘mode’, Locke means complex ideas of qualities that\ndepend upon substances for their existence:\n\n\nFirst, Modes I call such complex Ideas, which\nhowever compounded, contain not in them the supposition of subsisting\nby themselves, but are considered as Dependences on, or Affections of\nSubstances; such are the Ideas signified by the Words\nTriangle, Gratitude, Murther, etc. (II.xii.4)\n\n\nSo, for example, gratitude does not exist on its own, rather it\nrequires a thing that is grateful in order to exist. Mixed\nmodes are,\n\n\nthe Complex Ideas, we mark by the names Obligation,\nDrunkenness, a Lye, etc. which consisting of several\nCombinations of simple Ideas of different kinds, I have\ncalled Mixed Modes, to distinguish them from the more simple\nModes, which consist only of simple Ideas of the same kind.\nThese mixed Modes being also such Combinations of simple\nIdeas, as are not looked upon to be the characteristical\nMarks of any real Beings that have a steady existence, but scattered\nand independent Ideas, put together by the Mind, are thereby\ndistinguished from the complex Ideas of Substances.\n(II.xxii.1)\n\n\nGiven that there are real and nominal essences for modes and that a\ngeneral knowledge consists in knowledge of essences, then Locke needs\nsome way to distinguish the essences of modes from those of\nsubstances.\n\nAccording to Locke, one of the main differences between substances on\nthe one hand and simple ideas and modes on the other is that the real\nessences of substances are distinct from their nominal essences,\nwhereas for simple ideas and modes, they are the same.\n\n\nEssences being thus distinguished into Nominal and\nReal, we may farther observe, that in the Species of\nsimple Ideas and Modes, they are always the\nsame: But in Substances, always quite different. Thus a\nFigure including a Space between three Lines, is the real, as well as\nnominal Essence of a Triangle; it being not only the abstract\nIdea to which the general Name is annexed, but the very\nEssentia, or Being, of the thing it self, that Foundation\nfrom which all its Properties flow, and to which they are all\ninseparably annexed. But it is far otherwise concerning that parcel of\nMatter, which makes the Ring on my Finger, wherein these two\nEssences are apparently different. For it is the real\nConstitution of its insensible Parts, on which depend all those\nproperties of Colour, Weight, Fusibility, Fixedness, etc.\nwhich are to be found in it. Which Constitution we know not; and so\nhaving no particular Idea of, have no Name that is the Sign\nof it. But yet it is its Colour, Weight, Fusibility, and Fixedness,\netc. which makes it to be Gold, or gives it a right\nto that Name, which is therefore its nominal Essence.\n(III.iii.18)\n\n\nSo the real essences of a triangle, or gratitude, or murder, or\nyellow, or sweet, etc., are exactly the same as their nominal\nessences. There is nothing more to being a triangle than being a\nplane, closed three-sided figure. Similarly, there is nothing more to\nbeing a particular ‘species’ or shade of yellow than the\nnominal\n definition.[7]\n\nWhile it is clear that Locke envisioned some analogy between the real\nand nominal essences of substances with those of modes, it is unclear,\nhowever, just how that analogy should be cashed out. For example,\nRoger Woolhouse argues that it is a mistake for Locke to say that mode\nideas have a real essence at all because there is nothing like a\ncorpuscular structure that is analogous to the definition of a concept\nlike triangle or lying. Moreover, there is, according to Woolhouse,\nnothing that binds the nominally essential qualities of modes\ntogether, whereas, for substances there is an underlying physical\nstructure (see Woolhouse 1971, pp. 125–128). Indeed it is quite\ndifficult to see how a mode could have a real essence if the model for\nwhat a real essence is comes from corpuscular structures. If Woolhouse\nis right, then Locke has no way to make good on his intended analogy\nand he is unable to adequately differentiate modes from\nsubstances.\n\nP. Kyle Stanford (1998), on the other hand, suggests that the analogy\nbetween real and nominal essences was intended to be based in their\nentailment relations. Stanford argues that, just as every property of\na substance flows from the real essence with geometrical necessity\n(IV.vi.11), so too does every property of a triangle follow from its\ndefinition with geometrical necessity. And this fact is what all real\nand nominal essences have in common for Locke. By his way of thinking,\neven though the connection between the real essence of a piece of gold\nis the causal ground of the nominally essential properties of\ngold, and the real essence of a triangle is the logical\nground for the nominally essential properties of a triangle, they are\nalike in that all nominally essential properties can be deduced from\nthe idea of the real essence; if we knew the real essence of a\ntriangle, then we could deduce from it any of the properties of a\ntriangle. To make this analogy work, Stanford argues that the real\nessence of a substance is more than a corpuscular structure, it must\nalso include the causal powers that produce the observable qualities\nof the substance; in like fashion, the real essence of modes includes\nthe logical ground from which the nominally essential properties of\nthe term flow. If Stanford is correct, then there is a possible\nanalogy between the real and nominal essences of modes and substances\nthat yields an interesting interpretation of the real essences of both\nmodes and substances.\n\nOn either reading, however, it appears that Locke is saddled with the\nview that in cases of simple ideas, ideas of modes and mixed modes, if\nwe understand the meanings of the words, we know all that there is to\nknow regarding those concepts. Moral and mathematical concepts and\nideas are mere trifling propositions, analytic truths and\nuninformative. However, it will be difficult for many moral\nphilosophers to accept that all they are doing is cashing out the\ndefinitions of terms and dealing with uninformative analytic truths;\nasserting that lying is wrong seems to be more than a trifling\nopinion. Moreover, it is unclear how Locke thinks moral terms can be\nnormative, i.e., how they can constitute commands we ought to\nobey—if his position is correct.\n\nIn a similar vein, since many mixed modes, which include all moral\nconcepts, are arbitrary mental constructs, it follows that we create\nmoral concepts by producing their definitions. Since the real and\nnominal essences of mixed modes are the same, it follows that if we\nknow the real essence of lying (knowingly and falsely asserting that\n‘p’ with the intention to mislead someone whom we\nought not to mislead, etc.), we can deduce from that idea all the\ncomponents of lying, and so there is nothing more to know about lying\nthan the ideas contained within its definition. A problem with\nLocke’s account here is that, as John Mackie points out, social\nscientists seek out the real essences of social phenomena such as\nadultery, incest, jealousy, lying and suicide, but understanding these\ncomplex phenomena involves more than simply understanding the meaning\nof the word. If we are to understand why people lie, we must know more\nthan a definition of lying. Of course, it is possible for Locke to\nargue that once we understand all that is included in lying, we have\nuncovered its real essence, why people lie, and the many ways they do\nso, however, are separate questions that we cannot expect to be\ndecided by a semantic theory. It is unclear how he would solve the\nnormative problem (see Mackie 1976, pp. 90–91; see also Jolley\n1999, pp. 155–161).\n",
    "bibliography": {
        "categories": [
            "<a name=\"OriSou\">Original Sources</a>",
            "<a name=\"GenStuLoc\">General Studies of Locke</a>",
            "<a name=\"IntLocReaEss\">Interpretations of Locke on Real Essences</a>",
            "<a name=\"IntLocNatKin\">Interpretations of Locke on Natural Kinds</a>"
        ],
        "cat_ref_text": {
            "<a name=\"OriSou\">Original Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Bacon, Francis, 1620, <em>The New Organon</em>, Lisa Jardine and\nMichael Silverthorne (eds.), New York: Cambridge University Press,\n2000.",
                "Boyle, Robert, 1666, <em>Origine of Forms and Qualitifes</em>, in\nVolume 5, <em>The Works of Robert Boyle</em>, Michael Hunter and\nEdward B. Davis (eds.), 14 vols., London: Pickering &amp; Chatto,\n2000.",
                "Leibniz, G. W., 1704, <em>Nouveaux Essais sur l’Entendement\nHumain</em>, Peter Remnant and Jonathan Bennett (eds.), Cambridge:\nCambridge University Press, 1996.",
                "Locke, John, <em>The Works of John Locke</em>, 10 volumes, London:\nOtridge and Son, 1812.",
                "–––, 1689, <em>An Essay Concerning Human\nUnderstanding</em>, P. H. Nidditch (ed.), Oxford: Clarendon Press,\n1975.",
                "Sergeant, John, 1697, <em>Solid Philosophy Asserted Against the\nFancies of the Ideists</em>, New York: Garland Publishing, 1984.",
                "Stillingfleet, Edward, 1697, <em>A Discourse in Vindication of the\nDoctrine of the Trinity</em>, London: Mortlock; quotations are from\nthe passages quoted in <em>The Works of John Locke</em>, op. cit.\n</ul>\n<h3>"
            ],
            "<a name=\"GenStuLoc\">General Studies of Locke</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Anstey, Peter (ed.), 2003, <em>The Philosophy of John Locke: New\nperspectives</em>, New York: Routledge.",
                "Ayers, Michael, 1996, <em>Locke: Epistemology and Ontology</em>, 2\nvols., New York: Routledge.",
                "Chappell, Vere (ed.), 1999, <em>The Cambridge Companion to John\nLocke</em>, New York: Cambridge University Press.",
                "Gordon-Roth, Jessica and Shelley Weinberg (eds.), 2022,\n<em>The Lockean Mind</em>, New York: Routledge.",
                "Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.",
                "Lowe, E.J., 1995, <em>Locke on Human Understanding</em>, New York:\nRoutledge.",
                "Mackie, J. L., 1976, <em>Problems From Locke</em>, Oxford:\nClarendon Press.",
                "Newman, Lex (ed.), 2007, <em>The Cambridge Companion to\nLocke’s</em> Essay Concerning Human Understanding, New York:\nCambridge University Press.",
                "Pyle, A.J., 2013, <em>Locke</em>, Cambridge: Polity Press.",
                "Stuart, Matthew, 2013, <em>Locke’s Metaphysics</em>, New\nYork: Oxford University Press.",
                "Stuart, Matthew (ed.), 2016, <em>A Companion to Locke</em>,\nMalden: Blackwell Publishing Ltd.\n</ul>\n<h3>"
            ],
            "<a name=\"IntLocReaEss\">Interpretations of Locke on Real Essences</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Anstey, Peter, 2011, <em>John Locke and Natural Philosophy</em>,\nNew York: Oxford University Press.",
                "Atherton, Margaret, 2007, “Locke on Essences and\nClassification,” in <em>The Cambridge Companion to\nLocke’s</em> Essay Concerning Human Understanding, Lex Newman\n(ed.), New York: Cambridge University Press.",
                "Ayers, Michael, 1975, “The Ideas of Power and Substance in\nLocke’s Philosophy,” <em>Philosophical Quarterly</em>,\n25(98): 1–27.",
                "–––, 1981, “Mechanism, Superaddition and\nthe Proof of God’s Existence in Locke’s\n<em>Essay</em>,” <em>Philosophical Review</em>, 90(2):\n210–251.",
                "–––, 1996, <em>Locke: Epistemology and\nOntology</em>, 2 vols., New York: Routledge.",
                "Conn, Christopher Hughes, 2002, “Locke on Natural Kinds and\nEssential Properties,” <em>Journal Of Philosophical\nResearch</em>, 27: 475–497.",
                "Connolly, Patrick J., 2015, “Lockean Superaddition and\nLockean Humility,” <em>Studies in History and Philosophy of\nScience</em>, 51: 53–61.",
                "Crane, Judith, 2003, “Locke’s Theory of\nClassification,” <em>British Journal for the History of\nPhilosophy</em>, 11: 249–259.",
                "Downing, Lisa, 1992, “Are Corpuscles Unobservable in\nPrinciple for Locke?” <em>Journal of the History of\nPhilosophy</em>, 30: 33–52.",
                "–––, 2007, “Locke’s Ontology,”\nin Lex Newman (ed.), <em>The Cambridge Companion to Locke’s\nEssay Concerning Human Understanding</em>, Cambridge: Cambridge\nUniversity Press.",
                "Goodin, Susanna, 1998, “Why knowledge of the internal\nconstitution is not the same as knowledge of the real essence and why\nthis matters,” <em>Southwest Philosophy Review</em>, 14(1):\n149–155.",
                "Guyer, Paul, 1995, “Locke’s Philosophy of\nLanguage,” in <em>The Cambridge Companion to Locke</em>, Vere\nChappell (ed.), Cambridge: Cambridge University Press.",
                "Hinton, Beverly, 2006, “Locke on Adequacy to an Archetype\nand Real Essence,” <em>Locke Studies: An Annual Journal of Locke\nResearch</em>, 6: 59–83.",
                "Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.",
                "Jones, Jan-Erik, 2007, “Locke vs. Boyle: The Real Essence of\nCorpuscular Species,” <em>British Journal for the History of\nPhilosophy</em>, 15(4): 659–684.",
                "–––, 2010, “Locke on Real Essences,\nIntelligibility and Natural Kinds,” <em>Journal of Philosophical\nResearch</em>, 35: 147—72.",
                "McCann, Edwin, 1985, “Lockean Mechanism,” in\n<em>Philosophy, Its History and Historiog­raphy</em>, A. J.\nHolland (ed.), Dordrecht: Reidel, 209–231.",
                "Ott, Walter, 2004, <em>Locke’s Philosophy of Language</em>,\nCambridge: Cambridge University Press.",
                "Owen, David, 1991, “Locke on Real Essences,”\n<em>History of Philosophy Quarterly</em>, 8: 105–118.",
                "Phemister, Pauline, 1990, “Real Essences in\nParticular,” <em>Locke Newsletter</em>, 21: 27–55.",
                "Rozemond, Marleen and Gideon Yaffe, 2004, “Peach Trees,\nGravity and God: Mechanism in Locke,” <em>British Journal for\nthe History of Philosophy</em>, 12(3): 387–412.",
                "Shapiro, Lionel, 1999, “Toward ‘Perfect Collections of\nProperties’: Locke on the Constitution of Substantial\nSorts,” <em>Canadian Journal of Philosophy</em>, 29(4):\n551–592.",
                "Stanford, P. Kyle, 1998, “Reference and Natural Kind Terms:\nThe Real Essence of Locke’s View,” <em>Pacific\nPhilosophical Quarterly</em>, 79(1): 78–97.",
                "Vienne, Jean-Michele, 1993, “Locke on Real Essences and\nInternal Constitution,” <em>Proceedings of the Aristotelian\nSociety</em> (New Series), 93: 139—153.",
                "Wilson, Margaret, 1979, “Superadded Properties: The Limits\nof Mechanism in Locke,” <em>American Philosophical\nQuarterly</em>, 16: 143–150.",
                "Winkler, Kenneth, 2016, “Locke on Essence and the Social\nConstruction of Kinds,” in <em>A Companion to Locke</em>, Matthew\nStuart (ed), Malden: Blackwell Publishing Ltd., 212–235.",
                "Woolhouse, Roger, 1971, <em>Locke’s Philosophy of Science\nand Knowledge</em>, Oxford: Blackwell.",
                "Yost, R. M., Jr, 1951, “Locke’s Rejection of\nHypotheses about Sub-Microscopic Events,” <em>Journal of the\nHistory of Ideas</em>, 12(1): 111–130.\n</ul>\n<h3>"
            ],
            "<a name=\"IntLocNatKin\">Interpretations of Locke on Natural Kinds</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Anstey, Peter, 2011, <em>John Locke and Natural Philosophy</em>,\nNew York: Oxford University Press.",
                "Ayers, Michael, 1981, “Mechanism, Superaddition and the\nProof of God’s Existence in Locke’s <em>Essay</em>,”\n<em>Philosophical Review</em>, 90: 210–251.",
                "–––, 1996, <em>Locke: Epistemology and\nOntology</em>, 2 vols., New York: Routledge.",
                "Boyd, Richard, 1991, “Realism, Anti-Foundationalism and the\nEnthusiasm for Natural Kinds,” <em>Philosophical Studies</em>,\n61: 126–148.",
                "Conn, Christopher Hughes, 2002, “Locke on Natural Kinds and\nEssential Properties,” <em>Journal of Philosophical\nResearch</em>, 27: 475–497.",
                "Crane, Judith, 2003, “Locke’s Theory of\nClassification,” <em>British Journal for the History of\nPhilosophy</em>, 11: 249–259.",
                "Goodin, Susanna, 1997, “A Refutation of the Possibility of\nReal Species in Locke,” <em>The Locke Newsletter</em>, 28:\n67–75.",
                "Guyer, Paul, 1995, “Locke’s Philosophy of\nLanguage,” in <em>The Cambridge Companion to Locke</em>, Vere\nChappell (ed.), Cambridge: Cambridge University Press.",
                "Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.",
                "Jones, Jan-Erik, 2007, “Locke vs. Boyle: The Real Essence of\nCorpuscular Species,” <em>British Journal for the History of\nPhilosophy</em>, 15(4): 659–684.",
                "–––, 2010, “Locke on Real Essences,\nIntelligibility and Natural Kinds,” <em>Journal of Philosophical\nResearch</em>, 35: 147—72.",
                "Kaufman, Dan, 2007, “Locke on Individuation and the\nCorpuscular Basis of Kinds,” <em>Philosophy and Phenomenological\nResearch</em>, 75(3): 499—534.",
                "Kornblith, Hilary, 1993, <em>Inductive Inference and its Natural\nGround</em>, Cambridge, MA: MIT Press.",
                "Kuklok, Allison, 2018, “Strings, Physies, and Hogs Bristles:\nNames, Species and Classification in Locke,” <em>Locke\nStudies</em>, 18: 1—27.",
                "–––2022, “Locke on Essences,” <em>The Lockean\nMind</em>, Jessica Gordon-Roth and Shelley Weinberg (eds.), New York:\nRoutledge, 309–320.",
                "Leary, Nigel, 2009, “How Essentialists Misunderstand\nLocke,” <em>History of Philosophy Quarterly</em>, 26(3):\n273—292.",
                "Lowe, E.J., 2011, “Locke on Real Essence and Water as a\nNatural Kind: A Qualified Defence,” <em>Proceedings of the\nAristotelian Society</em> (Supplement), 85: 1—20.",
                "Phemister, Pauline, 1990, “Real Essences in\nParticular,” <em>Locke Newsletter</em>, 21: 27–55.",
                "Rozemond, Marleen and Gideon Yaffe, 2004, “Peach Trees,\nGravity and God: Mechanism in Locke,” <em>British Journal for\nthe History of Philosophy</em>, 12(3): 387–412.",
                "Shapiro, Lionel, 1999, “Toward ‘Perfect Collections of\nProperties’: Locke on the Constitution of Substantial\nSorts,” <em>Canadian Journal of Philosophy</em>, 29(4):\n551–592.",
                "Stanford, P. Kyle, 1998, “Reference and Natural Kind Terms:\nThe Real Essence of Locke’s View,” <em>Pacific\nPhilosophical Quarterly</em>, 79(1): 78–97.",
                "Stuart, Matthew, 1999, “Locke on Natural Kinds,”\n<em>History of Philosophy Quarterly</em>, 16(3): 277–296.",
                "Winkler, Kenneth, 2016, “Locke on Essence and the Social\nConstruction of Kinds,” in <em>A Companion to Locke</em>, Matthew\nStuart (ed), Malden: Blackwell Publishing Ltd., 212–235.",
                "Uzgalis, William, 1988, “The Anti-Essential Locke and\nNatural Kinds,” <em>The Philosophical Quarterly</em>, 38:\n330–339.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a name=\"Bib\">Bibliography</a></h2>\n<h3><a name=\"OriSou\">Original Sources</a></h3>\n<ul class=\"hanging\">\n<li>Bacon, Francis, 1620, <em>The New Organon</em>, Lisa Jardine and\nMichael Silverthorne (eds.), New York: Cambridge University Press,\n2000.</li>\n<li>Boyle, Robert, 1666, <em>Origine of Forms and Qualitifes</em>, in\nVolume 5, <em>The Works of Robert Boyle</em>, Michael Hunter and\nEdward B. Davis (eds.), 14 vols., London: Pickering &amp; Chatto,\n2000.</li>\n<li>Leibniz, G. W., 1704, <em>Nouveaux Essais sur l’Entendement\nHumain</em>, Peter Remnant and Jonathan Bennett (eds.), Cambridge:\nCambridge University Press, 1996.</li>\n<li>Locke, John, <em>The Works of John Locke</em>, 10 volumes, London:\nOtridge and Son, 1812.</li>\n<li>–––, 1689, <em>An Essay Concerning Human\nUnderstanding</em>, P. H. Nidditch (ed.), Oxford: Clarendon Press,\n1975.</li>\n<li>Sergeant, John, 1697, <em>Solid Philosophy Asserted Against the\nFancies of the Ideists</em>, New York: Garland Publishing, 1984.</li>\n<li>Stillingfleet, Edward, 1697, <em>A Discourse in Vindication of the\nDoctrine of the Trinity</em>, London: Mortlock; quotations are from\nthe passages quoted in <em>The Works of John Locke</em>, op. cit.</li>\n</ul>\n<h3><a name=\"GenStuLoc\">General Studies of Locke</a></h3>\n<ul class=\"hanging\">\n<li>Anstey, Peter (ed.), 2003, <em>The Philosophy of John Locke: New\nperspectives</em>, New York: Routledge.</li>\n<li>Ayers, Michael, 1996, <em>Locke: Epistemology and Ontology</em>, 2\nvols., New York: Routledge.</li>\n<li>Chappell, Vere (ed.), 1999, <em>The Cambridge Companion to John\nLocke</em>, New York: Cambridge University Press.</li>\n<li>Gordon-Roth, Jessica and Shelley Weinberg (eds.), 2022,\n<em>The Lockean Mind</em>, New York: Routledge.</li>\n<li>Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.</li>\n<li>Lowe, E.J., 1995, <em>Locke on Human Understanding</em>, New York:\nRoutledge.</li>\n<li>Mackie, J. L., 1976, <em>Problems From Locke</em>, Oxford:\nClarendon Press.</li>\n<li>Newman, Lex (ed.), 2007, <em>The Cambridge Companion to\nLocke’s</em> Essay Concerning Human Understanding, New York:\nCambridge University Press.</li>\n<li>Pyle, A.J., 2013, <em>Locke</em>, Cambridge: Polity Press.</li>\n<li>Stuart, Matthew, 2013, <em>Locke’s Metaphysics</em>, New\nYork: Oxford University Press.</li>\n<li>Stuart, Matthew (ed.), 2016, <em>A Companion to Locke</em>,\nMalden: Blackwell Publishing Ltd.</li>\n</ul>\n<h3><a name=\"IntLocReaEss\">Interpretations of Locke on Real Essences</a></h3>\n<ul class=\"hanging\">\n<li>Anstey, Peter, 2011, <em>John Locke and Natural Philosophy</em>,\nNew York: Oxford University Press.</li>\n<li>Atherton, Margaret, 2007, “Locke on Essences and\nClassification,” in <em>The Cambridge Companion to\nLocke’s</em> Essay Concerning Human Understanding, Lex Newman\n(ed.), New York: Cambridge University Press.</li>\n<li>Ayers, Michael, 1975, “The Ideas of Power and Substance in\nLocke’s Philosophy,” <em>Philosophical Quarterly</em>,\n25(98): 1–27.</li>\n<li>–––, 1981, “Mechanism, Superaddition and\nthe Proof of God’s Existence in Locke’s\n<em>Essay</em>,” <em>Philosophical Review</em>, 90(2):\n210–251.</li>\n<li>–––, 1996, <em>Locke: Epistemology and\nOntology</em>, 2 vols., New York: Routledge.</li>\n<li>Conn, Christopher Hughes, 2002, “Locke on Natural Kinds and\nEssential Properties,” <em>Journal Of Philosophical\nResearch</em>, 27: 475–497.</li>\n<li>Connolly, Patrick J., 2015, “Lockean Superaddition and\nLockean Humility,” <em>Studies in History and Philosophy of\nScience</em>, 51: 53–61.</li>\n<li>Crane, Judith, 2003, “Locke’s Theory of\nClassification,” <em>British Journal for the History of\nPhilosophy</em>, 11: 249–259.</li>\n<li>Downing, Lisa, 1992, “Are Corpuscles Unobservable in\nPrinciple for Locke?” <em>Journal of the History of\nPhilosophy</em>, 30: 33–52.</li>\n<li>–––, 2007, “Locke’s Ontology,”\nin Lex Newman (ed.), <em>The Cambridge Companion to Locke’s\nEssay Concerning Human Understanding</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Goodin, Susanna, 1998, “Why knowledge of the internal\nconstitution is not the same as knowledge of the real essence and why\nthis matters,” <em>Southwest Philosophy Review</em>, 14(1):\n149–155.</li>\n<li>Guyer, Paul, 1995, “Locke’s Philosophy of\nLanguage,” in <em>The Cambridge Companion to Locke</em>, Vere\nChappell (ed.), Cambridge: Cambridge University Press.</li>\n<li>Hinton, Beverly, 2006, “Locke on Adequacy to an Archetype\nand Real Essence,” <em>Locke Studies: An Annual Journal of Locke\nResearch</em>, 6: 59–83.</li>\n<li>Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.</li>\n<li>Jones, Jan-Erik, 2007, “Locke vs. Boyle: The Real Essence of\nCorpuscular Species,” <em>British Journal for the History of\nPhilosophy</em>, 15(4): 659–684.</li>\n<li>–––, 2010, “Locke on Real Essences,\nIntelligibility and Natural Kinds,” <em>Journal of Philosophical\nResearch</em>, 35: 147—72.</li>\n<li>McCann, Edwin, 1985, “Lockean Mechanism,” in\n<em>Philosophy, Its History and Historiog­raphy</em>, A. J.\nHolland (ed.), Dordrecht: Reidel, 209–231.</li>\n<li>Ott, Walter, 2004, <em>Locke’s Philosophy of Language</em>,\nCambridge: Cambridge University Press.</li>\n<li>Owen, David, 1991, “Locke on Real Essences,”\n<em>History of Philosophy Quarterly</em>, 8: 105–118.</li>\n<li>Phemister, Pauline, 1990, “Real Essences in\nParticular,” <em>Locke Newsletter</em>, 21: 27–55.</li>\n<li>Rozemond, Marleen and Gideon Yaffe, 2004, “Peach Trees,\nGravity and God: Mechanism in Locke,” <em>British Journal for\nthe History of Philosophy</em>, 12(3): 387–412.</li>\n<li>Shapiro, Lionel, 1999, “Toward ‘Perfect Collections of\nProperties’: Locke on the Constitution of Substantial\nSorts,” <em>Canadian Journal of Philosophy</em>, 29(4):\n551–592.</li>\n<li>Stanford, P. Kyle, 1998, “Reference and Natural Kind Terms:\nThe Real Essence of Locke’s View,” <em>Pacific\nPhilosophical Quarterly</em>, 79(1): 78–97.</li>\n<li>Vienne, Jean-Michele, 1993, “Locke on Real Essences and\nInternal Constitution,” <em>Proceedings of the Aristotelian\nSociety</em> (New Series), 93: 139—153.</li>\n<li>Wilson, Margaret, 1979, “Superadded Properties: The Limits\nof Mechanism in Locke,” <em>American Philosophical\nQuarterly</em>, 16: 143–150.</li>\n<li>Winkler, Kenneth, 2016, “Locke on Essence and the Social\nConstruction of Kinds,” in <em>A Companion to Locke</em>, Matthew\nStuart (ed), Malden: Blackwell Publishing Ltd., 212–235.</li>\n<li>Woolhouse, Roger, 1971, <em>Locke’s Philosophy of Science\nand Knowledge</em>, Oxford: Blackwell.</li>\n<li>Yost, R. M., Jr, 1951, “Locke’s Rejection of\nHypotheses about Sub-Microscopic Events,” <em>Journal of the\nHistory of Ideas</em>, 12(1): 111–130.</li>\n</ul>\n<h3><a name=\"IntLocNatKin\">Interpretations of Locke on Natural Kinds</a></h3>\n<ul class=\"hanging\">\n<li>Anstey, Peter, 2011, <em>John Locke and Natural Philosophy</em>,\nNew York: Oxford University Press.</li>\n<li>Ayers, Michael, 1981, “Mechanism, Superaddition and the\nProof of God’s Existence in Locke’s <em>Essay</em>,”\n<em>Philosophical Review</em>, 90: 210–251.</li>\n<li>–––, 1996, <em>Locke: Epistemology and\nOntology</em>, 2 vols., New York: Routledge.</li>\n<li>Boyd, Richard, 1991, “Realism, Anti-Foundationalism and the\nEnthusiasm for Natural Kinds,” <em>Philosophical Studies</em>,\n61: 126–148.</li>\n<li>Conn, Christopher Hughes, 2002, “Locke on Natural Kinds and\nEssential Properties,” <em>Journal of Philosophical\nResearch</em>, 27: 475–497.</li>\n<li>Crane, Judith, 2003, “Locke’s Theory of\nClassification,” <em>British Journal for the History of\nPhilosophy</em>, 11: 249–259.</li>\n<li>Goodin, Susanna, 1997, “A Refutation of the Possibility of\nReal Species in Locke,” <em>The Locke Newsletter</em>, 28:\n67–75.</li>\n<li>Guyer, Paul, 1995, “Locke’s Philosophy of\nLanguage,” in <em>The Cambridge Companion to Locke</em>, Vere\nChappell (ed.), Cambridge: Cambridge University Press.</li>\n<li>Jolley, Nicholas, 1999, <em>Locke: His Philosophical Thought</em>,\nNew York: Oxford University Press.</li>\n<li>Jones, Jan-Erik, 2007, “Locke vs. Boyle: The Real Essence of\nCorpuscular Species,” <em>British Journal for the History of\nPhilosophy</em>, 15(4): 659–684.</li>\n<li>–––, 2010, “Locke on Real Essences,\nIntelligibility and Natural Kinds,” <em>Journal of Philosophical\nResearch</em>, 35: 147—72.</li>\n<li>Kaufman, Dan, 2007, “Locke on Individuation and the\nCorpuscular Basis of Kinds,” <em>Philosophy and Phenomenological\nResearch</em>, 75(3): 499—534.</li>\n<li>Kornblith, Hilary, 1993, <em>Inductive Inference and its Natural\nGround</em>, Cambridge, MA: MIT Press.</li>\n<li>Kuklok, Allison, 2018, “Strings, Physies, and Hogs Bristles:\nNames, Species and Classification in Locke,” <em>Locke\nStudies</em>, 18: 1—27.</li>\n<li>–––2022, “Locke on Essences,” <em>The Lockean\nMind</em>, Jessica Gordon-Roth and Shelley Weinberg (eds.), New York:\nRoutledge, 309–320.</li>\n<li>Leary, Nigel, 2009, “How Essentialists Misunderstand\nLocke,” <em>History of Philosophy Quarterly</em>, 26(3):\n273—292.</li>\n<li>Lowe, E.J., 2011, “Locke on Real Essence and Water as a\nNatural Kind: A Qualified Defence,” <em>Proceedings of the\nAristotelian Society</em> (Supplement), 85: 1—20.</li>\n<li>Phemister, Pauline, 1990, “Real Essences in\nParticular,” <em>Locke Newsletter</em>, 21: 27–55.</li>\n<li>Rozemond, Marleen and Gideon Yaffe, 2004, “Peach Trees,\nGravity and God: Mechanism in Locke,” <em>British Journal for\nthe History of Philosophy</em>, 12(3): 387–412.</li>\n<li>Shapiro, Lionel, 1999, “Toward ‘Perfect Collections of\nProperties’: Locke on the Constitution of Substantial\nSorts,” <em>Canadian Journal of Philosophy</em>, 29(4):\n551–592.</li>\n<li>Stanford, P. Kyle, 1998, “Reference and Natural Kind Terms:\nThe Real Essence of Locke’s View,” <em>Pacific\nPhilosophical Quarterly</em>, 79(1): 78–97.</li>\n<li>Stuart, Matthew, 1999, “Locke on Natural Kinds,”\n<em>History of Philosophy Quarterly</em>, 16(3): 277–296.</li>\n<li>Winkler, Kenneth, 2016, “Locke on Essence and the Social\nConstruction of Kinds,” in <em>A Companion to Locke</em>, Matthew\nStuart (ed), Malden: Blackwell Publishing Ltd., 212–235.</li>\n<li>Uzgalis, William, 1988, “The Anti-Essential Locke and\nNatural Kinds,” <em>The Philosophical Quarterly</em>, 38:\n330–339.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "essential vs. accidental properties",
            "Locke, John",
            "Locke, John: moral philosophy",
            "Locke, John: philosophy of science"
        ],
        "entry_link": [
            {
                "../essential-accidental/": "essential vs. accidental properties"
            },
            {
                "../locke/": "Locke, John"
            },
            {
                "../locke-moral/": "Locke, John: moral philosophy"
            },
            {
                "../locke-philosophy-science/": "Locke, John: philosophy of science"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=real-essence\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/real-essence/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=real-essence&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/real-essence/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=real-essence": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/real-essence/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=real-essence&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/real-essence/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.iep.utm.edu/locke/\" target=\"other\">John Locke</a>,\n entry in the <em>Internet Encyclopedia of Philosophy</em>.",
            "<a href=\"http://oll.libertyfund.org/?option=com_staticxt&amp;staticfile=show.php%3Fperson=131&amp;Itemid=28\" target=\"other\">John Locke</a>,\n article in the <em>Online Library of Liberty</em>.",
            "<a href=\"https://philpapers.org/rec/LOOLAL\" target=\"other\">Leibniz and Locke on Natural Kinds</a>&gt;",
            "<a href=\"http://www.earlymoderntexts.com/\" target=\"other\">Some Texts from Early Modern Philosophy</a>,\n includes Locke’s <em>Essay Concerning Human\nUnderstanding</em>."
        ],
        "listed_links": [
            {
                "http://www.iep.utm.edu/locke/": "John Locke"
            },
            {
                "http://oll.libertyfund.org/?option=com_staticxt&staticfile=show.php%3Fperson=131&Itemid=28": "John Locke"
            },
            {
                "https://philpapers.org/rec/LOOLAL": "Leibniz and Locke on Natural Kinds"
            },
            {
                "http://www.earlymoderntexts.com/": "Some Texts from Early Modern Philosophy"
            }
        ]
    }
}