{
    "url": "religious-language",
    "title": "Religious Language",
    "authorship": {
        "year": "Copyright © 2022",
        "author_text": "Michael Scott\n<Michael.Scott@manchester.ac.uk>",
        "author_links": [
            {
                "https://www.research.manchester.ac.uk/portal/michael.scott.html": "Michael Scott"
            },
            {
                "mailto:Michael%2eScott%40manchester%2eac%2euk": "Michael.Scott@manchester.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2022</a> by\n\n<br/>\n<a href=\"https://www.research.manchester.ac.uk/portal/michael.scott.html\" target=\"other\">Michael Scott</a>\n&lt;<a href=\"mailto:Michael%2eScott%40manchester%2eac%2euk\"><em>Michael<abbr title=\" dot \">.</abbr>Scott<abbr title=\" at \">@</abbr>manchester<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Fri Aug 4, 2017",
        "substantive revision Tue Mar 8, 2022"
    ],
    "preamble": "\n\nThe principal aim of research on religious language is to give an\naccount of the meaning of religious sentences and utterances.\nReligious sentences are generally taken to be have a religious subject\nmatter; a religious utterance is the production in speech or writing\nof a token religious sentence. In principle, religious subject matters\ncould encompass a variety of agents, states of affairs or\nproperties—such as God, deities, angels, miracles, redemption,\ngrace, holiness, sinfulness. Most attention, however, has been devoted\nto the meaning of what we say about God.\n\nThe scope of religious language and discourse could be construed more\nwidely. For instance, while The Song of Songs has little in\nthe way of distinctively religious content, it could be included in\nthe field because of its place within a religious canon.\nAlternatively, the field could be characterised pragmatically to\ninclude utterances which are used for religious purposes or in\nreligious contexts (Alston 2005: 220; Donovan 1976: 1; Soskice 1999:\n349; Charlesworth 1974: 3). In practice, however, philosophical\ntreatments have not extended so broadly, instead focusing on sentences\nand utterances with putatively religious content. This is partly\nbecause it is difficult to find a principled characterisation of a\nreligious context that would delineate a philosophically interesting\nscope for the topic. When a church congregation is told “Please\nkneel”, this direction appears to be in a religious context and\nhave a religious purpose but it is difficult to see how the analysis\nof the meaning of this instruction would informatively contribute to\nthe topic. It is also because the most pressing questions about\nreligious language seem to be those that come into alignment with\nquestions in other areas of philosophy of religion. Is there\nanything distinctive about the meanings of what we say about God and\nother religious matters that are also the focus of metaphysical and\nepistemological discussion? If, in talking about God, speakers are not\nexpressing propositions or not talking literally—to take a\ncouple of the more radical proposals—that would accordingly\nrequire dramatic adjustments in approaching questions about knowledge\nof God or God’s existence.\n\nResearch in the field has a lengthy history, with sustained discussion\nof the meanings of religious expressions and utterances stretching\nback at least to the middle of antiquity. Notable treatments of the\ntopic include the work by medieval theologians and philosophers\nconcerned with the meanings of divine predicates, including the\ndebates surrounding analogy and apophaticism (White 2010; Turner 1995;\nScott & Citron 2016), and debates about the meaningfulness of\nreligious language that were prompted by Ayer’s 1936\npopularisation of logical positivism in Language, Truth and\nLogic and remained a central issue in the philosophy of religion\nthrough the mid-twentieth century. Religious language\nhas also become a topic of interest in continental philosophy (Derrida\n1989 and 1992; Marion 1994 and 1995).\n\nA distinction that guides the selection of material for this article\nis between revisionary and non-revisionary accounts of religious\nlanguage. Non-revisionary theories aim to explain what religious\nsentences and utterances mean. Revisionary theories, in contrast,\npropose accounts of what religious language should mean or how it\nshould be used. While non-revisionary theories are descriptive of\nreligious language and should do justice to linguistic data,\nrevisionary theories are usually driven by metaphysical or\nepistemological considerations. This article will mainly be concerned\nwith theories of the former type i.e., what religious utterances mean\nrather than what they should mean.\n",
    "toc": [
        {
            "#PrelFaceValuTheo": "1. Preliminaries: The Face Value Theory"
        },
        {
            "#ContReliUtte": "2. The Content of Religious Utterances"
        },
        {
            "#AyerVeri": "2.1 Ayer and Verificationism"
        },
        {
            "#VariNonCogn": "2.2 Varieties of Non-Cognitivism"
        },
        {
            "#ReliPlanRBBrai": "2.2.1 Religious Plans: R. B. Braithwaite"
        },
        {
            "#MixeStraGeorBerk": "2.2.2 Mixed Strategies: George Berkeley"
        },
        {
            "#ProsForReliNonCogn": "2.2.3 The Prospects for Religious Non-Cognitivism"
        },
        {
            "#ParaCont": "2.3 Paradoxical Content"
        },
        {
            "#Redu": "2.4 Reductionism"
        },
        {
            "#UseReliLang": "3. The Use of Religious Language"
        },
        {
            "#AnalMeta": "3.1 Analogy and Metaphor"
        },
        {
            "#PraiPray": "3.2 Praise and Prayer"
        },
        {
            "#Fict": "3.3 Fictionalism"
        },
        {
            "#ReliPurp": "3.4 Religious Purposes"
        },
        {
            "#ReliMini": "4. Religious Minimalism"
        },
        {
            "#MiniAbouReli": "4.1 Minimalism About Religion"
        },
        {
            "#Witt": "4.2 Wittgenstein"
        },
        {
            "#RefeLogi": "5. Reference and Logic"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Preliminaries: The Face Value Theory\n\nA useful starting point for thinking about religious language is a\nface value theory that promises to give an interpretation of\nreligious sentences and utterances that adheres as closely as possible\nto what they appear to say. Take, for instance, the affirmation of an\nindicative religious sentence such as\n\n(1)God is\nomnipotent\n\n\nAccording to the face value theory, (1) has various apparent\ncharacteristics: (a) It has the propositional—or\n“linguistic” or “semantic”—content\nthat God is omnipotent and is true just in case God is\nomnipotent; (b) it is an assertion that conventionally expresses the\nspeaker’s belief that God is omnipotent; (c) it is a descriptive\nutterance that represents (truly or falsely) the fact that God is\nomnipotent, just as other descriptive utterances in other fields of\ndiscourse (in science, history, etc.) represent facts. For proponents\nof face value theory, generalisations of (a), (b) and (c) that extend\nto indicative religious utterances such as (1)—(a*), (b*) and\n(c*) respectively—provide the starting point for the\ninterpretation of religious discourse. It should be treated in the\nsame way as the interpretation of other descriptive areas of\ndiscourse: there’s nothing special about religious discourse\nother than its distinctive subject matter.\n\nThe face value theory will, of course, need more development if it is\nto explain other areas of religious discourse. The approach taken to\n(1) clearly does not apply to non-literal or non-assertoric religious\nutterances, such as metaphors, questions, fictional stories,\nexpressions of hope, or devotion. However, these are all forms of\nexpression that occur outside religious discourse; they are not unique\nto religion. For the face value theory, the treatment of religious\ncases will fall in line with the treatment of non-literal and\nnon-assertoric communication more generally. So, other than the fact\nthat religious discourse is about God, the afterlife and so on, there\nis nothing remarkable or distinctive in the interpretation of\nreligious utterances.\n\nA large part of research on religious language has been concerned with\nwhether one or more of (a*), (b*) and (c*) ought plausibly to be\nrejected. Indeed, the attention that some theories of religious\nlanguage receive is in part due to their divergence from a face value\ninterpretation. Most of the theories that are discussed within the\nfield reject at least one of the components of face value theory.\n\nThe most radical rejection of face value theory is the denial of (a*),\ni.e., that religious utterances express religious\n propositions.[1]\n These theories will be explored in\n section 2.\n The most famous example of this position is Ayer’s version\nlogical positivism\n (2.1).\n Non-cognitive accounts, from which we have selected Braithwaite\n (2.2.1)\n and Berkeley\n (2.2.2),\n are similarly radical but are differently motivated and offer a more\npositive alternative account of the meaning of religious utterances.\nThe prospects for a more sophisticated non-cognitivism are considered\nin\n 2.2.3.\n A third class of theories\n (2.3),\n propose that religious utterances are paradoxical or fail to express\ncomplete propositions. A fourth group, reductionist and subjectivist\ntheories\n (2.4),\n allow that religious utterances express propositions but not the ones\nthat they appear to. Instead, their truth conditions are given by\n“reduced” (typically non-religious) sentences.\n\nSection 3\n will look at theories that reject (b*), i.e., that indicative\nstatements affirmed about God are not literal assertions.\n 3.1\n will review metaphor theories, encompassing a discussion of analogy.\nInterpretations of religious discourse as a form of praise or prayer,\nsuggested by Jean-Luc Marion and Jacques Derrida, will be considered\nin\n 3.2.\n These theories propose that despite appearing to literally assert\nreligious sentences, speakers are instead employing a different type\nof speech act. An alternative approach is to argue that religious\nutterances are avowed for practical reasons rather than their truth.\nIan Ramsey\n (3.3)\n takes this approach, as do hermeneutic fictionalists\n (3.4).\n\nMinimalists\n (4.1)\n agree that indicative religious utterances are representational and\nassertoric but deny that they represent religious facts in the way\nthat other areas of descriptive discourse represent facts. That is,\nthey agree with (a*) and (b*) but reject (c*). This view is sometimes\nassociated with Wittgenstein, whose brief remarks and lectures on\nreligion have been highly influential. However, the interpretation of\nhis work is not widely agreed upon and some different possibilities\nwill be considered in\n 4.2.\n\n\nThe face value theory is a widely assumed—if not the\ndefault—approach taken to religious discourse in contemporary\nanalytic philosophy of religion. Resistance to it is sometimes\npresented a brief aberration confined to the middle decades of the\ntwentieth century (Mackie 1982: 2; Swinburne 1993: 88) with\nquestionable if not anti-religious motivations (van Inwagen 2006: 156;\nPlantinga 2000: ch. 2, particularly in reference to Gordon Kaufman).\nHowever, as will become clear in the following sections, the\nopposition to face value theory is not of recent vintage and although\nsome who disagree with face value theory may be atheists, the position\nis not tied to atheism.\n2. The Content of Religious Utterances\n\nAlthough Ayer’s version of verificationism is one of the most\nwell-known rejections of (a*), his approach is unusual in two\nrespects. First, he offers no positive alternative account of the\nmeaning of religious utterances. Ayer saw little value in religious\ndiscourse and preferred its elimination. In contrast, the other\ntheories considered in this section propose that religious language\nmay be meaningful even if it does not express religious propositions.\nVarious options have been proposed: it may express non-cognitive\nstates, have a practical value in modifying the thought and action of\nspeakers, or represent non-religious facts. Second, Ayer’s\naccount is ostensibly comprehensive for religious language whereas\nmost other theories are more piecemeal, that is, they reject (a*) for\nsome significant subclass of religious utterances but for other\nreligious utterances accept face value theory.\n2.1 Ayer and Verificationism\n\nThe verificationist theory of meaning was popularised by A.J. Ayer in\nhis 1936 Language, Truth and Logic. Ayer argues that\nreligious statements—his term for indicative\nsentences—are “literally meaningless”. According to\nAyer, a statement is factually contentful if and only if it is\nempirically verifiable. A statement is empirically verifiable if what\nit says can in principle be shown to be true or false by observation.\nAlthough logically necessary statements are not verifiable, according\nto Ayer they are analytic or true by virtue of the meaning of their\nconstituent terms. As such, “none of them provide any\ninformation about any matter of fact” (1936: 79). Ayer\nencapsulated the verificationist theory of meaning with the infamous\nempirical verification principle: to have literal meaning a\nstatement must be either analytically true (and thereby factually\nuninformative) or empirically verifiable.\n\nAyer’s chief target is metaphysics and he rather ambitiously\ntitled the first chapter of his book “The Elimination of\nMetaphysics”. Metaphysics is taken to be made up of statements\nthat concern the nature of reality that falls beyond the scope of\nscientific inquiry. Examples include the existence of the external\nworld, the number of substances that there are in the world, whether\nthe world is made up of ideas and the reality of propositions or\nuniversals. Because theories on these issues are not empirically\nverifiable, Ayer takes them to lack “factual meaning”:\nthey should be eliminated as a topic of debate. Other conspicuous\nvictims of the application of the verification principle were ethical,\naesthetic and religious statements all of which, so Ayer argues, are\nnot susceptible to verification and are thereby similarly factually\nmeaningless.\n Notably, however, Ayer has a positive “emotivist”\nstory to tell about ethical statements. Although he takes ethical\nstatements to be unverifiable descriptions of normative facts, from\nwhich he concludes that an ethical predicate “adds nothing to\nthe literal meaning of the sentence”, he argues that ethical\nlanguage has a non-descriptive function of expressing approval or\ndisapproval as well as encouraging attitudes of approval or\ndisapproval in others. For example, in saying “Stealing money is\nwrong”, the speaker does not say something that is true or false\nbut expresses disapproval towards stealing (1936: 107). Ayer extends\nhis emotivism to aesthetic language: it is used “simply to\nexpress certain feelings and evoke a certain response” (1936:\n113). What of religious language? Ayer is silent on this issue,\nimplying that religious language should be dispensed with in the same\nway as other areas of metaphysics.\n\nLogical positivism was briefly in vogue in the 1930s but quickly ran\ninto intractable difficulties. That something is seriously awry can be\nseen by subjecting the verification principle to its own standards: it\nis itself neither empirically verifiable nor analytically\ntrue, so literally meaningless according to its own criterion. Ayer\nexacerbated this problem by exaggerating the predicament of statements\nthat failed to satisfy this principle, sometimes characterising them\nas “nonsense”. However, the central reason for the\ntheory’s collapse was the failure to come up with a workable\nversion of the verification principle (see MacDonald 2010 for a\nreview). Ayer was unable to find a happy medium between a strict\nformulation that renders statements of scientific theory unverifiable\nand a lax formulation that allows any statement to be\nverifiable.\n This brings us to the question of why religious statements should\nbe held by to fall foul of the verification principle. Why can’t\nreligious statements legitimately be regarded as scientific hypotheses\n(as Swinburne 1994, among others, argues)? Religious statements do in\nmany cases appear to have implications for what is or should be\nobservable. We can predict, for instance, that a world created by God\nwill exhibit various kinds of orderliness. It seems, therefore, that\nsome religious statements should be in a good a position to satisfy\nthe standards of literal content set up by the empirical verification\nprinciple. Ayer’s reply to this argument is surprisingly terse.\nSuppose, he argues, that “God exists” entails that there\nshould be observable regularities in nature. If that exhausted the\nobservable results of “God exists” then “to assert\nthe existence of a god will be simply equivalent to asserting that\nthere is the requisite regularity in nature” (1936:\n115). Clearly, Ayer contends, this is not all that religious believers\nintend to assert in saying that God exists: they are committed to the\nexistence of an unverifiable supernatural agent.\n\nAyer’s response seems to involve a sleight of hand. The\nverification principle is presented as a way of demarcating factually\ncontentful from contentless statements. In arguing against the\nverifiability of religious statements, Ayer relies on the assumption\nthat the verification principle provides the means for specifying what\nstatements mean. In this case, that the content of “God\nexists” is exhausted by the observation statements that (in\ncombination with other assumptions) can be deduced from it. However,\nthis is in effect to concede that religious statements are\nverifiable according to the original (official) version of the\nverification principle. As to the meaning-specifying, unofficial\nversion of the verification principle, this is not something that Ayer\ndefends. However, it would place religious statements in good company\nwith scientific statements that posit theoretical entities that are\nnot directly observable and the meanings of which are similarly not\nexhausted by the observation statements that are derivable from\nthem.\n Despite the availability of conclusive objections to Ayer, worries\nabout the verifiability (or falsifiability) of religious statements\ncontinued to exert a remarkable influence on work in the philosophy of\nreligion, with papers and books being produced well into the second\nhalf of the twentieth century. Particularly notable is John\nHick’s argument that theism could be verified postmortem:\n“the verifying situation lies in the final fulfilment of\nGod’s purpose for us beyond this present life” (1977b:\n190). Other examples include Flew and MacIntyre (1955), Ferré\n(1962), Macquarrie (1967), Donovan (1976) and Tilley (1978); for a\ndiscussion of this prolonged impact see Scott (2013: 45–48).\n2.2 Varieties of Non-Cognitivism\n2.2.1 Religious Plans: R. B. Braithwaite\n\nAyer argues that although ethical statements are not descriptive they\nhave the important function of giving voice to our non-cognitive\nattitudes of approval and disapproval. However, he offers no positive\nnon-cognitive theory of the meaning of religious statements.\nBraithwaite addresses this asymmetry with a non-cognitivist account of\nreligious language. His theory is modelled on Ayer’s ethical\nemotivism but with\n modifications.[2]\n Braithwaite takes the same approach to religious statements. He\nproposes that religious statements are “primarily declarations\nof adherence to a policy of action, declarations of commitment to a\nway of life” (1955: 15). For example, “God is love”\nexpresses the intention to follow an agapeistic way of life. Religious\ndiscourse concerned with matters that are not directly concerned with\nbehavioural conduct, such as claims about important religious figures,\nparables, accounts of the creation, and so on, Braithwaite calls\nstories. These stories, according to Braithwaite, provide\nmodels of exemplary behaviour (or behaviour to avoid) that serve as\npsychological assistance for the believer to act on their intentions.\nFor this reason, their truth is not crucial to the action-guiding role\nthat they play: they are entertained rather than believed (1955: 24).\nBraithwaite combines a non-cognitive theory of a range of core\nreligious judgements and doctrinal claims with a theory of religious\n“stories” as useful fictions. \n\n\nA religious belief is an intention to behave in a certain way (a moral\nbelief) together with the entertainment of certain stories associated\nwith the intention in the mind of the believer. (1955: 32)\n\n\nTo the extent that the negative part of Braithwaite’s\nposition—that religious utterances lack factual\nsignificance—relies on Ayer’s verificationism, his theory\nencounters similar problems. However, the positive part of\nBraithwaite’s theory also runs into difficulties both for its\npsychological implausability (Swinburne 1993: ch. 6) and as a theory\nof religious language (Scott 2013: ch. 4). Here is one objection. What\nare the intentions expressed by different religious statements?\nBraithwaite is rather sketchy on the details but he proposes that\nChristian statements express an intention to pursue an\nagapeistic way of life (1955: 21–22). However, equipped with\nonly one plan, Braithwaite’s theory will have\nall Christian claims (or at least all doctrinal claims)\nmeaning the same. They will all express an intention to pursue the\nsame plan. Even if Braithwaite could identify some additional plans\nthere seems no prospect of finding plans to individuate the meanings\nof all statements of Christian belief.\n2.2.2 Mixed Strategies: George Berkeley\n\nGeorge Berkeley offers the most detailed and important account of\nreligious language of any of the major early modern philosophers.\nThese are elaborated in his 1732 dialogue Alciphron. His\naccount has negative and positive elements. First, he rejects (a*) for\na limited range of religious utterances. Specifically,\nChristian doctrinal concerns about grace, original sin, the afterlife\nand other Christian “mysteries”. Regarding the rest of\nreligious discourse, Berkeley offers a thoroughly cognitive account:\nreligious terms—and in particular\n“God”—correspond to ideas that refer to really\nexisting features of reality. Moreover, Berkeley believes many\nChristian claims are not only cognitively contentful but also\nrationally defensible. Second, he proposes that this limited group of\nutterances should be interpreted non-cognitively: they do not\nrepresent facts but evoke various attitudes and practical\ndispositions.\n\nIn a part of the dialogue concerned with the Christian doctrine of\ngrace, Berkeley attributes two arguments to the sceptical interlocutor\nAlciphron. First, when we consider the meaning of the word\n“grace” we find a “perfect vacuity or privation of\nideas”; it is an “empty name” (Alciphron, 7.4).\nSecond, in saying that grace “acts” or\n“causes” things to happen, we are employing words that are\nclear and intelligible when used to describe the behaviour of physical\nobjects but have no similarly clear significations when applied to a\n“spiritual” matters. In supposing that talk of the\ncausally efficacious properties of grace is contentful, speakers are\nunjustifiably trading on the familiar meanings of these words when\ntalking about physical properties and causal relations between\nphysical objects; when used to elaborate on the nature of grace or\ndescribe its nature, these words do not have a clear sense. We have,\nconcludes Alciphron, no clear idea corresponding to the word\n“grace”; we “cannot assent to any proposition\nconcerning it” or have any faith about it. Berkeley, through the\ninterlocutor Euphranor, rejects Alciphron’s conclusion but\nconcedes Alciphron’s arguments that the word\n“grace” does not suggest a clear idea. Nevertheless, a\ndiscourse “that directs how to act or excites to the doing or\nforbearance of an action may … be useful and\nsignificant”—and express faith—even if it is not\nrepresentational (Alciphron, 7.5).\n\nBerkeley goes on to develop his non-representation account not just\nfor grace but a variety of Christian doctrines. Talking of grace has a\npractical role in encouraging conduct in accordance with Christian\nfaith: \n\n\nGrace may … be an object of our faith, and influence our life\nand actions, as a principle destructive of evil habits and productive\nof good ones, although we cannot attain a distinct idea of\nit. (Alciphron, 7.7) \n\n\nHe takes a similar approach to the Trinity: we lack a clear idea of\nwhat it is, but talk of it is significant because of its practical\nrole in modifying the attitudes and conduct of the faithful\n(Alciphron, 7.8). Original sin receives a similar\ntreatment. In general, talk of the “religious mysteries”,\naccording to Berkeley, serves a practical function of motivating and\nguiding the faithful to think and act according to Christian\nprinciples. They are “placed in the will and affections rather\nthan in the understanding, and producing holy lives rather than subtle\ntheories” (Alciphron, 7.10).\n\nOne of the distinctive characteristics of Berkeley’s account is\nhis attempt to develop a non-cognitive theory for only a limited\nregion of religious language, while retaining a cognitivist account\nfor the rest. Let’s call this a mixed theory. There are\ntwo pressing problems for a mixed theory. First, how should we\ndifferentiate areas of religious language which should be given a face\nvalue interpretation from those that should be given a non-cognitive\ninterpretation? Second, how are the non-cognitive areas of religious\nlanguage meaningfully related to the cognitive areas of language?\nBerkeley answers the first problem by an introspective experiment. We\nreflect on what we are thinking when we talk about the Christian\nmysteries and find that we lack clear ideas or beliefs. However, this\nis unsatisfactory. There is no general agreement on which religious\nexpressions or sentences we are sufficiently clear about to make them\nsuitable vehicles for expressing religious beliefs. Nor does Berkeley\nidentify anything that specifically characterises the Christian\nmysteries as matters on which speakers have much less clear ideas than\nmany of the other ideas that form part of religious judgements, not\nleast the ideas of God and divine properties. Berkeley does not,\ntherefore, have a successful method for discriminating religious ideas\nand thoughts that are cognitively contentful from those that are\nnot.\n\nOn the second problem, suppose for example we follow Berkeley giving a\nface value account of\n\n(4)God is\ngood\n\n\nand a non-cognitive interpretation of\n\n(5)Salvation is given\nby divine grace.\n\n\nThat is, (5) does not have a propositional content but is used to\nencourage faith and virtue. How should (6), be interpreted?\n\n(6)If God is good then\nsalvation is given by divine grace.\n\n\nThe mixed theory has two problems. This sentence combines (4) and (5)\nin a conditional sentence but since the consequent is taken to express\nan attitude it is unclear how it should be understood. This is because\none can assert (6) without expressing the attitude in (5); one might,\nfor example, think that the antecedent and consequent are false but\nnevertheless think that (6) is true because if the antecedent\nwere true then the consequent would be true. It seems, therefore, that\nif the mixed theorist is right that (5) expresses a non-cognitive\nattitude then it must have a different meaning in (6) where it is not\ntied to the expression of any attitude. This brings us to a second\nproblem, which is that (4) and (6) together entail (5). Together these\nsentences make an evidently valid modus ponens argument. However, if\n(5) means something different when asserted and when embedded in the\nconditional (6), then this argument is invalid. More generally, the\nmixed theory looks in difficulty when trying to explain the meaning of\nconditionals or valid arguments that contain expressive and cognitive\nreligious sentences.\n2.2.3 The Prospects for Religious Non-Cognitivism\n\nSome of the problems with Berkeley’s theory arise from its\nlimited application to only parts of religious language. This raises\nthe question of whether a more thoroughgoing non-cognitivist theory of\nreligious language could be developed, perhaps employing the methods\ndeveloped in the defence of current expressivist theories of ethics.\nThe prospects for such a theory remain relatively unexplored territory\nbut here are a couple of relevant consideration, one in favour and one\nagainst.\n\nAn important part of religious discourse is the communication of\nfaithful attitudes. Moreover, faith is a state that appears to be\nintrinsically connected to our motivations and feelings. This is\nsomething that Berkeley makes great play of: \n\n\nFaith, I say, is not an indolent perception, but an operative\npersuasion of mind, which ever worketh some suitable action,\ndisposition, or emotion in those who have it; as it were easy to prove\nand illustrate by innumerable instances taken from human affairs.\n(Alciphron, 7.10) \n\n\nThe idea that faith must have a practical element commands\nbroad support. Faith is said to be intrinsically motivational (Bishop\n2007: 105–106), to involve desires (MacDonald 1993: 44;\nHoward-Snyder 2013: 363), plans and commitments (Swinburne 2005:\n211–212; Kvanvig\n2013: 111), stances (Callahan & O’Connor 2014: 13–14)\npro-attitudes (Audi 2011: 67; Alston 1996: 12–13; Schellenberg\n2014: 83). Berkeley sees it as one of the main selling points of his\nnon-cognitivism that it explains why faith in religious mysteries\nshould have practical effects on the dispositions and behaviour of the\nfaithful and lead people to change their lives (Alciphron, 7.10).\nMore generally, it appears that there are at least the rudimentary\ncomponents for an argument akin to the argument from motivational\nforce used to support ethical non-cognitivism (see van Roojen 2016).\nThis offers one potentially promising line of argument for the\nnon-cognitivist to pursue. Note that religious utterances need not be\nexclusively either cognitive or non-cognitive. It is possible to argue\nthat religious utterances conventionally express both non-cognitive\nattitudes and beliefs (for a defence of this position see Scott 2013:\n71–85).\n\nThere are general objections to ethical and other varieties of\nnon-cognitivism—most notably the Frege-Geach and the\n“embedding” problems (see Schroeder 2010 for an\noverview)—that will equally apply to a putative expressivist\naccount of religious language. However, a thoroughgoing religious\nnon-cognitivism will face the additional problem of identifying the\nrelevant attitudes and plans that are expressed in religious\nutterances. While there are attitudes that might be considered\ncharacteristic of religious language—for instance, awe, devotion\nand obedience—it is difficult to see how such attitudes could\nprovide the resources to provide a plausible account of the meaning of\nreligious utterances or to individuate the meanings of different\nreligious utterances. To take just one example, “God is\nomniscient” will need to be expressive of a distinct\nnon-cognitive attitude to “God is omnipresent” to\ndistinguish their meanings.\n2.3 Paradoxical Content\n\nSome of the claims most commonly made about God’s nature and\ndoctrinal claims, particularly those of Christianity, have been said\nto be absurd, paradoxical or impossible to understand. The most\nfamiliar version of this worry concerns the consistency of the\npredicates ascribed to God such as omnipotence and doctrinal views\nsuch as the Trinity. Considerable effort has been directed towards\nestablishing that religious claims are coherent (for example,\nSwinburne 1994). Those who concede that some religious claims are\nparadoxical have proposed a variety of different responses. Paradox in\nreligious claims has been seen as grounds for atheism (Martin 1990),\nfor modifying religious doctrine or changing our attitudes towards\nthem (Hick 1977a: 1993), or as an ineliminable part of faith\n(Kierkegaard [1844] 1985; see Evans 1989). However, there is a further\nquestion about what such claims mean. If we take paradoxical\nutterances (or ones that are in some way absurd or impossible to\nunderstand) as failing to express propositions, then allowing that\nsome of the principal expressions of faith are paradoxical (or absurd\nor impossible to understand) is thereby to reject (a*).\n\nA number of accounts of religious language appear potentially\nsympathetic with this approach. For example, Ronald Hepburn\n(1958)—according to whom “paradoxical and near-paradoxical\nlanguage is the staple of accounts of God’s\nnature” (16)—proposes that religious ideas and stories may\nhave the role of imaginatively informing a moral way of life. This\nview has some similarities with fictionalism, discussed below. More\nrecently, Stephen Mulhall (2015) has suggested that some religious\nutterances can be understood as unresolvable riddles the meanings of\nwhich we are unable to grasp fully, inviting an open-ended process of\narticulating their meaning that is pursued by those engaged in\nreligious discourse.\n\nAlso relevant here are the works of authors in the apophatic and\nmystical tradition that was particularly prominent from mid-antiquity\nthrough to the late medieval period. Although a variety of accounts of\nreligious language are suggested by the writings of authors in this\ntradition, some of what they say appears sympathetic to paradoxicalism\nabout utterances about God’s nature. Two themes that are found\nin their writings are particularly notable. First, God’s nature\nis taken to be both inconceivable and inexpressible (Dionysius The\nMystical Theology: ch. 5; Gregory of Nyssa Contra Eunomium\nII: 61; Maximus the Confessor, Chapters on Knowledge:\npart one 1–2, part two 2; Maimonides, The Guide of the\nPerplexed: ch. 58). It appears to follow from this that in\nsaying, for example, “God is good”, one does not succeed\nin representing God in either thought or language. A second theme\nfound in some apophatic writers is that an important aspect of\nreligious engagement is establishing a secure relationship with\nGod—sometimes characterised as an “ascent” to God\n(Dionysius The Mystical Theology: ch. 1.1; Cloud of\nUnknowing: ch. 4)—and a recognition of the abject failure\nof what we say to communicate any representation of God’s nature\nmay form part of that process. Far from being pointless, religious\ndiscourse about God may assist in the recognition of our intellectual\nand linguistic limitations (Cloud of Unknowing: ch. 8). For\nfurther discussion and other interpretations of these works see Turner\n1995 and for a detailed review focused on religious language see Scott\nand Citron 2016, Gäb 2020 and Hewitt 2020.\n\nOne difficulty that might be pressed by supporters of the face value\ntheory is these theories, as least to the extent that they are\nproviding accounts of religious language, appear revisionary rather\nthan descriptive of the meanings of religious utterances. For example,\nthe proposal that “God is good” does not simply express\nthe proposition that God is good seems, in the case of apophaticism,\nto be based on a contentious theological view about what can be\nrepresented in thought and language rather than what speakers mean\nwhen they utter this sentence. The sentence is used in a variety of\napparently descriptive ways by speakers: it is said to be true (or\nfalse), it is used in apparently valid arguments, can be embedded in a\nconditional, it is said to be a matter of belief or even of knowledge.\nAny account of religious language will need to do justice to the\nevidence that religious utterances are used descriptively,\nparticularly ones that put (a*) into question.\n2.4 Reductionism\n\nA variety of philosophical positions go by the name\n“reductionism” but reductionist theories of language aim\nto give the truth conditions for sentences that are apparently about a\ncertain range of phenomena in terms of sentences about some other\nrange of phenomena. We can call these (following Dummett 1991: 322)\nthe disputed and reduced class of sentences\nrespectively. Commonly discussed examples include logical behaviourism\n(see Graham 2017), which reduces sentences about mental states to ones\nabout behaviour, and temporal reductionism (see Markosian 2016) which\nproposes that sentences about time can be reduced to sentences about\ntemporal relations between things and events. Most varieties of\nreligious reductionism posit various naturalistic phenomena as the\nsubject of the reduced class of sentences. Unlike other positions\nconsidered in this section, religious reductionists agree with face\nvalue theories that religious utterances have propositional content,\nhowever, they argue that the content in question is not the face value\nsubject matter but instead the subject matter described by the reduced\nclass of sentences.\n\nA variety of reductionism adopted by early Christian writers in their\ntreatment of pagan religion, such as Lactantius ([4th\ncentury] 1871: 22) and Augustine (The City of God, VII ch.\n18), proposes that the pagan deities were based on real, mortal\nhistorical figures revered after their death for their contributions\nto human society and subsequently elevated to the status of gods.\nHowever, this is clearly not a linguistic reductionism.\nAugustine—in a chapter titled “A more credible cause of\nthe pagan error”—aims to discourage and debunk pagan\nbeliefs: they are fictions inspired by the benevolent deeds of mortal\nleaders. Linguistic reductionism does not seek to explain religious\nbelief but identifies a reductive class of sentences by which the\ntruth or falsity of sentences in the disputed class is determined.\n\nLinguistic reductionism has never received widespread support, and has\nnever been developed systematically or comprehensively for religious\nlanguage. Nevertheless, it has an interesting pedigree. For example,\nSpinoza, one of the most influential defenders of pantheism, suggested\nways of interpreting sentences about God in terms of facts about\nnature (Mason 2007). He\nwrites: \n\n\nBy God’s direction I mean the fixed and immutable order of\nNature, or chain of natural events … So it is the same thing\nwhether we say that all things happen according to Nature’s laws\nor that they are regulated by God’s decree and direction.\n([1667] 2002: 417) \n\n\nSince all human actions are, according to Spinoza, the product of the\npredetermined order of nature, we can—following the reductive\nstrategy—say that nobody acts except by the will of God.\nSimilarly, since anything that we can achieve is produced by either\nour own actions and/or by external conditions, all such achievements\ncan be understood as the result of divine providence. So, for example,\n(6) is true if (5) is true.\n\n(5)Nobody acts except\nby the will of God.\n(6)All actions are the\nproduct of the predetermined order of nature.\n\n\nSpinoza also proposes naturalistic reductions of talk about the Holy\nSpirit (1667 [2002, 525]), divine action and providence (1667 [2002,\n445]) and miracles (1667 [2002, 448]).\n\nNaturalistic interpretations of religious language became popular in\nthe 1920s in both Britain and America. For example, Julian Huxley\n(1931) suggests that talk of God could be understood as a way of\ntalking about forces operating in nature or about aspects of nature\nthat we do not understand (see Bowler 2001), and proposes naturalistic\ninterpretations of talk of the Holy Ghost and the Son of God (1927:\n37). Influential early figures in the American tradition of\n“religious naturalism” or “religious\nempiricism” are Bernard Meland (1976) and Henry Wieman\n(1932). Wieman offers various naturalistic accounts of talk of God,\nusually identifying God with natural processes that yield or\nfacilitate ethically or socially desirable results.\n\nAlso notable is the work of Gordon Kaufman, a leading figure in the\ndevelopment of modern liberal theology. He observes that in many cases\nthe natural phenomena that are integral to giving our lives meaning\nare deeply mysterious, for instance, that humans are capable of\nconsciousness and thought and the appreciation of beauty. He contends\nthat “God” is the name given to the “pervasive\nmystery” that gives life meaning (2007: 12). Saying that\nGod is “real” or “exists” express the belief\nthat underpinning this “pervasive mystery” are natural\nforces that promote and facilitate ethical, aesthetic and social human\nflourishing (1981: 49).\n\nDoes truth-conditional reductionism offer a plausible theory of\nreligious language? The obvious place to start is to consider whether\nor not there are any compelling reasons to prefer a reductive rather\nthan a face value theory. Unfortunately, reductionists appear to\nstumble at this first hurdle. It is clear from the writings of\nreductionists that the reductionist interpretation of religious\ndiscourse is not advanced from a consideration of the meanings of what\nspeakers say when they talk about God but instead on the basis of\nreligious or metaphysical theories about the nature of the\nuniverse. However, the belief that there is no creator God is not a\nreason for giving naturalistic truth-conditions to (1); it is a reason\nfor thinking that (1) is false. Notably, even among writers more\nsympathetic to linguistic reductionism we find lapses into\nnon-linguistic reductionism. For example, while Kaufman sometimes\npresents his theory as an account of what is meant by talk about God,\nat other times he presents a much more clearly revisionary\nproposal. He writes, “It is this cosmic serendipitous\ncreativity, I suggest, that we should today think of as\nGod” (Kaufman 2007: 26, my italics) and he proposes that the\n“traditional notion” of God’s purposive activity in\nthe word should be replaced with \n\n\nwhat I call trajectories or directional movements\nthat emerge spontaneously in the course of evolutionary and historical\ndevelopments. (2007: 25)\n\n\nFor further discussion of reductionism see Alston 2005 and Scott 2013:\nch. 9; the latter also discusses subjectivist versions of\nreductionism.\n3. The Use of Religious Language\n\nSuppose that religious sentences represent a religious subject matter,\ni.e., that (a*) is true. There remains the further question of what\nspeakers mean when they use religious sentences. The semantic\nor propositional content of a sentence and its truth conditions is one\nthing, the information that a sentence is used to communicate is\nanother. Any philosophical account of religious discourse must allow\nfor non-literal utterances, where the propositional content of the\nutterance and the thought that it is used to communicate appear to\ndiverge. However, according to the face value theory, utterances such\nas (7), (8) and (9) should—unless the context indicates\notherwise—be understood as literal assertions that, if sincerely\nstated by a religious believer, express the speaker’s belief in\nwhat is\n said.[3]\n\n(7)God created the\nworld.\n(8) The authors of the\nBible were inspired by the Holy Spirit.\n(9)God is\nomnipotent.\n\n\nThere are two main types of opposition to (b*). The first is that\nreligious utterances—including utterances of indicative\nsentences that are apparently literal—are not literal assertions\nbut fall under some other standard category of speech act. Speech\nacts—or illocutionary acts in Austin’s (1955\n[1975, 95]) terminology—are what a speaker does in saying\nsomething. Examples include assertions, questions, commands, warnings,\nthreats, statements of intention, requests. So, according to the first\ntype of opposition to (b*) religious utterances, while many of them\nappear to be literal assertions, are in fact some other kind of speech\nact. Proposals include analogy or metaphor\n (3.1),\n praise or prayer\n (3.2),\n and pretence or other kinds of quasi-assertion\n (3.3).\n The second type of opposition to (b*), considered in\n (3.4),\n proposes that religious sentences are used for various\n(non-assertoric) purposes but does not identify a unified speech act\nas characteristic of religious discourse.\n3.1 Analogy and Metaphor\n\nThe two main kinds of non-literal discourse that have been seen as\nparticularly important in religion are analogy and\n metaphor.[4]\n Analogy relates to the use of expressions that occur in both\nreligious and non-religious contexts. Take, for example, the\nexpressions “good”, “wise” and\n“powerful” when used in ordinary contexts to talk about\npeople. Do these expressions have the same meaning when used to talk\nabout God, or are they used analogously: is the conventional meaning\nthey have when used to talk about mundane objects in some way modified\nwhen used to talk about God? Discussion of religious analogy was\nparticularly lively in early medieval theology and Aquinas was a\nleading proponent of an analogical treatment of religious predicates.\nSee Roger M. White (2010) for a detailed account of Aquinas’\ntheory, its background in Aristotle’s philosophy as well as\nsubsequent ideas about analogy in religion in the work of Karl Barth\nand Immanuel Kant.\n\nA detailed contemporary account of analogy by Richard Swinburne (1993:\nch. 4) proposes that analogical use of a term involves a modification\nof its syntactic and/or semantic rules. A syntactic rule for the use\nof a term p sets down general conditions governing its use. A\nsemantic rule for p gives examples of the things to which\np correctly applies, or does not correctly apply. For instance,\ngiving a semantic rule for red might involve pointing to\nvarious examples of red objects and contrasting them with objects that\nare not red (1993: 58). In using an expression analogically, Swinburne\nproposes, its semantic or syntactic rules are loosened. So W*, the\nanalogical use of a predicate W, may require a less strict\ndegree of resemblance to standard examples of W for its correct\nuse. Swinburne believes that “person” which in its\nordinary sense has living human beings with physical bodies as its\nstandard examples, must be used analogically with a suitable weakening\nof its semantic rules and modification of its syntactic rules when\napplied to God.\n\nIt is notable that on Swinburne’s theory analogy can be seen as\na commonplace feature of language use that is both compatible with a\nface value theory and found much more widely than in religious\ndiscourse. For example, consider the following utterances:\n\n(10)The lawn is\nsquare.\n(11)The audience was\nsilent.\n\n\nLawns do not, of course, have four sides of equal length and in saying\n(11) the speaker does not mean that the audience was not making any\nnoise whatsoever. According to modern pragmatic theories of\ninterpretation (such as Sperber & Wilson 1986; Carston 2002;\nRecanti 2004), constituent expressions or concepts undergo an ad hoc\nmodification prompted by the context in which they are uttered and\nunderstood. For instance, (10) might involve a loosening of the\nconcept SQUARE, i.e., SQUARE* that includes not just objects that are\nsquare but also objects (like lawns) that look square or are\napproximately square. Akin to Swinburne’s account of rule\nmodification in analogy, the condition that squares have four sides of\nequal length and internal angles of ninety degrees is relaxed.\nUnderstood in this way, however, analogy is not distinctive of\nreligious discourse but a prevalent characteristic of normal\ncommunication. When God is the subject matter, expressions undergo a\nsuitable ad hoc loosening as part of normal, literal\ncommunication.\n\nRecent research has focused more on religious\n metaphors.[5]\n The importance of metaphor has long been noted by theologians, with\nSally McFague (1983) offering the most extensive treatment, while in\nthe philosophy of religion William Alston (1989: ch. 1 and 2), Janet\nSoskice (1985), Anthony Kenny (2005) and Richard Swinburne (1991: ch.\n3; 1993: ch. 4 and 5)\nhave all contributed to the discussion.\n\nSince metaphors are commonplace in various areas of discourse, it may\nseem that questions about religious metaphor should be\nsubsumed under questions about metaphor in general raised in the\nphilosophy of language. However, some have proposed that what is said\nabout God is irreducibly metaphorical. Tillich’s (1951)\ntheory that religious language is symbolic is perhaps an early\nexpression of the view, and Anthony Kenny and Sally McFague are more\nrecent proponents of a view of this type (see also Jüngel 1974;\nSarot 1992). William Alston, the chief critic of the theory, offers\nthe following statement of irreducibility theory (1989:\n17–19):\n\n(IT)Religious metaphors\nare the only way of stating truths about God, and the content of a\nmetaphorical utterance about God cannot be stated, even in part, in\nliteral terms.\n\n\nAlston sees the supporter of IT as construing even apparently literal\nclaims about God as metaphorical. However, Alston’s formulation\nmay be overly modest, since both Kenny and McFague seem to take the\nview that all talk of God is irreducibly metaphorical,\nirrespective of whether it is true or false.\n\nIT fails, according to Alston, because metaphors, religious metaphors\nin particular, are always in principle susceptible to literal\nparaphrase. Scott (2013: 180–182) argues that IT, on any\nplausible account of what metaphors are, faces insurmountable\nproblems. For example, according to one standard theory (Searle 1993),\nmetaphors say something that is usually patently false with the aim of\nimplying something other than the false thing that is said.\n“God is my rock”, for instance, might imply that God is a\nsource of confidence for the speaker. However, it follows from IT that\nif a metaphor about God implies anything true about God then that\nimplied claim should also be metaphorical. This appears to undermine\ntruthful communication about God. If, however, talk of God is not in\nthe business of expressing truths, according to what norm are\nutterances about God affirmed or rejected? Metaphor theories therefore\nface challenges in specifying and defending the irreducibility claim\nas well as in as well as elaborating what a metaphor is.\n3.2 Praise and Prayer\n\nAlthough some caution is needed in placing work in continental\nphilosophy into the analytic classifications that inform this article,\nthe treatment of religious language by Jean-Luc Marion (1994, 1982\n[1995]) and Jacques Derrida (1992) appears sympathetic to the speech act\ntheories considered in this section. Speakers, according to Marion, in\nuttering indicative sentences about God praise God (and thereby\nexpress devotion, awe, and so on, towards God) rather than express\nbeliefs about God. Derrida is critical of Marion; not, however,\nbecause he endorses a face value approach but because he believes\nspeakers are better understood as voicing prayers to God rather than\npraise.\n\nMarion’s theory is influenced by the apophatic idea that God\ncannot be accurately conceived of. Conceiving of something, according\nto Marion, involves placing some descriptive limitation or restriction\non that thing. God and other religious subjects, Marion claims, are\n“saturated phenomena” that cannot be captured by human\nconcepts: \n\n\nThat he is the given par excellence implies that “God” is\ngiven without restriction, without reserve, without restraint.\n“God” is given not at all partially, following this or\nthat outline … but absolutely, without the reserve of any\noutline, with every side open … (1994: 588) \n\n\nHowever, inspired by Dionysius’ writings, he presents an\ninterpretation of religious discourse as referring to God without\nascribing properties to God. For example, “God is good”\naddresses rather than describes God (1982 [1995, 76]). Marion calls\nthis non-objectifying and non-predicative way of talking about God\n“praise”; it is a form of speech that is laudatory but\ncombined with a recognition (at least by the speaker) that the\nproperty that is apparently predicated of God is inappropriate. Praise\n“feeds on the impossibility or, better, the impropriety of the\ncategory” (1982 [1995, 76]). In talking of God, therefore,\nspeakers praise God but recognise the inadequacy of the concepts they\nare using to represent God: the predicate expressions are not used\nwith the belief that they accurately represent God. In saying\n“God is good” speakers do not, therefore, believe or\nassert that God is good. For further discussion see James\nSmith 2002.\n\nDerrida is sympathetic to Marion’s account but raises the\nobjection that praising God (the “encomium” of God), on\nMarion’s account, still involves predication: \n\n\nEven if it is not a predicative affirmation of the current type, the\nencomium preserves the style and the structure of a predicative\naffirmation. It says something about someone … [Praise] entails\na predicative aim, however foreign it may be to “normal”\nontological predication. (1992: 137) \n\n\nDerrida proposes instead that religious talk about God should be\nunderstood as prayer rather than praise. Unlike praise, prayer is a\nform of address that, Derrida argues, is entirely non-descriptive.\nPrayer “is not predicative, theoretical (theological),\nor constative” (1992: 110). He elaborates:\n\n\nI will hold to one other distinction: prayer in itself, one may say,\nimplies nothing other than the supplicating address to the other,\nperhaps beyond all supplication and giving, to give the promise of His\npresence as other, and finally the transcendence of His otherness\nitself, even without any other determination; the encomium, although\nit is not a simple attributive speech, nevertheless preserves an\nirreducible relationship to the attribution. (1982 [1995, 111])\n\n\nDerrida’s objection is unconvincing. (12) and (13), for example,\nappear to have the same “style and structure”:\n\n(12) God is\ngood.\n(13)The table is\nround.\n\n\nHowever, Marion’s point is presumably that the similarity of\n(12) and (13) is purely superficial. Marion does not give specifics,\nbut one way of developing his is account is to take (12) to be\ncommunicating (something like):\n\n(14)Oh, God you are\ngood!\n\n\nWhere (14) is understood as an expression of (say) the speaker’s\nrespect and admiration of God and the speaker recognises the\ndescriptive inadequacy of “good”. Derrida is, in effect,\nreading too much into the surface appearance of utterances: (12) and\n(13) may look similar but they are not thereby speech acts of the same\ntype.\n\nThe strengths and weaknesses of Derrida’s and Marion’s\naccounts are as yet largely unexplored in analytic philosophy. There\nare, however, some obvious challenges that need to be addressed. For\nexample, Marion claims in praising God the predicates that are\nascribed to God are recognised as inadequate by speakers.\nThis seems implausible. Speakers in many cases appear to believe what\nthey are saying about God. Marion might argue that such religious\nbelievers have false beliefs about God’s nature, but to\nclaim that they do not have beliefs about God’s nature that they\nintend to communicate seems to be a misrepresentation of\nspeakers’ states of mind. Moreover, Derrida’s own\nsuggestion that talk of God should be understood as prayer does not\nseem to have any advantage over the position his is criticising.\nPrayer also involves utterances that appear to represent God:\n“Our Father, which art in heaven”, for instance.\n3.3 Fictionalism\n\nFictionalists defend the moral and intellectual legitimacy of engaging\nwith a field of discourse for speakers that do not believe that the\nsentences of that discourse are true (for a general overview see\nDivers & Liggins 2005, for a review focused on religious\nfictionalism see Scott & Malcolm 2018, Brock 2020). Some\nfictionalists propose that that speakers\nemploy quasi-assertion. A quasi-assertion is a speech act\nthat has the appearance of an assertion—it is the utterance of\nan indicative sentence—but it does not commit the speaker to the\ntruth of the expressed proposition. The speaker goes along with\nor accepts the content of what is quasi-asserted but does not\nthereby believe it.  The details of quasi-assertion depend on the kind\nof fictionalism being proposed and a variety of options have been\nproposed (for an overview see Kalderon 2005: 119–129). On some\naccounts, quasi-assertion involves the assertion of something other\nthan the propositional content of the uttered sentence. For example, a\nfictionalist about mathematics might argue that a mathematical\nsentence M is used to assert that M is true according to standard\nmathematics (Field 1980). Alternatively, to quasi-assert a\nsentence might be to\npretend to assert it. Comparable approaches are found among\nreligious fictionalist. Peter Lipton (2007), for instance, suggests\nthat engagement with religious could be akin to immersion in a\nfiction; the fictionalist accordingly pretends that the claims of\nreligion are true. Other religious fictionalists (such as Robin Le\nPoidevin 2016, 2019) propose that the fictionalist, without believing that a\nreligious utterance is true, may say it on the basis that it is true\nwithin some religious tradition.\n\nParticularly important for our purposes is the distinction between\nrevolutionary and hermeneutic fictionalism. Revolutionary religious\nfictionalism is not a theory of religious language—it is not a\nposition on what speakers actually mean—but instead a\nrevisionary proposal that is usually offered in response to error\ntheory about religion. Despite religious claims being untrue,\nrevolutionary fictionalists argue religious discourse has sufficient\npragmatic benefits that we should continue to employ religious\nlanguage and engage in religious thought rather than eliminate it,\neven though we should not believe that it is true. In general,\nrevolutionary fictionalism is motivated by the wish to continue to\nreceive the social and other benefits of engagement with a religion\nwithout commitment to its truth. LePoidevin and Lipton are both\nrevolutionary fictionalists. The Sea of Faith Network, inspired by the\nwork of Don Cupitt (1980), can also be understood as sympathetic to\nrevolutionary fictionalism because it promotes Christian practice and\nthe continuing engagement with religious discourse without religious\nbelief. Interesting though they are, we will not be investigating these\ntheories further because they are not saying anything about the\nmeaning of religious utterances. Instead, they are recommending a change\nof attitude towards the claims of religion and quasi-assert rather than\nassert them.\n\nHermeneutic fictionalism about religion is the view that speakers are\nnot committed to the truth of what they say on religious matters:\nspeakers are quasi-asserting rather than asserting indicative\nreligious sentences. This is not offered as a proposal about what\nspeakers should do but instead as a fact about current linguistic\npractice. Speakers accept but do not believe what they say when\nengaging in religious discourse. So, along with other positions\ndiscussed in this section, hermeneutic fictionalists reject (b*).\nDefending this position may seem like a tall order: isn’t\nhermeneutic fictionalism undermined by the apparent linguistic\nevidence that religious speakers are committed to the truth of what\nthey say? Nevertheless, there are a couple of positions that look to\nbe potential contenders for religious hermeneutic fictionalism.\n\nFirst, Georges Rey has defended a position that he calls\nmeta-atheism according to which practitioners of religion\nexhibit widespread self-deception about what they say (2006: 337). For\nanyone with a basic education in science, Rey contends, it is obvious\nthat religious claims are false. Rey is not proposing, however, that\neducated speakers are insincere when they affirm religious claims\nsince they may think of themselves as believing what they are saying\n(2006: 338). Instead, speakers are in a state of self-deception. While\nthey may recognise on a more critical level that religious claims are\nfalse, they do not entertain this when engaging in religious\ndiscourse. Why do religious people do not recognise and consciously\ndraw out the implications of their disbelief? Rey suggests a number of\nreasons: loyalty to family and other social groups, personal ties and\nidentifications with religious institutions, resistance to changing\none’s public stance, the wish for one’s life to be part of\na larger project. Rey supplements his arguments by pointing up\ndifferences between religious and scientific judgements aimed at\nshowing that the latter are “understood to be fictional from the\nstart” (2006: 345). Now, Rey’s position is, to say the\nleast, contentious—for starters, his contention that religious\nclaims are obviously false seems unsupportable (see Scott 2015 for a\nmore detailed critique). However, with some assumptions about\nself-deception, we can understand meta-atheism as a kind of\nhermeneutic religious fictionalism. Speakers are in a conflicted state\nof self-deception that falls short of belief: on some level or in some\nuncritical contexts speakers treat religious claims as if they were\ntrue, while also believing in critical and reflective contexts that\nthey are false. Accordingly, in uttering religious sentences speakers\nengage in quasi-assertion whereby they accept what is said without\ngenuinely believing it to be true.\n\nSecond, a point of debate in current research on the nature of faith\nis whether propositional faith—i.e., faith that\np—requires belief that p. Supporters of\ntraditional doxastic accounts defend this condition while supporters\nof non-doxastic theories of faith argue that it is sufficient that one\nhave a positive cognitive attitude towards p other than belief.\nThere are various proposal for what this non-doxastic attitude\nis. Candidates include: acceptance (Alston 2007), assent (Schellenberg\n2005), assumption (Swinburne 2005; Howard-Snyder 2013), trust (Audi\n2011), hope (McKaughan 2013; Pojman 1986 and 2001), or acquiescence\n(Buchak 2012). However, to the extent that religious discourse is in\nthe business of trading in the expression of faithful attitudes then\nit follows from the non-doxastic position that a speaker may sincerely\naffirm their faith in a religious proposition without believing it to\nbe true. Notably, some non-doxastic theorists offer linguistic\nevidence to show that speakers do not believe what they say. This\nappears to concede a hermeneutic fictionalist account of faithful\ndiscourse (for discussion see Malcolm & Scott 2017 and Scott\n2020). It seems likely that many proponents of non-doxastic theories\nof faith will not welcome the characterisation of their position as a\nvariety of hermeneutic fictionalism (see Howard-Snyder 2016 and\nMalcolm 2018).  However, non-doxastic theories are usually presented\nprimarily as psychological or epistemological theories about the\nnature of faith; the implications of the position for religious\ndiscourse, and its relationship with hermeneutic fictionalism, have\nyet to be fully set out.\n3.4 Religious Purposes\n\nWe have been looking at theories than characterise the affirmation of\nindicative religious sentences by a type of speech act other than\nliteral assertion. However, some accounts propose that religious\ndiscourse, rather than exhibiting a distinctive type of speech act,\nemploys language for certain distinctive purposes. Possible examples\nof this position include Wittgenstein’s suggestion that a\nreligious judgement should be understood as a picture that has a\nregulative function in guiding practical decisions (1966: 53–4)\nand Kant’s proposal that religious utterances communicate\nguidance for how to think (Critique of Pure Reason A671/B699;\nA686/B714). This section will consider the accounts from Ian Ramsey\n(1957) and more recently Rowan Williams (2014).\n\nAccording to Ramsey, full-blooded religious engagement involves two\nthings: a commitment and a discernment. The commitment is an attitude\nthat is directed towards the universe as a whole; it is\n“total” and has a particular intensity akin to a personal\nrelationship. The discernment involves a “disclosure”,\nwhich he describes as a recognition of something of enormous\nimportance. The something in question is not a new fact but a\nrecognition that “brings together” what is known whereby\none appreciates the world in a new light. For Ramsey, the purpose of\nreligious language is to communicate and promote religious commitment\nand discernment: “religious language talks of the discernment\nwith which is associated, by way of response, a total\ncommitment” (1957: 49). With respect to utterances about God,\nRamsey says: \n\n\nMy suggestion is that we understand their logical behaviour aright if\nwe see them as primarily evocative of what we have called the odd\ndiscernment, that characteristically religious situation which, if\nevoked, provokes a total commitment. (1957: 50)\n\n\nWhen it comes to the details of how to interpret specific religious\nutterances, Ramsey’s proposals are very varied. Some utterances\nhe takes to be expressive of attitudes. Talk of “eternal\npurpose” aims to evoke a sense of “cosmic wonder”\n(1957: 77). Some are metalinguistic claims about the proper use of\nreligious discourse: \n\n\nto say that “God is impassable” is to claim that the word\n“God” is a word which cannot be confined to passability\nlanguage. (1957: 89) \n\n\nOthers are about mystery: \n\n\nLet us recognize that the doctrine of the Virgin Birth is essentially\na claim for mystery at Christ’s birth or at Christ’s\ndeath. (1957: 132) \n\n\nHowever, for Ramsey, religious sentences have representational content\nbut are used by speakers in a variety of non-representational\nways—expressive, metalinguistic, to generate a sense of\nmystery—for the purposes of evoking discernment and encouraging\ncommitment, rather than descriptively.\n\nRecently Rowan Williams (2014) has proposed that religious language\nserves to challenge us both morally, by undermining selfishness and\ncomplacency, as well as conceptually by encouraging us to think about\nthe world in different terms. The use of religious language involves\ninnovations that “invite us to rethink our metaphysical\nprinciples” (2014: 130), undercut “our sense of being a\nfinished subject with a clear agenda of need and desire” (2014:\n152–3), and “open us to a truth that is changing us and\nnever leaves us in complacent possession of the power we think we\nhave” (2014: 154). A similar approach is taken to discourse\nabout God. What we are representing in talking of God is not an object\nbut “a particular aspect of every perception, the aspect that\ngives to any specific perception its provisionality, its openness to\nbeing represented afresh” (2014: 148). These purposes can be\nfurthered even by using religious sentences that are not\nconsistent.\n\nFace value theorists will, of course, find much to object to in both\nRamsey’s and Williams’ discussions of religious language.\nOne obvious point to raise is that if engagement in religious\ndiscourse is driven by the purposes that Ramsey and Williams describe\nthen it seems that one need not be concerned with the truth of what\none says. Notably, Williams appears to be sympathetic to the\nendorsement of incoherent claims if they further the broader proposed\npurposes of religious discourse. However, caution is needed in\nclassifying these accounts as descriptive of religious discourse\nrather than revisionary proposals for objectives that speakers might\naim for. If they fall into the latter category, then they are in a\nsimilar position to revolutionary fictionalism.\n4. Religious Minimalism\n\nMinimalist accounts of religious language, which are—rightly or\nwrongly—closely associated with Wittgenstein, agree with (a*)\nand (b*) but take issue with the face value understanding of\ndescriptiveness along with associated ideas of fact, representation,\nreference and truth. For convenience, let us call these\nrealism-relevant concepts. The opposition involves two main\nideas. First, rather than posit a demanding standard that a field of\ndiscourse must meet to count as genuinely descriptive, minimalists\npropose that a discourse that satisfies very modest\nconditions—for example, that it possesses a truth predicate and\nstandards of justification for what is affirmed or rejected—is\nthereby descriptive. Second, realism-relevant concepts are taken to be\nat least partly constituted by features of the discourse (or\n“language game”) in which they are used. Minimalists\nthereby reject a uniform account of descriptiveness across different\nareas of discourse. Descriptiveness, reference, truth, and so on are\nlanguage-game-internal concepts: they are constituted\ndifferently in different areas of discourse.\n 4.1\n will consider minimalist accounts of religious discourse and\n 4.2\n will look at whether Wittgenstein might plausibly be understood as\nsharing this approach.\n\nThe discussion in this section touches on issues that have been\nexplored in detail outside of the philosophy of religion. For more on\nthe wider philosophical background see Stoljar & Damnjanovic 2014\non deflationary and Pedersen & Wright 2013 and 2016 on pluralist\naccounts of truth.\n4.1 Minimalism About Religion\n\nThe two key features of minimalism are prominent in Hilary\nPutnam’s Wittgensteinian account of religious language in\nRenewing Philosophy (1992). First, Putnam draws attention to\nWittgenstein’s well-known remarks on family resemblances (1953:\n65–66). Wittgenstein’s target in these remarks is the idea\nthat an expression requires necessary and sufficient conditions for\nits correct application. Intuitively, it seems that there must be such\nconditions if the meaning of the expression remains the same when it\nis used in different contexts. However, consider the term\n“game”, with its varying applications—board games,\ncard games, Olympic games, and so on; we can see, Putnam (following\nWittgenstein) argues, that for any particular condition that appears\nto characterise some types of game, there will be others that fail to\nsatisfy it. Rather than common necessary and sufficient conditions for\nall uses of “game”, there is a network of similarities and\nrelationships between them. Putnam proposes that Wittgenstein took a\nsimilar lesson to apply to notions like language,\nreference and truth: \n\n\nreferring uses don’t have an “essence”; there\nisn’t some one thing which can be called referring. There are\noverlapping similarities between one sort of referring and the next,\nthat is all. (1992: 167–8) \n\n\nPhilosophical confusion results when, for instance, we attempt to\napply standards of reference appropriate to descriptions of the\nperceived world to mathematical claims. Putnam then extends this point\nto religion: \n\n\nThe use of religious language is both like and unlike ordinary cases\nof reference: but to ask whether it is “really” reference\nor “not really” reference is to be in a muddle. There is\nno essence of reference … In short, Wittgenstein is telling you\nwhat isn’t the way to understand religious language.\nThe way to understand religious language isn’t to try to apply\nsome metaphysical classification of possible forms of discourse.\n(1992: 168) \n\n\nA similar point is taken to extend to truth, descriptiveness and other\nrealism-relevant concepts.\n\nSecond, Putnam argues that truth can be understood as idealised\nrational\n acceptability.[6]\n This is not to say that truth depends on justification here and\nnow—that is, what seems to us justified on currently\navailable evidence—but rather that truth is not independent of\nall justification: “To claim a statement is true is to claim it\ncould be justified” (1981: 56). To be truth-apt, it is sufficient that the assertoric\nutterances of religious discourse are governed by internal standards\nof warrant. While the standards of warrant in a given area of\nreligious discourse may be significantly different to those in science\n(appealing to the authority of the Bible or the Pope, for instance,\nwould not count in favour of a scientific theory), the condition that\nthere are such standards is clearly satisfied. To arrive at a positive\naccount of what constitutes truth (and other realism-relevant\nconcepts) in religion, therefore, requires an examination of\nthe specific standards of justification that are in play in religious\ndiscourse (or, more accurately, the different standards in different\nreligious discourses).\n\nD.Z. Phillips was a leading interpreter and champion of a\nWittgensteinian approach to philosophy of religion. His early writings\nappear sympathetic to a non-cognitivist account of religious\ndiscourse. He questions whether religious utterances are descriptive\nand proposes, for instance, that “religious belief is itself the\nexpression of a moral vision” (1976: 143) and that \n\n\nthe praising and the glorifying does not refer to some object called\nGod. Rather, the expression of such praise and glory is what we call\nthe worship of God. (1976: 149) \n\n\nIn his later writings from the 1990s, however, Phillips’ remarks\nappear more minimalist.\n\n\nBy all means say that “God” functions as a referring\nexpression, that “God” refers to a sort of object, that\nGod’s reality is a matter of fact, and so on. But please\nremember that, as yet, no conceptual or grammatical clarification has\ntaken place. We have all the work still to do since we shall now\nhave to show, in this religious context, what speaking of\n“reference”, “object”,\n“existence”, and so on amounts to, how it differs, in\nobvious ways, from other uses of these terms. (1995: 138)\n\n\nHere, Phillips allows that religious expressions refer and religious\nsentences are descriptive, etc., but proposes—in line with\nminimalism—that the reference and descriptiveness of religious\ndiscourse is partly constituted by features distinctive of religious\ndiscourse. For a detailed and sympathetic treatment of Phillips’\nwork see Burley 2012 and for a critique see Scott & Moore\n1997.\n\nIn general, religious minimalists agree on a number of points. They\ngrant that religious statements have propositional content, and may be\ntrue, descriptive, factual, and so on. Second, realism-relevant\nconcepts are understood as language game internal concepts.\nTo know what makes for truth in religion, for instance, we need to\nlook at the internal standards of justification that inform religious\ndiscourse. Third, the primary aim of minimalism, at least in the\nWittgensteinian form it takes in philosophy of religion, is to\nelucidate the different standards that characterise different areas of\ndiscourse, and to spell out the differences between realism-relevant\nconcepts in religion and realism-relevant concepts in science or\nhistory. However, there is also an important area of disagreement\nbetween religious minimalists. Phillips takes the different\nconstitution of truth in different areas discourse to show that\n“true” means something different in different\ndiscourses: We have multiple truth concepts, with different extensions\n(1976: 142; 1995: 149). In contrast, Putnam appears to be more\nsympathetic to a pluralist account of truth: the truth\npredicate has certain necessary and sufficient conditions for its use\n(such as the disquotational schema) but may be additionally\nconstituted by different further conditions according to whether we\nare talking about religious truths, scientific truths, or ethical\ntruths (see Wright 1992: ch. 2). Fragmentary accounts of truth of the\nkind that Phillips appears to endorse have been widely\ncriticised—see, for example, Timothy Williamson (1994: 141)\nChristine Tappolet (1997).\n\nReligious minimalism is usually offered as a program of research\nrather than a detailed account of religious discourse. There is talk\nof the need to attend to the practices and forms of life of religious\nbelievers, an emphasis on the difference between religious and other\nareas of discourse, and warnings against applying scientific or\nhistorical standards to religious judgements, but the positive story\nof the meaning of religious utterances is often left as a promissory\nnote. However, there are some areas where more substantial points of\ndisagreement can be pursued. For instance, many supporters of the face\nvalue theory will reject the pluralist or fragmentary accounts of\ntruth that inform the minimalist approach. Also, even if one is\nsympathetic to a pluralist account of truth, it does not\nstraightforwardly follow that truth in religion is different from\ntruth in science or history (for a defense of this point see Scott\n2013: ch. 11). Religious minimalism will also be rejected by\nnon-cognitivists. If the descriptiveness of religious language is\nsecured as easily as minimalists propose, then this will undermine the\nnon-cognitivist position that it is—despite superficial\nappearances—not descriptive. Non-cognitivists argue that the\n“propositional surface” of language conceals a variety of\ndifferent functions: ethical statements express approval or\ndisapproval, mathematical statements are stipulations, and so on. For\na defense of this see Blackburn 1998.\n4.2 Wittgenstein\n\nWittgenstein’s work on religion has served as a sourcebook for\nmodern opposition to the face value theory. His remarks have been seen\nas lending support to many of the positions considered in this\narticle. Non-cognitivists can find support in Wittgenstein’s\ncharacterisation of religion as “a passionate commitment to a\nsystem of reference” (1970 [1994, 64]; see also Tilghman 1991);\nfictionalists in his proposal that religious believers live their\nlives according to certain “pictures”; non-assertoric\nspeech act theorists in his comparison of religious utterances to\ncommands (1970 [1994, 61]). Wittgenstein was even attracted (if only\nbriefly) to a subjectivist interpretation of God-talk ([PO]:\n42). Given Wittgenstein writings on religion are only infrequent and\nrelatively brief, it is perhaps not surprising that, beyond his clear\nresistance to the face value theory, he would not have settled views\non the topic. For accounts profoundly influenced by or interpretative\nof Wittgenstein, see Winch (1987), N. Malcom (1997), Rhees (1970).\n\nThe minimalist reading of Wittgenstein is supported by his apparent\nendorsements of a deflationary account of truth (1953: 136), although\nhe does not explicitly endorse the idealised justification theory that\nPutnam proposes. However, the best evidence for minimalism comes from\nhis emphasis on the differences between the use of religious\nsentences, and historical or scientific (and in general empirical and\ndescriptive) sentences. Specifically, he points up differences between\nthe standards of warrant employed in religious and other\ndiscourses—the kinds of circumstance in which a religious\nbeliever judges something to be true, grounds for disagreements\nbetween religious believers and non-believers, and so on. This\npervades his work on religion. For example, Wittgenstein compares the\nreligious belief in the Last Judgement with scientifically based\nbeliefs, or ordinary beliefs about observable states of affairs (he\ngives the example “There is a German aeroplane overhead”).\nWhile religious believers may speak of “evidence” and\n“historical events”, Wittgenstein argues that the evidence\nand events cited in connection with religious judgements do not\nconstitutes reasons to believe them in the way that evidence given in\nsupport of a hypothesis gives a reason to believe that the hypothesis\nis true. In religious discourse “reasons look entirely different\nfrom normal reasons” (1966: 56), religious belief is not\n“a matter of reasonability” (1966: 58), religious beliefs\nare not hypotheses or opinions, they are not properly spoken of as\nobjects of knowledge or as having a high probability, and when\nhistorical facts are introduced in support of religious belief\n“they are not treated as historical, empirical,\npropositions” (1966: 57). Here Wittgenstein seems at pains to\nemphasise the contrast between religious discourse and empirical\ndiscourses. Indeed, he implies that when taken (or where offered) as\nreporting scientific facts or scientific theories, religious sentences\nare in error. Wittgenstein is not, according to the minimalist\ninterpretation, seeking to find any disadvantageous comparison between\nreligion and science; to show, for example, that religion is merely\nexpressive of attitudes, while science is properly descriptive.\nRather, he is describing the different standards that make for truth\nand descriptiveness in these fields of discourse and, in so doing,\nelucidating the distinctive characteristics of religious\ntruth as well as other realism-relevant concepts.\n\nNotably, if Wittgenstein was a minimalist about religious discourse\nthen one standard line of objection to his account is misplaced.\nWittgenstein is sometimes criticised as proposing that religious\ndiscourse should be quarantined from other areas of discourse, in\nparticular science and history. This is seen as leading to a variety\nof fideism, where religious beliefs are compartmentalised and\nunsusceptible to non-religious intellectual evaluation. The objection\nis forcefully prosecuted by Kai Nielsen. According to Wittgenstein,\nNielsen argues, \n\n\nno philosophical or other kind of reasonable criticism, or for that\nmatter defence, is possible for forms of life or, indeed, of any form\nof life, including Hinduism, Christianity and the like. (2000: 147)\n\n\n\nHowever, contrasting the different standards exhibited by religious\nand scientific discourses is consistent with scientifically or\nhistorically well-founded evidence informing religious judgement.\nIndeed, minimalists would be remiss in not taking account of the fact\nthat historical evidence clearly is seriously weighed in a\nvariety of religious beliefs including belief in Christ’s\nresurrection, or the creation of the world, and beliefs about miracle\nworkers and what they have done. Insofar as this happens, the verdicts\nof historical or scientific investigation can modify religious\njudgements. In a similar way, many religious judgements are dependent\non historically or scientifically assessable evidence. For example,\ncompelling evidence that the documentary and eyewitness testimony for\na miracle was a hoax would be a good reason not to believe that the\nmiracle in question occurred and this evidence comes from\n“outside” the religious language game. However,\nminimalists can allow that empirical evidence is part of the\njustification for many religious beliefs while maintaining the theory\nthat religious discourse employs distinct standards of justification\nto science.\n5. Reference and Logic\n\nAlthough they have received less attention that the other topics in\nthis article, two other issues relating to religious language should\nbe noted. First, the reference of “God”, second, the logic\nof religious language.\n\nRecent work on the reference of “God” mostly proceeds from\nthe assumption that “God” is a name rather than a title or\na description (for criticism of this view see Johnston 2011:\n6–7; for supporting arguments see Scott 2013: 86–7). From\nthis starting point, attention has focused on how to apply the rich\nresources of research on names from the philosophy of language to this\ncase. For example, according to descriptivist theories\n“God” has a descriptive content (a view that stretches\nback at least as far as Anselm), whereas according to Millian theories\n“God” refers to its bearer without conveying any\ninformation about the object referred to. The latter theory can be\ncombined with a causal theory of reference (Kripke 1980) to explain\nhow the name becomes attached to the referent. Although many of the\narguments in this debate derive from the philosophy of language, there\nare also interesting implications of these positions for the\nphilosophy of religion. For instance, a descriptivist theory appears\nto place limits on how wrong we can be about what God is like. A\ncausal theory of reference, in contrast, will need to be backed up by\na defence of the possibility of causal interaction with God and an\naccount of how God is named. For discussion of these theories see\nAlston 1989 and 1991, Gellman 1997 and Sullivan 2012. For a recent review of the\nfield see Scott 2013: ch. 7.\n\nDoes religious language adhere to a non-classical logic? This issue\nhas been raised in at least two contexts. First, some of the writings\nof authors in the apophatic tradition have been seen as supporting a\nparaconsistent logic of religious language, specifically dialetheism,\nthe view that some contradictory sentences are true (see Priest 2002:\n22–3, although Scott & Citron 2016: 72 cast doubt on this as\na plausible interpretation of apophatic authors). Second, Michael\nDummett considers a number of arguments in favour of the view the\ndivine omniscience entails bivalence, i.e., that for any statement\np it is determinately either true or false. For example, if God\nknows that p, then He knows that he knows that p and\ntherefore it is true; but if God does not know p then He knows\nthat He does not know it and hence knows that it is not true. From\nthis it can be shown that God must know whether p is true or\nfalse, thereby securing bivalence (2004: 94–96; see also 1991:\n318–9, 348–351). Since, for Dummett, realism for a field\nof discourse hinges on the success of the principle of bivalence for\nthe statements of that discourse, it would follow that theism leads to\nglobal realism. For a critical discussion of Dummett’s arguments\nsee Scott and Stevens 2007.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Alston, William P., 1989, <em>Divine Nature and Human\nLanguage</em>, Ithaca, NY: Cornell University Press.",
                "–––, 1991, <em>Perceiving God: The Epistemology\nof Religious Experience</em>, Ithaca, NY: Cornell University\nPress.",
                "–––, 1996, “Belief, Acceptance, and\nReligious Faith”, in Jeff Jordan and Daniel Howard-Snyder\n(eds.), <em>Faith, Freedom, and Rationality</em>, Lanham, MD: Rowman\n&amp; Littlefield, pp. 3–27.",
                "–––, 2005, “Religious Language” in\nWilliam Wainwright (ed.), <em>The Oxford Handbook of Philosophy of\nReligion</em>, Oxford: Oxford University Press, pp. 220–44.\ndoi:10.1093/0195138090.003.0010",
                "–––, 2007. “Audi on Nondoxastic\nFaith”, in Mark Timmons, John Greco, and Alfred Mele (eds.),\n<em>Rationality and the Good: Critical Essays on the Ethics and\nEpistemology of Robert Audi</em>, Oxford: Oxford University Press,\npp. 123–38.",
                "Anonymous, [14<sup>th</sup> century], <em>The Cloud of\nUnknowing</em>, in A. Spearing (trans.), <em>The Cloud of\nUnknowing</em>, London: Penguin, 2001.",
                "Audi, Robert, 2011, <em>Rationality and Religious Commitment</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199609574.001.0001",
                "Augustine, [4<sup>th</sup> century], <em>The City of\nGod</em>, volume 1, M. Dods (trans.), Edinburgh: T &amp; T Clark, 1913.",
                "Austin, J.L., 1955 [1975], <em>How to Do Things with Words</em>,\nsecond edition, J.O. Urmson and M. Sbisa (eds.), Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198245537.001.0001",
                "Ayer, A.J., 1936, <em>Language, Truth and Logic</em>, London:\nVictor Gollancz; second edition, 1946.",
                "Berkeley, George, 1732 [1950], <em>Alciphron or the Minute\nPhilosopher</em>, in A.A. Luce and T.E. Jessop (eds.), <em>The Works\nof George Berkeley</em>, volume 3, London: T. Nelson, 1950.",
                "Bishop, John, 2007, <em>Believing by Faith: An Essay in the\nEpistemology and Ethics of Religious Belief</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199205547.001.0001",
                "Blackburn, Simon, 1998, “Wittgenstein, Wright, Rorty &amp;\nMinimalism”, <em>Mind</em>, 107(425): 157–81.\ndoi:10.1093/mind/107.425.157",
                "Bowler, Peter, 2001, <em>Reconciling Science and Religion</em>, Chicago: The University of Chicago Press.",
                "Braithwaite, R.B., 1955, <em>An Empiricist’s View of the\nNature of Religious Belief</em>, Cambridge: Cambridge University\nPress.",
                "Brock, Stuart, 2020, “Religious Fictionalism and\nPascal’s Wager”, in Bradley Armour-Garb and Frederick\nKroon (eds.), <em>Fictionalism in Philosophy</em>, Oxford: Oxford University\nPress, pp. 207–34. doi:10.1093/oso/9780190689605.003.0011",
                "Brown, Jessica and Herman Cappelen, (eds.), 2011, <em>Assertion:\nNew Philosophical Essays</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199573004.001.0001",
                "Buchak, Lara, 2012, “Can it be Rational to Have\nFaith?” in Jake Chandler and Victoria S. Harrison (eds.),\n<em>Probability in the Philosophy of Religion</em>, Oxford: Oxford\nUniversity Press, pp. 225–246.\ndoi:10.1093/acprof:oso/9780199604760.003.0012",
                "Burley, Mikel, 2012, <em>Contemplating Religious Forms of Life:\nWittgenstein and D.Z. Phillips</em>, Bloomsbury Academic.",
                "Callahan, Laura Frances and Timothy O’Connor (eds.), 2014,\n<em>Religious Faith and Intellectual Virtue</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199672158.001.0001",
                "Carston, Robyn, 2002, <em>Thoughts and Utterances: The Pragmatics\nof Explicit Communication</em>, Oxford: Blackwell Publishing.\ndoi:10.1002/9780470754603",
                "Charlesworth, M.J., 1974, <em>The Problem of Religious\nLanguage</em>, Englewood Cliffs, NJ: Prentice-Hall.",
                "Cupitt, Don, 1980, <em>Taking Leave of God</em>, London: SCM\nPress.",
                "Derrida, Jacques, 1989, “How to Avoid Speaking:\nDenials”, in S. Budick and W. Iser (eds.), <em>Languages of the\nUnsayable</em>, New York: Columbia University Press,\npp. 3–70.",
                "–––, 1992, “Post-Scriptum: Aporias, Ways\nand Voices”, in H. Coward and T. Foshay (eds.), <em>Derrida and\nNegative Theology</em>, Albany, NY: State University of New York\nPress, pp. 283–323.",
                "Dewey, John, 1938, <em>Logic. The Theory of Inquiry</em>, New\nYork: Henry Holt and Company.",
                "Dionysius, [c. 600], <em>The Mystical Theology</em>, in Paul\nRorem (trans.), <em>Pseudo-Dionysius: The Complete Works</em>, New\nYork: Paulist Press, 1987, pp. 133–41.",
                "Donovan, Peter, 1976, <em>Religious Language</em>, New York:\nHawthorn Books.",
                "Divers, J. and David Liggins, 2005, “Fictionalism”,\n<em>Encyclopaedia of Philosophy</em>, second edition, New York:\nMacMillan Reference.",
                "Dummett, Michael, 1991, <em>The Logical Basis of Metaphysics</em>,\nLondon: Duckworth.",
                "–––, 2004, <em>Truth and the Past</em>, New\nYork: Columbia University Press.",
                "Evans, C.S., 1989, “Is Kierkegaard an Irrationalist? Reason,\nParadox, and Faith”, <em>Religious Studies</em>, 25(3):\n347–62. doi:10.1017/S0034412500019892",
                "Ferré, Frederick, 1962, <em>Language, Logic and God</em>,\nLondon: Eyre &amp; Spottiswoode.",
                "Field, Hartry, 1980, <em>Science without Numbers: a Defence of\nNominalism</em>, Oxford: Blackwell.",
                "Flew, Anthony and Alasdair MacIntyre, (eds.), 1955, <em>New Essays\nin Philosophical Theology</em>, London: SCM Press.",
                "Gäb, Sebastian, 2020, “Languages of Ineffability: The\nRediscovery of Apophaticism in Contemporary Analytic Philosophy of\nReligion”, in Sebastian Hüsch, Isabelle Koch and Philipp\nThomas (eds.), <em>Negative Knowledge</em>, Tübingen: Narr\nFrancks, pp. 191–206.",
                "Gellman, Jerome I., 1997, <em>Experience of God and the\nRationality of Theistic Belief</em>, Ithaca, NY: Cornell University\nPress.",
                "Graham, George, 2017, “Behaviorism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2017 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2017/entries/behaviorism/\" target=\"other\">https://plato.stanford.edu/archives/spr2017/entries/behaviorism/</a>&gt;.",
                "Gregory of Nyssa, [4<sup>th</sup> century], <em>Contra\nEunomium II</em>, in L. Karfíková, S. Douglass and J.\nZachhuber (eds.), <em>Gregory of Nyssa: Contra Eunomium II</em>,\nLeiden: Brill, 2007.",
                "Hepburn, Ronald W., 1958, <em>Christianity and Paradox: Critical\nStudies in Twentieth-Century Theology</em>, London: Watts.",
                "Hewitt, Simon, 2005, <em>Negative Theology and Philosophical\nAnalysis</em>, Cham: Palgrave Macmillan.",
                "Hick, John (ed.), 1977a, <em>The Myth of God Incarnate</em>,\nLondon: SCM Press.",
                "–––, 1977b, “Eschatological\nVerificationism Reconsidered”, <em>Religious Studies</em>,\n13(2): 189–202.",
                "–––, 1993, <em>The Metaphor of God\nIncarnate</em>, London: SCM Press.",
                "Howard-Snyder, Daniel, 2013, “Propositional Faith: What It\nIs and What It Is Not”, <em>American Philosophical\nQuarterly</em>, 50(4): 357–72.",
                "–––, 2016, “Does Faith Entail\nBelief?” <em>Faith and Philosophy</em>, 33(2): 142–62.\ndoi:10.5840/faithphil201633059",
                "Huxley, Julian, 1927, <em>Religion Without Revelation</em>,\nLondon: E. Benn.",
                "–––, 1931, <em>What Dare I think?: The Challenge\nof Modern Science to Human Action and Belief</em>, London: Chatto\nand Windus.",
                "Johnston, Mark, 2011, <em>Saving God: Religion After\nIdolatry</em>, Princeton, NJ: Princeton University Press.",
                "Jüngel, Eberhard, 1974, “Metaphorische Wahrheit”,\nin P. Ricoeur and E. Jüngel (eds.), <em>Metapher: Zur Hermeneutik\nReligiöser Sprache</em>, Munich: Chr. Kaiser Verlag, pp.\n71–122.",
                "Kalderon, Mark Eli (ed.), 2005, <em>Fictionalism in\nMetaphysics</em>, Oxford: Clarendon Press.",
                "Kant, Immanuel, 1781/1787, <em>Critique of Pure\nReason</em>, Paul Guyer and Allen Wood (eds.), Cambridge: Cambridge\nUniversity Press, 1998.",
                "Kaufman, Gordon D., 1981, <em>The Theological Imagination:\nConstructing the Concept of God</em>, Philadelphia: Westminster\nPress.",
                "–––, 2007, “Mystery, God and\nConstructivism”, in Moore and Scott 2007: 11–30.",
                "Kenney, Anthony, 2005, <em>The Unknown God: Agnostic Essays</em>,\nLondon: Continuum.",
                "Kierkegaard, Søren, 1844, <em>Philosophical Fragments,\nJohannes Climacus</em>, Howard V. Hong and Edna H. Hong (eds. and\ntrans.), Princeton: Princeton University Press, 1985.",
                "Kripke, Saul A., 1980, <em>Naming and Necessity</em>, Cambridge,\nMA: Harvard University Press.",
                "Kvanvig, Jonathan L., 2013, “Affective Theism and People of\nFaith”, <em>Midwest Studies in Philosophy</em>, XXXVII:\n109–28. doi:10.1111/misp.12003",
                "Lactantius, [4<sup>th</sup> century], <em>The Works of\nLactantius, Vol II</em>, A. Roberts and J. Donaldson (eds.),\n(Ante-Nicene Christian Library, vol. XXII), Edinburgh: T &amp; T\nClark, 1871.",
                "Le Poidevin, Robin, 2016, “Playing the God Game: The Perils\nof Religious Fictionalism”, in Andrei Buckareff and Yujin\nNagasawa (Eds.), <em>Alternative Concepts of God: Essays on the\nMetaphysics of the Divine</em>, Oxford: Oxford University Press, pp.\n178–191. doi:10.1093/acprof:oso/9780198722250.003.0011",
                "–––, 2019, <em>Religious Fictionalism</em>,\nCambridge: Cambridge University Press.",
                "Lipton, Peter, 2007, “Science and Religion: The Immersion\nSolution”, in Moore and Scott 2007: 31–46.",
                "Mackie, J.L., 1982, <em>The Miracle of Theism</em>, Oxford: Oxford\nUniversity Press.",
                "Macquarrie, John, 1967, <em>God-talk: An Examination of the\nLanguage and Logic of Theology</em>, London: SCM Press.",
                "Maimonides, Moses, [c. 1190], <em>The Guide\nof the Perplexed, volume one</em>, Sholome Pines (trans.), Chicago:\nThe University of Chicago Press, 1963.",
                "Malcolm, Finlay, and Michael Scott, 2017, “Faith,\nBelief and Fictionalism” <em>Pacific Philosophical\nQuarterly</em>, 98: 257–74. doi:\n10.1111/papq.12169",
                "Malcolm, Finlay, 2018, “Can Fictionalists Have\nFaith?” <em>Religious Studies</em>, 54(2): 215–32. doi:10.1017/S0034412517000063",
                "Malcolm, Norman, 1997, <em>Wittgenstein: A Religious Point of\nView?</em>, London: Routledge.",
                "Marion, Jean-Luc, 1994, “Metaphysics and Phenomenology: A\nRelief for Theology”, Thomas A. Carlson (trans.), <em>Critical\nInquiry</em>, 20(4): 572–91.",
                "–––, 1982 [1985], <em>God without Being</em>\n(<em>Dieu sans l’être</em>), Thomas A. Carlson (trans.),\nChicago: Chicago University Press, 1995.",
                "Markosian, Ned, 2016, “Time”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2016 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2016/entries/time/\" target=\"other\">https://plato.stanford.edu/archives/fall2016/entries/time/</a>&gt;.",
                "Martin, Martin, 1990, <em>Atheism: A Philosophical\nJustification</em>, Philadelphia, PA: Temple University Press.",
                "Mason, Richard, 2007, <em>Spinoza: Logic, Knowledge and Religion</em>, Aldershot: Ashgate.",
                "Maximus the Confessor, [7<sup>th</sup> century], <em>Chapters\non Knowledge</em>, in George C. Berthold (ed.), <em>Maximus Confessor:\nSelected Writings</em>, New Jersey: Paulist Press, 1985, pp. 127–80.",
                "McFague, Sally, 1983, <em>Metaphorical Theology: Models of God in\nReligious Language</em>, London: SCM Press.",
                "Macdonald, Graham, 2010, “Alfred Jules Ayer”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2010 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2010/entries/ayer/\" target=\"other\">https://plato.stanford.edu/archives/win2010/entries/ayer/</a>&gt;.",
                "MacDonald, Scott, 1993, “Christian Faith”, in Eleanore\nStump (ed.), <em>Reasoned Faith: Essays in Honour of Norman\nKretzmann</em>. Vermont: Echo Point Books, pp. 42–69.",
                "McKaughan, Daniel J., 2013, “Authentic Faith and\nAcknowledged Risk: Dissolving the Problem of Faith and Reason”,\n<em>Religious Studies</em>, 49(1): 101–124.\ndoi:10.1017/S0034412512000200",
                "Meland, Bernard, 1976, <em>Fallible Forms and Symbols: Discourses\non Method in a Theology of Culture</em>, Philadelphia: Fortress\nPress.",
                "Moore, Andrew and Michael Scott (eds.), 2007, <em>Realism and\nReligion</em>, Aldershot: Ashgate.",
                "Mulhall, Stephen, 2015, <em>The Great Riddle: Wittgenstein and\nNonsense, Theology and Philosophy</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198755326.001.0001",
                "Nielsen, Kai, 2000, “Wittgenstein and Wittgensteinians on\nReligion”, in Robert L. Arrington and Mark Addis (eds.),\n<em>Wittgenstein and Philosophy of Religion</em>, London: Routledge,\npp. 137–66.",
                "Palamas, Gregory, [14<sup>th</sup> century], <em>The\nTriads</em>, John Meyendorff (ed.), Nicholas Gendle (trans.), New\nJersey: Paulist Press, 1983.",
                "Pedersen, Nikolaj J.L.L. and Cory D. Wright, (eds.), 2013,\n<em>Truth and Pluralism: Current Debates</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780195387469.001.0001",
                "–––, 2016, “Pluralist Theories of\nTruth”, <em>The Stanford Encyclopedia of Philosophy</em> (Spring\n2016 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2016/entries/truth-pluralist/\" target=\"other\">https://plato.stanford.edu/archives/spr2016/entries/truth-pluralist/</a>&gt;.",
                "Phillips, D.Z., 1976, <em>Religion Without Explanation</em>,\nOxford: Blackwell.",
                "–––, 1995, “Philosophers’\nClothes”, in Charles M. Lewis (ed.), <em>Relativism and\nReligion</em>, London: Macmillan, pp. 135–53.",
                "Plantinga, Alvin, 2000, <em>Warranted Christian Belief</em>, New\nYork: Oxford University Press. doi:10.1093/0195131932.001.0001",
                "Pojman, Louis P., 1986, “Faith Without Belief”,\n<em>Faith and Philosophy</em>, 3(2): 157–76.\ndoi:10.5840/faithphil19863213",
                "–––, 2001, <em>Philosophy of Religion</em>, New\nYork, NY: McGraw-Hill.",
                "Priest, Graham, 2002, <em>Beyond the Limits of Thought</em>,\nOxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199254057.001.0001",
                "Putnam, Hilary, 1981, <em>Reason, Truth and History</em>,\nCambridge: Cambridge University Press.",
                "–––, 1992, <em>Renewing Philosophy</em>, Cambridge, MA:\nHarvard University Press.",
                "Ramsey, Ian T., 1957, <em>Religious Language: An Empirical Placing\nof Theological Phrases</em>, London: SCM Press.",
                "Récanati, François, 2004, <em>Literal Meaning</em>,\nCambridge: Cambridge University Press.",
                "Rey, Georges, 2006, “Does Anyone Really Believe in\nGod?” in Daniel Kolak and Raymond Martin (eds.), <em>The\nExperience of Philosophy</em>, sixth edition, New York: Oxford\nUniversity Press, pp. 336–53.",
                "Rhees, Rush, 1970, <em>Discussions of Wittgenstein</em>, London:\nRoutledge and Kegan Paul.",
                "Sarot, Marcel, 1992, <em>God, Passibility and Corporeality</em>,\n(Studies in philosophical theology 6), Kampen, The Netherlands: Kok\nPharos.",
                "Schellenberg, John L., 2005, <em>Prolegomena to a Philosophy of\nReligion</em>, Ithaca, NY: Cornell University Press.",
                "–––, 2014, “How to Make Faith a\nVirtue”, in Callahan and O’Connor 2014: 74–92.\ndoi:10.1093/acprof:oso/9780199672158.003.0004",
                "Schroeder, Mark, 2010, <em>Noncognitivism in Ethics</em>, London:\nRoutledge.",
                "Scott, Michael, 2013, <em>Religious Language</em>, London:\nPalgrave Macmillan. doi:10.1057/9781137033208",
                "–––, 2015, “Realism and\nAnti-Realism”, in Graham Oppy (ed.) <em>The Routledge Handbook\nof Contemporary Philosophy of Religion</em>, London: Routledge, pp.\n205–18.",
                "–––, 2020, “Faith, Fictionalism and\nBullshit”, <em>Thought</em>, 9(2):\n94–104. doi.org/10.1002/tht3.448",
                "Scott, Michael and Gabriel Citron, 2016, “What is\nApophaticism? Ways of Talking About An Ineffable God”,\n<em>European Journal for Philosophy of Religion</em>, 8(4):\n23–49. doi:10.24204/ejpr.v8i4.1716",
                "Scott, Michael and Finlay Malcolm, 2018, “Religious\nFictionalism”, <em>Philosophy Compass</em>, 13(3):\n1–11. doi:10.1111/phc3.12474",
                "Scott, Michael and Andrew Moore, 1997, “Can Theological\nRealism be Refuted?” <em>Religious Studies</em>, 33(4):\n401–18. doi:10.1017/S0034412597004058",
                "Scott, Michael and Graham Stevens, 2007, “Is God an\nAntirealist?”, <em>American Philosophical Quarterly</em>, 44(4):\n383–93.",
                "Searle, John R., 1993, “Metaphor”, in Andrew Ortony\n(ed.), <em>Metaphor and Thought</em>, second edition, Cambridge:\nCambridge University Press, pp. 83–111.",
                "Smith, James K.A., 2002, <em>Speech and Theology: Language and the\nLogic of Incarnation</em>, London: Routledge.",
                "Soskice, Janet Martin, 1985, <em>Metaphor and Religious\nLanguage</em>, Oxford: Clarendon Press.",
                "–––, 1999, “Religious Language”, in\nPhilip L. Quinn and Charles Taliaferro (eds.), <em>A Companion to\nPhilosophy of Religion</em>, Oxford: Blackwell, 2nd edition,\npp. 348–56.",
                "Sperber, Dan and Deirdre Wilson, 1986, <em>Relevance:\nCommunication and Cognition</em>, Oxford: Blackwell.",
                "Spinoza, Baruch, 1677 [2002], <em>Theological-Political\nTreatise</em>, in S. Shirley (trans.) and M. L. Morgan\n(ed.), <em>Spinoza: Complete Works</em> Indianapolis: Hackett,\n2002, pp. 383–583.",
                "Stoljar, Daniel and Nic Damnjanovic, 2014, “The Deflationary\nTheory of Truth”, <em>The Stanford Encyclopedia of Philosophy\n</em>(Fall 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2014/entries/truth-deflationary/\" target=\"other\">https://plato.stanford.edu/archives/fall2014/entries/truth-deflationary/</a>&gt;.",
                "Sullivan, Meghan, 2012, “Semantics for Blasphemy”, in\nJonathan L. Kvanvig (ed.), <em>Oxford Studies in Philosophy of\nReligion</em> (Volume 4), Oxford: Oxford University Press,\npp. 159–72.  doi:10.1093/acprof:oso/9780199656417.003.0009",
                "Swinburne, Richard, 1991, <em>Revelation: from Metaphor to\nAnalogy</em>, Oxford: Oxford University Press.",
                "–––, 1993, <em>The Coherence of Theism</em>,\nOxford: Oxford University Press. doi:10.1093/0198240708.001.0001",
                "–––, 1994, <em>The Christian God</em>, Oxford:\nClarendon Press. doi:10.1093/0198235127.001.0001",
                "–––, 2005, <em>Faith and Reason</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199283927.001.0001",
                "Tappolet, Christine, 1997, “Mixed Inferences: A Problem for\nPluralism about Truth Predicates”, <em>Analysis</em>, 57(3):\n209–10.",
                "Tennant, Neil, 1995, “On Negation, Truth and Warranted\nAssertibility”, <em>Analysis</em>, 55(2): 98–104.\ndoi:10.1093/analys/55.2.98",
                "Tilghman, Benjamin R., 1991, <em>Wittgenstein, Ethics, and\nAesthetics: The View from Eternity</em>, Albany, NY: State University\nof New York Press",
                "Tilley, Terence W., 1978, <em>Talking of God: An Introduction to\nPhilosophical Analysis of Religious Language</em>, New York: Paulist\nPress.",
                "Tillich, Paul, 1951, <em>Systematic Theology</em> (Volume I),\nLondon: SCM Pess.",
                "Turner, Denys, 1995, <em>The Darkness of God: Negativity in\nChristian Mysticism</em>, Cambridge: Cambridge University Press.",
                "van Inwagen, Peter, 2006, <em>The Problem of Evil: The Gifford\nLectures delivered in the University of St Andrews in 2003</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199245604.001.0001",
                "van Roojen, Mark, 2016, “Moral Cognitivism vs.\nNon-Cognitivism”, <em>The Stanford Encyclopedia of Philosophy\n</em>(Winter 2016 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/moral-cognitivism/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/moral-cognitivism/</a>&gt;.",
                "White, Roger M., 2010, <em>Talking about God: The Concept of\nAnalogy and the Problem of Religious Language</em>, (Transcending\nboundaries in philosophy and theology), Aldershot: Ashgate.",
                "Wieman, Henry, 1932, <em>Is there a God?</em>, Chicago: Willett,\nClark.",
                "Williams, Rowan, 2014, <em>The Edge of Words: God and the Habits\nof Language</em>, London: Bloomsbury Continuum.",
                "Williamson, Timothy, 1994, “A Critical Study of Truth and\nObjectivity”, <em>International Journal of Philosophical\nStudies</em>, 2(1): 130–44. doi:10.1080/09672559408570786",
                "Winch, Peter, 1987, <em>Trying to Make Sense</em>, Oxford:\nBlackwell.",
                "Wittgenstein, Ludwig, 1953, <em>Philosophical Investigations</em>\n(<em>Philosophische Untersuchungen</em>), G.E.M. Anscombe and R. Rhees\n(eds.), Oxford: Blackwell.",
                "–––, 1966, <em>Lectures and Conversations on\nAesthetics, Psychology and Religious Belief</em>, Cyril Barrett (ed.),\nOxford: Blackwell.",
                "–––, [PO], <em>Philosophical Occasions</em>,\nJ. Klagge and A. Nordmann (eds.), Indianapolis: Hackett, 1993.",
                "–––, 1970 [1994], <em>Culture and Value</em>,\nrevised edition, G.H. von Wright (ed.), Peter Winch (trans.), Oxford:\nBlackwell.",
                "Wright, Crispin, 1992, <em>Truth and Objectivity</em>, Cambridge,\nMA: Harvard University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Alston, William P., 1989, <em>Divine Nature and Human\nLanguage</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 1991, <em>Perceiving God: The Epistemology\nof Religious Experience</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>–––, 1996, “Belief, Acceptance, and\nReligious Faith”, in Jeff Jordan and Daniel Howard-Snyder\n(eds.), <em>Faith, Freedom, and Rationality</em>, Lanham, MD: Rowman\n&amp; Littlefield, pp. 3–27.</li>\n<li>–––, 2005, “Religious Language” in\nWilliam Wainwright (ed.), <em>The Oxford Handbook of Philosophy of\nReligion</em>, Oxford: Oxford University Press, pp. 220–44.\ndoi:10.1093/0195138090.003.0010</li>\n<li>–––, 2007. “Audi on Nondoxastic\nFaith”, in Mark Timmons, John Greco, and Alfred Mele (eds.),\n<em>Rationality and the Good: Critical Essays on the Ethics and\nEpistemology of Robert Audi</em>, Oxford: Oxford University Press,\npp. 123–38.</li>\n<li>Anonymous, [14<sup>th</sup> century], <em>The Cloud of\nUnknowing</em>, in A. Spearing (trans.), <em>The Cloud of\nUnknowing</em>, London: Penguin, 2001.</li>\n<li>Audi, Robert, 2011, <em>Rationality and Religious Commitment</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199609574.001.0001</li>\n<li>Augustine, [4<sup>th</sup> century], <em>The City of\nGod</em>, volume 1, M. Dods (trans.), Edinburgh: T &amp; T Clark, 1913.</li>\n<li>Austin, J.L., 1955 [1975], <em>How to Do Things with Words</em>,\nsecond edition, J.O. Urmson and M. Sbisa (eds.), Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780198245537.001.0001</li>\n<li>Ayer, A.J., 1936, <em>Language, Truth and Logic</em>, London:\nVictor Gollancz; second edition, 1946.</li>\n<li>Berkeley, George, 1732 [1950], <em>Alciphron or the Minute\nPhilosopher</em>, in A.A. Luce and T.E. Jessop (eds.), <em>The Works\nof George Berkeley</em>, volume 3, London: T. Nelson, 1950.</li>\n<li>Bishop, John, 2007, <em>Believing by Faith: An Essay in the\nEpistemology and Ethics of Religious Belief</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199205547.001.0001</li>\n<li>Blackburn, Simon, 1998, “Wittgenstein, Wright, Rorty &amp;\nMinimalism”, <em>Mind</em>, 107(425): 157–81.\ndoi:10.1093/mind/107.425.157</li>\n<li>Bowler, Peter, 2001, <em>Reconciling Science and Religion</em>, Chicago: The University of Chicago Press.</li>\n<li>Braithwaite, R.B., 1955, <em>An Empiricist’s View of the\nNature of Religious Belief</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Brock, Stuart, 2020, “Religious Fictionalism and\nPascal’s Wager”, in Bradley Armour-Garb and Frederick\nKroon (eds.), <em>Fictionalism in Philosophy</em>, Oxford: Oxford University\nPress, pp. 207–34. doi:10.1093/oso/9780190689605.003.0011</li>\n<li>Brown, Jessica and Herman Cappelen, (eds.), 2011, <em>Assertion:\nNew Philosophical Essays</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199573004.001.0001</li>\n<li>Buchak, Lara, 2012, “Can it be Rational to Have\nFaith?” in Jake Chandler and Victoria S. Harrison (eds.),\n<em>Probability in the Philosophy of Religion</em>, Oxford: Oxford\nUniversity Press, pp. 225–246.\ndoi:10.1093/acprof:oso/9780199604760.003.0012</li>\n<li>Burley, Mikel, 2012, <em>Contemplating Religious Forms of Life:\nWittgenstein and D.Z. Phillips</em>, Bloomsbury Academic.</li>\n<li>Callahan, Laura Frances and Timothy O’Connor (eds.), 2014,\n<em>Religious Faith and Intellectual Virtue</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780199672158.001.0001</li>\n<li>Carston, Robyn, 2002, <em>Thoughts and Utterances: The Pragmatics\nof Explicit Communication</em>, Oxford: Blackwell Publishing.\ndoi:10.1002/9780470754603</li>\n<li>Charlesworth, M.J., 1974, <em>The Problem of Religious\nLanguage</em>, Englewood Cliffs, NJ: Prentice-Hall.</li>\n<li>Cupitt, Don, 1980, <em>Taking Leave of God</em>, London: SCM\nPress.</li>\n<li>Derrida, Jacques, 1989, “How to Avoid Speaking:\nDenials”, in S. Budick and W. Iser (eds.), <em>Languages of the\nUnsayable</em>, New York: Columbia University Press,\npp. 3–70.</li>\n<li>–––, 1992, “Post-Scriptum: Aporias, Ways\nand Voices”, in H. Coward and T. Foshay (eds.), <em>Derrida and\nNegative Theology</em>, Albany, NY: State University of New York\nPress, pp. 283–323.</li>\n<li>Dewey, John, 1938, <em>Logic. The Theory of Inquiry</em>, New\nYork: Henry Holt and Company.</li>\n<li>Dionysius, [c. 600], <em>The Mystical Theology</em>, in Paul\nRorem (trans.), <em>Pseudo-Dionysius: The Complete Works</em>, New\nYork: Paulist Press, 1987, pp. 133–41.</li>\n<li>Donovan, Peter, 1976, <em>Religious Language</em>, New York:\nHawthorn Books.</li>\n<li>Divers, J. and David Liggins, 2005, “Fictionalism”,\n<em>Encyclopaedia of Philosophy</em>, second edition, New York:\nMacMillan Reference.</li>\n<li>Dummett, Michael, 1991, <em>The Logical Basis of Metaphysics</em>,\nLondon: Duckworth.</li>\n<li>–––, 2004, <em>Truth and the Past</em>, New\nYork: Columbia University Press.</li>\n<li>Evans, C.S., 1989, “Is Kierkegaard an Irrationalist? Reason,\nParadox, and Faith”, <em>Religious Studies</em>, 25(3):\n347–62. doi:10.1017/S0034412500019892</li>\n<li>Ferré, Frederick, 1962, <em>Language, Logic and God</em>,\nLondon: Eyre &amp; Spottiswoode.</li>\n<li>Field, Hartry, 1980, <em>Science without Numbers: a Defence of\nNominalism</em>, Oxford: Blackwell.</li>\n<li>Flew, Anthony and Alasdair MacIntyre, (eds.), 1955, <em>New Essays\nin Philosophical Theology</em>, London: SCM Press.</li>\n<li>Gäb, Sebastian, 2020, “Languages of Ineffability: The\nRediscovery of Apophaticism in Contemporary Analytic Philosophy of\nReligion”, in Sebastian Hüsch, Isabelle Koch and Philipp\nThomas (eds.), <em>Negative Knowledge</em>, Tübingen: Narr\nFrancks, pp. 191–206.</li>\n<li>Gellman, Jerome I., 1997, <em>Experience of God and the\nRationality of Theistic Belief</em>, Ithaca, NY: Cornell University\nPress.</li>\n<li>Graham, George, 2017, “Behaviorism”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Spring 2017 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2017/entries/behaviorism/\" target=\"other\">https://plato.stanford.edu/archives/spr2017/entries/behaviorism/</a>&gt;.</li>\n<li>Gregory of Nyssa, [4<sup>th</sup> century], <em>Contra\nEunomium II</em>, in L. Karfíková, S. Douglass and J.\nZachhuber (eds.), <em>Gregory of Nyssa: Contra Eunomium II</em>,\nLeiden: Brill, 2007.</li>\n<li>Hepburn, Ronald W., 1958, <em>Christianity and Paradox: Critical\nStudies in Twentieth-Century Theology</em>, London: Watts.</li>\n<li>Hewitt, Simon, 2005, <em>Negative Theology and Philosophical\nAnalysis</em>, Cham: Palgrave Macmillan.</li>\n<li>Hick, John (ed.), 1977a, <em>The Myth of God Incarnate</em>,\nLondon: SCM Press.</li>\n<li>–––, 1977b, “Eschatological\nVerificationism Reconsidered”, <em>Religious Studies</em>,\n13(2): 189–202.</li>\n<li>–––, 1993, <em>The Metaphor of God\nIncarnate</em>, London: SCM Press.</li>\n<li>Howard-Snyder, Daniel, 2013, “Propositional Faith: What It\nIs and What It Is Not”, <em>American Philosophical\nQuarterly</em>, 50(4): 357–72.</li>\n<li>–––, 2016, “Does Faith Entail\nBelief?” <em>Faith and Philosophy</em>, 33(2): 142–62.\ndoi:10.5840/faithphil201633059</li>\n<li>Huxley, Julian, 1927, <em>Religion Without Revelation</em>,\nLondon: E. Benn.</li>\n<li>–––, 1931, <em>What Dare I think?: The Challenge\nof Modern Science to Human Action and Belief</em>, London: Chatto\nand Windus.</li>\n<li>Johnston, Mark, 2011, <em>Saving God: Religion After\nIdolatry</em>, Princeton, NJ: Princeton University Press.</li>\n<li>Jüngel, Eberhard, 1974, “Metaphorische Wahrheit”,\nin P. Ricoeur and E. Jüngel (eds.), <em>Metapher: Zur Hermeneutik\nReligiöser Sprache</em>, Munich: Chr. Kaiser Verlag, pp.\n71–122.</li>\n<li>Kalderon, Mark Eli (ed.), 2005, <em>Fictionalism in\nMetaphysics</em>, Oxford: Clarendon Press.</li>\n<li>Kant, Immanuel, 1781/1787, <em>Critique of Pure\nReason</em>, Paul Guyer and Allen Wood (eds.), Cambridge: Cambridge\nUniversity Press, 1998.</li>\n<li>Kaufman, Gordon D., 1981, <em>The Theological Imagination:\nConstructing the Concept of God</em>, Philadelphia: Westminster\nPress.</li>\n<li>–––, 2007, “Mystery, God and\nConstructivism”, in Moore and Scott 2007: 11–30.</li>\n<li>Kenney, Anthony, 2005, <em>The Unknown God: Agnostic Essays</em>,\nLondon: Continuum.</li>\n<li>Kierkegaard, Søren, 1844, <em>Philosophical Fragments,\nJohannes Climacus</em>, Howard V. Hong and Edna H. Hong (eds. and\ntrans.), Princeton: Princeton University Press, 1985.</li>\n<li>Kripke, Saul A., 1980, <em>Naming and Necessity</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Kvanvig, Jonathan L., 2013, “Affective Theism and People of\nFaith”, <em>Midwest Studies in Philosophy</em>, XXXVII:\n109–28. doi:10.1111/misp.12003</li>\n<li>Lactantius, [4<sup>th</sup> century], <em>The Works of\nLactantius, Vol II</em>, A. Roberts and J. Donaldson (eds.),\n(Ante-Nicene Christian Library, vol. XXII), Edinburgh: T &amp; T\nClark, 1871.</li>\n<li>Le Poidevin, Robin, 2016, “Playing the God Game: The Perils\nof Religious Fictionalism”, in Andrei Buckareff and Yujin\nNagasawa (Eds.), <em>Alternative Concepts of God: Essays on the\nMetaphysics of the Divine</em>, Oxford: Oxford University Press, pp.\n178–191. doi:10.1093/acprof:oso/9780198722250.003.0011</li>\n<li>–––, 2019, <em>Religious Fictionalism</em>,\nCambridge: Cambridge University Press.</li>\n<li>Lipton, Peter, 2007, “Science and Religion: The Immersion\nSolution”, in Moore and Scott 2007: 31–46.</li>\n<li>Mackie, J.L., 1982, <em>The Miracle of Theism</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Macquarrie, John, 1967, <em>God-talk: An Examination of the\nLanguage and Logic of Theology</em>, London: SCM Press.</li>\n<li>Maimonides, Moses, [c. 1190], <em>The Guide\nof the Perplexed, volume one</em>, Sholome Pines (trans.), Chicago:\nThe University of Chicago Press, 1963.</li>\n<li>Malcolm, Finlay, and Michael Scott, 2017, “Faith,\nBelief and Fictionalism” <em>Pacific Philosophical\nQuarterly</em>, 98: 257–74. doi:\n10.1111/papq.12169</li>\n<li>Malcolm, Finlay, 2018, “Can Fictionalists Have\nFaith?” <em>Religious Studies</em>, 54(2): 215–32. doi:10.1017/S0034412517000063</li>\n<li>Malcolm, Norman, 1997, <em>Wittgenstein: A Religious Point of\nView?</em>, London: Routledge.</li>\n<li>Marion, Jean-Luc, 1994, “Metaphysics and Phenomenology: A\nRelief for Theology”, Thomas A. Carlson (trans.), <em>Critical\nInquiry</em>, 20(4): 572–91.</li>\n<li>–––, 1982 [1985], <em>God without Being</em>\n(<em>Dieu sans l’être</em>), Thomas A. Carlson (trans.),\nChicago: Chicago University Press, 1995.</li>\n<li>Markosian, Ned, 2016, “Time”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2016 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2016/entries/time/\" target=\"other\">https://plato.stanford.edu/archives/fall2016/entries/time/</a>&gt;.</li>\n<li>Martin, Martin, 1990, <em>Atheism: A Philosophical\nJustification</em>, Philadelphia, PA: Temple University Press.</li>\n<li>Mason, Richard, 2007, <em>Spinoza: Logic, Knowledge and Religion</em>, Aldershot: Ashgate.</li>\n<li>Maximus the Confessor, [7<sup>th</sup> century], <em>Chapters\non Knowledge</em>, in George C. Berthold (ed.), <em>Maximus Confessor:\nSelected Writings</em>, New Jersey: Paulist Press, 1985, pp. 127–80.</li>\n<li>McFague, Sally, 1983, <em>Metaphorical Theology: Models of God in\nReligious Language</em>, London: SCM Press.</li>\n<li>Macdonald, Graham, 2010, “Alfred Jules Ayer”, <em>The\nStanford Encyclopedia of Philosophy</em> (Winter 2010 Edition), Edward\nN. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2010/entries/ayer/\" target=\"other\">https://plato.stanford.edu/archives/win2010/entries/ayer/</a>&gt;.</li>\n<li>MacDonald, Scott, 1993, “Christian Faith”, in Eleanore\nStump (ed.), <em>Reasoned Faith: Essays in Honour of Norman\nKretzmann</em>. Vermont: Echo Point Books, pp. 42–69.</li>\n<li>McKaughan, Daniel J., 2013, “Authentic Faith and\nAcknowledged Risk: Dissolving the Problem of Faith and Reason”,\n<em>Religious Studies</em>, 49(1): 101–124.\ndoi:10.1017/S0034412512000200</li>\n<li>Meland, Bernard, 1976, <em>Fallible Forms and Symbols: Discourses\non Method in a Theology of Culture</em>, Philadelphia: Fortress\nPress.</li>\n<li>Moore, Andrew and Michael Scott (eds.), 2007, <em>Realism and\nReligion</em>, Aldershot: Ashgate.</li>\n<li>Mulhall, Stephen, 2015, <em>The Great Riddle: Wittgenstein and\nNonsense, Theology and Philosophy</em>, Oxford: Oxford University\nPress. doi:10.1093/acprof:oso/9780198755326.001.0001</li>\n<li>Nielsen, Kai, 2000, “Wittgenstein and Wittgensteinians on\nReligion”, in Robert L. Arrington and Mark Addis (eds.),\n<em>Wittgenstein and Philosophy of Religion</em>, London: Routledge,\npp. 137–66.</li>\n<li>Palamas, Gregory, [14<sup>th</sup> century], <em>The\nTriads</em>, John Meyendorff (ed.), Nicholas Gendle (trans.), New\nJersey: Paulist Press, 1983.</li>\n<li>Pedersen, Nikolaj J.L.L. and Cory D. Wright, (eds.), 2013,\n<em>Truth and Pluralism: Current Debates</em>, New York: Oxford\nUniversity Press. doi:10.1093/acprof:oso/9780195387469.001.0001</li>\n<li>–––, 2016, “Pluralist Theories of\nTruth”, <em>The Stanford Encyclopedia of Philosophy</em> (Spring\n2016 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/spr2016/entries/truth-pluralist/\" target=\"other\">https://plato.stanford.edu/archives/spr2016/entries/truth-pluralist/</a>&gt;.</li>\n<li>Phillips, D.Z., 1976, <em>Religion Without Explanation</em>,\nOxford: Blackwell.</li>\n<li>–––, 1995, “Philosophers’\nClothes”, in Charles M. Lewis (ed.), <em>Relativism and\nReligion</em>, London: Macmillan, pp. 135–53.</li>\n<li>Plantinga, Alvin, 2000, <em>Warranted Christian Belief</em>, New\nYork: Oxford University Press. doi:10.1093/0195131932.001.0001</li>\n<li>Pojman, Louis P., 1986, “Faith Without Belief”,\n<em>Faith and Philosophy</em>, 3(2): 157–76.\ndoi:10.5840/faithphil19863213</li>\n<li>–––, 2001, <em>Philosophy of Religion</em>, New\nYork, NY: McGraw-Hill.</li>\n<li>Priest, Graham, 2002, <em>Beyond the Limits of Thought</em>,\nOxford: Clarendon Press.\ndoi:10.1093/acprof:oso/9780199254057.001.0001</li>\n<li>Putnam, Hilary, 1981, <em>Reason, Truth and History</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1992, <em>Renewing Philosophy</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Ramsey, Ian T., 1957, <em>Religious Language: An Empirical Placing\nof Theological Phrases</em>, London: SCM Press.</li>\n<li>Récanati, François, 2004, <em>Literal Meaning</em>,\nCambridge: Cambridge University Press.</li>\n<li>Rey, Georges, 2006, “Does Anyone Really Believe in\nGod?” in Daniel Kolak and Raymond Martin (eds.), <em>The\nExperience of Philosophy</em>, sixth edition, New York: Oxford\nUniversity Press, pp. 336–53.</li>\n<li>Rhees, Rush, 1970, <em>Discussions of Wittgenstein</em>, London:\nRoutledge and Kegan Paul.</li>\n<li>Sarot, Marcel, 1992, <em>God, Passibility and Corporeality</em>,\n(Studies in philosophical theology 6), Kampen, The Netherlands: Kok\nPharos.</li>\n<li>Schellenberg, John L., 2005, <em>Prolegomena to a Philosophy of\nReligion</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 2014, “How to Make Faith a\nVirtue”, in Callahan and O’Connor 2014: 74–92.\ndoi:10.1093/acprof:oso/9780199672158.003.0004</li>\n<li>Schroeder, Mark, 2010, <em>Noncognitivism in Ethics</em>, London:\nRoutledge.</li>\n<li>Scott, Michael, 2013, <em>Religious Language</em>, London:\nPalgrave Macmillan. doi:10.1057/9781137033208</li>\n<li>–––, 2015, “Realism and\nAnti-Realism”, in Graham Oppy (ed.) <em>The Routledge Handbook\nof Contemporary Philosophy of Religion</em>, London: Routledge, pp.\n205–18.</li>\n<li>–––, 2020, “Faith, Fictionalism and\nBullshit”, <em>Thought</em>, 9(2):\n94–104. doi.org/10.1002/tht3.448</li>\n<li>Scott, Michael and Gabriel Citron, 2016, “What is\nApophaticism? Ways of Talking About An Ineffable God”,\n<em>European Journal for Philosophy of Religion</em>, 8(4):\n23–49. doi:10.24204/ejpr.v8i4.1716</li>\n<li>Scott, Michael and Finlay Malcolm, 2018, “Religious\nFictionalism”, <em>Philosophy Compass</em>, 13(3):\n1–11. doi:10.1111/phc3.12474</li>\n<li>Scott, Michael and Andrew Moore, 1997, “Can Theological\nRealism be Refuted?” <em>Religious Studies</em>, 33(4):\n401–18. doi:10.1017/S0034412597004058</li>\n<li>Scott, Michael and Graham Stevens, 2007, “Is God an\nAntirealist?”, <em>American Philosophical Quarterly</em>, 44(4):\n383–93.</li>\n<li>Searle, John R., 1993, “Metaphor”, in Andrew Ortony\n(ed.), <em>Metaphor and Thought</em>, second edition, Cambridge:\nCambridge University Press, pp. 83–111.</li>\n<li>Smith, James K.A., 2002, <em>Speech and Theology: Language and the\nLogic of Incarnation</em>, London: Routledge.</li>\n<li>Soskice, Janet Martin, 1985, <em>Metaphor and Religious\nLanguage</em>, Oxford: Clarendon Press.</li>\n<li>–––, 1999, “Religious Language”, in\nPhilip L. Quinn and Charles Taliaferro (eds.), <em>A Companion to\nPhilosophy of Religion</em>, Oxford: Blackwell, 2nd edition,\npp. 348–56.</li>\n<li>Sperber, Dan and Deirdre Wilson, 1986, <em>Relevance:\nCommunication and Cognition</em>, Oxford: Blackwell.</li>\n<li>Spinoza, Baruch, 1677 [2002], <em>Theological-Political\nTreatise</em>, in S. Shirley (trans.) and M. L. Morgan\n(ed.), <em>Spinoza: Complete Works</em> Indianapolis: Hackett,\n2002, pp. 383–583.</li>\n<li>Stoljar, Daniel and Nic Damnjanovic, 2014, “The Deflationary\nTheory of Truth”, <em>The Stanford Encyclopedia of Philosophy\n</em>(Fall 2014 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2014/entries/truth-deflationary/\" target=\"other\">https://plato.stanford.edu/archives/fall2014/entries/truth-deflationary/</a>&gt;.</li>\n<li>Sullivan, Meghan, 2012, “Semantics for Blasphemy”, in\nJonathan L. Kvanvig (ed.), <em>Oxford Studies in Philosophy of\nReligion</em> (Volume 4), Oxford: Oxford University Press,\npp. 159–72.  doi:10.1093/acprof:oso/9780199656417.003.0009</li>\n<li>Swinburne, Richard, 1991, <em>Revelation: from Metaphor to\nAnalogy</em>, Oxford: Oxford University Press.</li>\n<li>–––, 1993, <em>The Coherence of Theism</em>,\nOxford: Oxford University Press. doi:10.1093/0198240708.001.0001</li>\n<li>–––, 1994, <em>The Christian God</em>, Oxford:\nClarendon Press. doi:10.1093/0198235127.001.0001</li>\n<li>–––, 2005, <em>Faith and Reason</em>,\n2<sup>nd</sup> edition, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199283927.001.0001</li>\n<li>Tappolet, Christine, 1997, “Mixed Inferences: A Problem for\nPluralism about Truth Predicates”, <em>Analysis</em>, 57(3):\n209–10.</li>\n<li>Tennant, Neil, 1995, “On Negation, Truth and Warranted\nAssertibility”, <em>Analysis</em>, 55(2): 98–104.\ndoi:10.1093/analys/55.2.98</li>\n<li>Tilghman, Benjamin R., 1991, <em>Wittgenstein, Ethics, and\nAesthetics: The View from Eternity</em>, Albany, NY: State University\nof New York Press</li>\n<li>Tilley, Terence W., 1978, <em>Talking of God: An Introduction to\nPhilosophical Analysis of Religious Language</em>, New York: Paulist\nPress.</li>\n<li>Tillich, Paul, 1951, <em>Systematic Theology</em> (Volume I),\nLondon: SCM Pess.</li>\n<li>Turner, Denys, 1995, <em>The Darkness of God: Negativity in\nChristian Mysticism</em>, Cambridge: Cambridge University Press.</li>\n<li>van Inwagen, Peter, 2006, <em>The Problem of Evil: The Gifford\nLectures delivered in the University of St Andrews in 2003</em>,\nOxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199245604.001.0001</li>\n<li>van Roojen, Mark, 2016, “Moral Cognitivism vs.\nNon-Cognitivism”, <em>The Stanford Encyclopedia of Philosophy\n</em>(Winter 2016 Edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/win2016/entries/moral-cognitivism/\" target=\"other\">https://plato.stanford.edu/archives/win2016/entries/moral-cognitivism/</a>&gt;.</li>\n<li>White, Roger M., 2010, <em>Talking about God: The Concept of\nAnalogy and the Problem of Religious Language</em>, (Transcending\nboundaries in philosophy and theology), Aldershot: Ashgate.</li>\n<li>Wieman, Henry, 1932, <em>Is there a God?</em>, Chicago: Willett,\nClark.</li>\n<li>Williams, Rowan, 2014, <em>The Edge of Words: God and the Habits\nof Language</em>, London: Bloomsbury Continuum.</li>\n<li>Williamson, Timothy, 1994, “A Critical Study of Truth and\nObjectivity”, <em>International Journal of Philosophical\nStudies</em>, 2(1): 130–44. doi:10.1080/09672559408570786</li>\n<li>Winch, Peter, 1987, <em>Trying to Make Sense</em>, Oxford:\nBlackwell.</li>\n<li>Wittgenstein, Ludwig, 1953, <em>Philosophical Investigations</em>\n(<em>Philosophische Untersuchungen</em>), G.E.M. Anscombe and R. Rhees\n(eds.), Oxford: Blackwell.</li>\n<li>–––, 1966, <em>Lectures and Conversations on\nAesthetics, Psychology and Religious Belief</em>, Cyril Barrett (ed.),\nOxford: Blackwell.</li>\n<li>–––, [PO], <em>Philosophical Occasions</em>,\nJ. Klagge and A. Nordmann (eds.), Indianapolis: Hackett, 1993.</li>\n<li>–––, 1970 [1994], <em>Culture and Value</em>,\nrevised edition, G.H. von Wright (ed.), Peter Winch (trans.), Oxford:\nBlackwell.</li>\n<li>Wright, Crispin, 1992, <em>Truth and Objectivity</em>, Cambridge,\nMA: Harvard University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Ayer, Alfred Jules",
            "cognitivism vs. non-cognitivism, moral",
            "Pseudo-Dionysius the Areopagite",
            "Wittgenstein, Ludwig"
        ],
        "entry_link": [
            {
                "../ayer/": "Ayer, Alfred Jules"
            },
            {
                "../moral-cognitivism/": "cognitivism vs. non-cognitivism, moral"
            },
            {
                "../pseudo-dionysius-areopagite/": "Pseudo-Dionysius the Areopagite"
            },
            {
                "../wittgenstein/": "Wittgenstein, Ludwig"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=religious-language\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/religious-language/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=religious-language&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/religious-language/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=religious-language": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/religious-language/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=religious-language&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/religious-language/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.iep.utm.edu/rel-lang/\" target=\"other\">Religious Language</a>,\n  maintained by Jennifer Hart Weed, University of New Brunswick."
        ],
        "listed_links": [
            {
                "http://www.iep.utm.edu/rel-lang/": "Religious Language"
            }
        ]
    }
}