{
    "url": "roger-bacon",
    "title": "Roger Bacon",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Jeremiah Hackett\n<HackettJ@mailbox.sc.edu>",
        "author_links": [
            {
                "mailto:HackettJ%40mailbox%2esc%2eedu": "HackettJ@mailbox.sc.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\nJeremiah Hackett\n&lt;<a href=\"mailto:HackettJ%40mailbox%2esc%2eedu\"><em>HackettJ<abbr title=\" at \">@</abbr>mailbox<abbr title=\" dot \">.</abbr>sc<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Apr 19, 2007",
        "substantive revision Wed Apr 15, 2020"
    ],
    "preamble": "\n\nRoger Bacon (1214/1220–1292), Master of Arts, contemporary of\nRobert Kilwardby, Peter of Spain, and Albert the Great at the\nUniversity of Paris in the 1240s, was one of the early Masters who\ntaught Aristotle’s works on natural philosophy and metaphysics.\nSometime after 1248–49, he became an independent scholar with an\ninterest in languages, mastering the known Greek and Arabic texts on\nthe science of optics. In 1256/57, either at Paris or Oxford, he\njoined the Franciscan Order. By 1262 he believed that his university\nreputation for advanced learning had suffered. And so, he sought the\nPatronage of Cardinal Guy le Gros de Foulque, Papal Ambassador to\nEngland (who later served as Pope Clement IV, 1265–68). On the\ninstruction of the Pope on June 22, 1266, Bacon quickly wrote\n“an introductory work,” the Opus maius, and the\nrelated works, Opus minus and Opus tertium. He set out\nhis own new model for a reform of the system of philosophical,\nscientific, and theological studies, seeking to incorporate language\nstudies and science studies, then unavailable, at the University of\nParis.\n\nIn this project, he was partly successful. He wrote a new and\nprovocative text on semiotics, and influenced the addition of\nperspectiva to mathematical studies (the Quadrivium) as\na required university subject. He succeeded in setting out a model of\nan experimental science on the basis of his study of optics. The\nlatter was used in his extension of experimental science to include\nnew medicines and the general health care of the body. He did this in\na new context: the application of linguistic and scientific knowledge\nfor a better understanding of Theology and in the service of the\nRes publica Christiana. Bonaventure and John Pecham were among\nhis first readers. It is clear that with the possible exception of the\nuses or astrology and alchemy, Bacon shared in Bonaventure’s\nproject seeking a “reduction” of the sciences to theology.\nBacon also found a sympathetic reader and interpreter in the great\nsecular scholar of the Sorbonne, Peter of Limoges (d. 1306). He uses\nBacon’s optics for scientific and moral investigation. Bacon\nthrough the work of Peter of Limoges may have influenced Raymond Lull.\nSometime in the late 1270s or early 1280s, Bacon returned to Oxford,\nwhere he completed his edition with introduction and notes of the\nSecretum secretorum, a Latin translation of an Arabic text on\nthe education of the Prince, the Sirr-al-‘asrar. He believed it\nto be a work by Aristotle written for Alexander the Great. This work\nof advice to the Prince points to Bacon’s close connections to\nthe Papal Court through Pope Clement IV, the French Court through\nAlphonse of Poitiers, and the English Court. His contacts with the\nPapal Curia were mediated by William Bonecor, Ambassador for King\nHenry III. Bacon died at Oxford c. 1292.\n",
    "toc": [
        {
            "#ModResRogBac": "1. Modern Research on Roger Bacon"
        },
        {
            "#LifWor": "2. Life and Works"
        },
        {
            "#BacEarWorGraLog": "3. Bacon’s early work on Grammar and Logic"
        },
        {
            "#SumGra": "3.1 Summa grammatica"
        },
        {
            "#SumDeSopEtDisSSD": "3.2 Summa de sophismatibus et distinctionibus (SSD)"
        },
        {
            "#SumDiaSD": "3.3 Sumulae dialectices (SD)"
        },
        {
            "#BacAriCom": "4. Bacon as an Aristotelian Commentator"
        },
        {
            "#RogBacRicRufPhyAri": "4.1 Roger Bacon and Richard Rufus: In physicam Aristotelis"
        },
        {
            "#BacGroKnoSciInt": "4.2 Bacon and Grosseteste: Knowledge, Science, and Intuition"
        },
        {
            "#BacMat": "4.3 Bacon on Matter"
        },
        {
            "#BacUniInd": "4.4 Bacon on Universals and Individuation"
        },
        {
            "#BacReaWayLatMedNom": "4.5 Bacon’s Realism: On the Way to Late Medieval Nominalism?"
        },
        {
            "#BacBodSouMinEarWor": "4.6 Bacon on Body, Soul and Mind: Early Works"
        },
        {
            "#BacBodSouMinLatWor": "4.7 Bacon on Body, Soul, and Mind: Later Works"
        },
        {
            "#BacLatLanStuSciSerBotMorThe": "5. Bacon’s Later Philosophy: Language Study and Science in the Service of both Moral Philosophy and Theology"
        },
        {
            "#Bac": "5.1 Background"
        },
        {
            "#OpuMaiOneTwo": "5.2 Opus maius/Parts One and Two"
        },
        {
            "#OpuMaiThrLanDeSigComStuPhi": "5.3 Opus maius/Part Three: On Language, the De signis and Compendium Studii philosophiae"
        },
        {
            "#OpuMaiFouFivSixMatNatDeMulSpePerSciExp": "5.4 Opus maius/Parts Four, Five, and Six: Mathematics and Philosophy of Nature (De multiplicatione specierum, Perspectiva, Scientia Experimentalis)"
        },
        {
            "#OpuMaiSevMorPhi": "5.5 Opus maius/Part Seven: Moralis philosophia"
        },
        {
            "#BacPolPhi": "5.6 Bacon’s political philosophy: the Secretum secretorum"
        },
        {
            "#Conclusion": "6. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#PriSou": "Primary Sources"
        },
        {
            "#SecSou": "Secondary Sources"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Modern Research on Roger Bacon\n\nThere are two modern approaches to Bacon. The first is the study of\nthe physical, metaphysical, and related works of Bacon. Discovered in\n1848 by Victor Cousin in Amiens MS 406, these works were edited by\nRobert Steele and Ferdinand Delorme [OHI, 1905–1940]. With the\nexception, however, of some new work on the teaching on the soul,\nBacon’s concept of matter, the doctrine of\nexperientia/experimentum, and the doctrines of universals and\nindividuation, the doctrine of the heavens, and alchemy, the content\nof these works has remained largely unstudied until the present time.\nIndeed, one can argue that “critical” scholarly study of\nthese works has only just begun. In 2013, Silvia Donati made a\ncritical study of Amiens MS 406. She has presented solid arguments for\nexcluding three of the eight philosophical commentaries from the canon\nof Bacon’s works. They are the Questions on the Physics\nI-IV, Questions on Metaphysics XI, and Questions on\nMetaphysics I-IV. These three texts were commonly used in all\nprevious scholarship. And so, great care must now be taken in reading\nthe traditional scholarship on early Bacon where these works have\noften been referenced.\n\nThe second and better known interpretation of Roger Bacon as a\nscientist is found in nineteenth and twentieth century writers on the\nhistory of science and has a solid basis in Bacon’s own work,\ne.g., the edition of the Opus tertium by J.S. Brewer [OQHI].\nBacon’s Perspectiva (1267) [PRSP, 1996] presents a model\nfor an experimental science that ushered in a new addition to the\ntraditional Quadrivium (arithmetic, geometry, astronomy, music)\nin the new universities of the Latin West, namely, the study of\noptics. The university teaching text, “The Common Teaching on\nPerspectiva,” was written by Bacon’s Parisian\ncolleague,John Pecham. We have critical editions now for the major\nscientific works of Bacon. SISMEL at Florence, Italy now houses a\nRoger Bacon research center. It has plans for future critical\neditions. A new international society for the study of Roger Bacon,\nThe Roger Bacon Research Society has recently been\nestablished. \n\nIn 1859, William Whewell set the tone for this modern account of\n“Roger Bacon and the Sciences” (Whewell 1858, p. 245). He\nviewed Bacon as an advocate of experimentation ahead of his time. In\nthe late nineteenth century, Robert Adamson and many others\ninterpreted Bacon as a philosopher of science in the modern sense of\nthe term. This understanding of Roger Bacon did not begin in the\nnineteenth century. Already in the late Renaissance, Francis Bacon had\ncharacterized Roger Bacon as an exceptional figure among the\n schoolmen.[1]\n Francis held that Roger Bacon had set aside the scholastic\ndisputations of his age and engaged in the mechanical understanding of\nthe secrets of nature.\n\nIn the 1900s, Thorndike [LT1;LT2] and Duhem [LSDM, III, 442] asserted\nthat the role of observation in Bacon’s science was minimal and\nadded nothing to his idea of a science. This modern read-back of\nmodern experimental method ignored the importance of optics in\nBacon’s model for a science (Lindberg, 1997). In recent studies\n(2006, 2012), Jeremiah Hackett has made explicit the manner in which\nRoger Bacon served as a foil for Martin Heidegger’s discussions\non the originality of modern science as a sign of Modernity. For\nHeidegger, Bacon did not achieve the post-Galilean and Post-Cartesian\ndiscovery of a mathematical projection of nature and the consequent\nmodern experiment. He claimed that it was false to argue, as many had\ndone between 1880 and 1940, that Roger Bacon was the source for the\npost-Cartesian concept of science. One can argue for the uniqueness of\nmodern scientific method without setting aside the longue duree that\nled to Kepler. One might note in passing that for Heidegger, Kepler is\nthe true forefather of modern science. In the post-World War II years,\nA.C. Crombie (1953) argued that the “qualitative” aspects\nof modern science originated at Oxford in the early thirteenth\ncentury, specifically in the work of Grosseteste and Roger Bacon. This\ninterpretation received a critical response from Alexander\nKoyré (1957) and others. Despite their significantly different\nphilosophical committments, Heidegger and Koyré both shared\nHusserl’s views on the distinctiveness of the modern\nmathematical projection of nature as a condition for controlled\nexperimentation. This was seen as a distinctive new phenomenon, a\nmarker of modernity and something quite distinct from ancient and\nmedieval science. It was argued that Crombie read back some aspects of\nmodern scientific method into the works of Grosseteste and Bacon.\nHowever, a recent study by Mattia Mantovani has signaled clear\nconnections between Bacon and Descartes’ approach to vision and\nperception (Mantovani 2020). \n\nThomas S. Kuhn (1976), however, maintained that Crombie did identify a\nreal methodological connection between medieval and early modern\nscience. More recently, M. Schramm (1998) has argued that Bacon plays\na significant role in framing the context for the beginnings of\nmedieval, Renaissance and early modern notions of laws of nature. This\ndiscusion has now been taken up for research by Giora Hon and Yael\nRaizman-Kedar. The studies and editorial work of David C. Lindberg on\nBacon’s natural philosophy, for example, the De\nmultiplicatione specierum [DMS] and Perspectiva [PRSP]\n(1983–1996) have emphasized the need to read Roger Bacon as a\nmedieval scientist and not as an early modern or modern scientist.\nThus, it is as a medieval philosopher, scientist, and theologian that\nhe must be properly understood. Despite the polarity generated by two\nseparate modern traditions of interpretation, it should be noted that\nthere is some continuity between the interests of Bacon the\nAristotelian commentator and Bacon the writer on science.\n2. Life and Works\n\nBacon remarks in the Opus tertium [OQHI], written c. 1267 that\nhe had devoted forty years to study since he first learned the\nalphabetum and that no other scholar had worked as much in the\nArts and Sciences as he. Some scholars use this text to argue that\nBacon was writing about his elementary education and therefore that\nwas born c. 1220 [Crowley (1950), Easton (1952), Lindberg (DMS,\n1983)]; others hold that he was writing about his early university\neducation – Alphabetum philosophiae is a term Bacon uses\nin the chapter from which the following cited text is taken –\nand thus that he was born c. 1214 [Little (RBE, 1914), Maloney (CSTM,\n1988), Hackett (2016), Molland (2004)]. The text reads:\n\n\nI have labored much in sciences and languages, and I have up to now\ndevoted forty years [to them] after I first learned the\nalphabetum; and I was always studious. Apart from two of these\nforty years I was always [engaged] in study [or at a place of study],\nand I had many expenses just as others commonly have... And it is\nknown that no one worked in so many sciences and languages as I did,\nnor so much as I did. Indeed, when I was living in the other state of\nlife [as an Arts Master], people marveled that I survived the\nabundance of my work. And still, I was just as involved in studies\nafterwards, as I had been before. But I did not work all that much,\nsince in the pursuit of Wisdom this was not required. ([OQHI], 65)\n\n\nSome time after 1248, he set aside the common scholastic ways of\nteaching in order to devote time to languages and experimental\nconcerns. Thus, we can see the period from c. 1240–48 as the\ntime during which he lectured at Paris on Aristotle, on Grammar/Logic,\nand especially on the mathematical subjects of the Quadrivium.\nAnd so, depending on the chosen year of birth, the chronology would be\nas follows: (1) Bacon was born c. 1214, educated at Oxford c.\n1228–36, Master of Arts at Paris c. 1237–47/8, Private\nScholar 1248–56/7, active again at Oxford c. 1248–51, back\nin Paris 1251, Franciscan Friar at Paris c. 1256–57 to 1279,\nreturning to Oxford c. 1280, died c. 1292. Or: (2) Bacon was born c.\n1220, educated at Oxford c. 1234–42; Master of Arts at Paris c.\n1242–47/8, active again at Oxford c. 1248–51, back in\nParis 1251, Franciscan Friar at Paris 1256/7 to 1279, returning to\nOxford c. 1280, died c. 1292. Further precision on the chronology must\nawait the critical edition of all the works of Roger Bacon and careful\nscientific study of these works in relation to other thirteenth\ncentury scholars.\n\nThe Aristotelian Quaestiones are to be found in a single\nmanuscript, Amiens MS Bibl. Mun. 406. The materials found in this\nmanuscript include two sets of questions on the Physics and two\nsets of questions on the Metaphysics of Aristotle, the\nquestions on the Liber de causis, and the Pseudo-Aristotelian\nDe vegetabilibus. As noted above, three of the questions on the\nPhysics and Metaphysics can now be excluded from Bacon’s canon.\nA new version of Bacon’s second set of questions on the\nPhysics inter-textually excerpted by another thirteenth-century\nauthor has recently been identified by Silvia Donati in Philadelphia\nMS Free Library, Lewis Europe, ff. 77ra-85rb (Donati 1997). This is an\nimportant discovery that has enabled scholars for the first time to\ncarry out a critical-textual study of Bacon’s works on\nAristotle’s Physics in the context of the development of\nEnglish natural philosophy in the period 1240–1300.\n\nThe early logical works consist of the Summa grammatica,\nSumma de sophismatibus et distinctionibus and the Summulae\ndialectices [=Summulae super totam logicam]. These works\nshow that Bacon is indebted to the teaching of logic at Oxford and\nParis in the 1230s and 1240s. They have received much critical study\nin recent years. They reveal Bacon as a mature philosopher of logic\nwho is representative of terminist and pre-modist grammar and logic.\nBacon’s writings on grammar and logic have a connection with the\nOxford ascribed Logica cum sit nostra and with the works of\nWilliam of Sherwood. The logical works are clearly influenced by the\nteaching in Paris of Robert Kilwardby. They give evidence of Bacon as\na philosopher who connects the Logica modernorum with new\nlogical and philosophical problems based on the natural philosophy and\nmetaphysics of Aristotle as commented on by Avicenna and Averroes.\n\nAlain de Libera has argued that the Summulae dialectices is\ntypical of mature works in the philosophy of logic c. 1250 and a\nlittle later. If this is the case, can we exclude the possibility that\nBacon continued teaching at some University up to ca. 1256/57? He does\nsay that he had a reputation as a scholar and teacher up to that time.\nScholars have long held that Roger Bacon was a pioneer in the\nintroduction of the study of Aristotle as interpreted by Averroes and\nAvicenna to the University of Paris c. 1240. But to this we must add\nthe name of Solomon Ibn Gebirol (Avicebron). During the past ten years\nor so, research has shown that two Erfurt manuscripts (Amplon. Q. 290\nand Q. 312) ascribed to Walter Burley (1274/5–1344) by the\nAmplonius de Berka in the fifteenth century, actually belong to the\nfirst half of the thirteenth century. Rega Wood, the editor of the\nPhysics from the Erfurt MS Amplon. Q 290, has attributed these\nquestions on the Physics and most of the other works in these\ntwo Erfurt manuscripts to Richard Rufus of Cornwall, a contemporary\nand opponent of Roger Bacon [Wood 1997; Wood, IPA, 2003].\n\nRecently, it has also been demonstrated that as Master of Arts at\nParis during the period of the First Averroism (c. 1240–48),\nBacon had confronted and reviewed some of the major issues concerning\nthe Latin Averroism which eventually produced a major crisis at Paris\nin the period 1266–77 (Hackett 2005). And, as we will see below,\nBacon, in his works from the 1260s, will revisit these topics.\n\nBacon joined the Franciscan Order about 1256/7; whether he did so at\nOxford or Paris is not known. At any rate, he was probably in Paris in\nthe late 1250s and was definitely there in the early 1260s. He had\nbeen attracted to the Order by the philosophical, theological, and\nscientific example of Grosseteste, Adam Marsh, and other English\nFranciscans. He had personally known Adam Marsh at Oxford c.\n1248–51. Because of their over-emphasis of a purported\ncondemnation of Bacon c. 1278, scholars had tended to ignore or tone\ndown Bacon’s very real commitment to his Franciscan way of life.\nThe past ten years have seen new work by Amanda Power (2013) and\nTimothy J. Johnson (2009, 2010, 2013) emphasize the compatibility of\nBacon’s concerns c. 1266 with the mission of the Franciscan\nOrder as presented by Bonaventure and the Franciscan School at Paris.\n\n\nIn answer to the Papal Mandate received in July 1266, Bacon produced\nsome very significant works. The Opus maius, Opus minus,\nand the related foundational work in natural philosophy, De\nmultiplicatione specierum, the work on burning mirrors, De\nspeculis comburentibus, together with an optical lens, were sent\nto the Pope c. 1267–68. They were seen as a preamble to a\nproposed major work on Philosophy. It remains a question as to whether\nthe Opus tertium was sent. Together with these works in the\n1260s, Bacon produced the Preface to the Works for the Pope,\nCommunia naturalium, Communia mathematica, Epistola\nde secretis operibus naturae et de nullitate magiae.\n\nAmanda Power (2013) has provided a masterful interpretation of the new\ncontext of Bacon’s post-1266 works for Pope Clement IV. She\nplaces Bacon in a Franciscan context within the wider mission of\nChristendom in its relations with other cultures and religions. The\nCompendium studii philosophiae can be dated to about 1271. This\nlatter is a largely polemical work on the state of studies at Paris\nand an apology for his scholarly situation. It does, however, contain\nan important section on his theory of language and translation. He\ncompleted the edition of the important work on medieval politics and\nstatecraft, the Secretum secretorum, at Oxford some time after\n1280. It is clear that by 1266 and later, this important work played a\nmajor role in Bacon’s understanding of the political uses of the\nexperimental sciences. He also produced an important work on the\ncalendar, the Computus. The Compendium studii theologiae\nis usually dated c. 1292, but its content does not differ from the\nconcerns of the work in 1266. \n\nOne must bear in mind that Roger Bacon in the 1260s is writing as an\nindividual author for a patron, Cardinal Guy le Gros de Foulque (Pope\nClement IV, 1265–68). A onetime Master of Arts, he was no longer\na teaching Master at the University of Paris. This gave Bacon the\nfreedom to address both philosophical (Aristotle) and theological\n(Augustine) issues in a manner denied to teachers in the Faculty of\nArts, who were limited for the most part to disputations on the texts\nof Aristotle. He writes self-consciously as a representative of the\ntext-based practices of Robert Grosseteste and in opposition to the\nnew “sentence-methods” of the schools of theology. His\npolemical writings ca. 1267–68 are centered on the struggles in\nthe Arts and Theology at Paris. The Pope instructed Bacon in 1266 to\nignore the rules of his Order and to send him his remedies about\nmatters of some importance. It would appear from the context of\nBacon’s works for the Pope that the remedies had to do with\neducational matters at Paris, which at this time was the foremost\nuniversity of the Christian commonwealth. The remedies sought must\nalso have concerned geo-political matters as well as the exigencies of\nChristian missions. \n\nThe reception of the life and works of Roger Bacon is complex. Each\ngeneration has, as it were, found its own Roger Bacon. Another study\nby Amanda Power (2006) has provided a thoughtful account of the\ncomplex reception of Roger Bacon in England and of the extent to which\nthe image of the Doctor Mirabilis is often colored by the\nchanging controversies of the present down through history.\n3. Bacon’s early work on Grammar and Logic\n\nBacon has a complex notion of grammar. It ranges from the elementary\nteaching of Latin through “rational grammar” (linguistics)\nto a knowledge of the sacred “Wisdom” languages. It is\nalso connected with a theory of signs and with the vis\nverborum, including the magical power of spoken language. One\nnotices continuity between Bacon’s early works on grammar and\nlogic and his later works after 1260 on the theory of signs (De\nsignis).\n3.1 Summa grammatica\n\nIn this work, Bacon draws directly from the commentary on Priscian\n(Priscianus minor) by Robert Kilwardby. This is representative\nof early speculative grammar as it developed in Paris during the first\nhalf of the thirteenth century. Bacon’s approach to grammar and\nlogic has a connection with the logic of that of William of\nSherwood..\n\nPart one of the Summa Grammatica sets out the rules governing\nboth common constructions with subject and verb and rules governing\nfigurative constructions. The latter include specific accounts of the\nfive figures of construction: antithesis, synthesis, prolepsis,\nsyllepsis, and zeugma. This is borrowed from Kilwardby\n(Institutiones grammaticae, xvii, 153). In part two, Bacon\nanalyzes the more difficult non-figurative constructions such as\nimpersonals, gerundives, ablative absolutes, interjections. In a third\npart, he examines sophisms in terms of their subject-matter and ranges\nfrom a cursory treatment to more extended treatments typical of a\ndisputed question. In the last section, there is a cursory analysis of\nsome short sentences including adverbial constructions [lupus est\nin fabula] and some liturgical formulae [patris et filii et\nspiritus sancti, ita missa est]. The latter are problematic due to\ntheir elliptical character. An account of Bacon’s intellectual\nrelationship to Robert Kilwardby can be found in Irène Rosier\n(1994).\n\nAs noted above, a major feature of this treatment of speculative\ngrammar is the fact that the reasoning is closely linked to the\nPhysics of Aristotle (Rosier\n 1994).[2]\n This reasoned grammar is based on the belief that “art imitates\nnature to the extent that it can” (Physics II, 219 4a\n21). Borrowing from Aristotle and Averroes and influenced by Robert\nKilwardby, Bacon exploits the distinction between the permanent and\nthe successive as the ground of the grammatical distinction between\nthe noun/pronoun and the verb/adverb. He applies this to the\ndefinition of grammatical category.\n\nAs Irène Rosier-Catach has noted, “The construction of\nwords is conceived as a movement. The verb, the pivot of the sentence,\nsignifies action and movement and needs for that reason two terms, a\nterminus a quo or principium and a terminus ad\nquem or terminus (Summa Grammatica 66, 78). On one\nlevel, physical conceptualization is used to re-define certain\nnotions. Cases are properties allowing an expression to function as a\nterm of movement (Summa Grammatica 34); in this way, the\naccusative expresses the terminus ad quem. At a second level,\nBacon’s conceptualization allows him to state some very general\nrules for the combination of categories” (Rosier-Catach 1997,\n70).\n\nFor example, Bacon argues that both the participle and the infinitive\nby means of their verbal signification are not sufficiently stable to\nbe a terminus of motion. This is based on the premise that\n“nothing which is in motion can come to rest in something in\nmotion, no motion being able to complete itself in something in\nmotion.” And, using the principle that “the action is in\nthe patient as in a subject,” he tackles the issue of\ngrammatical agreement. Further, the central principle for the\norganization of terms is the notion of dependence\n(dependencia). Hence, the relation of natural dependence\nbetween the accident and the subject is reflected in the construction\nof the adjective with its substantive.\n\nGrammatical reasoning, then, finds itself wedged between physical and\nlogical reasoning. This can be seen in the analysis of the expression,\nest dies. Why one term and not two? What is the function of\ndies? In an analysis of motion there are two terms. But in\nreason, one can see that the one term has two functions that are\nnecessarily present in every assertion. And whereas Logic requires\nthat the subject be different from the predicate, Grammar as a\npositive science depends on the intellect and will. \n\nThe most significant aspect of Bacon’s grammatical analysis is\none that will be replicated in his later work on semiotics. This is\nhis intentionalist analysis. The reasons connected to\ngrammatical analysis cannot be discovered or applied mechanically:\nthey are dependent on the signifying intention of the speaker\n(intentio proferentis). This kind of analysis is found in\nRobert Kilwardby and in many similar texts on sophisms. As\nRosier-Catach puts it, “The correctness of a statement does not\ndepend solely on its conformity with the rules of grammar but\nequally on its adequateness with its signifying intention. Sometimes\nindeed, because the speaker wishes to signify some precise\nidea, he may legitimately distance himself from the normal\nrules” (Rosier-Catach 1997, 73). Still, this freedom is not\nabsolute; it must be justified linguistically. Even elliptical\nexpressions such as ita missa est have within them the\ncapacity to allow further application of formulas such as cantata,\ndicta, etc. Thus, to quote Rosier, “The rule-governed\nnature of language-functions is to be found not only in the common\nusage but also in those ‘authorized’ variations. It is\nprecisely this principle that Bacon will put to work at the semantic\nlevel when he conducts his analysis of Signs [c. 1267].\nBeyond the ordinary usage of the sign, derivable from its institution,\nthe speaker always has the liberty to use it in the\ntranslated way, the variation being in the majority of cases\nexplainable and for this reason comprehensible by the listener. In\nother words, language is for man an instrument, a means. This\nvoluntarist/instrumental conception is to be seen likewise in the\ncontext of Bacon’s treatment of the magical power of\nwords” (Rosier-Catach 1997, 73–74).\n\nThis imporant aspect of “the magical power of words” has\nagain been examined carefully in terms of language study as it relates\nto the uses of logic in theology by Rosier-Catach (2004). Graziella\nFederici Vescovini (2011) has now presented a magisterial study of the\nclose connection of philosophy and natural magic in the Middle Ages,\naccentuating the notion of “the magical power of words” in\nrelation to Bacon and other medieval philosophers. This magical power\nof words, derived from Alkindi, has a connection with Bacon’s\ntheory of communication in part five of the Moralis\nphilosophia.\n\nBacon’s Logic (1240s):\n\n\nSumma de sophismatibus et distinctionibus (SSD)\nSummula super totam logicam (= Sumulae\ndialectices) (SD)\n\n\n\nThe late Jan Pinborg has described the terminist logic found in Bacon\nand his contemporaries as “semantical analysis of a natural\nlanguage, viz. Latin, built on Aristotelian logic, especially the\nSophistici elenchi and the Peri hermeneias, and on\nthe development of grammar. This analysis stressed the truth value of\npropositions analyzed and its conditions, and therefore displayed what\ncan be called a contextual approach; that is, it was based on\nthe actual function and reference of the term in the proposition to be\nanalyzed. A given word could be used differently, or according to\ndifferent suppositions, and the rules for these different\nuses helped to avoid ambiguities. The doctrine of supposition was\nintended to solve both the relatively trivial ambiguities which arose\nfrom confusion of linguistic levels (man is white, man is a species,\nman is a noun) and ambiguities involved in quantification (or\ndistribution) theory. These problems were primarily solved in terms of\nreference, since different suppositiones picked out different\nranges of individuals.”(Jan Pinborg 1979)\n\nOne can see therefore why Bacon, through his concern with the central\nrole of applied logic in guarding against ambiguity, saw the analysis\nof equivocation as central to the analysis of language. Against the\ngrowing Modist tendency to understand parts of grammar as indicative\nof the objective constituents of things in the world, Bacon stresses\nthe importance of equivocation analysis. Since the imposition of\nnames, the constant change in language use, and especially the ongoing\nimplicit shift of meaning in language are all important for a theory\nof meaning, Bacon demands contextual language analysis. Here, one\nmight speak of Bacon’s “pragmatic” approach to\nlanguage theory.\n3.2 Summa de sophismatibus et distinctionibus (SSD)\n\nAlain De Libera has provided a very precise summary of Bacon’s\nplace in the history of logic and especially of the two early works\njust listed. He remarks:\n\n\nThe SSD belongs to a literary genre found in Paris during the\nfirst half of the thirteenth century, the Distinctiones\nsophismatum. It compares with the Tractatus de\ndistinctionibus communibus in sophismatibus accidentibus\nattributed to Matthew of Orleans, the Distinctiones\n‘notandum’, the Abstractiones of Hervaeus\nSophista, the tracts on Distinctiones sophismatum as well as\n‘anonymous’ treatises described by De Rijk and Braakhuis.\nBriefly, the distinctiones have the task of listing the rules\nto be used in the practice of sophisms and setting out the context,\nwhile the syncategoremata set out the logical conditions for\nthe proper use of syncategorematic words. (De Libera 1997,\n105–106)\n\n\nGenerally, the SSD deals with problems of universal quantification, as\nfor example the uses of the word omnis (’all’).\nBacon pays close attention to words that present philosophical\ndifficulties, such as ‘infinite’, ‘whole’, and\n‘negation’. The common logical topics are covered. Still,\nBacon shows some originality in his treatment of\n‘inclusion’ or ‘scope’ in quantification. He\nalso develops the outline of what will become his own contribution in\nthe 1260s, i.e., his analysis of a “production of speech”.\nBacon develops this analysis to deal with sentences such as\n‘Every animal is either rational or irrational’. Here, his\ncontemporaries invoked a theory of natural sense to account for the\nprovision of semantic information on the basis of the order of the\npresentation of the terms. But Bacon insists that one must take into\naccount (a) the signifying intention of the speaker, (b) the\nlinguistic expression, and (c) the sense that the listener provides.\nBacon presents two basic positions: an expression must have parts that\nenable the hearer to make an interpretation that will correspond with\nthe intention of the speaker. Thus, the actual expression alone is\nnecessary but not sufficient for an account of the meaning. A\nlinguistic analysis that involves speaker/hearer/expression is also\nrequired.\n\nThe expression of the proposition alone is accidental and thus\ncontains only a relative sense. Further, the linear order of the\nexpression does not provide the listener with enough information about\nthe logical form. Knowledge of the logical form requires reference to\nthe mental proposition. This implies that every mental proposition,\nfor both speaker and listener, is an interpretation. The\nmeaning of any statement is a function of the understanding. This\npresentation of the speech act prepared the ground for Bacon’s\nmature theory in his post-1260 works, the De signis (DS),\nCompendium studii philosophiae (CSP), and Compendium\nstudii theologiae (CST).\n3.3 Summulae dialectices (SD)\n\nDe Libera has placed this work at Oxford c. 1250, but notes the\npresence of Parisian teachings in the text. The title given in the\nSeville MS, Summulae super totam logicam, provides a better\nsense of the nature of the work. To summarize De Libera, this is the\nmature work of a practiced teacher, not the work of a beginner. It is\nahead of other works of the 1240s in the skillful manner in which it\nexamines Aristotle and other newly translated works in philosophy and\nscience. The work is important for two new semantic positions: (1) the\ndoctrine of univocal appellation and (2) the doctrine of “empty\nclasses” in predication. For Bacon, a word cannot be applied in\na univocal manner to both an entity and a non-entity. This position\nwill provide Bacon with a basis for his attack on Richard Rufus of\nCornwall in his works after 1260, and especially in the Compendium\nstudii theologiae (1292). This attack was not targeted at Rufus\nalone; it is written in opposition to the common teaching of the time\nat Paris, according to which a word has a natural meaning and once\nthat meaning is given, it remains a constant. For example, the term\n‘Caesar’ can cover both the once living Caesar and the now\ndead Caesar. Bacon rejects this on the grounds that for him, terms are\nimposed on “present things” and there is nothing in common\nbetween an entity and a non-entity or between the past, present, and\nfuture. Hence, Bacon is opposed to the notion of “habitual\nbeing”. Thus, terms have present appellation and their reference\nto the past and future must be accidental. For Bacon, name and\nsignification are imposed on the present object, and these are opened\nto past and present on the basis of verbal tense. One might call it\n“supposition through itself for present things”. Another\nimportant aspect of SD is the complex theory of determination found in\nthe composition and division of the propositional sense.\n\nThe theory of imposition is fundamental to Bacon’s approach\n(Rosier & de Libéra 1986; Rosier 1994, 123–156).\nThis allows for explicit and tacit changes of imposition of meaning in\ncommunication and points to the need for linguistic analysis and\ncareful study of context in order to be strict about univocal meaning.\nLikewise, an interest in overcoming equivocation and ambiguity figures\nthroughout Bacon’s logical works. Words can, indeed, be extended\n‘metaphorically’ to cover non-existing things. In this\nwork of Bacon, one finds a combination of influences from both the\nOxford terminist logic and the Parisian pre-modist grammar of the\n1240s.\n\nThe reader can easily see that this treatment of “all of\nlogic” corresponds to a large extent to what is found in many\n‘modern’ logic books prior to the treatment of predicate\nlogic. It would be useful to show the extent to which Bacon’s SD\nprovides a template for later works on the totality of logic, such as\nthe Summa Logica of William of Ockham and subsequent texts up\nto modern times.\n4. Bacon as an Aristotelian Commentator\n4.1 Roger Bacon and Richard Rufus: In physicam Aristotelis\n\nRichard Rufus and Roger Bacon were two of the earliest Teachers of\nAristotle’s natural philosophy and metaphysics at Paris, c.\n1235–50. The recent publication of Richard Rufus of\nCornwall’s In Physicam Aristotelis has made available\nwhat is certainly a very important text for an understanding of the\ninfluence of Aristotle’s Physics on the early tradition\nof English natural philosophy in the thirteenth century (IPA 2003).\nRichard Rouse has dated the text of these Physics questions\n“on the early side of the middle of the century” (Wood,\nIPA Introduction, 33). Silvia Donati and Cecilia Trifogli have mapped\nout the complex tradition of named and ‘anonymous’\ncommentaries on Aristotle’s Physics in 13th century\nEngland. (Del Punta, Donati & Trifogli 1996; Trifogli 1997, Donati\n1997; Trifogli 2000). As noted above, Rega Wood ascribes the text to\nRichard Rufus of Cornwall (died c. 1260). She claims that\n“Richard Rufus was the earliest Western teacher of the new\nAristotle whom we know.” He taught Aristotelian physics and\nmetaphysics as a Master of Arts at the University of Paris before\n1238. In the apparatus of the edition, Wood notes that these comments\non Aristotle’s Physics were later taken up by Roger Bacon\nin his Questiones on Aristotle’s Physics, and as a\nresult, she sees Roger Bacon as Richard Rufus’s successor as a\nParisian teacher of Aristotle’s natural philosophy. As evidence\nfor the influence of Rufus on Roger Bacon, Wood presents a discussion\nof three topics: (1) projectile motion, (2) the place of Heaven, and\n(3) the beginning of the world (IPA, 12–28).\n4.2 Bacon and Grosseteste: Knowledge, Science and Intuition\n\nBacon holds that scientific knowledge is twofold: first, there is the\n“imperfect and confused knowledge” by which the mind is\ninclined to the love of the good and of truth. This implicit knowledge\nis innate. Second, there is explicit rational knowledge. One part of\nthis has to do with the knowledge of the principles of science; the\nother is the knowledge of conclusions. This latter is complete\nknowledge though it is not exhaustive. Bacon’s account of sense,\nmemory, and experience is more extensive than that found in\nGrosseteste’s Commentary and reflects his own reading of\nAvicenna, the medical tradition, and works on optics. Bacon\ndistinguishes experientia from experimentum. Experience\n(experientia) is the distinct knowledge of singular things, and\nall animals have this distinct knowledge of singulars. But not all\nanimals have experimentum, that is, a science of principles\nbased on experience. As he puts it, “experience is the distinct\nreception of singulars under some aspect of universality, as is stated\nin the text [of Aristotle], but only the universal is grasped by the\nintellect.” Therefore, only humans and not other animals have\nexperience [experimentum] ([OHI, XI] 16). Many animals have an\nimage (imaginatio) of singular things and live by innate art\nand industry, naturally knowing how to adapt to changing weather\nconditions. Human art, however, is acquired and is a science of\nprinciples based on experience (experimentum principium).\n\nOne can express Bacon’s position as follows: experimentum\nis the universal source for our discovery of scientific principles.\nScientific knowledge, once established, proceeds by demonstration.\nExperientia designates the simple perception of singulars. Only\nin a very loose sense can it be used of scientific knowledge.\nSometimes, however, these two terms about experience are used\ninterchangeably. In this account, Bacon has not yet come to his later\nnotion of a scientia experimentalis, and the experimental\nverification (certificatio) of the conclusions of demonstrative\nknowledge (ca. 1267). He is dealing only with experience as the source\nof the principles of our knowledge of art and science.]\n\nIn other words, at this stage, Bacon is mainly concerned with\nAristotle’s definition of experience in the Metaphysics\nand Posterior Analytics, although one already notices that he\nrelates the Aristotelian subject matter to the discussion in\nAlhacen’s Perspectiva. Nevertheless, it is also important\nto note that these Aristotelian concerns with Experimentum\nare repeated in 1267 at the beginning of Opus majus, Part Six\non exprimental science, and thus, Aristotle’s\nMetaphysics, Posterior Analytics and Meteorology\ntogether with the Optics of Ibn al-Haytham will form the\nnecessary philosophical background for Bacon’s laterc. 1266\nnotions of the experimental sciences.\n4.3 Bacon on Matter\n\nIn the later (post 1260) Communia naturalium, Bacon gives six\nmeanings for the concept of matter. (1) Matter is the subject of\naction as when we say that wood is the matter for the action of the\ncarpenter. (2) In the proper sense of the term, matter is that which,\nwith form, constitutes the composite, as in the case of every created\nsubstance. (3) Matter is the subject of generation and corruption and\nhas the property of being an incomplete and imperfect thing in potency\nto being a complete thing. (4) Matter is the subject of alteration\nsince it receives contrary accidents. (5) Matter can be considered as\nan individual in relation to the universal, the latter being founded\nin its individual as in a material principle. (6) Matter is the name\nfor that which is gross, as when we say that earth has more matter\nthan fire (Sharp 1930, 127–151).\n\nForm has a certain priority to matter as the end of generation and as\nthe perfection of the material principle. It is the principle of\naction and of knowledge. In general, for Bacon, matter is not a mere\npotency. It is an incomplete something (substance) and so for him\nmatter and form are two incomplete substances that integrate to make\none individual substance. In this one has a notion of matter\nas in some sense a positive thing. It is not a nullity. One way to\nplace Bacon’s position on matter is to situate it between the\nmaterial monism of David of Dinant and the position of Aquinas that\nmatter is a pure potentiality. For Bacon, matter as a being of essence\n(esse essentiae) has being in itself. For Aquinas, form alone\ngives being. But for Bacon the being of essence and existence belong\ntogether. Matter, therefore, can be a principle of division. Unlike a\nmonist position, Bacon stresses the plurality of matters. The relation\nof universal and particular with respect to matter and form in Bacon\nis complex. One notes the influence of Avicenna. \n\nIn both early and later works, Bacon objects to the idea that matter\nis one in number in all things. The background to this issue arises in\nthe 1240s to 1270s of the Fons vitae of Avicebron (Solomon\nIbn Gebirol) and from Franciscan discussions at Paris on the nature of\nthe unity of matter. Bacon holds that matter “is not numerically\none, but in itself and from itself it is numerically distinct in\nnumerically different beings.” Still, he does not object to a\nlogical unity of matter. For example, matter as potentiality is the\noriginal source of the being of contingent things. This is the\nnon-being of the creature in contrast with the being of the Creator.\nMatter properly speaking is prime matter. This must be distinguished\nfrom both natural matter and from artificial matterThus, Bacon will\nspeak of the matter of both corporeal and spiritual beings, and hence\nof “spiritual matter,” a concept that Aquinas found to be\ncontradictory. The importance of this hylomorphism in the\nFranciscan school at Paris has been examined by Anna Rodolfi (2010,\n2014). And the complexity of natural matter with reference to\ngeneration and also to alchemical process has been set out with care\nby Michele Pereira (2014). Bacon’s doctrine of matter as a\nsource for the theory of matter in Peter John Olivi has been noted by\nthe editors of Pierre de Jean Olivi Sur le materie (2008).\nBacon’s extended account of matter in his early and later works\nis very significant for the late thirteenth and early fourteenth\ncentury discussions of the concept of matter.\n\n\nIn his later works, and specifically in his works on natural\nphilosophy, Bacon presents nature as an active agent. The form or the\nspecies is the first effect of any natural agent. The power of the\nspecies educes the emergence of the thing from the potency of matter.\nIt does not simply produce a form/species and impose it on the matter.\nMatter has an active potency, and this is actualized due to\nthe action of the natural external agent. See Michela Pereira,\n“Remarks on materia natualis”. \n4.4 Bacon on Universals and Individuation\n\nBacon has two distinct treatments of universals and individuation: his\nearly works (1240s) and later in the Communia naturalium\n(1260s-70s). \n\nIn the works from the 1240s, Bacon distinguishes the real\nuniversal from the mental universal. Hence, the\nuniversal as the ultimate basis of predication is not the species as\nmental intention. Universals in the primary sense as the basis of\nscientific objectivity are extra-mental. Bacon’s presentation of\nthis issue is complex. Certainly, he is not a complete Platonist in\nregard to universals. To the objection that since form is individuated\nthrough its matter and whatever exists in things must exist in matter\nas individuated, but the universal is not such a thing, he replies\nthat a universal is either in the mind or in things; if it is not in\nthe former, it has to be in the latter. A universal arises from common\nmatter and common form and so has no need of being immediately\nindividuated: “And because the common matter and common form\nexist along with the proper matter and form of individuals, the\nuniversal is present in this way in singulars” ([OHI, X]\n242–243 = TTUM, 36). Hence, one cannot split apart the common\nmatter from the particular matter or the common form from the\nparticular form of a particular individual.\n\nIn one question, Bacon rejects the view that universals are\nconstituted only by the mind. He holds that the universal in and of\nitself is prior to the knowledge process: “This follows because\na universal is nothing other than a nature in which singulars of the\nsame (nature) agree; but particulars agree in this manner in a common\nnature predicable of them, without any act of the mind” ([OHI,\nX], 242–243 = TTUM, 36). This sounds Platonic, but in fact for\nBacon there are no Platonic universals in a separate world; rather,\nreal universals do exist, but they are found only in and with\nindividual things. There is a mutual interpenetration of common form\nand matter and proper form and matter such that there is just one\nindividual, and so the common nature is realized in this or that\nindividual. Bacon’s answer to the possibility of a universal\nbeing present in a singular is stated as follows:\n\n\nOnly three kinds of being are imaginable: either [being] in and of\nitself, [being] in the mind, or [being] in things, but a universal is\nnot something that has being in and of itself and stands on its own,\nbecause then it would be a Platonic idea; neither [does it have being]\nin the mind, as we have seen… Again, a universal is a common\nnature in which particulars agree; but Socrates and Plato and [others]\nof this sort cannot agree in a common nature which is in them unless\nthe nature [be] in some way duplicated in them, because a universal is\nnothing other than a common nature extended into particulars and\nexisting in them as duplicated, in which all things truly exist. And\nthus, without them [the particulars] there can be no\nuniversals…. ([OHI, VII, 243–244 = TTUM, 37)\n\n\nFor Bacon, there are two kinds of particular, the determinate here and\nnow particular and the indeterminate particular.\n\nBacon treats the problem of individuation both in the early Parisian\nlectures and the later Communia naturalium. This has given\nrise to the issue of Bacon’s realism or his proto-nominalism.\nItis addressed in the next section.\n4.5 Bacon’s Realism: On the Way to Late Medieval Nominalism?\n\nIn the light of the foregoing, a key issue arises in his early works:\neven if Bacon disclaims being a Platonist with regard to universals,\nhe is clearly a strong external realist. This realism is continued in\nthe Communia naturalium [OHI, 2–4] but with certain\nimportant qualifications. This polemical account of the discussion of\nAristotle in the 1260s is understood by Bacon as an aid for the study\nof theology. And now, it is clear that for Bacon, in the intention and\nexecution of nature, the individual has definite ontological\npriority over genera and species. His account becomes an attack\non contemporary positions influenced by Albertus Magnus that would\nsubordinate the individual to the universal. Species and genera are\nthere for the sake of the production of the individual. He states,\n“In no other field are the authorities in such\ndisagreement.” Even Aristotle seems to contradict himself. Bacon\nfinds a correct answer in the Metaphysics of Avicenna:\n\n\nThere are two kinds of nature, universal and particular, Avicenna\nteaches in the sixth book of [his] Metaphysics.\n\n\nBacon adds,\n\n\nUniversal [nature] is the governing force of the universe [and is]\ndiffused among the substances of the heavens [and] throughout all the\nbodies in the world; it is [that] in which all bodies agree and\nthrough which all are maintained at a certain general level of\nperfection and well being. This universal nature is the corporeal\nnature that is designated in the second genus, which is [that of]\nbody, and this nature excludes all incompatible things which are\nabhorrent to the whole universe, such as a vacuum. ([OHI, II], 92 =\nTTUM, 85–86) \n\n\nWe see then that Bacon understands universal nature as supervening on\na world of distinct individual natures such that corporeal action is\ncontiguous and that a vacuum is excluded. The “particular\nnature” is the directing power of the species with its\nindividuals, and is divisible into the directive power of the species\nand of the individual. The example he gives is from embryology: there\nis the directing power of the species intending the production of the\nhuman in general; it intends the production of the individual\naccidentally. And there is the directing power of the individual,\nwhich aims at the determinate individual human as such and mankind in\ngeneral. As he puts it, “the universal is prior to the\nparticular in [both] the work and execution of nature, but is\nposterior in intent” ([OHI,II], 93 = TTUM, 87). He then states\nthe ontological priority of the individual over universals as\nfollows:\n\n\nBut if we would speak about the universal nature that is the directing\npower of the universe, [we should say that] it intends and brings\nabout an individual first and principally, about which there\nis mention in the Book of the Six Principles. Nature operates\nin a hidden manner in things: once a determinate man is generated, man\nas such is generated. And the cause of this is that one individual\nexcels all universals in the world, for a universal is nothing but the\nagreement of many individuals. ([OHI,II], 94, = TTUM, 86)\n\n\nHe distinguishes the absolute nature of an individual as\nsomething absolute, that is, “that which constitutes it and\nenters its essence.” This absolute nature of an individual is\nontologically more important than that by which one individual has\nsome agreement with another. One can notice that Bacon is now writing\nas a person with a theological interest: “And because all the\nthings which I am treating are for the sake of theology, it is clear\nthrough theological reasons that a universal is not [favorably]\ncompared to singulars. For God did not make this world for the sake of\nuniversal man, but for singular persons…Therefore, speaking\nplainly and absolutely, we must say that an individual is prior in\nnature [to a universal] both in operation and in intent,” and so\n“…it is necessary that the ranking according to prior and\nposterior be denominated absolutely and simply from the governing\npower of an individual…” ([OHI,II], 94–95 = TTUM,\n88–89). Bacon knows that he is defending a position in rank\nopposition to the common view: “Since the whole rabble [at\nParis] holds the contrary position, because of certain authorities,\nthe views of the latter must be presented” ([OHI,II], 96 =TTUM,\n90).\n\nThis account has given rise to opposing interpretations. Theodore\nCrowley (1950) saw in these passages the beginnings of late medieval\nnominalism that would find its expression in William of Ockham. Thomas\nS. Maloney (1985) challenged this reading and argued that the later\nRoger Bacon, like the earlier Bacon, was not a nominalist but an\nextreme realist. More recently, Chiara Chrisciani has argued that\nalready in 1964, Camile Berube saw Bacon as the originator of the\nFranciscan doctrine of the direct intellectual perception of the\nsingular. He also noted the link between Bacon and William of Ockham\neven though the path of influence was long and complex. She also\ncorrectly noted that for Bacon, we have a sense-perception of\nuniversals, one quite different from his contemporaries. Following K.\nTachau and Y. Raizman-Kedar, Crisciani argues that the universals are\nmaterially embodied in the intellect. In a recent study, while\nagreeing with this position with respect to the material intellect, I\nargued that it needed qualification. Perhaps we should hold that there\nare elements of both ‘extreme-realism’ and\nproto-nominalism in this account in the Communia naturalium. In\nhis important essay on individuation in the fourteenth century, Jorge\nJ.E. Gracia (1991) argues for seeing this text and others as the\nbeginning of the strict tradition of late medieval nominalism.\n4.6 Bacon on Body, Soul and Mind: Early Works\n\nBacon understands the soul to be a spiritual substance in union with\nthe Body. At this early stage, he does not hold the Avicennian notion\nof a separate agent intellect. In union with the body, the soul has\ntwo intellects, potential and agent. The former is directly connected\nwith the sensitive powers and the object of this intellect is the\nsingular material thing. The agent intellect is directed upward and\nknows spiritual beings in its own essence. For Bacon, there is a kind\nof confused innate knowledge in the soul. This is not a Platonic idea.\nIt is more like a disposition that inclines the soul towards knowledge\nof the truth. Still, it is in some sense an innate knowledge of the\nfirst principles of knowledge. The agent intellect illuminates the\nimages and frees them from specific material conditions. The\nuniversals are then impressed on the potential intellect.\n4.7 Bacon on Body, Soul, Mind: Later Works\n\nIn his Communia naturalium, Bacon explains that he wrote his\naccount of sensation, the sensitive soul, and perception in the\nPerspectiva as a criticism of the common teaching of the\nAristotelian teachers in the schools. Further, he comes to the\nconclusion in the Opus maius that the greater philosophers in\nthe Greek, Islamic, and Christian traditions maintained that the Agent\nIntellect is God, the source and agent of illumination. He\nnow makes this position his own, and attacks those teachers who hold\nthat the agent and the potential intellects are parts of the soul.\n\nBacon’s short treatise on the soul in CN is titled\nDistinctio tertia de anima. It provides an interesting window\non contemporary debates c. 1267–70 at Paris. It belongs with\nAquinas’s masterful polemic, De unitate intellectus contra\naverroistas and Siger of Brabant on Aristotle’s De\nanima.\n\nHe divides the work into seven chapters: (1) On the production of the\nparts of the soul; (2) On the Sensitive Soul; (3) On the Unity and\nPlurality of the Intellectual Soul; (4) On the Composition of the\nRational Soul; (5) On the Powers of the Soul: whether they are parts\nof the soul; (6) On the Vegetative Soul; and (7) On the Parts of the\nIntellectual Soul. \n\nThe first chapter reviews the common teaching since 1250. Having noted\nthat before 1250, all philosophers and theologians held that the\nvegetative and sensitive souls came to be by way of natural generation\nand that the intellectual soul came from the outside, Bacon says,\n“And still to this day (c. 1269–70) the English\ntheologians and all true lovers of wisdom (philosophantes)\nuphold this position” ([OHI, IV], 282), that is, that the\nintellectual soul alone is created by God while the vegetative and\nsensitive souls in the human are produced from the potency of matter\nin accordance with the laws of nature. He argues that those opposed to\nthis position rely on the Pseudo-Augustine, De spiritu et\nanima, and on the De ecclesiasticis dogmatibus by\nGennadius. Those who follow these sources, he states, hold that\n“the vegetative and sensitive souls are co-created with the\nintellectual soul…” He describes this as a kind of\n‘folk-psychology’. For Bacon and “all\nphilosophers,” embryology shows that the embryo is nourished and\ngrows prior to the infusion of the intellectual soul. Bacon states the\nproblem as follows:\n\n\nBut if the vegetative and sensitive souls were co-created with the\nintellective soul, as many moderns teach publicly, then, they\nwould not precede the intellective soul in being. And so these people\nare forced to claim that one needs a double vegetative and sensitive\nsoul, one that is produced from the potency of matter through the\npower of nature; the other is created with the intellective\nsoul…But no authorities hold this position, and experts in\nphilosophy, therefore, dismiss it as nonsense. ([OHI, IV], 283) \n\n\nHenry of Ghent among others advocated this doctrine of the co-creation\nof souls.\n\nIn the second chapter, Bacon attacks some of the leading philosophers\nat Paris: “But the leaders of the common philosophers at Paris\nfall into other deadly errors, which the theologians contradict”\n([OHI, IV], 284). For about ten years, the leader of the philosophers,\n“an erroneous and famous man,” held that “prior to\nthe existence of the rational soul, one must presuppose a specific\nsubstantial difference educed from the potency of matter which places\nman in the species of animal, such that the intellective soul does not\ndo so…This is contrary to the philosophy of Aristotle and to\nall authors” ([OHI, IV], 284–85). A study of the\nQuestiones on De anima indicates the earlier Parisian\ntradition out of which Bacon is working (Bernardini 2009; see also\nBernardini 2014). In the third chapter, Bacon makes explicit the\nobject of his polemic. It is the view commonly ascribed to Siger of\nBrabant and the so-called Radical Aristotelians (Latin Averroists).\nBacon states:\n\nWe are concerned with this second proposition on the unity and\nplurality of the intellective soul. Therefore, they [the Latin\nAverroists] argue that the intellective soul (anima\nintellectiva) is one in number among all human beings. Therefore,\nthey cover their error when they are compelled [to respond] stating\nthat ‘through philosophy it is not possible to hold anything\nelse, nor is it possible to have any other position through reason\nalone, but only through faith alone.’ ([OHI, IV],\n286–87)\n\n\nThis is the proposition that is analyzed and critiqued by Thomas\nAquinas in his De unitate intellectus contra Averroistas\n(1269) [TUIA]. It is also closely related to the celebrated doctrine\nof double truth imputed to the Latin Averroists by their Franciscan\nopponents. Bacon’s arguments, like those of Aquinas, deal\nspecifically with philosophical reasons for the mistaken positions of\nthe Averroists. The first two arguments are moral arguments: if there\nwere one identical intellect in all humans, the same person would be\nboth virtuous and vicious. The denial that ‘this individual\nhuman thinks’ is contrary to both philosophy and faith. This is\ncontrary to the Nicomachean Ethics and would lead to a\ndestruction of moral philosophy.\n\nThe remaining arguments hold that the doctrine destroys “the\nlaws of nature,” that is, of natural philosophy and psychology.\nFirst, he presents Aristotle’s arguments against the\ntransmigration of souls. Second, he argues that this intellect would\nbe infinitized and in power equal to God. Third, he addresses the\nimportant issue of the connection between diverse imaginations and the\nintellective soul. This could lead to the same person being learned\nand ignorant at the same time in respect of the same things. Again,\ninjury to the sensory organs can lead to a person becoming insane. If\nthe sensory organs work, the existence of diverse imaginations will\nnot differentiate the intellect in different persons. Fourth, there\nwill be no unified object of knowledge. Bacon distinguishes between\nthe single object of the intellect and the “intelligible\nspecies” by means of which we know that object:\n\n\nFor when it will be argued that the species will be\nmultiplied in diverse persons, I concede that the diverse\nrepresentations of the same thing can be present to diverse persons\nbecause the thing itself produces its species according to\nevery diameter, as was proved in De multiplicatione\nspecierum. And so, just as in the diverse parts of the air the\nspecies of the same thing are diverse, and come to the eyes of\ndifferent perceivers, so it is the case with the intellects of\ndifferent persons. ([OHI, IV], 289)\n\n\nThus, he makes a basic distinction between the thing which is the\nobject of knowledge and the representations (intelligible species) by\nwhich one knows them. Fifth, Bacon holds that the Averroists leave no\nroom for new knowledge. Sixth, against the Averroist position that all\nlogicians and grammarians must have the one same knowledge, Bacon\nholds that one must distinguish between the cognitive habit by which\nthe soul knows anything knowable and the object of knowledge in the\nsense of “the object of knowledge,” which is a unity.\nSeventh, based on Aristotle’s teaching on the passiones\nanimae (species/concepts), he holds that just as the soul is\nmultiplied, so too will knowledge be multiplied. And so in a real\nsense, there is distinct and different knowledge in different human\nbeings.\n\nChapters four to seven on the parts of the soul place Bacon in the\ncontext of the Franciscan and Dominican arguments on the parts of the\nsoul. These chapters show that Bacon was very active in the early\ndebates at Paris in which the unity of substantial form in Aquinas was\nstrongly criticized by the Franciscan School. Bacon is so critical of\nAquinas’s position that he deems it heretical. He defends the\nnotion of plurality of forms while strongly arguing for the essential\nsubstantial unity of the human being. Bacon also uses his remarks to\nlet the reader know that his study of Perspectiva was\nundertaken to criticize the common teaching on natural philosophy\n(including psychology) and medicine at the University of Paris.\n\nThis short treatise has the advantage of contextualizing Bacon’s\nworks in the 1260s in terms of the debates on Latin Averroism. It\nwould appear that Bacon, like Bonaventure and Pecham, was an explicit\nopponent of the young teachers of the Arts at Paris, especially Siger\nof Brabant. Bacon and Pecham shared the same scientific concerns\n(Hackett 2013a). And it would appear that Bacon’s treatises such\nas the Perspectiva were written with this context in mind.\nSince, as we have noted above, Bacon provided a philosophical critique\nof the issues concerning Latin Averroism already as a teacher at Paris\nin the 1240s, we should see his intervention in the debates of\n1266–72 as the criticism of an emeritus Professor of Philosophy,\nnow engaged with the theological arguments of the schools at\nParis.\n5. Bacon’s Later Philosophy: Language Study and Science in the Service of Both Moral Philosophy and Theology\n5.1 Background\n\nAt the beginning of the Opus maius and related works, Bacon\noffers a structural critique of scholastic practice in the\nuniversities. He favors both language study and science over the\n“Sentence-Method” as a way of interpreting the texts of\nPhilosophy and of Scripture. And he advocates training in mathematics\nand the sciences as requirements for students in theology. Second,\nBacon’s later works on language and science are written in the\nspecific historical and political context of the Mongol invasion of\nEurope, the sack of Baghdad in 1258 by the Mongols, and the\ngeo-political situation of a Europe hemmed in by both the Mongols and\nIslam. His sense of world geography was aided by the travel reports of\nWilliam of Rubruck [Southern, WVI]. The wider historical context for\nBacon’s concerns has recently been outlined by Amanda Power\n(Power 2013). The overall division of the Opus maius is\nPlatonic/Stoic: language study, natural philosophy/mathematics,\nmorals. The general context is theological and Franciscan: the arts\nand sciences leading to human well being in this world and the next.\nIt is also clear that Bacon is constructing a “new model”\nfor medieval philosophy, one in which Aristotelian concerns are taken\nup and transcended in a Neo-Platonism with significant Roman Stoic\ninfluence and adapted to moral philosophy and Christian theology.\nMetaphysics is taken up and completed in Moral Philosophy. The latter\nbecomes the end of linguistic and scientific study. Logic is reduced\nto mathematics, and the applications of mathematics become central to\nan understanding of the sciences (Perler 2005). The applications of\nmathematics can in turn be used in religion and theology. Therefore,\nin his later works, especially in the Perspectiva and\nScientia experimentalis, Bacon will define\nexperientia-experimentum in a distinctly new manner, one that\ntakes up and also goes beyond the use of this term in Aristotle. His\nnew definition advances on his own Questiones from the 1240s.\nPeter King has recently claimed that Ockham was the first to create\nthis new definition of experientia-experimentum (2003). He is\ncorrect that this definition is found in Ockham, but not in claiming\nthat this concept began with Ockham. The concept is formulated in the\nscientific works of Roger Bacon and is found in a number of Franciscan\nwriters including John Pecham well before the age of Ockham (Hackett\n2009).\n5.2 Opus maius/Parts One and Two\n\nBefore presenting the seven parts of the Opus maius, it is\nimportant to note a factor that is absent from the scholarship, that\nis, how Bacon’s Islamic sources structure this major work. These\nsources, of course, are integrated with his Greek and Latin sources.\nMost important here for the architecture of the latter work is the\nDe scientiis of Alfarabi. The division of the sciences and\nthe reduction of the linguistic and natural sciences to moral\nphilosophy is strongly influenced by this text. Part four and the\nlatter section of Part six on prognostication, and Part seven, IV, is\ninfluenced by Abu Ma’shar’s Introduction to Astronomy and\nby his Book of Conjunctions. Part five on Perspectiva is a masterpiece\nof synthesis of most of the major Greek and Muslim texts on Optics.\nEspecially important are the texts of Ptolemy, Alkindi, and Ibn\nal-Haytham. This synthesis clearly influences Bacon’s new\nunderstanding of an experimental science. And yet in addition to this,\none must note that Ptolemy in his Almagest, Optics and\nAstrology influences Bacon’s understanding of method in the\nsciences as it impacts the integration of reason and experience. And\nin the third part of the Scientia experimentalis,Bacon is influenced\non the important commentary on Ptolemy’Astrology, namely, the\nCentiloquium by Abu Ja’far IbnYusuf Ibn Ibrahim. But\nsince Bacon’s De multiplication specierum is\nacknowledged by him as the key to his Optics, one must note the\nstructural presence of the De Radiis attributed to Al-Kindi.\nThis work provides the basis for his doctrine of species that will be\nspelled out for the geometry of vision in the Perspectiva. Since the\nOpus maius and related later works are intended as sketch for\na grand linguistic, scientific, philosophical and theological work,\none must note the important openness that Bacon has for the science,\nphilosophy and theology received from the Muslim and Jewish worlds.\nThis is very different from the Anti-Arabism and the intermittent\nAnti-Judaism that would become a central part of Western Renaissance\nculture after 1300.\n\nPart one examines “the causes of error” in education and\nis critical of some theological limits on science. These causes are:\nbelief in unworthy authority; long custom; uncritical popular opinion;\nconcealment of academic ignorance in a display of rhetorical wisdom.\nThe polemic is presented as one of conflict among the canon lawyers\nand theologians at Paris concerning the reception of Aristotle and\nrecent works on Greek and Arabic sciences, especially\nastronomy/astrology. This is Roger Bacon’s appeal to the Wisdom\nof the Ancients\n\nPart two contains the pre-Cartesian view of truth and wisdom as a\nresult of a universal revelation to the Hebrews that was transmitted\nthrough the Greeks, Romans, and Islam to medieval Christianity. This\nview would be influential in Philosophy up to the age of Francis Bacon\nand Descartes. Roger Bacon links it to a doctrine of illumination\ntaken from Augustine, Avicenna, and the commentary on the\nPseudo-Ptolemy: Centiloquium. He contrasts the tradition of\nthe great philosophers such as Plato and Aristotle with the mythical\ntraditions from ancient times.\n5.3 Opus maius/Part Three: On Language, De signis and Compendium Studii philosophiae\n\nPart three deals with language study, grammar, semantics, and\nsemiotics, and contains Bacon’s general theory of signs. The\n1978 discovery by the late Jan Pinborg and his colleagues of De\nSignis, a missing section of part three, led to intense study of\nBacon’s semiotics and the philosophy of language in his later\nworks. Bacon’s proposals are radical. \n\nBacon’s concerns with language in his later works transgress the\ndisciplinary boundaries of the medieval university. First, he demands\nthat the universities study the Wisdom languages, i.e., Hebrew, Greek,\nLatin in one list, or Hebrew, Greek, Arabic, and Chaldean in another.\nHe wrote Greek and Hebrew grammars (GGHG). Bacon takes Latin as a\nmodel for a natural language, the “mother language” of the\nWest. For Bacon, this language is dependent on Greek and Hebrew. He\ndistinguishes the “vulgar language” or “language of\nthe laity” from the “language of learning” of the\nclergy. For him, vulgar language cannot be used in learning; it does\nnot have an adequate technical vocabulary. \n\nBacon’s relative originality consists in the fact that he brings\ntogether the semantic and semiotic concerns of both Arts and Theology\nor, as one might say, Aristotle and Augustine, into a creative\nsynthesis. From Augustine, he carries over significant elements of\nStoic Logic. From these concerns, he develops his own novel theory of\nthe sign. In the Communia naturalium, Bacon notes that he had\nto develop a new logic needed to deal with his new interests in the\nsciences. Indeed, Bacon uses the words signification and its\ncognates in a manner quite different from the traditional\nposition.\n\nThe commonly used medieval definition of a sign was substitutional or\nrepresentational: “A sign is that which shows itself to the\nsenses and presents something else to the intellect.” This\ndefinition is similar to that of Augustine in De dialectica\n(p. 86): “A sign is something which is itself sensed and which\nindicates to the mind something beyond the sign itself.”[3]  In this case, the parts of our language are given by either God or the human so that the thoughts of the speaker can be communicated to the mind of the hearer. The expressions in language stand for the\nthoughts of the speaker and represent them to the hearer. In De\nsignis, Bacon provides the following definition: “For the\nsign is that which, offered to the senses or to the\nintellect, represents itself to that intellect, since not every\nsign is offered to the senses as the common definition of sign\nsupposes. However, on the testimony of Aristotle, another kind is\noffered only to the intellect.” He states that the passiones\nanime (concepts/species) are signs of things, and such\npassiones are habits of the soul and species\n(representations/intentions) of the thing existing for the soul, and\ntherefore, “they are offered only to the intellect so that they\nrepresent external things to that intellect” ([DS], 82). Some\ninterpreters claim that Bacon’s definition of sign is close to\nthat of to that of Augustine in De doctrina Christiana:\n“For a sign is something that apart from the impression it gives\nto the senses, also causes something else from itself to be present to\nthe\n mind.”[4]\n Augustine gives the examples of animal tracks leading us to think of\nthe animal, smoke leading us to think of fire, human expressions\nleading to our understanding the mood of a person, and soldiers\nanswering the call of the trumpet in battle and then knowing where to\nmarch.\n\nOne can see that Bacon in a manner uncommon for his times relates\nAugustine’s definition of sign to the inferential notion of sign\nin the works of Aristotle. And so one can also see how Bacon,\ninfluenced by Kilwardby and Fischacre, unites the different concerns\nof the philosopher and the theologian.\n\nBacon continues and states: “The sign is in the predicament of\nrelation.” This may sound innocent, but in Bacon’s account\nit has the effect of transforming the traditional relation between a\nsign and its meaning, either a thing or a concept. The theologians\nwere aware of a twofold relation: that of sign to thing signified and\nsign to the perceiver of the sign. For the majority of theologians,\nthe first relation is an essential and permanent relation; the latter\nis accidental and non-permanent. Bacon reverses this. He remarks,\n\n\nThe sign is in the predicament of relation and is spoken of\nessentially in reference to the one for whom it signifies. For it\nposits that thing in act when the sign itself is in act and in potency\nwhen the sign itself is in potency. But unless some were able to\nconceive by means of this sign, it would be void and vain. Indeed, it\nwould not be a sign, but would have remained a sign only according to\nthe substance of a sign. But it would not be a definition of the sign,\njust as the substance of the father remains when the son is dead, but\nthe relation of paternity is lost. ([DS], 81)\n\n\nAnd so it is not sufficient that a sign have reference to what it\nsignifies (accusative) in order to be a sign; it is also required that\nit have an interpreter (dative) for whom it signifies. In medieval\ntheology, the thing signified (accusative) has priority, and was true\neven if there were no interpreters. The notion of this two-way\nrelation is found in Bonaventure, Rufus, and Fishacre among others,\nand the thing signified holds ontological priority over the\nrelationship of sign to perceiver. \n\nFor Bacon, the communicative relation to a hearer is basic, and the\nrelation to the thing signified is important but secondary in the\nwhole context of communication. The common theological teaching held\nthat the relation of sign to thing signified is primary and\nfundamental. Once a name has been instituted, it does not change\n(Maloney 1983b). And so, the name ‘Caesar’ can be used of\nboth the living and the dead Caesar. Against Rufus and Bonaventure,\nBacon held that this introduced ambiguity into language. Even in the\ncase of ordinary signs such as that of a tavern, they remain a sign\nonly potentially if there are no customers or staff.\n\nBacon’s own classification of signs introduces distinctions that\nreflect an integration of Augustine and Aristotle:\n\n1.\nNatural Signs\n    \n1.1\nSignifying by concomitance, inference, and consequence\n        \n1.1.1 Necessarily\n1.1.2 Probability\n\n1.2\nSignifying by configuration and likeness\n1.3\nCause and effect\n\n2.\nIntentional Signs purposefully generated\n     \n2.1\nSignifying conventionally by means of a concept\n          \n2.1.1\nLinguistic signs by way of imperfect deliberation: interjections\n2.1.2\nLinguistic signs by way of perfect [completed] deliberation: other parts of speech\n2.1.3\nNon-linguistic signs (language of gestures, monk-signs, sign-boards)\n\n2.2\nSignifying naturally, in the mode of affect\n\n2.2.1\nProducts of the sensitive soul: animal sounds\n2.2.2\nProducts of the rational soul: groans, exclamations, cries of\n pain[5]\n\n\n\n\nThe distinction between 1 and 2 is taken from Augustine’s De\ndoctrina Christiana. Bacon himself claims that he worked out the\ntypology himself prior to finding it in Augustine’s great work\non interpretation. Modern scholars, however, believe that he must in\nsome way have borrowed it from Augustine (Maloney 1995). The\ndistinction between 2.1 and 2.2 is taken from the Aristotelian\ntradition as handed down by Boethius. Type 1 signs occur naturally as\npart of the agency of nature. Type 2 are signs only because they have\nbeen willfully created as such by deliberation; included here are\nlinguistic and non-linguistic signs. However, Type 2.2 are designated\n‘natural’ in a sense that is different from Type 1. These\nsounds and groans are products of nature and happen instinctively but\nin an “animate” action.\n\nInterjections are a problem. They are parts of language, conventional\nsigns, and so conceptual, yet they are emitted suddenly and often due\nto pain. They are similar in a way to the groans of animals (Type\n2.2). This discussion is common to writers on grammar and logic from\nthe 1240s, especially in the works of Richard Kilwardby and similar\nauthors.\n\nThe signs in 1.1 on natural consequence indicate that Bacon has\nintegrated not only Aristotle and Augustine but also the work of\nAverroes on the Rhetoric of Aristotle. Thomas S. Maloney has\nargued that Aristotle’s De anima plays an important role\nin Bacon’s distinction between signs by nature and signs by\nintention (Maloney 1983a). Bacon provides an analysis of ambiguity and\nequivocation in the De signis and Compendium studii\ntheologiae (Maloney 1984).\n5.2.1 Bacon and the Semiotic Triangle\n\nIn the traditional semiotic triangle inherited from Plato and\nAristotle, the sign is a symbol and symptom of the passiones\nanimae (concepts/species) in the soul and the latter in turn have\na relation of similitude to extra-mental things. And so the relation\nof sign to thing is indirect. Bacon gets rid of the mediation of\nconcepts/species and has the sign refer directly to the object. In\nthis way, Bacon substitutes an extensional relation for an intensional\nrelation. Words can directly refer to individual things, be\nthey single objects in the world, mental objects, or philosophical\nconcepts. Primarily, then, words refer strictly to the present object.\nReference to past or future objects will require the extension of\nunivocal terms by means of analogy or metaphor. Simply because a sign\nexists, it will not follow from that alone that the object of the sign\nexists. As we saw above, without the interpreter of the sign, a sign\nis a sign in name only or potentially. Bacon does not deny the\nexistence of the concept/species, but notes that a second imposition\nof meaning is required to name it. As Umberto Eco puts it,\n“Bacon definitely destroys the semiotic triangle that was\nformulated since Plato, by which the relationship between words and\nreferents is mediated by the idea, or by the concept, or by the\ndefinition” (Eco 1989, 61). The relation of sign to concept is\nreduced to that of a symptom, which is no longer a symbol. Here one\ncan see the preparation of the ground for the semiotics of William of\nOckham and late medieval nominalism.\n5.4 Opus maius/Parts Four, Five and Six: Mathematics and Philosophy of Nature (De multiplicatione specierum, Perspectiva, Scientia Experimentalis)\n\nParts four, five, and six of the Opus maius present the main\nthemes of Bacon’s contribution to scientific education. It is\nimportant to see his main contribution to science as one who advocated\n“scientific education” in an Arts Faculty that was\npredominantly dedicated to linguistic arts. Bacon had a very wide\nreading knowledge of most of the newly translated work from Greek,\nJewish, and Islamic Philosophy and Science. His major claim to fame in\nscience is that he is the first Latin Western thinker to comprehend\nand write on most of the ancient sources of optics. In brief, he\ninitiates the tradition of Optics/Perspectiva in the Latin\nworld. This tradition would be formulated as teaching text by his\ncontemporaries Pecham and Witelo. Bacon’s optics was also read\nand commented on in 14th century Italy by, especially by Lorenzo\nGhiberti. It was known to and used by Leonardo Da Vinci. And it was\npart of the tradition of learning that led to Kepler and Descartes. In\nhis Perspectiva and De scientia experimentali, Bacon\noutlines a sketch for a scientific method, one that takes optics as\nthe model for an experimental science. In fact, he succeeded in his\nendeavor in that Perspectiva was added to the four\ntraditional university subjects of the quadrivium: arithmetic,\ngeometry, astronomy, music.\n\nOpus maius, Part four, deals with mathematics and the\napplications of mathematics. Bacon presents reasons for a reduction of\nlogic to mathematics (a kind of reversal of modern logicism) and sees\nmathematics as the key to an understanding of nature (Perler 2005).\nClearly, he is proclaiming the “usefulness” of mathematics\nfor knowledge; he is not doing mathematical theory. And the branch of\nmathematics that is important here is geometry. He applies it in\ndetail in the optical works edited by Lindberg. Following his\nabbreviation of the De multiplicatione specierum in part four\nof the Great Work, which shows how mathematics might be applied to\nphysics, he deals with the application of astronomy/astrology to human\naffairs, the uses of mathematics in religious rites as in chronology,\nmusic, symbolism, calendar reform, and geographical knowledge, and a\nresume of astrology (Rutkin, 2019). It used to be thought that Bacon\nwas a Platonist in his view of the absolute priority of mathematics.\nMore recently, that view has been seriously qualified. He does not\nreduce physics to mathematics. Indeed, his explicit work on\nmathematics, the Communia mathematica, is not an exercise in\nmathematics, but a presentation of the “common notions”\nthat are important for a variety of mathematical practices. Bacon\nhimself acknowledges those who were better mathematicians, namely,\nJohn of London, Pierre de Maricourt, and Campanus of Novara (Molland\n1997). In general, Bacon is more interested in how mathematics can\ncontribute to knowledge of the world as an aid to missionary activity.\nHe sent a map of the world to the Pope. \n\nBacon was very interested in the applications of astronomy/astrology\nto human events. Federici Vescovini (2011) has now provided the\nessential context and linkage between medieval magic and philosophy,\nenabling scholars to grasp the dimensions of fate and freedom as\nunderstood by medieval philosophers and theologians. Although\ncommitted to freedom of the will, Bacon held to a deterministic notion\nof causation in nature based on the Introductorium Maius in\nAstronomiam of the Islamic authority on Astrology, Abu Ma’\nShar (Albumassar), on the De radiis of al-Kindi, and on the\nCentiloquium by Pseudo-Ptolemy (Ahmed Ibn Yusuf). And since\nhe held to a doctrine of universal radiation in nature, he had to\naccount for the influence of the heavens on the human body and hence\nindirectly on the human mind. Much of the polemic in his later works\nconsists of a justification of this interest in an astrologically\nnecessitated universe in the face of traditional theological\nobjections. These works play a big role as background for his natural\nphilosophy in De multiplicatione specierum. He was also\ninterested in alchemy. It was his determined interest in some of these\nareas of study that led to disagreement with his superiors in the\nFranciscan Order, specifically, Bonaventure.\n5.4.1 The Philosophy of Nature\n\nBacon’s treatise De multiplicatione specierum, his\nmajor later work on physics, written before 1267, is closely related\nto the study of light, vision, and perception in the\nPerspectiva. David C. Lindberg (DMP, Introduction) has noted\nthat Bacon takes Grosseteste’s physics of light, a development\nof Al-Kindi’s universal radiation of force, out of its\nmetaphysical background and develops a universal doctrine of physical\ncausation.\n\nLindberg had already traced the history of the emanation theory of\nlight from Plotinus to Bacon. Lindberg notes the influence of\nal-Kindi’s work on the rays of the stars but does not cited\ndetailed evidence. What Bacon achieves is a comprehensive theory of\nphysical force divorced from psychological, moral, and religious\ninterpretation. As Lindberg puts it (DMP, Introduction), in this work,\nBacon does not formally examine divine illumination of the intellect,\nuniversal hylomorphism, the plurality of forms (properly qualified),\nand the separability of soul. He restricts himself to presenting a\nfull theory of the physics of light. Species is the first effect of\nany natural agent. As Lindberg puts it (DMP, Introduction),\n“This is a complete physical and mathematical analysis of the\nradiation of force--and, thus, of natural causation.”\n\nThe use of ‘species’ in this account is not that of\nPorphyry’s logic or the perceptual notion of likeness. It\nis“the force or power by which any object acts on its\nsurroundings.” It denotes “al-Kindi’s universal\nforce, radiating from everything in the world to produce\neffects.” As Bacon himself notes,\n\n\nspecies [force, power] is the first effect of an agent…the\nagent sends forth a species into the matter of the recipient, so that,\nthrough the species first produced, it can bring forth out of the\npotentiality of matter [of the recipient] the complete effect that it\nintends ([DMS], 6–7). This is a universal theory of natural\ncausation as the background for his philosophy of vision and\nperception. Most importantly, species is a univocal product of the\nagent. The first immediate effect of any natural action is\ndefinite, specific, and uniform. This production is not the imparting\nor imposition of an external form. The effect of the species is to\nbring forth the form out of the active potency of the recipient\nmatter. (DMS, 6–7)\n Al-Kindi’s De radiis, his optics, and\nthat of Ibn Al-Haytham form the background to this teaching on\nspecies.\n\n\nThis also leads to an attempt to provide separate domains for material\nand spiritual being. Bacon is adamant on this point: spiritual and\nmaterial being are entirely separate. Natural causation occurs\n“naturally,” according to regular processes or laws of\nnature. There is no “spiritual being” in the material\nmedium as was commonly taught by other scholastic philosophers. That\nis, Bacon objected to the use of the term ‘spiritual being in\nthe medium’. No, for Bacon, universal causation is corporeal and\nmaterial, and matter itself is not just pure potentiality but is\nrather something positive in itself. So, in terms of\nexplaining ‘spiritual/intentional being’ in the medium,\nBacon is of the view that the introduction of such terms muddy the\nwaters, especially if you are trying to come up with a comprehensive\ndoctrine of physical force. Hence, the general philosophy of nature\nprepares the theoretical ground for the specific application of\nmathematics to matters of vision and perception. It also allows for\nand requires a metaphorical extension of these terms to moral and\nreligious domains.\n\nRecent scholarship on Bacon’s philosophy of nature, especially\nthat of Yael Raizman-Kedar (Raizman-Kedar, 2009; Raizman-Kedar,\ndissertation, University of Haifa, 2009) places great emphasis on the\nimportance of the concept of species for Bacon’s\naccount of perception and mind. She is correct to note that Bacon\nplaces a kind of natural activity in the mind via species. This leads\nin her view to natural species having a direct role in intellectual\nactivity as such. One could speak of the direct presence of material,\ncorporeal species in the intellect itself (see section 5.2 above for\nBacon’s complex discussion of the role of signs in animal and\nhuman knowing). Here, and also in the Perspectiva, we can see\nthe importance of the cogitative sense, as it takes on an\nadministrative role in animals analogous to reason in human beings.\nBut in this life, for Bacon, human beings cannot know things in the\nworld without the presence of species in the mind. Species as the\nexpression of universal agency act naturally in nature and in the mind\nin a certain limited sense. Yet, Raizman-Kedar claims, “the very\nsame species issued by physical objects operate qua material\nspecies within the intellect as well.” She also claims that the\nconcept of divine illumination plays a secondary role in the\nacquisition of knowledge, and that Bacon\n\n\nregarded innate knowledge as dispositional and confused, the\nspecies, representing their agents in essence, definition,\nand operation, arrive in the intellect without undergoing a complete\nabstraction from matter and retaining the character of agents acting\nnaturally. In this way, Bacon sets the intellect as separate from the\nnatural world not in an essential way, but rather in degree\n(my italics), thus supplying a theoretical justification for the\nability to access and know nature. (Raizman-Kedar, 2009, 131; after\n2012 the author writes as Kedar)\n\n\nRaizman-Kedar correctly stresses the central role of species\n(material/corporeal) in the acquisition of intellectual knowledge of\nmaterial particular things in the world. Further, she carefully\ndistinguishes between the role of hearing and sight in the knowledge\nprocess.\n\nHackett (2018c) raises questions about this conclusion. He points to a\nsignificant problem with the translation of a central passage in\nPerspectiva in support of this position. Further, by placing\nBacon alongside his confrère, one can see that the doctrine of\ndivine illumination plays a central role in both pure intellectual\nknowledge, moral knowledge and knowledge of the natural world. Yes,\nthe material species are a necessary but not a sufficient element in\nthe acquisition of pure intellectual knowledge. Without the\nilluminative process within from above, pure intellectual vision is\nblocked. It is not at all clear that one can claim that Bacon is a\nmaterial monist. Bacon’s separation of the account of physical\nspecies in the DMP could lead one to think he has to be a material\nmonist, even with regard to species in the medium, sense, and reason.\nAnd there is one sense in which this is true. But in the end, as he\nstates in both the DMP and the PRSP, matter and spirit are two\nentirely separate kinds of substance. Hence, at a deep level, Bacon is\na substance dualist (medieval version).\n5.4.2 The Perspectiva and De speculum comburentibus (1266–67)\n\nIn his Perspectiva and related works, Bacon presents his\nmodel for a careful and detailed application of mathematics to the\nstudy of nature and mind. In imitation of the De aspectibus\nof Alhacen (Ibn al-Haytham), he provided an application of geometry to\nvision that within the terms of reference of his times was successful.\nBut he is critical of both Alhacen and Ptolemy. He sees himself as\nanswering some of the optical problems not solved by either\nauthor.\n\nBacon’s approach to vision and perception, however, is not an\nexercise in modern mathematical optics. It should be seen as the\nsketch of a physics of light as the basis for a philosophy of\nperception and mind. The account of visual perception in terms of\nnatural philosophy, medicine, and philosophy of mind is found in Parts\none and a section of Part two. The account of Perspectiva\nsets out a consideration of direct, reflected, and refracted rays, and\nat the end of Part three concludes with the application of geometrical\nmodels for moral and religious considerations. The analysis of natural\nvision provides analogies and descriptions for an understanding of\ndivine influence.\n\nPart one and also distinctiones one and two of Part two deal\nwith the structure of the eye, problems of vision, and visual errors.\nThe aim is psychological and epistemological, that is, Bacon sets out\nthe conditions for certifiable/verifiable and certain perception. The\ntheory of the eye is taken from the Galenic tradition handed down in\nConstantine the African’s translation of Hunyan Ibn Isaq and\nfrom Avicenna and Alhacen. For this tradition, vision occurs when the\ncrystalline humor is altered by the intromission of visual species\nfrom the object. Vision is completed when the species proceeds through\nthe vitreous humor to the optic nerve and through this to the common\nnerve. It is here that a common visual judgment is made. Throughout\nthe text, Bacon makes reference to the kind of visual knowledge\npossessed by animals, especially in the context of a discussion of the\ncogitative sense. Bacon follows Ibn al-Haytham and imposes a\ngeometrical model on the eye, enabling him to give a geometrical\naccount of radiation through the eye. How then does one avoid\nconfusion in vision and gain verifiable clarity? For Bacon, the\nperpendicular ray is primary; the other rays are treated as cases of\nindirect vision, refracted in the rear surface of the crystalline\nhumor.\n\nBacon is next concerned with optical illusions, inverted images,\nmagnification, vision of distant objects, the moon illusion, and such\nmatters. He seeks in a rational and experimental manner to solve the\npuzzles found in Ptolemy, Alhacen, and others. Still, he is a child of\nhis sources, which do not provide him with the more advanced data and\nmathematical method that arose only later, in the seventeenth century.\nBut they do provide him with a functional qualitative geometry of the\neye and vision based on the best Greek and Islamic science. Bacon is\ncommitted to an intromission theory of vision, though he combines it\nwith an extramissionist theory that avoids the anthropomorphisms of\nearlier extramissionist theories. He uses the latter theory mainly to\nemphasize the active role of the eye in vision.\n\nIn Parts two and three, he is to some extent successful in applying\ngeometry to problems of direct, reflected, and refracted vision. He\nmoved the study of these matters to a new level. The geometrical\narguments are worked out with careful diagrams and various appeals are\nmade to “experimental” conditions. What are these\nconditions? Some of them are simple thought-experiments or even\nreports of actual experiments from earlier writers. It seems clear,\nhowever, that Bacon himself did experimental work with pinhole images,\nlenses, and discrete observations. This does not lead to a pure\ngeometrization of nature, however, and he inevitably falls back on\nphysical, perceptual, and metaphysical arguments. One might argue that\nhe lacks the notion of infinity that is present in modern\ngeometry.\n\nBacon introduces another important item for science. He refers to the\n“laws of reflection and refraction” as leges communes\nnature. In his account of nature in Communia naturalium\nand the later works in general, Bacon’s view is that a general\nlaw of nature governs universal force. This universal law of nature is\nimposed on a world of Aristotelian natures. This notion would have a\nsignificant future in experimental science. This concept of a\nuniversal law of nature has been highlighted by M. Schramm (1998). It\nhas now been taken up by Yael Raizman-Kedar and Professor Giora Hon,\nwho are studying the development of universal laws of nature from\nRoger Bacon to the Early Modern Period.\n\n\nBacon ends Part three with an account of how a better understanding of\nnatural phenomena could lead to a more accurate knowledge of the\nnatural phenomena mentioned in Scripture. He finds in visual phenomena\nsignificant metaphors and analogies for use in moral and religious\nteaching. A solution to David C. Lindberg’s queries about\nBacon’s attempt to combine elements of the intromissionist and\nextramissionist theories of vision is addressed here. At one level, it\nseems to be an akward combination of two conflicting theories of\nvision. This combination can be understood when one notes that Bacon\nis making use of the important issue of grace and free will issue as\nthe moral-religious background for his discussion of vision. In other\nwords, genuine theological concerns influence the manner in which\nBacon constructs his analysis of vision in the Perspectiva.\nThus, the analyses of Ptolemy and Alhacen had to be synthesized within\na definite theological framework.\n\nDirect evidence of Bacon’s influence here in making science\navailable for an educated public is seen in the use of his work by\nPierre de Limoges in his influential text, De oculo morali\n(On the Moral Eye), written at Paris between 1275 and 1289. MS Paris,\nBN Lat. 7434, owned by Pierre de Limoges, contains an early copy of\nBacon’s Perspectiva. All of this suggests Pierre de\nLimoges,(magnus theologus et astronomus) as a very early\nreader of Bacon’s works (Newhauser 2001). Both are genuinely\ncommitted to theimprovement of the task of the preacher. Here, we see\nthe priority for Bacon of preaching over theology, or rather, the\nlatter is in service to the former (Johnson 2009).\n5.4.3 On the Nature of Experimental Science: De scientia experimentali (1266–67)\n\nPresupposing the Perspectiva, in De scientia\nexperimentali and in related works on the halo and on burning\nmirrors Bacon situates this new scientific practice as a desired area\nof study in the medieval university. It is consequent on the study of\nPerspectiva. Starting from Aristotle’s account of\nempeiria (experience), Bacon argues that logical argument\nalone, even when it originates from experience, is not sufficient for\nthe “verification of things”. Even arguments that have\ntheir origins in experience will need to be verified by means of an\nintuition of the things in the world. He distinguishes scientific\nargument from moral and religious mystical intuition, although he does\nallow for the notion of a revealed intuition in science. It is this\nelement that clearly separates Bacon’s practice from that of\nmodern science. Just as in his concern with the certification of\nlanguage to gain individual reference, so too in science, Bacon\nclearly wishes to have a way of certification for knowledge of the\nindividual.\n\nHis aim is to provide a method for science, one that is\nanalogous to the use of logic to test validity in arguments. This new\npractical method consists of a combination of mathematics and detailed\nexperiential descriptions of discrete phenomena in nature. It would be\ndistinguished from the conjurations of magic and from moral and\nreligious belief. It would also be different from philosophy of nature\nand from broad optical knowledge. These two areas are important for\nexperimental science, but they constitute general principles, so that\nin themselves and without experiment, they do not provide access to\nminute, detailed experiments. Nevertheless, for his description of the\nfirst example of an experimental science, the study of the rainbow,\nBacon depends on the accounts handed on by Aristotle, Seneca, and\nAvicenna. He is not uncritical of these accounts.\n\nOne source for Bacon’s methodology in an experimental science\nhas been overlooked by the scholarship. It is clear to all that Bacon\nmade much use of and privileged Ptolemy’s Optics. What has been\nmissed is that Bacon was also influenced by Ptolemy’s\nmethodology in the introductory chapter to the Almagest. The\ncombination there of experience and geometrical reason is in some\nrespects different and more detailed than in Aristotle’s\nscientific methodology. And so even as Bacon uses Aristotle’s\ntexts, he is employing the methodological assumptions of Ptolemy. \n\nFurther, Bacon’s very close connection of experience and reason\nis influenced by his concerns with medical matters. (Roger Bacon,\nDe erroribus medicorum). This text provides a wider\ndiscussion of Chapter one of Opus maius, Part six. \n\nThe context for Bacon’s writing on topics from the\nMeteorology of Aristotle came from the presence in Paris of\nthe new translation of this work from Greek into Latin. With the\nrecent critical edition of the Aristoteles Latinus version of\nthe Meteorology, it is clear that Bacon is deliberately\noffering a criticism of William of Moerbeke’s translation. Bacon\ncontends that the translations are not adequate and that the\ntranslator did not know the required sciences, especially\nPerspectiva, proposing instead a more accurate mathematical\nanalysis of the phenomenon of the rainbow.\n\nBacon’s own important contribution is to be found in his\ncalculation of the measured value of 42 degrees for the maximum\nelevation of the rainbow. This was probably done with an astrolabe,\nand in this, Bacon advocates the skillful mathematical use of\ninstruments for an experimental science. That Bacon had mathematical\ncompetence in this field can be seen in his account of the halo in the\nOpus tertiium (OQHI) and in his complex arguments in De\nspeculis comburentibus. Bacon takes up Grosseteste’s theory\nof refraction and tries to work out the difficulties in the latter. It\nwould appear at first glance that Bacon is rejecting the notion of\nrefraction out of hand (Lindberg 1966), but in fact he is only\ndemonstrating that refraction as formulated by Grosseteste did not\nmake experimental or rational sense. Bacon knew the rules governing\nthe geometry of refraction. Important here is his emphasis on the role\nof individual drops of water for the process of reflection and\nrefraction. The new research on the De iride of Grosseteste\nby Cecilia Panti and the other editors of the Oxford/Durham Robert\nGrosseteste project will shed much light on these matters. A correct\naccount of the rainbow would be summarized some forty years after\nBacon in the De iride of Theodoric of Freiberg (d. c. 1307)\n[TFT], with his account of a single reflection and double refraction\nin single drops of water. \n\nA second task for experimental science is the discovery by\n‘experience’ alone of instruments (e.g., the armillary\nsphere), new medical cures, chemical discovery, and military\ntechnologies. An important item here is the discovery of magnetism. It\nwould seem that Bacon is reporting on the actual experimental work of\nMagister Petrus Peregrinus (fl. 1260–77), author of De\nmagnete, who is lauded in the Opus tertium as the only\nworthwhile “experimentalist” at Paris (see Silvia Nagel\n2012). Bacon has been lauded down the centuries for his medical\nlearning, but recent scholarship has limited the number of works\nattributed to Bacon. Still, it is important to note that he did draw\non medical practice to set out rules and procedures. Here, the recent\nresearch of Agostino Paravicini-Bagliani (1991, 2000) shows that Bacon\nshared these interests with other outstanding scholars such as Peter\nof Spain (Pope John XXI). The very concept of the ‘prolongation\nof life’ so forcefully proposed by Bacon in his later works\nfound very receptive readers at the Papal Curia in Viterbo. The Papal\nCuria had by 1266 become a center for medical and scientific study.\nThe third task is that of the prognostication of the future on the\nbasis of astronomical/astrological knowledge. This section, depending\non Pseudo-Ptolemy, Centiloquiium and Abu Ma’shar notes\nthat this revelatory divination is earier and more available than the\nmore complex regular astronomy that requires constant observation and\nthe skillful uses of Tables and Instruments. These are not always\nreadily available. \n\nThe conclusion to the De scientia experimentali is important.\nBacon presents the ideal of the “philosophical\nchancellor”who will organize science and its technological\nproducts for the benefit of Res publica Christiana. In this,\nhe is influenced by the important “Mirror of Princes” from\nthe Islamic World, the Sirr-al-‘asrar (Secretum\nsecretorum) (OHI, V). Stewart C. Easton (1952) proposed that this\nwork was the guiding vision for Bacon’s reform of science.\nWilliams (1994) has argued that Bacon completed the edition of this\nwork after his return to Oxford ca. 1280 or a few years before that\ndate. Still, there is much cross reference between this work and\nBacon’s writings in Paris ca. 1266–71.\n\nDavid C. Lindberg (1997) has given a succinct summary of Bacon’s\nmodel for an experimental science [RBS]. He sees four main aspects.\nFirst, Bacon’s perspectival theories were not his own creation.\nHe took the best available materials from Greek and Islamic scholars\nand produced his own synthesis. Second, there is much evidence that\nBacon himself did mathematical work and experiments with visual\nphenomena such as pinhole images and measurement of the visual field.\nThird, as seen above, Bacon correctly calculated the maximum degree of\nelevation for the rainbow. Fourth, the experiments in Bacon,\nespecially in the Perspectiva served “theoretically\nsignificant functions” by supplying observational data that\nrequired explanation in terms of a given optical theory. The usual\nrole of experiment in Bacon is to “confirm, refute, or challenge\ntheoretical claims.”\n\nOne might have expected Bacon to have given equal treatment to\nastronomy, but in this field he was a child of his time. He reports on\nthe accounts of Aristotle, Ptolemy, and Alfraganus (OHI, IV). He\ndiscusses the pros and cons in scholastic, but does not advance the\nfield as he did for Perspectiva. \n5.5 Opus maius/Part Seven: Moralis philosophia\n\nBacon’s Moralis philosophia (= Opus maius, VII\n= RBMP) comprises the philosophy of religion, social philosophy, a\ntheory of the virtues, an astrological-sociology of religion and\ncultures, and an account of argument and rhetoric.\n\nBacon describes the object of moral inquiry as follows: “This\nscience is preeminently active, that is, operative, and deals with our\nactions in this life and the other life” ([RBMP], 3). It is\nfocused on human action. Of course, many human actions deal with\nissues that are the concern of the natural and linguistic sciences.\nBacon notes that these sciences are active and operative but concerned\n“…with artificial and natural works which refer to the\nspeculative intellect, and they are not concerned with those things\nwhich refer to the practical intellect, which is called practical\nbecause it exercises operations of good and evil” ([RBMP],\n3). These works of the human being (operabilia) are\n“…more difficult to know than the objects of speculative\nknowledge.” These include “…the highest truths\nconcerning God and divine worship, eternal life, the laws of Justice,\nthe glory of peace, and the sublimity of the virtues” ([RBMP],\n247). For Bacon, the human ability to deal with these topics is\naffected by a certain corruption of the human will. \n\nMoral science has two parts. The first is speculative, dealing with\nultimate moral truths. The second deals with the process of moral\npersuasion: “The practical part is related to the first part as\nthe curing of the sick and the conserving of health, which are treated\nin practical medicine, are related to that part of medicine which\nteaches what health is…” ([RBMP], 248).\n\nPart one deals with the object and method of morals science and with\nan outline of a philosophical anthropology based on Platonic,\nAristotelian, and Stoic texts in which Bacon argues for an Augustinian\nview of the place of human beings in the world. This includes a\nsection on metaphysical proof for God’s existence. And the\nancient source texts are treated as testifying to the universal\nreligion of Christianity. Part two is a very brief outline of the\nstructure of social life, taken from Avicenna.\n\nPart three, the most substantial in the book, is concerned with virtue\nand vice. Bacon’s own text for this part of the Opus\nmaius still exists and one can see his personal editorial remarks\nin the margins. He did not have time to write a formal treatise, and\nso he presents an anthology of texts from Seneca and excerpts from\nCicero with comment. This is preceded by a brief resume of Aristotle\non the virtues. But it is clear that Bacon favors the image of the\nStoic wise person as his model for virtue. Bacon places great emphasis\non magnanimity as a virtue for the Prince and Prelate. Magnanimity of\nthe greatest of the natural virtues. And it must not be confused with\nChristian humility. This distances Bacon from Bernard of Clairvaux and\nBonaventure. For Bacon, Christian humility has its own distinctive\nrole reflecting the relation of the human to the cosmos and to God.\nAbove all, Bacon is concerned with reproducing as much of the\nAristotelian and Stoic accounts of virtues as possible, and he is\nconcerned with making the Dialogues of Seneca known to Pope\nClement IV. In particular, he is most of all concerned with\nSeneca’s De ira, which he regards as a fundamental text\nfor the moral instruction of princes and prelates. Certainly, Bacon,\nas he does in the Secretum secretorum, presents himself as a\nmoral advisor to Princes. \n\nPart four provides an astrological sociology of human nations or\n“sects”, relying on the moral/political account of\nal-Farabi and on the astrological views of Abu Ma’shar\n(Albumassar). Bacon had a wide knowledge of the world including the\ncustoms of the Mongols, and so he compares Mongol, Jewish, Arab, and\nPagan civilizations.\n\nPart five deals with the role of rhetoric in moral persuasion. Bacon\nis convinced that rhetoric is closely connected with logic, and\nbelieved that the university system failed by teaching only grammar\nand logic (linguistics). The omission from the university curriculum\nof rhetoric and poetics, as found in Aristotle and as interpreted by\nal-Farabi and Averroes, was in Bacon’s view a mistake. He knows\nthe latest translations and remarks:\n\n\nBut al-Farabi has presented to us the meaning of this kind of\nargument, and Avicenna, al-Ghazali, and Averroes have done likewise.\nBecause of this, one ought to present an account of the nature of\npoetic argument, and it falls to logic alone to compose such\na book, since the composition of argumentation pertains to\nlogic alone…The appropriate presentation of this\nargument is found in [my] Moralis philosophia, and in its\nuse, and likewise in theological proofs and doctrines; and in such\nmoral matters, this kind of argument moves a [person] much more than\ndoes a demonstrative argument since it has much greater power. And I\nhave already composed a treatise on this [rhetorical-poetic] argument\nin my works on logic, and I have shown there what is proper\nto this science. ([OHI, XVI], 16–17)\n\n\nHe continues and notes that according to Aristotle and al-Farabi, this\nargument makes use of appropriate language so that the self can be led\nto virtue and to overcome of vice. He then links up the Greek and\nIslamic sources with the regular sources in the Latin tradition such\nas Cicero, Seneca, and Augustine. And he distinguishes carefully\nbetween demonstrative, dialectical, and rhetorical forms of\nargument.\n5.6 Bacon’s Political Philosophy: the Secretum secretorum\n\nBacon devoted considerable time to the study of this work, the Latin\ntranslation of the Arabic work on statecraft in the tradition of\nMirrors for Princes entitled Sirr-al-‘asrar. He worked on\nthe text at Paris and completed the edition of this text with\nintroduction and notes at Oxford after his return there from Paris c.\n1280. This is the most important text on government and the education\nof the Prince prior to the writing of The Prince by\nMachiavelli. The work is divided into four parts. Part one begins with\nthe letter of Alexander to Aristotle and deals with the king’s\nmaintenance of the kingdom. It deals with virtues, largesse, and\ngifts. It is an account of the behavior expected of a King. Part two\ndeals with health care, medicine, and the origins of the sciences.\nPart three deals with alchemy and with the human emotional structure.\nPart four deals with physiognomy and anthropology. Bacon’s\nintroduction is substantial, consisting of seven chapters. It is\nclosely connected with his account of astrology in Opus maius,\npart four, and with scientia experimentalis in part six. His\nsources are mostly Islamic and include the De radiis and De\naspectibus of al-Kindi and the introduction to astrology of Abu\nMa’shar. Bacon proposes a kind of statistical predictive\nastrology, and so has to deal explicitly with the issue of freedom and\ndeterminism. He objects to a kind of infallibilist necessitarianism\nand thinks that provided “possibility” and\n“contingency” can be guarded, one can predict what can\nhappen in nature and in human society (due to the effects of the\nelements on temperament) in a general manner. Thus, the ruler will\nhave need of the astrologer who will function as a kind of doctor,\npsychologist, sociologist, and political theorist. This is a far cry\nfrom a contemplative ethics. It is significant that in the work\nentitled Errores philosophorum ascribed to Giles of Rome, a\ncontemporary of Bacon at Paris, many of Bacon’s sources are\nseverely criticized. In the De regimine principium (1280s),\nGiles, unlike Bacon, provides a moral education for the prince that is\nentirely based on Greek and Latin sources, especially on\nAristotle.\n\nThe idea of secrecy and secret books associated with Roger Bacon\ncontinued into the Renaissance (Kavey 2007), with the depiction of\nRoger Bacon on stage in a drama by Robert Greene.\n6. Conclusion\n\nIt will be clear from this account that Roger Bacon was an important\nteacher of the Arts at Paris in the 1240s. He was ahead of his time in\nthe vigorous manner in which he integrated the new Aristotle with the\ntraditional Latin traditions of grammar and logic. He taught for a\nlong period in the Arts. He later called himself an expert in the\nphilosophy of Aristotle as interpreted by Avicenna and Averroes. And\nwe should also add Avicebron (Solomon Ibn Gabirol). By 1248–49 he\nseems to have become an independent scholar. He then, it would seem,\nreturned to England, where, under the influence of Adam Marsh, friend\nof Robert Grosseteste, Bishop of Lincoln, he was attracted to\ninterests associated with both scholars: language study including the\nlearning of ancient languages, experimental concerns such as optics\nand experimental science, and a renewed critical study of the text of\nScripture. When Bacon returned to Paris in the 1250s, he was to oppose\nwhat had become a profound change in the methodology of university\nlearning, that is, the introduction of the\n“Sentence-Method” into the study of theology. For Bacon,\nthis was a destruction of practices that he associated with Robert\nGrosseteste. Taking up the flag of the Bishop of Lincoln (d. 1253), he\nbecame the great critic of the Parisian mode of doing philosophy and\ntheology. As we saw above, Bacon was already by 1266 very concerned\nwith the new heterodox interpretations of Aristotle found in the\nFaculty of Arts. His later works for Pope Clement IV must be read in\nthe context of the Parisian debates on Latin Averroism\n(1266–1277).\n\nThe later Roger Bacon has a good knowledge of the geography and\nhistory of the world and an awareness of geo-politics. In this\ncontext, he devoted much time to the important work on the education\nof the Prince, the Secretum secretorum. He may have returned to\nOxford c. 1280, if not before. There, he completed his edition, with\nnotes and introduction, of this work. In his last work, the\nCompendium studii theologiae (c. 1292), he repeats some of the\nmain arguments from the 1260s against Richard Rufus of Cornwall. Roger\nBacon sets out themes in his philosophy of language, philosophy of\nnature, and moral philosophy and theology that would influence\nfourteenth century writers such as Duns Scotus and William of Ockham,\namong others. Jeremiah Hackett examines the influence of Roger Bacon\non the philosophy of mind in John Pecham (Hackett 2018c).\nBacon’s influence on the fourteenth century has been documented\nby Katherine H. Tachau (1988). He is much more important for the\nphilosophy of the thirteenth and fourteenth centuries than has\nhitherto been recognized. The editors of Peter of John Olivi on matter\nhave noted the appropriation by Olivi of Bacon’s teaching on\nmatter. Doninique Demange and Yael Kedar have demonstrated Peter John\nOlivi’s critical appropriation of Bacon’s theory of Vision\nand his natural philosophy (Demange & Kedar, 2020). Jeremiah\nHackett (2018a) has suggested that in the early to mid-1260s, Olivi\nmay have been the Iuvenis Johannes, Bacon’s star student.\nRecently, Mattia Montovani has written a very important study on the\nimportance of Bacon’s theory of vision for the new Cartesian\ndiscussions of vision in the early 17th century. It is a study of\nmajor significance for the influence of Bacon on early modern\nphilosophy. (Montovani 2020) As noted above, the newly formed\nRoger Bacon Research Society will in the near future do much\nto further the study of the scientific, philosophical and theological\nworks of Roger Bacon. \n",
    "bibliography": {
        "categories": [
            "<a id=\"PriSou\">Primary Sources</a>",
            "<a id=\"SecSou\">Secondary Sources</a>"
        ],
        "cat_ref_text": {
            "<a id=\"PriSou\">Primary Sources</a>": [
                "</h3>\n<h4>Roger Bacon’s Work</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>",
                "[OQHI]",
                "<em>Opera quaedam hactenus inedita</em> (=<em>Opus\ntertium, Opus minus, Compendium studii philosophiae, Epistola de\nsecretis operibus Artis et Naturae, et de nullitate Magiae)</em>, ed.\nJ. S. Brewer, London, 1859; reprint 1965, Nendeln, Lichtenstein:\nKraus. </tr>\n<tr>",
                "[OMB]",
                "<em>Opus maius, 3 Vols</em>., ed. John Henry\nBridges, Oxford and Edinburgh. (Vols. 1 &amp; 2, Oxford 1897; Vol. 3\nwith corrections, Edinburgh, 1900; reprint, Frankfurt: Minerva,\n1964). </tr>\n<tr>",
                "[UFRB]",
                "F. Gasquet, “An Unpublished Fragment of Roger\nBacon,” in <em>The English Historical Review</em>, 1894,\n495–517; <em>Epistola Fratris Rogeri Baconi</em>, ed. and trs.,\nP. E. Bettoni, Milan, 1964. </tr>\n<tr>",
                "[GGHG]",
                "<em>The Greek Grammar of Roger Bacon and a Fragment\nof His Hebrew Grammar</em>, ed. Edmund Nolan and S. A. Hirsch,\nCambridge University Press, 1902. </tr>\n<tr>",
                "[OTFD]",
                "<em>Opus tertium: Fragment</em>, ed. Pierre Duhem,\nQuarrachi, 1909. </tr>\n<tr>",
                "[OHI]",
                "<em>Opera hactenus inedita</em> (Vol. I-XVI), ed.\nRobert Steele, Oxford, 1909–1940. </tr>\n<tr>",
                "[CSTR]",
                "<em>Fr. Rogeri Bacon Compendium Studii\nTheologiae</em>, ed. Hastings Rashdall, Aberdeen University Press,\n1911. </tr>\n<tr>",
                "[OTFL]",
                "<em>Part of the Opus tertium of Roger Bacon,\nincluding a Fragment Now Printed for the First Time</em>, ed. Arthur\nGeorge Little, Aberdeen University Press, 1912; reprint, Farnborough,\nU.K.: Gregg Press, 1966. </tr>\n<tr>",
                "[WFB]",
                "<em>The Works of Francis Bacon</em>, ed. J.\nStebbing, R. L. Ellis, D. D. Heath, London: Longmans, 1870; reprint,\nGarrett Press Inc., New York, NY, 1968. </tr>\n<tr>",
                "[TUIA]",
                "Thomas Aquinas, <em>Tractatus de unitate\nintellectus contra Averroistas</em>, ed. Leo W. Keeler, Rome:\nGregorianum, 1946. </tr>\n</table>\n<h4>Modern Critical Editions</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>",
                "[RBMP]",
                "<em>Rogeri Baconis Moralis Philosophia</em>, ed.\nEugenio Massa, Zurich: Thesaurus Mundi, 1953. </tr>\n<tr>",
                "[DS]",
                "“An Unedited Part of Roger Bacon’s\n‘<em>Opus maius’: ‘De signis</em>,’” ed.\nK. M. Fredborg, Lauge Nielsen, Jan Pinborg, <em>Traditio</em> 34\n(1978), 75–136. </tr>\n<tr>",
                "[SD]",
                "<em>Summulae dialectices</em>, ed. Alain de Libera,\n“Les <em>Summulae dialectices</em> de Roger Bacon,”\n<em>Archives d’Histoire Doctrinale et Littéraire du Moyen\nAge</em> 53 (1986): 139–289, 54 (1987): 171–278.\n</tr>\n<tr>",
                "[CSTM]",
                "<em>Compendium studii theologiae</em>, ed. Thomas\nS. Maloney, Leiden: Brill, 1988. </tr>\n<tr>",
                "[DMP]/[DSC]",
                "<em>De multiplicatione specierum</em> and <em>De\nspeculis comburentibus</em>, ed., David C. Lindberg, Oxford: Clarendon\nPress, 1983. </tr>\n<tr>",
                "",
                "Thomas S. Maloney, Compendium of the Study of Philosophy, Oxford\nUniversity Press for The British Academy, 2018 [Auctores Britannici\nMedii Aevi, 32]</tr>\n<tr>",
                "",
                "Nikolaus Egel, Edition and Translation, Roger Bacon: Opus\nTertium, Hamburg: Felilx Meiner Verlag, 2019.</tr>\n<tr>",
                "[TFT]",
                "Theodoric of Freiberg, <em>Tractatus de iride et de\nradialibus impressionibus</em>, eds. L. Sturlese/M.R.\nPagnoni-Sturlese, in <em>Corpus Philosophorum Teutonicorum Medii\nAevi</em>, II, 4, 1985, 95–286. </tr>\n<tr>",
                "[PRSP]",
                "<em>Perspectiva</em>, ed. David C. Lindberg,\nOxford: Clarendon Press, 1996. </tr>\n</table>\n<h4>Translations</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>",
                "[MOA]",
                "Stanton J. Linden, <em>The Mirror of Alchemy</em>,\nNew York: Garland Press, 1992. </tr>\n<tr>",
                "[TTUM]",
                "Thomas S. Maloney, <em>Three Treatments of\nUniversals by Roger Bacon</em>, Binghamton, New York: MARTS,\n1989. </tr>\n<tr>",
                "[RBASL]",
                "Thomas S. Maloney, <em>Roger Bacon: The Art and Science of\nLogic</em>, Toronto: PIMS, 2009. </tr>\n<tr>",
                "[RBOS]",
                "Thomas S. Maloney, <em>Roger Bacon: On Signs</em>, Toronto:\nPIMS, 2013. </tr>\n<tr>",
                "",
                "Nilolaus Egel and Katherina Molner, Roger Bacon: Opus maius,\nHamburg: Felix Meiner Verlag, 2017.</tr>\n<tr>",
                "",
                "Nikolaus Egel, Roger Bacon: Kompendium fur das Studium der\nPhilosophie, Hamburg: Felix Meiner Verlag, 2015.</tr>\n<tr>",
                "",
                "Pia A. Antilic-Piper, Opus Maius (Selected Texts), Latin-German,\nFreiburg-Basel-Wein: Herder Verlag, 2008.</tr>\n<tr>",
                "",
                "V.Sorge and F. Seller, Filosofia, scienza, theologia dall’\nOpus Maius, Rome: Armando Editore, 2010.</tr>\n<tr>",
                "",
                "Francesco Bottin, Ruggero Bacone: La Scienze\nSperimentale-Lettere a Clement IV- I Segreti Dell’Arte E Della\nNatura, Milan: Rusconi, 1990. </tr>\n<tr>",
                "",
                "Carlos Arthuro R. Do Nascimento et al., <em> Rogerio Bacon,\nObras Escolhides</em>, Porto Alegre, Braganca Publista, 2006.\n</tr>\n</table>\n<h4>Richard Rufus of Cornwall</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>",
                "[IPA]",
                "Richard Rufus of Cornwall, <em>In Physicam\nAristotelis</em>, Rega Wood (ed.), Oxford University Press, for The\nBritish Academy, (ABMA, XVI), 2003; See Stanford University Richard\nRufus of Cornwall Website, Dir. Rega Wood </tr>\n</table>\n<h3>"
            ],
            "<a id=\"SecSou\">Secondary Sources</a>": [
                "</h3>\n<ul class=\"hanging\">",
                "Adamson, Robert, 1876, <em>Roger Bacon: The Philosophy of Science\nin the Middle Ages</em>, Manchester.",
                "Anheim, E., et al., 2001, “Exégé\njudéo-chrétienne, magie et linguistique: un recueil de\nnotes inédites attribuées à Roger Bacon,”\n<em>AHDLMA</em>, 68: 95–154.",
                "Augustine, <em>De Dialectica</em>, B. Darrell Jackson (trans.),\nDordrecht: D. Reidel, 1975.",
                "–––, <em>De doctrina Christiana</em> (Corpus\nChristianorum Series Latina: 32), K.D. Daur and Joseph Martin (eds.),\nTurnhout: Brepols, 1962.",
                "Bernardini, Paola, 2014, “Temporibus autem meis.\nTheologian’s Errors with Regard to the Human Soul in Roger\nBacon’s Communia Naturalium,” in Bernardini and Rodolfi\n(eds.) 2014, 139–158.",
                "Bernardini, Paola and Anna Rodolfi (eds.), 2014, <em>Roger\nBacon’s</em> Communia Naturalium: <em>A 13th-Century\nWorkshop</em> (Micrologus’ Library: Volume 64), Florence:\nSismel–Edizione del Galuzzo.",
                "Bourgain, P., 1989, “Les sens de la langue et des langues\nchez Roger Bacon,” in G. Contamine (ed.), <em>Traduction et\ntraducteurs au moyen age</em>, Paris, 317–29.",
                "Courtenay, W. J., 2009, “Franciscan Learning: Univeresity\nEducation and Biblical Education,” in M. F. Cusato &amp; G.\nGeltner (eds.), <em>Defenders and Critics of Franciscan Life: Essays\nin Honor of John V. Fleming</em>, Leiden: Brill, 55–64.",
                "Crisciani, C., 2006, “Tra Dio, intelletto ed esperienza:\naspetti di Segreto nell’ Alchimia latina (secoli\nXIII-XIV),” Firenze, <em>Micrologus Library</em>, 14:\n193–204.",
                "–––, 2014, “Universal and Particular in\nthe Communia Naturalium: Between (Extreme Realism) and\n(Experientia),” in Bernardini and Rodolfi (eds.) 2014,\n57–82",
                "Crisciani, C. and Michela Pereira, 2014, “Introduction to\nthe Philosopher’s Laboratory”, in Bernardini and Rodolfi\n(eds.) 2014, 1–26.",
                "Crombie, A. C., 1953, <em>Robert Grosseteste and the Origins of\nExperimental Science, 100–1700</em>, Oxford: Clarendon Press.\n(Groundbreaking but controversial work on the methodological\ncontinuities between medieval and modern science.)",
                "Crombie, A. C. &amp; John North, 1970, “Roger Bacon,”\nin <em>Dictionary of Scientific Biography</em> I, New York, Scribners,\n377–85.",
                "Crowley, Theodore, 1950, <em>Roger Bacon: The Problem of the Soul\nin his Philosophical Commentaries</em>, Louvain/Dublin, 1950. (A study\nof Bacon’s philosophical psychology.)",
                "De Libera, Alain, 1990, “De la logique à la\ngrammaire: Remarques sur la théorie de la <em>determinatio</em>\nchez Roger Bacon et Lambert d’Auxerre (Lambert de Lagny),”\nin G. Bursill-Hall, S. Ebbesen &amp; K. Koerner, eds. <em>De\ngrammatica. A Tribute to Jan Pinborg</em>, Amsterdam: John Benjamins\nPublishing Company, 209–226 (Studies in the History of the\nLanguage Sciences, 43).",
                "–––, 1991, “Roger Bacon et la reference\nvide. Sur quelques antecedents médiévaux du paradoxe de\nMeinong,” in J. Jolivet, Z. Kaluza, A. De Libera (eds.),\n<em>Lectionem varietates: Homages á Paul Vignaux</em>, Paris:\nJ. Vrin, 85–120.",
                "–––, 1997, “Roger Bacon et la\nlogique” in Hackett 1997a, pp. 103–132.",
                "Del Punta, F., Donati, S., Trifogli, C., 1996, “Commentaries\non Aristotle’s <i>Physics</i> in Britain, ca.\n1250–1270,” in John Marenbon (ed.), <em>Aristotle in\nBritain in the Middle Ages</em>, Turnhout, 265–83.",
                "Demange, Dominique, 2016, “Olivi et les Perspectivi: Les\nSources de la theorie Olivienne de la Vision” in\n<em>OLIVIANA</em>, 5 (2016).",
                "–––, 2020, “Physical action, species and\nmatter: The debate between Roger Bacon and Peter John Olivi”\n<em>Journal for the History of Philosophy</em>, 58: 49–59.",
                "Donati, Silvia, 1997, “The Anonymous Questions on Physics\nII-IV of MS Philadelphia, Free Library, Lewis Europ. 53 (ff.\n71ra-85rb) and Roger Bacon,” in Hackett 1997b,\npp. 177–221.",
                "–––, 2013, “Pseudopigrapha in the Opera\nhactenus inedita Rogeri Baconi: The Commentaries on the Physics and on\nthe Metaphysics,” in O. Weijeers and J. Verger, <em>Les debuts\nde l’enseignement universitaire a Paris (1200–1245\nenviron)</em>, Turnhout: Brepols, <em>Studia Artistarum</em>, 38:\n153–203.",
                "Denery, D. G., II, 2005, <em>Seeing and Being Seen in the Later\nMedieval World: Optics, Theology and Religious Life</em>, Cambridge\nUniversity Press.",
                "Duhem, Pierre, 1915, <em>Le Système du Monde: Histoire des\nDoctrines Cosmologiques de Platon à Copernic</em>, T. III.",
                "Easton, Stewart C., 1952, <em>Roger Bacon and His Search for a\nUniversal Science: A Reconsideration of the Life and Work of Roger\nBacon in the Light of His Own Stated Purpose</em>, New York: Columbia\nUniversity Press. (An overview of the later Bacon’s\nphilosophical vision with specific emphasis on the influence of the\n<em>Secretum secretorum</em>.)",
                "Ebbesen, Sten, 1979, “The Dead Man is Alive,”\n<em>Synthese</em> 40 (January): 43–70",
                "Eco, Umberto, 1989, “Denotation,” in Umberto Eco and\nConstantion Marmo (eds.), <em>On The Medieval Theory of Signs</em>,\nAmsterdam/Philadelphia: John Benjamins Publishing Company.",
                "Finkenberg, Frank, 2007, <em>Ancilla theologiae? Theologie und\nWissenschaften bei Roger Bacon</em>, Mönchen Gladbach",
                "Gracia, Jorge J.E., 1991, “The Centrality of the Individual\nin the Philosophy of the Fourteenth Century,” <em>History of\nPhilosophy Quarterly</em>, 8: 235–51.",
                "Grèvin, B., 2001, “L’hébreu des\nfranciscains: Nouveaux éléments sur la connaissance de\nl’hébreu en milieu Chrétien au xiiie\nsiècle,” <em>Médiévales</em>, 70(1):\n65–82.",
                "–––, 2003, “Entre Magie et\nSémiotique: Roger Bacon et les caractères\nchinois,” <em>Recherches de Théologie et Philosophie\nmédiévales</em>, 41: 65–82.",
                "Gueret-Laferte, Michele, 1998, “Le voyager et le geographie:\nl’insertion dela relation voyage de Guillaume de Rubrouck dans\nl’opus maius de Roger Bacon,” in <em>La geographie au\nMoyen-Age. Espaces penses, espaces vecus, espaces reves</em>,\n<em>Perspectives Medievales</em> (Supplement), 24: 81–96.",
                "Hackett, Jeremiah (ed.), 1997a, <em>Roger Bacon and the Sciences:\nCommemorative Essays</em>, Leiden: Brill. (This is a comprehensive\nreview of the various sciences commented on by Roger Bacon. For\nscience, see Molland on Bacon’s mathematics, Hackett on\nastrology and <em>scientia experimentalis</em>, Woodward &amp; Howe on\ngeography/cartography, Van Deusen on music, Lindberg on light, vision\nand the universal radiation of force, Newman on alchemy, Getz on Roger\nBacon and medicine, Williams on the <em>Secretum\nsecretorum</em>.)",
                "––– (ed.), 1997b, <em>Roger Bacon and\nAristotelianism</em>, special issue, <em>Vivarium</em>, 35(2),\nSeptember. (This is a study of Bacon’s contribution to the\nreception of Aristotle. See essays by Marmo, Trifolgi, Donati, wood,\nNooone, Long, Hackett.)",
                "–––, 2005, “Roger Bacon and the\nReceptionof Aristotle in the Thirteenth Century: An Introduction to\nHis Criticism of Averroes,” in Ludger Honnefelder, Ludger,\nWood,Rega, Dreyer, Mechthild, Aris, Mark Aeilko, eds. 2005,\n<em>Albertus Magnus and the Beginnings of the Medieval Reception of\nAristotle in the Latin West</em>, Münster: Aschendorff Verlag,\n219–248.",
                "–––, 2006, “Experience and Demonstration\nin Roger Bacon: A Critical Review of Some Modern\nInterpretations,” in Alexander Fidora &amp; Matthias\nLutz-Bachmann eds., <em>Erfahrung und Beweis: Die Wissenschaften von\nder Natur im 13. und 14. Jahrhundert</em> / <em>Experience and\nDemonstration: The Sciences of Nature in the 13<sup>th</sup> and\n14<sup>th</sup> Centuries</em>, Berlin: Akademie Verlag, 41–58\n(Wissenkultur und gesellschaftlicher Wandel 14).",
                "–––, 2011, “<em>Ego Expertus\nSum</em>:Roger Bacon’s Science and the Origins of\nEmpiricism,” in Thomas Bènatouïl &amp; Isabelle\nBraelants (eds.),<em>Expertus sum. L’expèrience par les\nsens dans la philosophie naturelle médiévale</em>,\n<em>Micrologus Library</em>, 40, 145–73.",
                "–––, 2012, “Experience, Experimentum and\nScience in Roger Bacon and Martin Heidegger: From Medieval to Modern\nScience” in Alia Mensching-Estakhr and Michael Städtler\n(eds.), <em>Wahrheit und Geschichte: Die gebrochene Tradition\nmetaphytsischen Denkens: Festschrift zum 70. Geburtstqg von\nGüunther Mensching</em>, Koenighausen und Neumann, 315\n–328.",
                "–––, 2013a, “Roger Bacon on Animal\nKnowledge in the <em>Perspectiva</em>,” in Luis Xavier\nLòpez-Farjeat &amp; Jörg Alejandro Tellkamp (eds.),\n<em>Philosophical Psychology in Arabic Thought and The Latin\nAristotelianism of the 13th Century</em>, Paris: Vrin,\n23–42.",
                "–––, 2013b, “Astrology and the Search for\nan Art and Science of Nature in the 13th Century,” in G.\nMarchetti, O. Rignani, V. Sorge (eds.), <em>Ratio and superstitio:\nEssays in Honor of Graziella Federici Vescovicini</em> (Proceedings of\nthe Hannover Medieval Philosophy Symposium 2011), TEMA,\nLovain-La-Neuve, 117–136..",
                "–––, 2016, “From <em>Sapientes\nantique</em> at Lincoln to the New <em>Sapientes moderni</em> at paris\nc. 1260–1280: Roger Bacon’s Two Circles of\nScholars,” in Jack P. Cunningham and Mark Hocknull\n(eds.), <em>Robert Grosseteste and the pursuit of Religious and\nScientific Learning in the Middle Ages</em>, Springer, 2016,\n119–142.",
                "–––, 2018a, “Bacon and His First\nInterpreter, The Anonymous Iuvenis Iohannes,” in Cecilia Panti e\nNicola Polloni, <em>Vedere nell’ Ombra: Studi su\nNatura,Spiritualita e Scienze operativa offerti a Michela Pereira</em>\n(Micrologus Library: 90), Firenze: SISMEL, 179–192.",
                "–––, 2018b, “Roger Bacon and Peter John\nOlivi on the Status of the Philosophers,” in Luca Bianchi,\nOnorato Grassi, Cecilia Panti, Editors, <em>Edizioni, Traduzioni et\nTradizioni Filosofiche (Secoli XII-XVI): Studi Per Pietro B.\nRossi</em>, Arcane Editrice, Vol.II, 557–572.",
                "–––, 2018c, in Guünther Mensching and Alia\nMensching–Estakhr, “Agent Intellect and Intelligile\nSpecies in Roger Bacon and John Pecham”<em>Die Seele im\nMittelalter: Von der Substance zum funktionalen system</em>\n(Contradictio, Band 16), Würzburg: Königshausen and Neumann,\n149–168.",
                "Hedwig, Klaus, 2000, “Roger Bacon’s <em>Scientia\nexperimentalis</em>,” in Theo Kobush (ed.), <em>Philosophen des\nMittelalters</em>, Darmstadt: Primus, 140–51.",
                "Hochberg, Herbert, 1953, “The Empirical Philosophy of Roger\nand Francis Bacon,” <em>Philosophy of Science</em>, 20:\n313–326.",
                "Johnson, Timothy J., 2009, “Back to Bacon: Dieter Hattrup\nand Bonaventure’s authorship of the <em>De\nreductione</em>,” <em>Franciscan Studies</em>, 67:\n133–47.",
                "–––, 2009, “Roger Bacon’s Critique\nof Franciscan Preaching,” in F. J. Felten, A. Kehnel, S.\nWeinfurter (eds.), <em>Institution and Charisma: Festschrift für\nGert Melville</em>, Vienna, 541–48.",
                "–––, 2010, “Preaching Precedes Theology:\nRoger Bacon and the Failure of Mendicant Education,”\n<em>Franciscan Studies</em>, 68: 83–95.",
                "–––, 2012, <em>Franciscans and Preaching</em>,\nLeiden: Brill Academic Publishers.",
                "–––, 2014, “Place, Analogy, and\nTranscendence, Bonaventure and Bacon on the Franciscan Relation to the\nWorld”, in Gert Melville, et al., <em>Innovationen durch Deuten\nund Gestalten. Kloster im Mittelalter zwischen Jenseits und Welt</em>,\nRegensburg, 83–96.",
                "–––, 2013, “Franciscan Bodies and Souls:\nBonaventure and Bacon on Scripture, Preaching and the Cura\nVitae,” <em>Franciscan Preaching</em>, Leiden: Brill,\n73–89.",
                "–––, 2013, “That They May Love the Faith:\nRoger Bacon on Culture, Language and Religion,” in <em>From La\nFlorida to La California: Franciscan Evangelization in the Spanish\nBorderlands</em>, SanFrancisco: Academy of American Franciscan\nHistory, 23–33.",
                "–––, 2014, “Hermeneutica biblica y la cura\ncorporis – cura animae franciscana segun Buenaventura y\nbacon,” in Geraldo Losada trs., in <em>El cuidado del la vida:\nDel medievo al Renacimento</em>, Carlos Ruta (ed.), Buenos Aires:\nUnsamedita, 109–127.",
                "–––, 2017, “Wisdom ha built her house; she\nhas set up seven pillars: Roger Bacon, Franciscan Wisdom, and\nConversion to the Sciences,” in Michael Robson, ed., <em>The\nEnglish Province of Franciscans</em> (1224–c.1350), Leiden:\nBrill, 296–315.",
                "Kavey, Allison, 2007, “Roger Bacon, Robert Greene’s\nFriarBacon and the Secrets of Art and Nature,” in AllisonKavey,\n<em>Books of Secrets: Natural Philosophy in England,\n1550–1600</em>, University of Illinois Press, 32–58.",
                "Kedar, Yael, 2008, <em>Species as Signs: Roger Bacon (1220–1292)\non Perspectiva and Grammatica</em>, Ph.D. Dissertation, University of\nHaifa.",
                "–––, 2009, “The Intellect Naturalized:\nRoger Bacon on the Existence of Corporeal Species within the\nIntellect,” in <em>Early Science and Medicine</em>, 14:\n131–157.",
                "–––, 2016, “The Nomological Image of\nNature: Explaining the Tide in the Thirteenth Century,” in\n<em>Annals fo Science</em>, 73: 68–88.",
                "Kedar, Yael, 2017, “Roger Bacon (c.1220–1292) and his System\nof Laws of Nature: Classification, Hierarchy and Significance,”\nin <em> Perspectives on Science</em>, 26: 719–745.",
                "Kedar, Yael, with Giora Hon, 2017, “‘Natures’\nand ‘Laws’: the Making of the Concept of Law of Nature:\nRobert Grosseteste 9c.1168–1253) and Roger Bacon\n(1214/20–1292),” <em>Studies in the History and Philosophy\nof Science</em> (Part A), 61: 21–31.",
                "Kedar, Yael and Dominique Demange, 2020, “Physical action,\nspecies and matter: The debate between Roger Bacon and Peter John\nOlivi” in <em>Journal for the History of Philosophy</em>, 58:\n49–59.",
                "King, Peter, 2003, “Two Conceptions of Experience,”\n<em>Medieval Philosophy and Theology</em>, 11: 203–226.",
                "Koyré, A., 1957, “The Origins of Modern Science: A\nNew Interpretation,” <em>Diogenes</em>, 4: 421–48.",
                "Kraml, Hans, 1994, “Roger Bacon’s Theory of the\nRainbow as a Turning Point in Pre-Galiliean Theory of Science”,\nin Georg Meggle and Ulla Wessels (eds.), <em>Anlalyomen I</em>,\nBerlin, New York, 353–361.",
                "Kuhn, Thomas S., 1976, “Mathematical vs. Experimental\nTraditions in the Development of Physical Science,” <em>Journal\nof Interdisciplinary History</em>, VII-1 (Summer, 1976), 1-31.",
                "Lambertini, Roberto; romana Martorelli Vico, 2014, “Are\nthere more Versions of the Communia Naturalium? Soundings of the\nManuscript Tradition,” in Bernardini and Rodolfi (eds.) 2014,\n35–56.",
                "Light, L., 2001, “Roger Bacon and the Origin of the Paris\nBible,” <em>Revue Benedictine</em>, 3(3–4):\n483–507.",
                "Lindberg, David C., 1966, “Roger Bacon’s Theory of the\nRainbow: Progress or Regress,” <em>Isis</em>, 57:\n235–49",
                "–––, 1971, “Lines of Influence in\nThirteenth Century Optics: Bacon, Witelo, and Pecham,”\n<em>Speculum</em>, 46 (January 1971): 66–83.",
                "–––, 1978, <em>Theories of Vision from Al-Kindi\nto Kepler</em>, Chicago: University of Chicago Press.",
                "–––, 1983, <em>Studies in the History of\nMedieval Optics</em>, London: Variorum Reprints.",
                "–––, 1997, “Roger Bacon on Light, Vision,\nand the Universal Emanation of Force,” in Hackett 1997a, pp.\n243–276.",
                "Little, A. G., 1914, <em>Roger Bacon Essays</em>, Oxford:\nClarendon Press. (These essays, some on Bacon’s science, are\nstill valuable).",
                "Maloney, Thomas S., 1983a, “The Semiotics of Roger\nBacon,” <em>Medieval Studies</em>, 45: 120–154;",
                "–––, 1983b, “Roger Bacon on the\n<em>Significatum</em> of Words,” in <em>Archéologie du\nsigne</em>, Lucie Brind’Amour and Eugene Vance (eds.), Toronto:\nPIMS, 187–211.",
                "–––, 1984, “Roger Bacon on\nEquivocation,” <em>Vivarium</em>, 22: 85–112.",
                "–––, 1985, “The Extreme Realism of Roger\nBacon,” <em>Review of Metaphysics</em>, 38 (June):\n807–837.",
                "–––, 1995, “Is the <em>De doctrina\nChristiana</em> the source for Bacon’s Semiotics,” in\nEdward D. English (ed.), <em>Reading and Wisdom: The ‘De\ndoctrina Christiana’ of Augustine in the Middle Ages</em>, Notre\nDame &amp; London: University of Notre Dame Press, 126–42.",
                "–––, 2002, “Roger Bacon on the Division of\nStatements into Single/Multiple and Simple/Compound,” <em>The\nReview of Metaphysics</em>, 56: 321–56.",
                "Mantovani, Mattia, 2020, “Visio per sillogismum. Sensation\nand Cognition in 13th Century Theories of Vision,” in Elena\nBaituta, ed.<em>Medieval Perceptual Puzzles: Theories of Perception in\nthe 13th and 14th Centuries</em>, Leiden: Brill, 111–152.",
                "Marmo, Costantino, 1997, “Bacon, Aristotle (and all the\nothers) on Natural Inferential Signs,” in Hackett 1997b, pp.\n136–154.",
                "Marrone, Steven P., 2001, <em>The Light of Thy Countenance:\nScience and Knowledge of God in the 13th Century</em> (Volume I: A\nDoctrine of Divine Illumination), Leiden: Brill.",
                "Matthews, Gareth B., 1978, “A Medieval Theory of\nVision,” in Peter K. Machamer &amp; Robert G. Turnbull (eds.),\n<em>Studies in Perception: Interrelations in the History of Philosophy\nand Science</em>, Columbus: Ohio State University Press, 1978,\n186–199.",
                "Mensching, Günther, 2009, <em>Roger Bacon</em>, Münster:\nAschendorff.",
                "Molland, A. G., 1974, “Roger Bacon as Magician,”\n<em>Traditio</em>, 50: 445–460.",
                "–––, 1983, “Roger Bacon and the Hermetic\nTradition in Medieval Science,” <em>Vivarium</em>, 31:\n140–160.",
                "–––, 1996, “Roger Bacon’s <em>De\nlaudibus mathematicae:</em> a preliminary study,” in E. Sylla\n&amp; M. McVaugh (eds.), <em>Texts and Contexts in Ancient and\nMedieval Science: Studies on the Occasion of John E. Murdoch’s\nSeventieth Birthday</em>, 68–83.",
                "–––, 1996, “Roger Bacon’s\nAppropriation of Past Mathematics,” in F. J. Ragep, S. P. Ragep,\nand S. Livesey (1996), 347–65.",
                "–––, 1996a, “The Role of Aristotle in the\nEpistemological Schemata of Roger Bacon and Thomas Bradwardine,”\nin J. Marenbon (ed.), <em>Aristotle in Britain During the Middle\nAges</em>, Brepols, 285–97.",
                "–––, 1997, “Roger Bacon’s Knowledge\nof Mathematics,” in Hackett 1997a, pp. 151–174.",
                "–––, 2004, “Roger Bacon,” <em>Oxford\nDictionary of National Biography</em> (Volume I), H. C. G Matthew and\nBrian Harrison (eds.), Oxford: Oxford University Press.",
                "Nagel, Sylvia, 2012, “Pietro Peregrino, il sapiens-simplex\neccelente di Ruggero Bacon,” <em>I Francescani E Le\nScienze</em>, Spoleto:Centro Italiano Di Studi Sull’Alto\nMedioevo, 2012, 19–47.",
                "Newhauser, Richard, 2001, “<i>Inter Scientiam et\nPopulum</i>: Roger Bacon, Pierre de Limoges and the <em>Tractatus\nmoralis de oculo</em>,” in J. A. Aertsen, K. Emery, Jr., and A.\nSpeer (eds.), <em>Nach der Verurteilung Von 1277. Philosophie und\nTheologie an der Universität von Paris im letzten Viertel des 13.\nJahrhunderts. Studien und Texte/After the Condemnation of 1277</em>\n(Philosophy and Theology at the University of Paris in the Last\nQuarter of the 13<sup>th</sup> Century. Studies and Texts),\n<em>Miscellanea Medievalia</em>, 28: 682–703.",
                "Newhauser, Richard, 2012, <em>Peter of Limoges: The Moral Treatise\non the Eye</em>,Toronto: PIMS.",
                "Newman. R., 1994, “The Alchemy of Roger Bacon and the\n<em>Tres epistolae</em> attributed to Him,” in <em>Comprendre et\nmaitriser la nature au moyen age: mélanges d’histoire\nofferts à Guy Beaujouan</em>, Geneva.",
                "Oliver, Simon, 2004, “Roger Bacon on Light, Truth and\n<i>Experimentum</i>,” <em>Vivarium</em>, 42/2:\n151–180.",
                "Panti, Cecilia, 2014, “Natural Continuity and Mathematical\nProofs against Indivisibilism in Roger Bacon’s De Celestibus\n(Communia Naturalium, II),” in Bernardini and Rodolfi (eds.)\n2014, 159–190.",
                "–––, 2016, “The Theological Use of Science\nin Robert Grosseteste and Adam Marsh according to Roger Bacon: The\nCase Study of the Rainbow,” in Jack P. Cunningham and Mark\nHocknull, eds., <em>Robert Grosseteste and the pursuit or Religious\nand Scientific Learning in the Middle Ages</em>, Springer Verlag,\n143–164.",
                "–––, 2017, “NON ABEST NEC DISTAT:PLACE AND\nMOVEMENT OF ANGELS ACCORDING TO ROBERT GROSSETESTE, ADAM MARSH AND\nROGER BACON,” in Tiziana Suarez-Nani, Olivier Ribordy, Antonio\nPetagine, <em>Lieu, Mouvement: Physique, Metaphysique Et Cosmologie\n(Xiie-XVIe Siecles)</em>, Barcelona-Rome, 57–78.",
                "Panti, Cecilia and Greti Dinkova-Brunn, 2018, “Robert\nGrosseteste’s De irids and its addendum in the Vatican\nManuscript Barb. Lat. 165: Transmission, Reception, Meaning,” in\nStella Panayotova and Paola Ricciardi, eds., <em> Manuscripts in the\nMaking</em> <em>Art and Science</em>, Volume II, 23–31",
                "Paravicini Bagliani, A., 1987, “Ruggero Bacone, autore del\n<em>De ratardatione accidentium senectutis?</em>,” in <em>Studi\nMedievali</em>, 3<sup>rd</sup> ser., 28: 707–28.",
                "–––, 1991, <em>Medicina e scienze della natura\nalla corte dei papi nel Ducento</em>, Spoleto.",
                "–––. 2000, <em>The Pope’s Body</em>,\nChicago: University of Chicago Press.",
                "–––, 2001, <em>Le Speculum Astronomiae, un\nenigme? Enquete sur les manuscrits</em>, Brepols.",
                "–––, 2003, “Ruggero Bacone e\nl’alchimia di lunga vita: Riflessioni su il testi,” in C.\nCrisciani and A. Paravicini Bagliani (eds.), <em>Alchimia e medicina\nnel medioevo</em>, Florence.",
                "Parot, N. Weil, 2006, “Encadrement ou devoilement:\nL’occulte et le secret dans la nature chez Albert le Grand et\nRoger Bacon,” <em>Micrologus</em>, 14: 555–84.",
                "Perler, D., 2005, “Logik-eine ‘wertlose\nwissenschaft’? Zum Verhältnis von Logik und Theologie bei\nRoger Bacon,” in D. Perler &amp; U. Rudolph (eds.), <em>Logik\nund Theologie. Das Organon im arabischen und latineischen\nMittelalter</em>, Leiden, 375–99.",
                "Pinborg, Jan, 1979, “The English Contribution to Logic\nBefore Ockham,” <em>Synthese</em>, 40(1): 19–42.",
                "Power, Amanda, 2006, “A Mirror for Every Age: The Reputation\nof Roger Bacon,” <em>The English Historical Review</em>,\n121(492): 657–692.",
                "Power, Amanda, 2007, “Franciscan Advice to the Papacy in the\nMiddle Ages,” <em>History Compass</em>, 5(5):\n1550–75.",
                "–––, 2010, “Going among the Infidels: The\nMendicant Orders and Louis IX’s First Mediterranean\nCampaign,” <em>Mediterranean Historical Review</em>, 25(2):\n187–202.",
                "–––, 2011, “The Remedies for Great Danger:\nContemporary Appraisals of Roger Bacon’s Expertise,” in J.\nCanning, E. King and M. Staub (eds.), <em> Knowledge, Discipline and\nPower: Essays in Honor of David Luscombe</em>, Leiden: Brill,\n63–78.",
                "–––, 2012, “The Importance of Greeks in\nLatin Thought: The Evidence of Roger Bacon,” in R. Gertwagen and\nE. Jeffreys (eds.), <em>Shipping, Trade and Crusade in the Medieval\nMediterranean</em>, London.",
                "Raizman-Kedar, Yael, 2007, “Questioning Aristotle: Roger\nBacon on the True Essence of Color,” <em>Journal of Medieval\nLatin</em>, 17: 372–85.",
                "–––, 2009, “The Intellect Naturalized:\nRoger Bacon on the Existence of Corporeal Species within the\nIntellect,” <em>Early Science and Medicine</em>, 14:\n131–57.",
                "–––, 2009, <em>Species as Signs: Roger Bacon\n(1220–1292) on Perspectiva and Grammatica</em>, Ph.D.\nDissertation, University of Haifa.",
                "Ricklin, Thomas, 2007, “Seneca der Mitbruder. Die\nReeccriture einer moralishcen Herausforgerng Durch Roger Bacon und\nJohannes von Wales und ihr fruhhumanischen Epilog,” in Sabrina\nEbbersmyer and Eckehard Keller (eds.), <em>Ethik-Wissenschaft oder\nLebenskunat? Modell der normenbegru¨ndung von Antike bis zur\nFru¨h Neuzeit</em>, Mu¨nster, 51–74.",
                "Rodolfi, Anna, 2014, “Dicitur materia proprissime et\nstrictissime. Roger Bacon and the Ontological Status of Matter”\nin Bernardini and Rodolfi (eds.) 2014, 83–102.",
                "Roest, B., 2000, <em>A History of Franciscan Education (c.\n1210–1517)</em>, Leiden: Brill.",
                "–––, 2010, “The Franciscan School System:\nRe-assessing the the Early Evidence (ca. 1220–1260),” in\nM. Robson &amp; J. Roehrkasten (eds.), <em>Franciscan Organization in\nthe Mendicant Context: Formal and Informal Structures of the\nFriar’s Lives and Ministry in the Middle Ages</em>, Berlin,\n253–79.",
                "Rosier, Irène, 1994, <em>La Parole comme acte: Sur la\ngrammaire et la sémantique au xiiie siècle</em>, Paris:\nJ. Vrin.",
                "Rosier, Irène, and Alain de Libéra, 1986,\n“Intention de Signifier et Engendrement du Discours chez Roger\nBacon,” in <em>Histoire Épistémologie\nLangage</em>, 8(2): 63–79.",
                "Rosier-Catach, Irène, 1997, “Roger Bacon and\nGrammar,” in Hackett 1997a, pp. 67–102.",
                "–––, 2004, <em>La Parole Efficace: Signe,\nritues, sacré</em>, Paris: Seuil.",
                "Rutkin, H. Darrel, 2019, <em>Sapientia Astrologica: Astrology,\nMagic and Natural Knowledge, ca. 1250–1800. 1. Medieval\nStructures (1250–1500): Conceptual, Institutional,\nSocio-Political, Theologico-Religious and Cultural</em>, Dordrecht:\nSpringer, 41–92.",
                "Schilling, Astrid, 2016, <em>Ethik im Kontext. Erfahrungsbezogener\nWissenschaft: Die Moral philosophie des Roger Bacon (ca.\n1214–1292) vor dem Hintergrund der scholastischen Theologie\nsowie der Einflüsse der griechischen und arabischen\nPhilosophie</em>, Münster: Aschendorff Verlag.",
                "Sharp, Dorothy, 1930, <em>Franciscan Philosophy at Oxford in the\nThirteenth Century</em>, Oxford: Oxford University Press; London:\nHumphrey Milford.",
                "Sheppard, J. A., 2003, “Revisiting Roger Bacon’s <i>De\nSignis</i>,” <em>Collectanea Francescana</em>, 73:\n563–88.",
                "Sidelko, Paul, 1996, “The Condemnation of Roger\nBacon,” <em>The Journal of Medieval History</em>, 22 (1):\n69–81.",
                "Southern, R. W., 1962, <em>Western Views of Islam in the Middle\nAges</em>, Cambridge: Harvard University Press.",
                "Tachau, Katherine H., 1988, <em>Vision and Certitude in the Age of\nOckham: Optics, Epistemology and the Foundations of Semantics\n1250–1350</em>, Leiden: Brill.",
                "–––, 1993, “What Senses and Intellect Do:\nArgument and Judgment in Late Medieval Theories of Knowledge,”\nin K. Jacobi. (ed.), <em>Argumentationstheorie: Scholastische\nForschungen zu den logischen und semantischen Regeln korrekten\nFolgerns</em>, Leiden:Brill, 653–70.",
                "–––, 1997, “<em>Et maxime visus, cuius\nspecies venit ad stellas et ad quem species stellarum veniunt</em>:\nPerspectiva and Astrologia in Late Medieval Thought,”\n<em>Micrologus</em>, 5: 201–24.",
                "–––, 2006, “Seeing and Passion in the\nThirteenth and Fourteenth Centuries,” in J. F. Hamburger &amp;\nA-M. Bouche (eds.), <em>The Mind’s Eye: Art and Theological\nArgument in the Middle Ages</em>, Princeton: Princeton University\nPress.",
                "Thorndike, Lynn, 1914, “Roger Bacon and Experimental Method\nin the Middle Ages,” <em>Philosophical Review</em>, 23:\n271–298.",
                "–––, 1916, “The True Roger Bacon I,”\n&amp; “The True Roger Bacon II,” <em>The American\nHistorical Review</em> 21 (1916), 237–57; 468–80.",
                "Trifogli, Cecilia, 1997, “Roger Bacon and Aristotle’s\nDoctrine of Place,” in Hackett 1997b, pp. 155–176.",
                "–––, 2000, <em>Oxford Physics in the Thirteenth\nCentury (ca. 1250–1270), Motion, Infinity, Place and Time</em>\n(Studien Und Texte Zur Geistesgeschichte Des Mittelalters, Volume 72),\nLeiden: Brill.",
                "Vescovini, Graziella Federici, <em> Le Moyen Âge Magique: Le\nmagie entre religio et science au XIIIe et XIVe siècle</em>,\nParis: Vrin, 2011.",
                "Whewell, William, 1858, <em>History of the Inductive Sciences from\nthe Earliest Times to the Present Times</em> (Volume 1), New York: D.\nAppleton and Company.",
                "Williams, S. J., 1994, “Roger Bacon and his Edition of the\nPseudo-Aristotelian, <em>Secretum secretorum,” Speculum</em>,\n69: 57–73.",
                "Wood, Rega, 1997, “Roger Bacon: Richard Rufus’s\nSuccessor as a Parisian Physics Professor,” in Hackett 1997b,\n222–50.",
                "–––, 2005, “Richard of Cornwall’s\nSignificance in the Western Scientific Tradition,” in L.\nHonnefelder, Rega Wood et al., eds., <em>Albertus Magnus und die\nAnfänge der Aristoteles-Rezeption im lateinischen\nMittelalter</em>, Münster (Subsidia Albertina 1),\n455–92.",
                "–––, 2007, “Imagination and Experience in\nthe Sensory Soul and Beyond: Richard Rufus, Roger Bacon and their\nContemporaries,” in H. Lagerlund (ed.), <em>Forming the Mind:\nEssays on the Internal Senses and the Mind-Body Problem from Avicenna\nto the Medical Enlightenment</em> (Studies in the History of the\nPhilosophy of Mind, 5), Dordrecht, 35–57.\n</ul>\n</div>"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<h3><a id=\"PriSou\">Primary Sources</a></h3>\n<h4>Roger Bacon’s Work</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>\n<td>[OQHI]</td>\n<td><em>Opera quaedam hactenus inedita</em> (=<em>Opus\ntertium, Opus minus, Compendium studii philosophiae, Epistola de\nsecretis operibus Artis et Naturae, et de nullitate Magiae)</em>, ed.\nJ. S. Brewer, London, 1859; reprint 1965, Nendeln, Lichtenstein:\nKraus.</td> </tr>\n<tr>\n<td>[OMB]</td>\n<td><em>Opus maius, 3 Vols</em>., ed. John Henry\nBridges, Oxford and Edinburgh. (Vols. 1 &amp; 2, Oxford 1897; Vol. 3\nwith corrections, Edinburgh, 1900; reprint, Frankfurt: Minerva,\n1964).</td> </tr>\n<tr>\n<td>[UFRB]</td>\n<td>F. Gasquet, “An Unpublished Fragment of Roger\nBacon,” in <em>The English Historical Review</em>, 1894,\n495–517; <em>Epistola Fratris Rogeri Baconi</em>, ed. and trs.,\nP. E. Bettoni, Milan, 1964. </td> </tr>\n<tr>\n<td>[GGHG]</td>\n<td><em>The Greek Grammar of Roger Bacon and a Fragment\nof His Hebrew Grammar</em>, ed. Edmund Nolan and S. A. Hirsch,\nCambridge University Press, 1902.</td> </tr>\n<tr>\n<td>[OTFD]</td>\n<td><em>Opus tertium: Fragment</em>, ed. Pierre Duhem,\nQuarrachi, 1909.</td> </tr>\n<tr>\n<td>[OHI]</td>\n<td><em>Opera hactenus inedita</em> (Vol. I-XVI), ed.\nRobert Steele, Oxford, 1909–1940.</td> </tr>\n<tr>\n<td>[CSTR]</td>\n<td><em>Fr. Rogeri Bacon Compendium Studii\nTheologiae</em>, ed. Hastings Rashdall, Aberdeen University Press,\n1911.</td> </tr>\n<tr>\n<td>[OTFL]</td>\n<td><em>Part of the Opus tertium of Roger Bacon,\nincluding a Fragment Now Printed for the First Time</em>, ed. Arthur\nGeorge Little, Aberdeen University Press, 1912; reprint, Farnborough,\nU.K.: Gregg Press, 1966.</td> </tr>\n<tr>\n<td>[WFB]</td>\n<td><em>The Works of Francis Bacon</em>, ed. J.\nStebbing, R. L. Ellis, D. D. Heath, London: Longmans, 1870; reprint,\nGarrett Press Inc., New York, NY, 1968.</td> </tr>\n<tr>\n<td>[TUIA]</td>\n<td>Thomas Aquinas, <em>Tractatus de unitate\nintellectus contra Averroistas</em>, ed. Leo W. Keeler, Rome:\nGregorianum, 1946.</td> </tr>\n</table>\n<h4>Modern Critical Editions</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>\n<td>[RBMP]</td>\n<td><em>Rogeri Baconis Moralis Philosophia</em>, ed.\nEugenio Massa, Zurich: Thesaurus Mundi, 1953.</td> </tr>\n<tr>\n<td>[DS]</td>\n<td>“An Unedited Part of Roger Bacon’s\n‘<em>Opus maius’: ‘De signis</em>,’” ed.\nK. M. Fredborg, Lauge Nielsen, Jan Pinborg, <em>Traditio</em> 34\n(1978), 75–136. </td> </tr>\n<tr>\n<td>[SD]</td>\n<td><em>Summulae dialectices</em>, ed. Alain de Libera,\n“Les <em>Summulae dialectices</em> de Roger Bacon,”\n<em>Archives d’Histoire Doctrinale et Littéraire du Moyen\nAge</em> 53 (1986): 139–289, 54 (1987): 171–278.</td>\n</tr>\n<tr>\n<td>[CSTM]</td>\n<td><em>Compendium studii theologiae</em>, ed. Thomas\nS. Maloney, Leiden: Brill, 1988.</td> </tr>\n<tr>\n<td>[DMP]/[DSC]</td>\n<td><em>De multiplicatione specierum</em> and <em>De\nspeculis comburentibus</em>, ed., David C. Lindberg, Oxford: Clarendon\nPress, 1983.</td> </tr>\n<tr>\n<td></td>\n<td>Thomas S. Maloney, Compendium of the Study of Philosophy, Oxford\nUniversity Press for The British Academy, 2018 [Auctores Britannici\nMedii Aevi, 32]</td></tr>\n<tr>\n<td></td>\n<td>Nikolaus Egel, Edition and Translation, Roger Bacon: Opus\nTertium, Hamburg: Felilx Meiner Verlag, 2019.</td></tr>\n<tr>\n<td>[TFT]</td>\n<td>Theodoric of Freiberg, <em>Tractatus de iride et de\nradialibus impressionibus</em>, eds. L. Sturlese/M.R.\nPagnoni-Sturlese, in <em>Corpus Philosophorum Teutonicorum Medii\nAevi</em>, II, 4, 1985, 95–286.</td> </tr>\n<tr>\n<td>[PRSP]</td>\n<td><em>Perspectiva</em>, ed. David C. Lindberg,\nOxford: Clarendon Press, 1996.</td> </tr>\n</table>\n<h4>Translations</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>\n<td>[MOA]</td>\n<td>Stanton J. Linden, <em>The Mirror of Alchemy</em>,\nNew York: Garland Press, 1992.</td> </tr>\n<tr>\n<td>[TTUM]</td>\n<td>Thomas S. Maloney, <em>Three Treatments of\nUniversals by Roger Bacon</em>, Binghamton, New York: MARTS,\n1989.</td> </tr>\n<tr>\n<td>[RBASL]</td>\n<td>Thomas S. Maloney, <em>Roger Bacon: The Art and Science of\nLogic</em>, Toronto: PIMS, 2009.</td> </tr>\n<tr>\n<td>[RBOS]</td>\n<td>Thomas S. Maloney, <em>Roger Bacon: On Signs</em>, Toronto:\nPIMS, 2013.</td> </tr>\n<tr>\n<td></td>\n<td>Nilolaus Egel and Katherina Molner, Roger Bacon: Opus maius,\nHamburg: Felix Meiner Verlag, 2017.</td></tr>\n<tr>\n<td></td>\n<td>Nikolaus Egel, Roger Bacon: Kompendium fur das Studium der\nPhilosophie, Hamburg: Felix Meiner Verlag, 2015.</td></tr>\n<tr>\n<td></td>\n<td>Pia A. Antilic-Piper, Opus Maius (Selected Texts), Latin-German,\nFreiburg-Basel-Wein: Herder Verlag, 2008.</td></tr>\n<tr>\n<td></td>\n<td>V.Sorge and F. Seller, Filosofia, scienza, theologia dall’\nOpus Maius, Rome: Armando Editore, 2010.</td></tr>\n<tr>\n<td></td>\n<td>Francesco Bottin, Ruggero Bacone: La Scienze\nSperimentale-Lettere a Clement IV- I Segreti Dell’Arte E Della\nNatura, Milan: Rusconi, 1990. </td></tr>\n<tr>\n<td></td>\n<td>Carlos Arthuro R. Do Nascimento et al., <em> Rogerio Bacon,\nObras Escolhides</em>, Porto Alegre, Braganca Publista, 2006.</td>\n</tr>\n</table>\n<h4>Richard Rufus of Cornwall</h4>\n<table class=\"vert-top cellpad-med-dense cell-rl\">\n<tr>\n<td>[IPA]</td>\n<td>Richard Rufus of Cornwall, <em>In Physicam\nAristotelis</em>, Rega Wood (ed.), Oxford University Press, for The\nBritish Academy, (ABMA, XVI), 2003; See Stanford University Richard\nRufus of Cornwall Website, Dir. Rega Wood</td> </tr>\n</table>\n<h3><a id=\"SecSou\">Secondary Sources</a></h3>\n<ul class=\"hanging\">\n<li>Adamson, Robert, 1876, <em>Roger Bacon: The Philosophy of Science\nin the Middle Ages</em>, Manchester.</li>\n<li>Anheim, E., et al., 2001, “Exégé\njudéo-chrétienne, magie et linguistique: un recueil de\nnotes inédites attribuées à Roger Bacon,”\n<em>AHDLMA</em>, 68: 95–154.</li>\n<li>Augustine, <em>De Dialectica</em>, B. Darrell Jackson (trans.),\nDordrecht: D. Reidel, 1975.</li>\n<li>–––, <em>De doctrina Christiana</em> (Corpus\nChristianorum Series Latina: 32), K.D. Daur and Joseph Martin (eds.),\nTurnhout: Brepols, 1962.</li>\n<li>Bernardini, Paola, 2014, “Temporibus autem meis.\nTheologian’s Errors with Regard to the Human Soul in Roger\nBacon’s Communia Naturalium,” in Bernardini and Rodolfi\n(eds.) 2014, 139–158.</li>\n<li>Bernardini, Paola and Anna Rodolfi (eds.), 2014, <em>Roger\nBacon’s</em> Communia Naturalium: <em>A 13th-Century\nWorkshop</em> (Micrologus’ Library: Volume 64), Florence:\nSismel–Edizione del Galuzzo.</li>\n<li>Bourgain, P., 1989, “Les sens de la langue et des langues\nchez Roger Bacon,” in G. Contamine (ed.), <em>Traduction et\ntraducteurs au moyen age</em>, Paris, 317–29.</li>\n<li>Courtenay, W. J., 2009, “Franciscan Learning: Univeresity\nEducation and Biblical Education,” in M. F. Cusato &amp; G.\nGeltner (eds.), <em>Defenders and Critics of Franciscan Life: Essays\nin Honor of John V. Fleming</em>, Leiden: Brill, 55–64.</li>\n<li>Crisciani, C., 2006, “Tra Dio, intelletto ed esperienza:\naspetti di Segreto nell’ Alchimia latina (secoli\nXIII-XIV),” Firenze, <em>Micrologus Library</em>, 14:\n193–204.</li>\n<li>–––, 2014, “Universal and Particular in\nthe Communia Naturalium: Between (Extreme Realism) and\n(Experientia),” in Bernardini and Rodolfi (eds.) 2014,\n57–82</li>\n<li>Crisciani, C. and Michela Pereira, 2014, “Introduction to\nthe Philosopher’s Laboratory”, in Bernardini and Rodolfi\n(eds.) 2014, 1–26.</li>\n<li>Crombie, A. C., 1953, <em>Robert Grosseteste and the Origins of\nExperimental Science, 100–1700</em>, Oxford: Clarendon Press.\n(Groundbreaking but controversial work on the methodological\ncontinuities between medieval and modern science.)</li>\n<li>Crombie, A. C. &amp; John North, 1970, “Roger Bacon,”\nin <em>Dictionary of Scientific Biography</em> I, New York, Scribners,\n377–85.</li>\n<li>Crowley, Theodore, 1950, <em>Roger Bacon: The Problem of the Soul\nin his Philosophical Commentaries</em>, Louvain/Dublin, 1950. (A study\nof Bacon’s philosophical psychology.)</li>\n<li>De Libera, Alain, 1990, “De la logique à la\ngrammaire: Remarques sur la théorie de la <em>determinatio</em>\nchez Roger Bacon et Lambert d’Auxerre (Lambert de Lagny),”\nin G. Bursill-Hall, S. Ebbesen &amp; K. Koerner, eds. <em>De\ngrammatica. A Tribute to Jan Pinborg</em>, Amsterdam: John Benjamins\nPublishing Company, 209–226 (Studies in the History of the\nLanguage Sciences, 43).</li>\n<li>–––, 1991, “Roger Bacon et la reference\nvide. Sur quelques antecedents médiévaux du paradoxe de\nMeinong,” in J. Jolivet, Z. Kaluza, A. De Libera (eds.),\n<em>Lectionem varietates: Homages á Paul Vignaux</em>, Paris:\nJ. Vrin, 85–120.</li>\n<li>–––, 1997, “Roger Bacon et la\nlogique” in Hackett 1997a, pp. 103–132.</li>\n<li>Del Punta, F., Donati, S., Trifogli, C., 1996, “Commentaries\non Aristotle’s <i>Physics</i> in Britain, ca.\n1250–1270,” in John Marenbon (ed.), <em>Aristotle in\nBritain in the Middle Ages</em>, Turnhout, 265–83. </li>\n<li>Demange, Dominique, 2016, “Olivi et les Perspectivi: Les\nSources de la theorie Olivienne de la Vision” in\n<em>OLIVIANA</em>, 5 (2016).</li>\n<li>–––, 2020, “Physical action, species and\nmatter: The debate between Roger Bacon and Peter John Olivi”\n<em>Journal for the History of Philosophy</em>, 58: 49–59.</li>\n<li>Donati, Silvia, 1997, “The Anonymous Questions on Physics\nII-IV of MS Philadelphia, Free Library, Lewis Europ. 53 (ff.\n71ra-85rb) and Roger Bacon,” in Hackett 1997b,\npp. 177–221.</li>\n<li>–––, 2013, “Pseudopigrapha in the Opera\nhactenus inedita Rogeri Baconi: The Commentaries on the Physics and on\nthe Metaphysics,” in O. Weijeers and J. Verger, <em>Les debuts\nde l’enseignement universitaire a Paris (1200–1245\nenviron)</em>, Turnhout: Brepols, <em>Studia Artistarum</em>, 38:\n153–203.</li>\n<li>Denery, D. G., II, 2005, <em>Seeing and Being Seen in the Later\nMedieval World: Optics, Theology and Religious Life</em>, Cambridge\nUniversity Press.</li>\n<li>Duhem, Pierre, 1915, <em>Le Système du Monde: Histoire des\nDoctrines Cosmologiques de Platon à Copernic</em>, T. III.</li>\n<li>Easton, Stewart C., 1952, <em>Roger Bacon and His Search for a\nUniversal Science: A Reconsideration of the Life and Work of Roger\nBacon in the Light of His Own Stated Purpose</em>, New York: Columbia\nUniversity Press. (An overview of the later Bacon’s\nphilosophical vision with specific emphasis on the influence of the\n<em>Secretum secretorum</em>.)</li>\n<li>Ebbesen, Sten, 1979, “The Dead Man is Alive,”\n<em>Synthese</em> 40 (January): 43–70</li>\n<li>Eco, Umberto, 1989, “Denotation,” in Umberto Eco and\nConstantion Marmo (eds.), <em>On The Medieval Theory of Signs</em>,\nAmsterdam/Philadelphia: John Benjamins Publishing Company.</li>\n<li>Finkenberg, Frank, 2007, <em>Ancilla theologiae? Theologie und\nWissenschaften bei Roger Bacon</em>, Mönchen Gladbach</li>\n<li>Gracia, Jorge J.E., 1991, “The Centrality of the Individual\nin the Philosophy of the Fourteenth Century,” <em>History of\nPhilosophy Quarterly</em>, 8: 235–51.</li>\n<li>Grèvin, B., 2001, “L’hébreu des\nfranciscains: Nouveaux éléments sur la connaissance de\nl’hébreu en milieu Chrétien au xiiie\nsiècle,” <em>Médiévales</em>, 70(1):\n65–82.</li>\n<li>–––, 2003, “Entre Magie et\nSémiotique: Roger Bacon et les caractères\nchinois,” <em>Recherches de Théologie et Philosophie\nmédiévales</em>, 41: 65–82.</li>\n<li>Gueret-Laferte, Michele, 1998, “Le voyager et le geographie:\nl’insertion dela relation voyage de Guillaume de Rubrouck dans\nl’opus maius de Roger Bacon,” in <em>La geographie au\nMoyen-Age. Espaces penses, espaces vecus, espaces reves</em>,\n<em>Perspectives Medievales</em> (Supplement), 24: 81–96.</li>\n<li>Hackett, Jeremiah (ed.), 1997a, <em>Roger Bacon and the Sciences:\nCommemorative Essays</em>, Leiden: Brill. (This is a comprehensive\nreview of the various sciences commented on by Roger Bacon. For\nscience, see Molland on Bacon’s mathematics, Hackett on\nastrology and <em>scientia experimentalis</em>, Woodward &amp; Howe on\ngeography/cartography, Van Deusen on music, Lindberg on light, vision\nand the universal radiation of force, Newman on alchemy, Getz on Roger\nBacon and medicine, Williams on the <em>Secretum\nsecretorum</em>.)</li>\n<li>––– (ed.), 1997b, <em>Roger Bacon and\nAristotelianism</em>, special issue, <em>Vivarium</em>, 35(2),\nSeptember. (This is a study of Bacon’s contribution to the\nreception of Aristotle.  See essays by Marmo, Trifolgi, Donati, wood,\nNooone, Long, Hackett.)</li>\n<li>–––, 2005, “Roger Bacon and the\nReceptionof Aristotle in the Thirteenth Century: An Introduction to\nHis Criticism of Averroes,” in Ludger Honnefelder, Ludger,\nWood,Rega, Dreyer, Mechthild, Aris, Mark Aeilko, eds. 2005,\n<em>Albertus Magnus and the Beginnings of the Medieval Reception of\nAristotle in the Latin West</em>, Münster: Aschendorff Verlag,\n219–248.</li>\n<li>–––, 2006, “Experience and Demonstration\nin Roger Bacon: A Critical Review of Some Modern\nInterpretations,” in Alexander Fidora &amp; Matthias\nLutz-Bachmann eds., <em>Erfahrung und Beweis: Die Wissenschaften von\nder Natur im 13. und 14. Jahrhundert</em> / <em>Experience and\nDemonstration: The Sciences of Nature in the 13<sup>th</sup> and\n14<sup>th</sup> Centuries</em>, Berlin: Akademie Verlag, 41–58\n(Wissenkultur und gesellschaftlicher Wandel 14).</li>\n<li>–––, 2011, “<em>Ego Expertus\nSum</em>:Roger Bacon’s Science and the Origins of\nEmpiricism,” in Thomas Bènatouïl &amp; Isabelle\nBraelants (eds.),<em>Expertus sum. L’expèrience par les\nsens dans la philosophie naturelle médiévale</em>,\n<em>Micrologus Library</em>, 40, 145–73.</li>\n<li>–––, 2012, “Experience, Experimentum and\nScience in Roger Bacon and Martin Heidegger: From Medieval to Modern\nScience” in Alia Mensching-Estakhr and Michael Städtler\n(eds.), <em>Wahrheit und Geschichte: Die gebrochene Tradition\nmetaphytsischen Denkens: Festschrift zum 70. Geburtstqg von\nGüunther Mensching</em>, Koenighausen und Neumann, 315\n–328.</li>\n<li>–––, 2013a, “Roger Bacon on Animal\nKnowledge in the <em>Perspectiva</em>,” in Luis Xavier\nLòpez-Farjeat &amp; Jörg Alejandro Tellkamp (eds.),\n<em>Philosophical Psychology in Arabic Thought and The Latin\nAristotelianism of the 13th Century</em>, Paris: Vrin,\n23–42.</li>\n<li>–––, 2013b, “Astrology and the Search for\nan Art and Science of Nature in the 13th Century,” in G.\nMarchetti, O. Rignani, V. Sorge (eds.), <em>Ratio and superstitio:\nEssays in Honor of Graziella Federici Vescovicini</em> (Proceedings of\nthe Hannover Medieval Philosophy Symposium 2011), TEMA,\nLovain-La-Neuve, 117–136..</li>\n<li>–––, 2016, “From <em>Sapientes\nantique</em> at Lincoln to the New <em>Sapientes moderni</em> at paris\nc. 1260–1280: Roger Bacon’s Two Circles of\nScholars,” in Jack P.  Cunningham and Mark Hocknull\n(eds.), <em>Robert Grosseteste and the pursuit of Religious and\nScientific Learning in the Middle Ages</em>, Springer, 2016,\n119–142.</li>\n<li>–––, 2018a, “Bacon and His First\nInterpreter, The Anonymous Iuvenis Iohannes,” in Cecilia Panti e\nNicola Polloni, <em>Vedere nell’ Ombra: Studi su\nNatura,Spiritualita e Scienze operativa offerti a Michela Pereira</em>\n(Micrologus Library: 90), Firenze: SISMEL, 179–192.</li>\n<li>–––, 2018b, “Roger Bacon and Peter John\nOlivi on the Status of the Philosophers,” in Luca Bianchi,\nOnorato Grassi, Cecilia Panti, Editors, <em>Edizioni, Traduzioni et\nTradizioni Filosofiche (Secoli XII-XVI): Studi Per Pietro B.\nRossi</em>, Arcane Editrice, Vol.II, 557–572.</li>\n<li>–––, 2018c, in Guünther Mensching and Alia\nMensching–Estakhr, “Agent Intellect and Intelligile\nSpecies in Roger Bacon and John Pecham”<em>Die Seele im\nMittelalter: Von der Substance zum funktionalen system</em>\n(Contradictio, Band 16), Würzburg: Königshausen and Neumann,\n149–168.</li>\n<li>Hedwig, Klaus, 2000, “Roger Bacon’s <em>Scientia\nexperimentalis</em>,” in Theo Kobush (ed.), <em>Philosophen des\nMittelalters</em>, Darmstadt: Primus, 140–51.</li>\n<li>Hochberg, Herbert, 1953, “The Empirical Philosophy of Roger\nand Francis Bacon,”  <em>Philosophy of Science</em>, 20:\n313–326.</li>\n<li>Johnson, Timothy J., 2009, “Back to Bacon: Dieter Hattrup\nand Bonaventure’s authorship of the <em>De\nreductione</em>,” <em>Franciscan Studies</em>, 67:\n133–47.</li>\n<li>–––, 2009, “Roger Bacon’s Critique\nof Franciscan Preaching,” in F. J. Felten, A. Kehnel, S.\nWeinfurter (eds.), <em>Institution and Charisma: Festschrift für\nGert Melville</em>, Vienna, 541–48.</li>\n<li>–––, 2010, “Preaching Precedes Theology:\nRoger Bacon and the Failure of Mendicant Education,”\n<em>Franciscan Studies</em>, 68: 83–95.</li>\n<li>–––, 2012, <em>Franciscans and Preaching</em>,\nLeiden: Brill Academic Publishers.</li>\n<li>–––, 2014, “Place, Analogy, and\nTranscendence, Bonaventure and Bacon on the Franciscan Relation to the\nWorld”, in Gert Melville, et al., <em>Innovationen durch Deuten\nund Gestalten. Kloster im Mittelalter zwischen Jenseits und Welt</em>,\nRegensburg, 83–96. </li>\n<li>–––, 2013, “Franciscan Bodies and Souls:\nBonaventure and Bacon on Scripture, Preaching and the Cura\nVitae,” <em>Franciscan Preaching</em>, Leiden: Brill,\n73–89.</li>\n<li>–––, 2013, “That They May Love the Faith:\nRoger Bacon on Culture, Language and Religion,” in <em>From La\nFlorida to La California: Franciscan Evangelization in the Spanish\nBorderlands</em>, SanFrancisco: Academy of American Franciscan\nHistory, 23–33.</li>\n<li>–––, 2014, “Hermeneutica biblica y la cura\ncorporis – cura animae franciscana segun Buenaventura y\nbacon,” in Geraldo Losada trs., in <em>El cuidado del la vida:\nDel medievo al Renacimento</em>, Carlos Ruta (ed.), Buenos Aires:\nUnsamedita, 109–127.</li>\n<li>–––, 2017, “Wisdom ha built her house; she\nhas set up seven pillars: Roger Bacon, Franciscan Wisdom, and\nConversion to the Sciences,” in Michael Robson, ed., <em>The\nEnglish Province of Franciscans</em> (1224–c.1350), Leiden:\nBrill, 296–315.</li>\n<li>Kavey, Allison, 2007, “Roger Bacon, Robert Greene’s\nFriarBacon and the Secrets of Art and Nature,” in AllisonKavey,\n<em>Books of Secrets: Natural Philosophy in England,\n1550–1600</em>, University of Illinois Press, 32–58.</li>\n<li>Kedar, Yael, 2008, <em>Species as Signs: Roger Bacon (1220–1292)\non Perspectiva and Grammatica</em>, Ph.D. Dissertation, University of\nHaifa.</li>\n<li>–––, 2009, “The Intellect Naturalized:\nRoger Bacon on the Existence of Corporeal Species within the\nIntellect,” in <em>Early Science and Medicine</em>, 14:\n131–157.</li>\n<li>–––, 2016, “The Nomological Image of\nNature: Explaining the Tide in the Thirteenth Century,” in\n<em>Annals fo Science</em>, 73: 68–88.</li>\n<li>Kedar, Yael, 2017, “Roger Bacon (c.1220–1292) and his System\nof Laws of Nature: Classification, Hierarchy and Significance,”\nin <em> Perspectives on Science</em>, 26: 719–745.</li>\n<li>Kedar, Yael, with Giora Hon, 2017, “‘Natures’\nand ‘Laws’: the Making of the Concept of Law of Nature:\nRobert Grosseteste 9c.1168–1253) and Roger Bacon\n(1214/20–1292),” <em>Studies in the History and Philosophy\nof Science</em> (Part A), 61: 21–31.</li>\n<li>Kedar, Yael and Dominique Demange, 2020, “Physical action,\nspecies and matter: The debate between Roger Bacon and Peter John\nOlivi” in <em>Journal for the History of Philosophy</em>, 58:\n49–59.</li>\n<li>King, Peter, 2003, “Two Conceptions of Experience,”\n<em>Medieval Philosophy and Theology</em>, 11: 203–226.</li>\n<li>Koyré, A., 1957, “The Origins of Modern Science: A\nNew Interpretation,” <em>Diogenes</em>, 4: 421–48.</li>\n<li>Kraml, Hans, 1994, “Roger Bacon’s Theory of the\nRainbow as a Turning Point in Pre-Galiliean Theory of Science”,\nin Georg Meggle and Ulla Wessels (eds.), <em>Anlalyomen I</em>,\nBerlin, New York, 353–361.</li>\n<li>Kuhn, Thomas S., 1976, “Mathematical vs. Experimental\nTraditions in the Development of Physical Science,” <em>Journal\nof Interdisciplinary History</em>, VII-1 (Summer, 1976), 1-31.</li>\n<li>Lambertini, Roberto; romana Martorelli Vico, 2014, “Are\nthere more Versions of the Communia Naturalium? Soundings of the\nManuscript Tradition,” in Bernardini and Rodolfi (eds.) 2014,\n35–56.</li>\n<li>Light, L., 2001, “Roger Bacon and the Origin of the Paris\nBible,” <em>Revue Benedictine</em>, 3(3–4):\n483–507.</li>\n<li>Lindberg, David C., 1966, “Roger Bacon’s Theory of the\nRainbow: Progress or Regress,” <em>Isis</em>, 57:\n235–49</li>\n<li>–––, 1971, “Lines of Influence in\nThirteenth Century Optics: Bacon, Witelo, and Pecham,”\n<em>Speculum</em>, 46 (January 1971): 66–83.</li>\n<li>–––, 1978, <em>Theories of Vision from Al-Kindi\nto Kepler</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1983, <em>Studies in the History of\nMedieval Optics</em>, London: Variorum Reprints.</li>\n<li>–––, 1997, “Roger Bacon on Light, Vision,\nand the Universal Emanation of Force,” in Hackett 1997a, pp.\n243–276.</li>\n<li>Little, A. G., 1914, <em>Roger Bacon Essays</em>, Oxford:\nClarendon Press. (These essays, some on Bacon’s science, are\nstill valuable).</li>\n<li>Maloney, Thomas S., 1983a, “The Semiotics of Roger\nBacon,” <em>Medieval Studies</em>, 45: 120–154;</li>\n<li>–––, 1983b, “Roger Bacon on the\n<em>Significatum</em> of Words,” in <em>Archéologie du\nsigne</em>, Lucie Brind’Amour and Eugene Vance (eds.), Toronto:\nPIMS, 187–211.</li>\n<li>–––, 1984, “Roger Bacon on\nEquivocation,” <em>Vivarium</em>, 22: 85–112.</li>\n<li>–––, 1985, “The Extreme Realism of Roger\nBacon,” <em>Review of Metaphysics</em>, 38 (June):\n807–837.</li>\n<li>–––, 1995, “Is the <em>De doctrina\nChristiana</em> the source for Bacon’s Semiotics,” in\nEdward D. English (ed.), <em>Reading and Wisdom: The ‘De\ndoctrina Christiana’ of Augustine in the Middle Ages</em>, Notre\nDame &amp; London: University of Notre Dame Press, 126–42.</li>\n<li>–––, 2002, “Roger Bacon on the Division of\nStatements into Single/Multiple and Simple/Compound,” <em>The\nReview of Metaphysics</em>, 56: 321–56.</li>\n<li>Mantovani, Mattia, 2020, “Visio per sillogismum. Sensation\nand Cognition in 13th Century Theories of Vision,” in Elena\nBaituta, ed.<em>Medieval Perceptual Puzzles: Theories of Perception in\nthe 13th and 14th Centuries</em>, Leiden: Brill, 111–152. </li>\n<li>Marmo, Costantino, 1997, “Bacon, Aristotle (and all the\nothers) on Natural Inferential Signs,” in Hackett 1997b, pp.\n136–154.</li>\n<li>Marrone, Steven P., 2001, <em>The Light of Thy Countenance:\nScience and Knowledge of God in the 13th Century</em> (Volume I: A\nDoctrine of Divine Illumination), Leiden: Brill.</li>\n<li>Matthews, Gareth B., 1978, “A Medieval Theory of\nVision,” in Peter K. Machamer &amp; Robert G. Turnbull (eds.),\n<em>Studies in Perception: Interrelations in the History of Philosophy\nand Science</em>, Columbus: Ohio State University Press, 1978,\n186–199.</li>\n<li>Mensching, Günther, 2009, <em>Roger Bacon</em>, Münster:\nAschendorff.</li>\n<li>Molland, A. G., 1974, “Roger Bacon as Magician,”\n<em>Traditio</em>, 50: 445–460.</li>\n<li>–––, 1983, “Roger Bacon and the Hermetic\nTradition in Medieval Science,” <em>Vivarium</em>, 31:\n140–160.</li>\n<li>–––, 1996, “Roger Bacon’s <em>De\nlaudibus mathematicae:</em> a preliminary study,” in E. Sylla\n&amp; M. McVaugh (eds.), <em>Texts and Contexts in Ancient and\nMedieval Science: Studies on the Occasion of John E. Murdoch’s\nSeventieth Birthday</em>, 68–83.</li>\n<li>–––, 1996, “Roger Bacon’s\nAppropriation of Past Mathematics,” in F. J. Ragep, S. P. Ragep,\nand S. Livesey (1996), 347–65.</li>\n<li>–––, 1996a, “The Role of Aristotle in the\nEpistemological Schemata of Roger Bacon and Thomas Bradwardine,”\nin J. Marenbon (ed.), <em>Aristotle in Britain During the Middle\nAges</em>, Brepols, 285–97.</li>\n<li>–––, 1997, “Roger Bacon’s Knowledge\nof Mathematics,” in Hackett 1997a, pp. 151–174.</li>\n<li>–––, 2004, “Roger Bacon,” <em>Oxford\nDictionary of National Biography</em> (Volume I), H. C. G Matthew and\nBrian Harrison (eds.), Oxford: Oxford University Press.</li>\n<li>Nagel, Sylvia, 2012, “Pietro Peregrino, il sapiens-simplex\neccelente di Ruggero Bacon,” <em>I Francescani E Le\nScienze</em>, Spoleto:Centro Italiano Di Studi Sull’Alto\nMedioevo, 2012, 19–47.</li>\n<li>Newhauser, Richard, 2001, “<i>Inter Scientiam et\nPopulum</i>: Roger Bacon, Pierre de Limoges and the <em>Tractatus\nmoralis de oculo</em>,” in J. A. Aertsen, K. Emery, Jr., and A.\nSpeer (eds.), <em>Nach der Verurteilung Von 1277. Philosophie und\nTheologie an der Universität von Paris im letzten Viertel des 13.\nJahrhunderts. Studien und Texte/After the Condemnation of 1277</em>\n(Philosophy and Theology at the University of Paris in the Last\nQuarter of the 13<sup>th</sup> Century. Studies and Texts),\n<em>Miscellanea Medievalia</em>, 28: 682–703.</li>\n<li>Newhauser, Richard, 2012, <em>Peter of Limoges: The Moral Treatise\non the Eye</em>,Toronto: PIMS.</li>\n<li>Newman. R., 1994, “The Alchemy of Roger Bacon and the\n<em>Tres epistolae</em> attributed to Him,” in <em>Comprendre et\nmaitriser la nature au moyen age: mélanges d’histoire\nofferts à Guy Beaujouan</em>, Geneva.</li>\n<li>Oliver, Simon, 2004, “Roger Bacon on Light, Truth and\n<i>Experimentum</i>,” <em>Vivarium</em>, 42/2:\n151–180.</li>\n<li>Panti, Cecilia, 2014, “Natural Continuity and Mathematical\nProofs against Indivisibilism in Roger Bacon’s De Celestibus\n(Communia Naturalium, II),” in Bernardini and Rodolfi (eds.)\n2014, 159–190.</li>\n<li>–––, 2016, “The Theological Use of Science\nin Robert Grosseteste and Adam Marsh according to Roger Bacon: The\nCase Study of the Rainbow,” in Jack P. Cunningham and Mark\nHocknull, eds., <em>Robert Grosseteste and the pursuit or Religious\nand Scientific Learning in the Middle Ages</em>, Springer Verlag,\n143–164.</li>\n<li>–––, 2017, “NON ABEST NEC DISTAT:PLACE AND\nMOVEMENT OF ANGELS ACCORDING TO ROBERT GROSSETESTE, ADAM MARSH AND\nROGER BACON,” in Tiziana Suarez-Nani, Olivier Ribordy, Antonio\nPetagine, <em>Lieu, Mouvement: Physique, Metaphysique Et Cosmologie\n(Xiie-XVIe Siecles)</em>, Barcelona-Rome, 57–78.</li>\n<li>Panti, Cecilia and Greti Dinkova-Brunn, 2018, “Robert\nGrosseteste’s De irids and its addendum in the Vatican\nManuscript Barb. Lat. 165: Transmission, Reception, Meaning,” in\nStella Panayotova and Paola Ricciardi, eds., <em> Manuscripts in the\nMaking</em> <em>Art and Science</em>, Volume II, 23–31</li>\n<li>Paravicini Bagliani, A., 1987, “Ruggero Bacone, autore del\n<em>De ratardatione accidentium senectutis?</em>,” in <em>Studi\nMedievali</em>, 3<sup>rd</sup> ser., 28: 707–28.</li>\n<li>–––, 1991, <em>Medicina e scienze della natura\nalla corte dei papi nel Ducento</em>, Spoleto.</li>\n<li>–––. 2000, <em>The Pope’s Body</em>,\nChicago: University of Chicago Press. </li>\n<li>–––, 2001, <em>Le Speculum Astronomiae, un\nenigme? Enquete sur les manuscrits</em>, Brepols. </li>\n<li>–––, 2003, “Ruggero Bacone e\nl’alchimia di lunga vita: Riflessioni su il testi,” in C.\nCrisciani and A. Paravicini Bagliani (eds.), <em>Alchimia e medicina\nnel medioevo</em>, Florence.</li>\n<li>Parot, N. Weil, 2006, “Encadrement ou devoilement:\nL’occulte et le secret dans la nature chez Albert le Grand et\nRoger Bacon,” <em>Micrologus</em>, 14: 555–84.</li>\n<li>Perler, D., 2005, “Logik-eine ‘wertlose\nwissenschaft’? Zum Verhältnis von Logik und Theologie bei\nRoger Bacon,” in D. Perler &amp; U. Rudolph (eds.), <em>Logik\nund Theologie. Das Organon im arabischen und latineischen\nMittelalter</em>, Leiden, 375–99.</li>\n<li>Pinborg, Jan, 1979, “The English Contribution to Logic\nBefore Ockham,” <em>Synthese</em>, 40(1): 19–42.</li>\n<li>Power, Amanda, 2006, “A Mirror for Every Age: The Reputation\nof Roger Bacon,” <em>The English Historical Review</em>,\n121(492): 657–692.</li>\n<li>Power, Amanda, 2007, “Franciscan Advice to the Papacy in the\nMiddle Ages,” <em>History Compass</em>, 5(5):\n1550–75.</li>\n<li>–––, 2010, “Going among the Infidels: The\nMendicant Orders and Louis IX’s First Mediterranean\nCampaign,” <em>Mediterranean Historical Review</em>, 25(2):\n187–202.</li>\n<li>–––, 2011, “The Remedies for Great Danger:\nContemporary Appraisals of Roger Bacon’s Expertise,” in J.\nCanning, E. King and M. Staub (eds.), <em> Knowledge, Discipline and\nPower: Essays in Honor of David Luscombe</em>, Leiden: Brill,\n63–78.</li>\n<li>–––, 2012, “The Importance of Greeks in\nLatin Thought: The Evidence of Roger Bacon,” in R. Gertwagen and\nE. Jeffreys (eds.), <em>Shipping, Trade and Crusade in the Medieval\nMediterranean</em>, London.</li>\n<li>Raizman-Kedar, Yael, 2007, “Questioning Aristotle: Roger\nBacon on the True Essence of Color,” <em>Journal of Medieval\nLatin</em>, 17: 372–85.</li>\n<li>–––, 2009, “The Intellect Naturalized:\nRoger Bacon on the Existence of Corporeal Species within the\nIntellect,” <em>Early Science and Medicine</em>, 14:\n131–57.</li>\n<li>–––, 2009, <em>Species as Signs: Roger Bacon\n(1220–1292) on Perspectiva and Grammatica</em>, Ph.D.\nDissertation, University of Haifa.</li>\n<li>Ricklin, Thomas, 2007, “Seneca der Mitbruder. Die\nReeccriture einer moralishcen Herausforgerng Durch Roger Bacon und\nJohannes von Wales und ihr fruhhumanischen Epilog,” in Sabrina\nEbbersmyer and Eckehard Keller (eds.), <em>Ethik-Wissenschaft oder\nLebenskunat? Modell der normenbegru¨ndung von Antike bis zur\nFru¨h Neuzeit</em>, Mu¨nster, 51–74.</li>\n<li>Rodolfi, Anna, 2014, “Dicitur materia proprissime et\nstrictissime. Roger Bacon and the Ontological Status of Matter”\nin Bernardini and Rodolfi (eds.) 2014, 83–102.</li>\n<li>Roest, B., 2000, <em>A History of Franciscan Education (c.\n1210–1517)</em>, Leiden: Brill.</li>\n<li>–––, 2010, “The Franciscan School System:\nRe-assessing the the Early Evidence (ca. 1220–1260),” in\nM. Robson &amp; J. Roehrkasten (eds.), <em>Franciscan Organization in\nthe Mendicant Context: Formal and Informal Structures of the\nFriar’s Lives and Ministry in the Middle Ages</em>, Berlin,\n253–79.</li>\n<li>Rosier, Irène, 1994, <em>La Parole comme acte: Sur la\ngrammaire et la sémantique au xiiie siècle</em>, Paris:\nJ. Vrin.</li>\n<li>Rosier, Irène, and Alain de Libéra, 1986,\n“Intention de Signifier et Engendrement du Discours chez Roger\nBacon,” in <em>Histoire Épistémologie\nLangage</em>, 8(2): 63–79.</li>\n<li>Rosier-Catach, Irène, 1997, “Roger Bacon and\nGrammar,” in Hackett 1997a, pp. 67–102.</li>\n<li>–––, 2004, <em>La Parole Efficace: Signe,\nritues, sacré</em>, Paris: Seuil.</li>\n<li>Rutkin, H. Darrel, 2019, <em>Sapientia Astrologica: Astrology,\nMagic and Natural Knowledge, ca. 1250–1800. 1. Medieval\nStructures (1250–1500): Conceptual, Institutional,\nSocio-Political, Theologico-Religious and Cultural</em>, Dordrecht:\nSpringer, 41–92. </li>\n<li>Schilling, Astrid, 2016, <em>Ethik im Kontext. Erfahrungsbezogener\nWissenschaft: Die Moral philosophie des Roger Bacon (ca.\n1214–1292) vor dem Hintergrund der scholastischen Theologie\nsowie der Einflüsse der griechischen und arabischen\nPhilosophie</em>, Münster: Aschendorff Verlag.</li>\n<li>Sharp, Dorothy, 1930, <em>Franciscan Philosophy at Oxford in the\nThirteenth Century</em>, Oxford: Oxford University Press; London:\nHumphrey Milford.</li>\n<li>Sheppard, J. A., 2003, “Revisiting Roger Bacon’s <i>De\nSignis</i>,” <em>Collectanea Francescana</em>, 73:\n563–88.</li>\n<li>Sidelko, Paul, 1996, “The Condemnation of Roger\nBacon,” <em>The Journal of Medieval History</em>, 22 (1):\n69–81.</li>\n<li>Southern, R. W., 1962, <em>Western Views of Islam in the Middle\nAges</em>, Cambridge: Harvard University Press.</li>\n<li>Tachau, Katherine H., 1988, <em>Vision and Certitude in the Age of\nOckham: Optics, Epistemology and the Foundations of Semantics\n1250–1350</em>, Leiden: Brill.</li>\n<li>–––, 1993, “What Senses and Intellect Do:\nArgument and Judgment in Late Medieval Theories of Knowledge,”\nin K. Jacobi. (ed.), <em>Argumentationstheorie: Scholastische\nForschungen zu den logischen und semantischen Regeln korrekten\nFolgerns</em>, Leiden:Brill, 653–70.</li>\n<li>–––, 1997, “<em>Et maxime visus, cuius\nspecies venit ad stellas et ad quem species stellarum veniunt</em>:\nPerspectiva and Astrologia in Late Medieval Thought,”\n<em>Micrologus</em>, 5: 201–24.</li>\n<li>–––, 2006, “Seeing and Passion in the\nThirteenth and Fourteenth Centuries,” in J. F. Hamburger &amp;\nA-M. Bouche (eds.), <em>The Mind’s Eye: Art and Theological\nArgument in the Middle Ages</em>, Princeton: Princeton University\nPress. </li>\n<li>Thorndike, Lynn, 1914, “Roger Bacon and Experimental Method\nin the Middle Ages,” <em>Philosophical Review</em>, 23:\n271–298.</li>\n<li>–––, 1916, “The True Roger Bacon I,”\n&amp; “The True Roger Bacon II,” <em>The American\nHistorical Review</em> 21 (1916), 237–57; 468–80.</li>\n<li>Trifogli, Cecilia, 1997, “Roger Bacon and Aristotle’s\nDoctrine of Place,” in Hackett 1997b, pp. 155–176.</li>\n<li>–––, 2000, <em>Oxford Physics in the Thirteenth\nCentury (ca. 1250–1270), Motion, Infinity, Place and Time</em>\n(Studien Und Texte Zur Geistesgeschichte Des Mittelalters, Volume 72),\nLeiden: Brill.</li>\n<li>Vescovini, Graziella Federici, <em> Le Moyen Âge Magique: Le\nmagie entre religio et science au XIIIe et XIVe siècle</em>,\nParis: Vrin, 2011.</li>\n<li>Whewell, William, 1858, <em>History of the Inductive Sciences from\nthe Earliest Times to the Present Times</em> (Volume 1), New York: D.\nAppleton and Company.</li>\n<li>Williams, S. J., 1994, “Roger Bacon and his Edition of the\nPseudo-Aristotelian, <em>Secretum secretorum,” Speculum</em>,\n69: 57–73.</li>\n<li>Wood, Rega, 1997, “Roger Bacon: Richard Rufus’s\nSuccessor as a Parisian Physics Professor,” in Hackett 1997b,\n222–50.</li>\n<li>–––, 2005, “Richard of Cornwall’s\nSignificance in the Western Scientific Tradition,” in L.\nHonnefelder, Rega Wood et al., eds., <em>Albertus Magnus und die\nAnfänge der Aristoteles-Rezeption im lateinischen\nMittelalter</em>, Münster (Subsidia Albertina 1),\n455–92.</li>\n<li>–––, 2007, “Imagination and Experience in\nthe Sensory Soul and Beyond: Richard Rufus, Roger Bacon and their\nContemporaries,” in H. Lagerlund (ed.), <em>Forming the Mind:\nEssays on the Internal Senses and the Mind-Body Problem from Avicenna\nto the Medical Enlightenment</em> (Studies in the History of the\nPhilosophy of Mind, 5), Dordrecht, 35–57.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "al-Farabi",
            "al-Kindi",
            "Aquinas, Thomas",
            "Aristotle",
            "Aristotle, General Topics: ethics",
            "Aristotle, Special Topics: natural philosophy",
            "Augustine, Saint",
            "Bacon, Francis",
            "Cicero",
            "Duhem, Pierre",
            "Duns Scotus, John",
            "form vs. matter",
            "Giles of Rome",
            "Grosseteste, Robert",
            "Ibn al-Haytham",
            "Ibn Rushd [Averroes]",
            "Ibn Sina [Avicenna]",
            "individuals and individuation",
            "Kilwardby, Robert",
            "logic: ancient",
            "natural philosophy: in the Renaissance",
            "nominalism: medieval versions of",
            "Ockham [Occam], William",
            "properties",
            "realism",
            "Richard the Sophister [Ricardus Sophista, Magister abstractionum]",
            "semiotics: medieval",
            "Seneca",
            "soul, ancient theories of",
            "substance",
            "William of Auvergne"
        ],
        "entry_link": [
            {
                "../al-farabi/": "al-Farabi"
            },
            {
                "../al-kindi/": "al-Kindi"
            },
            {
                "../aquinas/": "Aquinas, Thomas"
            },
            {
                "../aristotle/": "Aristotle"
            },
            {
                "../aristotle-ethics/": "Aristotle, General Topics: ethics"
            },
            {
                "../aristotle-natphil/": "Aristotle, Special Topics: natural philosophy"
            },
            {
                "../augustine/": "Augustine, Saint"
            },
            {
                "../francis-bacon/": "Bacon, Francis"
            },
            {
                "../cicero/": "Cicero"
            },
            {
                "../duhem/": "Duhem, Pierre"
            },
            {
                "../duns-scotus/": "Duns Scotus, John"
            },
            {
                "../form-matter/": "form vs. matter"
            },
            {
                "../giles/": "Giles of Rome"
            },
            {
                "../grosseteste/": "Grosseteste, Robert"
            },
            {
                "../ibn-rushd/": "Ibn Rushd [Averroes]"
            },
            {
                "../ibn-sina/": "Ibn Sina [Avicenna]"
            },
            {
                "../robert-kilwardby/": "Kilwardby, Robert"
            },
            {
                "../logic-ancient/": "logic: ancient"
            },
            {
                "../natphil-ren/": "natural philosophy: in the Renaissance"
            },
            {
                "../ockham/": "Ockham [Occam], William"
            },
            {
                "../properties/": "properties"
            },
            {
                "../realism/": "realism"
            },
            {
                "../richard-sophister/": "Richard the Sophister [Ricardus Sophista, Magister abstractionum]"
            },
            {
                "../semiotics-medieval/": "semiotics: medieval"
            },
            {
                "../seneca/": "Seneca"
            },
            {
                "../ancient-soul/": "soul, ancient theories of"
            },
            {
                "../substance/": "substance"
            },
            {
                "../william-auvergne/": "William of Auvergne"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=roger-bacon\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/roger-bacon/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=roger-bacon&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/roger-bacon/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=roger-bacon": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/roger-bacon/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=roger-bacon&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/roger-bacon/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Bacon, Roger.\n <a href=\"http://www.geography.wisc.edu/histcart/bacon.html\" target=\"other\"><em>Opera Majoris, Pars Quarta, Mathematicae in Divinas Utilitas</em></a>\n (<em>Mathematics in the Service of Theology</em>), Herbert M. Howe\ntrans., maintained by the History of Cartography Project."
        ],
        "listed_links": [
            {
                "http://www.geography.wisc.edu/histcart/bacon.html": "Opera Majoris, Pars Quarta, Mathematicae in Divinas Utilitas"
            }
        ]
    }
}