{
    "url": "rule-of-law",
    "title": "The Rule of Law",
    "authorship": {
        "year": "Copyright © 2016",
        "author_text": "Jeremy Waldron\n<jeremy.waldron@nyu.edu>",
        "author_links": [
            {
                "http://its.law.nyu.edu/facultyprofiles/profile.cfm?personID=26993": "Jeremy Waldron"
            },
            {
                "mailto:jeremy%2ewaldron%40nyu%2eedu": "jeremy.waldron@nyu.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2016</a> by\n\n<br/>\n<a href=\"http://its.law.nyu.edu/facultyprofiles/profile.cfm?personID=26993\" target=\"other\">Jeremy Waldron</a>\n&lt;<a href=\"mailto:jeremy%2ewaldron%40nyu%2eedu\"><em>jeremy<abbr title=\" dot \">.</abbr>waldron<abbr title=\" at \">@</abbr>nyu<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Jun 22, 2016"
    ],
    "preamble": "\n\nThe phrase “the Rule of Law” has to be distinguished from\nthe phrase “a rule of law”. The latter phrase is used to\ndesignate some particular legal rule like the rule against\nperpetuities or the rule that says we have to file our taxes by a certain date. Those are\nrules of law, but the Rule of Law is one of the ideals of our\npolitical morality and it refers to the ascendancy of law as such and\nof the institutions of the legal system in a system of governance.\n\n\nThe Rule of Law comprises a number of principles of a formal and\nprocedural character, addressing the way in which a community is\ngoverned. The formal principles concern the generality, clarity,\npublicity, stability, and prospectivity of the norms that govern a\nsociety. The procedural principles concern the processes by which\nthese norms are administered, and the institutions—like courts\nand an independent judiciary that their administration requires. On\nsome accounts, the Rule of Law also comprises certain substantive\nideals like a presumption of liberty and respect for private property\nrights. But these are much more controversial (see\n section 1\n below). And indeed as we shall see there is a great deal of\ncontroversy about what the Rule of Law requires. \n",
    "toc": [
        {
            "#OneIdeaAmonOthe": "1. One Ideal among Others"
        },
        {
            "#ContRuleLaw": "2. The Contestedness of the Rule of Law"
        },
        {
            "#HistRuleLaw": "3. History of the Rule of Law"
        },
        {
            "#Aris": "3.1 Aristotle"
        },
        {
            "#JohnLock": "3.2 John Locke"
        },
        {
            "#Mont": "3.3 Montesquieu"
        },
        {
            "#Dice": "3.4 Dicey"
        },
        {
            "#Haye": "3.5 Hayek"
        },
        {
            "#Full": "3.6 Fuller"
        },
        {
            "#RuleLawRuleLaw": "4. Rule of Law and Rule by Law"
        },
        {
            "#FormProcSubsRequ": "5. Formal, Procedural and Substantive Requirements"
        },
        {
            "#FormAspe": "5.1 Formal Aspects"
        },
        {
            "#ProcAspe": "5.2 Procedural Aspects"
        },
        {
            "#SubsTheo": "5.3 Substantive Theories"
        },
        {
            "#ValuUndeRuleLaw": "6. The Values Underlying the Rule of Law"
        },
        {
            "#OppoRuleLaw": "7. Opposition to the Rule of Law"
        },
        {
            "#ContAbouAppl": "8. Controversies about Application"
        },
        {
            "#Disc": "8.1 Discretion"
        },
        {
            "#RuleStan": "8.2 Rules and Standards"
        },
        {
            "#LawSociNorm": "8.3 Law and Social Norms"
        },
        {
            "#Emer": "8.4 Emergencies"
        },
        {
            "#InteLaw": "8.5 International Law"
        },
        {
            "#DeveNatiBuil": "8.6 Development and Nation-Building"
        },
        {
            "#RuleLawConcLaw": "9. The Rule of Law and the Concept of Law"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. One Ideal among Others\n\nThe Rule of Law is one ideal in an array of values that dominates\nliberal political morality: others include democracy, human rights,\nsocial justice, and economic freedom. The plurality of these values\nseems to indicate that there are multiple ways in which social and\npolitical systems can be evaluated, and these do not necessarily fit\ntidily together. Some legal philosophers (e.g., Raz 1977) insist, as a\nmatter of analytic clarity, that the Rule of Law in particular must be\ndistinguished from democracy, human rights, and social justice. They\nconfine the focus of the Rule of Law to formal and procedural aspects\nof governmental institutions, without regard to the content of the\npolicies they implement. But the point is controversial. As we shall\nsee, some substantive accounts have been developed, which amount in\neffect to the integration of the Rule of Law with some of these other\nideals.\n2. The Contestedness of the Rule of Law\n\nThe most important demand of the Rule of Law is that people in\npositions of authority should exercise their power within a\nconstraining framework of well-established public norms rather than in\nan arbitrary, ad hoc, or purely discretionary manner on the\nbasis of their own preferences or ideology. It insists that the\ngovernment should operate within a framework of law in everything it\ndoes, and that it should be accountable through law when there is a\nsuggestion of unauthorized action by those in power.\n\nBut the Rule of Law is not just about government. It requires also\nthat citizens should respect and comply with legal norms, even when\nthey disagree with them. When their interests conflict with\nothers’ they should accept legal determinations of what their\nrights and duties are. Also, the law should be the same for everyone,\nso that no one is above the law, and everyone has access to the\nlaw’s protection. The requirement of access is particularly\nimportant, in two senses. First, law should be epistemically\naccessible: it should be a body of norms promulgated as public\nknowledge so that people can study it, internalize it, figure out what\nit requires of them, and use it as a framework for their plans and\nexpectations and for settling their disputes with others. Secondly,\nlegal institutions and their procedures should be available to\nordinary people to uphold their rights, settle their disputes, and\nprotect them against abuses of public and private power. All of this\nin turn requires the independence of the judiciary, the accountability\nof government officials, the transparency of public business, and the\nintegrity of legal procedures. \n\nBeyond these generalities, it is controversial what the Rule of Law\nrequires. This is partly because the Rule of Law is a working\npolitical idea, as much the property of ordinary citizens, lawyers,\nactivists and politicians as of the jurists and philosophers who study\nit. The features that ordinary people call attention to are not\nnecessarily the features that legal philosophers have emphasized in\ntheir academic conceptions. Legal philosophers tend to emphasize\nformal elements of the Rule of Law such as rule by general norms\n(rather than particular decrees); rule by norms laid down in advance\n(rather than by retrospective enactments); rule by norms that are made\npublic (not hidden away in the closets of the administration); and\nrule by clear and determinate legal norms (norms whose meaning is not\nso vague or contestable as to leave those who are subject to them at\nthe mercy of official discretion). But these are not necessarily what\nordinary people have in mind when they call for the Rule of Law; they\noften have in mind the absence of corruption, the independence of the\njudiciary, and a presumption in favor of liberty. \n\nContestation about what the Rule of Law requires is partly a product\nof the fact that law itself comprises many things, and people\nprivilege different aspects of a legal system. For some the common law\nis the epitome of legality; for others, the Rule of Law connotes the\nimpartial application of a clearly drafted statute; for others still\nthe Rule of Law is epitomized by a stable constitution that has been\nembedded for centuries in the politics of a country. When Aristotle\n(Politics 1287b), contrasted the Rule of Law\nwith the rule of men, he ventured the opinion that “a man may be\na safer ruler than the written law, but not safer than the customary\nlaw”. In our own era, F.A. Hayek (1973: 72 ff.) has been at\npains to distinguish the rule of law from the rule of legislation,\nidentifying the former with something more like the evolutionary\ndevelopment of the common law, less constructive and less susceptible\nto deliberate control than the enactment of a statute. There is also\ncontinual debate about the relation between law and the mechanisms of\ngovernment. For some, official discretion is incompatible with the\nRule of Law; for others it depends on how the discretion is framed and\nauthorized. For some the final determination of a court amounts to the\nRule of Law; for others, aware of the politics of the judiciary, rule\nby courts (particularly a politically divided court) is as much an\ninstance of the rule of men as the decision of any other junta or\ncommittee (see Waldron 2002 for a full account of these\ncontroversies).\n\nThe fact that the Rule of Law is a controversial idea does not stop\nvarious organizations from trying to measure its application in\ndifferent societies. Groups like the World Justice Project concoct\ncriteria and indexes of the Rule of Law, ranking the nations of the\nearth in this regard. Countries like Norway and New Zealand rank at\nthe top of the Rule-of-Law league and countries like Zimbabwe and\nAfghanistan at the bottom (see\n Other Internet Resources).\n The criteria can be hardly be described as rigorous. But people in\nbusiness value these rankings as part of their estimation of country\nrisk for foreign investments (see Barro 2000: 215ff.)\n3. History of the Rule of Law\n\nThe Rule of Law has been an important ideal in our political tradition\nfor millennia, and it is impossible to grasp and evaluate modern\nunderstandings of it without fathoming that historical heritage. The\nheritage of argument about the Rule of Law begins with Aristotle (c.\n350 BC); it proceeds with medieval theorists like Sir John Fortescue\n(1471), who sought to distinguish lawful from despotic forms of\nkingship; it goes on through the early modern period in the work of\nJohn Locke (1689), James Harrington (1656), and (oddly enough)\nNiccolò Machiavelli (1517); in the European Enlightenment in\nthe writings of Montesquieu (1748) and others; in American\nconstitutionalism in The Federalist Papers and (and even more\nforcefully) in the writings of the Federalists’ opponents; and,\nin the modern era, in Britain in the writings of A. V. Dicey (1885),\nF.A. Hayek (1944, 1960, and 1973), Michael Oakeshott (1983), Joseph\nRaz (1977), and John Finnis (1980), and in America in the writings of\nLon Fuller (1964), Ronald Dworkin (1985), and John Rawls (1971).\nBecause the heritage of this idea is so much a part of its modern\napplication, a few highlights need to be mentioned. \n3.1 Aristotle\n\nThe work of Aristotle on the Rule of Law is still influential. Though\nhe formulated the question of whether it was better to be ruled by the\nbest man or the best laws, he approached that question realistically,\nnoting that it depended not only on the type of law one was\nconsidering but also on the type of regime that enacted and\nadministered the law in question (Politics 1282b)\n\n\nBut Aristotle did maintain that law as such had certain advantages as\na mode of governance. Laws are laid down in general terms, well in\nadvance of the particular cases to which they may be applied.\nMoreover, \n\n\nlaws are made after long consideration, whereas decisions in the\ncourts are given at short notice, which makes it hard for those who\ntry the case to satisfy the claims of justice. (Rhetoric\n1354b) \n\n\nThere were, he conceded, some cases so fraught with difficulty that\nthey could not be handled by general rules—cases that required the\nfocused insight of particular judges; he used the term\nepieikeia (sometimes translated as equity). But these cases\nshould be kept to a minimum and legal training and legal institutions\nshould continue to play a role in the way they are disposed of.\nAristotle’s discussion of the general desirability of rules and\nhis treatment of epieikeia continue to influence modern\njurisprudence (see Scalia 1989 and Solum 1994).\n3.2 John Locke\n\nJohn Locke in the second of his Two Treatises of Government\n(1689) emphasized the importance of governance through\n“established standing Laws, promulgated and known to the\nPeople”. He contrasted this with rule by “extemporary\nArbitrary Decrees” (Locke 1689: §§135–7). Now\nthe term “arbitrary” can mean many different things.\nSometimes it means “oppressive”. But when Locke\ndistinguished the rule of settled standing laws from arbitrary\ndecrees, it was not the oppressive sense of “arbitrary”\nthat he had in mind. In this context, something is arbitrary because\nit is extemporary: there is no notice of it; the ruler just figures it\nout as he goes along. It is the arbitrariness of unpredictability, not\nknowing what you can rely on, being subject, as Locke put it (1689:\n§137), to someone’s \n\n\nsudden thoughts, or unrestrain’d, and till that moment unknown\nWills without having any measures set down which may guide and\njustifie their actions. \n\n\nIn Locke’s story, one of the things that people wanted to get\naway from in the state of nature was being subject to others’\nincalculable opinions—even when those others were thinking as\nhard and rigorously as they could about natural law. Your thinking\nmight be different from my thinking, and it might turn out that your\nview of the relation between your interests and my interests and your\nproperty and my interests might be quite different from my view of the\nmatter and quite different again from the view of the next person I\ncame across. The whole point of moving from a state of nature to a\nsituation of positive law was to introduce some predictability into\nthis picture.\n\nUnfortunately, having laid down this requirement, Locke complicated\nmatters by adding a substantive principle of respect for private\nproperty: “The Supream Power cannot take from any Man any part\nof his Property without his own consent”, and any law that\npurports to do so is of no validity (Locke 1689: §138). But then\nthere is a difficulty. Though Locke gave us his own theory of\nprepolitical property rights—the so-called “Labor\nTheory” in Chapter Five of the Second Treatise—it\nwas itself far from uncontroversial. People in our day, as in his,\ndisagree about the rival claims of labor and occupancy; they disagree\nabout the background of common ownership; and they disagree about how\nmuch anyone may appropriate and how sensitive his appropriation must\nbe to the needs of others. We disagree about all that—in ways\nthat were made evident, for example, in the debates about the Lockean\ntheory of Robert Nozick (1974). And Locke and his contemporaries\ndisagreed too; Locke knew, and signaled in a number of places that he\nknew just how controversial all this was (Tully 1980: 64 ff; for\nLocke’s awareness of the controversies, see Waldron 1999:\n74–5).\n\nBy insisting therefore that positive law is subject to this\nsubstantive constraint, Locke subjected the legislature to a\ndiscipline of uncertainty. Because the natural right of property was\ncontroversial, so the administration of any substantive constraint\nalong these lines was bound to be controversial. And because the\nsubstantive constraint was supposed to affect the validity of positive\nlaw (Locke 1689: §135), the effect would be that some\npeople—let’s say those who disagreed with Locke about the\nclaims of labor over occupancy—would disagree with him about\nwhich positive rules of property are valid and which are not. \n3.3 Montesquieu\n\nMontesquieu’s work on the Rule of Law is best known in\nconnection with his insistence on the separation of\npowers—particularly the separation of judicial power from\nexecutive and legislative authority (see Montesquieu 1748: Bk. 11, Ch.\n6). The judiciary has to be able to do its work as the mouthpiece of\nthe laws without being distracted from fresh decisions made in the\ncourse of its considerations by legislators and policy-makers.\nMontesquieu’s views on the separation of powers had a profound\neffect on the American founding, particularly in the work of James\nMadison (Federalist Papers, §47).\n\nElsewhere in The Spirit of the Laws, Montesquieu developed a\ntheory of the value of legalism. Noting that despotic governments tend\nto have very simple laws which they administered peremptorily with\nlittle respect for procedural delicacy, Montesquieu argued that legal\nand procedural complexity tended to be associated with respect for\npeople’s dignity. He associated this sort of respect with a\nmonarchy ruling by law, as opposed to despotism:\n\n\nIn monarchies, the administering of a justice that hands down\ndecisions not only about life and goods, but also about honor,\nrequires scrupulous inquiries. The fastidiousness of the judge grows\nas more issues are deposited with him, and as he pronounces upon\ngreater interests. (Montesquieu 1748: Bk. VI, ch. 1, p. 72)\n\n\nThis emphasis on the value of complexity—the way in which\ncomplicated laws, particularly laws of property, provide hedges\nbeneath which people can find shelter from the intrusive demands of\npower—has continued to fascinate modern theorists of the rule of\nlaw (e.g., Thompson 1975: 258–69).\n\nIn the modern debate we also hear echoes of the doctrine propounded in\nThe Spirit of the Laws (1748: Bk. 26, ch. 15, p.510) that\n“things that depend on principles of civil right must not be\nruled by principles of political right”. “Civil\nright”—Montesquieu’s word for what we call private\nlaw—is, he said, “the palladium of property”, and it\nshould be allowed to operate according to its own logic, not burdened\nwith the principles of public or political regulation. A failure of\nthe Rule of Law in this regard is likely to lead to the impoverishment\nof an economy, as expectations collapse, and owners’ incentives\nfor production and enterprise are undermined (Montesquieu 1748: Bk. V,\nch. 14, p. 61).\n3.4 Dicey\n\nWriting in the second half of the 19th century, Albert Venn\nDicey bemoaned what he saw as a decline in respect for the Rule of Law\nin England. The Rule of Law used to be a proud tradition that\ndistinguished governance in England both from the executive domination\nof droit administratif in France and also from the fatuous\nand abstract certainties of paper constitutions in countries like\nBelgium etc. For Dicey, the key to the Rule of Law was legal equality:\n\n\n\n[W]ith us no man is above the law [and] every man, whatever be his\nrank or condition, is subject to the ordinary law of the realm and\namenable to the jurisdiction of the ordinary tribunals. (1992 [1885]:\n114) \n\n\nAttractive as this is in the abstract, it exhibited a certain naivety\nso far as the legal position of state officials was concerned.\nOfficials are and often need to be treated differently in law than the\nordinary citizen: they need certain extra powers and they need to be\nhemmed in by extra restrictions, so that they can be held accountable\nfor the actions they perform in the name of the community. For the\nordinary person, the Rule of Law generates a presumption in favor of\nliberty: everything which is not expressly prohibited is permitted.\nBut for the state and its officials, we may want to work with the\ncontrary presumption: the state may act only under express legal\nauthorization.\n\nDicey had a knack of expressing the Rule of Law in terms of principles\nwhose eloquent formulations belied their deeper difficulties. His\nfirst principle of the Rule of Law was: \n\n\n[N]o man is punishable or can be lawfully made to suffer in body or\ngoods except for a distinct breach of law established in the ordinary\nlegal manner before the ordinary Courts of the land. (Dicey 1992\n[1885]: 110) \n\n\nThis seems fine if we are talking about the imposition of criminal\nsanctions. But “made to suffer in … goods” can also\nbe read to connote the imposition of restrictions on the use of\npersonal or corporate property, or the giving or withholding of\nlicenses, grants, and subsidies. It can be read as precluding any form\nof discretionary regulation. Dicey was indeed inclined to disparage\nall administrative discretion, particularly where it seemed to be\nsuperseding what had traditionally been regarded as judicial\nfunctions. But can we really do without discretion in modern\ngovernance? Some modern scholars of administrative law have denounced\nDicey’s account as an “extravagant”,\n“absurd”, and pernicious version of the Rule of Law (Davis\n1969: 27–32).\n3.5 Hayek\n\nF.A. Hayek was by training an economist, but he also nurtured an\ninterest in the relation between legal structures and forms of\nnational economy. Hayek’s work on the Rule of Law proceeded in\ntwo phases: (1) from his wartime book The Road to Serfdom\n(1944) through to The Constitution of Liberty (Hayek 1960);\nand (2) the somewhat different account presented in his trilogy,\nLaw, Legislation and Liberty (1973), an account which is more\ncongenial to the spirit of common law and hostile to the role of\nlegislation.\n\n(1) Governance during wartime necessarily required total mobilization\nand management of all of the society’s manpower and resources.\nHayek warned in 1944 against the retention of anything like this mode\nof administration in peacetime. He made an eloquent argument that in\nnormal times a society need not be managed but should be\ngoverned—and its people largely left to their own\ndevices—within a framework of general rules laid down in\nadvance. These rules would operate impersonally to protect people from\none another, not being aimed at any person or situation in particular\nand not being dependent for their operation on any expectation on the\npart of government as to what the particular effects of their\napplication would be. But this lack of particular knowledge on the\npart of the government would be offset by the fact that rules would\nprovide a framework of predictability for ordinary people and\nbusinesses. They would know that they would not be molested by the\nstate, provided they operated within the parameters of the general and\nimpersonal rules. Human freedom, on Hayek’s account, did not\npreclude all state action; but it does require that state action be\ncalculable.\n\n(2) In the 1970s, Hayek began to rethink all this. The attention was\nstill on the implications of Rule of Law for liberty. But now Hayek\nbegan to wonder whether the texts of clear general legislated rules\nwould really provide an appropriate framework for freedom. It was, he\nsaid, a mistake to think that “by confining the judge to the\napplication of already articulated rules we will increase the\npredictability of his decisions”. Articulated rules are\n“often a very imperfect formulation of principles which people\ncan better honour in action than express in words” (Hayek 1973:\n118). He favored something more like a common law model of\npredictability, with principles and solutions emerging from a series\nof judicial decisions in an almost evolutionary\n way.[1]\n The evolution of principles that distinguished themselves by their\nreasonableness was superior, Hayek thought, to the deliberate\nimposition of rules by a legislator. According to Hayek, the\nlegislative mentality is inherently managerial; it is oriented in the\nfirst instance to the organization of the state’s own\nadministrative apparatus; and its extension into the realm of public\npolicy generally means an outward projection of that sort of\nmanagerial mentality with frightful consequences for liberty and\nmarkets. \n3.6 Fuller\n\nLon Fuller believed that government in accordance with the forms and\nprocedures of law had a distinctive value that could help close the\ngap of separation between positive law, on the one hand, and morality\nand justice on the other. The conventional wisdom of the legal\npositivists held that laws could be impeccably drafted and\neven-handedly administered and still be hideously unjust: antebellum\nslave law in the United States and apartheid law in South Africa were\noften cited as examples. But Fuller believed, as a matter of political\npsychology, that there would be reluctance to use the forms of\nlaw—general and public norms—to embody and inscribe\ninjustice. He believed that “coherence and goodness [had] more\naffinity than coherence and evil”, he thought bad things\nhappened in the dark as opposed to the sunlight of legality, and he\nmaintained that “even in the most perverted regimes there is a\ncertain hesitancy about writing cruelties, intolerances, and\ninhumanities into law” (Fuller 1958: 636–7). \n\nFuller acknowledged that this link between legality and justice was\ntentative. It was certainly controversial. But whether this connection\nheld or not, he also wanted to insist that the complete absence of\nrespect for formal criteria of legality might deprive a system of\npower of its status as law:\n\n\nWhen a system calling itself law is predicated upon a general\ndisregard by judges of the terms of the laws they purport to enforce,\nwhen this system habitually cures its legal irregularities, even the\ngrossest, by retroactive statutes, when it has only to resort to\nforays of terror in the streets, which no one dares challenge, in\norder to escape even those scant restraints imposed by the pretense of\nlegality—when all these things have become true of a\ndictatorship, it is not hard for me, at least, to deny to it the name\nof law. (Fuller 1958: 660)\n\n\nIn his 1964 book The Morality of Law, Fuller formulated\nprinciples of what he called “the inner morality of\nlaw”—principles requiring that laws be general, public,\nprospective, coherent, clear, stable, and practicable—and he\nargued that these were indispensable to law-making. Reviewing\nFuller’s book, H.L.A. Hart (1965) asked in what sense these\nprinciples could be called a “morality”. They seemed to be\nmore like instrumental principles for effective legislation, and on\nHart’s view, they were only as moral as the enterprise they made\npossible. \n\nFuller responded by denying that the significance of his eight\nprinciples was purely instrumental. They also constituted a morality\nof respect for the freedom and dignity of the agents addressed by the\nlaw: what they made possible was a mode of governance that worked\nthrough ordinary human agency rather than short-circuiting it through\nmanipulation or terror. This thesis was separate from the connection\nbetween law and morality intimated in Fuller 1958. But the two\naccounts of the moral significance of law were connected in a way that\nJohn Finnis explained:\n\n\nA tyranny devoted to pernicious ends has no self-sufficient reason to\nsubmit itself to the discipline of operating consistently through the\ndemanding processes of law, granted that the rational point of such\nself-discipline is the very value of reciprocity, fairness, and\nrespect for persons which the tyrant, ex hypothesis, holds in\ncontempt. (1980: 273)\n\n\nFuller’s work on the Rule of Law had one last nuance. He\nunderstood that law constituted a distinct kind of governance that\nmight not be relevant for every task of the state. He contrasted it\nnot just with a Nazi-style reign of terror, but with the sort of\nmanagerial administration that might be necessary for allocative\ndecision-making in a mixed economy like the United States in the\n1960s. In modern political economy, said Fuller, we face problems of\ninstitutional design “unprecedented in scope and\nimportance”. Focusing more on the procedural side of the Rule of\nLaw, Fuller insisted that we lawyers acknowledge that although\n“[a]djudication is a process with which we are familiar and\nwhich enables us to show to advantage our special talents”,\nstill it may be “an ineffective instrument for economic\nmanagement” (Fuller 1964: 176).\n4. Rule of Law and Rule by Law\n\nSome theorists draw a distinction between the Rule of Law and what\nthey call rule by law (see e.g., Tamanaha 2004: 3). They\ncelebrate the one and disparage the other. The Rule of Law is supposed\nto lift law above politics. The idea is that the law should stand\nabove every powerful person and agency in the land. Rule by law, in\ncontrast, connotes the instrumental use of law as a tool of political\npower. It means that the state uses law to control its citizens but\ntries never to allow law to be used to control the state. Rule by law\nis associated with the debasement of legality by authoritarian\nregimes, in modern China for example.\n\nThomas Hobbes may be seen as a theorist of rule by law. In a society\nwhose members disagree about property, he thought it conducive to\npeace for the sovereign of a society “to make some common Rules\nfor all men, and to declare them publiquely, by which every man may\nknow what may be called his, what anothers” (Hobbes 1647: Bk.\nII, ch. 6, sect. ix).\nBut Hobbes also thought that it would undermine peace—indeed it\nwould undermine the very logic of sovereignty—for the ultimate\nlaw-maker to be bound by the laws he applied to his subjects (Hobbes\n1991 [1651]: 184).\n\nHowever, the distinction may not be so clear-cut. Even rule by law\nseems to imply that rulers accept something like the formal discipline\nof legality. Unless the orders issued by the state are general, clear,\nprospective, public, and relatively stable, the state is not ruling by\nlaw. So this thin version of legality does still have moral\nsignificance in the respect it pays to the human need for clarity and\npredictability. Rule by law “can be a way a government …\nstabilizes and secures expectations” (Goodpaster 2003: 686).\nEven if its use remains instrumental to the purposes of the state, it\ninvolves what Fuller called a bond of reciprocity with the purposes of\nthose who are governed: the latter are assured that the promulgated\nrules are the ones that will be used to evaluate their actions (see\nalso Winston 2005: 316).\n\nSome jurists who maintain the contrast between the Rule of Law and\nrule by law have a more ambitious agenda. They take seriously the\nancient idea that we might be ruled by laws and not by men. One may\nask: how is that supposed to happen? After all, all law is made by\npeople and interpreted by people and applied by people. It can no more\nrule us by itself, without human assistance, than a cannon can\ndominate us without an iron-monger to cast it and an artilleryman to\nload and fire it. The jurists who contrast the Rule of Law with rule\nby law believe they can make this work by focusing on laws whose human\norigins are in some way diffuse or immemorial. We are not necessarily\ntalking here about natural law, but perhaps about something like\ncustomary law or common law—law that is not so evidently a\ntop-down product of powerful human law-makers (Epstein 2011). Common\nlaw grows and develops under its own steam, and need not be conceived\nas a device by which some identifiable humans rule over others. No\ndoubt there is a lot of mythology in this. A more realistic view of\ncommon law identifies it with the deliberate and arbitrary rule of an\nentity that Bentham (1792) called “Judge & Co”. But it\nremains true that the human element is diffuse in this sort of system,\nand at any given time the law that emerges is a resultant of the work\nof many people rather than the intentional product of a domineering\nmajority ruling us from the legislative center of a state.\n\nAs we saw in the discussion of Hayek (1973), the other side of this\ncoin is a disparagement of legislation, precisely because its\nenactment seems patently and undeniably to represent the rule of\npowerful officials. Legislation is a matter of will. The\nlegislative process produces law simply by virtue of a bunch of people\nin an assembly deciding that a given law is to be produced.\nAnd this is done by the very men—powerful politicians—to\nwhose power the Rule of Law is supposed to be an alternative. \n\nHowever, most people who value the Rule of Law do not accept this\napproach. If a statute is properly drafted (if it is clear,\nintelligible and expressed in general terms) and prospectively enacted\nand promulgated, and if it is administered impartially and with due\nprocess—they will call this an entirely appropriate exercise\nunder the Rule of Law. Indeed that is what many scholars mean by the\nRule of Law: people being governed by measures laid down in advance in\ngeneral terms and enforced equally according to the terms in which\nthey have been publicly promulgated. The argument that it should be\nput aside because it does not contrast sufficiently with the rule of\nmen seems perverse.\n\nNo one doubts that legislation can sometimes undermine the Rule of\nLaw, by purporting for example to remove legal accountability from a\nrange of official actions or to preclude the possibility of judicial\nreview of executive action. But this is not a problem with legislation\nas such; this is a concern about the content of particular enactments.\nRule by judges, too, can sometimes be seen as the very sort of rule by\nmen that the Rule of Law is supposed to supersede (see Waldron 2002:\n142–3 and 147–8). \n5. Formal, Procedural and Substantive Requirements\n\nTheorists of the Rule of Law are fond of producing laundry lists of\nthe principles it comprises. These principles are of disparate kinds,\nwhich may loosely be divided into principles that address the formal\naspects of governance by law; principles that address its procedural\naspects ; and principles that embrace certain substantive values.\n5.1 Formal Aspects\n\nThe best known are the eight formal principles of Lon Fuller’s\n“inner morality of law”: (1964; see also the lists in\nFinnis 1980: 270–1; Rawls 1999: 208–10; and Raz 1979 [1977]:\n214–18) generality; publicity; prospectivity; intelligibility;\nconsistency; practicability; stability; and congruence. These\nprinciples are formal, because they concern the form of the norms that\nare applied to our conduct. \n\nSo for example, the requirement that laws be general in character,\nrather than aimed at particular individuals, is purely a matter of\nform. It is compatible with invidious discrimination so far as its\nsubstance is concerned, since even a norm like “A person who is\nof African descent must sit in the back of any public bus that they\nride on” applies, universalizably, to everyone. A formal\nrequirement of generality does not guarantee justice; but that partly\nreflects the fact that justice and the Rule of Law work as separate\ncriteria for evaluating a political system.\n\nGenerality is an important feature of legality, reflected in the\nlongstanding constitutional antipathy to Bills of Attainder. Of course\nlaw cannot work without particular orders, but as Raz points out (1979\n[1977]: 213) the generality requirement is usually taken to mean that\n“the making of particular laws should be guided by open and\nrelatively stable general rules”. These rules themselves should\noperate impersonally and impartially.\n\nBesides the form of the rules themselves there is also the nature of\ntheir presence in society. The Rule of Law envisages law operating as\na relatively stable set of norms available as public knowledge. It\nrequires that laws be public and that they be promulgated well in\nadvance of individuals’ being held responsible for complying\nwith them. These are features that flow partly from the fact that laws\nare supposed to guide conduct, which they cannot do if they are secret\nor retroactive. But it is not just a matter of the pragmatics of\ngovernance. Laws face in two directions: (i) they impose requirements\nfor ordinary citizens to comply with; and (ii) they issue instructions\nto officials about what to do in the event of non-compliance by the\ncitizens. Laws that are secret and retroactive so far as (i) is\nconcerned may still operate effectively in respect of (ii). So the\nRule-of-Law requirements of publicity and prospectivity have an\nadditional significance: they require that citizens be put on notice\nof what is required of them and of any basis on which they are liable\nbe held to account.\n\nThe requirement of clarity is also important in this regard. Laws must\nbe public not only in the sense of actual promulgation but also in the\nsense of accessibility and intelligibly. True, much modern law is\nnecessarily technical (Weber 1968 [1922]: 882–95) and the\nlay-person will often require professional advice as to what the law\nrequires of him. It is also an important part of the Rule of Law that\nthere be a competent profession available to offer such advice and\nthat the law must be such as to make it possible for professionals at\nleast to get a reliable picture of what the law at any given time\nrequires. In the nineteenth century, Jeremy Bentham (1782: ch. 15 and\n1792) criticized customary law in general, and common law in\nparticular, for failing to satisfy this requirement: the sources of\nlaw were hidden in obscurity and though there were spurious appeals to\nprecedent, much of the law was just made up by the judges as they went\nalong.\n5.2 Procedural Aspects\n\nWe should complement this list of formal characteristics with a list\nof procedural principles as well, which are equally indispensable to\nthe Rule of Law. We might say that no one should have any penalty,\nstigma or serious loss imposed upon them by government except as the\nupshot of procedures that involve (I have adapted this list from\nTashima 2008: 264):\n\n a hearing by an impartial and independent tribunal that is\nrequired to administer existing legal norms on the basis of the formal\npresentation of evidence and argument;\n a right to representation by counsel at such a hearing\n a right to be present, to confront and question witnesses, and to\nmake legal argument about the bearing of the evidence and the various\nlegal norms relevant to the case; and \n a right to hear reasons from the tribunal when it reaches its\ndecision, which are responsive to the evidence and arguments presented\nbefore it.\n\n\nArguably, such procedural principles matter more in the ordinary\nperson’s conception of the Rule of Law than the formal criteria\nmentioned in the previous section. When people worried that the\nAmerican detention facility in Guantanamo Bay from 2003 to the present\nwas a “black hole” so far as legality was concerned, it\nwas precisely the lack of these procedural rights that they were\nconcerned about. What the detainees demanded, in the name of the Rule\nof Law, was an opportunity to appear before a proper legal tribunal,\nto confront and answer the evidence against them (such as it was), and\nto be represented so that their own side of the story could be\nexplained. No doubt the integrity of these proceedings would depend in\npart on the formal characteristics of the legal norms that were\nsupposed to govern their detention, whose application in their case\nthey could call in question at the hearings that they demanded. It is\ndifficult to make a case at a hearing if the laws governing detention\nare kept secret or are indeterminate or are constantly changing. Even\nso, we still miss out on a whole important dimension of the Rule of\nLaw ideal if we do not also focus on the procedural demands themselves\nwhich, as it were, give the formal side of the Rule of Law this\npurchase. \n\nSome procedural requirements are also institutional in character:\nthere must be courts and there must be judges whose independence of\nthe other branches of government is guaranteed. This side of the Rule\nof Law is connected with the constitutional principle of the\nseparation of powers. That principle is sometimes justified simply on\nthe ground that it is unhealthy for power to be institutionally\nconcentrated in society. But it also has a Rule of Law justification\ninasmuch as it assigns distinct significance to distinct stages in the\nmaking and application of laws (Waldron 2013).\n5.3 Substantive Theories\n\nThough many jurists follow Raz 1977 in thinking that the Rule of Law\nis a purely formal/procedural ideal, others believe in adding a more\nsubstantive dimension. They do not think it is possible to sharply\nseparate our political ideals in the way Raz seems to suppose. At the\nvery least, the formal/procedural aspects generate a certain momentum\nin a substantive direction. Generality—proceeding according to a\nrule—is often said to contain the germ of justice (Hart 1961:\nch. 8). And, stability, publicity, clarity, and prospectivity indicate\na pretty fundamental connection between the Rule of Law and the\nconditions of liberty. We have to be careful, however, to distinguish\nbetween allegedly substantive requirements of the Rule of Law and\nspecification of the deeper values that underlie and motivate the\nideal even in its formal and procedural requirements.\n\nSome jurists believe that there is a special affinity between the Rule\nof Law and the vindication and support of private property. Ronald\nCass (2004: 131) says that “[a] critical aspect of the\ncommitment to the rule of law is the definition and protection of\nproperty rights”. \n\n\n[T]he degree to which the society is bound by law, is committed to\nprocesses that allow property rights to be secure under legal rules\nthat will be applied predictably and not subject to the whims of\nparticular individuals, matters. The commitment to such processes is\nthe essence of the rule of law. Cass (2004: 131)\n\n\nOthers, like Richard Epstein (2011: 10), accept that\n“[a]nalytically, the rule of law is … a separate\nconception from private property”. But they think nevertheless\nthat a contingent connection between the Rule of Law and private\nproperty can be established by showing that the forms of regulation\ndefenders of private property are concerned about tend to be forms of\nregulation that the Rule of Law, even on a more austere conception,\nprohibits.\n\nIt is also widely believed—though not necessarily by the same\npeople who associate legality with property—that a system of\npositive law that fails to respect fundamental human rights should not\nbe dignified with the term “the Rule of Law”. The World\nJustice Project in 2011 quoted Arthur Chaskalson, former Chief Justice\nof South Africa, to this effect:\n\n\n[T]he apartheid government, its officers and agents were accountable\nin accordance with the laws; the laws were clear; publicized, and\nstable, and were upheld by law enforcement officials and judges. What\nwas missing was the substantive component of the rule of law. The\nprocess by which the laws were made was not fair (only whites, a\nminority of the population, had the vote). And the laws themselves\nwere not fair. They institutionalized discrimination, vested broad\ndiscretionary powers in the executive, and failed to protect\nfundamental rights. Without a substantive content there would be no\nanswer to the criticism, sometimes voiced, that the rule of law is\n“an empty vessel into which any law could be poured”.\n(World Justice Project 2011: 9)\n\n\nOn the other hand, as we have seen, Joseph Raz (1979 [1977]: 211) is\nfamous for insisting that “the rule of law is just one of the\nvirtues which a legal system may possess and by which it is to be\njudged”, and that we should not try to read into it other\nconsiderations about democracy, human rights, and social justice.\nThose considerations, he said, are better understood as independent\ndimensions of assessment. Tom Bingham, in his book on The Rule of\nLaw, said this in response to Raz:\n\n\nWhile … one can recognize the logical force of Professor\nRaz’s contention, I would roundly reject it in favor of a\n“thick” definition, embracing the protection of human\nrights within its scope. A state which savagely represses or\npersecutes sections of its people cannot in my view be regarded as\nobserving the rule of law, even if the transport of the persecuted\nminority to the concentration camp or the compulsory exposure of\nfemale children on the mountainside is the subject of detailed laws\nduly enacted and scrupulously observed. (Bingham 2010: 67)\n\n\nLord Bingham’s position has an intuitive appeal in the eyes of\nmany commentators, even if it irritates in its casual rejection of a\npoint whose logic it claims to recognize.\n\nBoth Chaskalson and Bingham seem to want to fill out the formal/\nprocedural conception of the Rule of Law with some human rights\ncomponent. And many liberals are inclined to follow them in that. But\nthis is not the only possibility. Many associate the Rule of Law with\na presumption of liberty or the principle of human dignity.\nOthers—Arthur Chaskalson hinted at this—associate the Rule\nof Law with a substantive dimension of democracy. \n\nAll this sounds an analytic danger signal. Once we open up the\npossibility of the Rule of Law’s having a substantive dimension,\nwe inaugurate a sort of competition in which everyone clamors to have\ntheir favorite political ideal incorporated as a substantive dimension\nof the Rule of Law. Those who favor property rights and market economy\nwill scramble to privilege their favorite values in this regard. But\nso will those who favor human rights, or those who favor democratic\nparticipation, or those who favor civil liberties or social justice.\nThe result is likely to be a general decline in political articulacy,\nas people struggle to use the same term to express disparate\nideals.\n6. The Values Underlying the Rule of Law\n\nEven if the principles of the Rule of Law are purely formal in their\napplication, we don’t just value them for formalistic reasons.\nMost fundamentally, people value the Rule of Law because it takes some\nof the edge off the power that is necessarily exercised over them in a\npolitical community. In various ways, being ruled through law, means\nthat power is less arbitrary, more predictable, more impersonal, less\nperemptory, less coercive even. It establishes what Fuller (1964:\n39–40) called a bond of reciprocity—a mutuality of\nconstraint—between the ruler and the ruled, and in that sense it\nmitigates the asymmetry that political power otherwise involves.\n\nConnected with this, the Rule of Law is valuable and important because\nit establishes an environment that is conducive to liberty. According\nto Hayek’s theory of the Rule of Law—particularly in the\nearly phase of his work (see\n section 3.5\n above)—we value requirements like generality and impersonality\nbecause they free us from dependence upon others’ wills:\n\n\nMy action can hardly be regarded as subject to the will of another\nperson if I use his rules for my own purposes as I might use my\nknowledge of a law of nature, and if that person does not know of my\nexistence or of the particular circumstances in which the rules will\napply to me or of the effects they will have on my plans. (Hayek 1960:\n152)\n\n\nHayek also maintained that requirements of clarity, prospectivity and\nso on make an important contribution to predictability, which he\nthought was indispensable for individual freedom. Predictability is\noften cited as a Rule-of-Law virtue. In his well-known recent book on\nthe subject, Tom Bingham indicated that one of the most important\nthings people needed from the law that governed them was\npredictability in the conduct of their lives and businesses. He quoted\nLord Mansfield to the effect that \n\n\n[i]n all mercantile transactions the great object should be certainty:\n… it is of more consequence that a rule should be certain, than\nwhether the rule is established one way rather than the other. (Lord\nMansfield in Vallejo v. Wheeler (1774) 1 Cowp. 143, p. 153\n(cited by Bingham 2010: 38)) \n\n\nBingham went on to observe in his own voice that \n\n\n[n]o one would choose to do business … involving large sums of\nmoney, in a country where parties’ rights and obligations were\nundecided. (Bingham 2010: 38) \n\n\nThese conceptions claim to bring a certain air of reality to our\ndiscussions of freedom. There may be no getting away from legal\nconstraint in the circumstances of modern life, but freedom is\npossible nevertheless if people know in advance how the law will\noperate and how they have to act to avoid its application. Knowing in\nadvance how the law will operate enables one to make plans and work\naround its requirements (see Hayek 1960: 153 and 156–7). And\nknowing that one can count on the law’s protecting property and\npersonal rights gives each citizen some certainty about what he can\nrely on in his dealings with other people. The Rule of Law is\nviolated, on this account, when the norms that are applied by\nofficials do not correspond to the norms that have been made public to\nthe citizens or when officials act on the basis of their own\ndiscretion rather than norms laid down in advance. If action of this\nsort becomes endemic, then not only are people’s expectations\ndisappointed, but increasingly they will find themselves unable to\nform expectations on which to rely, and the horizons of their\nplanning and their economic activity will shrink accordingly.\n\nSo we need a basis for expectation. The best account of the importance\nof legal expectations was given by the utilitarian philosopher Jeremy\nBentham, in a work called “Principles of the Civil Code”.\nExpectation, said Bentham, is “a chain which unites our present\nexistence to our future existence”. \n\n\nIt is hence that we have the power of forming a general plan of\nconduct; it is hence that the successive instants which compose the\nduration of life are not isolated and independent points, but become\ncontinuous parts of a whole. (Bentham 1931 [1802, 1864]: 111) \n\nThe establishment of expectations, said Bentham, is largely the work\nof law, and the security of expectations is a vital constraint on the\naction of law: “The principle of security … requires that\nevents, so far as they depend upon laws, should conform to the\nexpectations which law itself has created…”.\n\nJoseph Raz and Lon Fuller took the point about freedom even further.\nRaz (1979 [1977]: 221) suggested that securing an atmosphere conducive\nto freedom was a matter of dignity: “Respecting human dignity\nentails treating humans as persons capable of planning and plotting\ntheir future” (Raz 1979 [1977]: 221). In Lon Fuller’s\ntheory, too, the principles of the inner morality of law were valued\nfor the way they respected dignity:\n\n\nTo embark on the enterprise of subjecting human conduct to rules\ninvolves … a commitment to the view that man is … a\nresponsible agent, capable of understanding and following\nrules…. Every departure from the principles of law’s\ninner morality is an affront to man’s dignity as a responsible\nagent. To judge his actions by unpublished or retrospective laws, or\nto order him to do an act that is impossible, is to convey …\nyour indifference to his powers of self-determination. (Fuller 1964:\n162)\n\n\nWhat is said here about the connection between dignity and\nFuller’s formal principles can be said even more about the\nconnection between procedure and dignity. Procedural principles\ncapture a deep and important sense that law is a mode of governing\npeople that treats them as though they had a perspective of their own\nto present on the application of norms to their conduct and situation.\nApplying a norm to a human individual is not like deciding what to do\nabout a rabid animal or a dilapidated house. It involves paying\nattention to a point of view. As such it embodies a crucial\ndignitarian idea—respecting the dignity of those to whom the\nnorms are applied as beings capable of explaining themselves.\n7. Opposition to the Rule of Law\n\nNo account of the Rule of Law is complete if it does not mention the\nways in which this ideal is deprecated. The laudatory history of the\nRule of Law in the work of thinkers like Aristotle, Locke, Dicey,\nHayek and Fuller has been matched by opponents of legality such as\nPlato (in The Statesman), Thomas Hobbes (at least if the Rule\nof Law is supposed to take us beyond rule by law), and Carl Schmitt\n1923 (in his attack on parliamentarism and on the liberal assumption\nthat rules can prevail even under conditions of endemic crisis).\n\nThe criticism by Plato (c. 370 BC) has been the most enduring. From\nhis perspective, which extolled the application of focused\nintelligence and insight by those in power, insistence upon the use of\nlaw in government was \n\n\nlike a stubborn, stupid person who refuses to allow the slightest\ndeviation from or questioning of his own rules, even if the situation\nhas in fact changed and it turns out to be better for someone to\ncontravene these rules. (Statesman 294b–c) \n\n\nRules themselves were part of the problem: “People and\nsituations differ, and human affairs are characterized by an almost\npermanent state of instability” (Statesman 294b). One would use them, only as a (distant) second-best, if one felt\none couldn’t discern or trust the appearance of expertise in\npolitical life. These concerns are echoed in the work of modern legal\npragmatists (like Posner 1995) who place much more faith in insight of\njudges into new situations than in the application of established\nrules or strained analogies with ancient precedents. \n\nEchoes of the Platonic critique are also heard in those who privilege\ndecisive executive decision-making in times of crisis, especially if\nthe crises seem to be successive and unending (Schmitt 1923; Posner\nand Vermeule 2010). Someone’s will has to prevail and, it is\nsaid, the Rule of Law does us no service by pretending that the\nelement of will can be eliminated from politics or that decisiveness\nmatters less than the “long deliberation” that was\nextolled in Aristotle's Rhetoric.\n\nThe sense of what good law-making and ordinary legal administration\nrequire conveyed by the principles of the Rule of Law is sometimes\ncriticized as archaic. Partisans of the Rule of Law often think in\nterms of clearly drafted and prospective measures promulgated as norms\nthat can stand in the name of the whole community and form a publicly\nacknowledged framework for their actions and transactions. But this is\nnot really how law operates in the modern world. As Rubin 1989 points\nout, a great deal of modern legislation consists simply of a\nframe-working statute authoring agencies to develop much more detailed\nrules which are conveyed to the public—to the extent that is\nnecessary—by modes of communication much more complex and\nnuanced than those envisaged in traditional models of the Rule of Law.\nFor example, the principles comprised in Fuller 1964’s inner\nmorality of law—see\n section 3.6\n above—are recipes perhaps for the production of legislation\nthat looks congenial to legalistic concerns about clarity and\npredictability. But it has little or nothing to do with the way law\nactually operates or the way legislatures communicate with agencies\nand agencies in turn communicate with those whose actions and\nbusinesses they supervise (Rubin 1989: 397–408).\n\nAt the same time, there are concerns about the mentality that is\nfostered by an excessive emphasis on the Rule of Law. In its most\nextreme form, the Rule of Law can have the effect of closing down the\nfaculty of independent moral thought in the officials (the judges, for\nexample: see Cover 1975) or in the ordinary members of a community,\nmaking them anxious in the face of uncertainty and distrustful of\ntheir own or others’ individual judgments (see Henderson\n1990). Sometimes it is\nimportant, for the sake of clear and courageous moral judgment, not to\nexaggerate the importance of something being required by law. Other\nconcerns about the mentality fostered by the Rule of Law include\nconcerns about legalism and the tendency to over-formalize or\nover-bureaucratize relationships that are more healthily conceived in\nterms that are more informal. This is not just a matter of legalizing\nthe personal realm; it is also a matter of understanding, for example,\nthe damage that can be done to relations between officials (like\nsocial workers) and vulnerable clients by replacing bringing in rigid\nrules to replace relatively informal professional norms (Simon\n1983). \n8. Controversies about Application\n\nAs well as these debates about the value of the Rule of Law there is,\nwithin the camp of those who stand for legality, incessant controversy\nabout what the Rule of Law requires. I have mentioned the general\ndebates between defenders of formal, procedural, and substantive\nconceptions. There are also a number of particular debates.\n8.1 Discretion\n\nHow far should it be the mission of the Rule of Law to eliminate or\nreduce the amount of discretion in the way a society is governed? Some\njurists, like Dicey (1885) and to a lesser extent Hayek (1944) insist\nthat official discretion is inherently antithetical to the Rule of\nLaw. Others, like Davis (1969), condemn this as an extravagant\nposition, arguing that discretion is ineliminable in the modern\nadministrative state. The rule of the Rule of Law is not to eliminate\ndiscretion, but to ensure that it is properly framed and authorized,\nand that the application of rules and judicial procedures is preserved\nfor those cases where liberty and well-being are most seriously at\nstake.\n8.2 Rules and Standards\n\nA similar question arises with regard to the use of norms that have\nthe character of standards rather than rules. (A rule is like a\nnumerical speed limit, whereas a standard is like a norm that requires\npeople to drive at a “reasonable” speed.) Legal systems\nuse both types of norm (Sunstein 1994); they use standards for cases\nwhere the appropriate decision may vary with ambient circumstances and\nit seems better to trust the judgment of those who face a particular\nsituation, rather than laying it down in advance. There is an element\nof respect for individuals’ powers of discernment conveyed in\nthe use of a standard. At the same time standards allow for less\ncertainty in the law, especially when it is difficult for the person\nattempting to comply with the norm to predict how his judgment will be\nviewed by an official or by a court. Hayek suggests that \n\n\n[o]ne could write a history of the decline of the Rule of Law …\nin terms of the progressive introduction of these vague formulas into\nlegislation and jurisdiction. (1972 [1944]: 78) \n\n\nWhether he is right depends partly on how far we take the Rule of Law\nto be wedded to predictability: is predictability the be-all and\nend-all, or does the Rule of Law also promise a kind of legal system\nthat frames and facilitates reason and thoughtfulness in human\naffairs?\n8.3 Law and Social Norms\n\nSometimes situations can be governed and disputes settled by informal\nsocial norms rather than by positive law, formally enacted and\nenforced (Ellickson 1994). Opinions differ as to whether this should\nbe regarded as something altogether different from the Rule of Law. On\nthe one hand, it looks like a genuine alternative, and little is\ngained by assimilating its desirable features, such as they are, to\nRule-of-Law requirements. On the other hand, it does have something in\ncommon with understandings of customary law and conceptions of the\nRule of Law (like that of Hayek 1973) that try to separate themselves\nfrom enactment and legislation. Also it is sometimes said that the\nRule of Law works best when what is enforced in a society can be\nmapped on to its members’ norms of fairness and common-sense.\nThis makes social participation in the integrity and upholding of law\nmore likely (Cooter 1997). The closer this mapping, the less of an\ninvestment there has to be in formal legal promulgation: ordinary\nknow-how can become a reliable guide to legal knowledge. However, one\nhas to be very cautious with this. Modern law is inevitably technical\nin ways that far outstrip the possibilities of intuitive understanding\n(Weber 1968 [1922]: 882–95). The best that can be hoped for is\nsome sort of occasional consonance between enacted law and informal\nunderstandings, and the sporadic character of that may well heighten\nrather than reduce unpredictability. \n8.4 Emergencies\n\nIs it reasonable to use the Rule of Law to evaluate the way a society\nresponds to emergencies? It is often thought that emergencies require\nforms of state action that are more peremptory and less procedurally\nlaborious than those required in normal times. As a matter of fact, a\nnumber of possibilities have been discussed (Scheuerman 2006). One is\nto insist, in the name of the Rule of Law, that existing\nconstitutional safeguards should remain in force; that, after all, is\nwhat they were designed for and these situations are where they are\nmost urgently needed. Alternatively, in emergencies, one might rely on\na general spirit of flexibility and circumstantial sensitivity in\nstate action that is encouraged even in normal times. On this second\noption, the Rule of Law does not present itself as a major constraint\non the flexibility of state action in face of danger. As a third\noption, one might seek to preserve something like the Rule of Law by\nlaying down in advance specific legal rules to govern\nemergencies—rules that suspend ordinary civil liberties\nguarantees for example or authorize widespread discretion on the part\nof officials to undertake action that would normally be governed by\ngeneral rules of law. (Machiavelli proposed a version of this in his\nDiscourses (1517), extolling the institution of dictator in\nthe Roman republic.) This option has the advantage of predictability;\nbut its disadvantage is that it endorses a sort of\nRule-of-Law-lite, which may eventually infect or supersede\nthe conception of the Rule of Law that is supposed to be normally\napplicable.\n8.5 International Law\n\nThe Rule of Law applies not only within national polities but also\nincreasingly between them, but in this arena its use remains\nunder-theorized (for a helpful discussion, see Crawford 2003). Much of\nthe work that has been done on the international Rule of Law simply\nadopts uncritically the perspective of those who say, at the national\nlevel, that the Rule of Law requires determinacy, clarity, and\npredictability (see Chesterman 2008). But this may be misconceived\nwhen we are talking about states rather than individuals as the\nsubjects of law (Waldron 2011b). States are in a much better position to be informed of\nwhat their legal requirements are than individual men and women in\nsociety, since they are parties to the treaties and practices that\nestablish international law. (Maybe, though, this point does not hold\nto the same extent when we consider the murky depths of customary\ninternational law.)\n\nAnyway, the liberty of an individual state is not such an important\nvalue as the liberty of an individual person. It is not clear that\nnational states need protection from international law and the power\nthat it represents in the way that ordinary men and women need\nprotection from the exercise of political power in society. Moreover,\nin areas like international human rights law, any presumption based on\nthe Rule of Law in favor of the liberty of national states will tend\nto have detrimental effects on the liberty or well-being of individual\nmen and women. We have to be careful therefore that invocation of the\nRule of Law in the international realm does not undermine the values\nthat are supposed to be secured by this ideal within national\npolities.\n\nOne additional point. It remains controversial whether international\ninstitutions themselves—like the United Nations and its\nagencies—should be bound by the Rule of Law. This odd because\nthese agencies are among the most vociferous advocates of the Rule of\nLaw so far as its application to national states is concerned. The\nreluctance here stems in large part from an estimation of the\nimportance of diplomatic immunity. UN officials worry that if they and\ntheir agencies are held legally liable for malfeasances of various\nkinds associated with peace-keeping activities, there is a danger that\nthe whole basis of international action might unravel. The danger is\nprobably exaggerated, however, and those who make this argument would\nnot for a moment countenance a similar argument in the sphere of\nnational states.\n8.6 Development and Nation-Building\n\nThe Rule of Law is often cited as the key to nation-building and to\nthe establishment of new democracies. Indeed it is often argued (e.g.,\nBarro 2000) that a new state needs Rule-of-Law\ninstitutions—effective courts and commercial codes that can\nsecure property rights and the enforcement of contracts—more\nthan or even before it needs democratic institutions such as an\nelected legislature. It is said that a legal system in a developing\ncountry dominated by legislative action will neither inspire the\nconfidence nor establish the stability that modern governance and\ninvestment require. (For discussion of these arguments, see Carothers\n1998 and—more critically—Carothers 2009.) This raises once\nmore the question of relation between the Rule of Law and\nlegislation—only now it takes us also in the direction of\nconsidering an rather uncomfortably direct trade-off between Rule of\nLaw values and democracy.\n9. The Rule of Law and the Concept of Law\n\nFinally, an analytic question. What is the relation between the Rule\nof Law and the concept of law? A case can be made—controversial,\nno doubt—for bringing the two of them together (see Waldron 2008\nand also Simmonds 2008). The concept of law could be understood to\nembrace the fundamental elements of legality, though this\nidentification looks less plausible the more substantive the\nconception of the Rule of Law is held to be. On this account, a system\nof governance doesn’t count as law unless it exhibits the\ncharacteristic forms and processes that we associate with legality.\nOtherwise we lose our sense of the institutional distinctiveness of\nlaw as a way of ruling a society. We saw earlier that Lon Fuller (1958\nand 1964) envisaged a connection along these lines. So, in his later\nwork did Ronald Dworkin. Dworkin (2004) asked us to consider a\nsituation in which judges and lawyers were grappling with hard issues\nof interpretation or with difficult dilemmas posed by multiple sources\nof law. He said that in such cases, we might say that what was\nrequired as a matter of law might be different from what was required\nas a matter of justice. That is a familiar separation (even if Dworkin\nthought it was narrower and more blurred than most legal positivists\nbelieved). But he said, it would make no sense to say that what was\nrequired as a matter of legality or respect for the Rule of Law was\ndifferent from what the legal solution was to this case. To figure out\nthe legal solution we have to address the various legal and political\nmaterials precisely in light of our commitment to legality. \n\n\nA conception of legality is … a general account of how to\ndecide which particular claims are true…. We could make little\nsense of either legality or law is we denied this intimate connection.\n(Dworkin 2004: 24–5)\n\n\nHowever this is not the received position. According to Joseph Raz\n(1977) and others you cannot understand what the Rule of Law is unless\nyou already and independently understand what law is and the\ncharacteristic evils that law is likely to give rise to (which the\nRule of Law tries to prevent). On this account, legality represents a\nparticular set of concerns about law that have emerged in our\ncivilization. The fact that these concerns are undoubtedly moral in\ncharacter (even though they are not comprehensive moral concerns)\nmeans that—in Raz’s view—it is better to keep them\nseparate from the concept of law itself, for fear of introducing a\nmoral element into that concept.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aristotle, <em>The Politics</em> (c. 350 BC), Stephen Everson\n(trans.), Cambridge: Cambridge University Press, 1988.",
                "–––, <em>The Rhetoric</em> (c. 350 BC), Rhys\nRoberts (trans.), New York: Cosimo Classics, 2010.",
                "Barro, R., 2000, “Democracy and the Rule of Law”, in\n<em>Governing for Prosperity</em>, B. de Mesquita and H. Root (eds.),\nNew Haven: Yale University Press.",
                "Bentham, J., 1970 [1782], <em>Of Laws in General</em>, H.L.A.\nHart (ed.), London: Athlone Press.",
                "–––, 1792, <em>Truth versus Ashhurst; or, Law\nas it is, Contrasted with what it is Said to be</em>.\n [<a href=\"https://www.ucl.ac.uk/bentham-project/truth-versus-ashhurst\" target=\"other\">Bentham 1792 available online</a>\n .",
                "–––, 1931 [1802, 1864], <em>The Theory of\nLegislation</em>, C.K. Ogden (ed.), London: Kegan Paul, Trench,\nTrubner &amp; Co.. This was originally published in French translation\n(done by Etienne Dumont) in 1802 and translated back into English in\n1864 (by Richard Hildreth), the latter is the translation used in the\nOgden edition.",
                "Bingham, T., 2010, <em>The Rule of Law</em>, London: Allen\nLane.",
                "Carothers, T., 1998, “The Rule-of-Law Revival”,\n<em>Foreign Affairs</em>, 77: 95–106.",
                "–––, 2009, “Rule of Law\nTemptations”, <em>Fletcher Forum of World Affairs</em>, 33:\n49–61.",
                "Cass, R., 2001, <em>The Rule of Law in America</em>, Baltimore:\nJohns Hopkins University Press.",
                "–––, 2004, “Property Rights Systems and\nthe Rule of Law”, <em>The Elgar Companion to the Economics of\nProperty Right</em>, E. Colombatto, (ed.), Oxford: Edward Elgar\nPublications, pp. 131–63.",
                "Chesterman, S., 2008, “An International Rule of Law?”\n<em>American Journal of Comparative Law</em>, 56: 331–61.",
                "Cooter, R., 1997, “The Rule of State Law versus the\nRule-of-Law State: Economic Analysis of the Legal Foundations of\nDevelopment”, in <em>Annual World Bank Conference on Development\nEconomics</em>, Washington: World Bank, pp. 191–206.",
                "Cover, R., 1975, <em>Justice Accused: Slavery and the Judicial\nProcess</em>, New Haven: Yale University Press.",
                "Craig, P., 1997, “Formal and Substantive Conceptions of the\nRule of Law: An Analytical Framework” <em>Public Law</em>,\n[1997]: 467–87.",
                "Crawford, J., 2003, “The Rule of Law in International\nLaw”, 24 <em>Adelaide Law Review</em>, 24: 3–12. ",
                "Davis, K.C., 1969, <em>Discretionary Justice: A Preliminary\nInquiry</em>, Louisiana State University Press.",
                "Dicey, A.V., 1982 [1885], <em>Introduction to the Study of the\nLaw of the Constitution</em>, London: McMillan and Co. Page numbers\nare from the 1982 version based on the 8<sup>th</sup> edition (1915),\nIndianapolis: Liberty Classics.\n [<a href=\"http://files.libertyfund.org/files/1714/0125_Bk.pdf\" target=\"other\">Dicey 1982 [1885] available online</a>]",
                "Dworkin, R., 1977, <em>Taking Rights Seriously</em>, Cambridge:\nHarvard University Press.",
                "–––, 1985, “Political Judges and the Rule\nof Law”, in his <em>A Matter of Principle</em>, Cambridge,\nHarvard University Press, pp. 9–32.",
                "–––, 2004, “Hart’s Postscript and\nthe Character of Political Philosophy”, <em>Oxford Journal of\nLegal Studies</em>, 24: 1–37.",
                "Ellickson, R., 1994, <em>Order without Law: How Neighbors Settle\nDisputes</em>, Cambridge: Harvard University Press. ",
                "Endicott, T., 1999, “The Impossibility of the Rule of\nLaw”, <em>Oxford Journal of Legal Studies</em>, 19:\n1–18.",
                "Epstein, R.A., 2011, <em>Property Rights and the Rule of Law:\nClassical Liberalism Confronts the Modern Administrative State</em>,\nCambridge: Harvard University Press.",
                "Finnis, J., 1980, <em>Natural Law and Natural Rights</em>,\nOxford: Clarendon Press.",
                "Fortescue, J., 1997 [1471], <em>On the Laws and Governance of\nEngland</em>, Shelley Lockwood (ed.), Cambridge: Cambridge University\nPress.",
                "Fuller, L., 1958, “Positivism and Fidelity to Law: A Reply\nto Hart”, <em>Harvard Law Review</em>, 71(4): 630–72.\ndoi:10.2307/1338226 ",
                "–––, 1964, <em>The Morality of Law</em>, New\nHaven: Yale University Press.",
                "–––, 1978, “Forms and Limits of\nAdjudication”, <em>Harvard Law Review</em>, 92(2):\n353–409. doi:10.2307/1340368 ",
                "Goodpaster, G., 2003, “Law Reform in Developing\nCountries”, 13 <em>Transnational Law and Contemporary\nProblems</em>, 13: 659–98.",
                "Hamilton, A., J. Madison, and J. Jay, 1787, <em>The Federalist\nPapers</em>, New York: Signet Classics, 2003.",
                "Harrington, James, 1656, <em>The Commonwealth of Oceana</em>,\nJ.G.A. Pocock (ed.), Cambridge: Cambridge University Press, 1992.",
                "Hart, H. and A. Sacks, 1958, <em>The Legal Process: Problems in\nthe Making and Application of Law</em>, Westbury: Foundation Press,\n1994. ",
                "Hart, H.L.A., 1965, “Book Review: Lon Fuller, <em>The\nMorality of Law</em>”, <em>Harvard Law Review</em>, 78:\n1281–96.",
                "–––, 1961, <em>The Concept of Law</em>,\n3<sup>rd</sup> edition, Oxford: Clarendon Press, 2012.",
                "Hayek, F.A., 1972 [1944], <em>The Road to Serfdom</em>, Chicago:\nUniversity Of Chicago Press.",
                "–––, 1960, <em>The Constitution of\nLiberty</em>, Chicago: University of Chicago Press.",
                "–––, 1973, <em>Rules and Order</em>, Volume 1\nof<em>Law, Legislation and Liberty</em>, Chicago: University of\nChicago Press.",
                "Henderson, L., 1991, “Authoritarianism and the Rule of Law”,\n<em>Indiana Law Journal</em>, 66: 379–456.",
                "Hobbes, T., 1983 [1647], <em>De Cive: the English version</em>,\nH. Warrender (ed.), Oxford: Oxford University Press.",
                "–––, 1991 [1651], <em>Leviathan</em>, R. Tuck\n(ed.), Cambridge: Cambridge University Press.",
                "Locke, J., 1689, <em>Two Treatises of Government</em>, P. Laslett\n(ed.), Cambridge: Cambridge University Press, 1988.",
                "Machiavelli, N., 1517, <em>Discourses on Livy</em>, H. Mansfield\nand N. Tarcov (ed.), Chicago: University of Chicago Press, 1996.",
                "Marmor, A., 2004, “The Rule of Law and Its Limits”,\n<em>Law and Philosophy</em>, 23: 1–43.",
                "Montesquieu, C., 1748, <em>The Spirit of the Laws</em>, A.\nCohler, C. Miller, and H. Stone (eds.), Cambridge: Cambridge\nUniversity Press, 1989.",
                "Nozick, R., 1974, <em>Anarchy, State and Utopia</em>, New York:\nBasic Books.",
                "Oakeshott, M., 1983, “The Rule of Law”, in his <em>On\nHistory, and Other Essays</em>, Totowa, NJ: Barnes and Noble, 129-78.\n\n",
                "Plato, <em>The Statesman</em>, (c. 370 BC), Julia Annas (trans.),\nCambridge: Cambridge University Press, 1995.",
                "Posner, E, and A. Vermeule, 2010, <em>The Executive Unbound:\nAfter the Madisonian Republic</em>, Oxford: Oxford University\nPress.",
                "Posner, R., 1995, <em>Overcoming Law</em>, Cambridge: Harvard\nUniversity Press.",
                "Postema, G., 1986, <em>Bentham and the Common Law Tradition</em>,\nOxford: Oxford University Press.",
                "Raz, J., 1977, “The Rule of Law and its Virtue”, in\nhis book, <em>The Authority of Law</em>, Oxford: Oxford University\nPress, 1979.",
                "Rawls, J. 1999, <em>A Theory of Justice</em>, Cambridge: Harvard\nUniversity Press.",
                "Rubin, E., 1989, “Law and Legislation in the Administrative\nState”, <em>Columbia Law Review</em>, 89: 369–426.",
                "Scalia, A., 1989, “The Rule of Law as a Law of\nRules”, <em>University of Chicago Law Review</em>, 56:\n1175–88.",
                "Schauer, F., 1991, <em>Playing By the Rules: A Philosophical\nExamination of Rule-Based Decision-Making in Law and in Life</em>,\nOxford: Oxford University Press.",
                "Scheuerman, W., 2006, “Emergency Powers and the Rule of Law\nafter 9/11”, <em>Journal of Political Philosophy</em>, 14:\n61–84.",
                "Schmitt, Carl, 1923, <em>The Crisis of Parliamentary\nDemocracy</em>, Ellen Kennedy (trans.), Cambridge, MIT Press,\n1985.",
                "Simmonds, N.E., 2008, <em>Law as a Moral Idea</em>, Oxford:\nOxford University Press.",
                "Simon, W., 1983, “Legality, Bureaucracy and Class in the\nWelfare System”, <em>Yale Law Journal</em>, 92:\n1198–1269.",
                "Solum, L., 1994, “Equity and the Rule of Law”, in\n<em>Nomos XXXVI: The Rule of Law</em>, Ian Shapiro (ed.), New York:\nNew York University Press, pp. 120–47.",
                "Sunstein, C.R., 1994, “Rules and Rulelessness”,\n(Coase-Sandor Institute for Law and Economics Working Paper No. 27),\nUniversity of Chicago Law School.\n [<a href=\"http://chicagounbound.uchicago.edu/cgi/viewcontent.cgi?article=1434&amp;context=law_and_economics\" target=\"other\">Sunstein 1994 available online</a>]\n ",
                "Tamanaha, B., 2004, <em>On the Rule of Law: History, Politics,\nTheory</em>, Cambridge: Cambridge University Press.",
                "Tashima, W., 2008, “The War on Terror and the Rule of\nLaw”, <em>Asian American Law Journal</em>, 15:\n245–65.",
                "Thompson, E.P., 1975, <em>Whigs and Hunters: The Origin of the\nBlack Act</em>, Harmondsworth: Penguin Books.",
                "Tully, J., 1980, <em>A Discourse on Property: John Locke and his\nAdversaries</em>, Cambridge: Cambridge University Press.",
                "Waldron, J., 1999, <em>The Dignity of Legislation</em>,\nCambridge: Cambridge University Press.",
                "–––, 2002, “Is the Rule of Law an\nEssentially Contested Concept (in Florida)?” <em>Law and\nPhilosophy</em>, 21: 137–64.",
                "–––, 2007, “Legislation and the Rule of\nLaw”, <em>Legisprudence</em>, 1: 91–123.",
                "–––, 2008, “The Concept and the Rule of\nLaw”, <em>Georgia Law Review</em>, 43: 1–61.",
                "–––, 2011a, “The Rule of Law and the\nImportance of Procedure”, in <em>Nomos 50: Getting to the Rule\nof Law</em>, James Fleming (ed.), New York: New York University Press,\n3–31.",
                "–––, 2011b, “Are Sovereigns Entitled to\nthe Benefit of the Rule of Law?” <em>European Journal of\nInternational Law</em>, 22: 315–43.",
                "–––, 2013, “Separation of Powers in\nThought and Practice”, <em>Boston College Law Review</em>, 54:\n433–68.",
                "Weber, M., 1968 [1922], <em>Economy and Society</em>, G. Roth and\nC. Wittich (eds.), Volume II, Berkeley: University of California\nPress.",
                "Winston, K., 2005, “The Internal Morality of Chinese\nLegalism”, <em>Singapore Journal of Legal Studies</em>,\n2005(Dec): 313–47.",
                "World Justice Project, 2011, <em>Rule of Law Index</em>, (2011\nedition), <a href=\"http://worldjusticeproject.org/publication/rule-law-index-reports/rule-law-index-2011-report\" target=\"other\">available online</a>, see also  <a href=\"#Oth\">Other Internet Resources</a> below."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Aristotle, <em>The Politics</em> (c. 350 BC), Stephen Everson\n(trans.), Cambridge: Cambridge University Press, 1988.</li>\n<li>–––, <em>The Rhetoric</em> (c. 350 BC), Rhys\nRoberts (trans.), New York: Cosimo Classics, 2010.</li>\n<li>Barro, R., 2000, “Democracy and the Rule of Law”, in\n<em>Governing for Prosperity</em>, B. de Mesquita and H. Root (eds.),\nNew Haven: Yale University Press.</li>\n<li>Bentham, J., 1970 [1782], <em>Of Laws in General</em>, H.L.A.\nHart (ed.), London: Athlone Press.</li>\n<li>–––, 1792, <em>Truth versus Ashhurst; or, Law\nas it is, Contrasted with what it is Said to be</em>.\n [<a href=\"https://www.ucl.ac.uk/bentham-project/truth-versus-ashhurst\" target=\"other\">Bentham 1792 available online</a>\n .</li>\n<li>–––, 1931 [1802, 1864], <em>The Theory of\nLegislation</em>, C.K. Ogden (ed.), London: Kegan Paul, Trench,\nTrubner &amp; Co.. This was originally published in French translation\n(done by Etienne Dumont) in 1802 and translated back into English in\n1864 (by Richard Hildreth), the latter is the translation used in the\nOgden edition.</li>\n<li>Bingham, T., 2010, <em>The Rule of Law</em>, London: Allen\nLane.</li>\n<li>Carothers, T., 1998, “The Rule-of-Law Revival”,\n<em>Foreign Affairs</em>, 77: 95–106.</li>\n<li>–––, 2009, “Rule of Law\nTemptations”, <em>Fletcher Forum of World Affairs</em>, 33:\n49–61.</li>\n<li>Cass, R., 2001, <em>The Rule of Law in America</em>, Baltimore:\nJohns Hopkins University Press.</li>\n<li>–––, 2004, “Property Rights Systems and\nthe Rule of Law”, <em>The Elgar Companion to the Economics of\nProperty Right</em>, E. Colombatto, (ed.), Oxford: Edward Elgar\nPublications, pp. 131–63.</li>\n<li>Chesterman, S., 2008, “An International Rule of Law?”\n<em>American Journal of Comparative Law</em>, 56: 331–61.</li>\n<li>Cooter, R., 1997, “The Rule of State Law versus the\nRule-of-Law State: Economic Analysis of the Legal Foundations of\nDevelopment”, in <em>Annual World Bank Conference on Development\nEconomics</em>, Washington: World Bank, pp. 191–206.</li>\n<li>Cover, R., 1975, <em>Justice Accused: Slavery and the Judicial\nProcess</em>, New Haven: Yale University Press.</li>\n<li>Craig, P., 1997, “Formal and Substantive Conceptions of the\nRule of Law: An Analytical Framework” <em>Public Law</em>,\n[1997]: 467–87.</li>\n<li>Crawford, J., 2003, “The Rule of Law in International\nLaw”, 24 <em>Adelaide Law Review</em>, 24: 3–12. </li>\n<li>Davis, K.C., 1969, <em>Discretionary Justice: A Preliminary\nInquiry</em>, Louisiana State University Press.</li>\n<li>Dicey, A.V., 1982 [1885], <em>Introduction to the Study of the\nLaw of the Constitution</em>, London: McMillan and Co. Page numbers\nare from the 1982 version based on the 8<sup>th</sup> edition (1915),\nIndianapolis: Liberty Classics.\n [<a href=\"http://files.libertyfund.org/files/1714/0125_Bk.pdf\" target=\"other\">Dicey 1982 [1885] available online</a>]</li>\n<li>Dworkin, R., 1977, <em>Taking Rights Seriously</em>, Cambridge:\nHarvard University Press.</li>\n<li>–––, 1985, “Political Judges and the Rule\nof Law”, in his <em>A Matter of Principle</em>, Cambridge,\nHarvard University Press, pp. 9–32.</li>\n<li>–––, 2004, “Hart’s Postscript and\nthe Character of Political Philosophy”, <em>Oxford Journal of\nLegal Studies</em>, 24: 1–37.</li>\n<li>Ellickson, R., 1994, <em>Order without Law: How Neighbors Settle\nDisputes</em>, Cambridge: Harvard University Press. </li>\n<li>Endicott, T., 1999, “The Impossibility of the Rule of\nLaw”, <em>Oxford Journal of Legal Studies</em>, 19:\n1–18.</li>\n<li>Epstein, R.A., 2011, <em>Property Rights and the Rule of Law:\nClassical Liberalism Confronts the Modern Administrative State</em>,\nCambridge: Harvard University Press.</li>\n<li>Finnis, J., 1980, <em>Natural Law and Natural Rights</em>,\nOxford: Clarendon Press.</li>\n<li>Fortescue, J., 1997 [1471], <em>On the Laws and Governance of\nEngland</em>, Shelley Lockwood (ed.), Cambridge: Cambridge University\nPress.</li>\n<li>Fuller, L., 1958, “Positivism and Fidelity to Law: A Reply\nto Hart”, <em>Harvard Law Review</em>, 71(4): 630–72.\ndoi:10.2307/1338226 </li>\n<li>–––, 1964, <em>The Morality of Law</em>, New\nHaven: Yale University Press.</li>\n<li>–––, 1978, “Forms and Limits of\nAdjudication”, <em>Harvard Law Review</em>, 92(2):\n353–409. doi:10.2307/1340368 </li>\n<li>Goodpaster, G., 2003, “Law Reform in Developing\nCountries”, 13 <em>Transnational Law and Contemporary\nProblems</em>, 13: 659–98.</li>\n<li>Hamilton, A., J. Madison, and J. Jay, 1787, <em>The Federalist\nPapers</em>, New York: Signet Classics, 2003.</li>\n<li>Harrington, James, 1656, <em>The Commonwealth of Oceana</em>,\nJ.G.A. Pocock (ed.), Cambridge: Cambridge University Press, 1992.</li>\n<li>Hart, H. and A. Sacks, 1958, <em>The Legal Process: Problems in\nthe Making and Application of Law</em>, Westbury: Foundation Press,\n1994. </li>\n<li>Hart, H.L.A., 1965, “Book Review: Lon Fuller, <em>The\nMorality of Law</em>”, <em>Harvard Law Review</em>, 78:\n1281–96.</li>\n<li>–––, 1961, <em>The Concept of Law</em>,\n3<sup>rd</sup> edition, Oxford: Clarendon Press, 2012.</li>\n<li>Hayek, F.A., 1972 [1944], <em>The Road to Serfdom</em>, Chicago:\nUniversity Of Chicago Press.</li>\n<li>–––, 1960, <em>The Constitution of\nLiberty</em>, Chicago: University of Chicago Press.</li>\n<li>–––, 1973, <em>Rules and Order</em>, Volume 1\nof<em>Law, Legislation and Liberty</em>, Chicago: University of\nChicago Press.</li>\n<li>Henderson, L., 1991, “Authoritarianism and the Rule of Law”,\n<em>Indiana Law Journal</em>, 66: 379–456.</li>\n<li>Hobbes, T., 1983 [1647], <em>De Cive: the English version</em>,\nH. Warrender (ed.), Oxford: Oxford University Press.</li>\n<li>–––, 1991 [1651], <em>Leviathan</em>, R. Tuck\n(ed.), Cambridge: Cambridge University Press.</li>\n<li>Locke, J., 1689, <em>Two Treatises of Government</em>, P. Laslett\n(ed.), Cambridge: Cambridge University Press, 1988.</li>\n<li>Machiavelli, N., 1517, <em>Discourses on Livy</em>, H. Mansfield\nand N. Tarcov (ed.), Chicago: University of Chicago Press, 1996.</li>\n<li>Marmor, A., 2004, “The Rule of Law and Its Limits”,\n<em>Law and Philosophy</em>, 23: 1–43.</li>\n<li>Montesquieu, C., 1748, <em>The Spirit of the Laws</em>, A.\nCohler, C. Miller, and H. Stone (eds.), Cambridge: Cambridge\nUniversity Press, 1989.</li>\n<li>Nozick, R., 1974, <em>Anarchy, State and Utopia</em>, New York:\nBasic Books.</li>\n<li>Oakeshott, M., 1983, “The Rule of Law”, in his <em>On\nHistory, and Other Essays</em>, Totowa, NJ: Barnes and Noble, 129-78.\n\n</li><li>Plato, <em>The Statesman</em>, (c. 370 BC), Julia Annas (trans.),\nCambridge: Cambridge University Press, 1995.</li>\n<li>Posner, E, and A. Vermeule, 2010, <em>The Executive Unbound:\nAfter the Madisonian Republic</em>, Oxford: Oxford University\nPress.</li>\n<li>Posner, R., 1995, <em>Overcoming Law</em>, Cambridge: Harvard\nUniversity Press.</li>\n<li>Postema, G., 1986, <em>Bentham and the Common Law Tradition</em>,\nOxford: Oxford University Press.</li>\n<li>Raz, J., 1977, “The Rule of Law and its Virtue”, in\nhis book, <em>The Authority of Law</em>, Oxford: Oxford University\nPress, 1979.</li>\n<li>Rawls, J. 1999, <em>A Theory of Justice</em>, Cambridge: Harvard\nUniversity Press.</li>\n<li>Rubin, E., 1989, “Law and Legislation in the Administrative\nState”, <em>Columbia Law Review</em>, 89: 369–426.</li>\n<li>Scalia, A., 1989, “The Rule of Law as a Law of\nRules”, <em>University of Chicago Law Review</em>, 56:\n1175–88.</li>\n<li>Schauer, F., 1991, <em>Playing By the Rules: A Philosophical\nExamination of Rule-Based Decision-Making in Law and in Life</em>,\nOxford: Oxford University Press.</li>\n<li>Scheuerman, W., 2006, “Emergency Powers and the Rule of Law\nafter 9/11”, <em>Journal of Political Philosophy</em>, 14:\n61–84.</li>\n<li>Schmitt, Carl, 1923, <em>The Crisis of Parliamentary\nDemocracy</em>, Ellen Kennedy (trans.), Cambridge, MIT Press,\n1985.</li>\n<li>Simmonds, N.E., 2008, <em>Law as a Moral Idea</em>, Oxford:\nOxford University Press.</li>\n<li>Simon, W., 1983, “Legality, Bureaucracy and Class in the\nWelfare System”, <em>Yale Law Journal</em>, 92:\n1198–1269.</li>\n<li>Solum, L., 1994, “Equity and the Rule of Law”, in\n<em>Nomos XXXVI: The Rule of Law</em>, Ian Shapiro (ed.), New York:\nNew York University Press, pp. 120–47.</li>\n<li>Sunstein, C.R., 1994, “Rules and Rulelessness”,\n(Coase-Sandor Institute for Law and Economics Working Paper No. 27),\nUniversity of Chicago Law School.\n [<a href=\"http://chicagounbound.uchicago.edu/cgi/viewcontent.cgi?article=1434&amp;context=law_and_economics\" target=\"other\">Sunstein 1994 available online</a>]\n </li>\n<li>Tamanaha, B., 2004, <em>On the Rule of Law: History, Politics,\nTheory</em>, Cambridge: Cambridge University Press.</li>\n<li>Tashima, W., 2008, “The War on Terror and the Rule of\nLaw”, <em>Asian American Law Journal</em>, 15:\n245–65.</li>\n<li>Thompson, E.P., 1975, <em>Whigs and Hunters: The Origin of the\nBlack Act</em>, Harmondsworth: Penguin Books.</li>\n<li>Tully, J., 1980, <em>A Discourse on Property: John Locke and his\nAdversaries</em>, Cambridge: Cambridge University Press.</li>\n<li>Waldron, J., 1999, <em>The Dignity of Legislation</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2002, “Is the Rule of Law an\nEssentially Contested Concept (in Florida)?” <em>Law and\nPhilosophy</em>, 21: 137–64.</li>\n<li>–––, 2007, “Legislation and the Rule of\nLaw”, <em>Legisprudence</em>, 1: 91–123.</li>\n<li>–––, 2008, “The Concept and the Rule of\nLaw”, <em>Georgia Law Review</em>, 43: 1–61.</li>\n<li>–––, 2011a, “The Rule of Law and the\nImportance of Procedure”, in <em>Nomos 50: Getting to the Rule\nof Law</em>, James Fleming (ed.), New York: New York University Press,\n3–31.</li>\n<li>–––, 2011b, “Are Sovereigns Entitled to\nthe Benefit of the Rule of Law?” <em>European Journal of\nInternational Law</em>, 22: 315–43.</li>\n<li>–––, 2013, “Separation of Powers in\nThought and Practice”, <em>Boston College Law Review</em>, 54:\n433–68.</li>\n<li>Weber, M., 1968 [1922], <em>Economy and Society</em>, G. Roth and\nC. Wittich (eds.), Volume II, Berkeley: University of California\nPress.</li>\n<li>Winston, K., 2005, “The Internal Morality of Chinese\nLegalism”, <em>Singapore Journal of Legal Studies</em>,\n2005(Dec): 313–47.</li>\n<li>World Justice Project, 2011, <em>Rule of Law Index</em>, (2011\nedition), <a href=\"http://worldjusticeproject.org/publication/rule-law-index-reports/rule-law-index-2011-report\" target=\"other\">available online</a>, see also  <a href=\"#Oth\">Other Internet Resources</a> below.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Bentham, Jeremy",
            "constitutionalism",
            "Hayek, Friedrich",
            "law: and ideology",
            "liberalism",
            "limits of law",
            "nature of law",
            "nature of law: legal positivism"
        ],
        "entry_link": [
            {
                "../bentham/": "Bentham, Jeremy"
            },
            {
                "../constitutionalism/": "constitutionalism"
            },
            {
                "../friedrich-hayek/": "Hayek, Friedrich"
            },
            {
                "../law-ideology/": "law: and ideology"
            },
            {
                "../liberalism/": "liberalism"
            },
            {
                "../law-limits/": "limits of law"
            },
            {
                "../lawphil-nature/": "nature of law"
            },
            {
                "../legal-positivism/": "nature of law: legal positivism"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=rule-of-law\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/rule-of-law/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=rule-of-law&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/rule-of-law/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=rule-of-law": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/rule-of-law/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=rule-of-law&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/rule-of-law/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"http://www.un.org/en/events/peacekeepersday/2011/publications/un_rule_of_law_indicators.pdf\" target=\"other\">The United Nations Rule of Law Indicators</a>",
            "<a href=\"http://worldjusticeproject.org/rule-of-law-index\" target=\"other\"><em>World Justice Project Rule of Law Index</em></a>\n (<a href=\"http://worldjusticeproject.org/sites/default/files/roli_2015_0.pdf\" target=\"other\">WJP Rule of Law Index 2015 (static pdf version)</a>) "
        ],
        "listed_links": [
            {
                "http://www.un.org/en/events/peacekeepersday/2011/publications/un_rule_of_law_indicators.pdf": "The United Nations Rule of Law Indicators"
            },
            {
                "http://worldjusticeproject.org/rule-of-law-index": "World Justice Project Rule of Law Index"
            },
            {
                "http://worldjusticeproject.org/sites/default/files/roli_2015_0.pdf": "WJP Rule of Law Index 2015 (static pdf version)"
            }
        ]
    }
}