{
    "url": "science-mechanisms",
    "title": "Mechanisms in Science",
    "authorship": {
        "year": "Copyright © 2015",
        "author_text": "Carl Craver\n<ccraver@wustl.edu>\nJames Tabery\n<james.tabery@utah.edu>",
        "author_links": [
            {
                "mailto:ccraver%40wustl%2eedu": "ccraver@wustl.edu"
            },
            {
                "https://faculty.utah.edu/u0578517-JAMES_TABERY/biography/index.hml": "James Tabery"
            },
            {
                "mailto:james%2etabery%40utah%2eedu": "james.tabery@utah.edu"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2015</a> by\n\n<br/>\nCarl Craver\n&lt;<a href=\"mailto:ccraver%40wustl%2eedu\"><em>ccraver<abbr title=\" at \">@</abbr>wustl<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\n<a href=\"https://faculty.utah.edu/u0578517-JAMES_TABERY/biography/index.hml\" target=\"other\">James Tabery</a>\n&lt;<a href=\"mailto:james%2etabery%40utah%2eedu\"><em>james<abbr title=\" dot \">.</abbr>tabery<abbr title=\" at \">@</abbr>utah<abbr title=\" dot \">.</abbr>edu</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Wed Nov 18, 2015"
    ],
    "preamble": "\nAround the turn of the twenty-first century, what has come to be\ncalled the new mechanical philosophy (or, for brevity,\nthe new mechanism) emerged as a framework for thinking about\nthe philosophical assumptions underlying many areas of science,\nespecially in sciences such as biology, neuroscience, and\npsychology. In this entry, we introduce and summarize the distinctive\nfeatures of this framework, and we discuss how it addresses a range of\nclassic issues in the philosophy of science, including explanation,\nmetaphysics, the relations between scientific disciplines, and the\nprocess of scientific discovery. For each of these issues, we show how\nthe mechanistic framework has reoriented philosophical work, what the\nnew mechanism has contributed to the discussion, and what remains to\nbe done.\n",
    "toc": [
        {
            "#RisNewMec": "1. The Rise of the New Mechanism"
        },
        {
            "#ConMec": "2. The Concept of a Mechanism"
        },
        {
            "#Phe": "2.1 Phenomenon"
        },
        {
            "#ProUndMai": "2.1.1 Producing, Underlying, and Maintaining"
        },
        {
            "#Reg": "2.1.2 Regularity"
        },
        {
            "#Par": "2.2 Parts"
        },
        {
            "#Cau": "2.3 Causings"
        },
        {
            "#ConQuaAcc": "2.3.1 Conserved Quantity Accounts"
        },
        {
            "#MecAcc": "2.3.2 Mechanistic Accounts"
        },
        {
            "#ActBasAcc": "2.3.3 Activity-Based Accounts"
        },
        {
            "#CouAcc": "2.3.4 Counterfactual Accounts"
        },
        {
            "#Org": "2.4 Organization"
        },
        {
            "#OrgAgg": "2.4.1 Organization and Aggregativity"
        },
        {
            "#VarOrg": "2.4.2 Varieties of Organization"
        },
        {
            "#Mod": "2.4.3 Modularity"
        },
        {
            "#Joi": "2.4.4 Jointness"
        },
        {
            "#Lev": "2.4.5 Levels"
        },
        {
            "#StaEphMec": "2.4.6 Stable and Ephemeral Mechanisms"
        },
        {
            "#WhaMecNotWhaNotMec": "2.5 What Mechanisms Are Not and What Are Not Mechanisms"
        },
        {
            "#WhaMecNot": "2.5.1 What Mechanisms Are Not"
        },
        {
            "#WhaNotMec": "2.5.2 What Are Not Mechanisms"
        },
        {
            "#PhiWorDon26": "2.6 Philosophical Work to Be Done"
        },
        {
            "#ExpForAnaMatStr": "3. Explanation: From Formal Analyses to Material Structures"
        },
        {
            "#EtiConExp": "3.1 Etiological and Constitutive Explanations"
        },
        {
            "#ConRel": "3.2 Constitutive Relevance"
        },
        {
            "#MecMod": "3.3 Mechanisms and Models"
        },
        {
            "#ChaCom": "3.3.1 Characterizing Completeness"
        },
        {
            "#AbsIde": "3.3.2 Abstraction and Idealization"
        },
        {
            "#PhiWorDon34": "3.4 Philosophical Work to Be Done"
        },
        {
            "#MetMec": "4. Metaphysics of Mechanisms"
        },
        {
            "#TokMecTypMecLaw": "4.1 Token Mechanisms, Type Mechanisms, and Laws"
        },
        {
            "#MecLevEme": "4.2 Mechanisms, Levels, and Emergence"
        },
        {
            "#MecRea": "4.3 Mechanisms and Realization"
        },
        {
            "#MecNatKin": "4.4 Mechanisms and Natural Kinds"
        },
        {
            "#MecFun": "4.5 Mechanisms and Functions"
        },
        {
            "#PhiWorDon46": "4.6 Philosophical Work to Be Done"
        },
        {
            "#RelBetSciDisTheRedMecInt": "5. Relations between Scientific Disciplines: From Theory Reduction to Mechanism Integration"
        },
        {
            "#TheRed": "5.1 Theory Reduction"
        },
        {
            "#MecInt": "5.2 Mechanism Integration"
        },
        {
            "#IntPlu": "5.2.1 Integrative Pluralism"
        },
        {
            "#PhiWorDon53": "5.3 Philosophical Work to Be Done"
        },
        {
            "#DisHaMomDisStr": "6. Discovery: From A-ha Moments to Discovery Strategies"
        },
        {
            "#DisViaHaMom": "6.1 Discovery via A-ha Moments"
        },
        {
            "#DisViaStr": "6.2 Discovery via Strategies"
        },
        {
            "#MecEviMedDis": "6.3 Mechanistic Evidence in Medical Discoveries"
        },
        {
            "#PhiWorDon64": "6.4 Philosophical Work to Be Done"
        },
        {
            "#Con": "7. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. The Rise of the New Mechanism\nTwentieth century philosophy of science was largely dominated by\nlogical empiricism. More a framework for doing philosophy of science\nthan any coherent set of doctrines, logical empiricism addressed a\nrange of issues in philosophy of science through the lens of the\nlogical and mathematical structures constitutive of scientific thought\nand practice (see the entry on \n logical empiricism). Logical\n empiricism tended, by and large, to\nfocus on abstract, epistemic features of science, with little\nattention to scientific practice. Physics was the dominant\nexemplar.\nThe new mechanical philosophy emerged around the turn of the\ntwenty-first century as a new framework for thinking about the\nphilosophy of science. The philosophers who developed this framework\nwere, by comparison with the logical empiricists, practitioners as\nwell of the history of science and tended, by and large, to focus on\nthe biological, rather than physical, sciences. Many new mechanists\ndeveloped their framework explicitly as a successor to logical\nempiricist treatments of causation, levels, explanation, laws of\nnature, reduction, and discovery. \nAs with logical empiricism, the new mechanical philosophy is less a\nsystematic and coherent set of doctrines than it is an orientation to\nthe subject matter of the philosophy of science. The approach emerged\nas philosophers and historians of science began to break from the\nonce-standard practice of reconstructing scientific inference with the\ntools of logic and, instead, to embrace detailed investigation of\nactual episodes from the history of science. The main tenets of\nlogical empiricism had been under intense criticism for decades, and a\nnew era of historically informed philosophy of science had taken hold\nthrough the works of, e.g., Kuhn (1962), Laudan (1977), and Lakatos\n(1977). To many such scholars raised in this post-logical empiricist\nmilieu, it appeared that much of the practice of contemporary science\n(both in the laboratory and in print) was driven by the search for\nmechanisms, that many of the grand achievements in the history of\nscience were discoveries of mechanisms, and that more traditional\nphilosophy of science, for whatever reason, had failed to appreciate\nthis central feature of the scientific worldview.\nAspects of the new mechanical philosophy began to emerge in the\nlate 1960s. Fodor (1968), for example, contrasted mechanistic\nexplanations (dealing with parts and their law-like interactions) with\nfunctional explanations in psychology. Wimsatt (1972a, 1976), building\non the work of Simon (1962) and Kaufman (1971), argued repeatedly that\nthe abstract and idealized structures of logical empiricism were\nill-suited to understanding how scientists discover and explain\ncomplex systems at multiple levels of organization. Cummins (1975)\nprovided an account of functional analyses, characterizing a function\nas a contribution a component part makes to the overall capacity\nof some system that includes that component. Salmon (1984, 1989)\nargued that empiricist views of scientific explanation are\nfundamentally flawed because they neglect causal\nmechanisms. Cartwright (1989) argued that the logical empiricist\nconception of a law of nature is, in fact, a philosophical fiction\nused to describe the search for capacities and nomological\nmachines.\nThese strands began to coalesce into an over-arching perspective in\nthe 1990s. The earliest clear statement of the new mechanism was\nBechtel and Richardson’s (2010 [1993]) Discovering\nComplexity. They self-consciously put aside logical empiricist\nconcerns with theory reduction and focused instead on the process by\nwhich scientists discover mechanisms\n(see Section 6 below). Soon after,\nGlennan argued that mechanisms are the secret connexion Hume sought\nbetween cause and effect (1996), a thesis related to and partly\ninspired by Cartwright’s focus on capacities and nomological machines\n(Glennan 1997). Likewise, Thagard’s How Scientists Explain\nDisease centered the search for causes and mechanisms in medicine\n(Thagard 2000; see also Section 6\nbelow). Machamer, Darden and Craver’s “Thinking about\nMechanisms” (Machamer, Darden, and Craver 2000; familiarly known\nas “MDC”) drew these strands together and became for many\nthe lightening rod of the new mechanist perspective. MDC suggested\nthat the philosophy of biology, and perhaps the philosophy of science\nmore generally, should be restructured around the fundamental idea\nthat many scientists organize their work around the search for\nmechanisms.\n2. The Concept of a Mechanism\nThe term “mechanism” emerged in the seventeenth century\nand derived from Greek and Latin terms for “machine”\n(Dijksterhuis 1961). Descartes understood mechanics as the basic\nbuilding block of the physical world; in Le Monde, he\nproposed to explain diverse phenomena in the natural world (such as\nplanetary motion, the tides, the motion of the blood, and the\nproperties of light) in terms of the conservation of inertial motion\nthrough contact action (see the entry on\n René Descartes). Subsequently, the\n idea of mechanism has been\ntransformed many times to reflect an evolving understanding of the\nbasic causal forces in the world (besides conserved motion): e.g.,\nattraction and repulsion (du Bois Reymond), conservation of energy\n(Helmholtz), gravitational attraction (Newton) (Boas 1952; Westfall\n1971; see also entries on\n Hermann von Helmholtz and\n Isaac Newton). The concept\nof mechanism has had an almost separate evolution in the history of\nthe life sciences (Allen 2005; Des Chene 2001, 2005; Nicholson 2012),\nat times eschewing the metaphysical austerity embraced by Descartes\nand many early mechanists.\nThe new mechanists inherit the word “mechanism” from\nthese antecedents, but, in their effort to capture how the term is\nused in contemporary science, have distanced themselves both from the\nidea that mechanisms are machines and especially from the austere\nmetaphysical world picture in which all real change involves only one\nor a limited set of fundamental activities or forces (cf. Andersen\n2014a,b). \nMechanists have generally eschewed the effort to spell out\nnecessary and sufficient conditions for something to be a\nmechanism. Instead, they offer qualitative descriptions designed to\ncapture the way scientists use the term and deploy the concept in\ntheir experimental and inferential practices.\nThree characterizations are most commonly cited:\n\nMDC: “Mechanisms are entities and activities organized such\nthat they are productive of regular changes from start or set-up to\nfinish or termination conditions” (2000: 3).\nGlennan: “A mechanism for a behavior is a complex system\nthat produces that behavior by the interaction of a number of parts,\nwhere the interaction between parts can be characterized by direct,\ninvariant, change-relating generalizations” (2002: S344).\nBechtel and Abrahamsen: “A mechanism is a structure\nperforming a function in virtue of its component parts, component\noperations, and their organization. The orchestrated functioning of\nthe mechanism is responsible for one or more phenomena” (2005:\n423).\n\nEach of these characterizations contains four basic features: (1) a\nphenomenon, (2) parts, (3) causings, and (4) organization. We consider\neach of these in detail below.\nA useful canonical visual representation of a mechanism underlying\na phenomenon is shown in Figure 1 (from Craver 2007). At the top is\nthe phenomenon, some system S engaged in\nbehavior ψ. This is the behavior of the mechanism as a\nwhole. Beneath it are the parts (the Xs) and their activities\n(the φs) organized together. The dotted roughly-vertical lines\nreflect the fact that the parts and activities are contained within,\nare components of, the mechanism engaged in this behavior. Thus represented,\nmechanisms are decompositional in the sense that the behavior of the\nsystem as a whole can be broken down into organized interactions among\nthe activities of the parts.\n\n\nFigure 1. A visual representation of a\nmechanism (adapted from Craver 2007).\n\nIn the early literature, these different characterizations were\noften treated as competitors. Tabery (2004) argued instead that they\nreflect different, and complementary, emphases and intellectual\norientations. Many mechanists have adopted this ecumenical stance. For\nexample, Illari and Williamson offer a “consensus concept”\nof mechanism:\nA mechanism for a phenomenon consists of entities\nand activities organized in such a way that they are responsible for\nthe phenomenon. (2012: 120)\nLikewise, Glennan refers to “minimal\n mechanism”:\nA mechanism for a phenomenon consists of entities\n(or parts) whose activities and interactions are organized in such a\nway that they produce the phenomenon. (Glennan forthcoming: Ch.\n2) \nThese ecumenical characterizations each include the four basic\nelements and are designed to make the characterization more inclusive.\nMDC’s insistence on the regularity of mechanisms is abandoned, for\nexample, to accommodate mechanisms that work only once or that work\nirregularly (Skipper and Milstein 2005; Bogen 2005; see\nalso Section 2.1.2 below). Bechtel and Abrahamsen’s\nemphasis on the “functions” is abandoned to accommodate\nmechanisms that serve no end and to distance mechanism from this\nloaded term so often opposed to mechanism (although see Craver 2001a;\nGarson 2013; Maley and Piccinini forthcoming; see\nalso Section 4.5 below).\nThese ecumenical characterizations intentionally downplay the fact\nthat the term “mechanism” is used differently in different\nscientific and philosophical contexts (see Levy 2013 and Andersen\n2014a,b for alternative overviews of the differences). Indeed, much of\nthe progress in the early years involved learning to recognize the\nmany ways that the term “mechanism” can be used and the\nmany commitments that can be undertaken in its name. (For still other\ncharacterizations of mechanism, see Woodward (2002), Fagan (2012),\nNicholson (2012), and Garson (2013)). Taking these ecumenical views as\na starting point, we now consider the four basic components: 1) the\nphenomenon, 2) parts, 3) causings, and 4) organization.\n2.1 Phenomenon\nThe phenomenon is the behavior of the mechanism as a whole. All\nmechanisms are mechanisms of some phenomenon (Kauffman 1971;\nGlennan 1996, 2002). The mechanism of protein synthesis synthesizes\nproteins. The mechanism of the action potential generates action\npotentials. The boundaries of a mechanism—what is in the\nmechanism and what is not—are fixed by reference to the\nphenomenon that the mechanism explains. The components in a mechanism\nare components in virtue of being relevant to the phenomenon.\nMDC (2000) describe mechanisms as working from start- or set-up\nconditions to termination conditions. They insist that it is\nimpoverished to describe the phenomenon as an input-output relation\nbecause there are often many such inputs and outputs from a mechanism\nand because central features of a phenomenon might be neither inputs\nnor outputs (but rather details about how the phenomenon unfolds over\ntime). Darden, appealing to the example of protein synthesis, often\nassociates the phenomenon with the end-state: the protein (Darden\n2006). Craver (2007), following Cummins (1975) and Cartwright (1989),\noften speaks of the phenomenon roughly as a capacity or behavior of\nthe mechanism as a whole.\n2.1.1 Producing, Underlying, and Maintaining\nNew mechanists speak variously of the mechanism as producing,\nunderlying, or maintaining the phenomenon (Craver and Darden\n2013). The language of production is best applied to\nmechanisms conceived as a causal sequence terminating in some\nend-product: as when a virus produces symptoms via a disease mechanism\nor an enzyme phosphorylates a substrate. In such cases, the phenomenon\nmight be an object (the production of a protein), a state of affairs\n(being phosphorylated), or an activity or event (such as\ndigestion). For many physiological mechanisms, in contrast, it is more\nappropriate to say that the mechanism underlies the\nphenomenon. The mechanism of the action potential or of working\nmemory, for example, underlies the phenomenon, here characteristically\nunderstood as a capacity or behavior of the mechanism as a\nwhole. Finally, a mechanism might maintain a phenomenon, as\nwhen homeostatic mechanisms hold body temperature within tightly\ncircumscribed boundaries. In such cases, the phenomenon is a state of\naffairs, or perhaps a range of states of affairs, that is held in\nplace by the mechanism. These ways of talking can in many cases be\ninter-translated (e.g., the product is produced, the production has an\nunderlying mechanism, and the state of affairs is maintained by an\nunderlying mechanism). Yet clearly confusion can arise from mixing\nthese ways of talking. \n2.1.2 Regularity\nMust the relationship between the mechanism and the phenomenon be\nregular? This is an area of active discussion (DesAutels 2011;\nAndersen 2011, 2014a,b; Krickel 2014). MDC stipulate that mechanisms\nare regular in that they work “always or for the most part in\nthe same ways under the same conditions” (2000: 3). Some have\nunderstood this (incorrectly in our view) as asserting that there are\nno mechanisms that work only once, or that a mechanism must work\nsignificantly more than once in order to count as a mechanism.\nSome argue that mechanisms have to be regular in this factual sense\n(Andersen 2014a,b); i.e., repeated on many occasions (see Leuridan\n2010). This view would seem to require a somewhat arbitrary cut-off\npoint in degree of regularity between things that truly count as\nmechanisms and those that do not. Some mechanists (Bogen 2005; Glennan\n2009) argue that there is no difficulty applying the term\n“mechanism” to one-off causal sequences, as when an\nhistorian speaks of the mechanism that gave rise to World War I. Other\nmechanists argue that the type-token distinction is too crude a\ndichotomy to capture the many levels of abstraction at which mechanism\ntypes and tokens might be characterized (Darden 1991).\nIt is possible, however, to read the MDC statement as asserting,\nnot a factual kind of regularity, but as a counterfactual kind of\nnear-determinism: were all the conditions the same, then the mechanism\nwould likely produce the same phenomenon, where “likely”\naccommodates mechanisms with stochastic elements.\nWhile the MDC account leaves open the possibility that some\nmechanisms are stochastic, it clearly rules out mechanisms that\nusually fail to produce their phenomena. Skipper and Millstein (2005)\npress this point to argue that the MDC account cannot accommodate the\nidea that natural selection is a mechanism. If, as Gould (1990)\nargued, one could not reproduce the history of life by rewinding the\ntapes and letting things play forward again, then natural selection\nwould not be an MDC mechanism (see also\n Section 2.6 below). It is unclear why\n MDC would allow for the possibility\nof stochastic mechanisms and rule out, by definition, the possibility\nthat they might fail more often than they work. Whether any biological\nmechanisms are truly irregular in this sense (i.e., all the causally\nrelevant factors are the same but the product of the mechanism\ndiffers) is a separate question from whether they are mechanisms\nsimpliciter (see Bogen 2005; Machamer 2004; Steel 2008 develops a\nstochastic account of mechanisms).\nKrickel (2014) reviews the many different ways of unpacking the\nrelevant notion of regularity (see also Andersen 2012). Her favored\nsolution, “reverse regularity,” holds that there must be a\ngeneralization to the effect that, typically, when the phenomenon\noccurs, the mechanism was acting.\n2.2 Parts\nMechanists have struggled to find a concise way to express the idea\nof parthood required of the components in a mechanism. The project is\nto develop an account that is both sufficiently permissive to include\nthe paradigmatic mechanisms from diverse areas of science and yet not\nvacuous.\nFormal mereologies are difficult to apply to the material parts of\nbiological mechanisms. Axioms of mereology, such as reflexivity\n(everything is a part of itself) and unrestricted composition (any two\nthings form a whole) do not apply in standard biological uses of the\n“part” concept.\nGlennan (1996) recognized the difficulty of defining parthood very\nearly on. His proposal:\nThe parts of mechanisms must have a kind of\nrobustness and reality apart from their place within that\nmechanism. It should in principle be possible to take the part out of\nthe mechanism and consider its properties in another context. (1996:\n53)\n\n Yet even this is perhaps too strong, given that some parts of a\nmechanism might become unstable when removed from their mechanistic\ncontext. Later, Glennan (2002: S345) says that the properties of a\npart must be stable in the absence of interventions, or that parts\nmust be stable enough to be called objects. This notion is perhaps too\nstrong to accommodate the more ephemeral parts of some biochemical\nmechanisms or of the mechanisms of natural selection (Skipper and\nMillstein 2005; but see Illari and Williamson 2010).\n2.3 Causings\nMechanists have disagreed with one another about how to understand\nthe cause in causal mechanism. New mechanists have in general been at\npains both (1) to liberate the relevant causal notion from any overly\naustere view that restricts causation to only a small class of\nphenomena (such as collisions, attraction/repulsion, or energy\nconservation), and (2) to distance themselves from the Humean,\nregularist conception of causation common among logical empiricists\n(see also the entry on the\n  the metaphysics of causation).\n Four ways of unpacking the cause in\ncausal mechanism have been discussed: conserved quantity accounts,\nmechanistic accounts, activities accounts, and counterfactual\naccounts. (It should be noted that some mechanists have evolved in\ntheir thinking about causation.)\n2.3.1 Conserved Quantity Accounts\nAccording to transmission accounts, causation involves the\ntransmission and propagation of marks or conserved quantities (Salmon\n1984, 1994; Dowe 1992). The most influential form of this view holds\nthat two causal processes causally interact when they intersect in\nspace-time and exchange some amount of a conserved quantity, such as\nmass. On this view, causation is local (the processes must intersect)\nand singular (it is fully instantiated in particular causal\nprocesses), though the account relies upon laws of conservation\n(Hitchcock 1995).  Although this view inspired many of the new\nmechanists, and although it shares their commitment to looking toward\nscience for an account of causation, it has generally been rejected by\nnew mechanists (though see Millstein 2006; Roe 2014).\nThis view has been unpopular in part because it has little direct\napplication in nonfundamental sciences, such as biology. The causal\nclaims biologists make usually don’t involve explicit reference to\nconserved quantities (even if they presuppose such notions\nfundamentally) (Glennan 2002; Craver 2007). Furthermore,\nbiological mechanisms often involve causation by omission, prevention,\nand double prevention (that is, when a mechanism works by removing a\ncause, preventing a cause, or inhibiting an inhibitor) (Schaffer 2000,\n2004). Such forms of causal disconnection are ubiquitous in the\nspecial sciences.\n2.3.2 Mechanistic Accounts\nGlennan (1996, 2009) sees causation (at least non-fundamental\ncausation) as derivative from the concept of mechanism: causal claims\nare claims about the existence of a mechanism. The truth-maker for a\ncausal claim at one level of organization is a mechanism at a lower\nlevel. In short, mechanisms are the hidden connexion Hume sought\nbetween cause and effect. Like the Salmon-Dowe account, Glennan’s view\nis singular: particular mechanisms link particular causes and\nparticular effects (Glennan forthcoming)\nThis view has been charged with circularity: the concept of\nmechanism ineliminably contains a causal element. However, Glennan\nreplies that many accounts of causation (such as Woodward’s 2003\naccount, see Section 2.3.4 below) share this\nflaw. Furthermore, he argues that for at least all non-fundamental\ncauses, a mechanisms clearly explains how a given cause produces its\neffect.\nWhether the analysis succeeds depends on how one deals with the\nresulting regress (Craver 2007). As Glennan (2009) notes, the\ndecomposition of causes into mechanisms might continue infinitely, in\nwhich case there is no point arguing about which notion is more\nfundamental, or the decomposition might ground out in some basic,\nlowest-level causal notion that is primitive and so not analyzable\ninto other causal mechanisms. The latter option must confront the\nwidely touted absence of causation in the theories of fundamental\nphysics (Russell 1913); at very small size scales, classical\nconceptions of objects and properties no longer seem to apply, making\nit difficult to see what content is left to the idea that there are\nmechanisms at work (see also Teller 2010; Kuhlman and Glennan\n2014).\n2.3.3 Activity-Based Accounts\nStill other mechanists, such as Bogen (2005, 2008a) and Machamer\n(Machamer 2004), embrace an Anscombian, non-reductive view\nthat causation should be understood in terms of productive activities\n(see also the entry on \n G.E.M. Anscombe). Activities are\n kinds of causing, such as\nmagnetic attraction and repulsion or hydrogen bonding.  Defenders of\nactivity-based accounts eschew the need to define the concept, relying\non science to say what activities are and what features they might\nhave. This view is a kind of causal minimalism (Godfrey-Smith\n2010). Whether an activity occurs is not a matter of how frequently it\noccurs or whether it would occur always or for the most part in the\nsame conditions (Bogen 2005).\nThis account has been criticized as vacuous because it fails to say\nwhat activities are (Psillos 2004), to account for the relationship of\ncausal and explanatory relevance (Woodward 2002), and to mark an\nadequate distinction between activities and correlations (Psillos\n2004), though see Bogen (2005, 2008a) for a response. Glennan\n(forthcoming) argues that these problems can be addressed by\nrecognizing that activities in a mechanism at one level depend on\nlower-level mechanisms. (See also Persson 2010 for a criticism of\nactivities based on their inability to handle cases of polygenic\neffects.)\n2.3.4 Counterfactual Accounts\nLastly, some new mechanists, particularly those interested in\nproviding an account of scientific explanation, have gravitated toward\na counterfactual view of causal relevance, and in particular, to the\nmanipulationist view expressed in Woodward (2001, 2003) (see, e.g.,\nGlennan 2002; Craver 2007). The central commitment of this view is\nthat models of mechanisms describe variables that make a difference to\nthe values of other variables in the model and to the phenomenon.\nDifference-making in this manipulationist sense is understood as a\nrelationship between variables in which interventions on cause\nvariables can be used to change the value of effect variables\n(see the entry on \n causation and manipulability).\nUnlike the views discussed above, this way of thinking about\ncausation provides a ready analysis of explanatory relevance that\ncomports well with the methods for testing causal claims. Roughly, one\nvariable is causally relevant to a second when there exists an ideal\nintervention on the first that changes the value of the second via the\nchange induced on the first. The view readily accommodates omissions,\npreventions, and double preventions—situations that have\ntraditionally proven troublesome for production-type accounts of\ncausation. In short, the claim that C causes E requires\nonly that ideal interventions on C can be used to change the\nvalue of E, not that C and E are physically\nconnected to one another. Finally, this view provides some tools for\naccommodating higher-level causal relations and the non-accidental\nlaws of biology. On the other hand, the counterfactual account is\nnon-reductive (like the mechanistic view), and it inherits challenges\nfaced by other counterfactual views, such as pre-emption and\nover-determination which are common in biological mechanisms\n(see the entry on \n counterfactual theories of causation).\n2.4 Organization\nThe characteristic organization of mechanisms is itself the subject\nof considerable discussion.\n2.4.1 Organization and Aggregativity\nWimsatt (1997) contrasts mechanistic organization with aggregation,\na distinction that mechanists have used to articulate how the parts of\na mechanism are organized together to form a whole (see Craver 2001b).\nAggregate properties are properties of wholes that are simple sums of\nthe properties of their parts. In aggregates, the parts can be\nrearranged and intersubstituted for one another without changing the\nproperty or behavior of the whole, the whole can be taken apart and\nput back together without disrupting the property or behavior of the\nwhole, and the property of the whole changes only linearly with the\naddition and removal of parts. These features of aggregates hold\nbecause organization is irrelevant to the property of the\nwhole. Wimsatt thus conceives organization as non-aggregativity. He\nalso describes it as a mechanistic form of emergence\n(see Section 4.2 below).\nMechanistic emergence is ubiquitous—truly aggregative\nproperties are rare. Thus mechanists have tended to recognize a\nspectrum of organization, with aggregates at one end and highly\norganized mechanisms on the other. Indeed, many mechanisms studied by\nbiologists involve parts and causings all across this spectrum. (For\nfurther discussion of mechanistic emergence in relationship to other\nvarieties, see Richardson and Stephan 2007.)\n2.4.2 Varieties of Organization\nFollowing Wimsatt, mechanists have detailed several kinds of\norganization characteristic of mechanisms. A canonical list includes\nboth spatial and temporal organization. Spatial organization includes\nlocation, size, shape, position, and orientation; temporal\norganization includes the order, rate, and duration of the component\nactivities. More recently, mechanists have emphasized\norganizational patterns in mechanisms as a whole. Bechtel, for\nexample, discusses how mathematical models, and dynamical models in\nparticular, are used to reveal complex temporal organization in\ninteractive mechanisms (Bechtel 2006, 2011, 2013b). Some argue that\ndynamical models push beyond the limits of the mechanistic framework\n(e.g., Chemero and Silbestein 2008 and, at times, Bechtel himself; see\nKaplan and Bechtel 2011). Others argue that dynamical models are, in\nfact, often merely descriptive (i.e., non-explanatory models) or,\nalternatively, that they are used to describe the temporal\norganization of mechanisms (Kaplan and Bechtel 2011; Kaplan 2012).\nMechanists have also recently borrowed from Alon’s (2006; Milo et\nal. 2002) work on network motifs, repeated patterns in causal\nnetworks, to expand the vocabulary for thinking about abstract\npatterns of organization (Levy 2014; Levy and Bechtel\n2012). Understanding how parts compose wholes is likely to be a growth\narea in the future of the mechanistic framework. (For some other\nrecent additions, see Kuorikoski and Ylikoski 2013; Kuhlmann 2011;\nGlennan forthcoming.)\n2.4.3 Modularity\nWoodward’s (2001, 2002, 2011, 2014) counterfactual definition of a\nmechanism (which is indirectly specified via an account of mechanistic\nmodels), as well as a descendant elaborated by Menzies (2012), require\nthat models of mechanisms be modular. This means, roughly, that it\nshould be physically possible to intervene on a putative cause\nvariable in a mechanism without disrupting the functional\nrelationships among the other variables in the mechanism. In terms of\nstructural equation models in particular, this means that one should\nbe able to replace the right-hand side of an equation in the model\nwith a particular value (i.e., set the left-hand variable to a value)\nwithout needing to change any of the other equations in the\nmodel. This is intended to formally capture the sense in which\nmechanism is composed of separable, interacting parts. For arguments\nin favor of a modularity condition on mechanistic models see Menzies\n(2012).\nSteel (2008) appeals to a somewhat weaker form of modularity in his\nprobabilistic analysis of mechanisms—one that follows directly\nfrom Simon’s (1996 [1962]) idea of nearly decomposable systems.  On\nSimon’s view, the parts of a mechanism have more and stronger causal\nrelations with other components in the mechanism than they do with\nitems outside the mechanism. This gives mechanisms (and parts of\nmechanisms) a kind of “independence” or\n“objecthood” defined ultimately in terms of the intensity\nof interaction among components. Grush (2003), following Haugeland\n(1998), develops an idea of modularity in terms of the bandwidth of\ninteraction, where modules are high-bandwidth in their internal\ninteractions and low-bandwidth in their external interactions. On this\nview, modularity is not an all-or-none proposition but a matter of\ndegree; mechanisms are only nearly decomposable. Craver (2007) argues\nthat such a generic notion fails to account for the relevance of\ndifferent causal interactions for different mechanistic\ndecompositions; what counts as a part of a mechanism can only be\ndefined relative to some prior decision about what one takes the\nmechanism to be doing. For criticisms of modularity, see Mitchell\n(2005) and Cartwright (2001, 2002).\n2.4.4 Jointness\nFagan (2012, 2013) emphasizes the interdependent relationship\nbetween parts of a mechanism. Components in a mechanism, she points\nout, often form a more complex unit by virtue of the individual\nproperties that unite them—their “meshing\nproperties”; the complex unit then figures into the mechanism’s\nbehavior. This interdependent relationship—jointness—is\nexemplified by the lock-and-key model of enzyme action. Fagan applies\nthis notion to research on stem cells (Fagan 2013) but argues that it\nis a general feature of experimental biology (Fagan 2012).\n2.4.5 Levels\nMany mechanists emphasize the hierarchical organization of\nmechanisms and the multilevel structure of theories in the special\nsciences (see especially Craver 2007, Ch. 5). Antecedents of the new mechanism focused almost exclusively on\netiological, causal relations. However, the new emphasis on mechanisms\nin biology and the special sciences demanded an analysis of\nmechanistic relations across levels of organization.\nFrom a mechanistic perspective, levels are not monolithic divides\nin the furniture of the universe (as represented by Oppenheim and\nPutnam 1958), nor are they fundamentally a matter of size or the\nexclusivity of causal interactions within a level (Wimsatt\n1976). Rather, levels of mechanisms are defined locally within a\nmultilevel mechanism: one item is at a lower level of mechanisms than\nanother when the first item is a part of the second and when the first\nitem is organized (spatially, temporally, and actively) with the other\ncomponents such that together they realize the second item. Thus, the mechanism of spatial memory has multiple levels,\nsome of which include organs such as the hippocampus generating a\nspatial map, some of which involve the cellular interactions that\nunderlie map generation, and some of which involve the molecular\nmechanisms that underlie those cellular interactions (Craver\n2007). For more on levels, see Section 4.2 below.\n2.4.6 Stable and Ephemeral Mechanisms\nFinally, mechanists have found it necessary to distinguish between\nstable mechanisms, which rely fundamentally upon the more or less\nfixed arrangement of parts and activities, and ephemeral mechanisms,\nwhich involve a process evolving through time without fixed spatial\nand temporal arrangement (Glennan 2009). The time-keeping mechanism in\na clock, for example, is a relatively stable assemblage of components\nin relatively fixed locations that work the same way, with the same\norganizational features, each time it works. Ephemeral mechanisms, in\ncontrast, involve a much looser kind of organization: items still\ninteract in space and time, but they do not do so in virtue of robust,\nstable structures. Many chemical mechanisms in a cell are like that\n(Richardson and Stephan 2007). Ephemeral mechanisms are surely a\nprimary focus of historical sciences, such as archaeology, history,\nand evolutionary biology (Glennan 2009).\n2.5 What Mechanisms Are Not and What Are Not Mechanisms\nThe term “mechanism” has been used in many different\nways to express many different ideas. The new mechanists’\nappropriation of the term is thus likely to cause unhelpful\nassociations, and their liberalization of the term is likely to raise\nworries that the notion of mechanism has thereby been trivialized\n(see, e.g., Moss 2012 and\nNicholson 2012). Here, we first distinguish the new mechanism from\nother doctrines with which it shares both name and family\nresemblance. We then discuss some things to which the new use of the\nterm “mechanism” does not apply.\n2.5.1 What Mechanisms Are Not\nNew mechanists have explicitly eschewed the following associations\nwith the term “mechanism”:\n\nMechanisms are not necessarily deterministic. Mechanisms\nmight be stochastic if, for example, they are composed of stochastic\nactivities (Bogen 2005, 2008a), or, in a more mundane\nsense (i.e., one consistent with determinism), because it is always\npossible for one or more factors to interfere with the working of a\nmechanism; one of the parts might be broken, or an unexpected\npreventer might interfere with the operation of a mechanism. The truth\nor falsity of determinism, and its relevance to understanding the\nspecial sciences, is an independent issue from the question of whether\nsomething is a mechanism.\nAppeal to mechanisms is not\nnecessarily reductionistic. Mechanisms are often described as\nmulti-level, with activities at different levels being equally\nessential to how a mechanism works. Mechanistic explanations might\nlook, up, down, or around depending on the choice of an explanandum\nand the presuppositions of the explanatory context (Bechtel\n2009a). Mechanists might be reductionists or anti-reductionists. That\nsaid, many mechanists opt for some form of explanatory\nanti-reductionism, emphasizing the importance of multilevel and\nupward-looking explanations, without rejecting the central ideas that\nmotivate a broadly physicalist world-picture (e.g., McCauley and\nBechtel 2001; Craver 2007). (For further discussion, see Theurer\n2013; see also Sections 3.1\nand 5 and the entry on\n reductionism in biology.)\nNot all mechanisms are machines.  Machines are\nhuman-made contrivances with each part added and organized by a\ndesigner to perform a function; biological and social mechanisms, in\ncontrast, are products of evolution, broadly construed (Darden 2006),\nand so display ornate forms of organization in comparison with\ncontrivances. One machine might contain multiple mechanisms (a car,\nfor example, has mechanisms for braking, propulsion, playing music and\nclimate control). Machines are also capable of being\nboth active and passive (a stopped clock is still a machine);\nmechanisms, in contrast, have a productive aspect and are always doing\nsomething.\nMechanisms are not necessarily sequential\nor linear. Mechanisms can have feedback loops and cycles\nwherein the output of the mechanism or components in turn influences\nthe input of the mechanism or components in a subsequent iteration\n(Bechtel 2011). Also, the interactions among components in a mechanism\nneed not be describable by a linear equation.\nMechanisms are not necessarily localizable (Bechtel and\nRichardson 2010 [1993]). Components of mechanisms might be widely\ndistributed (as are many brain mechanisms) and might violate our\nintuitive or tutored sense of the boundaries of objects (as an action\npotential violates the cell boundary). The assumption of localization\nis often an important heuristic in the search for mechanisms; however,\nthis heuristic often must be abandoned as the mechanism’s organization\nreveals itself.\nMechanisms are not limited to push-pull dynamics. Descartes’ mechanism had this feature, but (as noted\nabove) the new mechanism explicitly liberalizes the notion to account\nfor other kinds of causing. \nMechanisms are not just fictions/metaphors. When a\nscientist says that there is a mechanism that makes proteins in living\norganisms, she is not just using a machine metaphor; rather, she is\nsaying that there are in fact parts and activities organized in living\norganisms such that they produce proteins.\n\n2.5.2 What Are Not Mechanisms\nOne might object that there’s nothing left of mechanism once it\nsheds these historical associations. One might suspect that it has\nbeen trivialized (Dupré 2013).\nThe idea of mechanism is a central part of the explanatory ideal of\nunderstanding the world by learning its causal structure. The history\nof science contains many other conceptions of scientific explanation\nand understanding that are at odds with this commitment. Some have\nheld that the world should be understood in terms of divine\nmotives. Some have held that natural phenomena should be understood\nteleologically.  Others have been convinced that understanding the\nnatural world is nothing more than being able to predict its\nbehavior. Commitment to mechanism as a framework concept is commitment\nto something distinct from and, for many, exclusive of, these\nalternative conceptions. If this appears trivial, rather than a\ncentral achievement in the history of science, it is because the\nmechanistic perspective now so thoroughly dominates our scientific\nworldview.\nYet there are many ways of organizing phenomena besides revealing\nmechanisms. Some scientists are concerned with physical structures and\ntheir spatial relations without regard to how they work: an anatomist\nmight be interested in the spatial organization of parts within the\nbody with minimal interest in how those parts articulate together to\ndo something. Many scientists build predictive models of systems\nwithout any pretense that these models in fact reveal the causal\nstructures by which the systems work. Some scientists are concerned\nwith taxonomy, sorting like with like without regard to how the sorted\nitems came about or how they work. Finally, in many areas of science,\nthere is a widely recognized and practically significant distinction\nbetween knowing that C (e.g., smoking) is a cause of E\n(lung cancer) and knowing how C causes E. This is not so\nmuch an ontological difference as it is a difference in the grain with\nwhich one seeks to understand a system’s causal structure. In short,\nthere are many framework concepts in science, and not all of them can\nbe assimilated to mechanisms.\nBut what, the critic might push further, does not count as a\nmechanism? Here are some contrast classes:\n\nEntities (or objects) are not\nmechanisms. Mechanisms do things. If an object is not doing anything\n(i.e., if there is no phenomenon), then it is not a mechanism.\nCorrelations are not mechanisms.  Mechanisms explain at\nleast many correlations, and many correlations can be used to\ncharacterize causal or mechanistic relations, but correlations\nthemselves are not mechanistic. The same can be said of mere temporal\nsequences of events.\nInferences, reasons, and arguments are\nnot mechanisms. Though there are mechanisms of inference and\nreasoning, what makes something an inference or a reason is logical\nrelation and not (merely) a causal relationship between premise and\nconclusion.\nSymmetries are not mechanisms. Many kind of symmetry are\nof fundamental importance in different areas of physics (e.g.,\ntranslational symmetries, rotational symmetries). These are features\nof physical systems that are highly general facts or assumptions, not\nmechanisms.\nFundamental laws and fundamental causal\nrelations are not mechanisms. If a law or causal relation is\nfundamental, then (by definition) there is no mechanism for it.\nRelations of logical and mathematical necessity are not\nmechanisms. Such truths hold in all possible worlds and so do not\ndepend for their truth on facts about the causal structure of this\nworld.\n\nThis is not an exhaustive list of non-mechanisms or non-mechanistic\nframework concepts. Yet it demonstrates that even the liberalized\nconcept of mechanism is neither vacuous nor trivial.\n2.6 Philosophical Work to Be Done\nMuch of the early new mechanical philosophy has focused on the\nspecial sciences, such as neuroscience and molecular biology. In the\nyears since, philosophers have extended the mechanistic framework to\nother scientific disciplines, such as cell biology (Bechtel 2006),\ncognitive science (Bechtel 2008; Thagard 2006), neuroeconomics (Craver\nand Alexandrova 2008), organic chemistry (Ramsey 2008), physics\n(Teller 2010), astrophysics (Illari and Williamson 2012), behavior\ngenetics (Tabery 2014a), and phylogenetics (Matthews\nforthcoming). Philosophers continue to test the limits of this\nframework, with the expectation that alternative organizing frameworks\nmight play central roles in other sciences. For example, a debate has\nemerged in the philosophy of biology over whether or not natural\nselection is a mechanism (see, for example, Skipper and Millstein\n2005; Baker 2005; Barros 2008; Illari and Williamson 2012; Havstad\n2011; and Matthewson and Calcott 2011).  Similar debates have emerged\nconcerning mechanistic explanation in cognitive science (Bechtel 2008; Piccinini and Craver 2011; Weiskopf 2011;\nPovich forthcoming).\nOne area that has received particular attention is the effort to\nunderstand computational mechanisms. On some accounts, computational\nmechanisms form a proper subclass of mechanisms that can be defined\nexplicitly in terms of the kinds of entities, properties, and\nactivities involved in mechanisms in that class (Piccinini 2007;\nMilkowski 2013). According to this view, computational mechanisms are\nmechanisms that have the function to manipulate medium independent\nvehicles in accordance with a general rule that applies to all\nvehicles and depends on the inputs for its application (Piccinini and\nScarantino 2011). Digital computers are distinctive in that their\nvehicles are digits (Piccinini 2007). Proponents of this account hope\nto demarcate computing mechanisms from non-computing mechanisms by\nappeal to the distinctive components proprietary to computing\nmechanisms. This view contrasts both with a semantic view, according\nto which computation is essentially a matter of manipulating symbols\nor representations, and with perspectivalist views, according to which\nwhether a mechanism counts as computing is a matter of whether it is\nso described (Churchland 1986; Churchland and Sejnowski 1992; Shagrir\n2010).\nPhilosophers of the social sciences have also emphasized and\ndebated the importance of mechanistic knowledge (e.g., Elster 1989;\nfor a useful review of these connections, see Hedström and Ylikoski\n2010). In that context, appeals to mechanisms are intended to remedy\nthe relative uninformativeness of social (or macro-level) explanations\nof social phenomena (such as widespread norms, persistent\ninequalities, network and institutional structures) by insisting that\nthese explanations ultimately be grounded in mechanistic details about\nindividual agents and actors, their desires and motivations, and,\nimportantly, their relations to one another. The emphasis on relations\namong actors distances this mechanistic view from methodological\nindividualism (see the entry on \n methodological individualism).\n Mechanists in the social sciences\nhave also tended to shy away from grand, overarching theories and\ntoward more local explanations: scientific knowledge grows by adding\nitems to a toolbox of mechanisms and showing how items from that\ntoolbox can be combined to provide an explanation for a particular\nphenomenon. Frederica Russo (2009) discusses a number of strategies\nfor modeling social mechanisms (see also Little 1991, 1998; Hedström\n2005; Hedström and Swedberg 1998).\n3. Explanation: From Formal Analyses to Material Structures\nThe covering-law model of explanation was a centerpiece of the\nlogical empiricist conception of science. According to that model,\nexplanations are arguments showing that the event to be explained\n(the explanandum event) was to have been expected on the\nbasis of laws of nature and the antecedent and boundary conditions\n(the explanans). For advocates of the covering-law model, the\nphilosophical problem of explanation is thus largely a matter of\nanalyzing the formal structure of explanatory arguments (Hempel and\nOppenheim 1948; Hempel 1965). A rainbow, for example, is explained\nunder the covering-law model by reference to laws of reflection and\nrefraction alongside conditions concerning the position of the sun and\nthe nature of light, the position of the raindrops, and the position\nof the person seeing the rainbow. The description of the rainbow is\nthe conclusion of a deductive argument with law statements and\ndescriptions of conditions as premises, and so the rainbow was to be\nexpected in light of knowledge of the laws and conditions.\nMechanists, in contrast, insist explanation is a matter of\nelucidating the causal structures that produce, underlie, or maintain\nthe phenomenon of interest. For mechanists, the philosophical problem\nis largely about characterizing or describing the worldly or ontic\nstructures to which explanatory models (including arguments) must\nrefer if they are to count as genuinely explanatory. A rainbow, for\nthe mechanist, is explained by situating that phenomenon in the causal\nstructure of the world; the explanation is an account of how the\nphenomenon was produced by entities (like rain drops and eyeballs)\nwith particular properties (like shapes and refractive indices) that\ncausally interact with light propagating from the sun. Mechanists\ntypically distinguish several ways of situating a phenomenon within\nthe causal structure of the world.\n3.1 Etiological and Constitutive Explanations\nMost mechanists recognize two main aspects of mechanistic\nexplanation: etiological and constitutive. Salmon (1984) describes\nthem as two different ways of situating an explanandum phenomenon in\nthe causal nexus (see also Craver 2001b; Glennan 2009). Etiological\nexplanations reveal the causal history of the explanandum phenomenon,\nas when one says a virus explains a disease. Constitutive\nexplanations, in contrast, explain a phenomenon by describing the\nmechanism that underlies it, as when one says brain regions, muscles,\nand joints explain reaching.\nPhilosophical arguments against the covering law model often\nfocused on its inability to deal with causal, etiological\nexplanations. The model failed to deliver the right verdict on a\nvariety of problem cases precisely because it attempted to provide an\naccount of explanation without any explicit mention of causation\n(Bromberger 1966; Salmon 1984; Scriven 1959)\nNew mechanists extend these kinds of criticism to the covering law\nmodel of intertheoretic, micro-reduction. According to the covering\nlaw model of reductive explanation, a theory about parts reduces, and\nso explains, a theory about wholes when it is possible to derive the\nsecond from the first given bridge laws to connect the two (see Nagel\n1961; Schaffner 1993).\nSome mechanists argue that the covering law model of constitutive\nexplanation has problems analogous to those that beset the\ncovering-law model of etiological explanations. Action potentials\ncannot be explained by mere temporal sequences of events utterly\nirrelevant to the phenomenon, but one can derive a description of the\naction potential from descriptions of such irrelevant\nphenomena. Action potentials cannot be explained by mere patterns of\ncorrelation that are not indicative of an underlying causal\nrelation. Irrelevant byproducts of a mechanism might be correlated\nwith the behavior of the mechanism, even perfectly correlated such\nthat one could form bridge laws between levels, but would not thereby\nexplain the relationship. Merely finding a neural correlate of\nconsciousness, for example, would not, and is not taken by anyone to,\nconstitute an explanation of consciousness. So mechanists argue that\nmicro-reductive explanations must satisfy causal constraints just as\nsurely as etiological explanations must (Craver 2007).\nThe covering law model also fails to distinguish models that merely\nre-describe the phenomenon in general terms from explanations that, in\naddition to predicting aspects of the phenomenon, reveal the\nmechanisms that produce it (Craver 2006; Kaplan and Craver 2011; but\nsee Weiskopf 2011). For example, Snell’s law allows one to predict how\nlight bends when passing from one medium to another, but it does not\nexplain why the light bends. New mechanists also argue that the\ncovering law model fails to distinguish predictively adequate but\nfictional models from explanatory models. Finally, mechanists argue\nthat the intertheoretic model of reduction fails to capture an\nimportant dimension of explanatory quality: depth. An implication of\nthe covering law model is that any true law statements that allow one\nto derive the explanandum law (with suitable corrections and\nassumptions) will count as a complete explanation. Yet it seems one\ncan deepen an explanation by opening black boxes and revealing how\nthings work down to whatever level one takes as relatively fundamental\nfor the purposes at hand. Such criticisms suggest that the\ncovering-law model of constitutive explanation is too weak to capture\nthe norms of explanation in the special sciences.\nOther mechanists have argued that the covering law model is too\nstrong. Philosophers of biology have long argued that there are no\nlaws of the sort the logical empiricist described in biology and other\nspecial sciences (Beatty 1995; Mitchell 1997, 2000; Woodward\n2001). One might conclude from this that there are no explanations in\nbiology (Rosenberg 1985), but such a radical conclusion is difficult to square\nwith obvious advances in understanding, e.g., protein synthesis,\naction potentials, cell signaling, and a host of other biological\nphenomena.  In such cases, one finds that scientists appeal to\nmechanisms to do the explanatory work, even in cases where nothing\nresembling a law appears to be available.\n3.2 Constitutive Relevance\nWith increased attention to constitutive explanation, mechanists\nrealized the need for an account of constitutive relevance, a\nprincipal for sorting relevant from irrelevant factors in a mechanism\n(Craver 2007; Ylikoski 2013). A system (S) exhibiting\nphenomenon (ψ) is composed of many different entities\n(x), with various properties, engaging in myriad activities\n(φ) organized together (see Figure 1 above in\nSection 2). One central research problem is to say which of these\nentities, activities, and organizational features contribute to the\nphenomenon and which do not. In a sense, this is a challenge of\ndefining the boundaries of a mechanism: of saying what is and is not\nin the mechanism.\nThree proposals have been considered. The first, the mutual\nmanipulability account, understands constitutive relevance in\nterms of the experimental manipulations used to test interlevel\nrelations. According to this account, if it can be shown (i) that the\nputative components are contained within S, (ii) that some\nideal interventions on the putative component\n(x’s φ-ing) change the phenomenon\n(S’s ψ-ing), and (iii) that some ideal interventions\non S’s ψ-ing change x’s φ-ing, that is\nsufficient to establish that x is a component in the\nmechanism. The notion of an ideal intervention in this account is\nexplicitly indebted to and a proposed extension of Woodward’s theory\nof causal relevance to the constitutive domain (see Craver 2007; see\nalso Kaplan 2012). A concern with the mutual manipulability account,\nthough, is that it is best an epistemic guide to constitutive\nrelevance, not an account of what constitutive relevance is (Couch\n2011). The account offers, at best, a sufficient condition of\nrelevance. Also, the notion of an “ideal” intervention,\nborrowed from Woodward’s account of causal relevance, cannot be\napplied straightforwardly to constitutive\nexplanations. An ideal intervention on a system cannot\nintervene on both the independent and the dependent variable at the\nsame time. However, when one intervenes to make S ψ (or\nprevent S from ψ-ing), one invariably also intervenes on\nthe components of S’s ψ-ing. And when one intervenes on\nthe components of S’s ψ-ing, one often intervenes\non S’s ψ-ing. Because x’s φ-ing\nand S’s ψ-ing are related as part to whole, they are not\nindependent, and so require another way to think about ideal\ninterventions (see Baumgartner 2010; 2013; Leuridan 2011; yet see\nMenzies 2012; Woodward 2014.\nA second proposal offers a regularity account of constitutive\nrelevance modeled on Mackie’s notion of understanding a cause as an\nINUS condition: an Insufficient but Non-redundant part of an\nUnnecessary but Sufficient condition for the effect in question\n(Mackie 1974; see also Cummins 1983). On this account, a\nconstitutively relevant component is an insufficient but non-redundant\npart of an unnecessary but sufficient mechanism for a given phenomenon\n(Couch 2011; see also Harbecke 2010, 2014). Allow that any number of\nmechanisms might suffice to bring about S’s ψ-ing; each\npossible sufficient mechanism is then unnecessary\nfor ψ-ing. Each of these mechanisms is made of components, none\nof which is alone sufficient to produce the behavior of the mechanism\nas a whole, but each of which is necessary in the context of the\nmechanism for S to ψ.  This account presupposes the idea\nof being necessary in context, and one might reasonably worry about\nsorting accidentally correlated Xs from Xs that in fact\nmake a difference to S’s ψ-ing.\nA third approach to constitutive relevance dispenses with the\ninterlevel framing enforced by the mutual manipulability account and\nattempts to analyze relevance using causal notions only. According to\naccounts of this sort, constitutive relevance is a kind of causal\nbetween-ness. If S’s ψ-ing is understood as an\ninput-output relationship of some sort, then mechanistic relevance\ncould be understood as being a necessary link in the causal chain\nbetween the input and the output (see Harinen forthcoming; Menzies\n2012). The putatively interlevel experiments in the mutual\nmanipulability account can then be recast as different kinds of\nunilevel causal experiments. Romero (forthcoming) provides a helpful framing of these issues and offers the novel suggestion that putatively high-level interventions are in fact fat-handed interventions relative to their lower-level counterparts.\n3.3 Mechanisms and Models\nThe philosophical literature on mechanisms also overlaps with the\nphilosophical literature on scientific models (see\nthe entry on models in science). Here\nwe distinguish mechanical models from models of mechanisms and we\ndiscuss varieties of non-mechanical models.\n3.3.1 Characterizing Completeness\nGlennan (2005) proposed a definition of a mechanical model\nas follows:\n  (MM) A mechanical model consists of (i) a description\nof the mechanism’s behavior (the behavioral description); and (ii) a\ndescription of the mechanism that accounts for that behavior (the\nmechanical description). (446)\nSuch models can be represented in many different ways (see also\nGiere 2004). They are evaluated in terms of their ability to predict\nthe features of the phenomenon and in terms of the mapping between\nitems in the model and the entities, activities, and organizational\nfeatures in the mechanism (Glennan 2005: 17; Kaplan and Craver 2011).\nGlennan emphasizes that there is no hard line between complete and\nincomplete models; rather models are continually in the process of\narticulation and refinement. Whether a model is complete enough is\ndetermined by pragmatic considerations.\nThis last point is related to Darden’s distinction\nbetween mechanism schemas and mechanism sketches\n(Darden and Cain 1989; Darden 2002). In discovering a\nmechanism, it is often crucial to identify gaps that have to be filled\nin one’s model. While no model is ever complete in the absolute sense,\nsome models have lacunae that must be filled before the model is\ncomplete enough\nMechanism schemas are abstract descriptions of mechanisms\nthat can be filled in with details to yield a specific type or token\nmechanism. Thus, the schema:\nDNA → RNA → Protein\ncan be filled in with a specific sequence of bases in DNA, its\ncomplement in RNA, and a corresponding amino acid sequence in the\nprotein. The arrows can be filled in, showing how transcription and\ntranslation work. A mechanism sketch is an incomplete\nrepresentation of a mechanism that specifies some of the relevant\nentities, activities, and organizational features but leaves gaps that\ncannot yet be filled. Black boxes, question marks, and filler-terms\n(such as “activate”, “cause”, or\n“inhibitor”) hold the place for some entity, activity or\nprocess yet to be discovered. The distinction between sketches and\nschemas is a matter of completeness: schemas are more complete than\nsketches in the sense that a sketch omits one or more stages of the\nmechanism that have to be understood if one really wants to solve\none’s discovery problem.\nMechanists also emphasize the distinction between\na how-possibly schema and a how-actually-enough\nschema (Craver and Darden 2013). A how-possibly schema describes how\nentities and activities might be organized to produce a\nphenomenon. A how possibly model is n hypothesis about how the\nmechanism works. Such models might be true (enough) or false. A true\n(enough) how-possibly model is (though we may not know it) also a\nhow-actually (enough) model. A how-actually-enough schema describes\nhow entities and activities are in fact organized to produce the\nphenomenon. The term “how-actually-enough” captures the\nidea that the requisite “accuracy” of a mechanistic model\ncan vary considerably from one pragmatic context to another (Weisberg\n2013).A false how possibly model is merely a how possibly model;\njust-so-stories are merely how possibly models (Dray 1957; Brandon\n1985). Used in this way, the term “how possibly model” is\nsimilar to the term “hypothesis”: it is entertained as a\npossibility but not necessarily endorsed.\n3.3.2 Abstraction and Idealization\nIn contrast to mechanism schemas and sketches, some models of\nmechanisms work not by describing all of the parts, causal\ninteractions, and organizational features, but rather by abstracting\naway from such potentially obfuscating details (Craver and Darden\n2013; Strevens 2008; Levy and Bechtel 2012). In such cases, idealizing\nassumptions can be introduced to bring the relevant feature of the\nmechanism most clearly into view: infinite populations, frictionless\nplanes, perfect geometrical shapes are presumed in order to strip the\nmodel of detail that does not matter for, or would only obstruct, the\nintended purposes of model.\nCritics of the new mechanical philosophy have pushed on the\nimportance of abstraction in science, drawing attention to the above\ndiscussions of completeness. The goals of completeness and accuracy\nare taken to conflict with the common practice of being satisfied with\nmodels that sacrifice detail and truth for clarity and generality\n(Strevens 2008; Woodward 2014). The normative distinction between a\nschema and a sketch, for example, seems to suggest that science\nprogresses by moving from incomplete to complete models. And the\ndistinction between how-possibly and how-actually-enough likewise\nseems to privilege accuracy over other goals of modeling, which often\nrequire distortion and falsity (see Wimsatt 2007; Weisberg 2007; Levy\nand Bechtel 2012; Batterman and Rice 2014; Chirimuuta 2014; Levy\n2014).\nYet mechanists can surely allow that not all models of mechanisms\nare mechanical models or mechanism schemas. Often other sorts of model\nare useful for isolating central aspects of a mechanism’s\nfunctioning. Dynamical models, for example, can be used to\ncharacterize the temporal dynamics of a mechanism (Bechtel 2013a,b;\nKaplan and Bechtel 2011). Network models can be used to characterize\npatterns of connectivity regardless of what units are connected and\nregardless of what kinds of connections one is particularly interested\nin characterizing (Hunneman 2010). Minimal models can be used to\ncapture something fundamental about the dynamics of a broad class of\nmechanisms that share no entities and activities in common (Batterman\n2002). A model of a mechanism is a model that describes a\nmechanism. It need not be a mechanical model or a mechanism schema, in\nthe above sense, to play that role.\nSome mechanists reserve the term “mechanical models”\nfor models that describe the entities, activities, and organizational\nfeatures of a system. According to Glennan’s (2005) account, a\nmechanical model that leaves out some relevant features is, ipso\nfacto, incomplete and sketchy. One specific instantiation of this\ndebate concerns the explanatory force of functional models in\npsychology. Piccinini and Craver (2011)\nargue that such models should be understood as mechanistic sketches,\nblack-box models to be evaluated and filled in as details about the\nunderlying mechanism are discovered. Black box models are incomplete\nin virtue of leaving out details about underling mechanisms and that\nthose models ultimately depend for their explanatory force on the\npromise that the functional models do, in fact, correspond to how the\nmechanism works. (See Weiskopf 2011 for a criticism of this account\nand Povich forthcoming for a response) \nOne might talk about mechanistic explanation in a way that\nabstracts from the kind of model used to describe the mechanism: the\ncommitment to mechanistic explanation is not a commitment about the\nform of the model but rather a commitment about what such models must\nrepresent: namely, causal and mechanistic structures. Models are\nexplanatory in virtue of the fact that they represent the\ncausal/mechanistic structures that produce, underlie, or maintain the\nphenomenon. They are non-mechanistic if they refer to some non-causal,\nnon-mechanistic kind of relation (Salmon 1984; Craver 2014).\n3.4 Philosophical Work to Be Done\nTo date, much of the work on mechanistic explanation has been\ndriven by the goal of providing a descriptively and normatively\nadequate theory of mechanistic explanation. Some claim there are kinds\nof explanation that rely very little on a precise understanding of the\nmechanistic details of a system (Woodward 2014; Weiskopf 2011) or that\nwork fundamentally by removing all such details from one’s model\n(Batterman and Rice 2014). Resolving such debates will require being\nvery clear about precisely what one expects out of a philosophical\ntheory of scientific explanation and what one takes a scientific\nexplanation to be (Strevens 2008; Craver 2014). Research is required\nto understand the diverse representational forms that scientists use\nto represent mechanisms (Burnston et al. forthcoming), and to\nunderstand the role of idealization in mechanistic explanation (Levy\nand Bechtel 2012; Huneman 2010). Further work is also required to limn\nthe boundaries between mechanistic explanation and other putative\nvarieties of explanation and to say, as perspicuously as Hempel or the\ncausal-mechanical theory, what a model must do to count as explanatory\nand precisely how good explanations are to be distinguished from\nbad.\n4. Metaphysics of Mechanisms\nIn this section, we review some of the ways that the concept of\nmechanism has been used in diverse areas of metaphysics. Of all the\nareas we have discussed, this is likely the most in need of future\ndevelopment. Here we discuss the relationship between mechanisms and\nlaws, emergence, realization, natural kinds, and functions.\n4.1 Token Mechanisms, Type Mechanisms, and Laws\nIn much of the early literature on mechanisms, mechanisms are\ncontrasted explicitly with laws of nature (Bechtel 1988; Bechtel and\nAbrahamsen 2005; MDC 2000). This contrast clearly grew out of an\nemerging consensus in philosophy that there are few, or perhaps no,\nlaws of biology (see Section 3.1 above). The\nempirical generalizations one finds in biology tend to be hedged\nby ceteris paribus clauses; whether they hold or not depends\non background conditions that might not hold and on conditions\ninternal to the mechanism that might fail.  These generalizations, in\nshort, are mechanistically explicable; what necessity they have\nderives from a mechanism (Cummins 2000; Glennan 1996). Mechanisms thus\nseem to play the role of laws in the biological sciences: we seek\nmechanisms to explain, predict, and control phenomena in nature even\nif mechanisms lack many of the characteristics definitive of laws in\nthe logical empiricist framework (such as universality, inviolable\nnecessity, or unrestricted scope).\nOne specific strand of this discussion emerged from consideration\nof Weber’s (2005) argument that biology is heteronymous,\ni.e., that it ultimately borrows its explanatory power from the laws\nof physics and chemistry. Weber uses Hodgkin and Huxley’s model of the\naction potential as an exemplar of the reducing biological phenomena\nto physical laws (such as Ohm’s law and the Nernst equation). Craver\n(2006) responds that the explanatory force of Hodgkin and\nHuxley’s model, in fact, requires a grasp of the distinctly biological\nproperties of ion channels, which properties were black-boxed in\nHodgkin and Huxley’s total current equation (see also Craver 2007;\nBogen 2008b; Weber 2008).\nYet the contrast between laws and mechanisms has not always been\nentirely clear. Some, such as Bogen (2005), Machamer (2004), and\nGlennan (forthcoming) emphasize that causes and mechanisms are, at\nbase, singular, not general or universal. Leuridan (2010), building on\nthe work of Mitchell (2000), objects that mechanisms cannot replace\nlaws of nature in our conceptual understanding of explanation and the\nmetaphysics of science. Scientists rarely investigate token\nmechanisms, one might think, but are much more interested in\ntypes. And once one starts talking about types of mechanisms, one is\nback in the business of formulating general regularities about how\nmechanisms work. So it would appear that the concept of mechanism\ncannot supplant the work that generalization was supposed to do, but\nrequires the idea of regularity, and so something akin to laws, if it\nis to do that explanatory work (see Andersen 2011, 2012, 2014a,b;\nKrickel 2014). For a reply to Leuridan, see Kaiser and Craver (2013).\n \n4.2 Mechanisms, Levels, and Emergence\nWork on mechanisms has also helped to clarify the idea of levels of\norganization and its relation to other forms of organization and\nnon-mechanistic forms of emergence.\nMany mechanists, following Simon (1996 [1962]), emphasize that\nbiological systems are hierarchically organized into near-decomposable\nstructures: mechanisms within mechanisms, within mechanism. Using the\nparable of Tempus and Hora, Simon (1962) argued that a watchmaker who\nbuilds hierarchically decomposable watches (Tempus) will make more\nwatches than one who builds holistic watches (Hora). This parable led\nSimon to the conclusion that evolved structures are more likely to be\nnearly decomposable into hierarchically organized, more or less stable\nstructures and sub-structures. Some have objected that the story is\nmisleading because evolution does not construct organisms from\nscratch, piece by piece (Bechtel 2009b). Steel (2008), building on the\nwork of others (Schlosser and Wagner 2004), therefore attempts to\nreconstruct this argument as a way of showing that evolved systems are\nmore likely to be modular: systems made of independently manipulable\nparts can quarantine the effects of changes to specific parts, giving\nthem added flexibility to make local changes without causing\ncatastrophic side-effects.\nThe near decomposability of mechanisms is directly related to the\nidea that mechanisms span multiple levels of organization. The\nbehavior of the whole is explained in terms of the activities and\ninteractions among the component parts. These activities and\ninteractions are themselves sustained by underlying activities and\ninteractions among component parts, and so on (see Bechtel and\nRichardson 2010 [1993]).  Craver (2007) defines levels of mechanisms\nin terms of a relationship between the behavior (ψ) exhibited\nby a system (S) and the activity (φ) of some component\npart (X) of that system. On this\naccount, X’s φ-ing is at a lower level of mechanistic\norganization than S’s ψ-ing if and only if (i) X\nis a part of S, and (ii) X’s φ-ing is a component\nin S’s ψ-ing. In short, to say that something is at a\nlower mechanistic level than the mechanism as a whole is to say that\nit is a working part of the mechanism. Though the term\n“level” is used in many legitimate ways,\nlevels of mechanisms seem to play a central role in structuring the\nrelations among many different models in contemporary biology (e.g.,\nbetween Mendelian and molecular genetics (Darden 2006), between\nlearning and memory and channel physiology (Craver 2007), and between\npopulation-level variation and developmental mechanisms (Tabery 2009,\n2014a)).\nOne implication of this view of levels, combined with certain\nfamiliar assumptions about causal relations, is that there can be no\ncausal relationships between items at different levels of mechanisms.\nThere can be causal relationships between things of different sizes,\nand there can be causal relationships between things described in very\ndifferent vocabularies; but (again, conjoined with certain assumptions\nabout the temporal asymmetry of cause and effect and the independence\nof cause and effect) there cannot be causal relationships between the\nbehavior of a mechanism and the activities of the parts that jointly\nconstitute that behavior. Claims about interlevel causation, which are\nubiquitous in the scientific literature, are best understood either as\ntargeting a different sense of levels or, concerning levels of\nmechanisms, as expressing hybrid claims combining constitutive claims\nabout the relationship between the behavior of the mechanism as a\nwhole and the activities of its parts, and causal claims concerning\nrelationships between things not related as part and whole (Craver and\nBechtel 2007). For alternative interpretations of levels, see Fehr\n2004; Leuridan 2011; Thalos 2013; Eronen\n2013; 2015; Baumgartner\nand Gebhardter forthcoming; Romero\nforthcoming. For\nreflections on the metaphysical status of higher-level phenomena and\nhigher-level causes, see Baumgartner 2010; Glennan\n2010 a, b; Hoffman-Kolss 2014, as\nwell as the entries on \n causation and manipulability,\n physicalism, and\n scientific reduction.\nAs noted above, the fact that phenomena at higher levels of\nmechanisms depend upon the organization of component parts entails\nthat the properties/activities of wholes are not simple sums of the\nproperties/activities of the parts. Levels of mechanisms can thus be\ncontrasted with levels of mere aggregation. Because the whole is\ngreater (in this sense) than the sum of the parts, some (such as\nWimsatt) have found it appropriate to describe this as a kind of\nemergence. Mechanistic (or organizational) emergence thus\nunderstood is ubiquitous and banal but extremely important for\nunderstanding how scientists explain things.\nAlso familiar is epistemic emergence, the inability to\npredict the properties or behaviors of wholes from properties and\nbehaviors of the parts. Epistemic emergence can arise as a result of\nignorance, such as failing to recognize a relevant variable, or from\nfailing to know how different variables interact in complex networks.\nIt might also result from limitations on human cognitive abilities or\nin current-generation representational tools (Bedau 1997; Boogerd\n2005; Richardson and Stephan 2007). The practical necessity of\nstudying mechanisms by decomposing them into component parts raises\nthe epistemic challenge of putting the parts back together again in a\nway that actually works (Bechtel 2013a).\nThe mechanists’ emphasis on mechanistic/organizational and\nepistemic emergence contrasts with their desire to distance themselves\nfrom spooky emergence (Richardson and Stephan 2007). Spooky emergence\nwould involve the appearance of new properties with no sufficient\nbasis in mechanisms. It is not clear that emergent properties are\nproperly said to be properties of the necessary mechanisms; and it is\nnot clear in what since the emergent property is\n“emergent” rather than a fundamental feature of the causal\nstructure of the world.\nIn short, such forms of emergence are altogether distinct from, and\nso gain no plausibility from, verbal association with\norganizational/mechanistic and epistemic emergence.\n4.3 Mechanisms and Realization\nBecause the framework concept of a mechanism is so useful for\nthinking about levels and explanation in the sciences, some scholars\nhave sought in the notion of mechanism a way of fleshing out the\nontological relationship of realization.\nAccording to the “flat view” (Gillett 2002) realization\nis a relationship between different properties of one and the same\nthing (Kim 1998; Shapiro 2000; Shoemaker 2003, 2007; Polger 2007). The\nsubset view, which holds that a property P1 (e.g., mean kinetic energy\nof the gas) realizes property P2 (e.g., temperature of the gas) when\nthe causal powers distinctive of P2 (temperature) are a subset of the\ncausal powers distinctive of P2 (mean kinetic energy), is an example\nof the flat view. P1 and P2 are both attributed to the same thing, the\ngas (Gillett 2002, 2003). The dimensioned view describes realization\nas a relationship holding between the properties of wholes and the\nproperties of the parts and their organization. This view of\nrealization comports with the explanatory aims of the special sciences\nand fits nicely with the evidential base on which interlevel claims\nare grounded (see Aizawa and Gillett 2011). Gillett has since expanded\nthis notion to handle the realization of objects, properties, and\nprocesses (Gillett 2013); for criticism and alternatives, see Polger\n2010; Melnyk 2003; Melnyk 2010)\n4.4 Mechanisms and Natural Kinds\nMechanistic theories of natural kinds develop out of\nBoyd’s homeostatic property cluster (HPC) view. The HPC view\nis a theory of natural kinds designed to work in domains with high\nindividual variability. The HPC view is offered as a third way between\nessentialism and nominalism about kinds in the special sciences (Boyd\n1991, 1997, 1999; Kornblith 1993; Wilson 1999, 2005; see also\nthe entry on natural kinds).\nAccording to this view, a natural kind is characterized by i) a\ncluster of properties that regularly co-occur, and ii) a similarity\ngenerating mechanism that explains why the properties in (i) tend to\nco-occur. In short, kinds are property clusters explained by\nmechanisms.\nThis view of natural kinds has been deployed to argue for taxonomic\nrevision in, for example, the biology of human emotion (Griffiths\n1997), the structure of concepts (Machery 2009), and the taxonomy of\npsychiatry (Kendler, Zachar, and Craver\n2010; see Craver 2009): a\nputatively single kind is split into multiple kinds because it is\ndiscovered that distinct properties in a property cluster are\nexplained by distinct mechanisms. This view of kinds can also be used\nto make sense of kinds that are historically transient and, in some\nways, the product of human attitudes and so socially constructed in\nthis straightforward sense; perhaps race is like this (see Kuorikoski\nand Pöyhönin 2012; Khalidi 2013).\n4.5 Mechanisms and Functions\nEmphasis on the importance of mechanisms is historically associated\nwith the rejection of teleology and formal causes (e.g., Westfall\n1971). Yet contemporary biology and many other special sciences,\ndespite the widespread acceptance of the mechanism framework concept,\ncontinue to make use of the concept of function, a teleological notion\n(see the entry on \n teleological notions in biology).\n How is the notion of function at play in contemporary\nscience related to the concept of mechanism? Craver (2001a), following\nCummins (1975), argues that functional description is a perspectival\nmeans of situating some part within a higher-level\nmechanism. According to this view, teleology is not a feature of the\nworld so much as it is imposed upon it by an intentional describer\n(see also Machamer 1977). Garson (2011, 2012), following Wimsatt\n(1972b), Wright (1973) and Neander (1991a,b), argues that functions\nare effects of an item that are part of the etiological explanation\n(through selection, learning, or reinforcement) for why the item is\npresent; as such, functions are reduced to causal histories. In a\nthird view, Maley and Piccinini (forthcoming) argue that the\n(teleological) function of an item is its contribution to the goals of\norganisms, which may be objective or subjective goals. Like Garson,\nMaley and Piccinini hold that functions are objective (i.e., not\nobserver relative). Unlike Garson, however, they are not grounded in\nthe etiology of the item but in their current contribution to survival\nor reproduction (the objective goals of organisms) or to what the\norganism itself desires (the subjective goals of organisms).\n4.6 Philosophical Work to Be Done\nWhat must the world be like for this mechanistic perspective to be\naccurate? Clearly, there are many ways of answering this question from\ndifferent metaphysical starting assumptions. And clearly, many\nmetaphysical starting assumptions rule this world picture out as\nillegitimate. The clearest path forward, it would seem, is to work out\nprecisely what one must be committed to in holding that the world is\ncomposed of a hierarchy of mechanisms and precisely what of that can\nbe recovered on the basis of different starting assumptions.\nThat said, not all applications of the mechanism framework require\na fully articulated metaphysics. Work on discovery and explanation\nmight proceed perfectly well without embracing any particular\nmetaphysical world picture. Philosophers with different interests\n(discovery, explanation, testing, reduction, emergence, and so) are\nlikely to elaborate the concept in different ways. There is every\nreason to doubt, that the idea of mechanism can be given a one-size\nfits all metaphysical analysis that will adequately address the\ndiverse philosophical ends to which the concept is being deployed.\n5. Relations between Scientific Disciplines: From Theory Reduction to Mechanism Integration\n5.1 Theory Reduction\nAccording to Nagel (1961), reduction is a species of covering-law\nexplanation: one theory is reduced to another when it is possible to\nidentify the theoretical terms of the first with those of the second\nand to literally derive the first from the second. On the assumption\nthat scientific disciplines and theories correspond to one another,\nreduction serves as a model of interdisciplinary integration as well.\nMechanist’s objections to the covering-law model of constitutive\nexplanation (i.e., micro-reduction) are discussed above\n(see Section 3.1); here the focus is rather\non how distinct disciplines of science are integrated.\nOn the Nagel view, reduction is an interlevel relationship. It is\nalso a relationship between theories. Theories about phenomena at a\nhigher level (e.g., gases, lightning, and life) are reduced to (i.e.,\nderived from) theories about phenomena at lower levels (e.g.,\nmolecules, electrons, and physiological systems). Finally, the\nrelationship is formally specified and has little to do with either\nthe content of the theories or the material structures those theories\ndescribe. From the mechanistic perspective, each of these features of\nthe Nagel model is problematic.\n5.2 Mechanism Integration\nFirst, mechanists criticize the idea that reduction should be\nunderstood primarily as a relationship between theories. In\nintegrating their results, scientists are not simply building theories\nsimpliciter; they are building theories about mechanisms. Mechanisms\ncan perhaps be described using formal accounts of\ntheories—perhaps they can be axiomatized in predicate logic or\nreconstructed as set theoretic predicates. But such formal accounts of\nthe structures of scientific theories gloss over the mechanistic\nstructures crucial for understanding how these theories are\nconstructed and evaluated (Craver 2001b).\nMechanists also challenge the idea that disciplines are related by\nway of the relationship between their theories. Darden and\nMaull (1977) argued that disciplinary fields often integrate their\nfindings through the construction of interfield theories, appealing to\ndiverse material relationships between items in the different\nfields’ domains: relations such as cause and effect, part and\nwhole, or structure and function. Darden and Maull did not offer a\ngeneral account of interfield theories, but Bechtel presciently\nsuggested that such theories often take the form of descriptions of\nmechanisms (Bechtel 1988: 101–102).\nThe mechanistic approach also has been claimed to have many\nadvantages over reduction for thinking about interlevel forms of\ninterdisciplinary integration. First, it provides a straightforward\nway to interpret the talk of levels (see\nSections 2.4.5  and 4.2). Second, it offers\nsignificantly more insight into what interlevel integration is, into\nthe evidential constraints by which interlevel bridges are evaluated,\nand into the forces driving the co-evolution of work at different\nlevels. Constraints on the parts, their causal interactions, and their\nspatial, temporal, and hierarchical organization all help to flesh out\nan interlevel integration. Finally, mechanists repeatedly recognize\nthe need to not only look down to the constitutive mechanisms\nresponsible for a given phenomenon (emphasized by classical reduction\nmodels), but also to look up and around to the context within which\nthe phenomenon is embedded: interlevel integration is an effort to see\nhow phenomena at many different levels are related to one another\n(Bechtel 2009a; Craver 2007).\nMechanists have developed several extended examples of the many\nforms of mechanism integration pursued in mechanistic research\nprograms. Darden (2005), for example, suggests that philosophers in\nthe grip of classical reduction fundamentally misunderstood the\nrelationship between Mendelian and molecular genetics. While\nreductionists see it as an instance of interlevel explanation, she\nargues, it is in fact a case in which different scientists worked on\ndifferent parts of a mechanism that are etiologically (not\nconstitutively) related to one another. Mendelian genetics did not\nreduce to molecular biology; rather, classical geneticists and\nmolecular biologists integrated their work by focusing on different\nworking entities in the sequentially operating chromosomal and\nmolecular hereditary mechanisms. Examples have also been drawn from\nthe discovery of the mechanisms of protein synthesis (Darden 2006) and\ncell biology (Bechtel 2006). Craver (2007) uses examples from\nthe neuroscience of memory to explore how multilevel integration does\nand ought to proceed. In each case, the search for mechanisms serves\nas an abstract scaffold onto and around which the findings of diverse\nscientists converge.\n5.2.1 Integrative Pluralism\nThe mechanistic perspective tends to emphasize integrative\npluralism in scientific research (Mitchell 2003, 2009). The goal is\nnot to explain the less fundamental in terms of the more fundamental\nin a step-wise relating of monolithic theories at one level to\nmonolithic theories at another. Rather, such scientific achievements\nare collaborative and piecemeal, adding incremental constraints to an\nemerging picture of how a mechanism works both at a level and across\nlevels. The many scientific disciplines that investigate a phenomenon\npluralistically co-exist and co-inform one another by integratively\ncontributing to the etiological, constitutive, and contextual\nmechanistic explanations of that phenomenon (Bechtel\n2009a; Tabery 2014a).\n5.3 Philosophical Work to Be Done\nThe Nagel model of theory reduction offers a clear vision of the\n“unity of science”\n(see the entry on unity of science).\nAccording to the model, the unity among scientific disciplines is\nachieved by reducing theories of higher-level disciplines to the\ntheories of lower-level disciplines. Integration, on that vision, is\nunderstood as progress toward a grand, unified body of scientific\nknowledge. For mechanists, in contrast, integration is piecemeal,\nlocal, and pluralistic. What sort of unity could such an\n“integration” sustain? This question plays out in a\nback-and-forth between Longino and Tabery concerning disciplinary\nrelationships in the behavioral sciences. Tabery argues that\ndisciplines as disparate as neurobiology and quantitative genetics\ncould pluralistically co-exist and co-inform one another’s causal\nexplanations of complex behaviors by way of mechanism integration.\nLongino counters that Tabery’s pluralism is only a\n“moderate” sort because the push for integration\nultimately is a push for unification (Longino 2013, 2014; Tabery\n2014a,b).  Sullivan (2009) also challenges the push for mechanism\nintegration; she argues that there are significant barriers to the\nkind of integration mechanists envision. Different laboratories use\ndifferent experimental protocols to study what they assume to be the\nsame phenomenon; however, these different protocols often in fact\ntarget different phenomena, so the integration achieved by combining\nresults is only illusory. These discussions are symptomatic of more\ngeneral philosophical questions faced by mechanists: How are mechanism\nintegrations actually achieved (as opposed to just asserted)? And what\nis the relationship between mechanism integration and unification? The\nnew mechanical philosophy stands to benefit from future efforts to\nsituate mechanistic integration into more general philosophical views\nof integration and pluralism.\n6. Discovery: From A-ha Moments to Discovery Strategies\n6.1 Discovery via A-ha Moments\nWhat can philosophers say about scientific discovery? Many logical\nempiricists had a simple answer: Nothing. According to Popper, for\nexample, philosophers can illuminate the epistemology of testing, but\nthey can say nothing of substance about how scientists generate the\nideas to be tested (Popper 1959). Such “A-ha!” moments of\ncreativity are in the province of psychology, not philosophy.\nReichenbach distinguished the context of discovery from the context of\njustification (the “context distinction”) (Reichenbach\n1938; but see the entry on \n Hans Reichenbach for an alternate\n interpretation of this\ndistinction). The process of scientific discovery was thus largely off\nlimits to philosophers.\nNot all philosophers of science agreed. Hanson, for example,\narticulated a logic of discovery involving abductive inferences from\nanomalous data to new hypotheses designed to account for them (Hanson\n1958). Others focused on methodologies of discovery that could either\nallow one to rationally reconstruct why something was discoverable at\na given time (Nickels 1985) or to explain why a new hypothesis is\nconsidered promising and worthy of further investigation (Schaffner\n1993). Early contributions to the new mechanical philosophy followed\nthis path and characterized investigative strategies scientists use to\ndiscover mechanisms (see the entry on \n scientific discovery).\n6.2 Discovery via Strategies\nBechtel and Richardson’s Discovering Complexity (2010\n[1993]) is organized around a flowchart representing choice-points in\nthe discovery of a mechanism. The process of searching for mechanisms\nbegins with a provisional characterization of the phenomenon. Then\nfollow strategies of localizing the mechanism within the\nsystem, and decomposing the phenomenon into distinct\nsub-functions. Localization of function involves determining which of\nthese sub-functions of the system is performed by which parts. Bechtel\nand Richardson further characterize the use of excitatory and\ninhibitory experiments to obtain these kinds of information. Bechtel\nand Abrahamsen (2013) add a subsequent stage, in which\nscientists recompose what they have learned about the\nfunctional parts by putting them back together to produce the\nphenomenon in question (perhaps using simulations). \nDarden also emphasized mechanisms as an important framework concept\nin scientific discovery (Darden 1980, 1982, 1986, 1991). In the\ndiscovery of protein synthesis (jointly investigated by molecular\nbiologists and biochemists in the 1950s and 1960s), scientists didn’t\nsimply have an “A-ha” moment. Rather, they deployed\nstrategies for revealing how a mechanism works (Darden 2006; Craver\nand Darden 2013). Darden characterizes the process of mechanism\ndiscovery as an “extended, piecemeal process with hypotheses\nundergoing iterative refinement”; that process occurs via the\nconstruction, evaluation, and revision of mechanism schemas in light\nof observational and experimental constraints (Darden 2006: 272).\nDarden’s construction strategies are strategies for generating new\nhypotheses about a mechanism. In addition to decomposition and\nlocalization, Darden shows that scientists often borrow a schema\ntype from another area of science, as when selection-type\nmechanisms were borrowed to understand how the immune system works, or\nassemble a mechanism from known modules of functional activity\n(modular sub-assembly), as is common in biochemistry and\nmolecular biology. Sometimes, scientists know one part of the\nmechanism and attempt to work forward or backward through to the other\nparts and activities. In the discovery of the mechanism of protein\nsynthesis, for example, molecular biologists worked forward from the\nstructure of DNA to figure out what molecules could interact with it\n(forward chaining), and biochemists worked backward from\nproteins to figure out what chemical reactions would be necessary to\ncreate them (backward chaining). They met in the middle at\nRNA. Protein synthesis is now understood to involve transcribing DNA\ninto RNA and then translating RNA into proteins. Far from being\nphilosophically inscrutable, Darden points out that scientists used\nwhat they knew about the working entities and activities in the\nmechanism to infer what could come next or before in the mechanism of\nprotein synthesis (Darden 2006; see\nalso the entry on \nmolecular biology).\nEvaluation strategies, for Darden, involve constraint-based\nreasoning to limn the contours of the space of possible\nmechanisms for a given phenomenon. Often scientists reason about how a\nmechanism works by building off basic findings concerning the spatial\nand temporal organization of its parts. Harvey, for example, reasoned\nhis way to the circulation of the blood by considering the locations\nof the valves of the veins and their orientation with respect to the\nheart. These organizational constraints, and many others, combined to\nnarrow the space of possible mechanisms to a small region containing a\nmodel in which the blood completes a circuit of the body (Craver and\nDarden 2013).\nDarden and Craver also discuss experimental strategies for learning\nhow a mechanism works. These strategies reveal how different entities\nand activities in a mechanism act, interact, and are organized\ntogether. For example, one might intervene to remove a putative\ncomponent to see if and how the mechanism functions in its absence\n(inhibitory experiments). Or one might stimulate\nthat component to see if it can drive the mechanism or modulate its\nbehavior. Or one might activate a mechanism by placing it in\nthe precipitating conditions for the phenomenon and observe how the\nentity or activity changes as the mechanism works. Craver (2002)\ndiscusses these under the heading of “interlevel\nexperiments” (see also Harinen forthcoming). \nCraver and Darden (2013) also discuss more complex\nkinds of experiments for learning what sort of entity or activity\ncontributes to a process and for learning more complex features of a\nmechanism’s organization.\nDatteri (2009; Datteri and Tamburrini 2007), explores the use of\nrobotic simulations for the purposes of testing mechanisms. They\ndiscuss both how assumptions are built into robotic models and how\nexperiments can be designed to reveal how mechanisms work. This work\nextends the mechanistic framework into the area of bio-robotics and\nreveals a set of strategies distinct from those explored in Darden’s\nwork.\nRather than focusing on the process by which mechanism schemas are\nconstructed, evaluated, and revised, Steele focuses on the question of\nhow one extrapolates from a sample population or a model organism to\nthe structure of a mechanism in the target. Will a treatment proven to\nsuppress tumors in mice (a model organism) also suppress tumors in\nhumans (the target population)? After developing a probabilistic\naccount of mechanisms, Steele considers how researchers get around\nwhat he calls the extrapolator’s circle: determining\n\nhow we could know that the model and the target are\nsimilar in causally relevant respects without already knowing the\ncausal relationship in the target. (Steel 2008: 78)\n\n Steel breaks the extrapolator’s circle by\ndeveloping a mechanisms-based extrapolation strategy—the\nstrategy of comparative process tracing. Once a mechanism for\nsome phenomenon has been elucidated in a model (such as a particular\nprocess of carcinogenesis in rats), scientists (toxicologists in this\ncase) then compare key stages (particularly downstream stages) of the\nmodel with the stages in the target, paying particular attention to\npoints in the process where differences are most likely to arise. The\ngreater the similarities of the entities, activities, and organization\nof the mechanisms in both populations, the stronger is the basis for\nextrapolation; the greater the differences, the weaker the basis (but\nsee Howick et al. 2013; see also the sections on extrapolation in the\nentries on\n molecular biology\nand\n experiment in biology).\n6.3 Mechanistic Evidence in Medical Discoveries\nDiscovery in medicine is another domain where the mechanical\nphilosophy has been applied. Thagard draws on the case of H.\npylori as a cause of ulcers to provide an account of how\ninvestigating mechanisms contributes to scientific discovery.\nThagard draws attention to both statistical evidence that suggests\nulcers are somehow associated with H. pylori, as well as\nmechanistic evidence that can explain how the agent of infection could\npersist in a hostile environment long enough to cause an ulcer. More\nrecently, philosophers interested in evidence-based medicine have\nprobed the relationship between these two types of evidence in the\nhealth sciences. Russo and Williamson argue that both types of\nevidence are necessary to justify causal inference; the correlational\nevidence establishes that there is a difference-making relation\nbetween some cause and some effect, while the mechanistic evidence\nestablishes how exactly the cause produces its effect—the\n“Russo-Williamson Thesis” (Russo and Williamson\n2007). Philosophers have since refined the Russo-Williamson Thesis,\npointing out, for instance, that “type of evidence” could\nrefer to different methodologies for gathering evidence or to\ndifferent objects of evidence.  Difference-making methodologies\ninclude observational studies and randomized controlled trials, while\nmechanistic methodologies include interventionist experiments such as\nthose described above; likewise, the object of evidence could be the\nevidence of an associated difference or it could be the evidence\nconcerning the mechanism linking the cause and effect (Illari 2011;\nsee also Campaner 2011).  Evidence-based medicine hierarchies, which\nrank different kinds of evidence in terms of its epistemic strength,\ntend to prioritize evidence from difference-making methodologies (such\nas randomized controlled trials and meta-analyses) over mechanistic\nevidence; in reply, these philosophers argue that the different types\nof evidence are on a par (each with its own strengths and weaknesses)\nand advocate for integrating difference-making and mechanistic\nevidence, a sentiment which aligns with the emphasis on mechanism\nintegration discussed in Section 5.2 above\n(Clarke et al. 2013, 2014). \n6.4 Philosophical Work to Be Done\nMany mechanists have explored the strategies that scientists use in\ndiscovery. Bechtel and Richardson attended to decomposition and\nlocalization; Darden and Craver highlighted forward and backward\nchaining; Russo and Williamson emphasized drawing on both\ndifference-making and mechanistic evidence. These strategies were\nfound in specific, experimental sciences, such as neuroscience and\nmolecular biology. So one task for philosophers moving forward is to\nassess whether or not similar strategies exist in other sciences,\nespecially those that operate outside the traditional laboratory, both\nin the human sciences (such as sociology and economics) and in the\nphysical sciences (such as cosmology).\nWe also expect tremendous development to come from bridging the gap\nbetween the qualitative accounts of mechanisms and mechanistic\nexplanation developed in the new mechanism and quantitative theories\nof discovery from the discipline of machine learning and causal\nmodeling (Spirtes et al. 2000; Pearl 2009). The latter offer tools to\nmine correlational data for causal dependencies. Such tools might\nescape more qualitative, historical approaches and might, in fact, go\nbeyond the common strategies that scientists traditionally use. Such\ntools also offer a means to assess discovery strategies by exploring\nthe conditions under which they succeed and fail and the efficiency\nwith which they deliver verdicts on causal hypotheses.\n7. Conclusion\nThe new mechanical philosophy and, more generally, attention to the\nframework concept of “mechanism” has expanded rapidly over\nthe last two decades bringing with it new orientations toward a wide\nrange of issues in the philosophy of science. Yet it is clear that\nmany of the major topics are only beginning to develop, leaving a lot\nof work for scholars to elaborate the basic commitments of this\nframework and to consider what it means to do science outside of that\nframework.  The near future is likely to see continued discussion of\nthe implications and limits of this framework for thinking about\nscience and scientific practice.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aizawa, K. and C. Gillett, 2011, “The Autonomy of Psychology\nin the Age of Neuroscience”, in <em>Causality in the\nSciences</em>, in Illari et al. 2011: 202–23.",
                "Allen, G.E., 2005, “Mechanism, Vitalism and Organicism in\nLate Nineteenth and Twentieth Century Biology: The Importance of\nHistorical Context”, in Craver and Darden 2005:\n261–283.",
                "Alon, U., 2006, <em>An Introduction to Systems\nBiology</em>, Boca Raton: Chapman and Hall/CRC Press.",
                "Andersen, Holly, 2011, “Mechanisms, Laws, and\nRegularities”, <em>Philosophy of Science</em>, 78(2):\n325–331.",
                "–––, 2012, “The Case for Regularity in\nMechanistic Causal Explanation”, <em>Synthese</em>, 189:\n415–432.",
                "–––, 2014a, “A Field Guide to Mechanisms:\nPart I”, <em>Philosophy Compass</em>, 4: 274–283.",
                "–––, 2014b, “A Field Guide to Mechanisms:\nPart II”, <em>Philosophy Compass</em>, 4: 283–297.",
                "Baker [now Byron], J.M., 2005, “Adaptive Speciation: The\nRole of Natural Selection in Mechanisms of Geographic and\nNon-geographic Speciation”, in Craver and Darden 2005:\n303–326.",
                "Barros, D.B., 2008, “Natural Selection as a\nMechanism”, <em>Philosophy of Science</em>, 75:\n306–322.",
                "Batterman, R., 2002, “Asymptotics and the Role of Minimal\nModels”, <em>The British Journal for the Philosophy of\nScience</em>, 53: 21–38.",
                "Batterman, R. and C. Rice, 2014, “Minimal Model\nExplanations”, <em>Philosophy of Science</em>, 81:\n349–376.",
                "Baumgartner, M., 2010, “Interventionism and\nEpiphenomenalism”, <em>Canadian Journal of Philosophy</em>, 40:\n359–384.",
                "–––, 2013, “Rendering Interventionism and\nNon-Reductive Physicalism Compatible”, <em>Dialectica</em>, 67:\n1–27.",
                "Baumgartner, M. and A. Gebharter, forthcoming, “Constitutive\nRelevance, Mutual Manipulability, and Fat-Handedness”, <em>The\nBritish Journal for the Philosophy of\nScience</em>. doi:10.1093/bjps/axv003\n[<a href=\"http://www.unige.ch/lettres/baumgartner/docs/Mechanisms.pdf\" target=\"other\">Baumgartner and Gebharter forthcoming available\nonline</a>]",
                "Beatty, J., 1995, “The Evolutionary Contingency\nThesis”, in James G. Lennox and Gereon Wolters\n(eds), <em>Concepts, Theories, and Rationality in the Biological\nSciences</em>, Pittsburgh, PA: University of Pittsburgh Press,\npp. 45–81.",
                "Bechtel, W., 1988, <em>Philosophy of science: An overview for\ncognitive science</em>, Hillsdale, NJ: Erlbaum. Italian translation\nFilosofia della scienza e scienza cognitiva, Gius. Laterza &amp;\nFigli, 1995. Second edition in\npreparation. [<a href=\"http://mechanism.ucsd.edu/research/philosophyofscience.html\" target=\"other\">some of Bechtel 1988 available online</a>]",
                "–––, 2006, <em>Discovering Cell Mechanisms: The\nCreation of Modern Cell Biology</em>, Cambridge: Cambridge University\nPress. [<a href=\"http://mechanism.ucsd.edu/discoveringcellbiology.htm\" target=\"other\">some of Bechtel 2006 available online</a>]",
                "–––, 2008, <em>Mental Mechanisms: Philosophical\nPerspectives on Cognitive Neuroscience</em>, London: Routledge.",
                "–––, 2009a, “Looking Down, Around, and Up:\nMechanistic Explanation in Psychology”, <em>Philosophical\nPsychology</em>, 22: 543–564.\n [<a href=\"http://mechanism.ucsd.edu/research/Bechtel-2009-Looking%20down,%20around.pdf\" target=\"other\">Bechtel 2009a available online</a>]",
                "–––, 2009b, “Explanation: Mechanism,\nModularity, and Situated Cognition”, in P. Robbins and M. Aydede\n(eds). <em>Cambridge handbook of situated cognition</em>, Cambridge:\nCambridge University Press,\npp. 155–170. [<a href=\"http://mechanism.ucsd.edu/research/situatedcognitionpaper.webversion.pdf\" target=\"other\">Bechtel 2009b available online</a>]",
                "–––, 2011, “Mechanism and Biological\nExplanation”, <em>Philosophy of Science</em>, 78:\n533–557.",
                "–––, 2013a, “Addressing the Vitalist’s\nChallenge to Mechanistic Science: Dynamic Mechanistic\nExplanation”, in S. Normandin &amp; C.T. Wolfe\n(eds), <em>Vitalism and the Scientific Image in Post-Enlightenment\nLife Science, 1800–2010</em>, Dordrecht: Springer,\npp. 345–370.",
                "–––, 2013b, “From Molecules to Behavior\nand the Clinic: Integration in Chronobiology”, <em>Studies in\nHistory and Philosophy of Biological and Biomedical Sciences</em>, 44:\n493–502.",
                "Bechtel, W. and A. Abrahamsen, 2005, “Explanation: A\nMechanistic Alternative”, <em>Studies in History and Philosophy\nof the Biological and Biomedical Sciences</em>, 36:\n421–441. [<a href=\"http://mechanism.ucsd.edu/research/explanation.mechanisticalternative.pdf\" target=\"other\">Bechtel and Abrahamsen 2005 available online</a>]",
                "–––, 2013, “Thinking Dynamically about\nBiological Mechanisms: Networks of Coupled\nOscillators”, <em>Foundations of Science</em>, 18:\n707–723. [<a href=\"http://mechanism.ucsd.edu/research/Thinking%20Dynamically%20About%20Biological.for%20Foundations%20of%20Science.pdf\" target=\"other\">Bechtel and Abrahamsen 2013 available online</a>]",
                "Bechtel, W. and R.C. Richardson, 2010 [1993], <em>Discovering\nComplexity: Decomposition and Localization as Strategies in Scientific\nResearch</em>, Second Edition.  Cambridge, MA: MIT Press/Bradford\nBooks.",
                "Bedau, M., 1997, “Weak Emergence”, <em>Philosophical\nPerspectives</em>, 11: 375–399.",
                "Beebee, H., C. Hitchcock, and P. Menzies, (eds), 2010, <em>The\nOxford Handbook of Causation</em>, Oxford: Oxford University\nPress.",
                "Boas, M., 1952, “The Establishment of the Mechanical\nPhilosophy”, <em>Osiris</em>, 10: 412–541.",
                "Bogen, J., 2005, “Regularities and Causality;\nGeneralizations and Causal Explanations”, in Craver and Darden\n2005: 397–420.",
                "–––, 2008a, “Causally Productive\nActivities”, <em>Studies in History and Philosophy of\nScience</em>, 39: 112–123.",
                "–––, 2008b, “The Hodgkin-Huxley Equations\nand the Concrete Model: Comments on Craver, Schaffner, and\nWeber”, <em>Philosophy of Science</em>, 75:\n1034–1046.",
                "Boogerd, F.C., F.J. Bruggeman, R.C. Richardson A. Stephan, and\nH. V. Westerhoff, 2005, “Emergence and Its Place in Nature: A\nCase Study of Biochemical Networks”, <em>Synthese</em>, 145:\n131–164.",
                "Boyd, R., 1991, “Realism, Anti-Foundationalism and the\nEnthusiasm for Natural Kinds”, <em>Philosophical Studies</em>,\n61: 127–148.",
                "–––, 1997, “Kinds as the\n‘Workmanship of Men’: Realism, Constructivism, and Natural\nKinds”, in J. Nida-Rumelin (ed.), <em>Rationality, Realism,\nRevision: Proceedings of the 3rd International Congress of the Society\nfor Analytical Philosophy</em>, New York: Walter de Gruyter,\npp. 52–89.",
                "–––, 1999, “Homeostasis, Species, and\nHigher Taxa”, in R.A. Wilson (ed.), <em>Species</em>, MIT Press:\nCambridge, 141-185.",
                "Brandon, R., 1985, “Grene on Mechanism and Reductionism:\nMore Than Just a Side Issue”, in Peter Asquith and Philip\nKitcher (eds), <em>PSA 1984</em>, v. 2. East Lansing, MI: Philosophy\nof Science Association, pp. 345–353.",
                "Bromberger, S., 1966, “Why Questions”, in R.G. Colodny\n(ed.), <em>Mind and Cosmos</em>, Pittsburgh: University of Pittsburgh\nPress, pp. 86–111.",
                "Burnston, D.C., B. Sheredos, A. Abrahamsen, and W. Bechtel, in\npress, “Scientists’ Use of Diagrams in Developing\nMechanistic Explanations: A Case Study from\nChronobiology”, <em>Pragmatics and Cognition</em>.",
                "Campaner, R., 2011, “Understanding Mechanisms in the Health\nSciences”, <em>Theoretical Medicine and Bioethics</em>, 32:\n5–17.",
                "Cartwright, N.D., 1989, <em>Nature’s Capacities and their\nMeasurement</em>, New York: Oxford University\nPress. [<a href=\"http://www.oxfordscholarship.com/oso/public/content/philosophy/9780198235071/toc.html\" target=\"other\">Cartwright 1989 available online</a>]",
                "–––, 1999, <em>The Dappled World: A Study of the\nBoundaries of Science</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2001, “Modularity: It Can—and\nGenerally Does—Fail”, in <em>Stochastic Dependence and\nCausality</em>, D. Costantini, M.C. Galavotti, and P. Suppes (eds),\nStanford: CSLI Publications, pp 65–84.",
                "–––, 2002, “Against Modularity, the Causal\nMarkov Condition and Any Link Between the Two: Comments on Hausman and\nWoodward”, <em>British Journal for the Philosophy of\nScience</em>, 53: 411–453.",
                "Chemero A. and M. Silberstein, 2008, “After the Philosophy\nof Mind: Replacing Scholasticism with Science”, <em>Philosophy\nof Science</em>, 75: 1–27.",
                "Churchland, P.S., 1986, <em>Neurophilosophy: Toward a Unified\nScience of the Mind/Brain</em>, Cambridge, MA: MIT Press.",
                "Churchland, P.S. and T.J. Sejnowski, 1992, <em>The Computational\nBrain</em>, Cambridge, MA: MIT Press.",
                "Chirimuuta, M., 2014, “Minimal Models and Canonical Neural\nComputations: The Distinctness of Computational Explanation in\nNeuroscience”. <em>Synthese</em>, 191: 127–153.",
                "Clarke, B., D. Gillies, P. Illari, F. Russo, and J. Williamson,\n2013, “The Evidence that Evidence-Based Medicine\nOmits”, <em>Preventive Medicine</em>, 57: 745–747.",
                "–––, 2014, “Mechanisms and the Evidence\nHierarchy”, <em>Topoi</em>, 33: 339–360.",
                "Couch, M.B., 2011, “Mechanisms and Constitutive\nRelevance”, <em>Synthese</em>, 183: 375–88.",
                "Craver, C.F., 2001a, “Role Functions, Mechanisms and\nHierarchy”, <em>Philosophy of Science</em>, 68:\n31–55.",
                "–––, 2001b, “Structures of Scientific\nTheories”, in P.K. Machamer and M. Silberstein\n(eds), <em>Blackwell Guide to the Philosophy of Science</em>,\nBlackwell: Oxford, pp. 55–79.",
                "–––, 2006, “When Mechanistic Models\nExplain”, <em>Synthese</em>, 153: 355–376.",
                "–––, 2007, <em>Explaining the Brain: Mechanisms\nand the Mosaic Unity of Neuroscience</em>, Oxford: Clarendon\nPress.",
                "–––, 2009, “Mechanisms and Natural\nKinds”, <em>Philosophical Psychology</em>, 22:\n575–594.",
                "–––, 2013, “Functions and Mechanisms: A\nPerspectivalist Account”, in P. Huneman (ed.), <em>Functions:\nSelection and Mechanisms</em>, Dordrecht:\nSpringer, pp. 133–158.",
                "–––, 2014, “The Ontic Conception of\nScientific Explanation”, in Andreas Hütteman and Marie Kaiser\n(eds), <em>Explanation in the Special Sciences: The Cases of Biology\nand History</em>, Dordrecht: Springer,\npp. 27–52.",
                "Craver, C.F. and A. Alexandrova, 2008, “No Revolution\nNecessary: Neural Mechanisms for Economics”, <em>Economics and\nPhilosophy</em>, 24: 381–406.",
                "Craver, C.F. and W.M. Bechtel, 2007, “Top-down Causation\nwithout Top-down Causes”, <em>Biology and Philosophy</em>, 22:\n547–563.",
                "Craver, C.F. and L. Darden, 2013, <em>In Search of Mechanisms:\nDiscoveries Across the Life Sciences</em>, Chicago: University of Chicago\nPress.",
                "Cummins, R., 1975, “Functional Analysis”, <em>Journal\nof Philosophy</em>, 72: 741–764.",
                "–––, 1983, <em>The Nature of Psychological\nExplanation</em>, Cambridge, MA: Bradford/MIT Press.",
                "–––, 2000, “‘How Does It\nWork?’ Vs.  ‘What Are The Laws?’ Two Conceptions of\nPsychological Explanation”, in F. Keil and R. Wilson\n(eds), <em>Explanation and Cognition</em>, Cambridge, MA: MIT Press,\npp. 117–144.",
                "Darden, L., 1986, “Reasoning in Theory\nConstruction: Analogies, Interfield Connections, and Levels of\nOrganization”, in P. Weingartner and G. Dorn\n(eds), <em>Foundations of Biology</em>, Vienna:\nHolder-Pichler-Tempsky, pp. 99–107.",
                "–––, 1991, <em>Theory Change in Science:\nStrategies from Mendelian Genetics</em>, New York: Oxford University\nPress.",
                "–––, 2002, “Strategies for Discovering\nMechanisms: Schema Instantiation, Modular Subassembly,\nForward/Backward Chaining”, <em>Philosophy of Science</em>, 69:\nS354–S365.",
                "–––, 2005, “Relations Among Fields:\nMendelian, Cytological and Molecular Mechanisms”, <em>Studies in\nHistory and Philosophy of Biological and Biomedical Sciences</em>, 36:\n349–371.",
                "–––, 2006, <em>Reasoning in Biological\nDiscoveries: Mechanism, Interfield Relations, and Anomaly\nResolution</em>, New York: Cambridge University Press.",
                "Darden, L. and J. Cain, 1989, “Selection Type\nTheories”, <em>Philosophy of Science</em>,\n56:106–129.",
                "Darden, L. and N. Maull, 1977, “Interfield\nTheories”, <em>Philosophy of Science</em>, 44: 43–64.",
                "Datteri, E., 2009, “Simulation Experiments in Bionics: A\nRegulative Methodological Perspective”, <em>Biology and\nPhilosophy</em>, 24: 301–324.",
                "Datteri, E. and G. Tamburrini, 2007, “Biorobotic Experiments\nfor the Discovery of Biological Mechanisms”, <em>Philosophy of\nScience</em>, 74: 409–430.",
                "DesAutels, L., 2011, “Against Regular and Irregular\nCharacterizations of Mechanisms”, <em>Philosophy of\nScience</em>, 78: 914–925.",
                "Des Chene, D., 2001, <em>Spirits &amp; Clocks: Machine &amp;\nOrganism in Descartes</em>, Ithaca, NY: Cornell University Press.",
                "–––, 2005, “Mechanisms of Life in the\nSeventeenth Century: Borelli, Perrault, Régis”, <em>Studies in\nthe History and Philosophy of Biological and Biomedical Sciences</em>,\n36: 245–260.",
                "Dijksterhuis, E.J., 1961, <em>The Mechanization of the World\nPicture</em>, New York: Oxford University Press.",
                "Dowe, P., 1992, “Wesley Salmon’s Process Theory of Causality\nand the Conserved Quantity Theory”, <em>Philosophy of\nScience</em>, 59: 195–216.",
                "–––, 2011, “The Causal-Process-Model\nTheory of Mechanisms”, in Illari et al. 2011:\n865–879.",
                "Dray, W., 1957, <em>Laws and Explanation in History</em>, London:\nOxford University Press.",
                "Dupré, J., 1993, <em>The Disorder of Things: Metaphysical\nFoundations of the Disunity of Science</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "–––, 2013, “Living\nCauses”, <em>Proceedings of the Aristotelian Society</em>, 87:\n19–35.",
                "Elster, J., 1989, <em>Nuts and Bolts for the Social Sciences</em>,\nCambridge, UK: Cambridge University Press.",
                "Eronen, M.I., 2013, “No Levels, No Problems: Downward\nCausation in Neuroscience”, <em>Philosophy of Science</em>, 80:\n1042–1052.",
                "–––, 2015, “ Levels of Organization: A\nDeflationary Account”, <em>Biology and\nPhilosophy</em>, 30: 39–58.",
                "Fagan, M.B., 2012, “The Joint Account of Mechanistic\nExplanation”, <em>Philosophy of Science</em>, 79:\n448–472.",
                "–––, 2013, <em>Philosophy of Stem Cell Biology:\nKnowledge in Flesh and Blood</em>, London: Palgrave MacMillan.",
                "Fehr, C., 2004, “Feminism and Science: Mechanism without\nWeductionism”, <em>National Women’s Studies Association\nJournal</em>, 16: 136–156.",
                "Fodor, J., 1968, <em>Psychological Explanation</em>, New York:\nRandom House.",
                "Garson, J., 2011, “Selected Effects Functions and Causal\nRole Functions in the Brain: The Case for an Etiological Approach to\nNeuroscience”, <em>Biology &amp; Philosophy</em>, 26:\n547–565.",
                "–––, 2012, “Function, Selection, and\nConstruction in the Brain”, <em>Synthese</em>, 189:\n451–481.",
                "–––, 2013, “The Functional Sense of\nMechanism”, <em>Philosophy of Science</em>, 80:\n317–333.",
                "Giere, R.N., 2004, “How Models Are Used to Represent\nReality”, <em>Philosophy of Science</em>, 71:\n742–752.",
                "Gillett, C., 2002, “The Dimensions of Realization: A\nCritique of the Standard View”, <em>Analysis</em>, 62:\n316–323.",
                "–––, 2003, “The Metaphysics of\nRealization, Multiple Realizability, and the Special\nSciences”, <em>The Journal of Philosophy</em>, 100:\n591–603.",
                "–––, 2013, “Constitution, and Multiple\nConstitution, in the Sciences: Using the Neuron to Construct a\nStarting Framework”, <em>Minds and Machines</em>, 23:\n309–37.",
                "Glennan, S.S., 1996, “Mechanisms and The Nature of\nCausation”, <em>Erkenntnis</em>, 44: 49–71.",
                "–––, 1997, “Capacities, Universality and\nSingularity”, <em>Philosophy of Science</em>, 64:\n605–626.",
                "–––, 2002, “Rethinking Mechanistic\nExplanation”, <em>Philosophy of Science</em>, 69:\nS342–S353.",
                "–––, 2005, “Modeling\nMechanisms”, <em>Studies in the History and Philosophy of the\nBiological and Biomedical Sciences</em>, 36: 375–388.",
                "–––, 2009, “Productivity, Relevance and\nNatural Selection”, <em>Biology and Philosophy</em>, 24:\n325–339.",
                "–––, 2010a, “Mechanisms”, in Beebee\net al. 2010: 315–325.",
                "–––, 2010b, “Mechanisms, Causes, and the\nLayered Model of the World”, <em>Philosophy and Phenomenological\nResearch</em>, 81: 362–381.",
                "–––, forthcoming, <em>The New Mechanical\nPhilosophy</em>, Oxford: Oxford University Press.",
                "Godfrey-Smith, P., 2010, “Causal Pluralism”, in Beebee\net al. 2010: 326–337.\n [<a href=\"http://petergodfreysmith.com/CausalPluralismPGS-07-Final.pdf\" target=\"other\">Godfrey-Smith 2010 available online</a>]",
                "Gould, S.J., 1990, <em>Wonderful Life: Burgess Shale and the\nNature of History</em>, New York: W.W. Norton and Company.",
                "Griffiths, P.E., 1997, <em>What Emotions Really Are: The Problem\nof Psychological Categories</em>, Chicago: University of Chicago\nPress.",
                "Grush, R., 2003, “In Defense of Some ‘Cartesian’\nAssumptions Concerning the Brain and its Operation”, <em>Biology\nand Philosophy</em>, 18: 53–93.",
                "Hanson, N.R., 1958, <em>Patterns of Discovery</em>, Cambridge:\nCambridge University Press.",
                "Harbecke, J., 2010, “Mechanistic Constitution in\nNeurobiological Explanations”, <em>International Studies in the\nPhilosophy of Science</em>, 24: 267–285.",
                "–––, 2014 [onlinefirst], “Regularity\nConstitution and the Location of Mechanistic\nLevels”, <em>Foundations of Science</em>, 19. doi:\n10.1007/s10699–014–9371–1",
                "Harinen, T., forthcoming, “Mutual Manipulability and Causal\nBetweenness”, <em>Synthese</em>,\ndoi:10.1007/s11229-014-0564-5",
                "Haugeland, J., 1998, <em>Having Thought</em>, Cambridge, MA:\nHarvard University Press",
                "Havstad, J.C., 2011, “Discussion: Problems for Natural\nSelection as a Mechanism”, <em>Philosophy of Science</em>, 78:\n512–523.",
                "Hedström, P., 2005, <em>Dissecting the Social: On the Principles\nof Analytical Sociology</em>, Cambridge: Cambridge University\nPress.",
                "Hedström, P. and R. Swedberg, 1998, <em>Social Mechanisms: An\nAnalytical Approach to Social Theory</em>, Cambridge: Cambridge\nUniversity Press.",
                "Hedström, P. and P. Ylikoski, 2010, “Causal Mechanisms in\nthe Social Sciences”, <em>Annual Review of Sociology</em>, 36:\n49–67.",
                "Heil, J. and A. Mele, 1993, <em>Mental Causation</em>, Oxford:\nClarendon Press.",
                "Hempel, C.G., 1965, <em>Aspects of Scientific Explanation and\nOther Essays in the Philosophy of Science</em>, New York: Free\nPress.",
                "Hempel, C.G. and P. Oppenheim, 1948, “Studies in the Logic\nof Explanation”, <em>Philosophy of Science</em>, 15:\n135–175.",
                "Hitchcock, C.R., 1995, “Discussion: Salmon on Explanatory\nRelevance”, <em>Philosophy of Science</em>, 62:\n304–20.",
                "Hoffmann-Kloss, V., 2014, “Interventionism and Higher-Level\nCausation”, <em>International Studies in the Philosophy of\nScience</em>, 28: 49–64.",
                "Howick, J.P. Glasziou, and J.K. Aronson, 2013, “Problems\nwith Using Mechanisms to Solve the Problem of\nExtrapolation”, <em>Theoretical Medicine and Bioethics</em>, 34:\n275–291.",
                "Huneman, P., 2010, “Topological Explanations and Robustness\nin Biological Sciences”, <em>Synthese</em>, 177:\n213–245.",
                "Illari, P.M., 2011, “Disambiguating the Russo-Williamson\nThesis”, <em>International Studies in the Philosophy of\nScience</em>, 25: 139–157.",
                "Illari, P.M., F. Russo, and J. Williamson (eds),\n2011, <em>Causality in the Sciences</em>, Oxford: Oxford University\nPress.",
                "Illari, P.M. and J. Williamson, 2010, “Function and\nOrganization: Comparing the Mechanisms of Protein Synthesis and\nNatural Selection”, <em>Studies in the History and Philosophy of\nthe Biological and Biomedical Sciences</em>, 41: 279–291.",
                "–––, 2012, “What is a Mechanism?: Thinking\nabout Mechanisms Across the Sciences”, <em>European Journal for\nPhilosophy of Science</em>, 2: 119–135.",
                "Kaiser, M. and C.F. Craver, 2013, “Mechanisms and Laws:\nClarifying the Debate”, in Hsiang-Ke Chao, Szu-Ting Chen and\nRoberta L. Millstein (eds), <em>Mechanism and Causality in Biology and\nEconomics</em>, Dordrecth: Springer, pp.\n125–145. [<a href=\"https://philarchive.org/rec/KAIMAL\" target=\"other\">Kaiser and Craver 2013 available online</a>]",
                "Kaplan, D.M., 2012, “How to Demarcate the Boundaries of\nCognition”, <em>Biology and Philosophy</em>, 27:\n545–570.",
                "Kaplan, D.M. and W. Bechtel, W, 2011, “Dynamical Models: An\nAlternative or Complement to Mechanistic\nExplanations”, <em>Topics</em>, <em>in Cognitive\nScience</em>, <em>3:</em>, 438–444.\n [<a href=\"http://mechanism.ucsd.edu/research/Kaplan-2011-Dynamical%20models_%20An.pdf\" target=\"other\">Kaplan and Bechtel 2011 available online</a>]",
                "Kaplan, D.M. and C.F. Craver, 2011, “The Explanatory Force\nof Dynamical Models”, <em>Philosophy of Science</em>, 78:\n601–627.",
                "Kauffman, S.A., 1971, “Articulation of Parts Explanation in\nBiology and the Rational Search for Them”, in Roger C. Buck and\nRobert S. Cohen (eds), <em>PSA 1970, Boston Studies in the Philosophy\nof Science</em>, volume 8. Dordrecht: Reidel, pp. 257–272.\nReprinted in Marjorie Grene and Everett Mendelsohn (eds),\n1976, <em>Topics in the Philosophy of Biology</em>, Dordrecht: Reidel,\npp.  245–263.",
                "Kendler, K., P. Zachar, and C.F. Craver, 2010, “What Kinds\nof Things are Psychiatric Disorders?”, <em>Psychological\nMedicine</em>, 41: 1143–1150.",
                "Khalidi, M.A., 2013, <em>Natural Categories and Human Kinds</em>,\nCambridge: Cambridge University Press.",
                "Kim, J., 1998, <em>Mind in a Physical World</em>, Cambridge, MA:\nThe MIT Press.",
                "Krickel, B., 2014, <em>The Metaphysics of Mechanism</em>, PhD\nDissertation. Humboldt-Universität zu Berlin.",
                "Kornblith, H., 1993, <em>Inductive Inference and Its Natural\nGround</em>, Cambridge, MA: MIT Press.",
                "Kuhlmann, M., 2011, “Mechanisms in Dynamically Complex\nSystems”, in Illari et al. 2011: 880–906.",
                "Kuhlmann, M. and S. Glennan, 2014, “On the Relation between\nQuantum Mechanical and Neo-Mechanistic Ontologies and Explanatory\nStrategies”, <em>European Journal for Philosophy of\nScience</em>, 4: 337–359.",
                "Kuhn, T.S., 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.",
                "Kuorikoski, J. and S. Pöyhönen, 2012, “Looping Kinds and\nSocial Mechanisms”, <em>Sociological Theory</em>, 30:\n187–205.",
                "Kuorikoski, J. and P.K. Ylikoski, 2013, <em>EPSA11 Perspectives\nand Foundational Problems in Philosophy of Science</em>, V. Karakostas\n&amp; D. Dieks (eds), Heidelberg: Springer, pp. 69–80.",
                "Lakatos, I., 1977, <em>The Methodology of Scientific Research\nProgrammes: Philosophical Papers</em>, vol. 1. Cambridge; Cambridge\nUniversity Press.",
                "Laudan, L., 1977, <em>Progress and Its Problems</em>, Berkeley:\nUniversity of California Press.",
                "Leuridan, B., 2010, “Can Mechanisms Really Replace Laws of\nNature?”, <em>Philosophy of Science</em>, 77:\n317–340.",
                "–––, 2011, “Three Problems for the Mutual\nManipulability Account of Constitutive Relevance in\nMechanisms”, <em>The British Journal for the Philosophy of\nScience</em>, 63: 399–427.",
                "Levy, A., 2013, “Three Kinds of ‘New\nMechanism’”, <em>Biology and Philosophy</em>, 28:\n99–114.",
                "–––, 2014, “What was Hodgkin and Huxley’s\nAchievement?”, <em>British Journal for the Philosophy of\nScience</em>, 65(3): 469–492. doi:10.1093/bjps/axs043",
                "Levy, A. and W. Bechtel, 2012, “Abstraction and the\nOrganization of Mechanisms”, <em>Philosophy of Science</em>, 80:\n241–261.",
                "Little, D., 1991, <em>Varieties of Social Explanation: An\nIntroduction to the Philosophy of Social Science</em>, Boulder, CO:\nWestview.",
                "–––, 1998, <em>Microfoundations, Method, and\nCausation: On the Philosophy of the Social Science</em>, New\nBrunswick, NJ: Transaction.",
                "Longino, H., 2013, <em>Studying Human Behavior: How Scientists\nInvestigate Aggression and Sexuality</em>, Chicago: University of\nChicago Press.",
                "–––, 2014, “Pluralism, Social Action, and\nthe Causal Space of Human Behavior”, <em>Metascience</em>, 23:\n443–459.",
                "Machamer, P.K., 1977, “Teleology and Selective\nProcesses”, in R.  Colodny (ed.), <em>Logic, Laws, and Life:\nSome Philosophical Complications</em>, Pittsburgh, PA: University of\nPittsburgh Press, pp.  129–142.",
                "Machamer, P., 2004, “Activities and Causation: The\nMetaphysics and Epistemology of Mechanisms”, <em>International\nStudies in the Philosophy of Science</em>, 18: 27–39.",
                "Machamer, P.K., L. Darden, and C.F. Craver, 2000 [MDC],\n“Thinking about Mechanisms”, <em>Philosophy of\nScience</em>, 67:1–25.",
                "Machery, E., 2009, <em>Doing Without Concepts</em>, New York:\nOxford University Press.",
                "Mackie, J.L., 1974, <em>The Cement of the Universe</em>, Oxford:\nClarendon Press.",
                "Maley, C.J. and G. Piccinini, forthcoming, “A Unified\nMechanistic Account of Teleological Functions for Psychology and\nNeuroscience”, in David Kaplan (ed.), <em>Integrating Mind\nand Brain Science: Mechanistic Perspectives and Beyond</em>, Oxford:\nOxford University Press.",
                "Matthews, L., forthcoming, “Embedded Mechanisms and\nPhylogenetics”, <em>Philosophy of Science</em>.",
                "Matthewson, J. and B. Calcott, 2011, “Mechanistic Models of\nPopulation-Level Phenomena”, <em>Biology and Philosophy</em>,\n26: 737–756.",
                "McCauley, R.N. and W. Bechtel, 2001, “Explanatory Pluralism\nand the Heuristic Identity Theory”, <em>Theory and\nPsychology</em>, 11: 736–760.",
                "Melnyk, A., 2003, <em>A Physicalist Manifesto: Thoroughly Modern\nMaterialism</em>, Cambridge: Cambridge University Press. ",
                "Melnyk, A., 2010, “Comments on Sydney\nShoemaker’s <em>Physical Realization</em>”, <em>Philosophical\nStudies</em>, 148: 113–123.",
                "Menzies, P., 2012, “The Causal Structure of\nMechanisms”, <em>Studies in History and Philosophy of Biological\nand Biomedical Sciences</em>, 43: 796–805.",
                "Milkowski, M., 2013, <em>Explaining the Computational Mind</em>,\nCambridge, MA: MIT Press.",
                "Millstein, R.L., 2006, “Natural Selection as a\nPopulation-Level Causal Process”, <em>The British Journal for\nthe Philosophy of Science</em>, 57: 627 -653.",
                "Milo, R, S. Shen-Orr, S. Itzkovitz, N. Kashtan, D. Chklovskii, and\nU. Alon, 2002, “Network Motifs: Simple Building Blocks of\nComplex Networks”, <em>Science</em>, 298(5594):\n824–27.",
                "Mitchell, S.D., 1997, “Pragmatic Laws”, <em>Philosophy\nof Science</em>, 64: S468–S479.",
                "–––, 2000, “Dimensions of Scientific\nLaw”, <em>Philosophy of Science </em>67: 242–265.",
                "–––, 2003, <em>Biological Complexity and\nIntegrative Pluralism</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2005, “Modularity: More than a\nBuzzword?  Essay Review, <em>Biological Theory</em>, 1:\n98–101.",
                "–––, 2009, <em>Unsimple Truths: Science,\nComplexity, and Policy</em>, Chicago: University of Chicago\nPress.",
                "Moss, L., 2012, “Is the Philosophy of Mechanism Philosophy\nEnough?” <em>Studies in the History and Philosophy of Science:\nC</em>, 43: 164–72.",
                "Nagel, E., 1961, <em>The Structure of Science: Problems in the\nLogic of Scientific Explanation</em>, New York: Harcourt, Brace and\nWorld.",
                "Neander, K., 1991a, “The Teleological Notion of\n‘Function’”, <em>Australasian Journal of\nPhilosophy</em>, 69: 454–468.",
                "–––, 1991b, “Functions as Selected\nEffects: the Conceptual Analyst’s Defence”, <em>Philosophy of\nScience</em>, 58: 168–184.",
                "Nicholson, D.J., 2012, “The Concept of Mechanism in\nBiology”, <em>Studies in History and Philosophy of Biological\nand Biomedical Sciences</em>, 43: 152–163.",
                "Nickels, T., 1985, “Beyond Divorce: Current Status of the\nDiscovery Debate”, <em>Philosophy of Science</em>, 52:\n177–206.",
                "Oppenheim, P. and H. Putnam, 1958, “The Unity of Science as\na Working Hypothesis”, in H. Feigl, M. Scriven and G. Maxwell\n(eds), <em>Concepts, Theories and the Mind-Body Problem</em>,\n(Minnesota Studies in the Philosophy of Science, v. 2), Minneapolis:\nUniversity of Minnesota Press, pp. 3–36.",
                "Pearl, J., 2009, <em>Causality: Models, Reasoning, and\nInference</em>, second edition, New York: Cambridge University\nPress.",
                "Persson, Johannes, 2010, “Activity-Based Accounts of\nMechanism and the Threat of Polygenic\nEffects”, <em>Erkenntnis</em>, 72: 135–149.",
                "Piccinini, G., 2007, “Computing\nMechanisms”, <em>Philosophy of Science</em>, 74:\n501–526.",
                "Piccinini, G. and C.F. Craver, 2011, “Integrating Psychology\nand Neuroscience: Functional Analyses as Mechanism\nSketches”, <em>Synthese</em>, 183: 283–3",
                "Piccinini, G. and A. Scarantino, 2011, “Information\nProcessing, Computation, and Cognition”, <em>Journal of\nBiological Physics</em>, 37: 1–38.",
                "Polger, T.W., 2007, “Realization and the Metaphysics of\nMind”, <em>Australasian Journal of Philosophy</em>, 85:\n233–59.",
                "–––, 2010, “Mechanisms and Explanatory\nRealization Relations”, <em>Synthese</em>, 177:\n193–212.",
                "Popper, K., 1959, <em>The Logic of Scientific Discovery</em>,\nLondon: Hutchinson and Co.",
                "Povich, M., forthcoming, “Mechanisms and Model-based\nfMRI”, <em>Philosophy of Science</em>.",
                "Psillos, S., 2004, “A Glimpse of the Secret Connexion:\nHarmonizing Mechanism with Counterfactuals”, <em>Perspectives on\nScience</em>, 12: 288–319.",
                "Ramsey, J.L., 2008, “Mechanisms and Their Explanatory\nChallenges in Organic Chemistry”, <em>Philosophy of\nScience</em>, 75: 970–982.",
                "Reichenbach, H., 1938, <em>Experience and Prediction: An Analysis\nof the Foundations and the Structure of Knowledge</em>, Chicago: The\nUniversity of Chicago Press.",
                "Richardson, R.C. and A. Stephan, 2007,\n“Emergence”, <em>Biological Theory</em>, 2:\n91–96.",
                "Roe, S., 2014, <em>The Salmon-Roe Approach to Mechanistic\nExplanations</em>, Doctoral Dissertation, UC Davis.",
                "Romero, F., forthcoming, “Why there isn’t interlevel\ncausation in mechanisms”, <em>Synthese</em>.\ndoi:10.1007/s11229-015-0718-0",
                "Rosenberg, A., 1985, <em>The Structure of Biological\nScience</em>, Cambridge: Cambridge University Press.",
                "Russell, B., 1913, “On the Notion of\nCause”, <em>Proceedings of the Aristotelian Society</em>, 13:\n1–26.",
                "Russo, F., 2009, <em>Causality and Causal Modeling in the Social\nSciences: Measuring Variation</em>, Dordrecht: Springer.",
                "Russo, F. and J. Williamson, 2007, “Interpreting Causality\nin the Health Sciences”, <em>International Studies in the\nPhilosophy of Science</em>, 21: 157–170.",
                "Salmon, W.C., 1984, <em>Scientific Explanation and the Causal\nStructure of the World</em>, Princeton, NJ: Princeton University\nPress.",
                "–––, 1989, <em>Four Decades of Scientific\nExplanation</em>, Minneapolis, MN: University of Minnesota Press.",
                "–––, 1994, “Causality Without\nCounterfactuals”, <em>Philosophy of Science</em>, 61:\n297–312.",
                "–––, 1997, “Causality and Explanation: A\nReply to Two Critiques”, <em>Philosophy of Science</em>, 64:\n461–77.",
                "Schaffer, J., 2000, “Causation by\nDisconnection”, <em>Philosophy of Science</em>, 67:\n285–300.",
                "–––, 2004, “Causes Need Not be Physically\nConnected to Their Effects: The Case for Negative Causation”, in\nC.  Hitchcock (ed.), <em>Contemporary Debates in Philosophy of\nScience</em>, Malden, MA: Blackwell\nPublishing. Pp. 197–216.",
                "Schaffner, K., 1993, <em>Discovery and Explanation in Biology and\nMedicine</em>, Chicago, IL: University of Chicago Press.",
                "Schlosser, G. and G.P. Wagner, 2004, <em>Modularity in Development\nand Evolution</em>, Chicago, IL: University of Chicago Press.",
                "Scriven, M., 1959, “Explanation and Prediction in\nEvolutionary Theory”, <em>Science</em>, 130: 477–482.",
                "Shagrir, O., 2010, “Computation, San Diego\nStyle”, <em>Philosophy of Science</em>, 77: 862–874.",
                "Shapiro, L., 2000, “Multiple\nRealizations”, <em>Journal of Philosophy</em>, 97:\n635–654.",
                "Shoemaker, S., 2003, “Realization, Micro-Realization, and\nCoincidence”, <em>Philosophy and Phenomenological Research</em>,\n67: 1–23.",
                "–––, 2007, <em>Physical Realization</em>,\nOxford: Oxford University Press.",
                "Simon, H.A., 1996 [1962], <em>The Sciences of the Artificial</em>,\n3<sup>rd</sup> ed., Cambridge, MA: MIT Press.",
                "Skipper Jr., R.A. and R.L. Millstein, 2005, “Thinking about\nEvolutionary Mechanisms: Natural Selection”, in Craver and\nDarden 2005: 327–347.",
                "Spirtes, P., C. Glymour, and R. Scheines, 2000, <em>Causation,\nPrediction, and Search</em>, 2<sup>nd</sup> ed., Cambridge, MA: MIT\nPress.",
                "Steel, D.P., 2008, <em>Across the Boundaries: Extrapolation in\nBiology and Social Science</em>, New York: Oxford University\nPress.",
                "Strevens, M., 2008, <em>Depth: An Account of Scientific\nExplanation</em>, Cambridge, MA: Harvard University Press.",
                "Sullivan, Jacqueline, 2009, “The Multiplicity of\nExperimental Protocols: A Challenge to Reductionist and\nNon-Reductionist Models of the Unity of\nNeuroscience”, <em>Synthese</em>, 167: 511–539.",
                "Tabery, J., 2004, “Synthesizing Activities and Interactions\nin the Concept of a Mechanism”, <em>Philosophy of Science</em>,\n71: 1–15.",
                "–––, 2009, “Difference Mechanisms:\nExplaining Variation with Mechanisms”, <em>Biology and\nPhilosophy</em>, 24: 645–664.",
                "–––, 2014a, <em>Beyond Versus: The Struggle to\nUnderstand the Interaction of Nature and Nurture</em>, Cambridge, MA:\nThe MIT Press.",
                "–––, 2014b, “Pluralism, Social Action, and\nthe Causal Space of Human Behavior”, <em>Metascience</em>, 23:\n443–459.",
                "Teller, P., 2010, “Mechanism, Reduction, and Emergence in\nTwo Stories of the Human Epistemic\nEnterprise”, <em>Erkenntnis</em>, 73: 413–425.",
                "Thagard, P., 1998, “Explaining Disease: Causes,\nCorrelations, and Mechanisms”, <em>Minds and Machines</em>, 8:\n61–78.",
                "–––, 2000, <em>How Scientists Explain\nDisease</em>, Princeton, NJ: Princeton University Press.",
                "–––, 2006, <em>Hot Thought: Mechanisms and\nApplications of Emotional Cognition</em>, Cambridge, MA: The MIT\nPress.",
                "Thalos, M., 2013, <em>Without Hierarchy</em>: <em>An Essay on the\nScale Freedom of the Universe</em>, Oxford: Oxford University\nPress.",
                "Theurer, K.L., 2013, “Compositional Explanatory Relations\nand Mechanistic Reduction”, <em>Minds and Machines</em>, 23:\n287–307.",
                "Weber, M., 2005, <em>Philosophy of Experimental Biology</em>,\nCambridge: Cambridge University Press.",
                "–––, 2008, “Causes without Mechanisms:\nExperimental Regularities, Physical Laws, and Neuroscientific\nExplanation”, <em>Philosophy of Science</em>, 75:\n995–1007.",
                "Weisberg, M., 2007, “Three Kinds of\nIdealization”, <em>The Journal of Philosophy</em>, 104:\n639–659.",
                "–––, 2013, <em>Simulation and Similarity: Using\nModels to Understand the World</em>, Oxford: Oxford University\nPress.",
                "Weiskopf, D., 2011, “Models and Mechanisms in Psychological\nExplanation”, <em>Synthese</em>, 183: 313–338.",
                "Westfall, R., 1971, <em>The Construction of Modern Science</em>,\nCambridge: Cambridge University Press.",
                "–––, 2005, <em>Genes and the Agents of\nLife</em>, Cambridge: Cambridge University Press.",
                "Wimsatt, W.C., 1972a, “Complexity and Organization”,\nin Kenneth F.  Schaffner and Robert S. Cohen (eds), <em>PSA 1972,\nProceedings of the Philosophy of Science Association</em>, Dordrecht:\nReidel, pp.  67–86.",
                "–––, 1972b, “Teleology and the Logical\nStructure of Function Statements”, <em>Studies in the History\nand Philosophy of Science</em>, 3: 1–80.",
                "–––, 1976, “Reductionism, Levels of\nOrganization, and the Mind–Body Problem”, in G. Globus,\nI. Savodnik, and G. Maxwell (eds), <em>Consciousness and the\nBrain</em>, New York: Plenum Press, pp. 199–267.",
                "–––, 1997, “Aggregativity: Reductive\nHeuristics for Finding Emergence”, <em>Philosophy of\nScience</em>, 64: S372–S384.",
                "–––, 2007, <em>Re-Engineering Philosophy for\nLimited Beings: Piecewise Approximations to Reality</em>, Cambridge,\nMA: Harvard University Press.",
                "Woodward, J., 1989, “The Causal/Mechanical Model of\nExplanation”, in P. Kitcher and W.C. Salmon\n(eds), <em>Scientific Explanation</em>, (Minnesota Studies in the\nPhilosophy of Science 13), pp. 357–383.",
                "–––, 2001, “Law and Explanation in\nBiology: Invariance Is the Kind of Stability that\nMatters”, <em>Philosophy of Science</em>, 68: 1–20.",
                "–––, 2002, “What Is a Mechanism?: A\nCounterfactual Account”, <em>Philosophy of Science</em>, 69:\nS366–S377.",
                "–––, 2003, <em>Making Things Happen: A Theory of\nCausal Explanation</em>, New York: Oxford University Press.",
                "–––, 2011, “Mechanisms\nRevisited”, <em>Synthese</em>, 183: 409–427.",
                "–––, 2014, “A Functional Account of\nCausation; or, A Defense of the Legitimacy of Causal Thinking by\nReference to the Only Standard That Matters—Usefulness (as\nOpposed to Metaphysics or Agreement with Intuitive\nJudgment)”, <em>Philosophy of Science</em>, 81:\n691–713.",
                "Wright, L., 1973, “Functions”, <em>Philosophical\nReview</em>, 82: 139–168.",
                "Ylikoski, P., 2013, “Causal and Constitutive Explanation\nCompared”, <em>Erkenntnis</em>, 78: 277–97."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Aizawa, K. and C. Gillett, 2011, “The Autonomy of Psychology\nin the Age of Neuroscience”, in <em>Causality in the\nSciences</em>, in Illari et al. 2011: 202–23.</li>\n<li>Allen, G.E., 2005, “Mechanism, Vitalism and Organicism in\nLate Nineteenth and Twentieth Century Biology: The Importance of\nHistorical Context”, in Craver and Darden 2005:\n261–283.</li>\n<li>Alon, U., 2006, <em>An Introduction to Systems\nBiology</em>, Boca Raton: Chapman and Hall/CRC Press.</li>\n<li>Andersen, Holly, 2011, “Mechanisms, Laws, and\nRegularities”, <em>Philosophy of Science</em>, 78(2):\n325–331.</li>\n<li>–––, 2012, “The Case for Regularity in\nMechanistic Causal Explanation”, <em>Synthese</em>, 189:\n415–432.</li>\n<li>–––, 2014a, “A Field Guide to Mechanisms:\nPart I”, <em>Philosophy Compass</em>, 4: 274–283.</li>\n<li>–––, 2014b, “A Field Guide to Mechanisms:\nPart II”, <em>Philosophy Compass</em>, 4: 283–297.</li>\n<li>Baker [now Byron], J.M., 2005, “Adaptive Speciation: The\nRole of Natural Selection in Mechanisms of Geographic and\nNon-geographic Speciation”, in Craver and Darden 2005:\n303–326.</li>\n<li>Barros, D.B., 2008, “Natural Selection as a\nMechanism”, <em>Philosophy of Science</em>, 75:\n306–322.</li>\n<li>Batterman, R., 2002, “Asymptotics and the Role of Minimal\nModels”, <em>The British Journal for the Philosophy of\nScience</em>, 53: 21–38.</li>\n<li>Batterman, R. and C. Rice, 2014, “Minimal Model\nExplanations”, <em>Philosophy of Science</em>, 81:\n349–376.</li>\n<li>Baumgartner, M., 2010, “Interventionism and\nEpiphenomenalism”, <em>Canadian Journal of Philosophy</em>, 40:\n359–384.</li>\n<li>–––, 2013, “Rendering Interventionism and\nNon-Reductive Physicalism Compatible”, <em>Dialectica</em>, 67:\n1–27.</li>\n<li>Baumgartner, M. and A. Gebharter, forthcoming, “Constitutive\nRelevance, Mutual Manipulability, and Fat-Handedness”, <em>The\nBritish Journal for the Philosophy of\nScience</em>. doi:10.1093/bjps/axv003\n[<a href=\"http://www.unige.ch/lettres/baumgartner/docs/Mechanisms.pdf\" target=\"other\">Baumgartner and Gebharter forthcoming available\nonline</a>]</li>\n<li>Beatty, J., 1995, “The Evolutionary Contingency\nThesis”, in James G. Lennox and Gereon Wolters\n(eds), <em>Concepts, Theories, and Rationality in the Biological\nSciences</em>, Pittsburgh, PA: University of Pittsburgh Press,\npp. 45–81.</li>\n<li>Bechtel, W., 1988, <em>Philosophy of science: An overview for\ncognitive science</em>, Hillsdale, NJ: Erlbaum. Italian translation\nFilosofia della scienza e scienza cognitiva, Gius. Laterza &amp;\nFigli, 1995. Second edition in\npreparation. [<a href=\"http://mechanism.ucsd.edu/research/philosophyofscience.html\" target=\"other\">some of Bechtel 1988 available online</a>]</li>\n<li>–––, 2006, <em>Discovering Cell Mechanisms: The\nCreation of Modern Cell Biology</em>, Cambridge: Cambridge University\nPress. [<a href=\"http://mechanism.ucsd.edu/discoveringcellbiology.htm\" target=\"other\">some of Bechtel 2006 available online</a>]</li>\n<li>–––, 2008, <em>Mental Mechanisms: Philosophical\nPerspectives on Cognitive Neuroscience</em>, London: Routledge.</li>\n<li>–––, 2009a, “Looking Down, Around, and Up:\nMechanistic Explanation in Psychology”, <em>Philosophical\nPsychology</em>, 22: 543–564.\n [<a href=\"http://mechanism.ucsd.edu/research/Bechtel-2009-Looking%20down,%20around.pdf\" target=\"other\">Bechtel 2009a available online</a>]</li>\n<li>–––, 2009b, “Explanation: Mechanism,\nModularity, and Situated Cognition”, in P. Robbins and M. Aydede\n(eds). <em>Cambridge handbook of situated cognition</em>, Cambridge:\nCambridge University Press,\npp. 155–170. [<a href=\"http://mechanism.ucsd.edu/research/situatedcognitionpaper.webversion.pdf\" target=\"other\">Bechtel 2009b available online</a>]</li>\n<li>–––, 2011, “Mechanism and Biological\nExplanation”, <em>Philosophy of Science</em>, 78:\n533–557.</li>\n<li>–––, 2013a, “Addressing the Vitalist’s\nChallenge to Mechanistic Science: Dynamic Mechanistic\nExplanation”, in S. Normandin &amp; C.T. Wolfe\n(eds), <em>Vitalism and the Scientific Image in Post-Enlightenment\nLife Science, 1800–2010</em>, Dordrecht: Springer,\npp. 345–370.</li>\n<li>–––, 2013b, “From Molecules to Behavior\nand the Clinic: Integration in Chronobiology”, <em>Studies in\nHistory and Philosophy of Biological and Biomedical Sciences</em>, 44:\n493–502.</li>\n<li>Bechtel, W. and A. Abrahamsen, 2005, “Explanation: A\nMechanistic Alternative”, <em>Studies in History and Philosophy\nof the Biological and Biomedical Sciences</em>, 36:\n421–441. [<a href=\"http://mechanism.ucsd.edu/research/explanation.mechanisticalternative.pdf\" target=\"other\">Bechtel and Abrahamsen 2005 available online</a>]</li>\n<li>–––, 2013, “Thinking Dynamically about\nBiological Mechanisms: Networks of Coupled\nOscillators”, <em>Foundations of Science</em>, 18:\n707–723. [<a href=\"http://mechanism.ucsd.edu/research/Thinking%20Dynamically%20About%20Biological.for%20Foundations%20of%20Science.pdf\" target=\"other\">Bechtel and Abrahamsen 2013 available online</a>]</li>\n<li>Bechtel, W. and R.C. Richardson, 2010 [1993], <em>Discovering\nComplexity: Decomposition and Localization as Strategies in Scientific\nResearch</em>, Second Edition.  Cambridge, MA: MIT Press/Bradford\nBooks.</li>\n<li>Bedau, M., 1997, “Weak Emergence”, <em>Philosophical\nPerspectives</em>, 11: 375–399.</li>\n<li>Beebee, H., C. Hitchcock, and P. Menzies, (eds), 2010, <em>The\nOxford Handbook of Causation</em>, Oxford: Oxford University\nPress.</li>\n<li>Boas, M., 1952, “The Establishment of the Mechanical\nPhilosophy”, <em>Osiris</em>, 10: 412–541.</li>\n<li>Bogen, J., 2005, “Regularities and Causality;\nGeneralizations and Causal Explanations”, in Craver and Darden\n2005: 397–420.</li>\n<li>–––, 2008a, “Causally Productive\nActivities”, <em>Studies in History and Philosophy of\nScience</em>, 39: 112–123.</li>\n<li>–––, 2008b, “The Hodgkin-Huxley Equations\nand the Concrete Model: Comments on Craver, Schaffner, and\nWeber”, <em>Philosophy of Science</em>, 75:\n1034–1046.</li>\n<li>Boogerd, F.C., F.J. Bruggeman, R.C. Richardson A. Stephan, and\nH. V. Westerhoff, 2005, “Emergence and Its Place in Nature: A\nCase Study of Biochemical Networks”, <em>Synthese</em>, 145:\n131–164.</li>\n<li>Boyd, R., 1991, “Realism, Anti-Foundationalism and the\nEnthusiasm for Natural Kinds”, <em>Philosophical Studies</em>,\n61: 127–148.</li>\n<li>–––, 1997, “Kinds as the\n‘Workmanship of Men’: Realism, Constructivism, and Natural\nKinds”, in J. Nida-Rumelin (ed.), <em>Rationality, Realism,\nRevision: Proceedings of the 3rd International Congress of the Society\nfor Analytical Philosophy</em>, New York: Walter de Gruyter,\npp. 52–89.</li>\n<li>–––, 1999, “Homeostasis, Species, and\nHigher Taxa”, in R.A. Wilson (ed.), <em>Species</em>, MIT Press:\nCambridge, 141-185.</li>\n<li>Brandon, R., 1985, “Grene on Mechanism and Reductionism:\nMore Than Just a Side Issue”, in Peter Asquith and Philip\nKitcher (eds), <em>PSA 1984</em>, v. 2. East Lansing, MI: Philosophy\nof Science Association, pp. 345–353.</li>\n<li>Bromberger, S., 1966, “Why Questions”, in R.G. Colodny\n(ed.), <em>Mind and Cosmos</em>, Pittsburgh: University of Pittsburgh\nPress, pp. 86–111.</li>\n<li>Burnston, D.C., B. Sheredos, A. Abrahamsen, and W. Bechtel, in\npress, “Scientists’ Use of Diagrams in Developing\nMechanistic Explanations: A Case Study from\nChronobiology”, <em>Pragmatics and Cognition</em>.</li>\n<li>Campaner, R., 2011, “Understanding Mechanisms in the Health\nSciences”, <em>Theoretical Medicine and Bioethics</em>, 32:\n5–17.</li>\n<li>Cartwright, N.D., 1989, <em>Nature’s Capacities and their\nMeasurement</em>, New York: Oxford University\nPress. [<a href=\"http://www.oxfordscholarship.com/oso/public/content/philosophy/9780198235071/toc.html\" target=\"other\">Cartwright 1989 available online</a>]</li>\n<li>–––, 1999, <em>The Dappled World: A Study of the\nBoundaries of Science</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2001, “Modularity: It Can—and\nGenerally Does—Fail”, in <em>Stochastic Dependence and\nCausality</em>, D. Costantini, M.C. Galavotti, and P. Suppes (eds),\nStanford: CSLI Publications, pp 65–84.</li>\n<li>–––, 2002, “Against Modularity, the Causal\nMarkov Condition and Any Link Between the Two: Comments on Hausman and\nWoodward”, <em>British Journal for the Philosophy of\nScience</em>, 53: 411–453.</li>\n<li>Chemero A. and M. Silberstein, 2008, “After the Philosophy\nof Mind: Replacing Scholasticism with Science”, <em>Philosophy\nof Science</em>, 75: 1–27.</li>\n<li>Churchland, P.S., 1986, <em>Neurophilosophy: Toward a Unified\nScience of the Mind/Brain</em>, Cambridge, MA: MIT Press.</li>\n<li>Churchland, P.S. and T.J. Sejnowski, 1992, <em>The Computational\nBrain</em>, Cambridge, MA: MIT Press.</li>\n<li>Chirimuuta, M., 2014, “Minimal Models and Canonical Neural\nComputations: The Distinctness of Computational Explanation in\nNeuroscience”. <em>Synthese</em>, 191: 127–153.</li>\n<li>Clarke, B., D. Gillies, P. Illari, F. Russo, and J. Williamson,\n2013, “The Evidence that Evidence-Based Medicine\nOmits”, <em>Preventive Medicine</em>, 57: 745–747.</li>\n<li>–––, 2014, “Mechanisms and the Evidence\nHierarchy”, <em>Topoi</em>, 33: 339–360.</li>\n<li>Couch, M.B., 2011, “Mechanisms and Constitutive\nRelevance”, <em>Synthese</em>, 183: 375–88.</li>\n<li>Craver, C.F., 2001a, “Role Functions, Mechanisms and\nHierarchy”, <em>Philosophy of Science</em>, 68:\n31–55.</li>\n<li>–––, 2001b, “Structures of Scientific\nTheories”, in P.K. Machamer and M. Silberstein\n(eds), <em>Blackwell Guide to the Philosophy of Science</em>,\nBlackwell: Oxford, pp. 55–79.</li>\n<li>–––, 2006, “When Mechanistic Models\nExplain”, <em>Synthese</em>, 153: 355–376.</li>\n<li>–––, 2007, <em>Explaining the Brain: Mechanisms\nand the Mosaic Unity of Neuroscience</em>, Oxford: Clarendon\nPress.</li>\n<li>–––, 2009, “Mechanisms and Natural\nKinds”, <em>Philosophical Psychology</em>, 22:\n575–594.</li>\n<li>–––, 2013, “Functions and Mechanisms: A\nPerspectivalist Account”, in P. Huneman (ed.), <em>Functions:\nSelection and Mechanisms</em>, Dordrecht:\nSpringer, pp. 133–158.</li>\n<li>–––, 2014, “The Ontic Conception of\nScientific Explanation”, in Andreas Hütteman and Marie Kaiser\n(eds), <em>Explanation in the Special Sciences: The Cases of Biology\nand History</em>, Dordrecht: Springer,\npp. 27–52.</li>\n<li>Craver, C.F. and A. Alexandrova, 2008, “No Revolution\nNecessary: Neural Mechanisms for Economics”, <em>Economics and\nPhilosophy</em>, 24: 381–406.</li>\n<li>Craver, C.F. and W.M. Bechtel, 2007, “Top-down Causation\nwithout Top-down Causes”, <em>Biology and Philosophy</em>, 22:\n547–563.</li>\n<li>Craver, C.F. and L. Darden, 2013, <em>In Search of Mechanisms:\nDiscoveries Across the Life Sciences</em>, Chicago: University of Chicago\nPress.</li>\n<li>Cummins, R., 1975, “Functional Analysis”, <em>Journal\nof Philosophy</em>, 72: 741–764.</li>\n<li>–––, 1983, <em>The Nature of Psychological\nExplanation</em>, Cambridge, MA: Bradford/MIT Press.</li>\n<li>–––, 2000, “‘How Does It\nWork?’ Vs.  ‘What Are The Laws?’ Two Conceptions of\nPsychological Explanation”, in F. Keil and R. Wilson\n(eds), <em>Explanation and Cognition</em>, Cambridge, MA: MIT Press,\npp. 117–144.</li>\n<li>Darden, L., 1986, “Reasoning in Theory\nConstruction: Analogies, Interfield Connections, and Levels of\nOrganization”, in P. Weingartner and G. Dorn\n(eds), <em>Foundations of Biology</em>, Vienna:\nHolder-Pichler-Tempsky, pp. 99–107.</li>\n<li>–––, 1991, <em>Theory Change in Science:\nStrategies from Mendelian Genetics</em>, New York: Oxford University\nPress.</li>\n<li>–––, 2002, “Strategies for Discovering\nMechanisms: Schema Instantiation, Modular Subassembly,\nForward/Backward Chaining”, <em>Philosophy of Science</em>, 69:\nS354–S365.</li>\n<li>–––, 2005, “Relations Among Fields:\nMendelian, Cytological and Molecular Mechanisms”, <em>Studies in\nHistory and Philosophy of Biological and Biomedical Sciences</em>, 36:\n349–371.</li>\n<li>–––, 2006, <em>Reasoning in Biological\nDiscoveries: Mechanism, Interfield Relations, and Anomaly\nResolution</em>, New York: Cambridge University Press.</li>\n<li>Darden, L. and J. Cain, 1989, “Selection Type\nTheories”, <em>Philosophy of Science</em>,\n56:106–129.</li>\n<li>Darden, L. and N. Maull, 1977, “Interfield\nTheories”, <em>Philosophy of Science</em>, 44: 43–64.</li>\n<li>Datteri, E., 2009, “Simulation Experiments in Bionics: A\nRegulative Methodological Perspective”, <em>Biology and\nPhilosophy</em>, 24: 301–324.</li>\n<li>Datteri, E. and G. Tamburrini, 2007, “Biorobotic Experiments\nfor the Discovery of Biological Mechanisms”, <em>Philosophy of\nScience</em>, 74: 409–430.</li>\n<li>DesAutels, L., 2011, “Against Regular and Irregular\nCharacterizations of Mechanisms”, <em>Philosophy of\nScience</em>, 78: 914–925.</li>\n<li>Des Chene, D., 2001, <em>Spirits &amp; Clocks: Machine &amp;\nOrganism in Descartes</em>, Ithaca, NY: Cornell University Press.</li>\n<li>–––, 2005, “Mechanisms of Life in the\nSeventeenth Century: Borelli, Perrault, Régis”, <em>Studies in\nthe History and Philosophy of Biological and Biomedical Sciences</em>,\n36: 245–260.</li>\n<li>Dijksterhuis, E.J., 1961, <em>The Mechanization of the World\nPicture</em>, New York: Oxford University Press.</li>\n<li>Dowe, P., 1992, “Wesley Salmon’s Process Theory of Causality\nand the Conserved Quantity Theory”, <em>Philosophy of\nScience</em>, 59: 195–216.</li>\n<li>–––, 2011, “The Causal-Process-Model\nTheory of Mechanisms”, in Illari et al. 2011:\n865–879.</li>\n<li>Dray, W., 1957, <em>Laws and Explanation in History</em>, London:\nOxford University Press.</li>\n<li>Dupré, J., 1993, <em>The Disorder of Things: Metaphysical\nFoundations of the Disunity of Science</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>–––, 2013, “Living\nCauses”, <em>Proceedings of the Aristotelian Society</em>, 87:\n19–35.</li>\n<li>Elster, J., 1989, <em>Nuts and Bolts for the Social Sciences</em>,\nCambridge, UK: Cambridge University Press.</li>\n<li>Eronen, M.I., 2013, “No Levels, No Problems: Downward\nCausation in Neuroscience”, <em>Philosophy of Science</em>, 80:\n1042–1052.</li>\n<li>–––, 2015, “ Levels of Organization: A\nDeflationary Account”, <em>Biology and\nPhilosophy</em>, 30: 39–58.</li>\n<li>Fagan, M.B., 2012, “The Joint Account of Mechanistic\nExplanation”, <em>Philosophy of Science</em>, 79:\n448–472.</li>\n<li>–––, 2013, <em>Philosophy of Stem Cell Biology:\nKnowledge in Flesh and Blood</em>, London: Palgrave MacMillan.</li>\n<li>Fehr, C., 2004, “Feminism and Science: Mechanism without\nWeductionism”, <em>National Women’s Studies Association\nJournal</em>, 16: 136–156.</li>\n<li>Fodor, J., 1968, <em>Psychological Explanation</em>, New York:\nRandom House.</li>\n<li>Garson, J., 2011, “Selected Effects Functions and Causal\nRole Functions in the Brain: The Case for an Etiological Approach to\nNeuroscience”, <em>Biology &amp; Philosophy</em>, 26:\n547–565.</li>\n<li>–––, 2012, “Function, Selection, and\nConstruction in the Brain”, <em>Synthese</em>, 189:\n451–481.</li>\n<li>–––, 2013, “The Functional Sense of\nMechanism”, <em>Philosophy of Science</em>, 80:\n317–333.</li>\n<li>Giere, R.N., 2004, “How Models Are Used to Represent\nReality”, <em>Philosophy of Science</em>, 71:\n742–752.</li>\n<li>Gillett, C., 2002, “The Dimensions of Realization: A\nCritique of the Standard View”, <em>Analysis</em>, 62:\n316–323.</li>\n<li>–––, 2003, “The Metaphysics of\nRealization, Multiple Realizability, and the Special\nSciences”, <em>The Journal of Philosophy</em>, 100:\n591–603.</li>\n<li>–––, 2013, “Constitution, and Multiple\nConstitution, in the Sciences: Using the Neuron to Construct a\nStarting Framework”, <em>Minds and Machines</em>, 23:\n309–37.</li>\n<li>Glennan, S.S., 1996, “Mechanisms and The Nature of\nCausation”, <em>Erkenntnis</em>, 44: 49–71.</li>\n<li>–––, 1997, “Capacities, Universality and\nSingularity”, <em>Philosophy of Science</em>, 64:\n605–626.</li>\n<li>–––, 2002, “Rethinking Mechanistic\nExplanation”, <em>Philosophy of Science</em>, 69:\nS342–S353.</li>\n<li>–––, 2005, “Modeling\nMechanisms”, <em>Studies in the History and Philosophy of the\nBiological and Biomedical Sciences</em>, 36: 375–388.</li>\n<li>–––, 2009, “Productivity, Relevance and\nNatural Selection”, <em>Biology and Philosophy</em>, 24:\n325–339.</li>\n<li>–––, 2010a, “Mechanisms”, in Beebee\net al. 2010: 315–325.</li>\n<li>–––, 2010b, “Mechanisms, Causes, and the\nLayered Model of the World”, <em>Philosophy and Phenomenological\nResearch</em>, 81: 362–381.</li>\n<li>–––, forthcoming, <em>The New Mechanical\nPhilosophy</em>, Oxford: Oxford University Press.</li>\n<li>Godfrey-Smith, P., 2010, “Causal Pluralism”, in Beebee\net al. 2010: 326–337.\n [<a href=\"http://petergodfreysmith.com/CausalPluralismPGS-07-Final.pdf\" target=\"other\">Godfrey-Smith 2010 available online</a>]</li>\n<li>Gould, S.J., 1990, <em>Wonderful Life: Burgess Shale and the\nNature of History</em>, New York: W.W. Norton and Company.</li>\n<li>Griffiths, P.E., 1997, <em>What Emotions Really Are: The Problem\nof Psychological Categories</em>, Chicago: University of Chicago\nPress.</li>\n<li>Grush, R., 2003, “In Defense of Some ‘Cartesian’\nAssumptions Concerning the Brain and its Operation”, <em>Biology\nand Philosophy</em>, 18: 53–93.</li>\n<li>Hanson, N.R., 1958, <em>Patterns of Discovery</em>, Cambridge:\nCambridge University Press.</li>\n<li>Harbecke, J., 2010, “Mechanistic Constitution in\nNeurobiological Explanations”, <em>International Studies in the\nPhilosophy of Science</em>, 24: 267–285.</li>\n<li>–––, 2014 [onlinefirst], “Regularity\nConstitution and the Location of Mechanistic\nLevels”, <em>Foundations of Science</em>, 19. doi:\n10.1007/s10699–014–9371–1</li>\n<li>Harinen, T., forthcoming, “Mutual Manipulability and Causal\nBetweenness”, <em>Synthese</em>,\ndoi:10.1007/s11229-014-0564-5</li>\n<li>Haugeland, J., 1998, <em>Having Thought</em>, Cambridge, MA:\nHarvard University Press</li>\n<li>Havstad, J.C., 2011, “Discussion: Problems for Natural\nSelection as a Mechanism”, <em>Philosophy of Science</em>, 78:\n512–523.</li>\n<li>Hedström, P., 2005, <em>Dissecting the Social: On the Principles\nof Analytical Sociology</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Hedström, P. and R. Swedberg, 1998, <em>Social Mechanisms: An\nAnalytical Approach to Social Theory</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Hedström, P. and P. Ylikoski, 2010, “Causal Mechanisms in\nthe Social Sciences”, <em>Annual Review of Sociology</em>, 36:\n49–67.</li>\n<li>Heil, J. and A. Mele, 1993, <em>Mental Causation</em>, Oxford:\nClarendon Press.</li>\n<li>Hempel, C.G., 1965, <em>Aspects of Scientific Explanation and\nOther Essays in the Philosophy of Science</em>, New York: Free\nPress.</li>\n<li>Hempel, C.G. and P. Oppenheim, 1948, “Studies in the Logic\nof Explanation”, <em>Philosophy of Science</em>, 15:\n135–175.</li>\n<li>Hitchcock, C.R., 1995, “Discussion: Salmon on Explanatory\nRelevance”, <em>Philosophy of Science</em>, 62:\n304–20.</li>\n<li>Hoffmann-Kloss, V., 2014, “Interventionism and Higher-Level\nCausation”, <em>International Studies in the Philosophy of\nScience</em>, 28: 49–64.</li>\n<li>Howick, J.P. Glasziou, and J.K. Aronson, 2013, “Problems\nwith Using Mechanisms to Solve the Problem of\nExtrapolation”, <em>Theoretical Medicine and Bioethics</em>, 34:\n275–291.</li>\n<li>Huneman, P., 2010, “Topological Explanations and Robustness\nin Biological Sciences”, <em>Synthese</em>, 177:\n213–245.</li>\n<li>Illari, P.M., 2011, “Disambiguating the Russo-Williamson\nThesis”, <em>International Studies in the Philosophy of\nScience</em>, 25: 139–157.</li>\n<li>Illari, P.M., F. Russo, and J. Williamson (eds),\n2011, <em>Causality in the Sciences</em>, Oxford: Oxford University\nPress.</li>\n<li>Illari, P.M. and J. Williamson, 2010, “Function and\nOrganization: Comparing the Mechanisms of Protein Synthesis and\nNatural Selection”, <em>Studies in the History and Philosophy of\nthe Biological and Biomedical Sciences</em>, 41: 279–291.</li>\n<li>–––, 2012, “What is a Mechanism?: Thinking\nabout Mechanisms Across the Sciences”, <em>European Journal for\nPhilosophy of Science</em>, 2: 119–135.</li>\n<li>Kaiser, M. and C.F. Craver, 2013, “Mechanisms and Laws:\nClarifying the Debate”, in Hsiang-Ke Chao, Szu-Ting Chen and\nRoberta L. Millstein (eds), <em>Mechanism and Causality in Biology and\nEconomics</em>, Dordrecth: Springer, pp.\n125–145. [<a href=\"https://philarchive.org/rec/KAIMAL\" target=\"other\">Kaiser and Craver 2013 available online</a>]</li>\n<li>Kaplan, D.M., 2012, “How to Demarcate the Boundaries of\nCognition”, <em>Biology and Philosophy</em>, 27:\n545–570.</li>\n<li>Kaplan, D.M. and W. Bechtel, W, 2011, “Dynamical Models: An\nAlternative or Complement to Mechanistic\nExplanations”, <em>Topics</em>, <em>in Cognitive\nScience</em>, <em>3:</em>, 438–444.\n [<a href=\"http://mechanism.ucsd.edu/research/Kaplan-2011-Dynamical%20models_%20An.pdf\" target=\"other\">Kaplan and Bechtel 2011 available online</a>]</li>\n<li>Kaplan, D.M. and C.F. Craver, 2011, “The Explanatory Force\nof Dynamical Models”, <em>Philosophy of Science</em>, 78:\n601–627.</li>\n<li>Kauffman, S.A., 1971, “Articulation of Parts Explanation in\nBiology and the Rational Search for Them”, in Roger C. Buck and\nRobert S. Cohen (eds), <em>PSA 1970, Boston Studies in the Philosophy\nof Science</em>, volume 8. Dordrecht: Reidel, pp. 257–272.\nReprinted in Marjorie Grene and Everett Mendelsohn (eds),\n1976, <em>Topics in the Philosophy of Biology</em>, Dordrecht: Reidel,\npp.  245–263.</li>\n<li>Kendler, K., P. Zachar, and C.F. Craver, 2010, “What Kinds\nof Things are Psychiatric Disorders?”, <em>Psychological\nMedicine</em>, 41: 1143–1150.</li>\n<li>Khalidi, M.A., 2013, <em>Natural Categories and Human Kinds</em>,\nCambridge: Cambridge University Press.</li>\n<li>Kim, J., 1998, <em>Mind in a Physical World</em>, Cambridge, MA:\nThe MIT Press.</li>\n<li>Krickel, B., 2014, <em>The Metaphysics of Mechanism</em>, PhD\nDissertation. Humboldt-Universität zu Berlin.</li>\n<li>Kornblith, H., 1993, <em>Inductive Inference and Its Natural\nGround</em>, Cambridge, MA: MIT Press.</li>\n<li>Kuhlmann, M., 2011, “Mechanisms in Dynamically Complex\nSystems”, in Illari et al. 2011: 880–906.</li>\n<li>Kuhlmann, M. and S. Glennan, 2014, “On the Relation between\nQuantum Mechanical and Neo-Mechanistic Ontologies and Explanatory\nStrategies”, <em>European Journal for Philosophy of\nScience</em>, 4: 337–359.</li>\n<li>Kuhn, T.S., 1962, <em>The Structure of Scientific\nRevolutions</em>, Chicago: University of Chicago Press.</li>\n<li>Kuorikoski, J. and S. Pöyhönen, 2012, “Looping Kinds and\nSocial Mechanisms”, <em>Sociological Theory</em>, 30:\n187–205.</li>\n<li>Kuorikoski, J. and P.K. Ylikoski, 2013, <em>EPSA11 Perspectives\nand Foundational Problems in Philosophy of Science</em>, V. Karakostas\n&amp; D. Dieks (eds), Heidelberg: Springer, pp. 69–80.</li>\n<li>Lakatos, I., 1977, <em>The Methodology of Scientific Research\nProgrammes: Philosophical Papers</em>, vol. 1. Cambridge; Cambridge\nUniversity Press.</li>\n<li>Laudan, L., 1977, <em>Progress and Its Problems</em>, Berkeley:\nUniversity of California Press.</li>\n<li>Leuridan, B., 2010, “Can Mechanisms Really Replace Laws of\nNature?”, <em>Philosophy of Science</em>, 77:\n317–340.</li>\n<li>–––, 2011, “Three Problems for the Mutual\nManipulability Account of Constitutive Relevance in\nMechanisms”, <em>The British Journal for the Philosophy of\nScience</em>, 63: 399–427.</li>\n<li>Levy, A., 2013, “Three Kinds of ‘New\nMechanism’”, <em>Biology and Philosophy</em>, 28:\n99–114.</li>\n<li>–––, 2014, “What was Hodgkin and Huxley’s\nAchievement?”, <em>British Journal for the Philosophy of\nScience</em>, 65(3): 469–492. doi:10.1093/bjps/axs043</li>\n<li>Levy, A. and W. Bechtel, 2012, “Abstraction and the\nOrganization of Mechanisms”, <em>Philosophy of Science</em>, 80:\n241–261.</li>\n<li>Little, D., 1991, <em>Varieties of Social Explanation: An\nIntroduction to the Philosophy of Social Science</em>, Boulder, CO:\nWestview.</li>\n<li>–––, 1998, <em>Microfoundations, Method, and\nCausation: On the Philosophy of the Social Science</em>, New\nBrunswick, NJ: Transaction.</li>\n<li>Longino, H., 2013, <em>Studying Human Behavior: How Scientists\nInvestigate Aggression and Sexuality</em>, Chicago: University of\nChicago Press.</li>\n<li>–––, 2014, “Pluralism, Social Action, and\nthe Causal Space of Human Behavior”, <em>Metascience</em>, 23:\n443–459.</li>\n<li>Machamer, P.K., 1977, “Teleology and Selective\nProcesses”, in R.  Colodny (ed.), <em>Logic, Laws, and Life:\nSome Philosophical Complications</em>, Pittsburgh, PA: University of\nPittsburgh Press, pp.  129–142.</li>\n<li>Machamer, P., 2004, “Activities and Causation: The\nMetaphysics and Epistemology of Mechanisms”, <em>International\nStudies in the Philosophy of Science</em>, 18: 27–39.</li>\n<li>Machamer, P.K., L. Darden, and C.F. Craver, 2000 [MDC],\n“Thinking about Mechanisms”, <em>Philosophy of\nScience</em>, 67:1–25.</li>\n<li>Machery, E., 2009, <em>Doing Without Concepts</em>, New York:\nOxford University Press.</li>\n<li>Mackie, J.L., 1974, <em>The Cement of the Universe</em>, Oxford:\nClarendon Press.</li>\n<li>Maley, C.J. and G. Piccinini, forthcoming, “A Unified\nMechanistic Account of Teleological Functions for Psychology and\nNeuroscience”, in David Kaplan (ed.), <em>Integrating Mind\nand Brain Science: Mechanistic Perspectives and Beyond</em>, Oxford:\nOxford University Press.</li>\n<li>Matthews, L., forthcoming, “Embedded Mechanisms and\nPhylogenetics”, <em>Philosophy of Science</em>.</li>\n<li>Matthewson, J. and B. Calcott, 2011, “Mechanistic Models of\nPopulation-Level Phenomena”, <em>Biology and Philosophy</em>,\n26: 737–756.</li>\n<li>McCauley, R.N. and W. Bechtel, 2001, “Explanatory Pluralism\nand the Heuristic Identity Theory”, <em>Theory and\nPsychology</em>, 11: 736–760.</li>\n<li>Melnyk, A., 2003, <em>A Physicalist Manifesto: Thoroughly Modern\nMaterialism</em>, Cambridge: Cambridge University Press. </li>\n<li>Melnyk, A., 2010, “Comments on Sydney\nShoemaker’s <em>Physical Realization</em>”, <em>Philosophical\nStudies</em>, 148: 113–123.</li>\n<li>Menzies, P., 2012, “The Causal Structure of\nMechanisms”, <em>Studies in History and Philosophy of Biological\nand Biomedical Sciences</em>, 43: 796–805.</li>\n<li>Milkowski, M., 2013, <em>Explaining the Computational Mind</em>,\nCambridge, MA: MIT Press.</li>\n<li>Millstein, R.L., 2006, “Natural Selection as a\nPopulation-Level Causal Process”, <em>The British Journal for\nthe Philosophy of Science</em>, 57: 627 -653.</li>\n<li>Milo, R, S. Shen-Orr, S. Itzkovitz, N. Kashtan, D. Chklovskii, and\nU. Alon, 2002, “Network Motifs: Simple Building Blocks of\nComplex Networks”, <em>Science</em>, 298(5594):\n824–27.</li>\n<li>Mitchell, S.D., 1997, “Pragmatic Laws”, <em>Philosophy\nof Science</em>, 64: S468–S479.</li>\n<li>–––, 2000, “Dimensions of Scientific\nLaw”, <em>Philosophy of Science </em>67: 242–265.</li>\n<li>–––, 2003, <em>Biological Complexity and\nIntegrative Pluralism</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2005, “Modularity: More than a\nBuzzword?  Essay Review, <em>Biological Theory</em>, 1:\n98–101.</li>\n<li>–––, 2009, <em>Unsimple Truths: Science,\nComplexity, and Policy</em>, Chicago: University of Chicago\nPress.</li>\n<li>Moss, L., 2012, “Is the Philosophy of Mechanism Philosophy\nEnough?” <em>Studies in the History and Philosophy of Science:\nC</em>, 43: 164–72.</li>\n<li>Nagel, E., 1961, <em>The Structure of Science: Problems in the\nLogic of Scientific Explanation</em>, New York: Harcourt, Brace and\nWorld.</li>\n<li>Neander, K., 1991a, “The Teleological Notion of\n‘Function’”, <em>Australasian Journal of\nPhilosophy</em>, 69: 454–468.</li>\n<li>–––, 1991b, “Functions as Selected\nEffects: the Conceptual Analyst’s Defence”, <em>Philosophy of\nScience</em>, 58: 168–184.</li>\n<li>Nicholson, D.J., 2012, “The Concept of Mechanism in\nBiology”, <em>Studies in History and Philosophy of Biological\nand Biomedical Sciences</em>, 43: 152–163.</li>\n<li>Nickels, T., 1985, “Beyond Divorce: Current Status of the\nDiscovery Debate”, <em>Philosophy of Science</em>, 52:\n177–206.</li>\n<li>Oppenheim, P. and H. Putnam, 1958, “The Unity of Science as\na Working Hypothesis”, in H. Feigl, M. Scriven and G. Maxwell\n(eds), <em>Concepts, Theories and the Mind-Body Problem</em>,\n(Minnesota Studies in the Philosophy of Science, v. 2), Minneapolis:\nUniversity of Minnesota Press, pp. 3–36.</li>\n<li>Pearl, J., 2009, <em>Causality: Models, Reasoning, and\nInference</em>, second edition, New York: Cambridge University\nPress.</li>\n<li>Persson, Johannes, 2010, “Activity-Based Accounts of\nMechanism and the Threat of Polygenic\nEffects”, <em>Erkenntnis</em>, 72: 135–149.</li>\n<li>Piccinini, G., 2007, “Computing\nMechanisms”, <em>Philosophy of Science</em>, 74:\n501–526.</li>\n<li>Piccinini, G. and C.F. Craver, 2011, “Integrating Psychology\nand Neuroscience: Functional Analyses as Mechanism\nSketches”, <em>Synthese</em>, 183: 283–3</li>\n<li>Piccinini, G. and A. Scarantino, 2011, “Information\nProcessing, Computation, and Cognition”, <em>Journal of\nBiological Physics</em>, 37: 1–38.</li>\n<li>Polger, T.W., 2007, “Realization and the Metaphysics of\nMind”, <em>Australasian Journal of Philosophy</em>, 85:\n233–59.</li>\n<li>–––, 2010, “Mechanisms and Explanatory\nRealization Relations”, <em>Synthese</em>, 177:\n193–212.</li>\n<li>Popper, K., 1959, <em>The Logic of Scientific Discovery</em>,\nLondon: Hutchinson and Co.</li>\n<li>Povich, M., forthcoming, “Mechanisms and Model-based\nfMRI”, <em>Philosophy of Science</em>.</li>\n<li>Psillos, S., 2004, “A Glimpse of the Secret Connexion:\nHarmonizing Mechanism with Counterfactuals”, <em>Perspectives on\nScience</em>, 12: 288–319.</li>\n<li>Ramsey, J.L., 2008, “Mechanisms and Their Explanatory\nChallenges in Organic Chemistry”, <em>Philosophy of\nScience</em>, 75: 970–982.</li>\n<li>Reichenbach, H., 1938, <em>Experience and Prediction: An Analysis\nof the Foundations and the Structure of Knowledge</em>, Chicago: The\nUniversity of Chicago Press.</li>\n<li>Richardson, R.C. and A. Stephan, 2007,\n“Emergence”, <em>Biological Theory</em>, 2:\n91–96.</li>\n<li>Roe, S., 2014, <em>The Salmon-Roe Approach to Mechanistic\nExplanations</em>, Doctoral Dissertation, UC Davis.</li>\n<li>Romero, F., forthcoming, “Why there isn’t interlevel\ncausation in mechanisms”, <em>Synthese</em>.\ndoi:10.1007/s11229-015-0718-0</li>\n<li>Rosenberg, A., 1985, <em>The Structure of Biological\nScience</em>, Cambridge: Cambridge University Press.</li>\n<li>Russell, B., 1913, “On the Notion of\nCause”, <em>Proceedings of the Aristotelian Society</em>, 13:\n1–26.</li>\n<li>Russo, F., 2009, <em>Causality and Causal Modeling in the Social\nSciences: Measuring Variation</em>, Dordrecht: Springer.</li>\n<li>Russo, F. and J. Williamson, 2007, “Interpreting Causality\nin the Health Sciences”, <em>International Studies in the\nPhilosophy of Science</em>, 21: 157–170.</li>\n<li>Salmon, W.C., 1984, <em>Scientific Explanation and the Causal\nStructure of the World</em>, Princeton, NJ: Princeton University\nPress.</li>\n<li>–––, 1989, <em>Four Decades of Scientific\nExplanation</em>, Minneapolis, MN: University of Minnesota Press.</li>\n<li>–––, 1994, “Causality Without\nCounterfactuals”, <em>Philosophy of Science</em>, 61:\n297–312.</li>\n<li>–––, 1997, “Causality and Explanation: A\nReply to Two Critiques”, <em>Philosophy of Science</em>, 64:\n461–77.</li>\n<li>Schaffer, J., 2000, “Causation by\nDisconnection”, <em>Philosophy of Science</em>, 67:\n285–300.</li>\n<li>–––, 2004, “Causes Need Not be Physically\nConnected to Their Effects: The Case for Negative Causation”, in\nC.  Hitchcock (ed.), <em>Contemporary Debates in Philosophy of\nScience</em>, Malden, MA: Blackwell\nPublishing. Pp. 197–216.</li>\n<li>Schaffner, K., 1993, <em>Discovery and Explanation in Biology and\nMedicine</em>, Chicago, IL: University of Chicago Press.</li>\n<li>Schlosser, G. and G.P. Wagner, 2004, <em>Modularity in Development\nand Evolution</em>, Chicago, IL: University of Chicago Press.</li>\n<li>Scriven, M., 1959, “Explanation and Prediction in\nEvolutionary Theory”, <em>Science</em>, 130: 477–482.</li>\n<li>Shagrir, O., 2010, “Computation, San Diego\nStyle”, <em>Philosophy of Science</em>, 77: 862–874.</li>\n<li>Shapiro, L., 2000, “Multiple\nRealizations”, <em>Journal of Philosophy</em>, 97:\n635–654.</li>\n<li>Shoemaker, S., 2003, “Realization, Micro-Realization, and\nCoincidence”, <em>Philosophy and Phenomenological Research</em>,\n67: 1–23.</li>\n<li>–––, 2007, <em>Physical Realization</em>,\nOxford: Oxford University Press.</li>\n<li>Simon, H.A., 1996 [1962], <em>The Sciences of the Artificial</em>,\n3<sup>rd</sup> ed., Cambridge, MA: MIT Press.</li>\n<li>Skipper Jr., R.A. and R.L. Millstein, 2005, “Thinking about\nEvolutionary Mechanisms: Natural Selection”, in Craver and\nDarden 2005: 327–347.</li>\n<li>Spirtes, P., C. Glymour, and R. Scheines, 2000, <em>Causation,\nPrediction, and Search</em>, 2<sup>nd</sup> ed., Cambridge, MA: MIT\nPress.</li>\n<li>Steel, D.P., 2008, <em>Across the Boundaries: Extrapolation in\nBiology and Social Science</em>, New York: Oxford University\nPress.</li>\n<li>Strevens, M., 2008, <em>Depth: An Account of Scientific\nExplanation</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Sullivan, Jacqueline, 2009, “The Multiplicity of\nExperimental Protocols: A Challenge to Reductionist and\nNon-Reductionist Models of the Unity of\nNeuroscience”, <em>Synthese</em>, 167: 511–539.</li>\n<li>Tabery, J., 2004, “Synthesizing Activities and Interactions\nin the Concept of a Mechanism”, <em>Philosophy of Science</em>,\n71: 1–15.</li>\n<li>–––, 2009, “Difference Mechanisms:\nExplaining Variation with Mechanisms”, <em>Biology and\nPhilosophy</em>, 24: 645–664.</li>\n<li>–––, 2014a, <em>Beyond Versus: The Struggle to\nUnderstand the Interaction of Nature and Nurture</em>, Cambridge, MA:\nThe MIT Press.</li>\n<li>–––, 2014b, “Pluralism, Social Action, and\nthe Causal Space of Human Behavior”, <em>Metascience</em>, 23:\n443–459.</li>\n<li>Teller, P., 2010, “Mechanism, Reduction, and Emergence in\nTwo Stories of the Human Epistemic\nEnterprise”, <em>Erkenntnis</em>, 73: 413–425.</li>\n<li>Thagard, P., 1998, “Explaining Disease: Causes,\nCorrelations, and Mechanisms”, <em>Minds and Machines</em>, 8:\n61–78.</li>\n<li>–––, 2000, <em>How Scientists Explain\nDisease</em>, Princeton, NJ: Princeton University Press.</li>\n<li>–––, 2006, <em>Hot Thought: Mechanisms and\nApplications of Emotional Cognition</em>, Cambridge, MA: The MIT\nPress.</li>\n<li>Thalos, M., 2013, <em>Without Hierarchy</em>: <em>An Essay on the\nScale Freedom of the Universe</em>, Oxford: Oxford University\nPress.</li>\n<li>Theurer, K.L., 2013, “Compositional Explanatory Relations\nand Mechanistic Reduction”, <em>Minds and Machines</em>, 23:\n287–307.</li>\n<li>Weber, M., 2005, <em>Philosophy of Experimental Biology</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2008, “Causes without Mechanisms:\nExperimental Regularities, Physical Laws, and Neuroscientific\nExplanation”, <em>Philosophy of Science</em>, 75:\n995–1007.</li>\n<li>Weisberg, M., 2007, “Three Kinds of\nIdealization”, <em>The Journal of Philosophy</em>, 104:\n639–659.</li>\n<li>–––, 2013, <em>Simulation and Similarity: Using\nModels to Understand the World</em>, Oxford: Oxford University\nPress.</li>\n<li>Weiskopf, D., 2011, “Models and Mechanisms in Psychological\nExplanation”, <em>Synthese</em>, 183: 313–338.</li>\n<li>Westfall, R., 1971, <em>The Construction of Modern Science</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 2005, <em>Genes and the Agents of\nLife</em>, Cambridge: Cambridge University Press.</li>\n<li>Wimsatt, W.C., 1972a, “Complexity and Organization”,\nin Kenneth F.  Schaffner and Robert S. Cohen (eds), <em>PSA 1972,\nProceedings of the Philosophy of Science Association</em>, Dordrecht:\nReidel, pp.  67–86.</li>\n<li>–––, 1972b, “Teleology and the Logical\nStructure of Function Statements”, <em>Studies in the History\nand Philosophy of Science</em>, 3: 1–80.</li>\n<li>–––, 1976, “Reductionism, Levels of\nOrganization, and the Mind–Body Problem”, in G. Globus,\nI. Savodnik, and G. Maxwell (eds), <em>Consciousness and the\nBrain</em>, New York: Plenum Press, pp. 199–267.</li>\n<li>–––, 1997, “Aggregativity: Reductive\nHeuristics for Finding Emergence”, <em>Philosophy of\nScience</em>, 64: S372–S384.</li>\n<li>–––, 2007, <em>Re-Engineering Philosophy for\nLimited Beings: Piecewise Approximations to Reality</em>, Cambridge,\nMA: Harvard University Press.</li>\n<li>Woodward, J., 1989, “The Causal/Mechanical Model of\nExplanation”, in P. Kitcher and W.C. Salmon\n(eds), <em>Scientific Explanation</em>, (Minnesota Studies in the\nPhilosophy of Science 13), pp. 357–383.</li>\n<li>–––, 2001, “Law and Explanation in\nBiology: Invariance Is the Kind of Stability that\nMatters”, <em>Philosophy of Science</em>, 68: 1–20.</li>\n<li>–––, 2002, “What Is a Mechanism?: A\nCounterfactual Account”, <em>Philosophy of Science</em>, 69:\nS366–S377.</li>\n<li>–––, 2003, <em>Making Things Happen: A Theory of\nCausal Explanation</em>, New York: Oxford University Press.</li>\n<li>–––, 2011, “Mechanisms\nRevisited”, <em>Synthese</em>, 183: 409–427.</li>\n<li>–––, 2014, “A Functional Account of\nCausation; or, A Defense of the Legitimacy of Causal Thinking by\nReference to the Only Standard That Matters—Usefulness (as\nOpposed to Metaphysics or Agreement with Intuitive\nJudgment)”, <em>Philosophy of Science</em>, 81:\n691–713.</li>\n<li>Wright, L., 1973, “Functions”, <em>Philosophical\nReview</em>, 82: 139–168.</li>\n<li>Ylikoski, P., 2013, “Causal and Constitutive Explanation\nCompared”, <em>Erkenntnis</em>, 78: 277–97.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "Anscombe, Gertrude Elizabeth Margaret",
            "biology: experiment in",
            "causation: and manipulability",
            "causation: counterfactual theories of",
            "causation: the metaphysics of",
            "Descartes, René",
            "empiricism: logical",
            "Helmholtz, Hermann von",
            "individualism, methodological",
            "models in science",
            "molecular biology",
            "natural kinds",
            "Newton, Isaac",
            "physicalism",
            "physics: intertheory relations in",
            "reduction, scientific",
            "reduction, scientific: in biology",
            "Reichenbach, Hans",
            "science: unity of",
            "scientific discovery",
            "scientific explanation",
            "teleology: teleological notions in biology"
        ],
        "entry_link": [
            {
                "../anscombe/": "Anscombe, Gertrude Elizabeth Margaret"
            },
            {
                "../biology-experiment/": "biology: experiment in"
            },
            {
                "../causation-mani/": "causation: and manipulability"
            },
            {
                "../causation-counterfactual/": "causation: counterfactual theories of"
            },
            {
                "../causation-metaphysics/": "causation: the metaphysics of"
            },
            {
                "../descartes/": "Descartes, René"
            },
            {
                "../logical-empiricism/": "empiricism: logical"
            },
            {
                "../hermann-helmholtz/": "Helmholtz, Hermann von"
            },
            {
                "../methodological-individualism/": "individualism, methodological"
            },
            {
                "../models-science/": "models in science"
            },
            {
                "../molecular-biology/": "molecular biology"
            },
            {
                "../natural-kinds/": "natural kinds"
            },
            {
                "../newton/": "Newton, Isaac"
            },
            {
                "../physicalism/": "physicalism"
            },
            {
                "../physics-interrelate/": "physics: intertheory relations in"
            },
            {
                "../scientific-reduction/": "reduction, scientific"
            },
            {
                "../reduction-biology/": "reduction, scientific: in biology"
            },
            {
                "../reichenbach/": "Reichenbach, Hans"
            },
            {
                "../scientific-unity/": "science: unity of"
            },
            {
                "../scientific-discovery/": "scientific discovery"
            },
            {
                "../scientific-explanation/": "scientific explanation"
            },
            {
                "../teleology-biology/": "teleology: teleological notions in biology"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=science-mechanisms\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/science-mechanisms/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=science-mechanisms&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/science-mechanisms/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=science-mechanisms": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/science-mechanisms/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=science-mechanisms&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/science-mechanisms/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}