{
    "url": "social-minimum",
    "title": "Social Minimum",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Stuart White\n<stuart.white@jesus.ox.ac.uk>",
        "author_links": [
            {
                "http://www.politics.ox.ac.uk/academic-faculty/stuart-white.html": "Stuart White"
            },
            {
                "mailto:stuart%2ewhite%40jesus%2eox%2eac%2euk": "stuart.white@jesus.ox.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\n<a href=\"http://www.politics.ox.ac.uk/academic-faculty/stuart-white.html\" target=\"other\">Stuart White</a>\n&lt;<a href=\"mailto:stuart%2ewhite%40jesus%2eox%2eac%2euk\"><em>stuart<abbr title=\" dot \">.</abbr>white<abbr title=\" at \">@</abbr>jesus<abbr title=\" dot \">.</abbr>ox<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Nov 16, 2004",
        "substantive revision Thu Oct 7, 2021"
    ],
    "preamble": "\n\nConsider the following statements:\n\n\nPeople should not be allowed to starve.\n\nNo one should be denied access to a decent minimum of health-care.\n\nEvery citizen should be able to meet their basic needs.\n\n\nThese statements all express a widespread view that a political\ncommunity should seek to ensure that its members are all able to enjoy\nat least a minimally decent standard of living. They assert the\nimportance of what is often called the social minimum.\nHowever, the exact nature of the social minimum, the considerations\nthat support it, and even its basic justifiability, are all matters of\nphilosophical controversy. The aim here is to provide a guide through\nthe terrain of these controversies. This is done in three stages.\n\nFirstly, in section\n 1,\n we look more closely at the question, “What is a social\nminimum?” This section introduces a number of basic distinctions\nthat will serve to clarify the discussion. We define a “social\nminimum” as that bundle of resources which suffices in the\ncircumstances of a society to enable someone to lead a minimally\ndecent life. We define a “social minimum policy regime” as\na set of policies and institutions that serve to secure reasonable\naccess to this social minimum for all members of the society. As part\nof the task of clarification in this section, we review some of the\nmain philosophical issues posed by these definitions. In particular,\nhow are we to understand the notion of a “minimally decent\nlife”?\n\nIn section\n 2,\n we then consider the question, “Why a social minimum?”\nSpecifically, we outline a range of influential theories of social\njustice, and we consider in each case whether and how the theory in\nquestion might lend support to the enactment of a social minimum (that\nis, to the establishment of a social minimum policy regime). The\ntheories considered include utilitarianism, libertarianism,\nleft-libertarianism, egalitarian liberalism, and relational\negalitarianism.\n\nIn section\n 3,\n we then turn to the critics of enactment, posing the question\n“What can be said against enactment of a social minimum?”\nWe consider three sets of objections that appeal respectively to the\nvalues of individual freedom, fairness, and legitimacy. Although the\nobjections do not seem to refute the case for enacting a social\nminimum, some are helpful in thinking about the form the social\nminimum should take and about the political procedures surrounding its\nenactment. Section\n 4\n offers a brief conclusion to our discussion.\n",
    "toc": [
        {
            "#WhaSocMin": "1. What is a social minimum?"
        },
        {
            "#WelCapRes": "1.1 Welfare, capabilities, and resources"
        },
        {
            "#EcuCapConSocMin": "1.2 An ecumenical-capabilities conception of the social minimum?"
        },
        {
            "#SocMinHigRicSoc": "1.3 The social minimum and relative deprivation"
        },
        {
            "#ReaAccSocMin": "1.4 Reasonable access to the social minimum"
        },
        {
            "#WhySocMin": "2. Why a social minimum?"
        },
        {
            "#Uti": "2.1 Utilitarianism"
        },
        {
            "#Lib": "2.2 Libertarianism"
        },
        {
            "#LefLib": "2.3 Left-libertarianism"
        },
        {
            "#EgaLibPer": "2.4 Egalitarian liberalism"
        },
        {
            "#DemPer": "2.5 Relational egalitarianism"
        },
        {
            "#WhaSaiAgaEnaSocMin": "3. What can be said against the enactment of a social minimum?"
        },
        {
            "#FreObj": "3.1 The freedom objection"
        },
        {
            "#CruFreObj": "3.1.1 The crude freedom objection"
        },
        {
            "#SelOwnObj": "3.1.2 The self-ownership objection"
        },
        {
            "#FaiObj": "3.2 The fairness objection"
        },
        {
            "#VulEquCon": "3.2.1 Vulnerability, equity, and the relevance of background injustice"
        },
        {
            "#InhArgAgaCon": "3.2.2 The inheritance argument against conditionality"
        },
        {
            "#LegObj": "3.3 The legitimacy objection"
        },
        {
            "#Con": "4. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. What is a social minimum?\n\nOur first task, then, is to clarify what a social minimum is. When we\nspeak of a “social minimum” we mean to refer to the\nbundle of resources that a person needs in order to lead a minimally\ndecent life in their society. Now the members of a society might\ndecide to introduce a set of institutions and policies that\nsecures every member reasonable access to a social minimum in\nthis sense. We shall refer to this set of institutions and policies as\na “social minimum policy regime”. In the discussion that\nfollows we shall often speak of “enacting a social\nminimum”. Enactment is a somewhat legalistic word, but we intend\nthe term to be understood broadly here; “enacting a social\nminimum” means putting in place a social minimum policy regime.\n(Strictly speaking, we should perhaps speak of “enacting a\nsocial minimum policy regime”; but “enacting a social\nminimum” is a less clumsy phrase, and these comments should\nsuffice to make clear what we mean by it.) These concepts—of the\nsocial minimum and of a social minimum policy regime—are\nintended to be quite abstract, and they clearly raise further\nquestions. These include:\n\n(1)\nHow do we specify the level and kind of resources that people need\n“to lead a minimally decent life in their\nsociety”?\n(2)\nWhat do we mean by speaking of “reasonable access” to\na social minimum?\n\n\nWe shall now explore question\n (1)\n in sections 1.1–1.3, turning to question\n (2)\n in section\n 1.4.\n\nA further preliminary point will be helpful to note first, however.\nWhen we speak of a ‘society’ enacting a social minimum, this term can\nbe taken in different ways. We could be referring to a national\nsociety and thus to the enactment of a social minimum by a national\ngovernment. Or we could be talking about a society at a transnational\nor the global level, and to the enactment of a transnational or global\nsocial minimum. In the discussion that follows, we will assume a\nnational context as the baseline for discussion but many of the\narguments are also relevant to a transnational or global context.\n1.1 Welfare, capabilities, and resources\n\nIf we are concerned with enacting a social minimum what are we\nultimately trying to secure a minimum of?\n\nThis relates to a wider question on political philosophy about how we\nshould understand the ultimate focus of concern when assessing\neconomic distributions. Three possible answers to this question are:\nwelfare; capabilities; and resources.\n\nThe first position suggests that what we should be aiming for in\nenacting a social minimum is a minimum of welfare for all.\n“Welfare” here is understood in one of two ways. In\nclassical Utilitarian thinking, pioneered by Jeremy Bentham, welfare\nrefers to happiness which, in turn, is understood as the net balance\nof pleasure over pain that the individual experiences (Bentham 1789).\nOn this view, in assessing how well off someone is in life, we should\nlook at how happy they are, that is, at the net balance of pleasure\nover pain in their life. In more recent economic writings, welfare is\nidentified with desire-satisfaction; people have more or less welfare,\nand so have better or worse lives in a fundamental sense, depending on\nhow far they satisfy their desires.\n\nWelfarism has been subject to compelling criticism. While we do not\nhave the space here to review the critique of welfarism in depth, two\napparent problems may be noted. One is the problem of adaptive\npreferences. If people are born into deprived circumstances, then they\nmight adjust their expectations so that they are satisfied with their\nlot. Even though they are poor, they are happy, or don’t suffer\nfrom much frustration of desire, because they have adapted to life in\nwhich they have few resources at their command. But, as Amartya Sen\nasks of a person in this situation,\n\n\nCan we possibly believe that he is doing well just because he is happy\nand satisfied? Can the living standard of a person be high if the life\nthat he or she leads is full of deprivation? (Sen 1987a: 8)\n\n\nAnother problem, according to the critics, is that it is wrong to\nthink that all that has fundamental value in a human life is how much\nhappiness or desire-satisfaction this life contains. Being happy is a\nvaluable achievement, to be sure; but critics argue that it is hardly\nthe only thing that matters, in a fundamental way, for how well our\nlives are going (Sen 1987b, 1992, 1999, 2009: chapters\n11–14).\n\nThese two thoughts have inspired a second position on how we should\nconceive of the ultimate focus of distributional concern. Pioneered by\nthe economist, Amartya Sen, this is known as the capability\napproach. Sen’s analysis starts with a definition of a person’s\nwell-being as constituted by the “functionings” that they\nachieve:\n\n\n… beings and doings [which]…can vary from such\nelementary things as being adequately nourished, being in good health,\navoiding escapable morbidity and premature mortality, etc., to more\ncomplex achievements such as being happy, having self-respect, taking\npart in the life of the community, and so on. (Sen 1992: 39)\n\n\nNote that “functionings” here include welfarist concerns,\nsuch as “being happy”, but are not confined to such\nconcerns. A person’s capability is then defined by Sen as\ntheir power to achieve functionings: “a set of vectors of\nfunctionings, reflecting the person’s freedom to lead one type of life\nor another” (Sen 1992: 40). On Sen’s view, then, we should\nassess how well off a person is by looking at how far they possess a\nrange of important capabilities. These might include a capability for\nwelfare in either or both senses defined above, but will not be\nrestricted to this one capability. A social minimum is understood as\nthe bundle of resources necessary to endow people with a decent basic\nrange and level of capabilities in this sense.\n\nThe challenge for advocates of the capabilities approach, however, is\nthen to explain which functionings and capabilities matter in\na fundamental way. What capabilities ought to feature on our list when\nwe come to make assessments of how well off people are? The worry is\nthat any list we draw up will reflect one rather specific, perhaps\nsectarian understanding of what gives value and meaning to life, an\nunderstanding that other people might reasonably reject. In short, the\nworry is that the capabilities approach will either be too abstract to\nbe of any use, or else will be insufficiently neutral as\nbetween different reasonable ethical conceptions (conceptions, that\nis, of what gives value and meaning to life).\n\nThis concern, combined with the aforementioned concerns about\nwelfarism, motivates a third view about how to conceive what is of\nultimate concern in assessing economic distributions:\nresourcism. Resourcism reflects the concern to try to find an\nappropriately neutral way of assessing the respective advantage in\nlife enjoyed by different people. The idea is that although reasonable\npeople disagree about what gives life fundamental value and meaning,\nthey can nevertheless agree that it is important to hold certain\n“all-purpose means” for the pursuit of whatever plans of\nlife they have (see, for example, Rawls 1993: 187–190). In the\nsimplest imaginable version of resourcism, we might focus solely on\nthe level of income and/or wealth someone has in making a judgment\nabout how well off they are in a fundamental sense.\n\nThe problem with resourcism, however, is that it looks potentially\n“fetishistic” (Sen 1992): it asks us, in its simplest\nform, to focus on resource holdings—income/wealth—without\nconsidering what different people can do or be in virtue of these\nholdings. Individuals’ needs differ, e.g., due to differences in\nhealth conditions. Resourcism, at least in its most straightforward\nform, seems not to take account of this variability. Sen and others\nargue that it is a merit of the capability approach that it is\nsensitive to these differences – the approach advises that individuals\nmight require different amounts of resources to achieve a given level\nof capability. Ronald Dworkin’s theory of ‘equality of resources’ can\nbe seen as trying to address this problem by, in effect, regarding\ndifferences in needs as a kind of difference in ‘resources’ (for\nexample, a person who needs more income to achieve something due to a\nhealth condition is said to have fewer ‘resources’ by virtue of this\nhealth condition and therefore as a candidate for getting additional\nincome). However, and putting aside other objections to this theory,\none can ask whether it is ultimately just using the language of\n‘resources’ to try to talk about what Sen calls capabilities. It seems\nbetter to talk explicitly in terms of capabilities (see also\nOosterlaken 2020 for a discussion of the resourcist-capability\ntheorist debate). \n1.2 An ecumenical-capabilities conception of the social minimum?\n\nTo adopt the capability approach, however, we do need to address the\nobjection that it is potentially sectarian: to avoid the\nproblem of resource-“fetishism”, it asks us to consider\nwhether or not people have certain specific capabilities that are\nallegedly central to the good life, but there is then a danger of\nspecifying a list that some regard as too biased towards one ethical\ndoctrine or societal culture than another – an issue which is perhaps\neven more pressing if we are considering a social minimum at a\ntransnational or global level. One response to this apparent dilemma\nis to try to develop a self-consciously “ecumenical”\nversion of the approach. Aware of the danger of sectarianism, the\ncapabilities theorist seeks to identify capabilities that are\ngenuinely important to people across a wide range of reasonable\nethical doctrines and societal cultures; and they seek to find ways to\nmake the application of the approach sensitive to ethical and cultural\ndiversity. Such an approach offers one way of elaborating what we mean\nby a social minimum: the resources necessary for a person to lead a\n“minimally decent life in their society” can be understood\nas the resources necessary to hold a specified range of\necumenically significant capabilities, taking due account of\nthe society’s understanding of how these capabilities are typically\nrealized.\n\nAn approach of this kind has been developed by Martha Nussbaum (see\nespecially Nussbaum 1990, 1992, 1999, 2000, 2007). Nussbaum believes\nwe can identify a set of vitally important capabilities by posing the\nquestion:\n\n\nWhat activities characteristically performed by human beings are so\ncentral that they seem constitutive of a life that is truly human?\n(Nussbaum 1999: 39)\n\n\nMore concretely: What activities and related capabilities seem\nimportant to us when we consider whether someone who has undergone a\nmajor change in their capacities is still capable of a human life?\nWhat activities and related capabilities are important to people when\nthey differentiate between the human and the non-human (sub-human or\nsuperhuman) in, say, constructing stories? Proceeding inductively\nthrough reflection on these questions, Nussbaum claims to identify a\nrange of “central human functional capabilities”,\ncapabilities people must have if they are to be able to live a truly\nhuman life. These include (for more details, see Nussbaum 1999:\n40–41):\n\nthe capability for physical survival;\nthe capability for bodily health;\nthe capability for bodily integrity;\nthe capability for the exercise of imagination;\nthe capability for emotional response and exploration;\nthe capability for practical reason;\nthe capability for love and friendship;\nthe capability for connection with nature and other species;\nthe capability for play;\nthe capability for the exercise of control over environment,\nincluding political control.\n\n\nAdopting this approach, then, we would elaborate the concept of the\nsocial minimum by agreeing on a specific list of capabilities, such as\nthat above, as necessary to a “minimally decent life”, and\nby working out the kinds and levels of resources that people need to\nhave these capabilities to an adequate extent. The above list is\nclearly pitched at a high level of generality, and so it will make\nsense in applying this approach to consider how the various\ncapabilities are typically manifested in particular national\nsocieties. At the same time, such a list arguably provides a safeguard\nagainst excessive cultural relativism in thinking about the social\nminimum. If we can see no way in which a given capability on the list\nis adequately satisfied for a given group, then we must conclude that\nthe society is denying these people the opportunity to lead a\n“minimally decent life”. The idea of the social minimum\ncan in this way have some critical bite in evaluating existing social\narrangements.\n\nOne important complicating factor must be noted here. Consider item\n(2) on Nussbaum’s list, the capability for bodily health. What does it\nmean for people to have this capability to an adequate\nextent? There is, after all, probably no limit to how far a\nsociety could go in increasing this capability for its members by\ndevoting more and more of its resources to this end. At what point can\nwe say that it is doing enough? This is the problem of\nlimit-setting: the problem of determining in a fair way, and\nin a way that has legitimacy for those concerned, just what level of\ncoverage for a given capability is satisfactory, given the commitment\nto ensure that everyone has reasonable access to the resources\nnecessary for a minimally decent life. We shall not consider this\nproblem further here, but we will return to it in section\n 3.3\n below.\n\nWe should note that Nussbaum’s attempt to define a determinate list of\nkey or basic capabilities like the above is controversial. Critics\nobject that the approach is too rooted in a theorist’s specific vision\nof what is valuable in a human life, and that it may therefore be not\nsensitive enough to reasonable differences of view (for discussion,\nsee Robeyns 2005, 2006). Similar approaches to Nussbaum’s, which\nemploy the notion of “human needs”, have similarly\ncontroversial elements (see especially Doyal and Gough\n 1991).[1]\n But some disagreement of this kind seems unavoidable when we try to\nspecify a standard for judging whether people enjoy a “minimally\ndecent life”. Along with the problem of limit-setting, this\ncreates a potential problem of political legitimacy in the\nspecification and enactment of the social minimum to which we shall\nreturn below (see section\n 3.3).\n An important challenge in practice is to steer a course between an\noverly prescriptive listing of desirable capabilities by, say,\nacademic philosophers and an overly subjective listing that might be\nprone to problems such as adaptive preferences (for helpful\ndiscussions, see Robeyns 2005, 2006, Wolff and De-Shalit 2007, and\nClaassen 2020).\n1.3 The social minimum and relative deprivation\n\nWe have said that a social minimum is the bundle of resources\nnecessary for someone to live a minimally decent life in their\nsociety. Let’s say we are talking, for the moment, about a\nparticular national society.\n\nThe question arises of how far the resources we need to live a\nminimally decent life in a given national society are affected by the\ngeneral level of opulence of this society. Is the social minimum\nhigher in nations that are wealthier than others? This question is\nclosely related to a question that has long exercised students of\nincome and wealth distribution: Is poverty a matter of absolute income\nor of relative income (or both)? Many studies of poverty assume that\npoverty has a relative dimension. Estimates of the number of\nhouseholds in poverty then take as the ‘poverty line’ a level of\nincome that is some fraction (say 50%) of average household income,\nadjusted for differences in household size. Thus, if the incomes of\nthe poor at time t2 are the same as they were at\ntime t1, and in this time average income has\nincreased, then on this approach we would have to conclude that the\npeople who were poor at t1 have become even poorer\nat t2 even though their absolute income level\nhas not changed. This clearly makes sense only if one thinks that\npoverty is a matter of how well off people are in income terms\nrelative to others in their society. However, this way of thinking\nabout poverty invites the objection that the researcher is confusing\npoverty with inequality. Critics argue that if one group has become\nworse off in income terms relative to others then inequality has\nincreased, but this does not mean that poverty has, especially if the\ngroup in question remains just as well off as before in terms of its\nabsolute level of income.\n\nThe ecumenical-capabilities approach outlined above offers reasonable\nsupport for the claim that the social minimum does vary with a\nnation’s level of income/wealth, and in turn, for the claim that\npoverty can increase when a group falls further behind the rest of a\nnational society in terms of its income. Following Sen, capabilities\ntheorists argue that even if the capabilities that define a minimally\ndecent life remain basically the same across nations of varying income\nlevels, the resources needed to have a given capability will be\ngreater, in the case of some capabilities, the richer one’s nation is.\nIn other words, the resource cost of a given capability will tend to\nincrease with national income. According to Sen:\n\n\nTo lead a life without shame, to be able to visit and entertain one’s\nfriends, to keep track of what is going on and what others are talking\nabout…requires a more expensive bundle of goods and services in\na society that is generally richer, and in which most people have,\nsay, means of transport, affluent clothing, radios or television sets,\netc.. (Sen 1987a: 18)\n\n\nFor this reason at least, the level and content of the social minimum\nin a given national society will to some extent be relative to the\naverage income of this society; and, accordingly, it will make sense\nto define the poverty line in relation to (as some fraction of)\naverage income.\n\nOne idea that plays a particularly important role in discussions of\nthis issue is that of self-respect. People have an interest\nin (capability for) self-respect (on which, see Rawls 1971 [1999]:\n386–391). But, so the argument runs, our self-respect depends on\nour being able to maintain a style of life that is sufficiently\nsimilar to that of our fellow citizens. We will perhaps look inferior,\nand start to feel inferior, if we do not wear the sort of clothes that\nour fellow citizens wear, participate in the social activities that\nthey do, and so on. If self-respect depends on relative consumption in\nthis way, and “a minimally decent life” is one that\nincludes our being able to enjoy self-respect, then the social minimum\nis properly seen as being relative to average income and the levels of\nconsumption that can be sustained on this level of income.\n\nOn the other hand, there is almost certainly a lower limit to this\nrelativity. If the average income level in a nation is very low\nindeed, then even people with high income in relation to this average\nmight well lack the resources needed to lead a minimally decent life.\nFor example, if people in a given nation cannot eat well enough to\navoid malnutrition on an income that is twice the national average,\nthen even some people who are relatively rich in this nation will\nstill be living below the level of the social minimum. For this\nreason, it also seems essential to hold to an idea of an absolute\nglobal social minimum alongside that of nationally-specific\nminima.\n1.4 Reasonable access to the social minimum\n\nLet us imagine that we have settled on an acceptable definition of\nwhat is necessary for a person to enjoy a “minimally decent life\nin their society”. We now wish to enact a social minimum to\nensure that all members of a society have reasonable access to the\nresources necessary to lead such a life. A key term here is\n“reasonable access”. What is meant by this term? Why not\nsay simply that society should ensure that its members have the\nresources they need to lead a minimally decent life? Why take this\napparently roundabout way of expressing things by saying that they\nought to have reasonable access to such resources, rather than the\nresources themselves?\n\nWe use this formulation so as to keep open at this stage some\nimportant questions about the terms on which people may/ought to\nreceive these resources. It is tempting to think of enacting a social\nminimum as introducing institutions and policies that will\ngive people the resources necessary to lead a minimally\ndecent life in their society. However, this is possibly too\nrestrictive an understanding of what it can mean to enact a social\nminimum. To see why, consider the following case. There is an\nindividual, called Arya, who is unemployed and hence unable to buy\nfood and shelter. As things stand, Arya lacks the resources necessary\nto lead a minimally decent life; they are living, as we might say,\nbelow the social minimum. However, the government responds to their\nplight by offering them a job with a wage equal to the level of the\nsocial minimum. Now, provided that Arya is able to work, and the work\nin question is not demeaning or punitive, or the terms of employment\notherwise unfair, we can reasonably say that if the government does\nthis for all those in Arya’s position then, for them, it has enacted a\nsocial minimum. But clearly it has not given Arya and others\nlike them a social minimum. Rather, it has intervened in a way that\nprovides Arya and these others with reasonable access to the\nsocial minimum.\n\nNow it might well be that in some cases—perhaps, in the majority\nof cases—the most appropriate way to ensure reasonable access to\nthe social minimum is precisely to give people the resources in\nquestion. If, say, Arya is simply unable to do a job, then offering\nthem the job will not provide reasonable access to the social minimum.\nIt will be appropriate just to give them the social minimum. And, as\nwe shall see below (see section\n 3.2),\n some philosophers argue that the ethically most defensible policy is\nto give everybody a social minimum, rather than conditioning the\nsocial minimum on work or some other kind of behavior. However, this\nis just one view of the form that the social minimum policy regime\nshould take, and it would be inappropriate to build this specific view\ninto our very definition of what a social minimum policy regime is,\nand thus, of what it means to enact a social minimum. The substantive\nethical debate about the desirability of\n“conditionality”—making resources conditional on\nbehaviour, such as work-related activity—is one we shall return\nto below (see section\n 3.2).\n2. Why a social minimum?\n\nHopefully, we have now clarified what a social minimum is and what it\nmeans to enact a social minimum. These clarificatory concerns met, we\ncan now consider why we might want to enact a social minimum.\nAs noted in the introduction, we shall review a number of influential\ntheories of social justice asking, with respect to each theory, what\nsupport (if any) it can give to the case for enactment. The five\ntheories to be reviewed are: utilitarianism; libertarianism;\nleft-libertarianism; egalitarian liberalism; and relational\negalitarianism.\n2.1 Utilitarianism\n\nUtilitarianism is the view that actions and institutions should be\njudged on how far they produce welfare (or “utility”) for\npeople (or for all beings capable of experiencing welfare). In its\nclassical form, utilitarianism demands that social institutions be\narranged so as to maximize the sum total of happiness, understood as\npleasure net of pain, while in its more contemporary version it calls\nfor these institutions to maximize the sum total of\ndesire-satisfaction. In calculating this total, utilitarianism insists\non a principle of equality: each person’s utility counts equally with\nthat of every other person (Mill 1861).\n\nUtilitarianism has sometimes been a major inspiration for reformers\nconcerned to establish a welfare state so as to enact a social\nminimum. It is not hard to see why. Imagine a society that leaves the\ndistribution of income to the market so that incomes are distributed\nvery unequally. Let’s say we think that there is some level of income,\nY, which people typically need to lead a minimally decent life. The\ninequality in this society is such that some people have income levels\nbelow Y. However, it is possible for the government to introduce\ntax-transfer schemes that will guarantee that the poorest members of a\nsociety have reasonable access to Y. Now if the marginal utility of\nincome diminishes as people get more income, then it seems quite\nlikely that the shift from the free-market economic system to the\nsystem with the social minimum policy regime will produce a net gain\nin society’s overall utility. Quite simply, the utility that the poor\ngain as a result of the shift to the social minimum system is likely\nto be greater than the utility lost by the rich in moving to this\nsystem (given the assumption of the diminishing marginal utility\nof income). Clearly, given that the utilitarian focus is on\nwelfare as the good in human life, a utilitarian conception of the\nsocial minimum will be welfarist in kind: the social minimum will be\nseen as the bundle of resources necessary to ensure a life with a\nminimally acceptable level of happiness or desire-satisfaction.\nHowever, as a matter of policy, a utilitarian might readily support\nenactment of a social minimum inspired by some version of the\ncapabilities approach because, for the reason given above, they judge\nthe social minimum policy package in question as promoting an increase\nin aggregate welfare. (For a discussion of the utilitarian rationale\nfor enactment of a social minimum, see Brandt 1981.)\n\nFrom a utilitarian point of view, however, the foregoing argument for\nthe enactment of some form of social minimum is not conclusive. There\nare arguments that can be made from within the utilitarian framework\nthat tell against enactment of a social minimum (whether conceived in\ncapabilities or welfarist terms).\n\nThe main utilitarian argument against enactment of a social minimum\nappeals to the idea of incentives. The argument begins with\nthe claim that if we make a shift from a free-market economic system\nto a system with a social minimum policy regime, we will reduce\nincentives to work, save and be entrepreneurial. The rich will\nallegedly work less hard, save less and be less entrepreneurial,\nbecause they are being more heavily taxed to pay for the social\nminimum policy regime. The poor will allegedly work less hard, save\nless, and so on, because they have a welfare safety-net to fall back\non. As a result of this dampening of incentives, it is possible that\ntotal income will be lower, or the growth of total income will be\nslower, under the economic system with the social minimum policy\nregime than under the free-market system. These economic impacts might\nresult in lower aggregate welfare in the system with the social\nminimum policy regime than in the free-market system. If so, then as\nutilitarians, we must not enact a social minimum.\n\nOf course, it is possible that these concerns about incentives and\ndamage to the economy are much exaggerated and that a utilitarian\nperspective consequently will support enacting a social minimum.\nNevertheless, it is important to see how a specifically utilitarian\nperspective does leave the justification of enacting a social minimum\ndependent on these empirical claims about how this affects the economy\n- and thereby aggregate welfare - overall.\n2.2 Libertarianism\n\nIf utilitarianism’s criterion of justice is aggregate welfare,\nlibertarianism’s is individual rights. Individuals are\n“inviolable”: they have rights, and these rights may not\nbe violated even for the sake of increasing aggregate\nwelfare—indeed, even for the sake of preventing the wider\nviolation of rights (Nozick 1974: 28–35).\n\nIf we ask exactly what rights the individual has, on the libertarian\nview, then a large part of the answer is that the individual is\nendowed with the rights of self-ownership. Someone enjoys\nself-ownership, in the relevant sense, when they have full private\nownership of their own body and abilities (Cohen 1995: 68). A\ncorollary of the idea of self-ownership is the idea that individuals\ndo not have any non-contractual obligations to use their labor for the\nbenefit of others. In exercising their rights of self-ownership,\npeople may contract with others to offer them specified services and\nbenefits. But if the state forces people to provide such services and\nbenefits without the consent of the individuals concerned, it violates\ntheir rights of self-ownership. It would, so the argument runs, treat\nthe individuals concerned as if they are state-owned assets,\nto be pressed into service for the good of others at the state’s\ndiscretion. Now, in order to enact a social minimum, it seems likely\nthat the state will have to impose a non-contractual obligation on\nhigh earning citizens to transfer resources to the less fortunate who\nare otherwise at risk of falling below the level of the social\nminimum. But this apparently violates the self-ownership rights of the\nhigh earners (because it apparently forces them to share the ‘fruits\nof their labours’ with others without their consent). For this reason,\nlibertarianism looks like an unpromising basis on which to defend\nenactment of a social minimum.\n\nHowever, things are not quite so clear-cut. Return to the question of\nexactly what rights individuals have on the libertarian view. The\nconcept of self-ownership provides a large part of, but cannot provide\nthe whole, answer to this question. For the world does not only\ncontain people, but a wide variety of external resources, such as\nland. What kind of rights do we have in relation to these other\nresources? If we believe that individuals can come to have private\nproperty rights in these resources, no less inviolable than those they\nhave in relation to their own bodies and abilities, we need to know\nhow the individuals concerned acquire these property rights. Part of\nthe answer the libertarian gives is that if we acquire a resource\nthrough voluntary exchange with someone who already owns it\n(legitimately), then we come to own the resource (an aspect of what\nNozick calls “justice in transfer”; Nozick 1974:\n150–153). But if we trace the history of such trades back there\nwill be a point at which the resource in question did not have an\nowner; someone, somehow, made an unowned resource—a piece of\nland, say—their private property. But how can this happen? In\nRobert Nozick’s terms, the libertarian must given an account of\n“justice in acquisition” (Nozick 1974: 151,\n174–182).\n\nThe nature of justice in acquisition is a source of controversy\namongst libertarians. Assuming that the external resources we have in\nmind are initially unowned, one might argue that specific individuals\ncan appropriate resources as private property by “mixing”\ntheir self-owned powers with the resources concerned. This thought,\nwhich we find in the work of John Locke (Locke 1689: Book 2, chapter\n5), is that individuals integrate something they already own (their\nlabor) with something initially unowned (say, a piece of land), and,\nthereby, come to own what they initially did not own. However, some\nlibertarians, such as Nozick, follow Locke in arguing that\nappropriation through the exercise of self-owned powers is just\nonly if it does not harm those who, following appropriation,\nlose access to the resource. This condition (often referred to as the\nLockean Proviso) can be elaborated in various ways. In\nNozick’s influential statement of the libertarian view, the condition\nis apparently elaborated as follows (see Nozick 1974: 174–182;\nand, for helpful interpretation, Wolff 1991: 107–115): an act of\nappropriation of a previously unowned resource is just only if no\nperson is thereby made worse off than they would be in a world where\nall external resources remain unowned. In a world in which all\nexternal resources remain unowned, each person would be able to reach\na certain level of welfare by using the resources that lie about\nunowned. For any given individual, i, let us denote this\nwelfare level as Wi. A given act of appropriation\nis just, then, provided that, post-appropriation, each individual\nremains able to reach at least Wi. (Note that\nWi may differ between particular individuals\nbecause of their unequal abilities to produce things in the\n“state of nature” in which all external resources remain\nunowned.)\n\nThe implication of this account of justice in acquisition is that any\nregime of private property rights is just only provided that every\nperson living under said regime is able to achieve\nWi—the welfare level that they would have\nbeen able to achieve in a world in which all external resources remain\nunowned. Many libertarians, including Nozick, express optimism that a\nprivate property regime will be able to provide people with the\nopportunity to achieve this welfare level. But it is conceivable that\nin the normal operation of the economy, a private property regime\nmight at some times, for some people, fail to provide access to this\nlevel of welfare. If so, then justice—as the libertarian\nunderstands it—demands that the state act to correct the\ndistribution of welfare generated by the spontaneous play of market\nforces. Specifically, the state must compensate anyone who, due to the\nexisting allocation of private property rights in external resources,\ncannot otherwise achieve Wi. According to at least\none influential libertarian philosopher, Robert Nozick, our basic\nrights thus include not only our rights of self-ownership, but this\nright to welfare as well.\n\nIn order to satisfy this right, a libertarian system might have to run\nsome assistance programs for the very poor. To some extent, then, even\na libertarian state might have some government programs that resemble\nthose we associate with a social minimum policy regime. It is in this\nvery limited sense that even a libertarian theory of justice might\nlend support to the enactment of at least a partial social minimum\n(see also the discussion in Brock 1998a and Sterba\n 1998).[2]\n\nThat said, it is highly unlikely that this argument can be used to\nsupport the enactment of anything like a full social minimum. This is\nso for at least two reasons. Firstly, for most, if not all, people\nWi is likely to be very low, precisely because it\nis the welfare level we could get in a world with no property rights\nregime to stabilize expectations about the use of resources and,\ntherefore, a world without the huge productivity gains that come from\nstabilizing such expectations. Hence, the level of assistance entailed\nby the libertarian right to welfare is likely in general to fall well\nshort of what is needed to ensure people the capabilities for a\n“minimally decent life” in their society. Secondly, it is\nimportant to recall that Wi will almost certainly\nvary across people according to the nature of their personal,\nself-owned capacities. Those who are born with a good endowment of\nproductively applicable talents will obviously fare better in the\nstate of nature, in which all external resources remain unowned, than,\nfor example, those who are born with capacities that make it harder\nfor them to engage in production. In the case of some of the latter,\nWi may be close to zero—zero denoting the\noutcome of starving to death in the state of nature. Thus, if these\npeople happen to be unfortunate enough to be starving to death in a\nreal-world private property rights regime, they may well have no claim\nto assistance under the libertarian right to welfare: this right does\nnot demand that they be prevented from starving if this is what would\nhappen to them in the baseline world in which all external resources\nremain unowned.\n\nWe may conclude that libertarianism gives only contingent and very\nweak support for the enactment of a social minimum. Indeed, except in\nsome very rare instances, libertarianism implies that enactment of a\nfull social minimum is unjust.\n2.3 Left-libertarianism\n\nHowever, not all libertarians—those who endorse the principle of\nself-ownership—agree with the theory of justice in acquisition\nthat we find in Nozick’s work. According to some philosophers,\nsometimes referred to as left-libertarians, the principle of\nself-ownership should be combined with a more egalitarian principle of\ndivision of initially unowned external resources. Thus, if we imagine\na group of people who find themselves transported to a previously\nuninhabited planet, the left-libertarian holds that each of these\npeople has the rights of self-ownership plus a right to an\nequal, per capita share of this planet’s initially unowned external\nresources (see, for example, Steiner 1994, and Vallentyne and Steiner\n2000a,b).\n\nThere is a lively debate amongst left-libertarians as to which goods\ncount as external resources for purposes of equal division, but\nvirtually all would agree that these resources must include society’s\ninheritance of land. Some would argue that the pool of resources for\nequal division should also include the capital stock that one\ngeneration inherits from past generations. More recently, it has been\nsuggested that “job assets” and the value of the genetic\ninformation that we carry as individuals should also be included in\nthe pool for equal division (see, respectively, Van Parijs 1992, 1995,\nand Steiner,\n 1994).[3]\n\nLeft-libertarianism seems to hold more promise of justifying something\nlike a social minimum than conventional libertarianism. To be sure, a\nleft-libertarian regime will not permit the redistribution of\nlabor incomes by the state as this violates the core\nlibertarian commitment to respect the rights of self-ownership. But\nthe parallel commitment to equal division of initially unowned\nexternal resources will ensure that every person starts life with at\nleast some external resources, or a monetary equivalent. To see how\nthis may transform the prospects of those on low incomes, it may help\nto go back for a moment to the people whom we just imagined being\ntransported to a new planet. On arrival, the people find that on the\nplanet there is a single external resource, uncultivated land, all\nunits of which are of homogeneous quality. Their own population is\ndivided into two groups, a majority who are able to work the land and\na minority that are much less able to do this (here we follow Cohen\n1995: chapter 4). Now we saw in our discussion of libertarianism above\nhow, under a Nozick-style regime, members of the minority might well\nhave no justice-based claim to assistance against the majority, and,\nin consequence, could starve. Under a left-libertarian regime,\nhowever, the government is obliged to give each person an equal share\nof the planet’s land. Those unable to work well will be able to sell\nor lease their share to members of the majority group, and can thereby\nderive an income from this source. They will thus be at least somewhat\nbetter off than under the Nozick-style regime.\n\nIn practice, left-libertarians do not propose that we actually divide\nland and other resources up in this literal way. Instead, following\nthe argument of agrarian radicals such as Thomas Spence and Tom Paine,\nthey argue that the individual should receive a monetary grant\nreflecting their fair share of society’s external resources, such as\nland (on Spence and Paine, see Vallentyne and Steiner 2000b). The\nlevel of this grant will depend on a host of factors, but it is\npossible that it will be equivalent—or even higher—in\nvalue to the bundle of resources needed to enjoy a minimally decent\nlife in the society in question. Thus, depending on the circumstances\nof the society in question, left-libertarian principles of justice\nmight support a policy that is more or less equivalent to the\nenactment of a full social minimum.\n\nNevertheless, it is clearly important to emphasize the word\n“might” in the previous sentence. There is no reason why\nthe basic grant we have imagined must be of equivalent value\nto a full social minimum. Indeed, if the relevant external assets are\nabundant, so that their market price is low, then the level of the\ngrant might not come anywhere near this level. In such a situation,\nrespect for self-ownership will rule out taking labor incomes to top\nup the grant. It is possible, therefore, that some people will be left\nwith a level of resources below that necessary to lead a minimally\ndecent life (see Cohen 1995: chapter 4, especially pp. 102–105).\nThus, while left-libertarianism offers stronger support for enactment\nof a social minimum than conventional libertarianism does, this\nsupport is still highly contingent, and in many situations\nleft-libertarianism will probably rule out as unjust the course of\naction needed to enact a full social minimum (taxation of labor\nincomes). Moreover, even if the resource grant is high enough to\nprovide a full social minimum, some left-libertarians would argue that\nindividuals should receive their basic grant as a capital lump-sum at\nthe start of their adult life rather than as a periodic income payment\nand/or as a freely available bundle of\n services.[4]\n This raises the possibility that some people might “blow”\ntheir grants early in their adult lives and might then lack ready\naccess to a social minimum.\n2.4 Egalitarian liberalism\n\nWithin contemporary political philosophy, egalitarian liberalism seeks\nto present an alternative both to utilitarianism and to the two\nversions of libertarianism discussed above. Egalitarian liberals agree\nwith libertarians that utilitarianism fails to take seriously the\ninviolability of the person. Unlike libertarians, however, egalitarian\nliberals do not think that respect for the inviolability of the person\ncommits us to the principle of self-ownership (for more on this issue,\nsee section\n 3.1.2\n below). Consequently, they feel much less compunction in advocating\ntax-transfer schemes, which the libertarian finds objectionable, so as\nto secure a full social minimum. Indeed, they argue that justice\ndemands that we do introduce such schemes. Let us take a look at one\ninfluential egalitarian liberal theory of justice, and its\nimplications for the justifiability of enacting a social minimum (see\nalso Dworkin 1985, 2000).\n\nJohn Rawls’s A Theory of Justice, first published in 1971\n(with a revised edition in 1999) poses an intriguing question: What\nprinciples would you accept to govern your society if you did not know\nyour actual or likely position in this society? In practice, we are\nall aware of the religion we have (if we have one), we have some sense\nof the natural abilities we have been born with, and the advantages or\ndisadvantages we have gained from our social background. But, for a\nmoment, envisage that we did not know such things and possessed only\nvery general information about the kind of society we are going to\nlive in. Behind this “veil of ignorance”, not knowing our\nreligion, natural ability, or social background, what principles would\nwe choose to govern the institutions that affect the distribution of\n“primary goods” like income and wealth?\n\nFamously, Rawls argues that in an “original position” of\nthis kind, parties will choose to arrange social and economic\ninequalities so that\n\n\nthey are both (a) to the greatest benefit of the least advantaged and\n(b) attached to offices and positions open to all under conditions of\nfair equality of opportunity. (Rawls 1971 [1999]: 72)\n\n\nSimplifying somewhat, part (a) of this formulation tells us that\ninequality in goods like income and wealth is just if it is arranged\nso that the group that is worst-off under this inequality is better\noff than it would be under any other level of inequality. Rawls calls\nthis the difference\n principle.[5]\n\nMany critics have found Rawls’s argument for the difference principle\nunconvincing (see, for example, Kymlicka 2001: 60–70). They ask\nwhy people behind the veil of ignorance would not choose to gamble,\nselecting an alternative principle that is less favorable to the\ndisadvantaged in society than the difference principle but which would\ngive higher rewards than this principle should one turn out in fact to\nbelong to one of the more favored social classes. However, even if\nthis is valid as a criticism of Rawls’s argument for the difference\nprinciple, it can be argued that Rawls’s thought experiment\nnevertheless provides strong intuitive support for those who believe\nthat justice requires at least the enactment of a social minimum. For\nwhile most people placed behind the veil of ignorance might not be so\nrisk averse as to choose the difference principle to govern their\nsociety, it is reasonable to suppose that most would at least be\nconcerned to insure themselves against the danger of desperate poverty\nand would hence desire principles of justice that ensure everyone\nreasonable access to a social minimum. Interestingly, efforts by\npsychologists to model decision-making in situations akin to the\noriginal position show that people in practice tend to choose a\nprinciple that calls for the maximization of average well-being but\nsubject to the constraint that nobody falls below a specified floor\n(see Frolich and Oppenheimer 1992).\n\nFurther support for the enactment of a social minimum from within\nRawls’s theory comes from his discussion of the importance of the\n“strains of commitment” in determining what is just (Rawls\n1971 [1999]: 153–160). The parties behind the veil of ignorance\nmust recognize that they are selecting principles of justice that,\nhaving been chosen, they must stick with in social life for good.\nThus, before they make their decision, they must honestly ask whether,\nshould they turn out to be the most disadvantaged under a chosen set\nof principles, they could really bear the strains of commitment\nentailed by living under these principles. Again, it is debatable as\nto whether this consideration points unequivocally to the difference\nprinciple as the appropriate principle to govern the distribution of\nincome and wealth. However, it seems plausible that this consideration\nwould rule out any principles that do not ensure everyone reasonable\naccess to the resources needed for a minimally decent life. How could\none honestly commit to the strains of living in a society that did not\nguarantee you this? This consideration reinforces the argument that\nthe parties behind the veil of ignorance would choose principles of\njustice that assure everyone of reasonable access to a social\nminimum.\n\nMoreover, it might be argued that even if one rejects the veil of\nignorance thought experiment as a way of exploring what justice\nconsists in, the strains of commitment idea still has force as a\nconsideration favoring the enactment of a social minimum. Even if one\nhas full knowledge of one’s own and others’ position in society,\none can put oneself in the place of others and consider the kind of\nstrains of commitment that they are likely to be suffering under the\npresent system. If one does this, can one really give assent to a\nsocial system that, by failing to guarantee reasonable access to a\nsocial minimum for some people, puts some of your fellow citizens\nunder what must be intolerable strains of commitment? Since one would\nsurely find such strains intolerable oneself, how can one reasonably\nexpect others to put up with them? (For more discussion of the strains\nof commitment, see Barry 1995: 61–67, and, with specific\nconnection to case for the social minimum, see Waldron 1993a).\n\nRawls’s theory as it stands is, however, by no means the last word on\njustification of the social minimum. For example, Rawls’s own\ndiscussion abstracts away from disability but a theory of the social\nminimum obviously needs to include the claims of disabled people. How\nfar can a ‘contractualist’ approach like that set out by Rawls be\nextended to include disabled people? (See Nussbaum 2006, chapter 2,\nfor discussion of this question, and for wider discussions of justice\nand disability see Barnes 2016, Begon 2021.) Does a Rawlsian,\negalitarian liberal approach need supplementing (or replacing with?)\nan alternative that can perhaps better capture the claims of disabled\npeople?\n2.5 Relational egalitarianism\n\nPosing this question is one way to draw out the importance of another\nperspective on social justice, that of relational\negalitarianism. This refers to perspectives in social philosophy\nthat give priority to the promotion of equality in power and\nstatus relations (understood, let us assume, as a demand of\njustice; see Fraser 1998, Anderson 1999). Relational egalitarians will\nbe concerned, for example, that disabled people have the capabilities\nthey need to avoid domination by others and a ‘second class’ social\nstatus. Relational egalitarian perspectives are not necessarily\nsharply distinct from egalitarian liberal perspectives, but they do\ndraw out and give more emphasis to considerations that are ignored or\nunderexplored in at least some formulations of egalitarian liberalism\n(Young 1989).\n\nOne focus of concern for the relational egalitarian is with ensuring\nthe effectiveness of citizens’ political liberties. In a\npolitical democracy, all citizens have rights to vote, to campaign,\nand to stand for political office in competitive elections (Dahl\n1998). It seems likely that poverty can significantly diminish the\neffectiveness with which individuals can exercise these rights (for\nrelevant empirical research on this issue, see Krishna 2006, Mood and\nJonsson 2015). Someone who is wrapped up in the struggle for basic\nmaterial well-being might simply lack the time and energy needed to\nfocus on political issues. In addition, they will be less able to\nafford the monetary costs associated with political participation,\ne.g., paying party membership fees, making campaign contributions, and\nso on. This is bad for political democracy. It means that certain\nviewpoints and interests are not heard, so that policy becomes\nunfairly skewed against these viewpoints and interests. Hence it can\nbe argued that it is straightforwardly good for a political democracy\nto enact a social minimum. By relieving the pressure of poverty, an\nenacted social minimum will enable all citizens to participate\neffectively in the democratic process, thereby ensuring that this\nprocess is indeed genuinely\n democratic.[6]\n\nPower is not only exercised within and through the formal political\nprocess, however, but within and through a wide range of other social\nrelationships. For example, employers can exercise power over their\nemployees. Historically, husbands have often wielded great power over\nwives. These power relations can emerge in part because of\ninequalities in the economic positions between the parties (for very\nhelpful discussions, to which we are here indebted, see Goodin 1986,\n1988; Okin 1989: chapter 7). One party—the employer, the\nhusband—might be able to do perfectly well financially without\nthe other party. By contrast, the second party—the individual\nworker, the wife—might be financially reliant on the first\nparty. Were the first party to exit from the relationship, this party\nwould suffer little harm, but the second party would suffer a severe\nfall in living standards. Precisely because of this inequality in the\ncosts of exiting from the relationship, the first party has the power\nto shape the relationship on their terms. The worker or wife is not in\na position to argue with the employer’s or husband’s commands because\nthe employer’s or husband’s threat to leave the relationship unless\nobedience is forthcoming will be at once credible (since they stand to\nlose little financially from exiting it) and compelling (because the\nworker or wife stand to lose so much financially if the employer or\nhusband do go ahead and exit). Power inequalities of this kind are\nobjectionable for a number of reasons. It can be argued that they\ndirectly reduce the freedom of the less powerful parties by subjecting\nthem to ‘domination’ (Pettit 1997). They also put the less powerful\nparties at risk of exploitation and abuse by the more powerful parties\n(Goodin 1986, 1988; Okin 1989).\n\nOne important argument for the enactment of a social minimum is that\nthis can help to reduce the exit costs from such relationships for the\nparties that are otherwise vulnerable, and so reduce these\nobjectionable inequalities of power. For example, if a worker knows\nthat the community will guarantee them a decent income even if they\nquit their current job, then this makes it much easier for them to\nstand up to the boss and refuse unreasonable demands. If a wife knows\nthat the community will assist her financially if she leaves her\nhusband, then the prospect of leaving him because he abuses her\nbecomes more feasible for her. This can change the dynamic of these\nrelationships, to some extent rebalancing the power relationships\nbetween the parties.\n\nFor these reasons, then, relational egalitarian perspectives on social\njustice offer strong support for the enactment of a social minimum\n(see also Pateman 2005). Indeed, it is hard to see how any society\ncould retain relations characterised by equality of status and the\nabsence of domination for long in the absence of people having\nreasonable access to a social minimum.\n3. What can be said against the enactment of a social minimum?\n\nHaving reviewed arguments for the enactment of a social minimum, let\nus now consider some possible objections to enactment. We shall here\nconsider three objections appealing respectively to the values of\nfreedom, fairness, and legitimacy.\n3.1 The freedom objection\n\nOne objection to enactment of a social minimum that arises in\npolitical discussion is that such enactment conflicts with respect for\nindividual freedom. To enact a social minimum, a government must\ntypically coercively tax and transfer resources and, in the view of\nsome thinkers, this coercion is inherently objectionable. We shall\nconsider two versions of this objection here. The first appeals to\nfreedom understood as the absence of intentional coercion. The second\nappeals to the libertarian principle of self-ownership that we\ndiscussed above (see sections\n 2.2\n and\n 2.3).\n3.1.1 The crude freedom objection\n\nAccording to writers in the so-called “classical liberal”\ntradition such as Friedrich Hayek, freedom consists in the absence of\nintentional coercion (see Hayek 1960). If the government requires one\ncitizen, Bodhi, to pay taxes that will in turn be used to assist a\nless fortunate citizen, Arya, as part of the process of enacting a\nsocial minimum, then the government intentionally coerces Bodhi and,\ntherefore, reduces Bodhi’s freedom. This is regrettable and, if we\nregard freedom as the most important political value, we should\nperhaps refrain from using governmental power to assist people like\nArya in this way. The welfare of people like Arya might\nsuffer; but freedom will be preserved.\n\nThe foregoing paragraph summarizes a common objection to government\ntaxation for welfare programs, or what one might call the crude\nfreedom objection to the enactment of a social minimum (see also Plant\n1998: 67). How might a supporter of enacting a social minimum reply to\nthis objection?\n\nOne type of reply is to argue that while taxation to establish a\nsocial minimum policy regime might reduce one kind of liberty, it will\npromote another, more valuable kind of liberty. According to this\nview, true or real liberty does not consist in the mere absence of\nintentional coercion, but in the positive capability or power to act\nin pursuit of significant goals, such as self-development. Poverty, so\nthe argument runs, diminishes this true, “positive\nliberty”; by abolishing or alleviating poverty, welfare\nprograms, financed through coercive taxation, increase the true,\npositive liberty of society’s more unfortunate members. The loss to\nthe taxpayer in terms of “negative liberty” (liberty\nunderstood as the mere absence of intentional coercion) is, so the\nreply continues, morally outweighed by this gain in terms of\n“positive liberty”. This type of reply to the freedom\nobjection has a long history (Freeden\n 1978).[7]\n\nDespite its historical pedigree, however, this type of reply can be\nfaulted both as inconclusive and as too concessionary to the classical\nliberal critic of taxation for welfare programs. It is inconclusive\nbecause, faced with the reply, the classical liberal critic can always\nsimply counter-assert that “negative liberty” (again,\nliberty understood as the absence of intentional coercion) is actually\nthe kind of liberty we should be primarily concerned with. We are then\napparently at an impasse with each side in the debate asserting the\ngreater value of one kind of liberty over another, or else merely\ntrading competing definitions of what freedom “really” is.\nThe reply is also too concessionary in that it too readily surrenders\nthe value of “negative liberty” to the classical liberal\ncritic of taxation for welfare spending. The argument for taxation and\nwelfare spending can in fact be made using the very notion of freedom\nto which the classical liberal critic appeals. This argument is likely\nto offer a more telling reply to the critic than one that appeals to\nsome other (alleged) kind of liberty (on this point, see Cohen 1988:\nchapter 14: 291–292).\n\nThe essential point here is that poverty usually entails a limitation\nof the kind of liberty that the classical liberal professes to be\nconcerned with. One major reason why poverty typically\n“bites” into one’s quality of life is that it reduces the\nrange of actions that one can perform without being subject to\nintentional coercion by others (see Waldron 1993b, Cohen 1997, Swift\n2001: 70–71). Imagine, for example, that you are poor and that\nyou wish to get a train from City A to City B. Because you are poor,\nyou cannot buy a ticket for the journey. Because you get on the train\nwithout a ticket, the train guard makes you leave the train at Town C,\nlong before you reach your intended destination of City B. Your\nability to act as you wish has here been limited by the intentional\ncoercion of others. Or imagine that you are homeless and unable to\nafford to rent a place to sleep. You locate a field in which to sleep.\nBut the field belongs to someone else, and when the landowner\ndiscovers your presence by means of their closed-circuit television\ncamera system they call the police who wake you up and drag you off\nthe land. Once again, your ability to act as you wish is quashed by\nthe intentional coercion of others. By the same token, if the\ngovernment were to provide you with the money to buy a train ticket or\nto rent a space to sleep in, then you would become able to perform\nthese actions without being subject to the intentional coercion that\nyou are subject to when you lack this money.\n\nThus, taxation for welfare spending cannot be said simply to reduce\n“liberty”, understood as the absence of intentional\ncoercion, in the name of some other value, such as welfare. Rather, it\nwill tend to produce a different distribution of this\nkind of liberty. It will expose some to intentional coercion that\nthey would otherwise not be exposed to; but, if it genuinely reduces\npoverty, it should also reduce the extent to which some people are\nexposed to intentional coercion. For this reason, it simply will not\ndo to object that the enactment of a social minimum is undesirable\nbecause it will reduce individual liberty. For the decision\nnot to enact a social minimum will also reduce the liberty of\nsome individuals. If the freedom objection is to have any force, it\nmust take a subtler form than that we have thus far considered.\n3.1.2 The self-ownership objection\n\nA second, subtler version of the freedom objection comes from\nlibertarian philosophers committed to the principle of self-ownership.\nAs we have seen, libertarians do not object to transfers of income and\nwealth which aim to make sure that each person receives their fair\nshare of external resources (or fair compensation for others’\nappropriation of their share). However, these transfers might not be\nenough to ensure that all enjoy a full social minimum. This insight\nhas led some political philosophers to conclude that commitment to the\nenactment of a social minimum is ultimately incompatible with the\nlibertarian commitment to respect the self-ownership of persons: we\nmust be prepared to override certain claims of self-ownership, and\nforcibly transfer a portion of labor incomes from higher earners to\nthe less well off, if a social minimum is to be enacted. But is this\njustifiable? After all, on the face of it, self-ownership seems like\nan attractive value, capturing some basic commitments we have to the\nfreedom and inviolability of the individual (see Cohen 1995: chapter\n3).\n\nImagine someone, Charlie, who has very high earnings potential. In\norder to ensure that everyone has reasonable access to a social\nminimum, the state announces that it will tax 50% of whatever income\nCharlie earns, and use the funds to raise the incomes of those with\nlow earnings power. The libertarian, including the left-libertarian,\nwill object that this violates Charlie’s rights of self-ownership.\nShould Charlie choose to work, half of their earnings will be funneled\nto others, and thus, if they choose to work, they have no choice under\nthis tax regime but to assist others. In this way, the tax system may\nbe said to “harness” Charlie’s talents and energies for\nthe good of others. This effort-harnessing, alleges the\nlibertarian, is inherently wrong; it puts Charlie in a position that\nis akin to that of a slave, forced to work for the good of others\n(Nozick 1974: 169).\n\nIn reply, some philosophers stress the kinds of freedoms that someone\nin Charlie’s position retains under the imagined tax regime, freedoms\nwhich make it absurd (and offensive), in the view of these\nphilosophers, to compare their position to that of a slave. The tax\nregime we have described leaves the decision about how much to work to\nCharlie. It leaves the decision about what kind of job to do to\nCharlie. In short, taxation of labor incomes does not necessarily deny\nthe worker who is taxed basic control over whether and how they deploy\ntheir talents (see especially Christman 1991); and so, according to\nthis argument, there is nothing really objectionable about using such\ntaxation to enact a social minimum. Yes, self-ownership has been\nlimited; but, so the argument goes, nothing essential to personal\nliberty or self-determination has thereby been diminished.\n3.2 The fairness objection\n\nA different objection focuses on the alleged risk of unfairness in\nenacting a social minimum. Specifically, the unfairness\nobjection is that public provision of a social minimum might lead\nsome people to make inadequate effort to help themselves and that this\nis unfair to those whose efforts ultimately make the necessary\nresources available. Note that the behavior allegedly caused by social\nminimum programs might also or alternatively be considered a bad thing\nbecause of its effect on the benefit recipient, rather than (just)\nbecause of any unfairness to others. This thought motivates what one\nmight call the dependency objection to enactment of a social\nminimum, in view of the alleged passivity or “dependency”\ninduced by reliance on welfare benefits (see, for example, Tocqueville\n1835, Murray 1984; see also Humboldt 1852). However, a good deal of\nwhat can be said in reply to the fairness objection also applies to\nthis dependency objection, and so we will not lose much by focusing\njust on the fairness objection for present purposes.\n\nLet’s start by stating the fairness objection more precisely. One\nversion of the objection appeals to a principle of\nreciprocity. This says that if one willingly shares in the\nbenefits created through the efforts of others in society, notably\nthrough their work, then one has an obligation to reciprocate by\nmaking a contribution to producing these benefits oneself, as long as\none has the capacity and opportunity to do so (White 2003). The idea\nis not necessarily that you should produce in strict proportion to\nwhat you consume, but that one should try to ‘do one’s bit’,\nunderstanding society as a cooperative scheme to which all should\ncontribute if they are able. Given this principle, the fairness\nobjection to enacting a social minimum is that this could somehow lead\nto some people enjoying goods and services without satisfying their\nreciprocity-based obligation to work. To prevent this, the argument\ngoes, we should not enact a social minimum.\n\nAs just stated, however, it seems like there is another obvious\nresponse to the fairness objection. Rather than not enacting a social\nminimum, we could instead enact a social minimum but include in the\nrules of the social minimum policy regime a work- or\ncontribution-related condition. For example, if one claims cash\nbenefits to assist with low income then eligibility for the benefits\ncan be made conditional on work-related activity. We might call this,\nthe principle of work-conditionality (for apparent\nendorsements of this principle, subject to widely varying degrees of\nqualification, see Anderson 1999: 321; Gutmann and Thompson 1996:\nchapter 8; Mead 1986, 1992, 1997; Rawls 2001: 179; White 2000, 2003,\n2005). To be clear, by work-conditionality we mean conditions that\nlink elements of the social minimum policy regime to some kind of\nemployment-related activity, such as active job search or retraining,\nnot necessarily to work itself. (‘Work’ is, moreover, a broader\nconcept than ‘employment’, a point we shall return to below.)\n\nThis response to the fairness objection itself raises an important\nethical question. Should the social minimum be enacted in a way that\nreflects the principle of work-conditionality? Space permits us here\nto consider just two of the more important sets of arguments against\nthe principle of work-conditionality (for further, empirically\ninformed discussions, see Watts and Fitzpatrick 2018, Dwyer 2019,\nEleveld, Kampen and Arts 2020).\n3.2.1 Vulnerability, equity, and the relevance of background injustice\n\nA first important set of arguments against work-conditionality appeals\nto problems of vulnerability and equity in the application of\nwork conditions in a social minimum policy regime, and, under\nnon-ideal conditions, to the importance of considering the\nsignificance of background injustice.\n\nOne possible problem concerns vulnerability in the labor\nmarket. As we saw above in section\n 2.5,\n one rationale for having a welfare state to enact a social minimum is\nthat, by providing access to urgently needed goods independently of\nthe sale of labor-power, it can reduce the pressure on disadvantaged\nworkers to scramble into poor quality (exploitative or abusive) jobs.\nThere is a danger that work-conditionality rules undermine this\ndesirable effect. If, for example, the government tells an unemployed\nperson that they must look for a job and take any job offered by an\nemployer on whatever terms this employer states, or else lose all\nwelfare benefits, then this person will be under severe pressure to\nfind and take a job. They will clearly have much less power to refuse\njobs that involve exploitative or abusive treatment than if they\nreceived welfare benefits unconditionally. According to some critics,\nthis is the whole point of work-conditionality: to weaken the\nbargaining position of labor in the interests of business and the\nproperty-owning classes (see Piven and Cloward 1993). A distinct but\nrelated objection is that work-conditionality might place a burden of\n“shameful revelation” on those claiming transfers: to\nqualify for transfers, they have to show that they have looked for a\njob, but failed to get one, which is potentially damaging to\nself-respect (Wolff 1998).\n\nA second problem concerns the vulnerability of dependents. If\nsomeone is denied the full social minimum because they choose not to\nsatisfy a work-conditionality rule then this will not only hurt them,\nbut is likely also to hurt others who depend on them for an income\nsuch as their children (if they have children). Since these children\nare in no way responsible for their parents’ decision to ignore\na work-conditionality rule, this hurt is surely unfair (and may\nundermine other social goals, such as achieving equality of\neducational opportunity for children from different social\nbackgrounds).\n\nA third problem is that work-conditionality rules may in practice lead\nto inequity between welfare recipients and other citizens.\nFor example, what about those who inherit large amounts of wealth?\nWhat can be done to get these wealthier citizens to meet their\nreciprocity-based obligation to work? If nothing is done, then there\nis apparently a failure to enforce a given social obligation equitably:\ncitizens who need welfare benefits will be forced to meet their\nobligation to work, but citizens who receive large inheritances will\nnot be forced to meet this obligation. There is also a danger of\ninequity in the treatment of different kinds of work. If we\nthink here of ‘work’ only as employment or market-facing work we will\nignore the non-market care work that many do for children and other\nfamily members and friends. Arguably, at least some of this work also\ncounts in satisfaction of the reciprocity-based obligation to ‘do\none’s bit’ in society, and so there is an injustice if those doing\nthis work – in most real-world societies, these people will be\ndisproportionately women – are required also to do as much employment,\nmarket-facing work as others.\n\nAll of these points connect in turn to a basic, underlying question of\nhow just are the society’s background economic structures. If\nsociety’s economic structures are just in other respects, then it may\nseem reasonable to expect each citizen who is able to work to do so.\nIn a context of otherwise just social arrangements, then this seems\npart and parcel of fair social cooperation. But what if the background\nstructures of the economy are actually unjust in other respects? For\nexample, perhaps society’s educational institutions fail to secure\nsufficient equality of opportunity, unfairly leaving some citizens\nwith limited job opportunities. Or perhaps the reward structure is\nunequal to an unfair extent, leaving some workers with unfairly low\npay for the work they do. In this context, it can be argued that the\nunderlying obligation to work, as an expression of fairness in social\ncooperation, does not in fact hold for those citizens who suffer\nunfair disadvantage. This point is made by Tommie Shelby in his\ndiscussion of the obligations of the Black ghetto poor in the USA:\n\n…job opportunities for low-skilled workers are severely\nlimited and the jobs that are available are often menial, dead-end\nservice positions that pay wages too low to provide adequate economic\nsecurity for a family. Now it might be replied that if the ghetto poor\ndo not want to take these low-wage jobs they should develop their\nskills….As is widely known, however, the quality of education\navailable to ghetto residents is generally so substandard that most\ncannot get a basic education there, let alone proper preparation for\ncollege….This lack of equal educational opportunity, which in\nturn creates an unfair employment opportunity scheme, vitiates any\nobligation to work… (Shelby 2007, 146–147; see also\nShelby 2016, chapter 6.)\n\nThe putative, reciprocity-based obligation to work does not exist for\nthose who are unjustly disadvantaged in the way described; hence,\nthere can be no question of justice requiring enforcement of this\nsupposed obligation. In addition, any attempt to enforce the\nnon-existent obligation is likely to make the unjust disadvantage\nworse, for example, in the contemporary US context, by reinforcing\ndegrading historical conceptions of Black people as people whom it is\nappropriate to force to work (see Shelby 2016, 197–200).\n\nTaking these points on board, even some of those who have endorsed the\nprinciple of reciprocity and the basic idea of work-conditionality\nhave also cautioned against applying work-conditionality in a way that\nis insensitive to the background distribution of wealth and\nopportunity in society (see, for example, Gutmann and Thompson 1996:\nchapter 8; White 2003, 2005; see also Daniels 1981: 160–162).\nThey argue that the principle of work-conditionality should be\nsuspended, or at least moderated, if the background distribution of\nwealth and opportunity is not sufficiently just. Indeed, given the\nrisks involved, and the complexity of creating the conditions for the\nfair enforcement of work obligations, there is a case for avoiding\nwork-conditionality altogether even if one accepts the underlying\nprinciple of reciprocity (White 2017).\n3.2.2 The inheritance argument against conditionality\n\nA further objection to making the social minimum work-conditional\ncomes from philosophers influenced by the left-libertarian tradition\nreviewed above (see section\n 2.3).\n As we saw above, left-libertarians believe that, ideally speaking,\nindividuals have a right to an equal share of resources that are an\ninheritance from nature or from past generations. Thus, imagine that\nten people arrive on an island and find that it contains a factory\ncontaining ten machines. The machines can be used to produce the food,\nclothing and shelter that the islanders need to survive. The\nleft-libertarian will argue that in principle each islander should\nreceive one machine—that is, an equal share of the machines in\nthe inherited factory. Now suppose that one of the ten islanders, call\nthem Drew, decides not to work their machine but to rent it out to\nother islanders who are prepared to work it for a price. Drew does no\nwork, but simply lives off the rent that other islanders pay them for\nthe use of the machine that they have been allocated. Now, depending\non how high the rent is, Drew could conceivably be receiving an income\nclose to their society’s social minimum, and they will be doing no\nwork in return for this income. But the left-libertarian will argue\nthat this is not unjust because Drew is only here making use of their\nrightful share of society’s inherited goods. As we noted above, it is\ndifficult in practice to divide inherited resources up literally in\nthis way. But we can perhaps identify these resources, assess their\nmarket value, and give everyone a grant of income or wealth equivalent\nto a per capita share of the market value of these resources. Some\npeople might choose to live off this grant without doing any work (or\ndoing as little work as possible). But, according to the\nleft-libertarian, this is no different to Drew deciding to do no work\nand to live off the rent they can get from charging others to work on\ntheir machine: it is a legitimate use of one’s rightful share of\nsociety’s inherited resources. Subject to important nuances and\nvariations, a number of philosophers have employed this type of\nargument in recent years to defend the payment to each citizen of a\nuniversal basic income or a universal capital grant\n(see Steiner 1994; Van Parijs 1992, 1995; Ackerman and Alstott 1999;\nDworkin 2000; Birnbaum 2012; Widerquist 2013; Bidadanure 2019).\n\nThere are, however, some difficulties with the argument, understood as\nan attempt to defend the enactment of a full social minimum without\nany work condition.\n\nThe first difficulty, already flagged up in our discussion of\nleft-libertarianism in section\n 2.3,\n is that the grant which represents one’s rightful share of society’s\ninherited wealth might fall somewhat short of the value of the full\nsocial\n minimum.[8]\n\nHowever, a second issue is whether people do in fact have a right to\nan equal share of their society’s inherited resources regardless\nof work effort. The basic issue is whether it is fair to use an\ninheritance, as Chris does in the example above, to extract a share of\nwhat other citizens produce while choosing not to make a productive\ncontribution of one’s own in return.\n\nIt might be said that people like Drew do contribute to production –\nthey do so by supplying their share of inherited resources for others\nto use for productive purposes. But a distinction can be made between\nthe contribution that the inherited resources putatively credited to\nDrew make to production, and Drew’s own contribution. If Drew were not\non the island we imagined, the other islanders could still use the\ninherited resources that we have supposed are otherwise credited to\nDrew. They could work just as hard, and produce just as much, as they\ndo when Drew is there and is credited with an equal share of these\nresources. But they would be better off because they would not have to\ngive a portion of this product to Drew in return for using some of the\nisland’s inherited wealth. This, so the argument runs, shows that Drew\nthemselves is not in any real sense contributing economically to the\nsociety. So is it fair for Drew to get an income without working\n(assuming that they could if they so choose)? Some argue that Drew has\nas much right to a share of the machines as anyone else and it is up\nto them what benefit they get from this (Van Parijs 1995, drawing on\nDworkin 1985, 2000; Birnbaum 2012). Others argue that cases like this\nshow that a just distribution of assets should be more sensitive to\nindividuals’ own interest in making direct use of the assets (see van\nDonselaar 2009; see also Van der Veen 1998, White 2007).\n\nTo conclude, the concern for economic fairness (as reciprocity) does\nnot offer grounds for rejecting enactment of a social minimum. At\nmost, it supports making elements of a social minimum policy package\nwork-conditional. However, there are strong arguments for limiting\nwork-conditionality. One set of arguments appeals to the ways in which\nwork-conditionality can enhance the vulnerability of citizens to\nexploitation or other forms of injustice and/or generate or exacerbate\nother inequities between citizens. This set of arguments has\nadditional force in societies where background economic structures are\notherwise significantly unjust (Shelby 2007, 2016, White 2017).\nAnother kind of argument appeals to the idea that citizens have a\nright to a share of inherited assets that is not conditional with\nrespect to willingness to work, though the scope and precise nature of\nthis right remains disputed.\n3.3 The legitimacy objection\n\nA third objection to the enactment of a social minimum appeals to the\nvalue of legitimacy. A law or policy lacks legitimacy when the law or\npolicy is arbitrary in the eyes of those bound by the law or\npolicy—that is, they are not given a sufficiently good and\naccessible reason to justify their subjection to this law or policy.\nThe absence of legitimacy signals a kind of alienation from the law or\npolicy, so that people are unable to identify with it as an expression\nof what they value and believe. Critics might argue that the\nestablishment of a social minimum policy regime creates distinctive\nproblems of legitimacy for a society; and they might further argue\nthat these problems make it undesirable, all things considered, to\nenact a social minimum. How might enactment of a social minimum\ngenerate problems of legitimacy? How can these problems be tackled? Do\nthe problems really discredit the case for enactment?\n\nOne potential legitimacy problem is the capability-list\nproblem that we noted above in section\n 1.2.\n To say what kind and level of resources are necessary for people to\nbe able to lead “a minimally decent life in one’s\nsociety”, we must take a view about the functionings and\ncapabilities that are constitutive of a decent human life, and any\nsuch view is bound to be somewhat controversial, perhaps especially if\nwe are trying to define a social minimum transnationally or globally.\nSome people might not accept the capability-list used to determine the\nsocial minimum as the right list. We shall return briefly to this\nproblem towards the end of this section, but only after first give\nsome consideration to a second potential legitimacy problem which we\nalso briefly noted in section\n 1.1:\n the limit-setting problem. To recall the problem, consider\nonce again item (2) on Nussbaum’s list of “central human\nfunctional capabilities”, as set out in section\n 1.2,\n the capability for bodily health. What kind and level of access to\nhealth-care resources must a society secure for its members for us to\nsay that this capability is satisfied to an extent that allows\neveryone to lead “a minimally decent life”? If we hold\nthat a society must ensure access to whatever health-care resources\nhave, say, a life-sustaining impact, then we may well be committing\nourselves to spending the vast bulk of a society’s resources just on\nhealth-care. At some point limits must be set, or else the health-care\nsector will devour the whole social product (making it impossible, of\ncourse, to provide for other key capabilities). But, on the other\nhand, how can limits be set in a way that is fair and has legitimacy\nin the eyes of the people who will have to live with the consequences\nof these limit-setting decisions? How is it possible for communities\nto decide whether or not a new, expensive health-care treatment is in\nor out of the social minimum, and for this decision to have legitimacy\nin the eyes of the citizens?\n\nThese questions invite us to consider explicitly the political\nprocesses through which limit-setting (and other) decisions are\nmade. It considers what features these processes must have if they are\nto treat all those bound by the decisions fairly, and in a way that\nall those concerned can regard as legitimate.\n\nIn the health-care context, the issue of limit-setting is explored in\nan important paper by Norman Daniels and James Sabin (Daniels and\nSabin 1997). Daniels and Sabin argue that for limit-setting decisions\nin this context to have legitimacy, the decision-making process must\nsatisfy four conditions (see Daniels and Sabin 1997: 322–325;\nalso Ham and Robert 2003: 2):\n\nPublicity. The rationales for limit-setting decisions\nmust be made public.\nReasonableness. The rationales for limit-setting\ndecisions should be reasonable; that is, they should appeal to reasons\nand principles that can be accepted as relevant by people who are\ndisposed to look for reasons and principles agreeable to all.\nContestability. There should be a mechanism through which\ndecisions can be challenged, with adequate opportunity to present new\narguments and evidence.\nEnforcement. There should be a mechanism for forcing the\nlimit-setting body to respect the first three conditions.\n\n\nThe idea is not that the people who are affected by a given\nlimit-setting decision will necessarily agree with this decision if\nthese conditions are met, e.g., agree with a decision to exclude a\nspecific medical treatment from the health-care package provided under\nthe social minimum policy regime. Rather, the idea is that all parties\nwill be able to regard the decision as legitimate, even if they\ndisagree with it and some of them continue to oppose it. The\nconditions of publicity and reasonableness work to ensure that a given\ndecision is grounded in reasons of a kind that affected parties can\nsee at least see as relevant. The contestability condition helps to\nensure that the reasonableness of the decision is robust, that all\nrelevant reasons and evidence have indeed been weighed by the\ndecision-making body in coming to its decision. In these\ncircumstances, even the person who “loses” in such a case\ncan feel assured that their interests and point of view have not been\noverruled arbitrarily. In this sense, they are fairly treated and the\ndecision ought to have, even in their eyes, legitimacy, even if they\ncontinue to think it mistaken and oppose it.\n\nThe implication of the foregoing analysis is that those who wish to\nenact a social minimum need to give serious thought to the\ninstitutional structures through which limit-setting decisions are\nmade, with an eye to seeing that the conditions of publicity,\nreasonableness, contestability, and enforcement are met. This applies\nnot only in relation to health-care, but in relation to all the\nprograms that governments must typically have as part of enacting a\nsocial minimum, such as cash transfer programs, educational services,\nand so on.\n\nMoreover, this concern for appropriate procedure should arguably\ninform not only our response to the limit-setting problem, but to the\ncapability-list problem that we noted above. In a society where there\nis broad, but not perfect, consensus in support of a Nussbaum-style\nlist of “central human functional capabilities”, the\nlegitimacy of the final capability-list used to help specify the\nsocial minimum can be enhanced by subjecting the formulation of the\nlist to a process that has the characteristics of publicity,\nreasonableness, and contestability noted above (see Sen 1999: 110;\nNussbaum 1999: 47–49, for comments along these\n lines).[9]\n A similar focus on the importance of fair procedure in the\nspecification of the social minimum policy package can be found in\nNancy Fraser’s work on the “politics of need\ninterpretation” (Fraser 1989, 1997), and in Amy Gutmann’s and\nDennis Thompson’s account of welfare state policy-making in a\n“deliberative democracy” (Gutmann and Thompson 1996). The\nuse of conditionality, discussed in the previous section, is perhaps a\nparticularly important area in which to make sure that policy-making\nprocedures have these qualities of publicity, reasonableness, and\ncontestability. In societies where there is significant background\ninjustice, it will be very important also to ensure adequate voice in\nthe decision-making process for those who suffer unjust\ndisadvantage.\n\nA further and key question for consideration here is whether the\nstandard processes of representative democracy are adequate to meet\nthe demands of publicity, reasonableness, and contestability, or\nwhether, to achieve decisions that have legitimacy, these processes\nneed to be supplemented by other kinds of institutions that are more\ndeliberative and inclusive of the people who stand to be bound by\nlimit-setting, capability-listing, and conditionality-defining\ndecisions. Interesting developments in this respect include:\n\n(1) use of citizens’ juries, deliberative opinion\npolls and Citizens’ Assemblies to assist with\ndecision-making (on which, see Fishkin 1995, Coote and Lenaghan 1998,\nSmith and Wales 2000, Fung 2003, Smith 2009);\n\n(2) Participatory Budgeting, which originated in Brazil in\nthe 1990s and has since been taken up (in various forms) around the\nworld (de Sousa Santos 2007, Wampler 2007, Baiocchi, Heller and Silva\n2011, Fung 2011); and,\n\n(3) village parliaments (gram sabhas) that are\nconstitutionally mandated in rural areas in India and which have\nhelped to empower poorer citizens to exercise more control over\nprovision of local public goods (Véron 2001, Parthasarathy and\nRao 2018, Parthasarathy, Rao and Palaniswamy 2019).\n\nIn view of the legitimacy problems discussed in this section, those\nwho support enactment of a social minimum should consider the\ncontribution of these and similar institutions in the specification\nand operation of social minimum policy regimes.\n4. Conclusion\n\nInstead of summarizing the arguments of the previous sections here, we\nclose by noting three further points which put our discussion into\nperspective.\n\nFirstly, we should note that as we move to enact the social minimum\nthere are a number of important policy design questions that arise\nthat our discussion thus far leaves unresolved. We have considered one\ndesign issue: the issue of how far access to the social minimum should\nbe work-conditional. But there is a huge range of other design issues\nthat we have not directly considered. For example, if we accept that\nthe government has a responsibility to its citizens to secure access\nto certain basic goods and services, to what extent should the\ngovernment itself directly produce these goods and services, e.g.,\nhealth-care? If we accept that the government must introduce\ntax-transfer schemes to enact the social minimum, what form should\nthese take? Should the government use “means-testing” to\ntarget transfers exclusively to the most needy, or should it seek to\nenact the social minimum through so-called “social\ninsurance” programs to which all (or virtually all) citizens\ncontribute, and from which all receive\n benefits?[10]\n If the government provides citizens with assistance in meeting a\nspecific need, should it provide assistance in the form of\n“in-kind” benefits or in the form of\n cash?[11]\n These are all major design questions that arise in thinking about how\nto enact the social minimum. One cannot settle them merely by appeal\nto the basic idea of the social minimum. Although many of the ideas\nand considerations discussed here will be relevant in addressing these\nquestions, settling them requires further philosophical reflection\nand, indeed, a lot of empirical research.\n\nSecondly, it is important to emphasise again that much of our\ndiscussion has taken the scope of the social minimum to be that of a\nnation state, but we can and should also consider obligations to enact\na social minimum at transnational and global levels. A full discussion\nof this would need to draw on the growing body of literature on global\n justice.[12]\n\nThirdly, even when considering economic and social arrangements within\na given nation, we need to keep distinct the specific question of\nwhether and why a social minimum is justified from the broader\nquestion of what social justice consists in and demands of us.\nEnacting a social minimum may well be a demand of social justice.\nIndeed, it may well be one of the most urgent demands of social\njustice. But, challenging as this demand is, social justice might\nrequire much more of us than this.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ackerman, Bruce and Anne Alstott, 1999, <em>The Stakeholder\nSociety</em>, New Haven, CT: Yale University Press.",
                "Anderson, Elizabeth, 1999, “What is the Point of\nEquality?”, <em>Ethics</em>, 109: 287–337.",
                "Baiocchi, Gianpaulo, Patrick Heller, and Marcello K. Silva, 2011,\n<em>Bootstrapping Democracy: Transforming Local Governance and Civil\nSociety in Brazil</em>, Stanford: Stanford University Press.",
                "Barnes, Elizabeth, 2016, <em>The Minority Body: A Theory of\nDisability</em>, Oxford, Oxford University Press.",
                "Barry, Brian, 1995, <em>Justice as Impartiality</em>, Oxford:\nOxford University Press.",
                "–––, 2002, “Social Exclusion, Social\nIsolation and the Distribution of Income”, in John Hills, Julian\nLe Grand, and David Piachaud (eds.), <em>Understanding Social\nExclusion</em>, Oxford: Oxford University Press, pp. 13–29.",
                "Beitz, Charles, 1979 [1999], <em>Political Theory and\nInternational Relations</em>, Princeton: Princeton University\nPress.",
                "Begon, Jessica, 2021, “Disability: A Justice-Based\nAccount”, <em>Philosophical Studies</em>, 178(3):\n935–962.",
                "Bentham, Jeremy, 1789, “Introduction to the Principles of\nMorals and Legislation, Chapters I-V”, in Mary Warnock (ed.),\n<em>John Stuart Mill’s Utilitarianism</em>, Glasgow: William Collins,\n1962.",
                "Berlin, Isaiah, 1958, “Two Concepts of Liberty”, in\nBerlin, <em>Four Essays on Liberty</em>, Oxford: Oxford University\nPress, 1969, pp. 118–172.",
                "Bidadanure, Juliana Uhuru, 2019, “The Political Theory of\nUniversal Basic Income”, <em>American Review of Political\nScience</em>, 22: 481–501.",
                "Birnbaum, Simon, 2012, <em>Basic Income Reconsidered: Social\nJustice, Liberalism, and the Demands of Equality</em>, Basingstoke:\nPalgrave.",
                "Brandt, Richard B., 1981, “Utilitarianism and Welfare\nLegislation”, in Peter G. Brown, Conrad Johnson, and Paul\nVernier, <em>Income Support: Conceptual and Policy Issues</em>,\nTotowa, NJ: Rowman and Littlefield, 7–24.",
                "Brock, Gillian, 1998a, “Is Redistribution to Help the Needy\nUnjust?”, in Brock 1998b: 173–184.",
                "––– (ed.), 1998b, <em>Necessary Goods: Our\nResponsibilities to Meet Others’ Needs</em>, Lanham, MD: Rowman\nand Littlefield.",
                "Caney, Simon, 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.",
                "Carens, Joseph, 2015, <em>The Ethics of Immigration</em>, Oxford:\nOxford University Press.",
                "Christman, John, 1991, “Self-Ownership, Equality and the\nStructure of Property Rights”, <em>Political Theory</em>, 19:\n28–46.",
                "Claassen, Rutger, 2020, “Selecting a List”, in Enrica\nChiappero-Martinetti, Siddiqur Osmani, and Mozaffar Qizilbash (eds.),\n<em>The Cambridge Handbook of the Capability Approach</em>, Cambridge:\nCambridge University Press, 188–205.",
                "Cohen, G. A., 1988, “Freedom, Justice, and\nCapitalism”, in Cohen, <em>History, Labour and Freedom: Themes\nfrom Marx</em>, Oxford: Oxford University Press, 286–304.",
                "–––, 1995, <em>Self-Ownership, Freedom and\nEquality</em>, Cambridge: Cambridge University Press.",
                "–––, 1997, “Appendix: Money and\nLiberty”, in Jane Franklin (ed.), <em>Equality</em>, London:\nInstitute for Public Policy Research, pp. 41–43.",
                "Coote, Anna and Joe Lenaghan, 1998, “Citizens’\nJuries”, in Jane Franklin (ed.), <em>Social Policy and Social\nJustice</em>, Oxford: Polity, 198–208.",
                "Dahl, Robert, 1998, <em>On Democracy</em>, New Haven, CT: Yale\nUniversity Press.",
                "Daniels, Norman, 1981, “Conflicting Objectives and the\nPriorities Problem”, in Peter G. Brown, Conrad Johnson and Paul\nVernier, <em>Income Support: Conceptual and Policy Issues</em>,\nTotowa, NJ: Rowman and Littlefield, pp. 147–164.",
                "Daniels, Norman and James Sabin, 1997, “Limits to Health\nCare: Fair Procedures, Democratic Deliberation, and the Legitimacy\nProblem for Insurers”, <em>Philosophy and Public Affairs</em>,\n26: 303–350.",
                "de Sousa Santos, Boaventura (ed.), 2007 <em>Democratizing\nDemocracy: Beyond the Liberal Democratic Canon</em>, London:\nVerso.",
                "Doyal, Len and Ian Gough, 1991, <em>A Theory of Human Need</em>,\nBasingstoke: Macmillan.",
                "Dworkin, Ronald, 1985, “Why Liberals Should Care About\nEquality”, in R. Dworkin, <em>A Matter of Principle</em>,\nCambridge, MA: Harvard University Press, pp. 205–220.",
                "–––, 2000, <em>Sovereign Virtue: The Theory and\nPractice of Equality</em>, Cambridge, MA: Harvard University\nPress.",
                "Dwyer, Peter (ed.), 2019, <em>Dealing with Welfare Conditionality:\nImplementation and Effects</em>, Bristol: Policy Press.",
                "Eleveld, Anja, Thomas Kampen, and Josien Arts (eds.), 2020,\n<em>Welfare to Work in Contemporary European Welfare States: Legal,\nSociological and Philosophical Perspectives on Justice and\nDomination</em>, Bristol: Policy Press.",
                "Fishkin, James, 1995, <em>The Voice of the People</em>, New Haven,\nCT: Yale University Press.",
                "Fraser, Nancy, 1989, “Talking about Needs: Interpretive\nContests as Political Conflicts in Welfare State Societies”,\n<em>Ethics</em>, 99: 291–313.",
                "–––, 1997, <em>Justice Interruptus: Critical\nReflections on the “Post-Socialist” Condition</em>, New\nYork: Routledge.",
                "–––, 1998, “Social Justice in the Age of\nIdentity Politics: Redistribution, Recognition, Participation”,\nWZB Discussion Paper, No. FS I 98-108, Wissenschaftszentrum Berlin\nfür Sozialforschung (WZB), Berlin\n [<a href=\"https://www.econstor.eu/bitstream/10419/44061/1/269802959.pdf\" target=\"other\">Fraser 1998 available online</a>].",
                "Freeden, Michael, 1978, <em>The New Liberalism: An Ideology of\nSocial Reform</em>, Oxford: Oxford University Press.",
                "Fried, Barbara H., 2004, “Left-Libertarianism: A Review\nEssay”, <em>Philosophy and Public Affairs</em>, 32(1):\n66–92.",
                "Frolich, Norman and Joe Oppenheimer, 1992, <em>Choosing Justice:\nAn Experimental Approach to Ethical Theory</em>, Berkeley and Los\nAngeles, CA: University of California Press.",
                "Fung, Archon, 2003, “Recipes for Public Spheres: Eight\nInstitutional Design Choices and Their Consequences”,\n<em>Journal of Political Philosophy</em>, 11: 338–367.",
                "–––, 2011, “Reinventing Democracy in Latin\nAmerica”, <em>Perspectives on Politics</em>, 9:\n857–871.",
                "Goodin, Robert E., 1986, <em>Protecting the Vulnerable: A\nReanalysis of Our Social Responsibilities</em>, Chicago: University of\nChicago Press.",
                "–––, 1988, <em>Reasons for Welfare</em>,\nPrinceton: Princeton University Press.",
                "Gough, Ian, 2003, “Lists and Thresholds: Comparing the\nDoyal-Gough Theory of Human Need With Nussbaum’s Capabilities\nApproach”, WeD Working Paper 01, ESRC Research Group on\nWellbeing in Developing Countries, University of Bath, March.",
                "Green, T.H., 1881, “Liberal Legislation and Freedom of\nContract”, in Miller 1991: 21–32.",
                "Gutmann, Amy and Dennis Thompson, 1996, <em>Democracy and\nDisagreement</em>, Cambridge: MA: Harvard University Press.",
                "Ham, Chris and Glenn Robert, 2003, <em>Reasonable Rationing:\nInternational Experience of Priority Setting in Health Care</em>,\nMaidenhead: Open University Press.",
                "Hayek, Friedrich, 1960, <em>The Constitution of Liberty</em>,\nLondon: Routledge, 1993.",
                "Humboldt, Wilhelm von, 1852, in J.W. Burrow (ed.), <em>The Limits\nof State Action</em>, Cambridge: Cambridge University Press,\n1969.",
                "Krishna, Anirudh, 2006, “Poverty and Democratic\nParticipation Reconsidered: Evidence from the Local Level in\nIndia”, <em>Comparative Politics</em>, 38(4):\n439–458.",
                "Ip, Ka-Wai, 2016, <em>Egalitarianism and Global Justice From a\nRelational Perspective</em>, Basingstoke: Palgrave.",
                "Kymlicka, Will, 2001, <em>Contemporary Political Philosophy,\nSecond Edition</em>, Oxford: Oxford University Press.",
                "Laborde, Cecile, and Miriam Ronzoni, 2016, “What is a Free\nState? Republican Internationalism and Globalisation”,\n<em>Political Studies</em>, 64(2): 279–296.",
                "Locke, John, 1689, <em>Two Treatises of Civil Government</em>,\nPeter Laslett (ed.), Cambridge: Cambridge University Press, 1960.",
                "Matteucci, Stefano Civaterese and Simon Halliday (eds.), 2017,\n<em>Social Rights in Europe in an Age of Austerity</em>, London:\nRoutledge.",
                "Mead, Lawrence, 1986, <em>Beyond Entitlement: The Social\nObligations of Citizenship</em>, New York: Free Press.",
                "–––, 1992, <em>The New Politics of Poverty: The\nNonworking Poor in America</em>, New York: Basic Books.",
                "––– (ed.), 1997, <em>The New Paternalism:\nSupervisory Approaches to Poverty</em>, Washington DC: The Brookings\nInstitution Press.",
                "Mead, Lawrence and Christopher Beem (eds.), 2005, <em>Welfare\nReform and Political Theory</em>, New York: Russell Sage\nFoundation.",
                "Mill, John Stuart, 1861, “Utilitarianism”, in Mary\nWarnock (ed.), <em>John Stuart Mill’s Utilitarianism</em>, Glasgow:\nWilliam Collins, 1962, pp. 251–321.",
                "Miller, David, 2000, <em>Principles of Social Justice</em>,\nCambridge: MA: Harvard University Press.",
                "––– (ed.), 1991, <em>Liberty</em>, Oxford:\nOxford University Press.",
                "Mood, Carina, and Jan O. Jonsson, 2015, “The Social\nConsequences of Poverty: An Empirical Test on Longitudinal\nData”, <em>Social Indicators Research</em>, 126:\n633–652.",
                "Murray, Charles, 1984, <em>Losing Ground: American Social Policy\n1950–1980</em>, New York: Basic Books.",
                "Nozick, Robert, 1974, <em>Anarchy, State, and Utopia</em>, Oxford:\nBlackwell.",
                "Nussbaum, Martha, 1990, “Aristotelian Social\nDemocracy”, in R. Bruce Douglass, Gerald M. Mara and Henry S.\nRichardson, <em>Liberalism and the Good</em>, New York: Routledge, pp.\n203–252.",
                "–––, 1992, “Human Functioning and Social\nJustice: In Defense of Aristotelian Essentialism”, <em>Political\nTheory</em>, 20: 202–246.",
                "–––, 1999, “Women and Cultural\nUniversals”, in Nussbaum, <em>Sex and Social Justice</em>,\nOxford: Oxford University Press, pp. 29–54.",
                "–––, 2000, <em>Women and Human Development: The\nCapabilities Approach</em>, Cambridge: Cambridge University\nPress.",
                "–––, 2006, <em>Frontiers of Justice: Disability,\nNationality, Species Membership</em>, Cambridge: MA: Harvard\nUniversity Press.",
                "Oberman, Kieran, 2015, “Poverty and Immigration\nPolicy”, <em>American Political Science Review</em>, 109(2):\n239–251.",
                "Okin, Susan Moller, 1989, <em>Justice, Gender and the Family</em>,\nNew York: Basic Books.",
                "Oosterlaken, Ilse, 2020, “Resources or Capabilities?”,\nin Enrica Chiappero-Martinetti, Siddiqur Osmani, and Mozaffar\nQizilbash (eds.), <em>The Cambridge Handbook of the Capability\nApproach</em>, Cambridge: Cambridge University Press, 126–145.",
                "Otsuka, Michael, 2003, <em>Libertarianism without Inequality</em>,\nOxford: Oxford University Press.",
                "Parthasarathy, Ramya, and Vijayendra Rao, 2018,\n“Deliberative Democracy in India”, in Andre Bachtinger,\nJohn Dryzek, Jane Mansbridge, and Mark Warren (eds.), <em>The Oxford\nHandbook of Deliberative Democracy</em>, Oxford: Oxford University\nPress, pp. 805–818.",
                "Parthasarathy, Ramya, Vijayendra Rao, and Nethra Palaniswamy,\n2019, “Deliberative Democracy in an Unequal World: A\n<em>Text-As-Data</em> Study of South India’s Village\nAssemblies”, <em>American Political Science Review</em>,\n113(3): 623–640.",
                "Pateman, Carole, 2005, “Another Way Forward: Welfare, Social\nReproduction, and a Basic Income”, in Mead and Beem 2005:\n34–64.",
                "Pettit, Philip, 1997, <em>Republicanism: A Theory of Freedom and\nGovernment</em>, Oxford: Oxford University Press.",
                "Piven, Frances Fox and Richard A. Cloward, 1993, <em>Regulating\nthe Poor: The Functions of Public Welfare: Updated Edition</em>, New\nYork: Vintage Books.",
                "Plant, Raymond, 1998, “Needs, Welfare and\nCitizenship”, in Jane Franklin (ed.), <em>Social Policy and\nSocial Justice</em>, Oxford: Polity, pp. 57–72.",
                "Plant, Raymond, Harold Lesser and Peter Taylor-Gooby, 1990,\n<em>Political Philosophy and Social Welfare</em>, London:\nRoutledge.",
                "Rawls, John, 1971, <em>A Theory of Justice, Revised Edition</em>,\nCambridge: MA: Harvard University Press, 1999.",
                "–––, 1993, <em>Political Liberalism</em>, New\nYork: Columbia University Press.",
                "–––, 2001, <em>Justice as Fairness: A\nRestatement</em>, Cambridge: MA: Harvard University Press.",
                "Reeve, Andrew and Andrew Williams, 2003, <em>Real Libertarianism\nAssessed: Political Theory After Van Parijs</em>, Basingstoke:\nPalgrave.",
                "Robeyns, Ingrid, 2005, “The Capability Approach: a\ntheoretical survey”, <em>Journal of Human Development</em>, 6:\n93–117.",
                "–––, 2006, “The Capability Approach in\nPractice”, <em>Journal of Political Philosophy</em>, 14:\n351–376.",
                "Rothstein, Bo, 1998, <em>Just Institutions Matter: The Moral and\nPolitical Logic of the Universal Welfare State</em>, Cambridge:\nCambridge University Press.",
                "Sen, Amartya, 1982, “Rights and Agency”,\n<em>Philosophy and Public Affairs</em>, 11: 3–39.",
                "–––, 1987a, <em>The Standard of Living</em>,\nCambridge: Cambridge University Press.",
                "–––, 1987b, <em>Ethics and Economics</em>,\nOxford: Blackwell.",
                "–––, 1992, <em>Inequality Reexamined</em>,\nOxford: Clarendon Press.",
                "–––, 1999, <em>Development as Freedom</em>,\nOxford: Oxford University Press.",
                "–––, 2009, <em>The Idea of Justice</em>, London:\nAllen Lane.",
                "Shelby, Tommie, 2007, “Justice, Deviance, and the Dark\nGhetto”, <em>Philosophy and Public Affairs</em>, 35:\n126–160.",
                "–––, 2016, <em>Dark Ghettos: Injustice, Dissent,\nand Reform</em>, Cambridge, MA: Harvard University Press.",
                "Shue, Henry, 1980, <em>Basic Rights: Subsistence, Affluence, and\nU.S. Foreign Policy</em>, Princeton: Princeton University Press.",
                "Smith, Graham, 2009, <em>Democratic Innovations: Designing\nInstitutions for Citizen Participation</em>, Cambridge: Cambridge\nUniversity Press.",
                "Smith, Graham and Corinne Wales, 2000, “Citizens’\nJuries and Deliberative Democracy”, <em>Political Studies</em>,\n48: 51–65.",
                "Steiner, Hillel, 1994, <em>An Essay on Rights</em>, Oxford:\nBlackwell.",
                "Sterba, James, 1998, “From Liberty to Universal\nWelfare”, in Brock 1998b: 185–217.",
                "Swift, Adam, 2001, <em>Political Philosophy: A Beginner’s Guide\nfor Students and Politicians</em>, Oxford: Polity.",
                "Thurow, Lester, 1976, “Government Expenditures: Cash or\nIn-Kind Aid?”, <em>Philosophy and Public Affairs</em>, 5:\n361–381.",
                "Tocqueville, Alexis de, 1835, <em>Alexis de Tocqueville’s Memoir\non Pauperism</em>, trans. Seymour Drescher, London: Institute for\nEconomic Affairs, 1997.",
                "Vallentyne, Peter and Hillel Steiner (eds.), 2000a,\n<em>Left-Libertarianism and Its Critics</em>, Basingstoke:\nPalgrave.",
                "––– (eds.), 2000b, <em>The Origins of\nLeft-Libertarianism</em>, Basingstoke: Palgrave.",
                "Van der Veen, Robert, 1998, “Real Freedom versus\nReciprocity: Views on the Justice of Unconditional Basic\nIncome”, <em>Political Studies</em>, 46: 140–163.",
                "Van Donselaar, Gijs, 2009, <em>The Right to Exploit: Parasitism,\nScarcity, Basic Income</em>, New York: Oxford University Press.",
                "Van Parijs, Philippe, 1992, <em>Arguing for Basic Income:\nPhilosophical Arguments for a Radical Reform</em>, London: Verso.",
                "–––, 1995, <em>Real Freedom for All: What (if\nAnything) Can Justify Capitalism?</em>, Oxford: Oxford University\nPress.",
                "Véron, Réné, 2001, “The\n‘New’ Kerala Model: Lessons for Sustainable\nDevelopment”, <em>World Development</em>, 29(4):\n601–617.",
                "Waldron, Jeremy, 1993a, “John Rawls and the Social\nMinimum”, in Waldron, <em>Liberal Rights</em>, Cambridge:\nCambridge University Press, pp. 250–270.",
                "–––, 1993b, “Homelessness and the Issue of\nFreedom”, in Waldron, <em>Liberal Rights</em>, Cambridge:\nCambridge University Press, pp. 309–338.",
                "Wampler, Brian, 2007, <em>Participatory Budgeting in Brazil:\nContestation, Cooperation, and Accountability</em>, University Park:\nPenn State University Press.",
                "Watts, Beth and Suzanne Fitzpatrick, 2018, <em>Welfare\nConditionality</em>, London: Routledge.",
                "White, Stuart, 2000, “Social Rights and the Social Contract:\nPolitical Theory and the New Welfare Politics”, <em>British\nJournal of Political Science</em>, 30: 507–532.",
                "–––, 2003, <em>The Civic Minimum: On the Rights\nand Obligations of Economic Citizenship</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 2005, “Is Conditionality\nIlliberal?”, in Mead and Beem 2005: 82–109.",
                "–––, 2007, “Reconsidering the Exploitation\nObjection to Basic Income”, <em>Basic Income Studies</em>,\n1.",
                "–––, 2017, “Should a Minimum Income be\nUnconditional?”, in Matteucci and Halliday 2017:\n181–196.",
                "Widerquist, Karl, 2013, <em>Independence, Propertylessness, and\nBasic Income: A Theory of Freedom as the Power to Say No</em>,\nBasingstoke: Palgrave.",
                "Wolff, Jonathan, 1991, <em>Robert Nozick: Justice, Property and\nthe Minimal State</em>, Oxford: Blackwell.",
                "–––, 1998, “Fairness, Respect, and the\nEgalitarian Ethos”, <em>Philosophy and Public Affairs</em>, 27:\npp. 97–122.",
                "Wolff, Jonathan and Avner De-Shalit, 2007, <em>Disadvantage</em>,\nOxford: Oxford University Press.",
                "Young, Iris Marion, 1990,<em> Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press.",
                "Ypi, Lea, 2011, <em>Global Justice and Avant Garde Political\nAgency</em>, Oxford: Oxford University Press."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2><a id=\"Bib\">Bibliography</a></h2>\n<ul class=\"hanging\">\n<li>Ackerman, Bruce and Anne Alstott, 1999, <em>The Stakeholder\nSociety</em>, New Haven, CT: Yale University Press.</li>\n<li>Anderson, Elizabeth, 1999, “What is the Point of\nEquality?”, <em>Ethics</em>, 109: 287–337.</li>\n<li>Baiocchi, Gianpaulo, Patrick Heller, and Marcello K. Silva, 2011,\n<em>Bootstrapping Democracy: Transforming Local Governance and Civil\nSociety in Brazil</em>, Stanford: Stanford University Press.</li>\n<li>Barnes, Elizabeth, 2016, <em>The Minority Body: A Theory of\nDisability</em>, Oxford, Oxford University Press.</li>\n<li>Barry, Brian, 1995, <em>Justice as Impartiality</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 2002, “Social Exclusion, Social\nIsolation and the Distribution of Income”, in John Hills, Julian\nLe Grand, and David Piachaud (eds.), <em>Understanding Social\nExclusion</em>, Oxford: Oxford University Press, pp. 13–29.</li>\n<li>Beitz, Charles, 1979 [1999], <em>Political Theory and\nInternational Relations</em>, Princeton: Princeton University\nPress.</li>\n<li>Begon, Jessica, 2021, “Disability: A Justice-Based\nAccount”, <em>Philosophical Studies</em>, 178(3):\n935–962.</li>\n<li>Bentham, Jeremy, 1789, “Introduction to the Principles of\nMorals and Legislation, Chapters I-V”, in Mary Warnock (ed.),\n<em>John Stuart Mill’s Utilitarianism</em>, Glasgow: William Collins,\n1962.</li>\n<li>Berlin, Isaiah, 1958, “Two Concepts of Liberty”, in\nBerlin, <em>Four Essays on Liberty</em>, Oxford: Oxford University\nPress, 1969, pp. 118–172.</li>\n<li>Bidadanure, Juliana Uhuru, 2019, “The Political Theory of\nUniversal Basic Income”, <em>American Review of Political\nScience</em>, 22: 481–501.</li>\n<li>Birnbaum, Simon, 2012, <em>Basic Income Reconsidered: Social\nJustice, Liberalism, and the Demands of Equality</em>, Basingstoke:\nPalgrave.</li>\n<li>Brandt, Richard B., 1981, “Utilitarianism and Welfare\nLegislation”, in Peter G. Brown, Conrad Johnson, and Paul\nVernier, <em>Income Support: Conceptual and Policy Issues</em>,\nTotowa, NJ: Rowman and Littlefield, 7–24.</li>\n<li>Brock, Gillian, 1998a, “Is Redistribution to Help the Needy\nUnjust?”, in Brock 1998b: 173–184.</li>\n<li>––– (ed.), 1998b, <em>Necessary Goods: Our\nResponsibilities to Meet Others’ Needs</em>, Lanham, MD: Rowman\nand Littlefield.</li>\n<li>Caney, Simon, 2005, <em>Justice Beyond Borders: A Global Political\nTheory</em>, Oxford: Oxford University Press.</li>\n<li>Carens, Joseph, 2015, <em>The Ethics of Immigration</em>, Oxford:\nOxford University Press.</li>\n<li>Christman, John, 1991, “Self-Ownership, Equality and the\nStructure of Property Rights”, <em>Political Theory</em>, 19:\n28–46.</li>\n<li>Claassen, Rutger, 2020, “Selecting a List”, in Enrica\nChiappero-Martinetti, Siddiqur Osmani, and Mozaffar Qizilbash (eds.),\n<em>The Cambridge Handbook of the Capability Approach</em>, Cambridge:\nCambridge University Press, 188–205.</li>\n<li>Cohen, G. A., 1988, “Freedom, Justice, and\nCapitalism”, in Cohen, <em>History, Labour and Freedom: Themes\nfrom Marx</em>, Oxford: Oxford University Press, 286–304.</li>\n<li>–––, 1995, <em>Self-Ownership, Freedom and\nEquality</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1997, “Appendix: Money and\nLiberty”, in Jane Franklin (ed.), <em>Equality</em>, London:\nInstitute for Public Policy Research, pp. 41–43.</li>\n<li>Coote, Anna and Joe Lenaghan, 1998, “Citizens’\nJuries”, in Jane Franklin (ed.), <em>Social Policy and Social\nJustice</em>, Oxford: Polity, 198–208.</li>\n<li>Dahl, Robert, 1998, <em>On Democracy</em>, New Haven, CT: Yale\nUniversity Press.</li>\n<li>Daniels, Norman, 1981, “Conflicting Objectives and the\nPriorities Problem”, in Peter G. Brown, Conrad Johnson and Paul\nVernier, <em>Income Support: Conceptual and Policy Issues</em>,\nTotowa, NJ: Rowman and Littlefield, pp. 147–164.</li>\n<li>Daniels, Norman and James Sabin, 1997, “Limits to Health\nCare: Fair Procedures, Democratic Deliberation, and the Legitimacy\nProblem for Insurers”, <em>Philosophy and Public Affairs</em>,\n26: 303–350.</li>\n<li>de Sousa Santos, Boaventura (ed.), 2007 <em>Democratizing\nDemocracy: Beyond the Liberal Democratic Canon</em>, London:\nVerso.</li>\n<li>Doyal, Len and Ian Gough, 1991, <em>A Theory of Human Need</em>,\nBasingstoke: Macmillan.</li>\n<li>Dworkin, Ronald, 1985, “Why Liberals Should Care About\nEquality”, in R. Dworkin, <em>A Matter of Principle</em>,\nCambridge, MA: Harvard University Press, pp. 205–220.</li>\n<li>–––, 2000, <em>Sovereign Virtue: The Theory and\nPractice of Equality</em>, Cambridge, MA: Harvard University\nPress.</li>\n<li>Dwyer, Peter (ed.), 2019, <em>Dealing with Welfare Conditionality:\nImplementation and Effects</em>, Bristol: Policy Press.</li>\n<li>Eleveld, Anja, Thomas Kampen, and Josien Arts (eds.), 2020,\n<em>Welfare to Work in Contemporary European Welfare States: Legal,\nSociological and Philosophical Perspectives on Justice and\nDomination</em>, Bristol: Policy Press.</li>\n<li>Fishkin, James, 1995, <em>The Voice of the People</em>, New Haven,\nCT: Yale University Press.</li>\n<li>Fraser, Nancy, 1989, “Talking about Needs: Interpretive\nContests as Political Conflicts in Welfare State Societies”,\n<em>Ethics</em>, 99: 291–313.</li>\n<li>–––, 1997, <em>Justice Interruptus: Critical\nReflections on the “Post-Socialist” Condition</em>, New\nYork: Routledge.</li>\n<li>–––, 1998, “Social Justice in the Age of\nIdentity Politics: Redistribution, Recognition, Participation”,\nWZB Discussion Paper, No. FS I 98-108, Wissenschaftszentrum Berlin\nfür Sozialforschung (WZB), Berlin\n [<a href=\"https://www.econstor.eu/bitstream/10419/44061/1/269802959.pdf\" target=\"other\">Fraser 1998 available online</a>].</li>\n<li>Freeden, Michael, 1978, <em>The New Liberalism: An Ideology of\nSocial Reform</em>, Oxford: Oxford University Press.</li>\n<li>Fried, Barbara H., 2004, “Left-Libertarianism: A Review\nEssay”, <em>Philosophy and Public Affairs</em>, 32(1):\n66–92.</li>\n<li>Frolich, Norman and Joe Oppenheimer, 1992, <em>Choosing Justice:\nAn Experimental Approach to Ethical Theory</em>, Berkeley and Los\nAngeles, CA: University of California Press.</li>\n<li>Fung, Archon, 2003, “Recipes for Public Spheres: Eight\nInstitutional Design Choices and Their Consequences”,\n<em>Journal of Political Philosophy</em>, 11: 338–367.</li>\n<li>–––, 2011, “Reinventing Democracy in Latin\nAmerica”, <em>Perspectives on Politics</em>, 9:\n857–871.</li>\n<li>Goodin, Robert E., 1986, <em>Protecting the Vulnerable: A\nReanalysis of Our Social Responsibilities</em>, Chicago: University of\nChicago Press.</li>\n<li>–––, 1988, <em>Reasons for Welfare</em>,\nPrinceton: Princeton University Press.</li>\n<li>Gough, Ian, 2003, “Lists and Thresholds: Comparing the\nDoyal-Gough Theory of Human Need With Nussbaum’s Capabilities\nApproach”, WeD Working Paper 01, ESRC Research Group on\nWellbeing in Developing Countries, University of Bath, March.</li>\n<li>Green, T.H., 1881, “Liberal Legislation and Freedom of\nContract”, in Miller 1991: 21–32.</li>\n<li>Gutmann, Amy and Dennis Thompson, 1996, <em>Democracy and\nDisagreement</em>, Cambridge: MA: Harvard University Press.</li>\n<li>Ham, Chris and Glenn Robert, 2003, <em>Reasonable Rationing:\nInternational Experience of Priority Setting in Health Care</em>,\nMaidenhead: Open University Press.</li>\n<li>Hayek, Friedrich, 1960, <em>The Constitution of Liberty</em>,\nLondon: Routledge, 1993.</li>\n<li>Humboldt, Wilhelm von, 1852, in J.W. Burrow (ed.), <em>The Limits\nof State Action</em>, Cambridge: Cambridge University Press,\n1969.</li>\n<li>Krishna, Anirudh, 2006, “Poverty and Democratic\nParticipation Reconsidered: Evidence from the Local Level in\nIndia”, <em>Comparative Politics</em>, 38(4):\n439–458.</li>\n<li>Ip, Ka-Wai, 2016, <em>Egalitarianism and Global Justice From a\nRelational Perspective</em>, Basingstoke: Palgrave.</li>\n<li>Kymlicka, Will, 2001, <em>Contemporary Political Philosophy,\nSecond Edition</em>, Oxford: Oxford University Press.</li>\n<li>Laborde, Cecile, and Miriam Ronzoni, 2016, “What is a Free\nState? Republican Internationalism and Globalisation”,\n<em>Political Studies</em>, 64(2): 279–296.</li>\n<li>Locke, John, 1689, <em>Two Treatises of Civil Government</em>,\nPeter Laslett (ed.), Cambridge: Cambridge University Press, 1960.</li>\n<li>Matteucci, Stefano Civaterese and Simon Halliday (eds.), 2017,\n<em>Social Rights in Europe in an Age of Austerity</em>, London:\nRoutledge.</li>\n<li>Mead, Lawrence, 1986, <em>Beyond Entitlement: The Social\nObligations of Citizenship</em>, New York: Free Press.</li>\n<li>–––, 1992, <em>The New Politics of Poverty: The\nNonworking Poor in America</em>, New York: Basic Books.</li>\n<li>––– (ed.), 1997, <em>The New Paternalism:\nSupervisory Approaches to Poverty</em>, Washington DC: The Brookings\nInstitution Press.</li>\n<li>Mead, Lawrence and Christopher Beem (eds.), 2005, <em>Welfare\nReform and Political Theory</em>, New York: Russell Sage\nFoundation.</li>\n<li>Mill, John Stuart, 1861, “Utilitarianism”, in Mary\nWarnock (ed.), <em>John Stuart Mill’s Utilitarianism</em>, Glasgow:\nWilliam Collins, 1962, pp. 251–321.</li>\n<li>Miller, David, 2000, <em>Principles of Social Justice</em>,\nCambridge: MA: Harvard University Press.</li>\n<li>––– (ed.), 1991, <em>Liberty</em>, Oxford:\nOxford University Press.</li>\n<li>Mood, Carina, and Jan O. Jonsson, 2015, “The Social\nConsequences of Poverty: An Empirical Test on Longitudinal\nData”, <em>Social Indicators Research</em>, 126:\n633–652.</li>\n<li>Murray, Charles, 1984, <em>Losing Ground: American Social Policy\n1950–1980</em>, New York: Basic Books.</li>\n<li>Nozick, Robert, 1974, <em>Anarchy, State, and Utopia</em>, Oxford:\nBlackwell.</li>\n<li>Nussbaum, Martha, 1990, “Aristotelian Social\nDemocracy”, in R. Bruce Douglass, Gerald M. Mara and Henry S.\nRichardson, <em>Liberalism and the Good</em>, New York: Routledge, pp.\n203–252.</li>\n<li>–––, 1992, “Human Functioning and Social\nJustice: In Defense of Aristotelian Essentialism”, <em>Political\nTheory</em>, 20: 202–246.</li>\n<li>–––, 1999, “Women and Cultural\nUniversals”, in Nussbaum, <em>Sex and Social Justice</em>,\nOxford: Oxford University Press, pp. 29–54.</li>\n<li>–––, 2000, <em>Women and Human Development: The\nCapabilities Approach</em>, Cambridge: Cambridge University\nPress.</li>\n<li>–––, 2006, <em>Frontiers of Justice: Disability,\nNationality, Species Membership</em>, Cambridge: MA: Harvard\nUniversity Press.</li>\n<li>Oberman, Kieran, 2015, “Poverty and Immigration\nPolicy”, <em>American Political Science Review</em>, 109(2):\n239–251.</li>\n<li>Okin, Susan Moller, 1989, <em>Justice, Gender and the Family</em>,\nNew York: Basic Books.</li>\n<li>Oosterlaken, Ilse, 2020, “Resources or Capabilities?”,\nin Enrica Chiappero-Martinetti, Siddiqur Osmani, and Mozaffar\nQizilbash (eds.), <em>The Cambridge Handbook of the Capability\nApproach</em>, Cambridge: Cambridge University Press, 126–145.</li>\n<li>Otsuka, Michael, 2003, <em>Libertarianism without Inequality</em>,\nOxford: Oxford University Press.</li>\n<li>Parthasarathy, Ramya, and Vijayendra Rao, 2018,\n“Deliberative Democracy in India”, in Andre Bachtinger,\nJohn Dryzek, Jane Mansbridge, and Mark Warren (eds.), <em>The Oxford\nHandbook of Deliberative Democracy</em>, Oxford: Oxford University\nPress, pp. 805–818.</li>\n<li>Parthasarathy, Ramya, Vijayendra Rao, and Nethra Palaniswamy,\n2019, “Deliberative Democracy in an Unequal World: A\n<em>Text-As-Data</em> Study of South India’s Village\nAssemblies”, <em>American Political Science Review</em>,\n113(3): 623–640.</li>\n<li>Pateman, Carole, 2005, “Another Way Forward: Welfare, Social\nReproduction, and a Basic Income”, in Mead and Beem 2005:\n34–64.</li>\n<li>Pettit, Philip, 1997, <em>Republicanism: A Theory of Freedom and\nGovernment</em>, Oxford: Oxford University Press.</li>\n<li>Piven, Frances Fox and Richard A. Cloward, 1993, <em>Regulating\nthe Poor: The Functions of Public Welfare: Updated Edition</em>, New\nYork: Vintage Books.</li>\n<li>Plant, Raymond, 1998, “Needs, Welfare and\nCitizenship”, in Jane Franklin (ed.), <em>Social Policy and\nSocial Justice</em>, Oxford: Polity, pp. 57–72.</li>\n<li>Plant, Raymond, Harold Lesser and Peter Taylor-Gooby, 1990,\n<em>Political Philosophy and Social Welfare</em>, London:\nRoutledge.</li>\n<li>Rawls, John, 1971, <em>A Theory of Justice, Revised Edition</em>,\nCambridge: MA: Harvard University Press, 1999.</li>\n<li>–––, 1993, <em>Political Liberalism</em>, New\nYork: Columbia University Press.</li>\n<li>–––, 2001, <em>Justice as Fairness: A\nRestatement</em>, Cambridge: MA: Harvard University Press.</li>\n<li>Reeve, Andrew and Andrew Williams, 2003, <em>Real Libertarianism\nAssessed: Political Theory After Van Parijs</em>, Basingstoke:\nPalgrave.</li>\n<li>Robeyns, Ingrid, 2005, “The Capability Approach: a\ntheoretical survey”, <em>Journal of Human Development</em>, 6:\n93–117.</li>\n<li>–––, 2006, “The Capability Approach in\nPractice”, <em>Journal of Political Philosophy</em>, 14:\n351–376.</li>\n<li>Rothstein, Bo, 1998, <em>Just Institutions Matter: The Moral and\nPolitical Logic of the Universal Welfare State</em>, Cambridge:\nCambridge University Press.</li>\n<li>Sen, Amartya, 1982, “Rights and Agency”,\n<em>Philosophy and Public Affairs</em>, 11: 3–39.</li>\n<li>–––, 1987a, <em>The Standard of Living</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1987b, <em>Ethics and Economics</em>,\nOxford: Blackwell.</li>\n<li>–––, 1992, <em>Inequality Reexamined</em>,\nOxford: Clarendon Press.</li>\n<li>–––, 1999, <em>Development as Freedom</em>,\nOxford: Oxford University Press.</li>\n<li>–––, 2009, <em>The Idea of Justice</em>, London:\nAllen Lane.</li>\n<li>Shelby, Tommie, 2007, “Justice, Deviance, and the Dark\nGhetto”, <em>Philosophy and Public Affairs</em>, 35:\n126–160.</li>\n<li>–––, 2016, <em>Dark Ghettos: Injustice, Dissent,\nand Reform</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Shue, Henry, 1980, <em>Basic Rights: Subsistence, Affluence, and\nU.S. Foreign Policy</em>, Princeton: Princeton University Press.</li>\n<li>Smith, Graham, 2009, <em>Democratic Innovations: Designing\nInstitutions for Citizen Participation</em>, Cambridge: Cambridge\nUniversity Press.</li>\n<li>Smith, Graham and Corinne Wales, 2000, “Citizens’\nJuries and Deliberative Democracy”, <em>Political Studies</em>,\n48: 51–65.</li>\n<li>Steiner, Hillel, 1994, <em>An Essay on Rights</em>, Oxford:\nBlackwell.</li>\n<li>Sterba, James, 1998, “From Liberty to Universal\nWelfare”, in Brock 1998b: 185–217.</li>\n<li>Swift, Adam, 2001, <em>Political Philosophy: A Beginner’s Guide\nfor Students and Politicians</em>, Oxford: Polity.</li>\n<li>Thurow, Lester, 1976, “Government Expenditures: Cash or\nIn-Kind Aid?”, <em>Philosophy and Public Affairs</em>, 5:\n361–381.</li>\n<li>Tocqueville, Alexis de, 1835, <em>Alexis de Tocqueville’s Memoir\non Pauperism</em>, trans. Seymour Drescher, London: Institute for\nEconomic Affairs, 1997.</li>\n<li>Vallentyne, Peter and Hillel Steiner (eds.), 2000a,\n<em>Left-Libertarianism and Its Critics</em>, Basingstoke:\nPalgrave.</li>\n<li>––– (eds.), 2000b, <em>The Origins of\nLeft-Libertarianism</em>, Basingstoke: Palgrave.</li>\n<li>Van der Veen, Robert, 1998, “Real Freedom versus\nReciprocity: Views on the Justice of Unconditional Basic\nIncome”, <em>Political Studies</em>, 46: 140–163.</li>\n<li>Van Donselaar, Gijs, 2009, <em>The Right to Exploit: Parasitism,\nScarcity, Basic Income</em>, New York: Oxford University Press.</li>\n<li>Van Parijs, Philippe, 1992, <em>Arguing for Basic Income:\nPhilosophical Arguments for a Radical Reform</em>, London: Verso.</li>\n<li>–––, 1995, <em>Real Freedom for All: What (if\nAnything) Can Justify Capitalism?</em>, Oxford: Oxford University\nPress.</li>\n<li>Véron, Réné, 2001, “The\n‘New’ Kerala Model: Lessons for Sustainable\nDevelopment”, <em>World Development</em>, 29(4):\n601–617.</li>\n<li>Waldron, Jeremy, 1993a, “John Rawls and the Social\nMinimum”, in Waldron, <em>Liberal Rights</em>, Cambridge:\nCambridge University Press, pp. 250–270.</li>\n<li>–––, 1993b, “Homelessness and the Issue of\nFreedom”, in Waldron, <em>Liberal Rights</em>, Cambridge:\nCambridge University Press, pp. 309–338.</li>\n<li>Wampler, Brian, 2007, <em>Participatory Budgeting in Brazil:\nContestation, Cooperation, and Accountability</em>, University Park:\nPenn State University Press.</li>\n<li>Watts, Beth and Suzanne Fitzpatrick, 2018, <em>Welfare\nConditionality</em>, London: Routledge.</li>\n<li>White, Stuart, 2000, “Social Rights and the Social Contract:\nPolitical Theory and the New Welfare Politics”, <em>British\nJournal of Political Science</em>, 30: 507–532.</li>\n<li>–––, 2003, <em>The Civic Minimum: On the Rights\nand Obligations of Economic Citizenship</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 2005, “Is Conditionality\nIlliberal?”, in Mead and Beem 2005: 82–109.</li>\n<li>–––, 2007, “Reconsidering the Exploitation\nObjection to Basic Income”, <em>Basic Income Studies</em>,\n1.</li>\n<li>–––, 2017, “Should a Minimum Income be\nUnconditional?”, in Matteucci and Halliday 2017:\n181–196.</li>\n<li>Widerquist, Karl, 2013, <em>Independence, Propertylessness, and\nBasic Income: A Theory of Freedom as the Power to Say No</em>,\nBasingstoke: Palgrave.</li>\n<li>Wolff, Jonathan, 1991, <em>Robert Nozick: Justice, Property and\nthe Minimal State</em>, Oxford: Blackwell.</li>\n<li>–––, 1998, “Fairness, Respect, and the\nEgalitarian Ethos”, <em>Philosophy and Public Affairs</em>, 27:\npp. 97–122.</li>\n<li>Wolff, Jonathan and Avner De-Shalit, 2007, <em>Disadvantage</em>,\nOxford: Oxford University Press.</li>\n<li>Young, Iris Marion, 1990,<em> Justice and the Politics of\nDifference</em>, Princeton: Princeton University Press.</li>\n<li>Ypi, Lea, 2011, <em>Global Justice and Avant Garde Political\nAgency</em>, Oxford: Oxford University Press.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "capability approach",
            "egalitarianism",
            "equality",
            "exploitation",
            "justice: distributive",
            "justice: global",
            "libertarianism",
            "original position",
            "property and ownership",
            "redistribution"
        ],
        "entry_link": [
            {
                "../capability-approach/": "capability approach"
            },
            {
                "../egalitarianism/": "egalitarianism"
            },
            {
                "../equality/": "equality"
            },
            {
                "../exploitation/": "exploitation"
            },
            {
                "../justice-distributive/": "justice: distributive"
            },
            {
                "../justice-global/": "justice: global"
            },
            {
                "../libertarianism/": "libertarianism"
            },
            {
                "../original-position/": "original position"
            },
            {
                "../property/": "property and ownership"
            },
            {
                "../redistribution/": "redistribution"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-minimum\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/social-minimum/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=social-minimum&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/social-minimum/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=social-minimum": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/social-minimum/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=social-minimum&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/social-minimum/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "<a href=\"https://www.basicincome.org/\" target=\"other\">Basic Income Earth Network</a>,\n The BIEN Archive provides a comprehensive listing of books, journal\narticles, reports and conference papers on basic income, published in\na variety of languages.",
            "<a href=\"https://hd-ca.org\" target=\"other\">Human Development and Capability Association</a>,\n a website for academics and practitioners that “seeks to build\nan intellectual community around the ideas of human development and\nthe capability approach, and relate these ideas to the policy\narena.”",
            "<a href=\"https://basicincome.org\">Basic Income Earth Network</a>,\n a website run by supporters of the proposal for universal basic\nincome with global coverage of policy debates related to this\nidea."
        ],
        "listed_links": [
            {
                "https://www.basicincome.org/": "Basic Income Earth Network"
            },
            {
                "https://hd-ca.org": "Human Development and Capability Association"
            },
            {
                "https://basicincome.org": "Basic Income Earth Network"
            }
        ]
    }
}