{
    "url": "socialism",
    "title": "Socialism",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Pablo Gilabert\n<pablo.gilabert@concordia.ca>\nMartin O’Neill\n<martin.oneill@york.ac.uk>",
        "author_links": [
            {
                "http://www.concordia.ca/faculty/pablo-gilabert.html": "Pablo Gilabert"
            },
            {
                "mailto:pablo%2egilabert%40concordia%2eca": "pablo.gilabert@concordia.ca"
            },
            {
                "https://york.academia.edu/MartinONeill": "Martin O’Neill"
            },
            {
                "mailto:martin%2eoneill%40york%2eac%2euk": "martin.oneill@york.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\n<a href=\"http://www.concordia.ca/faculty/pablo-gilabert.html\" target=\"other\">Pablo Gilabert</a>\n&lt;<a href=\"mailto:pablo%2egilabert%40concordia%2eca\"><em>pablo<abbr title=\" dot \">.</abbr>gilabert<abbr title=\" at \">@</abbr>concordia<abbr title=\" dot \">.</abbr>ca</em></a>&gt;<br/>\n<a href=\"https://york.academia.edu/MartinONeill\" target=\"other\">Martin O’Neill</a>\n&lt;<a href=\"mailto:martin%2eoneill%40york%2eac%2euk\"><em>martin<abbr title=\" dot \">.</abbr>oneill<abbr title=\" at \">@</abbr>york<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Jul 15, 2019"
    ],
    "preamble": "\n\nSocialism is a rich tradition of political thought and practice, the\nhistory of which contains a vast number of views and theories, often\ndiffering in many of their conceptual, empirical, and normative\ncommitments. In his 1924 Dictionary of Socialism, Angelo\nRappoport canvassed no fewer than forty definitions of socialism,\ntelling his readers in the book’s preface that “there are\nmany mansions in the House of Socialism” (Rappoport 1924: v,\n34–41). To take even a relatively restricted subset of socialist\nthought, Leszek Kołakowski could fill over 1,300 pages in his\nmagisterial survey of Main Currents of Marxism\n(Kołakowski 1978 [2008]). Our aim is of necessity more modest. In\nwhat follows, we are concerned to present the main features of\nsocialism, both as a critique of capitalism, and as a proposal for its\nreplacement. Our focus is predominantly on literature written within a\nphilosophical idiom, focusing in particular on philosophical writing\non socialism produced during the past forty-or-so years. Furthermore,\nour discussion concentrates on the normative contrast between\nsocialism and capitalism as economic systems. Both socialism and\ncapitalism grant workers legal control of their labor power, but\nsocialism, unlike capitalism, requires that the bulk of the means of\nproduction workers use to yield goods and services be under the\neffective control of workers themselves, rather than in the hands of\nthe members of a different, capitalist class under whose direction\nthey must toil. As we will explain below, this contrast has been\narticulated further in different ways, and socialists have not only\nmade distinctive claims regarding economic organization but also\nregarding the processes of transformation fulfilling them and the\nprinciples and ideals orienting their justification (including, as we\nwill see, certain understandings of freedom, equality, solidarity, and\n democracy).[1]\n",
    "toc": [
        {
            "#SociCapi": "1. Socialism and Capitalism"
        },
        {
            "#ThreDimeSociView": "2. Three Dimensions of Socialist Views"
        },
        {
            "#SociCritCapiTheiGrouDimeDI": "3. Socialist Critiques of Capitalism and their Grounds (Dimension DI)"
        },
        {
            "#SociPrin": "3.1 Socialist Principles"
        },
        {
            "#SociCharAgaiCapi": "3.2 Socialist Charges against Capitalism"
        },
        {
            "#Expl": "3.2.1 Exploitation"
        },
        {
            "#InteDomi": "3.2.2 Interference and domination"
        },
        {
            "#Alie": "3.2.3 Alienation"
        },
        {
            "#Inef": "3.2.4 Inefficiency"
        },
        {
            "#LibeEgalIneqCapi": "3.2.5 Liberal egalitarianism and inequality in capitalism"
        },
        {
            "#SociInstDesiDimeDII": "4. Socialist Institutional Designs (Dimension DII)"
        },
        {
            "#CentPartPlan": "4.1 Central and Participatory Planning"
        },
        {
            "#MarkSoci": "4.2 Market Socialism"
        },
        {
            "#LessCompPiecRefo": "4.3 Less Comprehensive, Piecemeal Reforms"
        },
        {
            "#SociTranDimeDIII": "5. Socialist Transformation (Dimension DIII)"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Socialism and Capitalism\n\nSocialism is best defined in contrast with capitalism, as socialism\nhas arisen both as a critical challenge to capitalism, and as a\nproposal for overcoming and replacing it. In the classical, Marxist\ndefinition (G.A. Cohen 2000a: ch.3; Fraser 2014: 57–9),\ncapitalism involves certain relations of production. These\ncomprise certain forms of control over the productive\nforces—the labor power that workers deploy in\nproduction and the means of production such as natural\nresources, tools, and spaces they employ to yield goods and\nservices—and certain social patterns of economic interaction\nthat typically correlate with that control. Capitalism displays the\nfollowing constitutive features:\n\n\n (i) The bulk of the\nmeans of production is privately owned and\ncontrolled.\n (ii) People legally\nown their labor power. (Here capitalism differs from slavery and\nfeudalism, under which systems some individuals are entitled to\ncontrol, whether completely or partially, the labor power of\nothers).\n (iii) Markets\nare the main mechanism allocating inputs and outputs of production and\ndetermining how societies’ productive surplus is used, including\nwhether and how it is consumed or invested.\n\n\n\nAn additional feature that is typically present wherever\n(i)–(iii) hold, is that:\n\n\n (iv) There is a\nclass division between capitalists and workers, involving\nspecific relations (e.g., whether of bargaining, conflict, or\nsubordination) between those classes, and shaping the labor market,\nthe firm, and the broader political process.\n\n\n\nThe existence of wage labor is often seen by socialists as a necessary\ncondition for a society to be counted as capitalist (Schweickart 2002\n[2011: 23]). Typically, workers (unlike capitalists) must sell their\nlabor power to make a living. They sell it to capitalists, who (unlike\nthe workers) control the means of production. Capitalists typically\nsubordinate workers in the production process, as capitalists have\nasymmetric decision-making power over what gets produced and how it\ngets produced. Capitalists also own the output of production and sell\nit in the market, and they control the predominant bulk of the flow of\ninvestment within the economy. The relation between capitalists and\nworkers can involve cooperation, but also relations of conflict (e.g.,\nregarding wages and working conditions). This more-or-less\nantagonistic power relationship between capitalists and workers plays\nout in a number of areas, within production itself, and in the broader\npolitical process, as in both the economic and political domains\ndecisions are made about who does what, and who gets what.\n\nThere are possible economic systems that would present exceptions, in\nwhich (iv) does not hold even if (i), (ii) and (iii) all obtain.\nExamples here are a society of independent commodity producers or a\nproperty-owning democracy (in which individuals or groups of workers\nown firms). There is debate, however, as to how\nfeasible—accessible and stable—these are in a modern\neconomic environment (O’Neill 2012).\n\nAnother feature that is also typically seen as arising where\n(i)–(iii) hold is this:\n\n\n (v) Production is\nprimarily oriented to capital accumulation (i.e., economic\nproduction is primarily oriented to profit rather than to the\nsatisfaction of human needs). (G.A. Cohen 2000a; Roemer\n2017).\n\n\n\nIn contrast to capitalism, socialism can be defined as a type of\nsociety in which, at a minimum, (i) is turned into (i*):\n\n\n (i*) The bulk of the\nmeans of production is under social, democratic control.\n\n\n\nChanges with regard to features (ii), (iii), and (v) are hotly debated\namongst socialists. Regarding (ii), socialists retain the view that\nworkers should control their labor power, but many do not affirm the\nkind of absolute, libertarian property rights in labor power that\nwould, e.g., prevent taxation or other forms of mandatory contribution\nto cater for the basic needs of others (G.A. Cohen 1995). Regarding\n(iii), there is a recent burgeoning literature on “market\nsocialism”, which we discuss below, where proposals are advanced\nto create an economy that is socialist but nevertheless features\nextensive markets. Finally, regarding (v), although most socialists\nagree that, due to competitive pressures, capitalists are bound to\nseek profit maximization, some puzzle over whether when they do this,\nit is “greed and fear” and not the generation of resources\nto make others besides themselves better-off that is the dominant,\nmore basic drive and hence the degree to which profit-maximization\nshould be seen as a normatively troubling phenomenon. (See Steiner\n2014, in contrast with G.A. Cohen 2009, discussing the case of\ncapitalists amassing capital to give it away through charity.)\nFurthermore, some socialists argue that the search for profits in a\nmarket socialist economy is not inherently suspicious (Schweickart\n2002 [2011]). Most socialists, however, tend to find the profit motive\nproblematic.\n\nAn important point about this definition of socialism is that\nsocialism is not equivalent to, and is arguably in conflict with,\nstatism. (i*) involves expansion of social power—power based on\nthe capacity to mobilize voluntary cooperation and collective\naction—as distinct from state power—power based on the\ncontrol of rule-making and rule enforcing over a territory—as\nwell of economic power—power based on the control of material\nresources (Wright 2010). If a state controls the economy but is not in\nturn democratically controlled by the individuals engaged in economic\nlife, what we have is some form of statism, not socialism (see also\nArnold n.d. in\n Other Internet Resources (OIR);\n Dardot & Laval 2014).\n2. Three Dimensions of Socialist Views\n\nWhen characterizing socialist views, it is useful to distinguish\nbetween three dimensions of a conception of a social justice (Gilabert\n2017a). We identify these three dimensions as:\n\n\n (DI) the core ideals\nand principles animating that conception of justice;\n (DII) the social\ninstitutions and practices implementing the ideals specified at\nDI;\n (DIII) the processes\nof transformation leading agents and their society from where they are\ncurrently, to the social outcome specified in DII.\n\n\n\nThe characterization of capitalism and socialism in the previous\nsection focuses on the social institutions and practices constituting\neach form of society (i.e., on DII). We step back from this\ninstitutional dimension in section 3, below, to consider the central\nnormative commitments of socialism (DI) and to survey their deployment\nin the socialist critique of capitalism. We then, in\n section 4,\n engage in a more detailed discussion of accounts of the institutional\nshape of socialism (DII), exploring the various proposed\nimplementations of socialist ideals and principles outlined under DI.\nWe turn to accounts of the transition to socialism (DIII) in\n section 5.\n3. Socialist Critiques of Capitalism and their Grounds (Dimension DI)\n\nSocialists have condemned capitalism by alleging that it typically\nfeatures exploitation, domination, alienation, and inefficiency.\nBefore surveying these criticisms, it is important to note that they\nrely on various ideals and principles at DI. We first mention these\ngrounds briefly, and then elaborate on them as we discuss their\nengagement in socialists’ critical arguments. We set aside the\ndebate, conducted mostly during the 1980s and largely centered on the\ninterpretation of Marx’s writings, as to whether the\ncondemnation of capitalism and the advocacy for socialism relies (or\nshould rely), on moral grounds (Geras 1985; Lukes 1985; Peffer 1990).\nWhereas some Marxist socialists take the view that criticism of\ncapitalism can be conducted without making use—either explicitly\nor implicitly—of arguments with a moral foundation, our focus is\non arguments that do rely on such grounds.\n3.1 Socialist Principles\n\nSocialists have deployed ideals and principles of equality, democracy,\nindividual freedom, self-realization, and community or solidarity.\nRegarding equality, they have proposed strong versions of the\nprinciple of equality of opportunity according to which everyone\nshould have “broadly equal access to the necessary material and\nsocial means to live flourishing lives” (Wright 2010: 12; Roemer\n1994a: 11–4; Nielsen 1985). Some, but by no means all,\nsocialists construe equality of opportunity in a luck-egalitarian way,\nas requiring the neutralization of inequalities of access to advantage\nthat result from people’s circumstances rather than their\nchoices (G.A. Cohen 2009: 17–9). Socialists also embrace the\nideal of democracy, requiring that people have “broadly\nequal access to the necessary means to participate meaningfully in\ndecisions” affecting their lives (Wright 2010: 12; Arnold n.d.\n [OIR]:\n sect. 4). Many socialists say that democratic participation should be\navailable not only at the level of governmental institutions, but also\nin various economic arenas (such as within the firm). Third,\nsocialists are committed to the importance of individual\nfreedom. This commitment includes versions of the standard ideas\nof negative liberty and non-domination (requiring security from\ninappropriate interference by others). But it also typically includes\na more demanding, positive form of self-determination, as the\n“real freedom” of being able to develop one’s own\nprojects and bring them to fruition (Elster 1985: 205; Gould 1988: ch.\n1; Van Parijs 1995: ch. 1; Castoriadis 1979). An ideal of self-realization\nthrough autonomously chosen activities featuring people’s\ndevelopment and exercise of their creative and productive capacities\nin cooperation with others sometimes informs socialists’\npositive views of freedom and equality—as in the view that there\nshould be a requirement of access to the conditions of\nself-realization at work (Elster 1986: ch. 3). Finally, and relatedly,\nsocialists often affirm an idea of community or\nsolidarity, according to which people should organize their\neconomic life so that they treat the freedom and well-being of others\nas intrinsically significant. People should recognize positive duties\nto support other people, or, as Einstein (1949) put it, a “sense\nof responsibility for [their] fellow men”. Or, as Cohen put it,\npeople should “care about, and, where necessary and possible,\ncare for, one another, and, too, care that they care about one\nanother” (G.A. Cohen 2009: 34–5). Community is sometimes\npresented as a moral ideal which is not itself a demand of justice but\ncan be used to temper problematic results permitted by some demands of\njustice (such as the inequalities of outcome permitted by a\nluck-egalitarian principle of equality of opportunity (G.A. Cohen\n2009)). However, community is sometimes presented within socialist\nviews as a demand of justice itself (Gilabert 2012). Some socialists\nalso take solidarity as partly shaping a desirable form of\n“social freedom” in which people are able not only to\nadvance their own good but also to act with and for others (Honneth\n2015 [2017: ch. I]).\n\nGiven the diversity of fundamental principles to which socialists\ncommonly appeal, it is perhaps unsurprising that few attempts have\nbeen made to link these principles under a unified framework. A\nsuggested strategy has been to articulate some aspects of them as\nrequirements flowing from what we might call the Abilities / Needs\nPrinciple, following Marx’s famous dictum, in The\nCritique of the Gotha Program, that a communist society should be\norganized so as to realize the goals of producing and distributing\n“From each according to [their] abilities, to each according to\n[their] needs”. This principle, presented with brevity and in\nthe absence of much elaboration by Marx (Marx 1875 [1978b: 531]) has\nbeen interpreted in different ways. One, descriptive interpretation\nsimply takes it to be a prediction of how people will feel motivated\nto act in a socialist society. Another, straightforwardly normative\ninterpretation construes the Marxian dictum as stating duties to\ncontribute to, and claims to benefit from, the social\nproduct—addressing the allocation of both the burdens and\nbenefits of social cooperation. Its fulfillment would, in an\negalitarian and solidaristic fashion, empower people to live\nflourishing lives (Carens 2003, Gilabert 2015). The normative\nprinciple itself has also been interpreted as an articulation of the\nbroader, and more basic, idea of human dignity. Aiming at\nsolidaristic empowerment, this idea could be understood as\nrequiring that we support people in the pursuit of a flourishing life\nby not blocking, and by enabling, the development and exercise of\ntheir valuable capacities, which are at the basis of their moral\nstatus as agents with dignity (Gilabert 2017b).\n3.2 Socialist Charges against Capitalism\n3.2.1 Exploitation\n\nThe first typical charge leveled by socialists is that capitalism\nfeatures the exploitation of wage workers by their capitalist\nemployers. Exploitation has been characterized in two ways. First, in\nthe so-called “technical” Marxist characterization,\nworkers are exploited by capitalists when the value embodied in the\ngoods they can purchase with their wages is inferior to the value\nembodied in the goods they produce—with the capitalists\nappropriating the difference. To maximize the profit resulting from\nthe sale of what the workers produce, capitalists have an incentive to\nkeep wages low. This descriptive characterization, which focuses on\nthe flow of surplus labor from workers to capitalists, differs from\nanother common, normative characterization of exploitation, according\nto which exploitation involves taking unfair, wrongful, or unjust\nadvantage of the productive efforts of others. An obvious question is\nwhen, if ever, incidents of exploitation in the technical sense\ninvolve exploitation in the normative sense. When is the transfer of\nsurplus labor from workers to capitalists such that it involves\nwrongful advantage taking of the former by the latter? Socialists have\nprovided at least four answers to this question. (For critical surveys\nsee Arnsperger and Van Parijs 2003: ch. III; Vrousalis 2018; Wolff\n1999).\n\nThe first answer is offered by the unequal exchange account,\naccording to which A exploits B if and only if in their\nexchange A gets more than B does. This account\neffectively collapses the normative sense of exploitation into the\ntechnical one. But critics have argued that this account fails to\nprovide sufficient conditions for exploitation in the normative sense.\nNot every unequal exchange is wrongful: it would not be wrong to\ntransfer resources from workers to people who (perhaps through no\nchoice or fault of their own) are unable to work.\n\nA second proposal is to say that A exploits B if and\nonly if A gets surplus labor from B in a way that is\ncoerced or forced. This labor entitlement account (Holmstrom\n1977; Reiman 1987) relies on the view that workers are entitled to the\nproduct of their labor, and that capitalists wrongly deprive them of\nit. In a capitalist economy, workers are compelled to transfer surplus\nlabor to capitalists on pain of severe poverty. This is a result of\nthe coercively enforced system of private property rights in the means\nof production. Since they do not control means of production to secure\ntheir own subsistence, workers have no reasonable alternative to\nselling their labor power to capitalists and to toil on the terms\nfavored by the latter. Critics of this approach have argued that it,\nlike the previous account, fails to provide sufficient conditions for\nwrongful exploitation because it would (counterintuitively) have to\ncondemn transfers from workers to destitute people unable to work.\nFurthermore, it has been argued that the account fails to provide\nnecessary conditions for the occurrence of exploitation. Problematic\ntransfers of surplus labor can occur without coercion. For example,\nA may have sophisticated means of production, not obtained from\nothers through coercion, and hire B to work on them at a\nperhaps unfairly low wage, which B voluntarily accepts despite\nhaving acceptable, although less advantageous, alternatives (Roemer\n1994b: ch. 4).\n\nThe third, unfair distribution of productive endowments\naccount suggests that the core problem with capitalist\nexploitation (and with other forms of exploitation in class-divided\nsocial systems) is that it proceeds against a background distribution\nof initial access to productive assets that is inegalitarian. A\nis an exploiter, and B is exploited, if and only if A\ngains from B’s labor and A would be worse off, and\nB better off, in an alternative hypothetical economic\nenvironment in which the initial distribution of assets was equal\n(with everything else remaining constant) (Roemer 1994b: 110). This\naccount relies on a luck-egalitarian principle of equality of\nopportunity. (According to luck-egalitarianism, no one should be made worse-off\nthan others due to circumstances beyond their control.) Critics have\nargued that, because of that, it fails to provide necessary conditions\nfor wrongful exploitation. If A finds B stuck in a pit,\nit would be wrong for A to offer B rescue only if\nB signs a sweatshop contract with A—even if\nB happened to have fallen into the pit after voluntarily taking\nthe risk to go hiking in an area well known to be dotted with such\nperilous obstacles (Vrousalis 2013, 2018). Other critics worry that\nthis account neglects the centrality of relations of power or\ndominance between exploiters and exploited (Veneziani 2013).\n\nA fourth approach directly focuses on the fact that exploitation\ntypically arises when there is a significant power asymmetry between\nthe parties involved. The more powerful instrumentalize and take\nadvantage of the vulnerability of the less powerful to benefit from\nthis asymmetry in positions (Goodin 1987). A specific version of this\nview, the domination for self-enrichment account (Vrousalis\n2013, 2018), says that A exploits B if A benefits\nfrom a transaction in which A dominates B. (On this\naccount, domination involves a disrespectful use of A’s\npower over B.) Capitalist property rights, with the resulting\nunequal access to the means of production, put propertyless workers at\nthe mercy of capitalists, who use their superior power over them to\nextract surplus labor. A worry about this approach is that it does not\nexplain when the more powerful party is taking too much from the less\npowerful party. For example, take a situation where A and\nB start with equal assets, but A chooses to work hard\nwhile B chooses to spend more time at leisure, so that at a\nlater time A controls the means of production, while B\nhas only their own labor power. We imagine that A offers\nB employment, and then ask, in light of their ex ante\nequal position, at what level of wage for B and profit for\nA would the transaction involve wrongful exploitation? To come\nto a settled view on this question, it might be necessary to combine\nreliance on a principle of freedom as non-domination with appeal to\nadditional socialist principles addressing just\ndistribution—such as some version of the principles of equality\nand solidarity mentioned above in\n section 4.1.\n3.2.2 Interference and domination\n\nCapitalism is often defended by saying that it maximally extends\npeople’s freedom, understood as the absence of interference.\nSocialism would allegedly depress that freedom by prohibiting or\nlimiting capitalist activities such as setting up a private firm,\nhiring wage workers, and keeping, investing, or spending profits.\nSocialists generally acknowledge that a socialist economy would\nseverely constrain some such freedoms. But they point out that\ncapitalist property rights also involve interference. They remind us\nthat “private property by one person presupposes non-ownership\non the part of other persons” (Marx 1991: 812) and warn that\noften, although \n\n\nliberals and libertarians see the freedom which is intrinsic to\ncapitalism, they overlook the unfreedom which necessarily accompanies\ncapitalist freedom. (G.A. Cohen 2011: 150) \n\n\nWorkers could and would be coercively interfered with if they tried to\nuse means of production possessed by capitalists, to walk away with\nthe products of their labor in capitalist firms, or to access\nconsumption goods they do not have enough money to buy. In fact, every\neconomic system opens some zones of non-interference while closing\nothers. Hence the appropriate question is not whether capitalism or\nsocialism involve interference—they both do—but whether\neither of them involves more net interference, or more troubling forms\nof interference, than the other. And the answer to that question is\nfar from obvious. It could very well be that most agents in a\nsocialist society face less (troublesome) interference as they pursue\ntheir projects of production and consumption than agents in a\ncapitalist society (G.A. Cohen 2011: chs. 7–8).\n\nCapitalist economic relations are often defended by saying that they\nare the result of free choices by consenting adults. Wage workers are\nnot slaves or serfs—they have the legal right to refuse to work\nfor capitalists. But socialists reply that the relationship between\ncapitalists and workers actually involves domination. Workers are\ninappropriately subject to the will of capitalists in the shaping of\nthe terms on which they work (both in the spheres of exchange and\nproduction, and within the broader political process). Workers’\nconsent to their exploitation is given in circumstances of deep\nvulnerability and asymmetry of power. According to Marx, two\nconditions help explain workers’ apparently free choice to enter\ninto a nevertheless exploitative contract: (1) in capitalism (unlike\nin feudalism or slave societies) workers own their labor power,\nbut (2) they do not own means of production. Because of their\ndeprivation (2), workers have no reasonable alternative to using their\nentitlement (1) to sell their labor power to the capitalists—who\ndo own the means of production (Marx 1867 [1990: 272–3]).\nThrough labor-saving technical innovations spurred by competition,\ncapitalism also constantly produces unemployment, which weakens the\nbargaining power of individual workers further. Thus, Marx says that\nalthough workers voluntarily enter into exploitative contracts, they\nare “compelled [to do so] by social conditions”. \n\n\nThe silent compulsion of economic relations sets the seal on the\ndomination of the capitalist over the worker…. [The\nworker’s] dependence on capital … springs from the\nconditions of production themselves, and is guaranteed in perpetuity\nby them. (Marx 1867 [1990: 382, 899]) \n\n\nBecause of the deep background inequality of power resulting from\ntheir structural position within a capitalist economy, workers accept\na pattern of economic transaction in which they submit to the\ndirection of capitalists during the activities of production, and\nsurrender to those same capitalists a disproportional share of the\nfruits of their labor. Although some individual workers might be able\nto escape their vulnerable condition by saving and starting a firm of\ntheir own, most would find this extremely difficult, and they could\nnot all do it simultaneously within capitalism (Elster 1985:\n208–16; G.A. Cohen 1988: ch. 13).\n\nSocialists sometimes say that capitalism flouts an ideal of\nnon-domination as freedom from being subject to rules one has\nsystematically less power to shape than others (Gourevitch 2013;\nArnold 2017; Gilabert 2017b: 566–7—on which this and the\nprevious paragraph draw). Capitalist relations of production involve\ndomination and the dependence of workers on the discretion of\ncapitalists’ choices at three critical junctures. The first,\nmentioned above, concerns the labor contract. Due to their lack of\ncontrol of the means of production, workers must largely submit, on\npain of starvation or severe poverty, to the terms capitalists offer\nthem. The second concerns interactions in the workplace. Capitalists\nand their managers rule the activities of workers by unilaterally\ndeciding what and how the latter produce. Although in the sphere of\ncirculation workers and capitalists might look (misleadingly, given\nthe first point) like equally free contractors striking fair deals,\nonce we enter the “hidden abode” of production it is clear\nto all sides that what exists is relationships of intense subjection\nof some to the will of others (Marx 1867 [1990: 279–80]).\nWorkers effectively spend many of their waking hours doing what others\ndictate them to do. Third, and finally, capitalists have a\ndisproportionate impact on the legal and political process shaping the\ninstitutional structure of the society in which they exploit workers,\nwith capitalist interests dominating the political processes which in\nturn set the contours of property and labor law. Even if workers\nmanage to obtain the legal right to vote and create their own trade\nunions and parties (which labor movements achieved in some countries\nafter much struggle), capitalists exert disproportionate influence via\ngreater access to mass media, the funding of political parties, the\nthreat of disinvestment and capital flight if governments reduce their\nprofit margin, and the past and prospective recruitment of state\nofficials in lucrative jobs in their firms and lobbying agencies\n(Wright 2010: 81–4). At the spheres of exchange, production, and\nin the broader political process, workers and capitalist have\nasymmetric structural power. Consequently, the former are\nsignificantly subject to the will of the latter in the shaping of the\nterms on which they work (see further Wright 2000 [2015]). This\ninequality of structural power, some socialists claim, is an affront\nto workers’ dignity as self-determining, self-mastering\nagents.\n\nThe third point about domination mentioned above is also deployed by\nsocialists to say that capitalism conflicts with democracy (Wright\n2010: 81–4; Arnold n.d.\n [OIR]:\n sect. 4; Bowles and Gintis 1986; Meiksins Wood 1995). Democracy\nrequires that people have roughly equal power to affect the political\nprocess that structures their social life—or at least that\ninequalities do not reflect morally irrelevant features such as race,\ngender, and class. Socialists have made three points regarding the\nconflict between capitalism and democracy. The first concerns\npolitical democracy of the kind that is familiar today. Even in the\npresence of multi-party electoral systems, members of the capitalist\nclass—despite being a minority of the population—have\nsignificantly more influence than members of the working class.\nGovernments have a tendency to adapt their agendas to the wishes of\ncapitalists because they depend on their investment decisions to raise\nthe taxes to fund public policies, as well as for the variety of other\nreasons outlined above. Even if socialist parties win elections, as\nlong as they do not change the fundamentals of the economic system,\nthey must be congenial to the wishes of capitalists. Thus, socialists\nhave argued that deep changes in the economic structure of society are\nneeded to make electoral democracy fulfill its promise. Political\npower cannot be insulated from economic power. They also, secondly,\nthink that such changes may be directly significant. Indeed, as\nradical democrats, socialists have argued that reducing inequality of\ndecision-making power within the economic sphere itself is not only\ninstrumentally significant (to reduce inequality within the\ngovernmental sphere), but also intrinsically significant to increase\npeople’s self-determination in their daily lives as economic\nagents. Therefore, most democratic socialists call for a solution to\nthe problem of the conflict between democracy and capitalism by\nextending democratic principles into the economy (Fleurbaey 2006).\nExploring the parallel between the political and economic systems,\nsocialists have argued that democratic principles should apply in the\neconomic arena as they do in the political domain, as economic\ndecisions, like political decisions, have dramatic consequences for\nthe freedom and well-being of people. Returning to the issue of the\nrelations between the two arenas, socialists have also argued that\nfostering workers’ self-determination in the economy (notably in\nthe workplace) enhances democratic participation at the political\nlevel (Coutrot 2018: ch. 9; Arnold 2012; see survey on workplace\ndemocracy in Frega et al. 2019). A third strand of argument, finally,\nhas explored the importance of socialist reforms for fulfilling the\nideal of a deliberative democracy in which people participate as free\nand equal reasoners seeking to make decisions that actually cater for\nthe common good of all (J. Cohen 1989).\n3.2.3 Alienation\n\nAs mentioned above, socialists have included, in their affirmation of\nindividual freedom, a specific concern with real or\neffective freedom to lead flourishing lives. This freedom is\noften linked with a positive ideal of self-realization, which\nin turn motivates a critique of capitalism as generating alienation.\nThis perspective informs Marx’s views on the strong contrast\nbetween productive activity under socialism and under capitalism. In\nsocialism, the “realm of necessity” and the\ncorrespondingly necessary, but typically unsavory, labor required to\nsecure basic subsistence would be reduced so that people also access a\n“realm of freedom” in which a desirable form of work\ninvolving creativity, cultivation of talents, and meaningful\ncooperation with others is available. This realm of freedom would\nunleash “the development of human energy which is an end in\nitself” (Marx 1991: 957–9). This work, allowing for and\nfacilitating individuals’ self-realization, would enable the\n“all-round development of the individual”, and would in\nfact become a “prime want” (Marx 1875 [1978b: 531]). The\nsocialist society would feature “the development of the rich\nindividuality which is all-sided in its production as in its\nconsumption” (Marx 1857–8 [1973: 325]); it would\nconstitute a “higher form of society in which the full and free\ndevelopment of every individual forms the ruling principle”\n(Marx 1867 [1990: 739]). By contrast, capitalism denies the majority\nof the population access to self-realization at work. Workers\ntypically toil in tasks which are uninteresting and even stunting.\nThey do not control how production unfolds or what is done with the\noutputs of production. And their relations with others is not one of\nfellowship, but rather of domination (under their bosses) and of\ncompetition (against their fellow workers). When alienated, \n\n\nlabor is external to the worker, i.e., it does not belong to\nhis essential being; … in his work, therefore, he does not\naffirm himself but denies himself, does not feel content but unhappy,\ndoes not develop freely his physical and mental energy but mortifies\nhis body and ruins his mind. … It is therefore not the\nsatisfaction of a need; it is merely a means to satisfy needs\nexternal to it. (Marx 1844 [1978a: 74])\n\n\nRecent scholarship has developed these ideas further. Elster has\nprovided the most detailed discussion and development of the Marxian\nideal of self-realization. The idea is defined as “the full and\nfree actualization and externalization of the powers and the abilities\nof the individual” (Elster 1986: 43; 1989: 131).\nSelf-actualization involves a two-step process in which individuals\ndevelop their powers (e.g., learn the principles and techniques of\ncivil engineering) and then actualize those powers (e.g., design and\nparticipate in the construction of a bridge). Self-externalization, in\nturn, features a process in which individuals’ powers become\nvisible to others with the potential beneficial outcome of social\nrecognition and the accompanying boost in self-respect and\nself-esteem. However, Elster says that this Marxian ideal must be\nreformulated to make it more realistic. No one can develop all their\npowers fully, and no feasible economy would enable everyone always to\nget exactly their first-choice jobs and conduct them only in the ways\nthey would most like. Furthermore, self-realization for and with\nothers (and thus also the combination of self-realization with\ncommunity) may not always work smoothly, as producers entangled in\nlarge and complex societies may not feel strongly moved by the needs\nof distant others, and significant forms of division of labor will\nlikely persist. Still, Elster thinks the socialist ideal of\nself-realization remains worth pursuing, for example through the\ngeneration of opportunities to produce in worker cooperatives. Others\nhave construed the demand for real options to produce in ways that\ninvolve self-realization and solidarity as significant for the\nimplementation of the Abilities / Needs Principle (Gilabert\n2015: 207–12), and defended a right to opportunities for\nmeaningful work against the charge that it violates a liberal\nconstraint of neutrality about conceptions of the good (Gilabert\n2018b: sect. 3.3). (For more discussion on alienation and\nself-realization, see Jaeggi 2014: ch. 10.)\n\nFurther scholarship explores recent changes in the organization of\nproduction. Boltanski and Chiapello argue that since the 1980s\ncapitalism has partly absorbed (what they dub) the “artistic\ncritique” against de-skilled and heteronomous work by generating\nschemes of economic activity in which workers operate in teams and\nhave significant decision-making powers. However, these new forms of\nwork, although common especially in certain knowledge-intensive\nsectors, are not available to all workers, and they still operate\nunder the ultimate control of capital owners and their profit\nmaximizing strategies. They also operate in tandem with the\nelimination of the social security policies typical of the\n(increasingly eroded) welfare state. Thus, the “artistic”\nstrand in the socialist critique of capitalism as hampering\npeople’s authenticity, creativity, and autonomy has not been\nfully absorbed and should be renewed. It should also be combined with\nthe other, “social critique” strand which challenges\ninequality, insecurity, and selfishness (Boltanski and Chiapello 2018:\nIntroduction, sect. 2). Other authors find in these new forms of work\nthe seeds of future forms of economic organization—arguing that\nthey provide evidence that workers can plan and control sophisticated\nprocesses of production on their own and that capitalists and their\nmanagers are largely redundant (Negri 2008).\n\nThe critique of alienation has also been recently developed further by\nForst (2017) by exploring the relation between alienation and\ndomination. On this account, the central problem with alienation is\nthat it involves the denial of people’s autonomy—their\nability and right to shape their social life on terms they could\njustify to themselves and to each other as free and equal\nco-legislators. (See also the general analysis of the concept of\nalienation in Leopold 2018.)\n3.2.4 Inefficiency\n\nA traditional criticism of capitalism (especially amongst Marxists) is\nthat it is inefficient. Capitalism is prone to cyclic crises in which\nwealth and human potential is destroyed and squandered. For example,\nto cut costs and maximize profits, firms choose work-saving\ntechnologies and lay off workers. But at the aggregate level, this\nerodes the demand for their products, which forces firms to cut costs\nfurther (by laying off even more workers or halting production).\nSocialism would, it has been argued, not be so prone to crises, as the\nrationale for production would not be profit maximization but need\nsatisfaction. Although important, this line of criticism is less\nwidespread amongst contemporary socialists. Historically, capitalism\nhas proved quite resilient, resurrecting itself after crises and\nexpanding its productivity dramatically over time. In might very well\nbe that capitalism is the best feasible regime if the only standard of\nassessment were productivity.\n\nStill, socialists point out that capitalism involves some significant\ninefficiencies. Examples are the underproduction of public goods (such\nas public transportation and education), the underpricing and\noverconsumption of natural resources (such as fossil fuels and fishing\nstocks), negative externalities (such as pollution), the costs of\nmonitoring and enforcing market contracts and private property (given\nthat the exploited may not be so keen to work as hard as their\nprofit-maximizing bosses require, and that the marginalized may be\nmoved by desperation to steal), and certain defects of intellectual\nproperty rights (such as blocking the diffusion of innovation, and\nalienating those who engage in creative activities because of their\nintrinsic appeal and because of the will to serve the public rather\nthan maximize monetary reward) (Wright 2010: 55–65). Really\nexisting capitalist societies have introduced regulations to counter\nsome of these problems, at least to some extent. Examples are taxes\nand constraints to limit economic activities with negative\nexternalities, and public funding and subsidies to sustain activities\nwith positive externalities which are not sufficiently supported by\nthe market. But, socialists insist, such mechanisms are external to\ncapitalism, as they limit property rights and the scope for profit\nmaximization as the primary orientation in the organization of the\neconomy. The regulations involve the hybridization of the economic\nsystem by introducing some non-capitalist, and even socialist\nelements.\n\nThere is also an important issue of whether efficiency should only be\nunderstood in terms of maximizing production of material consumption\ngoods. If the metric, or the utility space, that is taken into account\nwhen engaging in maximization assessments includes more than these\ngoods, then capitalism can also be criticized as inefficient on\naccount of its tendency to depress the availability of leisure time\n(as well as to distribute it quite unequally). This carries limitation\nof people’s access to the various goods that leisure\nenables—such as the cultivation of friendships, family, and\ncommunity or political participation. Technological innovations create\nthe opportunity to choose between retaining the previous level of\nproduction while using fewer inputs (such as labor time) or\nmaintaining the level of inputs while producing more. John Maynard\nKeynes famously held that it would be reasonable to tend towards the\nprior option, and expected societies to take this path as the\ntechnological frontier advanced (Keynes 1930/31 [2010]; Pecchi and\nPiga 2010). Nevertheless, in large part because of the profit\nmaximization motive, capitalism displays an inherent bias in favor of\nthe second, arguably inferior, option. Capitalism thereby narrows the\nrealistic options of its constituent economic agents—both firms\nand individuals. Firms would lose their competitive edge and risk\nbankruptcy if they did not pursue profits ahead of the broader\ninterests of their workers (as their products would likely be more\nexpensive). And it is typically hard for workers to find jobs that pay\nreasonable salaries for fewer hours of work. Socialists concerned with\nexpanding leisure time—and also with environmental\nrisks—find this bias quite alarming (see, e.g., G.A. Cohen\n2000a: ch. XI). If a conflict between further increase in the\nproduction of material objects for consumption and the expansion of\nleisure time (and environmental protection) is unavoidable, then it is\nnot clear, all things considered, that the former should be\nprioritized, especially when an economy has already reached a high\nlevel of material productivity.\n3.2.5 Liberal egalitarianism and inequality in capitalism\n\nCapitalism has also been challenged on liberal egalitarian grounds,\nand in ways that lend themselves to support for socialism. (Rawls\n2001; Barry 2005; Piketty 2014; O’Neill 2008a, 2012, 2017;\nRonzoni 2018). While many of John Rawls’s readers long took him\nto be a proponent of an egalitarian form of a capitalist welfare\nstate, or as one might put it “a slightly imaginary\nSweden”, in fact Rawls rejected such institutional arrangements\nas inadequate to the task of realizing principles of political liberty\nor equality of opportunity, or of keeping material inequalities within\nsufficiently tight bounds. His own avowed view of the institutions\nthat would be needed to realize liberal egalitarian principles of\njustice was officially neutral as between a form of\n“property-owning democracy”, which would combine private\nproperty in the means of production with its egalitarian distribution,\nand hence the abolition of the separate classes of capitalists and\nworkers; and a form of liberal democratic socialism that would see\npublic ownership of the preponderance of the means of production, with\ndevolved control of particular firms (Rawls 2001: 135–40;\nO’Neill and Williamson 2012). While Rawls’s version of\nliberal democratic socialism was insufficiently developed in his own\nwritings, he stands as an interesting case of a theorist whose defense\nof a form of democratic socialism is based on normative foundations\nthat are not themselves distinctively socialist, but concerned with\nthe core liberal democratic values of justice and equality (see also\nEdmundson 2017; Ypi 2018).\n\nIn a similar vein to Rawls, another instance of a theorist who defends\nat least partially socialist institutional arrangements on liberal\negalitarian grounds was the Nobel Prize winning economist James Meade.\nGiving a central place to decidedly liberal values of freedom,\nsecurity and independence, Meade argued that the likely levels of\nsocioeconomic inequality under capitalism were such that a capitalist\neconomy would need to be extensively tempered by socialist elements,\nsuch as the development of a citizens’ sovereign wealth fund, if\nthe economic system were to be justifiable to those living under it\n(Meade 1964; O’Neill 2015\n [OIR],\n 2017; O’Neill and White 2019). Looking back before Meade, J. S.\nMill can also be seen as a theorist who traveled along what we might\ndescribe as “the liberal road to socialism”, with Mill in\nhis Autobiography describing his own view as the acceptance\nof a “qualified socialism” (Mill 1873 [2018]), and arguing\nfor a range of measures to create a more egalitarian economy,\nincluding making the case for a steady-state rather than a\ngrowth-oriented economy, arguing for workers’ collective\nownership and self-management of firms in preference to the\nhierarchical structures characteristic of most firms under capitalism,\nand endorsing steep taxation of inheritance and unearned income (Mill\n2008; see also Ten 1998; O’Neill 2008b, Pateman 1970). More\nrecently, the argument has been advanced that as capitalist economies\ntend towards higher levels of inequality, and in particular with the\nrapid velocity at which the incomes and wealth of the very rich in\nsociety is increasing, many of those who had seen their normative\ncommitments as requiring only the mild reform of capitalist economies\nmight need to come to see the need to endorse more radical socialist\ninstitutional proposals (Ronzoni 2018).\n4. Socialist Institutional Designs (Dimension DII)\n\nThe foregoing discussion focused on socialist critiques of capitalism.\nThese critiques make the case that capitalism fails to fulfill\nprinciples, or to realize values, to which socialists are committed.\nBut what would an alternative economic system look like which would\nfulfill those principles, or realize those values—or at least\nhonor them to a larger extent? This brings us to dimension DII of\nsocialism. We will consider several proposed models. We will address\nhere critical concerns about both the feasibility and the desirability\nof these models. Arguments comparing ideal socialist designs with\nactual capitalist societies are unsatisfactory; we must compare like\nwith like (Nove 1991; Brennan 2014; Corneo 2017). Thus, we should\ncompare ideal forms of socialism with ideal forms of capitalism, and\nactual versions of capitalism with actual versions of socialism. Most\nimportantly, we should entertain comparisons between the best feasible\nincarnations of these systems. This requires formulating feasible\nforms of socialism. Feasibility assessments can play out in two ways:\nthey may regard the (degree of) workability and stability of a\nproposed socialist system once introduced, or they may regard its\n(degree of) accessibility from current conditions when it is not yet\nin place. We address the former concerns in this section, leaving the\nlatter for\n section 5\n when we turn to dimension DIII of socialism and the questions of\nsocialist transition or transformation.\n4.1 Central and Participatory Planning\n\nWould socialism do better than capitalism regarding the ideals of\nequality, democracy, individual freedom, self-realization, and\nsolidarity? This depends on the availability of workable versions of\nsocialism that fulfill these ideals (or do so at least to a greater\nextent than workable forms of capitalism). A first set of proposals\nenvision an economic system that does away with both private property\nin the means of production and with markets. The first version of this\nmodel is central planning. This can be understood within a\ntop-down, hierarchical model. A central authority gathers information\nabout the technical potential in the economy and about\nconsumers’ needs and formulates a set of production objectives\nwhich seek an optimal match between the former and the latter. These\nobjectives are articulated into a plan that is passed down to\nintermediate agencies and eventually to local firms, which must\nproduce according to the plan handed down. If it works, this proposal\nwould secure the highest feasible levels of equal access to\nconsumption goods for everyone. However, critics have argued that the\nmodel faces serious feasibility hurdles (Corneo 2017: ch. 5: Roemer\n1994a: ch. 5). It is very hard for a central authority to gather the\nrelevant information from producers and consumers. Second, even if it\ncould gather enough information, the computation of an optimal plan\nwould require enormously complex calculations which may be beyond the\ncapacity of planners (even with access to the most sophisticated\ntechnological assistance). Finally, there may be significant incentive\ndeficits. For example, firms might tend to exaggerate the resources\nthey need to produce and mislead about how much they can produce.\nWithout facing strong sticks and carrots (such as the prospects for\neither bankruptcy and profit offered by a competitive market), firms\nmight well display low levels of innovation. As a result, a planned\neconomy would likely lag behind surrounding capitalist economies, and\ntheir members would tend to lose faith in it. High levels of\ncooperation (and willingness to innovate) could still exist if\nsufficiently many individuals in this society possessed a strong sense\nof duty. But critics find this unlikely to materialize, warning that\n“a system that only works with exceptional individuals only\nworks in exceptional cases” (Corneo 2017: 127).\n\nActual experiments in centrally planned economies have only partially\napproximated the best version of it. Thus, in addition to the problems\nmentioned above (which affect even that best version), they have\ndisplayed additional defects. For example, the system introduced in\nthe Soviet Union featured intense concentration of political and\neconomic power in the hands of an elite controlling a single party\nwhich, in turn, controlled a non-democratic state apparatus. Despite\nits successes in industrializing the country (making it capable of\nmobilizing in a war effort to defeat Nazi Germany), the model failed\nto generate sufficient technical innovation and intensive growth to\ndeliver differentiated consumer goods of the kind available within\nadvanced capitalist economies. Furthermore, it trampled upon civil and\npolitical liberties that many socialists would themselves hold\ndear.\n\nResponding to such widespread disempowerment, a second model for\nsocialist planning has recommended that planning be done in a\ndifferent, more democratic way. Thus, the participatory planning\n(or participatory economy, “Parecon”) model proposes\nthe following institutional features (Albert 2003, 2016\n [OIR]).\n First, the means of production would be socially owned. Second,\nproduction would take place in firms controlled by workers (thus\nfostering democracy within the workplace). Third, balanced “job\ncomplexes” are put in place in which workers can both engage in\nintellectual and manual labor (thus fostering and generalizing\nself-realization). Fourth, in a solidaristic fashion, remuneration of\nworkers would track their effort, sacrifice, and special needs (and\nnot their relative power or output—which would likely reflect\ndifferences in native abilities for which they are not morally\nresponsible). Finally, and crucially, economic coordination would be\nbased on comprehensive participatory planning. This would involve a\ncomplex system of nested worker councils, consumer councils, and an\nIteration Facilitation Board. Various rounds of deliberation within,\nand between, worker and consumer councils, facilitated by this board,\nwould be undertaken until matches between supply and demands schedules\nare found—with recourse to voting procedures only when no full\nagreement exists but several promising arrangements arise. This would\nturn the economy into an arena of deliberative democracy.\n\nThis proposal seems to cater for the full palette of socialist values\nstated in\n section 4.1.\n Importantly, it overcomes the deficits regarding freedom displayed by\ncentral planning. Critics have warned, however, that Parecon faces\nserious feasibility obstacles. In particular, the iterative planning\nconstituting the fifth institutional dimension of the Parecon proposal\nwould require immense information complexity (Wright 2010:\n260–5). It is unlikely that participants in the operations of\nthis board, even with the help of sophisticated computers, would\nmanage it sufficiently well to generate a production plan that\nsatisfactorily caters to the diversity of individuals’ needs. A\ndefense of Parecon would retort that beyond initial stages, the\nprocess of economic decision-making would not be too cumbersome.\nFurthermore, it might turn out to involve no more paperwork and time\ndevoted to planning and to assessment behind computer terminals than\nis found in existing capitalist societies (with their myriad\nindividual and corporate budgeting exercises, and their various\naccounting and legal epicycles). And, in any case, even if it is more\ncumbersome and less efficient in terms of productivity, Parecon might\nstill be preferable overall as an economic system, given its superior\nperformance regarding the values of freedom, equality,\nself-realization, solidarity, and democracy (Arnold n.d.\n [OIR]:\n sect. 8.b).\n4.2 Market Socialism\n\nSome of the above-mentioned problems of central planning, regarding\ninefficiency and concentration of power, have motivated some\nsocialists to explore alternative economic systems in which markets\nare given a central role. Markets generate problems of their own\n(especially when they involve monopolies, negative externalities, and\nasymmetric information). But if regulations are introduced to counter\nthese “market failures”, markets can be the best feasible\nmechanism for generating matches between demand and supply in large,\ncomplex societies (as higher prices signal high demand, with supply\nrushing to cover it, while lower prices signal low demand, leading\nsupply to concentrate on other products). Market socialism\naffirms the traditional socialist desideratum of preventing a division\nof society between a class of capitalists who do not need to work to\nmake a living and a class of laborers having to work for them, but it\nretains from capitalism the utilization of markets to guide\nproduction. There has been a lively debate on this approach, with\nseveral specific systems being proposed.\n\nOne version is the economic democracy model (Schweickart 2002\n[2011], 2015\n [OIR]).\n It has three basic features. First, production is undertaken in firms\nmanaged by workers. Worker self-managed enterprises would gain\ntemporary control of some means of production (which would be leased\nout by the state). Workers determine what gets produced and how it is\nproduced, and determine compensation schemes. Second, there is a\nmarket for goods and services. The profit motive persists and some\ninequalities within and between firms are possible, but likely much\nsmaller than in capitalism (as there would be no separate capitalist\nclass, and workers will not democratically select income schemes that\ninvolve significant inequality within their firms). Finally,\ninvestment flows are socially controlled through democratically\naccountable public investment banks, which determine funding for\nenterprises on the basis of socially relevant criteria. The revenues\nfor these banks come from a capital assets tax. This system would\n(through its second feature) mobilize the efficiency of markets while\nalso (through its other features) attending to socialist ideals of\nself-determination, self-realization, and equal opportunity. To\naddress some potential difficulties, the model has been extended to\ninclude further features, such as a commitment of the government as an\nemployer of last resort, the creation of socialist savings and loans\nassociations, the accommodation of an entrepreneurial-capitalist\nsector for particularly innovative small firms, and some forms of\nprotectionism regarding foreign trade.\n\nSelf-management market socialism has been defended as feasible by\npointing at the experience of cooperatives (such as the\nMondragón Corporation in the Basque Country in Spain, which has\n(as of 2015) over 70,000 worker-owners participating in a network of\ncooperative businesses). But it has also been criticized on five\ncounts (Corneo 2017: ch. 6). First, it would generate unfair\ndistributions, as workers doing the same work in different enterprises\nwould end up with unequal income if the enterprises are not equally\nsuccessful in the market. Second, workers would face high levels of\nfinancial risk, as their resources would be concentrated in their firm\nrather than spread more widely. Third, it could generate inefficient\nresponses to market prices, as self-managed enterprises reduce hiring\nif prices for their products are high—so that members keep more\nof the profit—and hire more if the prices are low—to cover\nfor fixed costs of production. Given the previous point, the system\ncould also generate high unemployment. Having the government require\nfirms to hire more would lead to lower productivity. However, the\nfurther features in the model discussed above might address this\nproblem by allowing for small private enterprises to be formed, and by\nhaving in the background the government play a role as an employer of\nlast resort (although this might also limit overall productivity).\nFinally, although some of the problems of efficiency could be handled\nthrough the banks controlling investment, it is not clear that the\nenormous power of such banks could be made sufficiently accountable to\na democratic process so as to avoid the potential problem of\ncooptation by elites. (See, however, Malleson 2014 on democratic\ncontrol of investment.)\n\nAnother market socialist model, proposed by Carens (1981, 2003), does\nnot impose worker self-management. The Carensian model\nmirrors the current capitalist system in most respects while\nintroducing two key innovative features. First, there would be direct\ngovernmental provision regarding certain individually differentiated\nneeds (via a public health care system, for example). Second, to\naccess other consumption goods, everyone working full time would get\nthe same post tax income. Pre-tax salaries would vary, signaling\nlevels of demand in the market. People would choose jobs not only on\nthe basis of their self-regarding preferences, but also out of a sense\nof social duty to use their capacities to support others in society.\nThus, honoring the Abilities / Needs Principle, they would\napply for jobs (within their competencies) in which the pre-tax income\nis relatively high. If it worked, this model would recruit the\nefficiency of markets, but it would not involve the selfish motives\nand inegalitarian outcomes typically linked to them in capitalism.\n\nOne worry about the Carensian model is that it might be unrealistic to\nexpect an economic system to work well when it relies so heavily on a\nsense of duty to motivate people to make cooperative contributions.\nThis worry could be assuaged by presenting this model as the long-term\ntarget of a socialist transformation which would progressively develop\na social ethos supporting it (Gilabert 2011, 2017a), by noting\nempirical findings about the significant traction of non-egoistic\nmotives in economic behavior (Bowles and Gintis 2011) and the\nfeasibility of “moral incentives” (Guevara 1977,\nLizárraga 2011), and by exploring strategies to mobilize\nsimultaneously various motivational mechanisms to sustain the proposed\nscheme. Two other worries are the following (Gilabert 2015). First,\nthe model makes no explicit provision regarding real opportunities for\nwork in self-managed firms. To cater more fully for ideals of\nself-determination and self-realization, a requirement could be added\nthat the government promote such opportunities for those willing to\ntake them. Second, the model is not sufficiently sensitive to\ndifferent individual preferences regarding leisure and consumption\n(requiring simply that everyone work full time and wind up with the\nsame consumption and leisure bundles). More flexible schedules could\nbe introduced so that people who want to consume more could work\nlonger hours and have higher salaries, while people who want to enjoy\nmore free time could work fewer hours and have lower salaries.\nConsiderations of reciprocity and equality could still be honored by\nequalizing the incomes of those working the same number of hours.\n\nMany forms of market socialism allow for some hierarchy at the point\nof production. These managerial forms are usually defended on grounds\nof greater efficiency. But they face the question of how to\nincentivize managers to behave in ways that foster innovation and\nproductivity. One way to do this is to set up a stock market that\nwould help to measure the performance of the firms they manage and to\npush them to make optimal decisions. An example of this approach\n(there are others—Corneo 2017: ch. 8) is coupon market\nsocialism. In Roemer’s (1994a) version, this economic\nsystem operates with two kinds of money: dollars (euros, pesos, etc.)\nand coupons. Dollars are used to purchase commodities for consumption\nand production, and coupons are used in a stock market to purchase\nshares in corporations. The two kinds of money are not convertible\n(with an exception to be outlined below). Each person, when reaching\nadulthood, is provided with an equal set of coupons. They can use them\nin a state-regulated stock market (directly or through mutual\ninvestment funds) to purchase shares in corporations at market price.\nThey receive the dividends from their investments in dollars, but they\ncannot cash the coupons themselves. When they die, people’s\ncoupons and shares go back to the state for distribution to new\ngenerations—no inherited wealth is allowed—and coupons\ncannot be transferred as gifts. Thus, there is no separate class of\ncapital owners in this economy. But there will be income inequality\nresulting from people’s different fortunes with their\ninvestments (dividends) as well as from the income they gain in the\njobs they take through the labor market (in managerial and\nnon-managerial positions). Coupons can however be converted into\ndollars by corporations; they can cash their shares to pay for capital\ninvestments. The exchange is regulated by a public central bank.\nFurther, public banks or public investment funds, operating with\nrelative independence from the government, would steer enterprises\nreceiving coupons so that they maximize profit in the competitive\nmarkets for the goods and services they produce (so that they maximize\nthe returns on the coupons invested). Part of that profit is also\ntaxed for direct welfare provisions by the state.\n\nThis model caters for ideals of equality of opportunity (given equal\ndistribution of coupons) and democracy (given the elimination of\ncapitalist dynasties that have the ability to transform massive\neconomic power into political influence). It also gives people freedom\nto choose how to use their resources and includes solidaristic schemes\nof public provision to meet needs regarding education and health care.\nVia the competitive markets in consumption goods and shares, it also\npromises high levels of innovation and productivity. (In some versions\nof the model this is enhanced by allowing limited forms of private\nownership of firms to facilitate the input of highly innovative\nentrepreneurial individuals—Corneo 2017: 192–7). The model\ndeparts from traditional forms of socialism by not exactly instituting\nsocial property in means of production (but rather the equal\ndispersal of coupons across individuals in each generation). But\ndefenders of this model say that socialists should not fetishize any\nproperty scheme; they should instead see such schemes instrumentally\nin terms of how well they fare in the implementation of core normative\nprinciples (such as equality of opportunity) (Roemer 1994a:\n23–4, 124–5). Critics have worries, however, that the\nmodel does not go far enough in honoring socialist principles. For\nexample, they have argued that a managerial (by contrast to a\nself-management) form of market socialism is deficient in terms of\nself-determination and self-realization at the workplace (Satz 1996),\nand that the levels of inequalities in income, and the competitive\nattitudes in the market that it would generate, violate ideals of\ncommunity (G.A. Cohen 2009). In response, a defender of coupon market\nsocialism can emphasize that the model is meant to be applied in the\nshort-term, and that further institutional and cultural arrangements\nmore fully in line with socialist principles can be introduced later\non, as they become more feasible (Roemer 1994a: 25–7, 118). A\nworry, however, is that the model may entrench institutional and\ncultural configurations which may diminish rather than enhance the\nprospects for deeper changes in the future (Brighouse 1996; Gilabert\n2011).\n4.3 Less Comprehensive, Piecemeal Reforms\n\nThe models discussed above envision comprehensive “system\nchange” in which the class division between capitalists and wage\nlaborers disappears. Socialists have also explored piecemeal reforms\nthat stop short of that structural change. An important historical\nexample is the combination of a market economy and the welfare\nstate. In this model, although property in the means of\nproduction remains private, and markets allocate most inputs and\noutputs of production, a robust governmental framework is put in place\nto limit the power of capitalists over workers and to improve the\nlife-prospects of the latter. Thus, social insurance addresses the\nrisks associated with illness, unemployment, disability, and old age.\nTax-funded, state provision of many of those goods that markets\ntypically fail to deliver for all is introduced (such as high-quality\neducation, public transportation, and health care). And collective\nbargaining gives unions and other instruments of workers’ power\nsome sway on the determination of their working conditions, as well as\nproviding an important foundation for the political agency of the\nworking class (O’Neill and White 2018).\n\nThis welfare state model was developed with great success during the\nthree decades after World War II, especially in Northern Europe, but\nalso, in weaker but significant forms, in other countries (including\nsome in the Global South). However, since the 1980s, this model has\nbeen in significant retreat, or even in crisis. Wealth and income\ninequality have been increasing dramatically during this time (Piketty\n2014; O’Neill 2017). The financial sector has become extremely\npowerful and able largely to escape governmental regulation as\nglobalization allows capital to flow across borders. A “race to\nthe bottom” features states competing with each other to attract\ninvestment by lowering tax rates and other regulations, thus\nundermining states’ ability to implement welfare policies (see,\ne.g., Dietsch 2015, 2018). Some socialists have seen this crisis as a\nreason to abandon the welfare state and pursue more comprehensive\nchanges of the kind discussed above. Others, however, have argued that\nthe model should be defended given that it has been proven to work\nquite well while the alternatives have uncertain prospects.\n\nOne example of the approach of extending or retrenching the mixed\neconomy and welfare state proposes a combination of two moves (Corneo\n2017: ch. 10, Epilogue, Appendix). The first move is to revamp the\nwelfare state by introducing mechanisms of greater accountability of\npoliticians to citizens (such as regulation of the dealings of\npoliticians with private companies, and more instances of direct\ndemocracy in order to empower citizens), an improvement of the quality\nof public services delivered by the welfare state (introducing\nexacting audits and evaluations and fostering the training and\nrecruitment of excellent civil servants), and international\ncoordination of tax policies to prevent tax competition and tax\nevasion. The second move in this proposal is to run controlled\nexperiments of market socialism to present it as a credible threat to\nthe powerful actors seeking to undermine the welfare state. This\nthreat would help stabilize the welfare state as the menace of\ncommunist revolution did after 1945. Specifically, welfare states\ncould create new institutions that would be relatively independent\nfrom governments and be run by highly competent and democratically\naccountable civil servants. “Sovereign Wealth Funds” would\ninvest public money in well-functioning enterprises, to yield an equal\n“social dividend” for citizens (on Sovereign Wealth Funds,\nsee also Cummine 2016, O’Neill and White 2019). The second\ninstitution, a “Federal Shareholder”, would go further by\nusing some of these funds to buy 51% of the shares of selected\nenterprises and take the lead within their boards of directors or\nsupervisory boards. The objective would be to show that these\nenterprises (which would include significant participation of workers\nin their management, and ethical guidelines regarding environmental\nimpacts and other concerns) maximize profits and thus offer a\ndesirable and feasible alternative to the standard capitalist\nenterprise. Effectively, this strategy would run controlled\nexperiments of shareholder market socialism. The working population\nwould learn about the feasibility of market socialism, and capitalist\nopponents of welfare entitlements would be disciplined by fear of the\ngeneralization of such experiments to settle again for the welfare\nstate.\n\nAnother strategy is to introduce various experiments seeking to\nexpand the impact of social power (as different from\nstate and economic power) within society (as defined in sect. 1). (See\nsurvey in Wright 2010: chs. 6–7). A set of mechanisms would\ntarget the deepening of democracy. Forms of direct democracy could\nfoster citizens’ deliberative engagement in decision-making, as\nexemplified by the introduction of municipal participatory budgeting\nin Porto Alegre, Brazil (which features citizens’ assemblies\nidentifying priorities for public policy). The quality of\nrepresentative democracy can be enhanced (and its subservience to the\npower of capitalists decreased) by introducing egalitarian funding of\nelectoral campaigns (e.g., by giving citizens a sum of money to\nallocate to the parties they favor, while forcing parties to choose\nbetween getting funding from that source and any other\nsource—such as corporations), and by creating random citizen\nassemblies to generate policy options which can then be subject to\nsociety-wide referenda (as in the attempt to change the electoral\nsystem in British Columbia in Canada). Finally, forms of associational\ndemocracy can be introduced that feature deliberation or bargaining\nbetween government, labor, business, and civil society groups when\ndevising national economic policies or when introducing regional or\nlocal (e.g., environmental) regulations. A second set of mechanisms\nwould foster social empowerment more directly in the economy. Examples\nare the promotion of the social economy sector featuring economic\nactivity involving self-management and production oriented to use\nvalue (as displayed, e.g., by Wikipedia and child care units in\nQuebec), an unconditional basic income strengthening people’s\nability to engage in economic activities they find intrinsically\nvaluable, and the expansion of the cooperative sector. None of these\nmechanisms on its own would make a society socialist rather than\ncapitalist. But if we see societies as complex “ecologies”\nrather than as homogeneous “organisms”, we can notice that\nthey are hybrids including diverse institutional logics. An increase\nin the incidence of social empowerment may significantly extend the\nsocialist aspects of a society, and even eventually make them dominant\n(a point to which we return in the next section).\n\nA final point worth mentioning as we close our discussion of dimension\nDII of socialism concerns the growing interest in addressing not only\nthe economic arena, but also the political and personal-private ones.\nSome scholars argue that classical socialists neglected the increasing\n“functional differentiation” of modern society into these\nthree “spheres”, concentrating in an unduly narrow way on\nthe economic one (Honneth 2015 [2017]). Thus, recent socialist work\nhas increasingly explored how to extend socialist principles to the\norganization of relatively autonomous governmental institutions and\npractices and to the shaping of intimate relationships among family\nmembers, friends, and lovers, as well as to the relations between\nthese diverse social arenas (see also Fraser 2009, 2014; Albert 2017).\nThere is, of course, also a long-standing tradition of feminist\nsocialism that has pushed for a wide scope in the application of\nsocialist ideals and a broader understanding of labor that covers\nproductive and reproductive activities beyond the formal workplace\n(see, e.g., Arruzza 2013, 2016; Dalla Costa and James 1972; Federici\n2012; Ehrenreich 1976 [2018]; Gould 1973–4; Rowbotham et al\n1979; Rowbotham 1998).\n5. Socialist Transformation (Dimension DIII)\n\nWe turn now to the last dimension of socialism (DIII), which concerns\nthe transformation of capitalist societies into socialist ones. The\ndiscussion on this dimension is difficult in at least two respects\nwhich call for philosophical exploration (Gilabert 2017a:\n113–23, 2015: 216–20). The first issue concerns\nfeasibility. The question is whether socialist systems are accessible\nfrom where we are now—whether there is a path from here to\nthere. But what does feasibility mean here? It cannot just mean\nlogical or physical possibility, as these would rule out very few\nsocial systems. The relevant feasibility parameters seem instead to\ninvolve matters of technical development, economic organization,\npolitical mobilization, and moral culture. (For some discussion on\nthese parameters see Wright 2010: ch. 8; Chibber 2017.) But such\nparameters are comparatively “soft”, in that they indicate\nprobability prospects rather than pose strict limits of possibility,\nand can be significantly changed over time. When something is not\nfeasible to do right now, we could have dynamic duties to make it\nfeasible to do later by developing our relevant capacities in the\nmeantime. The feasibility judgments must then be scalar rather than\nbinary and allow for diachronic variation. These features make them\nsomewhat murky, and not straightforwardly amenable to the hard-edged\nuse of impossibility claims to debunk normative requirements (via\ncontraposition on the principle that ought implies can).\n\nA second difficulty concerns the articulation of all things considered\nappropriate strategies that combine feasibility considerations with\nthe normative desiderata provided by socialist principles. The\nquestion here is: what is the most reasonable path of transformation\nto pursue for socialists given their understanding of the principles\nanimating their political project, viewed against the background of\nwhat seems more or less feasible to achieve at different moments, and\nwithin different historical contexts? Complex judgments have to be\nformed about the precise social systems at which it would be right to\naim at different stages of the sequence of transformation, and about\nthe specific modes of political action to deploy in such processes.\nThese judgments would combine feasibility and desirability to assess\nshort-term and long-term goals, their intrinsic costs and benefits,\nand the promise of the former to enhance the achievement of the\nlatter. The difficulty of forming such judgments is compounded by the\nuncertainty about the prospects of large societal changes (but also\nabout the long-term consequences of settling for the status quo).\n\nMarx (1875 [1978b]) himself seemed to address some of these issues in\nhis short text “The Critique of the Gotha Program” of\n1875. Marx here envisioned the process of socialist transformation as\nincluding two phases. The final phase would fully implement the\nAbilities / Needs Principle. But he did not take that\nscenario to be immediately accessible. An intermediate step should be\npursued, in which the economy would be ruled by a Contribution\nPrinciple requiring that (after some provisions are put aside to\nfulfill basic needs regarding health care, education, and support for\nthose unable to work) people gain access to consumption goods in\nproportion to how much they contribute. This lower phase of socialist\ntransformation would be reasonable because it would enhance the\nprospects of transitioning away from capitalism and of generating the\nconditions for the full realization of socialism. The implementation\nof the Contribution Principle would fulfill the promise systematically\nbroken by capitalism that people would benefit according to their\nlabor input (as in capitalism capitalists get much more, and workers\nmuch less, than they give). It would also incentivize people to\nincrease production to the level necessary for the introduction of\nsocialism proper. Once such level of development is in place, the\nsocial ethos could move away from the mantra of the “exchange of\nequivalents” and instead adopt a different outlook in which\npeople produce according to their diverse abilities, and consume\naccording to their diverse needs. This sequential picture of\ntransformation features diachronic judgments about changes in\nfeasibility parameters (such as the expansion of technical capacity\nand a change in patterns of motivation). Marx also envisioned\npolitical dimensions of this process, including a “dictatorship\nof the proletariat” (which would not, as some popular\ninterpretations hold, involve violation of civil and political rights,\nbut a change in the political constitution and majoritarian policies\nthat secure the elimination of capitalist property rights (Elster\n1985: 447–9)). In time, the state (understood as an apparatus of\nclass rule rather than, more generally, as an administrative device)\nwould “wither away”.\n\nHistory has not moved smoothly in the direction many socialists\npredicted. It has not been obvious that the following steps in the\nexpected pattern materialized or are likely to do so: capitalism\ngenerating a large, destitute, and homogeneous working class; this\nclass responding to some of the cyclical crises capitalism is prone to\nby creating a coherent and powerful political movement; this movement\ngaining control of government and resolutely and successfully\nimplementing a socialist economic system (G.A. Cohen 2000b: ch.6;\nLaclau and Mouffe 1985). Given the fact that this process did not\nmaterialize, and seems unlikely to do so, it turns out that it would\nbe both self-defeating and irresponsible to fail to address difficult\nquestions about the relative feasibility and moral desirability of\ndifferent strategies of potential socialist transformation. For\nexample, if the process of transformation involves two or more stages\n(be they the two mentioned above, or some sequence going, say, from\nthe welfare state to shareholder or coupon market socialism and then\nto the Carensian model), it might be asked who is to evaluate and\ndecide upon what is to be done at each stage of the process, on what\ngrounds can it be expected that earlier stages will enhance the\nlikelihood of the success of later stages rather than undermine them\n(e.g., by enshrining institutions or values that will make it hard to\nmove further along the path), what transitional costs can be accepted\nin earlier stages, and whether the costs expected are outweighed by\nthe desirability and the increased probability of attaining the later\nstages. Such questions do not want for difficulty.\n\nAddressing questions such as these dilemmas of transitional strategy,\nsocialists have envisaged different approaches to social and political\ntransformation. Four significant examples (extensively discussed in\nWright 2010: Part III, 2015b, 2016—which we follow here) are\narticulated by considering two dimensions of analysis regarding (a)\nthe primary goal of the strategy (either (i) transcending the\nstructures of capitalism, or (ii) neutralizing the worst harms of it)\nand (b) the primary target of the strategy (either (i) the state and\nother institutions at the macro-level of the system, or (ii) the\neconomic activities of individuals, organizations, and\ncommunities).\n\nThe first strategy, smashing capitalism, picks out the\ncombination of possibilities (a.i) and (b.i). A political organization\n(e.g., a revolutionary party) takes advantage of some of the crises\ngenerated by capitalism to seize state power, proceeding to use that\npower to counter opposition to the revolution and to build a socialist\nsociety. This is the strategy favored by revolutionary socialists and\nmany Marxists, and pursued in the twentieth century in countries such\nas Russia and China. If we look at the historical evidence, we see\nthat although this strategy succeeded in some cases in transitioning\nout of previously existing capitalist or proto-capitalist economic\nsystems, it failed in terms of building socialism. It led instead to a\nform of authoritarian statism. There is debate about the causes of\nthese failures. Some factors may have been the economically backward\nand politically hostile circumstances in which the strategy was\nimplemented, the leaders’ deficits (in terms of their tactics or\nmotives), and the hierarchical frameworks used to suppress opposition\nafter the revolution which remained in place for the long-term to\nsubvert revolutionaries’ aims. Large system changes normally\nhave to face a “transitional trough” after their onset, in\nwhich the material interests of many people are temporarily set back\n(Przeworski 1985). A political dilemma arises, in that, if liberal\ndemocratic politics is retained (with a free press, liberty of\nassociation, and multiparty elections) the revolutionaries may be\nunseated due to citizens’ political response to the\n“valley of transition”, while if liberal democratic\npolitics are supplanted, then authoritarian statism may be the\nconsequence, eradicating the possibility of a socialist outcome to\nwhich it would be worthwhile to seek to transition.\n\nA second strategy, picking out the combination of possibilities (a.ii)\nand (b.i), has been taming capitalism. It mobilizes the\npopulation (sometimes in sharp political struggles) to elect\ngovernments and implement policies that respond to the worst harms\ngenerated by capitalism, with the aim of neutralizing them. New\npolicies include social insurance responding to risks faced by the\npopulation (e.g., illness and unemployment), tax funded, state\nprovision of public goods which markets tend to fail to provide (e.g.,\neducation, public transportation, research and development, etc.), and\nregulation of negative externalities produced in markets (e.g.,\nregarding pollution, product and workplace hazards, predatory market\nbehavior, etc.). The strategy, implemented by social-democratic\nparties, worked quite well during the three decades of the\n“Golden Age” or Trente Glorieuses following World\nWar II. However, progress was halted and partly rolled back since the\nretreat of social democracy and the introduction of neoliberalism in\nthe 1980s. Possible explanatory factors are the financialization of\ncapitalism, and the effects of globalization, as discussed above in\n section 4.3.\n There is a debate as to whether capitalism is really tamable—it\nmay be that the Golden Age was only a historical anomaly, borne out of\na very particular set of political and economic circumstances.\n\nThe third strategy, escaping capitalism, picks out the\ncombination of possibilities (a.ii) and (b.ii). Capitalism might be\ntoo strong to destroy. But people could avoid its worst harms by\ninsulating themselves from its dynamics. They could focus on family\nand friendships, become self-subsistence farmers, create intentional\ncommunities, and explore modes of life involving “voluntary\nsimplicity”. However, this strategy seems available mostly to\nrelatively well-off people who can fund their escape with wealth they\nhave amassed or received from capitalist activities. The working poor\nmay not be so lucky.\n\nThe final strategy, eroding capitalism, picks out the\ncombination of (a.i) and (b.ii). Economic systems are here seen as\nhybrids. People can introduce new, socialist forms of collective\nactivity (such as worker cooperatives) and progressively expand them,\neventually turning them from marginal to dominant. Recently this kind\nof strategy of the erosion of capitalism through institutional\ntransformation rather than piecemeal changes within existing economic\nstructures, has been referred to as “the institutional\nturn” in leftist political economy (see Guinan and O’Neill 2018). Wright (2015b, 2016) suggests the analogy of a lake ecosystem, with the introduction\nof a new species of fish that at first thrives in one location, and\nthen spreads out, eventually becoming a dominant species.\nHistorically, the transformation from feudalism to capitalism in some\nparts of Europe has come about in this way, with pockets of\ncommercial, financial, and manufacturing activity taking place in\ncities and expanding over time. Some anarchists seem to hold a version\nof this strategy today. It offers hope for change even when the state\nseems uncongenial, and likely to remain so. But critics find it\nfar-fetched, as it seems unlikely to go sufficiently far given the\nenormous economic and political power of large capitalist corporations\nand the tendency of the state to repress serious threats to its rules.\nTo go further, the power of the state has to be at least partially\nrecruited. The fourth strategy then, according to Wright, is only\nplausible when combined with the second.\n\nAs discussed by Wright, this combined strategy would have two elements\n(we could see Corneo’s proposal discussed in\n section 4.3\n as another version of this approach). First, it would address some\nimportant, problematic junctures to expand state action in ways that\neven capitalists would have to accept. And second, the solutions to\nthe crises introduced by state action would be selected in such a way\nthat they would enhance long-term prospects for socialist change. One\ncritical juncture is global warming, and the social and political\nproblems of the Anthropocene era (Löwy 2005; Purdy 2015; Wark\n2016). Responding to its effects would require massive generation of\nstate-provided public goods, which could remove neoliberal\ncompunctions about state activism. A second critical juncture concerns\nthe large levels of long-term unemployment, precariousness, and\nmarginalization generated by new trends in automation and information\ntechnology. This involves threats to social peace, and insufficient\ndemand for the products corporations need to sell on the consumption\nmarket. Such threats could be averted by introducing an unconditional\nbasic income policy (Van Parijs and Vanderborght 2017), or by the\nsignificant expansion of public services, or by some other mechanism\nthat secures for everybody a minimally dignified economic condition\nindependent of their position within the labor market. Now, these\nstate policies could foster the growth of social power and the\nprospects for socialist change in the future. Workers would have more\npower in the labor market when they came to be less reliant upon it.\nThey could also be more successful in forming cooperatives. The social\neconomy sector could flourish under such conditions. People could also\ndevote more time to political activism. Together, these trends from\nbelow, combined with state activism from above, could expand knowledge\nabout the workability of egalitarian, democratic, and solidaristic\nforms of economic activity, and strengthen the motivation to extend\ntheir scope. Although some critics find this strategy naïve\n(Riley 2016), proponents think that something like it must be tried if\nthe aim is democratic socialism rather than authoritarian statism.\n(For specific worries about the political feasibility of a robust\nuniversal basic income policy as a precursor to rather than as a\nresult of socialism, see Gourevitch and Stanczyk 2018).\n\nOther significant issues regarding dimension DIII of socialism are the\nidentification of appropriate political agents of change and their\nprospects of success in the context of contemporary globalization. On\nthe first point, socialists increasingly explore the significance not\nonly of workers’ movements, but also their intersection with the\nefforts of activists focused on overcoming gender- and race-based\noppression (Davis 1981; Albert 2017). Some argue that the primary\naddressee of socialist politics should not be any specific class or\nmovement, but the more inclusive, and politically equal group of\ncitizens of a democratic community. For example, Honneth (2015 [2017:\nch. IV]), following in part John Dewey and Juergen Habermas, argues\nthat the primary addressee and agent of change for socialism should be\nthe citizens assembled in the democratic public sphere. Although\nnormatively appealing, this proposal may face serious feasibility\ndifficulties, as existing democratic arenas are intensely contaminated\nand disabled by the inequalities socialists criticize and seek to\novercome. The second issue is also relevant here. There is a\ntraditional question whether socialism is to be pursued in one country\nor internationally. The tendency to embrace an internationalist\nhorizon of political change is characteristic among socialists as they\ntypically see their ideals of freedom, equality, and solidarity as\nhaving global scope, while they also note that, as a matter of\nfeasibility, the increasing porousness of borders for capitalist\neconomic activity make it the case that socialist politics may not go\nvery far in any country without reshaping the broader international\ncontext. A difficulty here is that despite the existence of\ninternational social movements (including workers’ movements,\ninternational NGOs, human rights institutions and associations, and\nother actors), institutional agency beyond borders that can seriously\ncontest capitalist frameworks is not currently very strong. In\naddressing these difficulties, action and research on socialist\njustice must interact with ongoing work in the related areas of\ngender, race, democracy, human rights, and global\n justice.[2]\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Akyeampong, Emmanuel, 2018, “African Socialism; or, the\nSearch for an Indigenous Model of Economic Development?”,\n<em>Economic History of Developing Regions</em>, 33(1): 69–87.\ndoi:10.1080/20780389.2018.1434411",
                "Albert, Michael, 2003, <em>Parecon: Life After Capitalism</em>,\nLondon: Verso.",
                "–––, 2017, <em>Practical Utopia: Strategies for\na Desirable Society</em>, Oakland: PM Press.",
                "ANC (African National Congress), 1955, <em>The Freedom Charter:\nAdopted at the Congress of the People at Kliptown, Johnannesburg, on\nJune 25 and 26, 1955</em>.\n [<a href=\"http://www.historicalpapers.wits.ac.za/inventories/inv_pdfo/AD1137/AD1137-Ea6-1-001-jpeg.pdf\" target=\"other\">ANC 1955 available online</a>,\n from Wits Historical Papers, University of Witwatersrand.]",
                "Aricó, José, 2017, <em>José Aricó:\ndilemas del marxismo en América Latina, antología\nesencial</em>, Martín Cortés (ed.), Buenos Aires:\nCLACSO.\n [<a href=\"https://www.clacso.org.ar/antologias/detalle.php?id_libro=1312\" target=\"other\">Aricó 2017 available online</a>]",
                "Arneson, Richard, 2016, “Exploitation, Domination,\nCompetitive Markets, and Unfair Division: Exploitation, Domination,\nCompetitive Markets, Unfair Division”, <em>The Southern Journal\nof Philosophy</em>, 54(S1-Exploitation): 9–30.\ndoi:10.1111/sjp.12182",
                "Arnold, Samuel, 2012, “The Difference Principle at\nWork”, <em>Journal of Political Philosophy</em>, 20(1):\n94–118. doi:10.1111/j.1467-9760.2010.00393.x",
                "–––, 2017, “Capitalism, Class Conflict,\nand Domination”, <em>Socialism and Democracy</em>, 31(1):\n106–124. doi:10.1080/08854300.2016.1215810",
                "Arnsperger, Christian and Philippe Van Parijs, 2003,\n<em>Éthique économique et sociale</em>, Paris: La\nDécouverte.",
                "Arruzza, Cinzia, 2013, <em>Dangerous Liaisons: The Marriages and\nDivorces of Marxism and Feminism</em>, (IIRE Notebook for Study and\nResearch 55), Pontypool, Wales: Merlin Press.",
                "–––, 2016, “Functionalist, Determinist,\nReductionist: Social Reproduction Feminism and Its Critics”,\n<em>Science &amp; Society</em>, 80(1): 9–30.\ndoi:10.1521/siso.2016.80.1.9",
                "Barry, Brian, 2005, <em>Why Social Justice Matters</em>,\nCambridge: Polity.",
                "Blackburn, Robin, 2011, “Reclaiming Human Rights: Review of\n<i>The Last Utopia</i> by Samuel Moyn”, <em>New Left\nReview</em>, 69(May/June): 126–138.\n [<a href=\"https://newleftreview.org/issues/II69/articles/robin-blackburn-reclaiming-human-rights\" target=\"other\">Blackburn 2011 available online</a>]",
                "Boltanski, Luc and Eve Chiapello, 2018, <em>The New Spirit of\nCapitalism</em>, London: Verso.",
                "Bowles, Samuel and Herbert Gintis, 1986, <em>Democracy and\nCapitalism: Property, Community and the Contradictions of Modern\nSocial Thought</em>, New York: Routledge.",
                "–––, 2011, <em>A Cooperative Species: Human\nReciprocity and Its Evolution</em>, Princeton, NJ: Princeton\nUniversity Press. doi:10.23943/princeton/9780691151250.001.0001",
                "Brennan, Jason, 2014, <em>Why Not Capitalism?</em> New York:\nRoutledge.",
                "Brighouse, Harry, 1996, “Transitional and Utopian Market\nSocialism”, in Wright 1996: 187–208.",
                "Carens, Joseph H., 1981, <em>Equality, Incentives, and the Market:\nAn Essay in Utopian Politico-Economic Theory</em>, Chicago: University\nof Chicago Press.",
                "–––, 2003, “An Interpretation and Defense\nof the Socialist Principle of Distribution”, <em>Social\nPhilosophy and Policy</em>, 20(1): 145–177.\ndoi:10.1017/S0265052503201072",
                "Castoriadis, Cornelius, 1979, <em>Le Contenu du Socialisme</em>,\nParis: Éditions 10/18.",
                "Chakrabarty, Bidyut, 2014, <em>Communism in India: Events,\nProcesses and Ideologies</em>, New Delhi: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199974894.001.0001",
                "–––, 2018, <em>Left Radicalism in India</em>,\nNew York: Routledge",
                "Chibber, Vivek, 2017, “Rescuing Class from the Cultural\nTurn”, <em>Catalyst</em>, 1(1).",
                "Cohen, G. A., 1988, <em>History, Labour, and Freedom</em>, Oxford:\nOxford University Press.",
                "–––, 1995, <em>Self-ownership, Freedom, and\nEquality</em>, Cambridge: Cambridge University Press.",
                "–––, 2000a, <em>Karl Marx’s Theory of\nHistory: A Defense</em>, expanded edition, Princeton: Princeton\nUniversity Press.",
                "–––, 2000b, <em>If You’re an Egalitarian,\nHow Come You’re So Rich?</em> Cambridge, MA: Harvard University\nPress.",
                "–––, 2008, <em>Rescuing Justice and\nEquality</em>, Cambridge, MA: Harvard University Press.",
                "–––, 2009, <em>Why Not Socialism?</em>\nPrinceton: Princeton University Press.",
                "–––, 2011, <em>On the Currency of Egalitarian\nJustice and Other Essays in Political Philosophy</em>, Princeton:\nPrinceton University Press.",
                "Cohen, Joshua, 1989, “The Economic Basis of Deliberative\nDemocracy”, <em>Social Philosophy and Policy</em>, 6(2):\n25–50. doi:10.1017/S0265052500000625",
                "Cohen, Joshua and Joel Rogers, 1995, <em>Associations and\nDemocracy: The Real Utopias Project, Volume 1</em>, London:\nVerso.",
                "Cole, G. D. H., 1929, <em>The Next Ten Years in British Social and\nEconomic Policy</em>, London: Routledge.",
                "Collins, Hugh, Gillian Lester, and Virginia Mantouvalou (eds.),\n2018, <em>Philosophical Foundations of Labour Law</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/oso/9780198825272.001.0001",
                "Corneo, Giacomo, 2017, <em>Is Capitalism Obsolete? A Journey\nthrough Alternative Economic Systems</em>, Cambridge, MA: Harvard\nUniversity Press.",
                "Coutrot, Thomas, 2018, <em>Libérer le travail</em>, Paris:\nSeuil.",
                "Cummine, Angela, 2016, <em>Citizens’ Wealth</em>, New Haven,\nCT: Yale University Press.",
                "Dalla Costa, Mariarosa and Selma James, 1972, <em>The Power of\nWomen &amp; the Subversion of Community</em>, Bristol: Falling Wall\nPress Ltd.\n (<a href=\"http://libcom.org/library/power-women-subversion-community-della-costa-selma-james\" target=\"other\">Dalla Costa and James 1972 available online</a>)",
                "Dardot, Pierre and Christian Laval, 2014, <em>Commun. Essai sur la\nrévolution au XXIe siècle</em>, Paris: La\nDécouverte.",
                "Davis, Angela, 1981, <em>Women, Race and Class</em>, New York:\nRandom House.",
                "Dietsch, Peter, 2015, <em>Catching Capital: The Ethics of Tax\nCompetition</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190251512.001.0001",
                "–––, 2018, “The State and Tax Competition:\nA Normative Perspective”, in <em>Taxation: Philosophical\nPerspectives</em>, Martin O’Neill and Shepley Orr (eds.), Oxford:\nOxford University Press, chapter 12.",
                "Dussel, Enrique, 1998, <em>Etica de la liberación</em>,\nMadrid: Trotta.",
                "Edmundson, William A., 2017, <em>John Rawls: Reticent\nSocialist</em>, Cambridge: Cambridge University Press.",
                "Ehrenreich, Barbara, 1976 [2018], “What is Socialist\nFeminism?” <em>WIN Magazine</em>. Reprinted with a new\nintroduction in <em>Jacobin</em>, 07.30.2018.\n [<a href=\"https://jacobinmag.com/2018/07/socialist-feminism-barbara-ehrenreich\" target=\"other\">Ehrenreich 1976 [2018] available online</a>]",
                "Einstein, Albert, 1949, “Why Socialism?”, <em>Monthly\nReview</em>, 1. Reprinted in 2009, <em>Monthly Review</em>, 61(1):\n55–61. doi:10.14452/MR-061-01-2009-05_7",
                "Elster, Jon, 1985, <em>Making Sense of Marx</em>, Cambridge:\nCambridge University Press.",
                "–––, 1986, <em>An Introduction to Karl\nMarx</em>, Cambridge, Cambridge University Press.",
                "–––, 1989, “Self-Realization in Work and\nPolitics: The Marxist Conception of the Good Life”, in Elster\nand Moene 1989: 127–158.",
                "Elster, Jon and Karl Ove Moene (eds.), 1989, <em>Alternatives to\nCapitalism</em>, Cambridge: Cambridge University Press.",
                "Fanon, Frantz, 1952, <em>Peau noire, masques blancs</em>, Paris:\nSeuil.",
                "–––, 1961, <em>Les damnés de la\nterre</em>, Paris: Maspero.",
                "Federici, Silvia, 2012, <em>Revolution at Point Zero: Housework,\nReproduction and Feminist Struggle</em>, Oakland, CA: MP Press.",
                "Fleurbaey, Marc, 2006,<em>Capitalisme ou démocratie?\nL'alternative du XXIe siècle</em>, Paris: Grasset &amp;\nFasquelle.",
                "Forst, Rainer, 2017, “Noumenal Alienation: Rousseau, Kant\nand Marx on the Dialectics of Self-Determination”, <em>Kantian\nReview</em>, 22(4): 523–551. doi:10.1017/S1369415417000267",
                "Frega, Roberto, Lisa Herzog, and Christian Neuhäuser, 2019,\n“Workplace Democracy—The Recent Debate”,\n<em>Philosophy Compass</em>, 14(4): e12574.\ndoi:10.1111/phc3.12574",
                "Fraser, Nancy, 2009, “Feminism, Capitalism and the Cunning\nof History”, <em>New Left Review</em>, 56(Mar/Apr): 97–117.\n [<a href=\"https://newleftreview.org/issues/II56/articles/nancy-fraser-feminism-capitalism-and-the-cunning-of-history\" target=\"other\">Fraser 2009 available online</a>]",
                "–––, 2014, “Behind Marx’s Hidden Abode:\nFor an Expanded Conception of Capitalism”, <em>New Left\nReview</em>, 86(Mar/Apr): 55–72.\n [<a href=\"https://newleftreview.org/issues/II86/articles/nancy-fraser-behind-marx-s-hidden-abode\" target=\"other\">Fraser 2014 available online</a>]",
                "Fraser, Nancy and Rahel Jaeggi, 2018, <em>Capitalism</em>,\nCambridge: Polity.",
                "Gargarella, Roberto, 2010, <em>The Legal Foundations of\nInequality: Constitutionalism in the Americas, 1776–1860</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511750618",
                "Geras, Norman, 1985, “The Controversy about Marx and\nJustice”, <em>New Left Review</em>, 1/150(Mar/Apr): 47–85.\n [<a href=\"https://newleftreview.org/issues/I150/articles/norman-geras-the-controversy-about-marx-and-justice\" target=\"other\">Geras 1985 available online</a>]",
                "Getachew, Adom, 2019, <em>Worldmaking after Empire: The Rise and\nFall of Self-Determination</em>, Princeton, NJ: Princeton University\nPress. doi:10.23943/princeton/9780691179155.001.0001",
                "Gilabert, Pablo, 2011, “Debate: Feasibility and\nSocialism”, <em>Journal of Political Philosophy</em>, 19(1):\n52–63. doi:10.1111/j.1467-9760.2010.00383.x",
                "–––, 2012, “Cohen on Socialism, Equality\nand Community”, <em>Socialist Studies/Études\nSocialistes</em>, 8: 101–121. doi:10.18740/S4W019",
                "–––, 2015, “The Socialist Principle\n‘From Each According To Their Abilities, To Each According To\nTheir Needs’”, <em>Journal of Social\nPhilosophy</em>, 46(2): 197–225. doi:10.1111/josp.12096",
                "–––, 2017a, “Justice and Feasibility: A\nDynamic Approach”, in <em>Political Utopias: Contemporary\nDebates</em>, Michael Weber and Kevin Vallier (eds.), Oxford: Oxford\nUniversity Press, 95–126.\ndoi:10.1093/acprof:oso/9780190280598.003.0006",
                "–––, 2017b, “Kantian Dignity and Marxian\nSocialism”, <em>Kantian Review</em>, 22(4): 553–577.\ndoi:10.1017/S1369415417000279",
                "–––, 2018a, <em>Human Dignity and Human\nRights</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198827221.001.0001",
                "–––, 2018b, “Dignity at Work”, in\nCollins, Lester, and Mantouvalou 2018: 68–86.",
                "Goodin, Robert, 1987, “Exploiting a Person and Exploiting a\nSituation”, in <em>Modern Theories of Exploitation</em>, Andrew\nReeve (ed.), London: SAGE, 166–200.",
                "Gould, Carol C., 1973–4, “The Woman Question:\nPhilosophy of Liberation and the Liberation of Philosophy”,\n<em>Philosophical Forum</em>, 5: 5–44.",
                "–––, 1981, “Socialism and\nDemocracy”, <em>Praxis International</em>, 1: 49–63.",
                "–––, 1988, <em>Rethinking Democracy: Freedom and\nSocial Cooperation in Politics, Economy, and Society</em>, Cambridge:\nCambridge University Press.",
                "Gourevitch, Alex, 2013, “Labor Republicanism and the\nTransformation of Work”, <em>Political Theory</em>, 41(4):\n591–617. doi:10.1177/0090591713485370",
                "Gourevitch, Alex and Lucas Stanczyk, 2018, “The Basic Income\nIllusion”, <em>Catalyst</em>, 1(4).",
                "Guevara, Ernesto, 1977, <em>El Socialismo y El Hombre Nuevo</em>,\nMexico DF: Siglo XXI.",
                "Guinan, Joe and Martin O'Neill, 2018, “The Institutional\nTurn: Labour’s New Political Economy”, <em>Renewal: A Journal\nof Social Democracy</em>, 26(2): 5–16.\n [<a href=\"http://www.renewal.org.uk/articles/the-institutional-turn-labours-new-political-economy\" target=\"other\">Guinan and O'Neill 2018 available online</a>]",
                "Harnecker, Marta, 2015, <em>A World to Build. New Paths towards\nTwenty-First Century Socialism</em>, New York: Monthly Review\nPress.",
                "Holmstrom, Nancy, 1977, “Exploitation”, <em>Canadian\nJournal of Philosophy</em>, 7(2): 353–369.\ndoi:10.1080/00455091.1977.10717024",
                "Honneth, Axel, 2015 [2017], <em>Die Idee des Sozialismus. Versuch\neiner Aktualisierung</em>, Berlin: Suhrkamp Verlag. Translated as\n<em>The Idea of Socialism: Towards a Renewal</em>, Joseph Ganahl\n(trans.), Cambridge: Polity.",
                "Jaeggi, Rahel, 2014, <em>Alienation</em>, New York: Columbia\nUniversity Press.",
                "James, C. L. R., 1984, <em>At the Rendezvous of Victory: Selected\nWritings</em>, London: Allison and Busby.",
                "–––, 2001, <em>The Black Jacobins: Toussaint\nL'ouverture and the San Domingo Revolution</em>, new edition. London:\nPenguin Books [original publication 1938]",
                "Keat, Russell and John O’Neill, 2011, “Socialism”,\nin <em>Routledge Encyclopedia of Philosophy</em>, London: Routledge.\ndoi:10.4324/9780415249126-S058-2",
                "Keynes, John Maynard, 1930/1931 [2010], “Economic\n\nPossibilities for Our Grandchildren”, <em>The Nation and\n\nAthenaeum)</em> and reprinted in his, 1931, <em>Essays in\nPersuasion</em>. Reprinted 2010, London: Palgrave Macmillan UK, 2010,\n321–332. doi:10.1007/978-1-349-59072-8_25",
                "Kołakowski, Leszek, 1974 [2008], <em>Main Currents of\n\nMarxism</em>, London: W. W. Norton &amp; Company.",
                "Laclau, Ernesto, and Mouffe, Chantal, 1985, <em>Hegemony and\nSocialist Strategy</em>, London: Verso.",
                "Lal, Priya, 2015, <em>African Socialism in Postcolonial Tanzania:\nBetween the Village and the World</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781316221679",
                "Le Bot, Yvon, 1997, <em>Subcomandante Marcos. El sueño\nZapatista. Entrevistas con el Subcomandante Marcos, el mayor\nMoisés y el comandante Tacho, del Ejército Zapatista de\nLiberación Nacional</em>, Barcelona: Plaza &amp;\nJanés.",
                "Leopold, David, 2018, “Alienation”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2018 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2018/entries/alienation/\" target=\"other\">https://plato.stanford.edu/archives/fall2018/entries/alienation/</a>&gt;",
                "Lewis, Su Lin, 2019, “Asian Socialists and the\nForgotten Architects of Post-Colonial Freedom, 1952–56”, <em>Journal of\nWorld History</em>, 30 (1&amp;2): 55–88.",
                "Lizárraga, Fernando, 2011, <em>El marxismo y la justicia\nsocial. La idea de igualdad en Ernesto Che Guevara</em>, Chile:\nEscaparate Ediciones.",
                "Lohia, Ram Manohar, 1963, <em>Marx, Gandhi and Socialism</em>,\nHyderabad: Navahind.",
                "Löwy, Michel, 2005, <em>Ecosocialism. A Radical Alternative\nto Capitalist Catastrophe</em>, Chicago, IL: Haymarket Books.",
                "Lukes, Steven, 1985, <em>Marxism and Morality</em>, Oxford: Oxford\nUniversity Press.",
                "Malleson, Tom, 2014, <em>After Occupy: Economic Democracy for the\n21st Century</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199330102.001.0001",
                "Manley, Michael, 1990, <em>The Politics of Change: a Jamaican\nTestament</em>, Washington DC: Howard University Press [first\npublished 1974]",
                "–––, 1991, <em>The Poverty of Nations:\nReflections on Underdevelopment and the World Economy</em>, London:\nPluto Press.",
                "Mariátegui, José Carlos, 1928, <em>Siete Ensayos de\nInterpretación de la Realidad Peruana</em>, Caracas,\nVenezuela.",
                "–––, 2010, <em>La tarea americana</em>, Buenos\nAires: Prometeo.",
                "Marx, Karl, 1857–8 [1973], <em>Grundrisse</em>, London:\nPenguin. Original composition 1857–8.",
                "–––, 1844 [1978a], “Economic and\nPhilosophic Manuscript of 1844”, in in <em>The Marx-Engels\nReader</em>, R. Tucker (ed.), second edition, New York: Norton,\n66–125. Original composition 1844.",
                "–––, 1875 [1978b], “Critique of the Gotha\nProgram”, in <em>The Marx-Engels Reader</em>, R. Tucker (ed.),\nsecond edition, New York: Norton, 525–541. Original composition\n1875.",
                "–––, 1867 [1990], <em>Capital 1</em>, London:\nPenguin. Original publication 1867.",
                "–––, 1991, <em>Capital 3</em>, London: Penguin.\nOriginal composition: incomplete manuscript later edited and released\nby Friedrich Engels.",
                "Meade, James, 1948, <em>Planning and the Price Mechanism</em>,\nLondon: Routledge.",
                "–––, 1964, <em>Efficiency, Equality and the\nOwnership of Property</em>, London: Routledge.",
                "–––, 1967, <em>An Intelligent Radical’s\nGuide to Economic Policy</em>, London: Routledge.",
                "Meiksins Wood, Ellen, 1995, <em>Democracy Against Capitalism:\nRenewing Historical Materialism</em>, Cambridge: Cambridge University\nPress. Reprinted by Verso in 2016.",
                "Mill, John Stuart, 2008, <em>Principles of Political Economy and\nChapters on Socialism</em>, Jonathan Riley (ed.), Oxford: Oxford\nUniversity Press. [<em>Principles of Political Economy</em> originally\npublished 1848; <em>Chapters on Socialism</em> originally published\n1879]",
                "–––, 1873 [2018], <em>Autobiography</em>,\nOxford: Oxford University Press. [originally published 1873]",
                "Morsink, Johannes, 1999, <em>The Universal Declaration of Human\nRights. Origins, Drafting and Intent</em>, Philadelphia, PA:\nUniversity of Pennsylvania Press.",
                "Narayan, Jayaprakash, 1980, <em>A Revolutionary's Quest: Selected\nWritings of Jayaprakash Narayan</em>, Bimal Prasad (ed.), New Delhi:\nOxford University Press.",
                "Negri, Antonio, 2008, <em>Goodbye Mr. Socialism</em>, New York:\nSever Stories Press.",
                "Nell, Edward and Onora O’Neill, 1992 [2003], “Justice\nUnder Socialism”, in <em>Transformational Growth and Effective\nDemand</em>, by Edward J. Nell, London: Palgrave Macmillan UK,\n663–674. Reprinted in <em>Justice</em>, fourth edition, J. Sterba\n(ed.), Toronto: Thomson-Wadsworth, 2003, 77–85.\ndoi:10.1007/978-1-349-21779-3_28",
                "Nielsen, Kai, 1985, <em>Equality and Liberty</em>, Totowa, NJ:\nRowman &amp; Allanheld.",
                "Nkrumah, Kwame, 1961, <em>I Speak of Freedom: a Statement of\nAfrican Ideology</em>, New York: Frederick A. Praeger.",
                "–––, 1963, <em>Africa Must Unite</em>, New York:\nInternational.",
                "–––, 1965, <em>Neocolonialism: The Last Stage of\nImperialism</em>, New York: Internationalism.",
                "Nove, Alec, 1991, <em>The Economics of Feasible Socialism\nRevisited</em>, London: Harper Collins.",
                "–––, 2008, “Socialism”, in <em>The\nNew Palgrave Dictionary of Economics</em>, Steven N. Durlauf and\nLawrence E. blume (eds.), London: Palgrave Macmillan UK.\ndoi:10.1057/978-1-349-95121-5_1718-2",
                "Nyerere, Julius, 1967, <em>Freedom and Unity: A Selection from\nWritings and Speeches 1952–1965</em>, Dar es Salaam: Oxford\nUniversity Press.",
                "–––, 1968a, <em>Freedom and Socialism: A\nSelection from Writings and Speeches 1965–1967</em>, Dar es\nSalaam: Oxford University Press.",
                "–––, 1968b, <em>Ujamaa: Essays on\nSocialism</em>, London: Oxford University Press.",
                "O’Neill, Martin, 2008a, “What Should Egalitarians\nBelieve?”, <em>Philosophy &amp; Public Affairs</em>, 36(2):\n119–156. doi:10.1111/j.1088-4963.2008.00130.x",
                "–––, 2008b, “Three Rawlsian Routes towards\nEconomic Democracy”, <em>Revue de Philosophie\nÉconomique</em>, 9(1): 29–55",
                "–––, 2012, “Free (and Fair) Markets\nwithout Capitalism. Political Values, Principles of Justice, and\nProperty-Owning Democracy”, in O’Neill and Williamson\n2012: 75–100.",
                "–––, 2017, “Survey Article: Philosophy and\nPublic Policy after Piketty”, <em>Journal of Political\nPhilosophy</em>, 25(3): 343–375. doi:10.1111/jopp.12129",
                "O’Neill, Martin and Stuart White, 2018, “Trade Unions\nand Political Equality”, Collins, Lester, and Mantouvalou 2018:\n252–268. ",
                "–––, 2019, “James Meade, Public Ownership,\nand the Idea of a Citizens’ Trust”, <em>International Journal\nof Public Policy</em>, 15(1/2): 23–37.\ndoi:10.1504/IJPP.2019.099052",
                "O’Neill, Martin and Thad Williamson (eds.), 2012,\n<em>Property-Owning Democracy: Rawls and Beyond</em>, Oxford:\nWiley-Blackwell. doi:10.1002/9781444355192",
                "Pateman, Carole, 1970, <em>Participation and Democratic\nTheory</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511720444",
                "Pecchi, Lorenzo and Gustavo Piga (eds), 2010, <em>Revisiting\nKeynes</em>, Cambridge, MA: MIT Press.",
                "Peffer, Rodney, 1990, <em>Marxism, Morality, and Social\nJustice</em>, Princeton: Princeton University Press.",
                "Piketty, Thomas, 2014, <em>Capitalism in the Twenty-First\nCentury</em>, Cambridge, MA: Harvard University Press.",
                "Przeworski, Adam, 1985, <em>Capitalism and Social Democracy</em>,\nCambridge: Cambridge University Press.",
                "Purdy, Jedediah, 2015, <em>After Nature: A Politics for the\nAnthropocene</em>, Cambridge, MA: Harvard University Press.",
                "Rappoport, Angelo, 1924, <em>Dictionary of Socialism</em>, London:\nT. Fischer Unwin.",
                "Rawls, John, 2001, <em>Justice as Fairness. A Restatement</em>,\nCambridge, MA: Harvard University Press.",
                "Reiman, Jeffrey, 1987, “Exploitation, Force, and the Moral\nAssessment of Capitalism: Thoughts on Roemer and Cohen”,\n<em>Philosophy and Public Affairs</em>, 16(1): 3–41.",
                "Riley, Dylan, 2016, “An Anticapitalism That Can Win”,\n<em>Jacobin</em>, 1.7.16.\n (<a href=\"https://www.jacobinmag.com/2016/01/olin-wright-real-utopias-socialism-capitalism-gramsci-lenin-luxemburg/\" target=\"other\">Riley 2016 available online</a>)",
                "Roemer, John E. (ed.), 1986, <em>Analytical Marxism</em>,\nCambridge: Cambridge University Press.",
                "–––, 1994a, <em>A Future for Socialism</em>,\nCambridge, MA: Harvard University Press.",
                "–––, 1994b, <em>Egalitarian Perspectives: Essays\nin Philosophical Economics</em>, Cambridge: Cambridge University\nPress. doi:10.1017/CBO9780511528293",
                "–––, 2017, “Socialism Revised”,\n<em>Philosophy &amp; Public Affairs</em>, 45(3): 261–315.\ndoi:10.1111/papa.12089",
                "Ronzoni, Miriam, 2018, “How Social Democrats May Become\nReluctant Radicals: Thomas Piketty’s <i>Capital</i> and Wolfgang\nStreeck’s <i>Buying Time</i>”, <em>European Journal of\nPolitical Theory</em>, 17(1): 118–127.\ndoi:10.1177/1474885115601602",
                "Rowbotham, Sheila, 1998, “Dear Dr. Marx: A Letter from a\nSocialist Feminist”, in <em>The Communist Manifesto Now.\nSocialist Register 1998</em>, Leo Panitch (ed.), London: Merlin Press,\n1-17.",
                "Rowbotham, Sheila, Lynne Segal, and Hilary Wainwright (eds), 1979,\n<em>Beyond the Fragments: Feminism and the Making of Socialism</em>,\nLondon: Merlin Press.",
                "Sassoon, Donald, 1996 [2013], <em>One Hundred Years of Socialism:\nThe West European Left in the Twentieth Century</em>, London: I. B\nTauris. New edition 2013.",
                "Satz, Debra, 1996, “Status Inequalities and Models of Market\nSocialism”, in Wright 1996: 71–89.",
                "Schweickart, David, 2002 [2011], <em>After Capitalism</em>,\nLantham, MD: Rowman &amp; Littlefield. Second edition 2011.",
                "Steiner, Hillel, 2014, “Greed and Fear”, <em>Politics,\nPhilosophy &amp; Economics</em>, 13(2): 140–150.\ndoi:10.1177/1470594X14528649",
                "Svampa, Maristella, 2016, <em>Debates Latinoamericanos.\nIndianismo, desarrollo, dependencia y populismo</em>, Buenos Aires:\nEdhasa.",
                "Sypnowich, Christine, 2017, <em>Equality Renewed. Justice,\nFlourishing and the Egalitarian Ideal</em>, New York: Routledge.\ndoi:10.4324/9781315458335",
                "Ten, C. L., 1998, “Democracy, Socialism, and the Working\nClasses”, in <em>The Cambridge Companion to Mill</em>, John\nSkorupski (ed.), Cambridge: Cambridge University Press, 372–395.\ndoi:10.1017/CCOL0521419875.011",
                "White, Stuart, 2015, “Basic Capital in the Egalitarian\nToolkit?”, <em>Journal of Applied Philosophy</em>, 32(4):\n417–431. doi:10.1111/japp.12129",
                "Van Parijs, Philippe, 1993, <em>Marxism Recycled</em>, (Studies in\nMarxism and Social Theory), Cambridge: Cambridge University\nPress.",
                "–––, 1995, <em>Real Freedom for All: What (If\nAnything) Can Justify Capitalism?</em> Oxford: Oxford University\nPress. doi:10.1093/0198293577.001.0001",
                "Van Parijs, Philippe and Yannick Vanderborght, 2017, <em>Basic\nIncome. A Radical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.",
                "Veneziani, Roberto, 2013, “Exploitation, Inequality and\nPower”, <em>Journal of Theoretical Politics</em>, 25(4):\n526–545. doi:10.1177/0951629813477275",
                "Vrousalis, Nicholas, 2013, “Exploitation, Vulnerability, and\nSocial Domination”, <em>Philosophy &amp; Public Affairs</em>,\n41(2): 131–157. doi:10.1111/papa.12013",
                "–––, 2018, “Exploitation: A Primer”,\n<em>Philosophy Compass</em>, 13(2): e12486.\ndoi:10.1111/phc3.12486",
                "Wark, McKenzie, 2016, <em>Molecular Red: Theory for the\nAnthropocene</em>, London: Verso.",
                "Williams, Eric, 1944 [1994], <em>Capitalism and Slavery</em>,\nChapel Hill, NC: University of North Carolina Press.",
                "Wolff, Jonathan, 1999, “Marx and Exploitation”,\n<em>The Journal of Ethics</em>, 3(2): 105–120.\ndoi:10.1023/A:1009811416665",
                "Wright, Erik Olin (ed.), 1996 <em>Equal Shares. Making Market\nSocialism Work</em>, London: Verso.",
                "–––, 2000 [2015], “Working-Class Power,\nCapitalist-Class Interests, and Class Compromise”, <em>American\nJournal of Sociology</em>, 105(4): 957–1002. Reprinted in his\n<em>Understanding Class</em>, London: Verso, 2015, 85–230.\ndoi:10.1086/210397",
                "–––, 2010, <em>Envisioning Real Utopias</em>,\nLondon: Verso.",
                "–––, 2015a, “Eroding Capitalism: A Comment\non Stuart White’s ‘Basic Capital in the Egalitarian\nToolkit’: Eroding Capitalism”, <em>Journal of Applied\nPhilosophy</em>, 32(4): 432–439. doi:10.1111/japp.12128",
                "–––, 2015b, “How to Be an Anticapitalist\nToday”, <em>Jacobin</em> 12.2.15.\n (<a href=\"https://www.jacobinmag.com/2015/12/erik-olin-wright-real-utopias-anticapitalism-democracy/\" target=\"other\">Wright 2015b available online</a>)",
                "–––, 2016, “How to Think About (And Win)\nSocialism”, <em>Jacobin</em>, 4.27.16.\n (<a href=\"https://www.jacobinmag.com/2016/04/erik-olin-wright-real-utopias-capitalism-socialism/\" target=\"other\">Wright 2016 available online</a>)",
                "Ypi, Lea, 2018, “The Politics of Reticent Socialism”,\n<em>Catalyst</em>, 2(3): 156–175. ",
                "Žižek, Slavoj, 2005, “Against Human Rights”,\n<em>New Left Review</em>, 34(July/Aug): 115–131.\n [<a href=\"https://newleftreview.org/issues/II34/articles/slavoj-zizek-against-human-rights\" target=\"other\">Žižek 2005 available online</a>]"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Akyeampong, Emmanuel, 2018, “African Socialism; or, the\nSearch for an Indigenous Model of Economic Development?”,\n<em>Economic History of Developing Regions</em>, 33(1): 69–87.\ndoi:10.1080/20780389.2018.1434411</li>\n<li>Albert, Michael, 2003, <em>Parecon: Life After Capitalism</em>,\nLondon: Verso.</li>\n<li>–––, 2017, <em>Practical Utopia: Strategies for\na Desirable Society</em>, Oakland: PM Press.</li>\n<li>ANC (African National Congress), 1955, <em>The Freedom Charter:\nAdopted at the Congress of the People at Kliptown, Johnannesburg, on\nJune 25 and 26, 1955</em>.\n [<a href=\"http://www.historicalpapers.wits.ac.za/inventories/inv_pdfo/AD1137/AD1137-Ea6-1-001-jpeg.pdf\" target=\"other\">ANC 1955 available online</a>,\n from Wits Historical Papers, University of Witwatersrand.]</li>\n<li>Aricó, José, 2017, <em>José Aricó:\ndilemas del marxismo en América Latina, antología\nesencial</em>, Martín Cortés (ed.), Buenos Aires:\nCLACSO.\n [<a href=\"https://www.clacso.org.ar/antologias/detalle.php?id_libro=1312\" target=\"other\">Aricó 2017 available online</a>]</li>\n<li>Arneson, Richard, 2016, “Exploitation, Domination,\nCompetitive Markets, and Unfair Division: Exploitation, Domination,\nCompetitive Markets, Unfair Division”, <em>The Southern Journal\nof Philosophy</em>, 54(S1-Exploitation): 9–30.\ndoi:10.1111/sjp.12182</li>\n<li>Arnold, Samuel, 2012, “The Difference Principle at\nWork”, <em>Journal of Political Philosophy</em>, 20(1):\n94–118. doi:10.1111/j.1467-9760.2010.00393.x</li>\n<li>–––, 2017, “Capitalism, Class Conflict,\nand Domination”, <em>Socialism and Democracy</em>, 31(1):\n106–124. doi:10.1080/08854300.2016.1215810</li>\n<li>Arnsperger, Christian and Philippe Van Parijs, 2003,\n<em>Éthique économique et sociale</em>, Paris: La\nDécouverte.</li>\n<li>Arruzza, Cinzia, 2013, <em>Dangerous Liaisons: The Marriages and\nDivorces of Marxism and Feminism</em>, (IIRE Notebook for Study and\nResearch 55), Pontypool, Wales: Merlin Press.</li>\n<li>–––, 2016, “Functionalist, Determinist,\nReductionist: Social Reproduction Feminism and Its Critics”,\n<em>Science &amp; Society</em>, 80(1): 9–30.\ndoi:10.1521/siso.2016.80.1.9</li>\n<li>Barry, Brian, 2005, <em>Why Social Justice Matters</em>,\nCambridge: Polity.</li>\n<li>Blackburn, Robin, 2011, “Reclaiming Human Rights: Review of\n<i>The Last Utopia</i> by Samuel Moyn”, <em>New Left\nReview</em>, 69(May/June): 126–138.\n [<a href=\"https://newleftreview.org/issues/II69/articles/robin-blackburn-reclaiming-human-rights\" target=\"other\">Blackburn 2011 available online</a>]</li>\n<li>Boltanski, Luc and Eve Chiapello, 2018, <em>The New Spirit of\nCapitalism</em>, London: Verso.</li>\n<li>Bowles, Samuel and Herbert Gintis, 1986, <em>Democracy and\nCapitalism: Property, Community and the Contradictions of Modern\nSocial Thought</em>, New York: Routledge.</li>\n<li>–––, 2011, <em>A Cooperative Species: Human\nReciprocity and Its Evolution</em>, Princeton, NJ: Princeton\nUniversity Press. doi:10.23943/princeton/9780691151250.001.0001</li>\n<li>Brennan, Jason, 2014, <em>Why Not Capitalism?</em> New York:\nRoutledge.</li>\n<li>Brighouse, Harry, 1996, “Transitional and Utopian Market\nSocialism”, in Wright 1996: 187–208.</li>\n<li>Carens, Joseph H., 1981, <em>Equality, Incentives, and the Market:\nAn Essay in Utopian Politico-Economic Theory</em>, Chicago: University\nof Chicago Press.</li>\n<li>–––, 2003, “An Interpretation and Defense\nof the Socialist Principle of Distribution”, <em>Social\nPhilosophy and Policy</em>, 20(1): 145–177.\ndoi:10.1017/S0265052503201072</li>\n<li>Castoriadis, Cornelius, 1979, <em>Le Contenu du Socialisme</em>,\nParis: Éditions 10/18.</li>\n<li>Chakrabarty, Bidyut, 2014, <em>Communism in India: Events,\nProcesses and Ideologies</em>, New Delhi: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199974894.001.0001</li>\n<li>–––, 2018, <em>Left Radicalism in India</em>,\nNew York: Routledge</li>\n<li>Chibber, Vivek, 2017, “Rescuing Class from the Cultural\nTurn”, <em>Catalyst</em>, 1(1).</li>\n<li>Cohen, G. A., 1988, <em>History, Labour, and Freedom</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 1995, <em>Self-ownership, Freedom, and\nEquality</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2000a, <em>Karl Marx’s Theory of\nHistory: A Defense</em>, expanded edition, Princeton: Princeton\nUniversity Press.</li>\n<li>–––, 2000b, <em>If You’re an Egalitarian,\nHow Come You’re So Rich?</em> Cambridge, MA: Harvard University\nPress.</li>\n<li>–––, 2008, <em>Rescuing Justice and\nEquality</em>, Cambridge, MA: Harvard University Press.</li>\n<li>–––, 2009, <em>Why Not Socialism?</em>\nPrinceton: Princeton University Press.</li>\n<li>–––, 2011, <em>On the Currency of Egalitarian\nJustice and Other Essays in Political Philosophy</em>, Princeton:\nPrinceton University Press.</li>\n<li>Cohen, Joshua, 1989, “The Economic Basis of Deliberative\nDemocracy”, <em>Social Philosophy and Policy</em>, 6(2):\n25–50. doi:10.1017/S0265052500000625</li>\n<li>Cohen, Joshua and Joel Rogers, 1995, <em>Associations and\nDemocracy: The Real Utopias Project, Volume 1</em>, London:\nVerso.</li>\n<li>Cole, G. D. H., 1929, <em>The Next Ten Years in British Social and\nEconomic Policy</em>, London: Routledge.</li>\n<li>Collins, Hugh, Gillian Lester, and Virginia Mantouvalou (eds.),\n2018, <em>Philosophical Foundations of Labour Law</em>, Oxford: Oxford\nUniversity Press. doi:10.1093/oso/9780198825272.001.0001</li>\n<li>Corneo, Giacomo, 2017, <em>Is Capitalism Obsolete? A Journey\nthrough Alternative Economic Systems</em>, Cambridge, MA: Harvard\nUniversity Press.</li>\n<li>Coutrot, Thomas, 2018, <em>Libérer le travail</em>, Paris:\nSeuil.</li>\n<li>Cummine, Angela, 2016, <em>Citizens’ Wealth</em>, New Haven,\nCT: Yale University Press.</li>\n<li>Dalla Costa, Mariarosa and Selma James, 1972, <em>The Power of\nWomen &amp; the Subversion of Community</em>, Bristol: Falling Wall\nPress Ltd.\n (<a href=\"http://libcom.org/library/power-women-subversion-community-della-costa-selma-james\" target=\"other\">Dalla Costa and James 1972 available online</a>)</li>\n<li>Dardot, Pierre and Christian Laval, 2014, <em>Commun. Essai sur la\nrévolution au XXIe siècle</em>, Paris: La\nDécouverte.</li>\n<li>Davis, Angela, 1981, <em>Women, Race and Class</em>, New York:\nRandom House.</li>\n<li>Dietsch, Peter, 2015, <em>Catching Capital: The Ethics of Tax\nCompetition</em>, New York: Oxford University Press.\ndoi:10.1093/acprof:oso/9780190251512.001.0001</li>\n<li>–––, 2018, “The State and Tax Competition:\nA Normative Perspective”, in <em>Taxation: Philosophical\nPerspectives</em>, Martin O’Neill and Shepley Orr (eds.), Oxford:\nOxford University Press, chapter 12.</li>\n<li>Dussel, Enrique, 1998, <em>Etica de la liberación</em>,\nMadrid: Trotta.</li>\n<li>Edmundson, William A., 2017, <em>John Rawls: Reticent\nSocialist</em>, Cambridge: Cambridge University Press.</li>\n<li>Ehrenreich, Barbara, 1976 [2018], “What is Socialist\nFeminism?” <em>WIN Magazine</em>. Reprinted with a new\nintroduction in <em>Jacobin</em>, 07.30.2018.\n [<a href=\"https://jacobinmag.com/2018/07/socialist-feminism-barbara-ehrenreich\" target=\"other\">Ehrenreich 1976 [2018] available online</a>]</li>\n<li>Einstein, Albert, 1949, “Why Socialism?”, <em>Monthly\nReview</em>, 1. Reprinted in 2009, <em>Monthly Review</em>, 61(1):\n55–61. doi:10.14452/MR-061-01-2009-05_7</li>\n<li>Elster, Jon, 1985, <em>Making Sense of Marx</em>, Cambridge:\nCambridge University Press.</li>\n<li>–––, 1986, <em>An Introduction to Karl\nMarx</em>, Cambridge, Cambridge University Press.</li>\n<li>–––, 1989, “Self-Realization in Work and\nPolitics: The Marxist Conception of the Good Life”, in Elster\nand Moene 1989: 127–158.</li>\n<li>Elster, Jon and Karl Ove Moene (eds.), 1989, <em>Alternatives to\nCapitalism</em>, Cambridge: Cambridge University Press.</li>\n<li>Fanon, Frantz, 1952, <em>Peau noire, masques blancs</em>, Paris:\nSeuil.</li>\n<li>–––, 1961, <em>Les damnés de la\nterre</em>, Paris: Maspero.</li>\n<li>Federici, Silvia, 2012, <em>Revolution at Point Zero: Housework,\nReproduction and Feminist Struggle</em>, Oakland, CA: MP Press.</li>\n<li>Fleurbaey, Marc, 2006,<em>Capitalisme ou démocratie?\nL'alternative du XXIe siècle</em>, Paris: Grasset &amp;\nFasquelle.</li>\n<li>Forst, Rainer, 2017, “Noumenal Alienation: Rousseau, Kant\nand Marx on the Dialectics of Self-Determination”, <em>Kantian\nReview</em>, 22(4): 523–551. doi:10.1017/S1369415417000267</li>\n<li>Frega, Roberto, Lisa Herzog, and Christian Neuhäuser, 2019,\n“Workplace Democracy—The Recent Debate”,\n<em>Philosophy Compass</em>, 14(4): e12574.\ndoi:10.1111/phc3.12574</li>\n<li>Fraser, Nancy, 2009, “Feminism, Capitalism and the Cunning\nof History”, <em>New Left Review</em>, 56(Mar/Apr): 97–117.\n [<a href=\"https://newleftreview.org/issues/II56/articles/nancy-fraser-feminism-capitalism-and-the-cunning-of-history\" target=\"other\">Fraser 2009 available online</a>]</li>\n<li>–––, 2014, “Behind Marx’s Hidden Abode:\nFor an Expanded Conception of Capitalism”, <em>New Left\nReview</em>, 86(Mar/Apr): 55–72.\n [<a href=\"https://newleftreview.org/issues/II86/articles/nancy-fraser-behind-marx-s-hidden-abode\" target=\"other\">Fraser 2014 available online</a>]</li>\n<li>Fraser, Nancy and Rahel Jaeggi, 2018, <em>Capitalism</em>,\nCambridge: Polity.</li>\n<li>Gargarella, Roberto, 2010, <em>The Legal Foundations of\nInequality: Constitutionalism in the Americas, 1776–1860</em>,\nCambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511750618</li>\n<li>Geras, Norman, 1985, “The Controversy about Marx and\nJustice”, <em>New Left Review</em>, 1/150(Mar/Apr): 47–85.\n [<a href=\"https://newleftreview.org/issues/I150/articles/norman-geras-the-controversy-about-marx-and-justice\" target=\"other\">Geras 1985 available online</a>]</li>\n<li>Getachew, Adom, 2019, <em>Worldmaking after Empire: The Rise and\nFall of Self-Determination</em>, Princeton, NJ: Princeton University\nPress. doi:10.23943/princeton/9780691179155.001.0001</li>\n<li>Gilabert, Pablo, 2011, “Debate: Feasibility and\nSocialism”, <em>Journal of Political Philosophy</em>, 19(1):\n52–63. doi:10.1111/j.1467-9760.2010.00383.x</li>\n<li>–––, 2012, “Cohen on Socialism, Equality\nand Community”, <em>Socialist Studies/Études\nSocialistes</em>, 8: 101–121. doi:10.18740/S4W019</li>\n<li>–––, 2015, “The Socialist Principle\n‘From Each According To Their Abilities, To Each According To\nTheir Needs’”, <em>Journal of Social\nPhilosophy</em>, 46(2): 197–225. doi:10.1111/josp.12096</li>\n<li>–––, 2017a, “Justice and Feasibility: A\nDynamic Approach”, in <em>Political Utopias: Contemporary\nDebates</em>, Michael Weber and Kevin Vallier (eds.), Oxford: Oxford\nUniversity Press, 95–126.\ndoi:10.1093/acprof:oso/9780190280598.003.0006</li>\n<li>–––, 2017b, “Kantian Dignity and Marxian\nSocialism”, <em>Kantian Review</em>, 22(4): 553–577.\ndoi:10.1017/S1369415417000279</li>\n<li>–––, 2018a, <em>Human Dignity and Human\nRights</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198827221.001.0001</li>\n<li>–––, 2018b, “Dignity at Work”, in\nCollins, Lester, and Mantouvalou 2018: 68–86.</li>\n<li>Goodin, Robert, 1987, “Exploiting a Person and Exploiting a\nSituation”, in <em>Modern Theories of Exploitation</em>, Andrew\nReeve (ed.), London: SAGE, 166–200.</li>\n<li>Gould, Carol C., 1973–4, “The Woman Question:\nPhilosophy of Liberation and the Liberation of Philosophy”,\n<em>Philosophical Forum</em>, 5: 5–44.</li>\n<li>–––, 1981, “Socialism and\nDemocracy”, <em>Praxis International</em>, 1: 49–63.</li>\n<li>–––, 1988, <em>Rethinking Democracy: Freedom and\nSocial Cooperation in Politics, Economy, and Society</em>, Cambridge:\nCambridge University Press.</li>\n<li>Gourevitch, Alex, 2013, “Labor Republicanism and the\nTransformation of Work”, <em>Political Theory</em>, 41(4):\n591–617. doi:10.1177/0090591713485370</li>\n<li>Gourevitch, Alex and Lucas Stanczyk, 2018, “The Basic Income\nIllusion”, <em>Catalyst</em>, 1(4).</li>\n<li>Guevara, Ernesto, 1977, <em>El Socialismo y El Hombre Nuevo</em>,\nMexico DF: Siglo XXI.</li>\n<li>Guinan, Joe and Martin O'Neill, 2018, “The Institutional\nTurn: Labour’s New Political Economy”, <em>Renewal: A Journal\nof Social Democracy</em>, 26(2): 5–16.\n [<a href=\"http://www.renewal.org.uk/articles/the-institutional-turn-labours-new-political-economy\" target=\"other\">Guinan and O'Neill 2018 available online</a>]</li>\n<li>Harnecker, Marta, 2015, <em>A World to Build. New Paths towards\nTwenty-First Century Socialism</em>, New York: Monthly Review\nPress.</li>\n<li>Holmstrom, Nancy, 1977, “Exploitation”, <em>Canadian\nJournal of Philosophy</em>, 7(2): 353–369.\ndoi:10.1080/00455091.1977.10717024</li>\n<li>Honneth, Axel, 2015 [2017], <em>Die Idee des Sozialismus. Versuch\neiner Aktualisierung</em>, Berlin: Suhrkamp Verlag. Translated as\n<em>The Idea of Socialism: Towards a Renewal</em>, Joseph Ganahl\n(trans.), Cambridge: Polity.</li>\n<li>Jaeggi, Rahel, 2014, <em>Alienation</em>, New York: Columbia\nUniversity Press.</li>\n<li>James, C. L. R., 1984, <em>At the Rendezvous of Victory: Selected\nWritings</em>, London: Allison and Busby.</li>\n<li>–––, 2001, <em>The Black Jacobins: Toussaint\nL'ouverture and the San Domingo Revolution</em>, new edition. London:\nPenguin Books [original publication 1938]</li>\n<li>Keat, Russell and John O’Neill, 2011, “Socialism”,\nin <em>Routledge Encyclopedia of Philosophy</em>, London: Routledge.\ndoi:10.4324/9780415249126-S058-2</li>\n<li>Keynes, John Maynard, 1930/1931 [2010], “Economic\n\nPossibilities for Our Grandchildren”, <em>The Nation and\n\nAthenaeum)</em> and reprinted in his, 1931, <em>Essays in\nPersuasion</em>. Reprinted 2010, London: Palgrave Macmillan UK, 2010,\n321–332. doi:10.1007/978-1-349-59072-8_25</li>\n<li>Kołakowski, Leszek, 1974 [2008], <em>Main Currents of\n\nMarxism</em>, London: W. W. Norton &amp; Company.</li>\n<li>Laclau, Ernesto, and Mouffe, Chantal, 1985, <em>Hegemony and\nSocialist Strategy</em>, London: Verso.</li>\n<li>Lal, Priya, 2015, <em>African Socialism in Postcolonial Tanzania:\nBetween the Village and the World</em>, Cambridge: Cambridge\nUniversity Press. doi:10.1017/CBO9781316221679</li>\n<li>Le Bot, Yvon, 1997, <em>Subcomandante Marcos. El sueño\nZapatista. Entrevistas con el Subcomandante Marcos, el mayor\nMoisés y el comandante Tacho, del Ejército Zapatista de\nLiberación Nacional</em>, Barcelona: Plaza &amp;\nJanés.</li>\n<li>Leopold, David, 2018, “Alienation”, <em>The Stanford\nEncyclopedia of Philosophy</em> (Fall 2018 Edition), Edward N. Zalta\n(ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2018/entries/alienation/\" target=\"other\">https://plato.stanford.edu/archives/fall2018/entries/alienation/</a>&gt;</li>\n<li>Lewis, Su Lin, 2019, “Asian Socialists and the\nForgotten Architects of Post-Colonial Freedom, 1952–56”, <em>Journal of\nWorld History</em>, 30 (1&amp;2): 55–88.</li>\n<li>Lizárraga, Fernando, 2011, <em>El marxismo y la justicia\nsocial. La idea de igualdad en Ernesto Che Guevara</em>, Chile:\nEscaparate Ediciones.</li>\n<li>Lohia, Ram Manohar, 1963, <em>Marx, Gandhi and Socialism</em>,\nHyderabad: Navahind.</li>\n<li>Löwy, Michel, 2005, <em>Ecosocialism. A Radical Alternative\nto Capitalist Catastrophe</em>, Chicago, IL: Haymarket Books.</li>\n<li>Lukes, Steven, 1985, <em>Marxism and Morality</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Malleson, Tom, 2014, <em>After Occupy: Economic Democracy for the\n21st Century</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199330102.001.0001</li>\n<li>Manley, Michael, 1990, <em>The Politics of Change: a Jamaican\nTestament</em>, Washington DC: Howard University Press [first\npublished 1974]</li>\n<li>–––, 1991, <em>The Poverty of Nations:\nReflections on Underdevelopment and the World Economy</em>, London:\nPluto Press.</li>\n<li>Mariátegui, José Carlos, 1928, <em>Siete Ensayos de\nInterpretación de la Realidad Peruana</em>, Caracas,\nVenezuela.</li>\n<li>–––, 2010, <em>La tarea americana</em>, Buenos\nAires: Prometeo.</li>\n<li>Marx, Karl, 1857–8 [1973], <em>Grundrisse</em>, London:\nPenguin. Original composition 1857–8.</li>\n<li>–––, 1844 [1978a], “Economic and\nPhilosophic Manuscript of 1844”, in in <em>The Marx-Engels\nReader</em>, R. Tucker (ed.), second edition, New York: Norton,\n66–125. Original composition 1844.</li>\n<li>–––, 1875 [1978b], “Critique of the Gotha\nProgram”, in <em>The Marx-Engels Reader</em>, R. Tucker (ed.),\nsecond edition, New York: Norton, 525–541. Original composition\n1875.</li>\n<li>–––, 1867 [1990], <em>Capital 1</em>, London:\nPenguin. Original publication 1867.</li>\n<li>–––, 1991, <em>Capital 3</em>, London: Penguin.\nOriginal composition: incomplete manuscript later edited and released\nby Friedrich Engels.</li>\n<li>Meade, James, 1948, <em>Planning and the Price Mechanism</em>,\nLondon: Routledge.</li>\n<li>–––, 1964, <em>Efficiency, Equality and the\nOwnership of Property</em>, London: Routledge.</li>\n<li>–––, 1967, <em>An Intelligent Radical’s\nGuide to Economic Policy</em>, London: Routledge.</li>\n<li>Meiksins Wood, Ellen, 1995, <em>Democracy Against Capitalism:\nRenewing Historical Materialism</em>, Cambridge: Cambridge University\nPress. Reprinted by Verso in 2016.</li>\n<li>Mill, John Stuart, 2008, <em>Principles of Political Economy and\nChapters on Socialism</em>, Jonathan Riley (ed.), Oxford: Oxford\nUniversity Press. [<em>Principles of Political Economy</em> originally\npublished 1848; <em>Chapters on Socialism</em> originally published\n1879]</li>\n<li>–––, 1873 [2018], <em>Autobiography</em>,\nOxford: Oxford University Press. [originally published 1873]</li>\n<li>Morsink, Johannes, 1999, <em>The Universal Declaration of Human\nRights. Origins, Drafting and Intent</em>, Philadelphia, PA:\nUniversity of Pennsylvania Press.</li>\n<li>Narayan, Jayaprakash, 1980, <em>A Revolutionary's Quest: Selected\nWritings of Jayaprakash Narayan</em>, Bimal Prasad (ed.), New Delhi:\nOxford University Press.</li>\n<li>Negri, Antonio, 2008, <em>Goodbye Mr. Socialism</em>, New York:\nSever Stories Press.</li>\n<li>Nell, Edward and Onora O’Neill, 1992 [2003], “Justice\nUnder Socialism”, in <em>Transformational Growth and Effective\nDemand</em>, by Edward J. Nell, London: Palgrave Macmillan UK,\n663–674. Reprinted in <em>Justice</em>, fourth edition, J. Sterba\n(ed.), Toronto: Thomson-Wadsworth, 2003, 77–85.\ndoi:10.1007/978-1-349-21779-3_28</li>\n<li>Nielsen, Kai, 1985, <em>Equality and Liberty</em>, Totowa, NJ:\nRowman &amp; Allanheld.</li>\n<li>Nkrumah, Kwame, 1961, <em>I Speak of Freedom: a Statement of\nAfrican Ideology</em>, New York: Frederick A. Praeger.</li>\n<li>–––, 1963, <em>Africa Must Unite</em>, New York:\nInternational.</li>\n<li>–––, 1965, <em>Neocolonialism: The Last Stage of\nImperialism</em>, New York: Internationalism.</li>\n<li>Nove, Alec, 1991, <em>The Economics of Feasible Socialism\nRevisited</em>, London: Harper Collins.</li>\n<li>–––, 2008, “Socialism”, in <em>The\nNew Palgrave Dictionary of Economics</em>, Steven N. Durlauf and\nLawrence E. blume (eds.), London: Palgrave Macmillan UK.\ndoi:10.1057/978-1-349-95121-5_1718-2</li>\n<li>Nyerere, Julius, 1967, <em>Freedom and Unity: A Selection from\nWritings and Speeches 1952–1965</em>, Dar es Salaam: Oxford\nUniversity Press.</li>\n<li>–––, 1968a, <em>Freedom and Socialism: A\nSelection from Writings and Speeches 1965–1967</em>, Dar es\nSalaam: Oxford University Press.</li>\n<li>–––, 1968b, <em>Ujamaa: Essays on\nSocialism</em>, London: Oxford University Press.</li>\n<li>O’Neill, Martin, 2008a, “What Should Egalitarians\nBelieve?”, <em>Philosophy &amp; Public Affairs</em>, 36(2):\n119–156. doi:10.1111/j.1088-4963.2008.00130.x</li>\n<li>–––, 2008b, “Three Rawlsian Routes towards\nEconomic Democracy”, <em>Revue de Philosophie\nÉconomique</em>, 9(1): 29–55</li>\n<li>–––, 2012, “Free (and Fair) Markets\nwithout Capitalism. Political Values, Principles of Justice, and\nProperty-Owning Democracy”, in O’Neill and Williamson\n2012: 75–100.</li>\n<li>–––, 2017, “Survey Article: Philosophy and\nPublic Policy after Piketty”, <em>Journal of Political\nPhilosophy</em>, 25(3): 343–375. doi:10.1111/jopp.12129</li>\n<li>O’Neill, Martin and Stuart White, 2018, “Trade Unions\nand Political Equality”, Collins, Lester, and Mantouvalou 2018:\n252–268. </li>\n<li>–––, 2019, “James Meade, Public Ownership,\nand the Idea of a Citizens’ Trust”, <em>International Journal\nof Public Policy</em>, 15(1/2): 23–37.\ndoi:10.1504/IJPP.2019.099052</li>\n<li>O’Neill, Martin and Thad Williamson (eds.), 2012,\n<em>Property-Owning Democracy: Rawls and Beyond</em>, Oxford:\nWiley-Blackwell. doi:10.1002/9781444355192</li>\n<li>Pateman, Carole, 1970, <em>Participation and Democratic\nTheory</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511720444</li>\n<li>Pecchi, Lorenzo and Gustavo Piga (eds), 2010, <em>Revisiting\nKeynes</em>, Cambridge, MA: MIT Press.</li>\n<li>Peffer, Rodney, 1990, <em>Marxism, Morality, and Social\nJustice</em>, Princeton: Princeton University Press.</li>\n<li>Piketty, Thomas, 2014, <em>Capitalism in the Twenty-First\nCentury</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Przeworski, Adam, 1985, <em>Capitalism and Social Democracy</em>,\nCambridge: Cambridge University Press.</li>\n<li>Purdy, Jedediah, 2015, <em>After Nature: A Politics for the\nAnthropocene</em>, Cambridge, MA: Harvard University Press.</li>\n<li>Rappoport, Angelo, 1924, <em>Dictionary of Socialism</em>, London:\nT. Fischer Unwin.</li>\n<li>Rawls, John, 2001, <em>Justice as Fairness. A Restatement</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Reiman, Jeffrey, 1987, “Exploitation, Force, and the Moral\nAssessment of Capitalism: Thoughts on Roemer and Cohen”,\n<em>Philosophy and Public Affairs</em>, 16(1): 3–41.</li>\n<li>Riley, Dylan, 2016, “An Anticapitalism That Can Win”,\n<em>Jacobin</em>, 1.7.16.\n (<a href=\"https://www.jacobinmag.com/2016/01/olin-wright-real-utopias-socialism-capitalism-gramsci-lenin-luxemburg/\" target=\"other\">Riley 2016 available online</a>)</li>\n<li>Roemer, John E. (ed.), 1986, <em>Analytical Marxism</em>,\nCambridge: Cambridge University Press.</li>\n<li>–––, 1994a, <em>A Future for Socialism</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>–––, 1994b, <em>Egalitarian Perspectives: Essays\nin Philosophical Economics</em>, Cambridge: Cambridge University\nPress. doi:10.1017/CBO9780511528293</li>\n<li>–––, 2017, “Socialism Revised”,\n<em>Philosophy &amp; Public Affairs</em>, 45(3): 261–315.\ndoi:10.1111/papa.12089</li>\n<li>Ronzoni, Miriam, 2018, “How Social Democrats May Become\nReluctant Radicals: Thomas Piketty’s <i>Capital</i> and Wolfgang\nStreeck’s <i>Buying Time</i>”, <em>European Journal of\nPolitical Theory</em>, 17(1): 118–127.\ndoi:10.1177/1474885115601602</li>\n<li>Rowbotham, Sheila, 1998, “Dear Dr. Marx: A Letter from a\nSocialist Feminist”, in <em>The Communist Manifesto Now.\nSocialist Register 1998</em>, Leo Panitch (ed.), London: Merlin Press,\n1-17.</li>\n<li>Rowbotham, Sheila, Lynne Segal, and Hilary Wainwright (eds), 1979,\n<em>Beyond the Fragments: Feminism and the Making of Socialism</em>,\nLondon: Merlin Press.</li>\n<li>Sassoon, Donald, 1996 [2013], <em>One Hundred Years of Socialism:\nThe West European Left in the Twentieth Century</em>, London: I. B\nTauris. New edition 2013.</li>\n<li>Satz, Debra, 1996, “Status Inequalities and Models of Market\nSocialism”, in Wright 1996: 71–89.</li>\n<li>Schweickart, David, 2002 [2011], <em>After Capitalism</em>,\nLantham, MD: Rowman &amp; Littlefield. Second edition 2011.</li>\n<li>Steiner, Hillel, 2014, “Greed and Fear”, <em>Politics,\nPhilosophy &amp; Economics</em>, 13(2): 140–150.\ndoi:10.1177/1470594X14528649</li>\n<li>Svampa, Maristella, 2016, <em>Debates Latinoamericanos.\nIndianismo, desarrollo, dependencia y populismo</em>, Buenos Aires:\nEdhasa.</li>\n<li>Sypnowich, Christine, 2017, <em>Equality Renewed. Justice,\nFlourishing and the Egalitarian Ideal</em>, New York: Routledge.\ndoi:10.4324/9781315458335</li>\n<li>Ten, C. L., 1998, “Democracy, Socialism, and the Working\nClasses”, in <em>The Cambridge Companion to Mill</em>, John\nSkorupski (ed.), Cambridge: Cambridge University Press, 372–395.\ndoi:10.1017/CCOL0521419875.011</li>\n<li>White, Stuart, 2015, “Basic Capital in the Egalitarian\nToolkit?”, <em>Journal of Applied Philosophy</em>, 32(4):\n417–431. doi:10.1111/japp.12129</li>\n<li>Van Parijs, Philippe, 1993, <em>Marxism Recycled</em>, (Studies in\nMarxism and Social Theory), Cambridge: Cambridge University\nPress.</li>\n<li>–––, 1995, <em>Real Freedom for All: What (If\nAnything) Can Justify Capitalism?</em> Oxford: Oxford University\nPress. doi:10.1093/0198293577.001.0001</li>\n<li>Van Parijs, Philippe and Yannick Vanderborght, 2017, <em>Basic\nIncome. A Radical Proposal for a Free Society and a Sane Economy</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Veneziani, Roberto, 2013, “Exploitation, Inequality and\nPower”, <em>Journal of Theoretical Politics</em>, 25(4):\n526–545. doi:10.1177/0951629813477275</li>\n<li>Vrousalis, Nicholas, 2013, “Exploitation, Vulnerability, and\nSocial Domination”, <em>Philosophy &amp; Public Affairs</em>,\n41(2): 131–157. doi:10.1111/papa.12013</li>\n<li>–––, 2018, “Exploitation: A Primer”,\n<em>Philosophy Compass</em>, 13(2): e12486.\ndoi:10.1111/phc3.12486</li>\n<li>Wark, McKenzie, 2016, <em>Molecular Red: Theory for the\nAnthropocene</em>, London: Verso.</li>\n<li>Williams, Eric, 1944 [1994], <em>Capitalism and Slavery</em>,\nChapel Hill, NC: University of North Carolina Press.</li>\n<li>Wolff, Jonathan, 1999, “Marx and Exploitation”,\n<em>The Journal of Ethics</em>, 3(2): 105–120.\ndoi:10.1023/A:1009811416665</li>\n<li>Wright, Erik Olin (ed.), 1996 <em>Equal Shares. Making Market\nSocialism Work</em>, London: Verso.</li>\n<li>–––, 2000 [2015], “Working-Class Power,\nCapitalist-Class Interests, and Class Compromise”, <em>American\nJournal of Sociology</em>, 105(4): 957–1002. Reprinted in his\n<em>Understanding Class</em>, London: Verso, 2015, 85–230.\ndoi:10.1086/210397</li>\n<li>–––, 2010, <em>Envisioning Real Utopias</em>,\nLondon: Verso.</li>\n<li>–––, 2015a, “Eroding Capitalism: A Comment\non Stuart White’s ‘Basic Capital in the Egalitarian\nToolkit’: Eroding Capitalism”, <em>Journal of Applied\nPhilosophy</em>, 32(4): 432–439. doi:10.1111/japp.12128</li>\n<li>–––, 2015b, “How to Be an Anticapitalist\nToday”, <em>Jacobin</em> 12.2.15.\n (<a href=\"https://www.jacobinmag.com/2015/12/erik-olin-wright-real-utopias-anticapitalism-democracy/\" target=\"other\">Wright 2015b available online</a>)</li>\n<li>–––, 2016, “How to Think About (And Win)\nSocialism”, <em>Jacobin</em>, 4.27.16.\n (<a href=\"https://www.jacobinmag.com/2016/04/erik-olin-wright-real-utopias-capitalism-socialism/\" target=\"other\">Wright 2016 available online</a>)</li>\n<li>Ypi, Lea, 2018, “The Politics of Reticent Socialism”,\n<em>Catalyst</em>, 2(3): 156–175. </li>\n<li>Žižek, Slavoj, 2005, “Against Human Rights”,\n<em>New Left Review</em>, 34(July/Aug): 115–131.\n [<a href=\"https://newleftreview.org/issues/II34/articles/slavoj-zizek-against-human-rights\" target=\"other\">Žižek 2005 available online</a>]</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "alienation",
            "common good",
            "critical theory",
            "democracy",
            "domination",
            "economics [normative] and economic justice",
            "egalitarianism",
            "equality",
            "exploitation",
            "feminist philosophy, topics: perspectives on class and work",
            "justice",
            "justice: distributive",
            "liberty: positive and negative",
            "markets",
            "Marx, Karl",
            "Marxism, analytical",
            "Mill, John Stuart",
            "Mill, John Stuart: moral and political philosophy",
            "property and ownership",
            "revolution"
        ],
        "entry_link": [
            {
                "../alienation/": "alienation"
            },
            {
                "../common-good/": "common good"
            },
            {
                "../critical-theory/": "critical theory"
            },
            {
                "../democracy/": "democracy"
            },
            {
                "../domination/": "domination"
            },
            {
                "../economic-justice/": "economics [normative] and economic justice"
            },
            {
                "../egalitarianism/": "egalitarianism"
            },
            {
                "../equality/": "equality"
            },
            {
                "../exploitation/": "exploitation"
            },
            {
                "../feminism-class/": "feminist philosophy, topics: perspectives on class and work"
            },
            {
                "../justice/": "justice"
            },
            {
                "../justice-distributive/": "justice: distributive"
            },
            {
                "../liberty-positive-negative/": "liberty: positive and negative"
            },
            {
                "../markets/": "markets"
            },
            {
                "../marx/": "Marx, Karl"
            },
            {
                "../marxism-analytical/": "Marxism, analytical"
            },
            {
                "../mill/": "Mill, John Stuart"
            },
            {
                "../mill-moral-political/": "Mill, John Stuart: moral and political philosophy"
            },
            {
                "../property/": "property and ownership"
            },
            {
                "../revolution/": "revolution"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=socialism\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/socialism/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=socialism&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/socialism/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=socialism": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/socialism/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=socialism&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/socialism/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Albert, Michael, 2016, “What’s Next? Parecon, or\nParticipatory Economics”.\n [<a href=\"http://thenextsystem.org/whats-next-parecon-participatory-economics/\" target=\"other\">Albert 2016 available online</a>]",
            "Arnold, Samuel, n.d., “Socialism”, <em>Internet\nEncyclopedia of Philosophy</em>, Accessed 20 June 2019.\n [<a href=\"https://www.iep.utm.edu/socialis/\" target=\"other\">Arnold n.d. available online</a>]",
            "O’Neill, Martin, 2015, “James Meade and Predistribution:\n50 Years Before his Time”, <em>Policy Network: Classics of\nSocial Democratic Thought</em>, 28 May 2015.\n (<a href=\"https://web.archive.org/web/20170312125656/http://www.policy-network.net/pno_detail.aspx?ID=4909&amp;title=James-Meade-and-predistribution-50-years-before-his-time\" target=\"other\">O’Neill 2015 available online</a>)\n ",
            "Schweickart, David, 2015, “Economic Democracy: An Ethically\nDesirable Socialism That Is Economically Viable”, <em>The Next\nSystem Project</em>, October. URL =\n &lt;<a href=\"https://thenextsystem.org/economic-democracy\" target=\"other\">https://thenextsystem.org/economic-democracy</a>&gt;\n ",
            "<a href=\"https://www.marxists.org/\" target=\"other\">Marxists Internet Archive</a>,\n (primary texts from various Marxist thinkers)",
            "<a href=\"http://megadigital.bbaw.de/\" target=\"other\">Marx-Engels Gesamtausgabe</a> (German),\n includes much of Marx’s and Engels’s correspondence",
            "<a href=\"https://newleftreview.org/\" target=\"other\">New Left Review</a>",
            "<a href=\"http://users.sussex.ac.uk/~sefd0/bib/marx.htm\" target=\"other\">Marx bibliography</a>,\n maintained by Andrew Chitty (University of Sussex)"
        ],
        "listed_links": [
            {
                "http://thenextsystem.org/whats-next-parecon-participatory-economics/": "Albert 2016 available online"
            },
            {
                "https://www.iep.utm.edu/socialis/": "Arnold n.d. available online"
            },
            {
                "https://web.archive.org/web/20170312125656/http://www.policy-network.net/pno_detail.aspx?ID=4909&title=James-Meade-and-predistribution-50-years-before-his-time": "O’Neill 2015 available online"
            },
            {
                "https://thenextsystem.org/economic-democracy": "https://thenextsystem.org/economic-democracy"
            },
            {
                "https://www.marxists.org/": "Marxists Internet Archive"
            },
            {
                "http://megadigital.bbaw.de/": "Marx-Engels Gesamtausgabe"
            },
            {
                "https://newleftreview.org/": "New Left Review"
            },
            {
                "http://users.sussex.ac.uk/~sefd0/bib/marx.htm": "Marx bibliography"
            }
        ]
    }
}