{
    "url": "sortals",
    "title": "Sortals",
    "authorship": {
        "year": "Copyright © 2020",
        "author_text": "Richard E. Grandy\n\nMax A. Freund\n<mfreundcr@gmail.com>",
        "author_links": [
            {
                "http://www.ruf.rice.edu/~rgrandy/": "Richard E. Grandy"
            },
            {
                "mailto:mfreundcr%40gmail%2ecom": "mfreundcr@gmail.com"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2020</a> by\n\n<br/>\n<a href=\"http://www.ruf.rice.edu/~rgrandy/\" target=\"other\">Richard E. Grandy</a>\n<br/>\nMax A. Freund\n&lt;<a href=\"mailto:mfreundcr%40gmail%2ecom\"><em>mfreundcr<abbr title=\" at \">@</abbr>gmail<abbr title=\" dot \">.</abbr>com</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Thu Feb 9, 2006",
        "substantive revision Thu Nov 12, 2020"
    ],
    "preamble": "\n\nThe world seems to consist of stuff and things. Some of the stuff\ncomposes things—that wood constitutes this ship. Some things\nendure for a long time—the 2nd century Pantheon\nbuilding in Rome—others are transient—a sandcastle on the\nbeach. People care, to varying degrees, what kind of thing is being\nconsidered, and whether the one they are discussing is the same one.\nThe Pantheon in Rome today is the same one that was there in AD 150;\nthe sandcastle on the beach today, though it is in the same location\nand looks the same, is not the one the tide washed away last night.\nWhy do we care about objects and not just the stuff? Because objects\nare stuff with extra properties, properties that often persist and are\noften useful to know about even if the stuff changes.\n\nPhilosophical realists view the emergence of objects from the stuff as\nan objective matter independent of human thought or interests; conceptualist \nphilosophers argue instead that it is human cognition (and nominalist that it is language as well) that produces the appearance of objects. Many philosophers have believed\nthat the notion of a sortal is a, perhaps the, crucial philosophical\ntool in analyzing these issues and resolving the debates. Recently\npsychologists have also taken notice of the concept and argued for the\nimportance of sortals in cognitive development. And researchers in\nartificial intelligence, specifically knowledge representation, have\nalso started to use the idea. Unfortunately, there are conflicting\nunderstandings of the technical philosophical term sortal; authors\noften write at cross-purposes, which means that readers of any text\nabout sortals should approach cautiously. \n\nThe three main ideas are that a sortal\n\n tells us what the essence of a thing is \n tells us how to count things of that kind, which requires knowing\nwhich things are different and which are the same\n tells us when something continues to exist, and when it goes out\nof existence\n\n\nJohn Locke, who coined the term in 1690, was primarily concerned with\n(1), Peter Strawson, who in 1959 was the next to use the term, was\nprimarily concerned with (3). Two historically intermediate\nphilosophers who did not use the term but were interested in the\nconcept, Spinoza and Frege, were primarily interested in (2).\n\nWhat are some examples of sortals? The most generally agreed upon\nfeature of sortals is that they provide a criterion for what is to be\ncounted. All of the sortals listed next are counting sortals. Among\nthe counting sortals, some are phase sortals—sortals that\ntypically apply to something during part of its existence. An example\nis colt—the horse does not go out of existence when it\nmatures and ceases to be a colt. Another category is restricted\nsortals, which also may cease to be true of the object without its\ngoing out of existence, for example a brown dog may turn\ngray. Philosophers debate about sortals and essences; we would\ndistinguish between basic level sortals, the kind of noun or phrase\nthat is most typically given as an answer to What is it? Questions.\nGood examples of answers to the question understood this way would be\nelephant or car. This form of sortal has strong\naffinities in some domains with what are called natural kinds, but\nmany sortals apply to artifacts and not to natural objects. Another\nlevel of What is it? answer is at a very general categorial level,\nwhere some of the typical answers would be animal\nor vehicle. \n\nMost nouns that are not sortals can form sortals in contexts where a\nunit is implicated, often without the supplementary unit being\nexplicit. Coffee and gold are not sortals by most accounts, but we can\nintelligibly ask how many coffees Harry drank or how many golds the\nski team won. It is understood from context that we are asking about\ncups of coffee and gold medals.  These unitized\nsortals can be in any of the forms discussed above.\n\nOne of the most central kinds of sortal, and one of the most difficult\nto give uncontroversial examples of, are the persistence sortals. A\npersistence sortal is one where, if the sortal is no longer true of\nthe object, the object no longer exists. If a car is crushed into a\nmetal cube, the car no longer exists. But if the car is transformed\ninto a boat, does some one thing exist first as a car and then as a\nboat? According to some views, when someone dies they cease to exist;\naccording to various other views, the same person may be reincarnated\nin a new form. Is a werewolf sometimes a person and sometimes a wolf,\nor are they always a werewolf and neither a person nor wolf. \n",
    "toc": [
        {
            "#Over": "1. Overview"
        },
        {
            "#SortMassCounDist": "2. Sortals and the mass-count distinction"
        },
        {
            "#HistSort1690": "3. History of sortal from 1690–1959 "
        },
        {
            "#StraSort": "3.1 Strawson on sortals"
        },
        {
            "#CritIden": "3.2 Criteria of identity"
        },
        {
            "#IdenStroSortRela": "3.3 Is identity strongly sortal relative?"
        },
        {
            "#IdenWeakSortRela": "3.4 Is identity weakly sortal relative?"
        },
        {
            "#SubsSort": "4. Substance sortals"
        },
        {
            "#DefiSort": "5. Definitions of “sortal”"
        },
        {
            "#SortEsseExis": "5.1 Sortals, essences and existence"
        },
        {
            "#SortIndiTerm": "5.2 Sortals and individuative terms"
        },
        {
            "#SortForAbstObje": "6. Sortals for abstract objects"
        },
        {
            "#SortCogn": "7. Sortals and cognition"
        },
        {
            "#SortForInfa": "7.1.Sortals for infants "
        },
        {
            "#SortEsseBasiLeveObje": "7.2 Sortals, essences and basic level objects"
        },
        {
            "#SortLogi": "8. Sortals and Logic"
        },
        {
            "#SortStanLogi": "8.1 Sortals and standard logic"
        },
        {
            "#LogiSort": "8.2 Logics of sortals"
        },
        {
            "#Conc": "9. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Overview\n\nThe notion of a sortal overlaps with significant and long unresolved\nphilosophical controversies in philosophy of language, metaphysics and\nphilosophy of mind. Philosophers disagree about whether there are\nessences and those who agree that there are disagree about whether\nessences exist at a very general level—animal—or\na specific level—tiger. And philosophers disagree about\ncriteria of identity. Some believe that criteria of identity are\nrelative to a sortal in ways that can conflict, two things might be\nthe same ship but not the same wood. Others believe that identity\nconditions vary by sortal but do not conflict—that the criteria\nfor the identity of ships is different from that for people but since\npeople are not ships, the answers could not conflict. Others believe\nthere is only one general identity criterion regardless of sortal, and\nothers argue that there are no identity criteria. On one extreme view\n(Sider 1996), nothing exists at more than an instant. We, like most of\nthe literature on sortals, will not take that view into account in\nwhat follows.\n\nMost, though not all (Geach, Lowe) agree that sortal words apply to\nthings that we can count rather than things we measure. Sortals go\nwith numbers and plurals. “Dog” is a sortal,\n“water” is not, so we say that we need two\ndogs but that we need more water. One confusing\naspect of the distinction is that although “water” is not\na sortal, there is often a tacitly understood qualifier in the context\nthat combines to provide a sortal. At the grocery store, we might say\nwe need two waters meaning two bottles of water; or in a\nrestaurant we might ask for two waters, meaning two more\nglasses of water. So although “water” is not a\nsortal, the phrase “bottle of water” is, at least in one\nsense of the term. There are also quirks of language, English speakers\ndecide how many vegetables to buy, but Germans consider\nhow much Gemuse to buy, in spite of the fact that\n“Gemuse” means vegetable.\n\nThe counting characterization of what a sortal is includes many varied\nforms; we can count dogs, brown dogs, old brown dogs, old brown\ndachshunds, breeds of dog. But at most one of these characterizes the\nessence of the things we are counting. When being careful,\nphilosophers call this subset essential sortals. But not everyone is always careful. Also, there is a deep disagreement over whether the entire concept of an essence makes sense \nand so there are debates over whether there are a special subcategory\nof essential sortals. For example, both Brody(1980) and Wiggins(2001) argue for there being essential sortals, while Mackie(2006) against it. And among those who hold that there are essential sortals, there is disagreement over whether these are at a\ngeneral level such as “animal” or a specific level such as\n“dog”\n\nOne point of agreement is that we must have a sortal in mind for\ncounting to make sense. If we are looking at a barnyard and asked to\ncount how many, we need to know what sort of thing we are counting. We\ncould count animals or chickens or goats or tables or legs. Sortals\nspecify the “kind of thing we are counting” and thus are\nassociated with counting and a number. They contrast with other terms\nthat involve measuring and an amount. Linguists distinguish count\nnouns, nouns that go with “How many?” and take plurals,\nfrom mass nouns that go with “How much?” and do not take plurals,\nConfusingly, many nouns have both a count and a mass meaning, so we\ncan ask both how many chickens the farmer owns and\nhow much chicken you would like on your plate.?\n\nOften in order to count we also need to know when we have the same\nthing and when we have another, so sortals are also involved with\nidentity. Identity questions are usually easy to answer when we are\ndiscussing currently existing things, though for very large objects\nthe question can be tricky: Is the river that flows through Peoria\nIllinois the same one that flows through New Orleans? \n\nQuestions of identity through time are more often difficult, because\nthey involve issues of persistence. If a kitten grows up it ceases to\nbe a kitten but it is the same cat and the same animal. But if we tear\ndown our garage and build a tree house out of the lumber it is not the\nsame building. When does something survive change and when not? Which\nkinds of changes? Sortals providing criteria for continued existence through time (or so-called “persistence criteria”) are often referred as “substance sortals”. By their features, essential sortals will clearly qualify as substance sortals but not necessarily vice-versa. Similarly to the case of essential sortals, there are systematic disagreements among philosophers whether the substance sortals are to be located at a\nrelatively specific level, e.g., “dog”,\n“river” or at the level of a more general category, e.g., “animal”, “geographic feature”.\n\nIn considering sortals, counting, and identity, it is important to\nbear in mind that the superficial forms of language use can hide\ncomplexity. For example, if we say that Sam and Maria own the same\ncar, we probably do not mean that they are co-owners, but that they\neach own a car and that those cars are instances of the same model.\nWhat appears to be a question of identity between objects is actually\na question of identity between kinds of cars.\n\nBut there are real, famous historical issues about identity that lead\nto disagreements about the relation between essential sortals and\nidentity. Some philosophers believe that there is a unique universal\nidentity relation which holds, or doesn’t, independently of any\nsortals. Others argue that identity is always relative to a sortal\nbecause we may have a statue of Lincoln which is a different statue\nthan one of Caesar even though the lump of bronze from which the first\nwas made is the same lump of bronze that constitutes the second. So in\nthis case, the sortals “statue” and “lump of\nbronze” give different answers to the identity question.\n\nWhile there is considerable agreement that sortals “provide a\ncriterion of identity” there is disagreement on what is required\nfor a criterion of identity. Some philosophers have more stringent\nexpectations than others requiring that the statement of the criterion\nnot use terms involving the sortals in question or similar terms.\nAlso, as noted above some philosophers believe there is only one\nuniversal identity relation independent of sortals, and while others\nargue that there are no criteria of identity.\n\nAs a final preliminary to our more detailed history and analysis, we\nnote that there is important variation between authors in whether\n“sortal” is applied to linguistic items, e.g.,\nwords like “cat” or “lake” or\n“cloud”; abstract entities such as the property of\nbeing a cat or of being a lake or a cloud; or to psychological entities\nsuch as the idea or concept of a cat or lake or\ncloud. The first interpretation views sortals as being linguistically determined.The second sees sortal categories as part\nof the world’s furniture independent of how we describe it, and\nthe last is associated with a range of positions in between. These three different interpretations of the nature of sortals have been labeled as nominalist, realist, and conceptualist, respectively. Work on sortals may, in general, be classified under one of these three categories.\n2. Sortals and the mass-count distinction\n\nLinguists have long distinguished between mass and count nouns on\ngrammatical grounds and that distinction is close to the sortal vs\nnon-sortal distinction philosophers deploy. Count nouns form plurals\nand occur in constructions involving “How many …”\nMass nouns do not pluralize and occur in constructions involving\n“How much …?” We ask how many cats our friend owns\nand how much cat food. Some words, especially those involving food,\nhave both a mass and a count sense. We can ask both how many chickens\nour friend owns and how much chicken you want for dinner. (See Pelletier (1979, 2010), as well as the entries on the logic and the metaphysics of mass expressions, for detailed discussions on the mass-count distinction, from philosophical, linguistic, and cognitive perspectives.)\n\nThe grammatical distinction is robust. Almost all speakers of a\nlanguage agree on which sentences are grammatical and which are not.\nBut philosophers disagree about the extent to which count nouns match\nup with sortals. The sentences “There are three red things on\nthe shelf” and “Two objects collided” are definitely\ngrammatical, so “red thing” and “object” are\ncount nouns, but most philosophers argue that they are not sortals.\nFor example, Hirsch and Wiggins think not because they claim that you\ncannot count red things or objects, even though the request to do so\nis grammatical. Others think that we can count red things but that the\nonly two possibly correct answers are “infinitely many”\nand “none”. If nothing red is present there are no red\nobjects. But if some red thing is present then so are the top half of\nit, and also the bottom half, each of which are counted as a red\nthing, And the three thirds giving us three more red things, and so on\nad infinitum. Whether this is the best understanding of\n“thing” is disputed. We won’t linger over that\ndebate just now, but the issue recurs later when we discuss sortals\nand concept acquisition in children.\n\nThe count-mass distinction tracks closely in most instances with the\nintuitive difference between stuff and things we appealed to at the\nbeginning, but not always. There are some differences in English that\ndon’t seem systematic For example, “vehicle” and\n“vegetable” are count nouns, which makes sense because car\nand carrot are. But fruit and furniture are mass nouns although the\nthings they refer to, apples and chairs, are referred to by more\nspecific count nouns. And languages differ—as mentioned before,\nEnglish speakers count their vegetables, but German speakers ask how\nmuch Gemuse you want, even though\n“Gemuse” refers to the same things as\n“vegetable”. And in Italian both\n“frutta” and “verdura” are\nmass nouns.\n\nA related distinction is the one between counting and measuring. But\nwhile the differences between typical cases of counting—how many\noranges do we have—as opposed to measuring—how much rice\ndo we have—are clear, other cases are perplexing. Salmon (1997)\noffers multiple possible analyses of sentences such as “There\nare two and a half oranges on the table”, but he finds all of\nthem wanting. \n3. History of sortal from 1690–1959 \n\nMany philosophers (e.g., Wallace 1965) have claimed that the notion of\na sortal is the same notion as developed by Aristotle under the label\n“secondary substance” in several of his writings. However,\nthat concept is both complex and controversial (see Furth 1988 and the entry on Aristotle’s metaphysics) and we will not pursue the connection.\n\nThe first use of the term “sortal” is in Locke’s\nEssay Concerning Human Understanding (1975 [1690]).\n\n\nBut it being evident, that things are ranked under Names into sorts or\nSpecies…the Essence of each Genus,\nor Sort, comes to be nothing but that abstract Idea, which\nthe General, or Sortal (if I may have leave so to call it,\nfrom Sort, as I do General from Genus) Name\nstands for. And this we shall find to be that, which the word Essence\nimports, in its most familiar use. (Bk.III, Ch.III, 15)\n\n\nLocke goes on to distinguish between real essences, which are mostly\nhidden from us and determined by nature, and nominal essences, which\nwe (somewhat) arbitrarily construct, but doesn’t say which he\nmeans to pick out by the expression “sortal” It is ironic\nthat in discussion of the history of the term Locke and Aristotle are\ncited as the two historical sources, when a main point of\nLocke’s Essay was to argue against Aristotelian\nessentialism (see the entry on Locke).\n\nRoughly contemporaneously with Locke’s introduction of the term,\nSpinoza noted the importance of a sortal like term for counting though\nhe did not use the term “sortal” or a Latin\nequivalent.\n\n\nHe who holds in his hand a penny and a dollar will not think of the\nnumber two, unless he can call both the penny and the dollar piece by\none and the same name, to wit, a piece of money or a coin. (Spinoza\n1674: 259)\n\n\nThe other pre-twentieth century author who is frequently cited as an\nantecedent of contemporary discussions is Frege. In Frege (1884) he\nmakes the point that in counting things, we need to know what kind of\nthing we are counting. For example, something can be counted as one\nthing, a deck of cards, or as fifty-two cards. Frege was perhaps the\nfirst to use the phrase (which is translated as) “criterion of\nidentity”. There is disagreement about whether Frege intended\nhis remarks to apply to all kinds of identity, as Dummett (1973)\nargues, or only to numbers, as Lowe (1989) argues, but Dummett’s\nis the more common interpretation.\n\nWright (1983) argues that one of Frege’s most important\ncontributions was emphasizing that numbers are objects and that this\nis intimately connected to Frege’s claim that “natural\nnumber” is a sortal. Wright is aware of the difficulties in\ncharacterizing sortals, which we will explore below, but remarks that\n“…whether or not it is ultimately rigorously explicable,\nthe intuitive notion of a sortal concept is clear enough for our\nimmediate purpose” (1983: 4). For further discussion see the entry on Frege.\n3.1 Strawson on sortals\n\nThe expression “sortal” reappeared on the philosophical\nstage in the 1950s and 1960s in lectures and in the written work of\nStrawson (1959), Quine (1960), Geach (1962), and Wiggins (1967) and\nvariations on the concept entered the mainstream philosophical\nvocabulary. Because philosophers lecture and circulate manuscripts\nwith their ideas for years—sometimes decades—before\npublication, the dates of the main publications of the protagonists\nconcerning sortals do not necessarily reflect the historical\npriorities and influences. The most accurate simple summary is that\nthe ideas of Geach, Strawson and Quine co-evolved and that\nWiggins’ writings built on a foundation laid by those\npredecessors.\n\nThe widespread use of the term “sortal” definitely derives\nfrom Strawson, but readers should note that there are important\ndifferences among these authors. For a start, Strawson applies\n“sortal” to universals, Quine to predicates, and Wiggins to\nconcepts. Thus, these authors illustrate the realist, nominalist, and conceptualist interpretations of sortals’ nature. Geach did not use the word “sortal” but most commentators identify his notion of a “substantival\nexpression” with “sortal” in the other writers. Although Geach seems closest to Quine, since “expression”\nseems to be a linguistic notion, Geach generalizes his results across\nlanguages in ways that Quine would not find agreeable. These\ndifferences in usage among the four authors would not be important, if\nthere were simple direct agreed upon relations among concepts,\nuniversals, and expressions. But there aren’t.\n\nStrawson made no mention of Locke, Aristotle, Spinoza or Frege in the\ncontext of introducing the expression “sortal universal”\nin Individuals in 1959.\n\n\nA sortal universal supplies a principle for distinguishing and\ncounting individual particulars which it collects. (1959: 168) \n\n\nStrawson had two main projects in Individuals. The first was\nto show that material bodies and persons occupy a central position\namong particulars and that items in these two categories are basic to\nour conceptual scheme. The second was to\n\n\nestablish and explain the connexion between the idea of a particular\nin general and that of an object of reference or logical subject.\n(1959: 11–12)\n\n\nSortal universals are central to this second task because, according\nto Strawson, reference to particulars occurs by using expressions that\nare associated with sortal universals.\n\nStrawson thus emphasizes two characteristics. Sortals\n\n(1)\n give a criterion for counting the items of that kind\n(2)\n give a criterion of identity and non-identity among items of that kind\n\n\nIt is not difficult to see why someone would identify these\nrequirements. In order to know that there are exactly two Gs in\na region S, it is necessary and sufficient to know that\n\nThere is an x which is in S and has G, a y\nwhich is in S and has G and is not identical to\nx, and for any z, if z is a G which is in\nS then z is identical with either x or\ny.\n\nThe phrase “criterion of identity” seems to mean a\ncriterion which gives a necessary and sufficient condition for\nidentity. In many cases, however, a weaker condition suffices for\ncounting. To conclude that there are exactly two Gs in region\nS, all that is required is a sufficient condition for x\nand y to be distinct, and a sufficient condition for z\nto be identical with x or y. In the case of physical\nobjects, it may be that being at the same location at the same time is\nsufficient for identity, and being in entirely separate locations at\nthe same time is sufficient for distinctness. In most circumstances,\nthese will suffice to count Gs, but it is far short of\nproviding answers about partially overlapping Gs, and provides\nno guidance about identity across time. So often we may be able to\ncount Gs without having a criterion of identity in the strong\nsense.\n\nOne of the unclarities of the phrase “criterion of\nidentity” is that it is never spelled out what the criterion is\nto be applied to. For example, is it a criterion to be applied to\nnames of objects or to perceptual representations of objects or to the\nobjects themselves? It is also unclear how strictly we are to\nunderstand “criterion”. In “Entity and\nidentity” (published in 1976 and reprinted in Strawson 1997b)\nStrawson proposed being quite strict, limiting the phrase\n“criterion of identity” to cases where there either is an\nexplicitly statable necessary and sufficient condition that does not\nuse the identity relation, or one where the identity relation is only\napplied to constituent parts of the objects. This can be done for\nnumbers and sets, but probably not for any kind of concrete objects.\nIn 1997, he retracted that proposal in favor of the looser (and still\nundefined) general philosophical use of the term (1997a: 2–3).\nIn contrast, Wiggins understands the counting criterion very strictly\nso one instance where there is not a determinate answer to a question\nleads him to reject the counting criterion (2001: 75).\n\nAt the other end of the spectrum, Griffin (1997) only requires\nthat\n\n\nA term “A” is a sortal iff there can be cases in\nwhich “A” provides, without further conceptual\ndecision, and without borrowing other principles of individuation,\nprinciples adequate for counting As. (1997: 43)\n\n\nSince most philosophers who invoke the distinction want to reject\n“thing”, “object” and “entity” as\nnon-sortals, Griffin’s suggestion is inadequate, or at least is\na shift to a different concept with the same label. The question\n“How many things/objects/entity are in the space\nS?”, where S is an empty space has the determinate\nanswer “zero”, so all of these terms pass the Griffin\nstandard. One could attempt to amend the criterion by requiring that\nthere can be cases which satisfy the above criteria and where there is\nat least one A. However, this fails to delineate the right cases,\nbecause there are sortals such as “unicorn” and\n“square circle” which have no instances. These points, and\nthe observation that some of the various notions of sortal diverge,\nwere first made in Feldman 1973 but have not been widely noted\n(see the entry on relative identity). We will revisit some of these issues in\n Section 7.1\n on sortals and infant cognition.\n3.2 Criteria of identity\n\nIt is a law in many logical systems, The Indiscernibility of\nIdenticals, that things that are identical share all of their properties. The controversial\nconverse, The Identity of Indiscernibles, says that things that share all of their properties are identical. If “property” is\nunderstood sufficiently liberally, then the latter principle is certainly\ntrue—any object b has the property of “being\nidentical to b”, and if c also has that property\nthen \\(b = c\\). The question is whether the principle holds with any\nmore restricted sense of property. Ladyman et al.(2012) discuss and relate different interpretations of indiscernibility associated with various senses of properties. Many of these interpretations would ground different versions of the identity of indiscernibles principle. (See the entry on this principle for philosophical perspectives other than those considered by Ladyman et al.(2012).) \n \nOne might closely link indiscernibility to the notion of a criterion of identity (together with its connection to sortals) when “criterion of identity” is understood as follows:\n\nFor any sortal F there is a set of properties \\(\\phi\\) such that\nif b and c both are F, then if b and c\ninstantiate exactly the same properties in \\(\\phi\\) then \\(b = c\\).\n\nSome attempts to give content to the phrase “criterion of\nidentity” can be understood in this framework. Black (1952)\nargues that purely internal properties of objects do not suffice; his\nexample is a universe with two spheres which share all of their\ninternal properties, i.e., are the same color, weight, composition,\netc. There are a wide range of philosophical views about criteria of\nidentity. Brody (1980) takes the two identity and indiscernibility\nprinciples as jointly definitive of identity and consequently\nargues that no further criteria of identity are required. Baker (1997)\nargues that there are no criteria of identity across time, while\nJubien (1996), Merricks (1998) and Zimmerman (1998) articulate reasons\nto doubt that there are any criteria of identity. Lowe (1989,1997, and 2009) are\nmore recent attempts to clarify the concept\n3.3 Is identity strongly sortal relative?\n\nOne of the novel claims in Geach’s Reference and\nGenerality was that identity is relative in the strong sense that\nfor two sortal expressions F and G, b and\nc might be the same F, but not the same G. Geach\nused the expression “substantival” to characterize the\nkinds of term F and G are. His\n“substantival” coincides in many cases with sortals as\nunderstood by others, but cannot be entirely the same since he cites\n“gold” as an example of a substantival, in fact:\n\n\nwe can speak of the same gold as being first a statue and then a great\nnumber of coins, but “How many golds?” does not make\nsense. Thus “gold” is a substantival term, though we\ncannot use it for counting. (1962: 64)\n\n\nOne of the examples he gives is that b might be the same river\nas c, but not the same water. Or, if some bronze is made into\nfirst one statue, then a different one, then the two statues are not\nthe same statue but are the same bronze.\n\nQuine (1964) and others were critical of Geach’s solution to\nthese puzzles and defended the view that there is only one unqualified\nsense of identity. In each of the problem cases, his strategy was to\ntry to show that one of the statements of the form “same G\nas” is not a true identity statement. So in the river example,\nQuine would deny that the water is identical to the river and thus the\ntwo statements are about different objects. Almost all of\nGeach’s examples can with some plausibility be treated by\ndistinguishing more carefully between objects of reference or\ndistinguishing constitution from identity. Thus one might say that the\nbronze at different times constitutes the two statues but is not\nidentical with them. Whether constitution really is or isn’t\nidentity is a matter of continuing debate; for articulations of the\ntwo sides see Johnston (1992), Noonan (1993), Baker (2007, chap.3), and the entry on material constitution. For\nlater stages in the debate between Quine and Geach, see the entry on identity .\n\nSometimes it appears that identity is relative, when in fact ambiguity\nof reference is present. We might say that George and I took the same\nbus, meaning that we both took a bus on route #56. Or you might say of\nthe same events that we took different buses, because I took the #56\nat 10:25 and George took one at 12:30. But these are not conflicting\nidentity statements about the same things. The first concerns sameness\nof bus routes, while the second concerns time specific instances of\nthe route. \n\nOne example that does not readily lend itself to these approaches is\nthe problem of the Christian Trinity. According to this doctrine, God\nthe Father, Jesus, and the Holy Spirit are three persons but one God or\none substance. Thus they provide an alleged example where b and c are\ndistinct persons but the same substance. We will not enter the debate,\nwhich is been conducted for over a millennium, as to whether this\ndoctrine is coherent, but refer the reader to a modern discussion in\nCartwright 1987. It is certainly accurate to say that all of\nGeach’s examples are contested. For details on how the problematic character of such examples can be systematically dispelled, see, for instance, Wiggins (2001, chap. 2).\n3.4 Is identity weakly sortal relative?\n\nWiggins and others argue that identity is dependent on a sortal in a\nweaker sense. The criterion for the identity of sets is perhaps the\none clear and uncontroversial case: Two sets are identical, the same\nset, if and only if they have the same members. (Notice that while the\ncriterion is clear, the appeal to identity reappears with reference to\nthe members.) While it is perhaps less uncontroversial, my car is the\nsame as the car I owned five years ago even though the oil, tires,\nbattery and have been replaced; the car can remain the same even\nthough some parts change. My friend is the same person as he was five\nyears ago in spite of many natural changes in the molecules composing\nhis body, some dental fillings, an artificial hip and a new cornea\nlens. Two natural numbers are the same if they gave the same\nsuccessor, and two real numbers are identical iff they bear all of the\nsame order relations to the other numbers, =3.14…. Notice that\nin all of these cases appeal to identity recurs with reference to\nparts (whether body or automotive) or relations to other objects of\nthe same category. \n\nThe weak sortal relativity claim consists of saying that the identity\nrelation for sets is different from those for numbers, which is\ndifferent from those for people and artifacts like cars, and numbers.\nFor sets it involves members of whatever kind, for numbers relations\nto numbers and for persons and artifacts continuity of life and of\nfunction. For abstract non-mathematical things the relation is even\nless clear—the question when two ideas are the same idea is\noften only settled in a court case about copyright or patent\ninfringement. \n\nIn other words, there are two conceptions of identity: On one the\ngeneral identity relation is pieced together from the different\nidentity relations for different categories of things. For a\nand b to be identical is for them to be the same person or the\nsame number or the same artifact or …. On the other conception,\nthere is a general notion of identity, perhaps given by the identity\nlaws discussed in\n Section 3.2,\n and the specific ones are ways of instantiating that relation. The\nbest argument for the first view is that the pieces seem too diverse\nto be parts of the same general relation. The best argument for the\nsecond is that as we move from domain to domain, and even invent new\nones, the general identity scheme guides our development of an\nunderstanding of the more local notion. For a detailed analysis of\nWiggins’ claims see Snowdon 2009.\n4. Substance sortals\n\nThe sortals that Wiggins regards as crucial, the substance sortals,\nare a proper subset of the ones Strawson is concerned with.\nSubstance sortals contrast with phase sortals; the\nlatter typically only apply to some temporal segment of an object.\nKitten is a phase sortal because when a cat matures it ceases to be a\nkitten but it does not go out of existence. Substance sortals are also\ncontrasted with restricted sortals, e.g., “red table”.\nWiggins has a detailed theory of the structure of substance sortals,\narguing that if any two substance sortals overlap, then either one is\na restriction of the other or both are restrictions of some other\nsortal.\n\nThis seems problematic because it is plausible that plant and animal\nare both substance sortals. While they do not overlap, another\ncandidate for being a substance sortal carnivore overlaps\nboth. This would probably not disturb Wiggins, since he already denies\nthat “animal” is a substance sortal.\n\n\nIt is not to be denied that the words “this animal”\nsuffice to express a rough and ready identification in ordinary\ncontexts of what things are. But this is because “animal”\nso easily takes on an individuative force from a context and/or some\nother sortal predicate that is ready to hand. But the designation\n“this animal” is complemented in all sorts of\ndifferent ways. In itself it determines no single principle\nof individuation. (2001: 129)\n\n\nWe said earlier that in contrast with Strawson, Wiggins is concerned\nprimarily with the narrower class of substance sortals. Yet if we read\nhis account carefully, it emerges that in the end individuation rests\nwith an even smaller class which he calls\n“ultimate” sortals:\n\n\nBy an ultimate sortal I mean a sortal which either itself restricts no\nother sortal or else has a sense which both yields necessary and\nsufficient conditions of persistence for the kind it defines and is\nsuch that this sense can be clearly fixed and fully explained without\nreference to any other sortal which restricts it. (1967: 32)\n\n…I shall call x’s ultimate sortal concept\n… the sortal concept which is individuative of x and\nrestricts no other sortal concept. (1980: 65)\n\n\nThe idea is that “cat” and “dog” may both be\nindividuated by the same criterion, so the fundamental criterion is\nnot only associated with them but with other substance sortals that\nfall under the same ultimate sortal. We know from Wiggins’s\nremarks that “animal” is not a sortal, so the ultimate\nsortal for “cat” and “dog” is somewhere in the\nhierarchy above those concepts but below “animal”.\nSurprisingly, given the centrality of this notion, Wiggins nowhere\ngives an example of what he regards as an ultimate sortal. (At 1980:\n123 he does speculate inconclusively that “man” might be\nthe ultimate sortal for Julius Caesar.)\n\nWithout more specificity about when principles of individuation are\nthe same and different, the foundation of Wiggins’s account is\nmurky. For example, we don’t have enough information to\ndetermine whether some middle level term such as “mammal”\nis an ultimate sortal or not.\n\nThere are also other problems. Wiggins recognizes that his account of\nindividuation of biological kinds in terms of “characteristic\nforms of activity” does not transfer well to prototypical\nartifacts. He tries to meet this concern by giving an analysis in\nterms of function for artifacts such as clocks. However, he seems to\nassume that there are not problematic intermediate cases between\nnatural kinds and pure artifacts. Many kinds of things, e.g., rivers\nand lakes, can be either natural or artificial. They can also be\npartly artificial, as when a river is dredged or a lake enlarged. Nevertheless, Wiggins (2016, chap. 16, sec. 16–17, and chap. 12) might provide criteria for deciding upon these cases. (See Carrara & Vermass (2009), Baker (2004, 2008), and Losonsky (1990), for critical discussions on Wiggins’ view on artifacts; see also the entry  on artifacts for more general discussions of this notion in diverse areas of philosophy.)\n\nMoreover, in his own favorite cases of biology, he remarks:\n\n\nAlmost everything that has been said so far has been mainly directed\nat words standing for the various species of natural substances. The\naccount could be extended and adapted without overwhelming difficulty\nto predicates of genera, wherever these were still determinate enough\nto be autonomously individuative. (2001: 86)\n\n\nUnfortunately, his own favorite examples, “elm” borrowed\nfrom Putnam (1975) and “frog” are not terms for species.\n“Elm” is a genus and “frog” an order. In fact,\na quick consultation with a good dictionary will reveal that most\ncommonly used biological terms are expressions for some classification\nabove the level of species. Since Wiggins is cautious about extending\nhis account to genera, he may have very few substance sortals by his\naccount.\n\nYet another problem for species as the model of sortals is that most\nphilosophers of biology now agree that species don’t have\nessences, though there is disagreement among them about the best way\nto characterize species (for details, see the entry on species). A rejection of species essentialism doesn’t necessarily carry a rejection of the essentialism Wiggins has advocated. His is individual essentialism, i.e., the view that an individual is essentially a member of the species it belongs to (Wiggins 2001, chap. 4). Thus, a given whale, for example, is essentially a member of the species whales; this even in the case where there is no essential property such a species possesses. Moreover, there are attempts by Wiggins to argue that species don’t have essences. He states, for example, that species is an:\n\n\n…insecure concept in plant-taxonomy, and threatened even in\nzoology by such phenomena as ring-species and the imperfect\ntransitivity of the relation interbreeds in the wild with—the\noperational test of identity of species. (1967: 62)\n\n\nThere is no incoherence here on Wiggins’ part because species essentialism is logically independent of individual essentialism. Nevertheless, Wiggins’ essentialism is, like species essentialism, also subject to criticism based on contemporary results from the philosophy of biology (Laporte 1997 and Okasha 2000). But see Ferner (2016) for a sympathetic discussion of Wiggins’ doctrines from the perspective of biology, and Devitt (2018) for a recent defense of individual essentialism, which considers the views and criticism in question.\n5. Definitions of “sortal”\n5.1 Sortals, essences and existence\n\nReturning to our distinctions of ways of characterizing sortals, we\ncan begin by repeating the observation that the counting criteria\ninclude many more things as sortals than do 3–5, which are also\ngiven as the definition of a sortal:\n\n(3)\n gives a criterion for the continued existence of an item of that kind\n(4)\n answers the question “What is it?” for things of that kind\n(5)\n specifies the essence of things of that kind\n\n\nUnless the question is given a more specific technical sense, it would\nseem that “What is it?” is quite satisfactorily answered\nby sortals in the broad Strawsonian sense. “A kitten” or\n“A red table” both seem reasonable, so (4) can diverge\nfrom (3). The kitten does not go out of existence when it becomes\nadult, but it is no longer a kitten. Evaluating (5) is very difficult\nsince there is no consensus on whether kinds have essences (Quine\nwould say “none”) and there is no consensus among those\nwho assert the existence of essences as to what they are. Contemporary versions of sortal essentialism provide a possible solution to these problems, particularly the theories of Brody (1980) and Wiggins (1967, 1980, and 2001). Another possible influential solution is offered by the essentialism of origin, such as the one proposed in Forbes (1985) or Salmon (1981) (for a discussion of these theories, see Robertson (1998, 2000)). Minimalist essentialism (Mackie 2006) is an alternative to those two forms of essentialism.\n\nIn a different direction, Wiggins in his later writings gives examples\nto show that criteria of individuation and persistence are\ninsufficient to count objects under a sortal, and thus some\nexpressions meet conditions 3–5 but\nnot 1–2.\n\n\n…the concept crown gives a satisfactory way of answering\nidentity-questions for crowns. But there is no universally applicable\ndefinite way of counting crowns. The Pope’s crown is made of\ncrowns. There is no definite answer, when the Pope is wearing his\ncrown, to the question “how many crowns does he have on his head”\n(1980: 73; 2001: 75)\n\n\nIn a footnote to the same pages, Wiggins gives a list of other\nexamples of terms which permit individuation but not counting:\n“wave, volume of fluid, worm, garden, crystal, piece of string,\nword-token, machine”. Wiggins continues by explaining that, on\nhis view, his account does not disagree with Strawson’s but\ncorrects and enlarges it (2001: 75). We find it puzzling that Wiggins\ndismisses “animal” as a sortal but is willing to include\n“machine” which seems at least as problematic\n5.2 Sortals and individuative terms\n\nQuine’s terminology in this area differs from that of Strawson,\nWiggins and Geach. In 1960 he uses the expression “term that\ndivides its reference”, but in other writings (1969, 1981) he\nuses the expression “individuative word”. In footnote 1 of\nQuine 1960: 90 he says that his expression is equivalent to\nStrawson’s “sortal”. Unfortunately, that cannot be\nexactly true since 1960: 91 Quine says that “object”\ndivides its reference, though we have seen “object” is not\na sortal by the criteria of Strawson or Wiggins because it does not\nenable counting.\n\nQuine does not give an explicit criteria for determining when a term\n“divides its reference”, but some have been proposed on\nhis behalf. Wallace (1965) discusses two understandings of the term.\nThe first is\n\nG divides its reference iff it is never the case that if\na is G, a can be divided into two parts which are\nG\n\nWhile this characterizes “cat” as a sortal and\n“object” as a non-sortal, it also excludes some terms that\nare sortals by the counting criteria, e.g., garden hoses, rocks, piles\nof snow, sand dunes, amoeba and ice cubes. He also discusses the\nconverse: G divides its reference just in case whenever\na and b are G, the result of putting a and\nb together is never G.\n\nThis will get the easy cases right, as above, but also fails on the\nsame problematic list. (Most of these points were made in Feldman\n1973 where he also explores various other ways of modifying these\nprinciples.)\n\nThe closest Quine comes to an explicit formulation of a\ncharacterization is in contrasting individuative terms with mass\nterms:\n\n\nSo-called mass terms like “water”,\n“footwear” and “red” have the semantical\nproperty of referring cumulatively: any sum of parts which are water\nis water. (1960: 91)\n\n\nBy “sum” here he almost certainly means the mereological\nsum, not the result of physical juxtaposition. This would mean that\n“object” and “space time region” would not be\nsortals, but “spatio-temporally continuous object” and\n“space-time region with volume less than x” are\nsortals. These results may be consistent with Quine’s views\ngiven that he has indicated that he accepts “object”, but\nthey diverge from the Strawson-Wiggins intent. Note that the three\nterms listed above have some significant differences;\n“water” refers to a kind of stuff, “footwear”\nto a kind of thing, and “red” is a property of both stuff\nand things. (See Laycock 2011 and the entry on\n object\n for further discussion.)\n\nIn any event, Quine’s view of the distinction is much more\npragmatic than most. In explaining the distinction he says:\n\n\nThe contrast lies in the terms and not in the stuff they name.\n…consider “shoe”, “pair of shoes”, and\n“footwear”: all three range over exactly the same stuff,\nand differ from one another solely in that two of them divide their\nreference differently and the third not at all. (1960: 91)\n\n\nEven this characterization of a contrast is dubious if we note that by\nthe last criterion “object with mass more than 2 kg” is\nnot an individuative term since the sum of any two such objects is\nanother such object, whereas “object with mass less than 2\nkg” fails the test since the sum of two such objects sometimes\nhas mass over 2 kg. It is difficult to see any important respect in\nwhich the two expressions divide their reference differently. Object\nmore than 2 kg and object less than 2 kg seem to divide their\nreference.\n\nAnother, example, given by Feldman (1973), can be used to illustrate\nthe somewhat capricious nature of the distinction and its language\ndependence. He claims that “five-foot garden hose” is an\nindividuative term since no part of it is a five-foot garden hose, but\n“garden hose” is not individuative. The latter claim\nrequires some qualification. If being a garden hose requires a\ncoupling on one end and a nozzle on the other, then the halves of a\ngarden hose are not garden hoses. If being a garden hose requires\nneither a nozzle nor coupling, then each half (indeed each\nnth, up to some n) of a garden hose is a\ngarden hose. If being a garden hose requires a coupling but not a\nnozzle, then one half of a garden hose is a garden hose but the other\nis not. Although the differences may be important to the gardener, it\nis difficult to see anything metaphysically deep here.\n6. Sortals for abstract objects\n\nMost discussions of sortals focus on kinds of physical objects, but by\nthe definitions given many sortals also apply to abstract objects. And\nin some of these cases the question what is a criterion of identity\nbecomes even more difficult. We can ask how many new ideas a political\ncandidate has, how many governments Italy has had since 1950 and how\nmany books David Wiggins has written. Ideas, governments and books (in\nthe sense of type of book, not specific copies) are all abstract\nobjects. We comment on changes in corporations over time—Apple\nhas grown—which implies identifying Apple over time in spite of\nchanges. But we are far short of having criteria to make decisions in\nharder cases: Did Rice Institute cease to exist in 1960 or was it just\ntransformed with a new name and some changes in charter to Rice\nUniversity. The buildings, faculty and students all persisted, but did\nthe educational institution?\n\nThe question can perhaps be made more pointed if we consider sortals\nfor collections that do not imply complex structure. Corporations are\ncomplex, as are educational institutions. In contrast, a flock of\nbirds does not entail a great deal of complexity, just enough birds in\none location. We can sometimes definitively say that two flocks are\nthe same: if exactly the same birds flew over the lake this morning as\ndid yesterday then the two flocks are in fact one. And if none of the\nbirds that flew over the lake yesterday were in today’s flock,\nthen they are definitively different. But suppose most but not all\nwere the same birds?\n\nMathematics also presents issues about what counts as a criterion,\neven when the definition is quite precise. Two irrational numbers\nx and y are identical if they have exactly the same\nrelations to each of the rational numbers. Pi is identical with\n3.14… because Pi is greater than 3, 3.1, 3.14, etc and less\nthan 4, 3.2, 3.15, etc. But does this count as a criterion? It appeals\nto the less than relation, which is a close cousin to identity itself\nand it involves relations to similar entities. \n\nYet another issue involves possible identification between different\nkinds of numbers. There is a natural number 2, a positive integer +2,\na rational number 2/1, a real number 2.0000… Are these the same\nnumber? Different understandings of number and different philosophies\nof mathematics offer differing answers. But these controversies seem\ninsufficient reason to deny “number” the status of a\nsortal.\n7. Sortals and cognition\n7.1.Sortals for infants \n\nIs “physical object” a sortal? The general opinion among\nphilosophers is that physical object is not a sortal. One reason for\nthis conclusion is that to say something is a physical object does not\ngive its essence, it doesn’t determine what kind of thing it\nis—this depends on the essence notion of sortal. A second\nargument is that it does not provide criteria for counting—the\ntwo halves of a physical object are also physical objects—this\ndepends on the counting notion of sortal. A third is that it gives the\nwrong persistence conditions—the physical object which is a car\nfor a period of time and then becomes a cube of crushed metal is not\nthe same thing. This combines the essence and counting criteria for\nsortals.\n\nAyers (1974) argued that the concept of a physical object is\nfundamental to human cognitive processing and that it does provide\ncriteria for counting and persistence even though it is not a sortal\nsince it does not specify an essence. One important part of his\nargument is the clarification that a physical object is not simply the\nstuff of spatio-temporally continuous space time region but is a the\nstuff of a maximal region. That is, we do not generally regard any\nproper part of a physical object as a physical object.\n\nThe psychologist Xu (1997) has argued that the concept of a physical\nobject is an essential part of cognitive development and is present in\ninfants at a quite early stage. And she argued that physical object is\na sortal because there are counting and persistence conditions (Spelke\n1990). In contrast to Ayers, she argued that the physical object\npersists through even fairly dramatic changes, including her Biblical\nexample of Lot’s wife becoming a pillar of salt (Xu 1997). Her\nposition based on her own work and that of others (Xu & Carey\n1996, Spelke 1996) is that the acquisition of the physical object\nconcept is a crucial stage in cognitive development and is a step\ntoward the development of the more refined sortal concepts that come\nwith language acquisition. And she agrees with Ayers that the\nprimitive concept remains in the cognitive repertoire of adults and\ncan be deployed in cases where someone is confronted with a physical\nobject whose further characteristics are as yet unknown. A similar\nargument is presented in Sarnecki (2008) for the necessity of a\ngeneral sortal for objects as an intermediate step toward the\nacquisition of the sortals of language.\n\nQuine (1960) articulated the claim that differentiation of the world\ninto objects occurs only with the acquisition of language and with the\nconceptual apparatus of identity and quantification. Soja et al.(1991) have provided experimental evidence that might empirically refute Quine’s view. Moreover, research results in primates, such as those presented in Phillips and Santos (2007), and Mendes et al.(2008), provide additional empirical support against Quine’s claim. Nonetheless, a weaker version of Quine’s view has found empirical backing in Imai and Genter (1997) and Yoshida and Smith (2003), as far as quantitative differences are concerned. Also, Xu (2002) has argued that linguistic labels may play a role (in 9-months-old infants) in the acquisition of sortal concepts in infancy.\n\nIn any case, given the basic importance of object information for navigating the\nsurrounding world, it would be surprising if at least some aspects of\nthe concept of physical object was not shared by other species. There has been some\nuncertain evidence of this in primates, and recently appears to be\nstrong evidence of such a concept in very young chickens (Fontanari\net al.2014).\n7.2 Sortals, essences and basic level objects\n\nGelman (2003,2013) and others have provided evidence suggesting a mode of cognition of an essentialist character already operative in children. Specific categories of object and stuff (such as those represented by mass terms and sortals for natural and social kinds, as well as for artifacts) are here assumed to possess an underlying reality that cannot be observed directly. This assumption explains and grounds children’s inductive inferences based on the categories in question. It also explains children’s implicit assignment of causal and other non-obvious properties, as well as sharp and immutable boundaries to such categories. Children view some of these properties as innate. Research results (Caccione et al. 2016; Mendes et al.2018, 2011; and Santos et al.2002) highlight the possibility that essentialist cognition might develop in humans at a pre-linguistic stage, in the form of sortal object individuation. This might apply to certain primates as well (Phillips et al.2010). \n\nA related line of research initiated by Rosch (1973), Rosch et\nal. (1976) suggests that there is a category of basic level\nobjects. Although context can lead to classifications at greater or\nlesser levels of specificity, in most contexts there is a common level\nof description that speakers prefer. For example, while we might\ngenerally describe something as a mammal or a poodle, the most common\nand natural noun would be “dog”. Rosch found considerable\ncommonality in what are regarded as basic level objects across\ncultures although there is some variation. Her characterization of the\nbasic level classifications is that those are the level at which\nrelatively accessible information (shape, color, form of movement)\nprovide the most information about other properties of the object. If\nit is self-moving and dog-shaped it is likely to bark, eat meat, chase\ncats, et cetera. \n\nAlthough Roschian basic level objects are good candidates for\ninformative answers to the question “What is it?” they do\nnot provide traditional essences. Traditional essences as\nconceptualized by philosophers and most psychologists are necessary\nand sufficient conditions for being a member of that kind. On that\nconception, learning a new sortal requires knowing the elements and\nhow they combine to define the new kind. On Rosch’s conception,\nsortal words are learned in families and the primary learning\nexperience is becoming familiar with the prototypical members of the\nkind. Prototypes are the best examples, produce the quickest responses\nwhen subjects are queried about kinds, and are the most frequently\ncited when subjects are asked to give examples. In the category of\nbirds, robins are one of the most prototypical, swans are intermediate\nand penguins are very unprototypical. Evidence for Rosch’s view\nof categories, which has clear roots in the views of Wittgenstein,\nconsists of the failure to produce adequate necessary and sufficient\nconditions for most common sortals, as well as the positive\nexperimental evidence just cited.\n\nRelated to the issues of essence, Markman (1989) and Markman et\nal. (2003) have argued that children’s early language learning\nis guided by several principles, one of which is the mutual\nexclusivity constraint. This constraint is that in learning words a\nguiding assumption should be that distinct words refer to distinct\nthings. While this is not always true, Markman and others provide\nevidence that this constraint is operative, and that in the language\nlearning environment of young children it is a very helpful, if\nimperfect constraint. If Rosch is correct about the existence of a\npreferred basic level of objects, it may be that speakers generally\nuse words at that level of objects and thus the exclusivity constraint\nmay be supported by the basic level object hypothesis. However, the\nexperimental data are apparently conflicting on these questions\n(Mervis et al. 1994). Scholl (2008) provides a useful discussion of\nwhether and how philosophy and psychology can interact beneficially in\nunderstanding these issues.\n8. Sortals and Logic\n8.1 Sortals and standard logic\n\nSome philosophers, perhaps most notably Carnap (1950) have used a\nconcept closely akin to sortals in formulating many-sorted logics.\nThere is a technical point to be explained and a controversy to be\ndiscussed in relation to these.\n\nSometimes in applications of first order logic, i.e., when we are\ndealing at length with a specific class of interpretations the domain\ndivides into intuitively disparate kinds of objects, e.g., people and\nnumbers. In the usual formulation, one has predicates, e.g., Px\nand Nx which are true of those kinds of things respectively,\nand so one translates the English sentence “All numbers are\nodd” as \\((\\forall x)(Nx \\rightarrow Ox)\\) and “Some\nperson is tall” as \\((\\exists x)(Px \\mathbin{\\&} Tx)\\). In a\nmany-sorted logic distinct variables are used for the different kinds\nof objects, perhaps m, n,… for numbers and\np, q,… for people. In this language combinations\nof variables with predicates are sometimes restricted so that\nNm and Tp are well-formed but Np and Tn\nare not. If one does not make this restriction then the notation is\nexactly equivalent to standard first-order logic. A many-sorted\nlanguage is expressively equivalent to a single sorted one which has\nadditional predicates for the various sorts of things (cf. Quine\n1966).\n\nFrom a purely technical point of view, one can introduce different\nkinds of variables to reflect any distinction one wants, e.g., there\ncould be distinctive styles of variables for even numbers as opposed\nto odd ones, or for left-handed people as opposed to right-handed.\nHowever, Carnap and others who advocated a many-sorted logic for\nreasons that were more ontological than pragmatic introduced different\nvariables only for what they believed were metaphysically distinct\nkinds of entities, e.g., numbers, physical objects, sense data. In\nthis respect, there is some parallel with ultimate sortals as\ndiscussed above, although Carnap does not make an explicit connection\nwith earlier writers.\n\nA related use of many-sorted logic is to provide a kind of translation\nfrom second-order logic into a first-order logic. In this case instead\nof having second-order quantification over sets (or properties), one\nstays with a first-order language which is supplemented with a\npredicate true of all and only sets (or properties), a distinct style\nof variables for those entities, and with a two-place relation of\neither membership or instantiation.\n8.2 Logics of sortals\n\nStandard logic treats all predicate expressions alike—the\npredicates can be interpreted as any subset of the domain of\nquantification. If any of the claims discussed above about sortals are\ncorrect, then the sortal predicates have distinctive properties, and a\nmore sophisticated logical treatment might provide philosophical\nillumination. One obvious and agreed on principle is that in general\nthe negation of a sortal predicate is not a sortal. This contrasts\nwith the predicates of standard logic where if F is a\npredicate, so is \\(\\neg F\\), (not-F).\n\nThis principle holds regardless of which interpretation of\n“sortal” you take. Not only is “is not a cat”\nnot a substantive sortal (Wiggins), you cannot count the non-cats\nsince they include dogs, table, molecules, et cetera.\nHowever, for two of the other logical operators, disjunction and\nconjunction, the situation seems more complex. The expressions\n“dog or cat”, “apple or orange” and\n“fork or spoon” all seem to be well-behaved with respect\nto counting and identifying; we can easily imagine a city ordinance\nforbidding homeowners to have more than four dogs or cats. On the\nother hand, “dog or natural number” and “cat or\nclock” seem to provide methods of counting but seem unnatural as\nsortals.\n\nThe first “sortal logic” was developed in Stevenson\n(1975). Stevenson develops an account in which he says “We use\nideas of Geach, Wallace and Wiggins, although we depart from each in\ncertain respects” (1975: 186). Although the formalism follows\nWallace in some respects, the main ideas seem to be those of Wiggins\nrather than Geach. Specifically, his theorem 3.4.5 affirms that for\nany sortals F, G, if b and c are the same\nF, and b is a G, then b and c are\nthe same G, which is a denial of Geach’s relative\nidentity thesis.\n\nTwo principles that Stevenson adopts following Wiggins are:\n\n(i)\n For every sortal F, either F is an ultimate sortal, or there\nis an ultimate sortal G such that F is a restriction\nof G.\n(ii)\n If\ntwo sortals F and G intersect, i.e., they are both true\nof at least one object, then there is a common sortal\nH of which both F and G are restrictions.\n\n\nStevenson proves the formal consistency and completeness of his set of\naxioms. It should be noted that completeness here is with respect to\nthe language used. Since this is a minor adaptation of standard logic,\nthere is no treatment of tense or modality, some essential elements of\nWiggins’s notion of sortal cannot be expressed, e.g., if a\nsortal F applies to b at one time, then it applies to\nb at all times at which b exists, and if a sortal\nF applies to b, then F necessarily applies to\nb.\n\nStevenson does not permit combinations of sortal expressions,\npresumably because there is no easy way to deal with disjunctions and\nconjunctions of sortals in his formulation. However, a slight\ncomplication of his language would suffice to handle the problem. He\nuses “uS” for the ultimate sortal which governs\nsortal “S”. If instead he introduced a set of\nletters \\(U'\\), \\(U''\\) … for ultimate sortals, he could then\nsuperscript sortal expressions to indicate the ultimate sortal that\ngoverns them. He could then permit the disjunction of \\(S^{U'}\\) and\n\\(T^{U'}\\) since they are governed by the same ultimate sortal, but\nforbid the disjunction of \\(S^{U'}\\) and \\(T^{U''}\\) since they are\ngoverned by different ultimate sortals.\n\nCocchiarella (1977) presents a formal language, though no axioms or\nrules, for a logic of sortals which includes both tense and modal\noperators. His approach, like Wiggins, considers sortals to be\nconcepts. Unlike Wiggins he gives a definition of “sortal\nconcept”: as a socio-genetically developed cognitive ability or\ncapacity to distinguish, count and collect or classify things (1977:\n441). He disagrees with Wiggins on both principles\n (i) and (ii) above,\narguing that while they may be true for natural kind terms, there are\nno reasons to believe that there are ultimate sortals of which various\nartifact sortals are restrictions, nor that every intersection of\nsortals must fall under an ultimate sortal. Cocchiarella’s\napproach also goes beyond Stevenson’s in that it involves\nsecond-order logic, i.e., it includes quantification over sortal\nconcepts.\n\nCocchiarella’s ideas have been presented in more rigorous formal\ndetail with axioms and consistency and completeness results for\nsecond-order logic in Freund (2000), tense logic (2001) and modalities\n(2004). More recently, Freund (2019) has formulated several bidimensional logics for sortals that consider modal, tense, and epistemic modalities, as well as complex sortals (i.e., sortals that involve logical combinations of other sortals). These systems presuppose a conceptualist philosophical background closely related to Cocchiarella’s but somewhat more general.\n\nGuarina, Carrara, and Giaretta (1994) develop an account of sortals\nwithin knowledge representation, a subfield of artificial intelligence\nintended to bridge the gap between abstract formal logics and natural\nlanguages. Their definition of a sortal is that it is a predicate that\nprovides countability and is temporally stable. A predicate provides\ncountability if it does not apply to any proper part of what it\napplies to. As they explain this, “student” provides\ncountability because no proper part of a student is a student; but\n“red” does not provide countability because parts of red\nthings are also red. Temporal stability means that if the predicate\napplies to something at one time then it must at some other times as\nwell. This is approximately the concept Strawson had in mind. They go\non to distinguish a subset of these, the substantial sortals. A\nsubstantial sortal is one that, if it applies at all, necessarily\napplies all times. This is in close agreement with Wiggins’ use\nof the term. So while “student” provides countability and\nis temporally stable, it is not ontologically rigid, so it is a sortal\nbut not a substantial sortal. On the other hand, a cat is always\nnecessarily a cat.\n\nAlthough there are obvious affinities with Strawson and Wiggins, it\nshould be noted that Guarino et al. (1994) are primarily concerned\nwith the distinction between kinds and properties of kinds, while the\nphilosophers were more concerned with things and the stuff they are\nmade of.\n\nBelnap and Müller develop an alternative account of sortals\nwithin a non-standard formal logic for tense and modality. Unlike the\nusual background of possible worlds for modality, they use ideas from\nBressan (1972) and adopt\ncases as the fundamental background notion They define a\nsortal as a predicate which is modally constant and provides\nseparability. A predicate is modally constant iff it applies\nnecessarily to something whenever it possibly applies. The idea is\nthat while someone might possibly be a student without necessarily\nbeing a student, if they are human they are necessarily human. Thus\n“student” is not a sortal but “human” is. A\npredicate is modally separated just in case it is necessarily true\nthat if any two things having the property are possibly identical,\nthen they are in fact necessarily identical. Using their technical\nterminology of cases, if two things which have a modally separated\nproperty coincide in any case, then they coincide in every case.\nBelnap and Müller are explicit that they are providing a formal\nframework for classifying predicates, but that applications will\nrequire other kinds of thought:\n\n\nwhether a particular predicate is absolute is assumed to be not a\nmatter of logic, but rather of science and metaphysics. (Belnap &\nMüller 2014: 397)\n\n\nWhile there is a shared core of concerns in these last two approaches,\nit is clear that in addition to the superficial difference that Belnap\nand Müller restrict “sortal” to approximately the\nsubstantial sortals as defined in Guarino et al. 1994, there are\ndifferences even in the area of overlap. Modal rigidity and modal\nconstancy are very similar. (Some caution is necessary here since the\nmodal logic frameworks differ.) But Belnap and Müller emphasize\nmodal separability and do not mention a counting requirement, Guarino\net al. (1994) require countability but are not concerned with modal\nidentities.\n\nIn addition to Guarino et al. (1994), computational applications of the notion of sortal can be found recently in upper ontology, a relatively new field in computer sciences. For example, Guizzardi and Wagner (2010) make central use of the notion of sortal in a conceptual framework they call Unified Foundational Ontology (UFO). This framework can be used in the design and evaluation of conceptual modeling languages. In UFO, the focus on sortals is on the identity criteria they provide, which contrasts with Guarino et al. (1994) where the emphasis is put instead on countability and persistence. Besides, UFO makes a distinction, among sortals, between rigid and anti-rigid sortals. An instance of a rigid sortal S will be an instance of S in every possible world in which it exists. Anti-rigid sortals will not comply with this feature. From the authors’ examples and further claims, it is clear that rigid sortals correspond to substance sortals and anti-rigid to phase sortals. Because possible worlds are involved, UFO’s framework seems to be committed to individual essentialism. One will then ask whether UFO’s general goal is achievable, given the critique of such essentialism by philosophers of biology. We should finally note that one can also appeal to a tense logic framework to illuminate the distinction between substance and phase sortals, in contrast with UFO’s modal approach.(See Rybola and Pergl (2016a, 2016b) for further examples of recent applications of the notion of sortal in computational ontology.) \n9. Conclusion\n\nA large number of thoughtful philosophers have believed that the\ncategory of sortal was philosophically significant and this\nis a strong indication that there is something important they are\nattempting to delineate and analyze. In the last two decades cognitive\npsychologists and formal ontologists have applied the term in their\nresearch. However, our dissection of the definitions and discussions\nshow that there are numerous distinctions in question and while these\ndistinctions have significant overlap, they are not identical. It\nremains to be seen whether the sortal/non-sortal distinction marks one\nvery important difference, or numerous less important distinctions\nrelated in complex ways.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Ayers, Michael R., 1974, “Individuals without\nsortals”, <em>Canadian Journal of Philosophy</em>, 4(1):\n113–148.",
                "Baker, Lynne Rudder, 2004, “The Ontology of Artefacts”, <em>Philosophical Explorations</em>, 7: 99–112.",
                "–––, 2007, \n <em>The Metaphysics of Everyday Life</em>, New York: Cambridge University Press.",
                "–––, 2008, “The shrinking difference between artifacts and natural kinds”, Piotr Boltuc (ed), <em>Newsletter on Philosophy and Computers. American Philosophical Association Newsletters</em>, 7(2): 1–10.",
                "Belnap, Nuel and Thomas Müller, 2014, “CIFOL:\nCase-Intensional First Order Logic (I) Toward a Theory of\nSorts”, <em>Journal of Philosophical Logic</em>, 43(2):\n393–437. doi:10.1007/s10992-012-9267-x ",
                "Black, Max, 1952, “The identity of indiscernibles”,\n<em>Mind</em> (New Series), 61(242): 53–64.",
                "Bressan, Aldo, 1972, <em>A general interpreted modal\ncalculus</em>, New Haven: Yale University Press.",
                "Brody, Baruch, 1980, <em>Essence and Identity</em>, Princeton:\nPrinceton University Press.",
                "Cacchione, T., C. Hrubesch, and J. Call, 2016, “Are apes essentialists? Scope and limits of psychological essentialism in great apes”, <em>Animal Cognition</em>, 19(5): 921–37.",
                "Carnap, Rudolf, 1950, “Empiricism, semantics and\nontology”, <em>Revue Internationale de Philosophie</em>, 4:\n40–50",
                "Carrara, M., and P. Vermass, 2009, “The fine-grained metaphysics of artefactual and biological functional kinds”, <em>Synthese</em>, 169: 125–143.",
                "Cartwright, Richard, 1987, “On the logical problem of the\ntrinity”, <em>Philosophical Essays</em>, Cambridge, MA: MIT\nPress, pp. 187–200.",
                "Cocchiarella, Nino, 1977, “Sortals, natural kinds and\nre-identification”, <em>Logique et Analyse</em>, 20:\n438–474.",
                "Devitt, M., 2018, “Individual essentialism”, <em>Biology and Philosophy</em>, 33: 1–22.",
                "Dummett, Michael, 1973, <em>Frege: Philosophy of Language</em>,\nLondon: Duckworth.",
                "Feldman, Fred, 1973, “Sortal predicates”,\n<em>Noûs</em>, 7: 268–82. doi:10.2307/2214351 ",
                "Ferner, A.M., 2016, <em>Organism and Personal Identity. Biological Individuation and the Work of David Wiggins</em>, New York: Routledge.",
                "Fontanari, Laura, Rosa Rugani, Lucia Regolin, &amp; Giorgio\nVallortigara, 2014, “Use of kind information for object\nindividuation in young domestic chicks”, <em>Animal\nCognition</em>, 17(4): 925–935.\ndoi:10.1007/s10071-013-0725-9",
                "Forbes, Graeme, 1985, <em>The Metaphysics of Modality</em>,\nOxford: Oxford University Press.",
                "Frege, Gottlob, 1884, <em>The Foundations of Arithmetic</em>, J.L.\nAustin (trans.), Evanston: Northwestern University Press, 1978.",
                "Freund, Max A., 2000, “A complete and consistent formal\nsystem for sortals”, <em>Studia Logica</em>, 65(3):\n367–81.",
                "–––, 2001, “A temporal logic for\nsortals”, <em>Studia Logica</em>, 69: 351–80.",
                "–––, 2004, “A modal sortal logic”,\n<em>Journal of Philosophical Logic</em>, 33(3): 237–60.\ndoi:10.1023/B:LOGI.0000031381.56344.a9",
                "–––, 2019, <em>The Logic of Sortals. A Conceptualist Approach. Synthese Library 408</em>, Cham, Switzerland: Springer Verlag.",
                "Furth, Montgomery, 1988, <em>Substance, Form and Psyche: an\nAristotelean Metaphysics</em>, Cambridge: Cambridge University\nPress.",
                "Geach, Peter Thomas, 1962, <em>Reference and Generality: An\nExamination of some Medieval and Modern Theories</em>, Ithaca: Cornell\nUniversity Press.",
                "Gelman, Susan A., 2003, <em>The Essential Child: Origins of Essentialism in\nEveryday Thought</em>, New York: Oxford University Press.",
                "–––, 2013, “Artifacts and Essentialism”,\n<em>Review of Philosophy and Psychology</em>, 4(3): 449–63.",
                "Griffin, Nicholas, 1977, <em>Relative Identity</em>, Oxford:\nClarendon Press.",
                "Guarino, Nicola, Massimiliano Carrara, &amp; Pierdaniele Giaretta,\n1994, “An Ontology of Meta-Level Categories”, in\n<em>Principles of Knowledge Representation and Reasoning: Proceedings\nof the Fourth International Conference</em> (KR ’94), Jon Doyle, Erik\nSandewall, Pietro Torasso (eds.), San Francisco: Morgan Kaufmann,\npp. 270–280.",
                "Guizzardi,G., and G. Wagner, 2010, “Using the Unified Foundational Ontology (UFO) as foundation for general conceptual modeling languages”, R. Poli, R. Healy, and A. Kameas (eds.), <em>Theory and Applications of Ontology: Computer Applications</em>, Dordrecht: Springer Verlag, pp. 175–96.",
                "Imai, M., and D. Gentner, 1997, “A cross-linguistic study of early word meaning: Universal ontology and linguistic influence”,\n<em>Cognition</em>, 62: 169–200.",
                "Johnston, Mark, 1992, “Constitution Is Not Identity”,\n<em>Mind</em>, NS 101(401): 89–105.",
                "Jubien, Michael, 1996, “The myth of identity\nconditions”, <em>Philosophical Perspectives</em>, 10:\n34–55. doi:10.2307/2216251",
                "Ladyman, J., O. Linnebo, and R. Pettigrew, 2012, “Identity and discernibility in philosophy and logic”, <em>The Review of Symbolic Logic</em>,\n5(1): 162–86.",
                "Laporte, J., 1997, “Essential membership”, <em>Philosophy of Science</em>, 64: 96–112.",
                "Laycock, Henry, 2011, “Any sum of parts which are water is\nwater”, <em>Humana Mente. Journal of Philosophical Studies</em>,\n19(1): 41–46.",
                "Locke, John, 1975 [1690], <em>An Essay Concerning Human\nUnderstanding</em>, P.H. Nidditch (ed.), Oxford: Oxford University Press.",
                "Losonsky, M., 1990, “The nature of artefacts”, <em>Philosophy</em>, 65: 81–88.",
                "Lowe, E.J., 1989, “What is a criterion of identity?”,\n<em>The Philosophical Quarterly</em>, 29: 1–21.\ndoi:10.2307/2220347 ",
                "–––, 1997, “Objects and criteria of identity”, Bob Hale and Crispin Wright (eds.), \n<em>A Companion to the Philosophy of Language</em>, Oxford: Blackwell, 613–33.",
                "–––, 2009,\n<em>More Kinds of Beings: a Further Study of Individuation, Identity, and the Logic of Sortal Terms</em>, Sussex: Wiley–Blackwell.",
                "Mackie, Penelope, 1994, “Sortal concepts and essential\nproperties”, <em>The Philosophical Quarterly</em>, 44:\n311–33. doi:10.2307/2219612 ",
                "–––, 2006, <em>How Things Might Have Been: Individuals, Kinds, and Properties</em>, Oxford: Oxford University Press.",
                "Markman, Ellen M., 1989, <em>Categorization and naming in\nchildren</em>, Cambridge, MA: MIT Press.",
                "Markman, Ellen M., Judith L. Wasow, &amp; Mikkel B. Hansen, 2003,\n“Use of the mutual exclusivity assumption by young word\nlearners”, <em>Cognitive Psychology</em>, 47:\n241–275.",
                "Mendes, N., H. Rakoczy, and J. Call, 2008, “Ape metaphysics: Object individuation without language”,\n<em>Cognition</em>, 106: 703–49.",
                "–––, 2011, “Primates do not spontaneously use shape properties for objects individuation: A competence or a performance problem?”,\n<em>Animal Cognition</em>, 14: 407–14.",
                "Merricks, Trenton, 1998, “There are no criteria of identity\nover time”, <em>Noûs</em>, 32: 106–24.",
                "Mervis, Carolyn B., Roberta Michnick Golinkoff, &amp; Jacquelyn\nBertrand, 1994, “Two-year-olds readily learn multiple labels for\nthe same basic-level category”, <em>Child Development</em>,\n65(4): 1163–1177. doi:10.2307/1131312 ",
                "Millikan, Ruth G., 1998, “A common structure for concepts of\nindividuals, stuffs and basic kinds: More mama, more milk and more\nmouse”, <em>Behavioral and Brain Sciences</em>, 22(1):\n55–65. doi: 10.1017/S0140525X98000405",
                "Noonan, Harold W., 1993, “Constitution is Identity”,\n<em>Mind</em>, NS 102(405): 133–146.",
                "Okasha, S., 2002, “Darwinian metaphysics: Species and the question of essentialism”, <em>Synthese</em>, 131(2):\n191–213.",
                "Pelletier, F. P. (ed.), 1979,<em> Mass Terms: Some Philosophical Problems. Synthese Library 6</em>, Dordrecht, The Netherlands: Reidel.",
                "–––, 2010, <em>Kind, Things and Stuff: Mass Terms and Generics. New Directions in Cognitive Science</em>, Oxford: Oxford University Press.",
                "Phillips, W., and L. Santos, 2007, “Evidence of kind representation in the absence of language: Experiments with rhesus monkeys”,\n<em>Developmental Science</em>, 13(4): F1–F7.",
                "Phillips, W., M. Shankar, and L. Santos, 2010, “Essentialism in the absence of language? Experiments with rhesus monkeys”,\n<em>Cognition</em>, 102: 455–63.",
                "Putnam, Hilary, 1975, “The meaning of\n‘meaning’”, in H. Putnam, <em>Mind, Language and\nReality</em>, Cambridge: Cambridge University Press, pp. 215–271.\ndoi:10.1017/CBO9780511625251.014",
                "Quine, W.V.O., 1960, <em>Word and Object</em>, Cambridge MA: MIT\nPress.",
                "–––, 1964, “Review of <em>Reference and\nGenerality</em>”, <em>The Philosophical Review</em>, 73:\n100–104.",
                "–––, 1966, “On Carnap’s views on\nontology”, in <em>The Ways of Paradox</em>, New York: Random\nHouse, pp. 126–134. ",
                "–––, 1969, “Speaking of objects”,\n<em>Ontological Relativity</em>, New York: Columbia University\nPress, pp. 1–25.",
                "–––, 1981, “Things and their place in\ntheory”, <em>Theories and Things</em>, Cambridge, MA: Harvard\nUniversity Press, pp. 1–23.",
                "Robertson, T., 1998, “Possibilities and the argument of\norigin essentialism”, <em>Mind</em>, 107: 729–49.",
                "–––, 2000, “Essentialism: Origin and\norder”, <em>Mind</em>, 108: 299–307.",
                "Rosch, Eleanor H., 1973, “Natural categories”,\n<em>Cognitive Pyschology</em>, 4(3): 328–50.",
                "Rosch, Eleanor, Carolyn B. Mervis, Wayne D. Gray, David M.\nJohnson, and Penny Boyes-Braem, 1976, “Basic objects in natural\ncategories”, <em>Cognitive Psychology</em>, 8:\n382–439B",
                "Rybola, Z. and R. Pergl, 2016a, \n“Towards OntoUML for software engineering: Transformation of Anti-rigid sortal types into relational databases”, in L. Bellatreche, O. Pastor, J.M. Almendros Jiménez, Y. Aït-Ameur (eds.), <em>Model and Data Engineering. 6th International Conference, MEDI 2016. Almería, Spain. September 21–23, 2016 Proceedings.</em>, Cham, Switzerland: Springer Verlag, pp. 270–280.",
                "Rybola, Z. and R. Pergl, 2016b, “Towards OntoUML for software engineering: Introduction to the transformation of OntoUML into relational data bases”, in R. Pergl, M. Molhanec, E. Babkin, S. F. Wamba (eds.),\n<em>Enterprise and Organizational Modeling and Simulation. 12th International Workshop, EOMAS 2016. Ljubljana, Slovenia, June 13, 2016. Selected Papers</em>, Cham, Switzerland: Springer Verlag, pp. 67–83.",
                "Salmon, Nathan, 1981, <em>Reference and Essence</em>, Princeton:\nPrinceton University Press.",
                "–––, 1997, “Wholes, Parts, and\nNumbers”, <em>Noûs</em>, 31: 1–15.",
                "Santos, L., G. Sulkowski, G. M. Spaepen, and M.D.Hauser, 2002, “Object individuation using property/kind information in rhesus macaques (Macaca Mulata)”,\n<em>Cognition</em>, 83(3): 241–64.",
                "Sarnecki, John E., 2008, “Sortals for dummies”,\n<em>Erkenntnis</em>, 69(2): 145–164.\ndoi:10.1007/s10670-007-9094-6",
                "Scholl, Brian J., 2008, “Object persistence in philosophy\nand psychology”, <em>Mind &amp; Language</em>, 22(5):\n563–591",
                "Sider, Theodore, 1996, “All the World’s a\nStage”, <em>Australasian Journal of Philosophy</em>, 74:\n433–453",
                "Snowdon, Paul F., 2009, “On the Sortal Dependency of\nIndividuation Thesis”, Heather Dyke (ed.), <em>From Truth to\nReality</em>, London: Routledge, pp. 254–271.",
                "Soja Nancy N., Susan Carey, and Elizabeth S. Spelke, 1991,\n“Ontological categories guide young children’s inductions of\nword meaning: object terms and substance term”,\n<em>Cognition</em>, 38: 179–211.",
                "Spelke Elizabeth S., 1990, “Principles of object\nperception”, <em>Cognitive Science</em>, 14(1):\n29–56.",
                "–––, 1996, “Initial knowledge: six\nsuggestions”, <em>Cognition</em>, 50: 431–445.",
                "Spinoza, Baruch, 1674, “Letter to Jarig Jellis”,\nin <em>The Letters</em>, Samuel Shirley (trans.), Indianapolls:\nHackett, 1995, p. 259.",
                "Stevenson, Leslie, 1975, “A formal theory of sortal\nquantification”, <em>Notre Dame Journal of Formal Logic</em>,\n16(2): 185–207. doi:10.1305/ndjfl/1093891700",
                "Strawson, P.F., 1959, <em>Individuals</em>, London: Methuen.",
                "–––, 1976, “Entity and identity”, in\n<em>Contemporary British Philosophy</em>, Fourth Series, H. Lewis\n(ed.), London: George Allen &amp; Unwin. Reprinted in Strawson 1997b:\n21–51. doi:10.1093/0198250150.003.0002",
                "–––, 1997a, “Introduction”, in Strawson 1997b:\n1–20. doi:10.1093/0198250150.001.0001 ",
                "–––, 1997b, <em>Entity and Identity: And Other\nEssays</em>, Oxford: Oxford University Press. ",
                "Wallace, John, 1965, “Sortal predicates and\nquantification”, <em>Journal of Philosophy</em>, 62:\n8–13.",
                "Wiggins, David, 1967, <em>Identity and Spatio-temporal\ncontinuity</em>, Oxford: Blackwell.",
                "–––, 1980, <em>Sameness and Substance</em>,\nCambridge MA: Harvard University Press.",
                "–––, 2001, <em>Sameness and Substance\nRenewed</em>, Cambridge: Cambridge University Press.",
                "–––, 2016, <em>Continuants. Their Activity, Their Being and Their Identity</em>, Oxford: Oxford University Press.",
                "Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.",
                "Xu, Fei, 1991, “Count nouns, sortal concepts and the nature\nof early words”, in <em>Kinds, things, and stuff: Mass Terms and\nGenerics</em> (New Directions in Cognitive Science: Volume 13), F.J.\nPelletier (ed.), Oxford: Oxford University Press, pp. 191–206.\ndoi:10.1093/acprof:oso/9780195382891.003.0010",
                "–––, 1997, “From Lot’s wife to a\npillar of salt: Evidence that <em>physical object</em> is a sortal\nconcept”, <em>Mind and Language</em>, 12(3–4):\n365–92. doi:10.1111/j.1468-0017.1997.tb00078.x",
                "–––, 2002, “The role of language in acquiring object kind concepts in infancy”, <em>Cognition</em>, 85:\n223–50. ",
                "Xu, Fei and Susan Carey, 1996, “Infants metaphysics: The\ncase of numerical identity”, <em>Cognitive Psychology</em>,\n30(2): 111–153. doi: 10.1006/cogp.1996.0005",
                "Yoshida, H., and L. Smith, 2003, “Shifting ontological boundaries: How Japanese and English-speaking children generalize names for animals and artifacts”, <em>Developmental Science</em>, 6(1):1–34.",
                "Zimmerman, Dean W., 1998, “Criteria of identity and the\n‘identity mystic’”, <em>Erkenntnis</em>, 48(2):\n281–301. doi:10.1023/A:1005304508456"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Ayers, Michael R., 1974, “Individuals without\nsortals”, <em>Canadian Journal of Philosophy</em>, 4(1):\n113–148.</li>\n<li>Baker, Lynne Rudder, 2004, “The Ontology of Artefacts”, <em>Philosophical Explorations</em>, 7: 99–112.</li>\n<li>–––, 2007, \n <em>The Metaphysics of Everyday Life</em>, New York: Cambridge University Press.</li>\n<li>–––, 2008, “The shrinking difference between artifacts and natural kinds”, Piotr Boltuc (ed), <em>Newsletter on Philosophy and Computers. American Philosophical Association Newsletters</em>, 7(2): 1–10.</li>\n<li>Belnap, Nuel and Thomas Müller, 2014, “CIFOL:\nCase-Intensional First Order Logic (I) Toward a Theory of\nSorts”, <em>Journal of Philosophical Logic</em>, 43(2):\n393–437. doi:10.1007/s10992-012-9267-x </li>\n<li>Black, Max, 1952, “The identity of indiscernibles”,\n<em>Mind</em> (New Series), 61(242): 53–64.</li>\n<li>Bressan, Aldo, 1972, <em>A general interpreted modal\ncalculus</em>, New Haven: Yale University Press.</li>\n<li>Brody, Baruch, 1980, <em>Essence and Identity</em>, Princeton:\nPrinceton University Press.</li>\n<li>Cacchione, T., C. Hrubesch, and J. Call, 2016, “Are apes essentialists? Scope and limits of psychological essentialism in great apes”, <em>Animal Cognition</em>, 19(5): 921–37.</li>\n<li>Carnap, Rudolf, 1950, “Empiricism, semantics and\nontology”, <em>Revue Internationale de Philosophie</em>, 4:\n40–50</li>\n<li>Carrara, M., and P. Vermass, 2009, “The fine-grained metaphysics of artefactual and biological functional kinds”, <em>Synthese</em>, 169: 125–143.</li>\n<li>Cartwright, Richard, 1987, “On the logical problem of the\ntrinity”, <em>Philosophical Essays</em>, Cambridge, MA: MIT\nPress, pp. 187–200.</li>\n<li>Cocchiarella, Nino, 1977, “Sortals, natural kinds and\nre-identification”, <em>Logique et Analyse</em>, 20:\n438–474.</li>\n<li>Devitt, M., 2018, “Individual essentialism”, <em>Biology and Philosophy</em>, 33: 1–22.</li>\n<li>Dummett, Michael, 1973, <em>Frege: Philosophy of Language</em>,\nLondon: Duckworth.</li>\n<li>Feldman, Fred, 1973, “Sortal predicates”,\n<em>Noûs</em>, 7: 268–82. doi:10.2307/2214351 </li>\n<li>Ferner, A.M., 2016, <em>Organism and Personal Identity. Biological Individuation and the Work of David Wiggins</em>, New York: Routledge.</li>\n<li>Fontanari, Laura, Rosa Rugani, Lucia Regolin, &amp; Giorgio\nVallortigara, 2014, “Use of kind information for object\nindividuation in young domestic chicks”, <em>Animal\nCognition</em>, 17(4): 925–935.\ndoi:10.1007/s10071-013-0725-9</li>\n<li>Forbes, Graeme, 1985, <em>The Metaphysics of Modality</em>,\nOxford: Oxford University Press.</li>\n<li>Frege, Gottlob, 1884, <em>The Foundations of Arithmetic</em>, J.L.\nAustin (trans.), Evanston: Northwestern University Press, 1978.</li>\n<li>Freund, Max A., 2000, “A complete and consistent formal\nsystem for sortals”, <em>Studia Logica</em>, 65(3):\n367–81.</li>\n<li>–––, 2001, “A temporal logic for\nsortals”, <em>Studia Logica</em>, 69: 351–80.</li>\n<li>–––, 2004, “A modal sortal logic”,\n<em>Journal of Philosophical Logic</em>, 33(3): 237–60.\ndoi:10.1023/B:LOGI.0000031381.56344.a9</li>\n<li>–––, 2019, <em>The Logic of Sortals. A Conceptualist Approach. Synthese Library 408</em>, Cham, Switzerland: Springer Verlag.</li>\n<li>Furth, Montgomery, 1988, <em>Substance, Form and Psyche: an\nAristotelean Metaphysics</em>, Cambridge: Cambridge University\nPress.</li>\n<li>Geach, Peter Thomas, 1962, <em>Reference and Generality: An\nExamination of some Medieval and Modern Theories</em>, Ithaca: Cornell\nUniversity Press.</li>\n<li>Gelman, Susan A., 2003, <em>The Essential Child: Origins of Essentialism in\nEveryday Thought</em>, New York: Oxford University Press.</li>\n<li>–––, 2013, “Artifacts and Essentialism”,\n<em>Review of Philosophy and Psychology</em>, 4(3): 449–63.</li>\n<li>Griffin, Nicholas, 1977, <em>Relative Identity</em>, Oxford:\nClarendon Press.</li>\n<li>Guarino, Nicola, Massimiliano Carrara, &amp; Pierdaniele Giaretta,\n1994, “An Ontology of Meta-Level Categories”, in\n<em>Principles of Knowledge Representation and Reasoning: Proceedings\nof the Fourth International Conference</em> (KR ’94), Jon Doyle, Erik\nSandewall, Pietro Torasso (eds.), San Francisco: Morgan Kaufmann,\npp. 270–280.</li>\n<li>Guizzardi,G., and G. Wagner, 2010, “Using the Unified Foundational Ontology (UFO) as foundation for general conceptual modeling languages”, R. Poli, R. Healy, and A. Kameas (eds.), <em>Theory and Applications of Ontology: Computer Applications</em>, Dordrecht: Springer Verlag, pp. 175–96.</li>\n<li>Imai, M., and D. Gentner, 1997, “A cross-linguistic study of early word meaning: Universal ontology and linguistic influence”,\n<em>Cognition</em>, 62: 169–200.</li>\n<li>Johnston, Mark, 1992, “Constitution Is Not Identity”,\n<em>Mind</em>, NS 101(401): 89–105.</li>\n<li>Jubien, Michael, 1996, “The myth of identity\nconditions”, <em>Philosophical Perspectives</em>, 10:\n34–55. doi:10.2307/2216251</li>\n<li>Ladyman, J., O. Linnebo, and R. Pettigrew, 2012, “Identity and discernibility in philosophy and logic”, <em>The Review of Symbolic Logic</em>,\n5(1): 162–86.</li>\n<li>Laporte, J., 1997, “Essential membership”, <em>Philosophy of Science</em>, 64: 96–112.</li>\n<li>Laycock, Henry, 2011, “Any sum of parts which are water is\nwater”, <em>Humana Mente. Journal of Philosophical Studies</em>,\n19(1): 41–46.</li>\n<li>Locke, John, 1975 [1690], <em>An Essay Concerning Human\nUnderstanding</em>, P.H. Nidditch (ed.), Oxford: Oxford University Press.</li>\n<li>Losonsky, M., 1990, “The nature of artefacts”, <em>Philosophy</em>, 65: 81–88.</li>\n<li>Lowe, E.J., 1989, “What is a criterion of identity?”,\n<em>The Philosophical Quarterly</em>, 29: 1–21.\ndoi:10.2307/2220347 </li>\n<li>–––, 1997, “Objects and criteria of identity”, Bob Hale and Crispin Wright (eds.), \n<em>A Companion to the Philosophy of Language</em>, Oxford: Blackwell, 613–33.</li>\n<li>–––, 2009,\n<em>More Kinds of Beings: a Further Study of Individuation, Identity, and the Logic of Sortal Terms</em>, Sussex: Wiley–Blackwell.</li>\n<li>Mackie, Penelope, 1994, “Sortal concepts and essential\nproperties”, <em>The Philosophical Quarterly</em>, 44:\n311–33. doi:10.2307/2219612 </li>\n<li>–––, 2006, <em>How Things Might Have Been: Individuals, Kinds, and Properties</em>, Oxford: Oxford University Press.</li>\n<li>Markman, Ellen M., 1989, <em>Categorization and naming in\nchildren</em>, Cambridge, MA: MIT Press.</li>\n<li>Markman, Ellen M., Judith L. Wasow, &amp; Mikkel B. Hansen, 2003,\n“Use of the mutual exclusivity assumption by young word\nlearners”, <em>Cognitive Psychology</em>, 47:\n241–275.</li>\n<li>Mendes, N., H. Rakoczy, and J. Call, 2008, “Ape metaphysics: Object individuation without language”,\n<em>Cognition</em>, 106: 703–49.</li>\n<li>–––, 2011, “Primates do not spontaneously use shape properties for objects individuation: A competence or a performance problem?”,\n<em>Animal Cognition</em>, 14: 407–14.</li>\n<li>Merricks, Trenton, 1998, “There are no criteria of identity\nover time”, <em>Noûs</em>, 32: 106–24.</li>\n<li>Mervis, Carolyn B., Roberta Michnick Golinkoff, &amp; Jacquelyn\nBertrand, 1994, “Two-year-olds readily learn multiple labels for\nthe same basic-level category”, <em>Child Development</em>,\n65(4): 1163–1177. doi:10.2307/1131312 </li>\n<li>Millikan, Ruth G., 1998, “A common structure for concepts of\nindividuals, stuffs and basic kinds: More mama, more milk and more\nmouse”, <em>Behavioral and Brain Sciences</em>, 22(1):\n55–65. doi: 10.1017/S0140525X98000405</li>\n<li>Noonan, Harold W., 1993, “Constitution is Identity”,\n<em>Mind</em>, NS 102(405): 133–146.</li>\n<li>Okasha, S., 2002, “Darwinian metaphysics: Species and the question of essentialism”, <em>Synthese</em>, 131(2):\n191–213.</li>\n<li>Pelletier, F. P. (ed.), 1979,<em> Mass Terms: Some Philosophical Problems. Synthese Library 6</em>, Dordrecht, The Netherlands: Reidel.</li>\n<li>–––, 2010, <em>Kind, Things and Stuff: Mass Terms and Generics. New Directions in Cognitive Science</em>, Oxford: Oxford University Press.</li>\n<li>Phillips, W., and L. Santos, 2007, “Evidence of kind representation in the absence of language: Experiments with rhesus monkeys”,\n<em>Developmental Science</em>, 13(4): F1–F7.</li>\n<li>Phillips, W., M. Shankar, and L. Santos, 2010, “Essentialism in the absence of language? Experiments with rhesus monkeys”,\n<em>Cognition</em>, 102: 455–63.</li>\n<li>Putnam, Hilary, 1975, “The meaning of\n‘meaning’”, in H. Putnam, <em>Mind, Language and\nReality</em>, Cambridge: Cambridge University Press, pp. 215–271.\ndoi:10.1017/CBO9780511625251.014</li>\n<li>Quine, W.V.O., 1960, <em>Word and Object</em>, Cambridge MA: MIT\nPress.</li>\n<li>–––, 1964, “Review of <em>Reference and\nGenerality</em>”, <em>The Philosophical Review</em>, 73:\n100–104.</li>\n<li>–––, 1966, “On Carnap’s views on\nontology”, in <em>The Ways of Paradox</em>, New York: Random\nHouse, pp. 126–134. </li>\n<li>–––, 1969, “Speaking of objects”,\n<em>Ontological Relativity</em>, New York: Columbia University\nPress, pp. 1–25.</li>\n<li>–––, 1981, “Things and their place in\ntheory”, <em>Theories and Things</em>, Cambridge, MA: Harvard\nUniversity Press, pp. 1–23.</li>\n<li>Robertson, T., 1998, “Possibilities and the argument of\norigin essentialism”, <em>Mind</em>, 107: 729–49.</li>\n<li>–––, 2000, “Essentialism: Origin and\norder”, <em>Mind</em>, 108: 299–307.</li>\n<li>Rosch, Eleanor H., 1973, “Natural categories”,\n<em>Cognitive Pyschology</em>, 4(3): 328–50.</li>\n<li>Rosch, Eleanor, Carolyn B. Mervis, Wayne D. Gray, David M.\nJohnson, and Penny Boyes-Braem, 1976, “Basic objects in natural\ncategories”, <em>Cognitive Psychology</em>, 8:\n382–439B</li>\n<li>Rybola, Z. and R. Pergl, 2016a, \n“Towards OntoUML for software engineering: Transformation of Anti-rigid sortal types into relational databases”, in L. Bellatreche, O. Pastor, J.M. Almendros Jiménez, Y. Aït-Ameur (eds.), <em>Model and Data Engineering. 6th International Conference, MEDI 2016. Almería, Spain. September 21–23, 2016 Proceedings.</em>, Cham, Switzerland: Springer Verlag, pp. 270–280.</li>\n<li>Rybola, Z. and R. Pergl, 2016b, “Towards OntoUML for software engineering: Introduction to the transformation of OntoUML into relational data bases”, in R. Pergl, M. Molhanec, E. Babkin, S. F. Wamba (eds.),\n<em>Enterprise and Organizational Modeling and Simulation. 12th International Workshop, EOMAS 2016. Ljubljana, Slovenia, June 13, 2016. Selected Papers</em>, Cham, Switzerland: Springer Verlag, pp. 67–83.</li>\n<li>Salmon, Nathan, 1981, <em>Reference and Essence</em>, Princeton:\nPrinceton University Press.</li>\n<li>–––, 1997, “Wholes, Parts, and\nNumbers”, <em>Noûs</em>, 31: 1–15.</li>\n<li>Santos, L., G. Sulkowski, G. M. Spaepen, and M.D.Hauser, 2002, “Object individuation using property/kind information in rhesus macaques (Macaca Mulata)”,\n<em>Cognition</em>, 83(3): 241–64.</li>\n<li>Sarnecki, John E., 2008, “Sortals for dummies”,\n<em>Erkenntnis</em>, 69(2): 145–164.\ndoi:10.1007/s10670-007-9094-6</li>\n<li>Scholl, Brian J., 2008, “Object persistence in philosophy\nand psychology”, <em>Mind &amp; Language</em>, 22(5):\n563–591</li>\n<li>Sider, Theodore, 1996, “All the World’s a\nStage”, <em>Australasian Journal of Philosophy</em>, 74:\n433–453</li>\n<li>Snowdon, Paul F., 2009, “On the Sortal Dependency of\nIndividuation Thesis”, Heather Dyke (ed.), <em>From Truth to\nReality</em>, London: Routledge, pp. 254–271.</li>\n<li>Soja Nancy N., Susan Carey, and Elizabeth S. Spelke, 1991,\n“Ontological categories guide young children’s inductions of\nword meaning: object terms and substance term”,\n<em>Cognition</em>, 38: 179–211.</li>\n<li>Spelke Elizabeth S., 1990, “Principles of object\nperception”, <em>Cognitive Science</em>, 14(1):\n29–56.</li>\n<li>–––, 1996, “Initial knowledge: six\nsuggestions”, <em>Cognition</em>, 50: 431–445.</li>\n<li>Spinoza, Baruch, 1674, “Letter to Jarig Jellis”,\nin <em>The Letters</em>, Samuel Shirley (trans.), Indianapolls:\nHackett, 1995, p. 259.</li>\n<li>Stevenson, Leslie, 1975, “A formal theory of sortal\nquantification”, <em>Notre Dame Journal of Formal Logic</em>,\n16(2): 185–207. doi:10.1305/ndjfl/1093891700</li>\n<li>Strawson, P.F., 1959, <em>Individuals</em>, London: Methuen.</li>\n<li>–––, 1976, “Entity and identity”, in\n<em>Contemporary British Philosophy</em>, Fourth Series, H. Lewis\n(ed.), London: George Allen &amp; Unwin. Reprinted in Strawson 1997b:\n21–51. doi:10.1093/0198250150.003.0002</li>\n<li>–––, 1997a, “Introduction”, in Strawson 1997b:\n1–20. doi:10.1093/0198250150.001.0001 </li>\n<li>–––, 1997b, <em>Entity and Identity: And Other\nEssays</em>, Oxford: Oxford University Press. </li>\n<li>Wallace, John, 1965, “Sortal predicates and\nquantification”, <em>Journal of Philosophy</em>, 62:\n8–13.</li>\n<li>Wiggins, David, 1967, <em>Identity and Spatio-temporal\ncontinuity</em>, Oxford: Blackwell.</li>\n<li>–––, 1980, <em>Sameness and Substance</em>,\nCambridge MA: Harvard University Press.</li>\n<li>–––, 2001, <em>Sameness and Substance\nRenewed</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2016, <em>Continuants. Their Activity, Their Being and Their Identity</em>, Oxford: Oxford University Press.</li>\n<li>Wright, Crispin, 1983, <em>Frege’s Conception of Numbers as\nObjects</em>, Aberdeen: Aberdeen University Press.</li>\n<li>Xu, Fei, 1991, “Count nouns, sortal concepts and the nature\nof early words”, in <em>Kinds, things, and stuff: Mass Terms and\nGenerics</em> (New Directions in Cognitive Science: Volume 13), F.J.\nPelletier (ed.), Oxford: Oxford University Press, pp. 191–206.\ndoi:10.1093/acprof:oso/9780195382891.003.0010</li>\n<li>–––, 1997, “From Lot’s wife to a\npillar of salt: Evidence that <em>physical object</em> is a sortal\nconcept”, <em>Mind and Language</em>, 12(3–4):\n365–92. doi:10.1111/j.1468-0017.1997.tb00078.x</li>\n<li>–––, 2002, “The role of language in acquiring object kind concepts in infancy”, <em>Cognition</em>, 85:\n223–50. </li>\n<li>Xu, Fei and Susan Carey, 1996, “Infants metaphysics: The\ncase of numerical identity”, <em>Cognitive Psychology</em>,\n30(2): 111–153. doi: 10.1006/cogp.1996.0005</li>\n<li>Yoshida, H., and L. Smith, 2003, “Shifting ontological boundaries: How Japanese and English-speaking children generalize names for animals and artifacts”, <em>Developmental Science</em>, 6(1):1–34.</li>\n<li>Zimmerman, Dean W., 1998, “Criteria of identity and the\n‘identity mystic’”, <em>Erkenntnis</em>, 48(2):\n281–301. doi:10.1023/A:1005304508456</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "categories",
            "change: and inconsistency",
            "essential vs. accidental properties",
            "identity",
            "identity: of indiscernibles",
            "identity: relative",
            "object",
            "properties",
            "species",
            "substance"
        ],
        "entry_link": [
            {
                "../categories/": "categories"
            },
            {
                "../change/": "change: and inconsistency"
            },
            {
                "../essential-accidental/": "essential vs. accidental properties"
            },
            {
                "../identity/": "identity"
            },
            {
                "../identity-indiscernible/": "identity: of indiscernibles"
            },
            {
                "../identity-relative/": "identity: relative"
            },
            {
                "../object/": "object"
            },
            {
                "../properties/": "properties"
            },
            {
                "../species/": "species"
            },
            {
                "../substance/": "substance"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=sortals\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/sortals/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=sortals&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"http://philpapers.org/sep/sortals/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"http://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=sortals": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/sortals/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=sortals&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "http://philpapers.org/sep/sortals/": "Enhanced bibliography for this entry"
            },
            {
                "http://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [],
        "listed_links": []
    }
}