{
    "url": "states-of-affairs",
    "title": "States of Affairs",
    "authorship": {
        "year": "Copyright © 2021",
        "author_text": "Mark Textor\n<mark.textor@kcl.ac.uk>",
        "author_links": [
            {
                "mailto:mark%2etextor%40kcl%2eac%2euk": "mark.textor@kcl.ac.uk"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2021</a> by\n\n<br/>\nMark Textor\n&lt;<a href=\"mailto:mark%2etextor%40kcl%2eac%2euk\"><em>mark<abbr title=\" dot \">.</abbr>textor<abbr title=\" at \">@</abbr>kcl<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>uk</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Tue Mar 27, 2012",
        "substantive revision Wed May 12, 2021"
    ],
    "preamble": "\n\nPhilosophers connect sentences with various different items, such as\nthoughts, facts and states of affairs. Thoughts are either\ntrue or false in an absolute sense, never both or neither. A sentence\nsuch as “Socrates is wise” is true (false) in virtue of\nexpressing the true (false) thought that Socrates is wise. Thoughts\nare also the contents of propositional attitudes like belief and\ndesire. For example, John’s belief that Vulcan is a planet is a\nrelation between him and the thought that Vulcan is a planet. Since\nthere is no such planet, the thought that Vulcan is a planet cannot be\ncomposed of Vulcan and the property of being a planet. It is\ncomposed, among other things, of a way of thinking that purports to\nlatch on to a planet. This so-called mode of presentation may be\nexpressed by a definite description like “the planet between the\nSun and Mercury”.\n\nSome philosophers take it to be obvious that if something is true,\nthere must be something that makes it true, a truth-maker.\nFacts are truth-makers. Like sentences and thoughts, facts\nare taken to be complex objects. The constituents of (atomic) facts\nare not words or modes of presentation, but particulars and properties\n(see, for instance, Armstrong 1986: 85). The fact that Socrates is\nwise exists if, and only if Socrates is wise.\n\nFacts may be required in the theory of truth-making. States of\naffairs, by contrast, are supposed to pull their weight in the\nmetaphysics of modality. According to Wittgenstein’s\nTractatus Logico-Philosophicus, the totality of states of\naffairs exhausts the space of possibilities; the totality of states of\naffairs that obtain are the (actual) world. More recently, Alvin\nPlantinga (1974, 44) and Pollock (1984, 52) have posited in their\nmetaphysics of possible worlds states of affairs that exists whether\nthey obtain or not.\n\nBefore pressing on, a note about terminology: many philosophers follow\nArmstrong’s (1993: 429) terminology who uses “states of\naffairs” to refer to facts. (Armstrong’s book A World\nof States of Affairs is solely concerned with facts.) This\narticle is not devoted to “Armstrongian” states\nof affairs, but to states of affairs in the sense that is prominent in\nthe work of such philosophers as Husserl, Reinach, Russell (at one\ntime), the early Wittgenstein and\n Plantinga.[1]\n Hereafter, “states of affairs” is used only for states of\naffairs that exist whether they obtain or not.\n\nStates of affairs are similar to thoughts. Thoughts are true or false;\nstates of affairs obtain or not. There are also similarities between\nfacts and states of affairs. Both facts and states of affairs are\nsupposed to be complexes that contain (in a sense to be explained\nfurther) objects and properties.\n\nDoes one need states of affairs in addition to facts and thoughts? In\norder to answer this question we need to know what states of affairs\nare and how they contrast and compare with thoughts and facts. We\ntherefore begin by outlining the theoretical role states of affairs\nare supposed to play.\n",
    "toc": [
        {
            "#IntrStatAffa": "1. Introducing States of Affairs"
        },
        {
            "#TalkAbouStatAffa": "1.1 Talking about States of Affairs"
        },
        {
            "#TheoRoleForStatAffa": "1.2 A Theoretical Role for States of Affairs"
        },
        {
            "#ThouStatAffa": "2. Thoughts and States of Affairs"
        },
        {
            "#IndiExisCond": "2.1 Individuation and Existence Conditions"
        },
        {
            "#StatAffaFundBearModaProp": "2.2 States of Affairs and Probabilities"
        },
        {
            "#StatAffaPossWorl": "2.3 States of Affairs and Possible Worlds"
        },
        {
            "#StatAffaPropAtti": "2.4 States of Affairs and Propositional Attitudes"
        },
        {
            "#FactStatAffa": "3. Facts and States of Affairs"
        },
        {
            "#FactTrutMakeRegrStop": "3.1 Facts as Truth-Makers and Regress-Stoppers"
        },
        {
            "#FactJustObtaStatAffa": "3.2 Are Facts Just Obtaining States of Affairs?"
        },
        {
            "#StatAffaJustRecoFactCons": "3.3 Are States of Affairs Just Recombinations of Fact Constituents?"
        },
        {
            "#StatAffaComp": "4. States of Affairs in the Metaphysics of Perception and Value"
        },
        {
            "#StatAffaComp": "5. States of Affairs as Complexes"
        },
        {
            "#StatAffaNTuplWhol": "5.1 States of Affairs as N-Tuples and Wholes"
        },
        {
            "#NonMereCompResc": "5.2 Non-Mereological Composition to the Rescue?"
        },
        {
            "#StatAffaOntoDepe": "5.3 Are States of Affairs Ontologically Dependent?"
        },
        {
            "#UnitStatAffa": "6. The Unity of a State of Affairs"
        },
        {
            "#UnitProb": "6.1 The Unity-Problem"
        },
        {
            "#ExteUnif": "6.2 External Unification"
        },
        {
            "#InteUnif": "6.3 Internal Unification"
        },
        {
            "#Conc": "7. Conclusion"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Introducing States of Affairs\n1.1 Talking about States of Affairs\n\nCan one base our understanding of what states of affairs are on\nfeatures of how we talk about them?\n\nPollock holds that we normally refer to states of affairs by gerund\nclauses such as Kareem Abdul-Jabbar’s being more than seven\nfeet tall or Spiro Agnew’s being President of Yale\nUniversity (see Pollock 1984b: 121). However, while the referents\nof such gerund clauses seem not to be\npropositions—“Kareem Abdul-Jabbar’s being more\nthan seven feet tall is true” does not sound\nright—these clauses are referentially flexible. For the gerund\nclauses in the following sentences seem to refer to facts or events,\nthe relata of causal relations and objects of knowledge (the first two\nexamples are from Pollock 1984b: 122):\n\nCharlie’s eloping with Ginger was surprising.\nMary’s divorcing Charlie caused Charlie’s\ndemise.\nKareem Abdul-Jabbar’s being more than seven feet\ntall is well-known.\n\n\nNow facts may be nothing but states of affairs that obtain and events\nstates of affairs that obtain at some times and not at others. If this\nwere right, the gerund clauses above would refer to states of affairs.\nBut we need to get an independent grip on the notion of states of\naffairs before settling the question whether facts and events are a\nkind of state of affairs. For this purpose we can neither pick out\nstates of affairs as the things that obtain or nor say that they are\nthe referents of gerund clauses of the kind considered above.\n\nAre there predicates that we apply to states of affairs and that are\ndistinctive of them? States of affairs are said to obtain or\nnot, while Fregean thoughts are true or\nfalse. In contrast, facts exist; a fact cannot be qualified\nas obtaining or not obtaining (see Betti 2015: 35). However, it seems\ndifficult to get a grip on the difference between obtaining\nand non-obtaining on the one hand, and truth and\nfalsity on the other. Prima facie, the state of\naffairs Socrates’s being wise obtains if, and only if,\nit is true that Socrates is wise (see Plantinga 1974: 45–6; see\nalso Betti 2015: 35). Pollock (1984a: 53) correctly observes that\n“obtaining and not-obtaining are truth-like properties”.\nBut why are they just truth-like and not just truth and\nfalsity under a different label; why can the obtaining of a state of\naffairs not be identified with the truth of a thought or\nproposition?\n\nBetti proposes that the distinction between obtaining and\nnon-obtaining states of affairs is an ontological one:\n\n\nnonobtaining states of affairs have no mode of being (so they neither\nsubsist nor exist) but they are still objects in their own\nright—that is, they are part of the catalogue of the world in\ntheir own right. (2015: 35–6)\n\n\nIf this were right, states of affairs would be more even puzzling than\nMeinongian objects that at least subsist. However, false propositions\nseem equally to have only a “shadowy” existence:\n\n\nTime was when I thought there were propositions, but it does not seem\nto me very plausible to say that in addition to facts there are also\nthese curious shadowy things going about such as “That today is\nWednesday” when in fact it is Tuesday. (Russell 1918: 223)\n\n\nIn conclusion: the difference between “is true (false)”\nand “obtains (does not obtain)”, does not help us to\ndistinguish states of affairs from other things. Is there a\ntheoretical role that states of affairs can, but thoughts\n(propositions) and facts can’t fill?\n1.2 A Theoretical Role for States of Affairs\n\nIn order to answer this question, consider a school exercise in\nprobability (see Kripke 1980: 16). Take two ordinary dice, \\(D_{1}\\)\nand \\(D_{2}\\), with six sides each. For each die, there are six\npossible outcomes of a throw. \\(D_{1}\\) and \\(D_{2}\\) are thrown and,\non landing, display two numbers. Hence, there are thirty-six possible\noutcomes of throwing the dice. Let us now calculate the probability\nthat the outcome of throwing the two dice is 11. There are only two\noutcomes of throwing the two dice in which they show together 11:\neither (i) \\(D_{1}\\) shows 5 and \\(D_{2}\\) 6 or (ii) \\(D_{1}\\) shows 6\nand \\(D_{2}\\) 5. The probability of the outcome of \\(D_{1}\\)’s\nand \\(D_{2}\\)’s jointly showing 11 is the ratio between all\npossible outcomes of \\(D_{1}\\)’s and \\(D_{2}\\)’s jointly\nshowing 11 and the totality of possible outcomes of throwing the two\ndice: 2/36 = 1/18.\n\nIn the calculations we assumed (1):\n\n(1)\n There are bearers of probabilities: things that are probable or\nimprobable to a certain degree.\n\n\nWe also assumed that there is a space of possible states of the dice;\nways the two dice might fall. A way the dice might fall exists even if\nit is not true that the dice have fallen that way:\n\n(2)\n The possible states (outcomes) of \\(D_{1}\\)’s and\n\\(D_{2}\\)’s showing jointly certain numbers exist whether it is\ntrue that they show this number or false that they do.\n\n\nThe possible states are possible states of objects. \\(D_{1}\\)’s\nand \\(D_{2}\\)’s Showing 5 is a possible state of the\ndice, however we describe them or ascribe the property. This suggests\n(3):\n\n(3)\nPossible states are different if they are states of different\nobjects or constituted by different ways an object can be.\n\n\nThe possible states involved in our exercise have the properties\nphilosophers take states of affairs to have. States of affairs are\nprobable to a degree or possible, as stressed by Reinach (1911:\n339–40; Künne 1987: 185ff and Forbes 1989: 131 follow\nReinach). They are supposed to exist without obtaining (2) and to have\nobjects and properties as constituents (3).\n\n(2) distinguishes states of affairs from facts. The fact that Socrates\nis wise exists, if, and only if, Socrates is wise. If Socrates is not\nwise, there is no fact of him being wise. Hence, the fact that\nSocrates is wise cannot be a mere possibility for Socrates; it can, so\nto speak, only be an actuality. In contrast, the state of affairs that\nSocrates is foolish exists, even if Socrates is not foolish (see\nReinach 1911; Wittgenstein 1918: 2.04, 2.05; Plantinga 1974: 44;\nPollock 1984a: 52).\n\n(3) distinguishes states of affairs from thoughts:\n\n\n[States of affairs] are “about” objects but not in terms\nof some mode of representation. States of affairs, in some sense,\ncontain objects as direct constituents. (Pollock 1984a: 53)\n\n\nThe state of affairs Marilyn Monroe’s being an actress\nand the state of affairs Norma Jean Baker’s being an\nactress, contain, in some sense, the same objects and properties\nas constituents in the same order. They are the same state of affairs\nunder different names. However, I can believe that Marilyn Monroe is\nan actress while doubting that Norma Jean Baker is an actress. Hence,\nif there are states of affairs, they are not the content of\npropositional attitudes like belief; thoughts are. This point leaves\nopen the possibility that a state of affairs is a set of thoughts that\nare equivalent in some respect (see\n section 2.2).\n\nThe model of a space of possible outcomes of a throw of a die gives us\nan initial idea of what the distinctive properties of state of affairs\nare and why it is plausible to assume that there are any states of\naffairs. It leaves questions about the precise nature of states of\naffairs open. For example, Wittgenstein (1918: 4.26) argued that only\nelementary sentences “picture” states of affairs. An\nelementary sentence in Wittgenstein’s sense is a concatenation\nof simple proper names each of which refers to a simple object. The\nnames in the elementary proposition are arranged in a way that can be\nmapped onto an arrangement of the simple objects named. This\narrangement of objects is the state of affairs pictured by the\nelementary sentence. Nothing said so far rules out that states of\naffairs that involve some objects and properties (relations) combine\nto form further complex states of affairs that have states of affairs\nas constituents. (Pollock 1984a: 55–6) defines negation,\nconjunction etc. for states of affairs. For example, if there is a\nstate of affairs \\(S_1\\) and a state of affairs \\(S_2\\), their\nconjunction is the state of affairs that obtains if, and only if, both\n\\(S_1\\) and \\(S_2\\) obtain. If one wants to restrict the space of\npossible states to combinations of simple objects, one needs to\nmarshal arguments that show that this and similar conceptions of\ncomplex states of affairs is flawed. (This entry is mainly concerned\nwith simple states of affairs.)\n\nSimilarly, the model of states of affairs as possible outcomes does\nnot rule out that there are impossible state of affairs. If there is a\nspace of possible states of the dice, there seems to be a space of\nimpossible states of them as well. For example, it is\nimpossible for the dice to show 17 or no number at all (see Rumfitt\n2015: 187f for a brief discussion of impossible states of\naffairs).\n2. Thoughts and States of Affairs\n2.1 Individuation and Existence Conditions\n\nThoughts can be the contents of propositional attitudes. When one says\n“There are three things that everyone who works on elementary\nphysics believes”, one quantifies over things that everyone\nworking in elementary physics believes: thoughts (see Chisholm 1970:\n19). Thoughts are also truth-value bearers (“There are three\ntruths that everyone who works in elementary physics\nbelieves”). How are thoughts related to states of affairs? For\ninstance, how is the thought that Socrates is wise related to the\nstate of affairs Socrates’ being wise?\n\nPrima facie, thoughts are one thing, states of affairs\nanother. Thoughts and states of affairs differ in their individuation\nand existence conditions.\n\nIndividuation-conditions: Thoughts are supposed to be the\ncontents of propositional attitudes like belief and desire. Let\n“j” be shorthand for a propositional attitude verb\n(“desire”, “believe” etc). If one can j\nthat p without eo ipso j-ing that q (and\nvice versa), the contents that p and that q are\ndifferent. Now I can believe, for instance, that Hesperus shines\nwithout believing that Phosphorus shines. Hence, if thoughts are the\ncontents of propositional attitudes, the thought that Hesperus shines\nis different from the thought that Phosphorus shines. If the thought\nthat Hesperus shines is different from the thought that Phosphorus\nshines, thoughts cannot be logical complexes whose constituents are\nparticulars and properties. Following Frege, many philosophers\ntherefore take thoughts to be complexes that are built up out of modes\nof presentation. Here “thoughts” only refers to such\ncomplexes. Since there are different modes of presentation of the same\nparticular (property), there can be different thoughts that concern or\nare about the same particulars and properties. In contrast,\nHesperus’s shining and Phosphorus’s\nshining are the same state of affairs, namely the complex that\ncontains only the planet Venus and the property of shining. We will\nsee in\n section 2.4\n that not all philosophers follow Frege’s lead. If one has\narguments for a coarse-grained individuation of the objects of belief,\nstates of affairs may serve as contents of propositional\nattitudes.\n\nExistence-conditions: A thought is a complex whose\nconstituents are modes of presentation that purport to represent\nobjects. Standard accounts of modes of presentation allow for the\nexistence of modes of presentation that are empty. Hence, the\nexistence of a thought does not depend on the existence of the objects\nit purports to represent. For example, the thought that Pegasus is a\nhorse exists, although there is no such horse (for defense and\nelaboration see Sainsbury 2005: 86–9). This is different for\nstates of affairs. If a state of affairs is a complex that contains\nobjects and properties as constituents, it cannot exist if its\nconstituents don’t exist. So while it is true that Pegasus does\nnot exist, there is no such state of affairs. This is unproblematic\nfor we have not been given any reason to think that such a state of\naffairs obtains or does not obtain. For the same reason states of\naffairs that contain contingently existing objects are themselves\ncontingent existents.\n\nPhilosophers often use the notion of a singular proposition. A\nsingular proposition is supposed to be (i) “directly\nabout” an object and (ii) evaluable as true or false. Direct\naboutness requires that what the proposition is directly about exists\nif the proposition exists. If one combines (i) and (ii) with the\nplausible assumption that the proposition that Superman does not exist\nis singular and true, one arrives at the conclusion that Superman\nexists. Similar problems arise for negative modal existential singular\npropositions such as the proposition that Socrates might not have\nexisted. Williamson 2002 argues on the basis of these problems that\neverything exists necessarily. Williamson’s modus\nponens is Plantinga’s (1983) and Merricks’s 2015\n(chapt. 5) modus tollens: singular propositions can exist\nalthough the object they are directly about doesn’t.\n\nIf one sides with Plantinga and Merricks, one can drive a wedge\nbetween truth and obtaining. We are not compelled to hold that there\nis a state of affairs Superman’s non-existing because\nwe have no reason to say that such a state of affairs obtains or even\npossibly obtains, while we have a reason to say that it is true that\nSuperman does not exist. Hence, the (singular) proposition that\nSuperman does not exist can be true without the state of affairs\nSuperman’s non-existing obtaining. Obtaining is indeed\nonly truth-like.\n\nChisholm held that propositions are those states of affairs such that\neither the state of affairs or its negation always occurs (on\nChisholm’s notion of state of affairs, see Kim 1979). But, as we\nhave seen, the truth that Superman does not exist cannot be the state\nof affairs Superman’s non-existing occurring or obtaining.\n2.2 States of Affairs and Probabilities\n\nReinach (1911: 339) claimed that “states of affairs, and only\nstates of affairs, can adopt such modalities” as probability and\npossibility. He had in mind that an object such as a die cannot be\npossible or probable. This seems plausible enough. It is equally\nplausible that facts are not probable or possible. However, why\ncan’t thoughts be probable or possible?\n\nForbes (1989: 130–131) refines Reinach’s idea in taking\nstates of affairs as the fundamental bearers of modal\nproperties like being possible, necessary etc. From\nReinach we learn that particulars can’t be the bearers of\nmodality. Fregean truth-values are also unsuited. According to\nFrege’s semantics for assertoric sentences, every true (false)\nsentence, whether necessary or contingently true (false), refers to\nthe True (the False). Forbes appeals to our modal intuitions to argue\nfor a better candidate for the modal value bearer role,\n\n\na category of entity not so finely discriminated as thoughts but more\nfinely discriminated than truth-values, such that sentences with the\nsame entity in the category as their references are guaranteed to have\nthe same modal status. (1989: 130)\n\n\nLet us consider a pair of sentences to illustrate Forbes’s\nargument for an entity less discriminating than thoughts and more\ndiscriminating than truth-values. Consider the sentence pairs:\n\n(1)\n\n\na.\nHesperus shines.\nb.\nPhosphorus shines.\n \n(2)\n\n\na.\nHesperus is Hesperus.\nb.\nHesperus is Phosphorus.\n \n\n\n(1a) to (2b) are all true. Hence, in Fregean terms, they all refer to\nthe True. Each of these sentences expresses a thought different from\nall others. However, the members of each pair have the same modal\nstatus that differs from the modal status of the members of the other\npair. (1a) and (1b) are contingently true; (2a) and (2b) necessarily\ntrue. If one lets sentences stand for or describe states of affairs\nwhose constituents are the referents of the semantically relevant\nsentence parts, one can capture this similarity: (1a) and (1b) ((2a)\nand (2b)) have the same modal status because these sentences stand for\nthe same state of affairs (Forbes 1989: 131). In general, sentences\nthat stand for the same state of affairs have the same modal value. It\nis then a short step to take states of affairs to be the primary or\nfundamental bearers of modal status (1989: 131–2). A sentence is\ncontingently (necessarily) true if, and only if, it stands for a state\nof affairs that contingently (necessarily)\n obtains.[2]\n\nCan’t facts be the basic bearers of modal status? Take a further\nsentence pair:\n\n(3)\n\n\na.\nHesperus has an orbital period of 226 days.\nb.\nPhosphorus has an orbital period of 226 days.\n \n\n\n(3a) and (3b) are false, they express different thoughts, yet have the\nsame modal status: they might have been true. This similarity cannot\nbe explained by taking them to refer to the same fact; we need states\nof affairs.\n\nWe can now answer our initial question: Yes, we need states\nof affairs as well as thoughts. States of affairs and thoughts have\ndistinct individuation and existence conditions. Therefore, states of\naffairs can be the fundamental bearers of modal\nproperties.\n\nWe can strengthen the conclusion by considering ways to dispute it.\nConsider all thoughts that represent the same particulars and\npredicate the same properties of them. Let us call these thoughts\nreferentially equivalent. Vendler proposed that a fact is\n“an abstract entity which indiscriminately contains a set of\nreferentially equivalent true propositions” (Vendler\n1967: 711; my emphasis). If we drop the restriction to true\npropositions and simplify Vendler’s idea, we can propose that a\nstate of affairs is a set of referentially equivalent thoughts,\nwhether they are true or not. The state of affairs\nHesperus’s shining is the set of all thoughts that are\nabout Hesperus and predicate the property of shining to it.\n\nHowever, such an approach to states of affairs makes them\nexplanatorily uninteresting. If we want to explain why (1a) and (1b)\n((2a)–(2b)/(3a)–(3b)) have the same modal profile,\nappealing to states of affairs in Vendler’s sense does not allow\nus to make progress. For instance, saying that (1a) and (1b) have the\nsame modal profile because they belong to the set of thoughts that are\nabout Hesperus and predicate the property of shining to it is at best\na partial explanation. For it raises such questions as “What has\nbelonging to this set to do with possibility?” and “In\nvirtue of which property has a set of thoughts modal\nproperties”? In contrast, the assumption that there are states\nof affairs that are not just a particular kind of set and that have\nproperties like being possible or being probable can\nbe independently motivated and is explanatory progress.\n2.3 States of Affairs and Possible Worlds\n\nIn\n section 2.2\n we used the modal properties of states of affairs to distinguish them\nfrom thoughts. Some philosophers have proposed to use the connection\nbetween states of affairs and modality constructively to explain what\na possible world is.\n\nLewis (1973: 84) points out that we talk about ways things might have\nbeen. He goes on to label ways every thing might have been\n“possible worlds”. If it is possible that something is the\ncase, there is a possible world in which it is the case. What are,\nthen, possible worlds?\n\nVan Inwagen distinguished between Abstractionist and Concretist\nconceptions of possible worlds (see van Inwagen 1986: 185–6; see\nalso Stalnaker 1986: 121). According to a Concretist conception of\npossible worlds such as David Lewis’s, a possible world is the\nmaximal mereological sum of individuals that are spatio-temporally\nrelated and each such sum is spatio-temporally isolated from all\nothers (see Lewis 1986: 69–70). There are no impossible worlds.\nThe actual world is the world in which we are located.\n\nAccording to Abstractionists, possible worlds are abstract objects of\nsome sort. The exercise in probability calculation from\n section 1.2\n motivates an Abstractionist proposal in which states of affairs are\nthe basic building blocks. States of affairs are possible outcomes.\nKripke called possible outcomes “miniature possible\nworlds”. This suggests an idea of what a possible world is: it\nis a maximal state of affairs. Pollock (1984a: 57) defines\npossible world therefore as follows:\n\n(PW)\n w is a possible world if, and only if, w is a\nnontransient possible state of affairs and for any nontransient state\nof affairs S if it is possible that w and S both\nobtain, w includes S. (see also Plantinga 1974:\n44–6)\n\n\nA state of affairs w includes a state of affairs S if,\nand only if, necessarily if w obtains, S obtains. The\nactual world is the possible maximal nontransient state of affairs\nthat obtains.\n\nA state of affairs is transient if, and only if, it obtains at one\ntime and not another. For instance, the state of affairs\nSocrates’s not drinking hemlock obtains at some times,\nbut not at others. Transient states of affairs are only possible,\nactual etc. relative to a time. Before 399 BC it was possible that\nSocrates does not drink hemlock, but this is no longer possible after\n399 BC. A state of affairs is nontransient if, and only, if it is such\nthat necessarily if it obtains at one time it obtains at all times.\nFor example, the state of affairs Socrates’s being hungry on\nthe 15th of April 400 BC at 16:15 is nontransient.\n\n(PW) makes use of modal concepts to define possible world: it must be\npossible for S and w to both obtain etc. Hence,\nthis particular Abstractionist conception of possible worlds does not\nallow one to explain modality away; it presupposes it. In contrast,\nthe Concretist conception promises a definitional reduction of modal\nconcepts. When we talk about possibility and necessity we quantify\nover mereological sums of things. The concept of modality is not\nrequired to distinguish between possible and impossible worlds: there\nare no impossible ones. Why is (PW), then, attractive?\n\nFirst, Forbes (1987: 139ff) argues that the identification of\npossible worlds with constructions out of compossible states of\naffairs solves the problem of accidental intrinsics (Lewis 1986:\n199–201). Let us consider an intrinsic property of a human\nbeing, say me, such as having two hands. I might have existed\nwithout having had two hands. On the concretist account this implies\nthat there is a possible world in which I have a different number of\nhands. But how can one and the same individual have two as well as\nfewer/more hands “in different worlds”? If the worlds are\nmereological sums that have me as a common part, this seems not\npossible. Lewis concludes that the same object cannot be part of\ndifferent possible worlds. An object can only be in different possible\nworlds by having counterparts in them.\n\nAccording to counterpart theory, I might have had three hands only in\nthe derived sense by having counter-parts that have three hands (see\nKripke 1980: 45). This does not sit well with the intuition that\nI strictly and literally speaking might have had three hands.\nThe identification of possible worlds with constructions out of\ncompossible states of affairs is faithful to this intuition. I have\ndifferent properties in different possible worlds, if the possible\nworlds contain different states of affairs that involve me. One\npossible world contains the state of affairs MT’s having\nthree hands; the possible world that is actual contains the state\nof affairs MT’s having two hands. The different\npossible worlds under discussion don’t overlap, yet the\npossibilities involve me (see Forbes 1987: 141).\n\nSecond, the semantics of counterfactuals. The so-called\n“Stalnaker-Lewis semantics” for counterfactuals assumes\nthat a counterfactual such as “If it were rainy today, I would\ntake an umbrella” is true if, and only if, all of the closest\npossible worlds in which the antecedent is true are possible worlds in\nwhich the consequent is true. This semantics for counterfactuals\nallows the substitution of logically equivalent sentences in the\nantecedent of a counterfactual. For example, if the counterfactual\n“If it were rainy today, I would take an umbrella” is\ntrue, so is “If it were rainy and windy today or rainy and not\nwindy today, I would take an umbrella” because “It is\nrainy today” and “If it is rainy and windy today or rainy\nand not windy today” are true in the same possible worlds. Fine\n(1975: 453f; 2012: 230f) argues that the substitution principle should\nbe given up in the light of puzzling consequences. But certainly one\ncan substitute some sentences in the antecedent of a counterfactual.\nWhich ones? Fine suggests replacing Stalnaker-Lewis semantics for\ncounterfactuals with a semantics in which possible states take pride\nof place. Instead of a plurality of possible worlds there is a space\nof possible states that involve particulars and ways they can be.\nAssertoric sentences refer to states of affairs and only those\nsentences that refer to the same state of affairs can be substituted\nin the antecedent of a counter-factual (Fine 1975: 454).\n\nFine assumes that “It is rainy”, “It is rainy and\nwindy” and “It is rainy and not windy” etc. refer to\ndifferent states of affairs (1975: 454). How can this assumption be\njustified? If we take the idea that states of affairs are complexes\nseriously, we can answer this question. Just like other complexes they\ncan (at least in part) be individuated in terms of their constituents.\nThe states of affairs \\(S_1\\) and \\(S_2\\) can therefore only be the\nsame state of affairs if they have the same constituents. This\nconception allows for states of affairs that necessarily co-obtain,\nbut differ. For example, necessarily, the state of affairs that\ntriangle A is equilateral obtains if the state of affairs that\ntriangle A is equiangular and vice versa. Similarly,\nthe state of affairs P necessarily obtains if, and only if, the\nstate of affairs \\(P \\mathbin{\\&} (Q \\lor \\neg Q)\\) obtains. Yet,\nthese are different states of affairs: they have different\nconstituents.\n\nThis conception of states of affairs as complexes makes them useful\nfor semantics. If sentences refer to such states of affairs, logically\nequivalent sentences can refer to different states of affairs and\ntherefore have different semantic properties. All tautologies are true\nin all possible worlds, yet they can refer to different states of\naffairs. A number of semantic theories assume that sentences refer to\nstates of affairs. These theories provide principles that determine\nthe reference of complex sentences on the basis of their parts (see\nFine 2012: 234; see also Rumfitt 2015: 160–7).\n\nHowever, if states of affairs are individuated in terms of their\ncomponents and their mode of combination, there are for every possible\nworld many different maximal nontransient states of affairs (for the\nfollowing see Zalta 1993: 393–4). If the state of affairs\nP is a possible world, so is \\(P \\mathbin{\\&} (Q\\lor \\neg\nQ)\\) for an arbitrarily chosen possible state of affairs Q.\nP and \\(P \\mathbin{\\&} (Q\\lor \\neg Q)\\) are necessarily\nequivalent, but, according to our individuation method, different\nstates of affairs. Hence, there are many different maximal states of\naffairs that correspond to the same possible world and, in particular,\nto the actual world.\n\nZalta (1993) tackles this problem on the basis of his axiomatic theory\nof abstract objects. According to him, abstract objects like numbers\nexemplify but also encode properties. For example, 1 encodes the\nproperties that are essential to its identity; to its being the object\nit is. In contrast, 1 exemplifies, but does not encode, the property\nof being the number of inhabited planets of the solar system. In this\nsystem, situations are those abstract objects that encode state of\naffairs properties such as being such that John is to the left of\nHarry. If a situation is the case, the state of affairs\nproperties it encodes obtain; the situation makes the encoded state of\naffairs property factual. A situation S is a possible world if,\nand only if, it is possible that S makes all and only the\nobtaining states of affairs properties factual. On the basis of the\naxioms of his system Zalta can show that there is a unique actual\nworld.\n\nIf one is unwilling to make a distinction between encoding and\nexemplifying, but one wants to maintain the identification of possible\nworlds with maximal possible states of affairs, one either has to\naccept that necessarily equivalent states of affairs are the same or\none must identify possible worlds with sets of necessarily equivalent\npossible states of affairs. We already rejected the first option as\nunfruitful for semantics. The second option seems to result in a\nset-theoretic modeling or replacement of possible worlds, not in a\nconception of possible worlds (see Zalta 1993: 394).\n2.4 States of Affairs and Propositional Attitudes\n\nThoughts can’t fulfill the role of states of affairs as the\nfundamental bearers of modal properties. Can states of affairs be the\ncontents of propositional attitudes? Prima facie, the answer\nis No. We have already seen that states of affairs are too\ncoarse-grained to be the contents of propositional attitudes. I can\nbelieve that Hesperus is a planet, without believing that Phosphorus\nis a planet (and vice versa). Hence, the contents of the attitudes\ndiffer. But the state of affairs Hesperus’s being a\nplanet is just the state of affairs Phosphorus’s being\na planet. Propositional attitudes are, at best, mediated\nrelations to states of affairs. For example, a belief represents a\nstate of affairs if, and only if, the believer assents to a thought\nthat describes a state of affairs.\n\nBarcan Marcus has challenged this view. She argued that belief is\n“a relation between a subject or agent and a state of affairs\nthat is not necessarily actual but that has actual objects as its\nconstituents” (Barcan Marcus 1993 [1990]: 240). Her\nobject-centered account of belief identifies belief with a\ndifferential disposition to a state of affairs:\n\n\nx believes that S just in case, under certain\nagent-centered circumstances including x’s\ndesires and needs as well as external circumstances, x\nis disposed to act as if S, that actual or nonactual state of\naffairs, obtains. (Barcan Marcus 1993 [1990]: 241)\n\n\nBelieving that so-and-so does not require concept possession. For\nexample, believing that the sun is shining is a differential\ndisposition to the state of affairs the sun’s shining,\nhowever described or presented.\n\nThe object-centered account of belief contrasts with\nmode-of-presentation-centered or language-centered accounts. The\nobject-centered theory allows us to take belief-ascriptions to\nnon-linguistic creatures to be literally true. However, it runs into\nproblems when it comes to assertoric utterances of sentences\ncontaining empty singular terms. According to the object-centred view,\nthese don’t express beliefs (see Barcan Marcus 1993 [1990]:\n247). While the state of affairs a’s being\nF can exist, although a is not F; it cannot\nexist, if either a or being F doesn’t\nexist. Now take the belief that Napoleon was French. I satisfy all\nintuitive criteria for the possession of this belief. Imagine that we\nfind out that, after all, there was never such a person as Napoleon.\nIt was all a very elaborate hoax. Then there is no state of affairs\ncomposed of Napoleon and being French. Hence, although all\nintuitive criteria may have told us that I believed that Napoleon was\nFrench, we now find out that I never had that belief. This is\ncounter-intuitive and artificial.\n\nTo sum up: Thoughts and states of affairs are different things.\nThoughts cannot be reduced to states of affairs and the reduction of\nstates of affairs to sets of referentially equivalent thoughts is\nunwarranted. We need both thoughts and states of affairs in order to\nfulfill different roles.\n3. Facts and States of Affairs\n3.1 Facts as Truth-Makers and Regress-Stoppers\n\nWhat are facts and how may they be distinguished from states of\naffairs?\n\nThe Truthmaker-Argument is the main argument for the introduction of\nfacts (see Armstrong 1997: 115ff). It also yields an understanding of\nthe main features of facts. The argument can be summed up as\nfollows:\n\n(P1)\n Every truth must have a truth-maker.\n(P2)\nThe best candidates to occupy the truth-maker role are facts.\n(C)\nThere are facts. \n\n\nArmstrong takes (P1) to articulate the following intuitive asymmetry:\nIt is true that Socrates is wise because Socrates is wise;\nbut Socrates is not wise because it is true that Socrates is\nwise (see Armstrong 2004: 4). In Armstrong’s terminology a\ntruth-bearer is true in virtue of (made true by) the\nexistence of another entity, a truth-maker. A truth-maker ensures or\nguarantees the truth of a truth-bearer. Some authors take this\nguarantee to be a form of necessitation: x makes it true that\np if, and only if, necessarily, if x exists, it is true\nthat p.\n\nThis brings us to the second premise of the Truthmaker-Argument. Why\nare facts the best candidates for the truth-maker role? Let us work\nthrough some alternatives. Take the thought that Socrates is wise. The\nexistence of which object necessitates its truth? Socrates can exist\nwithout being wise. Hence, Socrates is not the truth-maker we\nare looking for.\n\nThe last point suggests that only a complex entity that\n“contains” Socrates as well as the property of being\nwise is a candidate for the truth-maker role. The mereological\nsum of Socrates and being wise, that is, the whole that has\nonly Socrates and wisdom as parts, satisfies this condition, yet it\ncannot fulfill the truth-maker role. If Socrates and wisdom exist,\ntheir mereological sum exists. Hence, the sum exists whether it is\ntrue that Socrates is wise or not. For similar reasons the set that\ncontains only Socrates and being wise cannot be the\ntruth-maker of the thought that Socrates is wise. Armstrong concludes\nthat only the fact that Socrates is wise that “ties”\nSocrates and being wise makes it true that Socrates is wise\n(see Armstrong 1997: 118).\n\nArmstrong’s conception of truthmaking is controversial (see, for\ninstance, Restall 1996). I will set its problems aside here and focus\non clarifying the relation between facts and states of affairs. Facts\n“tie” particulars and universals. This brings them close\nto states of affairs that also involve particulars and universals.\nWhat distinguishes them is that the existence of a fact is supposed to\nguarantee the truth of a truth-bearer. The existence of the fact that\na is F can only guarantee the truth of the thought that\na is F if one cannot distinguish facts into those that\nobtain and those that do not obtain. Saying of the fact that Socrates\nis wise that it obtains is redundant, while it is not redundant to say\nso of the state of affairs Socrates’ being wise.\n\nFacts are also introduced in order to stop a regress of instantiation.\nTake the particular a and the property of being\nF and assume that they can exist independently of each other.\nGiven this assumption, there must be a relation that\n“ties” them together to a’s being\nF. If the required “tie” is a genuine\nrelation, a regress, usually called Bradley’s regress,\nensues: we need to introduce another relation that ties the first\nrelation to a and being F, and so on. Facts are supposed\nto prevent Bradley’s regress (see Armstrong 1997: 115 and 118;\nHossack 2007: 33). How? Relations that tie particulars and properties\ntogether are “explained away” in terms of facts that\ncontain particulars and properties: if a instantiates\nF-ness, it does so because the fact that a is\nF exists. The existence of this fact guarantees that a\nis F. Facts are just instantiations of universals by\nparticulars (see Armstrong 1997: 119). Hence, we arrive again at the\nresult that the obtaining/non-obtaining distinction does not apply to\nfacts.\n\nIn contrast to facts the obtaining/non-obtaining distinction divides\nstates of affairs into those that obtain and those that do not obtain\n(see\n section 1).\n For this reason states of affairs cannot be truthmakers: their\nexistence does not necessitate the truth of a truth-bearer. The state\nof affairs Socrates’ being foolish exists in some\npossible worlds in which Socrates is foolish, but it also exists in\npossible worlds in which Socrates is not foolish. Vallicella\nreinforces this point:\n\n\n[Facts] are not to be confused with abstract states of affairs which\neither obtain or do not obtain depending on how the world is. The\nlatter are themselves in need of something in the world that explains\nwhy they obtain. (Vallicella 2000: 237)\n\n3.2 Are Facts Just Obtaining States of Affairs?\n\nStates of affairs contain particulars and properties; facts tie them.\nThis similarity encourages the question whether a fact is nothing but\na state of affairs that obtains (see Horwich 1990: 113 who\ntakes true Russellian propositions to be facts). On this view the\nreason why it is redundant to say that a fact obtains is that a fact\nis just an obtaining state of affairs. However, the identification of\nfacts with obtaining states of affairs creates problems for the theory\nof truthmaking. Assume that the fact that Socrates is wise is just the\nobtaining state of affairs Socrates’ being wise. The\nfact is supposed to make it true that Socrates is wise. But if the\nfact is just the obtaining state of affairs Socrates’ being\nwise, we need in turn something that explains why the state of\naffairs obtains. For it seems correct to say “The state of\naffairs Socrates’ being wise obtains because Socrates\nis wise”, but not “Socrates is wise because the state of\naffairs Socrates’ being wise obtains”. Hence,\nobtaining states of affairs cannot play the same role as facts. They\ncannot be truth-makers. The question “Why is it true that\nSocrates is wise?” cannot be conclusively answered by\nsaying “Because Socrates’ being wise\nobtains”. This answer is in need of a further explanation of the\nsame type as the one we were originally after.\n3.3 Are States of Affairs Just Recombinations of Fact Constituents?\n\nA non-obtaining state of affairs cannot be a fact. But can every state\nof affairs be a recombination of particulars and properties that are\ncombined in some facts? Combinatorialists answer Yes (see, for\nexample, Skyrms 1981; Armstrong 1989: 45ff; Bigelow 1988; Forbes 1989:\n137). This idea has two main varieties:\n\n\nFictionalism: Like ideal gases or frictionless surfaces,\npossible states of affairs are (useful) fictions; only facts exist.\nAssume that a is not F. There exists no possible state\nof affairs a’s being F. But there is the\nfiction of possible states of affairs according to which there is the\nstate of affairs a’s being F if, and only\nif, a and being F are contained in some facts\n(see Armstrong 1989: 46 and 49ff and the entry on\n modal fictionalism\n for a detailed overview).\n\nRepresentationalism: there are no possible states of affairs,\nonly representations of possible states of affairs (see Lewis 1986:\n146 who ascribes this view to Skyrms). These representations are\nset-theoretic constructs that contain as their members particulars and\nuniversals that occur in some facts. For example, if\na’s being F and b’s\nbeing G are both facts, but the sentence “a\nis G” is false, there is no state of affairs\na’s being G, but there is an ordered-pair\nthat contains a and being G as its members.\n\n\nRepresentationalism raises the question: what distinguishes a\n(possible) state of affairs from a mere representation of it? Why is\nthe state of affairs a’s being G not\nsimply the ordered pair of a and being G? We\nwill come back to this question in\n section 5.\n4. States of Affairs in the Metaphysics of Perception and Value\n\nSo far states of affairs may seem to be useful theoretical constructs\nof philosophical semantics and modal theory. For example, Taylor\n(1976: 263) introduced a notion of states of affairs that is language\nrelative: different languages posit different totalities of state of\naffairs. Are there reasons to introduce states of affairs\nindependently of theorizing about language and modality?\n4.1 States of Affairs as the Primary Objects of Perception\n\nOne answer to this question takes states of affairs to be the things\nwe directly perceive. Here is an argument from the recent literature\nthat will get us started in thinking about this view:\n\n\nWhile we often speak of perceiving objects alone (a bird, a\nbush, a cloud, a star) or properties alone—depending on the\npurpose of our attention or the purpose of our reporting—it does not\nseem possible to perceive objects without at least some of their\nproperties, or to perceive properties without perceiving at least some\ninstantiations of these properties. (Church 2013: 11)\n\n\nChurch concludes that “perception is always perception of a\nstate of affairs” (ibid. See also Levinson 2006: 576)\n\nAccording to this Argument from Perception, perceptual reports such as\n“I saw a robin yesterday” are incomplete. What I saw was\nthe state of affairs of the robin’s being a certain way. I\nreport that I saw a robin because my attention was focused on the\nbird.\n\nSome champions of states of affairs want to resist the Argument from\nPerception. Husserl (1901: § 28) and Reinach (1911: 341f]) denied\nthat states of affairs can be perceived. They argued that only\nparticulars, birds, bushes etc., can be the direct objects of\nperception. We say “NN saw that a robin sat on a\ntwig.” But these utterances are supposed to be reports of\njudgements that depend on perceptions of particulars. Hence,\nthe existence of such reports is supposed to be compatible with the\nclaim that states of affairs can only be the correlates of\njudgements.\n\nThe Argument from Perception indeed needs strengthening. The move\nfrom:\n\nNecessarily, if one perceives x, one perceives a property of x.\n\nto\n\nNecessarily, one perceives (the state of affairs of) x’s having\na property\n\nis not valid. If one sees the robin, it appears distinct from its\nenvironment. The robin can only appear distinct from its environment\nif one perceives at least one property of it. But that one perceives\nan object in virtue of perceiving some of its properties does not yet\nimply that one perceives the object’s having the property.\nConsider an analogy: I can only touch an object if I touch a part of\nit. But that does not mean that I really touch a different object: the\nobject’s having the part.\n\nEven if the argument above can be strengthened, the strengthened\nversion seems only to show that the primary objects of perception are\nproperty instantiations or facts (see Church 2013: 12). Seeing is a\nfactive mental state. Hence, if I see the robin perching on the twig,\nand things are as they visually seem to me, it is a fact that the\nrobin is perching on the twig. At best the Argument from Perception\ngives us a reason to believe in facts, but not in states of\naffairs.\n\nHowever, there is an argument in the vicinity of the Argument from\nPerception that speaks to the existence of states of affairs. McDowell\nused the thesis that we perceive the referents of\n‘that’-clauses as a basis for direct realism:\n\n\nIn a particular experience in which one is not misled, what one takes\nin is that things are thus and so. That things are thus\nand so is the content of the experience, and it can also be the\ncontent of the judgement if the subject decides to take the experience\nat face value […]. But, that things are thus and so is\nalso, if one is not misled, an aspect of the layout of the world: it\nis how things are. (McDowell 1994: 26)\n\n\nIf a particular experience, McDowell argues, does not mislead\nus, it discloses the fact that things are thus and so. This very\nfact can be judged and will be among the facts that make up the world.\nSo much about veridical perception. What about non-veridical\nperception?\n\nIf we assume that veridical and non-veridical perception have a common\nfactor, states of affairs start to pull their weight in the theory of\nperception. Consider two different kinds of non-veridical perception:\nhallucination and illusion.\n\nHallucination: if you visually hallucinate an oasis, you are\nnot mistaken about something you see: prima facie, there is\nnothing to see. But even hallucinations seem to be perceptual\nawareness of something. Johnston (2004: 134f) therefore describes\nvisual hallucinations as perceptual awareness of a complex property\n(he calls it a “profile”), a way some things might be,\nthat is not instantiated (at the time).\n\nIllusion: if the stick that is straight looks bent to you,\nthere is something you see, the stick, but it is not the way it\nvisually seems to you: you see the stick, but it is not bent. How can\none conceptualise such illusions? Johnston takes his cue from the\nhallucination case. An illusion is an improved hallucination: we are\naware of a complex property that is in part instantiated:\n\n\nIllusion is seeing a particular combined with non-veridical seeing of\nthe particular as thus and so. When the seeing as is\nprimary in this way, one is aware of a particular and one is aware of\na complex profile, only part of which is instantiated by the\nparticular. One also sees the particular as instantiating parts of the\nprofile, parts that it does not instantiate. (Johnston 2004: 174)\n\n\nIf you experience the straight stick as bent, there is something your\nexperience is of. This is not only the stick, but something which\ncombines the stick and being bent: the state of affairs of the\nstick’s being bent (at a time). This state of affairs exists,\nbut does not obtain. Your visual experience has an object, but because\nthe object does not obtain, you suffer an illusion.\n\nIn sum: states of affairs offer themselves up to systematize the\nrelations between seeing, visual hallucination and illusion. For\ninstance, one might suggest the following explications: \nS’s experience as of a’s being F is S’s seeing a to\nbe F, if, and only if, the state of affairs of a’s being F\nobtains and causes the experience in the right way; S’s\nexperience is an illusion if, and only if, the state of affairs does\nnot obtain; and the experience is a hallucination if, and only if,\nonly the state of affairs of a’s being F does not exist, but its\nproperty-part does.\n\nThis systematization is based on the assumption that there is a common\nfactor in seeing and suffering from a visual illusion: both are\nexperiences of a state of affairs, the only difference is that the\nstates of affairs does not obtain in the second case. McDowell (see\nhis 1982) and other philosophers argue that it is a mistake to hold\nthat veridical perception and illusion involve a common factor. The\nplausibility of an argument for states of affairs as the primary\nobjects of perception depends on the defensibility of the common\nfactor assumption.\n\n \n4.2 States of Affairs in the Metaphysics of Value\n\nWhich things are good for their own sake and without qualification?\nParticulars like the Taj Mahal? Properties like Beauty or Justice? Or\nsomething else?\n\nThe British philosopher William David Ross was one of the first who\nargued that one could make progress with these questions about value\nby bringing in the referents of ‘that’-clauses:\n\n\nConsideration of the question is aided if we adopt the view […] that\nwhat is good or bad is always something properly expressed by a\nthat-clause, i.e. an objective, or as I should prefer to call it, a\nfact. (Ross 1930: 137)\n\n\nAccording to Ross, Justice is not intrinsically good. What is\nintrinsically good is that someone or other is just.\nRabinowicz and Rønnow-Rasmussen 2000 argue against Ross’s\nthesis: sometimes that a is F is good because a is\ngood. If their arguments are convincing, objectives are not the only\nkind of thing that is good/bad for its own sake.\n\nIf ‘that’ clauses introduce bearers of intrinsic value,\nwhat do these clauses refer to in ascriptions of value? It seems\nintuitively implausible to holds that thoughts are\nintrinsically good (bad). Thoughts represent how things might be or\nnot. A representation might have value but its value depends, at least\nin part, on what it represents. Hence, thoughts seem not to be bearers\nof intrinsic value. Neither facts nor states of affairs represent how\nthings might be or not. Hence, both are candidates for the role of\nbeing bearers of intrinsic value.\n\nRoss (see above) opted for facts as the bearers of intrinsic value.\nThis view is defended, among others, by Lemos (1994: 23–5) and\nZimmerman (2001: 51ff) although Zimmerman rejects the\n“fact” terminology and prefers to talk about\nproperty-exemplifications. Chisholm and Sosa (1966: 244) assumed that\nstates of affairs are bearers of intrinsic value. But they warned the\nreader:\n\n\nOrdinarily, one would not say of any unexemplified state of affairs\n(say, that everyone is happy) that it is good, or bad, or better than\nsome other state of affairs. One might say, instead, that the state of\naffairs would be good, or bad, or better than some state of affairs if\nonly it were exemplified. (ibid.)\n\n\nThis warning is the cue for Zimmerman’s (2001: 47) argument for\nthe conclusion that property-exemplifications (facts) and not state of\naffairs are value-bearers. If something has an intrinsic value, it has\nit in all circumstances. Hence, a state of affairs cannot have final\nvalue if it obtained (were exemplified) and be without value if does\nnot obtain (is not exemplified). If the value of the state of affairs\ndepended on the state of affairs’s obtaining, the state of\naffairs itself would not be the true bearer of value. The true bearer\nof value is the object that exists in all and only those situations in\nwhich the state of affairs obtains. The true bearer of intrinsic value\nis fact that exists in all and only those situation in which the state\nof affairs obtains.\n\nIf non-obtaining states of affairs can have intrinsic value, this\nargument does not get off the ground. Rabinowicz and\nRønnow-Rasmussen (2000, 401f) outline considerations that\nsupport the view that some non-obtaining states of affairs are\nintrinsically good (bad). We value (love/like) the state of affairs of\neveryone’s being happy. For example, although you know that this\nstate of affairs does not and probably will never obtain, you like it\nand like it more than the obtaining states of affairs. The question at\nissue between the fact and the state of affairs view of intrinsic\nvalue is whether a state of affairs is good (bad) because worlds in\nwhich it obtains are good (bad) or whether worlds in which the state\nof affairs obtains are good (bad) because the state of affairs is good\n(bad).\n5. States of Affairs as Complexes\n\nIn the previous sections we have seen that states of affairs can only\nplay important explanatory roles if the necessarily co-obtaining\nstates of affairs are distinct. This gives us a reason to reject\nChisholm’s (1976: 118) thesis that necessarily co-obtaining\nstates of affairs are identical. At the same time it puts weight on\nthe characterization of states of affairs as “involving”\nobjects and properties or as composed out of objects and properties.\nIt seems intuitively plausible that the state of affairs\nSocrates’s being wise involves Socrates and the\nproperty of being wise. But in what way do states of affairs involve\nparticulars and properties?\n5.1 States of Affairs as N-Tuples and Wholes\n\nOrdered n-tuples have members. Are states of affairs n-tuples that\nhave objects and properties as members? Is, for example, the state of\naffairs Socrates’s being wise nothing but the ordered\npair \\(\\langle\\)Socrates, being wise\\(\\rangle\\)? Plantinga answers\nNO:\n\n\nClearly there are many set-theoretical models of our talk about states\nof affairs and individuals. Why pick any of them as more revealing\nthan the others? (Plantinga 1984: 327)\n\n\nWe can model states of affairs as ordered n-tuples in many different\nways. But there seems no way to decide between \\(\\langle\\)Socrates,\nbeing wise\\(\\rangle\\) and \\(\\langle\\)being wise, Socrates\\(\\rangle\\)\nas the right model for the state of affairs. Hence, the state of\naffairs is not identical with either ordered pair (see Pollock 1984b:\n138).\n\nSome philosophers spell out “involvement” as containment:\nA state of affairs is a complex that contains properties and\nparticulars as parts. In order to assess this proposal, let\nus first sharpen our understanding of the part-of relation. It is\ncontroversial weather the relation we aim to pick out with\n“part-of” is reflexive (everything is part of itself) or\nnot. But it is not controversial that the relation is transitive (if\nx is a part of y, and y is a part of\nz, x is a part of z) and antisymmetrical (if\nx is part of y, and y is a part of x,\nx is identical to y) (see the entry on\n mereology,\n sect. 2 and 3). A further plausible principle governing our part-of\nrelation is the supplementation principle: if x is a part of\ny, there is an object z that is part of y and\nz does overlap, that is, have a part in common, with\nx. The supplementation principle implies the intuitively\nplausible view that nothing can have a single proper part. The\nsupplementation principle together with the uncontroversial axioms for\nthe (proper) part-of relation also implies the more controversial\nthesis that complex objects with the same parts are identical (see\nentry on\n mereology,\n 3.2).\n\nThe transitivity of part-of immediately gives rise to problems. For\ninstance, Frege wrote to Wittgenstein:\n\n\n[If Vesuvius is part of a state of affairs,] it seems that parts of\nVesuvius must also be parts of this fact; the fact will hence also\nconsist of solidified lava. This does not seem right to me. (Frege\n1919: 20; my translation)\n\n\nIf Vesuvius is part of the obtaining state of affairs\nVesuvius’s being a volcano, the state of affairs must\nby the transitivity of part-of contain the parts of solidified lava\nthat are parts of Vesuvius. But if the state of affairs contains the\nsolidified lava as parts, it must have a weight and an extension etc.\nHowever, the state of affairs Vesuvius’s being a\nvolcano is not a thing that has weight etc.\n\nThere are further problems for the view that states of affairs are\ncomplexes. If the state of affairs a’s being\nF has only a and being F as its\nparts (in any plausible sense of “part”), it can only\nexist at a time at which a and being F exist\n(the sum of all my body parts exists only at the time when all my body\nparts exist). Hence, the state of affairs a’s\nceasing to exist before b’s starting to exist cannot be\na complex containing a and b. For there is no time when\nits constituents both exist (see Künne 2003: 122).\n\nThe principles for the (proper) part-of relation imply that complexes\nwith the same parts are identical. But take the state of affairs that\nRomeo loves Juliet. If it has Romeo, Love and Juliet as its parts, it\nis the same as the state of affairs that Juliet loves Romeo. But\nintuitively, the state of affairs Juliet’s loving Romeo\nis different from the state of affairs Romeo’s loving\nJuliet. On the standard mereological conception of part,\nparticulars and universals are not parts of states of affairs.\n5.2 Non-Mereological Composition to the Rescue?\n\nThe last point cuts both ways. Why not say that different complex\nobjects can have the same parts? Armstrong (1997: 118) answered this\nquestion positively and argued that facts are non-mereological\ncomposites. Lewis has denied that there is room for non-mereological\ncomposition (see Lewis 1992: 213; for discussion McDaniel 2009).\nHowever, independently of considerations about states of affairs we\nallow for different wholes that share all their parts. For instance,\nthe sentences “John loves Mary” and “Mary loves\nJohn” both consist of the same words “John”,\n“Mary” and “loves”, yet they are clearly\ndifferent sentences.\n\nBut our intuitive notion of part does not allow for wholes with only\none part: if something x is part of a whole W, there is\na remainder of W that is not identical with x. To\nillustrate: If you tell me that this slice is part of your cake, but\nthere is no distinct, further part of your cake, I will take you to\nmake joke or to be confused. The remainder principle is implied by the\nsupplementation principle of mereology, but not the other way around\n(see\n mereology\n entry, sect. 3.2) Hence, we can draw on the remainder principle\nwithout endorsing the stronger supplementation principle. Now there\nseem to be states of affairs that “contain” only one\nproperty (see Bynoe 2011 who argues the following point in detail).\nBradley’s Regress which was discussed in\n section 3.1\n seems to show that the state of affairs Socrates’ being\nwise consists only of Socrates and being wise. There is\nno relation that ties them to a state of affairs. Otherwise the\nquestion would arise what relates this relation to Socrates and\nbeing wise. Now some properties instantiate themselves:\nidentity is self-identical. Hence, the state of affairs\nidentity’s being self-identical obtains. But this state\nof affairs contains only the property of identity. There seems to be\nno intuitively acceptable sense of “part” in which such\nstates of affairs have parts.\n\nWe are back then to the problem of how to make sense of how a state of\naffairs involves properties and particulars. In order to solve it, we\nneed to find a relation between the state of affairs\na’s being F and a and being\nF that (i) does not make a and being F\nparts of the state of affairs, (ii) allows one to distinguish\nbetween necessarily co-obtaining states of affairs, and (iii)\ndistinguishes the state of affairs a’s being\nF from other objects that, intuitively speaking, involve\na and being F.\n5.3 Are States of Affairs Ontologically Dependent?\n\nFine (1982: 51–2) has suggested an answer that invokes the\nindependently motivated idea that the identity of some objects is\nexplained in terms of the identity of other objects (see also Fine\n1995; Bynoe 2011: 99–100; and Keller 2013: 669). Consider\nFine’s example of the singleton of 1. The singleton of 1 is the\nset whose sole member is 1. The singleton of 1 is ontologically\ndependent on 1 because its identity depends on the identity of 1. We\nexplain what the singleton is by appealing to 1, but not the other way\naround. Similarly, the identity of (atomic) states of affairs is\nexplained in terms of objects and properties. Fine (1982: 52) takes\nbasic states of affairs—propositions in his\nterminology—to be the results of the application of the\noperation of predication to particulars and properties. We say what\nthe state of affairs a’s being F is by\nsaying that it is the result of predicating being F to\na. Hence, the state of affairs a’s being\nF depends on predicating being F to\na. Complex states of affairs are the result of the\napplication of such operations as conjunction and disjunction to basic\nstates of affairs (on Operationalism as a general approach see Fine\n2010: 564ff). The notion of predication gives rise to several\nquestions and we will come back to it in the next section.\n\nIf states of affairs are ontologically dependent on particulars and\nproperties, we can satisfy the desiderata (i) to (iii):\n\n(i) An object can ontologically depend on other objects without being\na complex that contains these objects as parts. The axis of the earth\nontologically depends on the Earth, but it does not contain the Earth\nas a constituent. The assumption that the state of affairs\na’s being F ontologically depends on\na and F can therefore solve the problems that arise for\nthe assumption that it contains a and F. Take for\nexample Frege’s intuitive argument against the view that states\nof affairs contain physical objects like Vesuvius. The state of\naffairs Vesuvius’s being a volcano ontologically\ndepends on Vesuvius, but it does not contain it as a part. Hence, it\ndoes not contain the lava parts that are the parts of Vesuvius. There\nis no need to ascribe weight etc. to the state of affairs.\n\nOntological dependence helps us to get around the temporal problems\nraised by the logical complex view of states of affairs. While a\ncomplex cannot exist at a time at which some of its parts don’t\nexist, an object can ontologically depend on objects that no longer\nexist. (I ontologically depend on a particular event, the\nfertilization of a particular egg by a particular sperm, although this\nevent is long past.)\n\n(ii) Fine’s proposal suggests that states of affairs are\nindividuated in terms of the objects and relations in virtue of which\nthey exist:\n\n(Same2) If \\(S_1\\) and\n\\(S_2\\) are states of affairs, \\(S_1 = S_2\\) if, and only if, \\(S_1\\)\nand \\(S_2\\) exist in virtue of the same properties predicated of the\nsame particulars.\n\n\nThis criterion of identity for states of affairs distinguishes between\nthe necessarily co-obtaining states of affairs Hesperus’s\nbeing self-identical and Socrates’ being\nself-identical because they ontologically depend on different\nthings. Hence, they come out as different. In turn,\nHesperus’s being a planet and Phosphorus’s\nbeing a planet come out, as it is desirable, as the same state of\naffairs.\n\n(iii) If the state of affairs Hesperus’s being a planet\nontologically depends on Hesperus, it can only exist if Hesperus\nexists at some time. In contrast, a thought can exist whether or not\nthe objects it purports to be about ever existed or will exist. The\nthought that Pegasus is a horse exists, whether there is such a horse\nor not.\n\nThe notion of ontological dependence sheds light on the sense in which\nstates of affairs “involve” particulars and properties: a\nstate of affairs involves those objects on which it ontologically\ndepends. Consider as a representative example Richard’s 2013\nview of propositions as states of affairs. He identifies states of\naffairs with ways for things to be. A way for things to be is, in\nturn, identified by the things and the way these things need to be for\nthe way for things to be to be how things are. A way for things to be\nis a property the world might have. The existence of this property\ndepends on the existence of the properties and particulars we need to\nrefer to in identifying it. If there is no Eiffel Tower, for example,\nthere is no way for the Eiffel Tower to be. Hence, states of affairs\nontologically depend on particulars and properties. Richard (2013:\n704) goes a step further by saying that ontological dependence is\n“a mark of mereological relations”. Hence, states of\naffairs should have constituent structure. But the additional claim\nthat states of affairs are (in some sense) wholes with parts does not\nexplain more than the ontological dependence claim. Rather the\nopposite: it leads to the problems discussed above.\n\nThe notion of ontological dependence helps to articulate how states of\naffairs are related to particulars and properties. But the ontological\ndependence of states of affairs on properties and particulars is not\nbrute. It is because some properties are predicated of some objects\nthat (i) they form a state of affairs (ii) such that this state of\naffairs depends on them and can be said to involve them. A fundamental\nquestion about states of affairs concerns then the conditions of\npredicability. We will come back to this question in section 6.3.\n6. The Unity of a State of Affairs\n6.1 The Unity-Problem\n\nIf one conceives of a state of affairs as complexes that\n“contain” particulars and properties, one needs to answer\nthe unity-question “What unifies some particulars and properties\ninto one state of affairs?” An answer to this question should\ndistinguish states of affairs from other complexes. Frege pressed this\npoint in his letters to Wittgenstein:\n\n\nIs every connection of objects a state of affairs? Does it not also\ndepend on how the connection is produced? What is the tie? Can this\nperhaps be gravitation, as with the system of planets? Is it [the\nsystem of planets] a state of affairs? (Frege 1919: 20, my\ntranslation)\n\n\nThe solar system consists of the sun and the planets pulled into orbit\naround it by gravity. If this does not qualify as a state of affairs\nthen there must be some relation independent of gravitation that\nunites the things involved in a state of affairs. What distinguishes\nthis complex physical object from the state of affairs the\nsun’s pulling the planets into orbit by gravity? If the\nlatter contains the sun and the planets and the pulling-by gravity\nrelation, the distinction between the states of affairs and solar\nsystem must lie in what unites their elements.\n\nRussell argued that there is no plausible answer to the unity-question\nfor states of affairs (he called them “propositions”). He\nexplains his main worry about states of affairs as follows:\n\n\nOur disbelief in their [propositions’] reality may be reinforced\nby asking ourselves what kind of entity a false proposition could be.\nLet us take some very simple false proposition, say “A\nprecedes B”, when in fact A comes after B.\nIt seems as though nothing were involved here beyond A and\nB and “preceding” and the general form of dual\ncomplexes. But since A does not precede B, these objects\nare not put together in the way indicated in the proposition. It\nseems, therefore, that nothing which is actually composed of these\nobjects is the proposition; and it is not credible that anything\nfurther enters the proposition. (Russell 1913: 109–10; for a\ndetailed discussion of this argument see Wetzel 1998)\n\n\nWhat unifies A, B and the relation of Preceding\nto the fact that A precedes B? A’s actually\npreceding B. What unifies A, B and the relation\nof Preceding to the state of affairs A’s\npreceding B? If A does not precede B, the\nunity of the state of affairs cannot consist in A being\nactually related by the preceding relation to B.\n\nSo far Russell has only shown that the unity of a state of affairs\nA’s standing in R to B does not\nconsist in A’s standing in R to B.\nIn addition, he has imposed a constraint on answers to the\nunity-question. He says that it is not credible that there is a\nunifying element that is not a constituent of the state of affairs.\nRussell himself couldn’t find an answer to the unity-question\nthat met his constraint. Hence, he tried to eliminate states of\naffairs.\n6.2 External Unification\n\nWhile Russell does not refute the view that there are states of\naffairs, he asks philosophers who believe in them a difficult\nquestion. To see the force of the constraint he imposes on answers to\nthe unity-question consider a proposal that violates it. External\ntheories develop the following general idea (I take the\n“external/internal” terminology from Vallicella 2000):\n\nThe state of affairs a’s being F exists if, and\nonly if, there is something distinct from a, being\nF and a’s being F & it unifies\na and being F to form a’s being\nF.\n\nRoughly speaking, the external unifier can bring the constituents of\nstates of affairs together even if they don’t constitute a fact.\nA psychological version of the External Theory is proposed in\nValicella 2000. According to him, the external ground of unity is the\njudging consciousness that brings about the unity of a state of\naffairs (Valicella 2000: 252).\n\nRussell, in turn, argued that a mental act cannot unify some things to\nform a state of affairs:\n\n\nSuppose we wish to understand “A and B are\nsimilar”. It is essential that our thought should, as is said,\n“unite” or “synthesize” the two terms and the\nrelation; but we cannot actually “unite” them,\nsince either A and B are similar, in which case they are\nalready united, or they are dissimilar, in which case no amount of\nthinking can force them to be united. (Russell 1913: 116)\n\n\nAny mental activity seems simply to be unable to create unity where\nnone obtains already. If I think of a and being\nF, why should a new complex object consisting of them come\ninto existence? Russell himself goes on to suppose that the mind is\nable to unite A, B and similarity with a logical form.\nHow the mind can have that ability goes unexplained.\n\nThe linguistic version of the External Theory takes states of affairs\nto be descripta of sentences that owe their unity to the sentences\nthat describe them:\n\n\nThe state of affairs a’s being F exists\nif, and only if, there is a sentence of a language L (or an extension\nof L) that concatenates a singular term referring to a and a\ngeneral term referring to F. (see Taylor 1985: 29ff; King 2009:\n263)\n\n\nThe linguistic version gives up on the view that states of affairs are\nlanguage independent (see King 2009: 259 who concedes this). There is\nnothing in our intuitive notion of states of affairs that justifies\nthe assumption that states of affairs depend for their unity on the\nexistence of a language in which they are described. For example,\nthere will be a space of probable outcomes of an event whether there\nare descriptions of them or not.\n\nThe criticism of the External Theory makes Russell’s constraint\non an answer to the unity-question plausible. States of affairs are\nconceived of as sui generis entities that do not owe their\nunity and hence their identity to anything else.\n6.3 Internal Unification\n\nThis brings us to Internal Theories that explain the unity of a state\nof affairs merely by appealing to its constituents.\n\nThe state of affairs a’s being F exists\nif, and only if, a or being F or both unify the\nstate of affairs.\n\nRamsey describes (but does not endorse) the core of this view when he\nsays:\n\n\n[I]n every atomic fact there must be one constituent which is in its\nown nature incomplete or connective and, as it were, holds the other\nconstituents together. (Ramsey 1925: 408)\n\n\nFor Wittgenstein in his Tractatus Logico-Philosophicus there\nis no designated connector in a state of affairs. All constituents are\nincomplete and mutually complete each other:\n\n\nIn a state of affairs objects fit into one another like the links in a\nchain. (Wittgenstein 1918: 2.03; Pears/McGuinness translation)\n\n\nSo far we have only been given a necessary condition for the existence\nof a state of affairs. Among the things that enter into a state of\naffairs there must be at least one incomplete one. Wittgenstein will\nrequire incompleteness or connectivity of all things that enter a\nstate of affairs.\n\nThe notion of incompleteness at work here is difficult to explain. But\none way to develop it is to propose that the incomplete and connecting\nelements are functions. For example, the property being\nF is conceived of as a function that takes a particular\na as argument and maps it to the state of affairs\na’s being F (see Oliver 1992: 91). The\nproblems of the functional model of states of affairs are manifest in\nthe development of Frege’s work. Frege 1879 held that sentences\nstand for what he called “judgeable contents”, complexes\ncomposed of functions and objects. For Frege predication is the\napplication of a function to an object. Judgeable contents seem to be\nnothing other than states of affairs. However, the idea that states of\naffairs are complex does not sit happily with Frege’s further\nidea that the judgeable content a’s being\nF is the value of the function F for a as\nargument.\n\nNow different functions have the same value for different arguments.\nFor example, 3 is the value of the function Square root of\nx for 9 and the value of the function \\(x+1\\) for 2. Which\nof these arguments and functions is contained in the value 3? Since\nthere is no principle that singles out one argument and function as\nconstituting the value, we should abandon either the functional model\nof incompleteness or the idea that states of affairs have\nconstituents. Later Frege takes the second option:\n\n\nThe references of the parts of a sentence are not parts of the\nreference of the sentence. (Frege 1910–14: 87)\n\n\nSince different functions can have the same value for different\narguments, Frege arrived at the view that a sentence that is either\ntrue or false refers to its truth-value, the True or the False. Every\ntrue (false) sentence has the same referent: the True (the False).\nStates of affairs have no place in the Fregean theory of reference.\nThe “case study” of Frege shows that the functional model\nof incompleteness undermines the very idea that states of affairs are\ncomplexes (for a reply to this argument see Gaskin 2008: 100).\n\nThe strategy to explain the unity of a state of affairs by using the\nnotion of incompleteness either only labels the problem or, if\nincomplete elements are taken to be functions, threatens the very idea\nof states of affairs. Can one dispense with the notion of\nincompleteness in an answer to the unity-question?\n\nThe unity-question arises on a conception that takes states of affairs\nto be ontologically dependent entities. Take the state of affairs\nAristotle’s being wise. It ontologically depends on\nAristotle and being wise. So do the ordered pair\n\\(\\langle\\)Aristotle, being wise\\(\\rangle\\) and the\nmereological sum of Aristotle and being wise. What\ndistinguishes them? If we follow Fine, the answer will invoke an\noperation that “generates” the entities in question.\nStates of affairs are generated by predication, ordered pairs by\nanother operation.\n\nNow saying that something is predicated of something else sounds as if\nthe existence of a state of affairs depends on performing an act. But\nthis is a misunderstanding. Johnston explains:\n\n\n[P]redicability guarantees predication. Whenever F-ness is\npredicable of a, there will be something that is the\npredication of F-ness to a. (Johnston 2006: 684)\n\n\nAll the interesting work is done by the notion of predicability:\n\nThe state of affairs a’s being F exists\nif, and only if, being F is predicable of\na.\n\nWhen a property (relation) is predicable of some objects will be\ndetermined by a number of principles (or axioms) (Johnston 2006: 685).\nFor example, particulars are not predicable of other particulars,\nn-place properties are only predicable of n particulars.\nIt is part of the nature of the objects and properties on which a\nstate of affairs ontologically depends that the properties are\npredicable of the objects. This brings us to a key thought of\nWittgenstein’s theory of states of affairs. He wrote in the\nTractatus Logico-Philosophicus:\n\n\n2.0123\n If I know an object I also know all its possible occurrences in\nstates of affairs. (Every one of these possibilities must be part of\nthe nature of the object.) \n2.0214\n If all objects are given, then at the same time all possible\nstates of affairs are also given. \n\n\n\nThe nature of particulars and properties determines whether the second\nare predicable of the first or not. Wetzel (1998: 57) fills this\nsuggestion out in an informative way. An object may be in a range of\npossible states due to its capacities. Given that the computer I am\nwriting on belongs to a particular kind there is a range of\npossibilities for it to be: it might be broken, functioning well, be\nturned off etc. Its capacities and, broadly speaking, its nature is\nthe “ontological ground of ranges of possible states of affairs\nin which [it is a constituent]” (1998: 57). One should add that\nthe nature and capacities of an object also determine a range of\nimpossibilities such as the impossibility of my computer’s\nbecoming a sentient being.\n\nHowever, consider my computer’s being to the left of my lamp.\nThis is a possibility for my computer, but it is a brute possibility\nnot grounded in its causal powers. Hence, the range of states of\naffairs which contain a particular seems to be broader than the range\nof states of affairs determined by its capacities.\n\nIf the property being F is predicable of the object\na, the state of affairs a’s being\nF exists. Hence, states of affairs exist in virtue of the\nnature of objects and properties. No unifying relation or operation in\naddition to a and being F is required. What\ndistinguishes states of affairs from other entities which\nontologically depend on the same properties and particulars is that\nstates of affairs exist because the properties are predicable of the\nparticulars.\n\nThis account assumes that if being F is predicable of\na, there is a state of affairs a’s being\nF that ontologically depends on them. This move carries\nthe problem posed by states of affairs to the right place: what are\nthe restrictions on predicability? If one has answered this question,\none has solved the unity problem for states of affairs.\n7. Conclusion\n\nDoes one need states of affairs in addition to facts and thoughts?\nYes, there seem to be good reasons to posit states of affairs as a\nsui generis category of object. If states of affairs are to\nbe useful (i) they must exist even if they do not obtain and (ii) must\ninvolve objects and properties (relations) directly. (i) is the basic\nfeature that distinguishes states of affairs from facts; (ii) the\nbasic feature that distinguishes them from thoughts. Therefore a\ntheory of states of affairs must answer the question how a state of\naffairs can “involve” objects and properties (relations)\nand combine them, if the objects don’t exemplify the properties\n(stand in the relations). Although there are promising proposals to\nanswer it, this question is still open.\nAppendix: Some Historical Background\n\nSmith (1992: 1103–4) traces state affairs like entities back to\nAristotle and medieval philosophers. Important contributions to the\ntheory of states of affairs were made in particular in Austro-German\nPhilosophy. Stumpf (1907: 29–30) claimed that the notion of\nstates of affairs was introduced in Franz Brentano’s lectures on\nlogic (1870–1885). Brentano distinguished between a mental act,\nits content and its object. When I think of Hesperus, my thinking, the\nact, has a particular content in virtue of which it\nis directed on the planet, the object. In his logic lectures\nBrentano extended this distinction to judgements (Brentano\n1870ff:13.020 [6]): when I judge that Hesperus is a planet, my judging\nhas a content and an object: the object is what is judged (“das\nGeurteilte”). Stumpf (1907: 30) called the content of a\njudgement “Sachverhalt”. This term is now translated as\n“state of affairs”.  However, Stumpf’s states\nof affairs are rather close to thoughts or propositions (see also\nSmith 1992, 1105). For example, Stumpf (1907: 30) likened states of\naffairs to Bolzano’s sentences-in-themselves. Sentences-in\nthemselves are supposed to be either true or false. This suggests that\nstates of affairs were also conceived as truth-value bearers by\nStumpf.\n\nAccording to Adolf Reinach (1911: 374, Fn.),  Edmund Husserl, a\nstudent of Brentano, was the first to clarify the significance and\ndistinctive nature of states of affairs. Husserl (1901: V §17,\n§ 18) took the object and not the content of a judgement to be a\nstate of affairs. Every judgement has a content, in Husserl\nterminology “matter” (Materie) in virtue of which\nit is directed on a state of affairs, its object. Different kinds of\nmental act can be directed on the same state of affairs.  For\ninstance, when I wonder whether Rome was built in a day and when I\njudge that Rome was built in a day, I am directed on the same state of\naffairs, but once in the questioning, once in the assertoric mode. Can\njudgements that differ in their matter be directed on the same state\nof affairs? An answer to this question would help us to fix the\ndistinction between matter and content for judgements. But\nHusserl’s answer to this question is difficult to reconstruct.\nHusserl 1900 connected states of affairs further to correct judgement,\nprobability and the laws of logic. For instance, a judgement is\nsupposed to be correct if, and only if, the state of affairs it is\ndirected on obtains (Husserl 1900: 13).\n\nReinach 1911 followed Husserl: states of affairs are the\n“correlates” of judgement and assertion (See Meinertsen\n2020 for a comparison between Reinach and Armstrongian states of\naffairs). If, for instance, a particular rose exists, a range of\nstates of affairs exists that depend on the rose, whether they obtain\nor not (see Reinach 1911: 340). If I judge that the rose is blue, I\njudge incorrectly, because the judged state of affairs exists, but\ndoes not obtain. The property of states of affairs to obtain or fail\nto obtain distinguishes them from facts. As we have seen in section 2,\nthe “space” of states of affairs helps Reinach to clarify\nthe notions of modality and probability (see Reinach 1911:\n339–40).  Reinach (1911: 338f) proposed, but did not argue\nin detail, that states of affairs are the relata of the\nground-consequence relation. If an event a causes an event\nb, the state of affairs that a occurs is the ground\nof the state of affairs that b occurs. States of affairs\nfigure prominently in Wittgenstein’s Tractatus\nLogico-Philosophicus. Potter (2011, 106) speculates about the\ninfluence of Austrian philosophers on Wittgenstein in this\nrespect.\n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Aquila, Richard E., 1971, “Intentionality and Possible\nFacts”, <em>Noûs</em>, 5(4): 411–417.\ndoi:10.2307/2214387",
                "Armstrong D.M., 1986, “In Defence of Structural\nUniversals”, <em>Australasian Journal of Philosophy</em>, 64(1):\n85–88. doi:10.1080/00048408612342261",
                "–––, 1989, <em>A Combinatorial Theory of\nPossibility</em>, Cambridge: Cambridge University Press.",
                "–––, 1993, “A World of States of\nAffairs”, <em>Philosophical Perspectives</em>, 7:\n429–440.",
                "–––, 1997, <em>A World of States of\nAffairs</em>, Cambridge: Cambridge University Press.",
                "–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.",
                "Barcan Marcus, Ruth, 1990 [1993], “Some Revisionary\nProposals about Belief and Believing”, <em>Philosophy and\nPhenomenological Research</em>, 50: 133–153. doi:10.2307/2108036\nReprinted in her <em>Modalities</em>, Oxford: Oxford University Press\n1993: 233–255. doi:10.1093/0195096576.003.0015",
                "Barwise, Jon, 1989, <em>The Situation in Logic</em>, CSLI Lecture\nNotes, Stanford, CA: CSLI Publications.",
                "Barwise, Jon &amp; John Perry, 1983, <em>Situations and\nAttitudes</em>, Cambridge, MA: MIT Press.",
                "Betti, Arianna, 2015, <em>Against Facts</em>, Cambridge, MA: MIT\nPress.",
                "Bigelow, John, 1988, “Real Possibilities”,\n<em>Philosophical Studies</em>, 53: 37–64.",
                "Brentano, Franz, 1870ff, <em>Logik</em> (EL 80), online:\nhttp://gams.uni-graz.at/archive/objects/o:bag.el.80-html-norm/methods/sdef:HTML/get",
                "Bynoe, William, 2011, “Against the Compositional View of\nFacts”, <em>Australasian Journal of Philosophy</em>, 89(1):\n91–100. doi:10.1080/00048400903521025",
                "Chisholm, Roderick, 1970, “Events and Propositions”,\n<em>Nous</em>, 4(1): 15–24. doi:10.2307/2214288",
                "–––, 1976, <em>Person and Object: A Metaphysical\nStudy</em>, London: George Allen &amp; Unwin.",
                "Chisholm, Roderick, Sosa, Ernest, 1966. “On the Logic of\n‘Intrinsically Better’”,  <em>American\nPhilosophical Quarterly</em>, 3(3): 244–49.",
                "Church, Jennifer, 2013, <em>Possibilities of Perception</em>,\nOxford: Oxford University Press.",
                "David, Marian, 2009, “Defending Existentialism?” in\nReicher 2009: 167–209.",
                "Ducasse, Curt J., 1940, “Propositions, Opinions, Sentences\nand Facts”, <em>Journal of Philosophy</em>, 37(26):\n701–711. doi:10.2307/2018525",
                "Fine, Kit, 1975, “Critical Notice of David Lewis\n<em>Counterfactuals</em>”, <em>Mind</em>, 84(335):\n451–458. doi:10.1093/mind/LXXXIV.1.451",
                "–––, 1982, “First-Order Modal Theories\nIII: Facts”, <em>Synthese</em>, 53(1): 43–122. doi:\n10.1007/BF00500112",
                "–––, 1995, “Ontological Dependence”,\n<em>Proceedings of the Aristotelian Society</em>, 95:\n269–290.",
                "–––, 2010, “Towards a Theory of\nPart”, <em>Journal of Philosophy</em>, 107(11): 559–589.\ndoi:10.5840/jphil20101071139",
                "–––, 2012, “Counterfactuals without\nPossible Worlds”, <em>Journal of Philosophy</em>, 109(3):\n221–246. doi:10.5840/jphil201210938",
                "Forbes, Graeme, 1987, “Is there a Problem about Persistence?\nII”, <em>Proceedings of the Aristotelian Society</em>,\n<em>Supplementary Volume</em>, 61: 136–155.",
                "–––, 1989, <em>Languages of Possibility</em>,\nOxford: Basil Blackwell.",
                "–––, 1992, “Worlds and States of Affairs:\nHow Similar Can They Be?” in Kevin Mulligan (ed.) <em>Language,\nTruth and Ontology</em>, Dordrecht: Springer, 118–132.",
                "Frege, Gottlob, 1879, <em>Conceptual Notation and Related\nArticles</em>, Oxford: Clarendon Press 1972.",
                "–––, 1910–14, <em>Frege’s Lectures\non Logic: Carnap’s Jena Notes, 1910–1914</em>, edited by\nSteve Awodey, Erich Reck, Gottfried Gabriel. Open Court: LaSalle\n2004.",
                "–––, 1919, “Letter to Wittgenstein\n28.6.1919”, reprinted in <em>Grazer Philosophische Studien</em>,\n33/34 (1989), 19–20.",
                "Gaskin, Richard, 2008, <em>The Unity of the Proposition</em>,\nOxford: Oxford University Press.",
                "Gilmore, Cody, 2014, “Parts of Propositions”, in\nShieva Kleinschmidt (ed.) <em>Mereology and Location</em>, Oxford:\nOxford University Press, 156–208.",
                "Horwich, Paul, 1990, <em>Truth</em>, Oxford: Basil Blackwell.",
                "Hossack, Keith, 2007, <em>The Metaphysics of Knowledge</em>,\nOxford: Oxford University Press.",
                "Humberstone, I. Lloyd, 1981, “From Worlds to\nPossibilities”, <em>Journal of Philosophical Logic</em>, 10:\n313–339.",
                "Husserl, Edmund, 1900, <em>Logische Untersuchungen. Erster Band:\nProlegomena zur Reinen Logik</em>, First Edition 1900, Reprint of the\nsecond (1913) edition, Tübingen: Niemeyer.",
                "–––, 1901, <em>Logische Untersuchungen. Zweiter\nBand I: Untersuchungen zur Phänomenologie und Theorie der\nErkenntnis, </em>First Edition 1901,  Reprint of the second\n(1913) edition, Tübingen: Niemeyer.",
                "Johnston, Mark, 2004. “The Obscure Object of\nHallucination”, <em>Philosophical Studies, </em>120 (1/3):\n113–83. doi/org/10.1023/B:Phil.0000033753.64202.21",
                "–––, 2006, “Hylomorphism”,\n<em>Journal of Philosophy</em>, 103(12): 653–698.\ndoi:10.5840/jphil2006103125",
                "Keller, Lorraine, 2013, “The Metaphysics of Propositional\nConstituency”, <em>Canadian Journal of Philosophy</em>,\n43(5–6): 655–678. doi:10.1080/00455091.2013.870735",
                "Kim, Jaegwon, 1979, “States of Affairs, Events, and\nPropositions”, in E. Sosa (ed.) <em>Essays on the Philosophy of\nRoderick M. Chisholm</em>, <em>Grazer Philosophische Studien</em>,\n7–8: 147–162. doi:10.5840/gps19797/821",
                "King, Jeffrey C., 2009, “Questions of Unity”,\n<em>Proceedings of the Aristotelian Society</em>, 109: 257–277.\ndoi:10.1111/j.1467-9264.2009.00267.x",
                "Kripke, Saul, 1980, <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.",
                "Künne, Wolfgang, 1987, “The intentionality of thinking:\nthe difference between State of Affairs and Propositional\nMatter”, in Kevin Mulligan (ed.), <em>Speech Act and\nSachverhalt: Reinach and the foundations of realist\nphenomenology</em>, Dordrecht: Martinus Nijhoff Publishers,\n175–187",
                "–––, 2003, <em>Conceptions of Truth</em>,\nOxford: Oxford University Press.",
                "Lemos, Noah M., 1994. <em>Intrinsic Valu</em><em>e: Concept and\nWarrant</em>. Cambridge: Cambridge University Press.",
                "Levinson, Jerrold, 2006. “Why there are no tropes”,\n<em>Philosophy</em> 81 (318): 563–79.",
                "Lewis, David, 1973, <em>Counterfactuals</em>, Cambridge, MA:\nHarvard University Press.",
                "–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Basil Blackwell.",
                "–––, 1992, “Critical notice of David\nArmstrong, <em>A Combinatorial Theory of Possibility</em>”,\n<em>Australasian Journal of Philosophy</em>, 70: 211–224.",
                "McDaniel, Kris, 2009, “Structure-Making”,\n<em>Australasian Journal of Philosophy</em>, 87: 251–274.\ndoi:10.1080/00048400802587374",
                "McDowell, John, 1982, “Criteria, Defeasibility and\nKnowledge”, <em>Proceedings of the British Academy</em>, 68:\n455–79.",
                "–––, 1994,  <em>Mind and World</em>,\nCambridge, MA: Harvard University Press.",
                "Meinertsen, Bo, 2020,  “Reinach and Armstrongian State\nof Affairs Ontology”, <em>Axiomathes,</em> Online first.",
                "Merricks, Trenton, 2015, <em>Propositions</em>, Oxford: Oxford\nUniversity Press.",
                "Moore, George E., 1910, <em>Some Main Problems of Philosophy</em>,\nLondon: Allen and Unwin 1953.",
                "Neale, Stephen, 2001, <em>Facing Facts</em>, Oxford: Oxford\nUniversity Press.",
                "Oliver, Alex, 1992, “Could there be conjunctive\nuniversals?” <em>Analysis</em>, 52(2): 88–97.\ndoi:10.2307/3328277",
                "Plantinga, Alvin, 1974, <em>The Nature of Necessity</em>, Oxford:\nOxford University Press.",
                "–––, 1983, “On Existentialism”,\n<em>Philosophical Studies</em>, 44(1): 1–21.\ndoi:10.1007/BF00353411",
                "–––, 1984, “Reply to John L.\nPollock”, in J.E. Tomberlin and P. van Inwagen (eds.) <em>Alvin\nPlantinga</em>, Princeton: Princeton University Press,\n313–329.",
                "Pollock, John, 1982, “The logic of logical necessity”,\n<em>Logique et Analyse</em>, 10: 307–323.",
                "–––, 1984a, <em>The Foundations of Philosophical\nSemantics</em>, Princeton: Princeton University Press.",
                "–––, 1984b, “Plantinga on Possible\nWorlds”, in J.E. Tomberlin and P. van Inwagen (eds.) <em>Alvin\nPlantinga</em>, Princeton: Princeton University Press,\n121–144.",
                "Potter, Michael, 2011,  <em>Wittgenstein’s Notes on\nLogic. </em>Oxford: Oxford University Press.",
                "Rabinowicz, Wlodek and Rønnow-Rasmussen, Toni, 2000,\n“A Distinction in Value: Intrinsic and for Its Own Sake”,\n<em>Proceedings of the Aristotelian Society</em> 100:\n33–49.",
                "–––, 2003, “Tropic of Value”,\n<em>Philosophy and Phenomenological Research </em>66(2):\n389–403.",
                "Ramsey, Frank P., 1925, “Universals”, <em>Mind</em>,\n34(136): 401–17. doi:10.1093/mind/XXXIV.136.401",
                "Reicher, Maria Elisabeth (ed.), 2009, <em>States of Affairs</em>,\nFrankfurt A.M.: Ontos Verlag.",
                "Reinach, Adolf, 1911, “Beiträge zur Theorie des\nNegativen Urteils”, in his <em>Gesammelte Schriften</em>, Halle:\nMax Niemeyer 1921. Transl. as <em>On the Theory of Negative\nJudgement</em>, by Barry Smith in <em>Parts and Moments: Studies in\nLogic and Formal Ontology</em>, Barry Smith (ed.), Munich: Philosophia\n1982, 315–376.",
                "Restall, Greg, 1996, “Truthmakers, Entailment and\nNecessity”, <em>Australasian Journal of Philosophy</em>, 74:\n221–340. doi:10.1080/00048409612347331",
                "Richard, Mark, 2013,  “What are Propositions?”,\n<em>Canadian Journal of Philosophy</em> 43 (5/6): 702–19.",
                "Ross, William D., 1930, <em>The Right and the Good</em>, ed. by.\nPhilip Stratton-Lake, Oxford: Oxford University Press, 2002.",
                "Rumfitt, Ian, 2015, <em>The Boundary Stones of Thought</em>,\nOxford: Oxford University Press.",
                "Russell, Bertrand, 1904, “Letter to Frege”, in Gottlob\nFrege, <em>Philosophical and Mathematical Correspondence</em>, Oxford:\nBlackwell, 1980, 38–41.",
                "–––, 1912, <em>The Problems of Philosophy</em>,\nOxford: Oxford University Press, 1998.",
                "–––, 1913, <em>Theory of Knowledge: The 1913\nManuscript</em>, London: Routledge 1992.",
                "–––, 1918, “The Philosophy of Logical\nAtomism”, in his <em>Logic and Knowledge</em>, London: George\nAllen &amp; Unwin, 1968.",
                "Sainsbury, R. M., 2005, <em>Reference without Referents</em>,\nOxford: Oxford University Press.",
                "Skyrms, Brian, 1981, “Tractarian nominalism”,\n<em>Philosophical Studies</em>, 40: 199–206.",
                "Smith, Barry, 1989, “Logic and the\n<em>Sachverhalt</em>”, <em>The Monist</em>, 72:\n52–69.",
                "–––, 1992. “Sachverhalt”, in\n<em>Historisches Wörterbuch der Philosophie</em>, Volume 8,\nBasel: Schwabe, 1102–113.",
                "Stalnaker, Robert, 1986, “Counterparts and Identity”,\n<em>Midwest Studies in Philosophy</em>, 11(1): 121–140. doi:\n10.1111/j.1475-4975.1986.tb00490.x",
                "Stumpf, Carl, 1907, <em>Erscheinungen und Ihre Psychischen\nFunktionen</em>, Berlin: Verlag der Königlichen Akademie der\nWissenschaften.",
                "Taylor, Barry, 1976, “States of Affairs”, in G. Evans\nand J. McDowell (eds.) <em>Truth and Meaning</em>, Oxford: Oxford\nUniversity Press.",
                "–––, 1985, <em>Modes of Occurrence. Verbs,\nAdverbs and Events</em>, Oxford: Basil Blackwell.",
                "Vallicella, William F., 2000, “Three Conceptions of States\nof Affairs”, <em>Noûs</em>, 34: 237–259.\ndoi:10.1111/0029-4624.00209",
                "van Inwagen, Peter, 1986, “Two Concepts of Possible\nWorlds”, <em>Midwest Studies in Philosophy</em>, 11(1):\n185–213.",
                "Vendler, Zeno, 1967, “Causal Relations”, <em>Journal\nof Philosophy</em>, 64(21): 704–713. doi:10.2307/2023854",
                "Wetzel, Thomas, 1998, “Possible States of Affairs”,\n<em>Philosophical Studies</em>, 91: 43–60.",
                "Williamson, Timothy, 2002, “Necessary Existents”, in\nA. O’Hear (ed.) <em>Logic, Thought and Language</em>, Cambridge:\nCambridge University Press, 233–251.",
                "Wittgenstein, Ludwig, 1918, <em>Tractatus\nLogico-Philosophicus</em>, Trans. by D. Pears and B. McGuinness,\nLondon: Routledge, 1961.",
                "Zalta, Edward N., 1993, “Twenty-Five Basic Theorems in\nSituation and World Theory”, <em>Journal of Philosophical\nLogic</em>, 22(4): 385–428. doi:10.1007/BF01052533",
                "Zimmerman, Michael J., 2001, <em>The Nature of Intrinsic\nValue</em>, Lanham/Boulder/New York/Oxford: Rowman &amp;\nLittlefield."
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Aquila, Richard E., 1971, “Intentionality and Possible\nFacts”, <em>Noûs</em>, 5(4): 411–417.\ndoi:10.2307/2214387</li>\n<li>Armstrong D.M., 1986, “In Defence of Structural\nUniversals”, <em>Australasian Journal of Philosophy</em>, 64(1):\n85–88. doi:10.1080/00048408612342261</li>\n<li>–––, 1989, <em>A Combinatorial Theory of\nPossibility</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 1993, “A World of States of\nAffairs”, <em>Philosophical Perspectives</em>, 7:\n429–440.</li>\n<li>–––, 1997, <em>A World of States of\nAffairs</em>, Cambridge: Cambridge University Press.</li>\n<li>–––, 2004, <em>Truth and Truthmakers</em>,\nCambridge: Cambridge University Press.</li>\n<li>Barcan Marcus, Ruth, 1990 [1993], “Some Revisionary\nProposals about Belief and Believing”, <em>Philosophy and\nPhenomenological Research</em>, 50: 133–153. doi:10.2307/2108036\nReprinted in her <em>Modalities</em>, Oxford: Oxford University Press\n1993: 233–255. doi:10.1093/0195096576.003.0015</li>\n<li>Barwise, Jon, 1989, <em>The Situation in Logic</em>, CSLI Lecture\nNotes, Stanford, CA: CSLI Publications.</li>\n<li>Barwise, Jon &amp; John Perry, 1983, <em>Situations and\nAttitudes</em>, Cambridge, MA: MIT Press.</li>\n<li>Betti, Arianna, 2015, <em>Against Facts</em>, Cambridge, MA: MIT\nPress.</li>\n<li>Bigelow, John, 1988, “Real Possibilities”,\n<em>Philosophical Studies</em>, 53: 37–64.</li>\n<li>Brentano, Franz, 1870ff, <em>Logik</em> (EL 80), online:\nhttp://gams.uni-graz.at/archive/objects/o:bag.el.80-html-norm/methods/sdef:HTML/get</li>\n<li>Bynoe, William, 2011, “Against the Compositional View of\nFacts”, <em>Australasian Journal of Philosophy</em>, 89(1):\n91–100. doi:10.1080/00048400903521025</li>\n<li>Chisholm, Roderick, 1970, “Events and Propositions”,\n<em>Nous</em>, 4(1): 15–24. doi:10.2307/2214288</li>\n<li>–––, 1976, <em>Person and Object: A Metaphysical\nStudy</em>, London: George Allen &amp; Unwin.</li>\n<li>Chisholm, Roderick, Sosa, Ernest, 1966. “On the Logic of\n‘Intrinsically Better’”,  <em>American\nPhilosophical Quarterly</em>, 3(3): 244–49.</li>\n<li>Church, Jennifer, 2013, <em>Possibilities of Perception</em>,\nOxford: Oxford University Press.</li>\n<li>David, Marian, 2009, “Defending Existentialism?” in\nReicher 2009: 167–209.</li>\n<li>Ducasse, Curt J., 1940, “Propositions, Opinions, Sentences\nand Facts”, <em>Journal of Philosophy</em>, 37(26):\n701–711. doi:10.2307/2018525</li>\n<li>Fine, Kit, 1975, “Critical Notice of David Lewis\n<em>Counterfactuals</em>”, <em>Mind</em>, 84(335):\n451–458. doi:10.1093/mind/LXXXIV.1.451</li>\n<li>–––, 1982, “First-Order Modal Theories\nIII: Facts”, <em>Synthese</em>, 53(1): 43–122. doi:\n10.1007/BF00500112</li>\n<li>–––, 1995, “Ontological Dependence”,\n<em>Proceedings of the Aristotelian Society</em>, 95:\n269–290.</li>\n<li>–––, 2010, “Towards a Theory of\nPart”, <em>Journal of Philosophy</em>, 107(11): 559–589.\ndoi:10.5840/jphil20101071139</li>\n<li>–––, 2012, “Counterfactuals without\nPossible Worlds”, <em>Journal of Philosophy</em>, 109(3):\n221–246. doi:10.5840/jphil201210938</li>\n<li>Forbes, Graeme, 1987, “Is there a Problem about Persistence?\nII”, <em>Proceedings of the Aristotelian Society</em>,\n<em>Supplementary Volume</em>, 61: 136–155.</li>\n<li>–––, 1989, <em>Languages of Possibility</em>,\nOxford: Basil Blackwell.</li>\n<li>–––, 1992, “Worlds and States of Affairs:\nHow Similar Can They Be?” in Kevin Mulligan (ed.) <em>Language,\nTruth and Ontology</em>, Dordrecht: Springer, 118–132.</li>\n<li>Frege, Gottlob, 1879, <em>Conceptual Notation and Related\nArticles</em>, Oxford: Clarendon Press 1972.</li>\n<li>–––, 1910–14, <em>Frege’s Lectures\non Logic: Carnap’s Jena Notes, 1910–1914</em>, edited by\nSteve Awodey, Erich Reck, Gottfried Gabriel. Open Court: LaSalle\n2004.</li>\n<li>–––, 1919, “Letter to Wittgenstein\n28.6.1919”, reprinted in <em>Grazer Philosophische Studien</em>,\n33/34 (1989), 19–20.</li>\n<li>Gaskin, Richard, 2008, <em>The Unity of the Proposition</em>,\nOxford: Oxford University Press.</li>\n<li>Gilmore, Cody, 2014, “Parts of Propositions”, in\nShieva Kleinschmidt (ed.) <em>Mereology and Location</em>, Oxford:\nOxford University Press, 156–208.</li>\n<li>Horwich, Paul, 1990, <em>Truth</em>, Oxford: Basil Blackwell.</li>\n<li>Hossack, Keith, 2007, <em>The Metaphysics of Knowledge</em>,\nOxford: Oxford University Press.</li>\n<li>Humberstone, I. Lloyd, 1981, “From Worlds to\nPossibilities”, <em>Journal of Philosophical Logic</em>, 10:\n313–339.</li>\n<li>Husserl, Edmund, 1900, <em>Logische Untersuchungen. Erster Band:\nProlegomena zur Reinen Logik</em>, First Edition 1900, Reprint of the\nsecond (1913) edition, Tübingen: Niemeyer.</li>\n<li>–––, 1901, <em>Logische Untersuchungen. Zweiter\nBand I: Untersuchungen zur Phänomenologie und Theorie der\nErkenntnis, </em>First Edition 1901,  Reprint of the second\n(1913) edition, Tübingen: Niemeyer.</li>\n<li>Johnston, Mark, 2004. “The Obscure Object of\nHallucination”, <em>Philosophical Studies, </em>120 (1/3):\n113–83. doi/org/10.1023/B:Phil.0000033753.64202.21</li>\n<li>–––, 2006, “Hylomorphism”,\n<em>Journal of Philosophy</em>, 103(12): 653–698.\ndoi:10.5840/jphil2006103125</li>\n<li>Keller, Lorraine, 2013, “The Metaphysics of Propositional\nConstituency”, <em>Canadian Journal of Philosophy</em>,\n43(5–6): 655–678. doi:10.1080/00455091.2013.870735</li>\n<li>Kim, Jaegwon, 1979, “States of Affairs, Events, and\nPropositions”, in E. Sosa (ed.) <em>Essays on the Philosophy of\nRoderick M. Chisholm</em>, <em>Grazer Philosophische Studien</em>,\n7–8: 147–162. doi:10.5840/gps19797/821</li>\n<li>King, Jeffrey C., 2009, “Questions of Unity”,\n<em>Proceedings of the Aristotelian Society</em>, 109: 257–277.\ndoi:10.1111/j.1467-9264.2009.00267.x</li>\n<li>Kripke, Saul, 1980, <em>Naming and Necessity</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>Künne, Wolfgang, 1987, “The intentionality of thinking:\nthe difference between State of Affairs and Propositional\nMatter”, in Kevin Mulligan (ed.), <em>Speech Act and\nSachverhalt: Reinach and the foundations of realist\nphenomenology</em>, Dordrecht: Martinus Nijhoff Publishers,\n175–187</li>\n<li>–––, 2003, <em>Conceptions of Truth</em>,\nOxford: Oxford University Press.</li>\n<li>Lemos, Noah M., 1994. <em>Intrinsic Valu</em><em>e: Concept and\nWarrant</em>. Cambridge: Cambridge University Press.</li>\n<li>Levinson, Jerrold, 2006. “Why there are no tropes”,\n<em>Philosophy</em> 81 (318): 563–79.</li>\n<li>Lewis, David, 1973, <em>Counterfactuals</em>, Cambridge, MA:\nHarvard University Press.</li>\n<li>–––, 1986, <em>On the Plurality of Worlds</em>,\nOxford: Basil Blackwell.</li>\n<li>–––, 1992, “Critical notice of David\nArmstrong, <em>A Combinatorial Theory of Possibility</em>”,\n<em>Australasian Journal of Philosophy</em>, 70: 211–224.</li>\n<li>McDaniel, Kris, 2009, “Structure-Making”,\n<em>Australasian Journal of Philosophy</em>, 87: 251–274.\ndoi:10.1080/00048400802587374</li>\n<li>McDowell, John, 1982, “Criteria, Defeasibility and\nKnowledge”, <em>Proceedings of the British Academy</em>, 68:\n455–79.</li>\n<li>–––, 1994,  <em>Mind and World</em>,\nCambridge, MA: Harvard University Press.</li>\n<li>Meinertsen, Bo, 2020,  “Reinach and Armstrongian State\nof Affairs Ontology”, <em>Axiomathes,</em> Online first.</li>\n<li>Merricks, Trenton, 2015, <em>Propositions</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Moore, George E., 1910, <em>Some Main Problems of Philosophy</em>,\nLondon: Allen and Unwin 1953.</li>\n<li>Neale, Stephen, 2001, <em>Facing Facts</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Oliver, Alex, 1992, “Could there be conjunctive\nuniversals?” <em>Analysis</em>, 52(2): 88–97.\ndoi:10.2307/3328277</li>\n<li>Plantinga, Alvin, 1974, <em>The Nature of Necessity</em>, Oxford:\nOxford University Press.</li>\n<li>–––, 1983, “On Existentialism”,\n<em>Philosophical Studies</em>, 44(1): 1–21.\ndoi:10.1007/BF00353411</li>\n<li>–––, 1984, “Reply to John L.\nPollock”, in J.E. Tomberlin and P. van Inwagen (eds.) <em>Alvin\nPlantinga</em>, Princeton: Princeton University Press,\n313–329.</li>\n<li>Pollock, John, 1982, “The logic of logical necessity”,\n<em>Logique et Analyse</em>, 10: 307–323.</li>\n<li>–––, 1984a, <em>The Foundations of Philosophical\nSemantics</em>, Princeton: Princeton University Press.</li>\n<li>–––, 1984b, “Plantinga on Possible\nWorlds”, in J.E. Tomberlin and P. van Inwagen (eds.) <em>Alvin\nPlantinga</em>, Princeton: Princeton University Press,\n121–144.</li>\n<li>Potter, Michael, 2011,  <em>Wittgenstein’s Notes on\nLogic. </em>Oxford: Oxford University Press.</li>\n<li>Rabinowicz, Wlodek and Rønnow-Rasmussen, Toni, 2000,\n“A Distinction in Value: Intrinsic and for Its Own Sake”,\n<em>Proceedings of the Aristotelian Society</em> 100:\n33–49.</li>\n<li>–––, 2003, “Tropic of Value”,\n<em>Philosophy and Phenomenological Research </em>66(2):\n389–403.</li>\n<li>Ramsey, Frank P., 1925, “Universals”, <em>Mind</em>,\n34(136): 401–17. doi:10.1093/mind/XXXIV.136.401</li>\n<li>Reicher, Maria Elisabeth (ed.), 2009, <em>States of Affairs</em>,\nFrankfurt A.M.: Ontos Verlag.</li>\n<li>Reinach, Adolf, 1911, “Beiträge zur Theorie des\nNegativen Urteils”, in his <em>Gesammelte Schriften</em>, Halle:\nMax Niemeyer 1921. Transl. as <em>On the Theory of Negative\nJudgement</em>, by Barry Smith in <em>Parts and Moments: Studies in\nLogic and Formal Ontology</em>, Barry Smith (ed.), Munich: Philosophia\n1982, 315–376.</li>\n<li>Restall, Greg, 1996, “Truthmakers, Entailment and\nNecessity”, <em>Australasian Journal of Philosophy</em>, 74:\n221–340. doi:10.1080/00048409612347331</li>\n<li>Richard, Mark, 2013,  “What are Propositions?”,\n<em>Canadian Journal of Philosophy</em> 43 (5/6): 702–19.</li>\n<li>Ross, William D., 1930, <em>The Right and the Good</em>, ed. by.\nPhilip Stratton-Lake, Oxford: Oxford University Press, 2002.</li>\n<li>Rumfitt, Ian, 2015, <em>The Boundary Stones of Thought</em>,\nOxford: Oxford University Press.</li>\n<li>Russell, Bertrand, 1904, “Letter to Frege”, in Gottlob\nFrege, <em>Philosophical and Mathematical Correspondence</em>, Oxford:\nBlackwell, 1980, 38–41.</li>\n<li>–––, 1912, <em>The Problems of Philosophy</em>,\nOxford: Oxford University Press, 1998.</li>\n<li>–––, 1913, <em>Theory of Knowledge: The 1913\nManuscript</em>, London: Routledge 1992.</li>\n<li>–––, 1918, “The Philosophy of Logical\nAtomism”, in his <em>Logic and Knowledge</em>, London: George\nAllen &amp; Unwin, 1968.</li>\n<li>Sainsbury, R. M., 2005, <em>Reference without Referents</em>,\nOxford: Oxford University Press.</li>\n<li>Skyrms, Brian, 1981, “Tractarian nominalism”,\n<em>Philosophical Studies</em>, 40: 199–206.</li>\n<li>Smith, Barry, 1989, “Logic and the\n<em>Sachverhalt</em>”, <em>The Monist</em>, 72:\n52–69.</li>\n<li>–––, 1992. “Sachverhalt”, in\n<em>Historisches Wörterbuch der Philosophie</em>, Volume 8,\nBasel: Schwabe, 1102–113.</li>\n<li>Stalnaker, Robert, 1986, “Counterparts and Identity”,\n<em>Midwest Studies in Philosophy</em>, 11(1): 121–140. doi:\n10.1111/j.1475-4975.1986.tb00490.x</li>\n<li>Stumpf, Carl, 1907, <em>Erscheinungen und Ihre Psychischen\nFunktionen</em>, Berlin: Verlag der Königlichen Akademie der\nWissenschaften.</li>\n<li>Taylor, Barry, 1976, “States of Affairs”, in G. Evans\nand J. McDowell (eds.) <em>Truth and Meaning</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>–––, 1985, <em>Modes of Occurrence. Verbs,\nAdverbs and Events</em>, Oxford: Basil Blackwell.</li>\n<li>Vallicella, William F., 2000, “Three Conceptions of States\nof Affairs”, <em>Noûs</em>, 34: 237–259.\ndoi:10.1111/0029-4624.00209</li>\n<li>van Inwagen, Peter, 1986, “Two Concepts of Possible\nWorlds”, <em>Midwest Studies in Philosophy</em>, 11(1):\n185–213.</li>\n<li>Vendler, Zeno, 1967, “Causal Relations”, <em>Journal\nof Philosophy</em>, 64(21): 704–713. doi:10.2307/2023854</li>\n<li>Wetzel, Thomas, 1998, “Possible States of Affairs”,\n<em>Philosophical Studies</em>, 91: 43–60.</li>\n<li>Williamson, Timothy, 2002, “Necessary Existents”, in\nA. O’Hear (ed.) <em>Logic, Thought and Language</em>, Cambridge:\nCambridge University Press, 233–251.</li>\n<li>Wittgenstein, Ludwig, 1918, <em>Tractatus\nLogico-Philosophicus</em>, Trans. by D. Pears and B. McGuinness,\nLondon: Routledge, 1961.</li>\n<li>Zalta, Edward N., 1993, “Twenty-Five Basic Theorems in\nSituation and World Theory”, <em>Journal of Philosophical\nLogic</em>, 22(4): 385–428. doi:10.1007/BF01052533</li>\n<li>Zimmerman, Michael J., 2001, <em>The Nature of Intrinsic\nValue</em>, Lanham/Boulder/New York/Oxford: Rowman &amp;\nLittlefield.</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "facts",
            "fictionalism: modal",
            "logical atomism: Russell’s",
            "mereology",
            "possible worlds",
            "probability, interpretations of",
            "Russell, Bertrand",
            "truthmakers",
            "Wittgenstein, Ludwig"
        ],
        "entry_link": [
            {
                "../facts/": "facts"
            },
            {
                "../fictionalism-modal/": "fictionalism: modal"
            },
            {
                "../logical-atomism/": "logical atomism: Russell’s"
            },
            {
                "../mereology/": "mereology"
            },
            {
                "../possible-worlds/": "possible worlds"
            },
            {
                "../probability-interpret/": "probability, interpretations of"
            },
            {
                "../russell/": "Russell, Bertrand"
            },
            {
                "../truthmakers/": "truthmakers"
            },
            {
                "../wittgenstein/": "Wittgenstein, Ludwig"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=states-of-affairs\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/states-of-affairs/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=states-of-affairs&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/states-of-affairs/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=states-of-affairs": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/states-of-affairs/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=states-of-affairs&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/states-of-affairs/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Wetzel, Thomas, “States of Affairs”, <em>Stanford\nEncyclopedia of Philosophy</em> (Fall 2008 Edition), Edward N. Zalta\n(ed.) URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2008/entries/states-of-affairs/\" target=\"other\">https://plato.stanford.edu/archives/fall2008/entries/states-of-affairs/</a>&gt;.\n [This was the previous entry on states of affairs in the <em>Stanford\nEncyclopedia of Philosophy</em> – see the\n <a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=states-of-affairs\" target=\"other\">version history</a>.]"
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/archives/fall2008/entries/states-of-affairs/": "https://plato.stanford.edu/archives/fall2008/entries/states-of-affairs/"
            },
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=states-of-affairs": "version history"
            }
        ]
    }
}