{
    "url": "structuralism-mathematics",
    "title": "Structuralism in the Philosophy of Mathematics",
    "authorship": {
        "year": "Copyright © 2019",
        "author_text": "Erich Reck\n<erich.reck@ucr.edu>\nGeorg Schiemer\n<georg.schiemer@univie.ac.at>",
        "author_links": [
            {
                "mailto:erich%2ereck%40ucr%2eedu": "erich.reck@ucr.edu"
            },
            {
                "mailto:georg%2eschiemer%40univie%2eac%2eat": "georg.schiemer@univie.ac.at"
            }
        ],
        "raw_html": "<div id=\"article-copyright\">\n<p>\n<a href=\"../../info.html#c\">Copyright © 2019</a> by\n\n<br/>\nErich Reck\n&lt;<a href=\"mailto:erich%2ereck%40ucr%2eedu\"><em>erich<abbr title=\" dot \">.</abbr>reck<abbr title=\" at \">@</abbr>ucr<abbr title=\" dot \">.</abbr>edu</em></a>&gt;<br/>\nGeorg Schiemer\n&lt;<a href=\"mailto:georg%2eschiemer%40univie%2eac%2eat\"><em>georg<abbr title=\" dot \">.</abbr>schiemer<abbr title=\" at \">@</abbr>univie<abbr title=\" dot \">.</abbr>ac<abbr title=\" dot \">.</abbr>at</em></a>&gt;\n    </p>\n</div>"
    },
    "pubinfo": [
        "First published Mon Nov 18, 2019"
    ],
    "preamble": "\n\nTwo related slogans for structuralism in the philosophy of mathematics\nare that “mathematics is the general study of structures”\nand that, in pursuing such study, we can “abstract away from the\nnature of objects instantiating those structures”. (As such,\nstructuralism stands in contrast with several other general views\nabout mathematics, including: the traditional view that mathematics is\nthe science of number and quantity; the view that it is an empty\nformalism used primarily for calculation; and the view that it is the\nstudy of a basic set-theoretic universe.) As the present survey aims\nto show, these slogans, while suggestive, are ambiguous and in need of\nclarification. Indeed, they have been interpreted in various\ndifferent, even conflicting ways.\n\nThe introduction of structuralist views in the philosophy of\nmathematics is often assumed to have happened in the 1960s, in works\nby Paul Benacerraf and Hilary Putnam; the trend picked up steam in the\n1980s–90s, when Michael Resnik, Stuart Shapiro, Geoffrey\nHellman, Charles Parsons, and others entered the fray; and these\ndebates have been reshaped again during the last 20 years, by several\nphilosophical challenges to structuralism and by the introduction of\nfurther variants, including category-theoretic forms of\nstructuralism. Besides introducing the reader to the general topic of\n“structuralism in the philosophy of mathematics”, a second\nmain goal of the present entry will be to provide a novel, broader,\nand relatively comprehensive taxonomy for the varieties of\nstructuralism on offer today. \n",
    "toc": [
        {
            "#ElimVsNonElimStru": "1. Eliminative vs. Non-Eliminative Structuralism"
        },
        {
            "#Begi1960BenaPutn": "1.1 Beginnings of the Structuralism Debate in the 1960s"
        },
        {
            "#Cons1980ResnShapHellEtc": "1.2 Consolidation and Further Discussions in the 1980s"
        },
        {
            "#TowaFirsTaxoCharParsDist": "1.3 Towards a First Taxonomy of Structuralist Positions"
        },
        {
            "#FurtDeveBroaTaxo": "2. Later Developments and a Broader Taxonomy"
        },
        {
            "#MetaEpisChalStru": "2.1 Metaphysical and Epistemological Challenges"
        },
        {
            "#AddiVariBurgFefeLinnPettEtc": "2.2 Several Additional Variants of Structuralism"
        },
        {
            "#TowaRichInclTaxoForStru": "2.3 A Broader Taxonomy of Structuralist Positions"
        },
        {
            "#CateTheoStru": "3. Category-Theoretic Structuralism"
        },
        {
            "#CateTheoStudMathStru": "3.1 Category Theory as the Study of Mathematical Structures"
        },
        {
            "#CateFounDebaAbouThem": "3.2 Categorical Foundations and Debates About Them"
        },
        {
            "#CateStruAwodMcLaLandEtc": "3.3 Distinctive Features of Categorical Structuralism"
        },
        {
            "#Conc": "4. Conclusion"
        },
        {
            "#VariMathStru": "4.1 The Varieties of Mathematical Structuralism"
        },
        {
            "#StruBeyoMath": "4.2 Structuralism Beyond Mathematics"
        },
        {
            "#Bib": "Bibliography"
        },
        {
            "#Aca": "Academic Tools"
        },
        {
            "#Oth": "Other Internet Resources"
        },
        {
            "#Rel": "Related Entries"
        }
    ],
    "main_text": "\n1. Eliminative vs. Non-Eliminative Structuralism\n1.1 Beginnings of the Structuralism Debate in the 1960s\n\nThe discussion of structuralism, as a major position in\nEnglish-speaking philosophy of mathematics, is usually taken to have\nstarted in the 1960s. A central article in this connection was Paul\nBenacerraf’s “What Numbers Could Not Be” (1965; cf.\nalso Benacerraf 1996, a later follow-up). The background and foil for\nthis article was the position, dominant at the time, that axiomatic\nset theory provides the foundation for modern mathematics, including\nallowing us to identify all mathematical objects with sets. For\nexample, the natural numbers 0, 1, 2, … can be identified with\nthe finite von Neumann ordinals (starting with \\(\\emptyset\\) for 0 and\nusing the successor function \\(f: x \\rightarrow x\\cup \\{x\\})\\);\nsimilarly, the real numbers can be identified with Dedekind cuts\nconstructed set-theoretically. Arithmetic truths are then \ntruths about these set-theoretic objects; and this generalizes \nto other mathematical theories, all of whose objects are\ntaken to be sets as well.\n\nAccording to Benacerraf, such a set-theoretic foundationalist position\nmisrepresents the structuralist character of arithmetic in particular\nand of mathematics more generally. To begin with, instead of working\nwith the finite von Neumann ordinals, we can equally well work with\nthe finite Zermelo ordinals (starting again with \\(\\emptyset\\) for 0\nbut using the alternative successor function \\(f: x \\rightarrow\n\\{x\\})\\); and there are infinitely many other choices that are\nequivalent. Similarly, instead of working with a set-theoretic\nconstruction of the real numbers in terms of Dedekind cuts, we can\nwork with a construction based on equivalence classes of Cauchy\nsequences on the rational numbers as suggested by Cantor and\nothers. This basic observation is hard to deny, and even set-theorist\nfoundationalists can agree with it (more on that below). But\nBenacerraf draws some further, more controversial conclusions from\nthis basic observation. \n\nBenacerraf argues, in particular, that the natural numbers should not\nbe identified with any set-theoretic objects; in fact, they should not\nbe taken to be objects at all. Instead, numbers should be treated as\n“positions in structures”, e.g., in “the natural\nnumber structure”, “the real number structure”,\netc. All that matters about such positions are their structural\nproperties, i.e., those “stem[ming] from the relations they bear\nto one another in virtue of being arranged in a progression”\n(1965: 70), as opposed to further set-theoretic properties of the von\nNeumann ordinals, Dedekind cuts, etc. What we study and try to\ncharacterize in modern mathematics, along such lines, are the\ncorresponding “abstract structures”. It is in this sense\nthat Benacerraf suggests a structuralist position concerning\nmathematics. The details of the position are left open and somewhat\nvague, however, including how we should think about Benacerraf’s\nabstract structures in the end, except that they are not to be\nidentified with set-theoretic relational systems (consisting of sets\nas domains, with set-theoretic relations and functions defined on\nthem). \n\nA second article from the 1960s that was influential in the rise of\nstructuralism is Hilary Putnam’s “Mathematics without\nFoundations” (1967). Like in Benacerraf’s case, for Putnam\nthe foil was a set-theoretic foundationalist position. This position\nis sometimes, although not always, understood in a realist sense\n(e.g., by Gödel), i.e., as the description of an independent\nrealm of abstract objects, namely the universe of sets characterized\nby the Zermelo-Fraenkel axioms. In opposition to that position, Putnam\nsuggests a form of “if-then-ism” (which can be traced back\nto Russell).  That alternative can again be illustrated in terms of\nthe natural numbers. How should an arithmetic theorem, say\n“\\(2+3=5\\)”, \nbe understood now? It should be analyzed as having this form: \n\n\n\nFor all relational systems M, if M is a model of the\nDedekind-Peano axioms [the basic axioms for arithmetic], then \\[2_M\n+3_M =5_M\\]\n\n \n\n\n(where \\(2_M\\), \\(3_M\\), and \\(5_M\\) are what “play the\nroles” of 2, 3, and 5 in the model M). Similarly for the\nreal numbers (see Reck & Price 2000 for details).\n\nInstead of talking about if-then-ism in this connection, one can\ndescribe Putnam’s position also as a kind of “universalist\nstructuralism” (see again Reck & Price 2000), since it\ninvolves universal quantification over relevant systems and since our\ntwo structuralist slogans above seem satisfied.  Often an objection to\nthis position is the “non-vacuity problem”. It is based on\nthe observation that if-then statements of the given form are\nvacuously true if there is nothing that satisfies the antecedent,\ne.g., if there is no model of the Dedekind-Peano axioms. (As this\nwould also be the case for, say, “\\(2+3=6\\)”, the overall\nresult is clearly not desirable.) In response, one can invoke\naxiomatic set theory as providing the needed models.  But from\nPutnam’s point of view this has two drawbacks: First, it relies\non a realist and foundationalist view about set theory, it would seem,\nthus undermining the thrust of if-then-ism. Second and more basically,\nit forces us to treat set theory differently from other mathematical\ntheories, on pain of circularity. As a way out of these dilemmas,\nPutnam suggests to employ modal logic. However, the details are again\nleft open and largely unexplored, especially for the case of set\ntheory.\n1.2 Consolidation and Further Discussions in the 1980s\n\nOne way to understand Benacerraf’s discussion in his 1965\narticle is that he proposes to treat the natural number structure as a\nnew kind of abstract entity, different from set-theoretic objects and\nsystems of objects. All depends then on what exactly that amounts to,\nincluding whether one should treat such structures as objects\nthemselves, thus reifying them in some substantive and still to be\nworked out way, or not. Benacerraf himself was reluctant to do the\nlatter, in line with his overall hesitancy to talk about mathematical\nobjects. \n\nOne subsequent writer who picked up on Benacerraf’s ideas in the\nearly 1980s and tried to spell them out further, while still\nrefraining from treating structures as full-fledged objects, is\nMichael Resnik (cf. Resnik 1981, 1982, 1988, and, most systematically,\n1997). For him too, modern mathematics involves a “structuralist\nperspective”.  This includes a kind of pattern recognition; and\none of Resnik’s main goals is to spell out the corresponding\nepistemology further. Along Benacerraf’s lines, mathematical\nobjects are viewed as “positions” in corresponding\npatterns; and this is meant to allow us to take mathematical\nstatements “at face value”, in the sense of seeing\n‘0’, ‘1’, ‘2’, etc. as singular\nterms referring to such positions.  At the same time, doing so is not\nsupposed to require reifying the underlying structures, which would\nmean specifying precise criteria of identity for them, something\nResnik avoids intentionally. (He presents himself as a Quinean on this\npoint, in the sense of adopting Quine’s slogan: “No entity\nwithout identity!”)\n\nStewart Shapiro is a second philosopher of mathematics who, in the\nearly 1980s, attempts to build on Benacerraf’s paper (see\nShapiro 1983, 1989, and most systematically, Shapiro 1997). By\nfocusing more on metaphysical questions and leaving behind hesitations\nabout structures as objects, Shapiro’s goal is to defend a more\nthoroughly realist version of mathematical structuralism, thus\nrejecting nominalist and constructivist views (more on that\nbelow). Such realism includes the semantic aspect mentioned above\n(taking mathematical statements at face value); but Shapiro also wants\nto clarify the talk about “positions in structures”\nfurther.  He distinguishes two perspectives on them. According to the\nfirst, the positions at issue are treated as “offices”,\ni.e., as slots that can be filled or occupied by various objects\n(e.g., the position “0” in the natural number structure is\noccupied by \\(\\emptyset\\) in the series of finite von Neumann\nordinals).  According to the second perspective, the positions are\ntreated as “objects” themselves; and so are the abstract\nstructures.\n\nFor Shapiro, the structures at issue thus have a dual nature: they are\n“universals”, in the sense that the natural number\nstructure, say, can be instantiated by various relational systems (the\nsystem consisting of the finite von Neumann ordinals, or of the\nZermelo ordinals, etc.); but they are also “particulars”,\nto be named by singular terms and treated as objects themselves. To\ndefend the latter further, Shapiro develops a general structure\ntheory, i.e., an axiomatic theory that specifies which structures\nexist. While modeled on set theory, this theory is justified\nindependently (more on how below). As such, it is meant to underwrite\n“ante rem structuralism”.  Shapiro’s\nterminology of “ante rem versus in re”\ninvolves an explicit reference to Medieval discussions of universals.\nThe crucial point in our context is that the structures specified in\nhis theory are meant to be ontologically independent of, indeed\nprior to, any instantiations of them. In other\nwords, the structures do not just exist \nin their instantiations, but separate to and \nbefore them. \n\nWhile Resnik’s and Shapiro’s structuralist positions are\nsometimes identified, this is somewhat misleading given the\ndifferences already mentioned. Nevertheless, there is significant\noverlap. Both recognize mathematical structures as certain patterns\nwith positions in them etc. (whether these patterns are then treated\nas full-fledged objects, in a realist sense, or not). And for both\nResnik and Shapiro, the notion of isomorphism is crucial (or some\nrelated, more general notion of equivalence; see Resnik 1997 and\nShapiro 1997). That is to say, for both a relevant structure/pattern\ncan be instantiated by any of a relevant class of isomorphic\nrelational systems. This corresponds to the fact that the axiomatic\nsystems at issue, for the natural numbers, the real numbers, and\nsimilar cases, are all categorical (or quasi-categorical in the case\nof set theory). Not every mathematical axiom system has that feature,\nof course, e.g., the axiom systems for group or ring theory allow for\nnon-isomorphic instances or models. For Resnik as well as Shapiro,\nsuch “algebraic” theories are to be treated in a\ndifferent, more derivative way; their structuralist point of view is\nmeant to apply primarily to “non-algebraic” theories,\nparadigmatically arithmetic.\n\nThere is another structuralist position from the 1980s that is quite\ndifferent and explicitly not realist, namely that introduced by\nGeoffrey Hellman (cf. Hellman 1989, 1996, and later articles). While\nfor Resnik and Shapiro the inspiration was Benacerraf’s 1965\narticle, the starting point for Hellman is Putnam’s 1967\narticle. In fact, Hellman’s “modal structuralism” is\nmeant to be a systematic development of Putnam’s modalized\nif-then-ism.  The modal aspect is now spelled out in detail and with\nreal ingenuity, including for the case of set theory (building on work\nby Zermelo etc.). For Hellman, a sentence such as\n“\\(2+3\n= 5\\)” is analyzed as follows: \n\n\nNecessarily, for all relational systems M, if M is a\nmodel of the Dedekind-Peano axioms, then \\(2_M +3_M =5_M\\). \n\n\nTo avoid the non-vacuity problem, he adds the following\nassumption:\n\n\nPossibly, there exists an M such that M is a model of\nthe Dedekind-Peano axioms. \n\n(We will come back to its justification below.)\n\nAs Hellman makes clear, his goal is to develop a form of\n“structuralism without structures” (Hellman 1996), since\nthe existence of abstract structures, postulated by Resnik and\nShapiro, is replaced by the modal aspects of his position (and\ncorresponding assumptions about necessity and possibility). In fact,\nHellman’s position is meant to be a form of nominalism, i.e., to\neliminate the appeal to any kind of abstract entity (not only abstract\nstructures but also sets etc.). Yet it is also not meant to rely\non possibilia, i.e., possible objects existing in some\nshadowy sense. This leads Hellman to a specific understanding of the\nmodalities at issue. They are meant to be basic, i.e., the relevant\npossibilities and necessities are not reducible to anything\nfurther. On the other hand, they are specified precisely in terms of\nlaws of modal logic (those of the system S5).\n1.3 Towards a First Taxonomy of Structuralist Positions\n\nFrom the late 1980s on, Shapiro’s and Hellman’s positions\nhave often been treated as the two main structuralist options.  (This\nis still reflected in Hellman & Shapiro 2019.)  As they are quite\ndifferent, this already indicates that it is wrong to see\n“structuralism in the philosophy of mathematics” as a\nunique position or a unified perspective, even though certain general\nslogans are shared. Beyond that, other versions of structuralism\nstarted to play a role in the late 1980s and early 1990s (including\nforms of “set-theoretic structuralism” that go back\nfurther in time than the 1960s, as we will see). Consequently, the\ndiscussions about structuralism have become both richer and more\ncomplex.\n\nTo clarify this situation, Charles Parsons suggested a first taxonomy,\nor at least a distinction between two main kinds of positions (Parsons\n1990). Namely, there are “eliminative” forms of\nstructuralism, as illustrated paradigmatically by Hellman; and there\nare “non-eliminative” forms of structuralism, like\nShapiro’s. (The elimination at issue concerns the postulation,\nor avoidance thereof, of structures as abstract objects.) Or put in\nHellman’s slightly later terminology, there is\n“structuralism without structures”, on the one hand, and\n“structuralism with structures”, on the other\nhand. Besides Shapiro and Resnik (with the qualifications above),\nanother proponent of the non-eliminative form is Parsons himself (see\nParsons 1990, 2004, and, most systematically, 2008); and another\nproponent of the eliminative form of structuralism is Charles Chihara\n(cf. Chihara 2004). \n\nNevertheless, it seems to have been tempting, and has remained fairly\nwidespread in the literature, to identify non-eliminative\nstructuralism with Shapiro’s position, i.e., with his realist\nand ante rem version. In fact, critics sometimes dismiss\n“philosophical structuralism” generally as a misguided\nform of metaphysics, thereby identifying such structuralism with\nShapiro’s realist form. (This seems especially tempting for\nmathematicians and for philosophers rooted deeply in mathematical\npractice; cf. Awodey 1996 and Carter 2008 for related discussions.) A\nfurther consideration of Parsons’ form of non-eliminative\nstructuralism can help to show that this is too quick and inadequate\nin the end. \n\nUnlike Shapiro, Parsons does not offer a novel, philosophically\nmotivated structure theory as the backing for his position. For him,\nwe should remain closer to mathematical practice (as it developed in\nthe late nineteenth and the twentieth centuries). In fact,\nstructuralism should be seen as growing out of that practice, rather\nthan being imposed on it from outside. For Parsons this means, among\nothers, taking abstract structures to be introduced directly by\ncategorical axiom systems, a practice he spells out further in a\n“meta-linguistic” way inspired by Quine (see Parsons\n2008). It also means that we should refrain from\n“cross-structural identifications” (as they can be found\nin Shapiro’s early works), e.g., from identifying the natural\nnumber 1 and the real number 1. Such putative identities should be\nleft indeterminate, as is done in mathematical practice.\n\nAs should be evident, Parsons’ structuralist position, like\nResnik’s, is less realist than Shapiro’s.  Moreover, he is\nexplicit that adopting a “structuralist view of mathematical\nobjects” should be seen as separable from, and orthogonal to,\nthe realism/nominalism dichotomy. Consequently, for Parsons one can be\na non-eliminative structuralist without being a realist in any strong\nsense; his own position is a case in point.  Yet Parsons’\nversion of structuralism is still meant to allow taking mathematical\nstatements at face value (as characterized above), so that it remains\nrealist in this minimal semantic sense.\n2. Later Developments and a Broader Taxonomy\n2.1 Metaphysical and Epistemological Challenges\n\nSo far we have traced the development of structuralism in the\nphilosophy of mathematics from Benacerraf and Putnam, in the 1960s, to\nResnik, Shapiro, Hellman, Chihara, and Parsons, in the\n1980s–90s. During the last 20 years, a number of further\nphilosophers have started to address this topic. We now turn to the\ncorresponding discussions, starting with certain epistemological and\nmetaphysical challenges to structuralism. Some of these concern\nnon-eliminative structuralism alone, especially Shapiro’s\nposition. (This again reflects the prominence of Shapiro’s\nposition, to the point that it is often identified, misleadingly, with\n“philosophical structuralism”.) Others are broader,\nincluding comparing the basic commitments of various forms of\nstructuralism. In what follows, we will not try to be comprehensive,\nbut provide a number of illustrative examples.\n\nNon-eliminative structuralism, in Shapiro’s and other versions,\ninvolves the thesis that all that matters about mathematical objects\nare their structural properties (as opposed to further intrinsic\nproperties). In fact, such properties are taken to determine the\nobjects’ identities. But then, objects that are\nindistinguishable in this respect—“structural\nindiscernibles”—should be identified, it seems. As several\ncritics pointed out around the year 2000, this leads to the\n“identity problem” for structuralism (cf. Keränen\n2001, earlier Burgess 1999).  It arises prominently for systems or\nstructures that are non-rigid, i.e., allow for non-trivial\nautomorphisms. In such cases, there are supposedly distinct objects\nthat are indistinguishable in the relevant sense. A widely known case\nis the system of complex numbers (with the conjugate numbers i\nand −i); but geometry and graph theory, among others,\nprovide further examples. The simplest example is probably an\nunlabeled 2-element graph with no edges, whose two vertices are\nstructurally indiscernible. \n\nHow can such cases be handled from a structuralist point of view? Is\nstructuralism (of this kind) simply incoherent, as some of its critics\ncharge? Or is it at least not applicable to non-rigid cases, which\nwould limit its reach significantly? Several responses to the identity\nproblem have been offered in the literature. One suggestion is to\n“rigidify” such structures by enlarging the vocabulary\nthat is used, e.g., by adding the constant symbol\n‘i’ for the complex numbers (either into the\noriginal language or into the language for the “setting”\nused in the background, cf. Halimi 2019). But this still seems\nproblematic in the case of many indiscernibles, perhaps even\nuncountably many. Another suggestion is to treat identity as a\nprimitive notion, as is arguably part of mathematical practice. But in\nthat case too a number of questions remain (see Ladyman 2005, Button\n2006, Leitgeb & Ladyman 2008, Shapiro 2008, Ketland 2011, and\nMenzel 2018, among others).\n\nA second, more basic problem for structuralism starts again with the\nidea that all that matters about mathematical objects are their\nstructural properties. With respect to non-eliminative structuralism,\nthis is sometimes strengthened to the thesis that the positions in\nmathematical structures, as well as the abstract structures\nthemselves, “only have structural properties”. But if not\nformulated more carefully, this leads to counterexamples (cf. Reck\n2003). For instance, does the natural number structure not have the\nproperty that it is a favorite example in many debates about\nstructuralism?  And isn’t it a property of the number 9 to have\nlong been taken to be the number of planets in the Solar System? Both\nseem clearly non-structural properties.  Once again, structuralism\nappears incoherent or, at the very least, in need of further\nclarification.\n\nA natural response to this challenge is to refine the original\nstructuralist thesis, e.g., by saying that abstract structures only\nhave structural properties “essentially”, that only such\nproperties are “constitutive” for them, or something\nsimilar, while admitting that they have other properties too (see Reck\n2003, Schiemer & Wigglesworth forthcoming). This leads to\nquestions about how exactly to make this distinction. But even if it\nis taken to constitute a satisfactory response, another problem\nremains: How can we distinguish “structural” from\n“non-structural” properties in the first place? Several\nanswers to that question have been proposed in turn, e.g., that\nstructural properties are those definable in a certain way, or that\nthey are those preserved under relevant morphisms.  Yet no consensus\non that issue has been reached either (see Korbmacher & Schiemer\n2018, also for further references).\n\nA third challenge directed again especially, or even exclusively, at\nnon-eliminative structuralism concerns the following. From a\nstructuralist point of view, positions are always “positions in\na structure”; i.e., the structure is primary and the positions\nare secondary. Hence, a particular mathematical object, such as the\nnatural number 2, seems “ontologically dependent” on the\nbackground structure, here the structure of the natural numbers. (The\nfact that for a structuralist it is misguided to consider the number 2\nas existing in itself reflects this aspect. It also illustrates a main\ndifference between structuralism and logicism or set-theoretic\nfoundationalism.) But how should this ontological dependence be\nunderstood? Are there perhaps connections to “grounding”\nor related notions in current analytic metaphysics? In this context\ntoo, many open questions remain and a lively debate has started\n(cf. Linnebo 2008, also, e.g., MacBride 2005 and Wigglesworth\n2018). \n\nA fourth basic challenge for structuralism, mostly again in its\nnon-eliminative form, is how we can have “access” to\nstructures seen as abstract objects (cf. Hale 1996, among others). To\nsome degree, this revives an older, more general debate about such\nobjects. An initial response, by Resnik, Shapiro, and Parsons (all\nfollowing Quine here), is to talk about the “positing” of\nstructures, which promises to undercut the access problem.  But under\nwhat conditions is such positing legitimate (given the threat of\nparadox familiar from naïve set theory)? A plausible answer\npoints to the “coherence” of the relevant theories (which,\nafter Gödel’s incompleteness results, is seen as taking the\nplace of provable consistency). Yet what exactly does such coherence\namount to? An interesting outcome of the debate about this issue is\nthat Shapiro and Hellman, coming from very different directions, have\narrived at views that are very close to each other (see Hellman\n2005). Thus, in terms of some basic commitments—ultimate\nconditions for existence in Shapiro’s case and for possibility\nin Hellman’s case—their approaches converge in surprising\nways. (This may be seen as providing support for both sides, but also\nas undermining the realism/nominalism dichotomy.)\n\nThere are more challenges to structuralism in mathematics that one can\nfind in the literature of the last 20 years. While usually connected\nto the problems just surveyed, sometimes these challenges go\nfurther. For example, additional questions about the semantics\ninvolved in structuralism have been raised, typically again for the\nnon-eliminative variant (cf. Button & Walsh 2016, Assadian 2018,\netc.). Instead of summarizing these challenges too, we hope our survey\nso far provides enough illustration of the kinds of debates that have\noccurred in the recent literature already.\n2.2 Several Additional Variants of Structuralism\n\nAs mentioned earlier, in many discussions of structuralism, from the\n1980s to the early 2000s and beyond, a few positions have taken center\nstage: Shapiro’s, Hellman’s, sometimes Parsons’, and\noccasionally Resnik’s. But other forms of structuralism have\nbeen around for decades too. These deserve, and are starting to get,\nmore attention as well. Without any claim to comprehensiveness, we\nwant to mention several noteworthy examples. A major one, whose\norigins can be traced back to before the 1960s, is\n“set-theoretic structuralism” (cf. Reck & Price 2000,\nalso Reck & Schiemer forthcoming). To introduce it, let us\nreconsider the example central to Benacerraf’s 1965 paper: the\nnatural numbers. \n\nAs Benacerraf argued, there is something wrong with identifying\n“the natural numbers” with a particular set-theoretic\nsystem; or at least, it seems wrong to do so in any absolute sense.\nBenacerraf’s conclusion was that numbers are not sets, nor\nobjects of any kind, but positions in a structure. Now, one can agree\nwith almost everything Benacerraf says and still want to identify\n“the natural numbers” with some set-theoretic system in a\nless absolute sense.  In doing so, one can admit that any other model\nof the Dedekind-Peano axioms “would do as well”, i.e.,\ncould have been chosen instead (except perhaps for pragmatic reasons,\ne.g., the ability to generalize to the transfinite). This means that\nwhat we identify as the natural numbers depends on an initial,\nprovisional, and somewhat arbitrary choice. For most mathematical\npurposes, such a pragmatic identification is sufficient; in fact, this\nis exactly what one does in standard axiomatic set theory. The\nresulting position deserves again to be counted as a form of\nstructuralism, as its defenders insist. What makes it structuralist is\nthe “indifference to identify” the natural numbers in any\nmore absolute sense (cf. Burgess 2015). \n\nThe core of set-theoretic structuralism, as just described, is to\nchoose one of several isomorphic systems as the pragmatic referent for\n“the natural numbers” (similarly for the real numbers\netc.). In a sense, our talk of “the natural numbers”, then\nalso of “the number 0”, “the number 1”, etc.,\nis relative to this initial choice. This is seen as unproblematic\nbecause, no matter how we choose, we will get the same arithmetic\ntheorems (because of the categoricity of the axiom system, which\nimplies its semantic completeness). As background, we can again employ\nZermelo-Fraenkel set theory. But we can also broaden the approach\nslightly by allowing for “atoms” or\n“urelements”, i.e., objects that are not sets. Thus, we\ncan include Julius Caesar or some beer mug in our domain, with the\nconsequence that either of them can “be” the number 2,\nsay, in the sense of taking up the “2-position” in the\nmodel for arithmetic we choose to work with. Because of this feature,\nwe will use “relativist structuralism” for this approach\n(cf. Reck & Price 2000). It also seems fair to say that this\nposition, particularly in its set-theoretic version, is accepted by\nmany mathematicians, explicitly or implicitly.  In fact, it may be the\nmost widely favored form of structuralism.\n\nIn set-theoretic structuralism, and in relativist structuralism more\nbroadly, the only mathematical objects at play are those that\naxiomatic set theory, possibly with urelements, allows us to\nintroduce. We do not need to postulate abstract structures in\naddition. For that reason, the position is another form of eliminative\nstructuralism (while it is not fully eliminative insofar as it\ncountenances sets).  In fact, set-theoretic relational systems (the\nset-theoretic models of theories) are themselves taken to be the\nrelevant structures here. (It is exactly such relational systems that\nare called “structures” in many mathematics textbooks.)\nHowever, there is another option in connection with the\nlatter. Namely, we can also identify the structure of the natural\nnumbers, say, with the (higher-order) concept defined by the\nDedekind-Peano axioms; similarly for other (categorical) axiom\nsystems. This leads to yet another eliminative form of structuralism:\n“concept structuralism” (cf. Isaacson 2010, Feferman 2014,\nalso Ketland 2015, Other Internet Resources).\n\nAccording to concept structuralism, what matters in modern axiomatic\nmathematics aren’t really objects, especially not problematic\nabstract objects.  Rather, crucial are mathematical concepts, e.g.,\nthe concept “natural number system” (or “model of\nthe Dedekind-Peano axioms”, “progression”);\nsimilarly for the concept “complete ordered field”\netc. (In Ketland 2015, Other Internet Resources, such concepts are\nexplicated further in terms of intensional propositional functions,\nwhile Isaacson and Feferman leave their nature more open.) More\nprecisely, what matters in the end is what follows from those\nconcepts, in the sense of what can be derived from the corresponding\naxioms. It is true, as concept structuralists might admit, that often\nthe way in which we reason in mathematics involves talking about\nobjects falling under the relevant concepts. But as they would add,\nsuch talk can be explained away in the end (e.g., by taking up a\nformalist position). In this or similar forms, concept structuralism\nseems again a fairly widespread view among mathematicians and\nlogicians, even though it has not been very prominent in the\nstructuralism debates until recently.\n\nFor the sake of a more comprehensive survey, we want to go even\nfurther.  As the next step, we will introduce two forms of\nstructuralism that are closely related to relativist structuralism and\nconcept structuralism but not identical with either. (Both are forms\nof “abstractionist structuralism”, as we will see.)  Let\nus start again with a higher-order concept defined by an axiom system,\nsuch as “natural number system”, together with the\nset-theoretic systems falling under it. However, instead of\nidentifying the corresponding structure either with that concept or\nwith some pragmatically chosen system falling under it, we focus on\nthe whole equivalence class determined by the concept.\n\nAt this point, we can go down one of two “abstractionist”\npaths. First, we can simply identify the relevant structure with that\nequivalence class (with the “concept in extension”, as it\nis sometimes put). Thus, corresponding to the concept “natural\nnumber system” and set-theoretic systems falling under it, like\nthe finite von Neumann ordinals, there is the entire equivalence class\nof corresponding models as a third entity. (Our primary focus is again\non categorical axiom systems, but the approach can be generalized.) It\nis this class that is now called “the natural number\nstructure”. It is not a set, to be sure, but a proper class; but\nit can still be studied logico-mathematically.  Looked at from a\n“relativist” perspective, the new approach can also be\ndescribed as follows: Its core is to go from a particular, arbitrarily\nchosen system falling under a higher-order concept to the related\nequivalence class, i.e., the class of all systems isomorphic to it (in\nthe categorical case).  And we can think of this move as involving a\nkind of “abstraction”, specifically in the sense of the\n“principle of abstraction” in Russell (1903; also adopted\nby Rudolf Carnap and others). The result is a first form of\n“abstractionist structuralism”.\n\nThere is a second path we can take, resulting in a second form of\nabstractionist structuralism.  It too has played a role in the recent\nstructuralism debates; but, like the first, it can also be traced back\nfurther in time. Let us start again from a relevant higher-order\nconcept, or from the axiom system that defines it, together with an\narbitrarily chosen relational system falling under it (a set-theoretic\nsystem, say, possibly with urelements). The new suggestion is to\nproceed as follows: We “abstract away from the particular nature\nof its elements” so as to arrive at a novel, distinguished\nrelational system that deserves to be called “the natural\nnumbers” (cf. Dedekind 1888, especially as interpreted in Reck\n2003). The intention is that the objects introduced by such\nabstraction only have structural properties, or better, only have\nthese essentially. Also, together these objects form a system\nisomorphic to the one from which we started (unlike the equivalence\nclass we just considered). Finally, it is the latter we now consider\nthe relevant abstract structure.\n\n\nIn several respects, this second abstractionist alternative is close\nto Shapiro’s\nante rem structuralism (who occasionally appeals to\n“abstraction” himself, \ne.g., in Shapiro 1997); it is also close to Parsons’ \nform of non-eliminative structuralism. Yet it neither involves a separate \nstructure theory à \nla Shapiro nor an appeal to Parsons’\nmeta-linguistic procedure. Instead, abstract structures are introduced \n“by abstraction” from\nmore concrete systems, e.g., from set-theoretic relational systems.\nThe relevant abstraction can be explicated further in\nterms of an “abstraction \noperator” and a corresponding\n“abstraction principle”. \nAnother comparison that suggests itself then is with the use of \nabstraction principles in contemporary neo-logicism. In fact, that \nconnection has already been explored in Linnebo & \nPettigrew (2014) and Reck (2018a). What we arrive at along such lines is an\nabstractionist form of non-eliminative structuralism. In contrast, the first \nalternative mentioned above is an abstractionist form of eliminative\nstructuralism. (Given their historical roots, these positions\nmight be labeled “Russellian abstractionist \nstructuralism”\nand “Dedekindian abstractionist \nstructuralism”,\nrespectively; cf. Reck 2018a.)\n\nThe list of additional variants of structuralism does not end here\neither. Let us mention five further examples very briefly, without\ngoing into any details (and there may undoubtedly be more).  First,\nUri Nodelman and Edward Zalta have introduced a form of\nnon-eliminative structuralism, parallel to Shapiro’s, which uses\nan “object theory” inspired by Meinong to account for the\nabstract structures (Nodelman & Zalta 2014). Parallel to that, one\ncan use other fundamental theories for the introduction of abstract\nstructures, leading to further forms of non-eliminative\nstructuralism. As a second example, Hannes Leitgeb has described how\nto adapt graph theory for this purpose (Leitgeb forthcoming). Third,\nLeon Horsten has built on Kit Fine’s theory of “arbitrary\nobjects” to construct a parallel form of “generic\nstructuralism” (Horsten forthcoming).  Fourth, above we already\nmentioned Charles Chihara’s “eliminative” form of\nstructuralism, which is not identical with Hellman’s (see\nChihara 2004).  And fifth, there is a whole family of\n“categorical forms of structuralism”, based on a variety\nof axiom systems from category theory, that has become prominent\nrecently. \n\nWe will postpone our discussion of categorical structuralism to\nsection 3,\nboth because it is important mathematically, thus deserving treatment\nin a separate section, and because it is harder to compare to the other\nforms of structuralism. Before that, we want to offer a richer, more \ncomprehensive taxonomy for structuralist positions.\nThis taxonomy will be wide enough to encompass all the positions\nmentioned so far. But it will also point beyond them, starting with\nthe introduction of a basic dichotomy between\n“metaphysical” and \n“methodological” \nstructuralism.\n2.3 A Broader Taxonomy of Structuralist Positions\n\nAll the variants of structuralism described up to this point are forms\nof “philosophical structuralism”, or more precisely, of\n“metaphysical structuralism”.  What that means is that\nthese positions are intended to provide answers to questions about\nwhat mathematical structures are (even when this involves an\neliminative stance), including views about their existence,\nabstractness, identity, dependence, etc.  Now, one can distinguish\nthis whole variety of philosophical positions from what is sometimes\ncalled “mathematical structuralism”, or again more\nprecisely, “methodological structuralism” (cf. Reck &\nPrice 2000, earlier Awodey 1996).  In fact, we suggest that\nrecognizing this basic dichotomy—“metaphysical versus\nmethodological”—to is crucial with respect to both\nsystematic and historical discussions of structuralism.  (Among\nothers, it allows us to connect more naturally with categorical\nstructuralism; see, e.g., Corry 2004 and Marquis 2009.) \n\nAs its name suggests, methodological structuralism concerns the\nmethodology of mathematics, thus mathematical practice.  Or as one\nmight also put it, it concerns a certain “style” of doing\nmathematics. That style consists in studying whole systems or\nstructures of objects in terms of their global, relational, or\nstructural properties, while neglecting the intrinsic nature of the\nobjects involved. This can be done in two main ways, often intertwined\nin practice: by proceeding axiomatically, i.e., by deriving theorems\nfrom basic axioms for the systems at issue; and by considering\nmorphisms between them (homomorphisms, isomorphisms, etc.), together\nwith invariants under those morphisms. As such an approach typically\ninvolves infinite sets, non-decidable properties, and classical logic,\nit tends to be opposed to more “computational” and\n“constructivist” ways of doing mathematics (cf. Reck &\nSchiemer forthcoming for extensive historical background).\n\nSuch a structuralist methodology, or corresponding forms of\nmethodological structuralism, tends to be tied to a general assumption\nabout the subject matter of mathematics, namely: mathematics is the\nstudy structures.  But accepting that assumption does not, in itself,\ninvolve any further views about the nature of those structures, at\nleast not in any detailed and philosophically loaded way. In contrast,\nall the forms of metaphysical structuralism considered earlier are\nmeant to provide such views.  This is exactly how they go beyond\nmethodological structuralism (often by building on it).\n\n\nWith respect to such metaphysical positions, Parsons’\n“eliminative versus non-eliminative” distinction remains\nhelpful (although a more positive label for the latter kind of views,\nalong the lines of “structuralism with structures”, might\nbe better). However, the differences among metaphysical forms of\nstructuralisms do not stop there. In fact, only working with\nParsons’ distinction obscures some important differences. As\nalready mentioned, Shapiro’s ante rem structuralism is\nfar from the only version of non-eliminative structuralism; nor is\nHellman’s the only form of eliminative structuralism.  We now\nwant to suggest some more fine-grained distinctions so as to introduce\nmore order and clarity into the debates.\n\nLet us first look again at non-eliminative versions of\nstructuralism. Some positions falling under that label introduce\nabstract structures by means of a basic theory. This includes\nShapiro’s structure theory, but also, e.g., Nodelman &\nZalta’s object theory and Leitgeb’s adaptation of graph\ntheory. All of them are forms of ante rem structuralism, but\nsignificantly different ones. In addition, there are forms of\nnon-eliminative structuralism that are based on abstraction principles\ninstead, which we called “abstractionist forms of\nstructuralism” above. We distinguished two variants of those,\nthe Russellian and the Dedekindian variant, which involve different\nkinds of structures as the outcome of the abstraction process.  (If we\nreconstruct such abstraction as mathematical operations or functions,\ntheir arguments are the same but their values are different.)  And as\nthis shows, there are abstractionist and non-abstractionist versions\nof non-eliminative structuralism.\n\nIf we reflect on these alternatives more, the role of a further basic\ndichotomy becomes apparent (within the category of non-eliminative\nstructuralism): that between\nante rem positions and either in\nre or post rem positions.\nShapiro’s position is explicitly a form of \nante rem structuralism. In contrast, Russellian\nabstractionist structuralism can be seen as a form of\npost rem structuralism, because the equivalence\nclasses used as the relevant structures are “built\nout of” their elements as classes, to which they \nare thus posterior. In Dedekindian abstractionist\nstructuralism, there is a form of posteriority\ninvolved as well. Here too, we start with more concrete relational\nsystems, usually systems of sets or urelements, and we introduce\nabstract structures on that basis. But the\nprior versus posterior relation is different now. (It is not\nbased on the element-class relation, but on a more basic\nargument-function-value relation.) We also end up with abstract\nstructures that are neither standard sets nor classes.\n\nOn the side of eliminative structuralism, further sub-divisions should\nbe made as well. Again, there are fully eliminative positions, which\navoid commitment to any kind of abstract objects.  Hellman’s\nmodal structuralism is designed to be of this sort. But there are also\nsemi-eliminative positions, which avoid commitment to abstract\nstructures in addition to more usual, relatively concrete mathematical\nobjects, which are accepted.  Set-theoretic structuralism is a good\nillustration; universalist structuralism is another, at least when\nbacked by set theory.  Should relativist structuralism in general, and\nset-theoretic structuralism in particular, be seen as cases of\nin re structuralism, in the sense that\nabstract structure exist “in” \ntheir more concrete instantiations? Perhaps; but this thesis does\nnot seem to be forced on us (cf. Leitgeb forthcoming for more on this\nissue). Note also that we would end up with a form of\nnon-eliminative structuralism then instead. The same\nquestion arises for in re forms of structuralism \nmore generally; the details will matter. (For more on such \napproaches—sometimes labeled \n“Aristotelian” as opposed to \n“Platonist”—see Pettigrew 2008 and\nFranklin 2014.) \n\nYet another version of eliminative structuralism that has started to\nattract more attention in the literature is concept structuralism.  In\ncases where this position is meant to do without any appeal to\nabstract objects (e.g., by basing itself on formalism), it amounts to\na fully eliminative view. Various questions remain, however, about the\nappeal to concepts in it, i.e., about their existence, nature, and\nidentity (cf. Parsons 2018).  Depending on the answers, a strict\nnominalist might still find this position unacceptable, since concepts\nmay be seen as another problematic kind of abstract entities.  If a\nconcept structuralist allows for abstract objects, such as sets, to\nplay a secondary role, this becomes a semi-eliminative\nposition. Structures conceived of as abstract objects are still\neliminated (by reconceiving them as concepts), but relational systems\nremain.  Alternatively, we might be dealing with a particular form of\nmethodological structuralism here, where additional metaphysical\nquestions are brushed aside.\n3. Category-Theoretic Structuralism\n3.1 Category Theory as the Study of Mathematical Structures\n\nOver the past two decades, different proposals have been made to\nformulate a theory of mathematical structuralism based on category\ntheory, thus a theory, or theories, of “categorical\nstructuralism”.  We are now in a better position to consider\nthese proposals, although we will still proceed indirectly, starting\nwith more background. Category theory was first introduced as a branch\nof abstract algebra in Eilenberg & Mac Lane’s famous\narticle, “General Theory of Natural Equivalences”\n(1945). It subsequently developed into an autonomous mathematical\ndiscipline, in work by Mac Lane, Grothendieck, Kan, Lawvere, and many\nothers, with important, wide-ranging applications in algebraic\ntopology and homological algebra and, more recently, in computer\nscience and logic (cf. Landry & Marquis 2005, also the\n entry on category theory\nin this encyclopedia).\n\nBuilding on these developments, the philosophical discussion of\ncategorical structuralism was initiated by Awodey, Landry, Marquis,\nand McLarty in the 1990s.  To understand their contributions better,\nit helps to go back to our distinction between\n“metaphysical” and “methodological\nstructuralism”, which is drawn explicitly in Awodey (1996).  Or\nrather, Awodey distinguishes between the use of category theory as a\nframework for “mathematical” and for “philosophical\nstructuralism”. He describes mathematical structuralism as a\ngeneral way of “pursuing a structural approach to the\nsubject“, i.e., a particular style of practicing mathematics\nthat employs structural concepts and methods.  He then argues that\ncategory theory provides the best way of capturing structural\nmathematics in this sense. However, he also presents it as a framework\nfor philosophical structuralism, i.e., “an approach to the\nontology and epistemology of mathematics”.  Let us first\nconsider the former argument. (We will return to the latter in\n section 3.3).\n\nCategory theory, understood as a branch of pure mathematics, has\nfrequently been described as a “general theory of mathematical\nstructures”, e.g., by Mac Lane (1986, 1996). But what exactly is\nmeant by “structure” here?  At least two relevant notions\nare mentioned in the literature. First, a structure can be understood\nin the set- and model-theoretic sense, i.e., as a tuple consisting of\na domain and an ordered sequence of relations, functions, and\ndistinguished elements used for the interpretation of a formal\nlanguage. (This is the notion of “relational system” we\nappealed to above more informally.)  Such structures are often called\n“Bourbaki structures” in this context. Their properties\nare usually defined axiomatically, e.g., by the group axioms or the\nDedekind-Peano axioms for arithmetic.\n\nSecond and alternatively, there is a categorical notion of structure\nbased on the primitive concept of morphisms between mathematical\nobjects. Typically, a category consists of two types of entities,\nnamely objects and morphisms between them, i.e., mappings represented\nby arrows that preserve some of the internal structural composition of\nthe objects. An axiom system that defines the general concept of a\ncategory, along such lines, was first introduced by Eilenberg and Mac\nLane (1945). It describes a suitable composition operation on arrows,\nits associativity, as well as the existence of an identity morphism\nfor each object (cf. Awodey 2010 for a textbook presentation of\ncategory theory).\n\nWhy might category theory be considered a more adequate framework for\na mathematical structuralism than other disciplines, in particular\ntraditional (Cantorian, Zermelo-Fraenkel) set theory? It is helpful to\nconsult Awodey (1996) on this issue. According to him, the Bourbaki\nnotion of structure is a direct result of the modern axiomatic\ntradition of Dedekind, Hilbert, and the Bourbaki group. This tradition\neventually led to a structuralist perspective on mathematics. Yet set\ntheory is not an ideal framework for capturing a structuralist\nunderstanding of mathematical objects. To begin with, set theory is\nclosely tied to a model-theoretic conception of mathematical theories,\nincluding the view that such theories study their models only\n“up to isomorphism”. But central to a structuralist point\nof view is the principle (more on which below) to “identify\nisomorphic objects”; and this principle is well motivated from a\ncategory-theoretic viewpoint, but less so if mathematical objects are\nrepresented set-theoretically. \n\nA second advantage of category theory over set theory, also mentioned\nin Awodey (1996), is that the categorical notion of structure is\n“syntax invariant”.  That is to say, unlike in standard\nmodel theory the categorical specification of objects in terms of\ntheir mapping properties is independent of the choice of a particular\nsignature used for their description (a choice of basic relations,\nfunctions, and distinguished elements). Third and most importantly,\ncharacteristic for category theory is its focus on morphisms and\ntransformations between mathematical objects that preserve (some of)\ntheir internal structure. It is the emphasis on structure-preserving\nmappings in the specification of objects that is often viewed as a\ncentral feature of the structuralist turn in modern mathematics. As\nsuch, it was present in various parts of nineteenth- and early\ntwentieth-century mathematics, including Galois theory, Klein’s\nErlangen program, Dedekind’s foundational writings, as well as\nin work on abstract algebra by the Noether school (cf. again Reck\n& Schiemer forthcoming).\n\nCategory theory was first developed, against the background of these\ndevelopments, as a unifying framework for the study of the relations\nbetween different mathematical structures (cf.  Landry & Marquis\n2005, Marquis 2009). Different types of mappings were introduced for\nthis task. One type involves the morphisms between the objects of the\nsame category, e.g., group homomorphisms in the category of groups, or\nlinear maps in the category of vector spaces. Another important type\nof mappings are “functors” between different\ncategories. (Roughly, a functor between two categories is a mapping of\nobjects to objects and arrows to arrows that preserves the categorical\nproperties in question.) It is such functors that are the central\ntools in category-theory for comparing the objects of different\nmathematical categories, and thus, to “relate structures of\ndifferent kinds” (Awodey 1996).  As such, they are central to\ncategorical structuralism.\n3.2 Categorical Foundations and Debates About Them\n\nAs has been argued repeatedly in the literature along the lines just\nsummarized, category theory provides a more natural framework than\ntraditional set theory for mathematical or methodological\nstructuralism in mathematics. But what about its prospects as a form\nof philosophical structuralism, i.e., an alternative to the theories\nof Resnik, Shapiro, Hellman, etc.?  We already mentioned that Awodey\n(1996) also presents it as such; but this has led to ongoing\ncontroversies.  Hellmann (2003) contains a first critical discussion\nof philosophical claims such as Awodey’s. That is to say,\nHellman’s article raises several objections against the view\nthat category theory provides an adequate framework for a\nstructuralist account of mathematics in the philosophical sense. As we\nwill see, these objections are closely related to the status of\ncategory theory as a foundational discipline.\n\nRecently there has been much debate on which criteria a theory has to\nmeet in order to serve as a proper “foundation” for\nmathematics. According to a helpful proposal in Tsementzis (2017), a\nfoundational system has to consist of three items, namely: \n\n a formal language; \n an axiomatic theory expressed in that language; and \n a rich universe of objects, described by the theory, in which all\nmathematical structures can be located, represented, or encoded. \n\n\nZermelo-Fraenkel set theory clearly represents a foundational system\nin this sense.  The axioms of ZFC are usually formulated in a formal\nfirst-order language; and they describe a comprehensive universe, the\ncumulative hierarchy of sets, in which mathematical objects such as\nnumber systems, groups, rings, topological spaces, etc. can be\nrepresented.\n\nIn research on category theory from the 1960s onward, several\naxiomatizations of specific categories have been proposed as\nalternative foundations for mathematics.  This includes the axiom\nsystems describing the category of sets and functions, on the one\nhand, and the category of categories, on the other hand, as first\npresented in Lawvere (1964, 1966). Both were explicitly introduced as\nfoundational systems, and thus, as alternatives to Zermelo-Fraenkel\nset theory. More recently, elementary topos theory has been developed\nas a form of categorical set theory that can serve as a foundational\nsystem in the above sense (cf.  Landry & Marquis 2005, Marquis\n2013).\n\nThis puts us in a position to return to Hellman’s 2003\nchallenge. The question of whether category theory can be used to\nformulate a version of philosophical structuralism is, in his view,\ndirectly related to the presumed autonomy of these new approaches from\ntraditional set theory. Building on Feferman (1977), he formulates two\ngeneral objections. Following Linnebo & Pettigrew (2011), we can\ncall the first the “logical dependence” objection. Its\ncore is the argument that category theory, general topos theory,\netc. are not autonomous of set theory in the end. The reason is that\nthe axiomatic specification of categories and topoi presupposes the\nprimitive concepts of operation, collection, and function, and the\nlatter need to be defined in a set theory such as ZFC. Categorical\nfoundations are therefore dependent on non-structural set theory.\n\nThe second argument against the autonomy of categorical foundations\nhas been called the “mismatch objection”.  It concerns the\ngeneral status of category theory or topos theory; and it is based on\nthe distinction between two ways of understanding mathematical axioms,\nnamely as “structural”, “algebraic”,\n“schematic” or “Hilbertian”, on the one hand,\nand as “assertoric” or “Fregean”, on the other\nhand. As Hellman argues, foundational systems such as classical set\ntheory need to be assertoric in character, in the sense that their\naxioms describe a comprehensive universe of objects used for the\ncodification of other mathematical structures. Zermelo-Fraenkel set\ntheory is an assertoric, “contentual” theory in this\nsense. Its axioms (e.g., the power set axiom or the axiom of choice)\nmake general existence claims regarding the objects in the universe of\nsets.\n\nIn contrast, category theory represents a branch of abstract algebra,\nas its origin reveals. Thus it is, by its very nature, non-assertoric\nin character; it lacks existence axioms conceived as truths about an\nintended universe. For example, the Eilenberg-Mac Lane axioms of\ncategory theory are not “basic truths simpliciter”, but\n“schematic” or “structural” in character.\nThey function as implicit definitions of algebraic structures, similar\nto the way in which the axioms of group theory or ring theory are\n“defining conditions on types of structures”. This point\nis related to another argument against the autonomy of category theory\nthat Hellmann calls the “problem of the ‘home\naddress’: where do categories come from and where do they\nlive?” (2003: 136).  Given the “algebraic-structuralist\nperspective” underlying category theory and general topos\ntheory, its axioms make no assertions that particular categories or\ntopoi actually exist. Classical set theories, such as ZFC with its\nstrong existence axioms, have to step in again in order to secure the\nexistence of such objects.\n\nHellman’s and Feferman’s arguments against the\nfoundational character of category theory have been examined from\nvarious angles in the subsequent literature. One can distinguish\nbetween two main types of responses, namely:\n\n by proponents of “categorical \nfoundations”, who aim\nto defend the autonomous character of category theory relative to\nclassical set theory; and\n by “non-foundationalists”, \nwho call into question that category theory should be viewed as a foundational \ndiscipline.\n\n\nA series of articles by McLarty represent the first line of response\nwell (e.g., McLarty 2004, 2011, 2012). Roughly speaking, his reply to\nHellman is the following: Whereas category theory and general topos\ntheory did originate as algebraic theories and are, thus, not feasible\nas foundational systems, certain theories of particular categories and\ntoposes have been introduced as alternative\nfoundations. McLarty’s central examples are Lawvere’s\naxiomatizations of the category of categories and his\n“Elementary Theory of the Category of Sets” (ETCS).\n\nAccording to McLarty, these theories should be understood as\nassertoric in Hellman’s sense. That is to say, their axioms are\nnot merely implicit definitions, but general existential claims about\ncategories, sets, and functions. ETCS, for instance, presents a\nfunction-based set theory, where sets and mappings between them form a\ntopos. In contrast to ZFC, with its primitive membership relation, in\nETCS a set is not specified in terms of its internal composition, but\nrather in terms of its mapping properties with respect to other sets,\nwhich are formulated independently of ZFC. McLarty’s response to\nthe two objections mentioned above is then that categorical set\ntheories such as ETCS do provide a foundation for mathematics that is\nlogically autonomous from traditional, non-structural set\ntheories. Moreover, given that mathematical structures can only be\nencoded in ETCS as objects up to isomorphism, such categorical set\ntheories provide a more adequate foundation for modern structural\nmathematics than ZFC.  (We will return to this point below.)\n\nThe second, quite different line of response to Hellman’s\nobjections is represented in Awodey (2004; cf. Landry 1999). In that\narticle, Awodey outlines a category-theoretic form of structuralism\nthat is decidedly anti-foundationalist.  He holds, in agreement with\nHellman and McLarty, that both the Eilenberg-Mac Lane axioms for\ncategory theory and the axioms of general topos theory are schematic.\nBut he then argues that category theory in general does not, and\nshould not be taken to, provide a foundation for mathematics, either\nin a logical or ontological sense. Rather, it presents a general and\nunifying framework or language for structural mathematics.  He thus\nrejects Hellman’s assumption that the success of categorical\nstructuralism is in any form dependent on whether category theory is\nusable as a foundational enterprise or not.\n\nIn fact, according to Awodey the central motivation for a\ncategory-theoretic approach to mathematics is to sidestep foundational\nissues concerning the nature of mathematical objects or the study of a\nsingle comprehensive universe in which all structures can be\nrepresented. While topos theory, say, might well serve as a structural\nfoundation for mathematics, for Awodey such a foundational approach\nruns against the structuralist perspective embodied in\ncategory-theory. In his own words, “the idea of ‘doing\nmathematics categorically’ involves a different point of view\nfrom the customary foundational one” (Awodey 2004: 55). In light\nof such fundamental, ongoing debates about categorical foundations for\nmathematics, what are the implications for categorical structuralism\nin the philosophical sense, along Awodey’s lines and more\ngenerally?  This is what we turn to next.\n3.3 Distinctive Features of Categorical Structuralism\n\nBeyond the issue of methodological structuralism, the literature on\ncategorical structuralism during the last 20 years centers around two\nquestions that have already been mentioned. First, in what sense does\ncategory theory provide a framework for philosophical structuralism?\nSecond, why is it better suited for that task than other frameworks,\nsuch as set theory, Shapiro’s structure theory, and\nHellman’s modal logic, as has been claimed?  In recent work on\nthese topics, one can find three related philosophical assumptions\nthat characterize categorical structuralism and distinguish it from\nthe versions of structuralism surveyed earlier. We will treat each of\nthem in turn, starting again with Awodey’s writings.\n\nA first characteristic assumption is that all mathematical theorems\nare schematic statements that have a conditional form. This point is\nexplicit in Awodey (2004). We already saw that according to Awodey a\ncategory-theoretic approach is non-foundational in character. This\nincludes that mathematical axioms and theorems, as expressed in\ncategory theory, should be understood as schematic statements. They do\nnot express truths about the specific nature of mathematical objects,\nbut rather, about their respective properties and relations. In\naddition, mathematical theorems are, at least in principle, all of\nhypothetical form. They can be reconstructed as if-then\nstatements. Note that this view of the logical form of mathematical\ntheorems is prima facie similar to the if-then-ism one can\nfind in Putnam’s works, and earlier in Russell’s, as\nmentioned in section 1.\n \n\nHowever, there is also an important difference between standard\nif-then-ism and a category-theoretic approach in terms of the\nontological commitments involved, as Awodey points out. According to\nstandard if-then-ism, any mathematical statement can be translated\ninto a universally quantified conditional statement, where the\nquantifiers are effectively meta-theoretic in nature, ranging over all\nset-theoretic systems of the right type. As such, the approach\npresupposes a rich ontology of sets in which such systems can be\nconstructed. In contrast, along category-theoretic lines mathematical\ntheorems do not involve such ontological commitments. There is no\nimplicit generalization over the Bourbaki structures of a theory,\ne.g., over all groups, rings, or number systems. Rather, a\nmathematical theorem is “a schematic statement about\na structure […] which can have\nvarious instances” (Awodey 2004: 57).  These instances\nremain undetermined on purpose, unless a further specification of them\nis needed for the proof of the theorem in question.\n\nA second distinctive feature of categorical structuralism, not only\nfor Awodey, concerns a certain “top-down” conception of\nmathematical objects characteristic for category theory. According to\nstandard set theory, mathematical objects are constructed from the\n“bottom up”, in successive steps starting from some ground\nlevel (the empty set or also a domain of urelements). Every object is\nthus determined, as a set, in terms of its members. In contrast,\nmathematical objects in category theory are characterized in a\ntop-down fashion, starting with the Eilenberg-Mac Lane axioms and\nusing the notion of morphism. Hence, the objects in a given category,\nsuch as that of rings or topological spaces, are not considered\nindependently of the relevant morphisms. They are fully determined by\ntheir mapping properties, as expressible in the language of category\ntheory. Nothing further is assumed about their inner constitution. In\nparticular, questions about their set-theoretic nature are considered\nredundant (see also Landry & Marquis 2005.)\n\nThird, arguably the most important feature of categorical\nstructuralism is that it verifies a version of the\n“structuralist thesis” (hinted at earlier). Recall here\nBenacerraf’s argument in his 1965 paper that numbers should not\nbe identified with particular sets, but rather, with positions in an\nabstract structure. Benacerraf also emphasizes that only certain\nproperties are relevant in arithmetic.  For him, these are the\nnumber-theoretic properties, such as “being prime” or\n“being even”, that can be defined in terms of the\nprimitive relations and functions of the theory at issue.  The general\nstructuralist thesis holds, then, that all (relevant) properties of\nthe objects treated by a mathematical theory should be structural in a\nspecified sense. (The question what “structural” means\nalso came up earlier.)\n\nCategorical structuralists typically argue that category theory\npresents the most adequate framework for a structuralist understanding\nof mathematical objects given that all the properties expressible in\nits language turn out to be structural (see, e.g., McLarty 1993,\nAwodey 2004, and Marquis 2013). This is so because the\ncategory-theoretic study of mathematical objects, such as rings or\ntopological spaces, allows us to express just the right kind of\n“structural information”, namely information about the\nstructural properties of these objects. In this context, structural\nproperties are usually characterized in terms of the notion of\nisomorphism invariance. Given a category C, a morphism \\(f: A\n\\rightarrow B\\) presents an isomorphism between objects\nA and B if and only if there is a morphism \\(g: B\n\\rightarrow A\\) such that \\(g \\circ f = 1_A\\) and \\(f \\circ g =1_B\\).\nA property P of an object A in category C is then\nstructural if it remains invariant under the isomorphisms in C,\nthat is, if \\(P(A) \\leftrightarrow P(f(A))\\), for all isomorphisms\nf (cf. Awodey 1996).\n\nWe saw above that the representation of mathematical objects in\ntraditional set theory (proceeding “bottom up”) brings\nwith it the possibility to express all sorts of properties about their\nset-theoretical constitution that are not isomorphism invariant in\nthis sense. The central advantage of category theory over classical\nset theory (and similar approaches) is, according to this argument,\nthat such non-structural properties are simply ruled out in the\ncategorical framework. This point was first stressed in\nMcLarty’s “Numbers Can Be Just What They Have To”\n(1993), which, as the title suggests, presents a rejoinder to\nBenacerraf (1965). McLarty’s central thesis in this article is\nthat Benacerraf’s structuralist program is most successfully\nrealized if one considers numbers to be represented in categorical set\ntheory (such as in ETCS or a subsystem thereof), and not in orthodox\nset theory. \n\nTo elaborate this advantage further, number systems of basic\narithmetic can be characterized in such categorical frameworks as\n“natural number objects”, as was first shown by\nLawvere. In contrast to their ZFC-based representation, such objects\nare not just isomorphic but share “exactly the same\nproperties”, namely those expressible in the language of the\ncategory of sets. In other words, any two natural number objects are\n“provably indiscernible”, in the sense that they\n“provably have the same properties” (McLarty\n1993). Moreover, all of these properties are structural in the above\nsense. As a consequence, Benacerraf’s dilemma of isomorphic\nnumbers systems with different set-theoretic properties does not arise\nin the context of categorical set theory. The conclusion is that\nnumbers can, after all, be identified with sets, but with structural\nones as defined in ETCS.\n\nAs McLarty and others have argued, this observation generalizes from\nnumbers to all other mathematical objects studied in category theory.\nThe claim is that any property of the objects in a given category that\nis expressible in the language of category theory is structural in the\nsense of being isomorphism invariant. The main consequence for a\nstructuralist conception of mathematical objects is summarized by\nAwodey as follows: \n\n\nSince all categorical properties are thus structural, the only\nproperties which a given object in a given category may have, qua\nobject in that category, are structural ones. (Awodey 1996: 214) \n\n\nThis would seem to illustrate a main advantage of categorical forms of\nstructuralism over set-theoretic and similar ones.\n\nA rejoinder should be added, however. McLarty’s and\nAwodey’s claim that all mathematical properties expressible in\ncategorical set theory are isomorphism invariant has been contested,\ne.g., in Tsementzis (2017). In fact, Tsementzis argues that neither\nZFC nor ETCS provide fully structuralist foundations for mathematics,\nsince their respective languages do not, after all, exclusively allow\nfor the formulation of invariant properties. Then again, both\nMakkai’s FOLDS system (Makkai 1995, Other Internet Resources,\n1998) and the Univalent Foundations program developed in Homotopy Type\nTheory (Univalent Foundations Program 2013) seem to meet this\ncondition. Here we have reached another ongoing debate in the\nliterature.\n\nThe technical results just mentioned are clearly relevant for our\ndiscussion, but we cannot explore them further in this general survey.\n(Cf. Awodey 2014 for more on the relation between structuralism and\nthe Univalent Foundations project.) We also have to leave a further,\nmore definite evaluation of the philosophical claims and arguments\nconcerning categorical structuralism to another occasion, interesting\nand important as that debate is. Instead, we now conclude with some\nmore general remarks about structuralism, even beyond the philosophy\nof mathematics.\n4. Conclusion\n4.1 The Varieties of Mathematical Structuralism\n\nThere were two main goals for this entry. The first was to introduce\nreaders to the general discussion of structuralism in contemporary\nphilosophy of mathematics.  The second was to provide a richer, more\ninclusive taxonomy for that discussion, including making evident that\na much larger variety of structuralist positions has played a role in\nit than is usually acknowledged.  To be sure, a certain amount of\nvariety has been recognized before, as reflected in the distinction\nbetween eliminative and non-eliminative positions, with\nShapiro’s ante rem structuralism and Hellman’s\nmodal structuralism as paradigms; and categorical structuralism has\nbeen acknowledged as a third main alternative. But the range of\npositions at play is much greater than that, especially in the recent\nliterature.  “Mathematical structuralism” is not the name\nof a single position, but of a multifaceted family of them.\n\nThere are two main reasons for a more inclusive taxonomy.  The first\nis that, while numerous versions of structuralism for mathematics have\nbeen proposed, several of them have not received much attention yet,\npartly because their relationships to Shapiro’s,\nHellman’s, and category-theoretic positions have remained\nunclear.  The taxonomy provides some corresponding bridges. The second\nreason is that several important variants played a role already before\nthe 1960s, i.e., before the publications by Benacerraf and Putnam that\nare often seen as the starting point for debates about structuralism\nin philosophy. This concerns both methodological and metaphysical\nstructuralism, a basic distinction we highlighted; but we only hinted\nat the relevant “pre-history” of our topic in the present\nsurvey (We refer the reader to Reck & Schiemer forthcoming for\nmore on it.)\n4.2 Structuralism Beyond Mathematics\n\nAnother relevant aspect that is not explored in the present entry,\nalthough it should be mentioned at least briefly before closing,\nconsists of debates about “structuralism” outside the\nphilosophy of mathematics. There are two main areas in which one can\nfind such debates (although they have reverberated further). The first\nis the philosophy of physics, where structuralist positions have\nplayed a significant role as well (including one called\n“structural realism”, which comes in both an\n“ontic” and an “epistemic” form).  The second\nconsists of several parts of the humanities and social sciences,\nprimarily linguistics and anthropology, but also psychology,\nsociology, etc. There too, “structuralism” (and\n“post-structuralism”) has been a major topic, indeed for a\nrelatively long period. In both cases, there are ties to mathematical\nstructuralism, although sometimes these ties are only loose.\n\nAt a basic level, the debate about structuralism in the philosophy of\nphysics concerns how to think about the “objects” of\nmodern physics, given the revolutionary changes quantum mechanics and\nrelativity theory have brought with them. More particularly, it\nconcerns the suggestion to refer to “structures” in this\nconnection (cf. French 2014, Ladyman 2007 [2019], etc.), in a way that\nis closely related to the philosophy of mathematics. At another level,\nthis debate concerns how to conceive of what, if anything, remains\nconstant through theory changes in the ontology of physics\n(cf. Worrall 1989, and see the\n entry on structuralism in physics\nin this encyclopedia). Third, there are debates about representation \nin science that are related to structuralism (cf. van Frassen 2008). While \nthere are several points of contact one could pursue further (e.g., concerning\n“structural indiscernibles” \nand versions of “set-theoretic versus \ncategory-theoretic structuralism” in the context \nof physics), we refrain from doing so here.\n\nThe structuralism introduced into linguistics by Ferdinand de Saussure\nand Roman Jakobson, then adopted by other thinkers in the humanities\nand social sciences—most prominently by Claude Levi-Strauss in\nanthropology and by Jean Piaget in psychology (cf.  Levi-Strauss 1958\n[1963], Piaget 1968 [1970], also Caws 1988)—does have ties to\nmathematical structuralism as well. However, they are looser than in\nthe case of the philosophy of physics. In addition, the kind of\npsychological determinism often associated, or even identified, with\nstructuralism in the humanities and social sciences (and criticized in\npost-structuralism) has no analogue on the side of mathematics (or\nphysics).  Still, these connections are not totally uninteresting\n(starting with contacts between Levi-Strauss and mathematicians in the\nBourbaki group, cf. Dosse 1991–92 [1997]). Hence they might be\nworth exploring further too, in this case not so much to derive\nbenefits for the philosophy of mathematics, but to understand the\nhistory of structuralism in human thought more fully. \n",
    "bibliography": {
        "categories": [],
        "cat_ref_text": {
            "ref_list": [
                "Assadian, Bahram, 2018, “The Semantic Plights of the\nAnte-Rem Structuralist”, <em>Philosophical Studies</em>,\n175(12): 3195–3215. doi:10.1007/s11098-017-1001-7",
                "Awodey, Steve, 1996, “Structure in Mathematics and Logic: A\nCategorical Perspective”, <em>Philosophia Mathematica</em>,\n4(3): 209–237. doi:10.1093/philmat/4.3.209",
                "–––, 2004, “An Answer to Hellman’s\nQuestion: ‘Does Category Theory Provide a Framework for\nMathematical Structuralism?’”, <em>Philosophia\nMathematica</em>, 12(1): 54–64. doi:10.1093/philmat/12.1.54",
                "–––, 2010, <em>Category Theory</em>, second\nedition, Oxford: Oxford University Press.",
                "–––, 2014, “Structuralism, Invariance, and\nUnivalence”, <em>Philosophia Mathematica</em>, 22(1): 1–11.\ndoi:10.1093/philmat/nkt030",
                "Benacerraf, Paul, 1965 [1983], “What Numbers Could Not\nBe”, <em>The Philosophical Review</em>, 74(1): 47–73.\nReprinted in Benacerraf and Putnam 1983: 272–294.\ndoi:10.2307/2183530 doi:10.1017/CBO9781139171519.015",
                "–––, 1996, “Recantation or Any Old ω-Sequence Would Do\nafter All”, <em>Philosophia Mathematica</em>, 4(2): 184–189.\ndoi:10.1093/philmat/4.2.184",
                "Benacerraf, Paul and Hilary Putnam (eds.), 1983, <em>Philosophy of\nMathematics: Selected Readings</em>, second edition, Cambridge:\nCambridge University Press. doi:10.1017/CBO9781139171519",
                "Burgess, John P., 1999, “Book Review: Stewart Shapiro.\nPhilosophy of Mathematics: Structure and Ontology (1997)”,\n<em>Notre Dame Journal of Formal Logic</em>, 40(2): 283–291.\ndoi:10.1305/ndjfl/1038949543",
                "–––, 2015, <em>Rigor and Structure</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780198722229.001.0001",
                "Button, Tim, 2006, “Realistic Structuralism’s Identity\nCrisis: A Hybrid Solution”, <em>Analysis</em>, 66(3): 216–222.\ndoi:10.1093/analys/66.3.216",
                "Button, Tim and Sean Walsh, 2016, “Structure and\nCategoricity: Determinacy of Reference and Truth Value in the\nPhilosophy of Mathematics”, <em>Philosophia Mathematica</em>,\n24(3): 283–307. doi:10.1093/philmat/nkw007",
                "Carter, Jessica, 2008, “Structuralism as a Philosophy of\nMathematical Practice”, <em>Synthese</em>, 163(2): 119–31.\ndoi:10.1007/s11229-007-9169-6",
                "Caws, Peter, 1988, <em>Structuralism. A Philosophy for the Human\nSciences</em>, Atlantic Highlands, NJ: Humanities Press.",
                "Chihara, Charles S., 2004, <em>A Structural Account of\nMathematics</em>, Oxford: Oxford University Press",
                "Cole, Julian C., 2010, “Mathematical Structuralism\nToday”, <em>Philosophy Compass</em>, 5(8): 689–699.\ndoi:10.1111/j.1747-9991.2010.00308.x",
                "Corry, Leo, 2004, <em>Modern Algebra and the Rise of Mathematical\nStructures</em>, second edition, Basel: Birkhäuser Basel.\ndoi:10.1007/978-3-0348-7917-0",
                "Dedekind, Richard, 1888, <em>Was sind und was sollen die\nZahlen?</em>, Braunschweig: Vieweg. Translated as “The Nature\nand Meaning of Numbers”, in his <em>Essays on the Theory of\nNumbers</em>, Wooster Woodruff Beman (trans.), Chicago: Open Court,\n1901, pp. 29–115.",
                "Dosse, François, 1991–92 [1997], <em>Histoire du\nstructuralisme</em>, 2 volumes, Paris: Éditions La\nDécouverte. Translated as <em>History of Structuralism</em>, 2\nvolumes, Deborah Glassman (trans.), Minneapolis, MN: University of\nMinnesota Press, 1997.",
                "Eilenberg, Samuel and Saunders MacLane, 1945, “General\nTheory of Natural Equivalences”, <em>Transactions of the\nAmerican Mathematical Society</em>, 58(2): 231–294.\ndoi:10.2307/1990284",
                "Feferman, Solomon, 1977, “Categorical Foundations and\nFoundations of Category Theory”, in <em>Logic, Foundations of\nMathematics, and Computability Theory</em>, Robert E. Butts and Jaakko\nHintikka (eds.), Dordrecht: Springer Netherlands, 149–169.\ndoi:10.1007/978-94-010-1138-9_9",
                "–––, 2014, “Logic, Mathematics, and\nConceptual Structuralism”, in <em>The Metaphysics of Logic</em>,\nPenelope Rush (ed.), Cambridge: Cambridge University Press, 72–92.\ndoi:10.1017/CBO9781139626279.006",
                "Franklin, James, 2014, <em>An Aristotelian Realist Philosophy of\nMathematics</em>, London: Palgrave Macmillan UK.\ndoi:10.1057/9781137400734",
                "French, Steven, 2014, <em>The Structure of the World: Metaphysics\nand Representation</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199684847.001.0001",
                "Hale, Bob, 1996, “Structuralism’s Unpaid\nEpistemological Debts”, <em>Philosophia Mathematica</em>, 4(2):\n124–147. doi:10.1093/philmat/4.2.124",
                "Halimi, Brice, 2019, “Settings and Misunderstandings in\nMathematics”, <em>Synthese</em>, 196(11): 4623–4656.\ndoi:10.1007/s11229-017-1671-x",
                "Hellman, Geoffrey, 1989, <em>Mathematics without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Oxford University\nPress. doi:10.1093/0198240341.001.0001",
                "–––, 1996, “Structuralism Without\nStructures”, <em>Philosophia Mathematica</em>, 4(2): 100–123.\ndoi:10.1093/philmat/4.2.100",
                "–––, 2001, “Three Varieties of\nMathematical Structuralism†”, <em>Philosophia\nMathematica</em>, 9(2): 184–211. doi:10.1093/philmat/9.2.184",
                "–––, 2003, “Does Category Theory Provide a\nFramework for Mathematical Structuralism?”, <em>Philosophia\nMathematica</em>, 11(2): 129–157. doi:10.1093/philmat/11.2.129",
                "–––, 2005, “Structuralism”, in\nShapiro 2005: 536–562.",
                "Hellman, Geoffrey and Stewart Shapiro, 2019, <em>Mathematical\nStructuralism</em> (Elements in The Philosophy of Mathematics),\nCambridge: Cambridge University Press. doi:10.1017/9781108582933",
                "Horsten, Leon, forthcoming, “Generic Structure”,\n<em>Philosophia Mathematica</em>, first online: 16 July 2018.\ndoi:10.1093/philmat/nky015",
                "Isaacson, Daniel, 2011, “The Reality of Mathematics and the\nCase of Set Theory”, in <em>Truth, Reference, and Realism</em>,\nZsolt Novák and András Simonyi (eds), Budapest: CEU\nPress, pp. 1–75.",
                "Keränen, Jukka, 2001, “The Identity Problem for Realist\nStructuralism”, <em>Philosophia Mathematica</em>, 9(3):\n308–330. doi:10.1093/philmat/9.3.308",
                "Ketland, Jeffrey, 2006, “Structuralism and the Identity of\nIndiscernibles”, <em>Analysis</em>, 66(4): 303–315.\ndoi:10.1093/analys/66.4.303",
                "–––, 2011, “Identity and\nIndiscernibility”, <em>The Review of Symbolic Logic</em>, 4(2):\n171–185. doi:10.1017/S1755020310000328",
                "Korbmacher, Johannes and Georg Schiemer, 2018, “What Are\nStructural Properties?”, <em>Philosophia Mathematica</em>,\n26(3): 295–323. doi:10.1093/philmat/nkx011",
                "Ladyman, James, 2005, “Mathematical Structuralism and the\nIdentity of Indiscernibles”, <em>Analysis</em>, 65(3):\n218–221. doi:10.1093/analys/65.3.218",
                "–––, 2007 [2019], “Structural\nRealism”, <em>Stanford Encyclopedia of Philosophy</em> (Fall\n2019 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/structural-realism/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/structural-realism/</a>&gt;",
                "Landry, Elaine, 1999, “Category Theory as a Framework for\nMathematical Structuralism”, <em>The 1998 Annual Proceedings of\nthe Canadian Society for the History and Philosophy of\nMathematics</em>, pp. 133–142",
                "–––, 2006, “Category Theory as a Framework\nfor an <em>in re</em> Interpretation of Mathematical\nStructuralism”, in <em>The Age of Alternative Logics: Assessing\nPhilosophy of Logic and Mathematics Today</em>, Johan van Benthem,\nGerhard Heinzmann, Manuel Rebuschi, and Henk Visser (eds.), Dordrecht:\nSpringer Netherlands, 163–179. doi:10.1007/978-1-4020-5012-7_12",
                "–––, 2011, “How to Be a Structuralist All\nthe Way Down”, <em>Synthese</em>, 179(3): 435–454.\ndoi:10.1007/s11229-009-9691-9",
                "––– (ed.), 2017, <em>Categories for the Working\nPhilosopher</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198748991.001.0001",
                "Landry, Elaine and Jean-Pierre Marquis, 2005, “Categories in\nContext: Historical, Foundational, and Philosophical”,\n<em>Philosophia Mathematica</em>, 13(1): 1–43.\ndoi:10.1093/philmat/nki005",
                "Lawvere, F. William, 1964, “An Elementary Theory of the\nCategory of Sets”, <em>Proceedings of the National Academy of\nSciences of the United States of America</em>, 52(6):\n1506–1511.",
                "–––, 1966, “The Category of Categories as\na Foundation for Mathematics”, in <em>Proceedings of the\nConference on Categorical Algebra, La Jolla 1965</em>, S. Eilenberg,\nD. K. Harrison, S. MacLane, and H. Röhrl (eds.), Berlin,\nHeidelberg: Springer Berlin Heidelberg, 1–20.\ndoi:10.1007/978-3-642-99902-4_1",
                "Leitgeb, Hannes, forthcoming, “On Non-Eliminative\nStructuralism: Unlabelled Graphs as a Case Study (Part A and\nB)”, <em>Philosophia Mathematica</em> (III).",
                "Leitgeb, Hannes and James Ladyman, 2008, “Criteria of\nIdentity and Structuralist Ontology”, <em>Philosophia\nMathematica</em>, 16(3): 388–396. doi:10.1093/philmat/nkm039",
                "Lévi-Strauss, Claude, 1958 [1963], <em>Anthropologie\nstructurale</em>, Paris, Plon. Translated as <em>Structural\nAnthropology</em>, Claire Jacobson and Brooke Grundfest Schoepf\n(trans.), Basic Books, 1963.",
                "Linnebo, Øystein, 2008, “Structuralism and the Notion\nof Dependence”, <em>The Philosophical Quarterly</em>, 58(230):\n59–79. doi:10.1111/j.1467-9213.2007.529.x",
                "Linnebo, Øystein and Richard Pettigrew, 2011,\n“Category Theory as an Autonomous Foundation”,\n<em>Philosophia Mathematica</em>, 19(3): 227–254.\ndoi:10.1093/philmat/nkr024",
                "–––, 2014, “Two Types of Abstraction for\nStructuralism”, <em>The Philosophical Quarterly</em>, 64(255):\n267–283. doi:10.1093/pq/pqt044",
                "Makkai, Michael, 1998, “Towards a Categorical\nFoundation of Mathematics”, in <em>Logic Colloquium ‘95:\nProceedings of the Annual European Summer Meeting of the Association\nof Symbolic Logic, held in Haifa, Israel, August 9–18,\n1995</em>, Johann A. Makowsky and Elena V. Ravve (eds), (Lecture Notes\nin Logic, 11), Berlin: Springer-Verlag Berlin Heidelberg, pp.\n153–190.\n [<a href=\"https://projecteuclid.org/euclid.lnl/1235415906\" target=\"other\">Makkai 1998 available online</a>]",
                "Mac Lane, Saunders, 1986, <em>Mathematics Form and Function</em>,\nNew York, NY: Springer New York. doi:10.1007/978-1-4612-4872-9",
                "–––, 1996, “Structure in\nMathematics”, <em>Philosophia Mathematica</em>, 4(2): 174–183.\ndoi:10.1093/philmat/4.2.174",
                "MacBride, Frazer, 2005, “Structuralism Reconsidered”,\nin Shapiro 2005: 563–589.",
                "Marquis, Jean-Pierre, 1995, “Category Theory and the\nFoundations of Mathematics: Philosophical Excavations”,\n<em>Synthese</em>, 103(3): 421–447. doi:10.1007/BF01089735",
                "–––, 1997 [2019], “Category Theory”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Fall 2019 Edition),\nEdward N. Zalta (ed.), URL:\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/category-theory/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/category-theory/</a>&gt;",
                "–––, 2009, <em>From a Geometrical Point of View:\nA Study of the History and Philosophy of Category Theory</em>, (Logic,\nEpistemology, and the Unity of Science 14), Dordrecht: Springer\nNetherlands. doi:10.1007/978-1-4020-9384-5",
                "–––, 2013, “Categorical Foundations of\nMathematics: Or How to Provide Foundations for <em>Abstract</em>\nMathematics”, <em>The Review of Symbolic Logic</em>, 6(1):\n51–75. doi:10.1017/S1755020312000147",
                "McLarty, Colin, 1993, “Numbers Can Be Just What They Have\nTo”, <em>Noûs</em>, 27(4): 487–498.\ndoi:10.2307/2215789",
                "–––, 2004, “Exploring Categorical\nStructuralism”, <em>Philosophia Mathematica</em>, 12(1):\n37–53. doi:10.1093/philmat/12.1.37",
                "–––, 2008, “What Structuralism\nAchieves”, in <em>The Philosophy of Mathematical Practice</em>,\nPaolo Mancosu (ed.), Oxford: Oxford University Press, 354–369.\ndoi:10.1093/acprof:oso/9780199296453.003.0014",
                "–––, 2011, “Recent Debate over Categorical\nFoundations”, in <em>Foundational Theories of Classical and\nConstructive Mathematics</em>, Giovanni Sommaruga (ed.), (Western\nOntario Series in Philosophy of Science 76), Dordrecht: Springer\nNetherlands, 145–154. doi:10.1007/978-94-007-0431-2_7",
                "–––, 2012, “Categorical Foundations and\nMathematical Practice”, <em>Philosophia Mathematica</em>, 20(1):\n111–113. doi:10.1093/philmat/nkr041",
                "Menzel, Christopher, 2018, “Haecceities and Mathematical\nStructuralism”, <em>Philosophia Mathematica</em>, 26(1):\n84–111. doi:10.1093/philmat/nkw030",
                "Nodelman, Uri and Edward N. Zalta, 2014, “Foundations for\nMathematical Structuralism”, <em>Mind</em>, 123(489): 39–78.\ndoi:10.1093/mind/fzu003",
                "Parsons, Charles, 1990, “The Structuralist View of\nMathematical Objects”, <em>Synthese</em>, 84(3): 303–346.\ndoi:10.1007/BF00485186",
                "–––, 2004, “Structuralism and\nMetaphysics”, <em>The Philosophical Quarterly</em>, 54(214):\n56–77. doi:10.1111/j.0031-8094.2004.00342.x",
                "–––, 2008, <em>Mathematical Thought and Its\nObjects</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498534",
                "–––, 2018, “Concepts versus\nObjects”, in Reck 2018b: 91–112.",
                "Pettigrew, Richard, 2008, “Platonism and Aristotelianism in\nMathematics”, <em>Philosophia Mathematica</em>, 16(3):\n310–332. doi:10.1093/philmat/nkm035",
                "Piaget, Jean, 1968 [1970], <em>Le structuralisme</em>, Paris:\nPresses Universitaires de France. Translated as\n<em>Structuralism</em>, Chaninah Maschler (trans.), New York: Basic\nBooks, 1970.",
                "Putnam, Hilary, 1967, “Mathematics without\nFoundations”, <em>The Journal of Philosophy</em>, 64(1): 5–22.\nReprinted in Benacerraf and Hilary Putnam 1983: 295–312.\ndoi:10.2307/2024603 doi:10.1017/CBO9781139171519.016",
                "Reck, Erich H., 2003, “Dedekind’s Structuralism: An\nInterpretation and Partial Defense”, <em>Synthese</em>, 137(3):\n369–419. doi:10.1023/B:SYNT.0000004903.11236.91",
                "–––, 2018a, “On Reconstructing Dedekind\nAbstraction Logically”, in Reck 2018b: 113–138.",
                "––– (ed.), 2018b, <em>Logic, Philosophy of\nMathematics, and their History: Essays in Honor of W.W. Tait</em>,\nLondon: College Publications.",
                "Reck, Erich H. and Michael P. Price, 2000, “Structures And\nStructuralism In Contemporary Philosophy Of Mathematics”,\n<em>Synthese</em>, 125(3): 341–383. doi:10.1023/A:1005203923553",
                "Reck, Erich H. and Georg Schiemer (eds.), forthcoming,\n<em>Prehistory of Mathematical Structuralism</em>, Oxford: Oxford\nUniversity Press.",
                "Resnik, Michael D., 1981, “Mathematics as a Science of\nPatterns: Ontology and Reference”, <em>Noûs</em>, 15(4):\n529–550. doi:10.2307/2214851",
                "–––, 1982, “Mathematics as a Science of\nPatterns: Epistemology”, <em>Noûs</em>, 16(1): 95–105.\ndoi:10.2307/2215419",
                "–––, 1988, “Mathematics from the\nStructural Point of View”, <em>Revue Internationale de\nPhilosophie</em>, 42(167): 400–424.",
                "–––, 1996, “Structural Relativity”,\n<em>Philosophia Mathematica</em>, 4(2): 83–99.\ndoi:10.1093/philmat/4.2.83",
                "–––, 1997, <em>Mathematics as a Science of\nPatterns</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198250142.001.0001",
                "Russell, Bertrand, 1903, <em>The Principles of Mathematics</em>,\nCambridge: Cambridge University Press. Republished by Norton &amp;\nCompany, New York, 1996.\n [<a href=\"http://archive.org/details/principlesmathe00russgoog\" target=\"other\">Russell 1903 available online</a>].",
                "Schiemer, Georg and John Wigglesworth, forthcoming, “The\nStructuralist Thesis Reconsidered”, <em>The British Journal for\nthe Philosophy of Science</em>, first online: 30 January 2018.\ndoi:10.1093/bjps/axy004",
                "Richart, Charles E., 1995, <em>Structuralism and Structures: A\nMathematical Perspective</em>, London: World Scientific.",
                "Shapiro, Stewart, 1983, “Mathematics and Reality”,\n<em>Philosophy of Science</em>, 50(4): 523–548.\ndoi:10.1086/289138",
                "–––, 1989, “Structure and Ontology”,\n<em>Philosophical Topics</em>, 17(2): 145–171.",
                "–––, 1996, “Space, Number and Structure: A\nTale of Two Debates”, <em>Philosophia Mathematica</em>, 4(2):\n148–173. doi:10.1093/philmat/4.2.148",
                "–––, 1997, <em>Philosophy of Mathematics:\nStructure and Ontology</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195139305.001.0001",
                "––– (ed.), 2005, <em>The Oxford Handbook of\nPhilosophy of Mathematics and Logic</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780195325928.001.0001",
                "–––, 2008, “Identity, Indiscernibility,\nand <em>ante rem</em> Structuralism: The Tale of <i>i</i> and\n−<i>i</i>”, <em>Philosophia Mathematica</em>, 16(3):\n285–309. doi:10.1093/philmat/nkm042",
                "Tsementzis, Dimitris, 2017, “Univalent Foundations as\nStructuralist Foundations”, <em>Synthese</em>, 194(9):\n3583–3617. doi:10.1007/s11229-016-1109-x",
                "Univalent Foundations Program, 2013, <em>Homotopy Type Theory:\nUnivalent Foundations of Mathematics</em>, The Univalent Foundations\nProgram.\n [<a href=\"http://arxiv.org/abs/1308.0729\" target=\"other\">Homotopy Type Theory available online</a>]",
                "van Fraassen, Bas C., 2008, <em>Scientific Representation:\nParadoxes of Perspective</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199278220.001.0001",
                "Wigglesworth, John, 2018, “Grounding in Mathematical\nStructuralism”, in <em>Reality and Its Structure: Essays in\nFundamentality</em>, Ricki Bliss and Graham Priest (eds.), Oxford:\nOxford University Press, 217–236.\ndoi:10.1093/oso/9780198755630.003.0012",
                "Worrall, John, 1989, “Structural Realism: The Best of Both\nWorlds?”, <em>Dialectica</em>, 43(1–2): 99–124.\ndoi:10.1111/j.1746-8361.1989.tb00933.x"
            ]
        },
        "raw_text": "<div id=\"bibliography\">\n<h2 id=\"Bib\">Bibliography</h2>\n<ul class=\"hanging\">\n<li>Assadian, Bahram, 2018, “The Semantic Plights of the\nAnte-Rem Structuralist”, <em>Philosophical Studies</em>,\n175(12): 3195–3215. doi:10.1007/s11098-017-1001-7</li>\n<li>Awodey, Steve, 1996, “Structure in Mathematics and Logic: A\nCategorical Perspective”, <em>Philosophia Mathematica</em>,\n4(3): 209–237. doi:10.1093/philmat/4.3.209</li>\n<li>–––, 2004, “An Answer to Hellman’s\nQuestion: ‘Does Category Theory Provide a Framework for\nMathematical Structuralism?’”, <em>Philosophia\nMathematica</em>, 12(1): 54–64. doi:10.1093/philmat/12.1.54</li>\n<li>–––, 2010, <em>Category Theory</em>, second\nedition, Oxford: Oxford University Press.</li>\n<li>–––, 2014, “Structuralism, Invariance, and\nUnivalence”, <em>Philosophia Mathematica</em>, 22(1): 1–11.\ndoi:10.1093/philmat/nkt030</li>\n<li>Benacerraf, Paul, 1965 [1983], “What Numbers Could Not\nBe”, <em>The Philosophical Review</em>, 74(1): 47–73.\nReprinted in Benacerraf and Putnam 1983: 272–294.\ndoi:10.2307/2183530 doi:10.1017/CBO9781139171519.015</li>\n<li>–––, 1996, “Recantation or Any Old ω-Sequence Would Do\nafter All”, <em>Philosophia Mathematica</em>, 4(2): 184–189.\ndoi:10.1093/philmat/4.2.184</li>\n<li>Benacerraf, Paul and Hilary Putnam (eds.), 1983, <em>Philosophy of\nMathematics: Selected Readings</em>, second edition, Cambridge:\nCambridge University Press. doi:10.1017/CBO9781139171519</li>\n<li>Burgess, John P., 1999, “Book Review: Stewart Shapiro.\nPhilosophy of Mathematics: Structure and Ontology (1997)”,\n<em>Notre Dame Journal of Formal Logic</em>, 40(2): 283–291.\ndoi:10.1305/ndjfl/1038949543</li>\n<li>–––, 2015, <em>Rigor and Structure</em>, Oxford:\nOxford University Press.\ndoi:10.1093/acprof:oso/9780198722229.001.0001</li>\n<li>Button, Tim, 2006, “Realistic Structuralism’s Identity\nCrisis: A Hybrid Solution”, <em>Analysis</em>, 66(3): 216–222.\ndoi:10.1093/analys/66.3.216</li>\n<li>Button, Tim and Sean Walsh, 2016, “Structure and\nCategoricity: Determinacy of Reference and Truth Value in the\nPhilosophy of Mathematics”, <em>Philosophia Mathematica</em>,\n24(3): 283–307. doi:10.1093/philmat/nkw007</li>\n<li>Carter, Jessica, 2008, “Structuralism as a Philosophy of\nMathematical Practice”, <em>Synthese</em>, 163(2): 119–31.\ndoi:10.1007/s11229-007-9169-6</li>\n<li>Caws, Peter, 1988, <em>Structuralism. A Philosophy for the Human\nSciences</em>, Atlantic Highlands, NJ: Humanities Press.</li>\n<li>Chihara, Charles S., 2004, <em>A Structural Account of\nMathematics</em>, Oxford: Oxford University Press</li>\n<li>Cole, Julian C., 2010, “Mathematical Structuralism\nToday”, <em>Philosophy Compass</em>, 5(8): 689–699.\ndoi:10.1111/j.1747-9991.2010.00308.x</li>\n<li>Corry, Leo, 2004, <em>Modern Algebra and the Rise of Mathematical\nStructures</em>, second edition, Basel: Birkhäuser Basel.\ndoi:10.1007/978-3-0348-7917-0</li>\n<li>Dedekind, Richard, 1888, <em>Was sind und was sollen die\nZahlen?</em>, Braunschweig: Vieweg. Translated as “The Nature\nand Meaning of Numbers”, in his <em>Essays on the Theory of\nNumbers</em>, Wooster Woodruff Beman (trans.), Chicago: Open Court,\n1901, pp. 29–115.</li>\n<li>Dosse, François, 1991–92 [1997], <em>Histoire du\nstructuralisme</em>, 2 volumes, Paris: Éditions La\nDécouverte. Translated as <em>History of Structuralism</em>, 2\nvolumes, Deborah Glassman (trans.), Minneapolis, MN: University of\nMinnesota Press, 1997.</li>\n<li>Eilenberg, Samuel and Saunders MacLane, 1945, “General\nTheory of Natural Equivalences”, <em>Transactions of the\nAmerican Mathematical Society</em>, 58(2): 231–294.\ndoi:10.2307/1990284</li>\n<li>Feferman, Solomon, 1977, “Categorical Foundations and\nFoundations of Category Theory”, in <em>Logic, Foundations of\nMathematics, and Computability Theory</em>, Robert E. Butts and Jaakko\nHintikka (eds.), Dordrecht: Springer Netherlands, 149–169.\ndoi:10.1007/978-94-010-1138-9_9</li>\n<li>–––, 2014, “Logic, Mathematics, and\nConceptual Structuralism”, in <em>The Metaphysics of Logic</em>,\nPenelope Rush (ed.), Cambridge: Cambridge University Press, 72–92.\ndoi:10.1017/CBO9781139626279.006</li>\n<li>Franklin, James, 2014, <em>An Aristotelian Realist Philosophy of\nMathematics</em>, London: Palgrave Macmillan UK.\ndoi:10.1057/9781137400734</li>\n<li>French, Steven, 2014, <em>The Structure of the World: Metaphysics\nand Representation</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199684847.001.0001</li>\n<li>Hale, Bob, 1996, “Structuralism’s Unpaid\nEpistemological Debts”, <em>Philosophia Mathematica</em>, 4(2):\n124–147. doi:10.1093/philmat/4.2.124</li>\n<li>Halimi, Brice, 2019, “Settings and Misunderstandings in\nMathematics”, <em>Synthese</em>, 196(11): 4623–4656.\ndoi:10.1007/s11229-017-1671-x</li>\n<li>Hellman, Geoffrey, 1989, <em>Mathematics without Numbers: Towards\na Modal-Structural Interpretation</em>, Oxford: Oxford University\nPress. doi:10.1093/0198240341.001.0001</li>\n<li>–––, 1996, “Structuralism Without\nStructures”, <em>Philosophia Mathematica</em>, 4(2): 100–123.\ndoi:10.1093/philmat/4.2.100</li>\n<li>–––, 2001, “Three Varieties of\nMathematical Structuralism†”, <em>Philosophia\nMathematica</em>, 9(2): 184–211. doi:10.1093/philmat/9.2.184</li>\n<li>–––, 2003, “Does Category Theory Provide a\nFramework for Mathematical Structuralism?”, <em>Philosophia\nMathematica</em>, 11(2): 129–157. doi:10.1093/philmat/11.2.129</li>\n<li>–––, 2005, “Structuralism”, in\nShapiro 2005: 536–562.</li>\n<li>Hellman, Geoffrey and Stewart Shapiro, 2019, <em>Mathematical\nStructuralism</em> (Elements in The Philosophy of Mathematics),\nCambridge: Cambridge University Press. doi:10.1017/9781108582933</li>\n<li>Horsten, Leon, forthcoming, “Generic Structure”,\n<em>Philosophia Mathematica</em>, first online: 16 July 2018.\ndoi:10.1093/philmat/nky015</li>\n<li>Isaacson, Daniel, 2011, “The Reality of Mathematics and the\nCase of Set Theory”, in <em>Truth, Reference, and Realism</em>,\nZsolt Novák and András Simonyi (eds), Budapest: CEU\nPress, pp. 1–75.</li>\n<li>Keränen, Jukka, 2001, “The Identity Problem for Realist\nStructuralism”, <em>Philosophia Mathematica</em>, 9(3):\n308–330. doi:10.1093/philmat/9.3.308</li>\n<li>Ketland, Jeffrey, 2006, “Structuralism and the Identity of\nIndiscernibles”, <em>Analysis</em>, 66(4): 303–315.\ndoi:10.1093/analys/66.4.303</li>\n<li>–––, 2011, “Identity and\nIndiscernibility”, <em>The Review of Symbolic Logic</em>, 4(2):\n171–185. doi:10.1017/S1755020310000328</li>\n<li>Korbmacher, Johannes and Georg Schiemer, 2018, “What Are\nStructural Properties?”, <em>Philosophia Mathematica</em>,\n26(3): 295–323. doi:10.1093/philmat/nkx011</li>\n<li>Ladyman, James, 2005, “Mathematical Structuralism and the\nIdentity of Indiscernibles”, <em>Analysis</em>, 65(3):\n218–221. doi:10.1093/analys/65.3.218</li>\n<li>–––, 2007 [2019], “Structural\nRealism”, <em>Stanford Encyclopedia of Philosophy</em> (Fall\n2019 edition), Edward N. Zalta (ed.), URL =\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/structural-realism/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/structural-realism/</a>&gt;</li>\n<li>Landry, Elaine, 1999, “Category Theory as a Framework for\nMathematical Structuralism”, <em>The 1998 Annual Proceedings of\nthe Canadian Society for the History and Philosophy of\nMathematics</em>, pp. 133–142</li>\n<li>–––, 2006, “Category Theory as a Framework\nfor an <em>in re</em> Interpretation of Mathematical\nStructuralism”, in <em>The Age of Alternative Logics: Assessing\nPhilosophy of Logic and Mathematics Today</em>, Johan van Benthem,\nGerhard Heinzmann, Manuel Rebuschi, and Henk Visser (eds.), Dordrecht:\nSpringer Netherlands, 163–179. doi:10.1007/978-1-4020-5012-7_12</li>\n<li>–––, 2011, “How to Be a Structuralist All\nthe Way Down”, <em>Synthese</em>, 179(3): 435–454.\ndoi:10.1007/s11229-009-9691-9</li>\n<li>––– (ed.), 2017, <em>Categories for the Working\nPhilosopher</em>, Oxford: Oxford University Press.\ndoi:10.1093/oso/9780198748991.001.0001</li>\n<li>Landry, Elaine and Jean-Pierre Marquis, 2005, “Categories in\nContext: Historical, Foundational, and Philosophical”,\n<em>Philosophia Mathematica</em>, 13(1): 1–43.\ndoi:10.1093/philmat/nki005</li>\n<li>Lawvere, F. William, 1964, “An Elementary Theory of the\nCategory of Sets”, <em>Proceedings of the National Academy of\nSciences of the United States of America</em>, 52(6):\n1506–1511.</li>\n<li>–––, 1966, “The Category of Categories as\na Foundation for Mathematics”, in <em>Proceedings of the\nConference on Categorical Algebra, La Jolla 1965</em>, S. Eilenberg,\nD. K. Harrison, S. MacLane, and H. Röhrl (eds.), Berlin,\nHeidelberg: Springer Berlin Heidelberg, 1–20.\ndoi:10.1007/978-3-642-99902-4_1</li>\n<li>Leitgeb, Hannes, forthcoming, “On Non-Eliminative\nStructuralism: Unlabelled Graphs as a Case Study (Part A and\nB)”, <em>Philosophia Mathematica</em> (III).</li>\n<li>Leitgeb, Hannes and James Ladyman, 2008, “Criteria of\nIdentity and Structuralist Ontology”, <em>Philosophia\nMathematica</em>, 16(3): 388–396. doi:10.1093/philmat/nkm039</li>\n<li>Lévi-Strauss, Claude, 1958 [1963], <em>Anthropologie\nstructurale</em>, Paris, Plon. Translated as <em>Structural\nAnthropology</em>, Claire Jacobson and Brooke Grundfest Schoepf\n(trans.), Basic Books, 1963.</li>\n<li>Linnebo, Øystein, 2008, “Structuralism and the Notion\nof Dependence”, <em>The Philosophical Quarterly</em>, 58(230):\n59–79. doi:10.1111/j.1467-9213.2007.529.x</li>\n<li>Linnebo, Øystein and Richard Pettigrew, 2011,\n“Category Theory as an Autonomous Foundation”,\n<em>Philosophia Mathematica</em>, 19(3): 227–254.\ndoi:10.1093/philmat/nkr024</li>\n<li>–––, 2014, “Two Types of Abstraction for\nStructuralism”, <em>The Philosophical Quarterly</em>, 64(255):\n267–283. doi:10.1093/pq/pqt044</li>\n<li>Makkai, Michael, 1998, “Towards a Categorical\nFoundation of Mathematics”, in <em>Logic Colloquium ‘95:\nProceedings of the Annual European Summer Meeting of the Association\nof Symbolic Logic, held in Haifa, Israel, August 9–18,\n1995</em>, Johann A. Makowsky and Elena V. Ravve (eds), (Lecture Notes\nin Logic, 11), Berlin: Springer-Verlag Berlin Heidelberg, pp.\n153–190.\n [<a href=\"https://projecteuclid.org/euclid.lnl/1235415906\" target=\"other\">Makkai 1998 available online</a>]</li>\n<li>Mac Lane, Saunders, 1986, <em>Mathematics Form and Function</em>,\nNew York, NY: Springer New York. doi:10.1007/978-1-4612-4872-9</li>\n<li>–––, 1996, “Structure in\nMathematics”, <em>Philosophia Mathematica</em>, 4(2): 174–183.\ndoi:10.1093/philmat/4.2.174</li>\n<li>MacBride, Frazer, 2005, “Structuralism Reconsidered”,\nin Shapiro 2005: 563–589.</li>\n<li>Marquis, Jean-Pierre, 1995, “Category Theory and the\nFoundations of Mathematics: Philosophical Excavations”,\n<em>Synthese</em>, 103(3): 421–447. doi:10.1007/BF01089735</li>\n<li>–––, 1997 [2019], “Category Theory”,\n<em>The Stanford Encyclopedia of Philosophy</em> (Fall 2019 Edition),\nEdward N. Zalta (ed.), URL:\n &lt;<a href=\"https://plato.stanford.edu/archives/fall2019/entries/category-theory/\" target=\"other\">https://plato.stanford.edu/archives/fall2019/entries/category-theory/</a>&gt;</li>\n<li>–––, 2009, <em>From a Geometrical Point of View:\nA Study of the History and Philosophy of Category Theory</em>, (Logic,\nEpistemology, and the Unity of Science 14), Dordrecht: Springer\nNetherlands. doi:10.1007/978-1-4020-9384-5</li>\n<li>–––, 2013, “Categorical Foundations of\nMathematics: Or How to Provide Foundations for <em>Abstract</em>\nMathematics”, <em>The Review of Symbolic Logic</em>, 6(1):\n51–75. doi:10.1017/S1755020312000147</li>\n<li>McLarty, Colin, 1993, “Numbers Can Be Just What They Have\nTo”, <em>Noûs</em>, 27(4): 487–498.\ndoi:10.2307/2215789</li>\n<li>–––, 2004, “Exploring Categorical\nStructuralism”, <em>Philosophia Mathematica</em>, 12(1):\n37–53. doi:10.1093/philmat/12.1.37</li>\n<li>–––, 2008, “What Structuralism\nAchieves”, in <em>The Philosophy of Mathematical Practice</em>,\nPaolo Mancosu (ed.), Oxford: Oxford University Press, 354–369.\ndoi:10.1093/acprof:oso/9780199296453.003.0014</li>\n<li>–––, 2011, “Recent Debate over Categorical\nFoundations”, in <em>Foundational Theories of Classical and\nConstructive Mathematics</em>, Giovanni Sommaruga (ed.), (Western\nOntario Series in Philosophy of Science 76), Dordrecht: Springer\nNetherlands, 145–154. doi:10.1007/978-94-007-0431-2_7</li>\n<li>–––, 2012, “Categorical Foundations and\nMathematical Practice”, <em>Philosophia Mathematica</em>, 20(1):\n111–113. doi:10.1093/philmat/nkr041</li>\n<li>Menzel, Christopher, 2018, “Haecceities and Mathematical\nStructuralism”, <em>Philosophia Mathematica</em>, 26(1):\n84–111. doi:10.1093/philmat/nkw030</li>\n<li>Nodelman, Uri and Edward N. Zalta, 2014, “Foundations for\nMathematical Structuralism”, <em>Mind</em>, 123(489): 39–78.\ndoi:10.1093/mind/fzu003</li>\n<li>Parsons, Charles, 1990, “The Structuralist View of\nMathematical Objects”, <em>Synthese</em>, 84(3): 303–346.\ndoi:10.1007/BF00485186</li>\n<li>–––, 2004, “Structuralism and\nMetaphysics”, <em>The Philosophical Quarterly</em>, 54(214):\n56–77. doi:10.1111/j.0031-8094.2004.00342.x</li>\n<li>–––, 2008, <em>Mathematical Thought and Its\nObjects</em>, Cambridge: Cambridge University Press.\ndoi:10.1017/CBO9780511498534</li>\n<li>–––, 2018, “Concepts versus\nObjects”, in Reck 2018b: 91–112.</li>\n<li>Pettigrew, Richard, 2008, “Platonism and Aristotelianism in\nMathematics”, <em>Philosophia Mathematica</em>, 16(3):\n310–332. doi:10.1093/philmat/nkm035</li>\n<li>Piaget, Jean, 1968 [1970], <em>Le structuralisme</em>, Paris:\nPresses Universitaires de France. Translated as\n<em>Structuralism</em>, Chaninah Maschler (trans.), New York: Basic\nBooks, 1970.</li>\n<li>Putnam, Hilary, 1967, “Mathematics without\nFoundations”, <em>The Journal of Philosophy</em>, 64(1): 5–22.\nReprinted in Benacerraf and Hilary Putnam 1983: 295–312.\ndoi:10.2307/2024603 doi:10.1017/CBO9781139171519.016</li>\n<li>Reck, Erich H., 2003, “Dedekind’s Structuralism: An\nInterpretation and Partial Defense”, <em>Synthese</em>, 137(3):\n369–419. doi:10.1023/B:SYNT.0000004903.11236.91</li>\n<li>–––, 2018a, “On Reconstructing Dedekind\nAbstraction Logically”, in Reck 2018b: 113–138.</li>\n<li>––– (ed.), 2018b, <em>Logic, Philosophy of\nMathematics, and their History: Essays in Honor of W.W. Tait</em>,\nLondon: College Publications.</li>\n<li>Reck, Erich H. and Michael P. Price, 2000, “Structures And\nStructuralism In Contemporary Philosophy Of Mathematics”,\n<em>Synthese</em>, 125(3): 341–383. doi:10.1023/A:1005203923553</li>\n<li>Reck, Erich H. and Georg Schiemer (eds.), forthcoming,\n<em>Prehistory of Mathematical Structuralism</em>, Oxford: Oxford\nUniversity Press.</li>\n<li>Resnik, Michael D., 1981, “Mathematics as a Science of\nPatterns: Ontology and Reference”, <em>Noûs</em>, 15(4):\n529–550. doi:10.2307/2214851</li>\n<li>–––, 1982, “Mathematics as a Science of\nPatterns: Epistemology”, <em>Noûs</em>, 16(1): 95–105.\ndoi:10.2307/2215419</li>\n<li>–––, 1988, “Mathematics from the\nStructural Point of View”, <em>Revue Internationale de\nPhilosophie</em>, 42(167): 400–424.</li>\n<li>–––, 1996, “Structural Relativity”,\n<em>Philosophia Mathematica</em>, 4(2): 83–99.\ndoi:10.1093/philmat/4.2.83</li>\n<li>–––, 1997, <em>Mathematics as a Science of\nPatterns</em>, Oxford: Oxford University Press.\ndoi:10.1093/0198250142.001.0001</li>\n<li>Russell, Bertrand, 1903, <em>The Principles of Mathematics</em>,\nCambridge: Cambridge University Press. Republished by Norton &amp;\nCompany, New York, 1996.\n [<a href=\"http://archive.org/details/principlesmathe00russgoog\" target=\"other\">Russell 1903 available online</a>].</li>\n<li>Schiemer, Georg and John Wigglesworth, forthcoming, “The\nStructuralist Thesis Reconsidered”, <em>The British Journal for\nthe Philosophy of Science</em>, first online: 30 January 2018.\ndoi:10.1093/bjps/axy004</li>\n<li>Richart, Charles E., 1995, <em>Structuralism and Structures: A\nMathematical Perspective</em>, London: World Scientific.</li>\n<li>Shapiro, Stewart, 1983, “Mathematics and Reality”,\n<em>Philosophy of Science</em>, 50(4): 523–548.\ndoi:10.1086/289138</li>\n<li>–––, 1989, “Structure and Ontology”,\n<em>Philosophical Topics</em>, 17(2): 145–171.</li>\n<li>–––, 1996, “Space, Number and Structure: A\nTale of Two Debates”, <em>Philosophia Mathematica</em>, 4(2):\n148–173. doi:10.1093/philmat/4.2.148</li>\n<li>–––, 1997, <em>Philosophy of Mathematics:\nStructure and Ontology</em>, Oxford: Oxford University Press.\ndoi:10.1093/0195139305.001.0001</li>\n<li>––– (ed.), 2005, <em>The Oxford Handbook of\nPhilosophy of Mathematics and Logic</em>, Oxford: Oxford University\nPress. doi:10.1093/oxfordhb/9780195325928.001.0001</li>\n<li>–––, 2008, “Identity, Indiscernibility,\nand <em>ante rem</em> Structuralism: The Tale of <i>i</i> and\n−<i>i</i>”, <em>Philosophia Mathematica</em>, 16(3):\n285–309. doi:10.1093/philmat/nkm042</li>\n<li>Tsementzis, Dimitris, 2017, “Univalent Foundations as\nStructuralist Foundations”, <em>Synthese</em>, 194(9):\n3583–3617. doi:10.1007/s11229-016-1109-x</li>\n<li>Univalent Foundations Program, 2013, <em>Homotopy Type Theory:\nUnivalent Foundations of Mathematics</em>, The Univalent Foundations\nProgram.\n [<a href=\"http://arxiv.org/abs/1308.0729\" target=\"other\">Homotopy Type Theory available online</a>]</li>\n<li>van Fraassen, Bas C., 2008, <em>Scientific Representation:\nParadoxes of Perspective</em>, Oxford: Oxford University Press.\ndoi:10.1093/acprof:oso/9780199278220.001.0001</li>\n<li>Wigglesworth, John, 2018, “Grounding in Mathematical\nStructuralism”, in <em>Reality and Its Structure: Essays in\nFundamentality</em>, Ricki Bliss and Graham Priest (eds.), Oxford:\nOxford University Press, 217–236.\ndoi:10.1093/oso/9780198755630.003.0012</li>\n<li>Worrall, John, 1989, “Structural Realism: The Best of Both\nWorlds?”, <em>Dialectica</em>, 43(1–2): 99–124.\ndoi:10.1111/j.1746-8361.1989.tb00933.x</li>\n</ul>\n</div>"
    },
    "related_entries": {
        "entry_list": [
            "category theory",
            "Dedekind, Richard: contributions to the foundations of mathematics",
            "identity: of indiscernibles",
            "mathematics, philosophy of",
            "mathematics, philosophy of: nominalism",
            "mathematics, philosophy of: Platonism",
            "physics: structuralism in",
            "structural realism",
            "style: in mathematics"
        ],
        "entry_link": [
            {
                "../category-theory/": "category theory"
            },
            {
                "../dedekind-foundations/": "Dedekind, Richard: contributions to the foundations of mathematics"
            },
            {
                "../identity-indiscernible/": "identity: of indiscernibles"
            },
            {
                "../philosophy-mathematics/": "mathematics, philosophy of"
            },
            {
                "../nominalism-mathematics/": "mathematics, philosophy of: nominalism"
            },
            {
                "../platonism-mathematics/": "mathematics, philosophy of: Platonism"
            },
            {
                "../physics-structuralism/": "physics: structuralism in"
            },
            {
                "../structural-realism/": "structural realism"
            },
            {
                "../mathematical-style/": "style: in mathematics"
            }
        ]
    },
    "academic_tools": {
        "listed_text": [
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=structuralism-mathematics\" target=\"other\">How to cite this entry</a>.",
            "<img alt=\"sep man icon\" src=\"../../symbols/sepman-icon.jpg\"/>",
            "<a href=\"https://leibniz.stanford.edu/friends/preview/structuralism-mathematics/\" target=\"other\">Preview the PDF version of this entry</a> at the\n <a href=\"https://leibniz.stanford.edu/friends/\" target=\"other\">Friends of the SEP Society</a>.",
            "<img alt=\"inpho icon\" src=\"../../symbols/inpho.png\"/>",
            "<a href=\"https://www.inphoproject.org/entity?sep=structuralism-mathematics&amp;redirect=True\" target=\"other\">Look up topics and thinkers related to this entry</a>\n at the Internet Philosophy Ontology Project (InPhO).",
            "<img alt=\"phil papers icon\" src=\"../../symbols/pp.gif\"/>",
            "<a href=\"https://philpapers.org/sep/structuralism-mathematics/\" target=\"other\">Enhanced bibliography for this entry</a>\nat <a href=\"https://philpapers.org/\" target=\"other\">PhilPapers</a>, with links to its database."
        ],
        "listed_links": [
            {
                "https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=structuralism-mathematics": "How to cite this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/preview/structuralism-mathematics/": "Preview the PDF version of this entry"
            },
            {
                "https://leibniz.stanford.edu/friends/": "Friends of the SEP Society"
            },
            {
                "https://www.inphoproject.org/entity?sep=structuralism-mathematics&redirect=True": "Look up topics and thinkers related to this entry"
            },
            {
                "https://philpapers.org/sep/structuralism-mathematics/": "Enhanced bibliography for this entry"
            },
            {
                "https://philpapers.org/": "PhilPapers"
            }
        ]
    },
    "other_internet_resources": {
        "listed_text": [
            "Ketland, J., 2015, \n “<a href=\"https://www.academia.edu/7673229/Abstract_Structure\" target=\"other\">Abstract Structure</a>”,\nunpublished manuscript.",
            "<a href=\"https://www.iep.utm.edu/m-struct/\" target=\"other\">Mathematical Structuralism</a>, by Stewart Shapiro, <em>Internet Encyclopedia of Philosophy</em>. "
        ],
        "listed_links": [
            {
                "https://www.academia.edu/7673229/Abstract_Structure": "Abstract Structure"
            },
            {
                "https://www.iep.utm.edu/m-struct/": "Mathematical Structuralism"
            }
        ]
    }
}